Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/extragear-sysadmin/desktop_extragear-sysadmin_libqapt.po
Languages: de

# Name
source: Update package information
de: Paketinformation aktualisieren

# Description
source: To update the software catalog you need to authenticate.
de: Zur Aktualisierung Ihres Software-Katalogs müssen Sie sich authentifizieren.

# Name
source: Install or remove packages
de: Pakete installieren oder entfernen

# Description
source: To install or remove software you need to authenticate.
de: Zum Installieren oder Entfernen von Software müssen Sie sich authentifizieren.

# Name
source: Change software configuration
de: Software-Einstellungen ändern

# Description
source: To change software settings you need to authenticate.
de: Um Software-Einstellungen zu ändern, müssen Sie sich authentifizieren.

# Name
source: Cancel the task of another user
de: Laufendes Programm eines anderen Benutzers abbrechen

# Description
source: To cancel someone else's software changes you need to authenticate.
de: Um die Software eines anderen Benutzers abzubrechen, müssen Sie sich authentifizieren.

# Name
source: Installer
de: Installationsprogramm

# Comment
source: Suggests the installation of not-installed applications
de: Schlägt die Installation von Anwendungen vor, die nicht installiert sind

# Name
source: QApt Package Installer
de: QApt-Pakeinstallationsprogramm

# GenericName
source: Package Installer
de: Pakeinstallationsprogramm

# Comment
source: Install and view software packages
de: Software-Pakete installieren und betrachten

# Name
source: Debian Package Files
de: Debian-Paketdateien
