Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/extragear-sysadmin/desktop_extragear-sysadmin_muon.po
Languages: de

# Name
source: Application dashboard
de: Anwendungsübersicht

# Comment
source: Intended as Application dashboard default
de: Als Voreinstellung für Anwendungsübersicht angedacht

# Name
source: Install More...
de: Mehr installieren ...

# GenericName
source: Software Center
de: Programmverwaltung

# Keywords
source: program;software;repository;package;install;remove;update;apps;applications;
de: Programm;Software;Archiv;Repository;Paket;Installieren;Entfernen;Aktualisieren;deb;Programme;Anwendungen;

# Name
source: Muon Software Center
de: Muon-Programmverwaltung

# Comment
source: Install and browse applications in Chakra
de: Anwendungen in Chakra Installieren und durchsuchen

# GenericName
source: Chakra Support
de: Unterstützung für Chakra

# Name
source: Muon Akabei Notifier
de: Muon-Akabei-Benachrichtigung

# Name
source: Muon Application Notifier
de: Muon-Anwendungs-Benachrichtigung

# Comment
source: Muon Application Backend Notifier
de: Muon-Dienstprogramm für Anwendungs-Benachrichtigungen

# Name
source: Upgrade Available
de: Paketaktualisierung verfügbar

# Comment
source: A new version of Kubuntu is available
de: Eine neue Version von Kubuntu ist verfügbar

# Comment
source: Install and browse applications in APT
de: Anwendungen in APT Installieren und durchsuchen

# Name
source: Applications Backend
de: Dienstprogramm für Anwendungen

# GenericName
source: APT Support
de: Unterstützung für APT

# Name
source: Bodega Wallpapers
de: Bodega-Hintergrundbilder

# GenericName
source: Wallpapers
de: Hintergrundbilder

# Comment
source: Install new, awesome wallpapers for your KDE!
de: Installiert neue fantastische Hintergrundbilder für Ihr KDE-System.

# Comment
source: It's some dummy backend for testing purposes
de: Ein Dummy-Backend zu Testzwecken

# Name
source: Muon Dummy Notifier
de: Muon-Benachrichtigung-Attrappe

# Comment
source: Install comic stripes to be used from the comics plasmoid
de: Installation von Comics, die vom gleichnamigen Plasmoid benutzt werden

# Name
source: Plasmoids
de: Plasmoide

# GenericName
source: Plasmoids
de: Plasmoide

# Comment
source: Install plasmoids and raise the power of your workspace!
de: Installieren Sie Plasmoide und steigern Sie die Leistungsfähigkeit Ihrer Arbeitsumgebung.

# Comment
source: Install and browse applications in PackageKit
de: Anwendungen in PackageKit Installieren und durchsuchen

# Name
source: PackageKit Support
de: Unterstützung für PackageKit

# GenericName
source: Applications Backend
de: Dienstprogramm für Anwendungen

# Name
source: Muon PackageKit Notifier
de: Muon-PackageKit-Benachrichtigung

# Name
source: Updates Are Available
de: Es sind Aktualisierungen verfügbar

# Comment
source: Updates Available
de: Es sind Aktualisierungen verfügbar

# Name
source: Muon Package Manager
de: Muon-Paketverwaltung

# GenericName
source: Package Manager
de: Paketverwaltung

# X-KDE-Keywords
source: program,software,repository,archive,package,install,remove,update,deb
de: Programm,Software,Archiv,Repository,Paket,Installieren,Entfernen,Aktualisieren,deb

# Name
source: Muon Update Manager
de: Muon-Aktualisierungsverwaltung

# GenericName
source: Update Manager
de: Aktualisierungsverwaltung
