Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/applications/kdepasswd.po
Languages: de

source: Password &amp; User Account
de: Passwort &amp; Benutzerzugang

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Thomas</firstname><surname>Reitelbach</surname><affiliation><address><email>tr@erdfunkstelle.de</email></address></affiliation><contrib>Deutsche Übersetzung</contrib></othercredit>

source: System Settings
de: Systemeinstellungen

source: user
de: Benutzer

source: account
de: Zugang

source: password
de: Passwort

source: User Information
de: Benutzerinformationen

source: Introduction
de: Einführung

source: Screenshot of the User Account Manager
de: Bildschirmfoto der Benutzerverwaltung

source: The User Account Manager
de: Die Benutzerverwaltung

source: This is a system settings module to enter user information and configure basic user settings such as the password and icon. This information and these settings will be used by various &kde; applications (mail programs and word processors for example) if they are filled. You can:
de: Dies ist ein Modul für die Systemeinstellungen, mit dem Benutzerinformationen und einige grundlegende Einstellungen festgelegt werden können (z. B. Passwort und Benutzerbild). Die hier eingestellten Informationen werden von verschiedenen KDE-Anwendungen verwendet (z. B. E-Mail- oder Textverarbeitungsprogramme). Sie können:

source: change your user icon
de: Ihr Anmeldungs-Symbol ändern

source: change your user login password
de: Ihr Anmeldungs-Passwort ändern

source: fill in personal information
de: Persönliche Angaben eintragen

source: set up the password prompt
de: Die Eingabeaufforderung für das Passwort einstellen

source: User Icon and Password
de: Benutzersymbol und -passwort

source: User Icon
de: Benutzerbild

source: This icon is used when the user logs in using a login manager. Clicking on it will allow you to change the image, either by using a provided icon or by setting one of your own. Click <guibutton>Apply</guibutton> to validate your change.
de: Dieses Benutzerbild wird angezeigt, wenn Sie sich mit einem Anmeldungsmanager anmelden. Wenn Sie darauf klicken, können Sie ein neues Bild aus der mitgelieferten Galerie aussuchen, oder ein eigenes Bild angeben. Klicken Sie anschließend auf <guibutton>Anwenden</guibutton>, um Ihre Änderungen zu übernehmen.

source: Change password...
de: Passwort ändern ...

source: Clicking this button will display a dialog to change your user password. Your user password is the one you log in to your system with. You will be asked for your current password then twice for your new password.
de: Klicken Sie auf diesen Knopf, so können Sie Ihr Anmeldungs-Passwort ändern. Dies ist das Passwort, mit dem Sie sich am Rechner anmelden. Sie werden zuerst nach Ihrem bisherigen Passwort gefragt; anschließend müssen Sie das neue Passwort zweimal eingeben.

source: Enter here the full name of the user.
de: Geben Sie hier den vollständigen Namen ein (in der Regel Vor- und Nachname).

source: Organization
de: Organisation

source: You can add the business or group that the user would like to be associated with.
de: Hier können Sie den Beruf oder die Gruppe eintragen, mit der der Benutzer in Verbindung gebracht wird.

source: Email address:
de: E-Mail-Adresse:

source: Enter here the email address which will be associated with this user.
de: Geben Sie hier die E-Mail-Adresse des Benutzers ein.

source: You can indicate here a local smtp server for sending mail within a network.
de: Hier können Sie einen Mailserver eintragen, der im lokalen Netzwerk E-Mails ausliefert.

source: User ID
de: Benutzer-ID

source: This is for information only, it gives you your User ID. This number is defined in <filename>/etc/passwd</filename> and was set when your user account was created.
de: Dieses Feld dient nur Ihrer Information; hier wird die Benutzerkennung angezeigt. Diese ist in <filename>/etc/passwd</filename> eingetragen und wurde beim Erstellen des Benutzerkontos erzeugt (Sie keine Änderung vornehmen).

source: At Password Prompt
de: Bei der Passworteingabe

source: This section allows you to choose what you want displayed when you input your password when you are asked for it. The default is to have one bullet for each letter you type. You can change that to have three bullets for each letter you type (making it more difficult to guess the number of letters if someone else is looking). You can also choose to have nothing displayed while you type your password, making this operation even more secure.
de: Hier können Sie einstellen, wie Passworteingaben aussehen sollen. In der Voreinstellung wird für jeden Buchstaben ein Punkt angezeigt. Sie können hier aber auch einstellen, dass je Buchstabe drei Punkte angezeigt werden. So ist es für Zuschauer schwieriger, zu erraten, wie viele Buchstaben Ihr Passwort hat. Sie können sogar einstellen, dass gar nichts angezeigt wird, wodurch die Passworteingabe noch sicherer wird.
