Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/applications/kfind_man-kfind.1.po
Languages: de

source: KDE User's Manual
de: KDE-Benutzerhandbuch

source: file find utility for &kde;
de: Hilfsmittel zum Suchen von Dateien unter &kde;

source: <command>kfind</command> <group choice="opt"><option>searchpath</option></group> <arg choice="opt">KDE Generic Options</arg> <arg choice="opt">Qt Generic Options</arg>
de: <command>kfind</command> <group choice="opt"><option>Suchpfad</option></group> <arg choice="opt">Allgemeine KDE-Optionen</arg> <arg choice="opt">Allgemeine Qt-Optionen</arg>

source: Description
de: Beschreibung

source: The Find Files tool is a useful method of searching for specific files on your computer, or for searching for files that match a pattern. An example of this could include searching for files of a particular type or with certain letters in the filename, or that contain a certain piece of text in their contents.
de: Kfind ist ein nützliches Hilfsmittel zum Suchen und Auffinden besonderer Dateien auf Ihrem Rechner oder zum Suchen von Dateien, die einem bestimmten Muster entsprechen. So können Sie beispielsweise Dateien eines bestimmten Typs, mit bestimmten Buchstaben im Dateinamen oder mit einem bestimmten Text im Dateiinhalt suchen.

source: &kfind; is a graphical tool, and not normally run from the command line.
de: &kfind; hat eine grafische Benutzeroberfläche und ist eigentlich nicht für die Verwendung mit der Befehlszeile gedacht.

source: Options
de: Optionen

source: searchpath
de: Suchpfad

source: You may optionally supply a colon separated path to prefill the dialog. You might use this ability to set up different icons on your panel or desktop to quickly run searches in different locations.
de: Sie können (optional) durch Kommata getrennte Pfade eingeben, um den Dialog bereits teilweise auszufüllen. Sie können diese Möglichkeit zum Beispiel dazu verwenden, verschiedene Verknüpfungen auf Ihrer Arbeitsfläche zu erstellen, von der jede an verschiedenen Orten sucht.

source: See Also
de: Weiterführende Informationen

source: More detailed user documentation is available from <ulink url="help:/kfind">help:/kfind</ulink> (either enter this <acronym>URL</acronym> into &konqueror;, or run <userinput><command>khelpcenter</command> <parameter>help:/kfind</parameter></userinput>).
de: Eine ausführliche Dokumentation erhalten Sie, indem Sie in der Adressleiste von Konqueror <ulink url="help:/kfind">help:/kfind</ulink> eingeben, oder den Befehl <userinput><command>khelpcenter</command> <parameter>help:/kfind</parameter></userinput> ausführen).

source: Authors
de: Autoren

source: A list of contributors is available in the complete user manual available in khelpcenter.
de: Eine Liste der Entwickler finden Sie im Benutzerhandbuch, das Sie über das Hilfezentrum von &kde; erreichen.

source: This documentation was prepared by &Lauri.Watts; &Lauri.Watts.mail;
de: Diese Dokumentation wurde von &Lauri.Watts; &Lauri.Watts.mail; aufbereitet.
