Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/applications/konqueror.po
Languages: de

source: <menuchoice> <shortcut> <keycombo action="simul">&Ctrl;<keycap>S</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guisubmenu>Selection</guisubmenu> <guimenuitem>Select Items Matching...</guimenuitem></menuchoice> (File Manager mode)
de: <menuchoice><shortcut> <keycombo action="simul">&Ctrl;<keycap>S</keycap></keycombo> </shortcut> <guimenu>Bearbeiten</guimenu> <guisubmenu>Auswahl</guisubmenu> <guimenuitem>Passende Einträge auswählen ...</guimenuitem></menuchoice> (Dateiverwaltungs-Modus)

source: Together with the <guimenuitem>Unselect Items Matching...</guimenuitem>, <guimenuitem>Unselect All</guimenuitem> and <guimenuitem>Invert Selection</guimenuitem> commands, this provides an easy and powerful way of selecting multiple files.
de: Ergibt zusammen mit den Befehlen <guimenuitem>Auswahl für passende Einträge aufheben</guimenuitem>, <guimenuitem>Auswahl aufheben</guimenuitem> und <guimenuitem>Auswahl umkehren</guimenuitem> ein einfaches und leistungsfähiges Werkzeug zum Auswählen mehrerer Dateien.

source: It brings up a simple dialog box where you can enter a file name using the wild card characters * and ?, for example entering <literal role="extension">*.html</literal> will select all files ending with <literal role="extension">.html</literal> while <filename>?a*</filename> will select all files which have the letter a as the second character in their filename.
de: Es wird ein kleines Dialogfeld geöffnet, in dem Sie einen Dateinamen eingeben können, auch unter Zuhilfenahme von Platzhaltern wie * und ?. Die Eingabe von <literal role="extension">*.html</literal> wählt beispielsweise alle Dateien aus, die mit <literal role="extension">.html</literal> enden, während <filename>?a*</filename> alle Dateien herausfiltert, deren zweiter Buchstabe im Dateiname ein <quote>a</quote> ist.

source: <menuchoice> <guimenu>Edit</guimenu> <guisubmenu>Selection</guisubmenu> <guimenuitem>Unselect Items Matching...</guimenuitem></menuchoice> (File Manager mode)
de: <menuchoice><guimenu>Bearbeiten</guimenu> <guisubmenu>Auswahl</guisubmenu> <guimenuitem>Auswahl für passende Einträge aufheben ...</guimenuitem></menuchoice> (Dateiverwaltungs-Modus)

source: Unselect files or folders via a dialog similar to the one used by <guimenuitem>Select...</guimenuitem>.
de: Hebt die Auswahl von Dateien oder Ordnern mit einem Dialog ähnlich wie unter <guimenuitem>Auswählen ...</guimenuitem> auf.

source: <menuchoice> <shortcut> <keycombo action="simul">&Ctrl;<keycap>A</keycap></keycombo> </shortcut><guimenu>Edit</guimenu> <guisubmenu>Selection</guisubmenu> <guimenuitem>Select All</guimenuitem></menuchoice> (File Manager mode)
de: <menuchoice><shortcut> <keycombo action="simul">&Ctrl;<keycap>A</keycap></keycombo> </shortcut> <guimenu>Bearbeiten</guimenu> <guisubmenu>Auswahl</guisubmenu> <guimenuitem>Alles auswählen</guimenuitem></menuchoice> (Dateiverwaltungs-Modus)

source: Selects all items in a folder; you can then <guimenuitem>Copy</guimenuitem> or <guimenuitem>Cut</guimenuitem> them and <guimenuitem>Paste</guimenuitem> them into a different folder.
de: Wählt alle Einträge in einem Ordner aus. Sie können dann die Einträge mit <guimenuitem>Kopieren</guimenuitem> und <guimenuitem>Einfügen</guimenuitem> in einen anderen Ordner übertragen.

source: <menuchoice> <guimenu>Edit</guimenu> <guisubmenu>Selection</guisubmenu> <guimenuitem>Unselect All</guimenuitem></menuchoice> (File Manager mode)
de: <menuchoice><guimenu>Bearbeiten</guimenu> <guisubmenu>Auswahl</guisubmenu> <guimenuitem>Auswahl aufheben</guimenuitem></menuchoice> (Dateiverwaltungs-Modus)

source: Unselect all selected files or folders.
de: Hebt die Auswahl aller Dateien und Ordner auf.

source: <menuchoice> <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>A</keycap></keycombo> </shortcut><guimenu>Edit</guimenu> <guisubmenu>Selection</guisubmenu> <guimenuitem>Invert Selection</guimenuitem></menuchoice> (File Manager mode)
de: <menuchoice><shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>A</keycap></keycombo> </shortcut> <guimenu>Bearbeiten</guimenu> <guisubmenu>Auswahl</guisubmenu> <guimenuitem>Auswahl umkehren</guimenuitem></menuchoice> (Dateiverwaltungs-Modus)

source: Invert current selection.
de: Kehrt die aktuelle Auswahl um (alle vorher ausgewählten Objekte werden abgewählt und umgekehrt).

source: <menuchoice> <shortcut> <keycombo action="simul">&Ctrl;<keycap>F</keycap></keycombo> </shortcut><guimenu>Edit</guimenu> <guimenuitem>Find...</guimenuitem></menuchoice> (Browser mode)
de: <menuchoice><shortcut> <keycombo action="simul">&Ctrl;<keycap>F</keycap></keycombo> </shortcut> <guimenu>Bearbeiten</guimenu> <guimenuitem>Suchen ...</guimenuitem> </menuchoice>(Browser-Modus)

source: Displays the search bar at the bottom of the current window. Start typing to find a text string in a text page you are previewing or in an &HTML; page.
de: Zeigt die Suchleiste unten im aktuellen Fenster an. Geben Sie die ersten Zeichen des gesuchten Textes an, um passende Texte in der Vorschau einer Text- oder einer <acronym>HTML</acronym>-Seite zu finden.

source: <menuchoice> <shortcut><keycap>F3</keycap></shortcut> <guimenu>Edit</guimenu> <guimenuitem>Find Next</guimenuitem></menuchoice> (Browser mode)
de: <menuchoice><shortcut><keycap>F3</keycap></shortcut> <guimenu>Bearbeiten</guimenu> <guimenuitem>Weitersuchen</guimenuitem></menuchoice> (Browser-Modus)

source: Find the next occurrence of the text string in the text or &HTML; page.
de: Findet das nächste Vorkommen einer Zeichenkette in einem Text oder auf einer <acronym>HTML</acronym>-Seite.

source: <menuchoice> <shortcut><keycombo action="simul">&Shift;<keycap>F3</keycap></keycombo></shortcut> <guimenu>Edit</guimenu> <guimenuitem>Find Previous</guimenuitem></menuchoice> (Browser mode)
de: <menuchoice><shortcut> <keycombo action="simul">&Shift;<keycap>F3</keycap></keycombo> </shortcut> <guimenu>Bearbeiten</guimenu> <guimenuitem>Frühere suchen ...</guimenuitem></menuchoice> (Browser-Modus)

source: Find the previous occurrence of the text string in the text or &HTML; page.
de: Findet das nächste Vorkommen einer Zeichenkette in einem Text oder auf einer &HTML;-Seite.

source: The View Menu
de: Das Menü Ansicht

source: <guimenu>View</guimenu> <guisubmenu>View Mode</guisubmenu>
de: <guimenu>Ansicht</guimenu> <guisubmenu>Anzeigemodus</guisubmenu>

source: In browser mode this submenu holds items to select embedded views like <guimenuitem>KHTML</guimenuitem>, <guimenuitem>Embedded Advanced Text Editor</guimenuitem> and more embedded views.
de: Im Browser-Modus finden Sie in diesem Menü Einträge, um eingebettete Ansichten wie <guimenuitem>KHTML</guimenuitem>, <guimenuitem>Erweiterte Editorkomponente</guimenuitem> und weitere Ansichten zu benutzen.

source: In file manager mode this submenu holds items to select <guimenuitem>Icon</guimenuitem>, <guimenuitem>Details</guimenuitem>, <guimenuitem>Compact</guimenuitem>, <guimenuitem>Terminal Emulator</guimenuitem> and more view modes.
de: Im Dateiverwaltungs-Modus enthält dieses Menü Einträge für Ansichten als <guimenuitem>Symbole</guimenuitem>, <guimenuitem>Details</guimenuitem>, <guimenuitem>Kompakt</guimenuitem>, <guimenuitem>Terminal-Emulator</guimenuitem> und weitere Ansichtsmodi.

source: <menuchoice> <guimenu>View</guimenu> <guimenuitem>Use index.html</guimenuitem> </menuchoice> (File Manager mode)
de: <menuchoice><guimenu>Ansicht</guimenu> <guimenuitem>index.html benutzen</guimenuitem></menuchoice> (Dateiverwaltungs-Modus)

source: If a selected folder contains a file <filename>index.html</filename>, it will be opened as a web page rather than showing the folder as a list of files.
de: Wenn ein ausgewählter Ordner eine Datei namens <filename>index.html</filename> enthält, so werden nicht die Dateien im Ordner aufgelistet, sondern der Ordner wird als Internetseite angezeigt.

source: <guimenu>View</guimenu> <guimenuitem>Lock to Current Location</guimenuitem>
de: <guimenu>Ansicht</guimenu> <guimenuitem>Ansicht einfrieren</guimenuitem>

source: A locked view cannot change folders. Use in combination with <guimenuitem>Link View</guimenuitem> to explore many files from one folder.
de: Eingefrorene Ansichten können keine anderen Ordner anzeigen. Verwenden Sie die Option zusammen mit <guimenuitem>Ansicht verknüpfen</guimenuitem>, um Dateiinhalte betrachten zu können..

source: <guimenu>View</guimenu> <guimenuitem>Link View</guimenuitem>
de: <guimenu>Ansicht</guimenu> <guimenuitem>Ansicht verknüpfen</guimenuitem>

source: Link current view to others in a multiple view window. A linked view follows folder changes made in other linked views. This is especially useful with different types of views, such as a folder tree with an icon view or detailed view, and possibly a terminal emulator window.
de: Verknüpft die aktuelle Ansicht mit anderen Ansichten im selben Fenster. Bei verknüpften Ansichten wird das Wechseln eines Ordners in allen verknüpften Ansichten ausgeführt. Dies ist insbesondere bei verschiedenen Ansichten sinnvoll, wie die Verknüpfung einer Baumansicht mit einer Symbolansicht oder einer Detailansicht und eventuell einem Terminal-Emulator.

source: <shortcut><keycap>F5</keycap></shortcut> <guimenu>View</guimenu> <guimenuitem>Reload</guimenuitem>
de: <shortcut><keycap>F5</keycap></shortcut> <guimenu>Ansicht</guimenu> <guimenuitem>Erneut laden</guimenuitem>

source: Reload.
de: Das Objekt erneut laden.

source: <shortcut>&Esc;</shortcut> <guimenu>View</guimenu> <guimenuitem>Stop</guimenuitem>
de: <shortcut>&Esc;</shortcut> <guimenu>Ansicht</guimenu> <guimenuitem>Stopp</guimenuitem>

source: Stop load (particularly useful when web browsing).
de: Stoppt den Ladevorgang (insbesondere bei Internet-Seiten nützlich).

source: <menuchoice> <shortcut><keycombo action="simul">&Ctrl;<keycap>+</keycap></keycombo></shortcut> <guimenu>View</guimenu> <guimenuitem>Enlarge Font</guimenuitem></menuchoice> / <menuchoice> <shortcut><keycombo action="simul">&Ctrl;<keycap>-</keycap></keycombo></shortcut> <guimenu>View</guimenu> <guimenuitem>Shrink Font</guimenuitem></menuchoice> (Browser mode)
de: <menuchoice> <shortcut><keycombo action="simul">&Ctrl;<keycap>+</keycap></keycombo></shortcut> <guimenu>Ansicht</guimenu> <guimenuitem>Schrift vergrößern</guimenuitem></menuchoice> / <menuchoice> <shortcut><keycombo action="simul">&Ctrl;<keycap>-</keycap></keycombo></shortcut> <guimenu>Ansicht</guimenu> <guimenuitem>Schrift verkleinern</guimenuitem></menuchoice> (Browser-Modus)

source: Use these to adjust the size of the text in the page if you find it difficult to read. How well this works will depend on how the web page has been constructed.
de: Falls es Ihnen schwer fällt, die Schrift auf einer Internetseite zu lesen, können Sie hiermit die Textgröße anpassen. Ob dieses Verfahren funktioniert oder nicht, hängt jedoch davon ab, wie die Web-Seite aufgebaut wurde.

source: <menuchoice> <shortcut><keycombo action="simul">&Ctrl;<keycap>U</keycap> </keycombo> </shortcut> <guimenu>View</guimenu> <guimenuitem>View Document Source</guimenuitem></menuchoice> (Browser mode - KHTML view)
de: <menuchoice><shortcut><keycombo action="simul">&Ctrl;<keycap>U</keycap> </keycombo> </shortcut> <guimenu>Ansicht</guimenu> <guimenuitem>Quelltext anzeigen</guimenuitem></menuchoice> (Browser-Modus - KHTML-Anzeigemodus)

source: View document source text.
de: Quelltext des Dokuments anzeigen.

source: Only available if you are viewing a document or &HTML; page.
de: Nur verfügbar, wenn Sie ein Dokument oder eine &HTML;-Seite betrachten.

source: <menuchoice> <guimenu>View</guimenu> <guimenuitem>View Frame Source</guimenuitem></menuchoice> (Browser mode)
de: <menuchoice><guimenu>Ansicht</guimenu> <guimenuitem>Rahmen-Quelltext anzeigen</guimenuitem></menuchoice> (Browser-Modus)

source: View frame source text
de: Rahmen-Quelltext anzeigen

source: Only applies if you are viewing a web site that uses frames. Similar to <guimenuitem>View Document Source</guimenuitem>.
de: Gilt nur, wenn Sie eine Website besuchen, die Rahmen verwendet. Ähnlich wie <guimenuitem>Quelltext anzeigen</guimenuitem>.

source: <menuchoice> <shortcut><keycombo action="simul">&Ctrl;<keycap>I</keycap> </keycombo> </shortcut> <guimenu>View</guimenu> <guimenuitem>View Document Information</guimenuitem></menuchoice> (Browser mode - KHTML view)
de: <menuchoice><shortcut><keycombo action="simul">&Ctrl;<keycap>I</keycap> </keycombo> </shortcut> <guimenu>Ansicht</guimenu> <guimenuitem>Dokumentinformation anzeigen</guimenuitem></menuchoice> (Browser-Modus - KHTML-Anzeigemodus)

source: View document information, such as title, &URL;, and &HTTP; headers used in retrieving the document.
de: Dokumentinformation anzeigen, zum Beispiel Titel, &URL; und &HTTP;-Header des Dokuments.

source: Only available if you are viewing an &HTML; page.
de: Nur verfügbar, wenn Sie eine &HTML;-Seite betrachten.

source: <menuchoice> <guimenu>View</guimenu> <guimenuitem>Set Encoding</guimenuitem></menuchoice> (Browser mode)
de: <menuchoice><guimenu>Ansicht</guimenu> <guimenuitem>Kodierung festlegen</guimenuitem></menuchoice> (Browser-Modus)

source: Allows you to choose the character encoding used to display &HTML; pages. <guimenuitem>Default</guimenuitem> is usually the best choice.
de: Erlaubt Ihnen die Einstellung des Zeichensatzes für die Anzeige von &HTML;-Seiten. Gewöhnlich ist <guimenuitem>Standard</guimenuitem> die beste Wahl.

source: <menuchoice> <guimenu>View</guimenu> <guisubmenu>Sort By</guisubmenu></menuchoice> (File Manager mode)
de: <menuchoice><guimenu>Ansicht</guimenu> <guisubmenu>Sortieren nach</guisubmenu></menuchoice> (Dateiverwaltungs-Modus)

source: <action>Changes whether items are sorted</action> by <guimenuitem>Name</guimenuitem> or other criteria described in <link linkend="dolphin-view-information">Information in the View</link>.
de: <action>Ändert ob die Einträge</action> nach den <guimenuitem>Name</guimenuitem> oder anderen in <link linkend="dolphin-view-information">Informationen in der Ansicht</link> definierten Kriterien sortiert werden.

source: <guimenuitem>Descending</guimenuitem> reverses the sort order. <guimenuitem>Folders First</guimenuitem> sorts folders before files.
de: Durch Auswahl von <guimenuitem>Absteigend</guimenuitem> wird die Sortierreihenfolge umgekehrt. <guimenuitem>Ordner zuerst</guimenuitem> zeigt die Ordner vor den Dateien an.

source: <menuchoice> <guimenu>View</guimenu> <guisubmenu>Additional Information</guisubmenu></menuchoice> (File Manager mode)
de: <menuchoice><guimenu>Ansicht</guimenu> <guisubmenu>Zusätzliche Informationen</guisubmenu></menuchoice> (Dateiverwaltungs-Modus)

source: <action>Displays additional information</action> described in <link linkend="dolphin-view-information">Information in the View</link>.
de: <action>Zeigt die zusätzlichen Informationen</action>, die im Abschnitt <link linkend="dolphin-view-information">Informationen in der Ansicht</link> beschrieben werden.

source: <menuchoice> <guimenu>View</guimenu> <guimenuitem>Preview</guimenuitem></menuchoice> (File Manager mode)
de: <menuchoice><guimenu>Ansicht</guimenu> <guimenuitem>Vorschau</guimenuitem></menuchoice> (Dateiverwaltungs-Modus)

source: <action>Displays a symbolic preview of the file contents </action> in the different view modes.
de: <action>Zeigt in den verschiedenen Ansichtsmodi eine Vorschau</action> des Dateiinhaltes anstelle des Symbols an.

source: <menuchoice> <guimenu>View</guimenu> <guimenuitem>Show in Groups</guimenuitem></menuchoice> (File Manager mode)
de: <menuchoice><guimenu>Ansicht</guimenu> <guimenuitem>Elemente gruppieren</guimenuitem></menuchoice> (Dateiverwaltungs-Modus)

source: <action>Displays</action> the content of the current folder grouped by the option selected in <guimenuitem>Sort By</guimenuitem> (only available in the Icons view mode).
de: <action>Zeigt</action> den Ordnerinhalt gruppiert nach der Eigenschaft an, die unter <guimenuitem>Sortieren nach</guimenuitem> ausgewählt wurde. Dies ist nur in der Symbol-Ansicht möglich.

source: <menuchoice> <shortcut> <keycombo action="simul">&Alt;<keycap>.</keycap></keycombo> </shortcut> <guimenu>View</guimenu> <guimenuitem>Show Hidden Files</guimenuitem></menuchoice> (File Manager mode)
de: <menuchoice><shortcut> <keycombo action="simul">&Alt;<keycap>.</keycap></keycombo> </shortcut> <guimenu>Ansicht</guimenu> <guimenuitem>Versteckte Dateien anzeigen</guimenuitem></menuchoice> (Dateiverwaltungs-Modus)

source: Shows all the hidden files and sub-folders within the current folder.
de: Durch Auswahl dieser Einstellung werden alle versteckten Dateien und Ordner im aktuellen Ordner angezeigt.

source: <menuchoice> <guimenu>View</guimenu> <guimenuitem>Adjust View Properties...</guimenuitem></menuchoice> (File Manager mode)
de: <menuchoice><guimenu>Bearbeiten</guimenu> <guimenuitem>Ansicht anpassen ...</guimenuitem></menuchoice> (Dateiverwaltungs-Modus)

source: Opens the <link linkend="view-properties-dialog">View Properties Dialog</link>.
de: Öffnet den Dialog <link linkend="view-properties-dialog">Ansichts-Eigenschaften</link>.

source: The Go Menu
de: Das Menü Gehe zu

source: <shortcut> <keycombo action="simul">&Alt;<keysym>Up</keysym></keycombo> </shortcut><guimenu>Go</guimenu> <guimenuitem>Up</guimenuitem>
de: <shortcut> <keycombo action="simul">&Alt;<keysym>Pfeil hoch</keysym></keycombo> </shortcut> <guimenu>Gehe zu</guimenu> <guimenuitem>Aufwärts</guimenuitem>

source: Go up a level in the folder hierarchy.
de: Geht in der Ordnerhierarchie eine Ebene höher.

source: <shortcut> <keycombo action="simul">&Alt;<keysym>Left</keysym></keycombo> </shortcut><guimenu>Go</guimenu> <guimenuitem>Back</guimenuitem>
de: <shortcut> <keycombo action="simul">&Alt;<keysym>Pfeil links</keysym></keycombo> </shortcut> <guimenu>Gehe zu</guimenu> <guimenuitem>Zurück</guimenuitem>

source: Go back to the previous view.
de: Geht zur vorherigen Ansicht zurück.

source: <shortcut> <keycombo action="simul">&Alt;<keysym>Right</keysym></keycombo> </shortcut><guimenu>Go</guimenu> <guimenuitem>Forward</guimenuitem>
de: <shortcut> <keycombo action="simul">&Alt;<keysym>Pfeil rechts</keysym></keycombo> </shortcut><guimenu>Gehe zu</guimenu> <guimenuitem>Nach vorne</guimenuitem>

source: You can only go forward if you've previously gone back.
de: Geht vorwärts zum nächsten Objekt. Funktioniert nur, wenn Sie gerade zurück gegangen sind

source: <menuchoice> <shortcut> <keycombo action="simul">&Alt;<keycap>Home</keycap></keycombo> </shortcut><guimenu>Go</guimenu> <guimenuitem>Home Page</guimenuitem></menuchoice> (Browser mode)
de: <menuchoice><shortcut> <keycombo action="simul">&Alt;<keycap>Pos1</keycap></keycombo> </shortcut><guimenu>Gehe zu</guimenu> <guimenuitem>Startseite</guimenuitem></menuchoice> (Browser-Modus)

source: Go to your home page as defined on the <guilabel>General</guilabel> page of the settings dialog.
de: Öffnet die Startseite, die im Einrichtungsdialog auf der Seite <guilabel>Allgemein</guilabel> festgelegt ist.

source: <menuchoice> <shortcut> <keycombo action="simul">&Alt;<keycap>Home</keycap></keycombo> </shortcut><guimenu>Go</guimenu> <guimenuitem>Home Folder</guimenuitem></menuchoice> (File Manager mode)
de: <menuchoice><shortcut> <keycombo action="simul">&Alt;<keycap>Pos1</keycap></keycombo> </shortcut><guimenu>Gehe zu</guimenu> <guimenuitem>Persönlicher Ordner </guimenuitem></menuchoice> (Dateiverwaltungs-Modus)

source: <action>Changes</action> to the users home folder, &eg;, /home/Peter/.
de: <action>Wechselt</action> in den persönlichen Ordner, &eg; /home/thomas.

source: <menuchoice> <guimenu>Go</guimenu> <guimenuitem>Applications</guimenuitem></menuchoice> (File Manager mode)
de: <menuchoice><guimenu>Gehe zu</guimenu> <guimenuitem>Programme</guimenuitem></menuchoice> (Dateiverwaltungs-Modus)

source: Open the folder holding your applications.
de: Öffnet den Ordner mit Ihren Programmen

source: <menuchoice> <guimenu>Go</guimenu> <guimenuitem>Network Folder</guimenuitem></menuchoice> (File Manager mode)
de: <menuchoice><guimenu>Gehe zu</guimenu><guimenuitem>Netzwerkordner</guimenuitem></menuchoice> (Dateiverwaltungs-Modus)

source: Network folders show up in a special location of &konqueror; and &dolphin; called a virtual folder. You can find more information on how to use this folder in the <ulink url="help:/knetattach/index.html">KNetAttach Handbook</ulink>.
de: Netzwerkordner werden als sogenannte virtuelle Ordner in &konqueror; und &dolphin; angezeigt. Weitere Informationen zum Netzwerkordner finden Sie im <ulink url="help:/knetattach/index.html">Handbuch zu KNetAttach</ulink>.

source: <menuchoice> <guimenu>Go</guimenu> <guimenuitem>Settings</guimenuitem></menuchoice> (File Manager mode)
de: <menuchoice><guimenu>Gehe zu</guimenu> <guimenuitem>Einstellungen</guimenuitem></menuchoice> (Dateiverwaltungs-Modus)

source: Open a virtual folder with all &systemsettings; modules in <guimenuitem>Icons</guimenuitem>, <guimenuitem>Details</guimenuitem> or <guimenuitem>Columns</guimenuitem> view. Select an item to display the settings module in a separate dialog window.
de: Öffnet einen virtuellen Ordner mit allen &systemsettings;-Modulen in der <guimenuitem>Symbolansicht</guimenuitem>-, <guimenuitem>Detailansicht</guimenuitem> oder <guimenuitem>Spaltenansicht</guimenuitem>. Wählen Sie einen Eintrag, dann wird das Modul in einen eigenen Dialogfenster geöffnet.

source: <menuchoice> <guimenu>Go</guimenu> <guimenuitem>Trash</guimenuitem></menuchoice> (File Manager mode)
de: <menuchoice><guimenu>Gehe zu</guimenu> <guimenuitem>Papierkorb</guimenuitem></menuchoice> (Dateiverwaltungs-Modus)

source: Open your <filename class="directory">Trash</filename> folder.
de: Öffnet Ihren Ordner <filename class="directory">Papierkorb</filename>.

source: <menuchoice> <guimenu>Go</guimenu> <guimenuitem>Autostart</guimenuitem></menuchoice> (File Manager mode)
de: <menuchoice><guimenu>Gehe zu</guimenu> <guimenuitem>Autostart</guimenuitem></menuchoice> (Dateiverwaltungs-Modus)

source: Open your <filename class="directory">Autostart</filename> folder.
de: Öffnet Ihren Ordner <filename class="directory">Autostart</filename>.

source: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>H</keycap></keycombo> </shortcut><guimenu>Go</guimenu> <guimenuitem>Show History</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>H</keycap></keycombo> </shortcut><guimenu>Gehe zu</guimenu> <guimenuitem>Verlauf anzeigen </guimenuitem>

source: shows a tree view of your browsing history in a separate window. See <link linkend="sidebar">Sidebar</link>.
de: Zeigt in einer Baumansicht den Verlauf der bisher besuchten Webseiten in einem eigenen Fenster. Siehe auch <link linkend="sidebar">Navigationsbereich</link>.

source: <guimenu>Go</guimenu> <guisubmenu>Most Often Visited</guisubmenu>
de: <guimenu>Gehe zu</guimenu> <guisubmenu>Meist besuchte</guisubmenu>

source: Displays a submenu showing the &URL;s you visit most often. Selecting one of these will make &konqueror; open that &URL;.
de: Zeigt ein Untermenü mit den Adressen (&URL;s) an, die Sie am häufigsten besucht haben. Wenn Sie eine davon auswählen, öffnet &konqueror; die entsprechende Adresse.

source: <guimenu>Go</guimenu> <guisubmenu>Recently Visited</guisubmenu>
de: <guimenu>Gehe zu</guimenu> <guisubmenu>Zuletzt besuchte</guisubmenu>

source: Displays a submenu showing the &URL;s you recently visited. Selecting one of these will make &konqueror; open that &URL;.
de: Zeigt ein Untermenü mit den Adressen (&URL;s) an, die Sie am zuletzt besucht haben. Wenn Sie eine davon auswählen, öffnet &konqueror; die entsprechende Adresse.

source: <guimenu>Go</guimenu> <guisubmenu>Closed Items</guisubmenu>
de: <guimenu>Gehe zu</guimenu> <guisubmenu>Geschlossene Objekte</guisubmenu>
