Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/applications/konqueror.po
Languages: de

source: Displays a submenu showing the closed &URL;s you visit. Selecting one of these will make &konqueror; open that &URL;. Use <guimenuitem>Empty Closed Items History</guimenuitem> to clear the submenu.
de: Zeigt ein Untermenü mit den besuchten Adressen (&URL;s) an, die Sie geschlossen haben. Wenn Sie eine davon auswählen, öffnet &konqueror; die entsprechende Adresse. Mit <guimenuitem>Verlaufsspeicher für geschlossene Objekte leeren</guimenuitem> können Sie alle Einträge in diesem Untermenü entfernen.

source: The Bookmarks Menu
de: Das Menü Lesezeichen

source: See the section <link linkend="bookmarks">Using Bookmarks</link> in this manual for a fuller description of these menu items.
de: Im Abschnitt <link linkend="bookmarks">Verwendung von Lesezeichen</link> dieses Handbuches finden Sie eine umfassende Beschreibung dieser Menüeinträge.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>B</keycap></keycombo> </shortcut> <guimenu>Bookmarks</guimenu> <guimenuitem>Add Bookmark</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>B</keycap></keycombo> </shortcut> <guimenu>Lesezeichen</guimenu> <guimenuitem>Lesezeichen hinzufügen</guimenuitem>

source: Add current selection to your bookmarks.
de: Fügt die aktuelle Auswahl zu den eigenen Lesezeichen hinzu.

source: <guimenu>Bookmarks</guimenu> <guimenuitem>Bookmark Tabs as Folder...</guimenuitem>
de: <guimenu>Lesezeichen</guimenu> <guimenuitem>Unterfenster als Lesezeichenordner ...</guimenuitem>

source: Create a bookmark folder containing links to all of the &URL;s currently open in &konqueror; tabs.
de: Erzeugt einen Lesezeichenordner mit den Adressen aller gerade in &konqueror; geöffneten Unterfenster.

source: <guimenu>Bookmarks</guimenu> <guimenuitem>New Bookmark Folder...</guimenuitem>
de: <guimenu>Lesezeichen</guimenu><guimenuitem>Neuer Lesezeichenordner ...</guimenuitem>

source: Create a new folder in your Bookmarks folder.
de: Erstellt einen neuen Ordner in Ihrem Lesezeichenordner.

source: <guimenu>Bookmarks</guimenu> <guimenuitem>Edit Bookmarks...</guimenuitem>
de: <guimenu>Lesezeichen</guimenu> <guimenuitem>Lesezeichen bearbeiten ...</guimenuitem>

source: Open the <link linkend="bookmarks">Bookmark Editor</link>.
de: Öffnet den <link linkend="bookmarks">Lesezeichen-Editor</link>.

source: The Tools Menu
de: Das Menü Extras

source: <menuchoice> <shortcut><keycap>F4</keycap></shortcut> <guimenu>Tools</guimenu> <guimenuitem>Open Terminal</guimenuitem></menuchoice> (File Manager mode)
de: <menuchoice> <shortcut><keycap>F4</keycap></shortcut> <guimenu>Extras</guimenu> <guimenuitem>Terminal öffnen</guimenuitem></menuchoice> (Dateiverwaltungs-Modus)

source: Open a &konsole; terminal window.
de: Öffnet ein &konsole;-Terminalfenster.

source: <menuchoice> <shortcut> <keycombo action="simul">&Ctrl;<keycap>F</keycap></keycombo></shortcut> <guimenu>Tools</guimenu> <guimenuitem>Find File...</guimenuitem></menuchoice> (File Manager mode)
de: <menuchoice><shortcut> <keycombo action="simul">&Ctrl;<keycap>F</keycap></keycombo> </shortcut> <guimenu>Extras</guimenu> <guimenuitem>Dateien suchen ...</guimenuitem></menuchoice> (Dateiverwaltungs-Modus)

source: Open the &kfind; application.
de: Öffnet das Programm &kfind;.

source: <menuchoice> <guimenu>Tools</guimenu> <guisubmenu>Select Remote Charset</guisubmenu></menuchoice> (File Manager mode)
de: <menuchoice> <guimenu>Extras</guimenu> <guisubmenu>Entfernte Zeichenkodierung wählen</guisubmenu></menuchoice> (Dateiverwaltungs-Modus)

source: Offers to choose the charset used by a remote connection manually.
de: Erlaubt es, die Zeichenkodierung, die von einer Netzwerk-Sitzung benutzt wird, manuell auszuwählen.

source: If you have &konqueror; plugins installed there will be additional entries in the <guimenu>Tools</guimenu> menu. See the <link linkend="konq-plugin">&konqueror; Plugins</link> chapter for further details.
de: Wenn Sie &konqueror;-Plugins installiert haben, erscheinen im Menü <guimenu>Extras</guimenu> weitere Einträge. Weitere Einzelheiten finden Sie im Kapitel <link linkend="konq-plugin">&konqueror;-Plugins</link> .

source: The Settings Menu
de: Das Menü Einstellungen

source: See also the section <link linkend="save-settings">Saving Settings and Profiles</link>.
de: Siehe auch <link linkend="save-settings">Speichern von Einstellungen und Profilen</link>.

source: <guimenu>Settings</guimenu> <guisubmenu>Toolbars Shown</guisubmenu>
de: <guimenu>Einstellungen</guimenu> <guisubmenu>Angezeigte Werkzeugleisten</guisubmenu>

source: Opens a submenu where you can choose to show or hide the various Toolbars.
de: Öffnet ein Untermenü, in dem Sie wählen können, welche Werkzeugleisten angezeigt werden.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>M</keycap></keycombo></shortcut> <guimenu>Settings</guimenu> <guimenuitem>Show Menubar</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>M</keycap></keycombo></shortcut> <guimenu>Einstellungen</guimenu> <guimenuitem>Menüleiste anzeigen</guimenuitem>

source: Show/Hide the menubar.
de: Blendet die Menüleiste ein/aus.

source: <guimenu>Settings</guimenu> <guimenuitem>Show Terminal Emulator</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>Terminal-Emulator anzeigen</guimenuitem>

source: Open a small text terminal view at the bottom of the main window.
de: Öffnet ein kleines Textterminal im unteren Bereich des Hauptfensters.

source: <shortcut> <keycombo action="simul"><keycap>F9</keycap></keycombo></shortcut> <guimenu>Settings</guimenu> <guimenuitem>Show Sidebar</guimenuitem>
de: <shortcut> <keycombo action="simul"><keycap>F9</keycap></keycombo></shortcut> <guimenu>Einstellungen</guimenu> <guimenuitem>Navigationsbereich anzeigen</guimenuitem>

source: Toggles the display of the &konqueror; sidebar. See <xref linkend="sidebar"/>.
de: Schaltet die Anzeige des Navigationsbereichs in &konqueror; ein und aus. Siehe <xref linkend="sidebar"/>.

source: <shortcut> <keycombo action="simul">&Ctrl;&Shift; <keycap>F</keycap></keycombo> </shortcut> <guimenu>Settings</guimenu> <guimenuitem>Full Screen Mode</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;&Shift; <keycap>F</keycap></keycombo> </shortcut><guimenu>Fenster</guimenu> <guimenuitem>Vollbildmodus</guimenuitem>

source: Changes &konqueror; to full screen mode, in which the &konqueror; window takes up the whole screen, and does not have the usual window decorations. To exit full screen mode, click on the <guiicon>Exit Full Screen Mode</guiicon> icon on the toolbar, or press <keycombo action="simul">&Ctrl;&Shift; <keycap>F</keycap></keycombo>.
de: Schaltet &konqueror; in den Vollbildmodus um, in dem das &konqueror;-Fenster den gesamten Bildschirm ausfüllt und nicht über die üblichen Fensterdekorationen verfügt. Um den Vollbildmodus zu verlassen, klicken Sie auf das Symbol <guiicon>Vollbildmodus beenden</guiicon> oder drücken Sie <keycombo action="simul">&Ctrl;&Shift; <keycap>F</keycap></keycombo>.

source: <guimenu>Settings</guimenu> <guisubmenu>Load View Profile</guisubmenu>
de: <guimenu>Einstellungen</guimenu> <guisubmenu>Ansichtsprofil laden</guisubmenu>

source: Load the settings associated with a particular view profile.
de: Die Einstellungen eines bestimmten Ansichtsprofils laden.

source: <guimenu>Settings</guimenu> <guimenuitem>Save View Profile As...</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>Ansichtsprofil speichern unter ...</guimenuitem>

source: Save the current settings to the current view profile.
de: Die aktuellen Einstellungen im aktuellen Ansichtsprofil speichern.

source: <guimenu>Settings</guimenu> <guimenuitem>Configure View Profiles...</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>Ansichtsprofile verwalten ...</guimenuitem>

source: Lets you change an existing view profile or create a new one.
de: Lässt Sie ein existierendes Ansichtsprofil ändern oder ein neues erzeugen..

source: <guimenu>Settings</guimenu> <guimenuitem>Configure Extensions...</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>Erweiterungen einrichten ...</guimenuitem>

source: Opens a dialog with all installed plugins (&eg; from the KDE module extragear) and allows you to select the ones you need. All plugins are accessible in the <guimenu>Tools</guimenu> menu.
de: Öffnet ein Dialogfenster mit allen installierten Modulen &eg; aus KDE-Extragear. Aktivieren Sie in dieser Liste die gewünschten Module. Alle aktivierten Module finden Sie im Menü <guilabel>Extras</guilabel>.

source: <guimenu>Settings</guimenu> <guimenuitem>Configure Spell Checking...</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>Rechtschreibprüfung einrichten ...</guimenuitem>

source: Displays the spell checking configuration dialog box, in which you can change settings associated with spell checking in &konqueror;.
de: Zeigt das Dialogfenster zur Einstellung der Rechtschreibprüfung an. Hier können &konqueror;s Einstellungen zur Rechtschreibprüfung ändern.

source: <guimenu>Settings</guimenu> <guimenuitem>Configure Shortcuts...</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>Kurzbefehle festlegen ...</guimenuitem>

source: Lets you see and change &konqueror;'s shortcut key bindings, &ie; the associations between actions such as <guimenuitem>Copy</guimenuitem> and keys or combinations of keys such as <keycombo action="simul">&Ctrl;<keycap>V</keycap></keycombo>. If you do this take care not to duplicate an existing shortcut.
de: Hier können Sie die Tastenzuordnungen von &konqueror; betrachten und verändern, &ie; die Verknüpfung von Aktionen wie <guimenuitem>Kopieren</guimenuitem> mit Tasten oder Tastenkombination wie <keycombo action="simul">&Ctrl;<keycap>V</keycap></keycombo>. Dabei ist es wichtig, dass keine vorhandene Tastenkombination doppelt eingeben wird.

source: <guimenu>Settings</guimenu> <guimenuitem>Configure Toolbars...</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>Werkzeugleisten einrichten ...</guimenuitem>

source: Lets you configure the Main, Extra and Location Toolbars. See the section <link linkend="configure-bars">Changing Bars</link>.
de: Lässt Sie die Haupt-, Extra- und Adress-Werkzeugleiste einrichten. Siehe <link linkend="configure-bars">Aktivieren und Deaktivieren der Leisten</link>.

source: <guimenu>Settings</guimenu> <guimenuitem>Configure &konqueror;...</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>&konqueror; einrichten ...</guimenuitem>

source: Lets you configure &konqueror;'s behavior in file manager and browser mode.
de: Hier können Sie das Erscheinungsbild von &konqueror; im Dateiverwaltungs- und Browser-Modus festlegen.

source: The Window Menu
de: Das Menü Fenster

source: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>L</keycap></keycombo></shortcut> <guimenu>Window</guimenu> <guimenuitem>Split View Left/Right</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>L</keycap></keycombo></shortcut> <guimenu>Fenster</guimenu> <guimenuitem>Ansicht in linke und rechte Hälfte teilen</guimenuitem>

source: Split View Left/Right.
de: Teilt das Hauptfenster in ein linkes und ein rechtes Teilfenster

source: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>T</keycap></keycombo></shortcut> <guimenu>Window</guimenu> <guimenuitem>Split View Top/Bottom</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>T</keycap></keycombo></shortcut> <guimenu>Fenster</guimenu> <guimenuitem>Ansicht in obere und untere Hälfte teilen</guimenuitem>

source: Split View Top/Bottom.
de: Teilt das Hauptfenster in eine obere und eine untere Hälfte

source: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>W</keycap></keycombo></shortcut> <guimenu>Window</guimenu> <guimenuitem>Close Active View</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>W</keycap></keycombo></shortcut> <guimenu>Fenster</guimenu> <guimenuitem>Aktive Ansicht schließen</guimenuitem>

source: Remove Active View.
de: Entfernt die aktive Ansicht.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo></shortcut> <guimenu>Window</guimenu> <guimenuitem>New Window</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo></shortcut> <guimenu>Fenster</guimenu> <guimenuitem>Neues Fenster</guimenuitem>

source: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>D</keycap></keycombo></shortcut> <guimenu>Window</guimenu> <guimenuitem>Duplicate Window</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>D</keycap></keycombo></shortcut> <guimenu>Fenster</guimenu> <guimenuitem>Fenster duplizieren</guimenuitem>

source: Open another &konqueror; window, duplicating the current one.
de: Öffnet ein weiteres &konqueror;-Fenster mit dem gleichen Inhalt wie das ursprüngliche.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>T</keycap></keycombo></shortcut> <guimenu>Window</guimenu> <guimenuitem>New Tab</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>T</keycap></keycombo> </shortcut><guimenu>Fenster</guimenu> <guimenuitem>Neues Unterfenster</guimenuitem>

source: Open a new, empty, tab page.
de: Öffnet ein neues, leeres Unterfenster.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>D</keycap></keycombo></shortcut> <guimenu>Window</guimenu> <guimenuitem>Duplicate Current Tab</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>D</keycap></keycombo></shortcut> <guimenu>Fenster</guimenu> <guimenuitem>Aktuelles Unterfenster duplizieren</guimenuitem>

source: Open a duplicate tab page.
de: Öffnet ein neues Unterfenster mit dem gleichen Inhalt.

source: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>B</keycap></keycombo></shortcut> <guimenu>Window</guimenu> <guimenuitem>Detach Current Tab</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>B</keycap></keycombo></shortcut> <guimenu>Fenster</guimenu> <guimenuitem>Aktuelles Unterfenster verselbstständigen</guimenuitem>

source: Show the current tab page in a new instance of &konqueror;.
de: Zeigt das aktuelle Unterfenster in einer neuen Instanz von &konqueror; an.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>W</keycap></keycombo></shortcut> <guimenu>Window</guimenu> <guimenuitem>Close Current Tab</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>W</keycap></keycombo></shortcut> <guimenu>Fenster</guimenu> <guimenuitem>Aktuelles Unterfenster schließen</guimenuitem>

source: Close the current tab page.
de: Schließt das aktuelle Unterfenster.

source: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>Left</keycap></keycombo></shortcut> <guimenu>Window</guimenu> <guimenuitem>Move Tab Left</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>Pfeil links</keycap></keycombo></shortcut> <guimenu>Fenster</guimenu> <guimenuitem>Unterfenster nach links verschieben</guimenuitem>

source: Move the current tab one place left in the list of tabs.
de: Verschiebt das aktuelle Unterfenster in der Liste der Unterfenster um eine Platz nach Links.

source: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>Right</keycap></keycombo></shortcut> <guimenu>Window</guimenu> <guimenuitem>Move Tab Right</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>Pfeil rechts</keycap></keycombo></shortcut> <guimenu>Fenster</guimenu> <guimenuitem>Unterfenster nach rechts verschieben</guimenuitem>

source: Move the current tab one place right in the list of tabs.
de: Verschiebt das aktuelle Unterfenster in der Liste der Unterfenster um eine Platz nach Rechts.

source: The Help Menu
de: Das Menü Hilfe

source: Apart from standard &kde; <guimenu>Help</guimenu> menu items described in the section <ulink url="help:/fundamentals/ui.html#menus-help">Help Menu</ulink> of the &kde; Fundamentals you will have the menu entry <guimenuitem>&konqueror; Introduction</guimenuitem> to revisit the introductory pages that you got when &konqueror; was first started.
de: Zusätzlich zu den unten beschriebenen Standardeinträgen des &kde;-Menüs <guimenu>Hilfe</guimenu>, das im Abschnitt über das Menü <ulink url="help:/fundamentals/ui.html#menus-help">Hilfe</ulink> der &kde;-Grundlagen erläutert wird, finden Sie hier den Eintrag <guimenuitem>Einführung in &konqueror;</guimenuitem>, um diese Information wieder anzuzeigen.

source: Questions and Answers
de: Fragen und Antworten

source: Can I run &konqueror; from another window manager?
de: Kann ich &konqueror; unter einem anderen Window-Manager benutzen?

source: Just install &Qt;, kdelibs and kdebase, and from your favorite window manager, launch &konqueror;. It should work just fine, but if it doesn't (&kde; developers don't test that case often), report it to <ulink url="http://bugs.kde.org">http://bugs.kde.org</ulink> and try running <application>kdeinit</application> before running &konqueror;; it usually helps.
de: Installieren Sie einfach &Qt;, kdelibs und kdebase, und dann starten Sie aus Ihrem Lieblings-Window-Manager &konqueror;. Es sollte problemlos funktionieren; falls nicht (&kde;-Entwickler testen diesen Fall nicht oft), melden Sie es unter <ulink url="http://bugs.kde.org">http://bugs.kde.org</ulink> und rufen Sie <application>kdeinit</application> auf, bevor Sie &konqueror;, starten. Das hilft gewöhnlich.

source: Where does &konqueror; keep all its configuration data?
de: Wo legt &konqueror; alle seine Einrichtungsdaten ab?

source: Generally in the <filename>~/.kde</filename> folder (this may be <filename>~/.kde4</filename> on your system, depending on how &kde; was installed). Don't alter these files unless you really know what you are doing.
de: Im allgemeinen in den Ordner <filename>~/.kde</filename> (das kann abhängig von der Installation auf dem eigenen System auch <filename>~/.kde4</filename> sein). Ändern Sie diese Dateien nur, wenn Sie wirklich wissen, was Sie tun.

source: The <filename class="directory">~/.kde/share/apps/konqueror/profiles</filename> folder holds individual files containing settings for each of your <link linkend="save-settings">profiles. </link>
de: Der Ordner <filename class="directory">~/.kde/share/apps/konqueror/profiles</filename> enthält einzelne Dateien, die Einstellungen all Ihrer <link linkend="save-settings">Profile</link> enthalten.

source: Your bookmarks are held in <filename class="directory">~/.kde/share/apps/konqueror/bookmarks.xml</filename>
de: Ihre Lesezeichen befinden sich in der Datei <filename class="directory">~/.kde/share/apps/konqueror/bookmarks.xml</filename>.

source: Cookies are held in <filename class="directory">~/.kde/share/apps/kcookiejar/cookies</filename>
de: Cookies werden in der Datei <filename class="directory">~/.kde/share/apps/kcookiejar/cookies</filename> abgelegt

source: Your history, as used for the auto-completion feature, is in <filename>~/.kde/share/config/konq_history</filename>
de: Die Verlaufdaten, die für die automatische Vervollständigung benutzt werden, befinden sich in <filename>~/.kde/share/config/konq_history</filename>

source: In the folder <filename class="directory">~/.kde/share/config/</filename> the files <filename>konqiconviewrc</filename>, <filename>konqlistviewrc</filename> and <filename>konquerorrc</filename> hold a whole lot of general configuration settings.
de: Die Dateien <filename>konqiconviewrc</filename>, <filename>konqlistviewrc</filename> und <filename>konquerorrc</filename> im Ordner <filename class="directory">~/.kde/share/config/</filename> enthalten viele allgemeine Einrichtungseinstellungen.

source: The folder <filename class="directory">~/.kde/cache-<replaceable>hostname</replaceable>/http/</filename> contains the browser cache.
de: Der Ordner <filename class="directory">~/.kde/cache-<replaceable>hostname</replaceable>/http/</filename> enthält den Zwischenspeicher des Browsers.

source: The Sidebar uses the files and subfolders in <filename class="directory">~/.kde/share/apps/konqsidebartng</filename>
de: Der Navigationsbereich benutzt die Dateien und Unterordner in <filename class="directory">~/.kde/share/apps/konqsidebartng</filename>

source: Any folder specific view settings are put into <literal role="extension">.directory</literal> files in the individual folders.
de: Alle ordnerspezifischen Ansichtseinstellungen werden in <literal role="extension">.directory</literal>-Dateien in den betreffenden Ordnern abgelegt.

source: How do I clear out the history file?
de: Wie lösche ich die Einträge in der Verlaufsdatei?

source: There are two <quote>histories</quote>:
de: Es gibt zwei <quote>Verläufe</quote>:

source: One is used for text completion in the Location Toolbar text entry box. To clear this <mousebutton>right</mousebutton> click on the text entry box and select <guimenuitem>Clear History </guimenuitem>.
de: Einer wird für die Vervollständigung von Einträgen im Eingabefeld der Adressleiste benutzt. Um diese Einträge zu löschen, klicken Sie mit der <mousebutton>rechten</mousebutton> Maustaste auf das Texteingabefeld und wählen <guimenuitem>Alles löschen</guimenuitem> aus.

source: The other is the log of visited locations. Select the History page in the Sidebar, <mousebutton>right</mousebutton> click on an entry and choose <guimenuitem>Remove Entry</guimenuitem> (<keycap>Del</keycap>) to remove just that entry or <guimenuitem>Clear History</guimenuitem> to delete all entries.
de: Der andere protokolliert die kürzlich besuchten Ordner. Wählen Sie im Navigationsbereich die Verlaufsseite, klicken Sie mit der <mousebutton>rechten</mousebutton> Maustaste auf einen Eintrag und wählen Sie <guimenuitem>Eintrag entfernen</guimenuitem> (<keycap>Entf</keycap>), um genau diesen Eintrag zu entfernen, oder <guimenuitem>Verlauf leeren</guimenuitem>, um alle Einträge zu löschen.

source: You can also use the application <application>Sweeper</application> from the kdeutils module which allows you to clean up cookies, favicons, web history and cache, form completion entries and cache policies of visited websites.
de: Im Modul kdeutils gibt es zusätzlich noch das Programm <application>Sweeper</application>. Damit können Sie Cookies, Webseiten-Symbole (Favicons), Einträge zum automatischen Ausfüllen von Formularen und Regelungen für den Zwischenspeicher von besuchten Webseiten löschen.

source: How do I enable, disable or clear the browser cache?
de: Wie ermögliche oder verhindere ich die Benutzung des Zwischenspeichers bzw. wie entferne ich alle Einträge aus dem Zwischenspeicher.

source: If you select <menuchoice><guimenu>Web Browsing</guimenu><guimenuitem>Cache</guimenuitem> </menuchoice> in the dialog launched by selecting <menuchoice><guimenu>Settings</guimenu><guimenuitem>Configure Konqueror... </guimenuitem></menuchoice>, you will be presented with a dialog box that lets you disable the cache, clear it or set its size, and change the caching policy.
de: Wenn Sie <menuchoice><guimenu>Surfen im Internet</guimenu><guimenuitem>Zwischenspeicher</guimenuitem></menuchoice> aus <menuchoice><guimenu>Einstellungen</guimenu><guimenuitem>Konqueror einrichten ...</guimenuitem></menuchoice> auswählen, können Sie in einem Dialogfenster den Zwischenspeicher deaktivieren, ihn leeren oder seine Größe einstellen und die Regeln für die Zwischenspeichernutzung ändern.

source: How can I change the timeout values used by &konqueror; when web browsing?
de: Wo können die von &konqueror; für das Web-Browsen benutzten Zeitwerte eingestellt werden?
