Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/applications/konqueror.po
Languages: de

source: &konqueror; decides what the file type is by matching the filename extension against a list of known types. If that fails it tries to guess the type from the file contents. You can change the list of known file types and associated actions with the <guilabel>File Associations</guilabel> page of the <menuchoice><guimenu>Settings</guimenu><guimenuitem>Configure Konqueror... </guimenuitem></menuchoice> dialog.
de: &konqueror; entscheidet durch Vergleichen der Dateinamenserweiterung mit einer Liste bekannter Dateitypen, um welchen Dateityp es sich handelt. Wenn dies fehlschlägt, versucht er, auf Grund des Dateiinhaltes den Typ zu ermitteln. Sie können die Liste der bekannten Dateitypen und der mit ihnen verknüpften Aktionen auf der Seite <guilabel>Dateizuordnungen</guilabel> des Dialoges <menuchoice><guimenu>Einstellungen</guimenu> <guimenuitem>Konqueror einrichten ... </guimenuitem></menuchoice> verändern.

source: Clicking the &MMB; on a file or folder name or icon does essentially the same as <mousebutton>left</mousebutton> clicking except that it usually does it in a new &konqueror; window, unless the <guilabel>Open links in new tab instead of in new window</guilabel> box has been checked in the <guimenuitem>General</guimenuitem> page of the <menuchoice><guimenu>Settings</guimenu><guimenuitem>Configure Konqueror...</guimenuitem></menuchoice> dialog. &konqueror; can open links on pages and <menuchoice><guimenu>Bookmarks</guimenu></menuchoice>, as well as the <guibutton>Home</guibutton>, <guibutton>Up</guibutton>, <guibutton>Back</guibutton> and <guibutton>Forward</guibutton> entries in a new tab or window.
de: Ein Klick auf eine Datei oder einen Ordner mit der &MMBn; hat im wesentlichen dieselbe Wirkung wie ein Klick mit der <mousebutton>linken</mousebutton> Maustaste. Jedoch wird bei der mittleren Maustaste gewöhnlich ein neues Fenster geöffnet. Es sei denn, Sie haben im Dialog <menuchoice><guimenu>Einstellungen</guimenu> <guimenuitem>Konqueror einrichten ...</guimenuitem></menuchoice> auf der Seite <guimenuitem>Allgemein</guimenuitem> das Feld <guilabel>Verknüpfungen in Unterfenstern anzeigen statt in extra Fenstern</guilabel> angekreuzt. &konqueror; kann Verweise auf Seiten und <menuchoice><guimenu>Lesezeichen</guimenu></menuchoice> als auch die Knöpfe <guibutton>Startseite</guibutton>, <guibutton>Aufwärts</guibutton>, <guibutton>Nach vorne</guibutton> und <guibutton>Zurück</guibutton> in einem neuen (Unter-)Fenster ausführen.

source: Holding the &Shift; key down while pressing the &MMB; will open the link in the background.
de: Wenn Sie die mittlere Maustaste bei gedrückter &Shift;-Taste betätigen, wird die Verknüpfung im Hintergrund geöffnet.

source: <mousebutton>Right</mousebutton> Mouse Button Menus
de: Die <mousebutton>Rechts</mousebutton>klick-Kontextmenüs

source: Clicking the &RMB; on almost any part of &konqueror;'s window will bring up an appropriate context menu.
de: Wenn Sie mit der rechten Maustaste in ein &konqueror;-Fenster klicken, so öffnet sich fast immer ein passendes Kontextmenü.

source: If you have enabled the <guilabel>Right click goes back in history</guilabel> option in &konqueror;'s <link linkend="othersettings"> configuration</link> settings a simple <mousebutton>right</mousebutton> click is equivalent to clicking on the <guibutton>Back</guibutton> button. In this case you can access the context menu by moving the mouse with the <mousebutton>right</mousebutton> button held down.
de: Wenn Sie in &konqueror;s <link linkend="othersettings">Konfiguration</link>seinstellungen die Option <guilabel>Rechtsklick geht im Verlaufsspeicher eine Stufe zurück</guilabel> aktiviert haben, ist ein einfacher <mousebutton>Rechts</mousebutton>klick äquivalent zur Betätigung des <guibutton>Zurück</guibutton>-Knopfes. In diesem Fall können Sie auf das Kontextmenü zugreifen, indem Sie die Maus bei gedrückter <mousebutton>rechter</mousebutton> Maustaste bewegen.

source: On the Titlebar
de: Kontextmenü der Titelleiste

source: <mousebutton>Right</mousebutton> clicking on any free area of the Titlebar brings up the Titlebar Menu, allowing you to control the position of &konqueror;'s window as well as the decoration applied to all &kde; program windows.
de: Ein Rechtsklick auf einen freien Bereich der Titelleiste öffnet deren Kontextmenü. Dort kann die Position des &konqueror;-Fensters sowie die Dekoration für alle &kde;-Programmfenster verändert werden.

source: On the Main Toolbar
de: Kontextmenü der Haupt-Werkzeugleiste

source: <mousebutton>Right</mousebutton> click on any free area of the Toolbar to bring up the Toolbar Menu. You can use it to control whether the Toolbar is at the top, bottom, left or right of &konqueror;'s window. You can also use the Toolbar Menu to set the size of the buttons on the Toolbar, and whether they are shown as icons, text or both.
de: Ein Rechtsklick auf einen freien Teil der Werkzeugleiste öffnet deren Kontextmenü. Dort kann die Ausrichtung der Werkzeugleiste im &konqueror;-Fenster (oben, unten, rechts, links) geändert werden. Auch die Größe der Symbole in der Werkzeugleiste kann hier eingestellt werden. Es lässt sich auch festlegen, ob Symbole, Text oder beides angezeigt werden soll.

source: On the Location Toolbar
de: Kontextmenü der Adressleiste

source: <mousebutton>Right</mousebutton> click in the &URL; entry box area to perform Cut, Copy, Paste or Clear operations in this area, or to change the automatic <link linkend="path-complete">Text Completion</link> features.
de: Ein <mousebutton>Rechts</mousebutton>klick auf das &URL;-Eingabefeld ermöglicht Ihnen, Kopier-, Ausschneide- und Einfügeoperationen auszuführen. Außerdem können die Einstellungen zur <link linkend="path-complete">automatischen Vervollständigung</link> verändert werden.

source: Within a View
de: Kontextmenü des Hauptfensters

source: If you <mousebutton>right</mousebutton> click on any free area of a view then you will get a menu that contains, among other options, the <guiicon>Up</guiicon>, <guiicon>Back</guiicon>, <guiicon>Forward</guiicon> and <guiicon>Reload</guiicon> navigation commands.
de: Ein Rechtsklick auf einen freien Bereich des Hauptfensters öffnet das Kontextmenü, das die Befehle <guiicon>Aufwärts</guiicon>, <guiicon>Zurück</guiicon>, <guiicon>Nach vorne</guiicon> und <guiicon>Erneut laden</guiicon> sowie die Option <guimenuitem>Erneut laden</guimenuitem> des Menüs <guimenu>Bearbeiten</guimenu> enthält.

source: On a File or Folder
de: Kontextmenü von Dateien und Ordnern

source: This is a most useful feature. <mousebutton>Right</mousebutton> clicking on the name or icon of any file or folder not only <quote>selects</quote> that item but also brings up a menu allowing you to <guimenuitem>Cut</guimenuitem>, <guimenuitem>Move</guimenuitem>, <guimenuitem>Copy</guimenuitem> or <guimenuitem>Remove</guimenuitem> the item in various ways, open it with the program of your choice or preview it, rename it, or edit the file type or properties.
de: Dies ist eine sehr nützliche Funktion. Ein <mousebutton>Rechts</mousebutton>klick wählt nicht nur die Datei oder den Ordner aus, sondern zeigt auch ein Menü an, in dem Sie vielfältige Aktionen wie <guimenuitem>Ausschneiden</guimenuitem>, <guimenuitem>Kopieren</guimenuitem> oder Löschen (auf mehrere Arten) ausführen können. Außerdem können Sie das Objekt mit einem Programm Ihrer Wahl öffnen, sich eine Vorschau anzeigen lassen, es umbenennen oder den Dateityp oder die Eigenschaften ändern.

source: On the Status Bar
de: Kontextmenü der Statusleiste

source: <mousebutton>Right</mousebutton> click on the Status Bar at the bottom of a window or view to add or remove a view within &konqueror;'s window.
de: Ein Rechtsklick auf die Statusleiste ermöglicht Ihnen, ein Teilfenster im &konqueror;-Fenster hinzuzufügen oder zu löschen.

source: Viewing Help, Man and Info Pages
de: Hilfe-, Man- und Info-Seiten anzeigen

source: You can view &kde; Help and &UNIX; Man and Info pages directly in &konqueror;, without having to start up <application>KHelpCenter</application>.
de: Sie können &kde;-Hilfe- und &UNIX;-Man- und Info-Seiten direkt in &konqueror; anzeigen, ohne vorher das <application>KDE-Hilfezentrum</application> aufrufen zu müssen.

source: To view a &kde; Help page, enter <userinput>help:/<replaceable>application name</replaceable></userinput> (for example <userinput>help:/kmail</userinput> to view the &kmail; documentation.) into &konqueror;'s Location Toolbar window.
de: Um eine &kde;-Hilfeseite anzuzeigen, geben Sie in &konqueror;s Adresseingabezeile <userinput>help:/<replaceable>Programmname </replaceable></userinput> ein. Zum Beispiel <userinput>help:/kmail</userinput>, wenn Sie sich die &kmail;-Dokumentation anschauen wollen.

source: If you want to read &UNIX; Man pages &konqueror; makes it easy. For example type <userinput>man:/touch</userinput> or <userinput>#touch</userinput> into the Location Toolbar to see the page for the <command>touch</command> command.
de: Wenn Sie sich &UNIX; <quote>man</quote>-Seiten anschauen möchten, macht &konqueror; es Ihnen leicht: tippen Sie einfach <userinput>man:/touch</userinput> oder <userinput>#touch</userinput> in die Adressleiste ein, um die <quote>man</quote>-Seite zum Befehl <command>touch</command> angezeigt zu bekommen.

source: To browse through &UNIX; Info pages, entering <userinput>info:/dir</userinput> takes you to Info's top level directory, then it's just a matter of clicking on the right links to find the page you want. Alternatively, use <userinput>info:/<replaceable>command name</replaceable></userinput> to go straight to the Info page you want.
de: Und das Durchsuchen von &UNIX;-Info-Seiten wird ebenfalls stark vereinfacht. Die Eingabe von <userinput>info:/dir</userinput> bringt Sie zum obersten <quote>info</quote>-Verzeichnis. Dann müssen Sie nur noch auf die richtigen Verknüpfungen klicken, um die von Ihnen gesuchte Seite zu finden. Alternativ gelangen Sie nach der Eingabe von <userinput>info:/<replaceable>Befehlsname</replaceable></userinput> direkt auf die von Ihnen gewünschte Info-Seite.

source: Unfortunately, &kde; Help pages are stored in such a way that they cannot be viewed in other browsers. If you really need to do this your only recourse is to go online and visit <ulink url="http://docs.kde.org"> http://docs.kde.org</ulink>.
de: Leider werden &kde;-Hilfe-Seiten so gespeichert, dass sie nicht mit einem anderen Browser betrachtet werden können. Falls Sie dies wirklich tun müssen, können Sie dies nur online auf den Seiten unter<ulink url="http://docs.kde.org"> http://docs.kde.org</ulink>.

source: &konqueror; the File Manager
de: &konqueror; - Das Dateiverwaltungsprogramm

source: Folders and Paths
de: Ordner und Pfade

source: In &UNIX; and &Linux; all folders are arranged in a simple hierarchy. Starting from a top level folder (also called the root directory), the structure descends and branches containing various files and subfolders. This means that you can get from any folder to any other by going <quote>up </quote> until you reach a common point then <quote>down</quote> through the appropriate subfolders until you reach your target.
de: Unter &UNIX; und &Linux; sind alle Ordner in einer einfachen, auf dem Kopf stehenden Baumstruktur organisiert, die von einem Basisordner (<quote>root</quote>-Ordner) ausgeht und in Dateien und Unterordner verzweigt. Das bedeutet, dass Sie ausgehend von jedem Ordner jeden anderen Ordner erreichen können, indem Sie zuerst <quote>hinauf</quote> gehen, bis Sie einen gemeinsamen Zweig gefunden haben, und dann wieder <quote>hinab</quote>, bis Sie an Ihrem Ziel angelangt sind.

source: The position of any file or folder in the structure (also called a directory tree) can be described by its <quote>path</quote>, which is a simple list of the folders you would have to descend through to get to the target folder or file. For example <filename class="directory">/home/pam</filename> is the subfolder <filename class="directory">pam</filename> of the subfolder <filename class="directory">home</filename> of the top level folder, and <filename>/home/pam/words.txt</filename> is the file <filename>words.txt </filename> in that subfolder. The leading <quote>/</quote> in these paths represents the top level folder.
de: Die Position jeder Datei und jedes Ordners wird durch den <quote>Pfad</quote> (einer Liste der Ordnerebenen die darüber liegen) beschrieben. So ist zum Beispiel <filename class="directory">/home/pam</filename> ein Unterordner namens <filename class="directory">pam</filename> des Ordners <filename class="directory">home</filename>, der wiederum selbst ein Unterordner des Basisordners auf der obersten Ebene ist. <filename>/home/pam/words.txt</filename> ist eine Datei namens <filename>words.txt</filename> in jenem Unterordner. Der führende Schrägstrich <quote>/</quote> in Pfadangaben steht für den Basisordner, also die oberste Ebene.

source: Every folder accessible by your system &mdash; including those on other hard disk partitions, a USB device or &CD-ROM; &mdash; will appear in the tree descending from /, their exact paths will depend on how your system was set up (see also the section on <link linkend="removable-devices">Removable Devices</link>).
de: Beachten Sie, dass jeder von Ihrem System aus erreichbare Ordner &mdash; auch solche auf Partitionen anderer Laufwerke, ein USB-Gerät und &CD-ROM; &mdash; im Baum unterhalb von / erscheint. Der genaue Pfad hängt von der Einrichtung Ihres Systems ab. Sehen Sie sich hierzu auch den Abschnitt <link linkend="removable-devices">Wechselmedien</link> an.

source: Every user on a &UNIX; / &Linux; system has their own <quote>home</quote> folder to hold their personal files and settings; for example <filename class="directory">/home/john</filename> and <filename class="directory">/home/mary</filename>. The symbol <keycap>~</keycap> is often used to represent the user's home folder, so that <filename>~/letter.txt</filename> refers to the file <filename>letter.txt</filename> in my home folder.
de: Jeder Benutzer eines &UNIX;- / &Linux;-Systems besitzt einen eigenen <quote>Persönlichen Ordner</quote> für seine persönlichen Dateien und Einstellungen, zum Beispiel <filename class="directory">/home/jonas</filename> und <filename class="directory">/home/marie</filename>. Häufig wird das Symbol <keycap>~</keycap> benutzt, um den persönlichen Ordner des Benutzers zu repräsentieren. Somit verweist <filename>~/letter.txt</filename> auf die Datei <filename>letter.txt</filename> in meinem Persönlichen Ordner.

source: Note that the term <quote>directory</quote> is often used instead of <quote>folder</quote>.
de: Die Begriffe <quote>Ordner</quote> und <quote>Verzeichnis</quote> werden oft synonym verwendet.

source: View Modes
de: Ansichts-Modi

source: In File Manager mode, &konqueror; lists which files and subfolders are contained within a given folder and can provide you with some information about them. The <quote>path</quote> of the current folder is shown in the Location Toolbar. The way that &konqueror; displays the files and folders depends mainly on your choice of view mode which can be selected from the <menuchoice><guimenu>View</guimenu><guisubmenu>View Mode</guisubmenu></menuchoice> sub menu. The view modes &konqueror; provides are outlined below.
de: Als Dateimanager listet &konqueror; die Dateien und Unterordner auf, die in einem Ordner enthalten sind, und zeigt einige Informationen dazu an. Der <quote>Pfad</quote> des jeweils aktuellen Ordners wird in der Adressleiste angezeigt. Wie &konqueror; Dateien und Ordner darstellt, hängt wesentlich von Ihrer Wahl des Anzeigemodus ab. Sie können den Modus im Menü <menuchoice> <guimenu>Ansicht</guimenu><guisubmenu>Anzeigemodus</guisubmenu></menuchoice> auswählen; es stehen folgende Möglichkeiten zur Verfügung:

source: In File Manager mode, &konqueror; uses an embedded &dolphin; component.
de: Im Dateiverwaltungs-Modus benutzt &konqueror; eine eingebettete &dolphin;-Komponente.

source: In the <guibutton>Icons</guibutton> view, which is the default, files will be represented by an icon that visualizes the file type, and a folder icon will be shown for subfolders. The names of folders and files, and the items enabled in <menuchoice><guimenu>View</guimenu><guisubmenu>Additional Information</guisubmenu></menuchoice>, are displayed below the icons.
de: In der Ansicht <guibutton>Symbole</guibutton> (Standard) werden Dateien durch Symbole, die den jeweiligen Dateityp anzeigen und Unterordner durch Ordner-Symbole dargestellt. Die Namen der Ordner und Dateien sowie die in <menuchoice><guimenu>Ansicht</guimenu><guisubmenu>Zusätzliche Informationen</guisubmenu></menuchoice> ausgewählten Einträge werden darunter angezeigt.

source: The <guilabel>Compact</guilabel> view shows the folder contents as icons with the name beside it and the items enabled in <menuchoice><guimenu>View</guimenu><guisubmenu>Additional Information</guisubmenu></menuchoice> below the name. The items are grouped in columns similar to the <guilabel>Short View</guilabel> in the &kde; file dialog.
de: Die Ansicht <guibutton>Kompakt</guibutton> zeigt den Inhalt der Ordner als Symbole mit dem Namen des Elements daneben und die in <menuchoice><guimenu>Ansicht</guimenu><guisubmenu>Zusätzliche Informationen</guisubmenu></menuchoice> ausgewählten Einträge unter dem Namen an. Die Einträge werden in Spalten gruppiert. Diese Ansicht entspricht der <guilabel>Kurzdarstellung</guilabel> im &kde;-Dateidialog.

source: In the <guibutton>Details</guibutton> view, the folder contents are displayed as a detailed list which contains the name, size and last modification time of each item. Additional columns can be added by clicking a column header with the &RMB;.
de: In der Ansicht <guibutton>Details</guibutton> werden Ordnerinhalte in einer ausführlichen Liste angezeigt, die Name, Größe und Änderungsdatum jedes Objekts beinhaltet. Zusätzliche Spalten können durch einen Klick mit der &RMBn; auf einen Spaltennamen hinzugefügt werden.

source: In the context menu of the header line you can choose between custom or automatic column width. Automatic width adjusts the width of all columns once to display the longest item in the column completely, except for the <guilabel>Name</guilabel> column where the extension is replaced by <quote>...</quote>
de: Im Kontextmenü der Kopfzeile können Sie zwischen benutzerdefinierter und automatischer Spaltenbreite wählen. Bei automatischer Anpassung wird die Breite der Spalten beim Öffnen eines Ordners so eingestellt, dass der längste Eintrag jeder Spalte vollständig angezeigt wird, mit Ausnahme der Spalte <guilabel>Name</guilabel>, in der die Dateierweiterung durch drei Auslassungspunkte <quote>...</quote> ersetzt wird.

source: The order of columns can be changed by drag and drop of column headers, except for the <guilabel>Name</guilabel> header, which is always the first column in this view.
de: Die Reihenfolge der Spalten kann durch Verschieben der Spaltenköpfe mit der Maus geändert werden. Nur die Spalte <guilabel>Name</guilabel> wird immer als erste Spalte angezeigt.

source: The details view allows you to view the current directory in a tree-like fashion if <guilabel>Expandable folders</guilabel> are enabled: Each subfolder of the current folder can be <quote>expanded</quote> or <quote>collapsed</quote> by clicking on the <guiicon>&gt;</guiicon> or <guiicon>v</guiicon> icon next to it.
de: Die Detailansicht ermöglicht es, den aktuellen Ordner in einer Baumstruktur anzuzeigen, wenn die Einstellung <guilabel>Aufklappbare Ordner</guilabel> angekreuzt ist: Jeder Unterordner kann durch einen Klick mit der &LMBn; auf das Symbol <guiicon>&gt;</guiicon> oder <guiicon>v</guiicon> neben ihm <quote>aufgeklappt</quote> werden.

source: <screeninfo>Grouped View</screeninfo>
de: <screeninfo>Gruppenansicht</screeninfo>

source: <phrase>Grouped View</phrase>
de: <phrase>Gruppenansicht</phrase>

source: All view modes support grouping by the sort type selected in <menuchoice><guimenu>View</guimenu><guisubmenu>Sort by</guisubmenu></menuchoice>
de: In allen Ansichtsmodi können Dateien und Ordner in Gruppen des Sortiertyps angezeigt werden, der im Menü <menuchoice><guimenu>Ansicht</guimenu><guimenuitem>Sortieren nach</guimenuitem></menuchoice> eingestellt ist.

source: File Tip Info
de: Datei-Infos

source: Checking the <guilabel>Show tooltips</guilabel> box in the <menuchoice> <guimenu>File Management</guimenu><guimenuitem>General</guimenuitem></menuchoice> page of the &konqueror; Configuration dialog causes a small pop up information window to appear when the mouse pointer is hovered over a file or folder name or icon.
de: Wenn auf der Seite <menuchoice> <guimenu>Dateiverwaltung</guimenu><guimenuitem>Allgemein</guimenuitem></menuchoice> in &konqueror;s Einstellungsdialog die Option <guilabel>Kurzinfos anzeigen</guilabel> angekreuzt wurde, erscheint ein kleines Fenster mit zusätzlichen Informationen, sobald Sie mit der Maus über einem Dateinamen oder Symbol verweilen.

source: File Previews
de: Dateivorschau

source: The <guilabel>Previews</guilabel> tab of the <menuchoice><guimenu>File Management</guimenu> <guimenuitem>General</guimenuitem></menuchoice> settings page lets you enable file previews for certain types of file.
de: Auf der Karteikarte <guilabel>Vorschauen</guilabel> der Seite <menuchoice><guimenu>Dateiverwaltung</guimenu><guisubmenu>Allgemein</guisubmenu></menuchoice> der Einstellungen können Sie die Dateivorschauen für bestimmte Dateitypen aktivieren.

source: Generally this means that the file's icon will be replaced by a small image showing the file contents.
de: Im allgemeinen bedeutet dies, dass das Dateisymbol durch ein kleines Bild mit dem Dateiinhalt ersetzt wird.

source: Because &konqueror; has to read much more data than just the file name to generate a preview, file previews may not be appropriate when viewing files from a remote system. To disable previews for remote files where reading the extra data would take too long set a file size limit at the bottom of the <guilabel>Previews</guilabel> tab.
de: Da &konqueror; für die Erzeugung einer Dateivorschau wesentlich mehr Daten als nur die Dateinamen einlesen muss, kann es ungünstig sein, die Vorschau für Dateien zu aktivieren, die über das Netzwerk gelesen werden. Auf der Karteikarte <guilabel>Vorschauen</guilabel> auf der Seite <guilabel>Allgemein</guilabel> des Einrichtungsdialoges für den Dateimanager können Sie eine maximale Dateigröße für die Erzeugung der Vorschau für lokale Dateien und Dateien auf Fremdrechner angeben, bei denen das Einlesen der zusätzlichen Daten zu lange dauert.

source: Information in the View
de: Informationen in der Ansicht

source: In all view modes &kappname; shows at least an icon and a name for each item. Using <guisubmenu>Additional Information</guisubmenu> in the <guimenu>View</guimenu> menu or the context menu of the header in <guilabel>Details</guilabel> mode, you can select more information for each item to be shown:
de: In allen Ansichtsmodi zeigt &kappname; mindestens ein Symbol und einen Namen für jeden Eintrag an. Mit <guisubmenu>zusätzlichen Informationen</guisubmenu> im Menü <guimenu>Ansicht</guimenu> oder im Kontextmenü der Kopfzeile im Modus <guilabel>Details</guilabel> können sie weitere Informationen für jeden Eintrag zur Anzeige auswählen.

source: <guimenuitem>Size</guimenuitem>, <guimenuitem>Date</guimenuitem>, <guimenuitem>Type</guimenuitem>, <guimenuitem>Rating</guimenuitem>, <guimenuitem>Tags</guimenuitem> or <guimenuitem>Comment</guimenuitem>.
de: <guimenuitem>Größe</guimenuitem>, <guimenuitem>Datum</guimenuitem>, <guimenuitem>Typ</guimenuitem>, <guimenuitem>Bewertung</guimenuitem>, <guimenuitem>Stichwörter</guimenuitem> oder <guimenuitem>Kommentar</guimenuitem>.
