Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/applications/konqueror.po
Languages: de

source: To overcome this problem you can change the browser identification information that &konqueror; sends for specific sites or domains by selecting <menuchoice><guimenu>Web Browsing</guimenu><guimenuitem> Browser Identification</guimenuitem></menuchoice> page of the settings dialog.
de: Um dieses Problem zu umgehen, können Sie die Information zur Browserkennung, die &konqueror; sendet, für spezielle Webseiten oder Domänen ändern, indem Sie die Seite <menuchoice><guimenu>Surfen im Internet</guimenu><guimenuitem>Browserkennung</guimenuitem></menuchoice> im Einrichtungsdialog öffnen.

source: Problems with getting a web page to work properly may also be due to its use of &Java; or JavaScript. If you suspect that this may be the case check that they have been enabled in the <guilabel>Java &amp; JavaScript</guilabel> section of the settings dialog.
de: Probleme mit der korrekten Funktion einer Webseite können auch mit der Verwendung von &Java; oder JavaScript zusammenhängen. Wenn Sie vermuten, dass dies der Fall sein könnte, überprüfen Sie, ob diese Funktionen im Abschnitt <guilabel>Java &amp; JavaScript</guilabel> des Einstellungsdialogs tatsächlich aktiviert wurden.

source: Install the <guilabel>UserAgent Changer</guilabel> extension from the &konqueror; Plugins and enable it in <menuchoice><guimenu>Settings</guimenu><guimenuitem> Configure Extensions</guimenuitem></menuchoice>. This extension adds a <guimenuitem>Change Browser Identification</guimenuitem> item to the <guimenu>Tools</guimenu> menu. Using this item lets you quickly switch between different <quote>User Agent</quote> strings.
de: Installieren Sie die Erweiterung <guilabel>Browserkennung ändern</guilabel> von den &konqueror;-Modulen und aktivieren Sie es im Menü <menuchoice><guimenu>Einstellungen</guimenu><guimenuitem> Erweiterungen einrichten</guimenuitem></menuchoice>. Mit dieser Erweiterung wird der Eintrag <guimenuitem>Browserkennung ändern</guimenuitem> zum Menü <guimenu>Extras</guimenu> hinzugefügt. Benutzen Sie diese Aktion, um schnell zwischen verschiedenen Browserkennungen zu wechseln.

source: Saving and Printing Web Items
de: Speichern und Drucken von Internet-Seiten

source: When you are viewing a web page you can save it (or at least the basic &HTML; or similar source text) to your local disk with <menuchoice><guimenu>File</guimenu><guimenuitem>Save As...</guimenuitem></menuchoice>. If the page you are viewing uses frames, then you will also be given the <menuchoice><guimenu>File</guimenu><guimenuitem>Save Frame As...</guimenuitem></menuchoice> option. <mousebutton>Left</mousebutton> click in the frame you want to save first.
de: Wenn Sie eine Internetseite geladen haben, können Sie sie auf der Festplatte abspeichern (zumindest den zugrunde liegenden &HTML;- oder ähnlichen Quelltext). Benutzen Sie dazu den Eintrag <menuchoice><guimenu>Datei</guimenu><guimenuitem>Speichern unter ...</guimenuitem></menuchoice>. Wenn die Seite, die Sie betrachten, sogenannte Frames benutzt, wird zusätzlich die Option <menuchoice><guimenu>Datei</guimenu> <guimenuitem>Rahmen speichern unter ...</guimenuitem></menuchoice> angezeigt. Klicken Sie mit der <mousebutton>linken</mousebutton> Maustaste in den Rahmen, den Sie zuerst sichern wollen.

source: If the page uses a background image, you can get and save that with the <menuchoice><guimenu>File</guimenu><guimenuitem>Save Background Image As...</guimenuitem></menuchoice> option.
de: Wenn die Seite ein Hintergrundbild verwendet, können Sie dieses mit dem Eintrag <menuchoice><guimenu>Datei</guimenu> <guimenuitem>Hintergrundbild speichern unter</guimenuitem></menuchoice> laden und speichern.

source: But if what you really want is that glorious picture of the latest Ferrari, then <mousebutton>right</mousebutton> clicking on the image will give you a drop-down menu with a <guimenuitem>Save Image As...</guimenuitem> option. Be sure to respect the owner's copyright, and ask for permission before using any pictures saved this way for anything other than your own viewing pleasure.
de: Wenn Sie jedoch ein Bild von einer Seite herunterladen möchten, klicken Sie mit der rechten Maustaste auf das Bild. Daraufhin erscheint ein Menü mit einem Eintrag <guimenuitem>Bild speichern unter ...</guimenuitem>. Beachten Sie auf jeden Fall die Rechtslage und respektieren Sie das Copyright des Besitzers, und fragen Sie nach, bevor sie ein auf diese Art gespeichertes Bild weiterverwenden.

source: If you <mousebutton>right</mousebutton> click on a link (which may be a picture) and select <guimenuitem>Save Link As...</guimenuitem> from the pop up menu the basic &HTML; or similar source text will be downloaded and saved on your local disk.
de: Ein Klick mit der &RMBn; auf eine Verknüpfung (die auch ein Bild sein kann) und anschließendes Auswählen aus dem Kontextmenü von <guimenuitem>Verknüpfung speichern unter ...</guimenuitem> , lädt den &HTML;- oder ähnlichen Quelltext und speichert ihn auf Ihrer lokalen Festplatte.

source: <mousebutton>Right</mousebutton> clicking on a link (which may be a picture) and choosing <guimenuitem>Copy Link Address</guimenuitem> will copy the &URL; of the link to the clipboard so you can then paste it into, say, an e-mail to a friend telling her about this wonderful new site.
de: Ein Rechtsklick auf eine Verknüpfung (die auch ein Bild sein kann) und anschließendes Auswählen von <guimenuitem>Verknüpfungsadresse kopieren</guimenuitem> kopiert die &URL; der Verknüpfung in die Zwischenablage. So können Sie die Verknüpfung an einer anderen Stelle einfügen, um zum Beispiel einem Freund in einer E-Mail die Verknüpfungsadresse dieser Web-Seite mitzuteilen.

source: <mousebutton>Right</mousebutton> clicking on a picture and choosing <guimenuitem>Copy Image</guimenuitem> copies the &URL; of the picture to the clipboard.
de: Ein Rechtsklick auf ein Bild und anschließendes Auswählen von <guimenuitem>Bild kopieren</guimenuitem> kopiert die &URL; des Bildes in die Zwischenablage.

source: To save a complete web page, including images, select <guimenuitem> Archive Web Page...</guimenuitem> from the <guimenu>Tools</guimenu> menu. Note that this feature is provided by a <link linkend="konq-plugin">plugin </link> and may not have been installed on your system. The web page will be saved as a single file with a <literal role="extension">.war</literal> extension and can be opened by <mousebutton>left</mousebutton> clicking on the filename in &konqueror; running in File Manager mode.
de: Um eine vollständige Webseite mit allen Bildern abzuspeichern, wählen Sie <guimenuitem>Webseite archivieren ...</guimenuitem> aus dem Menü <guimenu>Extras</guimenu>. Beachten Sie, dass diese Funktion durch ein <link linkend="konq-plugin">Modul</link> bereitgestellt wird, das auf Ihrem System möglicherweise nicht installiert wurde. Die Webseite wird als einzelne Datei mit der Endung <literal role="extension">.war</literal> abgespeichert und kann mittels Linksklick auf den Dateinamen in &konqueror; geöffnet werden, wenn er im Dateimanager-Modus läuft.

source: Printing a copy of the page you are viewing is easily done with the Menubar <menuchoice><guimenu>File</guimenu> <guimenuitem>Print...</guimenuitem></menuchoice> or <guimenuitem>Print Frame</guimenuitem> option or with the Toolbar <guiicon>Print</guiicon> button.
de: Einen Ausdruck der gerade angezeigten Seite erreichen Sie, indem Sie in der Menüleiste die Option <menuchoice><guimenu>Datei</guimenu> <guimenuitem>Drucken ...</guimenuitem></menuchoice> oder <guimenuitem>Rahmen drucken</guimenuitem> auswählen, oder den Knopf <guiicon>Drucken</guiicon> in der Werkzeugleiste betätigen.

source: &FTP;, or File Transfer Protocol, is one of the earliest, and still perhaps the best, way of transferring files between computers over the Internet.
de: &FTP; bzw. das <quote>File Transfer Protocol</quote>, ist eine der ältesten und wahrscheinlich immer noch besten Möglichkeiten, Dateien zwischen zwei Rechnern im Internet zu übertragen.

source: With &FTP; you can see files and folders on the distant computer just as if they were on your own system, download them onto your computer using &konqueror;'s normal <guimenuitem>Copy</guimenuitem> and <guimenuitem>Paste</guimenuitem> or Drag n' Drop methods and, if allowed, upload files from your machine to the other computer's filesystem. To try it, type the &URL;
de: Mit &FTP; können Sie Dateien und Ordner auf einem anderen Rechner genauso betrachten, als ob sie sich auf Ihrem Rechner befinden würden. Sie können diese Dateien mit den normalen &konqueror;-Operationen wie <guimenuitem>Kopieren</guimenuitem> und <guimenuitem>Einfügen</guimenuitem> oder Ziehen und Ablegen auf Ihren Rechner herunterladen, und, die entsprechenden Rechte vorausgesetzt, Dateien von Ihrem Rechner auf den anderen Rechner hochladen. Geben Sie doch mal die &URL;

source: into the Location Toolbar and press &Enter;. As long as you are connected to the Internet, and as long as the &kde;'s &FTP; site is not too busy, you should end up seeing the <filename class="directory">/pub/kde</filename> folder at &kde-ftp;
de: in die Adressleiste ein und drücken Sie dann &Enter;. Sofern Sie mit dem Internet verbunden sind (und die &FTP;-Seite von &kde; nicht überlastet ist), sollten Sie jetzt den Ordner <filename class="directory">/pub/kde</filename> des Rechners &kde-ftp; sehen.

source: Although, strictly speaking, &FTP; &URL;s should be entered starting with <userinput>ftp://</userinput> and <acronym>WWW </acronym> &URL;s starting with <userinput>http://</userinput> &konqueror; is usually smart enough to figure out what is meant, and insert these characters for you if you leave them out.
de: Obwohl &FTP;-&URL;s streng genommen mit dem Präfix <userinput>ftp://</userinput> und <acronym>WWW</acronym>-&URL;s mit dem Präfix <userinput>http://</userinput> beginnen sollten, ist &konqueror; im Normalfall schlau genug, um selbständig herauszufinden, was gemeint ist. Wenn Sie es nicht eingegeben haben, wird das entsprechende Präfix dann automatisch eingefügt.

source: When you access an &FTP; site it will usually need some form of username and password from you. To simplify things, most &FTP; sites that offer files for free downloading will accept the word <systemitem class="username"> anonymous</systemitem> as a username and your email address as a password, and to make your life even easier &konqueror; will automatically supply these without troubling you.
de: Wenn Sie auf eine &FTP;-Seite zugreifen, brauchen Sie gewöhnlich einen Benutzernamen und ein Passwort. Um die Dinge zu vereinfachen, akzeptieren die meisten &FTP;-Seiten, die Dateien zum kostenlosen Herunterladen anbieten, das Passwort <systemitem class="username"> anonymous</systemitem> als Benutzernamen und Ihre E-Mail-Adresse als Passwort. Um Ihnen das Leben noch einfacher zu machen, gibt &konqueror; diese Angaben automatisch im Hintergrund ein, ohne Sie zu belästigen.

source: If you try to access an &FTP; site that does not need a proper username or password but which is too busy to accept any more connections, &konqueror; often interprets the <quote>busy</quote> message as a request for a name and password and will therefore pop up a dialog box asking you to supply them.
de: Wenn Sie auf eine &FTP;-Seite zugreifen, die keinen wirklichen Benutzernamen und kein Passwort benötigt, die jedoch wegen zu hoher Belastung keine Verbindungen mehr akzeptiert, interpretiert &konqueror; die <quote>Besetzt</quote>-Meldung häufig als Anforderung eines Benutzernamens bzw. Passworts und präsentiert Ihnen ein Dialogfenster mit der Aufforderung diese anzugeben.

source: Sites that are more concerned with security will need a proper username and password, in which case &konqueror; will ask you for them or you can include the username in the &URL; you type into the Location Toolbar, as for example
de: Seiten, die mehr Wert auf Sicherheit legen, verlangen einen richtigen Benutzernamen samt Passwort von Ihnen. In diesem Fall wird &konqueror; bei Ihnen nachfragen. Sie können den Benutzernamen jedoch auch gleich zusammen mit der &URL; in der Adressleiste angeben, zum Beispiel

source: &konqueror; will then prompt you for the password.
de: &konqueror; fordert Sie dann zur Eingabe des Passwortes auf.

source: &konqueror; can also support automatic logins as specified in a <filename>.netrc</filename> file. Details of how to enable this feature are given at <ulink url="http://www.konqueror.org/faq.html#netrc"> http://www.konqueror.org/faq.html#netrc</ulink>
de: &konqueror; kann auch automatische Anmeldungen unterstützen, wie sie in einer <filename>.netrc</filename>-Datei festgelegt werden. Einzelheiten über die Aktivierung dieses Merkmals finden Sie unter <ulink url="http://www.konqueror.org/faq.html#netrc"> http://www.konqueror.org/faq.html#netrc</ulink>

source: &URL;s with Port Numbers
de: &URL;s mit Portnummern

source: If you specify a port number in your &URL;, as in for example <userinput>http://intranet.corp.com:1080</userinput>, you might get the error message <quote>Access to restricted port in POST denied</quote>. This is done for security reasons. If you nevertheless need to access a server on this port, just add a key line <screen><userinput> OverridenPorts=CommaSeparatedListOfAllowedPorts </userinput></screen> to <filename>$KDEDIR/share/config/kio_httprc </filename> or <filename>~/.kde/share/config/kio_httprc</filename>.
de: Wenn Sie in Ihrer &URL; eine Portnummer angeben, beispielsweise <userinput>http://intranet.corp.com:1080</userinput>, kann es sein, dass Sie die Fehlermeldung <quote>Access to restricted port in POST denied</quote> erhalten (Zugriff auf den Port verweigert). Dies geschieht aus Sicherheitsgründen. Wenn Sie trotz allem Zugriff auf einen Server über diesen Port benötigen, fügen Sie eine Schlüsselzeile <screen><userinput> OverridenPorts=Durch_Komma_getrennte_Portliste </userinput></screen> zu <filename>$KDEDIR/share/config/kio_httprc </filename> oder <filename>~/.kde/share/config/kio_httprc</filename> hinzu.

source: For example <screen><userinput>OverridenPorts=23,15 </userinput></screen> (it should not include any embedded spaces).
de: Zum Beispiel <screen><userinput>OverridenPorts=23,15 </userinput></screen> (Leerzeichen sind nicht erlaubt).

source: &konqueror; will reject the following ports (the list is hardcoded in <filename>kdelibs/kio/kio/job.cpp</filename>):
de: &konqueror; verweigert Verbindungen über die folgenden Ports (die Liste wurde in <filename>kdelibs/kio/kio/job.cpp</filename> hartkodiert):

source: Automatic Text Completion
de: Automatische Textvervollständigung

source: You can get &konqueror; to help you enter a path or &URL; into the Location Toolbar by enabling one of the <guimenuitem>Text Completion</guimenuitem> features. To do this <mousebutton>right</mousebutton> click on a clear part of the Location Toolbar text entry box and select <guisubmenu>Text Completion</guisubmenu> from the pop up menu. This will let you choose between the following options:
de: &konqueror; kann Ihnen bei der Eingabe von Pfaden oder &URL;s in die Adressleiste helfen, wenn Sie eine der Funktionen unter <guimenuitem>Text-Ergänzung</guimenuitem> einschalten. Dazu müssen Sie mit der <mousebutton>rechten</mousebutton> Maustaste auf einen leeren Teil der Adressleiste klicken und <guisubmenu>Textvervollständigung</guisubmenu> auswählen. Dann können Sie unter den folgenden Möglichkeiten wählen:

source: None
de: Keine

source: What you get is what you type.
de: Ihre Eingabe wird genau übernommen.

source: Manual
de: Manuell

source: When you have typed part of a path or &URL;, pressing <keycombo action="simul">&Ctrl;<keycap>E</keycap></keycombo> or &Tab; will complete the entry if it is possible to do so unambiguously.
de: Wenn Sie bereits einen Teil eines Pfades oder einer &URL; eingegeben haben, können Sie durch Drücken von <keycombo action="simul">&Ctrl;<keycap>E</keycap></keycombo> oder der &Tab;ulatortaste den Eintrag vervollständigen, falls dies eindeutig möglich ist.

source: Automatic
de: Automatisch

source: As you type into the Location Toolbar window &konqueror; will automatically extend what you type to complete one possible path or &URL;, highlighting the characters it has added. Continue typing if that's not what you wanted or press &Enter; to accept it.
de: Während Sie etwas in die Adressleiste eingeben, vervollständigt &konqueror; automatisch die Eingabe zu einem möglichen Pfad bzw. einer &URL;, wobei die hinzugefügten Zeichen hervorgehoben werden. Wenn der Vorschlag nicht mit der von Ihnen gewünschten Eingabe übereinstimmt, tippen Sie einfach weiter. Falls Sie mit dem angezeigten Vorschlag einverstanden sind, bestätigen Sie ihn mit <keycap>Eingabe</keycap>.

source: Dropdown List
de: Aufklappmenü

source: A drop-down window will appear as you type, showing the possible matches to what you have typed so far. When the path or &URL; that you want appears in the window click on it with the &LMB;. You can also use the <keysym>Down Arrow</keysym> or &Tab; and <keysym>Up Arrow</keysym> or <keycombo action="simul">&Shift;&Tab;</keycombo> keys to select it then press &Enter;.
de: Während Sie tippen, zeigt &konqueror; ein kleines Aufklappfenster an, das alle möglichen Übereinstimmungen zu Ihrer bisherigen Eingabe anzeigt. Wenn der von Ihnen gewünschte Pfad oder die &URL; angezeigt wird, können Sie den Eintrag mit einem Klick mit der &LMBn;, mit <keysym>Pfeil runter</keysym> oder &Tab; und <keysym>Pfeil hoch</keysym> oder <keycombo action="simul">&Shift;&Tab;</keycombo> auswählen und mit &Enter; bestätigen.

source: Short Automatic
de: Automatisch kurz

source: This is like Automatic mode except that it only extends what you have typed as far as the next <keycap>/</keycap> symbol in the path or &URL;. Press <keycombo action="simul">&Ctrl;<keycap>E</keycap></keycombo> or &Tab; to accept the suggestion, &Enter; when the complete path or &URL; is shown.
de: Dies ähnelt dem Modus <quote>Automatisch</quote>, jedoch wird die Vervollständigung nur bis zum nächsten <keycap>/</keycap>-Symbol im Pfad oder der &URL; vorgenommen. Drücken Sie <keycombo action="simul">&Ctrl;<keycap>E</keycap></keycombo> oder die &Tab;ulatortaste, um den Vorschlag zu akzeptieren, und die &Enter;taste, wenn der vollständige Pfad oder die &URL; angezeigt wird.

source: Dropdown List &amp; Automatic
de: Aufklappmenü &amp; Automatik

source: This is a combination of both options described above.
de: Dies ist eine Kombination der vorher beschriebenen Einstellungen.

source: Default
de: Standard

source: This item appears at the bottom of the submenu and enables you to switch to the default behaviour <guimenuitem>Dropdown List</guimenuitem>.
de: Dieser Eintrag erscheint am Ende des Untermenüs. Mit dieser Auswahl können Sie zur Standardeinstellung <guimenuitem>Aufklappmenü</guimenuitem> wechseln.

source: You should try out these different modes and pick the one that suits you best.
de: Sie sollten diese unterschiedlichen Modi ausprobieren und den auswählen, der Ihnen am besten gefällt.

source: The history of recently visited &URL;s that &konqueror; uses for the Text Completion function can be viewed and edited in the <guilabel>History </guilabel> page of the <link linkend="sidebar">Sidebar</link>.
de: Die bisher besuchten &URL;s, die von &konqueror; für die Textvervollständigung benutzt werden, können auf der Seite <guilabel>Verlauf</guilabel> des <link linkend="sidebar">Navigationsbereiches </link> betrachtet und bearbeitet werden.

source: Using Bookmarks
de: Verwendung von Lesezeichen

source: Although you can use &konqueror;'s bookmarks to record the locations of your own files and folders, they are most useful when you are surfing the Web, letting you build up a list of useful sites.
de: Sie können Lesezeichen in &konqueror; zwar auch benutzen, um häufig benutzte Dateien und Ordner auf Ihrer Festplatte aufzulisten, die Lesezeichen werden aber erst dann wirklich nützlich, wenn Sie sie im Internet einsetzen, um eine Liste nützlicher Seiten aufzubauen

source: To open the <guimenu>Bookmarks</guimenu> menu <mousebutton>left</mousebutton> click on the <guimenu>Bookmarks</guimenu> menu. Once the list is visible, you can navigate through it with the arrow keys or with your mouse, then press &Enter; or <mousebutton>left</mousebutton> click to visit the selected location.
de: Zum Öffnen des Menüs <guimenu>Lesezeichen</guimenu> können Sie mit der &LMBn; in der Menüleiste auf den Eintrag <guimenu>Lesezeichen</guimenu> klicken. Sobald die Liste sichtbar ist, können Sie die Pfeiltasten oder Ihre Maus benutzen, um den gewünschten Eintrag zu erreichen. Ein anschließendes Drücken der <keycap>Eingabe</keycap>-Taste oder ein Linksklick auf den Eintrag ruft die gewünschte Seite auf.

source: To add a new item to the list use <menuchoice><guimenu>Bookmarks </guimenu><guimenuitem>Add Bookmark</guimenuitem></menuchoice> or <keycombo action="simul">&Ctrl;<keycap>B</keycap></keycombo> or <mousebutton>right</mousebutton> click on a clear space in the web page or folder view and select <guimenuitem>Bookmark this Page</guimenuitem> / <guimenuitem>Bookmark this Location</guimenuitem> from the pop up menu.
de: Ein neues Lesezeichen können Sie durch Auswahl von <menuchoice><guimenu>Lesezeichen</guimenu> <guimenuitem>Lesezeichen hinzufügen</guimenuitem></menuchoice> oder Drücken der Tastenkombination <keycombo action="simul">&Ctrl;<keycap>B</keycap></keycombo> hinzufügen oder Sie wählen nach einem Rechtsklick auf einen freien Bereich der Webseite oder der Ordneransicht den Eintrag <guimenuitem>Lesezeichen für diese Seite</guimenuitem> / <guimenuitem>Lesezeichen für diese Adresse</guimenuitem> aus dem Kontextmenü.

source: The <guimenu>Bookmarks</guimenu> list can contain subfolders containing other bookmarks, you can create these with <menuchoice><guimenu>Bookmarks </guimenu><guimenuitem>New Bookmark Folder...</guimenuitem></menuchoice> To add a bookmark into a subfolder rather than into the main Bookmark list, select the folder from within the <guimenu>Bookmarks</guimenu> list and use the <guimenuitem>Add Bookmark</guimenuitem> item in that folder.
de: Die <guimenu>Lesezeichen</guimenu>-Liste kann Unterordner mit weiteren Lesezeichen enthalten. Sie können diese mittels <menuchoice><guimenu>Lesezeichen </guimenu><guimenuitem>Neuer Lesezeichenordner ...</guimenuitem></menuchoice> anlegen. Um ein Lesezeichen in einem Unterordner des Hauptlesezeichenordners zu erstellen, wählen Sie diesen Ordner im Menü <guimenu>Lesezeichen</guimenu> aus und benutzen in diesem Ordner die Funktion <guimenuitem>Lesezeichen hinzufügen</guimenuitem>.

source: You can also access your bookmarks from the <link linkend="sidebar"> <guilabel>Sidebar</guilabel></link> or from the <guilabel>Bookmark Toolbar</guilabel>.
de: Sie können auch über den <link linkend="sidebar"> <guilabel>Navigationsbereich</guilabel></link> oder die <guilabel>Lesezeichenleiste</guilabel> auf Ihre Lesezeichen zugreifen.

source: If you enter <userinput>bookmarks:/</userinput> in the location bar the bookmarks home page with an overview of all bookmarks and folders is shown.
de: Wenn Sie <userinput>bookmarks:/</userinput> in der Adressleiste eingeben, wird eine Übersicht aller Lesezeichen und -Ordner angezeigt.

source: The Bookmark Editor
de: Der Lesezeichen-Editor

source: The <menuchoice><guimenu>Bookmarks</guimenu><guimenuitem>Edit Bookmarks</guimenuitem> </menuchoice> option opens the <guilabel>Bookmark Editor</guilabel>.
de: Die Option <menuchoice><guimenu>Lesezeichen</guimenu> <guimenuitem>Lesezeichen bearbeiten</guimenuitem> </menuchoice> öffnet den <guilabel>Lesezeichen-Editor</guilabel>.
