Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/applications/konqueror.po
Languages: de

source: The Foreground color option has a selector for choosing the foreground color of the gallery, this includes the text areas.
de: Mit der Option <quote>Vordergrundfarbe</quote> wählen Sie die Vordergrundfarbe in der Galerie, einschließlich der Textbereiche.

source: Background color
de: Hintergrundfarbe

source: The Background color option has a selector for choosing the background color of the gallery.
de: Mit der Option <quote>Hintergrundfarbe</quote> wählen Sie die Hintergrundfarbe in der Galerie.

source: Folders
de: Ordner

source: The Folders dialog is used for choosing where to save the gallery. This dialog is also used to configure which folders are used.
de: Im Dialog Ordner legen Sie fest, wo die Galerie gespeichert wird und welche Unterordner einbezogen werden sollen.

source: Folders Dialog Screenshot
de: Bildschirmfoto des Dialogs Ordner

source: Save to HTML file
de: Speichern in HTML-Datei

source: The Save to file selector allows you to decide where you want to save your image gallery html page.
de: In der Dateiauswahl <quote>Speichern in HTML-Datei</quote> geben Sie an, wo die HTML-Seite gespeichert werden soll.

source: Recurse subfolders
de: Unterordner einbeziehen

source: The Recurse subfolders check box enables recursing of subdirectories. If the check box is enabled, a slider and spin box are enabled to select the recursion depth.
de: Mit dem Ankreuzfeld <quote>Unterordner einbeziehen</quote> können Sie mit einem Schieberegler oder einem Drehfeld einstellen, bis zu welcher Ebene die Unterordner einbezogen werden.

source: Copy original files
de: Originalbilder kopieren

source: The Copy original files check box creates an image folder storing copies of the original images used in the gallery.
de: Mit den Ankreuzfeld <quote>Originalbilder kopieren</quote> legen Sie fest, ob die Originalbilder in die Galerie kopiert werden sollen.

source: Use comment file
de: Kommentardatei verwenden

source: The use comment file check box enables a file selector to choose a comments file to use with your gallery. The comment file contains the subtitles for the images.
de: Mit den Ankreuzfeld <quote>Kommentardatei verwenden</quote> können Sie eine Kommentardatei für die Beschriftung der Bilder in der Galerie angeben. Die Kommentardatei enthält die Untertitel der Bilder.

source: The format of this file is:
de: Die Datei hat folgendes Format:

source: # this is a comment, lines starting with '#' are ignored FILENAME1: Description FILENAME2: Description
de: # dies ist ein Kommentar, Zeilen mit '#' am Anfang werden ignoriert DATEINAME1: BESCHREIBUNG DATEINAME2: BESCHREIBUNG

source: Thumbnails
de: Minivorschau

source: The thumbnails dialog is used for adjusting the properties of the thumbnails in the gallery.
de: Im Dialog Minivorschau können Sie die Eigenschaften der Vorschaubilder in der Galerie einstellen.

source: Thumbnails Dialog Screenshot
de: Bildschirmfoto des Minivorschau-Dialogs

source: Image format for the thumbnails
de: Bildformat für die Minivorschau

source: The image format combo box allows you to choose which format is used for the thumbnail images.
de: Im Kombinationsfeld <quote>Bildformat für die Minivorschau</quote> können Sie ein Format für die Minibilder wählen.

source: Thumbnail size
de: Größe der Minivorschau

source: The thumbnail size option provides a slider and spin box for adjusting the size of the thumbnails used in the gallery.
de: Mit der Option <quote>Größe der Minivorschau</quote> können Sie die Bildergröße in der Galerie einstellen.

source: Set different color depth
de: Eigene Farbtiefe angeben

source: The set different color depth check box enables a combo box for changing the color depth of the thumbnails if you wish to use a different color depth to that used in the original image.
de: Im Ankreuzfeld <quote>Eigene Farbtiefe angeben</quote> können Sie für die Minivorschaubilder eine andere Farbtiefe als in den Originalbildern einstellen.

source: Search Bar
de: Suchleiste

source: Provides a text box for easy access to search engines such as Google. Clicking on the icon on the left side of the search box opens a menu to select and enable different search engines and configure their <ulink url="help:/kcontrol/ebrowsing/index.html">Web Shortcuts</ulink>.
de: Dieses Modul stellt ein Textfeld für den direkten Zugriff auf Suchmaschinen wie Google zur Verfügung. Klicken Sie auf das Symbol links im Textfeld, um ein Menü zur Auswahl und Aktivierung von verschiedenen Suchmaschinen zu öffnen. In diesem Menü können Sie auch den Dialog zur Einrichtung der <ulink url="help:/kcontrol/ebrowsing/index.html">Web-Kürzel</ulink> öffnen.

source: Shell Command Plugin
de: Shell-Befehl-Erweiterung

source: This plugin enables you to execute a shell command in the current folder and view the output in a separate window.
de: Mit diesem Modul können Sie einen Shell-Befehl im aktuellen Ordner ausführen. Die Ausgabe des Befehls wird in einem eigenen Fenster angezeigt.

source: View Mode Extensions
de: Erweiterungen für den Ansichtsmodus

source: &konqueror; provides additional views in <menuchoice><guimenu>View</guimenu> <guisubmenu>View Mode</guisubmenu></menuchoice> in file manager and browser mode, if the corresponding applications and plugins are installed.
de: &konqueror; bietet zusätzliche Ansichten im Menü <menuchoice><guimenu>Ansicht</guimenu> <guisubmenu>Anzeigemodus</guisubmenu></menuchoice> im Dateiverwaltungs- und Browser-Modus, wenn die zugehörigen Programme und Module installiert sind.

source: The file manager mode has the additional views <guimenuitem>Radial Map</guimenuitem> from the application <application>Filelight</application> and the &konqueror; plugin <guimenuitem>File Size View</guimenuitem>.
de: Für den Dateiverwaltungs-Modus gibt es als zusätzliche Anzeigemodi die <guimenuitem>Kreisförmige Darstellung</guimenuitem> vom Programm <application>Filelight</application> und das &konqueror;-Modul <guimenuitem>Dateigrößen-Ansicht</guimenuitem>.

source: &fsview; - the File System View
de: &fsview; - Die Dateisystem-Ansicht

source: Introduction
de: Einführung

source: The &fsview; Plugin for &konqueror; is another view mode for objects of mimetype <literal>inode/directory</literal> for local files. It can be viewed as an alternative to the various iconviews and listviews for browsing the content of your local file system.
de: Das Modul &fsview; für &konqueror; stellt eine weitere Ansicht für Objekte mit dem MIME-Type <literal>inode/directory</literal> bei lokalen Dateien dar. Sie kann als Alternative für die verschiedenen Symbol- und Text-Ansichten verwendet werden, um damit den Inhalt Ihres lokalen Dateisystems anzusehen.

source: The unique property of &fsview; is its ability to show whole nested folder hierarchies using a so-called tree map for graphical visualization. Tree maps allow for displaying metrics of objects in nested structures: each object is represented by a rectangle whose area is proportional to its metric. The sum of the children's metrics must be equal to or smaller than the parent object's metric.
de: Die Besonderheit von &fsview; besteht darin, verschachtelte Ordnerhierarchien mit Hilfe einer sogenannten Tree-Map grafisch darzustellen. Tree-Maps erlauben die Darstellung der Größe von Objekten in verschachtelten Strukturen. Jedes Objekt wird durch ein Rechteck dargestellt, dessen Fläche proportional zu seiner Größe ist. Diese Größe muss die Eigenschaft besitzen, dass die Summe der Größen der untergeordneten Objekte eines Objektes kleiner oder gleich der Größe des Objektes ist.

source: For &fsview;, sizes of files and folders are chosen as the metric, where the size of a folder is defined to be the sum of the sizes of its subitems. This way, big files even deep down in the folder hierarchy can be spotted easily be looking for large rectangles. So &fsview; can be looked at as a graphical and interactive version of the &UNIX; <command>du</command> command.
de: Bei &fsview; spiegelt die Größe die Größe einer Datei oder eines Ordners dar, wobei die Größe eines Ordners als die Summe der Größe der Einträge darin festgelegt ist. Auf diese Weise können große Dateien, selbst dann leicht erkannt werden, wenn sie weit unten in der Ordnerhierarchie liegt. Demzufolge kann &fsview; als eine grafische und interaktive Version des &UNIX;-Befehls <command>du</command> betrachtet werden.

source: The integration of &fsview; as part of Konqueror allows it to use the standard features such as context file menus, and mime type sensitive actions. But it was chosen not to implement automatic update by watching file system changes: if you delete a file shown in &fsview; outside of &konqueror;, you have to update manually by &eg; pressing <keycap>F5</keycap> to see the change. The reason for this decision is the potentially huge number of files which would have to be watched for changes, and thus, could put an unreasonable pressure on system resources for a small feature.
de: Die Integration von &fsview; in &konqueror; ermöglicht die Verwendung von Standardfunktionalitäten wie Kontextmenüs für Dateien und Aktionen, die vom MIME-Type abhängig sind. Hierbei wurde jedoch auf eine automatische Aktualisierung der Ansicht bei Änderungen im Dateisystem verzichtet. Wenn sie außerhalb von &konqueror; eine Datei löschen, die in &fsview; angezeigt wird, müssen Sie die Ansicht durch Drücken von <keycap>F5</keycap> selbst aktualisieren. Der Grund für diese Entscheidung liegt in der potentiell riesigen Anzahl an Dateien, die auf Änderungen überwacht werden müssten. In diesem Fall würde eine eher unbedeutende Funktionalität enorme Anforderungen an die Systemressourcen stellen.

source: Visualization Features
de: Darstellungseigenschaften

source: This section explains the graphical visualization of &fsview; in detail.
de: Dieser Abschnitt erläutert die grafische Darstellung von &fsview; im Detail.

source: Item Drawing Options
de: Darstellungsoptionen für Einträge

source: In &fsview;, an item of the tree map visualization is a rectangle representing a file or folder of your file system. For easier navigation, rectangles have meaningful coloring and labeling options.
de: In &fsview; ist ein Eintrag in der Baumstruktur-Darstellung ein Rechteck, das eine Datei oder einen Ordner in Ihrem Dateisystem repräsentiert. Zur einfacheren Navigation besitzen die Rechtecke sinnvolle Farbgebungs- und Beschriftungseinstellungen.

source: The color of a rectangle, switchable via menu item <menuchoice><guimenu>View</guimenu><guisubmenu>Color Mode</guisubmenu></menuchoice> can be either representative of <guimenuitem>Depth</guimenuitem>, for easy detection of nesting, or a color mapping of different file attributes such as name, owner, group, or mime type.
de: Die Farbe eines Rechtecks, die über <menuchoice><guimenu>Ansicht</guimenu> <guisubmenu>Farbmodus</guisubmenu></menuchoice> umgeschaltet wird, kann entweder <guimenuitem>Tiefe</guimenuitem> für die leichte Erkennung der Verschachtelungstiefe oder die Abbildung einer anderen Dateieigenschaft wie Name, Eigentümer, Gruppe oder MIME-Typ darstellen.

source: A rectangle can be labeled with the various attributes of the corresponding file or folder. For each attribute, you can choose whether it should be shown at all, only if space is available, or if space should be taken from children (thus introducing errors to pure tree map drawing constraints). Additionally, you can choose the relative location of the label in the rectangle.
de: Ein Rechteck kann mit den verschiedenen Eigenschaften der entsprechenden Datei oder des Ordners beschriftet werden. Für jede Eigenschaft können Sie festlegen, ob sie überhaupt angezeigt wird, nur dann, wenn genügend Platz zur Darstellung vorhanden ist oder ob die Fläche von untergeordneten Rechtecken verwendet werden soll (wobei folglich Darstellungsfehler durch Einschränkungen beim Zeichen der Baumstruktur auftreten). Darüber hinaus können Sie die relative Position der Beschriftung im Rechteck festlegen.

source: TreeMap Drawing Algorithms
de: Darstellungsalgorithmen für die Baumstruktur

source: For drawing algorithms in tree maps, the rule that the area is proportional to the metric of an item should hold true. With the tree map in &fsview;, this goal isn't always met: we draw borders to show the nesting of items, and this border takes space for an item which is possibly lost for the areas of child items. Note that less space is lost for the border if the rectangle is quadratic.
de: Bei Darstellungsalgorithmen für Baumstrukturen sollte die Regel eingehalten werden, dass die Fläche proportional zur Größe des Eintrags ist. Bei der Baumstruktur in &fsview; wird dieses Ziel nicht immer eingehalten. Es werden Rahmen gezeichnet, um die Verschachtelung der Einträge darzustellen, und diese Rahmen benötigen Platz, der dann den untergeordneten Einträgen nicht mehr zur Verfügung steht. Beachten Sie, dass weniger Platz für den Rahmen verloren geht, wenn das Rechteck quadratisch ist.

source: Similarly, it is better for a good overview to let each rectangle at least have its name as a label. It is an option to always force space for labels, or only to draw labels when empty space is available. In the latter case, the tool tips appearing when the mouse is held over an item can help a lot. They show information for the item the mouse is currently over, together with its parent folders up to the root item of the tree map.
de: Zur besseren Übersicht dient ebenso, dass alle Rechtecke zumindest mit ihrem Namen beschriftet sind, wodurch wiederum Platz verloren geht. Sie können einstellen, ob immer Platz für Beschriftungen zur Verfügung gestellt wird oder diese nur dargestellt werden, wenn genügend Platz vorhanden ist. Im letzteren Fall können die Kurzinfos hilfreich sein, die erscheinen, wenn der Mauszeiger über einem Eintrag verweilt. Sie zeigen Informationen zu dem Eintrag, über dem sich der Mauszeiger gerade befindet sowie die Beziehungen des Eintrags zu übergeordneten Einträgen bis zur Wurzel der Baumstruktur.

source: How the space of an item is split into subareas for children is left to the implementation. It is always better to try to split areas in such a way that rectangles are as quadratic as possible, both for labeling and less space lost by borders. The best methods in this regard are <guilabel>Rows</guilabel>, <guilabel>Columns</guilabel>, or <guilabel>Recursive Bisection</guilabel>.
de: Wie Aufteilung der Fläche eines Eintrags für die untergeordneten Einträge erfolgt, bleibt der Implementierung überlassen. Hierbei ist es für das Beschriften und zur Vermeidung von Platzverlusten durch Rahmen immer vorteilhaft die Flächen so aufzuteilen, dass Rechtecke entstehen, die möglichst quadratisch sind. Die besten Methoden diesbezüglich sind <guilabel>Zeilen</guilabel>, <guilabel>Spalten</guilabel> oder <guilabel>Rekursive Zweiteilung</guilabel>.

source: You can choose the minimal area of items to be drawn via the menu item <menuchoice><guimenu>View</guimenu><guimenuitem>Stop at Area</guimenuitem></menuchoice>. Instead, a hash pattern will be drawn over the parents area to signal that this space is in fact occupied by a child or children.
de: Sie können die minimal dargestellte Fläche für einen Eintrag über den Menüeintrag <menuchoice><guimenu>Ansicht</guimenu><guimenuitem>Anhalten bei Fläche</guimenuitem></menuchoice> festlegen. Stattdessen wird ein Rautenmuster in die Fläche des übergeordneten Eintrags gezeichnet, um anzuzeigen, dass diese Fläche eigentlich durch einen untergeordneten Eintrag belegt ist.

source: User Interface
de: Benutzerschnittstelle

source: &fsview; supports multiple selection of items, similar to the iconview and listview. This allows for actions to be done simultaneously to a set of files. A simple mouse click always selects a single item below the mouse pointer. Use a mouse click in combination with pressing the &Shift; key for range selection or the &Ctrl; key for selection toggle. Note that by selecting an item, subitems can no longer be selected. Selecting an item will also clear the selection of all its parent items before.
de: &fsview; erlaubt wie die Symbol- und Text-Ansicht die Auswahl mehrere Einträge. Dadurch werden Aktionen möglich, die sich gleichzeitig auf mehrere Dateien auswirken. Ein einfacher Mausklick wählt den Eintrag unter dem Mauszeiger. Ein Mausklick in Verbindung mit &Shift;taste markiert einen Bereich, Die Taste &Ctrl; ermöglicht die Auswahl und Abwahl der Einträge. Beachten Sie, dass bei Markierung eines Eintrag die untergeordneten Einträge nicht mehr ausgewählt werden können. Demzufolge hebt die Markierung eines Eintrags die Markierung aller übergeordneten Einträge auf.

source: Keyboard navigation is available in tree maps: use <keycap>Left Arrow</keycap> and <keycap>Right Arrow</keycap> keys to move the current item between siblings, and the <keycap>Up Arrow</keycap> and <keycap>Down Arrow</keycap> keys to go up and down the nesting hierarchy. <keycap>Space</keycap> selects the item; in conjunction with &Shift; does range selection; and with the &Ctrl; key held down simultaneously, toggles selection of the current item. Press <keycap>Return</keycap> to run the open action on the current item.
de: In Baumstrukturen ist ein Navigieren mit der Tastatur möglich: Verwenden Sie die Tasten <keycap>Pfeil links</keycap> und <keycap>Pfeil rechts</keycap> um sich zwischen Geschwisterelementen zu bewegen, <keycap>Pfeil hoch</keycap> und <keycap>Pfeil runter</keycap> um in der Hierarchie die Ebenen zu wechseln. Die Taste <keycap>Leerzeichen</keycap> markiert einen Eintrag und ermöglicht zusammen mit der &Shift;taste die Markierung von Bereichen. In Verbindung mit &Ctrl; wird der aktuelle Eintrag markiert oder die Markierung aufgehoben. Um die Aktion <quote>Öffnen</quote> für den aktuellen Eintrag aufzurufen, drücken Sie die Taste <keycap>Eingabe</keycap>.

source: Credits and License
de: Danksagungen und Lizenz

source: Originally, &fsview; was meant as a small test application and usage tutorial for the TreeMap widget developed within <application>KCachegrind</application>.
de: Ursprünglich war &fsview; als kleine Testanwendung und Einführung in die Verwendung des Baumstruktur-Widgets gedacht, das für die Anwendung <application>KCachegrind</application> entwickelt wurde.

source: Copyright by Josef Weidendorfer, licensed using GPL V2.
de: Copyright Josef Weidendorfer, unter der Lizenz GPL V2.

source: Configuring &konqueror;
de: Einrichten von &konqueror;

source: In common with the rest of &kde;, &konqueror; is highly configurable, so you can really get the look and feel that best fits your needs and wishes.
de: Genau wie alle anderen &kde;-Anwendungen ist &konqueror; äußerst flexibel, sodass Sie das Programm optimal an Ihre Bedürfnisse und Wünsche anpassen können.

source: Toolbars
de: Werkzeugleisten

source: When &kde; is newly installed, &konqueror;'s window contains a Menubar, Main and Location Toolbars and possibly a Bookmark Toolbar.
de: Wenn &kde; neu installiert wurde, enthält das &konqueror;-Fenster eine Menüleiste, eine Werkzeugleiste, eine Adressleiste und evtl. eine Lesezeichenleiste.

source: Maybe you don't need all these toolbars. To hide one of them, go into the <menuchoice><guimenu>Settings</guimenu><guisubmenu>Toolbars Shown</guisubmenu> </menuchoice> menu and uncheck its box. To show a hidden toolbar, just check the box.
de: Vielleicht brauchen Sie nicht alle diese Werkzeugleisten. Wenn Sie eine ausblenden wollen, gehen Sie in das Menü <menuchoice><guimenu>Einstellungen</guimenu><guisubmenu>Werkzeugleisten</guisubmenu> </menuchoice> und deaktivieren die betreffenden Leisten. Um eine ausgeblendete Leiste wieder anzuzeigen, kreuzen Sie sie einfach wieder an.

source: The Menubar itself can be toggled on and off with the shortcut key combination <keycombo action="simul">&Ctrl;<keycap>M</keycap></keycombo>.
de: Die Menüleiste selbst kann mit der Tastenkombination <keycombo action="simul">&Ctrl;<keycap>M</keycap></keycombo> angezeigt bzw. ausgeblendet werden.

source: If you <mousebutton>right</mousebutton> click on a Toolbar, you will get a menu to configure this bar. You can lock or unlock the toolbar position and choose the text position, icon size and the orientation of unlocked bars.
de: Wenn Sie die Werkzeugleiste mit &RMBn; anklicken, erhalten Sie deren Kontextmenü. Sie können dort die Werkzeugleiste sperren oder entsperren; und die Ausrichtung, Textposition und Symbolgröße für nicht gesperrte Leisten ändern.

source: If the toolbars are unlocked, on the left hand end of each bar you can see some handles. By &LMB; clicking on them, you can drag a bar into a new position and even detach it from the window and place it anywhere on your screen.
de: Wenn die Werkzeugleisten nicht gesperrt sind, erscheint an der linken Seite jeder Leiste ein Anfassersymbol. Wenn Sie mit der &LMBn; darauf klicken, können Sie die Leiste in eine neue Position verschieben oder sogar vom Fenster lösen und irgendwo auf dem Bildschirm anordnen.

source: The icons shown in the various bars can be changed by using the <menuchoice><guimenu>Settings</guimenu> <guimenuitem>Configure Toolbars...</guimenuitem></menuchoice> option, which brings up the <guilabel>Configure Toolbars</guilabel> dialog box. The number and type of these toolbars will depend on whether &konqueror; is in Web Browser or File Manager mode and whether you have &konqueror; plugins installed.
de: Die Symbole, die in den verschiedenen Leisten angezeigt werden, können mit <menuchoice><guimenu>Einstellungen</guimenu><guimenuitem>Werkzeugleisten einrichten ...</guimenuitem></menuchoice> verändert werden. Dadurch wird das Dialogfenster <guilabel>Werkzeugleisten einrichten</guilabel> geöffnet. Anzahl und Typ der angezeigten Werkzeugleisten hängt davon ab, ob &konqueror; sich im Webbrowser- oder Dateiverwaltungsmodus befindet und ob Sie zusätzliche &konqueror;-Module installiert haben.

source: Shortcuts
de: Kurzbefehle

source: To change the shortcut key arrangements used by &konqueror; select <menuchoice><guimenu>Settings</guimenu><guimenuitem>Configure Shortcuts... </guimenuitem></menuchoice>. This will launch a dialog box as shown below.
de: Um die von &konqueror; benutzten Kurzbefehle zu ändern, rufen Sie <menuchoice><guimenu>Einstellungen</guimenu><guimenuitem>Kurzbefehle festlegen ...</guimenuitem></menuchoice> auf. Dies öffnet einen Dialog, wie Sie Ihn unten sehen können.

source: Shortcut config screenshot 1
de: Bildschirmfoto 1: Kurzbefehle festlegen

source: Use the search box to find the action you want to add or change the shortcut keys for and select it by <mousebutton>left</mousebutton> clicking on the name.
de: Mit dem Suchfeld können Sie die angezeigten Aktionen in der Liste filtern und dann durch Klicken mit der &LMBn; auf den Namen einen Kurzbefehl zur Bearbeitung auswählen.

source: After you have selected an action in the list you will notice that this item is highlighted and you see two additional check boxes below this item in the list view. There you can configure a combination of keys or maybe no key binding at all for the selected action.
de: Nachdem Sie eine Aktion ausgewählt haben, wird diese Zeile hervorgehoben und zwei zusätzliche Ankreuzfelder unter diesem Eintrag in der Liste angezeigt werden. Sie können mit diesen Ankreuzfeldern Tastenkombinationen für die gewählte Aktion bearbeiten oder vorhandene Tastenkombination löschen.

source: Shortcut config screenshot 2
de: Bildschirmfoto 2: Kurzbefehle festlegen
