Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/applications/konqueror.po
Languages: de

source: The &konqueror; Handbook
de: Das Handbuch zu &konqueror;

source: The &kde; Team
de: Das &kde;-Team

source: Developers
de: Entwickler

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Thomas</firstname><surname>Diehl</surname><affiliation><address><email>thd@kde.org</email></address></affiliation><contrib>Übersetzung der Benutzeroberfläche</contrib></othercredit> <othercredit role="translator"><firstname>Stefan</firstname><surname>Winter</surname><affiliation><address><email>kickdown@online.de</email></address></affiliation> <contrib>Übersetzung des Handbuches</contrib></othercredit> <othercredit role="translator"><firstname>Uwe</firstname><surname>Krieg</surname><affiliation><address><email>u.krieg@gmx.de</email></address></affiliation> <contrib>Übersetzung des Handbuches</contrib></othercredit>

source: &konqueror; is &kde;'s advanced File Manager, Web Browser and Universal Viewing Application.
de: &konqueror; ist der Dateimanager, Internet-Browser und universelle Dokumentenbetrachter von &kde;.

source: File Manager
de: Dateimanager

source: Browser
de: Internet-Browser

source: Viewer
de: Betrachter

source: Overview
de: Übersicht

source: <emphasis>&konqueror;</emphasis> is an advanced <link linkend="filemanager">file manager</link> for the &kde; Software compilation, providing file management functions ranging from simple cut/copy and paste operations to advanced local and remote network file browsing. Folder contents can be displayed in a variety of text and icon <link linkend="viewmode">view modes</link>, which can include thumbnail preview images of file contents. File and folder properties can easily be examined and changed, and applications launched with a simple click of the &LMB;.
de: <emphasis>&konqueror;</emphasis> ist ein fortschrittlicher <link linkend="filemanager">Dateimanager</link> für &kde; SC mit diversen Funktionen für die Dateiverwaltung: Diese reichen von einfachen Ausschneide-/Kopier- und Einfügeoperationen bis hin zum fortgeschrittenen Durchsuchen der Datei- und Ordnerstruktur - lokal und im Netzwerk. Ordnerinhalte können auf vielfältige Weise im Text- und Symbol-<link linkend="viewmode">Anzeigemodus</link> dargestellt werden. Dies umfasst auch Minibildvorschauen von Dateiinhalten. Datei- und Ordnereigenschaften können auf einfache Weise untersucht und verändert werden, und Programme lassen sich mit einem einfachen Klick der linken Maustaste starten.

source: In &kde; SC 4 &dolphin; is the default file manger. To change the default component for browsing folders, open <guimenu>Default Applications</guimenu> in the &systemsettings; and select &konqueror; as file manager.
de: In &kde; SC 4 ist &dolphin; als Standard-Dateimanger eingestellt. Um dies zu ändern, öffnen Sie <guimenu>Standard-Komponenten</guimenu> in den &systemsettings; und wählen &konqueror; als Dateimanger.

source: <emphasis>&konqueror;</emphasis> is an <acronym>HTML</acronym> 4.01 compliant <link linkend="browser">web browser</link> with built in support for JavaScript (ECMA-262), <acronym>CSS</acronym> (Cascading Style Sheets) and bidirectional scripts (such as Arabic and Hebrew). It provides support for the secure running of &Java; applets, &Netscape; plugins for viewing &Flash;, &RealAudio; and &RealVideo; and <acronym>SSL</acronym> for secure communications. Advanced features include automatic &URL; and form completion, the ability to import bookmarks from other browsers and tabbed browsing.
de: <emphasis>&konqueror;</emphasis> als <link linkend="browser">Webbrowser</link> ist konform mit <acronym>HTML</acronym> 4.01 mit eingebauter Unterstützung für JavaScript (ECMA-262) und <acronym>CSS</acronym> (Cascading Style Sheets) sowie für bidirektionale Schriften (wie &eg; Arabisch und Hebräisch). Er unterstützt den sicheren Betrieb von &Java;-Miniprogrammen, &Netscape;-Plugins für &Flash;, &RealAudio; und &RealVideo; sowie <acronym>SSL</acronym> für sichere Verbindungen. Zu den fortgeschrittenen Funktionen gehören die automatische Vervollständigung von &URL;s, das automatische Ausfüllen von Formularen, die Fähigkeit, Lesezeichen anderer Browser zu importieren und das Betrachten von Webseiten in mehreren Unterfenstern.

source: <emphasis>&konqueror;</emphasis> is also an excellent full featured <link linkend="ftp">FTP</link> client.
de: <emphasis>&konqueror;</emphasis> ist auch ein vollwertiger <link linkend="ftp">FTP</link>-Client.

source: <emphasis>&konqueror;</emphasis> is a universal viewing application, capable of displaying images and documents without having to launch another application. It does this by embedding components (&kde; Parts) provided by other applications; from <application>Gwenview</application>; for image viewing, &okular; for <acronym>PDF</acronym>, &PostScript; and other documents.
de: <emphasis>&konqueror;</emphasis> ist ein universeller Dokumentenbetrachter, der Bilder und andere Dokumente darstellen kann, ohne dass man hierzu erst ein anderes Programm starten muss. Dies wird durch die Einbettung von Komponenten (&kde;-Parts) erreicht, die von anderen Programmen bereit gestellt werden; von <application>Gwenview</application> für die Anzeige von Bildern, von &okular; für die Anzeige von <acronym>PDF</acronym>-Dateien, &PostScript;-Dokumenten und anderen Dokumenten.

source: <emphasis>&konqueror;</emphasis> is a fully customizable application which anyone can <link linkend="config">configure</link> to suit their own needs, from changing the overall style and the sizes of text and icons to selecting which items appear in the Menubar, changing the number and positions of the toolbars and even defining new shortcut key combinations. Different configuration <link linkend="save-settings">profiles</link> can be saved for easy recall as needed.
de: <emphasis>&konqueror;</emphasis> ist ein vollständig an die Benutzerbedürfnisse anpassbares Programm, das jeder Benutzer seinen Vorstellungen und Gewohnheiten gemäß <link linkend="config">anpassen</link> kann. Dies betrifft den allgemeinen Stil, die Schrift- und Symbolgrößen, die Auswahl der in der Menüleiste angezeigten Symbole, die Anzahl und der Platz der Werkzeugleisten und sogar die Definition neuer Tastenkürzel. Die verschiedenen Einstellungs<link linkend="save-settings">profile</link> können gespeichert werden, um bei Bedarf schnell darauf zugreifen zu können.

source: &konqueror; Basics
de: &konqueror;-Grundlagen

source: Like all &kde; applications, &konqueror; is highly configurable. This document describes how &konqueror; behaves with the normal, default settings.
de: Wie alle &kde;-Programme ist auch &konqueror; vielfältig konfigurierbar. Dieses Handbuch beschreibt, wie sich &konqueror; unter den normalen Standardeinstellungen verhält.

source: A three button mouse can be useful when you are running &konqueror; or any other &kde; application. If your mouse only has two buttons then you should be able to set your system up so that you can simulate a &MMB; by pressing both buttons at the same time.
de: Eine Maus mit drei Tasten ist bei der Bedienung von &konqueror; (und jeder anderen &kde;-Anwendung) oft von Vorteil. Sollte Ihre Maus nur zwei Tasten haben, dann sollten Sie Ihr System so einrichten, dass Sie die mittlere Maustaste durch gleichzeitiges Drücken der beiden Tasten simulieren können.

source: You can read more about mouse usage in <xref linkend="lmb-mmb"/>
de: Mehr über die Nutzung Ihrer Maus finden Sie in <xref linkend="lmb-mmb"/>

source: If you are used to having to double-click to perform an action, then take care, because in common with the rest of &kde;, &konqueror; defaults to single-clicking.
de: Wenn Sie gewöhnt sind, Aktionen mit einem Doppelklick auszuführen, dann müssen Sie aufpassen, denn genau wie beim Rest von &kde; ist auch beim &konqueror; ein Einzelklick die Standardeinstellung.

source: Starting &konqueror;
de: &konqueror; starten

source: Being a combined File Manager and Browser, &konqueror; will automatically switch between the two modes as needed when it is running, but it is convenient to be able to choose which mode is to be used when you start it up.
de: Als kombinierter Dateimanager und Internet-Browser schaltet &konqueror; je nach Bedarf automatisch zwischen den beiden Modi um. Trotzdem kann es vorteilhaft sein, den Modus beim Start vorzuwählen.

source: From the application launcher menu, select <menuchoice><guisubmenu>Internet</guisubmenu><guimenuitem>Konqueror (Web Browser)</guimenuitem></menuchoice> to start it as a browser.
de: Wählen Sie im Programmstartmenü <menuchoice><guisubmenu>Internet</guisubmenu><guimenuitem>Konqueror (Webbrowser)</guimenuitem></menuchoice>, um ihn als Browser zu starten.

source: <keycombo action="simul">&Alt;<keycap>F2</keycap></keycombo> will open &krunner;, enter a path to a folder and press &Enter; to start in file manager mode, or just enter a &URL; such as <userinput>http://www.konqueror.org</userinput> to start &konqueror; as a browser.
de: <keycombo action="simul">&Alt;<keycap>F2</keycap></keycombo> öffnet &krunner;; geben Sie dort einen Pfad zu einem Ordner ein und drücken Sie die &Enter;-Taste, um &konqueror; im Dateimanager-Modus zu starten, oder geben Sie eine &URL; wie <userinput>http://www.konqueror.org</userinput> ein, um ihn als Browser zu starten.

source: Click on the black arrow to the right of the <guiicon>Home Page</guiicon> icon to switch to your <guiicon>Home Folder</guiicon> in the file manager mode and vice versa.
de: Klicken Sie auf den schwarzen Pfeil rechts neben dem Symbol <guiicon>Startseite</guiicon> um zu Ihrem <guiicon>Persönlichen Ordner</guiicon> im Dateimanager-Modus zu wechseln und umgekehrt.

source: If &konqueror; is the default file manager it also starts automatically when you <mousebutton>left</mousebutton> click on a desktop icon that represents a folder, such as a hard disk drive or the <guiicon>Trash</guiicon> icon.
de: Ist &konqueror; als Standard-Dateimanager ausgewählt, wird auch er automatisch gestartet, wenn Sie mit der <mousebutton>linken</mousebutton> Maustaste auf ein Arbeitsflächensymbol klicken, das einen Ordner repräsentiert, zum Beispiel ein Festplattenlaufwerk oder das Symbol <guiicon>Papierkorb</guiicon>.

source: The Parts of &konqueror;
de: Die Bestandteile von &konqueror;

source: A brief look at the main parts of &konqueror;'s window:
de: Ein kurzer Überblick über die Hauptteile des &konqueror;-Fensters:

source: Here's a screenshot of &konqueror;
de: Ein Bildschirmfoto von &konqueror;

source: The <interface>Titlebar</interface> is the strip across the top of &konqueror;'s window, and operates in the same way as for other &kde; applications. <mousebutton>Right</mousebutton> click on the central portion to bring up the neat Titlebar menu.
de: Die <interface>Titelleiste</interface> ist der Balken ganz am oberen Rand des &konqueror;-Fensters. Sie funktioniert genau wie bei den anderen &kde;-Anwendungen. Ein Rechtsklick öffnet das Kontextmenü der Titelleiste.

source: The <interface>Menubar</interface> is the strip containing the names of the drop-down menus. <mousebutton>Left</mousebutton> click on a name to alternately show and hide that menu, or use <keycombo action="simul">&Alt;<keycap>the underlined letter</keycap></keycombo> in the name as a hot key, for example <keycombo action="simul">&Alt;<keycap>E</keycap></keycombo> to show the <guimenu>Edit</guimenu> menu. The various menus are described in the <link linkend="menubar">Menubar</link> section of this document.
de: Die <interface>Menüleiste</interface> ist die Zeile, in der die Namen der Aufklappmenüs angezeigt werden. Ein Linksklick auf einen Namen zeigt das Menü an, ein weiterer Klick blendet es wieder aus. Sie können auch <keycombo action="simul">&Alt;<keycap>der unterstrichene Buchstabe</keycap></keycombo> als Tastenkürzel drücken, zum Beispiel <keycombo action="simul">&Alt;<keycap>B</keycap></keycombo> für das Menü <guimenu>Bearbeiten</guimenu>. Die einzelnen Menüs werden im Abschnitt <link linkend="menubar">Menüleiste</link> dieses Dokuments beschrieben.

source: The <interface>Toolbar</interface> contains icons for commonly used operations. <mousebutton>Left</mousebutton> clicking on an icon will activate it. A brief description of what that icon does will appear when you hover the pointer over it.
de: Die <interface>Werkzeugleiste</interface> enthält Symbole für häufig ausgeführte Operationen. Durch einen Klick mit der <mousebutton>linken</mousebutton> Maustaste auf ein Symbol wird dieses aktiviert. Eine kurze Beschreibung der Funktion des Symbols erscheint, sobald Sie den Mauszeiger darüber halten.

source: Some icons, for example the Up and Back icons in the previous screenshot, have a small black arrow at the right. If you click with the &LMB; at this arrow a small dropdown menu will appear.
de: Einige Symbole, zum Beispiel Pfeil nach oben und Pfeil nach unten im vorherigen Bildschirmfoto, haben rechts einen kleinen schwarzen Pfeil. Wenn Sie mit der &LMBn; darauf klicken, öffnet sich ein kleines Aufklappmenü.

source: <mousebutton>Right</mousebutton> clicking on the <interface>Toolbar</interface> will bring up the <link linkend="rmb-menus"><guilabel>Toolbar Settings</guilabel> menu</link> which you can use to change the <interface>Toolbar</interface>'s appearance and position.
de: Nach einem <mousebutton>Rechts</mousebutton>klick auf die <interface>Werkzeugleiste</interface> erscheint das Menü <link linkend="rmb-menus"><guilabel>Werkzeugleisten-Einstellungen</guilabel></link>, mit dem Sie das Erscheinungsbild und die Position der <interface>Werkzeugleiste</interface> ändern können.

source: The <interface>Location Toolbar</interface> shows the path to the directory, &URL; or file being viewed. You can type a path or &URL; here and press &Enter; or <mousebutton>left</mousebutton> click on the <guiicon>Go</guiicon> icon at the right hand end of the <interface>Location Toolbar</interface> to go to it. The black icon at the right hand end of the <interface>Location Toolbar</interface> clears the text entry box.
de: Die <interface>Adressleiste</interface> zeigt den Pfad des jeweils angezeigten Ordners, der &URL; oder der Datei an. Sie können dort einen Pfad oder eine &URL; eingeben; ein anschließendes Betätigen der <keycap>Eingabe</keycap>-Taste oder des <guiicon>Gehe zu</guiicon>-Symbols auf der rechten Seite der <interface>Adressleiste</interface> bringt Sie dorthin. Das schwarze Symbol am rechten Rand der <interface>Adressleiste</interface> leert das Texteingabefeld.

source: The <interface>Bookmark Toolbar</interface> is the area under the <interface>Location Toolbar</interface> in the previous screenshot. You can add frequently used bookmarks here; see the <link linkend="orgbmark">Organizing Your Bookmarks</link> section of this document.
de: Die <interface>Lesezeichenleiste</interface> befindet sich im obigen Bildschirmfoto unter der <interface>Adressleiste</interface>. Sie können dort häufig benutzte Lesezeichen ablegen. Beachten Sie hierzu auch den Abschnitt <link linkend="orgbmark">Verwaltung Ihrer Lesezeichen</link>.

source: The <interface>Window</interface> is the main area of &konqueror; and can show you the contents of a directory, web page, document or image. Using the <link linkend="menu-window"><guimenu>Window</guimenu></link> menu you can split &konqueror;'s main window into one or more separate views, useful for drag and drop operations, or set it to contain two or more tabbed views.
de: Das <interface>Fenster</interface> ist der wichtigste Bereich von &konqueror;. Es kann den Inhalt eines Ordners, eine Internetseite, ein Dokument oder ein Bild anzeigen. Mit Hilfe des Menüs <link linkend="menu-window"><guimenu>Fenster</guimenu></link> können Sie &konqueror;s Hauptfenster in zwei oder mehr Teilansichten unterteilen, was für Ziehen-und-Ablegen-Operationen sehr nützlich ist, oder Sie stellen es so ein, dass es zwei oder mehr Karteikartenansichten aufnimmt.

source: The <interface>Status Bar</interface> runs across the bottom of the &konqueror;'s window and often shows general information about whatever the mouse pointer is hovering over. If you have split the main window into a number of views you will get a Status Bar for each view, and it will include a small green light at the left hand end to show which is the <quote>active</quote> view. <mousebutton>Right</mousebutton> clicking on the Status Bar brings up the Status Bar <link linkend="rmb-menus"><mousebutton>Right</mousebutton> Mouse Button Menu</link>.
de: Die <interface>Statusleiste</interface> verläuft entlang des unteren Fensterrandes und zeigt häufig allgemeine Informationen über das Objekt an, über dem sich die Maus gerade befindet. Wenn Sie das Hauptfenster in mehrere Ansichten unterteilt haben, wird für jede Ansicht eine Statusleiste angezeigt, und ein kleiner grüner Punkt am linken Rand der Statusleiste zeigt Ihnen, welche gerade <quote>aktiv</quote> ist. Ein <mousebutton>Rechts</mousebutton>klick auf die Statusleiste öffnet deren <link linkend="rmb-menus">Kontextmenü</link>.

source: Don't worry if your &konqueror; doesn't look exactly like this screenshot; it is highly configurable. In particular:
de: Machen Sie sich keine Sorgen, wenn Ihr &konqueror; nicht genau so wie das Bildschirmfoto aussieht. Er ist vielfältig veränderbar. Insbesondere gilt:

source: You can use the <link linkend="menu-settings"><guimenu>Settings</guimenu></link> menu to choose whether to show or hide the Menubar, Main Toolbar, Location Toolbar and Bookmark Toolbar, or even to add an Extra Toolbar.
de: Mit dem Menü <link linkend="menu-settings"><guimenu>Einstellungen</guimenu></link> können Sie die Menüleiste, Werkzeugleiste, Adressleiste und Lesezeichenleiste ein- oder ausblenden oder sogar eine weitere Werkzeugleiste hinzufügen.

source: If the toolbars are unlocked, you can also drag them to a new position by <mousebutton>left</mousebutton> clicking on the handle at the left hand end of a bar and move it around by holding the &LMB; down while you drag it.
de: Wenn die Werkzeugleisten nicht gesperrt sind, können Sie sie auch durch <mousebutton>Links</mousebutton>klick auf die senkrechten Linien am linken Rand der Leisten mit gedrückter &LMBr; verschieben, wenn die Werkzeugleisten nicht gesperrt sind.

source: This screenshot does not show the optional <link linkend="sidebar"> Sidebar</link>.
de: Auf dem obigen Bildschirmfoto ist der optional verfügbare <link linkend="sidebar">Navigationsbereich</link> nicht zu sehen.

source: For more details of how to change &konqueror;'s appearance, see the <link linkend="config">Configuring &konqueror;</link> section
de: Weitere Details über das Verändern des Erscheinungsbildes von &konqueror;, finden Sie im Abschnitt <link linkend="config">Einrichten von &konqueror;</link>.

source: Tooltips and What's This?
de: Kurzinfos und <quote>Was ist das?</quote>

source: You can find out a lot about how &konqueror; works without needing to read this entire document if you take advantage of <guilabel>Tooltips</guilabel> and the <guimenuitem>What's This?</guimenuitem> feature.
de: Sie können viel über &konqueror; herausfinden, ohne dieses Dokument vollständig durchlesen zu müssen, wenn Sie die <guilabel>Kurzinfos</guilabel> und die Funktion <guimenuitem>Was ist das?</guimenuitem> benutzen.

source: When you hover the mouse pointer over a Toolbar or Sidebar tab button it should bring up a terse description of what that button does.
de: Eine knappe Beschreibung der Funktion des Knopfes in der Werkzeugleiste oder im Navigationsbereich wird angezeigt, sobald Sie mit dem Mauszeiger über ihm verweilen.

source: <guimenuitem>What's This?</guimenuitem> is invoked by the Menubar <menuchoice><guimenu>Help</guimenu><guimenuitem>What's This?</guimenuitem></menuchoice> item or by <keycombo action="simul">&Shift;<keycap>F1</keycap></keycombo>. It changes the cursor to show a question mark alongside the arrow.
de: <guimenuitem>Was ist das?</guimenuitem> wird in der Menüleiste durch <menuchoice><guimenu>Hilfe</guimenu><guimenuitem>Was ist das?</guimenuitem></menuchoice>, durch Drücken von <keycombo action="simul">&Shift;<keycap>F1</keycap></keycombo>. Daraufhin verwandelt sich der Mauszeiger in einen Zeiger mit einem Fragezeichen.

source: When this question mark is visible, a &LMB; click won't actually do anything until you have clicked on a control (or the text alongside it) that supports <guimenuitem>What's This?</guimenuitem>, in which case it will display a reasonably comprehensive description of what the control does. Most of the dialog boxes that &konqueror; brings up support the <guimenuitem>What's This?</guimenuitem> feature.
de: Wenn dieses Fragezeichen sichtbar ist, bewirkt ein Linksklick auf ein Symbol oder den zugehörigen Text, dass eine Beschreibung der Funktion des Objektes, auf das Sie geklickt haben, angezeigt wird, sofern dieses Objekt diese Art von Hilfe unterstützt. Fast alle Dialoge in &konqueror; unterstützen die <guimenuitem>Was ist das?</guimenuitem>-Funktion.

source: <mousebutton>Left</mousebutton> and <mousebutton>Middle</mousebutton> Mouse Button Actions
de: Aktionen der <mousebutton>linken</mousebutton> und <mousebutton>mittleren</mousebutton> Maustaste

source: If you click the &LMB; on an item in &konqueror;'s window, it will be <quote>activated</quote>. Thus
de: Ein Linksklick auf ein Objekt im &konqueror;-Fenster <quote>aktiviert</quote> dieses Objekt. Im Einzelnen:

source: <mousebutton>Left</mousebutton> click on an icon in the Toolbar to perform the action that icon represents.
de: Linksklick auf ein Symbol in der Werkzeugleiste führt zur Ausführung des Befehls, der diesem Symbol zugeordnet ist.

source: <mousebutton>Left</mousebutton> click on an item in the Menubar to make that menu drop down.
de: Linksklick auf ein Menü in der Menüleiste führt zum Aufklappen der Menüeinträge.

source: <mousebutton>Left</mousebutton> click on a menu item to do that thing.
de: Linksklick auf einen Menüeintrag führt den entsprechenden Befehl aus.

source: <mousebutton>Left</mousebutton> click on an icon in the Bookmark Toolbar to open that &URL;.
de: Linksklick auf ein Symbol in der Lesezeichenleiste öffnet die entsprechende &URL;.

source: <mousebutton>Left</mousebutton> click on a link in a web page to make &konqueror; follow that link.
de: Linksklick auf eine Verknüpfung auf einer Internetseite bewirkt, dass &konqueror; dieser Verknüpfung folgt.

source: <mousebutton>Left</mousebutton> click on a folder icon or name and &konqueror; will descend into (show the contents of) that folder.
de: Linksklick auf einen Ordner bewirkt, dass &konqueror; in diesen Ordner hineinwechselt und seinen Inhalt anzeigt.

source: <mousebutton>Left</mousebutton> click on a file name or icon and &konqueror; will do whatever it thinks appropriate, based on the file type. In general this means opening <acronym>HTML</acronym> pages, or previewing text, image or &okular; documents, showing them within &konqueror;'s window (<quote>Preview</quote> means that you can see the file but not change it).
de: Linksklick auf einen Dateinamen oder ein Dateisymbol lässt &konqueror; das ausführen, was er - basierend auf dem Dateityp - für angebracht hält. Das heißt zum Beispiel Öffnen von <acronym>HTML</acronym>-Seiten oder Vorschau von Text-, Bild- oder &okular;-Dateien. Und das alles innerhalb des &konqueror; Fensters. (<quote>Vorschau</quote> heißt, dass Sie die Datei anschauen, aber nicht verändern können.)
