Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/applications/konqueror.po
Languages: de

source: &konqueror; can save a whole set of options as a <quote>View Profile</quote>. Some view profiles are part of the standard &konqueror; installation, such as <property>Web Browsing</property>, <property>File Management</property>, <property>KDE Development</property>, <property>Midnight Commander</property> and <property>Tabbed Browsing</property>; but you can add your own, too.
de: &konqueror; kann einen ganzen Satz von Ansichts-Einstellungen als <quote>Ansichtsprofil</quote> speichern. Einige Ansichtsprofile sind Bestandteil der Standardinstallation von &konqueror;, wie zum Beispiel <property>Webbrowser</property>, <property>Dateiverwaltung</property>, <property>KDE-Entwicklung</property>, <property>Midnight Commander</property> und <property>Browsen mit Unterfenstern</property>.Sie können aber auch Ihre eigenen Profile hinzufügen.

source: To modify a view profile (say, the <property>Web Browsing</property> profile), load the profile with <menuchoice><guimenu>Settings</guimenu><guisubmenu>Load View Profile</guisubmenu><guimenuitem>Web Browsing</guimenuitem> </menuchoice>, and change the &konqueror; settings to whatever you want. Now select <menuchoice><guimenu>Settings</guimenu><guimenuitem>Save View Profile As... </guimenuitem></menuchoice>. In the dialog which appears, you can change the name of the profile, which will create a new profile with that name, or you can leave the name as it is to modify the current profile. If you select <guilabel>Save URLs in profile</guilabel>, the current &URL; will be loaded when you load that view profile. This functions in a similar way to the <quote>Home Page</quote> in many web browsers. If you want &konqueror; to start up with an empty window enter <userinput>about:blank</userinput> into the location bar before saving the profile.
de: Um ein Ansichtsprofil zu ändern (beispielsweise das Profil <property>Webbrowser</property>), laden Sie das Profil durch Auswahl von <menuchoice><guimenu>Einstellungen</guimenu><guisubmenu>Ansichtsprofil laden</guisubmenu><guimenuitem>Webbrowser</guimenuitem> </menuchoice> und ändern dann die Einstellungen von &konqueror; Ihren Wünschen entsprechend. Wählen Sie nun <menuchoice><guimenu>Einstellungen</guimenu><guimenuitem>Ansichtsprofil speichern unter ...</guimenuitem></menuchoice>. In dem erscheinenden Dialog können Sie den Namen des Profils ändern, wodurch ein Profil mit dem neuen Namen erzeugt wird, oder Sie lassen den Namen unverändert, um damit das aktuelle Profil zu ändern. Wenn Sie <guilabel>Adressen im Profil speichern</guilabel> ankreuzen, wird, sobald Sie das Profil laden, die aktuelle Adresse geladen. Dies funktioniert ähnlich, wie die <quote>Startseite</quote> in vielen Webbrowsern. Wenn Sie wünschen, dass &konqueror; mit einer leeren Seite startet, geben Sie vor dem Speichern <userinput>about:blank</userinput> in die Adresszeile ein.

source: You can create a desktop icon to start &konqueror; with your new profile. First create a desktop icon by clicking with the &RMB; onto the &konqueror; entry in the application launcher menu. Then select <guimenuitem>Add to Desktop</guimenuitem> in the context menu. Open the settings dialog of the new icon on your desktop by clicking on the <guiicon>Tools</guiicon> icon. Change <guilabel> Command</guilabel> in the <guilabel>Application</guilabel> tab page to <userinput><command>kfmclient</command> <option>openProfile <replaceable>MyNewProfile</replaceable></option></userinput>, <replaceable>MyNewProfile</replaceable> being what you called the new profile. Then change the name to something like <filename>MyNewProfile</filename> .
de: Sie können ein Symbol auf der Arbeitsfläche anlegen, um &konqueror; mit Ihrem neuen Profil zu laden. Erstellen Sie dazu zunächst ein Symbol auf der Arbeitsfläche, indem Sie mit der &RMBn; Maustaste das &konqueror;-Symbol im Programmstartmenü klicken und dann <guimenuitem>Zur Arbeitsfläche hinzufügen</guimenuitem> im Kontextmenü auswählen. Klicken Sie dann auf das Werkzeugzeichen diese neuen Symbols. Ändern Sie im Dialog den <guilabel>Befehl</guilabel> auf der Karteikarte <guilabel>Programm</guilabel> zu <userinput><command>kfmclient</command> <option>openProfile <replaceable>MeinNeuesProfil</replaceable></option></userinput>, wobei <replaceable>MeinNeuesProfil</replaceable> das von Ihnen gewünschte Profil bezeichnet. Ändern Sie dann iauf der Karteikarte <guilabel>Allgemein</guilabel> den Namen des Symbols zu etwas aussagekräftigem, etwa <filename>MeinProfil.desktop</filename>, und wählen Sie ein passendes Symbol.

source: <title>Plugins</title>
de: <title>Erweiterungen</title>

source: &Netscape; Plugins
de: &Netscape;-Module

source: Currently, &konqueror; supports &Netscape; plugins.
de: Gegenwärtig unterstützt &konqueror; die Module von &Netscape;.

source: Selecting <menuchoice><guimenu>Settings</guimenu><guimenuitem> Configure Konqueror...</guimenuitem> </menuchoice> opens the configuration dialog. Select the <guilabel>Plugins</guilabel> page, where you find two tabs: <guilabel>Global Settings</guilabel> to enable plugins and configure how they are used in &konqueror; and <guilabel>Plugins</guilabel> which shows you the &Netscape; plugins that &kde; has found and allows you to scan for plugins.
de: Mit <menuchoice><guimenu>Einstellungen</guimenu><guimenuitem>&konqueror; einrichten ...</guimenuitem></menuchoice> öffnen Sie den Einrichtungsdialog. Wählen Sie dort die Seite <guilabel>Erweiterungen</guilabel>. Sie enthält die Karteikarte <guilabel>Globale Einstellungen</guilabel>, um Erweiterungsmodule zu aktivieren und einzustellen, wie sie in &konqueror; benutzt werden. Auf der Karteikarte <guilabel>Module</guilabel> werden die gefundenen &Netscape;-Module angezeigt, hier können Sie &konqueror; auch nach weiteren Erweiterungen suchen lassen.

source: For more information see the <ulink url="help:/kcontrol/khtml-plugins/index.html"> Browser Plugins</ulink> help page.
de: Weitere Informationen finden Sie auf der Hilfeseite <ulink url="help:/kcontrol/khtml-plugins/index.html">Erweiterungsmodule für den Webbrowser</ulink>.

source: &konqueror; Plugins
de: &konqueror;-Module

source: &kde; releases several useful plugins that interact with &konqueror; in various ways. These are explained briefly below.
de: &kde; enthält mehrere nützliche Module, die auf unterschiedliche Weise mit &konqueror; zusammenarbeiten. Diese werden unten kurz beschrieben.

source: Use <menuchoice><guimenu>Settings</guimenu><guimenuitem>Configure Extensions...</guimenuitem></menuchoice> to open a dialog with all installed plugins and select the ones you need. All plugins are accessible in the <guimenu>Tools</guimenu> menu.
de: Die Auswahl von <menuchoice><guimenu>Einstellungen</guimenu> <guimenuitem>Erweiterungen einrichten ...</guimenuitem></menuchoice> öffnet ein Dialogfenster mit allen installierten Module, aktivieren Sie in dieser Liste die gewünschten Module. Alle aktivierten Module finden Sie im Menü <guilabel>Extras</guilabel>.

source: Only plugins appropriate for the current mode (file manager or browser in KHTML/WebKit view) are listed in the dialog.
de: Es werden nur passende Module für den aktuellen Modus (Dateiverwaltung oder Browser mit KHTML-/WebKit-Anzeigemodus) im Dialog angezeigt.

source: Browser Mode
de: Browser-Modus

source: Web Page Translation
de: Webseiten übersetzen

source: This uses the machine translation service provided by <ulink url="http://translate.google.com/">Google Translate</ulink> to translate the current <acronym>HTML</acronym> page to whatever language you want (within reason). It can be launched with <menuchoice><guimenu>Tools</guimenu><guisubmenu>Translate Web Page</guisubmenu></menuchoice>.
de: Dies benutzt die automatische Übersetzung durch die Webseite <ulink url="http://translate.google.de/">Google Übersetzer</ulink>, um die geladene <acronym>HTML</acronym>-Seite in jede von Ihnen gewünschte Sprache (mit entsprechenden Einschränkungen) zu übersetzen. Sie können diese Funktion mit <menuchoice><guimenu>Extras</guimenu><guisubmenu>Webseite übersetzen</guisubmenu></menuchoice> aufrufen.

source: If you have a portion of the text on the page selected, that will be translated instead of the entire &URL;.
de: Falls ein Teil des Textes ausgewählt ist, wird nur dieser Teil an Stelle der gesamten &URL; übersetzt.

source: Machine translation is not a perfect science! Google will at best give you a rough translation, and at worst will give you a very funny read. Don't base important decisions on things you have read from a Google translated page, without confirming that the translation is indeed accurate.
de: Maschinelle Übersetzungen sind nur sehr rudimentär. Google produziert im besten Fall eine grobe Übersetzung und im schlimmsten Fall Unsinn. Daher sollten Sie von den Übersetzungen keine wichtigen Entscheidungen abhängig machen, ohne die Übersetzung vorher zu überprüfen.

source: You may only translate web pages that are accessible on the world wide web. To translate any other text, you should go directly to the Google site itself, where you are able to paste in text for translation.
de: Nur Webseiten im Internet können übersetzt werden. Andere Texte sollten Sie auf der Google-Seite selbst übersetzen lassen, wo Sie zu übersetzende Texte direkt einfügen können.

source: DOM Tree Viewer (KHTML view only)
de: DOM-Baum anzeigen (Nur KHTML--Anzeigemodus)

source: The <acronym>DOM</acronym> Tree Viewer allows a developer to view the styles, attributes and elements of a web document.
de: Mit der <acronym>DOM</acronym>-Baumansicht können Sie Stile, Attribute und Elemente eines Webdokuments betrachten.

source: Selecting <menuchoice><guimenu>Tools</guimenu><guisubmenu>Show DOM Tree</guisubmenu></menuchoice> opens a new window which displays the document object model (DOM) of the current <acronym>HTML</acronym> page.
de: Die Auswahl von <menuchoice><guimenu>Extras</guimenu><guisubmenu>DOM-Baum anzeigen</guisubmenu></menuchoice> öffnet ein neues Fenster und zeigt das Document Object Model (DOM) der aktuellen <acronym>HTML</acronym>-Seite an.

source: By default the display starts at the root node of the document, example: <quote>documentElement</quote>, all other nodes that you will see are children or descendants of the root node.
de: Als Voreinstellung beginnt die Anzeige mit dem Wurzelknoten des Dokuments, Beispiel: <quote>documentElement</quote>, alle anderen Knoten sind Unterelemente dieses Wurzelknotens.

source: If you wish to manipulate the <acronym>DOM</acronym> tree in any way you will have to use an external script to do so.
de: Den <acronym>DOM</acronym>-Baum können Sie nur mit einem externen Skript bearbeiten.

source: Web Page Validator
de: Webseiten-Überprüfung

source: This plugin uses the W3C HTML validator to validate the current page, very useful when creating web pages.
de: Dieses Modul benutzt den W3C HTML Validator, um die aktuelle Seite zu überprüfen. Dies kann sehr nützlich bei der Entwicklung von Webseiten sein.

source: <guimenuitem>Validate &HTML; (by URI)</guimenuitem> / <guimenuitem>Validate &HTML; (by Upload)</guimenuitem>
de: <guimenuitem>&HTML; überprüfen (durch URI)</guimenuitem> / <guimenuitem>&HTML; überprüfen (durch Hochladen)</guimenuitem>

source: The validate &HTML; option allows you to compare your &HTML; document to the defined syntax of &HTML; and reports any errors found. Validating your &HTML; will ensure that your pages display properly on all browsers.
de: Mit der &HTML;-Überprüfung testen Sie, ob Ihr &HTML;-Dokument der Syntax von &HTML; entspricht, alle gefundenen Fehler werden angezeigt. Mit dieser Prüfung können Sie sicherstellen, dass Ihre Seiten von allen Browsern richtig dargestellt werden.

source: Validate CSS (by URI)
de: CSS überprüfen (durch URI)

source: Allows you to validate your &CSS; style sheet that is embedded in an &HTML; or &XHTML; document. Having valid &CSS; is critical to ensuring that your web site maintains a consistent look regardless of the browser that is being used.
de: Erlaubt Ihnen die Überprüfung Ihrer &CSS;-Stilvorlagen, die in ein &HTML;- oder &XHTML;-Dokument eingebunden sind. Mit gültigem &CSS; haben Ihre Webseiten ein einheitliches Aussehen unabhängig vom verwendeten Browser.

source: Validate Links
de: Verknüpfungen überprüfen

source: Allows you to confirm that the links on your site contain no redirects or broken links. This tool recursively checks all links on a site.
de: Überprüft die Verknüpfungen auf Ihrer Seite auf Weiterleitungen und fehlerhafte Verknüpfungen. Es werden rekursiv alle Verknüpfungen auf der Webseite überprüft.

source: Validate Page
de: Webseite überprüfen

source: Validates the current page but does not show the result in another window or tab as the previous actions. Using this item enables the action <guimenuitem>View Validator Report</guimenuitem> to display a summary of the validation.
de: Überprüft die angezeigte Seite, öffnet aber kein neues Fenster oder Unterfenster zur Anzeige des Ergebnisses wie die vorigen Menüeinträge. Wurde diese Menüeintrag ausgewählt, dann kann mit <guimenuitem>Überprüfungsbericht ansehen</guimenuitem> eine Zusammenfassung des Prüfungsergebnisses angezeigt werden.

source: Configure Validator
de: Syntaxüberprüfung einrichten

source: The configure validator item allows you to view the preset validators you can use to validate your &HTML; and &CSS;.
de: Hier legen Sie die Adressen der Server für die Überprüfung Ihrer &HTML;-Dokumente und &CSS;-Stilvorlagen fest.

source: HTML Settings
de: HTML-Einstellungen

source: Select <menuchoice><guimenu>Tools</guimenu><guisubmenu>HTML Settings</guisubmenu></menuchoice> to enable or disable a number of HTML settings without going through the <guimenu>Settings</guimenu> dialog.
de: Wählen Sie <menuchoice><guimenu>Extras</guimenu><guisubmenu>HTML-Einstellungen</guisubmenu></menuchoice>, um bestimmte HTML-Einstellungen ein- bzw. auszuschalten, ohne über den Dialog unter <guimenu>Einstellungen</guimenu> zu gehen.

source: Allows you to turn the use of JavaScript in &konqueror; on or off.
de: JavaScript im &konqueror; ein- oder ausschalten.

source: Allows you to turn the use of &Java; in &konqueror; on or off.
de: Java im &konqueror; ein- oder ausschalten.

source: Allows you to turn the use of Cookies in &konqueror; on or off.
de: Alle Cookies im &konqueror; annehmen oder zurückweisen.

source: <guimenuitem>Plugins</guimenuitem>
de: <guimenuitem>Module</guimenuitem>

source: Allows you to turn the use of the &konqueror; plugins you have installed on or off.
de: Nutzung der installierten Module für &konqueror; ein- oder ausschalten.

source: Autoload Images
de: Bilder automatisch laden

source: Allows you to turn on or off the loading of images in web pages.
de: Bilder auf Webseiten automatisch laden ein- oder ausschalten.

source: Enable Proxy
de: Proxy aktivieren

source: Allows you to enable or disable the use of a proxy in the &konqueror; browser.
de: Proxy aktivieren für &konqueror; ein- oder ausschalten.

source: Enable Cache
de: Zwischenspeicher aktivieren

source: Allows you to enable or disable the use of a cache in the &konqueror; browser.
de: Verwendung des Zwischenspeichers für &konqueror; ein- oder ausschalten.

source: Cache Policy
de: Zwischenspeicher-Regelung

source: The Cache Policy submenu provides you with a way to configure how &konqueror; uses a cache. The possible uses include:
de: Im Untermenü Zwischenspeicher-Regelung können Sie folgende Nutzung des Zwischenspeichers im &konqueror; einstellen:

source: Keep Cache in Sync
de: Zwischenspeicher aktuell halten

source: Use Cache if Possible
de: Möglichst den Zwischenspeicher verwenden

source: Offline Browsing Mode
de: Offline-Browsing-Modus

source: User Agent Changer
de: Browserkennung andern

source: Select <menuchoice><guimenu>Tools</guimenu><guisubmenu>Change Browser Identification</guisubmenu></menuchoice> to get a menu that allows you to change the User Agent string without going through the <guimenu>Settings</guimenu> dialog procedure.
de: Wählen Sie <menuchoice><guimenu>Extras</guimenu><guisubmenu>Browserkennung ändern</guisubmenu></menuchoice>, um ein Menü zu erhalten, in dem Sie die Browserkennung ändern können, ohne über den Dialog unter <guimenu>Einstellungen</guimenu> gehen zu müssen.

source: The plugin allows you to change the Browser and Operating System identification on a domain-by-domain basis. This is useful when browsing websites that limit access to those using a particular web browser.
de: Mit diesem Modul können Sie die Browser- und Betriebssystemkennung für einzelne Domains ändern. Das ist hilfreich für Webseiten, die einen Zugriff nur mit bestimmten Browsern zulassen.

source: Default Identification
de: Standard-Kennung

source: The default User Agent header for &konqueror; is Mozilla/5.0(compatible;Konqueror/4.7)(KHTML/4.7, like Gecko). If you come across a site that refuses this browser access, change your User Agent to one of the options below.
de: Die Standard Browserkennung des &konqueror; ist Mozilla/5.0 (compatible; Konqueror/4.7; Linux) (KHTML/4.7, like Gecko). Wenn Sie auf eine Webseite kommen, die den Zugriff mit diesem Browser verweigert, ändern Sie die Browserkennung in eine der folgenden Optionen.

source: Browser submenu
de: Browser-Untermenü

source: The following menu items show a list of popular browsers such as <guimenuitem>Firefox</guimenuitem>, <guimenuitem>Internet Explorer</guimenuitem>, <guimenuitem>Netscape Navigator</guimenuitem>, <guimenuitem>Opera</guimenuitem>, <guimenuitem>Other</guimenuitem>, and <guimenuitem>Safari</guimenuitem>.
de: Im den folgenden Untermenüs finden Sie einige beliebte Browser wie <guimenuitem>Firefox</guimenuitem>, <guimenuitem>Internet Explorer</guimenuitem>, <guimenuitem>Netscape Navigator</guimenuitem>, <guimenuitem>Opera</guimenuitem>, <guimenuitem>Weitere</guimenuitem>, und <guimenuitem>Safari</guimenuitem>.

source: Apply To Entire Site
de: Für gesamte Site benutzen

source: This option allows you to specify that the defined User Agent applies across every page on the site you are visiting.
de: Mit dieser Option wird die eingestellte Browserkennung für alle Seiten der Website verwendet, die Sie gerade besuchen.

source: Configure
de: Einrichtung

source: Selecting <guimenuitem>Configure</guimenuitem> opens the settings dialog and allows you to fine tune the amount of information you wish to reveal about the browser and operating system being used.
de: Mit dem Menüeintrag <guimenuitem>Einrichten...</guimenuitem> öffnen Sie einen Dialog, um den Umfang der Informationen über den benutzten Browser und das Betriebssystem im einzelnen einzustellen.

source: Archive Web Page (KHTML view only)
de: Webseite archivieren (Nur KHTML--Anzeigemodus)

source: Invoked with <menuchoice><guimenu>Tools</guimenu><guisubmenu> Archive Web Page</guisubmenu></menuchoice>, this tool creates an archive (<literal role="extension">.war</literal> ) file containing the web page being viewed including the images. <mousebutton>Left</mousebutton> click on the archive file name to view the saved page.
de: Wenn diese Funktion mittels <menuchoice><guimenu>Extras</guimenu><guisubmenu>Webseite archivieren</guisubmenu></menuchoice> aufgerufen wurde, erzeugt sie eine Archiv-Datei (<literal role="extension">.war</literal>) der angezeigten Webseite mit allen enthaltenen Bildern. Mit einem Linksklick auf den Archivdateinamen können Sie die gespeicherte Seite betrachten.

source: File Manager Mode
de: Dateiverwaltungs-Modus

source: Directory Filter
de: Ordnerfilter-Modul

source: This is controlled by <menuchoice><shortcut><keycombo action="simul">&Ctrl;&Shift;<keycap>I</keycap></keycombo></shortcut> <guimenu>Tools</guimenu><guisubmenu>Show Filter Bar</guisubmenu></menuchoice> and allows you to choose which types of item are displayed in a folder.
de: Dies wird durch <menuchoice><shortcut><keycombo action="simul">&Ctrl;&Shift;<keycap>I</keycap></keycombo></shortcut> <guimenu>Extras</guimenu><guisubmenu>Ansichtsfilter</guisubmenu></menuchoice> aktiviert. Hier können Sie festlegen, welche Objekttypen in einem Ordner angezeigt werden.

source: Image Gallery
de: Bildergalerie

source: In File Manager mode, you can select <menuchoice><guimenu>Tools</guimenu><guisubmenu>Create Image Gallery</guisubmenu></menuchoice> or use <keycombo>&Ctrl;<keycap>I</keycap></keycombo> to create an HTML page with thumbnails of all the images in the current folder. By default the HTML page is called <filename>images.html</filename> and the thumbnails are put into a new <filename>images</filename> folder.
de: Im Dateiverwaltungs-Modus können Sie <menuchoice><guimenu>Extras</guimenu><guisubmenu>Bildergalerie erstellen</guisubmenu></menuchoice> auswählen oder <keycombo>&Ctrl;<keycap>I</keycap></keycombo> benutzen, um eine HTML-Seite mit Minibildern aller Bilder des aktuellen Ordners zu erzeugen. Die HTML-Seite wird standardmäßig <filename>images.html</filename> genannt und die Minibilder werden in einem Ordner mit dem Namen <filename>images</filename> abgelegt.

source: When you start the Image Gallery plugin a dialog opens allowing you to adjust the way the gallery is created.
de: Wenn Sie das Modul Bildergalerie aufrufen, öffnet sich ein Dialog, mit dem Sie das Erscheinungsbild der Galerie festlegen können.

source: Page Look
de: Gestaltung

source: The Look dialog is for adjusting the appearance of the gallery page.
de: Im Dialog Seitengestaltung können Sie das Erscheinungsbild der Galerieseite einstellen.

source: Look Dialog Screenshot
de: Bildschirmfoto des Dialogs Seitengestaltung

source: Screenshot
de: Bildschirmfoto

source: Page title
de: Titel der Seite

source: The Page title option has a text input box for changing the title of the image gallery page.
de: Die Option <quote>Titel der Seite</quote> erlaubt Ihnen, in einem Texteingabefeld den Titel der Bildergalerie-Seite anzupassen.

source: Images per row
de: Bilder pro Zeile

source: The Images per row option has a slider and a spin box for adjusting the number of thumbnails that are in a single row in the gallery.
de: Die Option <quote>Bilder pro Zeile</quote> hat einen Schieberegler und ein Drehfeld, um die Anzahl der Minibilder jeder Zeile in der Galerie einzustellen.

source: Show image file name
de: Dateiname des Bildes anzeigen

source: The Show image file name check box allows you to choose whether to display filenames below the gallery thumbnails.
de: Mit dem Ankreuzfeld <quote>Dateiname des Bildes anzeigen</quote> legen Sie fest, ob die Dateinamen unter den Minibildern in der Galerie angezeigt werden.

source: Show image file size
de: Dateigröße des Bildes anzeigen

source: The Show image filesize check box allows you to choose whether to display filesizes below the gallery thumbnails.
de: Mit dem Ankreuzfeld <quote>Dateigröße des Bildes anzeigen</quote> legen Sie fest, ob die Dateigröße unter den Minibildern in der Galerie angezeigt wird.

source: Show image dimensions
de: Bildgröße anzeigen

source: The Show image dimensions check box allows you to choose whether to display image dimensions in pixels below the gallery thumbnails.
de: Mit dem Ankreuzfeld <quote>Bildgröße anzeigen</quote> legen Sie fest, ob die Größe der Bilder unter den Minibildern in der Galerie angezeigt wird.

source: Font name
de: Schriftart

source: The Font name combo box provides you with a choice of which font to use in creating the gallery.
de: Im Kombinationsfeld <quote>Schriftart</quote> wählen Sie die Schrift, die in der Galerie verwendet wird.

source: Font size
de: Schriftgröße

source: The Font size spin box is for changing the size of the font you selected.
de: Mit dem Drehfeld <quote>Schriftgröße</quote> wählen Sie die Größe der ausgewählten Schrift.

source: Foreground color
de: Vordergrundfarbe
