Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/applications/konqueror.po
Languages: de

source: <guilabel>Default</guilabel>: the selected action will be associated with &kde;'s default value. This is a good choice for most actions, as &kde; comes with reasonable key bindings we have thought about.
de: <guilabel>Standard</guilabel>: die ausgewählte Aktion wird mit dem &kde;-Standardwert verbunden. Dies ist eine gute Wahl für die meisten Aktionen, da &kde; mit vernünftigen, wohldurchdachten Tastenzuordnungen ausgeliefert wird.

source: <guilabel>Custom</guilabel>: if this option is enabled, you can create a key combination for the selected action. Click on the button labeled either <guibutton>None</guibutton> or labeled with the previously selected custom shortcut. Now the button label changes to <guibutton>Input</guibutton>. Then press any modifier key (&ie; &Shift;, &Ctrl;, or &Alt;) and then normal key or a function key (&eg; <keycap>F11</keycap>) you want to assign to this key combination.
de: <guilabel>Benutzerdefiniert</guilabel>: wenn diese Einstellung aktiviert ist, können Sie eine Tastenkombination für die ausgewählte Aktion erstellen. Klicken Sie auf den Knopf der entweder mit <guibutton>Keiner</guibutton> oder der vorher eingestellten Tastenkombination beschriftet ist. Dann wechselt der Text zu <guibutton>Eingabe</guibutton>. Drücken Sie nun eine Kombination aus Zusatztaste (&ie; &Shift;, &Ctrl; oder &Alt;) und einer normale Taste oder einer Funktionstaste (&eg; <keycap>F11</keycap>), die sie dieser Aktion zuordnen möchten.

source: You can reset the shortcut to <guilabel>None</guilabel> by using this button: <inlinemediaobject><imageobject> <imagedata fileref="reset.png" format="PNG"/></imageobject></inlinemediaobject>.
de: Sie können den Kurzbefehl auf <guilabel>Keinen</guilabel> zurücksetzen, indem Sie diesen Knopf drücken: <inlinemediaobject><imageobject> <imagedata fileref="reset.png" format="PNG"/></imageobject></inlinemediaobject>.

source: Clicking on the <guilabel>Alternate</guilabel> column of a row in the list allows to edit the second shortcut for the action.
de: Klicken Sie auf die Spalte <guilabel>Alternativ</guilabel> in einer Zeile, dann können Sie den zweiten Kurzbefehl für diese Aktion bearbeiten.

source: Other Settings
de: Andere Einstellungen

source: Selecting <menuchoice><guimenu>Settings</guimenu><guimenuitem> Configure Konqueror...</guimenuitem></menuchoice> brings up a dialog box which you can use to control most aspects of &konqueror;'s behavior.
de: Die Auswahl von <menuchoice><guimenu>Einstellungen</guimenu><guimenuitem>Konqueror einrichten ...</guimenuitem></menuchoice> öffnet einen Dialog, mit dem Sie die meisten Aspekte von &konqueror;s Verhalten ändern können.

source: It contains these sections which are selected by <mousebutton>left </mousebutton> clicking on one of the icons at the left of the dialog box:
de: Der Dialog enthält folgende Seiten, die Sie durch Linksklick auf die Symbole auf der linken Seite des Dialogfensters erreichen:

source: <ulink url="help:/kcontrol/khtml-general/index.html">General</ulink>: Configure general &konqueror; behavior
de: <ulink url="help:/kcontrol/khtml-general/index.html">Allgemein</ulink>: Allgemeines Verhalten von &konqueror; festlegen

source: <ulink url="help:/kcontrol/performance/index.html">Performance</ulink>: Configure settings that can improve &konqueror;'s performance
de: <ulink url="help:/kcontrol/performance/index.html">Leistung</ulink>: Einstellungen vornehmen, die &konqueror;s Leistungsfähigkeit erhöhen können

source: <ulink url="help:/kcontrol/bookmarks/index.html">Bookmarks</ulink>: Configure the bookmarks home page
de: <ulink url="help:/kcontrol/bookmarks/index.html">Lesezeichen</ulink>: Lesezeichen-Startseite einrichten

source: <ulink url="help:/kcontrol/filemanager/index.html">File Management</ulink>: You can configure how Konqueror behaves as a file manager here
de: <ulink url="help:/kcontrol/filemanager/index.html">Dateiverwaltung</ulink>: Hier können Sie das Verhalten von Konqueror als Dateimanager festlegen

source: <ulink url="help:/dolphin/configuring-dolphin.html#preferences-dialog-viewmodes">View Modes</ulink>: Configure file manager view modes
de: <ulink url="help:/dolphin/configuring-dolphin.html#preferences-dialog-viewmodes">Ansichts-Modi</ulink>: Dateimanager-Ansichten einrichten

source: <ulink url="help:/dolphin/configuring-dolphin.html#preferences-dialog-navigation">Navigation</ulink>: Configure file manager navigation
de: <ulink url="help:/dolphin/configuring-dolphin.html#preferences-dialog-navigation">Navigation</ulink>: Einstellungen zur Navigation mit dem Dateiverwaltungsprogramm

source: <ulink url="help:/dolphin/configuring-dolphin.html#preferences-dialog-services">Services</ulink>: Configure file manager services
de: <ulink url="help:/dolphin/configuring-dolphin.html#preferences-dialog-services">KDE-Dienste</ulink>: Dateiverwaltungs-Dienste einrichten

source: <ulink url="help:/dolphin/configuring-dolphin.html#preferences-dialog-general">General</ulink>: Configure general file manager settings
de: <ulink url="help:/dolphin/configuring-dolphin.html#preferences-dialog-general">Allgemein</ulink>: Allgemeine Einstellungen für das Dateiverwaltungsprogramm

source: <ulink url="help:/kcontrol/filetypes/index.html">File Associations</ulink>: Configure file associations
de: <ulink url="help:/kcontrol/filetypes/index.html">Dateizuordnungen</ulink>: Dateizuordnungen vornehmen

source: <ulink url="help:/kcontrol/trash/index.html">Trash</ulink>: Configure trash settings
de: <ulink url="help:/kcontrol/trash/index.html">Papierkorb</ulink>: Papierkorb-Einstellungen festlegen

source: <ulink url="help:/kcontrol/khtml-behavior/index.html">Web Browsing</ulink>: Configure the browser behavior
de: <ulink url="help:/kcontrol/khtml-behavior/index.html">Surfen im Internet</ulink>: Verhalten des Webbrowsers festlegen

source: <ulink url="help:/kcontrol/proxy/index.html">Proxy</ulink>: Configure the proxy servers used
de: <ulink url="help:/kcontrol/proxy/index.html">Proxy</ulink>: Proxy-Server einrichten

source: <ulink url="help:/kcontrol/kcmcss/index.html">Appearance</ulink>: Configure how to display web pages
de: <ulink url="help:/kcontrol/kcmcss/index.html">Erscheinungsbild</ulink>: Einstellungen für die Darstellung von Webseiten

source: <ulink url="help:/kcontrol/khtml-adblock/index.html">AdBlocK Filters</ulink>: Configure &konqueror; AdBlocK filters
de: <ulink url="help:/kcontrol/khtml-adblock/index.html">Werbefilter</ulink>: Hier können Sie Einstellungen zum Werbefilter vornehmen

source: <ulink url="help:/kcontrol/ebrowsing/index.html">Web Shortcuts</ulink>: Configure enhanced browsing
de: <ulink url="help:/kcontrol/ebrowsing/index.html">Web-Kürzel</ulink>: Die Verwendung von Web-Kürzeln einrichten

source: <ulink url="help:/kcontrol/cache/index.html">Cache</ulink>: Configure web cache settings
de: <ulink url="help:/kcontrol/cache/index.html">Zwischenspeicher</ulink>: Einstellungen zum Zwischenspeicher vornehmen

source: <ulink url="help:/kcontrol/history/index.html">History</ulink>: Configure the history sidebar
de: <ulink url="help:/kcontrol/history/index.html">Verlaufsspeicher</ulink>: Verlaufsanzeige im Navigationsbereich einrichten

source: <ulink url="help:/kcontrol/cookies/index.html">Cookies</ulink>: Configure the way cookies work
de: <ulink url="help:/kcontrol/cookies/index.html">Cookies</ulink>: Einstellungen zu Cookies vornehmen

source: <ulink url="help:/kcontrol/useragent/index.html">Browser Identification</ulink>: Configure the way Konqueror reports itself
de: <ulink url="help:/kcontrol/useragent/index.html">Browserkennung</ulink>: Kennungen für Konqueror als Webbrowser festlegen

source: <ulink url="help:/kcontrol/khtml-java-js/index.html">Java &amp; JavaScript</ulink>: Configure the behavior of Java and JavaScript
de: <ulink url="help:/kcontrol/khtml-java-js/index.html">Java &amp; JavaScript</ulink>: Verhalten von Java und JavaScript festlegen

source: <ulink url="help:/kcontrol/khtml-plugins/index.html">Plugins</ulink>: Configure the browser plugins
de: <ulink url="help:/kcontrol/khtml-plugins/index.html">Erweiterungen</ulink>: Erweiterungsmodule für den Webbrowser einrichten

source: Pressing the <guibutton>Help</guibutton> button will give you detailed instructions about how to use each of these sections, or you can use the <link linkend="bubble">What's This?</link> feature.
de: Durch Drücken des Knopfes <guibutton>Hilfe</guibutton>, erhalten Sie detaillierte Informationen dazu, wie Sie diese Abschnitte nutzen können. Sie können auch die Funktion <link linkend="bubble">Was ist das?</link> benutzen.

source: Command Reference
de: Befehlsreferenz

source: The shortcut key combinations shown in this chapter are the default ones. They can of course be <link linkend="configshort">changed</link>.
de: Die in diesem Kapitel aufgelisteten Kurzbefehle sind Voreinstellungen, die natürlich <link linkend="configshort">geändert</link> werden können.

source: Special Shortcuts
de: Spezielle Kurzbefehle

source: There are some useful shortcuts that are not shown in any of the menus:
de: Es gibt einige nützliche Kurzbefehle, die in keinem Menü erscheinen:

source: Sets the focus to the text entry box in the Location Toolbar.
de: Setzt den Fokus auf das Texteingabefeld der Adressleiste.

source: Activate the next tab page.
de: Aktiviert das nächste Unterfenster

source: Activate the previous tab page.
de: Aktiviert das vorherige Unterfenster

source: The Menubar
de: Die Menüleiste

source: Note that some menu entries only appear when they are applicable to the file you currently have open in &konqueror;. For example, the <menuchoice><guimenu>Edit</guimenu><guimenuitem>Find...</guimenuitem> </menuchoice> item will not appear when you are viewing the contents of a directory.
de: Beachten Sie, dass einige Menüeinträge nur dann erscheinen, wenn Sie für die gerade von Ihnen in &konqueror; geöffnete Datei geeignet sind. Der Eintrag <menuchoice><guimenu>Bearbeiten</guimenu><guimenuitem>Suchen ...</guimenuitem> </menuchoice> erscheint zum Beispiel nicht, wenn Sie den Inhalt eines Ordners betrachten.

source: &konqueror; has different menu items in file manager and browser mode. Only the items for these two modes are described in this chapter.
de: &konqueror; hat verschiedene Menüeinträge im Dateiverwaltungs- und Browser-Modus. Nur die Einträge für diese beiden Modi werden in diesem Kapitel beschrieben.

source: If <emphasis>&konqueror;</emphasis> is using embedded components (&kde; Parts) such as <application>Gwenview</application> for image viewing, &okular; for <acronym>PDF</acronym> and &PostScript; documents &etc; the menu items from these applications are merged into &konqueror;'s menu. Help for these additional menu items you find in the handbook of the embedded application.
de: Wenn in <emphasis>&konqueror;</emphasis> eingebettete Komponenten (&kde;-Parts) wie <application>Gwenview</application> zur Anzeige von Bildern, oder &okular; für <acronym>PDF</acronym>- und &PostScript;-Dokumente benutzt werden, werden die Menüeinträge dieser Programme in die Menüeinträge vom &konqueror; eingefügt. Hilfe zu diesen zusätzlichen Einträgen finden Sie in den Handbüchern der eingebetteten Programme.

source: The File Menu
de: Das Menü Datei

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>New Window</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo></shortcut> <guimenu>Datei</guimenu> <guimenuitem>Neues Fenster</guimenuitem>

source: Open another &konqueror; window.
de: Öffnet ein weiteres &konqueror;-Fenster.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>T</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>New Tab</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>T</keycap></keycombo> </shortcut><guimenu>Fenster</guimenu> <guimenuitem>Neues Unterfenster</guimenuitem>

source: Open another &konqueror; tab, containing a blank page.
de: Öffnet ein weiteres &konqueror;-Unterfenster und zeigt eine leere Seite an.

source: <shortcut> <keycombo action="simul">&Alt;<keycap>O</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Open Location...</guimenuitem>
de: <shortcut> <keycombo action="simul">&Alt;<keycap>O</keycap></keycombo> </shortcut><guimenu>Datei</guimenu> <guimenuitem>Adresse aufrufen</guimenuitem>

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>O</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Open File...</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>D</keycap></keycombo> </shortcut> <guimenu>Datei</guimenu> <guimenuitem>Datei öffnen ...</guimenuitem>

source: Open a file using the &kde; file dialog.
de: Öffnet eine Datei mit Hilfe des &kde;-Dateidialog.

source: <guimenu>File</guimenu> <guimenuitem>Sessions</guimenuitem>
de: <guimenu>Datei</guimenu> <guimenuitem>Sitzungen</guimenuitem>

source: Open a submenu to save the current session (open tabs and windows) for easy retrieval, manage sessions and switch to previously saved sessions.
de: Öffnet ein Untermenü, um die aktuelle Sitzung (geöffnete Fenster und Unterfenster) zu speichern, Sitzungen zu verwalten und zu vorher gespeicherten Sitzungen zu wechseln.

source: <guimenu>File</guimenu> <guimenuitem>Send Link Address...</guimenuitem>
de: <guimenu>Datei</guimenu> <guimenuitem>Verknüpfungsadresse versenden</guimenuitem>

source: Send an email containing a link to the current location.
de: Bereitet eine E-Mail zum Senden vor, die die Verknüpfung zur angezeigten Adresse enthält.

source: <guimenu>File</guimenu> <guimenuitem>Send File...</guimenuitem>
de: <guimenu>Datei</guimenu> <guimenuitem>Datei versenden ...</guimenuitem>

source: Send an email containing the selected file as an attachment.
de: Bereitet eine E-Mail zum Versenden vor, die die ausgewählte Datei als Anhang enthält.

source: <menuchoice> <guimenu>File</guimenu> <guimenuitem>Save Background Image As...</guimenuitem></menuchoice> (Browser mode)
de: <menuchoice><guimenu>Datei</guimenu> <guimenuitem>Hintergrundbild speichern unter ...</guimenuitem></menuchoice> (Browser-Modus)

source: Only applies if you are viewing a web page with a background image. Opens the <guilabel>Save As</guilabel> dialog box to let you save the background image file to your own computer.
de: Ist nur verfügbar, wenn Sie eine Webseite mit Hintergrundbild geladen haben. Es wird ein Dialogfenster angezeigt, mit dessen Hilfe Sie das Hintergrundbild auf Ihrem Rechner speichern können.

source: <menuchoice> <guimenu>File</guimenu> <guimenuitem>Save As...</guimenuitem></menuchoice> (Browser mode)
de: <menuchoice><guimenu>Datei</guimenu> <guimenuitem>Speichern unter ...</guimenuitem></menuchoice> (Browser-Modus)

source: Only applies if you are viewing a document or web page, uses the <guilabel>Save As...</guilabel> dialog box to let you save a copy to your own computer.
de: Ist nur verfügbar, wenn Sie ein Dokument oder eine Webseite betrachten. Sie können mit dem Dialogfenster <guilabel>Speichern unter ...</guilabel> eine Kopie auf Ihrem Rechner speichern.

source: <menuchoice> <guimenu>File</guimenu> <guimenuitem>Save Frame As...</guimenuitem></menuchoice> (Browser mode)
de: <menuchoice><guimenu>Datei</guimenu> <guimenuitem>Rahmen speichern unter ...</guimenuitem></menuchoice> (Browser-Modus)

source: Similar to <guimenuitem>Save As...</guimenuitem> but for use with a web site that uses frames.
de: Ähnlich wie <guimenuitem>Speichern unter ...</guimenuitem>, jedoch für Webseiten, die Rahmen (Frames) benutzen.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>P</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Print...</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>P</keycap></keycombo></shortcut> <guimenu>Datei</guimenu> <guimenuitem>Drucken ...</guimenuitem>

source: Print.
de: Druckt das momentan dargestellte Objekt aus.

source: <menuchoice> <guimenu>File</guimenu> <guimenuitem>Print Frame</guimenuitem></menuchoice> (Browser mode)
de: <menuchoice><guimenu>Datei</guimenu> <guimenuitem>Rahmen drucken ..</guimenuitem> </menuchoice>(Browser-Modus)

source: Print selected frame of a Web page.
de: Druckt den ausgewählten Rahmen einer Internetseite

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Quit</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo></shortcut> <guimenu>Datei</guimenu> <guimenuitem>Beenden</guimenuitem>

source: Close down this instance of &konqueror;.
de: Beendet diese Instanz von &konqueror;

source: The Edit Menu
de: Das Menü Bearbeiten

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Z</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Undo: <replaceable>Action</replaceable></guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Z</keycap></keycombo></shortcut> <guimenu>Bearbeiten</guimenu> <guimenuitem>Rückgängig: <replaceable>Aktion</replaceable></guimenuitem>

source: Sometimes lets you reverse a mistaken action.
de: Macht eine Aktion wieder rückgängig - sofern möglich.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>X</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Cut</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>X</keycap></keycombo></shortcut> <guimenu>Bearbeiten</guimenu> <guimenuitem>Ausschneiden</guimenuitem>

source: Puts selected item(s) into the clipboard. If you then paste the items they will be moved from the original location to the new one.
de: Kopiert die gewählten Elemente in die Zwischenablage. Dann können Sie diese Elemente einfügen. Dann werden sie an der neuen Stelle eingefügt und an der ursprünglichen gelöscht.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>C</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Copy</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>C</keycap></keycombo></shortcut> <guimenu>Bearbeiten</guimenu> <guimenuitem>Kopieren</guimenuitem>

source: Copy selected item(s) to the clipboard.
de: Kopiert die ausgewählten Objekte in die Zwischenablage.

source: <menuchoice> <shortcut> <keycombo action="simul">&Ctrl;<keycap>V</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Paste</guimenuitem></menuchoice> (Browser mode)
de: <menuchoice><shortcut> <keycombo action="simul">&Ctrl;<keycap>V</keycap></keycombo> </shortcut> <guimenu>Bearbeiten</guimenu> <guimenuitem>Einfügen</guimenuitem> </menuchoice>(Browser-Modus)

source: Paste the clipboard content into the Location Bar.
de: Fügt den Inhalt der Zwischenablage in die Adressleiste ein.

source: <menuchoice> <shortcut> <keycombo action="simul">&Ctrl;<keycap>V</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Paste Clipboard Contents...</guimenuitem></menuchoice> (File Manager mode)
de: <menuchoice><shortcut> <keycombo action="simul">&Ctrl;<keycap>V</keycap></keycombo> </shortcut> <guimenu>Bearbeiten</guimenu> <guimenuitem>Inhalt der Zwischenablage einfügen ...</guimenuitem></menuchoice> (Dateiverwaltungs-Modus)

source: Paste the currently copied/cut item(s) to the current folder. If the clipboard does not contain files or folders, the clipboard contents (such as text or image data) will be pasted into a new file.
de: Fügt die momentan kopierten oder ausgeschnittenen Elemente in den aktuellen Ordner ein. Wenn die Zwischenablage keine Dateien oder Ordner enthält, werden ihre Inhalte (wie Text oder Bilddaten) in eine neue Datei eingefügt.

source: <menuchoice> <shortcut> <keycombo action="simul">&Ctrl;<keycap>A</keycap></keycombo> </shortcut><guimenu>Edit</guimenu> <guimenuitem>Select All</guimenuitem></menuchoice> (Browser mode)
de: <menuchoice><shortcut> <keycombo action="simul">&Ctrl;<keycap>A</keycap></keycombo></shortcut> <guimenu>Bearbeiten</guimenu> <guimenuitem>Alles auswählen</guimenuitem></menuchoice> (Browser-Modus)

source: Selects all text in an &HTML; page or in a text page being previewed, you can then <guimenuitem>Copy</guimenuitem> it and <guimenuitem>Paste</guimenuitem> it into a text editor.
de: Wählt den gesamten Text auf einer HTML- oder Textseite aus. Sie können dann den Inhalt mit <guimenuitem>Kopieren</guimenuitem> und <guimenuitem>Einfügen</guimenuitem> in einen Texteditor übertragen.

source: <menuchoice> <guimenu>Edit</guimenu> <guisubmenu>Create New</guisubmenu></menuchoice> (File Manager mode)
de: <menuchoice><guimenu>Bearbeiten</guimenu> <guisubmenu>Neu erstellen</guisubmenu></menuchoice> (Dateiverwaltungs-Modus)

source: Creates a new object (such as a folder or a text file) in the current folder. See the <link linkend="making">Create New...</link> section for more details.
de: Erzeugt ein neues Objekt (wie einen Ordner oder eine Textdatei) im aktuellen Ordner. Im Abschnitt <link linkend="making">Neu erstellen ...</link> finden Sie weitere Einzelheiten.

source: <menuchoice> <shortcut><keycap>F2</keycap> </shortcut><guimenu>Edit</guimenu> <guimenuitem>Rename</guimenuitem></menuchoice> (File Manager mode)
de: <menuchoice><shortcut><keycap>F2</keycap></shortcut> <guimenu>Bearbeiten</guimenu> <guimenuitem>Umbenennen ...</guimenuitem></menuchoice> (Dateiverwaltungs-Modus)

source: Lets you rename a file or folder without having to open the <guimenuitem>Properties...</guimenuitem> dialog box.
de: Lässt Sie eine Datei oder einen Ordner umbenennen, ohne dass Sie hierzu den Dialog <guimenuitem>Eigenschaften ...</guimenuitem> öffnen müssen.

source: <menuchoice> <shortcut><keycap>Del</keycap></shortcut> <guimenu>Edit</guimenu> <guimenuitem>Move to Trash</guimenuitem></menuchoice> (File Manager mode)
de: <menuchoice><shortcut><keycap>Entf</keycap></shortcut> <guimenu>Bearbeiten</guimenu> <guimenuitem>In den Papierkorb werfen</guimenuitem></menuchoice> (Dateiverwaltungs-Modus)

source: Move selected item(s) to the Trash folder.
de: Verschiebt die ausgewählten Objekte in den Papierkorb-Ordner.

source: <menuchoice> <shortcut> <keycombo action="simul">&Shift;<keycap>Del</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Delete</guimenuitem></menuchoice> (File Manager mode)
de: <menuchoice><shortcut> <keycombo action="simul">&Shift;<keycap>Entf</keycap></keycombo> </shortcut> <guimenu>Bearbeiten</guimenu> <guimenuitem>Löschen</guimenuitem></menuchoice> (Dateiverwaltungs-Modus)

source: Delete the selected item(s).
de: Löscht die ausgewählten Objekte.

source: <menuchoice> <guimenu>Edit</guimenu> <guimenuitem>Edit File Type...</guimenuitem></menuchoice> (File Manager mode)
de: <menuchoice><guimenu>Bearbeiten</guimenu> <guimenuitem>Dateityp bearbeiten ...</guimenuitem></menuchoice> (Dateiverwaltungs-Modus)

source: Open the <guilabel>Edit File Type</guilabel> dialog box
de: Öffnet den Dialog <guilabel>Dateityp bearbeiten</guilabel>

source: <menuchoice> <shortcut> <keycombo action="simul">&Alt;<keycap>Return</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Properties...</guimenuitem></menuchoice> (File Manager mode)
de: <menuchoice><shortcut> <keycombo action="simul">&Alt;<keycap>Eingabe</keycap></keycombo> </shortcut> <guimenu>Bearbeiten</guimenu> <guimenuitem>Eigenschaften</guimenuitem></menuchoice> (Dateiverwaltungs-Modus)

source: Shows the properties dialog for the currently selected item(s).
de: Zeigt die Eigenschaften der momentan ausgewählten Elemente an.
