Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/applications/konqueror.po
Languages: de

source: Creates a skeleton <acronym>HTML</acronym> source file. When you type the new file's name into the dialog box it is probably best to give it a <literal role="extension">.html </literal> extension to avoid confusion.
de: Erzeugt das <quote>Gerüst</quote> einer <acronym>HTML</acronym>-Quelldatei. Wenn Sie im Dialogfenster einen Namen für die Datei eingeben, sollten Sie ihr die Endung <literal role="extension">.html</literal> geben, um Verwirrung zu vermeiden.

source: <replaceable>Type of Document</replaceable> Document...
de: <replaceable>Art des Dokuments</replaceable> Dokument...

source: Depending on the installed applications and file associations several menuitems for different types of documents are displayed and enable you to create skeleton documents of the selected type.
de: Abhängig von den installierten Anwendungen und Dateizuordnungen werden mehrere Menüeinträge für verschiedene Arten von Dokumenten angezeigt. Damit können Sie ein Standarddokument der gewählten Art erstellen.

source: Link to Location (URL)...
de: Verknüpfung zu Adresse (URL) ...

source: This lets you create an icon to open &konqueror; at a particular folder or web page. As with <guimenuitem>Link To Application...</guimenuitem> you can make the application icon appear on your desktop by creating the link in your <filename>~/Desktop</filename> folder or going to the <guisubmenu>Create New...</guisubmenu> sub menu by right clicking on a free area of the desktop.
de: Hiermit können Sie ein Symbol erstellen, mit dessen Hilfe Sie &konqueror; gleich mit einem bestimmten Ordner oder einer Internetseite starten können. Ebenso wie bei <guimenuitem>Verknüpfung mit Programm ...</guimenuitem> können Sie diese Verknüpfung auch auf Ihrer Arbeitsfläche erstellen, indem Sie sie im Ordner <filename>~/Desktop</filename> erstellen oder indem Sie mit der &RMBn; auf eine freie Stelle Ihrer Arbeitsfläche klicken und <guisubmenu>Neu erstellen</guisubmenu> auswählen.

source: Basic link to file or directory...
de: Einfache Verknüpfung zu Datei oder Ordner ...

source: Create a symbolic link for local files or folder.
de: Erstellt eine symbolische Verknüpfung für lokale Dateien oder Ordner.

source: Link to Application...
de: Verknüpfung zu Programm ...

source: This option is most useful if you want to create an icon that will open a particular application. It opens a dialog box with several tabbed pages. The first, <guilabel>General</guilabel>, is where you choose an icon and the text that will appear with it. The second page, <guilabel>Permissions</guilabel>, lets you select who can use or modify the icon. In the <guilabel>Application</guilabel> page you must enter the <guilabel>Command</guilabel> that will run the application, for example, <userinput>kwrite</userinput> to start up the &kwrite; text editor. <userinput>kwrite /home/pam/todo.txt</userinput> would open the file <filename>/home/pam/todo.txt</filename> in &kwrite;. Advanced options such as the file types which the application can open are also available from this page.
de: Mit dieser Option können Sie eine Verknüpfung zu einem bestimmten Programm herstellen. Es öffnet sich ein Dialogfenster mit mehreren Karteikarten. Die erste Karteikarte, <guilabel>Allgemein</guilabel> ermöglicht des Festlegen des Namens der Verknüpfung und deren Symbol. In der zweiten Karteikarte, <guilabel>Berechtigungen</guilabel>, können Sie die Berechtigungen für diese Verknüpfung festlegen. In der Karte <guilabel>Programm</guilabel> müssen Sie den <guilabel>Befehl</guilabel> eingeben, auf den die Verknüpfung zeigen soll. Ein Beispiel: Geben Sie dort <userinput>kwrite</userinput> ein, um den Texteditor &kwrite; zu starten. <userinput>kwrite /home/daniela/aufgaben.txt</userinput> würde die Datei <filename>/home/daniela/aufgaben.txt</filename> mit &kwrite; öffnen. Auf dieser Seite haben Sie auch Zugriff auf erweiterte Einstellmöglichkeiten wie zum Beispiel die Dateitypen, die das Programm öffnen kann.

source: To make the application icon appear on your desktop, create the link in your <filename class="directory">~/Desktop</filename> folder (this may be called something slightly different depending on how &kde; was installed on your system) or get to the <guisubmenu>Create New...</guisubmenu> sub menu by <mousebutton>right</mousebutton> clicking on a free area of the desktop instead of within &konqueror;'s window.
de: Damit eine Anwendung als Symbol auf Ihrer Arbeitsfläche angezeigt wird, müssen Sie in dem Ordner <filename class="directory">~/Desktop</filename> (der Name kann, je nachdem wie &kde; auf Ihrem System installiert wurde, etwas abweichen.) eine Verknüpfung mit dieser Anwendung erstellen. Alternativ können Sie auch auf eine freie Stelle Ihrer Arbeitsfläche mit der &RMBn; klicken und dort <guisubmenu>Neu erstellen</guisubmenu> auswählen.

source: If you have a lot of specialized application links and don't want to clutter up the desktop, then why not create them in your Applications folder. You can get there in &konqueror; by choosing <menuchoice><guimenu>Go</guimenu> <guimenuitem>Applications</guimenuitem></menuchoice>. Then create a single icon on your desktop to open your Applications folder, which is usually in <filename class="directory">~/.local/share/applications</filename>.
de: Wenn Sie viele Verknüpfungen zu Anwendungen haben, und Ihre Arbeitsfläche damit nicht überfüllen wollen, können Sie diese Verknüpfungen auch in Ihren Programmordner legen. Sie gelangen mit &konqueror; dorthin, indem Sie <menuchoice><guimenu>Gehe zu</guimenu> <guimenuitem>Programme</guimenuitem></menuchoice> anklicken. Erstellen Sie daraufhin eine einzelne Verknüpfung zu Ihrem Programmordner; dieser befindet sich normalerweise in <filename class="directory">~/.local/share/applications</filename>.

source: To put an application link icon into the panel, first create it in the Applications folder then drag the icon onto a clear area of the panel.
de: Um eine Programmverknüpfung in die Kontrollleiste aufzunehmen, erstellen Sie zuerst die Verknüpfung im Programmordner und dann ziehen Sie die Verknüpfung auf eine freie Stelle der Kontrollleiste.

source: Link to Device
de: Verknüpfung zu Gerät

source: Use the options in this submenu to create an icon that will mount a device and open an instance of &konqueror; showing it's contents. To unmount the device when you have finished with it <mousebutton>right</mousebutton> click on the icon and select <guimenuitem>Unmount</guimenuitem>. However, in most cases you will want to create the icon on your desktop.
de: Benutzen Sie die Option in diesem Untermenü, um ein Symbol für das Einbinden eines Geräts zu erstellen, das das Gerät in einer neuen Instanz von &konqueror; öffnet und den Inhalt anzeigt. Um die Einbindung des Geräts in das Dateisystem wieder zu lösen, klicken Sie mit <mousebutton>rechts</mousebutton> auf das Symbol und wählen <guimenuitem>Einbindung lösen</guimenuitem>. Normalerweise ist die Arbeitsfläche ein guter Platz für ein solches Symbol.

source: Changing Names and Permissions
de: Ändern von Namen und Rechten

source: The two easiest ways to change the name of a file or folder is to either <mousebutton>right</mousebutton> click on it and select <guimenuitem>Rename</guimenuitem>, or select the file or folder and then press the <keycap>F2</keycap> key.
de: Am einfachsten können Sie Dateien oder Ordner umbenennen, indem Sie sie entweder mit der &RMBn; anklicken und <guimenuitem>Umbenennen</guimenuitem> auswählen, oder indem Sie die Datei oder den Ordner auswählen und dann die Taste <keycap>F2</keycap> drücken.

source: To change the name or permissions of a file or folder <mousebutton>right</mousebutton> click on its name or icon and select the <guimenuitem>Properties</guimenuitem> item, or if you have <quote>selected</quote> the file or folder, then you can use the Menubar <menuchoice><guimenu>Edit</guimenu><guimenuitem>Properties</guimenuitem> </menuchoice> (<keycombo action="simul">&Alt;<keycap>Return</keycap></keycombo>) option.
de: Wenn Sie den Namen oder die Zugriffsrechte einer Datei oder eines Ordners ändern wollen, wählen Sie nach einem Rechtsklick auf den Namen oder das Symbol den Eintrag <guimenuitem>Eigenschaften</guimenuitem>. Oder, falls Sie die Datei oder den Ordner bereits <quote>ausgewählt</quote> haben, können Sie in der Menüleiste den Eintrag <menuchoice><guimenu>Bearbeiten</guimenu> <guimenuitem>Eigenschaften</guimenuitem></menuchoice> (<keycombo action="simul">&Alt;<keycap>Eingabetaste</keycap></keycombo>) auswählen.

source: This will bring up the Properties dialog box with several tabbed pages:
de: Daraufhin wird das Dialogfeld „Eigenschaften“ geöffnet, das aus mehreren Karteikarten besteht:

source: <guilabel>General</guilabel>, which gives you some information about the item and lets you change its name and, for a folder, the associated icon.
de: <guilabel>Allgemein</guilabel>, dort werden einige Informationen über das Objekt angezeigt und dort ist es auch möglich, den Namen und, im Falle eines Ordners, das zugehörige Symbol zu ändern.

source: <guilabel>Permissions</guilabel>, which shows you the item's ownership and access permissions and lets you change the permissions.
de: <guilabel>Berechtigungen</guilabel>, dort werden der Eigentümer und die Zugangsberechtigungen angezeigt. Diese Rechte können - wenn Sie der Eigentümer oder der Systemadministrator (Super User) sind - hier auch geändert werden.

source: Copy and Rename
de: Kopieren und Umbenennen

source: If you want to make a copy of an existing file with a different name -- perhaps as a backup -- in the same folder as the original file, do a normal <guimenuitem>Copy</guimenuitem> then when you <guimenuitem>Paste</guimenuitem> it a dialog box will pop up complaining that the file already exists. Just type the new name into the dialog's text box and press the <guibutton>Continue</guibutton> button (or if you are feeling lazy pressing the <guibutton>Suggest New Name</guibutton> button will generate a new name for you).
de: Wenn Sie eine Kopie einer vorhandenen Datei im gleichen Ordner wie die Quelldatei anlegen möchten &mdash; vielleicht als Sicherungskopie &mdash; können Sie dies durch Ausführen der Option <guimenuitem>Kopieren</guimenuitem> und <guimenuitem>Einfügen</guimenuitem> erreichen. Es erscheint ein Dialog mit der Mitteilung, dass diese Datei bereits existiert. Tippen Sie nun den neuen Namen in das Textfeld des Dialoges ein und drücken Sie dann den Knopf <guibutton>Fortsetzen</guibutton> (oder drücken Sie den Knopf <guibutton>Neuen Namen vorschlagen</guibutton>, um einen neuen Namen erzeugen zu lassen).

source: Configuring File Associations
de: Dateizuordnungen einrichten

source: &kde; provides many applications which can open many different types of file. Most of the time, the defaults will work with no problems, but &konqueror; provides a powerful system to allow you to change the applications used to open each file type. For more details, choose the <menuchoice><guimenu>Settings</guimenu><guimenuitem>Configure Konqueror...</guimenuitem></menuchoice> menu item, select <guilabel>File Associations</guilabel> in the configuration dialog, and click on <guibutton>Help</guibutton>.
de: &kde; enthält viele Programme, die die verschiedensten Dateitypen öffnen können. In der Regel funktionieren die Voreinstellungen einwandfrei. Dennoch hat &konqueror; eine leistungsfähige Möglichkeit, mit der Sie die Anwendung auswählen können, mit der ein bestimmter Dateityp geöffnet werden soll. Details zu diesem Thema erhalten Sie, indem Sie <menuchoice><guimenu>Einstellungen</guimenu><guimenuitem>Konqueror einrichten ...</guimenuitem></menuchoice> wählen. Klicken Sie dann bitte auf <guilabel>Dateizuordnungen</guilabel> und danach den <guibutton>Hilfe</guibutton>-Knopf.

source: At the Command Line
de: Die Befehlszeile

source: Although &konqueror; is a very powerful and flexible <acronym>GUI</acronym> file manager, there are occasions when the experienced &Linux; / &UNIX; user wants to get down to the basics and work at the text command line level.
de: Obwohl &konqueror; ein leistungsfähiger und flexibler grafischer Dateimanager ist, gibt es auch Situationen, in denen ein erfahrener &Linux; / &UNIX;-Benutzer lieber mit der Befehlszeile arbeiten möchte.

source: You can, of course, open an instance of &konsole;, perhaps with &konqueror;'s Menubar <menuchoice><guimenu>Tools</guimenu><guimenuitem>Open Terminal</guimenuitem></menuchoice> option or with <keycap>F4</keycap>.
de: Sie können natürlich das Programm &konsole; starten, zum Beispiel über &konqueror;s Menüleiste mit <menuchoice><guimenu>Extras</guimenu> <guimenuitem>Terminal öffnen ...</guimenuitem></menuchoice> oder mit der Tastenkombination <keycap>F4</keycap>.

source: If you only want to launch a program or view a &URL;, the <menuchoice> <guimenu>Tools</guimenu><guimenuitem>Execute Shell Command...</guimenuitem></menuchoice> (<keycombo action="simul">&Ctrl;<keycap>E</keycap></keycombo>) option may be easier.
de: Falls Sie jedoch nur ein Programm starten oder eine &URL; aufrufen möchten, ist der Aufruf von <menuchoice> <guimenu>Extras</guimenu><guimenuitem>Befehl ausführen ...</guimenuitem> </menuchoice> oder (<keycombo action="simul">&Ctrl;<keycap>E</keycap></keycombo>) einfacher.

source: <menuchoice><guimenu>Tools</guimenu><guimenuitem>Execute Shell Command... </guimenuitem></menuchoice> (<keycombo action="simul">&Ctrl; <keycap>E</keycap></keycombo>) opens a small command line dialog window where you can enter a shell command such as <userinput>ps -ax | grep kdeinit </userinput>. Note that it does not support full featured terminal control characters, so applications such as <userinput>top</userinput> and <userinput> less</userinput> will not work properly, but it is available immediately without the delay involved in starting &konsole;.
de: <menuchoice><guimenu>Extras</guimenu><guimenuitem>Befehl ausführen ... </guimenuitem></menuchoice> (<keycombo action="simul">&Ctrl; <keycap>E</keycap></keycombo>) öffnet ein kleines Dialogfenster mit einer Befehlszeile, in der Sie Befehle wie &eg; <userinput>ps -ax | grep kdeinit </userinput> eingeben können. Beachten Sie jedoch, dass Ihnen nicht der volle Leistungsumfang einer Konsole zur Verfügung steht. Anwendungen wie <userinput>top</userinput> und <userinput> less</userinput> werden nicht richtig funktionieren, jedoch steht Ihnen die Befehlszeile sofort und ohne Verzögerung, die der Start einer &konsole; mit sich bringen würde, zur Verfügung.

source: For more complex operations, &konqueror; has another nice feature: the Menubar <menuchoice><guimenu>Settings</guimenu><guimenuitem>Show Terminal Emulator</guimenuitem></menuchoice> option, which opens up a terminal window as a new view within &konqueror;. As long as the link icon is visible at the bottom right corner of each view, the terminal will follow any folder changes you make in the normal file manager view.
de: Für komplexere Anwendungen gibt es in &konqueror; noch eine weitere, elegante Möglichkeit, und zwar über die Menüleiste <menuchoice><guimenu>Einstellungen</guimenu> <guimenuitem>Terminal-Emulator anzeigen</guimenuitem></menuchoice>. Dies öffnet ein Terminalfenster als eingebettete Ansicht innerhalb von &konqueror;, und solange die Ansichten miteinander verknüpft sind, bewirkt ein Ordnerwechsel in der Ordneransicht auch einen Ordnerwechsel im Terminalfenster.

source: Including the terminal emulator
de: Einbetten des Terminalemulators

source: &konqueror; the Web Browser
de: &konqueror; - Der Internet-Browser

source: Browsing www.konqueror.org
de: Die Webseite www.konqueror.org - mit Konqueror dargestellt

source: Connecting to the Internet
de: Verbindung ins Internet

source: Once you are connected to the Internet you can use &konqueror; to browse the Web just as easily as you can use it to handle your local files. Just type a &URL; into the <guilabel>Location</guilabel> Toolbar window, press &Enter;, and you are away!
de: Wenn Sie mit dem Internet verbunden sind, können Sie mit &konqueror; genauso einfach im Internet surfen, wie Sie mit ihm Ihre lokalen Dateien auf Ihrem Rechner verwalten. Geben Sie einfach eine Adresse (<abbrev>URL</abbrev>) in die Adressleiste ein und drücken Sie anschließend <keycap>Eingabe</keycap> &mdash; und schon sind Sie unterwegs!

source: If you use a dial-up modem connection, then you will be using &kppp; or a similar dialer program to make the connection.
de: Bei einer Modemverbindung können Sie ein Programm wie &kppp; benutzen, um die Verbindung ins Internet herzustellen.

source: If your machine is connected to a local area network (<acronym>LAN</acronym>) that gives you a proxy connection to the Internet then you will have to set &konqueror; up for the proxy connection. This can be done with the <menuchoice><guimenu>Web Browsing</guimenu> <guimenuitem>Proxy</guimenuitem></menuchoice> page of the <menuchoice><guimenu> Settings</guimenu><guimenuitem>Configure Konqueror...</guimenuitem> </menuchoice> dialog.
de: Wenn Ihr Rechner an ein lokales Netzwerk (<acronym>LAN</acronym>) mit Proxy-Verbindung ins Internet angeschlossen ist, dann müssen Sie &konqueror; für diese Proxy-Verbindung einrichten. Sie können dies auf der Seite <menuchoice><guimenu>Surfen im Internet</guimenu> <guimenuitem>Proxy</guimenuitem></menuchoice> des Dialogs <menuchoice><guimenu> Einstellungen</guimenu><guimenuitem>Konqueror einrichten ...</guimenuitem> </menuchoice> tun.

source: If you are lucky enough to have a high speed cable connection, then the service provider will probably give you an external cable modem which needs an ethernet connection to your machine. Unfortunately the details of how to establish the connection depend on the service provider and to some extent on which Linux/&UNIX; distribution you are using. Some <acronym>ISP</acronym>s connect their customers to the Internet through a proxy server, in which case you will have to set up &konqueror; to use it. You may find it useful to search the archives of your distribution's user group mailing list for help.
de: Wenn Sie über eine Hochgeschwindigkeits-Kabelverbindung mit dem Internet verbunden sind, wird Ihnen Ihr Internetanbieter vermutlich ein externes Kabelmodem zur Verfügung stellen, das über eine Netzwerkverbindung mit Ihrem Rechner verbunden ist. Leider hängen die Details der Verbindung von Ihrem Internetanbieter und in gewissem Ausmaß auch von Ihrer Linux/&UNIX;-Distribution ab. Manche Internetanbieter (Internet Service Provider, <abbrev>ISP</abbrev>s) verbinden Sie über einen Proxy mit dem Internet. In diesem Fall müssen Sie in &konqueror; die entsprechenden Proxy-Einstellungen vornehmen. Es ist auch empfehlenswert, die Archive der Mailingliste zu Ihrer Distribution durchzusehen.

source: An error message such as <errorname>Unknown Host</errorname> usually means that &konqueror; cannot find a connection to the Internet or that you have entered an incorrect &URL;.
de: Eine Fehlermeldung wie <errorname>Unbekannter Rechner</errorname> bedeutet normalerweise, dass &konqueror; keine Verbindung zum Internet hat - oder dass Sie eine falsche Adresse eingegeben oder sich verschrieben haben.

source: Surfing and Searching
de: Surfen und Suchen

source: Once you have a connection to the Internet, you can surf with &konqueror; just as you can with any other browser.
de: Sobald die Verbindung zum Internet hergestellt ist, können Sie mit &konqueror; &mdash; genauso wie mit jedem anderen Browser &mdash; im Internet surfen.

source: Type a &URL; into the Location Toolbar window, press &Enter; or <mousebutton>left</mousebutton> click on the <guibutton>Go</guibutton> button at the right hand end of the Location Toolbar, and &konqueror; will download and display that page. If you have visited the page before, &konqueror;'s <link linkend="path-complete">Automatic Text Completion</link> feature can help you type the &URL; a second time, or you could look through the <guilabel>History</guilabel> page in the <link linkend="sidebar">Sidebar</link>. If you want to use one of the web's search engines, &konqueror;'s <link linkend="enhanced-browsing"> Web Shortcuts</link> feature can make this easier.
de: Tippen Sie eine &URL; in die Adressleiste, drücken Sie die &Enter;-Taste oder klicken Sie mit der linken Maustaste auf den <guibutton>Gehe zu</guibutton>-Knopf rechts außen neben der Adressleiste und &konqueror; wird die Seite laden und anzeigen. Falls Sie die Seite vorher bereits besucht haben, kann &konqueror;s Funktion für die <link linkend="path-complete">Automatische Textvervollständigung</link> Ihnen dabei helfen, die &URL; ein zweites Mal einzugeben oder Sie durchsuchen den <guilabel>Verlauf</guilabel> im <link linkend="sidebar">Navigationsbereich</link>. Die Benutzung der Web-Suchmaschinen wird Ihnen durch &konqueror;s <link linkend="enhanced-browsing">Web-Kurzbefehle</link> erleichtert.

source: <mousebutton>Left</mousebutton> click on a link in a page to open that link.
de: Klicken Sie mit der linken Maustaste auf eine Verknüpfung (Link) in der angezeigten Seite, um der Verknüpfung zu folgen und die neue Seite aufzurufen, auf die Verknüpfung verweist.

source: To open a link in a new instance of &konqueror;, leaving the old page still visible, &RMB; click on the link and select the <guimenuitem>Open in New Window</guimenuitem> option. Alternatively, you might want to <guimenuitem>Open in New Tab</guimenuitem>. <link linkend="tabbrowse">Tabbed Browsing</link> will let you hold a number of pages in one &konqueror; window and quickly switch between them with a single mouse click.
de: Um eine Verknüpfung in einem neuen &konqueror;-Fenster anzuzeigen, wobei die Ursprungsseite sichtbar bleiben soll, klicken Sie mit der &RMBn; auf die Verknüpfung und wählen Sie die Option <guimenuitem>In neuem Fenster öffnen</guimenuitem> aus dem Kontextmenü. Alternativ können Sie auch die Option <guimenuitem>In neuem Unterfenster öffnen</guimenuitem> wählen. Mittels <link linkend="tabbrowse">Browsen mit Unterfenstern</link> können Sie mehrere Web-Seiten in einem &konqueror;-Fenster geöffnet haben und über die Register mit einem Mausklick zwischen ihnen hin- und herschalten.

source: You could also select multiple view modes with <menuchoice><guimenu>Window</guimenu> <guimenuitem>Split View Left/Right</guimenuitem></menuchoice> (<keycombo action="simul">&Ctrl; &Shift;<keycap>L</keycap></keycombo>) / <menuchoice><guimenu>Window</guimenu> <guimenuitem>Split View Top/Bottom</guimenuitem></menuchoice> (<keycombo action="simul">&Ctrl; &Shift;<keycap>T</keycap></keycombo>) option which will let you see different pages at the same time. This can be useful if you are looking through a complicated set of <acronym>HTML</acronym> pages, but make sure the little link box at the bottom right hand corner is empty when you are doing this.
de: Sie können auch mehrere Ansichten anzeigen lassen: <menuchoice><guimenu>Fenster</guimenu> <guimenuitem>Ansicht in linke und rechte Hälfte teilen</guimenuitem></menuchoice> (<keycombo action="simul">&Ctrl;&Shift;<keycap>L</keycap></keycombo>) oder <menuchoice><guimenu>Fenster</guimenu> <guimenuitem>Ansicht in obere und untere Hälfte teilen</guimenuitem></menuchoice> (<keycombo action="simul">&Ctrl;&Shift;<keycap>T</keycap></keycombo>) ermöglicht Ihnen, mehrere Internet-Seiten gleichzeitig zu betrachten. Besonders nützlich ist dies, wenn Sie sich sehr komplexe <acronym>HTML</acronym>-Seiten anschauen. Vergessen Sie nur nicht sicherzustellen, dass die Ansichten nicht miteinander verknüpft sind (&ie;, das kleine Feld in der Ecke rechts unten muss leer sein).
