Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/applications/konqueror.po
Languages: de

source: Or if the item is <quote>selected</quote> you can use the <guiicon>Copy</guiicon> button on the Toolbar or the Menubar <menuchoice><guimenu>Edit</guimenu> <guimenuitem>Copy</guimenuitem></menuchoice> item, or the <keycombo action="simul">&Ctrl;<keycap>C</keycap></keycombo> shortcut key combination. You can also select <link linkend="selection">multiple</link> files or folders to copy/move as well.
de: Wenn der Eintrag bereits <quote>ausgewählt</quote> wurde, können Sie auch den Knopf <guiicon>Kopieren</guiicon> in der Werkzeugleiste, den Eintrag <menuchoice><guimenu>Bearbeiten</guimenu><guimenuitem>Kopieren</guimenuitem></menuchoice> aus der Menüleiste oder das Tastenkürzel <keycombo action="simul">&Ctrl;<keycap>C</keycap></keycombo> benutzen. Genauso können Sie auch <link linkend="selection">mehrere</link> Dateien und Ordner kopieren bzw. verschieben.

source: Navigate to the folder you want to copy the item into then Paste the item into the new folder by using the Toolbar <guiicon>Paste</guiicon> button or the Menubar <menuchoice><guimenu>Edit</guimenu> <guimenuitem>Paste</guimenuitem></menuchoice> option or the <keycombo action="simul">&Ctrl;<keycap>V</keycap></keycombo> shortcut, or by moving the mouse pointer to a clear area of the window and holding the &RMB; down to bring up a menu containing the <guimenuitem>Paste</guimenuitem> option.
de: Begeben Sie sich nun in den Zielordner und fügen Sie das Objekt in diesen Ordner ein. Dies geschieht durch das Drücken des Knopfes <guiicon>Einfügen</guiicon> in der Werkzeugleiste, Auswählen des Eintrages <menuchoice><guimenu>Bearbeiten</guimenu><guimenuitem>Einfügen</guimenuitem></menuchoice> oder durch Drücken der Tastenkombination <keycombo action="simul">&Ctrl;<keycap>V</keycap></keycombo>. Alternativ können Sie auch den Mauszeiger auf eine freie Stelle des &konqueror;-Fensters bewegen und einen Rechtsklick ausführen, um das Kontextmenü angezeigt zu bekommen, wo Sie dann die Option <guimenuitem>Einfügen</guimenuitem> wählen.

source: Moving a file or subfolder between folders can be done in the same way as copying, except that you choose the <guimenuitem>Cut</guimenuitem> option or <keycombo action="simul">&Ctrl;<keycap>X</keycap></keycombo> instead of <guimenuitem>Copy</guimenuitem>. The item that you have <guimenuitem>Cut</guimenuitem> will be removed from the original folder when you do the <guimenuitem>Paste</guimenuitem> into the new folder.
de: Das Verschieben einer Datei oder eines Ordners verläuft ähnlich wie das Kopieren, mit dem Unterschied, dass Sie statt <guimenuitem>Kopieren</guimenuitem> die Option <guimenuitem>Ausschneiden</guimenuitem> oder die Tastenkombination <keycombo action="simul">&Ctrl;<keycap>X</keycap></keycombo> verwenden müssen. Das Objekt, auf das Sie die Funktion <guimenuitem>Ausschneiden</guimenuitem> angewandt haben, wird von seinem ursprünglichen Ort gelöscht, sobald Sie im Zielordner <guimenuitem>Einfügen</guimenuitem> ausgeführt haben.

source: You can also copy or move selected item(s) to another folder by selecting <guimenuitem>Copy To</guimenuitem> or <guimenuitem>Move To</guimenuitem> from the context menu you get when you <mousebutton>right</mousebutton> click on a file or folder name in the File Manager window.
de: Sie können ausgewählte Objekte auch in einen anderen Ordner kopieren oder verschieben, indem Sie im Dateiverwaltungsprogramm nach einem <mousebutton>Rechts</mousebutton>klick auf eine Datei oder einen Ordner aus dem dann erscheinenden Kontextmenü den Eintrag <guimenuitem>Kopieren nach</guimenuitem> oder <guimenuitem>Verschieben nach</guimenuitem>wählen.

source: To enable this feature select <guilabel>Show 'Copy To' and 'Move To' commands</guilabel> on the <menuchoice><guimenu>File Management</guimenu> <guimenuitem>Services</guimenuitem></menuchoice> page of the settings.
de: Um diese Funktion zu aktivieren, wählen Sie <guilabel>Einträge „Kopieren nach“ und „Verschieben nach“ anzeigen</guilabel> auf der Seite <menuchoice><guimenu>Dateiverwaltung</guimenu> <guimenuitem>Dienste</guimenuitem></menuchoice> des Einrichtungsdialogs.

source: You may not be able to copy or move a file or folder if you don't have the necessary permissions.
de: Sie können Dateien und Ordner nicht verschieben, wenn Sie nicht die entsprechenden Rechte haben.

source: Using Drag 'n Drop
de: Benutzen von Ziehen und Ablegen

source: &konqueror; also supports Drag and Drop copying and moving of files and folders.
de: &konqueror; unterstützt auch Kopier- und Verschiebeaktionen für Dateien und Ordner per <quote>Ziehen und Ablegen</quote>.

source: You can do this by having two instances of &konqueror;, one showing the folder you want to copy from, the other showing the target folder. Position the mouse pointer over the item you wish to copy or move, then, holding the &LMB; pressed, <quote>drag</quote> it to a clear space in the target folder. Release the button and you will be presented with a menu choice of <guimenuitem>Copy Here</guimenuitem>, <guimenuitem>Move Here</guimenuitem> or <guimenuitem>Link Here</guimenuitem>. Take care to <quote>drop</quote> the item into an empty area of the target folder view - dropping it on top of a subfolder will copy or move the item into that folder.
de: Öffnen Sie hierzu zwei Instanzen von &konqueror;. Eine, die den Ordner anzeigt, aus dem heraus Sie kopieren wollen und eine andere, die den Zielordner anzeigt. Positionieren Sie dann den Mauszeiger über den Ordner, den Sie kopieren oder verschieben wollen und <quote>ziehen</quote> Sie ihn bei gedrückter linker Maustaste in einen freien Bereich des Zielordners. Wenn Sie die Taste loslassen, erscheint ein Menü mit den Auswahlmöglichkeiten <guimenuitem>An diese Stelle kopieren</guimenuitem>, <guimenuitem>An diese Stelle verschieben</guimenuitem> oder <guimenuitem>Hiermit verknüpfen</guimenuitem>. Achten Sie darauf, das Objekt über einen freien Bereich des Zielordners <quote>fallen zu lassen</quote> - es auf einen Ordner fallen zu lassen, verschiebt oder kopiert das Objekt in diesen Ordner.

source: You can also set up &konqueror; to show more than one folder within its window and drag &amp; drop between them.
de: Sie können &konqueror; auch so einstellen, dass er in seinem Fenster mehrere Ordner anzeigt und dann zwischen diesen Ordnern Ziehen-und-Ablegen-Operationen ausführen.

source: Split Views for Drag &amp; Drop
de: Darstellung mehrerer Ordner für Ziehen-und-Ablegen-Operationen

source: This screenshot illustrates the use of the Menubar <menuchoice><guimenu>Window</guimenu> <guimenuitem>Split View Left/Right</guimenuitem></menuchoice> option, also available with the shortcut <keycombo action="simul">&Ctrl;&Shift;<keycap>L</keycap></keycombo>, to split the main &konqueror; window into two views, each showing the contents of a different folder.
de: Um für dieses Bildschirmfoto das &konqueror;-Hauptfenster in zwei Teilfenster zu teilen, wobei jedes Fenster einen anderen Ordner anzeigt, wurde die Option <menuchoice><guimenu>Fenster</guimenu> <guimenuitem>Ansicht in linke und rechte Hälfte teilen</guimenuitem></menuchoice> aus der Menüleiste ausgewählt. Denselben Effekt erzielen Sie mit der Tastenkombination <keycombo action="simul">&Ctrl;&Shift;<keycap>L</keycap></keycombo>.

source: To be able to show different folders in each view they should not be linked; the little boxes at the bottom right of each view should be empty.
de: Wenn in mehreren Teilfenstern verschiedene Ordner dargestellt werden sollen, dürfen die jeweiligen Teilfenster nicht miteinander verknüpft sein (die kleinen Kästchen am rechten unteren Rand müssen leer sein).

source: The <quote>active</quote> view, that is the one whose path is shown in the Location Toolbar and which responds to navigation and Menubar commands, is shown by the little green light in the bottom left corner. To make a view active, <mousebutton>left</mousebutton> click on an empty area of the view or on its Status Bar.
de: Die <quote>aktive</quote> Ansicht, also diejenige, deren Pfad in der Adressleiste angezeigt wird und die auf Navigations- und Menübefehle reagiert, wird durch einen kleinen grünen Punkt in der unteren linken Ecke kenntlich gemacht. Um eine Ansicht zu aktivieren, brauchen Sie nur mit der <mousebutton>linken</mousebutton> Maustaste auf einen freien Bereich in der Ansicht oder auf ihre Statusleiste klicken.

source: To remove an active view from &konqueror;'s window use the <keycombo action="simul">&Ctrl;&Shift;<keycap>W</keycap></keycombo> shortcut, or the Menubar <menuchoice><guimenu>Window</guimenu><guimenuitem>Close Active View</guimenuitem></menuchoice> option, or &RMB; click on the Status Bar and choose the <guimenuitem>Close View</guimenuitem> option from the resulting menu.
de: Um die aktive Ansicht aus dem &konqueror;-Fenster zu entfernen, müssen Sie folgendes tun: die Tastenkombination <keycombo action="simul">&Ctrl;&Shift;<keycap>W</keycap></keycombo> drücken oder aus der Menüleiste <menuchoice><guimenu>Fenster</guimenu> <guimenuitem>Aktive Ansicht schließen</guimenuitem></menuchoice> aufrufen oder mit der rechten Maustaste auf die Statusleiste klicken und <guimenuitem>Ansicht schließen</guimenuitem> aus dem Kontextmenü auswählen.

source: If you use &konqueror; tabs, you can drag and drop between tabs by dragging the file to the tab label, without letting go yet. The destination tab will pop to the front, allowing you to continue dragging and then to drop the file.
de: Wenn Sie mit den Unterfenstern von &konqueror; arbeiten, können Sie zwischen diesen Ziehen-und-Ablegen-Operationen ausführen, indem Sie die Datei auf den Unterfenster-Reiter ziehen, jedoch ohne bereits loszulassen. Das Ziel-Unterfenster stellt sich automatisch in den Vordergrund, sodass Sie das Ziehen der Datei fortsetzen können und sie am gewünschten Ort fallenlassen können.

source: Duplicate File or Folder Names
de: Doppelte Datei- oder Ordnernamen

source: If you try to paste a file or folder into a folder that already contains an item with the same name, &konqueror; will pop up a dialog box warning you that the item already exists. You can then choose to:
de: Wenn Sie eine Datei oder einen Ordner in einen Ordner einfügen möchten, in dem bereits ein Objekt mit demselben Namen existiert, wird &konqueror; Sie mit einem Dialogfenster warnen, dass dieses Objekt bereits existiert. Sie können dann im Dialogfenster unter folgenden Möglichkeiten wählen:

source: Cancel the paste operation by pressing the <guibutton>Cancel</guibutton> button.
de: Die Einfügeoperation abbrechen, indem Sie den Knopf <guibutton>Abbrechen</guibutton> drücken.

source: Give the item that is being copied a different name. You can do this by typing a new name into the text entry box or get &konqueror; to <guibutton>Suggest New Name</guibutton>. When you have done this press the <guibutton>Continue</guibutton> button.
de: Dem Objekt, das kopiert wird, einen neuen Namen geben. Dazu geben Sie einen neuen Namen in das Texteingabefeld ein oder lassen Sie sich von &konqueror; einen <guibutton>Neuen Namen vorschlagen</guibutton>. Dann drücken Sie den Knopf <guibutton>Fortsetzen</guibutton>.

source: If you have copied multiple items, <guibutton>Skip</guibutton> the current item.
de: Kopieren oder Verschieben Sie mehrere Objekte, können Sie auch das aktuelle Objekt <guibutton>Überspringen</guibutton>.

source: The <guibutton>Apply to All</guibutton> button can be used if you have copied multiple items.
de: Den Knopf <guibutton>Bei allen anwenden</guibutton> können Sie benutzen, wenn Sie mehrere Objekte kopieren oder verschieben.

source: Selecting Items in the View
de: Objekte in der Ansicht auswählen

source: There are several ways to select items in the view. Once a group of items is selected, all actions, such as <menuchoice><guimenuitem>Cut</guimenuitem></menuchoice>, <menuchoice><guimenuitem>Copy</guimenuitem></menuchoice>, <menuchoice><guimenuitem>Move to Trash</guimenuitem></menuchoice>, and drag and drop operations, affect all selected items.
de: Es gibt mehrere Möglichkeiten, Objekte in der Ordneransicht auszuwählen. Wenn mehrere Objekte gleichzeitig ausgewählt sind, werden alle Operationen, wie <menuchoice><guimenuitem>Ausschneiden</guimenuitem></menuchoice>, <menuchoice><guimenuitem>Kopieren</guimenuitem></menuchoice>, <menuchoice><guimenuitem>In den Papierkorb werfen</guimenuitem></menuchoice> und Ziehen mit der Maus auf alle ausgewählten Objekte angewendet.

source: Selecting Items Using the Mouse
de: Objekte mit der Maus auswählen

source: You can press the &LMB; somewhere in the view and draw a rectangle around a group of items before releasing the button. This will select all items in the rectangle and clear the previous selection. If the &Shift; key is pressed during the selection process, the previous selection is kept.
de: Sie können irgendwo in der Ordneransicht die &LMB; drücken und ein Rechteck um mehrere Objekte ziehen, bevor Sie die Taste loslassen. Dadurch wird die vorherige Auswahl aufgehoben und alle Objekte innerhalb des Rechtecks werden ausgewählt. Wenn die &Shift;-Taste während dem Auswählen gedrückt ist, werden die neu ausgewählten Objekte zur vorherigen Auswahl hinzugefügt.

source: If the &Ctrl; key is pressed while an item is clicked with the &LMB;, the selection state of this item is toggled. If the &Ctrl; key is pressed while a rectangle is drawn around a group of items as described above, the selection state of all items in the rectangle will be toggled.
de: Wenn die &Ctrl;-Taste gedrückt ist, während Sie ein Objekt mit der &LMBn; anklicken, wird der Auswahlstatus dieses Objekts umgekehrt. Wenn die &Ctrl;-Taste gedrückt ist, während Sie, wie oben beschrieben, ein Rechteck um mehrere Objekte ziehen, wird der Auswahlstatus aller Objekte innerhalb des Rechtecks umgekehrt.

source: If the &Shift; key is pressed while an item is clicked with the &LMB;, all items between the previous current item and the clicked item will be selected.
de: Wenn die &Shift;-Taste gedrückt ist, während Sie ein Objekt mit der &LMBn; anklicken, werden alle Objekte zwischen dem zuletzt ausgewählten und dem angeklickten Objekt ausgewählt.

source: If <guilabel>Show selection marker</guilabel> is enabled in the <guilabel>Behavior</guilabel> tab of the <menuchoice><guimenu>File Management</guimenu> <guimenuitem>General</guimenuitem></menuchoice> section of the settings, a small <guiicon>+</guiicon> or <guiicon>-</guiicon> button appears in the top left corner of the item which is currently hovered over with the mouse. Clicking this sign selects or deselects the item, respectively.
de: Wenn <guilabel>Auswahl-Umschalter anzeigen</guilabel> auf der Karteikarte <quote>Verhalten</quote> der Seite <menuchoice><guimenu>Dateiverwaltung</guimenu> <guimenuitem>Allgemein</guimenuitem></menuchoice> des Einrichtungsdialogs aktiviert ist, erscheint ein kleiner <guiicon>+</guiicon>- oder <guiicon>-</guiicon>-Knopf in der linken oberen Ecke des Objekts, das gerade mit der Maus überfahren wird. Durch einen Klick auf diese Knöpfe kann das Objekt aus- oder abgewählt werden.

source: Selecting Items Using the Keyboard
de: Objekte mit der Tastatur auswählen

source: If an arrow key, <keycap>Page Up</keycap>, <keycap>Page Down</keycap>, <keycap>Home</keycap>, or <keycap>End</keycap> is pressed, the new current item is selected, and the previous selection is cleared.
de: Wenn eine der Pfeiltasten, <keycap>Bild auf</keycap>, <keycap>Bild ab</keycap>, <keycap>Pos1</keycap> oder <keycap>Ende</keycap> gedrückt wird, wird das dadurch erreichte Objekt ausgewählt und die vorherige Auswahl aufgehoben.

source: If the &Ctrl; key is held while one of the above keys is pressed, the selection remains unchanged.
de: Wenn die &Ctrl;-Taste gedrückt ist, während eine der oben genannten Tasten gedrückt wird, bleibt die Auswahl unverändert.

source: If the &Shift; key is held while one of the above keys is pressed, all items between the previous current item and the new current item will be selected.
de: Wenn die &Ctrl;-Taste gedrückt ist, während eine der oben genannten Tasten gedrückt wird, werden alle Objekte zwischen dem aktuellen Objekt und dem dadurch erreichten Objekt ausgewählt.

source: If <keycombo action="simul">&Ctrl;<keysym>Space</keysym></keycombo> is pressed, the selection state of the current item is toggled.
de: Mit der Tastenkombination <keycombo action="simul">&Ctrl;<keysym>Leertaste</keysym></keycombo> wird der Auswahlstatus des aktuellen Objekts umgekehrt.

source: <keycombo action="simul">&Ctrl;<keycap>A</keycap></keycombo> selects all items in the view.
de: <keycombo action="simul">&Ctrl;<keycap>A</keycap></keycombo> wählt alle Objekte in der Ansicht aus.

source: <keycombo action="simul">&Ctrl;&Shift;<keycap>A</keycap></keycombo> toggles the selection state of all items in the view.
de: <keycombo action="simul">&Ctrl;&Shift;<keycap>A</keycap></keycombo> schaltet den Auswahlstatus aller Objekte in der Ansicht um.

source: Select a file or folder by typing the first few letters of its name and the first matching item is selected. To clear the selection and cancel the keyboard search press &Esc; or wait longer than the timeout of 1 second.
de: Wählen Sie eine Datei oder einen Ordner, indem Sie die ersten Buchstaben des Namens eingeben. Dann wird das erste passende Element ausgewählt. Um die Auswahl zu löschen und die Suche über die Tastatur abzubrechen, drücken Sie die Taste &Esc; oder warten Sie länger als eine Sekunde.

source: Selecting Items Using the Menu
de: Objekte mit dem Menü auswählen

source: You sometimes want to delete, copy or move a number of files that are similar in some way. For example you may wish to move all of the .png graphics files from one folder to another. &konqueror; makes this easy by letting you select multiple files based on similarities in their file names.
de: Ab und zu wollen Sie vielleicht mehrere Dateien auswählen, die verschiedene Gemeinsamkeiten haben. Ein Beispiel hierfür wäre das Verschieben aller .png-Grafikdateien aus einem Ordner in einen anderen. &konqueror; stellt dafür einen einfachen Mechanismus zur Verfügung: er lässt Sie mehrere Dateien auf Grund von Gemeinsamkeiten im Dateinamen auswählen.

source: Use the Menubar <menuchoice><guimenu>Edit</guimenu><guisubmenu>Selection</guisubmenu> <guimenuitem>Select Matching Items...</guimenuitem></menuchoice> option or the shortcut <keycombo action="simul">&Ctrl;<keycap>S</keycap></keycombo>. This brings up a little dialog box in which you enter a filename containing the wildcard characters <keycap>*</keycap>, which matches any number of characters, and <keycap>?</keycap> which matches a single character. Press <guibutton>OK</guibutton> and &konqueror; will highlight all files with matching names. For example:
de: Benutzen Sie die Option <menuchoice><guimenu>Bearbeiten</guimenu> <guisubmenu>Auswahl</guisubmenu><guimenuitem>Passende Elemente auswählen ...</guimenuitem></menuchoice> aus der Menüleiste oder das Tastenkürzel <keycombo action="simul">&Ctrl;<keycap>S</keycap></keycombo>. Dies öffnet ein kleines Dialogfenster, in dem Sie einen Dateinamen eingeben können. Dabei stehen Ihnen die Platzhalter <keycap>*</keycap>, der für eine beliebige Anzahl von Buchstaben steht, und <keycap>?</keycap>, für einen einzelnen Buchstaben, zur Verfügung. Ein Klick auf <guibutton>OK</guibutton> führt dazu, dass &konqueror; alle Dateien hervorhebt, die Ihren Suchkriterien entsprechen. Einige Beispiele:

source: <userinput><filename>flag*.png</filename></userinput> will select all filenames starting with the letters <quote>flag</quote> and ending with <quote><literal role="extension">.png</literal></quote>.
de: <userinput><filename>fahne*.png</filename></userinput> wählt alle Dateien aus, die mit den Buchstaben <quote>fahne</quote> beginnen und mit <quote><literal role="extension">.png</literal></quote> aufhören.

source: <userinput><filename>memo?.txt</filename></userinput> will select <filename>memo1.txt</filename> and <filename>memo9.txt</filename> but not <filename>memo99.txt</filename>.
de: <userinput><filename>memo?.txt</filename></userinput> wählt <filename>memo1.txt</filename> und <filename>memo9.txt</filename>, aber nicht <filename>memo99.txt</filename> aus.

source: When you have selected a range of files, you can narrow down the selection by using the Menubar <menuchoice><guimenu>Edit</guimenu><guisubmenu>Selection</guisubmenu> <guimenuitem>Unselect Matching Items...</guimenuitem></menuchoice> option to specify which of the selected files should be removed from the selection.
de: Wenn Sie so einen Bereich von Dateien ausgewählt haben, können Sie die Auswahl auch wieder verkleinern, indem Sie aus der Menüleiste den Eintrag <menuchoice><guimenu>Bearbeiten</guimenu> <guisubmenu>Auswahl</guisubmenu><guimenuitem>Auswahl für passende Elemente aufheben ...</guimenuitem></menuchoice> auswählen und dann angeben, welche Dateien aus der Auswahl entfernt werden sollen.

source: Use the Menubar <menuchoice><guimenu>Edit</guimenu><guisubmenu>Selection</guisubmenu> <guimenuitem>Unselect All</guimenuitem></menuchoice> option or just &LMB; click on a clear area of the view to cancel the selection.
de: Sie können auch den Eintrag <menuchoice><guimenu>Bearbeiten</guimenu> <guisubmenu>Auswahl</guisubmenu><guimenuitem>Gesamte Auswahl aufheben </guimenuitem></menuchoice> benutzen oder einfach mit der &LMBn; auf eine freie Fläche der &konqueror;-Ansicht klicken, um die Auswahl komplett aufzuheben.

source: You can even invert the selection: that is, deselect all selected files and select those that were previously unselected. Use the Menubar <menuchoice><guimenu>Edit</guimenu><guisubmenu>Selection</guisubmenu><guimenuitem>Invert Selection</guimenuitem></menuchoice> option or <keycombo action="simul">&Ctrl;&Shift;<keycap>A</keycap></keycombo> to do this.
de: Sie können eine Auswahl sogar umkehren, das heißt, dass alle Dateien, die vorher ausgewählt waren, es nun nicht mehr sind und umgekehrt. Benutzen Sie dazu den Eintrag in der Menüleiste <menuchoice><guimenu>Bearbeiten</guimenu> <guisubmenu>Auswahl</guisubmenu><guimenuitem>Auswahl umkehren</guimenuitem></menuchoice> oder drücken Sie <keycombo action="simul">&Ctrl;&Shift;<keycap>A</keycap></keycombo>.

source: Create New
de: Erstellen von neuen Objekten

source: When &konqueror; is in File Manager mode, picking <guisubmenu>Create New</guisubmenu> from the <guimenu>Edit</guimenu> menu or from the context menu you get by &RMB; clicking on a free area in a folder view gives you a submenu letting you create any of the following in the current folder:
de: Wenn sich &konqueror; im Dateiverwaltungsmodus befindet, können Sie neue Objekte ( &eg; Dateien und Ordner) erstellen. Wählen Sie dazu im Menü <guimenu>Bearbeiten</guimenu> den Eintrag <guisubmenu>Neu erstellen</guisubmenu> oder öffnen Sie das Kontextmenü der Ordneransicht mit einem Rechtsklick in einen freien Bereich &mdash; dort finden Sie ebenfalls die Option <guisubmenu>Neu erstellen</guisubmenu>. Sie können folgende Objekte erstellen:

source: Folder...
de: Ordner ...

source: An easy way of creating a new (sub)folder.
de: Dies ist eine einfache Möglichkeit, einen neuen (Unter)ordner zu erstellen.

source: Text File...
de: Textdatei ...

source: Use this to create an ordinary, empty, text file. A dialog box will be opened for you to enter the name of your new file.
de: Mit dieser Option erstellen Sie eine gewöhnliche, leere Textdatei. Es wird ein Dialogfenster geöffnet, in dem Sie den Namen der neuen Textdatei eingeben können.

source: HTML File...
de: HTML-Datei...
