Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/applications/konqueror.po
Languages: de

source: Depending on the file type, additionally, sorting criteria can be selected:
de: Abhängig vom Dateityp können zusätzliche Sortierkriterien ausgewählt werden:

source: <guimenuitem>Document</guimenuitem>: Number of words and lines
de: <guimenuitem>Dokument</guimenuitem>: Anzahl der Wörter und Zeilen

source: <guimenuitem>Image</guimenuitem>: Size and orientation
de: <guimenuitem>Bild</guimenuitem>: Größe und Ausrichtung

source: <guimenuitem>Audio</guimenuitem>: Artist, album, duration and track
de: <guimenuitem>Audio</guimenuitem>: Interpret, Album, Dauer und Stück

source: The <guisubmenu>Other</guisubmenu> submenu allows to select <guimenuitem>Path</guimenuitem>, <guimenuitem>Link Destination</guimenuitem>, <guimenuitem>Copied From</guimenuitem>, <guimenuitem>Permissions</guimenuitem>, <guimenuitem>Owner</guimenuitem> or <guimenuitem>User Group</guimenuitem>.
de: Im Untermenü <guisubmenu>Weitere</guisubmenu> finden Sie <guimenuitem>Pfad</guimenuitem>, <guimenuitem>Verknüpfungsziel</guimenuitem>, <guimenuitem>Kopiert von</guimenuitem>, <guimenuitem>Berechtigungen</guimenuitem>, <guimenuitem>Eigentümer</guimenuitem> oder <guimenuitem>Benutzergruppe</guimenuitem>.

source: Folder View Properties
de: Eigenschaften der Ordneransicht

source: The following settings control how the contents of a folder are displayed in the &kappname; view, and are stored on a per-folder basis by default:
de: Die folgenden Einstellungen legen fest, wie die Inhalte von Ordnern in der Ordneransicht angezeigt werden; Sie werden standardmäßig für jeden Ordner getrennt gespeichert:

source: The view mode (Icons, Compact, Details)
de: Der Ansichtsmodus (Symbole, Kompakt, Details)

source: The sorting of items, which is determined by the sort order (ascending, descending) and the attribute (such as name, size,...) that the items are sorted by
de: Die Sortierung von Elementen, die die durch die Sortierreihenfolge (aufsteigend, absteigend) und die Eigenschaften (Name, Größe, ...), nach denen Elemente sortiert werden, festlegt wird.

source: Sorting of folders and files &ndash; are folders shown first or not?
de: Die Sortierung von Dateien und Ordnern &ndash; Sollen Ordner zuerst angezeigt werden?

source: Previews &ndash; are they shown instead of icons (based on the settings made in <guilabel>Previews</guilabel> tab of &kappname;'s General settings) or not?
de: Vorschauen &ndash; Sollen Vorschaubilder anstelle von Symbolen (entsprechend den Einstellungen in der Karteikarte <guilabel>Vorschauen</guilabel> der allgemeinen Einstellungen von &kappname;) angezeigt werden?

source: Are items shown in groups in the views?
de: Sollen Elemente in den Ansichten gruppiert werden?

source: Are hidden files shown?
de: Sollen versteckte Dateien und Ordner angezeigt werden?

source: What additional information (besides the name) is shown in the Icons or Details view?
de: Welche zusätzlichen Informationen (neben dem Namen) sollen in der Symbol- und Detail-Ansicht angezeigt werden?

source: The view properties can be configured in the <menuchoice><guimenu>View</guimenu></menuchoice> menu, some (such as the view mode) can also be changed using toolbar buttons.
de: Die Ansichts-Einstellungen können im Menü <menuchoice><guimenu>Ansicht</guimenu></menuchoice> angepasst werden. Einige, wie der Ansichtsmodus, können auch über Knöpfe in der Werkzeugleiste geändert werden.

source: The View Properties Dialog
de: Der Dialog Ansichts-Eigenschaften

source: Screenshot of the View Properties dialog
de: Bildschirmfoto des Dialog Ansichts-Eigenschaften

source: The View Properties dialog.
de: Der Dialog Ansichts-Eigenschaften.

source: The View Properties Dialog.
de: Der Dialog Ansichts-Eigenschaften.

source: The <guilabel>View Properties</guilabel> dialog can be used to quickly modify several view properties at once. This is done for the current folder, for the current folder including all subfolders, or even for all folders, depending on the choice made in the <guilabel>Apply View Properties To</guilabel> section.
de: Der Dialog <guilabel>Ansichts-Eigenschaften</guilabel> kann verwendet werden, um schnell mehrere Ansichts-Einstellungen gleichzeitig zu ändern. Diese Einstellungen werden entweder auf den aktuellen Ordner, den aktuellen Ordner und seine Unterordner oder auf alle Ordner angewendet, entsprechend Ihrer Auswahl im Bereich <guilabel>Ansichtsmodus festlegen für</guilabel>.

source: If <guilabel>Use these view properties as default</guilabel> is enabled, the chosen view properties will also be used for all folders which do not have customized view properties yet.
de: Wenn <guilabel>Diese Ansicht-Eigenschaft als Standard verwenden</guilabel> aktiviert ist, werden die Einstellungen auch für alle Ordner benutzt, für die noch keine eigenen Einstellungen ausgewählt wurden.

source: To get to a file with &konqueror; you first need to navigate through the folder tree to find the folder containing that file.
de: Um mit &konqueror; eine gewünschte Datei aufzusuchen, müssen Sie zuerst im Ordnerbaum bis zu dem Ordner ab- bzw aufsteigen, in dem diese Datei enthalten ist.

source: To move between folders you can simply step up and down the tree:
de: Um zwischen Ordnern zu wechseln, brauchen Sie sich nur auf dem Ordnerbaum nach oben oder unten zu bewegen:

source: To descend into a subfolder <mousebutton>left </mousebutton> click on its name or icon -- or if you have already <quote>selected</quote> it (see below) -- then just press &Enter;.
de: Um in einen Unterordner zu wechseln, klicken Sie mit der &LMBn; auf den Namen oder das Symbol dieses Ordners im &konqueror;-Fenster. Alternativ, wenn Sie ihn bereits <quote>ausgewählt</quote> haben (siehe unten), drücken Sie einfach die Taste &Enter;.

source: To go up the folder tree you can click on the <guiicon>Up</guiicon> button in the Toolbar, use<keycombo action="simul">&Alt;<keysym>Up</keysym></keycombo>, or use the Menubar <menuchoice><guimenu>Go</guimenu><guimenuitem>Up</guimenuitem></menuchoice> option.
de: Um in den übergeordneten Ordner zu wechseln, klicken Sie mit der linken Maustaste auf den Knopf <guiicon>Aufwärts</guiicon> in der Werkzeugleiste oder Sie drücken <keycombo action="simul">&Alt;<keysym>Pfeil hoch</keysym></keycombo>, oder Sie benutzen in der Menüleiste die Funktion <menuchoice><guimenu>Gehe zu</guimenu><guimenuitem>Aufwärts</guimenuitem></menuchoice>.

source: To <quote>select</quote> a file or folder in the displayed folder without opening it in any way use the <keysym>up</keysym> and <keysym>down </keysym> arrow keys to move through the items. The selected item will be highlighted and some information about it will be displayed in the Status Bar.
de: Sie können eine Datei oder einen Unterordner mit den Pfeiltasten <quote>auswählen</quote>, ohne das Objekt gleichzeitig zu öffnen. Das Aussehen der ausgewählten Datei oder des Ordners ändert sich dann, und in der Statusleiste werden einige Informationen zu dem Objekt angezeigt.

source: Setting the <link linkend="viewmode">View Mode</link> to <guimenuitem> Details</guimenuitem> can help you locate folders in the tree below the current folder; in this mode each folder is shown with a small box at the left. If the box contains a <keycap>&gt;</keycap> sign, <mousebutton>left </mousebutton> clicking on the box (not on the folder name or icon) will display a sub tree showing files and subfolders contained in that folder. The small box will then change to show a <keycap>v</keycap> sign. <mousebutton>Left</mousebutton> click on that to collapse the sub tree. Once you have found the folder you are looking for, <mousebutton>left </mousebutton> click on the folder name or icon to open it.
de: Das Setzen des <link linkend="viewmode">Anzeige-Modus</link> auf <guimenuitem>Details</guimenuitem> kann Ihnen dabei helfen, Ordner unterhalb des aktuellen Ordners aufzufinden. In diesem Anzeige-Modus wird jeder Ordner mit einem kleinen Kästchen auf der linken Seite angezeigt. Wenn das Kästchen ein <keycap>&gt;</keycap>-Zeichen enthält, werden nach einem <mousebutton>Links</mousebutton>klick auf das Kästchen (nicht auf den Ordnernamen oder das Symbol) die Dateien und Unterordner, die in dem Ordner enthalten sind, angezeigt. Im kleinen Kästchen wird dann ein <keycap>v</keycap>-Zeichen angezeigt. Ein erneuter <mousebutton>Links</mousebutton>klick auf das Kästchen blendet die Baumansicht wieder aus. Sobald Sie den Ordner, den Sie gesucht haben, gefunden haben, können Sie ihn mit einem <mousebutton>Links</mousebutton>klick öffnen.

source: The <link linkend="sidebar">Sidebar</link> can also help you find your way around the file system.
de: Auch der <link linkend="sidebar">Navigationsbereich</link> kann Ihnen dabei helfen, sich in Ihrem Dateisystem zurechtzufinden.

source: You can go directly to any folder by switching with <menuchoice><guimenu>File</guimenu><guimenuitem>Open Location</guimenuitem> </menuchoice> or <keycombo action="simul">&Alt;<keycap>O</keycap> </keycombo> to the Location Bar and typing its path. &konqueror;'s <link linkend="path-complete"> Text Completion</link> feature may be useful when you do this. Don't forget that in &Linux; / &UNIX; file and folder names are case sensitive.
de: Sie können direkt zu einem Ordner springen, indem Sie den Menüeintrag <menuchoice><guimenu>Datei</guimenu><guimenuitem>Adresse aufrufen</guimenuitem></menuchoice> auswählen oder den Kurzbefehl <keycombo action="simul">&Ctrl;<keycap>O</keycap></keycombo> drücken und dann den Pfad eingeben. &konqueror;s Funktion für die <link linkend="path-complete"> Textvervollständigung</link> kann Ihnen hierbei helfen. Vergessen Sie nicht, dass in &Linux;/&UNIX; bei Ordner- und Dateinamen zwischen Groß- und Kleinschreibung unterschieden wird.

source: When you have moved to a new folder you can go back to your previous choice by using the Toolbar <guiicon>Back</guiicon> button, the Menubar <menuchoice><guimenu>Go</guimenu> <guimenuitem>Back</guimenuitem></menuchoice> item, or <keycombo action="simul">&Alt;<keysym>Left</keysym></keycombo>. Once you have gone back you can go forward. Use the Toolbar <guiicon>Forward</guiicon> button, the Menubar <menuchoice><guimenu>Go</guimenu> <guimenuitem>Forward</guimenuitem></menuchoice> item or <keycombo action="simul">&Alt;<keysym>Right</keysym></keycombo>.
de: Sobald Sie einmal in einen neuen Ordner gewechselt sind, können Sie zum vorherigen Ordner zurückkehren, indem Sie entweder auf <guiicon>Zurück</guiicon> klicken, in der Menüleiste <menuchoice><guimenu>Gehe zu</guimenu> <guimenuitem>Zurück</guimenuitem></menuchoice> auswählen oder <keycombo action="simul">&Alt; <keysym>Pfeil links</keysym></keycombo> drücken. Nachdem sie zurückgegangen sind können Sie wieder vorwärts gehen. Benutzen Sie in der Werkzeugleiste das Symbol <guiicon>Nach vorne</guiicon>, in der Menüleiste den Eintrag <menuchoice><guimenu>Gehe zu</guimenu> <guimenuitem>Nach vorne</guimenuitem></menuchoice> oder drücken Sie <keycombo action="simul">&Alt;<keysym>Pfeil rechts</keysym></keycombo>.

source: Alternatively, you can also choose to enter the parent folder by clicking on the Toolbar <guiicon>Up</guiicon>, the <menuchoice><guimenu>Go</guimenu> <guimenuitem>Up</guimenuitem></menuchoice> item, or with <keycombo action="simul">&Alt;<keysym>Up</keysym></keycombo>.
de: Alternativ können Sie auch in den übergeordneten Ordner wechseln, indem Sie in der Werkzeugleiste auf <guiicon>Aufwärts</guiicon> klicken, in der Menüleiste <menuchoice><guimenu>Gehe zu</guimenu> <guimenuitem>Aufwärts</guimenuitem></menuchoice> auswählen oder <keycombo action="simul">&Alt;<keysym>Pfeil hoch</keysym></keycombo> drücken.

source: Click the checkmark at the right of the toolbar <guiicon>Up</guiicon>, <guiicon>Back</guiicon> or <guiicon>Forward</guiicon> buttons or selecting these items in the <guimenu>Go</guimenu> menu brings up a submenu of recently visited locations.
de: Klicken Sie auf das Häkchen rechts neben den Knöpfen <guiicon>Aufwärts</guiicon>, <guiicon>Zurück</guiicon> oder <guiicon>Nach vorne</guiicon> in der Werkzeugleiste, erscheint ein Menü mit kürzlich besuchten Ordnern.

source: Finding Files and Folders
de: Suchen von Dateien und Ordnern

source: If you don't know or can't remember where a file or folder is within your system, then use the shortcut <keycombo action="simul">&Ctrl;<keycap>F</keycap></keycombo> or the Menubar <menuchoice><guimenu>Tools</guimenu><guimenuitem>Find File...</guimenuitem></menuchoice> option. This starts the file finder application &kfind;. See the <ulink url="help:/kfind/index.html">&kfind; Handbook</ulink> for help in using &kfind;.
de: Wenn Sie einmal nicht ganz sicher sind, wo sich eine Datei oder ein Ordner in Ihrem System befindet, dann können Sie den Kurzbefehl <keycombo action="simul">&Ctrl;<keycap>F</keycap></keycombo> oder aus dem Menü <menuchoice><guimenu>Extras</guimenu><guimenuitem>Datei suchen ...</guimenuitem></menuchoice> benutzen. Dies startet das Programm &kfind;. Weitere Hilfe zu &kfind; finden Sie im <ulink url="help:/kfind/index.html">Benutzerhandbuch zu &kfind;</ulink>.

source: If the name of a file or folder begins with a period (dot), then it is a <quote>hidden</quote> file or folder, and will not normally be shown by &konqueror;. To see hidden files or folders use the Menubar <menuchoice> <guimenu>View</guimenu><guimenuitem>Show Hidden Files</guimenuitem> </menuchoice> option.
de: Wenn der Name einer Datei oder eines Ordners mit einem Punkt (.) beginnt, dann handelt es sich um eine <quote>versteckte</quote> Datei oder einen <quote>versteckten</quote> Ordner, die normalerweise von &konqueror; nicht angezeigt werden. Um diese versteckten Dateien bzw. Ordner anzuzeigen, wählen Sie im Menü die Option <menuchoice> <guimenu>Ansicht</guimenu><guimenuitem>Versteckte Dateien anzeigen</guimenuitem> </menuchoice>.

source: Another reason &konqueror; may not show the file or folder you are looking for is that you may have the <link linkend="konq-plugin"><guisubmenu> View Filter</guisubmenu></link> plugin set to display only certain types of file.
de: Eine andere Ursache, dass &konqueror; nicht die von Ihnen gesuchte Datei oder den gesuchten Ordner anzeigt, ist möglicherweise, dass Sie die Einstellungen für das Modul <link linkend="konq-plugin"><guisubmenu> Ansichtsfilter</guisubmenu></link> so gewählt haben, dass nur bestimmte Dateitypen angezeigt werden.

source: Removable Devices
de: Wechselmedien

source: Any removable device (USB stick, floppy disk, &CD; drive or other hard disk partition that you have on your system) will usually appear in the <filename class="directory">/ </filename>, <filename class="directory">/media</filename>, <filename class="directory">/mnt</filename> or <filename class="directory">/auto</filename> folder, having a path something like <filename class="directory">/mnt/floppy</filename> or <filename class="directory">/cdrom</filename>. The details will depend on how your system was set up.
de: Jedes Wechselmedium wie USB-Sticks, Disketten- oder &CD;-Laufwerk bzw. jede andere Festplattenpartition, die in Ihrem System existiert, wird gewöhnlich im Ordner <filename class="directory">/ </filename>, <filename class="directory">/media</filename>, <filename class="directory">/mnt</filename> oder <filename class="directory">/auto</filename> angezeigt, mit einem Pfad wie <filename class="directory">/mnt/floppy</filename> oder <filename class="directory">/cdrom</filename>. Die Details hängen jedoch von der Einrichtung Ihres Systems ab.

source: &UNIX; / &Linux; requires that you <command>mount</command> a removable device when you have inserted it into the drive, and <command>mount </command> other hard disk partitions when you want to access them. You also need to unmount a removable device before removing it to register that it is no longer available.
de: Unter &UNIX; / &Linux; müssen Sie Wechselmedien in das Dateisystem einbinden (<quote><command>mount</command>en</quote>), nachdem sie in das Laufwerk eingelegt wurden, damit Sie auf deren Inhalt zugreifen können. Sie müssen diese Einbindung auch wieder lösen (<quote>unmounten</quote>), bevor Sie die Diskette wieder aus dem Laufwerk entfernen, damit &Linux; das Wechselmedium als nicht mehr verfügbar erkennt.

source: How you do this will depend on your system setup:
de: Wie das vor sich geht, hängt von Einstellung Ihres Systems ab:

source: Using the <guilabel>Device Notifier</guilabel>
de: Mit der <guilabel>Geräteüberwachung</guilabel>

source: In a &kde; session the <ulink url="help:/plasma-desktop/index.html#device-notifier">Device Notifier</ulink> window will popup, when you insert a removable device and allows you to select an appropriate application for this media or only mount the device.
de: In einer &kde;-Sitzung erscheint das Fenster <ulink url="help:/plasma-desktop/index.html#device-notifier">Geräteüberwachung</ulink>, wenn Sie ein Wechselmedium anschließen. In diesem Fenster können Sie eine passendes Programm zum Öffnen dieses Mediums auswählen oder das Gerät nur einbinden.

source: If you use the <guilabel>Folder View</guilabel> layout for your desktop you may have icons for removable devices on your desktop, in which case &LMB; click on the icon to mount it. Doing this should also bring up a &konqueror; window showing the contents of the device. To unmount, <mousebutton>right</mousebutton> click on the icon and choose the <guimenuitem>Unmount</guimenuitem> item. Visit the section <link linkend="making">Create New...</link> in this Handbook to see how to create such an icon.
de: Wenn Sie die <guilabel>Ordner-Ansicht</guilabel> für Ihre Arbeitsfläche benutzen, dann können Symbole für Wechselmedien auf Ihrer Arbeitsfläche angezeigt werden. Klicken Sie dann mit der &LMBn; auf das Symbol, um das Medium in das Dateisystem einzubinden. Hierdurch wird auch ein &konqueror;-Fenster geöffnet, das den Inhalt des jeweiligen Mediums anzeigt. Um die Laufwerkseinbindung wieder zu lösen, klicken Sie mit der &RMBn; auf das Symbol und wählen aus dem Kontextmenü den Befehl <guimenuitem>Laufwerkseinbindung lösen</guimenuitem>. Schauen Sie sich auch den Abschnitt <link linkend="making">Neu erstellen ...</link> an, um zu erfahren, wie man ein solches Symbol erstellt.

source: Or you can do it the traditional way by typing into a text console window:
de: Sie können auch den traditionellen Weg gehen: geben Sie in der Befehlszeile einer Konsole ein:

source: to mount, for example, the floppy drive, and
de: um zum Beispiel das Diskettenlaufwerk einzubinden (zu mounten) und

source: to unmount it (<command>umount</command> not <command>unmount</command>).
de: um die Einbindung wieder zu lösen (es wieder zu unmounten). (<command>umount</command>, nicht <command>unmount</command>.)

source: Rather than having to open a text console to type the <command>mount </command> or <command>umount</command> commands, you may prefer to use &konqueror;'s <menuchoice><guimenu>Tools</guimenu><guimenuitem>Execute Shell Command</guimenuitem></menuchoice> (<keycombo action="simul">&Ctrl;<keycap>E</keycap></keycombo>) feature.
de: Anstatt eine Textkonsole zu öffnen, um die Befehle <command>mount</command> oder <command>umount</command> einzugeben, können Sie auch &konqueror;s Funktion <menuchoice><guimenu>Extras</guimenu><guimenuitem>Befehl ausführen...</guimenuitem> </menuchoice> (<keycombo action="simul">&Ctrl;<keycap>E</keycap></keycombo>) benutzen.

source: Deleting Files and Folders
de: Löschen von Dateien und Ordnern

source: &konqueror; gives you two ways to dispose of an unwanted file or folder:
de: Unter &konqueror; gibt es drei Wege, um unerwünschte Dateien und Ordner zu entfernen:

source: You can move it to the <filename>Trash</filename> folder, which is the safest method as you can get it back if you realize that you have made a mistake.
de: Sie können sie in den <filename>Papierkorb</filename>-Ordner verschieben. Dies ist die sicherste Methode, denn falls Sie bemerken, dass Sie einen Fehler gemacht haben, können Sie die Datei/den Ordner wiederherstellen.

source: You can just plain Delete it, which removes the entry from the folder and adds the disk area occupied by the file(s) to the system's list of free disk areas, in the same way as the <command>rm</command> command.
de: Sie können die Datei auch einfach nur Löschen. Dadurch wird der Ordnereintrag entfernt und der Speicherplatz, den die Datei belegt hat, wird in der Systemliste für freien Speicherplatz wieder als frei markiert. Dies funktioniert ähnlich wie der Befehl <command>rm</command>.

source: If you want to use this feature check the option <guilabel>Show 'Delete' menu entries which bypass the trashcan</guilabel> on the <guilabel>File Management</guilabel> settings page.
de: Um diese Funktion zu aktivieren, wählen Sie <guilabel>„Löschen“ in Menüs anzeigen (Achtung: „Löschen“ übergeht die Papierkorb-Funktion)</guilabel> auf der Seite <guilabel>Dateiverwaltung</guilabel> des Einrichtungsdialogs.

source: The simplest way to remove a file or folder is to position the mouse pointer over its name or icon and press the &RMB;, which will bring up a menu containing the options <guimenuitem>Move to Trash</guimenuitem> and <guimenuitem>Delete</guimenuitem>.
de: Am einfachsten wird eine Datei bzw. ein Ordner entfernt, indem Sie im &konqueror;-Fenster über der zu löschenden Datei oder dem zu löschenden Ordner einen Rechtsklick ausführen. Das daraufhin erscheinende Kontextmenü enthält die Optionen <guimenuitem>In den Papierkorb werfen</guimenuitem> und <guimenuitem>Löschen</guimenuitem>.

source: Or, if you have <quote>selected</quote> the item, the Menubar <guimenu>Edit</guimenu> menu will give you the choice of <quote><guimenuitem>Move to Trash</guimenuitem></quote> and <quote><guimenuitem>Delete</guimenuitem></quote> options.
de: Alternativ können Sie, wenn Sie den Eintrag mit der Tastatur ausgewählt haben, das Menü <guimenu>Bearbeiten</guimenu> öffnen, wo Sie dann ebenfalls die Optionen <quote><guimenuitem>In den Papierkorb werfen</guimenuitem></quote> und <quote><guimenuitem>Löschen</guimenuitem></quote> vorfinden.

source: <keycap>Del</keycap> will move the selected item or items to Trash.
de: Die <keycap>Entf</keycap>-Taste wirft ausgewählte Dateien und Ordner in den Papierkorb.

source: <keycombo action="simul">&Shift;<keycap>Del</keycap></keycombo> will really, truly and irrevocably delete the selected item or items.
de: <keycombo action="simul">&Shift;<keycap>Entf</keycap></keycombo> löscht die ausgewählte Datei oder den Ordner wirklich, wahrhaftig und unwiderruflich.

source: You won't be able to remove a file or folder if you don't have the necessary permissions.
de: Sie können Dateien und Ordner nur dann löschen, wenn Sie über die dazu nötigen Rechte verfügen.

source: Moving and Copying
de: Verschieben und Kopieren

source: To copy a file or subfolder between folders you can:
de: Um eine Datei oder einen Unterordner zu kopieren, gibt es die folgenden Möglichkeiten:

source: Position the mouse pointer over its name or icon and hold down the &RMB;, which will bring up a menu containing the <guimenuitem>Copy</guimenuitem> option. Choose that.
de: Bewegen Sie im &konqueror;-Fenster die Maus auf den Namen oder das Symbol des zu kopierenden Eintrags und führen Sie einen Rechtsklick aus. Daraufhin erscheint das Kontextmenü. Es enthält den Eintrag <guimenuitem>Kopieren</guimenuitem>. Wählen Sie diesen aus.
