Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/applications/konqueror.po
Languages: de

source: In the &systemsettings; category <guilabel>Network and Connectivity</guilabel> on the <menuchoice><guimenu>Network Settings</guimenu> <guimenuitem>Connection Preferences</guimenuitem></menuchoice> page.
de: In der Kategorie <guilabel>Netzwerk und Verbindungen</guilabel> in den &systemsettings; auf der Seite <menuchoice><guimenu>Netzwerkeinstellungen</guimenu> <guimenuitem>Verbindungseinstellungen</guimenuitem></menuchoice>.

source: How do I set my <quote>home</quote> page - the page loaded on startup?
de: Wie stelle ich meine <quote>Start</quote>-Seite ein - die Seite, die nach dem Start geladen wird?

source: &konqueror; has a <guilabel>Home Folder</guilabel> used in file manager mode and a <guilabel>Home Page</guilabel> used in browser mode.
de: &konqueror; öffnet beim Start im Dateiverwaltungs-Modus den <guilabel>Persönlichen Ordner</guilabel> und im Browser-Modus eine <guilabel>Startseite</guilabel>.

source: To change these settings launch <menuchoice><guimenu>Settings</guimenu><guimenuitem>Configure Konqueror</guimenuitem><guilabel>General</guilabel></menuchoice>.
de: Um diese Einstellungen zu ändern, wählen <menuchoice><guimenu>Einstellungen</guimenu> <guimenuitem>Konqueror einrichten ...</guimenuitem><guilabel>Allgemein</guilabel></menuchoice>.

source: To set the &konqueror; startup page in filemanager mode select <guilabel>Show Introduction Page</guilabel>, <guilabel>Show My Home Page</guilabel>, <guilabel>Show Blank Page</guilabel> or <guilabel>Show My Bookmarks</guilabel> from the drop down box labeled <guilabel>When Konqueror starts</guilabel>.
de: Um die Startseite für &konqueror; im Dateiverwaltungs-Modus einzustellen. wählen Sie <guilabel>Die Einführungsseite anzeigen</guilabel>, <guilabel>Die Startseite anzeigen</guilabel>, <guilabel>Eine leere Seite anzeigen</guilabel> oder <guilabel>„Meine Lesezeichen“ anzeigen</guilabel>

source: In browser mode &konqueror; starts with the <guilabel>Home page</guilabel> entry.
de: Im Browser-Modus startet &konqueror; mit der <guilabel>Startseite</guilabel>.

source: I can't find the answer to my question here.
de: Ich finde hier keine Antwort auf meine Frage.

source: Take a look at <ulink url="http://www.konqueror.org/faq.html"> http://www.konqueror.org/faq.html</ulink> or <ulink url="http://www.konqueror.org/konq-java.html"> http://www.konqueror.org/konq-java.html</ulink>.
de: Versuchen Sie es auch unter <ulink url="http://www.konqueror.org/faq.html"> http://www.konqueror.org/faq.html</ulink> oder <ulink url="http://www.konqueror.org/konq-java.html"> http://www.konqueror.org/konq-java.html</ulink>.

source: You may find further information in the <ulink url="http://forum.kde.org/"> KDE Community Forums</ulink> or on <ulink url="http://userbase.kde.org/Konqueror"> Konqueror's KDE Userbase page</ulink>.
de: Weitere Informationen finden Sie im <ulink url="http://forum.kde.org/">Forum der KDE-Gemeinschaft</ulink> oder auf der <ulink url="http://userbase.kde.org/Konqueror">Seite Konqueror in KDE-UserBase</ulink>

source: &konqueror;. Program copyright 1999-2003, the &konqueror; developers:
de: &konqueror;. Programmcopyright 1999-2003, die &konqueror;-Entwickler:

source: developer (parts, JavaScript, I/O lib) and maintainer
de: Entwickler (Parts, JavaScript, Ein-/Ausgabe-Bibliothek) und Betreuer

source: developer (framework, parts)
de: Entwickler (Framework, Parts)

source: developer (framework)
de: Entwickler (Framework)

source: developer
de: Entwickler

source: developer (list views)
de: Entwickler (Listen-Ansichten)

source: developer (list views, I/O lib)
de: Entwickler (Listen-Ansichten, Ein-/Ausgabe-Bibliothek)

source: developer (<acronym>HTML</acronym> rendering engine)
de: Entwickler (<acronym>HTML</acronym> Rendering Engine)

source: developer (<acronym>HTML</acronym> rendering engine, JavaScript)
de: Entwickler (<acronym>HTML</acronym> Rendering Engine, JavaScript)

source: developer (<acronym>HTML</acronym> rendering engine, I/O lib)
de: Entwickler (<acronym>HTML</acronym> Rendering Engine, Ein-/Ausgabe-Bibliothek)

source: developer (I/O lib)
de: Entwickler (Ein-/Ausgabe-Bibliothek)

source: developer (<acronym>HTML</acronym> rendering engine, I/O lib, regression test framework)
de: Entwickler (<acronym>HTML</acronym> Rendering Engine, Ein-/Ausgabe-Bibliothek, Grundgerüst für Regressions-Tests)

source: developer (&Java; applet support)
de: Entwickler (Unterstützung für &Java; Miniprogramme)

source: developer (&Java;2 manager support and other major improvements to applet support)
de: Entwickler (&Java;2 Manager-Unterstützung und andere wesentliche Verbesserungen bei der Unterstützung von Miniprogrammen/Applets)

source: developer (JavaScript)
de: Entwickler (JavaScript)

source: developer (&Netscape; plugin support)
de: Entwickler (&Netscape; Plugin-Unterstützung)

source: developer (SSL support, Netscape plugins)
de: Entwickler (SSL-Unterstützung, Netscape-Module)

source: developer (I/O lib, Authentication support)
de: Entwickler (Ein-/Ausgabe-Bibliothek, Authentifizierungs-Unterstützung)

source: Graphics / icons
de: Grafik/Symbole

source: kfm author
de: Autor von kfm

source: developer (navigation panel framework)
de: Entwickler (Navigations-Bereich)

source: developer (misc stuff)
de: Entwickler (Verschiedenes)

source: JavaScript access controls, per-domain policies extensions, HTML rendering engine
de: JavaScript-Zugriffskontrollen, Domain-spezifische Regelungserweiterungen<acronym>HTML</acronym> Rendering Engine

source: Developer (HTML rendering engine)
de: Entwickler (<acronym>HTML</acronym>Darstellung)

source: Developer (HTML rendering engine, JavaScript)
de: Entwickler (HTML-Darstellung, JavaScript)

source: Apple Safari Developers
de: Apple Safari-Entwickler

source: Developer (Java applets and other embedded objects)
de: Entwickler (Java-Miniprogramme und sonstige eingebettete Objekte)

source: Developer (AdBlock filter)
de: Entwickler (Werbefilter)

source: Developer (framework)
de: Entwickler (Framework)

source: Documentation copyright 2000-2003
de: Copyright für die Dokumentation 2000-2003

source: Documentation updated for &kde; 3.2 by &Philip.Rodrigues; &Philip.Rodrigues.mail;.
de: Die Dokumentation wurde für &kde; 3.2 von &Philip.Rodrigues; &Philip.Rodrigues.mail; aktualisiert.

source: Documentation proofreading for &kde; 4.11 by David Palser <email>davidpalser179@btinternet.com</email>.
de: Korrekturlesen der Dokumentation für &kde; 4.11 von David Palser <email>davidpalser179@btinternet.com</email>.

source: CREDIT_FOR_TRANSLATORS
de: <para>Übersetzungen von:</para><itemizedlist><listitem><para>Thomas Diehl<email>thd@kde.org</email><emphasis>GUI-Übersetzung</emphasis></para></listitem><listitem><para>Stefan Winter<email>kickdown@online.de</email><emphasis>Übersetzung der Dokumentation</emphasis></para></listitem><listitem><para>Uwe Krieg<email>u.krieg@gmx.de</email><emphasis>Übersetzung der Dokumentation</emphasis></para></listitem></itemizedlist>

source: &konqueror; is part of the kdebase package which is an essential part of &kde;.
de: &konqueror; ist Teil des kdebase-Paketes, einem wesentlichen Bestandteil von &kde;.

source: For instructions on acquiring &kde; please see <ulink url="http://www.kde.org">http://www.kde.org</ulink>.
de: Wie Sie &kde; bekommen können, erfahren Sie unter <ulink url="http://www.kde.org">http://www.kde.org</ulink>

source: For further information about &konqueror; you might like to visit <ulink url="http://www.konqueror.org">http://www.konqueror.org</ulink>.
de: Weitere Informationen über &konqueror; finden Sie bei <ulink url="http://www.konqueror.org">http://www.konqueror.org</ulink>
