Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/applications/konqueror.po
Languages: de

source: To go back to the previous page use the <keycombo action="simul">&Alt;<keysym>Left</keysym></keycombo> shortcut, the <guibutton>Back</guibutton> button on the Toolbar, or the menubar <menuchoice><guimenu>Go</guimenu> <guimenuitem>Back</guimenuitem></menuchoice> option.
de: Um zur vorher besuchten Seite zurückzukehren, drücken Sie <keycombo action="simul">&Alt;<keysym>Pfeil links</keysym></keycombo>, den Knopf <guiicon>Zurück</guiicon> in der Werkzeugleiste oder benutzen den Menüeintrag <menuchoice><guimenu>Gehe zu</guimenu> <guimenuitem>Zurück</guimenuitem></menuchoice>.

source: Similarly, once you have gone back you can go forward by using <keycombo action="simul">&Alt;<keysym>Right</keysym></keycombo>, the <guibutton>Forward</guibutton> button, or the menubar <menuchoice><guimenu>Go</guimenu> <guimenuitem>Forward</guimenuitem></menuchoice> option.
de: Dementsprechend können Sie auch wieder nach vorne gehen: Mit <keycombo action="simul">&Alt;<keysym>Pfeil rechts</keysym></keycombo>, dem Knopf <guiicon>Nach vorne</guiicon>, oder mit <menuchoice><guimenu>Gehe zu</guimenu> <guimenuitem>Nach vorne</guimenuitem></menuchoice> in der Menüleiste.

source: There are multiple ways of scrolling the viewing area. One is to use the <keycap>Up Arrow</keycap> and <keycap>Down Arrow</keycap> keys. You may also use the scrollbar, your mousewheel or the <keycap>Page Up</keycap> and <keycap>Page Down</keycap> keys.
de: Es gibt mehrere Möglichkeiten, im Dokument zu blättern. Sie können den Ansichtsbereich mit den Tasten <keycap>Pfeil hoch</keycap> und <keycap>Pfeil runter</keycap> verschieben. Dazu können Sie auch die Bildlaufleisten, das Mausrad oder die Tasten <keycap>Bild auf</keycap> und <keycap>Bild ab</keycap> benutzen.

source: If you want to read a long webpage use the automatic scrolling feature of &konqueror;. Start automatic scrolling with <keycombo action="simul">&Shift;<keysym>Down Arrow</keysym></keycombo> or <keycombo action="simul">&Shift;<keysym>Up Arrow</keysym></keycombo>. Then use these keys to increase and decrease the scrolling speed. You can start or stop automatic scrolling temporarily by pressing the &Shift; key; pressing any other key deactivates this feature.
de: Möchten Sie eine lange Webseite lesen, dann können Sie das automatische Blättern in &konqueror; aktivieren. Starten Sie es mit <keycombo action="simul">&Shift;<keysym>Pfeil runter</keysym></keycombo> oder <keycombo action="simul">&Shift;<keysym>Pfeil hoch</keysym></keycombo>. Benutzen Sie dann diese Tasten, um die Geschwindigkeit des Blättern zu ändern. Mit der &Shift;-Taste können Sie das automatische Blättern vorübergehend anhalten und wieder starten. Drücken Sie auf eine beliebige andere Tasten, um diese Funktion abzuschalten.

source: Automatic scrolling works only in the view mode <guimenuitem>KHTML</guimenuitem>.
de: Automatisches Blättern funktioniert nur im Ansichtsmodus <guimenuitem>KHTML</guimenuitem>.

source: If you want to stop a download for any reason then use the &Esc; key, the Toolbar <guibutton>Stop</guibutton> button or the Menubar <menuchoice><guimenu>View</guimenu> <guimenuitem>Stop</guimenuitem></menuchoice> item.
de: Wenn Sie einen laufenden Download abbrechen wollen, können Sie dazu die Taste &Esc;, den <guiicon>Stopp</guiicon>-Knopf aus der Werkzeugleiste oder <menuchoice><guimenu>Ansicht</guimenu> <guimenuitem>Stopp</guimenuitem></menuchoice> aus der Menüleiste benutzen.

source: When you are viewing a web page with the <guilabel>HTML Toolbar</guilabel> enabled you should see two new icons in the toolbar <guiicon><inlinemediaobject><imageobject> <imagedata fileref="format-font-size-less.png" format="PNG"/> </imageobject></inlinemediaobject></guiicon> and <guiicon><inlinemediaobject><imageobject> <imagedata fileref="format-font-size-more.png" format="PNG"/> </imageobject></inlinemediaobject></guiicon>. Use these to adjust the size of the text in the page if you find it difficult to read. How well this works will depend on how the web page has been constructed.
de: Wenn Sie sich eine Internetseite anschauen, werden Sie zwei neue Symbole in der Werkzeugleiste bemerken: <guiicon><inlinemediaobject><imageobject> <imagedata fileref="format-font-size-less.png" format="PNG"/> </imageobject></inlinemediaobject></guiicon> und <guiicon><inlinemediaobject><imageobject> <imagedata fileref="format-font-size-more.png" format="PNG"/> </imageobject></inlinemediaobject></guiicon>. Falls es Ihnen schwer fällt, die Schrift auf einer Internetseite zu lesen, können Sie hiermit die Textgröße anpassen. Ob dieses Verfahren funktioniert oder nicht, hängt jedoch davon ab, wie die Web-Seite aufgebaut wurde.

source: Tabbed Browsing
de: Browsen mit Unterfenstern

source: By using this feature you can make &konqueror; load multiple web pages in the same window, and switch between them using tabbed pages. This way, you can preload a page <quote>in the background</quote> while you carry on reading another.
de: Mit Hilfe dieser Funktion können Sie in &konqueror; mehrere Web-Seiten im gleichen Fenster laden und zwischen Ihnen über die Register hin- und herschalten. So können Sie beispielsweise eine Seite <quote>im Hintergrund</quote> laden, während Sie damit fortfahren, eine andere zu lesen.

source: To use tabbed browsing, <mousebutton>right</mousebutton> click on a link and choose <guimenuitem>Open in New Tab</guimenuitem> from the drop down menu or &MMB; click. The page will be downloaded and displayed as normal, but with tabs across the top of the view, one tab for each page. &LMB; click on a tab to view that page, or you can use the shortcuts <keycombo action="simul">&Ctrl;<keycap>,</keycap></keycombo> and <keycombo action="simul">&Ctrl;<keycap>.</keycap></keycombo> to cycle through the tab pages. Alternatively, you can scroll through the tabs using the mouse <mousebutton>wheel</mousebutton> while the mouse pointer is over the tab bar (presuming that your mouse has one). Also, double-clicking over the empty tab bar space will open a new tab.
de: Um Browsen mit Unterfenstern zu benutzen, klicken Sie mit der <mousebutton>rechten</mousebutton> Maustaste auf einen Verweis und wählen dann <guimenuitem>In neuem Unterfenster öffnen</guimenuitem> aus dem Kontextmenü oder klicken mit der &MMBn;. Die Seite wird dann normal geladen, aber in einem Unterfenster angezeigt. Ein Klick mit der &LMBn; auf einen Unterfenster-Reiter zeigt die Seite an, oder Sie verwenden die Tastenkürzel <keycombo action="simul">&Ctrl;<keycap>,</keycap></keycombo> und <keycombo action="simul">&Ctrl;<keycap>.</keycap></keycombo> um zwischen den Unterfenstern hin und her zu wechseln. Sie können auch mit der Maus durch die Seiten blättern, indem Sie das <mousebutton>Mausrad</mousebutton> betätigen, wenn sich der Zeiger über einem der Reiter befindet. Wenn Sie auf einen freien Bereich neben den Unterfenster-Reitern doppelklicken, wird sich ein leeres Unterfenster öffnen.

source: Using the <guilabel>Open new tabs in the background</guilabel> option in the <guilabel>General</guilabel> page of the <guimenu>Settings</guimenu> dialog, clicking on a link downloads the page and shows a new tab for it, but the new page will not be displayed until you <mousebutton>left</mousebutton> click on the tab.
de: Ist <guimenuitem>Unterfenster im Hintergrund öffnen</guimenuitem> auf der Seite <guilabel>Allgemein</guilabel> des Einrichtungsdialogs aktiv, lädt der Klick auf eine Verknüpfung die Seite und zeigt den Karteikartenreiter für diese Seite an. Die neue Seite wird aber erst dann angezeigt, wenn Sie mit der linken Maustaste auf den Karteikartenreiter klicken.

source: If you check the <guilabel>Open links in new tab instead of in new window</guilabel> box in the <guimenuitem>General</guimenuitem> page of the <menuchoice><guimenu>Settings</guimenu><guimenuitem>Configure Konqueror... </guimenuitem></menuchoice> dialog, &MMB; clicking on a link will open it in a new tab page and if you hold the &Shift; key down while clicking the &MMB; the link will be opened in a background tab page.
de: Wenn Sie die Option <guilabel>Verknüpfung in Unterfenstern öffnen statt in eigenen Fenstern</guilabel> auf der Seite <guimenuitem>Allgemein</guimenuitem> des Dialogs <menuchoice><guimenu>Einstellungen</guimenu><guimenuitem>Konqueror einrichten ... </guimenuitem></menuchoice> ankreuzen, wird bei einem Klick mit der mittleren Maustaste auf eine Verknüpfung die entsprechende Seite in einem neuen Unterfenster geöffnet, und wenn Sie dabei gleichzeitig die &Shift;-Taste gedrückt halten, wird die Verknüpfung im Hintergrund in ein Unterfenster geladen.

source: <mousebutton>Right</mousebutton> clicking on a tab will bring up a menu with the following options:
de: Ein Rechtsklick auf einen Karteikartenreiter öffnet ein Menü mit den folgenden Optionen:

source: <guimenuitem>New Tab</guimenuitem> (<keycombo action="simul">&Ctrl;<keycap>T</keycap></keycombo>)
de: <guimenuitem>Neues Unterfenster</guimenuitem> (<keycombo action="simul">&Ctrl;<keycap>T</keycap></keycombo>)

source: This opens a new, blank, tabbed page view. You can then download a web page into it by typing the &URL; into the Location Bar or by making a selection from the Bookmark Toolbar or the <link linkend="sidebar">Sidebar</link> history page.
de: Es wird ein neues, leeres Unterfenster geöffnet. Sie können eine Webseite hineinladen, indem Sie die &URL; in die Adressleiste eingeben oder ein Lesezeichen aus der Werkzeugleiste oder dem Verlaufsspeicher des <link linkend="sidebar">Navigationsbereiches</link> auswählen.

source: <guimenuitem>Duplicate Tab</guimenuitem> (<keycombo action="simul">&Ctrl;<keycap>D</keycap></keycombo>)
de: <guimenuitem>Unterfenster duplizieren</guimenuitem> (<keycombo action="simul">&Ctrl;<keycap>D</keycap></keycombo>)

source: To create a duplicate tabbed page.
de: Es wird eine Kopie des Unterfensters geöffnet.

source: <guimenuitem>Reload Tab</guimenuitem> (<keycap>F5</keycap>)
de: <guimenuitem>Unterfenster neu laden</guimenuitem> (<keycap>F5</keycap>)

source: Reloads the content of the current tab.
de: Der Inhalt des aktuellen Unterfensters wird erneut geladen.

source: Other Tabs
de: Andere Unterfenster

source: Displays a submenu showing all other tabs. Choosing a tab from this list makes it the active tab.
de: Zeigt ein Untermenü mit allen Unterfenstern an. Die Auswahl eines Unterfensters aus dieser Liste macht es zum aktuellen Unterfenster.

source: <menuchoice><guisubmenu>Other Tabs</guisubmenu><guimenuitem>Reload All Tabs</guimenuitem></menuchoice> (<keycombo action="simul">&Shift;<keycap>F5</keycap></keycombo>)
de: <menuchoice><guisubmenu>Andere Unterfenster</guisubmenu><guimenuitem>Alle Unterfenster neu laden</guimenuitem></menuchoice> (<keycombo action="simul">&Shift;<keycap>F5</keycap></keycombo>)

source: Reloads the content of every tab.
de: Den Inhalt aller Unterfenster erneut laden.

source: <guisubmenu>Other Tabs</guisubmenu><guimenuitem>Close Other Tabs</guimenuitem>
de: <guisubmenu>Andere Unterfenster</guisubmenu><guimenuitem>Andere Unterfenster schließen</guimenuitem>

source: To close all but the selected tab page.
de: Alle Unterfenster, mit Ausnahme des ausgewählten, werden geschlossen.

source: <guimenuitem>Detach Tab</guimenuitem> (<keycombo action="simul">&Ctrl;&Shift;<keycap>B</keycap></keycombo>)
de: <guimenuitem>Unterfenster verselbständigen</guimenuitem> (<keycombo action="simul">&Ctrl;&Shift;<keycap>B</keycap></keycombo>)

source: This option removes the selected tabbed page from the current &konqueror; window and opens it in a new instance of &konqueror;.
de: Diese Option entfernt das Unterfenster und öffnet die Seite stattdessen in einem eigenen &konqueror;-Fenster.

source: <guimenuitem>Close Tab</guimenuitem> (<keycombo action="simul">&Ctrl;<keycap>W</keycap></keycombo>)
de: <guimenuitem>Unterfenster schließen</guimenuitem> (<keycombo action="simul">&Ctrl;<keycap>W</keycap></keycombo>)

source: To close the selected tab page.
de: Das ausgewählte Unterfenster mit seinem Inhalt wird geschlossen.

source: Web Shortcuts
de: Web-Kürzel

source: If enabled, &konqueror;'s Web Shortcuts feature lets you submit a query directly to a search engine or similar web site without having to visit the site first.
de: Wenn aktiviert, können Sie mit &konqueror;s Web-Kürzeln unmittelbar Anfragen an eine Suchmaschine oder eine ähnliche Website absetzen, ohne hierzu vorher die Seite besuchen zu müssen.

source: For example, entering <userinput>gg:konqueror</userinput> into the Location Bar and pressing &Enter; will ask <trademark>Google</trademark> to search for items related to &konqueror;.
de: Durch die Eingabe von <userinput>gg:konqueror</userinput> in die Adressleiste und nachfolgendes Drücken der &Enter;-Taste wird beispielsweise die Suchmaschine <trademark>Google</trademark> dazu aufgefordert, nach Einträgen mit Bezug zu &konqueror; zu suchen.

source: To see what Web Shortcuts are available, and perhaps add your own, use <menuchoice><guimenu>Settings</guimenu><guimenuitem>Configure Konqueror...</guimenuitem></menuchoice> and open the <guilabel>Web Shortcuts</guilabel> page.
de: Um die vorhandenen Web-Kürzel anzuschauen, und gegebenenfalls Ihre eigenen hinzuzufügen, verwenden Sie den Dialog <menuchoice><guimenu>Einstellungen</guimenu><guimenuitem>Konqueror einrichten ...</guimenuitem></menuchoice> und klicken auf die Seite <guilabel>Web-Kürzel</guilabel>.

source: Once there, to make a new Web Shortcut select <guibutton>New...</guibutton> and you will now have a new dialog requesting the options and specifications of your new Web Shortcut. The first field is for the human readable name of the search provider; that is, simply the name of the Search provider. For example, <trademark>Google</trademark>.
de: Nun können Sie auf <guibutton>Neu ...</guibutton> klicken, um ein neues Web-Kürzel zu erstellen. In dem Dialog müssen Sie nun die nötigen Optionen eingeben. Das erste Feld ist für den Namen des Kürzels gedacht. Ein Beispiel wäre <trademark>Google</trademark>.

source: In the next field you should enter the &URI; that is used to do a search on the search engine. The whole text to be searched for can be specified as <userinput>\{@}</userinput> or <userinput>\{0}</userinput>. The recommended version is <userinput>\{@}</userinput> since it removes all query variables (<replaceable>name</replaceable>=<replaceable>value</replaceable>) from the resulting string whereas <userinput>\{0}</userinput> will be substituted with the unmodified query string.
de: Im nächsten Feld müssen Sie die Such-Adresse eingeben, die zum Aufruf der Suchmaschine verwendet werden soll. Der gesamte Suchtext kann in der Form <userinput>\{@}</userinput> oder <userinput>\{0}</userinput> angegeben werden. Die empfohlene Methode ist <userinput>\{@}</userinput>, weil hierbei alle Suchvariablen (<replaceable>name</replaceable>=<replaceable>wert</replaceable>) aus der resultierenden Zeichenkette entfernt werden. <userinput>\{0}</userinput> wird durch die unmodifizierte Such-Zeichenfolge ersetzt.

source: You can use <userinput>\{1}</userinput> ... <userinput>\{n}</userinput> to specify certain words from the query and <userinput>\{<varname><replaceable>name</replaceable></varname>}</userinput> to specify a value given by <userinput><varname><replaceable>name</replaceable></varname>=<replaceable>value</replaceable></userinput> in the user query. In addition it is possible to specify multiple references (names, numbers and strings) at once, like <userinput>(\{<varname><replaceable>name1</replaceable></varname>,<varname><replaceable>name2</replaceable></varname>,...,"<replaceable>string</replaceable>"})</userinput>. The first matching value (from the left) will be used as substitution value for the resulting &URI;. A quoted string can be used as the default value if nothing matches from the left of the reference list.
de: Sie können <userinput>\{1}</userinput> ... <userinput>\{n}</userinput> verwenden, um bestimmte Wörter aus der Suchanfrage zu referenzieren. Mit <userinput>\{<varname><replaceable>name</replaceable></varname>}</userinput> können Sie einen bestimmten Wert anhand von <userinput><varname><replaceable>name</replaceable></varname>=<replaceable>wert</replaceable></userinput> einsetzen. Es ist auch möglich, mehrere Referenzen gleichzeitig anzugeben (Namen, Zahlen und Zeichenketten): <userinput>(\{<varname><replaceable>name1</replaceable></varname>,<varname><replaceable>name2</replaceable></varname>,...,,"<replaceable>zeichenkette</replaceable>"})</userinput>. Der erste passende Wert (von links gesehen) wird als Ersetzung für die &URI; verwendet. Für den Fall das nichts passt, kann ein Vorgabewert in Anführungszeichen verwendet werden.

source: To make a basic Web Shortcut here however, all that is required is the &URI; that is used to do a search on the search engine. Following our previous example with <trademark>Google</trademark>, we would enter <userinput>http://www.google.com/search?q=\{@}&amp;ie=UTF-8&amp;oe=UTF-8</userinput>. You can often easily find where to place the <userinput>\{@}</userinput> by doing a search on the search engine in question, and then analyzing the &URL; address. For example, doing a <trademark>Google</trademark> search for &konqueror; produces the &URL;: <ulink url="http://www.google.com/search?q=konqueror&amp;ie=UTF-8&amp;oe=UTF-8">http://www.google.com/search?q=konqueror&amp;ie=UTF-8&amp;oe=UTF-8</ulink>. Now you need to merely replace &konqueror; with <userinput>\{@}</userinput> in this example to find the appropriate &URI; to be entered.
de: Um ein einfaches Web-Kürzel zu erstellen, ist im Grunde jedoch nur die &URI; für den Suchmaschinen-Aufruf nötig. Wenn wir das vorige Beispiel <trademark>Google</trademark> fortführen, würden wir <userinput>http://www.google.com/search?q=\{@}&amp;ie=UTF-8&amp;oe=UTF-8</userinput> eingeben. Wo Sie das <userinput>\{@}</userinput> einsetzen müssen, lässt sich meist leicht herausfinden, wenn Sie eine Suche in der echten Suchmaschine durchführen und dann die verwendete Adresse untersuchen. Wenn Sie zum Beispiel in <trademark>Google</trademark> eine Suche nach &konqueror; durchführen, erzeugt <trademark>Google</trademark> die Adresse: <ulink url="http://www.google.com/search?q=konqueror&amp;ie=UTF-8&amp;oe=UTF-8">http://www.google.com/search?q=konqueror&amp;ie=UTF-8&amp;oe=UTF-8</ulink>. Nun müssen Sie einfach nur das Wort <quote>&konqueror;</quote> mit <userinput>\{@}</userinput> ersetzen und Sie haben die nötige &URI; für unser Beispiel.

source: In the third field you need to enter the &URI; shortcut. For example, the <userinput>gg</userinput> in <userinput>gg:konqueror</userinput>. In the next option &mdash; the drop-down menu &mdash; you have the option to select the character set that will be used to encode the search query. Once you have entered all the options correctly to your satisfaction, press &Enter; and your new Web Shortcut should now be available in &konqueror;.
de: Im dritten Feld müssen Sie das Kürzel eingeben, dass Sie zum Aufruf dieser Suchmaschine verwenden möchten. Zum Beispiel <userinput>gg</userinput> in <userinput>gg:konqueror</userinput>. Zuletzt können Sie noch den Zeichensatz auswählen, mit dem Ihre Suchanfrage kodiert werden soll. Wenn Sie alle nötigen Eingaben gemacht haben, drücken Sie die Eingabetaste und Ihr neues Web-Kürzel ist in &konqueror; verfügbar.

source: Access Keys
de: Zugriffstasten

source: &konqueror; has full support for the <sgmltag class="attribute">accesskey</sgmltag> &HTML; attribute in forms and links. Access keys allow you to use the keyboard keys for functions which would perhaps normally be done with the mouse, such as following links. The benefit of this is, quite simply, that users can interact with a page with devices other than a pointing device.
de: &konqueror; bringt volle Unterstützung für sog. Zugriffstasten mit. Dies sind Tasten, die über das &HTML;-Attribut <sgmltag class="attribute">accesskey</sgmltag> in Formularen oder Verweisen festgelegt wurden. Mit Zugriffstasten können Sie die Tastatur verwenden, wo Sie normalerweise auf die Maus angewiesen wären, zum Beispiel um eine Verknüpfung aufzurufen. Der Vorteil daran ist, dass Sie Webseiten auch mit Geräten besuchen können, die kein Zeigegerät haben (wie &eg; Mobiltelefone).

source: This feature has to be enabled by checking the <guilabel>Enable Access Key activation with &Ctrl; key</guilabel> option on the <guilabel>Web Browsing</guilabel> settings page.
de: Damit dies funktioniert, muss <guilabel>Zugriffstasten durch Drücken der &Ctrl;-Taste aktivieren</guilabel> auf der Seite <guilabel>Surfen im Internet</guilabel> im Einrichtungsdialog eingeschaltet werden.

source: To activate the access keys in &konqueror;, press and release &Ctrl;. Once this is pressed, if a particular link on the website has the <sgmltag class="attribute">accesskey</sgmltag> attribute in the given link, then the character(s) should appear over the link, identifying what needs to be pressed. Then, you can enter the character(s) associated with the link as an alternative to following the link with the mouse. To disable the access keys once activated you can press &Ctrl; again.
de: Um Zugriffstasten zu aktivieren, drücken Sie in &konqueror; die &Ctrl;-Taste und lassen sie wieder los. Wenn sie einmal gedrückt wurde und ein Verweis das Attribut <sgmltag class="attribute">accesskey</sgmltag> definiert hat, wird das entsprechende Zeichen über der Verknüpfung hervorgehoben. Daran sehen Sie, welche Taste Sie drücken müssen. Wenn Sie nun den hervorgehobenen Buchstaben drücken, wird die entsprechende Verknüpfung aufgerufen. Um die Zugriffstasten wieder zu deaktivieren, drücken Sie nochmals &Ctrl;.

source: The proper use of this feature requires that the web designer of the page has specifically assigned, using the <sgmltag class="attribute">accesskey</sgmltag> attribute, an access key for the link. Many web designers might not include the <sgmltag class="attribute">accesskey</sgmltag> in their links and forms, and consequently this feature will be unusable on the given webpage.
de: Damit diese Funktion richtig nutzbar ist, muss der Webdesigner der Seite natürlich entsprechende Zugriffstasten über <sgmltag class="attribute">accesskey</sgmltag>-Attribute zugewiesen haben. Leider machen sich viele Webdesigner diese Mühe nicht, daher ist diese Funktion auf solchen Seiten konsequenterweise nicht nutzbar.

source: Browser Identification
de: Browserkennung

source: When &konqueror; connects to a web site it sends some brief browser identification information, known as the <quote>User Agent</quote> string. Many web sites use this information to customize the pages that they send back, based on the strengths and weaknesses of different browsers.
de: Wenn &konqueror; sich mit einer Webseite verbindet, sendet er eine kurze Information zur Browserkennung, den so genannten <quote>User Agent</quote>-String. Viele Webseiten benutzen diese Information, um die gesendeten Seiten den Möglichkeiten der unterschiedlichen Browser entsprechend anzupassen.

source: Unfortunately, some badly designed sites refuse to work properly unless you are using a browser that the site recognizes as a <quote>valid</quote> one, even though if given a chance, &konqueror; will work satisfactorily with the vast majority of web pages.
de: Leider verweigern einige schlecht gestaltete Webseiten die korrekte Darstellung, solange Sie keinen Browser benutzen, den diese Webseite als <quote>gültig</quote> anerkennt, obwohl &konqueror; im Zweifelsfall mit der großen Mehrheit der Webseiten zufriedenstellend zusammenarbeiten wird.
