Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/applications/konqueror_man-kbookmarkmerger.1.po
Languages: de

source: KDE User's Manual
de: KDE-Benutzerhandbuch

source: February 1st, 2005
de: 01. Februar 2005

source: K Desktop Environment
de: K-Arbeitsflächenumgebung

source: A program for merging a given set of bookmarks into the user's list of bookmarks.
de: Ein Programm zum Zusammenführen mehrerer vorgegebener Lesezeichenlisten zu einer Lesezeichenliste für den Benutzer.

source: &kbookmarkmerger; <arg choice="opt" rep="repeat">Qt Options</arg> <arg choice="opt" rep="repeat">KDE Options</arg> <arg choice="req">directory</arg>
de: &kbookmarkmerger; <arg choice="opt" rep="repeat">Qt-Optionen</arg> <arg choice="opt" rep="repeat">KDE-Optionen</arg> <arg choice="req">Verzeichnis</arg>

source: Description
de: Beschreibung

source: &kbookmarkmerger; is a program for merging a given set of bookmarks into the user's set of bookmarks; if the user doesn't have any bookmarks created yet, a new bookmark list is created and the given bookmarks are inserted into it. While doing this, &kbookmarkmerger; keeps track of which files were merged in a previous run already, so no bookmark will get installed to the user's bookmarks more than once. In case &kde; is running while &kbookmarkmerger; is executed, the &kde; bookmark subsystem will be informed of any changes to the user's bookmarks, so that all applications accessing that information (&ie; &konqueror;) will pick the changes up instantly.
de: &kbookmarkmerger; ist ein Programm zum Zusammenführen mehrerer vorgegebener Lesezeichenlisten zu einer einzigen Lesezeichenliste für den Benutzer. Wenn der Benutzer noch keine Lesezeichen erzeugt hat, wird eine neue Lesezeichenliste erzeugt und die vorgegebenen Lesezeichen werden in diese Liste abgelegt. Beim Zusammenführen achtet &kbookmarkmerger; darauf, welche Dateien in einem vorherigen Lauf bereits zusammengeführt worden sind, sodass kein Lesezeichen in der Lesezeichenliste des Benutzers mehr als einmal eingebaut wird. Wenn &kbookmarkmerger; unter &kde; ausgeführt wird, wird das &kde;-Lesezeichensystem über alle Änderungen an der Lesezeichenliste des Benutzers auf dem Laufenden gehalten, sodass diese Änderungen allen Anwendungen, die auf diese Informationen zugreifen (&eg; &konqueror;), unmittelbar zur Verfügung stehen.

source: The traditionally used approach to achieve something like this was to use carefully crafted skeleton home directories when creating a new user account, to provide the user with a standard set of bookmarks. The problem with this approach is that after the user account has been created, no new bookmarks can be propagated.
de: Die traditionelle Herangehensweise, um so etwas zu erreichen, bestand darin, bei der Erzeugung von neuen Benutzer-Accounts ein sorgfältig gestaltetes Gerüst von persönlichen Verzeichnissen zu nutzen, um dem Benutzer einen Standardsatz von Lesezeichen zur Verfügung zu stellen. Das Problem bei diesem Zugang bestand darin, dass nach der Erzeugung des Benutzer-Accounts keine neuen Lesezeichen verteilt werden konnten.

source: This mechanism is useful for system administrators who want to propagate a bookmark pointing to a certain document (for instance, important notes about the system) to all users. Distributors might find it useful as well, for instance by augmenting the software packages they supply with bookmark files which &kbookmarkmerger; merges into the user's bookmark list when the package is installed. That way, documentation shipped with a software package is easily and visibly accessible right after the package has been installed.
de: Dieser Mechanismus ist nützlich für Systemadministratoren, die ein Lesezeichen, das auf ein bestimmtes Dokument verweist (zum Beispiel wichtige Anmerkungen zum System), an alle Benutzer verteilen wollen. Auch für Distributoren kann es nützlich sein, ihren Softwarepaketen Lesezeichendateien beizulegen, die während der Installation von &kbookmarkmerger; in die Lesezeichenliste des Benutzers eingefügt werden. So kann man unmittelbar nachdem das Softwarepaket installiert wurde, auf die mitgelieferte Dokumentation auf einfache und klare Weise zugreifen.

source: The only parameter required by &kbookmarkmerger; is the name of a directory which shall be scanned for bookmark files. All files in the given directory will be considered for being merged into the user's setup. The files in the given directory should be valid <acronym>XBEL</acronym> files.
de: Der einzige von &kbookmarkmerger; benötigte Parameter ist der Name eines Verzeichnisses, das nach Lesezeichendateien durchsucht werden soll. Alle Dateien im angegebenen Verzeichnis werden für die Zusammenlegung in die Einrichtungsdateien des Benutzers berücksichtigt. Die Dateien im angegebenen Verzeichnis sollten gültige<acronym>XBEL</acronym>-Dateien sein.

source: See Also
de: Siehe auch

source: &konqueror; manual
de: Handbuch zu &konqueror;

source: Examples
de: Beispiele

source: Merges all bookmark files stored in <filename>/usr/local/extra-bookmarks</filename> into joe's list of bookmarks.
de: Fasst alle unter <filename>/usr/local/extra-bookmarks</filename> abgelegten Lesezeichendateien in die Lesezeichenliste des Benutzers joe zusammen.

source: <acronym>XBEL</acronym> specification
de: <acronym>XBEL</acronym>-Spezifikation

source: Restrictions
de: Einschränkungen

source: When determining whether a given bookmark file has been merged into the user's bookmarks already or not, &kbookmarkmerger; merely looks at the filename of the bookmark file - the contents are not checked at all. This means that changing a bookmark file which was already merged into a user's bookmarks will not trigger merging it once again.
de: Um herauszufinden, ob eine gegebene Lesezeichendatei bereits in die Lesezeichendatei des Benutzers eingearbeitet wurde oder nicht, betrachtet &kbookmarkmerger; nur den Dateinamen der Lesezeichendatei - Inhalte werden nicht berücksichtigt. Das bedeutet, dass Änderungen an einer Lesezeichendatei, die bereits in eine Lesezeichendatei des Benutzers eingearbeitet wurde, keine erneute Verarbeitung dieser Datei auslösen.

source: Also note that in case a user modifies a bookmark which was merged into his setup, the original bookmark file will be left unmodified.
de: Beachten Sie auch, dass, wenn ein Benutzer eine Datei bearbeitet, die für ihn zusammengefügt wurde, die ursprüngliche Lesezeichendatei unverändert bleibt.

source: Author
de: Autor
