Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/applications/konqueror.po
Languages: de

source: This shows a tree view of your bookmarks and bookmark subfolders. As is usual for tree views in &kde;, subfolders are shown with a small <keycap>&gt;</keycap> arrow at the left of the folder name; <mousebutton>left</mousebutton> clicking on it will expand the view to show the contents of that subfolder and the <keycap>&gt;</keycap> arrow will change to <keycap>v</keycap>; <mousebutton>left</mousebutton> clicking on the <keycap>v</keycap> arrow will collapse the subfolder view.
de: Hier sehen Sie eine Baumansicht Ihres Lesezeichenordners mit seinen Unterordnern. Wie bei den Baumansichten in &kde; üblich, werden Unterordner mit einem kleinen Kästchen links vor dem Namen dargestellt. Wenn das Kästchen ein <keycap>&gt;</keycap>-Zeichen enthält, können Sie die Ansicht mit einem Linksklick auf das Zeichen ausklappen, sodass alle Unterordner angezeigt werden, wobei das <keycap>&gt;</keycap>-Zeichen durch ein<keycap>v</keycap>-Zeichen ersetzt wird. Ein Linksklick auf das <keycap>v</keycap>-Zeichen klappt die Ansicht mit den Unterordnern wieder zusammen.

source: To select an item in the list you can <mousebutton>left</mousebutton> click on it, or you can navigate through the list by using the <keysym> Up arrow</keysym> and <keysym>Down arrow</keysym> keys to move around, <keysym>Right arrow</keysym> to expand a subfolder and <keysym> Left arrow</keysym> to collapse it.
de: Um einen Eintrag aus der Liste auszuwählen, klicken Sie mit der linken Maustaste darauf. Sie können auch mit den Tasten <keysym>Pfeil hoch</keysym> und <keysym>Pfeil runter</keysym> durch die Liste navigieren oder mit den Tasten <keysym>Pfeil rechts</keysym> einen Unterordner ausklappen bzw. mit <keysym>Pfeil links</keysym> zusammenklappen.

source: You can move an item to a different place in the list by using the normal Drag and Drop or <guimenuitem>Cut</guimenuitem> and <guimenuitem> Paste</guimenuitem> methods. The order in which the items appear in the <guilabel>Bookmark Editor</guilabel> is the order they will appear in the <guimenu>Bookmarks</guimenu> drop down list. The <menuchoice><guimenu>Folder </guimenu><guimenuitem>Insert Separator</guimenuitem></menuchoice> option can be used to insert separating lines into the list wherever you wish.
de: Sie können Objekte mit <quote>Ziehen und Ablegen</quote> oder durch <guimenuitem>Ausschneiden</guimenuitem> und <guimenuitem>Einfügen</guimenuitem> in der Liste umplatzieren. Die Reihenfolge, in der die Einträge im <guilabel>Lesezeicheneditor</guilabel> angezeigt werden, ist auch die Reihenfolge, in der sie später im Lesezeichenmenü dargestellt werden. Sie können die Liste sogar noch verschönern, indem Sie mit Hilfe der Funktion <menuchoice><guimenu>Ordner</guimenu><guimenuitem>Trennlinie einfügen</guimenuitem></menuchoice> zwischen zwei Lesezeichen Trennlinien einfügen.

source: A new subfolder can be created at the selected point in the list by using the <guimenuitem>New Folder...</guimenuitem> option in the <guimenu>Folder</guimenu> menu or from the drop down menu you get when you <mousebutton>right</mousebutton> click on an item in the main part of the window, or with <keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo>
de: Neue Ordner und Unterordner können am ausgewählten Punkt in der Liste mit der Option <guimenuitem>Neuer Ordner ...</guimenuitem> im Menü <guimenu>Ordner</guimenu> oder im Kontextmenü des Hauptfensters (das Sie mit einem Rechtsklick auf den Hauptteil des Editorfensters öffnen) erstellt werden oder Sie betätigen einfach die Tastenkombination <keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo>.

source: To change the name of a bookmark or folder select it then press <keycap>F2</keycap> or choose the <guimenuitem>Rename</guimenuitem> item from the <guimenu>Edit</guimenu> menu or the pop up menu that appears when you <mousebutton>right</mousebutton> click on the item. Similarly, you can edit the &URL; by pressing <keycap>F3</keycap> or choosing the <guimenuitem> Change Location</guimenuitem> menu item.
de: Um den Namen eines Lesezeichens oder Ordners zu ändern, wählen Sie ihn aus und drücken dann <keycap>F2</keycap>. Oder Sie wählen den Eintrag <guimenuitem>Umbenennen</guimenuitem> aus dem Menü <guimenu>Bearbeiten</guimenu> oder aus dem Kontextmenü, das nach einem Rechtsklick auf einen Eintrag erscheint. Entsprechend können Sie eine Adresse (&URL;) bearbeiten, indem Sie <keycap>F3</keycap> drücken, oder den Menüeintrag <guimenuitem>Adresse ändern</guimenuitem> auswählen.

source: The <guilabel>Bookmark Editor</guilabel> lets you import bookmarks from a range of other browsers into &konqueror;'s bookmark list, putting them into a new folder or replacing all current bookmarks. To do this select <guisubmenu>Import</guisubmenu> from the <guimenu>File</guimenu> menu. The <menuchoice><guimenu>File</guimenu><guisubmenu>Export</guisubmenu> </menuchoice> option can be used to export &konqueror;'s bookmarks to a &Netscape; or Mozilla browser.
de: Mit dem <guilabel>Lesezeichen-Editor</guilabel> können Sie Lesezeichen von einer Reihe anderer Browser in &konqueror;s Lesezeichenliste importieren. Sie werden wahlweise in einen neuen Ordner platziert oder ersetzen alle aktuellen Lesezeichen. Hierzu müssen Sie <guisubmenu>Importieren</guisubmenu> aus dem Menü <guimenu>Datei</guimenu> aufrufen. Mit der Option <menuchoice><guimenu>Datei</guimenu><guisubmenu>Exportieren</guisubmenu> </menuchoice> können Sie &konqueror;s Lesezeichen für den &Netscape;- oder Mozilla-Browser exportieren.

source: To select which bookmark subfolder is used to hold the Bookmark Toolbar items select the subfolder then choose <guimenuitem>Set as Toolbar Folder</guimenuitem> from the <guimenu>Folder</guimenu> menu.
de: Um auszuwählen, welcher Lesezeichen-Unterordner die Lesezeichen für die Anzeige in der Werkzeugleiste enthält, wählen Sie zuerst den Unterordner aus und rufen dann <guimenuitem>Als Ordner in Werkzeugleiste anzeigen</guimenuitem> im Menü <guimenu>Ordner</guimenu> auf.

source: If you are tidying up your bookmarks and have forgotten what a particular web page is, you can easily open it from within the <guilabel> Bookmark Editor</guilabel> by <mousebutton>right</mousebutton> clicking on the item and selecting <guimenuitem>Open in Konqueror</guimenuitem> from the pop up menu. If you just want to check that the &URL; is still valid select <guimenuitem>Check Status</guimenuitem> instead.
de: Wenn Sie Ihre Lesezeichen aufräumen und vergessen haben, was eine bestimmte Webseite eigentlich enthielt, können Sie sie ganz einfach aus dem <guilabel>Lesezeichen-Editor</guilabel> heraus öffnen, indem Sie nach einem Rechtsklick auf den Eintrag im Kontextmenü <guimenuitem>In Konqueror öffnen</guimenuitem> auswählen. Wenn Sie nur überprüfen wollen, ob die &URL; noch gültig ist, wählen Sie stattdessen <guimenuitem>Status überprüfen</guimenuitem>.

source: All your changes are automatically saved if you close the <guilabel>Bookmark Editor</guilabel>.
de: Alle Änderungen werden automatisch gespeichert, wenn Sie den <guilabel>Lesezeichen-Editor</guilabel> schließen.

source: The Sidebar
de: Der Navigationsbereich

source: The Sidebar appears as a separate view at the left of &konqueror;'s window. It can be invoked with <menuchoice><guimenu>Settings </guimenu><guimenuitem>Show Sidebar</guimenuitem></menuchoice> or toggled on and off with the <keycap>F9</keycap> key.
de: Der Navigationsbereich erscheint als eigene Ansicht auf der linken Seite des &konqueror;-Fensters. Sie können ihn mittels <menuchoice><guimenu>Einstellungen</guimenu><guimenuitem>Navigationsbereich anzeigen</guimenuitem></menuchoice> einrichten oder mit der Taste <keycap>F9</keycap> anzeigen bzw. ausblenden.

source: With the Sidebar
de: &konqueror; mit dem Navigationsbereich

source: It contains a number of tabbed pages; <mousebutton>left</mousebutton> click on a tab's icon to view that page. <mousebutton>Left</mousebutton> clicking on the icon for the visible page will collapse the Sidebar so that only the tab icons are visible.
de: Der Navigationsbereich enthält einige Unterfenster; durch einen Klick mit der &LMBn; auf den entsprechenden Unterfenster-Reiter, können Sie die jeweilige Seite aktivieren. Ein weiterer Linksklick auf die gerade angezeigte Seite klappt den Navigationsbereich soweit zusammen, dass nur noch die Reiter sichtbar bleiben.

source: Bookmarks
de: Lesezeichen

source: This page shows a tree view of your Bookmarks. <mousebutton> Left</mousebutton> click on an item to open it in the main view.
de: Diese Seite zeigt eine Baumansicht Ihrer Lesezeichen an. Ein Linksklick auf einen Eintrag öffnet diesen in der Hauptansicht.

source: History
de: Verlauf

source: This page shows a tree view of your browsing History. <mousebutton>Left</mousebutton> clicking on an item will open it in the main view, or you can open it in a new &konqueror; window by <mousebutton>right </mousebutton> clicking and selecting <guimenuitem>Open in New Window</guimenuitem> from the pop up menu.
de: Diese Seite zeigt eine Baumansicht Ihrer bisher besuchten Adressen an. Ein Linksklick auf einen Eintrag öffnet diesen in der Hauptansicht. Mittels Rechtsklick auf einen Eintrag und Auswahl von <guimenuitem>In neuem Fenster öffnen</guimenuitem> aus dem Kontextmenü können Sie die Seite in einem neuen &konqueror;-Fenster öffnen.

source: You can remove an item from the history by <mousebutton>right </mousebutton> clicking on it and selecting <guimenuitem>Remove Entry</guimenuitem>. Selecting <guimenuitem>Clear History</guimenuitem> will clear out the entire history.
de: Sie können einen Eintrag aus dem Verlaufsspeicher löschen, indem Sie mit der <mousebutton>rechten</mousebutton> Maustaste auf diesen Eintrag klicken und <guimenuitem>Eintrag entfernen</guimenuitem> auswählen. Die Auswahl von <guimenuitem>Verlaufsspeicher leeren</guimenuitem> löscht alle Einträge.

source: The pop up menu you get when you <mousebutton>right</mousebutton> click on any entry in the History page also gives you the option of choosing whether the entire history is sorted by name or by date.
de: Das Kontextmenü, das sich nach einem <mousebutton>Rechts</mousebutton>klick auf die Verlaufsseite öffnet, ermöglicht Ihnen, die Verlaufseinträge nach Datum oder Namen zu ordnen.

source: Selecting <guimenuitem>Preferences...</guimenuitem> from this pop up menu brings up the <guilabel>History Sidebar</guilabel> control module. This can be used to set the maximum size of your history and set a time after which items are automatically removed. You can also set different fonts for new and old &URL;s. The <guilabel>Detailed tooltips</guilabel> checkbox controls how much information is displayed when you hover the mouse pointer over an item in the history page.
de: Die Auswahl von <guimenuitem>Einstellungen ...</guimenuitem> in diesem Kontextmenü öffnet den Dialog <guilabel>Verlauf-Einstellungen</guilabel>. Hier können Sie die maximale Größe Ihres Verlaufsspeichers einstellen und die Zeit bestimmen, nach der Einträge automatisch entfernt werden. Sie können auch unterschiedliche Schriften für neue und alte &URL;s festlegen. Mit dem Ankreuzfeld <guilabel>Detaillierte Kurzinfos</guilabel> können Sie festlegen, wieviel Informationen Sie angezeigt bekommen, wenn Sie sich mit der Maus über einen Eintrag auf der Verlaufsseite bewegen.

source: Home Folder
de: Persönlicher Ordner

source: This page shows a tree view of the subfolders of your home folder. Note that <quote>hidden</quote> folders (those with names beginning with a dot) are not shown. <mousebutton>Left</mousebutton> click on an item to open it in the main view, or <mousebutton>right</mousebutton> click to display a pop up menu allowing you to open the subfolder in a new window or as a new tab page of the main view.
de: Diese Seite zeigt Ihnen eine Baumansicht der Unterordner Ihres persönlichen Ordners an. Beachten Sie, dass <quote>versteckte</quote> Ordner (solche, deren Namen mit einem Punkt beginnen) nicht angezeigt werden. Ein Linksklick auf einen Eintrag öffnet diesen in der Hauptansicht; ein Rechtsklick öffnet ein Kontextmenü, mit dem Sie einen Unterordner in einem neuen Fenster oder als neues Unterfenster in der Hauptansicht öffnen können.

source: Network
de: Netzwerk

source: This page is intended to show a tree view of your important network connections, although local folders can also be included. Again, you can <mousebutton>left</mousebutton> click on an item to open it in the main view or <mousebutton>right</mousebutton> click to bring up a menu with a wider range of possibilities.
de: Diese Seite soll Ihnen Ihre wichtigen Netzwerkverbindungen als Baumansicht zeigen. Es können aber auch lokale Ordner in die Ansicht einbezogen werden. Auch hier können Sie mit einem Linksklick das jeweilige Objekt in der Hauptansicht öffnen und ein Rechtsklick öffnet ein Kontextmenü mit weiteren Funktionen.

source: The folders shown in the <guilabel>Network</guilabel> page are held in the folder <filename class="directory"> ~/.kde/share/apps/konqsidebartng/virtual_folders/remote/</filename>, and you can make new ones just as you would make any other subfolder. The items within these folders are held as <literal role="extension">.desktop</literal> files and can be created with &konqueror;'s <menuchoice><guisubmenu>Create New</guisubmenu> <guimenuitem>Link to Location (URL)...</guimenuitem></menuchoice> option in the <guimenu>Edit</guimenu> menu.
de: Die Ordner, die auf der Seite <guilabel>Netzwerk</guilabel> angezeigt werden, befinden sich im Ordner <filename class="directory"> ~/.kde/share/apps/konqsidebartng/virtual_folders/remote/</filename>. Sie können neue Ordner auf dieselbe Weise wie übliche Unterordner erzeugen. Die Einträge in diesen Ordnern sind <literal role="extension">.desktop</literal>-Dateien und können mit der &konqueror;-Funktion <menuchoice><guisubmenu>Neu erstellen ...</guisubmenu> <guimenuitem>Verknüpfung mit Adresse (URL) ...</guimenuitem></menuchoice> im Menü <guimenu>Bearbeiten</guimenu> erzeugt werden.

source: Root Folder
de: Basisordner

source: The <guilabel>Root Folder</guilabel> tree has the path <filename class="directory">/</filename>, and is the base folder of your system's local files. If you expand the <quote>Root</quote> folder you will find another folder called <filename class="directory">root</filename>. This belongs to the system administrator or Super User and is her home folder. You will also find a folder called <filename class="directory">home</filename>, in which you should be able to find your own <quote>Home</quote> folder again.
de: Der <guilabel>Basisordner</guilabel> hat den Pfad <filename class="directory">/</filename> und ist die Basisadresse aller lokalen Dateien Ihres Systems. Wenn Sie sich die Unterordner des <quote>Basisordners</quote> anzeigen lassen, dann sehen Sie u.a. einen Ordner namens <filename class="directory">root</filename>. Dieser gehört dem Systemverwalter (auch <quote>Super User</quote> genannt) und ist sein persönlicher Ordner. Sie werden auch einen Ordner namens <filename class="directory">home</filename> finden, in dem Sie Ihren eigenen persönlichen Ordner (engl. Home Folder) wiederfinden sollten.

source: Services
de: KDE-Dienste

source: This page provides quick access to the following services:
de: Auf dieser Seite haben Sie Zugang zu den folgenden Diensten:

source: <guilabel>Applications</guilabel>, <guilabel>Audio CD Browser</guilabel>, <guilabel>Fonts</guilabel> and <guilabel>Video DVD Browser</guilabel>.
de: <guilabel>Programme</guilabel>, <guilabel>Audio-CDs ansehen</guilabel>, <guilabel>Schriftarten</guilabel> und <guilabel>Video-DVDs ansehen</guilabel>.

source: Places
de: Orte

source: The <guilabel>Places</guilabel> panel is located at the left of the window by default. The <guilabel>Places</guilabel> panel shows any locations you have bookmarked. It also shows any disk or media attached to the computer.
de: Die <guilabel>Orte</guilabel>-Seitenleiste ist normalerweise auf der linken Seite des Arbeitsbereiches zu finden. Hier werden Orte angezeigt, die Sie als Lesezeichen verwendet haben. Außerdem werden hier Wechselmedien und -geräte angezeigt, die an den Rechner angeschlossen sind.

source: The easiest way to add a folder to the <guilabel>Places</guilabel> panel is to drag it and drop it in the panel. Moreover, you can click inside the panel with the &RMB; and choose <menuchoice><guimenuitem>Add Entry...</guimenuitem></menuchoice> from the context menu.
de: Die einfachste Art, einen Ordner zur Seitenleiste <guilabel>Orte</guilabel> hinzuzufügen, ist, den Ordner mit der Maus in die Seitenleiste zu ziehen. Sie können auch in der Seitenleiste mit der &RMBn; klicken und <menuchoice><guimenuitem>Eintrag hinzufügen ...</guimenuitem> </menuchoice> aus dem Kontextmenü auswählen.

source: The Sidebar configuration can be changed by <mousebutton>right </mousebutton> clicking on the empty area below the bottom tab icon or by <mousebutton>left</mousebutton> clicking on the <guilabel>Configuration Button</guilabel> icon, which is enabled in the context menu. Doing this brings up a menu with the following options:
de: Die Einstellungen des Navigationsbereiches können mittels Rechtsklick auf einen freien Bereich unterhalb der Karteireiter oder durch Linksklick auf den <guilabel>Einrichtungsknopf</guilabel> (das oberste Symbol im Navigationsbereich, möglicherweise wird es mit Ihren Einstellungen nicht angezeigt) geändert werden. Sie erhalten ein Menü mit den folgenden Optionen:

source: Add New
de: Hinzufügen

source: This option lets you add a new tab page to the Sidebar. The new page can contain different Sidebar modules or a new <guimenuitem>Folder</guimenuitem> tree view. The last option in this submenu allows you to rollback to system default.
de: Mit dieser Option können Sie Ihrem Navigationsbereich eine neue Karteikarte hinzufügen. Die neue Seite kann die unterschiedliche Navigationsmodule oder einen neue <guimenuitem>Ordner</guimenuitem>-Baumansicht enthalten. Mit dem letzten Eintrag kann die Voreinstellung wieder hergestellt werden.

source: Multiple Views
de: Mehrere Ansichten

source: Selecting this option splits the Sidebar so that two tab pages can be seen at once.
de: Nach Auswahl dieser Option ist der Navigationsbereich teilbar, sodass mehrere Unterfenster gleichzeitig sichtbar sein können.

source: <guimenuitem>Show Tabs Left</guimenuitem>, <guimenuitem>Show Tabs Right</guimenuitem>
de: <guimenuitem>Karteireiter links anzeigen</guimenuitem>, <guimenuitem>Karteireiter rechts anzeigen</guimenuitem>

source: This option lets you choose whether the tab icons are shown at the left or right of the Sidebar.
de: Mit dieser Einstellung entscheiden Sie, ob die Symbolleiste mit den Reitern links oder rechts vom Navigationsbereich angezeigt werden soll.

source: Show Configuration Button
de: Einrichtungsknopf anzeigen

source: Use this option to show or hide the <guilabel>Configuration Button</guilabel> icon.
de: Diese Option zeigt den <guilabel>Einrichtungsknopf</guilabel> an bzw. blendet ihn aus.

source: <mousebutton>Right</mousebutton> clicking on a tab icon brings up a menu with the following options:
de: Ein <mousebutton>Rechts</mousebutton>klick auf einen Unterfenster-Reiter öffnet ein Menü mit den folgenden Optionen:

source: Set Name
de: Namen festlegen

source: This option lets you change the Name of that page.
de: Hier kann der Name der Seite geändert werden.

source: Set URL
de: Adresse festlegen ...

source: This option lets you change the &URL; (path) of the folder viewed in that page.
de: Hiermit können Sie die &URL; (den Pfad) des angezeigten Ordners ändern.

source: Set Icon
de: Symbol festlegen ...

source: To change the tab icon.
de: Hiermit können Sie das Symbol des Reiters ändern.

source: Remove
de: Entfernen

source: To remove the tab page from the Sidebar.
de: Hiermit können Sie das Unterfenster aus dem Navigationsbereich entfernen.

source: Configure Sidebar
de: Navigationsbereich einrichten

source: The last item shows the Sidebar configuration submenu as described above.
de: Der letzte Eintrag enthält ein Untermenü zur Einrichtung des Navigationsbereichs wie oben beschrieben.

source: Saving Settings &amp; Profiles
de: Speichern von Einstellungen &amp; Profilen

source: General Settings
de: Allgemeine Einstellungen

source: When you close down &konqueror; your current <guimenu>View</guimenu> menu settings (such as the <guimenuitem>View Mode</guimenuitem>, <guimenuitem>Use index.html</guimenuitem> and <guimenuitem>Show Hidden Files</guimenuitem> items) are not automatically saved as the default options; however, you can have &konqueror; remember these settings by selecting <menuchoice><guimenu>Settings</guimenu><guimenuitem>Save View Profile As...</guimenuitem></menuchoice> and the current setting will become the default option to be used the next time &konqueror; is started.
de: Wenn Sie &konqueror; beenden, werden die aktuellen Einstellungen des Menüs <guimenu>Ansicht</guimenu> (wie zum Beispiel <guimenuitem>Anzeigemodus</guimenuitem>, <guimenuitem>index.html benutzen</guimenuitem> und <guimenuitem>Versteckte Dateien anzeigen</guimenuitem>) nicht automatisch als Standardoptionen gespeichert. Sie können diese Einstellungen aber manuell speichern, indem Sie <menuchoice><guimenu>Einstellungen</guimenu><guimenuitem>Ansichtsprofil speichern unter ...</guimenuitem></menuchoice> anklicken. Dadurch werden Ihre aktuellen Einstellungen zur Voreinstellung für den nächsten Start von &konqueror;.

source: But you can also specify different <guimenu>View</guimenu> menu settings for an individual folder. To do this select <menuchoice><guimenu>View</guimenu> <guimenuitem>Adjust View Properties...</guimenuitem></menuchoice>, change the <guimenu>View</guimenu> settings in the dialog to whatever you want. Then apply the view properties to the <guilabel>Current folder</guilabel>. Doing this creates a <filename>.directory</filename> file in that folder to hold the folder <guimenu>View</guimenu> settings. Use this dialog again to remove the folder specific settings (or just delete the <filename>.directory</filename> file).
de: Sie können aber auch unterschiedliche Ansichtseinstellungen für jeden einzelnen Ordner festlegen. Dazu wählen Sie im Menü <menuchoice><guimenu>Ansicht</guimenu> <guimenuitem>Ansicht anpassen ...</guimenuitem></menuchoice>. Daraufhin können Sie die Ansicht-Einstellungen nach Belieben ändern. Anschließend übernehmen Sie diese Einstellungen für den <guimenuitem>aktuellen Ordner</guimenuitem>. Dadurch wird eine Datei namens <filename>.directory</filename> in diesem Ordner erstellt. Diese Datei enthält Ihre Ansichts-Einstellungen. Benutzen Sie diesen Dialog, um diese ordnerspezifischen Einstellungen wieder zu löschen (oder löschen Sie einfach <quote>von Hand</quote> die Datei <filename>.directory</filename>).

source: One nice use of this feature is if you have a folder full of pictures, you can set that particular folder to display thumbnails of the pictures (by choosing the <menuchoice><guisubmenu>View Mode</guisubmenu> <guimenuitem>Icons</guimenuitem></menuchoice> and <guimenuitem>Preview</guimenuitem> from the <guimenu>View</guimenu> menu) when you open it, while not displaying images as thumbnails in other folders.
de: Ein nützlicher Einsatzzweck dieser Funktion ist zum Beispiel die Vorschau von Bildern, wenn Sie einen ganzen Ordner voller Bilder haben. Sie können in diesem bestimmten Ordner kleine Minibilder der Bilddateien anzeigen lassen (durch Auswahl von <menuchoice><guisubmenu>Anzeigemodus</guisubmenu> <guimenuitem>Symbole</guimenuitem></menuchoice> und <guimenuitem>Vorschau</guimenuitem> aus dem Menü <guimenu>Ansicht</guimenu>, während in anderen Ordnern keine Minibilder angezeigt werden.

source: View Profiles
de: Ansichtsprofile
