Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/extragear-kdevelop/kdevelop.po
Languages: de

source: &kdevelop; Handbook
de: Handbuch zu &kdevelop;

source: <firstname>This documentation was converted from the KDE UserBase <ulink url=" http://userbase.kde.org/KDevelop4/Manual">KDevelop4/Manual</ulink> page.</firstname> <surname></surname>
de: <firstname>Dieses Handbuch wurde aus der <ulink url=" http://userbase.kde.org/KDevelop4/Manual">KDevelop4/Manual</ulink>-Webseite der &kde;-Userbase erstellt.</firstname> <surname></surname>

source: &kdevelop; is an Integrated Development Environment to be used for a wide variety of programming tasks.
de: &kdevelop; ist eine integrierte Entwicklungsumgebung für viele unterschiedliche Aufgaben bei der Programmierung.

source: What is &kdevelop;?
de: Was ist &kdevelop;?

source: <ulink url="http://www.KDevelop.org">&kdevelop;</ulink> is a modern integrated development environment (IDE) for C++ (and other languages) that is one of many <ulink url="http://www.kde.org/applications/">KDE applications</ulink>. As such it runs on &Linux; (even if you run one of the other desktops, such as GNOME) but it is also available for most other variants of &UNIX; and for Windows as well.
de: <ulink url="http://www.KDevelop.org">&kdevelop;</ulink> ist eine moderne integrierte Entwicklungsumgebung (IDE) für C++ und andere Sprachen. &kdevelop; ist eine der vielen <ulink url="http://www.kde.org/applications/">KDE-Programme</ulink>. Es läuft unter &Linux;, auch unter anderen Arbeitsumgebungen wie Gnome, und ist auch für die meisten &UNIX;-Varianten und ebenfalls für Windows verfügbar.

source: &kdevelop; offers all amenities of modern IDEs. For large projects and applications, the most important feature is that &kdevelop; <emphasis>understands C++</emphasis>: it parses the entire source base and remembers which classes have which member functions, where variables are defined, what their types are, and many other things about your code. For example, let's say one of your project's header files declares a class
de: &kdevelop; bietet alle Vorteile moderner Integrierter Entwicklungsumgebungen (IDEs). Für große Projekte und Anwendungen ist es am wichtigsten, dass &kdevelop; <emphasis>C++ versteht</emphasis>: &kdevelop; durchsucht den gesamten Quelltext und merkt sich, welche Klasse welche Funktionen hat, wo Variablen definiert sind, was deren Typen sind und viele andere Dinge in Ihrem Quelltext. Angenommen eine Header-Datei in Ihrem Projekt deklariert folgende Klasse:

source: and later on in your program you have
de: und später in Ihrem Programm schreiben Sie

source: Car my_ride; // ...do something with this variable... std::string color = my_ride.ge
de: Car my_ride; // ... benutzen Sie diese Variable ... std::string color = my_ride.ge

source: it will have remembered that <varname>my_ride</varname> in the last line is a variable of type <varname>Car</varname> and offer you to complete <varname>ge</varname> as <varname>get_color()</varname> since this is the only member function of the <varname>Car</varname> class that starts like this. Instead of continuing to type you just hit &Enter; to get the full word; this saves typing, avoids typos, and doesn't require you to remember the exact names of the hundreds or thousands of functions and classes that make up large projects.
de: dann wird &kdevelop; sich gemerkt haben, dass <varname>my_ride</varname> in der letzten Zeile eine Variable des Typs <varname>Car</varname> ist. Demzufolge wird Ihnen angeboten, <varname>ge</varname> als <varname>get_Color()</varname> zu vervollständigen, da dies die einzige Methode der Klasse <varname>Car</varname> ist, die mit diesen Buchstaben beginnt. Statt weiterzutippen, drücken Sie einfach Taste &Enter;, um das vollständige Wort einzufügen. Das spart Zeit bei der Eingabe, verhindert Fehler und es nicht mehr für Sie erforderlich, sich alle Funktionen und Klassen in sehr großen Projekten zu merken.

source: As a second example, assume you have code like this:
de: Als zweites Beispiel bei folgendem Quelltext:

source: If you hover the mouse over the symbol <varname>var</varname> in function <varname>bar</varname> you get the option to see all uses of this symbol. Clicking on it will only show you the uses of this variable in function <varname>bar</varname> because &kdevelop; understands that the variable <varname>var</varname> in function <varname>foo</varname> has nothing to do with it. Similarly, right clicking on the variable name allows you to rename the variable; doing so will only touch the variable in <varname>bar</varname> but not the one with the same name in <varname>foo</varname>.
de: Wenn Sie mit dem Mauszeiger über das Symbol <varname>var</varname> in der Funktion <varname>bar</varname> fahren, erhalten Sie die Option, sich alle Verwendungen des Symbols anzeigen zu lassen. Wenn Sie darauf klicken, wird lediglich die Verwendungen dieser Variable in der Funktion <varname>bar</varname> angezeigt, weil &kdevelop; versteht, dass die Variable <varname>var</varname> in der Funktion <varname>foo</varname> nichts damit zu tun hat. Wenn Sie auf die Variable mit der &RMBn; klicken, können Sie die Variable umbenennen. Genau wie bei der Verwendung wird dies nur die Variable in <varname>bar</varname> ändern, jedoch nicht die Variable mit dem selben Namen in <varname>foo</varname>.

source: But &kdevelop; is not just an intelligent code editor; there are other things &kdevelop; does well. Obviously, it highlights the source code in different colors; it has a customizable indenter; it has an integrated interface to the GNU debugger <application>gdb</application>; it can show you the documentation for a function if you hover the mouse over a use of this function; it can deal with different kinds of build environments and compilers (&eg; with <guilabel>make</guilabel> and <guilabel>cmake</guilabel>-based project), and many other neat things that are discussed in this manual.
de: Aber &kdevelop; ist nicht nur ein intelligenter Editor für Quelltext, es gibt viele weitere Funtionen in &kdevelop;. Quelltext wird in in verschiedenen Farben hervorhoben, es gibt eine konfigurierbare Einrückung, eine integrierte Schnittstelle zum GNU-Debugger <application>gdb</application> und es kann die Dokumentation einer Methode angezeigt werden, wenn man mit dem Mauszeiger darüber fährt. Außerdem kann mit verschiedenen Arten von Erstellungs-Umgebungen und Compilern umgehen (&eg; <guilabel>make</guilabel> und <guilabel>cmake</guilabel>) und viele andere Dinge, die in diesem Handbuch vorgestellt werden.

source: Sessions and projects: The basics of &kdevelop;
de: Sitzungen und Projekte: Die Grundlagen von &kdevelop;

source: In this section, we will go over some of the terminology of how &kdevelop; sees the world and how it structures work. In particular, we introduce the concept of <emphasis>sessions</emphasis> and <emphasis>projects</emphasis> and explain how you can set up the projects you want to work on in &kdevelop;.
de: In diesem Abschnitt werden einige in &kdevelop; verwendete Fachbegriffe und die Arbeitsstrukturen erläutert. Insbesondere wird das Konzept von <emphasis>Sitzungen</emphasis> und <emphasis>Projekten</emphasis> eingeführt und erklärt, wie Sie Ihre Projekte in &kdevelop; einrichten.

source: Terminology
de: Fachbegriffe

source: &kdevelop; has the concept of <emphasis>sessions</emphasis> and <emphasis>projects</emphasis>. A session contains all projects that have something to do with each other. For the examples that follow, assume you are the developer of both a library and an application that uses it. You can think of the core KDE libraries as the former and &kdevelop; as the latter. Another example: Let's say you are a &Linux; kernel hacker but you are also working on a device driver for &Linux; that hasn't been merged into the kernel tree yet.
de: &kdevelop; nutzt das Konzept von <emphasis>Sitzungen</emphasis> und <emphasis>Projekten</emphasis>. Eine Sitzung beinhaltet alle Projekte, die miteinander zusammenhängen. Angenommen, Sie sind der Entwickler einer Bibliothek und einer Anwendung, die diese Bibliothek benutzt. Ein Beispiel hierfür ist die Entwicklung von &kdevelop;: hier könnten Sie die KDE-Kern-Bibliotheken als die Bibliothek und &kdevelop; als die benutzende Anwendung in einer Sitzung entwickeln. Ein anderes Beispiel ist, wenn Sie als &Linux;-Kernel-Entwickler gleichzeitig parallel an einem Gerätetreiber für &Linux; arbeiten, der noch nicht mit den Kernel-Baum zusammengeführt wurde.

source: So taking the latter as an example, you would have a session in &kdevelop; that has two projects: the &Linux; kernel and the device driver. You will want to group them into a single session (rather than having two sessions with a single project each) because it will be useful to be able to see the kernel functions and data structures in &kdevelop; whenever you write source code for the driver &mdash; for example so that you can get kernel function and variable names auto-expanded, or so that you can see kernel function documentation while hacking on the device driver.
de: Im letztgenannten Beispiel wird in &kdevelop; eine Sitzung erstellt, die aus zwei Projekten besteht: dem &Linux;-Kernel und dem Gerätetreiber. Dies wird in eine einzige Sitzung zusammengefasst (statt zwei Sitzungen mit jeweils einem einzelnen Projekt), weil es hilfreich ist, die Kernel-Funktionen und Datenstrukturen beim Schreiben von Quelltext für den Treiber zu sehen. Beispielsweise können Kernel-Funktionen und Variablen automatisch expandiert werden, oder man kann Dokumentation der Kernel-Funktionen sehen, während man am Gerätetreiber programmiert.

source: Now imagine you also happen to be a KDE developer. Then you would have a second session that contains KDE as a project. You could in principle have just one session for all of this, but there is no real reason for this: in your KDE work, you don't need to access kernel or device driver functions; and you don't want KDE class names autoexpanded while working on the &Linux; kernel. Finally, building some of the KDE libraries is independent of re-compiling the &Linux; kernel (whereas whenever you compile the device driver it would also be good to re-compile the &Linux; kernel if some of the kernel header files have changed).
de: Stellen Sie sich nun vor, Sie wären auch KDE-Entwickler. Dann hätten Sie eine zweite Sitzung, die auch KDE als Projekt enthielte. Sie könnten natürlich nur eine Sitzung für alle Projekte haben, aber es gibt keinen Grund dafür: während Sie an KDE arbeiten, brauchen Sie keinen Zugriff auf den Kernel oder auf den Gerätetreiber. Sie würden auch nicht wollen, dass KDE-Klassen automatisch vervollständigt werden, während Sie am &Linux;-Kernel arbeiten. Weiterhin ist das Kompilieren der KDE-Bibliotheken unabhängig vom neu kompilieren des &Linux;-Kernels, während das neu kompilieren des &Linux;-Kernels nach Änderungen am Gerätetreiber sinnvoll ist, falls Header-Dateien sich geändert haben.

source: Finally, another use for sessions is if you work both on the current development version of a project, as well as on a branch: in that case, you don't want &kdevelop; to confuse classes that belong to mainline and the branch, so you'd have two sessions, with the same set of projects but from different directories (corresponding to different development branches).
de: Außerdem gibt es noch eine anderen Anwendungsfall für Sitzungen: Sofern man sowohl an der aktuellen Entwicklungsversion eines Projektes und an einem stabilen Zweig arbeitet, sollen die Klassen im Entwicklungszweig nicht mit den Klassen aus dem anderen Zweig verwechselt werden. Deshalb benutzt man in diesem Fall zwei Sitzungen, die die selben Projekte aus verschiedenen Ordnern enthalten, wobei jeweils die Ordner aus den zugehörigen Entwicklungszweigen benutzt werden.

source: Setting up a session and importing an existing project
de: Einrichtung einer Sitzung und Import eines vorhandenen Projekts

source: Let's stick with the &Linux; kernel and device driver example &mdash; you may want to substitute your own set of libraries or projects for these two examples. To create a new session that contains these two projects go to the <menuchoice><guimenu>Session</guimenu><guimenuitem>Start new session</guimenuitem></menuchoice> menu at the top left (or, if this is the first time you use &kdevelop;: simply use the default session you get on first use, which is empty).
de: Im Beispiel mit dem &Linux;-Kernel und dem Gerätetreiber können diese durch Ihre eigenen Bibliotheken und Projekte ersetzt werden. Um eine neue Sitzung für dieses Projekt zu starten, gehen sie auf <menuchoice><guimenu>Sitzung</guimenu><guimenuitem>Neue Sitzung starten</guimenuitem></menuchoice> oben links im Hauptfenster oder, benutzen Sie einfach die leere Standard-Sitzung, wenn Sie &kdevelop; zum ersten Mal benutzen.

source: We next want to populate this session with projects that for the moment we assume already exist somewhere (the case of starting projects from scratch is discussed elsewhere in this manual). For this, there are essentially two methods, depending on whether the project already is somewhere on your hard drive or whether it needs to be downloaded from a server.
de: Als nächstes soll diese Sitzung mit Projekten gefüllt werden, die bereits existieren. Das Erstellen neuer Projekte Wird an anderer Stelle in diesem Handbuch beschrieben. Für den Import existierender Projekte gibt es zwei Methoden, abhängig davon, ob das Projekt bereits auf der Festplatte ist oder ob es von einem Server heruntergeladen werden muss.

source: Option 1: Importing a project from a version control system server
de: Option 1: Import eines Projekts von einem Versionsverwaltungssystem auf einem Server

source: Let's first assume that the project we want to set up &mdash; the &Linux; kernel &mdash; resides in some version control system on a server, but that you haven't checked it out to your local hard drive yet. In this case, go to the <guilabel>Project</guilabel> menu to create the &Linux; kernel as a project inside the current session and then follow these steps:
de: Angenommen Sie wollen ein Projekt z. B. für den &Linux;-Kernel einrichten, der sich in einem Versionskontrollsystem auf einem Server befindet. Das Quelltextarchiv wurde aber noch nicht auf die lokale Festplatte heruntergeladen wurde. Gehen Sie in diesem Fall zum Menü <menuchoice>Projekt</menuchoice>, um den &Linux;-Kernel als Projekt in der aktuellen Sitzung zu erstellen. Befolgen Sie hierfür die folgenden Schritte:

source: Go to <menuchoice><guimenu>Projects</guimenu><guimenuitem>Fetch project</guimenuitem></menuchoice> to import a project
de: Wählen Sie <menuchoice><guimenu>Projekte</guimenu><guimenuitem>Projekt holen</guimenuitem></menuchoice>, um ein Projekt zu importieren

source: You then have multiple options to start a new project in the current session, depending on where the source files should come from: You can just point &kdevelop; at an existing directory (see option 2 below), or you can ask &kdevelop; to get the sources from a repository.
de: Sie haben nun verschiedene Möglichkeiten, um ein neues Projekt in der derzeitigen Sitzung zu starten, abhängig davon, wo sich die Quelltexte befinden: Sie können einfach ein vorhandenes Verzeichnis benutzen (Siehe Option 2 weiter unten), oder Sie können die Quelltexte aus einem Quelltextarchiv herunterladen.

source: Assuming you don't already have a version checked out:
de: Angenommen Sie haben noch keine Version ausgelesen:

source: In the dialog box, under <guilabel>Select the source</guilabel>, choose to use <guilabel>Subversion</guilabel>, <guilabel>Git</guilabel>, or one of the other choices
de: Wählen Sie im Dialog unter <guilabel>Quelle auswählen</guilabel> <guilabel>Subversion</guilabel>, <guilabel>Git</guilabel>, oder eine der anderen Möglichkeiten.

source: Choose a working directory as destination into which the sources should be checked out
de: Wählen Sie einen Arbeitsordner als Ziel, in den der Quelltext eingelesen werden soll.

source: Choose an URL for the location of the repository where the source files can be obtained
de: Wählen Sie eine Adresse für den Ort des Archivs, wo die Quelltextdateien geholt werden können.

source: Hit <guilabel>Get</guilabel>. This can take quite a long while; depending on the speed of your connection and the size of the project. Unfortunately, in &kdevelop; 4.2.x the progress bar does not actually show anything, but you can track progress by periodically looking at the output of the command line command <screen>du -sk <replaceable>/path/to/&kdevelop;/project</replaceable></screen> to see how much data has already been downloaded.
de: Drücken Sie auf den Knopf <guilabel>Holen</guilabel>. Das Herunterladen kann, abhängig von Ihrer Verbindungsgeschwindigkeit und der Projektgröße, eine Zeit lang dauern. Leider funktioniert die Fortschrittsanzeige in &kdevelop; nicht. Überprüfen Sie daher den Fortschritt auf der Befehlszeile von Zeit zu Zeit mit <command>du -sk <replaceable>/path/to/&kdevelop;/project</replaceable></command>, um zu sehen, wie viel bereits heruntergeladen wurde.

source: The problem with the progress bar has been reported as <ulink url="http://bugs.kde.org/show_bug.cgi?id=256832">&kdevelop; bug 256832</ulink>.
de: Das Problem mit der Fortschrittsanzeige ist als <ulink url="http://bugs.kde.org/show_bug.cgi?id=256832">&kdevelop;-Fehler 256832</ulink> berichtet worden.

source: In this process, I also get the error message <emphasis>You need to specify a valid location for the project</emphasis> which can be safely ignored.
de: Dabei wird auch die Fehlermeldung <guilabel>Sie müssen für das Projekt einen gültigen Ort angeben</guilabel> angezeigt. Diese Meldung kann ohne Probleme ignoriert werden.

source: It asks you to select a &kdevelop; project file in this directory. Since you probably don't have one yet, simply hit <guilabel>Next</guilabel>
de: Als nächstes müssen Sie im Dialog eine Projektdatei in diesem Verzeichnis auswählen. Da dort zurzeit vermutlich Projektdatei vorhanden ist, drücken Sie auf <menuchoice>Weiter</menuchoice>.

source: Hit <guilabel>Next</guilabel> again
de: Drücken Sie wieder <guilabel>Weiter</guilabel>

source: &kdevelop; will then ask you to choose a project manager. If this project uses standard &UNIX; make files, choose the custom makefile project manager
de: Sie werden jetzt aufgefordert, eine Projektverwaltung auszuwählen. Wenn dieses Projekt die normalen &UNIX;-Makefiles nutzt, wählen Sie die <guilabel>Projektverwaltung mit eigenem Makefile</guilabel>.

source: &kdevelop; will then start to parse the entire project. Again, it will take quite a while to go through all files and index classes &etc; At the bottom right of the main window, there is a progress bar that shows how long this process has come along. (If you have several processor cores, you can accelerate this process by going to the <menuchoice><guimenu>Settings</guimenu><guimenuitem>Configure &kdevelop;</guimenuitem></menuchoice> menu item, then selecting <guilabel>Background parser</guilabel> on the left, and increasing the number of threads for background parsing on the right.)
de: Nun beginnt das Einlesen des gesamten Projekts. Dies kann wieder eine Zeit lang dauern, da dafür alle Dateien und Indexklassen &etc; durchlaufen werden müssen. Unten rechts im Hauptfenster ist ein Fortschrittsbalken, der anzeigt, wie weit dieser Prozess fortgeschritten ist. Wenn Sie mehrere Prozessor-Kerne haben, können Sie diesen Prozess beschleunigen, indem sie auf <menuchoice><guimenu>Einstellungen</guimenu> <guimenuitem>&kdevelop; einrichten ...</guimenuitem></menuchoice> gehen, danach <guilabel>Hintergrund-Parser</guilabel> auf der linken Seite auswählen und dann eine erhöhte Threadzahl für den Hintergrund-Parser rechts einstellen.

source: Option 2: Importing a project that is already on your hard drive
de: Option 2: Import eines Projekts, das bereits auf Ihrer Festplatte vorhanden ist

source: Alternatively, if the project you want to work with already exists on your hard drive (for example, because you have downloaded it as a tar file from an FTP server, because you already checked out a version of the project from a version control system, or because it is your own project that exists <emphasis>only</emphasis> on your own hard drive), then use <menuchoice><guimenu>Projects</guimenu><guimenuitem>Open/Import project</guimenuitem></menuchoice> and in the dialog box choose the directory in which your project resides.
de: Sofern das Projekt, mit dem Sie arbeiten wollen, bereits auf der Festplatte existiert, beispielsweise weil Sie es von einem FTP-Server oder von einem Versionskontrollsystem heruntergeladen haben oder weil es ein eigenes Projekt ist, das <emphasis>nur</emphasis> auf ihrer Festplatte existiert, dann benutzen sie <menuchoice><guimenu>Projekt</guimenu><guimenuitem>Projekt öffnen/importieren</guimenuitem></menuchoice> und wählen Sie im Dialog den Ordner, in dem sich das Projekt befindet.

source: Setting up an application as a second project
de: Ein Programm als zweites Projekt einrichten

source: The next thing you want to do is set up other projects in the same session. In the example above, you would want to add the device driver as the second project, which you can do using exactly the same steps.
de: Als nächstes können Sie andere Projekte in die selbe Sitzung importieren. In dem obigen Beispiel könnten Sie das Projekt des Gerätetreibers als zweites Projekt importieren. Dies ist mit den selben Schritten möglich.

source: If you have multiple applications or libraries, simply repeat the steps to add more and more projects to your session.
de: Wenn sie mehrere Anwendungen oder Bibliotheken haben, wiederholen Sie diese Schritte, um weitere Projekte zur Sitzung hinzuzufügen.

source: Creating projects from scratch
de: Projekte von Grund auf neu erstellen

source: There is of course also the possibility that you want to start a new project from scratch. This can be done using the <menuchoice><guimenu>Projects</guimenu><guimenuitem>New from Template</guimenuitem></menuchoice> menu item, which presents you with a template selection dialog. Some project templates are provided with &kdevelop;, but even more are available by installing the <application>KAppTemplate</application> application. Choose the project type and programming language from the dialog, enter a name and location for you project, and click <guilabel>Next</guilabel>.
de: Natürlich gibt es auch die Möglichkeit, ein Projekt von Grund auf neu zu beginnen. Wählen Sie dazu im Menü <menuchoice><guimenu>Projekt</guimenu><guimenuitem>Neues Projekt aus Vorlage</guimenuitem></menuchoice>, dann wird ein Dialog mit Vorlagen zur Auswahl geöffnet. Einige Vorlagen sind bereits in &kdevelop; enthalten, durch Installation des Programms <application>KAppTemplate</application> erhalten Sie noch zusätzliche Vorlagen. Wählen Sie eine Projektart und eine Programmiersprache im Dialog, geben Sie einen Namen und einen Arbeitsordner für Ihr Projekt an und klicken Sie auf <guibutton>Weiter</guibutton>.
