Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/extragear-kdevelop/kdevelop.po
Languages: de

source: The second page of the dialog allows you to set up a version control system. Choose the system you wish the use, and fill in the system-specific configuration if needed. If you do not wish to use a version control system, or want to set it up manually later, choose <guilabel>None</guilabel>. When you are happy with your choice, press <guilabel>Finish</guilabel>.
de: Auf der zweiten Seite des Dialogs können Sie ein Versionsverwaltungssystem einstellen. Wählen Sie ein System aus, das Sie benutzen möchten, und geben Sie die systemspezifischen Einstellungen ein, falls erforderlich. Möchten Sie kein Versionsverwaltungssystem verwenden oder später ein System einstellen, wählen Sie <guilabel>Kein</guilabel> aus. Haben Sie alle Einstellungen vorgenommen, drücken Sie auf <guilabel>Fertigstellen</guilabel>.

source: Your project is now created, so you can try building or installing it. Some templates will include comments within the code, or even a separate README file, and it is recommended that you read those first. Then, you can start working on your project, by adding whatever features you want.
de: Sie haben jetzt ein Projekt erzeugt und können versuchen, es zu erstellen oder zu installieren. Einige Vorlagen enthalten Kommentare im Quelltext, oder möglicherweise sogar eine eigenen Datei README. Es wird empfohlen, diese Kommentare oder Dateien zuerst zu lesen. Dann können Sie mit der Arbeit an Ihrem Projekt beginnen.

source: Working with source code
de: Arbeiten mit Quelltext

source: Besides debugging, reading through and writing source code is what you will spend the most time with when developing software. To this end, &kdevelop; offers you many many different ways to explore source codes and to make writing it more productive. As discussed in more detail in the following sections, &kdevelop; is not just a source editor &mdash; rather, it is a source management system that gives you different views of extracted information on the files that collectively make up your session's source code.
de: Neben der Fehlersuche verbringen Sie am meisten Zeit mit dem Lesen und Schreiben von Quelltext bei der Softwareentwicklung. Dafür gibt es in &kdevelop; sehr viele verschiedene Wege, um Quelltext zu untersuchen und das Schreiben von Quelltext produktiver zu machen. Wie in den folgenden Abschnitten beschrieben wird, ist &kdevelop; nicht nur ein Quelltexteditor. Es ist vielmehr ein Verwaltungssystem für Quelltext, das Ihnen verschiedene Ansichten auf die extrahierten Informationen aus den Dateien gibt, die zusammen den Quelltext ihrer Sitzung bilden.

source: Tools and views
de: Werkzeuge und Ansichten

source: In order to work with projects, &kdevelop; has the concept of <emphasis>tools</emphasis>. A tool provides a particular view of the source, or an action that can be taken with it. Tools are represented by buttons around the perimeter of your window (in vertical text along the left and right margins, or horizontally along the bottom margin). If you click on them, they expand to a subwindow &mdash; a <emphasis>view</emphasis> &mdash; within the main window; if you click on the tool button again, the subwindow disappears again.
de: Für die Arbeit mit Projekten verwendet &kdevelop; das Konzept der <emphasis>Werkzeuge</emphasis>. Ein Werkzeug bietet eine bestimmte Ansicht auf den Quelltext oder eine Aktion, die damit durchgeführt werden kann. Werkzeuge werden durch einen Knopf am Rand des Hauptfensters dargestellt, mit senkrechter Textausrichtung auf dem linken und rechten Rand sowie waagerechtem Text am unteren Rand. Wenn Sie darauf klicken, öffnen Sie eine <emphasis>Ansicht</emphasis> in einem Unterfenster im Hauptfenster. Wenn Sie erneut auf den Knopf klicken, wird das Unterfenster wieder ausgeblendet.

source: To make a subwindow disappear, you can also click at the <guilabel>x</guilabel> at the top right of the subwindow
de: Um ein Unterfenster auszublenden, können Sie auch auf das Symbol <guiicon>x</guiicon> oben rechts im Unterfenster klicken

source: The picture above shows a particular selection of tools, aligned on the left and right margins; in the picture, the <guilabel>Classes</guilabel> tool is open on the left and the <guilabel>Snippets</guilabel> tool on the right, along with an editor for a source file in the middle. In practice, most of the time you will probably only have the editor and maybe the <guilabel>Classes</guilabel> or <guilabel>Code Browser</guilabel> tool open at the left. Other tool view will likely only be open temporarily as you use the tool, leaving more space for the editor most of the time.
de: Das oben stehende Bild zeigt eine Auswahl von Werkzeugenansicht, ausgerichtet am rechten und linken Rand. In dem Bild ist die Werkzeugansicht <guilabel>Klassen</guilabel> auf der linken Seite und die Werkzeugansicht <guilabel>Textbausteine</guilabel> auf der rechten Seite geöffnet, gemeinsam mit einem Editor für eine Quelltextdatei in der Mitte. In der Praxis werden Sie die meiste Zeit nur den Editor und vielleicht die Werkzeugansichten <guilabel>Klassen</guilabel> oder <guilabel>Quelltext-Browser</guilabel> geöffnet haben. Andere Werkzeugansichten werden vermutlich nur zeitweise geöffnet sein sein, so dass Sie die meiste Zeit mehr Platz für den Editor haben.

source: When you run &kdevelop; the first time, you should already have the <guilabel>Projects</guilabel> tool button. Click on it: it will open a subwindow that shows the projects you have added to the session at the bottom, and a file system view of the directories of your projects at the top.
de: Wenn Sie &kdevelop; zum ersten mal ausführen, sollten Sie bereits den Knopf für die Werkzeugansicht <guilabel>Projekte</guilabel> sehen. Klicken Sie darauf und es öffnet sich ein Unterfenster, das unten alle Projekte, die Sie zur Sitzung hinzugefügt haben, und oben eine Ansicht des Dateisystems der Ordner ihrer Projekte anzeigt.

source: There are many other tools you can use with &kdevelop;, not all of which are initially present as buttons on the perimeter. To add some, go to the <menuchoice><guimenu>Windows</guimenu><guimenuitem>Add tool view</guimenuitem></menuchoice> menu entry. Here are some that you will likely find useful:
de: Es gibt viele andere Werkzeuge, die Sie mit &kdevelop; benutzen können. Nicht alle sind anfangs durch Knöpfe an der Seite vorhanden. Um Werkzeuge hinzuzufügen, verwenden Sie den Menüeintrag <menuchoice><guimenu>Fenster</guimenu><guimenuitem>Werkzeugansicht hinzufügen</guimenuitem></menuchoice>. Es folgt eine Liste mit Werkzeugansichten, die Sie möglicherweise nützlich finden:

source: <guilabel>Classes</guilabel>: A complete list of all classes that are defined in one of the projects or your session with all of their member functions and variables. Clicking on any of the members opens a source editor window at the location of the item you clicked on.
de: <guilabel>Klassen</guilabel>: Eine vollständige Liste aller Klassen, die in einem der Projekte oder der Sitzung definiert sind, sowie deren Funktionen und Variablen. Das Klicken auf irgendein Objekt öffnet ein Fenster des Quelltexteditors mit diesen Objekt.

source: <guilabel>Documents</guilabel>: Lists some of the more recently visited files, by kind (&eg; source files, patch files, plain text documents).
de: <guilabel>Dokumente</guilabel>: Zeigt eine Liste der zuletzt geöffneten Dateien, geordnet nach Art, &eg; Quelltextdatei, Patchdatei, einfache Textdokumente.

source: <guilabel>Code Browser</guilabel>: Depending on your cursor position in a file, this tool shows things that are related. For example, if you are on an <varname>#include</varname> line, it shows information about the file you are including such as what classes are declared in that file; if you are on an empty line at file scope, it shows the classes and functions declared and defined in the current file (all as links: clicking on them brings you to the point in the file where the declaration or definition actually is); if you are in a function definition, it shows where the declaration is and offers a list of places where the function is used.
de: <guilabel>Quelltext-Browser</guilabel>: Abhängig von der derzeitigen Cursorposition in einer Datei werden Informationen bezogen auf diese Position angezeigt. Wenn der Cursor beispielsweise in einer <code>#include</code>-Zeile steht, dann werden Informationen über die Datei, die hier eingebunden wird, wie die in der Datei deklarierten Klassen angezeigt. In einer leeren Zeile im Gültigkeitsbereich von Dateien werden Verknüpfungen auf die Klassen und Funktionen angezeigt, die in der aktuellen Datei deklariert und definiert sind. Klicken Sie auf eine dieser Verknüpfungen, dann gehen Sie an den Ort in der Datei, an dem die Deklaration oder die Definition tatsächlich ist. Steht der Cursor in einer Funktionsdefinition sind, dann zeigt der <guilabel>Quelltext-Browser</guilabel> den Ort der Deklaration und eine Liste von Orten, an denen die Funktion benutzt wird.

source: <guilabel>File system</guilabel>: Shows you a tree view of the file system.
de: <guilabel>Dateisystem</guilabel>: Zeigt eine Baumansicht des Dateisystems.

source: <guilabel>Documentation</guilabel>: Allows you to search for man pages and other help documents.
de: <guilabel>Dokumentation</guilabel>: Ermöglicht die Suche nach Handbuchseiten und anderen Hilfedokumenten.

source: <guilabel>Snippets</guilabel>: This provides sequences of text that one uses over an over and doesn't want to write every time. For example, in the project from which the picture above was created, there is a frequent need to write code like
de: <guilabel>Textbausteine</guilabel>: Dies sind Textfolgen, die immer wieder benutzt werden und die Sie nicht jedes mal neu schreiben möchten. In dem Projekt, von dem das Bildschirmfoto oben erstellt wurde, wird der folgende Quelltext häufig benötigt:

source: This is an awkward expression but it will look almost exactly like this every time you need such a loop &mdash; which would make it a good candidate for a snippet.
de: Dies ist ein seltsam aussehender Ausdruck, aber er sieht beinahe so aus wie die Schleife, die man häufiger benötigen würde. Dies macht es zu einem guten Kandidat für einen Textbaustein.

source: <guilabel>Konsole</guilabel>: Opens a command line window inside &kdevelop;'s main window, for the occasional command you may want to enter (&eg; to run <varname>./configure</varname>).
de: <guilabel>Konsole</guilabel>: Öffnet ein Befehlszeilenfenster im Hautfenster von &kdevelop;. Darin können Sie Befehle wie zum Beispiel <varname>./configure</varname> eingeben.

source: A complete list of tools and views is given <ulink url="http://userbase.kde.org/Special:myLanguage/KDevelop4/Manual/Tool list">here</ulink>.
de: Eine vollständige Liste aller Werkzeuge und Ansichten finden Sie auf der <ulink url="http://userbase.kde.org/Special:myLanguage/KDevelop4/Manual/Tool list">Userbase</ulink>.

source: For many programmers, vertical screen space is the most important. To this end, you can arrange your tool views at the left and right margin of the window: to move a tool, click on its symbol with the right mouse button and select a new position for it.
de: Für die meisten Programmierer ist vertikaler Platz das Wichtigste. Um vertikalen Platz zu gewinnen, können Sie ihre Werkzeugansichten am rechten und linken Rand des Fensters anordnen: Dazu klicken Sie auf das Symbol des Werkzeugs mit der rechten Maustaste und wählen Sie eine neue Position für das Werkzeug.

source: Exploring source code
de: Quelltext untersuchen

source: Local information
de: Lokale Informationen

source: &kdevelop; <emphasis>understands</emphasis> source code, and as a consequence it is really good at providing you information about variables or functions that may appear in your program. For example, here is a snapshot of working with a piece of code and hovering the mouse over the symbol <varname>cell</varname> in line 1316 (if you are working keyboard oriented, you can achieve the same effect by holding down the &Alt; key for a while):
de: &kdevelop; <emphasis>interpretiert</emphasis> Quelltext und kann daher umfassende Informationen über Variablen und Funktionen im Programm bereitstellen. Hier sehen Sie im Bildschirmfoto ein Beispiel vom Arbeiten mit einem Quelltextteil und dem Mauszeiger über dem Symbol <code>cell</code> in Zeile 1316. Wenn Sie mit der Tastatur arbeiten, können Sie denselben Effekt erreichen, wenn sie die &Alt;-Taste eine Zeit lang gedrückt halten.

source: &kdevelop; shows me a tooltip that includes the type of the variable (here: <varname>DoFHandler&lt;dim&gt;active_cell_iterator</varname>), where this variable is declared (the <emphasis>container</emphasis>, which here is the surrounding function <varname>get_maximal_velocity</varname> since it is a local variable), what it is (a variable, not a function, class or namespace) and where it is declared (in line 1314, just a few lines up in the code).
de: &kdevelop; zeigt eine Kurzinfo mit dem Typ der Variablen (<varname>DoFHandler&lt;dim&gt;active_cell_iterator</varname>), die Stelle, an der die Variable deklariert ist (der <emphasis>Container</emphasis> ist hier die umgebende Funktion <varname>get_maximal_velocity</varname>, weil es eine lokale Variable ist), was es ist (eine Variable, keine Funktion, keine Klasse und kein Namensraum) und wo die Variable deklariert ist (in Zeile 1314, nur ein paar Zeilen darüber im Quelltext).

source: In the current context, the symbol over which the mouse was hovering has no associated documentation. In this example, had the mouse hovered over the symbol <varname>get_this_mpi_process</varname> in line 1318, the outcome would have been this:
de: In dem aktuellen Kontext hatte das Symbol, auf dem die Maus platziert war, keine zugehörige Dokumentation. In diesem Beispiel würde das Platzieren der Maus auf <code>get_this_mpi_process</code> in Zeile 1318 das folgende Ergebnis liefern:

source: Here, &kdevelop; has cross-referenced the declaration from an entirely different file (<filename>utilities.h</filename>, which in fact even resides in a different project of the same session) together with the doxygen-style comment that accompanies the declaration there.
de: Hier hat &kdevelop; eine Kreuzreferenz der Deklaration einer völlig anderen Datei namens <code>utilities.h</code>, die sogar in einem anderen Projekt in derselben Sitzung ist, erstellt, zusammen mit dem Kommentar im Doxygen-Stil passend zur Deklaration.

source: What makes these tooltips even more useful is that they are dynamic: I can click on the container to get information about the context in which the variable is declared (&ie; about the namespace <varname>System</varname>, such as where it is declared, defined, used, or what its documentation is) and I can click on the blue links that will reset the cursor position to the location of the declaration of the Symbol (&eg; in <varname>utilities.h</varname>, line 289) or give me a list of places where this symbol is used in the current file or throughout all the projects of the current session. The latter is often useful if you want to explore how, for example, a particular function is used in a large code basis.
de: Die Dynamik macht die Kurzinfos noch nützlicher: Sie können auf den Container klicken, um Informationen über den Kontext, in dem die Variable deklariert ist, zu erhalten, &ie; über den Namensraum <varname>System</varname>, wie die Variable dort deklariert, definiert oder benutzt ist und wie sie dokumentiert ist. Sie können außerdem auf die blauen Verknüpfungen klicken, um den Cursor auf die Position der Deklaration des Symbols zu setzen, &eg; in <varname>utilities.h</varname> Zeile 289. Außerdem können Sie sich eine Liste von Stellen anzeigen lassen, an denen das Symbol in der aktuellen Datei, im gesamten Projekt oder der derzeitigen Sitzung genutzt wird. Letzteres ist oft nützlich, wenn Sie herausfinden wollen, wie eine Funktion in einer großen Quelltextmenge verwendet wird

source: The information in a tooltip is fleeting &mdash; it depends on you holding the &Alt; key down or hovering your mouse. If you want a more permanent place for it, open the <guilabel>Code Browser</guilabel> tool view in one of the sub-windows. For example, here the cursor is on the same function as in the example above, and the tool view on the left presents the same kind of information as in the tooltip before:
de: Die Information in der Kurzinfo ist variabel &mdash; sie hängt davon ab, ob Sie die &Alt;-Taste drücken oder ob Sie den Mauszeiger auf ein Objekt führen. Wenn Sie die Kurzinfo dauerhaft anzeigen wollen, dann öffnen Sie den <guilabel>Quelltext-Browser</guilabel> in einem der Unterfenster. Beispielsweise ist hier der Cursor auf der selben Funktion wie im obigen Beispiel, und die Werkzeugansicht auf der linken Seite zeigt die selben Informationen wie in der vorherigen Kurzinfo.

source: Moving the cursor around on the right changes the information presented on the left. What's more, clicking on the <guilabel>Lock current view</guilabel> button at the top right allows you to lock this information, making it independent of the cursor movement while you explore the information presented there.
de: Das Bewegen des Cursors auf der rechten Seite verändert die Informationen, die auf der linken Seite gezeigt werden. Weiterhin können Sie auf den Knopf <guilabel>Aktuelle Ansicht sperren</guilabel> oben rechts im Unterfenster klicken, um die aktuellen Informationen beizubehalten. Dadurch wird die angezeigte Informationen unabhängig von der Cursor-Bewegung.

source: This sort of context information is available in many other places in &kdevelop;, not just in the source editor. For example, holding down the &Alt; key in a completion list (&eg; when doing a quick-open) also yields context information about the current symbol.
de: Diese Art von Informationen ist an vielen anderen Orten in &kdevelop; verfügbar, nicht nur im Quelltexteditor. Beispielsweise liefert das Drücken der Taste &Alt; in der Vervollständigungsliste, &eg; beim Schnellöffnen, auch Kontextinformationen über das aktuelle Symbol.

source: File scope information
de: Information im Gültigkeitsbereich von Dateien

source: The next level up is to obtain information about the entire source file you are currently working on. To this end, position the cursor at file scope in the current file and look at the what the <guilabel>Code Browser</guilabel> tool view shows:
de: Die nächste Stufe ist, Informationen über die gesamte Quelltextdatei einzuholen, an der Sie gerade arbeiten. Dazu positionieren Sie den Cursor im Dateibereich der aktuellen Datei und schauen Sie, was der <guilabel>Quelltext-Browser</guilabel> anzeigt:

source: Here, it shows a list of namespaces, classes and functions declared or defined in the current file, giving you an overview of what's happening in this file and a means to jump directly to any of these declarations or definitions without scrolling up and down in the file or searching for a particular symbol.
de: Hier wird eine Liste von Namensräumen, Klassen und Funktionen angezeigt, die in der aktuellen Datei deklariert oder definiert sind. So erhalten Sie einen Überblick über den Inhalt dieser Datei und eine Möglichkeit, direkt zu irgendeiner dieser Deklarationen und Definitionen zu springen, ohne in der Datei hoch und runter zu blättern oder nach einem bestimmten Symbol zu suchen.

source: The information shown for file scope is the same as presented in the <quote>Outline</quote> mode discussed below for navigating source code; the difference is that outline mode is only a temporary tooltip.
de: Die angezeigte Information im Gültigkeitsbereich von Dateien wird wie im Modus <quote>Funktions-Kurzinfo</quote> angezeigt, der im nächsten Kapitel über das Navigieren im Quelltext erläutert wird. Der Unterschied besteht nur darin, dass im Modus <quote>Funktions-Kurzinfo</quote> die Informationen nur temporär angezeigt werden.

source: Project and session scope information
de: Informationen über den Gültigkeitsbereich in Projekt und Sitzung

source: There are many ways to obtain information about an entire project (or, in fact, about all projects in a session). This sort of information is typically provided through various tool views. For example, the <guilabel>Classes</guilabel> tool view provides a tree structure of all classes and surrounding namespaces for all projects in a session, together with the member functions and variables of each of these classes:
de: Es gibt viele Wege um an Informationen über ein gesamtes Projekt oder über alle Projekte einer Sitzung zu erhalten. Diese Art von Informationen wird typischerweise durch verschiedene Ansichten angeboten. Beispielsweise bietet die Werkzeugansicht <guilabel>Klassen</guilabel> eine Baumstruktur aller Klassen und umgebenden Namensräume für alle Projekte in einer Sitzung, gemeinsam mit den Funktionen und Variablen von jeder dieser Klassen:

source: Hovering over an entry provides again information about the symbol, its location of declaration and definition, and its uses. Double-clicking on an entry in this tree view opens an editor window at the location where the symbol is declared or defined.
de: Wenn Sie den Mauszeiger auf einen Eintrag führen, werden Ihnen Informationen über den Eintrag, den Ort seiner Deklaration und Definition und seine Verwendungen angezeigt. Ein Doppelklick auf den Eintrag in dieser Baumansicht öffnet ein Editorfenster an der Stelle, an der das Symbol deklariert und definiert ist.

source: But there are other ways of looking at global information. For example, the <guilabel>Documents</guilabel> tool provides a view of a project in terms of the kinds of files or other documents this project is comprised of:
de: Außerdem gibt es noch andere Arten, sich globale Informationen anzusehen. Beispielsweise liefert die Werkzeugansicht <guilabel>Dokumente</guilabel> eine Ansicht aller Dateitypen und andere Dokumente des Projekts:

source: Rainbow color highlighting explained
de: Informationen zu den Farben bei der Hervorhebung

source: <application>KDevelop</application> uses a variety of colors to highlight different objects in source code. If you know what the different colors mean, you can very quickly extract a lot of information from source code just by looking at the colors, without reading a single character. The highlighting rules are as follows:
de: &kdevelop; verwendet eine große Zahl von verschiedenen Farben, um unterschiedliche Objekte im Quelltext hervorzuheben. Kennen Sie die Bedeutung der verschiedenen Farben, dann können Sie schnell viele Informationen aus dem Quelltext nur aus den Farben gewinnen, ohne ein einzelnes Zeichen zu lesen. Es gibt folgende Regeln zur farbigen Hervorhebung:

source: Objects of type Class / Struct, Enum (the values and the type), (global) functions, and class members each have their own color assigned (classes are green, enums are dark red, and members are dark yellow or violet, (global) functions are always violet).
de: Objekte vom Typ Class / Struct, Enum (Werte und Typ), (globale) Funktionen und Klassen-Member ist jeweils eine eigene Farbe zu geordnet. Klassen werden grün, Enum in dunkelrot und Member in dunkelgelb oder violett, (globale) Funktionen immer in violett angezeigt.

source: All global variables are colored in dark green.
de: Alle globalen Variablen werden in dunkelgrüner Farbe angezeigt.

source: Identifiers which are typedefs for another type are colored in teal.
de: Bezeichner, die Typdefinitionen für andere Typen sind, werden in türkis eingefärbt.

source: All declarations and definitions of objects are in bold.
de: Alle Deklarationen und Definitionen von Objekten sind fett gedruckt.
