Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/extragear-kdevelop/kdevelop.po
Languages: de

source: If a member is accessed from within the context where it is defined (base or derived class) it appears in yellow, otherwise it appears in violet.
de: Wenn auf ein Member im Kontext, in dem es definiert ist, also Basisklasse oder abgeleitete Klasse, zugegriffen wird, erscheint es in Gelb, ansonsten in Violett.

source: If a member is private or protected, it gets colored in a slightly darker color when used.
de: Ist ein Member „private“ oder „protected“, wird es beim Benutzen in etwas dunklere Farbe angezeigt.

source: For variables local to a function body scope, rainbow colors are picked based on a hash of the identifier. This includes the parameters to the function. An identifier always will have the same color within its scope (but the same identifier will get a different color if it represents a different object, &ie; if it is redefined in a more nested scope), and you will usually get the same color for the same identifier name in different scopes. Thus, if you have multiple functions taking parameters with the same names, the arguments will all look the same color-wise. These rainbow colors can be turned off separately from the global coloring in the settings dialog.
de: Lokale Variablen im Gültigkeitsbereich einer Funktion werden in Regenbogenfarben auf der Basis des Hash-Werts des Bezeichners eingefärbt. Ein Bezeichner erhält in einem Gültigkeitsbereich immer die gleiche Farbe, aber der gleiche Bezeichner erhält eine andere Farbe, wenn er ein anderes Objekt repräsentiert, &ie; wenn der Bezeichner in einem untergeordneten Gültigkeitsbereich neu definiert wurde. Ein Bezeichner erhält normalerweise die gleiche Farbe bei gleichem Namen in verschiedenen Gültigkeitsbereichen. Wenn Sie also mehrere Funktionen mit Parametern mit dem gleichen Namen haben, werden alle Argumente in der gleichen Farbe angezeigt. Diese Regenbogenfarben können getrennt von der globalen Einfärbung im Einrichtungsdialog abgeschaltet werden.

source: Identifiers for which &kdevelop; could not determine the corresponding declaration are colored in white. This can sometimes be caused by missing <varname>#include</varname> directives.
de: Bezeichner, für die &kdevelop; die zugehörige Deklaration nicht ermitteln kann, werden in Weiß dargestellt. Dies kann manchmal an fehlenden <varname>#include</varname>-Direktiven liegen.

source: In addition to that coloring, the normal editor syntax highlighting will be applied, as known from &kate;. &kdevelop;'s semantic highlighting will always override the editor highlighting if there is a conflict.
de: Zusätzlich zu dieser Färbung wird die normale Syntax-Hervorhebung des Editors von &kate; angewendet. Die semantische Hervorhebung von &kdevelop; überschreibt immer die Hervorhebung des Editors, falls es einen Konflikt gibt.

source: Navigating in source code
de: Navigieren im Quelltext

source: In the previous section, we have discussed exploring source code, &ie; getting information about symbols, files and projects. The next step is then to jump around your source base, &ie; to navigate in it. There are again various levels at which this is possible: local, within a file, and within a project.
de: Im vorherigen Abschnitt wurden die Untersuchung von Quelltexten erläutert, &ie; wie Sie Informationen über Symbole, Dateien und Projekte erhalten. Der nächste Schritt ist die Navigation im Quelltext. Dies ist auf verschiedenen Ebenen möglich: lokal, in einer Datei und in einem Projekt.

source: Many of the ways to navigate through code are accessible from the <guilabel>Navigate</guilabel> menu in the &kdevelop; main window.
de: Viele Möglichkeiten zum Navigieren im Quelltext finden Sie im Menü <guilabel>Navigation</guilabel> im Hauptfenster von &kdevelop;.

source: Local navigation
de: Lokale Navigation

source: &kdevelop; is much more than an editor, but it is <emphasis>also</emphasis> a source editor. As such, you can of course move the cursor up, down, left or right in a source file. You can also use the <keycap>PageUp</keycap> and <keycap>PageDown</keycap> keys, and all the other commands you are used from any useful editor.
de: &kdevelop; ist viel mehr als ein Editor, aber es ist <emphasis>auch</emphasis> ein Quelltexteditor. Deshalb können Sie den Cursor hoch, runter, links und rechts in einer Quelltextdatei bewegen, die Tasten <keycap>Bild auf</keycap> und <keycap>Bild ab</keycap> benutzen und andere Befehle, die Sie von einem Editor gewohnt sind.

source: File scope navigation and outline mode
de: Navigation im Dateibereich und Funktions-Kurzinfos

source: At the file scope, &kdevelop; offers many possible ways to navigate through source code. For example:
de: Im Gültigkeitsbereich von Dateien bietet &kdevelop; viele verschiedene mögliche Wege um durch Quelltext zu navigieren. Beispielsweise:

source: <guilabel>Outline</guilabel>: You can get an outline of what's in the current file in at least three different ways:
de: <guilabel>Funktions-Kurzinfo</guilabel>: Sie können eine Kurzinformation über den Inhalt der aktuellen Datei auf drei Arten erhalten:

source: Clicking into the <guilabel>Outline</guilabel> textbox at the top right of the main window, or hitting <keycombo>&Alt;&Ctrl;<keycap>N</keycap></keycombo> opens a drop-down menu that lists all function and class declarations: <screenshot> <screeninfo></screeninfo> <mediaobject> <imageobject> <imagedata fileref="kdevelop-19.png" format="PNG"/> </imageobject> <textobject> <phrase></phrase> </textobject> <caption> <para></para> </caption> </mediaobject> </screenshot> You can then just select which one to jump to, or &mdash; if there are a lot &mdash; start typing any text that may appear in the names shown; in that case, as you keep typing, the list becomes smaller and smaller as names are removed that don't match the text already typed until you are ready to select one of the choices.
de: Klicken Sie in das Textfeld <guilabel>Funktions-Kurzinfo</guilabel> oben rechts im Hauptfenster, oder drücken Sie <keycombo>&Alt;&Ctrl;<keycap>N</keycap></keycombo>. Anschließend öffnet sich ein Auswahlfeld, das alle Funktionen und Klassendeklarationen auflistet: <screenshot> <screeninfo></screeninfo> <mediaobject> <imageobject> <imagedata fileref="kdevelop-19.png" format="PNG"/> </imageobject> <textobject> <phrase></phrase> </textobject> <caption> <para></para> </caption> </mediaobject> </screenshot> Sie können dann auswählen, zu welchem Eintrag Sie gehen möchten, oder falls es viele Einträge vorhanden sind, mit der Eingabe von Text beginnen. In diesem Fall wird die Liste beim Schreiben immer kürzer, da Namen entfernt werden, die zu der vorhandenen Eingabe nicht mehr passen.

source: Positioning the cursor at file scope (&ie; outside any function or class declarations or definitions) and having the <guilabel>Code Browser</guilabel> tool open: <screenshot> <screeninfo></screeninfo> <mediaobject> <imageobject> <imagedata fileref="kdevelop-16.png" format="PNG"/> </imageobject> <textobject> <phrase></phrase> </textobject> <caption> <para></para> </caption> </mediaobject> </screenshot> This also provides you an outline of what is happening in the current file, and allows you to select where you want to jump to.
de: Positionieren Sie den Cursor im Gültigkeitsbereich einer Datei, &ie; außerhalb einer Funktions- oder Klassendeklaration oder -definition, und der <guilabel>Quelltext-Browser</guilabel> ist geöffnet: <screenshot> <screeninfo></screeninfo> <mediaobject> <imageobject> <imagedata fileref="kdevelop-16.png" format="PNG"/> </imageobject> <textobject> <phrase></phrase> </textobject> <caption> <para></para> </caption> </mediaobject> </screenshot> Dies zeigt ihnen eine Funktions-Kurzinfo der aktuellen Datei an und Sie können auswählen, wohin Sie gehen möchten.

source: Hovering the mouse over the tab for one of the open files also yields an outline of the file in that tab.
de: Wenn Sie mit der Maus über einen Karteireiter einer geöffneten Datei fahren, erhalten Sie auch eine Funktions-Kurzinfo der Datei in dem Unterfenster.

source: Source files are organized as a list of function declarations or definitions. Hitting <keycombo>&Alt;&Ctrl;<keycap>PgUp</keycap></keycombo> and <keycombo>&Alt;&Ctrl;<keycap>PgDown</keycap></keycombo> jumps to the previous or next function definition in this file.
de: Quelltextdateien sind in einer Liste als Funktionsdeklarationen oder -definitionen organisiert. Das Drücken von <keycombo>&Alt;&Ctrl;<keycap>Bild auf</keycap></keycombo> und <keycombo>&Alt;&Ctrl;<keycap>Bild ab</keycap></keycombo> springt zur vorherigen oder zur nächsten Funktionsdefinition in dieser Datei.

source: Project and session scope navigation: Semantic navigation
de: Navigation im Gültigkeitsbereich von Projekt und Sitzung: Semantische Navigation

source: <guilabel>Quick open</guilabel>: A very powerful way of jumping to other files or locations is to use the various <emphasis>quick open</emphasis> methods in &kdevelop;. There are four versions of these:
de: <guilabel>Schnellöffner</guilabel>: Eine sehr leistungsfähige Art, um schnell zu anderen Dateien und Orten zu gehen, sind die verschiedenen Methoden zum <emphasis>schnellen Öffnen</emphasis> in &kdevelop;. Es gibt dazu vier Möglichkeiten:

source: <guilabel>Quick open class</guilabel> (<menuchoice><guimenu>Navigate</guimenu><guimenuitem>Quick open class</guimenuitem></menuchoice> or <keycombo>&Alt;&Ctrl;<keycap>C</keycap></keycombo>): You will get a list of all classes in this session. Start typing (a part of) the name of a class and the list will continue to whittle down to only those that actually match what you've typed so far. If the list is short enough, select an element using the up and down keys and &kdevelop; will get you to the place where the class is declared.
de: <menuchoice><guimenu>Navigation</guimenu><guimenuitem>Schnellöffner für Klassen</guimenuitem></menuchoice> oder <keycombo>&Alt;&Ctrl;<keycap>C</keycap></keycombo>): Es wird eine Sitzung aller Klassen in dieser Sitzung angezeigt. Geben Sie Teile des Namens einer Klasse ein, enthält die Liste nur noch Einträge mit Namen, die den bisher eingegebenen Text enthalten. Haben Sie den Umfang der Liste durch Ihre Eingabe weit genug verringert, wählen Sie mit den Pfeiltasten oder der &LMBn; einen Eintrag aus und der Cursor geht zur ausgewählten Klassendeklaration.

source: <guilabel>Quick open function</guilabel> (<menuchoice><guimenu>Navigate</guimenu><guimenuitem>Quick open function</guimenuitem></menuchoice> or <keycombo>&Alt;&Ctrl;<keycap>M</keycap></keycombo>): You will get a list of all (member) functions that are part of the projects in the current session, and you can select from it in the same way as above. Note that this list may include both function declarations and definitions.
de: <menuchoice><guimenu>Navigation</guimenu><guimenuitem>Schnellöffner für Funktionen</guimenuitem></menuchoice> oder <keycombo>&Alt;&Ctrl;<keycap>M</keycap></keycombo>): Es wird eine Liste mit allen Member-Funkionen des Projekts in der aktuellen Sitzung angezeigt und Sie können einen Eintrag wie vorher auswählen. Diese Liste zeigt sowohl Deklarationen als auch Definitionen.

source: <guilabel>Quick open file</guilabel> (<menuchoice><guimenu>Navigate</guimenu><guimenuitem>Quick open file</guimenuitem></menuchoice> or <keycombo>&Alt;&Ctrl;<keycap>O</keycap></keycombo>): You will get a list of all files that are part of the projects in the current session, and you can select from it in the same way as above.
de: <menuchoice><guimenu>Navigation</guimenu><guimenuitem>Schnellöffner für Dateien</guimenuitem></menuchoice> oder <keycombo>&Alt;&Ctrl;<keycap>O</keycap></keycombo>): Es wird eine Liste mit allen Dateien des Projekts in der aktuellen Sitzung angezeigt und Sie können einen Eintrag wie vorher auswählen.

source: <guilabel>Universal quick open</guilabel> (<menuchoice><guimenu>Navigate</guimenu><guimenuitem>Quick open</guimenuitem></menuchoice> or <keycombo>&Alt;&Ctrl;<keycap>Q</keycap></keycombo>): If you forget which key combination is bound to which of the above commands, this is the universal swiss army knife &mdash; it simply presents you with a combined list of all files, functions, classes, and other things from which you can select.
de: <menuchoice><guimenu>Navigation</guimenu><guimenuitem>Schnellöffner</guimenuitem></menuchoice> oder <keycombo>&Alt;&Ctrl;<keycap>Q</keycap></keycombo>): Erinnern Sie sich nicht mehr an die vorher genannten Kurzbefehle, dann erhalten Sie mit dieser Funktion eine Liste aus allen Dateien, Funktionen und Klassen, aus denen Sie einen Eintrag auswählen können.

source: <guilabel>Jump to declaration/definition</guilabel>: When implementing a (member) function, one often needs to switch back to the point where a function is declared, for example to keep the list of function arguments synchronised between declaration and definition, or to update the documentation. To do so, place the cursor onto the function name and select <menuchoice><guimenu>Navigation</guimenu><guimenuitem>Jump to declaration</guimenuitem></menuchoice> (or hit <keycombo>&Ctrl;<keycap>.</keycap></keycombo>) to get to the place where the function is declared. There are multiple ways to get back to the original place:
de: <guilabel>Gehe zur Deklaration/Definition</guilabel>. Bei der Implementierung einer Member-Funktion müssen Sie of zur Stelle zurückgehen, an dem die Funktion deklariert wurde, damit zum Beispiel die Liste der Funktionsargumente zwischen Deklaration und Definition abgeglichen wird oder um die Dokumentation zu aktualisieren. Platzieren Sie dazu den Cursor auf den Namen einer Funktion und wählen Sie <menuchoice><guimenu>Navigation</guimenu><guimenuitem>Gehe zur Deklaration</guimenuitem></menuchoice> oder den Kurzbefehl <keycombo>&Ctrl;<keycap>.</keycap></keycombo>, dann springen Sie zur Stelle, an der die Funktion deklariert wurde. Es gibt mehrere Möglichkeiten, um zur ursprünglichen Stelle zurückzugehen:

source: Selecting <menuchoice><guimenu>Navigation</guimenu><guimenuitem>Jump to definition</guimenuitem></menuchoice> (or hitting <keycombo>&Ctrl;<keycap>,</keycap></keycombo>).
de: Wählen Sie <menuchoice><guimenu>Navigation</guimenu><guimenuitem>Gehe zur Definition</guimenuitem></menuchoice> oder benutzen Sie den Kurzbefehl <keycombo>&Ctrl;<keycap>,</keycap></keycombo>.

source: Selecting <menuchoice><guimenu>Navigation</guimenu><guimenuitem>Previous visited context</guimenuitem></menuchoice> (or hit <keycombo><keycap>Meta</keycap><keycap>Left</keycap></keycombo>), as described below.
de: Wählen Sie <menuchoice><guimenu>Navigation</guimenu><guimenuitem>Zuvor betrachteter Kontext</guimenuitem></menuchoice> oder benutzen Sie den Kurzbefehl <keycombo>Meta<keycap>.</keycap></keycombo>, wie weiter unten beschrieben.

source: Jumping to the declaration of a symbol is something that does not only work when placing the cursor on the name of the function you are currently implementing. Rather, it also works for other symbols: Putting the cursor on a (local, global, or member) variable and jumping to its declaration also transports you to its location of declaration. Similarly, you can place the cursor on the name of a class, for example in a variable of function declaration, and jump to the location of its declaration.
de: Es ist nicht nur möglich, zur Deklaration eines Symbols zu gehen, wenn der Cursor auf dem Namen der Funktion steht, die Sie gerade implementieren. Dies funktioniert auch für andere Symbole: Setzen Sie den Cursor auf eine lokalem globale oder Member-Variable, dann können Sie mit dieser Aktion auch zu deren Deklaration gehen. Genauso können Sie den Cursor auf den Namen einer Klasse setzten, zum Beispiel auf eine Variable in einer Funktionsdeklaration und dann zu der Deklaration der Klasse gehen.

source: <guilabel>Switch between declaration/definition</guilabel>: In the example above, to jump to the site of the declaration of the current function, you need to first place the cursor on the function name. To avoid this step, you can select <menuchoice><guimenu>Navigation</guimenu><guimenuitem>Switch definition/declaration</guimenuitem></menuchoice> (or hit <keycombo>&Shift;&Ctrl;<keycap>C</keycap></keycombo>) to jump to the declaration of the function within which the cursor currently is. Selecting the same menu entry a second time transports you back to the place where the function is defined.
de: <guilabel>Zwischen Definition/Deklaration wechseln</guilabel>: Im oben gezeigten Beispiel müssen Sie zuerst den Cursors auf den Namen einer Funktion setzen, um dann zur Deklaration der aktuellen Funktion gehen zu können. Um diesen Schritt zu vermeiden, können Sie <menuchoice><guimenu>Navigation</guimenu><guimenuitem>Zwischen Definition/Deklaration wechseln</guimenuitem></menuchoice> oder den Kurzbefehl <keycombo>&Shift;&Ctrl;<keycap>C</keycap></keycombo> verwenden, um zur Deklaration der Funktion zu gehen, in der sich der Cursor gerade befindet. Wählen Sie die Aktion noch einmal, gehen Sie zur Stelle zurück, an der die Funktion deklariert wird.

source: <guilabel>Previous/Next use</guilabel>: Placing the cursor on the name of a local variable and selecting <menuchoice><guimenu>Navigation</guimenu><guimenuitem>Next use</guimenuitem></menuchoice> (or hitting <keycombo><keycap>Meta</keycap>&Shift;<keycap>Right</keycap></keycombo>) transports you to the next use of this variable in the code. (Note that this doesn't just search for the next occurrence of the variable name but in fact takes into account that variables with the same name but in different scopes are different.) The same works for the use of function names. Selecting <menuchoice><guimenu>Navigation</guimenu><guimenuitem>Previous use</guimenuitem></menuchoice> (or hitting <keycombo><keycap>Meta</keycap>&Shift;<keycap>Left</keycap></keycombo>) transports you to the previous use of a symbol.
de: <guilabel>Vorheriges/Nächstes Vorkommen</guilabel>: Setzen Sie den Cursor auf den Namen einer lokalen Variablen und wählen Sie dann <menuchoice><guimenu>Navigation</guimenu><guimenuitem>Nächstes Vorkommen</guimenuitem></menuchoice> oder den Kurzbefehl <keycombo><keycap>Meta</keycap>&Shift;<keycap>Pfeil rechts</keycap></keycombo> bringt Sie zum nächsten Vorkommen dieser Variablen im Quelltext. Damit wird nicht einfach nach dem Vorkommen gesucht, sondern berücksichtigt, dass Variablen mit dem gleichen Namen in verschiedenem Gültigkeitsbereichen nicht identisch sind. Das gleiche funktioniert für Namen von Funktionen. Mit <menuchoice><guimenu>Navigation</guimenu><guimenuitem>Vorheriges Vorkommen</guimenuitem></menuchoice> oder dem Kurzbefehl <keycombo><keycap>Meta</keycap>&Shift;<keycap>Pfeil links</keycap></keycombo> kommen Sie zum vorherigen Vorkommen eines Symbols.symbol.

source: To see the list of all uses of a name through which these commands cycle, place the cursor onto it and open the <guilabel>Code Browser</guilabel> tool view or press and hold the &Alt; button. This is explained in more detail in the section on <link linkend="file-scope-information">Exploring code</link>.
de: Um eine Liste aller Vorkommen eines Namens zu sehen, die mit diesen Befehlen aufgerufen werden können, setzen Sie den Cursor auf den Namen und öffnen den <guilabel>Quelltext-Browser</guilabel> oder drücken und halten Sie die Taste &Alt;. Dies wird ausführlich im Abschnitt über <link linkend="file-scope-information">Quelltext untersuchen</link> erläutert.

source: Writing source code
de: Quelltext schreiben

source: Because &kdevelop; understands your projects' source code, it can assist in writing more code. The following outlines some of the ways in which it does that.
de: Weil &kdevelop; den Quelltext ihres Projektes versteht, kann es dabei helfen, weiteren Quelltext zu schreiben. Im folgenden wird gezeigt, wie das funktioniert.

source: Auto-completion
de: Autovervollständigung

source: Probably the most useful of all features in writing new code is auto-completion. Consider, for example, the following piece of code:
de: Wahrscheinlich ist die nützlichste Funktion beim Schreiben von neuem Quelltext ist die automatische Vervollständigung. Betrachten Sie zum Beispiel die folgenden Quelltextauszug:

source: class Car { // ... public: std::string get_color () const; }; void foo() { Car my_ride; // ...do something with this variable... std::string color = my_ride.ge
de: class Car { // ... public: std::string get_color () const; }; void foo() { Car my_ride; // ... benutzen Sie diese Variable ... std::string color = my_ride.ge

source: In the last line, &kdevelop; will remember that the variable <varname>my_ride</varname> is of type <varname>Car</varname>, and will automatically offer to complete the name of the member function <varname>ge</varname> as <varname>get_color</varname>. In fact, all you have to do is to keep typing until the auto-completion feature has reduced the number of matches to one, and then hit the &Enter; key:
de: In der letzten Zeile erkennt &kdevelop;, dass die Variable <varname>my_ride</varname> den Typ <varname>Car</varname>hat und schlägt daher automatisch den Namen der Member-Funktion <varname>ge</varname> mit <varname>get_color</varname> zu vervollständigen. Tatsächlich müssen Sie nur solange Zeichen eingeben, bis die automatische Vervollständigung die Anzahl der Vorschläge auf eins reduziert hat und dann die Taste &Enter; drücken.

source: Note that you can click on the tool-tip to get more information about the function apart from its return type and whether it is public:
de: Sie können auch auf die Kurzinfos klicken, um mehr Informationen über die Funktion als nur den Rückgabetyp und ob die Funktion „public“ ist.

source: &kdevelop; only parses files that it considers source code, as determined by the MIME-type of the file. This type isn't set before the first time a file is saved; consequently, creating a new file and starting to write code in it will not trigger parsing for auto-completion until after it is saved for the first time.
de: &kdevelop; durchsucht nur Dateien, die als Quelltext erkannt werden,. Das wird durch den MIME-Typ bestimmt. Dieser Typ wird erst nach dem ersten Speichern festgelegt. Wenn Sie also eine neue Datei erstellen und mit dem Schreiben von Quelltext darin beginnen, wird dadurch noch nicht das Durchsuchen für die automatische Vervollständigung ausgelöst. das erfolgt erst nach den ersten Speichern der Datei.

source: As in the previous note, for auto-completion to work, &kdevelop; must be able to find declarations in header files. For this, it searches in a number of default paths. If it doesn't automatically find a header file, it will underline the name of a header file in red; in that case, right click on it to tell &kdevelop; explicitly where to find these files and the information they provide.
de: Damit die automatische Vervollständigung funktioniert, muss &kdevelop; die Deklarationen in den Header-Dateien finden können. Dazu wird in bestimmten Standardpfaden gesucht. Wird automatisch keine Header-Datei gefunden, wird der Name einer Header-Datei rot unterstrichen. Klicken Sie dann darauf und geben an, wo diese Dateien und deren Informationen zu finden sind.

source: Configuring auto-completion is discussed in <link linkend="customizing-code-auto-completion">this section of this manual</link>.
de: Die Einrichtung der automatischen Vervollständigung wird in diesem <link linkend="customizing-code-auto-completion">Abschnitt des Handbuchs</link> erläutert.

source: Adding new classes and implementing member functions
de: Neue Klassen hinzufügen und Member-Funktionen implementieren
