Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/extragear-kdevelop/kdevelop.po
Languages: de

source: If you want to write a template from scratch, you can start with a sample C++ class template by <link linkend="creating-projects-from-scratch">creating a new project</link> and selecting the <filename>C++ Class Template</filename> project in category <filename>KDevelop</filename>.
de: Möchten Sie eine Vorlage von Grund auf neu schreiben, können Sie mit der Vorlage einer C++-Klasse beginnen, indem Sie ein <link linkend="creating-projects-from-scratch">neues Projekt erstellen</link> und das Projekt <filename>C++-Klassenvorlage</filename> aus der Kategorie <filename>KDevelop</filename> auswählen.

source: Building (compiling) projects with custom Makefiles
de: Erstellen (Kompilieren) von benutzerdefinierten Makefiles

source: Building individual Makefile targets
de: Individuelle Ziele in Makefiles erstellen

source: Selecting a collection of Makefile targets for repeated building
de: Auswahl einer Gruppe von Makefile-Zielen für das wiederholte Erstellen

source: The list of selected Makefile targets is shown in the bottom half of the <guilabel>Projects</guilabel> tool view.
de: Die Liste der ausgewählten Makefile-Ziele wird in der unteren Hälfte der Seitenleiste <guilabel>Projekte</guilabel> angezeigt.

source: What to do with error messages
de: Behandlung von Fehlermeldungen

source: If the compiler encounters an error message, simply click on the line with the error message and the editor will jump to the line (and if available column) where the error was reported. Depending on the error message, &kdevelop; may also offer you several possible actions to fix the error, for example by declaring a previously undeclared variable if an unknown symbol was found.
de: Wenn der Compiler Fehlermeldungen ausgibt, klicken Sie auf die Zeile mit der Fehlermeldung und der Editor springt zur Zeile und wenn möglich auch zur Spalte, in der der Fehler aufgetreten ist. Abhängig von der Fehlermeldung bietet &kdevelop; auch noch verschiedene Aktionen zur Behebung dieses Fehlers an, wie zum Beispiel die Deklaration einer vorher nicht deklarierten Variablen, wenn ein unbekanntes Symbol gefunden wurde.

source: Running programs in &kdevelop;
de: Programme in &kdevelop; ausführen

source: Once you have built a program, you will want to run it. To do this, need to configure <emphasis>Launches</emphasis> for your projects. A <emphasis>Launch</emphasis> consists of the name of an executable, a set of command line parameters, and an execution environment (such as <quote>run this program in a shell</quote>, or <quote>run this program in the debugger</quote>).
de: Haben Sie ein Programm erfolgreich erstellt, werden Sie es ausführen wollen. Dazu müssen Sie <emphasis>Starter</emphasis> für Ihr Projekt einrichten. Ein <emphasis>Starter</emphasis> besteht aus dem Namen einer ausführbaren Datei, einer Gruppe von Befehlszeilenparametern und einer Ausführungs-Umgebung wie zum Beispiel <quote>Dieses Programm in einer Shell ausführen</quote> oder <quote>Dieses Programm im Debugger ausführen</quote>.

source: Setting up launches in &kdevelop;
de: Startkonfigurationen in &kdevelop; einrichten

source: You can now try to run the program: Select <menuchoice><guimenu>Run</guimenu><guimenuitem>Execute Launch</guimenuitem></menuchoice> from &kdevelop;'s main window menu (or hit <keycombo>&Shift;<keycap>F9</keycap></keycombo>) and your program should run in a separate subwindow of &kdevelop;. The picture above shows the result: The new <guilabel>Run</guilabel> tool subwindow at the bottom shows the output of the program that is being run, in this case of the <replaceable>step-32</replaceable> program.
de: Sie können jetzt das Programm ausführen: Wählen Sie <menuchoice><guimenu>Ausführen</guimenu><guimenuitem>Programm ausführen</guimenuitem></menuchoice> (<keycombo>&Shift;<keycap>F9</keycap></keycombo>). Dann wird Ihr Programm in einem getrennten Unterfenster von &kdevelop; ausgeführt. Das Bildschirmfoto oben zeigt das Ergebnis: Im neuen <guilabel>Ausführungs</guilabel>-Unterfenster wird unten die Ausgabe des ausgeführten Programms angezeigt, in diesem Fall das Programm <replaceable>step-32</replaceable>.

source: Running a program
de: Ein Programm ausführen

source: Build (call make)
de: Erstellen (ruft make auf)

source: <entry>Run</entry>
de: <entry>Ausführen</entry>

source: Run program in the debugger; you may want to set breakpoints beforehand, for example by right-clicking with the mouse on a particular line in the source code
de: Führt das Programm im Debugger aus. Sie können vorher Haltepunkte setzen, indem Sie zum Beispiel mit der &RMBn; auf bestimmte Zeilen im Quelltext klicken.

source: Debugging programs in &kdevelop;
de: Programme in &kdevelop; debuggen

source: Running a program in the debugger
de: Ein Programm im Debugger ausführen

source: Attaching the debugger to a running process
de: Den Debugger an einen laufenden Prozess anhängen

source: Sometimes, one wants to debug a program that's already running. One scenario for this is debugging parallel programs using <ulink url="https://computing.llnl.gov/tutorials/mpi/">MPI</ulink>, or for debugging a long running background process. To do this, go to the menu entry <menuchoice><guimenu>Run</guimenu><guimenuitem>Attach to Process</guimenuitem></menuchoice>, which will open a window like the one above. You will want to select the program that matches your currently open project in &kdevelop; - in my case that would be the step-32 program.
de: Manchmal möchten Sie den Debugger für ein bereits laufendes Programm ausführen. Anwendungsfälle dafür sind zum Beispiel die Fehlersuche in parallel ausgeführten Programmen, die <ulink url="https://computing.llnl.gov/tutorials/mpi/">MPI</ulink> verwenden oder in bereits länger ausgeführten Hintergrundprozessen. Dazu wählen Sie den Menüeintrag <menuchoice><guimenu>Ausführen</guimenu><guimenuitem>An einen Prozess hängen</guimenuitem></menuchoice>. Damit öffnen Sie ein Fenster wie oben angezeigt. Wählen Sie dann das Programm, das zu Ihrem gerade geöffneten Projekt in &kdevelop; gehört, hier ist das das Programm step-32.

source: Debugging
de: Debugging/Fehlersuche

source: Step over (gdb's <quote>next</quote>)
de: Funktionsschritt (<quote>next</quote> in gdb)

source: Step into (gdb's <quote>step</quote>)
de: Einzelschritt (<quote>step</quote> in gdb)

source: Step out of (gdb's <quote>finish</quote>)
de: Ausführen bis Rücksprung (<quote>finish</quote> in gdb)

source: Working with version control systems
de: Arbeiten mit Versionsverwaltungssystemen

source: If you are working with larger projects, chances are that the source code is managed by a version control system such as <ulink url="http://subversion.apache.org">subversion</ulink> or <ulink url="http://git-scm.com/">git</ulink>. The following description is written with <guilabel>subversion</guilabel> in view but will be equally true if you use <guilabel>git</guilabel> or any other supported version control system.
de: Wenn sie mit größeren Projekten arbeiten, dann werden Änderungen am Quelltext durch ein Versionsverwaltungssystem wie zum Beispiel <ulink url="http://subversion.apache.org">Subversion</ulink> oder <ulink url="http://git-scm.com/">Git</ulink>verwaltet. Die folgende Beschreibung wurde in Hinsicht auf <guilabel>Subversion</guilabel> geschrieben, aber trifft genauso auf <guilabel>Git</guilabel> oder andere unterstützte Versionsverwaltungssysteme.

source: First not that if the directory in which a project is located is under version control, &kdevelop; will automatically notice. In other words: It is not necessary that you tell &kdevelop; to check out a copy itself when setting up your project; it is ok to point &kdevelop; at a directory into which you have previously checked out a copy from the repository. If you have such a directory under version control, open the <guilabel>Projects</guilabel> tool view. There are then a number of things you can do:
de: Wenn das Projekt in einem Ordner gespeichert ist, der unter Versionskontrolle liegt, erkennt &kdevelop; dies automatisch. Sie müssen bei der Einrichtung eines Projekt daher keine Kopie aus einem Quelltextarchiv laden. Es ist ausreichend, wenn in &kdevelop; einen Ordner, im dem sich eine Arbeitskopie eines Versionsverwaltungssystem befindet, für ein Projekt verwenden. Haben Sie bereits einen Ordner unter Versionskontrolle, öffnen Sie die Ansicht <guilabel>Projekte</guilabel>. Dann haben Sie mehrere Möglichkeiten:

source: If your directory has become outdated, you can update it from the repository: Click on the project name with the right mouse button, go to the menu <guilabel>Subversion</guilabel> and select <guilabel>Update</guilabel>. This will bring all files that belong to this project up to date with respect to the repository.
de: Ist der Ordner Ihrer Arbeitskopie veraltet, können Sie ihn aus dem Quelltextarchiv aktualisieren. Wählen Sie im Kontextmenü des Projektnamens <menuchoice><guimenu>Subversion</guimenu> <guimenuitem>Aktualisieren</guimenuitem></menuchoice>. Damit werden alle Dateien im Projekt auf den neuesten Stand gebracht.

source: If you want to restrict this action to individual subdirectories or files, then expand the tree view of this project to the level you want and right click on a subdirectory or file name, then do the same as above.
de: Möchten Sie diese Aktion auf einzelne Unterordner oder Dateien beschränken, erweitern Sie die Baumansicht diese Projekts bis zur gewünschten Ebene, klicken Sie dann mit der &RMBn; auf den Unterordner oder den Namen der Datei und führen Sie das gleiche wie oben aus.

source: If you've edited one or more files, expand the view of this project to the directory in which these files are located and right click on the directory. This gives you a menu item <guilabel>Subversion</guilabel> that offers you different choices. Choose <guilabel>Compare to base</guilabel> to see the differences between the version you have edited and the version in the repository you had previously checked out (the revision <quote>base</quote>). The resulting view will show the <quote>diffs</quote> for all files in this directory.
de: Haben Sie eine oder mehrere Dateien geändert, erweitern Sie die Ansicht dieses Projekt bis zum Ordner mit diesen Dateien und öffnen dann das Kontextmenü durch Klicken mit der &RMBn; auf den Ordner. In diesem Menü finden Sie im Untermenü <guilabel>Subversion</guilabel> mehrere Aktionen. Wählen Sie <guilabel>Unterschiede anzeigen</guilabel>, um die Änderungen zwischen Ihrer bearbeiteten Version und der Version im Quelltextarchiv, das Sie vorher heruntergeladen haben. dann werden die Unterschiede aller Dateien in diesem Ordner angezeigt.

source: If you only edited a single file, you can also get the <guilabel>Subversion</guilabel> menu for this file by simply right clicking on the corresponding file name in the project view. Even simpler, just right clicking into the <guilabel>Editor</guilabel> view in which you have opened this file will also give you this menu option.
de: Haben Sie nur eine einzelne Datei bearbeitet, können Sie das Kontextmenü mit dem Eintrag <guilabel>Subversion</guilabel> durch Klicken mit der &RMBn; auf den Dateinamen in der Projektansicht öffnen. Oder klicken Sie einfach in dieser Datei im Editor mit der &RMBn;, um das gleiche Kontextmenü zu öffnen.

source: As with seeing differences, if you want to check in a single file you can also just right click into the editor window to get the <menuchoice><guimenu>Subversion</guimenu><guimenuitem>Commit</guimenuitem></menuchoice> menu item.
de: Wie bei der Anzeige der Unterschiede, können Sie eine einzelne Datei in das Quelltextarchiv einspielen, indem Sie im Kontextmenü der Editorfensters den Menüeintrag <menuchoice><guimenu>Subversion</guimenu><guimenuitem>Einspielen</guimenuitem></menuchoice> auswählen.Menüeintrag <menuchoice><guimenu>Subversion</guimenu><guimenuitem>Einspielen</guimenuitem></menuchoice>

source: Customizing &kdevelop;
de: &kdevelop; anpassen

source: There are times when you want to change the default appearance or behavior of &kdevelop;, for example because you are used to different keyboard shortcuts or because your project requires a different indenting style for source code. In the following sections, we briefly discuss the various ways how &kdevelop; can be customized for these needs.
de: Möglicherweise möchten Sie das Standard-Erscheinungsbild oder -Verhalten von &kdevelop; ändern, zum Beispiel weil Sie andere Kurzbefehle gewöhnt sind oder weil Ihr Projekt einen anderen Einrückungsstile für Quelltext verwendet. In den folgenden Abschnitten werden einige Möglichkeiten gezeigt, wie &kdevelop; an Ihre Bedürfnisse angepasst werden kann.

source: Customizing the editor
de: Anpassung des Editors

source: Customizing code indentation
de: Einrückung des Quelltexts einrichten

source: With <guilabel>&kdevelop; 4.2.2</guilabel>, you can create a new style for a particular mimetype (&eg; for C++ header files) but this style does not show up among the list of possible styles for other mimetypes (&eg; for C++ source files) although it would of course be useful to use the same style for both kinds of files. You will therefore have to define the style twice, once for header and once for source files. This has been reported as <ulink url="https://bugs.kde.org/show_bug.cgi?id=272335">&kdevelop; bug 272335</ulink>.
de: Seit &kdevelop; 4.2.2 können Sie einen neuen Stil für einen bestimmten MIME-Typ &eg; für C++-Headerdateien erstellen, aber dieser Stil wird nicht in der Liste der möglichen Stile für andere MIME-Typen &eg;C++-Quelltextdateien aufgeführt, obwohl es sinnvoll ist, den gleichen Stil für beide Dateiarten zu verwenden. Daher müssen Sie den Stil zweimal definieren, einmal für die Header- und einmal für den Quelltextdatei.

source: Customizing keyboard shortcuts
de: Kurzbefehle anpassen

source: &kdevelop; has an almost boundless list of keyboard shortcuts (some of them are listed in the <quote>Useful keyboard shortcuts sections</quote> of several chapters in this manual) that can be changed to your taste through the menu <menuchoice><guimenu>Settings</guimenu><guimenuitem>Configure Shortcuts</guimenuitem></menuchoice>. At the top of the dialog you can enter a searchword and it only shows those commands that match; you can then edit which key combination is bound to this command.
de: &kdevelop; hat eine große Zahl von Tastatur-Kurzbefehlen. die sich im Menü <menuchoice><guimenu>Einstellungen</guimenu><guimenuitem>Kurzbefehle einrichten</guimenuitem></menuchoice> anpassen lassen. Oben im Dialog gibt es ein Filterfeld, in das Sie einen Suchtext eingeben können. Dann werden nur die übereinstimmenden Kurzbefehle angezeigt und Sie können einstellen, welche Tastenkombination einem Befehl zugeordnet ist.

source: Customizing code auto-completion
de: Automatische Vervollständigung für den Quelltext einrichten

source: Code completion is discussed in <link linkend="auto-completion">this manual's section on writing source code</link>. In &kdevelop;, it comes from two sources: the editor, and the parse engine. The editor (&kate;) is a component of the larger KDE environment and offers auto-completion based on words it has already seen in other parts of the same document. Such auto-completions can be identified in the tooltip by the icon that precedes it:
de: Die Quelltextvervollständigung wird im Abschnitt <link linkend="auto-completion">Quelltext schreiben</link> erläutert. &kdevelop; verwendet dabei zwei Arten: Vervollständigung des Editors und die Vervollständigung des Parsers. Der Editor &kate; ist eine KDE-Komponente und bietet eine automatische Vervollständigung auf der Grundlage der bereits eingelesenen Wörtern in anderen Teilen des gleichen Dokument. Diese Art der automatischen Vervollständigung kann im Kurzinfo am vorangestellten Symbol erkannt werden:

source: The editor's code completion can be customized via <menuchoice><guimenu>Settings</guimenu><guisubmenu>Configure Editor</guisubmenu><guimenuitem>Editing</guimenuitem><guimenuitem>Auto Completion</guimenuitem></menuchoice>. In particular, you can select how many characters you need to type in a word before auto-completion kicks in.
de: Die Quelltextvervollständigung des Editors kann mit <menuchoice><guimenu>Einstellungen</guimenu><guisubmenu>Editor einrichten</guisubmenu><guimenuitem>Bearbeitung</guimenuitem><guimenuitem>Autovervollständigung</guimenuitem></menuchoice> eingerichtet werden. Insbesondere kann angegeben werden, wie viele Zeichen einzugeben sind, ehe Vorschläge angezeigt werden.

source: On the other hand, &kdevelop;'s own auto-completion is much more powerful as it takes into account semantic information about the context. For example, it knows which member functions to offer when you type <varname>object.</varname>, &etc;, as shown here:
de: Anderseits ist die eigene automatische Vervollständigung von &kdevelop; erheblich leistungsfähiger, da auch semantische Informationen über den Kontext verwendet werden. Es werden zum Beispiel die bekannten Member-Funktionen angeboten, wenn Sie <varname>object.</varname> eingeben, wie hier gezeigt wird:

source: This context information comes from various language support plugins, which can be used after a given file has been saved (so it can check the filetype and use the correct language support).
de: Die Kontextinformationen werden von verschiedenen Modulen zur Sprachunterstützung bereitgestellt. Diese Information werden nach dem ersten Speichern erstellt, da dann der Dateityp überprüft und die richtige Sprachunterstützung verwendet wird.

source: &kdevelop;'s completion is set to appear as you type, right away, pretty much everywhere that it could possibly complete something. This is configurable in <menuchoice><guimenu>Settings</guimenu><guisubmenu>Configure &kdevelop;</guisubmenu><guimenuitem>Language Support</guimenuitem></menuchoice>. If it isn't already set (as it should, by default), make sure <guilabel>Enable Automatic Invocation</guilabel> is set.
de: Die Vervollständigung in &kdevelop; erscheint sofort bei der Eingabe von Text mit Vorschlägen für alles, was möglicherweise vervollständigt werden kann. Dies kann in <menuchoice><guimenu>Settings</guimenu><guisubmenu> &kdevelop; einrichten</guisubmenu><guimenuitem>Sprachunterstützung</guimenuitem></menuchoice> eingestellt werden. Ist auf dieser Seite die Einstellung <guilabel>Automatischen Aufruf aktivieren</guilabel> noch nicht eingeschaltet, holen Sie dies jetzt nach.

source: &kdevelop; has two ways to show a completion: <guilabel>Minimal Automatic Completion</guilabel> shows just the basic information in completion tooltips (&ie; the namespace, class, function, or variable name). This will look similar to &kate; completion (except for the icons).
de: &kdevelop; kann Vervollständigungen auf zwei Arten anzeigen. Im einfachen Modus wird nur die Basisinformation in den Kurzinfos der Vervollständigung gezeigt, &ie; Namensraum, Klasse, Funktion oder Variablenname. Außer für Symbole ist dies ähnlich wie in &kate;.

source: On the other hand, <guilabel>Full completion</guilabel> will additionally show the type for each entry, and in the case of functions, also the arguments they take. Also, if you are currently filling in the arguments to a function, full completion will have an additional info-box above the cursor that will show you the current argument you are working on.
de: Im ausführlichen Modus dagegen wird zusätzlich auch der Typ jedes Eintrags und bei Funktionen auch deren Argumente. Wenn Sie gerade die Argumente für eine Funktion eingeben, erscheint im vollständigen Modus ein zusätzliches Infofeld über dem Cursor, das das gerade bearbeitete Argument anzeigt.

source: &kdevelop;'s code completion should also bring-to-top and highlight in green any completion items that match the currently expected type in both minimal and full completion, known as <quote>best-matches</quote>.
de: Die Quelltextvervollständigung in &kdevelop; zeigt jedes Vervollständigungselement, das auf den aktuell erwarteten Typ zutrifft, sowohl bei einfacher als auch bei ausführlicher Vervollständigung oben in der Liste an und hebt es in grüner Farbe hervor, auch <quote>beste Übereinstimmung</quote> genannt.

source: The three possible choices for the completion level in the configuration dialog are:
de: Die drei Auswahlmöglichkeiten für die Vervollständigung im Einrichtungsdialog sind:

source: <guilabel>Always minimal completion</guilabel>: Never show <quote>Full Completion</quote>
de: <guilabel>Niemals</guilabel>: Zeigt immer nur die einfache Vervollständigung.

source: <guilabel>Minimal automatic completion</guilabel>: Only show <quote>Full Completion</quote> when auto-completion has been triggered manually (&ie;, whenever you hit <keycombo>&Ctrl;<keycap>Space</keycap></keycombo>)
de: <guilabel>Wenn manuell aufgerufen</guilabel>: Zeigt die ausführliche Vervollständigung, wenn die Vervollständigung manuell ausgelöst wird, &ie; durch <keycombo>&Ctrl;<keycap>Leertaste</keycap></keycombo>.

source: <guilabel>Always full completion</guilabel>: Always show <quote>Full Completion</quote>
de: <guilabel>Immer</guilabel>: Zeigt immer die ausführliche Vervollständigung.

source: Building &kdevelop; from Sources
de: &kdevelop; aus dem Quelltext kompilieren

source: If you want to have the latest features and bugfixes, you can build &kdevelop; yourself from the sources.
de: Möchten Sie die neuesten Funktionen und Fehlerkorrekturen für das Programm, können Sie &kdevelop; aus dem Quelltext selbst kompilieren.

source: There exists a more in-detail article <ulink url="http://techbase.kde.org/KDevelop4/HowToCompile">here</ulink>.
de: Sie finden einen Artikel mit ausführlicheren Informationen auf dieser <ulink url="http://techbase.kde.org/KDevelop4/HowToCompile">Seite</ulink>.

source: Be aware that you <emphasis>could</emphasis> build an unstable version. To help the developers fix bugs, please keep the <varname>RelWithDebInfo</varname> and report bugs to http://bugs.kde.org, either per hand or using Dr. Konqi.
de: Bedenken Sie, dass Sie <emphasis>möglicherweise</emphasis> eine eine nicht stabile Version erstellen. Um den Entwicklern bei der Fehlersuche zu helfen, sollten Sie <varname>RelWithDebInfo</varname> benutzen und Fehler auf http://bugs.kde.org, entweder direkt oder mit Dr.Konqui.

source: Requirements
de: Anforderungen

source: kdelibs-devel &gt;= 4.3 - http://www.kde.org
de: kdelibs-devel &gt;= 4.5 - http://www.kde.org

source: Install for all users
de: Systemweite Installation

source: Install for local user
de: Installation für einzelne Benutzer

source: the following line is needed so that <application>kbuildsycoca4</application> finds all .desktop files
de: Die folgenden Zeilen sind nötig, damit <application>kbuildsycoca4</application> alle „.desktop“-Dateien findet.

source: Please note: Whenever you do some package or distribution update that calls <application>kbuildsycoca4</application>, you need to execute the following lines after the update:
de: Bitte beachten Sie: Immer wenn Sie Pakete oder die Distribution aktualisieren und dabei <application>kbuildsycoca4</application> aufgerufen wird, müssen anschließend die folgenden Befehle ausführen:

source: Credits and License
de: Mitwirkende und Lizenz

source: Documentation Copyright see the UserBase <ulink url="http://userbase.kde.org/index.php?title=KDevelop4/Manual&amp;action=history">KDevelop4/Manual page history</ulink>
de: Copyright der Dokumentation: siehe <ulink url="http://userbase.kde.org/index.php?title=KDevelop4/Manual&amp;action=history">Versionsgeschichte der KDevelop4/Manual-Seite</ulink>
