Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/extragear-kdevelop/kdevelop.po
Languages: de

source: &kdevelop; has an assistant for adding new classes. The procedure is described in <link linkend="creating-a-new-class">Creating a new class</link>. A simple C++ class can be created by choosing the Basic C++ template from the <filename>Class</filename> category. In the assistant, we can choose some predefined member functions, for example an empty constructor, a copy constructor and a destructor.
de: In &kdevelop; gibt es einen Assistenten für das Hinzufügen von neuen Klassen. Dies wird im Abschnitt <link linkend="creating-a-new-class">Erstellen einer neuen Klasse</link> beschrieben. Eine einfache C++-Klasse kann erstellt werden, indem Sie die Basisvorlage für C++ in der Kategorie <filename>Klasse</filename> auswählen. Dann können Sie einige vordefinierte Member-Funktionen wie zum Beispiel einen leeren Konstruktor, einen Copy-Konstruktor und einen Destruktor auswählen.

source: To add new member functions, go back to the <guilabel>bus.h</guilabel> tab and add the name of a function. For example, let us add this:
de: Um neue Member-Funktionen hinzuzufügen, gehen Sie zurück zur Karteikarte <guilabel>bus.h</guilabel> und fügen den Namen einer Funktion hinzu, zum Beispiel wie im folgenden:

source: It is worth noting that &kdevelop; extracts the type of the variable to be declared from the expression used to initialize it. For example, if we had written the addition in the following rather dubious way, it would had suggested to declare the variable as type <varname>double</varname>:
de: &kdevelop; extrahiert den Typ der zu deklarierenden Variablen aus dem Ausdruck zur Initialisierung. Wenn zum Beispiel die Initialisierung auf folgende zweifelhafte Art erfolgt, wird vorgeschlagen, die Variable als Typ <varname>double</varname> zu deklarieren:

source: &kdevelop; automatically offers all possible completions of what might come here. Selecting one of the two <varname>add_students</varname> entries yields the following code that already fills in the complete argument list:
de: &kdevelop; schlägt alle möglichen automatischen Vervollständigungen vor, die hier passen. Die Auswahl einer der beiden <varname>add_students</varname>-Einträge führt zu folgendem Quelltext mit einer bereits ausgefüllten vollständigen Argumentliste:

source: In the example, accepting one of the choices the auto-completion tool offers yields the correct signature but unfortunately deletes the <varname>inline</varname> marker already written. This has been reported as <ulink url="https://bugs.kde.org/show_bug.cgi?id=274245">&kdevelop; Bug 274245</ulink>.
de: Wählen Sie in diesem Beispiel eine der angebotenen Vorschläge der automatischen Vervollständigung, wird die richtige Signatur eingefügt, aber leider die bereits geschriebene <varname>inline</varname> entfernt (<ulink url="https://bugs.kde.org/show_bug.cgi?id=274245">&kdevelop;-Fehler 274245</ulink>).

source: Documenting declarations
de: Deklarationen dokumentieren

source: &kdevelop; supports this style of comments by providing a short cut to generate the framework of comments that document a class or member function. For example, assume you have already written this code:
de: &kdevelop; unterstützt diesen Dokumentationsstil durch einen Kurzbefehl, um das Grundgerüst eines Kommentars zu erstellen, der die Klassen- oder Member-Funktion dokumentiert. Angenommen Sie haben bereits diesen Quelltext geschrieben:

source: You now want to add documentation to both the class and the member function. To this end, move the cursor onto the first line and select <menuchoice><guimenu>Code</guimenu><guimenuitem>Document Declaration</guimenuitem></menuchoice> or hit <keycombo>&Alt;&Shift;<keycap>D</keycap></keycombo>. &kdevelop; will respond with the following:
de: Jetzt möchten Sie vielleicht Dokumentation sowohl für die Klassen- und auch die Member-Funktion. Dazu verschieben Sie den Cursor in die erste Zeile und wählen dann <menuchoice><guimenu>Quelltext</guimenu><guimenuitem>Deklaration dokumentieren</guimenuitem></menuchoice> oder drücken <keycombo>&Alt;&Shift;<keycap>D</keycap></keycombo>. Dann erstellt &kdevelop; folgendes:

source: The cursor is already in the grayed out area for you to fill in the short description (after the doxygen keyword <varname>@brief</varname>) of this class. You can then continue to add documentation to this comment that gives a more detailed overview of what the class does:
de: Der Cursor steht bereits im grauen Bereich, damit Sie eine kurze Beschreibung dieser Klasse nach dem Doxygen-Schlüsselwort <varname>@brief</varname> eingeben können. Dann können Sie zu diesem Kommentar weitere Dokumention hinzufügen, die einen ausführlichere Übersicht über die Funktion dieser Klasse gibt:

source: While the editor is inside the comment, the comment text is highlighted in green (the highlighting disappears once you move the cursor out of the comment). When you get to the end of a line, hit &Enter; and &kdevelop; will automatically start a new line that starts with an asterisk and place the cursor one character indented.
de: Wenn der Cursor innerhalb des Kommentars steht, wird der Kommentartext grün hervorgehoben, diese Hervorhebung verschwindet, wenn der Cursor aus dem Kommentarbereich entfernt wird. Wenn Sie am Ende einer Zeile die &Enter;-taste drücken, dann wird am Anfang der nächsten Zeile automatisch ein Sternzeichen eingefügt und der Cursor mit einem Leerzeichen Abstand dahinter platziert.

source: Now let's document the member function, again by putting the cursor on the line of the declaration and selecting <menuchoice><guimenu>Code</guimenu><guimenuitem>Document Declaration</guimenuitem></menuchoice> or hitting <keycombo>&Alt;&Shift;<keycap>D</keycap></keycombo>:
de: Nun soll die Member-Funktion dokumentiert werden, verschieben Sie dazu wieder den Cursor in die erste Zeile der Deklaration und wählen <menuchoice><guimenu>Quelltext</guimenu><guimenuitem>Deklaration dokumentieren</guimenuitem></menuchoice> oder drücken <keycombo>&Alt;&Shift;<keycap>D</keycap></keycombo>:

source: Again, &kdevelop; automatically generates the skeleton of a comment, including documentation for the function itself, as well as its return type. In the current case, the name of the function is pretty much self-explanatory, but oftentimes function arguments may not be and should be documented individually. To illustrate this, let's consider a slightly more interesting function and the comment &kdevelop; automatically generates:
de: Wieder generiert &kdevelop; automatisch das Skelett für einen Kommentar einschließlich der Dokumentation für die Funktion selbst un den Rückgabetyp. Im aktuellen Fall ist der Name der Funktion selbst beschreibend, dies trifft aber häufig nicht auf die Argumente der Funktion zu, die daher einzeln dokumentiert werden sollten. An einer etwas interessanteren Funktion wird der von &kdevelop; automatisch generierte Kommentar illustriert:

source: Here, the suggested comment already contains all the Doxygen fields for the individual parameters, for example.
de: Hier enthält der vorgeschlagene Kommentar bereits alle Doxygen-Felder für die einzelnen Parameter wie zum Beispiel:

source: Renaming variables, functions and classes
de: Variablen, Funktionen und Klassen umbenennen

source: Sometimes, one wants to rename a function, class or variable. For example, let's say we already have this:
de: Manchmal möchten Sie eine Funktion, Klasse oder Variable umbenennen. Es ist zum Beispiel dieser Quelltext vorhanden:

source: We then realize that we're unhappy with the name <varname>remove_students</varname> and would have rather called it, say, <varname>throw_out_students</varname>. We could do a search-replace for the name, but this has two drawbacks:
de: Möchten Sie den Namen <varname>remove_students</varname> zum Beispiel lieber durch <varname>throw_out_students</varname>, können Sie die Funktion Suchen und Ersetzen für diesen Namen benutzen, das hat aber zwei Nachteile:

source: The function may be used in more than one file.
de: Die Funktion kann in mehr als einer Datei benutzt werden.

source: We really only want to rename this function and not touch functions that may have the same name but are declared in other classes or namespaces.
de: Es soll nur diese Funktion umbenannt und keine anderen Funktionen geändert werden, die vielleicht zufälligerweise den gleichen Namen haben, aber in anderen Klassen oder Namensräumen deklariert sind.

source: Code snippets
de: Textbausteine

source: Most projects have pieces of code that one frequently has to write in source code. Examples are: for compiler writers, a loop over all instructions; for user interface writers, checks that user input is valid and if not to open an error box; in the project of the author of these lines, it would be code of the kind
de: In vielen Projekten gibt es Quelltextteile, die häufig im Quelltext geschrieben werden müssen. Zum Beispiel für Compiler Schleifen über alle Instruktionen, für eine grafische Benutzeroberfläche Überprüfungen, dass die Benutzereingabe gültig ist und falls nicht, einen Dialog mit einer Fehlermeldung öffnet, Im Projekt des Autors dieser Zeilen zum Beispiel:

source: for (typename Triangulation::active_cell_iterator cell = triangulation.begin_active(); cell != triangulation.end(); ++cell) ... do something with the cell ...
de: for (typename Triangulation::active_cell_iterator cell = triangulation.begin_active(); cell != triangulation.end(); ++cell) ... benutzen Sie cell ...

source: Rather than typing this kind of text over and over again (with all the concomitant typos one introduces), the <guilabel>Snippets</guilabel> tool of &kdevelop; can help here. To this end, open the tool view (see <link linkend="tools-and-views">Tools and views</link> if the corresponding button isn't already on the perimeter of your window). Then click on the <quote>Add repository</quote> button (a slight misnomer &mdash; it allows you to create a named collection of snippets for source codes of a particular kind, &eg; C++ sources) and create an empty repository. Then click <inlinemediaobject> <imageobject> <imagedata fileref="Icon-list-add.png" format="PNG"/> </imageobject> </inlinemediaobject> to add a snippet, to get a dialog like the following:
de: Anstatt diesen Text immer wieder einzugeben und dabei möglicherweise auch noch Tippfehler einzufügen, können Sie dafür die <guilabel>Textbausteine</guilabel> in &kdevelop; benutzen. Öffnen Sie die <link linkend="tools-and-views">Werkzeugansicht</link>, wenn der zugehörige Knopf noch nicht am Rand des Fensters angezeigt wird. Klicken Sie den auf den Knopf <guibutton>Archiv hinzufügen</guibutton> und erstellen damit ein leeres Archiv. Klicken Sie dann auf <inlinemediaobject> <imageobject> <imagedata fileref="Icon-list-add.png" format="PNG"/> </imageobject> </inlinemediaobject>, um folgenden Dialog zum Hinzufügen eines Textbausteins zu öffnen.

source: The name of a snippet may not have spaces or other special characters because it must look like a normal function or variable name (for reasons that will become clear in the next paragraph).
de: Der Name eines Textbausteins darf keine Leerzeichen oder andere Sonderzeichen enthalten, da er wie der normale Name einer Funktion oder Variablen sein muss. Die Gründe dafür werden im nächsten Abschnitt erläutert.

source: To use a snippet so defined, when you are editing code, you can just type the name of the snippet like you would any other function or variable name. This name will become available for auto-completion &mdash; which means that there is no harm in using a long and descriptive name for a snippet such as the one above &mdash; and when you accept the suggestion of the auto-completion tooltip (for example by just hitting &Enter;), the already entered part of the snippets' name will be replaced by the full expansion of the snippet and will be properly indented:
de: Um beim Schreiben von Quelltext einen definierten Textbaustein zu benutzen, geben Sie dessen Namen wie bei jeder anderen Funktion oder Variablen ein. Dann zeigt die automatische Vervollständigung eine Liste aller passenden Namen, darunter auch Textbausteine, an. Daher können Sie längere und aussagekräftige Namen für Textbausteine wie oben verwenden. Übernehmen Sie den Vorschlag der automatischen Vervollständigung zum Beispiel durch Drücken der Taste &Enter;, dann wird der bereits eingegebenen Teil des Namens des Textbausteins durch den Inhalt ersetzt und richtig eingerückt:

source: Note that for this to work, the <guilabel>Snippets</guilabel> tool view need not be open or visible: you only ever need the tool view to define new snippets. An alternative, if less convenient, way to expand a snippet is to simply click on it in the respective tool view.
de: Damit dies funktioniert, muss die Werkzeugansicht <guilabel>Textbausteine</guilabel> nicht aktiviert oder geöffnet sein. Diese Werkzeugansicht wird nur für die Bearbeitung von Textbausteinen benötigt. Alternativ können Sie auch auf den Eintrag eines Textbausteins in der Werkzeugansicht klicken, um ihn einzufügen.

source: Snippets are much more powerful than just explained. For a full description of what you can do with them, see the <ulink url="http://userbase.kde.org/Special:myLanguage/KDevelop4/Manual/Tool_list/Snippets">detailed documentation of the Snippets tool</ulink>.
de: Textbausteine sind erheblich leistungsfähiger als gerade erläutert. Eine vollständige Erläuterung dazu finden Sie in der ausführlichen <ulink url="http://userbase.kde.org/Special:myLanguage/KDevelop4/Manual/Tool_list/Snippets">Dokumentation zu Textbausteinen</ulink>.

source: Modes and working sets
de: Modi und Arbeitsbereiche

source: If you open &kdevelop; the first time, the working set is empty &mdash; there are no open files. But as you open files for editing (or debugging, or reviewing in the other modes) your working set grows. The fact that your working set is non-empty is indicated by a symbol in the tab, as shown below. You will notice that whenever you close &kdevelop; and later start it again, the working set is saved and restored, &ie; you get the same set of open files.
de: Wenn Sie &kdevelop; zum ersten Mal öffnen, ist der Arbeitsbereich leer &mdash; es sind keine Dateien geöffnet. Wenn Sie aber Dateien zum Bearbeiten oder in den anderen Modi zur Fehlersuche oder zum Durchsehen öffnen, werden diese Dateien zu Ihrem Arbeitsbereich hinzugefügt. Die Tatsache, dass Ihr Arbeitsbereich nicht mehr leer ist wird durch ein Symbol auf dem Karteireiter wie im nächsten Bildschirmfoto angezeigt. Wenn Sie &kdevelop; beenden, wird Ihr Arbeitsbereich gespeichert und beim nächsten Start von &kdevelop; wiederhergestellt, &ie; die gleiche Gruppe von Dateien ist geöffnet.

source: Some useful keyboard shortcuts
de: Einige nützliche Tastatur-Kurzbefehle

source: &kdevelop;'s editor follows the standard keyboard shortcuts for all usual editing operations. However, it also supports a number of more advanced operations when editing source code, some of which are bound to particular key combinations. The following are frequently particularly helpful:
de: Der Editor von &kdevelop; verwendet die Standard-Kurzbefehle für alle üblichen Editor-Aktionen. Es gibt jedoch in &kdevelop; noch erweiterte Operationen zum Bearbeiten von Quelltexten. Für einige dieser Operationen gibt es als Voreinstellung bestimmte Kurzbefehle. Die folgenden Kurzbefehle werden häufig benutzt:

source: Jumping around in code
de: Navigieren im Quelltext

source: Quick open file: enter part of a filename and select among all the files in the current session's projects' directory trees that match the string; the file will then be opened
de: Schnellöffner für Dateien: Geben Sie einen Teil eines Dateinamens ein und wählen Sie aus allen Dateien mit passendem Namen aus dem Ordnerbaum der aktuellen Projektsitzung. Dann wird diese Datei geöffnet.

source: Quick open class: enter part of a class name and select among all class names that match; the cursor will then jump to the class declaration
de: Schnellöffner für Klassen: Geben Sie einen Teil eines Klassennamens ein und wählen Sie aus allen Klassen mit passendem Namen. Dann geht der Cursor zur Klassendeklaration.

source: Quick open function: enter part of a (member) function name and select among all names that match; note that the list shows both declarations and definitions and the cursor will then jump to the selected item
de: Schnellöffner für Funktionen: Geben Sie einen Teil des Namens einer Member-Funkion ein und wählen Sie aus allen passendem Einträgen in der Liste. Diese Liste zeigt sowohl Deklarationen als auch Definitionen. Dann geht der Cursor zum ausgewählten Eintrag.

source: Universal quick open: type anything (file name, class name, function name) and get a list of anything that matches to select from
de: Allgemeiner Schnellöffner: Geben Sie den Teil eines Namens von Dateien, Klassen oder Funktionen an, dann wird eine Liste mit allen übereinstimmenden Einträgen zur Auswahl angezeigt.

source: Outline: Provide a list of all things that are happening in this file, &eg; class declarations and function definitions
de: Funktions-Kurzinfo: Zeigt eine Liste aller Klassendeklarationen und Funktionsdefinitionen in dieser Datei.

source: Jump to definition of a function if the cursor is currently on a function declaration
de: Gehe zur Deklaration einer Funktion, wenn der Cursor gerade in einer Funktionsdefinition steht.

source: Jump to declaration of a function or variable if the cursor is currently in a function definition
de: Gehe zur Deklaration einer Funktion oder Variablen, wenn der Cursor gerade in einer Funktionsdefinition steht.

source: &Ctrl;&Alt;<keycap>PageDown</keycap>
de: &Ctrl;&Alt;<keycap>Bild ab</keycap>

source: Jump to next function
de: Gehe zur nächsten Funktion

source: &Ctrl;&Alt;<keycap>PageUp</keycap>
de: &Ctrl;&Alt;<keycap>Bild auf</keycap>

source: Jump to previous function
de: Gehe zur vorherigen Funktion

source: Goto line
de: Gehe zu Zeile

source: Searching and replacing
de: Suchen und Ersetzen

source: Find
de: Suchen

source: Find next
de: Weitersuchen

source: Replace
de: Ersetzen

source: Find-Replace in multiple files
de: Suchen/Ersetzen in mehreren Dateien

source: Other things
de: Andere Kurzbefehle

source: Collapse one level: remove this block from view, for example if you want to focus on the bigger picture within a function
de: Klappt eine Ebene ein: Blendet diesen Block in der Ansicht aus, wenn Sie zum Beispiel eine besseren Überblick innerhalb einer Funktion haben möchten.

source: Expand one level: undo the collapsing
de: Eine Ebene ausklappen: Macht das Einklappen rückgängig

source: Comment out selected text or current line
de: Kommentiert den ausgewählten Text oder die aktuelle Zeile aus

source: Comment in selected text or current line
de: Hebt die Auskommentierung des ausgewählten Texts oder der aktuelle Zeile auf

source: Document the current function. If the cursor is on a function or class declaration then hitting this key will create a doxygen-style comment pre-populated with a listing of all parameters, return values, &etc;
de: Dokumentiert die aktuelle Funktion. Wenn der Cursor in einer Funktion oder Klassendeklaration steht, wird beim Drücken dieser Tastenkombination ein Kommentar im Doxygen-Stil mir bereits ausgefüllten Werten aller Parameter, Rückgabewerten &etc;

source: Transpose the current and the previous character
de: Vertauscht das aktuelle und das vorherige Zeichen

source: Delete the current line (note: this is not just emacs' <quote>delete from here to the end of the line</quote>)
de: Löscht die aktuelle Zeile. Hinweis: Dies ist nicht nur <quote>Löschen von hier bis zum Ende der Zeile</quote> wie in Emacs

source: Code generation with templates
de: Quelltexterzeugung mit Vorlagen

source: &kdevelop; uses templates for generating source code files and to avoid writing repeatable code.
de: &kdevelop; verwendet Vorlagen zur Erzeugung von Quelltextdateien und vermeidet damit das wiederholte Schreiben des gleichen Quelltextes.

source: Creating a new class
de: Erstellen einer neuen Klasse

source: In the next page, you are offered a selection of virtual methods from all inherited classes, as well as some default constructors, destructors and operators. Checking the check box next to a method signature will implement this method in the new class.
de: Auf der nächsten Seite wird eine Auswahl von virtuellen Methoden von allen geerbten Klassen wie auch einige Standard-Konstruktoren, Destruktoren und Operatoren. Aktivieren Sie die Ankreuzfelder neben den Methodenbeschreibungen, dann werden diese Methoden in der neuen Klasse implementiert.

source: In the following pages, you can choose a license for you new class, set any custom options required by the selected template, and configure output locations for all the generated files. By clicking <guilabel>Finish</guilabel>, you complete the assistant and create the new class. The generated files will be opened in the editor, so you can start adding code right away.
de: Auf den folgenden Seiten können Sie eine Lizenz für Ihre neue Klasse, benutzerdefinierte für die ausgewählte Vorlage einstellen und Ausgabeoptionen für alle generierten Dateien einstellen. Klicken Sie auf <guilabel>Fertigstellen</guilabel>, um den Assistenten zu beenden und die neue Klasse zu erstellen. Die generierten Dateien werden dann im Editor geöffnet, so dass Sie sofort mit der Eingabe von Quelltext beginnen können.

source: After creating a new C++ class, you will be given an option of adding the class to a project target. Choose a target from the dialog page, or dismiss the page and add the files to a target manually.
de: Nach dem Erstellen der neuen C++-Klasse haben Sie die Option, die Klasse einem Projektziel hinzuzufügen. Wählen Sie ein Ziel aus dem Dialogseite, oder lassen Sie die Seite aus und fügen Sie die Dateien manuell zu einem Ziel hinzu.

source: If you chose the <filename>Qt Object</filename> template, checked some of the default methods, and added two member variables, the output should look like on the following picture.
de: Wenn Sie die Vorlage <filename>Qt-Objekt</filename> ausgewählt und einige Standardmethoden angekreuzt und zwei Member-Variablen hinzugefügt haben, solle die Ausgabe wie im folgenden Bildschirmfoto aussehen.

source: Creating a new unit test
de: Erstellen eines neuen Unit-Tests

source: Unit tests created this way will not be added to any target automatically. If you are using CTest or some other testing framework, make sure to add the new files to a target.
de: Unit-Tests, die auf diese Art erstellt wurden, werden automatisch zu keinem Ziel hinzugefügt. Verwenden Sie CTest oder eine anderes Test-Framework, müssen Sie die neuen Dateien zum Ziel hinzufügen.

source: Other files
de: Andere Dateien

source: Managing templates
de: Vorlagen verwalten

source: When copying an existing template, make sure you rename it before importing it again. Otherwise, you will either overwrite the old template, or will end up with two templates with identical names. To rename a template, rename the description file to something unique (but keep the suffix), and change the <filename>Name</filename> entry in the description file.
de: Wenn Sie eine vorhandene Vorlage kopieren, sollten Sie sie umbenennen, ehe Sie sie wieder importieren. Ansonsten überschreiben Sie entweder die alte Vorlage oder erhalten zwei Vorlagen mit identischen Namen. Um eine Vorlage umzubenennen, ändern Sie die Beschreibungsdatei zu einem eindeutigen Namen, aber behalten die Erweiterung bei. Ändern Sie dann den Eintrag <filename>Name</filename> in der Beschreibungsdatei.
