Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/kde-workspace/kcm_infobase.po
Languages: de

source: Location
de: Adresse

source: Description
de: Beschreibung

source: SCSI subsystem could not be queried: /sbin/camcontrol could not be found
de: Das SCSI-Untersystem lässt sich nicht ansprechen: /sbin/camcontrol ist nicht auffindbar.

source: SCSI subsystem could not be queried: /sbin/camcontrol could not be executed
de: Das SCSI-Untersystem lässt sich nicht ansprechen: /sbin/camcontrol ist nicht ausführbar.

# @title:column Column name for PCI information
source: Information
de: Informationen

source: Could not find any programs with which to query your system's PCI information
de: Es ist kein Programm auffindbar, mit dem sich die PCI-Informationen Ihres Systems ermitteln lassen.

source: PCI subsystem could not be queried: %1 could not be executed
de: Das PCI-Untersystem lässt sich nicht abfragen: %1 ist nicht ausführbar.

source: The PCI subsystem could not be queried, this may need root privileges.
de: Das PCI-Untersystem lässt sich nicht abfragen. Eventuell sind dafür die Rechte des Benutzers „root“ erforderlich.

source: PA-RISC Processor
de: PA-RISC-Prozessor

source: DMA-Channel
de: DMA-Kanal

source: Used By
de: Verwendet von

source: I/O-Range
de: E/A-Bereich

source: Device
de: Gerät

source: No PCI devices found.
de: Keine PCI-Geräte gefunden.

source: No I/O port devices found.
de: Keine E/A-Port-Geräte gefunden.

source: No SCSI devices found.
de: Keine SCSI-Geräte gefunden.

source: Unknown Order %1
de: Unbekannte Reihenfolge %1

source: Screen # %1
de: Bildschirm Nr. %1

source: (Default Screen)
de: (Standard-Bildschirm)

source: Dimensions
de: Abmessungen

source: %1 x %2 Pixels (%3 x %4 mm)
de: %1 × %2 Pixel (%3 × %4 mm)

source: Resolution
de: Auflösung

source: %1 x %2 dpi
de: %1 × %2 dpi

source: Depths (%1)
de: Tiefen (%1)

source: Root Window ID
de: ID des Ursprungsfensters

source: Depth of Root Window
de: Tiefe des Ursprungsfensters

source: %1 plane
de: %1 Ebene

source: Number of Colormaps
de: Anzahl der Farbtabellen

source: Default Colormap
de: Standard-Farbtabelle

source: Default Number of Colormap Cells
de: Standardanzahl der Farbtabellenfelder

source: Preallocated Pixels
de: Vordefinierte Pixel

source: Black %1, White %2
de: Schwarz %1, Weiß %2

source: Yes
de: Ja

source: No
de: Nein

source: Options
de: Einstellungen

source: When mapped
de: Wenn zugeordnet

source: backing-store: %1, save-unders: %2
de: Verdeckt-Speichern: %1, Darunter-Speichern: %2

source: Largest Cursor
de: Größter Cursor

source: unlimited
de: unbegrenzt

source: Current Input Event Mask
de: Aktuelle Eingabeereignismaske

source: Event = %1
de: Ereignis = %1

source: Value
de: Wert

source: Name of the Display
de: Name der Anzeige

source: Vendor String
de: Hersteller

source: Vendor Release Number
de: Herstellernummer:

source: Version Number
de: Versionsnummer

source: Available Screens
de: Verfügbare Bildschirme

source: Supported Extensions
de: Unterstützte Erweiterungen

source: Supported Pixmap Formats
de: Unterstützte Pixmap-Formate

source: Pixmap Format #%1
de: Pixmap-Format Nr. %1

source: %1 BPP, Depth: %2, Scanline padding: %3
de: %1 BPP, Tiefe: %2, Scanline-Füllung: %3

source: Maximum Request Size
de: Maximale Größe einer Anfrage

source: Motion Buffer Size
de: Größe des Bewegungspuffers

source: Unit
de: Einheit

source: Order
de: Reihenfolge

source: Padding
de: Auffüllen

source: Image Byte Order
de: Byte-Reihenfolge des Bildes

source: This system may not be completely supported yet.
de: Dieses System wird noch nicht vollständig unterstützt.
