Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/kde-workspace/kcmbell.po
Languages: de

# NAME OF TRANSLATORS
source: Your names
de: Thomas Diehl, Thomas Reitelbach

# EMAIL OF TRANSLATORS
source: Your emails
de: thd@kde.org,tr@erdfunkstelle.de

source: Bell Settings
de: Signalton-Einstellungen

source: &Use system bell instead of system notification
de: &Signalton statt Systemnachrichten verwenden

source: You can use the standard system bell (PC speaker) or a more sophisticated system notification, see the "System Notifications" control module for the "Something Special Happened in the Program" event.
de: Sie können den Standard-Signalton des PC-Lautsprechers verwenden oder auch die anspruchsvolleren Systemnachrichten. Siehe die Einstellungen zu „Im Programm ist ein besonderes Ereignis aufgetreten“ im Kontrollmodul „Systemnachrichten“.

source: <h1>System Bell</h1> Here you can customize the sound of the standard system bell, i.e. the "beep" you always hear when there is something wrong. Note that you can further customize this sound using the "Accessibility" control module; for example, you can choose a sound file to be played instead of the standard bell.
de: <h1>System-Signalton</h1> Hier können Sie den Klang des Signaltons für Ihr System einstellen, also des „Piepsers“, den Sie immer hören, wenn etwas nicht stimmt. Beachten Sie bitte, dass Sie zusätzliche Einstellungen an diesem Klang im Modul „Zugangshilfen“ vornehmen können. Zum Beispiel lässt sich eine Klangdatei festlegen, die statt des Standardtons abgespielt wird.

source: &Volume:
de: &Lautstärke:

source: Here you can customize the volume of the system bell. For further customization of the bell, see the "Accessibility" control module.
de: Hier können Sie die Lautstärke des System-Signaltons einstellen. Zusätzliche Einstellmöglichkeiten für den Signalton finden Sie im Kontrollmodul „Zugangshilfen“.

source: &Pitch:
de: &Höhe:

source: Here you can customize the pitch of the system bell. For further customization of the bell, see the "Accessibility" control module.
de: Hier können Sie die Höhe des System-Signaltons einstellen. Zusätzliche Einstellmöglichkeiten für den Signalton finden Sie im Kontrollmodul „Zugangshilfen“.

source: msec
de: ms

source: &Duration:
de: &Dauer:

source: Here you can customize the duration of the system bell. For further customization of the bell, see the "Accessibility" control module.
de: Hier können Sie die Dauer des System-Signaltons einstellen. Zusätzliche Einstellmöglichkeiten für den Signalton finden Sie im Kontrollmodul „Zugangshilfen“.

source: Click "Test" to hear how the system bell will sound using your changed settings.
de: Klicken Sie auf „Test“, um den Signalton mit den veränderten Einstellungen zu hören.

source: KDE Bell Control Module
de: Kontrollmodul für Signaltöne

source: (c) 1997 - 2001 Christian Czezatke, Matthias Elter
de: © 1997–2001 Christian Czezatke, Matthias Elter

source: Original author
de: Ursprünglicher Autor

source: Current maintainer
de: Aktueller Betreuer
