Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/kde-workspace/kcmkwincompositing.po
Languages: de

# NAME OF TRANSLATORS
source: Your names
de: Thomas Reitelbach

# EMAIL OF TRANSLATORS
source: Your emails
de: tr@erdfunkstelle.de

source: 1 second remaining:
de: 1 Sekunde verbleibt:

source: Confirm Desktop Effects Change
de: Änderung der Arbeitsflächeneffekte bestätigen

source: &Accept Configuration
de: &Einrichtung beibehalten

source: &Return to Previous Configuration
de: Zur &vorherigen Einrichtung zurückkehren

source: Desktop effects settings have changed. Do you want to keep the new settings? They will be automatically reverted in 10 seconds.
de: Arbeitsflächeneffekte wurden geändert. Möchten Sie die neuen Einstellungen beibehalten? Sie werden automatisch nach 10 Sekunden zurückgesetzt.

# Prevent warning from bein displayed again
source: Don't show again!
de: Nicht wieder anzeigen.

source: Use GLSL shaders
de: GLSL-Shader verwenden

source: None
de: Kein

source: The painting is not synchronized with the screen.
de: Das Zeichnen ist nicht mit dem Bildschirm abgeglichen.

source: Automatic
de: Automatisch

source: Tries to re-use older buffers and if that is not possible, picks a strategy matching your hardware.
de: Versucht alte Puffer wieder zu verwenden. Wenn das nicht möglich ist wird eine Strategie passen zur Hardware ausgesucht.

source: Only when Cheap
de: Nur wenn Aufwand vertretbar

source: When major regions of the screen are updated, the entire screen will be repainted. Can cause tearing with small updates.
de: Wenn größere Bereiche des Bildschirms aktualisiert werden, wird der gesamte Bildschirm neu gezeichnet. Das kann Risse bei kleineren Aktualisierungen verursachen.

source: Full scene repaints
de: Vollständiges Neuzeichnen

source: The complete screen is repainted for every frame. Can be slow with large blurred areas.
de: Für jeden Frame wird der gesamte Bildschirminhalt neu gezeichnet. Das kann bei großen unscharfen Bereichen langsam sein.

source: Re-use screen content
de: Bildschirm-Inhalt wiederverwenden

source: WARNING: This strategy is usually slow with Open Source drivers. Undamaged pixels will be copied from GL_FRONT to GL_BACK
de: ACHTUNG: Diese Strategie ist mit Open-Source-Treibern normalerweise langsam. Intakte Pixel werden von GL_FRONT nach GL_BACK kopiert.

source: KWin Desktop Effects Configuration Module
de: Einrichtungsmodul für KDE-Arbeitsflächeneffekte

source: (c) 2007 Rivo Laks
de: © 2007, Rivo Laks

source: No effect
de: Kein Effekt

source: Failed to activate desktop effects using the given configuration options. Settings will be reverted to their previous values. Check your X configuration. You may also consider changing advanced options, especially changing the compositing type.
de: Mit den gewählten Einstellung lassen sich die Arbeitsflächeneffekte nicht aktivieren. Die vorherigen Einstellungen werden wiederhergestellt. Bitte prüfen Sie Ihre X-Einrichtung. Möglicherweise müssen auch die erweiterten Einstellungen angepasst werden, insbesondere der Composit-Typ.

source: Appearance
de: Erscheinungsbild

source: Accessibility
de: Zugangshilfen

source: Focus
de: Aktivierung

source: Window Management
de: Fensterverwaltung

source: Candy
de: Optik

source: Demos
de: Vorführungen

source: Tools
de: Extras

source: Desktop effects are not available on this system due to the following technical issues:
de: Die Arbeitsflächeneffekte sind wegen der nachstehenden technischen Einschränkungen auf diesem System nicht verfügbar:

source: Window Manager seems not to be running
de: Die Fensterverwaltung läuft anscheinend nicht

source: Your settings have been saved but as KDE is currently running in failsafe mode desktop effects cannot be enabled at this time. Please exit failsafe mode to enable desktop effects.
de: Ihre Einstellungen wurden gespeichert aber die Arbeitsflächeneffekte können wegen des Betriebs von KDE im sicheren Modus derzeit nicht aktiviert werden. Bitte verlassen Sie den sicheren Modus um die Arbeitsflächeneffekte zu aktivieren.

# Error Message shown when a desktop effect could not be loaded
source: One desktop effect could not be loaded.
de: Ein Arbeitsflächeneffekt lässt sich nicht aktivieren.

# Effect with given name could not be activated due to unknown reason
source: %1 effect failed to load due to unknown reason.
de: Der Effekt „%1“ kann aus unbekannter Ursache nicht geladen werden.

# Effect with given name could not be activated as it requires hardware shaders
source: %1 effect requires hardware support.
de: Der Effekt „%1“ benötigt Hardware-Unterstützung.

# Effect with given name could not be activated as it requires OpenGL
source: %1 effect requires OpenGL.
de: Der Effekt „%1“ benötigt OpenGL.

# Effect with given name could not be activated as it requires OpenGL 2
source: %1 effect requires OpenGL 2.
de: Der Effekt „%1“ benötigt OpenGL 2.

# Window title
source: List of effects which could not be loaded
de: Liste der Effekte, die nicht geladen werden können

source: For technical reasons it is not possible to determine all possible error causes.
de: Aus technischen Gründen ist es nicht möglich, alle möglichen Fehlerursachen zu bestimmen.

# Error Message shown when compositing is not active after tried activation
source: Desktop effect system is not running.
de: Das System für Arbeitsflächeneffekte läuft nicht.

source: <h1>Desktop Effects</h1>
de: <h1>Arbeitsflächeneffekte</h1>

source: General
de: Allgemein

source: Pressing this button can crash the desktop.
de: Das Drücken dieses Knopfes kann die Arbeitsfläche zum Absturz bringen.

source: I have saved my data.
de: Ich habe meine Daten gespeichert.

source: Re-enable OpenGL detection
de: OpenGL-Erkennung aktivieren

source: Activation
de: Aktivierung

# @option:check
source: Enable desktop effects at startup
de: Arbeitsflächeneffekte beim Start aktivieren

source: Desktop effects can be toggled anytime using this shortcut:
de: Arbeitsflächeneffekte können jederzeit mit diesem Kurzbefehl ein- und ausgeschaltet werden:

# @title:group a few general options to set up desktop effects
source: Simple effect setup
de: Einfache Effekt-Einrichtung

source: Improved window management
de: Verbesserte Fensterverwaltung

source: Various animations
de: Verschiedene Animationen

source: Effect for desktop switching:
de: Effekt für den Arbeitsflächenwechsel:

source: Animation speed:
de: Animationsgeschwindigkeit:

source: Instant
de: Sofort

source: Very Fast
de: Sehr schnell

source: Fast
de: Schnell

source: Slow
de: Langsam

source: Very Slow
de: Sehr langsam

source: Extremely Slow
de: Extrem langsam

source: You can find more effects, as well as effect-specific settings, in the "All Effects" tab above.
de: Weitere Effekte sowie deren Einstellungen finden Sie in der Karteikarte „Alle Effekte“.

source: All Effects
de: Alle Effekte

source: Hint: To find out or configure how to activate an effect, look at the effect's settings.
de: Tipp: Wie ein Effekt ausgelöst und eingerichtet wird, erfahren Sie in den Effekt-Einstellungen

source: Get New Effects ...
de: Neue Effekte herunterladen ...

source: Advanced
de: Erweitert

source: OpenGL Options
de: OpenGL-Einstellungen

source: <p>Activates color correction if possible, using the Kolor-Manager. Requires OpenGL 2 Shaders to be enabled and Kolor-Manager to be installed. May fail silently.</p><p><strong>Experimental</strong>.</p>
de: <p>Aktiviert Farbkorrektur durch „Kolor-Manager“, wenn möglich. Dafür müssen OpenGL 2 Shader aktiviert und „Kolor-Manager“ installiert sein. Kann ohne Benachrichtigung fehlgeschlagen.</p><p><strong>Experimentell</strong>.</p>

source: Enable color correction (experimental)
de: Farbkorrektur aktivieren (Experimentell)

source: Tearing Prevention (VSync)
de: Einzelbild-Zerreißen (Tearing) verhindern (VSync)

source: General Options
de: Allgemeine Einstellungen

source: Keep window thumbnails:
de: Fenster-Vorschaubilder vorhalten:

source: Always (Breaks minimization)
de: Immer (verhindert Minimierung)

source: Only for Shown Windows
de: Nur für sichtbare Fenster

source: Never
de: Nie

source: Scale method:
de: Skalierungsmethode:

source: <!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0//EN" "http://www.w3.org/TR/REC-html40/strict.dtd"> <html><head><meta name="qrichtext" content="1" /><style type="text/css"> p, li { white-space: pre-wrap; } </style></head><body style=" font-family:'Segoe'; font-size:8pt; font-weight:400; font-style:normal;"> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-weight:600;">Crisp:</span></p> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-style:italic;">XRenderSetPictureFilter("fast")</span> - Pretty fast on all GPUs but looks bricky</p> <p style="-qt-paragraph-type:empty; margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"></p> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-weight:600;">Smooth:</span></p> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-style:italic;">XRenderSetPictureFilter("good") </span>- linear blending.</p> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;">Fast enough on newer nvidia GPUs and maybe others but also can be <span style=" text-decoration: underline;">very</span> slow, you will have to try it.</p></body></html>
de: <!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0//EN" "http://www.w3.org/TR/REC-html40/strict.dtd"> <html><head><meta name="qrichtext" content="1" /><style type="text/css"> p, li { white-space: pre-wrap; } </style></head><body style=" font-family:'Segoe'; font-size:8pt; font-weight:400; font-style:normal;"> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-weight:600;">Pixelig:</span></p> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-style:italic;">XRenderSetPictureFilter("fast")</span> – Ziemlich schnell auf allen GPUs, sieht jedoch stufig aus.</p> <p style="-qt-paragraph-type:empty; margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"></p> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-weight:600;">Weich:</span></p> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-style:italic;">XRenderSetPictureFilter("good")</span> – lineares Mischen.</p> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;">Schnell genug auf neueren NVIDIA-GPUs und möglichweise auch auf anderen GPUs, kann jedoch aber auch <span style=" text-decoration: underline;">sehr</span> langsam sein. Sie werden es selber ausprobieren müssen.</p></body></html>

source: Crisp
de: Pixelig

source: Smooth (slower)
de: Weich (langsamer)

source: <!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0//EN" "http://www.w3.org/TR/REC-html40/strict.dtd"> <html><head><meta name="qrichtext" content="1" /><style type="text/css"> p, li { white-space: pre-wrap; } </style></head><body style=" font-family:'Segoe'; font-size:8pt; font-weight:400; font-style:normal;"> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-weight:600;">Crisp:</span></p> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-style:italic;">GL_NEAREST</span> - (very) fast on all GPUs but looks bricky</p> <p style="-qt-paragraph-type:empty; margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"></p> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-weight:600;">Smooth:</span></p> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-style:italic;">GL_LINEAR</span> - fast on most GPUs but a little blurry</p> <p style="-qt-paragraph-type:empty; margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"></p> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-weight:600;">Accurate:</span></p> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;">Lanczos filter, requires glsl shader support.</p> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;">Might be slow on weaker GPUs and even cause various troubles with broken drivers (from overbrightening to segfaults).</p> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;">Fall back to "Smooth" if you have problems.</p></body></html>
de: <!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0//EN" "http://www.w3.org/TR/REC-html40/strict.dtd"> <html><head><meta name="qrichtext" content="1" /><style type="text/css"> p, li { white-space: pre-wrap; } </style></head><body style=" font-family:'Segoe'; font-size:8pt; font-weight:400; font-style:normal;"> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-weight:600;">Pixelig:</span></p> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-style:italic;">GL_NEAREST</span> – (sehr) schnell auf allen GPUs, sieht jedoch stufig aus</p> <p style="-qt-paragraph-type:empty; margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"></p> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-weight:600;">Weich:</span></p> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-style:italic;">GL_LINEAR</span> – schnell auf den meisten GPUs, sieht jedoch etwas unscharf aus</p> <p style="-qt-paragraph-type:empty; margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"></p> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-weight:600;">Genau:</span></p> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;">Lanczos-Filter, erfordert Unterstützung für GLSL-Shader.</p> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;">Könnte auf schwächeren GPUs langsam sein und sogar zu verschiedenen Problemen mit defekten Treibern führen (von zu hoch eingestellter Helligkeit bis hin zu Abstürzen.)</p> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;">Wählen Sie im Zweifelsfall „Weich“ aus, falls Sie Probleme haben.</p></body></html>

source: Smooth
de: Weich

source: Accurate
de: Genau

source: Suspend desktop effects for fullscreen windows
de: Arbeitsflächeneffekte für Fenster im Vollbildmodus aussetzen

source: Compositing type:
de: Composit-Typ:

source: Qt graphics system:
de: Qt-Grafiksystem:

source: <!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0//EN" "http://www.w3.org/TR/REC-html40/strict.dtd"> <html><head><meta name="qrichtext" content="1" /><style type="text/css"> p, li { white-space: pre-wrap; } </style></head><body style=" font-family:'Segoe'; font-size:8pt; font-weight:400; font-style:normal;"> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;">It is <span style=" font-weight:600;">strongly recommended</span> to use the <span style=" font-weight:600;">native</span> system when using the <span style=" font-weight:600;">XRender</span> backend.</p> <p style="-qt-paragraph-type:empty; margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"></p> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;">On the other hand, many decorations perform better with the <span style=" font-weight:600;">raster</span> system on the <span style=" font-weight:600;">default and generally preferred OpenGL</span> backend (though some don't - also the impact here can be anything between "slight" and "incredible" depending on the GPU and driver)</p></body></html>
de: <!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0//EN" "http://www.w3.org/TR/REC-html40/strict.dtd"> <html><head><meta name="qrichtext" content="1" /><style type="text/css"> p, li { white-space: pre-wrap; } </style></head><body style=" font-family:'Segoe'; font-size:8pt; font-weight:400; font-style:normal;"> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;">Es wird <span style=" font-weight:600;">dringend empfohlen</span> das <span style=" font-weight:600;">native</span> System mit dem <span style=" font-weight:600;">XRender</span>-Backend zu verwenden.</p> <p style="-qt-paragraph-type:empty; margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"></p> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;">On the other hand, many decorations perform better with the <span style=" font-weight:600;">raster</span> system on the <span style=" font-weight:600;">default and generally preferred OpenGL</span> backend (though some don't - also the impact here can be anything between "slight" and "incredible" depending on the GPU and driver)</p></body></html>

source: Native
de: Nativ
