Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/kde-workspace/kcmscreensaver.po
Languages: de

# NAME OF TRANSLATORS
source: Your names
de: Stephan Johach

# EMAIL OF TRANSLATORS
source: Your emails
de: hunsum@gmx.de

# Screen saver category
source: Banners & Pictures
de: Banner & Bilder

# Screen saver category
source: Desktop Distortions
de: Arbeitsflächen-Verzerrung

# Screen saver category
source: Flying Things
de: Fliegende Gegenstände

# Screen saver category
source: Fractals
de: Fraktale

# Screen saver category
source: Gadgets & Simulations
de: Apparate & Simulationen

# Screen saver category
source: Illusions of Depth
de: Tiefenillusionen

# Screen saver category
source: Miscellaneous
de: Verschiedene

# Screen saver category
source: OpenGL Screen Savers
de: OpenGL-Bildschirmschoner

# Screen saver category
source: Rapid Motion
de: Schnelle Bewegungen

# Screen saver category
source: Visit to Flatland
de: Besuch im Flachland

source: Automatically start the screen saver after a period of inactivity.
de: Bildschirmschoner automatisch starten, wenn der Benutzer eine zeitlang keine Aktionen ausführt.

source: Start a&utomatically after:
de: Auto&matischer Start nach:

source: Prevent potential unauthorized use by requiring a password to stop the screen saver.
de: Verhinderung von potentiell unautorisiertem Zugriff durch Abfrage eines Passwortes, um den Bildschirmschoner zu beenden.

source: &Require password after:
de: &Passwortabfrage nach:

source: The amount of time, after the screen saver has started, to ask for the unlock password.
de: Der Zeitraum, der nach dem Start des Bildschirmschoners verstreichen soll, ehe nach einem Passwort zum Entsperren gefragt wird.

source: &Screen locker type:
de: Art der Bildschirmsperre:

source: S&imple locker
de: Einfa&che Sperre

source: &Desktop Widgets
de: M&iniprogramme

source: Configure...
de: &Einrichtung ...

source: S&creen saver
de: &Bildschirmschoner

source: Select the screen saver to use.
de: Wählen Sie den Bildschirmschoner aus.

source: Show a full screen preview of the screen saver.
de: Zeigt eine Vollbildvorschau des gewählten Bildschirmschoners an.

source: &Test
de: &Testen

source: Configure the screen saver's options, if any.
de: Einrichten des Bildschirmschoners, falls es Einstellmöglichkeiten gibt.

source: &Setup...
de: &Einrichtung ...

source: <h1>Screen Saver</h1> <p>This module allows you to enable and configure a screen saver. Note that you can enable a screen saver even if you have power saving features enabled for your display.</p> <p>Besides providing an endless variety of entertainment and preventing monitor burn-in, a screen saver also gives you a simple way to lock your display if you are going to leave it unattended for a while. If you want the screen saver to lock the session, make sure you enable the "Require password" feature of the screen saver; if you do not, you can still explicitly lock the session using the desktop's "Lock Session" action.</p>
de: <h1>Bildschirmschoner</h1> <p>Dieses Modul ermöglicht Ihnen die Aktivierung und Einrichtung eines Bildschirmschoners. Beachten Sie, dass Sie ihn auch einschalten können, wenn Energiesparfunktionen aktiv sind.</p><p>Neben der Vielzahl von unterhaltsamen Effekten und der Vorbeugung gegen das Einbrennen von Standbildern in den Monitor liefert Ihnen der Schoner auch eine simple Methode, Ihren Bildschirm zu sperren, falls Sie ihn für eine Weile unbeaufsichtigt lassen. Wenn Sie den Bildschirm sperren möchten, aktivieren Sie das Merkmal „Nach Passwort fragen“ für den Bildschirmschoner. Falls Sie das unterlassen, können Sie den Bildschirm dennoch sperren, indem Sie „Bildschirm sperren“ im Kontextmenü der Arbeitsfläche auswählen.</p>

source: second
de: Sekunde

source: A preview of the selected screen saver.
de: Eine Vorschau des gewählten Bildschirmschoners.

source: KDE Screen Saver Control Module
de: KDE-Kontrollmodul für Bildschirmschoner

source: (c) 1997-2002 Martin R. Jones (c) 2003-2004 Chris Howells
de: © 1997–2002 Martin R. Jones © 2003–2004 Chris Howells

source: Loading...
de: Wird geladen ...
