Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/kde-workspace/kdmconfig.po
Languages: de

# NAME OF TRANSLATORS
source: Your names
de: Volker Dose,Thomas Diehl,Thomas Reitelbach

# EMAIL OF TRANSLATORS
source: Your emails
de: vpdose@cpmgut.toppoint.de,thd@kde.org,tr@erdfunkstelle.de

source: E&nable background
de: Hin&tergrund aktivieren

source: If this is checked, KDM will use the settings below for the background. If it is disabled, you have to look after the background yourself. This is done by running some program (possibly xsetroot) in the script specified in the Setup= option in kdmrc (usually Xsetup).
de: Wenn aktiviert, wird KDM die gewählten Einstellungen für den Hintergrund benutzen. Ansonsten können Sie den Hintergrund zum Beispiel durch ein gesondertes Programm bestimmen (wie etwa xsetroot). Dies müssen Sie in der Skriptdatei eintragen, die durch die Option „Setup=“ in kdmrc spezifiziert ist; dies ist im Allgemeinen jedoch Xsetup.

source: <big><b><center>Attention<br/>Read help</center></b></big>
de: <big><b><center>Achtung<br/>Lesen Sie die Hilfe</center></b></big>

source: Enable Au&to-Login
de: Automatische Anmeldung er&lauben

source: Turn on the auto-login feature. This applies only to KDM's graphical login. Think twice before enabling this!
de: Schaltet die Funktion „Automatische Anmeldung“ ein. Das bezieht sich nur auf die grafische Anmeldung in KDM. Bitte überlegen Sie gründlich, bevor Sie diese Einstellung aktivieren.

source: Use&r:
de: &Benutzer:

source: Select the user to be logged in automatically.
de: Wählen Sie den Benutzer aus der Liste, der automatisch angemeldet werden soll.

source: Loc&k session
de: Sitzung &sperren

source: The automatically started session will be locked immediately (provided it is a KDE session). This can be used to obtain a super-fast login restricted to one user.
de: Die automatisch gestartete Sitzung wird sofort gesperrt (sofern es sich um eine KDE-Sitzung handelt). Auf diese Weise ist eine sehr schnelle Anmeldung möglich (beschränkt auf einen Benutzer).

# @title:group
source: Preselect User
de: Vorausgewählter Benutzer

# @option:radio preselected user
source: &None
de: &Keiner

# @option:radio preselected user
source: Prev&ious
de: &Vorheriger

source: Preselect the user that logged in previously. Use this if this computer is usually used several consecutive times by one user.
de: Der zuletzt angemeldete Benutzer erscheint in der Anmeldung vorausgewählt. Nutzen Sie diese Funktion, wenn der Rechner hauptsächlich von verschiedenen Personen genutzt wird.

# @option:radio preselected user
source: Specifi&ed:
de: &Festgelegt:

source: Preselect the user specified in the combo box to the right. Use this if this computer is predominantly used by a certain user.
de: Bestimmen Sie den Benutzer, der bei der Anmeldung vorausgewählt werden soll. Dies ist sinnvoll, wenn dieser Rechner lediglich von einer einzigen Person genutzt wird.

source: Select the user to be preselected for login. This box is editable, so you can specify an arbitrary non-existent user to mislead possible attackers.
de: Bestimmen Sie den Benutzer, der bei der Anmeldung vorausgewählt werden soll. Sie können hier auch einen nicht-existierenden Benutzer eintragen, um mögliche Missetäter am Rechner in die Irre zu führen.

# @option:check action
source: Focus pass&word
de: Pass&wort-Eingabefeld aktiv

source: When this option is on, KDM will place the cursor in the password field instead of the user field after preselecting a user. Use this to save one key press per login, if the preselection usually does not need to be changed.
de: Wenn diese Einstellung aktiv ist, wird KDM die Schreibmarke in das Passwortfeld setzen, sobald Sie einen Benutzer angewählt haben. Dies spart einen Tastendruck für die Anmeldung, falls sich der anmeldende Benutzer nur selten ändert.

source: Enable Password-&Less Logins
de: Anmeldung &ohne Passwort zulassen

source: When this option is checked, the checked users from the list below will be allowed to log in without entering their password. This applies only to KDM's graphical login. Think twice before enabling this!
de: Wenn diese Einstellung aktiv ist, werden die Benutzer in der rechten Liste auch ohne Angabe ihres Passworts beim System angemeldet. Das bezieht sich nur auf die grafische Anmeldung in KDM. Bitte überlegen Sie gründlich, bevor Sie diese Einstellung aktivieren.

source: No password re&quired for:
de: Kein Passwort er&forderlich für:

source: Check all users you want to allow a password-less login for. Entries denoted with '@' are user groups. Checking a group is like checking all users in that group.
de: Markieren Sie alle Benutzer, denen Sie die Anmeldung ohne Passwort gestatten möchten. Einträge mit „@“ bezeichnen Gruppen und schließen alle der Gruppe zugehörigen Benutzer mit ein.

# @title:group
source: Miscellaneous
de: Verschiedenes

source: Automatically log in again after &X server crash
de: Nach Absturz des X-Servers automatisch &wieder anmelden

source: When this option is on, a user will be logged in again automatically when their session is interrupted by an X server crash; note that this can open a security hole: if you use a screen locker than KDE's integrated one, this will make circumventing a password-secured screen lock possible.
de: Wenn Sie diese Einstellung aktivieren, wird ein Benutzer automatisch wieder beim System angemeldet, wenn seine Sitzung aufgrund eines Absturzes des X-Servers unterbrochen wurde. Bitte bedenken Sie, dass sich hierdurch ein Sicherheitsproblem ergeben kann: Wenn Sie nicht das in KDE integrierte, sondern ein anderes Programm für die Bildschirmsperre benutzen, ist der Passwortschutz umgehbar.

source: &Greeting:
de: Be&grüßung:

source: <p>This is the "headline" for KDM's login window. You may want to put some nice greeting or information about the operating system here.</p><p>KDM will substitute the following character pairs with the respective contents:</p><ul><li>%d -> current display</li><li>%h -> host name, possibly with domain name</li><li>%n -> node name, most probably the host name without domain name</li><li>%s -> the operating system</li><li>%r -> the operating system's version</li><li>%m -> the machine (hardware) type</li><li>%% -> a single %</li></ul>
de: <p>Dies ist die „Überschrift“ im Anmeldefenster von KDM. Sie können hier z. B. eine freundliche Begrüßung und/oder Informationen über das Betriebssystem eintragen.</p><p>KDM wird dabei die folgenden Platzhalter durch die eigentlichen Werte ersetzen:</p><ul><li>%d -> aktueller Bildschirm (Display)</li><li>%h -> Rechnername, eventuell mit Domain</li><li>%n -> Node-Name, üblicherweise der Name des Rechners ohne Domain</li><li>%s -> Betriebssystem</li><li>%r -> Version des Betriebssystems</li><li>%m -> Rechnertyp</li><li>%% -> ein Prozentzeichen</li></ul>

source: Logo area:
de: Logo-Bereich:

# logo area
source: &None
de: &Kein Logo

source: Show cloc&k
de: &Uhr anzeigen

source: Sho&w logo
de: Logo &anzeigen

source: You can choose to display a custom logo (see below), a clock or no logo at all.
de: Sie können auswählen, ob ein von Ihnen festgelegtes Logo, eine Uhr oder gar nichts angezeigt werden soll.

source: Click here to choose an image that KDM will display. You can also drag and drop an image onto this button (e.g. from Konqueror).
de: Klicken Sie hier, um ein Bild auszuwählen, das KDM anzeigen soll. Sie können auch ein Bild (z. B. aus Konqueror) auf diesen Knopf ziehen.

source: Dialog &position:
de: Fenster-&Position:

source: There was an error loading the image: %1 It will not be saved.
de: Fehler beim Laden des Bildes: %1 Es wird nicht gespeichert ...

source: Welcome to %s at %n
de: Willkommen zu %s auf %n

source: <h1>KDM - Dialog</h1> Here you can configure the basic appearance of the KDM login manager in dialog mode, i.e. a greeting string, an icon etc.
de: <h1>KDM-Erscheinungsbild</h1> Hier können Sie das grundsätzliche Erscheinungsbild des Anmeldebildschirms KDM festlegen (z. B. Begrüßungstext, Symbol usw.)

# @title:group 'man locale' ...
source: Locale
de: Regionales

source: &Language:
de: S&prache:

source: Here you can choose the language used by KDM. This setting does not affect a user's personal settings; that will take effect after login.
de: Hier können Sie die Sprache wählen, die von KDM verwendet werden soll. Diese Vorgabe hat keinen Einfluss auf die persönlichen Einstellungen eines Benutzers nach der Anmeldung.

# @title:group
source: Appearance
de: Erscheinungsbild

source: &Use themed greeter (Warning: poor accessibility)
de: Design für den Anmeldebildschirm verwenden (Achtung: schlechter zugänglich)

source: Enable this if you would like to use a themed Login Manager.<br>Note that the themed greeter is challenged accessibility-wise (keyboard usage), and themes may lack support for features like a user list or alternative authentication methods.
de: Aktivieren Sie diese Einstellung, wenn der Anmeldebildschirm in einem bestimmten Design angezeigt werden soll.<br> Beachten Sie, dass der Anmeldebildschirm bei der Verwendung von Designs schlechter zugänglich ist (Verwendung der Tastatur) und dass Designs bestimmte Funktionen wie eine Benutzerliste oder alternative Authentifizierungsmethoden nicht unterstützen könnten.

source: <placeholder>default</placeholder>
de: <placeholder>standard</placeholder>

source: GUI s&tyle:
de: Oberflächensti&l:

source: You can choose a basic GUI style here that will be used by KDM only.
de: Hier können Sie einen Oberflächenstil wählen, der ausschließlich von KDM benutzt werden soll.

source: Color sche&me:
de: &Farbschema:

source: You can choose a basic Color Scheme here that will be used by KDM only.
de: Hier können Sie ein Farbschema wählen, das ausschließlich von KDM benutzt werden soll.

# @title:group
source: Fonts
de: Schriftarten

source: This changes the font which is used for all the text in the login manager except for the greeting and failure messages.
de: Ändert die Schriftart im gesamten Anmeldebildschirm, außer für den Begrüßungsbereich und Warnungen zu fehlgeschlagenen Anmeldungen.

# ... font
source: &General:
de: &Allgemein:

source: This changes the font which is used for failure messages in the login manager.
de: Ändert die Schriftart, die für Nachrichten über fehlgeschlagene Anmeldungen verwendet wird.

# font for ...
source: &Failure:
de: &Fehlversuche:

source: This changes the font which is used for the login manager's greeting.
de: Ändert die Schriftart, die für die Begrüßung auf dem Anmeldebildschirm verwendet wird

# font for ...
source: Gree&ting:
de: Be&grüßung:

source: Use anti-aliasing for fonts
de: Kantenglättung für Schriftdarstellung verwenden

source: If you check this box and your X-Server has the Xft extension, fonts will be antialiased (smoothed) in the login dialog.
de: Wenn diese Einstellung aktiv ist und Ihr X-Server über die Xft-Erweiterungen verfügt, werden die Schriftarten im Anmeldedialog geglättet dargestellt (Anti-Aliasing).

source: Allow Shutdown
de: Herunterfahren zulassen

# shutdown request origin
source: &Local:
de: &Lokal:

# @item:inlistbox allow shutdown
source: Everybody
de: Jeder

# @item:inlistbox allow shutdown
source: Only Root
de: Nur Systemverwalter

# @item:inlistbox allow shutdown
source: Nobody
de: Niemand

# shutdown request origin
source: &Remote:
de: Von F&remdrechner:

source: Here you can select who is allowed to shutdown the computer using KDM. You can specify different values for local (console) and remote displays. Possible values are:<ul> <li><em>Everybody:</em> everybody can shutdown the computer using KDM</li> <li><em>Only root:</em> KDM will only allow shutdown after the user has entered the root password</li> <li><em>Nobody:</em> nobody can shutdown the computer using KDM</li></ul>
de: Hier können Sie festlegen, wem das Ausschalten des Rechners erlaubt sein soll. Mögliche Einstellungen sind:<ul> <li><em>Jeder:</em> Jeder kann den Recher über KDM herunterfahren und ausschalten</li> <li><em>Nur Konsole:</em> Nur Benutzer, die direkt am Rechner sitzen, können ihn über KDM herunterfahren</li><li><em>Nur Systemverwalter:</em> KDM wird den Rechner nur dann herunterfahren, wenn der Benutzer das Passwort des Systemverwalters eingibt</li> <li><em>Niemand:</em> Keiner darf mit Hilfe von KDM den Rechner herunterfahren</li></ul>

# @title:group shell commands for shutdown
source: Commands
de: Befehle

# command for ...
source: H&alt:
de: System &herunterfahren:

source: Command to initiate the system halt. Typical value: /sbin/halt
de: Befehl, um das Herunterfahren des Systems einzuleiten. Typischer Eintrag: /sbin/halt

# command for ...
source: Reb&oot:
de: &Neustart:

source: Command to initiate the system reboot. Typical value: /sbin/reboot
de: Befehl, um den Neustart des Systems einzuleiten. Typischer Eintrag: /sbin/reboot

# boot manager
source: None
de: Keiner

source: Enable boot options in the "Shutdown..." dialog.
de: Startoptionen im Dialog „Herunterfahren“ aktivieren.

# @title:column
source: Theme
de: Design

# @title:column
source: Author
de: Autor

source: This is a list of installed themes. Click the one to be used.
de: Sie sehen hier eine Liste der installierten Designs. Wählen Sie das Design aus, welches benutzt werden soll.

source: This is a screen shot of what KDM will look like.
de: Auf diesem Vorschaubild sehen Sie, wie KDM aussehen wird.

source: This contains information about the selected theme.
de: Dies sind Informationen über das ausgewählte Design.

# @action:button
source: Install &new theme
de: &Neues Design installieren

source: This will install a theme into the theme directory.
de: Dies wird ein neues Design in den Design-Ordner installieren.

# @action:button
source: &Remove theme
de: Design &entfernen

source: This will remove the selected theme.
de: Hierdurch wird das ausgewählte Design entfernt.

# @action:button
source: &Get New Themes
de: Neue Designs &herunterladen

source: <qt><strong>Description:</strong> %1</qt>
de: <qt><strong>Beschreibung:</strong> %1</qt>

source: Unable to create folder %1
de: Der Ordner %1 lässt sich nicht anlegen.

source: Drag or Type Theme URL
de: Geben Sie eine Design-Adresse ein oder ziehen Sie sie herein

source: Unable to find the KDM theme archive %1.
de: Das KDM-Design-Archiv namens „%1“ kann nicht gefunden werden.

source: Unable to download the KDM theme archive; please check that address %1 is correct.
de: Das KDM-Design-Archiv kann nicht heruntergeladen werden; bitte stellen Sie sicher, dass die Adresse %1 richtig ist.

source: The file is not a valid KDM theme archive.
de: Bei der Datei handelt es sich nicht um ein gültiges KDM-Design-Archiv.

# @title:window
source: Installing KDM themes
de: Installieren von KDM-Designs

# @info:progress
source: <qt>Unpacking <strong>%1</strong> theme</qt>
de: <qt>Das Design <strong>%1</strong> wird entpackt.</qt>

# @info:progress
source: <qt>Installing the themes</qt>
de: <qt>Die Designs werden installiert.</qt>

source: There were errors while installing the following themes:
de: Beim Installieren der folgenden Designs sind Fehler aufgetreten:

source: Are you sure you want to remove the following themes?
de: Sind Sie sicher, dass die folgenden Designs entfernt werden sollen?

# @title:window
source: Remove themes?
de: Designs entfernen?

source: There were errors while deleting the following themes:
de: Beim Entfernen der folgenden Designs sind Fehler aufgetreten:

source: User 'nobody' does not exist. Displaying user images will not work in KDM.
de: Der Benutzer „nobody“ existiert nicht. Im Anmeldebildschirm werden keine Benutzerbilder angezeigt.

# @title:group UIDs belonging to system users like 'cron'
source: System U&IDs
de: System-Benutzerkennungen (U&IDs)

source: Users with a UID (numerical user identification) outside this range will not be listed by KDM and this setup dialog. Note that users with the UID 0 (typically root) are not affected by this and must be explicitly excluded in "Inverse selection" mode.
de: Benutzerkennungen, die nicht im Bereich der gewählten UIDs (numerische Benutzeridentifikation) liegen, werden von KDM und diesem Dialog nicht angezeigt. Beachten Sie jedoch, das Benutzer mit der UID 0 (dies ist typischerweise der Systemverwalter „root“) von dieser Regel nicht erfasst werden. Möchten Sie auch „root“ ausschließen, so müssen Sie dies im Modus „Umgekehrte Auswahl“ einstellen.

# UIDs
source: Below:
de: Unter:

# UIDs
source: Above:
de: Über:

# @title:group
source: Users
de: Benutzer

# ... of users
source: Show list
de: Benutzerliste anzeigen

source: If this option is checked, KDM will show a list of users, so users can click on their name or image rather than typing in their login.
de: Wenn diese Einstellung aktiv ist, wird KDM eine Benutzerliste mit Bildern anzeigen, sodass Benutzer auf ihren Namen oder ihr Bild klicken können, statt ihren Benutzernamen über die Tastatur einzugeben.

# user ...
source: Autocompletion
de: Autom. Vervollständigung

source: If this option is checked, KDM will automatically complete user names while they are typed in the line edit.
de: Wenn diese Einstellung aktiv ist, wird KDM den Benutzernamen beim Eintippen automatisch vervollständigen.

# @option:check mode of the user selection
source: Inverse selection
de: Umgekehrte Auswahl

source: This option specifies how the users for "Show list" and "Autocompletion" are selected in the "Select users and groups" list: If not checked, select only the checked users. If checked, select all non-system users, except the checked ones.
de: Die Einstellung gibt an, wie die Benutzer unter „Liste anzeigen“ bzw. „Autom. Vervollständigung“ in der Liste „Benutzer und Gruppen auswählen“ behandelt werden: Ist das Kästchen leer, werden nur angekreuzte Benutzer ausgewählt. Ist das Kästchen markiert, werden alle Benutzer ausgewählt, die für Systemfunktionen stehen, außer den jeweils angekreuzten.

source: Sor&t users
de: Benutzer s&ortieren

source: If this is checked, KDM will alphabetically sort the user list. Otherwise users are listed in the order they appear in the password file.
de: Wenn diese Einstellung aktiv ist, wird KDM die Benutzer in alphabetischer Reihenfolge anzeigen. Ansonsten werden die Benutzer in der Reihenfolge angezeigt, wie sie in der Passwort-Datei eingetragen sind.

source: S&elect users and groups:
de: B&enutzer und Gruppen auswählen:

source: Selected Users
de: Ausgewählte Benutzer

source: KDM will show all checked users. Entries denoted with '@' are user groups. Checking a group is like checking all users in that group.
de: KDM zeigt alle markierten Benutzer an. Einträge mit „@“ bezeichnen Gruppen und schließen alle der Gruppe zugehörigen Benutzer mit ein.

source: Excluded Users
de: Ausgeschlossene Benutzer

source: KDM will show all non-checked non-system users. Entries denoted with '@' are user groups. Checking a group is like checking all users in that group.
de: KDM zeigt alle Benutzer an, die nicht für Systemfunktionen stehen bzw. deren Anzeige nicht durch Markierung deaktiviert wurden. Einträge mit „@“ bezeichnen Gruppen und schließen alle der Gruppe zugehörigen Benutzer mit ein.

# @title:group source for user faces
source: User Image Source
de: Quelle für Benutzerbild

source: Here you can specify where KDM will obtain the images that represent users. "System" represents the global folder; these are the pictures you can set below. "User" means that KDM should read the user's $HOME/.face.icon file. The two selections in the middle define the order of preference if both sources are available.
de: Hier können Sie angeben, woher KDM die Bilder für die Benutzer bezieht. „System“ steht für den globalen Ordner, Sie sehen die Bilder weiter unten aufgeführt. „Benutzer“ bedeutet, dass KDM das Bild aus der Datei $HOME/.face.icon lädt. Mit den beiden mittleren Einstellungen können Sie bestimmen, in welcher Reihenfolge das Vorhandensein der Bilddateien geprüft wird.

# @option:radio image source
source: System, user
de: System, Benutzer

# @option:radio image source
source: User, system
de: Benutzer, System

# @option:radio image source
source: User
de: Benutzer

# @title:group user face assignments
source: User Images
de: Benutzerbilder

source: The user the image below belongs to.
de: Der Benutzer, zu dem das Bild unten gehört.

source: User:
de: Benutzer:

source: Click or drop an image here
de: Klicken Sie hier oder ziehen Sie ein Bild hier her.

source: Here you can see the image assigned to the user selected in the combo box above. Click on the image button to select from a list of images or drag and drop your own image on to the button (e.g. from Konqueror).
de: Hier sehen Sie den Benutzernamen und das zugehörige Benutzerbild. Klicken Sie auf den Bildknopf, um aus einer Liste von Bildern wählen zu können oder ziehen Sie ein Bild Ihrer Wahl (z. B. aus Konqueror) auf den Knopf und lassen es dort fallen.

# @action:button assign default user face
source: R&eset
de: &Zurücksetzen

source: Click this button to make KDM use the default image for the selected user.
de: Wählen Sie diese Einstellung, damit KDM das Standardbild für den ausgewählten Benutzer anzeigt.

source: Save image as default?
de: Bild als Voreinstellung festlegen?

source: There was an error while loading the image %1
de: Fehler beim Laden des Bildes: %1

source: There was an error while saving the image: %1
de: Fehler beim Speichern des Bildes: %1

source: There was an error while removing the image: %1
de: Fehler beim Entfernen des Bildes: %1

source: Unable to authenticate/execute the action: %1 (code %2)
de: Die Aktion kann nicht berechtigt/ausgeführt werden: %1 (Code %2)

source: %1 does not appear to be an image file. Please use files with these extensions: %2
de: %1 scheint keine Bilddatei zu sein. Bitte benutzen Sie Dateien mit folgenden Erweiterungen: %2

source: KDE Login Manager Config Module
de: Einrichtung des KDE-Anmeldebildschirms

source: (c) 1996-2010 The KDM Authors
de: © 1996–2010, die KDM-Autoren

source: Original author
de: Ursprünglicher Autor

source: Current maintainer
de: Aktueller Betreuer
