Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/kde-workspace/kdmconfig.po
Languages: de

source: <h1>Login Manager</h1> In this module you can configure the various aspects of the KDE Login Manager. This includes the look and feel as well as the users that can be selected for login. Note that you can only make changes if you run the module with superuser rights.<h2>General</h2> On this tab page, you can configure parts of the Login Manager's look, and which language it should use. The language settings made here have no influence on the user's language settings.<h2>Dialog</h2>Here you can configure the look of the "classical" dialog based mode if you have chosen to use it. <h2>Background</h2>If you want to set a special background for the dialog-based login screen, this is where to do it.<h2>Themes</h2> Here you can specify the theme to be used by the Login Manager.<h2>Shutdown</h2> Here you can specify who is allowed to shutdown/reboot the machine and whether a boot manager should be used.<h2>Users</h2>On this tab page, you can select which users the Login Manager will offer you for logging in.<h2>Convenience</h2> Here you can specify a user to be logged in automatically, users not needing to provide a password to log in, and other convenience features.<br/>Note that by their nature, these settings are security holes, so use them very carefully.
de: <h1>Anmeldebildschirm</h1>In diesem Modul können Sie die verschiedenen Aspekte des Anmeldebildschirms von KDE einrichten. Das schließt sowohl das äußere Erscheinungsbild ein als auch die Anzeige derjenigen Benutzer, die im Anmeldungsdialog ausgewählt werden können. Beachten Sie, dass Sie Änderungen in diesem Bereich nur vornehmen können, wenn Sie Systemverwaltungsrechte besitzen.<h2>Allgemein</h2>Auf dieser Karteikarte können Sie einstellen, wie der Anmeldebildschirm aussehen und welche Sprache verwendet werden soll. Die Spracheinstellung an dieser Stelle hat keinen Einfluss auf die Arbeitsflächen-Einstellungen einzelner Benutzer.<h2>Dialog</h2>Hier können Sie das Aussehen des „klassischen“ Begrüßungsdialogs auswählen, falls Sie sich für diesen entschieden haben.<h2>Hintergrund</h2>Falls Sie einen besonderen Hintergrund für den Anmeldebildschirm einstellen möchten, dann ist dies der Ort, an dem Sie das tun können.<h2>Design</h2>Hier legen Sie das Design fest, welches vom Anmeldebildschirm verwendet werden soll.<h2>Herunterfahren</h2>Hier können Sie angeben, wer den Rechner herunterfahren bzw. neustarten darf und ob ein Bootmanager verwendet werden soll.<h2>Benutzer</h2>Auf dieser Karteikarte können Sie einstellen, welche Benutzer Ihnen der Anmeldebildschirm anzeigt.<h2>Vereinfachung</h2> Hier können Sie festlegen, dass ein bestimmter Benutzer automatisch angemeldet werden soll, dass andere für die Anmeldung kein Passwort einzugeben brauchen und dergleichen mehr. <br/>Bitte bedenken Sie, dass diese Einstellung naturgemäß ein Sicherheitsproblem darstellt. Aktivieren Sie sie also nicht leichtfertig.

source: &General
de: &Allgemein

source: There is no login dialog window in themed mode.
de: Sie verwenden den Design-Modus. Im Design-Modus ist kein Dialog-Fenster vorgesehen.

source: &Background
de: &Hintergrund

source: The background cannot be configured separately in themed mode.
de: Sie verwenden den Design-Modus. Der Hintergrund kann daher nicht getrennt eingerichtet werden.

source: &Theme
de: &Design

source: Themed mode is disabled. See "General" tab.
de: Der Design-Modus ist nicht aktiviert. Bitte schauen Sie auf der Karteikarte „Allgemein“ nach.

source: &Shutdown
de: &Herunterfahren

source: &Users
de: Ben&utzer

source: &Convenience
de: &Vereinfachung

source: Unable to install new kdmrc file from %1
de: Die neue „kdmrc“-Datei aus %1 kann nicht installiert werden.

source: Unable to install new backgroundrc file from %1
de: Die neue „backgroundrc“-Datei aus %1 kann nicht installiert werden.

source: Unable to install new kdmrc file from %1 and new backgroundrc file from %2
de: Die neue „kdmrc“-Datei aus %1 und die neue „backgroundrc“-Datei aus %2 können nicht installiert werden.

source: Drag the anchor to move the center of the dialog to the desired position. Keyboard control is possible as well: Use the arrow keys or Home to center. Note that the actual proportions of the dialog are probably different.
de: Durch Ziehen des Ankers können Sie die mittlere Position des Dialogs festlegen. Sie können dazu auch die Tastatur verwenden: Betätigen Sie die Pfeil-Tasten oder „Pos 1“, um den Anker in die Mitte zu bringen. Hinweis: Die eigentlichen Proportionen können abweichen.
