Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/kde-workspace/kdmgreet.po
Languages: de

# @action:inmenu
source: &Local Login
de: &Lokale Anmeldung

source: XDMCP Host Menu
de: XDMCP-Rechnermenü

# @title:column
source: Hostname
de: Rechnername

# XDMCP server
source: Hos&t:
de: &Rechner:

# @action:button
source: A&dd
de: &Hinzufügen

# @action:button
source: &Accept
de: &Annehmen

# @action:button
source: &Refresh
de: &Aktualisieren

# @action:button
source: &Menu
de: &Menü

# hostname or status
source: <unknown>
de: <unbekannt>

source: Unknown host %1
de: Unbekannter Rechner %1

source: *** Cannot connect to console log ***
de: *** Keine Verbindung zum „console“-Protokoll möglich ***

source: *** Lost connection with console log ***
de: *** Verbindung zum „console“-Protokoll abgebrochen ***

source: [fix kdmrc]
de: [kdmrc korrigieren]

source: Root authorization required.
de: Autorisierung als Systemverwalter erforderlich

# @action:inmenu verb
source: &Schedule...
de: &Zeitplan ...

source: Shutdown Type
de: Art des Herunterfahrens

source: &Turn off computer
de: &Rechner ausschalten

source: &Restart computer
de: Rechner &neu starten

# @title:group ... of shutdown
source: Scheduling
de: Zeitplanung

source: T&imeout:
de: &Wartezeit:

source: &Force after timeout
de: Nach &Zeitüberschreitung erzwingen

source: Entered start date is invalid.
de: Das eingegebene Startdatum ist ungültig.

source: Entered timeout date is invalid.
de: Das eingegebene Datum für das Zeitlimit ist ungültig.

source: &Turn Off Computer
de: &Rechner ausschalten

source: &Restart Computer
de: Rechner &neu starten

# current option in boot loader
source: %1 (current)
de: %1 (Aktuelle)

# @action:button verb
source: &Schedule...
de: &Zeitplan ...

source: <br/>Switching to console mode will terminate all local X servers and leave you with console logins only. Graphical mode is automatically resumed 10 seconds after the last console session ends or after 40 seconds if no-one logs in in the first place.<br/>
de: <br/>Der Wechsel zum Konsolenmodus beendet alle lokalen X-Server und lässt nur noch die Anmeldung mittels Konsole zu. 10 Sekunden nach Beenden der letzten Konsolen-Sitzung bzw. 40 Sekunden ohne erstmaliges Anmelden wird automatisch zum grafischen Modus zurückgekehrt.<br/>

source: Turn Off Computer
de: Rechner ausschalten

source: Switch to Console
de: Umschalten zur Konsole

source: Restart Computer
de: Rechner neu starten

source: <br/>(Next boot: %1)
de: <br/>(Nächster Start: %1)

source: Abort active sessions:
de: Aktive Sitzungen abbrechen:

source: No permission to abort active sessions:
de: Keine Rechte zum Abbrechen aktiver Sitzungen:

# @title:column
source: Session
de: Sitzung

# @title:column ... of session
source: Location
de: Ort

source: Cancel pending shutdown:
de: Herunterfahren abbrechen:

source: No permission to cancel pending shutdown:
de: Keine Rechte zum Abbrechen des Herunterfahrens:

# start of shutdown:
source: now
de: jetzt

# timeout of shutdown:
source: infinite
de: unbegrenzt

source: Owner: %1 Type: %2%5 Start: %3 Timeout: %4
de: Eigentümer: %1 Typ: %2%5 Start: %3 Zeitlimit: %4

# owner of shutdown:
source: console user
de: Konsolenbenutzer

# owner of shutdown:
source: control socket
de: Kontroll-Socket

source: turn off computer
de: Rechner ausschalten

source: restart computer
de: Rechner neu starten

source: Next boot: %1
de: Nächster Start: %1

source: After timeout: %1
de: Nach Wartezeitüberschreitung: %1

# after timeout:
source: abort all sessions
de: Alle Sitzungen beenden

# after timeout:
source: abort own sessions
de: Eigene Sitzungen beenden

# after timeout:
source: cancel shutdown
de: Herunterfahren abbrechen

source: Sw&itch User
de: Benutzer &wechseln

source: Canc&el Session
de: Sitzung abbr&echen

source: R&estart X Server
de: &X-Server neu starten

source: Clos&e Connection
de: &Verbindung schließen

source: Co&nsole Login
de: Text-&Konsolen-Modus

source: &Shutdown...
de: &Herunterfahren ...

# @item:inlistbox session type
source: Default
de: Standard

# @item:inlistbox session type
source: Custom
de: Benutzerdefiniert

# @item:inlistbox session type
source: Failsafe
de: Abgesichert

# @item:inmenu session type
source: %1 (previous)
de: %1 (vorherige)

source: Your saved session type '%1' is not valid any more. Please select a new one, otherwise 'default' will be used.
de: Der gespeicherte Sitzungstyp „%1“ ist nicht mehr gültig. Bitte wählen Sie einen neuen. Sonst wird die Voreinstellung verwendet.

source: Warning: this is an unsecured session
de: Achtung: Dies ist eine ungesicherte Sitzung

source: This display requires no X authorization. This means that anybody can connect to it, open windows on it or intercept your input.
de: Diese Anzeige erfordert keine X-Autorisierung. Das bedeutet, dass jeder eine Verbindung aufnehmen, Fenster öffnen oder Ihre Eingaben abfangen kann.

# @action:button
source: L&ogin
de: &Anmelden

# @title:menu
source: Session &Type
de: Si&tzungsart

# @title:menu
source: &Authentication Method
de: &Authentifizierungs-Methode

# @action:inmenu
source: &Remote Login
de: Anmeldung auf &Fremdrechner

source: Login failed
de: Anmeldung fehlgeschlagen

source: No greeter widget plugin loaded. Check the configuration.
de: Kein Begrüßungs-Modul geladen. Bitte überprüfen Sie die Einrichtung des Programms.

source: Logging in %1...
de: %1 wird angemeldet ...

source: You are required to change your password immediately (password aged).
de: Sie müssen Ihr Passwort umgehend ändern. Das bisherige wurde zu lange nicht geändert.

source: You are required to change your password immediately (root enforced).
de: Sie müssen Ihr Passwort umgehend ändern. (Anforderung des Systemverwalters.)

source: You are not allowed to login at the moment.
de: Sie dürfen sich derzeit nicht anmelden.

source: Home folder not available.
de: Persönlicher Ordner nicht verfügbar

source: Logins are not allowed at the moment. Try again later.
de: Eine Anmeldung am System ist derzeit nicht möglich. Bitte versuchen Sie es später noch einmal.

source: Your login shell is not listed in /etc/shells.
de: Ihre Anmelde-Shell ist nicht in /etc/shells aufgeführt.

source: Root logins are not allowed.
de: Anmeldung des Benutzers root ist nicht zulässig.

source: Your account has expired; please contact your system administrator.
de: Ihre Zugangsberechtigung ist abgelaufen. Bitte nehmen Sie Kontakt mit der Systemverwaltung auf.

source: A critical error occurred. Please look at KDM's logfile(s) for more information or contact your system administrator.
de: Es ist ein schwerer Fehler aufgetreten. Sehen Sie bitte in den Protokolldateien von KDM nach weiteren Informationen oder benachrichtigen Sie Ihren Systemverwalter.

source: Your account expires tomorrow.
de: Ihre Zugangsberechtigung läuft morgen ab.

source: Your account expires today.
de: Ihre Zugangsberechtigung läuft heute ab.

source: Your password expires tomorrow.
de: Ihr Passwort läuft morgen ab.

source: Your password expires today.
de: Ihr Passwort läuft heute ab.

source: Authentication failed
de: Authentifizierung fehlgeschlagen

source: Authenticated user (%1) does not match requested user (%2).
de: Der authentifizierte Benutzer (%1) entspricht nicht dem angeforderten Benutzer (%2).

source: Automatic login in 1 second...
de: Automatische Anmeldung in einer Sekunde ...

source: Warning: Caps Lock is on
de: Warnung: Feststelltaste aktiviert

source: Change failed
de: Änderung fehlgeschlagen

source: Theme not usable with authentication method '%1'.
de: Das Design kann nicht mit der Authentifizierungsmethode „%1“ verwendet werden.

# @title:window
source: <qt><b>Changing authentication token</b></qt>
de: <qt><b>Token für Authentifizierung wird geändert.</b></qt>

source: Fancy desktop background for kdm
de: Schicker Arbeitsflächenhintergrund für KDM

source: Name of the configuration file
de: Name der Konfigurationsdatei

# @action:button
source: Lan_guage
de: _Sprache

# @action:button
source: Session _Type
de: Sitzungs_art

# @action:button
source: _Menu
de: _Menü

# @action:button ... from XDMCP server
source: Disconn_ect
de: _Trennen

# @action:button
source: _Quit
de: Be_enden

# @action:button
source: Power o_ff
de: Aus_schalten

# @action:button
source: Re_boot
de: _Neu starten

# @action:button
source: _Remote login
de: Anmeldung an _Fremdrechner

source: Caps Lock is enabled
de: Die Hochstelltaste ist aktiviert

source: User %u will log in in %t
de: Der Benutzer %u wird angemeldet in %t

source: Welcome to %h
de: Willkommen auf %h

source: _Domain:
de: _Domäne:

source: _Username:
de: _Benutzername:

source: _Password:
de: _Passwort:

# @action:button
source: _Login
de: _Anmelden

# will login in ...
source: 1 second
de: 1 Sekunde

source: Cannot open theme file %1
de: Die Design-Datei %1 kann nicht geöffnet werden

source: Cannot parse theme file %1
de: Die Design-Datei %1 kann nicht ausgelesen werden

source: %1 does not seem to be a correct theme file
de: Die Datei %1 scheint keine gültige Design-Datei zu sein.

# user: ...
source: %2: TTY login
de: %2: TTY-Sitzung

# ... session
source: Unused
de: Unbenutzt

# ... host
source: X login on %1
de: X-Anmeldung auf %1
