Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/kde-workspace/kinfocenter.po
Languages: de

# NAME OF TRANSLATORS
source: Your names
de: Thomas Diehl,Thomas Reitelbach

# EMAIL OF TRANSLATORS
source: Your emails
de: thd@kde.org,tr@erdfunkstelle.de

# Main window title
source: KInfocenter
de: KDE-Infozentrum

# Information about current module located in about menu
source: About Current Information Module
de: Über das aktuelle Informationsmodul

# Export button label
source: Export
de: Exportieren

# Module help button label
source: Module Help
de: Modul-Hilfe

# Help button label
source: Help
de: Hilfe

# Search Bar Click Message
source: Search
de: Suchen

# Kaction search label
source: Search Modules
de: Module suchen

source: Export of the module has produced no output.
de: Das Exportieren des Moduls hal keine Audgaben erzeugt.

source: Unable to open file to write export information
de: Datei zum Schreiben der Exportinformationen kann nicht geöffnet werden

source: Export information for %1
de: Exportinformationen für %1

source: Information exported
de: Informationen exportiert

source: Information Modules
de: Informationsmodule

# @title:menu
source: Main Toolbar
de: Haupt-Werkzeugleiste

source: KDE Info Center
de: KDE-Infozentrum

source: The KDE Info Center
de: Das KDE-Infozentrum

source: (c) 2009-2010, The KDE SC KInfocenter Development Team
de: © 2009–2010, das Entwickler-Team des KDE-Infozentrums

source: Current Maintainer
de: Aktueller Betreuer

source: Previous Maintainer
de: Ehemaliger Betreuer

source: Clear Search
de: Suchfeld leeren

source: Expand All Categories
de: Alle Kategorien aufklappen

source: Collapse All Categories
de: Alle Kategorien zusammenklappen
