Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/kde-workspace/krandr.po
Languages: de

# NAME OF TRANSLATORS
source: Your names
de: Thomas Diehl,Thomas Reitelbach

# EMAIL OF TRANSLATORS
source: Your emails
de: thd@kde.org,tr@erdfunkstelle.de

source: Your X server does not support resizing and rotating the display. Please update to version 4.3 or greater. You need the X Resize, Rotate, and Reflect extension (RANDR) version 1.1 or greater to use this feature.
de: Ihr X-Server unterstützt keine Änderungen der Größe und Ausrichtung. Bitte verwenden Sie XFree in Version 4.3 oder neuer. Sie benötigen zudem die Erweiterung „X Resize, Rotate and Reflect“ (RANDR) in einer Version ab 1.1.

source: Required X Extension Not Available
de: Die benötigte X-Erweiterung ist nicht verfügbar.

source: Screen %1
de: Bildschirm %1

source: Configure Display...
de: Anzeige einrichten ...

source: Display
de: Anzeige

source: Resize, rotate and configure screens.
de: Bildschirmgröße &amp; Ausrichtung ändern.

source: Resolution: %1 x %2
de: Auflösung: %1 × %2

source: Rotation: %1
de: Drehung: %1

source: Disabled
de: Deaktiviert

source: <td align="right">Resolution: </td><td>%1 x %2</td></tr>
de: <td align="right">Auflösung: </td><td>%1 × %2</td></tr>

source: Refresh:
de: Bildwiederholrate:

source: Rotation:
de: Drehung:

source: Screen configuration has changed
de: Bildschirmeinstellungen wurden geändert

source: Screen Size
de: Bildschirmgröße

source: Orientation
de: Ausrichtung

source: Outputs
de: Ausgaben

source: %1 - Screen Size
de: %1 – Bildschirmgröße

source: Disable
de: Deaktivieren

source: Refresh Rate
de: Bildwiederholrate

# (checkbox) designate this output as the primary output
source: Primary output
de: Hauptbildschirm

source: Unify Outputs
de: Ausgaben vereinheitlichen

source: Configure Display
de: Anzeige einrichten

source: 1 second remaining:
de: Noch 1 Sekunde:

source: Screen Resize and Rotate Settings
de: Einstellungen zu Größe und Ausrichtung des Bildschirms

source: If this option is enabled, options set by the system tray applet will be saved and loaded when KDE starts instead of being temporary.
de: Wenn diese Einstellung aktiv ist, werden die Einstellungen zu Größe und Ausrichtung, die im Systemabschnitt der Kontrollleiste festgelegt wurden, bei jedem KDE-Start angewandt. Sonst gelten sie nur für die aktuelle Sitzung.

source: Settings for screen:
de: Einstellungen für Bildschirm:

source: The screen whose settings you would like to change can be selected using this drop-down list.
de: Über diese Aufklappliste wählen Sie den Bildschirm, dessen Einstellungen Sie ändern möchten.

source: Screen size:
de: Bildschirmgröße:

source: The size, otherwise known as the resolution, of your screen can be selected from this drop-down list.
de: Die Größe, die mit der so genannten „Auflösung“ zusammenhängt, lässt sich über diese Aufklappliste festlegen.

source: Refresh rate:
de: Bildwiederholrate:

source: The refresh rate of your screen can be selected from this drop-down list.
de: Die Bildwiederholrate lässt sich über diese Aufklappliste festlegen.

source: The options in this section allow you to change the rotation of your screen.
de: Die Einstellungen dieses Abschnitts ermöglichen eine Rotation der Bildschirmdarstellung.

source: Orientation (degrees counterclockwise)
de: Ausrichtung (Grad entgegen dem Uhrzeigersinn)

source: If this option is enabled the size and orientation settings will be used when KDE starts.
de: Bei Aktivierung dieser Option werden die Einstellungen zu Größe und Ausrichtung beim KDE-Start angewandt.

source: Apply settings on KDE startup
de: Einstellungen beim KDE-Start anwenden

source: Allow tray application to change startup settings
de: Ändern der Starteinstellungen durch Programm im Systemabschnitt der Kontrollleiste zulassen

source: New configuration: Resolution: %1 x %2 Orientation: %3
de: Neue Einstellung: Auflösung: %1 × %2 Ausrichtung: %3

source: New configuration: Resolution: %1 x %2 Orientation: %3 Refresh rate: %4
de: Neue Einstellung: Auflösung: %1 × %2 Ausrichtung: %3 Bildwiederholrate: %4

source: Resize and Rotate
de: Größe ändern und rotieren

source: X Resize and Rotate System Tray App
de: Programm im Systemabschnitt der Kontrollleiste zum Verändern der Größe und Drehung

source: (c) 2007 Gustavo Pichorim Boiko, 2002-2003 Hamish Rodda
de: © 2007 Gustavo Pichorim Boiko, 2002–2003 Hamish Rodda

source: Maintainer
de: Betreuer

source: Original Author
de: Ursprünglicher Autor

source: Many fixes
de: Viele Fehlerbereinigungen

source: Many fixes, multi-head support
de: Viele Fehlerbereinigungen, Multihead-Unterstützung

source: Application is being auto-started at KDE session start
de: Die Anwendung wird beim Anmelden von KDE automatisch gestartet

source: Left of
de: Links von

source: Right of
de: Rechts von

# Output is placed above another one
source: Above
de: Über

# Output is placed below another one
source: Below
de: Unter

source: Clone of
de: Klon von

# Fixed, abitrary position
source: Absolute
de: Absolut

source: No relative position
de: Keine relative Position

# Screen size
source: Disabled
de: Deaktiviert

# Automatic refresh rate configuration
source: Auto
de: Automatisch

source: Output Config
de: Ausgaben

source: Size:
de: Größe:

source: Refresh:
de: Bildwiederholrate:

source: Orientation:
de: Ausrichtung:

source: No Rotation
de: Keine Drehung

source: Left (90 degrees)
de: Links (90 Grad)

source: Upside-Down (180 degrees)
de: Umkehren (180 Grad)

source: Right (270 degrees)
de: Rechts (270 Grad)

source: Mirror Horizontally
de: Waagerecht spiegeln

source: Mirror Vertically
de: Senkrecht spiegeln

source: Unknown Orientation
de: Unbekannte Ausrichtung

source: Not Rotated
de: Nicht gedreht

source: Rotated 90 Degrees Counterclockwise
de: 90 Grad gegen den Uhrzeigersinn

source: Rotated 180 Degrees Counterclockwise
de: 180 Grad gegen den Uhrzeigersinn

source: Rotated 270 Degrees Counterclockwise
de: 270 Grad gegen den Uhrzeigersinn

source: Mirrored Horizontally And Vertically
de: Waagerecht und senkrecht gespiegelt

source: mirrored horizontally and vertically
de: waagerecht und senkrecht gespiegelt

source: Mirrored Horizontally
de: Waagerecht gespiegelt

source: mirrored horizontally
de: waagerecht gespiegelt

source: Mirrored Vertically
de: Senkrecht gespiegelt

source: mirrored vertically
de: senkrecht gespiegelt

source: unknown orientation
de: unbekannte Ausrichtung

source: Confirm Display Setting Change
de: Änderung der Bilddarstellung bestätigen

source: &Accept Configuration
de: &Einrichtung beibehalten

source: &Revert to Previous Configuration
de: Zur &vorherigen Einrichtung zurückkehren

source: Your screen configuration has been changed to the requested settings. Please indicate whether you wish to keep this configuration. In 15 seconds the display will revert to your previous settings.
de: Die Bildschirm-Einstellungen wurden entsprechend Ihrer Vorgaben geändert. Bitte entscheiden Sie, ob sie diese Einstellungen beibehalten möchten. Sonst wird der Bildschirm in 15 Sekunden auf die vorherigen Einstellungen zurückgesetzt.

source: Save as Default
de: Als Standard speichern

source: Reset
de: Zurücksetzen

# No display selected
source: None
de: Keiner

source: %1 (Connected)
de: %1 (Verbunden)

source: Configuration has been set as the desktop default.
de: Die Einstellung wurde als Standard für die Arbeitsfläche übernommen.

source: Default desktop setup has been reset.
de: Die voreingestellte Arbeitsflächeneinstellung ist wiederhergestellt.

source: Insufficient virtual size for the total screen size. The configured virtual size of your X server is insufficient for this setup. This configuration needs to be adjusted. Do you wish to run a tool to adjust the configuration?
de: Unzureichende virtuelle Größe für die gesamte Bildschirmgröße. Die eingerichtete virtuelle Größe des X-Servers ist für diese Einstellung unzureichend; die Einstellungen müssen angepasst werden. Möchten Sie ein Hilfsprogramm zu diesem Zweck starten?

source: Configuration has been adjusted. Please restart your session for this change to take effect.
de: Die Einstellungen wurden aktualisiert. Damit die Änderungen wirksam werden, müssen Sie Ihre Sitzung neu starten.

source: Changing configuration failed. Please adjust your xorg.conf manually.
de: Das Ändern der Einstellungen ist fehlgeschlagen. Bitte passen Sie die Datei xorg.conf von Hand an.

source: Display Configuration (X11 Resize, Rotate and Reflect)
de: Bildschirmeinrichtung (X11-Größenänderung, Drehung und Anordnung)

source: Unify outputs
de: Ausgaben vereinheitlichen

source: Primary output:
de: Hauptbildschirm:

source: Identify Outputs
de: Bildschirme identifizieren

source: X Resize and Rotate extension version %1.%2
de: Programm zum Verändern der Größe und Rotieren, Version %1.%2
