Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/kde-workspace/ksplashthemes.po
Languages: de

# NAME OF TRANSLATORS
source: Your names
de: Thomas Reitelbach, Thomas Diehl

# EMAIL OF TRANSLATORS
source: Your emails
de: tr@erdfunkstelle.de, thd@kde.org

source: Get New Themes...
de: Neue Designs herunterladen ...

source: Get new themes from the Internet
de: Neue Designs aus dem Internet herunterladen

source: You need to be connected to the Internet to use this action. A dialog will display a list of themes from the http://www.kde.org website. Clicking the Install button associated with a theme will install this theme locally.
de: Damit dies funktioniert, muss eine Verbindung zum Internet bestehen. Es erscheint ein Fenster, in dem verfügbare Designs von http://www.kde.org angezeigt werden. Klicken Sie auf „Installieren“, um das jeweilige Design herunterzuladen und auf Ihrem Rechner zu installieren.

source: Install Theme File...
de: Design-Datei installieren ...

source: Install a theme archive file you already have locally
de: Installiert eine bereits vorliegende Design-Datei.

source: If you already have a theme archive locally, this button will unpack it and make it available for KDE applications
de: Wenn Sie bereits eine Design-Datei auf Ihrem Rechner haben, können Sie diese mit diesem Knopf auswählen und installieren.

source: Remove Theme
de: Design entfernen

source: Remove the selected theme from your disk
de: Ausgewähltes Design löschen

source: This will remove the selected theme from your disk.
de: Dadurch wird das ausgewählte Design vom Speichermedium gelöscht.

source: Test Theme
de: Design testen

source: Test the selected theme
de: Ausgewähltes Design testen

source: This will test the selected theme.
de: Hiermit können Sie das ausgewählte Design ausprobieren.

source: Delete folder %1 and its contents?
de: Ordner %1 samt Inhalt löschen?

source: &Delete
de: &Löschen

source: Failed to remove theme '%1'
de: Entfernen von Design %1 fehlgeschlagen

source: (Could not load theme)
de: (Das Design lässt sich nicht laden)

# Unknown name
source: Unknown
de: Unbekannt

# Unknown description
source: Unknown
de: Unbekannt

source: <b>Description:</b> %1
de: <b>Beschreibung:</b> %1

# Unknown version
source: Unknown
de: Unbekannt

# Unknown author
source: Unknown
de: Unbekannt

source: <b>Author:</b> %1
de: <b>Autor:</b> %1

# Unknown homepage
source: Unknown
de: Unbekannt

source: <b>Homepage:</b> %1
de: <b>Webseite:</b> %1

source: This theme requires the plugin %1 which is not installed.
de: Das Design erfordert das Modul %1 (nicht installiert).

source: Could not load theme configuration file.
de: Die Einrichtungsdatei für das Design lässt sich nicht laden.

source: No preview available.
de: Keine Vorschau verfügbar

source: KSplash Theme Files
de: KSplash-Designdateien

source: Add Theme
de: Design hinzufügen

source: Failed to successfully test the splash screen.
de: Fehler beim Testen des Startbildschirms.

source: &Theme Installer
de: &Design-Installer

source: KDE splash screen theme manager
de: KDE-Designverwaltung für Startbildschirme

source: (c) 2003 KDE developers
de: © 2003 KDE-Entwickler

source: Original KSplash/ML author
de: Ursprünglicher KSplash/ML-Autor

source: KDE Theme Manager authors
de: Autoren des KDE-Designmanagers

source: Original installer code
de: Ursprünglicher Installations-Code

source: <h1>Splash Screen Theme Manager </h1> Install and view splash screen themes.
de: <h1>Designverwaltung für Startbildschirm</h1> Zur Installation und Vorschau von Programmstart-Grafiken und -Designs.
