Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/kde-workspace/ksysguard.po
Languages: de

# NAME OF TRANSLATORS
source: Your names
de: Thomas Diehl

# EMAIL OF TRANSLATORS
source: Your emails
de: thd@kde.org

source: Connect Host
de: Mit Rechner verbinden

source: Host:
de: Rechner:

source: Enter the name of the host you want to connect to.
de: Geben Sie hier den Namen des Rechners ein, zu dem Sie eine Verbindung aufbauen möchten.

source: Connection Type
de: Verbindungsart

source: Select this to use the secure shell to login to the remote host.
de: Treffen Sie diese Auswahl, wenn Sie die „secure Shell“ (ein abgesichertes Terminalfenster) des anderen Rechners für die Anmeldung benutzen möchten.

source: Select this to use the remote shell to login to the remote host.
de: Treffen Sie diese Auswahl, wenn Sie die Shell des anderen Rechners für die Anmeldung benutzen möchten.

source: Daemon
de: Dienst

source: Select this if you want to connect to a ksysguard daemon that is running on the machine you want to connect to, and is listening for client requests.
de: Aktivieren Sie diese Einstellung, wenn Sie eine Verbindung zu einem KSysGuard-Dienst auf einer anderen Maschine herstellen möchten und dort Client-Anfragen angenommen werden.

source: Custom command
de: Benutzerdefinierter Befehl

source: Select this to use the command you entered below to start ksysguardd on the remote host.
de: Treffen Sie diese Auswahl, wenn Sie den unten eingegebenen Befehl für den Start von ksysguardd auf dem anderen Rechner benutzen möchten.

source: Enter the port number on which the ksysguard daemon is listening for connections.
de: Geben Sie hier die Portnummer an, unter welcher der KSysGuard-Dienst nach Verbindungen suchen soll.

source: e.g. 3112
de: z. B. 3112

source: Command:
de: Befehl:

source: Enter the command that runs ksysguardd on the host you want to monitor.
de: Geben Sie den Befehl ein, mit dem der KSysguard-Dienst (ksysguardd) auf dem Rechner gestartet wird, den Sie überwachen möchten.

source: e.g. ssh -l root remote.host.org ksysguardd
de: z. B. ssh -l root anderer.rechner.org ksysguardd

source: KDE System Monitor
de: KDE-Systemüberwachung

source: &Refresh Tab
de: Anzeige &aktualisieren

source: &New Tab...
de: &Neues Arbeitsblatt ...

source: Import Tab Fr&om File...
de: Arbeitsblatt aus Datei &importieren ...

source: Save Tab &As...
de: Arbeitsblatt speichern &unter ...

source: &Close Tab
de: Arbeitsblatt sch&ließen

source: Monitor &Remote Machine...
de: Entfernten Rechner ü&berwachen ...

source: &Download New Tabs...
de: Neue Arbeitsblätter &herunterladen ...

source: &Upload Current Tab...
de: Aktuelles Arbeitsblatt &hochladen ...

source: Tab &Properties
de: Arbeitsblatt-&Eigenschaften

source: 1 process1
de: 1 Prozess1

# Arguments are formatted byte sizes (used/total)
source: Memory: %1 / %2Mem: %1 / %2Mem: %1%1
de: Speicher: %1 / %2Mem: %1 / %2Mem: %1%1

source: No swap space available
de: Kein Auslagerungsspeicher verfügbar

# Arguments are formatted byte sizes (used/total)
source: Swap: %1 / %2Swap: %1%1
de: Auslagerungsspeicher: %1 / %2Auslagerungsspeicher: %1%1

source: (c) 1996-2008 The KDE System Monitor Developers
de: © 1996–2008, die Entwickler der KDE-Systemüberwachung

source: Current Maintainer
de: Aktueller Betreuer

source: Previous Maintainer
de: Vorheriger Betreuer

source: Solaris Support Parts derived (by permission) from the sunos5 module of William LeFebvre's "top" utility.
de: Solaris-Unterstützung Teilweise abgeleitet (mit freundlicher Genehmigung) aus dem SunOS5-Modul von William LeFebvres „top“-Programm.

source: Optional worksheet files to load
de: Optionales Arbeitsblatt, das geladen werden soll

source: &File
de: &Datei

source: &View
de: &Ansicht

source: &Settings
de: &Einstellungen

source: Main Toolbar
de: Haupt-Werkzeugleiste

source: Process Table
de: Prozesstabelle

source: Drag sensors to empty cells of a worksheet
de: Ziehen Sie Sensoren in leere Felder eines Arbeitsblattes

source: The sensor browser lists the connected hosts and the sensors that they provide. Click and drag sensors into drop zones of a worksheet. A display will appear that visualizes the values provided by the sensor. Some sensor displays can display values of multiple sensors. Simply drag other sensors on to the display to add more sensors.
de: Der Sensor-Browser zeigt alle verbundenen Rechner an sowie die Sensoren, die sie zur Verfügung stellen. Sie können diese Sensoren in die dafür vorgesehenen Zonen des Arbeitsblattes hineinziehen. Es erscheint eine Anzeige, welche die so verfügbar gemachten Werte optisch darstellt. Manche Sensor-Anzeigen können mehrere Werte darstellen. Ziehen Sie zusätzliche Sensoren auf die Anzeige, um sie hinzuzufügen.

source: Error
de: Fehler

source: Edit BarGraph Preferences
de: Eigenschaften der Balkengrafik bearbeiten

source: Range
de: Bereich

source: Title
de: Titel

source: Enter the title of the display here.
de: Geben Sie hier den Titel der Anzeige ein.

source: Display Range
de: Anzeigebereich

source: Minimum value:
de: Minimalwert:

source: Enter the minimum value for the display here. If both values are 0, automatic range detection is enabled.
de: Geben Sie hier den minimalen Wert für die Anzeige ein. Wenn beide Werte 0 sind, wird die automatische Bereichserkennung aktiviert.

source: Maximum value:
de: Maximalwert:

source: Enter the maximum value for the display here. If both values are 0, automatic range detection is enabled.
de: Geben Sie hier den maximalen Wert für die Anzeige ein. Wenn beide Werte 0 sind, wird die automatische Bereichserkennung aktiviert.

source: Alarms
de: Warnungen

source: Alarm for Minimum Value
de: Warnung bei Minimalwert

source: Enable alarm
de: Warnung aktivieren

source: Enable the minimum value alarm.
de: Warnung bei Erreichen des Minimalwerts aktivieren

source: Lower limit:
de: Untere Grenze:

source: Alarm for Maximum Value
de: Warnung bei Maximalwert

source: Enable the maximum value alarm.
de: Warnung bei Erreichen des Maximalwerts aktivieren

source: Upper limit:
de: Obere Grenze:

# @title:tab Appearance of the bar graph
source: Look
de: Optik

source: Normal bar color:
de: Farbe für Standardbalken:

source: Out-of-range color:
de: Farbe für Bereichs-Überschreitung:

source: Background color:
de: Hintergrundfarbe:

source: Font size:
de: Schriftgröße:

source: This determines the size of the font used to print a label underneath the bars. Bars are automatically suppressed if text becomes too large, so it is advisable to use a small font size here.
de: Das legt die Größe der Schrift fest, die für das Bezeichnungsfeld unterhalb der Balken verwendet wird. Die Balken werden automatisch ausgeblendet, falls der Text zu groß wird. Daher ist eine kleine Schrift anzuraten.

source: Sensors
de: Sensoren

source: Edit...
de: Bearbeiten ...

source: Push this button to configure the label.
de: Klicken Sie auf diesen Knopf, um die Bezeichnung festzulegen.

source: Delete
de: Entfernen

source: Push this button to delete the sensor.
de: Klicken Sie auf diesen Knopf, um den Sensor zu entfernen.

source: Label of Bar Graph
de: Bezeichnung für Balkengrafik

source: Enter new label:
de: Neue Bezeichnung eingeben:

source: Drop Sensor Here
de: Sensor hier ablegen

source: This is an empty space in a worksheet. Drag a sensor from the Sensor Browser and drop it here. A sensor display will appear that allows you to monitor the values of the sensor over time.
de: Dies ist ein freier Platz des Arbeitsblattes. Ziehen Sie einen Sensor aus dem Sensor-Browser und legen Sie ihn hier ab. Dann erscheint eine Sensor-Anzeige, die Ihnen die Überwachung des Sensors ermöglicht.

source: %1 of %2%1
de: %1 von %2%1

source: Plotter Settings
de: Plotter-Einstellungen

source: General
de: Allgemein

source: Title:
de: Titel:

source: Stack the beams on top of each other
de: Balken aufeinander stapeln

source: The beams are stacked on top of each other, and the area is drawn filled in. So if one beam has a value of 2 and another beam has a value of 3, the first beam will be drawn at value 2 and the other beam drawn at 2+3=5.
de: Die Balken werden übereinander gestapelt dargestellt und der Zwischenbereich wird entsprechend gefüllt. Wenn der erste Balken einen Wert von 2 hat und der zweite den Wert 3, so wird der erste Balken bei Skalawert 2 gezeichnet und der zweite bei 2+3=5.

source: Scales
de: Skalen

source: Vertical scale
de: Senkrechte Skala

source: Specify graph range:
de: Skalenbereich angeben:

source: Check this box if you want the display range to adapt dynamically to the currently displayed values; if you do not check this, you have to specify the range you want in the fields below.
de: Aktivieren Sie diese Einstellung, wenn Sie möchten, dass der Anzeigebereich automatisch an die jeweils angezeigten Werte angepasst wird. Wenn Sie die Einstellung nicht aktivieren, müssen Sie den Bereich für die unten angezeigten Felder angeben.

source: Enter the minimum value for the display here.
de: Geben Sie hier den Minimalwert für die Anzeige ein.

source: Enter the soft maximum value for the display here. The upper range will not be reduced below this value, but will still go above this number for values above this value.
de: Geben Sie hier den „weichen“ Maximalwert für die Anzeige ein. Der Obere Wert wird nicht unter diesen Wert fallen, kann aber bei Bedarf darüber liegen.

source: Horizontal scale
de: Waagerechte Skala

source: Pixels per time period:
de: Pixel pro Zeiteinheit:

source: Grid
de: Gitter

source: Lines
de: Linien

source: Vertical lines
de: Senkrechte Linien

source: Check this to activate the vertical lines if display is large enough.
de: Aktivieren Sie die Einstellung, wenn Sie senkrechte Linien angezeigt haben möchten, falls der Platz ausreicht.

source: Distance:
de: Entfernung:

source: Enter the distance between two vertical lines here.
de: Geben Sie hier den Abstand zwischen jeweils zwei der senkrechten Linien ein.

source: Vertical lines scroll
de: Verschiebung senkrechter Linien

source: Horizontal lines
de: Waagerechte Linien

source: Check this to enable horizontal lines if display is large enough.
de: Aktivieren Sie die Einstellung, wenn Sie waagerechte Linien angezeigt haben möchten, falls der Platz ausreicht.

source: Show axis labels
de: Achsenbeschriftungen anzeigen

source: Check this box if horizontal lines should be decorated with the values they mark.
de: Aktivieren Sie diese Einstellung, wenn Sie möchten, dass waagerechte Linien mit den entsprechenden Anzeigewerten dekoriert werden sollen.

source: Set Color...
de: Farbe festlegen ...

source: Push this button to configure the color of the sensor in the diagram.
de: Drücken Sie diesen Knopf, um die Farbe der Diagramm-Sensoren festzulegen.

source: Move Up
de: Nach oben

source: Move Down
de: Nach unten

source: Display Units
de: Einheiten anzeigen

source: Mixed
de: Gemischt

source: Kilobytes
de: Kilobyte

source: Megabytes
de: Megabyte

source: Gigabytes
de: Gigabyte

source: Terabytes
de: Terabyte

source: List View Settings
de: Ansichtseinstellungen auflisten

source: Colors
de: Farben

source: Text color:
de: Textfarbe:

source: Grid color:
de: Gitterfarbe:

source: File logging settings
de: Einstellungen für Protokolldatei

source: Foreground color:
de: Vordergrundfarbe:

source: T&itle:
de: T&itel:

source: &Add
de: &Hinzufügen

source: &Delete
de: &Löschen

source: &Change
de: Ä&ndern

# Multimeter is a sensor display that mimics 'digital multimeter' aparatus
source: Multimeter Settings
de: Multimeter-Einstellungen

source: &Title:
de: &Titel:

source: Enable this to append the unit to the title of the display.
de: Aktivieren Sie diese Einstellung, um die Einheit an den Titel der Anzeige anzuhängen.

source: &Show unit
de: &Einheit anzeigen

source: &Enable alarm
de: &Warnung aktivieren

source: Lo&wer limit:
de: &Untere Grenze:

source: E&nable alarm
de: &Warnung aktivieren

source: &Upper limit:
de: &Obere Grenze:

source: Normal digit color:
de: Normale Zahlenfarbe:

source: Alarm digit color:
de: Zahlenfarbe bei Warnungen:

source: &Properties
de: &Eigenschaften

source: &Remove Display
de: Anzeige ent&fernen

source: <qt><p>This is a sensor display. To customize a sensor display click the right mouse button here and select the <i>Properties</i> entry from the popup menu. Select <i>Remove</i> to delete the display from the worksheet.</p>%1</qt>
de: <qt><p>Dies ist eine Sensor-Anzeige. Um eine solche Anzeige zu verändern, drücken Sie die rechte Maustaste und wählen Sie <i>Eigenschaften</i> aus dem Kontext-Menü. Bei Auswahl von <i>Entfernen</i> wird die Anzeige aus dem Arbeitsblatt gelöscht.</p>%1</qt>

# @title:column
source: Logging
de: Protokollierung

# @title:column
source: Timer Interval
de: Zeitnahme-Intervall

# @title:column
source: Host Name
de: Rechnername

# @title:column
source: Log File
de: Protokolldatei

source: Sensor Logger
de: Sensor-Protokoll

source: &Remove Sensor
de: Anzeige ent&fernen

source: &Edit Sensor...
de: Sensor &bearbeiten ...

source: St&op Logging
de: Protokollierung &beenden

source: S&tart Logging
de: Protokollierung &starten

source: File
de: Datei

# @title:group
source: Timer Interval
de: Zeitnahme-Intervall

source: sec
de: Sek.

source: Sensor Logger Settings
de: Einstellungen für Sensor-Protokolle

source: Alarm color:
de: Warnungsfarbe:

source: Host
de: Rechner

source: Unit
de: Einheit

source: Label
de: Bezeichnung

source: System Load
de: Systemlast

source: CPU History
de: CPU-Verlauf

source: Memory and Swap History
de: Speicher- und Auslagerungsspeicher-Verlauf

source: Memory
de: Speicher

source: Swap
de: Auslagerungsspeicher

source: Network History
de: Netzwerk-Verlauf

source: Receiving
de: Empfang

source: Sending
de: Senden

source: Timer Settings
de: Multimeter-Einstellungen

source: Use update interval of worksheet
de: Aktualisierungsintervall des Arbeitsblattes verwenden

source: Update interval:
de: Aktualisierungsintervall:

source: All displays of the sheet are updated at the rate specified here.
de: Alle Anzeigen eines Arbeitsblattes werden mit der hier angegebenen Häufigkeit aktualisiert.

source: Cannot open the file %1.
de: Die Datei %1 lässt sich nicht öffnen.

source: The file %1 does not contain valid XML.
de: Die Datei %1 enthält kein gültiges XML.

source: The file %1 does not contain a valid worksheet definition, which must have a document type 'KSysGuardWorkSheet'.
de: Die Datei %1 enthält keine gültige Definition für ein Arbeitsblatt. Dabei muss es sich um ein Dokument vom Typ „KSysGuardWorkSheet“ handeln.

source: The file %1 has an invalid worksheet size.
de: Die Datei %1 besitzt keine gültige Größe für ein Arbeitsblatt.

source: Cannot save file %1
de: Die Datei %1 lässt sich nicht speichern.

source: The clipboard does not contain a valid display description.
de: Die Zwischenablage enthält keine gültige Anzeigebeschreibung.

source: Select Display Type
de: Anzeigetyp auswählen

source: &Line graph
de: &Liniendiagramm

source: &Digital display
de: &Digitalanzeige

source: &Bar graph
de: &Balkengrafik

source: Log to a &file
de: In &Datei protokollieren

source: Remove this display?
de: Diese Anzeige entfernen?

source: Remove Display
de: Anzeige entfernen

source: Dummy
de: Attrappe

source: Tab Properties
de: Arbeitsblatt-Eigenschaften

source: Properties
de: Eigenschaften

source: Rows:
de: Zeilen:

source: Columns:
de: Spalten:

source: Enter the number of rows the sheet should have.
de: Geben Sie die Anzahl der Zeilen für dieses Arbeitsblatt an.

source: Enter the number of columns the sheet should have.
de: Geben Sie die Zahl der Spalten an, die das Arbeitsblatt aufweisen soll.

source: Enter the title of the worksheet here.
de: Geben Sie hier den Titel für das Arbeitsblatt ein.

source: Sheet %1
de: Blatt %1

source: The tab '%1' contains unsaved data. Do you want to save the tab?
de: Das Arbeitsblatt „%1“ enthält ungesicherte Daten. Möchten Sie das Arbeitsblatt speichern?

source: *.sgrd|Sensor Files (*.sgrd)
de: *.sgrd|Sensor-Dateien (*.sgrd)

source: Select Tab File to Import
de: Wählen Sie ein Arbeitsblatt, das importiert werden soll.

source: You do not have a tab that could be saved.
de: Es existiert kein Arbeitsblatt, das gespeichert werden könnte.

source: Export Tab
de: Arbeitsblatt exportieren

source: There are no tabs that could be deleted.
de: Es existieren keine Arbeitsblätter, die gelöscht werden könnten.

source: <qt>To propose the current custom tab as a new System Monitor tab, email <br><a href="file:%1">%2</a><br> to <a href="mailto:john.tapsell@kde.org?subject='System Monitor Tab'&attach='file://%2'">john.tapsell@kde.org</a></qt>
de: <qt>Um das aktuelle benutzerdefinierte Arbeitsblatt als neues Systemmonitor-Arbeitsblatt vorzuschlagen, schicken Sie <br><a href="file:%1">%2</a><br>per E-Mail an <a href="mailto:john.tapsell@kde.org?subject='System Monitor Tab'&attach='file://%2'">john.tapsell@kde.org</a>.</qt>

source: Upload custom System Monitor tab
de: Benutzerdefiniertes Systemmonitor-Arbeitsblatt hochladen
