Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/kde-workspace/ksystraycmd.po
Languages: de

# NAME OF TRANSLATORS
source: Your names
de: Thomas Diehl

# EMAIL OF TRANSLATORS
source: Your emails
de: thd@kde.org

source: No window matching pattern '%1' and no command specified.
de: Es wurde weder ein Fenster angegeben, worauf das Muster „%1“ passen würde, noch ein Befehl, der ausgeführt werden könnte.

source: KSysTrayCmd: K3ShellProcess cannot find a shell.
de: KSysTrayCmd: Für K3ShellProcess ist keine Shell auffindbar.

source: &Hide
de: &Ausblenden

source: &Restore
de: &Wiederherstellen

source: &Undock
de: &Abdocken

source: &Quit
de: Be&enden

source: Allows any application to be kept in the system tray
de: Ermöglicht die Einbettung jedes Programms im Systemabschnitt der Kontrollleiste

source: (C) 2001-2002 Richard Moore (rich@kde.org)
de: © 2001–2002 Richard Moore (rich@kde.org)

source: Command to execute
de: Auszuführender Befehl

source: A regular expression matching the window title If you do not specify one, then the very first window to appear will be taken - not recommended.
de: Regulärer Ausdruck, der dem Fenstertitel entspricht. Falls Sie keinen festlegen, wird das zuerst auftauchende Fenster benutzt. Das ist nicht zu empfehlen.

source: The window id of the target window Specifies the id of the window to use. If the id starts with 0x it is assumed to be in hex.
de: Fenster-Identifikation des Zielfensters. Gibt die Kennung des benutzten Fensters an. Beginnt die Kennung mit 0x, so wird von einem Hex-Wert ausgegangen.

source: Hide the window to the tray on startup
de: Fenster beim Start in Kontrollleiste einbetten

source: Wait until we are told to show the window before executing the command
de: Führt den Befehl erst dann aus, wenn das Fenster angezeigt werden soll

source: Sets the initial tooltip for the tray icon
de: Legt die erste Kurzinfo für das Symbol des angedockten Programms fest.

source: Keep the tray icon even if the client exits. This option has no effect unless startonshow is specified.
de: Symbol weiterhin im Systembereich anzeigen, auch wenn das Client-Programm geschlossen wurde. Diese Option ist folgenlos, falls nicht „startonshow“ angegeben wurde.

source: Use ksystraycmd's icon instead of the window's icon in the systray (should be used with --icon to specify ksystraycmd icon)
de: Das mittels ksystraycmd übergebene anstatt dem fenstereigenen Symbol verwenden. (Verwenden Sie dies mit der Option „--icon“, um das Symbol anzugeben.)

source: Try to keep the window above other windows
de: Fenster möglichst im Vordergrund halten

source: Quit the client when we are told to hide the window. This has no effect unless startonshow is specified and implies keeprunning.
de: Client-Programm schließen, sobald das Fenster ausgeblendet werden soll. Diese Option ist folgenlos, falls nicht „startonshow“ angegeben und außerdem „keeprunning“ impliziert wurde.

source: No command or window specified
de: Kein Befehl oder Fenstertitel angegeben
