Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/kde-workspace/plasma_engine_nowplaying.po
Languages: de

source: The player '%1' cannot be found.
de: Der Medienabspieler „%1“ kann nicht gefunden werden

source: The player '%1' cannot perform the action 'play'.
de: Der Medienabspieler „%1“ kann die Aktion „Abspielen“ nicht durchführen.

source: The player '%1' cannot perform the action 'pause'.
de: Der Medienabspieler „%1“ kann die Aktion „Pause“ nicht durchführen.

source: The player '%1' cannot perform the action 'stop'.
de: Der Medienabspieler „%1“ kann die Aktion „Stopp“nicht durchführen.

source: The player '%1' cannot perform the action 'previous'.
de: Der Medienabspieler „%1“ kann die Aktion „Vorheriges Stück“ nicht durchführen.

source: The player '%1' cannot perform the action 'next'.
de: Der Medienabspieler „%1“ kann die Aktion „Nächstes Stück“ nicht durchführen.

source: The 'level' argument to the 'volume' command must be between 0 and 1.
de: Das Argument „level“ zum Befehl „Lautstärke“ muss zwischen 0 und 1 liegen.

source: The 'volume' command requires a 'level' argument.
de: Der Befehl „Lautstärke“ erfordert das Argument „level“.

source: The player '%1' cannot perform the action 'volume'.
de: Der Medienabspieler „%1“ kann die Aktion „Lautstärke“ nicht durchführen.

source: The 'seconds' argument to the 'seek' command must be between 0 and the length of the track.
de: Das Argument „Sekunden“ zum Befehl „Suchen“ muss zwischen 0 und der Stücklänge liegen.

source: The 'seek' command requires a 'seconds' argument.
de: Der Befehl „Suchen“ benötigt das Argument „Sekunden“.

source: The player '%1' cannot perform the action 'seek'.
de: Der Medienabspieler „%1“ kann die Aktion „Suchen“ nicht durchführen.
