Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/kde-workspace/plasma_engine_share.po
Languages: de

source: Executable Scripts
de: Ausführbare Skripte

source: Main Script File
de: Haupt-Skriptdatei

source: Could not detect the file's mimetype
de: Der MIME-Typ der Datei kann nicht ermittelt werden.

source: It was not possible to read the selected file
de: Die ausgewählte Datei kann nicht gelesen werden.

source: Service was not available
de: Der Dienst ist nicht verfügbar.

source: You must specify a URL for this service
de: Für diesen Dienst muss eine Adresse angegeben werden

source: Could not find the provider with the specified destination
de: Der Anbieter kann beim angegebenen Ziel nicht gefunden werden.

source: Invalid path for the requested provider
de: Der Pfad zum abgefragten Anbieter ist ungültig.

source: Selected provider does not have a valid script file
de: Der ausgewählte Anbieter besitzt keine gültige Skriptdatei.

source: Selected provider does not provide a supported script file
de: Der ausgewählte Anbieter bietet keine unterstützte Skriptdatei.

source: Error trying to execute script
de: Beim Ausführen des Skriptes ist ein Fehler aufgetreten.

source: Could not find all required functions
de: Es können nicht alle benötigten Funktionen gefunden werden.

source: Unknown Error
de: Unbekannter Fehler
