Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/kde-workspace/plasma_applet_notifier.po
Languages: de

source: Removable devices only
de: Nur Wechselmedien

source: Non-removable devices only
de: Nur Nicht-Wechselmedien

source: All devices
de: Alle Geräte

source: Accessing...
de: Wird eingebunden ...

source: Removing...
de: Einbindung wird gelöst ...

source: 1 action for this device
de: 1 Aktion für dieses Gerät

# @info:status Free disk space
source: %1 free
de: %1 frei

source: Click to mount this device.
de: Klicken Sie, um dieses Gerät einzubinden.

source: Click to eject this disc.
de: Klicken Sie, um dieses Medium auszuwerfen.

source: Click to safely remove this device.
de: Klicken Sie, um dieses Gerät sicher zu trennen.

source: Click to access this device from other applications.
de: Klicken Sie, um mit anderen Anwendungen auf das Gerät zugreifen zu können.

source: It is currently <b>not safe</b> to remove this device: applications may be accessing it. Click the eject button to safely remove this device.
de: Das Entfernen dieses Gerätes ist derzeit <b>nicht sicher,</b> da möglicherweise Anwendungen darauf zugreifen. Drücken Sie auf den <b>Auswurf</b>knopf, um es sicher entfernen zu können.

source: This device is currently accessible.
de: Auf dieses Gerät kann zurzeit zugegriffen werden.

source: It is currently <b>not safe</b> to remove this device: applications may be accessing other volumes on this device. Click the eject button on these other volumes to safely remove this device.
de: Das Entfernen dieses Gerätes ist derzeit <b>nicht sicher,</b> da möglicherweise Anwendungen auf andere Partitionen zugreifen. Drücken Sie auf die <b>Auswurf</b>knöpfe der anderen Partitionen, um es sicher entfernen zu können.

source: It is currently safe to remove this device.
de: Es ist sicher, dieses Gerät zu entfernen.

source: This device is not currently accessible.
de: Auf dieses Gerät kann zurzeit nicht zugegriffen werden.

source: No devices available
de: Es sind keine Geräte verfügbar

source: Most recent device
de: Zuletzt angeschlossenes Gerät

source: Available Devices
de: Verfügbare Geräte

source: No Devices Available
de: Es sind keine Geräte verfügbar
