Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/kde-workspace/plasma-netbook.po
Languages: de

# NAME OF TRANSLATORS
source: Your names
de: Frederik Schwarzer

# EMAIL OF TRANSLATORS
source: Your emails
de: schwarzer@kde.org

source: The KDE workspace application optimized for Netbook devices.
de: Die KDE-Umgebung optimiert für Netbook-Geräte.

source: Plasma Netbook Shell
de: Plasma-Netbook-Umgebung

source: Copyright 2006-2009, The KDE Team
de: © 2006–2009, Das KDE-Team

source: Author and maintainer
de: Autor und Betreuer

source: Starts as a normal application instead of as the primary user interface
de: Startet wie ein herkömmliches Programm anstatt als Haupt-Benutzerschnittstelle.

source: Use OpenGL to draw the main screen
de: OpenGL für den Hauptbildschirm verwenden

source: The geometry of the screen
de: Die Geometrie des Bildschirms

source: Add page
de: Seite hinzufügen

# Page number
source: Page %1
de: Seite %1

source: Screen edge
de: Bildschirmkante

source: Height
de: Höhe

source: Auto Hide
de: Automatisch ausblenden

source: Width
de: Breite

source: widgetById requires a name of a widget or a widget object, with the row and column coordinates
de: „widgetById“ benötigt den Namen eines Miniprogramms oder ein Miniprogramm-Objekt unter Angabe der Zeile und Spalte.
