Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/kde-workspace/plasma-overlay.po
Languages: de

# NAME OF TRANSLATORS
source: Your names
de: Thomas Reitelbach

# EMAIL OF TRANSLATORS
source: Your emails
de: tr@erdfunkstelle.de

source: Background Settings
de: Hintergrundeinstellungen

source: No Wallpaper
de: Kein Hintergrundbild

source: Wallpaper
de: Hintergrundbild

source: Type:
de: Typ

source: Plasma widgets over the screensaver
de: Plasma-Miniprogramme über dem Bildschirmschoner

source: Plasma for the Screensaver
de: Plasma für den Bildschirmschoner

source: Copyright 2006-2008, The KDE Team
de: © 2006–2008, die KDE-Entwickler

source: Author and maintainer
de: Autor und Betreuer

source: Plasma Author and maintainer
de: Plasma-Autor und Betreuer

source: In memory of his contributions, 1937-1998.
de: Im Gedenken an seine Beiträge, 1937–1998

source: Enables some cheats that are useful for debugging.
de: Aktiviert einige Tricks zur Fehlersuche.

source: Start unlocked for configuration.
de: Zur Einrichtung ungesperrt starten.

source: Lock Screen
de: Bildschirm sperren

source: Configure Widgets
de: Miniprogramme einrichten

source: Leave Screensaver
de: Bildschirmschoner verlassen

source: Unlock
de: Sperre aufheben

source: Unlock widgets to configure them
de: Miniprogramme entsperren, um diese einzurichten

source: Setup Mode - Screen is NOT locked
de: Einrichtungsmodus – Der Bildschirm ist NICHT gesperrt!
