Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/kde-workspace/plasma_runner_solid.po
Languages: de

source: Eject medium
de: Medium auswerfen

source: Mount the device
de: Das Gerät einbinden

source: Unmount the device
de: Die Geräte-Einbindung lösen

source: Unlock the container
de: Container entsperren

source: Lock the container
de: Container sperren

source: Finds devices whose name match :q:
de: Findet Geräte, deren Name auf :q: passt.

source: Lists all devices and allows them to be mounted, unmounted or ejected.
de: Zeigt alle Geräte an und ermöglicht das Einbinden, das Lösen der Einbindung oder das Auswerfen des Mediums.

source: Lists all devices which can be mounted, and allows them to be mounted.
de: Zeigt alle Geräte an, die eingebunden werden können und ermöglicht deren Einbindung.

source: Lists all encrypted devices which can be unlocked, and allows them to be unlocked.
de: Zeigt alle verschlüsselten Geräte an, die entsperrt werden können und ermöglicht das Entsperren der Geräte.

source: Lists all devices which can be unmounted, and allows them to be unmounted.
de: Zeigt alle Geräte an, deren Einbindung gelöst werden kann und ermöglicht das Lösen der Einbindung.

source: Lists all encrypted devices which can be locked, and allows them to be locked.
de: Zeigt alle verschlüsselten Geräte an, die gesperrt werden können und ermöglicht das Sperren der Geräte.

source: Lists all devices which can be ejected, and allows them to be ejected.
de: Zeigt alle Geräte an, die ausgeworfen werden können und ermöglicht das Auswerfen.
