Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/kde-workspace/plasma-windowed.po
Languages: de

# NAME OF TRANSLATORS
source: Your names
de: Frederik Schwarzer

# EMAIL OF TRANSLATORS
source: Your emails
de: schwarzer@kde.org

source: Shell used to load Plasma widgets as stand-alone applications.
de: Umgebung, um Plasma-Miniprogramme als eigenständige Anwendungen zu starten

source: Plasma Widgets shell
de: Plasma-Shell

source: Copyright 2006-2009, The KDE Team
de: Copyright © 2006-2009, Das KDE-Team

source: Author and maintainer
de: Autor und Betreuer

source: Show window decorations around the widget
de: Fensterdekoration um das Miniprogramm anzeigen

source: Do not show window decorations around the widget
de: Keine Fensterdekoration um das Miniprogramm anzeigen

source: Display the widget fullscreen
de: Das Miniprogramm im Vollbildmodus anzeigen

source: Name of applet to view; may refer to the plugin name or be a path (absolute or relative) to a package. If not provided, then an attempt is made to load a package from the current directory.
de: Name des anzuzeigenden Miniprogramms; dies könnte der Modulname oder ein Pfad zu einem Paket sein (absolut oder relativ). Falls nicht angegeben, wird versucht, ein Paket aus dem aktuellen Ordner zu laden.

source: Optional arguments for the applet to add
de: Optionale Argumente für das hinzuzufügende Miniprogramm
