Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdeaccessibility/jovie.po
Languages: de

source: Types of &jovie; Messages
de: &jovie;-Nachrichtentypen

source: To understand how to use filters, it is helpful to first understand how text is processed by speech-dispatcher. Text spoken by &jovie; is of four possible types.
de: Um die Arbeitsweise von Filtern zu verstehen, ist es wichtig zu wissen, wie das Programm "speech-dispatcher" mit einem Text arbeitet. &jovie; unterscheidet vier Arten von Texten.

source: Screen Reader Output.
de: Ausgaben von Screen-Readern

source: Warnings.
de: Warnungen

source: Messages
de: Nachrichten

source: Text Jobs
de: Textaufträge

source: The type is determined by the application that sends the text to &jovie;.
de: Der Typ wird von der Anwendungen festgelegt, die eine Nachricht an &jovie; verschickt.

source: Screen Reader Output has the highest priority. It is reserved for use by Screen Reader applications. Screen Reader Output preempts all other messages, causing those jobs to pause. Once the Screen Reader Output has been spoken, the preempted messages will automatically resume.
de: Die Ausgabe von Screen-Readern hat die höchste Priorität. Sie wird allen anderen Aufträgen vorgezogen und hält diese Aufträge an. Wenn die Ausgabe der Screen-Reader vorgelesen ist, werden die angehaltenen Aufträge wieder fortgesetzt.

source: Warnings are the next highest priority. It is reserved for high-priority messages, such as "CPU is over-heating." A Warning will preempt Messages and regular text, causing those jobs to pause. Once the Warning has been spoken, the preempted messages will automatically resume.
de: Warnungen haben die nächste Priorität. Diese Stufe ist wichtigen Nachrichten wie &eg; <quote>Prozessor wird zu heiß</quote> vorbehalten. Eine Warnung hat Vorrang und hält die Ausgabe von Nachrichten und normalem Text an. Diese Aufträge werden nach der Ausgabe der Warnung wieder fortgesetzt.

source: Messages are the next highest priority. A Message will preempt regular text jobs. &kmouth; is an example of an application that uses Messages. For example, while reading out long text from a web page, &kmouth; can be used to greet someone who walks into the room. &kde; Notifications are also Messages (see <xref linkend="knotify"/>).
de: Nachrichten haben die nächsthöchste Priorität. Eine Nachricht unterbricht normalen Text. &kmouth; ist ein Beispiel für eine Anwendung, die Nachrichten verwendet. Während Sie &eg; einen langen Text auf einer Webseite vorlesen lassen, können Sie mit &kmouth; jemanden begrüßen, der gerade den Raum betritt. &kde;-Benachrichtigungen sind ebenfalls Nachrichten. Lesen Sie dazu <xref linkend="knotify"/>.

source: The rest are ordinary Text Jobs. Any job you initiate from the <guilabel>Jobs</guilabel> tab is a Text Job. KSayit is an example of an application that uses Text Jobs. Text Jobs are intended for longer speech output that is not urgent.
de: Der Rest sind einfache Textaufträge. Jeder Auftrag, den Sie von der Karteikarte <guilabel>Aufträge</guilabel> anstoßen, ist ein Textauftrag. KSayit ist ein Beispiel für eine Anwendungen, die Textaufträge verwendet. Textaufträge sind für die Ausgabe längerer Texte gedacht, die keine besondere Dringlichkeit besitzen.

source: All four kinds of jobs are queues, except for Screen Reader Output. If a Screen Reader Output is sent from an application while &jovie; is speaking another Screen Reader Output, the speaking message is stopped and discarded.
de: Alle vier Auftragsarten werden in Warteschlangen abgearbeitet, mit Ausnahme der Ausgabe von Screen-Readern. Wenn eine Anwendung die Ausgabe eines Screen-Readers schickt, während &jovie; gerade eine solche vorliest, wird diese Ausgabe angehalten und beendet.

source: Types of Filters
de: Filterarten

source: The first thing you must know about filters is that they are never applied to Screen Reader Output. They are applied to Warnings, Messages, and Text jobs, and also &kde; notifications (KNotify).
de: Zuerst müssen Sie wissen, dass Filter nie auf die Ausgabe von Screen-Readern angewendet werden. Sie werden auf normale Warnungen, Nachrichten und Textaufträge sowie auf &kde;-Nachrichten angewendet.

source: Filters process the text and pass it on to the next filter. There are currently three kinds of filters.
de: Filter bearbeiten den Text und geben ihn an den nächsten Filter weiter. Zur Zeit gibt es drei Arten von Filtern.

source: String Replacers.
de: Zeichenkettenersetzer

source: &XML; Transformers
de: &XML;-Umformer

source: Talker Choosers.
de: Sprecherauswahl

source: Filters are implemented using a plugin architecture. In the future, there may be additional kinds of filters.
de: Filter sind als Module ausgeführt. In Zukunft kann es noch weiter Arten von Filtern geben.

source: String Replacer filters substitute pieces of text with other text. The replaced pieces are matched either as words or as regular expressions. &jovie; comes with pre-defined String Replacer filters for speaking abbreviations, speaking chat emoticons, such as ":-)", or reformatting notification messages from &konversation; or &kmail; into a more understandable form.
de: Zeichenkettenersetzer ersetzen Teile eines Textes durch anderen Text. Die zu ersetzenden Teile können Sie entweder als Worte oder als reguläre Ausdrücke angeben. &jovie; wird mit vordefinierten Zeichenkettenersetzerfiltern ausgeliefert, die das Ersetzen von Chat-Emoticons wie <quote>:-)</quote> durch Text oder für die Umformatierung von Nachrichten aus &konversation; oder &kmail; in eine besser verständliche Form ermöglichen.

source: &XML; Transformers use an &XML; Style Language - Transforms (XSLT) file to convert &XML; of one format to another format. &jovie; comes with a couple of XSLT files for converting &XHTML; into SSML.
de: &XML;-Umformer verwenden eine XSLT-Datei (&XML; Style Language - Transforms) um &XML; von einem Format in ein anderes Format umzuwandeln. Im Lieferumfang von &jovie; sind einige XSLT-Dateien zur Übersetzung von &XHTML; in SSML enthalten.

source: Talker Choosers permit you redirect jobs to a talker based on the contents of the text, or upon the application that sent it to &jovie;. For example, if you have configured a female talker in the <guilabel>Talkers</guilabel> tab, you can direct text coming from KSayIt to that talker. See <xref linkend="configure-talkers"/>.
de: Mit Sprecherauswahlfiltern können Sie Aufträge abhängig vom Inhalt des Textes oder abhängig von dem Programm, das den Text an &jovie; geschickt hat, an einen Sprecher schicken. Wenn Sie zum Beispiel auf der Karteikarte <guilabel>Sprecher</guilabel> eine weibliche Stimme eingestellt haben, können Sie Text von KDE-Nachrichten darüber vorlesen lassen. Siehe <xref linkend="configure-talkers"/>. darüber vorlesen lassen.

source: Each of these kinds of filters has configurable rules for when the filter should apply itself to the text to be spoken. If the filter determines that it should not apply itself, the text is passed on to the next filter unaltered.
de: Jeder dieser verschiedenen Filter hat einstellbare Regeln, nach denen er für eine Sprachausgabe angewendet wird. Wenn der Filter feststellt, dass seine Regeln nicht zutreffen, gibt er den Text unverändert an den nächsten Filter weiter.

source: When a Text Job, Message, Warning, or &kde; Notification message is sent to &jovie;, it passes through each of the enabled filters you have configured in the screen below. The order is from top to bottom.
de: Wenn ein Textauftrag, eine Meldung, Warnung oder eine &kde;-Benachrichtigung an &jovie; geschickt wird, wird sie durch alle aktivierten Filter bearbeitet, die auf der Seite unten eingerichtet wurden. Die Bearbeitung durch die Filter erfolgt in der Reihenfolge in der Liste von oben nach unten.

source: Configuring Filters
de: Einrichtung der Filter

source: To use filters, click the <guilabel>Filters</guilabel> tab in <command>jovie</command>.
de: Klicken Sie auf den Karteikartenreiter <guilabel>Filter</guilabel> in <command>jovie</command>, um Filter einzurichten.

source: The &kde; Text-to-Speech Manager (Filters tab).
de: Die Sprachausgabe-Verwaltung von &kde; (Karteikarte Filter)

source: The &kde; Text-to-Speech Manager (Filters tab)
de: Die Sprachausgabe-Verwaltung von &kde; (Karteikarte Filter)

source: This is the list of configured ordinary filters. If unchecked, the filter is inactive and will be bypassed. Filters are applied in the order specified here, top to bottom.
de: Dies zeigt die Liste der eingerichteten normalen Filter. Ist ein Filter nicht angekreuzt, ist er nicht aktiviert und wird nicht benutzt. Filter werden der Reihe nach von oben nach unten abgearbeitet.

source: Click here to add a new filter. You will be prompted for the kind of filter to add. After choosing the kind, see the configuration dialogs below.
de: Klicken Sie hier, um einen neuen Filter einzufügen. Wählen Sie die Art des Filters aus, und es werden die weiter unten folgenden Einrichtungsdialoge angezeigt.

source: Click here to remove a filter.
de: Klicken Sie hier, um einen Filter zu entfernen.

source: Click here to change the configuration of a filter. See the configuration dialogs below.
de: Um die Einstellungen für einen Filter zu ändern, klicken Sie hier. Es werden die weiter unten folgenden Einrichtungsdialoge angezeigt.

source: Click these buttons to move a filter up or down in the list.
de: Mit einem Klick auf diese Knöpfe können Sie einen Filter in der Liste nach oben oder unten verschieben.

source: Be sure to click here, otherwise your settings will not take effect.
de: Klicken Sie hier, sonst werden Ihre Einstellungen nicht übernommen.

source: Configuring String Replacer Filters
de: Einrichtung der Zeichenkettenersetzungsfilter

source: You configure String Replacer filters by supplying a list of words or regular expressions to be matched. When the matched words or regular expressions are found in the text, each is replaced by a substitute string you supply.
de: Für die Einrichtung von Zeichenkettenersetzungsfiltern müssen Sie eine Liste von Worten oder regulären Ausdrücken als Vergleichsmuster eingeben. Werden diese Muster im Text gefunden, dann wird der Text gegen den zugehörigen Ersatztext ausgetauscht. Groß- und Kleinschreibung wird beim Vergleich nicht beachtet.

source: <screeninfo>String Replacer</screeninfo>
de: <screeninfo>Zeichenkettenersetzer</screeninfo>

source: <phrase>String Replacer</phrase>
de: <phrase>Zeichenkettenersetzer</phrase>

source: Enter a name for your filter. Use any name you like that distinguishes it from all other filters.
de: Geben Sie für Ihren Filter einen Namen ein. Diesen Namen können Sie beliebig wählen, er muss sich nur von den Namen der anderen Filter unterscheiden.

source: This is the list of words and regular expressions. The filter searches for matches on each string in the <guilabel>Match</guilabel> column, replacing the matched string with the string in the <guilabel>Replace With</guilabel> column. The list is processed in the order displayed, top to bottom.
de: Dies ist die Liste der Worte und regulären Ausdrücke. Der Filter vergleicht den Text mit den Zeichenketten in der Spalte <guilabel>Übereinstimmung</guilabel> und ersetzt ihn bei Übereinstimmung mit der Zeichenkette aus der Spalte <guilabel>Ersetzen durch</guilabel>. Die Liste wird in der angezeigten Reihenfolge von oben nach unten abgearbeitet.

source: Click here to add another word or regular expression to the list.
de: Klicken Sie hier, um ein anderes Wort oder einen regulären Ausdruck in die Liste einzufügen.

source: Click here to move the currently highlighted word or regular expression up or down in the list.
de: Klicken Sie hier, um das markierte Wort oder den regulären Ausdruck in der Liste zu verschieben.

source: Click to change an existing word or regular expression in the list.
de: Klicken Sie hier, um ein vorhandenes Wort oder einen regulären Ausdruck in der Liste zu ändern.

source: Click to remove the currently highlighted word or regular expression from the list.
de: Klicken Sie hier, um das markierte Wort oder den regulären Ausdruck aus der Liste zu entfernen.

source: Use these buttons to load a list of words or regular expression from a file, save the current list to a file, or clear the entire list. When loading from a file, the items in the file are appended to the existing list.
de: Mit diesen Knöpfen können Sie eine Liste von Worten oder regulären Ausdrücken aus einer Datei laden, die aktuelle Liste speichern oder löschen. Laden Sie eine Liste aus einer Datei, werden die Einträge aus der Datei an die vorhandene Liste angehängt.

source: If not blank, the filter will apply itself only if the job's talker language matches the language you enter here. Click the button to display a list of languages. You may select more than one language by pressing &Ctrl; while clicking.
de: Ist hier eine Sprache eingetragen, wird der Filter nur angewendet, wenn der Sprecher für den Textauftrag eine der hier eingetragenen Sprachen spricht. Klicken Sie auf den Knopf, um eine Liste der Sprachen anzeigen zu lassen. Sie können auch mehrere Sprachen auswählen, wenn Sie beim Mausklick die &Ctrl;-Taste gedrückt halten.

source: If not blank, the filter will apply itself only if the text came from one of the applications listed. You may enter more than one application separated by commas. Example: <command><userinput>konversation,kmail</userinput></command>
de: Ist hier ein Wert eingetragen, wird der Filter nur angewendet, wenn der Text von einer der angegebenen Anwendungen kommt. Sie können mehrere Programme getrennt durch Kommata eingeben. Beispiel: <command><userinput>konversation,kmail</userinput></command>

source: You can discover the <guilabel>Application ID</guilabel> of running programs using the <command>&qdbus;</command> program. You should leave the &DBus; numbers out. For example, if &qdbus; shows an Application ID of <command>kopete-3432</command>, you would just enter <command><userinput>kopete</userinput></command>.
de: Die <guilabel>Anwendungs-ID</guilabel> laufender Programme erhalten Sie mit dem Programm <command>&qdbus;</command>. Die &DBus;-Nummern müssen Sie weglassen. Wenn zum Beispiel &qdbus; die Anwendungs-ID <command>kopete-3432</command> anzeigt, dürfen Sie nur <command><userinput>kopete</userinput></command> eingeben.

source: The String Replacer filter will only apply itself to the text if all non-blank conditions are met in the <guilabel>Apply This Filter When</guilabel> box. If all the boxes are blank, the filter will apply to all text.
de: Der Zeichenkettenersetzungsfilter wird nur dann auf den Text angewendet, wenn alle Bedingungen mit einem Eintrag im Kasten <guilabel>Diesen Filter anwenden wenn</guilabel> übereinstimmen. Sind alle Eingabefelder leer, wird der Filter auf alle Texte angewendet.

source: When matching words, the String Replacer filter internally uses a regular expression of the form <command>\s<userinput>word</userinput>\s</command>. In other words, the word must have word boundaries (spaces) on either side of it.
de: Beim Vergleich von Worten benutzt der Zeichenkettenersetzungsfilter reguläre Ausdrücke in der Form <command>\s<userinput>Wort</userinput>\s</command>. Die Worte müssen also durch Trennzeichen (Leerzeichen) beidseitig begrenzt sein.

source: A discussion on how to write regular expressions is outside the scope of this handbook. If you have the &kde; Regular Expression editor installed, there is a button available on the <guilabel>Add</guilabel> or <guilabel>Edit</guilabel> screens that will assist you at constructing regular expressions. The &kde; Regular Expression Editor is part of the Utils Git module in playground.
de: In diesem Handbuch finden Sie keine Anleitung zum Schreiben von regulären Ausdrücken. Wenn Sie aber den &kde;-Editor für reguläre Ausdrücke installiert haben, können Sie ihn in den Dialogen <guilabel>Hinzufügen</guilabel> oder <guilabel>Bearbeiten</guilabel> als Hilfe zum Zusammenstellen dieser Ausdrücke aufrufen. Den &kde;-Editor für reguläre Ausdrücke finden Sie im Git-Modul Utils in playground.

source: &jovie; comes with a few word list files, including a list of emoticons, such as ":-)", some abbreviations typically used in IRC or instant messaging applications, and a list of other abbreviations. There is also a list of special characters which the current version of the Polish Festival voice cannot handle. If you develop useful word lists of your own, use the <guibutton>Save</guibutton> button to save them to a file and send them to the &jovie; team for inclusion in the next version.
de: Im Lieferumfang von &jovie; sind einige Dateien mit Wortlisten enthalten; unter anderem eine Liste mit Emoticons wie <quote>:-)</quote>, einige Abkürzungen für IRC oder Messaging-Programme und eine Liste mit weiteren Abkürzungen. Es gibt auch eine Liste mit Sonderzeichen, mit der die aktuelle Version der polnischen Festival-Stimme Probleme hat. Wenn Sie eigene Wortlisten erstellen, können Sie diese mit <guilabel>Speichern</guilabel> in eine Datei schreiben und an das &jovie;-Team schicken, das die Listen dann in die nächste Version aufnimmt.

source: Configuring &XML; Transformer Filters
de: Einrichtung der &XML;-Umformer-Filter

source: The &XML; Transformer filter uses XSLT files to transform &XML; from one format to another. XSLT, the &XML; Style Language - Transforms, is a W3C standard language for performing such transformations. It can only be used on well-formed &XML;. You must have the <command>xsltproc</command> utility installed.
de: &XML;-Umformer übersetzen &XML; mit Hilfe von XSLT-Dateien aus einem Format in ein anderes Format. XSLT (&XML; Style Language - Transforms) ist ein W3C-Standard für solche Umformungen. Es kann aber nur auf wohlgeformtes XML angewendet werden. Das Hilfsprogramm <command>xsltproc</command> muss auf Ihrem System installiert sein.

source: <screeninfo>&XML; Transformer</screeninfo>
de: <screeninfo>&XML;-Umformer</screeninfo>

source: <phrase>&XML; Transformer</phrase>
de: <phrase>&XML;-Umformer</phrase>

source: Enter the full path to an existing XSLT file, which will perform the transformation.
de: Geben Sie den vollständigen Pfad zur XSLT-Datei für die Umwandlung ein.

source: Specify the path to the <command>xsltproc</command> utility. If xsltproc is in your environment PATH, simply enter <command><userinput>xsltproc</userinput></command>.
de: Geben Sie den Pfad für das Programm <command>xsltproc</command> ein. Wenn xsltproc über die Umgebungsvariable PATH erreichbar ist, reicht auch <command><userinput>xsltproc</userinput></command>.

source: If not blank, the filter will apply itself only if the &XML; has the specified root element or a <command><![CDATA[<!DOCTYPE]]></command> specification beginning with the entered string. This distinguishes one form of &XML; from another. For example, <command><userinput>html</userinput></command> in the <guilabel>DOCTYPE</guilabel> box will match <command><![CDATA[<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">]]></command>.
de: Wenn hier ein Wert angegeben ist, wird der Filter nur auf &XML;-Dateien mit einer <command><![CDATA[<!DOCTYPE]]></command> Spezifikation mit dem eingegebenen Text am Anfang angewendet. Zum Beispiel <command><userinput>html</userinput></command> im Eingabefeld <guilabel>DOCTYPE</guilabel> passt auf <command><![CDATA[<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">]]></command>..

source: The &XML; Transformer filter will only apply itself to the text if the specified root element or DOCTYPE are met and if the application ID is met in the <guilabel>Apply This Filter When</guilabel> box. If an item in this box is blank, the test is not performed, so if all the boxes are blank, the filter will apply itself to all text. However, you should fill in at least one box, since many text jobs will not be in &XML; format.
de: Der &XML;-Umformerfilter bearbeitet den Text nur dann, wenn das angegebene <quote>root</quote>-Element oder der DOCTYPE übereinstimmen und die Anwendungs-ID mit dem Eintrag in <guilabel>Diesen Filter anwenden, wenn</guilabel> übereinstimmt. Ist hier nichts eingetragen, wird die Prüfung nicht durchgeführt. Ist überhaupt kein Eintrag vorhanden, wird der Filter auf alle Texte angewendet. Sie sollten aber zumindest ein Eingabefeld ausfüllen, da die meisten Textaufträge nicht im &XML;-Format übermittelt werden.

source: Configuring Talker Chooser Filters
de: Einrichtung der Sprecherauswahlfilter

source: Talker Chooser filters are used to direct the text to a desired talker configured in the <guilabel>Talker</guilabel> tab, or to any talker having specified attributes. For example, you can specify that text coming from <command>kmail</command> should be spoken using a talker configured with a female voice. See <xref linkend="configure-talkers"/>.
de: Mit dem Sprecherauswahlfilter können Sie Texte an einen bestimmten Sprecher schicken, der auf der Karteikarte <guilabel>Sprecher</guilabel> eingerichtet ist, oder an einen Sprecher mit bestimmten Eigenschaften. Sie können zum Beispiel festlegen, dass Texte von <command>kmail</command> von einer weiblichen Stimme vorgelesen werden sollen. Siehe <xref linkend="configure-talkers"/>.

source: Just before &jovie; begins sending text to each of the filters, it picks a talker to speak the text. The talker chosen is based on the talker attributes specified by the application that sent the text to &jovie; and the attributes of the talkers that you have configured on the <guilabel>Talkers</guilabel> tab. The Talker Chooser filter permits you to override the chosen talker.
de: Bevor &jovie; einen Text an die Filter übergibt, sucht es einen Sprecher für den Text. Der Sprecher wird anhand der Sprecher-Eigenschaften, die das Programm vorgibt, das den Text an &jovie; schickt, und den Eigenschaften der auf der Karteikarte <guilabel>Sprecher </guilabel> eingerichteten Sprecher ausgewählt. Mit dem Sprecherauswahlfilter können Sie den gewählten Sprecher überschreiben.

source: <screeninfo>Talker Chooser</screeninfo>
de: <screeninfo>Sprecherauswahl</screeninfo>

source: <phrase>Talker Chooser</phrase>
de: <phrase>Sprecherauswahl</phrase>

source: If not blank, the filter will apply itself only if the text contains the entered regular expression. If it is installed, click the browse button to launch the &kde; Regular Expression Editor to assist you at entering the regular expression.
de: Ist hier ein Wert eingetragen, wird der Filter angewendet, falls der Text den eingegebenen regulären Ausdruck enthält. Ist auf Ihrem System der &kde;-Editor für reguläre Ausdrücke installiert, können Sie diesen mit einem Klick auf den Knopf aufrufen, um Hilfe bei der Eingabe zu erhalten.

source: For better performance, try to "anchor" the regular expression to the start of the string. In other words, start your regular expression with <command><userinput><![CDATA[^]]></userinput></command>.
de: Um eine schnellere Verarbeitung zu erzielen, sollten Sie versuchen, den regulären Ausdruck am Anfang der Zeichenkette zu <quote>verankern</quote>, d. h., beginnen Sie den regulären Ausdruck mit <command><userinput><![CDATA[^]]></userinput></command>.
