Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdeaccessibility/jovie.po
Languages: de

source: Specify the attributes of the talker you prefer to speak the text here. If the text meets the filter conditions above, a talker will be chosen that most closely matches the attributes you specify here. Click the button at the right to display the <guilabel>Select Talker</guilabel> screen.
de: Legen Sie hier die Eigenschaften des von Ihnen gewünschten Sprechers fest. Wenn der Text die oben gezeigten Filterbedingungen erfüllt, wird der Sprecher ausgewählt, der den gewünschten Anforderungen am ehesten entspricht. Klicken Sie auf den Knopf rechts, um den Dialog <guilabel>Sprecherauswahl</guilabel> anzuzeigen.

source: Use these buttons to save your Talker Chooser settings, load settings from a saved file, or clear all the settings.
de: Verwenden Sie diese Knöpfe, um Ihre Sprechereinstellungen zu speichern oder zu laden oder alle Einstellungen zu löschen.

source: The Talker Chooser filter will only apply itself to the text if all non-blank conditions are met in the <guilabel>Apply This Filter When</guilabel> box. You must fill in at least one of the boxes.
de: Der Sprecherauswahlfilter wird nur dann auf den Text angewendet, wenn alle Bedingungen mit einem Eintrag im Kasten <guilabel>Diesen Filter anwenden wenn</guilabel> zutreffen. Sie müssen mindestens eine Bedingung eintragen.

source: Developer's Guide to &jovie;
de: Entwicklerhandbuch für &jovie;

source: &jovie; has two Application Programmer Interfaces (APIs):
de: &jovie; bietet zwei Schnittstellen für Anwendungsprogrammierer (APIs):

source: The &kde; Text-to-Speech API, which is used by application programmers to give their applications TTS capabilities. Applications communicate with &jovie; via &DBus;.
de: Die Sprachausgabe-API, von &kde;, mit der Programmierer ihren Anwendungen TTS-Fähigkeiten verleihen können. Anwendungen kommunizieren mit &jovie; über &DBus;.

source: The &jovie; Text-to-Speech Plugin API, which is used to add speech synthesis plugins to &jovie; so that &jovie; will work with a new speech synthesis engine.
de: Die &jovie;-Modul-API, mit der Sprachsynthesizer zu &jovie; hinzugefügt werden, sodass &jovie; diese Synthesizer benutzen kann.

source: The following section gives a short description of the &kde; Text-to-Speech API &DBus; Interface. Full documentation for both APIs is available online at the <ulink url="http://accessibility.kde.org/developer/kttsd/"> &kde; Accessibility</ulink> web site (http://accessibility.kde.org).
de: Der folgende Abschnitt enthält eine kurze Beschreibung der &kde;-&DBus;-Schnittstelle der Sprachausgabe-API von &kde;. Die vollständige Dokumentation für beide APIs finden Sie auf der <ulink url="http://accessibility.kde.org/developer/kttsd/">&kde; Accessibility</ulink> Webseite (http://accessibility.kde.org).

source: The &jovie; &DBus; Interface
de: Die &DBus;-Schnittstelle von &jovie;

source: Applications communicate requests for Text-to-Speech services via the &kde; &DBus; interface to program <command>jovie</command> object <command>KSpeech</command>.
de: Anwendungen fordern Sprachausgabedienste über die &DBus;-Schnittstelle von &kde; vom Programm <command>jovie</command> über das Objekt <command>KSpeech</command> an.

source: Enter the following commands in a &konsole;.
de: Geben Sie die folgenden Befehle in einer &konsole; ein:

source: If &jovie; is not already running
de: Wenn &jovie; noch nicht gestartet wurde

source: To queue a text job to be spoken
de: Um einen Textauftrag in die Warteschlange zu stellen

source: where <userinput><replaceable>text</replaceable></userinput> is the text to be spoken, and <userinput><replaceable>options</replaceable></userinput> is a language code such as <userinput><replaceable>en</replaceable></userinput>, <userinput><replaceable>cy</replaceable></userinput>, &etc;
de: dabei ist <userinput><replaceable>Text</replaceable></userinput> der Text zum Vorlesen und <userinput><replaceable>Option</replaceable></userinput> ein Sprachcode wie &eg; <userinput><replaceable>en</replaceable></userinput>, <userinput><replaceable>de</replaceable></userinput> &etc;

source: Example.
de: Beispiel:

source: qdbus org.kde.jovie /KSpeech say "This is a test." "en"
de: qdbus org.kde.jovie /KSpeech say "Dies ist ein Test." "de"

source: There are many more commands that can be sent. To see a list of possible commands,
de: Es gibt noch mehr Befehle, die Sie einsetzen können. Für eine Liste aller Befehle geben Sie

source: or read the <ulink url="http://accessibility.kde.org/developer/kttsd/"> &kde; Text-to-Speech API</ulink> online.
de: ein oder lesen Sie die <ulink url="http://accessibility.kde.org/developer/kttsd/"> &kde; Sprachausgabe-API</ulink>.

source: Questions and Answers
de: Fragen und Antworten

source: I need to start over. How do I get &jovie; completely terminated?
de: Ich muss noch einmal von vorne anfangen. Wie kann ich &jovie; vollständig beenden?

source: Enter the following commands in a &konsole;:
de: Geben Sie die folgenden Befehle in einer &konsole; ein:

source: How can I see debugging output from <command>jovie</command>?
de: Wie kann ich die Fehlerausgabe von <command>jovie</command> sehen?

source: Open a &konsole; window. Then start <command>jovie</command>.
de: Öffnen Sie ein &konsole;-Terminalfenster und starten darin <command>jovie</command>.

source: None of the supported speech synthesizers support the language I need. Where can I get a synth for my language?
de: Keiner der genannten Sprachsynthesizer unterstützt meine Sprache. Wo kann ich einen Synthesizer für meine Sprache bekommen?

source: Google(tm) is your friend. This <ulink url="http://tcts.fpms.ac.be/synthesis/mbrola/mbrtts.html">link</ulink> might also help. If you find a free synthesis engine that supports your desired language, and want to add support for it to &jovie;, please contact the development team. Open source engines are especially welcome. If you know of a commercial synth, perhaps you can persuade the vendor to donate a free copy to the &jovie; development team. In the meantime, you may be able to get the synth working using speech-dispatchers command backend.
de: Suchen Sie bei Google(tm). Diese <ulink url="http://tcts.fpms.ac.be/synthesis/mbrola/mbrtts.html">Verknüpfung</ulink> könnte auch hilfreich sein. Wenn Sie einen freien Synthesizer für Ihre Wunschsprache finden und dafür Unterstützung zu &jovie; hinzufügen wollen, setzen Sie sich mit den Entwicklern in Verbindung. Quelloffene Synthesizer werden besonders gesucht. Wenn Sie einen kommerziellen Synthesizer kennen, können Sie versuchen, den Hersteller dazu zu überreden, den Entwicklern eine freie Kopie zu überlassen. Bis dahin können Sie versuchen, den Synthesizer mit den Befehlen des Hintergrundprogramms für „speed-dispatcher“ zu benutzen.

source: I have the &HTML; &XML; Transformer filter configured, but web pages are not spoken at all using the Festival plugin.
de: Ich habe den &HTML;-&XML;-Umformerfilter eingerichtet, aber bei Verwendung des Moduls für Festival werden Webseiten nicht vorgelesen.

source: Due to a bug in Festival 1.95 beta, you must install the <command>rab_diphone</command> (British male) voice for SABLE to work at all, even if you are not using that voice to speak the web pages. Also, make sure the <command>xsltproc</command> utility is installed and in the PATH.
de: Bedingt durch einen Fehler in Festival 1.95 beta müssen Sie die (männliche britische) Stimme <command>rab_diphone</command> installieren, damit SABLE überhaupt funktioniert. Das müssen Sie selbst dann tun, wenn Sie diese Stimme nicht zum Vorlesen von Webseiten benutzen. Stellen Sie außerdem sicher, dass das Programm <command>xsltproc</command> installiert und über die Umgebungsvariable PATH zu finden ist.

source: Certain characters or punctuation seem to be producing errors in the synthesizer, making it skip entire sentences, or pronounce gibberish. What can I do?
de: Bestimmte Zeichen oder Interpunktionszeichen scheinen Fehler beim Synthesizer zu verursachen, sodass ganze Sätze übersprungen oder nur Kauderwelsch ausgegeben wird. Was kann ich dagegen tun?

source: First, make sure the <guilabel>Character encoding</guilabel> option in the talker's configuration dialog is properly set for the language. If certain words or characters are causing problems, a String Replacer filter might help. See <xref linkend="filters"/>.
de: Stellen Sie zunächst sicher, dass die Option <guilabel>Zeichenkodierung</guilabel> auf den richtigen Wert für die entsprechende Sprache eingestellt ist. Gibt es Probleme mit bestimmten Zeichen oder Wörtern, können diese möglicherweise durch einen Zeichenkettenersetzungsfilter behoben werden. Siehe <xref linkend="filters"/>.

source: Credits and License
de: Danksagungen und Lizenz

source: Program Copyright &copy; 2002 Jos&#233; Pablo Ezequiel "Pupeno" Fern&#225;ndez <email>pupeno@kde.org</email>
de: Programm Copyright &copy; 2002 Jos&#233; Pablo Ezequiel <quote>Pupeno</quote> Fern&#225;ndez <email>pupeno@kde.org</email>

source: Current Maintainer: Jeremy Whiting <email>jpwhiting@kde.org</email>
de: Aktueller Betreuer: Jeremy Whiting <email>jpwhiting@kde.org</email>

source: Contributors:
de: Mitwirkende:

source: Documentation Copyright &copy; 2009 Jeremy Whiting <email>jpwhiting@kde.org</email> &copy; 2004 Gary R. Cramblitt <email>garycramblitt@comcast.net</email>
de: Copyright der Dokumentation &copy; 2009 Jeremy Whiting <email>jpwhiting@kde.org</email> &copy; 2004 Gary R. Cramblitt <email>garycramblitt@comcast.net</email>

source: CREDIT_FOR_TRANSLATORS
de: <para>Übersetzung Burkhard Lück<email>lueck@hube-lueck.de</email></para>

source: Speech synthesis engines used by &jovie; have their own licenses. See each engine's documentation or website for details. Some voices also have their own licensing.
de: Die Sprachsynthesizer, die von &jovie; genutzt werden, haben ihre eigene Lizenz, die Sie in der zugehörigen Dokumentation oder auf den betreffenden Webseiten finden. Es gibt auch Stimmen, die eine eigene Lizenz besitzen.

source: How to obtain &jovie;
de: Woher Sie &jovie; bekommen

source: Debian Install Command: <command>apt-get install jovie</command>
de: Debian Installationsbefehl: <command>apt-get install jovie</command>

source: You will find links to source and binary packages on the <ulink url="http://accessibility.kde.org/developer/kttsd/"> &kde; Accessibility</ulink> web site (http://accessibility.kde.org).
de: Sie finden Quelltexte und übersetzte Pakete auf der <ulink url="http://accessibility.kde.org/developer/kttsd/">&kde; Accessibility</ulink> Webseite (http://accessibility.kde.org).

source: If you have access to the &kde; code repository, you can download &jovie; by checking out the <command>jovie</command> archive. &jovie; will be found in the <filename class="directory">jovie</filename> folder. You can also download tarballs of the &jovie; source code from <ulink url="http://download.kde.org/stable/">http://download.kde.org/stable/</ulink>
de: Wenn Sie Zugriff auf das KDE-Quellcodearchiv haben, können Sie das Programm &jovie; daraus herunterladen. &jovie; finden Sie im Ordner <filename class="directory">jovie</filename>. Außerdem finden Sie den Quellcode von &jovie; unter <ulink url="http://download.kde.org/stable/">http://download.kde.org/stable/</ulink>.

source: Requirements
de: Voraussetzungen

source: Mandatory requirements:
de: Unbedingt erforderlich:

source: &kde; version 4.8 or later.
de: &kde; Version 4.8 oder neuer.

source: speech-dispatcher version 0.67 or later.
de: speech-dispatcher version 0.67 oder neuer.

source: A speech synthesizer. The following synthesizers and spoken languages are currently supported.
de: Ein Sprachsynthesizer. Die folgenden Synthesizer und Sprachen werden zur Zeit unterstützt.

source: Most languages, check <ulink url="http://espeak.sourceforge.net/languages.html">http://espeak.sourceforge.net/languages.html</ulink> for the current list of supported languages
de: Enthält viele Sprachen, eine Liste aller aktuell unterstützten Sprachen finden Sie auf der Projektseite <ulink url="http://espeak.sourceforge.net/languages.html">http://espeak.sourceforge.net/languages.html</ulink>.

source: American English, British, Spanish, German, Finnish, Czech, Polish, Russian, Italian, French Canadian, Kiswahili, Zulu, and Ibibio
de: Amerikanisches Englisch, Britisch, Spanisch, Deutsch, Finnisch, Tschechisch, Polnisch, Russisch, Italienisch, Französisch, Kanadisches Französisch, Kiswahili, Zulu und Ibibio.

source: It also works with any synthesis engine that can be run from a command in a &konsole;.
de: &jovie; arbeitet mit auch mit jedem Sprachsynthesizer, der auf der Befehlszeile in einer &konsole; gestartet werden kann.

source: The languages listed above may not be comprehensive or up-to-date. Check the specifications for each engine for a complete list of supported languages. Also check the <ulink url="http://accessibility.kde.org/developer/kttsd/index.php"> &jovie;</ulink> website for additional information that might not have made it into this handbook.
de: Die Liste der oben genannten Sprachen kann unvollständig oder veraltet sein. Ziehen Sie daher die Beschreibung der Synthesizer zu den unterstützten Sprachen zu Rate. Schauen Sie auch auf der Webseite von <ulink url="http://accessibility.kde.org/developer/kttsd/index.php">&jovie;</ulink>, nach Informationen, die noch nicht in diesem Handbuch enthalten sind.

source: speech-dispatcher uses a flexible plugin architecture for speech synthesis engines. If you want to enhance &jovie; to support another engine, contact the development team.
de: Das Programm "speech-dispatcher" benutzt eine anpassungsfähige Modul-Architektur für Sprachsynthesizer. Wenn Sie &jovie; für die Nutzung eines anderen Synthesizers erweitern möchten, setzen Sie sich mit dem Entwicklerteam in Verbindung.

source: See <xref linkend="configuration"/> for specific instructions for each of these engines.
de: Spezielle Anleitungen zu den verschiedenen Sprachsynthesizern finden Sie in <xref linkend="configuration"/>.

source: Optional components:
de: Zusätzliche Komponenten:

source: The <command>xsltproc</command> utility is needed for SSML support and for the &XML; Transformer filter, but not required. Debian users can install xsltproc with the command <command>apt-get install xsltproc</command>.
de: Das Programm <command>xsltproc</command> wird für die Unterstützung von SSML und für den &XML;-Umwandlungsfilter benutzt, ist aber nicht zwingend notwendig. Debian-Benutzer können xsltproc mit dem Befehl <command>apt-get install xsltproc</command> installieren.

source: Compilation and Installation
de: Kompilierung und Installation

source: In order to compile &jovie;, you must have a recent (&kde; 4.8 or greater) copy of the &kde; development files, including kdelibs and the development files for speech-dispatcher.
de: Um &jovie; zu kompilieren, brauchen Sie eine aktuelle Entwicklungsumgebung von KDE (Version 4.8 oder neuer) einschließlich der Pakete kdelibs und der Entwickungsdateien für das Programm "speech-dispatcher".

source: If you downloaded the &jovie; source from the <filename>kdeaccessibility</filename> code repository module, or downloaded the nightly tarball, use the following commands to compile and install.
de: Wenn Sie die Quelltexte von &jovie; aus dem Quelltextarchiv für <filename>kdeaccessibility</filename> beziehen oder den jede Nacht aktuell erstellten Tarball heruntergeladen haben, übersetzen und installieren Sie das Programm mit folgenden Befehlen:

source: Configuration
de: Einrichtung

source: Make sure speech-dispatcher is working with your speech synthesis engine before using &jovie;. The shell script spd-conf can be used for that.
de: Bevor Sie &jovie; benutzen, überprüfen Sie zuerst, ob speech-dispatcher mit Ihrem Sprachsynthesizer richtig arbeitet. Dazu können Sie das Shellskript spd-conf verwenden.

source: &jovie; in &kde; 4.5 is a rename of KTTSD and kttsmgr. In the future &jovie; will be able to configure speech-dispatcher directly without spd-conf.
de: KTTSD und kttsmgr wurden in &kde; 4.5 in &jovie; umbenannt. Das Programm &jovie; soll so weiterentwickelt werden, dass die Einrichtung von speech-dispatcher direkt möglich ist und das Skript spd-conf nicht mehr benötigt wird.
