Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdeaccessibility/jovie.po
Languages: de

source: The &jovie; Handbook
de: Das Handbuch zu &jovie;

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Burkhard</firstname><surname>Lück</surname><affiliation><address><email>lueck@hube-lueck.de</email></address></affiliation><contrib>Übersetzung</contrib></othercredit>

source: &jovie; - the &kde; Text-to-Speech system - is a plugin based service that allows any &kde; (or non-&kde;) application to speak using the &DBus; interface.
de: &jovie; - das Sprachausgabe-System von &kde; - ist ein aus Modulen bestehender Dienst, der es jeder Anwendung ermöglicht, Text über die &DBus;-Schnittstelle vorzulesen.

source: &jovie; intends to be the implementation for the &kde; Text-to-Speech API.
de: &jovie; ist die praktische &kde;-Anwendung der KDE-Sprachausgabe API.

source: accessibility
de: Zugänglichkeit

source: Text-to-Speech
de: Sprachausgabe

source: Introduction
de: Einleitung

source: &jovie; is a subsystem within &kde; for producing Text-to-Speech (TTS). It provides a common API for &kde; programmers to give TTS capabilities to their applications. It provides some nice capabilities for end users as well.
de: &jovie; ist ein Teilsystem in &kde; zur Sprachausgabe (TTS). Es stellt eine gemeinsame Anwendungsschnittstelle für &kde;-Programmierer bereit, mit der deren Anwendungen mit TTS-Fähigkeiten ausgestattet werden können. Auch den Benutzern bietet es interessante Möglichkeiten.

source: User features:
de: Eigenschaften für Benutzer:

source: Speak contents of a text file.
de: Vorlesen des Inhalts einer Textdatei.

source: Speak &kde; notification events (KNotify).
de: Vorlesen von &kde;-Nachrichten (KNotify).

source: Speak all or part of the text of a web page in &konqueror;.
de: Vorlesen der Texte (oder Teilen davon) einer Webseite in &konqueror;.

source: Speak all or part of the text in &kate; text editor, including instances where &kate; is embedded in another &kde; application.
de: Vorlesen von Texten (oder Teilen davon) im Texteditor &kate;, auch wenn &kate; in andere &kde;-Anwendungen eingebettet ist.

source: Speech is spoken via speech-dispatcher, so any speech-dispatcher backend can be used (espeak, festival, &etc;)
de: Die Sprachausgabe erfolgt über das Programm speech-dispatcher, das verschiedene Hintergrundprogramm wie espeak, festival, &etc; verwendet.

source: User-configurable filters for substituting misspoken words, choosing speech synthesizers, and transforming XHMTL/&XML; documents.
de: Einstellbare Filter, um falsch ausgesprochene Worte zu ersetzen, Sprachsynthesizer auszuwählen und &XML;-Dokumente umzuwandeln.

source: Programmer features:
de: Eigenschaften für Programmierer:

source: Priority system for screen reader outputs, warnings and messages, while still playing regular texts.
de: Prioritätssystem für die Ausgabe von Screen-Readern, Warnungen und Nachrichten, während andere Texte vorgelesen werden.

source: Permit generation of speech from the command line (or via shell scripts) using the &qdbus; utility.
de: Ermöglicht die Erzeugung von Sprachausgaben auf der Befehlszeile (oder mit Shell-Skripten) über das &qdbus;-Hilfsprogramm.

source: Provide a lightweight and easily usable interface for applications to generate speech output.
de: Stellt für Anwendungen eine einfach zu benutzende Schnittstelle für die Sprachausgabe bereit.

source: Applications need not be concerned about contention over the speech device.
de: Anwendungen müssen keine Einzelheiten über das Sprachausgabegerät wissen.

source: FUTURE: Provide support for speech markup languages, such as VoiceXML, Sable, &Java; Speech Markup Language (JSML), and Speech Markup Meta-language (SMML).
de: IN ZUKUNFT: Unterstützung für Speech-Markup-Sprachen wie VoiceXML, Sable, &Java; Speech-Markup-Language (JSML), und Speech-Markup-Meta-Sprache (SMML).

source: FUTURE: Provide limited support for embedded speech markers.
de: IN ZUKUNFT: Eingeschränkte Unterstützung für eingebettete Sprachlesezeichen.

source: Asynchronous to prevent system blocking.
de: Asynchron zur Vermeidung von Systemblockaden.

source: &jovie; actually consists of several programs:
de: &jovie; besteht zurzeit aus mehreren Programmen:

source: the &kde; Text-to-Speech Daemon, which is an application that provides TTS services to applications via &DBus;. It also sits in the system tray.
de: Der Sprachausgabe-Dienst von &kde;, ein Programm, das TTS-Dienste über &DBus; anbietet und das als Symbol im Systemabschnitt der Kontrollleiste angezeigt wird.

source: A plugin for the &konqueror; web browser that permits you to speak all or a portion of the text on a web page.
de: Ein Modul für den Webbrowser &konqueror; für das Vorlesen der Texte einer Webseite oder Teilen davon.

source: A plugin for the &kate; text editor that permits you to speak all or a portion of a text file.
de: Ein Modul für den Texteditor &kate;, mit dem eine Textdatei ganz oder teilweise vorgelesen werden kann.

source: Support
de: Unterstützung

source: In addition to the &kde; Bugzilla database ( <ulink url="http://bugs.kde.org/">http://bugs.kde.org/</ulink> ), discussions for &jovie; currently take place in the kde-accessibility mailing list. Subscribe at <ulink url="https://mail.kde.org/mailman/listinfo/kde-accessibility"> https://mail.kde.org/mailman/listinfo/kde-accessibility</ulink>. Developers also hang out in IRC (irc.kde.org, channel #kde-accessibility).
de: Zusätzlich zur Bugzilla-Datenbank von &kde; (<ulink url="http://bugs.kde.org/">http://bugs.kde.org/</ulink>) finden Diskussionen über &jovie; in der kde-accessibility Mailingliste statt. Abonnieren können Sie die Liste über <ulink url="https://mail.kde.org/mailman/listinfo/kde-accessibility"> https://mail.kde.org/mailman/listinfo/kde-accessibility</ulink>. Die Entwickler finden Sie auch im IRC (irc.kde.org, Kanal #kde-accessibility).

source: Using &jovie;
de: Arbeiten mit &jovie;

source: Before you can use &jovie;, you must install speech-dispatcher and make sure it is working. See <xref linkend="installation"/>.
de: Ehe Sie &jovie; benutzen können, müssen Sie das Programm speech-dispatcher installieren und richtig einstellen. Siehe auch <xref linkend="installation"/>

source: Starting <command>jovie</command>
de: Starten von <command>jovie</command>

source: To start the &jovie; system, type the following command in a &konsole;
de: Zum Start des &jovie;-Systems geben Sie folgenden Befehl in einer &konsole; ein:

source: or click on &jovie; in the &kde; Menu.
de: oder klicken Sie im &kde;-Menü auf &jovie;.

source: If this is the first time running <command>jovie</command>, or if you have not yet configured any talkers, the <guilabel>Talkers</guilabel> screen appears. See <xref linkend="configure-talkers"/>. If you have already configured at least one talker, the <guilabel>General</guilabel> screen appears. See <xref linkend="general"/>.
de: Beim ersten Start von <command>jovie</command> oder solange noch keine Sprecher eingerichtet sind, wird die Karteikarte <guilabel>Sprecher</guilabel> angezeigt. Siehe auch <xref linkend="configure-talkers"/>. Wenn Sie mindestens einen Sprecher eingerichtet haben, wird die Karteikarte <guilabel>Allgemein</guilabel> angezeigt. Siehe <xref linkend="general"/>.

source: Configuring Talkers
de: Einrichtung der Sprecher

source: Most text-to-speech (TTS) synthesizers offer multiple languages and voices and may offer multiple speaking genders, volumes, and rates. You may configure more than one instance of a synthesizer. Each combination of language, synthesizer, voice, gender, volume, and rate is called a talker. You should configure at least one talker before you use &jovie; otherwise speech-dispatcher will use a default voice.
de: Die meisten TTS-Synthesizer bieten verschiedene Sprachen und Stimmen an, so auch verschiedene männlich oder weibliche, oder solche, die sich in Lautstärke oder Geschwindigkeit unterscheiden. Sie können auch mehrere Varianten für einen Synthesizer einrichten. Eine so eingerichtete Kombination aus Sprache, Synthesizer, Stimme, Geschlecht, Lautstärke und Geschwindigkeit wird als Sprecher bezeichnet. Sie sollten zumindest einen Sprecher einrichten, bevor Sie &jovie; benutzen, da das Programm speed-dispatcher ansonsten den Standardsprecher verwendet.

source: Multiple talkers for the same synthesizer is similar to multiple print queues for a single physical printer.
de: Verschiedene Sprecher für denselben Synthesizer sind vergleichbar mit mehreren Druckerwarteschlangen für denselben Drucker.

source: When you click the <guilabel>Talkers</guilabel> tab in <command>jovie</command>, the <guilabel>Talkers</guilabel> screen appears. This screen also automatically appears if you start <command>jovie</command> and you have not yet configured any talkers.
de: Wenn Sie auf den Karteikartenreiter <guilabel>Sprecher</guilabel> in <command>jovie</command> klicken, wird die Karteikarte <guilabel>Sprecher</guilabel> angezeigt. Diese erscheint auch dann automatisch, wenn Sie <command>jovie</command> starten und noch kein Sprecher eingerichtet ist.

source: The &kde; Text-to-Speech Manager (Talkers tab).
de: Die Sprachausgabeverwaltung von &kde; (Karteikarte Sprecher)

source: The &kde; Text-to-Speech Manager (Talkers tab)
de: Die Sprachausgabeverwaltung von &kde; (Karteikarte Sprecher)

source: Click to add a new talker.
de: Klicken Sie, um einen neuen Sprecher hinzuzufügen.

source: All the configured <guilabel>Talkers</guilabel> are listed here. Highest priority <guilabel>Talkers</guilabel> are listed at the top. The top-most talker will be used to do the speaking when an application does not specify a talker.
de: Alle bereits eingerichteten <guilabel>Sprecher</guilabel> erscheinen in dieser Liste. Die bevorzugten <guilabel>Sprecher</guilabel> erscheinen oben in der Liste. Der oberste Sprecher wird für die Sprachausgabe benutzt, wenn eine Anwendung keinen Sprecher vorgibt.

source: Click on a talker in the list to highlight it and click this button to remove it.
de: Wählen Sie mit einem Mausklick einen Sprecher aus der Liste, und klicken Sie auf diesen Knopf, um den Sprecher aus der Liste zu entfernen.

source: Click on a talker in the list to highlight it and click this button to change its configuration. See below.
de: Wählen Sie mit einem Mausklick einen Sprecher aus der Liste, und klicken Sie auf diesen Knopf, um den Einstellungen zu ändern. Siehe unten.

source: Click on a talker in the list to highlight it and click this button to move it down one row in the list. The lower a talker appears in the list, the lower its priority.
de: Wählen Sie mit einem Mausklick einen Sprecher aus der Liste, und klicken Sie auf diesen Knopf, um den Sprecher in der Liste eine Zeile weiter nach unten schieben. Die Reihenfolge der Sprecher in der Liste bestimmt auch ihre Priorität.

source: Click one of these buttons to apply the changes you have made to the running &jovie; system.
de: Klicken Sie auf einen dieser Knöpfe, um Ihre Änderungen auf das laufende &jovie;-System anzuwenden.

source: When you click the <guibutton>Add</guibutton> button, the <guilabel>Add Talker</guilabel> screen appears.
de: Wenn Sie auf <guibutton>Hinzufügen</guibutton> klicken, wird die Karteikarte <guilabel>Sprecher hinzufügen</guilabel> angezeigt.

source: Add Talker screen.
de: Karteikarte Sprecher hinzufügen.

source: Add Talker screen
de: Karteikarte Sprecher hinzufügen

source: You should give your new talker a name, this can be anything.
de: Sie sollten Ihrem neuen Sprecher einen beliebigen Namen geben.

source: Choose the language and synthesizer here.
de: Wählen Sie hier die Sprache und den Synthesizer.

source: Choose the voice type here, there are three Male, three Female, one Male Child and one Female Child voices to choose from.
de: Wählen Sie hier einen Stimmtyp aus, es stehen drei männliche und drei weibliche Stimmen sowie eine Jungen- und Mädchenstimme zur Auswahl.

source: Set any custom voice parameters here.
de: Stellen Sie hier benutzerdefinierte Parameter für die Stimme ein.

source: When you click here your new talker will appear in the list in the <guilabel>Talkers</guilabel> screen. Click the <guibutton>Edit</guibutton> button to edit the talker's configuration.
de: Wenn Sie hier klicken, erscheint der neue Sprecher auf der Karteikarte <guilabel>Sprecher</guilabel>. Um die Einstellungen dieses Sprechers zu ändern, klicken Sie auf <guibutton>Bearbeiten</guibutton>.

source: You are almost ready to begin using &jovie;. Now go back to the <guilabel>General</guilabel> tab and check the <guilabel>Enable Text-to-Speech System (Jovie)</guilabel> box. This will start the &kde; TTS Daemon. See <xref linkend="general"/>. You may now begin using &jovie; to speak text. Click the <guilabel>Jobs</guilabel> tab to create and manage text jobs. See <xref linkend="jobmgr"/>.
de: Nun können Sie &jovie; schon fast benutzen. Gehen Sie zurück zur Karteikarte <guilabel>Allgemein</guilabel> und überprüfen Sie, ob <guilabel>Sprachausgabe aktivieren (Jovie)</guilabel> angekreuzt ist, damit der TTS-Dienst von &kde; startet. Siehe <xref linkend="general"/>. Jetzt können Sie &jovie; benutzen, um Text vorlesen zu lassen. Klicken Sie auf die Karteikarte <guilabel>Aufträge</guilabel>, um Textaufträge zu erstellen und zu verwalten. Siehe <xref linkend="jobmgr"/>.

source: Starting &jovie; and Setting General Options
de: Starten von &jovie; und allgemeine Einrichtung

source: Once you have configured at least one talker, you can start the &kde; Text-to-Speech System. Click on the <guilabel>General</guilabel> tab. The <guilabel>General</guilabel> screen appears. You can also set some general options on this screen.
de: Wenn Sie mindestens einen Sprecher eingerichtet haben, können Sie das Sprachausgabesystem von &kde; starten. Klicken Sie auf den Karteikartenreiter <guilabel>Allgemein</guilabel>, um diese Karteikarte zu öffnen. Hier können Sie einige allgemeine Optionen einstellen.

source: The &kde; Text-to-Speech Manager (General tab).
de: Die Sprachausgabeverwaltung von &kde; (Karteikarte Allgemein).

source: The &kde; Text-to-Speech Manager (General tab)
de: Die Sprachausgabeverwaltung von &kde; (Karteikarte Allgemein)

source: Check this box to activate the &jovie; system. This starts the &kde; TTS Daemon (&jovie;). If Jovie starts successfully, the <guilabel>Jobs</guilabel> tab will appear. Once &jovie; has been started, you can begin creating and speaking text jobs. See <xref linkend="jobmgr"/>. Unchecking will stop Jovie and deactivate the &kde; TTS system.
de: Markieren Sie dieses Ankreuzfeld, um das &jovie;;-System zu aktivieren. Dies startet den KDE-TTS-Dienst (&jovie;). Ist dieser Start erfolgreich, wird die Karteikarte <guilabel>Aufträge</guilabel> angezeigt, und Sie können Textaufträge erstellen und vorlesen lassen. Siehe <xref linkend="jobmgr"/>. Entfernen Sie die Markierung, wird &jovie; angehalten und das TTS-System von &kde; deaktiviert.

source: Be sure to click here to save your settings.
de: Klicken Sie hier, um Ihre Einstellungen zu speichern.

source: Managing Text Jobs
de: Textaufträge verwalten

source: When you click the <guilabel>Jobs</guilabel> tab in <command>jovie</command>, the <guilabel>Jobs</guilabel> screen appears.
de: Wenn Sie auf den Karteikartenreiter <guilabel>Aufträge</guilabel> im <command>jovie</command> klicken, wird die Karteikarte <guilabel>Aufträge</guilabel> angezeigt.

source: The &kde; Text-to-Speech Manager (Jobs tab).
de: Die Sprachausgabeverwaltung von &kde; (Karteikarte Aufträge).

source: The &kde; Text-to-Speech Manager (Jobs tab)
de: Die Sprachausgabeverwaltung von &kde; (Karteikarte Aufträge)

source: The controls here allow you to change attributes of the currently speaking voice. Note this only works if you have no voices configured in the Talkers tab.
de: Mit diesen Einstellungen kann die aktuelle Sprecherstimme verändert werden. Dies funktioniert nur dann, wenn noch keine Stimmen auf der Karteikarte <guilabel>Sprecher</guilabel> eingerichtet sind.

source: The buttons in this row permit you to stop, cancel, pause and resume the current text job.
de: Mit den Knöpfen in dieser Reihe können Sie Textaufträge starten, abbrechen, anhalten und wieder aufnehmen.

source: The buttons in this row permit you to speak the text currently in the &kde; clipboard, or open a text file for speaking. You can also change the talker for a job.
de: Mit den Knöpfen in dieser Reihe können Sie den aktuellen Text in der &kde;-Zwischenablage vorlesen lassen oder eine Textdatei zum Vorlesen öffnen. Sie können außerdem den Sprecher für einen Auftrag wechseln.

source: When you click <guibutton>OK</guibutton> or <guibutton>Apply</guibutton>, all changes to settings on other screens are applied (if any).
de: Klicken Sie auf <guibutton>Anwenden</guibutton> oder <guibutton>OK</guibutton>, dann werden alle geänderten Einstellungen auf allen Seiten übernommen.

source: The <guilabel>Jobs</guilabel> tab only appears when &jovie; is running. If you do not see the <guilabel>Jobs</guilabel> tab, click on the <guilabel>General</guilabel> tab and check the <guilabel>Enable Text-to-Speech (Jovie)</guilabel> box.
de: Die Karteikarte <guilabel>Aufträge</guilabel> wird nur angezeigt, wenn &jovie; gestartet wurde. Um Jovie zu starten, klicken Sie auf den Karteikartenreiter <guilabel>Allgemein</guilabel> und kreuzen dort <guilabel>Sprachausgabe aktivieren (Jovie)</guilabel> an.

source: Speaking Text from Web Pages
de: Das Vorlesen von Webseiten-Inhalten

source: While running the &kde; &konqueror; web browser, you can speak the text of the web page displayed. First ensure that &jovie; is running. Highlight the text you want spoken and choose <menuchoice> <guisubmenu>Tools</guisubmenu> <guisubmenu>Speak Text</guisubmenu> </menuchoice> on the main menu. <action>After a moment, the highlighted text should begin speaking.</action>
de: In &konqueror;, dem Webbrowser von &kde;, können Sie den Text der angezeigten Webseite vorlesen lassen. Überprüfen Sie zuerst, ob &konqueror; läuft. Markieren Sie dann den Text, der vorgelesen werden soll, und wählen Sie im Hauptmenü <menuchoice> <guisubmenu>Extras</guisubmenu> <guisubmenu>Text vorlesen</guisubmenu> </menuchoice><action>. Nach kurzer Zeit sollte die Sprachausgabe beginnen.</action>

source: It is almost always a good idea to highlight the text on the web page you want spoken. You can skip this step, but you will hear a lot of &HTML; headers and other invisible tags spoken.
de: Es ist fast immer sinnvoll, den gewünschten Text einer Webseite zu markieren. Sie können diesen Schritt auch überspringen, aber dann werden viele &HTML;-Vorspannzeilen und andere unsichtbare Marken ebenfalls vorgelesen.

source: Speaking Text from &kate; Text Editor
de: Sprachausgabe im Texteditor &kate;

source: While running the &kde; Advanced Text Editor (&kate;), you can speak the text displayed. First ensure that &jovie; is running and enable the <guilabel>KTextEditor Jovie Text-to-Speech Plugin</guilabel> in &kate;'s settings dialog. Highlight the text you want spoken and choose <menuchoice> <guisubmenu>Tools</guisubmenu> <guisubmenu>Speak Text</guisubmenu> </menuchoice> on the main menu. <action>After a moment, the highlighted text should begin speaking.</action>
de: In &kate; dem erweiterten Texteditor von &kde;, können Sie angezeigten Text vorlesen lassen. Überprüfen Sie zuerst, ob &jovie; läuft und aktivieren Sie das <guilabel>KTextEditor-Modul Jovie für die Sprachausgabe</guilabel> im Einrichtungsdialog von &kate;. Markieren Sie dann den Text, der vorgelesen werden soll, und wählen Sie im Hauptmenü <menuchoice> <guisubmenu>Extras</guisubmenu> <guisubmenu>Text vorlesen</guisubmenu> </menuchoice>. <action>Dann sollte die Sprachausgabe beginnen.</action>

source: You do not have to first highlight text. In this case, the entire file will be spoken.
de: Sie müssen nicht unbedingt Text markieren; in diesem Fall wird die ganze Datei vorgelesen.

source: This also works when &kate; is running embedded in another application, such as &konqueror; or &quanta;.
de: Dies funktioniert auch, wenn &kate; in andere Anwendungen eingebettet ist, wie &eg; in &konqueror; oder in &quanta;.

source: Speaking Notifications (KNotify)
de: Vorlesen von Nachrichten (Knotify)

source: KNotify is the notification subsystem within &kde;, which alerts you to events you configure within the &kde; system. You can configure &jovie; to speak text notifications.
de: KNotify ist das Nachrichtensystem von &kde;, das Sie über von Ihnen festgelegte Ereignisse benachrichtigt. Sie können den Text dieser Nachrichten auch von &jovie; vorlesen lassen.

source: For example, &konversation;, a &kde; IRC application, permits you to configure a wide variety of notifications. For instance, you can tell &konversation; to notify you whenever a message appears in an IRC channel with your nickname in it. Together with &jovie; you can have &kde; speak the text of the IRC message to you.
de: In &konversation;, dem IRC-Programm von &kde;, können Sie verschiedene Arten von Nachrichten einrichten. Sie können &konversation; beispielsweise so einrichten, dass Sie benachrichtigt werden, wenn in einem IRC-Kanal eine Nachricht auftaucht, in der Ihr Spitzname vorkommt. Mit &jovie; können Sie sich dann den IRC-Nachrichtentext vorlesen lassen.

source: In general, if a &kde; application supports KNotify, a <guilabel>Notifications</guilabel> menu item will appear under the application's <guilabel>Settings</guilabel> menu. The specifics for configuring each application with KNotify vary from application to application.
de: Unterstützt ein &kde;-Programm KNotify, erscheint ein Menüeintrag <guilabel>Benachrichtigungen</guilabel> im Menü <guilabel>Einstellungen</guilabel> dieses Programms. Die hier möglichen Einstellungen für KNotify unterscheiden sich je nach Anwendung.

source: String Replacer filters are a good way to clean up messages sent from applications if they are mispronounced or misspoken in &jovie;. The <filename>kmail.xml</filename> file, which comes with &jovie;, is a good example. It removes <command>br</command>, and <command>b</command> tags from the &kmail; notification messages and also removes the phrase <command>/local/inbox/</command>, since this may be safely assumed in most cases. See <xref linkend="stringreplacer"/>.
de: Filter zur Zeichenkettenersetzung bieten eine gute Möglichkeit in &jovie; falsch betonte oder fehlerhaft ausgesprochene Nachrichten zu korrigieren. Die Datei <filename>kmail.xml</filename>, die zum Lieferumfang von &jovie; gehört, ist ein gutes Beispiel. Sie entfernt die Tags <command>br</command> und <command>b</command> aus den Nachrichten, die KMail versendet, und zudem den Ausdruck <command>/local/inbox</command>, da dieser in den meisten Fälle als vorausgesetzt angenommen werden kann. Lesen Sie dazu auch <xref linkend="stringreplacer"/>.

source: Filters (Advanced)
de: Filter (Fortgeschrittene)

source: Filters are an advanced feature of &jovie;. For the basic operation of &jovie;, they are not needed.
de: Filter sind eine der fortgeschrittenen Fähigkeiten von &jovie;. Für die normale Arbeit mit &jovie; sind Filter nicht erforderlich.

source: Filters are used to pre-process text before it is sent to speech-dispatcher. They are useful for enhancing speech, substituting for misspoken words or abbreviations, choosing the appropriate language and talker to do the speaking, or working around certain limitations of speech synthesizers and their voices.
de: In Filtern wird Text bearbeitet, ehe er zum Programm speech-dispatcher geschickt wird. Sie sind nützlich für die Verbesserung der Aussprache, um falsch gesprochene Worte oder Abkürzungen zu ersetzen, eine passende Sprache und Sprecher auszuwählen oder um bestimmte Mängel von Sprachsynthesizern und deren Stimmen zu umgehen.
