Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdeaccessibility/kmag.po
Languages: de

source: The &kmag; Handbook
de: Das Handbuch zu &kmag;

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Marco</firstname><surname>Wegner</surname><affiliation><address><email>hunsum@gmx.de</email></address></affiliation><contrib>Übersetzer</contrib></othercredit><othercredit role="translator"><firstname>Stephan</firstname><surname>Johach</surname><affiliation><address><email>hunsum@gmx.de</email></address></affiliation><contrib>Übersetzer</contrib></othercredit>

source: &kmag; is a screen magnifier. You can use &kmag; to magnify a part of the screen just as you would use a lens to magnify a newspaper fine-print or a photograph. This application is useful for a variety of people: from researchers to artists to web-designers to people with low vision. This document will try to be a complete reference manual for using &kmag;.
de: &kmag; ist eine Bildschirmlupe. Sie können mit &kmag; einen Teil des Bildschirms vergrößern, so als würden Sie beim Zeitung lesen eine Lupe für das Kleingedruckte oder das genaue Betrachten eines Fotos benutzen. Diese Anwendung ist für verschiedene Benutzer interessant: Dazu gehören Künstler, Web-Designer und Menschen mit einer Sehbehinderung. Diese Dokumentation soll ein vollständiges Handbuch für die Benutzung von &kmag; sein.

source: Introduction
de: Einleitung

source: &kmag; is a screen magnifier for the K Desktop Environment (&kde;). It can be used to magnify a part of the screen. This application can be useful to various people: People with low vision can use this application to magnify a part of the screen which they are unable to view clearly, artists can use this application to zoom into the graphics they produce and verify it at the pixel level, image-processing researchers can use this application to zoom into images and study them closely. Other than these, &kmag; can be used for various other purposes &eg; is possible to use the application for grabbing a portion of the screen and saving it to the disk (with an option of zooming the screen captured).
de: &kmag; ist eine Bildschirmlupe für die K Desktop-Umgebung (&kde;). Mit &kmag; kann ein Bereich des Bildschirms vergrößert werden. Diese Anwendung kann für verschiedene Benutzergruppen nützlich sein: Menschen mit einer Sehbehinderung können diese Anwendung dazu benutzen, Bereiche des Bildschirms vergrößert anzuzeigen, die sie ansonsten nur schwer erkennen könnten; Künstler können damit Bereiche einer von ihnen erstellen Grafik vergrößern, um diese auf Pixelebene zu betrachten; Personen, die auf dem Gebiet der Bildverarbeitung arbeiten, können kleinste Einzelheiten von Bildern genauer betrachten. Darüber hinaus kann &kmag; für viele weitere Dinge benutzt werden. So ist es möglich einen Bildschirmbereich einzufangen und diesen vergrößert in eine Datei zu speichern.

source: &kmag; is a very powerful application with new features being added all the time. It is optimized for use on low processing power machines.
de: &kmag; ist eine sehr leistungsfähige Anwendung, die ständig um neue Funktionen erweitert wird. Sie ist für den Einsatz auf leistungsschwachen Rechnern optimiert.

source: Using &kmag;
de: Arbeiten mit &kmag;

source: Here's a screen shot of &kmag;
de: Hier sehen Sie ein Bildschirmfoto von &kmag;.

source: Screen shot of &kmag;
de: Bildschirmfoto von &kmag;

source: After running &kmag; you will get a window similar to the one show above. The main window of &kmag; shows the magnified (or zoomed) contents. We refer to this window as the <quote>zoom window</quote>. The zoomed image shown inside the zoom window is captured from a part of the screen. The part of the screen which is magnified is referred to as the <quote>selection window</quote>.
de: Wenn Sie &kmag; starten, erscheint ein Fenster wie oben abgebildet. Das Hauptfenster von &kmag; zeigt den vergrößerten Bereich des Bildschirms. Im Folgenden wird dieses Fenster als <quote>Vergrößerungsfenster</quote> bezeichnet.. Das Bild, das im Vergrößerungsfenster angezeigt wird, ist ein vergrößerter Bereich des Bildschirms und wird im Folgenden als <quote>Auswahlfenster</quote> bezeichnet.

source: By default, &kmag; magnifies the region around the mouse cursor into the zoom window (think of it as a moving lens). Alternatively, you can ask &kmag; to magnify an chosen area of the screen (<guilabel>Selection Window Mode</guilabel>) or the whole screen (<guilabel>Whole Screen Mode</guilabel>) into the zoom window.
de: In der Standardeinstellung vergrößert &kmag; den Bereich um den Mauszeiger wie eine bewegliche Lupe. Alternativ können Sie &kmag; dazu veranlassen einen ausgewählten Bildschirmbereich im Vergrößerungsfenster (<guilabel>Auswahlfenstermodus</guilabel>) oder den ganzen Bildschirm (<guilabel>Vollbildschirmmodus</guilabel>) im Vergrößerungsfenster darzustellen.

source: If you would prefer not to see the mouse cursor in the zoomed image, select <guilabel>Hide Mouse Cursor</guilabel>. Please note that &kmag; cannot yet find out the current cursor shape. Thus, it shows the default &kde;/&Qt; cursor.
de: Möchten Sie vermeiden, dass der Mauszeiger im vergrößerten Fenster dargestellt wird, wählen Sie die Einstellung <guilabel>Mauszeiger ausblenden</guilabel>. Bitte beachten Sie, das &kmag; derzeit noch nicht in der Lage ist, die Form des Mauszeigers zu erkennen. Dies ist immer der Standard-&kde;/&Qt;-Mauszeiger.

source: Changing the part of the screen to be magnified
de: Größe des Auswahlfensters ändern

source: When in <guilabel>Selection Window Mode</guilabel>, the zoom window and the selection window can be moved and resized using the &LMB; like any window. You can also change the position and size of the selection window using the arrow keys on the keyboard, or by clicking into the zoom window:
de: Im <guilabel>Auswahlfenstermodus</guilabel> können Sie das Vergrößerungs- und Auswahlfenster mit der &LMBn; wie jedes andere Fenster verschieben und vergrößern. Außerdem können Sie mit den Pfeiltasten die Position und Größe des Auswahlfensters ändern und mit gedrückter linker Maustaste im Vergrößerungsfenster das Auswahlfenster verschieben.

source: <keycap>Arrow keys</keycap>, &LMB; or &MMB;
de: <keycap>Pfeiltasten</keycap>, &LMB; oder &MMB;

source: By keeping the &LMB; or &MMB; pressed in the zoom window and moving the mouse, you can move the selection window. You can also use the arrow keys if the selection window has the focus.
de: Bewegen Sie den Mauszeiger im Vergrößerungsfenster und halten dabei die &LMB; oder &MMB; gedrückt, so können Sie das Auswahlfenster verschieben. Dies geht auch mit den Pfeiltasten, wenn das Auswahlfenster den Fokus hat.

source: <keycombo>&Ctrl;<keycap>Arrow Keys</keycap></keycombo> or <keycombo>&Ctrl;<mousebutton>&LMB;</mousebutton></keycombo>
de: <keycombo>&Ctrl;<keycap>Pfeiltasten</keycap></keycombo> oder <keycombo>&Ctrl;<mousebutton>&LMB;</mousebutton></keycombo>

source: By using this combination, you can resize the selection window. Keep in mind that the top-left corner of the selection window is kept constant and the bottom-right corner is movable.
de: Mit dieser Kombination können Sie die Größe des Auswahlfenster ändern. Beachten Sie dabei, dass die obere linke Ecke des Auswahlfensters fest stehen bleibt und nur die untere rechte Ecke zu bewegen ist.

source: More &kmag; features
de: Weitere Funktionen von &kmag;

source: &kmag; comes with lots of features. It is possible to print the zoomed image directly to a printer, save the image to a file, copy the zoomed image to the clipboard (which can be used later to paste in other applications), rotate the magnification image and more.
de: &kmag; besitzt eine Menge Funktionen. Sie können das vergrößerte Bild direkt zum Drucker schicken, in eine Datei speichern, in die Zwischenablage kopieren (um es später in andere Anwendungen einzufügen), das Bild drehen und vieles mehr.

source: Menus and Shortcuts
de: Menüs und Kurzbefehle

source: Menu Reference
de: Menüreferenz

source: The File Menu
de: Das Menü Datei

source: <shortcut> <keycombo action="simul">&Ctrl; <keycap>N</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>New Window</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl; <keycap>N</keycap></keycombo> </shortcut> <guimenu>Datei</guimenu> <guimenuitem>Neues Fenster</guimenuitem>

source: Opens a new &kmag; window.
de: Öffnet ein neues &kmag;-Fenster.

source: <shortcut> <keycombo action="simul">&Ctrl; <keycap>S</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Save Snapshot As...</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl; <keycap>S</keycap></keycombo> </shortcut> <guimenu>Datei</guimenu> <guimenuitem>Bildschirmfoto speichern unter ...</guimenuitem>

source: Saves the zoomed view to an image file.
de: Speichert den vergrößerten Bildschirmbereich in eine Datei.

source: <shortcut> <keycombo action="simul">&Ctrl; <keycap>P</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Print...</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl; <keycap>P</keycap></keycombo> </shortcut> <guimenu>Datei</guimenu> <guimenuitem>Drucken ...</guimenuitem>

source: Prints the current zoomed view.
de: Druckt den vergrößerten Bildschirmbereich.

source: <shortcut> <keycombo action="simul">&Ctrl; <keycap>Q</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Quit</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl; <keycap>Q</keycap></keycombo> </shortcut> <guimenu>Datei</guimenu> <guimenuitem>Beenden</guimenuitem>

source: Quits the application
de: Beendet die Anwendung.

source: The Edit Menu
de: Das Menü Bearbeiten

source: <shortcut> <keycombo action="simul">&Ctrl; <keycap>C</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Copy</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl; <keycap>C</keycap></keycombo> </shortcut> <guimenu>Bearbeiten</guimenu> <guimenuitem>Kopieren</guimenuitem>

source: Copy the current zoomed view to the clipboard which you can paste in other applications.
de: Kopiert den vergrößerten Bereich in die Zwischenablage.

source: The View Menu
de: Das Menü Ansicht

source: <shortcut> <keycombo action="simul"> <keycap>F5</keycap></keycombo> </shortcut> <guimenu>View</guimenu> <guimenuitem>Start/Stop</guimenuitem>
de: <shortcut> <keycombo action="simul"> <keycap>F5</keycap></keycombo> </shortcut> <guimenu>Ansicht</guimenu> <guimenuitem>Starten/Stopp</guimenuitem>

source: Start/Stop updating of the display. Stopping the update will zero the processing power required (CPU usage)
de: Startet bzw. stoppt die Aktualisierung der Anzeige. Das Stoppen der Aktualisierung bewirkt, dass die benötigte CPU-Zeit gegen 0 geht.

source: <guimenu>View</guimenu> <guimenuitem>Zoom</guimenuitem>
de: <guimenu>Ansicht</guimenu> <guimenuitem>Vergrößern</guimenuitem>

source: Select the zoom factor.
de: Legt den Vergrößerungsfaktor fest.

source: <shortcut> <keycombo action="simul">&Ctrl; <keycap>-</keycap></keycombo> </shortcut> <guimenu>View</guimenu> <guimenuitem>Zoom Out</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl; <keycap>-</keycap></keycombo> </shortcut> <guimenu>Ansicht</guimenu> <guimenuitem>Verkleinern</guimenuitem>

source: Click on this button to zoom-out on the selected region.
de: Klicken Sie auf diesen Knopf, um die Vergrößerung des ausgewählten Bereichs zu verringern.

source: <shortcut> <keycombo action="simul">&Ctrl; <keycap>+</keycap></keycombo> </shortcut> <guimenu>View</guimenu> <guimenuitem>Zoom In</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl; <keycap>+</keycap></keycombo> </shortcut> <guimenu>Ansicht</guimenu> <guimenuitem>Vergrößern</guimenuitem>

source: Click on this button to zoom-in on the selected region.
de: Klicken Sie auf diesen Knopf, um die Vergrößerung des ausgewählten Bereichs zu erhöhen.

source: <guimenu>View</guimenu> <guimenuitem>Rotation</guimenuitem>
de: <guimenu>Ansicht</guimenu> <guimenuitem>Drehung</guimenuitem>

source: Select the rotation degree (<guimenuitem>No Rotation (0 Degrees)</guimenuitem>, <guimenuitem>Left (90 Degrees)</guimenuitem>, <guimenuitem>Upside Down (180 Degrees)</guimenuitem>, <guimenuitem>Right (270 Degrees)</guimenuitem>.
de: Wählen Sie eine Drehung (<guimenuitem>Keine Drehung (0°)</guimenuitem>, <guimenuitem>Links (90°)</guimenuitem>, <guimenuitem>Umgedreht (180°)</guimenuitem>, <guimenuitem>Rechts (270°)</guimenuitem>.

source: <guimenu>View</guimenu> <guimenuitem>Refresh</guimenuitem>
de: <guimenu>Ansicht</guimenu> <guimenuitem>Aktualisieren</guimenuitem>

source: Select the refresh rate (<guimenuitem>Very Low</guimenuitem>, <guimenuitem>Low</guimenuitem>, <guimenuitem>Medium</guimenuitem>, <guimenuitem>High</guimenuitem>, <guimenuitem>Very High</guimenuitem>). The higher the rate, the more computing power (CPU) will be needed.
de: Wählen Sie die Aktualisierungsrate (<guimenuitem>Sehr gering</guimenuitem>, <guimenuitem>Gering</guimenuitem>, <guimenuitem>Mittel</guimenuitem>, <guimenuitem>Hoch</guimenuitem>, <guimenuitem>Sehr hoch</guimenuitem>). Je höher die Aktualisierungsrate, desto mehr CPU-Zeit wird benötigt.

source: <guimenu>View</guimenu> <guisubmenu>Colors</guisubmenu>
de: <guimenu>Ansicht</guimenu> <guimenuitem>Farbe</guimenuitem>

source: Select different color vision deficiencies to simulate color blindness. This is not useful for people with color blindness, but good for designing accessible interfaces.
de: Hier können Farbkombinationen eingestellt werde, die Farbsehschwächen simulieren. Diese Einstellungen sind nicht für Personen mit Farbsehschwächen gedacht, sondern hilfreich beim Entwickeln von behindertengerechten Bedienungsoberflächen.

source: The Settings Menu
de: Das Menü Einstellungen

source: <shortcut> <keycombo action="simul"> <keycap>F2</keycap></keycombo> </shortcut> <guimenu>Settings</guimenu> <guimenuitem>Follow Mouse Mode</guimenuitem>
de: <shortcut> <keycombo action="simul"> <keycap>F2</keycap></keycombo> </shortcut> <guimenu>Einstellungen</guimenu> <guimenuitem>Dem Mauszeiger folgen</guimenuitem>

source: In this mode the area around the mouse cursor is shown in a normal window.
de: In diesem Modus wird der Bereich um den Mauszeiger in einem Fenster dargestellt.

source: <shortcut> <keycombo action="simul"> <keycap>F3</keycap></keycombo> </shortcut> <guimenu>Settings</guimenu> <guimenuitem>Selection Window Mode</guimenuitem>
de: <shortcut> <keycombo action="simul"> <keycap>F3</keycap></keycombo> </shortcut> <guimenu>Einstellungen</guimenu> <guimenuitem>Auswahlfenstermodus</guimenuitem>

source: In this mode a selection window is opened. The selected area is shown in a normal window.
de: In diesem Modus wird ein Auswahlfenster angezeigt. Der ausgewählte Bereich wird in einem Fenster angezeigt.

source: <shortcut> <keycombo action="simul"> <keycap>F4</keycap></keycombo> </shortcut> <guimenu>Settings</guimenu> <guimenuitem>Whole Screen Mode</guimenuitem>
de: <shortcut> <keycombo action="simul"> <keycap>F4</keycap></keycombo> </shortcut> <guimenu>Einstellungen</guimenu> <guimenuitem>Vollbildschirmmodus</guimenuitem>

source: In this mode the whole screen is magnified in the zoom window.
de: In diesem Modus wird der gesamte Bildschirm im Vergrößerungsfenster dargestellt.

source: <shortcut> <keycombo action="simul"> <keycap>F6</keycap></keycombo> </shortcut> <guimenu>Settings</guimenu> <guimenuitem>Hide Mouse Cursor</guimenuitem>
de: <shortcut> <keycombo action="simul"> <keycap>F6</keycap></keycombo> </shortcut> <guimenu>Einstellungen</guimenu> <guimenuitem>Mauszeiger ausblenden</guimenuitem>

source: Show or hide the mouse cursor in the magnified image.
de: Mauszeiger im vergrößerten Bild anzeigen oder ausblenden.

source: <shortcut> <keycombo action="simul"> <keycap>F7</keycap></keycombo> </shortcut> <guimenu>Settings</guimenu> <guimenuitem>Stays On Top</guimenuitem>
de: <shortcut> <keycombo action="simul"> <keycap>F7</keycap></keycombo> </shortcut> <guimenu>Einstellungen</guimenu> <guimenuitem>Immer im Vordergrund</guimenuitem>

source: The &kmag; window stays on top of other windows.
de: Das &kmag;-Fenster wird immer vor anderen Fenstern angezeigt.

source: Additionally &kmag; has the common &kde; <guimenu>Settings</guimenu> and <guimenu>Help</guimenu> menu items, for more information read the sections about the <ulink url="help:/fundamentals/ui.html#menus-settings">Settings Menu</ulink> and <ulink url="help:/fundamentals/ui.html#menus-help">Help Menu</ulink> of the &kde; Fundamentals.
de: Zusätzlich hat &kmag; die bekannten &kde;-Einträge im Menü <guimenu>Einstellungen</guimenu> und <guimenu>Hilfe</guimenu>, weitere Informationen dazu finden Sie in den Abschnitten über die Menüs <ulink url="help:/fundamentals/ui.html#menus-settings">Einstellungen</ulink> und <ulink url="help:/fundamentals/uihtml#menus-help">Hilfe</ulink> der &kde;-Grundlagen.

source: Command Reference
de: Befehlsreferenz

source: &kmag; automatically uses all your default shortcuts for saving file, opening new window, printing, starting/stopping refresh (reload button in &konqueror;), zoom-in, zoom-out &etc;
de: &kmag; verwendet automatisch Ihre eingestellten Kurzbefehle zum Speichern von Dateien, Öffnen eines neuen Fensters, Drucken, Neuladen (mit dem Knopf <quote>Dokument erneut laden</quote> im &konqueror;), Vergrößern und Verkleinern &etc;.

source: Default Keyboard Shortcuts
de: Standard-Tastenkürzel

source: This will save the contents of the zoom window to a file.
de: Speichert den Inhalt des Vergrößerungsfensters in eine Datei.

source: Switch to "Follow Mouse Mode".
de: Wechselt zum Modus <quote>Dem Mauszeiger folgen</quote>.

source: Switch to "Selection Window Mode".
de: Wechselt zum <quote>Auswahlfenstermodus</quote>.

source: Switch to "Whole Screen Mode".
de: Wechselt zum <quote>Vollbildschirmmodus</quote>.

source: This will start the refresh of the zoom window if it is stopped, or stops the refresh of the zoom window if the refresh is currently on.
de: Startet bzw. stoppt die Aktualisierung des Vergrößerungsfensters.

source: This will open a new &kmag; window.
de: Öffnet ein neues &kmag;-Fenster

source: This will open the print dialog for printing the contents of the zoom window.
de: Ruft den Druckdialog auf, um den Inhalt des Vergrößerungsfensters auszudrucken .

source: This will copy the zoom window contents to the clipboard.
de: Über diesen Kurzbefehl wird der Inhalt des Vergrößerungsfensters in die Zwischenablage kopiert.

source: Show/Hide the menubar.
de: Menüleiste ein/ausblenden

source: Zoom out
de: Verkleinern

source: Zoom in
de: Vergrößern

source: Quits the application.
de: Beendet die Anwendung.

source: Credits and License
de: Danksagungen und Lizenz

source: Program copyright 2001-2003 Sarang Lakare <email>sarang@users.sf.net</email> and 2003-2005 Olaf Schmidt <email>ojschmidt@kde.org</email>.
de: Copyright des Programms 2001-2003 Sarang Lakare <email>sarang@users.sf.net</email> und 2003-2005 Olaf Schmidt <email>ojschmidt@kde.org</email>.

source: Contributors:
de: Beiträge:

source: Michael Forster <email>forster@fmi.uni-passau.de</email> (original author)
de: Michael Forster <email>forster@fmi.uni-passau.de</email> (Ursprünglicher Autor)

source: Documentation copyright 2002 Sarang Lakare <email>sarang@users.sf.net</email> and 2004-2005 Olaf Schmidt <email>ojschmidt@kde.org</email>
de: Copyright der Dokumentation 2002 Sarang Lakare <email>sarang@users.sf.net</email> und 2004-2005 Olaf Schmidt <email>ojschmidt@kde.org</email>

source: CREDIT_FOR_TRANSLATORS
de: <para>Übersetzung Stephan Johach <email>hunsum@gmx.de</email></para>

source: How to obtain &kmag;
de: Bezugsquellen für &kmag;

source: Compilation and Installation
de: Kompilierung und Installation
