Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdeaccessibility/kmag_man-kmag.1.po
Languages: de

source: &kde; User's Manual
de: &kde;-Benutzerhandbuch

source: Screen magnifier
de: Bildschirmlupe

source: <command>kmag</command> <arg choice="opt">&kde; Generic Options</arg> <arg choice="opt">&Qt; Generic Options</arg>
de: <command>kmag</command> <arg choice="opt">Allgemeine KDE-Befehlszeilenparameter</arg> <arg choice="opt">Allgemeine Qt-Befehlszeilenparameter</arg>

source: Description
de: Beschreibung

source: <command>kmag</command>, also known as &kmagnifier; is a screen magnifier. You can use &kmagnifier; to magnify a part of the screen just as you would use a lens to magnify a newspaper fine-print or a photograph. This application is useful for a variety of people: from researchers to artists to web-designers to people with low vision.
de: <command>kmag</command> auch bekannt als &kmagnifier; ist eine Bildschirmlupe. Sie können &kmagnifier; dazu benutzen einen Bereich des Bildschirms zu vergrößern, so als würden Sie eine Lupe benutzen, um das Kleingedruckte in einer Zeitung oder ein Foto zu betrachten. Diese Anwendung ist für verschiedene Menschen von Nutzen: vom Rechercheur oder Künstler bis zum Webdesigner oder Sehbehinderten.

source: See Also
de: Siehe auch

source: More detailed user documentation is available from <ulink url="help:/kmag">help:/kmag</ulink> (either enter this &URL; into &konqueror;, or run <userinput><command>khelpcenter</command> <parameter>help:/kmag</parameter></userinput>).
de: Ausführlichere Benutzerdokumentation finden Sie mit <ulink url="help:/kmag">help:/kmag</ulink> (geben Sie entweder diese <acronym>URL</acronym> in die Adressleiste von &konqueror; ein oder starten Sie <userinput><command>khelpcenter</command> <parameter>help:/kmag</parameter></userinput>).

source: There is also further information available at the <ulink url="http://accessibility.kde.org/">&kde; accessibility project home page.</ulink>
de: Weitere Informationen finden Sie außerdem auf der <ulink url="http://accessibility.kde.org/">Homepage des Accessibility-Projekts von &kde;</ulink>.

source: Authors
de: Autoren

source: &kmagnifier; was written by <personname><firstname>Olaf</firstname><surname>Schmidt</surname></personname> <email>ojschmidt@kde.org</email> and <personname><firstname>Sarang</firstname><surname>Lakare</surname></personname> <email>sarang@users.sf.net</email> and <personname><firstname>Michael</firstname><surname>Forster</surname></personname> <email>forster@fmi.uni-passau.de</email>
de: &kmagnifier; wurde entwickelt von <personname><firstname>Olaf</firstname><surname>Schmidt</surname></personname> <email>ojschmidt@kde.org</email> und <personname><firstname>Sarang</firstname><surname>Lakare</surname></personname> <email>sarang@users.sf.net</email> und <personname><firstname>Michael</firstname><surname>Forster</surname></personname> <email>forster@fmi.uni-passau.de</email>.
