Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdeaccessibility/kmousetool.po
Languages: de

source: The &kmousetool; Handbook
de: Das Handbuch zu &kmousetool;

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Stephan</firstname><surname>Johach</surname><affiliation><address><email>hunsum@gmx.de</email></address></affiliation><contrib>Übersetzer</contrib></othercredit>

source: &kmousetool; clicks the mouse whenever the mouse cursor pauses briefly. It was designed to help those with repetitive strain injuries, for whom pressing buttons hurts.
de: &kmousetool; emuliert einen Mausklick, sobald der Mauszeiger eine Weile auf derselben Stelle verharrt. Es ist dazu gedacht, Menschen zu helfen, die am RSI-Syndrom (Repetitive-Strain-Injury-Syndrom) leiden und denen jeder Mausklick Schmerzen bereitet.

source: Introduction
de: Einleitung

source: &kmousetool; clicks the mouse whenever the mouse cursor pauses briefly. It was designed to help those with repetitive strain injuries, for whom pressing buttons hurts. It can also drag the mouse, although this takes a bit more practice.
de: &kmousetool; emuliert einen Mausklick, sobald der Mauszeiger eine Weile auf derselben Stelle verharrt. Es ist dazu gedacht, Menschen zu helfen, die am Repetitive Strain Injury (RSI) Syndrom leiden und denen jeder Mausklick Schmerzen bereitet. Außerdem kann es das Ziehen mit der Maus emulieren. Dies erfordert allerdings ein wenig Übung.

source: &kmousetool; can eliminate the pain caused by clicking the mouse, and helps many people to use the computer without pain. Unfortunately, some pain can also be caused by simply moving the mouse around the table. If you are experiencing computer-related pain and haven't yet seen a doctor, please do so.
de: &kmousetool; kann den Schmerz umgehen, der beim Klicken der Maus entsteht und hilft so vielen Menschen, den Computer ohne Schmerzen zu nutzen. Unglücklicherweise können auch durch das bloße Bewegen der Maus Schmerzen verursacht werden. Leiden Sie an Schmerzen, die mit der Benutzung Ihres Computers zusammenhängen, sollten Sie einen Arzt aufsuchen, sofern dies noch nicht geschehen ist.

source: Just to make it absolutely clear: while &kmousetool; can help reduce the pain caused by <emphasis>clicking</emphasis> the mouse, it cannot help any pain caused by <emphasis>moving</emphasis> the mouse. And, like all ergonomic tools, your mileage may vary.
de: Um es noch einmal klarzustellen: auch wenn &kmousetool; Schmerzen vermeiden hilft, die beim <emphasis>Klicken</emphasis> mit der Maus entstehen, ist es gegen Schmerzen, die durch das <emphasis>Bewegen</emphasis> der Maus verursacht werden, nutzlos. Und wie bei allen ergonomischen Hilfsmitteln gilt: das Ergebnis kann für jeden unterschiedlich ausfallen.

source: Using &kmousetool;
de: Arbeiten mit &kmousetool;

source: Using &kmousetool; is simple: &kmousetool; watches as you move the mouse, and when you pause briefly, it clicks.
de: Die Verwendung von &kmousetool; ist einfach: &kmousetool; überwacht Ihre Mausbewegungen und führt einen Mausklick aus, sobald Sie die Bewegung kurz unterbrechen.

source: &kmousetool;'s Smart Drag mode allows you to drag the mouse.
de: Der intelligente Verschiebemodus von &kmousetool; erlaubt Ihnen das Ziehen mit der Maus.

source: When Smart Drag is enabled, &kmousetool; pauses after it clicks down; if you move the mouse, it waits until you stop moving before it clicks up. This way, you can both click and drag the mouse. Smart Drag takes a bit more practice, but becomes natural once you get used to it.
de: Ist das intelligente Verschieben aktiviert, macht &kmousetool; eine Pause, nachdem es das Drücken der Maustaste emuliert hat. Bewegen Sie nun die Maus, wartet es bis zum Ende der Bewegung, ehe das Loslassen der Maustaste ausgeführt wird. Auf diese Weise können Sie das Ziehen bei gedrückter Maustaste ausführen. Das intelligente Verschieben erfordert ein wenig Übung, aber Sie gewöhnen sich schnell daran.

source: Command Reference
de: Befehlsreferenz

source: The Main &kmousetool; window
de: Das Hauptfenster von &kmousetool;

source: &kmousetool;'s options are accessed mostly via the mouse.
de: Die Einstellungen von &kmousetool; sind größtenteils über die Maus zugänglich.

source: <guibutton>Start</guibutton>/<guibutton>Stop</guibutton>
de: <guibutton>Starten</guibutton>/<guibutton>Stopp</guibutton>

source: Starts (or stops) &kmousetool;.
de: Startet oder (stoppt) &kmousetool;.

source: Minimum movement:
de: Minimale Bewegung:

source: The minimum movement in pixels before &kmousetool; will attempt to click the mouse.
de: Die minimale Bewegung in Pixeln, nach der &kmousetool; einen Mausklick versucht.

source: Dwell time (1/10 sec):
de: Verweilzeit (1/10 s):

source: The time the mouse has to pause before &kmousetool; clicks. Try increasing this time if it is hard getting used to &kmousetool;
de: Diese Verweilzeit muss nach dem Ende der Mausbewegung verstreichen, bevor &kmousetool; einen Mausklick ausführt.

source: Smart drag
de: Intelligentes Verschieben

source: Enables or disables Smart Drag. Disabled use is easier, so this is the default.
de: Schaltet das intelligente Verschieben an oder aus. Die Handhabung ist leichter, wenn der Modus ausgeschaltet ist. Darum ist dies die Voreinstellung.

source: If you enable <guilabel>Smart drag</guilabel> the <guilabel>Drag time (1/10 sec):</guilabel> field becomes available. This is the time &kmousetool; waits, after it clicks down, before it clicks back up if you don't move the mouse.
de: Ist <guilabel>Intelligentes Verschieben</guilabel> eingeschaltet, wird das Drehfeld <guilabel>Verschiebezeit (1/10 s)</guilabel> aktiv. Hier wird die Zeit eingestellt, die &kmousetool; nach dem Herunterdrücken der Maustaste wartet, bevor es die Maustaste wieder <quote>loslässt</quote>, wenn zwischenzeitlich kein Bewegen der Maus erfolgt.

source: Enable strokes
de: Klick durch Mausverschiebung aktivieren

source: &kmousetool; now supports strokes. When you enable strokes, a slow move to the right and back, followed by a pause, will generate a <mousebutton>right</mousebutton> click. A slow move left and back will generate a double click. (Strokes are specified in <filename>$<envar>KDEHOME</envar>/share/config/kmousetool_strokes.txt</filename>. This file is generated by &kmousetool; the first time it is run, but can be modified afterwards.)
de: &kmousetool; unterstützt jetzt das Klicken durch Mausverschiebung. Ist diese Funktion aktiviert, erzeugt ein langsames Bewegen nach rechts und zurück, gefolgt von einer Pause, einen Klick mit der <mousebutton>rechten</mousebutton> Maustaste. Ein langsames Bewegen nach links und zurück führt einen Doppelklick. Diese Bewegungen werden in der Datei <filename>$<envar>KDEHOME</envar>/share/config/kmousetool_strokes.txt</filename> gespeichert, wenn &kmousetool; das erste Mal gestartet wird, sie können aber später geändert werden.

source: Audible click
de: Hörbares Klicken

source: Plays a sound when &kmousetool; clicks down. This helps, especially with Smart Drag.
de: Spielt einen Klang ab, wenn &kmousetool; einen Klick ausführt. Dies ist besonders im Zusammenhang mit dem intelligenten Verschieben hilfreich.

source: Start with KDE
de: Mit KDE starten

source: When this is enabled, &kmousetool; will start each time &kde; starts. At the moment, this only works under &kde;. Under GNOME or other Window Managers, see the documentation for the Window Manager itself to see how to start a program automatically when you start the windowing system.
de: Ist diese Einstellung markiert, wird &kmousetool; bei jedem Start von &kde; gestartet. Diese Funktion ist momentan nur unter &kde; verfügbar. Bei GNOME oder anderen Fensterumgebungen ziehen Sie bitte die jeweilige Dokumentation zu Rate, um herauszufinden, wie Sie dort ein Programm automatisch starten.

source: Defaults
de: Voreinstellungen

source: Reset all settings to their defaults.
de: Alle Einstellungen auf die Voreinstellung zurücksetzen.

source: Reset
de: Zurücksetzen

source: Reset all settings to their state when you opened the dialog, or, if you have already saved a setting with the <guibutton>Apply</guibutton> button, reset all settings to the state when you last pressed <guibutton>Apply</guibutton>
de: Setzt alle Einstellungen auf die Werte zurück, die beim Öffnen des Dialogs eingestellt waren. Haben Sie bereits den Knopf <guibutton>Anwenden</guibutton> gedrückt, werden die Einstellungen auf den Stand nach dem letzten Drücken von <guibutton>Anwenden</guibutton> zurückgesetzt.

source: Apply
de: Anwenden

source: After changing any settings, you must click this button.
de: Wenn Sie Einstellungen geändert haben, müssen Sie diesen Knopf betätigen damit die Änderungen wirksam werden.

source: Help
de: Hilfe

source: Opens the User manual (this document).
de: Öffnet das Benutzerhandbuch (die vorliegende Datei).

source: Close
de: Schließen

source: Close the dialog without saving any settings.
de: Schließt den Dialog, ohne dass Änderungen an den Einstellungen gespeichert werden.

source: Quit
de: Beenden

source: Quit &kmousetool;
de: Beendet &kmousetool;

source: Tips
de: Tipps

source: These tips can help shorten &kmousetool;'s learning curve a bit.
de: Diese Tipps können dabei helfen, die Lernkurve beim Umgang mit &kmousetool; zu verbessern.

source: You can modify the time delays &kmousetool; waits, for both clicking and for dragging.
de: Sie können die Verzögerungszeiten von &kmousetool; beim Klicken und für das Verschieben ändern.

source: It's best to practice clicking with &kmousetool; using its defaults first. You may especially want to leave Smart Drag disabled at first. Then, once you are comfortable clicking, move on to practicing Smart Drag.
de: Am besten verwenden Sie &kmousetool; zunächst mit den Voreinstellungen. Insbesondere das intelligente Verschieben sollten Sie zunächst ausgeschaltet lassen. Wenn Sie sich dann an das automatische Mausklicken gewöhnt haben, können Sie später das intelligente Verschieben hinzunehmen.

source: When using Smart Drag, it may help to enable the Audible Click
de: Wenn Sie das intelligente Verschieben nutzen, kann es hilfreich sein den hörbaren Klick einzuschalten.

source: When using the Audible Click, you may need to speed up &kde;'s audio response.
de: Wenn Sie den hörbaren Klick benutzen, ist es ggf. nötig die Antwortzeiten von &kde; bei Klängen zu verringern.

source: Questions and Answers
de: Fragen und Antworten

source: Help! &kmousetool; keeps dropping spurious clicks all over the screen!
de: &kmousetool; führt überall auf dem Bildschirm Mausklicks aus.

source: When you are using &kmousetool;, you do have to learn new mousing habits.
de: Wenn Sie &kmousetool; verwenden, müssen Sie den Umgang mit der Maus neu lernen.

source: First, keep in mind where it's safe to click &mdash; clicking on gray parts of windows or non-link areas of web browsers won't hurt anything, so you can safely rest the mouse over those areas until you need it.
de: Zunächst sollten Sie sich bewusst machen, an welchen Stellen ein Mausklick ohne Wirkung bleibt: Das Klicken auf die neutralen Bestandteile von Fenstern oder auf Stellen im Browserfenster, die keine Verknüpfung darstellen, führt nicht zu ungewollten Reaktionen. Sie können daher die Maus an solchen Stellen parken, bis Sie sie wieder benutzen möchten.

source: Second, you need to know where you're going to click before you move the mouse. Most of the time, when we know we're going to use the mouse, most of us grab the mouse and start moving it around randomly until we figure out where we want to click. With &kmousetool;, you need to know where you're going to click before you move the mouse in the first place. It is also a good idea to keep your hands off the mouse when you're not using it.
de: Zweitens sollten Sie schon, bevor Sie die Maus bewegen, wissen, wo Sie einen Klick ausführen wollen. Wenn wir die Maus benutzen wollen, schieben wir sie eher zufällig herum, bis wir genau wissen, wo wir den Mausklick ausführen wollen. Wenn Sie &kmousetool; benutzen, müssen Sie schon vorher wissen, wo die Maustaste betätigt werden soll. Es ist außerdem ratsam die Maus erst in die Hand zu nehmen, wenn Sie sie tatsächlich benutzen wollen und sie ansonsten nicht anzufassen.

source: My mouse sticks when I move it. Can I still use &kmousetool;?
de: Meine Maus ruckelt, wenn ich sie bewege. Kann ich &kmousetool; trotzdem verwenden?

source: Yes. If your mouse sticks, it means you need to clean your mouse. This is usually easy to do; the trick is that you have to clean not just the mouse's ball, but the rollers that the ball rolls against inside the mouse.
de: Wenn Ihre Maus ruckelt, sollten Sie Ihre Maus reinigen. Das ist normalerweise ziemlich einfach. Der Trick dabei ist, dass Sie nicht nur die Mauskugel reinigen, sondern auch die Rollen, die mit der Mauskugel in Berührung kommen.

source: First, you have to remove the ball. The method for doing this varies from mouse to mouse, but it's usually pretty clear how to do this if you look at the bottom of the mouse.
de: Zunächst müssen Sie dazu die Mauskugel herausnehmen. Wie das geschieht, ist von Maus zu Maus unterschiedlich. Es sollte aber schnell klar sein, wenn Sie sich die Unterseite der Maus ansehen.

source: Once you've removed the ball, you should be able to see the rollers on the sides of the hole that contained the ball. The dirt and grime on them can be easily scraped off with a flat blade or with a fingernail.
de: Wenn Sie die Kugel entfernt haben, müssten Sie die Rollen sehen können. Diese befinden sich an den Seiten des Loches, in das die Kugel eingesetzt war. Den Dreck und die Verschmutzungen können Sie leicht mit einer flachen Klinge oder dem Fingernagel abkratzen.

source: &kmousetool; clicks down and never clicks up. What's happening?
de: &kmousetool; drückt die Maustaste, lässt sie aber nicht mehr los. Was passiert da?

source: In some rare situations, the system suspends &kmousetool; when a drag starts; if you are using Smart Drag, this means that &kmousetool; can never finish the drag by clicking up.
de: In sehr seltenen Situationen unterbricht das Betriebssystem die Ausführung von &kmousetool;, wenn gerade ein Verschiebevorgang begonnen wurde. Wenn Sie in diesem Fall das intelligente Verschieben benutzen, bedeutet das, dass &kmousetool; die Operation nicht mehr durch das Loslassen der Maustaste beenden kann.

source: This happens when you use &kmousetool; under a non &kde; window manager and then use it to move a window.
de: Dies geschieht, wenn Sie &kmousetool; unter einem anderen Fenstermanager verwenden und ein Fenster verschieben.

source: The solution is to simply click manually; this resets &kmousetool;, and you can then continue to work normally again.
de: Die Lösung für dieses Problem besteht darin, dass Sie selbst einen Mausklick ausführen. Hierdurch wird der Status von &kmousetool; zurückgesetzt und Sie können wie gewohnt weiterarbeiten.

source: &kmousetool; moves the cursor when I am trying to type.
de: &kmousetool; bewegt den Cursor, wenn ich etwas über die Tastatur eingeben will.

source: Problem: When you're typing text, &kmousetool; keeps dropping clicks and moving the cursor away from where you want to type.
de: Problem: Wenn Sie Text eingeben, versucht &kmousetool; weiterhin Mausklicks auszuführen und setzt dabei den Cursor an eine andere Stelle.

source: Solution: Use the mouse to place the cursor where you want it, but when you're ready to type, park the mouse on a neutral area on the screen. Then, if you bump the mouse, or if it moves a few pixels, any random clicks that it sends won't matter. Safe places to park the mouse include the gray areas around toolbars and menus, and on the title bars of windows.
de: Lösung: Benutzen Sie die Maus dazu, den Cursor dorthin zu platzieren, wo Sie ihn haben wollen. Aber parken Sie die Maus auf einem neutralen Bereich der Arbeitsfläche, wenn Sie eine Tastatureingabe vornehmen wollen. So kann ein versehentliches Bewegen der Maus &eg; durch Anstoßen nicht mehr dazu führen, dass die hierdurch ausgelösten Mausklicks ungewollte Reaktionen hervorrufen. Sichere Zonen für den Mauszeiger sind &eg; die grauen Flächen um die Werkzeugleisten und Menüs und die Titelzeilen von Fenstern.

source: I'm trying to use Smart Drag, but I cannot get the hang of using it to edit text.
de: Ich versuche mit dem intelligenten Verschieben zu arbeiten, aber ich schaffe es nicht, damit Text zu editieren.

source: Smart Drag is an advanced feature of &kmousetool;, and takes some getting used to. It is very possible to use it to select text, to cut and paste, and use it in almost any situation where you would normally want to drag the mouse. But you probably won't be able to do this at first. Here are some suggestions:
de: Das intelligente Verschieben ist eine fortgeschrittene Funktion von &kmousetool; und es braucht seine Zeit, ehe Sie damit umgehen können. Es ist sehr wohl möglich auf diese Weise Text zu markieren, ihn in die Zwischenablage zu kopieren und wieder einzufügen oder jede sonstige Aktion auszuführen, bei der Sie die Maus bei gedrückter Maustaste bewegen wollen. Aber es wird ihnen wahrscheinlich erst einmal Probleme bereiten. Hier sind einige Ratschläge dazu:

source: Don't use Smart Drag while you are first learning to use &kmousetool;. Instead, to select text, click at one end of the text, and hold down the shift key while you click at the other end of the text.
de: Benutzen Sie das intelligente Verschieben nicht, wenn Sie gerade erst damit anfangen &kmousetool; zu verwenden. Markieren Sie Text stattdessen folgendermaßen: Führen Sie am einen Ende des Textbereichs einen Mausklick aus und halten Sie die Umschalt-Taste gedrückt, während Sie den Mauszeiger auf das andere Ende des Textes bewegen und dort erneut die Maustaste betätigen.

source: Use the Audible Click. This will play a <quote>click</quote> sound when &kmousetool; clicks down, and this will tell you when the Smart Drag delay is beginning. With practice, you can use Smart Drag without the Audible Click, but it does take a fair amount of practice.
de: Verwenden Sie den hörbaren Mausklick. Dadurch wird jedesmal, wenn &kmousetool; die Maustaste drückt ein Klang wie ein <quote>Mausklick</quote> abgespielt. So wissen Sie genau, wann beim intelligenten Verschieben die Verschiebezeit beginnt. Später können Sie das intelligente Verschieben auch ohne den hörbaren Mausklick benutzen. Aber dazu bedarf es einiger Übung.

source: Know where you're going to click the mouse before you begin moving it.
de: Sie sollten wissen, wo Sie einen Mausklick ausführen wollen, wenn Sie die Maus bewegen.

source: Credits and License
de: Danksagungen und Lizenz

source: Program copyright 2002 Jeff Roush <email>jeff@mousetool.com</email> and 2003 Gunnar Schmi Dt <email>gunnar@schmi-dt.de</email>
de: Copyright 2002 des Programms Jeff Roush <email>jeff@mousetool.com</email> und 2003 Gunnar Schmi Dt <email>gunnar@schmi-dt.de</email>

source: Contributors:
de: Mitwirkende:

source: Documentation copyright 2002 Jeff Roush <email>jeff@mousetool.com</email>
de: Copyright der Dokumentation 2002 Jeff Roush <email>jeff@mousetool.com</email>

source: CREDIT_FOR_TRANSLATORS
de: <para>Übersetzung Stephan Johach<email>hunsum@gmx.de</email></para>

source: How to obtain &kmousetool;
de: Wo bekomme ich &kmousetool;?

source: Requirements
de: Voraussetzungen

source: In order to successfully use &kappname;, you need the XTest extension compiled as part of your &X-Window;. This should already be installed on your system; very few systems won't have it.
de: Um &kmousetool; verwenden zu können, muss die XTest-Erweiterung für &X-Window; installiert sein. Das sollte auf den meisten System bereits der Fall sein.

source: In order to use the Audible Click feature, you will have to have a sound card and speakers, and you will have to have configured the sound card correctly.
de: Die Funktionalität des hörbaren Mausklicks ist nur verfügbar, wenn das System über eine Soundkarte und Lautsprecher verfügt und diese korrekt eingerichtet sind.

source: Compilation and Installation
de: Kompilierung und Installation
