Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdeaccessibility/kmouth_man-kmouth.1.po
Languages: de

source: &kde; User's Manual
de: &kde;-Benutzerhandbuch

source: A type-and-say front end for speech synthesizers
de: Ein Texteingabeprogramm für Sprachsynthesizer

source: <command>kmouth</command> <arg choice="opt"><replaceable>filename</replaceable></arg> <arg choice="opt">&kde; Generic Options</arg> <arg choice="opt">&Qt; Generic Options</arg>
de: <command>kmouth</command> <arg choice="opt">Allgemeine KDE-Befehlszeilenparameter</arg> <arg choice="opt">Allgemeine Qt-Befehlszeilenparameter</arg>

source: Description
de: Beschreibung

source: &kmouth; is an application that enables persons that cannot speak to let their computers speak.It includes a history of spoken sentences from which the user can select sentences to be re-spoken.
de: &kmouth; ist eine Anwendung, mit der Menschen, die nicht sprechen können, Text durch den Rechner ausgeben lassen können. Es wird eine Liste bereits gesprochener Sätze gespeichert, die der Anwender immer wieder neu ausgaben lassen kann.

source: Note that &kmouth; does not include speech synthesizer. Instead it requires a speech synthesizer installed in the system.
de: Beachten Sie, dass &kmouth; keinen Sprachsynthesizer beinhaltet. Auf dem Rechner muss ein Sprachsynthesizer installiert sein.

source: Options
de: Optionen

source: filename
de: dateiname

source: The history file to open.
de: Die zu öffnende Liste

source: See Also
de: Siehe auch

source: More detailed user documentation is available from <ulink url="help:/kmouth">help:/kmouth</ulink> (either enter this &URL; into &konqueror;, or run <userinput><command>khelpcenter</command> <parameter>help:/kmouth</parameter></userinput>).
de: Ausführlichere Benutzerdokumentation finden Sie mit <ulink url="help:/kmouth">help:/kmouth</ulink> (geben Sie entweder diese <acronym>URL</acronym> in die Adressleiste von &konqueror; ein oder starten Sie <userinput><command>khelpcenter</command> <parameter>help:/kmouth</parameter></userinput>).

source: There is also further information available at the <ulink url="http://accessibility.kde.org/">&kde; Accessibility project web site</ulink>.
de: Weitere Informationen finden Sie außerdem auf der <ulink url="http://accessibility.kde.org/">Homepage des Accessibility-Projekts von &kde;</ulink>.

source: Authors
de: Autoren

source: &kmouth; was written by <personname><firstname>Gunnar</firstname><surname>Schmi Dt</surname></personname> <email>kmouth@schmi-dt.de</email>.
de: &kmouth; wurde entwickelt von <personname><firstname>Gunnar</firstname><surname>Schmi Dt</surname></personname> <email>kmouth@schmi-dt.de</email>.
