Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdeaccessibility/kmousetool_man-kmousetool.1.po
Languages: de

source: &kde; User's Manual
de: &kde;-Benutzerhandbuch

source: Accessibility tool to help click the mouse
de: Zugangshilfe für die Betätigung der Maustasten

source: <command>kmousetool</command> <arg choice="opt">&kde; Generic Options</arg> <arg choice="opt">&Qt; Generic Options</arg>
de: <command>kmousetool</command> <arg choice="opt">Allgemeine &kde;-Befehlszeilenparameter</arg> <arg choice="opt">Allgemeine &Qt;-Befehlszeilenparameter</arg>

source: Description
de: Beschreibung

source: &kmousetool; clicks the mouse whenever the mouse cursor pauses briefly. It was designed to help those with repetitive strain injuries, for whom pressing buttons hurts.
de: &kmousetool; betätigt die Maustaste sobald der Mauszeiger kurz verharrt. Dieses Programm wurde für Menschen entwickelt, die am RSI-Syndrom leiden und denen das Betätigen der Maustasten Schmerzen bereitet.

source: &kmousetool; can also be configured to wait for a specified time for a drag to begin, before unclicking the mouse. This way, you can use it for drag and drop operations as well.
de: &kmousetool; kann außerdem so konfiguriert werden, dass es eine bestimmte Zeit darauf wartet, dass ein Ziehen-Vorgang beginnt, bevor die Maustaste losgelassen wird. Auf diese Weise kann auch das Ziehen und Ablegen mit der Maus durchgeführt werden.

source: See Also
de: Siehe auch

source: More detailed user documentation is available from <ulink url="help:/kmousetool">help:/kmousetool</ulink> (either enter this &URL; into &konqueror;, or run <userinput><command>khelpcenter</command> <parameter>help:/kmousetool</parameter></userinput>).
de: Ausführlichere Benutzerdokumentation finden Sie mit <ulink url="help:/kmousetool">help:/kmousetool</ulink> (geben Sie entweder diese &URL; in die Adressleiste von &konqueror; ein oder starten Sie <userinput><command>khelpcenter</command><parameter>help:/kmousetool</parameter></userinput>).

source: There is also further information available at <ulink url="http://accessibility.kde.org">the &kde; accessibility site.</ulink>
de: Weitere Informationen finden Sie außerdem auf der <ulink url="http://accessibility.kde.org/">Homepage des Accessibility-Projekts von &kde;</ulink>.

source: Authors
de: Autoren

source: &kmousetool; was written by <personname><firstname>Gunnar</firstname><surname>Schmi Dt</surname></personname> <email>gunnar@schmi-dt.de</email>, <personname><firstname>Olaf</firstname><surname>Schmidt</surname></personname> <email>ojschmidt@kde.org</email> and <personname><firstname>Jeff</firstname><surname>Roush</surname></personname> <email>jeff@mousetool.com</email>.
de: &kmousetool; wurde entwickelt von <personname><firstname>Gunnar</firstname><surname>Schmi Dt</surname></personname> <email>gunnar@schmi-dt.de</email>, <personname><firstname>Olaf</firstname><surname>Schmidt</surname></personname> <email>ojschmidt@kde.org</email> and <personname><firstname>Jeff</firstname><surname>Roush</surname></personname> <email>jeff@mousetool.com</email>.
