Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/extragear-*/desktop_workspace_plasma-nm.po
Languages: de

# Name
source: Network Management
de: Netzwerkverwaltung

# Comment
source: Network status and control
de: Netzwerkstatus und -steuerung

# Name
source: kde-nm-connection-editor
de: KDE-NM-Verbindungseditor

# GenericName
source: Connection editor
de: Verbindungs-Editor

# Comment
source: Edit your network connections
de: Bearbeiten Sie Ihre Netzwerkverbindungen

# Name
source: Plasma Networkmanagement module
de: Plasma-Netzwerkverwaltungsmodul

# Comment
source: Provides secrets to the NetworkManager daemon
de: Stellt dem NetworkManager-Dienst vertrauliche Daten zur Verfügung

# Name
source: networkmanagement
de: Netzwerkverwaltung

# Comment
source: Notifies about network errors
de: Benachrichtigungen über Netzwerkfehler

# Name
source: Connection activated
de: Verbindung aktiviert

# Name
source: Connection deactivated
de: Verbindung deaktiviert

# Name
source: Device failed
de: Das Gerät ist nicht bereit

# Name
source: Failed to activate connection
de: Die Verbindung kann nicht aktiviert werden

# Name
source: Failed to add connection
de: Die Verbindung kann nicht hinzugefügt werden

# Name
source: Failed to request scan
de: Anforderung zum Durchsuchen fehlgeschlagen

# Name
source: Missing VPN plugin
de: Fehlendes VPN-Modul

# Name
source: Network Management VPN UI Plugin
de: Netzwerkverwaltung VPN-Modul

# Comment
source: Defines KDE Network Management UI Plugins
de: Legt die Module der KDE-Netzwerkverwaltung fest

# Name
source: Notifications
de: Benachrichtigungen

# Comment
source: Configure the Network Management notifications
de: Einrichtung der Benachrichtigungen für die Netzwerkverwaltung

# Comment
source: L2TP plugin
de: L2TP-Modul

# Comment
source: OpenConnect Plugin
de: OpenConnect-Modul

# Comment
source: OpenSwan Plugin
de: OpenSwan-Modul

# Comment
source: OpenVPN plugin
de: OpenVPN-Modul

# Comment
source: PPTP Plugin
de: PPTP-Modul

# Comment
source: StrongSwan Plugin
de: StrongSwan-Modul

# Comment
source: VPNC Plugin
de: VPNC-Modul
