Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/extragear-*/desktop_workspace_bluedevil.po
Languages: de

# Name
source: BlueDevil Service Plugin
de: BlueDevil-Service-Modul

# Comment
source: Connect to the Audio service
de: Mit Audio-Dienst verbinden

# Name
source: BlueDevil Audio connect
de: BlueDevil-Audioverbindung

# GenericName
source: BlueDevil Audio connect
de: BlueDevil-Audioverbindung

# Comment
source: BlueDevil Audio connect
de: BlueDevil-Audioverbindung

# Comment
source: Connect to the Input service (Mouse/Keyboard/Others)
de: Mit Eingabe-Dienst verbinden (Maus, Tastatur, Sonstige)

# Name
source: Input
de: Eingabe

# GenericName
source: Input
de: Eingabe

# Name
source: BlueDevil Input connect
de: BlueDevil-Eingabeverbindung

# GenericName
source: BlueDevil Input connect
de: BlueDevil-Eingabeverbindung

# Comment
source: BlueDevil Input connect
de: BlueDevil-Eingabeverbindung

# Comment
source: Connect to Dial Up Network service (DUN)
de: Zu einem Einwahlnetzwerk (DUN) verbinden

# Name
source: BlueDevil Network connect
de: BlueDevil-Netzwerkverbindung

# Comment
source: BlueDevil Network connect
de: BlueDevil-Netzwerkverbindung

# GenericName
source: BlueDevil Network connect
de: BlueDevil-Netzwerkverbindung

# Comment
source: Connect to Personal Area Network service (PANU)
de: Zu einem Personal-Area-Netzwerk (PANU) verbinden

# Name
source: BlueDevil Send File
de: BlueDevil-Dateiversand

# GenericName
source: BlueDevil Send File
de: BlueDevil-Dateiversand

# Comment
source: BlueDevil Send File
de: BlueDevil-Dateiversand

# Comment
source: Allows you to send files to the remote device
de: Ermöglicht Ihnen, Dateien zu entfernten Geräten zu senden

# Name
source: Send File
de: Datei senden

# GenericName
source: Send file
de: Datei senden

# Name
source: Authorization Requested
de: Autorisierung gefordert

# Comment
source: A device wants to connect
de: Ein Gerät möchte sich verbinden

# Name
source: Confirm Mode Change
de: Moduswechsel bestätigen

# Comment
source: Bluetooth mode is about to be changed (normal to flight for example)
de: Der Bluetooth-Modus ist im Begriff, sich zu ändern (z. B. von normal auf Flugzeugmodus)

# Name
source: Confirm PIN
de: PIN bestätigen

# Comment
source: Confirm a device request using matching PINs
de: Eine Geräteanforderung mit passenden PINs bestätigen

# Name
source: Request PIN
de: PIN anfordern

# Comment
source: A PIN is needed
de: Eine PIN wird benötigt

# Name
source: Incoming File
de: Eingehende Datei

# Comment
source: Incoming file transfer
de: Eingehende Dateiübertragung

# Comment
source: Handles Bluetooth events
de: Verarbeitung von Bluetooth-Ereignissen

# Name
source: Bluetooth File Transfer
de: Bluetooth-Dateiübertragung

# Comment
source: Supports Bluetooth file transfer using ObexFTP
de: Unterstützt Bluetooth-Datenübertragung mittels ObexFTP

# Name
source: Send file via Bluetooth
de: Datei über Bluetooth versenden

# Name
source: Adapters
de: Adapter

# Comment
source: Configure Bluetooth adapters
de: Bluetooth-Adapter einrichten

# X-KDE-Keywords
source: Network,Connectivity,Bluetooth
de: Netzwerk,Verbindungen,Bluetooth

# Name
source: Devices
de: Geräte

# Comment
source: Manage Bluetooth devices
de: Bluetooth-Geräte verwalten

# Name
source: File Transfers
de: Dateiübertragungen

# Comment
source: Configure Bluetooth file sharing and transfers
de: Dateifreigaben und Dateiübertragung für Bluetooth einrichten

# Comment
source: KDE Bluetooth support
de: KDE-Bluetooth-Unterstützung

# Name
source: BlueDevil Wizard
de: BlueDevil-Assistent

# GenericName
source: BlueDevil Wizard
de: BlueDevil-Assistent

# Comment
source: BlueDevil Wizard
de: BlueDevil-Assistent
