Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/extragear-*/desktop_extragear-*_networkmanagement.po
Languages: de

# Name
source: Network Management
de: Netzwerkverwaltung

# Comment
source: Network status and control utility
de: Dienstprogramm für Netzwerkstatus und -kontrolle

# Name
source: Network Manager
de: Netzwerkverwaltung

# Comment
source: Network Manager data engine
de: Datenmodul der Netzwerkverwaltung

# Name
source: NetworkManager User Settings Service
de: Benutzereinstellungsdienst für NetworkManager

# Comment
source: Provides network configuration to the NetworkManager daemon
de: Stellt dem NetworkManager-Dienst eine Netzwerkeinrichtung zur Verfügung

# Name
source: Network Management VPN UI Plugin
de: Netzwerkverwaltung VPN-Modul

# Comment
source: Defines KDE Network Management UI Plugins
de: Legt die Module der KDE-Netzwerkverwaltung fest

# GenericName
source: Network Manager
de: Netzwerkverwaltung

# Comment
source: A KDE frontend for NetworkManager
de: Eine KDE-Oberfläche für NetworkManager

# Comment
source: Network Management
de: Netzwerkverwaltung

# Name
source: Network Connection Type
de: Art der Netzwerkverbindung

# Name
source: Network Interface Attached
de: Netzwerkschnittstelle angeschlossen

# Comment
source: A network interface was attached
de: Eine Netzwerkschnittstelle ist angeschlossen worden

# Name
source: Network Interface Removed
de: Netzwerkschnittstelle entfernt

# Comment
source: A network interface was removed
de: Eine Netzwerkschnittstelle ist entfernt worden

# Name
source: Found Wireless Network
de: Drahtloses Netzwerk gefunden

# Comment
source: A wireless network appeared
de: Ein drahtloses Netzwerk ist entdeckt worden

# Name
source: Lost Wireless Network
de: Drahtloses Netzwerk verloren

# Comment
source: A wireless network disappeared
de: Ein drahtloses Netzwerk ist nicht mehr vorhanden

# Name
source: Establishing Network Connection
de: Netzwerkverbindung wird hergestellt

# Comment
source: A network connection attempt was begun
de: Ein Verbindungsversuch ist begonnen worden

# Name
source: Network Connection Disconnected
de: Netzwerkverbindung getrennt

# Comment
source: A network connection was disconnected
de: Eine Netzwerkverbindung ist getrennt worden

# Name
source: Network Connection Succeeded
de: Netzwerkverbindung erfolgreich hergestellt

# Comment
source: A network connection was established
de: Eine Netzwerkverbindung ist erfolgreich hergestellt worden

# Name
source: Network Connection Failed
de: Netzwerkverbindung fehlgeschlagen

# Comment
source: A network connection attempt failed
de: Ein Verbindungsversuch ist fehlgeschlagen

# Name
source: Radio Hardware Switched Off
de: Hardware für drahtlose Verbindungen ausgeschaltet

# Comment
source: Wireless transceivers disabled by hardware switch
de: Die Hardware für drahtlose Verbindungen ist am Gerät ausgeschaltet worden

# Name
source: Radio Hardware Switched On
de: Hardware für drahtlose Verbindungen eingeschaltet

# Comment
source: Wireless transceivers enabled
de: Hardware für drahtlose Verbindungen aktiviert

# Name
source: Low Wireless Signal Strength
de: Niedrige Signalstärke

# Comment
source: The wireless signal strength is low
de: Die Signalstärke der drahtlosen Verbindung ist niedrig

# Name
source: Interface changed state
de: Schnittstellenstatus geändert

# Comment
source: An interface changed state
de: Der Status einer Schnittstelle hat sich geändert

# Name
source: Network management disabled
de: Netzwerkverwaltung deaktiviert

# Comment
source: The network management subsystem was stopped or restarted
de: Die Netzwerkverwaltung ist angehalten oder neu gestartet worden

# Comment
source: Connect to the Internet
de: Mit dem Internet verbinden

# Name
source: Network Connections
de: Netzwerkverbindungen

# Comment
source: Add, Edit and Remove network connections
de: Netzwerkverbindungen hinzufügen, bearbeiten und entfernen

# Name
source: Other
de: Weitere

# Comment
source: Configure the Network Management tool
de: Die Netzwerkverwaltung einrichten

# Name
source: Fake Net
de: Netzwerk (Dummy)

# Comment
source: Fake Network Management
de: Netzwerkverwaltung (Dummy)

# Comment
source: Modem Management Backend
de: Backend zur Netzwerkverwaltung

# Comment
source: Network Management Backend
de: Backend zur Netzwerkverwaltung

# Comment
source: Network management using the ModemManager daemon, version 0.5
de: Netzwerkverwaltung mit dem NetworkManager-Dienst Version 0.5

# Comment
source: Network management using the NetworkManager daemon, version 0.9
de: Netzwerkverwaltung mit dem NetworkManager Version 0.9

# Comment
source: Allows KNetworkManager to connect to Novell VPN (turnpike) VPNs.
de: Ermöglicht KNetworkManager Verbindungen zu Novell VPNs (Turnpike) herzustellen.

# Comment
source: OpenConnect Plugin
de: OpenConnect-Modul

# Comment
source: OpenSwan Plugin
de: Openswan-Modul

# Comment
source: OpenVPN plugin
de: OpenVPN-Modul

# Comment
source: PPTP Plugin
de: PPTP-Modul

# Comment
source: StrongSwan Plugin
de: StrongSwan-Modul

# Comment
source: VPNC Plugin
de: VPNC-Modul
