Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/extragear-*/desktop_workspace_milou.po
Languages: de

# Comment
source: Milou Preview Plugin
de: Milou-Vorschaumodul

# Name
source: Milou Application Preview Plugin
de: Milou-Vorschaumodul für Anwendungen

# Name
source: Milou Audio Preview Plugin
de: Milou-Vorschaumodul für Audio

# Comment
source: Preview generated for audio files
de: Vorschau für Audiodateien generieren

# Name
source: Milou Bookmark Preview Plugin
de: Milou-Vorschaumodul für Lesezeichen

# Comment
source: Preview generated for bookmarks
de: Vorschau für Lesezeichen generieren

# Name
source: Milou Email Preview Plugin
de: Milou-Vorschaumodul für E-Mails

# Comment
source: Preview generated for emails
de: Vorschau für E-Mails generieren

# Name
source: Milou File Preview Plugin
de: Milou-Vorschaumodul für Dateien

# Name
source: Milou Image Preview Plugin
de: Milou-Vorschaumodul für Bilder

# Comment
source: Preview generated for image files
de: Vorschau für Bilddateien generieren

# Name
source: Milou Okular Preview Plugin
de: Milou-Vorschaumodul für Okular

# Comment
source: Preview generated for documents via Okular
de: Vorschau für Dokumente mit Okular generieren

# Name
source: Milou Text Preview Plugin
de: Milou-Vorschaumodul für Text

# Comment
source: Preview generated for text files
de: Vorschau für Textdateien generieren

# Name
source: Milou Video Preview Plugin
de: Milou-Vorschaumodul für Videos

# Comment
source: Preview generated for videos
de: Vorschau für Videos generieren

# Comment
source: Applet for finding anything
de: Miniprogramm zur Suche
