Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/extragear-*/kde-gtk-config.po
Languages: de

# NAME OF TRANSLATORS
source: Your names
de: Frederik Schwarzer

# EMAIL OF TRANSLATORS
source: Your emails
de: schwarzer@kde.org

source: Could not install the %1 theme.
de: Das Design %1 kann nicht installiert werden.

source: Cannot install theme
de: Das Design lässt sich nicht installieren.

source: Parsing theme...
de: Design wird eingelesen ...

source: This GTK theme can be installed
de: Dieses GTK-Design kann installiert werden

source: This GTK theme cannot be installed
de: Dieses GTK-Design kann nicht installiert werden

source: This icons theme can be installed
de: Dieses Symbol-Design kann installiert werden

source: This icons theme cannot be installed
de: Dieses Symbol-Design kann nicht installiert werden

source: Installing GTK theme...
de: GTK-Design wird installiert ...

source: Installing icons...
de: Symbole werden installiert ...

source: Icons Successfully Installed
de: Symbole erfolgreich installiert

source: The icons theme cannot be installed
de: Das Symbol-Design kann nicht installiert werden

source: GTK Theme Successfully Installed
de: GTK-Design erfolgreich installiert

source: The GTK theme cannot be installed
de: Das GTK-Design kann nicht installiert werden

source: Uninstalling GTK theme...
de: GTK-Design wird deinstalliert ...

source: Uninstalling icons...
de: Symbole werden deinstalliert ...

source: GTK theme successfully uninstalled.
de: Das GTK-Design wurde erfolgreich deinstalliert.

source: Could not uninstall the GTK theme.
de: Das GTK-Design kann nicht deinstalliert werden.

source: Icons successfully uninstalled.
de: Die Symbole wurden erfolgreich deinstalliert.

source: Could not uninstall the icons theme.
de: Das Symbol-Design kann nicht deinstalliert werden.

source: KDE GTK Config
de: KDE-Einrichtung von GTK

source: Configure your GTK Applications
de: Einrichtung Ihrer GTK-Anwendungen

source: Main Developer
de: Hauptentwickler

source: Feature development. Previews, code refactoring.
de: Entwicklung von Funktionen, Vorprüfung, Neustrukturierung des Codes

source: Ideas, tester, internationalization
de: Ideen, Tester, Internationalisierung

source: Internationalization
de: Internationalisierung

source: Download GTK2 themes...
de: GTK2-Designs herunterladen ...

source: Download GTK3 themes...
de: GTK3-Designs herunterladen ...

source: Install a local theme...
de: Ein lokales Design installieren ...

source: Uninstall a local theme...
de: Ein lokales Design deinstallieren ...

source: It was not possible to save the config
de: Die Einstellungen können nicht gespeichert werden

source: Installer
de: Installationsprogramm

source: Add GTK Theme
de: GTK-Design hinzufügen

source: <b>Step 2</b>
de: <b>Schritt 2</b>

source: Select the theme file you want to install:
de: Wählen Sie die zu installierende Design-Datei aus:

source: Click the next button in order to install the theme in your system.
de: Drücken Sie den Knopf „Weiter“, um des Design auf Ihrem System zu installieren

source: <b>Step 1</b>
de: <b>Schritt 1</b>

source: Install GTK Theme
de: GTK-Design installieren

source: *.tar.gz *.tar|Compressed file
de: *.tar.gz *.tar|Komprimierte Datei

source: Add New Icons Theme
de: Neues Symbol-Design hinzufügen

source: Install Icons
de: Symbole installieren

source: Remove Themes
de: Designs entfernen

source: Select a GTK theme to uninstall
de: Wählen Sie ein GTK-Design zum Deinstallieren aus

source: Uninstall
de: Deinstallieren

source: Remove GTK Theme
de: GTK-Design entfernen

source: Select an icon theme to uninstall
de: Wählen Sie ein Symbol-Design zum Deinstallieren aus

source: Remove Icon Theme
de: Symbol-Design entfernen

source: GTK Themes
de: GTK-Designs

source: Select a GTK2 Theme:
de: Wählen Sie ein GTK2-Design aus:

source: Preview theme
de: Design-Vorschau

source: Select a GTK3 Theme:
de: Wählen Sie ein GTK3-Design aus:

source: Font:
de: Schriftart:

source: Behaviour
de: Verhalten

source: GTK style toolbar:
de: Werkzeugleiste im GTK-Stil

source: Icons Only
de: Nur Symbole

source: Text Only
de: Nur Text

source: Text Under Icons
de: Text unter Symbolen

source: Text After Icons
de: Text nach Symbolen

source: Show icons in GTK buttons:
de: Symbole auf GTK-Knöpfen anzeigen:

source: Show icons in GTK menus:
de: Symbole in GTK-Menüs anzeigen:

source: Icon Themes
de: Symbol-Designs

source: Icon theme:
de: Symbol-Design:

source: Fallback theme:
de: Ausweich-Design:

source: <html><head/><body><p>Here you can find more GTK themes to try. You can either download them from the following websites.</p><p>Also you can download it from the opendesktop facilities as suggested below</p><p align="center"><a href="http://gnome-look.org"><span style=" text-decoration: underline; color:#0000ff;">gnome-look.org</span></a><br/><a href="art.gnome.org"><span style=" text-decoration: underline; color:#0000ff;">art.gnome.org</span></a></p></body></html>
de: <html><head/><body><p>Hier finden Sie weitere GTK-Designs zu Ausprobieren. Sie können Designs von einer der folgenden Webseiten herunterladen.</p><p>Auch auf openDesktop.org gibt es noch mehr Designs.</p><p align="center"><a href="http://gnome-look.org"><span style=" text-decoration: underline; color:#0000ff;">gnome-look.org</span></a><br/><a href="art.gnome.org"><span style=" text-decoration: underline; color:#0000ff;">art.gnome.org</span></a></p></body></html>

source: Get New Themes
de: Neue Designs herunterladen
