Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/kdelibs/desktop_kdelibs_nepomuk-core.po
Languages: de

# Comment
source: Tool to migrate the old Nepomuk based data to Baloo.
de: Dienstprogramm zum Migrieren alter Nepomuk-basierter Daten zu Baloo.

# Name
source: Nepomuk Cleaner
de: Nepomuk-Bereinigung

# Comment
source: Nepomuk Cleaning Job
de: Bereinigung der Nepomuk-Daten

# Comment
source: Nepomuk Service Version 2
de: Nepomuk-Dienst Version 2

# Comment
source: Nepomuk Service
de: Nepomuk-Dienst

# Comment
source: The Nepomuk Server providing Storage services and strigi controlling
de: Der Nepomuk-Server stellt Speicherdienste und Strigi-Steuerung zur Verfügung

# Name
source: Nepomuk Mobi Extractor
de: Mobi-Extraktion für Nepomuk

# Comment
source: Nepomuk File extractor for MobiPocket Files
de: Datei-Extraktion aus MobiPocket-Dateien für Nepomuk

# Name
source: Nepomuk EPub Extractor
de: EPub-Extraktion für Nepomuk

# Comment
source: Nepomuk File extractor for EPub Files
de: Datei-Extraktion aus EPub-Dateien für Nepomuk

# Name
source: Nepomuk Exiv2 Extractor
de: Exiv2-Extraktion für Nepomuk

# Comment
source: Nepomuk File extractor for Image files
de: Datei-Extraktion aus Bilddateien für Nepomuk

# Comment
source: Nepomuk File Extractor
de: Datei-Extraktion für Nepomuk

# Name
source: Nepomuk FFmpeg Extractor
de: FFmpeg-Extraktion für Nepomuk

# Comment
source: Nepomuk File extractor for Video files
de: Datei-Extraktion aus Videodateien für Nepomuk

# Name
source: Nepomuk Odf Extractor
de: ODF-Extraktion für Nepomuk

# Comment
source: Nepomuk File extractor for ODF files
de: Datei-Extraktion aus ODF-Dateien für Nepomuk

# Name
source: Nepomuk Office2007 Extractor
de: Office2007-Extraktion für Nepomuk

# Comment
source: Nepomuk File extractor for Office2007 files
de: Datei-Extraktion aus Office2007-Dateien für Nepomuk

# Name
source: Nepomuk Office Extractor
de: Office-Extraktion für Nepomuk

# Comment
source: Nepomuk File extractor for DOC, XLS and PPT files
de: Datei-Extraktion aus DOC, XLS und PPT-Dateien für Nepomuk

# Name
source: Nepomuk Plain Text Extractor
de: Text-Extraktion für Nepomuk

# Comment
source: Nepomuk File extractor for text files
de: Datei-Extraktion aus Textdateien für Nepomuk

# Name
source: Nepomuk Poppler Extractor
de: Poppler-Extraktion für Nepomuk

# Comment
source: Nepomuk File extractor for PDF files
de: Datei-Extraktion aus PDF-Dateien für Nepomuk

# Name
source: Nepomuk TagLib Extractor
de: TagLib-Extraktion für Nepomuk

# Comment
source: Nepomuk File extractor for Music Files
de: Datei-Extraktion aus Musikdateien für Nepomuk

# Name
source: File Indexer Service
de: Datei-Indizierungsdienst

# Comment
source: Nepomuk Service which indexes files on the desktop
de: Nepomuk-Dienst, der Dateien des Rechners indiziert

# Comment
source: Desktop Search
de: Desktop-Suche

# Name
source: Indexing suspended
de: Erstindizierung angehalten

# Comment
source: File indexing has been suspended by the search service.
de: Dateiindizierung wurde vom Suchdienst angehalten.

# Name
source: Indexing resumed
de: Erstindizierung fortgesetzt

# Comment
source: File indexing has been resumed by the search service.
de: Dateiindizierung wurde vom Suchdienst wieder aufgenommen.

# Name
source: NepomukFileWatch
de: NepomukDateiMonitor

# Comment
source: The Nepomuk file watch service for monitoring file changes
de: Nepomuk-Dateiüberwachung zur Überwachung von Dateiänderungen

# Comment
source: Nepomuk file watch service
de: Nepomuk-Dienst zur Dateiüberwachung

# Name
source: New Removable Device
de: Neuer Wechseldatenträger

# Comment
source: A new unknown removable device has been mounted
de: Ein neuer, unbekannter Wechseldatenträger ist eingebunden worden

# Name
source: Folder Watch Limit
de: Begrenzung für Ordnerüberwachung

# Description
source: To avoid missing file changes, raise the folder watch limit
de: Damit Sie keine Dateiänderungen verpassen, setzen Sie die Begrenzung für Ordnerüberwachung nach oben

# Name
source: Nepomuk Backup
de: Nepomuk-Sicherung

# Name
source: Nepomuk Data Storage
de: Nepomuk-Datendienst

# Comment
source: The Core Nepomuk data storage service
de: Der Nepomuk-Basisdienst zum Speichern der Daten

# Name
source: Semantic Data Storage
de: Semantische Datenspeicherung

# Comment
source: Semantic Desktop
de: Semantischer Desktop

# Name
source: Failed to start Nepomuk
de: Fehler beim Starten von Nepomuk

# Comment
source: The Nepomuk Semantic Desktop system could not be started
de: Die Nepomuk-Semantik-Dienste lassen sich nicht starten

# Name
source: Converting Nepomuk data
de: Nepomuk-Daten werden umgewandelt

# Comment
source: All Nepomuk data is converted to a new storage backend
de: Alle Nepomuk-Daten sind in das neue Speicherformat umgewandelt worden

# Name
source: Converting Nepomuk data failed
de: Die Nepomuk-Daten-Umwandlung ist fehlgeschlagen

# Comment
source: Converting Nepomuk data to a new backend failed
de: Die Nepomuk-Daten-Umwandlung für das neue Backend ist fehlgeschlagen

# Name
source: Converting Nepomuk data done
de: Umwandlung der Nepomuk-Daten ist abgeschlossen

# Comment
source: Successfully converted Nepomuk data to new backend
de: Die Nepomuk-Daten-Umwandlung für das neue Backend ist abgeschlossen
