Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/kdelibs/desktop_workspace_kfilemetadata.po
Languages: de

# Name
source: KFileMetaData EPub Extractor
de: EPub-Extraktion für KFileMetaData

# Name
source: KFileMetaData Exiv2 Extractor
de: Exiv2-Extraktion für KFileMetaData

# Name
source: KFileMetaData FFmpeg Extractor
de: FFmpeg-Extraktion für KFileMetaData

# Name
source: KFileMetaData Mobi Extractor
de: Mobi-Extraktion für KFileMetaData

# Name
source: KFileMetaData Odf Extractor
de: ODF-Extraktion für KFileMetaData

# Name
source: KFileMetaData Office2007 Extractor
de: Office 2007-Extraktion für KFileMetaData

# Name
source: KFileMetaData Office Extractor
de: Office-Extraktion für KFileMetaData

# Name
source: KFileMetaData Plain Text Extractor
de: Extraktion von einfachen Text für KFileMetaData

# Name
source: KFileMetaData Poppler Extractor
de: Poppler-Extraktion für KFileMetaData

# Name
source: KFileMetaData TagLib Extractor
de: TagLib-Extraktion für KFileMetaData

# Comment
source: KFileMetaData Extractor
de: KFileMetaData-Extraktion
