Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/kdelibs/desktop_kdelibs_kactivities.po
Languages: de

# Comment
source: Activity manager plugin
de: Modul für Aktivitätenverwaltung

# Name
source: Activity Manager
de: Aktivitätenverwaltung

# Comment
source: The activity management backend
de: Backend der Aktivitätenverwaltung

# Name
source: Activity ranking
de: Aktivitätenbewertung

# Comment
source: Plugin to rank activities based on usage
de: Modul, das Aktivitäten anhand der Benutzung bewertet

# Name
source: Global Shortcuts
de: Globale Kurzbefehle

# Comment
source: Adds global keyboard shortcuts for activity switching
de: Fügt globale Tastatur-Kurzbefehle für das Wechseln von Aktivitäten hinzu

# Comment
source: Plugin to synchronize data with Nepomuk
de: Modul zum Abgleichen von Daten in Nepomuk

# Comment
source: Provides data to Share-Like-Connect applet
de: Liefert Daten für das Miniprogramm Share-Like-Connect

# Name
source: Sqlite Feeder
de: Sqlite-Modul

# Comment
source: Plugin to store and score events in Sqlite
de: Modul zum Speichern und Bewerten von Ereignissen in SQLite

# Name
source: Virtual desktop switcher
de: Virtueller Arbeitsflächenumschalter

# Comment
source: When switching to an activity, opens the virtual desktop last used with that activity
de: Beim Wechseln zu einer Aktivität wird die virtuelle Arbeitsfläche geöffnet, auf der zuletzt diese Aktivität benutzt wurde

# Name
source: File to activity linking plugin
de: Modul für die Verknüpfung von Dateien zu Aktivitäten

# Name
source: Activities
de: Aktivitäten

# Comment
source: Configure the activities system
de: Einrichtung des Aktivitätensystems
