Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/kdelibs/kcm_baloofile.po
Languages: de

# NAME OF TRANSLATORS
source: Your names
de: Burkhard Lück

# EMAIL OF TRANSLATORS
source: Your emails
de: lueck@hube-lueck.de

source: Desktop Search helps you quickly locate all your files based on their content
de: Die Desktop-Suche hilft Ihnen, alle Ihre Dateien auf der Grundlage des Inhalts zu lokalisieren

source: Do not search in these locations
de: Nicht in diesen Orten suchen

source: Enable Desktop Search
de: Desktop-Suche aktivieren

source: Select the folder which should be excluded
de: Wählen den Ordner, der von der Indizierung ausgeschlossen werden soll

source: The root directory is always hidden
de: Der Basisordner ist immer ausgeblendet

source: Folder %1 is already excluded
de: Der Ordner %1 ist bereits ausgeschlossen

source: Folder's parent %1 is already excluded
de: Der übergeordnete Ordner %1 ist bereits ausgeschlossen

source: Configure Desktop Search
de: Desktop-Suche einrichten
