Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/kdelibs/nepomukstorage.po
Languages: de

# NAME OF TRANSLATORS
source: Your names
de: Thomas Reitelbach, Frederik Schwarzer

# EMAIL OF TRANSLATORS
source: Your emails
de: tr@erdfunkstelle.de, schwarzer@kde.org

source: Parsing of file %1 failed (%2)
de: Das Einlesen der Datei %1 ist fehlgeschlagen (%2)

source: Invalid desktop query: '%1'
de: Ungültige Desktop-Abfrage: „%1“

source: Invalid SPARQL query: '%1'
de: Ungültige SPARQL-Abfrage: „%1“

# @info - notification message
source: Nepomuk Semantic Desktop needs the Virtuoso RDF server to store its data. Installing the Virtuoso Soprano plugin is mandatory for using Nepomuk.
de: Die Nepomuk-Semantik-Dienste benötigen den Virtuoso-RDF-Server zum Speichern der Daten. Zur Verwendung von Nepomuk müssen Sie das Virtuoso-Soprano-Modul installieren.

# @info - notification message
source: Nepomuk Semantic Desktop needs the Virtuoso RDF server to store its data. Installing the Virtuoso server and ODBC driver is mandatory for using Nepomuk.
de: Die Nepomuk-Semantik-Dienste benötigen den Virtuoso-RDF-Server zum Speichern der Daten. Zur Verwendung von Nepomuk müssen Sie den Virtuoso-Server und ODBC-Treiber installieren.

source: Nepomuk Storage
de: Nepomuk-Datenspeicherung

source: Developer
de: Entwickler

source: Maintainer
de: Betreuer
