Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/kdelibs/xml_mimetypes.po
Languages: de

source: SNF bitmap font
de: SNF-Bitmap-Schriftart

source: Java applet
de: Java-Miniprogramm

source: KHTML Extension Adaptor
de: Adapter für KHTML-Erweiterungen

source: KDE color scheme
de: KDE-Farbschema

source: KNewStuff package
de: KNewStuff-Paket

source: KWallet wallet
de: KWallet-Passwortspeicher

source: Kugar report template
de: Kugar-Berichtsvorlage

source: mime encapsulated web archive
de: MIME-ummanteltes Web-Archiv

source: SuperKaramba theme
de: SuperKaramba-Design

source: Calligra Plan project management document
de: Calligra-Plan-Projektverwaltungdokument

source: Calligra Plan work package document
de: Calligra-Plan-Arbeitspaketdokument

source: KPlato project management document
de: KPlato-Projektverwaltungs-Dokument

source: KPlato project management work package
de: KPlato-Projektverwaltungs-Arbeitspaket

source: Kugar archive
de: Kugar-Archiv

source: web archive
de: Web-Archiv

source: AAC sound
de: AAC-Audio

source: RealAudio plugin file
de: RealAudio-Moduldatei

source: HDR image
de: HDR-Bild

source: KDE raw image formats
de: KDE-Roh-Bildformate

source: Intel® hexadecimal object file
de: Intel®-Hexadezimal-Objektdatei

source: Kate file list loader plugin list
de: Kate-Dateilistenlade-Modulliste

source: abc musical notation file
de: abc-Musik-Notationsdatei

source: all files and folders
de: Alle Dateien und Ordner

source: all files
de: Alle Dateien

source: fonts package
de: Schriftartenpaket

source: Windows workgroup
de: Windows-Arbeitsgruppe

source: KDE system monitor
de: KDE-Systemüberwachung

source: KDE theme
de: KDE-Design

source: Quanta project
de: Quanta-Projekt

source: Kommander file
de: Kommander-Datei

source: Kolf saved game
de: Kolf – gespeichertes Spiel

source: Kolf course
de: Kolf-Parcour

source: Okular document archive
de: Okular-Dokumentarchiv

source: Cabri figure
de: Cabri-Zeichnung

source: Dr. Geo figure
de: Dr.-Geo-Zeichnung

source: KGeo figure
de: KGeo-Zeichnung

source: Kig figure
de: Kig-Zeichnung

source: KSeg document
de: KSeg-Dokument

source: vocabulary trainer document
de: Vokabeltrainer-Dokument

source: KmPlot file
de: KmPlot-Datei

source: KWordQuiz vocabulary
de: KWordQuiz-Vokabular

source: Cachegrind/Callgrind profile dump
de: Cachegrind/Callgrind-Profil-Ausgabe

source: Umbrello UML Modeller file
de: Umbrello-UML-Datei

source: Windows link
de: Windows-Verknüpfung

source: KGet download list
de: KGet-Downloadliste

source: Kopete emoticons archive
de: Kopete-Emoticons-Archiv

source: ICQ contact
de: ICQ-Kontakt

source: shortcut to Kexi project on database server
de: Verknüpfung zu einem Kexi-Projekt auf einem Datenbank-Server

source: Kexi database file-based project
de: Kexi-Datenbank Dateibasiertes Projekt

source: data for database server connection
de: Daten für Datenbank-Server-Verbindung

source: TriG RDF document
de: TriG-RDF-Dokument

source: Turtle RDF document
de: Turtle-RDF-Dokument

source: Softimage PIC image
de: Softimage-PIC-Bild

source: Qt Markup Language file
de: Qt-Markup-Language-Datei
