Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/extragear-multimedia/desktop_extragear-multimedia_k3b.po
Languages: de

# Name
source: Update device and programs permissions
de: Berechtigungen von Geräten und Programmen aktualisieren

# Description
source: Authentication is required to update permissions of devices and programs
de: Sie müssen sich authentifizieren, um die Berechtigungen von Geräten und Programmen zu aktualisieren.

# Comment
source: K3bSetup – modify permission for CD/DVD burning with K3b
de: K3b-Einrichtungsassistent – Zugriffsrechte zum Brennen mit K3b anpassen

# Keywords
source: K3bSetup;k3bsetup;
de: K3b;Einrichtungsassistent;Rechte;Setup;

# Name
source: K3bSetup
de: K3b-Einrichtungsassistent

# X-KDE-Keywords
source: k3b,k3bsetup,cd,dvd
de: K3b,Einrichtung,CD,DVD

# GenericName
source: CD/DVD/BD Burning Setup
de: CD/DVD/BD-Brennen einrichten

# Description
source: A kioslave that allows files to be copied from a Video DVD (including decryption)
de: Ein-/Ausgabemodul, mit dem man Dateien von einer Video-DVD kopieren kann (inkl. Entschlüsselung)

# Name
source: K3b Plugin
de: K3b-Modul

# Name
source: K3b FFMpeg Decoder
de: FFMpeg-Dekodierer

# Comment
source: Decoding module to decode wma files
de: Dekodierungsmodul für WMA-Dateien

# Name
source: K3b FLAC Decoder
de: FLAC-Dekodierer

# Comment
source: Decoding module to decode FLAC files
de: Dekodierungsmodul für FLAC-Dateien

# Name
source: K3b Libsndfile Decoder
de: Libsndfile-Dekodierer

# Comment
source: Decoding module to decode audio files supported by libsndfile
de: Dekodierungsmodul für Dateien, die von libsndfile unterstützt werden

# Name
source: K3b MAD Decoder
de: MAD-Dekodierer

# Comment
source: Decoding module to decode MPEG 1 Layer III files
de: Dekodierungsmodul für MPEG 1 Layer III-Dateien

# Name
source: K3b Musepack Decoder
de: Musepack-Dekodierer

# Comment
source: Decoding module to decode Musepack audio files
de: Dekodierungsmodul für Musepack-Audio-Dateien

# Name
source: K3b Ogg Vorbis Decoder
de: Ogg-Vorbis-Dekodierer

# Comment
source: Decoding module to decode Ogg Vorbis files
de: Dekodierungsmodul für Ogg-Vorbis-Dateien

# Name
source: K3b ??? Decoder
de: ???-Dekodierer

# Comment
source: Decoding module to decode ??? files
de: Dekodierungsmodul für ???-Dateien

# Name
source: K3b Wave Decoder
de: Wave-Dekodierer

# Comment
source: Decoding module to decode wave files
de: Dekodierungsmodul für Wave-Dateien

# Name
source: K3b External Audio Encoder
de: Externer Audio-Kodierer

# Comment
source: Encoding module that allows specifying an encoding command
de: Kodierungsmodul zur Unterstützung externer Kodierprogramme

# Name
source: K3b External Audio Encoder Config Widget
de: Bedienelement zur externen Audio-Kodierung

# Name
source: K3b Lame Mp3 Encoder
de: Lame-MP3-Kodierer

# Comment
source: Encoding module to encode MPEG1 Layer III (mp3) files
de: Kodierungsmodul zur Kodierung von MPEG1 Layer III-Dateien (MP3)

# Name
source: K3b Lame Mp3 Encoder Config Module
de: Bedienelement zur Kodierung von MP3 mittels Lame

# Name
source: K3b Ogg Vorbis Encoder
de: Ogg-Vorbis-Kodierer

# Comment
source: Encoding module to encode Ogg Vorbis files
de: Kodierungsmodul zur Kodierung von Ogg Vorbis-Dateien

# Name
source: K3b Ogg Vorbis Encoder Config Widget
de: Bedienelement zur Kodierung von Ogg Vorbis

# Name
source: K3b ??? Encoder
de: ???-Kodierer

# Comment
source: Encoding module to encode <name> files
de: Kodierungsmodul zur Kodierung von <Name>-Dateien

# Name
source: K3b SoX Audio Encoder
de: SoX-Audio-Kodierer

# Comment
source: Encoding module to encode many file formats using SoX
de: Kodierungsmodul zur Kodierung von vielen Audioformaten mittels SoX

# Name
source: K3b SoX Audio Encoder Config Module
de: Bedienelement zur Kodierung mittels SoX

# Name
source: K3b Audio Metainfo Renamer
de: Audio-Metadaten-Umbenennungs-Modul

# Comment
source: Plugin to rename audio files in a data project based on the meta info.
de: Modul zum Umbenennen von Audio-Dateien in einem Daten-Projekt, basierend auf den Metadaten.

# Name
source: K3b Cddb Audio Plugin
de: CDDB-Audio-Modul

# Comment
source: Plugin to query a cddb server for information about an audio project.
de: Modul zur Abfrage eines CDDB-Servers nach Informationen zu einem Audio-Projekt

# GenericName
source: Disk Burning
de: Brennprogramm

# Comment
source: Disk writing program
de: Brennprogramm für CDs, DVDs und Blu-Ray

# Name
source: Process successful
de: Vorgang erfolgreich

# Comment
source: Process successfully finished
de: Vorgang erfolgreich abgeschlossen

# Name
source: Process error
de: Vorgang nicht erfolgreich

# Comment
source: Process finished with errors
de: Vorgang wurde mit Fehlern beendet

# Name
source: Waiting for medium
de: Warten auf Medium

# Comment
source: The user needs to insert a medium
de: Der Benutzer muss ein Medium einlegen

# Name
source: Extract Digital Audio with K3b
de: Digital-Audio mit K3b auslesen

# Name
source: Copy with K3b
de: Mit K3b kopieren

# Name
source: Create Audio CD with K3b
de: Audio-CD mit K3b erstellen

# Name
source: Create file project with K3b
de: Daten-Medium mit K3b erstellen

# Name
source: Create Video CD with K3b
de: Video-CD mit K3b erstellen

# Name
source: Copy DVD with K3b
de: DVD mit K3b kopieren

# Name
source: Rip Video DVD Titles with K3b
de: DVD-Titel mit K3b auslesen

# Name
source: Write CD Image with K3b
de: CD-Abbild mit K3b brennen

# Name
source: Write image to disc with K3b
de: Abbild mit K3b brennen
