Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/extragear-multimedia/k3b.po
Languages: de

source: The K3b Handbook
de: Das Handbuch zu &k3b;

source: <firstname>This documentation was converted from the KDE UserBase <ulink url=" http://userbase.kde.org/K3b">K3b</ulink> page.</firstname> <surname></surname>
de: <firstname>Dieses Handbuch wurde aus der <ulink url=" http://userbase.kde.org/K3b">K3b</ulink>-Webseite der &kde;-Userbase erstellt.</firstname> <surname></surname>

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Thomas</firstname> <surname>Reitelbach</surname><affiliation><address><email>tr@erdfunkstelle.de</email></address></affiliation><contrib>Deutsche Übersetzung</contrib></othercredit>

source: Introduction
de: Einleitung

source: If you have used a burning program such as Nero under Windows, &k3b; will feel quite familiar.
de: Wenn Sie bereits ein Programm zum Brennen von CDs/DVDs wie zum Beispiel Nero unter Windows benutzt haben, werden Sie mit &k3b; keine Probleme haben.

source: Featuring a simple, yet powerful graphical interface, &k3b; provides various options for burning a CD, DVD, or BD (Blu-ray disc). Various types of optical projects are supported including (but not limited to) audio and data, video projects for DVD and VCD, as well as multi-session and mixed-mode discs. &k3b; also has the ability to erase re-writeable media and can perform more complicated tasks such as audiovisual encoding and decoding.
de: Mit einer einfachen, aber dennoch leistungsfähigen grafischen Bedienungsoberfläche bietet &k3b; verschiedene Möglichkeiten, eine CD, DVD oder BD (Blue-ray-Disc) zu brennen. Verschiedene Arten von Projekten werden angeboten einschließlich Audio-, Daten- und Video-Projekten für DVD und VCD. Dazu auch weiter beschreibbare (Multi-Session) Mehrfachsitzungen und Medien mit gemischten Modi (Mixed-Mode). Mit &k3b; können Sie außerdem wieder beschreibbare Medium formatieren oder löschen und sowohl Video- wie auch Audiodaten kodieren und dekodieren.

source: Pre-setup
de: Einstellungen beim ersten Start

source: When you run &k3b; for the first time, you may find &k3b; informing you that no optical writer drivers have been found, meaning you will not be able to write to any optical discs. There is no need to panic as &k3b; will open a configuration window which will help you get various tools used by &k3b; up and running. This includes viewing the user group that owns those applications. You shouldn't need to change this as &k3b; will apply the correct permissions on external programs itself. These programs are generally <command>cdrecord</command>, <command>growisofs</command> and <command>cdrdao</command>. If preferred, one can tell &k3b; to use the <guilabel>burning</guilabel> user group and point it to the optical drive. Below is an image of the configuration window where these settings are possible.
de: Wenn Sie &k3b; zum ersten Mal starten, öffnet das Programm den &k3b;-Einrichtungsassistenten, in dem Sie alle für die Funktionen von &k3b; erforderlichen Programme aktivieren können. Dazu gehört auch die Benutzergruppe, die auf diese Programme zugreifen darf. Normalerweise müssen Sie hier nichts ändern, &k3b; passt die Berechtigungen für externe Programme selbst an. Zu diesen Programmen gehören normalerweise <command>cdrecord</command>, <command>growisofs</command> and <command>cdrdao</command>. Sie können hier auch einstellen, die Benutzergruppe <guilabel>burning</guilabel> zu verwenden und die Laufwerke angeben, deren Zugriffsberechtigungen geändert werden sollen.

source: Configuring the User Interface
de: Einrichtung der Benutzerschnittstelle

source: Upon starting &k3b; you are offered quick starts to the three most popular processes
de: Beim Start von &k3b; können Sie die drei am häufigsten gebrauchten Funktionen mit einem Mausklick starten:

source: New Data Project
de: Neues Daten-Projekt

source: New Audio CD Project
de: Neue Audio-CD

source: Copy Medium
de: Medium kopieren

source: &k3b; can perform much more than these tasks though, and so you may find that some of the other possibilities are just as useful to you. Take a look at this list for a taste of other available functions:
de: &k3b; kann erheblich mehr als diese drei genannten Aufgaben ausführen, eine Liste dieser vorhandenen und für Sie möglicherweise nützlichen Funktionen sehen Sie im folgenden Bildschirmfoto.

source: Perhaps a quick start for one or more of these other tasks would be useful to you and so &k3b; can give you that, too. Simply right click on the application desktop, and here you will see a menu for adding buttons:
de: Möchten Sie für einer dieser zusätzlichen Funktion einen Schnellstartknopf hinzufügen, dann klicken Sie mit der &RMBn; in den leeren Projektbereich unten im Fenster und wählen eine Funktion aus dem Kontextmenü.

source: Configuring the internals
de: Einstellungen für &k3b;

source: Most of the default settings can simply be left alone. It is however, recommended that you do take a look at the <guilabel>Advanced Settings</guilabel> page. Here you can set various important settings, if required.
de: Bei den meisten Einstellungen können Sie die Voreinstellungen übernehmen. Sie sollten aber zur Seite <guilabel>Erweitert</guilabel> gehen. Hier können Sie einige wichtige Einstellungen ändern.

source: <guilabel>Use Burnfree</guilabel> should be set - it controls the burn, ensuring that the buffer never gets dangerously low (which reduces the quantity of bad burns).
de: <guilabel>Burnfree benutzen</guilabel> sollte aktiviert sein, damit wird verhindert, dass der Schreibpuffer leer läuft und das Medium nicht korrekt gebrannt wird.

source: You may wish to automatically erase re-writable disks.
de: Wenn die Einstellung <guilabel>CD-RWs und DVD-RWs automatisch löschen</guilabel> aktiviert ist, wird &k3b; automatisch CD-RWs löschen und DVD-RWs formatieren, wenn diese anstatt eines leeren Mediums vor dem Brennen gefunden werden.

source: The option <guilabel>Do not eject medium after write process</guilabel> is invaluable if your drive is one that cannot be closed quickly enough for <guilabel>Verify</guilabel> to happen.
de: Die Einstellung <guilabel>Medium nach dem Brennvorgang nicht auswerfen</guilabel> ist besonders dann nützlich, wenn das Laufwerk nicht schnell genug wieder für das Überprüfen geschlossen wird.

source: Preparing to burn a disk
de: Vorbereitung für das Brennen einer CD

source: When starting a new project, you should ensure that &k3b; has detected the correct optical media, such as CD or DVD. On the status line at the bottom of the screen you should see the size of disk which is currently set. If this is not correct, or you require a different size, simply right-click on it and set the preferred size from the provided list:
de: Wenn Sie ein neues Projekt starten, überprüfen Sie dass &k3b; das optische Medium richtig als CD oder DVD erkannt hat. In der Statusleiste unten im Fenster wird die Größe des eingelegten Mediums angezeigt. Ist der angezeigte Wert nicht richtig oder Sie benötigen eine andere Größe, klicken Sie mit der &RMBn; darauf und wählen im Kontextmenü den gewünschten Wert.

source: Now choose what is to be burnt.
de: Wählen Sie jetzt die Daten zum Brennen aus.

source: The top half of the screen is the <emphasis>source pane</emphasis>; it functions like a file manager. You can choose ordinary files from mounted data volumes or audio tracks from inserted audio discs. Names of audio tracks are automatically read from CD-TEXT data, if your CD drive supports reading it, or generated using <ulink url="http://libcddb.sourceforge.net/">CDDB</ulink>; the exact format is controlled by a button in the bottom pane. If the names are incorrect or simply do not match the description of the disc, you can edit them using the toolbar button. Your changes will be cached locally and submitted to the master registry at <ulink url="http://www.freedb.org/">FreeDB</ulink>.
de: In der oberen Hälfte des Fensters befindet sich der <emphasis>Quellbereich</emphasis>, der wie ein Dateiverwaltungsprogramm funktioniert. Sie können hier normale Dateien von eingebundenen Datenträgern oder Titel von eingelegten Audio-CDs auswählen. Die Namen der Audio-Titel werden automatisch aus den CD-TEXT-Daten gelesen, wenn Ihr CD-Laufwerk diese Funktion unterstützt. Außerdem werden die Titel aus der <ulink url="http://libcddb.sourceforge.net/">CDDB</ulink>-Datenbank gelesen. Unterscheiden sich die Titel in beiden Quellen, erscheint ein Dialog, in dem Sie den richtigen Titel auswählen können. Ist der Titel falsch oder möchten Sie ihn ändern, benutzen Sie die Knöpfe in der Werkzeugleiste, Ihre Änderungen werden zwischengespeichert und zum Hauptarchiv auf <ulink url="http://www.freedb.org/">FreeDB</ulink> hochgeladen.

source: If the whole record is performed by the same artist, leave the track artist entries blank, fill the <guilabel>Album artist</guilabel>, save to CDDB and requery.
de: Sind alle Stücke vom selben Künstler, dann geben Sie den Namen nur im Feld <guilabel>Album-Interpret</guilabel> ein und lassen die Einträge für die einzelnen Titelinterpreten leer. Speichern Sie dann die Eingaben in den CDDB-Zwischenspeicher und starten die Abfrage erneut.

source: Now that you have your sources at hand, simply drag and drop the files and directories you wish to burn onto the large pane to the right at the bottom; this is the <emphasis>model pane</emphasis>. Behold a tree of your chosen files forming to the left. Should there be some files or directories which you do not want to burn, these can be easily removed from the project by simply removing them from the panel at the bottom. Select the file to be removed (you can control-click to select multiple ones), then choose <guilabel>Remove</guilabel> from the context menu.
de: Ziehen Sie nun alle Dateien und Ordner in den rechten Teil der unteren Hälfte des Fensters. Links wird dann eine Baumansicht der ausgewählten Dateien angezeigt. Um Dateien oder Ordner aus dem Projekt zu entfernen, wählen Sie einzelne Elemente oder benutzen die &Ctrl;taste für mehrere Elemente in der Liste. Dann verwenden Sie <guilabel>Entfernen</guilabel> aus dem Kontextmenü.

source: If you need to compress audio, create a new audio CD project, add the files to be converted and press the button <guilabel>Convert Tracks</guilabel>. This will not affect the contents of the CD if you decide to burn it; however, you will be able to use the compressed files elsewhere. Make sure the original files are lossless (<emphasis>wav</emphasis> or <emphasis>FLAC</emphasis>), otherwise the result will be unsatisfactory.
de: Möchten Sie Audiodaten komprimieren oder in andere Formate umwandeln, erstellen Sie ein neues Audio-CD-Projekt. Fügen Sie die zu ändernden Dateien zu diesem Projekt hinzu und drücken Sie auf <guilabel>Titel konvertieren</guilabel>. Dann bleibt der Inhalt der CD, die Sie brennen, unverändert, aber Sie können die umgewandelten Dateien anderweitig benutzen. Achten Sie darauf, eine verlustfreie Umwandlung wie <emphasis>wav</emphasis> oder <emphasis>FLAC</emphasis> zu verwenden, sonst ist das Ergebnis wahrscheinlich unbrauchbar.

source: The top line will be the title of the disk. In many cases this will be fine, but if you would like to change this to something else, simply rename it using the context menu.
de: In der ersten Zeile wird der Titel der CD angezeigt. In den meisten Fällen ist der vorgeschlagene Name in Ordnung. Wenn Sie ihn ändern möchten, öffnen Sie mit der &RMBn; auf den Titel das Kontextmenü und wählen <guilabel>Umbenennen</guilabel> oder für weitere Einstellungen <guilabel>Eigenschaften</guilabel>.

source: Final Steps
de: Fertigstellung

source: You are now ready to hit the <guilabel>Burn</guilabel> button.
de: Jetzt können Sie den Knopf <guilabel>Brennen</guilabel> drücken.

source: You will see on my screenshot that no disk was present. When you have inserted the appropriate disk you will see a description of it on that line.
de: Auf dem Bildschirmfoto sehen Sie, dass sich keine CD im Laufwerk befindet. Haben Sie ein passendes Medium eingelegt, wird dessen Beschreibung an dieser Stelle angezeigt.

source: There are still one or two choices to be made. I would <emphasis>recommend</emphasis> that you set <guilabel>Verify written data</guilabel>, then hit the <guilabel>Save</guilabel> icon at the bottom of the screen, ensuring that it becomes your personal default. For most modern drives it's safe to leave mode and speed to <guilabel>Auto</guilabel>. If you may wish to burn another copy of the disk at a later date, select <guilabel>Create image</guilabel>, which will save having to set up the burn again. Set the number of copies you want to burn, then, when you are satisfied, hit <guilabel>Burn</guilabel>.
de: Einige Einstellungen sollten Sie jetzt noch vornehmen. Es wird <emphasis>empfohlen</emphasis> <guilabel>Gebrannte Daten prüfen</guilabel> anzukreuzen und dann auf das Symbol <guilabel>Speichern</guilabel> zu drücken, um dies als eigenen Standard zur späteren Verwendung zu speichern. Bei den modernen heutigen Laufwerken können Sie Brennmodus und Geschwindigkeit auf <guilabel>Automatisch</guilabel> eingestellt lassen. Möchten Sie später noch weitere Kopien der CD oder DVD brennen, wählen Sie <guilabel>Abbild erzeugen</guilabel>, dann müssen Sie nicht nochmal alles für das Brennen einstellen. Geben Sie die Anzahl der Kopien ein, die Sie brennen möchten und drücken Sie dann auf <guilabel>Brennen</guilabel>.

source: Burning an Audio CD
de: Brennen einer Audio-CD

source: Starting an Audio CD Project
de: Ein Audio-CD-Projekt starten

source: &k3b; supports a lot of audio formats and can convert them automatically for you.
de: &k3b; unterstützt eine große Zahl von Audio-Formaten und kann sie automatisch für Sie umwandeln,

source: Some distributions split this capability of &k3b; into a separate package, &eg; on Debian and Ubuntu distributions you need to install the package libk3b6-extracodecs, on openSUSE the name of the package is k3b-codecs. On some distributions (&eg; Mandriva) you do not need to install any additional packages.
de: Einige Distributionen stellen getrennte Pakete für diese Funktionen von &k3b; zur Verfügung. &eg; auf Debian- und Ubuntu-Systemen müssen Sie das Paket libk3b6-extracodecs, auf openSUSE-Systemen heißt das Paket k3b-codecs. Bei einigen Distributionen wie &eg; Mandriva benötigen Sie keine zusätzlichen Pakete.

source: Selecting the files
de: Auswahl der Dateien

source: There are two ways to select the audio files you want to burn onto an audio cd:
de: Es gibt zwei Möglichkeiten, Audio-Dateien für das Brennen auf eine Audio-CD auszuwählen.

source: Using &k3b;
de: Mit &k3b;

source: At the bottom half of the &k3b; window click on <guilabel>New Audio CD Project</guilabel> and select the files you want to burn.
de: Im unteren Bereich des &k3b;-Fensters klicken Sie auf <guilabel>Neue Audio-CD</guilabel> und wählen dann die Dateien zum Brennen aus.

source: Alternatively navigate in the folders panel to the location of the audio files. Double click on an audio file or drag and drop selected audio files into the bottom part of &k3b;'s window automatically starts a <guilabel>New Audio CD Project</guilabel> with these files.
de: Alternativ wechseln Sie in der Ordneransicht zum Ordner mit den Audiodateien. Doppelklicken Sie auf eine Audiodatei oder ziehen Sie ausgewählte Audiodateien in den unteren Bereich des Fensters. &k3b; startet dann automatisch ein <guilabel>Neues Audioprojekt</guilabel> mit diesen Dateien.

source: Using the file manager
de: Mit dem Dateiverwaltungs-Programm

source: Go to the folder containing your music files in &dolphin; or &konqueror;
de: Gehen Sie mit &dolphin; oder &konqueror; in den Ordner mit Ihren Musikdateien.

source: Choose the files to burn and select <menuchoice><guimenu>Actions</guimenu><guimenuitem>Create Audio CD with &k3b;</guimenuitem></menuchoice> from the context menu.
de: Wählen Sie die zu brennenden Dateien aus und dann <menuchoice><guimenu>Aktionen</guimenu><guimenuitem>Audio-CD mit &k3b; erstellen </guimenuitem></menuchoice>

source: Edit the Title Information
de: Titel-Informationen des Albums bearbeiten

source: You can give the tracks titles or import those from <acronym>CDDB</acronym> (a online service for track names). To do so double click on the track (lower half of the window).
de: Sie können die Titel der einzelnen Stücke direkt eingeben oder sie über <acronym>CDDB</acronym> (ein Onlinedienst für Titel von Musikstücken) importieren. Klicken Sie dazu zweimal auf das Stück im unteren Bereich des Fensters.

source: Burn the CD
de: Brennen der CD

source: Insert a blanc CD-R or CD-RW disc into your CD writer and click on <guilabel>Burn</guilabel>. In the upcoming dialog check if you like the presets and when done click on <guilabel>Burn</guilabel>. The CD will now be burned for you.
de: Legen Sie eine leere CD-R oder CD-RW in das CD-Laufwerk und drücken Sie den Knopf <guilabel>Brennen</guilabel>. Überprüfen Sie dann im nächsten Dialog, ob alle Einstellungen richtig sind und starten dann den Schreibvorgang mit <guilabel>Brennen</guilabel>.

source: Credits and License
de: Danksagungen und Lizenz

source: Documentation Copyright see the UserBase <ulink url="http://userbase.kde.org/index.php?title=K3b&amp;action=history">K3b page history</ulink>
de: Copyright der Dokumentation: siehe <ulink url="http://userbase.kde.org/index.php?title=K3b&amp;action=history">Versionsgeschichte der K3b-Seite</ulink>

source: CREDIT_FOR_TRANSLATORS
de: <para>Deutsche Übersetzung: Thomas Reitelbach <email>tr@erdfunkstelle.de</email></para>
