Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/extragear-multimedia/kamoso.po
Languages: de

source: The Kamoso Handbook
de: Das Handbuch zu Kamoso

source: <firstname>This documentation was converted from the KDE UserBase <ulink url=" http://userbase.kde.org/Kamoso">Kamoso</ulink> page.</firstname> <surname></surname>
de: <firstname>Dieses Handbuch wurde aus der <ulink url=" http://userbase.kde.org/Kb">Kamoso</ulink>-Webseite der &kde;-Userbase erstellt.</firstname> <surname></surname>

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Burkhard</firstname><surname>Lück</surname><affiliation><address><email>lueck@hube-lueck.de</email></address></affiliation><contrib>Übersetzung</contrib></othercredit>

source: Take a shot
de: Fotos aufnehmen

source: <application>Kamoso</application> gives you an opportunity to make photos from your webcam and upload them to Facebook
de: <application>Kamoso</application> gibt Ihnen die Möglichkeit, Fotos mit Ihrer Webcam aufzunehmen und auf Facebook hochzuladen

source: Record video
de: Videoaufnahmen

source: <application>Kamoso</application> allows to record videos from your webcam and upload them to YouTube
de: <application>Kamoso</application> gibt Ihnen die Möglichkeit, Videos mit Ihrer Webcam aufzunehmen und auf YouTube hochzuladen

source: User Guide
de: Benutzerhandbuch

source: Welcome to <application>Kamoso</application>!
de: Willkommen zu <application>Kamoso</application>.

source: <application>Kamoso</application> is a great program to use your webcam to take pictures or make videos. It probably should be the best webcam recorder for &Linux;. This guide will help you use Kamoso once you have installed it. We tried to make it simple and friendly. Good luck!
de: <application>Kamoso</application> ist ein Programm, um mit Ihrer Webcam Bilder oder Videos aufzunehmen. Diese Anleitung hilft Ihnen Kamoso zu benutzen, nachdem Sie das Programm installiert haben.

source: Quick Start
de: Einführung

source: On launching <application>Kamoso</application>, you are greeted with two groups of buttons on the left and right, and a button in the center.
de: Beim Start von <application>Kamoso</application> sehen Sie ein Fenster mit einer Gruppe von Knöpfen links und rechts und einem einzelnen Knopf in der Mitte.

source: The central button helps you to click a picture! Go ahead and try it now! SMILE!
de: Der Knopf in der Mitte hilft dabei, ein Bild aufzunehmen. Probieren Sie es einfach aus.

source: <application>Kamoso</application> will give you a 3 second heads up so you can pose for your picture, and ask you to smile right before clicking!
de: Mit <application>Kamoso</application> haben Sie drei Sekunden Zeit, um sich für das Bild zurecht zusetzen, for der Aufnahme werden Sie zum Lächeln aufgefordert.

source: If you click on the second button from the left, <application>Kamoso</application> changes to burst-mode. <application>Kamoso</application> will keep clicking pictures rapidly till you don't click on the center button and tell it to stop. The pictures line up in chronological order on the bottom, and you can view them by double-clicking them. Alternatively, you could right click and choose <guilabel>Open</guilabel> to view the pictures too! If you aren't happy with any of the pictures, just right click and select <guilabel>Trash</guilabel> to delete that particular picture.
de: Wenn Sie auf den zweiten Knopf von links klicken, wechselt <application>Kamoso</application> in den Daueraufnahmemodus. Klicken Sie dann auf den mittleren Knopf, um die Serienaufnahme zu starten und auch wieder anzuhalten. Die Bilder erscheinen in der zeitliche Reihenfolge der Aufnahmen unten im Fenster. Durch Doppelklicken auf ein Bild können sie es anzeigen lassen. Alternativ können Sie mit der &RMBn; klicken und im Kontextmenü <guilabel>Öffnen</guilabel> wählen und das Bild im Bearbeitungsprogramm öffnen. Möchten Sie ein bestimmtes Bild löschen, wählen Sie <guilabel>Papierkorb</guilabel> aus dem Kontextmenü.

source: Upload image to Facebook
de: Bilder zu Facebook hochladen

source: If you feel your newly-clicked pictures must be uploaded to your Facebook profile, just right click on the picture and select <guilabel>Facebook Import/Export</guilabel>. A window will open up on your browser asking you to grant permission to <application>Kamoso</application>. Once you do this, upload away!
de: Möchten Sie die neu aufgenommenen Bilder auf Ihr Facebook-Profil hochladen, klicken Sie mit der &RMBn; auf das Bild und wählen Sie aus dem Kontextmenü <guilabel>Facebook-Import/Export</guilabel>. Ein Fenster wird in Ihrem Browser geöffnet, geben Sie die Berechtigung zum Hochladen für <application>Kamoso</application>. Dann können Sie diese Aktion starten.

source: You need to have an account on Facebook to upload the picture you made
de: Sie benötigen ein Facebook-Konto, um Ihre aufgenommenen Bilder hochzuladen

source: If you want to avoid all the right clicks, click on the second button on the right side and you'll be provided with the same options as when you right click.
de: Alle Aktionen im Kontextmenü können Sie auch erreichen, wenn Sie auf den zweiten Knopf von rechts drücken und dann diese Aktionen aus dem Menü auswählen.

source: Upload video to YouTube
de: Videos zu YouTube hochladen

source: <application>Kamoso</application> also allows you to capture videos! By clicking on the red button on the left, you change to video mode. Click on the central button to shoot your video! Right click on the video and select <guilabel>YouTube</guilabel> to upload it to YouTube.
de: Mit <application>Kamoso</application> können Sie auch Videos aufnehmen. Klicken Sie auf den roten Knopf links, um in den Videomodus zu wechseln. Klicken Sie dann auf den mittleren Knopf zum Starten und Anhalten der Aufnahme. Klicken Sie mit der &RMBn; auf das Video und wählen Sie <guilabel>YouTube</guilabel> , um das Video hochzuladen.

source: You need to have an account on YouTube and provide <application>Kamoso</application> an access with your username and password – don't worry, it's totally safe!
de: Sie brauchen ein Konto auf YouTube und müssen <application>Kamoso</application> den Zugriff mit Ihrem Benutzernamen und Passwort erlauben.

source: Customising
de: Anpassung

source: If you feel your picture quality isn't optimal, click on the button on the extreme right and select <guilabel>Settings</guilabel>. This is the settings panel.
de: Ist die Qualität Ihrer Bilder nicht zufriedenstellend, klicken Sie auf den Knopf ganz rechts und wählen <guilabel>Einstellungen</guilabel>.

source: If you want to change the directory where <application>Kamoso</application> saves the pictures, navigate to the <guilabel>General</guilabel> panel, and change the directory from thereon.
de: Möchten Sie den Ordner ändern, in den <application>Kamoso</application> die Bilder speichert, gehen Sie zur Seite <guilabel>Allgemein</guilabel> und ändern dort den Speicherort.

source: If you want to change the time before <application>Kamoso</application> clicks your picture, navigate to <guilabel>Photo settings</guilabel>.
de: Auf der Seite <guilabel>Fotoeinstellungen</guilabel> können Sie die Zeit ändern, bis <application>Kamoso</application> ein Foto aufnimmt.

source: If you're a really technical user, scroll over to the <guilabel>Video settings</guilabel> and there you can adjust settings like brightness, contrast, &etc;
de: Alle Einstellungen wie Helligkeit, Farbton, Kontrast, Sättigung und Gamma finden Sie auf der Seite <guilabel>Videoeinstellungen</guilabel>.

source: The End
de: Schluß

source: Well, we've reached the end of our tutorial. I hope your queries have been adequately answered!
de: Damit haben Sie das Ende der Anleitung erreicht, hoffentlich wurden Ihre Fragen ausreichend beantwortet.

source: Enjoy using <application>Kamoso</application>!
de: Viel Spaß mit <application>Kamoso</application>.

source: Credits and License
de: Danksagungen und Lizenz

source: Documentation Copyright see the UserBase <ulink url="http://userbase.kde.org/index.php?title=Kamoso&amp;action=history">Kamoso page history</ulink>
de: Copyright der Dokumentation: siehe <ulink url="http://userbase.kde.org/index.php?title=Kamoso&amp;action=history">Versionsgeschichte der Kamoso-Seite</ulink>

source: CREDIT_FOR_TRANSLATORS
de: <para>Übersetzung Burkhard Lück<email>lueck@hube-lueck.de</email></para>
