Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/extragear-utils/krecipes.po
Languages: de

source: The second preference available for configuration in the <guilabel>Server Settings</guilabel> screen is for the <emphasis>Backup</emphasis> operation. It is required that the path to your database program be known for the <emphasis>Backup</emphasis> operation to work properly. Therefore, beside the label that is shown in the screenshot as <guilabel>Path to 'sqlite3':</guilabel>, there is a text box which shows the name of the database program. The text in this box can be changed by directly editing it, or by clicking the File icon, which will activate the screen that allows you to navigate to the location of your database program executable file.
de: Im nächsten Abschnitt können Sie die <guilabel>Datensicherung</guilabel> einrichten. Der Pfad zum Datenbank-Programm muss für die Sicherung bekannt sein, damit sie korrekt funktioniert. Daher finden Sie neben den Feld „Pfad zu sqlite3“ den Namen des Datenbank-Programms. Den Text in diesem Feld können Sie direkt ändern oder auf das Dateisymbol klicken, um den Dateiauswahldialog zu benutzen.

source: You might want to do this if you have chosen to install your database program to a location that is different from the default. Also note that, in the screenshot, the database program shows as <quote>sqlite3</quote>. However, if you use another database program, for instance MySQL or PostgreSQL, the appropriate database would be shown.
de: Dies ist möglicherweise erforderlich, wenn Sie das Datenbankprogramm nicht im Standardpfad installiert haben. Verwenden Sie ein anderes Datenbank.Programm wie MySQL oder PostgreSQL, werden diese Namen statt <quote>sqlite3</quote> wie im Bildschirmfoto angezeigt.

source: This setting is for the purpose of setting the location of the database file. For specific information on backing up your database, see the section <link linkend="backup-db">Backing Up Your &krecipes; Database</link>.
de: Mit dieser Einstellung wird der Speicherort der Datenbankdatei angepasst. Weitere Informationen zur Sicherung Ihrer Datenbank finden Sie im Abschnitt <link linkend="backup-db">Sicherung Ihrer &krecipes;-Datenbank</link>.

source: Also exclusive to the <guilabel>Server Settings</guilabel> screen, is the <guilabel>Re-run wizard on next startup</guilabel> tickbox that can be selected to reload the database with the recipes and USDA data that come as defaults with the <emphasis>&krecipes;</emphasis> program.
de: Auf dieser Seite finden Sie auch die Einstellung <guilabel>Einrichtungsassistent beim nächsten Start anzeigen</guilabel>. Aktivieren Sie dies, um beim nächsten Start von &krecipes; die Datenbank und die USDA-Daten, die als Standard im &krecipes;-Programm enthalten sind, erneut zu laden.

source: Buttons that appear at the bottom of the <guilabel>Server Settings</guilabel> screen are common to each of the preference screens and function as follows &mdash;
de: Die Knöpfe unten auf der Seite <guilabel>Datenbanksystem</guilabel> werden auch auf allen anderen Seiten des Einrichtungsdialogs angezeigt und haben folgende Funktionen:

source: <guibutton>OK</guibutton> &ndash; sets any changes made and closes the <interface>&krecipes; Preferences - &krecipes;</interface> window
de: <guibutton>OK</guibutton> &ndash; übernimmt alle vorgenommenen Änderungen und schließt den Dialog <interface>Einrichten - &krecipes;</interface>

source: <guibutton>Cancel</guibutton> &ndash; cancels changes, if any have been made, and closes the <interface>&krecipes; Preferences - &krecipes;</interface> window
de: <guibutton>Abbrechen</guibutton> &ndash; verwirft alle vorgenommenen Änderungen und schließt den Dialog <interface>Einrichten - &krecipes;</interface>

source: <guibutton>Help</guibutton> opens the <emphasis>&krecipes;</emphasis> Handbook to the associated section
de: <guibutton>Hilfe</guibutton> &ndash; Öffnet das Handbuch zu <emphasis>&krecipes;</emphasis> mit dem zugehörigen Abschnitt.

source: Customizing Formatting
de: Formatierung anpassen

source: Here's a screenshot of the &krecipes; Formatting configuration window.
de: Bildschirmfoto von &krecipes;-Einrichtungsdialog - Formatierung

source: Configure <emphasis>&krecipes;</emphasis> &ndash; Formatting interface
de: <emphasis>&krecipes;</emphasis> einrichten &ndash; Formatierung

source: From this window, there are two formatting preferences that can be customized &mdash;
de: In diesem Dialog gibt es zwei Formatierungseinstellungen, die angepasst werden können &mdash;

source: <guilabel>Number Format</guilabel> &ndash; either <guilabel>Fraction</guilabel> or <guilabel>Decimal</guilabel> can be selected by clicking on the appropriate radio button and this choice controls how the units of measure will display in your recipes
de: <guilabel>Zahlenformat</guilabel> &ndash; es kann entweder <guilabel>Bruchzahl</guilabel> oder <guilabel>Dezimal</guilabel> durch Klicken auf den zugehörigen Auswahlknopf ausgewählt werden. Diese Einstellung bestimmt die Anzeige der Mengeneinheiten in Ihren Rezepten.

source: <guilabel>Use abbreviations</guilabel> &ndash; this feature is turned on by clicking on the tickbox beside the label
de: <guilabel>Abkürzungen verwenden</guilabel> &ndash; Dies wird durch Klicken auf das Ankreuzfeld ein- und ausgeschaltet.

source: Choosing Import/Export Preferences
de: Einstellungen für Import/Export

source: Here's a screenshot of the &krecipes; Import/Export configuration window.
de: Bildschirmfoto von &krecipes;-Einrichtungsdialog - Import/Export

source: Configure <emphasis>&krecipes;</emphasis> &ndash; Import/Export interface
de: <emphasis>&krecipes;</emphasis> einrichten &ndash; Import/Export

source: On this screen under the heading <guilabel>Import</guilabel>, two options exist &mdash;
de: Auf dieser Seite gibt es im Abschnitt <guilabel>Import</guilabel> zwei Einstellungen &mdash;

source: The first is <guilabel>Overwrite recipes with same title</guilabel> and this feature can be turned on by clicking the tickbox beside the label. This might be a good idea if you are re-importing a currently loaded database.
de: Als erstes die Einstellung <guilabel>Rezepte mit gleichem Namen überschreiben</guilabel>, die durch Klicken auf das Ankreuzfeld aktiviert werden kann. Diese Einstellung kann verwendet werden, um eine bereits geladenen Datenbank wieder zu importieren.

source: Should you choose NOT to overwrite existing recipes and you have a recipe titled <emphasis>Chocolate Cheesecake</emphasis>, for example, in your recipe list, if you import another Chocolate Cheesecake recipe, the listing will appear as &mdash;
de: Sollten Sie einstellen, vorhandene Rezepte nicht zu überschreiben und es gibt zum Beispiel bereits ein Rezept mit dem Namen <emphasis>Schokoladenkuchen</emphasis> in der Rezeptliste, dann werden beim Import eines Rezeptes mit dem gleichen Namen folgende Einträge in der Liste erscheinen &mdash;

source: Chocolate Cheesecake
de: Schokoladenkuchen

source: Chocolate Cheesecake (2)
de: Schokoladenkuchen (2)

source: The second option is <guilabel>Ask which recipes to import</guilabel> and again, this feature can be turned on by selecting the text box. If this feature is not turned on, your recipes will be imported silently with no prompt. See the section <link linkend="import-export-recipes">Importing and Exporting Recipes</link> for a screenshot that will show the result of this option being selected.
de: Die nächste Einstellung ist <guilabel>Nachfragen, welche Rezepte importiert werden sollen</guilabel>. Ist dies abgeschaltet, werden die Rezepte ohne Nachfrage importiert. Im Abschnitt <link linkend="import-export-recipes">Rezepte importieren und exportieren</link> finden Sie ein Bildschirmfoto, wenn diese Einstellung aktiviert ist.

source: Copying to the Clipboard
de: Kopieren in die Zwischenablage

source: Under the heading <guilabel>Export</guilabel>, a drop-down menu exists from which you can select the <quote>Copy to Clipboard</quote> format you wish to use.
de: Im Abschnitt <guilabel>Exportieren</guilabel> können Sie aus einem Auswahlfeld ein <quote>Format für das Kopieren in die Zwischenablage</quote> einstellen.

source: The available choices for <quote>Copy to Clipboard</quote> are &mdash;
de: Folgende Formate werden für die Aktion <quote>In die Zwischenablage kopieren</quote> unterstützt&mdash;

source: Plain Text (*.txt) &ndash; If copied to the clipboard in this format, the result will be a plain text copy of the recipe.
de: Einfacher Text (*.txt) &ndash; Mit einer Kopie mit diesem Format in die Zwischenablage besteht das Rezept nur aus einfachem Text ohne Formatierungen.

source: &krecipes; (*.kreml) &ndash; If copied to the clipboard in this format, the result will contain all the associated markup tags that allow formatting which is associated with <emphasis>&krecipes;</emphasis>.
de: &krecipes; (*.kreml) &ndash; Eine Kopie in die Zwischenablage in diesem Format einhält alle Formatierungen, die vom Programm <emphasis>&krecipes;</emphasis> verwendet werden.

source: Meal-Master (*.mmf) &ndash; If copied to the clipboard in this format, the result will be a format that is recognized by the Meal-Master program.
de: Meal-Master (*.mmf) &ndash; Eine Kopie in die Zwischenablage in diesem Format einhält alle Formatierungen, die vom Programm Meal-Master verwendet werden.

source: Rezkonv (*.rk) &ndash; If copied to the clipboard in this format, the result will be a format that is recognized by the Rezkonv program.
de: Rezkonv (*.rk) &ndash; Eine Kopie in die Zwischenablage in diesem Format einhält alle Formatierungen, die vom Programm Rezkonv verwendet werden.

source: RecipeML (*.xml) &ndash; If copied to the clipboard in this format, the result will contain all the associated markup tags that allow formatting associated with RecipeML.
de: RecipeML (*.xml) &ndash; Eine Kopie in die Zwischenablage in diesem Format einhält alle Formatierungen, die vom Programm RecipeML verwendet werden.

source: If the contents of the clipboard have been pasted directly into a text editor, the file can then be saved with the appropriate extension as previously listed and imported back into the associated recipe program.
de: Wurde der Inhalt der Zwischenablage direkt in einen Texteditor eingefügt, dann die Datei mit einer passenden Erweiterung aus den vorher aufgeführten Varianten gespeichert und wieder zurück in das zugehörige Rezeptprogramm importiert werden.

source: Enhancing Performance
de: Leistung verbessern

source: Here's a screenshot of the &krecipes; Performance configuration window.
de: Bildschirmfoto von &krecipes;-Einrichtungsdialog - Leistung

source: Configure <emphasis>&krecipes;</emphasis> &ndash; Performance interface
de: <emphasis>&krecipes;</emphasis> einrichten &ndash; Leistung

source: In this interface, you are customizing two settings. For a reason that you might want to do this, see the section <link linkend="config-performance-reason">Reasons for Configuring Performance Settings</link>. These settings can be used individually or together or not at all.
de: Auf dieser Seite können zwei Einstellungen angepasst werden. Gründe für diese Anpassungen finden Sie im Abschnitt <link linkend="config-performance-reason">Gründe für Änderung der Einstellungen zur Leistung</link>. Diese Einstellungen können getrennt oder zusammen geändert werden oder in der Voreinstellung bleiben.

source: The first is to set the number of categories that appear in the list when the <emphasis>Find/Edit Recipes</emphasis> component is selected. By default, this number is set to <quote>Unlimited</quote>, which means that all categories will be displayed. To change this setting, adjust the <quote>slider</quote> that appears below the label <guilabel>Number of categories to display at once:</guilabel> until the desired number appears, or use the <quote>spinbox</quote> to set the number.
de: Als erstes kann die Anzahl der Kategorien eingestellt werden, die in der Liste angezeigt werden, wenn Sie die Komponente <emphasis>Rezepte suchen/bearbeiten</emphasis> auswählen. In der Voreinstellung ist die Anzahl <quote>Unbegrenzt</quote>, d. h. alle Kategorien werden angezeigt. Um diese Einstellung zu ändern, benutzen Sie den Schieberegler unter der Beschriftung <guilabel>Anzahl Kategorien, die auf einmal angezeigt werden</guilabel> oder das <quote>Drehfeld</quote>.

source: The second setting that you might wish to change is for the number of items that are displayed in lists, for example, the <emphasis>Ingredients</emphasis> list or <emphasis>Properties</emphasis> list. Again, by default this is set to <quote>Unlimited</quote> and to change the setting you would adjust the <quote>slider</quote> that appears below the label <guilabel>Number of elements to display at once:</guilabel>, or use the <quote>spinbox</quote> until the desired number appears.
de: Als zweites kann die Anzahl von Elementen eingestellt werden, die in der Liste angezeigt werden, wie zum Beispiel in den Listen <emphasis>Zutaten</emphasis> oder <emphasis>Eigenschaften</emphasis>. In der Voreinstellung ist die Anzahl <quote>Unbegrenzt</quote>. Um diese Einstellung zu ändern, benutzen Sie den Schieberegler unter der Beschriftung <guilabel>Anzahl Elemente, die auf einmal angezeigt werden</guilabel> oder das <quote>Drehfeld</quote>.

source: Reasons for Configuring Performance Settings
de: Gründe für Änderung der Einstellungen zur Leistung

source: In most instances, the settings to adjust the <guilabel>Number of categories to display at once:</guilabel> and/or the <guilabel>Number of elements to display at once:</guilabel> will not have to be changed. The ultimate reason that you might want to do so occurs when you have a very large database of recipes. Adjusting these settings so that your Categories or list items are loaded in groups will greatly improve the speed of loading for these items.
de: In den meisten Fällen müssen die Einstellungen für <guilabel>Anzahl Kategorien, die auf einmal angezeigt werden</guilabel> oder für <guilabel>Anzahl Elemente, die auf einmal angezeigt werden</guilabel> nicht geändert werden. Der einzige Grund dafür kann sein, dass Sie eine sehr große Datenbank mit Rezepten haben. Wenn Sie diese Einstellungen anpassen, so dass die Kategorien oder Listenelemente in Gruppen geladen werden, werden die Elemente schneller geladen.

source: Reporting Problems
de: Probleme berichten

source: In the event that <emphasis>&krecipes;</emphasis> program does something unexpected and you think this might be a bug, you can submit a bug report to the program maintainer. Even if you do not encounter any problems and you have an idea to improve <emphasis>&krecipes;</emphasis>, you can submit this request as well. By submitting a report in either of these situations, it will help us to continually improve <emphasis>&krecipes;</emphasis>.
de: Bemerken Sie ein unerwartetes Verhalten von <emphasis>&krecipes;</emphasis> und nehmen an, dass das ein Fehler ist, können Sie einen Fehlerbericht an den Programmbetreuer schicken. Auch wenn Sie keine Probleme mit dem Programm haben, aber Ideen zur Verbesserung von <emphasis>&krecipes;</emphasis>, dann schicken Sie auch diese Vorschläge. Auf jeden Fall hilft jede Art von Berichten, <emphasis>&krecipes;</emphasis> zu verbessern.

source: Reporting Bugs/Requesting Feature Enhancements
de: Fehlerberichte und Frage nach neuen Funktionen

source: To submit a bug report, select <guimenu>Help</guimenu> and <guimenuitem>Report Bug</guimenuitem> from the <emphasis>&krecipes;</emphasis> menu bar. The <emphasis><interface>Submit Bug Report &ndash; &krecipes;</interface></emphasis> window appears as in the screenshot below:
de: Um einen Fehlerbericht zu senden, wählen Sie in der Menüleiste von &krecipes; <menuchoice><guimenu>Hilfe</guimenu><guimenuitem>Probleme oder Wünsche berichten</guimenuitem></menuchoice>. Der Dialog <emphasis><interface>Problembericht einschicken &ndash; &krecipes;</interface></emphasis> wie im folgenden Bildschirmfoto wird dann angezeigt.

source: Here's a screenshot of the &krecipes; interface for submitting bugs or feature requests.
de: Bildschirmfoto des &krecipes;-Dialog zum Senden von Fehlerberichte und Wünschen für neue Funktionen.

source: Submitting Bug Reports and Feature Requests
de: Fehlerberichte und Wünsche für neue Funktionen senden

source: This is the actual interface used to submit the bug report or feature enhancement in a web browser window on <ulink url="http://bugs.kde.org">bugs.kde.org</ulink>.
de: Dies ist der Dialog für das Senden von Fehlerberichten und Frage nach neuen Funktionen im Webbrowser auf <ulink url="http://bugs.kde.org">bugs.kde.org</ulink>.

source: Command Reference
de: Befehlsreferenz

source: The main <emphasis>&krecipes;</emphasis> window
de: Das Hauptfenster von <emphasis>&krecipes;</emphasis>

source: The File Menu
de: Das Menü Datei

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>New Recipe</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo> </shortcut> <guimenu>Datei</guimenu> <guimenuitem>Neues Rezept</guimenuitem>

source: <action>Creates a new recipe</action> - see <link linkend="enter-edit-recipes">Entering and Editing Recipes</link> for details.
de: <action>Erstellt ein neues </action> - siehe <link linkend="enter-edit-recipes">Eingabe und Bearbeiten von Rezepten</link> mit weiteren Informationen.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>S</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Save</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>S</keycap></keycombo> </shortcut> <guimenu>Datei</guimenu> <guimenuitem>Speichern</guimenuitem>

source: <action>Saves the recipe</action>.
de: <action>Speichert das Rezept</action>.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>P</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Print</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>P</keycap></keycombo> </shortcut> <guimenu>Datei</guimenu> <guimenuitem>Drucken</guimenuitem>

source: <action>Prints the current recipe</action> &ndash; See the section <link linkend="print-recipe">Printing Your Recipe</link> for instructions.
de: <action>Druckt das aktuelle Rezept</action> &ndash; Weitere Informationen finden Sie im Abschnitt <link linkend="print-recipe">Ausdrucken Ihres Rezepts</link>.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>I</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Import from File...</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>I</keycap></keycombo> </shortcut> <guimenu>Datei</guimenu> <guimenuitem>Aus Datei importieren ...</guimenuitem>

source: <action>Imports recipes</action> from a file &ndash; See the section <link linkend="file-import">Importing from a File</link> for instructions.
de: <action>Importiert Rezepte</action> aus einer Datei &ndash; siehe <link linkend="file-import">Import aus einer Datei</link>.

source: <guimenu>File</guimenu> <guimenuitem>Import from Database...</guimenuitem>
de: <guimenu>Datei</guimenu> <guimenuitem>Aus Datenbank importieren ...</guimenuitem>

source: <action>Imports recipes</action> from one of 3 database choices
de: <action>Importiert Rezepte</action> aus einer der drei unterstützten Datenbanken.

source: See the corresponding sections on importing from a Database &ndash; <link linkend="import-sqlite">SQLite</link>, <link linkend="import-mysql">MySQL</link>, or <link linkend="import-postgresql">PostgreSQL</link>.
de: Weitere Informationen finden Sie in den entsprechenden Abschnitten über den Import aus einer Datenbank &ndash; <link linkend="import-sqlite">SQLite</link>, <link linkend="import-mysql">MySQL</link>, oder <link linkend="import-postgresql">PostgreSQL</link>.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>O</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Export...</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>O</keycap></keycombo> </shortcut> <guimenu>Datei</guimenu> <guimenuitem>Exportieren ...</guimenuitem>

source: <action>Exports</action> either a single recipe or all recipes to a file &ndash; <link linkend="export-recipe">Exporting Recipes to Other Formats</link>.
de: <action>Exportiert</action> entweder ein einzelnes oder alle Rezepte in eine Datei &ndash; siehe <link linkend="export-recipe">Rezepte in andere Formate exportieren</link>.

source: <guimenu>File</guimenu> <guimenuitem>Backup</guimenuitem>
de: <guimenu>Datei</guimenu><guimenuitem>Sicherung ...</guimenuitem>

source: <action>Backs up</action> your <emphasis>&krecipes;</emphasis> database file &nbsp; refer to the section <link linkend="backup-db">Backing Up Your <emphasis>&krecipes;</emphasis> Database</link>.
de: Erstellt eine Sicherung Ihrer <emphasis>&krecipes;</emphasis>-Datenbank. Weitere Informationen finden Sie im Abschnitt <link linkend="backup-db">Sicherung Ihrer <emphasis>&krecipes;</emphasis>-Datenbank</link>.

source: <guimenu>File</guimenu> <guimenuitem>Restore</guimenuitem>
de: <guimenu>Datei</guimenu> <guimenuitem>Datensicherung zurückspielen ...</guimenuitem>

source: <action>Restores</action> your <emphasis>&krecipes;</emphasis> database file &nbsp; refer to the section <link linkend="restore-db">Restoring Your <emphasis>&krecipes;</emphasis> Database</link>.
de: Stellt Ihre <emphasis>&krecipes;</emphasis>-Datenbank wieder her. Weitere Informationen finden Sie im Abschnitt <link linkend="restore-db">Wiederherstellung Ihrer <emphasis>&krecipes;</emphasis>-Datenbank</link>.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Quit</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo> </shortcut> <guimenu>Datei</guimenu> <guimenuitem>Beenden</guimenuitem>

source: <action>Quits</action> <emphasis>&krecipes;</emphasis>.
de: <action>Beendet</action> <emphasis>&krecipes;</emphasis>.

source: The Edit Menu
de: Das Menü Bearbeiten

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>E</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Edit Recipe</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>E</keycap></keycombo> </shortcut> <guimenu>Bearbeiten</guimenu> <guimenuitem>Rezepte bearbeiten</guimenuitem>

source: Accesses the <emphasis>&krecipes;</emphasis> <action>Edit</action> mode - see <link linkend="enter-edit-recipes">Entering and Editing Recipes</link> for details.
de: Startet den Bearbeitungsmodus für &krecipes;, weiter Informationen im Abschnitt <link linkend="enter-edit-recipes">Rezepte eingeben und bearbeiten</link>.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>C</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Copy to Clipboard</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>C</keycap></keycombo> </shortcut> <guimenu>Bearbeiten</guimenu> <guimenuitem>In die Zwischenablage kopieren</guimenuitem>

source: Will make a text copy of a selected recipe and place it on the <interface>Clipboard</interface> in order to paste into another application, for example an email.
de: Erstellt eine Textkopie eines ausgewählten Rezepts und kopiert ihn in die <interface>Zwischenablage</interface>, um das Rezept dann in einer anderen Anwendung wie zum Beispiel einer E-Mail einzufügen.

source: The View Menu
de: Das Menü Ansicht

source: <shortcut> <keycap>F5</keycap> </shortcut> <guimenu>View</guimenu> <guimenuitem>Reload</guimenuitem>
de: <shortcut><keycap>F5</keycap></shortcut><guimenu>Ansicht</guimenu><guimenuitem>Neu laden</guimenuitem>

source: Reloads the currently active recipe.
de: Lädt das zurzeit aktive Rezept erneut.
