Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/extragear-utils/krecipes.po
Languages: de

source: To display NO photo in the recipe, refer to the section <link linkend="displayed-items">Selecting Items to Display</link> for further instructions.
de: Soll kein Foto für das Rezept angezeigt werden, lesen Sie bitte den Abschnitt <link linkend="displayed-items">Elemente zur Ansicht auswählen</link> mit weiteren Informationen.

source: Here's a screenshot of a completed recipe description in the Recipe tab of the &krecipes; recipe entry interface.
de: Bildschirmfoto einer vollständigen Rezeptbeschreibung

source: New Recipe Entry &ndash; The Completed Recipe Tab
de: Eingabe eines neuen Rezepts &ndash; Die ausgefüllte Karteikarte Rezept

source: Entering Recipe Ingredients
de: Eingabe der Zutaten für ein Rezept

source: To enter the recipe ingredients, click on the <guilabel>Ingredients</guilabel> tab. By default, the radio button beside the label <guilabel>Ingredient:</guilabel> is selected. However, <emphasis>&krecipes;</emphasis> also allows the entry of a <guilabel>Header:</guilabel> by selecting the radio button beside this label.
de: Um die Zutaten für ein Rezept einzugeben, klicken Sie auf den Karteireiter <guilabel>Zutaten</guilabel>. Als Voreinstellung ist der Auswahlknopf <guilabel>Zutaten</guilabel> ausgewählt. Es kann jedoch auch eine <guilabel>Kopfzeile</guilabel> in <emphasis>&krecipes;</emphasis>, indem Sie auf den Auswahlknopf neben dieser Beschriftung klicken.

source: Ingredients are entered by filling in the appropriate text box under the headings &mdash;
de: Zutaten werden durch Ausfüllen des passenden Textfelds unter den Überschriften eingegeben

source: Ingredient: &ndash; the ingredient is entered here, for example, Sugar
de: Zutaten &ndash; Die Zutaten werden hier eingegeben, zum Beispiel Zucker

source: The Ingredient can also be selected from the <quote>drop-down</quote> menu.
de: Die Zutat kann außerdem auch im <quote>Auswahlfeld</quote> eingestellt werden.

source: Amount: &ndash; the amount of the ingredient required, for example, &#189; or 1-2 --> note that <emphasis>&krecipes;</emphasis> will allow the entry of ranges for ingredients
de: Menge: &ndash; Die Menge der erforderlichen Zutat, zum Beispiel &#189; oder 1-2. Beachten Sie, dass in &krecipes; auch Bereiche für Zutaten eingegeben werden können.

source: Unit: &ndash; the unit of measurement, for example, <emphasis>teaspoon</emphasis>
de: Einheit: &ndash; die Maßeinheit, zum Beispiel <emphasis>Teelöffel</emphasis>

source: A drop-down menu is also available for selecting a <guilabel>Type:</guilabel> for the new unit. Choices for this are: &nbsp;
de: Es gibt auch ein Auswahlfeld für die Einstellung des <guilabel>Typ</guilabel>s für eine neue Einheit. Folgende Möglichkeiten stehen zur Auswahl:

source: Mass, for those units that are based on weight, for example, pound
de: Masse, für Einheiten mit einem Gewicht wie zum Beispiel Gramm oder Pfund

source: Volume, for those units that are based on a volume measure, for example teaspoon, fluid ounce, or cup
de: Volumen, für Einheiten, die ein Volumen angeben wie Tasse oder Liter

source: Preparation Method: &ndash; the method of preparing the ingredient, for example, <emphasis>chopped</emphasis>
de: Zubereitungsmethode: &ndash; Die Art der Zubereitung der Zutat wie zum Beispiel <emphasis>gehackt</emphasis>.

source: The Preparation Method can also be selected from a drop-down menu.
de: Die Zubereitungsmethode kann außerdem in einem Auswahlfeld eingestellt werden.

source: <emphasis>&krecipes;</emphasis> will accept multiple preparation methods in a comma-separated list, for example, <emphasis>peeled,chopped</emphasis>
de: <emphasis>&krecipes;</emphasis> akzeptiert mehrere Zubereitungsmethoden in einer durch Komma getrennten Liste wie zum Beispiel <emphasis>geschält, gehackt</emphasis>

source: To add the ingredient(s) to the ingredient list, simply press the &Enter; key.
de: Um Zutaten zur Liste hinzuzufügen, drücken Sie die Taste &Enter;.

source: Alternatively, click on the <guibutton>Add Ingredient</guibutton> button on the right-hand side of the ingredient list.
de: Klicken Sie alternativ auf den Knopf <guibutton>Zutat hinzufügen</guibutton> auf der rechten Seite der Zutatenliste.

source: If a particular field is not required to describe an ingredient <emphasis>it can be left blank</emphasis>!
de: Wenn ein gestimmtes Feld für die Beschreibung einer Zutat nicht erforderlich ist, kann es <emphasis>freigelassen</emphasis> werden.

source: An ingredient may be removed from the list by clicking on the <guiicon><inlinemediaobject><imageobject><imagedata fileref="list-remove.png" format="PNG"/></imageobject></inlinemediaobject></guiicon> button to the right of the ingredient list.
de: Eine Zutat kann aus der Liste entfernt werden, indem Sie auf den Knopf <guiicon><inlinemediaobject><imageobject><imagedata fileref="list-remove.png" format="PNG"/></imageobject></inlinemediaobject></guiicon> rechts neben der Zutatenliste klicken.

source: An ingredient may also be repositioned in the list by clicking on the <guiicon><inlinemediaobject><imageobject><imagedata fileref="up.png" format="PNG"/></imageobject></inlinemediaobject></guiicon> or the <guiicon><inlinemediaobject><imageobject><imagedata fileref="go-down.png" format="PNG"/></imageobject></inlinemediaobject></guiicon> button that appear on the right of the ingredient list.
de: Eine Zutat kann auch neu in der Liste angeordnet werden, indem Sie auf die Köpfe <guiicon><inlinemediaobject><imageobject><imagedata fileref="up.png" format="PNG"/></imageobject></inlinemediaobject></guiicon> oder <guiicon><inlinemediaobject><imageobject><imagedata fileref="go-down.png" format="PNG"/></imageobject></inlinemediaobject></guiicon> rechts neben der Zutatenliste klicken.

source: Here's a screenshot of the completed Ingredients tab in the &krecipes; recipe entry interface.
de: Bildschirmfoto der Karteikarte Zutaten in der Rezepteingabe von &krecipes;

source: Entering Ingredients &ndash; Ranges for the <emphasis>Amount</emphasis> and Alternate Ingredients are permitted
de: Eingabe von Zutaten &ndash; Bereiche für die <emphasis>Menge</emphasis> und alternative Zutaten sind erlaubt

source: Looking After Nutrients
de: Suche nach Nahrungsmitteln

source: This dialog is telling you that, for the ingredient <emphasis>apples</emphasis>, there are two possible reasons for the property or <emphasis>nutrient</emphasis> information being incomplete: &mdash;
de: Dieser Dialog zeigt an, dass es zwei mögliche Gründe dafür gibt, dass die Eigenschaften oder Information über <emphasis>Nahrungsmittel</emphasis> für die Zutat <emphasis>Äpfel</emphasis> unvollständig sind &mdash;

source: An ingredient weight or nutrient information has not been provided.
de: Ein Gewicht der Zutat oder Nahrungsmittelinformationen sind nicht bereit gestellt worden.

source: <para>or,</para>
de: <para>oder,</para>

source: Conversion information is lacking.
de: Informationen zur Umwandlung fehlen.

source: We can use the following table to assist in making a correction for apples.
de: Folgende Tabelle kann als Hilfe zur Korrektur der Äpfel benutzt werden.

source: Measure
de: Maßeinheit

source: Diameter
de: Durchmesser

source: Equivalent 1
de: Äquivalent 1

source: Equivalent 2
de: Äquivalent 2

source: Equivalent 3
de: Äquivalent 3

source: Equivalent 4
de: Äquivalent 4

source: 1 large apple
de: 1 großer Apfel

source: 2 cups, sliced or chopped
de: 2 Tassen, geschnitten oder gehackt

source: 1 1/2 cups, finely chopped
de: 1 1/2 Tassen, fein gehackt

source: 1 1/4 cups, grated
de: 1 1/4 Tassen, gerieben

source: 3/4 cups, sauce
de: 3/4 Tasse, Mus

source: 1 medium apple
de: 1 mittlerer Apfel

source: 1 1/3 cups, sliced or chopped
de: 1 1/3 Tassen, geschnitten oder gehackt

source: 1 cup, finely chopped
de: 1 Tasse, fein gehackt

source: 3/4 cup, grated
de: 3/4 Tasse, gerieben

source: 1/2 cup, sauce
de: 1/2 Tasse, Mus

source: 1 small apple
de: 1 kleiner Apfel

source: 3/4 cup, sliced or chopped
de: 3/4 Tasse, geschnitten oder gehackt

source: 3/4 cup, finely chopped
de: 3/4 Tasse, fein gehackt

source: 1/2 cup, grated
de: 1/2 Tasse, gerieben

source: 1/3 cup, sauce
de: 1/3 Tasse, Mus

source: 1 pound apples
de: 1 Pfund Äpfel

source: 2 large apples
de: 2 große Äpfel

source: 3 medium apples
de: 3 mittlere Äpfel

source: 4 small apples
de: 4 kleine Äpfel

source: Information for the compilation of the above table can be found at <ulink url="http://www.usapple.org/consumers/appleguide/equivalents.cfm"></ulink>.
de: Informationen über die Zusammenstellung der oben genannten Tabelle finden Sie auf <ulink url="http://www.usapple.org/consumers/appleguide/equivalents.cfm"></ulink>.

source: Choose to enter a weight for <emphasis>melted butter</emphasis> in your weight table
de: Geben Sie ein Gewicht für <emphasis>geschmolzene Butter</emphasis> in Ihrer Gewichtstabelle ein.

source: Accept the approximation, in which case, your status <emphasis>LED</emphasis> will remain yellow
de: Akzeptieren Sie die Näherung, dann bleibt die Status-<emphasis>LED</emphasis> gelb

source: Remove the preparation method from <emphasis>butter</emphasis>, if it will not adversely affect the preparation of your recipe.
de: Wenn Sie die Zubereitungsmethode für <emphasis>Butter</emphasis> entfernen, ist die Zubereitung für Ihr Rezept nicht betroffen.

source: The <guibutton>Help</guibutton> button will connect you to this section of the <emphasis>&krecipes;</emphasis> Handbook.
de: Der Knopf <guibutton>Hilfe</guibutton> öffnet diesen Abschnitt des Handbuchs zu <emphasis>&krecipes;</emphasis>

source: Copying Recipes from Other Sources
de: Rezepte aus anderen Quellen kopieren

source: Do you need an easy method of getting recipe ingredients into <emphasis>&krecipes;</emphasis>? You can do that with the <emphasis>Copy/Paste</emphasis> functionality!
de: Suchen Sie eine einfache Methode, um Rezepte in <emphasis>&krecipes;</emphasis> einzufügen? Dann verwenden Sie die Funktion <emphasis>Kopieren und Einfügen</emphasis>.

source: Click the <guibutton>OK</guibutton> button that appears in the top right-hand corner of window to transfer your ingredients to your recipe. You can also choose not to proceed with the addition of the ingredients by clicking on the <guibutton>Cancel</guibutton> button which will close the window.
de: Klicken Sie auf den Knopf <guibutton>OK</guibutton> rechts oben im Fenster, um Ihre Zutaten in das Rezept zu übertragen. Wenn Sie keine Zutaten hinzufügen möchten, klicken Sie auf den Knopf <guibutton>Abbrechen</guibutton>, damit wird das Fenster geschlossen.

source: Here's a screenshot of the edited ingredients in the &krecipes; Parser interface.
de: Bildschirmfoto der bearbeiteten Zutaten im Dialog Zutaten-Analyse von &krecipes;.

source: The Completed Ingredient Parser
de: Die abgeschlossene Zutaten-Analyse

source: Entering the Recipe Instructions
de: Anweisungen für die Zubereitung eines Rezepts

source: To enter the recipe instructions, click on the <guilabel>Instructions</guilabel> tab.
de: Um Anweisungen für die Zubereitung einzugeben, klicken Sie auf Karteireiter <guilabel>Zubereitung</guilabel>.

source: Here's a screenshot of the completed Instructions tab in the &krecipes; recipe entry interface.
de: Bildschirmfoto der Karteikarte Zubereitung in der Rezepteingabe von &krecipes;

source: New Recipe Entry &ndash; The Completed Instructions Tab
de: Eingabe eines neuen Rezepts &ndash; Die ausgefüllte Karteikarte Zubereitung

source: Adding Recipe Ratings
de: Bewertungen für Rezepte hinzufügen

source: Taste
de: Geschmack

source: Appearance
de: Erscheinungsbild

source: Ease of Preparation
de: Schwierigkeitsgrad der Zubereitung

source: Originality
de: Originalität

source: Overall
de: Insgesamt

source: Initially, in the <guilabel>Ratings</guilabel> tab, there is only a blank screen with the <guibutton>Add Rating...</guibutton> button at the bottom. Clicking this button will start the interface for entering ratings.
de: Anfangs gibt es auf der Karteikarte <guilabel>Bewertung</guilabel> nur ein leeres Fenster mit dem Knopf <guibutton>Bewertung hinzufügen ...</guibutton> unten. Klicken Sie auf diesen Knopf, um eine Bewertung einzugeben.

source: The <emphasis>Ratings</emphasis> interface is comprised of the following elements &mdash;
de: Der Dialog <emphasis>Bewertung</emphasis> besteht aus folgenden Elementen &mdash;

source: Rater: &ndash; this is the name of the person providing their opinion of the recipe
de: Bewerter &ndash; Dies ist der Name der Person, die das Urteil über das Rezept abgegeben hat.

source: To complete this element <userinput>enter the rater's name</userinput> in the text box that appears beside the label <guilabel>Rater:</guilabel>.
de: Geben Sie hier den <userinput>Namen des Bewerters</userinput> im Textfeld neben der Beschriftung <guilabel>Bewerter</guilabel> ein.

source: Criteria: &ndash; this is the criteria on which the recipe is rated
de: Kriterien: &ndash; Das Kriterium, nach dem das Rezept bewertet wird

source: Stars: &ndash; this is the number of stars that you wish to assign to the particular criteria that you are rating on
de: Sterne: &ndash; Die Anzahl der Sterne, die Sie dem bestimmten Kriterium als Bewertung zuweisen möchten

source: To enter a comment, simply position your cursor in the white space beneath the <guilabel>Comments:</guilabel> label and begin typing.
de: Um einen Kommentar einzugeben, setzen Sie den Cursor in den Bereich unter der Beschriftung <guilabel>Kommentare:</guilabel> und beginnen Sie die Eingabe.

source: Here's a screenshot of the completed Ratings tab in the &krecipes; recipe entry interface.
de: Bildschirmfoto der Karteikarte Bewertungen in der Rezepteingabe von &krecipes;

source: New Recipe Entry &ndash; The Completed Ratings Tab
de: Eingabe eines neuen Rezepts &ndash; Die ausgefüllte Karteikarte Bewertung

source: Recipe Actions
de: Aktionen für Rezepte

source: OK! Now that the recipe has been input, what needs to be done?
de: Das Rezept ist nun eingegeben, wie geht es weiter?

source: The following options can be selected &mdash;
de: Folgende Einstellungen können ausgewählt werden &mdash;

source: Spell-check &ndash; this is accomplished by selecting <guilabel>Check Spelling</guilabel> from the context menu of the input area in the <guilabel>Instructions</guilabel> tab
de: Rechtschreibprüfung &ndash; Dies erreichen Sie durch die Auswahl von <guilabel>Rechtschreibprüfung</guilabel> aus dem Kontextmenü des Eingabebereichs in der Karteikarte <guilabel>Zubereitung</guilabel>.

source: Save &ndash; click on the <guibutton>Save recipe</guibutton> button that appears on the bottom of the screen
de: Speichern &ndash; Drücken Sie den Knopf <guibutton>Rezept speichern</guibutton> unter den Karteikarten

source: The <guibutton>Save recipe</guibutton> button can be used to save the recipe at any point during the input. As with any other application, when editing, it is always a good idea to save frequently!
de: Mit dem Knopf <guibutton>Rezept speichern</guibutton> können Sie jederzeit bei der Eingabe Ihre Daten speichern. Dies sollten Sie auch regelmäßig vornehmen.

source: Show recipe &ndash; click on the <guibutton>Show recipe</guibutton> button to view the recipe
de: Rezept anzeigen &ndash; Drücken Sie den Knopf <guibutton>Rezept anzeigen</guibutton> unter den Karteikarten, um das Rezept zu betrachten

source: To view a recipe, it must be saved. If the recipe has NOT been saved at the time that the <guibutton>Show recipe</guibutton> button is clicked, the following alert will appear &mdash;
de: Um ein Rezept anzuzeigen, muss es zuerst gespeichert werden. Wurde das Rezept noch nicht gespeichert, wenn Sie auf den Knopf <guibutton>Rezept anzeigen</guibutton> klicken, erscheint folgender Dialog:

source: You need to save the recipe before displaying it. Would you like to save it now?
de: Das Rezept muss vor dem Anzeigen gespeichert werden. Möchten Sie es jetzt speichern?

source: Click the <guibutton>Yes</guibutton> button to save the recipe, or the <guibutton>No</guibutton> button to close the dialog and return to the recipe entry interface.
de: Klicken Sie auf <guibutton>Ja</guibutton>, um das Rezept zu speichern, oder auf <guibutton>Nein</guibutton>, um den Dialog zu schließen und zur Rezepteingabe zurückzugehen.

source: Close &ndash; click the <guibutton>Close</guibutton> button
de: Schließen &ndash; Klicken Sie auf den Kopf <guibutton>Schließen</guibutton>

source: Again, if the recipe has not been saved an alert will appear stating &mdash;
de: Wenn das Rezept noch nicht gespeichert ist, wird ein Dialog mit folgender Warnung angezeigt:

source: This recipe contains unsaved changes. Would you like to save it before closing?
de: Das Rezept enthält nicht gespeicherte Änderungen. Möchten Sie es vor dem Schließen speichern?

source: Resize &ndash; click the <guibutton>Resize recipe</guibutton> button to resize the recipe
de: Rezept anzeigen &ndash; Drücken Sie den Knopf <guibutton>Rezept anzeigen</guibutton> unter den Karteikarten, um das Rezept zu betrachten

source: The recipe can be resized by either of two methods &mdash;
de: Die Größe des Rezepts kann durch eine der beiden Methoden geändert werden &mdash;

source: Scale by yield &mdash;
de: Anpassen nach Portionen &mdash;

source: Scale by factor &mdash;
de: Anpassen nach Faktor &mdash;

source: Editing Saved Recipes
de: Bearbeiten von gespeicherten Rezepten

source: The feature for editing recipes can be accessed in a number of ways. With the <emphasis>Find/Edit Recipes</emphasis> component selected,
de: Die Funktion zum zum Bearbeiten von Rezepten erreichen Sie auf verschiedenen Wegen, wenn die Komponente <emphasis>Rezept suchen/bearbeiten</emphasis> ausgewählt ist.

source: Select the recipe to be edited from the recipe list in the main portion of the <emphasis>&krecipes;</emphasis> window. Click the <guibutton>Edit Recipe</guibutton> button.
de: Wählen Sie das Rezept zur Bearbeitung aus der Rezeptliste im Hauptbereich des <emphasis>&krecipes;</emphasis>-Fenster. Klicken Sie auf den Knopf <guibutton>Rezepte bearbeiten</guibutton>.

source: All aspects of the recipe can now be edited &mdash;
de: Alle Einzelheiten eines Rezepts können jetzt geändert werden &mdash;

source: the preparation directions from the <guilabel>Instructions</guilabel> tab
de: Die Richtung der Vorbereitung von der Karteikarte <guilabel>Zubereitung</guilabel>

source: As with entering a new recipe, the buttons <guibutton>Save Recipe</guibutton>, <guibutton>Show Recipe</guibutton>, <guibutton>Close</guibutton> and <guibutton>Resize Recipe</guibutton> are available from each of the tabs
de: Wie bei der Eingabe eines neuen Rezepts sind die Knöpfe <guibutton>Rezept speichern</guibutton>, <guibutton>Rezept anzeigen</guibutton>, <guibutton>Schließen</guibutton> und <guibutton>Rezeptgröße ändern</guibutton> auf jeder Karteikarte verfügbar.

source: Select <guimenu>Edit</guimenu> and then, <guimenuitem>Edit Recipe</guimenuitem> from the <emphasis>&krecipes;</emphasis> menu
de: Wählen Sie <guimenu>Bearbeiten</guimenu> und dann <guimenuitem>Rezepte bearbeiten</guimenuitem> aus dem Menü von <emphasis>&krecipes;</emphasis>.

source: Press the <keycombo action="simul">&Ctrl;<keycap>E</keycap></keycombo> key combination
de: Drücken Sie die Tastenkombination <keycombo action="simul">&Ctrl;<keycap>E</keycap></keycombo>

source: <title>Page Setup</title>
de: <title>Seiteneinrichtung</title>

source: To access Page Setup, select <guimenu>Settings</guimenu> and <guimenuitem>Page Setup...</guimenuitem> from the <emphasis>&krecipes;</emphasis> menu bar.
de: Um den Dialog zur Einrichtung der Seiten zu öffnen, wählen Sie <menuchoice><guimenu>Einstellungen</guimenu><guimenuitem>Seiteneinstellungen ...</guimenuitem></menuchoice> aus der Menüleiste von <emphasis>&krecipes;</emphasis>.

source: Here's a screenshot of the Page Setup dialog
de: Bildschirmfoto des Dialogs zur Seiteneinrichtung

source: <para>Page Setup</para>
de: <para>Seiteneinrichtung</para>

source: An Overview of Page Setup
de: Übersicht der Seiteneinrichtung

source: In the <interface>Page Setup</interface> window, the toolbar displays the icons for <guiicon>Open</guiicon>, <guiicon>Save</guiicon>, <guiicon>Save As</guiicon> and <guiicon>Revert</guiicon> and a drop down box <guilabel>Show Items</guilabel>.
de: Im Dialog <interface>Seiteneinrichtung</interface> enthält die Werkzeugleiste Symbole für die Aktionen <guiicon>Öffnen</guiicon>, <guiicon>Speichern</guiicon>, <guiicon>Speichern unter</guiicon> und <guiicon>Zuletzt gespeicherte Fassung</guiicon> und ein Auswahlfeld <guilabel>Einträge anzeigen</guilabel>.

source: Selecting Items to Display
de: Elemente zur Ansicht auswählen

source: The drop down box on the toolbar allows access to a list of items that are available for display in the recipe. These include &mdash;
de: Im Auswahlfeld in der Werkzeugleiste erhalten Sie Zugriff auf die Einträge, die zur Anzeige im Rezept verfügbar sind. Folgende Einträge sind vorhanden:

source: <guimenuitem>Authors</guimenuitem> &ndash; The authors or contributors of the recipe
de: <guimenuitem>Autoren</guimenuitem> &ndash; Die Autoren des Rezepts

source: <guimenuitem>Categories</guimenuitem> &ndash; The category to which the recipe belongs
de: <guimenuitem>Kategorien</guimenuitem> &ndash; Die Kategorie, in die das Rezept gehört

source: <guimenuitem>Ingredients</guimenuitem> &ndash; The list of recipe ingredients
de: <guimenuitem>Zutaten</guimenuitem> &ndash; Die Liste der Zutaten des Rezepts

source: <guimenuitem>Instructions</guimenuitem> &ndash; The steps for preparing the recipe
de: <guimenuitem>Zubereitung</guimenuitem> &ndash; Die Schritte für die Zubereitung des Rezepts

source: <guimenuitem>Photo</guimenuitem> &ndash; To display a photo in the recipe
de: <guimenuitem>Foto</guimenuitem> &ndash; Zur Anzeige eines Bilds im Rezept

source: <guimenuitem>Properties</guimenuitem> &ndash; The list of nutrients in the recipe
de: <guimenuitem>Eigenschaften</guimenuitem> &ndash; Die Liste der Nahrungsmittel im Rezept

source: <guimenuitem>Preparation Time</guimenuitem> &ndash; The time for preparation
de: <guimenuitem>Zubereitungszeit</guimenuitem> &ndash; Die Zeit für die Zubereitung

source: <guimenuitem>Ratings</guimenuitem> &ndash; The ratings given to the recipe
de: <guimenuitem>Bewertungen</guimenuitem> &ndash; Die eingegebenen Bewertungen für das Rezept

source: <guimenuitem>Title</guimenuitem> &ndash; The title of the recipe
de: <guimenuitem>Titel</guimenuitem> &ndash; Der Titel des Rezepts

source: <guimenuitem>Yield</guimenuitem> &ndash; The yield amount expected from the recipe
de: <guimenuitem>Portionen</guimenuitem> &ndash; Die Anzahl des Portionen des Rezepts

source: By default, all items are displayed. To prevent display in the recipe, deselect the item by clicking on the check box beside it.
de: In der Voreinstellung werden alle Einträge angezeigt. Um die Anzeige eines Eintrags im Rezept auszublenden, klicken Sie auf das Ankreuzfeld daneben.

source: Changing Attributes
de: Attribute ändern

source: Characteristics of each section can be changed individually.
de: Das Erscheinungsbild jedes Abschnitt kann einzeln geändert werden.

source: Change the <guimenuitem>Background color...</guimenuitem>
de: Änderung der <guimenuitem>Hintergrundfarbe ...</guimenuitem>

source: Change the <guimenuitem>Text color...</guimenuitem>
de: Änderung der <guimenuitem>Textfarbe ...</guimenuitem>

source: Change the <guimenuitem>Font...</guimenuitem>
de: Änderung der <guimenuitem>Schriftart ...</guimenuitem>

source: Under the heading <quote>Style</quote>, a border style can be selected
de: Unter der Überschrift <quote>Stil</quote> kann ein Stil für den Rand ausgewählt werden.

source: Print Setup
de: Druckereinrichtung

source: Printing Your Recipe
de: Ausdrucken Ihres Rezepts
