Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/extragear-utils/krecipes.po
Languages: de

source: When you select <guimenu>File</guimenu> and <guimenuitem>Print</guimenuitem> from the <emphasis>&krecipes;</emphasis> menu bar, the <interface>Print Preview</interface> screen appears, as depicted in the following screenshot.
de: Wenn Sie <guimenu>Datei</guimenu> und <guimenuitem>Drucken</guimenuitem> aus der Menüleiste von &krecipes; auswählen, wird eine <interface>Druckvorschau</interface> wie im folgenden Bildschirmfoto angezeigt.

source: Here's a screenshot of the Print Preview screen.
de: Bildschirmfoto der Druckvorschau

source: The Print Preview Screen
de: Das Druckvorschau-Fenster

source: From the screenshot, you will see that there are various buttons to tune the preview, if you're happy with the result click the <guiicon> <inlinemediaobject> <imageobject> <imagedata fileref="document-print.png" format="PNG"/> </imageobject> </inlinemediaobject> </guiicon> button, otherwise just close the preview window to cancel the print.
de: Im Bildschirmfoto sehen Sie, dass es mehrere Knöpfe zur Anpassung der Vorschau gibt. Sind Sie mit der Anpassung zufrieden, klicken Sie auf den Knopf <guiicon> <inlinemediaobject> <imageobject> <imagedata fileref="document-print.png" format="PNG"/> </imageobject> </inlinemediaobject> </guiicon> oder schließen Sie einfach das Fenster, um den Druck abzubrechen.

source: Importing and Exporting Recipes
de: Rezepte importieren und exportieren

source: <emphasis>&krecipes;</emphasis> allows the import of recipes from a file or from a database. Recipes can also be exported to other formats.
de: <emphasis>&krecipes;</emphasis> kann Rezepte aus einer Datei oder Datenbank importieren. Außerdem können Rezepte in andere Formate exportiert werden.

source: Importing from a File
de: Import aus einer Datei

source: <emphasis>&krecipes;</emphasis> allows the import of recipes from the following formats &mdash;
de: <emphasis>&krecipes;</emphasis> kann Ihre Rezepte aus folgenden Formaten importieren &mdash;

source: <emphasis>&krecipes;</emphasis> &ndash; files of this format will have extensions of .kre or .kreml
de: <emphasis>&krecipes;</emphasis> &ndash; Dateien in diesem Format haben die Erweiterung .kreml

source: MasterCook &ndash; files of this format will have extensions of .mx2 and originate from MasterCook 5 or 6
de: MasterCook &ndash; Dateien in diesem Format haben die Erweiterung mx2 und werden von MasterCook 5 oder 6 verwendet

source: MasterCook Export &ndash; files of this format will have extensions of .mxp or .txt and originate from MasterCook 4
de: MasterCook Export &ndash; Dateien in diesem Format haben die Erweiterung .mxp or .txt und werden von MasterCook 4 verwendet

source: Meal-Master &ndash; files of this format will have extensions of .mmf or .txt
de: Meal-Master &ndash; Dateien in diesem Format haben die Erweiterung .mmf oder .txt

source: <quote>Now You're Cooking</quote> Generic Export &ndash; files of this format will have extensions of .txt
de: <quote>Now You're Cooking</quote> Allgemeines Exportformat &ndash; Dateien in diesem Format haben die Erweiterung .txt

source: RecipeML &ndash; files of this format will have extensions of .xml or .recipeml
de: RecipeML &ndash; Dateien in diesem Format haben die Erweiterung .xml oder recipeml

source: Rezkonv &ndash; files of this format will have extensions of .rk or .txt
de: Rezkonv &ndash; Dateien in diesem Format haben die Erweiterung .rk oder .txt

source: To import a recipe from a file of one of the above formats, select <guimenu>File</guimenu> from the <emphasis>&krecipes;</emphasis> menu bar. From the available choices, select <guimenuitem>Import from File ...</guimenuitem>
de: Um ein Rezept aus einer Datei in einer der oben genannten Rezepte zu importieren, wählen Sie <guimenu>Datei</guimenu> aus der <emphasis>&krecipes;</emphasis>-Menüleiste, dann <guimenuitem>Aus Datei importieren ...</guimenuitem>

source: The <guilabel>Filter:</guilabel> box is used to select the format of the recipe being imported from the drop-down menu.
de: Mit dem Feld <guilabel>Filter:</guilabel> kann das Format des zu importierenden Rezepts im Auswahlfeld eingestellt werden.

source: Here's a screenshot of the Import Recipes screen.
de: Bildschirmfoto des Imports von Rezepten

source: The Import Recipes Window &ndash; this window will appear when you are importing from a file OR from a Database.
de: Das Fenster „Rezept importieren“ &ndash; es wird angezeigt, wenn Sie ein Rezept aus einer Datei oder aus einer Datenbank importieren.

source: Under the heading <guilabel>Recipes</guilabel>, drop-down lists will appear &mdash;
de: Unter der Beschriftung <guilabel>Rezepte</guilabel> finden Sie im Auswahlfeld folgende Einträge:

source: Once you are satisfied with the selection(s) you have made, click the <guibutton>OK</guibutton> button to proceed with the import, or the <guibutton>Cancel</guibutton> button to prevent the import and close the window.
de: Haben Sie die Auswahl richtig eingestellt, klicken Sie auf den Knopf <guibutton>OK</guibutton>, um mit dem Import fortzufahren oder klicken Sie auf <guibutton>Abbrechen</guibutton>, um den Import zu verhindern und den Dialog zu schließen.

source: Importing from a Database
de: Import aus einer Datenbank

source: Importing from SQLite
de: Import aus SQLite

source: Here's a screenshot of the import dialog when importing from an SQLite database.
de: Bildschirmfoto des Imports aus einer SQLite-Datenbank.

source: Importing from an SQLite Database
de: Import aus einer SQLite-Datenbank

source: Importing from MySQL
de: Import aus MySQL

source: Here's a screenshot of the import dialog when importing from a MySQL database.
de: Bildschirmfoto des Imports aus einer MySQL-Datenbank.

source: Importing from a MySQL Database (The same interface would appear if the PostgreSQL radio button was selected.)
de: Import aus einer MySQL- oder PostgreSQL-Datenbank.

source: Username:
de: Benutzername:

source: Password:
de: Passwort:

source: Database name:
de: Datenbankname:

source: Importing from PostgreSQL
de: Import aus PostgreSQL

source: Steps Common to All Database Imports
de: Gemeinsame Schritte für alle Importe aus Datenbanken

source: Exporting Recipes to Other Formats
de: Rezepte in andere Formate exportieren

source: <emphasis>&krecipes;</emphasis> can export your recipes to the following formats &mdash;
de: <emphasis>&krecipes;</emphasis> kann Ihre Rezepte in folgenden Formaten exportieren &mdash;

source: Compressed &krecipes; format &ndash; files of this format will have extensions of .kre
de: Komprimiertes &krecipes;-Format &ndash; Dateien in diesem Format haben die Erweiterung .kre

source: &krecipes; &ndash; files of this format will have extensions of .kreml
de: &krecipes; &ndash; Dateien in diesem Format haben die Erweiterung .kreml

source: Plain Text &ndash; files of this format will have extensions of .txt
de: Einfacher Text &ndash; Dateien in diesem Format haben die Erweiterung .txt

source: Web Book &ndash; files of this format will have extensions of .html
de: Webbuch &ndash; Dateien in diesem Format haben die Erweiterung .html

source: Once exported in Web Book format, you are unable to import these recipes back into <emphasis>&krecipes;</emphasis>.
de: Im Format Webbuch exportierte Rezepte können nicht wieder zurück in <emphasis>&krecipes;</emphasis> importiert werden.

source: Web page &ndash; files of this format will have extensions of .html
de: Webseite &ndash; Dateien in diesem Format haben die Erweiterung .html

source: However, it should be noted that once exported in Web page format, you are unable to import these recipes back into <emphasis>&krecipes;</emphasis>.
de: Im Format Webseite exportierte Rezepte können nicht wieder zurück in <emphasis>&krecipes;</emphasis> importiert werden.

source: RecipeML &ndash; files of this format will have extensions of .xml
de: RecipeML &ndash; Dateien in diesem Format haben die Erweiterung .xml

source: Rezkonv &ndash; files of this format will have extensions of .rk
de: Rezkonv &ndash; Dateien in diesem Format haben die Erweiterung .rk

source: To export a single recipe to one of the above formats, first select the recipe that you wish to export. Then, select <guimenu>File</guimenu> from the <emphasis>&krecipes;</emphasis> menu bar. From the available choices, select <guimenuitem>Export ...</guimenuitem>
de: Um ein einzelnes Rezept in eines der oben genannten Formate zu exportieren, müssen Sie zuerst ein Rezept auswählen. Wählen Sie dann <menuchoice><guimenu>Datei</guimenu><guimenuitem>Exportieren ...</guimenuitem></menuchoice> aus der Menüleiste von &krecipes;.

source: The <guilabel>Filter:</guilabel> box is used to select the format that you wish to use for the exported recipe from the drop-down menu.
de: Mit dem Feld <guilabel>Filter:</guilabel> kann das Format des zu exportierenden Rezepts im Auswahlfeld eingestellt werden.

source: Backing Up and Restoring Your <emphasis>&krecipes;</emphasis> Database
de: Sicherung und Wiederherstellung Ihrer <emphasis>&krecipes;</emphasis>-Datenbank

source: Backing Up Your <emphasis>&krecipes;</emphasis> Database
de: Sicherung Ihrer <emphasis>&krecipes;</emphasis>-Datenbank

source: Restoring Your <emphasis>&krecipes;</emphasis> Database
de: Wiederherstellung Ihrer <emphasis>&krecipes;</emphasis>-Datenbank

source: As with the backup function, the text box beside the <guilabel>Filter:</guilabel> label shows the type of file as <emphasis>&krecipes; Backup File (*.krecbk)</emphasis>.
de: Wie bei der Sicherung wird im Textfeld <guilabel>Filter:</guilabel> als Dateityp <emphasis>&krecipes;-Datensicherungsdatei (*.krecbk)</emphasis> angezeigt.

source: Once you have selected your backup file, click the <guibutton>Open</guibutton> button to initiate the restore or the <guibutton>Cancel</guibutton> button to close the window and return to the main <emphasis>&krecipes;</emphasis> interface.
de: Haben Sie Ihre Sicherungsdatei ausgewählt, klicken Sie auf <guibutton>Öffnen</guibutton>, um die Wiederherstellung zu starten, oder auf <guibutton>Abbrechen</guibutton>, um das Fenster zu schließen und zurück zum Hauptfenster von &krecipes; zu gehen.

source: Here's a screenshot of the warning that appears when restoring the &krecipes; database.
de: Ein Bildschirmfoto der Warnung bei der Wiederherstellung der &krecipes;-Datenbank.

source: Restoring Your Database &ndash; Erase Warning
de: Wiederherstellung Ihrer Datenbank &ndash; Warnung zum Löschen

source: Other &krecipes; Components
de: Weitere Komponenten von &krecipes;

source: The Shopping List
de: Die Einkaufsliste

source: Here's a screenshot of the &krecipes; Shopping List component.
de: Bildschirmfoto der Komponente „Einkaufsliste“ von &krecipes;

source: The Shopping List Component
de: Die Komponente „Einkaufsliste“

source: When selected, the component title appears at the top in the right pane of the window.
de: Ist dies ausgewählt, erscheint der Titel der Komponente oben im rechten Teil des Fensters.

source: Below this is a text box to <userinput>enter the specific name of a recipe</userinput> to search for. Recipes can also be chosen by selecting them from the list. Either way, the selected recipe must by transferred to the right-hand side of the screen under the heading <guilabel>Shopping List</guilabel> by clicking on the <guiicon><inlinemediaobject><imageobject><imagedata fileref="go-next.png" format="PNG"/></imageobject></inlinemediaobject></guiicon> button between the two portions of the screen.
de: Darunter ist ein Textfeld, um <userinput>einen bestimmten Namen eines Rezepts</userinput> für die Suche einzugeben. Rezepte können auch aus der Liste ausgewählt werden. Das ausgewählte Rezept muss in beiden Fällen auf die rechte Seite des Fensters unter die Überschrift <guilabel>Einkaufsliste</guilabel> verschoben werden, indem Sie auf den Knopf <guiicon><inlinemediaobject><imageobject><imagedata fileref="go-next.png" format="PNG"/></imageobject></inlinemediaobject></guiicon> zwischen den beiden Teilen des Fensters klicken.

source: Once the desired recipes have been transferred to the shopping list side of the screen, click the <guibutton>OK</guibutton> button.
de: Wurden alle gewünschten Rezepte in die Einkaufsliste im Fenster verschoben, klicken Sie auf den Knopf <guibutton>OK</guibutton>.

source: When all desired changes have been made to the ingredients for the recipe(s) selected, click the <guibutton>Done</guibutton> button and the <interface>Shopping List</interface> will display.
de: Wurden alle gewünschten Änderungen der Zutaten für die ausgewählten Rezepte, klicken Sie auf <guibutton>Fertig</guibutton> und die <interface>Einkaufsliste</interface> wird angezeigt.

source: From the <interface>Shopping List</interface> window, click the <guibutton>Print</guibutton> button to print the shopping list, or click the <guibutton>Close</guibutton> button to close the window.
de: Im Dialog <interface>Einkaufsliste</interface> klicken Sie auf <guibutton>Drucken</guibutton>, um die Liste auszudrucken, oder benutzen Sie den Knopf <guibutton>Schließen</guibutton>, um den Dialog zu beenden.

source: The Diet Helper
de: Der Diäthelfer

source: Here's a screenshot of the &krecipes; Diet Helper component.
de: Bildschirmfoto der Komponente „Diäthilfe“ von &krecipes;

source: The Diet Helper Component
de: Die Komponente „Diäthilfe“

source: To start setting up your menus, the first thing your have to do is select the number of days that you are planning for and the number of meals per day.
de: Um Ihre Diät zu planen, müssen Sie als erstes die Anzahl der Tage und die Mahlzeiten je Tag auswählen.

source: The next step is to specify the number of dishes per meal. This is done by using the spinbox beside the <guilabel>No. of dishes:</guilabel> label to adjust the number.
de: Als nächstes müssen Sie die Anzahl der Gerichte je Mahlzeit einstellen. Benutzen Sie dazu das Drehfeld.

source: 1st Course
de: Erster Gang

source: 2nd Course
de: Zweiter Gang

source: Dessert
de: Nachtisch

source: And for subsequent meals &mdash;
de: Und für weitere Gerichte &mdash;

source: <guilabel>Dish 4</guilabel>, <guilabel>Dish 5</guilabel>, etc.
de: <guilabel>Gericht 4</guilabel>, <guilabel>Gericht 5</guilabel>, usw.

source: Planning Menus
de: Menüs planen

source: Planning Diet-Conscious Menus
de: Ernährungsbewusste Menüs planen

source: All the steps listed in the section <link linkend="menu-plan-only">Planning Menus</link> also apply here. This section will discuss the incorporation of nutrient values into your menus.
de: Alle Schritte im Abschnitt <link linkend="menu-plan-only">Menüs planen</link> treffen auch hier zu. In diesem Abschnitt wird die Aufnahme von Nahrungsmittelwerten in Ihre Menüs behandelt.

source: Before you can include nutrients in your menu plan, you must ensure the following &mdash;
de: Ehe Sie Nahrungsmittel in Ihren Essensplan aufnehmen können, müssen Sie folgendes beachten:

source: At any point in the process of planning a menu/diet, you can click the <guibutton>Clear</guibutton> button to clear all entries and begin again.
de: An jeder Stelle der Eingabe zur Planung eines Menüs oder einer Diät, klicken Sie auf den Knopf <guibutton>Löschen</guibutton>, um alle Eingaben zu entfernen und neu zu beginnen.

source: Once you have completed entering all the nutrient information, click the <guibutton>Create the diet</guibutton> button to create your menu/diet.
de: Haben Sie alle Informationen für ein Nahrungsmittel vollständig eingegeben, klicken Sie auf den Knopf <guibutton>Diät erstellen</guibutton>, um das Menü oder die Diät zu erstellen.

source: The Ingredient Matcher
de: Die Zutaten-Übereinstimmung

source: Here's a screenshot of the &krecipes; Ingredient Matcher component.
de: Bildschirmfoto der Komponente „Zutaten-Übereinstimmung“ von &krecipes;

source: The Ingredient Matcher Component
de: Die Komponente „Zutaten-Übereinstimmung“

source: The Data Button
de: Der Knopf <guibutton>Daten</guibutton>

source: The <guibutton>Data</guibutton> button performs one simple function &ndash; when clicked, it gives access to additional components.
de: Mit dem Knopf <guibutton>Daten</guibutton> erhalten Sie Zugriff auf zusätzliche Komponenten.

source: When the additional components are revealed, click the <guibutton>Up</guibutton> button to return to the previous list.
de: Klicken Sie auf den Knopf <guibutton>Nach oben</guibutton>, um wieder zur vorherigen Liste zurückzugehen.

source: <title>The Ingredients Component</title>
de: <title>Die Komponente „Zutaten“</title>

source: The <emphasis>Ingredients</emphasis> component is accessed by first, clicking on the <guibutton>Data</guibutton> button to reveal the additional <emphasis>&krecipes;</emphasis> components, and then, clicking on the <guibutton>Ingredients</guibutton> button.
de: Den Dialog <emphasis>Zutaten</emphasis> öffnen Sie durch Klicken auf den Knopf <guibutton>Daten</guibutton>, um die zusätzlichen Komponenten von <emphasis>&krecipes;</emphasis> anzuzeigen. Wählen Sie dann den Knopf <guibutton>Zutaten</guibutton>.

source: Beside the heading is a text box to <userinput>enter an ingredient</userinput> to search for in the ingredient list.
de: Neben der Überschrift gibt es ein Textfeld, um <userinput>eine Zutat einzugeben</userinput> und danach in der Zutatenliste zu suchen.

source: To the right of this component is a <guiicon><inlinemediaobject> <imageobject><imagedata fileref="list-add.png" format="PNG"/></imageobject> </inlinemediaobject></guiicon> button, for adding ingredients to the list, and a <guiicon><inlinemediaobject><imageobject><imagedata fileref="list-remove.png" format="PNG"/></imageobject></inlinemediaobject></guiicon> button, for removing ingredients. See the section on <link linkend="working-ingredients">Working with Ingredients</link> for more details.
de: Rechts in dieser Komponente finden Sie den Knopf <guiicon><inlinemediaobject> <imageobject><imagedata fileref="list-add.png" format="PNG"/></imageobject> </inlinemediaobject></guiicon>, um Zutaten zur Liste hinzuzufügen, und den Knopf <guiicon><inlinemediaobject><imageobject><imagedata fileref="list-remove.png" format="PNG"/></imageobject></inlinemediaobject></guiicon>, um Zitaten zu entfernen. Weitere Informationen finden Sie im Abschnitt <link linkend="working-ingredients">Umgang mit Zutaten</link>.

source: Below the list there is a button labeled <guilabel>Property Information</guilabel> to edit the property information for the selected ingredient.
de: Unter der Liste gibt es einen Knopf mit der Beschriftung <guilabel>Informationen zur Eigenschaft</guilabel>, um die Eigenschaften der gewählten Zutaten zu bearbeiten.

source: Here's a screenshot of the &krecipes; Ingredients component.
de: Bildschirmfoto der Komponente „Zutaten“ von &krecipes;

source: <para>The Ingredients Component</para>
de: <para>Die Komponente „Zutaten“</para>

source: Editing the ingredient properties
de: Eigenschaften von Zutaten bearbeiten

source: If you select an ingredient from the list and you click the <guilabel>Property Information</guilabel> a new dialog to edit the properties of the selected ingredient will be shown. A label with the text <guilabel>Property information for ...</guilabel> will be displayed on top, below this text there are 3 lists:
de: Wenn Sie eine Zutat aus der Liste wählen und auf <guilabel>Informationen zur Eigenschaft</guilabel> klicken, dann wird ein neuer Dialog zur Bearbeitung der Eigenschaften angezeigt. Oben im Dialog finden Sie den Text <guilabel>Informationen zur Eigenschaft für ...</guilabel>, darunter drei Listen:

source: Here's a screenshot of the dialog to edit the ingredient properties.
de: Bildschirmfoto des Dialogs zur Bearbeitung der Eigenschaften von Zutaten.

source: The dialog to edit the ingredient properties.
de: Der Dialog zur Bearbeitung der Eigenschaften von Zutaten.

source: Ingredient Headers
de: Kopfzeilen der Zutaten

source: <keycombo action="simul">&Ctrl;&Alt;<keycap>N</keycap></keycombo> to create a header
de: <keycombo action="simul">&Ctrl;&Alt;<keycap>N</keycap></keycombo> um eine neue Kopfzeile zu erstellen

source: <keycap>Del</keycap> to delete a header
de: <keycap>Entf</keycap> um eine Kopfzeile zu löschen

source: <keycombo action="simul">&Ctrl;<keycap>R</keycap></keycombo> to rename a header
de: <keycombo action="simul">&Ctrl;<keycap>R</keycap></keycombo> um eine Kopfzeile umzubenennen

source: Working with Ingredients
de: Umgang mit Zutaten

source: Ingredients may be added, removed or edited in the <emphasis>&krecipes;</emphasis> <emphasis>Ingredients</emphasis> component.
de: Zutaten können in der Komponente <emphasis>Zutaten</emphasis> von <emphasis>&krecipes;</emphasis> hinzugefügt, entfernt oder bearbeitet werden.

source: Adding:
de: Hinzufügen:

source: Removing:
de: Entfernen:

source: To remove an ingredient from the list, click on the <guiicon> <inlinemediaobject><imageobject><imagedata fileref="list-remove.png" format="PNG"/></imageobject></inlinemediaobject></guiicon> button that appears beside the ingredient list. The ingredient will be removed <emphasis>provided there are no recipes using that ingredient</emphasis>.
de: Um eine Zutat aus der Liste zu entfernen, klicken Sie auf den Knopf <guiicon> <inlinemediaobject><imageobject><imagedata fileref="list-remove.png" format="PNG"/></imageobject></inlinemediaobject></guiicon> neben der Liste mit den Zutaten. Die Zutat wird entfernt, <emphasis>wenn es keine Rezepte mit diesen Zutaten gibt</emphasis>.

source: Editing:
de: Bearbeiten:

source: Alternatively:
de: Alternativ:

source: Units in Ingredients
de: Einheiten von Zutaten

source: Units can be added by clicking on the <guibutton>+</guibutton> button that appears to the right of the <emphasis>Unit list</emphasis>.
de: Einheiten können hinzugefügt werden, in dem Sie auf den Knopf <guibutton>+</guibutton> rechts neben der <emphasis>Einheitenliste</emphasis> klicken.

source: Properties in Ingredients
de: Eigenschaften von Zutaten

source: As previously stated, for those ingredients that are provided by default in the <emphasis>&krecipes;</emphasis> program, the <emphasis>Properties</emphasis> or nutrient values have been pre-loaded with the USDA values.
de: Wie bereits vorher angemerkt, werden für Zutaten, die in der Voreinstellung im &krecipes;-Programm enthalten sind, die <emphasis>Eigenschaften</emphasis> oder Werten für Nahrungsmittel mit den USDA-Werten ausgefüllt.

source: Adding Ingredient Properties
de: Eigenschaften von Zutaten hinzufügen

source: The new property must be added to <emphasis>EACH</emphasis> ingredient separately.
de: Die neue Eigenschaft muss <emphasis>jeder</emphasis> Zutat einzeln hinzugefügt werden.

source: Removing Ingredient Properties
de: Eigenschaften von Zutaten löschen

source: Working with Ingredient Weights
de: Umgang mit Gewichten von Zutaten

source: Adding Weights to your Ingredients
de: Gewichte für Ihre Zutaten hinzufügen

source: Now, click the <guibutton>OK</guibutton> button to complete the entry of your ingredient weight, or the <guibutton>Cancel</guibutton> button to abort the addition and close the dialog box.
de: Klicken Sie nun auf den Knopf <guibutton>OK</guibutton>, um die Eingabe des Gewichts der Zutat fertigzustellen oder den Knopf <guibutton>Abbrechen</guibutton>, um die Eingabe zu verwerfen und den Dialog zu schließen.

source: Removing Ingredient Weights
de: Gewichte von Zutaten löschen

source: You will also notice a tick box beside the label <guilabel>Do not ask again</guilabel>.
de: Es gibt auch ein Ankreuzfeld neben der Beschriftung <guilabel>Diese Nachfrage nicht mehr anzeigen</guilabel>.

source: Editing Ingredient Weights
de: Gewichte von Zutaten bearbeiten

source: <title>The Properties Component</title>
de: <title>Die Komponente Eigenschaften</title>
