Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/extragear-utils/krecipes.po
Languages: de

source: The <emphasis>&krecipes;</emphasis> Handbook
de: Das Handbuch zu <emphasis>&krecipes;</emphasis>

source: <emphasis>&krecipes;</emphasis> is an application to manage recipes.
de: <emphasis>&krecipes;</emphasis> ist eine Anwendung zur Verwaltung von Rezepten.

source: cookbook
de: Kochbuch

source: recipes
de: Rezepte

source: Introduction
de: Einführung

source: <emphasis>&krecipes;</emphasis> is a program that lets you to manage your recipes, create shopping lists, choose a recipe based on available ingredients and plan your menu/diet in advance.
de: <emphasis>&krecipes;</emphasis> ist ein Programm, um Ihre Rezepte zu verwalten, Einkaufslisten zu erstellen, ein Rezept nach vorhandenen Zutaten auszuwählen und ein Essen oder eine Diät zu planen.

source: Using <emphasis>&krecipes;</emphasis>
de: <emphasis>&krecipes;</emphasis> verwenden

source: Getting Familiar
de: Einführung

source: When <emphasis>&krecipes;</emphasis> starts, the window displays the following components &mdash;
de: Beim Start von <emphasis>&krecipes;</emphasis> wird ein Fenster mit folgenden Komponenten angezeigt &mdash;

source: A menubar containing selections for <guimenu>File</guimenu>, <guimenu>Edit</guimenu>, <guimenu>View</guimenu>, <guimenu>Tools</guimenu>, <guimenu>Settings</guimenu> and <guimenu>Help</guimenu>
de: Eine Menüleiste mit den Einträgen <guimenu>Datei</guimenu>, <guimenu>Bearbeiten</guimenu>, <guimenu>Ansicht</guimenu>, <guimenu>Extras</guimenu>, <guimenu>Einstellungen</guimenu> und <guimenu>Hilfe</guimenu>

source: A toolbar with icons for <guiicon>New</guiicon>, <guiicon>Save</guiicon>, and <guiicon>Print</guiicon>
de: Eine Werkzeugleiste mit Symbolen für die Aktionen <guiicon>Neu</guiicon>, <guiicon>Speichern</guiicon>, und <guiicon>Drucken</guiicon>

source: A left-hand pane containing icons depicting and buttons for access to the various components of <emphasis>&krecipes;</emphasis>
de: Links ein Bereich mit Symbolen und Knöpfen zum Zugriff auf die verschiedenen Komponenten von <emphasis>&krecipes;</emphasis>

source: A right-hand pane, which is the main <emphasis>&krecipes;</emphasis> window, that by default contains a recipe category list
de: Rechts der Hauptbereich von <emphasis>&krecipes;</emphasis>, der als Voreinstellung eine Liste mit Rezeptkategorien enthält

source: Here's a screenshot of the main &krecipes; window.
de: Hier sehen Sie ein Bildschirmfoto vom &krecipes;-Hauptfenster.

source: Screenshot
de: Bildschirmfoto

source: The Main <emphasis>&krecipes;</emphasis> Screen
de: Das Hauptfenster von <emphasis>&krecipes;</emphasis>

source: Finding and Editing Recipes
de: Suchen und Bearbeiten von Rezepten

source: By default, <emphasis>&krecipes;</emphasis> starts with the <emphasis>Find/Edit Recipes</emphasis> component selected in the left pane of the window.
de: Beim Start von <emphasis>&krecipes;</emphasis> ist die Komponente <emphasis>Rezepte suchen/bearbeiten</emphasis> im linken Bereich ausgewählt.

source: This section describes the method of finding recipes in the <emphasis>Find/Edit Recipes</emphasis> component. For more specific details on <emphasis>Editing</emphasis> recipes, see the section <link linkend="edit-recipe">Editing Saved Recipes</link>
de: Dieser Abschnitt beschreibt die Möglichkeiten, mit der Komponente <emphasis>Rezepte suchen/bearbeiten</emphasis> ein Rezept zu finden. Weitere Einzelheiten zur <emphasis>Bearbeitung</emphasis> von Rezepten finden Sie im Abschnitt <link linkend="edit-recipe">Bearbeiten von gespeicherten Rezepten</link>.

source: With the <guibutton>Find/Edit Recipes</guibutton> component button selected, the main <emphasis>&krecipes;</emphasis> window displays the following &mdash;
de: Ist die Komponente <emphasis>Rezepte suchen/bearbeiten</emphasis> ausgewählt, wird im Hauptbereich von <emphasis>&krecipes;</emphasis> folgendes angezeigt:

source: A title showing the name of the component selected
de: Ein Titel mit dem Namen der ausgewählten Komponente

source: <guilabel>Basic</guilabel> (the default) and <guilabel>Advanced</guilabel> tabs
de: Die Karteikarten <guilabel>Einfach</guilabel> (Voreinstellung) und <guilabel>Erweitert</guilabel>

source: A text box to <userinput>enter search criteria</userinput>
de: Ein Textfeld zur Eingabe von <userinput>Suchbegriffen</userinput>

source: A cool feature here is that <emphasis>&krecipes;</emphasis> will search for recipes as you type a text string in the <guilabel>Search:</guilabel> box. For example, if you wanted to find a recipe containing the word <quote>apple</quote>, the recipes that display in the recipe view would show only those recipes that contain the text string and would be filtered more finely as each subsequent letter is typed.
de: <emphasis>&krecipes;</emphasis> beginnt mit der Suchen nach Rezepten, wenn Sie einen Text in das Feld <guilabel>Suchen</guilabel> eingeben. Möchten Sie zum Beispiel ein Rezept finden, das das Wort <quote>Apfel</quote> enthält, werden nur Rezepte angezeigt, die diesen Text enthalten, und weiter gefoltert, wenn Sie weitere Buchstaben eingeben.

source: A list of all recipe categories
de: Eine Liste aller Rezeptkategorien

source: Buttons for show, edit and delete the selected recipes.
de: Knöpfe zum Anzeigen, Bearbeiten und Löschen von ausgewählten Rezepten.

source: You will notice the <guiicon><inlinemediaobject><imageobject><imagedata fileref="system-help.png" format="PNG"/></imageobject></inlinemediaobject></guiicon> icon in the bottom, right-hand corner of the pane containing the component list. This icon appears in all &krecipes; components and when clicked, will open the corresponding section of this Handbook if you need extra help at any time.
de: Das Symbol <guiicon><inlinemediaobject><imageobject><imagedata fileref="system-help.png" format="PNG"/></imageobject></inlinemediaobject></guiicon> in der unteren rechten Ecke des Bereichs mit der Komponentenliste wird für alle Komponenten angezeigt. Wenn Sie darauf klicken, wird der zugehörige Abschnitt des Handbuchs geöffnet und jederzeit weitere Hilfen angezeigt.

source: With the <guilabel>Basic</guilabel> tab active and the list of recipe categories displayed, a category can be expanded by clicking on the <guibutton>+</guibutton> button beside the category name. The category will automatically expand to show your recipes and/or subcategories, if there are any. From this list, you may select a recipe to open, edit or delete (see the section <link linkend="edit-recipe">Editing Saved Recipes</link> for more information). Additionally, if you <action>select just one recipe</action>, the <interface>status bar</interface> will show the date that it was <emphasis> created</emphasis>, <emphasis>modified</emphasis> and <emphasis>last accessed </emphasis>.
de: Ist die Karteikarte <guilabel>Einfach</guilabel> geöffnet und wird die Liste der Rezeptkategorien angezeigt, kann eine Kategorie durch Klicken auf das Symbol <guibutton>v</guibutton> neben dem Namen der Kategorie aufgeklappt werden. Dann werden die Rezepte oder Unterkategorien in dieser Kategorie angezeigt. Aus dieser Liste können Sie ein Rezept auswählen, um es zu öffnen, zu bearbeiten oder zu löschen. Weitere Informationen dazu finden Sie im Abschnitt <link linkend="edit-recipe">Bearbeitung gespeicherter Rezepte</link>. Wenn Sie <action>genau ein Rezept ausgewählt</action> haben, wird in der <interface>Statusleiste</interface> das Datum der <emphasis>Erstellung</emphasis>, der <emphasis>Änderung</emphasis> und des <emphasis>letzten Zugriffs</emphasis> angezeigt.

source: Conversely, clicking the <guibutton>-</guibutton> button beside the category name will collapse the category.
de: Im Gegensatz dazu wird durch Klicken auf das Symbol <guibutton>-</guibutton> neben dem Namen die Kategorie eingeklappt.

source: The <quote>Right-Click</quote>Menu
de: Das Kontextmenü der &RMBn;

source: <emphasis>&krecipes;</emphasis> allows a multitude of ways to perform various actions on your recipes. These actions are described in their corresponding sections in this Handbook. However, in addition to the various key combinations and/or menu selections, <action>right-clicking</action> on a recipe in the Basic search pane will bring up a menu from which the following actions can be selected &mdash;
de: In <emphasis>&krecipes;</emphasis> können Sie auf mehrere Arten verschiedene Aktionen mit Ihren Rezepten ausführen. Diese Aktionen werden in den zugehörigen Abschnitten des Handbuchs beschrieben. Zusätzlich zu den verschiedenen Tastenkombinationen oder Menüaktionen, können Sie mit der &RMBn; auf ein Rezept klicken und damit ein Kontextmenü mit folgenden Aktionen öffnen:

source: Show recipe(s) &ndash; Shows the selected recipes.
de: Rezept(e) anzeigen &ndash; Zeigt die ausgewählten Rezepte.

source: Edit recipe &ndash; Opens the selected recipe for editing.
de: Rezept(e) Bearbeiten &ndash; Öffnet einen Dialog zur Bearbeitung des ausgewählten Rezepts.

source: Export... &ndash; Exports the selected recipe. See the section <link linkend="export-recipe">Exporting Recipes to Other Formats</link> for a complete description of this function.
de: Exportieren ... &ndash; Exportiert das gewählte Rezept. Im Abschnitt <link linkend="export-recipe">Rezepte in andere Formate exportieren</link> finden Sie eine vollständige Beschreibung dieser Funktion.

source: Add to Shopping List &ndash; Adds the selected recipe to your shopping list. See the section <link linkend="shopping-list">The Shopping List</link> for information regarding the use of the Shopping List.
de: Zur Einkaufsliste hinzufügen &ndash; Fügt die ausgewählten Rezepte zur Einkaufsliste hinzu. Weitere Informationen dazu finden Sie im <link linkend="shopping-list">Die Einkaufsliste</link>.

source: Copy to Clipboard &ndash; Makes a copy of the recipe and places in on the clipboard so that it can be pasted into another application for example, an email. The format of the copy is dependent on what is selected as a preference. For a complete description of the <quote>Copy to Clipboard</quote> functionality, see the section <link linkend="copy-clipboard">Copying to the Clipboard</link>.
de: In Zwischenablage kopieren &ndash; Fügt eine Kopie des Rezepte in die Zwischenablage ein, die dann in andere Anwendungen wie zum Beispiel E-Mail eingefügt werden kann. Das Format der Kopie hängt von der Einstellung ab. Eine umfassende Beschreibung der Funktion <quote>In Zwischenablage kopieren</quote> finden Sie im Abschnitt <link linkend="copy-clipboard">Kopieren in die Zwischenablage</link>.

source: Categorize &ndash; This option applies only when there are recipes listed as <emphasis>Uncategorized</emphasis>. Allows you to select one or more recipes that appear in the <emphasis>Uncategorized</emphasis> group and place them in the appropriate category by selecting the it from a pop-up instead of having to edit the recipe(s).
de: Kategorisieren &ndash; Diese Aktion ist nur im Kontextmenü von <emphasis>Nicht kategorisierten</emphasis> Rezepten. Dann können Sie eins oder mehrere Rezepte in der Gruppe <emphasis>Nicht kategorisiert</emphasis> auswählen und ihnen eine passende Kategorie zuordnen, die Sie aus einem Aufklappfeld wählen können, ohne das Rezept ändern zu müssen.

source: Remove From Category &ndash; Removes the recipe from its current category. If the recipe is not included in any other category, places it in the <emphasis>Uncategorized</emphasis> group. From the <emphasis>Uncategorized</emphasis> group, the recipe can be selected for editing to re-categorize it. See the section <link linkend="edit-recipe">Editing Saved Recipes</link> for more information.
de: Aus Kategorie entfernen &ndash; Entfernt das Rezept aus der aktuellen Kategorie. Ist das Rezept nicht auch in einer anderen Kategorie, wird es in die Gruppe <emphasis>Nicht kategorisiert</emphasis> verschoben. Aus dieser Gruppe kann es in ausgewählt und in wieder in andere Kategorien eingefügt werden. Im Abschnitt <link linkend="edit-recipe">Bearbeitung gespeicherter Rezepte</link> finden Sie weitere Informationen.

source: Delete &ndash; Deletes the selected recipes from the database.
de: Löschen &ndash; Löscht das ausgewählte Rezept aus der Datenbank.

source: Some of the actions explained above may be applied to multiple recipes. You can select various recipes thusly: hold the &Ctrl; key and select the desired recipes by clicking on them.
de: Einige dieser Aktionen können auch mit mehreren Rezepten ausgeführt werden. Um mehrere Rezepte auszuwählen, halten Sie die &Ctrl;taste gedrückt und wählen die gewünschten Rezepte durch Klicken mit der &LMBn; aus.

source: The Advanced Tab
de: Die Karteikarte Erweitert

source: The purpose of the <guilabel>Advanced</guilabel> tab is to provide advanced search capability. Queries for recipes can be made based on nine search criteria, alone or in combination &mdash;
de: Auf der Karteikarte <guilabel>Erweitert</guilabel> finden Sie zusätzliche Möglichkeiten zur Suche. Eine Suche kann anhand von neun einzelnen oder mit einander kombinierten Kriterien ausgeführt werden.

source: Title
de: Titel

source: <para>Ingredients</para>
de: <para>Zutaten</para>

source: Categories
de: Kategorien

source: Authors
de: Autoren

source: Yield
de: Portionen

source: Preparation Time
de: Zubereitungszeit

source: <para>Instructions</para>
de: <para>Zubereitung</para>

source: Meta Data
de: Metadaten

source: <para>Ratings</para>
de: <para>Bewertungen</para>

source: Here's a screenshot of the available components in the &krecipes; Advanced Search tab.
de: Bildschirmfoto der Suchkriterien auf der Karteikarte <guilabel>Erweitert</guilabel>

source: The <emphasis>&krecipes;</emphasis> Advanced Search Component
de: Suchkriterien für <emphasis>&krecipes;</emphasis> auf der Karteikarte <guilabel>Erweitert</guilabel>

source: When the <guilabel>Advanced</guilabel> tab is selected, the components will be collapsed and show &gt;&gt; beside the label of the component. To expand a section, simply click on the label of the component. Conversely, with the component expanded, &lt;&lt; will show beside the label and clicking on the label will collapse the section.
de: Wenn die Karteikarte <guilabel>Erweitert</guilabel> ausgewählt wurde, sind die Komponenten eingeklappt und zeigen das Symbol &gt;&gt; neben dem Namen der Komponente. Um ein Komponente auszuklappen, klicken Sie auf deren Namen. Bei einer ausgeklappten Komponente wird dagegen das Symbol &lt;&lt; neben dem Namen angezeigt. Durch Klicken darauf wird dann die Komponente eingeklappt.

source: A section can be collapsed simply to get it out of the way when it is not needed for a search. However, if you enter search criteria in any one of the search components, you can close the component and the search criteria will still be considered in the search.
de: Ein Abschnitt kann eingeklappt werden, um die Einträge auszublenden, wenn sie für die Suche nicht benötigt werden. Haben Sie jedoch Kriterien für die Suche in einer Komponente angegeben, können Sie die Komponente zusammenklappen, das eingestellte Kriterium wird aber weiterhin bei der Suche berücksichtigt.

source: For all search components in the <guilabel>Advanced</guilabel> tab, click the <guibutton>Search</guibutton> button to initiate the search once all desired search criteria have been selected. Clicking the <guibutton>Clear</guibutton> button will clear the search selections and the search results.
de: Für alle Komponenten auf der Karteikarte <guilabel>Erweitert</guilabel> muss zum Start der Suche der Knopf <guibutton>Suchen</guibutton> gedrückt werden, wenn alle gewünschten Kriterien eingegeben wurden. Klicken Sie auf den Knopf <guibutton>Leeren</guibutton>, werden alle Eingaben zur Suche und das Suchergebnis gelöscht.

source: Only recipes meeting ALL criteria will display! No matter which parameters are used for the recipe search, should no recipes meeting the specified criteria be found, the message <quote>&mdash; No matching recipes found &mdash;</quote> will display in the recipe list area.
de: Es werden nur Rezepte angezeigt, auf die <emphasis>alle</emphasis> Kriterien zutreffen. Unabhängig davon, welche Parameter bei der Suche benutzt wurden, wird als Ergebnis die Nachricht <quote>&mdash; Keine passenden Rezepte gefunden &mdash;</quote> in der Rezeptliste angezeigt, wenn es kein Rezept zu den Suchkriterien gibt.

source: The various components are used as follows &mdash;
de: Die verschiedenen Kriterien werden wie folgt verwendet &mdash;

source: The Title Search
de: Die Suche nach Titeln

source: Enter words that appear as part of the recipe title, for example, <emphasis>Chicken Rice</emphasis>. Using these words, recipes that contain the words <quote>Chicken</quote>, or <quote>Rice</quote>, or <emphasis>both</emphasis> in the title will appear in your results. However, if you click the tickbox beside the <guilabel>Require All Words</guilabel> label, only those recipes that have both <quote>Chicken</quote> <emphasis>AND</emphasis> <quote>Rice</quote> in the title will be found.
de: Geben Sie Worte aus dem Titel des Rezepts ein, zum Beispiel <emphasis>Hühnchen Reis</emphasis>. Mit diesen Worten werden Rezepte, die <quote>Hühnchen</quote> oder <quote>Reis</quote> oder <emphasis>beides</emphasis> im Titel enthalten, in der Liste angezeigt. Wenn Sie jedoch <guilabel>Alle Wörter benötigt</guilabel> ankreuzen, werden nur Rezepte gefunden, die <quote>Hühnchen</quote> <emphasis>und</emphasis> <quote>Reis</quote> im Titel enthalten.

source: The Ingredients Search
de: Die Suche nach Zutaten

source: In the <guilabel>Ingredients</guilabel> component of the <guilabel>Advanced</guilabel> tab, single or multi-word ingredients can be searched for. Single word ingredients are entered in the text box with a space between each ingredient. Multi-word ingredients are enclosed in quotes, for example, <quote>ice cream</quote>.
de: In der Komponente <guilabel>Zutaten</guilabel> auf der Karteikarte <guilabel>Erweitert</guilabel> kann nach einem oder mehreren Worten in Zutaten gesucht werden. Einzelne Wörter werden mit Leerzeichen dazwischen eingegeben. Mehrere Wörter müssen in Anführungszeichen wie zum Beispiel <quote>rote Paprika</quote> eingeschlossen werden.

source: Searches may also be done using wild cards &ndash; <quote>*</quote> to replace any number of characters, or <quote>?</quote> to replace a single character. For an explanation on the use of wildcards, see the section <link linkend="using-wildcards">Using Wildcards in Searches</link>.
de: Beim Suchen können auch Platzhalter benutzt werden &ndash; <quote>*</quote> als Ersatz für eine beliebige Anzahl von Zeichen und <quote>?</quote> für genau ein Zeichen. Eine Erklärung zur Anwendung von Platzhaltern finden Sie im Abschnitt <link linkend="using-wildcards">Suchen mit Platzhaltern</link>.

source: Although the ingredient that you are searching for might appear in the title of the recipe listed in the search results, it is the ingredient that has caused a particular recipe to show in the list, NOT the fact that the ingredient name might appear in the title.
de: Obwohl die Zutat, nach der Sie suchen, möglicherweise im Titel des Rezepts enthalten ist. wird die Anzeige durch die Zutat im Rezept verursacht, nicht durch den Namen der Zutat im Titel.

source: Recipes can be searched for based on various criteria &mdash;
de: Rezepte können nach verschiedenen Kriterien gesucht werden &mdash;

source: <guilabel>Uses all:</guilabel> &ndash; If the search terms are entered in this text box, it is being stated that the recipe(s) <emphasis>MUST</emphasis> contain all ingredients listed and therefore, only those recipes that contain <emphasis>ALL</emphasis> ingredients will be returned as results of the search.
de: <guilabel>Braucht alle:</guilabel> &ndash; Die Rezepte <emphasis>müssen</emphasis> alle Zutaten benötigen, damit sie in der Liste als Ergebnis angezeigt werden.

source: <guilabel>Uses any of:</guilabel> &ndash; If the search terms are entered in this text box, it is being stated that the recipe(s) <emphasis>MAY</emphasis> contain any of the ingredients specified. The search results will return recipes that contain <emphasis>ANY OR ALL</emphasis> of the ingredients.
de: <guilabel>Braucht beliebige von:</guilabel> &ndash; Das Rezept <emphasis>kann</emphasis> die eingegebenen Begriffe enthalten. Angezeigt werden Rezepte, die <emphasis>irgendeine oder alle</emphasis> Zutaten enthalten.

source: <guilabel>Without:</guilabel> &ndash; If the search terms are entered in this text box, it is being specified that the recipes returned as results of the search <emphasis>MUST NOT</emphasis> contain <emphasis>ANY</emphasis> of the listed ingredients.
de: <guilabel>Ohne:</guilabel> &ndash; Es werden alle Rezepte angezeigt, die <emphasis>keines</emphasis> der angegebenen Zutaten enthalten.

source: The Categories Search
de: Die Suche nach Kategorien

source: As in the <guilabel>Ingredients</guilabel> component of the <guilabel>Advanced</guilabel> tab, search parameters in the <guilabel>Categories</guilabel> component are entered with a space between each parameter, or enclosed in quotes for multi-word parameters. You can also use wildcards for searching categories. See the section, <link linkend="using-wildcards">Using Wildcards in Searches</link> for an explanation on the use of wildcards.
de: Wie bei der Komponente <guilabel>Zutaten</guilabel> werden Suchparameter in der Komponente <guilabel>Kategorien</guilabel> entweder einzeln mit einem Lesezeichen dazwischen eingegeben oder in Anführungszeichen eingeschlossen bei Parametern aus mehreren Wörtern. Es können auch Platzhalter für die Suche in Kategorien benutzt werden. Eine Erklärung zur Anwendung von Platzhaltern finden Sie im Abschnitt <link linkend="using-wildcards">Suchen mit Platzhaltern</link>.

source: Searching for recipes in <guilabel>Categories</guilabel> is done by specifying the criteria on which you wish to base the search as follows &mdash;
de: Für die Suche nach Rezepten in <guilabel>Kategorien</guilabel> werden die Kriterien der Suche wie folgt eingegeben &mdash;

source: <guilabel>In all:</guilabel> &ndash; indicates that the recipes returned in the search should be in all the categories listed. This search might be used if you are looking for a recipe that appears in the <emphasis>Dessert</emphasis> category and also, in the <emphasis>Cakes</emphasis> category.
de: <guilabel>In allen:</guilabel> &ndash; Es wird nach Rezepten in allen angezeigten Kategorien gesucht. Sie sollten diese Einstellung verwenden, um nach Rezepten in mehreren Kategorien zu suchen.

source: <guilabel>In any of:</guilabel> &ndash; is specifying that recipes returned in the search may be from <emphasis>ANY</emphasis> of the categories, but a recipe may not necessarily be found in all categories listed.
de: <guilabel>In irgendeinem von</guilabel> &ndash; Es werden Rezepte in irgendeiner Kategorie gesucht, dabei kann auch kein Ergebnis in den angezeigten Kategorien gefunden werden.

source: <guilabel>Not in:</guilabel> &ndash; is indicating that the recipes returned in the search <emphasis>MUST NOT</emphasis> be from the categories listed.
de: <guilabel>Nicht in:</guilabel> &ndash; Als Ergebnis werden Rezepte gefunden, die <emphasis>nicht</emphasis> ind den angezeigten Kategorien vorhanden sind.

source: The use of the <guilabel>Categories</guilabel> search is most useful when combined with other search parameters.
de: Die Suche nach <guilabel>Kategorien</guilabel> sollte am Besten mit anderen Suchparametern kombiniert werden.
