Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/extragear-utils/krecipes.po
Languages: de

source: In the following screenshot, it is being specified that recipes should be searched for in the <emphasis>Desserts</emphasis> and <emphasis>Main Dishes</emphasis> categories.
de: Im folgenden Bildschirmfoto sehen Sie die Suche nach Rezepten in den Kategorien <emphasis>Nachspeise</emphasis> und <emphasis>Hauptgericht</emphasis>.

source: Here's a screenshot of a completed search in &krecipes; specifying a category only.
de: Bildschirmfoto von &krecipes; mit dem Ergebnis einer Suche nach einer Kategorie.

source: Advanced Search &ndash; Category Only Specified
de: Suche nach nur einer Kategorie auf der Karteikarte Erweitert

source: In the next screenshot, recipes are still being searched for in the <emphasis>Desserts</emphasis> and <emphasis>Main Dishes</emphasis> categories. However, recipes that contain some form of the word <quote>apple</quote> (note the use of the wildcard) are being excluded.
de: Im nächsten Bildschirmfoto sehen Sie, dass immer noch nach den Kategorien <emphasis>Nachtisch</emphasis> und <emphasis>Hauptgerichte</emphasis> gesucht wird. Dabei werden jedoch Rezepte, die das Wort <quote>Apfel</quote> in irgendeiner Form enthalten, wegen der Platzhalter im Suchbegriff ausgeschlossen.

source: Here's a screenshot of a completed search in &krecipes; specifying a category and additional criteria.
de: Bildschirmfoto von &krecipes; mit dem Ergebnis einer Suche nach einer Kategorie und einem zusätzlichen Suchkriterium.

source: Advanced Search - Ingredient and Category Specified
de: Suche nach Kategorie und Zutat auf der Karteikarte Erweitert

source: The Authors Search
de: Die Suche nach Autoren

source: Are you looking for a recipe given to you by a certain person or input into <emphasis>&krecipes;</emphasis> from a specific magazine? The <guilabel>Authors</guilabel> component of the <guilabel>Advanced</guilabel> tab allows you to find that recipe!
de: Suchen Sie nach einem Rezept, das Sie von einer bestimmten Person erhalten haben oder aus einer bestimmten Magazin in <emphasis>&krecipes;</emphasis> eingefügt haben? Mit der Komponente <guilabel>Autoren</guilabel> auf der Karteikarte <guilabel>Erweitert</guilabel> können Sie dieses Rezept finden.

source: Searches can be performed in the following ways &mdash;
de: Eine Suche kann auf folgende Arten ausgeführt werden &mdash;

source: <guilabel>Not by:</guilabel> &ndash; This search would be used when you want to exclude certain authors from your search.
de: <guilabel>Nicht von</guilabel> &ndash; Benutzen Sie dies, um bestimmte Autoren von der Suche auszuschließen.

source: The Yield Search
de: Die Suche nach Portionen

source: The <guilabel>Yield</guilabel> component in the <guilabel>Advanced</guilabel> tab is slightly different from the searches described thus far in that it must be <emphasis>Enabled</emphasis> in order to have it utilized in the search criteria.
de: Die Komponente <guilabel>Portionen</guilabel> auf der Karteikarte <guilabel>Erweitert</guilabel> wird auf die gleiche Art wie die vorher beschriebenen Komponente verwendet. Diese Komponente muss ebenfalls zuerst aktiviert werden, um sie bei den Suchkriterien benutzen zu können.

source: To enable <guilabel>Yield</guilabel> as a criteria for your search, click the tick box beside the <guilabel>Enabled</guilabel> label. Once you have designated this to be part of your search, you can define the yield by selecting from the drop-down menu as follows &mdash;
de: Um die <guilabel>Portionen</guilabel> als Kriterium für Ihre Suche zu verwenden, klicken Sie auf das Ankreuzfeld <guilabel>Aktiviert</guilabel>. Dann können Sie aus dem Auswahlfeld folgende Kriterien für sie Anzahl der Portionen wählen &mdash;

source: <guilabel>Yields at least:</guilabel> &ndash; This would be specified if you want the recipe(s) to be able to provide a minimum number of portions. The recipe(s) returned COULD yield <emphasis>MORE</emphasis> than this number, but cannot yield less.
de: <guilabel>Mindestanzahl Portionen:</guilabel> &ndash; Dies kann benutzt werden, wenn Sie Rezepte mit einer Mindestanzahl von Portionen suchen. Die gefundenen Rezepte können <emphasis>mehr</emphasis> Portionen enthalten, aber nicht <emphasis>weniger</emphasis>.

source: <guilabel>Yields at most:</guilabel> &ndash; This would be specified if you want recipe(s) that are returned in the search to yield <emphasis>NO MORE THAN</emphasis> a specified number of portions.
de: <guilabel>Maximalanzahl Portionen:</guilabel> &ndash; Dies kann benutzt werden, wenn Sie Rezepte finden möchten, die <emphasis>nicht mehr</emphasis> als die angegebene Anzahl von Portionen enthalten.

source: <guilabel>Yields about:</guilabel> &ndash; This would be used to approximate the number of portions you want in the recipe(s). The recipes(s) returned could yield <emphasis>SLIGHTLY MORE</emphasis> or <emphasis>SLIGHTLY LESS</emphasis> than a specified number of portions.
de: <guilabel>Ungefähre Anzahl Portionen:</guilabel> &ndash; Dies kann benutzt werden, wenn Sie Rezepte suchen, die etwa die angegeben Anzahl von Portionen enthalten. Die gefundenen Rezepte können <emphasis>weniger mehr</emphasis> oder <emphasis>etwas weniger</emphasis> der angegebenen Portionen enthalten.

source: After defining the type of search that is desired, the spinbox next to the drop-down menu is used to increment (or decrement) the actual <emphasis>yield amount</emphasis> that goes along with the defined parameters.
de: Nachdem die Art der Suche definiert wurde, können Sie im Drehfeld neben dem Auswahlfeld die tatsächliche Anzahl der Portionen einstellen, die mit der definierten Bedingung verwendet wird.

source: The Preparation Time Search
de: Die Suche nach Zubereitungszeit

source: The <guilabel>Preparation Time</guilabel> component in the <guilabel>Advanced</guilabel> tab is used in the same manner as the <guilabel>Yield</guilabel> component. It must be <emphasis>Enabled</emphasis> in order to have it utilized in the search criteria.
de: Die Komponente <guilabel>Zubereitungszeit</guilabel> auf der Karteikarte <guilabel>Erweitert</guilabel> wird auf die gleiche Art wie die Komponente <guilabel>Portionen</guilabel> verwendet. Diese Komponente muss ebenfalls zuerst aktiviert werden, um sie bei den Suchkriterien benutzen zu können.

source: To enable <guilabel>Preparation Time</guilabel> as a criteria for your search, click the tick box beside the <guilabel>Enabled</guilabel> label. Once you have designated this to be part of your search, you can define the time criteria by selecting from the drop-down menu as follows &mdash;
de: Um die <guilabel>Zubereitungszeit</guilabel> als Kriterium für Ihre Suche zu verwenden, klicken Sie auf das Ankreuzfeld <guilabel>Aktiviert</guilabel>. Dann können Sie aus dem Auswahlfeld folgende Zeitkriterien wählen &mdash;

source: <guilabel>Ready in at most:</guilabel> &ndash; This would be utilized if you want the recipe(s) to be ready within a specified time frame. The recipe(s) returned COULD be ready in <emphasis>LESS THAN</emphasis> or <emphasis>EXACTLY</emphasis> the time specified, but cannot be ready in greater than the time chosen for preparation.
de: <guilabel>Fertig in höchstens:</guilabel> &ndash; Dies kann benutzt werden, wenn Sie Rezepte suchen, die in einer bestimmten Zeit fertig sind. Die gefundenen Rezepte sind in <emphasis>weniger als</emphasis> oder <emphasis>genau</emphasis> der angegebenen Zeit zubereitet, brauchen aber nicht in mehr als die angegebene Zeit für die Zubereitung.

source: <guilabel>Ready in about:</guilabel> &ndash; This choice allows some flexibility and would be used to approximate the time needed to prepare the recipe. The recipe(s) that are returned in the search can be ready in <emphasis>SLIGHTLY MORE</emphasis>, <emphasis>EXACTLY</emphasis>, or <emphasis>SLIGHTLY LESS</emphasis> than the time specified for preparation.
de: <guilabel>Fertig in etwa:</guilabel> &ndash; Dies kann benutzt werden, wenn Sie Rezepte suchen, die ungefähr in einer angegebenen Zeit fertig sind. Die gefundenen Rezepte sind in <emphasis>etwas weniger</emphasis> <emphasis>genau</emphasis> oder in <emphasis>etwas mehr</emphasis> als der angegebenen Zeit zubereitet.

source: The Instructions Search
de: Die Suche nach Zubereitung

source: Should you require that the search contain all the keywords listed, click the tick box beside the <guilabel>Require All Words</guilabel> label.
de: Möchten Sie nach allen eingestellten Schlüsselwörtern suchen, klicken Sie auf das Ankreuzfeld neben <guilabel>Alle Wörter benötigt</guilabel>.

source: The Meta Data Search
de: Die Suche nach Metadaten

source: <guilabel>Created:</guilabel> &ndash; This is the date that the recipe was created on.
de: <guilabel>Erzeugt:</guilabel> &ndash; Das Datum, an dem das Rezept erstellt wurde.

source: <guilabel>Modified:</guilabel> &ndash; This is the date that the last revision was made to the recipe.
de: <guilabel>Verändert:</guilabel> &ndash; Das Datum der letzten Änderung des Rezepts.

source: <guilabel>Last accessed:</guilabel> &ndash; This is the date that the recipe was last opened or <quote>used</quote>.
de: <guilabel>Letzter Zugriff:</guilabel> &ndash; Das Datum an dem das Rezept zuletzt geöffnet oder <quote>verwendet</quote> wurde.

source: Using the Calendar Interface
de: Benutzen des Kalenders

source: The calendar allows you to easily navigate though months and years to select any date.
de: Mit den Kalender können Sie leicht durch Monate und Jahre navigieren, um ein beliebiges Datum zu wählen.

source: When the calendar is revealed, the current month is shown and the current day is highlighted. Below the calendar is a text box, which shows the date and beside this a drop-down menu that displays the specific week of the year.
de: Wird der Kalender geöffnet, dann zeigt er den aktuellen Monat und darin den aktuellen Tag hervorgehoben an. Unter dem Kalender gibt es ein Textfeld, das das Datum zeigt, und daneben ein Auswahlfeld mit der zugehörigen Kalenderwoche.

source: Additionally, the calendar itself can be utilized to navigate to a specific date. When the arrow beside the text box in which you want to display the date is clicked, thus revealing the calendar, there are a number of ways to select a date &mdash;
de: Zusätzlich kann der Kalender benutzt werden kann, um zu einem bestimmten Datum zu gehen. Wenn Sie auf die Pfeile neben dem Textfeld klicken, in dem das Datum angezeigt wird, wird der Kalender geöffnet und bietet mehrere Möglichkeiten zur Datumsauswahl &mdash;

source: Click on the month displayed &ndash; This will reveal a list from which you can select a desired month.
de: Klicken Sie auf den angezeigten Monat &ndash; dann wird eine Listenfeld geöffnet, aus der Sie den gewünschten Monat wählen können.

source: Click on the year displayed &ndash; This is reveal a text box that displays the current year, but in which another year can be entered.
de: Klicken Sie auf das angezeigte Jahr &ndash; dann wird eine Textfeld mit dem aktuellen Jahr geöffnet, in dem Sie das gewünschte Jahr eingeben können.

source: The Ratings Search
de: Die Suche nach Bewertungen

source: When a Rating search is selected, it can be done in two ways &mdash;
de: Eine Suche nach Bewertungen kann auf zwei Arten ausgeführt werden &mdash;

source: By average:
de: Im Durchschnitt:

source: By criteria:
de: Durch Kriterien:

source: Searching by Average Rating
de: Suche nach durchschnittlicher Bewertung

source: Once you have entered your search parameters, click the <guibutton>Search</guibutton> button and the recipes that meet the search criteria will display under the <guilabel>Title</guilabel> label on the right. Should no recipes meet the criteria, <emphasis>--- No matching recipes found ---</emphasis> will display.
de: Haben Sie Ihre Parameter für die Suche eingegeben, klicken Sie auf den Knopf <guibutton>Suchen</guibutton> und die Rezepte, auf die die Suchkriterien zutreffen, werden unter dem <guilabel>Titel</guilabel> rechts angezeigt. Gibt es keine passenden Rezepte, wird <emphasis>---Keine passenden Rezepte gefunden---</emphasis> angezeigt.

source: Searching by Rating Criteria
de: Suche nach Bewertungskriterien

source: whole numbers, &eg; 3
de: Ganze Zahlen, &eg; 3

source: numbers that include fractional amounts, &eg; 3.5
de: Dezimalzahlen &eg; 3,5

source: whole number ranges, &eg; 3-4
de: Bereiche von ganzen Zahlen, &eg; 3-4

source: ranges that include fractional amounts, &eg; 3.5-4
de: Bereiche von Dezimalzahlen &eg; 3,5-4

source: For english language, the decimal separator is <quote>.</quote> (period), however if you have configured &kde; for other language, the decimal separator may be different. Note that if you are typing an invalid number the text becomes red to warn you.
de: Im Englischen wird der Punkt (<quote>.</quote>) als Dezimaltrennzeichen verwendet. Wenn Sie &kde; jedoch in anderen Sprachen benutzen, müssen Sie eventuell ein anderes Dezimaltrennzeichen verwenden. Wenn Sie eine ungültige Zahl eingeben, wird die Eingabe zur Warnung rot angezeigt.

source: Using Wildcards in Searches
de: Suche mit Platzhaltern

source: <emphasis>Wildcards</emphasis> are a single character used to replace either multiple or single characters in a text string. Wildcards supported in <emphasis>&krecipes;</emphasis> are the <quote>*</quote> and <quote>?</quote> characters. The <quote>*</quote> character is used to replace any number of characters in a string, while the <quote>?</quote> is used to replace a single character. Both can be used to replace any alpha-numeric character, including a space.
de: <emphasis>Platzhalter</emphasis> sind einzelne Zeichen, die als Ersatz entweder für mehrere oder ein einzelnes Zeichen in einem Text verwendet werden. In <emphasis>&krecipes;</emphasis> können die Zeichen <quote>*</quote> und <quote>?</quote> characters angewendet werden. Das Zeichen <quote>*</quote> steht für eine beliebige Anzahl von Zeichen in einem Text, während das<quote>?</quote> nur ein einzelnes Zeichen repräsentiert. Beide Platzhalter können für alle alphanumerischen Zeichen einschließlich des Leerzeichens verwendet werden.

source: Examples of Wildcard Searches
de: Beispiele für Suche mit Platzhaltern

source: Wildcard Search
de: Suche mit Platzhaltern

source: Possible Results Returned
de: Suchergebnisse

source: chick*
de: Hühn*

source: chicken broth
de: Hühnersuppe

source: chicken breast
de: Hühnerbrust

source: chicken
de: Hühnerbein

source: egg?
de: Ei??

source: <para>egg</para>
de: <para>Ei</para>

source: eggs
de: Eier

source: Entering and Editing Recipes
de: Eingabe und Bearbeiten von Rezepten

source: Adding a New Recipe
de: Ein neues Rezept hinzufügen

source: To add a new recipe, click on the <guiicon><inlinemediaobject><imageobject><imagedata fileref="document-new.png" format="PNG"/></imageobject></inlinemediaobject></guiicon> icon that appears in the first position on the <emphasis>&krecipes;</emphasis> toolbar. The <quote>Edit Recipe</quote> screen will display.
de: Um ein neues Rezept hinzuzufügen, klicken Sie auf das Symbol <guiicon><inlinemediaobject><imageobject><imagedata fileref="document-new.png" format="PNG"/></imageobject></inlinemediaobject></guiicon> in der Werkzeugleiste von <emphasis>&krecipes;</emphasis>. Dann wird der Dialog <quote>Rezept bearbeiten</quote> angezeigt.

source: The <quote>Edit Recipe</quote> screen has four tabs. Each permits entry of a different aspect of the recipe. These tabs are &mdash;
de: Im Dialog <quote>Rezept bearbeiten</quote> gibt es vier Karteikarten. Auf jeder können andere Aspekte des Rezepts eingegeben werden. Folgende Karteikarten sind vorhanden &mdash;

source: Recipe
de: Rezept

source: <guilabel>Ingredients</guilabel>
de: <guilabel>Zutaten</guilabel>

source: <guilabel>Instructions</guilabel>
de: <guilabel>Zubereitung</guilabel>

source: <guilabel>Ratings</guilabel>
de: <guilabel>Bewertungen</guilabel>

source: Here's a screenshot of the recipe entry screen showing the 4 tabs.
de: Bildschirmfoto des Eingabefensters für Rezepte mit den vier Karteikarten.

source: The Recipe Entry Interface
de: Die grafische Oberfläche zur Eingabe von Rezepten

source: It should also be noted that in the left-hand pane of the window, a button shows at the bottom of the component list that initially displays <quote>Write the recipe title here</quote>. This will change to the name of the recipe once it has been entered.
de: Oben links im Fenster gibt es ein Eingabefeld mit dem Text <quote>Geben Sie hier den Namen des Rezepts ein</quote>. Dies wird durch den tatsächlich eingegeben Namen ersetzt.

source: The Recipe Description
de: Die Rezept-Beschreibung

source: Adding the Recipe Name
de: Name des Rezepts hinzufügen

source: The title of the recipe is entered in the text box containing the prompt <quote>Write the recipe title here</quote>.
de: Der Name des Rezepts wird im Textfeld mit der Eingabeaufforderung <quote>Geben Sie hier den Namen des Rezepts ein</quote> eingetragen.

source: Adding the Recipe Author/Contributor
de: Autor des Rezepts hinzufügen

source: To enter an author for the recipe, click on the <guiicon> <inlinemediaobject><imageobject><imagedata fileref="list-add.png" format="PNG"/></imageobject></inlinemediaobject></guiicon> that appears to the right of the <quote>Authors</quote> box.
de: Um den Autor eines Rezepts einzugeben, klicken Sie dazu auf das Symbol <guiicon><inlinemediaobject><imageobject><imagedata fileref="list-add.png" format="PNG"/></imageobject></inlinemediaobject></guiicon> rechts neben dem Feld <quote>Autoren</quote>.

source: A window will appear where the author or contributor of the recipe can be selected from the drop-down menu. Once selected, transfer the name to the list box below by clicking on the <guiicon><inlinemediaobject><imageobject><imagedata fileref="list-add.png" format="PNG"/></imageobject></inlinemediaobject></guiicon> button that appears to the right of the drop-down menu.
de: Es wird dann ein Fenster geöffnet, in dem der Autor des Rezepts aus einem Auswahlfeld gewählt werden kann. Ist ein Name ausgewählt, fügen Sie ihn mit dem Knopf <guiicon><inlinemediaobject><imageobject><imagedata fileref="list-add.png" format="PNG"/></imageobject></inlinemediaobject></guiicon> rechts neben dem Auswahlfeld in die Liste ein.

source: An author may also be removed from the list by clicking the <guiicon><inlinemediaobject><imageobject><imagedata fileref="list-remove.png" format="PNG"/></imageobject></inlinemediaobject></guiicon> button.
de: Ein Autor kann durch Klicken auf den Knopf <guiicon><inlinemediaobject><imageobject><imagedata fileref="list-remove.png" format="PNG"/></imageobject></inlinemediaobject></guiicon> aus der Liste entfernt werden.

source: Click on the <guibutton>OK</guibutton> button to accept. The window will close and the name of the selected author will appear under the heading.
de: Klicken Sie auf <guibutton>OK</guibutton>, um die Eingabe zu übernehmen. Dann wird der Dialog geschlossen und der Name des gewählten Autors erscheint im Feld <guilabel>Autoren</guilabel>.

source: To cancel selection of an author, click on the <guibutton>Cancel</guibutton> button.
de: Um die Auswahl eines Autors abzubrechen, klicken Sie auf den Knopf <guibutton>Abbrechen</guibutton>

source: Selecting the Recipe Category
de: Auswahl der Rezeptkategorie

source: Next, the recipe category is selected by clicking on the <guiicon><inlinemediaobject><imageobject><imagedata fileref="list-add.png" format="PNG"/></imageobject></inlinemediaobject></guiicon> beside the category box.
de: Als nächstes wird die Kategorie des Rezepts ausgewählt, klicken Sie dazu auf das Symbol <guiicon><inlinemediaobject><imageobject><imagedata fileref="list-add.png" format="PNG"/></imageobject></inlinemediaobject></guiicon> neben den Kategorienfeld.

source: To select a category, click on the check box beside the category name and click the <guibutton>OK</guibutton> button to accept the selection or, the <guibutton>Cancel</guibutton> button to cancel the selection. Either way, the window will close.
de: Um eine Kategorie auszuwählen, klicken Sie auf das Ankreuzfeld neben dem Namen der Kategorie und dann auf den Knopf <guibutton>OK</guibutton>, um die Auswahl zu übernehmen oder auf den Knopf <guibutton>Abbrechen</guibutton>, um die Auswahl zu verwerfen. Mit beiden Knöpfen wird das Fenster dann geschlossen.

source: It is also possible to add a category here. Simply click on the <guibutton>New Category...</guibutton> button. Add a new category in the same manner as described in the section entitled <link linkend="categories-component">The Categories Component</link>.
de: Sie können hier auch eine neue Kategorie hinzufügen. Dazu drücken Sie den Knopf <guibutton>Neue Kategorie ...</guibutton>. Eine neue Kategorie kann auf die gleiche Weise wie im Abschnitt <link linkend="categories-component">Die Komponente Kategorien</link> beschrieben hinzugefügt werden.

source: Setting the Yield Amount and Type
de: Einstellung der Portionen und Art

source: Specifying Preparation Time
de: Angabe der Zubereitungszeit

source: The time it takes to prepare a recipe is designated by utilizing a spinbox.
de: Die Zeit zur Zubereitung eines Rezepts kann mit einem Drehfeld eingestellt werden.

source: However, the time must be specified in two steps &mdash;
de: Die Zeit muss jedoch in zwei Schritten eingestellt werden &mdash;

source: Select the digits prior to the <emphasis>&#058;</emphasis> symbol that specify the hours and increment the time until the desired number is reached.
de: Wählen Sie die Ziffern vor dem Symbol <emphasis>&#058;</emphasis>, die die Stunden angeben und vergrößern Sie den Wert bis zur gewünschten Zeit.

source: Select the digits after to the <emphasis>&#058;</emphasis> symbol that specify the minutes and increment the time until the desired number is reached.
de: Wählen Sie die Ziffern nach dem Symbol <emphasis>&#058;</emphasis>, die die Minuten angeben und vergrößern Sie den Wert bis zur gewünschten Zeit.

source: Changing the Default Photo
de: Änderung des Standardbilds

source: In the <guilabel>Recipe</guilabel> tab, the displayed photo can also be changed by clicking on the <guibutton>...</guibutton> button and selecting a photo for insertion. Alternatively, a photo may be inserted by dragging a graphic from any other application, for example a web page, and dropping it onto the photo in the Recipe tab while in edit mode.
de: Das auf der Karteikarte <guilabel>Rezept</guilabel> angezeigte Foto kann auch geändert werden, indem Sie auf <guibutton>...</guibutton> klicken und ein Foto zum Einfügen wählen. Alternativ können Sie ein Foto durch Ziehen einer Grafik aus einer anderen Anwendung, zum Beispiel einer Webseite, und Ablegen auf dem Foto in der Karteikarte <guilabel>Rezept</guilabel> im Bearbeitungsmodus einfügen.

source: The change in the graphic applies <emphasis>only to the current recipe</emphasis>.
de: Die Änderung des Bilds betrifft <emphasis>nur das aktuelle Rezept</emphasis>.

source: To revert to the original, <emphasis>&krecipes;</emphasis> graphic, click on the <guiicon><inlinemediaobject><imageobject><imagedata fileref="edit-clear.png" format="PNG"/></imageobject></inlinemediaobject></guiicon> button. This can be done before the recipe is saved or after saving it.
de: Um das ursprüngliche Bild wieder herzustellen, klicken Sie auf das Symbol <guiicon><inlinemediaobject><imageobject><imagedata fileref="edit-clear.png" format="PNG"/></imageobject></inlinemediaobject></guiicon>. Dies funktioniert sowohl vor als auch nach dem Speichern.
