Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/extragear-utils/krecipes.po
Languages: de

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>L</keycap></keycombo> </shortcut> <guimenu>View</guimenu> <guimenuitem>Show Recipe(s)</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>L</keycap></keycombo> </shortcut> <guimenu>Ansicht</guimenu> <guimenuitem>Rezept(e) anzeigen</guimenuitem>

source: Displays the currently active recipe.
de: Zeigt das zurzeit aktive Rezept an.

source: The Tools Menu
de: Das Menü Extras

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>M</keycap></keycombo> </shortcut> <guimenu>Tools</guimenu> <guimenuitem>Measurement Converter</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>M</keycap></keycombo> </shortcut> <guimenu>Extras</guimenu> <guimenuitem>Maßeinheiten-Umwandler</guimenuitem>

source: Accesses the <emphasis>&krecipes;</emphasis> <interface>Measurement Converter</interface> tool - see the <link linkend="measure-converter">Using the Measurement Converter</link> section for instruction.
de: Öffnet den Dialog <interface>Maßeinheiten-Umwandler</interface> für <emphasis>&krecipes;</emphasis>, im Abschnitt <link linkend="measure-converter">Umgang mit den Maßeinheiten-Umwandler</link> finden Sie weitere Information.

source: The Settings Menu
de: Das Menü Einstellungen

source: <guimenu>Settings</guimenu> <guimenuitem>Page Setup...</guimenuitem>
de: <guimenu>Einstellungen</guimenu><guimenuitem>Seiteneinstellungen ...</guimenuitem>

source: Accesses the <emphasis>&krecipes;</emphasis> <action>Page Setup interface</action> for defining the page layout &ndash; see the section on <link linkend="krecipes-page-setup">Page Setup</link> for further details.
de: Öffnet den Dialog <guilabel>Seiteneinrichtung</guilabel>, um das Design der Seite anzupassen, weitere Informationen dazu finden Sie im Abschnitt <link linkend="krecipes-page-setup">Seiteneinrichtung</link>.

source: <guimenu>Settings</guimenu> <guimenuitem>Print Setup...</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>Druckeinstellungen ...</guimenuitem>

source: Accesses the <emphasis>&krecipes;</emphasis> <action>Print Setup interface</action> &ndash; this interface is identical to the <interface>Page Setup</interface>, but is used to define a setup that can be different and separate from the page layout for viewing your recipes.
de: Öffnet den Dialog „Druckeinstellungen“ - <emphasis>&krecipes;</emphasis> &ndash; der Dialog entspricht der „Seiteneinrichtung“, aber damit werden Einstellungen angegeben, die sich von den Einstellungen für die Ansicht der Rezepte unterscheiden.

source: See the section on <link linkend="print-setup">Print Setup</link> for further details.
de: Weitere Informationen finden Sie im Abschnitt <link linkend="print-setup">Druckereinrichtung</link>.

source: <guimenu>Settings</guimenu> <guimenuitem>Show Statusbar</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>Statusleiste anzeigen</guimenuitem>

source: <action>Turns display of Statusbar on and off</action>.
de: <action>Blendet die Statusleiste eine oder aus</action>.

source: <guimenu>Settings</guimenu> <guimenuitem>Configure Shortcuts...</guimenuitem>
de: <guimenu>Einstellungen</guimenu><guimenuitem>Kurzbefehle festlegen ...</guimenuitem>

source: <action>Opens</action> the <interface>Configure Shortcuts - &krecipes;</interface> window from which Shortcuts can be defined.
de: <action>Öffnet</action> den Dialog <interface>Kurzbefehle festlegen - &krecipes;</interface>, in dem die Kurzbefehle eingerichtet werden können.

source: For complete instructions on configuring shortcuts, see the section <link linkend="configure-shortcuts">Creating Shortcuts</link>.
de: Umfassende Anleitungen zur Einstellung von Kurzbefehlen finden Sie im Abschnitt <link linkend="configure-shortcuts">Kurzbefehle erstellen</link>.

source: <guimenu>Settings</guimenu> <guimenuitem>Configure Toolbars...</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>Werkzeugleisten einrichten ...</guimenuitem>

source: <action>Opens</action> the <interface>Configure Toolbars - &krecipes;</interface> window from which Toolbars can be configured.
de: <action>Öffnet</action> den Dialog <interface>Werkzeugleisten einrichten - &krecipes;</interface>, in dem die Werkzeugleisten angepasst werden können.

source: See the section <link linkend="configure-toolbars">Customizing the Toolbar</link> for details.
de: Weitere Informationen finden Sie im Abschnitt <link linkend="configure-toolbars">Anpassung der Werkzeugleiste</link>.

source: <guimenu>Settings</guimenu> <guimenuitem>Configure &krecipes;...</guimenuitem>
de: <guimenu>Einstellungen</guimenu><guimenuitem>&krecipes; einrichten ...</guimenuitem>

source: <action>Opens</action> the <interface>Configure - &krecipes;</interface> window from which a number of preferences can be defined.
de: <action>Öffnet</action> den Dialog <interface>Einrichten - &krecipes;</interface>, in dem viele Einstellungen angepasst werden können.

source: See the section <link linkend="configure-krecipes-choice">Configure &krecipes;</link> for specific configuration instructions.
de: Im Abschnitt <link linkend="configure-krecipes-choice">Einrichten - &krecipes;</link> finden Sie weitere Informationen zu den Einstellungen.

source: The Help Menu
de: Das Menü Hilfe

source: &krecipes; has the common &kde; <guimenu>Help</guimenu> menu items, for more information read the section about the <ulink url="help:/fundamentals/ui.html#menus-help">Help Menu</ulink> of the &kde; Fundamentals.
de: &krecipes; benutzt die bekannten &kde;-Einträge im Menü <guimenu>Hilfe</guimenu>, weitere Informationen dazu finden Sie im Abschnitt über das Menü <ulink url="help:/fundamentals/uihtml#menus-help">Hilfe</ulink> der &kde;-Grundlagen.

source: Questions and Answers
de: Fragen und Antworten

source: I've put a lot of recipes into &krecipes; and now it runs and loads very slowly. Is there anything I can do to speed it up?
de: Ich habe viele Rezepte in &krecipes; eingegeben, aber jetzt läuft das Programm langsam und lädt die Rezepte sehr langsam. Wie kann ich die Arbeitsgeschwindigkeit erhöhen?

source: &krecipes; can work fine with thousands of recipes, even on a modest machine, and it is currently being tested with 50,000+ recipes.
de: &krecipes; kann mehrere Tausend Rezepte verarbeiten, sogar auf einem leistungsschwachen Rechner. Zurzeit wird die Arbeitsgeschwindigkeit mit mehr als 50.000 Rezepten getestet.

source: Here's what you can do:
de: Sie können folgendes tun:

source: Select the MySQL or PostgreSQL backends. They provide better overall performance than SQLite, especially for a huge amount of recipes.
de: Benutzen Sie eine MySQL oder PostgreSQL-Datenbank. Diese Datenbanken haben besonders bei sehr vielen Rezepten ein besseres Leistungsverhalten als SQLite.

source: In the Configure &krecipes; dialog, tune the <link linkend="configure-performance">Performance options</link>.
de: Passen Sie die Einstellungen zur <link linkend="configure-performance">Leistung</link> im Einrichtungsdialog von &krecipes; an.

source: Categorize your recipes. &krecipes; will load much faster if all recipes are categorized.
de: Kategorisieren Sie Ihre Rezepte. Wenn alle Rezepte in Kategorien eingeteilt sind, lädt &krecipes; die Daten viel schneller.

source: The Ingredient Matcher never matches any recipes. What am I doing wrong?
de: Bei der Zutaten-Übereinstimmung finde ich nie ein Rezept, was mache ich falsch?

source: The purpose of the Ingredient Matcher is to find recipes that you are able to make (or almost make) with ingredients that you select. That means you have to select every single ingredient used in a recipe (or all but a few, depending on how many ingredients can be missing) to match that recipe. See the <link linkend="ingredient-matcher">Ingredient Matcher section</link> for details.
de: Mit der Zutaten-Übereinstimmung können Sie Rezepte finden, die Sie mit den ausgewählten Zutaten vollständig oder fast vollständig kochen können. Sie müssen daher jede einzelne Zutat für ein Rezept angeben, bzw. fast alle, abhängig davon, wie viele Zutaten fehlen dürfen. Im Abschnitt <link linkend="ingredient-matcher">Zutaten-Übereinstimmung</link> finden Sie weitere Einzelheiten.

source: If you want to see which recipes use particular ingredients, then you want to use the <link linkend="using-adv-ingredients">The Ingredients Search</link>.
de: Wenn Sie erfahren möchten, welche Rezepte bestimmte Zutaten erfordern, verwenden Sie die <link linkend="using-adv-ingredients">Zutaten-Suche</link>.

source: Where are all the recipes?
de: Woher bekomme ich Rezepte?

source: While running the &krecipes; wizard will allow you to choose to install sample recipes, the prime function of the program is to allow you to store and manage your own recipe collection.
de: Sie mit dem Assistenten beim ersten Start von &krecipes; Rezeptbeispiele laden können, Die wichtigste Funktion des Programms ist es jedoch, Ihre eigene Rezeptsammlung zu erstellen und zu verwalten.

source: If you are looking to augment your personal recipe collection, there are Internet sites that host thousands of recipes that are freely available. Among these are: &mdash;
de: Möchten Sie Ihre persönliche Rezeptsammlung vergrößern, dann finden Sie im Internet viele Seiten mit tausenden von Rezepten, die frei heruntergeladen werden können. Rezepte finden Sie zum Beispiel auf diesen Seiten:

source: All you have to do is download the recipe and then, import it into your database. See the section <link linkend="file-import">Importing from a File</link> for help with this function.
de: Laden Sie sich Rezepte herunter und importieren Sie sie dann in Ihre Datenbank. Im Abschnitt <link linkend="file-import">Import aus einer Datei</link> finden Sie ausführliche Informationen zu dieser Funktion.

source: Credits and License
de: Mitwirkende und Lizenz

source: &krecipes; program copyright 2003-2010 by the &krecipes; developers.
de: &krecipes;. Programm Copyright 2003-2011 das &krecipes;-Entwicklerteam.

source: The &krecipes; developers:
de: Die &krecipes;-Entwickler:

source: Creator &amp; Former Core Developer
de: Projektgründer &amp; ehemaliger Hauptentwickler

source: Former Project Maintainer &amp; Former Core Developer
de: Ehemaliger Projektbetreuer &amp; ehemaliger Hauptentwickler

source: Former Core Developer
de: Ehemaliger Hauptentwickler

source: Porting to &kde; 4 Platform
de: Portierung auf die &kde;-4-Plattform

source: Porting to &kde; 4 Platform &amp; Project Maintainer
de: Portierung auf die &kde;-4-Plattform &amp; Projektbetreuer

source: Porting to &kde; 4 Platform &amp; Core Developer
de: Portierung zu &kde; 4 &amp; Hauptentwickler

source: Documentation copyright 2004-2010 Colleen Beamer <email>colleen.beamer&#064;gmail.com</email>, Jason Kivlighn <email>jkivlighn&#064;gmail.com</email> and José Manuel Santamaría Lema <email>panfaust&#064;gmail.com</email>
de: Dokumentation Copyright 2004-2010 Colleen Beamer <email>colleen.beamer&#064;gmail.com</email>, Jason Kivlighn <email>jkivlighn&#064;gmail.com</email> und José Manuel Santamaría Lema <email>panfaust&#064;gmail.com</email>
