Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/extragear-utils/krecipes.po
Languages: de

source: The <emphasis>Properties</emphasis> component is where nutrients are globally added and removed. To access this component, first click on the <guibutton>Data</guibutton> button in the left pane of the <emphasis>&krecipes;</emphasis> window and then, click on the <guibutton>Properties</guibutton> button.
de: In der Komponente <emphasis>Eigenschaften</emphasis> können Nahrungsmittel global hinzugefügt und entfernt werden. Um diese Komponente zu öffnen, klicken Sie zuerst auf den Knopf <guibutton>Daten</guibutton> links im Fenster von <emphasis>&krecipes;</emphasis> und wählen dann <guibutton>Eigenschaften</guibutton>.

source: Here's a screenshot of the &krecipes; Properties component.
de: Bildschirmfoto der Komponente „Eigenschaften“ von &krecipes;

source: <para>The Properties Component</para>
de: <para>Die Komponente Eigenschaften</para>

source: Adding Properties
de: Eigenschaften hinzufügen

source: Deleting Properties
de: Eigenschaften löschen

source: To remove a nutrient from the list, click the <guibutton>Delete</guibutton> button that appears below the <guibutton>Create...</guibutton> button that was used to create a new nutrient.
de: Um ein Nahrungsmittel aus der Liste zu entfernen, klicken Sie auf den Knopf <guibutton>Löschen</guibutton>, den Sie unter dem Knopf <guibutton>Erstellen</guibutton> rechts oben finden.

source: Another method:
de: Eine andere Methode:

source: An alternative method to either add, remove, or edit a nutrient is to first, select a nutrient and then, right-click to display a menu from which you can select <guimenuitem>Create</guimenuitem>, <guimenuitem>Delete</guimenuitem>, or <guimenuitem>Rename</guimenuitem>.
de: Es gibt eine alternative Methode, um entweder Nahrungsmittel hinzuzufügen, zu entfernen oder zu bearbeiten. Wählen Sie ein Nahrungsmittel und wählen Sie dann aus dem Kontextmenü die Aktionen <guimenuitem>Erstellen</guimenuitem>, <guimenuitem>Löschen</guimenuitem>, oder <guimenuitem>Umbenennen</guimenuitem>.

source: The Units Component
de: Die Komponente „Einheiten“

source: In the <emphasis>Units</emphasis> component, not only can units of measure that are to be used in the <emphasis>&krecipes;</emphasis> program be added and removed, but conversions between the various measures can be set up!
de: In der Komponente <emphasis>Einheiten</emphasis> können nicht nur Maßeinheiten für das Programm <emphasis>&krecipes;</emphasis> hinzugefügt oder entfernt werden, auch Umwandlungen zwischen den verschiedenen Maßeinheiten können eingerichtet werden.

source: The <emphasis>Units</emphasis> component is accessed by first, clicking on the <guibutton>Data</guibutton> button to reveal the additional <emphasis>&krecipes;</emphasis> components, and then, clicking on the <guibutton>Units</guibutton> button.
de: Den Dialog <emphasis>Einheiten</emphasis> öffnen Sie durch Klicken auf den Knopf <guibutton>Daten</guibutton>, um die zusätzlichen Komponenten von <emphasis>&krecipes;</emphasis> anzuzeigen. Wählen Sie dann den Knopf <guibutton>Einheiten</guibutton>.

source: Here's a screenshot of the Units tab in the &krecipes; Units component.
de: Bildschirmfoto der Karteikarte Einheiten in der Komponente Einheiten von &krecipes;

source: Units Component &ndash; The Units List
de: Die Komponente „Einheiten“ &ndash; Liste der Einheiten

source: You will also note that each unit allows a singular and plural form of that unit, if one exists. Additionally, abbreviations for both singular and plural forms can be set. A unit <emphasis>type</emphasis> can also be specified for each unit.
de: Für jede Einheit kann eine Form für Singular und Plural eingegeben werden. Das gleiche gilt für die Abkürzungen. Für jede Einheit kann ein <emphasis>Typ</emphasis> festgelegt werden.

source: Adding Units of Measure
de: Maßeinheiten hinzufügen

source: Finally, the unit <emphasis>type</emphasis> is selected from the drop-down menu that appears beside the label <guilabel>Type:</guilabel>. Choices for unit type are: &mdash;
de: Schließlich können den <emphasis>Typ</emphasis> im Auswahlfeld einstellen. Es gibt folgende Möglichkeiten:

source: Other &ndash; this is the default and hence, this is what displays on the drop-down menu
de: Sonstige &ndash; dies ist der Standard und wird daher im Auswahlfeld angezeigt

source: This type is used for any unit that cannot be designated as mass of volume.
de: Dieser Typ wird für jede Einheit benutzt, die nicht als Masse oder Volumen bezeichnet werden kann.

source: Mass &ndash; for those units that have a weight associated with them, for example, gram or pound
de: Masse &ndash; für Einheiten mit einem Gewicht wie zum Beispiel Gramm oder Pfund

source: Volume &ndash; for those units that are associated with a volume, for example, cup, quart, liter
de: Volumen &ndash; für Einheiten, die ein Volumen angeben wie Tasse oder Liter

source: Once all entries have been made, click the <guibutton>OK</guibutton> button to complete the addition, or the <guibutton>Cancel</guibutton> button to cancel the addition and close the box. Below, is an example of what the <interface>New Unit</interface> dialog box will look like once completed.
de: Haben Sie alles eingegeben, klicken Sie auf den Knopf <guibutton>OK</guibutton> oder den Knopf <guibutton>Abbrechen</guibutton>, um alle Änderungen zu verwerfen und den Dialog zu schließen. Unten sehen Sie ein Beispiel für den Dialog <interface>Neue Einheit</interface> mit allen ausgefüllten Einträgen.

source: Removing Units of Measure
de: Maßeinheiten entfernen

source: Completing Your Conversion Tables
de: Vervollständigen der Umwandlungstabelle

source: Here's a screenshot of the Mass Conversions tab in the &krecipes; Units component.
de: Bildschirmfoto der Karteikarte Einheitenumwandlung in der Komponente Einheiten von &krecipes;

source: Units Component &ndash; Mass Unit Conversions
de: Die Komponente „Einheiten“ &ndash; Umwandlung von Masseneinheiten

source: Here's a screenshot of the Volume Conversions tab in the &krecipes; Units component.
de: Bildschirmfoto der Karteikarte Volumenumwandlung in der Komponente Einheiten von &krecipes;

source: Units Component &ndash; Volume Unit Conversions
de: Die Komponente „Einheiten“ &ndash; Umwandlung von Volumeneinheiten

source: For large number equivalents, <emphasis>&krecipes;</emphasis> will automatically format the number with a <emphasis>thousands</emphasis> separator. For instance, to enter the milligram equivalent of 1 pound in the <emphasis>Mass Conversion</emphasis> table, you would enter 454000. Once you move off the cell, <emphasis>&krecipes;</emphasis> will display the number as 454,000.
de: Bei großen Zahlen wird die Anzeige automatisch mit einem Tausender-Trennzeichen formatiert. Geben Sie zum Beispiel die Menge von einem Pfund in Milligramm in der Tabelle <emphasis>Massenumwandlung</emphasis> ein, müssen Sie 45000 eintragen. Wechseln Sie dann die Zelle, zeigt &krecipes; die Zahl 454,000 an.

source: Using the Measurement Converter
de: Umgang mit dem Maßeinheiten-Umwandler

source: The <interface>Measurement Converter</interface> is accessed by selecting <guimenu>Tools</guimenu> and <guimenuitem>Measurement Converter</guimenuitem> from the &krecipes; menu. The interface can also be activated by using the <keycombo action="simul">&Ctrl;<keycap>M</keycap></keycombo> key combination.
de: Den Dialog <interface>Maßeinheiten-Umwandler</interface> öffnen Sie mit <menuchoice><guimenu>Extras</guimenu><guimenuitem>Maßeinheiten-Umwandler</guimenuitem></menuchoice> aus dem Menü von &krecipes;. Diesen Dialog können Sie auch mit dem Kurzbefehl <keycombo action="simul">&Ctrl;<keycap>M</keycap></keycombo> öffnen.

source: Here's a screenshot of the Measurement Converter tool.
de: Bildschirmfoto des Maßeinheiten-Umwandlers

source: The Measurement Converter.
de: Der Maßeinheiten-Umwandler

source: <title>The Preparation Methods Component</title>
de: <title>Die Komponente Zubereitungsmethoden</title>

source: Here's a screenshot of the &krecipes; Preparation Methods component.
de: Bildschirmfoto der Komponente „Zubereitungsmethoden“ von &krecipes;

source: <para>The Preparation Methods Component</para>
de: <para>Die Komponente Zubereitungsmethoden</para>

source: Adding a New Preparation Method
de: Eine Zubereitungsmethode hinzufügen

source: To add a new preparation method, click the <guibutton>Create...</guibutton> button that is seen in the upper right-hand portion of the screen. A dialog box will appear containing a text box that allows entry of the new preparation method under the heading <quote>New Preparation Method</quote>.
de: Um eine neue Zubereitungsmethode hinzuzufügen, klicken Sie auf den Knopf <guibutton>Erstellen ...</guibutton> rechts oben im Fenster. Dann wird ein Dialog mit einem Textfeld geöffnet, in dem der Name der neuen Zubereitungsmethode eingegeben werden kann.

source: Deleting a Preparation Method
de: Eine Zubereitungsmethode löschen

source: To remove a preparation method, first select the method to be removed from the list of preparation methods displayed. Then, click on the <guibutton>Delete</guibutton> button that is displayed in the upper, right-hand portion of the screen beneath the <guibutton>Create...</guibutton> button.
de: Um eine Zubereitungsmethode zu entfernen, wählen Sie sie zuerst in der angezeigten Liste aus. Klicken Sie dann auf den Knopf <guibutton>Löschen</guibutton> rechts oben im Fenster unter dem Knopf <guibutton>Erstellen ...</guibutton>,

source: Should no recipe utilize the preparation method selected for deletion, no prompt will be given.
de: Sollte kein Rezept die zum Löschen ausgewählte Zubereitungsmethode verwenden, gibt es keine Rückmeldung .

source: Editing Preparation Methods
de: Zubereitungsmethoden bearbeiten

source: Preparation methods can also be edited simply by double-clicking on the desired method.
de: Zubereitungsmethoden können bearbeitet werden, indem Sie auf eine Methode Doppelklicken.

source: <title>The Categories Component</title>
de: <title>Die Komponente „Kategorien“</title>

source: Here's a screenshot of the &krecipes; Categories component.
de: Bildschirmfoto der Komponente „Kategorien“ von &krecipes;

source: <para>The Categories Component</para>
de: <para>Die Komponente „Kategorien“</para>

source: Adding a New Category
de: Eine neue Kategorie erstellen

source: To add a new category, click on the <guibutton>Create...</guibutton> button.
de: Um eine neue Kategorie hinzuzufügen, klicken Sie auf den Knopf <guibutton>Erstellen ...</guibutton>.

source: Once the name of the new category has been entered in the text box, click the <guibutton>OK</guibutton> button to create the category and return to the category list. The list will now show the new category.
de: Ist der Name der neuen Kategorie in das Textfeld eingegeben, klicken Sie auf den Knopf <guibutton>OK</guibutton>, um die Kategorie zu erstellen und zur Kategorieliste zurückzukommen. Die Liste enthält jetzt die neue Kategorie.

source: To cancel the addition of a new category and clear the window, click on the <guibutton>Cancel</guibutton> button.
de: Um das Hinzufügen einer neuen Kategorie abzubrechen und das Fenster zu schließen, klicken Sie auf den Knopf <guibutton>Abbrechen</guibutton>.

source: Removing a Category
de: Löschen einer Kategorie

source: To remove a category, select it from the list of categories and click the <guibutton>Delete</guibutton> button.
de: Um eine Kategorie zu entfernen, wählen Sie sie in der Liste der Kategorien und drücken dann auf den Knopf <guibutton>Löschen</guibutton>.

source: A prompt will appear asking, <emphasis>Are you sure you want to remove this category and all its subcategories?</emphasis>. Click the <guibutton>Continue</guibutton> button to remove the category, or the <guibutton>Cancel</guibutton> button to cancel the removal.
de: Es wird eine Abfrage mit <emphasis>Sind Sie sicher, dass Sie diese Kategorie und alle Unterkategorien löschen möchten?</emphasis> angezeigt. Klicken Sie auf <guibutton>Fortsetzen</guibutton>, um die Kategorie zu entfernen oder auf <guibutton>Abbrechen</guibutton>, um das Entfernen abzubrechen.

source: Before deleting a category, ensure that it contains NO recipes! Despite the warning <emphasis>Are you sure you want to remove this category and all its subcategories?</emphasis>, clicking the <guibutton>Continue</guibutton> button will result in the deletion of the category whether or not it contains recipes!
de: Überprüfen Sie vor dem Löschen einer Kategorie, dass sie keine Rezepte mehr anhält.

source: The Authors Component
de: Die Komponente „Autor“

source: The <emphasis>Authors</emphasis> component is where the author or contributor of the recipe is maintained.
de: In der Komponente <emphasis>Autoren</emphasis> werden die Autoren und Mitwirkenden von Rezepten verwaltet.

source: Within this component, the component title appears at the top and the list of authors appears in the main portion of the window.
de: Hier wird der Titel der Komponente oben und die Liste der Autoren im Hauptteil des Fensters angezeigt.

source: Adding an Author or Contributor
de: Autoren oder Mitwirkende hinzufügen

source: To add an author/contributor, click on the <guibutton>Create...</guibutton> button on the right-hand side of the screen.
de: Um einen Autor hinzuzufügen, drücken Sie den Knopf <guibutton>Erstellen ...</guibutton> rechts auf der Seite.

source: A window will appear that allows entry of the author's name in the text box labeled <guilabel>New Author</guilabel>
de: Es wird ein Dialog angezeigt, in dem Sie den Namen des Autors in das Textfeld <guilabel>Neuer Autor</guilabel> eingeben können.

source: Here's a screenshot of the &krecipes; Authors Component showing the addition of a new author.
de: Bildschirmfoto der Komponente „Autoren“ von &krecipes; beim Hinzufügen eines neuen Autors

source: Authors Component &ndash; Adding an Author
de: Komponente „Autor“ &ndash; Autor hinzufügen

source: Once a name has been entered, click the <guibutton>OK</guibutton> button to create the entry, or the <guibutton>Cancel</guibutton> button to cancel entry of a new author's name and close the window.
de: Ist der Name eingegeben, drücken Sie den Knopf <guibutton>OK</guibutton>, um den Eintrag zu erstellen oder den Knopf <guibutton>Abbrechen</guibutton>, um den Eintrag zu verwerfen und den Dialog zu schließen.

source: Removing an Author/Contributor
de: Autor oder Mitwirkenden entfernen

source: To remove an author/contributor from the list, select the author from the list and click the <guibutton>Delete</guibutton> button on the right-hand side of the screen.
de: Um einen Autor aus der Liste zu entfernen, wählen Sie den Eintrag aus und drücken den Knopf <guibutton>Löschen</guibutton> rechts auf der Seite.

source: Setting Preferences in <emphasis>&krecipes;</emphasis>
de: Einstellungen in <emphasis>&krecipes;</emphasis> ändern

source: <emphasis>&krecipes;</emphasis> is extremely configurable and allows the setting of many preferences besides those defined in the <link linkend="krecipes-page-setup">Page Setup</link> section.
de: <emphasis>&krecipes;</emphasis> kann in großem Maß angepasst werden und ermöglicht die Änderung vieler Einstellungen außer denen im Abschnitt <link linkend="krecipes-page-setup">Seiteneinrichtung</link>.

source: Creating Shortcuts
de: Kurzbefehle erstellen

source: To access the Shortcut configuration interface, select <guimenu>Settings</guimenu> and <guimenuitem>Configure Shortcuts...</guimenuitem> from the <emphasis>&krecipes;</emphasis> menu. The <interface>Configure Shortcuts &ndash; &krecipes;</interface> screen will appear.
de: Um Kurzbefehle anzupassen, wählen Sie <menuchoice><guimenu>Einstellungen</guimenu> <guimenuitem>Kurzbefehle festlegen ...</guimenuitem></menuchoice> aus dem Menü. Dann wird der Dialog <interface>Kurzbefehle festlegen &ndash; &krecipes;</interface> angezeigt.

source: Here's a screenshot of the Configure Shortcuts &ndash; &krecipes; starting screen.
de: Bildschirmfoto des Einrichtungsdialogs von &krecipes; für die Kurzbefehle

source: Configure Shortcuts &ndash; <emphasis>&krecipes;</emphasis> Starting Point
de: Bildschirmfoto des Einrichtungsdialogs von &krecipes; für die Kurzbefehle

source: For more information read the section about <ulink url="help:/fundamentals/config.html#shortcuts">Using and Customizing Shortcuts</ulink> of the &kde; Fundamentals.
de: Weitere Informationen dazu finden Sie im Abschnitt <ulink url="help:/fundamentals/config.html#shortcuts">Kurzbefehle benutzen und anpassen</ulink> der &kde;-Grundlagen.

source: Customizing the Toolbar
de: Anpassung der Werkzeugleiste

source: To access the Toolbar configuration interface, select <guimenu>Settings</guimenu> and <guimenuitem>Configure Toolbars...</guimenuitem> from the <emphasis>&krecipes;</emphasis> menu. The <guilabel>Configure Toolbars &ndash; &krecipes;</guilabel> screen will appear.
de: Um die Werkzeugleiste anzupassen, wählen Sie <menuchoice><guimenu>Einstellungen</guimenu><guimenuitem>Werkzeugleisten einrichten ...</guimenuitem></menuchoice> aus dem Menü. Dann wird der Dialog <interface>Werkzeugleisten einrichten &ndash; &krecipes;</interface> angezeigt.

source: Here's a screenshot of the &krecipes; Toolbar configuration screen.
de: Bildschirmfoto des Einrichtungsdialogs von &krecipes; für die Werkzeugleisten.

source: Configure <emphasis>&krecipes;</emphasis> &ndash; Configure Toolbars interface
de: <emphasis>&krecipes;</emphasis> einrichten &ndash; Dialog zur Anpassung der Werkzeugleisten

source: From the screenshot, you will notice that choices available for addition to the toolbar are on the left under the heading <guilabel>Available actions:</guilabel>. On the right, under the heading <guilabel>Current actions:</guilabel> are the icons that presently appear on the toolbar &ndash; note that your toolbar, by default, may appear differently from that displayed in the screenshot.
de: Auf dem Bildschirmfoto sehen Sie die verfügbaren Elemente zum Einfügen in die Werkzeugleiste links in der Liste <guilabel>Verfügbare Aktionen</guilabel>. Rechts unter <guilabel>Angezeigte Aktionen</guilabel> werden die Aktionen angezeigt, die zurzeit in der Werkzeugleiste enthalten sind &ndash; beachten Sie, dass Ihre Werkzeugleiste sich von der hier gezeigten unterscheiden kann.

source: Between the two lists are four arrows, which allow for directional movement between the lists, or up and down in the list. When an item is selected from either list, the directional arrow(s) that are functional are colored, while the non-functional arrow(s) are grayed. Movement is accomplished by clicking on the appropriate directional arrow, as necessary, to move the selection into the desired position.
de: Zwischen den beiden Listen sehen Sie vier Pfeile, um Elemente zwischen und in den Listen zu verschieben. Wenn ein Eintrag in einer der Listen ausgewählt ist, werden die funktionsfähigen Pfeile farbig angezeigt, nicht funktionsfähige Pfeile dagegen grau. Die Verschiebung erfolgt durch Klicken auf den passenden Richtungspfeil, damit wird dann die Auswahl an die gewünschte Position verschoben.

source: The icon for your selection can be changed by clicking the <guibutton>Change Icon...</guibutton> button. This will bring up a window from which you can select the icon that you want to use. Once selected, click the <guibutton>OK</guibutton> button that appears on the icon selection screen to close the window and attach the icon to the toolbar selection.
de: Das Symbol für Ihre Auswahl kann geändert werden, indem Sie auf den Knopf <guibutton>Symbol ändern ...</guibutton> klicken. Damit öffnen Sie einen Dialog, in dem das gewünschte Symbol ausgewählt werden kann. Haben Sie ein Symbol gefunden, klicken Sie auf <guibutton>OK</guibutton> im Fenster der Symbolauswahl, um das Fenster zu schließen und das Symbol dem ausgewählten Eintrag der Werkzeugleiste zuzuweisen.

source: In order to apply your changes, you must click the <guibutton>Apply</guibutton> button that appears at the bottom of the <guilabel>Configure Toolbars &ndash; &krecipes;</guilabel> screen. This will apply your changes, but leave the window open in order to make other changes, if desired. To apply your changes and exit the interface, click the <guibutton>OK</guibutton> button. Clicking the <guibutton>Cancel</guibutton> will cancel <emphasis>any changes made since the last time the <guibutton>Apply</guibutton> button was clicked</emphasis>.
de: Um Ihre Änderungen zu übernehmen, müssen Sie auf den Knopf <guibutton>Anwenden</guibutton> unten im Dialog <guilabel>Werkzeugleisten einrichten &ndash; &krecipes;</guilabel> klicken. Damit werden die Änderungen übernommen, aber der Dialog bleibt für weitere Änderungen geöffnet. Um die Änderungen zu übernehmen und gleichzeitig den Dialog zu schließen, klicken Sie auf den Knopf <guibutton>OK</guibutton>. Klicken Sie auf <guibutton>Abbrechen</guibutton>, dann werden alle <emphasis>vorgenommen Änderungen</emphasis> verworfen, die seit dem letzten Klicken auf <guibutton>Anwenden</guibutton> gemacht wurden.

source: Configuring <emphasis>&krecipes;</emphasis>
de: <emphasis>&krecipes;</emphasis> einrichten

source: When you choose <guimenu>Settings</guimenu> and <guimenuitem>Configure &krecipes;</guimenuitem> from the <emphasis>&krecipes;</emphasis> menu, the <interface>&krecipes; Preferences - &krecipes;</interface> window appears. From this window, you can choose one of five pages to configure various aspects of <emphasis>&krecipes;</emphasis>.
de: Wenn Sie <menuchoice><guimenu>Einstellungen</guimenu> <guimenuitem>&krecipes; einrichten ...</guimenuitem></menuchoice> aus dem Menü wählen, wird der Dialog <interface>Einrichten - &krecipes;</interface> angezeigt. In diesem Dialog können Sie auf fünf Seiten verschiedenen Einstellungen für &krecipes; anpassen.

source: Server Settings
de: Server-Einstellungen

source: The first preference that you can configure is the <guilabel>Database Server Options</guilabel>. You will notice from the following screenshot that this label shows that an SQLite database has been selected. However, if the database selected is either <emphasis>MySQL</emphasis> or <emphasis>PostgreSQL</emphasis> the label would show the name of the appropriate database format. The <guilabel>Database file:</guilabel> label shows the complete path to the database file.
de: Als erstes können Sie das <guilabel>Datenbanksystem</guilabel> einstellen. Im folgenden Bildschirmfoto sehen Sie, dass eine SQLite-Datenbank ausgewählt ist. Wenn eine andere Datenbank wie <emphasis>MySQL</emphasis> oder <emphasis>PostgreSQL</emphasis>, wird dies in der Beschriftung angezeigt. Im Feld <guilabel>Datenbank-Datei</guilabel> sehen Sie den vollständigen Pfad zur Datenbank-Datei.

source: Here's a screenshot of the &krecipes; Server Settings configuration window.
de: Bildschirmfoto von &krecipes;-Einrichtungsdialog - Server-Einstellungen

source: Configure <emphasis>&krecipes;</emphasis> &ndash; Server Settings interface
de: <emphasis>&krecipes;</emphasis> einrichten &ndash; Server-Einstellungen

source: If you wanted to choose another database file, you would click on the <guiicon>File</guiicon> icon and in the window that appears, navigate to the location of the database file that you want to use. This change would be reflected in the <guilabel>Database file:</guilabel> text box.
de: Wenn Sie eine andere Datenbankdatei verwenden möchten, klicken Sie auf das Symbol <guiicon>Datei</guiicon> und wählen dann im Dialog den Speicherort der Datenbank aus, die Sie benutzen möchten. Die Änderung wird im Textfeld <guilabel>Datenbankdatei</guilabel> angezeigt.
