Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kde-workspace/kcontrol_desktop.po
Languages: de

source: Virtual Desktops
de: Virtuelle Arbeitsflächen

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Frank</firstname><surname>Schütte</surname><affiliation><address><email>F.Schuette@t-online.de</email></address></affiliation><contrib>Deutsche Übersetzung</contrib></othercredit> <othercredit role="translator"><firstname>Frank</firstname><surname>Brücker</surname><affiliation><address><email>f.bruecker@gmx.de</email></address></affiliation><contrib>Überarbeitung der Übersetzung</contrib></othercredit>

source: Systemsettings
de: Systemeinstellungen

source: desktop
de: Arbeitsfläche

source: Desktops
de: Arbeitsflächen

source: &kde; offers you the possibility to have several virtual desktops. In this tab you can configure the number of desktops, the number of rows in the <guilabel>Pager</guilabel> icon as well as their names. Just use the input box to adjust the number of desktops. You can assign names to the desktops by entering text into the text fields below.
de: &kde; bietet Ihnen die Möglichkeit, mehrere virtuelle Arbeitsflächen zu verwenden. Auf dieser Karteikarte legen Sie die Anzahl der Arbeitsflächen, die Anzahl der Zeilen im <guilabel>Arbeiflächen-Umschalter</guilabel> sowie die Namen der Arbeitsflächen fest. Verwenden Sie das Eingabefeld, um die Anzahl der Arbeitsflächen einzustellen. Sie weisen einer Arbeitsfläche einen Namen zu, indem Sie den Namen in das entsprechende Textfeld eingeben.

source: Enable <guilabel>Different widgets for each desktop</guilabel> to use independent widgets and wallpapers on each individual desktop.
de: Aktivieren Sie die Einstellung <guilabel>Unterschiedliche Miniprogramme für jede Arbeitsfläche</guilabel>, um getrennte Miniprogramme und Hintergrundbilder für jede einzelne Arbeitsfläche zu verwenden.

source: Switching
de: Wechsel

source: Desktop navigation wraps around
de: Automatisch zur Gegenseite navigieren

source: Enable this option if you want keyboard or active desktop border navigation beyond the edge of a desktop to take you to the opposite edge of the new desktop.
de: Aktivieren Sie diese Einstellung, wenn Sie möchten, dass die Navigation über eine Arbeitsfläche hinaus Sie automatisch zum entgegengesetzten Rand der neuen Arbeitsfläche bringt.

source: Desktop Effect Animation
de: Animation von Arbeitsflächen-Effekten

source: Select <guilabel>No Animation</guilabel>, <guilabel>Slide</guilabel>, <guilabel>Desktop Cube Animation</guilabel> or <guilabel>Fade Desktop</guilabel> from the drop down box. If the selected animation has settings options, click on the tools icon on the right of the drop down box to launch a configuration dialog.
de: Als Animation stehen <guilabel>Keine Animation</guilabel>, <guilabel>Gleiten</guilabel>, <guilabel>Animation Arbeitsflächen-Würfel</guilabel>, <guilabel>Animation ein-/ausblenden</guilabel> im Auswahlfeld zur Verfügung. Gibt es für die gewählte Animation Einstellungsoptionen, klicken Sie auf das Werkzeugsymbol rechts neben dem Auswahlfeld, um einen Einrichtungsdialog zu öffnen.

source: Desktop Switch On-Screen Display
de: On-Screen-Anzeige für Arbeitsflächenwechsel

source: Enable this option if you want to have an on-screen display for desktop switching.
de: Ist diese Einstellung aktiv, wird beim Wechseln der Arbeitsfläche eine OnScreen-Anzeige verwendet.

source: Show desktop layout indicators
de: Arbeitsflächenvorschau anzeigen

source: Enabling this option will show a small preview of the desktop layout indicating the selected desktop.
de: Wenn Sie diese Einstellung aktivieren, erhalten Sie eine kleine Vorschau, die das Layout der gewählten Arbeitsfläche anzeigt.

source: Shortcuts
de: Kurzbefehle

source: This section displays the configured shortcuts for switching the desktops and allows you to edit them.
de: In diesem Abschnitt werden die vorhandenen Kurzbefehle für den Arbeitsflächenwechsel angezeigt und können hier geändert werden.

source: Scrolling the mouse wheel over an empty space on the desktop or on the <guilabel>Pager</guilabel> icon in the panel will change to the next virtual desktop numerically, in the direction you scrolled (either up or down).
de: Bewegen Sie das Mausrads über einem leeren Bereich der Arbeitsfläche oder dem Symbol vom <guilabel>Arbeitsflächen-Umschalter</guilabel> in der Kontrollleiste, erfolgt ein Wechsel zur nächsten virtuellen Arbeitsfläche (in numerischer Reihenfolge). Die (numerische) Richtung wird hierbei durch die Bewegungsrichtung (rauf oder runter) des Mausrades bestimmt.
