Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kde-workspace/kcontrol_windowspecific.po
Languages: de

source: As mentioned, due to <link linkend="rule-evaluation">rule evaluation</link> processing, the <guilabel>Kopete Chat</guilabel> rule must precede the &kopete; rule:
de: Wie bereits erläutert, muss wegen der Reihenfolge der <link linkend="rule-evaluation">Regel-Auswertung</link> die Regel des <guilabel>Kopete-Chat</guilabel>-Fensters vor der &kopete;-Regel stehen.

source: Suppress a Window from showing on Pager
de: Ein Fenster von der Anzeige im Arbeitsflächen-Umschalter ausschließen

source: <guilabel>KNotes</guilabel> currently does not allow for its notes to skip the pager however a rule easily solves this shortcoming.
de: <guilabel>KNotes</guilabel>-Fenster können zurzeit nicht von der Anzeige im Arbeitsflächen-Umschalter ausgeschlossen werden, dieser Mangel lässt sich aber mit einer einfachen Regel beheben.

source: Assuming a <emphasis>sticky note</emphasis>' window is available:
de: Angenommen ein Fenster von KNotes ist geöffnet:

source: Use <guilabel>Detect Window Properties</guilabel> and select any <emphasis>sticky note</emphasis> window. Match only by primary class name so leave the check boxes unchecked - for additional information see <link linkend="window-matching">window matching</link>:
de: Benutzen Sie den Knopf <guilabel>Fenstereigenschaften ermitteln</guilabel> und wählen Sie beliebiges KNotes-Fenster aus. Es wird nur auf Übereinstimmung mit dem primären Klassennamen geprüft, daher lassen Sie die Ankreuzfelder deaktiviert. Zusätzliche Informationen finden Sie im Abschnitt <link linkend="window-matching">Fensterübereinstimmung</link>:

source: Enable the <guilabel>Skip Pager</guilabel> attribute with the <guilabel>Force</guilabel> <link linkend="parameters">parameter</link>:
de: Aktivieren Sie das Attribut <guilabel>Nicht in Arbeitsflächen-Umschalter</guilabel> mit dem <link linkend="parameters">Parameter</link> <guilabel>Erzwingen</guilabel>:

source: Force a Window to the Top
de: Ein Fenster immer im Vordergrund anzeigen

source: To pop an active window to the top, set its <guilabel>Focus stealing prevention</guilabel> attribute to <guilabel>None</guilabel>, typically, in conjunction with the <guilabel>Force</guilabel> <link linkend="parameters">parameter</link>:
de: Um ein aktives Fenster im Vordergrund anzuzeigen, setzen Sie das Attribut <guilabel>Vorbeugung gegen Übernahme der Aktivierung</guilabel> auf <guilabel>Kein</guilabel>, typischerweise mit dem <link linkend="parameters">Parameter</link> <guilabel>Erzwingen</guilabel>.

source: Multiple Rules per Application
de: Mehrere Regeln je Anwendung

source: <application>Thunderbird</application> has several different child windows. This example:
de: <application>Thunderbird</application> hat mehrere verschiedene Unterfenster wie im folgenden Beispiel gezeigt wird:

source: Pin <application>Thunderbird</application>'s main window on <emphasis>Virtual Desktop 1</emphasis> with a specific size and location on the desktop.
de: Anzeige des Hauptfensters von <application>Thunderbird</application> auf der <emphasis>virtuellen Arbeitsfläche 1</emphasis> mit einer bestimmten Größe und an einem bestimmten Platz auf dieser Arbeitsfläche.

source: Allow the <application>Thunderbird</application> composer window to reside on any desktop and when activated, force focus and pop it to the top of all windows.
de: Die Anzeige des <application>Thunderbird</application>-E-Mailfensters auf allen Arbeitsflächen erlauben und diesem Fenster bei der Aktivierung den Fokus geben und vor allen anderen Fenstern anzeigen.

source: Pop the <application>Thunderbird</application> reminder to the top and do not give it focus so it isn't inadvertently dismissed.
de: Anzeige des <application>Thunderbird</application>-Erinnerungsfensters vor allen anderen Fenster, es erhält aber nicht den Fokus, damit es nicht aus Versehen weggeklickt wird.

source: Each rule's matching criteria is sufficiently restrictive so their order within the main &kwin; window is not important to affect <link linkend="rule-evaluation">rule evaluation</link>.
de: Das passende Kriterium jeder Regel ist ausreichend einschränkend, daher wird die <link linkend="rule-evaluation">Regel-Auswertung</link> nicht durch die Reihenfolge im &kwin;-Fenster beeinflußt.

source: Thunderbird - Main
de: Thunderbird - Hauptfenster

source: Assuming the <guilabel>Thunderbird Main</guilabel> window is open, sized and position to suit:
de: Angenommen, das <guilabel>Thunderbird-Hauptfenster</guilabel> ist geöffnet und Größe und Position sind wie gewünscht eingestellt:

source: Use <guilabel>Detect Window Properties</guilabel> and select the <guilabel>Thunderbird Main</guilabel> window. Check the <guilabel>Window role</guilabel> box to restrict the criteria to the main window - for additional information see <link linkend="window-matching">window matching</link>:
de: Benutzen Sie den Knopf <guilabel>Fenstereigenschaften ermitteln</guilabel> und wählen Sie das <guilabel>Thunderbird-Hauptfenster</guilabel> aus. Wählen Sie das Ankreuzfeld <guilabel>Fensterrolle</guilabel>, damit das Kriterium nur auf das Hauptfenster angewendet wird. Zusätzliche Informationen finden Sie im Abschnitt <link linkend="window-matching">Fensterübereinstimmung</link>.

source: Thunderbird - Composer
de: Thunderbird-E-Mail

source: Assuming a <guilabel>Thunderbird Composer</guilabel> window is open:
de: Angenommen ein <guilabel>Thunderbird-E-Mail</guilabel>-Fenster ist geöffnet:

source: Use <guilabel>Detect Window Properties</guilabel> and select the <guilabel>Thunderbird Compose</guilabel> window. Check the <guilabel>Window role</guilabel> and <guilabel>Window type</guilabel> boxes to restrict the criteria to composition windows - for additional information see <link linkend="window-matching">window matching</link>:
de: Benutzen Sie den Knopf <guilabel>Fenstereigenschaften ermitteln</guilabel> und wählen Sie das <guilabel>Thunderbird-E-Mail</guilabel>-Fenster. Wählen Sie die Ankreuzfelder <guilabel>Fensterrolle</guilabel> <guilabel>Fenstertyp</guilabel>, damit das Kriterium nur auf das E-Mail-Fenster angewendet wird. Zusätzliche Informationen finden Sie im Abschnitt <link linkend="window-matching">Fensterübereinstimmung</link>:

source: Thunderbird - Reminder
de: Thunderbird-Erinnerung

source: Assuming a <guilabel>Thunderbird Reminder</guilabel> window is open:
de: Angenommen ein <guilabel>Thunderbird-Erinnerung</guilabel>-Fenster ist geöffnet:

source: Use <guilabel>Detect Window Properties</guilabel> and select the <guilabel>Thunderbird Reminder</guilabel> window. Check the <guilabel>Secondary class name</guilabel> and <guilabel>Window Type</guilabel> boxes to restrict the criteria to reminder windows - for additional information see <link linkend="window-matching">window matching</link>:
de: Benutzen Sie den Knopf <guilabel>Fenstereigenschaften ermitteln</guilabel> und wählen Sie das <guilabel>Thunderbird-Erinnerung</guilabel>-Fenster. Wählen Sie die Ankreuzfelder <guilabel>Sekundärer Klassenname</guilabel> <guilabel>Fenstertyp</guilabel>, damit das Kriterium nur auf das Erinnerungs-Fenster angewendet wird. Zusätzliche Informationen finden Sie im Abschnitt <link linkend="window-matching">Fensterübereinstimmung</link>:

source: Application Workarounds
de: Übergangslösungen für Anwendungen

source: Below are Workarounds for misbehaving applications.
de: Im folgenden finden Sie Übergangslösungen für fehlerhafte Anwendungen

source: If you are unfamiliar with creating &kwin; Rules, see this <link linkend="pin-a-window-to-a-desktop-and-set-other-attributes">detailed example</link> to base your new rule.
de: Kennen Sie sich mit der Erstellung von &kwin;-Regeln noch nicht aus, benutzen Sie dieses <link linkend="pin-a-window-to-a-desktop-and-set-other-attributes">ausführliche Beispiel</link> als Grundlage für Ihre neue Regel.

source: Full-screen Re-size Error
de: Fehlerhafte Größenänderung im Vollbildmodus

source: &Emacs; and <guilabel>gVim</guilabel>, when maximized (full-screen mode) and under certain conditions may encounter window re-sizing issues - see <ulink url="https://bugs.kde.org/show_bug.cgi?id=252314">Emacs window resizes ...</ulink> A &kwin; Rule will work-around the issue.
de: Bei &Emacs; and <guilabel>gVim</guilabel> treten unter bestimmten Umständen Größenänderungen des Fensters im Vollbildmodus auf, siehe <ulink url="https://bugs.kde.org/show_bug.cgi?id=252314">Emacs window resizes ...</ulink> Ein &kwin;-Regel kann diesen Fehler beheben.

source: Assuming an &Emacs; window is open:
de: Angenommen ein &Emacs;-Fenster ist geöffnet:

source: Use <guilabel>Detect Window Properties</guilabel> and select the &Emacs; window. Match only by <guilabel>primary class name</guilabel> so leave the check boxes unchecked - for additional information see <link linkend="window-matching">window matching</link>
de: Benutzen Sie den Knopf <guilabel>Fenstereigenschaften ermitteln</guilabel> und wählen Sie das &Emacs;-Fenster aus. Es wird nur auf Übereinstimmung mit dem primären Klassennamen geprüft, daher lassen Sie die Ankreuzfelder deaktiviert. Zusätzliche Informationen finden Sie im Abschnitt <link linkend="window-matching">Fensterübereinstimmung</link>.

source: Clicking <guilabel>OK</guilabel> in the previous window back-fills the results in the <guilabel>Window Matching</guilabel> tab. Enter a meaningful text in the <guilabel>Description</guilabel> text box:
de: Klicken Sie im oben gezeigten Fenster auf <guilabel>OK</guilabel>, damit die Parameter auf der Karteikarte <guilabel>Fensterübereinstimmung</guilabel> ausgefüllt werden. Geben Sie einen aussagekräftigen Text im Feld <guilabel>Beschreibung</guilabel> ein.

source: Ignore &Emacs;'s full-screen request by enabling the <guilabel>Obey geometry restrictions</guilabel> attribute, toggling it to off (<guilabel>No</guilabel>) to ignore and selecting the <guilabel>Force</guilabel> <link linkend="parameters">parameter</link>:
de: Ignorieren Sie die Anforderung des Programms &Emacs; zur Vollbildanzeige, indem Sie das Attribut <guilabel>Größeneinschränkungen beachten</guilabel> aktivieren, es mit <guilabel>Nein</guilabel> abschalten, sodass es ignoriert wird und wählen Sie den Parameter <guilabel>Erzwingen</guilabel>.

source: Credits and License
de: Danksagungen und Lizenz

source: Documentation Copyright see the UserBase <ulink url="http://userbase.kde.org/index.php?title=KWin Rules&amp;action=history">KWin Rules page history</ulink>
de: Copyright der Dokumentation siehe <ulink url="http://userbase.kde.org/index.php?title=KWin Rules&amp;action=history">Versionsgeschichte der Seite KWin-Regeln</ulink>

source: CREDIT_FOR_TRANSLATORS
de: <para>Übersetzung Matthias Kiefer <email>Matthias.Kiefer@gmx.de</email></para>
