Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kde-workspace/kcontrol_keyboard.po
Languages: de

source: Keyboard
de: Tastatur

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Carsten</firstname><surname>Niehaus</surname><affiliation><address><email>CNiehaus@gmx.de</email></address></affiliation><contrib>Deutsche Übersetzung</contrib></othercredit>

source: System Settings
de: Systemeinstellungen

source: keyboard
de: Tastatur

source: This module allows you to choose how your keyboard works.
de: Dieses Modul erlaubt es Ihnen, Einstellungen in Bezug auf Ihre Tastatur zu treffen.

source: There are three tabs in this module.
de: Es gibt drei Karteikarten in diesem Modul.

source: The Hardware tab
de: Die Karteikarte Hardware

source: The actual effect of setting these options depends upon the features provided by your keyboard hardware and the X server on which &kde; is running. As an example, you may find that changing the key click volume has no effect because that feature is not available on your system.
de: Der tatsächliche Effekt der Einstellung dieser Optionen hängt von den Funktionen ihrer Tastatur und des X-Servers ab, auf dem &kde; läuft. Zum Beispiel könnte das Verändern der Klicklautstärke bei Ihrem System keine Wirkung zeigen, da Ihr System diese Funktion nicht unterstützt.

source: Keyboard model:
de: Tastatur-Modell:

source: Here you can set your keyboard model. This setting is independent of your keyboard layout and refers to the &quot;hardware&quot; model, i.e. the way your keyboard is manufactured. Modern keyboards that come with your computer usually have two extra keys and are referred to as &quot;104-key&quot; models, which is probably what you want if you do not know what kind of keyboard you have.
de: Hier können Sie das Modell Ihrer Tastatur auswählen. Diese Auswahl ist unabhängig von Ihrem Tastaturlayout und bezieht sich auf das tatsächliche physikalische Modell. Neuere Tastaturen haben zwei zusätzliche Tasten, diese nennt man <quote>104-Tasten</quote>-Tastaturen. Falls Sie das genaue Modell Ihrer Tastatur nicht kennen, ist dies vermutlich die richtige Auswahl.

source: NumLock on KDE Startup
de: Zahlenblock beim KDE-Start

source: You can choose to either always <guilabel>Turn on</guilabel> or <guilabel>Turn off</guilabel> the NumLock when &kde; starts, or you can choose to have &kde; leave NumLock at whatever it was set to before &kde; started up.
de: Hier kann man auswählen, ob &kde; Zahlenblock beim Start immer <guilabel>Einschalten</guilabel>, <guilabel>Ausschalten</guilabel> oder den Zustand dieser Taste <guilabel>Unverändert lassen</guilabel> soll.

source: Keyboard Repeat
de: Tastenwiederholung

source: When this option is turned on, pressing and holding down a key emits the same character repeatedly until the key is released. Pressing and holding the key will have the same effect as pressing it multiple times in succession.
de: Wenn diese Option angewählt ist, bewirkt andauerndes Gedrückthalten einer Taste, dass das entsprechende Zeichen solange ausgegeben wird, wie die Taste gedrückt wird. Das andauernde Gedrückthalten einer Taste hat somit denselben Effekt wie ein ständig wiederholtes Drücken einer Taste.

source: Almost all users will want to have this option enabled, because it makes navigating through documents with the arrow keys significantly easier.
de: Fast alle Benutzer werden diese Option anwählen, weil es das Navigieren durch Dokumente mit den Pfeiltasten erheblich vereinfacht.

source: Delay
de: Verzögerung

source: This option allows you to set the delay after which a pressed key will start generating keycodes.
de: Diese Einstellung legt die Verzögerung fest, nach der Zeichen ausgegeben werden, wenn Sie eine Taste gedrückt halten.

source: Rate
de: Geschwindigkeit

source: This option allows you to set the rate at which keycodes are generated while a key is pressed.
de: Diese Einstellung legt die Wiederholrate fest, mit der Zeichen ausgegeben werden, solange Sie eine Taste gedrückt halten.

source: Key click volume
de: Klicklautstärke

source: If supported, this option allows you to hear audible clicks from your computer's speakers when you press the keys on your keyboard. In essence, this simulates the <quote>click</quote> of a mechanical type-writer. You can change the loudness of the key click feedback by dragging the slider button. Setting the volume to 0% by moving the slider to the left turns off the key click.
de: Wenn es auf Ihrer Hardware unterstützt wird, erlaubt es diese Funktion Ihrem Computer-Lautsprecher einen Klickton auszugeben, wenn Sie eine Taste drücken. Im Wesentlichen ahmt diese Funktion die Geräusche einer mechanischen Schreibmaschine nach. Die Lautstärke des Geräusches können Sie mit dem Schieberegler verändern. Schieben Sie den Regler ganz nach links, dann ist das Klicken ausgeschaltet.

source: Type some characters into the <guilabel>Test area</guilabel> text box to verify the volume you selected.
de: Tippen Sie einige Zeichen im <guilabel>Testbereich</guilabel>, um die ausgewählte Lautstärke zu überprüfen.

source: Many computers won't support this function.
de: Viele Computer unterstützen diese Funktion nicht.

source: Very few people would choose to enable this option, since it generally annoys everyone else in the room. However, if your heart yearns for the pre-soft-key era, this may help you to re-experience the warm sentimentality of days-gone-by.
de: Nur wenige Personen werden diese Funktion nutzen, da sie normalerweise jeden anderen im Zimmer belästigt. Wie auch immer, wenn sie für die alten Tage schwärmen, denn mag Ihnen dies helfen, die Gefühle längst vergangener Zeiten wieder aufleben zu lassen.

source: The Layouts tab
de: Die Karteikarte Belegungen

source: This tab lets you choose what keyboard layouts you want to use, what indicator you want in the system tray, how you want to switch and which shortcuts you will use.
de: Auf dieser Karteikarte können Sie eine Tastaturbelegung, das Anzeigesymbol im Systemabschnitt der Kontrollleiste, Umschaltregelungen und Kurzbefehle zum Belegungswechsel einstellen.

source: Layout Indicator
de: Belegungsanzeige

source: You can choose to <guilabel>Show layout indicator</guilabel> which will show the language iso name in the system tray. You can choose to show the indicator even if you have a single layout enabled and you can show the language flag instead of only the ISO code by checking <guilabel>Show flag</guilabel>.
de: Mit der Einstellung <guilabel>Belegungsanzeige aktivieren</guilabel> wird der ISO-Name der Belegung im Systemabschnitt der Kontrollleiste angezeigt. Auch bei nur einer Belegung kann die Anzeige dieses Symbols eingeschaltet werden. Mit der Auswahl von <guilabel>Fahne anzeigen</guilabel> wird eine Fahne mit dem Sprachsymbol anstelle des ISO-Namens angezeigt.

source: Switching Policy
de: Umschaltregelung

source: If you select <guilabel>Application</guilabel> or <guilabel>Window</guilabel> switching policy, changing the keyboard layout will only affect the current application or window. <guilabel>Global</guilabel> will change the keyboard layout globally and <guilabel>Desktop</guilabel> will change it only for the current virtual desktop.
de: Falls Sie die Umschaltregelung <guilabel>Anwendung</guilabel> oder <guilabel>Fenster</guilabel> wählen, gilt die Änderung der Tastaturbelegung nur für das aktuelle Programm oder Fenster. <guilabel>Global</guilabel> ändert die Tastaturbelegung global und <guilabel>Arbeitsfläche</guilabel> nur für die gerade benutzte virtuelle Arbeitsfläche.

source: Shortcuts for Switching Layout
de: Kurzbefehle zum Belegungswechsel

source: <guilabel>Main shortcuts</guilabel> is a shortcut for switching layouts which is handled by X.org. <guilabel>3rd level shortcuts</guilabel> is a shortcut for switching to a third level of the active layout (if it has one) which is handled by X.org. It allows modifier-only shortcuts. <guilabel>Alternative shortcut</guilabel> is a shortcut for switching layouts which is handled by &kde;. It does not support modifier-only shortcuts and also may not work in some situations (&eg; if popup is active or from screensaver).
de: Die <guilabel>Haupt-Kurzbefehle</guilabel> zum Belegungswechsel werden von X.org behandelt. <guilabel>Kurzbefehle für die 3. Ebene</guilabel> dienen zum Wechseln in eine dritte Ebene der aktiven Belegung - sofern diese Ebene dafür definiert ist, auch das wird von X.org behandelt. Hier können nur Sondertasten ausgewählt werden. Der <guilabel>Alternative Kurzbefehl</guilabel> wird von &kde; behandelt. Hier können nicht Sondertasten allein gewählt werden. Diese alternativen Kurzbefehle funktionieren unter bestimmten Bedingungen nicht richtig, zum Beispiel wenn ein Benachrichtigungsfenster angezeigt wird oder der Bildschirmschoner eingeschaltet ist.

source: Configure layouts
de: Belegungen einrichten

source: If you check <guilabel>Configure layouts</guilabel> you will be able to add and remove keyboard layouts in order to switch between them when you need.
de: Aktivieren Sie <guilabel>Belegungen einrichten</guilabel>, dann können Sie Tastaturbelegungen hinzufügen oder löschen, um dann zwischen Ihnen zu wechseln.

source: Clicking on <guibutton>Add</guibutton> will open a dialog where you will be able to choose the new keyboard layout you want to add as well as its variant, label and shortcut.
de: Klicken Sie auf <guibutton>Hinzufügen</guibutton>, damit öffnen Sie einen Dialog, aus dem Sie eine neue Tastaturbelegung mit seinen Varianten, Beschriftung und Kurzbefehl auswählen können.

source: The list of layouts right to the <guilabel>Layout</guilabel> label in the <guilabel>Add Layout</guilabel> dialog can be narrowed down using <guilabel>Limit selection by language</guilabel> drop-down list. You can click on <guibutton>Preview</guibutton> button to preview chosen layout in a separate window.
de: Die Liste der Tastaturbelegungen rechts neben dem Feld <guilabel>Belegung</guilabel> im Dialog <guilabel>Belegung hinzufügen</guilabel> kann mit dem Auswahlfeld <guilabel>Auswahl nach Sprache beschränken</guilabel> eingegrenzt werden. Durch Klicken auf <guibutton>Vorschau</guibutton> wird ein eigenes Fenster mit einer Vorschau der gewählten Tastaturbelegung angezeigt.

source: You can order the layouts with the up and down buttons, the top one being the default one.
de: Die Reihenfolge der Einträge können Sie mit <guibutton>Nach oben</guibutton> und <guibutton>Nach unten</guibutton> ändern, die erste Tastaturbelegung in der Liste wird als Standard verwendet.

source: Spare layouts
de: Zusätzliche Belegungen

source: This option can be enabled only if you have more than two layouts.
de: Diese Einstellung kann nur dann aktiviert werden, wenn Sie mehr als zwei Belegungen hinzugefügt haben.

source: Spare layouts allow to toggle between small number of layouts easily while keeping more layouts handy close by. For example you might use 3 languages: English, Ukrainian and German but first two are used often and third one just occasionally. In this case you can configure first two as main layouts (setting <guilabel>Main layout count</guilabel>: 2) and German one as spare one - when you toggle with keyboard and left mouse button the switch will happen between main layouts only but you can always choose 3rd layout with context menu.
de: Mit zusätzlichen Belegungen können Sie zwischen einer kleinen Anzahl von Belegungen wechseln und die häufig benutzen Belegungen sind schnell zu erreichen. Sie möchten zum Beispiel drei Belegungen verwenden: Englisch, Ukrainisch und Deutsch. Von diesen werden die ersten beiden Belegungen häufig benutzt, die dritte nur selten. In diesem Fall richten Sie die ersten beiden als Haupt-Belegungen ein, indem Sie die <guilabel>Anzahl Haupt-Belegungen</guilabel> auf 2 setzen. Deutsch wird dann die zusätzliche Belegung. Mit der Tastatur oder durch Klicken mit der linken Maustaste wechseln Sie zwischen den Haupt-Belegungen. Die dritte zusätzliche Belegung ist dann über das Kontextmenü zu erreichen.

source: When spare layout is chosen it replaces the last main layout (this is done for technical reasons, usually global shortcuts work based on the 1st active layout so it's more reliable to preserve the 1st layout when allowing to activate spare layouts).
de: Eine ausgewählte zusätzliche Belegung ersetzt die letzte Hauptbelegung. Dies erfolgt aus technischen Gründen. Normalerweise funktionieren globale Kurzbefehle auf der Grundlage der ersten Belegung. Daher ist es sicherer die erste Belegung zu erhalten, wenn zusätzliche Belegungen benutzt werden sollen.

source: As X.org only allows to have 4 layouts to switch <quote>spare layouts</quote> feature also allows to overcome this limitation: user can have up to 4 main layouts (managed by X.org) but 4 more spare layouts allowed (managed by layout switcher). Thus user can conveniently work with up to total of 8 layouts (although the 4 spare layouts limit can be raised in the future).
de: Der X.Org-Server erlaubt nur zwischen vier Belegungen zu wechseln. Mit <quote>Zusätzlichen Belegungen</quote> kann diese Einschränkung überwunden werden: Benutzer können vier Haupt-Belegungen (vom X.Org-Server verwaltet) benutzen. Zusätzlich noch vier weitere Belegungen, die vom Belegungs-Umschalter verwaltet werden. Daher können bis zu 8 Belegungen leicht gehandhabt werden. Die Anzahl der zusätzlichen Belegungen kann zukünftig einfach erhöht werden.

source: The Advanced tab
de: Die Karteikarte Erweitert

source: In this tab, if you check <guilabel>Configure keyboard options</guilabel> you will then be able to set a few options regarding some keys settings. You can expand these options by clicking on the &gt; symbol on the left of the option then you choose your setting in the expanded list.
de: Aktivieren Sie auf dieser Karteikarte <guilabel>Tastatureinstellungen ändern</guilabel>, dann können Sie weitere Einstellungen für Tasten einrichten. Klicken Sie auf das Symbol &gt; links vor einer Einstellung, um weitere Untereinträge aufzuklappen und daraus auszuwählen.
