Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kde-workspace/kcontrol_windowspecific.po
Languages: de

source: Place the window on the specified <emphasis>(Virtual) Desktop</emphasis>. Use <guilabel>All Desktops</guilabel> to place the window on all <emphasis>Virtual Desktops</emphasis>.
de: Platziert das Fenster auf der angegebenen <emphasis>(Virtuellen) Arbeitsfläche</emphasis>. Mit <guilabel>Alle Arbeitsflächen</guilabel> wird das Fenster auf allen <emphasis>virtuellen Arbeitsflächen</emphasis> platziert.

source: Minimized, Shaded
de: Minimiert, Eingefahren

source: Toggle the Minimize and Shading window attribute. For example, a window can be started Minimized or if it is started Minimized, it can be forced to not.
de: Schaltet die Fensterattribute Minimiert und Eingefahren ein oder aus. Ein Fenster kann zum Beispiel beim Start minimiert sein, oder das minimierte Starten kann verhindert werden.

source: Maximized attribute is emulated by using both <guilabel>Maximized horizontally</guilabel> and <guilabel>Maximized vertically</guilabel> or <guilabel>Initial placement</guilabel> with the <guilabel>Maximizing</guilabel> argument.
de: Das Attribut Maximiert wird emuliert, in dem sowohl <guilabel>Waagerecht maximiert</guilabel> und <guilabel>Senkrecht maximiert</guilabel> oder <guilabel>Anfangsplatzierung</guilabel> mit dem Argument <guilabel>Maximiert</guilabel> verwendet wird.

source: Initial placement
de: Anfangsplatzierung

source: Override the global window placement strategy with one of the following:
de: Überschreibt die globale Platzierungsstrategie mit einem der folgenden Werte:

source: <guilabel>Default</guilabel> - use the global window placement strategy.
de: <guilabel>Voreinstellung</guilabel> - Benutzt die globale Platzierungsstrategie des Fensters.

source: <guilabel>No Placement</guilabel> - top-left corner.
de: <guilabel>Ohne feste Position</guilabel> - Linke obere Ecke

source: <guilabel>Smart</guilabel> - place where no other window exists.
de: <guilabel>Intelligent</guilabel> - Das Fenster wird an eine freie Stelle auf der Arbeitsfläche platziert.

source: <guilabel>Maximizing</guilabel> - start the window maximized.
de: <guilabel>Maximiert</guilabel> - Startet das Fenster im Vollbildmodus.

source: <guilabel>Cascade</guilabel> - staircase-by-title.
de: <guilabel>Gestaffelt</guilabel> - Treppenförmige Anordnung der Titelleisten

source: <guilabel>Centered</guilabel> - center of the desktop.
de: <guilabel>Zentriert</guilabel> - Mitten auf der Arbeitsfläche.

source: Random
de: Zufällig

source: Top-Left Corner
de: Linke obere Ecke

source: Under Mouse
de: Unter Mauszeiger

source: <guilabel>On Main Window</guilabel> - restrict placement of a child window to the boundaries of the parent window.
de: <guilabel>Über Hauptfenster</guilabel> - Begrenzt die Platzierung des Unterfensters auf die Ausmaße des Hauptfensters.

source: Ignore requested geometry
de: Angeforderte Geometrie ignorieren

source: Toggle whether to accept or ignore the window's requested geometry position. To avoid conflicts between the default placement strategy and the window's request, the placement strategy is ignored when the window's request is accepted.
de: Legt fest, ob die vom Fenster angeforderte Geometrie ignoriert wird. Um Konflikte mit der Standardstrategie zur Platzierung der Anforderung des Fensters zu vermeiden, wird Platzierungsstrategie ignoriert, wenn die Anforderung des Fensters erfüllt wurde.

source: Minimum size, Maximum size
de: Maximalgröße, Minimalgröße

source: The minimum and maximum size allowed for the window.
de: Die erlaubte minimale und maximale Größe des Fensters.

source: Obey geometry restrictions
de: Größeneinschränkungen beachten

source: Toggle whether to adhere to the window's requested aspect ratio or <emphasis>base increment</emphasis>.In order to understand this attribute, some background is required. Briefly, windows must request from the Window Manager, a base increment: the minimum number of <emphasis>height</emphasis> X <emphasis>width</emphasis> pixels per re-size request. Typically, it's 1x1. Other windows though, for example terminal emulators or editors, use fixed-fonts and request their base-increment according to the size of one character.
de: Diese Einstellung bestimmt, ob für ein Fenster das angeforderte Seitenverhältnis oder die <emphasis>Basis-Schrittweite der Fenstervergößerung</emphasis> beachtet wird. Um dieses Attribut zu verstehen, ist ein wenig Hintergrundwissen erforderlich. Fenster müssen beim Fenstermanager eine Basis-Schrittweite der Fenstervergößerung anfordern: Die minimale Anzahl von Pixeln für <emphasis>Höhe</emphasis> x <emphasis>Breite</emphasis>. Dieser Wert ist normalerweise 1 x 1. Fenster wie zum Beispiel ein Terminalemulator oder ein Texteditor, die Schriften mit fester Breite verwenden, haben eine Basis-Schrittweite von der Größe eines Zeichens.

source: <title>Arrangement &amp; Access</title>
de: <title>Anordnung &amp; Zugriff</title>

source: Keep above, Keep below
de: Im Vordergrund halten, Im Hintergrund halten

source: Toggle whether to keep the window above/below all others.
de: Schaltet um, ob das Fenster vor oder hinter allen anderen Fenstern bleiben soll.

source: Autogroup with identical
de: Autogruppierung für Identische

source: Toggle the grouping (commonly known as <emphasis>tabbing</emphasis>) of windows.
de: Schaltet die Gruppierung von Fenstern als <emphasis>Unterfenster</emphasis> ein oder aus.

source: Autogroup in foreground
de: Autogruppierung im Vordergrund

source: Toggle whether to make the window active when it is added to the current Autogroup.
de: Legt fest, ob das Fenster aktiviert wird, wenn es zur aktuellen Autogruppe hinzugefügt wird.

source: Autogroup by ID
de: Autogruppierung nach Kennung

source: Create a group via a user-defined ID. More than one rule can share the same ID to allow for seemingly unrelated windows to be grouped.
de: Erstellt eine Gruppe über eine benutzerdefinierte Kennung. Mehr als eine Regel kann die gleiche Kennung verwenden, das erlaubt die Gruppierung von scheinbar nicht zusammengehörigen Fenstern.

source: Tiling
de: Kacheln

source: Override the default window behavior to either <guilabel>Tiled</guilabel> or <guilabel>Floating</guilabel>.
de: Überschreibt das Standard-Fensterverhalten entweder mit <guilabel>Gekachelt</guilabel> oder <guilabel>Schwebend</guilabel>.

source: Skip taskbar
de: Nicht in Kontrollleiste

source: Toggle whether to display the window in the taskbar.
de: Schaltet die Anzeige des Fensters in der Kontrollleiste ein oder aus.

source: Skip pager
de: Nicht in Arbeitsflächen-Umschalter

source: Toggle whether to display the window in pager:
de: Schaltet die Anzeige des Fensters im Arbeitsflächen-Umschaltern ein oder aus:

source: Skip switcher
de: Nicht in Anwendungsumschalter

source: Toggle whether to display the window in the <guilabel>ALT+TAB</guilabel> list.
de: Schaltet die Anzeige des Fensters im Anwendungsumschalter (&Alt;+&Tab;) ein oder aus.

source: Shortcut
de: Kurzbefehl

source: Assign a shortcut to the window. When <guilabel>Edit...</guilabel> is clicked, additional instructions are presented.
de: Weist einen Kurzbefehl einem Fenster zu. Drücken Sie auf <guilabel>Bearbeiten ...</guilabel>, dann wird ein Dialog mit weiteren Informationen geöffnet.

source: <title>Appearance &amp; Fixes</title>
de: <title>Erscheinungsbild &amp; Korrekturen</title>

source: No titlebar and frame
de: Ohne Titelleiste und Rahmen

source: Toggle whether to display the titlebar and frame around the window.
de: Schaltet die Anzeige von Titelleiste und Rahmen ein oder aus.

source: Active/Inactive opacity
de: Deckkraft (aktiv/inaktiv)

source: When the window is active/inactive, set its opacity to the percentage specified.
de: Setzt die Deckkraft eines aktiven/nicht-aktiven Fenster auf den angegebenen Prozentwert.

source: <guilabel>Active/Inactive opacity</guilabel> can only be affected when <guilabel>Desktop Effects</guilabel> are enabled.
de: <guilabel>Deckkraft (aktiv/inaktiv)</guilabel> kann nur benutzt werden, wenn <guilabel>Arbeitsflächeneffekte</guilabel> eingeschaltet sind.

source: Moving/resizing
de: Verschiebung/Größenänderung

source: Deprecated as of &gt;4.8
de: Veraltet in &kde; &gt;4.8

source: Focus stealing prevention
de: Vorbeugung gegen Übernahme der Aktivierung

source: When a window wants focus, control on a scale (from <guilabel>None</guilabel> to <guilabel>Extreme</guilabel>) whether to honor the request and place above all other windows, or ignore its request (potentially leaving the window behind other windows):
de: Wenn ein Fenster aktiviert werden soll, kann auf einer Skala von <guilabel>Keine</guilabel> bis <guilabel>Extrem</guilabel> eingestellt werden, ob diese Anforderung stattgegeben und das Fenster vor allen anderen platziert wird oder ob die Anforderung ignoriert wird. Letzteres führt möglicherweise dazu, dass das Fenster durch andere Fenster verdeckt wird.

source: None - Always grant focus to the window.
de: Keine - Das Fenster wird immer aktiviert.

source: <para>Low</para>
de: <para>Niedrig</para>

source: High
de: Hoch

source: Extreme - The window's focus request is denied. Focus is only granted by explicitly requesting via the mousing.
de: Extrem - Die Anforderung des Fensters zur Aktivierung wird verweigert. Eine Aktivierung ist ausdrücklich nur mit der Maus möglich.

source: See <guilabel>Accept focus</guilabel> to make a window read-only - not accept any keyboard input.
de: Benutzen Sie <guilabel>Aktivierung zulassen</guilabel>, um ein Fenster nur lesbar zumachen. Dann nimmt es keine Tastatureingaben an.

source: Accept focus
de: Aktivierung zulassen

source: Toggle whether the window accepts keyboard input. Make the window read-only.
de: Schaltet ein oder aus, ob ein Fenster Tastatureingaben annimmt. Macht das Fenster nur-lesbar.

source: Ignore global shortcuts
de: Globale Kurzbefehle ignorieren

source: Toggle whether to ignore global shortcuts (as defined by <menuchoice><guimenu>System Settings</guimenu><guisubmenu>Shortcuts and Gestures</guisubmenu><guimenuitem>Global Shortcuts</guimenuitem></menuchoice> or by running <varname>kcmshell4 keys</varname> in <guilabel>konsole</guilabel>) while the window is active.
de: Bestimmt, ob globale Kurzbefehle ignoriert werden, wenn das Fenster den Fokus hat. Die globalen Kurzbefehle werden mit <menuchoice><guimenu>Systemeinstellungen</guimenu><guisubmenu>Kurzbefehle und Gestensteuerung</guisubmenu><guimenuitem>Globale Kurzbefehle</guimenuitem></menuchoice> oder durch Starten von <varname>kcmshell4 keys</varname> in einer &konsole; geändert.

source: Closeable
de: Schließbar

source: Toggle whether to display the <guilabel>Close</guilabel> button on the title bar.
de: Schaltet die Anzeige des Knopfes <guilabel>Schließen</guilabel> ein oder aus.

source: A terminal window may still be closed by the end user by ending the shell session however using <guilabel>Accept focus</guilabel> to disable keyboard input will make it more difficult to close the window.
de: Ein Terminalfenster kann immer noch durch den Benutzer geschlossen werden, indem er die Sitzung des Shell beendet. Schalten Sie jedoch <guilabel>Aktivierung zulassen</guilabel> aus, um Tastatureingaben zu verhindern, dann wird es noch schwerer, das Fenster zu schließen.

source: <emphasis role="bold">Window type</emphasis>
de: <emphasis role="bold">Fenstertyp</emphasis>

source: Change the window to another type and inherit the characteristics of that window:
de: Ändert das Fenster zu einem andern Typ und übernimmt die Charakteristiken dieses Fensters.

source: Normal Window
de: Normales Fenster

source: Dialog Window
de: Dialogfenster

source: Utility Window
de: Dienstprogrammfenster

source: Dock (panel)
de: Andocken (Kontrollleiste)

source: Toolbar
de: Werkzeugleiste

source: Torn-Off Menu
de: Abreißmenü

source: Splash Screen
de: Begrüßungsbildschirm

source: <para>Desktop</para>
de: <para>Arbeitsfläche</para>

source: Standalone Menubar
de: Selbständige Menüleiste

source: Use with care because unwanted results may be introduced. For example, a <guilabel>Splash Screen</guilabel> is a automatically closed by &kwin; when clicked.
de: Benutzen Sie dies mit Vorsicht, da es zu ungewollten Ergebnissen führen kann. Ein <guilabel>Begrüßungsbildschirm</guilabel> zum Beispiel wird automatisch durch &kwin; geschlossen, wenn Sie darauf klicken,

source: Block compositing
de: Compositing blockieren

source: Toggle whether to disable compositing while the window <emphasis>exists</emphasis>. If compositing is enabled and the rule specifies to disable compositing, while <emphasis>any</emphasis> matching window exists, compositing will be disabled. Compositing is re-enabled when the last matching window terminates.
de: Schaltet das Blockieren von Compositing ein oder aus, während das Fenster <emphasis>existiert</emphasis>. Ist Compositing aktiviert und eine Regel legt fest, Compositing abzuschalten, wird das ausgeführt, solange noch <emphasis>irgendein</emphasis> Fenster existiert.

source: Examples
de: Beispiele

source: The first example details all the necessary steps to create the rules. In order to keep this page a manageable size, subsequent examples only list steps specific to the example.
de: Im ersten Beispiel werden alle erforderlichen Schritte zur Erstellung einer Regel ausführlich erläutert. In den nachfolgenden Beispielen werden dann immer nur noch die speziellen Schritte für das Beispiel erklärt.

source: The <guilabel>Pager</guilabel> attribute refers to the <guilabel>Virtual Desktop Manager</guilabel>:
de: Das Attribut <guilabel>Arbeitsflächen-Umschalter</guilabel> bezieht sich auf die Verwaltung der <guilabel>Virtuellen Arbeitsflächen</guilabel>:

source: Pin a Window to a Desktop and set other Attributes
de: Die Anzeige eines Fensters auf eine Arbeitsfläche beschränken und andere Attribute

source: Pin &akregator; to <emphasis>Virtual Desktop 2</emphasis>. Additionally, start the application with a preferred size and position. For each attribute, use the <guilabel>Apply Initially</guilabel> <link linkend="parameters">parameter</link> so it can be overridden at run-time.
de: Beschränkung der Anzeige von &akregator; auf die <emphasis>Virtuelle Arbeitsfläche 2</emphasis>. Zusätzlich soll das Programm mit einer bevorzugten Größe und Position angezeigt werden. Verwenden Sie für jedes Attribut den <link linkend="parameters">Parameter</link> <guilabel>Bei Initialisierung anwenden</guilabel>, damit er zur Laufzeit überschrieben werden kann.

source: The &kwin; rule is created as follows:
de: Die &kwin;-Regel wird wie folgt erstellt:

source: Start &akregator; on <emphasis>desktop two</emphasis>, size and position it to suit:
de: Starten Sie &akregator; auf <emphasis>Arbeitsfläche 2</emphasis> und stellen Sie Größe und Position des Fensters nach Ihren Wünschen ein.

source: Right-click on the titlebar and select <menuchoice><guimenu>More Actions</guimenu><guimenuitem>Window Manager Settings...</guimenuitem></menuchoice>:
de: Klicken Sie mit der &RMBn; auf die Titelleiste und wählen Sie <menuchoice><guimenu>Weitere Aktionen</guimenu><guimenuitem>Einstellungen für die Fensterverwaltung ...</guimenuitem></menuchoice>:

source: Select the <guilabel>Window Rules</guilabel> in the left column and click on <guilabel>New...</guilabel>:
de: Wählen Sie <guilabel>Fensterregeln</guilabel> in der linken Spalte und klicken Sie dann auf <guilabel>Neu ...</guilabel>:

source: The <guilabel>Edit Window-Specific Settings</guilabel> window is displayed. <guilabel>Window matching</guilabel> is the default tab:
de: Der Dialog <guilabel>Festlegen von fensterspezifischen Einstellungen</guilabel> wird angezeigt, die Karteikarte <guilabel>Fensterübereinstimmung</guilabel> ist bereits ausgewählt:

source: Click <guilabel>Detect Window Properties</guilabel> with <guilabel>0s delay</guilabel> the cursor immediately turns into cross-hairs. Click (anywhere) inside the &akregator; window (but not the title bar). The window criteria are presented. Match only by primary class name so leave the check boxes unchecked - for additional information see <link linkend="window-matching">window matching</link>:
de: Klicken Sie auf <guilabel>Fenstereigenschaften ermitteln</guilabel> mit <guilabel>0 Sekunden Verzögerung</guilabel>, dann wird als Mauszeiger sofort ein Fadenkreuz angezeigt, Klicken Sie irgendwo in das &akregator;-Fenster, aber nicht in die Titelleiste. Die Kriterien des Fensters werden nun angezeigt. Es wird nur auf Übereinstimmung mit dem primären Klassennamen geprüft, daher lassen Sie die Ankreuzfelder deaktiviert. Zusätzliche Informationen finden Sie im Abschnitt <link linkend="window-matching">Fensterübereinstimmung</link>:

source: Clicking <guilabel>OK</guilabel> the previous window back-fills the results in the <guilabel>Window Matching</guilabel> tab. Enter a meaningful text in the <guilabel>Description</guilabel> field (which is displayed in the <guilabel>KWin Rule</guilabel> window):
de: Klicken Sie im oben gezeigten Fenster auf <guilabel>OK</guilabel>, damit die Parameter auf der Karteikarte <guilabel>Fensterübereinstimmung</guilabel> ausgefüllt werden. Geben Sie einen aussagekräftigen Text im Feld <guilabel>Beschreibung</guilabel> ein, der im Fenster <guilabel>Fensterregeln</guilabel> angezeigt wird.

source: Enable the window attributes: <guilabel>Position</guilabel>, <guilabel>Size</guilabel> and <guilabel>Desktop</guilabel>. The initial values are set by <guilabel>Detect Window Properties</guilabel> and can be overridden:
de: Aktivieren Sie die Fensterattribute <guilabel>Position</guilabel>, <guilabel>Größe</guilabel> und <guilabel>Arbeitsfläche</guilabel>. Die anfänglichen Werte wurden bereits mit <guilabel>Fenstereigenschaften ermitteln</guilabel> und können überschrieben werden:

source: Clicking <guilabel>OK</guilabel> in the previous window returns to the main <guilabel>KWin Rules</guilabel>. The new rule with its description is listed:
de: Klicken Sie im oben gezeigten Fenster auf <guilabel>OK</guilabel>, damit kommen Sie wieder zum Dialog <guilabel>Fensterregeln</guilabel> zurück. Die neue Regel wird mit Ihrer Beschreibung aufgeführt:

source: Click <guilabel>OK</guilabel> to close the window.
de: Klicken Sie <guilabel>OK</guilabel>, um dieses Fenster zu schließen.

source: Done.
de: Fertig.

source: Application on all Desktops and Handle One Child Window Uniquely
de: Ein Programm auf allen Arbeitsflächen, aber ein Unterfenster wird anders behandelt

source: Except for conversation windows, display &kopete; and its children windows on all desktops and skip the systray and pager. For children conversation windows, treat them as the parent window except show them in systray.
de: &kopete; und alle Unterfenster mit Ausnahme von Chat-Fenstern sollen auf allen Arbeitsflächen, aber nicht im Systemabschnitt der Kontrollleiste und dem Arbeitsflächen-Umschalter angezeigt werden. Chat-Unterfenster werden wie das Hauptfenster behandelt, aber im Systemabschnitt der Kontrollleiste erscheinen.

source: For each attribute, use the <guilabel>Force</guilabel> <link linkend="parameters">parameter</link> so it can not be overridden.
de: Benutzen Sie für jedes Attribut den <link linkend="parameters">Parameter</link> <guilabel>Erzwingen</guilabel>, damit dieses Attribut nicht überschrieben werden kann.

source: In order to implement the above, two rules need to be created:
de: Für den oben genannten Zweck müssen zwei Regeln erstellt werden:

source: A rule for <guilabel>Kopete Chat</guilabel> and
de: Eine Regel für <guilabel>Kopetes Chatfenster</guilabel> und

source: A rule for &kopete;
de: Eine Regel für &kopete;

source: The <guilabel>Kopete Chat</guilabel> rule's matching-criteria is more restrictive than the <emphasis>Kopete</emphasis> rule as it needs to match a specific Window Role: the chat window. Due to <link linkend="rule-evaluation">rule evaluation</link> processing, the <guilabel>Kopete Chat</guilabel> rule must precede the &kopete; rule in the <link linkend="kopete-kwin-rule-list">KWin Rule list for Kopete</link>.
de: Das zutreffende Kriterium der Regel für das Kopete-Chatfenster ist einschränkender als die Regel für <emphasis>Kopete</emphasis>, da das Kriterium nur mit einer bestimmten Rolle des Fensters übereinstimmt, nämlich dem Chat-Fenster. Wegen der Art der <link linkend="rule-evaluation">Regel-Auswertung</link> muss die Regel für das Kopete-Chatfenster vor der Regel für &kopete; in der <link linkend="kopete-kwin-rule-list">KWin-Regelliste für &kopete;</link> aufgeführt werden.

source: Kopete Chat Rule
de: Regel für das Chat-Fenster von Kopete

source: Assuming a <guilabel>Kopete Chat</guilabel> window is open:
de: Angenommen ein <guilabel>Kopete-Chatfenster</guilabel> ist geöffnet:

source: Use <guilabel>Detect Window Properties</guilabel> and select the <guilabel>Kopete Chat</guilabel> window. Check the <guilabel>Window role</guilabel> box to restrict the criteria to chat windows - for additional information see <link linkend="window-matching">window matching</link>:
de: Benutzen Sie den Knopf <guilabel>Fenstereigenschaften ermitteln</guilabel> und wählen Sie das <guilabel>Kopete-Chatfenster</guilabel>. Wählen Sie das Ankreuzfeld <guilabel>Fensterrolle</guilabel>, damit das Kriterium nur auf das Chat-Fenster angewendet wird. Zusätzliche Informationen finden Sie im Abschnitt <link linkend="window-matching">Fensterübereinstimmung</link>:

source: Clicking <guilabel>OK</guilabel> in the previous window back-fills the results in the <guilabel>Window Matching</guilabel> tab. Enter a meaningful text in the <guilabel>Description</guilabel> box:
de: Klicken Sie im oben gezeigten Fenster auf <guilabel>OK</guilabel>, damit die Parameter auf der Karteikarte <guilabel>Fensterübereinstimmung</guilabel> ausgefüllt werden. Geben Sie einen aussagekräftigen Text im Feld <guilabel>Beschreibung</guilabel> ein.

source: Enable the following attributes:
de: Aktivieren Sie die folgenden Attribute:

source: Click through to complete entry of the rule.
de: Klicken Sie auf <guibutton>OK</guibutton>, um den Eintrag der Regel fertigzustellen.

source: The <guilabel>Skip taskbar</guilabel> attribute is set to <guilabel>No</guilabel> to display the window in the taskbar which loosely translates to: <emphasis>no</emphasis> <emphasis>do not</emphasis> <emphasis>skip taskbar</emphasis> <inlinemediaobject> <imageobject> <imagedata fileref="Face-smile.png" format="PNG"/> </imageobject> </inlinemediaobject>.
de: Das Attribut <guilabel>Nicht in Kontrollleiste</guilabel> ist auf <guilabel>Nein</guilabel> gesetzt, um das Fenster in der Kontrollleiste anzuzeigen. Dieses bedeutet jetzt: <emphasis>Nein</emphasis>, das Verhalten <emphasis>Nicht in Kontrollleiste</emphasis> <emphasis>nicht verwenden</emphasis> <inlinemediaobject> <imageobject> <imagedata fileref="Face-smile.png" format="PNG"/> </imageobject> </inlinemediaobject>.

source: Kopete Rule
de: Regel für Kopete

source: Assuming &kopete; is open:
de: Angenommen &kopete; ist geöffnet:

source: Use <guilabel>Detect Window Properties</guilabel> and select the &kopete; window. Match only by primary class name so leave the check boxes unchecked - for additional information see <link linkend="window-matching">window matching</link>:
de: Benutzen Sie den Knopf <guilabel>Fenstereigenschaften ermitteln</guilabel> und wählen Sie das &kopete;-Fenster aus. Es wird nur auf Übereinstimmung mit dem primären Klassennamen geprüft, daher lassen Sie die Ankreuzfelder deaktiviert. Zusätzliche Informationen finden Sie im Abschnitt <link linkend="window-matching">Fensterübereinstimmung</link>:

source: Kopete KWin Rule List
de: KWin-Regelliste für Kopete
