Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kde-workspace/kcontrol_screensaver.po
Languages: de

source: Screen Locker
de: Bildschirmsperre

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Frank</firstname><surname>Schütte</surname><affiliation><address><email>F.Schuette@t-online.de</email></address></affiliation><contrib>Deutsche Übersetzung</contrib></othercredit>

source: systemsettings
de: Systemeinstellungen

source: Using this module, you can choose your screen saver, determine how much time must pass before the screen saver is activated, and add or remove password protection to your screen saver.
de: In diesem Modul können Sie einen Bildschirmschoner auswählen, festlegen, nach welchem Zeitraum der Inaktivität er erscheint sowie Passwortschutz für den Bildschirmschoner de-/aktivieren.

source: Setting the time, priority and passwords for screen savers.
de: Zeit, Priorität und Passwort für Bildschirmschoner festlegen.

source: At the top is a check box to have the screen saver <guilabel>Start automatically after</guilabel>, and a spin box which determines the period of inactivity before the screen saver should be started. You can enter any positive number of minutes in this box.
de: Oben im Dialog gibt es das Ankreuzfeld <guilabel>Automatischer Start nach</guilabel> und ein Drehfeld, in dem Sie das Zeitintervall der Inaktivität vor dem Starten des Bildschirmschoners festlegen können. In diesem Feld können Sie das betreffende Intervall in Minuten einstellen.

source: Below that is a check box labeled <guilabel>Require password after</guilabel>. If it is checked, when you click a key or click a mouse button to end the screen saver after the time in the spinbox and return to your work, you must enter a password. The password used is the same password you used to login to your machine. If there is no mark in the check box, no password is required to return to your desktop.
de: Darunter befindet sich das Ankreuzfeld <guilabel>Passwortabfrage nach</guilabel>. Drücken Sie eine Taste oder klicken Sie mit der Maus, um den Bildschirmschoner nach der hier eingestellten Zeit zu beenden und zu Ihrer Arbeit zurückzukehren, müssen Sie ein Passwort eingeben, wenn dieses Ankreuzfeld aktiviert ist. Das verwendete Passwort ist das gleiche, das Sie eingeben müssen, wenn Sie sich an Ihrem Rechner anmelden. Ist das Feld nicht angekreuzt, dann müssen Sie auch kein Passwort eingeben, um auf die Arbeitsfläche zurückzukehren.

source: Locking the desktop manually causes the password protection to engage immediately.
de: Das manuelle Sperren der Arbeitsfläche bewirkt, dass der Passwortschutz sofort wirksam wird.

source: Choosing the screen saver, and configuring its options
de: Den Bildschirmschoner auswählen und die Optionen einstellen

source: Use the <guilabel>Simple locker</guilabel> option for a basic unlock dialog that prompts for a password.
de: Verwenden Sie die Einstellung <guilabel>Einfache Sperre</guilabel> für einen Dialog zur Freigabe der gesperrten Arbeitsfläche mit einer Passwortabfrage.

source: If you would like to have some interactive widgets like notes or a player on the locked screen saver, select <guilabel>Desktop Widgets</guilabel> and click the <guibutton>Configure...</guibutton> button to select your favorite widgets.
de: Möchten Sie gerne einige interaktive Miniprogramme wie Notizen oder einen Medienabspieler auch auf einem gesperrtem Bildschirmschoner laufen lassen, aktivieren Sie <guilabel>Miniprogramme</guilabel> und wählen Sie mit dem Knopf <guibutton>Einrichtung ...</guibutton> Ihre bevorzugten Miniprogramme aus.

source: To enable the selection of all available screen savers select the <guilabel>Screen saver</guilabel> option. You can select a screen saver by simply clicking on its name. Once you have selected a screen saver, you will see a small preview on the monitor on the right.
de: Um die Auswahl aller verfügbaren Bildschirmschoner zu ermöglichen, aktivieren Sie <guilabel>Bildschirmschoner</guilabel>. Sie können einen Bildschirmschoner auswählen, indem Sie auf seinen Namen klicken. Haben Sie einen Bildschirmschoner ausgewählt, können Sie in dem Monitor auf der rechten Seite eine kleine Vorschausehen.

source: The preview monitor will often show the screen saver larger than it is when the screen saver is activated. This is done on purpose, since many of the details of the screen savers would be unintelligible if actually scaled down to such a small size.
de: Die Vorschau zeigt den Bildschirmschoner absichtlich größer, als er später auf dem gesamten Monitor sein wird. Maßstabsgetreu wären viele Details der Bildschirmschoner sonst in der Vorschau nicht zu identifizieren.

source: Each screen saver has a different set of setup options. By clicking on <guilabel>Setup...</guilabel>, a dialog box will appear with all available options. As you adjust the options, the preview box in the dialog box will show you what effect you will achieve with the current settings.
de: Für jeden Bildschirmschoner gibt es einige spezifische Einstellmöglichkeiten. Klicken Sie auf den Knopf <guilabel>Einrichtung...</guilabel>, um ein Dialogfenster mit allen Einstellmöglichkeiten für den gewählten Bildschirmschoner zu öffnen. Die Änderungen an den Einstellungen werden im Vorschaumonitor angezeigt.

source: When you are done setting up your screen saver, click <guibutton>OK</guibutton>.
de: Haben Sie den Bildschirmschoner eingerichtet, dann klicken Sie auf <guibutton>OK</guibutton>.

source: Clicking <guibutton>Cancel</guibutton> will erase any changes you made in this dialog box, and return you to the screen saver module.
de: Klicken Sie auf <guibutton>Abbrechen</guibutton>, um die vorgenommenen Änderungen zu verwerfen und zum Bildschirmschoner-Bereich zurückzukehren.

source: For most screen savers a description, Copyright and Author information is shown directly in the dialog, for others you need to click the <guibutton>About</guibutton> button to read this information.
de: Für die meisten Bildschirmschoner wird eine Beschreibung sowie Informationen zum Copyright und Autor direkt im Dialog angezeigt. für die anderen Bildschirmschoner müssen Sie auf den Knopf <guibutton>Über</guibutton> klicken, um diese Informationen lesen zu können.

source: When you think you have all the options set the way you want, simply click on <guibutton>Test</guibutton> to immediately start the screen saver <emphasis>exactly</emphasis> as it will appear.
de: Um den Bildschirmschoner in Aktion zu erleben, können sie nach Abschluss Ihrer Einstellungen auf den Knopf <guibutton>Testen</guibutton> drücken. Der Bildschirmschoner erscheint auf dem Bildschirm <emphasis>genau</emphasis> wie im späteren Betrieb.

source: Using a non-&kde; screen saver
de: Verwendung eines Nicht-&kde;-Bildschirmschoners

source: &kde; does not prevent another screen saver from working. To use a different screen saver, such as <application>xscreensaver</application>, simply disable the &kde; Screen Saver, and set up your other screen saver program normally.
de: In &kde; können Sie auch anderen Bildschirmschoner verwenden. Um einen solchen Bildschirmschoner, wie &eg; <application>xscreensaver</application> zu verwenden, deaktivieren Sie einfach den &kde;-Bildschirmschoner und richten diesen anderen Bildschirmschoner ganz normal ein.
