Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kde-workspace/kcontrol_windowspecific.po
Languages: de

source: Window Rules
de: Fensterregeln

source: <firstname>Parts of this documentation was converted from the KDE UserBase <ulink url=" http://userbase.kde.org/KWin Rules">KWin Rules</ulink> page.</firstname> <surname></surname>
de: <firstname>Ein Teil dieses Handbuchs wurde aus der Webseite <ulink url=" http://userbase.kde.org/KWin Rules">KWin-Regeln</ulink> der &kde;-Userbase erstellt.</firstname> <surname></surname>

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Matthias</firstname><surname>Kiefer</surname><affiliation><address><email>Matthias.Kiefer@gmx.de</email></address></affiliation><contrib>Deutsche Übersetzung</contrib></othercredit>

source: Here you can customize window settings specifically only for some windows.
de: Hier können Sie Fenstereinstellungen vornehmen, die nur für bestimmte Fenster gelten.

source: KControl
de: Kontrollzentrum

source: window settings
de: Fenstereinstellungen

source: window placement
de: Fensterpositionierung

source: window size
de: Fenstergröße

source: Window Specific Settings: Quick Start
de: Fensterspezifische Einstellungen: Kurzanleitung

source: Please note that this configuration will not take effect if you do not use &kwin; as your window manager. If you do use a different window manager, please refer to its documentation for how to customize window behavior.
de: Die Einstellungen in diesem Modul wirken sich nur dann aus, wenn Sie den Fenstermanager &kwin; verwenden. Verwenden Sie einen anderen Fenstermanager, informieren Sie sich in dessen Dokumentation.

source: Many of the settings you can configure here are those you can configure on a global basis in the <guilabel>Window Behavior</guilabel> &systemsettings; module, however some of them are even more detailed.
de: Viele der Einstellungen hier entsprechenden denen, die Sie global im &systemsettings;-Modul <guilabel>Fensterverhalten</guilabel> einstellen können, sind aber teilweise noch detaillierter.

source: They encompass geometry, placement, whether a window should be kept above or below others, focus stealing prevention, and translucency settings.
de: Sie umfassen die Geometrie, die Platzierung, ob ein Fenster immer vorne oder hinten bleiben soll, das Fokusverhalten und Einstellungen zur Durchsichtigkeit.

source: You can access this module in two ways: from the titlebar of the application you wish to configure, or from the &systemsettings;. If you start it from within &systemsettings; you can use the <guibutton>New...</guibutton> to create a window profile, and the <guibutton>Detect Window Properties</guibutton> button on the resulting dialog to partially fill in the required information for the application you wish to configure.
de: Sie können dieses Modul auf zwei Wegen erreichen: über die Titelleiste der Anwendung, die Sie einrichten möchten, oder über die Systemeinstellungen. Verwenden Sie die Systemeinstellungen, können Sie mit dem Knopf <guibutton>Neu ...</guibutton> ein Fensterprofil anlegen. Mit dem Knopf <guibutton>Fenstereigenschaften ermitteln</guibutton> besteht die Möglichkeit, die für die einzurichtende Anwendung benötigten Informationen teilweise automatisch ausfüllen zu lassen.

source: You can also at any time <guibutton>Modify...</guibutton> or <guibutton>Delete</guibutton> any stored settings profile, and reorder the list. Reordering the list using the <guibutton>Move Up</guibutton> and <guibutton>Move Down</guibutton> buttons effects on how they are applied.
de: Sie können außerdem zu jeder Zeit die Einstellungen <guibutton>Bearbeiten ...</guibutton> oder <guibutton>Löschen</guibutton> und die Liste mit <guibutton>Nach oben</guibutton> und <guibutton>Nach unten</guibutton> neu sortieren. Die Reihenfolge in der Liste beeinflusst die Anwendung der Regeln.

source: Overview
de: Übersicht

source: &kwin; allows the end-user to define rules to alter an application's window attributes.
de: &kwin; ermöglicht dem Benutzer die Definition von Regeln, die die Attribute eines Programmfensters abwandeln.

source: For example, when an application is started, it can be forced to always run on <emphasis>Virtual Desktop 2</emphasis>. Or a defect in an application can be worked-around to force the window above others.
de: Es ist zum Beispiel möglich, ein Programm beim Starten immer auf der <emphasis>Virtuellen Arbeitsfläche 2</emphasis> erscheinen zu lassen. Auch Fehler in einem Programm können umgangen werden, damit das Fenster immer vor allen anderen angezeigt wird.

source: Step-by-step <link linkend="examples">examples</link> are provided along with detailed information on using the <link linkend="kwin-rule-editor">&kwin; Rule Editor</link> to specify <link linkend="window-matching">Window Matching</link> and <link linkend="window-attributes">Window Attributes</link>.
de: Sie finden hier ausführliche <link linkend="examples">Beispiele</link> mit genauen Informationen, wie mit dem <link linkend="kwin-rule-editor">&kwin;-Regel-Editor</link> <link linkend="window-matching">Fensterübereinstimmung</link> und <link linkend="window-attributes">Fensterattribute</link> festgelegt werden.

source: Examples and Application Workaround
de: Beispiele und Übergangslösungen für Anwendungen

source: To see what's possible, detailed <link linkend="examples">examples</link> are provided which can also be used to model your own rules.
de: Zur Erläuterung der Möglichkeiten werden ausführliche <link linkend="examples">Beispiele</link> gezeigt, die Sie zur Entwicklung Ihrer eigenen Regeln verwenden können.

source: A special page is to dedicated to address <link linkend="application-workarounds">Application Workaround</link>.
de: Ein besonderer Abschnitt erläutert <link linkend="application-workarounds">Übergangslösungen für Anwendungen</link>.

source: KWin Rule Editor
de: Editor für KWin-Regeln

source: Invoking the KWin Rule Editor
de: Aufruf des Editors für KWin-Regeln

source: There are several ways to invoke the &kwin; Rule Editor. Below are two:
de: Es gibt mehrere Möglichkeiten, den Editor für &kwin;-Regeln zu starten, hier werden zwei gezeigt:

source: Right-click on the title-bar of any window, choose <menuchoice><guimenu>More Actions</guimenu><guimenuitem>Window Manager Settings...</guimenuitem></menuchoice> and in the <guilabel>Configure</guilabel> window, select <guilabel>Window Rules</guilabel> or
de: Klicken Sie mit der &RMBn; in die Titelleiste eines Fensters und wählen Sie dann <menuchoice><guimenu>Weitere Aktionen</guimenu><guimenuitem>Einstellungen für die Fensterverwaltung ...</guimenuitem></menuchoice>. Im Dialog <guilabel>Einrichten</guilabel> wählen Sie die Seite <guilabel>Fensterregeln</guilabel> oder

source: <guimenu>System Settings</guimenu><guisubmenu>Window Behavior</guisubmenu><guimenuitem>Window Rules</guimenuitem>
de: <guimenu>Systemeinstellungen</guimenu><guisubmenu>Fensterverhalten</guisubmenu><guimenuitem>Fensterregeln</guimenuitem>

source: The main window is used to:
de: Im Hauptfenster können Sie:

source: Affect rules with <guilabel>New...</guilabel>, <guilabel>Modify...</guilabel> and <guilabel>Delete</guilabel>
de: Regeln mit <guilabel>Neu ...</guilabel>, <guilabel>Ändern ...</guilabel> und <guilabel>Entfernen</guilabel> bearbeiten

source: Share rules with others via <guilabel>Import</guilabel> and <guilabel>Export</guilabel>
de: Regel mit anderen gemeinsam nutzen über <guilabel>Importieren</guilabel> und <guilabel>Exportieren</guilabel>

source: Ensure desired <link linkend="rule-evaluation">rule evaluation</link> using <guilabel>Move Up</guilabel> and <guilabel>Move Down</guilabel>
de: Die gewünschte <link linkend="rule-evaluation">Auswertung der Regeln</link> mit <guilabel>Nach oben</guilabel> und <guilabel>Nach unten</guilabel> sicherstellen

source: Rule Evaluation
de: Auswertung der Regeln

source: When an application starts (or the rules are modified), &kwin; evaluates the rules from the top of the list to the bottom. For all rules which match a window, the collective set of attributes are applied to the window, then the window is displayed.
de: Wenn ein Programm gestartet wird oder die Regeln geändert wurden, wertet &kwin; die Regeln in der Liste von oben nach unten aus. Für alle auf ein Fenster passenden Regeln wird der gesamte Satz an Attributen auf das Fenster angewendet, ehe es angezeigt wird.

source: Should two or more matching rules enable the same attribute, the setting in the <emphasis>first</emphasis> rule in the list is used.
de: Sollten zwei oder mehr passende Regeln das gleiche Attribut aktivieren, wird die Einstellung der <emphasis>ersten</emphasis> Regel in der Liste benutzt.

source: You can tailor children windows for the application by placing the more restrictive rules first - see the <link linkend="application-on-all-desktops-and-handle-one-child-window-uniquely">Kopete and Kopete Chat Window</link> example.
de: Sie können Unterfenster eines Programms anpassen, indem eine mehr einschränkende Regel weiter oben in der Liste platziert wird, siehe das Beispiel zu <link linkend="application-on-all-desktops-and-handle-one-child-window-uniquely">Kopete und zum Kopete-Chat-Fenster</link>.

source: Rule Editor
de: Regel-Editor

source: The editor is composed of four tabs:
de: Der Editor besteht aus vier Karteikarten:

source: Window matching
de: Fensterübereinstimmung

source: <guilabel>Size &amp; Position</guilabel>
de: <guilabel>Größe &amp; Position</guilabel>

source: <guilabel>Arrangement &amp; Access</guilabel>
de: <guilabel>Anordnung &amp; Zugriff</guilabel>

source: <guilabel>Appearance &amp; Fixes</guilabel>
de: <guilabel>Erscheinungsbild &amp; Korrekturen</guilabel>

source: As the name implies, <guilabel>Window matching</guilabel> is used to specify criteria to match one or more windows. The other three tabs are used to alter the attributes of the matching windows.
de: Auf der Karteikarte <guilabel>Fensterübereinstimmung</guilabel> werden Kriterien festgelegt, die für ein oder mehrere Fenster zutreffen. Auf den anderen drei Karteikarten werden die Attribute für diese Fenster bestimmt.

source: Panels can also be affected.
de: Auch die Kontrollleiste ist betroffen.

source: Window Matching
de: Fensterübereinstimmung

source: Each window rule has user specified <link linkend="window-matching">Window Matching</link> criteria. &kwin; uses the criteria to determine whether the rule is applicable for an application.
de: Jede Fensterregel hat benutzerdefinierte Kriterien für eine <link linkend="window-matching">Fensterübereinstimmung</link>. Diese Kriterien werden von &kwin; benutzt, um festzustellen, ob eine Regel auf ein Fenster anzuwenden ist.

source: Window Attributes
de: Fenster-Attribute

source: Along with Window Matching criteria, each window rule has a set of <link linkend="window-attributes">Window Attributes</link>. The attributes override the corresponding application's settings and are applied before the window is displayed by &kwin;.
de: Neben den Kriterien für die Fensterübereinstimmung, hat jede Fensterregel einen Satz von <link linkend="window-attributes">Fenster-Attributen</link>. Diese Attribute überschreiben die zugehörigen Einstellungen des Programms und werden angewendet, ehe das Fenster angezeigt wird.

source: The <guilabel>Window Matching</guilabel> tab is used to specify the criteria &kwin; uses to evaluate whether the rule is applicable for a given window.
de: Auf der Karteikarte <guilabel>Fensterübereinstimmung</guilabel> bestimmen Sie die Kriterien, mit denen &kwin; beurteilt, ob eine Regel auf ein bestimmtes Fenster zutrifft

source: Zero (match any window) or more of the following may be specified:
de: Kein Kriterium (trifft auf jedes Fenster zu) oder eins oder mehrere der folgenden Kriterien können festgelegt werden:

source: <guilabel>Window class (application)</guilabel> - match the class.
de: <guilabel>Fensterklasse (Programm)</guilabel> - passt auf die Klasse des Fensters.

source: <guilabel>Match whole window class</guilabel> - include matching the secondary class.
de: <guilabel>Übereinstimmung mit gesamter Fensterklasse</guilabel> - Überprüft die abgeleitete Fensterklasse.

source: <guilabel>Window role</guilabel> - restrict the match to the function of the window (&eg; a <emphasis>main window</emphasis>, a <emphasis>chat window</emphasis>, &etc;)
de: <guilabel>Rolle des Fensters</guilabel> - begrenzt die Übereinstimmung auf die Funktion des Fensters, &eg; ein <emphasis>Hauptfenster</emphasis>, ein <emphasis>Chat-Fenster</emphasis> &etc;.

source: <guilabel>Window types</guilabel> - restrict the match to the type of window: <guilabel>Normal Window</guilabel>, <guilabel>Dialog Window</guilabel>, &etc;
de: <guilabel>Fenstertypen</guilabel> - Begrenzt die Übereinstimmung auf die Art des Fensters: <guilabel>Normales Fenster</guilabel>, <guilabel>Dialogfenster</guilabel> &etc;

source: <guilabel>Window title</guilabel> - restrict the match to the title of the window.
de: <guilabel>Fenstertitel</guilabel> - Beschränkt die Übereinstimmung auf den Fenstertitel.

source: <guilabel>Machine (hostname)</guilabel> - restrict the match to the host name associated with the window.
de: <guilabel>Maschine (Rechnername</guilabel> - Beschränkt die Übereinstimmung auf den Namen des diesem Fenster zugeordneten Rechners.

source: While it's possible to manually enter the above information, the preferred method is to use the <guilabel>Detect Window Properties</guilabel> button.
de: Obwohl es möglich ist, diese Kriterien manuell einzugeben, wird empfohlen, den Knopf <guilabel>Fenstereigenschaften ermitteln</guilabel> zu benutzen.

source: For each field, the following operators can be applied against the field value:
de: Auf jedes Feld können folgende Operatoren auf den Wert des Felds angewendet werden:

source: <guilabel>Unimportant</guilabel> - ignore the field.
de: <guilabel>Unwichtig</guilabel> - Das Feld wird ignoriert.

source: Exact Match
de: Exakte Übereinstimmung

source: Substring Match
de: Übereinstimmung bei enthaltener Zeichenfolge

source: Both <guilabel>Exact Match</guilabel> and <guilabel>Substring Match</guilabel> implement case insensitive matching. For example, <emphasis>AB</emphasis> matches the string <emphasis>AB</emphasis>, <emphasis>ab</emphasis>, <emphasis>Ab</emphasis> and <emphasis>aB</emphasis>.
de: Sowohl für <guilabel>Exakte Übereinstimmung</guilabel> wie auch <guilabel>Übereinstimmung bei enthaltener Zeichenfolge</guilabel> wird die Groß- oder Kleinschreibung nicht beachtet. Zum Beispiel <emphasis>AB</emphasis> passt auf die Zeichenketten <emphasis>AB</emphasis>, <emphasis>ab</emphasis>, <emphasis>Ab</emphasis> und <emphasis>aB</emphasis>.

source: <guilabel>Regular Expression</guilabel> - Qt's regular expressions are implemented - see <ulink url="http://qt-project.org/doc/qt-4.8/qregexp.html">pattern matching using regular expressions</ulink>.
de: <guilabel>Regulärer Ausdruck</guilabel> - Qts reguläre Ausdrücke sind implementiert, siehe <ulink url="http://qt-project.org/doc/qt-4.8/qregexp.html">Übereinstimmung mit regulären Ausdrücken</ulink>.

source: Detect Window Properties
de: Fenstereigenschaften ermitteln

source: The <guilabel>Detect Window Properties</guilabel> function simplifies the process of entering the matching-criteria.
de: Die Funktion <guilabel>Fenstereigenschaften ermitteln</guilabel> erleichtert die Eingabe von passenden Kriterien.

source: For the application you'd like to create a rule, start the application.
de: Starten Sie das Programm, für das Sie eine Regel erstellen möchten.

source: Next, in the <guilabel>Window matching</guilabel> tab, set the number of seconds of delay before the <guilabel>Detect Window Properties</guilabel> function starts. The default is zero seconds.
de: Stellen Sie dann auf der Karteikarte <guilabel>Fensterübereinstimmung</guilabel> die Anzahl der Sekunden ein, nach der die Funktion <guilabel>Fenstereigenschaften ermitteln</guilabel> starten soll. Als Standard sind null Sekunden vorgegeben.

source: Click on <guilabel>Detect Window Properties</guilabel> and
de: Klicken Sie auf <guilabel>Fenstereigenschaften ermitteln</guilabel>.

source: When the mouse-cursor turns to cross-hairs, place it inside the application window (not the title bar) and left-click.
de: Wenn als Mauszeiger ein Fadenkreuz angezeigt wird, bewegen Sie den Zeiger in das Fenster des Programms, nicht in die Titelleiste und klicken mit der &LMBn;.

source: A new window is presented with information about the selected window. Select the desired fields:
de: Ein neuer Dialog mit Informationen über das ausgewählte Fenster wird angezeigt. Wählen Sie die gewünschten Felder:

source: <guilabel>Secondary class name</guilabel> - some applications have a secondary class name. This value can be used to restrict windows by this value.
de: <guilabel>sekundärer Klassenname</guilabel> - Einige Programme haben einen sekundären Klassennamen. Mit diesem Wert kann die Übereinstimmung bei Fenstern eingeschränkt werden.

source: Window role
de: Rolle des Fensters

source: <guilabel>Window type</guilabel>
de: <guilabel>Fenstertyp</guilabel>

source: Window title
de: Fenstertitel

source: Click the <guilabel>OK</guilabel> button to back-fill the <guilabel>Window Matching</guilabel> criteria.
de: Klicken Sie auf den Knopf <guilabel>OK</guilabel>, um die Kriterien für die <guilabel>Fensterübereinstimmung</guilabel> auszufüllen.

source: By using a combination of the information, a rule can apply to an entire application (by <guilabel>Class</guilabel>) or a to a specific window <guilabel>Type</guilabel> within the <guilabel>Class</guilabel> - say a <guilabel>Toolbar</guilabel>.
de: Mit einer Kombination dieser Informationen kann eine Regel auf ein gesamtes Programm (mit <guilabel>Klasse</guilabel>) oder auf einen bestimmtes Fenster-<guilabel>Typ</guilabel> innerhalb der <guilabel>Klasse</guilabel>, zum Beispiel auf eine <guilabel>Werkzeugleiste</guilabel> beschränkt werden.

source: The attributes which can be set are grouped by function in three tabs:
de: Die Attribute, die eingestellt werden können, sind nach ihrer Funktion auf drei Karteikarten verteilt:

source: Each attribute has a set of parameters which determines its disposition.
de: Jedes Attribut hat einen Satz von Parametern, die die Verwendung festlegen.

source: Parameters
de: Parameter

source: Each attribute, minimally, accepts one of the following parameters. Additional, attribute-specific arguments are listed within each <link linkend="attributes">attribute</link> definition.
de: Jedes Attribut akzeptiert mindestens einen der folgenden Parameter. Zusätzlich gibt es Attribut-spezifischen Argumente in jeder <link linkend="attributes">Attribut</link>-Definition.

source: Do Not Affect
de: Ohne Auswirkung

source: Ensure a subsequent rule, which matches the window, does not affect the attribute.
de: Legt fest, dass eine darauf folgende Regel, die für das Fenster zutrifft, den Wert des Attributs nicht beeinflußt.

source: Apply Initially
de: Bei Initialisierung anwenden

source: Start the window with the attribute and allow it to be changed at run-time.
de: Startet das Fenster mit diesem Attribut, es kann zur Laufzeit geändert werden.

source: Remember
de: Merken

source: Use the attribute setting as defined in the rule and if changed at run-time, save and use the new value instead.
de: Benutzt die Einstellung des Attributs wie in der Regel angegeben, wird sie aber zur Laufzeit geändert, wird der neue Wert gespeichert und dann verwendet.

source: Force
de: Erzwingen

source: The setting cannot be changed at run-time.
de: Die Einstellung kann zur Laufzeit nicht geändert werden.

source: Apply Now, Force Temporarily
de: Jetzt anwenden, Temporär erzwingen

source: Apply/Force the setting once and unset the attribute.The difference between the two is at run-time, <guilabel>Apply Now</guilabel> allows the attribute to be changed and <guilabel>Force Temporarily</guilabel> prohibits it to be altered until all affected windows exit.
de: Wendet/erzwingt die Einstellung einmal an und setzt dann das Attribut zurück. Der Unterschied zwischen diesen beiden Parametern liegt im Verhalten zur Laufzeit. Mit dem Parameter <guilabel>Jetzt anwenden</guilabel> kann das Attribut geändert werden, <guilabel>Temporär erzwingen</guilabel> verhindert eine Änderung, bis alle betroffenen Fenster geschlossen sind.

source: For <guilabel>Apply Now</guilabel>, if the rule has no other attributes set, the rule is deleted after evaluation whereas <guilabel>Force Temporarily</guilabel>, the rule is deleted after the last affected window terminates.
de: Verwenden Sie <guilabel>Jetzt anwenden</guilabel> , dann wird die Regel nach der Auswertung gelöscht, wenn für die Regel keine weiteren Attribute gesetzt sind. Mit <guilabel>Temporär erzwingen</guilabel> dagegen wird die Regel gelöscht, wenn das letzte betroffenen Fenster geschlossen ist.

source: Attributes
de: Attribute

source: The <guilabel>Detect Window Properties</guilabel> button back-fills attribute-specific values - for more information see <link linkend="window-matching">Window Matching</link>. For example the height and width values of the <guilabel>Size</guilabel> attribute is set to the height and width of the detected window.
de: Mit dem Knopf <guilabel>Fenstereigenschaften ermitteln</guilabel> werden die attribut-spezifischen Werte ausgefüllt, weitere Informationen siehe <link linkend="window-matching">Fensterübereinstimmung</link>. Die Werte für Höhe und Breite des Attributs <guilabel>Größe</guilabel> wird auf die Werte des entdeckten Fensters gesetzt.

source: <guilabel>Yes/No</guilabel> arguments are used to toggle on or off attributes. Leniency with grammar helps one understand how a setting will be processed. <inlinemediaobject> <imageobject> <imagedata fileref="Face-smile.png" format="PNG"/> </imageobject> </inlinemediaobject> For example, the attribute <guilabel>Skip taskbar</guilabel>, when set to <guilabel>No</guilabel> means do not skip the taskbar. In other words, show the window in the taskbar.
de: Die Argumente <guilabel>Ja</guilabel>/<guilabel>Nein</guilabel> schalten Attribute ein oder aus. Grammatikkenntnisse erleichtern das Verständnis, wie ein Einstellung verarbeitet wird. <inlinemediaobject> <imageobject> <imagedata fileref="Face-smile.png" format="PNG"/> </imageobject> </inlinemediaobject> Wenn zum Beispiel das Attribut <guilabel>Nicht in Kontrollleiste</guilabel> den Wert <guilabel>Nein</guilabel> hat, wird das Fenster wegen der doppelten Verneinung in der Kontrollleiste angezeigt.

source: <title>Size &amp; Position</title>
de: <title>Größe &amp; Position</title>

source: Position the window's upper left corner at the specified x,y coordinate.
de: Setzt die Position der oberen linken Ecke des Fensters auf die angegebenen X- und Y-Koordinaten.

source: &kwin;'s origin, (0,0), is the upper left of the desktop.
de: Der Koordinatenursprung (0,0) von &kwin; ist die linke obere Ecke der Arbeitsfläche.

source: Size
de: Größe

source: The width and height of the window.
de: Die Breite und Höhe des Fensters.

source: Maximized horizontally, Maximized vertically, Fullscreen
de: Waagerecht maximiert, Senkrecht maximiert, Vollbild

source: These attributes are used to toggle the maximum horizontal/minimum horizontal/full-screen window attribute.
de: Mit diesen Werten wird das Fensterattribut für Waagerecht maximiert, Senkrecht maximiert oder Vollbild festgelegt.

source: <emphasis role="bold">Desktop</emphasis>
de: <emphasis role="bold">Arbeitsfläche</emphasis>
