Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kde-workspace/kcontrol_mouse.po
Languages: de

source: Mouse
de: Maus

source: ROLES_OF_TRANSLATORS
de: <!-- Wissen wir nicht! -->

source: This is the documentation for the &kde; &systemsettings; module that configures mice and other pointing devices.
de: Dies ist die Dokumentation für das &kde; &systemsettings;-Modul, mit dem die Maus und andere Zeigegeräte eingerichtet werden.

source: Systemsettings
de: Systemeinstellungen

source: This module allows you to configure your pointing device. Your pointing device may be a mouse, a track ball, a touch-pad, or another piece of hardware that performs a similar function.
de: Dieses Modul erlaubt Ihnen die Einrichtung Ihres Zeigegerätes. Das kann eine Maus, ein Trackball, ein Touchpad oder alles andere sein, das die gleiche Funktion erfüllt.

source: This module is divided into several tabs: <link linkend="mouse-general">General</link>, <link linkend="mouse-advanced">Advanced</link> and <link linkend="mouse-navigation">Mouse Navigation</link>. There may also be one or more additional tabs if you have a Logitech mouse or trackball, providing access to special features.
de: Das Modul ist in verschiedene Karteikarten unterteilt: <link linkend="mouse-general">Allgemein</link>, <link linkend="mouse-advanced">Erweitert</link> und <link linkend="mouse-navigation">Mausnavigation</link>. Wenn Sie eine Logitech-Maus oder -Trackball haben, sind möglicherweise ein oder zwei zusätzliche Karteikarten vorhanden, die spezielle Funktionen anbieten.

source: General
de: Allgemein

source: Button Order
de: Knopfreihenfolge

source: If you are left-handed, you may prefer to swap the functions of the <mousebutton>left</mousebutton> and <mousebutton>right</mousebutton> buttons on your pointing device by choosing the <quote>Left handed</quote> option. If your pointing device has more than two buttons, only those that function as the <mousebutton>left</mousebutton> and <mousebutton>right</mousebutton> buttons are affected. For example, if you have a three-button mouse, the <mousebutton>middle</mousebutton> button is unaffected.
de: Falls Sie Linkshänder sind, wollen Sie vielleicht die Funktionen der <mousebutton>linken</mousebutton> und <mousebutton>rechten</mousebutton> Taste Ihres Zeigegerätes tauschen, indem Sie die Option <quote>Linkshändige Bedienung</quote> wählen. Wenn Ihr Zeigegerät mehr als zwei Tasten hat,, werden nur die <mousebutton>linke</mousebutton> und die <mousebutton>rechte</mousebutton> Taste angepasst. Haben Sie zum Beispiel eine Maus mit drei Tasten, so wird die <mousebutton>mittlere</mousebutton> Maustaste nicht verändert.

source: Reverse scroll direction
de: Laufrichtung des Mausrades umkehren

source: With this check box selected, the scroll wheel (if any) will work in the opposite direction (so that if rolling the top of the scroll wheel towards you previously causes a scroll down, then it will now cause a scroll up). This may be useful to handle a unusual setup of the X server.
de: Ist dieses Ankreuzfeld markiert, arbeitet das Mausrad (falls vorhanden) in entgegengesetzter Richtung. Wenn das Bewegen des Mausrades in ihre Richtung zuvor eine Bewegung nach unten auf dem Bildschirm ausgelöst hat, wird es nun eine Bewegung nach oben sein. Dies kann bei einem ungewöhnlich eingerichteten X-Server von Vorteil sein.

source: Double-click to open files and folders (select icons on first click)
de: Doppelklick zum Öffnen von Dateien/Ordnern (bei Einfachklick nur auswählen)

source: If this option is not checked, icons/files will be opened with a single click of the <mousebutton>left</mousebutton> mouse-button. This default behavior is consistent with what you would expect when you click links in most web browsers. If checked however, icons/files will be opened with a double click, while a single click will only select the icon or file. This is the behavior you may know from other desktops or operating systems.
de: Wenn diese Option nicht markiert ist, werden Symbole/Dateien durch einen einfachen Klick der <mousebutton>linken Maustaste</mousebutton> geöffnet. Dieses Verhalten stimmt mit dem Verhalten der meisten Internet-Browser überein. Wenn diese Option markiert ist, werden Symbole/Dateien durch einen Doppelklick geöffnet. Ein einfacher Klick wählt das Symbol nur. Dieses Verhalten kennen Sie vielleicht von anderen Benutzeroberflächen und Betriebssystemen.

source: This option can be changed in the configuration dialogs of &dolphin; and &konqueror; on the <guilabel>Navigation</guilabel> tab as well.
de: Diese Einstellung kan auch in den Einrichtungsdialogen von &dolphin; und &konqueror; auf der Karteikarte <guilabel>Navigation</guilabel> geändert werden.

source: Single-click to open files and folders
de: Einfacher Klick zum Öffnen von Dateien und Verzeichnissen

source: This is the default setting for &kde;. Clicking once on an icon will open it. To select you can drag around the icon(s) or <keycombo action="simul">&Ctrl;<mousebutton>Right</mousebutton></keycombo> click, or simply click and hold to drag it. You can also enable automatic selection of icons using the <guilabel>Automatically select icons</guilabel> check box, discussed below.
de: Dies ist die Standardeinstellung von &kde;. Ein einfacher Klick auf ein Symbol öffnet es. Zur Auswahl können Sie einen Rahmen um die Symbole ziehen oder <keycombo action="simul">&Ctrl;<mousebutton>Rechte Maustaste</mousebutton></keycombo> verwenden oder aber einfach klicken und die Taste zum Verschieben gedrückt halten. Sie können darüber hinaus auch die automatische Selektierung von Symbolen aktivieren, wenn Sie das Ankreuzfeld <guilabel>Symbole automatisch auswählen</guilabel> markieren.

source: Change pointer shape over icons
de: Zeigerform über Symbolen verändern

source: When this option is checked, the shape of the mouse pointer changes whenever it is over an icon.
de: Ist diese Option ausgewählt, ändert sich die Zeigerform, sobald sich der Zeiger über einem Symbol befindet.

source: This option should be checked in most situations. It gives more visual feedback and says, in essence, if you click here, something will happen.
de: Normalerweise sollte diese Option aktiviert sein. Dadurch erhalten Sie mehr visuelle Informationen und Sie können leichter erkennen, ob im Falle eines Klicks etwas passiert.

source: Automatically select icons
de: Symbole automatisch auswählen

source: As noted above, if you have <guilabel>Single-click to open files and folders</guilabel> selected, you can select icons by dragging around them, or by using <keycombo action="simul">&Ctrl;<mousebutton>Right</mousebutton></keycombo> click. If you routinely need to select icons, you may want to enable this check box, which will allow icons to be selected automatically by pausing over the icon. The <guilabel>Delay:</guilabel> slider determines how long is required before the automatic selection takes effect.
de: Wie bereits erwähnt, können Sie, wenn <guilabel>Einfacher Klick zum Öffnen von Dateien und Ordnern</guilabel> eingestellt ist, Symbole durch Umfahren mit dem Mauszeiger oder durch Anklicken mit <keycombo action="simul">&Ctrl;<mousebutton>rechte Maustaste</mousebutton></keycombo> auswählen. Wenn Sie häufig Symbole auswählen, können Sie dieses Ankreuzfeld aktivieren, sodass Symbole automatisch ausgewählt werden, wenn Sie mit dem Mauszeiger lange genug darauf verharren. Der Schieberegler <guilabel>Verzögerung</guilabel> legt fest, wie lange es dauert, bis das Symbol ausgewählt wird.

source: Advanced
de: Erweitert

source: Pointer acceleration
de: Zeigerbeschleunigung

source: This option allows you to change the relationship between the distance that the mouse pointer moves on the screen and the relative movement of the physical device itself (which may be a mouse, track-ball, or some other pointing device.)
de: Diese Option ermöglicht Ihnen die Einstellung der Beziehung zwischen der auf dem Monitor dargestellten Bewegung des Zeigers und der tatsächlichen Bewegung Ihres Zeigegerätes. Dabei ist es gleichgültig, um was für ein Gerät es sich dabei handelt (also Maus, Joystick, Trackball &etc;).

source: A high value for the acceleration multiplier will lead to large movements of the mouse pointer on the screen, even when you only make a small movement with the physical device.
de: Ein hoher Wert für den Multiplikator wird zu sehr schnellen Bewegungen des Zeigers führen, auch wenn Sie mit dem Zeigegerät nur eine kleine Bewegung machen.

source: A multiplier between <guilabel>1x</guilabel> and <guilabel>3x</guilabel> will works well for many systems. With a multiplier over <guilabel>3x</guilabel> the mouse pointer may become difficult to control.
de: Ein Multiplikator zwischen <guilabel>1x</guilabel> und <guilabel>3x</guilabel> wird in den meisten Fällen die richtige Wahl sein. Bei einem Multiplikator über <guilabel>3x</guilabel> wird der Zeiger wahrscheinlich schwer kontrollierbar.

source: Pointer threshold
de: Schwellenwert für Zeiger

source: The threshold is the smallest distance that the mouse pointer must move on the screen before acceleration has any effect. If the movement is within the threshold, the mouse pointer moves as if the acceleration were set to <guilabel>1x</guilabel>.
de: Der hier eingestellte Wert bestimmt die Entfernung in Pixeln, die der Zeiger zurücklegen muss, bevor er beschleunigt wird. Innerhalb dieser Entfernung bewegt sich der Zeiger, als ob eine Beschleunigung von <guilabel>1x</guilabel> eingestellt wäre.

source: Thus, when you make small movements with the physical device (&eg; mouse), you still have fine control of the mouse pointer on the screen, whereas larger movements of the physical device will move the mouse pointer rapidly to different areas on the screen.
de: Dies ermöglicht Ihnen bei kleinen Abständen auf dem Monitor eine genaue Kontrolle des Zeigers. Andersherum können Sie trotzdem große Abstände mit einer hohen Geschwindigkeit überwinden und so schnell in einen anderen Bereich auf Ihrem Monitor gelangen.

source: You can set the threshold by entering a value into the edit box or by clicking the up/down arrows to the right of the box.
de: Diesen Schwellenwert verändern Sie, indem Sie einen Wert eingeben oder einen der beiden Pfeile auf der rechten Seite des Eingabefeldes benutzen.

source: In general, the higher you set the <guilabel>Pointer acceleration</guilabel> value, the higher you will want to set the <guilabel>Pointer threshold</guilabel> value. For example, a <guilabel>Pointer threshold</guilabel> of 4 pixels may be appropriate for a <guilabel>Pointer Acceleration</guilabel> of 2x, but 10 pixels might be better for 3x.
de: Allgemein kann man sagen, dass bei einer hohen <guilabel>Zeigerbeschleunigung</guilabel> auch ein hoher <guilabel>Schwellenwert</guilabel> eingestellt werden sollte. So wäre ein <guilabel>Schwellenwert</guilabel> von 4 Pixeln angemessen für eine <guilabel>Zeigerbeschleunigung</guilabel> von 2x, wohingegen 10 Pixel besser wären bei einer eingestellten <guilabel>Zeigerbeschleunigung</guilabel> von 3x.

source: Double click interval
de: Doppelklick-Abstand

source: This is the maximum amount of time between clicks for &kde; to register a double click. If you click twice, and the time between those two clicks is less than this number, &kde; recognizes that as a double click. If the time between these two clicks is greater than this number, &kde; recognizes those as two <emphasis>separate</emphasis> single clicks.
de: Die hier eingestellte Zeit ist die Zeit, die maximal zwischen zwei Klicks verstreichen darf, damit &kde; sie noch als Doppelklick interpretiert. Klicken Sie also innerhalb der eingestellten Zeit zweimal, wird &kde; einen Doppelklick ausführen. War die zwischen den beiden Klicks verstrichene Zeit hingegen größer, so wird &kde; sie als zwei <emphasis>einzelne</emphasis> Klicks behandeln.

source: <guilabel>Drag start time</guilabel> and <guilabel>Drag start distance</guilabel>
de: <guilabel>Startzeit für Ziehen (Drag)</guilabel> und <guilabel>Startbereich für Ziehen (Drag)</guilabel>

source: If you <itemizedlist> <listitem><para>click with the mouse</para></listitem> <listitem><para>drag within the time specified in <guilabel>Drag start time</guilabel>, and </para></listitem> <listitem><para>move a distance equal to or greater than the number (of pixels) specified in <guilabel>Drag start distance</guilabel></para> </listitem> </itemizedlist> &kde; will drag the selected item.
de: Wenn sie mit der Maus <itemizedlist><listitem><para>auf etwas klicken</para></listitem> <listitem><para>innerhalb der in <guilabel>Startzeit für Ziehen</guilabel> eingestellten Zeit </para></listitem> <listitem><para>den Zeiger über eine mindestens so große wie in <guilabel>Startbereich für Ziehen</guilabel> eingestellte Entfernung in Pixeln bewegen, </para></listitem></itemizedlist> verschiebt &kde; das Objekt.

source: Mouse wheel scrolls by
de: Mausrad erzeugt Bildlauf um

source: If you have a wheel mouse, use the spin box to determine how many lines of text one <quote>step</quote> of the mouse wheel will scroll.
de: Wenn Sie eine Radmaus haben, verwenden Sie dieses Drehfeld, um festzulegen, wie viele Textzeilen ein <quote>Schritt</quote> des Mausrades das Bild weiterlaufen lässt.

source: Mouse Navigation
de: Mausnavigation

source: This tab allows you to configure the keyboard number pad keys as a mouse-type device. This may be useful when you are working on a device without another pointing device, or where you have no other use for the number pad.
de: Auf dieser Karteikarte können Sie den Zahlenblock auf der Tastatur wie ein mausähnliches Gerät einrichten. Das kann nützlich sein, wenn es keine Anschlußmöglichkeit für ein Zeigegerät gibt oder der Zahlenblock ansonsten nicht genutzt wird.

source: Move pointer with keyboard (using the num pad)
de: Maus per Tastatur bewegen (Zahlenblock)

source: To enable keyboard mouse mode, you need to select the check box labeled <guilabel>Move pointer with keyboard (using the num pad)</guilabel>. When you do this, the other settings will become enabled, and you can customize the keyboard pointer behavior further, if required.
de: Um den Zahlenblock im Mausmodus zu verwenden, müssen Sie das Ankreuzfeld <guilabel>Maus per Tastatur bewegen (Zahlenblock)</guilabel> aktivieren. Daraufhin werden die anderen Einstellungen freigeschaltet, und Sie können das Verhalten der Tastatur im Mausmodus, wenn nötig, an Ihre Bedürfnisse anpassen.

source: The various keys on the number pad move in the direction you would expect. Note that you can move diagonally as well as up, down, left and right. The <keycap>5</keycap> key emulates a click to a pointer button, typically &LMB;. You change which button is emulated by using the <keycap>/</keycap> key (which makes it &LMB;), <keycap>*</keycap> key (which makes it &MMB;) and <keycap>-</keycap> (which makes it &RMB;). Using the <keycap>+</keycap> emulates a double click to the selected pointer button. You can use the <keycap>0</keycap> key to emulate holding down the selected pointer button (for easy dragging), and then use the <keycap>.</keycap> to emulate releasing the selected pointer button.
de: Die Tasten auf dem Zahlenblock führen eine Bewegung in die Richtung aus, die Sie auch erwarten würden. Beachten Sie, dass Aufwärts, Abwärts, Links und Rechts auch eine Bewegung in diagonaler Richtung möglich ist. Die Taste <keycap>5</keycap> simuliert das Betätigen einer Maustaste, normalerweise ist das die linke Maustaste. Sie können die simulierte Maustaste mit <keycap>/</keycap> (linke Maustaste), <keycap>*</keycap> (mittlere Maustaste) und <keycap>-</keycap> (rechte Maustaste) umschalten. Das Betätigen von <keycap>+</keycap> simuliert einen Doppelklick mit der gewählten Maustaste. Über die Taste <keycap>0</keycap> können Sie eine gedrückte Maustaste (&eg; für Ziehen und Fallenlassen) simulieren und die Taste <keycap>,</keycap> für das Loslassen der Maustaste.

source: Acceleration delay
de: Zeigerverzögerung

source: This is the time (in milliseconds) between the initial key press and the first repeated motion event for mouse key acceleration.
de: Das ist der Zeitraum (in Millisekunden) zwischen der ersten Tastenbetätigung und dem ersten Signal, das eine wiederholte Mausbewegung anzeigt, um die Zeigerbewegung zu beschleunigen.

source: Repeat interval
de: Wiederholungsabstand

source: This is the time in milliseconds between repeated motion events for mouse key acceleration.
de: Dies ist der Abstand in Millisekunden, der bei der Beschleunigung der Tastaturmaus zwischen den Signalen für eine wiederholte Bewegung vergeht.

source: Acceleration time
de: Zeigerbeschleunigung

source: This is the time in milliseconds before the pointer reaches a maximum speed for mouse key acceleration.
de: Dies ist die Zeit in Millisekunden, bis die Beschleunigung des Mauszeigers ihren maximalen Wert erreicht.

source: Maximum speed
de: Maximale Geschwindigkeit

source: This is the maximum speed in pixels per second the pointer can reach for mouse key acceleration.
de: Dies ist die maximale Geschwindigkeit in Pixeln pro Sekunde, die bei der Beschleunigung der Tastaturmaus erreicht werden kann.

source: Acceleration profile
de: Beschleunigungsprofil

source: This is the slope of the acceleration curve for mouse key acceleration.
de: Dies ist die Steigung der Beschleunigungskurve für die Tastaturmausbeschleunigung.

source: Logitech Support
de: Logitech-Unterstützung

source: Some Logitech USB mice support special features, such as switching to a higher resolution, or providing cordless status. If &kde; was built with libusb support, then you will get an additional tab for each supported mouse that is plugged in.
de: Einige USB-Mäuse von Logitech unterstützen besondere Eigenschaften wie das Umschalten auf eine andere Auflösung oder das Zurückliefern des Status bei kabellosem Betrieb. Wenn &kde; mit Unterstützung für die Bibliothek libusb kompiliert wurde, erscheint eine zusätzliche Karteikarte für jede unterstützte Maus, die in das System eingebunden ist.

source: The supported devices are:
de: Die unterstützten Geräte sind:

source: Receiver for Cordless Presenter
de: Receiver für Cordless Presenter

source: Not all devices support all capabilities (typically cordless devices do not provide resolution switching, and of course only cordless devices support cordless status reporting), so some parts of the tab will not be enabled for some mouse types.
de: Nicht alle Geräte unterstützen sämtliche Eigenschaften (so unterstützen kabellose Geräte häufig kein Umschalten der Auflösung, und natürlich liefern nur kabellose Geräte den Zustand bei kabellosem Betrieb zurück), weshalb bei einigen Maustypen nur Teilbereiche der Karteikarte zugänglich sind.

source: If the mouse supports resolution switching, the <guilabel>Sensor Resolution</guilabel> radio button group will be enabled, and you can switch from <guilabel>400 counts per inch</guilabel> to <guilabel>800 counts per inch</guilabel> and back. If you use <guilabel>800 counts per inch</guilabel>, the same physical movement of the mouse will cause a greater (roughly double) amount of motion of the cursor. This tends to be popular amongst gamers.
de: Unterstützt die Maus das Umschalten der Auflösung, werden die Auswahlknöpfe der Gruppe <guilabel>Sensor-Auflösung</guilabel> aktiv, und Sie können zwischen <guilabel>400 cpi</guilabel> und <guilabel>800 cpi</guilabel> umschalten. Die Einstellung <guilabel>800 cpi</guilabel> bewirkt, dass dieselbe physikalische Bewegung der Maus etwa die doppelte Bewegung des Mauszeigers zur Folge hat. Dies ist vor allem bei Computerspielen gefragt.

source: If the mouse supports cordless reporting, the <guilabel>Battery Level</guilabel> and <guilabel>RF Channel</guilabel> widgets will be enabled. You can only change the <guilabel>RF Channel</guilabel> if your mouse has two channel support.
de: Unterstützt die Maus das Zurückmelden des kabellosen Zustands, sind die Elemente <guilabel>Batteriefüllstand</guilabel> und <guilabel>RF-Kanal</guilabel> zugänglich. Die Einstellung <guilabel>RF-Kanal</guilabel> können Sie nur ändern, wenn die Maus über Zweikanalunterstützung verfügt.
