Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kde-workspace/kcontrol_splashscreen.po
Languages: de

source: Splash Screen
de: Startbildschirm

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Burkhard</firstname><surname>Lück</surname><affiliation><address><email>lueck@hube-lueck.de</email></address></affiliation><contrib>Übersetzung</contrib></othercredit>

source: System Settings
de: Systemeinstellungen

source: splash screen
de: Startbildschirm

source: theme
de: Design

source: This module provides an interface to install and view splash screen themes.
de: In diesem Modul finden Sie eine Schnittstelle zur Installation und Vorschau von Programmstart-Grafiken und -Designs.

source: Here's a screenshot of the splash screen manager
de: Bildschirmfoto der Verwaltung für Startbildschirmdesigns

source: The splash screen manager module
de: Das Modul Verwaltung für Startbildschirmdesigns

source: On the left you can see the list of already installed splash screens. The current splash screen name is highlighted.
de: Links sehen Sie eine Liste der bereits installierten Startbildschirme, der gerade verwendete ist hervorgehoben.

source: On the right is displayed a preview of the current splash screen with some information about it below the preview.
de: Rechts wird eine Vorschau des gewählten Startbildschirms angezeigt, darunter einige Informationen dazu.

source: Get New Themes...
de: Neue Designs herunterladen ...

source: You need to be connected to the Internet to use this action. A dialog will display a list of themes from the <ulink url="http://www.kde-look.org">http://www.kde-look.org</ulink> website. Clicking the <guibutton>Install</guibutton> button associated with a theme will install this theme locally.
de: Damit dies funktioniert, muss eine Verbindung zum Internet bestehen. Es erscheint ein Fenster, in dem verfügbare Designs von <ulink url="http://www.kde-look.org">http://www.kde-look.org</ulink> angezeigt werden. Klicken Sie auf <guibutton>Installieren</guibutton>, um das jeweilige Design herunterzuladen und auf Ihrem Rechner zu installieren.

source: <screeninfo>Installing a new theme</screeninfo>
de: <screeninfo>Installation eines neuen Designs</screeninfo>

source: <phrase>Installing a new theme</phrase>
de: <phrase>Installation eines neuen Designs</phrase>

source: This new theme is immediately available after you close the System Settings Add-On Installer dialog and is highlighted. The preview displays the picture. You need to click the <guibutton>Apply</guibutton> biutton to make this theme your current splash-screen theme.
de: Das neue Design ist sofort verfügbar und wird hervorgehoben, wenn Sie den Installationsdialog geschlossen haben. Das Vorschaubild des neuen Designs wird angezeigt. Um das neue Design als Startbildschirm zu verwenden, müssen Sie den Knopf <guibutton>Anwenden</guibutton> drücken.

source: Install Theme File...
de: Design-Datei installieren ...

source: Instead of installing a theme directly as above you might have a tarball of a theme locally that you want to install. Clicking on this button will open a file dialog and you choose the tarball of the theme you want to install. The installer then unpacks the theme locally and makes it immediately available in the themes list.
de: Anstatt ein Design - wie oben beschrieben - direkt zu installieren, ist es auch möglich, bereits auf der Festplatte vorhandene Designs zu installieren. Drücken Sie dazu auf diesen Knopf, damit öffnen Sie einen Dateidialog zur Auswahl des Design-Archivs, das installiert werden soll. Das Installationsprogramm entpackt das Archiv, das Design wird dann in der Liste angezeigt.

source: Remove Theme
de: Design entfernen

source: Removing a theme means removing the theme files from your disk. A message box warns you before doing anything and indicates to you what it will remove. Clicking on <guibutton>Delete</guibutton> in this message box will remove the splash screen theme from your disk. Clicking <guibutton>Cancel</guibutton> will abort the remove action. If you choose <guibutton>Delete</guibutton>, the theme is then no longer available in the list.
de: Mit dieser Aktion entfernen Sie die Dateien des Designs von der Festplatte. Bevor das Löschen der Daten tatsächlich ausgeführt wird, müssen Sie diese Aktion bestätigen. Klicken Sie auf <guibutton>Löschen</guibutton>, dann werden die Dateien des gewählten Designs von der Festplatte und das Design aus der Liste entfernt. Klicken Sie auf <guibutton>Abbrechen</guibutton>, dann wird die Aktion nicht ausgeführt und der Dialog geschlossen.

source: Test Theme
de: Design testen

source: This shows you the theme and the associated icons as they will be displayed as splash screen when &kde; starts. Clicking on the splash screen hides it.
de: Zeigt Ihnen den Startbildschirm des Designs mit allen zugehörigen Symbolen wie es auch beim Start von &kde; zu sehen sein wird. Klicken Sie auf den Startbildschirm, um ihn wieder auszublenden.
