Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kde-workspace/kcontrol_autostart.po
Languages: de

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Thomas</firstname><surname>Reitelbach</surname><affiliation><address><email>tr@erdfunkstelle.de</email></address></affiliation><contrib>Deutsche Übersetzung</contrib></othercredit>

source: System Settings
de: Systemeinstellungen

source: desktop file
de: Desktop-Datei

source: script file
de: Skriptdatei

source: Autostart Manager
de: Autostart-Verwaltung

source: This module is a configuration tool for managing what programs start up with your personal &kde;. It allows you to add programs or scripts so they automatically start during the startup of your &kde; session and to manage them.
de: Dieses Einrichtungsmodul ermöglicht Ihnen die Verwaltung von Programmen, die mit Ihrer &kde;-Sitzung gestartet werden. Sie können Programme oder Skripte hinzufügen und ändern, die zusammen mit Ihrer KDE-Sitzung starten sollen.

source: Please note that in this module all changes are immediately applied.
de: Beachten Sie, dass alle Änderungen in diesem Dialog sofort angewendet werden.

source: The program scans <filename>~/.config/autostart/</filename>, your <filename class="directory">KDE Autostart</filename> folder (<filename class="directory">$KDEHOME/Autostart</filename> as default), <filename class="directory">$KDEHOME/env</filename> and <filename class="directory">$KDEHOME/shutdown</filename> folders to check what programs and scripts are already there and displays them. It allows you to manage them easily.
de: Das Einrichtungsmodul untersucht die Ordner <filename>~/.config/autostart/</filename>, Ihren <filename class="directory">KDE-Autostart-Ordner</filename> (üblicherweise <filename class="directory">$KDEHOME/Autostart</filename>), <filename class="directory">$KDEHOME/env</filename> und <filename class="directory">$KDEHOME/shutdown</filename> nach bereits vorhandenen Programmen und Skripten und zeigt diese an. Die Verwaltung dieser Autostart-Programme ist leicht gemacht.

source: Note that you can change the location of your <filename class="directory">Autostart</filename> folder in <menuchoice><guimenu>Account Details</guimenu> <guimenuitem>Paths</guimenuitem></menuchoice> in the <guilabel>Common Appearance and Behaviour</guilabel> category of the &systemsettings; and set a different folder than <filename class="directory">$KDEHOME/Autostart</filename>.
de: Der Ort des <filename class="directory">Autostart</filename>-Ordners kann in <menuchoice><guimenu>Benutzerkontodetails</guimenu> <guimenuitem>Pfade</guimenuitem></menuchoice> in den &systemsettings; im Abschnitt <guilabel>Allgemeines Erscheinungsbild und Verhalten</guilabel> geändert werden. Ändern Sie hier den vorgegebenen Ordner <filename class="directory">$KDEHOME/Autostart</filename>.

source: Files display
de: Dateianzeige

source: The main part of the module displays the programs that are loaded when &kde; starts and scripts that are run when &kde; starts, shutdowns or before &kde; starts.
de: Der Hauptteil des Einrichtungsmoduls zeigt die eingerichteten Autostart-Dateien an. Programme können bei der KDE-Anmeldung gestartet werden. Skripte können sowohl bei der KDE-Anmeldung, als auch vor der KDE-Anmeldung und beim Beenden von KDE ausgeführt werden.

source: You cannot amend this column. It states the name of the program or script you want to start with &kde;. The name is extracted from the Desktop file from the Name key for a program and is the filename for a script.
de: Diese Spalte ist nicht veränderbar. Hier wird der Name des Programmes oder Skriptes angezeigt, das gestartet werden soll. Der Name wird aus der Einrichtungsdatei ermittelt bzw. bei Skripten aus dem Dateinamen.

source: Command
de: Befehl

source: This column lists the commands that are run to start the program. Commands can be modified through the <guibutton>Properties</guibutton> button or by double clicking the program/script row. The command is extracted from the Desktop file from the Exec key.
de: In dieser Spalte werden die Autostart-Programme angezeigt. Der auszuführende Befehl kann geändert werden, indem Sie den Knopf <guibutton>Eigenschaften</guibutton> drücken oder auf das Program doppelklicken. Der auszuführende Befehl wird bei Einrichtungsdateien aus dem Schlüsselwort „Exec“ ausgelesen.

source: For a script the command is the path to the script.
de: Für ein Skript enthält dieser Befehl den vollständigen Pfad zum Skript.

source: This setting is only available for programs through Desktop files. You can keep a program in the <filename class="directory">Autostart</filename> folder but disable it from being run at &kde; start. Setting the program to <guilabel>Disabled</guilabel> will not run it on start.
de: Diese Einstellung ist nur für Programme verfügbar, die über eine Einrichtungsdatei aufgerufen werden. Sie können ein Programm in die Liste der Autostart-Programme aufnehmen, den automatischen Start aber dennoch unterbinden, indem Sie das Programm hier auf <guilabel>Deaktiviert</guilabel> stellen.

source: Setting a program to <guilabel>Disabled</guilabel> sets the Desktop file Hidden property to true in the <filename class="directory">Autostart</filename> folder.
de: Wenn Sie ein Autostart-Programm deaktivieren, so wird die Eigenschaft „Hidden“ in der Einrichtungsdatei im Autostart-Ordner auf wahr gesetzt.

source: Run On
de: Ausführungszeitpunkt

source: Programs (Desktop files) can only be run on startup. Scripts can be run on <guilabel>Startup</guilabel>, <guilabel>Shutdown</guilabel> or <guilabel>Pre-KDE Startup</guilabel>. This column allows you to change when your script is run. Startup is when &kde; starts, shutdown is when you log out of &kde; and pre-KDE startup is before &kde; starts.
de: Programme (Einrichtungsdateien) können nur bei der KDE-Anmeldung ausgeführt werden. Skripte hingegen können beim <guilabel>Anmelden</guilabel>, <guilabel>Abmelden</guilabel> und <guilabel>Vor der KDE-Anmeldung</guilabel> ausgeführt werden. In dieser Spalte können Sie festlegen, wann das Skript ausgeführt wird. <guilabel>Anmelden</guilabel> heißt, wenn KDE startet, <guilabel>Abmelden</guilabel> heißt, wenn KDE beendet wird und <guilabel>Vor der KDE-Anmeldung</guilabel> heißt, bevor KDE gestartet wird.

source: Scripts and desktop files set to run on <guilabel>Startup</guilabel> are copied or symlinked in <filename class="directory">$KDEHOME/Autostart</filename> and will be run during &kde; startup.
de: Skripte und Einrichtungsdateien, die für die KDE-<guilabel>Anmeldung</guilabel> zum Start eingeplant sind, erhalten eine symbolische Verknüpfung oder werden in den Ordner <filename class="directory">$KDEHOME/Autostart</filename> kopiert. Bei der KDE-Anmeldung werden sie dann ausgeführt.

source: Scripts set on to be ran on <guilabel>Shutdown</guilabel> are copied or symlinked in the <filename class="directory">$KDEHOME/shutdown</filename> directory and will be automatically run during &kde; shutdown after the user has logged out.
de: Skripte, die für die KDE-<guilabel>Abmeldung</guilabel> zum Start eingeplant sind, erhalten eine symbolische Verknüpfung oder werden in den Ordner <filename class="directory">$KDEHOME/shutdown</filename> kopiert. Nach der KDE-Abmeldung des Benutzers werden sie ausgeführt.

source: Scripts set to run at <guilabel>Pre-&kde; Startup</guilabel> are copied or symlinked in <filename class="directory">$KDEHOME/env</filename> and are sourced during &kde; startup (the <filename>startkde</filename> script will look for scripts here).
de: Skripte, die <guilabel>vor der KDE-Anmeldung</guilabel> zum Start eingeplant sind, erhalten eine symbolische Verknüpfung oder werden in den Ordner <filename class="directory">$KDEHOME/env</filename> kopiert und dort während dem KDE-Start eingelesen (sourced). Das Skript <filename>startkde</filename> sucht in diesem Ordner nach ausführbaren Skripten.

source: Only scripts with the <filename>sh</filename> extension can be read by &kde; for <guilabel>Pre-&kde; startup</guilabel> and <guilabel>Shutdown</guilabel> modes.
de: Skripte, die vor der KDE-Anmeldung oder nach der Abmeldung ausgeführt werden sollen, müssen die Dateierweiterung <filename>.sh</filename> haben.

source: Actions
de: Aktionen

source: On the right you have some buttons to change the way Autostart is configure. You can add programs or scripts, remove them or change their properties.
de: Zur Rechten finden Sie einige Knöpfe, mit denen Sie das Verhalten von KDEs Autostart beeinflussen können. Hier können Sie Programme und Skripte hinzufügen, entfernen oder ihre Eigenschaften ändern.

source: Add Program
de: Programm hinzufügen

source: Clicking this button displays the standard &kde; <guilabel>Choose Application</guilabel> dialog and allows you to choose which program you want to start. After choosing the program, clicking <guibutton>OK</guibutton> brings you the properties for this program.
de: Wenn Sie auf diesen Knopf klicken, öffnet sich der bekannte <guilabel>Programm auswählen</guilabel>-Dialog von KDE, mit dessen Hilfe Sie ein Programm aus einer Liste auswählen können. Nachdem Sie das gewünschte Programm ausgewählt haben, klicken Sie auf <guibutton>OK</guibutton>, anschließend werden Ihnen die Eigenschaften zu dem Programm angezeigt.

source: This will copy the program Desktop file in your <filename class="directory">Autostart</filename> folder.
de: Die Einrichtungsdatei des Programms wird in Ihren <filename class="directory">Autostart</filename>-Ordner kopiert.

source: Add Script
de: Skript hinzufügen

source: This button opens a dialog which asks you for the location of the script you want to add. If you keep <guilabel>Create as symlink</guilabel> checked (default) then the script will be added as a symlink. If you uncheck this option then the script will be copied in the corresponding local folder.
de: Dieser Knopf öffnet ein Dialogfenster, in dem Sie den Namen bzw. den Pfad zu einem Skript eingeben müssen, das Sie hinzufügen möchten. Wenn Sie die Einstellung <guilabel>Als Verknüpfung erstellen</guilabel> aktiviert lassen, wird das Skript als Verknüpfung hinzugefügt. Wenn Sie die Markierung bei dieser Einstellung entfernen, wird das Skript in den entsprechenden Ordner kopiert.

source: Remove
de: Entfernen

source: Remove will immediately remove the Desktop file for the program or the script or symbolic link in the <filename class="directory">Autostart</filename> folder.
de: Damit wird die Einrichtungsdatei des Programms, das Skript oder die symbolische Verknüpfung im Ordner <filename class="directory">Autostart</filename> sofort gelöscht.

source: Properties
de: Eigenschaften

source: This button (only enabled for programs &ie; Desktop files) allows you to change the properties of the program or script. You have general properties, permissions properties, a preview when applicable and properties related to the application for programs.
de: Mit diesem Knopf, der nur für Programme &ie; Desktop-Dateien aktiviert ist, können Sie die Eigenschaften eines Programms oder Skriptes ändern. Es gibt allgemeine Eigenschaften, sowie Rechte, eine Vorschau und Eigenschaften, die sich auf das ausführbare Programm als solches beziehen.

source: Advanced
de: Erweitert

source: This button only applies to programs (&ie; Desktop files). A dialog asks you if you only want the program to autostart only in &kde; (and not in other desktop environments you might run). By default, the program will autostart in all desktop environments you might run. Checking <guilabel>Autostart only in KDE</guilabel> will autostart the program only if you start the &kde; desktop environment.
de: Dieser Knopf bezieht sich nur auf Programme (&ie; Einrichtungsdateien). Ein Dialogfenster fragt Sie, ob das Programm nur in KDE gestartet werden soll (und nicht in anderen möglichen Arbeitsumgebungen, die Sie vielleicht starten). In der Voreinstellung werden Autostart-Programme auch in anderen Arbeitsumgebungen automatisch gestartet. Wenn Sie diese Einstellung hier jedoch aktivieren, so wird das Programm nur in KDE automatisch bei der Anmeldung starten.

source: This sets the value KDE to the OnlyShowIn key of the program Desktop file.
de: Damit wird der Wert „KDE“ für das Schlüsselwort <quote>OnlyShowIn</quote> in der Einrichtungsdatei des Programmes gesetzt.
