Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kde-workspace/kcontrol_colors.po
Languages: de

source: Color state effects are applied to interface elements in the inactive (windows that do not have focus; only if <guilabel>Apply inactive window color effects</guilabel> is enabled) or disabled states. By changing the effects, the appearance of elements in these states can be changed. Usually, inactive elements will have reduced contrast (text fades slightly into the background) and may have slightly reduced intensity, while disabled elements will have strongly reduced contrast and are often notably darker or lighter.
de: Farbeffekte für Zustände werden auf Kontrollelemente im inaktiven oder deaktivierten Zustand angewendet.Für Fenster, die den Fokus nicht haben, trifft das nur zu, wenn <guilabel>Farbeffekte für inaktive Fenster anwenden</guilabel> eingeschaltet ist. Durch das Ändern der Effekte wird das Erscheinungsbild der Elemente in diesen Zuständen beeinflusst. Normalerweise haben inaktive Elemente weniger Kontrast und können auch in der Intensität leicht reduziert sein, bei deaktivierten Elementen ist der Kontrast stark reduziert und diese sind oft erheblich dunkler oder heller als aktive Elemente.

source: Three types of effect may be applied to each state (with the effects of the two states being independent). These are Intensity, Color and Contrast. The first two (Intensity, Color) control the overall color, while the last (Contrast) deals with the foreground colors relative to the background.
de: Drei Arten von Effekten können auf die beiden Zustände angewendet werden (die beiden Zustände sind hierbei unabhängig voneinander). Diese sind Intensität, Farbe und Kontrast. Die ersten beiden (Intensität und Farbe bestimmen die Gesamtfarbe, die Einstellungen zu Kontrast bestimmen den Unterschied zwischen Vorder- und Hintergrundfarbe.

source: Intensity
de: Intensität

source: Intensity allows the overall color to be lightened or darkened. Setting the slider to the middle produces no change. The available effects are:
de: Intensität erhellt oder verdunkelt die Gesamtfarbe. Das Schieben des Reglers auf die Mitte ändert nichts. Die vorhandenen Effekte sind:

source: Shade &mdash; makes everything lighter or darker in a controlled manner. Each &quot;tick&quot; on the slider increases or decreases the overall intensity (&ie; perceived brightness) by an absolute amount.
de: Einfärben &mdash; macht Alles kontrolliert heller oder dunkler. Jede Stufe (<quote>tick</quote>) am Schieberegler erhöht oder vermindert die Gesamtintensität (&ie; wahrgenommene Helligkeit) um einen absoluten Betrag.

source: Darken &mdash; changes the intensity to a percentage of the initial value. A slider setting halfway between middle and maximum results in a color half as intense as the original. The minimum gives a color twice as intense as the original.
de: Abdunkeln &mdash; ändert die Intensität auf einen Prozentwert des Anfangswertes. Ein Schieberegler, der auf den halben Weg zwischen Mitte und Maximum gesetzt wird, erzeugt eine Farbe mit der halben Intensität des Originals. Das Minimum ergibt eine Farbe mit der doppelten Intensität des Originals.

source: Lighten &mdash; conceptually the opposite of darken; lighten can be thought of as working with &quot;distance from white&quot;, where darken works with &quot;distance from black&quot;. The minimum is a color twice as &quot;far&quot; from white as the original, while halfway between middle and maximum gives an intensity halfway between the original color and white.
de: Aufhellen &mdash; ist vom Konzept her das Gegenteil von Abdunkeln; Aufhellen kann als Abstandseinstellung zu „Weiss“ verstanden werden, während Abdunkeln die Abstandseinstellung zu „Schwarz“ darstellt. Das Minimum des Schiebereglers ist eine Farbe doppelt so <quote>weit</quote> von „Weiss“ wie das Original, während der halbe Weg zwischen der Mitte und dem Maximum eine Farbe mit der halben Intensität zwischen der Originalfarbe und „Weiss“ ergibt.

source: Color
de: Farbe

source: Color also changes the overall color, but is not limited to intensity. The available effects are:
de: Farbe ändert die Gesamtfarbe, nicht nur deren Intensität. Die verfügbaren Effekte sind:

source: Desaturate &mdash; changes the relative chroma. The middle setting produces no change; maximum gives a gray whose perceptual intensity equals that of the original color. Lower settings increase the chroma, giving a color that is less gray / more &quot;vibrant&quot; than the original.
de: Sättigung vermindern &mdash; ändert die Farbsättigung. Die Mittelstellung ändert nichts, das Maximum ergibt ein Grau, dessen Helligkeit der Originalfarbe entspricht. Kleinere Einstellungen ergeben sattere Farben, die weniger „grau“ oder mehr <quote>dynamisch</quote> als das Original sind.

source: Fade &mdash; smoothly blends the original color into a reference color. The minimum setting on the slider produces no change; maximum gives the reference color.
de: Überblenden &mdash; blendet die Originalfarbe weich in die Referenzfarbe über. Das Minimum ergibt keine Änderungen, das Maximum ergibt die Referenzfarbe.

source: Tint &mdash; similar to Fade, except that the color (hue and chroma) changes more quickly while the intensity changes more slowly as the slider value is increased.
de: Einfärben &mdash; ist ähnlich zu Überblenden, aber die Farbe (Farbton und -Sättigung) wird schneller, die Intensität langsamer geändert, wenn der Schieberegler zu höheren Werten verstellt wird.

source: Contrast
de: Kontrast

source: The contrast effects are similar to the color effects, except they apply to the text, using the background color as the reference color, and desaturate is not available. Fade produces text that &quot;fades out&quot; more quickly, but keeps its color longer, while Tint produces text that changes color to match the background more quickly while keeping a greater intensity contrast for longer (where &quot;longer&quot; means higher settings on the slider). For Contrast effects, the minimum setting on the slider produces no change, while maximum causes the text to completely disappear into the background.
de: Die Kontrasteffekte sind den Farbeffekten ähnlich, sie beziehen sich aber auf den Text und die Hintergrundfarbe wird als Referenzfarbe benutzt, außerdem ist „Sättigung vermindern“ nicht vorhanden. Überblenden erzeugt Text, der schneller <quote>ausblendet</quote> und seine Farbe länger behält, während Einfärben die Farbe schneller an die Hintergrundfarbe anpasst, aber länger den Intensitätskontrast behält. Länger heißt hier bei höheren Einstellungen des Schiebereglers. Bei Kontrasteffekten verschwindet im Maximum der Text in der Hintergrundfarbe, das Minimum ändert nichts.
