Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kde-workspace/kcontrol_kcmsmserver.po
Languages: de

source: Session Management
de: Sitzungsverwaltung

source: ROLES_OF_TRANSLATORS
de: <!-- Unbekannt -->

source: KControl
de: Kontrollzentrum

source: session
de: Sitzung

source: System Settings
de: Systemeinstellungen

source: <title>Use</title>
de: <title>Benutzung</title>

source: In this &systemsettings; module you can configure &kde;'s session manager and logout settings.
de: In diesem &systemsettings;-Modul können Sie die Sitzungsverwaltung von &kde; und Optionen für das Abmelden einrichten.

source: Session management refers to &kde;'s ability to save the state of applications and windows when you log out of &kde; and restore them when you log back in.
de: Sitzungsverwaltung bezieht sich auf die Fähigkeit von &kde;, bei der Abmeldung von &kde; den Status von Anwendungen und Fenstern zu speichern und diesen bei der erneuten Anmeldung wiederherzustellen.

source: General
de: Allgemein

source: Confirm logout
de: Abmeldung bestätigen

source: If this option is checked, when logging out, &kde; will display a dialog asking for confirmation. In this dialog you can also choose whether you want to restore your current session when you login the next time.
de: Ist diese Einstellung markiert, bittet &kde; beim Abmelden um Bestätigung. In diesem Dialog können Sie außerdem auswählen, ob Sie beim nächsten Anmelden Ihre jetzige Sitzung wiederhergestellt haben möchten.

source: Offer shutdown options
de: Optionen für das Herunterfahren anbieten

source: If this option is checked, &kde; will offer a choice of actions during logout. These include simply ending the current session (the action performed if shutdown options are not enabled) turning off the computer, or restarting the computer.
de: Wenn diese Einstellung aktiviert ist, wird &kde; beim Abmelden verschiedene Möglichkeiten anbieten. Dazu gehört &eg; das einfache Beenden der aktuellen Sitzung (die Voreinstellung wenn keine Wahlmöglichkeit angeboten wird), den Rechner ausschalten und den Rechner neustarten.

source: Default Leave Option
de: Standardeinstellung für das Abmelden

source: You can configure what should happen by default when you log out of &kde;. These options are not possible on all operating systems, and some of them may not appear unless you are using &kdm; as your login manager.
de: Darüberhinaus können Sie einstellen, was standardmäßig geschieht, wenn Sie sich von &kde; abmelden. Diese Einstellungen gibt es nicht auf allen Betriebssystemen und zum Teil setzen sie die Verwendung von &kdm; als Anmeldungsmanager voraus.

source: The options available are self explanatory, if you are in doubt, leave the default settings. They are:
de: Die Einstellung erklären sich von selbst. Im Zweifelsfall belassen Sie es bei der Standardeinstellung. Es handelt sich um folgende Einstellungen:

source: <guilabel>End current session</guilabel> (this is the default)
de: <guilabel>Aktuelle Sitzung beenden</guilabel> (dies ist die Voreinstellung)

source: Turn off computer
de: Rechner ausschalten

source: Restart computer
de: Rechner neu starten

source: On Login
de: Bei der Anmeldung

source: You may choose one of three options on what should happen when you log into &kde;:
de: Sie können eine von drei Einstellungen zur &kde;-Anmeldung wählen:

source: Restore previous session
de: Vorige Sitzung wiederherstellen

source: If this option is checked, &kde; will save your current session's state when you logout. &kde; will restore your session on the next login, so you can continue to work with a desktop just like you left it.
de: Ist diese Einstellung markiert, speichert &kde; den Sitzungszustand beim Abmelden und stellt diesen Zustand beim nächsten Anmelden wieder her. Damit können Sie direkt dort weiterarbeiten, wo Sie aufgehört haben.

source: Restore manually saved session
de: Manuell gespeicherte Sitzung wiederherstellen

source: Instead of restoring &kde; to the state it was when you logged out last, it will be restored to a specific state that you have saved manually.
de: Anstatt den Status wiederherzustellen, den &kde; beim letzten Abmelden hatte, wird ein Zustand wiederhergestellt, den Sie vorher manuell gespeichert haben.

source: If this option is checked, the start menu offers an additional item <menuchoice><guimenu>Leave</guimenu><guimenuitem>Save Session</guimenuitem></menuchoice>.
de: Ist diese Einstellung aktiv, enthält das Startmenü den zusätzlichen Eintrag <menuchoice><guimenu>Verlassen</guimenu><guimenuitem>Sitzung speichern</guimenuitem></menuchoice>.

source: Start with an empty session
de: Mit leerer Sitzung starten

source: If you choose this option, &kde; will never restore sessions that it has saved.
de: Ist diese Einstellung ausgewählt, wird &kde; keine gespeicherte Sitzung wiederherstellen.

source: Finally, you can enter a colon (<literal>:</literal>) or comma (<literal>,</literal>) separated list of applications that should not be saved in sessions, and therefore will not be started when restoring a session. For example <userinput>xterm:konsole</userinput> or <userinput>xterm,konsole</userinput>.
de: Schließlich können Sie noch eine durch Doppelpunkt (<literal>:</literal>) oder Komma (<literal>,</literal>) getrennte Liste von Anwendungen angeben, die nicht in Arbeitssitzungen gespeichert werden sollen und darum beim Wiederherstellen der Sitzung nicht gestartet werden. Ein Beispiel: <userinput>xterm:konsole</userinput> oder <userinput>xterm,konsole</userinput>.
