Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kde-workspace/kcontrol_colors.po
Languages: de

source: Colors
de: Farben

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Jürgen</firstname><surname>Nagel</surname><affiliation><address><email>JuergenNagel@web.de</email></address></affiliation><contrib>Deutsche Übersetzung</contrib></othercredit> <othercredit role="translator"><firstname>Frank</firstname><surname>Brücker</surname><affiliation><address><email>f.bruecker@gmx.de</email></address></affiliation><contrib>Überarbeitung der Übersetzung</contrib></othercredit>

source: KControl
de: Systemeinstellungen

source: color
de: Farbe

source: Introduction
de: Einleitung

source: The Color Selection module is comprised of several sections:
de: Das Modul „Farben“ besteht aus mehreren Abschnitten:

source: <link linkend="color-scheme">The <guilabel>Scheme</guilabel> tab</link>, used to manage schemes.
de: <link linkend="color-scheme">Die Karteikarte <guilabel>Schema</guilabel></link> zur Verwaltung der Farbschemata.

source: <link linkend="color-options">The <guilabel>Options</guilabel> tab</link>, used to change the options of the current scheme.
de: <link linkend="color-options">Die Karteikarte <guilabel>Optionen</guilabel></link> zur Änderung der Einstellungen für das aktuelle Schema.

source: <link linkend="color-colors">The <guilabel>Colors</guilabel> tab</link>, used to change the colors of the current scheme.
de: <link linkend="color-colors">Die Karteikarte <guilabel>Farbauswahl</guilabel></link> zur Änderung der Farben für das aktuelle Schema.

source: <link linkend="color-effects">The state effects tabs</link> (<guilabel>Inactive</guilabel>, <guilabel>Disabled</guilabel>), used to change the state effects of the current scheme.
de: <link linkend="color-effects">Die Karteikarte für die Statuseffekte</link> (<guilabel>Inaktiv</guilabel>, <guilabel>Deaktiviert</guilabel>) zur Änderung der Statuseffekte für das aktuelle Schema.

source: Note: This documentation will sometimes refer to the &quot;current&quot; scheme, or the &quot;active&quot; scheme. The &quot;current&quot; scheme is the set of colors and color scheme options that was most recently applied, &ie; what you would get if you choose <guibutton>Cancel</guibutton>. The &quot;active&quot; scheme is the set of colors as has been most recently edited by you, &ie; what you would get if you choose <guibutton>Apply</guibutton>.
de: Anmerkung: Dieses Handbuch bezieht sich mehrfach auf das <quote>aktuelle</quote> oder das <quote>aktive</quote> Farbschema. Das <quote>aktuelle</quote> Farbschema sind die Einstellungen für Farben und Optionen, die zuletzt übernommen wurden, &ie; diese würden Sie erhalten, wenn Sie auf <guibutton>Verwerfen</guibutton> klicken. Das <quote>aktive</quote> Farbschema sind die Einstellungen für Farben und Optionen, die Sie zuletzt eingestellt haben, diese würden Sie erhalten, wenn Sie auf <guibutton>Anwenden</guibutton> klicken.

source: Scheme Management
de: Verwaltung der Farbschemata

source: The <guilabel>Scheme</guilabel> tab lets you manage the color schemes on your machine. Only one scheme is active at once, but you may save schemes, allowing you to quickly change the scheme later. When you have created a scheme you like, you can save it with <guibutton>Save Scheme...</guibutton>. You can remove schemes using <guibutton>Remove Scheme</guibutton>. Note that system schemes cannot be removed; trying to do so will display an error.
de: Die Karteikarte <guilabel>Schema</guilabel> dient zum Einstellen der Farbschemata auf Ihrem Rechner. Nur ein Farbschema ist aktiv, Sie können Farbschemata speichern, um diese später zu wechseln. Wenn Sie ein Farbschema eingestellt haben, das Ihnen gefällt, dann speichern Sie es mit <guibutton>Schema speichern</guibutton>. Sie können Farbschemata mit <guibutton>Schema entfernen</guibutton> löschen. Farbschemata des Systems können Sie nicht löschen, wenn Sie das versuchen, wird eine Fehlermeldung angezeigt.

source: &kde; ships with several schemes. If you have an Internet connection, you can also browse and retrieve user-created schemes using <guibutton>Get New Schemes...</guibutton>.
de: &kde; enthält mehrere Farbschemata. Mit einer Internetverbindung können zusätzliche von Benutzern erstellte Schemata mit <guibutton>Neue Farbschemata herunterladen</guibutton> installiert werden.

source: Importing Schemes
de: Farbschemata importieren

source: You can also import schemes that you have downloaded or otherwise obtained, as well as import &kde; 3 schemes. &kde; 4 color schemes are named like &quot;*.colors&quot;, while &kde; 3 schemes are named like &quot;*.kcsrc&quot;.
de: Sie können außerdem Schemata, die Sie bereits heruntergeladen oder von Anderen erhalten haben, und auch Schemata aus &kde; 3 importieren. Die Farbschemata aus &kde; 4 haben die Dateierweiterung <quote>*.colors</quote> und aus &kde; 3 <quote>*.kcsrc</quote>.

source: Because &kde; 4 has many more color roles than &kde;, importing a &kde; 3 scheme is different from importing a &kde; 4 scheme. When a &kde; 4 scheme is imported, it becomes part of your saved scheme collection. When a &kde; 3 scheme is imported, the colors that exist in &kde; 3 are overlaid onto the active scheme, and the result is not automatically saved into your collection. After importing a &kde; 3 scheme, you will likely need to adjust the colors that are new in &kde; 4, as well as the state effects. For best results, before importing a &kde; 3 scheme, select a similar &kde; 4 scheme (you do not need to apply the scheme before importing).
de: Weil &kde; 4 eine erheblich größere Anzahl an Farbzuordnungen hat als &kde; 3, unterscheidet sich das Importieren eines Farbschemas von &kde; 3 vom Import eines &kde; 4-Farbschemas. Ein importiertes &kde; 4-Farbschema wird Teil der Sammlung der gespeicherten Farbschemata. Beim Importieren eines &kde; 3-Farbschemas werden die in &kde; 3 vorhandenen Farben mit dem aktiven Farbschema überlagert, das Ergebnis wird nicht automatisch gespeichert. Wahrscheinlich müssen Sie nach dem Import eines &kde; 3-Farbschemas noch Farben und Effekte, die neu in &kde; 4 sind, nachbearbeiten, Die besten Ergebnisse erreichen Sie, wenn Sie vor dem Importieren des &kde; 3-Farbschemas ein ähnliches &kde; 4-Farbschema auswählen, Sie müssen dieses nicht übernehmen.

source: Color Scheme Options
de: Einstellungen für das Farbschema

source: The <guilabel>Options</guilabel> tab allows you to change some properties that deal with how the color scheme is used, as well as some options that change the color scheme that are different from actually assigning colors.
de: Die Karteikarte <guilabel>Optionen</guilabel> beinhaltet Einstellungen zum benutzten Farbschema und einige Einstellungen zum Farbschema, aber nicht zur Einstellung von Farben.

source: <guilabel>Apply inactive window color effects</guilabel> &mdash; If checked, state effects (see below) will be applied to inactive windows. This can help visually identify active versus inactive windows, and may have aesthetic value, depending on your taste. However, some users feel that it causes distracting &quot;flickering&quot; since windows must be repainted when they become inactive. Unlike desktop effects, color state effects do not require compositing support and will work on all systems, however they will only work on &kde; 4 applications.
de: <guilabel>Farbeffekte für inaktive Fenster anwenden</guilabel> &mdash; Wenn ausgewählt, werden die Einstellungen des Karteireiters <guilabel>Inaktiv</guilabel> auf inaktive Fenster angewendet. Das dient zur einfacheren Unterscheidung aktiver und inaktiver Fenster, kann aber auch einfach nur aus ästhetischen Gründen geschehen. Einige Benutzer berichten von störendem Flackern, weil die Fenster neu gezeichnet werden, wenn diese inaktiv geschaltet werden. Anders als bei Arbeitsflächeneffekten, brauchen Farbeffekte keine Unterstützung für Compositing und funktionieren auf allen Systemen, aber nur mit &kde;-4-Anwendungen.

source: <guilabel>Inactive selection changes color</guilabel> &mdash; If checked, the current selection in elements which do not have input focus will be drawn using a different color. This can assist visual identification of the element with input focus in some applications, especially those which simultaneously display several lists.
de: <guilabel>Andere Farbe für inaktive Auswahl</guilabel> &mdash; Wenn ausgewählt, werden die ausgewählten Elemente eines inaktiven Fensters, die nicht den Eingabefokus haben, in einer anderen Farbe dargestellt. Das hilft beim Erkennen des ausgewählten Element in einigen Anwendungen, speziell Anwendungen die mehrere Listen gleichzeitig anzeigen.

source: <guilabel>Shade sorted column in lists</guilabel> &mdash; If checked, multi-column lists will use a slightly different color to paint the column whose information is being used to sort the items in the list.
de: <guilabel>Sortierte Spalte in Listen einfärben</guilabel> &mdash; Wenn ausgewählt, wird bei Listen mit mehreren Spalten die Spalte, deren Inhalt zum Sortieren der Liste verwendet wurde, in einer etwas anderen Farbe dargestellt.

source: <guilabel>Apply colors to non-KDE4 applications</guilabel> &mdash; If checked, &kde; will attempt to export its color scheme so that non-&kde; 4 applications will use the same colors. Most applications will honor the exported scheme to varying degrees, though some may have bugs or otherwise not honor the exported scheme.
de: <guilabel>Farben auf Nicht-KDE-4-Programme anwenden</guilabel> &mdash; Wenn diese Einstellung ausgewählt ist, versucht &kde; das Farbschema zu exportieren, sodass Nicht-KDE-4-Programme die gleichen Farben benutzen. Die meisten Programme werden das exportierte Farbschema in unterschiedlicher Genauigkeit verwenden, aber manche ignorieren das Schema wegen Fehlern oder anderen Gründen.

source: <guilabel>Contrast</guilabel> &mdash; This slider controls the contrast of shaded elements, such as frame borders and the &quot;3D&quot; effects used by most styles. A lower value gives less contrast and therefore softer edges, while a higher value makes such edges &quot;stand out&quot; more.
de: <guilabel>Kontrast</guilabel> &mdash; Dieser Schieberegler steuert den Kontrast von schattierten Elementen, die in den meisten Stilen benutzt werden, wie Rahmen und <quote>3D</quote>-Effekte. Kleinere Werte ergeben weniger Kontrast und demzufolge weichere Kanten, höhere Werte heben solche Kanten stärker hervor.

source: The <guilabel>Colors</guilabel> tab allows you to change the colors in the active color scheme.
de: Auf der Karteikarte <guilabel>Farbauswahl</guilabel> können die Farben des aktiven Farbschemas eingestellt werden.

source: Creating or changing a scheme is a simple matter of clicking on the swatch in the color list and selecting a new color. You can check your changes at any time by pressing <guibutton>Apply</guibutton>. It is suggested that you save your scheme (via the <guilabel>Scheme</guilabel> tab) when you are done.
de: Das Erzeugen oder Ändern eines Farbschemas geschieht einfach durch Anklicken des Musterabschnitts und das Auswählen einer neuen Farbe. Durch Drücken des Knopfes <guibutton>Anwenden</guibutton> können Sie jederzeit die Auswirkungen Ihrer Änderungen überprüfen. Es wird empfohlen, Ihr neues Farbschema mit <guilabel>Schema speichern</guilabel> auf der Karteikarte <guilabel>Schema</guilabel> zu speichern.

source: The <guilabel>Common Colors</guilabel> set, which is displayed initially, is not actually a &quot;set&quot; in the sense used by &kde; (see next section), but presents a number of color roles in a way that makes it easier to edit the scheme as a whole. When creating a new color scheme, you will usually change these colors first, and use the other sets to tweak specific colors if needed.
de: Der Farbsatz <guilabel>Allgemeine Farben</guilabel>, der anfangs angezeigt wird, ist kein wirklicher <quote>Farbsatz</quote> im Sinn von &kde;, sondern enthält eine Anzahl Farbzuordnungen, die es einfacher machen, das Farbschema als Ganzes zu ändern. Beim Erstellen eines neuen Farbschemas werden Sie diese Farben normalerweise zuerst ändern und dann die anderen Farbsätze nach Bedarf anpassen.

source: Note that <guilabel>Common Colors</guilabel> makes available roles from all sets. For example, &quot;View Background&quot; here is shorthand for the Normal Background role from the View set. Also, setting colors that do not refer to a specific set will change that color in <emphasis>all</emphasis> sets. (As an exception, &quot;Inactive Text&quot; will change the color for all sets <emphasis>except</emphasis> for Selection; there is a separate &quot;Selection Inactive Text&quot; for Inactive Text in the Selection set.) Some roles may not be visible under <guilabel>Common Colors</guilabel> at all, and can only be changed (if needed) by selecting the appropriate set.
de: Beachten Sie, dass <guilabel>Allgemeine Farben</guilabel> Farbzuordnungen einstellt, die von allen Farbsätzen verfügbar sind. Zum Beispiel, <quote>Allgemeiner Hintergrund</quote> steht hier abgekürzt für die Farbzuordnung „normaler Hintergrund“ vom Farbsatz „Anzeigen“. Das Einstellen von Farben, die nicht zu einem speziellen Farbsatz gehören, ändert diese Farbe in <emphasis>allen</emphasis> Farbsätzen. (Ausnahme: <quote>Inaktiver Text</quote> ändert die Farbe in allen Farbsätzen <emphasis>ausser</emphasis> für Auswahl, dafür gibt es eine separate Einstellung <quote>Ausgewählter inaktiver Text</quote> für inaktiven Text im Farbsatz „Auswahl“). Einige Farbzuordnungen sind nicht unter <guilabel>Allgemeine Farben</guilabel> verfügbar, diese können nur im entsprechenden Farbsatz eingestellt werden.

source: Color Sets
de: Farbsätze

source: &kde; 4 breaks the color scheme into several sets based on the type of user interface element, as follows:
de: In &kde; 4 werden die Farbschemata in mehrere Gruppen für unterschiedliche Elemente der Benutzerschnittstelle eingeteilt:

source: <guilabel>View</guilabel> &mdash; information presentation elements, such as lists, trees, text input boxes, etc.
de: <guilabel>Ansichten</guilabel> &mdash; Elemente die Informationen anzeigen wie zum Beispiel Listen, Baumansichten, Texteingabefelder usw.

source: <guilabel>Window</guilabel> &mdash; window elements that are not buttons or views.
de: <guilabel>Fenster</guilabel> &mdash; Fensterelemente ausser Knöpfen oder Ansichten.

source: <guilabel>Button</guilabel> &mdash; buttons and similar elements.
de: <guilabel>Knopf</guilabel> &mdash; Knöpfe und ähnliche Elemente.

source: <guilabel>Selection</guilabel> &mdash; selected text and items.
de: <guilabel>Auswahl</guilabel> &mdash; ausgewählter Text und Elemente.

source: <guilabel>Tooltip</guilabel> &mdash; tool tips, &quot;What's This&quot; tips, and similar elements.
de: <guilabel>Kurzinfo</guilabel> &mdash; Kurzinfos, <quote>Was ist das?</quote>-Hilfe und ähnliche Elemente.

source: Window Manager &mdash; window title bars and related elements.
de: Fenstermanager &mdash; Titelleisten der Fenster und ähnliche Elemente.

source: Each set contains a number of color roles. Except for the Window Manager colors, each set has the same roles. All colors are associated with one of the above sets.
de: Jeder Farbsatz enthält eine Anzahl von Farbzuordnungen. Jeder Satz enthält dieselben Zuordnungen, bis auf die Zuordnungen für den Fenstermanager. Alle Farben sind einem der Farbsätze zugeordnet.

source: Color Roles
de: Farbzuordnungen

source: Each color set is made up of a number of roles which are available in all other sets. (The Window Manager set is an exception; it has its own unique roles that do not exist in any other set, and does not use the same roles as the other sets.) In addition to the obvious Normal Text and Normal Background, these roles are as follows:
de: Jeder Farbsatz besteht aus einer Anzahl von Farbzuordnungen, die auch in allen anderen Farbsätzen verfügbar sind. (Der Fenstermanager ist eine Ausnahme, dieser hat seine eigenen Farbzuordnungen, die in keinem anderen Farbsatz existieren und er nutzt nicht die Zuordnungen der anderen Farbsätze.) Zusätzlich zu den offensichtlichen Zuordnungen „normaler Text“ und „normaler Hintergrund“ gibt es folgende Zuordnungen:

source: Alternate Background &mdash; used when there is a need to subtly change the background to aid in item association. This might be used &eg; as the background of a heading, but is mostly used for alternating rows in lists, especially multi-column lists, to aid in visually tracking rows.
de: Alternativer Hintergrund &mdash; wird benutzt, wenn der Hintergrund zur Unterstützung der visuellen Zuordnung leicht umgefärbt werden soll. Dies kann &eg; als Hintergrund eines Tabellenkopfes benutzt werden, aber meistens wird es zur Unterscheidung von Zeilen in Listen verwendet, die besonders in Listen mit mehreren Spalten abwechselnd eingefärbt werden.

source: Link Text &mdash; used for hyperlinks or to otherwise indicate &quot;something which may be visited&quot;, or to show relationships.
de: Verknüpfung &mdash; wird zur Hervorhebung von Hyperlinks benutzt, oder um <quote>andere Dinge, die besucht werden können</quote> sowie Beziehungen hervorzuheben.

source: Visited Text &mdash; used for &quot;something (&eg; a hyperlink) that has been visited&quot;, or to indicate something that is "old".
de: Besuchte Verknüpfung &mdash; wird für <quote>irgendetwas (&eg; ein Hyperlink), das schon besucht wurde</quote> benutzt oder um Dinge zu kennzeichnen, die „alt“ sind.

source: Active Text &mdash; used to indicate an active element or attract attention, &eg; alerts, notifications; also for hovered hyperlinks.
de: Text (aktiv) &mdash; wird zur Kennzeichnung eines aktiven Elementes oder schwebenden Hyperlinks benutzt oder um die Aufmerksamkeit auf &eg; Alarme und Mitteilungen zu lenken.

source: Inactive Text &mdash; used for text which should be unobtrusive, &eg; comments, &quot;subtitles&quot;, unimportant information, etc.
de: Text (inaktiv) &mdash; wird für Text benutzt, der unaufdringlich wirken soll, wie &eg; Kommentare, <quote>Untertitel</quote> unwichtige Informationen usw.

source: Negative Text &mdash; used for errors, failure notices, notifications that an action may be dangerous (&eg; unsafe web page or security context), etc.
de: Negativer Text &mdash; wird für Fehler, Fehlermeldungen oder für Meldungen zu eventuell gefährlichen Aktionen (&eg; unsichere Internetseite) usw. benutzt.

source: Neutral Text &mdash; used to draw attention when another role is not appropriate; &eg; warnings, to indicate secure/encrypted content, etc.
de: Neutraler Text &mdash; wird benutzt, wenn eine andere Zuordnung nicht zutreffend ist, &eg; für Warnungen, um verschlüsselte Inhalte darzustellen usw.

source: Positive Text &mdash; used for success notices, to indicate trusted content, etc.
de: Positiver Text &mdash; wird für Erfolgsmeldungen oder zur Kennzeichnung von vertrauenswürdigem Inhalt usw. benutzt.

source: As well as the text roles, there are a few additional &quot;decoration&quot; roles that are used for drawing lines or shading UI elements (while the above may, in appropriate circumstances, also be used for this purpose, the following are specifically <emphasis>not</emphasis> meant for drawing text). These are:
de: Genau wie für die Zuordnungen für Text gibt es einige weitere Zuordnungen für die <quote>Dekorationen</quote>, die benutzt werden, um Linien oder Elemente der Bedienoberfläche hervorzuheben. Die bisher genannten Zuordnungen können bei passenden Bedingungen auch dafür benutzt werden, die jetzt im Folgenden besprochenen sind aber ausdrücklich <emphasis>nicht</emphasis> für Text gedacht. Es handelt sich im Einzelnen um:

source: Focus Decoration &mdash; used to indicate the item which has active input focus.
de: Dekoration (Fokussiertes Element) &mdash; wird benutzt, um das Element zu kennzeichnen, das die Eingaben annimmt.

source: Hover Decoration &mdash; used for mouse-over effects, &eg; the "illumination" effects for buttons.
de: Dekoration (Hover; Überfahren mit der Maus) &mdash; wird für Effekte benutzt, die beim Überfahren mit der Maus aktiv werden, wie &eg; die Beleuchtungseffekte von Knöpfen.

source: In addition, except for Inactive Text, there is a corresponding background role for each of the text roles. Currently (except for Normal and Alternate Background), these colors are not chosen by the user, but are automatically determined based on Normal Background and the corresponding Text color. These colors may be previewed by selecting one of the sets other than &quot;Common Colors&quot;.
de: Zusätzlich gibt es (ausser für inaktiven Text) zu jeder Farbzuordnung eine Farbzuordnung für den Hintergrund. Gegenwärtig werden diese Farbzuordnungen automatisch in Abhängigkeit von der normalen Hintergrundfarbe und der dazugehörigen Textfarbe eingestellt, nur die Farben für den normalen und den alternativen Hintergrund können Sie selbst wählen. Die automatisch ausgewählten Farben können Sie mit der Auswahl eines der Farbsätze ausser <quote>Allgemeine Farben</quote> vorab ansehen.

source: The choice of color role is left to the developer; the above are guidelines intended to represent typical usage.
de: Die Auswahl des Farbsatzes ist dem Entwickler überlassen, das bisher gesagte sind Richtlinien für typische Einsatzfälle.

source: Window Manager Colors
de: Fenstermanagerfarben

source: As previously stated, the Window Manager set has its own roles, independent of those in other sets. These are (currently) only accessible via <guilabel>Common Colors</guilabel>, and are as follows:
de: Wie schon erwähnt, hat der Fenstermanager seine eigenen Farbzuordnungen, die unabhängig von den anderen Farbsätzen sind. Diese werden im Folgenden beschrieben und können gegenwärtig nur über <guilabel>Allgemeine Farben</guilabel> geändert werden:

source: Active Titlebar &mdash; used to draw the title bar background, borders, and/or decorations for the active window (that is, the one with input focus). Not all window decorations will use this in the same way, and some may even use the Normal Background from the Window set to draw the title bar.
de: Aktive Titelleiste &mdash; wird für den Hintergrund der Titelleiste, die Rahmen und/oder die Dekorationen des aktiven Fensters benutzt. Nicht alle Fensterdekorationen benutzen diese Farbe in derselben Weise, manche benutzen sogar die normale Hintergrundfarbe vom Fensterfarbsatz für die Titelleiste.

source: Active Titlebar Text &mdash; used to draw the title bar text when Active Titlebar is used to draw the title bar background. May also be used for other foreground elements which use Active Titlebar as the background.
de: Text in aktiver Titelleiste &mdash; wird zum Schreiben des Titelleistentextes benutzt, wenn die Farbe „Aktive Titelleiste“ zur Darstellung des Hintergrundes benutzt wird. Diese Farbe kann auch verwendet werden, wenn andere Elemente die Farbe „Aktive Titelleiste“ als Hintergrund benutzen.

source: The Inactive Titlebar [Text] roles are the same as the above, but for inactive windows, rather than active windows.
de: Die Farbzuordnungen für Text in inaktiver Titelleiste sind gleich, aber gelten für inaktive, nicht für aktive Fenster.

source: Color State Effects
de: Farbeffekte für Zustände (Inaktiv/Deaktiviert)
