Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kde-workspace/kcontrol_bell.po
Languages: de

source: System Bell
de: Signalton

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Frank</firstname><surname>Schütte</surname><affiliation><address><email>F.Schuette@t-online.de</email></address></affiliation><contrib>Deutsche Übersetzung</contrib></othercredit>

source: The system bell or beep is a feature of the X server, which attempts to make good use of the available hardware.
de: Der Signalton wird durch den X Server unter Ausnutzung der bereitstehenden Hardware so gut wie möglich produziert.

source: &kde; normally does not use the system bell; instead using its own system notifications, which could include log entries, message popups, or its own beep. You can configure these in the <guilabel>Manage Notifications</guilabel> &systemsettings; module.
de: &kde; verwendet normalerweise nicht den Signalton, sondern die eigenen Systemnachrichten, die aus Einträgen in Protokolldateien, Nachrichtenfenstern oder einem eigenen Signalton bestehen können. Sie können diese im &systemsettings;-Modul <guilabel>Benachrichtigungen verwalten</guilabel> einrichten.

source: It is not always possible for the X server to actually make a beep sound with exactly the parameters selected due to hardware limitations. For example, on most PCs, volume control is not very good so the X server seems to fake low volume with a reduced duration of the sound. Thus, if the settings do not seem to do anything, this is because the X server and/or the hardware do not support anything better.
de: Es ist nicht immer möglich, den Signalton gemäß den Einstellungen zu produzieren. Beispielsweise funktioniert bei PC-Lautsprechern die Lautstärkeeinstellung wegen eingeschränkter Hardwaremöglichkeiten nur teilweise. Der X Server versucht eine geringere Lautstärke durch einen kürzeren Signalton zu simulieren. Wenn Sie feststellen, dass die Einstellungen nicht den gewünschten Effekt bewirken, liegt das am X Server oder an der zur Verfügung stehenden Hardware.

source: Select <guilabel>Use system bell instead of system notification</guilabel> then you are able to set the following parameters for the bell:
de: Ist die Einstellung <guilabel>Signalton statt Systemnachrichten verwenden</guilabel>, dann können folgende Parameter für den Signalton eingestellt werden:

source: <guilabel>Volume</guilabel> (percentage of <quote>maximum</quote> volume)
de: <guilabel>Lautstärke</guilabel> (in Prozent der <quote>Maximallautstärke</quote>)

source: Here you can customize the volume of the system bell.
de: Hier können Sie die Lautstärke des System-Signaltons einstellen.

source: <guilabel>Pitch</guilabel> (in Hz)
de: <guilabel>Höhe</guilabel> (in Hz)

source: Here you can customize the pitch of the system bell.
de: Hier können Sie die Höhe des System-Signaltons einstellen.

source: <guilabel>Duration</guilabel> (in milliseconds)
de: <guilabel>Dauer</guilabel> (in Millisekunden)

source: Here you can customize the duration of the system bell.
de: Hier können Sie die Dauer des System-Signaltons einstellen.

source: For further customization of the bell, see the <guilabel>Accessibility</guilabel> &systemsettings; module.
de: Zusätzliche Einstellmöglichkeiten für den Signalton finden Sie in den &systemsettings; im Modul <guilabel>Zugangshilfen</guilabel>.

source: You can use the <guibutton>Test</guibutton> button to hear how the current settings will sound.
de: Sie können durch Klicken auf den Knopf <guibutton>Test</guibutton> die aktuellen Einstellungen ausprobieren.
