Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kde-workspace/kcontrol_khotkeys.po
Languages: de

source: Most keys contain a single character, and to enter them here you just enter that character. For instance, to type an <quote>A</quote>, just enter <userinput>A</userinput>. Some keys have longer names, and you can also use those names. For instance, to press the &Alt; key, simply enter <userinput>Alt</userinput>.
de: Die meisten Tastendrücke bestehen aus nur einem Zeichen, das Sie direkt eingeben. Zum Beispiel für ein <quote>A</quote> geben Sie <userinput>A</userinput> ein. Einige Tasten haben längere Namen, die Sie auch verwenden können. Für die Taste &Alt; geben Sie <userinput>Alt</userinput> ein.

source: Individual keystrokes should be separated by a colon (<userinput>:</userinput>). For instance, to type <quote>foo</quote>, enter <userinput>F:O:O</userinput>.
de: Einzelne Tastendrücke sollten durch einen Doppelpunkt (<userinput>:</userinput>) getrennt werden. Um zum Beispiel <quote>foo</quote> einzugeben, tragen Sie <userinput>F:O:O</userinput> ein.

source: Keys that need to pressed at the same time should be separated by a plus sign. For instance, to press <keycombo action="simul">&Ctrl;<keycap>C</keycap></keycombo>, enter <userinput>Ctrl+C</userinput>.
de: Tasten, die gleichzeitig gedrückt werden sollen, müssen durch ein Plus-Zeichen getrennt werden, Zum Beispiel für die Tastenkombination <keycombo action="simul">&Ctrl;<keycap>C</keycap></keycombo> geben Sie <userinput>Ctrl+C</userinput> ein.

source: Remember, you must enter keystrokes here exactly as you would on a keyboard. To capitalize letters, you must enter the &Shift; key. For instance, to type <quote>Hello</quote>, enter <userinput>Shift+H:E:L:L:O</userinput>.
de: Denken Sie daran, dass Sie hier die Tastendrücke genauso wie auf der Tastatur ausführen müssen, Um Buchstaben groß zu schreiben, müssen Sie die &Shift;-taste eingeben, Um zum Beispiel <quote>Hello</quote> einzutragen, geben Sie <userinput>Shift+H:E:L:L:O</userinput> ein.

source: This also applies to special characters. For instance, to type the at-sign on the U.S. English keyboard layout, enter <userinput>Shift+2</userinput>.
de: Dies betrifft auch Sonderzeichen. Um zum Beispiel das Zeichen <userinput>@</userinput> mit einem US-Amerikanischen Tastatur einzugeben, tragen Sie <userinput>Shift+2</userinput> ein.

source: The action that is performed is dependent on the currently selected keyboard layout. If you change keyboard layouts and trigger a shortcut, it may have undesired consequences.
de: Die ausgeführte Aktion hängt von der gerade ausgewählten Tastaturbelegung ab. Haben Sie Ihre Tastaturbelegung geändert und lösen einen Kurzbefehl aus, kann das ungewollte Effekte hervorrufen.

source: Beneath the keystroke entry text box, you may select which window the keystrokes will be directed to. You may choose from the following options:
de: Unter dem Texteingabefeld für die Tastendrücke, können Sie die Fenster für diese Tastatureingabe auswählen. Folgende Fensterarten stehen zur Auswahl:

source: <guilabel>Active window</guilabel> - The window that is currently open.
de: <guilabel>Aktives Fenster</guilabel> - Das gerade geöffnete Fenster.

source: <guilabel>Specific window</guilabel> - The window that you describe using the form below. For more information on describing windows, see <xref linkend="windows"/>.
de: <guilabel>Spezielles Fenster</guilabel> - Ein Fenster, das im Formular unten beschrieben wird. Weitere Informationen zu Beschreibung von Fenstern finden Sie im Abschnitt <xref linkend="windows"/>.

source: <guilabel>Action window</guilabel> - When using the Window Actions trigger type, enter the keystrokes in the window that triggered the shortcut.
de: <guilabel>Aktionsfenster</guilabel> - Wenn Sie den Auslösertyp Aktionsfenster benutzen, geben Sie die Tastendrücke im Fenster an, die den Kurzbefehl auslösen.

source: Modifying a Keyboard Input Action
de: Bearbeitung der Aktion für eine Tastatureingabe

source: The Action tab for keyboard input.
de: Die Karteikarte „Aktion“ für eine Tastatureingabe.

source: Modifying the keyboard input action for a shortcut.
de: Bearbeitung der Aktion für den Kurzbefehl einer Tastatureingabe.

source: Defining Windows
de: Fenster definieren

source: Several areas of the module allow you to define a list of windows. They all use the same interface, which contains the following options:
de: In mehreren Bereichen des Moduls können Sie Fensterlisten definieren. Dafür wird immer die gleiche Bedienungsoberfläche mit folgenden Einstellungen verwendet:

source: Comment
de: Kommentar

source: This is merely an informational text box you can use to explain what the trigger applies to or save other useful information. It is not actually used by the system for anything.
de: Dies ist ein Textfeld mit Informationen, die erläutern, auf was der Auslöser zutrifft oder sonstige nützliche Hinweise. Dieser Text wird vom System zurzeit nicht verwendet.

source: Window List
de: Fensterliste

source: Beneath the <guilabel>Comment</guilabel> box on the left is the list of all window definitions currently present in the trigger. Simply click on one to perform an operation on it.
de: Links unter dem Feld <guilabel>Kommentar</guilabel> wird eine Liste aller Fensterdefinitionen für diesen Auslöser angezeigt. Klicken Zu auf einen Eintrag in der Liste, um eine Operation damit auszuführen.

source: Edit...
de: Bearbeiten ...

source: Press this button to modify the currently selected window definition. A new window is opened that allows you to edit it. This window contains the following options:
de: Drücken Sie diesen Knopf, um die Definition des aktuell gewählten Fensters zu ändern, dazu wird ein neuer Dialog geöffnet. In diesem Dialog finden Sie folgende Einstellungen:

source: Window Data
de: Fensterdaten

source: This is where you describe the window the trigger should apply to.
de: Hier beschreiben Sie das Fenster, für das der Auslöser angewendet werden soll.

source: At the top, there is a <guilabel>Comment</guilabel> field, which is informational just like the one in the main <guilabel>Trigger</guilabel> tab.
de: Oben im Feld <guilabel>Kommentar</guilabel> können Sie eine Information eingeben, genau wie auf der Karteikarte <guilabel>Auslöser</guilabel>.

source: Three window characteristics are available:
de: Drei Fenstercharakteristiken stehen zur Auswahl:

source: <guilabel>Window title</guilabel> - The title that appears at the top of the window.
de: <guilabel>Fenstertitel</guilabel> - Der Titel der oben im Fenster angezeigt wird.

source: <guilabel>Window class</guilabel> - Usually the name of the application.
de: <guilabel>Fensterklasse</guilabel> - Normalerweise der Name des Programms.

source: <guilabel>Window role</guilabel> - Usually the name of the &Qt; class that makes up the window.
de: <guilabel>Rolle des Fensters</guilabel> -Normalerweise der Name der &Qt;-Klasse, des Fensters.

source: Each window characteristic provides a drop-down box, and a text box below it. Enter the value you wish to test windows for in the text box. From the drop-down box, select which kind of test you wish to apply. You can use <guilabel>Is</guilabel> to require an exact match, <guilabel>Contains</guilabel> to require that the text entered be somewhere inside the full value, or <guilabel>Matches Regular Expression</guilabel> to use a regular expression to define the match. You may also perform the inverse of all these operations. Select <guilabel>Is Not Important</guilabel> if you do not wish for that particular characteristic to be examined.
de: Für jede Art von Fenster gibt es ein Auswahlfeld und darunter ein Textfeld. Im Textfeld geben Sie den Wert für die Bedingung im Auswahlfeld ein. Verwenden Sie <guilabel>Ist gleich</guilabel> für eine genaue Übereinstimmung. Mit <guilabel>Enthält</guilabel> muss nur ein Teil des eingegebenen Textes im Wert vorhanden sein. Verwenden Sie <guilabel>Entspricht regulärem Ausdruck</guilabel> für reguläre Ausdrücke für die Übereinstimmung. Sie können auch das Gegenteil dieser Bedingungen benutzen. Bei <guilabel>Ist unwichtig</guilabel> wird die Art des Fensters nicht beachtet.

source: The easiest way to fill in this information is to open the desired window, then click the <guibutton>Autodetect</guibutton> button at the bottom of this section, and finally click on the desired trigger window. All three window characteristics will be populated with the information from that window, and you can then adjust the settings as necessary.
de: Am einfachsten ist es, das gewünschte Fenster zu öffnen, auf <guibutton>Automatisch feststellen</guibutton> zu klicken und dann Fenster für den Auslöser zu wählen. Alle drei Fenstercharakteristiken werden mit den Informationen diese Fenster ausgefüllt. Dann können Sie die Einstellungen nach Ihren Wünschen anpassen.

source: Window Types
de: Fenstertypen

source: This lets you restrict the match to a particular type of window. The following options are available:
de: Hier können Sie die Übereinstimmung auf einen bestimmten Fenstertyp begrenzen: Folgende Einstellungen sind möglich:

source: <guilabel>Normal</guilabel> - A regular application window.
de: <guilabel>Normal</guilabel> - Ein normales Programmfenster.

source: <guilabel>Desktop</guilabel> - The main desktop is actually a special window all its own.
de: <guilabel>Arbeitsfläche</guilabel> - Die Hauptarbeitsfläche ist ein besonderes eigenes Fenster.

source: <guilabel>Dialog</guilabel> - A small window that is part of a normal application, such as a message box or a configuration screen.
de: <guilabel>Dialog</guilabel> - Ein kleines Fenster, das Teil des normalen Programms ist, wie zum Beispiel ein Nachrichtenfenster oder ein Einrichtungsdialog.

source: <guilabel>Dock</guilabel> - A small window that can be attached or detached from a main application window.
de: <guilabel>Andockfenster</guilabel> - Ein kleines Fenster innerhalb oder losgelöst außerhalb des Hauptfensters der Anwendung.

source: New...
de: Neu ...

source: Create a new window definition. This opens the edit dialog described above.
de: Erstellt eine neue Fensterdefinition. Dies öffnet den vorher beschriebenen Bearbeitungsdialog.

source: Duplicate...
de: Duplizieren ...

source: This creates a new window definition with the exact same specifications as the currently selected window definition. It will open the edit dialog described above so you may make further changes.
de: Die erstellt eine neue Fensterdefinition mit den gleichen Einstellungen wie die ausgewählte Fensterdefinition. Dann wird der vorher beschriebene Bearbeitungsdialog für weitere Anpassungen und Änderungen geöffnet.

source: Delete
de: Löschen

source: Removes the currently selected window definition.
de: Entfernt die aktuell ausgewählte Fensterdefinition.

source: <title>Settings</title>
de: <title>Einstellungen</title>

source: When you first enter the module, or when you click the <guibutton>Settings</guibutton> button below the left pane, there will be several configuration options in the right pane:
de: Wenn Sie dieses Modul öffnen oder wenn Sie auf den Knopf <guibutton>Einstellungen</guibutton> unter dem linken Bereich, werden rechts mehrere Optionen angezeigt.

source: Start the Input Actions daemon on login
de: Dienst für Eingabeaktionen bei der Anmeldung starten

source: This configures whether or not to activate the background application that monitors for keyboard shortcuts and triggers configured actions. It is enabled by default.
de: Wählen Sie hier, ob das Hintergrund-Dienstprogramm für die Überwachung der Kurzbefehle und das Auslösen von Aktionen bei, der Anmeldung gestartet wird. Dies ist die Voreinstellung.

source: Gestures
de: Gesten

source: Select this check box to enable mouse gestures.
de: Wählen Sie dieses Ankreuzfeld, um Mausgesten zu aktivieren.

source: There are two options specific to mouse gestures:
de: Es gibt zwei Einstellungen speziell für Mausgesten:

source: Timeout
de: Zeitüberschreitung

source: This specifies the maximum time interval during which the mouse gesture will be monitored and recognized by the system, in milliseconds.
de: Bestimmt den maximalen Zeitraum in Millisekunden, in dem Mausgesten überwacht und vom System erkannt werden.

source: Mouse Button
de: Maustaste

source: This specifies the mouse button to be used for mouse gestures. Usually, <userinput>1</userinput> is the &LMB;, <userinput>2</userinput> is the &RMB;, and <userinput>3</userinput> is the middle or wheel button. If your mouse has more buttons, you can also use those instead.
de: Hier wird die Nummer der Maustaste für die Geste eingestellt. Normalerweise hat die &LMB; die Nummer <userinput>1</userinput>, die &RMB; die Nummer <userinput>2</userinput> und die &MMB; oder das Mausrad die Nummer <userinput>3</userinput>. Auch für Mäuse mit mehr als drei Tasten kann die Nummer eingestellt werden.

source: Button 1 is unavailable, so mouse gestures do not interfere with the normal operation of your system.
de: Taste 1, kann nicht eingestellt werden, damit Mausgesten nicht die normale Funktion der &LMBn; beeinträchtigen.

source: <screeninfo>Settings</screeninfo>
de: <screeninfo>Einstellungen</screeninfo>

source: The Settings screen.
de: Der Einstellungsdialog.

source: Editing Custom Shortcuts settings.
de: Bearbeitung der Einstellungen für eigene Kurzbefehle.

source: Credits and License
de: Danksagungen und Lizenz

source: Special thanks to Google Code-In 2011 participant Subhashish Pradhan for writing much of this article.
de: Besonderer Dank geht an den „Google Code-In 2011“-Teilnehmer Subhashish Pradhan,der den größten Teil dieses Artikels geschrieben hat.

source: CREDIT_FOR_TRANSLATORS
de: <para>Übersetzung Burkhard Lück<email>lueck@hube-lueck.de</email></para>
