Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kde-workspace/kcontrol_kcmaccess.po
Languages: de

source: Accessibility
de: Zugangshilfen

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Thomas</firstname><surname>Reitelbach</surname><affiliation><address><email>tr@erdfunkstelle.de</email></address></affiliation><contrib>Übersetzung</contrib></othercredit>

source: Systemsettings
de: Systemeinstellungen

source: accessibility
de: zugangshilfen

source: keys
de: Tasten

source: bell
de: Signalton

source: Introduction
de: Einleitung

source: This module is designed to help users who have difficulty hearing audible cues, or who have difficulty using a keyboard.
de: Dieses Modul soll Benutzern helfen, die Schwierigkeiten dabei haben, akustische Signale zu hören oder die Maus zu benutzen.

source: The module is divided into four tabs: <link linkend="access-bell"><guilabel>Bell</guilabel></link>, <link linkend="access-modifier-keys"><guilabel>Modifier keys</guilabel></link>, <link linkend="access-keyboard-filters"><guilabel>Keyboard Filters</guilabel></link> and <link linkend="access-activation-gestures"><guilabel>Activation Gestures</guilabel></link>.
de: Das Modul ist in vier Karteikarten aufgeteilt: <link linkend="access-bell"><guilabel>Signale</guilabel></link>, <link linkend="access-modifier-keys"><guilabel>Klebende Tasten</guilabel></link>, <link linkend="access-keyboard-filters"><guilabel>Verlangsamte Tasten</guilabel></link> und <link linkend="access-activation-gestures"><guilabel>Aktivierungsgesten</guilabel></link>.

source: Bell
de: Signale

source: This panel is divided into an <guilabel>Audible Bell</guilabel> section and a <guilabel>Visible Bell</guilabel> section.
de: Diese Karte ist aufgeteilt in die Abschnitte <guilabel>Hörbares Signal</guilabel> und <guilabel>Sichtbares Signal</guilabel>.

source: The top check box labeled <guilabel>Use System Bell</guilabel>, determines whether the normal System bell rings. If this option is disabled, the System bell will be silenced.
de: Das oberste Ankreuzfeld <guilabel>Signalton des Systems verwenden</guilabel> legt fest, ob der normale Signalton Ihres Systems benutzt werden soll. Falls die Option deaktiviert ist, ist der Signallautsprecher des Rechners stillgelegt.

source: The next check box down can be used to play a different sound whenever the system bell is triggered. To activate, place a mark in the check box labeled <guilabel>Use customized bell</guilabel>, and enter the complete pathname to the sound file in the text box labeled <guilabel>Sound to play</guilabel>. If you want, you can select the <guibutton>Browse</guibutton> button to navigate through your filesystem to find the exact file.
de: Mit dem nächsten Ankreuzfeld können Sie festlegen, dass ein beliebiger Klang abgespielt wird, wenn der Systemton ausgelöst wird. Um dies zu einzuschalten, aktivieren Sie das Ankreuzfeld <guilabel>Benutzerdefiniertes Signal verwenden</guilabel> und geben den kompletten Pfad zur gewünschten Klangdatei im Eingabefeld hinter dem Text <guilabel>Abzuspielender Klang</guilabel> ein. Mit dem Knopf <guibutton>Durchsuchen</guibutton> können Sie die gewünschte Datei in einem Dateiauswahldialog festlegen.

source: For those users who have difficulty hearing the System bell, or those users who have a silent computer, &kde; offers the <emphasis>visible bell</emphasis>. This provides a visual signal (inverting the screen or flashing a color across it) when the system bell would normally sound.
de: Für Benutzer, die Schwierigkeiten haben, den Signalton zu hören, oder die an einem Rechner ohne Sound-Unterstützung arbeiten, bietet &kde; die Möglichkeit an, stattdessen ein <emphasis>sichtbares Signal</emphasis> zu verwenden. Dieses kann entweder kurzzeitig die Farben des Bildschirms invertieren oder die Arbeitsfläche in einer wählbaren Farbe aufleuchten lassen, anstatt den Signalton auszugeben.

source: To use the visible bell, first place a mark in the check box labeled <guilabel>Use visible bell</guilabel>.
de: Um das sichtbare Signal zu benutzen, aktivieren Sie zuerst das Ankreuzfeld <guilabel>Sichtbares Signal verwenden</guilabel> an.

source: You can then select between <guilabel>Invert screen</guilabel>, or <guilabel>Flash screen</guilabel>. If you select <guilabel>Invert screen</guilabel>, all colors on the screen will be reversed. If you choose <guilabel>Flash screen</guilabel>, you can choose the color by clicking the button to the right of the <guilabel>Flash screen</guilabel> selection.
de: Sie können dann auswählen zwischen <guilabel>Bildschirm invertieren</guilabel>, oder <guilabel>Aufleuchten des Bildschirms</guilabel>. Wenn Sie <guilabel>Bildschirm invertieren</guilabel> wählen, werden alle Farben auf dem Bildschirm kurzzeitig invertiert. Wenn Sie <guilabel>Aufleuchten des Bildschirms</guilabel> wählen, können Sie die Farbe, in der der Bildschirm aufleuchten soll, mit dem daneben liegenden Knopf auswählen.

source: The slider bar can be used to adjust the duration of the visible bell. The default value is 500ms, or half a second.
de: Mit dem Schieberegler können Sie die Dauer des sichtbaren Signals verändern. Der Standardwert beträgt 500 msek, also eine halbe Sekunde.

source: Modifier keys
de: Klebende Tasten

source: There are the two sections <guilabel>Sticky Keys</guilabel> and <guilabel>Locking Keys</guilabel> to this panel.
de: Auf dieser Karte gibt es die Abschnitte <guilabel>„Klebende“ Tasten</guilabel> und <guilabel>Sperrtasten</guilabel>.

source: Use Sticky Keys
de: „Klebende“ Tasten verwenden

source: If this option is enabled, you can press and release the &Shift;, &Alt; or &Ctrl; keys, and then press another key to get a key combo (example: <keycombo action="simul">&Ctrl; &Alt; <keycap>Del</keycap></keycombo> could be done with &Ctrl; then &Alt; then <keycap>Del</keycap>).
de: Wenn diese Einstellung aktiviert ist, müssen Sie die Tasten &Shift;, &Alt; oder &Ctrl; nicht gedrückt halten, um zusammen mit einer anderen Taste eine Tastenkombination zu bilden. Sie können dann zuerst eine der Tasten drücken, wieder loslassen und dann die weiteren Tasten drücken. Beispiel: <keycombo action="simul">&Ctrl; &Alt; <keycap>Entf</keycap></keycombo> könnte erreicht werden durch &Ctrl; dann &Alt; dann <keycap>Entf</keycap>.

source: Also in this section is a check box labeled <guilabel>Lock Sticky Keys</guilabel>. If this check box is enabled, the &Alt;, &Ctrl; and &Shift; keys stay <quote>selected</quote> until you <quote>de-selected</quote> them.
de: In diesem Abschnitt gibt es noch ein Ankreuzfeld <guilabel>Klebende Tasten einrasten</guilabel>. Wenn dieses Feld markiert ist, bleiben die Tasten &Ctrl;, &Alt; und &Shift; so lange <quote>aktiv</quote>, bis sie vom Benutzer wieder <quote>freigegeben</quote> werden. Beachten Sie: Um eine klebende Taste einzurasten muss sie zweimal gedrückt werden.

source: As an example:
de: Zum Beispiel:

source: With <guilabel>Lock Sticky Keys</guilabel> disabled:
de: Mit nicht markiertem Feld <guilabel>Klebende Tasten einrasten</guilabel>:

source: If you press the &Shift; key then press the <keycap>F</keycap> key, the computer interprets this as <keycombo action="simul">&Shift;<keycap>F</keycap></keycombo>. Now if you type a <keycap>P</keycap>, the computer interprets this as the letter p (no shift).
de: Der Benutzer betätigt die Taste &Shift; und dann die Taste <keycap>F</keycap>. Daraus macht der Rechner <keycombo action="simul">&Shift;<keycap>F</keycap></keycombo>. Danach betätigt der Benutzer die Taste <keycap>P</keycap>. Der Rechner interpretiert das als Buchstabe p (ohne Umschalttaste).

source: With <guilabel>Lock Sticky Keys</guilabel> enabled:
de: Mit markiertem Feld <guilabel>Klebende Tasten einrasten</guilabel>:

source: If you press the &Shift; key <emphasis>twice</emphasis> then press the <keycap>F</keycap> key, the computer interprets this as <keycombo action="simul">&Shift;<keycap>F</keycap></keycombo>. Now if you type a <keycap>P</keycap>, the computer interprets this as the letter P (<keycombo action="simul">&Shift;<keycap>P</keycap></keycombo>). To de-select the &Shift; key, press it again.
de: Der Benutzer drückt zweimal &Shift; und dann <keycap>F</keycap>. Daraus macht der Rechner <keycombo action="simul">&Shift; <keycap>F</keycap></keycombo>. Danach drückt der Benutzer die Taste <keycap>P</keycap>. Der Rechner interpretiert das als Buchstabe P (<keycombo action="simul">&Shift; <keycap>P</keycap></keycombo>). Um die Umschalttaste wieder freizugeben, drücken Sie sie erneut.

source: Keyboard Filters
de: Verlangsamte Tasten

source: There are two sections to this panel.
de: Auf dieser Seite befinden sich zwei Abschnitte.

source: Use slow keys
de: Verlangsamte Tasten verwenden

source: If this option is enabled, you must hold the key down for a specified length of time (adjustable with the slider) before the keystroke will be accepted. This helps prevent accidental key strokes.
de: Wenn diese Einstellung aktiviert ist, müssen Sie eine Taste für eine bestimmte Zeitspanne gedrückt halten, bevor der Tastendruck akzeptiert wird. Die Zeitspanne kann mit dem Schieberegler an Ihre Bedürfnisse angepasst werden. Diese Funktion hilft Ihnen, unbeabsichtigtes Tastendrücken zu vermeiden.

source: Use bounce keys
de: Zurückschnellende Tasten verwenden

source: If this option is enabled, you must wait for a specified length of time (configurable with the slider) before the next key press can be accepted. This prevents accidental multiple key strokes.
de: Wenn diese Einstellung aktiviert ist, müssen Sie nach einem Tastendruck eine gewisse Zeit warten, damit der nächste Tastendruck akzeptiert wird. Die Zeitspanne kann mit dem Schieberegler an Ihre Bedürfnisse angepasst werden. Diese Funktion hilft, unbeabsichtigtes Tastendrücken bei Menschen zu vermeiden, die &eg; Zuckungen haben.

source: Activation Gestures
de: Aktivierungsgesten

source: <guilabel>Activation Gestures</guilabel> with these options:
de: Im Abschnitt <guilabel>Aktivierungsgesten</guilabel> gibt es diese Optionen:

source: Use gestures for activating sticky keys and slow keys
de: Gesten zur Aktivierung klebender und verlangsamter Tasten verwenden

source: Here you can activate keyboard gestures that turn on the following features:
de: Hier können Sie Tastaturgesten aktivieren, die folgende Funktionen einschalten:

source: Mouse Keys: Press &Shift;+NumLock
de: Maustasten: Drücken Sie &Shift; + Zahlen-Feststelltaste

source: Sticky keys: Press &Shift; key 5 consecutive times
de: Klebende Tasten: Drücken Sie fünfmal hintereinander die &Shift;taste

source: Slow keys: Hold down &Shift; for 8 seconds
de: Verlangsamte Tasten: Halten Sie die &Shift;taste für 8 Sekunden gedrückt

source: Turn sticky keys and slow keys off after a certain period of inactivity
de: Klebende und verlangsamte Tasten bei Inaktivität automatisch deaktivieren

source: <guilabel>Notification</guilabel> with these options:
de: Im Abschnitt <guilabel>Benachrichtigung</guilabel> gibt es diese Optionen:

source: Use the system bell whenever a gesture is used to turn an accessibility feature on or off
de: Signalton verwenden, wenn eine Aktivierungsgeste für die Zugangshilfen verwendet wurde

source: Show a confirmation dialog whenever a keyboard accessibility feature is turned on or off
de: Bestätigungsdialog anzeigen, wenn eine Geste angewendet wird

source: If this option is checked, &kde; will show a confirmation dialog whenever a keyboard accessibility feature is turned on or off.
de: Ist diese Einstellung aktiviert, zeigt &kde; einen Bestätigungsdialog an, sobald eine Geste angewendet wird.

source: Ensure you know what you are doing if you uncheck it, as the keyboard accessibility settings will then always be applied without confirmation.
de: Sie sollten wissen, was sie tun, wenn Sie diese Einstellung deaktivieren. In diesem Fall werden Einstellungen der Tastatur für Zugangshilfen ohne Rückfrage angewendet.

source: Use &kde;'s system notification mechanism whenever a keyboard accessibility feature is turned on or off
de: &kde;-Systemnachrichten verwenden, wenn eine Tastatur-Zugangshilfe aktiviert/deaktiviert wurde

source: Click the <guibutton>Configure Notifications</guibutton> button to open a dialog which allows you to edit the notifications for status changes of all keys.
de: Klicken Sie auf den Knopf <guibutton>Benachrichtigungen festlegen</guibutton>, um einen Dialog zur Bearbeitung von Benachrichtigungen über Statusänderungen aller Tasten zu öffnen.
