Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kde-workspace/kcontrol_khotkeys.po
Languages: de

source: <title>Custom Shortcuts</title>
de: <title>Eigene Kurzbefehle</title>

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Burkhard</firstname><surname>Lück</surname><affiliation><address><email>lueck@hube-lueck.de</email></address></affiliation><contrib>Übersetzung</contrib></othercredit>

source: Systemsettings
de: Systemeinstellungen

source: shortcuts
de: Kurzbefehle

source: hotkeys
de: Kurzbefehle

source: <keyword>Custom Shortcuts</keyword>
de: <keyword>Eigene Kurzbefehle</keyword>

source: Introduction
de: Einleitung

source: The <application>Custom Shortcuts</application> &systemsettings; module allows you to configure custom keyboard shortcuts and mouse gestures. You can use them to control applications, run specific commands, and more.
de: Im &systemsettings;-Modul <application>Eigene Kurzbefehle</application> können Sie benutzerdefinierte Kurzbefehle und Mausgesten einrichten. Damit können Sie Programme steuern, bestimmte Befehle ausführen und noch mehr.

source: Managing Shortcuts and Groups
de: Kurzbefehle und Gruppen verwalten

source: Adding Groups
de: Gruppen hinzufügen

source: The module allows to you to sort related shortcuts into Groups. For instance, if you have some shortcuts that relate to your music player, you could create a group for them called <replaceable>Music Player</replaceable>.
de: In diesem Modul können Sie zusammengehörende Kurzbefehle in Gruppen zusammenfassen. Haben Sie zum Beispiel einige Kurzbefehle, um die Wiedergabe von Musik zu steuern, können Sie dafür eine Gruppe <replaceable>Musik-Wiedergabe</replaceable> erstellen.

source: To add a new group, click on the <guibutton>Edit</guibutton> button below the left pane and select the <guimenuitem>New Group</guimenuitem> option.
de: Um eine neue Gruppe hinzuzufügen, klicken Sie auf den Knopf <guibutton>Bearbeiten</guibutton> unter dem linken Bereich und wählen <guimenuitem>Neue Gruppe</guimenuitem>.

source: Adding Shortcuts
de: Kurzbefehle hinzufügen

source: To add a new shortcut, click on the <guibutton>Edit</guibutton> button below the left pane and select the <guisubmenu>New</guisubmenu> option.
de: Um eine neuen Kurzbefehl hinzuzufügen, klicken Sie auf den Knopf <guibutton>Bearbeiten</guibutton> unter dem linken Bereich und wählen <guimenuitem>Neu</guimenuitem>.

source: The first menu that appears allows you to select the type of trigger. The following options are available:
de: Damit öffnen Sie ein Untermenü mit verschiedenen Auslösern. Folgende Einstellungen sind verfügbar:

source: Global Shortcut
de: Globaler Kurzbefehl

source: These are standard keyboard shortcuts that will be recognized anywhere, as long as a &kde; &plasma; Workspace is running.
de: Dies sind die Standard-Kurzbefehle, die Sie immer in dem &kde;-&plasma;-Arbeitsbereich verwenden können.

source: <guisubmenu>Window Action</guisubmenu>
de: <guisubmenu>Fensteraktion</guisubmenu>

source: Window Actions are triggers that occur when something happens to a particular window, like when it appears, gains focus, or is closed.
de: Fensteraktionen werden ausgelöst, wenn sich der Zustand eines bestimmten Fenster ändert, zum Beispiel wenn es angezeigt wird, es den Fokus erhält oder wenn es geschlossen wird.

source: Mouse Gesture Action
de: Mausgesten-Aktion

source: A mouse gesture action is triggered when a particular movement of the mouse (or touchpad or touchscreen) is performed.
de: Eine Mausgesten-Aktion wird ausgelöst, wenn eine bestimmte Bewegung mit der Maus, dem Touchpad oder dem Touchscreen ausgeführt wird.

source: Once you've selected the type of trigger, another submenu appears that allows you to select an action type. The following types are available:
de: Haben Sie den Typ der Auslösung gewählt, wird ein weiteres Untermenü mit Aktionstypen angezeigt. Folgende Aktionen stehen zur Auswahl:

source: <guimenuitem>Command/&URL;</guimenuitem>
de: <guimenuitem>Befehl/Adresse</guimenuitem>

source: This action will launch a command or open a &URL; when the shortcut is triggered.
de: Diese Aktion führt einen Befehl aus oder öffnet eine Adresse, wenn der zugehörige Kurzbefehl ausgelöst wird.

source: <guimenuitem>&DBus; Command</guimenuitem>
de: <guimenuitem>&DBus;-Aufruf</guimenuitem>

source: This action will call a &DBus; method in a running application or system daemon. For more information on &DBus;, see the <ulink url="http://techbase.kde.org/Development/Tutorials/D-Bus/Introduction">&DBus; Introduction on &kde; TechBase</ulink>.
de: Diese Aktion startet einen &DBus;-Aufruf für ein laufendes Programm oder einen Systemdienst. Weitere Informationen über &DBus; finden Sie auf der Seite <ulink url="http://techbase.kde.org/Development/Tutorials/D-Bus/Introduction">Einführung zu &DBus;</ulink> auf der &kde;-Techbase..

source: <guimenuitem>Send Keyboard Input</guimenuitem>
de: <guimenuitem>Tastatureingabe senden</guimenuitem>

source: This action will send keyboard input to the currently running application, just as if you had typed it in yourself.
de: Diese Aktion sendet eine Tastatureingabe an das gerade laufende Programm, als wenn Sie dies direkt im Programm eingeben würden.

source: Once you've selected the action type, you can then edit the shortcut to your liking. See <xref linkend="shortcuts"/> for more information.
de: Wenn Sie einen Aktionstyp ausgewählt haben, können Sie den Kurzbefehl nach Ihren Wünschen einstellen. Weitere Informationen finden Sie unter <xref linkend="shortcuts"/>.

source: Deleting Shortcuts and Groups
de: Kurzbefehle und Gruppen löschen

source: To delete a shortcut or group, select it, then click on the <guibutton>Edit</guibutton> button below the left pane, and select the <guimenuitem>Delete</guimenuitem> option.
de: Um eine Kurzbefehl oder eine Gruppe zu löschen, wählen Sie sie aus und klicken Sie auf den Knopf <guibutton>Bearbeiten</guibutton> unter dem linken Bereich und wählen <guimenuitem>Neu</guimenuitem>. Wählen Sie dann <guimenuitem>Löschen</guimenuitem>.

source: Exporting Groups
de: Gruppen exportieren

source: You can export a group, so you can save the shortcuts contained within and use them on another computer or maintain a backup.
de: Sie können die Einstellungen für eine Gruppe exportieren. Damit speichern Sie die darin definierten Kurzbefehle, um sie auf einem anderen Rechner zu benutzen oder erstellen eine Sicherung der Einstellungen.

source: To export a group, select the group to be exported, then click on the <guibutton>Edit</guibutton> button below the left pane and select the <guimenuitem>Export Group...</guimenuitem> option, which opens a new window that lets you define some options about the exported group. The following options are available:
de: Um eine Gruppe zu exportieren, wählen Sie diese Gruppe und klicken Sie dann auf den Knopf <guibutton>Bearbeiten</guibutton> unter der linken Fensterbereich und wählen Sie dann die Einstellung <guimenuitem>Gruppe exportieren ...</guimenuitem>. Damit wird ein neues Fenster geöffnet, in dem Einstellungen für den Export der Gruppe vorgenommen werden können. Folgende Einstellungen sind möglich:

source: Export Actions
de: Aktionen exportieren

source: This allows you to select the state the shortcuts will be in when they are imported later. Select <guilabel>Actual State</guilabel> to maintain their current state, <guilabel>Enabled</guilabel> to ensure they are all enabled, or <guilabel>Disabled</guilabel> to ensure they are all disabled.
de: Hier können Sie einstellen, welchen Status haben sollen, wenn Sie später importiert werden. Wählen Sie <guilabel>Aktueller Status</guilabel> für den gerade vorhandenen Zustand und <guilabel>Aktiviert</guilabel>/<guilabel>Deaktiviert</guilabel>, um einzustellen, das die Kurzbefehle beim Import diesen Status haben.

source: Here you may enter text to identify the group. If the group is included by default, this text may be filled in by default.
de: Geben Sie hier Text zur Identifizierung der Gruppe ein. Ist diese Gruppe standardmäßig bereits enthalten, ist dieser Text meistens bereits ausgefüllt.

source: Allow Merging
de: Zusammenführung zulassen

source: This defines what happens if the group already exists on the system the exported group is imported to. When enabled, any new actions will be added to the group on the target system, while actions that have the same name but a different configuration will updated with the configuration from the imported file. When disabled, the module will refuse to import the file.
de: Diese Einstellung bestimmt, was beim Import einer Gruppe passiert, die bereits auf dem System vorhanden ist. Ist die Einstellung aktiviert, wird jede neue Aktion zur Gruppe des Zielsystems hinzugefügt. Aber Aktionen mit dem gleichen Namen, aber anderen Einstellungen, werden mit der Einstellung der importierten Aktion aktualisiert. Ist diese Einstellung deaktiviert, verweigert das Modul den Import der Datei.

source: Filename
de: Dateiname

source: Here you may enter the filename you wish to export the shortcut to. You may also select the <guibutton>Browse</guibutton> button to the right of the text box to open the File dialog and select a file from there.
de: Geben Sie einen Namen für die exportierte Datei mit den Kurzbefehlen ein. Sie können auch den Knopf <guibutton>Dateiauswahl</guibutton> rechts neben dem Eingabefeld verwenden, um eine Datei im Dialog auszuwählen.

source: Exported files use the extension <literal>.khotkeys</literal> by default.
de: Exportierte Dateien haben die Erweiterung <literal>.khotkeys</literal> als Voreinstellung.

source: Exporting a Group
de: Eine Gruppe exportieren

source: The Export Group dialog.
de: Der Dialog „Gruppe exportieren“.

source: Exporting a group of shortcuts.
de: Export einer Gruppe von Kurzbefehlen.

source: Importing Groups
de: Gruppen importieren

source: To import a group, click the <guibutton>Edit</guibutton> button below the left pane and select <guilabel>Import...</guilabel>. A file selection dialog opens that permits you to locate a file previously created using the Export function.
de: Um eine Gruppe importieren, klicken Sie auf <guibutton>Bearbeiten</guibutton> unter den linken Bereich und wählen <guilabel>Importieren ...</guilabel>. Ein Dateiauswahldialog ermöglicht die Wahl einer vorher exportierten Datei mit Kurzbefehlen.

source: Modifying Groups
de: Gruppen bearbeiten

source: In the left section of the window, the default shortcuts are categorized into groups. These groups can be expanded by clicking the arrow beside them to reveal the shortcuts.
de: Im linken Bereich des Fensters sind die Kurzbefehle in Gruppen angeordnet. Diese Gruppen lassen sich durch Klicken auf den Pfeil neben dem Namen ausklappen, sodass die darin enthaltenen Kurzbefehle angezeigt werden.

source: When you click on a group, you are presented with two tabs to configure the group itself. The <guilabel>Comment</guilabel> allows you to store notes about the group, and are not actually used by the system for anything. The <guilabel>Conditions</guilabel> tab allows you to restrict which windows a group of shortcuts works with.
de: Wenn Sie auf eine Gruppe klicken, werden rechts zwei Karteikarten für Einstellungen der Gruppe angezeigt. Auf der Karteikarte <guilabel>Kommentar</guilabel> können Sie Notizen über die Gruppe eintragen, sie werden von System zurzeit nicht weiter verwendet. Auf der Karteikarte <guilabel>Bedingungen</guilabel> können Sie eingrenzen, welche Fenster auf die Kurzbefehle dieser Gruppe reagieren.

source: <screeninfo>The Comment Tab</screeninfo>
de: <screeninfo>Die Karteikarte „Kommentar“</screeninfo>

source: The Comment tab in a group.
de: Die Karteikarte „Kommentar“ in einer Gruppe.

source: Modifying a group's comment.
de: Bearbeitung des Kommentars zu einer Gruppe.

source: Conditions are displayed in a tree, the top level of which is <guilabel>And</guilabel>. All conditions beneath <guilabel>And</guilabel> must be satisfied for shortcuts in the group to be triggered.
de: Bedingungen werden als Baumansicht dargestellt, dessen oberstes Element <guilabel>Und</guilabel> ist. Alle Bedingungen unterhalb <guilabel>Und</guilabel> müssen erfüllt sein, damit die Kurzbefehle der Gruppe Aktionen auslösen.

source: You may add additional groups of conditions by clicking the <guibutton>New</guibutton> drop down box to the right of the tree of conditions. Types of groups include the aforementioned <guimenuitem>And</guimenuitem>, <guimenuitem>Or</guimenuitem>, in which only one member of the group must be satisfied, or <guimenuitem>Not</guimenuitem>, in which the inverse of all members will trigger the shortcuts in the group.
de: Sie können weitere Gruppen von Bedingungen hinzufügen, indem Sie auf das Auswahlfeld <guibutton>Neu</guibutton> rechts neben der Baumansichten der Bedingungen klicken. Beim bereits vorher genannten <guimenuitem>Und</guimenuitem> bzw. <guimenuitem>Oder</guimenuitem> muss die Bedingung nur für ein Mitglied der Gruppe zutreffen. Mit der Bedingung <guimenuitem>Nicht</guimenuitem> löst der Kurzbefehl nur für die Nicht-Mitglieder der Gruppe eine Aktion aus.

source: To add a window definition to the list, press the <guibutton>New</guibutton> button. You may select <guimenuitem>Active Window...</guimenuitem> if you want the shortcut to be triggered only if the specified window currently has focus, or you may select <guimenuitem>Existing Window...</guimenuitem> if you want the shortcut to be triggered as long as that window is open , regardless of whether or not you are using it. Selecting either of these options opens a window where you can edit the window definitions.
de: Um eine Fensterdefinition zur Bedingungsliste hinzufügen, klicken Sie ebenfalls auf <guibutton>Neu</guibutton>. Wählen Sie <guimenuitem>Aktives Fenster ...</guimenuitem>, wenn der Kurzbefehl eine Aktion auslösen soll, das angegebene Fenster den Fokus hat und <guimenuitem>Bestehendes Fenster ...</guimenuitem>, wenn der Kurzbefehl eine Aktion auslösen soll, solange das Fenster geöffnet ist, unabhängig davon, ob es den Fokus hat. Die Wahl beider Optionen öffnet ein Fenster, in dem Sie die Fensterdefinitionen bearbeiten können.

source: Click the <guibutton>Edit...</guibutton> button to edit an existing set of window definitions. A window opens with the window definition editor. For more information, see <xref linkend="windows"/>.
de: Klicken Sie auf den Knopf <guibutton>Bearbeiten ...</guibutton>, um einen vorhandenen Satz von Fensterdefinitionen zu ändern, damit öffnen Sie den Editor für Fensterdaten, siehe <xref linkend="windows"/>.

source: To remove a window definition from the conditions list, click the <guibutton>Delete</guibutton> button.
de: Um eine Fensterdefinition aus der Bedingungsliste zu entfernen, drücken Sie den Knopf <guibutton>Löschen</guibutton>.

source: Modifying Shortcuts
de: Kurzbefehle bearbeiten

source: The <guilabel>Preset Actions</guilabel> group, when expanded, reveals a shortcut configuration named <guilabel>PrintScreen</guilabel> which, when selected, reveals section on the right side, with three tabs:
de: Die Gruppe <guilabel>Voreingestellte Aktionen</guilabel> enthält einen Kurzbefehl <guilabel>Bildschirm drucken</guilabel>. Wählen Sie ihn aus, werden rechts drei Karteikarten gezeigt:

source: <title>The Comment Tab</title>
de: <title>Die Karteikarte „Kommentar“</title>

source: The <guilabel>Comment</guilabel> tab allows you to describe how to use the shortcut, what it does, or anything else you might want to include.
de: Auf der Karteikarte <guilabel>Kommentar</guilabel> können Sie eintragen, wie der Kurzbefehl verwendet wird, welche Aktion er auslöst und beliebige zusätzliche Informationen.

source: The Trigger Tab
de: Die Karteikarte „Auslöser“

source: The <guilabel>Trigger</guilabel> tab contains the trigger configuration, which depends on the type of trigger specified:
de: Die Karteikarte <guilabel>Auslöser</guilabel> enthält die Einstellungen, die von dem Typ des gewählten Auslösers abhängen;

source: Global (Keyboard) Shortcut
de: Globale Tastatur-Kurzbefehle

source: To modify a keyboard shortcut, click on the button that contains a wrench, and then enter the desired keyboard shortcut. To erase the shortcut, click on the button with the <inlinemediaobject><imageobject><imagedata fileref="oxygen-22x22-edit-clear-locationbar-rtl.png" format="PNG"/></imageobject></inlinemediaobject> icon to the right of the change shortcut button.
de: Um einen Kurzbefehl zu ändern, klicken Sie auf den Knopf mit dem Werkzeugsymbol und drücken dann die gewünschten Tasten oder Tastenkombination. Um einen Kurzbefehl zu löschen, klicken Sie auf den Knopf mit dem Symbol <inlinemediaobject><imageobject><imagedata fileref="oxygen-22x22-edit-clear-locationbar-rtl.png" format="PNG"/></imageobject></inlinemediaobject> rechts vom Kurzbefehl.

source: Modifying a Keyboard Trigger
de: Bearbeitung eines Tastatur-Auslösers

source: The Trigger tab for a keyboard shortcut.
de: Die Karteikarte „Auslöser“ für einen Kurzbefehl.

source: Modifying a trigger for a keyboard shortcut.
de: Bearbeitung des Auslösers für einen Tastatur-Kurzbefehl.

source: <term>Window Action</term>
de: <term>Fensteraktion</term>

source: Window actions contain several options:
de: Für Fensteraktionen gibt es mehrere Einstellungen:

source: Trigger When
de: Auslösen, sobald

source: This configures the particular window action that must occur for the shortcut to be triggered. The following options are available:
de: Dies legt die Fensteraktion fest, bei der der Kurzbefehl eine Aktion auslöst. Folgende Einstellungen sind möglich:

source: <guilabel>Window appears</guilabel> - Triggered when a window is opened.
de: <guilabel>Fenster erscheint</guilabel> - Ausgelöst, wenn ein Fenster geöffnet wird.

source: <guilabel>Window disappears</guilabel> - Triggered when a window is closed.
de: <guilabel>Fenster verschwindet</guilabel> - Ausgelöst, wenn ein Fenster geschlossen wird.

source: <guilabel>Window gets focus</guilabel> - Triggered when you switch to a window.
de: <guilabel>Fenster erhält den Fokus</guilabel> - Ausgelöst, wenn zu einem Fenster gewechselt wird.

source: <guilabel>Window loses focus</guilabel> - Triggered when you switch away from a window.
de: <guilabel>Fenster verliert den Fokus</guilabel> - Ausgelöst, wenn ein Fenster verlassen wird.

source: Window
de: Fenster

source: This is where you define the actual window or windows the trigger applies to. For more information, see <xref linkend="windows"/>
de: Hier geben Sie das aktuelle Fenster oder die Fester an, für die der Auslöser angewendet werden soll. Für weitere Informationen siehe <xref linkend="windows"/>.

source: Mouse Gesture
de: Mausgesten

source: A mouse gesture can be changed by clicking the <guibutton>Edit</guibutton> button below the area that displays the mouse gesture, which will open a window. Hold down the &LMB; and draw the desired mouse gesture in the area provided. The gesture will be saved when you release the &LMB;.
de: Eine Mausgeste kann durch Klicken auf den Knopf <guibutton>Bearbeiten</guibutton> unter dem Bereich mit der angezeigten Mausgeste geändert werden. Dann öffnet sich ein Fenster. Halten Sie die &LMB; gedrückt und zeichnen Sie die gewünschte Mausgeste in den dafür vorgesehenen Bereich. Die Geste wird gespeichert, wenn Sie die &LMB; loslassen.

source: Modifying a Mouse Gesture Trigger
de: Bearbeitung des Auslösers für eine Mausgeste

source: The Trigger tab for a mouse gesture shortcut.
de: Die Karteikarte „Auslöser“ für einen Mausgesten-Kurzbefehl.

source: Modifying a trigger for a mouse gesture.
de: Bearbeitung des Auslösers für eine Mausgeste.

source: The Action Tab
de: Die Karteikarte „Aktion“

source: The <guilabel>Action</guilabel> tab is where you configure the action that will be performed when the shortcut is triggered. There are several types of actions that have different configuration options:
de: Auf der Karteikarte <guilabel>Aktion</guilabel> richten Sie die Aktion ein, die beim Auslösen des Kurzbefehls durchgeführt wird. Es gibt mehrere Arten von Aktionen mit verschiedenen Einstellungen:

source: <term>Command/&URL;</term>
de: <term>Befehl/Adresse</term>

source: When using a Command or &URL; is a trigger, a text box is provided where you may enter the command to run or &URL; to open when the shortcut is triggered. You may also click the <guibutton>Browse</guibutton> button to the right of the text box to open a file selection dialog in which you can select a file on your local or a remote system.
de: Wird ein Befehl oder eine &URL; als Auslöser verwendet, kann in einem Textfeld der auszuführende Befehl oder die geöffnete &URL; eingegeben werden, die die Aktion auslösen. Mit dem Knopf rechts neben dem Textfeld können Sie im Dateidialog eine lokale Datei oder eine Datei auf einem anderen Rechner öffnen.

source: Modifying a Command Action
de: Bearbeitung einer Befehls-Aktion

source: The Action tab for a command.
de: Die Karteikarte „Aktion“ für einen Befehl.

source: Modifying a command action.
de: Bearbeitung einer Befehls-Aktion.

source: <term>&DBus; Command</term>
de: <term>&DBus;-Aufruf</term>

source: The following options are provided that allow you to specify a &DBus; method to be performed:
de: Die folgenden Einstellungen sind vorhanden, mit denen Sie eine auszuführende &DBus;-Funktion bestimmen können:

source: Remote application
de: Programm auf Fremdrechner

source: The service name of the remote application the method is to be performed on, for instance <userinput>org.kde.kate</userinput> if you wanted to perform it on the &kate; Advanced Text Editor.
de: Der Dienstname des Programms auf dem anderen Rechner, für das die Funktion ausgeführt werden soll, zum Beispiel <userinput>org.kde.kate</userinput> für &kate; den erweiterten Texteditor.

source: Remote object
de: Objekt auf Fremdrechner

source: The path to the remote object the method is to be performed on, for instance <userinput>/Document/1</userinput>, if you wanted to perform it on the first document opened in &kate;.
de: Der Pfad zum Objekt auf dem anderen Rechner, das die Funktion ausführen soll, zum Beispiel <userinput>/Document/1</userinput> für das erste in &kate; geöffnete Dokument.

source: Function
de: Funktion

source: The name of the &DBus; method to be called, for instance <userinput>print</userinput> if you wanted to print the document.
de: Der Name der aufzurufenden &DBus;-Methode, zum Beispiel <userinput>print</userinput>, wenn Sie ein Dokument drucken möchten.

source: For more information on &DBus;, see the <ulink url="http://techbase.kde.org/Development/Tutorials/D-Bus/Introduction">&DBus; Introduction on &kde; TechBase</ulink>.
de: Weitere Informationen über &DBus; finden Sie auf der Seite <ulink url="http://techbase.kde.org/Development/Tutorials/D-Bus/Introduction">Einführung zu &DBus;</ulink> auf der &kde;-Techbase.

source: <term>Send Keyboard Input</term>
de: <term>Tastatureingabe senden</term>

source: At the top of the <guilabel>Action</guilabel> tab, there is a large text entry where you may enter the keystrokes you wish to be sent when the shortcut is triggered.
de: Oben auf der Karteikarte <guilabel>Aktion</guilabel> gibt es einen großen Texteingabebereich, wo Sie die Tastendrücke eingeben können, die beim Auslösen durch den Kurzbefehl gesendet werden.
