Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kde-workspace/kcontrol_desktopthemedetails.po
Languages: de

source: Desktop Theme
de: Arbeitsflächen-Design

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Johannes</firstname><surname>Obermayr</surname><affiliation><address><email>johannesobermayr@gmx.de</email></address></affiliation><contrib>Übersetzung</contrib></othercredit>

source: System Settings
de: Systemeinstellungen

source: desktop
de: Arbeitsfläche

source: theme
de: Design

source: Theme tab
de: Die Karteikarte Design

source: A list of available themes is displayed on this tab. Select a theme by clicking on an item in the list.
de: Auf dieser Karteikarte wird eine Liste der verfügbaren Designs angezeigt. Ein Design kann durch Klicken auf ein Element in der Liste ausgewählt werden.

source: Use the <guibutton>Get New Themes</guibutton> button to launch the <guilabel>Get Hot New Stuff</guilabel> dialog and download additional themes from the Internet.
de: Mit dem Knopf <guibutton>Neue Designs holen ...</guibutton> wird der Dialog <guilabel>Neue Erweiterungen</guilabel> gestartet, hier können weitere Designs aus dem Internet heruntergeladen werden.

source: Details tab
de: Die Karteikarte Details

source: A &kde; plasma desktop theme is made up of several components or items, consisting mostly in svg backgrounds and colors schemes. This module allows you to customize your desktop Plasma theme and to replace theme items with items from other themes or from files.
de: Ein Plasma-Design für die &kde;-Arbeitsfläche besteht aus mehreren Komponenten bzw. Elementen, wie zum Beispiel einem SVG-Hintergrund und einem Farbschema. Dieses Einstellungsmodul ermöglicht die benutzerdefinierte Gestaltung des Plasma-Designs der Arbeitsfläche und das Ersetzen von Bestandteilen des Designs mit Elementen von anderen Designs oder Dateien.

source: Desktop theme items consist in panel theme item, kickoff theme item, analog clock, ...
de: Ein Arbeitsflächen-Design besteht aus einzelnen Elementen für Kontrollleiste, Programmstarter, Uhr usw.

source: If you want to change your current theme for a full new theme (for example from Air to Glassified) then you can do so in the <guilabel>Theme</guilabel> tab.
de: Möchten Sie Ihr aktuelles Design komplett umstellen (zum Beispiel von Air auf Glassified), öffnen Sie dazu die Karteikarte <guilabel>Design</guilabel>.

source: Quick start
de: Kurzeinführung

source: First download one or several themes you want to use to customize your desktop items by clicking the <guibutton>Get New Themes...</guibutton> button in the <guilabel>Theme</guilabel> tab.
de: Laden Sie zuerst ein oder mehrere Designs, die zur Anpassung der Arbeitsfläche verwendet werden sollen, indem Sie auf den Kopf <guibutton>Neue Designs holen ...</guibutton> auf der Karteikarte <guilabel>Design</guilabel> klicken.

source: All the available themes will be displayed on top, the current one being highlighted.
de: Alle vorhandenen Designs werden dann angezeigt, das aktuell verwendete ist hervorgehoben.

source: In the theme list, select a base theme that will be used for most widgets and start customizing each item you want to change with a new theme, for example you can have the panel in Glassified theme, the widget backgrounds in Air and so on.
de: Wählen Sie in der Liste ein Design als Grundlage für Ihre Änderungen. Wählen Sie dann für jedes Element, das sie anpassen möchten, ein neues Design, zum Beispiel für die Kontrollleiste das Design „Glassified“, für den Fensterelement-Hintergrund „Air“ &etc;

source: Here Air is the theme for most widgets and we changed the panel background to Glassified, the Analog clock to Glassified and the Notes to Oxygen.
de: Hier wird „Air“ als Design für die meisten Elemente benutzt und der Hintergrund der Kontrollleiste in „Glassified“, die Analoge Uhr auch in „Glassified“ und Notizen in „Oxygen“ geändert.

source: <screeninfo>Customizing your plasma theme</screeninfo>
de: <screeninfo>Plasma-Design anpassen</screeninfo>

source: <phrase>Customizing your plasma theme</phrase>
de: <phrase>Plasma-Design anpassen</phrase>

source: Clicking the <guibutton>Apply</guibutton> will create a new theme named <guilabel>(Customized)</guilabel> and will apply it to your desktop.
de: Nach Abschluss der Änderungen klicken Sie auf <guibutton>Anwenden</guibutton>. Dadurch wird ein neues Design mit dem Namen <guilabel>(Benutzerdefiniert)</guilabel> erstellt, welches dann für Ihre Arbeitsfläche benutzt wird.

source: Creating a custom theme
de: Ein benutzerdefiniertes Design erstellen

source: When the module is opened, it will show items from the current desktop theme. If you would like to start customizing with a different theme, select it from the box above the list of theme items. This theme from the box is the starting theme, the base for your new customized desktop theme.
de: Beim Öffnen dieses Einstellungsmoduls werden die Einträge des aktuellen Designs für die Arbeitsfläche angezeigt. Möchten Sie ein anderes Design als Grundlage für die Anpassung benutzen, wählen Sie es aus dem Auswahlfeld über der angezeigten Liste der Designelemente. Dieses Design wird als Basis des neuen benutzerdefinierten Designs verwendet.

source: In the list of items, for each item you would like to replace, select replacement item from the drop list for that item. You may select the corresponding item from another theme, or you may select a file. &plasma; desktop theme items are svg files, except for the color scheme which is a &kde; color scheme file.
de: In der Liste der Designelemente kann für jedes Element, das geändert werden soll, aus dem Auswahlfeld rechts eine anderes Element als Ersatz gewählt werden. Dafür steht ein entsprechendes Element aus einem anderen Design oder eine Datei als Auswahl zur Verfügung. Die Elemente der &plasma;-Arbeitsflächendesigns bestehen aus SVG-Dateien, nur beim Farbschema handelt es sich um eine &kde;-Farbschemadatei.

source: Click <guibutton>Apply</guibutton> when all the changes have been made. This will create a new theme named <guilabel>(Customized)</guilabel> which you can select from the Appearance Settings dialog on the desktop.
de: Nach Abschluss der Änderungen klicken Sie auf <guibutton>Anwenden</guibutton>. Dadurch wird ein neues Design mit dem Namen <guilabel>(Benutzerdefiniert)</guilabel> erstellt, welches dann über die <guilabel>Arbeitsflächen-Einstellungen</guilabel> auf der Plasma-Arbeitsfläche ausgewählt werden kann.

source: Your custom theme
de: Ihr benutzerdefiniertes Design

source: Customized
de: Benutzerdefiniert

source: The theme items listed are the most visible components of the plasma desktop theme. Other theme components are not listed. Your newly created theme will use these unlisted components from the theme that you selected at the start of creating the customized theme.
de: Die angezeigten Elemente des Designs sind die meist gesehenen Elemente des Plasma-Arbeitsflächen-Designs. Die anderen Elemente der Designs werden nicht aufgeführt. Das neu erstellte Design wird deshalb für die nicht aufgeführten Elemente die entsprechenden Elemente des <emphasis>Ausgangs</emphasis>-Designs verwenden.

source: Naming a custom theme
de: Benutzerdefiniertes Design benennen

source: To provide a name for your customized theme, click on the <guilabel>More</guilabel> checkbox and enter the name of the theme. You may also provide your name (author), a theme version and a description of your theme. Click <guibutton>Apply</guibutton> when done.
de: Ein Name für das geänderte Design kann durch Klicken auf <guilabel>Mehr</guilabel> und Eingabe des Namens in das entsprechende Feld festgelegt werden. Zudem können hier der <guilabel>Autor</guilabel>, die <guilabel>Version</guilabel> und eine <guilabel>Beschreibung</guilabel> eingegeben werden. Nach Abschluss muss lediglich auf <guibutton>Anwenden</guibutton> geklickt werden.

source: Removing a theme
de: Design entfernen

source: Select the theme you would like to remove from the box above the list of theme items. Click on the <guilabel>More</guilabel> check box. Click the <guibutton>Remove Theme</guibutton> button to remove the selected theme.
de: Das zu entfernende Design muss aus dem Auswahlfeld über der Liste der Designelemente ausgewählt werden. Danach kann es über <menuchoice><guimenu>Mehr</guimenu><guimenuitem>Design entfernen</guimenuitem></menuchoice> gelöscht werden.

source: Exporting a theme to a file
de: Design in eine Datei exportieren

source: You can share your newly customized theme with the community by exporting the theme to a file. Select your customized theme from the box above the list of theme items. Click on the <guilabel>More</guilabel> check box. Click the <guibutton>Export Theme to File...</guibutton>. Enter the name of the zip file to which the theme will be saved.
de: Das neu erstellte Design kann mit anderen geteilt werden, indem es zu einer Datei exportiert wird. Dazu muss das Design zunächst aus dem Auswahlfeld über der Liste der Designelemente ausgewählt werden. Über <menuchoice><guimenu>Mehr</guimenu><guimenuitem>Design exportieren ...</guimenuitem></menuchoice> und anschließender Eingabe des Namens für eine <filename>.zip</filename>-Datei wird es unter diesem Namen gespeichert.
