Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kde-workspace/kcontrol_keys.po
Languages: de

source: Shortcuts
de: Kurzbefehle

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Jürgen</firstname><surname>Nagel</surname><affiliation><address><email>JuergenNagel@web.de</email></address></affiliation><contrib>Übersetzung</contrib></othercredit>

source: KControl
de: Systemeinstellungen

source: key bindings
de: Tastenzuordnung

source: bindings
de: Zuordnung

source: shortcuts
de: Kurzbefehle

source: Introduction
de: Einführung

source: While most of the functionality offered by &kde; can be accessed using a simple <quote>point and click</quote> interface, many people prefer using the keyboard for some tasks. Pressing something like <keycombo action="simul"> &Ctrl;<keycap>F</keycap></keycombo> is often just faster than moving your hands off the keyboard to the mouse, opening the <guimenu>Edit</guimenu> menu and selecting <guimenuitem>Find</guimenuitem>.
de: Obwohl die meisten von &kde; bereitgestellten Funktionen, mit der Maus zugänglich sind, ziehen es viele Benutzer vor, für manche Aufgaben die Tastatur zu benutzen: eine Tastenkombination wie <keycombo action="simul"><keycap>&Ctrl;</keycap><keycap>F</keycap></keycombo> zu benutzen, ist oft schneller als die Hände von der Tastatur zur Maus zu bewegen, das Menü <guimenu>Bearbeiten</guimenu> zu öffnen und <guimenuitem>Suchen</guimenuitem> auszuwählen.

source: As different people have different preferences about keyboard shortcuts, &kde; offers full customization of <quote>key bindings.</quote> A key binding or shortcut is a combination of an action with a key or a combination of keys.
de: Da verschiedene Menschen verschiedene Vorlieben bezüglich Kurzbefehlen haben, bietet &kde; die vollständige Anpassung von so genannten <quote>Tastenzuordnungen</quote>. Eine Tastenzuordnung oder Kurzbefehle ist die Verbindung einer Aktion mit einer Taste oder einer Tastenkombination.

source: Standard Shortcuts and Global Shortcuts
de: Standard-Kurzbefehle und Globale Kurzbefehle

source: Standard shortcuts and Global shortcuts work just the same. Actually, in a certain way standard or application shortcuts are <quote>global</quote> as well. The only difference is:
de: Standard-Kurzbefehle und globale Kurzbefehle arbeiten nach dem gleichen Prinzip. In einem gewissen Sinne sind Kurzbefehlel für einzelne Programme auch <quote>global</quote>. Der einzige Unterschied ist:

source: <quote>Standard keyboard shortcuts</quote> refer to actions that are often available in applications, such as Save, Print, Copy &etc;
de: <quote>Standard-Kurzbefehle</quote> beziehen sich auf Aktionen, die oft in Anwendungen verfügbar sind, wie Speichern, Drucken, Kopieren &etc;

source: <quote>Global keyboard shortcuts</quote> are shortcuts for actions that make sense even when no application is opened. These shortcuts usually refer to actions like switching desktops, manipulating windows &etc;
de: <quote>Globale Kurzbefehle</quote> sind Kürzel für Aktionen, die auch dann sinnvoll sind, wenn keine Anwendung geöffnet ist. Die Kurzbefehle beziehen sich üblicherweise auf Aktionen wie das Wechseln der Arbeitsfläche, das Verändern von Fenstern &etc;

source: Please note, that the application shortcuts configured here are <emphasis>only</emphasis> the standard actions often found in applications. Most applications will define their own actions as well, for which you have to customize key bindings using the application's key bindings dialog.
de: Bitte beachten Sie, dass Tastenkombinationen für einzelne Programme, die hier konfiguriert werden, <emphasis>nur</emphasis> die Standard-Aktionen sind, die man oft in Anwendungen vorfindet. Die meisten Anwendungen werden zusätzlich ihre eigenen Aktionen definieren, die Sie mit Hilfe des Dialogs für Kurzbefehle der jeweiligen Anwendung festlegen können.

source: Standard Keyboard Shortcuts page
de: Die Seiten Standard-Kurzbefehle

source: At the top of this dialog you see an input box, where you can search interactively for shortcut names (&eg; Copy) or combination of keys (&eg; <quote><userinput>Ctrl+C</userinput></quote>) by typing them literally here.
de: Oben im Dialogfenster wird ein Textfeld angezeigt, indem Sie interaktiv nach Namen von Aktionen (&eg; „Kopieren“) oder Tastenkombinationen (&eg; <quote><userinput>Strg+C</userinput></quote>) suchen können, indem Sie sie hier eintippen.

source: Below the search box you can see a list of key bindings, &ie; associations between actions (&eg; Copy) shown in the <guilabel>Actions</guilabel> column and keys or combination of keys (&eg; <keycombo action="simul">&Ctrl;<keycap>C</keycap> </keycombo>) shown in the <guilabel>Shortcut</guilabel> or <guilabel>Alternate</guilabel> column.
de: Unter dem Suchfeld sehen Sie eine Liste der Tastenzuordnungen, &ie; Verknüpfungen zwischen Aktionen (&eg; „Kopieren“) in der linken Spalte <guilabel>Aktionen</guilabel> und Tasten oder Tastenkombinationen (&eg; <keycombo action="simul">&Ctrl;<keycap>C</keycap> </keycombo>), die in der Spalte <guilabel>Kurzbefehl</guilabel> oder <guilabel>Alternativ</guilabel> stehen.

source: Global Keyboard Shortcuts page
de: Die Seite Globale Kurzbefehle

source: At the top of this page is a drop down box which allows you to select a <guilabel>KDE component</guilabel> like KWin, Plasma Desktop &etc; The defined shortcuts for the selected component are displayed in the <guilabel>Action</guilabel> and <guilabel>Global</guilabel> column in the list view. Click the <guilabel>File</guilabel> drop down box at the right to import/export a Scheme, set all shortcuts to none and remove a component.
de: Oben auf dieser Seite befindet sich ein Auswahlfeld, um eine <guilabel>KDE-Komponente</guilabel> wie KWin, Plasma-Desktop &etc; auszuwählen. Die festgelegten Kurzbefehle für die ausgewählte Komponente in den Spalten <guilabel>Aktion</guilabel> und <guilabel>Global</guilabel> in der Liste angezeigt. Klicken Sie rechts auf das Auswahlfeld <guilabel>Datei</guilabel> im ein Schema zu importieren oder zu exportieren, alle Kurzbefehle oder eine Komponente zu entfernen.

source: This page has the same search box as the <guilabel>Standard Keyboard Shortcuts</guilabel> tab.
de: Diese Seite hat ein Suchfeld wie die Karteikarte <guilabel>Standard-Kurzbefehle</guilabel>.

source: Configuring Key Bindings
de: Tastenkürzel konfigurieren

source: Configuring key bindings is pretty easy. In the middle of these &systemsettings; modules you will find a list of available actions. If there's a key binding configured for that action you will find it in the columns right to it. Just select the action you want to configure.
de: Tastenzuordnungen einzurichten ist ziemlich einfach. In der Mitte des Moduls für die Tastenzuordnungen, finden Sie eine Liste verfügbarer Aktionen. Wenn eine Tastenzuordnung für eine Aktion festgelegt ist, ist diese rechts daneben aufgeführt. Wählen Sie einfach die Aktion aus, die Sie bearbeiten wollen.

source: After you have selected an action in the list you will notice that this item is highlighted and you see two additional check boxes below this item in the list view. There you can configure a combination of keys or maybe no key binding at all for the selected action.
de: Nachdem Sie eine Aktion ausgewählt haben, wird diese Zeile hervorgehoben und zwei zusätzliche Ankreuzfelder unter diesem Eintrag in der Liste angezeigt werden. Sie können mit diesen Ankreuzfeldern Tastenkombinationen für die gewählte Aktion bearbeiten oder vorhandene Tastenkombination löschen.

source: <guilabel>Default</guilabel>: the selected action will be associated with &kde;'s default value. This is a good choice for most actions, as &kde; comes with reasonable key bindings we have thought about.
de: <guilabel>Standard</guilabel>: die ausgewählte Aktion wird mit dem &kde;-Standardwert verbunden. Dies ist eine gute Wahl für die meisten Aktionen, da &kde; mit vernünftigen, wohldurchdachten Tastenzuordnungen ausgeliefert wird.

source: <guilabel>Custom</guilabel>: if this option is enabled, you can create a key combination for the selected action. Click on the button labeled either <guibutton>None</guibutton> or labeled with the previously selected custom shortcut. Now the button label changes to <guibutton>Input</guibutton>. Then press any modifier key (&ie; &Shift;, &Ctrl;, or &Alt;) and then normal key or a function key (&eg; <keycap>F11</keycap>) you want to assign to this key combination.
de: <guilabel>Benutzerdefiniert</guilabel>: wenn diese Einstellung aktiviert ist, können Sie eine Tastenkombination für die ausgewählte Aktion erstellen. Klicken Sie auf den Knopf der entweder mit <guibutton>Keiner</guibutton> oder der vorher eingestellten Tastenkombination beschriftet ist. Dann wechselt der Text zu <guibutton>Eingabe</guibutton>. Drücken Sie nun eine Kombination aus Zusatztaste (&ie; &Shift;, &Ctrl; oder &Alt;) und einer normale Taste oder einer Funktionstaste (&eg; <keycap>F11</keycap>), die sie dieser Aktion zuordnen möchten.

source: Clicking on the <guilabel>Alternate</guilabel> column of a row in the list allows to edit the second shortcut for the action.
de: Klicken Sie auf die Spalte <guilabel>Alternativ</guilabel> in einer Zeile, dann können Sie den zweiten Kurzbefehl für diese Aktion bearbeiten.
