Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kde-workspace/kcontrol_fontinst.po
Languages: de

source: Font Management
de: Schriftarten-Verwaltung

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Stephan</firstname><surname>Johach</surname><affiliation><address><email>hunsum@gmx.de</email></address></affiliation><contrib>Übersetzung</contrib></othercredit>

source: Systemsettings
de: Systemeinstellungen

source: This module is responsible for installing, un-installing, previewing and managing your fonts.
de: In diesem Modul können Sie Schriftarten installieren, entfernen, verwalten und als Vorschau betrachten.

source: Font Groups
de: Schriftartgruppen

source: There are 4 special pre-defined font groups:
de: Es gibt vier vordefinierte Schriftartgruppen:

source: <quote>All Fonts</quote> This will display all fonts, both personal and system-wide.
de: <quote>Alle Schriftarten</quote>: Hierbei werden alle Schriftarten, persönliche und systemweite angezeigt.

source: <quote>Personal Fonts</quote> The fonts shown will be your personal fonts, and will not be available to other users.
de: <quote>Persönliche Schriftarten</quote>: Die angezeigten Schriftarten stehen nur für Sie zur Verfügung und nicht für andere Benutzer.

source: <quote>System Fonts</quote> The fonts shown will be those available to all users. Installing a font system-wide, or removing a system-wide font, will require administrator privileges.
de: <quote>System-Schriftarten</quote>: Die hier angezeigten Schriftarten sind für alle Benutzer verfügbar. Das Installieren oder Deinstallieren einer System-Schriftart erfordert Systemverwalterrechte.

source: <quote>Unclassified</quote> This will list all fonts that have not been placed into any user-defined groups. This group will only appear if you have some user-defined groups.
de: <quote>Nicht klassifiziert</quote>: Hier werden alle Schriftarten angezeigt, die zu keiner der benutzerdefinierten Gruppen gehören. Diese Gruppe wird nur dann angezeigt, wenn sie benutzerdefinierte Gruppen erstellt haben.

source: To add a font to a group, drag it from the list of fonts onto a group. To remove a font from a group, drag the font onto the <quote>All Fonts</quote> group.
de: Um eine Schriftart zu einer Gruppe hinzuzufügen, ziehen Sie sie aus der Liste in die Gruppe. Um eine Schriftart aus einer Gruppe zu entfernen, ziehen Sie diese auf die Gruppe <quote>Alle Schriftarten</quote>.

source: Below this list you find buttons to create a new group, remove a group and enable or disable the fonts in the current group.
de: Unterhalb dieser Listenansicht gibt es vier Knöpfe, um eine neue Gruppe zu erstellen, eine Gruppe zu entfernen und um Schriftarten in der ausgewählten Gruppe zu aktivieren oder zu deaktivieren.

source: In the context menu of this list you have additional menuitems to print font samples and export a font to a zip archive.
de: Im Kontextmenü dieser Liste gibt es noch weitere Menüeinträge, um Schriften auszudrucken oder eine Schrift in ein Zip-Archiv zu exportieren.

source: Enabling and Disabling
de: Aktivieren und Deaktivieren

source: Users with many fonts may find it useful to only have certain fonts enabled (or active) at certain times. To facilitate this, this module will allow you to disable individual fonts, or whole groups of fonts. Disabling a font does not remove the font from the system, it simply hides it so that it no longer appears within applications. Re-enabling a font will then allow it to be used.
de: Benutzer, die viele Schriftarten installiert haben, finden es möglicherweise nützlich zu bestimmten Zeitpunkten immer nur bestimmte Schriftarten aktiv (oder inaktiv) zu haben. Um dem nachzukommen können Sie in diesem Modul einzelne Schriftarten oder Schriftartgruppen deaktivieren. Das Deaktivieren einer Schriftart entfernt diese nicht aus dem System, sie wird nur ausgeblendet, sodass Sie in den Programmen nicht mehr erscheint. Das Aktivieren der Schriftart ermöglicht die Benutzung dann wieder.

source: Font List
de: Schriftartenliste

source: The main display is a list of the installed fonts, grouped via the fonts' family name - the number in square brackets represents the number of installed styles for that family. e.g. The <quote>Times</quote> font may be listed as:
de: Der mittlere Bereich des Moduls stellt eine Liste der installierten Schriftarten dar, gruppiert nach der Schriftfamilie. Die Zahl in eckigen Klammern zeigt die Anzahl der installierten Schriftstile aus dieser Familie an. Ein Beispiel: Die Schriftart <quote>Times</quote> wird möglicherweise so dargestellt:

source: Regular
de: Normal

source: Italic
de: Kursiv

source: Bold
de: Fett

source: Bold Italic
de: Fett kursiv

source: To install a font, press the <guibutton>Add...</guibutton> button, and select the desired fonts from within the file dialog. The selected font group will control where the fonts will be installed.
de: Um eine Schriftart zu installieren, drücken Sie den Knopf <guibutton>Hinzufügen ...</guibutton> und wählen im angezeigten Dateiauswahldialog die gewünschten Schriftarten aus. Die ausgewählte Schriftgruppe legt fest, wo die Schriftarten installiert werden.

source: To un-install fonts, select the appropriate fonts from the list, and press the <guibutton>Delete...</guibutton> button.
de: Um Schriftarten zu deinstallieren, markieren Sie die entsprechenden Schriftarten in der Liste und drücken <guibutton>Löschen ...</guibutton>.

source: Click with the &RMB; to open a context menu with some additional actions like <guilabel>Enable</guilabel>, <guilabel>Disable</guilabel>, <guilabel>Print</guilabel>, <ulink url="help:/kfontviewer/index.html"><guilabel>Open in Font Viewer</guilabel></ulink> and <guilabel>Reload</guilabel>.
de: Klicken Sie mit der &RMBn; um ein Kontextmenü mit folgenden zusätzlichen Einträgen zu öffnen: <guilabel>Aktivieren</guilabel>, <guilabel>Deaktivieren</guilabel>, <guilabel>Drucken</guilabel>, <ulink url="help:/kfontviewer/index.html"><guilabel>Im Schriftartenbetrachter öffnen</guilabel></ulink> und <guilabel>Erneut laden</guilabel>.

source: Font Filtering
de: Filterung der Schriftarten

source: A text field on top of the font preview allows you to filter the list of fonts. You can filter fonts based upon different categories:
de: Im Textfeld über der Schriftvorschau kann ein Filter für die Liste der Schriftarten eingegeben werden. Schriftarten können nach verschiedenen Kategorien gefiltert werden.

source: Family.
de: Familie

source: Style.
de: Stil

source: Foundry.
de: Hersteller

source: FontConfig match. This allows you to enter a family name, and see the family that fontconfig would actually use.
de: Nach FontConfig filtern. Geben Sie den Namen einer Schriftfamilie ein, dann wird angezeigt, welche Schriftfamilie FontConfig tatsächlich benutzt.

source: Font file type.
de: Dateityp

source: Font file name.
de: Dateiname

source: Font file location.
de: Datei-Speicherort

source: Writing system.
de: Schrift-System

source: Get New Fonts
de: Neue Schriftarten installieren

source: New fonts may be installed from local files, or downloaded from <quote>kde-look.org</quote>. The <guilabel>Get New Fonts</guilabel> entry in the tool button (located above the group list), allows you to install fonts from <quote>kde-look.org</quote>. The fonts downloaded in this manner will be installed into your <quote>Personal Fonts</quote> group. To install system-wide, you will need to move them to the <quote>System Fonts</quote> group - this may be achieved by dragging the fonts over the <quote>System Fonts</quote> group entry and will require administrator privileges.
de: Neue Schriften können von lokalen Dateien installiert oder von <quote>kde-look.org</quote> heruntergeladen werden. Mit dem Extras-Knopf <guilabel>Neue Schriftarten installieren</guilabel> über der Gruppenliste können Sie Schriften von <quote>kde-look.org</quote> installieren. Die auf diese Weise heruntergeladenen Schriften werden in Ihrer Gruppe <guilabel>Persönliche Schriftarten</guilabel> installiert. Um diese Schriften systemweit zu benutzen, ziehen Sie sie durch Ziehen und Ablegen in die Gruppe <guilabel>System-Schriftarten</guilabel>. Dies erfordert Systemverwalterrechte.

source: Duplicate Fonts
de: Doppelte Schriftarten

source: If you have lots of fonts installed on your system it is possible that you may have duplicates.
de: Wenn sie viele Schriftarten auf Ihrem System installiert haben, gibt es darunter möglicherweise Duplikate.

source: Click on the tools icon above the group list and select the <guilabel>Scan For Duplicate Fonts...</guilabel> tool, a simple tool that will scan your system looking for fonts that have multiple files associated with them. For example, if you have <quote>times.ttf</quote> and <quote>times.TTF</quote> installed in <quote>/usr/local/share/fonts</quote> the underlying font mechanism (called <quote>FontConfig</quote>) will only see one of these. So, if you un-installed the font, it would re-appear, as only one of the files would have been removed. Running this tool will produce a dialog listing each font that has multiple files, and the corresponding list of files. To select a file for deletion, click on the column containing the trash can icon.
de: Klicken Sie auf das Werkzeugsymbol über der Gruppenliste und wählen Sie dann <quote>Nach doppelten Schriftarten suchen ...</quote>. Dann wird Ihr System auf Schriftarten untersucht, die mit mehreren Dateien verknüpft sind. Wenn Sie beispielsweise <quote>times.ttf</quote> und <quote>times.TTF</quote> in <quote>/usr/local/share/fonts</quote> installiert haben, erkennt das darunterliegende Schriftsystem (mit dem Namen <quote>FontConfig</quote>) nur eine davon. Wenn Sie diese Schriftart deinstallieren, würde sie doch wieder auftauchen, da nur eine der beiden Dateien entfernt wurde. Wenn Sie dieses Hilfsprogramm aufrufen, erscheint ein Dialog mit einer Liste der Schriftarten, für die mehrere Dateien gefunden wurden. Die betreffenden Dateien werden angezeigt und können durch Anklicken des Papierkorb-Symbols in der betreffenden Spalte zum Löschen markiert werden.

source: Preview
de: Vorschau

source: This displays a preview text in different font sizes.
de: Hier wird ein Vorschautext in verschieden Schriftgrößen angezeigt.

source: Using the context menu enables you to zoom in and out, select a preview type (<guilabel>Standard Preview</guilabel> or <guilabel>All Characters</guilabel>) and change the preview text.
de: Im Kontextmenü können Sie die Ansicht vergrößern und verkleinern, den Vorschautyp (<guilabel>Standard-Vorschau</guilabel> oder <guilabel>Alle Zeichen</guilabel>) und den Vorschautext ändern.
