Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kde-workspace/kcontrol_kwindecoration.po
Languages: de

source: Window Decorations
de: Fensterdekoration

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Stephan</firstname><surname>Kulow</surname><affiliation><address><email>coolo@kde.org</email></address></affiliation><contrib>Deutsche Übersetzung</contrib></othercredit>

source: Systemsettings
de: Systemeinstellungen

source: window
de: Fenster

source: border
de: Rand

source: theme
de: Design

source: style
de: Stil

source: Window Decoration
de: Fensterdekoration

source: This module allows you to select a style for the buttons and borders around windows.
de: Dieses Modul erlaubt Ihnen einen Stil für den Rahmen um die Fenster auszuwählen.

source: <screeninfo>Window Decoration Configuration Module</screeninfo>
de: <screeninfo>Einstellungsmodul für die Fensterdekoration</screeninfo>

source: <phrase>Window Decoration Configuration Module</phrase>
de: <phrase>Einstellungsmodul für die Fensterdekoration</phrase>

source: Choose a window decoration style from the preview list, using the search field at the top of the screen.
de: Wählen Sie einen Fensterstil aus der Vorschauliste, die angezeigten Stile können mit der Suchleiste oben im Dialog gefiltert werden.

source: The &kde; default window decoration is called "Oxygen".
de: In &kde; ist als Fensterdekoration der Stil „Oxygen“ eingestellt.

source: Each style has a different look, but also a different <quote>feel</quote>. Some have (sometimes invisible) <quote>resize</quote> borders all around the edge, which make resizing easier but moving more difficult. Some have no borders on certain edges. One (<quote>BII</quote>) even has a dynamically sized and positioned title element.
de: Jede Fensterdekoration hat ein anderes Aussehen und damit verbunden auch eigene Konventionen. Manche haben rundum (manchmal unsichtbare) Ränder zur Größenänderung, die zwar das Ändern der Fenstergröße erleichtern, aber das Verschieben schwieriger machen. Manche besitzen an einigen Kanten gar keine Ränder. Einer (<quote>BII</quote>) besitzt sogar eine in Größe und Position dynamisch angepasste Titelleiste.

source: You are encouraged to experiment with the different styles until you find one which best suits your pattern of work.
de: Probieren Sie ruhig ein mit den verschiedenen Stilen herum, bis Sie einen finden, der Ihnen und Ihrem Arbeitsstil am besten entgegenkommt.

source: Below the preview pane you find three buttons to open configuration dialogs for decoration and buttons of the selected style or to download additional styles.
de: Unter dem Vorschaubereich finden Sie drei Knöpfe, um Einrichtungsdialoge für Dekorationen und Knöpfe zu öffnen und um zusätzliche Stile aus dem Internet herunterzuladen.

source: Decorations
de: Dekorationen

source: In this dialog you can change the decoration of the window. The available options depend on the selected style.
de: In diesem Dialog können Sie die Dekoration für Fenster einstellen. Abhängig vom ausgewählten Stil gibt es unterschiedliche Einstellungsmöglichkeiten.

source: <screeninfo>Oxygen Decoration Options</screeninfo>
de: <screeninfo>Einstellungen für die Dekoration „Oxygen“</screeninfo>

source: <phrase>Oxygen Decoration Options</phrase>
de: <phrase>Einstellungen für die Dekoration „Oxygen“</phrase>

source: Buttons
de: Knöpfe

source: This dialog allows you to customize the buttons location on the titlebar. You can move Close button to the left for example. Check the <guilabel>Use custom titlebar button positions</guilabel> option in order to customize your titlebars. Then use the &kde; titlebar below and the buttons on its left and right to rearrange them as you want them.
de: In diesem Dialog können Sie die Anordnung der Knöpfe in der Titelleiste einstellen. Sie können zum Beispiel den Knopf Schließen ganz nach links schieben. Wählen Sie <guilabel>Benutzerdefinierte Position von Titelleistenknöpfen verwenden</guilabel>, um die Einstellmöglichkeiten zu aktivieren. Passen Sie dann die Position der Knöpfe auf der &kde;-Titelleiste an Ihre Vorstellungen an.

source: By default, <guilabel>Show window button tooltips</guilabel> is checked and tooltips are shown.
de: Als Voreinstellung ist <guilabel>Kurzinfos für Fensterknöpfe anzeigen</guilabel> aktiviert, damit werden die Kurzinfos gezeigt.

source: This page has instructions directly on it - just drag around the buttons until you have the order that makes you comfortable.
de: Die Anleitung zur Verwendung dieser Karteikarte finden Sie auf der Karte selbst. Verschieben Sie die angezeigten Knöpfe so lange, bis Ihnen die Anordnung zusagt.

source: Not all the window decorations are able to comply with your custom set button order. The ones that cannot are being converted, but at the time of this release they have not been all been changed.
de: Bisher sind nicht alle Fensterdekorationen in der Lage, eine benutzerdefinierte Anordnung der Knöpfe zu verwenden. Die fraglichen Dekorationen befinden sich zurzeit noch in Arbeit.

source: Apart from choosing the window decoration itself, you can choose here two further options: if there should be a tooltip while you hover your mouse over a window decoration button, and if the window decoration should attempt to use a custom set button order.
de: Abgesehen vom Stil der Fensterdekorationen kann man hier zwei weitere Einstellungen vornehmen: Ist die Anzeige einer Kurzinfo erwünscht, sobald der Mauszeiger sich über einem Fensterknopf befindet und ob eine benutzerdefinierte Anordnung der Fensterknöpfe angestrebt werden soll.

source: The tooltips can be quite useful if you have set a custom button order, and then changed to an unfamiliar window decoration.
de: Die Kurzinfos können sehr nützlich sein, wenn Sie eine benutzerdefinierte Anordnung der Knöpfe eingestellt haben und dann zu einer ungewohnten Fensterdekoration wechseln.

source: For accessibility purposes, some window decorations support extra wide borders. If this is available, you can also choose a border size here. These large borders are easier to see for low vision users, and easier to grab for people with limited mobility or difficulty using a mouse.
de: Als Zugangshilfe unterstützen einige Fensterdekorationen besonders breite Rahmen. Ist diese Einstellung verfügbar, können Sie hier die Rahmenbreite festlegen. Diese breiten Rahmen sind für sehbehinderte Anwender leichter zu erkennen und können von Menschen mit eingeschränkter Beweglichkeit oder solchen, die Schwierigkeiten bei der Benutzung einer Maus haben, leichter <quote>angefasst</quote> werden.
