Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kde-workspace/kcontrol_kwincompositing.po
Languages: de

source: Desktop Effects
de: Arbeitsflächeneffekte

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Burkhard</firstname><surname>Lück</surname><affiliation><address><email>lueck@hube-lueck.de</email></address></affiliation><contrib>Übersetzung</contrib></othercredit>

source: desktop
de: Arbeitsfläche

source: effects
de: Effekte

source: Introduction
de: Einleitung

source: This module is used to configure desktop effects for &kde;.
de: In diesem Modul können die Arbeitsflächen-Effekte für &kde; eingerichtet werden.

source: This panel is divided into three tabs: <guilabel>General</guilabel>, <guilabel>All Effects</guilabel> and <guilabel>Advanced</guilabel>.
de: Dieses Modul ist in drei Karteikarten aufgeteilt: <guilabel>Allgemein</guilabel>, <guilabel>Alle Effekte</guilabel> und <guilabel>Erweitert</guilabel>.

source: <guilabel>General</guilabel> tab
de: Karteikarte <guilabel>Allgemein</guilabel>

source: At the top of this tab in the section <guilabel>Activation</guilabel> is a checkbox labeled <guilabel>Enable desktop effects at startup</guilabel>. If there is no mark in front of this checkbox, then all visual effects are disabled.
de: Im oberen Bereich der ersten Karteikarte gibt es das Ankreuzfeld <guilabel>Arbeitsflächeneffekte beim Start aktivieren</guilabel>. Falls dieses Feld nicht aktiviert wurde, werden alle Effekte deaktiviert.

source: All desktop effects can be turned on and off using the global shortcut <keycombo action="simul">&Alt;&Shift;<keycap>F12</keycap></keycombo>.
de: Alle Arbeitsflächen-Effekte können mit dem globalen Kurzbefehl <keycombo action="simul">&Alt;&Shift;<keycap>F12</keycap></keycombo> ein- und ausgeschaltet werden.

source: Below that section there are some settings for the simple desktop effects like improved window management, various animations, effects for desktop switching and the animation speed.
de: Unter dem Abschnitt Aktivierung befinden sich einige allgemeine Einstellungen für Arbeitsflächeneffekte wie eine verbesserte Fensterverwaltung, verschiedene Animationen, Effekte für den Wechsel von Arbeitsflächen sowie die Animationsgeschwindigkeit.

source: <guilabel>All Effects</guilabel> tab
de: Karteikarte <guilabel>Alle Effekte</guilabel>

source: The main part of this page is a list of all available effects grouped by <guilabel>Accessibility</guilabel>, <guilabel>Appearance</guilabel>, <guilabel>Candy</guilabel>, <guilabel>Focus</guilabel>, <guilabel>Tools</guilabel> and <guilabel>Window Management</guilabel>. Use the incremental search bar above the list window to find items in the list.
de: Auf dieser Karteikarte finden Sie eine Liste aller verfügbaren Effekte. Die Einträge in dieser Liste sind in die Gruppen <guilabel>Aktivierung</guilabel>, <guilabel>Erscheinungsbild</guilabel>, <guilabel>Extras</guilabel>, <guilabel>Fensterverwaltung</guilabel>, <guilabel>Optik</guilabel> und <guilabel>Zugangshilfen</guilabel> eingeteilt. Benutzen Sie die inkrementelle Suchleiste über dem Listenfenster, um Elemente in der Liste zu finden.

source: Check an effect in the list to enable it. Display the <guilabel>About</guilabel> dialog by clicking the info button at the right side of the list item. Some effects have settings options, in this case there is a tool button at the left of the info button. Click it to open a configuration dialog.
de: Markieren Sie einen Effekt in der Liste um, ihn zu aktivieren. Um Informationen über ein Element anzuzeigen, klicken Sie auf den Knopf mit dem Symbol „Info“ rechts in der Zeile. Für einige Effekte gibt es zusätzliche Einstellungsmöglichkeiten, in diesem Fall klicken Sie auf den Knopf mit dem Symbol „Werkzeug“, um den Einrichtungsdialog zu öffnen.

source: <guilabel>Advanced</guilabel> tab
de: Karteikarte <guilabel>Erweitert</guilabel>

source: On this tab you can select a <guilabel>Compositing type</guilabel> and the <guilabel>Qt graphics system</guilabel>. In the next two sections you can configure <guilabel>General Options</guilabel> and <guilabel>OpenGL Options</guilabel>.
de: Auf dieser Karteikarte kann ein <guilabel>Composit-Typ</guilabel> und das <guilabel>Qt-Grafiksystem</guilabel> ausgewählt und <guilabel>Allgemeine Einstellungen</guilabel> sowie <guilabel>OpenGL-Einstellungen</guilabel> vorgenommen werden.
