Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kde-workspace/kcontrol_kcmstyle.po
Languages: de

source: Style
de: Stil

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Frank</firstname><surname>Schütte</surname><affiliation><address><email>F.Schuette@t-online.de</email></address></affiliation><contrib>Deutsche Übersetzung</contrib></othercredit>

source: System Settings
de: Systemeinstellungen

source: style
de: Stil

source: Introduction
de: Einleitung

source: This module is used to configure how the individual widgets are drawn by &kde;.
de: In diesem Abschnitt können Sie festlegen, wie Kontrollelemente (Widgets) von &kde; dargestellt werden.

source: A <emphasis>Widget</emphasis> is a commonly-used programmer's term for referring to User Interface elements such as buttons, menus, and scroll bars. You can think of them as the fundamental pieces that are assembled to make your application.
de: <emphasis>Kontrollelement (Widget)</emphasis> ist eine übliche Sammelbezeichnung für Elemente der Benutzeroberfläche wie Knöpfe, Menüs oder Bildlaufleisten. Es sind die grundlegenden Bausteine, aus denen Anwendungen zusammengesetzt sind.

source: You can configure how the widgets are drawn with this module, but to change the color of the widgets, you should refer to the section entitled <ulink url="help:/kcontrol/colors/index.html">Colors</ulink>.
de: Sie können in diesem Abschnitt das Aussehen der Kontrollelemente festlegen, aber nicht die Farben. Diese können Sie im Abschnitt <ulink url="help:/kcontrol/colors/index.html">Farben</ulink> einstellen.

source: This panel is divided into two tabs: <guilabel>Applications</guilabel> and <guilabel>Fine Tuning</guilabel>.
de: Dieses Modul ist in zwei Karteikarten aufgeteilt: <guilabel>Anwendungen</guilabel> und <guilabel>Feineinstellungen</guilabel>.

source: <guilabel>Applications</guilabel> tab
de: Die Karteikarte <guilabel>Anwendungen</guilabel>

source: The top drop down box, labeled <guilabel>Widget Style</guilabel> contains a list of the pre-defined styles. Each style has a name, and a brief description.
de: Das obere Auswahlfeld <guilabel>Stil der Bedienelemente</guilabel> enthält eine Liste vordefinierter Stile. Jeder Stil hat einen Namen und eine kurze Beschreibung.

source: To change styles, simply click on the style name, and a preview of the style will be displayed in the preview box below the style list.
de: Um den Stil zu ändern, klicken Sie einfach auf den gewünschten Stilnamen. Eine Vorschau des Stils wird im Vorschaubereich unterhalb des Auswahlfeldes angezeigt.

source: If a style is configurable, the <guibutton>Configure...</guibutton> button at the right side of the drop down box is enabled and can be used to open a dialog to select further settings.
de: Gibt es zusätzliche Einstellungsmöglichkeiten für den ausgewählten Stil, dann können Sie mit dem Knopf <guibutton>Einrichten ...</guibutton> rechts neben dem Auswahlfeld einen Dialog öffnen, um die Einstellungen auszuwählen.

source: <guilabel>Fine Tuning</guilabel> tab
de: Die Karteikarte <guilabel>Feineinstellungen</guilabel>

source: Graphical effects
de: Graphische Effekte

source: &kde; applications will run internal animations with the selected display resolution and CPU usage.
de: &kde;-Anwendungen werden interne Animationen mit der gewählten Bildschirmauflösung und Prozessorlast ausführen.

source: Show icons on buttons
de: Symbole auf Knöpfen anzeigen

source: If this option is selected, action buttons (like <guibutton>OK</guibutton> and <guibutton>Apply</guibutton>) will have a small icon located within them to act as a visual reference. If this option is not selected, then only text will appear on the button.
de: Falls diese Einstellung gewählt wurde, wird auf Standardknöpfen wie <guibutton>OK</guibutton> und <guibutton>Anwenden</guibutton> ein kleines Symbol dargestellt. Ist die Einstellung nicht aktiviert, wird nur der Text des Knopfes angezeigt.

source: Show icons in menus
de: Symbole in Menüs anzeigen

source: If this option is selected, &kde; applications will show small icons alongside most menu items. If this option is not selected, then only text will appear in the menus. Changes to the visibility of menu icons will only affect newly started applications.
de: Ist diese Einstellung ausgewählt, werden in &kde;-Programmen kleine Symbole neben den meisten Menüeinträgen angezeigt, ansonsten nur der Text der Menüeinträge. Wird die Anzeige von Menüsymbolen geändert, wirkt sich das nur auf neu gestartete Programme aus.

source: <guilabel>Main toolbar text</guilabel>, <guilabel>Secondary toolbar text</guilabel>
de: <guilabel>Text auf Haupt-Werkzeugleiste</guilabel>, <guilabel>Text auf anderen Werkzeugleisten</guilabel>

source: These drop down boxes lets you determine where on the button in both toolbars the text name of the button will appear as the default. If <guilabel>No Text</guilabel> is selected, then there is no text on the toolbar buttons. If <guilabel>Text Only</guilabel> is selected, then the button's icon is replaced with a text name of the button. If <guilabel>Text Beside Icons</guilabel> is selected, then the name of the button will be placed to the <emphasis>right</emphasis> of the icon. If <guilabel>Text Below Icons</guilabel> is selected, the default will be to have the text of the button <emphasis>below</emphasis> the icon.
de: Mit diesen Auswahlfeldern können Sie festlegen, wo der Text auf einem Knopf standardmäßig angezeigt wird. Falls <guilabel>Kein Text</guilabel> gewählt ist, wird auf den Knöpfen der Werkzeugleisten kein Text angezeigt. Bei der Auswahl <guilabel>Nur Text</guilabel> wird das Symbol des Knopfes durch eine Textbezeichnung ersetzt. Ist <guilabel>Text neben Symbolen</guilabel> ausgewählt, wird der Text <emphasis>rechts</emphasis> neben dem Symbol angezeigt. Die Auswahl <guilabel>Text unter Symbolen</guilabel> bewirkt, dass der Text des Knopfes standardmäßig <emphasis>unter</emphasis> dem Symbol angezeigt wird.

source: This option only specifies the <emphasis>default</emphasis> location. Each application can override the setting used in this panel.
de: Diese Einstellung legt nur die <emphasis>Standard</emphasis>position fest. Jede Anwendung kann die Einstellung in diesem Abschnitt überschreiben.

source: Menubar style
de: Menüleistenstil

source: <guilabel>In application</guilabel>: The classic menubar at the top of the application window.
de: <guilabel>In Anwendung</guilabel>: Die klassische Menüleiste oben im Anwendungsfenster.

source: <guilabel>Title bar button</guilabel>: The window has an additional menu button top left. All changes will take effect only for newly started applications.
de: <guilabel>Titelleistenknopf</guilabel>: Das Fenster hat einen zusätzlichen Knopf für das Menü oben links. Diese Änderung ist nur für neu gestartete Anwendungen wirksam.

source: <guilabel>Top screen menubar</guilabel>: This will turn on a menubar at the top of the screen that is hidden by default and revealed on mouse over or a menu button on the window decoration. This menubar will reflect the menu options of the active application.
de: <guilabel>Menüleiste am oberen Bildschirmrand</guilabel>: Zeigt die Menüleiste am oberen Bildschirmrand an. Die Leiste ist als Voreinstellung ausgeblendet, sie wird bei Berührung des oberen Rands oder dem Menüknopf der Fensterdekoration eingeblendet. Diese Menüleiste enthält alle Menüaktionen der aktiven Anwendung.

source: <guilabel>Only export</guilabel>: for use by plasma runners + applets. To use this feature you need a KRunner plugin like <guilabel>Appmenu action launcher</guilabel>. Select an application, press <keycombo action="simul">&Alt;<keycap>F2</keycap></keycombo> and type the menu action you want to perform.
de: <guilabel>Nur exportieren</guilabel>: Zur Benutzung mit KRunner-Modulen und Miniprogrammen für Plasma. Um diese Funktion zu verwenden, brauchen Sie ein KRunner-Modul wie <guilabel>Appmenu-Aktionsstarter</guilabel>. Wählen Sie ein Programm, drücken Sie <keycombo action="simul">&Alt;<keycap>F2</keycap></keycombo> und geben Sie die gewünschte Menüaktion ein.
