Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kde-workspace/kcontrol_clock.po
Languages: de

source: Date &amp; Time
de: Datum &amp; Zeit

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Frank</firstname><surname>Schütte</surname><affiliation><address><email>f.Schuette@t-online.de</email></address></affiliation><contrib>Deutsche Übersetzung</contrib></othercredit>

source: Systemsettings
de: Systemeinstellungen

source: date
de: Datum

source: time
de: Zeit

source: configure
de: Ändern

source: You can use this module to alter the system date and time, using a convenient graphical interface.
de: Dieses Modul erlaubt die Einstellung von Datum und Zeit über eine grafische Benutzeroberfläche.

source: As these settings do not only affect you as a user, but rather the whole system, you must have system administrator (<systemitem class="username">root</systemitem>) access to change the system date and time. If you do not have this access level, this module will only show you the current settings, but your changes will not be saved.
de: Da diese Einstellung für alle Benutzer verwendet werden, benötigen Sie Rechte als Systemverwalter (<systemitem class="username">root</systemitem>), um das Systemdatum und die Zeit zu verändern. Wenn Sie diese Rechte nicht haben, zeigt das Modul lediglich die aktuellen Einstellungen an, aber Ihre Änderungen werden nicht gespeichert.

source: Date and Time
de: Datum und Zeit

source: If you check <guilabel>Set date and time automatically</guilabel> you are able to select a <guilabel>Time server</guilabel> from the drop down box and all other settings in this dialog are disabled.
de: Aktivieren Sie <guilabel>Datum und Uhrzeit automatisch setzen</guilabel>, dann können Sie einen <guilabel>Zeitserver</guilabel> im Auswahlfeld einstellen und alle anderen Einstellungen in diesem Dialog sind deaktiviert.

source: The applications <command>rdate</command> or <command>ntpdate</command> are used in this module to fetch date and time from a time server. This happens when you log in to &kde; while being online or when you later connect to the Internet and access to time servers is possible.
de: In diesem Modul werden die Programme <command>rdate</command> oder <command>ntpdate</command> verwendet, um Datum und Zeit bei einem Zeitserver abzufragen. Dies passiert, wenn Sie bei der Anmeldung in &kde; eine Verbindung zum Internet haben, oder wenn Sie später diese Verbindung herstellen und damit Zeitserver erreichbar sind.

source: Both applications are simple <acronym>NTP</acronym> clients that set a system's clock to match the time obtained by communicating with one or more <acronym>NTP</acronym> servers. This is not sufficient, however, for maintaining an accurate clock in the long run. This is useful for occasionally setting the time on machines that do not have full-time network access, such as laptops.
de: Beide Programme sind einfache <acronym>NTP</acronym>-Dienste, die die Uhr des Rechners auf die Zeit einstellen, die von einem oder mehreren <acronym>NTP</acronym>-Zeitservern abgefragt wurden. Dieses Verfahren ist aber nicht ausreichend, um für einen längeren Zeitraum eine korrekte Zeit der Rechneruhr zu gewährleisten. Für Rechner, die wie zum Beispiel Laptops keine dauernde Verbindung zum Netzwerk haben, ist es nützlich, um gelegentlich die Zeit einzustellen.

source: If you do not use a time server, you are able to set the date manually using the lower half of the tab. Simply choose your month and year using the controls at the top of the calendar and the day of the month by clicking on the day in the calendar.
de: Wenn Sie keinen Zeitserver verwenden, kann das Datum im unteren Teil der Karteikarte eingestellt werden. Wählen Sie den Monat und das Jahr mit den Pfeilen über dem Kalender und den Tag des Monats durch Klicken auf den Tag im Kalender.

source: Use the controls at the bottom of the calendar to select the current date, enter the date in the edit box or select the week of the year from the drop down box.
de: Unter dem Kalender kann durch Klicken auf das Kalendersymbol das aktuelle Datum gewählt werden. Außerdem ist auch die direkte Eingabe des Datums im Textfeld oder die Einstellung der Kalenderwoche des Jahres im Auswahlfeld möglich.

source: You set the time using the spin boxes at the bottom of the analog clock. You can also directly enter your value.
de: Die Zeit kann über das Drehfeld im unteren Bereich der Uhr gesetzt werden. Sie können aber auch direkt einen Wert eingeben.

source: Time Zone
de: Zeitzone

source: To set a new time zone, simply select your area from the list below. Use the filter box to find the desired <guilabel>Area</guilabel> or <guilabel>Region</guilabel>.
de: Um eine neue Zeitzone einzustellen, wählen Sie einen Eintrag aus der Liste. Mit dem Filterfeld können Sie die Anzeige auf einen bestimmte <guilabel>Bezirk</guilabel> oder <guilabel>Region</guilabel> einschränken.
