Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kde-workspace/kcontrol_kwinscreenedges.po
Languages: de

source: Screen Edges
de: Bildschirmränder

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Burkhard</firstname><surname>Lück</surname><affiliation><address><email>lueck@hube-lueck.de</email></address></affiliation><contrib>Übersetzung</contrib></othercredit>

source: Systemsettings
de: Systemeinstellungen

source: desktop
de: Arbeitsfläche

source: effects
de: Effekte

source: Active screen edges allow you to activate effects by pushing your mouse cursor against the edge of the screen. Here you can configure which effect will get activated on each edge and corner of the screen.
de: Aktive Bildschirmränder ermöglichen Ihnen das Auslösen eines Effektes, indem Sie die Maus an eine Bildschirmränder bewegen. Hier können Sie einstellen, welche Effekte für welche Bildschirmränder aktiviert werden sollen.

source: Click with any mouse button onto a square and select an effect in the context menu. Edges with a black square have already an attached effect, a grey colored square indicates that no effect is selected for this edge.
de: Klicken Sie mit einer Maustaste auf ein Quadrat und wählen Sie aus dem Kontextmenü einen Effekt aus. Ränder mit aktivierten Effekten werden als schwarzes Quadrat angezeigt, für Ränder mit grauen Quadraten sind keine Effekte ausgewählt.

source: The number of accessible items in the context menu depends on the settings in the module <ulink url="help:/kcontrol/kwincompositing/index.html"> <guilabel>Desktop Effects</guilabel></ulink> in the <guilabel>Workspace Appearance and Behavior</guilabel> category. Enable desktop effects to activate compositing, select the compositing type, and then choose your favorite effects on the <guilabel>All Effects</guilabel> tab from the <guilabel>Windows Management</guilabel> group. This activates the corresponding items in the context menu.
de: Die Anzahl der verfügbaren Elemente im Kontextmenü hängt von den Einstellungen im Modul <ulink url="help:/kcontrol/kwincompositing/index.html"> <guilabel>Arbeitsflächen-Effekte</guilabel></ulink> im Abschnitt <guilabel>Erscheinungsbild und Verhalten der Arbeitsfläche</guilabel> ab. Aktivieren Sie Arbeitsflächeneffekte, um Composite einzuschalten. Wählen Sie dann Ihre bevorzugten Effekte auf der Karteikarte <guilabel>Alle Effekte</guilabel> aus der Gruppe <guilabel>Fensterverwaltung</guilabel>. Damit werden dann auch die zugehörigen Einträge im Kontextmenü dieses Moduls aktiviert.

source: If you are looking for the setting to enable switching of desktops by pushing your mouse cursor against the edge of the screen choose one of the above mentioned <guilabel>Window Management</guilabel> effects from the context menu.
de: Einstellungsmöglichkeiten für den Wechsel der Arbeitsfläche durch Berührung des Bildschirmrandes mit dem Mauszeiger finden Sie im Kontextmenü, wählen Sie im Kontextmenü einen der oben genannten Effekte aus der Gruppe <guilabel>Fensterverwaltung</guilabel>.

source: The section <guilabel>Window Management</guilabel> has two additional options when moving windows to screen edges:
de: Im Abschnitt <guilabel>Fensterverwaltung</guilabel> gibt es zwei zusätzliche Einstellungen für das Ziehen von Fenstern an Bildschirmränder:

source: Maximize windows by dragging them to the top of the screen.
de: Fenster durch Ziehen zum oberen Bildschirmrand maximieren.

source: Tile windows by dragging them to the side of the screen. The windows will be tiled to a quarter of the screen if dragged to the upper or lower part of the screen height determined by the value in the spinbox, otherwise to the full height of the screen.
de: Fenster durch Ziehen zum seitlichen Bildschirmrand anordnen. Die Fenster werden in einen Viertel des Bildschirms angeordnet, wenn Sie zum oberen oder unteren Teil der Bildschirmhöhe gezogen werden, der durch den Wert im Drehfeld festgelegt ist. Ansonsten werden Sie auf der ganzen Höhe des Bildschirms angeordnet.

source: The <guilabel>Other Settings</guilabel> configure the behavior pushing the mouse cursor to a screen edge.
de: Im Abschnitt <guilabel>Andere Einstellungen</guilabel> können Sie das Verhalten festlegen, das durch das Anstoßen eines Bildschirmrands mit dem Mauszeiger ausgelöst wird.

source: <guilabel>Switch desktop on edge</guilabel>: Change desktop when the mouse cursor is pushed against the edge of the screen. If <guilabel>Always Enabled</guilabel> is selected all effects configured for screen edges in the first section of this module will be disabled.
de: <guilabel>Rand für Arbeitsflächenwechsel</guilabel>: Arbeitsfläche wechseln, wenn die Maus an einen Bildschirmrand anstößt. Wenn <guilabel>Immer aktiviert</guilabel> ausgewählt ist, werden alle eingerichteten Effekte für Bildschirmränder im ersten Abschnitt diese Moduls deaktiviert.

source: <guilabel>Activation delay</guilabel>: The amount of time required for the mouse cursor to be pushed against the edge of the screen before the action is triggered
de: <guilabel>Aktivierungsverzögerung</guilabel>: Die benötigte Zeit zum Anstoßen an einen Arbeitsflächenrand, bevor die Aktion ausgelöst wird.

source: <guilabel>Reactivation delay</guilabel>: The amount of time required after triggering an action until the next trigger can occur.
de: <guilabel>Reaktivierungsverzögerung</guilabel>: Das erforderliches Zeitfenster nach einer Aktion, bevor die nächste ausgelöst werden kann.
