Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kde-workspace/kcontrol_windowbehaviour.po
Languages: de

source: Here you can set the snap zone for the screen center, &ie; the <quote>strength</quote> of the magnetic field which will make windows snap to the center of the screen when moved near it.
de: Hier können Sie die Einrastzone für die Bildschirmmitte festlegen, also die „Stärke des magnetischen Feldes“, das Fenster in der Bildschirmmitte andocken lässt, sobald sie in deren Nähe gebracht werden

source: Snap windows only when overlapping
de: Fenster nur einrasten lassen, wenn sie sich überlappen

source: If checked, windows will not snap together if they are only near each other, they must be overlapping, by the configured amount or less.
de: Ist diese Option markiert, rasten Fenster nur dann ein, wenn sie sich überlappen.

source: Advanced
de: Erweitert

source: In the <guilabel>Advanced</guilabel> panel you can do more advanced fine tuning to the window behavior.
de: Auf der Karteikarte <guilabel>Erweitert</guilabel> kann man einige Feinheiten des Fensterverhaltens beeinflussen.

source: Shading
de: Fensterheber

source: Enable hover
de: Automatischer Fensterheber

source: If this option is enabled, a shaded window will un-shade automatically when the mouse pointer has been over the titlebar for some time. Use the spinbox to configure the delay un-shading.
de: Ist diese Option markiert, wird ein auf die Titelleiste reduziertes Fenster automatisch wiederhergestellt, wenn sich der Mauszeiger für eine einstellbare Zeit über der Titelleiste befindet. Mit dem Drehfeld kann man die Verzögerungszeit bis zur automatischen Wiederherstellung einstellen.

source: Window Tabbing
de: Unterfenster

source: Automatically group similar windows
de: Ähnliche Fenster automatisch gruppieren

source: When turned on attempt to automatically detect when a newly opened window is related to an existing one and place them in the same window group.
de: Wenn diese Einstellung aktiviert ist, wird beim Öffnen eines neuen Fensters automatisch geprüft, ob es ähnlich einem vorhandenen Fenster ist, und dann mit diesem gruppiert.

source: Switch to automatically grouped windows immediately
de: Sofort zu automatisch gruppierten Fenstern wechseln

source: When turned on immediately switch to any new window tabs that were automatically added to the current group.
de: Wenn diese Einstellung aktiviert ist, wird sofort zu Fenstern gewechselt, die automatisch einer Gruppe hinzugefügt wurden.

source: Placement
de: Platzierung

source: The placement policy determines where a new window will appear on the desktop. <guilabel>Smart</guilabel> will try to achieve a minimum overlap of windows, <guilabel>Cascade</guilabel> will cascade the windows, and <guilabel>Random</guilabel> will use a random position. <guilabel>Centered</guilabel> will open all new windows in the center of the screen, and <guilabel>Zero-Cornered</guilabel> will open all windows with their top left corner in the top left corner of the screen.
de: Die Platzierung legt fest, wo ein neues Fenster auf dem Bildschirm erscheinen wird. <guilabel>Ökonomisch</guilabel> platziert die Fenster mit einer möglichst geringen Überlappung, <guilabel>Gestaffelt</guilabel> kaskadiert die Fenster und <guilabel>Zufällig</guilabel> verwendet eine zufällige Position. <guilabel>Zentriert</guilabel> öffnet alle neuen Fenster in der Mitte des Bildschirms und <guilabel>Links oben</guilabel> öffnet alle Fenster mit ihrer linken oberen Ecke in der linken oberen Ecke des Bildschirms.

source: Special Window
de: Besondere Fenster

source: Hide utility windows for inactive applications
de: Werkzeugfenster von inaktiven Programmen ausblenden

source: When turned on, utility windows (tool windows, torn-off menus,...) of inactive applications will be hidden and will be shown only when the application becomes active. Note that applications have to mark the windows with the proper window type for this feature to work.
de: Wenn diese Einstellung aktiviert ist, werden Dienstprogrammfenster (Werkzeugfenster, schwebende Menüs, ...) nur angezeigt, wenn das zugehörige Hauptfenster aktiv ist.
