Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kde-workspace/kcontrol_windowbehaviour.po
Languages: de

source: Window Behavior
de: Fensterverhalten

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Matthias</firstname><surname>Kiefer</surname><affiliation><address><email>Matthias.Kiefer@gmx.de</email></address></affiliation><contrib>Deutsche Übersetzung</contrib></othercredit>

source: KControl
de: Kontrollzentrum

source: system settings
de: Systemeinstellungen

source: actions
de: Aktionen

source: window placement
de: Fensterpositionierung

source: window size
de: Fenstergröße

source: In the upper part of this control module you can see several tabs: <guilabel>Focus</guilabel>, <guilabel>Titlebar Actions</guilabel>, <guilabel>Window Actions</guilabel>, <guilabel>Moving</guilabel> and <guilabel>Advanced</guilabel>. In the <guilabel>Focus</guilabel> panel you can configure how windows gain or lose focus, &ie; become active or inactive. Using <guilabel>Titlebar Actions</guilabel> and <guilabel>Window Actions</guilabel> you can configure how titlebars and windows react to mouse clicks. <guilabel>Moving</guilabel> allows you to configure how windows move and place themselves when started. The <guilabel>Advanced</guilabel> options cover some specialized options like <quote>window tabbing</quote> and <quote>window shading</quote>.
de: Im oberen Bereich dieses Moduls sieht man mehrere Karteikarten: <guilabel>Aktivierung</guilabel>, <guilabel>Titelleiste</guilabel>, <guilabel>Fenster</guilabel>, <guilabel>Verschieben</guilabel> und <guilabel>Erweitert</guilabel>. In der Karteikarte <guilabel>Aktivierung</guilabel> kann man einstellen, auf welche Weise Fenster aktiviert bzw. deaktiviert werden. Unter <guilabel>Titelleiste</guilabel> und <guilabel>Fenster</guilabel> kann man festlegen, wie Titelleisten und Fenster auf Mausklicks reagieren. <guilabel>Verschieben</guilabel> erlaubt die Einstellung, wie Fenster verschoben und wo sie positioniert werden können. Die Karteikarte <guilabel>Erweitert</guilabel> enthält einige spezielle Einstellungen wie <quote>Unterfenster</quote> und <quote>Fensterheber</quote>.

source: Please note that the configuration in this module will not take effect if you do not use &kde;'s native window manager, &kwin;. If you do use a different window manager, please refer to its documentation for how to customize window behavior.
de: Die Einstellungen in diesem Modul wirken sich nur dann aus, wenn Sie &kde;'s Fenstermanager &kwin; verwenden. Verwenden Sie einen anderen Fenstermanager, müssen Sie dessen Dokumentation konsultieren.

source: Focus
de: Aktivierung

source: The <quote>focus</quote> of the desktop refers to the window which the user is currently working on. The window with focus is often referred to as the <quote>active window</quote>.
de: Die <quote>Aktivierung</quote> bezieht sich auf das Fenster, in dem der Benutzer gerade arbeitet. Man sagt auch, das aktive Fenster hat den <quote>Fokus</quote>.

source: Focus does not necessarily mean the window is the one at the front &mdash; this is referred to as <quote>raised</quote>, and although this is configured here as well, focus and raising of windows are configured independently.
de: Aktivierung bedeutet nicht automatisch, dass das Fenster dasjenige im Vordergrund ist. Dies wird als <quote>Fenster heben</quote> bezeichnet und kann ebenfalls hier eingerichtet werden. Trotzdem werden die Aktivierung und das Heben der Fenster voneinander unabhängig eingestellt.

source: Focus Policy
de: Aktivierungs-Regelung

source: There are six methods &kde; can use to determine the current focus:
de: Es gibt sechs Methoden, das gerade aktivierte Fenster in &kde; festzulegen:

source: Click To Focus
de: Aktivierung nach Klick

source: A window becomes active when you click into it. This behaviour is common on other operating systems and likely what you want.
de: Ein Fenster wird aktiv, wenn Sie mit der Maus hinein klicken.Dieses Verhalten ist in vielen Betriebssystemen bekannt und wahrscheinlich die gewünschte Einstellung.

source: Click To Focus - Mouse Precedence
de: Aktivierung nach Klick - Vorrang für Maus

source: This is mostly the same as <guilabel>Click To Focus</guilabel>. If an active window has to be chosen by the system (&eg; because the currently active one was closed) the window under the mouse is the preferred candidate. Unusual, but possible variant of <guilabel>Click To Focus</guilabel>.
de: Dies ist fast wie <guilabel>Aktivierung nach Klick</guilabel>. Wenn eine aktives Fenster durch das System gewählt werden muss, &eg; wenn das zurzeit aktive Fenster geschlossen wurde, dann ist das Fenster unter dem Mauszeiger der bevorzugte Kandidat. Ungewöhnliche aber mögliche Variante von <guilabel>Aktivierung nach Klick</guilabel>.

source: Focus Follows Mouse
de: Aktivierung bei Mauskontakt

source: Moving the mouse pointer actively over a normal window activates it. New windows such as the mini command line invoked with <keycombo action="simul">&Alt;<keycap>F2</keycap></keycombo> will receive the focus, without you having to point the mouse at them explicitly. &eg; windows randomly appearing under the mouse will not gain the focus. Focus stealing prevention takes place as usual. Think as <guilabel>Click To Focus</guilabel> just without having to actually click.
de: Bewegen Sie den Mauszeiger aktiv über ein normales Fenster, so wird dieses aktiviert. Neue Fenster wie das Fenster Befehl ausführen, die mit <keycombo action="simul">&Alt;<keycap>F2</keycap></keycombo> aufgerufen wird, erhalten den Fokus ohne dass Sie den Mauszeiger dorthin bewegen müssen. Fenster, die zufälligerweise unter dem Mauszeiger erscheinen, werden nicht aktiviert. Die Vorbeugung gegen unerwünschte Aktivierung funktioniert normal. Dies ist wie <guilabel>Aktivierung nach Klick</guilabel> nur ohne tatsächlich klicken zu müssen.

source: In other window managers, this is sometimes known as <quote>Sloppy focus follows mouse</quote>.
de: Bei anderen Fenstermanagern wird dieser Modus manchmal als <quote>Aktivierung folgt dem Mauszeiger schlampig</quote> bezeichnet.

source: Focus Follows Mouse - Mouse Precedence
de: Aktivierung bei Mauskontakt - Vorrang für Maus

source: This is mostly the same as <guilabel>Focus Follows Mouse</guilabel>. If an active window has to be chosen by the system (&eg; because the currently active one was closed) the window under the mouse is the preferred candidate. Choose this, if you want a hover controlled focus.
de: Dies ist fast wie <guilabel>Aktivierung bei Mauskontakt</guilabel>. Wenn eine aktives Fenster durch das System gewählt werden muss, &eg; wenn das zurzeit aktive Fenster geschlossen wurde,dann ist das Fenster unter dem Mauszeiger der bevorzugte Kandidat. Wählen Sie diese Einstellung für eine durch Mauskontakt gesteuerte Aktivierung.

source: Focus Under Mouse
de: Aktivierung unter Mauszeiger

source: The window that happens to be under the mouse pointer becomes active. If the mouse is not over a window (for instance, it's on the desktop) the last window that was under the mouse has focus. New windows such as the mini command line invoked with <keycombo action="simul">&Alt;<keycap>F2</keycap></keycombo> will not receive the focus, you must move the mouse over them to type.
de: Das Fenster, das sich unter dem Mauszeiger befindet, wird aktiv. Befindet sich der Mauszeiger nicht über einem Fenster (wenn er sich zum Beispiel über der Arbeitsfläche befindet) ist das Fenster aktiv, das sich zuletzt unter dem Mauszeiger befunden hat. Neue Fenster wie Befehl ausführen, das über <keycombo action="simul">&Alt;<keycap>F2</keycap></keycombo> aufgerufen wird, erhalten den Fokus nicht automatisch. Sie müssen erst den Mauszeiger darüber bewegen.

source: Focus Strictly Under Mouse
de: Aktivierung genau unter Mauszeiger

source: Similar to <guilabel>Focus Under Mouse</guilabel>, but even more strict with its interpretation. Only the window under the mouse pointer is active. If the mouse pointer is not over a window, no window has focus. New windows such as the mini command line invoked with <keycombo action="simul">&Alt;<keycap>F2</keycap></keycombo> will not receive the focus, you must move the mouse over them to type.
de: Ähnlich wie <guilabel>Aktivierung unter Mauszeiger</guilabel>, aber noch strikter in der Interpretation. Nur das Fenster unter dem Mauszeiger ist aktiv. Befindet sich der Mauszeiger nicht über einem Fenster, hat kein Fenster den Fokus. Neu Fenster wie Befehl ausführen, das über <keycombo action="simul">&Alt;<keycap>F2</keycap></keycombo> aufgerufen wird, erhalten nicht den Fokus. Sie müssen erst den Mauszeiger darüber bewegen.

source: Note that <guilabel>Focus Under Mouse</guilabel> and <guilabel>Focus Strictly Under Mouse</guilabel> prevent certain features, such as <guilabel>Focus stealing prevention</guilabel> and the <keycombo action="simul">&Alt;&Tab;</keycombo> walk-through-windows dialog, from working properly.
de: Beachten Sie, dass bei <guilabel>Aktivierung unter Mauszeiger</guilabel> und <guilabel>Aktivierung genau unter Mauszeiger</guilabel> bestimmte Funktionen nicht korrekt funktionieren. Darunter die <guilabel>Verhinderung unerwünschter Aktivierung</guilabel> und die Auswahl des aktiven Fensters mit <keycombo action="simul">&Alt;&Tab;</keycombo>.

source: Focus stealing prevention level
de: Verhinderung unerwünschter Aktivierung

source: This option specifies how much KWin will try to prevent unwanted focus stealing caused by unexpected activation of new windows.
de: Diese Einstellung legt fest, wie sehr KWin zu verhindern versucht, dass sich neu öffnende Fenster unerwünscht in den Vordergrund drängen bzw. aktiviert werden.

source: None
de: Keine

source: Prevention is turned off and new windows always become activated.
de: Es wird keine solche Vorbeugung versucht, alle neuen Fenster werden automatisch aktiviert.

source: <guilabel>Low</guilabel>
de: <guilabel>Niedrig</guilabel>

source: Prevention is enabled; when some window does not have support for the underlying mechanism and KWin cannot reliably decide whether to activate the window or not, it will be activated. This setting may have both worse and better results than the medium level, depending on the applications.
de: Für den Fall, dass ein Fenster auf den eigentlichen Mechanismus nicht reagiert und KWin nicht entscheiden kann, ob eine Aktivierung gewünscht wird oder nicht, dann wird das Fenster automatisch aktiviert. Diese Einstellung führt teils zu besseren, teils aber auch schlechteren Ergebnissen als die folgende, je nach den verwendeten Programmen.

source: Medium
de: Mittel

source: Prevention is enabled.
de: Vorbeugungsmaßnahmen werden aktiviert.

source: High
de: Hoch

source: New windows get activated only if no window is currently active or if they belong to the currently active application. This setting is probably not really usable when not using mouse focus policy.
de: Neue Fenster werden nur dann aktiviert, wenn gerade kein anderes Fenster aktiv ist oder sie zum gerade benutzten Programm gehören. Diese Einstellung ist nur dann sinnvoll, wenn der Fokus der Maus folgt.

source: Extreme
de: Extrem

source: All windows must be explicitly activated by the user.
de: Sämtliche Fenster müssen manuell vom Benutzer aktiviert werden.

source: Windows that are prevented from stealing focus are marked as demanding attention, which by default means their taskbar entry will be highlighted. This can be changed in the Notifications control module.
de: Fenster, die aufgrund dieser Regelung nicht nach vorne geholt wurden, erscheinen als Fenster, die Ihre Aufmerksamkeit erfordern. D. h. ihr Eintrag in der Kontrollleiste wird hervorgehoben. Dieses Verhalten kann im Einstellungsmodul für Systemnachrichten geändert werden.

source: Raising window
de: Fenster nach vorne holen

source: Once you have determined the focus policy, there are the window raising options.
de: Wenn Sie den Standard für die Aktivierung festgelegt haben, stehen weitere Optionen zur Verfügung.

source: By placing a mark in front of <guilabel>Raise on hover, delayed by</guilabel>, &kde; can bring a window to the front if the mouse is over that window for a specified period of time. You can determine the delay for this option by using the spin box control.
de: Ist <guilabel>Hervorheben beim Überfahren, verzögert um</guilabel> aktiviert, so platziert &kde; das Fenster automatisch nach vorne, wenn sich der Mauszeiger für eine bestimmte Zeit über dem Fenster befindet. Die Verzögerungszeit können Sie mit dem Drehfeld einstellen.

source: Setting the delay too short will cause a rapid fire changing of windows, which can be quite distracting. Most people will like a delay of 100-300 ms. This is responsive, but it will let you slide over the corners of a window on your way to your destination without bringing that window to the front.
de: Setzt man die Verzögerungszeit auf einen zu geringen Wert, führt das zu einer schnellen Folge von Fensterwechseln, die sehr störend sein kann. Sinnvoll ist ein Wert von 100-300 ms. Der Fenstermanager reagiert schnell genug, dennoch kann man auf dem Weg zum Ziel ein anderes Fenster überqueren, ohne dieses nach vorn zu bringen.

source: If you do not use auto raise, make sure the <guilabel>Click raises active window</guilabel> option has a mark in front of it. You will not be happy with both auto raise and <guilabel>Click raise active window</guilabel> disabled, the net effect is that windows are not raised at all.
de: Wenn Sie das automatische nach vorne holen nicht benutzen, sollten Sie auf jeden Fall <guilabel>Aktives Fenster auf Klick nach vorne holen</guilabel> aktivieren. Sind beide Einstellungen abgeschaltet, zeigt der Fensterverwaltung ein nicht sonderlich sinnvolles Verhalten, da die Fenster überhaupt nicht in den Vordergrund geholt werden.

source: Titlebar Actions
de: Titelleiste

source: In this panel you can configure what happens to windows when a mousebutton is clicked on their titlebars.
de: Auf dieser Karteikarte können Sie festlegen, was mit einem Fenster passiert, wenn mit der Maus auf die Titelleiste geklickt wird.

source: Titlebar double-click
de: Doppelklick auf Titelleiste

source: In this drop down box you can select either <guilabel>Shade</guilabel>, several variations of <guilabel>Maximize</guilabel> or <guilabel>Lower</guilabel>.
de: In diesem Auswahlfeld können Sie entweder <guilabel>Fensterheber</guilabel>, verschiedene Formen von <guilabel>Maximieren</guilabel> oder <guilabel>Nach hinten</guilabel> auswählen.

source: Selecting <guilabel>Maximize</guilabel> causes &kde; to maximize the window whenever you doubleclick on the titlebar. You can further choose to maximize windows only horizontally or only vertically.
de: Bei <guilabel>Maximieren</guilabel> wird &kde; das Fenster bei einem Doppelklick auf die Titelleiste maximieren. Sie können außerdem auswählen, ob ein Fenster nur horizontal oder nur vertikal maximiert werden soll.

source: <guilabel>Shade</guilabel>, on the other hand, causes the window to be reduced to simply the titlebar. Double clicking on the titlebar again, restores the window to its normal size.
de: Bei <guilabel>Fensterheber</guilabel> wird das Fenster auf die Titelleiste reduziert. Ein zweiter Doppelklick stellt die vorherige Fenstergröße wieder her.

source: You can have windows automatically unshade when you simply place the mouse over their shaded titlebar. Just check the <guilabel>Enable hover</guilabel> check box in the <guilabel>Advanced</guilabel> tab of this module. This is a great way to reclaim desktop space when you are cutting and pasting between a lot of windows, for example.
de: Soll ein auf die Titelleiste reduziertes Fenster automatisch wiederhergestellt werden, wenn die Maus darüber platziert wird, müssen Sie auf der Karteikarte <guilabel>Erweitert</guilabel> das Markierungsfeld <guilabel>Automatischer Fensterheber</guilabel> auswählen. Damit lässt sich hervorragend Platz auf der Arbeitsfläche sparen, wenn man z.B. zwischen vielen Fenster Inhalte durch Ausschneiden und Kopieren überträgt.

source: Titlebar &amp; Frame
de: Titelleiste &amp; Rahmen

source: This section allows you to determine what happens when you single click on the titlebar or frame of a window. Notice that you can have different actions associated with the same click depending on whether the window is active or not.
de: In diesem Abschnitt kann man festlegen, wie sich ein Fenster bei einfachem Klick auf die Titelleiste oder den Rahmen verhält. Man kann dabei unterschiedliche Aktionen einstellen, je nachdem ob das Fenster aktiv ist oder nicht.

source: For each combination of mousebuttons, Active and Inactive, you can select the most appropriate choice. The actions are as follows:
de: Man kann für jede Kombination der Maustasten und Aktiv/Inaktiv die geeignete Aktion einstellen. Die möglichen Aktionen sind:

source: Activate
de: Aktivieren

source: Make this window active.
de: Aktiviert dieses Fenster.

source: Lower
de: Nach hinten

source: Will move this window to the bottom of the display. This will get the window out of the way.
de: Platziert das Fenster an das Ende des Bildschirms. Damit wird das Fenster aus dem Weg bewegt.

source: Nothing
de: Nichts

source: Just like it says. Nothing happens.
de: Offensichtlich passiert hier nichts.

source: Operations Menu
de: Kontextmenü

source: Will bring up a small submenu, where you can choose window related commands (&ie; Maximize, Minimize, Close, &etc;).
de: Ein Untermenü mit fensterbezogenen Befehlen wird angezeigt (unter anderem Maximieren, Minimieren, Schließen &etc;).

source: Raise
de: Nach vorn

source: Will bring the window to the top of the display. All other windows which overlap with this one, will be hidden <quote>below</quote> it.
de: Bringt das Fenster ganz nach vorn. Alle anderen Fenster, die dieses überlappen, werden <quote>dahinter</quote> gestellt.

source: Toggle Raise &amp; Lower
de: Nach vorn bringen &amp; hinten stellen umschalten

source: This will raise windows which are not on top, and lower windows which are already on top.
de: Bringt ein Fenster nach vorn, wenn es vorher nicht vorn war, und nach hinten, wenn es vorher vorn war.

source: Maximize Button
de: Maximieren-Knopf

source: This section allows you to determine the behavior of the three mouse buttons onto the maximize button. You have the choice between vertical only, horizontal only or both directions.
de: In diesem Abschnitt können Sie die Aktion für alle drei Maustasten beim Klick auf den Knopf „Maximieren“ einstellen. Nur vertikal, nur horizontal und beide Richtungen für das „Maximieren“ des Fensters stehen zur Auswahl.

source: Window Actions
de: Fenster

source: Inactive Inner Window
de: Inaktives, inneres Fenster

source: This part of the module, allows you to configure what happens when you click on an inactive window, with any of the three mouse buttons or use the mouse wheel.
de: Dieser Abschnitt des Moduls legt fest, was passiert, wenn Sie mit einer der drei Maustasten in ein inaktives Fenster klicken oder das Mausrad verwenden.

source: Your choices are as follows:
de: Es gibt folgende Einstellmöglichkeiten:

source: Activate, Raise &amp; Pass Click
de: Aktivieren, nach vorn &amp; mit Klick ansprechen

source: This makes the clicked window active, raises it to the top of the display, and passes a mouse click to the application within the window.
de: Das angeklickte Fenster wird aktiviert, auf der Arbeitsfläche ganz nach vorne geholt und an die Anwendung im Fenster wird ein Mausklick übertragen.

source: Activate &amp; Pass Click
de: Aktivieren &amp; mit Klick ansprechen

source: This makes the clicked window active and passes a mouse click to the application within the window.
de: Das angeklickte Fenster wird aktiviert und an die Anwendung im Fenster ein Mausklick übertragen.

source: This simply makes the clicked window active. The mouse click is not passed on to the application within the window.
de: Hierdurch wird das angeklickte Fenster lediglich aktiviert. Der Mausklick wird nicht an die Anwendung im Fenster weitergegeben.

source: Activate &amp; Raise
de: Aktivieren &amp; nach vorne

source: This makes the clicked window active and raises the window to the top of the display. The mouse click is not passed on to the application within the window.
de: Das angeklickte Fenster wird aktiviert und ganz vorne auf der Arbeitsfläche dargestellt. Der Mausklick wird nicht an die Anwendung im Fenster weitergegeben.

source: Inner Window, Titlebar &amp; Frame
de: Inneres Fenster, Titelleiste &amp; Rahmen

source: This bottom section, allows you to configure additional actions, when a modifier key (by default &Alt;) is pressed, and a mouse click is made on a window.
de: Dieser unterste Abschnitt ermöglicht die Einstellung zusätzlicher Aktionen, wenn beim Mausklick eine Sondertaste (&Alt; ist der Standard) gedrückt wird.

source: Once again, you can select different actions for <mousebutton>Left</mousebutton>, <mousebutton>Middle</mousebutton> and <mousebutton>Right</mousebutton> button clicks and the <guilabel>Mouse wheel</guilabel>.
de: Sie können auch hier unterschiedliche Aktionen für die &LMB;, &MMB;, &RMB; und das Mausrad festlegen.

source: Your choices are:
de: Die Wahlmöglichkeiten sind:

source: Move
de: Verschieben

source: Allows you to drag the selected window around the desktop.
de: Bewegt das Fenster auf der Arbeitsfläche.

source: Resize
de: Größe ändern

source: Allows you to change the size of the selected window.
de: Ändert die Größe des ausgewählten Fensters.

source: Moving
de: Verschieben

source: Windows
de: Fenster

source: The options here determine how windows appear on screen when you are moving them.
de: Diese Einstellungen bestimmen das Erscheinungsbild von Fenster auf dem Bildschirm, wenn sie verschoben werden.

source: Display window geometry when moving or resizing
de: Bei Verschiebungen und Größenänderung die Fenstergeometrie anzeigen

source: Enable this option if you want a window's geometry to be displayed while it is being moved or resized. The window position relative to the top-left corner of the screen is displayed together with its size.
de: Aktivieren Sie diese Einstellung, wenn Sie Angaben zur Geometrie des Fensters eingeblendet haben möchten, während Sie seine Größe oder Position ändern. Es werden dann die relative Position zur linken oberen Ecke des Bildschirms und die Abmessungen angezeigt.

source: Snap Zones
de: Einrastzonen

source: The rest of this page allows you to configure the <guilabel>Snap Zones</guilabel>. These are like a magnetic field along the side of the desktop and each window, which will make windows snap alongside when moved near.
de: Der Rest dieser Seite erlaubt die Einrichtung der <guilabel>Einrastzonen</guilabel>. Diese wirken wie ein magnetisches Feld entlang der Ränder von Fenstern und der Arbeitsfläche, die Fenster gleichsam einrasten lassen, wenn sie sich einander nähern.

source: Border snap zone:
de: Rand-Einrastzone:

source: Here you can set the snap zone for screen borders. Moving a window within the configured distance will make it snap to the edge of the desktop.
de: Hier können Sie die Einrastzonen für die Arbeitsflächenränder festlegen. Wird ein Fenster in eine dieser Zonen verschoben, so rastet es an einer Kante der Arbeitsoberfläche ein.

source: Window snap zone:
de: Fenster-Einrastzone:

source: Here you can set the snap zone for windows. As with screen borders, moving a window near to another will make it snap to the edge as if the windows were magnetized.
de: Hier können Sie die Einrastzone für Fenster festlegen. Wie beim Arbeitsflächenrand rastet ein Fenster ein, wenn es in die Einrastzone eines Anderen gerät.

source: Center snap zone:
de: Bildschirmmitte-Einrastzone:
