Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kde-workspace/kcontrol_workspaceoptions.po
Languages: de

source: Workspace
de: Arbeitsbereich

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Burkhard</firstname><surname>Lück</surname><affiliation><address><email>lueck@hube-lueck.de</email></address></affiliation><contrib>Übersetzung</contrib></othercredit>

source: System Settings
de: Systemeinstellungen

source: desktop
de: Arbeitsfläche

source: workspace
de: Arbeitsbereich

source: This is a module to configure global options for the Plasma workspace.
de: In diesem Modul kann das globale Verhalten der Plasma-Arbeitsumgebung eingestellt werden.

source: Workspace Type
de: Arbeitsflächentyp

source: In this section you can configure the type of workspace you will be using. Right now there are two options:
de: In diesem Abschnitt wird der benutzte Typ des Arbeitsbereichs eingestellt. Zurzeit gibt es zwei Optionen:

source: A workspace optimized for traditional desktops and laptop computers.
de: Ein Arbeitsbereich, der für die normalen Desktoprechner und für Laptops optimiert ist.

source: A workspace optimized for netbooks and in general for devices with a smaller screen resolution.
de: Ein Arbeitsbereich, der für Netbooks und allgemein für Geräte mit geringerer Bildschirmauflösung optimiert ist.

source: In the dashboard section you can configure the behavior of the Plasma dashboard. Right now there are two options:
de: In diesem Abschnitt wird das Verhalten des Dashboards eingestellt Zurzeit gibt es zwei Optionen:

source: Show Desktop Widgets
de: Miniprogramme für den Formfaktor Desktop anzeigen

source: The dashboard will show the same widgets present on the desktop.
de: Im Dashboard werden die gleichen Bedienelemente wie auf der Arbeitsfläche angezeigt.

source: Show an Independent Widget Set
de: Unabhängigen Satz an Miniprogrammen anzeigen

source: The dashboard will present an independent set of widget that is different from the ones in the desktop.
de: Im Dashboard wird ein eigener Satz von Bedienelementen angezeigt, verschieden von den Elementen für den Formfaktor Desktop.

source: Informational Tips
de: Informationen

source: <guilabel>Show Informational Tips</guilabel> are displayed hovering items in the Plasma panel or on the desktop.
de: Ist <guilabel>Informationen anzeigen</guilabel> aktiviert, werden diese angezeigt, wenn sich der Mauszeiger auf Elementen des Desktops oder der Plasma-Kontrollleiste befindet.
