Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kde-workspace/kcontrol_powerdevil.po
Languages: de

source: Power Management
de: Energieverwaltung

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Burkhard</firstname><surname>Lück</surname><affiliation><address><email>lueck@hube-lueck.de</email></address></affiliation><contrib>Übersetzung</contrib></othercredit>

source: System Settings
de: Systemeinstellungen

source: power management
de: Energieverwaltung

source: laptop power
de: Notebook-Stromversorgung

source: PowerDevil, a Power Management Daemon
de: PowerDevil, ein Energieverwaltungsdienst

source: This module is a configuration tool for managing Power Management in &kde;. It is a configurator for the PowerDevil daemon, that you can start or stop from the <guilabel>Service Manager</guilabel> module.
de: Dieses Modul erlaubt die Einrichtung der Energieverwaltung für &kde;. Damit wird der PowerDevil-Dienst eingestellt, der im Modul <guilabel>Diensteverwaltung</guilabel> gestartet oder gestoppt werden kann.

source: Through this module, you can define your computer's behavior in various situations, allowing you to save as much energy as possible.
de: In diesem Modul kann das Verhalten des Rechners für verschiedene Situationen festgelegt werden, um möglichst viel Energie zu sparen.

source: Powerdevil works with Solid only and it's integrated in your desktop. You won't even notice it is running, apart from notifications. Moreover, Powerdevil checks your system capabilities first, so you'll see only options available for your system in this module.
de: PowerDevil funktioniert nur mit Solid und ist in die Arbeitsumgebung integriert. Es läuft im Hintergrund und macht sich nur durch die Benachrichtigungen bemerkbar. PowerDevil überprüft zuerst die Fähigkeiten des Systems, nur Einstellungen für diese Fähigkeiten werden angeboten.

source: Note that PowerDevil does not poll your system. This means that it will not waste energy while trying to save it, as some other power managers do.
de: PowerDevil fragt nicht fortlaufend das System ab und verbraucht dadurch Energie beim Versuch, sie einzusparen.

source: <title>Energy Saving Settings</title>
de: <title>Einstellungen für Energiesparmodus</title>

source: This page shows the actual energy saving settings. If a battery is detected you have three tabs with different settings for <guilabel>On AC Power</guilabel>, <guilabel>On Battery</guilabel> and <guilabel>On Low Battery</guilabel> profiles.
de: Diese Seite die aktuellen Einstellungen zum Energiesparen. Wenn ein Akku vorhanden ist, werden drei Karteikarten mit den Einstellungen für die Profile <guilabel>Am Netzkabel</guilabel>, <guilabel>Im Akkubetrieb</guilabel> und <guilabel>Im Akkubetrieb bei niedrigem Ladestand</guilabel> angezeigt.

source: <screeninfo>Energy Saving Settings</screeninfo>
de: <screeninfo>Einstellungen für Energiesparmodus</screeninfo>

source: <phrase>Energy Saving Settings</phrase>
de: <phrase>Einstellungen für Energiesparmodus</phrase>

source: <para>Energy Saving Settings</para>
de: <para>Einstellungen für Energiesparmodus</para>

source: There are a lot of options you can configure for each profile:
de: Es gibt viele Einstellungen für jedes Profil:

source: <guilabel>Screen Brightness</guilabel>
de: <guilabel>Bildschirm-Helligkeit</guilabel>

source: Sets the screen's brightness using a slider.
de: Einstellung der Helligkeit des Bildschirms mit dem Schieberegler.

source: Dim Screen
de: Bildschirm abdunkeln

source: If checked, the display will be progressively dimmed, until reaching brightness 0, in the amount of time you specify in the spin box.
de: Ist diese Einstellung aktiv, wird der Bildschirm im Zeitraum. der im Drehfeld eingetragen ist, abgedunkelt.

source: Screen Energy Saving
de: Bildschirm-Energieverwaltung

source: Here you can define power saving for your monitor. The check box defines if DPMS support should be enabled or disabled. If you choose to activate it, set the timeouts in the spin boxes below.
de: Hier können die Energiesparfunktionen des Bildschirms eingestellt werden. Im Ankreuzfeld können Sie die Unterstützung von DPMS aktivieren oder deaktivieren.Ist DPMS aktiviert, geben Sie Ausschaltzeiten in den Drehfeldern darunter an.

source: Suspend Session
de: Sitzung in den Ruhezustand versetzen

source: Suspends the session after the selected time to the status <guilabel>Sleep</guilabel>, <guilabel>Hibernate</guilabel>, <guilabel>Shutdown</guilabel> or <guilabel>Lock screen</guilabel>.
de: Ändert den Status der Sitzung nach der angegebenen Zeit in <guilabel>Ruhezustand</guilabel>, <guilabel>Tiefschlaf</guilabel>, <guilabel>Herunterfahren</guilabel> oder <guilabel>Bildschirm sperren</guilabel>.

source: Button events handling
de: Knopf-Ereignisbehandlung

source: Select actions to perform whenever the laptop lid is closed or a button is pressed.
de: Wählen Sie die Aktion aus, die beim Herunterklappen des Bildschirms oder Drücken des Ausschalt-Knopfes ausgeführt wird.

source: Run Script
de: Skript ausführen

source: Activate this option to run a custom script when a profile is loaded, unloaded or after a given amount of time.
de: Aktivieren Sie diese Einstellung, um ein benutzerdefiniertes Skript beim Laden oder Entladen eines Profils oder nach einer vorgegebenen Zeitspanne auszuführen.

source: <title>Activity Settings</title>
de: <title>Aktivitäten-Einstellungen</title>

source: Here you can configure the Power Management settings per activity. The settings for each activity can be configured on its own tab.
de: Auf dieser Seite können Energieprofile für jede Aktivität eingerichtet werden. Für jede Aktivität gibt es eine eigene Karteikarte für die Einstellung des Energieprofils dieser Aktivität.

source: <screeninfo>Activity Settings</screeninfo>
de: <screeninfo>Aktivitäten-Einstellungen</screeninfo>

source: <phrase>Activity Settings</phrase>
de: <phrase>Aktivitäten-Einstellungen</phrase>

source: <para>Activity Settings</para>
de: <para>Aktivitäten-Einstellungen</para>

source: Don't use special settings
de: Keine besonderen Einstellungen verwenden

source: Use the settings defined on <guilabel>Energy Saving</guilabel> page.
de: Verwendet die Einstellungen, die auf der Seite <guilabel>Energiesparen</guilabel> definiert sind.

source: Act like
de: Verhalten wie

source: Here you can choose a predefined profile from the drop-down box: <guimenuitem>PC running on AC power</guimenuitem>, <guimenuitem>PC running on battery power</guimenuitem> or <guimenuitem>PC running on low battery</guimenuitem>.
de: Hier können Sie ein vordefiniertes Profil im Auswahlfeld einstellen: <guimenuitem>Rechner läuft mit Netzteil</guimenuitem>, <guimenuitem>Rechner läuft mit Akku</guimenuitem> oder <guimenuitem>Rechner läuft mit Akku auf niedrigen Ladestand</guimenuitem>.

source: Define a special behavior
de: Besonderes Verhalten definieren

source: If this option is chosen, a special behavior for activity can be chosen. If this is a presentation activity, you can check the <guilabel>Never shutdown the screen</guilabel> and <guilabel>Never suspend or shutdown the computer</guilabel> boxes. It is also possible to define the time interval for the computer to switch to a suspension mode for the power saving activities.
de: Ist diese Einstellung aktiv, kann ein besonderes Verhalten für Aktivitäten ausgewählt werden. Für eine Präsentation können Sie <guilabel>Den Bildschirm nie ausschalten</guilabel> and <guilabel>Den Rechner nie in den Ruhezustand versetzen oder herunterfahren</guilabel> auswählen. Es ist auch möglich, die Zeit für das Herunterfahren des Rechners für die Energiesparfunktionen von Profilen zu definieren.

source: Use separate settings (advanced users only)
de: Unterschiedliche Einstellungen verwenden (nur für erfahrene Benutzer)

source: This option allows users to choose the detail power saving settings for a separate activity. The settings are similar to the settings from the <link linkend="energy-saving-setting">Energy Saving page</link>.
de: Mit dieser Einstellung kann der Benutzer detaillierte Einstellungen zum Energiesparen für eine einzelne Aktivität wählen. Diese Einstellungen entsprechen den Einstellungen auf der Seite <link linkend="energy-saving-setting">Energiesparen</link>.

source: <title>Advanced Settings</title>
de: <title>Erweiterte Einstellungen</title>

source: <screeninfo>Advanced Settings</screeninfo>
de: <screeninfo>Erweiterte Einstellungen</screeninfo>

source: <phrase>Advanced Settings</phrase>
de: <phrase>Erweiterte Einstellungen</phrase>

source: <para>Advanced Settings</para>
de: <para>Erweiterte Einstellungen</para>

source: Battery levels
de: Akku-Ladestände

source: These items are only displayed if a battery is detected.
de: Diese Einträge werden nur angezeigt, wenn ein Akku vorhanden ist und erkannt wurde.

source: Battery is at low level at
de: Der Akku-Ladestand ist niedrig bei

source: Here you can set the percentage after which the battery will be considered low.
de: Einstellung für den Prozentwert des niedrigen Ladezustands des Akkus.

source: Battery is at critical level at
de: Der Akku-Ladestand ist kritisch bei

source: Here you can set the percentage after which the battery will be considered at critical level.
de: Einstellung für den Prozentwert des kritischen Ladezustands des Akkus.

source: When battery is at critical level
de: Wenn der Ladestand des Akkus kritisch ist

source: Defines the action that will be done when battery reaches the critical level.
de: Wählen Sie aus, welche Aktion beim kritischen Akku-Ladestand ausgeführt wird.

source: Events
de: Ereignisse

source: Lock screen on resume
de: Bildschirm nach dem Ruhezustand sperren

source: When this box is checked, every time the PC gets suspended, the screen will be locked when resuming. You will be asked for a password when resuming from sleep state.
de: Ist diese Einstellung aktiv, ist nach der Rückkehr des Rechners aus dem Ruhezustand der Bildschirm gesperrt. Nachdem das System aus dem Ruhezustand wiederhergestellt ist, werden Sie nach Ihrem Passwort gefragt.

source: Never prevent an action on lid close
de: Aktionen bei geschlossenem Deckel nie verhindern

source: When this option is selected, applications will not be allowed to inhibit sleep when the lid is closed.
de: Ist diese Einstellung aktiviert, dürfen Anwendungen den Schlafmodus nicht verhindern, wenn der Deckel geschlossen ist.

source: Configure Notifications
de: Benachrichtigungen festlegen

source: If you want a deeper control over your notifications, you can refine them by clicking this button.
de: Möchten Sie die Einstellungen für Benachrichtigungen noch genauer anpassen, klicken Sie auf diesen Kopf.

source: PowerDevil Runner
de: PowerDevil in &krunner; ausführen

source: PowerDevil can be manually controlled through &krunner; (<keycombo action="simul">&Alt;<keycap>F2</keycap></keycombo>). This makes changing profile, brightness, governor and more much easier and faster. The runner has various keywords you can enter to access its functions
de: PowerDevil kann auch in &krunner; (<keycombo action="simul">&Alt;<keycap>F2</keycap></keycombo>) ausgeführt werden. Damit ist das Ändern von Profilen, der Helligkeit des Bildschirms, der Prozesssortaktung und anderer Werte schnell und direkt möglich. In &krunner; gibt es mehrere Schlüsselwörter zum Zugriff auf diese Funktionen.

source: Runner Keywords
de: Schlüsselwörter für &krunner;

source: Here comes a list of keywords you can enter in &krunner; to perform PowerDevil related actions.
de: Folgende Schlüsselwörter sind als Eingabe in &krunner; für Aktionen von PowerDevil möglich:

source: Power Profile
de: Energieprofil

source: You can manually choose a profile using this keyword. All available profiles will be shown in form of &krunner; matches.
de: Mit dieser Option kann manuell ein Energieprofil eingestellt werden. Alle vorhandenen Profile werden in &krunner; angezeigt.

source: <guibutton>Screen Brightness</guibutton>
de: <guibutton>Bildschirm-Helligkeit</guibutton>

source: You can control screen brightness through this keyword. In this form, some &krunner; matches that let you do some common actions will be shown. If you enter a value after the keyword (&eg;: <userinput>Screen Brightness 50</userinput>), the brightness will be set to that value.
de: Mit diesem Schlüsselwort wird die Helligkeit des Bildschirms eingestellt. Nach Eingabe dieses Schlüsselworts werden in &krunner; mögliche Werte angezeigt. Wenn Sie &eg; <userinput>Bildschirm-Helligkeit 50</userinput> eingeben, wird die Helligkeit für den Bildschirm auf diesen Wert gesetzt.

source: Suspend
de: Ruhezustand

source: You can suspend your pc through this keyword. Available suspend methods will be shown as &krunner; matches.
de: Mit diesem Schlüsselwort wird der Rechner in den Ruhezustand versetzt. Alle möglichen Ruhezustände werden in &krunner; angezeigt.
