Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kde-workspace/kcontrol_fonts.po
Languages: de

source: Fonts
de: Schriften

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Carsten</firstname><surname>Niehaus</surname><affiliation><address><email>CNiehaus@gmx.de</email></address></affiliation><contrib>Übersetzung</contrib></othercredit>

source: fonts
de: Schriften

source: This module is designed to allow you to easily select different fonts for different parts of the &kde; Desktop.
de: Dieses Modul wurde erstellt, um Ihnen eine einfache Möglichkeit zu geben, unterschiedlichen Bereichen ihrer &kde;-Arbeitsfläche unterschiedliche Schriften zuzuweisen.

source: Here's a screenshot of the fonts settings module
de: Bildschirmfoto des Moduls Einstellung der Schriftarten

source: The fonts settings module
de: Das Modul Einstellung der Schriftarten

source: The panel consists of different font groups to give you a lot of flexibility in configuring your fonts:
de: Es stehen Ihnen verschiedene Schriftgruppen zur Verfügung. Somit haben Sie viele verschiedene Einstellmöglichkeiten.

source: <guilabel>General:</guilabel> Used everywhere when the other font groups do not apply
de: <guilabel>Allgemein:</guilabel> wird überall dort benutzt, wo die anderen Gruppen nicht greifen

source: <guilabel>Fixed width:</guilabel> Anywhere a non-proportional font is specified
de: <guilabel>Feste Breite:</guilabel> Überall dort, wo eine nicht proportionale Schrift angegeben ist

source: <guilabel>Small:</guilabel> When small fonts are used
de: <guilabel>Klein:</guilabel> Wenn kleine Schriften verwendet werden

source: <guilabel>Toolbar:</guilabel> Font used in &kde; application toolbars
de: <guilabel>Werkzeugleiste:</guilabel> Schrift für die Werkzeugleisten in &kde;-Anwendungen

source: <guilabel>Menu:</guilabel> Font used in &kde; application menus
de: <guilabel>Menü:</guilabel> Schrift für die Menüs in &kde;-Anwendungen

source: <guilabel>Window title:</guilabel> Font used in the window title
de: <guilabel>Fenstertitel:</guilabel> Schrift für die Fenstertitel

source: <guilabel>Taskbar:</guilabel> Font used in the taskbar panel applet
de: <guilabel>Fensterleiste:</guilabel> Schrift für die Fensterleisten-Miniprogramme

source: <guilabel>Desktop:</guilabel> Font used on the desktop to label icons
de: <guilabel>Arbeitsfläche:</guilabel> Schrift für die Anzeige des Textes von Arbeitsflächensymbolen

source: Each font has a corresponding <guibutton>Choose...</guibutton> button. By clicking on this button, a dialog box appears. You can use this dialog box to choose a new font, a font style and size. Then press <guibutton>Ok</guibutton>.
de: Jede Schrift hat einen zugehörigen Knopf <guibutton>Auswählen ...</guibutton> Wenn Sie auf diesen Knopf klicken, erscheint ein Dialog-Fenster. In diesem Dialog können Sie zwischen Schriftart, Schriftstil und -größe wählen. Anschließend drücken Sie auf <guibutton>Ok</guibutton>.

source: An example of the font you have chosen will be displayed in the space between the font group name and the <guibutton>Choose...</guibutton> button.
de: Ein Beispiel der von Ihnen ausgesuchten Schrift erscheint zwischen dem Namen der Schriftgruppe und dem Knopf <guibutton>Auswählen ...</guibutton>

source: When you are done, simply click <guibutton>OK</guibutton> and all the necessary components of &kde; will be restarted so your changes can take affect immediately.
de: Wenn Sie Ihre Einstellungen abgeschlossen haben, klicken Sie auf <guibutton>OK</guibutton>. Nun werden alle notwendigen Anwendungen von &kde; neu gestartet, sodass die Änderungen sofort in Kraft treten.

source: The <guibutton>Adjust All Fonts...</guibutton> button allows you to quickly set properties for all the fonts selected above. A font selection dialog similar to the standard one will appear, but you will notice checkboxes that allow you to change the <guilabel>Font</guilabel>, <guilabel>Font style</guilabel> or <guilabel>Size</guilabel> independently of each other. You can choose any one, two, or three of these options, and they will be applied to all the font groups.
de: Der Knopf <guibutton>Alle Schriftarten anpassen ...</guibutton> erlaubt die Anpassung einer Eigenschaft oder einer Gruppe von Eigenschaften für alle oben ausgewählten Schriftarten. Es erscheint ein Auswahldialog für die Schriftarten ähnlich dem Standarddialog. Der Dialog enthält zusätzliche Ankreuzfelder, die eine Änderung von <guilabel>Schriftart</guilabel>, <guilabel>Schriftstil</guilabel> oder <guilabel>Größe</guilabel> unabhängig voneinander ermöglichen. Man kann eine beliebige Kombination dieser Felder markieren und die betreffenden Einstellungen werden auf alle Schriftartgruppen angewandt.

source: Adjusting all fonts
de: Anpassung aller Schriftarten

source: The Adjust All Fonts... dialog
de: Der Dialog Anpassung aller Schriftarten

source: For example, if you have selected several different font faces above, and realize they are all a size too big (this often happens when you change screen resolution, for instance), you can apply a new font size to all the fonts, without affecting your customized font faces and styles.
de: Falls man &eg; verschiedene Schriftarten ausgewählt hat und danach feststellt, dass die gewählten Schriftgrößen zu groß sind (das passiert oft bei einer Änderung der Bildschirmauflösung), kann man allen Schriftgruppen gleichzeitig eine neue Schriftgröße zuordnen, ohne das sich die Schriftart oder der Schriftstil ändern.

source: Anti-aliasing text
de: Kantenglättung für Schriften

source: Default anti-aliasing settings are those used system wide by your distribution and labelled <guilabel>System Settings</guilabel>. You can disable all anti-aliasing by choosing <guilabel>Disabled</guilabel> in the drop down box.
de: Die Standardeinstellungen für Kantenglättung, wie sie systemweit von Ihrer Distribution vorgegeben sind, werden hier als <guilabel>Systemeinstellungen</guilabel> bezeichnet. Die Kantenglättung können Sie ganz ausschalten, indem Sie im Auswahlfeld <guilabel>Deaktiviert</guilabel> einstellen.

source: To use and set up anti-aliasing, simply choose <guilabel>Enabled</guilabel> from the box on the right of <guilabel>Use anti-aliasing:</guilabel>. The <guibutton>Configure...</guibutton> button will then get enabled and clicking on it will bring you a dialog to configure anti-aliasing.
de: Um Kantenglättung zu verwenden und einzurichten, wählen Sie <guilabel>Aktiviert</guilabel> im Feld rechts von <guilabel>Kantenglättung verwenden</guilabel>. Damit wird der Knopf <guibutton>Einrichten ...</guibutton> aktiviert. Klicken Sie darauf, um den Einstellungsdialog für Kantenglättung zu öffnen.

source: Anti-aliasing properties
de: Einstellung für Kantenglättung

source: The anti-aliasing properties dialog
de: Der Dialog Einstellung für Kantenglättung

source: Placing a mark in the <guilabel>Exclude range:</guilabel> checkbox will allow you to specify which range of fonts will <emphasis>not</emphasis> be anti-aliased. This range is specified with the two combo boxes on the same line.
de: Wenn Sie das Ankreuzfeld <guilabel>Bereich ausschließen</guilabel> aktivieren, dann können Sie angeben, in welchem Bereich die Schriftarten <emphasis>nicht</emphasis> geglättet werden sollen. Dieser Bereich wird in den beiden Drehfeldern rechts eingestellt.

source: You can also choose the method that &kde; uses to create an anti-alias look to your fonts, and how strongly it should be applied. If you are not familiar with the individual methods, you should leave this option alone.
de: Sie können auch die Methode festlegen, die &kde; zur Kantenglättung verwenden soll. Wenn Sie die verschiedenen Methoden nicht kennen, sollten Sie diese Einstellung unverändert lassen.

source: The ability to use anti-aliased fonts and icons requires that you have support in both X and the &Qt; toolkit, that you have suitable fonts installed, and that you are using the built-in font serving capabilities of the X server. If you still are having problems, please contact the appropriate &kde; mailing list, or check the <acronym>FAQ</acronym>.
de: Die Verfügbarkeit von geglätteten Schriften und Symbolen erfordert die entsprechende Unterstützung in X als auch in der &Qt;-Bibliothek. Weiterhin müssen geeignete Schriften installiert sein und die eingebauten Fontserver von X benutzt werden. Treten dennoch Probleme auf, wenden Sie sich an die passende &kde;-Mailingliste oder lesen Sie die <acronym>FAQ</acronym>.

source: Fonts DPI
de: DPI für Schriften

source: <guilabel>Force fonts DPI:</guilabel> proposes you an alternate DPI other than your system one which is used as default when this setting is on <guilabel>Disabled</guilabel>. You can check what DPI your X server is set to by running <userinput>xdpyinfo | grep resolution</userinput> in a terminal window and then change the DPI using the drop down box. This will be applied to newly started applications only.
de: Mit <guilabel>DPI für Schriften erzwingen</guilabel> können Sie eine andere Bildschirmauflösung als die Standardeinstellung Ihres Systems auswählen. Die aktuell verwendete Auflösung des X-Servers erfahren Sie durch Eingabe von <userinput>xdpyinfo | grep resolution</userinput> in einer Konsole. Eine geänderte Bildschirmauflösung kann nur von neu gestarteten Anwendungen benutzt werden.
