Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kde-workspace/kdm.po
Languages: de

source: This usually involves changing the line:
de: Das erfordert gewöhnlich eine Änderung der folgenden Zeile:

source: <para>to</para>
de: <para>zu</para>

source: When you reboot your system, you should end up with the graphical &kdm; login dialog.
de: Nach einem Neustart sollten Sie jetzt das grafische Anmeldungsfenster von &kdm; sehen.

source: If this step is unsuccessful the most likely problem is that the environment used at boot time differs from the environment that you used for testing at the command line. If you are trying to get two versions of &kde; to co-exist, be particularly careful that the settings you use for your <envar>PATH</envar> and <envar>LD_LIBRARY_PATH</envar> environment variables are consistent, and that the startup scripts are not over-riding them in some way.
de: Sollte das nicht geschehen, so liegt das Problem wahrscheinlich darin, dass die Umgebungsvariable während des Bootvorgangs andere Werte haben, als während ihres Tests. Falls Sie versuchen, zwei Version von &kde; nebeneinander zu betreiben, sollten Sie besonders darauf achten, dass die Umgebungsvariablen <envar>PATH</envar> und <envar>LD_LIBRARY_PATH</envar> korrekt gesetzt sind, und dass die Startup-Skripte diese nicht irgendwie überschreiben.

source: Supporting multiple window managers
de: Unterstützung mehrerer Window-Manager

source: &kdm; detects most available window managers and desktop environments when it is run. Installing a new one should make it automatically available in the &kdm; main dialog's <guimenuitem>Session Type</guimenuitem> submenu.
de: &kdm; erkennt die meisten verfügbaren Window-Manager und Arbeitsumgebungen beim Start. Neu installierte Umgebungen sollten automatisch im Hauptdialog von &kdm; unter <guimenuitem>Sitzungstyp</guimenuitem> erscheinen.

source: If you have a very new window manager, or something that &kdm; does not support, the first thing you should check is that the executable to be run is in the <envar>PATH</envar> and has not been renamed by the distributor into something unexpected.
de: Verwenden Sie einen ziemlich neuen Window-Manager oder eine Umgebung, die &kdm; nicht unterstützt, sollten Sie zunächst prüfen, ob das ausführbare Programm im <envar>PATH</envar> steht und oder von der Distribution einen unüblichen Namen erhalten hat.

source: If the case is that the session type is not supported by &kdm; yet (maybe because it is too new), you can quite easily add it.
de: Falls der Sitzungstyp sehr neu ist und von &kdm; noch nicht unterstützt wird, können Sie einen neuen Sitzungstyp einfach selbst hinzufügen.

source: The session types are defined by <firstterm>.desktop</firstterm> files located in the directories listed in <link linkend="option-sessionsdirs"><option>SessionsDirs</option></link>. The last named directory contains the system-provided default session types and is <filename class="directory">$<envar>KDEDIR</envar>/share/apps/kdm/sessions</filename> in an installation from source. Software upgrades will typically overwrite anything in here, so it is unwise to use it for configuration purposes. Instead, a separate configuration directory should be listed first. It is set to <filename class="directory">$<envar>KDEDIR</envar>/share/config/kdm/sessions</filename> in an installation from source, but distributors often change it to something like <filename class="directory">/etc/kde4/kdm/sessions</filename>. You can simply add an appropriately named <literal role="extension">.desktop</literal> files here. The fields are:
de: Die Sitzungstypen sind durch <firstterm>.desktop</firstterm>-Dateien definiert, die sich in den unter <link linkend="option-sessionsdirs"><option>SessionsDirs</option></link> aufgeführten Ordnern befinden.Der zuletzt genannte Ordner enthält die vom System bereitgestellten Standardsitzungstypen. Bei einer Installation aus dem Quelltext befindet ist dieser der Ordner <filename class="directory">$<envar>KDEDIR</envar>/share/apps/kdm/sessions</filename>. Bei der Aktualisierung der Software wird der Inhalt dieses Ordners normalerweise überschrieben. Daher sollten die Dateien in dem Ordner nicht für benutzerdefinierte Einstellungen verwendet werden. Stattdessen sollte zuerst ein eigener Ordner für benutzerdefinierte Einstellungen aufgeführt werden. Bei einer Installation aus dem Quelltext ist dies <filename class="directory">$<envar>KDEDIR</envar>/share/config/kdm/sessions</filename>, Distributionen benutzen häufig Pfade wie <filename class="directory">/etc/kde4/kdm/sessions</filename>. In diesen Ordner können Sie jede richtig benannte <literal role="extension">.desktop</literal>-Datei einfügen. Diese Datei enthält folgende Einträge:

source: [Desktop Entry] Encoding=UTF-8 <lineannotation>This is fixed to <option>UTF-8</option> and may be omitted</lineannotation> Type=XSession <lineannotation>This is fixed to <option>XSession</option> and may be omitted</lineannotation> Exec=<replaceable>executable name</replaceable> <lineannotation>Passed to <command>eval exec</command> in a Bourne shell</lineannotation> TryExec=<replaceable>executable name</replaceable> <lineannotation>Supported but not required</lineannotation> Name=<replaceable>name to show in the &kdm; session list</replaceable>
de: [Desktop Entry] Encoding=UTF-8 <lineannotation>Dieses Feld ist auf <option>UTF-8</option> festgelegt und kann ausgelassen werden.</lineannotation> Type=XSession <lineannotation> Dieses Feld ist auf <option>XSession</option> festgelegt und kann ausgelassen werden.</lineannotation> Exec=<replaceable>executable name</replaceable> <lineannotation>Wird an <command>eval exec</command> in einer Bourne-Shell übergeben.</lineannotation> TryExec=<replaceable>executable name</replaceable> <lineannotation>Unterstützt, aber nicht erforderlich.</lineannotation> Name=<replaceable>Der Name, der in der Liste der &kdm;-Sitzungen</replaceable> erscheint

source: There are also three <quote>magic</quote> types:
de: Es gibt außerdem noch drei <quote>magische</quote> Sitzungstypen:

source: default
de: Standard

source: The default session for &kdm; is normally &kde; but can be configured by the system administrator.
de: Die Standard-Sitzung für &kdm; ist normalerweise &kde;, aber Sie kann vom Systemverwalter angepasst werden.

source: custom
de: Benutzerdefiniert

source: The Custom session will run the user's ~/.xsession if it exists, falling back to the default session otherwise.
de: Die Sitzung <quote>Benutzerdefiniert</quote> führt die Datei ~/.xsession des Benutzers aus, sofern diese existiert. Existiert diese Datei nicht, wird eine Standardsitzung gestartet.

source: failsafe
de: Abgesichert

source: Failsafe will run a very plain session, and is useful only for debugging purposes.
de: Abgesichert startet eine minimale Arbeitssitzung und dient nur zu Debugging-Zwecken.

source: To override a session type, copy the .desktop file from the data dir to the config dir and edit it at will. Removing the shipped session types can be accomplished by <quote>shadowing</quote> them with .desktop files containing Hidden=true. For the magic session types no .desktop files exist by default, but &kdm; pretends they would, so you can override them like any other type.
de: Um einen Sitzungstyp zu überschreiben, kopieren Sie die .desktop-Datei aus dem data-Ordern in den config-Ordner und bearbeiten Sie nach Ihren Wünschen. Die mitgelieferten Sitzungstypen können entfernt werden, indem diese durch .desktop-Dateien <quote>ausgeblendet</quote> werden, die den Eintrag Hidden=true enthalten. Für die magischen Sitzungstypen existieren per Voreinstellung keine .desktop-Dateien, aber &kdm; tut so, als sei dies der Fall. Deshalb können Sie diese wie jeden anderen Sitzungstyp überschreiben.

source: Using &kdm; for Remote Logins (&XDMCP;)
de: &kdm; für Anmeldungen über Fremdrechner benutzen (&XDMCP;)

source: &XDMCP; is the Open Group standard, the <quote>X Display Manager Control Protocol</quote>. This is used to set up connections between remote systems over the network.
de: &XDMCP; ist der Open-Group-Standard, das <quote>X Display Manager Control Protocol</quote>. Dieses wird benutzt um Verbindungen zwischen verschiedenen Rechnern eines Netzwerks herzustellen.

source: &XDMCP; is useful in multiuser situations where there are users with workstations and a more powerful server that can provide the resources to run multiple X sessions. For example, &XDMCP; is a good way to reuse old computers - a Pentium or even 486 computer with 16 Mb RAM is sufficient to run X itself, and using &XDMCP; such a computer can run a full modern &kde; session from a server. For the server part, once a single &kde; (or other environment) session is running, running another one requires very few extra resources.
de: &XDMCP; ist in Situation von Nutzen in denen sich mehrere Benutzer mit Workstations einen leistungsstarken Server teilen, der mehrere X-Sitzungen gleichzeitig abwickeln kann. Zum Beispiel lässt sich &XDMCP; einsetzen um selbst alte Computer weiter verwenden zu können. Ein Pentium oder sogar nur ein 486er-Computer mit 16 MB RAM ist ausreichend um X zu betreiben. Mittels &XDMCP; kann so ein Computer eine komplette, moderne &kde;-Sitzung eines Servers ausführen. Auf dem Server gilt, dass weitere &kde;-Sitzungen zu einer bereits bestehenden nur geringfügig mehr Ressourcen verbrauchen.

source: However, allowing another method of login to your machine obviously has security implications. You should run this service only if you need to allow remote X Servers to start login sessions on your system. Users with a single &UNIX; computer should not need to run this.
de: Dennoch - eine weitere Methode zur Anmeldung zum System bereitzustellen hat natürlich einen Einfluß auf die Sicherheit des Systems. Es empfiehlt sich diesen Service nur dann einzurichten wenn X-Server von Fremdrechnern auf diesem System Anmeldevorgänge durchführen sollen. Benutzer mit nur einem &UNIX;-System sollten diesen Service nicht aktivieren.

source: Advanced Topics
de: Fortgeschrittene Themen

source: Command Sockets
de: Befehls-Sockets

source: This is a feature you can use to remote-control &kdm;. It's mostly intended for use by &ksmserver; and &kdesktop; from a running session, but other applications are possible as well.
de: Mit dieser Funktion können Sie &kdm; fernsteuern. Sie ist hauptsächlich für die Verwendung durch &ksmserver; und &kdesktop; aus einer laufenden Sitzung heraus gedacht, kann aber auch von anderen Anwendungen genutzt werden.

source: The sockets are &UNIX; domain sockets which live in subdirectories of the directory specified by <option>FifoDir</option>=. The subdir is the key to addressing and security; the sockets all have the file name <filename>socket</filename> and file permissions <literal>rw-rw-rw-</literal> (0666). This is because some systems don't care for the file permission of the socket files.
de: Hierbei handelt es sich um &UNIX; Domain-Sockets, die sich in den Unterordnern des Ordners befinden, der durch <option>FifoDir</option>= festgelegt wurde. Der Unterordner ist der Schlüssel zur Adressierung und die Sicherheit. Alle Sockets haben den Namen <filename>socket</filename> sowie die Dateiberechtigung <literal>rw-rw-rw-</literal> (0666). Dies ist dadurch bedingt, dass manche Systeme die Dateiberechtigungen von Socket-Dateien ignorieren.

source: There are two types of sockets: the global one (dmctl) and the per-display ones (dmctl-&lt;display&gt;).
de: Es gibt zwei Arten von Sockets: den globalen (dmctl) und die display-spezifischen (dmctl-&lt;display&gt;).

source: The global one's subdir is owned by root, the subdirs of the per-display ones' are owned by the user currently owning the session (root or the logged in user). Group ownership of the subdirs can be set via FifoGroup=, otherwise it's root. The file permissions of the subdirs are rwxr-x--- (0750).
de: Der Unterordner des globalen Sockets gehört dem Systemverwalter root, die Unterordner der Display-spezifischen gehören dem Benutzer der jeweiligen Arbeitssitzung (root oder der angemeldete Benutzer). Die Gruppenzugehörigkeit der Unterordner kann über FifoGroup= umgestellt werden, anderenfalls ist die Gruppe root. Die Dateiberechtigungen der Unterordner sind rwxr-x--- (0750).

source: The fields of a command are separated by tabs (<token>\t</token>), the fields of a list are separated by spaces, literal spaces in list fields are denoted by <token>\s</token>.
de: Die Felder eines Befehls werden durch Tabulatoren (<token>\t</token>) getrennt, die Felder einer Liste durch Leerzeichen. Leerzeichen in einem Listenfeld werden durch <token>\s</token> dargestellt.

source: The command is terminated by a newline (<token>\n</token>).
de: Der Befehl wird mit einem Zeilenumbruch (<token>\n</token>) abgeschlossen.

source: The same applies to replies. The reply on success is <returnvalue>ok</returnvalue>, possibly followed by the requested information. The reply on error is an errno-style word (&eg; <returnvalue>perm</returnvalue>, <returnvalue>noent</returnvalue>, &etc;) followed by a longer explanation.
de: Dasselbe gilt für Antworten. Die Antwort bei Erfolg ist <returnvalue>ok</returnvalue>, eventuell gefolgt von der angeforderten Information. Die Antwort bei einem Fehler ist ein Datenwort im Stil von errno (&eg; <returnvalue>perm</returnvalue>, <returnvalue>noent</returnvalue>, &etc;), gefolgt von einer längeren Erläuterung.

source: Global commands:
de: Globale Befehle:

source: <command>login</command> <option>display</option> (<parameter>now</parameter> | <parameter>schedule</parameter>) <parameter>user</parameter> <parameter>password</parameter> [session_arguments]
de: <command>login</command> <option>display</option> (<parameter>now</parameter> | <parameter>schedule</parameter>) <parameter>Benutzer</parameter> <parameter>Passwort</parameter> [session_arguments]

source: login user at specified display. if <parameter>now</parameter> is specified, a possibly running session is killed, otherwise the login is done after the session exits. session_arguments are printf-like escaped contents for .dmrc. Unlisted keys will default to previously saved values.
de: Benutzer am angegebenen Display anmelden. Wenn <parameter>now</parameter> angegeben ist, wird eine gerade laufende Sitzung abgebrochen, anderenfalls wird die Anmeldung erst nach Beenden der aktuellen Sitzung durchgeführt. <quote>session_arguments</quote> sind im Format von printf angegebene Inhalt für .dmrc. Nicht aufgeführte Schlüssel sind mit den zuletzt gespeicherten Werten vorbelegt.

source: Force return from console mode, even if TTY logins are still active.
de: Erzwingt die Rückkehr aus dem Konsolen-Modus, sogar wenn noch Anmeldungen auf TTY's aktiv sind.

source: Start managing the named foreign display.
de: Startet die Verwaltung des angegeben entfernten Displays.

source: <parameter>display_class</parameter>, if specified and non-empty, will be used for configuration matching; see <xref linkend="kdm-files"/>.
de: Wenn <parameter>display_class</parameter> angegeben und nicht leer ist, wird dieser Wert für die Einrichtung benutzt, siehe auch <xref linkend="kdm-files"/>.

source: <parameter>auth_name</parameter> and <parameter>auth_data</parameter> need to be passed if the display requires X authorization. The format is the same as the 2nd and 3rd column of the <command>xauth list</command> output.
de: <parameter>auth_name</parameter> und <parameter>auth_data</parameter> müssen angegeben werden, wenn eine X-Autorisierung am Display erforderlich ist. Diese Parameter haben das gleiche Format wie die zweite und dritte Spalte der Ausgabe von <command>xauth list</command>.

source: Stop managing the named foreign display.
de: Stoppt die Verwaltung des angegeben entfernten Displays.

source: Per-display commands:
de: Display-spezifische Befehle:

source: The display is marked as locked. If the &X-Server; crashes in this state, no auto-relogin will be performed even if the option is on.
de: Dieses Display ist als gesperrt markiert. Wenn der X-Server in diesem Zustand abstürzt, erfolgt keine automatische Anmeldung.

source: Reverse the effect of <command>lock</command>, and re-enable auto-relogin.
de: Hebt den Effekt von <command>lock</command> auf und schaltet die automatische Anmeldung wieder ein.

source: The currently running session is forcibly terminated. No auto-relogin is attempted, but a scheduled "login" command will be executed.
de: Die derzeit laufende Arbeitssitzung wird zum Abbruch gezwungen. Es wird keine automatische Anmeldung versucht, aber ein geplantes <quote>login</quote> ausgeführt.

source: Commands for all sockets
de: Befehle für alle Sockets

source: Returns a list of this socket's capabilities:
de: Gibt eine Liste der Eigenschaften dieses Sockets zurück:

source: identifies &kdm;, in case some other DM implements this protocol, too
de: identifiziert kdm für den Fall, dass ein anderer Display-Manager dieses Protokoll ebenfalls unterstützt.

source: The respective command is supported
de: Der entsprechende Befehl wird unterstützt

source: The <command>listbootoptions</command> command and the <option>=</option> to <command>shutdown</command> are supported
de: Der Befehl <command>listbootoptions</command> und <option>=</option> zum <command>shutdown</command> werden unterstützt

source: <command>shutdown</command> is supported and allowed for the listed users (a comma separated list.) <returnvalue>*</returnvalue> means all authenticated users.
de: <command>shutdown</command> wird unterstützt und ist für die aufgeführten Benutzer (eine kommaseparierte Liste) erlaubt. <returnvalue>*</returnvalue> steht für alle authentifizierten Benutzer.

source: Forced shutdown may be performed by the listed users.
de: Ein erzwungenes Herunterfahren kann von allen aufgeführten Benutzern ausgeführt werden.

source: Forced shutdown may be performed by everybody
de: Ein erzwungenes Herunterfahren kann von jedem Benutzer ausgeführt werden

source: reserve &lt;number&gt;
de: reserve &lt;anzahl&gt;

source: Reserve displays are configured, and <returnvalue>number</returnvalue> are available at this time
de: Es sind Reserve-Displays eingerichtet, und davon sind <returnvalue>anzahl</returnvalue> gerade verfügbar

source: Return a list of running sessions. By default all active sessions are listed (this is useful for a shutdown warning). If <parameter>all</parameter> is specified, passive sessions are listed as well. If <parameter>alllocal</parameter> is specified, passive sessions are listed as well, but all incoming remote sessions are skipped (this is useful for a fast user switching agent).
de: Gibt eine Liste der laufenden Sitzungen zurück. Als Voreinstellung werden alle aktiven Sitzungen aufgeführt, dies kann für eine Warnung beim Herunterfahren benutzt werden. Wird <parameter>all</parameter> angegeben, werden auch passive Sitzungen aufgeführt. Wird <parameter>alllocal</parameter> angegeben, werden passive Sitzungen ebenfalls aufgelistet aber alle eingehenden Sitzungen auf anderen Rechnern übergangen. Die kann für einen Dienst zu schnellen Wechseln des Benutzers verwendet werden.

source: Each session entry is a comma separated tuple of:
de: Jeder Eintrag für eine Sitzung besteht aus einem mit Kommata getrennten Tupel aus:

source: Display or TTY name
de: Display- oder TTY-Name

source: VT name for local sessions, remote host name prefixed by <literal>@</literal> for remote TTY sessions, otherwise empty
de: Der Name des virtuellen Terminals für lokale Sitzungen, bei entfernten TTY-Sitzungen wird der Name des entfernten Rechners mit <literal>@</literal> vorangestellt, ansonsten leer.

source: Logged in user's name, empty for passive sessions and outgoing remote sessions (local chooser mode)
de: Dem Namen des angemeldeten Benutzers oder einem leeren Eintrag bei passiven Sitzungen und ausgehenden Sitzungen auf anderen Rechnern

source: Session type for active local sessions, remote hostname for outgoing remote sessions, empty for passive sessions.
de: Sitzungstyp für aktive lokale Sitzungen, für ausgehende Sitzungen auf anderen Rechnern, leer für passive Sitzungen.

source: A Flag field:
de: Einem Flag-Feld:

source: <literal>*</literal> for the display belonging to the requesting socket.
de: <literal>*</literal> für den Display, der zum anfragenden Socket gehört.

source: <literal>!</literal> for sessions that cannot be killed by the requesting socket.
de: <literal>!</literal> für Sitzungen, die vom anfragenden Socket nicht abgebrochen werden können.

source: <literal>t</literal> for TTY sessions.
de: <literal>t</literal> für TTY-Sitzungen.

source: New fields may be added in the future.
de: Zukünftig können hier weitere Felder hinzukommen.

source: Start a reserve login screen. If nobody logs in within some time, the display is removed again. When the session on the display exits, the display is removed, too.
de: Startet einen Reserver-Anmeldebildschirm. Wenn sich innerhalb einer bestimmten Zeit niemand anmeldet, wird der Display wieder entfernt. Wenn die Sitzung auf diesem Display beendet wird, wird dieser ebenfalls wieder entfernt.

source: Permitted only on sockets of local displays and the global socket.
de: Nur erlaubt bei Sockets für lokale Displays und für den globalen Socket.

source: Switch to a particular VT (virtual terminal). The VT may be specified either directly (&eg; <parameter>vt3</parameter>) or by a display using it (eg; <parameter>:2</parameter>).
de: Wechselt zu einem bestimmten VT (Virtuellen Terminal). Das VT kann entweder direkt angegebenen werden (&eg; <parameter>vt3</parameter>) oder über den Display, auf dem es benutzt wird (&eg; <parameter>:2</parameter>).

source: List available boot options.
de: Zeigt alle verfügbaren Boot-Optionen an.

source: The return value contains these tokens:
de: Der Rückgabewert enthält diese Bestandteile:

source: A list of boot options (as shown in &kdm; itself).
de: Eine Liste der Boot-Optionen (wie in &kdm; selbst angezeigt).

source: The default boot option.
de: Die Standard-Boot-Option.

source: The current boot option.
de: Die aktuelle Boot-Option.

source: The default and current option are zero-based indices into the list of boot options. If either one is unset or not determinable, it is -1.
de: Die Optionen für Standard und Aktuell stellen nullbasierte Indizes in der Liste der Boot-Optionen dar. Ist einer der Werte nicht gesetzt oder kann nicht bestimmt werden, wird -1 angenommen.

source: Request a system shutdown, either a reboot or a halt/poweroff.
de: Das System erhält die Aufforderung zum Herunterfahren, entweder als reboot oder halt/poweroff.

source: An OS choice for the next boot may be specified from the list returned by <command>listbootoptions</command>
de: Aus der Liste, die von <command>listbootoptions</command> zurückgegeben wird, kann das Betriebssystem für den nächsten Rechnerstart angegeben werden

source: Shutdowns requested from per-display sockets are executed when the current session on that display exits. Such a request may pop up a dialog asking for confirmation and/or authentication
de: Anfragen zum Herunterfahren des Systems, die von Display-spezifischen Sockets ausgehen, werden ausgeführt, sobald die Sitzung auf diesem Display beendet wird. Bei dieser Anfrage kann ein Dialog erscheinen, der nach einer Bestätigung oder Authentifizierung fragt

source: <parameter>start</parameter> is the time for which the shutdown is scheduled. If it starts with a plus-sign, the current time is added. Zero means immediately.
de: <parameter>start</parameter> gibt den Zeitpunkt an, zu dem das System heruntergefahren werden soll. Beginnt dieser Wert mit einem Pluszeichen, wird die aktuelle Uhrzeit hinzuaddiert. Eine Null bedeutet <quote>Sofort</quote>.
