Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kde-workspace/kdm.po
Languages: de

source: Allow Shutdown
de: Herunterfahren zulassen

source: Use this drop down box to choose who is allowed to shut down:
de: Mit diesem Auswahlfeld können sie festlegen, wer das System herunterfahren darf:

source: <guilabel>Nobody</guilabel>: No one can shutdown the computer using &kdm;. You must be logged in, and execute a command.
de: <guilabel>Niemand</guilabel>: Niemand kann das System mit &kdm; herunterfahren. Sie müssen angemeldet sein und einen entsprechenden Befehl eingeben.

source: <guilabel>Everybody</guilabel>: Everyone can shutdown the computer using &kdm;.
de: <guilabel>Jeder</guilabel>: Jeder kann das System mit &kdm; herunterfahren.

source: <guilabel>Only Root</guilabel>: &kdm; requires that the <systemitem>root</systemitem> password be entered before shutting down the computer.
de: <guilabel>Nur Systemverwalter</guilabel>: &kdm; erfordert, dass das <systemitem>root</systemitem>-Passwort eingegeben wird, bevor der Rechner heruntergefahren werden kann.

source: You can independently configure who is allowed to issue a shutdown command for the <guilabel>Local:</guilabel> and <guilabel>Remote:</guilabel> users.
de: Diese Einstellungen können separat für lokale Benutzer und für Benutzer, die über einen <guilabel>Fremdrechner</guilabel> angemeldet sind, vorgenommen werden.

source: Commands
de: Befehle

source: Use these text fields to define the exact shutdown command.
de: In diesen Textfeldern können Sie die Befehle zum Herunterfahren spezifizieren.

source: The <guilabel>Halt:</guilabel> command defaults to <command>/sbin/halt</command>. The <guilabel>Reboot:</guilabel> command defaults to <command>/sbin/reboot</command>.
de: Der Befehl <guilabel>System herunterfahren</guilabel> hat die Voreinstellung <command>/sbin/halt</command>, der Befehl <guilabel>Neustart</guilabel> die Voreinstellung <command>/sbin/reboot</command>.

source: When <guilabel>Boot manager</guilabel> is set to <guilabel>Grub</guilabel> or <guilabel>Lilo</guilabel>, &kdm; will on reboot offer you options for these boot managers. Note that this option is not available on all operating systems.
de: Wenn als <guilabel>Boot-Manager</guilabel> <guilabel>Grub</guilabel> oder <guilabel>Lilo</guilabel> eingestellt ist, werden beim Neustart Optionen für diese Bootmanager angezeigt. Beachten Sie, dass diese Option nicht auf allen Betriebssystem verfügbar ist.

source: Users
de: Benutzer

source: From here you can change the way users are represented in the login window.
de: Hier können Sie einstellen wie die Benutzer im Anmeldungsfenster dargestellt werden.

source: Independently of the users you specify by name, you can use the <guilabel>System UIDs</guilabel> to specify a range of valid <acronym>UID</acronym>s that are shown in the list. By default user id's under 1000, which are often system or daemon users, and user id's over 30000, are not shown.
de: Unabhängig von den namentlich gelisteten Benutzern können Sie einen Bereich der numerischen <guilabel>System-Benutzerkennungen (UIDs)</guilabel> festlegen der in der Liste angezeigt werden soll. Die Voreinstellung schließt <acronym>UID</acronym>s unterhalb von 1000 aus, da diese häufig Dämonen oder Systemdienste sind. Gleichfalls werden UIDs größer als 30000 nicht angezeigt.

source: You may disable the user list in &kdm; entirely in the <guilabel>Users</guilabel> section. You can choose from:
de: Sie können die Benutzerliste im Abschnitt <guilabel>Benutzer</guilabel> von &kdm; ganz ausblenden. Sie haben folgende Wahlmöglichkeiten:

source: Show list
de: Benutzerliste anzeigen

source: Only show users you have specifically not excluded in the list alongside
de: Zeigt nur Benutzer an, die in der nebenstehenden Liste nicht ausgeschlossen sind.

source: If you do not check this box, no list will be shown. This is the most secure setting, since an attacker would then have to guess a valid login name as well as a password. It is also the preferred option if you have more than a handful of users to list, or the list itself would become unwieldy.
de: Wenn Sie das Ankreuzfeld nicht markieren, wird keine Liste angezeigt. Das ist die sicherste Einstellung, da ein Angreifer erst einen gültigen Benutzernamen und ein gültiges Passwort finden muss. Außerdem ist es eine gute Einstellung, wenn Sie zahlreiche Benutzer auf diesem System haben - die Liste kann sonst unübersichtlich werden.

source: Autocompletion
de: Autom. Vervollständigung

source: If this option is checked, &kdm; will automatically complete user names while they are typed in the line edit.
de: Wenn diese Einstellung aktiv ist, wird den Benutzernamen beim Eintippen automatisch vervollständigen.

source: Inverse selection
de: Umgekehrte Auswahl

source: Allows you to instead select a list of users that should be shown, and all other users will <emphasis>not</emphasis> be listed.
de: Mit dieser Einstellung können Sie aus einer Liste die Benutzer auswählen, die<emphasis>nicht</emphasis> angezeigt werden sollen. Alle anderen werden angezeigt.

source: You can also enable the <guilabel>Sort users</guilabel> checkbox, to have the user list sorted alphabetically. If this is disabled, users will appear in the order they are listed in the password file. &kdm; will also autocomplete user names if you enable the <guilabel>Autocompletion</guilabel> option.
de: Sie können auch die Option <guilabel>Benutzer sortieren</guilabel> ankreuzen, um die Benutzer in alphabetischer Reihenfolge anzuzeigen. Ist diese Einstellung nicht markiert, werden die Benutzer in der Reihenfolge angezeigt, in der sie in der Passwortdatei stehen. Wenn Sie die Einstellung <guilabel>Autom. Vervollständigung</guilabel> eingeschaltet haben, vervollständigt &kdm; Benutzernamen.

source: If you choose to show users, then the login window will show images (which you select), of a list of users. When someone is ready to login, they may select their user name/image, enter their password, and they are granted access.
de: Wenn Sie die Benutzer anzeigen lassen, zeigt das Anmeldungsfenster eine Liste mit (wählbaren) Bilder für die Benutzer an. Wenn sich jemand anmelden möchte, kann er seinen Benutzernamen oder sein Bild anklicken, das Passwort eingeben und wird dann angemeldet.

source: If you permit a user image, then you can configure the <guilabel> User Image Source</guilabel>:
de: Wenn Sie Benutzerbilder zulassen, dann können Sie die <guilabel>Quelle für Benutzerbild</guilabel> einstellen:

source: Here you can specify where &kdm; will obtain the images that represent users. <guilabel>System</guilabel> represents the global folder; these are the pictures you can set below. <guilabel>User</guilabel> means that &kdm; should read the user's <filename>$<envar>HOME</envar>/.face.icon</filename> file. The two selections in the middle define the order of preference if both sources are available.
de: Hier können Sie angeben, woher &kdm; die Bilder für die Benutzer bezieht. <guilabel>System</guilabel> steht für den globalen Ordner, Sie sehen die Bilder weiter unten aufgeführt. <guilabel>Benutzer</guilabel> bedeutet, dass &kdm; das Bild aus der Datei <filename>$<envar>HOME</envar>/.face.icon</filename> lädt. Mit den beiden mittleren Einstellungen können Sie bestimmen, in welcher Reihenfolge das Vorhandensein der Bilddateien geprüft wird.

source: If you choose not to show users, then the login window will be more traditional. Users will need to type their username and password to gain entrance. This is the preferred way if you have many users on this terminal.
de: Wenn Sie die Benutzerliste nicht anzeigen, ist das Erscheinungsbild des Anmeldefensters eher traditionell. Benutzer müssen ihren Benutzernamen und ihr Passwort eingeben, um sich anzumelden. Bei sehr vielen Benutzern wird diese Option empfohlen.

source: Convenience
de: Vereinfachung

source: In the <guilabel>Convenience</guilabel> tab you can configure some options that make life easier for lazy people, like automatic login or disabling passwords.
de: Auf der Karteikarte <guilabel>Vereinfachung</guilabel> können Sie Ihr Leben einfacher gestalten. Hier lässt sich die automatische Anmeldung einstellen und hier können Passwörter abgeschaltet werden.

source: Please think more than twice before using these options. Every option in the <guilabel>Convenience</guilabel> tab is well-suited to seriously compromise your system security. Practically, these options are only to be used in a completely non-critical environment, &eg; a private computer at home.
de: Diese Einstellungen sollte man sich genau überlegen. Alle Optionen im Reiter<guilabel>Vereinfachung</guilabel> können die Sicherheit Ihres Systems schwer beeinträchtigen. Im Normalfall sollten diese Optionen nur in einer absolut unkritischen Umgebung benutzt werden - &eg; bei einem Privatcomputer Zuhause.

source: Automatic Login
de: Automatische Anmeldung

source: Automatic login will give anyone access to a certain account on your system without doing any authentication. You can enable it using the option <guilabel>Enable Auto-Login</guilabel>.
de: Automatische Anmeldung ermöglicht jedem den Zugang zu einem bestimmten Benutzerkonto auf Ihrem System - ohne irgendeine Überprüfung. Dies kann über die Option <guilabel>Automatische Anmeldung erlauben</guilabel> eingeschaltet werden.

source: You can choose the account to be used for automatic login from the list labeled <guilabel>User:</guilabel>.
de: Das dafür zugelassene Benutzerkonto können sie aus der Liste <guilabel>Benutzer:</guilabel>auswählen.

source: With <guilabel>Lock session</guilabel> the automatically started session will be locked immediately (provided it is a &kde; session). This can be used to obtain a super-fast login restricted to one user.
de: Mit der Einstellung <guilabel>Sitzung sperren</guilabel> wird die automatisch gestartete Sitzung sofort gesperrt (sofern es sich um eine &kde;-Sitzung handelt). Auf diese Weise ist eine sehr schnelle Anmeldung möglich (beschränkt auf einen Benutzer).

source: Automatic login can be suppressed by pressing the &Shift; key immediately after the &X-Server; switches to graphics mode and releasing it when &kdm;'s hourglass cursor appears.
de: Die automatische Anmeldung kann durch Betätigen der &Shift;taste direkt nachdem der &X-Server; in den grafischen Modus gewechselt ist unterdrückt werden. Sie können die &Shift;taste wieder loslassen, wenn der Stundenglas-Mauszeiger von &kdm; erscheint.

source: Preselected User
de: Vorausgewählter Benutzer

source: You can also choose which user is <quote>preselected</quote> when &kdm; starts. The default is <guilabel>None</guilabel>, but you can choose <guilabel>Previous</guilabel> to have &kdm; default to the last successfully logged in user, or you can <guilabel>Specify</guilabel> a particular user to always be selected from the list. You can also have &kdm; set the focus to the password field, so that when you reach the &kdm; login screen, you can type the password immediately.
de: Sie können auch auswählen welcher Benutzer beim Start von &kdm; zunächst <quote>vorgeschlagen</quote> wird. Als Voreinstellung steht <guilabel>Keiner</guilabel>.Die Option <guilabel>Vorheriger</guilabel> schlägt automatisch den bei der letzten erfolgreichen Anmeldung verwendeten Namen vor. Es ist auch möglich immer einen bestimmten Benutzer vorzuschlagen. Zusätzlich kann &kdm; den Cursor in das Passwort-Feld setzen - dann können Sie bei Anzeige des Anmeldefensters sofort Ihr Passwort eingeben.

source: Password-Less Login
de: Anmeldung ohne Passwort

source: Using this feature, you can allow certain users to login without having to provide their password. Enable this feature using the <guilabel>Enable Password-Less Logins</guilabel> option.
de: Mit dieser Option können sich bestimmte Benutzer ohne Passwort anmelden. Diese Funktion wird über <guilabel>Anmeldung ohne Passwort zulassen</guilabel> aktiviert.

source: Below this option you'll see a list of users on the system. Enable password-less login for specific users by checking the checkbox next to the login names. By default, this feature is disabled for all users.
de: Unterhalb dieser Einstellung sehen Sie eine Liste mit Benutzern des Systems. Benutzer die sich ohne Passwort anmelden können, können dort angekreuzt werden. In Normaleinstellung ist keiner der Benutzer angekreuzt.

source: Again, this option should only be used in a safe environment. If you enable it on a rather public system you should take care that only users with heavy access restrictions are granted password-less login, &eg; <systemitem>guest</systemitem>.
de: Wie gesagt, sollte diese Option nur in einer sicheren Umgebung verwendet werden. Wird sie in einem eher öffentlich zugänglichen System verwendet, dann sollten Sie sicherstellen, dass sie nur bei Benutzerkonten mit niedrig gesetzten Zugriffsrechten eingesetzt wird - &eg; beim Konto <systemitem>guest</systemitem>.

source: The <guilabel>Automatically login after X server crash</guilabel> option allows you to skip the authentication procedure when your X server accidentally crashed.
de: Die Option <guilabel>Nach Absturz des X-Servers automatisch wieder anmelden</guilabel> überspringt die Anmeldeprozedur falls ihr X-Server unbeabsichtigt abstürzt.

source: Configuring your system to use &kdm;
de: Ihr System für die Benutzung von &kdm; einrichten

source: This chapter assumes that your system is already configured to run the &X-Window;, and that you only need to reconfigure it to allow graphical login.
de: Für dieses Kapitel wird vorausgesetzt, dass Ihr System bereits für das X Window System eingerichtet ist und das Sie es nur noch für eine grafische Anmeldung einstellen müssen.

source: Setting up &kdm;
de: &kdm; einstellen

source: The fundamental thing that controls whether your computer boots to a terminal prompt (console mode) or a graphical login prompt is the default runlevel. The runlevel is set by the program <application> <ulink url="man:init">/sbin/init</ulink></application> under the control of the configuration file <filename>/etc/inittab</filename>. The default runlevels used by different &UNIX; systems (and different &Linux; distributions) vary, but if you look at <filename>/etc/inittab</filename> the start of it should be something like this:
de: Der Standard-Runlevel bestimmt, ob Ihr Systemstart mit einer Eingabeaufforderung auf einem Terminal (Konsolen-Modus) endet oder mit einer grafischen Eingabeaufforderung wie &kdm;. Der Runlevel wird vom Programm <application><ulink url="man:init">/sbin/init</ulink></application> gesetzt, das die Datei <filename>/etc/inittab</filename> benutzt. Die Standard-Runlevel, die von verschiedenen Unix-Systemen (und Linux-Distributionen) benutzt werden, sind unterschiedlich, aber wenn Sie die Datei <filename>/etc/inittab</filename> betrachten, sollte der Anfang dieser Datei in etwa so aussehen:

source: All but the last line of this extract are comments. The comments show that runlevel 5 is used for X11 and that runlevel 3 is used for multi-user mode without X11 (console mode). The final line specifies that the default runlevel of the system is 3 (console mode). If your system currently uses graphical login (for example, using &xdm;) its default runlevel will match the runlevel specified for X11.
de: Alle Zeilen dieses Auszuges bis auf die letzte sind Kommentare. Die Kommentare zeigen, dass Runlevel 5 für X11 benutzt wird und Runlevel 3 für den Mehrfachbenutzermodus ohne X11 (Konsolen-Modus). Die letzte Zeile legt fest, dass der Standard-Runlevel des Systems 3 ist (Konsolen-Modus). Wenn Ihr System zurzeit eine grafische Eingabeaufforderung benutzt (&eg; &xdm;), wird sein Standard-Runlevel dem für X11 entsprechen.

source: The runlevel with graphical login (&xdm;) for some common &Linux; distributions is:
de: Der Runlevel mit grafischer Eingabeaufforderung (&xdm;) hat für einige gebräuchliche Linux-Distributionen folgende Werte:

source: 5 for &RedHat; 3.x and later, and for &Mandrake;
de: 5 für &RedHat; ab 3.x und für &Mandrake;

source: 4 for Slackware
de: 4 für Slackware

source: 3 for &SuSE;. 4.x and 5.x
de: 3 für &SuSE; 4.x, und 5.x

source: The first step in configuring your system is to ensure that you can start &kdm; from the command line. Once this is working, you can change your system configuration so that &kdm; starts automatically each time you reboot your system.
de: Der erste Schritt für Ihr System ist, sicherzustellen, dass Sie &kdm; von der Befehlszeile aus starten können. Wenn das funktioniert, können Sie Ihr System so einrichten, dass &kdm; automatisch bei jedem System(neu)start startet.

source: To test &kdm;, you must first bring your system to a runlevel that does not run &xdm;. To do so, issue a command like this:
de: Um &kdm; zu testen, müssen Sie Ihr System zuerst in einen Runlevel bringen, in dem &xdm; nicht läuft. Dazu müssen Sie einen Befehl wie den folgenden geben:

source: Instead of the number <option>3</option> you should specify the appropriate runlevel for console mode on your system.
de: Anstelle der Zahl <option>3</option> müssen Sie den entsprechenden Wert für den Konsolen-Modus auf Ihrem System benutzen.

source: If your system uses Pluggable Authentication Modules (<abbrev>PAM</abbrev>), which is normal with recent &Linux; and &Solaris; systems, you should check that your <abbrev>PAM</abbrev> configuration permits login through the service named <literal>kde</literal>. If you previously used &xdm; successfully, you should not need to make any changes to your <abbrev>PAM</abbrev> configuration in order to use &kdm;. <filename>/etc/pam.conf</filename> or <filename>/etc/pam.d/kde</filename>. Information on configuring <abbrev>PAM</abbrev> is beyond the scope of this handbook, but <abbrev>PAM</abbrev> comes with comprehensive documentation (try looking in <filename>/usr/share/doc/*pam*/html/</filename>).
de: Wenn Ihr System Pluggable Authentication Modules (<abbrev>PAM</abbrev>) benutzt, was bei den meisten modernen &Linux;- und Solaris-Systemen der Fall ist, sollten Sie prüfen, ob Ihre <abbrev>PAM</abbrev>-Einstellungen das Anmelden mit einem Dienst namens<literal>kde</literal> erlauben. Wenn Sie &xdm; bereits vorher erfolgreich benutzt haben, müssen Sie Ihre <abbrev>PAM</abbrev>-Einstellungen nicht ändern, um &kdm; benutzen zu können (<filename>/etc/pam.conf</filename> oder <filename>/etc/pam.d/kde</filename>). Hinweise zur Einrichtung von <abbrev>PAM</abbrev> würden den Rahmen dieses Handbuches sprengen, aber zu <abbrev>PAM</abbrev> gibt es eine umfangreiche Dokumentation.(siehe auch <filename>/usr/share/doc/*pam*/html/</filename>).

source: Now it's time for you to test &kdm; by issuing the following command:
de: Jetzt sollten Sie &kdm; mit dem folgenden Befehl testen:

source: If you get a &kdm; login dialog and you are able to log in, things are going well. The main thing that can go wrong here is that the run-time linker might not find the shared &Qt; or &kde; libraries. If you have a binary distribution of the &kde; libraries, make sure &kdm; is installed where the libraries believe &kde; is installed and try setting some environment variables to point to your &kde; and &Qt; libraries.
de: Wenn Sie das &kdm;-Anmeldefenster sehen und sich anmelden können, ist alles in Ordnung. Das Schlimmste, was hier passieren kann, ist dass der Laufzeit-Linker die shared libraries für &Qt; oder &kde; nicht findet. Wenn Sie eine binäre Distribution der &kde;-Bibliotheken installiert haben, stellen Sie sicher, dass &kdm; dort installiert ist, wo die Bibliotheken die anderen Bestandteile von &kde; vermuten und setzen Sie die Umgebungsvariablen, die auf Ihre &kde;- und &Qt;-Bibliotheken zeigen.

source: For example:
de: Zum Beispiel:

source: If you are still unsuccessful, try starting &xdm; instead, to make sure that you are not suffering from a more serious X configuration problem.
de: Wenn Sie noch immer keinen Erfolg haben, versuchen Sie, stattdessen &xdm; zu starten um sicherzustellen, dass kein grundlegenderes Problem mit den X-Einstellungen dahinter steckt.

source: When you are able to start &kdm; successfully, you can start to replace &xdm; by &kdm;. Again, this is distribution-dependent.
de: Wenn Sie &kdm; erfolgreich starten können, ersetzen Sie &xdm; durch &kdm;. Dies ist wieder je nach Distribution unterschiedlich.

source: For &RedHat;, edit <filename>/etc/inittab</filename>, look for this line:
de: Bei einer &RedHat;.-Distribution bearbeiten Sie in <filename>/etc/inittab</filename>, diese Zeile:

source: and replace with:
de: und ersetzen Sie diese durch:

source: This tells <command>init</command>(8) to respawn &kdm; when the system is in run level 5. Note that &kdm; does not need the <option>-nodaemon</option> option.
de: Dadurch wird <command>init</command> dazu veranlasst &kdm; neu zu starten, wenn sich das System im Runlevel 5 befindet. Beachten Sie, dass &kdm; die Option <option>-nodaemon</option> nicht benötigt.

source: For &Mandrake;, the X11 runlevel in <filename>/etc/inittab</filename> invokes the shell script <filename>/etc/X11/prefdm</filename>, which is set up to select from amongst several display managers, including &kdm;. Make sure that all the paths are correct for your installation.
de: Bei einer &Mandrake;-Distribution wird im X11 Runlevel in <filename>/etc/inittab</filename> das Shellskript <filename>/etc/X11/prefdm</filename> aufgerufen. In diesem Skript wird ausgewählt, welcher Anmeldungsmanager (unter anderem &kdm;) benutzt wird. Stellen Sie sicher, dass alle Verzeichnispfade korrekt sind.

source: For &SuSE;, edit <filename>/sbin/init.d/xdm</filename> to add a first line:
de: Bei einer&SuSE; -Distribution müssen Sie in der Datei <filename>/sbin/init.d/xdm</filename> ganz am Anfang die folgende Zeilen hinzufügen:

source: For FreeBSD, edit <filename>/etc/ttys</filename> and find the line like this:
de: Bei FreeBSD bearbeiten Sie <filename>/etc/ttys</filename> und suchen Sie die folgende Zeile:

source: and edit it to this:
de: und ändern Sie diese wie folgt:

source: Most other distributions are a variation of one of these.
de: Bei den meisten anderen Distributionen wird die Einrichtung auf eine vergleichbare Art vorgenommen.

source: At this stage, you can test &kdm; again by bringing your system to the runlevel that should now run &kdm;. To do so, issue a command like this:
de: Nun können Sie &kdm; testen, indem Sie Ihr System auf den Runlevel für die grafische Anmeldung bringen. Geben Sie auf der Befehlszeile folgenden Befehl ein:

source: Instead of the number <option>5</option> you should specify the appropriate runlevel for running X11 on your system.
de: Anstelle der Zahl <option>5</option> nehmen Sie den entsprechenden Wert für den Runlevel auf Ihrem System, der X11 startet.

source: The final step is to edit the <parameter>initdefault</parameter> entry in <filename>/etc/inittab</filename> to specify the appropriate runlevel for X11.
de: Als letzten Schritt müssen Sie den Parameter <parameter>initdefault</parameter> in der Datei <filename>/etc/inittab</filename> ändern. Geben Sie hier den Runlevel an, der X11 startet.

source: Before you make this change, ensure that you have a way to reboot your system if a problem occurs. This might be a <quote>rescue</quote> floppy-disk provided by your operating system distribution or a specially-designed <quote>rescue</quote> floppy-disk, such as <literal>tomsrtbt</literal>. Ignore this advice at your peril.
de: Bevor Sie diese Änderungen durchführen, sollten Sie sicherstellen, dass Sie ihr System neu starten können, falls ein Problem auftritt. Dies kann in Form einer <quote>Rettungs</quote>-Bootdiskette Ihrer Distribution oder auch durch ein spezielles <quote>Rettungssystem</quote> wie etwa <literal>tomsrtbt</literal> geschehen. Bitte nehmen Sie diese Warnung ernst.
