Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kde-workspace/kdm.po
Languages: de

source: The <guilabel>General:</guilabel> font is used in all other places in the login window.
de: Die Schriftart <guilabel>Allgemein</guilabel> wird überall sonst im Anmeldefenster verwendet.

source: The <guilabel>Failure:</guilabel> font is used when a login fails.
de: Die Schriftart <guilabel>Fehlversuche</guilabel> wird verwendet, wenn eine Anmeldung fehlschlägt.

source: The <guilabel>Greeting:</guilabel> font is the font used for the title (Greeting String).
de: Die Schriftart <guilabel>Begrüßung</guilabel> wird für den Titel (Begrüßungstext) verwendet.

source: You can also check the box labeled <guilabel>Use anti-aliasing for fonts</guilabel> if you want smoothed fonts in the login dialog.
de: Sie können hier auch das Ankreuzfeld <guilabel>Kantenglättung für Schriftdarstellung verwenden</guilabel> markieren, wenn Sie geglättete Schriften im Anmeldefenster sehen möchten.

source: From this page you can change the visual appearance of &kdm;, &kde;'s graphical login manager in non themed mode.
de: Auf dieser Seite kann das Erscheinungsbild von &kdm;, &kde;s Anmeldungs-Managers festgelegt werden wenn kein Design verwendet wird.

source: The <guilabel>Greeting:</guilabel> is the title of the login screen. Setting this is especially useful if you have many servers users may log in to. You may use various placeholders, which are described along with the corresponding key <link linkend="option-greetstring"><option>GreetString</option></link> in &kdmrc;.
de: Der <guilabel>Begrüßungstext:</guilabel> ist der Titel des Anmeldungsfensters. Sie können hier verschiedene Platzhalter verwenden, die zusammen mit dem dazugehörigen Schlüssel <link linkend="option-greetstring"><option>GreetString</option></link> in &kdmrc; beschrieben sind.

source: You can then choose to show either the current system time, a logo or nothing special in the login box. Make your choice in the radio buttons labeled <guilabel>Logo area:</guilabel>. This corresponds to <link linkend="option-logoarea"><option>LogoArea</option></link> in &kdmrc;
de: Sie können dann auswählen ob die aktuelle Systemzeit, ein Logo oder gar nichts im Anmeldefenster angezeigt wird. Auswählen können Sie diese Optionen im <guilabel>Logo-Bereich</guilabel>. Mit der Einstellung <guilabel>Position</guilabel> können Sie den Inhalt des Logo-Bereichs zentrieren oder auf feste Koordinaten einstellen. Das entspricht der Einstellung <link linkend="option-logoarea"><option>Logo-Bereich</option></link> in &kdmrc;

source: If you chose <guilabel>Show logo</guilabel> you can now choose a logo:
de: Wenn Sie <guilabel>Logo anzeigen</guilabel> einstellen, können Sie nun ein Logo auswählen:

source: Drop an image file on the image button.
de: Ziehen Sie eine Bilddatei auf den Bildknopf.

source: Click on the image button and select a new image from the image chooser dialog.
de: Klicken Sie auf den Bildknopf und wählen Sie ein Bild mittels des Auswahldialogs.

source: If you do not specify a logo, the default <filename>$<envar>KDEDIR</envar>/share/apps/kdm/pics/kdelogo.xpm</filename> will be displayed.
de: Wenn Sie kein Logo auswählen, wird das Standardlogo <filename>$<envar>KDEDIR</envar>/share/apps/kdm/pics/kdelogo.xpm</filename> angezeigt.

source: Normally the login box is centered on the screen. Drag the anchor to move the center of the dialog to the desired position. Keyboard control is possible as well: Use the arrow keys or <keycap>Home</keycap> to center. Note that the actual proportions of the dialog are probably different. These correspond to the key <link linkend="option-greeterpos"><option>GreeterPos</option></link> in &kdmrc;.
de: Normalerweise wird das Anmeldefenster in der Mitte des Bildschirms angezeigt. Durch Ziehen des Ankers können Sie die mittlere Position des Dialogs festlegen. Sie können dazu auch die Tastatur verwenden: Betätigen Sie die Pfeil-Tasten oder <keycap>Pos 1</keycap>, um den Anker in die Mitte zu bringen. Hinweis: Die tatsächlichen Proportionen können abweichen. Das entspricht dem Eintrag <link linkend="option-greeterpos"><option>GreeterPos</option></link> in &kdmrc;.

source: <title>Background</title>
de: <title>Hintergrund</title>

source: Here you can change the desktop background which will be displayed before a user logs in. Selecting <guilabel>Enable background</guilabel> allows you to edit the options on this tab.
de: Hier können Sie den Arbeitsflächen-Hintergrund ändern, der angezeigt wird, bevor der Benutzer sich anmeldet. Wählen Sie <guilabel>Hintergrund aktivieren</guilabel>, dann können die Einstellungen auf dieser Karteikarte geändert werden.

source: This tab is comprised of three areas:
de: Diese Karteikarte enthält drei Bereiche:

source: An area for selecting background images
de: Bereich zum Auswählen von Hintergrundbildern.

source: The background Preview Monitor
de: Vorschaumonitor für den Hintergrund.

source: An area for determining the background color
de: Bereich zum Einstellen der Hintergrundfarbe.

source: Preview Monitor
de: Vorschaumonitor

source: This is a preview window. It will give you a sense of what to expect with each change.
de: Dieser Vorschaufenster gibt Ihnen einen Eindruck, was die vorgenommenen Änderungen bewirken.

source: <guilabel>Background</guilabel>
de: <guilabel>Hintergrund</guilabel>

source: This section allows you to load a wallpaper on top of the color gradient chosen in the section below.
de: &kde; ermöglicht hier das Laden von Hintergrundbildern, die über Farbverläufen angezeigt werden.

source: There are three choices available here:
de: Hier stehen drei Möglichkeiten zur Auswahl:

source: No Picture
de: Kein Hintergrundbild

source: No picture background will be shown. The color and pattern choices below will still take effect.
de: Es wird kein Hintergrundbild angezeigt. Die Auswahl von Farbe und Muster gleich darunter wird als Hintergrund verwendet.

source: Picture
de: Bild

source: A single picture will be used as the background for the selected desktops.
de: Ein einzelnes Bild wird als Hintergrund für die ausgewählten Arbeitsflächen verwendet.

source: How this picture is positioned and scaled can be fine tuned below.
de: Gleich unterhalb kann eingestellt werden, wie das Bild angeordnet und skaliert wird.

source: Slide show
de: Diaschau

source: &kde; allows you to have an automatic slide show of wallpaper images. To enable this option, press the <guibutton>Setup...</guibutton> button. In the resulting dialog you may choose any image or folder of images available on your computer, using the <guibutton>Add...</guibutton> button to navigate your file system. <guibutton>Remove</guibutton> will remove the currently selected entry from the list.
de: &kde; gestattet die Einrichtung einer Diaschau mit Hintergrundbildern. Zum Einrichten dieser Option drücken Sie den Knopf <guibutton>Einrichtung</guibutton>. Im sich dann öffnenden Dialogfenster können Sie dann jedes Bild oder ein auf Ihrem Computer verfügbares Verzeichnis mit Bildern hinzufügen, indem Sie auf den Knopf <guibutton>Hinzufügen ...</guibutton> klicken, es wird dann ein Dateiauswahlfenster geöffnet. Klicken auf <guibutton>Entfernen</guibutton> löscht den aktuell ausgewählten Eintrag aus der Liste.

source: You may choose the length of time any image is displayed in the <guilabel>Change picture after:</guilabel> box, and you may choose <guibutton>Show pictures in random order</guibutton> if you don't want them displayed in the order they are listed.
de: Sie können die Zeitdauer zwischen den Bildwechseln im Drehfeld <guilabel>Bild wechseln nach:</guilabel> einstellen und Sie können einstellen, ob die Bilder so wie in der Liste angezeigt der Reihe nach oder in zufälliger Reihenfolge angezeigt werden sollen.

source: Displaying wallpaper requires that the image be kept in memory. If you are low on memory, using a small, tiled image or none at all is recommended.
de: Das Anzeigen des Bildes erfordert, das dieses Bild im Speicher gehalten wird. Wenn Sie nur wenig Hauptspeicher zur Verfügung haben, benutzen Sie ein kleines gekacheltes Bild oder besser: Arbeiten Sie ganz ohne Hintergrundbild.

source: Scaling or centering a small image still requires an image the size of your display to be maintained in memory.
de: Skalieren oder Zentrieren eines kleinen Bildes erfordert trotzdem das Speichern eines Bildes in der Größe Ihres Bildschirmes im Hauptspeicher.

source: Options
de: Optionen

source: Centered
de: Zentriert

source: The image will be centered on the screen without changing the size of the image. The background colors will be present anywhere the image does not cover.
de: Das Bild wird auf dem Bildschirm zentriert in unveränderter Größe angezeigt. Die Hintergrundfarben sind dort sichtbar, wo das Bild den Bildschirm nicht überdeckt.

source: Tiled
de: Gekachelt

source: The image will be duplicated until it fills the entire desktop. The first image will be placed in the upper left corner of the screen, and duplicated downward and to the right.
de: Das Bild wird so oft dupliziert bis der gesammte Desktop bedeckt ist. Das erste Bild wird dabei in der linken oberen Ecke des Bildschirms plaziert, danach nach unten und nach rechts erneut angefügt.

source: Center Tiled
de: Zentriert gekachelt

source: The image will be duplicated until it fills the entire desktop. The first image will be placed in the center of the screen, and duplicated upward, downward to the right, and to the left.
de: Das Bild wird so oft dupliziert bis der gesammte Desktop bedeckt ist. Das erste Bild wird dabei in der Mitte des Bildschirms plaziert, danach nach Oben, Unten, Links und Rechts erneut angefügt.

source: Centered Maxpect
de: Zentriert und skaliert (korrektes Seitenverhältnis)

source: The image will be placed in the center of the screen. It will be scaled to fit the desktop, but it will not change the aspect ratio of the original image. This will provide you with an image that is not distorted.
de: Das Bild wird in der Mitte des Bildschirms plaziert. Es wird skaliert um den Desktop zu füllen, aber das Seitenverhältnis bleibt erhalten. Dadurch wird das Bild nicht verzerrt.

source: Tiled Maxpect
de: Gekachelt (korrektes Seitenverhältnis)

source: The image will be placed in the corner of the screen. It will be scaled to fit the desktop, but it will not change the aspect ratio of the original image. This will provide you with an image that is not distorted. If there is any space over, the image will be duplicated to fill it.
de: Das Bild wird in der Mitte des Bildschirms platziert und dann so lange vergrößert, bis es entweder in der Höhe oder der Breite den gesamten Bildschirm ausfüllt. Das Verhältnis von Höhe zu Breite des Bildes bleibt hier unverändert. Wenn dann noch Platz frei ist, wird das Bild wiederholt, um diesen Platz zu füllen.

source: Scaled
de: Skaliert

source: The image will be scaled to fit the desktop. It will be stretched to fit to all four corners. This may distort the image.
de: Das Bild wird in diesem Modus so vergrößert, dass es den Hintergrund ausfüllt. Die Vergrößerung erfolgt für Höhe und Breite unabhängig und dies kann das Bild verfälschen.

source: Centered Auto fit
de: Zentriert mit autom. Anpassung

source: If the picture fits the desktop size, this mode works like the centered option. If the picture is larger than the desktop then it is scaled down to fit while keeping the aspect ratio.
de: Wenn das Bild auf die Arbeitsfläche passt, dann wird es wie bei der Option Zentriert in Bildschirmmitte platziert. Wenn das Bild größer ist als die Arbeitsfläche, dann wird es unter Beibehaltung der Seitenverhältnisse verkleinert, sodass es auf die Arbeitsfläche passt.

source: Scale &amp; Crop
de: Skaliert und beschnitten

source: Magnify the picture without distorting it until it fills both the width and height of the desktop (cropping the picture if necessary), and then center it on the desktop.
de: Vergrößert das Bild ohne es zu verzerren solange, bis das Bild Breite und Höhe der Arbeitsfläche ausfüllt. Dabei wird das Bild wenn nötig beschnitten. Die Bildmitte wird dann mittig auf der Arbeitsfläche platziert.

source: Colors:
de: Farben:

source: The first drop down box allows you to choose the type of color, gradient, or pattern to display under (or in place of) wallpaper.
de: Das erste Auswahlfeld erlaubt die Auswahl der Farbe, des Verlaufs oder des Musters, das unter dem (oder als) Hintergrundbild angezeigt werden soll.

source: If you are going to be using a picture as a wallpaper, you can skip this section of the dialog box.
de: Wenn Sie Bilder als Hintergrund benutzen wollen, können Sie diese Auswahl ignorieren.

source: However, if your chosen wallpaper does not cover the entire desktop, the chosen colors will still show in the remaining space.
de: Wenn jedoch das benutzte Hintergrundbild nicht die gesamte Arbeitsfläche bedeckt, wird der verbleibende Rand in den eingestellten Farben angezeigt.

source: Single Color
de: Durchgehende Farbe

source: By choosing this mode, you select one color using the first color bar, and the entire background is covered with this one color.
de: Für diesen Modus wählen Sie eine Farbe im ersten Auswahlfeld aus und der gesamte Hintergrund wird mit dieser Farbe eingefärbt.

source: Horizontal Gradient
de: Waagerechter Verlauf

source: By choosing this mode, you select two colors (using both color buttons). &kde; will then start with the primary color selected with the left button on the left edge of the screen, and slowly transform into the blend color selected with the right button by the time it gets to the right edge of the screen.
de: Für diesen Modus wählen Sie zwei Farben in den Auswahlfeldern aus. &kde; beginnt am linken Rand des Bildschirms mit der im linken Feld festgelegten primären Farbe und wandelt diese auf dem Weg zum rechten Bildschirmrand langsam in die im rechten Feld gewählte zweite Farbe um.

source: Vertical Gradient
de: Senkrechter Verlauf

source: By choosing this mode, you select two colors (using both color buttons). &kde; will then start with the primary color selected with the left button on the top edge of the screen, and slowly transform into the blend color selected with the right button as it moves to the bottom of the screen.
de: Für diesen Modus wählen Sie zwei Farben in den Auswahlfeldern aus. &kde; beginnt am oberen Rand des Bildschirms mit der im linken Feld festgelegten primären Farbe und wandelt diese auf dem Weg zum unteren Bildschirmrand langsam in die im rechten Feld gewählte zweite Farbe um.

source: Pyramid Gradient
de: Pyramidialer Verlauf

source: By choosing this mode, you select two colors (using both color buttons). &kde; will then start with the primary color selected with the left button in each corner of the screen, and slowly transform into the blend color selected with the right button as it moves to the center of the screen.
de: Für diesen Modus wählen Sie zwei Farben in den Auswahlfeldern aus. &kde; beginnt in jeder Ecke des Bildschirms mit der im linken Feld festgelegten primären Farbe und wandelt diese auf dem Weg zur Mitte des Bildschirms langsam in die im rechten Feld gewählte zweite Farbe um.

source: Pipecross Gradient
de: Röhrenkreuzverlauf

source: By choosing this mode, you select two colors (using both color buttons). &kde; will then start with the primary color selected with the left button in each corner of the screen, and slowly transform into the blend color selected with the right button as it moves to the center of the screen. The shape of this gradient is different than the pyramid gradient.
de: Für diesen Modus wählen Sie zwei Farben in den Auswahlfeldern aus. &kde; beginnt in jeder Ecke des Bildschirms mit der im linken Feld festgelegten primären Farbe und wandelt diese auf dem Weg zur Mitte des Bildschirms langsam in die im rechten Feld gewählte zweite Farbe um. Die Form dieses Verlaufs unterscheidet sich von der des pyramidialen Verlaufs.

source: Elliptic Gradient
de: Elliptischer Verlauf

source: By choosing this mode, you select two colors (using both color buttons). &kde; will then start with the blend color selected with the right button in the center of the screen, and slowly transform into the primary color selected by the left button as it moves to the edges, in an elliptical pattern.
de: Für diesen Modus wählen Sie zwei Farben in den Auswahlfeldern aus. &kde; beginnt in der Mitte des Bildschirms mit der im rechten Feld festgelegten zweiten Farbe und wandelt diese auf dem Weg zu den Bildschirmrändern in elliptischer Form langsam in die im linken Feld gewählte Farbe um.

source: Pattern
de: Muster

source: The rest of the list are the names of various patterns or textures you can choose.
de: Der Rest der Liste enthält die Namen von verschiedenen Mustern, die zur Auswahl stehen.

source: For more on patterns, see the section <link linkend="bkgnd-patterns">Adding, Removing and Modifying Patterns</link>.
de: Weitere Informationen zu Mustern finden Sie unter <link linkend="bkgnd-patterns">Hinzufügen, Entfernen und Ändern von Mustern</link>.

source: Select the primary color with the first color bar. If you have chosen a pattern that requires two colors to be set the secondary color can be set by pressing the appropriate button.
de: Wählen Sie zuerst die primäre Farbe im linken Auswahlfeld und - wenn Sie ein Muster ausgewählt haben, das aus zwei Farben besteht - dann im rechten Auswahlfeld die zweite oder Überblendfarbe.

source: Blending:
de: Überblendung:

source: The drop down box labeled <guilabel>Blending:</guilabel> contains the options to make a smooth transition (blend) from the wallpaper as it changes to the background.
de: Die Einstellung <guilabel>Überblendung</guilabel> enthält die Optionen zur Überblendung des Hintergrundbildes in den Rest des Hintergrundes.

source: A drop down box allows you to select the blending mode. Many of the modes are similar to blending modes for background colors. Select your mode from the list, and the preview window shows you what it will look like.
de: Das Auswahlfeld ermöglicht Ihnen die Auswahl der Überblendmethode. Viele der Überblendmethoden sind denen für die Überblendung zwischen den Hintergrundfarben sehr ähnlich. Wählen Sie einen Modus von der Liste und der Vorschaumonitor zeigt Ihnen, wie es aussehen wird.

source: The <guilabel>Balance</guilabel> slider adjusts the blending. The results can be seen immediately in the preview window.
de: Der Schieberegler <guilabel>Balance:</guilabel> stellt das Überblenden ein. Sie erhalten im Vorschaumonitor wieder einen Eindruck, wie die Einstellung die Anzeige beeinflussen wird.

source: The <guilabel>Reverse roles</guilabel> can reverse the role of the picture and the background for some types of blending.
de: Die Option <guilabel>Umgekehrt</guilabel> kann für einige Überblendarten die Behandlung von Hintergrundmuster und -bild vertauschen.

source: Advanced options
de: Erweiterte Einstellungen

source: Located below the preview monitor is a button labeled <guibutton>Advanced Options</guibutton>.
de: Unter dem Vorschaumonitor gibt es einen Knopf mit dem Namen <guibutton>Erweiterte Einstellungen</guibutton>.

source: To use an external program to determine and change the background of &kde;, simply select <guilabel>Use the following program for drawing the background</guilabel>. Available &kde; programs are listed, select one to enable it.
de: Um ein externes Programm zum Erzeugen des Hintergrundes für &kde; zu verwenden, wählen Sie <guilabel>Folgendes Programm für den Hintergrund verwenden</guilabel>. Wählen Sie eines der verfügbaren &kde;-Programme aus der Liste aus.

source: Adding, Removing and Modifying Wallpapers and Patterns
de: Hinzufügen, Entfernen und Ändern von Mustern

source: There is a button under the preview monitor labeled <guibutton>Get New Wallpapers</guibutton> that helps you fetch new wallpaper images from a selection of popular images from the <ulink url="http://www.kde-look.org">KDE-Look</ulink> website. You can of course select any image you have available to use as wallpaper, and it may be stored in any location on your hard drive. To have a wallpaper show up in the list automatically for all users, you should save it to the <filename class="directory">$<envar>KDEDIR</envar>/share/wallpapers</filename> folder.
de: Unter dem Vorschaumonitor gibt es einen weiteren Knopf mit der Bezeichnung <guibutton>Neue Hintergrundbilder herunterladen</guibutton>, der Sie beim Herunterladen von neuen Hintergrundmustern von der Webseite <ulink url="http://www.kde-look.org">KDE-Look</ulink> unterstützt. Natürlich können Sie auch jedes irgendwo auf Ihrer Festplatte verfügbare Bild als Hintergrund verwenden. Damit der Hintergrund automatisch für alle Benutzer in der Liste erscheint, sollten Sie diesen im Ordner <filename class="directory">$<envar>KDEDIR</envar>/share/wallpapers</filename> speichern.

source: A pattern is a picture file which &kde; uses as a template to draw your background. The picture file provides the shapes, but &kde; provides the colors. &kde; is packaged with several patterns, and you also can add new patterns.
de: Ein Muster ist eine Bilddatei, die &kde; als Vorlage zum Zeichnen Ihres Hintergrundes benutzt. Das Bild stellt die Umrisse bereit, während &kde; die Farben hinzufügt. &kde; selbst liefert einige Muster, Sie können aber auch selbst neue Muster hinzufügen.

source: To add a new pattern that is available to every user on your computer, simply place the file in <filename class="directory">$<envar>KDEDIR</envar>/share/apps/kdm/patterns/</filename>.
de: Zum Hinzufügen eines neuen Musters, das allen Benutzern des Rechners zur Verfügung stehen soll, müssen Sie die Datei in <filename class="directory">$<envar>KDEDIR</envar>/share/apps/kdm/patterns/</filename> speichern.

source: Copy a <literal role="extension">.desktop</literal> file from this folder, and name it the same as your new pattern image file. Modify the contents to suit your new pattern.
de: Kopieren Sie eine <literal role="extension">.desktop</literal>-Datei aus diesem Verzeichnis und benennen Sie diese Datei wie Ihre neue Musterdatei. Ändern Sie dann den Inhalt passend zu Ihrem neuen Muster.

source: To add a new pattern for a single user, add the files to <filename class="directory">$<envar>KDEHOME</envar>/share/apps/kdm/patterns/</filename>.
de: Zum Hinzufügen eines neuen Musters für einen Benutzer müssen Sie die Datei in <filename class="directory">$<envar>KDEHOME</envar>/share/apps/kdm/patterns/</filename> speichern.

source: For best results, the pattern should be a grayscale PNG file.
de: Um die besten Resultate zu erzielen, sollten die Musterdateien vom Typ PNG sein und nur Graustufen beinhalten.

source: Theme
de: Design

source: This page consists of three sections:
de: Diese Karteikarte enthält drei Bereiche:

source: A list of installed themes, where you can select the one to be used.
de: Eine Liste der installierten Designs. Wählen Sie das Design aus, welches benutzt werden soll.

source: A screenshot with a preview of the selected theme and additional information like <guilabel>Copyright</guilabel> and <guilabel>Description</guilabel>.
de: Ein Bildschirm mit der Vorschau des ausgewählten Designs und zusätzlichen Informationen wie das <guilabel>Copyright</guilabel> und eine <guilabel>Beschreibung</guilabel>.

source: Three buttons to install or remove a theme and a button to launch the <guilabel>Get Hot New Stuff</guilabel> dialog where you can download new themes.
de: Knöpfe um Designs zu installieren, zu entfernen und um den Dialog <guilabel>Neue Erweiterungen herunterladen</guilabel> zu öffnen, in dem zusätzliche Designs installiert werden können.

source: The settings on this page are only available in themed mode.
de: Die Einstellungen auf dieser Seite sind nur im Designmodus aktiviert.

source: Shutdown
de: Herunterfahren
