Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kde-workspace/kdm.po
Languages: de

source: <parameter>end</parameter> is the latest time at which the shutdown should be performed if active sessions are still running. If it starts with a plus-sign, the start time is added. -1 means wait infinitely. If end is through and active sessions are still running, &kdm; can do one of the following:
de: <parameter>end</parameter> ist der späteste Zeitpunkt, zu dem das System heruntergefahren werden soll, wenn noch aktive Sitzungen laufen. Beginnt der Wert mit einem Pluszeichen, wird die Startzeit aufaddiert. <quote>-1</quote> bedeutet, dass unbegrenzt gewartet wird. Wenn der Endzeitpunkt erreicht ist und immer noch Sitzungen aktiv sind, kann &kdm; eine der folgenden Aktionen durchführen:

source: <parameter>cancel</parameter> - give up the shutdown
de: <parameter>cancel</parameter> - das Herunterfahren wird nicht durchgeführt

source: <parameter>force</parameter> - shut down nonetheless
de: <parameter>force</parameter> - das Herunterfahren wird trotzdem durchgeführt

source: <parameter>forcemy</parameter> - shut down nonetheless if all active sessions belong to the requesting user. Only for per-display sockets.
de: <parameter>forcemy</parameter> - Das Herunterfahren wird trotzdem durchgeführt, wenn alle aktiven Sitzungen zu dem Benutzer gehören, der das Herunterfahren angefordert hat. Gültig nur für Display-spezifische Sockets.

source: <parameter>start</parameter> and <parameter>end</parameter> are specified in seconds since the &UNIX; epoch.
de: <parameter>start</parameter> und <parameter>end</parameter> werden in Sekunden seit Beginn der &UNIX;-Epoche angegeben.

source: <parameter>trynow</parameter> is a synonym for <parameter>0 0 cancel</parameter>, <parameter>forcenow</parameter> for <parameter>0 0 force</parameter> and <parameter>schedule</parameter> for <parameter>0 -1</parameter>.
de: <parameter>trynow</parameter> ist gleichbedeutend mit <parameter>0 0 cancel</parameter>, <parameter>forcenow</parameter> mit <parameter>0 0 force</parameter> und <parameter>schedule</parameter> mit <parameter>0 -1</parameter>.

source: <parameter>ask</parameter> attempts an immediate shutdown and interacts with the user if active sessions are still running. Only for per-display sockets.
de: <parameter>ask</parameter> versucht ein sofortiges Herunterfahren und fragt beim Benutzer an, sofern noch aktive Sitzungen laufen. Gültig nur für Display-spezifische Sockets.

source: Cancel a scheduled shutdown. The global socket always cancels the currently pending shutdown, while per-display sockets default to cancelling their queued request.
de: Ein geplantes Herunterfahren abbrechen. Der globale Socket bricht immer das gerade anstehende Herunterfahren ab, die Display-spezifischen Sockets per Voreinstellung nur die von ihnen eingestellten Anfragen.

source: Return a list with information about shutdowns.
de: Zurückliefern einer Liste mit Informationen über Anforderungen zum Herunterfahren.

source: The entries are a comma-separated tuples of:
de: Die Einträge sind durch Kommata getrennte Tupel von:

source: (<returnvalue>global</returnvalue>|<returnvalue>local</returnvalue>) - pending vs. queued shutdown. A local entry can be returned only by a per-display socket.
de: (<returnvalue>global</returnvalue>|<returnvalue>local</returnvalue>) - anstehende oder in der Warteschlange eingestellte Anfragen zum Herunterfahren. Ein lokaler Eintrag kann nur von einem Display-spezifischen Socket zurückgeliefert werden.

source: ("ask"|"force"|"forcemy"|"cancel")
de: (<quote>ask</quote>|<quote>force</quote>|<quote>forcemy</quote>|<quote>cancel</quote>)

source: Numeric user ID of the requesting user, -1 for the global socket.
de: Die numerische Benutzer-ID des anfragenden Benutzers, -1 für den globalen Socket.

source: The next boot OS choice or "-" for none.
de: Das als nächstes zu bootende Betriebssystem oder <quote>-</quote> für keines.

source: New fields might be added later
de: Zukünftig können weitere Felder hinzukommen

source: There are two ways of using the sockets:
de: Sockets können auf zwei Arten benutzt werden:

source: Connecting them directly. FifoDir is exported as $<envar>DM_CONTROL</envar>; the name of per-display sockets can be derived from $<envar>DISPLAY</envar>.
de: Direkte Verbindung. FifoDir wird als $<envar>DM_CONTROL</envar> exportiert; der Name von Display-spezifischen Sockets kann aus $<envar>DISPLAY</envar> abgeleitet werden.

source: By using the <command>kdmctl</command> command (&eg; from within a shell script). Try <command>kdmctl</command> <option>-h</option> to find out more.
de: Durch Verwendung des Befehls <command>kdmctl</command> (&eg; aus einem Shell-Skript). Um mehr darüber zu erfahren, rufen Sie <command>kdmctl</command><option>-h</option> auf.

source: Here is an example bash script <quote>reboot into FreeBSD</quote>:
de: Hier ist ein Beispiel für ein Bash-Skript <quote>reboot mit FreeBSD</quote>:

source: Other sources of information
de: Weiterführende Informationen

source: Since &kdm; is descended from &xdm;, the <ulink url="man:xdm">xdm man page</ulink> may provide useful background information. For X-related problems try the man pages <ulink url="man:X">X</ulink> and <ulink url="man:startx">startx</ulink>. If you have questions about &kdm; that are not answered by this handbook, take advantage of the fact the &kdm; is provided under the terms of the &GNU; General Public License: look at the source code.
de: Da &kdm; von &xdm; abstammt, finden Sie in der Manual-Seite von <ulink url="man:xdm">xdm</ulink> hilfreiche Hintergrundinformationen. Bei Problemen mit X sollten Sie die Manual-Seiten von <ulink url="man:X">X</ulink> und <ulink url="man:startx">startx</ulink> lesen. Wenn Sie Fragen zu &kdm; haben, die dieses Handbuch nicht beantwortet, so nutzen Sie die Tatsache, dass &kdm; unter den Lizenzbedingungen von &GNU; entwickelt wurde: Schauen Sie direkt in den Quellcode.

source: Credits and License
de: Danksagungen und Lizenz

source: &kdm; is derived from, and includes code from, &xdm; &copy; Keith Packard, MIT X Consortium.
de: &kdm; stammt von &xdm; ab und enthält Code daraus. &copy; Keith Packard, MIT X Consortium.

source: &kdm; 0.1 was written by &Matthias.Ettrich;. Later versions till &kde; 2.0.x were written by &Steffen.Hansen;. Some new features for &kde; 2.1.x and a major rewrite for &kde; 2.2.x made by &Oswald.Buddenhagen;.
de: &kdm; 0.1 wurde von &Matthias.Ettrich; geschrieben. Spätere Versionen bis &kde; 2.0.x wurden von &Steffen.Hansen; erstellt. Einige neue Funktionen für &kde; 2.1.x und eine Generalüberholung für &kde; 2.2.x wurden von &Oswald.Buddenhagen; durchgeführt.

source: Other parts of the &kdm; code are copyright by the authors, and licensed under the terms of the <ulink url="common/gpl-license.html">&GNU; GPL</ulink>. Anyone is allowed to change &kdm; and redistribute the result as long as the names of the authors are mentioned.
de: Andere Teile des &kdm;-Codes gehören urheberrechtlich den Autoren und sind nach den Bedingungen der <ulink url="common/gpl-license.html">GNU GPL</ulink> lizenziert. Jeder darf &kdm; ändern und das Ergebnis neu verteilen, solange die Namen der Autoren genannt werden.

source: &kdm; requires the &Qt; library, which is copyright Troll Tech AS.
de: &kdm; benötigt die &Qt;-Bibliothek, für die Troll Tech AS das Copyright besitzt.

source: Documentation contributors:
de: Mitwirkende an der Dokumentation:

source: Documentation written by &Steffen.Hansen; &Steffen.Hansen.mail;
de: Die Dokumentation wurde von &Steffen.Hansen; &Steffen.Hansen.mail; geschrieben.

source: Documentation extended by Gregor Zumstein<email>zumstein@ssd.ethz.ch</email>. Last update August 9, 1998
de: Erweiterungen der Dokumentation wurden von Gregor Zumstein<email>zumstein@ssd.ethz.ch</email> hinzugefügt. Letzte Änderung am 09.08.1998

source: Documentation revised for &kde; 2 by &Neal.Crook; &Neal.Crook.mail;. Last update August 6, 2000
de: Für &kde; 2 wurde die Dokumentation von &Neal.Crook; überarbeitet &Neal.Crook.mail;. Letzte Änderung am 06.08.2000

source: Documentation extended and revised for &kde; 2.2 and 4.0 by &Oswald.Buddenhagen; &Oswald.Buddenhagen.mail;. Last update December 7, 2007
de: Für &kde; 2.2 und 4.0 wurde die Dokumentation von &Oswald.Buddenhagen; &Oswald.Buddenhagen.mail; überarbeitet und erweitert. Letzte Änderung: 7. Dezember 2007

source: Documentation copyright &Steffen.Hansen;, Gregor Zumstein, &Neal.Crook; and &Oswald.Buddenhagen;. This document also includes large parts of the &xdm; man page, which is &copy; Keith Packard. The theme format documentation is heavily based on the GDM manual, which is &copy; Martin K. Petersen, George Lebl, &RedHat;, Inc. and Sun Microsystems, Inc.
de: Copyright der Dokumentation &Steffen.Hansen;, Gregor Zumstein, &Neal.Crook; und &Oswald.Buddenhagen;. Diese Dokument enthält auch große Teile der &xdm;-Manual-Seite, Copyright Keith Packard. Die Dokumentation für das Format der Designs basiert stark auf dem GDM-Handbuch, &copy; Martin K. Petersen, George Lebl, &RedHat;, Inc. and Sun Microsystems, Inc.

source: CREDIT_FOR_TRANSLATORS
de: <!-- <para>Volker Dose <email>vpdose@cpmgut.toppoint.de</email>, Hartmut Haase <email>hartmut.haase@web.de</email>, Stefan Doll <email>stefan@laugenweck.de</email></para> -->

source: Glossary
de: Glossar

source: greeter
de: Anmeldefenster

source: The greeter is the login dialog, &ie; the part of &kdm; which the user sees.
de: Das Fenster das der Benutzer von &kdm; sieht - das Fenster mit dem er sich anmeldet.

source: entropy
de: Entropie

source: The entropy of a system is the measure of its unpredictability. This is used during the generation of random numbers.
de: Die Entropie eines Systems ist ein Maß für seine Unvorhersehbarkeit. Dies wird bei der Erzeugung von Zufallszahlen benutzt.
