Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kde-workspace/kdm.po
Languages: de

source: The &kdm; Handbook
de: Das Handbuch zu &kdm;

source: ROLES_OF_TRANSLATORS
de: <!-- Volker Dose <email>vpdose@cpmgut.toppoint.de</email>, Hartmut Haase <email>hartmut.haase@web.de</email>, Stefan Doll <email>stefan@laugenweck.de</email> -->

source: This document describes &kdm; the &kde; Display Manager. &kdm; is also known as the <quote>Login Manager</quote>.
de: Dieses Dokument beschreibt &kdm;, den &kde;-Anmeldungsmanager.

source: Introduction
de: Einführung

source: &kdm; provides a graphical interface that allows you to log in to a system. It prompts for login (username) and password, authenticates the user and starts a <quote>session</quote>. &kdm; is superior to &xdm;, the X Display Manager, in a number of ways.
de: Der &kdm; ist eine grafische Schnittstelle, um sich beim System anzumelden. Durch Eingabe von Anmeldekennung und Passwort erfolgt eine Authentifizierung und &kdm; startet eine <quote>Sitzung</quote>. &kdm; ist ein Ersatz für <application>xdm</application>, den X Display Manager, und bietet diesem gegenüber einige Verbesserungen.

source: Quick Start Guide
de: Kurzanleitung

source: This is a quick start guide for users who fit the following pattern:
de: Dies ist eine Kurzanleitung für Benutzer, für die folgendes zutrifft:

source: X is configured and works with the command <command>startx</command> from the commandline.
de: X ist eingerichtet und kann mit dem Befehl <command>startx</command> von der Befehlszeile gestartet werden.

source: Each user will generally only use a single window manager or desktop environment, and does not change this choice very often, or is comfortable editing a single text file in order to change their choice.
de: Typischerweise verwendet ein Benutzer nur einen einzigen Fenstermanager bzw eine einzige Desktopumgebung. Geändert wird sie nur selten, oder dem Benutzer/den Benutzern fällt es leicht, dies durch Editieren einer Konfigurationsdatei vorzunehmen.

source: This scenario will be sufficient for many environments where a single user or several users normally boot the computer and log into their preferred environment.
de: Diese Einstellungen sind für viele Systeme ausreichend, bei denen ein einzelner Benutzer oder mehre Benutzer üblicherweise zunächst den Computer hochfahren und sich dann in ihre bevorzugte Umgebung anmelden möchten.

source: Setting up a Default Session
de: Auswählen einer Standardsitzung

source: Create or open the file <filename>~/.xinitrc</filename>
de: Bearbeiten oder Anlegen der Datei <filename>~/.xinitrc</filename>

source: If you already have a working <filename>~/.xinitrc</filename>, go to the next step
de: Falls Sie bereits über eine funktionierende <filename>~/.xinitrc</filename> verfügen, können Sie diesen Schritt überspringen.

source: If one does not already exist, add a line to the <filename>~/.xinitrc</filename> to start your preferred window manager or desktop environment.
de: Falls noch nicht vorhanden, fügen Sie <filename>~/.xinitrc</filename> eine Zeile hinzu um Ihren Fenstermanager bzw Ihre Desktopumgebung zu starten.

source: For &kde; you should enter:
de: Für &kde; sollten Sie folgendes eingeben:

source: For other window managers or desktop environments, you should look in their documentation for the correct command.
de: Für andere Fenstermanager und Desktopumgebungen sollten Sie den entsprechenden Befehl in der jeweiligen Dokumentation finden.

source: Make a link as follows:
de: Richten Sie wie folgt einen Link ein:

source: At this point, typing <userinput><command>startx</command></userinput> on the commandline should start X, with a &kde; session. The next task is to try &kdm;.
de: Wenn nun <userinput><command>startx</command></userinput> auf der Befehlszeile eingegeben wird, sollte X mit einer &kde;-Sitzung starten. Als nächster Schritt wird &kdm; getestet.

source: As <systemitem class="username">root</systemitem>, type <userinput><command>kdm</command></userinput> at the prompt.
de: Dazu sollte als Benutzer<systemitem class="username">root</systemitem> <userinput><command>kdm</command></userinput> auf der Befehlszeile eingegeben werden.

source: You should see a login window, which is described more fully in <xref linkend="login"/>.
de: Sie sollten nun ein Anmeldefenster sehen, das in <xref linkend="login"/> beschrieben wird.

source: Typing your normal username and password in the fields provided, and leaving <option>default</option> selected as the session type should now open a &kde; session for your user.
de: Wenn Sie nun Ihren Benutzernamen und Ihr Passwort in die dafür vorgesehenen Felder eingeben und <option>Standard</option> als Sitzungstyp auswählen, sollten Sie eine &kde;-Sitzung erhalten.

source: If you have other users to configure, you should repeat the procedure above for each of them.
de: Falls Sie noch weitere Benutzer einrichten wollen, sollten Sie die Prozedur, wie oben beschrieben, für jeden Benutzer wiederholen.

source: This is a quick guide to getting up and running only. You probably will want to customize &kdm; further, for example, to hide the names of the system accounts, to allow further sessions, and much more. Please read through the rest of this manual to find out how to do these things.
de: Dies ist eine Kurzanleitung um &kdm; zum Laufen zu bringen. Sie werden wahrscheinlich darüberhinaus &kdm; weiter konfigurieren wollen. Zum Beispiel um die Namen von Systemkonten auszublenden, weitere Sitzungstypen einzurichten und vieles mehr. Bitte konsultieren Sie den Rest dieses Handbuchs für Informationen zu diesen Themen.

source: The Login Window
de: Das Anmeldefenster

source: The user interface to &kdm; consists of dialog boxes. The main dialog box contains:
de: Die Benutzung von &kdm; erfolgt über Dialoge. Der Hauptdialog enthält:

source: Widgets allowing you to authenticate. When the "classic" authentication method is chosen, these are:
de: Elemente, mit denen Sie sich authentifizieren können. Wird die <quote>klassische</quote> Authentifizierungsmethode gewählt, sind das:

source: A <guilabel>Username:</guilabel> field for you to enter your username.
de: Ein Eingabefeld <guilabel>Benutzername:</guilabel> zur Eingabe Ihrer Anmeldekennung.

source: A <guilabel>Password:</guilabel> field for you to enter your password.
de: Ein Eingabefeld <guilabel>Passwort:</guilabel>, um Ihr Passwort einzugeben.

source: (Optionally) a list containing entries with the name and graphical image of each user (for example, a digitized photograph). Clicking a list entry is equivalent to typing the associated username into the <guilabel>Username:</guilabel> field.
de: Eine (optionale) Liste mit den Namen und Bildern aller Benutzer (&eg; ein Digitalfoto). Klicken Sie auf einen Eintrag, wird der Benutzername in das Feld <guilabel>Benutzername:</guilabel> übertragen.

source: (Optionally) a region to the right of or above the authentication area which can be used to display either a static image or an analog clock.
de: (Optional) ein Bereich rechts von oder über dem Bereich zur Authentifizierung, um ein Bild oder eine Analoguhr anzuzeigen.

source: A <guibutton>Login</guibutton> button that validates the username/password combination and attempts to start a session of the selected type.
de: Einen Knopf <guibutton>Anmelden</guibutton>, der die Kombination vonBenutzername und Passwort prüft und dann versucht die gewählte Sitzung zu starten.

source: A <guibutton>Menu</guibutton> button that opens an action menu with the following items:
de: Ein <guibutton>Menü</guibutton>-Knopf, der ein Aktionsmenü mit den folgenden Einträgen öffnet:

source: (Optionally) A <guimenuitem>Session Type</guimenuitem> item to choose the type of session (desktop environment, window manager) to start. See <xref linkend="different-window-managers-with-kdm"/> to find out how to configure different session types.
de: (Optional) Ein Eintrag <guimenuitem>Sitzungstyp</guimenuitem>, mit dem der Typ der zu startenden Sitzung (Arbeitsumgebung, Fenstermanager) ausgewählt werden kann. Siehe <xref linkend="different-window-managers-with-kdm"/> zur Einrichtung verschiedener Sitzungstypen.

source: (Optionally) A <guimenuitem>Authentication Method</guimenuitem> item to switch between different authentication methods like the classical username+password, smartcard, biometry, &etc; The actual authenticators are combinations of <acronym>PAM</acronym> modules and matching frontend modules (<quote>conversation plugins</quote>). See <xref linkend="option-pluginslogin"/>.
de: (Optional) Ein Eintrag <guimenuitem>Authentifizierungs-Methode</guimenuitem>, mit dem zwischen den verschiedenen Authentifizierungsmethoden wie dem klassischen Benutzername+Passwort, Smartcard, Biometrie &etc; ausgewählt werden kann. Die eigentliche Authentifizierung geschieht über eine Kombination von <acronym>PAM</acronym>-Modulen und dazu passenden Benutzerschnittstellen (<quote>Kommunikationserweiterungen</quote>). Siehe <xref linkend="option-pluginslogin"/>.

source: (Optionally on local displays) A <guimenuitem>Switch User...</guimenuitem> item to switch between local sessions running on different virtual terminals of this computer.
de: (Optional auf lokalen Displays) Ein Eintrag <guimenuitem>Benutzer wechseln ...</guimenuitem>, mit dem auf lokale Sitzungen gewechselt werden kann, die auf anderen virtuellen Konsolen dieses Rechners laufen.

source: (Optionally on local displays) A <guimenuitem>Restart X Server</guimenuitem> item that terminates the currently running &X-Server;, starts a new one and displays the login dialog again. You can use this if the display content seems to be broken somehow.
de: (Optional auf lokalen Displays) Eine Option <guimenuitem>X-Server neu starten</guimenuitem>, die den derzeit laufenden &X-Server; beendet und neu startet. Das Anmeldungsfenster wird dann erneut aufgebaut. Das kann nützlich sein, wenn die Bildschirmanzeige nicht korrekt erscheint.

source: (Optionally on remote displays) A <guimenuitem>Close Connection</guimenuitem> item that closes the connection to the &XDMCP; server you are currently connected to. If you got to this server through a host chooser, this will bring you back to the chooser, otherwise it will only reset the &X-Server; and bring up the login dialog again.
de: (Optional für Fremdrechner) Eine Option <guimenuitem>Verbindung trennen</guimenuitem>, die die Verbindung zum derzeit ausgewählten &XDMCP;-Server trennt. Falls die Verbindung mittels eines Host-Selektors aufgebaut wurde, wird das Menü des Selektors wieder aufgebaut - ansonsten wird lediglich der &X-Server; neugestartet und das Anmeldungsfenster erneut angezeigt.

source: (Optionally on local displays) A <guimenuitem>Remote Login</guimenuitem> item that displays a host chooser dialog with &XDMCP; servers one can log into remotely.
de: (Optional auf lokalen Displays) Ein Eintrag <guimenuitem>Anmeldung auf Fremdrechner</guimenuitem>, mit dem ein Dialog zur Rechnerauswahl angezeigt wird. Dieser listet &XDMCP;-Server auf, an denen Sie sich anmelden können.

source: (Optionally on local displays) A <guimenuitem>Console Mode</guimenuitem> item that terminates graphical login and leaves you at the console. See <xref linkend="option-consolettys"/> and <xref linkend="option-servertty"/>.
de: (Optional auf lokalen Displays) Eine Option <guimenuitem>Konsolen-Modus</guimenuitem>, die den grafischen Anmeldebildschirm beendet und Sie auf die Befehlszeile zurückführt. Siehe <xref linkend="option-consolettys"/> und <xref linkend="option-servertty"/>.

source: (Optionally) A <guimenuitem>Shutdown...</guimenuitem> item that displays the <guilabel>Shutdown</guilabel> dialog box.
de: (Optional) Einen Eintrag <guimenuitem>Herunterfahren</guimenuitem>, der den Dialog <guilabel>Rechner ausschalten</guilabel> aufruft.

source: The <guilabel>Shutdown</guilabel> dialog box presents a set of buttons that allow one of these actions to be executed:
de: Der Dialog <guilabel>Beenden</guilabel> bietet die folgenden Aktionen, von denen eine ausgeführt werden kann:

source: Turn Off Computer
de: Rechner abschalten

source: Shut the system down in a controlled manner, ready for power-down.
de: Fährt das System kontrolliert herunter, danach können Sie den Rechner ausschalten.

source: Restart Computer
de: Rechner neu starten

source: Shut the system down and reboot. For systems that use <application>Lilo</application> or <application>Grub</application>, an optional drop down box allows you to select a particular operating system to be used for the reboot.
de: Fährt das System herunter und führt einen Neustart durch. Für Systeme, die <application>LILO</application> oder <application>Grub</application> benutzen, können Sie in einem weiteren Kästchen wählen, mit welchem Betriebssystem der Neustart erfolgen soll.

source: Schedule...
de: Zeitplanung ...

source: If this option is enabled, you may use it to enter a more complex shutdown dialog. See <xref linkend="option-scheduledsd"/> for details.
de: Ist diese Option aktiv, können Sie darüber einen erweiterten Beenden-Dialog anzeigen lassen. Siehe <xref linkend="option-scheduledsd"/> für weitere Einzelheiten.

source: Pressing the <guibutton>Cancel</guibutton> button returns to the main &kdm; dialog box.
de: Ein Klick auf den Knopf <guibutton>Abbrechen</guibutton> schließt das Menü und kehrt zum &kdm;-Hauptmenü zurück.

source: Configuring &kdm;
de: &kdm; einrichten

source: This chapter assumes that &kdm; is already up and running on your system, and that you simply want to change its behavior in some way.
de: In diesem Kapitel wird vorausgesetzt, dass &kdm; bereits installiert ist und auf Ihrem System läuft und dass Sie nur das Verhalten ändern möchten.

source: When &kdm; starts up, it reads its configuration from the folder <filename class="directory">$<envar>KDEDIR</envar>/share/config/kdm/</filename> (this may be <filename class="directory">/etc/kde4/kdm/</filename> or something else on your system).
de: Wenn &kdm; startet, liest es zunächst die Konfigurationsdatei im Ordner <filename class="directory">$<envar>KDEDIR</envar>/share/config/kdm/</filename> (die Datei könnte auf Ihrem System auch unter <filename class="directory">/etc/kde4/kdm/</filename> oder an einer anderen Stelle untergebracht sein).

source: The main configuration file is &kdmrc;; all other files are referenced from there and could be stored under any name anywhere on the system - but usually that would not make much sense for obvious reasons (one particular exception is referencing configuration files of an already installed &xdm; - however when a new &kdm; is installed, it will import settings from those files if it finds an already installed &xdm;).
de: Die wichtigste Konfigurationsdatei ist &kdmrc; - alle anderen Dateien werden von dieser Datei eingebunden und könnten im Prinzip an einer beliebigen Stelle im System untergebracht sein. Natürlich ist das in der Regel nicht sinnvoll. Eine Ausnahme davon wäre ein bereits installiertes &xdm; - tatsächlich werden bei der Installation eines neuen &kdm; automatisch &xdm;-Dateien gesucht und (falls vorhanden) verwendet.

source: Since &kdm; must run before any user is logged in, it is not associated with any particular user. Therefore, it is not possible to have user-specific configuration files; all users share the common &kdmrc;. It follows from this that the configuration of &kdm; can only be altered by those users that have write access to <filename>$<envar>KDEDIR</envar>/share/config/kdm/kdmrc</filename> (normally restricted to system administrators logged in as <systemitem class="username">root</systemitem>).
de: Wenn &kdm; startet, liest es seine Einstellungen aus der Datei &kdmrc;. Weil &kdm; laufen muss, bevor ein Benutzer angemeldet ist, ist diese Datei keinem besonderen Benutzer zugeordnet. Deshalb gibt es auch keine benutzerspezifische Datei <filename>$HOME/share/config/kdmrc</filename>; alle Benutzer teilen sich die gemeinsame Version von &kdmrc;. Daraus folgt dass die &kdm;-Einrichtung nur von jemandem geändert werden kann, der für <filename>$<envar>KDEDIR</envar>/share/config/kdmrc</filename> Schreibrechte hat (das ist normalerweise der Systemadministrator, der als root angemeldet ist).

source: You can view the &kdmrc; file currently in use on your system, and you can configure &kdm; by editing this file. Alternatively, you can use the graphical configuration tool provided by the &systemsettings; (the <guilabel>Login Screen</guilabel> module in the <guilabel>System Administration</guilabel> category).
de: Sie können sich die Datei &kdmrc;, die von Ihrem System verwendet wird, anschauen, und Sie können &kdm; einrichten, indem Sie diese Datei anpassen. Oder Sie benutzen in den &systemsettings; im Abschnitt <guilabel>Systemverwaltung</guilabel> das Modul <guilabel>Anmeldebildschirm</guilabel>.

source: The remainder of this chapter describes configuration of &kdm; via the &systemsettings; module, and the <link linkend="kdm-files">next chapter</link> describes the options available in &kdmrc; itself. If you only need to configure for local users, the &systemsettings; module should be sufficient for your needs. If you need to configure remote logins, or have multiple &kdm; sessions running, you will need to read on.
de: Der Rest diese Kapitels beschreibt die Einrichtung von &kdm; mit Hilfe des &systemsettings;-Moduls - das <link linkend="kdm-files">nächste Kapitel</link> beschreibt die in &kdmrc; verfügbaren Optionen. Falls Sie nur lokale Benutzer einrichten müssen, sollte das &systemsettings;-Modul Ihren Anforderungen genügen. Müssen Sie jedoch entfernte Anmeldungen einrichten oder gleichzeitig mehrere &kdm;-Sitzungen betreiben, sollten Sie hier weiterlesen.

source: The Login Manager &systemsettings; Module
de: Das &systemsettings;-Modul des KDE Anmeldungsmanagers

source: Using this module, you can configure the &kde; graphical login manager, &kdm;. You can change how the login screen looks, who has access using the login manager and who can shutdown the computer.
de: Mit diesem Modul können Sie den &kde;-Anmeldungsmanager &kdm; einrichten. Sie können einstellen, wie das Anmeldungsfenster aussieht, wer den Anmeldungsmanager benutzen und wer den Computer herunterfahren kann.

source: All settings will be written to the configuration file &kdmrc;, which in its original state has many comments to help you configure &kdm;. Using this &systemsettings; module will strip these comments from the file. All available options in &kdmrc; are covered in <xref linkend="kdm-files"/>.
de: Alle Einstellungen werden in die Konfigurationsdatei &kdmrc; geschrieben. In ihrem Urzustand enthält sie zahlreiche Kommentare, die bei der Konfiguration von &kdm; nützlich sind. Die Verwendung des &systemsettings;-Moduls entfernt diese Kommentare allerdings. Alle möglichen Einstellungen in &kdmrc; sind in <xref linkend="kdm-files"/> beschrieben.

source: The options listed in this chapter are cross referenced with their equivalents in &kdmrc;. All options available in the &systemsettings; module are also available directly in &kdmrc; but the reverse is not true.
de: Die Einstellungen die in diesem Kapitel aufgeführt sind, sind mit Verweisen zu den zugehörigen Einträgen in &kdmrc; versehen. Alle Einstellungen die im &systemsettings;-Modul zur Verfügung stehen sind auch in &kdmrc; vorhanden - umgekehrt gilt das allerdings nicht.

source: In order to organize all of these options, this module is divided into several sections: <link linkend="kdmconfig-general"><guilabel>General</guilabel></link>, <link linkend="kdmconfig-dialog"><guilabel>Dialog</guilabel></link>, <link linkend="kdmconfig-background"><guilabel>Background</guilabel></link>, <link linkend="kdmconfig-theme"><guilabel>Theme</guilabel></link>, <link linkend="kdmconfig-shutdown"><guilabel>Shutdown</guilabel></link>, <link linkend="kdmconfig-users"><guilabel>Users</guilabel></link> and <link linkend="kdmconfig-convenience"><guilabel>Convenience</guilabel></link>.
de: Um diese Einstellungen übersichtlich zu gestalten, ist das Modul in mehrere Abschnitte gegliedert: <link linkend="kdmconfig-general"><guilabel>Allgemein</guilabel></link>, <link linkend="kdmconfig-dialog"><guilabel>Dialog</guilabel></link>, <link linkend="kdmconfig-background"><guilabel>Hintergrund</guilabel></link>, <link linkend="kdmconfig-theme"><guilabel>Design</guilabel></link>, <link linkend="kdmconfig-shutdown"><guilabel>Herunterfahren</guilabel></link>, <link linkend="kdmconfig-users"><guilabel>Benutzer</guilabel></link> und <link linkend="kdmconfig-convenience"><guilabel>Vereinfachung</guilabel></link>.

source: You can switch between the sections using the tabs at the top of the window.
de: Sie können zwischen diesen Abschnitten, mit Hilfe der Reiter am oberen Rand des Fensters, umschalten.

source: You can only make changes if you run this module with superuser rights.
de: Einstellungen können nur geändert werden, wenn Sie dieses Modul als Systemverwalter benutzen.

source: General
de: Allgemein

source: First you have a drop down box to choose the language for your login box, corresponding to setting <option>Language</option> in &kdmrc;.
de: Zuerst können Sie die Spracheinstellung für das Anmeldefenster vornehmen. Das entspricht der Option <option>Language</option> in &kdmrc;.

source: In the <guilabel>Appearance</guilabel> section you have an option to use &kdm; in themed mode. If <guilabel>Use themed greeter</guilabel> is checked, the settings on the <guilabel>Dialog</guilabel> and <guilabel>Background</guilabel> pages cannot be configured separately.
de: Im Abschnitt <guilabel>Erscheinungsbild</guilabel> kann eingestellt werden, ob ein Design für &kdm; benutzt wird. Ist <guilabel>Design für den Anmeldungsmanager verwenden</guilabel> aktiv, können auf den Karteikarten <guilabel>Dialog</guilabel> und <guilabel>Hintergrund</guilabel> keine zusätzlichen Einstellungen gewählt werden.

source: While &kde;'s style depends on the settings of the user logged in, the style used by &kdm; can be configured using the <guilabel>GUI style:</guilabel> and <guilabel>Color scheme:</guilabel> options. These correspond to the keys <link linkend="option-guistyle"><option>GUIStyle</option></link> and <link linkend="option-colorscheme"><option>ColorScheme</option></link> in &kdmrc; respectively.
de: &kde;s Erscheinungsbild hängt in erster Linie von den Einstellungen des angemeldeten Benutzers ab. Das Erscheinungsbild von &kdm; dagegen kann mittels der Einstellungen <guilabel>Oberflächenstil</guilabel> und <guilabel>Farbschema</guilabel> bestimmt werden.Das entspricht den Einträgen <link linkend="option-guistyle"><option>GUIStyle</option></link> und <link linkend="option-colorscheme"><option>ColorScheme</option></link> in &kdmrc;.

source: From the <guilabel>Fonts</guilabel> section of this page you can change the fonts used in the login window. Only fonts available to all users are available here, not fonts you have installed on a per user basis.
de: In diesem Bereich können die <guilabel>Schriftarten</guilabel> des Anmeldefensters eingestellt werden. Hier sind nur Schriftarten einstellbar, die für alle Benutzer verfügbar sind.

source: You can select three different font styles in this section (<guilabel>General:</guilabel>, <guilabel>Failure:</guilabel>, <guilabel>Greeting:</guilabel>). When you click on the <guibutton>Choose...</guibutton> button a dialog appears from which you can select the new characteristics for the font style.
de: Dabei sind drei Schriftarten einstellbar: <guilabel>Allgemein</guilabel>, <guilabel>Fehlversuche</guilabel> und <guilabel>Begrüßung</guilabel>. Wenn Sie auf den Knopf <guibutton>Auswählen ...</guibutton> klicken, erscheint ein Dialogfenster, in dem die Eigenschaften der Schriftart bestimmt werden können.
