Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kde-workspace/kdm_kdmrc-ref.po
Languages: de

source: The Files &kdm; Uses for Configuration
de: Die Konfigurationsdateien von &kdm;

source: This chapter documents the files that control &kdm;'s behavior. Some of this can be also controlled from the &systemsettings; module, but not all.
de: Dieses Kapitel dokumentiert die Dateien, die das Verhalten von &kdm; beeinflussen. Einige davon können auch über das &systemsettings;-Modul geändert werden, aber nicht alle.

source: &kdmrc; - The &kdm; master configuration file
de: &kdmrc;- die Haupt-Konfigurationsdatei von &kdm;

source: The basic format of the file is <quote>INI-like</quote>. Options are key/value pairs, placed in sections. Everything in the file is case sensitive. Syntactic errors and unrecognized key/section identifiers cause &kdm; to issue non-fatal error messages.
de: Das grundlegende Format für diese Datei ist an <quote>INI-Dateien</quote> angelehnt. Einstellungen werden als Schlüssel/Wert-Paare in Sektionen abgelegt. Alle Einträge berücksichtigen Groß-/Kleinschreibung. Syntaktische Fehler oder unbekannte Schlüssel/Wert-Paare veranlassen &kdm; dazu entsprechende Fehlermeldungen auszugeben, die aber nicht-kritisch sind.

source: Lines beginning with <literal>#</literal> are comments; empty lines are ignored as well.
de: Zeilen, die mit <literal>#</literal> beginnen, sind Kommentare. Leere Zeilen werden ebenfalls ignoriert.

source: Sections are denoted by <literal>[</literal><replaceable>Name of Section</replaceable><literal>]</literal>.
de: Sektionen werden mit <literal>[</literal><replaceable>Name der Sektion</replaceable><literal>]</literal> gekennzeichnet.

source: You can configure every X-display individually.
de: Sie können jedes X-Display einzeln konfigurieren.

source: Every display has a display name, which consists of a host name (which is empty for local displays specified in <option>StaticServers</option> or <option>ReserveServers</option>), a colon, and a display number. Additionally, a display belongs to a display class (which can be ignored in most cases).
de: Jedes Display hat einen Display-Namen, der aus dem Rechnernamen (der bei lokalen Displays, die in <option>StaticServers</option> oder <option>ReserveServers</option> eingetragen sind, leer ist), einem Doppelpunkt und der Display-Nummer besteht. Zusätzlich gehört ein Display noch zu einer Display-Klasse, aber diese kann in den meisten Fällen ignoriert werden.

source: Sections with display-specific settings have the formal syntax <literal>[X-</literal>&nbsp;<replaceable>host</replaceable>&nbsp;[&nbsp;<literal>:</literal>&nbsp;<replaceable>number</replaceable>&nbsp;[&nbsp;<literal>_</literal>&nbsp;<replaceable>class</replaceable>&nbsp;]&nbsp;]&nbsp;<literal>-</literal>&nbsp;<replaceable>sub-section</replaceable>&nbsp;<literal>]</literal>
de: Sektionen mit Display-spezifischen Einstellungen besitzen die formale Syntax<literal>[X-</literal>&nbsp;<replaceable>Rechner</replaceable>&nbsp;[&nbsp;<literal>:</literal>&nbsp;<replaceable>Nummer</replaceable>&nbsp;[&nbsp;<literal>_</literal>&nbsp;<replaceable>Klasse</replaceable>&nbsp;]&nbsp;]&nbsp;<literal>-</literal>&nbsp;<replaceable>Untersektion</replaceable>&nbsp;<literal>]</literal>

source: All sections with the same <replaceable>sub-section</replaceable> make up a section class.
de: Alle Sektionen mit derselben <replaceable>Untersektion</replaceable> bilden eine Sektionsklasse.

source: You can use the wildcard <literal>*</literal> (match any) for <replaceable>host</replaceable>, <replaceable>number</replaceable>, and <replaceable>class</replaceable>. You may omit trailing components; they are assumed to be <literal>*</literal> then. The host part may be a domain specification like <replaceable>.inf.tu-dresden.de</replaceable> or the wildcard <literal>+</literal> (match non-empty).
de: Sie können den Platzhalter <literal>*</literal> für <replaceable>Rechner</replaceable>, <replaceable>Nummer</replaceable> und <replaceable>Klasse</replaceable> verwenden. Bestandteile, die sich am Ende befinden, dürfen weggelassen werden. Für sie wird der Platzhalter <literal>*</literal> angenommen. Der Rechner-Bestandteil kann eine Domain-Angabe sein, wie <replaceable>.inf.tu.dresden.de</replaceable> oder der Platzhalter <literal>+</literal> (trifft auf alle nicht-leeren Einträge zu).

source: From which section a setting is actually taken is determined by these rules:
de: Aus welcher Sektion eine Einstellung verwendet wird, entscheidet sich nach den folgenden Regeln:

source: An exact match takes precedence over a partial match (for the host part), which in turn takes precedence over a wildcard (<literal>+</literal> taking precendence over <literal>*</literal>).
de: Eine exakte Übereinstimmung hat Vorrang vor einer teilweisen Übereinstimmung (im Rechner-Bestandteil), die wiederum Vorrang vor dem Platzhalter hat (<literal>+</literal> hat Vorrang vor <literal>*</literal>).

source: Precedence decreases from left to right for equally exact matches.
de: Bei exakt übereinstimmenden Einträgen nimmt die Priorität von links nach rechts ab.

source: Example: display name <quote>myhost.foo:0</quote>, class <quote>dpy</quote>
de: Beispiel: Display-Name <quote>meinrechner.foo:0</quote>, Klasse <quote>dpy</quote>

source: [X-myhost.foo:0_dpy] precedes
de: [X-meinrechner.foo:0_dpy] hat Vorrang vor

source: [X-myhost.foo:0_*] (same as [X-myhost.foo:0]) precedes
de: [X-meinrechner.foo:0_*] (identisch mit [X-meinrechner.foo:0]) hat Vorrang vor

source: [X-myhost.foo:*_dpy] precedes
de: [X-meinrechner.foo:*_dpy] hat Vorrang vor

source: [X-myhost.foo:*_*] (same as [X-myhost.foo]) precedes
de: [X-myhost.foo:*_*] (identisch mit [X-meinrechner.foo]) hat Vorrang vor

source: [X-.foo:*_*] (same as [X-.foo]) precedes
de: [X-.foo:*_*] (identisch mit [X-.foo]) hat Vorrang vor

source: [X-+:0_dpy] precedes
de: [X-+:0_dpy] hat Vorrang vor

source: [X-*:0_dpy] precedes
de: [X-*:0_dpy] hat Vorrang vor

source: [X-*:0_*] (same as [X-*:0]) precedes
de: [X-*:0_*] (identisch mit [X-*:0]) hat Vorrang vor

source: [X-*:*_*] (same as [X-*]).
de: [X-*:*_*] (identisch mit [X-*]).

source: These sections do <emphasis>not</emphasis> match this display:
de: Die folgenden Sektionen stimmen <emphasis>nicht</emphasis> mit diesem Display überein:

source: [X-hishost], [X-myhost.foo:0_dec], [X-*:1], [X-:*]
de: [X-seinrechner], [X-meinrechner.foo:0_dec], [X-*:1], [X-:*]

source: Common sections are [X-*] (all displays), [X-:*] (all local displays) and [X-:0] (the first local display).
de: Häufige Sektionen sind [X-*] (alle Displays), [X-:*] (alle lokalen Displays) und [X-:0] (der erste lokale Display).

source: The format for all keys is <userinput><option><replaceable>key</replaceable></option>&nbsp;<literal>=</literal>&nbsp;<parameter>value</parameter></userinput>. Keys are only valid in the section class they are defined for. Some keys do not apply to particular displays, in which case they are ignored.
de: Das Format aller Schlüssel ist <userinput><option><replaceable>Schlüssel</replaceable></option>&nbsp;<literal>=</literal>&nbsp; <parameter>Wert</parameter></userinput>. Schlüssel sind nur in Sektionen gültig, für die sie definiert sind. Manche Schlüssel sind für bestimmte Displays nicht anwendbar und werden dann ignoriert.

source: If a setting is not found in any matching section, the default is used.
de: Wird eine Einstellung in keiner passenden Sektion gefunden, wird die Voreinstellung verwendet.

source: Special characters need to be backslash-escaped (leading and trailing spaces (<literal>\s</literal>), tab (<literal>\t</literal>), linefeed (<literal>\n</literal>), carriage return (<literal>\r</literal>) and the backslash itself (<literal>\\</literal>)).
de: Sonderzeichen müssen durch einen Backslash geschützt werden (führende und anhängende Leerzeichen (<literal>\s</literal>), Tabulatoren (<literal>\t</literal>), Zeilenvorschub (<literal>\n</literal>), Wagenrücklauf (<literal>\r</literal>) und der Backslash selbst (<literal>\\</literal>).

source: In lists, fields are separated with commas without whitespace in between.
de: In Listen werden die Felder durch Kommata ohne Leerzeichen getrennt.

source: Some command strings are subject to simplified sh-style word splitting: single quotes (<literal>'</literal>) and double quotes (<literal>"</literal>) have the usual meaning; the backslash quotes everything (not only special characters). Note that the backslashes need to be doubled because of the two levels of quoting.
de: Einige Befehlszeichenketten werden nach den vereinfachten sh-Regeln in einzelne Teile (Wörter) aufgespalten. Einfache Anführungszeichen (<literal>'</literal>) und doppelte Anführungszeichen (<literal>"</literal>) haben die übliche Bedeutung, der Backslash kennzeichnet alles (nicht nur Sonderzeichen). Beachten Sie, dass Backslash-Zeichen verdoppelt werden müssen, da sie ansonsten nicht als Backslash ausgewertet werden.

source: A pristine &kdmrc; is very thoroughly commented. All comments will be lost if you change this file with the &systemsettings; frontend.
de: Eine jungfräuliche &kdmrc; ist sehr ausführlich dokumentiert. Alle Kommentare gehen verloren, sobald Sie die Datei über die &systemsettings; ändern.

source: The [General] section of &kdmrc;
de: Die Sektion [General] von &kdmrc;

source: This section contains global options that do not fit into any specific section.
de: Diese Sektion enthält globale Einstellungen, die in keine andere Sektion passen.

source: This option exists solely for the purpose of clean automatic upgrades. <emphasis>Do not</emphasis> change it, you may interfere with future upgrades and this could result in &kdm; failing to run.
de: Diese Einstellung existiert einzig zum Zwecke automatischer Upgrades. Ändern Sie sie <emphasis>nicht!</emphasis> Es könnte sein, dass ihre Änderung mit zukünftigen Upgrades nicht verträglich ist. Dies kann dazu führen, dass &kdm; nicht mehr startet.

source: List of displays (&X-Server;s) permanently managed by &kdm;. Displays with a hostname are foreign displays which are expected to be already running, the others are local displays for which &kdm; starts an own &X-Server;; see <option>ServerCmd</option>. Each display may belong to a display class; append it to the display name separated by an underscore. See <xref linkend="kdmrc-xservers"/> for the details.
de: Liste der Displays (&X-Server;), die dauerhaft von &kdm; verwaltet werden. Displays mit einem Rechnernamen sind bereits laufende entfernte Displays, die anderen sind lokale Displays, für die &kdm; einen neuen X-Server startet (siehe die Option <option>ServerCmd</option>). Jedes Display kann zu einer Display-Klasse gehören. Hängen Sie diese an den Namen des Displays nach einem Unterstrich an. Details dazu finden Sie unter <xref linkend="kdmrc-xservers"/>.

source: The default is <quote>:0</quote>.
de: Die Voreinstellung ist <quote>:0</quote>.

source: List of on-demand displays. See <option>StaticServers</option> for syntax.
de: List der Displays auf Anforderung. Siehe <option>StaticServers</option> für die Syntax.

source: Empty by default.
de: Per Voreinstellung leer.

source: List of Virtual Terminals to allocate to &X-Server;s. For negative numbers the absolute value is used, and the <acronym>VT</acronym> will be allocated only if the kernel says it is free. If &kdm; exhausts this list, it will allocate free <acronym>VT</acronym>s greater than the absolute value of the last entry in this list. Currently Linux only.
de: Liste der virtuellen Terminals, die einem X-Server zugeordnet werden. Für negative Werten wird der absolute Wert verwendet und das <acronym>VT</acronym> wird nur zugewiesen, falls der Kernel es als frei angibt. Wenn &kdm; die Liste ausgeschöpft hat, werden mehr <acronym>VT</acronym>s als der absolute Wert des letzten Eintrags zugewiesen. Dies gilt derzeit nur für Linux.

source: This option is for operating systems (<acronym>OS</acronym>s) with support for virtual terminals (<acronym>VT</acronym>s), by both &kdm; and the <acronym>OS</acronym>s itself. Currently this applies only to Linux.
de: Diese Option ist für Betriebssysteme (<acronym>BS</acronym>) mit Unterstützung für virtuelle Terminals (<acronym>VT</acronym>) sowohl durch &kdm; und das <acronym>BS</acronym> selbst. Derzeit gilt dies nur für Linux.

source: When &kdm; switches to console mode, it starts monitoring all <acronym>TTY</acronym> lines listed here (without the leading <literal>/dev/</literal>). If none of them is active for some time, &kdm; switches back to the X login.
de: Wenn &kdm; in den Konsolen-Modus umschaltet, überwacht es alle hier aufgeführten <acronym>TTY</acronym>-Zeilen (ohne das führende <literal>/dev/</literal>). Findet auf keinem davon innerhalb eines bestimmten Zeitraumes eine Aktivität statt, schaltet &kdm; zurück zur X-Anmeldeoberfläche.

source: The filename specified will be created to contain an ASCII representation of the process ID of the main &kdm; process; the PID will not be stored if the filename is empty.
de: Die angegebene Datei wird angelegt, um darin die ASCII-Darstellung der Prozess-ID des Hauptprozesses von &kdm; abzulegen. Ist kein Dateiname angegeben, wird die PID nicht abgelegt.

source: This option controls whether &kdm; uses file locking to keep multiple display managers from running onto each other.
de: Diese Option steuert, ob &kdm; Dateisperren verwendet, um zu verhindern, dass mehrere Display-Manager auf einander laufen.

source: The default is <quote>true</quote>.
de: Die Voreinstellung ist <quote>true</quote>.

source: This names a directory under which &kdm; stores &X-Server; authorization files while initializing the session. &kdm; expects the system to clean up this directory from stale files on reboot.
de: Hier wird der Ordner eingetragen, in dem &kdm; die Autorisierungsdateien des &X-Server; speichert, während die Sitzung initialisiert wird. &kdm; erwartet, dass hier liegengebliebene Dateien vom System bei einem Neustart entfernt werden.

source: The authorization file to be used for a particular display can be specified with the <option>AuthFile</option> option in [X-*-Core].
de: Die Autorisierungsdatei für ein bestimmtes Display kann mit <option>AuthFile</option> in [X-*-Core] angegeben werden.

source: The default is <quote>/var/run/xauth</quote>.
de: Die Voreinstellung ist <quote>/var/run/xauth</quote>.

source: This boolean controls whether &kdm; automatically re-reads its configuration files if it finds them to have changed.
de: Dieser boolesche Wert steuert, ob &kdm; seine Konfigurationsdateien automatisch neu einliest, wenn es feststellt, dass diese geändert wurden.

source: Additional environment variables &kdm; should pass on to all programs it runs. <envar>LD_LIBRARY_PATH</envar> and <envar>XCURSOR_THEME</envar> are good candidates; otherwise, it should not be necessary very often.
de: Zusätzliche Umgebungsvariablen, die &kdm; an alle von ihm gestarteten Programme übergibt. <envar>LD_LIBRARY_PATH</envar> und <envar>XCURSOR_THEME</envar> sind gute Kandidaten, andere Umgebungsvariablen sind nur selten nötig.

source: If the system has no native entropy source like /dev/urandom (see <option>RandomDevice</option>) and no entropy daemon like EGD (see <option>PrngdSocket</option> and <option>PrngdPort</option>) is running, &kdm; will fall back to its own pseudo-random number generator that will, among other things, successively checksum parts of this file (which, obviously, should change frequently).
de: Falls das System keine eigene Entropie-Quelle wie /dev/urandom besitzt (siehe dazu die Option <option>RandomDevice</option>) und kein Entropie-Dienst wie EGD läuft (siehe dazu die Option <option>PrngdSocket</option> und <option>PrngdPort</option>), dann wird &kdm; den eingebauten Zufallszahlengenerator einsetzen. Unter anderem erstellt dieser nacheinander Prüfsummen aus Teilen dieser Datei (deren Inhalt sich häufig ändern sollte).

source: This option does not exist on Linux and various BSDs.
de: Diese Option existiert nicht unter Linux und verschiedenen BSD-Systemen.

source: The default is <quote>/dev/mem</quote>.
de: Die Voreinstellung ist <quote>/dev/mem</quote>.

source: If the system has no native entropy source like /dev/urandom (see <option>RandomDevice</option>), read random data from a Pseudo-Random Number Generator Daemon, like EGD (http://egd.sourceforge.net) via this UNIX domain socket.
de: Falls das System keinen eigenen Zufallsgenerator wie &eg; /dev/urandom enthält (siehe <option>RandomDevice</option>), werden zufällige Daten aus diesem UNIX-Socket eines Pseudo-Zufallszahlengenerators wie EGD gelesen (http://egd.sourceforge.net).

source: Same as <option>PrngdSocket</option>, only use a TCP socket on localhost.
de: Das Selbe wie <option>PrngdSocket</option>, auf localhost nur TCP-Sockets verwenden.

source: The path to a character device which &kdm; should read random data from. Empty means to use the system's preferred entropy device if there is one.
de: Der Pfad zum zeichenbasierten Gerät, von dem &kdm; Zufallsdaten lesen soll. Ist dieser Eintrag leer, wird das vom System bevorzugte Gerät für Entropie verwendet.

source: This option does not exist on OpenBSD, as it uses the arc4_random function instead.
de: Diese Option existiert nicht auf OpenBSD, da es stattdessen die Funktion arc4_random verwendet.

source: The directory in which the command sockets should be created; make it empty to disable them.
de: Der Ordner, in dem die Befehls-Sockets erzeugt werden sollen. Zum Abschalten diese Option leer lassen.

source: The default is <quote>/var/run/xdmctl</quote>.
de: Die Voreinstellung ist <quote>/var/run/xdmctl</quote>.

source: The group to which the global command socket should belong; can be either a name or a numerical ID.
de: Die Gruppe, zu dem der globale Befehl Socket gehören soll. Entweder ein Name oder eine numerische ID.

source: The user the greeter should run as. Empty results in <systemitem class="username">root</systemitem>. Consider the impact on <option>LogSource</option> when setting it.
de: Der Benutzer, unter welchem das Anmeldefenster ausgeführt wird. Bei leerer Einstellung wird der Systemverwalter (<systemitem class="username">root</systemitem>) verwendet. Beachten Sie beim Einstellen den Einfluss auf <option>LogSource</option>.

source: The directory in which &kdm; should store persistent working data; such data is, for example, the previous user that logged in on a particular display.
de: In diesem Ordner speichert &kdm; seine dauerhaften Arbeitsdaten ab. Es handelt sich dabei um Daten wie &eg; den zuvor auf einem bestimmten Display angemeldeten Benutzer.

source: The default is <quote>/var/lib/kdm</quote>.
de: Die Voreinstellung ist <quote>/var/lib/kdm</quote>.

source: The directory in which &kdm; should store users' <filename>.dmrc</filename> files. This is only needed if the home directories are not readable before actually logging in (like with AFS).
de: Der Ordner, in dem &kdm; die <filename>.dmrc</filename>-Dateien von Benutzern speichert. Dies wird nur benötigt, wenn die Persönlichen Ordner vor der Benutzeranmeldung nicht lesbar sind (so ist es &eg; bei AFS).

source: The [Xdmcp] section of &kdmrc;
de: Die Sektion [Xdmcp] von &kdmrc;

source: This section contains options that control &kdm;'s handling of &XDMCP; requests.
de: Dieser Abschnitt enthält Optionen, welche das Verhalten von &kdm; bei Anfragen über &XDMCP; festlegen.

source: Whether &kdm; should listen to incoming &XDMCP; requests.
de: Soll &kdm; auf eingehende Anfragen von &XDMCP; warten.

source: This indicates the UDP port number which &kdm; uses to listen for incoming &XDMCP; requests. Unless you need to debug the system, leave this with its default value.
de: Dies gibt den UDP-Port an, den &kdm; zum Warten auf eingehende &XDMCP;-Anfragen verwendet. Sofern Sie keine Fehlersuche auf Ihrem System betreiben, sollten Sie diesen Wert in der Voreinstellung belassen.

source: The default is <quote>177</quote>.
de: Die Voreinstellung ist <quote>177</quote>.

source: XDM-AUTHENTICATION-1 style &XDMCP; authentication requires a private key to be shared between &kdm; and the terminal. This option specifies the file containing those values. Each entry in the file consists of a display name and the shared key.
de: Eine &XDMCP;-Authentifizierung nach XDM-AUTHENTICATION-1 erfordert einen zwischen &kdm; und dem Terminal gemeinsam genutzten privaten Schlüssel. Mit dieser Option geben Sie die Datei an, die die nötigen Informationen enthält. Jeder Eintrag in der Datei enthält einen Display-Namen und den gemeinsamen privaten Schlüssel.

source: To prevent unauthorized &XDMCP; service and to allow forwarding of &XDMCP; IndirectQuery requests, this file contains a database of hostnames which are either allowed direct access to this machine, or have a list of hosts to which queries should be forwarded to. The format of this file is described in <xref linkend="kdmrc-xaccess"/>.
de: Um nicht autorisierte &XDMCP;-Dienste zu verhindern und die Weiterleitung von &XDMCP;-IndirectQuery-Anfragen zu ermöglichen, enthält diese Datei eine Datenbank mit Rechnernamen, denen entweder direkter Zugriff auf diesen Rechner erlaubt wird oder eine Liste mit Rechnern, an die solche Anfragen weitergeleitet werden sollen. Das Format dieser Datei wird unter <xref linkend="kdmrc-xaccess"/> beschrieben.

source: The default is <quote>${<envar>kde_confdir</envar>}/kdm/Xaccess</quote>.
de: Die Voreinstellung ist <quote>$<envar>kde_confdir</envar>/kdm/Xaccess</quote>.

source: Number of seconds to wait for the display to respond after the user has selected a host from the chooser. If the display sends an &XDMCP; IndirectQuery within this time, the request is forwarded to the chosen host; otherwise, it is assumed to be from a new session and the chooser is offered again.
de: Dies ist die Anzahl Sekunden, die gewartet werden soll, nachdem der Benutzer einen Rechner ausgewählt hat. Wenn das Display innerhalb der Wartezeit eine &XDMCP;-IndirectQuery sendet, wird die Anfrage an den ausgewählten Rechner weitergeleitet. Ansonsten wird von einer neuen Sitzung ausgegangen und der Auswähler wird erneut angezeigt.

source: The default is <quote>15</quote>.
de: Die Voreinstellung ist <quote>15</quote>.

source: When computing the display name for &XDMCP; clients, the name resolver will typically create a fully qualified host name for the terminal. As this is sometimes confusing, &kdm; will remove the domain name portion of the host name if it is the same as the domain name of the local host when this option is enabled.
de: Beim Zusammenstellen des Display-Namens für &XDMCP;-Clients wird durch die Namensauflösung typischerweise ein voll qualifizierter Rechnername für das Terminal erzeugt. Weil dies manchmal verwirrend sein kann, entfernt &kdm; den Domänennamen vom FQHN, sofern er der Domäne des lokalen Rechners entspricht und diese Option aktiviert ist.

source: Use the numeric IP address of the incoming connection on multihomed hosts instead of the host name. This is to avoid trying to connect on the wrong interface which might be down at this time.
de: Legt fest, dass die numerische IP-Adresse der eingehenden Verbindung auf Multihomed-Rechnern anstelle des Rechnernamens verwendet werden soll. Dies wird verwendet, um zu Verbindungsversuche auf einem falschen (möglicherweise deaktivierten) Netzwerkgerät zu verhindern.

source: The default is <quote>false</quote>.
de: Die Voreinstellung ist <quote>false</quote>.
