Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kde-workspace/kdm_kdmrc-ref.po
Languages: de

source: no forced shutdown is allowed at all
de: es ist überhaupt kein erzwungenes Herunterfahren erlaubt

source: the <systemitem class="username">root</systemitem> password must be entered to shut down forcibly
de: das <systemitem class="username">root</systemitem>-Passwort muss zum erzwungenen Herunterfahren eingeben werden

source: everybody can shut down the machine forcibly
de: Jeder kann das Herunterfahren des Rechners erzwingen

source: The default choice for the shutdown condition/timing.
de: Die Voreinstellung zum Herunterfahren und zur Zeiteinstellung

source: shut down after all active sessions exit (possibly at once)
de: Herunterfahren, nachdem alle aktiven Sitzungen beendet wurden (möglicherweise auf einmal)

source: shut down, if no active sessions are open; otherwise, do nothing
de: Herunterfahren, wenn keine aktiven Sitzungen offen sind; ansonsten geschieht nichts

source: shut down unconditionally
de: bedingungslos Herunterfahren

source: The default is <quote>Schedule</quote>.
de: Die Voreinstellung ist <quote>Schedule</quote>.

source: How to offer shutdown scheduling options:
de: Wie soll der Zeitplan zum Herunterfahren angeboten werden:

source: not at all
de: überhaupt nicht

source: as a button in the simple shutdown dialogs
de: als Knopf in einfachen Herunterfahren-Dialogen

source: instead of the simple shutdown dialogs
de: anstelle der einfachen Herunterfahren-Dialoge

source: The default is <quote>Never</quote>.
de: Die Voreinstellung ist <quote>Never</quote>.

source: Enable password-less logins on this display. <emphasis>Use with extreme care!</emphasis>
de: Passwortlose Anmeldungen auf diesem Display zulassen. <emphasis>Nur mit größter Vorsicht verwenden!</emphasis>

source: The users that do not need to provide a password to log in. Items which are prefixed with <literal>@</literal> represent all users in the user group named by that item. <literal>*</literal> means all users but <systemitem class="username">root</systemitem> (and any other user with UID = 0). <emphasis>Never</emphasis> list <systemitem class="username">root</systemitem>.
de: Die Benutzer, die kein Passwort zur Anmeldung benötigen. Einträge mit einem vorangestellten <literal>@</literal> repräsentieren alle Benutzer in der so benannten Gruppe. <literal>*</literal> meint alle Benutzer außer <systemitem class="username">root</systemitem> (und jeden anderen Benutzer mit der UID=0). Tragen Sie hier <emphasis>niemals</emphasis> den Benutzer <systemitem class="username">root</systemitem> ein!

source: Enable automatic login. <emphasis>Use with extreme care!</emphasis>
de: Aktiviert die automatische Anmeldung. <emphasis>Verwenden Sie diese Einstellung mit größter Vorsicht!</emphasis>

source: If true, auto-login after logout. If false, auto-login is performed only when a display session starts up.
de: Falls wahr, wird nach dem Abmelden erneut automatisch angemeldet. Ansonsten wird die automatische Anmeldung nur beim Start einer Display-Sitzung verwendet.

source: The delay in seconds before automatic login kicks in. This is also known as <quote>Timed Login</quote>.
de: Die Wartezeit in Sekunden, bevor die automatische Anmeldung durchgeführt wird. Dies wird auch <quote>zeitgesteuerte Anmeldung</quote> genannt.

source: The user to log in automatically. <emphasis>Never</emphasis> specify <systemitem class="username">root</systemitem>!
de: Der automatisch anzumeldende Benutzer. Geben Sie hier <emphasis>niemals</emphasis> den Benutzer <systemitem class="username">root</systemitem> an!

source: The password for the user to log in automatically. This is <emphasis>not</emphasis> required unless the user is logged into a <acronym>NIS</acronym> or Kerberos domain. If you use this option, you should <command>chmod&nbsp;<option>600</option>&nbsp;<filename>kdmrc</filename></command> for obvious reasons.
de: Das Passwort für den automatisch anzumeldenden Benutzer. Dies wird <emphasis>nicht</emphasis> benötigt, es sei denn der Benutzer wird in einer <acronym>NIS</acronym>- oder Kerberos-Domäne angemeldet. Wenn Sie diese Option verwenden, sollten Sie <command>chmod&nbsp;<option>600</option>&nbsp;<filename>kdmrc</filename></command> ausführen, damit das Passwort nicht durch jeden lesbar ist.

source: Immediately lock the automatically started session. This works only with KDE sessions.
de: Durch diese Option wird die Sitzung sofort nach der Anmeldung gesperrt. Dies funktioniert allerdings nur mit KDE-Sitzungen.

source: A list of directories containing session type definitions. Ordered by falling priority.
de: Eine nach Priorität sortierte Liste mit Ordnern, die Sitzungsbeschreibungen enthalten.

source: The default is <quote>${<envar>kde_datadir</envar>}/kdm/sessions</quote>.
de: Die Voreinstellung ist <quote>${<envar>kde_datadir</envar>}/kdm/sessions</quote>.

source: The file (relative to the user's home directory) to redirect the session output to.
de: Die Datei (relativ zum Heimatordner des Benutzers), in die die Ausgaben der Sitzung umgeleitet werden.

source: The following character pairs are replaced by their value: <variablelist> <varlistentry> <term><parameter>%d</parameter></term> <listitem><para>name of the current display</para></listitem> </varlistentry> <varlistentry> <term><parameter>%u</parameter></term> <listitem><para>login name of the current user</para></listitem> </varlistentry> <varlistentry> <term><parameter>%r</parameter></term> <listitem><para>empty at first. See below.</para></listitem> </varlistentry> <varlistentry> <term><parameter>%%</parameter></term> <listitem><para>a single <literal>%</literal></para></listitem> </varlistentry> </variablelist> When the constructed filename cannot be used safely and the specification contains <literal>%</literal><replaceable>stuff</replaceable><literal>r</literal>, other names will be tried - this time expanding <literal>%</literal><replaceable>stuff</replaceable><literal>r</literal> to <replaceable>stuff</replaceable> followed by a random number.
de: Die folgenden Zeichenpaare werden durch ihren jeweiligen Wert ersetzt: <variablelist> <varlistentry> <term><parameter>%d</parameter></term> <listitem><para>Name des aktuellen Displays</para></listitem> </varlistentry> <varlistentry> <term><parameter>%u</parameter></term> <listitem><para>Benutzername des aktuellen Benutzers</para></listitem> </varlistentry> <varlistentry> <term><parameter>%r</parameter></term> <listitem><para>Zunächst leer. Siehe unten.</para></listitem> </varlistentry> <varlistentry> <term><parameter>%%</parameter></term> <listitem><para>ein einzelnes <literal>%</literal></para></listitem> </varlistentry> </variablelist> Wenn der konstruierte Dateiname nicht mit Sicherheit verwendet werden kann und die Spezifikation enthält <literal>%</literal><replaceable>Irgendwas</replaceable><literal>r</literal>, werden andere Namen versucht - diesmal wird <literal>%</literal><replaceable>Irgendwas</replaceable><literal>r</literal> zu <replaceable>Irgendwas</replaceable> gefolgt von einer Zufallszahl aufgelöst.

source: The default is <quote>.xsession-errors</quote>.
de: Die Voreinstellung ist <quote>.xsession-errors</quote>.

source: Fallback when <option>ClientLogFile</option> cannot be used. The same expansions are supported. <emphasis>Do not</emphasis> use relative paths here.
de: Alternativlösung, wenn <option>ClientLogFile</option> nicht benutzt werden kann. Hierbei gelten dieselben Expansionsregeln. Benutzen Sie hier <emphasis>keine</emphasis> relativen Pfade.

source: The default is <quote>/tmp/xerr-%u-%d%-r</quote>.
de: Die Voreinstellung ist <quote>/tmp/xerr-%u-%d%-r</quote>.

source: Specify whether &kdm;'s built-in utmp/wtmp/lastlog registration should be used. If it is not, the tool <command>sessreg</command> should be used in the <option>Startup</option> and <option>Reset</option> scripts, or, alternatively, the pam_lastlog module should be used on <acronym>PAM</acronym>-enabled systems.
de: Gibt an, ob &kdm;s eingebaute Registrierung in utmp/wtmp/lastlog benutzt werden soll. Falls nicht, sollte das Programm <command>sessreg</command> in den Skripten <option>Startup</option> und <option>Reset</option>, oder alternativ das <acronym>PAM</acronym>-Modul pam_lastlog, verwendet werden.

source: The [X-*-Greeter] section class of &kdmrc;
de: Die [X-*Greeter] Abschnittklasse von &kdmrc;

source: This section class contains options concerning the configuration of the &kdm; frontend (greeter).
de: Diese Abschnittklasse enthält Optionen, die die Einrichtung des &kdm;-Anmeldefensters (Greeter) betreffen.

source: Specify the widget style for the greeter. Empty means to use the built-in default which currently is <literal>Oxygen-air</literal>.
de: Geben Sie den Stil der Bedienelemente für das Anmeldefenster an. Wenn Sie die Option leer lassen, wird die eingebaute Voreinstellung verwendet (derzeit <literal>Oxygen-Air</literal>).

source: Specify the widget color scheme for the greeter. Empty means to use the built-in default which currently is <literal>Oxygen-air</literal>.
de: Geben Sie das Farbschema der Bedienelemente für das Anmeldefenster an. Wenn Sie die Option leer lassen, wird die eingebaute Voreinstellung verwendet (derzeit <literal>Oxygen-Air</literal>).

source: What should be shown in the greeter righthand of the input lines (if <option>UserList</option> is disabled) or above them (if <option>UserList</option> is enabled):
de: Legt fest, was im Anmeldefenster rechts neben den Eingabe-Textfeldern, bzw. falls <option>UserList</option> abgeschaltet ist, über ihnen angezeigt werden soll:

source: the image specified by <option>LogoPixmap</option>
de: das mit <option>LogoPixmap</option> angegebene Bild

source: a neat analog clock
de: eine schicke analoge Uhr

source: The default is <quote>Clock</quote>.
de: Die Voreinstellung ist <quote>Clock</quote>.

source: The image to show in the greeter if <option>LogoArea</option> is <literal>Logo</literal>.
de: Das im Anmeldefenster anzuzeigende Bild, falls <option>LogoArea</option> auf <literal>Logo</literal> eingestellt ist.

source: The relative coordinates (percentages of the screen size; X,Y) at which the center of the greeter is put. &kdm; aligns the greeter to the edges of the screen it would cross otherwise.
de: Die relative Position (in Prozent der Bildschirmgröße; X, Y), an der die Mitte des Anmeldefensters erscheinen soll. &kdm; richtet das Fenster an den Bildschirmrändern aus, die es sonst möglicherweise überschneiden würde.

source: The default is <quote>50,50</quote>.
de: Die Voreinstellung ist <quote>50,50</quote>.

source: The screen the greeter should be displayed on in multi-headed and Xinerama setups. The numbering starts with 0. For Xinerama, it corresponds to the listing order in the active ServerLayout section of XF86Config; -1 means to use the upper-left screen, -2 means to use the upper-right screen.
de: Dies ist der Bildschirm, auf dem das Anmeldefenster auf Mehrschirmsystemen (Multi-Head, Xinerama) erscheinen soll. Die Nummerierung beginnt bei 0. Bei Xinerama entspricht dies der Reihenfolge der Auflistung im Bereich ServerLayout der Datei XF86Config. -1 bedeutet, den Bildschirm oben links zu verwenden, -2 ist der Bildschirm oben rechts.

source: The headline in the greeter. An empty greeting means none at all.
de: Die Überschrift im Anmeldefenster. Ein leerer Eintrag deaktiviert die Überschrift.

source: The following character pairs are replaced by their value:
de: Die folgenden Platzhalter werden durch entsprechenden Werte ersetzt:

source: name of the current display
de: Name des aktuellen Displays

source: local host name, possibly with the domain name
de: der lokale Rechnername, möglicherweise mit Domänenname

source: local node name, most probably the host name without the domain name
de: lokaler Rechnername, höchstwahrscheinlich der Rechnername ohne den Domänennamen

source: operating system
de: das Betriebssystem

source: operating system version
de: die Betriebssystemversion

source: machine (hardware) type
de: Maschinentyp (Hardwarebezogen)

source: a single <literal>%</literal>
de: das Prozentzeichen <literal>%</literal>

source: The default is <quote>Welcome to %s at %n</quote>.
de: Die Voreinstellung ist <quote>Willkommen zu %s auf %n</quote>.

source: Whether the fonts used in the greeter should be antialiased.
de: Legt fest, ob die Kantenglättung für die Schrift im Anmeldefenster aktiviert werden soll.

source: The font for the greeter headline. The value is encoded.
de: Die Schriftart für die Überschrift des Anmeldefensters. Der Wert ist kodiert.

source: The default is <quote>Serif 20pt bold</quote>.
de: Die Voreinstellung ist <quote>Serif 20pt fett</quote>.

source: The normal font used in the greeter. The value is encoded.
de: Die normale Schrift im Anmeldefenster. Der Wert ist kodiert.

source: The default is <quote>Sans Serif 10pt</quote>.
de: Die Voreinstellung ist <quote>Sans Serif 10pt</quote>.

source: The font used for the <quote>Login Failed</quote> message. The value is encoded.
de: Die Schriftart, die für die Nachricht <quote>Anmeldung fehlgeschlagen</quote> verwendet wird. Der Wert ist kodiert.

source: The default is <quote>Sans Serif 10pt bold</quote>.
de: Die Voreinstellung ist <quote>Sans Serif 10pt fett</quote>.

source: What to do with the Num Lock modifier for the time the greeter is running:
de: Legt den Status der Num Lock-Taste im Anmeldefenster fest:

source: turn off
de: abschalten

source: turn on
de: einschalten

source: do not change the state
de: den aktuellen Status beibehalten

source: The default is <quote>Keep</quote>.
de: Die Voreinstellung ist <quote>Keep</quote>.

source: Language and locale to use in the greeter, encoded like $<envar>LANGUAGE</envar>. If empty, the settings from the environment are used.
de: Die im Anmeldefenster zu verwendenden Regional- und Spracheinstellung, kodiert wie $<envar>LANGUAGE</envar>. Falls leer, wird die systemweite Einstellung verwendet.

source: Enable autocompletion in the username line edit.
de: Aktiviert die automatische Vervollständigung im Textfeld für den Benutzernamen.

source: Show a user list with unix login names, real names, and images in the greeter.
de: Zeigt eine Liste mit Benutzernamen, echten Namen und Bildern im Anmeldefenster an.

source: This option controls which users will be shown in the user view (<option>UserList</option>) and/or offered for autocompletion (<option>UserCompletion</option>). If it is <literal>Selected</literal>, <option>SelectedUsers</option> contains the final list of users. If it is <literal>NotHidden</literal>, the initial user list contains all users found on the system. Users contained in <option>HiddenUsers</option> are removed from the list, just like all users with a UID greater than specified in <option>MaxShowUID</option> and users with a non-zero UID less than specified in <option>MinShowUID</option>. Items in <option>SelectedUsers</option> and <option>HiddenUsers</option> which are prefixed with <literal>@</literal> represent all users in the user group named by that item. Finally, the user list will be sorted alphabetically, if <option>SortUsers</option> is enabled.
de: Diese Einstellung legt fest, welche Benutzer in der Benutzerliste (Option <option>UserList</option>) angezeigt werden und/oder für die Autovervollständigung (<option>UserCompletion</option>) zur Verfügung stehen. Bei Wahl von <literal>Selected</literal> enthält <option>SelectedUsers</option> eine endgültige Liste der Benutzer. Mit der Einstellung <literal>NotHidden</literal> enthält die Liste anfangs alle im System gefundenen Benutzer. In <literal>HiddenUsers</literal> aufgeführte Benutzer werden aus der Liste entfernt, genauso wie alle Benutzer mit einer UID größer <option>MaxShowUID</option> sowie Benutzer mit einer UID,die nicht 0 und kleiner als <option>MinShowUID</option> ist. Einträge in <option>SelectedUsers</option> und <option>HiddenUsers</option> mit einem vorangestellten <literal>@</literal> repräsentieren alle Benutzer der so genannten Gruppe. Schlussendlich wird die fertige Liste alphabetisch sortiert, sofern die Option <option>SortUsers</option> aktiviert ist.

source: The default is <quote>NotHidden</quote>.
de: Die Voreinstellung ist <quote>NotHidden</quote>.

source: See <option>ShowUsers</option>.
de: Siehe <option>ShowUsers</option>.

source: The default is <quote>65535</quote>.
de: Die Voreinstellung ist <quote>65535</quote>.

source: If <option>UserList</option> is enabled, this specifies where &kdm; gets the images from:
de: Wenn <option>UserList</option> aktiviert ist, wird hiermit angegeben, aus welchen Quellen &kdm; die Benutzerbilder bezieht:

source: from <filename>&lt;<option>FaceDir</option>&gt;/$<envar>USER</envar>.face[.icon]</filename>
de: aus <filename>&lt;<option>FaceDir</option>&gt;/$<envar>USER</envar>.face[.icon]</filename>

source: prefer &lt;<option>FaceDir</option>&gt;, fallback on $<envar>HOME</envar>
de: bevorzugt &lt;<option>FaceDir</option>&gt;, ansonsten $<envar>HOME</envar>

source: ... and the other way round
de: ... und anders herum

source: from the user's <filename>$<envar>HOME</envar>/.face[.icon]</filename>
de: aus dem Persönlichen Ordner <filename>$<envar>HOME</envar>/.face[.icon]</filename> des Benutzers

source: The images can be in any format Qt recognizes, but the filename must match &kdm;'s expectations: <literal>.face.icon</literal> should be a 48x48 icon, while <literal>.face</literal> should be a 300x300 image. Currently the big image is used only as a fallback and is scaled down, but in the future it might be displayed full-size in the logo area or a tooltip. To be accessible to &kdm;, the images must be world readable and their parent directories must be world executable.
de: Die Bilder dürfen in jedem von Qt unterstützten Format vorliegen, aber der Dateiname muss den folgenden Erwartungen von &kdm; entsprechen: <literal>.face.icon</literal> muss ein 48x48 Pixel großes Symbol sein, während <literal>.face</literal> ein 300x300 Pixel großes Bild ist. Derzeit wird das große Bild nur als Alternative verwendet und herunter skaliert, möglicherweise wird es aber in Zukunft auch im Logobereich oder einem Kurztipp angezeigt. Damit sie von &kdm; gelesen werden können, müssen die Bilder für alle lesbar, sowie der übergeordnete Ordner für alle ausführbar sein.

source: The default is <quote>AdminOnly</quote>.
de: Die Voreinstellung ist <quote>AdminOnly</quote>.

source: See <option>FaceSource</option>.
de: Siehe <option>FaceSource</option>.

source: The default is <quote>${<envar>kde_datadir</envar>}/kdm/faces</quote>.
de: Die Voreinstellung ist <quote>${<envar>kde_datadir</envar>}/kdm/faces</quote>.

source: Specify, if/which user should be preselected for log in:
de: Gibt an, ob und welcher Benutzer für die Anmeldung vorausgewählt sein soll:

source: do not preselect any user
de: keinen Benutzer vorauswählen

source: the user which successfully logged in last time
de: der Benutzer, der sich als letzter erfolgreich angemeldet hat

source: the user specified in the <option>DefaultUser</option> option
de: Der Benutzer, der in der Option <option>DefaultUser</option> angegeben ist

source: If <option>FocusPasswd</option> is enabled and a user was preselected, the cursor is placed in the password input field automatically.
de: Falls <option>FocusPassword</option> aktiviert ist und ein Benutzer vorausgewählt wurde, so wird der Cursor automatisch in das Passworteingabefeld gestellt, sodass direkt mit der Passworteingabe begonnen werden kann.

source: Enabling user preselection can be considered a security hole, as it presents a valid login name to a potential attacker, so he <quote>only</quote> needs to guess the password. On the other hand, one could set <option>DefaultUser</option> to a fake login name.
de: Die Vorauswahl eines Benutzers kann als Sicherheitsrisiko empfunden werden, weil einem möglichen Angreifer auf diese Weise ein gültiger Benutzername verraten wird. Nun muss er <quote>nur</quote> noch das Passwort erraten und nicht mehr beides. Auf der anderen Seite könnte man auch <option>DefaultUser</option> entsprechend setzen, um einen gefälschten Benutzernamen einzustellen.

source: See <option>PreselectUser</option>.
de: Siehe <option>PreselectUser</option>.

source: If this is true, the entered password is echoed as bullets. Otherwise, no feedback is given at all.
de: Wenn true, wird das eingegebene Passwort in Form von Sternchen dargestellt. Anderenfalls erfolgt bei Eingabe des Passworts keine sichtbare Ausgabe.

source: If enabled, &kdm; will automatically start the <command>krootimage</command> program to set up the background; otherwise, the <option>Setup</option> program is responsible for the background.
de: Falls aktiviert, wird &kdm; automatisch das Programm <command>krootimage</command> starten, um den Hintergrund einzurichten. Ansonsten ist Das <option>Setup</option>-Programm dafür zuständig.

source: The configuration file to be used by <command>krootimage</command>. It contains a section named <literal>[Desktop0]</literal> like <filename>kdesktoprc</filename> does. Its options are not described herein; guess their meanings or use the control center.
de: Die Konfigurationsdatei für <command>krootimage</command>. Sie enthält einen Abschnitt <literal>[Desktop0]</literal>, genauso wie <filename>kdesktoprc</filename> auch. Die Optionen werden hier nicht weiter beschrieben. Erraten Sie deren Bedeutung oder verwenden Sie das Kontrollzentrum zur Einstellung.

source: The default is <quote>${<envar>kde_confdir</envar>}/kdm/backgroundrc</quote>.
de: Die Voreinstellung ist <quote>${<envar>kde_confdir</envar>}/kdm/backgroundrc</quote>.

source: To improve security, the greeter may grab mouse and keyboard input so no other X clients can eavesdrop it. However, the X authorization mechanism will usually prevent malicious X clients from connecting in the first place. Consequently, enabling grabs for local displays is pointless and only marginally improves security for remote displays.
de: Zur Erhöhung der Sicherheit kann das Anmeldefenster Maus und Tastatur exklusiv beanspruchen, damit keine anderen X-Clients mithören können. Allerdings sorgt das X-Autorisierungsverfahren normalerweise dafür, dass bösartige X-Clients gar nicht erst verbinden können. Aus diesem Grund ist das Beanspruchen lokaler Displays sinnlos und erhöht die Sicherheit bei entfernten Displays nur geringfügig.

source: The mouse grab will make on-screen keyboards unusable.
de: Durch das exklusive Beanspruchen der Maus können Bildschirmtastaturen nicht benutzt werden.

source: never grab
de: niemals beanspruchen

source: grab if the display requires no X authorization
de: beanspruchen, wenn das Display keine X-Autorisierung benötigt

source: always grab
de: immer beanspruchen

source: The default is <quote>IfNoAuth</quote>.
de: Die Voreinstellung ist <quote>IfNoAuth</quote>.

source: To improve security, the greeter grabs the &X-Server; and then the input when it starts up. This option specifies if the &X-Server; grab should be held for the duration of the name/password reading. When disabled, the &X-Server; is ungrabbed after the input grabs succeed; otherwise, the &X-Server; is grabbed until just before the session begins.
de: Zur Erhöhung der Sicherheit beansprucht das Anmeldefenster exklusiv den &X-Server; und anschließend beim Start die Eingabe. Diese Option gibt an, ob die Beanspruchung für die Dauer des Auslesens von Name und Passwort beibehalten werden soll. Wenn deaktiviert, wird der &X-Server; wieder freigegeben, sobald die Eingabe erfolgreich beansprucht wurde, ansonsten wird der &X-Server; bis kurz vor den Sitzungsstart beansprucht.
