Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kde-workspace/kdm_kdmrc-ref.po
Languages: de

source: This specifies a program which is run (as <systemitem class="username">root</systemitem>) when an &XDMCP; DirectQuery or BroadcastQuery is received and this host is configured to offer &XDMCP; display management. The output of this program may be displayed in a chooser window. If no program is specified, the string <quote>Willing to manage</quote> is sent.
de: Dies gibt ein Programm an, welches (als <systemitem class="username">Systemverwalter</systemitem>) ausgeführt wird, wenn ein &XDMCP;-DirectQuery oder BroadcastQuery empfangen wird und dieser Rechner &XDMCP;-Display-Management anbietet. Die Ausgabe des Programms kann in einem Chooser-Fenster angezeigt werden. Wenn kein Programm angegeben ist, wird der Text <quote>Willing to manage</quote> gesendet.

source: The [Shutdown] section of &kdmrc;
de: Die Sektion [Shutdown] von &kdmrc;

source: This section contains global options concerning system shutdown.
de: Dieser Bereich enthält globale Optionen, die das Herunterfahren des Systems betreffen.

source: The command (subject to word splitting) to run to halt/poweroff the system.
de: Der Befehl zum Anhalten bzw. Herunterfahren des Rechners. Diese Zeichenfolge wird in einzelne Wörter aufgespalten.

source: The default is something reasonable for the system on which &kdm; was built, like <command>/sbin/shutdown&nbsp;<option>-h</option>&nbsp;<parameter>now</parameter></command>.
de: Die Voreinstellung ist ein sinnvoller Befehl für das System, auf dem &kdm; kompiliert wurde. Beispielsweise: <command>/sbin/shutdown&nbsp;<option>-h</option>&nbsp;<parameter>now</parameter></command>.

source: The command (subject to word splitting) to run to reboot the system.
de: Der Befehl zum Neustarten des Rechners. Diese Zeichenfolge wird in einzelne Wörter aufgespalten.

source: The default is something reasonable for the system &kdm; on which was built, like <command>/sbin/shutdown&nbsp;<option>-r</option>&nbsp;<parameter>now</parameter></command>.
de: Die Voreinstellung ist ein sinnvoller Befehl für das System, auf dem &kdm; kompiliert wurde. Beispielsweise: <command>/sbin/shutdown&nbsp;<option>-r</option>&nbsp;<parameter>now</parameter></command>.

source: Whether it is allowed to shut down the system via the global command socket.
de: Gibt an, ob es erlaubt ist, das System mit Hilfe des globalen Befehls-Sockets herunterzufahren.

source: Whether it is allowed to abort active sessions when shutting down the system via the global command socket.
de: Legt fest, ob das Abbrechen aktiver Sitzungen erlaubt ist, wenn das System über den globalen Befehls-Socket heruntergefahren wird.

source: This will have no effect unless <option>AllowFifo</option> is enabled.
de: Dies wird erst wirksam, wenn <option>AllowFifo</option> aktiviert ist.

source: The boot manager &kdm; should use for offering boot options in the shutdown dialog.
de: Dies legt den Boot-Manager fest, den &kdm; zum Anbieten von Startmöglichkeiten im Dialog zum Herunterfahren verwenden soll.

source: no boot manager
de: Kein Boot-Manager

source: Lilo boot manager (Linux on i386 &amp; x86-64 only)
de: Lilo Boot-Manager (Linux nur auf i386 &amp; x86-64)

source: The default is <quote>None</quote>.
de: Die Voreinstellung ist <quote>None</quote>.

source: The [X-*-Core] section class of &kdmrc;
de: Die Sektionsklasse [X-*-Core] von &kdmrc;

source: This section class contains options concerning the configuration of the &kdm; backend (core).
de: Diese Sektionsklasse enthält Einstellungen für die Einrichtung der Oberfläche &kdm;.

source: See <option>OpenRepeat</option>.
de: Siehe <option>OpenRepeat</option>.

source: The default is <quote>120</quote>.
de: Die Voreinstellung ist <quote>120</quote>.

source: These options control the behavior of &kdm; when attempting to open a connection to an &X-Server;. <option>OpenDelay</option> is the length of the pause (in seconds) between successive attempts, <option>OpenRepeat</option> is the number of attempts to make and <option>OpenTimeout</option> is the amount of time to spend on a connection attempt. After <option>OpenRepeat</option> attempts have been made, or if <option>OpenTimeout</option> seconds elapse in any particular connection attempt, the start attempt is considered failed.
de: Diese Einstellungen legen &kdm;s Verhalten beim Öffnen einer Verbindung zu einem &X-Server; fest. <option>OpenDelay</option> entspricht der gewünschten Pausenlänge (in Sekunden) zwischen aufeinanderfolgenden Versuchen, <option>OpenRepeat</option> gibt die Anzahl der Versuche an und <option>OpenTimeout</option> ist die Zeit, die für einen Verbindungsversuch aufgewendet wird. Nachdem <option>OpenRepeat</option> Versuche unternommen wurden oder <option>OpenTimeout</option> Sekunden bei einem Verbindungsversuch abgelaufen sind, wird der Startversuch als gescheitert angesehen.

source: The default is <quote>5</quote>.
de: Die Voreinstellung ist <quote>5</quote>.

source: How many times &kdm; should attempt to start a <literal>foreign</literal> display listed in <option>StaticServers</option> before giving up and disabling it. Local displays are attempted only once, and &XDMCP; displays are retried indefinitely by the client (unless the option <option>-once</option> was given to the &X-Server;).
de: Legt fest, wieviele Versuche &kdm; unternehmen soll, um eine Verbindung zu <literal>entfernten</literal> Displays aus der Liste <option>StaticServers</option> zu öffnen, bevor der Verbindungsversuch aufgegeben und das Display deaktiviert wird. Lokale Displays werden nur einmal probiert und &XDMCP;-Displays werden unendlich oft vom Client probiert (außer die Option <option>-once</option> wurde an den &X-Server; übergeben).

source: The default is <quote>4</quote>.
de: Die Voreinstellung ist <quote>4</quote>.

source: How many times &kdm; should attempt to start up a local &X-Server;. Starting up includes executing it and waiting for it to come up.
de: Legt fest, wie oft &kdm; versuchen soll, einen lokalen &X-Server; zu starten. Der Startversuch beinhaltet das Ausführen und Initialisieren.

source: The default is <quote>1</quote>.
de: Die Voreinstellung ist <quote>1</quote>.

source: How many seconds &kdm; should wait for a local &X-Server; to come up.
de: Gibt an, wie lange &kdm; auf den vollständigen Start eines lokalen &X-Server;s warten soll.

source: The default is <quote>30</quote>.
de: Die Voreinstellung ist <quote>30</quote>.

source: The command line to start the &X-Server;, without display number and VT spec. Note that with some &X-Server;s (in particular, OpenSolaris') it is necessary to put most additional arguments into <option>ServerArgsLocal</option> and <option>ServerArgsRemote</option> even if they are the same for both. This string is subject to word splitting.
de: Der Befehl zum Starten des &X-Server;s, ohne Display-Nummer und VT-Angabe. Beachten Sie, dass es bei einigen Arten von &X-Server; (insbesondere der von OpenSolaris) nötig ist, die meisten zusätzlichen Argumente in <option>ServerArgsLocal</option> und <option>ServerArgsRemote</option> einzutragen, selbst wenn sie für beide Optionen gleich sind. Diese Zeichenkette wird in einzelne Wörter aufgespalten.

source: The default is something reasonable for the system on which &kdm; was built, like <command>/usr/X11R6/bin/X</command>.
de: Die Voreinstellung ist ein sinnvoller Befehl für das System, auf dem &kdm; kompiliert wurde. Beispielsweise: <command>/usr/X11R6/bin/X</command>.

source: Additional arguments for the &X-Server;s for local sessions. This string is subject to word splitting.
de: Weitere Argumente für den &X-Server; bei lokalen Sitzungen. Diese Zeichenfolge wird in einzelne Wörter aufgespalten.

source: Additional arguments for the &X-Server;s for remote sessions. This string is subject to word splitting.
de: Weitere Argumente für den &X-Server; bei entfernten Sitzungen. Diese Zeichenfolge wird in einzelne Wörter aufgespalten.

source: The VT the &X-Server; should run on. <option>ServerVTs</option> should be used instead of this option. Leave it zero to let &kdm; assign a <acronym>VT</acronym> automatically. Set it to <literal>-1</literal> to avoid assigning a <acronym>VT</acronym> alltogether - this is required for setups with multiple physical consoles. Currently Linux only.
de: Das Virtuelle Terminal, auf dem der &X-Server; laufen soll. Stattdessen sollte besser die Option <option>ServerVTs</option> verwendet werden. Belassen Sie diesen Wert bei 0, wenn &kdm; automatisch ein <acronym>VT</acronym> zuweisen soll. Ein Wert von <literal>-1</literal> verhindert die Zuweisung von <acronym>VT</acronym>s - dies ist nötig an Systemen mit mehreren physikalischen Konsolen. Derzeit nur für Linux.

source: This option is for <acronym>OS</acronym>s without support for <acronym>VT</acronym>s, either by &kdm; or the <acronym>OS</acronym> itself. Currently this applies to all <acronym>OS</acronym>s but Linux.
de: Diese Option ist für Betriebssysteme ohne Unterstützung für <acronym>VT</acronym>s gedacht (entweder von &kdm; oder vom Betriebssystem selbst). Dies gilt derzeit für alle Betriebssysteme außer Linux.

source: When &kdm; switches to console mode, it starts monitoring this <acronym>TTY</acronym> line (specified without the leading <literal>/dev/</literal>) for activity. If the line is not used for some time, &kdm; switches back to the X login.
de: Wenn &kdm; in den Konsolen-Modus umschaltet, überwacht es dieses <acronym>TTY</acronym> (angegeben ohne das führende <literal>/dev/</literal>) auf Aktivität. Wenn das Terminal für einige Zeit unbenutzt ist, schaltet &kdm; wieder zurück auf die X-Anmeldeoberfläche.

source: The user the &X-Server; should run as. Empty results in <systemitem class="username">root</systemitem>.
de: Der Benutzer, unter welchem der X-Server gestartet wird. Bei leerer Einstellung wird <systemitem class="username">root</systemitem> verwendet.

source: See <option>PingTimeout</option>.
de: Siehe <option>PingTimeout</option>.

source: To discover when <emphasis>remote</emphasis> displays disappear, &kdm; regularly pings them. <option>PingInterval</option> specifies the time (in minutes) between the pings and <option>PingTimeout</option> specifies the maximum amount of time (in minutes) to wait for the terminal to respond to the request. If the terminal does not respond, the session is declared dead and terminated.
de: Um herauszufinden, wenn <emphasis>entfernte</emphasis> Displays nicht mehr zur Verfügung stehen, sendet &kdm; in regelmäßigen Abständen einen Ping. Die Option <option>PingInterval</option> legt die Wartezeit zwischen den Pings fest (in Minuten). <option>PingTimeout</option> gibt die maximale Antwortzeit des Terminals auf einen Ping an (in Minuten). Wenn das entfernte Terminal nicht reagiert, wird die Sitzung als tot deklariert und beendet.

source: If you frequently use X terminals which can become isolated from the managing host, you may wish to increase the timeout. The only worry is that sessions will continue to exist after the terminal has been accidentally disabled.
de: Wenn Sie häufiger entfernte X-Terminals verwenden, die unter Umständen die Verbindung verlieren, so sollten Sie die Wartezeit erhöhen. Der einzige Nachteil daran ist, dass eine Sitzung länger bestehen bleibt, nachdem ein Terminal versehentlich abgeschaltet wurde.

source: Whether &kdm; should restart the local &X-Server; after session exit instead of resetting it. Use this if the &X-Server; leaks memory or crashes the system on reset attempts.
de: Legt fest, ob &kdm; den lokalen &X-Server; nach dem Sitzungsende ganz neu starten soll, anstelle ihn zu nur zurückzusetzen. Sie sollten diese Option verwenden, falls der &X-Server; ein Speicherleck aufweist oder das System beim Zurücksetzen abstürzen lässt.

source: Controls whether &kdm; generates and uses authorization for <emphasis>local</emphasis> &X-Server; connections. For &XDMCP; displays the authorization requested by the display is used; foreign non-&XDMCP; displays do not support authorization at all.
de: Dies legt fest, ob &kdm; Autorisierung für <emphasis>lokale</emphasis> &X-Server;-Verbindungen erzeugt und verwendet. Für &XDMCP;-Displays wird die von dem Display angeforderte Autorisierung verwenden, nicht-&XDMCP;-Displays unterstützen sowieso keine Autorisierung.

source: If <option>Authorize</option> is true, use the authorization mechanisms listed herein. The MIT-MAGIC-COOKIE-1 authorization is always available; XDM-AUTHORIZATION-1, SUN-DES-1 and MIT-KERBEROS-5 might be available as well, depending on the build configuration.
de: Falls <option>Authorize</option> wahr ist, werden die hier aufgezählten Autorisierungsmechanismen verwendet. MIT-MAGIC-COOKIE-1-Autorisierung ist grundsätzlich immer verfügbar; XDM-AUTHORIZATION-1, SUN-DES-1 und MIT-KERBEROS-5 könnten ebenso verfügbar sein (abhängig von der Konfiguration beim Kompilieren).

source: The default is <quote>DEF_AUTH_NAME</quote>.
de: Die Voreinstellung ist <quote>DEF_AUTH_NAME</quote>.

source: Some <emphasis>old</emphasis> &X-Server;s re-read the authorization file at &X-Server; reset time, instead of when checking the initial connection. As &kdm; generates the authorization information just before connecting to the display, an old &X-Server; would not get up-to-date authorization information. This option causes &kdm; to send SIGHUP to the &X-Server; after setting up the file, causing an additional &X-Server; reset to occur, during which time the new authorization information will be read.
de: Einige <emphasis>alte</emphasis> &X-Server; lesen die Autorisierungsdatei beim Zurücksetzen des &X-Server;s anstatt beim Prüfen der ersten Verbindung neu ein. Da &kdm; die Berechtigungsinformationen erst kurz vor der Verbindung erzeugt, erhält solch ein alter &X-Server; nicht-aktuelle Autorisierungsdaten. Diese Option veranlasst &kdm; dazu, das Signal SIGHUP an den &X-Server; zu senden, nachdem die Datei erzeugt wurde. Der dadurch veranlasste &X-Server;-Neustart sorgt dann für das Neu-Einlesen der Datei durch den &X-Server;.

source: This file is used to communicate the authorization data from &kdm; to the &X-Server;, using the <option>-auth</option> &X-Server; command line option. It should be kept in a directory which is not world-writable as it could easily be removed, disabling the authorization mechanism in the &X-Server;. If not specified, a random name is generated from <option>AuthDir</option> and the name of the display.
de: Diese Datei wird verwendet, um dem &X-Server; die Autorisierungsdaten von &kdm; zu übermitteln. Dazu wird die Option <option>-auth</option> des &X-Server;s verwendet. Diese Datei sollte in einem Ordner aufbewahrt werden, der nicht von jedem beschreibbar ist. Sonst besteht die Gefahr, dass die Datei entfernt oder manipuliert wird und somit der Autorisierungsmechanismus des &X-Server;s nicht mehr funktionieren würde. Falls nicht angegeben, wird ein zufälliger Name aus <option>AuthDir</option> und dem Namen des Displays generiert.

source: This option specifies the name of the file to be loaded by <command>xrdb</command> as the resource database onto the root window of screen 0 of the display. KDE programs generally do not use X-resources, so this option is only needed if the <option>Setup</option> program needs some X-resources.
de: Diese Option gibt die Datei an, die von <command>xrdb</command> als Ressourcendatenbank auf das root-Fenster des Bildschirms 0 des Displays geladen werden soll. KDE-Programme verwenden grundsätzlich keine X-Ressourcen, daher ist diese Option nur nützlich, falls das <option>Setup</option>-Programm einige solche Ressourcen benötigt.

source: The <command>xrdb</command> program to use to read the X-resources file specified in <option>Recources</option>. The command is subject to word splitting.
de: Das <command>xrdb</command>-Programm, welches zum Einlesen der X-Ressourcendatei benutzt werden soll. Die Ressourcendatei wurde in <option>Resources</option> angegeben. Diese Zeichenfolge wird in einzelne Wörter aufgespalten.

source: The default is <quote>${<envar>x_bindir</envar>}/xrdb</quote>.
de: Die Voreinstellung ist <quote>${<envar>x_bindir</envar>}/xrdb</quote>.

source: This string is subject to word splitting. It specifies a program which is run (as <systemitem class="username">root</systemitem>) before offering the greeter window. This may be used to change the appearance of the screen around the greeter window or to put up other windows (e.g., you may want to run <command>xconsole</command> here). Usually, a script named <command>Xsetup</command> is used here. See <xref linkend="kdmrc-xsetup"/>.
de: Diese Zeichenfolge wird in einzelne Wörter aufgespalten. Sie gibt ein Programm an, das (als Systemverwalter <systemitem class="username">root</systemitem>) vor der Anzeige des Anmeldefensters ausgeführt wird. Dies kann zum Ändern des Bildschirminhalts um das Anmeldefenster genutzt werden oder um weitere Fenster nebenher anzuzeigen (&eg; könnten Sie hier eine <command>xconsole</command> ausführen). Die üblicherweise verwendete Datei hierfür heißt <command>Xsetup</command>. Siehe auch <xref linkend="kdmrc-xsetup"/>.

source: This string is subject to word splitting. It specifies a program which is run (as <systemitem class="username">root</systemitem>) after the user authentication process succeeds. Usually, a script named <command>Xstartup</command> is used here. See <xref linkend="kdmrc-xstartup"/>.
de: Diese Zeichenfolge wird in einzelne Wörter aufgespalten. Sie gibt ein Programm an, welches (als Systemverwalter <systemitem class="username">root</systemitem>) nach der Benutzer-Authentifizierung ausgeführt wird. Üblicherweise wird dafür das Skript <command>Xstartup</command> benutzt. Siehe auch <xref linkend="kdmrc-xstartup"/>.

source: This string is subject to word splitting. It specifies a program which is run (as <systemitem class="username">root</systemitem>) after the session terminates. Usually, a script named <command>Xreset</command> is used here. See <xref linkend="kdmrc-xreset"/>.
de: Diese Zeichenfolge wird in einzelne Wörter aufgespalten. Sie gibt ein Programm an, das (als Systemverwalter <systemitem class="username">root</systemitem>) nach Beendigung der Sitzung ausgeführt wird. Üblicherweise wird dafür das Skript <command>Xreset</command> verwendet. Siehe auch <xref linkend="kdmrc-xreset"/>.

source: This string is subject to word splitting. It specifies the session program to be executed (as the user owning the session). Usually, a script named <command>Xsession</command> is used here. See <xref linkend="kdmrc-xsession"/>.
de: Diese Zeichenfolge wird in einzelne Wörter aufgespalten. Sie gibt das Sitzungsprogramm an, das (unter dem Benutzer der Sitzung) ausgeführt wird. Die üblicherweise verwendete Datei hierfür heißt <command>Xsession</command>. Siehe auch <xref linkend="kdmrc-xsession"/>.

source: The default is <quote>${<envar>x_bindir</envar>}/xterm -ls -T</quote>.
de: Die Voreinstellung ist <quote>${<envar>x_bindir</envar>}/xterm -ls -T</quote>.

source: If the <option>Session</option> program fails to execute, &kdm; will fall back to this program. This program is executed with no arguments, but executes using the same environment variables as the session would have had (see <xref linkend="kdmrc-xsession"/>).
de: Falls das <option>Session</option>-Programm nicht ausgeführt werden kann, wird &kdm; auf dieses Programm zurückgreifen. Das Programm wird ohne jegliche Argumente aufgerufen, aber verfügt über die gleichen Umgebungsvariablen wie die eigentliche Sitzung (siehe <xref linkend="kdmrc-xsession"/>).

source: The default is <quote>${<envar>x_bindir</envar>}/xterm</quote>.
de: Die Voreinstellung ist <quote>${<envar>x_bindir</envar>}/xterm</quote>.

source: The <envar>PATH</envar> environment variable for non-<systemitem class="username">root</systemitem> <option>Session</option>s.
de: Die <envar>PATH</envar>-Umgebungsvariable für nicht-<systemitem class="username">root</systemitem>-<option>Session</option>.

source: The default depends on the system &kdm; was built on.
de: Die Voreinstellung hängt von dem System ab, auf dem &kdm; kompiliert wurde.

source: The <envar>PATH</envar> environment variable for all programs but non-<systemitem class="username">root</systemitem> <option>Session</option>s. Note that it is good practice not to include <literal>.</literal> (the current directory) into this entry.
de: Die <envar>PATH</envar>-Umgebungsvariable für alle Programme außer nicht-<systemitem class="username">root</systemitem>-Sitzungen (siehe <option>Session</option>). Sie sollte nach Möglichkeit nicht <literal>.</literal> enthalten (der Pfad zum jeweils aktuellen Ordner).

source: The <envar>SHELL</envar> environment variable for all programs but the <option>Session</option>.
de: Die <envar>PATH</envar>-Umgebungsvariable für alle Programme außer <option>Session</option>.

source: The default is <quote>/bin/sh</quote>.
de: Die Voreinstellung ist <quote>/bin/sh</quote>.

source: When &kdm; is unable to write to the usual user authorization file ($<envar>HOME</envar>/.Xauthority), it creates a unique file name in this directory and points the environment variable <envar>XAUTHORITY</envar> at the created file.
de: Falls &kdm; die normale Benutzerautorisierungsdatei ($<envar>HOME</envar>/.Xauthority) nicht schreiben kann, wird eine einzigartige Datei in diesem Ordner erstellt und die Umgebungsvariable <envar>XAUTHORITY</envar> zeigt dann auf diese neu erstellte Datei.

source: The default is <quote>/tmp</quote>.
de: Die Voreinstellung ist <quote>/tmp</quote>.

source: If true, <option>UserAuthDir</option> will be used unconditionally.
de: Wenn true gesetzt, wird <option>UserAuthDir</option> in jedem Fall verwendet.

source: If enabled, &kdm; will automatically restart a session after an &X-Server; crash (or if it is killed by Alt-Ctrl-BackSpace). Note that enabling this feature opens a security hole: a secured display lock can be circumvented (unless &kde;'s built-in screen locker is used).
de: Wenn diese Einstellung aktiviert ist, wird &kdm; einen abgestürzten (oder mittels Strg+Alt+Entf beendeten) &X-Server; automatisch neu starten. Achtung: Das Aktivieren dieser Einstellung kann zu einem Sicherheitsproblem werden. Eine mit Passwort geschützte Sitzung könnte umgangen werden (es sei denn, &kde;s eingebauter Bildschirmschoner mit Passwort wird verwendet).

source: If disabled, do not allow <systemitem class="username">root</systemitem> (and any other user with UID = 0) to log in directly.
de: Falls diese Einstellung deaktiviert ist, wird dem Systemverwalter <systemitem class="username">root</systemitem> und anderen Benutzern mit der UID=0 ein direktes Anmelden untersagt.

source: If disabled, only users that have passwords assigned can log in.
de: Wenn diese Einstellung deaktiviert ist, können sich nur noch Benutzer mit einem zugewiesenen Passwort anmelden.

source: Who is allowed to shut down the system. This applies both to the greeter and to the command sockets.
de: Dies bestimmt, wem das Herunterfahren des Systems gestattet ist. Dies gilt sowohl für das Anmeldefenster als auch für den Befehls-Socket.

source: no <guilabel>Shutdown...</guilabel> menu entry is shown at all
de: es wird kein Eintrag <guilabel>Herunterfahren ...</guilabel> angezeigt

source: the <systemitem class="username">root</systemitem> password must be entered to shut down
de: das <systemitem class="username">root</systemitem>-Passwort muss zum Herunterfahren eingegeben werden

source: everybody can shut down the machine
de: Jeder kann den Rechner herunterfahren

source: The default is <quote>All</quote>.
de: Die Voreinstellung ist <quote>All</quote>.

source: Who is allowed to abort active sessions when shutting down.
de: Wer darf aktive Sitzungen beim Herunterfahren abbrechen.
