Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kde-workspace/kdm_theme-ref.po
Languages: de

source: Certain common localized labels can be specified via the stock tags. The <literal>text</literal> tag is ignored if the <literal>stock</literal> tag is used. You really should use the stock labels rather than just putting all the translations into the themes. This yields faster load times and likely better translations. The following values are valid:
de: Bestimmte häufige, lokalisierte Beschriftungen können über Bestandsknoten angegeben werden. Das Tag <literal>text</literal> wird ignoriert, wenn das Tag <literal>stock</literal> angegeben ist. Sie sollten lieber die Bestandsbeschriftungen verwenden als sämtliche Übersetzungen in den Designs abzulegen. Dies führt zu schnelleren Ladezeiten und wahrscheinlich zu besseren Übersetzungen. Die folgenden Werte sind gültig:

source: Caps Lock is enabled
de: Feststelltaste ist aktiviert

source: XDMCP Choose_r
de: _XDMCP-Rechnermenü

source: _Quit
de: Be_enden

source: Disconn_ect
de: _Trennen

source: Power o_ff
de: Aus_schalten

source: Lan_guage
de: _Sprache

source: _Login
de: _Anmelden

source: Session _Type
de: Sitzungs_art

source: Re_boot
de: _Neustart

source: _Menu
de: _Menü

source: User %u will login in %t
de: Benutzer %u wird angemeldet in %t

source: _Username:
de: _Benutzername:

source: _Password:
de: _Passwort:

source: Welcome to %h
de: Willkommen auf %h

source: Buddy Nodes
de: Buddy-Knoten

source: Items which do not directly cause an action can be assigned a buddy. The buddy is given input focus when the item is activated (clicked or a <literal>label</literal>'s accelerator pressed).
de: Elementen, die nur indirekt eine Aktion auslösen, kann ein Buddy zugewiesen werden. Sobald das Element aktiviert wird (angeklickt oder der <literal>Kurzbefehl</literal> einer Beschriftung wird betätigt), erhält das Buddy-Element den Eingabefokus.

source: The buddy is referenced by id with the <literal>idref</literal> attribute. Obviously, it must be given an id. Example:
de: Der Buddy wird über seine Id mit dem Attribut <literal>idref</literal> adressiert. Es ist daher offensichtlich, dass er eine Id erhalten muss. Beispiel:
