Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kde-workspace/kdm_theme-ref.po
Languages: de

source: If the <literal>expand</literal> attribute is specified and <literal>true</literal>, this item will be expanded in the enclosing box as much as possible (that is it will be given more space if available).
de: Ist das Attribut <literal>expand</literal> angegeben und hat den Wert <literal>true</literal>, wird das Element im umschließenden Kasten so weit wie möglich ausgedehnt (das bedeutet, es erhält mehr Platz, wenn dies möglich ist).

source: If <literal>width</literal> or <literal>height</literal> is a plain number, a negative value represents an offset from the enclosing container's size. Note that it is possible to specify a positive offset by writing two minus signs.
de: Wenn <literal>width</literal> oder <literal>height</literal> als Zahlenwert angegeben werden, bedeutet ein negativer Wert einen Abstand zur Größe des umschließenden Containers. Beachten Sie, dass auch ein positiver Versatz angegeben werden kann, indem Sie zwei Minuszeichen angeben.

source: In either case it is possible to constrain the final size with the <literal>min-width</literal>, <literal>min-height</literal>, <literal>max-width</literal> and <literal>max-height</literal> attributes which can be specified in the same ways as <literal>width</literal> and <literal>height</literal>.
de: In jedem Fall kann die endgültige Größe durch die Attribute <literal>min-width</literal>, <literal>min-height</literal>, <literal>max-width</literal> und <literal>max-height</literal> eingeschränkt werden, die genau so angegeben werden können wie die Attribute <literal>width</literal> und <literal>height</literal>.

source: If <literal>x</literal> or <literal>y</literal> is a plain number, a negative value represents an offset from the right resp. bottom edge, unlike the default which is the left resp. top edge.
de: Wenn <literal>x</literal> oder <literal>y</literal> ein Zahlenwert ist, bedeutet ein negativer Wert den Abstand vom rechten bzw. unteren Rand, anders als in der Voreinstellung, bei der der linke bzw. obere Rand gemeint ist.

source: It is also possible to specify which point within the item the position refers to. This is called the anchor and can be either <literal>c</literal> for center or one of <literal>n</literal>, <literal>ne</literal>, <literal>e</literal>, <literal>se</literal>, <literal>s</literal>, <literal>sw</literal>, <literal>w</literal> and <literal>nw</literal> which stand for the different edges/corners corresponding the directions on a topographical map. The default is <literal>nw</literal>, which is the upper left corner. For example:
de: Es besteht auch die Möglichkeit den Punkt innerhalb des Elements anzugeben, auf den sich die Position bezieht. Dieser wird Anker genannt und kann entweder <literal>c</literal> für zentriert oder<literal>n</literal>, <literal>ne</literal>, <literal>e</literal>, <literal>se</literal>, <literal>s</literal>, <literal>sw</literal>, <literal>w</literal> und <literal>nw</literal> sein. Diese Abkürzungen stehen für die verschiedenen Ränder/Ecken einer topografischen Karte. (Anm. d. Übers.: Die Abkürzungen beziehen sich auf die englischen Himmelsrichtungen). Die Voreinstellung ist <literal>nw</literal>, für die obere linke Ecke. Ein Beispiel:

source: Show Nodes
de: Anzeigeknoten

source: You can specify the <literal>type</literal> attribute to indicate that certain items should only be displayed if the type is set. Prefixing the type with an exclamation mark (<literal>!</literal>) reverses the condition. Valid values include the following:
de: Sie können das Attribut <literal>type</literal> angeben. Damit zeigen sie an, dass bestimmte Element nur angezeigt werden sollen, wenn der Typ gesetzt ist. Wird dem Typ ein Ausrufezeichen vorangestellt (<literal>!</literal>) wird die Bedingung umgekehrt. Gültige Werte sind folgende:

source: Type
de: Typ

source: Display if ...
de: Anzeigen wenn ...

source: switching to remote login is permitted.
de: ein Umschalten auf das Anmelden an Fremdrechnern erlaubt ist.

source: <literal>halt</literal> and <literal>reboot</literal>
de: <literal>halt</literal> und <literal>reboot</literal>

source: system shutdown is permitted.
de: das Herunterfahren des Systems erlaubt ist.

source: no condition (always set in &kdm;).
de: keine Bedingung (In &kdm; immer gesetzt).

source: the <quote>conversation</quote> plugin provides a corresponding input field.
de: die <quote>Kommunikationserweiterung</quote> bietet ein entsprechendes Eingabefeld.

source: For example:
de: Zum Beispiel:

source: Alternatively, you can specify a <literal>min-screen-width</literal> or <literal>min-screen-height</literal> value to indicate that certain items should be displayed only if the screen resolution is the at least the specified size. For example:
de: Alternativ können Sie auch einen Wert <literal>min-screen-width</literal> oder <literal>min-screen-height</literal> angeben, der vorgibt, dass bestimmte Elemente nur dann angezeigt werden sollen, wenn die Bildschirmauflösung mindestens den angegebenen Wert hat. Ein Beispiel:

source: Normal/Active/Prelight Nodes
de: Normal-/Active-/Prelight-Knoten

source: The look of most item types can be parametrized via the following tags:
de: Das Aussehen der meisten Elemente kann mit den folgenden Tags angepasst werden:

source: Normal state.
de: Normaler Zustand

source: When the mouse is hovering over the item.
de: Wenn sich der Mauszeiger darüber befindet.

source: When a mouse button is clicked on the item.
de: Wenn eine Maustaste auf dem Element betätigt wird.

source: The exact set of available attributes depends on the item type:
de: Der genaue Umfang der verfügbaren Attribute hängt vom Typ des Elements ab:

source: Either of the attributes may be omitted, in which case the default is used (the example represents the defaults). <literal>alpha</literal> is a floating point number between zero (transparent) and one (opaque). <literal>color</literal> is a hashmark followed by a six-digit hex number; the format is <quote><literal>#</literal><replaceable>rrggbb</replaceable></quote>. Alternatively, <literal>color</literal> may be specified as an eight-digit hex number, in which case the first two digits are the alpha value.
de: Beide Attribute können weggelassen werden. In diesem Fall wird der Standardwert benutzt (das Beispiel zeigt die Standardwerte). <literal>alpha</literal> ist eine Fließkommazahl zwischen 0 (transparent) und 1 (undurchsichtig). <literal>color</literal> ist ein Doppelkreuz gefolgt von einem sechstelligen Hexadezimalwert; Das Format ist <quote><literal>#</literal><replaceable>rrggbb</replaceable></quote>. Alternativ kann <literal>color</literal> als achtstellige Hexadezimalzahl angegeben werden, wobei die beiden ersten Ziffern den Alphawert darstellen.

source: <literal>alpha</literal> and <literal>color</literal> are specified like in <quote>rect</quote> items.
de: <literal>alpha</literal> und <literal>color</literal> werden angegeben wie bei <quote>rect</quote>-Einträgen.

source: <literal>font</literal> follows the format <quote><replaceable>family-list</replaceable>&nbsp;<replaceable>style-options</replaceable>&nbsp;<replaceable>size</replaceable></quote>. Each part is optional.
de: <literal>font</literal> folgt dem Format <quote><replaceable>family-list</replaceable>&nbsp;<replaceable>style-options</replaceable>&nbsp;<replaceable>size</replaceable></quote>. Alle Bestandteile sind optional.

source: <replaceable>family-list</replaceable> is a comma-separated list of font families like <quote>helvetica</quote>, <quote>monospace</quote>, etc.
de: <replaceable>family-list</replaceable> ist eine komma-separierte Liste von Schriftfamilien wie <quote>helvetica</quote>, <quote>monospace</quote> &etc;

source: <replaceable>style-options</replaceable> is a space-delimited list of keywords from the categories style, weight and stretch; from each category at most one. The style can be <literal>normal</literal>, <literal>italic</literal> or <literal>oblique</literal>. Weight can be <literal>ultra-light</literal>, <literal>light</literal>, <literal>medium</literal>, <literal>semi-bold</literal>, <literal>bold</literal>, <literal>ultra-bold</literal> or <literal>heavy</literal>. Allowable stretches comprise <literal>ultra-condensed</literal>, <literal>extra-condensed</literal>, <literal>condensed</literal>, <literal>semi-condensed</literal>, <literal>normal</literal>, <literal>semi-expanded</literal>, <literal>expanded</literal>, <literal>extra-expanded</literal> and <literal>ultra-expanded</literal>.
de: <replaceable>style-options</replaceable> ist eine leerzeichen-getrennte Liste von Schlüsselwörtern aus den Kategorien style, weight und stretch; aus jeder Kategorie höchstens eins. Style kann <literal>normal</literal>, <literal>italic</literal> or <literal>oblique</literal>. Weight kann sein <literal>ultra-light</literal>, <literal>light</literal>, <literal>medium</literal>, <literal>semi-bold</literal>, <literal>bold</literal>, <literal>ultra-bold</literal> or <literal>heavy</literal>. Die Werte für stretch umfassen <literal>ultra-condensed</literal>, <literal>extra-condensed</literal>, <literal>condensed</literal>, <literal>semi-condensed</literal>, <literal>normal</literal>, <literal>semi-expanded</literal>, <literal>expanded</literal>, <literal>extra-expanded</literal> and <literal>ultra-expanded</literal>.

source: <replaceable>size</replaceable> is either a floating point number representing the size in points (1/72 inch) or an integer followed by <literal>px</literal> representing the size in pixels. Point sizes are preferable, as they are independent from the display resolution.
de: <replaceable>size</replaceable> ist entweder eine Fließkommazahl, die die Größe in Punkten (1/72 Zoll) darstellt oder eine Ganzzahl, gefolgt von <literal>px</literal>, um die Größe in Pixeln anzugeben. Größenangaben in Punkten sind vorzuziehen, da diese unabhängig von der Bildschirmauflösung sind.

source: If either attribute is left out, the values from the <link linkend="style-nodes">style node</link> are used. If this yields no window-text color specification, white is used. The default font is the one configured in &kdmrc;.
de: Wir ein Attribut ausgelassen, werden die Wert des <link linkend="style-nodes">Stilknotens</link> benutzt. Ergibt diese keine Farbangabe für window-text, wird Weiß verwendet. Die Standardschriftart ist die in &kdmrc; eingerichtete.

source: <literal>file</literal> specifies the file containing the image. Relative pathnames are relative to the theme's directory.
de: <literal>file</literal> gibt die Datei an, die das Bild enthält. Relative Pfade sind relativ zum Ordner des Designs.

source: <literal>wallpaper</literal> can be used instead of <literal>file</literal> to have &kdm; look for images in the usual locations for &kde; wallpapers. Plasma wallpaper packages are supported.
de: <literal>wallpaper</literal> kann statt <literal>file</literal> benutzt werden, damit &kdm; auch nach Bildern in den Standard-Ordnern für &kde;-Hintergrundbilder sucht. Auch Pakete mit Plasma-Hintergrundbildern werden unterstützt.

source: <literal>element</literal> specifies the element id of a SVG file. If empty, the whole SVG image will be rendered.
de: <literal>element</literal> gibt die Element-ID in einer SVG-Datei an. Ohne diese Angabe wird das ganze SVG-Bild angezeigt.

source: For <literal>pixmap</literal> nodes, it is possible to provide multiple images, so the best-quality image for a given resolution can be used. Size-tagged file names have the format <replaceable>basename</replaceable><literal>-</literal><replaceable>width</replaceable><literal>x</literal><replaceable>height</replaceable><literal>.</literal><replaceable>extension</replaceable>. If the not size-tagged file exists and it is no Plasma wallpaper package, &kdm; will accept only a perfect match for a given size and otherwise fall back to the original file. Otherwise it will try to find an image whose dimensions come closest to the required size if no perfect match is found.
de: Für <literal>pixmap</literal>-Knoten können mehrere Bilder angegeben werden, sodass für eine vorgegebene Auflösung das qualitativ beste Bild verwendet werden kann. Dateinamen mit Kennzeichnung der Größe haben die Bezeichnung <replaceable>basename</replaceable><literal>-</literal><replaceable>width</replaceable><literal>x</literal><replaceable>height</replaceable><literal>.</literal><replaceable>extension</replaceable>. Wenn eine Daten ohne Kennzeichnung der Größe angegeben ist und dies keine Paket mit einem Plasma-Hintergrundbild ist, akzeptiert &kdm; nur eine exakte Übereinstimmung mit einer vorgegebenen Größe und benutzt anderenfalls die Originaldatei. Ansonsten versucht &kdm; ein Bild mit der am besten übereinstimmenden Größe zu finden, wenn kein genau passendes Bild gefunden wurde.

source: <literal>scalemode</literal> specifies how to adjust the size of images which do not match the element's size. <literal>free</literal> (the default) means to simply scale the image to the right size, possibly distorting its aspect ratio. The other two modes maintain the image's aspect ratio: <literal>fit</literal> means to zoom the image to the maximal size which fits into the element's geometry. The image will be centered. The remaining area will not be painted by this element, so it should be placed on top of a solid-filled <literal>rect</literal>. <literal>crop</literal> means to zoom the image to the minimal size which completely fills the element's geometry. The image will be clipped symmetrically.
de: <literal>scalemode</literal> legt fest, wie die Größe von Bildern geändert wird, die nicht in das Element passen. Mit der Voreinstellung <literal>free</literal> wird die Größe der Bilder angepasst, dabei wird unter Umständen das Seitenverhältnis geändert. Mit den beiden folgenden Einstellungen bleibt das Seitenverhältnis erhalten: Mit <literal>fit</literal> wird die Größe des Bildes so geändert, dass es in das Element passt. Dabei wird das Bild zentriert. Der vom Bild nicht überdeckte Bereich des Elements wird nicht durch das Element gezeichnet, daher sollte das Bild auf einem einfarbigen <literal>rect</literal> angeordnet werden. Mit der Einstellung <literal>crop</literal> wird das Bild so vergrößert, dass das Bild das Element ganz ausfüllt. Die überstehenden Teile des Bildes werden symmetrisch abgeschnitten.

source: <literal>tint</literal> and <literal>alpha</literal> form a color specification like in <literal>rect</literal> items. Each pixel of the image is multiplied with this color component-wise.
de: <literal>tint</literal> und <literal>alpha</literal> bilden eine Farbangabe wie bei <literal>rect</literal>-Elementen. Jedes Pixel des Bildes wird komponentenweise mit dieser Farbe multipliziert.

source: Widget Style Nodes
de: Element-Stil-Knoten

source: This tag makes it possible to change the appearance of labels and Qt widgets embedded into the theme, e.g., line edits, buttons or the user list. The style settings are inherited by child items, but can be overridden individually. The defaults are taken from &kdmrc;.
de: Mit diesem Tag das Erscheinungsbild in das Design eingebetteter Beschriftungen und Qt-Widgets geändert werden, &eg; Eingabefelder, Knöpfe oder die Benutzerliste. Die Vorgaben für den Stil werden von Kindelementen geerbt, können aber individuell überschrieben werden. Die Standardwerte werden aus &kdmrc; übernommen.

source: The <literal>font</literal> attribute defines the font for all widgets. For widgets with an input function it can be overridden with the <literal>edit-font</literal> attribute. Fonts are specified the same way as in <link linkend="nor-act-pre-nodes">normal/active/prelight nodes</link>.
de: Das Attribut <literal>font</literal> legt die Schriftart für alle Widgets fest. Für Widgets mit einer Eingabefunktion kann die Schriftart mit dem Attribut <literal>edit-font</literal> überschrieben werden. Schriftarten werden genauso angegeben wie in <link linkend="nor-act-pre-nodes">Normal/Active/Prelight</link>.

source: Usually, the theming engine tries hard to remove any frames from Qt widgets, so they melt into the theme seamlessly. In cases where this is not desired, the <literal>frame</literal> attribute can be set to <literal>true</literal>.
de: Normalerweise gibt sich die Design-Engine alle Mühe die Rahmen von Qt-Widgets zu entfernen, sodass diese übergangslos im Design dargestellt werden. In Fällen, in denen dies nicht gewünscht ist, kann das Attribut <literal>frame</literal> auf den Wert <literal>true</literal> gesetzt werden.

source: The <literal>guistyle</literal> attribute can be used to override the Qt GUI style for embedded widgets. The default is given by <option>GUIStyle</option> in &kdmrc;
de: Das Attribut <literal>guistyle</literal> kann benutzt werden, um den Qt-GUI-Stil für eingebettete Widgets zu überschreiben. Als Voreinstellung wird die Option <option>GUIStyle</option> in &kdmrc; verwendet.

source: It is possible to specify almost the entire palette for the widgets as documented at <ulink type="http" url="http://doc.trolltech.com/4.3/qpalette.html">Trolltech's site</ulink>. Attribute names are composed from a scope, a color role and a suffix. Possible scopes are - in order of increasing precedence - <literal>all-</literal> for all color groups, no scope for the active and inactive color groups and <literal>active-</literal>, <literal>inactive-</literal> and <literal>disabled-</literal> for the respective color group. Supported color roles are <literal>window</literal>, <literal>window-text</literal>, <literal>base</literal>, <literal>alternate-base</literal>, <literal>text</literal>, <literal>bright-text</literal>, <literal>highlight</literal>, <literal>highlighted-text</literal>, <literal>button</literal> and <literal>button-text</literal>. The suffix can be <literal>-color</literal> or <literal>-alpha</literal> with the respective meaning as in <link linkend="nor-act-pre-nodes">normal/active/prelight nodes</link>.
de: Sie können beinah die gesamte auf der <ulink type="http" url="http://doc.trolltech.com/4.3/qpalette.html">Trolltech-Webseite</ulink> dokumentierte Palette für die Widgets angeben. Attributnamen setzen sich aus einem Gültigkeitsbereich, einer Farbrolle und einem Suffix zusammen. Mögliche Gültigkeitsbereiche, in aufsteigender Rangfolge, sind <literal>all-</literal> für alle Farbgruppen, keiner für die aktiven und inaktiven Farbgruppen und <literal>active-</literal>, <literal>inactive-</literal> und <literal>disabled-</literal> für die entsprechenden Farbgruppen. Unterstützte Farbrollen sind <literal>window</literal>, <literal>window-text</literal>, <literal>base</literal>, <literal>alternate-base</literal>, <literal>text</literal>, <literal>bright-text</literal>, <literal>highlight</literal>, <literal>highlighted-text</literal>, <literal>button</literal> und <literal>button-text</literal>. Das Suffix kann den Wert <literal>-color</literal> oder <literal>-alpha</literal> mit der entsprechenden Bedeutung aus <link linkend="nor-act-pre-nodes">normal/active/prelight nodes</link> haben.

source: As an alternative to specifying the palette inline, the <literal>colorscheme</literal> attribute can be used to load a complete &kde; color scheme. The default is given by <option>ColorScheme</option> in &kdmrc;. Individual <literal>color</literal> specifications will override the colors from the scheme.
de: Alternativ zur Angabe einer Palette in der Datei kann das Attribut <literal>colorscheme</literal> benutzt werden, um eine vollständiges &kde;-Farbschema zu laden. Die Vorgabe ist die Option <option>ColorScheme</option> in der Datei &kdmrc;. Individuelle Festlegung von <literal>color</literal> überschreibt die Farbe des Schemas.

source: Example:
de: Beispiel:

source: Face Browser Color Nodes
de: Farbknoten für die Gesichterliste

source: Color nodes permit overriding the background color of the items in the face browser. <literal>labelcolor</literal> and <literal>altlabelcolor</literal> are essentially equivalent to <literal>all-base-color</literal> resp. <literal>all-alternate-base-color</literal> in <link linkend="style-nodes">style nodes</link>. If only <literal>labelcolor</literal> is specified, alternating item backgrounds are disabled.
de: Farbknoten erlauben das Überschreiben der Hintergrundfarbe von Elementen in der Gesichterliste. <literal>labelcolor</literal> und <literal>altlabelcolor</literal> sind im Wesentlichen äquivalent zu <literal>all-base-color</literal> bzw. <literal>all-alternate-base-color</literal> in <link linkend="style-nodes">style nodes</link>. Wird nur <literal>labelcolor</literal> angegeben, werden alternierende Elementhintergründe abgeschaltet.

source: Text Nodes
de: Text-Knoten

source: Text tags are used by labels. They can be used to display localized text as follows (if the <literal>xml:lang</literal> attribute is omitted, the POSIX locale is assumed):
de: Text-Tags werden von Beschriftungen verwendet. Diese können zur Anzeige von lokalisiertem Text wie folgt benutzt werden (fehlt das Attribut <literal>xml:lang</literal>, wird das POSIX locale vorausgesetzt):

source: Text nodes can contain the following special character sequences which will be translated as follows:
de: Text-Knoten können die folgenden Sonderzeichenfolgen enthalten, die wie folgt übersetzt werden:

source: Sequence
de: Zeichenfolge

source: Expansion
de: Auflösung

source: A literal % character
de: Ein %-Zeichen

source: Wall clock time and date
de: Uhrzeit und Datum

source: Display name (<envar>DISPLAY</envar> environment variable)
de: Der Display-Name (Umgebungsname <envar>DISPLAY</envar>)

source: Hostname (<function>gethostname</function> output)
de: Rechnername (Ausgabe von <function>gethostname</function>)

source: Machine name (<structfield>machine</structfield> part of <function>uname</function> output)
de: Maschinentyp (Bestandteil <structfield>machine</structfield> der Ausgabe von <function>uname</function>)

source: Node name (<structfield>nodename</structfield> part of <function>uname</function> output)
de: Netzwerkname (<structfield>nodename</structfield>, Bestandteil der Ausgabe von <function>uname</function>.

source: Domain name (<function>getdomainname</function> output)
de: Domänen-Name (Ausgabe von <function>getdomainname</function>)

source: Release name (<structfield>release</structfield> part of <function>uname</function> output)
de: Release-Nummer (<structfield>release</structfield>, Bestandteil der Ausgabe von <function>uname</function>)

source: System name (<structfield>sysname</structfield> part of <function>uname</function> output)
de: Systemname (<structfield>sysname</structfield>, Bestandteil der Ausgabe von <function>uname</function>)

source: Remaining number of seconds until timed login is performed, plus the appropriate i18n plural form of <quote>second</quote>
de: Verbleibende Anzahl Sekunden bis zur Ausführung einer geplanten Anmeldung. Hinzu kommt die passende i18n-Pluralform für <quote>Sekunde</quote>.

source: Username for timed login
de: Benutzername für geplante Anmeldung

source: Causes the following character to be an accelerator
de: Macht das folgende Zeichen zu einem Kurzbefehl.

source: <literal>%t</literal> and <literal>%u</literal> are intended to be used only internally to display the <literal>timed-label</literal> message, which is automatically updated every second.
de: <literal>%t</literal> und <literal>%u</literal> sind nur zum internen Gebrauch zur Anzeige der Nachricht <literal>timed-label</literal> gedacht, die automatisch jede Sekunde aktualisiert wird.

source: Stock Nodes
de: Bestandsknoten
