Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kde-workspace/kdm_kdmrc-ref.po
Languages: de

source: The last entry type is the <literal>LISTEN</literal> directive. The formal syntax is <screen> <userinput>&nbsp;<literal>LISTEN</literal>&nbsp;[<replaceable>interface</replaceable>&nbsp;[<replaceable>multicast&nbsp;list</replaceable>]]</userinput> </screen> If one or more <literal>LISTEN</literal> lines are specified, &kdm; listens for &XDMCP; requests only on the specified interfaces. <replaceable>interface</replaceable> may be a hostname or IP address representing a network interface on this machine, or the wildcard <literal>*</literal> to represent all available network interfaces. If multicast group addresses are listed on a <literal>LISTEN</literal> line, &kdm; joins the multicast groups on the given interface. For IPv6 multicasts, the IANA has assigned ff0<replaceable>X</replaceable>:0:0:0:0:0:0:12b as the permanently assigned range of multicast addresses for &XDMCP;. The <replaceable>X</replaceable> in the prefix may be replaced by any valid scope identifier, such as 1 for Node-Local, 2 for Link-Local, 5 for Site-Local, and so on (see IETF RFC 2373 or its replacement for further details and scope definitions). &kdm; defaults to listening on the Link-Local scope address ff02:0:0:0:0:0:0:12b to most closely match the IPv4 subnet broadcast behavior. If no <literal>LISTEN</literal> lines are given, &kdm; listens on all interfaces and joins the default &XDMCP; IPv6 multicast group (when compiled with IPv6 support). To disable listening for &XDMCP; requests altogether, a <literal>LISTEN</literal> line with no addresses may be specified, but using the <literal>[Xdmcp]</literal> <option>Enable</option> option is preferred.
de: Der letzte Eintrag dieser Art ist die <literal>LISTEN</literal>-Direktive. Die formale Syntax lautet: <screen> <userinput>&nbsp;<literal>LISTEN</literal>&nbsp;[<replaceable>Schnittstelle</replaceable>&nbsp;[<replaceable>Multicast-Liste</replaceable>]]</userinput> </screen> Wenn eine oder mehrere <literal>LISTEN</literal>-Einträge angegeben sind, wartet &kdm; nur an den definierten Netzwerkschnittstellen auf &XDMCP;-Anfragen. <replaceable>Schnittstellen</replaceable> können entweder Rechnernamen oder IP-Adressen von Netzwerkkarten auf diesem Rechner sein. Der Platzhalter <literal>*</literal> repräsentiert alle verfügbaren Netzwerkschnittstellen. Wenn Multicast-Gruppenadressen in einer <literal>LISTEN</literal>-Zeile angegeben werden, so tritt &kdm; diesen Multicast-Gruppen an der Schnittstelle bei. Für IPv6-Multicast hat die IANA ff0<replaceable>X</replaceable>:0:0:0:0:0:0:12b als den permanent zugewiesenen Adressbereich für &XDMCP; vorgesehen. Das <replaceable>X</replaceable> im Präfix kann durch einen gültigen Bereichsidentifizierer (scope), wie &eg; 1 für Node-Local, 2 für Link-Local, 5 für Site-Local &etc; (siehe IETF RFC 2373) vergeben werden. &kdm; verwendet in der Voreinstellung die Link-Local-Adresse ff02:0:0:0:0:0:0:12b um möglichst nah am IPv4-Pendant zu sein. Wenn keine <literal>LISTEN</literal>-Zeilen angegeben werden, wartet &kdm; auf allen Schnittstellen und betritt die Standard-Multicastgruppe für &XDMCP;-Anfragen. Um das Warten auf &XDMCP;-Verbindungen zu deaktivieren, können Sie eine <literal>LISTEN</literal>-Zeile ohne Adresse angeben, jedoch wird die Verwendung von <literal>[Xdmcp]</literal> <option>Enable</option> vorgezogen.

source: Supplementary programs
de: Hilfsprogramme

source: The following programs are run by &kdm; at various stages of a session. They typically are shell scripts.
de: Die folgenden Programme werden von &kdm; in bestimmten Startphasen ausgeführt. Es handelt sich typischerweise um Shell-Skripte.

source: The Setup, Startup and Reset programs are run as <systemitem class="username">root</systemitem>, so they should be careful about security. Their first argument is <literal>auto</literal> if the session results from an automatic login; otherwise, no arguments are passed to them.
de: Die Setup-, Startup- und Reset-Programme werden als Systemverwalter <systemitem class="username">root</systemitem> ausgeführt. Beim Erstellen dieser Skripte sollte man die Systemsicherheit im Auge behalten. Das erste Argument ist <literal>auto</literal>, sofern die Sitzung aus einer automatischen Anmeldung resultiert; ansonsten werden keine Argumente an die Skripte übergeben.

source: Setup program
de: Setup-Programm

source: The <filename>Xsetup</filename> program is run after the &X-Server; is started or reset, but before the greeter is offered. This is the place to change the root background (if <option>UseBackground</option> is disabled) or bring up other windows that should appear on the screen along with the greeter. Resources for this program can be put into the file named by <option>Resources</option>.
de: Das Programm <filename>Xsetup</filename> wird ausgeführt, nachdem der &X-Server; gestartet oder zurückgesetzt wurde, aber befor das Anmeldefenster angezeigt wird. Hier können Sie &eg; den Hintergrund verändern (falls die Option <option>UseBackground</option> deaktiviert ist) oder zusätzliche Fenster anzeigen lassen. Ressourcen für das Programm können in der Datei mit Namen <option>Resources</option> abgelegt werden.

source: In addition to any specified by <option>ExportList</option>, the following environment variables are passed:
de: Zusätzlich zu den mit <option>ExportListe</option> angegebenen, werden noch die folgenden Umgebungsvariablen übergeben:

source: the associated display name
de: der zugewiesene Displayname

source: the value of <option>SystemPath</option>
de: der Wert von <option>SystemPath</option>

source: the value of <option>SystemShell</option>
de: der Wert von <option>SystemShell</option>

source: may be set to an authority file
de: kann auf eine Authority-Datei gesetzt werden

source: the value of <option>FifoDir</option>
de: der Wert von <option>FifoDir</option>

source: <option>GrabInput</option> can make &kdm; grab the keyboard and mouse, making any other windows unable to receive input. If <option>GrabServer</option> is set, <filename>Xsetup</filename> will not be able to connect to the display at all.
de: <option>GrabInput</option> veranlasst &kdm; dazu, Tastatur und Maus exklusiv zu beanspruchen, wodurch andere Fenster keine Eingaben mehr empfangen können. Ist <option>GrabServer</option> gesetzt, kann sich <filename>Xsetup</filename> nicht zum Display verbinden.

source: Startup program
de: Startup-Programm

source: The <filename>Xstartup</filename> program is run as <systemitem class="username">root</systemitem> when the user logs in. This is the place to put commands which add entries to <filename>utmp</filename> (the <command>sessreg</command> program may be useful here), mount users' home directories from file servers, or abort the session if some requirements are not met (but note that on modern systems, many of these tasks are already taken care of by <acronym>PAM</acronym> modules).
de: Das Programm <filename>Startup</filename> wird als Systemverwalter <systemitem class="username">root</systemitem> ausgeführt, wenn der Benutzer sich anmeldet. Hier können Einträge in <filename>utmp</filename> vorgenommen werden (dafür könnte <command>sessreg</command> nützlich sein), entfernte Persönliche Ordner des Benutzers eingebunden werden, oder die Sitzung beendet werden falls eine Voraussetzung nicht erfüllt wird. Die meisten dieser Aufgaben werden auf modernen Systemen bereits von entsprechenden <acronym>PAM</acronym>-Modulen bereitgestellt.

source: the initial working directory of the user
de: der initiale Arbeitsordner des Benutzers

source: the username
de: der Benutzername

source: &kdm; waits until this program exits before starting the user session. If the exit value of this program is non-zero, &kdm; discontinues the session and starts another authentication cycle.
de: &kdm; wartet, bis das Programm beendet ist, bevor es die eigentliche Sitzung des Benutzers startet. Wenn der Rückgabewert des Programms nicht 0 ist, wird &kdm; die Sitzung nicht fortführen und stattdessen erneut authentifizieren.

source: Session program
de: Session-Programm

source: The <filename>Xsession</filename> program is the command which is run as the user's session. It is run with the permissions of the authorized user. One of the keywords <literal>failsafe</literal>, <literal>default</literal> or <literal>custom</literal>, or a string to <command>eval</command> by a Bourne-compatible shell is passed as the first argument.
de: Das Programm <filename>Xsession</filename> ist der Befehl, welches als die Sitzung des Benutzers ausgeführt wird. Sie wird mit den Rechten des angemeldeten Benutzers ausgeführt. Das erste Argument an das Programm ist der Wert <literal>failsafe</literal>, <literal>default</literal>, <literal>custom</literal> oder eine Zeichenkette an <command>eval</command>, die von einer Bourne-Shell ausgewertet werden kann.

source: the value of <option>UserPath</option> (or <option>SystemPath</option> for <systemitem class="username">root</systemitem> user sessions)
de: der Wert von <option>UserPath</option> (oder <option>SystemPath</option> für <systemitem class="username">root</systemitem>-Sitzungen)

source: the user's default shell
de: Die Standard-Shell des Benutzers

source: may be set to a non-standard authority file
de: kann auf eine vom Standard abweichende Authority-Datei eingestellt werden

source: may be set to a Kerberos4 credentials cache name
de: kann auf einen Zwischenspeicher-Namen für Kerberos4-Benutzerdaten eingestellt werden

source: may be set to a Kerberos5 credentials cache name
de: kann auf einen Zwischenspeicher-Namen für Kerberos5-Benutzerdaten eingestellt werden

source: will contain a comma-separated list of parameters the session might find interesting, like which conversation plugin was used for the login
de: enthält eine durch Kommata getrennte Liste mit Parametern, die für die Sitzung interessant sein könnten. Dazu gehört zum Beispiel, welche Kommunikationserweiterung für die Anmeldung benutzt wurde

source: the name of the session the user has chosen to run
de: der Name der Sitzung, die der Benutzer ausgewählt hat

source: Reset program
de: Reset-Programm

source: Symmetrical with <filename>Xstartup</filename>, the <filename>Xreset</filename> program is run after the user session has terminated. Run as <systemitem class="username">root</systemitem>, it should contain commands that undo the effects of commands in <filename>Xstartup</filename>, removing entries from <filename>utmp</filename> or unmounting directories from file servers.
de: Entsprechend zu <filename>Xstartup</filename> wird <filename>Xreset</filename> ausgeführt, nachdem die Sitzung beendet wurde. Dies wird als Systemverwalter <systemitem class="username">root</systemitem> ausgeführt und sollte die Befehle zum Rückgängigmachen der Befehle aus <filename>Xstartup</filename> enthalten. Dazu gehört &eg; das Entfernen der Einträge aus <filename>utmp</filename> oder das Lösen der Laufwerkseinbindungen von Dateiservern.

source: The environment variables that were passed to <filename>Xstartup</filename> are also passed to <filename>Xreset</filename>.
de: Die Umgebungsvariablen, die an <filename>Xstartup</filename> übergeben wurden, werden ebenso an <filename>Xreset</filename> übergeben.
