Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kde-workspace/kdm_kdmrc-ref.po
Languages: de

source: Enabling this option disables <option>UseBackground</option> and <option>Setup</option>.
de: Das Aktivieren dieser Einstellung deaktiviert die Optionen <option>UseBackground</option> und <option>Setup</option>.

source: This option specifies the maximum time &kdm; will wait for the grabs to succeed. A grab may fail if some other X-client has the &X-Server; or the keyboard grabbed, or possibly if the network latencies are very high. You should be cautious when raising the timeout, as a user can be spoofed by a look-alike window on the display. If a grab fails, &kdm; kills and restarts the &X-Server; (if possible) and the session.
de: Diese Option gibt die maximale Wartezeit für &kdm; an, bis eine Beanspruchung erfolgreich ist. Eine Beanspruchung könnte scheitern, wenn der &X-Server; oder die Tastatur bereits durch einen anderen X-Client beansprucht wird oder wenn die Wartezeit im Netzwerk ziemlich hoch ist. Sie sollten die Wartezeit nicht unvorsichtig heraufsetzen, denn ein Benutzer könnte getäuscht werden durch ein Fenster, welches wie das Anmeldefenster von &kdm; aussieht. Falls die Beanspruchung durch &kdm; fehlschlägt, werden der &X-Server; (wenn möglich) sowie die Sitzung beendet und neu gestartet.

source: The default is <quote>3</quote>.
de: Die Voreinstellung ist <quote>3</quote>.

source: Warn, if a display has no X-authorization. This will be the case if
de: Warnen, falls ein Display keine X-Autorisierung hat. Dies ist der Fall, wenn

source: the authorization file for a local &X-Server; could not be created,
de: die Datei mit den Autorisierungsdaten für den lokalen &X-Server; nicht erstellt werden konnte,

source: a remote display from &XDMCP; did not request any authorization or
de: ein entferntes &XDMCP;-Display keine Autorisierung angefordert hat oder

source: the display is a <quote>foreign</quote> display specified in <option>StaticServers</option>.
de: das Display ein <quote>entferntes</quote> Display aus der Liste <option>StaticServers</option> ist.

source: Specify whether the greeter of local displays should start up in host chooser (remote) or login (local) mode and whether it is allowed to switch to the other mode.
de: Gibt an, ob das Anmeldefenster für lokale Displays mit der Auswahl von entfernten Rechnern oder der lokalen Anmeldung starten soll und ob der Wechsel zum jeweils anderen Modus erlaubt ist.

source: only local login possible
de: nur lokale Anmeldung möglich

source: start up in local mode, but allow switching to remote mode
de: im lokalen Modus starten, das Umschalten in den entfernten Modus ist erlaubt

source: only choice of remote host possible
de: es können nur entfernte Rechner ausgewählt werden

source: The default is <quote>LocalOnly</quote>.
de: Die Voreinstellung ist <quote>LocalOnly</quote>.

source: A list of hosts to be automatically added to the remote login menu. The special name <literal>*</literal> means broadcast. Has no effect if <option>LoginMode</option> is <literal>LocalOnly</literal>.
de: Eine Liste mit Rechnern, die automatisch zum Menü für entfernte Anmeldungen hinzugefügt werden. Der besondere Eintrag <literal>*</literal> meint Broadcast. Dies hat keine Wirkung, wenn <option>LoginMode</option> auf <literal>LocalOnly</literal> eingestellt ist.

source: The default is <quote>*</quote>.
de: Die Voreinstellung ist <quote>*</quote>.

source: Use this number as a random seed when forging saved session types, etc. of unknown users. This is used to avoid telling an attacker about existing users by reverse conclusion. This value should be random but constant across the login domain.
de: Diese Zahl wird als Zufallsbasis verwendet, wenn gefälschte gespeicherte Sitzungstypen &etc; für unbekannte Benutzer generiert werden. Dies ist nützlich, um einem potentiellen Angreifer keine Rückschlüsse auf real existierende Benutzer zu ermöglichen. Dieser Wert sollte zufällig, aber einheitlich über die gesamte Anmeldedomäne sein.

source: Enable &kdm;'s built-in <command>xconsole</command>. Note that this can be enabled for only one display at a time. This option is available only if &kdm; was <command>configure</command>d with <option>--enable-kdm-xconsole</option>.
de: Aktiviert &kdm;s eingebaute <command>xconsole</command>. Hinweis: Dies kann nur für ein Display gleichzeitig aktiv sein. Die Option ist nur verfügbar, wenn &kdm; mit der Option <option>--enable-kdm-xconsole</option> konfiguriert und kompiliert wurde.

source: The data source for &kdm;'s built-in <command>xconsole</command>. If empty, a console log redirection is requested from <filename>/dev/console</filename>. Has no effect if <option>ShowLog</option> is disabled.
de: Die Datenquelle für &kdm;s eingebaute <command>xconsole</command>. Falls leer, wird eine Protokollumleitung von <filename>/dev/console</filename> angefordert. Dies zeigt keine Wirkung, wenn <option>ShowLog</option> deaktiviert ist.

source: Specify conversation plugins for the login dialog; the first in the list is selected initially. Each plugin can be specified as a base name (which expands to <filename>$<envar>kde_modulesdir</envar>/kgreet_<replaceable>base</replaceable></filename>) or as a full pathname.
de: Gibt Kommunikationserweiterungen für das Anmeldefenster an; die erste in der Liste ist eingangs ausgewählt. Jede Erweiterung kann mit dem Basisnamen (expandiert zu <filename>$<envar>kde_modulordner</envar>/kgreet_<replaceable>basis</replaceable></filename>) oder dem vollständigen Pfad angegeben werden.

source: Conversation plugins are modules for the greeter which obtain authentication data from the user. Currently only the <literal>classic</literal> plugin is shipped with &kde;; it presents the well-known username and password form.
de: Kommunikationserweiterungen sind Module für das Anmeldefenster, mit deren Hilfe Authentifizierungsdaten über Benutzer eingeholt werden können. Mit &kde; wird derzeit nur die <literal>classic</literal>-Erweiterung ausgeliefert, welche die typische Form Benutzername/Passwort unterstützt.

source: The default is <quote>classic</quote>.
de: Die Voreinstellung ist <quote>classic</quote>.

source: Same as <option>PluginsLogin</option>, but for the shutdown dialog.
de: Das Gleiche wie <option>PluginsLogin</option>, nur für den Herunterfahren-Dialog.

source: A list of options of the form <replaceable>Key</replaceable><literal>=</literal><replaceable>Value</replaceable>. The conversation plugins can query these settings; it is up to them what possible keys are.
de: Eine Liste mit Optionen in der Form <replaceable>Schlüssel</replaceable><literal>=</literal><replaceable>Wert</replaceable>. Die Kommunikationserweiterungen können diese Einstellungen abrufen; welche Schlüssel-Wert-Paare gültig sind, liegt im Ermessen der jeweiligen Erweiterung.

source: Show the <guilabel>Console Login</guilabel> action in the greeter (if <option>ServerTTY</option>/<option>ConsoleTTYs</option> is configured).
de: Zeigt die Option zur Konsolen-Anmeldung im Anmeldefenster an (falls <option>ServerTTY</option>/<option>ConsoleTTYs</option> eingerichtet ist).

source: Show the <guilabel>Restart X Server</guilabel>/<guilabel>Close Connection</guilabel> action in the greeter.
de: Zeigt die Option <guilabel>X-Server neu starten</guilabel>/<guilabel>Verbindung schließen</guilabel> im Anmeldefenster an.

source: A program to run while the greeter is visible. It is supposed to preload as much as possible of the session that is going to be started (most probably).
de: Ein Programm, welches läuft, während das Anmeldefenster sichtbar ist. Dieses soll soviel wie möglich von der (wahrscheinlich) zu startenden Sitzung im Voraus laden.

source: Whether the greeter should be themed. Note that the themed greeter is challenged accessibility-wise, and themes may lack support for features like a user list or alternative authentication methods.
de: Gibt an ob ein Design für das Anmeldefenster verwendet werden soll. Beachten Sie dass ein Design nur eingeschränkte Zugangshilfen bereitstellen kann und möglicherweise Funktionen wie eine Benutzerliste oder alternative Autorisierung-Verfahren nicht unterstützt.

source: The theme to use for the greeter. Can point to either a directory or an XML file.
de: Der für das Anmeldefenster zu verwendende Stil. Dies kann entweder auf einen Ordner oder auf eine XML-Datei verweisen.

source: Enable the Alt-Ctrl-D shortcut to toggle greeter theme debugging.
de: Aktiviert das Tastenkürzel Alt-Strg-D zum Ein- und Ausschalten des Debuggings des Designs für das Anmeldefensters.

source: Specifying permanent &X-Server;s
de: Angeben permanenter &X-Server;

source: Each entry in the <option>StaticServers</option> list indicates a display which should constantly be managed and which is not using &XDMCP;. This method is typically used only for local &X-Server;s that are started by &kdm;, but &kdm; can manage externally started (<quote>foreign</quote>) &X-Server;s as well, may they run on the local machine or rather remotely.
de: Jeder Eintrag in der Liste <option>StaticServers</option> definiert ein Display, das dauerhaft verwaltet werden soll und kein &XDMCP; verwendet. Diese Methode wird typischerweise nur für lokale, von &kdm; gestartete &X-Server; verwendet; &kdm; kann jedoch auch externe Displays verwalten, egal ob sie auf dem gleichen Rechner oder räumlich entfernt laufen.

source: The formal syntax of a specification is <screen> <userinput><replaceable>display&nbsp;name</replaceable>&nbsp;[<literal>_</literal><replaceable>display&nbsp;class</replaceable>]</userinput> </screen> for all &X-Server;s. <quote>Foreign</quote> displays differ in having a host name in the display name, may it be <literal>localhost</literal>.
de: Die formale Syntax lautet:<screen> <userinput><replaceable>Display-Name</replaceable>&nbsp;[<literal>_</literal><replaceable>Display-Klasse</replaceable>]</userinput></screen> für alle &X-Server;. <quote>Fremde</quote> Displays unterscheiden sich darin, dass ihr Name einen Rechnernamen enthält, und sei es nur <literal>localhost</literal>.

source: The <replaceable>display name</replaceable> must be something that can be passed in the <option>-display</option> option to an X program. This string is used to generate the display-specific section names, so be careful to match the names. The display name of &XDMCP; displays is derived from the display's address by reverse host name resolution. For configuration purposes, the <literal>localhost</literal> prefix from locally running &XDMCP; displays is <emphasis>not</emphasis> stripped to make them distinguishable from local &X-Server;s started by &kdm;.
de: Der <replaceable>Displayname</replaceable> muss der Option <option>-display</option> des X-Programms angehängt werden können. Diese Angabe wird zum Erzeugen der Display-spezifischen Abschnittsnamen verwendet, achten Sie also darauf, die Namen korrekt anzugeben. Der Displayname von &XDMCP;-Displays wird aus der Adresse des rückwärts aufgelösten Rechnernamens generiert. Zu Zwecken der Konfiguration wird das Präfix <literal>localhost</literal> von lokal laufenden &XDMCP;-Displays nicht entfernt, um sie von durch &kdm; gestarteten Displays unterscheiden zu können.

source: The <replaceable>display class</replaceable> portion is also used in the display-specific sections. This is useful if you have a large collection of similar displays (such as a corral of X terminals) and would like to set options for groups of them. When using &XDMCP;, the display is required to specify the display class, so the manual for your particular X terminal should document the display class string for your device. If it does not, you can run &kdm; in debug mode and <command>grep</command> the log for <quote>class</quote>.
de: Die <replaceable>Display-Klasse</replaceable> wird auch in den Display-spezifisch Bereichen verwendet. Dies ist nützlich, wenn Sie viele ähnliche Displays und Einstellungen für die gesamte Gruppe festlegen möchten. Wenn Sie &XDMCP; verwenden, muss das Display seine Klasse bekanntmachen. Das Handbuch zu Ihrem Terminal sollte die Display-Klasse für Ihr Gerät angeben. Falls dies nicht der Fall sein sollte, können Sie &kdm; im Debug-Modus betreiben und mit <command>grep</command> das Protokoll nach <quote>class</quote> durchforsten.

source: The displays specified in <option>ReserveServers</option> will not be started when &kdm; starts up, but when it is explicitly requested via the command socket. If reserve displays are specified, the &kde; menu will have a <guilabel>Start New Session</guilabel> item near the bottom; use that to activate a reserve display with a new login session. The monitor will switch to the new display, and you will have a minute to login. If there are no more reserve displays available, the menu item will be disabled.
de: Die in <option>ReserveServers</option> angegebenen Displays werden nicht beim Start von &kdm; gestartet, sondern wenn der Start explizit über den Befehls-Socket angefordert wird. Wenn Reserve-Displays angegeben sind, wird das &kde;-Menü ziemlich weit unten den Eintrag <guilabel>Neue Sitzung starten</guilabel> anzeigen; damit können Sie eine neue Reserve-Display mit einer neuen Sitzung starten. Ihr Bildschirm wird zu der neuen Sitzung umschalten und Sie haben eine Minute Zeit, sich anzumelden. Wenn keine weiteren Reserve-Displays mehr verfügbar sind, wird der Menüeintrag ausgeblendet.

source: When &kdm; starts a session, it sets up authorization data for the &X-Server;. For local servers, &kdm; passes <command><option>-auth</option>&nbsp;<filename><replaceable>filename</replaceable></filename></command> on the &X-Server;'s command line to point it at its authorization data. For &XDMCP; displays, &kdm; passes the authorization data to the &X-Server; via the <quote>Accept</quote> &XDMCP; message.
de: Wenn &kdm; eine Sitzung startet, werden die Autorisierungsdaten für den &X-Server; eingerichtet. Für lokale Server übergibt &kdm; die Option <command><option>-auth</option>&nbsp;<filename><replaceable>Dateiname</replaceable></filename></command> an den &X-Server; und übergibt damit die nötigen Daten. Für &XDMCP;-Displays übergibt &kdm; die Daten über die &XDMCP;-<quote>Accept</quote>-Nachricht.

source: &XDMCP; access control
de: &XDMCP; Zugriffskontrolle

source: The file specified by the <option>AccessFile</option> option provides information which &kdm; uses to control access from displays requesting service via &XDMCP;. The file contains four types of entries: entries which control the response to <quote>Direct</quote> and <quote>Broadcast</quote> queries, entries which control the response to <quote>Indirect</quote> queries, macro definitions, and entries which control on which network interfaces &kdm; listens for &XDMCP; queries. Blank lines are ignored, <literal>#</literal> is treated as a comment delimiter causing the rest of that line to be ignored, and <literal>\</literal> causes an immediately following newline to be ignored, allowing host lists to span multiple lines.
de: Die mit <option>AccessFile</option> angegebene Datei enthält Informationen, mit denen &kdm; die Kontrolle über Verbindungsversuche von entfernten &XDMCP;-Displays regelt. Die Datei enthält vier Arten von Einträgen: Regeln zur Reaktion auf <quote>direkte</quote> und <quote>Broadcast</quote>-Anfragen, Regeln zur Reaktion auf <quote>indirekte</quote> Anfragen, Makrodefinitionen, und Einträge zum Festlegen der Netzwerkschnittstellen, auf welchen &kdm; auf &XDMCP;-Anfragen wartet. Leere Zeilen werden ignoriert, <literal>#</literal> wird als Kommentarzeichen gewertet, woraufhin der Rest der Zeile ignoriert wird, und <literal>\</literal> bewirkt, dass ein direkt darauf folgendes <quote>newline</quote>-Zeichen ignoriert wird, um &eg; eine Liste über mehrere Zeilen realisieren zu können.

source: The format of the <quote>Direct</quote> entries is simple, either a host name or a pattern, which is compared against the host name of the display device. Alternatively, a macro may be used to make the entry match everything the macro expands to. Patterns are distinguished from host names by the inclusion of one or more meta characters; <literal>*</literal> matches any sequence of 0 or more characters, and <literal>?</literal> matches any single character. If the entry is a host name, all comparisons are done using network addresses, so any name which converts to the correct network address may be used. Note that only the first network address returned for a host name is used. For patterns, only canonical host names are used in the comparison, so ensure that you do not attempt to match aliases. Host names from &XDMCP; queries always contain the local domain name even if the reverse lookup returns a short name, so you can use patterns for the local domain. Preceding the entry with a <literal>!</literal> character causes hosts which match that entry to be excluded. Preceding it with an <literal>=</literal> has no effect but is required when specifying a macro to distinguish the entry from a macro definition. To only respond to <quote>Direct</quote> queries for a host or pattern, it can be followed by the optional <literal>NOBROADCAST</literal> keyword. This can be used to prevent a &kdm; server from appearing on menus based on <quote>Broadcast</quote> queries.
de: Das Format der <quote>indirekten</quote> Einträge ist einfach, entweder ein Rechnername oder Muster, welches mit dem Rechnernamen des Displays verglichen wird. Alternativ kann ein Makro verwendet werden, damit der Eintrag auf alles passt, wozu das Makro aufgelöst werden kann. Muster werden von Rechnernamen mit Hilfe von einem oder mehr Metazeichen unterschieden: <literal>*</literal> passt auf eine Folge von 0 oder mehr Zeichen und <literal>?</literal> passt auf genau ein beliebiges Zeichen. Wenn der Eintrag ein Rechnername ist, werden alle Vergleiche mit Hilfe von Netzwerkadressen durchgeführt. Jeder Name, der zur korrekten Adresse aufgelöst werden kann, ist gültig. Nur die erste für einen Rechnernamen ermittelte Netzwerkadresse wird verwendet. Für Muster werden nur kanonische Rechnernamen in den Vergleich einbezogen, stellen Sie also sicher, dass Sie keine Aliase verwenden. Rechnernamen aus &XDMCP;-Anfragen enthalten immer den lokalen Domänennamen, selbst wenn die Rückwärtsauflösung einen Kurznamen zurückliefert. Sie können also Muster für die lokale Domäne verwenden. Wenn Sie einem Eintrag ein <literal>!</literal> voranstellen, so wird die Bedeutung umgekehrt, der Rechner also ausgeschlossen. Das Voranstellen von <literal>=</literal> hat keine Auswirkung, ist aber bei Angabe eines Makros nötig, um den Eintrag von einer Makro-Definition zu unterscheiden. Um nur auf <quote>direkte</quote> Anfragen für einen Rechner oder Muster zu reagieren, können Sie dem Eintrag das Stichwort <literal>NOBROADCAST</literal> anhängen. Auf diese Weise können Sie verhindern, dass ein &kdm;-Server in Menüs erscheint, die auf Broadcasts reagieren.

source: An <quote>Indirect</quote> entry also contains a host name, pattern or macro, but follows it with a list of host names or macros to which the queries should be forwarded. <quote>Indirect</quote> entries can be excluding as well, in which case a (valid) dummy host name must be supplied to make the entry distinguishable from a <quote>Direct</quote> entry. If compiled with IPv6 support, multicast address groups may also be included in the list of addresses the queries are forwarded to. If the indirect host list contains the keyword <literal>CHOOSER</literal>, <quote>Indirect</quote> queries are not forwarded, but instead a host chooser dialog is displayed by &kdm;. The chooser will send a <quote>Direct</quote> query to each of the remaining host names in the list and offer a menu of all the hosts that respond. The host list may contain the keyword <literal>BROADCAST</literal>, to make the chooser send a <quote>Broadcast</quote> query as well; note that on some operating systems, UDP packets cannot be broadcast, so this feature will not work.
de: Ein <quote>indirekter</quote> Eintrag enthält ebenfalls einen Rechnername, ein Muster oder ein Makro, jedoch folgt dem Eintrag eine Liste mit Rechnernamen oder Makros, an die die Anfragen weitergeleitet werden sollen. <quote>Indirekte</quote> Einträge können ebenfalls ausschließen. In diesem Fall müssen Sie einen (gültigen) dummy-Rechnernamen zur Verfügung stellen, damit der Eintrag von einem <quote>direkten</quote> Eintrag unterschieden werden kann. Falls &kdm; über IPv6-Unterstützung verfügt, können auch Multicast-Adressgruppen in der Liste erscheinen. Wenn die Liste der <quote>indirekten</quote> Rechner das Stichwort <literal>CHOOSER</literal> enthält, so werden <quote>indirekte</quote> Anfragen nicht weitergeleitet, stattdessen wird die Rechnerauswahl von &kdm; angezeigt. Diese wiederum sendet <quote>direkte</quote> Anfragen an jeden der verbleibenden Einträge in der Liste und offeriert dann ein Menü mit allen antwortenden Anzeigen. Die Rechnerliste kann auch das Stichwort <literal>BROADCAST</literal> enthalten, damit der Chooser auch <quote>Broadcast</quote>-Anfragen sendet. Beachten Sie bitte, dass einige Betriebssysteme keine UDP-Pakete via broadcast senden können, daher wird diese Funktion dort nicht korrekt arbeiten.

source: When checking access for a particular display host, each entry is scanned in turn and the first matching entry determines the response. <quote>Direct</quote> and <quote>Broadcast</quote> entries are ignored when scanning for an <quote>Indirect</quote> entry and vice-versa.
de: Bei der Überprüfung der Zugangsberechtigung für einen bestimmten Rechner wird jeder Eintrag durchgegangen und der erste passende Eintrag entscheidet über die Antwort. <quote>Direkte</quote> und <quote>Broadcast</quote>-Anfragen werden ignoriert, wenn nach einem <quote>indirekten</quote> Eintrag gesucht wird, und umgekehrt funktioniert es genauso.

source: A macro definition contains a macro name and a list of host names and other macros that the macro expands to. To distinguish macros from hostnames, macro names start with a <literal>%</literal> character.
de: Eine Makrodefinition enthält einen Makronamen und eine Liste mit Rechnernamen und weiteren Makros, auf die dieses Makro expandiert. Um Makros von Rechnernamen unterscheiden zu können, starten Sie mit dem Prozentzeichen <literal>%</literal>.
