Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kde-workspace/kdm_theme-ref.po
Languages: de

source: Creating themes for the &kdm; greeter
de: Das Erstellen von Designs für den Anmeldungsmanager von &kdm;

source: This section describes the creation of themes for the themed greeter. For examples including screenshots, see the installed standard themes and the themes from <ulink type="http" url="http://www.kde-look.org/index.php?xcontentmode=40"> the theme website</ulink>.
de: Dieser Abschnitt beschreibt das Erstellen von Designs für den Anmeldungsmanager. Beispiele mit Bildschirmfotos finden Sie bei den installierten Standarddesigns und den Designs von der <ulink type="http" url="http://www.kde-look.org/index.php?xcontentmode=40">Design-Webseite</ulink>.

source: Theme Overview
de: Überblick über Designs

source: &kdm; themes can be created by creating an XML file that follows the specification in <filename>$<envar>KDEDIR</envar>/share/apps/doc/kdm/greeter.dtd</filename>. Theme files are stored in the directory <filename class="directory">$<envar>KDEDIR</envar>/share/apps/kdm/themes/<replaceable>theme_name</replaceable></filename>. The theme directory should contain a file called <filename>KdmGreeterTheme.desktop</filename> which has similar format to other <filename class="extension">.desktop</filename> files and looks like:
de: Designs für &kdm; können mit Hilfe einer XML-Datei, die der Spezifikation in <filename>$<envar>KDEDIR</envar>/share/apps/doc/kdm/greeter.dtd</filename> folgt, erstellt werden. Designs werden im Ordner <filename class="directory">$<envar>KDEDIR</envar>/share/apps/kdm/themes/<replaceable>design_name</replaceable></filename> abgelegt. Der Design-Ordner sollte eine Datei mit dem Namen <filename>KdmGreeterTheme.desktop</filename> enthalten, die ein ähnliches Format aufweist wie die anderen <filename class="extension">.desktop</filename>-Dateien und wie folgt aussieht:

source: The <literal>Name</literal>, <literal>Description</literal>, <literal>Author</literal> and <literal>Copyright</literal> fields can be translated just like in other <filename class="extension">.desktop</filename> files. All the files that are mentioned should be in the theme directory itself. The <literal>Screenshot</literal> field points to a file which should be a 200x150 screenshot of the theme in action (it is OK not to have one, but it makes it nicer for the user). The <literal>Greeter</literal> entry points to an XML file that contains the description of the theme.
de: Die Felder <literal>Name</literal>, <literal>Description</literal>, <literal>Author</literal> und <literal>Copyright</literal> können wie bei den anderen <filename class="extension">.desktop</filename>-Dateien übersetzt werden. Alle aufgeführten Dateien sollten sich im Design-Ordner befinden. Das Feld <literal>Screenshot</literal> verweist auf eine Datei mit einem 200x150 großen Bildschirmfoto des Designs. (Sie können darauf auch verzichten, aber für den Anwender bietet es einen Vorteil.) Der Eintrag <literal>Greeter</literal> verweist auf eine XML-Datei, die die Beschreibung des Designs enthält.

source: Once a theme has been fully tested, make a tarball that contains the directory as it would be installed to the <filename class="directory">$<envar>KDEDIR</envar>/share/apps/kdm/themes</filename> directory. This is the standard format for distributing &kdm; themes.
de: Wenn das Design gründlich getestet ist, erstellen Sie ein tar-Archiv, das den Ordner in dem Zustand enthält, wie er im Ordner <filename class="directory">$<envar>KDEDIR</envar>/share/apps/kdm/themes</filename> installiert werden soll. Dies ist das Standardformat für die Verteilung von Designs für &kdm;.

source: Detailed Description of Theme XML format
de: Ausführliche Beschreibung des XML-Formats für Designs

source: Toplevel Node
de: Wurzel-Knoten

source: &kdm; themes are XML files with the &lt;greeter&gt; tag at their root. The toplevel node is an <link linkend="item-nodes">item node</link> of type <literal>rect</literal> with an implicit <link linkend="fixed-nodes">fixed layout</link>.
de: Designs für &kdm; sind XML-Dateien mit dem Tag &lt;greeter&gt; als Wurzel. Der Knoten auf der obersten Ebene ist ein <link linkend="item-nodes">Elementknoten</link> des Typs <literal>rect</literal> mit einer impliziten <link linkend="fixed-nodes">festgelegten Anordnung</link>.

source: Contained within the greeter tag can be the nodes described in the next sections of this document. Some of these nodes are containers (layout nodes, item nodes) which can contain other nodes again.
de: Eingeschlossen in das greeter-Tag können weitere Knoten sein, die in den folgenden Abschnitten dieses Dokuments beschrieben sind. Einige dieser Knoten sind Container (Anordnungs-Knoten, Element-Knoten), die weitere Knoten enthalten können.

source: Item Nodes
de: Element-Knoten

source: A &kdm; theme is created by specifying a hierarchy of item and layout nodes. Item nodes can have the following value for the <literal>type</literal> attribute:
de: Ein &kdm;-Design wird durch die Angabe einer Hierarchie von Element- und Anordnungsknoten erstellt. Element-Knoten können folgende Werte für das Attribut <literal>Typ</literal> haben:

source: A button field. This field uses a Qt button.
de: Ein Knopf-Feld. Dieses Feld benutzt einen Qt-Knopf.

source: It is also possible to make any other item act like a button by setting its <literal>button</literal> attribute to <literal>true</literal>. However, it is better to use Qt buttons in &kdm; themes since these are accessible to users with disabilities.
de: Sie können jeden anderen Eintrag dazu veranlassen sich wie ein Knopf zu verhalten, indem Sie das Attribut <literal>button</literal> auf <literal>true</literal> setzen. Sie sollten allerdings in &kdm;-Designs lieber Qt-Knöpfe verwenden, da diese auch für Benutzer mit Behinderungen zugänglich sind.

source: entry
de: Eintrag

source: An input widget like a line edit or combo box. Note that this is merely a placeholder for Qt widgets.
de: Ein Eingabe-Element wie ein Textfeld oder ein Kombinationsfeld. Beachten Sie, dies ist nur ein Platzhalter für Qt-Elemente.

source: A text label. Must contain either a <link linkend="text-nodes"><literal>text</literal> node</link> or a <link linkend="stock-nodes"><literal>stock</literal> node</link> to specify the text.
de: Eine Beschriftung. Diese muss entweder einen <link linkend="text-nodes"><literal>text</literal>-Knoten</link> oder einen <link linkend="stock-nodes"><literal>stock</literal>-Knoten</link> mit der Angabe des Textes enthalten.

source: A face browser widget.
de: Ein Widget für eine Gesichterliste

source: A raster image in a format that Qt supports, &eg; PNG, JPEG, Tiff, etc.
de: Ein Rasterbild in einem von Qt unterstützten Format, &eg; PNG, JPEG, Tiff usw.

source: A plain rectangle.
de: Ein einfaches Rechteck.

source: A vector image in SVG format.
de: Ein Vektorbild im SVG-Format.

source: For example: <programlisting> &lt;item type=&quot;label&quot;&gt; </programlisting> An item that acts as a button:
de: Ein Beispiel: <programlisting> &lt;item type=&quot;label&quot;&gt; </programlisting> Ein Eintrag, der sich wie ein Knopf verhält:

source: By default, the &kdm; login screen will disappear after authentication. This can result in flicker between the login screen and the session. The <literal>background</literal> attribute allows users to specify what elements of the theme are the background image. When used, this will cause &kdm; to remove all non-background items from the display and render the remaining <literal>background</literal> items to the root window. This can be used to create a smooth transition between the login screen and the session: <programlisting> &lt;item type=&quot;rect&quot; background=&quot;true&quot;&gt; &lt;normal file="background.svg"/&gt; &lt;pos x=&quot;0&quot; y=&quot;0&quot; width=&quot;100%&quot; height=&quot;-75&quot;/&gt; &lt;/item&gt; </programlisting> To use a different background for login transition than the one used for login, the theme should specify two item nodes (which could contain pixmaps or svg images, for example). The item which corresponds to the greeter background should not have the <literal>background</literal> property while the item which corresponds to the transition background should have the <literal>background</literal> property. For instance :
de: In der Voreinstellung verschwindet der Anmeldebildschirm von &kdm; nach der Authentifizierung. Dadurch kann es zu einem Flackern beim Umschalten zwischen Anmeldebildschirm und Arbeitssitzung führen. Mit dem Attribut <literal>background</literal> kann der Benutzer angeben, welche Elemente des Designs zum Hintergrundbild gehören. In diesem Fall entfernt &kdm; alle Elemente, die nicht zum Hintergrund gehören vom Display und rendert die verbleibenden <literal>background</literal>-Elemente in das Hintergrundfenster (root window). Damit erreicht man einen sanften Übergang zwischen dem Anmeldebildschirm und der Arbeitssitzung: <programlisting> &lt;item type=&quot;rect&quot; background=&quot;true&quot;&gt; &lt;normal file="background.svg"/&gt; &lt;pos x=&quot;0&quot; y=&quot;0&quot; width=&quot;100%&quot; height=&quot;-75&quot;/&gt; &lt;/item&gt; </programlisting> Wenn für den Übergang vom Anmeldebildschirm ein anderer Hintergrund verwendet werden soll als für den Anmeldebildschirm, sollte das Design zwei Element-Knoten angeben (die &eg; Pixmaps oder SVG-Bilder enthalten können). Das Element, das zum Hintergrund für den Anmeldungsmanager gehört, sollte keine Eigenschaft <literal>background</literal> haben, während das Element für den Übergangshintergrund die Eigenschaft <literal>background</literal> haben sollte. Ein Beispiel:

source: In multi-screen setups, themes may also specify the look of other screens than the one the greeter is on - but typically only background items will appear there. To specify which screen(s) an item should appear on, the <literal>screen</literal> attribute can be used with the value being one of <literal>greeter</literal>, <literal>other</literal> or <literal>all</literal>, meaning the screen the greeter is on, all screens the greeter is not on and all screens, resp.
de: Für Systeme mit mehreren Bildschirmen kann im Design auch das Erscheinungsbild für die Bildschirme ohne Anmeldungsmanager vorgegeben werden, typischerweise nur Elemente für den Bildschirmhintergrund. Um den Bildschirm anzugeben, auf dem ein Element angezeigt werden soll, kann das Attribut <literal>screen</literal> mit einem der Werte <literal>greeter</literal> (für den Bildschirm mit dem Anmeldungsmanager), <literal>other</literal> (für die Bildschirme ohne Anmeldungsmanager) oder <literal>all</literal> (für alle Bildschirme) benutzt werden.

source: Each item can be given a name via the <literal>id</literal> attribute. Certain ids are recognized by &kdm; to give those items a special function:
de: Jedem Elemente kann über das Attribut <literal>id</literal> ein Name zugeordnet werden. &kdm; kennt bestimmte ids, um diesen Elementen besondere Funktionen zuzuordnen:

source: <literal>button</literal> items and items with the <literal>button=&quot;true&quot;</literal> attribute.
de: <literal>button</literal>-Elemente und Elemente mit dem Attribut <literal>button=&quot;true&quot;</literal>.

source: Buttons typically trigger certain actions. Addionally, &kdm; will hide buttons whose actions are not available for some reason.
de: Knöpfe lösen typischerweise bestimmte Aktionen aus. Knöpfe, deren Aktionen aus irgendeinem Grund nicht verfügbar sind, werden von &kdm; ausgeblendet.

source: Action
de: Aktion

source: Runs the XDMCP chooser.
de: Startet die XDMCP-Auswahl

source: Disconnect from remote session.
de: Verbindung zu Fremdrechner abbrechen.

source: Open the session type selection menu.
de: Öffnet das Auswahlmenü für den Sitzungstyp.

source: Open a catch-all menu with various options and actions, depending on the configuration.
de: Öffnet ein allumfassendes Menü mit verschiedenen Optionen und Aktion, abhängig von der Konfiguration.

source: <literal>label</literal> items
de: <literal>label</literal>-Einträge

source: &kdm; will show/hide these labels and set their text depending on the state of the login dialog.
de: &kdm; blendet diese Beschriftungen ein bzw. aus und setzt ihren Text abhängig vom Status des Anmeldedialogs.

source: Function
de: Funktion

source: This displays the <guilabel>Login failed.</guilabel> message.
de: Hiermit wird die Nachricht <guilabel>Anmeldung fehlgeschlagen</guilabel> angezeigt.

source: Widget embedding items
de: Einträge mit eingebetteten Elementen

source: &kdm; will embed particular Qt widgets into these items.
de: &kdm; bettet bestimmte Qt-Elemente in diese Einträge ein.

source: Entry field for username entry.
de: Eingabefeld für den Benutzernamen.

source: Entry field for password entry.
de: Eingabefeld für das Passwort.

source: Some <quote>conversation</quote> plugins use this field to query a domain name. If this field is present, the related enclosing items should have <link linkend="show-nodes">show nodes</link> with the type <literal>plugin-domain-entry</literal>.
de: Einige <quote>Kommunikationserweiterungen</quote> benutzen dieses Feld zur Abfrage eines Domänen-Namens. Ist dieses Feld vorhanden, sollten die damit verbundenen, umschließenden Elemente <link linkend="show-nodes">Anzeigeknoten</link> vom Typ <literal>plugin-domain-entry</literal> haben.

source: This item should be of type <literal>rect</literal>. It represents the <quote>hot</quote> area of the greeter: it contains the <literal>label</literal> and <literal>entry</literal> items which concern the authentication process. If a given <quote>conversation</quote> plugin cannot match the existing items with its needs, it tries to embed a complex widget with an own layout into this item, thus completely overriding the theme's <quote>talker</quote>. Strictily speaking, &kdm; themes do not need to provide own <quote>talker</quote> designs at all, as all &kdm; authentication plugins are able make use of the <literal>talker</literal> item.
de: Dieses Element sollte den Typ <literal>rect</literal> haben. Es stellt den <quote>heißen</quote> Bereich des Anmeldemanagers dar: Es enthält die <literal>label</literal>- und <literal>entry</literal>-Elemente, die sich um den Authentifizierungsvorgang kümmern. Findet eine <quote>Kommunikationserweiterung</quote> nicht die benötigten Elemente, versucht es ein komplexes Bildschirmelement mit eigener Anordnung in dieses Element einzubetten und damit den <quote>talker</quote> des Designs komplett zu überschreiben. Streng genommen müssen &kdm;-Designs keine eigenen <quote>talker</quote>-Designs bereitstellen, da alle Authentifizierungserweiterungen von &kdm; das Element <literal>talker</literal> benutzen können.

source: This item must be of type <literal>list</literal>. If the user list feature is enabled, &kdm; will embed the user list widget here. Otherwise, this item is hidden.
de: Dieser Eintrag muss vom Typ <literal>list</literal> sein. Ist die Funktion Benutzerliste eingeschaltet, bettet &kdm; das Element mit der Benutzerliste hier ein. Anderenfalls ist der Eintrag unsichtbar.

source: This item should be of type <literal>rect</literal>. If the built-in <command>xconsole</command> feature is compiled in and enabled, &kdm; will embed the console log widget here. Otherwise, this item is hidden.
de: Dieser Eintrag sollte vom Typ <literal>rect</literal> sein. Ist die eingebaute Funktion <command>xconsole</command> einkompiliert und aktiviert, bettet &kdm; das Protokoll-Element für die Konsole hier ein. Anderenfalls ist dieser Eintrag ausgeblendet.

source: Other items
de: Andere Einträge

source: &kdm; will show/hide these items depending on the configuration and the current state of the greeter. &kdm; does not impose type requirements on them, but they usually lend themselves to a particular type.
de: &kdm; blendet diese Elemente ein bzw. aus, abhängig von der Konfiguration und dem aktuellen Status des Anmeldemanagers. &kdm; setzt hier keinen bestimmten Typ voraus, aber es bietet sich ein bestimmter Typ an.

source: Shown only when ...
de: Nur anzeigen, wenn ...

source: ... timed login is in progress.
de: ... eine geplante Anmeldung läuft.

source: ... Caps Lock is active.
de: ... die Feststelltaste aktiv ist.

source: ... the &X-Server; requires no X authorization to connect.
de: ... der &X-Server; keine X-Authorisierung zum Verbinden benötigt.

source: ... the user list is enabled. By nesting the <literal>userlist</literal> item into this one, it is possible to create something like a frame around the list and have it shown only when the user list itself if shown.
de: ... die Benutzerliste eingeschaltet ist. Indem Sie das Element <literal>userlist</literal> hierin einbetten, ist es möglich so etwas wie einen Rahmen um die Liste zu erstellen, der nur angezeigt wird, wenn auch die Benutzerliste angezeigt wird.

source: ... the built-in <command>xconsole</command> is enabled. Analogous to <literal>userlist-rect</literal>.
de: ... die eingebaute <command>xconsole</command> eingeschaltet ist. Verhält sich analog zu <literal>userlist-rect</literal>.

source: Layout Container Nodes
de: Anordnungscontainer-Knoten

source: Layout nodes appear inside item nodes and contain item nodes again. The type of the layout node determines the arrangement of its child nodes. An item node can contain one layout node of each type.
de: Anordnungsknoten tauchen innerhalb von Element-Knoten auf und enthalten wiederum selbst Element-Knoten. Der Typ des Anordnungsknoten legt das Arrangement der Kindknoten fest. Ein Element-Knoten kann einen Anordnungsknoten beliebigen Typs enthalten.

source: Box Nodes
de: Kastenknoten

source: Box nodes automatically arrange their children in a row. They are specified as follows: <programlisting> &lt;box orientation=&quot;<replaceable>alignment</replaceable>&quot; min-width=&quot;<replaceable>num</replaceable>&quot; min-height=&quot;<replaceable>num</replaceable>&quot; xpadding=&quot;<replaceable>num</replaceable>&quot; ypadding=&quot;<replaceable>num</replaceable>&quot; spacing=&quot;<replaceable>num</replaceable>&quot; homogeneous=&quot;<replaceable>bool</replaceable>&quot;&gt; </programlisting> Where <replaceable>num</replaceable> means number of pixels and <replaceable>bool</replaceable> means either <literal>true</literal> or <literal>false</literal>. The <replaceable>alignment</replaceable> value can be either <literal>horizontal</literal> or <literal>vertical</literal>. If you leave any attribute off, it will default to zero for numbers, <literal>false</literal> for bools and <literal>vertical</literal> for the orientation.
de: Kastenknoten ordnen ihre Kinder automatisch in einer Reihe an. Sie sind wie folgt spezifiziert:<programlisting> &lt;box orientation=&quot;<replaceable>alignment</replaceable>&quot; min-width=&quot;<replaceable>num</replaceable>&quot; min-height=&quot;<replaceable>num</replaceable>&quot; xpadding=&quot;<replaceable>num</replaceable>&quot; ypadding=&quot;<replaceable>num</replaceable>&quot; spacing=&quot;<replaceable>num</replaceable>&quot; homogeneous=&quot;<replaceable>bool</replaceable>&quot;&gt; </programlisting> Hierbei bedeutet <replaceable>num</replaceable> die Anzahl der Pixel und <replaceable>bool</replaceable> bedeutet entweder <literal>true</literal> oder <literal>false</literal>. Der Wert <replaceable>alignment</replaceable> kann entweder <literal>horizontal</literal> oder <literal>vertical</literal> sein. Lassen Sie ein Attribut aus, wird dieses mit dem Wert 0 für Zahlen, <literal>false</literal> für bool und <literal>vertical</literal> für alignment angenommen.

source: The spacing is the distance between neighboring child items. The padding is the box' outer margin. If the box is homogeneous, the same amount of space is allocated to each child item.
de: Spacing ist der Abstand zwischen zwei benachbarten Kindelementen. Padding ist der äußere Rand des Kastens. Ist der Kasten <quote>homogeneous</quote>, wird für jedes Kindelement derselbe Platz bereitgestellt.

source: Fixed Nodes
de: Fixierte Knoten

source: Fixed is a container that has its children laid out at precise coordinates. The size of this container is the smallest rectangle that contains all the children. Fixed has no extra attributes and so you just use: <programlisting> &lt;fixed&gt; </programlisting> Then you put other items with proper position nodes inside it.
de: Fixiert ist ein Container, dessen Kindelemente an präzisen Koordinaten ausgerichtet sind. Die Größe dieses Containers wird durch das kleinste mögliche Rechteck festgelegt, dass alle Kinder umfasst. Das Tag fixed verfügt über keine weiteren Attribute, und darum wird es einfach so verwendet: <programlisting> &lt;fixed&gt; </programlisting> Dann platzieren Sie weitere Elemente mit entsprechenden Positionsknoten darin.

source: Position Nodes
de: Positionsknoten

source: Each item can specify its position and size via the <literal>pos</literal> node. For example:
de: Jedes Element kann seine Position und Größe über den <literal>pos</literal>-Knoten festlegen. Ein Beispiel:

source: If the size is not specified, it will be the item's <quote>natural</quote> size, called the size hint. Note that not all items have a useful size hint.
de: Ist keine Größe angegeben, wird die <quote>natürliche</quote> Größe des Elements verwendet, diese wird auch Größenhinweis genannt. Beachten Sie, dass nicht alle Elemente einen sinnvollen Größenhinweis haben.

source: Both position and size can be given in percent and will be calculated relative to the size of the enclosing container in this case. For toplevel items it is the percentage of the whole screen. By appending circumflexes (<literal>^</literal>) to the size specification it is possible to modify it to be relative to the size of the enclosing item's enclosing item and so on.
de: Position und size können in Prozent angegeben werden und werden in diesem Fall relativ zur Größe des umgebenden Containers berechnet. Bei Elementen der obersten Ebene bezieht sich der Prozentwert auf den gesamten Bildschirm. Durch Anhängen von Circumflexes (<literal>^</literal>) an die Angabe für size, kann diese auch relativ zur Größe des umschließenden Elements oder dessen umschließenden Elements &etc; angegeben werden.

source: If the item contains a box, <literal>width</literal> and <literal>height</literal> can be specified to be <literal>box</literal> to mean that they are supposed to be the width and height of the box, that is the items in the box plus the padding.
de: Enthält der Container einen Kasten, können <literal>width</literal> und <literal>height</literal> mit dem Wert <literal>box</literal> angegeben werden, was bedeutet, dass hier die Breite und Höhe des Kastens (die den Elementen im Kasten zuzüglich des Randes entspricht) gemeint ist.

source: One of <literal>width</literal> and <literal>height</literal> can be specified to be <literal>scale</literal> to mean that it should be scaled according to the other dimension's scale relative to its size hint. Use this to preserve the aspect ratio of scaled images automatically.
de: Entweder <literal>width</literal> oder <literal>height</literal> kann hier den Wert <literal>scale</literal> erhalten. Damit ist gemeint, dass die betreffende Abmessung entsprechend der Größe der anderen Dimension relativ zum Größenhinweis ausgelegt wird. Hiermit kann automatisch das Seitenverhältnis skalierter Bilder beibehalten werden.
