Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kde-workspace/kfontview.po
Languages: de

source: Font Viewer
de: Schriftartenbetrachter

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Burkhard</firstname><surname>Lück</surname><affiliation><address><email>lueck@hube-lueck.de</email></address></affiliation><contrib>Übersetzung</contrib></othercredit>

source: fontview
de: Schriftartenbetrachter

source: fonts
de: Schriften

source: &kfontview; is an application to view and install different types of fonts:
de: &kfontview; ist ein Programm zur Anzeige und Installation für folgende Schriftarten:

source: Postscript type 1 (file extension on &Windows; &amp; OS/2 <filename class="extension">.pfb</filename>/<filename class="extension">.pfm</filename>; on &UNIX;/&Linux; <filename class="extension">.pfa</filename>/<filename class="extension">.afm</filename>)
de: Postscript Type 1 (Dateierweiterung unter &Windows; &amp; OS/2 <filename class="extension">.pfb</filename>/<filename class="extension">.pfm</filename>; unter &UNIX;/&Linux; <filename class="extension">.pfa</filename>/<filename class="extension">.afm</filename>)

source: BDF (Bitmap Distribution Format, file extension <filename class="extension">.bdf</filename>)
de: BDF (Bitmap Distribution Format, Dateierweiterung <filename class="extension">.bdf</filename>)

source: PCF (Portable Compiled Format, file extension <filename class="extension">.pcf</filename>)
de: PCF (Portable Compiled Format, Dateierweiterung <filename class="extension">.pcf</filename>)

source: You can use it as standalone program to preview and install a font downloaded from the Internet. In the preview you can check that the font has all characters you need.
de: Mit &kfontview; können Sie Schriften, die Sie aus dem Internet heruntergeladen haben, betrachten und installieren. In der Vorschau können Sie überprüfen, ob die Schrift alle benötigten Zeichen enthält.

source: Additionally &kfontview; can be launched from the &systemsettings; module <ulink url="help:/kcontrol/fontinst/index.html"> <guilabel>Font Installer</guilabel></ulink> to use the extended preview capabilities of &kfontview;.
de: &kfontview; kann auch im Modul <ulink url="help:/kcontrol/fontinst/index.html"> <guilabel>Schriftarteninstallation</guilabel></ulink> der &systemsettings; gestartet werden, um die erweiterten Vorschauarten dieses Programms zu nutzen.

source: To use &kfontview; in &konqueror; select <guilabel>Services</guilabel> in the sidebar and go to the folders <filename class="directory">Fonts/Personal </filename> or <filename class="directory">Fonts/System</filename>. Then open the context menu with a &RMB; click on a font and start &kfontview; by selecting it from the context menu.
de: Auch in &konqueror; kann das Programm aufgerufen werden. Dazu wählen Sie dazu im Navigationsbereich <guilabel>KDE-Dienste</guilabel> aus und gehen dann zum Ordner <filename class="directory">Schriftarten/Personal</filename> oder <filename class="directory">Schriftarten/System</filename>. Öffnen Sie das Kontextmenü mit Klicken der &RMB; auf eine Schriftart und starten dann &kfontview;.

source: <screeninfo>&kfontview; application</screeninfo>
de: <screeninfo>Das Programm &kfontview;</screeninfo>

source: <phrase>&kfontview; application</phrase>
de: <phrase>Das Programm &kfontview;</phrase>

source: &kfontview;'s <guilabel>Standard Preview</guilabel> displays your font in several different sizes using a pangram (a sentence using every letter of the alphabet at least once). So you can get a good idea of what it will look like. From the drop down box in the toolbar you can choose additional preview types:
de: Die <guilabel>Standardvorschau</guilabel> in &kfontview; zeigt Ihre Schrift als Pangramm (ein Satz mit allen Buchstaben des Alphabets) in mehreren Schriftgrößen an, damit erhalten Sie eine Eindruck vom Erscheinungsbild der Schrift. Mithilfe des Mausrades können Sie die Schriftgröße ändern. Im Auswahlfeld in der Werkzeugleiste können Sie weitere Vorschauarten auswählen.

source: <guilabel>All Characters</guilabel> displays all characters provided by the font in one size.
de: <guilabel>Alle Zeichen</guilabel> zeigt alle in der Schrift in einer Größe.

source: Unicode Block: The Unicode standard arranges groups of characters together in blocks
de: Unicode-Block: Im Unicode-Standard werden Gruppen von Zeichen in Blöcken zusammengefasst.

source: Unicode Script: In Unicode, a script is a collection of letters and other written signs used to represent textual information in one or more writing systems
de: Unicode-Skript: In Unicode ist ein Skript eine Zusammenstellung von Buchstaben und Schriftzeichen, die zur Anzeige von Textinformation in einer oder mehreren Schriftsystemen.

source: <guibutton>Change Text</guibutton>: Using this button opens the <guilabel>Preview String</guilabel> dialog where you can insert a user defined text. This feature enables you to check that a font supports the characters you need.
de: <guibutton>Text ändern</guibutton>: Mit diesem Knopf öffnen Sie den Dialog <guilabel>Vorschau-Zeichenkette</guilabel> und können hier einen eigenen Text für die Vorschau eintragen. Mit dieser Funktion können Sie überprüfen, ob eine Schrift alle benötigten Zeichen enthält.

source: You can use the zoom buttons or the mousewheel to change the font size in all preview types.
de: Mit den Knöpfen zum Vergrößern oder Verkleinern oder mit dem Mausrad können Sie die Schriftgröße ändern.

source: In <guilabel>Unicode Block</guilabel> and <guilabel>Unicode Script</guilabel> preview mode additional tooltip info's are displayed hovering a character with the mouse pointer: The character's Unicode <guilabel>Category</guilabel> and the value in <guilabel> UCS-4</guilabel>, <guilabel>UTF-16</guilabel>, <guilabel>UTF-8</guilabel> and as <guilabel>XML Decimal Entity</guilabel>.
de: Im Vorschaumodus <guilabel>Unicode-Block</guilabel> und <guilabel>Unicode-Skript</guilabel> werden zusätzlich Informationen als Kurzinfos angezeigt, wenn Sie den Mauszeiger über ein Zeichen führen: Die Unicode-<guilabel>Kategorie</guilabel> sowie die als Schreibweise in <guilabel>UCS-4</guilabel>, <guilabel>UTF-16</guilabel>, <guilabel>UTF-8</guilabel> und als <guilabel>XML-Dezimal-Entität</guilabel>.

source: To install a font you downloaded from the Internet, click the <guibutton>Install</guibutton> button in the lower-right corner.
de: Um eine Schrift zu installieren, die Sie aus dem Internet heruntergeladen haben, klicken Sie auf den Knopf <guibutton>Installieren</guibutton> rechts unten.

source: You can install the font for personal us only available to you or system-wide available for all users, the latter will require administrator privileges.
de: Sie können Schriften nur für sich oder systemweit installieren. Eine systemweite Installation kann nur vom Systemverwalter durchgeführt werden.

source: Fonts are often provided in an archive format like <literal role="extension">zip</literal>. Open these archives with &ark; which provides a simple previewer for fonts. To make use of the extended capabilities of &kfontview; extract the fonts and open them in &kfontview;.
de: Schriften werden meistens in einem Archivformat wie <literal role="extension">zip</literal> angeboten. Öffnen Sie diese Archive mit &ark;, das eine einfache Vorschau ermöglicht. Um die erweiterten Fähigkeiten von &kfontview; zu benutzen, entpacken Sie die Schriften und öffnen Sie sie in &kfontview;.

source: Applications need to be restarted to use of the newly installed fonts.
de: Die neu installierten Schriften können nur von neu gestarteten Anwendungen benutzt werden.
