Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kde-workspace/kinfocenter.po
Languages: de

source: The &infocenter;
de: Das &infocenter;

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Frerich</firstname><surname>Raabe</surname><affiliation><address><email>raabe@kde.org</email></address></affiliation><contrib>Übersetzung</contrib></othercredit> <othercredit role="translator"><firstname>Thomas</firstname><surname>Diehl</surname><affiliation><address><email>tdh@kde.org</email></address></affiliation><contrib>Übersetzung</contrib></othercredit>

source: This documentation describes &kde;’s information center.
de: Dieses Dokument beschreibt das &kde;-Infozentrum.

source: The &infocenter; provides you with a centralized and convenient overview of your system and desktop environment.
de: Das &infocenter; bietet Ihnen einen zentralisierten und bequemen Überblick über Ihr System und die Arbeitsumgebung.

source: The information center is made up of multiple modules. Each module is a separate application, but the information center organizes all of these programs into a convenient location.
de: Das Infozentrum besteht aus mehreren Modulen. Jedes Modul ist eine separate Anwendung, aber das Infozentrum ordnet all diese Programme bequem an einem Ort an.

source: This next section details the use of the information center itself. For information on individual modules, please see <link linkend="module">Default KInfo Center Modules</link>.
de: Der nächste Abschnitt gibt detaillierte Informationen zur Benutzung des Infozentrums. Informationen zu einzelnen Modulen finden Sie im Abschnitt <link linkend="module">Die Standard-Module des KInfoCenter</link>.

source: Starting the &infocenter;
de: Das Starten des &infocenter;s

source: The &infocenter; can be started in three ways:
de: Das &infocenter; kann auf drei Arten gestartet werden:

source: By selecting <menuchoice><guimenu>Applications </guimenu><guisubmenu>System</guisubmenu><guimenuitem>Info Center</guimenuitem></menuchoice> from the application launcher in the panel.
de: Wählen Sie im Startmenü in der Kontrollleiste <menuchoice><guimenu>Programme</guimenu><guisubmenu>System</guisubmenu><guimenuitem>Infozentrum</guimenuitem></menuchoice>.

source: By pressing <keycombo action="simul">&Alt;<keycap>F2</keycap></keycombo>. This will bring up &krunner;. Type <userinput><command>kinfocenter</command></userinput>, and press &Enter;.
de: Drücken Sie die Tastenkombination <keycombo action="simul">&Alt;<keycap>F2</keycap></keycombo>. Damit wird &krunner; gestartet. Geben Sie dort <userinput><command>kinfocenter</command></userinput> ein und drücken Sie &Enter;.

source: You can type <command>kinfocenter &amp;</command> at any command prompt.
de: Sie können <command>kinfocenter &amp;</command> an jeder beliebigen Eingabeaufforderung eingeben.

source: All three of these methods are equivalent, and produce the same result.
de: Diese drei Methoden sind gleichwertig und ergeben das gleiche Resultat.

source: <title>The &infocenter; Screen</title>
de: <title>Das Fenster des &infocenter;</title>

source: When you start the information center, you are presented with a window, which can be divided into three functional parts.
de: Wenn Sie das Infozentrum starten, wird Ihnen ein Fenster präsentiert, das in drei funktionale Bereiche unterteilt werden kann.

source: The &infocenter; Screen.
de: Das Fenster des &infocenter;.

source: <phrase>The &infocenter; Screen</phrase>
de: <phrase>Das Fenster des &infocenter;</phrase>

source: Across the top is a toolbar. The toolbar will provide you with quick access to most of &infocenter;’s features like export, get help on the current module and a help menu.
de: Am oberen Rand befindet sich eine Werkzeugleiste. Diese Leiste bietet Ihnen den schnellen Zugriff auf die meisten Funktionen des &infocenter; wie <guibutton>Exportieren</guibutton>, Hilfe zum aktuellen Modul und ein Menü <guimenu>Hilfe</guimenu> zum Aufruf des Handbuchs für &infocenter;.

source: Along the left hand side, is a column with a filter field at the top. This is a where you choose which module to investigate. To navigate through the various <acronym>KCM</acronym> modules, left click on the module in the tree view. You can also use the arrow keys to scroll though the <acronym>KCM</acronym>'s and pressing &Enter; will select the module. The module will now appear of the main panel of the &infocenter; window. Some items within the tree view are categories, you can left click or again press &Enter; to expand and collapsed these items. This will show the modules under the category. You can right click on the module listing to show the following options:
de: Auf der linken Seite befindet sich eine Spalte mit einem Filterfeld darüber. Hier können Sie die Module auswählen, deren Informationen Sie lesen möchten. Um durch die verschiedenen <acronym>KCM</acronym>-Module zu navigieren, klicken Sie auf ein Modul in der Baumansicht. Sie können auch die Pfeiltasten benutzen, um durch die <acronym>KCM</acronym>s zu blättern. Drücken Sie die &Enter;taste um ein Modul auszuwählen, dann werden die Informationen im Hauptbereich des &infocenter; angezeigt. Einige Einträge in der Baumansicht sind Kategorien, Sie können mit der &LMBn; klicken oder die &Enter;taste drücken, um die darin enthaltenen Einträge ein- oder auszuklappen. Dann werden die Module in dieser Kategorie angezeigt. Durch Klicken mit der &RMBn; öffnen Sie ein Kontextmenü mit folgenden Aktionen:

source: <guimenuitem>Collapse All Categories</guimenuitem>: Collapses the tree to show only top level modules and categories.
de: <guimenuitem>Alle Kategorien zusammenklappen</guimenuitem>: Blendet die Untereinträge in der Baumansicht aus und zeigt nur die Kategorien an.

source: <guimenuitem>Expand All Categories</guimenuitem>: Expands the tree to show modules.
de: <guimenuitem>Alle Kategorien aufklappen</guimenuitem>: Erweitert die Baumansicht und zeigt alle Module an.

source: <guimenuitem>Clear Search</guimenuitem>: This will clear any filter you have applied on the module listing via the search box
de: <guimenuitem>Suchfeld leeren</guimenuitem>: Mit dieser Aktion wird der Filter gelöscht, der im Suchfeld für die Modulliste eingegeben wurde.

source: The main panel shows you the system information about the selected module.
de: Der Hauptteil des Programmfensters zeigt Ihnen Systeminformationen über das ausgewählte Modul.

source: The &infocenter; Toolbar
de: Die Werkzeugleiste des &infocenter;

source: This next section gives you a brief description of what each toolbar item does.
de: Dieser Abschnitt enthält eine kurze Beschreibung zu den einzelnen Aktionen in der Werkzeugleiste.

source: Module Help button
de: Der Knopf Modul-Hilfe

source: This button opens khelpcenter with the current help page for the information module.
de: Diese Aktion öffnet das &khelpcenter-de; mit der Dokumentation zum aktuell angezeigten Informationsmodul.

source: Help Menu button
de: Der Knopf Hilfe

source: &kinfocenter; has the common &kde; <guimenu>Help</guimenu> menu items, for more information read the section about the <ulink url="help:/fundamentals/ui.html#menus-help">Help Menu</ulink> of the &kde; Fundamentals.
de: &kinfocenter; benutzt die bekannten &kde;-Einträge im Menü <guimenu>Hilfe</guimenu>, weitere Informationen dazu finden Sie im Abschnitt über das Menü <ulink url="help:/fundamentals/uihtml#menus-help">Hilfe</ulink> der &kde;-Grundlagen.

source: Exiting The &kde; Information Center
de: Das Beenden des &kde;-Infozentrum

source: You can exit the info center one of two ways:
de: Sie können das Infozentrum auf zwei Wegen verlassen:

source: Type <keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo> on the keyboard.
de: Drücken Sie <keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo> auf der Tastatur.

source: Click on the <guiicon>Close</guiicon> button on the frame surrounding the info center.
de: Klicken Sie auf den Knopf <guiicon>Schließen</guiicon> in der Titelleiste.

source: The Default &infocenter; Modules
de: Die Standard-Module des &infocenter;

source: Summary Information Module
de: Übersicht

source: The summary information <acronym>KCM</acronym> provides a quick way to display important information. The module has three categories; <acronym>OS</acronym> Information, <acronym>CPU</acronym> Information and Hard Drive Information.
de: Die Übersicht zeigt alle wichtigen Information auf einen Blick. Das Modul besteht aus drei Kategorien: Informationen zum Betriebssystem (<acronym>OS</acronym>), zum Prozessor (<acronym>CPU</acronym>) und zur Festplatte.

source: You may have more than one of these information boxes per category.
de: Eine Kategorie kann auch mehrfach in der Übersicht vorkommen.

source: <title><acronym>OS</acronym> Information Box</title>
de: <title>Informationen zum Betriebssystem (<acronym>OS</acronym>)</title>

source: Screenshot of <acronym>OS</acronym> Information box
de: Bildschirmfoto der Informationen zum Betriebssystem

source: <phrase><acronym>OS</acronym> Information Box</phrase>
de: <phrase>Bildschirmfoto der Informationen zum Betriebssystem</phrase>

source: The <acronym>OS</acronym> information box has the following information:
de: Diese Gruppe enthält folgende Informationen:

source: <guilabel>OS Version</guilabel>: This is the version information of the Operating System KInfoCenter is present on.
de: <guilabel>Betriebssystem-Version</guilabel>: Dies ist die Version des Betriebssystems, auf dem das &kinfocenter; läuft.

source: <guilabel>KDE SC Version</guilabel>: This is the version of the KDE Software Collection KInfoCenter was compiled on.
de: <guilabel>Version von KDE SC</guilabel>: Die Version der KDE Software Collection, auf der &kinfocenter; kompiliert wurde.

source: <guilabel>Hostname</guilabel>: This is the hostname of the computer KInfoCenter is present on.
de: <guilabel>Rechnername</guilabel>: Dies ist Name des Rechners, auf dem das &kinfocenter; läuft.

source: <title><acronym>CPU</acronym> Information Box</title>
de: <title>Informationen zum Prozessor (<acronym>CPU</acronym>)</title>

source: Screenshot of <acronym>CPU</acronym> Information box
de: Bildschirmfoto der Informationen zum Prozessor

source: <phrase><acronym>CPU</acronym> Information Box</phrase>
de: <phrase>Informationen zum Prozessor (<acronym>CPU</acronym>)</phrase>

source: The <acronym>CPU</acronym> information box has the following information:
de: Diese Gruppe enthält folgende Informationen:

source: <guilabel>Processor</guilabel>: This is the vendors name for your CPU
de: <guilabel>Prozessor</guilabel>: Das ist der Name des Herstellers Ihrer CPU

source: <guilabel>Processor Number</guilabel>: This is the <acronym>ID</acronym> number of your <acronym>CPU</acronym>, starting from zero.
de: <guilabel>Prozessornummer</guilabel>: Die <acronym>ID</acronym>-Nummer Ihrer <acronym>CPU</acronym>, die Zählung beginnt bei Null.

source: <guilabel>Processor Max Speed</guilabel>: This is the processors maximum speed.
de: <guilabel>Max. Prozessorgeschwindigkeit</guilabel>: Die maximale Geschwindigkeit des Prozessors

source: <title>Hard Drive Information Box</title>
de: <title>Informationen zur Festplatte</title>

source: Screenshot of Hard Drive Information box
de: Bildschirmfoto der Informationen zur Festplatte

source: <phrase>Hard Drive Information Box</phrase>
de: <phrase>Informationen zur Festplatte</phrase>

source: The Hard Drive information box has the following information:
de: Diese Gruppe enthält folgende Informationen:

source: <guilabel>Drive Title</guilabel>: This is the vendors name for the hard drive.
de: <guilabel>Laufwerksbezeichnung</guilabel>; Der Name des Herstellers der Festplatte.

source: <guilabel>Storage Size</guilabel>: This is the current size of your hard drive.
de: <guilabel>Speicherplatz</guilabel>: Die aktuelle Größe des Festplattenlaufwerks.

source: <guilabel>Bus</guilabel>: This is the bus your hard drive uses.
de: <guilabel>Bus</guilabel>: Der von der Festplatte benutzte Bus.

source: Memory Information Module
de: Arbeitsspeicher-Informationen

source: This module displays the current memory usage. It is updated constantly, and can be very useful for pinpointing bottlenecks when certain applications are executed.
de: Dieses Modul zeigt die momentane Speicherauslastung an. Es wird ständig aktualisiert und ist sehr nützlich beim Aufspüren eines <quote>Flaschenhalses</quote>, den eine Anwendung vielleicht verursacht.

source: Memory Types
de: Arbeitsspeichertypen

source: The first thing you must understand, is there are two types of <quote>memory</quote>, available to the operating system and the programs that run within it.
de: Zunächst sollte erwähnt werden, dass das Betriebssystem und die Anwendungsprogramme zwei verschiedene Arten von <quote>Arbeitsspeicher</quote> nutzen können.

source: The first type, is called physical memory. This is the memory located within the memory chips, within your computer. This is the <acronym>RAM</acronym> (for Random Access Memory) you bought when you purchased your computer.
de: Der erste Typ wird als physischer Arbeitsspeicher bezeichnet. Dies ist der Speicher, der sich in den Speicherchips Ihres Rechners befindet. Dies ist das <acronym>RAM</acronym> (Random Access Memory), das Sie mit Ihrem Rechner gekauft haben.

source: The second type of memory, is called virtual or swap memory. This block of memory, is actually space on the hard drive. The operating system reserves a space on the hard drive for <quote>swap space</quote>. The operating system can use this virtual memory (or swap space), if it runs out of physical memory. The reason this is called <quote>swap</quote> memory, is the operating system takes some data that it doesn't think you will want for a while, and saves that to disk in this reserved space. The operating system then loads the new data you need right now. It has <quote>swapped</quote> the not needed data, for the data you need right now. Virtual or swap memory is not as fast as physical memory, so operating systems try to keep data (especially often used data), in the physical memory.
de: Der zweite Typ von Arbeitsspeicher nennt sich virtueller oder Auslagerungsspeicher. Dieser Speicherblock ist in Wirklichkeit Festplattenplatz. Das Betriebssystem reserviert einen Teil der Festplatte zum Auslagern von Speicherbereichen. Es kann diesen Auslagerungsspeicher benutzen, wenn der physikalische Speicher zur Neige geht. Der Grund dafür, dass dieser Speicherblock Auslagerungsspeicher genannt wird, ist folgender: Das Betriebssystem entfernt die Daten, von denen es annimmt, dass der Benutzer sie in absehbarer Zeit nicht braucht, aus dem physikalischen Speicher und schreibt diese Daten auf die Festplatte. Daraufhin lädt das Betriebssystem die neuen Daten, die der Benutzer jetzt gerade braucht. Der Speicherinhalt wird also auf die Festplatte ausgelagert. Virtueller (Auslagerungs-) Speicher ist nicht so schnell wie physikalischer Speicher, daher versuchen Betriebssysteme, oft benötigte Daten stets im physischen Arbeitsspeicher zu belassen.

source: The total memory, is the combined total of physical memory and virtual memory.
de: Der gesamte Arbeitsspeicher ist die Summe aus physischem und virtuellem Arbeitsspeicher.

source: This window is divided into a top and bottom section
de: Das Modulfenster ist in zwei Bereiche geteilt

source: The top section shows you the total physical memory, total free physical memory, shared memory, and buffered memory.
de: Der obere Bereich zeigt Daten über den physikalischen Speicher an (belegter Speicher, gesamter Speicher, Pufferspeicher).

source: All four values are represented as the total number of bytes, and as the number of megabytes (1 megabyte = slightly more than 1,000,000 bytes)
de: Alle Werte werden in Byte und zusätzlich in Megabyte ausgegeben (1 Megabyte = geringfügig mehr als 1,000,000 Bytes)

source: The bottom section shows you three graphs:
de: Der untere Bereich enthält drei Anzeigen:

source: <guilabel>Total Memory</guilabel> (this is the combination of physical and virtual memory).
de: <guilabel>Gesamter Speicher</guilabel> (die Summe aus physischem und virtuellem Arbeitsspeicher).

source: Physical Memory
de: Physischer Arbeitsspeicher

source: Virtual memory, or <guilabel>Swap Space</guilabel>.
de: Virtueller Speicher oder <guilabel>Auslagerungsspeicher</guilabel>.

source: The grey areas are free, and the blue and green areas are used.
de: Dabei stehen blaue und grüne Bereiche für belegten, graue Bereiche für freien Speicher.

source: The exact values of each type of memory are not critical, and they change regularly. When you evaluate this page, look at trends.
de: Die exakten Werte für die Speichertypen sind nicht so entscheidend und wechseln ständig. Wenn Sie die Informationen dieses Moduls auswerten wollen, dann schauen Sie am besten nach Trends.

source: Does your computer have plenty of free space (grey areas)? If not, you can increase the swap size or increase the physical memory.
de: Hat Ihr Rechner genügend freien Speicherplatz (grau)? Wenn nicht, können Sie den Auslagerungsbereich erhöhen oder mehr physikalischen Speicher kaufen.

source: Also, if your computer seems sluggish: is your physical memory full, and does the hard drive always seem to be running? This suggests that you do not have enough physical memory, and your computer is relying on the slower virtual memory for commonly used data. Increasing your physical memory will improve the responsiveness of your computer.
de: Tipp: Ist Ihr Rechner oft langsam und scheint die ganze Zeit auf der Festplatte zu arbeiten? Das lässt vermuten, dass Ihr System zu wenig physischen Arbeitsspeicher hat und der Rechner daher auf den langsameren Auslagerungsspeicher zugreifen muss. In diesem Fall wird mehr physischer Arbeitsspeicher die Geschwindigkeit Ihres Rechners signifikant erhöhen.

source: Device Information Module
de: Geräteinformationen

source: Device Information is a device viewer module. It shows all relevant devices that are present within your <acronym>PC</acronym>. It has three sections, a device viewer, a information panel and a <acronym>UDI</acronym> listing for the currently selected device.
de: Diese Modul zeigt alle in Ihrem PC vorhandenen Geräte an. Es gibt in diesem Modul drei Bereiche, einen Gerätebetrachter, einen Bereich zur anzeige der Informationen und eine Statusleiste.

source: Device Listing
de: Gerätebetrachter

source: The device viewer displays all the current devices detected on your <acronym>PC</acronym> in a tree. The main topics at the beginning of the tree are the device categories, left click on a collapsed category to expand it and vice versa to collapse it. To display information about a device, left click on the device in the viewer, the information will display on the right side information panel. You can right click on the device viewer to show the following options:
de: Hier werden alle aktuell an Ihren <acronym>PC</acronym>angeschlossenen und gefundenen Geräte in einer Baumansicht angezeigt. Als Hauptkategorien werden in dieser Baumansicht die Gerätekategorien dargestellt. Klicken Sie auf das Symbol <emphasis>+</emphasis>, um alle Geräte in einer Kategorie auszuklappen. Um in dieser Baumansicht die Geräte in einer Kategorie auszublenden, klicken Sie auf das Symbol <emphasis>-</emphasis>. Die Informationen zu einem Gerät werden rechts angezeigt, wenn es in der Baumansicht ausgewählt ist. Im Gerätebetrachter können Sie durch Klicken mit der &RMBn; ein Kontextmenü mit folgenden Einträgen öffnen:

source: <guimenuitem>Collapse All</guimenuitem>: Collapses the tree to show only the main categories.
de: <guimenuitem>Alle einklappen</guimenuitem>: Blendet die Untereinträge in der Baumansicht aus und zeigt nur die Hauptkategorien an.

source: <guimenuitem>Expand All</guimenuitem>: Expands the tree to show all the children devices.
de: <guimenuitem>Alle aufklappen</guimenuitem>: Erweitert die Baumansicht und zeigt alle Geräte an.

source: <guimenuitem>Show All Devices</guimenuitem>: Show all the categories no matter if devices are present in those categories
de: <guimenuitem>Alle Geräte anzeigen</guimenuitem>: Alle Gerätekategorien werden angezeigt, auch wenn es in einigen Kategorien keine tatsächlich angeschlossenen Geräte gibt.

source: <guimenuitem>Show Relevant Devices</guimenuitem>: Only show categories that have devices present.
de: <guimenuitem>Wichtige Geräte anzeigen</guimenuitem>: Es werden nur Kategorien mit tatsächlich vorhandenen Geräten angezeigt.

source: The default display is to collapse all while showing only relevant devices. Please note that the devices shown in the device listing are not all devices within your PC, they are just devices that have been detected via the Solid.
de: In der Standardansicht ist der Baum eingeklappt und nur die Hauptkategorien mit tatsächlich angeschlossenen Geräte werden angezeigt. Bitte beachten Sie, dass nicht alle in dieser Liste angezeigten Geräte in Ihrem PC tatsächlich vorhanden sind. In der Anzeige werden alle von Solid entdeckten Geräte aufgeführt.

source: The device viewer can show the following devices:
de: Im Gerätebetrachter können folgende Geräte angezeigt werden:

source: Processors: These are your computers <acronym>CPU</acronym>s ( Central Processing Units ).
de: Prozessoren: Die <acronym>CPU</acronym>s (Central Processing Units) in Ihrem Rechner.

source: Storage Drives: Devices that are used to store your <acronym>PC</acronym>s files and data.
de: Speichergeräte: Alle Geräte auf denen Dateien und Daten des <acronym>PC</acronym>s gespeichert werden.

source: Network Interfaces: Devices that allow you to connect to a network or to another <acronym>PC</acronym>.
de: Netzwerkschnittstellen: Schnittstellen zur Verbindung mit einem Netzwerk oder anderen <acronym>PC</acronym>s.

source: Audio Interfaces: Devices that allow your <acronym>PC</acronym> to play Sound. They are split into 2 categories, <acronym>ALSA</acronym> and <acronym>OSS</acronym> sound architectures.
de: Audiogeräte: Geräte mit denen Ihr <acronym>PC</acronym> Audiodateien wiedergeben kann. Es gibt hier zwei Unterkategorien, <acronym>ALSA</acronym>- und <acronym>OSS</acronym>-Geräte.

source: Video Devices: Devices that allow you to stream live video.
de: Videogeräte: Geräte die einen Live-Videostrom abspielen können

source: Serial Devices: Devices that are connected to your serial port in your PC.
de: Serielle Geräte: Geräte, die über die serielle Schnittstelle mit Ihrem PC verbunden sind.

source: Smart Card Devices: Devices that are smart card readers.
de: Smartcard-Geräte: Kartenlesegeräte für Chipkarten.

source: Digital Video Broadcasting Devices: Devices that use the open standards for digital television.
de: DVB-Geräte: Geräte, die den offenen Standard für digitales Fernsehen benutzen.

source: Device Buttons: These are buttons that are present on your <acronym>PC</acronym> or external devices.
de: Geräteknöpfe: Knöpfe in Ihrem <acronym>PC</acronym> oder in externen Geräten.

source: Batteries: These are battery devices that are plugged into your laptop.
de: Batterien: Batterien, die an Ihrem Laptop angeschlossen sind.

source: <acronym>AC</acronym> Adapters: These devices will be present when you plug in your <acronym>AC</acronym> Adapter.
de: Netzteile: Diese Geräte werden angezeigt, wenn ein Netzteil angeschlossen ist.

source: Multimedia Players: Devices that play media files, like a music player.
de: Medienspieler: Geräte. die Mediendateien abspielen, wie zum Beispiel Abspielprogramme für Musik.

source: Camera Devices: These are digital camera that are connected to your <acronym>PC</acronym>.
de: Kameras: Digitalkameras, die an Ihren <acronym>PC</acronym> angeschlossen sind.

source: Video devices do not include your video card adapter
de: In der Kategorie Videogeräte ist die Grafikkarte des Rechners nicht enthalten.
