Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kde-workspace/kinfocenter.po
Languages: de

source: Information Panel
de: Informationsanzeige

source: The information panel is where device information is shown when you select a device. The first two information topics are always:
de: In diesem Bereich des Fensters werden die Informationen zu gerade ausgewählten Gerät angezeigt. Folgende zwei Einträge sind immer vorhanden:

source: <guilabel>Product</guilabel>: The name of the device.
de: <guilabel>Produkt</guilabel>: Der Name des Geräts.

source: <guilabel>Vendor</guilabel>: The vendors name of the device.
de: <guilabel>Hersteller</guilabel>: Der Hersteller des Geräts.

source: The following information topics are dependent on the device chosen. They are labeled with easy to understand names. The information labels have the ability to be selected and copied from.
de: Die weiteren Einträge hängen von der Art des ausgewählten Gerätes ab. Diese Einträge haben selbsterklärende Beschriftungen. Die angezeigten Informationen können mit der Maus markiert und kopiert werden.

source: Processor <quote>Max Speed</quote> and <quote>Supported Instruction sets</quote> topics are usual not set by solid.
de: Die <quote>Maximalgeschwindigkeit</quote> und <quote>Unterstützte Instruktions-Sätze</quote> Einträge für Prozessoren werden normalerweise nicht über Solid ermittelt.

source: Top categories in the device listing do not show any information.
de: Für die Hauptkategorien in der Geräteliste werden keine Informationen angezeigt.

source: The bottom information panel shows the current selected devices <acronym>UDI</acronym>. This is the unique device identifier. The label has the ability to be selected and copied from.
de: In der Statusleiste wird die <acronym>UDI</acronym> (Unique Device Identifier) des ausgewählten Gerätes angezeigt. Der hier angezeigt Text kann markiert und kopiert werden.

source: Interrupt Request (<abbrev>IRQ</abbrev>) Information Module
de: Informationen zu Interrupts (<abbrev>IRQ</abbrev>)

source: This page displays information about the Interrupt Request Lines in use, and the devices that use them.
de: Diese Seite zeigt Informationen über die Interrupts und die Geräte an, die diese Interrupts verwenden.

source: An <acronym>IRQ</acronym> is a hardware line used in a <acronym>PC</acronym> by (<acronym>ISA</acronym> bus) devices like keyboards, modems, sound cards, &etc;, to send interrupt signals to the processor to tell it that the device is ready to send or accept data. Unfortunately, there are only sixteen <acronym>IRQ</acronym>'s (0-15) available in the i386 (<acronym>PC</acronym>) architecture for sharing among the various <acronym>ISA</acronym> devices.
de: Ein <acronym>IRQ</acronym> ist eine Hardware-Verbindung, die von (<acronym>ISA</acronym>) Geräten wie Tastaturen, Modems, Soundkarten &etc; in einem <acronym>PC</acronym> verwendet werden, um dem Prozessor zu signalisieren, dass das betreffende Gerät bereit ist, Daten zu senden oder zu empfangen. Unglücklicherweise stehen bei der i386 (<acronym>PC</acronym>)-Architektur lediglich sechzehn <acronym>IRQ</acronym>s für die Verwendung durch die vielen <acronym>ISA</acronym>-Geräte zur Verfügung.

source: Many hardware problems are the result of <acronym>IRQ</acronym> conflicts, when two devices try to use the same <acronym>IRQ</acronym>, or software is misconfigured to use a different <acronym>IRQ</acronym> from the one a device is actually configured for.
de: Viele Hardware-Probleme haben Ihre Ursache in falsch konfigurierten <abbrev>IRQ</abbrev>s, wenn zwei Geräte versuchen, den gleichen Interrupt zu verwenden oder eine falsch konfigurierte Software einen anderen <abbrev>IRQ</abbrev> verwendet als das Gerät, mit dem sie zusammenarbeiten soll.

source: The exact information displayed is system-dependent. On some systems, <acronym>IRQ</acronym> information cannot be displayed yet.
de: Die angezeigten Informationen sind systemabhängig. Auf einigen Systemen können <acronym>IRQ</acronym>-Informationen bisher gar nicht angezeigt werden.

source: On &Linux;, this information is read from <filename class="directory">/proc/interrupts</filename>, which is only available if the <filename class="directory">/proc</filename> pseudo-filesystem is compiled into the kernel.
de: Unter &Linux; werden die benötigten Informationen aus <filename class="directory">/proc/interrupts</filename> gewonnen. Diese Datei ist nur verfügbar, wenn das Pseudo-Dateisystem <filename class="directory">/proc</filename> in den Kernel kompiliert worden ist.

source: The first column, is the <acronym>IRQ</acronym> number. The second column, is the number of interrupts that have been received since the last reboot. The third column shows the type of interrupt. The fourth, identifies the device assigned to that interrupt.
de: Die erste Spalte zeigt die Nummer des <abbrev>IRQ</abbrev>'s. Die zweite Spalte zeigt die Anzahl der Interrupts seit dem letzten Boot-Vorgang und die dritte Spalte den Typ des Interrupts. Die vierte Spalte zeigt die Geräte an, die diesem Interrupt zugeordnet sind.

source: The user cannot modify any settings on this page.
de: Der Benutzer kann keine Änderungen der Einstellungen auf dieser Seite vornehmen.

source: <acronym>DMA</acronym> Channel Information Module
de: Informationen über <acronym>DMA</acronym>-Kanäle

source: This page displays information about the <acronym>DMA</acronym> (Direct Memory Access) Channels. A <acronym>DMA</acronym> channel is a direct connection that allows devices to transfer data to and from memory without going through the processor. Typically, i386-architecture systems (<acronym>PC</acronym>'s) have eight <acronym>DMA</acronym> channels (0-7).
de: Diese Seite zeigt Informationen über die <acronym>DMA</acronym>-Kanäle (Direct Memory Access) an. Ein <acronym>DMA</acronym>-Kanal ist eine Direktverbindung, die es einem Gerät erlaubt, Daten direkt zum und vom Speicher zu übertragen, ohne dass die Daten durch den Prozessor laufen. Ein i386-System (<acronym>PC</acronym>) besitzt üblicherweise acht <acronym>DMA</acronym>-Kanäle (0-7).

source: The exact information displayed is system-dependent. On some systems, <acronym>DMA</acronym> Channel information cannot be displayed yet.
de: Die genauen Informationen sind systemabhängig. Auf einigen Systemen können <acronym>DMA</acronym>-Kanalinformationen noch gar nicht dargestellt werden.

source: On &Linux;, this information is read from <filename class="devicefile">/proc/dma</filename>, which is only available if the <filename class="directory">/proc</filename> pseudo-filesystem is compiled into the kernel.
de: Diese Informationen stammen unter &Linux; aus <filename class="devicefile">/proc/dma</filename>. Dieses ist nur dann verfügbar, wenn das Pseudo-Dateisystem <filename class="directory">/proc</filename> in den Kernel kompiliert worden ist.

source: A list of all currently-registered (<acronym>ISA</acronym> bus) <acronym>DMA</acronym> channels that are in use is shown. The first column shows the <acronym>DMA</acronym> channel, and the second column shows the device which uses that channel.
de: Es wird eine Liste aller derzeit registrierten (<acronym>ISA</acronym>-Bus) und in Benutzung befindlichen <acronym>DMA</acronym>-Kanäle angezeigt. In der ersten Spalte wird der <acronym>DMA</acronym>-Kanal und in der zweiten Spalte der Gerätename angezeigt.

source: Unused <acronym>DMA</acronym> channels are not listed.
de: Unbenutzte <acronym>DMA</acronym>-Kanäle werden nicht aufgelistet.

source: IEEE 1394 Device Information Module
de: Informationen zu IEEE-1394-Geräten

source: The IEEE 1394 interface, also known as <trademark>FireWire</trademark>, is a serial bus interface standard for high-speed communications and isochronous real-time data transfer.
de: Das IEEE-1394-Bussystem, auch als <trademark>FireWire</trademark> bekannt, ist ein serieller Schnittstellenstandard mit hohen Übertragungsraten und isochroner Datenübertragung.

source: The list in this module displays all devices attached to IEEE 1394 bus and allows you to reset the bus by clicking the <guibutton>Generate 1394 Bus Reset</guibutton> button.
de: Die Liste in diesem Modul zeigt alle an den IEEE-1394-Bus angeschlossenen Geräte. Durch Klicken auf <guibutton>1394-Bus zurücksetzen</guibutton> können Sie den 1394-Bus neu starten.

source: The meaning of the columns in this list:
de: Die Spalten in dieser Liste bedeuten:

source: <guilabel>Name</guilabel>: port or node name, the number can change with each bus reset
de: <guilabel>Name</guilabel>: Port- oder Node-Name, die Zahl kann sich bei jedem Neustart ändern.

source: <guilabel>GUID</guilabel>: the 64 bit GUID of the node
de: <guilabel>GUID</guilabel>: die 64-Bit-GUID des Node

source: <guilabel>Local</guilabel>: checked if the node is an IEEE 1394 port of your computer
de: <guilabel>Lokal</guilabel>: überprüft, ob es bei dem Node um einen IEEE-1394-Port Ihres Rechners handelt

source: <guilabel>IRM</guilabel>: checked if the node is isochronous resource manager capable
de: <guilabel>IRM</guilabel>: überprüft, ob der Node IRM-fähig ist (Isochronous Resource Manager)

source: <guilabel>CRM</guilabel>: checked if the node is cycle master capable
de: <guilabel>CRM</guilabel>: überprüft, ob der Node Cycle-Master-fähig ist

source: <guilabel>ISO</guilabel>: checked if the node supports isochronous transfers
de: <guilabel>ISO</guilabel>: überprüft, ob der Node isochrone Transfers unterstützt

source: <guilabel>BM</guilabel>: checked if the node is bus manager capable
de: <guilabel>BM</guilabel>: überprüft, ob der Node Bus-Manager-fähig ist

source: <guilabel>PM</guilabel>: checked if the node is power management capable
de: <guilabel>ES</guilabel>: überprüft, ob der Node Energiemanagement-fähig ist

source: <guilabel>Acc</guilabel>: the cycle clock accuracy of the node, valid from 0 to 100
de: <guilabel>Acc</guilabel>: überprüft die Cycle-Clock-Genauigkeit des Node (gültig von 0 bis 100)

source: <guilabel>Speed</guilabel>: the speed of the node
de: <guilabel>Geschwindigkeit</guilabel>: die Schnelligkeit des Node

source: <guilabel>Vendor</guilabel>: the vendor of the device
de: <guilabel>Hersteller</guilabel>: der Hersteller des Geräts

source: <acronym>PCI</acronym>-bus/Installed <acronym>PCI</acronym> Cards Information Module
de: <acronym>PCI</acronym>-Bus / Installierte <acronym>PCI</acronym>-Karten.

source: This page displays information about the <acronym>PCI</acronym>-bus and installed <acronym>PCI</acronym> cards, and other devices that use the Peripheral Component Interconnect (<acronym>PCI</acronym>) bus.
de: Diese Seite zeigt Informationen über den <acronym>PCI</acronym>-Bus, die installierten <acronym>PCI</acronym>-Karten und andere Geräte an, die den Peripheral Component Interconnect (<acronym>PCI</acronym>) Bus verwenden.

source: The exact information displayed is system-dependent. On some systems, <acronym>PCI</acronym>-information can not yet be displayed.
de: Die angezeigten Informationen sind systemabhängig. Auf einigen Systemen können bisher noch gar keine Informationen über das <acronym>PCI</acronym>-System angezeigt werden.

source: On &Linux;, this information is read from <filename class="devicefile">/proc/pci</filename> which is only available if the <filename class="directory">/proc</filename> pseudo-filesystem is compiled into the kernel. A listing of all <acronym>PCI</acronym> devices found during kernel initialization, and their configuration, is shown.
de: Unter &Linux; werden die angezeigten Informationen aus der Datei <filename class="devicefile">/proc/pci</filename> gewonnen. Diese Datei ist nur verfügbar, wenn das Pseudo-Dateisystem <filename class="directory">/proc</filename> in den Kernel kompiliert worden ist. Es wird eine Liste aller während des Boot-Vorgangs erkannten <acronym>PCI</acronym>-Geräte und deren Konfiguration angezeigt.

source: Each entry begins with a bus, device and function number.
de: Jeder Eintrag beginnt mit einer Bus- Geräte- und Funktionsnummer.

source: Input/Output Port Information Module
de: Informationen zu Ein-/Ausgabe-Ports

source: This page displays information about the I/O ports.
de: Diese Seite zeigt Informationen über die Ein-/Ausgabe-Ports (IO-Ports) an.

source: I/O Ports are memory addresses used by the processor for direct communication with a device that has sent an interrupt signal to the processor.
de: Ein-/Ausgabe-Ports werden vom Prozessor zur direkten Kommunikation mit einem Gerät verwendet, das ein Interrupt-Signal an den Prozessor gesendet hat.

source: The exchange of commands or data between the processor and the device takes place through the I/O port address of the device, which is a hexadecimal number. No two devices can share the same I/O port. Many devices use multiple I/O port addresses, which are expressed as a range of hexadecimal numbers.
de: Der Austausch von Befehlen und Daten findet ausschließlich über die Ein/Ausgabe-Portadresse des Gerätes statt. Viele Geräte verwenden eine Vielzahl von Ein-/Ausgabe-Portadressen, die als Bereich hexadezimaler Nummern angegeben werden.

source: The exact information displayed is system-dependent. On some systems, I/O port information can not yet be displayed.
de: Die genauen Informationen sind systemabhängig. Auf einigen Systemen können bisher gar keine Ein-/Ausgabe-Port-Informationen angezeigt werden.

source: On &Linux;, this information is read from <filename class="devicefile">/proc/ioports</filename> which is only available if the <filename class="devicefile">/proc</filename> pseudo-filesystem is compiled into the kernel. A list of all currently-registered I/O port regions that are in use is shown.
de: Unter &Linux; werden die angezeigten Informationen aus der Datei <filename class="devicefile">/proc/ioports</filename> entnommen. Diese Datei ist nur vorhanden, wenn das Pseudo-Dateisystem <filename class="directory">/proc</filename> in den Kernel kompiliert worden ist. Angezeigt wird eine Liste aller augenblicklich von Geräten registrierten Ein-/Ausgabe-Portbereiche.

source: The first column is the I/O port (or the range of I/O ports), the second column identifies the device that uses these I/O ports.
de: Die erste Spalte zeigt den Adressbereich der Ein-/Ausgabe-Ports an. Die zweite Spalte nennt das Gerät, das diesen Bereich verwendet.

source: <acronym>SCSI</acronym> Interface Information Module
de: Informationen zu <acronym>SCSI</acronym>-Geräten

source: This page displays information about Small Computer Systems Interface (<acronym>SCSI</acronym>) Interfaces and the attached <acronym>SCSI</acronym> devices.
de: Diese Seite zeigt Informationen über das <quote>Small Computer Systems Interface</quote> (<abbrev>SCSI</abbrev>-Adapter) und angeschlossene <abbrev>SCSI</abbrev>-Geräte an.

source: The exact information displayed is system-dependent. On some systems <acronym>SCSI</acronym> information cannot be displayed yet.
de: Die angezeigten Informationen hängen von Ihrem System ab. Auf einigen Systemen können die <abbrev>SCSI</abbrev>-Informationen derzeit nicht angezeigt werden.

source: On &Linux;, this information is read from <filename class="devicefile">/proc/scsi/scsi</filename>, which is only available if the <filename class="directory">/proc</filename> pseudo-filesystem is compiled into the kernel. A listing of all <acronym>SCSI</acronym> devices known to the kernel is shown.
de: Unter Linux werden die angezeigten Informationen aus <filename>/proc/scsi/scsi</filename> gelesen. Diese Spezialdatei ist nur vorhanden, wenn das Pseudo-Dateisystem <filename>/proc</filename> im Kernel vorhanden ist. Es wird eine Liste der erkannten <abbrev>SCSI</abbrev>-Geräte angezeigt.

source: The devices are sorted numerically by their host, channel, and <acronym>ID</acronym> numbers.
de: Die Geräte sind numerisch sortiert nach Host-Adapter, Kanal und <acronym>ID</acronym>.

source: <acronym>USB</acronym> Controller/<acronym>USB</acronym> Devices Information Module
de: <acronym>USB</acronym> Adapter / <acronym>USB</acronym>-Geräteinformationen

source: This module allows you to see the devices attached to your <acronym>USB</acronym> bus(es).
de: In diesem Modul kann man die Geräte sehen, die am <acronym>USB</acronym>-Bus angeschlossen sind.

source: This module is for information only, you cannot edit any information you see here.
de: Das Modul dient lediglich der Information. Es können keine Einstellungen geändert werden.

source: Samba Status Information Module
de: Samba-Statusinformation

source: The Samba and <acronym>NFS</acronym> Status Monitor is a front end to the programs <command>smbstatus</command> and <command>showmount</command>. Smbstatus reports on current Samba connections, and is part of the suite of Samba tools, which implements the <acronym>SMB</acronym> (Session Message Block) protocol, also called the NetBIOS or LanManager protocol.
de: Der Samba- und <acronym>NFS</acronym>-Statusanzeiger verwendet zum Erhalt der benötigten Informationen die Programme <command>smbstatus</command> und <command>showmount</command>. Smbstatus zeigt die aktuellen Samba-Verbindungen an und ist Teil der Samba-Programme, die das <acronym>SMB</acronym>-Protokoll (Session Message Block), auch NetBIOS oder LanManager-Protokoll genannte Netzwerkprotokoll unter Unix zur Verfügung stellen.

source: This protocol can be used to provide printer sharing or drive sharing services on a network including machines running the various flavors of &Microsoft; &Windows;.
de: Dieses Protokoll wird zur gemeinsamen Nutzung von Druckern und Laufwerken in Netzwerken verwendet, die eines der &Microsoft; &Windows;-Betriebssysteme benutzen.

source: <command>showmount</command> is part of the <acronym>NFS</acronym> software package. <acronym>NFS</acronym> stands for Network File System and is the traditional &UNIX; way to share folders over the network. In this case the output of <command>showmount</command> <option>-a localhost</option> is parsed. On some systems showmount is in <filename class="directory">/usr/sbin</filename>, check if you have showmount in your <envar>PATH</envar>.
de: Das Programm <command>showmount</command> gehört zum Programmpaket <acronym>NFS</acronym>. <acronym>NFS</acronym> bedeutet <quote>Network File System</quote> und ist das üblicherweise unter &UNIX; verwendete Protokoll zur gemeinsamen Nutzung von Ordnern in einem Netzwerk. Das Modul wertet die Ausgabe des Befehls <command>showmount</command> <option>-a localhost</option> aus. Auf einigen Systemen befindet sich <command>showmount</command> im Ordner <filename class="directory">/usr/sbin</filename>. Stellen Sie sicher, dass sich <command>showmount</command> in Ihrem Pfad (Umgebungsvariable <envar>PATH</envar>) befindet.

source: Exports
de: Exporte

source: On this page you can see a big list which shows the currently active connections to Samba shares and <acronym>NFS</acronym> exports of your machine. The first column shows you whether the resource is a Samba (<acronym>SMB</acronym>) share or a <acronym>NFS</acronym> export. The second column contains the name of the share, the third the name of the remote host, which accesses this share. The remaining columns have only a meaning for Samba-shares.
de: Auf dieser Seite werden die aktuellen Samba-Freigaben und <acronym>NFS</acronym>-Exporte Ihres Rechners angezeigt. In der ersten Spalte wird die Art der Ressource angezeigt: Samba (<acronym>SMB</acronym>) oder <acronym>NFS</acronym>. Die zweite Spalte zeigt den Namen der Freigabe und die dritte den Namen des entfernten Rechners, der diese Freigabe verwendet. Die weiteren Spalten haben nur für Samba-Freigaben eine Bedeutung.

source: The fourth column contains the User <abbrev>ID</abbrev> of the user, who accesses this share. Note that this does not have to be equal to the &UNIX; user <abbrev>ID</abbrev> of this user. The same applies for the next column, which displays the group <abbrev>ID</abbrev> of the user.
de: Von diesen enthält die vierte Spalte die Benutzerkennung <abbrev>UID</abbrev> des Freigabenbenutzers. Diese Nummer, wie auch die folgende Gruppenkennung <abbrev>GID</abbrev> müssen nicht mit den &UNIX;-Kennungen übereinstimmen.

source: Each connection to one of your shares is handled by a single process (<command>smbd</command>), the next column shows the process <abbrev>ID</abbrev> (<acronym>pid</acronym>) of this <command>smbd</command>. If you kill this process the connected user will be disconnected. If the remote user works from &Windows;, as soon as this process is killed a new one will be created, so he will almost not notice it.
de: Jede der Verbindungen ist ein eigener Prozess (<command>smbd</command>), daher wird in der nächsten Spalte die Prozess-<abbrev>ID</abbrev> (<acronym>pid</acronym>) von <command>smbd</command> angezeigt. Wenn Sie einen Prozess beenden, wird die zugehörige Verbindung unterbrochen. Läuft der entfernte Rechner unter &Windows;, wird sofort ein neuer Prozess erstellt, sodass der Benutzer die Unterbrechung kaum bemerkt.

source: The last column shows how many files this user has currently open. Here you see only, how many files he has <emphasis>open</emphasis> just now, you don't see how many he copied or formerly opened &etc;
de: Die letzte Spalte zeigt die Anzahl der geöffneten Dateien. Sie können lediglich die Anzahl der <emphasis>gerade geöffneten</emphasis> Dateien sehen. Sie erfahren hier nicht, wie viele Dateien der Benutzer kopiert oder zuvor geöffnet hatte.

source: Imports
de: Importe

source: Here you see which Samba- and <acronym>NFS</acronym>-shares from other hosts are mounted on your local system. The first column shows whether it is a Samba- or <acronym>NFS</acronym>-share, the second column displays the name of the share, and the third shows where it is mounted.
de: Hier werden die Samba- und <acronym>NFS</acronym>-Freigaben anderer Rechner angezeigt, die Sie in Ihr Dateisystem eingebunden (gemountet) haben. Die erste Spalte zeigt, ob es sich um eine Samba- oder um eine <acronym>NFS</acronym>-Freigabe handelt, die zweite zeigt den Namen der Freigabe und die dritte Spalte die Stelle, an der sie in Ihr Dateisystem eingebunden (gemountet) wurde.

source: The mounted <acronym>NFS</acronym>-shares you should see on &Linux; (this has been tested), and it should also work on &Solaris; (this has not been tested).
de: Die eingebundenen (gemounteten) <acronym>NFS</acronym>-Freigaben sollten unter &Linux; (getestet) und unter &Solaris; (nicht getestet) sichtbar sein.

source: <title>Log</title>
de: <title>Protokoll</title>

source: This page presents the contents of your local samba log file in a nice way. If you open this page, the list will be empty. You have to press the <guibutton>Update</guibutton> button, then the samba log file will be read and the results displayed. Check whether the samba log file on your system is really at the location as specified in the input line. If it is somewhere else or if it has another name, correct it. After changing the file name you have to press <guibutton>Update</guibutton> again.
de: Diese Seite zeigt den Inhalt Ihrer Samba-Protokolldatei an. Wenn Sie die Seite öffnen, ist die Liste zunächst leer. Damit die Protokolldatei von Samba eingelesen und angezeigt wird, müssen Sie den Knopf <guibutton>Aktualisieren</guibutton> anklicken. Wenn Probleme auftreten, vergewissern Sie sich, dass die Protokolldatei sich an der unter <guilabel>Samba-Protokolldatei</guilabel> angegebenen Stelle befindet. Falls die Datei an anderer Stelle gespeichert ist, korrigieren Sie die Angabe und betätigen Sie erneut <guibutton>Aktualisieren</guibutton>.
