Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kde-workspace/kinfocenter.po
Languages: de

source: Samba logs its actions according to the log level (see <filename>smb.conf</filename>). If loglevel = 1, samba logs only when somebody connects to your machine and when this connection is closed again. If log level = 2, it logs also if somebody opens a file and if he closes the file again. If the log level is higher than 2, yet more stuff is logged.
de: Samba protokolliert gemäß dem eingestellten <quote>loglevel</quote> (siehe auch <filename>smb.conf</filename>). Bei einem Wert von 1 werden nur hergestellte und beendete Verbindungen protokolliert, bei einem Wert von 2 wird zusätzlich das Öffnen und Schließen von Dateien protokolliert, ein höherer Wert führt zu noch detaillierteren Informationen.

source: If you are interested in who accesses your machine, and which files are accessed, you should set the log level to 2 and regularly create a new samba log file (&eg; set up a <command>cron</command> task which once a week moves your current samba log file into another folder or something like that). Otherwise your samba log file may become very big.
de: Falls Sie daran interessiert sind, wer sich mit Ihrem Rechner verbindet und auf welche Dateien zugegriffen wird, stellen Sie den Wert 2 ein. Sie sollten dann regelmäßig eine neue Protokolldatei anlegen (installieren Sie &eg; einen <command>cron</command>-Job, der einmal die Woche die aktuelle Protokolldatei in einen anderen Ordner verschiebt oder ähnliches), da diese ansonsten durch die anfallende Datenmenge sehr groß wird.

source: With the four checkboxes below the big list you can decide, which events are displayed in the list. You have to press <guibutton>Update</guibutton> to see the results. If the log level of your samba is too low, you won't see everything.
de: Mit Hilfe der vier Ankreuzfelder können Sie entscheiden, welche der protokollierten Ereignisse angezeigt werden. Nach jeder Änderung müssen Sie den Knopf <guibutton>Aktualisieren</guibutton> betätigen, um das Ergebnis der Änderungen zu sehen. Außerdem muss der <quote>loglevel</quote> hoch genug eingestellt sein, damit die gewünschten Ereignisse überhaupt von Samba protokolliert werden, ansonsten wird nicht alles Gewünschte angezeigt.

source: By clicking on the header of one column you can sort the list by this column.
de: Durch Klicken auf einen Spaltenkopf wird die Liste nach dieser Spalte sortiert.

source: Statistics
de: Statistik

source: On this page you can filter the contents of the third page for certain contents.
de: Auf dieser Seite können Sie Inhalte der dritten Seite gezielt herausfiltern.

source: Let's say the <guilabel>Event</guilabel> field (not the one in the list) is set to <userinput>Connection</userinput>, <guilabel>Service/File</guilabel> is set to <userinput>*</userinput>, <guilabel>Host/User</guilabel> is set to <userinput>*</userinput>, <guilabel>Show expanded service info</guilabel> is disabled and <guilabel>Show expanded host info</guilabel> is disabled.
de: Im Auswahlfeld <guilabel>Ereignis</guilabel> (unten auf der Karteikarte) ist <userinput>Verbindung</userinput>, im Eingabefeld <guilabel>Dienst/Datei</guilabel> ist <userinput>*</userinput> und im Eingabefeld <guilabel>Rechner/Benutzer</guilabel> ist <userinput>*</userinput> eingegeben. Das Ankreuzfeld <guilabel>Erweiterte Dienst-Informationen anzeigen</guilabel> ist nicht markiert, ebenso wenig <guilabel>Erweiterte Rechner-Informationen anzeigen</guilabel> (das ist auch die Standardeinstellung).

source: If you press <guibutton>Update</guibutton> now, you will see how often a connection was opened to share <literal>*</literal> (&ie; to any share) from host <literal>*</literal> (&ie; from any host). Now enable <guilabel>Show expanded host info</guilabel> and press <guibutton>Update</guibutton> again. Now you will see for every host which matches the wildcard <literal>*</literal>, how many connections were opened by him.
de: Betätigen Sie <guibutton>Suchen</guibutton>, um zu sehen, wie oft eine Verbindung zur Freigabe <literal>*</literal> (also jede Freigabe) von Rechner <literal>*</literal> (also beliebigen Rechnern) hergestellt wurde. Markieren Sie nun <guilabel>Erweiterte Rechner-Informationen anzeigen</guilabel> und vergessen Sie nicht, den Knopf <guibutton>Suchen</guibutton> zu betätigen. Nun können Sie sehen, wie viele Verbindungen von jedem Rechner geöffnet wurden.

source: Now press <guibutton>clear</guibutton>.
de: Betätigen Sie nun <guibutton>Ergebnisse löschen</guibutton>.

source: Now set the <guilabel>Event</guilabel> field to File Access and enable <guilabel>Show expanded service info</guilabel> and press <guibutton>Update</guibutton> again.
de: Wählen Sie jetzt aus dem Auswahlfeld <guilabel>Ereignis</guilabel> <guilabel>Dateizugriff</guilabel> aus und markieren Sie <guilabel>Erweiterte Dienst-Informationen anzeigen</guilabel> und betätigen Sie wiederum <guibutton>Suchen</guibutton>.

source: Now you will see how often every single file was accessed. If you enable <guilabel>Show expanded host info</guilabel> too, you will see how often every single user opened each file.
de: Nun können Sie ablesen, wie oft auf jede einzelne Datei zugegriffen wurde. Falls Sie außerdem <guilabel>Erweiterte Rechner-Informationen anzeigen</guilabel> angekreuzt haben, können Sie sehen wie oft jeder einzelne Benutzer jede einzelne Datei geöffnet hat.

source: In the input lines <guilabel>Service/File</guilabel> and <guilabel>Host/User</guilabel> you can use the wildcards <literal>*</literal> and <literal>?</literal> in the same way you use them at the command line. Regular expressions are not recognized.
de: In den Eingabefeldern <guilabel>Dienst/Datei</guilabel> und <guilabel>Rechner/Benutzer</guilabel> können Sie die Jokerzeichen <literal>*</literal> und <literal>?</literal> in der gleichen Art verwenden, wie Sie es von der Befehlszeile gewohnt sind (Reguläre Ausdrücke werden allerdings nicht unterstützt).

source: By clicking on the header of a column you can sort the list by this column. This way you can check out which file was opened most often, or which user opened the most files or whatever.
de: Klicken Sie auf einen Spaltenkopf, um die Liste nach dieser Spalte zu sortieren. So können Sie sich einen Überblick verschaffen, welche Datei am häufigsten geöffnet wurde und welcher Benutzer welche Datei am häufigsten geöffnet hat <abbrev>usw</abbrev>.

source: Section Author
de: Autor des Abschnitts

source: Module copyright 2000: Michael Glauche and &Alexander.Neundorf; &Alexander.Neundorf.mail;
de: Copyright des Moduls 2000: Michael Glauche und &Alexander.Neundorf; &Alexander.Neundorf.mail;

source: Originally written by: Michael Glauche
de: Ursprünglich geschrieben von: Michael Glauche

source: Currently maintained by: &Alexander.Neundorf; &Alexander.Neundorf.mail;
de: Derzeitiger Betreuer: &Alexander.Neundorf; &Alexander.Neundorf.mail;

source: Contributors
de: Mitwirkende

source: Conversion to kcontrol applet:
de: Konvertierung des Moduls für das Kontrollzentrum:

source: Use of <classname>K3Process</classname> instead of popen, and more error checking:
de: Verwendung von <classname>K3Process</classname> anstelle von popen, sowie Fehlerkorrekturen:

source: Conversion to kcmodule, added tab pages 2,3,4, bug fixed:
de: Konvertierung zu <quote>kcmodule</quote> und Hinzufügen der Karteikarten 2,3,4 sowie Fehlerkorrekturen:

source: Documentation copyright 2000 &Alexander.Neundorf; &Alexander.Neundorf.mail;
de: Copyright der Dokumentation 2000 &Alexander.Neundorf; &Alexander.Neundorf.mail;

source: Documentation translated to docbook by &Mike.McBride; &Mike.McBride.mail;
de: Konvertierung der Dokumentation in das Docbook-Format von &Mike.McBride; &Mike.McBride.mail;

source: CREDIT_FOR_TRANSLATORS
de: <para>Übersetzung von:</para><para>Frerich Raabe<email>raabe@kde.org</email> und Thomas Diehl <email>thd@kde.org</email>.</para>

source: Network Interfaces Information Module
de: Informationen zu Netzwerkschnittstellen

source: This page displays information about the network interfaces installed in your computer.
de: Diese Seite zeigt Informationen über die im Rechner installierten Netzwerk-Schnittstellen an.

source: The exact information displayed is system-dependent. On some systems, this information can not yet be displayed.
de: Die angezeigten Informationen sind systemabhängig. Auf einigen Systemen können derzeit gar keine Informationen angezeigt werden.

source: OpenGL Information Module
de: Informationen zu OpenGL

source: This page displays information about installed <acronym>OpenGL</acronym> implementation. OpenGL (for "Open Graphics Library") is a cross-platform, hardware independent interface for 3D graphics.
de: Diese Seite zeigt Informationen über die installierte <acronym>OpenGL</acronym>-Implementierung an. OpenGL (das steht für: <quote>Open Graphics Library</quote>) ist eine plattformübergreifende, hardwareunabhängige Schnittstelle für 3D-Grafik.

source: <acronym>GLX</acronym> is the binding for OpenGL to X Window system.
de: <acronym>GLX</acronym> ist die Verbindungsschicht von OpenGL zum X-Window-System.

source: <acronym>DRI</acronym> (Direct Rendering Infrastucture) provides hardware acceleration for OpenGL. You must have a videocard with 3D accelerator and properly installed driver for this.
de: <acronym>DRI</acronym> (Direct Rendering Infrastructure) stellt Hardwarebeschleunigung für OpenGL zur Verfügung. Sie müssen eine Grafikkarte mit 3D-Beschleunigung und die dazu passenden Treiber installiert haben.

source: Read more at the official OpenGL site <ulink url="http://www.opengl.org">http://www.opengl.org</ulink>
de: Lesen Sie mehr dazu auf der offiziellen OpenGL-Seite <ulink url="http://www.opengl.org">http://www.opengl.org</ulink>.

source: X Server Information Module
de: Informationen zum X-Server

source: This screen is useful for getting specific information about your X server and the current session of X.
de: In diesem Abschnitt erhalten Sie genaue Informationen über Ihren X-Server und Ihre aktuelle Umgebung.

source: When you open this module, you are presented with some information. The left hand side of the window is organized into a tree. Some of the elements have a plus sign in front of the label. Clicking this sign opens a <quote>submenu</quote> related to the label. Clicking on a minus sign in front of a label hides the submenu.
de: Wenn Sie dieses Modul öffnen, erscheinen eine Menge Informationen. Die linke Seite des Moduls ist als Baumansicht organisiert. Vor einigen Elementen befindet sich ein Pluszeichen. Ein Klicken auf dieses Zeichen öffnet diesen Zweig des Baumes und zeigt ein <quote>Untermenü</quote> für diesen Zweig an. Klicken Sie auf das Minuszeichen, um dieses Untermenü wieder auszublenden.

source: The right hand side of the window contains the individual values for each of the parameters on the left.
de: In der rechten Spalte des Fensters werden die Werte der Parameter in der linken Spalte angezeigt.

source: The information presented will vary depending on your setup.
de: Die dargestellten Informationen hängen von der Einrichtung Ihres Rechners ab.

source: Some setups may not be able to determine some or all of the parameters.
de: In einigen Konfigurationen können nicht alle Werte der Parameter ermittelt werden.

source: You can not change any values from this menu. It is for information only.
de: Sie können die angezeigten Werte nicht ändern. Der Abschnitt dient lediglich der Information.

source: Credits and License
de: Danksagungen und Lizenz

source: &infocenter;
de: Das &infocenter;

source: Program copyright 1997-2001 The &infocenter; Developers
de: Copyright für das Programm 1997-2001, die &infocenter;-Entwickler

source: Contributors:
de: Beiträge von:

source: Documentation <trademark class="copyright">copyright 2000 Michael McBride</trademark> &Mike.McBride.mail;
de: Dokumentation <trademark class="copyright">Copyright 2000 Michael McBride</trademark> &Mike.McBride.mail;
