Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kde-workspace/kmenuedit.po
Languages: de

source: Click <menuchoice><guimenu>File</guimenu><guimenuitem>Save</guimenuitem></menuchoice>, wait for the <guilabel>Updating System Configuration</guilabel> dialog to get finished, you should find &firefox; in the application launcher <guisubmenu>Internet</guisubmenu> submenu.
de: Klicken Sie <menuchoice><guimenu>Datei</guimenu><guimenuitem>Speichern</guimenuitem></menuchoice> und warten Sie, bis der Dialog <guilabel>System-Einrichtung wird aktualisiert</guilabel> fertig ist. Jetzt sollte Firefox im Programm-Startmenü im Untermenü <guisubmenu>Internet</guisubmenu> auftauchen.

source: Using &kmenuedit;
de: Benutzung von &kmenuedit;

source: The left application panel shows the application launcher structure. When you browse items in the left panel, the right panel shows detailed information for the highlighted menu item.
de: Das Feld auf der linken Seite der Anwendung gibt die Struktur des Programm-Startmenüs wieder. Wenn Sie einen Eintrag in diesem Feld auswählen, werden im Bereich auf der rechten Seite detaillierte Informationen zum ausgewählten Eintrag angezeigt.

source: General tab
de: Karteikarte <quote>Allgemein</quote>

source: This is the name of your program as it appears in the application launcher menu. It can be different from the real executable name. For instance the name of <command>mc</command> executable is "<application>Midnight Commander</application>".
de: Dies ist der Name des Programms, wie er im Programm-Startmenü angezeigt wird. Er kann sich vom tatsächlichen Namen der ausführbaren Datei unterscheiden. So lautet zum Beispiel der Name der ausführbaren Datei <command>mc</command> im Menü <quote><application>Midnight Commander</application></quote>.

source: Description:
de: Beschreibung:

source: The description will be displayed together with the name in the application launcher. This is entirely optional.
de: Die Beschreibung wird zusammen mit dem Namen im Programm-Startmenü angezeigt. Diese Angabe ist optional.

source: Comment:
de: Kommentar:

source: Describe the program in greater detail in this field. This is entirely optional.
de: In diesem Eingabefeld steht eine detaillierte Programmbeschreibung. Diese Angabe ist optional.

source: Command:
de: Befehl:

source: This is the name of the executable program. Make sure that you have permission to run the program.
de: Dies ist der Name der ausführbaren Datei. Stellen Sie sicher, dass Sie die Berechtigung zum Ausführen dieser Datei besitzen.

source: Enable launch feedback
de: Startrückmeldungen aktivieren

source: If this box is checked, this will display feedback when an application is started.
de: Wenn dieses Feld aktiviert ist, dann wird eine Rückmeldung angezeigt, wenn eine Anwendung gestartet wurde.

source: Place in system tray
de: Im Systemabschnitt der Kontrollleiste anzeigen

source: When checked, the application's icon will show up in the panel system tray. You will then be able to hide or show the application by clicking on the system tray icon. Clicking on it using the &RMB; will allow also you to undock, or quit the application.
de: Wenn dieses Feld aktiviert ist, dann wird das Symbol der Anwendung im Systemabschnitt der Kontrollleiste angezeigt. Dann können Sie die Anwendung durch Klicken auf das Symbol im Systemabschnitt aus- oder einblenden. Durch Klicken auf das Symbol mit der &RMBn; können Sie die Anwendung beenden oder aus dem Systemabschnitt lösen.

source: Only show in &kde;
de: Nur in KDE anzeigen

source: When checked, the application entry will only be visible in all &kde; application launchers but not in other desktops environments.
de: Wenn diese Einstellung aktiviert ist, wird der entsprechende Eintrag nur in KDE-Startmenüs erscheinen, und nicht in denen anderer Arbeitsumgebungen.

source: Hidden entry
de: Versteckte Einträge

source: Remove an entry from the menu view in the application launcher.
de: Entfernt einen Eintrag aus der Menüansicht des Anwendungs-Starters.

source: Advanced tab
de: Karte <quote>Erweitert</quote>

source: Work path:
de: Arbeitsordner:

source: Specify the work path of the program. This will be the current path when the program launches. It does not need to be the same as the executable location.
de: Geben Sie hier den Arbeitsordner des Programms an. Dies wird der aktuelle Ordner sein, wenn das Programm gestartet wird. Der Ordner muss nicht mit dem Ordner übereinstimmen, in dem sich die auszuführende Datei befindet.

source: Run in terminal
de: In Terminal starten

source: You must check this if your program requires terminal emulator in order to run. This mainly applies to <link linkend="gloss-console-application">console applications</link>.
de: Markieren Sie dieses Ankreuzfeld, wenn das Programm nur in einem Terminal ausgeführt werden kann. Dies gilt hauptsächlich für <link linkend="gloss-console-application">Konsole-Anwendungen</link>.

source: Terminal options:
de: Terminal-Einstellungen:

source: Put all terminal options in this field.
de: Tragen Sie alle Terminal-Optionen in dieses Eingabefeld ein.

source: Run as a different user
de: Mit anderer Benutzerkennung ausführen

source: If you want to run this program as a different user (not you), check this checkbox, and provide the username in the <guilabel>Username:</guilabel> field.
de: Falls Sie das Programm unter einer anderen Benutzerkennung ausführen möchten, markieren Sie dieses Ankreuzfeld und geben die Benutzerkennung im Feld <guilabel>Benutzername:</guilabel> an.

source: Current shortcut key:
de: Aktuelles Tastenkürzel:

source: You can assign a special keyboard shortcut to launch your program.
de: Sie können hier ein spezielles Tastaturkürzel angeben, mit dem das Programm ausgeführt werden kann.

source: Click the <guibutton>None</guibutton> button to the right of the <guilabel>Current shortcut key:</guilabel> checkbox.
de: Klicken Sie auf den Knopf <guibutton>Keiner</guibutton> rechts neben <guilabel>Aktuelles Tastenkürzel:</guilabel>.

source: The button text will change to <guilabel>Input...</guilabel> and you can press the key combination on your keyboard that you want to be assigned to your program.
de: Die Knopfbeschriftung zeigt nun <guilabel>Eingabe ...</guilabel> an, und Sie können die gewünschte Tastenkombination drücken, die diesem Programm zugewiesen werden soll.

source: You can reset the shortcut to <guilabel>None</guilabel> by using this button: <inlinemediaobject><imageobject> <imagedata fileref="reset.png" format="PNG"/></imageobject></inlinemediaobject>.
de: Sie können den Kurzbefehl auf <guilabel>Keiner</guilabel> zurücksetzen, indem Sie diesen Knopf drücken: <inlinemediaobject><imageobject> <imagedata fileref="reset.png" format="PNG"/></imageobject></inlinemediaobject>.

source: Don't forget to save your setting by clicking the toolbar <guiicon>Save</guiicon> icon or using the <menuchoice> <guimenu>File</guimenu><guimenuitem>Save</guimenuitem> </menuchoice> menu item.
de: Vergessen Sie nicht, Ihre Änderungen zu speichern, indem Sie in der Werkzeugleiste auf den <guiicon>Speichern</guiicon>-Knopf drücken bzw. im Menü <menuchoice> <guimenu>Datei</guimenu><guimenuitem>Speichern</guimenuitem> </menuchoice> auswählen.

source: Menu Reference
de: Menüreferenz

source: Most actions in the menubar are also available in the context menu opened with a &RMB; click on an item in the tree view.
de: Die meisten Aktionen in der Menüleiste finden Sie auch im Kontextmenü, das Sie durch Klicken mit der &RMBn; auf einem Eintrag in der Baumansicht öffnen.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo></shortcut> <guimenu>File</guimenu> <guimenuitem>New Item...</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo> </shortcut> <guimenu>Datei</guimenu> <guimenuitem>Neues Element ...</guimenuitem>

source: Adds new menu item.
de: Fügt ein neues Element hinzu.

source: <guimenu>File</guimenu> <guimenuitem>New Submenu...</guimenuitem>
de: <guimenu>Datei</guimenu> <guimenuitem>Neues Untermenü ...</guimenuitem>

source: Adds new submenu.
de: Fügt ein neues Untermenü hinzu.

source: <guimenu>File</guimenu><guimenuitem>New Separator</guimenuitem>
de: <guimenu>Datei</guimenu><guimenuitem>Neue Unterteilung</guimenuitem>

source: Adds a new separator to the menu.
de: Fügt einen neuen Trenner hinzu.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>S</keycap></keycombo></shortcut> <guimenu>File</guimenu><guimenuitem>Save</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>S</keycap></keycombo> </shortcut> <guimenu> Datei</guimenu> <guimenuitem>Speichern</guimenuitem>

source: Saves the menu
de: Speichert das Menü

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Quit</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo> </shortcut> <guimenu> Datei</guimenu> <guimenuitem>Beenden</guimenuitem>

source: <action>Quits</action> &kmenuedit;.
de: <action>Beendet</action> &kmenuedit;.

source: <guimenu>Edit</guimenu> <guimenuitem>Move Up</guimenuitem>
de: <guimenu>Bearbeiten</guimenu> <guimenuitem>Nach oben</guimenuitem>

source: <action>Moves</action> the selected item up in its submenu.
de: <action>Verschiebt</action> den ausgewählten Eintrag im Untermenü nach oben.

source: <guimenu>Edit</guimenu> <guimenuitem>Move Down</guimenuitem>
de: <guimenu>Bearbeiten</guimenu> <guimenuitem>Nach unten</guimenuitem>

source: <action>Moves</action> the selected item down in its submenu.
de: <action>Verschiebt</action> den ausgewählten Eintrag im Untermenü nach unten.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>X</keycap></keycombo> </shortcut> <guimenu> Edit</guimenu> <guimenuitem>Cut</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>X</keycap></keycombo> </shortcut> <guimenu> Bearbeiten</guimenu> <guimenuitem>Ausschneiden</guimenuitem>

source: <action>Cuts the current menu item to the clipboard.</action> If you want to move menu item, you should first cut it to the clipboard, move to the destination place using the left panel, and use the <guimenuitem>Paste</guimenuitem> function to paste the menu item from the clipboard.
de: <action>Schneidet das aktuelle Element aus und fügt es in die Zwischenablage ein.</action> Falls Sie einen Menü-Eintrag verschieben möchten, sollten Sie diesen zuerst ausschneiden. Gehen Sie dann im linken Bereich zum gewünschten Zielort und fügen Sie dort das Menü-Element mit <guimenuitem>Einfügen</guimenuitem> wieder aus der Zwischenablage ein.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>C</keycap></keycombo> </shortcut> <guimenu> Edit</guimenu> <guimenuitem>Copy</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>C</keycap></keycombo> </shortcut> <guimenu> Bearbeiten</guimenu> <guimenuitem>Kopieren</guimenuitem>

source: <action>Copies the current menu item to the clipboard</action>. You can later use the <guimenuitem>Paste</guimenuitem> function to paste the copied menu item from the clipboard to its destination. You can paste the same item many times.
de: <action>Kopiert das aktuelle Element in die Zwischenablage.</action> Sie können das kopierte Element später mit Hilfe von <guimenuitem>Einfügen</guimenuitem> wieder an einem neuen Zielort einfügen. Dasselbe Element lässt sich so mehrfach einfügen.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>V</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Paste</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>V</keycap></keycombo> </shortcut> <guimenu> Bearbeiten</guimenu> <guimenuitem>Einfügen</guimenuitem>

source: <action>Paste menu item from the clipboard</action> to currently selected place in the main menu. You must first use <guimenuitem>Cut</guimenuitem> or <guimenuitem>Copy</guimenuitem> before you can <guimenuitem>Paste</guimenuitem>.
de: <action>Ein Element aus der Zwischenablage einfügen</action> und es am aktuell gewählten Zielort im Hauptmenü speichern. Wählen Sie zuerst <guimenuitem>Ausschneiden</guimenuitem> oder <guimenuitem>Kopieren</guimenuitem>, bevor Sie <guimenuitem>Einfügen</guimenuitem> auswählen können.

source: <shortcut><keycap>Del</keycap></shortcut> <guimenu>Edit</guimenu> <guimenuitem>Delete</guimenuitem>
de: <shortcut><keycap>Entf</keycap></shortcut> <guimenu>Bearbeiten</guimenu> <guimenuitem>Entfernen</guimenuitem>

source: Deletes currently selected menu item.
de: Löscht das gerade ausgewählte Element.

source: <guimenu>Edit</guimenu> <guisubmenu>Sort</guisubmenu>
de: <guimenu>Bearbeiten</guimenu> <guimenuitem>Sortieren</guimenuitem>

source: <action>Opens</action> submenu to sort selected submenu or all menu tree. There are two sorting methods implemented, namely, by the name and by the description.
de: <action>Öffnet</action> ein Untermenü, um das ausgewählte Untermenü oder alle Menüeinträge zu sortieren. Es sind zwei Methoden zur Sortierung implementiert, entweder nach Namen oder nach der Beschreibung.

source: <guimenu>Edit</guimenu> <guimenuitem>Restore to System Menu</guimenuitem>
de: <guimenu>Bearbeiten</guimenu> <guimenuitem>Systemvoreinstellungen wiederherstellen</guimenuitem>

source: This will restore the application launcher as it was as default and remove all your custom settings. A message box will ask you if you really want to do that.
de: Hierdurch werden die Einstellungen der Startmenüs wieder auf die Systemeinstellungen zurückgesetzt und alle Ihre persönlichen Änderungen werden verworfen. Zur Sicherheit werden Sie noch einmal gefragt, ob Sie dies wirklich möchten.

source: &kmenuedit; has the common &kde; <guimenu>Settings</guimenu> and <guimenu>Help</guimenu> menu items, for more information read the sections about the <ulink url="help:/fundamentals/ui.html#menus-settings">Settings Menu</ulink> and <ulink url="help:/fundamentals/ui.html#menus-help">Help Menu</ulink> of the &kde; Fundamentals.
de: &kmenuedit; benutzt die bekannten &kde;-Menüeinträge <guimenu>Einstellungen</guimenu> und <guimenu>Hilfe</guimenu>. Mehr dazu erfahren Sie in den Abschnitten zu den Menüs <ulink url="help:/fundamentals/ui.html#menus-settings">Einstellungen</ulink> und <ulink url="help:/fundamentals/ui.html#menus-help">Hilfe</ulink> in den &kde;-Grundlagen.

source: Credits and License
de: Danksagungen und Lizenz

source: Program copyright &copy; 2002, &Raffaele.Sandrini;
de: Copyright &copy; des Programms 2002 &Raffaele.Sandrini;

source: Contributors:
de: Mitwirkende:

source: &Matthias.Elter; &Matthias.Elter.mail; - Original Author
de: &Matthias.Elter;&Matthias.Elter.mail; - Ursprünglicher Autor

source: Documentation copyright &copy; 2000 &Milos.Prudek;
de: Dokumentation Copyright &copy; 2000 &Milos.Prudek;

source: Documentation copyright &copy; 2008 &Anne-Marie.Mahfouf;
de: Dokumentation Copyright &copy; 2008 &Anne-Marie.Mahfouf;

source: Updated for &kde; 3.0 by &Lauri.Watts; &Lauri.Watts.mail; 2002
de: Aktualisiert für &kde; 3.0 von &Lauri.Watts;&Lauri.Watts.mail;, 2002

source: CREDIT_FOR_TRANSLATORS
de: <para>Übersetzung ins Deutsche von: <itemizedlist><listitem><para>Matthias Schulz<email>matthschulz@linuxfreemail.com</email></para></listitem> <listitem><para>Marco Wegner<email>mail@marcowegner.de</email></para></listitem></itemizedlist></para>

source: Glossary
de: Glossar

source: Console Application
de: Konsole-Anwendungen

source: Application originally written for non-graphic, text oriented environment. Such applications run fine in &kde;. They must run within console emulator, like &konsole;. They are not warned automatically when you shut down your &kde; session. You therefore must not forget to save documents open in these applications before you log out from the &kde;.
de: Anwendungen, die ursprünglich für eine nicht-grafische, textorientierte Umgebung geschrieben wurden. Solche Anwendungen laufen problemlos unter &kde;. Sie müssen jedoch in einem Terminal-Emulator wie &konsole; laufen. Sie werden nicht automatisch benachrichtigt, wenn die aktuelle &kde;-Sitzung heruntergefahren wird. Sie sollten daher nicht vergessen, offene Dokumente in diesen Anwendungen zu speichern, bevor Sie sich von &kde; abmelden.

source: Console applications support copying and pasting from &kde;-compliant applications.Simply mark the text in the console application with your mouse, switch to the &kde;-compliant application and press <keycombo action="simul">&Ctrl; <keycap>V</keycap></keycombo> to paste the text. If you want to copy from &kde; application to a console application, first mark the text with your mouse, press <keycombo action="simul">&Ctrl; <keycap>C</keycap></keycombo>, switch to the console application and press the middle button on your mouse<footnote><para>If your mouse does not have a middle button, you must press <mousebutton>left</mousebutton> and <mousebutton>right</mousebutton> button at the same time. This is called <quote>middle button emulation</quote> and it must be supported by your operating system to work.</para></footnote>.
de: Konsole-Anwendungen unterstützen das Kopieren und Einfügen von &kde;-Anwendungen aus. Markieren Sie diesen Text in der Terminal-Anwendung einfach mit der Maus, wechseln Sie dann in die &kde;-Anwendung und drücken <keycombo action="simul">&Ctrl; <keycap>V</keycap></keycombo>, um den Text einzufügen. Falls Sie Text aus einer &kde;-Anwendung in eine Terminal-Anwendung einfügen möchten, markieren Sie diesen Text zuerst mit Ihrer Maus, drücken danach <keycombo action="simul">&Ctrl; <keycap>C</keycap></keycombo> und wechseln in die gewünschte Terminal-Anwendung, wo Sie dann die mittlere Maustaste drücken<footnote><para>Wenn Ihre Maus keine mittlere Maustaste besitzt, müssen Sie die <mousebutton>linke</mousebutton> und <mousebutton>rechte</mousebutton> Maustaste gleichzeitig drücken. Dies wird <quote>Emulation der mittleren Maustaste</quote> genannt und muss von Ihrem Betriebssystem unterstützt werden, um korrekt arbeiten zu können.</para></footnote>
