Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kde-workspace/kmenuedit.po
Languages: de

source: The &kde; Menu Editor Handbook
de: Das Handbuch zum &kde;-Menü-Editor

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Marco</firstname><surname>Wegner</surname><affiliation><address><email>mail@marcowegner.de</email></address></affiliation><contrib>Deutsche Übersetzung</contrib></othercredit>

source: &kmenuedit; allows editing one of the &kde; application launchers: &kickoff;, the classic &kmenu; or Lancelot Launcher.
de: Mit &kmenuedit; können Sie die Startmenüs von KDE einrichten: &kickoff;, das klassische K-Menü und den Lancelot-Starter

source: KDE Menu Editor
de: KDE-Menü-Editor

source: application
de: Anwendung

source: program
de: Programm

source: menu
de: Menü

source: Introduction
de: Einleitung

source: &kmenuedit; allows editing the menu of &kde; application launchers: &kickoff;, classic &kmenu; or Lancelot Launcher.
de: Mit &kmenuedit; können Sie verschiedene Startmenüs von KDE einrichten: &kickoff;, das klassische K-Menü und den Lancelot-Starter

source: &kmenuedit; can be started either by &RMB; clicking the application launcher button on the panel and choosing <guimenuitem>Edit Applications...</guimenuitem>, or by typing <userinput>kmenuedit</userinput> in the &krunner; line.
de: &kmenuedit; kann entweder durch Klicken mit der &RMBn; auf den K-Knopf und Auswahl von <guimenuitem>Menüeinträge bearbeiten ...</guimenuitem>. Außerdem können Sie in &krunner; den Befehl <userinput>kmenuedit</userinput> eingeben, um den Menü-Editor zu starten.

source: &kmenuedit; allows you to:
de: &kmenuedit; ermöglicht das:

source: View and edit the menu used by the current application launcher (&kickoff;, classic menu or Lancelot Launcher)
de: Anzeigen und Bearbeiten des aktuellen Startmenüs (&kickoff;, das klassische Startmenü, oder Lancelot)

source: <guimenuitem>Cut</guimenuitem>, <guimenuitem>Copy</guimenuitem> and <guimenuitem>Paste</guimenuitem> submenus and items
de: <guimenuitem>Ausschneiden</guimenuitem>, <guimenuitem>Kopieren</guimenuitem> und <guimenuitem>Einfügen</guimenuitem> von Menüeinträgen und Einträgen

source: Create and delete submenus and items
de: Anlegen und Löschen von Untermenüs und Einträgen

source: Change the order of submenus and items
de: Ändern der Reihenfolge von Untermenüs und Einträgen

source: Hide items and add new submenus and items
de: Ausblenden von Einträgen und Hinzufügen neuer Untermenüs und neuer Einträge

source: By default all applications installed on the computer appear in the application launchers menu of all users. Applications may appear more than once in several different menus. Empty submenu categories defined in the desktop menu specification will show up as well, but are not visible in application launchers unless you install applications belonging to these categories.
de: Als Standard erscheinen alle auf dem Rechner installierten Anwendungen im Menü des Anwendungs-Starters aller Benutzer. Anwendungen können auch mehrfach in verschiedenen Untermenüs angezeigt werden. Untermenü-Kategorien ohne Einträge, die in der Arbeitsflächen-Menüspezifikation definiert sind, werden ebenfalls angezeigt, werden aber im Anwendungs-Starter aber nicht angezeigt, wenn Sie keine Anwendungen in dieser Kategorie installiert haben.

source: The tree view has three different entry types:
de: In der Baumansicht gibt es drei Arten von Einträgen:

source: Submenu: Only <guilabel>Name</guilabel>, <guilabel>Comment</guilabel> and <guilabel>Description</guilabel> fields and the button to select an icon are enabled, the <guilabel>Advanced</guilabel> tab is disabled. Any submenu can hold additional submenus and/or items.
de: Untermenü: Nur die Felder <guilabel>Name</guilabel>, <guilabel>Kommentar</guilabel> und <guilabel>Beschreibung</guilabel> sowie der Knopf zur Auswahl eines Symbols sind aktiviert. Die Karteikarte <guilabel>Erweitert</guilabel>ist deaktiviert. Jedes Untermenü kann weitere Untermenüs und/oder Einträge enthalten.

source: Items: Use this entry to enter the data for the application you want to add. For detailed information see <link linkend="using-kmenuedit">Using &kmenuedit;</link>.
de: Elemente: Benutzen Sie diesen Eintrag, um Daten für die Anwendung einzugeben, die Sie zum Menü hinzufügen möchten. Weitere Informationen finden Sie im Abschnitt <link linkend="using-kmenuedit">Benutzung von &kmenuedit;</link>.

source: Separator: A visual entry to structure the menu. It cannot be modified and all editing actions are disabled.
de: Unterteilung: Ein visuelles Element, um das Menü zu strukturieren. Dieses Element kann nicht geändert werden und alle Bearbeitungsaktionen sind abgeschaltet.

source: &kmenuedit; has two tree view modes - normal and with hidden entries. To see the latter check the option <guilabel>Show hidden entries</guilabel> in the configuration dialog on the <guilabel>General options</guilabel> page.
de: &kmenuedit; hat zwei Ansichtsmodi - normal und mit versteckten Einträgen. Um die versteckten Einträge anzuzeigen, wählen Sie diese Einstellung im Einrichtungsdialog auf der Seite <guilabel>Allgemein</guilabel>.

source: Many additional entries appear in hidden view mode in the tree. Several hidden entries seem to be just duplicates but have different command options. Usually you should never change these hidden entries or you risk to break some functionality of the system.
de: Viele zusätzliche Einträge erscheinen in Ansichtsmodus mit versteckten Einträgen. Viele versteckte Einträge scheinen nur Duplikate von Einträgen zu sein, aber Sie haben unterschiedliche Befehls-Einstellungen. Normalerweise sollten Sie diese versteckten Einträge niemals ändern, oder Sie können einige Funktionen Ihres Systems unbenutzbar machen.

source: In hidden mode you will have a special submenu <guilabel>.hidden [Hidden]</guilabel> as top level item in the tree. This special submenu is not editable. In this submenu all deleted items will be shown at the next start of &kmenuedit;.
de: Im Modus mit versteckten Einträgen gibt es ein besonderes Untermenü <guilabel>.hidden [Ausgeblendet]</guilabel> als oberstes Element in der Baumansicht. Diese besondere Untermenü kann nicht bearbeitet werden. In diesem Untermenü werden alle gelöschte Einträge beim nächsten Start von &kmenuedit; wieder erscheinen.

source: It is not possible to delete entries using the &GUI; in this special submenu. They will reappear at the next start of &kmenuedit;.
de: Es ist nicht möglich, Einträge in diesem besonderen Untermenü über die grafische Bedienungsoberfläche zu löschen. Gelöschte Einträge erscheinen beim nächsten Start von &GUI; automatisch wieder.

source: Use Cases
de: Anwendungsfälle

source: Adapt the Menu for a User
de: Anpassung des Menüs für einen Benutzer

source: Reorder Items
de: Einträge neu anordnen

source: This should be done in hidden view mode where only the submenus and items visible in the application launcher menu are displayed.
de: Dies sollten Sie im Anzeigemodus mit versteckten Einträgen ausführen, da dann nur im Anwendungsstarter sichtbare Untermenüs und Einträge angezeigt werden.

source: By default the menu is sorted alphabetically using the English names or descriptions. Using another language than English some submenus and items therefore will appear in an unsorted order.
de: Als Voreinstellung ist das Menü alphabetisch nach den englischen Namen oder Beschreibungen sortiert. In anderen Sprachen als Englisch werden daher manche Untermenüs und Einträge in unsortierter Reihenfolge angezeigt.

source: Use the options in <menuchoice><guimenu>Edit</guimenu><guimenuitem>Sort</guimenuitem></menuchoice> to sort either by name or description. If you use the classic application launcher you have to select the corresponding <guilabel>Format</guilabel> option in the settings dialog. In the &kickoff; launcher check <guilabel>Show applications by name</guilabel> if you sort them by name here.
de: Mit den Aktionen <menuchoice><guimenu>Bearbeiten</guimenu><guimenuitem>Sortieren</guimenuitem></menuchoice> können entweder nach Namen oder Beschreibung sortieren. Verwenden Sie den klassischen Anwendungsstarter, müssen Sie das zugehörige <guilabel>Format</guilabel> im Einrichtungsdialog einstellen. Beim &kickoff;-Anwendungsstarter kreuzen Sie <guilabel>Anwendungen nach Namen sortieren</guilabel>, wenn Sie hier eine Sortierung nach Namen einstellen.

source: Grouping your frequently used submenus or items together &eg; at the top of the menu makes selecting them easier. To change the order of particular items or submenus in the tree use the <guibutton>Move Up</guibutton> or <guibutton>Move Down</guibutton> button in the toolbar or these actions in the menu.
de: Wenn Sie Ihre häufig verwendeten Untermenüs oder Einträge &eg; oben im Menü gruppieren, sind diese Elemente leichter zu erreichen. Um die Reihenfolge bestimmter Einträge oder Untermenüs im Menübaum zu ändern, benutzen Sie die Knöpfe <guibutton>Nach oben</guibutton> oder <guibutton>Nach unten</guibutton> in der Werkzeugleiste oder diese Aktionen im Menü.

source: All application launchers will use the order of submenus defined in &kmenuedit;.
de: Alle Programmstarter benutzen die in &kmenuedit; festgelegt Reihenfolge der Untermenüs.

source: Remove Items from the Menu View
de: Einträge aus der Menüansicht entfernen

source: Having shown all applications installed on a computer may be confusing for some users so you may want to hide some less frequently used items or submenus. There are two different ways to do that:
de: Die Anzeige aller auf einem Rechner installierten Programme kann für einige Benutzer verwirrend sein, daher möchten Sie vielleicht einige weniger häufig benutzte Untermenüs oder Einträge ausblenden. Es gibt zwei Möglichkeiten, dies zu erreichen.

source: Switch to normal view mode without hidden entries. If you delete items they are moved to the <guilabel>.hidden [Hidden]</guilabel> submenu. You can move them back into the tree to have them in the menu again.
de: Wechseln Sie zum normalen Ansichtsmodus ohne die Anzeige versteckter Einträge. Wenn Sie nun Einträge löschen, werden sie in das Untermenü <guilabel>.hidden [Ausgeblendet]</guilabel> verschoben. Sie können diese Einträge wieder zurück in den Menübaum verschieben, damit sie wieder angezeigt werden.

source: If you delete a submenu it will be really deleted with all its submenus and items. To recreate them you can use <menuchoice><guimenu>Edit</guimenu><guimenuitem>Restore to System Menu</guimenuitem></menuchoice>, but this will remove all your custom submenus and items and the corresponding <filename class="extension">.desktop</filename> files are deleted too. This action cannot be reverted.
de: Wenn Sie ein Untermenü entfernen, wird es tatsächlich mit allen Untermenüs und Einträgen gelöscht. Um gelöschte Systemeinträge wiederherzustellen, verwenden Sie <menuchoice><guimenu>Bearbeiten</guimenu><guimenuitem>Systemvoreinstellungen wiederherstellen</guimenuitem></menuchoice>. Aber damit werden alle Ihre selbst erstellten Untermenüs und Einträge entfernt und die zugehörigen <filename class="extension">.desktop</filename>-Dateien werden ebenfalls gelöscht. Diese Aktion kann nicht zurückgenommen werden.

source: The preferred way to remove submenus and items in the menu of an application launcher is to check <guilabel>Hidden entry</guilabel> on the <guilabel>General</guilabel> tab and switch to the hidden view mode. In this mode it is easy to revert changes without destroying the menu structure. The only drawback is that you have to hide all entries in a submenu manually to hide the whole submenu from the view.
de: Um Untermenüs und Einträge im Menü eines Anwendungsstarters zu löschen, wird empfohlen, im Einrichtungsdialog <guilabel>Versteckte Einträge anzeigen</guilabel> auf der Seite <guilabel>Allgemein</guilabel> anzukreuzen und damit den Ansichtsmodus mit versteckten Einträgen einzuschalten. In diesem Modus ist es möglich, Änderungen zurückzunehmen, ohne die Menüstruktur zu zerstören. Der einzige Nachteil ist, dass Sie alle Einträge in einem Untermenü von Hand ausblenden müssen, um das gesamte Untermenü aus der Ansicht zu entfernen.

source: Adding Custom Items
de: Benutzerdefinierte Einträge hinzufügen

source: To add custom items (submenu, item or separator) use the actions in the menu or toolbar. Items need a Name and a Command, without a command entry an item will not be saved and your addition gets lost.
de: Um benutzerdefinierte Einträge (Untermenü, Einträge, oder Unterteilung) hinzuzufügen, verwenden Sie die Aktionen im Menü oder der Werkzeugleiste. Für Einträge müssen Sie einen Namen und einen Befehl eingeben, ohne einen Eintrag für den Befehl wird der Eintrag nicht gespeichert und Ihre Änderungen gehen verloren.

source: If you add an entry it is inserted as sub entry at the actual highlighted position in the tree. Move an entry by dragging it with the mouse or using the <guibutton>Move Down</guibutton> button to the bottom of the tree to make it a top level entry.
de: Wenn Sie einen Eintrag hinzufügen, wird er als Unterelement der aktuell hervorgehobenen Position im Menübaum eingefügt. Verschieben Sie einen Eintrag durch Ziehen mit der Maus oder mit den Knöpfen <guibutton>Nach unten</guibutton> bis zum Ende des Menübaums, um ein Element der obersten Ebene zu erstellen.

source: Transfer application launcher settings
de: Einstellungen des Anwendungs-Starters übertragen

source: There is no way to transfer menu settings using the &GUI;, you have to do that manually and copy the following files to the target user:
de: Es gibt keine Möglichkeit, Menüeinstellungen mit der grafischen Benutzeroberfläche auf andere Benutzer zu übertragen. Dies kann nur manuell durch Kopieren der folgenden Dateien zum Ziel-Benutzer erfolgen:

source: &kmenuedit; stores the menu hierarchy in <filename>$<envar>HOME</envar>/.config/menus/applications-kmenuedit.menu</filename> and <filename class="directory">$<envar>HOME</envar>/.local/share/desktop-directories</filename> contains desktop files for submenus you created. In <filename class="directory">$<envar>HOME</envar>/.local/share/applications/</filename> you find the desktop files for the custom items you created.
de: &kmenuedit; speichert die Menü-Hierarchie in <filename>$<envar>HOME</envar>/.config/menus/applications-kmenuedit.menu</filename>. Der Ordner <filename class="directory">$<envar>HOME</envar>/.local/share/desktop-directories</filename> enthält die „desktop“-Dateien der von Ihnen erstellten Untermenüs. Im Ordner <filename class="directory">$<envar>HOME</envar>/.local/share/applications/</filename> finden Sie die „desktop“-Dateien der von Ihnen erstellten Menüeinträge.

source: The shortcuts for each application are stored in <filename>~/.kde/share/config/kglobalshortcutsrc</filename>, but export/import does not work because the UUIDs of the shortcuts do not match up between systems, even though the <filename class="extension">.desktop</filename> files are the same. You have to assign all shortcuts manually again.
de: Die Kurzbefehle für jede Anwendung werden in der Datei <filename>~/.kde/share/config/kglobalshortcutsrc</filename>, aber importieren oder exportieren funktioniert nicht, da die UUIDs der Kurzbefehle auf den verschiedenen Systemen oder Benutzerkonten nicht übereinstimmen, auch wenn die <filename class="extension">.desktop</filename>-Dateien identisch sind. Sie müssen also alle Kurzbefehle wieder manuell zuweisen.

source: Adding a Menu Entry
de: Menüeintrag hinzufügen

source: In this example, we will add &firefox; to the <guisubmenu>Internet</guisubmenu> submenu.
de: In diesem Beispiel werden wir &firefox; zum Menü <guisubmenu>Internet</guisubmenu> hinzufügen.

source: To start off, we need to open &kmenuedit;, so &RMB; on the application launcher menu, click <guimenuitem>Edit Applications...</guimenuitem> to start &kmenuedit;. After &kmenuedit; has started, select <guisubmenu>Internet</guisubmenu> as shown in picture below.
de: Zu Beginn müssen wir &kmenuedit; starten: Klicken Sie dazu mit der &RMBn; auf das Programm-Startmenü und wählen Sie <guimenuitem>Menüeinträge bearbeiten ...</guimenuitem>. Nachdem &kmenuedit; gestartet ist, wählen Sie wie im Bildschirmfoto unten <guisubmenu>Internet</guisubmenu>.

source: <screeninfo>Select <guisubmenu>Internet</guisubmenu></screeninfo>
de: <screeninfo>Wählen Sie<guisubmenu>Internet</guisubmenu></screeninfo>

source: <phrase>Select <guisubmenu>Internet</guisubmenu></phrase>
de: <phrase>Wählen Sie <guisubmenu>Internet</guisubmenu></phrase>

source: Once you have selected <guisubmenu>Internet</guisubmenu>, click on <menuchoice><guimenu>File</guimenu><guimenuitem>New Item...</guimenuitem></menuchoice>, opening the <guilabel>New Item</guilabel> dialog, as shown below. Type the name of the program you want to add, in this case, type <userinput>firefox</userinput>.
de: Wenn Sie <guisubmenu>Internet</guisubmenu> ausgewählt haben, klicken Sie auf <menuchoice><guimenu>Datei</guimenu><guimenuitem>Neues Element ...</guimenuitem></menuchoice> und öffnen damit den unten gezeigten Dialog <guilabel>Neues Element</guilabel>. Geben Sie nun den Namen des Programms ein, das Sie hinzufügen möchten. In diesem Fall ist das <userinput>Firefox</userinput>.

source: <guilabel>New Item</guilabel> dialog
de: Dialog <guilabel>Neues Element</guilabel>

source: The <guilabel>New Item</guilabel> dialog.
de: Der Dialog <guilabel>Neues Element</guilabel>.

source: Press return, and you should see something like the picture below in the main window.
de: Drücken Sie die Eingabetaste, und Sie sollten einen ähnlichen Bildschirm wie abgebildet sehen.

source: New Item
de: Neues Element

source: The new item created.
de: Das neu angelegte Element.

source: Now lets fill in the <guilabel>Description:</guilabel>, in this case type <userinput>Web Browser</userinput>. <note><para>The appearance how description and name will be displayed depends on the settings in the application launcher &eg; <quote>Web Browser (Firefox)</quote> or <quote>Firefox (Web Browser)</quote>.</para></note> We will need to fill in the executable name in the <guilabel>Command:</guilabel> field, in this instance we will type <userinput><command>firefox</command></userinput>.
de: Lassen Sie uns jetzt <guilabel>Beschreibung:</guilabel> ausfüllen; in diesem Fall geben Sie <userinput>Webbrowser</userinput> ein. <note><para>Die Art Anzeige von Beschreibung und Namen wird durch die Einstellungen im Anwendungs-Starter festgelegt. &eg; als <quote>Webbrowser (Firefox)</quote> oder <quote>Firefox (Webbrowser)</quote>.</para></note> Im Textfeld <guilabel>Befehl</guilabel> müssen Sie nun den Namen der ausführbaren Datei angeben. In diesem Fall ist das <userinput><command>firefox</command></userinput>.

source: The command has to be in your <envar>PATH</envar> variable or you have to specify the full path to the executable. If you do not know the executable name of an application use the <userinput><command>locate</command></userinput> command to search for the desktop file and enter the string from the Exec line as command here.
de: Dieser Befehl muss in Ihrer Variable <envar>PATH</envar> zu erreichen sein, oder Sie müssen den vollständigen Pfad zur ausführbaren Datei angeben. Wenn Sie den Namen der ausführbaren Datei nicht kennen, benutzen Sie den Befehl <userinput><command>locate</command></userinput>, um die Desktop-Datei für die Anwendung zu suchen und geben Sie den Eintrag in der Zeile „Exec“ als Befehl hier ein.

source: Following the command, you can have several place holders which will be replaced with actual values when the program is run:
de: Nach dem Befehl können weitere Platzhalter folgen, die durch ihre eigentlichen Werte ersetzt werden, sobald das Programm aufgerufen wird:

source: %f - a single file name
de: %f - ein Dateiname

source: %F - a list of files; use for applications that can open several local files at once
de: %F - eine Liste von Dateien. Benutzen Sie dies bei Anwendungen, die mehrere lokale Dateien gleichzeitig öffnen können

source: %u - a single &URL;
de: %u - eine Adresse (&URL;)

source: %U - a list of &URL;s
de: %U - eine Liste von &URL;s (Adressen)

source: %d - the folder of a file to open
de: %d - der Ordner der zu öffnenden Datei

source: %D - a list of folders
de: %D - eine Liste von Ordnern

source: %i - the icon
de: %i - das Symbol

source: %m - the mini icon
de: %m - das Mini-Symbol

source: %c - the caption
de: %c - der Fenstertitel

source: For example: if you want to firefox to start your web browsing at www.kde.org - instead of <command>firefox</command> you would type <command>firefox %u www.kde.org</command>.
de: Ein Beispiel: Wenn Sie firefox mit der Seite www.kde.org starten wollen, geben Sie anstelle von <command>firefox</command> Folgendes ein: <command>firefox %u www.kde.org</command>.

source: Most applications accept additional options &eg; the name of a defined profile like &konqueror; or &konsole;. To see all options for an application launch <userinput><command><replaceable>applicationname</replaceable></command> <option>--help</option></userinput> in &konsole;.
de: Für viele Programme wie zum Beispiel &konqueror; oder &konsole; können Sie auch zusätzliche Optionen wie &eg; den Namen eines definierten Profils angeben. Die möglichen Optionen für ein Programm werden angezeigt, wenn Sie in der &konsole; <userinput><command><replaceable>programm</replaceable></command> <option>--help</option></userinput> eingeben.

source: We would like to have a more creative icon, so we will click the generic icon sitting beside <guilabel>Name:</guilabel> (note, the default icon may be blank, in which case click in the area to the right of the name entry box.) It will bring the <guilabel>Select Icon</guilabel> dialog which will let us choose the new icon, as shown below.
de: Wir möchten ein schöneres Symbol haben, also klicken wir auf das leere Symbol rechts neben <guilabel>Name</guilabel> und <guilabel>Beschreibung</guilabel>. Das Standardsymbol kann auch leer sein, klicken Sie in diesem Fall auf den Bereich rechts neben dem Namensfeld. Nun erscheint der Dialog <guilabel>Symbol auswählen</guilabel>, aus dem Sie, wie unten dargestellt, ein Symbol auswählen können.

source: <guilabel>Select Icon</guilabel> dialog
de: Dialog <guilabel>Symbol auswählen</guilabel>

source: The <guilabel>Select Icon</guilabel> dialog.
de: Der Dialog <guilabel>Symbol auswählen</guilabel>.

source: We choose the firefox icon from the list, and press &Enter;. Your finished screen should probably look something like the screenshot below.
de: Wir wählen aus der Liste das Symbol für firefox, und drücken die Taste &Enter;. Das Ergebnis sollte etwa so aussehen wie unten dargestellt.

source: Done screenshot
de: Bildschirmfoto mit dem Ergebnis

source: This is what the completed menu item should looks like.
de: So sollte der fertiggestellte Menüeintrag aussehen.

source: The place of the new menu item can now be changed using <guibutton>Move Up</guibutton> and <guibutton>Move Down</guibutton> buttons on the &kmenuedit; toolbar or by dragging with the mouse.
de: Die Position des neuen Eintrags kann jetzt mit den Knöpfen <guibutton>Nach oben</guibutton> und <guibutton>Nach unten</guibutton> in der Werkzeugleiste von &kmenuedit; oder durch Ziehen mit der Maus geändert werden.

source: The submenu items can be sorted using <guibutton>Sort</guibutton> button on the &kmenuedit; toolbar or <menuchoice><guimenu>Edit</guimenu><guisubmenu>Sort</guisubmenu></menuchoice> submenu items.
de: Die Reihenfolge der Einträge im Untermenü können Sie mit dem Knopf <guibutton>Sortieren</guibutton> in der Werkzeugleiste von &kmenuedit; oder mit den Einträgen im Menü <menuchoice><guimenu>Bearbeiten</guimenu><guisubmenu>Sortieren</guisubmenu></menuchoice> ändern.
