Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kde-workspace/plasma-desktop.po
Languages: de

source: The &plasma; Handbook
de: Das Handbuch zu &plasma;

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Thomas</firstname><surname>Reitelbach</surname><affiliation><address><email>tr@erdfunkstelle.de</email></address></affiliation><contrib>Deutsche Übersetzung</contrib></othercredit>

source: &plasma;, the most visible pillar of &kde;, is the core interface to the desktop.
de: &plasma; ist einer der auffälligsten Bausteine von KDE, es ist die Haupt-Schnittstelle zur Arbeitsfläche.

source: Widget
de: Bedienelement

source: <keyword>Containments</keyword>
de: <keyword>Container</keyword>

source: Desktop
de: Arbeitsfläche

source: Runner
de: Starter

source: Kicker
de: Kontrollleiste

source: Introduction
de: Einführung

source: &plasma; is one of the key technologies of &kde; Software Compilation 4 (also known as the “Pillars of &kde;”), and one of the most visible to users. As &plasma; treats the user interface differently than a traditional desktop, there may be confusion on what &plasma; is, what it does, and how to perform common tasks.
de: &plasma; ist eine der Schlüsseltechnologien von KDE SC 4 (sozusagen ein Grundbaustein) und gleichzeitig die sichtbarste für KDE-Anwender. &plasma; geht anders mit Ihrer Arbeitsfläche um, als herkömmliche Arbeitsumgebungen. Daher könnte es Verwirrung darüber geben, was &plasma; eigentlich ist und wie man damit ganz allgemeine Aufgaben erledigt.

source: This document attempts to address these problems by providing answers to the most common questions.
de: Dieses Handbuch soll möglichen Problemen vorbeugen und Antworten auf die häufigsten Fragen geben.

source: Using &plasma;
de: &plasma; verwenden

source: &plasma; Components
de: &plasma;-Komponenten

source: &plasma; Widgets and Containments
de: &plasma;-Miniprogramme und Container

source: The essence of &plasma; revolves around two basic concepts:
de: Im Wesentlichen dreht sich bei &plasma; alles um zwei grundlegende Konzepte:

source: &plasma; Widgets
de: &plasma;-Miniprogramme

source: Applets, or small applications that live on the desktop.
de: Miniprogramme, die auf der Arbeitsfläche ausgeführt werden.

source: <term>Containments</term>
de: <term>Container</term>

source: Applets that act as the container for the &plasma; widgets
de: Miniprogramme, die als Container für &plasma;-Miniprogramme fungieren.

source: On a default desktop, there are two main elements: the Panel and the Desktop itself. Both are containments in the &plasma; sense.
de: In der Voreinstellung von KDE befinden sich auf der Arbeitsfläche zwei Hauptelemente: Die Kontrollleiste und die Arbeitsfläche als solche. Beide sind Container im Sinne von &plasma;.

source: Default &plasma; Desktop
de: &plasma;-Standardarbeitsfläche

source: The &plasma; Desktop can be configured in countless ways. The screenshot seen below shows a fairly standard desktop. Some distributions apply extensive customizations, so your desktop may look different.
de: Die &plasma;-Arbeitsfläche kann auf vielfache Weise eingerichtet werden. Auf den folgenden Bildschirmfotos wird eine normale Standardarbeitsfläche angezeigt. Einige Distributionen ändern diese Arbeitsfläche erheblich, so dass Ihre Arbeitsfläche anders aussehen kann.

source: Similarly, the graphical appearance of the interface elements can be styled. These screenshots uses the &kde; default style, Oxygen.
de: Das grafische Erscheinungsbild der Bedienelemente der Oberfläche kann gleichermaßen in vielen unterschiedlichen Stilen angezeigt werden. In diesem Bildschirmfotos wird der &kde;-Standardstil Oxygen benutzt.

source: A fairly standard &plasma; Desktop
de: Eine normale &plasma;-Standardarbeitsfläche

source: The program starter. Usually this will be <link linkend="panel-kickoff">&kickoff;</link>.
de: Der Programmstarter. Normalerweise ist das <link linkend="panel-kickoff">&kickoff;</link>.

source: A couple of icons giving easy access to often used applications
de: Einige Symbole, die einen einfachen Zugriff auf häufig benutzte Anwendungen ermöglichen.

source: The Pager widget
de: Der Arbeitsflächen-Umschalter

source: The <link linkend="panel-taskbar">Task Manager</link>, which shows the titles of windows belonging to the applications currently running. No application had opened a window, when the screenshot was taken
de: Die <link linkend="panel-taskbar">Fensterleiste</link>, in der die Titel der gerade laufenden Anwendungen angezeigt werden. Alle Anwendungen waren minimiert und kein Fenster war geöffnet, als das Bildschirmfoto aufgenommen wurde.

source: The <link linkend="panel-system-tray">System Tray</link>
de: Der <link linkend="panel-system-tray">Systemabschnitt der Kontrollleiste</link>

source: The <link linkend="panel-digital-clock">Digital Clock</link> widget
de: Die <link linkend="panel-digital-clock">Digitale Uhr</link>

source: The <link linkend="toolboxes">Panel Toolbox</link>
de: Der <link linkend="toolboxes">Werkzeugkasten der Kontrollleiste</link>

source: The Desktop Toolbox (previously known as a Cashew)
de: Die Werkzeugleiste der Arbeitsfläche, früher <quote>Cashewnuss</quote> genannt

source: A Folder View widget, showing the content of the Desktop folder
de: Eine Ordneransicht, die den Inhalt des Arbeitsflächenordners anzeigt

source: The Panel
de: Die Kontrollleiste

source: The default panel holds a few &plasma; widgets: starting from the left, there is the &kickoff; application launcher. You can use it to start applications, open recently opened files and the usual logout/shutdown options. There is also a structure that allows you to browse through your applications. The layout has been optimized for the use case that is most common: starting an application. The default tab is the <guilabel>Favorites</guilabel> tab that holds the most-used entries. In the beginning, you'll probably find yourself using the <guilabel>Applications</guilabel> tab more often. Once you have found out what your most frequently started applications are, <mousebutton>right</mousebutton> click on the items and select the <guimenuitem>Add to Favorites</guimenuitem> to add them to your <guilabel>Favorites</guilabel> (or directly into the panel or on the desktop. Note that you need to <quote>unlock</quote> &plasma; by means of <mousebutton>right</mousebutton> clicking on the desktop for any kind of modification). If you prefer the traditional menu-style application launcher, change it by <mousebutton>right</mousebutton> clicking on the menu button and selecting <guimenuitem>Switch to Classic Menu Style</guimenuitem>.
de: Die Kontrollleiste beinhaltet einige &plasma;-Miniprogramme. Von Links an finden Sie dort &kickoff;, den Programmstarter. Mit ihm können Sie unter anderem Anwendungen starten, kürzlich verwendete Dateien öffnen, KDE beenden und den Rechner herunterfahren. Das Layout von &kickoff; ist auf den Hauptanwendungszweck optimiert: das Starten von Anwendungen. Das Voreingestellte Unterfenster <guilabel>Favoriten</guilabel> enthält die meist verwendeten Einträge. Zu Beginn werden Sie wahrscheinlich hauptsächlich im Unterfenster <guilabel>Programme</guilabel> arbeiten. Wenn Sie aber wissen, welche Programme Sie recht häufig verwenden, so klicken Sie mit der &RMBn; darauf und wählen den Menüeintrag <guimenuitem>Zu Favoriten hinzufügen</guimenuitem>, um den Programmeintrag in das Unterfenster <guilabel>Favoriten</guilabel> zu übernehmen. Ebenso können Sie einen Programmeintrag auch auf die Arbeitsfläche oder in die Kontrollleiste übernehmen. Um Einträge auf die Arbeitsfläche oder in die Kontrollleiste zu übernehmen, müssen Miniprogramme zunächst <quote>entsperrt</quote> werden. Klicken Sie dazu mit der &RMBn; auf die Arbeitsfläche und wählen Sie aus dem Menü <guilabel>Miniprogramme entsperren</guilabel>. Vielleicht bevorzugen Sie statt dem neuen Kickoff-Menüstil eher das traditionelle Startmenü? Dann klicken Sie mit der &RMBn; auf den Start-Knopf und wählen aus dem Menü <guimenuitem>Zum klassischen Menüstil wechseln</guimenuitem>.

source: The taskbar is another widget on the panel. It shows an area for all open windows on all desktops by default. You can make it show all open windows on the current desktop only by checking <guimenuitem>Only show tasks from the current desktop</guimenuitem> when you right click on the task manager, between two windows. The size of the text on the taskbar items can be set in &systemsettings; under the <menuchoice><guimenu>Application Appearance</guimenu><guisubmenu>Fonts</guisubmenu> <guimenuitem>Taskbar</guimenuitem></menuchoice>. Right-clicking on the taskbar brings the Settings dialog where you can choose several options to customize your taskbar.
de: Die Fensterleiste ist ein weiteres Element in der Kontrollleiste. In diesem Bereich werden alle offenen Fenster aller Arbeitsfläche angezeigt. Klicken Sie mit der rechten Maustaste auf den Umschalter, dann können Sie mit der Einstellung <guimenuitem>Nur Fenster der aktuellen Arbeitsfläche anzeigen</guimenuitem> festlegen, dass nur die Fenster auf der aktuellen Arbeitsfläche angezeigt werden. Die Textgröße von Fenstereinträgen in der Fensterleiste ist einstellbar. Sie finden diese Einstellung in den &systemsettings; unter <menuchoice><guimenu>Erscheinungsbild von Anwendungen</guimenu><guisubmenu>Schriftarten</guisubmenu><guimenuitem>Fensterleiste</guimenuitem></menuchoice>. Den Einrichtungsdialog für den Arbeitsflächen-Umschalter öffnen Sie durch Klicken mit der rechten Maustaste darauf.

source: Here is a screenshot of the taskbar settings dialog
de: Einrichtungsdialog der Fensterleiste

source: Taskbar settings dialog
de: Einrichtungsdialog der Fensterleiste

source: Another default panel item is the <application>System Tray</application>, which is used by traditional applications and widgets as a dock. Right clicking on the <application>System Tray</application> allows you to open the settings dialog, where you can set entries to display and their visibility.
de: Ein anderes Standard-Element in der Kontrollleiste ist der <application>Systembereich der Kontrollleiste</application>. Dieser dient herkömmlichen Programmen als Andockbereich. Mit einem Rechtsklick auf den <application>Systembereich der Kontrollleiste</application> können Sie den Einrichtungsdialog öffnen. Darin wählen Sie die angezeigten Elemente und deren Sichtbarkeit aus.

source: <screeninfo>System Tray settings dialog</screeninfo>
de: <screeninfo>Einstellungsdialog „Systemabschnitt der Kontrollleiste“</screeninfo>

source: <phrase>System Tray settings dialog</phrase>
de: <phrase>Einstellungsdialog „Systemabschnitt der Kontrollleiste“</phrase>

source: An icon located usually in the system tray is the <application>Device Notifier</application>. Plug in a <acronym>USB</acronym> disk and a dialog will open that allows you to open the device in &dolphin; or another associated application.
de: Ein Standardsymbol im Systemabschnitt der Kontrollleiste ist die <application>Geräteüberwachung</application>. Wenn Sie beispielsweise eine <acronym>USB</acronym>-Festplatte anschließen, erscheint ein Dialogfenster, mit dessen Hilfe Sie das Gerät in &dolphin; oder einer anderen zugeordneten Anwendung öffnen können.

source: The <application>Device Notifier</application> is used for handling pluggable devices such as <acronym>USB</acronym> pendrives (also called flash drives or thumb drives), digital cameras, external <acronym>USB</acronym> hard drives, &etc; It also comes into play when a medium such as a &CD; or DVD is loaded into an optical drive.
de: Die <application>Geräteüberwachung</application> ist für den Umgang mit ansteckbaren Geräten wie <acronym>USB</acronym>-Pendrives (auch Flash-Laufwerke oder USB-Sticks genannt), Digitalkameras, externe USB-Festplatten &etc; zuständig. Sie kommt auch zum Einsatz, wenn ein Medium wie beispielsweise eine &CD; oder DVD in ein optisches Laufwerk eingelegt wird.

source: When you plug in an external device, or load a new medium into a drive, the <guilabel>Notifier</guilabel> window pops up (you can also open it explicitly by clicking on its Panel icon.) It stays open while the cursor is over it, otherwise it hides itself after a few seconds.
de: Wenn Sie ein externes Gerät anstecken oder ein neues Medium in ein Laufwerk einlegen, erscheint die Überwachungsfenster. Sie können es auch direkt öffnen, in dem Sie auf das Symbol im Systembereich der Kontrollleiste klicken. Das Fenster bleibt solange sichtbar wie der Mauszeiger sich darüber befindet, sonst schließt sie sich nach ein paar Sekunden von selbst.

source: The <guilabel>Notifier</guilabel> window shows a list of all the devices it currently knows about. Moving the mouse cursor over a device will highlight how many possible actions are associated with that device.
de: Die <guilabel>Geräteüberwachung</guilabel> zeigt eine Liste aller bekannten Geräte. Wenn man den Mauszeiger über ein Gerät bewegt, werden die möglichen Aktionen für dieses Gerät angezeigt.

source: Clicking anywhere in the shaded box around the device name (but not on the eject/unmount icon if present) expands the entry to show the list of possible actions for that device. The set of actions depends on the device; it is configurable from the <application>Device Notifier</application>'s context menu or from the &systemsettings; modules <ulink url="help:/kcontrol/solid-actions/index.html">Device Actions</ulink> and <ulink url="help:/kcontrol/solid-device-automounter/index.html">Removable Devices</ulink>. Simply select one with the mouse or keyboard to launch that action.
de: Ein Klick irgendwo im schattierten Feld um den Namen des Geräts (aber nicht auf die Auswurftaste / Auswurf-Symbol falls vorhanden) erweitert den Eintrag um eine Liste der möglichen Aktionen für dieses Gerät. Die Liste der möglichen Aktionen hängt vom Gerät ab, dies kann im Kontextmenü der <guilabel>Geräteüberwachung</guilabel> oder in den &systemsettings; in den Modulen <ulink url="help:/kcontrol/solid-actions/index.html">Geräte-Aktionen</ulink> und <ulink url="help:/kcontrol/solid-device-automounter/index.html">Wechselmedien</ulink> eingerichtet werden. Wählen Sie eine Aktion mit der Maus oder Tastatur aus, um sie auszuführen.

source: There is also a small icon to the right of each entry showing whether that device is currently accessible (or <emphasis>mounted</emphasis>) or not. Only when a device is not mounted is it safe to physically disconnect it from the computer. Clicking on the icon causes the device to be unmounted and/or the medium to be ejected if it is currently mounted, and will mount it if it is not. Note that unmounting/ejecting might fail if the device still has open files on it, &eg; if a large file copy hasn't finished. In most cases you can just wait a while and try again. When an unmounting has succeeded, a success icon will be shown on the <application>Device Notifier</application>'s icon.
de: Es gibt auch ein kleines Symbol, das rechts neben jedem Eintrag angezeigt wird. Es zeigt an, ob das Gerät derzeit eingebunden ist oder nicht. Nur wenn ein Gerät nicht eingebunden ist, kann es sicher physikalisch vom Rechner getrennt werden. Wenn man auf das Symbol klickt, wird das Gerät getrennt und/oder das Medium ausgeworfen, wenn es gerade eingebunden ist. Anderenfalls wird das Gerät eingebunden. Beachten Sie, dass das Trennen/Auswerfen möglicherweise misslingt, wenn noch Dateien geöffnet sind, &eg; weil der Kopiervorgang einer großen Datei noch nicht abgeschlossen ist. In den meisten Fällen können Sie etwas warten und es noch einmal probieren. Wenn das Trennen erfolgreich war, wird das durch ein Symbol in der <guilabel>Geräteüberwachung</guilabel> angezeigt.

source: The <application>System Tray</application> normally holds some more entries like &klipper;, &kmix; &etc;
de: Üblicherweise enthält der Systemabschnitt der Kontrollleiste weiter Elemente wie &klipper;, &kmix; &etc;

source: Some of the default entries in the <application>System Tray</application> are hidden to save space in the bar. To display these entries click on the small white triangle <inlinemediaobject><imageobject><imagedata fileref="system-tray-up-arrow.png" format="PNG"/> </imageobject></inlinemediaobject>, then use the &LMB; to launch a widget or the &RMB; to open its settings dialog.
de: Einige Standardelemente im <application>Systemabschnitt der Kontrollleiste</application> werden ausgeblendet, um den Platz für die Anzeige zu begrenzen. Um diese Elemente anzuzeigen, klicken Sie auf das kleine weiße Dreieck <inlinemediaobject><imageobject><imagedata fileref="system-tray-up-arrow.png" format="PNG"/> </imageobject></inlinemediaobject>. Dann können Sie die Miniprogramme mit der &LMBn; starten oder mit der &RMBn; den Einrichtungsdialog öffnen.

source: The right-most &plasma; widget in the default panel holds the <application>Digital Clock</application>. This clock can display the time in different timezones as well as have its size changed. The clock will adjust its font size to the area it is given by the surrounding containment (that is the panel in this case). If you choose to display the date, this date will be rendered using the <guimenuitem>Small font</guimenuitem> option from the &systemsettings; <guilabel>Font</guilabel> dialog. The time will take the rest of the space. So in the end, you'll choose yourself the amount of information displayed, and if that fits. If you want to display more information, make the panel larger or put the clock on the desktop where it can grow freely.
de: Ganz rechts in der Kontrollleiste befindet sich die <application>digitale Uhr</application>. Die Uhr kann die Zeit in verschiedenen Zeitzonen darstellen; ebenso ist die Größe der Uhr einstellbar. Normalerweise passt sich die Uhr der Größe ihres Containers an (in diesem Fall der Kontrollleiste). Wenn Sie einstellen, dass neben der Uhrzeit auch das Datum angezeigt werden soll, so wird dieses mit der Schrift des Typs <guimenuitem>Klein</guimenuitem> aus den Systemeinstellungen unter <guilabel>Schriftarten</guilabel> angezeigt. Der restliche verfügbare Platz wird zur Anzeige der Uhrzeit verwendet. Schlussendlich entscheiden Sie, wie viele Informationen die Uhr anzeigen soll und ob es Ihnen so gefällt. Wenn Sie mehr Informationen anzeigen lassen möchten, so vergrößern Sie bei Bedarf die Kontrollleiste, oder verschieben Sie die Uhr auf die Arbeitsfläche, wo sie mehr Platz einnehmen kann.

source: An optional item on your panel is the <application>Pager</application>. It allows you to switch between your virtual desktops. If you change the layout of the <application>Pager</application> through the <guimenuitem>Number of rows</guimenuitem> option, which will also affect the layout and animations that are shown in &kwin;’s <guimenuitem>Desktop Grid</guimenuitem> effect. For larger pagers, selecting <guimenuitem>Display windows icons</guimenuitem> typically makes sense.
de: Als weiteres optionales Symbol finden Sie den <application>Arbeitsflächen-Umschalter</application> vor. Dieser ermöglicht Ihnen den schnellen Wechsel von einer Arbeitsfläche zu einer anderen. Wenn Sie das Aussehen des <application>Arbeitsflächen-Umschalters</application> über die Einstellung <guimenuitem>Zeilenanzahl</guimenuitem> ändern, so ändern Sie gleichzeitig auch das Aussehen der Effekte und Animationen beim Arbeitsflächen-Wechsel. Bei großen Ansichten des Arbeitsflächen-Umschalters ist es oft sinnvoll, die Einstellung <guimenuitem>Fenstersymbole anzeigen</guimenuitem> zu aktivieren.

source: The Panel Toolboxes
de: Die Kontrollleisten-Einstellungen

source: If your desktop is unlocked (you can do that by <mousebutton>right</mousebutton> clicking on the desktop, or when no application has the focus, with <keycombo action="simul">&Alt;<keycap>D</keycap></keycombo>, <keycap>L</keycap>), a small &plasma; logo will appear in the bottom right corner in the panel (it is commonly named the “cashew”). Click on this cashew, and the panel controller opens.
de: Wenn Ihre Plasma-Miniprogramme entsperrt sind (klicken Sie dazu mit der &RMBn; auf die Arbeitsfläche und wählen Sie den passenden Menüeintrag oder die Kurzwahl <keycombo action="simul">&Alt;<keycap>D</keycap></keycombo>, <keycap>L</keycap>, wenn keine Anwendung den Fokus hat), erscheint an der rechten Seite der Kontrollleiste das &plasma;-Logo (es sieht aus wie eine <quote>Cashewnuss</quote>). Klicken Sie darauf, so öffnet sich der Einstellungsbereich der Kontrollleiste.

source: <screeninfo>Panel Settings</screeninfo>
de: <screeninfo>Kontrollleisten-Einstellungen</screeninfo>

source: <phrase>Panel Settings</phrase>
de: <phrase>Kontrollleisten-Einstellungen</phrase>

source: The panel controller allows you to reposition, resize and realign the panel. The &plasma; widgets living in this panel will adjust their size automatically. &plasma; widgets have basic knowledge about sizing, provided by the containment. They are programmed to take advantage of that size, and inform the applet about how much space they possibly need. In the end, the containment gives a possible size to the applets, the applets obey.
de: Hier können Sie die Größe, Platzierung und Ausrichtung der Kontrollleiste ändern. Die &plasma;-Miniprogramme der Kontrollleiste werden ihre Größe und Positionierung automatisch anpassen. Die &plasma;Miniprogramme sind so programmiert, dass sie den vorhandenen Platz möglichst gut ausnutzen. Außerdem informieren sie ihren Wirt-Container darüber, wieviel Platz sie voraussichtlich benötigen.

source: Adding Applets
de: Miniprogramme hinzufügen

source: Unlock the desktop and you'll be able to add and remove &plasma; widgets from panel or desktop. You add &plasma; widgets by simply dragging them where you want them. <mousebutton>Right</mousebutton> click on an widget to remove it. <screenshot> <screeninfo>Add Widgets</screeninfo> <mediaobject> <imageobject> <imagedata fileref="add-widgets.png" format="PNG"/> </imageobject> <textobject> <phrase>Add Widgets</phrase> </textobject> </mediaobject> </screenshot> The <guibutton>Get New Widgets</guibutton> button allows you to add widgets you've previously downloaded and download new &plasma; widgets. Currently it supports native &plasmagik; packages and some &Mac; OS&nbsp;X dashboard widgets. Widgets you install this way can then be accessed just like regular, preinstalled widgets.
de: Sobald Sie Miniprogramme entsperrt haben, können Sie neue hinzufügen oder vorhandene &plasma;-Miniprogramme von der Arbeitsfläche oder der Kontrollleiste entfernen. Sie können Miniprogramme hinzufügen, indem Sie sie an die gewünschte Stelle ziehen. Klicken Sie mit der &RMBn; auf ein Miniprogramm, um es zu entfernen. <screenshot> <screeninfo>Miniprogramme hinzufügen</screeninfo> <mediaobject> <imageobject> <imagedata fileref="add-widgets.png" format="PNG"/> </imageobject> <textobject> <phrase>Miniprogramme hinzufügen</phrase> </textobject> </mediaobject> </screenshot> Der Knopf <guibutton>Neue Miniprogramme holen</guibutton> ermöglicht es Ihnen, bereits heruntergeladene Miniprogramme zu installieren und neue Miniprogramme herunterzuladen. Derzeit werden Pakete des Typs &plasmagik; sowie einige &Mac; OS&nbsp;X Dashboard-Miniprogramme unterstützt. Miniprogramme, die Sie auf diese Weise installieren, können genau wie alle anderen vorinstallierten Miniprogramme verwendet werden.

source: The Desktop
de: Die Arbeitsfläche
