Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kde-workspace/plasma-desktop.po
Languages: de

source: The desktop is in fact another containment. One that does not put size constraints on the applets. Applets can be moved and sized freely. On the unlocked desktop, &plasma; widgets will show a frame when you move the mouse over them. This applet handle allows you to move, resize, relocate and realign the panel. It also allows you to drag &plasma; widgets on the desktop. The buttons in the corner are used to resize, rotate configure and remove the applet. When rotated, a &plasma; widget will act magnetic towards 12 o'clock, so it is easy to get them back into sensible position. By default, most applets keep their aspect ratio when they are being resized. If you want to freely resize an applet, hold the &Ctrl; key pressed while resizing.
de: Auch die Arbeitsfläche ist nur ein Container. Allerdings beschränkt die Arbeitsfläche die installierten Miniprogramme nicht in ihrer Größe. Daher können Miniprogramme auf der Arbeitsfläche frei verschoben und in der Größe geändert werden. Wenn &plasma;-Miniprogramme entsperrt sind, erscheint um sie ein Rahmen, sobald Sie mit der Maus darüber fahren. Der Rahmen dient als Anfasser und ermöglicht es Ihnen, das &plasma;-Miniprogramm zu verschieben, die Größe zu ändern usw. Außerdem können Sie die Kontrollleiste neu ausrichten und auf der Arbeitsfläche verschieben, wenn Miniprogramme entsperrt sind. Die Knöpfe in dem Miniprogramm-Anfasser dienen dazu, die Größe zu ändern, das Miniprogramm zu drehen, einzurichten und zu entfernen. Wenn Sie ein &plasma;-Miniprogramm drehen, so verhält es sich in der 12-Uhr-Stellung <quote>magnetisch</quote>, sodass es Ihnen leicht fallen wird, es wieder in eine aufrechte Position zu bringen. Die meisten Miniprogramm behalten übrigens bei der Größenänderung ihr Seitenverhältnis bei. Wenn Sie das Seitenverhältnis übergehen möchten, so halten Sie während der Größenänderung die &Ctrl;-Taste gedrückt.

source: Right clicking on the desktop also offers you to configure aspects such as the wallpaper and the layout used, and the mouse actions. It offers to download new wallpapers through &knewstuff;.
de: Mit einem Rechtsklick auf die Arbeitsfläche erhalten Sie außerdem die Möglichkeit, das verwendete Hintergrundbild und das Layout einzustellen. Zusätzliche Hintergrundbilder können Sie über das Internet herunterladen.

source: <screeninfo>Desktop Settings</screeninfo>
de: <screeninfo>Arbeitsflächen-Einstellungen</screeninfo>

source: <phrase>Desktop Settings</phrase>
de: <phrase>Arbeitsflächen-Einstellungen</phrase>

source: To change the &plasma; theme or download a new one through &knewstuff; open the <menuchoice><guimenu>Workspace Appearance</guimenu> <guimenuitem>Desktop Theme</guimenuitem></menuchoice> page in the &systemsettings;.
de: Um das &plasma;-Design zu ändern oder ein neues Design herunterzuladen, öffnen Sie die Seite <menuchoice><guimenu>Erscheinungsbild der Arbeitsfläche</guimenu> <guimenuitem>Arbeitsflächen-Design</guimenuitem></menuchoice> in den &systemsettings;.

source: With open applications, it quickly gets hard to see the &plasma; widgets on your desktop. The <emphasis role="bold">Dashboard</emphasis> gets those &plasma; widgets in front of you, much like the <guilabel>Show desktop</guilabel> functionality you are used to from traditional desktops.
de: Haben Sie mehrere Fenster geöffnet, so verschwinden die &plasma;-Miniprogramme der Arbeitsfläche im Hintergrund. Das <emphasis role="bold">Dashboard</emphasis> holt Ihnen diese wieder vor Augen, so wie Sie es von der Funktion <guilabel>Arbeitsfläche anzeigen</guilabel> traditioneller Arbeitsumgebungen gewohnt sind.

source: &krunner; is a versatile mini command-line. You can use it to start applications, open web pages, access bookmarks, search through your desktop data, calculate short equations, and many more.Pressing <keycombo action="simul">&Alt;<keycap>F2</keycap></keycombo> opens the &krunner; dialog. You just start typing and &krunner; will start searching matches as soon as you've entered more than two characters. You can open the settings dialog to learn about &krunner;’s functionality, provided by plugins. You can navigate through the matches using the tab and arrow keys.
de: &krunner; ist eine vielfältige Mini-Befehlszeile. Hiermit können Sie Programme starten, Webseiten und Lesezeichen aufrufen, den Rechner durchsuchen, einfache Berechnungen durchführen und vieles mehr. Die Mini-Befehlszeile wird über die Tastenkombination <keycombo action="simul">&Alt;<keycap>F2</keycap></keycombo> aufgerufen und es öffnet sich der &krunner;-Dialog. Beginnen Sie einfach damit, etwas einzugeben, und &krunner; wird mit der Suche nach passenden Anwendungen beginnen, sobald Sie mehr als zwei Zeichen eingegeben haben. Öffnen Sie den Einstellungen-Dialog von &krunner;, um mehr über die vielfältigen Möglichkeiten durch Erweiterungen zu erfahren. Wenn &krunner; Ihnen die Suchergebnisse präsentiert, können Sie mit der Tabulator- und den Pfeiltasten durch sie navigieren.

source: If you want to know what is going on on your system, there is the <guibutton>Show System Activity</guibutton> button, giving you quick access to a list of windows and processes, with options to monitor their output and kill processes.
de: Wenn Sie wissen möchten, was in Ihrem System vorgeht, so starten Sie mal die <guibutton>Systemüberwachung</guibutton> über den kleinen Knopf in &krunner;. Sie erhalten eine Liste der Fenster und laufenden Prozesse auf Ihrem Rechner und haben die Möglichkeit, deren Ausgaben zu überwachen oder Prozesse zu beenden.

source: <title>Activities</title>
de: <title>Aktivitäten</title>

source: The desktop toolbox, accessed via the upper right corner has a button for displaying your activities, of which &plasma; allows you to have more than one. Basically, that is multiple desktop containments hosting multiple sets of &plasma; widgets. Display the <quote>Activities</quote> bar, select one of the predefined activities or choose <guilabel>Create Activity</guilabel> to create a new containment, select your new containment and customize suiting your taste. &plasma;’s activities and &kwin;’s desktop grid are similar in that respect, but there is a fundamental difference. While virtual desktop are used to group and organize windows, &plasma;’s activities are used to group and organize &plasma; widgets. This way, you can switch between activities and have relevant &plasma; widgets supporting the task you are currently trying to accomplish. You can create a <quote>Free time</quote> activity, with comic strips, a puzzle and other &plasma; widgets, and a <quote>Work</quote> activity, with relevant <acronym>RSS</acronym> feeds, calculator and calendar, for example.
de: In den Arbeitsflächen-Werkzeugen in der rechten oberen Ecke der Arbeitsfläche finden Sie einen Knopf, mit dem Sie Ihre Aktivitäten anzeigen können. Mit &plasma; ist es möglich, mehrere Aktivitäten einzurichten. Einfach gesagt handelt es sich dabei um mehrere Arbeitsflächen-Container mit verschiedenen Kombinationen von Miniprogrammen. Wählen Sie aus dem Werkzeugkasten <quote>Aktivitäten</quote>, um eine der vordefinierten Aktivitäten auszuwählen oder <guilabel>Aktivität erstellen</guilabel>, um einen neuen Container zu erzeugen, und passen Sie ihn mit neuen Miniprogrammen Ihren Vorstellungen an. &plasma;&apos;s Aktivitäten und die virtuellen Arbeitsflächen von &kwin; sind sich in ihrer Funktionsweise ähnlich, aber es gibt einen grundlegenden Unterschied: Virtuelle Arbeitsflächen werden verwendet, um Fenster zu organisieren, während &plasma;-Aktivitäten zur Organisation von &plasma;-Miniprogrammen dienen. Sie können zwischen Aktivitäten wechseln und haben gleich die passenden Miniprogramme verfügbar, die für diese Aktivität eingerichtet sind. Sie können beispielsweise eine Aktivität für <quote>Freizeit</quote> einrichten, in der Comics und ein Puzzle angezeigt werden. Oder Sie richten sich eine Aktivität <quote>Arbeit</quote> ein, und haben Miniprogramme für <acronym>RSS</acronym>-Nachrichten, einen Taschenrechner und den Kalender auf der Arbeitsfläche.

source: To delete an activity, press the <guibutton>Stop Activity</guibutton> button on <quote>Activities</quote> bar (press <keycombo action="simul">&Alt;<keycap>D</keycap></keycombo> then <keycombo action="simul">&Alt;<keycap>A</keycap></keycombo> to open this bar) then click the red 'X' (or press <keycombo action="simul">&Alt;<keycap>D</keycap></keycombo> then <keycombo action="simul">&Alt;<keycap>R</keycap></keycombo>) and confirm the deletion.
de: Um eine Aktivität zu löschen, klicken Sie auf den Knopf <guibutton>Aktivität anhalten</guibutton> in der <quote>Aktivitätenverwaltung</quote>, die mit <keycombo action="simul">&Alt;<keycap>D</keycap></keycombo> und dann <keycombo action="simul">&Alt;<keycap>A</keycap></keycombo> geöffnet wird. Klicken Sie dann das rote „X“ oder drücken Sie <keycombo action="simul">&Alt;<keycap>D</keycap></keycombo>, dann <keycombo action="simul">&Alt;<keycap>R</keycap></keycombo> und bestätigen Sie das Löschen der Aktivität.

source: Shortcuts
de: Kurzbefehle

source: Most of &plasma;’s functionality is also accessible through keyboard shortcuts. The various combinations should be pressed in sequence, that is for example <keycombo action="simul">&Alt;<keycap>D</keycap></keycombo>, <keycap>A</keycap> means: Press &Alt; and <keycap>D</keycap>, release and press <keycap>A</keycap>.
de: Die meisten &plasma;-Funktionen sind auch über Kurzbefehle erreichbar. Die verschiedenen Kombinationen müssen nacheinander gedrückt werden. Bei dem Kurzbefehl <keycombo action="simul">&Alt;<keycap>D</keycap></keycombo>, <keycap>A</keycap> zum Beispiel muss zuerst &Alt; und <keycap>D</keycap> gedrückt und dann losgelassen werden, dann die Taste <keycap>A</keycap>.

source: Currently, the following default shortcuts can be used:
de: Zurzeit gibt es folgende Standard-Kurzbefehle:

source: Add Widgets
de: Miniprogramme hinzufügen

source: Remove Widget
de: Miniprogramme entfernen

source: Lock/Unlock Widgets
de: Miniprogramme sperren/entsperren

source: Next Widget
de: Nächstes Miniprogramm

source: Previous Widget
de: Vorheriges Miniprogramm

source: Widget settings
de: Miniprogramm-Einstellungen

source: <para>Activities</para>
de: <para>Aktivitäten</para>

source: Remove this Activity
de: Diese Aktivität entfernen

source: Activities Settings
de: Aktivitäten einrichten

source: Next Activity
de: Nächste Aktivität

source: Previous Activity
de: Vorherige Aktivität

source: Show Dashboard
de: Dashboard anzeigen

source: Run the Associated Application
de: Die zugewiesene Anwendung starten

source: To change shortcuts, click with the &LMB; on the desktop <guilabel>Toolbox</guilabel> (the cashew usually at the top right of the desktop) and select <guilabel>Shortcut Settings</guilabel>.
de: Um diese Kurzbefehle zu ändern, klicken Sie mit der &LMBn; auf den <guilabel>Werkzeugkasten</guilabel> der Arbeitsfläche, das Symbol in der oberen rechten Ecke der Arbeitsfläche. Wählen Sie dann <guilabel>Tastenkürzel einrichten</guilabel>.

source: Credits and License
de: Danksagungen und Lizenz

source: Program copyright 2008 &Aaron.J.Seigo; &Aaron.J.Seigo.mail;
de: Programm Copyright 2008 &Aaron.J.Seigo; &Aaron.J.Seigo.mail;

source: Documentation Copyright &copy; 2008&ndash;2010 Sebastian Kügler <email>sebas@kde.org</email>
de: Dokumentation Copyright &copy; 2008&ndash;2010 Sebastian Kügler <email>sebas@kde.org</email>

source: CREDIT_FOR_TRANSLATORS
de: <para>Übersetzung Thomas Reitelbach <email>tr@erdfunkstelle.de</email></para>
