Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kde-workspace/systemsettings.po
Languages: de

source: The &systemsettings; Handbook
de: Das Handbuch zu &systemsettings;

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Burkhard</firstname><surname>Lück</surname><affiliation><address><email>lueck@hube-lueck.de</email></address></affiliation><contrib>Übersetzung</contrib></othercredit>

source: This documentation describes &kde;&apos;s system configuration and administration center.
de: Diese Dokumentation beschreibt die Anwendung zur Einrichtung und Verwaltung der &kde;-Arbeitsumgebung.

source: Settings
de: Einstellungen

source: configuration
de: Einrichtung

source: administration
de: Verwaltung

source: config
de: Profil

source: Introduction
de: Einführung

source: The &kde; &systemsettings; provides the user with a centralized and convenient way to configure all of the &kde; settings.
de: In den &kde;-&systemsettings; sind für den Benutzer alle Einrichtungsmodule für die &kde;-Arbeitsumgebung enthalten und ermöglichen damit eine bequemen Zugriff auf alle Einstellungen für &kde;.

source: &systemsettings; is made up of multiple modules. Each module is a separate application, however the &kde; &systemsettings; organizes all of these applications into a single location.
de: Die &systemsettings; bestehen aus vielen einzelnen Modulen. Jedes Modul ist eine eigene Anwendung, die jedoch in den &kde;-&systemsettings; an einer Stelle zusammengefasst ist.

source: Each &systemsettings; module can be executed individually
de: Jedes Systemeinstellungs-Modul kann einzeln ausgeführt werden

source: See section entitled <link linkend="run-modules-individually">Running individual &systemsettings; modules</link> for more information.
de: Siehe den Abschnitt <link linkend="run-modules-individually">&systemsettings;-Module einzeln ausführen</link> für weitere Informationen.

source: &systemsettings; groups all of the configuration modules into several categories:
de: In den &systemsettings; sind alle Einrichtungsmodule in mehrere Kategorien eingeordnet:

source: <link linkend="application-appearance">Common Appearance and Behavior</link>
de: <link linkend="application-appearance">Allgemeines Erscheinungsbild und Verhalten</link>

source: <link linkend="workspace-appearance">Workspace Appearance and Behavior</link>
de: <link linkend="workspace-appearance">Erscheinungsbild und Verhalten der Arbeitsfläche</link>

source: <link linkend="network">Network and Connectivity</link>
de: <link linkend="network">Netzwerk und Verbindungen</link>

source: <link linkend="system-administration">System Administration</link>
de: <link linkend="system-administration">Systemverwaltung</link>

source: The modules that make up &systemsettings; fall under one of the above categories, making it easier to locate the correct configuration module.
de: Alle Module der &systemsettings; werden in eine dieser Kategorien eingeordnet, damit es einfacher ist, dass richtige Einstellungsmodul zu finden.

source: Using &systemsettings;
de: &systemsettings; verwenden

source: This section details the use of &systemsettings; itself. For information on each individual module, please see <link linkend="modules">&systemsettings; Modules</link>.
de: In diesem Abschnitt finden Sie allgemeine Erläuterungen zum Umgang mit den &systemsettings;. Informationen über die einzelnen Module finden Sie im Abschnitt <link linkend="modules">&systemsettings;-Module</link>.

source: Starting &systemsettings;
de: Starten der &systemsettings;

source: The &kde; &systemsettings; can be started in one of three ways:
de: Die &kde;-Systemeinstellung kann auf drei Wegen gestartet werden:

source: By selecting <menuchoice><guimenu>K Button</guimenu><guisubmenu>Applications</guisubmenu><guimenuitem>System Settings</guimenuitem></menuchoice>.
de: Wählen Sie im Startmenü <menuchoice><guimenu>Rechner</guimenu><guisubmenu>Systemeinstellungen</guisubmenu></menuchoice>.

source: By pressing <keycombo>&Alt;<keycap>F2</keycap></keycombo>. This will bring up the &krunner; dialog. Type <command>systemsettings</command>, and press &Enter;.
de: Drücken Sie die Tastenkombination <keycombo>&Alt;<keycap>F2</keycap></keycombo>. Damit öffnen Sie den &krunner;-Dialog. Geben Sie den Befehl <command>systemsettings</command> ein und drücken Sie die Taste &Enter;.

source: Type <command>systemsettings &amp;</command> at any command prompt.
de: Sie können <command>systemsettings &amp;</command> an jeder Eingabeaufforderung eingeben.

source: All three of these methods are equivalent, and produce the same result.
de: Alle drei Methoden starten die Systemeinstellungen.

source: The &kde; &systemsettings; Screen
de: Das Fenster der &kde;-&systemsettings;

source: When you start &systemsettings;, you are presented with a window, which is divided into three functional parts.
de: Wenn Sie die &systemsettings; starten, wird ihnen ein Fenster präsentiert, welches in drei funktionale Teile unterteilt werden kann.

source: Across the top is a toolbar. The toolbar provides the user with the ability to go back into the main view from within a module using the <guibutton>Overview</guibutton>. You can also find a <guimenu>Help</guimenu> menu as well as a <guibutton>Configure</guibutton> button which provides you a dialog with alternate view settings.
de: Am oberen Rand befindet sich eine Werkzeugleiste. Darin finden Sie Aktionen, um mit <guibutton>Übersicht</guibutton> aus einem Modul wieder zurück zur Hauptansicht zurückzugehen. Außerdem enthält die Werkzeugleiste ein Menü <guimenu>Hilfe</guimenu> und einen Knopf <guibutton>Einrichten</guibutton>, mit dem ein Dialog mit Einstellungen zur Ansicht geöffnet wird.

source: To search for something within all of the modules, start to type keywords into the search field at the right of the toolbar in the <guibutton>Overview</guibutton>. When you start typing, a list of matching topics will popup. Select one and only the groups with settings for this keyword are enabled, the other are greyed out.
de: Um nach einem Begriff in allen Modulen zu suchen, geben Sie in der <guibutton>Übersicht</guibutton> ein Stichwort in das Suchfeld recht oben in der Werkzeugleiste ein. Bei der Eingabe der ersten Zeichen wird ein Liste mit passenden Begriffen aufgeklappt. Wählen Sie einen Eintrag aus, dann werden nur die Module mit Einstellungen für dieses Stichwort aktiviert, alle anderen nicht passenden Module können nicht gewählt werden und sind in hellgrau angezeigt.

source: When the icon window has the focus, you can type the first letter of any module or module group name to select it. Typing this letter again the selection moves to the next match.
de: Hat der Fensterbereich mit der Symbolanzeige den Fokus, können Sie den ersten Buchstaben eines Moduls oder einer Modulgruppe eingeben, um sie auszuwählen. Bei der nächsten Eingabe des gleichen Buchstabens wechselt die Auswahl zur nächsten Übereinstimmung.

source: Underneath the toolbar is an icon view of the individual modules or module groups that make up &systemsettings; grouped by different categories. By default, if your mouse stays a few seconds over an icon, a detailed tooltip appears, explaining the purpose of the module or the modules in this group.
de: Unter der Werkzeugleiste werden die einzelnen Module oder Modulgruppen der &systemsettings; als Symbole in Kategorien gruppiert angezeigt. Als Voreinstellung erscheinen detaillierte Kurzinfos über den Inhalt eines Moduls oder der Module in der Gruppe, wenn der Mauszeiger einige Sekunden auf einem Symbol stehen bleibt.

source: &systemsettings; Categories and Modules
de: Kategorien und Module der &systemsettings;

source: A brief overview of all categories and their modules:
de: Ein kurzer Überblick über alle Kategorien und deren Module:

source: <term>Common Appearance and Behavior</term>
de: <term>Allgemeines Erscheinungsbild und Verhalten</term>

source: Account Details (Password &amp; User Account, Paths, KDE Wallet, Social Desktop, Web Shortcuts)
de: Benutzerkontodetails (Passwort &amp; Benutzerzugang, Pfade, Passwortverwaltung, Passwortverwaltung, Social-Desktop, Web-Kürzel)

source: Application Appearance (Style, Colors, Icons, Fonts, Emoticons)
de: Erscheinungsbild von Anwendungen (Stil, Farben, Symbole, Schriftarten, Emoticons)

source: Application and System Notifications (Manage Notifications, System Bell, Launch Feedback)
de: Anwendungs- und Systembenachrichtigungen (Benachrichtigungen verwalten, Signalton, Programmstartanzeige)

source: File Associations
de: Dateizuordnungen

source: Locale (Country/Region &amp; Language, Spell Checker)
de: Regionales (Land/Region &amp; Sprache, Rechtschreibprüfung)

source: Personal Information (Akonadi Resources Configuration)
de: Persönliche Informationen (Einrichtung der Akonadi-Ressourcen)

source: Shortcuts and Gestures (Custom Shortcuts, Standard Keyboard Shortcuts, Global Keyboard Shortcuts)
de: Kurzbefehle und Gestensteuerung (Eigene Kurzbefehle, Standard-Kurzbefehle, Globale Kurzbefehle)

source: <term>Workspace Appearance and Behavior</term>
de: <term>Erscheinungsbild und Verhalten der Arbeitsfläche</term>

source: Desktop Effects
de: Arbeitsflächen-Effekte

source: Workspace Appearance (Window Decorations, Cursor Theme, Desktop Theme, Splash Screen)
de: Erscheinungsbild der Arbeitsfläche (Fensterdekoration, Arbeitsflächen-Design, Startbildschirm, Zeigerdesigns)

source: Accessibility (Accessibility, Text-to-Speech)
de: Zugangshilfen (Sprachausgabe, Zugangshilfen)

source: Default Applications
de: Standard-Komponenten

source: Desktop Search
de: Desktop-Suche

source: Window Behavior (Task Switcher, Window Behavior, KWin Scripts, Window Rules)
de: Fensterverhalten (Anwendungsumschalter, Fensterverhalten, KWin-Skripte, Fensterregeln)

source: Workspace Behavior (Activities, Virtual Desktops, Screen Edges, Workspace)
de: Verhalten der Arbeitsfläche (Aktivitäten, Virtuelle Arbeitsflächen, Bildschirmränder, Arbeitsbereich)

source: <term>Network and Connectivity</term>
de: <term>Netzwerk und Verbindungen</term>

source: Network Settings (Proxy, Connection Preferences, Service Discovery)
de: Netzwerkeinstellungen (Proxy, Verbindungseinstellungen, Diensteerkennung)

source: Sharing (Windows Shares)
de: Freigabe (Windows-Freigaben)

source: SSL Preferences
de: SSL-Einstellungen

source: Device Actions
de: Geräte-Aktionen

source: Digital Camera
de: Digitalkamera

source: Display and Monitor (Size &amp; Orientation, Screen Locker, Gamma)
de: Anzeige und Monitor (Größe &amp; Ausrichtung, Bildschirmsperre, Gamma)

source: Input Devices (Keyboard, Mouse, Joystick, Remote Controls)
de: Eingabegeräte (Tastatur, Maus, Joystick, Fernbedienungen)

source: Power Management (Energy Savings Settings, Activity Settings, Advanced Settings)
de: Energieverwaltung (Einstellungen für Energiesparmodus, Aktivitäten-Einstellungen, Erweiterte Einstellungen)

source: Printers
de: Drucker

source: Removable Devices
de: Wechselmedien

source: Multimedia (Audio CDs, Audio and Video Settings, CDDB Retrieval)
de: Multimedia (Audio-CDs, Audio- und Videoeinstellungen, CDDB-Abfrage)

source: <term>System Administration</term>
de: <term>Systemverwaltung</term>

source: Date &amp; Time
de: Datum &amp; Zeit

source: Font Management
de: Schriftarten-Verwaltung

source: Login Screen
de: Anmeldebildschirm

source: Startup and Shutdown (Autostart, Service Manager, Session Management)
de: Starten und Beenden (Autostart, Diensteverwaltung, Sitzungsverwaltung)

source: Task Scheduler
de: Aufgabenplaner

source: Use the search field in <guibutton>Overview</guibutton> to find all matching modules for a given keyword.
de: Benutzen Sie das Suchfeld in der <guibutton>Übersicht</guibutton>, um mit einem Stichwort alle zutreffenden Module zu finden.

source: Exiting the &kde; &systemsettings;
de: Die &kde;-&systemsettings; beenden

source: &systemsettings; can be exited in one of two ways:
de: Die &systemsettings; können auf folgende Weise beendet werden:

source: Press <keycombo>&Ctrl;<keycap>Q</keycap></keycombo> on the keyboard.
de: Drücken Sie <keycombo>&Ctrl;<keycap>Q</keycap></keycombo> auf der Tastatur.

source: Click on the <guibutton>Close</guibutton> button located in the toolbar.
de: Klicken Sie auf den Knopf <guibutton>Beenden</guibutton> in der Werkzeugleiste.

source: Configuring &systemsettings;
de: &systemsettings; einrichten

source: The <guiicon>Configure</guiicon> icon in the toolbar allows you to change some &systemsettings; parameters. You can change from <guilabel>Icon View</guilabel> (default view) to <guilabel>Classic Tree View</guilabel>.
de: Mit dem Symbol <guiicon>Einrichten</guiicon> in der Werkzeugleiste können einige Einstellungen für die &systemsettings; geändert werden. Alternativ zur voreingestellten <guilabel>Symbolansicht</guilabel> kann die <guilabel>Klassische Baumansicht</guilabel> verwendet werden.

source: You can also turn off the detailed tooltips by unchecking <guilabel>Show detailed tooltips</guilabel>. You will then get only normal tooltips and not the content of a module group.
de: Ist <guilabel>Detaillierte Kurzinfos anzeigen</guilabel> abgeschaltet, werden nur noch einfache Kurzinfos und nicht die Einträge einer Modulgruppe angezeigt.

source: Running Individual &systemsettings; Modules
de: Einzelne &systemsettings;-Module ausführen

source: Individual modules can be run without running &systemsettings; using the command <command>kcmshell4</command> from the command line. Type <command>kcmshell4 --list</command> to see a list of the available &kde; &systemsettings; modules.
de: Einzelne Module können auch unabhängig von den &systemsettings; gestartet werden. Geben Sie dazu auf der Befehlzeile <command>kcmshell4</command> ein. Mit <command>kcmshell4 --list</command> wird eine Liste aller verfügbaren &kde;-&systemsettings;-Module ausgegeben.

source: The &kde; &systemsettings; Modules
de: &kde;'s &systemsettings;-Module

source: In order to make it as easy as possible, the &kde; &systemsettings; has organized options into five categories. Under each category, there are icons grouped together under subcategories. Each icon is called a module. When you double click on a module icon, you will be presented with the options of the module in the main window.
de: Um die Gebrauch der &kde;-&systemsettings; zu erleichtern, sind alle Module in fünf Kategorien eingeordnet. In jeder Kategorie werden die Module als Symbolansicht in Gruppen zusammengefasst. Wenn Sie auf das Symbol eines Moduls doppelklicken, wird der Einstellungsdialog dieses Moduls im Hauptfenster geöffnet.

source: Each module will have some or all of the following buttons:
de: Jedes Modul hat einige oder alle der folgenden Knöpfe:

source: Help
de: Hilfe

source: This button will provide help specific to the current module. Clicking the button will open &khelpcenter; in a new window providing detailed information on the module.
de: Mit diesem Knopf erhalten Sie Hilfe zum aktuellen Modul. Das &khelpcenter-de; wird mit ausführlichen Informationen zu diesem Modul in einem neuen Fenster geöffnet.

source: Defaults
de: Voreinstellungen

source: Clicking this button will restore this module to its default values. You must click <guibutton>Apply</guibutton> to save the options.
de: Klicken Sie auf diesen Knopf, so werden alle Einstellungen in diesem Modul wieder auf die Standardwerte zurückgesetzt. Sie müssen <guibutton>OK</guibutton> drücken, um die aktuellen Einstellungen zu speichern.

source: Reset
de: Zurücksetzen

source: This button will &quot;Reset&quot; the module to the previous settings.
de: Dieser Knopf setzt das Modul auf die vorherigen Einstellungen zurück.

source: Apply
de: Anwenden

source: Clicking this button will save all changes to &kde;. If you have changed anything, clicking <guibutton>Apply</guibutton> will cause the changes to take effect.
de: Ein Klick auf diesen Knopf speichert alle Änderungen in &kde;. Falls Sie Einstellungen geändert haben, werden diese Änderungen durch Klicken auf <guibutton>Anwenden</guibutton> aktiviert.

source: You must either &quot;Reset&quot; or &quot;Apply&quot; the changes before changing to another module.
de: Sie müssen entweder alle Änderungen anwenden oder die Einstellungen wieder auf die vorherigen Werte zurücksetzen, ehe Sie zum nächsten Modul wechseln.

source: If you try to change without saving or resetting your options, you will be asked if you want to save your changes, or discard them.
de: Falls Sie versuchen, das Modul zu wechseln, ohne vorher die Einstellungen zu speichern oder wieder zurückzusetzen, werden Sie gefragt, ob Sie die Änderungen speichern oder verwerfen wollen.

source: Credits and License
de: Danksagungen und Lizenz

source: Program copyright 2009 Ben Cooksley.
de: Programm Copyright 2009 Ben Cooksley.

source: Contributors:
de: Mitwirkende:

source: Documentation Copyright &copy; 2008 &Richard.Johnson; &Richard.Johnson.mail;
de: Dokumentation Copyright &copy; 2008 &Richard.Johnson; &Richard.Johnson.mail;

source: CREDIT_FOR_TRANSLATORS
de: <para>Übersetzung Burkhard Lück<email>lueck@hube-lueck.de</email></para>
