Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdetoys/amor_man-amor.6.po
Languages: de

source: March 7, 2003
de: 7. März 2003

source: A &kde; creature for your desktop
de: Ein &kde;-Geschöpf für Ihre Arbeitsfläche

source: <command>amor</command> <group><option>KDE Generic Options</option></group> <group><option>Qt Generic Options</option></group>
de: <command>amor</command> <group><option>Allgemeine KDE-Optionen</option></group> <group><option>Allgemeine Qt-Optionen</option></group>

source: Description
de: Beschreibung

source: <acronym>AMOR</acronym> stands for <quote>Amusing Misuse Of Resources</quote>. It provides several different characters who prance around your X screen doing tricks and giving you tips.
de: <acronym>AMOR</acronym> steht für Amüsanter Missbrauch von Ressourcen <quote>(Amusing Misuse Of Resources)</quote>. Es stellt ein paar verschiedene Typen bereit, die auf Ihrem Bildschirm paradieren, Tricks präsentieren und Ihnen Tipps geben.

source: &amor; is part of the &kde; toys package.
de: &amor; ist Teil des Paketes &kde;-Toys.

source: &amor; is configured graphically, and does not have any commandline options other than the standard &kde; and &Qt; options.
de: &amor; wird grafisch konfiguriert und hat keine Befehlszeilenoptionen außer den Standard-&kde; und &Qt;-Optionen.

source: See Also
de: Sehen Sie auch unter:

source: Within &kde; you can enter <userinput>help:/amor</userinput> in &konqueror; to see the comprehensive user manual.
de: In &kde; können Sie einfach <userinput>help:/amor</userinput> in ein &konqueror;-Fenster eingeben und erhalten dann das ausführliche Benutzerhandbuch angezeigt.

source: Bugs
de: Bekannte Fehler

source: &amor; currently only works with the &kwin; window manager.
de: &amor; funktioniert derzeit nur mit dem &kwin;-Fenstermanager.

source: Authors
de: Autoren

source: &amor; was written by <personname><firstname>Martin</firstname><othername>R.</othername><surname>Jones</surname></personname> <email>mjones@kde.org</email>. This manual page was prepared by <personname><firstname>Ben</firstname><surname>Burton</surname></personname> <email>bab@debian.org</email> for the Debian GNU/Linux system (but may be used by others).
de: &amor; wurde von <personname><firstname>Martin</firstname><othername>R.</othername><surname>Jones</surname></personname> <email>mjones@kde.org</email> geschrieben. Diese Handbuchseiten wurden von <personname><firstname>Ben</firstname><surname>Burton</surname></personname> <email>bab@debian.org</email> für das Debian GNU/Linux-System geschrieben (können jedoch auch von anderen benutzt werden).
