Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdetoys/kteatime.po
Languages: de

source: The &kteatime; Handbook
de: Das Handbuch zu &kteatime;

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"> <firstname>Michael</firstname> <surname>Korman</surname> <affiliation> <address><email>michael.korman@uconn.edu</email></address> </affiliation> <contrib>Übersetzung</contrib></othercredit> <othercredit role="translator"> <firstname>Patrick</firstname> <surname>Trettenbrein</surname> <affiliation> <address><email>patrick.trettenbrein@kdemail.net</email></address> </affiliation><contrib>Übersetzung</contrib></othercredit>

source: This Handbook describes &kteatime;, the &kde; Tea Cooker.
de: Dieses Handbuch beschreibt &kteatime;, den &kde;-Teekocher.

source: <keyword>tea</keyword>
de: <keyword>Tee</keyword>

source: cooker
de: Kocher

source: timer
de: Zeitmesser

source: Introduction
de: Einleitung

source: What's &kteatime;?
de: Was ist &kteatime;?

source: &kteatime; is a handy timer for steeping tea. No longer will you have to guess at how long it takes for your tea to be ready. Simply select the type of tea you have, and it will alert you when the tea is ready to drink.
de: &kteatime; ist ein praktischer Zeitmesser für ziehenden Tee. Sie brauchen nicht länger schätzen, wie lange es dauert, bis Ihr Tee fertig ist. Wählen Sie einfach die Teesorte, die Sie haben, und Sie werden informiert, sobald Ihr Tee trinkfertig ist.

source: How to Use &kteatime;
de: Wie Sie &kteatime; benutzen

source: When you start up &kteatime;, it will automatically dock itself in your panel. To access the menu, right click on the docked icon. This will present a list of options which are covered in more detail in the next chapter.
de: Wenn Sie &kteatime; starten, bindet es sich automatisch in den Systemabschnitt der Kontrollleiste ein. Um auf das Menü zuzugreifen, klicken Sie mit der &RMBn; auf das Symbol. In diesem Menü gibt es eine Reihe von Einstellungen, die im nächsten Kapitel genauer beschrieben werden.

source: Timing Your Tea
de: Geben Sie Ihrem Tee Zeit

source: Upon starting, the panel icon will be that of an tea mug. If you click with the &RMB; on the mug and select your tea, an animated clock visualizing the remaining time is displayed on the icon. After the specified time, the tea will be finished, and a suitable message box will be shown. At this point, you can close the message box by clicking on it. This resets also the timer and the clock on the mug disappears again.
de: Nach dem Starten erscheint das Symbol einer Teetasse im Systemabschnitt der Kontrollleiste. Klicken Sie mit der &RMBn; auf dieses Symbol und wählen Sie Ihren Tee, wird eine animierte Uhr mit der verbleibenden Zeit auf der Teetasse angezeigt. Nach der angegebenen Zeit ist der Tee fertig und eine entsprechende Nachricht erscheint. Die Nachricht schließen Sie durch einen Klick darauf, damit wird auch der Zeitmesser zurück gesetzt und das Symbol erscheint nun wieder als Teetasse ohne Uhr.

source: The timer should only be reset by those who really enjoy tea.
de: Der Zeitmesser sollte nur von jenen zurückgesetzt werden, die ihren Tee wirklich genießen.

source: Menu Options
de: Menü-Einstellungen

source: The following section describes the menu options that are available in &kteatime;.
de: Der folgende Abschnitt beschreibt die Menü-Einstellungen, die in &kteatime; zur Verfügung stehen.

source: Select Your Tea
de: Wählen Sie Ihren Tee

source: Clicking on the icon with the &RMB; will bring up a menu. At the top of the menu there are four menu items. Here, you can select what kind of tea you are preparing to drink. There are: <guimenuitem>Black Tea</guimenuitem>, <guimenuitem>Earl Grey</guimenuitem>, <guimenuitem>Fruit Tea</guimenuitem>, and <guimenuitem>Green Tea</guimenuitem>. These teas are preconfigured with a default time. Many people have complained that the times are not correct. Please be aware that the amount of time it takes to steep a cup of tea is based on personal preference. The times chosen are approximations. If you read on, you will learn how to change or delete these predefined times and to set your own time. A quick-and-easy way to set a custom time is to choose <guimenuitem>Anonymous...</guimenuitem> from the menu.
de: Wenn Sie mit der &RMBn; auf das Symbol klicken, öffnet sich ein Menü. Im oberen Bereich des Menüs befinden sich vier Menüpunkte. Sie können hier auswählen, welchen Tee Sie gerade zubereiten. Es stehen <guimenuitem>Schwarzer Tee</guimenuitem>, <guimenuitem>Earl Grey</guimenuitem> <guimenuitem>Früchtetee</guimenuitem> und <guimenuitem>Grüner Tee</guimenuitem> zur Verfügung. Diese Teesorten haben eine voreingestellte Standardzeit. Es gab Beschwerden, dass diese Zeiten nicht korrekt sind. Beachten Sie dabei bitte, dass diese Zeiten auf persönlichen Vorlieben beruhen. Die gewählten Zeiten sind Annäherungen. Wenn Sie weiterlesen, erfahren Sie, wie Sie diese Zeiten ändern oder löschen, und Ihre eigenen Zeiten festlegen können. Eine einfache, schnelle Möglichkeit, eine eigene Zeit zu setzen ist, <guimenuitem>Anderer ...</guimenuitem> aus dem Menü zu wählen.

source: Start the Tea Timer
de: Starten der Zeitmessung

source: To start the tea timer select a tea from the context menu. As confirmation that you have indeed started the timer, a clock visualizing the remaining time is displayed in the panel icon.
de: Um die Zeitmessung zu starten, wählen Sie einen Tee aus dem Kontextmenü. Als Bestätigung für den Start wird eine animierte Uhr mit der verbleibenden Zeit im Symbol in der Kontrollleiste angezeigt.

source: Configure
de: Einrichten ...

source: This menu item opens up the configuration dialog box. A screenshot is shown below:
de: Dieser Menüpunkt öffnet den Einrichtungsdialog, wie auf dem Bildschirmfoto unten zu sehen:

source: <screeninfo>The &kteatime; configuration dialog box.</screeninfo>
de: <screeninfo>Der &kteatime;-Einrichtungsdialog.</screeninfo>

source: <phrase>The &kteatime; configuration dialog box.</phrase>
de: <phrase>Der &kteatime;-Einrichtungsdialog.</phrase>

source: As shown in the picture, you may add new entries for other tea or change names, times and the order of existing entries. This is useful if you are brewing a cup of tea that is not on the list or if you do not agree with the predefined times. To edit one entry, mark it in the <guilabel>Tea List</guilabel> on the left and change the values in the <guilabel>Tea Properties</guilabel> on the right.
de: Wie im Bild gezeigt, können Sie neue Einträge für andere Tees hinzufügen und die Namen, Zeiten und Reihenfolge der existierenden Einträge ändern. Dies ist dann sinnvoll, wenn Sie einen Tee zubereiten, der nicht auf der Liste steht oder Sie mit den Zeiten nicht einverstanden sind. Um einen Eintrag zu bearbeiten, markieren Sie ihn in der <guilabel>Teeliste</guilabel> links und ändern Sie die Werte in den <guilabel>Tee-Eigenschaften</guilabel> rechts.

source: The box below is the <guilabel>Action</guilabel> field. Here you can define an action that will be executed when the time is up. If <guilabel>Popup</guilabel> is selected, a message box will appear alerting you to the fact that your tea is ready. The button <guibutton>Configure Notifications...</guibutton> brings up the &kde; Notification Settings for &kteatime;.
de: Im darunterliegenden Bereich <guilabel>Aktion</guilabel> können Sie einstellen, was geschehen soll, wenn die Zeit abgelaufen ist. Ist <guilabel>Meldungsfenster</guilabel> markiert, wird eine Nachricht angezeigt, die Sie daran erinnert, dass Ihr Tee fertig ist. Der Knopf <guibutton>Benachrichtigungen festlegen ...</guibutton> öffnet den &kde;-Standarddialog für die Benachrichtigungs-Einstellungen für &kteatime;.

source: If you enable the check box labeled <guilabel>Visualize progress in icon tray</guilabel>, the progress will be shown as a little animated clock inside the icon.
de: Ist das Ankreuzfeld <guilabel>Fortschritt im Systembereich der Kontrollleiste anzeigen</guilabel> markiert, wird die fortschreitende Zeit als kleine animierte Uhr innerhalb des Symbols dargestellt.

source: Credits
de: Mitwirkende

source: &kteatime; Copyright &copy; 1998-1999 by &Matthias.Hoelzer-Kluepfel; &Matthias.Hoelzer-Kluepfel.mail;
de: &kteatime; Copyright &copy; 1998-1999 von &Matthias.Hoelzer-Kluepfel;&Matthias.Hoelzer-Kluepfel.mail;

source: Documentation by &Michael.Korman; &Michael.Korman.mail;
de: Dokumentation von &Michael.Korman; &Michael.Korman.mail; überarbeitet von Patrick Trettenbrein <email>patrick.trettenbrein@kdemail.net</email>

source: CREDIT_FOR_TRANSLATORS
de: <para>Übersetzung Michael Korman<email>michael.korman@uconn.edu</email></para> <para>Patrick Trettenbein<email>patrick.trettenbrein@kdemail.net</email></para>
