Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/extragear-graphics/kgraphviewer.appdata.po
Languages: de

source: A Graphviz dot graph viewer for KDE
de: Ein KDE-Anzeigeprogramm für Graphviz Dot-Diagramme

source: Features:
de: Funktionen:

source: Zooming
de: Größenänderung der Ansichten

source: Threaded loading of several graphs in tabs
de: Gleichzeitiges Laden mehrerer Graphen in Unterfenstern

source: Saving of the recent files list
de: Speicherung der Liste der zuletzt geöffneten Dateien

source: Manual reload of files
de: Manuelles neu laden von Dateien

source: Display of a bird-eye view of the graph
de: Anzeige eines Übersichtsfenster für den Graphen

source: Moving of the graph by dragging
de: Verschieben des Graphen durch ziehen

source: Full featured printing
de: Drucken mit vielen Optionen

source: Perfect drawing of all graphviz example graphs
de: perfekte Darstellung aller Graphviz-Beispieldiagramme

source: Automatically choose dot for directed graphs and neato for undirected
de: Automatische Wahl von „dot“ für gerichtete und „neato“ für ungerichtete Graphen

source: Automatic reloading with user confirmation of (externally) modified files (configurable)
de: Erneutes Laden von (extern) geänderten Dateien - automatisch mit Bestätigung durch den Benutzer (einstellbar)

source: Open new instances as new tabs in the old one (configurable)
de: Öffnen neuer Instanzen als Unterfenster im aktuellen Unterfenster (einstellbar)
