Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/extragear-kdevelop/desktop_extragear-kdevelop_kdevplatform.po
Languages: de

# Name
source: KDevelop Plugin
de: KDevelop-Modul

# Name
source: Basic
de: Einfach

# Comment
source: Basic C++ Class
de: Einfache C++-Klasse

# Name
source: Testing YAML template
de: Testvorlage für YAML

# Comment
source: Describes a class using YAML syntax
de: Beschreibt ein Klasse, die YAML-Syntax verwendet

# Name
source: Description
de: Beschreibung

# Comment
source: Application Wizard
de: Anwendungsassistent

# Name
source: New Project Wizard
de: Projekt-Assistent

# GenericName
source: Application Wizard
de: Anwendungsassistent

# Comment
source: This plugin integrates Bazaar to KDevelop
de: Dieses Modul integriert Bazaar in KDevelop.

# Name
source: Bazaar Support
de: Bazaar-Unterstützung

# GenericName
source: Version Control Support
de: Unterstützung für Versionsverwaltungssysteme

# Comment
source: This plugin provides a browsable model of the currently parsed classes and other items.
de: Dieses Modul bietet eine Liste der aktuell eingelesenen Klassen und anderer Elemente.

# Name
source: Class Browser
de: Klassen-Browser

# GenericName
source: Class Browser
de: Klassen-Browser

# Comment
source: Collection of various utilities that increase productivity while programming.
de: Sammlung verschiedener Werkzeuge, die die Produktivität während des Programmierens erhöhen.

# Name
source: Code Utilities
de: Quelltext-Werkzeuge

# GenericName
source: Code Utilities
de: Quelltext-Werkzeuge

# Name
source: Testing C++ Template
de: Testvorlage für C++

# Comment
source: A unit test using the QTest library without a graphical user interface
de: Ein Unit-Test, der die QTest-Bibliothek ohne grafische Oberfläche verwendet

# Name
source: Testing YAML Template
de: Testvorlage für YAML

# Comment
source: A test description in YAML
de: Eine Test-Beschreibung in YAML

# Comment
source: This plugin shows information about the current language context in a side view, and highlights relevant declarations and uses.
de: Dieses Modul zeigt Informationen über den aktuellen Sprachkontext an und hebt die wichtigen Deklarationen und Vorkommen hervor.

# Name
source: Code Browser
de: Quelltext-Browser

# GenericName
source: Code Navigation Tool
de: Werkzeug zur Quelltextnavigation

# Comment
source: This plugin integrates CVS to KDevelop
de: Dieses Modul integriert CVS in KDevelop.

# Name
source: CVS Support
de: CVS-Unterstützung

# Comment
source: This plugin shows relevant information of some project when it's invoked
de: Dieses Modul zeigt wichtige Informationen zu einem Projekt, wenn es aufgerufen wird.

# Name
source: Project Dashboard
de: Projekt-Dashboard

# GenericName
source: Project Dashboard
de: Projekt-Dashboard

# Name
source: Project Branches
de: Projekt-Zweige

# Comment
source: Displays the branches in the current project
de: Zeigt die Zweige im aktuellen Projekt

# Name
source: Project File Element
de: Datei des Projekts

# Comment
source: Draws a project file into a Dashboard element
de: Zeichnet eine Projektdatei in ein Dashboard-Element

# Comment
source: A most-recently-used document switcher for KDevPlatform.
de: Ein Umschalter zwischen zuletzt geöffneten Dokumenten.

# Name
source: Most-Recently-Used Document Switcher
de: Zuletzt-Verwendet-Dokumentumschalter

# GenericName
source: Document Switcher
de: Dokumentumschalter

# Comment
source: This plugin displays a graphical view of all documents currently loaded and separates them by mimetype.
de: Dieses Modul zeigt alle aktuell geladenen Dokumente getrennt nach ihren MIME-Typen an.

# Name
source: Document View
de: Dokumentansicht

# GenericName
source: Document Tool
de: Dokument-Werkzeug

# Comment
source: Configure Document View settings
de: Dokumentansicht einrichten

# Comment
source: This plugin allows running of programs with no instrumentor, ie. natively by the current host.
de: Dieses Modul erlaubt das Ausführen von Programmen im Kontext des Betriebssystems.

# Name
source: Execute Programs
de: Programme ausführen

# GenericName
source: Program Execution Support
de: Unterstützung zur Ausführung von Programmen

# Comment
source: This plugin allows running of scripts.
de: Dieses Modul ermöglicht das Ausführen von Skripten.

# Name
source: Execute Scripts
de: Skripte ausführen

# GenericName
source: Script Execution Support
de: Unterstützung zur Ausführung von Skripten

# Comment
source: Run external scripts or applications to manipulate the editor contents or do other arbitrary actions.
de: Führen Sie externe Skripte oder Programme zum Verändern des Editorinhalts oder für beliebige andere Aktionen aus.

# Name
source: External Scripts
de: Externe Skripte

# GenericName
source: External Scripts
de: Externe Skripte

# Comment
source: This plugin brings a filemanager to KDevelop.
de: Dieses Modul integriert einen Datei-Browser in KDevelop.

# Name
source: KDE File Manager Integration
de: Integration der KDE-Dateiverwaltung

# GenericName
source: File Manager
de: Dateiverwaltung

# Comment
source: Manages templates for source files
de: Verwaltung von Vorlagen für Quelltextdateien

# Name
source: File Templates Configuration
de: Einrichtung der Dateivorlagen

# GenericName
source: Manages templates for source files
de: Verwaltung von Vorlagen für Quelltextdateien

# Name
source: Generic Project Manager
de: Allgemeine Projektverwaltung

# GenericName
source: Project Manager
de: Projektverwaltung

# Comment
source: Allow KDevelop to manage generic projects
de: Zum Verwalten allgemeiner Projekte in KDevelop

# Comment
source: This plugin integrates Git to KDevelop
de: Dieses Modul integriert Git in KDevelop.

# Name
source: Git Support
de: Git-Unterstützung

# Comment
source: Allows fast searching of multiple files using patterns or regular expressions. And allow to replace it too.
de: Ermöglicht es, Dateien mit Hilfe von Mustern und regulären Ausdrücken zu durchsuchen bzw. Ersetzungen vorzunehmen.

# Name
source: Find/Replace In Files
de: In Dateien suchen/ersetzen

# GenericName
source: Search Tool
de: Such-Werkzeug

# Comment
source: This plugin provides KDevelop with an embedded konsole for quick and easy command line access.
de: Dieses Modul stattet KDevelop mit einer eingebetteten Konsole zum einfachen Zugriff auf die Befehlszeile aus.

# Comment
source: This plugin allows to open files with associated external applications.
de: Mit diesem Modul können Dateien mit ihnen zugewiesenen externen Anwendungen gestartet werden.

# Name
source: Open With
de: Öffnen mit

# GenericName
source: Open With
de: Öffnen mit

# Comment
source: This plugin helps you upload your patches to Pastebin service
de: Dieses Modul hilft Ihnen, Ihre Patches zu einen Pastebin-Dienst hochzuladen.

# Comment
source: This plugin allows reviewing patches directly in the editor.
de: Dieses Modul ermöglich es, Patches direkt im Editor durchzusehen.

# Name
source: Patch Review
de: Patch-Durchsicht

# GenericName
source: Patch Review
de: Patch-Durchsicht

# Comment
source: This plugin shows errors in source code.
de: Dieses Modul zeigt Fehler im Quelltext an.

# Name
source: Problem Reporter View
de: Ansicht für Fehlerberichte

# GenericName
source: Problem Reporter
de: Fehlerberichte

# Name
source: Project Filter
de: Projektfilter

# Comment
source: Configure which files and folders inside the project folder should be included or excluded.
de: Legt fest, welche Dateien und Ordner innerhalb des Projektordners ein- oder ausgeschlossen werden sollen.

# Comment
source: Lets you manage the project contents.
de: Lässt Sie den Inhalt Ihres Projekts verwalten.

# Name
source: Project Manager View
de: Ansicht für Projektverwaltung

# GenericName
source: Project Manager View
de: Ansicht für Projektverwaltung

# Comment
source: This plugin allows quick access to project files and language-items like classes/functions.
de: Dieses Modul bietet schnellen Zugriff auf Projektdateien und Spachelemente wie Klassen und Funktionen.

# Name
source: Quick Open
de: Schnellöffner

# GenericName
source: Quick Open
de: Schnellöffner

# Comment
source: ReviewBoard integration for KDevelop
de: ReviewBoard-Integration für KDevelop

# Comment
source: This plugin allows to store code snippets and insert them into open files
de: Dieses Modul bietet die Möglichkeit, Textbausteine zu speichern und in geöffnete Dateien einzufügen.

# Name
source: Code Snippets Support
de: Unterstützung für Textbausteine

# GenericName
source: Code Snippets Support
de: Unterstützung für Textbausteine

# Name
source: Output View
de: Ansicht für Ausgaben

# GenericName
source: Output View
de: Ansicht für Ausgaben

# Comment
source: Provides a text output toolview for other plugins to use, to show things like compiler messages.
de: Stellt eine Textausgabe für andere Module zur Verfügung, um Dinge wie Compiler-Nachrichten anzuzeigen.

# Comment
source: This plugin integrates subversion to KDevelop.
de: Dieses Modul integriert Subversion in KDevelop.

# Name
source: Subversion Support
de: Subversion-Unterstützung

# Comment
source: Allows switching between buddy documents like implementation and header file.
de: Ermöglicht das Umschalten zwischen verwandten Dokumenten wie Implementations- und Header-Dateien.

# Name
source: Switch to Buddy
de: Zu verwandtem Element wechseln

# GenericName
source: Switch to Buddy
de: Zu verwandtem Element wechseln

# Name
source: Templates
de: Vorlagen

# Comment
source: Lets you see and run unit tests.
de: Unit-Tests anzeigen und ausführen.

# Name
source: Unit Test View
de: Unittest-Ansicht

# GenericName
source: Unit Test View
de: Unittest-Ansicht

# Comment
source: This plugin provides integration between the projects and their VCS infrastructure
de: Dieses Modul stellt eine Integration zwischen Projekten und ihrer VCS-Infrastruktur her.

# Name
source: Background Parser
de: Hintergrund-Parser

# Comment
source: Configure Background Parser
de: Hintergrund-Parser einrichten

# Name
source: Language Support
de: Sprachunterstützung

# Comment
source: Configure code-completion and semantic highlighting
de: Quelltextvervollständigung und semantische Hervorhebung einrichten

# Name
source: Environment
de: Umgebung

# Comment
source: Configure Environment Variables
de: Umgebungsvariablen einrichten

# Name
source: Plugins
de: Module

# Comment
source: Configure Plugins
de: Module einrichten

# Name
source: Projects
de: Projekte

# Comment
source: Configure Projects
de: Projekte einrichten

# Name
source: Source Formatter
de: Quelltextformatierer

# Comment
source: Configure Source Formatter
de: Quelltextformatierer einrichten

# Name
source: User Interface
de: Benutzeroberfläche

# Comment
source: Configure User Interface
de: Benutzeroberfläche einrichten

# Comment
source: This plugin is purely for unit-test
de: Dieses Modul dient nur Unit-Tests.
