Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/extragear-kdevelop/desktop_extragear-kdevelop_kdevelop.po
Languages: de

# GenericName
source: Integrated Development Environment
de: Integrierte Entwicklungsumgebung

# Name
source: Process successful
de: Prozess erfolgreich

# Comment
source: Process finished successfully
de: Prozess erfolgreich beendet

# Name
source: Process error
de: Prozess-Fehler

# Comment
source: Process finished with errors
de: Prozess mit Fehlern beendet

# Name
source: Loading Project
de: Projekt wird geladen

# Comment
source: A project loading process has just started
de: Es ist ein Projekt-Ladeprozess gestartet

# Name
source: Project Loaded Successfully
de: Projekt erfolgreich geladen

# Comment
source: A project has been loaded successfully
de: Ein Projekt wurde erfolgreich geladen

# Name
source: Breakpoint Hit
de: Haltepunkt erreicht

# Comment
source: A Breakpoint has been hit by the debugger
de: Der Debugger hat einen Haltepunkt erreicht

# Name
source: Watchpoint Hit
de: Beobachtungspunkt erreicht

# Comment
source: A Watchpoint has been hit by the debugger
de: Der Debugger hat einen Beobachtungspunkt erreicht

# Name
source: KDevelop 4 (Pick Session)
de: KDevelop 4 (Sitzung auswählen)

# GenericName
source: Integrated Development Environment (Pick Session to start with)
de: Integrierte Entwicklungsumgebung (zu startende Sitzung auswählen)

# Name
source: KDevelop Sessions
de: KDevelop-Sitzungen

# Comment
source: List and launch KDevelop sessions
de: KDevelop-Sitzungen anzeigen und starten

# Comment
source: Matches KDevelop Sessions
de: Findet KDevelop-Sitzungen

# Comment
source: Simple CMake-based C++ application
de: Einfache auf CMake basierende C++-Anwendung

# Comment
source: Qt4 CMake Core application. Generate a CMake/Qt4 based application (crossplatform compatible)
de: Qt4/CMake-Core-Anwendung. Eine auf CMake und Qt4 basierende Anwendung (plattformunabhängig) erstellen.

# Comment
source: Qt4 CMake QTest Core application. Generate a CMake/Qt4 based application (cross-platform)
de: Qt4/CMake/QTest-Core-Anwendung. Eine auf CMake und Qt4 basierende Anwendung (plattformunabhängig) erstellen.

# Comment
source: Qt4 CMake Gui application. Generate a CMake/Qt4 based GUI application (crossplatform compatible)
de: Qt4/CMake-GUI-Anwendung. Eine auf CMake und Qt4 basierende GUI-Anwendung (plattformunabhängig) erstellen.

# Comment
source: This plugin provides a frontend for GDB, a source-level debugger for C, C++ and more.
de: Dieses Modul stellt eine Oberfläche für GDB zur Verfügung. GDB ist ein Debugger für C, C++ und weitere Sprachen.

# Name
source: GDB Support
de: Unterstützung für GDB

# GenericName
source: Debugger Frontend
de: Oberfläche für Debugger

# Comment
source: This plugin provides Manual Pages integration
de: Dieses Modul integriert Handbuch-Seiten

# Name
source: Man Pages
de: Handbuch-Seiten

# GenericName
source: Documentation Support
de: Dokumentationsunterstützung

# Name
source: QtHelp Documentation
de: Qt-Hilfe-Dokumentation

# Comment
source: This plugin provides QtHelp integration
de: Dieses Modul integriert QtHelp in KDevelop

# Name
source: Qt Documentation
de: Qt-Dokumentation

# Comment
source: A simple GObject subclass
de: Eine einfache GObject-Unterklasse

# Name
source: GObject with private pointer
de: GObject mit Private-Pointer

# Comment
source: A GObject subclass with a private pointer
de: Eine GObject-Unterklasse mit einem privaten Pointer

# Name
source: GObject with properties
de: Ein GObject mit Eigenschaften

# Comment
source: A GObject subclass with a private pointer and properties
de: Eine GObject-Unterklasse mit einem privaten Pointer und Eigenschaften

# Name
source: Basic
de: Einfach

# Comment
source: Basic C++ Class
de: Einfache C++-Klasse

# Name
source: Private Pointer
de: Privater Pointer

# Comment
source: C++ Class with a private D-pointer
de: C++-Klasse mit einem privaten D-Pointer

# Name
source: Private Header
de: Privater Header

# Comment
source: Basic Python Class
de: Einfache Pythonklasse

# Name
source: QObject subclass
de: QObject-Unterklasse

# Comment
source: QObject subclass with properties
de: Eine QObject-Unterklasse mit Eigenschaften

# Name
source: Implicitly shared class
de: „Implicitly shared“-Klasse

# Comment
source: Class with a private QSharedData member
de: Klasse mit einem privaten QSharedData-Member

# Name
source: Widget with a UI File
de: Bedienelement mit einer UI-Datei

# Comment
source: QWidget subclass with a separate Qt Designer file
de: QWidget-Subklasse mit einer separaten Qt-Designer-Datei

# Name
source: User Interface
de: Benutzeroberfläche

# Name
source: CMake Module with pkg-config
de: CMake-Modul mit pkg-config

# Comment
source: CMake module for finding a library using pkg-config
de: CMake-Modul für die Suche nach einer Bibliothek mithilfe von pkg-config

# Name
source: Module
de: Modul

# Comment
source: A unit test suite using the QTest library without a graphical user interface
de: Eine Unit-Test-Suite, die die QTest-Bibliothek ohne grafische Oberfläche verwendet

# Name
source: QTestLib with KDE
de: QTestLib mit KDE

# Comment
source: A unit test using the QTest library with KDE extensions
de: Eine Unit-Test-Suite, die die QTest-Bibliothek mit KDE-Erweiterungen verwendet

# Name
source: A test for KDevPlatform
de: Ein Test für KDevPlatform

# Comment
source: A unit test using the QTest library with KDevPlatform test helpers
de: Eine Unit-Test-Suite, die die QTest-Bibliothek mit KDevPlatform-Testhelfern verwendet

# Comment
source: A unit test using the PHPUnit framework
de: Eine Unit-Test-Suite, die das PHPUnit-Framework verwendet

# Comment
source: A unit test using the PyUnit framework
de: Eine Unit-Test-Suite, die das PyUnit-Framework verwendet

# Comment
source: A plugin for formatting of sourcecode according to a specified set of rules
de: Modul zum Formatieren von Quelltext nach bestimmten Vorschriften

# Name
source: AStyle Formatter Backend
de: AStyle-Formatierer

# GenericName
source: Formatter Backend
de: Formatierer

# Comment
source: A plugin for formatting C files using custom scripts
de: Ein Modul zum Formatieren von C-Dateien mit Hilfe von eigenen Skripten

# Name
source: Custom Script Formatter Backend
de: Backend für einen Formatierer für eigene Skripte

# Comment
source: Lets you view a plasmoid
de: Zeigt ein Plasmoid an

# Name
source: Plasmoid Launcher
de: Plasmoid-Starter

# GenericName
source: Plasmoid Launcher Support
de: Unterstützung für Plasmoid-Starter

# Comment
source: This plugin helps to obtain KDE projects
de: Dieses Modul hilft dabei KDE-Projekte zu beziehen

# Comment
source: C/C++ Language Support
de: Sprachunterstützung für C/C++

# Name
source: C++ Support
de: Unterstützung für C++

# GenericName
source: Language Support
de: Sprachunterstützung

# Name
source: Custom Defines And Includes
de: Eigene Definitionen und Includes

# Comment
source: Configure which macros and include directories/files will be added to the parser during project parsing.
de: Einstellung der Makros und Include-Ordner/-Dateien, die zum für den Parser während des Einlesens des Projekts hinzugefügt werden.

# Name
source: Custom Defines And Includes Manager
de: Verwaltung eigener Definitionen und Includes

# GenericName
source: Custom Defines And Includes Manager
de: Verwaltung eigener Definitionen und Includes

# Comment
source: Configure global CMake settings
de: Globale CMake-Einstellungen einrichten

# Name
source: CMake Project Builder
de: Ersteller für CMake-Projekte

# GenericName
source: Project Builder
de: Projektersteller

# Comment
source: Builds CMake Projects
de: Erstellt CMake-Projekte

# Comment
source: Configure Make settings
de: Make-Einstellungen

# Name
source: Make Project Builder
de: Ersteller für Make-Projekte

# Comment
source: KDevelop Make Builder
de: Make-Builder von KDevelop

# Comment
source: Configure Ninja settings
de: Ninja-Einstellungen festlegen

# Name
source: Ninja Project Builder
de: Ninja-Projekterstellung

# Comment
source: KDevelop Ninja Builder
de: KDevelop-Ninja-Erstellung

# Comment
source: Configure CMake settings
de: CMake-Einstellungen

# Name
source: CMake Documentation
de: CMake-Dokumentation

# Comment
source: Allows KDevelop to provide CMake documentation
de: Ermöglicht das Bereitstellen von Dokumentation für CMake

# Name
source: CMake Project Manager
de: CMake-Projektverwaltung

# GenericName
source: Project Manager
de: Projektverwaltung

# Comment
source: Allows KDevelop to manage CMake-based projects
de: Erlaubt das Verwalten CMake-basierter Projekte mit KDevelop

# GenericName
source: A KDE4 Application
de: KDE-4-Anwendung

# Name
source: Custom BuildSystem
de: Eigenes Build-System

# Comment
source: Configure a projects custom build tool and includes/defines for the language support.
de: Einrichtung eines Projekt-Build-Systems und „includes/defines“ für die Sprachen-Unterstützung

# Comment
source: Allows to use custom buildsystems for KDevelop projects
de: Ermöglicht ein benutzerdefiniertes Erstellungssystem für KDevelop-Projekte

# Name
source: Custom Makefile Project Manager
de: Projektverwaltung mit eigenem Makefile

# Comment
source: Imports and edits custom make projects
de: Importiert und bearbeitet benutzerdefinierte Make-Projekte

# Comment
source: This plugin helps to obtain projects from Github
de: Dieses Modul hilft dabei, GitHub-Projekte zu beziehen

# Name
source: Okteta Integration
de: Integration von Okteta

# Comment
source: KDevelop Hex Editor based on Okteta
de: Auf Okteta basierender Hex-Editor für KDevelop
