Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdepim/akonadi_archivemail_agent.po
Languages: de

source: <!ENTITY i18n-archivemailagent "<application>Archive Mail Agent</application>">
de: <!ENTITY i18n-archivemailagent "<application>Agent zur E-Mail-Archivierung</application>">

source: The &i18n-archivemailagent; Handbook
de: Das Handbuch zu &i18n-archivemailagent;

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Burkhard</firstname><surname>Lück</surname><affiliation><address><email>lueck@hube-lueck.de</email></address></affiliation><contrib>Übersetzung</contrib></othercredit>

source: Introduction
de: Einführung

source: &i18n-archivemailagent; is an Akonadi agent which allows to archive mail folders automatically.
de: &i18n-archivemailagent; ist ein Akonadi-Agent, um Ordner mit E-Mails automatisch zu archivieren.

source: Using &i18n-archivemailagent;
de: &i18n-archivemailagent; verwenden

source: Use <menuchoice><guimenu>Tools</guimenu><guimenuitem>Configure Automatic Archiving...</guimenuitem> </menuchoice><action> in &kmail;'s reader window to open a dialog to set up automatic archiving of mail folders.</action>
de: Mit <guimenu>Einstellungen</guimenu> <guimenuitem>Automatische Archivierung einrichten ...</guimenuitem> in &kmail; öffnen Sie einen Dialog, in dem Sie den Agenten zur Archivierung von Ordnern einrichten können.

source: This is a powerful tool that can be used to assist in backing up your email. To use this, click the <guibutton>Add...</guibutton> button, and the <guilabel>Add Archive Mail</guilabel> dialog will pop up.
de: Dies ist ein wichtiges Hilfsprogramm, das Sie bei der Sicherung Ihrer E-Mails unterstützen kann. Klicken Sie auf den Knopf <guibutton>Hinzufügen</guibutton>, dann wird der Dialog <guilabel>E-Mail-Archivierung hinzufügen</guilabel> angezeigt.

source: <screeninfo>Add Archive Mail dialog</screeninfo>
de: <screeninfo>E-Mail-Archivierung hinzufügen</screeninfo>

source: <phrase>Add Archive Mail dialog</phrase>
de: <phrase>E-Mail-Archivierung hinzufügen</phrase>

source: <para>Add Archive Mail dialog</para>
de: <para>E-Mail-Archivierung hinzufügen</para>

source: First select the folder you would like to archive.
de: Wählen Sie zuerst den Ordner, den Sie archivieren möchten.

source: Select the format you would like to save it in. &eg; <literal role="extension">.tar.bz2</literal> in the drop down list. The archive filename will consist of the prefix <userinput>Archive_</userinput>, the path of the selected folder in &kmail;'s folder list, the date in format <userinput>year-month-day</userinput> and the selected file extension &eg; <filename>Archive_Local Folder_inbox_2013-09-03.tar.bz2</filename>.
de: Wählen Sie ein Format zur Speicherung wie &eg; <literal role="extension">.tar.bz2</literal> im Auswahlfeld. Der Name des Archivs wird aus dem Präfix <userinput>Archive_</userinput>, dem Pfad des ausgewählten Ordners in &kmail;s Ordnerliste, dem Datum im Format <userinput>Jahr-Monat-Tag</userinput> und der gewählten Dateiwerweiterung zusammengesetzt wie &eg; <filename>Archive_Lokale Ordner_Posteingang_2013-09-03.tar.bz2</filename>.

source: By default <guilabel>Archive all subfolders</guilabel> is enabled. Uncheck this if you only want the parent folder archived.
de: In der Voreinstellung ist <guilabel>Alle Unterordner archivieren</guilabel> aktiviert. Soll nur der oberste Ordner archiviert werden, wählen Sie diese Einstellung ab.

source: You can type in the location you would like to save your archive, or click the <guibutton>Open File Dialog</guibutton> button to select the folder.
de: Sie können den Speicherort für das Archiv direkt eingeben oder auf das Symbol <guibutton>Dateiauswahl</guibutton> klicken, um einen Ordner auszuwählen.

source: Select how often you wish to backup through the dropdown menus next to <guilabel>Backup each:</guilabel>.
de: Stellen Sie in den Eingabefeldern neben <guilabel>Sichern alle</guilabel> ein, wie oft Sie eine Sicherung durchführen möchten.

source: If you are limited on drive space you will want to set a limit on <guilabel>Maximum number of archive:</guilabel>
de: Haben Sie nur begrenzten Speicherplatz auf der Festplatte, geben Sie eine <guilabel>Maximale Anzahl von Archiven</guilabel> an.

source: If you have added or modified an archive job it will be executed automatically after closing the dialog.
de: Haben Sie eine Archivierung erstellt oder geändert, dann wird der Auftrag automatisch nach dem Schließen des Dialogs ausgeführt.

source: If you have already added mail archive jobs the <guilabel>Configure Archive Mail Agent</guilabel> dialog will list and allow to modify them.
de: Haben Sie bereits Aufträge zur automatischen Archivierung eingegeben, dann werden alle Aufträge im Dialog <guilabel>Automatische Archivierung einrichten ...</guilabel> angezeigt und Sie können bearbeitet werden.

source: <screeninfo>Configure Archive Mail Agent</screeninfo>
de: <screeninfo>E-Mail-Archivierung-Agent einrichten</screeninfo>

source: <phrase>Configure Archive Mail Agent</phrase>
de: <phrase>E-Mail-Archivierung-Agent einrichten</phrase>

source: <para>Configure Archive Mail Agent</para>
de: <para>E-Mail-Archivierung-Agent einrichten</para>

source: You can use the checkbox at the left of each entry in the list to enable or disable archiving of this job.
de: Mit dem Ankreuzfeld links neben jedem Eintrag in der Liste aktivieren oder deaktivieren Sie diesen Archivierungsauftrag.

source: Using the context menu launched with a &RMB; click on an archive job you can open the folder containing the archives or start the archive job immediately. This will overwrite an existing archive created earlier at the same day without notification.
de: Im Kontextmenu, das Sie durch Klicken mit der &RMBn; auf einen Eintrag öffnen, finden Sie Aktionen zum Öffnen des Ordners, der die Archive enthält. Außerdem können Sie einen Archivierungsauftrag sofort manuell starten. Dann wird ein bereits vorher am gleichen Tag erstelltes Archiv ohne Benachrichtigung überschrieben.

source: Credits and License
de: Danksagungen und Lizenz

source: Program copyright 2013 Laurent Montel montel@kde.org
de: Programm Copyright 2013 Laurent Montel montel@kde.org

source: Documentation Copyright &copy; 2013 Laurent Montel montel@kde.org
de: Dokumentation Copyright &copy; 2013 Laurent Montel montel@kde.org

source: CREDIT_FOR_TRANSLATORS
de: <para>Übersetzung Burkhard Lück<email>lueck@hube-lueck.de</email></para>
