Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdepim/akonadi_sendlater_agent.po
Languages: de

source: <!ENTITY i18n-sendlateragent "<application>Send Later Agent</application>">
de: <!ENTITY i18n-sendlateragent "<application>Agent zum späteren Senden</application>">

source: The &i18n-sendlateragent; Handbook
de: Das Handbuch zu &i18n-sendlateragent;

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Burkhard</firstname><surname>Lück</surname><affiliation><address><email>lueck@hube-lueck.de</email></address></affiliation><contrib>Übersetzung</contrib></othercredit>

source: Introduction
de: Einführung

source: &i18n-sendlateragent; is an akonadi agent which allows you to send scheduled mails once or repeatedly.
de: &i18n-sendlateragent; ist ein Akonadi-Agent, um E-Mails später oder wiederholt zu versenden.

source: Using &i18n-sendlateragent;
de: &i18n-sendlateragent; verwenden

source: Use <menuchoice><guimenu>Message</guimenu><guimenuitem>Send Later</guimenuitem></menuchoice> in &kmail;'s composer window to open a dialog which allows you to schedule your emails to send at a specific date and time.
de: Mit <menuchoice><guimenu>Nachricht</guimenu><guimenuitem>Später senden</guimenuitem></menuchoice> in &kmail;s Editorfenster können Sie einen Dialog öffnen, um das Versenden von E-Mails zu einem bestimmten Datum und Uhrzeit planen.

source: <screeninfo>&i18n-sendlateragent; Dialog</screeninfo>
de: <screeninfo>Dialog &i18n-sendlateragent;</screeninfo>

source: <phrase>&i18n-sendlateragent; Dialog</phrase>
de: <phrase>Dialog &i18n-sendlateragent;</phrase>

source: <para>&i18n-sendlateragent; Dialog</para>
de: <para>Dialog &i18n-sendlateragent;</para>

source: Say you have constructed a brilliant email outlining tasks you wish your employees to complete while you are at the conference, but you will be on an airplane when you wish the email to be sent. Use this feature to send the email at a precise date and time. To schedule the email to send later, first check the <guilabel>Delay</guilabel> box and then select the date and time on the <guilabel>Send at:</guilabel> menu.
de: Haben Sie eine E-Mail geschrieben, die Sie zur Zeit nicht versenden können, weil Sie keinen Internetzugang haben, dann benutzen Sie diese Funktion, um sie zum einer bestimmten Zeit später zu senden. Kreuzen Sie zuerst <guilabel>Verspätung</guilabel> an und stellen Sie dann Datum und Zeit des Sendens ein.

source: If you need to send a weekly reminder email to your employees, you can configure it to repeat sending the message by checking <guilabel>Repeat every</guilabel> checkbox and selecting the desired intervals.
de: Möchten Sie zum Beispiel wöchentlich eine E-Mail versenden, können Sie einstellen, dass das Senden der Nachricht in regelmäßigen Abständen wiederholt wird, indem Sie das Ankreuzfeld <guilabel>Wiederholen alle</guilabel> aktivieren und das gewünschte Intervall eingeben.

source: You can put the message in your queued messages by selecting the <guibutton>Send Later</guibutton> button to schedule the message immediately.
de: Die Nachricht verschieben Sie in die Warteschlange zum Versand, indem Sie den Knopf <guibutton>Später senden</guibutton> auswählen, um die Nachricht in den geplanten Zeitablauf einzufügen.

source: This agent works independent from &kmail; and does not need a running &kmail; instance or &kmail; being in online mode to send scheduled emails.
de: Dieser Agent funktioniert unabhängig von &kmail; und benötigt keine laufende Instanz von &kmail; oder &kmail; im Online-Modus, um geplante E-Mails zu versenden.

source: If you have no network connection when a scheduled message should be sent, the agent will report an error and ask if you want to resend it later.
de: Haben Sie keine Netzwerkverbindung, wenn eine Nachricht planmäßig versendet werden soll, erhalten Sie eine Fehlermeldung, in der gefragt wird, ob die Nachricht später versendet werden soll.

source: At login to a &kde; session the agent checks the scheduled messages and sends all messages overdue since the last logout if necessary.
de: Bei der Anmeldung in einer &kde;-Sitzung wird überprüft, ob geplante Nachrichten in der Warteschlange anstehen. Es werden dann alle seit der letzten Abmeldung überfälligen Nachrichten versendet, falls erforderlich.

source: To change the options for emails you have scheduled to send later, use <menuchoice><guimenu>Settings</guimenu> <guimenuitem>Configure Send Later Agent...</guimenuitem></menuchoice> in &kmail;.
de: Benutzen Sie in &kmail; <menuchoice><guimenu>Extras</guimenu> <guimenuitem>Agent zum späteren Senden einrichten ...</guimenuitem></menuchoice>, um das Versenden von geplanten E-Mails zu bearbeiten.

source: <screeninfo>Configure &i18n-sendlateragent;</screeninfo>
de: <screeninfo>&i18n-sendlateragent; einrichten</screeninfo>

source: <phrase>Configure &i18n-sendlateragent;</phrase>
de: <phrase>&i18n-sendlateragent; einrichten</phrase>

source: <para>Configure &i18n-sendlateragent;</para>
de: <para>&i18n-sendlateragent; einrichten</para>

source: This brings up a dialog that allows you to modify the schedule and remove emails that have been sent using the send later feature.
de: Öffnet einen Dialog, um das Versenden von geplanten E-Mails zu bearbeiten oder sie zu entfernen.

source: It is not possible to change the content (body, headers &etc;) of a scheduled message.
de: Der Inhalt (Text, Vorspann &etc;) einer zum späteren Versand geplanten Nachricht kann nicht geändert werden.

source: Credits and License
de: Danksagungen und Lizenz

source: Program copyright 2013 &Laurent.Montel; &Laurent.Montel.mail;
de: Programm Copyright 2013 &Laurent.Montel; &Laurent.Montel.mail;

source: Documentation Copyright &copy; 2013 &Laurent.Montel; &Laurent.Montel.mail;
de: Dokumentation Copyright &copy; 2013 &Laurent.Montel; &Laurent.Montel.mail;

source: CREDIT_FOR_TRANSLATORS
de: <para>Übersetzung Burkhard Lück<email>lueck@hube-lueck.de</email></para>
