Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdepim/akregator.po
Languages: de

source: <action>Load</action> the current article in into a new tab, but not automatically activate that tab. That is useful to browse a feed, open all interesting articles into background tabs and later read them all.
de: <action>Lädt</action> den aktuellen Artikel in einem neuen Unterfenster, aber dieses Unterfenster wird nicht automatisch aktiviert. Diese Funktionen können Sie benutzen, um eine Nachrichtenquelle durchzusehen, alle interessanten Artikel in Unterfenstern im Hintergrund zu öffnen und diese Artikel dann später zu lesen.

source: <shortcut><keycombo action="simul">&Ctrl; &Shift;<keycap>Return</keycap></keycombo></shortcut> <guimenu>Article</guimenu> <guimenuitem>Open in External Browser.</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl; &Shift;<keycap>Eingabe</keycap></keycombo></shortcut> <guimenu>Artikel</guimenu> <guimenuitem>In externem Browser öffnen.</guimenuitem>

source: <action>Open</action> the current article in an external browser
de: <action>Öffnen</action> des aktuellen Artikels in einem externen Browser

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>I</keycap></keycombo></shortcut> <guimenu>Article</guimenu> <guimenuitem>Mark as Important</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>I</keycap></keycombo></shortcut> <guimenu>Artikel</guimenu> <guimenuitem>Als wichtig markieren</guimenuitem>

source: <action>Mark</action> the current article as important
de: <action>Markieren</action> des aktuellen Artikels als wichtig

source: <guimenu>Article</guimenu> <guimenuitem>Mark as</guimenuitem>
de: <guimenu>Artikel</guimenu> <guimenuitem>Markieren als</guimenuitem>

source: <action>Mark</action> the current article as Read <keycombo action="simul">&Ctrl;<keycap>E</keycap></keycombo>, New <keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo> or Unread <keycombo action="simul">&Ctrl;<keycap>U</keycap></keycombo>
de: <action>Markiert</action> den aktuellen Artikel als gelesen <keycombo action="simul">&Ctrl;<keycap>E</keycap></keycombo>, Neu <keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo> oder ungelesen <keycombo action="simul">&Ctrl;<keycap>U</keycap></keycombo>

source: <shortcut><keycap>Del</keycap></shortcut> <guimenu>Article</guimenu> <guimenuitem>Delete</guimenuitem>
de: <shortcut><keycap>Entf</keycap></shortcut> <guimenu>Artikel</guimenu> <guimenuitem>Löschen</guimenuitem>

source: <action>Delete</action> the current article
de: <action>Löscht</action> den aktuellen Artikel

source: <guimenu>Article</guimenu> <guimenuitem>Send Link Address...</guimenuitem>
de: <guimenu>Artikel</guimenu> <guimenuitem>Verknüpfungsadresse senden ...</guimenuitem>

source: <action>Open</action> your mail client and attach the link in the mail.
de: <action>Öffnen</action> des E-Mail Programms und Anhängen der aktuellen Nachricht als Verknüpfung an die E-Mail.

source: <guimenu>Article</guimenu> <guimenuitem>Send File...</guimenuitem>
de: <guimenu>Artikel</guimenu> <guimenuitem>Datei senden ...</guimenuitem>

source: <action>Open</action> your mail client and attach the file in the mail.
de: <action>Öffnen</action> des E-Mail Programms und Anhängen der aktuellen Nachricht als Datei.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>S</keycap></keycombo></shortcut> <guimenu>Article</guimenu> <guimenuitem>Share Article</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>S</keycap></keycombo></shortcut> <guimenu>Artikel</guimenu> <guimenuitem>Artikel veröffentlichen</guimenuitem>

source: Use this action you to share news with your friends using the microblog services identi.ca and twitter.
de: Verwenden Sie diese Funktion, um Neuigkeiten mithilfe von Diensten wie <quote>identi.ca</quote> und <quote>twitter</quote> zu verbreiten.

source: The Settings Menu
de: Das Menü Einstellungen

source: <guimenu>Settings</guimenu> <guimenuitem>Show Quick Filter</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>Schnellfilter anzeigen</guimenuitem>

source: <action>Toggle</action> the Quick Filter (Show/Hide it)
de: <action>Zeigt</action> die Schnellfilter an (Anzeigen oder Ausblenden)

source: <screeninfo>The Quick Filter</screeninfo>
de: <screeninfo>Der Schnellfilter</screeninfo>

source: <phrase>The Quick Filter</phrase>
de: <phrase>Der Schnellfilter</phrase>

source: Additionally &akregator; has the common &kde; <guimenu>Settings</guimenu> and <guimenu>Help</guimenu> menu items, for more information read the sections about the <ulink url="help:/fundamentals/ui.html#menus-settings">Settings Menu</ulink> and <ulink url="help:/fundamentals/ui.html#menus-help">Help Menu</ulink> of the &kde; Fundamentals.
de: Zusätzlich hat &akregator; die bekannten &kde;-Einträge im Menü <guimenu>Einstellungen</guimenu> und <guimenu>Hilfe</guimenu>, weitere Informationen dazu finden Sie in den Abschnitten über die Menüs <ulink url="help:/fundamentals/ui.html#menus-settings">Einstellungen</ulink> und <ulink url="help:/fundamentals/uihtml#menus-help">Hilfe</ulink> der &kde;-Grundlagen.

source: Many actions provided in the menu are also available in the context menus of the feed list, the article list and the article viewer.
de: Viele Aktionen im Menü sind auch in den Kontextmenüs der Artikelliste und der Artikelansicht erreichbar.

source: Credits and License
de: Danksagungen und Lizenz

source: Program copyright 2004-2010 Akregator authors
de: Program Copyright 2004-2010 Die Akregator-Autoren

source: Documentation copyright 2006 Frank Osterfeld <email>frank.osterfeld@kdemail.net</email>
de: Copyright der Dokumentation 2006 Frank Osterfeld <email>frank.osterfeld@kdemail.net</email>

source: Documentation copyright 2006 &Anne-Marie.Mahfouf; &Anne-Marie.Mahfouf.mail;
de: Copyright der Dokumentation 2006 &Anne-Marie.Mahfouf; &Anne-Marie.Mahfouf.mail;

source: CREDIT_FOR_TRANSLATORS
de: <para>Übersetzung: Arndt Braun <email>arndtbraun@googlemail.com</email></para>

source: How to obtain &akregator;
de: Wie Sie &akregator; erhalten

source: Compilation and installation
de: Kompilierung und Installation
