Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdepim/akregator.po
Languages: de

source: This feature uses &plasma;'s microblog service to help you to share news with your friends using the microblog services (identi.ca and twitter). The post will have the title of the article and a link to it
de: Diese Funktion benutzt den &plasma;-Mikroblogdienst, um Neuigkeiten mithilfe von Diensten wie <quote>identi.ca</quote> und <quote>twitter</quote> zu verbreiten. Die Posts enthalten den Titel des Artikels und eine Verknüpfung dazu.

source: <screeninfo>The Share Services tab</screeninfo>
de: <screeninfo>Die Karteikarte Veröffentlichungsdienste</screeninfo>

source: <phrase>The Share Services tab</phrase>
de: <phrase>Die Karteikarte Veröffentlichungsdienste</phrase>

source: Select a <guilabel>Service URL</guilabel> and enter your <guilabel>Username</guilabel> for this service.
de: Wählen Sie die <guilabel>Adresse des Dienstes</guilabel> und geben Sie Ihren <guilabel>Benutzername</guilabel>n für diesen Dienst ein.

source: <title>Archive</title>
de: <title>Archiv</title>

source: Archiving articles means storing the links of articles. Here you can limit the number of articles stored and the method used for archiving. These settings are global settings, used by all feeds within &akregator;. If you want to use a custom setting for a feed, you can set it in each feed properties dialog in the archive tab.
de: Das Archivieren von Artikeln ist das Abspeichern der Verknüpfungen und nicht der gesamten Artikel. Hier können die Anzahl und Methode der zu speichernden Artikel festgelegt werden. Diese Einstellungen sind globale Einstellungen, die alle Nachrichtenquellen von &akregator; betreffen. Falls Sie eine nachrichtenquellenspezifische Einstellung wünschen, können Sie dies über die Einstellungen der jeweiligen Nachrichtenquelle erledigen.

source: <screeninfo>The Archive tab</screeninfo>
de: <screeninfo>Die Karteikarte Archiv</screeninfo>

source: <phrase>The Archive tab</phrase>
de: <phrase>Die Karteikarte Archiv</phrase>

source: Default Archive Settings
de: Voreinstellungen für das Archiv

source: Keep all articles
de: Alle Artikel aufbewahren

source: All articles are kept forever.
de: Alle Nachrichten werden für immer aufbewahrt.

source: Limit feed archive size to:
de: Archivgröße begrenzen auf:

source: If the number of articles exceeds the chosen limit, the oldest articles are deleted. Note that flagged articles are ignored when counting the number of articles: if your limit is 500, and you have 510 unflagged and 50 flagged articles, &akregator; will ignore the 50 flagged ones and only delete the 10 oldest unflagged articles. So in this example, 550 articles would be kept.
de: Falls die Anzahl der Artikel das eingestellte Limit überschreitet, werden die überzähligen Artikel gelöscht. Bitte beachten Sie, dass markierte Artikel bei der Anzahl ignoriert werden, falls Sie also das Limit auf 500 Artikel gesetzt haben, 510 unmarkierte und 50 markierte Artikel, werden nur 10 Artikel gelöscht.

source: Delete articles older than:
de: Artikel löschen, die älter sind als:

source: Articles older than the specified number of days are deleted from the archive, unless they have the keep flag set. &akregator; checks for expired articles at startup and then once per hour, so expiry may be delayed.
de: Artikel, die älter als die angegebene Anzahl Tage sind, werden aus dem Archiv entfernt, es sei denn Sie wurden mit dem Markierung <quote>Behalten</quote> versehen. Die veralteten Artikel werden von &akregator; beim Start und stündlich geprüft, wodurch sich Verzögerungen ergeben können.

source: Disable archiving
de: Archivierung abschalten

source: No articles are stored - all articles are discarded when quitting &akregator;.
de: Die Artikel werden nicht gespeichert und alle Artikel beim Verlassen von &akregator; gelöscht.

source: Do not expire important articles
de: Wichtige Artikel nicht verfallen lassen

source: Right clicking on an article opens a context menu where you can mark this article as Important. Articles marked as Important will not expire, they will be kept.
de: Ein Rechtsklick auf den Artikel öffnet ein Kontextmenü, in dem Sie den Artikel als wichtig markieren können. Wichtige Artikel verfallen nicht und werden für immer gespeichert.

source: Appearance
de: Erscheinungsbild

source: On this page you can configure the appearance of the article viewer and the browser tabs. You can specify the colors, font sizes and families to be used.
de: Auf dieser Seite können Sie das Verhalten des Artikelbetrachters und der Browser-Reiter einstellen. Sie können Farben, Schriftgröße und Schriftfamilie einstellen.

source: <screeninfo>The Appearance tab</screeninfo>
de: <screeninfo>Die Karteikarte Erscheinungsbild</screeninfo>

source: <phrase>The Appearance tab</phrase>
de: <phrase>Die Karteikarte Erscheinungsbild</phrase>

source: Article List Colors
de: Farben der Artikelliste

source: Selecting <guilabel>Use custom colors</guilabel> allows you to select own colors for <guilabel>Unread articles</guilabel> and <guilabel>New articles</guilabel>
de: Aktivieren Sie <guilabel>Benutzerdefinierte Farben verwenden</guilabel>, dann können Sie die Farben für <guilabel>Ungelesene Artikel</guilabel> und <guilabel>Neue Artikel</guilabel> auswählen.

source: Font Size
de: Schriftgröße

source: Minimum font size
de: Minimale Schriftgröße

source: Set the minimum size for the article viewer
de: Einstellung der minimalen Schriftgröße für das Artikelfenster

source: Medium font size
de: Mittlere Schriftgröße

source: Set the default font size for the article viewer
de: Einstellung der voreingestellten Schriftgröße des Artikelfensters

source: Fonts
de: Schriftarten

source: Standard font:
de: Standardschriftart:

source: In the article viewer, the content is rendered using the Standard font in Medium font size. If you change the Standard font, the change will be applied in the article viewer.
de: Im Artikelfenster wird der Inhalt mit der Standardschriftart in der mittleren Größe dargestellt. Wenn Sie die Standardschrift ändern, ändert sich auch die Schrift im Artikelfenster.

source: Fixed font:
de: Schrift mit fester Breite:

source: If the article uses a fixed-width font in the article viewer, the content will be rendered using this font family in Medium font size.
de: Falls der Artikel eine Schriftart mit fester Breite verwendet, wird er mit dieser Schriftfamilie in mittlerer Größe dargestellt.

source: Serif font:
de: Serifenschrift:

source: If the article uses Serif fonts, they will be rendered using the family you choose here in Medium font size.
de: Falls der Artikel Serifenschriften nutzt, wird er mit dieser Schriftfamilie in mittlerer Größe dargestellt.

source: Sans serif font:
de: Serifenlose Schrift:

source: If the article uses Sans-serif fonts, they will be rendered using the family you choose here in Medium font size.
de: Falls der Artikel serifenlose Schriftarten benutzt, wird er mit der als mittleren Schriftart dargestellten Schrift dargestellt.

source: Underline links
de: Verknüpfungen unterstreichen

source: Check this if you want links to be underlined by default.
de: Markieren Sie dieses Feld, falls Sie wünschen, dass Verknüpfungen standardmäßig unterstrichen sind.

source: This tab allows you to customize the behavior of the internal browser tabs.
de: Auf dieser Seite können Sie das Verhalten der Reiter des internen Browsers zu einzurichten.

source: <screeninfo>The Browser tab</screeninfo>
de: <screeninfo>Die Karteikarte Browser</screeninfo>

source: <phrase>The Browser tab</phrase>
de: <phrase>Die Karteikarte Browser</phrase>

source: Left mouse click
de: Verhalten der linken Maustaste

source: You can choose three actions for the Left mouse click action: <guilabel>Open in Tab</guilabel> (open the link in a tab and put this tab in focus), <guilabel>Open in Background Tab</guilabel> (open the link in a tab but keep the current tab in focus) and <guilabel>Open in External Browser</guilabel> to open an article in a new window with your default browser.
de: Sie haben drei Möglichkeiten die linke Maustaste zu belegen: <guilabel>In neuem Unterfenster öffnen</guilabel>(Öffnet den aktuellen Artikel und stellt ihn in einem neuen obenstehenden Unterfenster dar), <guilabel>Unterfenster im Hintergrund öffnen</guilabel> (Öffnet den aktuellen Artikel und stellt ihn in einem hintenstehenden Unterfenster) und <guilabel>In externem Browser öffnen</guilabel> (Öffnet den aktuellen Artikel in einem externen Browser).

source: Middle mouse click
de: Verhalten der mittleren Maustaste

source: As above, you can set one of the three actions for the middle mouse click.
de: Wie obenstehend können Sie eine der drei Optionen der mittleren Maustaste zuweisen.

source: For External Browsing
de: In externem Browser betrachten

source: Use default web browser
de: Voreingestellten Webbrowser verwenden

source: If this is checked, &akregator; will use the web browser you set in &systemsettings;. It may be the &kde; default, &konqueror;, or another browser depending on what you set here.
de: Falls diese Option markiert ist, verwendet &akregator; den in den &systemsettings; festgelegten Webbrowser zur Darstellung des Artikels. Dies ist im Normalfall &konqueror;.

source: Use this command:
de: Diesen Befehl benutzen:

source: You can use another web browser for &akregator; other than your &kde; default. If you wish to do so, check this option and enter the command for the browser, provided it is in your $<envar>PATH</envar>.
de: Sie können auch einen anderen Webbrowser als den von &kde; verwendeten &konqueror; zur Anzeige von Artikeln in &akregator; nutzen. Falls Sie dies wünschen, markieren Sie diese Einstellung und geben Sie den korrekten Startbefehl Ihres Browsers mit dem Pfad <envar>PATH</envar> ein.

source: Show tab close button on hover
de: Knöpfe zum Schließen von Unterfenstern anzeigen

source: If this option is checked, the close button will appear when you move your mouse on the left side of the tab title so you can more easily close tabs.
de: Falls diese Aktion angewählt ist, erscheint bei dem Überstreichen des Reiters mit dem Mauszeiger ein Knopf zum Schließen des Reiters, sodass die Funktion zum Schließen des Unterfensters leichter erreicht werden kann.

source: Advanced
de: Erweitert

source: The Advanced tab allows you to set more advanced options. If you are not sure about their effect, you can just leave the default ones.
de: Der Karteireiter Erweitert ermöglicht die Einstellung fortgeschrittener Funktionen, sollte aber auch nur benutzt werden, wenn Sie wissen, was sie tun.

source: <screeninfo>The Advanced tab</screeninfo>
de: <screeninfo>Die Karteikarte Erweitert</screeninfo>

source: <phrase>The Advanced tab</phrase>
de: <phrase>Die Karteikarte Erweitert</phrase>

source: <guilabel>Archive</guilabel>
de: <guilabel>Archiv</guilabel>

source: Archive backend:
de: Archiv-Modus:

source: &akregator; currently only uses the Metakit database.
de: &akregator; nutzt momentan nur die Metakit-Datenbank.

source: Article List
de: Artikelliste

source: Mark selected article read after
de: Ausgewählten Artikel als gelesen markieren nach

source: Default is 0 seconds, which means that as soon as you click on an article it is marked as read. You can choose to mark any article as read after a specified number of seconds.
de: Der Standardwert beträgt 0 Sekunden, was bedeutet, dass sobald der Artikel angewählt wird, er auch als gelesen markiert wird. Es kann eine Zeit vorgegeben werden, nachdem alle Artikel als gelesen markiert werden.

source: Reset search bar when changing feeds
de: Schnellsuche beim Wechsel der Nachrichtenquelle zurücksetzen

source: This will clear the search bar when you change feed.
de: Hierdurch wird die Suche gelöscht, wenn die Nachrichtenquelle gewechselt wird.

source: Command Reference
de: Befehlsreferenz

source: Menus and Shortcut Keys
de: Menüs und Tasten für Kurzbefehle

source: The File Menu
de: Das Menü Datei

source: <guimenu>File</guimenu> <guimenuitem>Import feeds...</guimenuitem>
de: <guimenu>Datei</guimenu> <guimenuitem>Nachrichtenquellen importieren ...</guimenuitem>

source: <action>Open</action> the import feeds dialog to load <quote>OPML Outlines</quote> with feed subscriptions.
de: <action>Öffnet</action> den Dialog zum Import von Nachrichtenquellen, um <quote>OPML-Gliederungen</quote> mit Abonnements für Nachrichtenquellen zu Laden.

source: <guimenu>File</guimenu> <guimenuitem>Export feeds...</guimenuitem>
de: <guimenu>Datei</guimenu> <guimenuitem>Nachrichtenquellen exportieren ...</guimenuitem>

source: <action>Open</action> the save as dialog and export your feeds and folder structure as <filename class="extension">.opml</filename> file.
de: <action>Öffnet</action> einen Speicherdialog, um Ihre Nachrichtenquellen und Ordnerstruktur als Datei im Format <filename class="extension">.opml</filename> zu exportieren.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Quit</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo> </shortcut> <guimenu>Datei</guimenu> <guimenuitem>Beenden</guimenuitem>

source: <action>Quit</action> &akregator;
de: <action>Beendet</action> &akregator;

source: The Edit Menu
de: Das Menü Bearbeiten

source: <shortcut> <keycap>F2</keycap> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Edit Feed...</guimenuitem>
de: <shortcut> <keycap>F2</keycap> </shortcut> <guimenu>Bearbeiten</guimenu> <guimenuitem>Nachrichtenquelle bearbeiten ...</guimenuitem>

source: <action>Edit</action> current feed to change its properties in the Properties dialog
de: <action>Bearbeiten</action> der aktuellen Nachrichtenquelle und deren Einstellungen in dem Einstellungsdialog

source: <shortcut> <keycombo action="simul">&Alt;<keycap>Del</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Delete feed</guimenuitem>
de: <shortcut> <keycombo action="simul">&Alt;<keycap>Entf</keycap></keycombo> </shortcut> <guimenu>Bearbeiten</guimenu> <guimenuitem>Nachrichtenquelle löschen</guimenuitem>

source: <action>Delete</action> current feed
de: <action>Entfernt</action> die ausgewählte Nachrichtenquelle

source: The View Menu
de: Das Menü Ansicht

source: <menuchoice><shortcut><keycombo action="simul">&Ctrl;&Shift;<keycap>1</keycap></keycombo></shortcut> <guimenu>View</guimenu><guimenuitem>Normal View</guimenuitem></menuchoice>, <menuchoice><shortcut><keycombo action="simul">&Ctrl;&Shift;<keycap>2</keycap></keycombo></shortcut> <guimenu>View</guimenu><guimenuitem>Widescreen View</guimenuitem> </menuchoice> and <menuchoice><shortcut><keycombo action="simul">&Ctrl;&Shift;<keycap>3</keycap></keycombo></shortcut> <guimenu>View</guimenu><guimenuitem>Combined View</guimenuitem> </menuchoice>
de: <menuchoice><shortcut><keycombo action="simul">&Ctrl;&Shift;<keycap>1</keycap></keycombo></shortcut> <guimenu>Ansicht</guimenu><guimenuitem>Normale Ansicht</guimenuitem></menuchoice>, <menuchoice><shortcut><keycombo action="simul">&Ctrl;&Shift;<keycap>2</keycap></keycombo></shortcut> <guimenu>Ansicht</guimenu><guimenuitem>Breite Ansicht</guimenuitem> </menuchoice> und <menuchoice><shortcut><keycombo action="simul">&Ctrl;&Shift;<keycap>3</keycap></keycombo></shortcut> <guimenu>Ansicht</guimenu><guimenuitem>Kombinierte Ansicht</guimenuitem> </menuchoice>

source: <action>Choose</action> the View Mode for &akregator;
de: <action>Wahl</action> der Ansicht von &akregator;

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>+</keycap></keycombo></shortcut> <guimenu>View</guimenu> <guimenuitem>Enlarge Font</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>+</keycap></keycombo></shortcut> <guimenu>Ansicht</guimenu><guimenuitem>Schrift vergrößern</guimenuitem>

source: <action>Increase</action> the font size in the article viewer
de: <action>Vergrößern</action> der Schriftgröße

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>-</keycap></keycombo></shortcut> <guimenu>View</guimenu> <guimenuitem>Shrink Font</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>-</keycap></keycombo></shortcut> <guimenu>Ansicht</guimenu> <guimenuitem>Schrift verkleinern</guimenuitem>

source: <action>Decrease</action> the font size in the article viewer
de: <action>Verkleinern</action> der Schriftgröße

source: The Go Menu
de: Das Menü Gehe zu

source: <shortcut><keycap>Left</keycap></shortcut> <guimenu>Go</guimenu> <guimenuitem>Previous Article</guimenuitem>
de: <shortcut><keycap>Pfeil links</keycap></shortcut> <guimenu>Gehe zu</guimenu> <guimenuitem>Vorheriger Artikel</guimenuitem>

source: <action>Go</action> to the previous article in the article list
de: <action>Gehe</action> zu dem letzten Artikel in der Nachrichtenliste

source: <shortcut><keycap>-</keycap></shortcut> <guimenu>Go</guimenu> <guimenuitem>Previous Unread Article</guimenuitem>
de: <shortcut><keycap>-</keycap></shortcut> <guimenu>Gehe zu</guimenu> <guimenuitem>Vorheriger ungelesener Artikel</guimenuitem>

source: <action>Go</action> to the previous unread article in the article list
de: <action>Gehe</action> zu dem letzten ungelesenen Artikel in der Nachrichtenliste

source: <shortcut><keycap>Right</keycap></shortcut> <guimenu>Go</guimenu> <guimenuitem>Next Article</guimenuitem>
de: <shortcut><keycap>Pfeil rechts</keycap></shortcut> <guimenu>Gehe zu</guimenu> <guimenuitem>Nächster Artikel</guimenuitem>

source: <action>Go</action> to the next article in the article list
de: <action>Gehe</action> zu dem nächsten Artikel

source: <shortcut><keycap>+</keycap></shortcut> <guimenu>Go</guimenu> <guimenuitem>Next Unread Article</guimenuitem>
de: <shortcut><keycap>+</keycap></shortcut> <guimenu>Gehe zu</guimenu> <guimenuitem>Nächster ungelesener Artikel</guimenuitem>

source: <action>Go</action> to the next unread article in the article list
de: <action>Gehe</action> zu dem nächsten ungelesenen Artikel in der Artikelliste

source: <shortcut><keycap>P</keycap></shortcut> <guimenu>Go</guimenu> <guimenuitem>Previous Feed</guimenuitem>
de: <shortcut><keycap>P</keycap></shortcut> <guimenu>Gehe zu</guimenu> <guimenuitem>Vorherige Nachrichtenquelle</guimenuitem>

source: <action>Go</action> to the previous feed in the feed list
de: <action>Gehe</action> zu der vorherigen Nachrichtenquelle in der Nachrichtenquellenliste

source: <shortcut><keycombo action="simul">&Alt;<keycap>-</keycap></keycombo></shortcut> <guimenu>Go</guimenu> <guimenuitem>Previous Unread Feed</guimenuitem>
de: <shortcut><keycombo action="simul">&Alt;<keycap>-</keycap></keycombo></shortcut> <guimenu>Gehe zu</guimenu> <guimenuitem>Vorherige ungelesene Nachrichtenquelle</guimenuitem>

source: <action>Go</action> to the previous unread feed in the feed list
de: <action>Gehe</action> zu der nächsten ungelesenen Nachrichtenquelle in der Nachrichtenquellenliste

source: <shortcut><keycap>N</keycap></shortcut> <guimenu>Go</guimenu> <guimenuitem>Next Feed</guimenuitem>
de: <shortcut><keycap>N</keycap></shortcut> <guimenu>Gehe zu</guimenu> <guimenuitem>Nächste Nachrichtenquelle</guimenuitem>

source: <action>Go</action> to the next feed in the feed list
de: <action>Gehe</action> zu der nächsten Nachrichtenquelle in der Nachrichtenquellenliste

source: <shortcut><keycombo action="simul">&Alt;<keycap>+</keycap></keycombo></shortcut> <guimenu>Go</guimenu> <guimenuitem>Next Unread Feed</guimenuitem>
de: <shortcut><keycombo action="simul">&Alt;<keycap>+</keycap></keycombo></shortcut> <guimenu>Gehe</guimenu> <guimenuitem>Nächste ungelesene Nachrichtenquelle</guimenuitem>

source: <action>Go</action> to the next unread feed in the feed list
de: <action>Gehe</action> zu der nächsten ungelesenen Nachrichtenquelle in der Nachrichtenquellenliste

source: The Feed Menu
de: Das Menü Nachrichtenquelle

source: <shortcut><keycap>Ins</keycap></shortcut> <guimenu>Feed</guimenu> <guimenuitem>Add Feed...</guimenuitem>
de: <shortcut><keycap>Einfg</keycap></shortcut> <guimenu>Nachrichtenquelle</guimenu> <guimenuitem>Nachrichtenquelle hinzufügen ...</guimenuitem>

source: <action>Open</action> the Add Feed dialog
de: <action>Hinzufügen</action> einer Nachrichtenquelle

source: <shortcut><keycombo action="simul">&Shift;<keycap>Ins</keycap></keycombo></shortcut> <guimenu>Feed</guimenu> <guimenuitem>New Folder...</guimenuitem>
de: <shortcut><keycombo action="simul">&Shift;<keycap>Einfg</keycap></keycombo></shortcut> <guimenu>Nachrichtenquelle</guimenu> <guimenuitem>Neuer Ordner ...</guimenuitem>

source: <action>Open</action> the Add Folder dialog
de: <action>Anlegen</action> eines neuen Ordners

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>R</keycap></keycombo></shortcut> <guimenu>Feed</guimenu> <guimenuitem>Mark Feed as Read</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>R</keycap></keycombo></shortcut> <guimenu>Nachrichtenquelle</guimenu> <guimenuitem>Nachrichtenquelle als gelesen markieren</guimenuitem>

source: <action>Mark</action> the current feed as read
de: <action>Markieren</action> der aktuellen Nachrichtenquelle als gelesen

source: <shortcut><keycombo action="simul">&Ctrl; &Shift;<keycap>R</keycap></keycombo></shortcut> <guimenu>Feed</guimenu> <guimenuitem>Mark All Feeds as Read</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl; &Shift;<keycap>R</keycap></keycombo></shortcut> <guimenu>Nachrichtenquelle</guimenu> <guimenuitem>Alle Nachrichtenquellen als gelesen markieren</guimenuitem>

source: <action>Mark</action> all feeds as already read
de: <action>Markieren</action> aller Nachrichtenquellen als gelesen

source: <shortcut><keycap>F5</keycap></shortcut> <guimenu>Feed</guimenu> <guimenuitem>Fetch Feed</guimenuitem>
de: <shortcut><keycap>F5</keycap></shortcut> <guimenu>Nachrichtenquelle</guimenu> <guimenuitem>Nachrichtenquelle abholen</guimenuitem>

source: <action>Fetch</action> the current feed
de: <action>Abholen</action> der aktuellen Nachrichtenquelle

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>L</keycap></keycombo></shortcut> <guimenu>Feed</guimenu> <guimenuitem>Fetch All Feeds</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>L</keycap></keycombo></shortcut> <guimenu>Nachrichtenquelle</guimenu> <guimenuitem>Alle Nachrichtenquelle abholen</guimenuitem>

source: <action>Fetch</action> all feeds
de: <action>Abholen</action> aller Nachrichtenquellen

source: <shortcut><keycap>Esc</keycap></shortcut> <guimenu>Feed</guimenu> <guimenuitem>Abort Fetches</guimenuitem>
de: <shortcut><keycap>Esc</keycap></shortcut> <guimenu>Nachrichtenquelle</guimenu> <guimenuitem>Abholen von Nachrichten abbrechen</guimenuitem>

source: <action>Stop</action> &akregator; fetching feeds
de: <action>Abbrechen</action> des Abholens von Nachrichtenquellen

source: The Article Menu
de: Das Menu Artikel

source: <shortcut><keycombo action="simul">&Shift;<keycap>Return</keycap></keycombo></shortcut> <guimenu>Article</guimenu> <guimenuitem>Open in Tab</guimenuitem>
de: <shortcut><keycombo action="simul">&Shift;<keycap>Eingabe</keycap></keycombo></shortcut> <guimenu>Artikel</guimenu> <guimenuitem>In neuem Unterfenster öffnen</guimenuitem>

source: <action>Open</action> the current article in a tab within &akregator;
de: <action>Öffnen</action> des aktuellen Artikels in einem separatem eingebettetem Fenster innerhalb von &akregator;

source: <shortcut><keycap>Return</keycap></shortcut> <guimenu>Article</guimenu> <guimenuitem>Open in Background Tab</guimenuitem>
de: <shortcut><keycap>Eingabe</keycap></shortcut> <guimenu>Artikel</guimenu> <guimenuitem>In Unterfenster im Hintergrund öffnen</guimenuitem>
