Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdepim/akregator.po
Languages: de

source: The &akregator; Handbook
de: Das Handbuch zu &akregator;

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Arndt</firstname><surname>Braun</surname><affiliation><address><email>arndtbraun@googlemail.com</email></address></affiliation><contrib>Übersetzung</contrib></othercredit>

source: &akregator; is a program to read <acronym>RSS</acronym> and other online news feeds.
de: &akregator; ist ein Programm zum Lesen von <acronym>RSS-</acronym> und anderen Nachrichtenquellen.

source: Introduction
de: Einführung

source: What is &akregator;?
de: Wozu dient &akregator;?

source: &akregator; is a &kde; application for reading online news feeds. It has a powerful, user-friendly interface for reading feeds and the management of them.
de: &akregator; ist eine &kde;-Anwendung zum Lesen von Online-Nachrichten. &akregator; bietet eine vielseitige und benutzerfreundliche Oberfläche zum Lesen und Verwalten von Artikeln aus unterschiedlichen Nachrichtenquellen.

source: &akregator; is a lightweight and fast program for displaying news items provided by feeds, supporting all commonly-used versions of <acronym>RSS</acronym> and Atom feeds. Its interface is similar to those of e-mail programs, thus hopefully being very familiar to the user. Useful features include searching within article titles, management of feeds in folders and setting archiving preferences. Feeds can be displayed in a similar manner to e-mails. Websites related to a feed can be shown in &akregator;'s embedded browser or, at the users' choice, opened in an external browser.
de: &akregator; ist ein kompaktes und schnelles Programm zur Darstellung von Nachrichten aus Nachrichtenquellen, es werden alle Versionen von RSS und Atom-Quellen unterstützt. Die Oberflächengestaltung ist an die von E-Mail Programmen angelehnt, wodurch es für den Benutzer leicht zu erlernen sein sollte. Hilfreiche Funktionen wie die Artikelsuche, das Einsortieren von Nachrichtenquellen in Ordnern und Archivierungsoptionen. Nachrichtenquellen können ähnlich wie E-Mails dargestellt werden. Zu einer Nachricht gehörige Internetseiten können im integrierten Browser oder einem Browser der Wahl im eigenen Fenster dargestellt werden.

source: <acronym>RSS</acronym> and Atom feeds
de: <acronym>RSS-</acronym> und Atom-Nachrichtenquellen

source: <acronym>RSS</acronym> (Really Simple Syndication) is an &XML;-based format used for publishing news or articles in a machine-readable form. An <acronym>RSS</acronym> or Atom file is also called a feed. A program that can be used to read such feeds is called a feed reader or aggregator, hence the title of the application, &akregator;.
de: <acronym>RSS</acronym> (Really Simple Syndication, was auf Deutsch <quote>Wirklich einfache überregionale Verbreitung</quote> bedeutet) ist ein &XML;-basiertes Format, das bei der Nachrichtenveröffentlichung in maschinenlesbarer Form genutzt wird. Eine <acronym>RSS</acronym>- oder Atom-Datei wird auch als Datenstrom bezeichnet. Ein Programm zum Lesen der Nachrichten wird auch als Datenstromleser oder Sammler bezeichnet, woher auch der Name der Anwendung &akregator; stammt.

source: &akregator; automatically extracts new items from the feed and displays them in a human-friendly form to the user. The user can therefore save time with regularly-visited websites, as they need no longer manually check whether there are new pieces of information available.
de: &akregator; extrahiert automatisch die Nachrichten aus dem Datenstrom und stellt sie in einer benutzerfreundlichen Weise dar. Der Benutzer kann sich hierdurch die Prüfung auf Neuigkeiten von oft besuchten Internetseiten ersparen, da &akregator; ihn auf Änderungen hinweist.

source: <acronym>RSS</acronym> is available in different versions which are not compatible with each other (this situation caused by competing companies): <acronym>RSS</acronym> 0.9, <acronym>RSS</acronym> 1.0 and <acronym>RSS</acronym> 2.0. Atom is also an &XML;-based feed language which has been redesigned to fit the needs of webloggers and news sites. Atom attempts to replace <acronym>RSS</acronym> feeds and remove the uncertainty with incompatibilities in the different <acronym>RSS</acronym> versions.
de: <acronym>RSS</acronym> gibt es in nicht immer untereinander kompatiblen Versionen (dieser Umstand ist durch die Arbeit konkurrierender Unternehmen bedingt): <acronym>RSS</acronym> 0.9, <acronym>RSS</acronym> 1.0 und <acronym>RSS</acronym> 2.0. Atom ist ein ebenfalls &XML;-basiertes Format, das den Bedürfnissen von Bloggern und Nachrichtenseiten angepasst wurde. Atom tritt an, um die <acronym>RSS</acronym>-Datenströme zu ersetzen und den leidigen Inkompatibilitäten in den verschiedenen <acronym>RSS</acronym>-Versionen ein Ende zu bereiten.

source: Quick Start to &akregator;
de: Schnellstart für &akregator;

source: This section describes how to start using &akregator;. It explains the user interface and shows you how to add your own feed to the list. This section is particularly interesting if you are not yet familiar with the general <acronym>RSS</acronym>/Atom and feed aggregator concept.
de: In diesem Kapitel wird die Bedienung von &akregator; erläutert. Es wird die Benutzeroberfläche, das Lesen von Artikeln und das Einbinden von Nachrichtenquellen erklärt. Dieses Kapitel wendet sich hauptsächlich an Personen, die nicht im Umgang mit <acronym>RSS</acronym>- und Atom-Nachrichten vertraut sind.

source: The Main Window
de: Das Hauptfenster

source: When you first start &akregator;, you see its main window:
de: Beim ersten Start von &akregator; sehen Sie das Hauptfenster.

source: <screeninfo>&akregator; main window</screeninfo>
de: <screeninfo>Hauptfenster von &akregator;</screeninfo>

source: <phrase>&akregator; main window</phrase>
de: <phrase>Hauptfenster von &akregator;</phrase>

source: The main window consists of the feed list, the article list and the article viewer.
de: Das Hauptfenster besteht aus der Nachrichtenquellenliste, der Artikelliste und der Artikeldarstellung.

source: The feed list is on the left. In the tree, you have news feeds you can select. A news feed is a collection of articles: for example, the recent news of a news site or the new entries of a blog. The default list contains feeds related to the &kde; project, but of course you can add your own feeds and remove the ones you are not interested in.
de: Die Nachrichtenquellenliste befindet sich auf der linken Seite. In der Baumansicht können die Nachrichtenquellen angewählt werden. Eine Nachrichtenquelle stellt eine Sammlung von Artikeln dar, z. B. die neuesten Nachrichten einer Internetseite oder die aktuellsten Einträge eines Blogs. Die Standardeinstellung beinhaltet die zum &kde;-Projekt gehörigen Nachrichtenquellen, aber es können selbstverständlich noch andere Nachrichtenquellen hinzugefügt oder die entfernt werden, die nicht von Interesse sind.

source: <screeninfo>All articles are fetched</screeninfo>
de: <screeninfo>Alle Artikel wurden heruntergeladen</screeninfo>

source: <phrase>All articles are fetched</phrase>
de: <phrase>Alle Artikel wurden heruntergeladen</phrase>

source: In the upper right is the article list. It contains all the articles of the feed selected in the feed list (if it is empty, you must first fetch the feed). The list shows the headlines of the articles and the date when they were published. By default, the newest articles are at the top.
de: In der oberen rechten Hälfte des Hauptfensters befindet sich die Artikelliste. Die Artikelliste beinhaltet alle Artikel der aktuell angewählten Nachrichtenquelle (Falls die Liste keine Artikel enthält, müssen diese erst abgeholt werden). Die Liste zeigt die Überschriften und das Veröffentlichungsdatum der Artikel. In der Standardeinstellung befindet sich der neuste Artikel ganz oben.

source: The article list
de: Die Artikelliste

source: The article list for one feed
de: Die Artikelliste für einen Datenstrom

source: If you select an article, it will be displayed in the article viewer in the lower right of the window. Depending on the feed, it contains either only a headline, a short summary, or the complete article content.
de: Sobald ein Artikel aus der Artikelliste angewählt wird, stellt &akregator; ihn in der unteren rechten Hälfte dar. Abhängig von dem ausgewählten Artikel sehen Sie nun eine Überschrift, eine Kurzbeschreibung oder gleich den kompletten Artikel.

source: <screeninfo>Reading an article from Planet &kde;</screeninfo>
de: <screeninfo>Lesen eines Artikels von Planet &kde;</screeninfo>

source: <phrase>Reading an article from Planet &kde;</phrase>
de: <phrase>Lesen eines Artikels von Planet &kde;</phrase>

source: Adding a feed
de: Hinzufügen einer Nachrichtenquelle

source: &akregator; provides you with some default feeds related to &kde; - of course, you probably want to add your own feeds. Good candidates are the news sites you visit regularly.
de: &akregator; bietet Ihnen standardmäßig mehrere Standardnachrichtenquellen, die mit dem &kde;-Projekt zu tun haben, aber höchstwahrscheinlich wollen Sie ihre eigenen Nachrichtenquellen hinzufügen. Gute Kandidaten hierfür stellen die von Ihnen häufig besuchten Internetseiten dar.

source: Go to the menu <guimenu>Feed</guimenu> and choose <guimenuitem>Add Feed...</guimenuitem> or use the default keyboard shortcut (<keycap>Ins</keycap>). The following dialog appears, with an input line labeled <guilabel>Feed URL:</guilabel>.
de: Gehen Sie in das Menü <guimenu>Nachrichtenquelle</guimenu> und wählen Sie <guimenuitem>Nachrichtenquelle hinzufügen ...</guimenuitem>, oder benutzen Sie das jeweilige Tastaturkürzel (<keycap>Einfg</keycap>). Das folgende Fenster mit einem <guilabel>Adresse der Nachrichtenquelle:</guilabel> beschrifteten Eingabefeld öffnet sich.

source: <screeninfo>Add a new feed</screeninfo>
de: <screeninfo>Hinzufügen einer neuen Nachrichtenquelle</screeninfo>

source: <phrase>Add a new feed</phrase>
de: <phrase>Hinzufügen einer neuen Nachrichtenquelle</phrase>

source: Enter <userinput>www.slashdot.org</userinput> or <userinput>http://www.slashdot.org </userinput> in the line edit next to <guilabel>Feed URL</guilabel> and click <guibutton>OK</guibutton>.
de: Geben Sie nun <userinput>www.slashdot.org</userinput> oder <userinput>http://www.slashdot.org</userinput> in das Eingabefeld ein und klicken Sie auf <guibutton>OK</guibutton>.

source: The feed settings dialog appears and you can modify the default options. When you are happy with the feed settings, click <guibutton>OK</guibutton> again.
de: Es öffnet sich ein Fenster zur Einrichtung der Nachrichtenquelle, in dem die Standardeinstellungen geändert werden können. Wenn Sie mit den Standardeinstellungen zufrieden sind, klicken Sie wieder auf <guibutton>OK</guibutton>.

source: <screeninfo>The feed properties dialog</screeninfo>
de: <screeninfo>Der Dialog zur Einstellung der Nachrichtenquellen</screeninfo>

source: <phrase>The feed properties dialog</phrase>
de: <phrase>Der Dialog zur Einstellung der Nachrichtenquellen</phrase>

source: Now Slashdot has been added to your feed list.
de: Die Nachrichtenquelle Slashdot wurde zu Ihrer Nachrichtenquellenliste hinzugefügt.

source: There are multiple other ways to find and add interesting feeds. Within &kde;, websites browsed with &konqueror; will display the recognizable &quot;RSS&quot; icon <inlinemediaobject> <imageobject> <imagedata fileref="feed.png" format="PNG"/> </imageobject> </inlinemediaobject>in the bottom-right if a compatible news feed is detected at the website. Just left-click on the icon and choose <guimenuitem>Add Feed to &akregator;</guimenuitem>: <screenshot> <screeninfo>Automatically finding feeds through &konqueror;</screeninfo> <mediaobject> <imageobject><imagedata fileref="konq2.png" format="PNG"/></imageobject> <textobject><phrase>Automatically finding feeds through &konqueror;</phrase></textobject> </mediaobject> </screenshot> On pages with this &quot;RSS&quot; or this icon<inlinemediaobject> <imageobject> <imagedata fileref="rss.png" format="PNG"/> </imageobject> </inlinemediaobject>, right-click on the icon and choose in the context menu <guimenuitem>Copy Link Address</guimenuitem>:
de: Es gibt viele andere Möglichkeiten, um interessante Nachrichtenquellen hinzuzufügen. Wenn Internetseiten eine RSS-Nachrichtenquelle besitzen, wird dies in &konqueror; mit dem gut sichtbaren <inlinemediaobject> <imageobject> <imagedata fileref="feed.png" format="PNG"/> </imageobject> </inlinemediaobject> <quote>RSS</quote>-Symbol in der unteren rechten Ecke von &konqueror; angezeigt.<inlinemediaobject> <imageobject> <imagedata fileref="rss3.png" format="PNG"/> </imageobject> </inlinemediaobject>Durch klicken auf das Symbol und anwählen von <guimenuitem>Nachrichtenquelle zu &akregator; hinzufügen</guimenuitem><screenshot> <screeninfo> Automatisches einfügen von Nachrichtenquellen mittels &konqueror;</screeninfo> <mediaobject> <imageobject><imagedata fileref="konq2.png" format="PNG"/></imageobject> <textobject><phrase>Automatisches einfügen von Nachrichtenquellen mittels &konqueror;</phrase></textobject> </mediaobject> </screenshot> Auf Seiten mit &quot;RSS&quot; oder dem Symbol<inlinemediaobject> <imageobject> <imagedata fileref="rss.png" format="PNG"/> </imageobject> </inlinemediaobject>, klicken Sie mit der rechten Maustaste auf das Symbol und wählen Sie dann im Kontextmenü <guimenuitem>Verknüpfungsadresse kopieren</guimenuitem>:

source: <screeninfo>Automatically finding feeds through &konqueror;</screeninfo>
de: <screeninfo>Automatisches Auffinden von Nachrichtenquellen mittels &konqueror;</screeninfo>

source: <phrase>Automatically finding feeds through &konqueror;</phrase>
de: <phrase>Automatisches Auffinden von Nachrichtenquellen mittels &konqueror;</phrase>

source: Switch to &akregator;, select <guimenuitem>Add Feed...</guimenuitem> and the <guilabel>Feed URL</guilabel> is filled out with the link address.
de: Wechseln Sie zu &akregator;, wählen Sie <guimenuitem>Nachrichtenquelle hinzufügen</guimenuitem> und die <guilabel>Adresse der Nachrichtenquelle</guilabel> wird mit der Verknüpfungsadresse ausgefüllt.

source: All feeds added using this procedures appear under <guilabel>Imported Feeds</guilabel> folder in the feed list, and from there you can use your mouse to drag it to a different folder.
de: Alle mit dieser Methode hinzugefügten Nachrichtenquellen werden im Ordner <guilabel>Importierte Nachrichtenquellen</guilabel> in der Liste der Nachrichtenquellen angezeigt. Sie können sie von dort mit der Maus in andere Ordner verschieben.

source: Creating a Folder
de: Anlegen eines Ordners

source: After adding your own feeds, you may want to group them in some way, rather than just leave them unsorted. So let us create a folder for the Slashdot feed we just added:
de: Nachdem Sie nun eine Nachrichtenquelle hinzugefügt haben, besteht evtl. das Bedürfnis mehrere Nachrichtenquellen zu gruppieren. Im folgenden erstellen Sie einen Ordner, in den Sie die Nachrichtenquelle Slashdot einsortieren.

source: Select the parent folder of the new folder. In this example, we select <guilabel>All Feeds</guilabel>.
de: Wählen Sie den Stammordner des neuen Ordners: In diesem Beispiel wählen Sie <guilabel>Alle Nachrichtenquellen</guilabel>.

source: Open <menuchoice><guimenu>Feed</guimenu> <guimenuitem>New Folder...</guimenuitem></menuchoice>. Enter <userinput>News</userinput> (or a more appropriate name for the feed category) in the line edit and choose <guibutton>OK</guibutton>.
de: Wählen Sie im Menü <menuchoice><guimenu>Nachrichtenquellen</guimenu><guimenuitem>Neuer Ordner ...</guimenuitem></menuchoice> Geben Sie <userinput>Nachrichten</userinput> (oder einen anderen treffenden Namen für die Nachrichtenquelle) in das Eingabefeld ein und klicken Sie auf <guibutton>OK</guibutton>.

source: <screeninfo>The New Folder dialog</screeninfo>
de: <screeninfo>Der Dialog Neuer Ordner</screeninfo>

source: <phrase>The New Folder dialog</phrase>
de: <phrase>Der Dialog Neuer Ordner</phrase>

source: Now you can drag the Slashdot feed to the new folder.
de: Jetzt können Sie die Nachrichtenquelle Slashdot in den neuen Ordner ziehen.

source: <screeninfo>The News folder in the feed list</screeninfo>
de: <screeninfo>Der Nachrichtenordner in der Nachrichtenquellenliste</screeninfo>

source: <phrase>The News folder in the feed list</phrase>
de: <phrase>Der Nachrichtenordner in der Nachrichtenquellenliste</phrase>

source: Browsing inside of &akregator;
de: Browsernutzung innerhalb von &akregator;

source: When reading feed articles, often you may want to read the web page that belongs to the article: some articles only contain the headline, and not the actual content. In this case, you need to visit the web page to read the complete article. Or perhaps an article links to some website, or you are reading a blog and want to comment on an entry. For these situations, &akregator; contains a simple web browser. Whenever you follow a link in the article viewer, by default &akregator; opens the link in new tab.
de: Wenn Sie Artikel aus einer Nachrichtenquelle lesen, kann es oft passieren, dass Sie direkt die betreffende Webseite aufrufen möchten, da manche Artikel nur aus der Überschrift ohne Textkörper bestehen. In diesem Fall benötigen Sie einen Internetbrowser, um den gesamten Inhalt darstellen zu können. Manchmal kann es auch passieren, dass Sie z. B. einen Blog-Eintrag kommentieren wollen, wozu Sie auch einen Internetbrowser benötigen. Für solche und ähnliche Fälle beinhaltet &akregator; einen vereinfachten Internetbrowser. Immer wenn Sie auf eine Verknüpfung klicken, wird diese als neue Karteikarte durch den integrierten Internetbrowser dargestellt:

source: Note that the browser in &akregator; is not intended to replace your favorite Web Browser. It is meant for reading articles, commenting on them, or following up a link quickly. It is not meant for browsing the web in general. It lacks many features fully-fledged web browsers offer.
de: Bitte bedenken Sie, dass der in &akregator; integrierte Internetbrowser nicht als Ersatz für Ihren Standardbrowser gedacht ist. Er ist nur zum Lesen, Kommentieren oder dem schnellen Folgen von Verknüpfungen geeignet. Er ist nicht als genereller Internetbrowser gedacht. Der integrierte Browser verfügt längst nicht über alle Möglichkeiten eines normalen Browsers.

source: Configuring &akregator;
de: Anpassung von &akregator;

source: Most of &akregator;'s options are listed in the &akregator; configuration dialog. The configuration dialog can be found in the menu under <menuchoice> <guimenu>Settings</guimenu><guimenuitem>Configure &akregator;...</guimenuitem> </menuchoice>
de: Die meisten Einstellungen von &akregator; befinden sich im Einstellungsdialog. Der Einstellungsdialog kann im Menü unter dem Punkt <menuchoice> <guimenu>Einstellungen</guimenu><guimenuitem>&akregator; einrichten ...</guimenuitem> </menuchoice> gefunden werden.

source: General
de: Allgemein

source: The General tab contains the basic and otherwise-uncategorizable options of &akregator;.
de: Das Hauptfenster beinhaltet die Grund- und sonst nicht zuordnungsbaren Optionen von &akregator;.

source: <screeninfo>The General tab</screeninfo>
de: <screeninfo>Die Karteikarte Allgemein</screeninfo>

source: <phrase>The General tab</phrase>
de: <phrase>Die Karteikarte Allgemein</phrase>

source: Global
de: Allgemein

source: Show tray icon
de: Symbol im Systembereich der Kontrollleiste anzeigen

source: Display the &akregator; icon in the systray.
de: Anzeigen des &akregator;-Symbols im Systembereich.

source: Use notifications for all feeds
de: Benachrichtigungen für alle Nachrichtenquellen benutzen

source: Set global notifications for all feeds. This setting will override the individual notification value of each feed. When enabled, &akregator; will notify you of all new articles fetched in any feed. If you only want to enable notifications for some (but not all) feeds, leave this option disabled and enable notifications for each specific feed using the individual feed properties dialog.
de: Einschalten von globalen Benachrichtigungen für alle Nachrichtenquellen. Diese Option überschreibt die individuell für jede Nachrichtenquelle ausgegebenen Benachrichtigungen. Falls diese Option in &akregator; eingeschaltet ist, werden Sie über alle neuen Nachrichten benachrichtigt. Falls Sie nur die Benachrichtigungen für einige Nachrichtenquellen aktivieren wollen, sollten Sie diese Option nicht nutzen, sondern es sollten individuelle Benachrichtigungen für jede Nachrichtenquelle aktiviert werden.

source: Use interval fetching
de: In Intervallen abholen

source: If this is unchecked, interval checking is disabled. However, if this is checked, you can set in <guilabel>Fetch feeds every:</guilabel> the interval that &akregator; will automatically check for new feed entries. Note that fetching articles generates traffic and therefore may be costly to the provider hosting the feed you're reading. Some sites may even block connections from your computer if you attempt to fetch the feed too often. In general, 30 minutes is a good choice.
de: Falls diese Option nicht angewählt ist, wird die periodische Artikelabholung nicht durchgeführt. Falls sie aktiviert ist, können Sie im Eingabefeld <guilabel>Überprüfen der Nachrichtenquelle alle:</guilabel> XX Minuten das Intervall zur Artikelabholung festlegen. Bitte beachten Sie, dass die Artikelabholung Netzwerklast und damit evtl Kosten erzeugt. Manche Nachrichtenquellen verhindern allerdings aus Sicherheitsgründen das Abholen von Nachrichten in zu kurzen Intervallen. Ein Wert von 30 Minuten ist eine gute Wahl.

source: Fetch feeds every:
de: Abholen der Nachrichtenquellen alle:

source: This is enabled when <guilabel>Use interval fetching</guilabel> is checked. You can specify a time interval, after which feeds are checked for new articles. Default is 30 minutes.
de: Diese Einstellung ist aktiv, wenn das Ankreuzfeld <guilabel>In Intervallen abholen</guilabel> aktiviert ist. Es kann ein Intervall festgelegt werden, in dem die Artikel abgerufen werden. Die Voreinstellung ist 30 min.

source: Startup
de: Programmstart

source: Mark all feeds as read on startup
de: Alle Nachrichtenquellen beim Programmstart als gelesen markieren

source: When enabled, &akregator; marks all articles as read when started.
de: Wenn diese Option aktiviert ist, markiert &akregator; alle Nachrichten beim Start als gelesen.

source: Fetch all feeds on startup
de: Alle Nachrichtenquellen beim Programmstart überprüfen

source: When enabled, &akregator; fetches all feeds right after start.
de: Wenn diese Option aktiviert ist, ruft &akregator; alle Nachrichten beim Start ab.

source: Network
de: Netzwerk

source: Use the browser cache (less network traffic)
de: Browser-Zwischenspeicher verwenden (reduziert den Netzwerkverkehr)

source: When enabled, the &kde;-wide browser cache settings are used when updating feeds. You can configure the &kde;-wide browser cache in &konqueror;'s configuration dialog.
de: Wenn dieses Ankreuzfeld aktiviert ist, wird der &kde;-weite Zwischenspeicher des Browsers zur Speicherung der Artikel genutzt. Er kann in &konqueror; eingerichtet werden.

source: You should leave this option enabled whenever possible. Disabling this option leads to increased network traffic. The traffic caused by aggregators not using caching increases the costs for providers and may decrease the number of feeds that are offered in future.
de: Sie sollten diese Einstellung, wenn möglich, immer aktiviert lassen. Durch Deaktivierung der Option erhöht sich die Netzwerklast dramatisch, da &akregator; in diesem Fall die Nachrichten bei jedem Start komplett neu laden muss.

source: Share Services
de: Veröffentlichungsdienste
