Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdepim/blogilo.po
Languages: de

source: The &kapplication; Handbook
de: Das Handbuch zu &kapplication;

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Burkhard</firstname><surname>Lück</surname><affiliation><address><email>lueck@hube-lueck.de</email></address></affiliation><contrib>Übersetzung</contrib></othercredit>

source: &kapplication; is a blogging client for &kde;.
de: &kapplication; ist ein Blogging-Programm für &kde;.

source: Introduction
de: Einführung

source: &kapplication; is a blogging client.
de: &kapplication; ist ein Blogging-Programm.

source: A blog client (also called blog software or blogware) is software designed to simplify the creation and maintenance of weblogs. As other specialized content management systems do, weblog applications support the authoring, editing, and publishing of blog posts and comments, with special functions for image management, web syndication, and moderation of posts and comments.
de: Ein Blogging-Programm, auch Blogware genannt, ist eine Anwendung, die das Erstellen und die Verwaltung von Blogs erleichtert. Wie auch andere spezialisierte Content-Management-Systeme unterstützen Weblog-Programme das Verfassen, das Bearbeiten und Veröffentlichen von Einträgen für Blogs und Kommentare dazu mit besonderen Funktionen zur Verwaltung von Bildern, Verbreitung der Einträge im Web und die Moderation von Einträgen und Kommentaren.

source: Using &kapplication;
de: &kapplication; benutzen

source: Getting started
de: Erste Schritte

source: In the &kapplication; main window, you can create new posts, modify previous ones, remove them from the server as well as upload media files to the server. You can also save posts locally for later use.
de: Im Hauptfenster von &kapplication; können Sie neue Einträge erstellen, alte Einträge bearbeiten, Einträge vom Server löschen und auch Mediendateien zum Server hochladen. Außerdem können Sie Einträge lokal für eine spätere Überarbeitung speichern.

source: All of these will be available after you configure at least one blog in &kapplication;.
de: Alle diese Funktionen sind verfügbar, wenn mindestens ein Blog in &kapplication; eingerichtet wurde.

source: Without any configured blog you can write and save posts locally for later use.
de: Ohne ein eingerichtetes Blog können Sie nur Einträge schreiben und für den späteren Gebrauch lokal speichern.

source: Here's a screenshot of &kapplication;
de: Ein Bildschirmfoto von &kapplication;

source: Main Window
de: Hauptfenster

source: Configuring a blog
de: Einen Blog einrichten

source: Blog management is available in the <guilabel>Configure &kapplication;</guilabel> dialog, and is accessible via the <menuchoice><guimenu>Settings</guimenu><guimenuitem>Configure &kapplication;...</guimenuitem></menuchoice> menu, or alternatively via the <menuchoice><guimenu>Blog</guimenu><guimenuitem>Add Blog...</guimenuitem> </menuchoice> menu.
de: Blogs werden im <guilabel>&kapplication; einrichten</guilabel> verwaltet. Diesen Dialog öffnen Sie mit <menuchoice><guimenu>Einstellungen</guimenu><guimenuitem>&kapplication; einrichten ...</guimenuitem></menuchoice> in der Menüleiste. Alternativ können Sie im Menü des Hauptfensters <menuchoice> <guimenu>Blog</guimenu><guimenuitem>Blog hinzufügen ...</guimenuitem></menuchoice> wählen.

source: <screeninfo>Add a new blog - <guilabel>Basic</guilabel> tab</screeninfo>
de: <screeninfo>Einen neuen Blog hinzufügen - die Karteikarte <guilabel>Grundlagen</guilabel></screeninfo>

source: <phrase>Add a new blog - <guilabel>Basic</guilabel> tab</phrase>
de: <phrase>Einen neuen Blog hinzufügen - die Karteikarte <guilabel>Grundlagen</guilabel></phrase>

source: To add a blog, you simply have to insert your blog address, username and password in the corresponding fields and then click the <guibutton>Auto Configure</guibutton> button for the most popular blogging servers, such as Wordpress. It will guess your blog, and api, and then will fetch your Blog Id.
de: Um einen neuen Blog hinzufügen, tragen Sie die Blogadresse, den Benutzernamen und ein Passwort in die entsprechenden Felder ein und klicken dann den Knopf <guibutton>Automatische Konfiguration</guibutton> für weit verbreitete Bloggingserver wie zum Beispiel Wordpress. Damit wird das Blog und die Programmierschnittstelle eingerichtet und die Blog-ID heruntergeladen.

source: If it fails, you can manually select your blog's API type in the <guilabel>Advanced</guilabel> tab and click <guibutton>Fetch ID</guibutton> to fetch your Blog Id, or enter your Blog Id if you know it. And if you are using a “right to left” language, select <guilabel>Right To Left</guilabel> in next drop-down list.
de: Funktioniert die automatische Einrichtung nicht, wechseln Sie zur Karteikarte <guilabel>Erweitert</guilabel>. Stellen Sie dort die Programmierschnittstelle (API) ein und klicken Sie auf <guibutton>ID holen</guibutton> oder geben die Blog-ID direkt ein. Auf dieser Karteikarte können Sie außerdem die Standard-Textrichtung zwischen <guilabel>Links nach Rechts</guilabel> und <guilabel>Rechts nach Links</guilabel> umschalten.

source: <screeninfo>Add a new blog - <guilabel>Advanced</guilabel> tab</screeninfo>
de: <screeninfo>Einen neuen Blog hinzufügen - die Karteikarte <guilabel>Erweitert</guilabel></screeninfo>

source: <phrase>Add a new blog - <guilabel>Advanced</guilabel> tab</phrase>
de: <phrase>Einen neuen Blog hinzufügen - die Karteikarte <guilabel>Erweitert</guilabel></phrase>

source: You can check what &kapplication; supports for your blog in the <guilabel>Supported Features</guilabel> tab.
de: Auf der Karteikarte <guilabel>Unterstützte Fähigkeiten</guilabel> zeigt &kapplication; alle Fähigkeiten, die von Ihrem Blog unterstützt werden.

source: Creating a new Post
de: Einen neuen Eintrag erstellen

source: To create a new post, in the main window, you can click on <guibutton>New Post</guibutton> toolbar button or under the <guimenu>Post</guimenu> menu, or simply press <keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo> (its shortcut).
de: Um im Hauptfenster einen neuen Eintrag zu erstellen, klicken Sie in der Werkzeugleiste auf den Knopf <guibutton>Neuer Eintrag</guibutton> oder wählen Sie diese Aktion aus dem Menü <guimenu>Eintrag</guimenu>. Als Kurzwahl ist dafür die Tastenkombination <keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo> eingestellt.

source: A new/empty post is created, and you can write, and configure it, and then submit it to your blog.
de: Dann wird eine Karteikarte mit einem neuen leeren Eintrag erstellt. Schreiben Sie nun Ihren Text und senden Sie dann den Eintrag zu Ihrem Blog.

source: The &kapplication; main window is divided into two sections, Composer and Toolbox.
de: Das Hauptfenster von &kapplication; besteht aus dem Editor zum Schreiben der Einträge und dem Werkzeugkasten.

source: Composer
de: Eintragseditor

source: In the Composer section, you have a text field with the label <guilabel>Title</guilabel>, where you can write the title of the post. Below it, you have three tabs to edit your post in several ways. The first is a Visual Editor: it is a WYSIWYG editor and you only need to use the icons to format your text. The next tab is an &HTML; editor, where you have a syntax highlighted text editor to edit the &HTML; code of your post. And on the last tab, you can preview your post with your blog style, before submitting it to the server.
de: Im Editorbereich gibt es das Textfeld <guilabel>Titel</guilabel>, um hier einen Titel für den Blogeintrag einzugeben. Darunter gibt es drei Karteikarten, in denen der Eintrag auf unterschiedliche Weise bearbeitet werden kann. Auf der ersten Karteikarte finden Sie einen grafischen Editor. Benutzen Sie die Symbole zur Formatierung Ihres Textes, dabei wird der Text während der Bearbeitung so angezeigt, wie er später im Blog aussieht. Die nächste Karteikarte zeigt den Text &HTML; formatiert, der &HTML;-Quelltext des Eintrags kann im Editor mit Syntaxhervorhebung bearbeitet werden. Die dritte Karteikarte schließlich zeigt den Eintrag im Stil Ihres Blogs, hier können Sie das Erscheinungsbild vor dem Hochladen auf den Server noch einmal überprüfen.

source: Toolbox
de: Werkzeugkasten

source: The Toolbox has four sections:
de: Im Werkzeugkasten gibt es vier Abschnitte:

source: <para>Blog Posts</para>
de: <para>Blog-Einträge></para>

source: <screeninfo>Blog Posts</screeninfo>
de: <screeninfo>Blog-Einträge</screeninfo>

source: <phrase>Blog Posts</phrase>
de: <phrase>Blog-Einträge</phrase>

source: In this section, you can fetch the latest posts from the server.
de: In diesem Abschnitt können Sie die neuesten Einträge vom Server abholen.

source: Double click on a post entry to load it into the composer and modify it, or select a post and use the relevant button to remove it from the server.
de: Doppelklicken Sie auf einen Eintrag, um ihn in den Editor zu laden und zu bearbeiten oder wählen Sie einen Eintrag und benutzen Sie den entsprechenden Knopf, um ihn vom Server zu löschen.

source: <para>Post Categories</para>
de: <para>Eintragskategorien</para>

source: <screeninfo>Post Categories</screeninfo>
de: <screeninfo>Eintragskategorien</screeninfo>

source: <phrase>Post Categories</phrase>
de: <phrase>Eintragskategorien</phrase>

source: In this section you can select categories and tags for your post. Tags must be comma separated.
de: In diesem Abschnitt können Sie Kategorien auswählen und Stichwörter für Ihre Einträge vergeben. Stichwörter müssen durch Kommata getrennt werden.

source: <para>Post Options</para>
de: <para>Eintragsoptionen</para>

source: <screeninfo>Post Options</screeninfo>
de: <screeninfo>Eintragsoptionen</screeninfo>

source: <phrase>Post Options</phrase>
de: <phrase>Eintragsoptionen</phrase>

source: Here you can select options for the currently active post in the composer such as <guilabel>Feedback</guilabel> options (for example, if visitors can leave a comment for this post or not), select a publish date, or a title to use for a permalink of the post (for Wordpress blogs only).
de: Hier können Einstellungen für den aktuellen Eintrag im Editor gewählt werden, ob zum Beispiel Besucher des Blogs eine <guilabel>Rückmeldung</guilabel> in Form eines Kommentars zum Eintrag schreiben können. Zusätzlich lässt sich das Datum der Veröffentlichung anpassen oder ein Titel für einen Permalink (nur für Wordpress-Blogs) eintragen.

source: <para>Local Entries</para>
de: <para>Lokale Einträge</para>

source: <screeninfo>Local Entries</screeninfo>
de: <screeninfo>Lokale Einträge</screeninfo>

source: <phrase>Local Entries</phrase>
de: <phrase>Lokale Einträge</phrase>

source: And in the <guilabel>Local Entries</guilabel> section, you can double click on an entry to load it into the composer, or you can remove it from disk.
de: Doppelklicken Sie im Abschnitt <guilabel>Lokale Einträge</guilabel> auf einen Eintrag, um ihn in den Editor zu laden und zu bearbeiten oder wählen Sie einen Eintrag und löschen ihn von der Festplatte.

source: Uploading a Media file to the server
de: Eine Mediendatei auf den Server hochladen

source: To upload a file to the server, use <menuchoice><guimenu>Blog</guimenu> <guimenuitem>Upload Media...</guimenuitem></menuchoice>. You are then asked to select a file from your disk. The media upload dialog will be displayed:
de: Um eine Mediendatei auf den Server hochzuladen, wählen Sie aus dem Menü <menuchoice><guimenu>Blog</guimenu> <guimenuitem>Medien hochladen ...</guimenuitem></menuchoice>. Wählen Sie dann eine Datei von der Festplatte und der Dialog zum Hochladen von Medien wird angezeigt:

source: <screeninfo>Upload Media</screeninfo>
de: <screeninfo>Medien hochladen</screeninfo>

source: <phrase>Upload Media</phrase>
de: <phrase>Medien hochladen</phrase>

source: If your blog API supports media uploading, you have 2 options here, and if not, there is just one and it's &FTP; server.
de: Wenn die Schnittstelle Ihres Blogs das Hochladen von Medien erlaubt, kann für das Hochladen die <guilabel>Blog-API</guilabel> oder <guilabel>FTP</guilabel> benutzt werden, ansonsten ist nur die Einstellung <guilabel>FTP</guilabel> möglich.

source: You can preview your desired file here (if preview method available), and enter its name on the server. And then click <guibutton>Upload</guibutton>.
de: Hier wird eine Vorschau der ausgewählten Datei angezeigt und der Name auf dem Server kann eingeben werden. Klicken Sie dann auf den Knopf <guibutton>Hochladen</guibutton>.

source: If you want to upload to an &FTP; server, the absolute path of the folder is required. And you have to enter a &URL; to use for identifying the link of the file on the server.
de: Möchten Sie Medien auf einen &FTP;-Server hochladen, ist der absolute Pfad zum Ordner einzugeben. Außerdem muss eine &URL; eingetragen werden, um die Verknüpfung zur Datei auf dem Server einzutragen.

source: Menu Reference
de: Menüreferenz

source: Menu Items
de: Menüeinträge

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Quit</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo> </shortcut> <guimenu>Datei</guimenu> <guimenuitem>Beenden</guimenuitem>

source: <action>Quit</action> &kapplication;
de: <action>Beendet</action> &kapplication;

source: <guimenu>Blog</guimenu> <guimenuitem>Add Blog...</guimenuitem>
de: <guimenu>Blog</guimenu> <guimenuitem>Blog hinzufügen ...</guimenuitem>

source: A quick way to add a new blog.
de: Eine schnelle Möglichkeit, um einen Blog hinzuzufügen.

source: <guimenu>Blog</guimenu> <guimenuitem>Upload Media...</guimenuitem>
de: <guimenu>Blog</guimenu> <guimenuitem>Medien hochladen ...</guimenuitem>

source: Open Media uploader, to upload files such as images to blog or &FTP; server.
de: Öffnet den Dialog „Mediendatei hochladen“, um Dateien wie zum Beispiel Bilder auf den Blog- oder &FTP;-Server hochzuladen.

source: Only MetaWeblog and MovableType and Wordpress APIs support media uploading function.
de: Nur mit MetaWeblog, MovableType und Wordpress haben Sie die Möglichkeiten, Medien hochzuladen.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo> </shortcut> <guimenu>Post</guimenu> <guimenuitem>New Post</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo> </shortcut> <guimenu>Eintrag</guimenu> <guimenuitem>Neuer Eintrag</guimenuitem>

source: Create a new and empty post.
de: Erstellt einen neuen leeren Eintrag.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>S</keycap></keycombo> </shortcut> <guimenu>Post</guimenu> <guimenuitem>Save Locally</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>S</keycap></keycombo> </shortcut> <guimenu>Eintrag</guimenu> <guimenuitem>Lokal speichern</guimenuitem>

source: Save current post locally.
de: Speichert den aktuellen Eintrag lokal ab.

source: <guimenu>Post</guimenu> <guimenuitem>Submit...</guimenuitem>
de: <guimenu>Eintrag</guimenu> <guimenuitem>Absenden ...</guimenuitem>

source: Open the Submit post dialog, to submit the current active post to the current blog.
de: Öffnet einen Dialog, um den aktiven Eintrag zum aktuellen Blog zu übermitteln.

source: In submit post, you can select if this post should submit as a draft or not. And additionally, whether as an edit of the current post, or as a new post.
de: In diesem Dialog können Sie auswählen, ob der Eintrag endgültig oder nur als Entwurf hochgeladen werden soll. Außerdem kann eingestellt werden, ob es sich um einen bearbeiteten oder einen neuen Eintrag handelt.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>T</keycap></keycombo> </shortcut> <guimenu>Settings</guimenu> <guimenuitem>Show Toolbox</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>T</keycap></keycombo> </shortcut> <guimenu>Einstellungen</guimenu> <guimenuitem>Werkzeugkasten anzeigen</guimenuitem>

source: <action>Toggle</action> displaying the toolbox.
de: <action>Zeigt</action> den Werkzeugkasten an bzw. blendet ihn aus.

source: Additionally &kapplication; has the common &kde; <guimenu>Settings</guimenu> and <guimenu>Help</guimenu> menu items, for more information read the sections about the <ulink url="help:/fundamentals/ui.html#menus-settings">Settings Menu</ulink> and <ulink url="help:/fundamentals/ui.html#menus-help">Help Menu</ulink> of the &kde; Fundamentals.
de: Zusätzlich hat &kapplication; die bekannten &kde;-Einträge im Menü <guimenu>Einstellungen</guimenu> und <guimenu>Hilfe</guimenu>, weitere Informationen dazu finden Sie in den Abschnitten über die Menüs <ulink url="help:/fundamentals/ui.html#menus-settings">Einstellungen</ulink> und <ulink url="help:/fundamentals/uihtml#menus-help">Hilfe</ulink> der &kde;-Grundlagen.

source: Credits and License
de: Danksagungen und Lizenz

source: Program copyright 2008-2009 &Mehrdad.Momeny; &Mehrdad.Momeny.mail; and &Golnaz.Nilieh; &Golnaz.Nilieh.mail;
de: Programm Copyright 2008-2009 &Mehrdad.Momeny; &Mehrdad.Momeny.mail; and &Golnaz.Nilieh; &Golnaz.Nilieh.mail;

source: Documentation Copyright &copy; 2009 &Mehrdad.Momeny; &Mehrdad.Momeny.mail;
de: Dokumentation Copyright &copy; 2009 &Mehrdad.Momeny; &Mehrdad.Momeny.mail;

source: CREDIT_FOR_TRANSLATORS
de: <para>Burkhard Lück <email>lueck@hube-lueck.de</email></para>

source: How to obtain &kapplication;
de: Bezugsquellen von &kapplication;

source: Compilation and Installation
de: Kompilierung und Installation
