Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdepim/kabcclient.po
Languages: de

source: The &kabcclient; Handbook
de: Das Handbuch zu &kabcclient;

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Burkhard</firstname><surname>Lück</surname><affiliation><address><email>lueck@hube-lueck.de</email></address></affiliation><contrib>Übersetzung</contrib></othercredit>

source: &kabcclient; is a command line interface to &kde; address books.
de: &kabcclient; ist ein Befehlszeilenprogramm für das &kde;-Adressbuch.

source: Introduction
de: Einleitung

source: &kabcclient; is a command line interface to &kde; address book. It lets you list, search, insert, remove, or merge contacts by way of the command line or from a scripting language. &kabcclient; can handle a variety of formats on both input and output, enabling it to be used for import and export of whole &kde; address books.
de: &kabcclient; ist ein Befehlszeilenprogramm für das &kde;-Adressbuch. Es können Kontakte angezeigt, gesucht, eingefügt, gelöscht oder zusammengeführt werden, entweder über die Befehlszeile oder mit Skripten. &kabcclient; kann verschiedene Formate für die Ein- und Ausgabe verarbeiten. Es ist möglich, mit dem Programm vollständige &kde;-Adressbücher zu importieren oder zu exportieren.

source: When invoked without arguments &kabcclient; will be put into search mode and try to match any input it can read from standard input to contact entries in the &kde; address book
de: Beim Aufruf ohne Argumente arbeitet &kabcclient; im Suchmodus. Zu den auf der Standardeingabe eingelesenen Daten werden passende Kontakte im &kde;-Adressbuch gesucht.

source: Main features of &kabcclient;:
de: Hauptfunktionen von &kabcclient;:

source: List all contacts of the &kde; address book
de: Anzeige aller Kontakte aus dem &kde;-Adressbuch

source: Search for contacts matching the input
de: Suche nach passenden Kontakten für die Eingaben

source: Insert (add) contacts
de: Einfügen von Kontakten

source: Remove (delete) contacts
de: Löschen von Kontakten

source: Merge (change) matching contacts with new data
de: Zusammenführen und Ändern passender Kontakte mit neuen Daten

source: &kabcclient; is <emphasis>not</emphasis> another graphical user interface to the &kde; address book (i.e. &kaddressbook;). &kabcclient; is intended solely for uses where a graphical user interface is not practical or possible.
de: &kabcclient; ist <emphasis>keine</emphasis> weitere grafische Benutzerschnittstelle zum &kde;-Adressbuch wie zum Beispiel &kaddressbook;, &kabcclient; wird ausschließlich dann benutzt, wenn die Arbeit mit einer grafischen Benutzerschnittstelle nicht praktikabel oder nicht möglich ist.

source: &kabcclient; does <emphasis>not</emphasis> provide a full-featured language for making queries of the user's address book nor is it the intention of the authors to ever write such a capability. Any such processing can be done through other command line tools or the script's own language's capabilities.
de: &kabcclient; bietet <emphasis>keine</emphasis> vollständige Befehlssprache für die Abfrage der Einträge im Adressbuch, das ist auch nicht beabsichtigt. Dafür gibt es andere Befehlszeilenprogramme.

source: To ease discoverability of its capabilities, any option requiring an argument can be called with the value <replaceable>help</replaceable>. This will then list all the valid values one can pass to that option.
de: Um alle Möglichkeiten der Verarbeitung von Daten anzuzeigen, kann jede Option, die ein Argument erfordert, mit dem Wert <replaceable>help</replaceable> aufgerufen werden. Dann werden alle gültigen Werte der Argumente für diese Option ausgegeben.

source: Features
de: Funktionen

source: In this chapter you'll learn about the main features of &kabcclient; and how to control them using the command line parameters (remember that &kabcclient; is not a graphical user interface; it is a command line program only).
de: Dieses Kapitel erläutert die Funktionen von &kabcclient; und deren Kontrolle über Befehlszeilenparameter (wiederum: &kabcclient; ist keine grafische Benutzeroberfläche, sondern lediglich ein Befehlszeilenprogramm).

source: You'll learn about inserting, deleting, and searching for contact data, and how to use different formats for input and output.
de: Das Einfügen, Löschen und die Suche von Kontaktdaten wird hier erläutert, ebenso die Verwendung der verschiedenen Formate für Ein- und Ausgabe.

source: Listing the address book
de: Anzeige der Einträge im Adressbuch

source: This is the most basic operation mode, initiated using the <parameter>--list</parameter> or <parameter>-L</parameter> option. &kabcclient; will list all contacts in the &kde; address book, writing the data to the program's standard output. Amount and format of the output will depend on the chosen output format.
de: Dies ist die Hauptarbeitsweise von &kabcclient;, sie wird mit der Option <parameter>--list</parameter> oder <parameter>-L</parameter> gestartet. Damit werden alle Kontakte des &kde;-Adressbuchs auf der Standardausgabe des Programms angezeigt. Menge und Format der Daten hängt von dem gewählten Ausgabeformat ab.

source: To list all contacts as standard vCard entries, simply run:
de: Zur Ausgabe aller Kontakte im Standard-vCard-Format geben Sie ein:

source: To get just one line per contact, &eg; for counting, simply run:
de: Um jeden Kontakt auf einer eigenen Zeile zum Beispiel zum Zählen anzuzeigen, geben Sie folgendes ein:

source: In this next example, we list all email addresses:
de: Mit dem nächsten Beispiel werden alle E-Mail-Adressen ausgegeben:

source: Searching for contacts matching the input data
de: Suche nach passenden Kontakten für Eingabedaten

source: &kabcclient; can take data from the command line or from the program's standard input and check it for similarities against all contacts in the &kde; address book. Searching is the default mode but it can be explicitly be chosen using the <parameter>--search</parameter> or <parameter>-S</parameter> command line argument.
de: &kabcclient; kann Daten von der Befehlszeile oder über die Standardeingabe des Programms einlesen und nach passenden Werten in allen Kontakten des &kde;-Adressbuchs suchen. Suchen ist der Standard-Verabeitungsmodus, dies kann aber auch ausdrücklich mit den Befehlszeilenargumenten <parameter>--search</parameter> oder <parameter>-S</parameter> ausgewählt werden.

source: In the following example, all contacts with <replaceable>jane</replaceable> as part of any name field or email address will be written to the program's standard output, formatted as vCards (since this is the default for the <option>--output-format</option> option):
de: Im folgenden Beispiel werden alle Kontakte mit <replaceable>jane</replaceable> in einem Teil eines beliebigen Namensfeldes oder der E-Mail-Adresse im Format vCard auf der Standardausgabe angezeigt. Das Format vCard ist die Voreinstellung für die Option <option>--output-format</option>:

source: Same query again, this time reading the search string from the program's standard input:
de: Die gleiche Abfrage, diesmal wird der Suchtext auf der Standardeingabe des Programms gelesen:

source: Case sensitivity of queries can be toggled using the <option>--match-case</option> option.
de: Mit der Option <option>--match-case</option> kann eingestellt werden, ob bei der Suche die Groß-/Kleinschreibung beachtet wird.

source: Adding contacts
de: Kontakte hinzufügen

source: &kabcclient; supports adding new contacts to the &kde; address book using the <parameter>--add</parameter> or <parameter>-A</parameter> command line argument. The data can either be passed as additional command line arguments or read from standard input. On success the resulting contacts will be written to the program's standard output. Since this is an operation which applies changes to the address book it can be run in a "Dry run" mode using the <option>--nosave</option> option.
de: Mit &kabcclient; ist es möglich, neue Kontakte mit dem Befehlszeilenargument <parameter>--add</parameter> oder <parameter>-A</parameter> zum &kde;-Adressbuch hinzuzufügen. Die Daten können entweder als zusätzliche Argumente der Befehlszeile angegeben oder über die Standardeingabe gelesen werden. Bei erfolgreicher Ausführung werden die hinzugefügten Kontakte zur Standardausgabe des Programms geschrieben. Da mit dieser Operation Daten des Adressbuchs verändert werden, kann ein Probelauf mit der Option <option>--nosave</option> durchgeführt werden.

source: Add a contact with name and email address by interpreting an additional command line argument as the input data:
de: Hinzufügen eines Kontaktes mit Namen und E-Mail-Adresse, die Daten werden durch ein zusätzliches Befehlszeilenargument angegeben:

source: Add all contacts from a vCard file streamed into the program's standard input:
de: Hinzufügen aller Kontakte aus einer vCard-Datei, die über die Standardeingabe des Programms eingelesen wird:

source: <prompt>%</prompt><userinput> <command>cat <replaceable>example-file.vcf</replaceable></command> | <command>kabcclient</command> <option>--add</option> <option>--input-format <replaceable>vcard</replaceable> </option></userinput>
de: <prompt>%</prompt><userinput> <command>cat <replaceable>beispiel-datei.vcf</replaceable></command> | <command>kabcclient</command> <option>--add</option> <option>--input-format <replaceable>vcard</replaceable> </option></userinput>

source: Deleting contacts
de: Kontakte löschen

source: &kabcclient; supports deleting contacts from the &kde; address book using the <parameter>--remove</parameter> or <parameter>-R</parameter> command line argument. The input data is basically a query like when searching the address book. On success the removed contacts will be written to the program's standard output. Since this is an operation which applies changes to the address book it can be run in a "Dry run" mode using the <option>--nosave</option> option.
de: Mit &kabcclient; ist es möglich, neue Kontakte mit dem Befehlszeilenargument <parameter>--remove</parameter> oder <parameter>-R</parameter> aus dem &kde;-Adressbuchzu löschen. Die Eingabedaten werden wie bei der Suche im Adressbuch angegeben. Bei erfolgreicher Ausführung werden die entfernten Kontakte zur Standardausgabe des Programms geschrieben. Da mit dieser Operation Daten des Adressbuchs verändert werden, kann ein Probelauf mit der Option <option>--nosave</option> durchgeführt werden.

source: When you delete something from the address book you <emphasis>cannot</emphasis> undo it! In other words, when you delete a contact you cannot reverse the deletion. It's gone for good.
de: Das Löschen eines Eintrages aus dem Adressbuch kann <emphasis>nicht</emphasis> rückgängig gemacht werden. Ein entfernter Eintrag ist und bleibt gelöscht.

source: Test removing all contacts with <replaceable>jane</replaceable> in any contact name field or any email address:
de: Probelauf des Löschens aller Kontakte mit <replaceable>jane</replaceable> in einem Teil eines beliebigen Namensfeldes oder der E-Mail-Adresse:

source: Input and Output Formats
de: Ein- und Ausgabeformate

source: &kabcclient; can interpret input data and format output data according to various formatting rules. Depending on the actual usage scenario certain combinations will render the most useful result. Some of the formats understand additional parameters for further customizing their behavior.
de: &kabcclient; kann nach verschiedenen Formatierungsregeln Eingabedaten interpretieren oder Ausgabedaten formatieren. Die besten Ergebnisse für diese Funktionen werden bei verschiedenen Aufgaben mit bestimmten Kombinationen der Formate erzielt. Für einige Formate gibt es zusätzliche Parameter, um den Ablauf der Verarbeitung genauer zu steuern.

source: Since textual data can be encoded both input and output can be subjected to additional decoding or encoding respectively.
de: Da Textdaten in unterschiedlichen Kodierungen vorliegen können, kann für die Ein- und Ausgabe eine bestimmte Kodierung vorgegeben werden.

source: All those command line options will react to the special value <replaceable>help</replaceable> by listing the allowed values.
de: Für alle diese Befehlszeilenoptionen gibt es den speziellen Wert <replaceable>help</replaceable>, damit werden alle zulässigen Werte dieser Optionen angezeigt.

source: vCard (<acronym>RFC</acronym> 2426) is the standard format for contact data and as such can present all information other address book applications such as &kaddressbook; can access. It is therefore the default format for output formatting.
de: vCard (<acronym>RFC</acronym> 2426) ist das Standardformat für Kontaktdaten, Es kann alle Informationen aufnehmen, sodass andere Adressbuchprogramme wie &kaddressbook; darauf zugreifen können. Daher ist das vCard-Format der Standard für die Formatierung der Ausgaben.

source: Comma-Separated Values (<acronym>CSV</acronym>) Format
de: Durch Komma getrennte Werte (<quote><acronym>CSV</acronym></quote>-Format)

source: Comma-Separated Value Format can be used as input format to fill data into specific field of a contact entry and as an output format to reduce or re-order data for further processing. To allow for enough flexibility mapping of contact fields to CSV columns can be specified using CSV-template description files also used by &kaddressbook; for the same purpose.
de: Das CSV-Format kann als Eingabeformat benutzt werden, um Daten in bestimmte Felder eines Kontakteintrages einzufügen. Als Ausgabeformat wird es verwendet, um die Datenmenge zu verringern oder die Daten für eine weitere Bearbeitung umzusortieren. Eine beliebige Zuordnung von Kontaktfeldern zu CSV-Spalten kann durch Beschreibungsdateien für CSV-Vorlagen festgelegt werden. Diese Beschreibungsdateien werden von &kaddressbook; ebenfalls für diesen Zweck benutzt.

source: Command Line Arguments
de: Befehlszeilenargumente

source: &kabcclient; supports the following options:
de: &kabcclient; unterstützt folgende Optionen:

source: Description
de: Beschreibung

source: Shows help about the program options.
de: Zeigt Hilfetexte zu den Optionen an.

source: Shows the program author information.
de: Zeigt Informationen über die Programmautoren.

source: Shows the program version information.
de: Zeigt die Versionsnummer des Programms an.

source: Shows the program license information.
de: Zeigt Informationen zu den Lizenzbestimmungen.

source: Print helpful runtime messages.
de: Gibt nützliche Laufzeitmeldungen aus.

source: Print what would have been done, but do not execute. Do not change anything in the &kde; address book; do not insert, remove, modify any existing contacts.
de: Führt den Befehl aus und zeigt das Ergebnis an. Es werden jedoch keine Daten im &kde;-Adressbuch geändert, vorhandene Kontakte werden nicht bearbeitet, es werden keine Daten eingefügt oder gelöscht.

source: Use case sensitive matching when comparing input data with contact data from the address book.
de: Verwendet Groß-/Kleinschreibungeibun, wenn der Eingabetext mit den Kontakteinträgen verglichen wird.

source: Major Operation Modes:
de: Hauptarbeitsmodi:

source: Print all contacts in specified export format.
de: Gibt alle Kontakte in vorgegebenen Format aus.

source: Insert contacts into the address book.
de: Fügt Kontakte in das Adressbuch ein.

source: Delete contacts from the address book.
de: Löscht Kontakte aus dem Adressbuch.

source: Merge data from the input with matching contacts from the address book.
de: Führt die Daten aus der Eingabe mit den zugehörigen Kontakten aaus dem Adressbuch zusammen.

source: Formatting and Encoding:
de: Formatierung und Kodierung

source: How to interpret the input data. Use <replaceable>help</replaceable> for a list of available values.
de: Legt fest, wie die Eingabedaten interpretiert werden sollen. Mit <replaceable>help</replaceable> wird eine Liste aller möglichen Werte angezeigt.

source: How to format the output data. Use <replaceable>help</replaceable> for a list of available values.
de: Legt fest, wie die Ausgabedaten formatiert werden sollen. Mit <replaceable>help</replaceable> wird eine Liste aller möglichen Werte angezeigt.

source: <option>-if-opts, --input-format-options</option> <replaceable>options</replaceable>
de: <option>-if-opts, --input-format-options</option> <replaceable>optionen</replaceable>

source: Input format specific customization options. Use <replaceable>help</replaceable> for a list of available values.
de: Benutzerdefinierte Optionen für das Eingabeformat. Mit <replaceable>help</replaceable> wird eine Liste aller möglichen Werte angezeigt.

source: <option>-of-opts, --output-format-options</option> <replaceable>options</replaceable>
de: <option>-of-opts, --output-format-options</option> <replaceable>optionen</replaceable>

source: Output format specific customization options. Use <replaceable>help</replaceable> for a list of available values.
de: Benutzerdefinierte Optionen für das Ausgabeformat. Mit <replaceable>help</replaceable> wird eine Liste aller möglichen Werte angezeigt.

source: Text encoding used to present the input data. Use <replaceable>help</replaceable> for a list of available values.
de: Textkodierung für die Anzeige der Eingabedaten. Mit <replaceable>help</replaceable> wird eine Liste aller möglichen Werte angezeigt.

source: Text encoding which should be used to present the output data. Use <replaceable>help</replaceable> for a list of available values.
de: Textkodierung für die Anzeige der Ausgabedaten. Mit <replaceable>help</replaceable> wird eine Liste aller möglichen Werte angezeigt.

source: Questions and Answers
de: Fragen und Antworten

source: What configuration files does &kabcclient; use?
de: Welche Konfigurationsdateien verwendet &kabcclient;?

source: None.
de: Keine.

source: What are the application names of &kabcclient;?
de: Wie lautet der Programmname von &kabcclient;?

source: &kabcclient;'s application name is <application>kabcclient</application>.
de: Der Programmname von &kabcclient; lautet <application>kabcclient</application>.

source: How do I have my question added to this <acronym>FAQ</acronym>?
de: Wie kann ich eine Frage zu den <acronym>FAQ</acronym> hinzufügen?

source: Send your questions to <email>kevin.krammer@gmx.at</email>.
de: Senden Sie Ihre Fragen an <email>kevin.krammer@gmx.at</email>.

source: Credits and License
de: Danksagungen und Lizenz

source: &kabcclient; Program copyright 2005-2008:
de: &kabcclient; Programm Copyright 2005-2008:

source: Documentation copyright 2008:
de: Dokumentation Copyright 2008:

source: CREDIT_FOR_TRANSLATORS
de: <para>Übersetzung Burkhard Lück<email>lueck@hube-lueck.de</email></para>

source: How to obtain &kabcclient;
de: Bezugsquellen von &kabcclient;

source: &kabcclient; comes included with &kde;4 and is not available separately.
de: &kabcclient; ist Bestandteil von &kde;4 und nicht einzeln erhältlich.

source: Requirements
de: Anforderungen

source: &kabcclient; requires the standard &kde; libraries to be installed (the <filename>kdelibs</filename> package and <filename>kdepimlibs</filename>). To compile from source, you also need the &Qt;, <filename>kdelibs</filename> and <filename>kdepimlibs</filename> development packages.
de: Für &kabcclient; müssen die &kde;-Standardbibliotheken (also das <filename>kdelibs</filename> und das <filename>kdepimlibs</filename>-Paket) installiert sein. Zur Kompilierung wird außerdem &Qt; und die Entwicklerpakete zu <filename>kdelibs</filename> und <filename>kdepimlibs</filename> benötigt.

source: You can find a list of changes in the <filename>ChangeLog</filename> file.
de: Ein Liste von Änderungen finden Sie in der Datei <filename>ChangeLog</filename>.

source: Configuration
de: Einrichtung

source: No special configuration is required to set up &kabcclient; to run on the &kde; desktop.
de: Zur Verwendung von &kabcclient; mit der &kde;-Arbeitsoberfläche sind keine weiteren Konfigurationen notwendig.
