Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdepim/kjots.po
Languages: de

source: The &kjots; Handbook
de: Das Handbuch zu &kjots;

source: Developer
de: Entwickler

source: Reviewer
de: Gegengelesen von

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Gregor</firstname><surname>Zumstein</surname><affiliation><address><email>zumstein@ssd.ethz.ch</email></address></affiliation><contrib>Übersetzung von</contrib></othercredit>

source: This handbook describes how to use &kjots;, a small program which is handy for keeping and organizing miscellaneous notes.
de: Dieses Handbuch beschreibt die Benutzung von &kjots; einem kleinen Programm zum Schreiben und Verwalten von verschiedenen Notizen.

source: notes
de: notiz

source: Using &kjots;
de: Benutzung von &kjots;

source: &kjots; has two basic items used to organize your notes - <quote>Books</quote> and <quote>Pages</quote>.
de: &kjots; benutzt zwei grundlegende Einheiten, um Notizen zu verwalten - <quote>Bücher</quote> und <quote>Seiten</quote>.

source: <screeninfo>&kjots; Main Window</screeninfo>
de: <screeninfo>&kjots; Hauptfenster</screeninfo>

source: <phrase>&kjots; Main Window</phrase>
de: <phrase>&kjots; Hauptfenster</phrase>

source: You can create a number of books in &kjots;, and each book can contain a number of pages, where you actually type your notes. Each book should be given a name (so you can find what you are looking for), as should each page. Although you aren't forced to give a page a name, it is sensible to do so.
de: In &kjots; können mehrere Bücher erzeugt werden und pro Buch können wiederum mehrere Seiten gespeichert werden. Die Seiten beinhalten die Notizen. Jedes Buch sollte einen Namen haben, genauso auch jede Seite. Auch wenn Sie dazu nicht gezwungen werden, ist dies vernünftig, insbesondere um eine einfachere Suche zu ermöglichen.

source: The left pane of the main window shows the <guilabel>Local Notes</guilabel> and all books and pages in a tree view.
de: Im linken Bereich des Hauptfensters werden <guilabel>Lokale Notizen</guilabel> sowie alle Bücher und Seiten in einer Baumansicht angezeigt.

source: If <guilabel>Local Notes</guilabel> or book items are selected, the editor in the right pane displays tables of contents with titles of books and pages as links, which allow to navigate quickly through the notes and read the pages.
de: Wenn <guilabel>Lokale Notizen</guilabel> oder Bucheinträge ausgewählt sind, werden im Editor im rechten Bereich Inhaltsverzeichnisse mit den Titeln von Büchern und Seiten als Verknüpfungen angezeigt, mit denen Sie schnell durch die Notizen navigieren und die Seiten lesen können.

source: The content of pages is shown in read only mode. Only if a page is selected in the tree view or by clicking on a page title in the editor pane, the page content can be edited.
de: Der Inhalt der Seiten wird nur lesbar angezeigt. Nur wenn Seiten in der Baumansicht oder durch Klicken auf den Seitentitel im Editorbereich ausgewählt sind, kann der Inhalt der Seiten bearbeitet werden.

source: Using Books
de: Benutzung von Büchern

source: To create a new book, use <keycombo action="simul">&Ctrl;&Shift; <keycap>N</keycap></keycombo> or the menu entry <menuchoice><guimenu>File</guimenu><guimenuitem>New Book</guimenuitem></menuchoice>, and you will get a new book named <guilabel>New Book</guilabel> with an empty page named <guilabel>New Page</guilabel>.
de: Um ein neues Buch zu erstellen, benutzen Sie <keycombo action="simul">&Ctrl;&Shift;<keycap>N</keycap></keycombo> oder den Menüeintrag <menuchoice><guimenu>Datei</guimenu><guimenuitem>Neues Buch</guimenuitem></menuchoice>. Damit erstellen Sie eine neues Buch mit dem Namen <guilabel>Neues Buch</guilabel> und einer Seite <guilabel>Neue Seite</guilabel>.

source: The name of the new book should now appear in the left part of the window. If you want the book to be in your <quote>Bookmarks</quote>, use <keycombo action="simul">&Ctrl; <keycap>B</keycap></keycombo> or the menu entry <menuchoice> <guimenu>Bookmarks</guimenu><guimenuitem>Add Bookmark</guimenuitem> </menuchoice>. You can even organize your bookmarks in separate folders just as you probably do in &konqueror;.
de: Der Name des neuen Buchs erscheint im linken Teil des Fensters. Soll das Buch auch in den <quote>Lesezeichen</quote> erscheinen, benutzen Sie <keycombo action="simul">&Ctrl;<keycap>B</keycap></keycombo> oder den Menüeintrag <menuchoice><guimenu>Lesezeichen</guimenu><guimenuitem> Lesezeichen hinzufügen</guimenuitem></menuchoice>. Sie können die Lesezeichen auch in einem eigenen Ordner verwalten, wie Sie dies vermutlich auch bei &konqueror; machen.

source: If you want to have your books in a different order, you can simply drag and drop the book to the place where you want it to be.
de: Wenn Sie die Reihenfolge der Bücher umstellen wollen, ziehen Sie ein Buch an die Stelle, wo es hin soll und lassen es dort wieder los.

source: Maybe you have noticed that there is no <quote>Save</quote> anywhere. This is not an error, &kjots; saves your books and pages automatically, so you will never lose that small note you write when you are on the phone and need to write down something in a hurry.
de: Möglicherweise haben Sie festgestellt, dass es kein <quote>Speichern</quote> gibt. Das ist kein Fehler, da &kjots; die Bücher und Seiten automatisch speichert, sodass Sie nie einen Eintrag verlieren, nicht einmal die kleine Notiz während des Telephonierens.

source: You can also export an entire book as a text, html file or as a book file, using the items in <menuchoice><guimenu>File</guimenu> <guisubmenu>Export </guisubmenu></menuchoice>. You will be then prompted to enter a location for the file to be saved. The text format of an example saved book in text format is shown below:
de: Sie können auch ein ganzes Buch als Text-, HTML- oder Buchdatei exportieren, indem Sie <menuchoice><guimenu>Datei</guimenu> <guimenuitem>Exportieren ...</guimenuitem></menuchoice> wählen. Daraufhin werden Sie aufgefordert, einen Ordner und den Namen für die Datei anzugeben. Anschließend wird die Datei gespeichert. Das Textformat eines exportierten Buches sieht folgendermaßen aus:

source: ############ # First page ############ Remember to go to the shops! ############# # Useful code ############# 10 PRINT "HELLO WORLD" 20 GOTO 10 ################ # The third page ################ This is the third page and is an example for &kjots;.
de: ############# # Erste Seite ############# Einkaufen gehen! ################# # Nützlicher Code ################# 10 PRINT "HELLO WORLD" 20 GOTO 10 ################## # Die dritte Seite ################## Dies ist die dritte Seite und ein Beispiel für &kjots;.

source: Remember that the dialog where you are prompted for a filename is a standard &kde; dialog. That means it is just as easy to store the file on your local hard disk as it is to save it on a web server, ftp server or USB memory stick. So you can export as html and save it on a webserver; this way you always have your notes available to you.
de: Beachten Sie, dass der Dialog, wo Sie nach dem Dateinamen gefragt werden ein ganz gewöhnlicher &kde;-Dialog ist. Sie können die Datei also nicht nur ganz einfach auf der Festplatte ablegen, sondern auch auf einem Webserver, FTP-Server oder USB-Speicher-Stick. Sie können Ihre Notizen also als HTML-Datei exportieren und auf einem Webserver speichern und haben so Ihre Notizen immer verfügbar.

source: You can import &kjots; notes in the book file format with an extension <filename class="extension">.book</filename>. Copy this file to <filename>$<envar>KDEHOME</envar>/share/apps/kjots</filename>. Now start <userinput><command>kjotsmigrator <option>--interactive</option></command></userinput> and the data is imported as <guilabel>Book</guilabel> into &kjots;.
de: Sie können &kjots;-Notizen im Format „Buch“ mit einer Dateierweiterung <filename class="extension">.book</filename> importieren. Kopieren Sie diese Datei in den Ordner <filename>$<envar>KDEHOME</envar>/share/apps/kjots</filename>. Nun starten Sie <userinput><command>kjotsmigrator <option>--interactive</option></command></userinput> und die Daten werden als <guilabel>Book</guilabel> in &kjots; importiert.

source: Using Pages
de: Benutzung von Seiten

source: Pages are where you actually write whatever you are going to write. Once you have created a book, you can type text in the main text box.
de: Auf den Seiten halten Sie fest, was auch immer Sie wollen. Sobald Sie ein Buch erzeugt haben, können Sie im Hauptfenster zu tippen beginnen.

source: To create additional pages, you can use <keycombo action="simul">&Ctrl; <keycap>N</keycap></keycombo> or the menu entry <menuchoice><guimenu>File</guimenu><guimenuitem>New Page</guimenuitem> </menuchoice>, which will create a new page. Similarly, the current page can be removed using <menuchoice><guimenu>File</guimenu> <guimenuitem>Delete Page</guimenuitem></menuchoice>.
de: Um weitere Seiten zu erzeugen, können Sie <keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo> drücken oder den Menüeintrag <menuchoice><guimenu>Datei</guimenu><guimenuitem>Neue Seite</guimenuitem> </menuchoice> wählen. Die aktuelle Seite wird durch <menuchoice> <guimenu>Datei</guimenu><guimenuitem>Seite löschen</guimenuitem> </menuchoice> gelöscht.

source: If you need to insert the current date and time while you are writing a note, you can use <keycombo action="simul">&Ctrl;&Shift;<keycap>I </keycap></keycombo>.
de: Wenn Sie die aktuelle Zeit und das aktuelle Datum einfügen wollen, können Sie <keycombo action="simul">&Ctrl;&Shift;<keycap>I</keycap></keycombo> drücken.

source: So that you can get to the page you want to see, pages can (and should) be given a name. This can be done in the way you are used to: double click the page you want to rename. You are then able to rename the page. Of course there is also a keyboard shortcut you can use at any time while writing a note. The shortcut is: <keycombo action="simul">&Ctrl;<keycap>M</keycap></keycombo>.
de: Damit Sie die Seite finden, welche Sie sehen möchten, können (und sollen) Sie ihr einen Namen geben. Das Vergeben eines Namens bzw. Ändern eines bestehenden Namens geschieht auf die gleiche Art, wie anderswo auch: Doppelklicken Sie auf die Seite, die Sie umbenennen möchten. Sie können dann im Namensfeld schreiben. Es gibt auch eine Tastenkombination, die Sie jederzeit beim Erfassen einer Notiz drücken können: <keycombo action="simul">&Ctrl;<keycap>M </keycap></keycombo>.

source: Another way of renaming the page is by selecting a part of your note and then press <keycombo action="simul">&Ctrl;<keycap>T</keycap></keycombo>. The selected text will instantly become the title of the page.
de: Des weiteren können Sie eine Seite umbenennen, indem Sie einen Teil der Notiz auswählen und dann <keycombo action="simul">&Ctrl;<keycap>T</keycap></keycombo> drücken. Der ausgewählte Text wird daraufhin zum Namen der Notiz gemacht.

source: Writing or editing your notes you can use the actions from <guimenu>Format</guimenu> menu or from the toolbar to format your text.
de: Bei Schreiben oder Bearbeiten Ihrer Notizen können Sie die den Text mit den Aktion im Menü <guimenu>Format</guimenu> oder in der Werkzeugleiste formatieren.

source: Credits and License
de: Danksagungen und Lizenz

source: Program copyright 1997 Christoph Neerfeld <email>Christoph.Neerfeld@home.ivm.de</email>
de: Copyright für das Programm 1997 Christoph Neerfeld <email>Christoph.Neerfeld@home.ivm.de</email>

source: Based on the <command>jots</command> program included in the <application>tkgoodstuff</application> package. The <application>tkgoodstuff</application> package is copyright 1995-96 Mark Crimmins <email>markcrim@umich.edu</email>
de: &kjots; ist inspiriert von <command>jots</command>, einem Programm, das im <application> tkgoodstuff</application>-Paket enthalten ist. <application>tkgoodstuff</application> ist Copyright 1995-96 Mark Crimmins <email>markcrim@umich.edu</email>

source: Documentation copyright 2000 &Matt.Johnston; <email>matt.kde@caifex.org</email>
de: Copyright für die Dokumentation 2000 &Matt.Johnston; <email>matt.kde@caifex.org</email>

source: Some parts taken from documentation copyright 1998 Christoph Neerfeld <email>Christoph.Neerfeld@home.ivm.de</email>
de: Auschnitte der Dokumentation stammen von der 1998-Dokumentation von &kjots;, Copyright 1998 Christoph Neerfeld <email>Christoph.Neerfeld@home.ivm.de</email>

source: CREDIT_FOR_TRANSLATORS
de: <para>Übersetzung Gregor Zumstein <email>zumstein@ssd.ethz.ch</email></para>

source: How to obtain &kjots;
de: Woher Sie &kjots; erhalten

source: Compilation and Installation
de: Kompilierung und Installation
