Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdepim/kleopatra.po
Languages: de

source: This function is only available when exactly one &smime; root certificate is selected, and that certificate is currently trusted.
de: Diese Funktion steht nur zur Verfügung, wenn genau ein &smime;-Wurzelzertifikat ausgewählt ist und das Zertifikat vertrauenswürdig ist.

source: Used to undo <xref linkend="certificates-trust-root"/>. See there for details.
de: Diese Funktion wird benutzt, um <xref linkend="certificates-trust-root"/> rückgängig zu machen. Näheres finden Sie in dieser Verknüpfung.

source: <guimenu>Certificates</guimenu><guimenuitem>Certify Certificate...</guimenuitem>
de: <guimenu>Zertifikate</guimenu><guimenuitem>Zertifikat beglaubigen ...</guimenuitem>

source: Allows you to certify another &openpgp; certificate.
de: Ermöglicht es, ein anderes &openpgp;-Zertifikat zu beglaubigen.

source: This function is only available if exactly one &openpgp; certificate is selected.
de: Diese Funktion steht nur zur Verfügung, wenn genau ein &openpgp;-Zertifikat ausgewählt ist.

source: <guimenu>Certificates</guimenu><guimenuitem>Change Expiry Date...</guimenuitem>
de: <guimenu>Zertifikate</guimenu><guimenuitem>Ablaufdatum ändern ...</guimenuitem>

source: Allows to change the expiry date of your &openpgp; certificate.
de: Ermöglicht die Änderung des Ablaufdatums Ihres &openpgp;-Zertifikats.

source: Use this function to extend the lifetime of your &openpgp; certificates as an alternative to either creating a new one, or using unlimited lifetime (<quote>never expires</quote>).
de: Benutzen Sie diese Funktion, um die Verfallszeit Ihrer &openpgp;-Zertifikate zu verlängern, als eine Alternative zum Erstellen eines neuen Zertifikats oder eines unbegrenzten Ablaufdatums (<quote>verfällt nie</quote>).

source: This function is only available if exactly one &openpgp; certificate is selected, and the secret key is available for that certificate.
de: Diese Funktion steht nur zur Verfügung, wenn genau ein &openpgp;-Zertifikat ausgewählt ist und der zugehörige geheime Schlüssel verfügbar ist.

source: <guimenu>Certificates</guimenu><guimenuitem>Change Passphrase...</guimenuitem>
de: <guimenu>Zertifikate</guimenu> <guimenuitem>Kennsatz ändern ...</guimenuitem>

source: Allows to change the passphrase of your secret key.
de: Ermöglicht die Änderung des Kennsatzes des geheimes Schlüssels.

source: This function is only available if exactly one certificate is selected, and the secret key is available for that certificate. It requires a very recent backend, since we changed the implementation from direct calling of &gpg; and &gpgsm; to a &gpgme;-based one.
de: Diese Funktion ist nur dann verwendbar, wenn genau ein Zertifikat ausgewählt ist und der geheime Schlüssel für dieses vorhanden ist. Sie erfordert sehr aktuelle Treiber, da in der Implementierung nicht mehr &gpg; und &gpgsm; direkt aufgerufen wird, sondern auf eine auf &gpgme; basierende Lösung umgestiegen wurde.

source: For security reasons, both the old as well as the new passphrase is asked for by &pinentry;, a separate process. Depending on the platform you are running on and on the quality of the &pinentry; implementation on that platform, it may happen that the &pinentry; window comes up in the background. So, if you select this function and nothing happens, check the operating system's task bar in case a &pinentry; window is open in the background.
de: Aus Sicherheitsgründen ist die Frage durch &pinentry; nach sowohl dem alten als auch dem neuen Kennsatz ein separater Prozess. Abhängig von Ihrem System und der Güte der &pinentry;-Implementierung auf Ihrem System kann es passieren, dass das &pinentry;-Fenster im Hintergrund erscheint. Wenn Sie also diese Funktion gewählt haben und nichts passiert, überprüfen Sie in der Fensterleiste Ihres Betriebssystems, ob ein &pinentry;-Fenster im Hintergrund geöffnet ist.

source: <guimenu>Certificates</guimenu><guimenuitem>Add User-ID...</guimenuitem>
de: <guimenu>Zertifikate</guimenu> <guimenuitem>Benutzerkennung hinzufügen ...</guimenuitem>

source: Allows to add a new User-ID to your &openpgp; certificate.
de: Erlaubt es Ihrem &openpgp;-Zertifikat eine neue Benutzer-ID hinzuzufügen.

source: Use this to add new identities to an existing certificate as an alternative to creating a new key pair. An &openpgp; user-ID has the following form:
de: Nutzen Sie diese Funktion, um neue Identitäten einem bestehendem Zertifikat hinzuzufügen, alternativ zum Erstellen eines neuen Schlüsselpaares. Eine &openpgp;-Benutzer-ID hat die folgende Form:

source: <replaceable>Real&nbsp;Name</replaceable>&nbsp;<optional>(<replaceable>Comment</replaceable>)</optional>&nbsp;&lt;<replaceable>Email</replaceable>&gt;
de: <replaceable>Wirklicher&nbsp;Name</replaceable>&nbsp;<optional>(<replaceable>Kommentar</replaceable>)</optional>&nbsp;&lt;<replaceable>E-Mail</replaceable>&gt;

source: In the dialog that comes up when you select this function, &kleopatra; will ask you for each of the three parameters (<replaceable>Real&nbsp;Name</replaceable>, <replaceable>Comment</replaceable> and <replaceable>Email</replaceable>) separately, and display the result in a preview.
de: In dem Fenster, das beim Auswählen dieser Funktion erscheint, fragt &kleopatra; Sie nach den drei Parametern (<replaceable>Wirklicher&nbsp;Name</replaceable>, <replaceable>Kommentar</replaceable> und <replaceable>E-Mail</replaceable>) getrennt und zeigt das Ergebnis in einer Vorschau an.

source: These parameters are subject to the same Administrator restrictions as in new certificates. See <xref linkend="functions-newkey"/> and <xref linkend="admin-certificate-request-wizard"/> for details.
de: Diese Parameter unterliegen den selben Administrationsrichtlinie wie bei neuen Zertifikaten. Sehen Sie <xref linkend="functions-newkey"/> und <xref linkend="admin-certificate-request-wizard"/> für Details.

source: This function is only available when exactly one &openpgp; certificate is selected, and the secret key is available for that certificate.
de: Diese Funktion steht nur zur Verfügung, wenn genau ein &openpgp;-Zertifikat ausgewählt ist und der zugehörige geheime Schlüssel verfügbar ist.

source: <shortcut><keycombo action="simul"><keycap>Del</keycap></keycombo></shortcut> <guimenu>Certificates</guimenu><guimenuitem>Delete</guimenuitem>
de: <shortcut><keycombo action="simul"><keycap>Entf</keycap></keycombo></shortcut> <guimenu>Zertifikate</guimenu><guimenuitem>Löschen</guimenuitem>

source: <action>Deletes the selected certificates</action> from the local keyring.
de: <action>Löscht die ausgewählten Zertifikate</action> aus dem lokalen Schlüsselspeicher.

source: Use this function to remove unused keys from your local keybox. However, since certificates are typically attached to signed emails, verifying an email might result in the key just removed to pop back into the local keybox. So it is probably best to avoid using this function as much as possible. When you are lost, use the <link linkend="functions-search">search bar</link> or the <xref linkend="view-hierarchical-key-list"/> function to regain control over the lot of certificates.
de: Verwenden Sie diese Funktion, um unbenutzte Schlüssel aus Ihrem lokalen Schlüsselspeicher zu entfernen. Weil Zertifikate aber normalerweise an signierte E-Mail-Nachrichten angehängt sind, kann das Überprüfen einer Nachricht dazu führen, dass ein Schlüssel, den Sie gerade entfernt haben, wieder im lokalen Schlüsselspeicher auftaucht. Daher sollte man dies Funktion weitgehend vermeiden. Wenn Sie sich in den Zertifikaten nicht mehr zurechtfinden, verwenden Sie die <link linkend="functions-search">Suchleiste</link> oder die Funktion <xref linkend="view-hierarchical-key-list"/>, um wieder klar zu sehen.

source: There is one exception to the above: When you delete one of your own certificates, you delete the secret key along with it. This implies that you will not be able to read past communication encrypted to you using this certificate, unless you have a backup somewhere.
de: Zum obigen gibt es eine Ausnahme: Wenn Sie eines Ihrer eigenen Zertifikate löschen, entfernen Sie ebenfalls den geheimen Schlüssel. Dies hat zur Folge, dass Sie nicht mehr in der Lage sind ältere Korrespondenzen, die mit diesem Zertifikat verschlüsselt sind, zu lesen sofern Sie nicht irgendwo eine Sicherungskopie Ihres geheimen Schlüssels haben.

source: &kleopatra; will warn you when you attempt to delete a secret key.
de: &kleopatra; warnt Sie beim Versuch, einen geheimen Schlüssel zu löschen.

source: Due to the hierarchical nature of &smime; certificates, if you delete an &smime; issuer certificate (&ca; certificate), all subjects are deleted, too.
de: Auf Grund der hierarchischen Struktur von &smime;-Zertifikaten werden beim Löschen eines &smime;-Ausstellerzertifikates (&ca;-Zertifikat) auch alle Verwendungen gelöscht.

source: This is the same as a filesystem: When you delete a folder, you delete all files and folders in it, too.
de: Das ist wie bei einem Dateisystem. Wenn Sie einen Ordner löschen, dann werden auch alle darin enthaltenen Dateien und Ordner gelöscht.

source: Naturally, this function is only available if you selected at least one certificate.
de: Natürlich steht diese Funktion steht nur zur Verfügung, wenn mindestens ein Zertifikat ausgewählt ist.

source: <guimenu>Certificates</guimenu><guimenuitem>Dump Certificate</guimenuitem>
de: <guimenu>Zertifikate</guimenu><guimenuitem>Zertifikat ausgeben</guimenuitem>

source: Shows all information that &gpgsm; has about the selected (&smime;) certificate.
de: Zeigt alle Informationen eines ausgewählten (&smime;-)Zertifikates an, die &gpgsm; über dieses hat.

source: See the discussion about <option>--dump-key&nbsp;<replaceable>key</replaceable></option> in the &gpgsm; manual for details about the output.
de: Für nähere Details über die Ausgabe sei auf den Abschnitt <option>--dump-key&nbsp;<replaceable>Schlüssel</replaceable></option> des Handbuchs von &gpgsm; verwiesen.

source: Tools Menu
de: Das Menü Extras

source: <guimenu>Tools</guimenu><guimenuitem>GnuPG Log Viewer...</guimenuitem>
de: <guimenu>Extras</guimenu> <guimenuitem>GnuPG-Protokollanzeige ...</guimenuitem>

source: <action>Starts <ulink url="help:/kwatchgnupg/index.html">&kwatchgnupg;</ulink></action>, a tool to present the debug output of &gnupg; applications. If signing, encryption, or verification mysteriously stop working, you might find out why by looking at the log.
de: <action>Startet <ulink url="help:/kwatchgnupg/index.html">&kwatchgnupg;</ulink></action>, ein Hilfsprogramm, mit dem Sie die Ausgaben des Programms &gnupg; verfolgen können. Wenn das Signieren, Verschlüsseln oder Überprüfen auf einmal mysteriöserweise nicht mehr funktioniert, können Sie so möglicherweise den Grund dafür herausfinden.

source: This function is not available on &Windows;, since the underlying mechanisms are not implemented in the backend on that platform.
de: Da die zugrundeliegenden Mechanismen dieser Funktion unter &Windows; nicht implementiert sind, ist sie dort nicht verfügbar.

source: <guimenu>Tools</guimenu><guimenuitem>Refresh OpenPGP Certificates</guimenuitem>
de: <guimenu>Extras</guimenu> <guimenuitem>OpenPGP-Zertifikate aktualisieren</guimenuitem>

source: <action>Refreshes all &openpgp; certificates</action> by executing <programlisting><command>gpg&nbsp;<option>--refresh-keys</option></command></programlisting> After successful completion of the command, your local keystore will reflect the latest changes with respect to validity of &openpgp; certificates.
de: <action>Aktualisiert alle &openpgp;-Zertifikate</action> durch Ausführung von <programlisting><command>gpg&nbsp;<option>--refresh-keys</option></command></programlisting>. Nach der erfolgreichen Ausführung des Befehls ist der lokale Schlüsselspeicher unter Berücksichtigung der Gültigkeit der &openpgp;-Zertifikate aktualisiert worden.

source: See note under <xref linkend="certificates-refresh-x509"/> for some caveats.
de: Beachten sie die Hinweise zu Warnungen in <xref linkend="certificates-refresh-x509"/>.

source: <guimenu>Tools</guimenu><guimenuitem>Refresh X.509 Certificates</guimenuitem>
de: <guimenu>Extras</guimenu> <guimenuitem>X.509-Zertifikate aktualisieren</guimenuitem>

source: <action>Refreshes all &smime; certificates</action> by executing <programlisting><!-- --><command>gpgsm&nbsp;<!-- --><option>-k</option>&nbsp;<!-- --><option>--with-validation</option>&nbsp;<!-- --><option>--force-crl-refresh</option>&nbsp;<!-- --><option>--enable-crl-checks</option><!-- --></command></programlisting> After successful completion of the command, your local keystore will reflect the latest changes with respect to validity of &smime; certificates.
de: <action>Aktualisiert alle &smime;-Zertifikate</action> durch Ausführung von <programlisting><!-- --><command>gpgsm&nbsp;<!-- --><option>-k</option>&nbsp;<!-- --><option>--with-validation</option>&nbsp;<!-- --><option>--force-crl-refresh</option>&nbsp;<!-- --><option>--enable-crl-checks</option><!-- --></command></programlisting>. Nach der erfolgreichen Ausführung des Befehls ist der lokale Schlüsselspeicher unter Berücksichtigung der Gültigkeit der &smime;-Zertifikate aktualisiert worden.

source: Refreshing &x509; or &openpgp; certificates implies downloading all certificates and &crl;s, to check if any of them have been revoked in the meantime.
de: Das Aktualisieren von &x509;- oder &openpgp;-Zertifikaten beinhaltet das erneute Herunterladen aller Zertifikate und Sperrlisten (&crl;s), um zu überprüfen, ob sie in der Zwischenzeit zurückgezogen wurden.

source: This can put a severe strain on your own as well as other people's network connections, and can take up to an hour or more to complete, depending on your network connection, and the number of certificates to check.
de: Dies kann Ihre Netzwerkverbindung stark belasten und kann bis zu einer Stunde oder länger andauern, abhängig von der Geschwindigkeit Ihrer Netzwerkanbindung sowie der Anzahl der zu überprüfenden Zertifikate.

source: <guimenu>Tools</guimenu><guimenuitem>Import CRL From File...</guimenuitem>
de: <guimenu>Datei</guimenu> <guimenuitem>Sperrliste aus Datei importieren ...</guimenuitem>

source: Lets you manually import &crl;s from files.
de: Importiert Sperrlisten (&crl;) manuell aus Dateien.

source: Normally, Certificate Revocation Lists (&crl;s) are handled transparently by the backend, but it can sometimes be useful to import a &crl; manually into the local &crl; cache.
de: Normalerweise werden Sperrlisten (Zertifikatswiderrufslisten, Certificate Revocation Lists, &crl;s) vom Backend transparent verarbeitet, aber manchmal kann es trotzdem nützlich sein, eine &crl; manuell in den lokalen &crl;-Cache zu importieren.

source: For &crl; import to work, the &dirmngr; tool must be in the search <envar>PATH</envar>. If this menu item is disabled, you should contact the system administrator and ask them to install &dirmngr;.
de: Damit der Import von &crl;s funktionieren kann, muss das Hilfsprogramm &dirmngr; im Suchpfad <envar>PATH</envar> enthalten sein. Wenn dieser Menüeintrag inaktiv ist, dann sollten Sie mit Ihrem Systemverwalter Kontakt aufnehmen und um die Installation von &dirmngr; bitten.

source: <guimenu>Tools</guimenu><guimenuitem>Clear CRL Cache</guimenuitem>
de: <guimenu>Extras</guimenu> <guimenuitem>Sperrlisten-Zwischenspeicher leeren ...</guimenuitem>

source: Clears the &gpgsm; &crl; cache.
de: Leert den Sperrlisten-Zwischenspeicher von &gpgsm;.

source: You probably never need this. You can force a refresh of the &crl; cache by selecting all certificates and using <xref linkend="certificates-refresh-x509"/> instead.
de: Diese Funktion benötigen Sie wahrscheinlich nie. Sie können das Aktualisieren des Sperrlisten-Zwischenspeichers erzwingen, indem Sie alle Zertifikate auswählen und <xref linkend="certificates-refresh-x509"/> aufrufen.

source: <guimenu>Tools</guimenu><guimenuitem>Dump CRL Cache</guimenuitem>
de: <guimenu>Extras</guimenu> <guimenuitem>Sperrlisten-Zwischenspeicher ausgeben ....</guimenuitem>

source: Shows the detailed contents of the &gpgsm; &crl; cache.
de: Zeigt den genauen Inhalt des Sperrlisten-Zwischenspeichers von &gpgsm; an.

source: Settings Menu
de: Das Menü Einstellungen

source: &kleopatra; has a default &kde; <guimenu>Settings</guimenu> menu as described in the <ulink url="help:/fundamentals/ui.html#menus-settings">&kde; Fundamentals</ulink> with one additional entry:
de: &kleopatra; hat das bekannten &kde;-Menü <guimenu>Einstellungen</guimenu> aus den <ulink url="help:/fundamentals/ui.html#menus-settings">&kde;-Grundlagen</ulink> mit einem zusätzlichen Eintrag:

source: <guimenu>Settings</guimenu><guimenuitem>Perform Self-Test</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>Selbsttest durchführen</guimenuitem>

source: Performs a set of self-tests and presents their result.
de: Führt alle Selbsttests durch und zeigt deren Ergebnisse.

source: This is the same set of tests that is run at startup by default. If you disabled startup-time self-tests, you can re-enable them here.
de: Dies sind die gleichen Tests, die beim Starten ausgeführt werden. Sollten Sie die Selbsttests beim Starten ausgeschaltet haben, können Sie diese hier wieder einschalten.

source: Window Menu
de: Das Menü Fenster

source: The <guimenu>Window</guimenu> menu allows you to manage the tabs. Using the items in this menu you can rename a tab, add a new tab, duplicate the current tab, close the current tab, and move the current tab to the left or right.
de: Im Menü <guimenu>Fenster</guimenu> können die Unterfenster verwaltet werden. Mit den Einträgen können Unterfenster umbenannt, hinzugefügt, dupliziert, geschlossen und nach rechts oder links verschoben werden.

source: By clicking with the &RMB; click on a tab you open a context menu, where you can also select the same actions.
de: Wenn Sie mit der &RMBn; auf einen Karteireiter klicken, wird ein Kontextmenü mit denselben Aktion geöffnet.

source: Help Menu
de: Das Menü Hilfe

source: &kleopatra; has a default &kde; <guimenu>Help</guimenu> menu as described in the <ulink url="help:/fundamentals/ui.html#menus-help">&kde; Fundamentals</ulink>.
de: &kleopatra; hat das bekannten &kde;-Menü <guimenu>Hilfe</guimenu> das in den <ulink url="help:/fundamentals/ui.html#menus-help">&kde;-Grundlagen</ulink> erläutert wird.

source: Command Line Options Reference
de: Referenz der Befehlszeilenoptionen

source: Only the options specific to &kleopatra; are listed here. As with all &kde; applications, you can get a complete list of options by issuing the command <userinput><command>kleopatra <option>--help</option></command></userinput>.
de: Hier werden nur die &kleopatra;-spezifischen Optionen aufgezählt. Wie bei allen &kde;-Applikationen können Sie durch Aufrufen von <userinput><command>kleopatra <option>--help</option></command></userinput> eine vollständige Liste aller Optionen bekommen.

source: Location of the socket the ui server is listening on
de: Adresse der Socket-Datei, an der der Benutzerschnittstellen-Server auf Befehle wartet

source: Run UI server only, hide main window
de: Nur Benutzerschnittstellen-Server starten, Hauptfenster nicht anzeigen

source: Use &openpgp; for the following operation
de: Für die folgende Operation &openpgp; verwenden

source: Use CMS (&x509;, S/&MIME;) for the following operation
de: Für die folgende Operation CMS (&x509;, S/&MIME;) verwenden

source: Specifies a file or &URL; from which to import certificates (or secret keys) from.
de: Gibt eine Datei oder &URL; an, aus der Zertifikate (oder geheime Schlüssel) importiert werden sollen.

source: This is the command line equivalent of <xref linkend="file-import-certificates"/>.
de: Dies ist das Befehlszeilen-Gegenstück zu <xref linkend="file-import-certificates"/>.

source: Encrypt file(s)
de: Datei(en) verschlüsseln

source: Sign file(s)
de: Datei(en) unterschreiben

source: Encrypt and/or sign file(s). Same as <option>--sign-encrypt</option>, do not use
de: Verschlüsseln und/oder Signieren von Datei(en). Analog zu <option>--sign-encrypt</option>, nicht benutzen

source: Decrypt file(s)
de: Datei(en) entschlüsseln

source: Verify file/signature
de: Datei/Signatur überprüfen

source: Decrypt and/or verify file(s)
de: Dateien entschlüsseln/überprüfen

source: Configuring &kleopatra;
de: &kleopatra; einrichten

source: &kleopatra;'s configure dialog can be accessed via <menuchoice><guimenu>Settings</guimenu><guimenuitem>Configure &kleopatra;...</guimenuitem></menuchoice>
de: Den Einrichtungsdialog von &kleopatra; öffnen Sie mit <menuchoice><guimenu>Einstellungen</guimenu> <guimenuitem>&kleopatra; einrichten ...</guimenuitem></menuchoice>.

source: Each of its pages is described in the sections below.
de: Sämtliche Seiten dieses Dialogs werden in den folgenden Abschnitten beschrieben.

source: Configuring Directory Services
de: Einrichtung von Zertifikatsservern

source: On this page, you can configure which &ldap; servers to use for &smime; certificate searches, and which key servers to use for &openpgp; certificate searches.
de: Auf dieser Seite können Sie einstellen welche &ldap;-Server für die Suche nach &smime;-Zertifikaten genutzt werden sollen und welche Schlüsselserver für die Suche nach &openpgp;-Zertifikaten.

source: This is simply a more user-friendly version of the same settings you also find in <xref linkend="configuration-gnupg-system"/>. Everything you can configure here, you can configure there, too.
de: Dies ist eine benutzerfreundlichere Version der gleichen Einstellungen, wie sie unter <xref linkend="configuration-gnupg-system"/> zu finden sind. Alles, was Sie hier einstellen können, ist auch dort möglich.

source: A Note On Proxy Settings
de: Ein Hinweis zu den Proxy-Einstellungen

source: Proxy settings can be configured for &http; and &ldap; in <xref linkend="configuration-smime-validation"/>, but only for &gpgsm;. For &gpg;, due to the complexity of keyserver options in &gpg; and lack of proper support for them in &gpgconf;, you currently need to modify the config file <filename>gpg.conf</filename> directly. Please refer to the &gpg; manual for details. &kleopatra; will preserve such settings, but does not yet allow to modify them in the &GUI;.
de: Die Proxy-Einstellungen für &http; und &ldap; können in <xref linkend="configuration-smime-validation"/> eingestellt werden, allerdings nur für &gpgsm;. Auf Grund der Komplexität der &gpg;-Schlüsselserveroptionen und fehlender Unterstützung dieser in &gpgconf; müssen Sie die Proxyeinstellungen für &gpg; in der Konfigurationsdatei <filename>gpg.conf</filename> selbst vornehmen. Bitte sehen Sie im Handbuch von &gpg; für Details hierüber nach. &kleopatra; wird die dort vorgenommenen Einstellungen beibehalten aber erlaubt es noch nicht diese in der &GUI; zu ändern.

source: The <guilabel>Directory services</guilabel> table shows which servers are currently configured. Double-click on a cell in the table to change parameters of existing server entries.
de: Die <guilabel>Verzeichnisdienste</guilabel>-Tabelle zeigt an, welche Server derzeit eingerichtet sind. Mit einem Doppelklick in eine Zelle lassen sich die Parameter bestehender Einträge bearbeiten.

source: The meaning of the columns in the table is as follows:
de: Die Spalten in dieser Tabelle bedeuten:

source: Scheme
de: Protokoll
