Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdepim/kleopatra.po
Languages: de

source: Customizing the &dn; fields
de: Anpassung der &dn;-Felder

source: &kleopatra; allows you to customize the fields that the user is allowed to enter in order to create their certificate.
de: Sie können in &kleopatra; die Felder anpassen, die der Benutzer ausfüllen muss, um ein Zertifikat zu erzeugen.

source: Create a group called <literal>CertificateCreationWizard</literal> in the system-wide <filename>kleopatrarc</filename>. If you want a custom order of attributes or if you only want certain items to appear, create a key called <varname>DNAttributeOrder</varname>. The argument is one or more of <varname>CN,SN,GN,L,T,OU,O,PC,C,SP,DC,BC,EMAIL</varname> If you want to initialize fields with a certain value, write something like Attribute=value. If you want the attribute to be treated as a required one, append an exclamation mark (e.g. <varname>CN!,L,OU,O!,C!,EMAIL!</varname>, which happens to be the default configuration).
de: Legen Sie eine Gruppe namens <literal>CertificateCreationWizard</literal> in der systemweiten <filename>kleopatrarc</filename>-Datei an. Wenn Sie die Reihenfolge der Attribute verändern wollen, oder nur bestimmte Elemente anzeigen wollen, dann definieren Sie einen Schlüssel namens <varname>DNAttributeOrder</varname>. Das Argument besteht aus einem oder mehreren der Elementen <varname>CN,SN,GN,L,T,OU,O,PC,C,SP,DC,BC,EMAIL</varname>. Wenn Sie Felder mit einem bestimmten Wert initialisieren wollen, dann schreiben Sie Attribut=Wert. Wenn das Attribut obligatorisch sein soll, dann fügen Sie ihm ein Ausrufungszeichen an (wie in <varname>CN!,L,OU,O!,C!,EMAIL!</varname>, der Standardeinstellung).

source: Using the <acronym>KIOSK</acronym> mode modifier <varname>$e</varname> allows to retrieve the values from environment variables or from an evaluated script or binary. If you want to disallow editing of the respective field in addition, use the modifier <varname>$i</varname>. If you want to disallow the use <guibutton>Insert My Address</guibutton> button, set <varname>ShowSetWhoAmI</varname> to false.
de: Mit dem <acronym>KIOSK</acronym>-Modus-Modifikator <varname>$e</varname> können Sie Werte aus Umgebungsvariablen oder einem ausgewerteten Skript oder Binärprogramm verwenden. Wenn Sie außerdem noch das Editieren des entsprechenden Feldes verhindern wollen, verwenden Sie den Modifikator <varname>$i</varname>. Wenn Sie die Benutzung der Schaltfläche <guibutton>Meine Adresse einfügen</guibutton> verbieten wollen, dann setzen Sie <varname>ShowSetWhoAmI</varname> auf false.

source: Due to the nature of the &kde; <acronym>KIOSK</acronym> framework, using the immutable flag (<varname>$i</varname>) makes it impossible for the user to override the flag. This is intended behavior. <varname>$i</varname> and <varname>$e</varname> can be used with all other config keys in &kde; applications as well.
de: Aufgrund der Funktionsweise des <acronym>KIOSK</acronym>-Systems von &kde;, ist es für den Benutzer unmöglich, den Schalter <varname>$i</varname> zu überschreiben. Das ist das beabsichtigte Verhalten. <varname>$i</varname> und <varname>$e</varname> können auch bei allen anderen Konfigurationsschlüsseln in &kde;-Applikationen verwendet werden.

source: The following example outlines possible customizations:
de: Das folgende Beispiel zeigt mögliche Anpassungen:

source: [CertificateCreationWizard] ;Disallow to copy personal data from the addressbook, do not allow local override ShowSetWhoAmI[$i]=false ;sets the user name to $USER CN[$e]=$USER ;sets the company name to "My Company", disallows editing O[$i]=My Company ;sets the department name to a value returned by a script OU[$ei]=$(lookup_dept_from_ip) ; sets country to DE, but allows for changes by the user C=DE
de: [CertificateCreationWizard] ;Persönliche Daten dürfen nicht aus dem Adressbuch kopiert werden; ;lokales Überschreiben ist verboten ShowSetWhoAmI[$i]=false ;Benutzername mit $USER vordefinieren CN[$e]=$USER ;Firmenname mit "Meine Firma" vordefinieren; editieren verbieten O[$i]=Meine Firma ;Den Abteilungsnamen mit dem Rückgabewert eines Skripts vordefinieren OU[$ei]=$(lookup_dept_from_ip) ; das Land mit DE vordefinieren, aber Änderungen durch den Benutzer zulassen C=DE

source: Restricting the Types of Keys a User is Allowed to Create
de: Beschränkung der Schlüsselarten, die ein Benutzer erzeugen darf

source: &kleopatra; also allows to restrict which type of certificates a user is allowed to create. Note, however, that an easy way around these restrictions is to just create one on the command line.
de: In &kleopatra; kann auch die Art der Zertifikate beschränkt werden, die ein Benutzer erzeugen darf. Beachten Sie aber, das diese Einschränkungen leicht umgangen werden können, indem das Zertifikat in einer Konsole auf der Befehlszeile generiert wird.

source: Public Key Algorithms
de: Algorithmen für öffentliche Schlüssel

source: To restrict the public key algorithm to use, add the config key <varname>PGPKeyType</varname> (and <varname>CMSKeyType</varname>, but only <acronym>RSA</acronym> is supported for <acronym>CMS</acronym> anyway) to the <literal>CertificateCreationWizard</literal> section of <filename>kleopatrarc</filename>.
de: Um den verwendeten Algorithmus für öffentliche Schlüssel zu beschränken, fügen Sie den Einrichtungsschlüssel <varname>PGPKeyType</varname> und <varname>CMSKeyType</varname> (für <acronym>CMS</acronym>-Typen wird nur <acronym>RSA</acronym> unterstützt) zum Abschnitt <literal>CertificateCreationWizard</literal> in der Datei <filename>kleopatrarc</filename> ein.

source: The allowed values are <literal>RSA</literal> for <acronym>RSA</acronym> keys, <literal>DAS</literal> for <acronym>DSA</acronym> (sign-only) keys, and <literal>DSA+ELG</literal> for a <acronym>DSA</acronym> (sign-only) key with an Elgamal subkey for encryption.
de: Die erlaubten Werte sind <literal>RSA</literal> für <acronym>RSA</acronym>-Schlüssel, <literal>DSA</literal> für <acronym>DSA</acronym>-Schlüssel (nur zur Signierung) und <literal>DSA+ELG</literal> für einen <acronym>DSA</acronym>-Schlüssel (nur zur Signierung) mit einem Elgamal-Unterschlüssel zum Verschlüsseln.

source: The default is read from &gpgconf; or else <literal>RSA</literal> if &gpgconf; doesn't provide a default.
de: Der Standardwert wird aus der Datei &gpgconf; eingelesen. Ist hier kein Standard eingetragen, wird <literal>RSA</literal> verwendet.

source: Public Key Size
de: Größe des öffentlichen Schlüssels

source: To restrict the available keys sizes for a public algorithm, add the config key <varname><replaceable>&lt;ALG&gt;</replaceable>KeySizes</varname> (where <replaceable>ALG</replaceable> may be <literal>RSA</literal>, <literal>DSA</literal> or <literal>ELG</literal>) to the <literal>CertificateCreationWizard</literal> section of <filename>kleopatrarc</filename>, containing a comma-separated list of keysizes (in bits). A default may be indicated by prefixing the keysize with a hyphen (<literal>-</literal>).
de: Um die mögliche Schlüsselgröße für einen öffentlichen Algorithmus zu beschränken, fügen Sie den Einrichtungsschlüssel <varname><replaceable>&lt;ALG&gt;</replaceable>KeySizes</varname> (erlaubte Werte für <replaceable>ALG</replaceable> <literal>RSA</literal>, <literal>DSA</literal> oder <literal>ELG</literal>) zum Abschnitt <literal>CertificateCreationWizard</literal> der Datei <filename>kleopatrarc</filename> ein. Tragen Sie als Wert eine durch Kommata getrennte Liste von Schlüsselgrößen in Bit ein. Der Standardwert wird durch das Voranstellen eines Bindestrichs (<literal>-</literal>) gekennzeichnet.

source: The above would restrict allowed <acronym>RSA</acronym> key sizes to 1536, 2048 and 3072, with 2048 the default.
de: In diesem Beispiel sind nur <acronym>RSA</acronym>-Schlüsselgrößen von 1536, 2048 und 3072 Bit erlaubt, der Standardwert ist 2048 Bit.

source: In addition to the sizes themselves, you may also specify labels for each of the sizes. Simply set the config key <varname><replaceable>ALG</replaceable>KeySizeLabels</varname> to a comma-separated list of labels.
de: Zusätzlich zur Größe selbst können Sie auch Marken für jede Größe bestimmen. Geben Sie dazu für den Einrichtungsschlüssel <varname><replaceable>ALG</replaceable>KeySizeLabels</varname> ein durch Kommata getrennte Liste von Marken ein.

source: The above, in connection with the previous example, would print something like the following options for selection:
de: Zusammen ergeben die beiden oben genannten Beispiele die folgende Möglichkeit zur Auswahl:

source: The defaults are as if the following was in effect:
de: Die Standardwerte entsprechen der folgenden Vorgabe:

source: Creating and Editing Key Categories
de: Schlüsselkategorien erzeugen und editieren

source: &kleopatra; allows the user to configure the <link linkend="configuration-appearance-certificate-filters">visual appearance</link> of keys based on a concept called <guilabel>Key Categories</guilabel>. <guilabel>Key Categories</guilabel> are also used to filter the list of certificates. This section describes how you can edit the available categories and add new ones.
de: Sie können in &kleopatra; das <link linkend="configuration-appearance-certificate-filters">Aussehen</link> von Schlüsseln auf der Basis eines Konzepts namens <guilabel>Schlüsselkategorien</guilabel> verändern. <guilabel>Schlüsselkategorien</guilabel> werden auch benutzt, um die Liste der Zertifikate zu filtern. In diesem Abschnitt beschreiben wir, wie Sie die verfügbaren Kategorien editieren und neue hinzufügen können.

source: When trying to find the category a key belongs to, &kleopatra; tries to match the key to a sequence of key filters, configured in the <filename>libkleopatrarc</filename>. The first one to match defines the category, based on a concept of <emphasis>specificity</emphasis>, explained further below.
de: Um herauszufinden, zu welcher Kategorie ein Schlüssel gehört, versucht &kleopatra;, den Schlüssel mit einer Folge von Schlüsselfiltern abzugleichen, die in der Datei <filename>libkleopatrarc</filename> konfiguriert sind. Der erste passende Filter definiert die Kategorie, basierend auf dem später erläuterten Konzept der <emphasis>Genauigkeit</emphasis>.

source: Each key filter is defined in a config group named <literal>Key Filter #<replaceable>n</replaceable></literal>, where <replaceable>n</replaceable> is a number, starting from <literal>0</literal>.
de: Jeder Schlüsselfilter ist in einer Konfigurationsgruppe namens <literal>Key Filter #<replaceable>n</replaceable></literal> definiert, wobei <replaceable>n</replaceable> eine Zahl ist, beginnend bei <literal>0</literal>.

source: The only mandatory keys in a <literal>Key Filter #<replaceable>n</replaceable></literal> group are <varname>Name</varname>, containing the name of the category as displayed in the <link linkend="configuration-appearance-certificate-filters">config dialog</link>, and <varname>id</varname>, which is used as a reference for the filter in other configuration sections (such as <literal>View #<replaceable>n</replaceable></literal>).
de: Die einzigen obligatorischen Schlüssel in einer solchen <literal>Key Filter #<replaceable>n</replaceable></literal>-Gruppe sind der <varname>Name</varname>, der den Namen der Kategorie enthält, wie er im <link linkend="configuration-appearance-certificate-filters">Einrichtungsdialog</link> angezeigt wird und <varname>id</varname>, die als Verweis auf Filter in anderen Abschnitten der Einrichtungsdatei dient, wie zum Beispiel <literal>View #<replaceable>n</replaceable></literal>.

source: lists all keys that define the display properties of keys belonging to that category (&ie; those keys that can be adjusted in the <link linkend="configuration-appearance-certificate-filters">config dialog</link>), whereas <xref linkend="table-key-filters-criteria"/> lists all keys that define the criteria the filter matches keys against.
de: führt alle Schlüssel auf, die die Anzeigeeigenschaften von Schlüsseln dieser Kategorie definieren (&ie; die Schlüssel, die im <link linkend="configuration-appearance-certificate-filters">Einrichtungsdialog</link> editiert werden können), wohingegen <xref linkend="table-key-filters-criteria"/> alle Schlüssel auflistet, die die Kriterien definieren, anhand denen Filter mit Schlüsseln verglichen werden.

source: Key-Filter Configuration Keys Defining Display Properties
de: Schlüsselfilter-Konfigurationsschlüssel, die Anzeigeeigenschaften definieren

source: Config Key
de: Konfigurationsschlüssel

source: Type
de: Typ

source: Description
de: Beschreibung

source: color
de: Farbe

source: The background color to use. If missing, defaults to whichever background color is defined globally for list views.
de: Die zu verwendende Hintergrundfarbe. Wenn dieser Schlüssel nicht vorhanden ist, wird als Vorgabe die global definierte Hintergrundfarbe für Listenansichten verwendet.

source: The foreground color to use. If missing, defaults to whichever foreground color is defined globally for list views.
de: Die zu verwendende Vordergrundfarbe. Wenn dieser Schlüssel nicht vorhanden ist, wird als Vorgabe die global definierte Vordergrundfarbe für Listenansichten verwendet.

source: <entry>font</entry>
de: <entry>Zeichensatz</entry>

source: The custom font to use. The font will be scaled to the size configured for list views, and any font attributes (see below) will be applied.
de: Der zu verwendende benutzerdefinierte Zeichensatz. Der Zeichensatz wird auf die für Listenansichten konfigurierte Größe skaliert, und mit Zeichensatzattributen (siehe unten) versehen.

source: boolean
de: Boolescher Wert

source: If set to <literal>true</literal> and <varname>font</varname> is not set, uses the default list view font with bold font style added (if available). Ignored if <varname>font</varname> is also present.
de: Wenn dieser Schlüssel den Wert <literal>true</literal> hat und <varname>font</varname> nicht gesetzt ist, dann wird der Standard-Listen-Zeichensatz in Fettschrift (so verfügbar) verwendet. Wenn auch <varname>font</varname> vorhanden ist, wird dieser Schlüssel ignoriert.

source: Analogous to <varname>font-bold</varname>, but for italic font style instead of bold.
de: Analog zu <varname>font-bold</varname>, aber für kursiven Schriftstil anstelle von fettem.

source: If <literal>true</literal>, draws a centered line over the font. Applied even if <varname>font</varname> is set.
de: Wenn dieser Schlüssel den Wert <literal>true</literal> hat, dann wird eine zentrierte Linie durch den Zeichensatz gezogen. Wird auch dann verwendet, wenn <varname>font</varname> gesetzt ist.

source: The name of an icon to show in the first column. Not yet implemented.
de: Der Name eines Icons, das in der ersten Spalte angezeigt wird. Noch nicht implementiert.

source: Key-Filter Configuration Keys Defining Filter Criteria
de: Schlüsselfilter-Konfigurationsschlüssel, die Filterkriterien definieren

source: If specified, filter matches when...
de: Wenn dieser Schlüssel angegeben ist, passt der Filter, wenn ...

source: the key has been revoked.
de: der Schlüssel widerrufen worden ist.

source: context
de: Kontext

source: Context is an enumeration with the following allowed values: <literal>appearance</literal>, <literal>filtering</literal> and <literal>any</literal>.
de: Kontext besteht aus einer Aufzählung der folgenden zulässigen Werte: <literal>appearance</literal>, <literal>filtering</literal> und <literal>any</literal>.

source: the context in which this filter matches.
de: der Kontext der auf diesen Filter passt.

source: the key is expired.
de: der Schlüssel abgelaufen ist.

source: the key has been disabled (marked for not using) by the user. Ignored for &smime; keys.
de: der Schlüssel vom Benutzer deaktiviert worden ist (nicht mehr benutzt werden soll). Wird bei &smime;-Schlüsseln ignoriert.

source: the key is a root certificate. Ignored for &openpgp; keys.
de: der Schlüssel ein Wurzelzertifikat ist. Wird bei &openpgp;-Schlüsseln ignoriert.

source: the key can be used for encryption.
de: der Schlüssel zum Verschlüsseln verwendet werden kann.

source: the key can be used for signing.
de: der Schlüssel zum Signieren verwendet werden kann.

source: the key can be used for signing (certifying) other keys.
de: der Schlüssel zum Signieren (Zertifizieren) anderer Schlüssel verwendet werden kann.

source: the key can be used for authentication (&eg; as an <acronym>TLS</acronym> client certificate).
de: der Schlüssel zur Authentifikation (etwa als <acronym>TLS</acronym>-Client-Zertifikat) verwendet werden kann.

source: the key can be used to make Qualified Signatures (as defined by the German Digital Signature Law).
de: der Schlüssel kann benutzt werden, um qualifizierte Signaturen zu erzeugen, wie sie im deutschen Signaturgesetz ((Gesetz über Rahmenbedingungen für elektronische Signaturen) definiert sind.

source: the key material is stored on a smartcard (instead of on the computer).
de: der Schlüssel wird auf einer Chipkarte und nicht auf dem Rechner gespeichert.

source: the secret key for this key pair is available.
de: der geheime Schlüssel zu diesem Schlüsselpaar zur Verfügung steht.

source: the key is an &openpgp; key (<literal>true</literal>), or an &smime; key (<literal>false</literal>).
de: der Schlüssel ein &openpgp;-Schlüssel (<literal>true</literal>) oder ein &smime;-Schlüssel (<literal>false</literal>) ist.

source: the key has been validated.
de: der Schlüssel überprüft worden ist.

source: <replaceable>prefix</replaceable>-ownertrust
de: <replaceable>pr&auml;fix</replaceable>-ownertrust

source: validity
de: Gültigkeit

source: Validity is an (ordered) enumeration with the following allowed values: <literal>unknown</literal>, <literal>undefined</literal>, <literal>never</literal>, <literal>marginal</literal>, <literal>full</literal>, <literal>ultimate</literal>. See the &gpg; and &gpgsm; manuals for a detailed explanation.
de: Die Gültigkeit ist eine (geordnete) Aufzählung mit den folgenden zulässigen Werten: <literal>unknown</literal>, <literal>undefined</literal>, <literal>never</literal>, <literal>marginal</literal>, <literal>full</literal> und <literal>ultimate</literal>. Eine vollständige Beschreibung finden Sie in den Handbüchern zu &gpg; und &gpgsm;.

source: the key has exactly (<replaceable>prefix</replaceable>&nbsp;=&nbsp;<literal>is</literal>), has anything but (<replaceable>prefix</replaceable>&nbsp;=&nbsp;<literal>is-not</literal>), has at least (<replaceable>prefix</replaceable>&nbsp;=&nbsp;<literal>is-at-least</literal>), or has at most (<replaceable>prefix</replaceable>&nbsp;=&nbsp;<literal>is-at-most</literal>) the ownertrust given as the value of the config key. If more than one <varname><replaceable>prefix</replaceable>-ownertrust</varname> keys (with different <replaceable>prefix</replaceable> values) are present in a single group, the behavior is undefined.
de: der Schlüssel hat genau (<replaceable>pr&auml;fix</replaceable>&nbsp;=&nbsp;<literal>is</literal>), hat alle außer (<replaceable>pr&auml;fix</replaceable>&nbsp;=&nbsp;<literal>is-not</literal>), hat mindestens (<replaceable>pr&auml;fix</replaceable>&nbsp;=&nbsp;<literal>is-at-least</literal>), oder hat höchstens (<replaceable>pr&auml;fix</replaceable>&nbsp;=&nbsp;<literal>is-at-most</literal>) das Eigentümer-Vertrauen, das als Wert des Konfigurationsschlüssels angegeben ist. Wenn mehr als ein <varname><replaceable>pr&auml;fix</replaceable>-ownertrust</varname>-Schlüssel (mit unterschiedlichen <replaceable>pr&auml;fix</replaceable>-Werten) in einer einzigen Gruppe steht, ist das Verhalten undefiniert.

source: <replaceable>prefix</replaceable>-validity
de: <replaceable>pr&auml;fix</replaceable>-validity

source: Analogous to <varname><replaceable>prefix</replaceable>-ownertrust</varname>, but for key validity instead of ownertrust.
de: Entsprechend <varname><replaceable>pr&auml;fix</replaceable>-ownertrust</varname>, aber für die Gültigkeit von Schlüsseln anstelle vom Eigentümer-Vertrauen.

source: Some of the more interesting criteria, such as <varname>is-revoked</varname> or <varname>is-expired</varname> will only work on <emphasis>validated</emphasis> keys, which is why, by default, only validated keys are checked for revocation and expiration, although you are free to remove these extra checks.
de: Einige der interessanteren Kriterien wie <varname>is-revoked</varname> oder <varname>is-expired</varname> funktionieren nur bei <emphasis>validierten</emphasis> Schlüsseln, weswegen standardmäßig nur überprüfte Schlüssel auf Widerruf oder Ablauf geprüft werden, auch wenn es Ihnen frei steht, diese zusätzlichen Abfragen zu entfernen.

source: In addition to the config keys listed above, a key filter may also have an <varname>id</varname> and <varname>match-contexts</varname>.
de: Zusätzlich zu den oben genannten Konfigurationsschlüsseln kann ein Schlüsselfilter auch noch die Attribute <varname>id</varname> und <varname>match-contexts</varname> haben.

source: Using the filter's <varname>id</varname>, which defaults to the filter's config group name if not given or empty, you can reference the key filter elsewhere in the configuration, &eg; in &kleopatra;'s View configurations. The <varname>id</varname> is not interpreted by &kleopatra;, so you can use any string you like, as long as it's unique.
de: Mit der <varname>id</varname> des Filters ist überall in der Konfiguration der Zugriff auf den Schlüsselfilter möglich, &eg; in &kleopatra;s Konfiguration des Erscheinungsbilds. Der Standardwert der <varname>id</varname> ist der Name der Gruppe in der Konfigurationsdatei, falls nicht anders angegeben. Der Wert darf auch nicht gesetzt sein. Die <varname>id</varname> wird durch &kleopatra; nicht verarbeitet und kann daher einen beliebigen Text enthalten, der aber eindeutig sein muss.

source: The <varname>match-contexts</varname> limits the applicability of the filter. Two contexts are currently defined: The <literal>appearance</literal> context is used when defining coloring and font properties for the views. The <literal>filtering</literal> context is used to selectively include (and exclude) certificate from views. <literal>any</literal> can be used to signify all currently defined contexts, and is the default if <varname>match-contexts</varname> is not given, or otherwise produces no contexts. This ensures that no key filter can end up <quote>dead</quote>, &ie; with no contexts to apply it in.
de: Das Attribut <varname>match-contexts</varname> begrenzt die Anwendungsmöglichkeit des Filters. Es sind zurzeit zwei Kontexte definiert: <literal>appearance</literal> wird benutzt zur Definition von Farben und Schriften für die Anzeige. Mit <literal>filtering</literal> werden Zertifikate in der Ansicht ein- oder ausgeblendet. <literal>any</literal> kann zur Kennzeichnung aller aktuell definierten Kontexte verwendet werden. Dies ist die Voreinstellung, wenn <varname>match-contexts</varname> nicht definiert ist oder sich ansonsten kein Kontext ergibt. Damit wird sichergestellt, dass es keinen Filter ohne Kontext gibt.
