Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdepim/kleopatra.po
Languages: de

source: The format of the entry is a list of tokens, separated by non-word characters. Each of the tokens is optionally prefixed by an exclamation point (<literal>!</literal>), indicating negation. The tokens act in order on an internal list of contexts, which starts out empty. This is best explained by an example: <literal>any !appearance</literal> is the same as <literal>filtering</literal>, and <literal>appearance !appearance</literal> is producing the empty set, as is <literal>!any</literal>. However, the last two will be internally replaced by <literal>any</literal>, since they produce no contexts at all.
de: Ein Eintrag besteht aus einer Liste von Zeichengruppen, getrennt durch Leerzeichen. Jeder Zeichengruppe kann ein Ausrufungszeichen (<literal>!</literal>) vorangestellt werden, damit wird der Ausdruck verneint. Die Zeichengruppen werden der Reihe nach auf eine interne Liste von Kontexten angewendet, die zu Beginn leer ist. Das lässt sich am Besten an einem Beispiel erklären: <literal>any !appearance</literal> entspricht <literal>filtering</literal>, und <literal>appearance !appearance</literal> ebenso wie <literal>!any</literal> ergeben eine leere Menge. Die letzten beiden Ergebnisse werden intern durch <literal>any</literal> ersetzt, da sie keinerlei Kontext ergeben.

source: In general, criteria not specified (&ie; the config entry is not set) are not checked for. If a criterion is given, it is checked for and must match for the filter as a whole to match, &ie; the criteria are AND'ed together.
de: Nicht angegebene Kriterien (Kriterien, deren Konfigurationsschl&uuml;ssel nicht angegeben ist), werden nicht abgefragt. Wenn ein Kriterium angegeben ist, dann wird es abgefragt und muss zutreffen, damit der Filter als Ganzes zutrifft; die einzelnen Kriterien werden also UND-verknüpft.

source: Each filter has an implied <quote>specificity</quote> that is used to rank all matching filters. The more specific filter wins over less specific ones. If two filters have the same specificity, the one that comes first in the config file wins. A filter's specificity is proportional to the number of criteria it contains.
de: Jeder Filter beinhaltet eine <quote>Genauigkeit</quote>, die alle passenden Filter bewertet. Der genauere Filter wird dem weniger genauen vorgezogen. Haben zwei Filter die gleiche Genauigkeit, wird der zuerst in der Konfigurationsdatei aufgeführte benutzt. Die Genauigkeit entspricht der Anzahl der Kriterien des Filters.

source: Examples of key filters
de: Beispiele für Schlüsselfilter

source: To check for all expired, but non-revoked root certificates, you would use a key filter defined as follows:
de: Um alle abgelaufenen, aber nicht widerrufenen Wurzel-Zertifikate abzufragen, würden Sie den folgenden Schlüsselfilter verwenden:

source: <!-- -->[Key Filter #<replaceable>n</replaceable>] Name=expired, but not revoked was-validated=true is-expired=true is-revoked=false is-root-certificate=true ; ( specificity 4 )<!-- -->
de: <!-- -->[Key Filter #<replaceable>n</replaceable>] Name=abgelaufen, aber nicht widerrufen was-validated=true is-expired=true is-revoked=false is-root-certificate=true ; ( specificity 4 )<!-- -->

source: To check for all disabled &openpgp; keys (not yet supported by &kleopatra;) with ownertrust of at least <quote>marginal</quote>, you would use:
de: Um alle deaktivierten &openpgp;-Schlüssel (derzeit noch nicht von &kleopatra; unterstützt) mit einem Eigentümer-Vertrauen von mindestens <quote>marginal</quote> abzudecken, verwenden Sie:

source: <!-- -->[Key Filter #<replaceable>n</replaceable>] Name=disabled OpenPGP keys with marginal or better ownertrust is-openpgp=true is-disabled=true is-at-least-ownertrust=marginal ; ( specificity 3 )<!-- -->
de: <!-- -->[Key Filter #<replaceable>n</replaceable>] Name=deaktivierte OpenPGP-Schlüssel mit einem Ownertrust von marginal oder besser is-openpgp=true is-disabled=true is-at-least-ownertrust=marginal ; ( specificity 3 )<!-- -->

source: Configuring Archivers for Use with Sign/Encrypt Files
de: Einstellung von Archivierungs-Programmen für die Benutzung mit <quote>Dateien signieren/verschlüsseln ...</quote>

source: &kleopatra; allows the administrator (and power-user) to configure the list of archivers that are presented in the Sign/Encrypt Files dialog.
de: &kleopatra; ermöglicht dem Systemverwalter (und erfahrenen Benutzer) die Liste der Archivierungs-Programme, die im <quote>Dateien signieren/verschlüsseln ...</quote>-Dialog wählbar sind, einzustellen.

source: Each archiver is defined in <filename>libkleopatrarc</filename> as a separate <literal>Archive&nbsp;Definition&nbsp;#<replaceable>n</replaceable></literal> group, with the following mandatory keys:
de: Jedes Archivierungs-Programm wird in <filename>libkleopatrarc</filename> als eigenständige <literal>Archive&nbsp;Definition&nbsp;#<replaceable>n</replaceable></literal>-Gruppe mit den folgenden verbindlichen Schlüsseln definiert:

source: A comma-separated list of filename extensions that usually indicate this archive format.
de: Eine durch Komma getrennte Liste von Dateierweiterung, die normalerweise eine Archivdatei kennzeichnen.

source: A unique ID used to identify this archiver internally. If in doubt, use the name of the command.
de: Eine eindeutige Kennung, um dieses Archivierungs-Programm intern zu identifizieren. Falls Sie Zweifel haben, nutzen Sie den Namen des Befehls.

source: <literal>Name</literal> (translated)
de: <literal>Name</literal> (übersetzt)

source: The user-visible name of this archiver, as shown in the corresponding drop-down menu of the Sign/Encrypt Files dialog.
de: Der Name des Archivierungs-Programms, so wie er dem Benutzer im entsprechenden Aufklappmenu des <quote>Dateien signieren/verschlüsseln ...</quote>-Dialogs angezeigt wird.

source: The actual command to archive files. You can use any command, as long as no shell is required to execute it. The program file is looked up using the <envar>PATH</envar> environment variable, unless you use an absolute file path. Quoting is supported as if a shell was used:
de: Der eigentliche Befehl zum Archivieren von Dateien. Sie können hier jeden Befehl verwenden, so lange es nicht erforderlich ist eine Shell auszuführen. Sofern Sie keinen absoluten Pfad angeben, wird die Programmdatei wird mit Hilfe der <envar>PATH</envar>-Umgebungsvariable nachgeschlagen. Anführungszeichen werden so unterstützt, als wenn eine Shell verwendet wird:

source: Since backslash (<literal>\</literal>) is an escape character in &kde; config files, you need to double them when they appear in path names: <programlisting>pack-command=C:\\Programs\\GNU\\tar\\gtar.exe&nbsp;...</programlisting> However, for the command itself (as opposed to its arguments), you may just use forward slashes (<literal>/</literal>) as path separators on all platforms: <programlisting>pack-command=C:/Programs/GNU/tar/gtar.exe&nbsp;...</programlisting> This is not supported in arguments, as most &Windows; programs use the forward slash for options. For example, the following will not work, since <literal>C:/myarchivescript.bat</literal> is an argument to <command>cmd.exe</command>, and <literal>/</literal> is not converted to <literal>\</literal> in arguments, only commands: <programlisting>pack-command=cmd.exe C:/myarchivescript.bat</programlisting> This needs, instead, to be written as:
de: Da umgedrehte Schrägstriche (<literal>\</literal>) ein Steuerzeichen in &kde;-Einrichtungsdateien sind, müssen Sie diese doppelt verwenden, wenn sie in Pfadnamen auftauchen:<programlisting>pack-command=C:\\Programme\\GNU\\tar\\gtar.exe&nbsp;...</programlisting> Für den Befehl selbst (im Gegensatz zu seinen Argumenten) sollten Sie nur normale Schrägstriche (<literal>/</literal>) als Trennzeichen für Pfade auf allen Plattformen nutzen. <programlisting>pack-command=C:/Programme/GNU/tar/gtar.exe&nbsp;...</programlisting> In den Argumenten des Befehls wird dies nicht unterstützt, da zumindest &Windows;-Programme den Schrägstrich für Optionen nutzen. Zum Beispiel funktioniert das folgende nicht, da <literal>C:/meinearchivierung.bat</literal> ein Argument für <command>cmd.exe</command> ist und <literal>/</literal> in Argumenten nicht in <literal>\</literal> umgewandelt wird, sondern nur in Befehlen: <programlisting>pack-command=cmd.exe C:/meinearchivierung.bat</programlisting> Dies muss wie folgt umgeschrieben werden.

source: pack-command=cmd.exe C:\\myarchivescript.bat
de: pack-command=cmd.exe C:\\meinearchivierung.bat

source: Input Filename Passing for <literal>pack-command</literal>
de: Dateiname der zu archivierenden Datei, wie er dem <literal>pack-command</literal> übergeben wird

source: There are three ways to pass filenames to the pack command. For each of these, <literal>pack-command</literal> provides a particular syntax:
de: Es gibt drei Möglichkeiten Dateinamen dem Archivierungs-Befehl zu übergeben.

source: As command-line arguments.
de: Als Befehlszeilen-Argumente.

source: Example (tar): <programlisting>pack-command=tar cf -</programlisting> Example (zip): <programlisting>pack-command=zip -r - %f</programlisting> In this case, filenames are passed on the command line, just like you would when using the command prompt. &kleopatra; does not use a shell to execute the command. Therefore, this is a safe way of passing filenames, but it might run into command line length restrictions on some platforms. A literal <literal>%f</literal>, if present, is replaced by the names of the files to archive. Otherwise, filenames are appended to the command line. Thus, the zip Example above could equivalently be written like this:
de: Beispiel (GNU-tar): <programlisting>pack-command=tar cf -</programlisting> Beispiel (ZIP): <programlisting>pack-command=zip -r - %f</programlisting> In diesem Fall werden die Dateinamen über die Befehlszeile übergeben, genau so, als wenn die Befehlszeileneingabe genutzt würde. &kleopatra; benutzt keine Shell um den Befehl auszuführen. Daher ist die sicherste Methode Dateinamen zu übergeben, auch wenn dies auf einigen Systemen an Begrenzungen der Befehlszeilenlänge stoßen kann. Sofern das Literal <literal>%f</literal> angegeben ist, wird es durch die Namen der zu archivierenden Dateien ersetzt. Anderenfalls werden diese Dateinamen an das Ende der Befehlszeile angehangen. Daher kann das ZIP-Beispiel wie folgt gleichbedeutend umgeschrieben werden:

source: Via standard-in, separated by newlines: prepend <literal>|</literal>.
de: Über die Standard-Eingabe und durch Zeilenumbrüche getrennt: <literal>|</literal> voranstellen.

source: Example (&GNU;-tar): <programlisting>pack-command=|gtar cf - -T-</programlisting> Example (ZIP): <programlisting>pack-command=|zip -@ -</programlisting> In this case, filenames are passed to the archiver on <acronym>stdin</acronym>, one per line. This avoids problems on platforms which place a low limit on the number of command line arguments that are allowed, but fails when filenames, in fact, contain newlines.
de: Beispiel (&GNU;-tar): <programlisting>pack-command=|gtar cf - -T-</programlisting> Beispiel (ZIP): <programlisting>pack-command=|zip -@ -</programlisting> In diesem Fall werden die Dateinamen dem Archivierungs-Programm über <acronym>stdin</acronym> zeilenweise übergeben. Dies umgeht Probleme auf Systemen, die eine niedrige Begrenzung für die Anzahl an erlaubten Befehlszeilenzeilenparametern setzen, schlägt jedoch fehl, wenn Dateinamen Zeilenumbrüche enthalten.

source: &kleopatra; currently only supports <acronym>LF</acronym> as a newline separator, not <acronym>CRLF</acronym>. This might change in future versions, based on user feedback.
de: Derzeit unterstützt &kleopatra; nur <acronym>LF</acronym> als Steuerzeichen für einen Zeilenumbruch und nicht <acronym>CRLF</acronym>. Abhängig von Rückmeldungen der Benutzer kann sich dies in Zukunft ändern.

source: Via standard-in, separated by NUL-bytes: prepend <literal>0|</literal>.
de: Über die Standard-Eingabe und durch NUL-Bytes getrennt: <literal>0|</literal> voranstellen.

source: Example (&GNU;-tar): <programlisting>pack-command=0|gtar cf - -T- --null</programlisting> This is the same as above, except that NUL bytes are used to separate filenames. Since NUL bytes are forbidden in filenames, this is the most robust way of passing filenames, but not all archivers support it.
de: Beispiel (&GNU;-tar): <programlisting>pack-command=0|gtar cg - -T- --null</programlisting> Dies ist das gleiche wie oben, außer, dass NUL-Bytes für die Trennung der Dateinamen genutzt wurde. Da NUL-Bytes in Dateinamen verboten sind, ist dies die robusteste Methode um Dateinamen zu übergeben. Allerdings wird sie nicht von allen Archivierungs-Programmen unterstützt.

source: Configuring Checksum Programs for Use with Create/Verify Checksums
de: Einrichtung der Prüfsummen-Programme zur Benutzung mit <quote>Prüfsummen erstellen/verifizieren</quote>

source: &kleopatra; allows the administrator (and power-user) to configure the list of checksum programs that the user can choose from in the config dialog and that &kleopatra; is able to auto-detect when asked to verify a given file's checksum.
de: &kleopatra; ermöglicht es dem Systemverwalter (und erfahrenen Benutzer) die Liste der Prüfsummen-Programme, aus denen der Benutzer im Einstellungs-Fenster wählen kann, einzustellen. Zudem ist &kleopatra; dann in der Lage bei Bedarf eines für die Überprüfung der Prüfsumme einer gegebenen Datei automatisch zu wählen.

source: To be usable by &kleopatra;, output of checksum programs (both the written checksum file, as well as the output on <acronym>stdout</acronym> when verifying checksums) needs to be compatible with &GNU; <command>md5sum</command> and <command>sha1sum</command>.
de: Um von &kleopatra; benutzbar zu sein muss die Ausgabe eines Prüfsummen-Programms (sowohl die gespeicherte Prüfsummendatei als auch die Ausgabe auf <acronym>stdout</acronym>) kompatibel mit &GNU; <command>md5sum</command> und <command>sha1sum</command> sein.

source: Specifically, the checksum file needs to be line-based with each line having the following format: <programlisting><replaceable>CHECKSUM</replaceable> ' ' ( ' ' | '*' ) <replaceable>FILENAME</replaceable></programlisting> where <replaceable>CHECKSUM</replaceable> consists of hex-characters only. If <replaceable>FILENAME</replaceable> contains a newline character, the line must instead read: <programlisting>\<replaceable>CHECKSUM</replaceable> ' ' ( ' ' | '*' ) <replaceable>ESCAPED-FILENAME</replaceable></programlisting> where <replaceable>ESCAPED-FILENAME</replaceable> is the filename with newlines replaced by <literal>\n</literal>s, and backslashes doubled (<literal>\</literal>&#x21A6;<literal>\\</literal>).
de: Insbesondere muss die Prüfsummendatei zeilenbasiert sein, wobei jede Zeile das folgende Format erfüllen muss: <programlisting><replaceable>PRÜFSUMME</replaceable> ' ' ( ' ' | '*' ) <replaceable>DATEINAME</replaceable></programlisting>, wobei <replaceable>PRÜFSUMME</replaceable> nur aus hexadezimal-Zeichen besteht. Sollte <replaceable>DATEINAME</replaceable> ein Zeilenumbruchzeichen enthalten, muss die Zeile wie folgt formatiert sein: <programlisting>\<replaceable>PRÜFSUMME</replaceable> ' ' ( ' ' | '*' ) <replaceable>MASKIERTER-DATEINAME</replaceable></programlisting>, wobei <replaceable>MASKIERTER-DATEINAME</replaceable> der Dateiname ist, in dem Zeilenumbrüche durch <literal>\n</literal> und umgedrehte Schrägstriche gedoppelt sind (<literal>\</literal>&#x21A6;<literal>\\</literal>).

source: Similarly, the output of <xref linkend="checksum-definition-verify-command"/> must be of the form <programlisting><replaceable>FILENAME</replaceable> ( ': OK' | ': FAILED' )</programlisting> separated by newlines. Newlines and other characters are <emphasis>not</emphasis> escaped in the output.
de: Vergleichbar muss die Ausgabe von <xref linkend="checksum-definition-verify-command"/> die Form <programlisting><replaceable>DATEINAME</replaceable> ( ': OK' | ': FAILED')</programlisting> haben, wobei Zeilenumbrüche wieder als Trennzeichen dienen. Allerdings werden Zeilenumbrüche und andere Steuerzeichen der Ausgabe hier <emphasis>nicht</emphasis> maskiert.

source: Yes, these programs were not written with graphical frontends in mind, and &kleopatra; will fail to correctly parse pathological filenames that contain ":&nbsp;OK" plus newline in them.
de: Diese Programme wurden nicht für eine graphische Benutzeroberfläche geschrieben und &kleopatra; wird beim analysieren von irrsinnigen Dateinamen, die „:&nbsp;OK“ und einen Zeilenumbruch enthalten, versagen.

source: Each checksum program is defined in <filename>libkleopatrarc</filename> as a separate <literal>Checksum&nbsp;Definition&nbsp;#<replaceable>n</replaceable></literal> group, with the following mandatory keys:
de: Jedes Prüfsummen-Programm ist in <filename>libkleopatrarc</filename> als eigenständige <literal>Checksum&nbsp;Definition&nbsp;#<replaceable>n</replaceable></literal>-Gruppe mit den folgenden verbindlichen Schlüsseln definiert:

source: A list of regular expressions that describe which files should be considered checksum files for this checksum program. The syntax is the one used for string lists in &kde; config files. <note> <para> Since regular expressions usually contain backslashes, care must be taken to properly escape them in the config file. The use of a config file editing tool is recommended. </para> </note> The platform defines whether the patterns are treated case-sensitive or case-insensitive.
de: Eine Liste regulärer Ausdrücke, die beschreiben welche Dateien als Prüfsummendateien für diese Prüfsummen-Programm gehalten werden sollen. Die Syntax ist die gleiche, die auch für Zeichen-Listen in &kde;-Einrichtungsdateien verwendet wird. <note><para>Da reguläre Ausdrücke normalerweise umgedrehte Schrägstriche enthalten, muss Vorsicht gewaltet werden, um diese in der Einrichtungsdatei richtig zu maskieren. Die Verwendung von Werkzeugen zur Bearbeitung von Einrichtungsdateien wird empfohlen.</para></note> Ausschlaggebend dafür, ob die Muster Groß-/Kleinschreibung unterscheiden, ist das System.

source: The typical output filename for this checksum program (should match one of the <xref linkend="checksum-definition-file-patterns"/>, of course). This is what &kleopatra; will use as the output filename when creating checksum files of this type.
de: Der typische Name der Ausgabedatei dieses Prüfsummen-Programms (sollte natürlich einem der <xref linkend="checksum-definition-file-patterns"/> entsprechend). Diesen verwendet &kleopatra; als Name der Ausgabedatei beim Erstellen von Prüfsummendateien dieses Typs.

source: A unique ID used to identify this checksum program internally. If in doubt, use the name of the command.
de: Eine eindeutige Kennung, um dieses Prüfsummen-Programm intern zu identifizieren. Falls Sie Zweifel haben, nutzen Sie den Namen des Befehls.

source: The user-visible name of this checksum program, as shown in the drop-down menu in &kleopatra;'s config dialog.
de: Der Name des Archivierungs-Programms, so wie er dem Benutzer in &kleopatra;s Einrichtungsdialog angezeigt wird.

source: The actual command with which to create checksum files. The syntax, restrictions and argument passing options are the same as described for <xref linkend="archive-definition-pack-command"/> in <xref linkend="admin-archive-definitions"/>.
de: Der eigentliche Befehl mit dem Prüfsummendateien erzeugt werden. Die Syntax sowie Begrenzungen und Optionen der Argument-Übergabe sind die gleichen wie für <xref linkend="archive-definition-pack-command"/> in <xref linkend="admin-archive-definitions"/> beschrieben.

source: Same as <xref linkend="checksum-definition-create-command"/>, but for checksum verification.
de: Genau wie <xref linkend="checksum-definition-create-command"/>, allerdings für Prüfsummen-Verifizierung.

source: Here is a complete example:
de: Hier sehen Sie ein vollständiges Beispiel:

source: Credits and License
de: Danksagungen und Lizenz

source: &kleopatra; copyright 2002 &Steffen.Hansen;, &Matthias.Kalle.Dalheimer; and &Jesper.Pedersen;., copyright 2004 &Daniel.Molkentin;, copyright 2004, 2007, 2008, 2009, 2010 Klar&auml;lvdalens Datakonsult AB
de: &kleopatra; Copyright 2002 &Steffen.Hansen;, &Matthias.Kalle.Dalheimer; und &Jesper.Pedersen;, Copyright 2004 &Daniel.Molkentin;, Copyright 2004, 2007, 2008, 2009, 2010 Klar&auml;lvdalens Datakonsult AB

source: Documentation copyright 2002 &Steffen.Hansen;, copyright 2004 &Daniel.Molkentin;, copyright 2004, 2010 Klar&auml;lvdalens Datakonsult AB
de: Copyright der Dokumentation 2002 &Steffen.Hansen;, Copyright 2004 &Daniel.Molkentin;, Copyright 2004,2010 Klar&auml;lvdalens Datakonsult AB

source: Contributors
de: Mitwirkende

source: CREDIT_FOR_TRANSLATORS
de: <para>Übersetzung Matthias Kalle Dalheimer<email>kalle@kdab.net</email> und Torbjörn Klatt<email>torbjoern.k@googlemail.com</email></para>
