Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdepim/kleopatra.po
Languages: de

source: The &kleopatra; Handbook
de: Das Handbuch zu &kleopatra;

source: Developer
de: Entwickler

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Matthias Kalle</firstname><surname>Dalheimer</surname><affiliation><address><email>kalle@kdab.net</email></address></affiliation> <contrib>Deutsche Übersetzung</contrib></othercredit><othercredit role="translator"><firstname>Torbjörn</firstname><surname>Klatt</surname><affiliation><address><email>torbjoern.k@googlemail.com</email></address></affiliation><contrib>Deutsche Übersetzung</contrib></othercredit>

source: &kleopatra; is a tool for managing <ulink url="http://en.wikipedia.org/wiki/X.509">&x509;</ulink> and <ulink url="http://en.wikipedia.org/wiki/Pretty_Good_Privacy#OpenPGP">&openpgp;</ulink> certificates.
de: &kleopatra; ist ein Hilfsprogramm zum Verwalten von <ulink url="http://en.wikipedia.org/wiki/X.509">&x509;</ulink>- und <ulink url="http://en.wikipedia.org/wiki/Pretty_Good_Privacy#OpenPGP">&openpgp;</ulink>-Zertifikaten.

source: certificate
de: Zertifikat

source: Introduction
de: Einführung

source: &kleopatra; is the &kde; tool for managing <ulink url="http://en.wikipedia.org/wiki/X.509">&x509;</ulink> and <ulink url="http://en.wikipedia.org/wiki/Pretty_Good_Privacy#OpenPGP">&openpgp;</ulink> certificates in the <ulink url="http://www.gnupg.org/documentation/manuals/gnupg/Invoking-GPGSM.html">&gpgsm;</ulink> and <ulink url="http://en.wikipedia.org/wiki/GNU_Privacy_Guard">&gpg;</ulink> keyboxes and for retrieving certificates from &ldap; and other certificate servers.
de: &kleopatra; ist das &kde;-Programm zum Verwalten von <ulink url="http://en.wikipedia.org/wiki/X.509">&x509;</ulink>- und <ulink url="http://en.wikipedia.org/wiki/Pretty_Good_Privacy#OpenPGP">&openpgp;</ulink>-Zertifikaten in <ulink url="http://www.gnupg.org/documentation/manuals/gnupg/Invoking-GPGSM.html">&gpgsm;</ulink>- und <ulink url="http://en.wikipedia.org/wiki/GNU_Privacy_Guard">&gpg;</ulink>-Schlüsselspeichern, und zum Abfragen von Zertifikaten von &ldap;- und anderen Zertifikats-Servern.

source: &kleopatra; can be started from &kmail;'s <menuchoice><guimenu>Tools</guimenu> <guimenuitem>Certificate Manager</guimenuitem></menuchoice> menu, as well as from the command line. The &kleopatra; executable is named <userinput><command>kleopatra</command></userinput>.
de: &kleopatra; kann sowohl aus dem Menü <menuchoice><guimenu>Extras</guimenu><guimenuitem>Zertifikatsverwaltung</guimenuitem></menuchoice> von &kmail; als auch von der Befehlszeile aus gestartet werden. Das ausführbare Programm von &kleopatra; heißt <userinput><command>kleopatra</command></userinput>.

source: This program is named after Cleopatra, a famous female Egyptian pharaoh that lived at the time of Julius Caesar, with whom she had a child, Caesarion, unacknowledged as his heir.
de: Dieses Programm ist nach Kleopatra benannt, einer berühmten ägyptischen Pharaonin, die zur Zeit Julius Cäsars gelebt hat, mit dem sie ein Kind namens Caesarion hatte, das nicht als sein Erbe anerkannt wurde.

source: The name was chosen since this program originates from the <ulink url="http://www.gnupg.org/aegypten2/">&Auml;gypten Projects</ulink> (&Auml;gypten is German for Egypt). &kleopatra; is the German spelling of Cleopatra.
de: Der Name wurde gewählt, weil dieses Programm aus dem <ulink url="http://www.gnupg.org/aegypten2/">&Auml;gypten-Projekten</ulink> stammt.

source: Main Functions
de: Die wichtigsten Funktionen

source: Viewing the Local Keybox
de: Anzeige des lokalen Schlüsselspeichers

source: &kleopatra;'s main function is to display and edit the contents of the local keybox, which is similar to &gpg;'s concept of keyrings, albeit one should not stretch this analogy too much.
de: Die wichtigste Funktion von &kleopatra; ist das Anzeigen und Editieren des Inhalts des lokalen Schlüsselspeichers, der dem Schlüsselring-Konzept von &gpg; ähnelt, auch wenn man diesen Vergleich nicht zu sehr bemühen sollte.

source: The main window is divided into the large key listing area consisting of several tabs, the menubar and the <link linkend="functions-search">search bar</link> on top, and a status bar at the bottom.
de: Das Hauptfenster besteht aus mehreren Unterfenstern mit Listen von Zertifikaten, der Menüleiste und der <link linkend="functions-search">Suchleiste</link> am oberen Rand, sowie der Statuszeile am unteren Rand.

source: Each line in the key list corresponds to one certificate, identified by the so-called <guilabel>Subject &dn;</guilabel>. &dn; is an acronym for <quote>Distinguished Name</quote>, a hierarchical identifier, much like a file system path with an unusual syntax, that is supposed to globally uniquely identify a given certificate.
de: Jede Zeile in der Schlüsselliste entspricht einem Zertifikat, das durch den sogenannten <guilabel>Betreff-&dn;</guilabel> identifiziert wird. &dn; ist ein Akronym für den englischen Ausdruck <quote>Distinguished Name</quote>, ein hierarchischer Bezeichner, der einem Dateisystempfad mit ungewöhnlicher Syntax ähnelt und ein bestimmtes Zertifikat eindeutig global identifizieren soll.

source: To be valid, and thus usable, (public) keys need to be signed by a &ca; (Certification Authority). These signatures are called certificates, but usually the terms <quote>certificate</quote> and <quote>(public) key</quote> are used interchangeably, and we will not distinguish between them in this manual either, except when explicitly noted.
de: Um gültig und damit verwendbar zu sein, müssen (öffentliche) Schlüssel von einer &ca; (Certification Authority; Zertifizierungsinstanz) signiert sein. Diese Signaturen werden Zertifikate genannt, aber normalerweise werden die Ausdrücke <quote>Zertifikat</quote> und <quote>(öffentlicher) Schlüssel</quote> austauschbar verwendet, sofern das nicht ausdrücklich anders angegeben ist.

source: &ca;s must in turn be signed by other &ca;s to be valid. Of course, this must end somewhere, so the top-level &ca; (root-&ca;) signs its key with itself (this is called a self-signature). Root certificates thus need to be assigned validity (commonly called trust) manually, &eg; after comparing the fingerprint with the one on the website of the &ca;. This is typically done by the system administrator or the vendor of a product using certificates, but can be done by the user via &gpgsm;'s command line interface.
de: &ca;s müssen ebenfalls wiederum von anderen &ca;s signiert sein, um gültig zu sein. Natürlich muss diese Kette irgendwo enden, deshalb signiert die oberste &ca; (die Wurzel-&ca;) ihren Schlüssel mit sich selbst (dies wird eine Selbst-Signatur genannt). Wurzel-Zertifikaten muss daher die Gültigkeit (meistens Vertrauenswürdigkeit genannt) manuell zugewiesen werden, z. B. durch Vergleichen des Fingerabdrucks mit dem auf der Website der &ca;. Dies wird normalerweise vom Systemverwalter oder dem Hersteller des Produkts, das Zertifikate verwendet, vorgenommen, kann aber über die Befehlszeilenschnittstelle von &gpgsm; auch vom Benutzer durchgeführt werden.

source: To see which of the certificates are root certificates, you switch to the hierarchical keylist mode with <xref linkend="view-hierarchical-key-list"/>.
de: Um zu sehen, welche Zertifikate Wurzel-Zertifikate sind, können Sie mit <xref linkend="view-hierarchical-key-list"/> in den hierarchischen Anzeigemodus wechseln.

source: You can see the details of any certificate by double-clicking it or using <xref linkend="view-certificate-details"/>. This opens a dialog that shows the most common properties of the certificate, its certificate chain (&ie; the chain of issuers up to the root-&ca;), and a dump of all information the backend is able to extract from the certificate.
de: Sie können sich die Details eines beliebigen Zertifikats durch Doppelklick auf das Zertifikat oder durch Verwendung von <xref linkend="view-certificate-details"/> ansehen. Dabei wird ein Dialog geöffnet, in dem die gängigsten Eigenschaften des Zertifikats, dessen Zertifikatskette (&ie; die Kette der Aussteller bis zur Wurzel-&ca;) und alle Informationen, die das Backend über das Zertifikat ermitteln kann, angezeigt werden.

source: If you change the keybox without using &kleopatra; (&eg; using &gpgsm;'s command line interface), you can refresh the view with <xref linkend="view-redisplay"/>.
de: Wenn Sie den Inhalt des Schlüsselspeichers außerhalb von &kleopatra; verändern (&eg; über die Befehlszeilenschnittstelle von &gpgsm;), dann können Sie die Anzeige mit <xref linkend="view-redisplay"/> aktualisieren.

source: Searching and Importing Certificates
de: Zertifikate suchen und importieren

source: Most of the time, you will acquire new certificates by verifying signatures in emails, since certificates are embedded in the signatures made using them most of the time. However, if you need to send a mail to someone you have not yet had contact with, you need to fetch the certificate from an &ldap; folder (although <ulink url="http://www.gnupg.org/documentation/manuals/gnupg/Invoking-GPGSM.html#Invoking-GPGSM"> &gpgsm;</ulink> can do this automatically), or from a file. You also need to import your own certificate after receiving the &ca; answer to your certification request.
de: Normalerweise bekommen Sie neue Zertifikate durch Überprüfen von Signaturen in E-Mail-Nachrichten, weil die Zertifikate normalerweise in die Signaturen, die damit vorgenommen wurden, eingebettet werden. Wenn Sie aber jemandem eine Nachricht senden wollen, mit dem Sie bisher noch keinen Kontakt hatten, dann müssen Sie das Zertifikat aus einem &ldap;-Ordner (<ulink url="http://www.gnupg.org/documentation/manuals/gnupg/Invoking-GPGSM.html#Invoking-GPGSM">&gpgsm;</ulink> kann das aber auch automatisch für Sie tun) oder einer Datei holen. Außerdem müssen Sie Ihr eigenes Zertifikat importieren, nachdem Sie die Antwort der &ca; auf Ihre Zertifizierungsanfrage bekommen haben.

source: To search for a certificate in an &ldap; directory, select <menuchoice><guimenu>File</guimenu><guimenuitem>Lookup Certificates on Server</guimenuitem></menuchoice> and enter some text (&eg; the name of the person you want the certificate for) into the line edit of the <guilabel>Keyserver Certificate Lookup</guilabel> dialog, then click on the <guilabel>Search</guilabel> button. The results will be displayed in the key list below the search bar, where you can select certificates to look at them by clicking the <guibutton>Details</guibutton> button or download them with <guibutton>Import</guibutton> into the local keybox.
de: Um ein Zertifikat in einem &ldap;-Ordner zu suchen, wählen Sie <menuchoice><guimenu>Datei</guimenu><guimenuitem>Zertifikate auf Server suchen ...</guimenuitem></menuchoice> und geben einen Text, wie &eg; den Namen der Person, deren Zertifikat Sie suchen, in das Eingabefeld des Dialogs <guilabel>Zertifikatssuche auf Schlüsselserver</guilabel> ein. Drücken Sie dann den Knopf <guilabel>Suchen</guilabel>. Gefundene Zertifikate werden dann in der Schlüsselliste unter der Suchleiste angezeigt. Wählen Sie ein Zertifikat aus, um sich mit <guibutton>Details</guibutton> zusätzliche Informationen anzeigen zu lassen oder klicken Sie auf <guibutton>Importieren</guibutton>, um das Zertifikat in den lokalen Schlüsselspeicher herunterzuladen.

source: You can configure the list of &ldap; servers to search in the <link linkend="configuration-directory-services"><guilabel>Directory Services</guilabel></link> page of &kleopatra;'s configure dialog.
de: Sie können die Liste der zu durchsuchenden &ldap;-Server auf der Seite <link linkend="configuration-directory-services"><guilabel>Verzeichnisdienste</guilabel></link> des Einrichtungsdialogs von &kleopatra; einstellen.

source: If you received the certificate as a file, try <xref linkend="file-import-certificates"/>. &gpgsm; needs to understand the format of the certificate file; please refer to &gpgsm;'s manual for a list of supported file formats.
de: Wenn Sie die Zertifikate als eine Datei bekommen haben, versuchen Sie es mit <xref linkend="file-import-certificates"/>. &gpgsm; muss dazu das Format der Zertifikatsdatei unterstützen; im &gpgsm;-Handbuch finden Sie eine Liste der unterstützten Dateiformate.

source: If you did not <link linkend="functions-newkey">create your keypair with &gpgsm;</link>, you also need to manually import the public key (as well as the secret key) from the PKCS#12 file you got from the &ca;. You can do this on the command line with <link linkend="commandline-option-import-certificate"><userinput><command>kleopatra <option>--import-certificate</option> <filename>filename</filename></command></userinput></link> or from within &kleopatra; with <xref linkend="file-import-certificates"/>, just as you would to for <quote>normal</quote> certificates.
de: Wenn Sie Ihr <link linkend="functions-newkey">Schlüsselpaar nicht mit &gpgsm; erzeugt</link> haben, müssen Sie auch den öffentlichen und den geheimen Schlüssel aus der PKCS#12-Datei importieren, die Sie von der &ca; bekommen haben. Dies können Sie von der Befehlszeile aus mit <link linkend="commandline-option-import-certificate"><userinput><command>kleopatra <option>--import-certificate</option> <filename>dateiname</filename></command></userinput></link> oder in &kleopatra; mit <xref linkend="file-import-certificates"/> durchführen, genauso, wie Sie es auch für <quote>normale</quote> Zertifikate tun würden.

source: Creating New Key Pairs
de: Neue Schlüsselpaare erzeugen

source: The menu item <xref linkend="file-new-key-pair"/> starts the <guilabel>Certificate Creation Wizard</guilabel> which will guide you through a number of steps to create a certificate request.
de: Der Menüeintrag <xref linkend="file-new-key-pair"/> startet den <guilabel>Assistenten zur Erstellung des Zertifikats</guilabel>, der Sie durch die notwendigen Schritte zur Erzeugung einer Zertifikatsanfrage führt.

source: Whenever you are done with a step in the wizard, press <guibutton>Next</guibutton> to go to the next step (or <guibutton>Back</guibutton> to review steps that are already completed). The certificate request creation can be canceled at any time by pressing the <guibutton>Cancel</guibutton> button.
de: Wenn Sie mit dem Ausfüllen einer Seite im Assistenten fertig sind, klicken Sie auf <guibutton>Weiter</guibutton>, um zum nächsten Schritt zu kommen (mit <guibutton>Zurück</guibutton> können Sie bereits durchgeführte Schritte noch einmal anschauen). Die Erzeugung der Zertifikatsanfrage kann jederzeit mit der Schaltfläche <guibutton>Abbrechen</guibutton> abgebrochen werden.

source: On the first page of the wizard choose which type of certificate you want to create:
de: Auf der ersten Seite des Assistenten wird die Art des Zertifikats ausgewählt, das erstellt werden soll.

source: Create a personal OpenPGP key pair
de: Persönliches OpenPGP-Schlüsselpaar erzeugen

source: &openpgp; key pairs are created locally, and certified by your friends and acquaintances. There is no central certification authority; instead, every individual creates a personal Web Of Trust by certifying other user's key pairs with his own certificate.
de: &openpgp;-Schlüsselpaare werden lokal auf Ihrem Rechner erstellt und von Ihren Freunden und Bekannten beglaubigt. Es gibt keine zentrale Beglaubigungsinstanz; jeder Anwender erstellt ein persönliches Netz des Vertrauens durch die Beglaubigung der Schlüsselpaare anderer durch sein eigenes Zertifikat.

source: You have to enter a <guilabel>Name</guilabel>, <guilabel>EMail</guilabel> and optional a <guilabel>Comment</guilabel>.
de: Es muss ein <guilabel>Name</guilabel>, eine <guilabel>E-Mail</guilabel>-Adresse und wahlweise ein <guilabel>Kommentar</guilabel> eingegeben werden.

source: Create a personal X.509 key pair and certification request
de: Persönliches X.509-Schlüsselpaar und Beglaubigungs-Anfrage erstellen

source: &x509; key pairs are created locally, but certified centrally by a certification authority (&ca;). &ca;s can certify other &ca;s, creating a central, hierarchical chain of trust.
de: &x509;-Schlüsselpaare werden lokal erstellt, aber zentral durch eine Beglaubigungsinstanz (Certificate Authority, &ca;) beglaubigt. &ca;s können andere &ca;s beglaubigen, dadurch entsteht eine hierarchische Vertrauenskette.

source: The next step in the wizard is to type in your personal data for the certificate. The fields to fill out are:
de: Der nächste Schritt im Assistenten besteht darin, Ihre persönlichen Daten für das Zertifikat einzutragen. Die auszufüllenden Felder lauten:

source: <guilabel>Common Name (CN):</guilabel> Your name;
de: <guilabel>Allgemeiner Name (CN):</guilabel> Ihr Name;

source: <guilabel>Email address (EMAIL):</guilabel> Your email address; be sure to type this in correctly&mdash;this will be the address people will be sending mail to when they use your certificate.
de: <guilabel>E-Mail-Adresse (EMAIL):</guilabel> Ihre E-Mail-Adresse; geben Sie diese sorgfältig ein, denn an diese Adresse werden Nachrichten verschickt, wenn Ihr Zertifikat verwendet wird.

source: <guilabel>Location (L):</guilabel> The town or city in which you live;
de: <guilabel>Ort (L):</guilabel> Die Stadt oder der Ort, wo Sie leben;

source: <guilabel>Organizational unit (OU):</guilabel> The organizational unit you are in (for example, "Logistics");
de: <guilabel>Abteilung (OU):</guilabel> Die Organisationseinheit, zu der Sie gehören (etwa <quote>Logistik</quote>);

source: <guilabel>Organization (O):</guilabel> The organization you represent (for example, the company you work for);
de: <guilabel>Organisation (O):</guilabel> Die Organisation, die Sie repräsentieren (etwa Ihr Arbeitgeber);

source: <guilabel>Country code (C):</guilabel> The two letter code for the country in which you are living (for example, "US");
de: <guilabel>Ländercode (C):</guilabel> Der zweibuchstabige Code, der das Land bezeichnet, in dem Sie leben (z. B. <quote>DE</quote>);

source: The next step in the wizard is to select whether to store the certificate in a file or send it directly to a &ca;. You will have to specify the filename or email address to send the certificate request to.
de: Im nächsten Schritt des Assistenten wählen Sie aus, ob das Zertifikat in einer Datei gespeichert oder direkt an eine &ca; geschickt werden soll. Sie müssen entweder den Dateinamen oder die E-Mail-Adresse, an die die Zertifikatsanfrage geschickt werden soll, angeben.

source: Revoking a key
de: Einen Schlüssel widerrufen

source: A key pair that has expired can be brought back into an operational state as long as you have access to the private key and the passphrase. To reliably render a key unusable you need to revoke it. Revoking is done by adding a special revocation signature to the key.
de: Solange Sie den privaten Schlüssel und das Passwort besitzen, können Sie einen abgelaufenen Schlüssel wieder benutzbar machen. Wenn Sie einen Schlüssel endgültig unbenutzbar machen möchten, müssen Sie ihn sperren. Das wird mittels einer speziellen Sperrsignatur erreicht, die zum Schlüssel hinzugefügt wird.

source: This revocation signature is stored in a separate file. This file can later be imported into the keyring and is then attached to the key rendering it unusable. Please note that to import this signature to the key no password is required. Therefore you should store this revocation signature in a safe place, usually one that is different from you key pair. It is a good advise to use a place that is detached from your computer, either copy it to an external storage device like an USB stick or print it out.
de: Eine Widerrufssignatur in einer gesonderten Datei gespeichert. Diese kann später in den Schlüsselbund importiert werden und wird dann an den Schlüssel angehängt und macht ihn damit unbrauchbar. Bitte beachten Sie, dass dazu das Passwort des Schlüssels nicht erforderlich ist. Deshalb sollten Sie die Datei mit der Sperrsignatur sicher aufbewahren, am besten getrennt von Ihrem privaten Schlüssel. Es ist ratsam, dazu einen Ort zu wählen, der nicht mit einem Computer verbunden ist, z. B. können Sie die Datei auf ein externes Speichermedium wie einen USB-Stick übertragen oder Sie drucken sie einfach aus.

source: &kleopatra; does not provide a function to create such a revocation signature at any time, but you can do that with the &kde; application &kgpg; by choosing <menuchoice><guimenu>Keys</guimenu> <guimenuitem>Revoke key</guimenuitem></menuchoice> and optionally importing the revocation signature to your keyring immediately.
de: In &kleopatra; gibt es keine Funktion, um so eine Widerrufssignatur zu einem beliebigen Zeitpunkt zu erzeugen. Sie können dazu jedoch das &kde;-Programm &kgpg; verwenden und in diesem Programm <menuchoice><guimenu>Schlüssel</guimenu><guimenuitem>Schlüssel sperren</guimenuitem></menuchoice> im Menü wählen und dann gegebenenfalls diese Signatur sofort in Ihren Schlüsselring importieren.

source: An alternative way of generating a revocation certificate is to use &gpg; directly from the command line: <userinput>gpg --output <replaceable>revocation_certificate</replaceable>.asc --gen-revoke <replaceable>your_key</replaceable></userinput>. The argument <replaceable>your_key</replaceable> must be a key specifier, either the key ID of your primary keypair or any part of a user ID that identifies your keypair.
de: Als andere Möglichkeit um ein Widerrufs-Zertifikat können Sie &gpg; direkt auf der Befehlszeile verwenden:<userinput>gpg --output <replaceable>revocation_certificate</replaceable>.asc --gen-revoke <replaceable>ihr_schlüssel</replaceable></userinput>. Als Argument für <replaceable>ihr_schlüssel</replaceable> muss die Kennung eines Schlüssels, entweder die Schlüsselkennung Ihres primären Schlüsselpaars oder ein beliebiger Teil einer Benutzerkennung, die Ihr Schlüsselpaar identifiziert.

source: Menu Reference
de: Menüreferenz

source: File Menu
de: Das Menü Datei

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo></shortcut> <guimenu>File</guimenu><guimenuitem>New Certificate...</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo></shortcut> <guimenu>Datei</guimenu><guimenuitem>Neues Zertifikat ...</guimenuitem>

source: <action>Creates a new key pair (public and private)</action> and allows to send the public part to a certification authority (&ca;) for signing. The resulting certificate is then sent back to you, or stored in an &ldap; server for you to download into your local keybox, where you can use it to sign and decrypt mails.
de: <action>Erzeugt ein neues Schlüsselpaar (aus öffentlichem und privatem Schlüssel)</action> und ermöglicht das Verschicken des öffentlichen Teils an eine Zertifizierungsinstanz (&ca;) zur Signierung. Das resultierende Zertifikat wird an Sie zurückgeschickt oder in einem &ldap;-Server gespeichert, von wo Sie es in Ihren lokalen Schlüsselspeicher herunterladen können, wo es zum Signieren und Entschlüsseln von Nachrichten dient.

source: This mode of operation is called <quote>decentralized key generation</quote>, since all keys are created locally. &kleopatra; (and &gpgsm;) do not support <quote>centralized key generation</quote> directly, but you can import the public/secret key bundle that you receive from the &ca; in PKCS#12 format via <xref linkend="file-import-certificates"/>.
de: Dieser Betriebsmodus wird <quote>dezentrale Schlüsselerzeugung</quote> genannt, weil alle Schlüssel lokal erzeugt werden. &kleopatra; (und &gpgsm;) unterstützt die <quote>zentrale Schlüsselerzeugung</quote> nicht direkt, aber Sie können das Bündel aus öffentlichem und geheimen Schlüssel, das Sie von der &ca; im PKCS#12-Format bekommen, mit <xref linkend="file-import-certificates"/> importieren.
