Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdepim/kleopatra.po
Languages: de

source: Determines the network protocol which is used to access the server. Often-used schemes include <guilabel>ldap</guilabel> (and its &ssl;-secured sibling <guilabel>ldaps</guilabel>) for &ldap; servers (common protocol for &smime;; the only one supported by &gpgsm;), and <guilabel>hkp</guilabel>, the Horowitz Keyserver Protocol, nowadays usually &http; Keyserver Protocol, a &http;-based protocol that virtually all public &openpgp; keyservers support.
de: Bestimmt das Netzwerkprotokoll, welches benutzt wird, um den Server zu erreichen. Häufig genutzte Schemata sind <guilabel>ldap</guilabel> (und das &ssl;-gesicherte Pendant <guilabel>ldaps</guilabel>) für &ldap;-Server (übliches Protokoll für &smime;; das einzige von &gpgsm; unterstütze), und <guilabel>hkp</guilabel>, das Horowitz Keyserver Protocol („Horowitz-Schlüsselserver-Protokoll“), heute in der Regel &http;-Schlüsselserver-Protokoll, einem auf &http; basierendem Protokoll das wirklich alle öffentlichen &openpgp;-Schlüsselserver unterstützen.

source: Please refer to the &gpg; and &gpgsm; manuals for a list of supported schemes.
de: In den Handbüchern von &gpg; und &gpgsm; finden Sie eine Liste der unterstützten Formate.

source: The domain name of the server, &eg; <systemitem class="systemname">keys.gnupg.net</systemitem>.
de: Der Domain-Name des Servers, &eg; <systemitem class="systemname">keys.gnupg.net</systemitem>.

source: The network port the server is listening on.
de: Der Netzwerk-Port, auf dem der Server auf Anfragen wartet.

source: This changes automatically to the default port when you change the <xref linkend="configuration-directory-services-scheme"/>, unless it was set to some non-standard port to begin with. If you changed the default port and cannot get it back, try setting <xref linkend="configuration-directory-services-scheme"/> to <userinput>http</userinput> and <xref linkend="configuration-directory-services-server-port"/> to <userinput>80</userinput> (the default for &http;), then take it from there.
de: Dieser ändert sich automatisch zum Standard-Port, wenn Sie das <xref linkend="configuration-directory-services-scheme"/> ändern &mdash; sofern es anfangs kein Standard-Port war. Sollten Sie den Standard-Port verändert haben und schaffen es nicht mehr, die Standardwerte einzustellen, versuchen Sie <xref linkend="configuration-directory-services-scheme"/> auf <userinput>http</userinput> und <xref linkend="configuration-directory-services-server-port"/> auf <userinput>80</userinput> (Standard für &http;) zu setzen und fahren von dort fort.

source: Base DN
de: Basis-DN

source: The Base-&dn; (only for &ldap; and &ldaps;), &ie; the root of the &ldap; hierarchy to start from. This is often also called <quote>search root</quote> or <quote>search base</quote>.
de: Die Basis-&dn; (nur für &ldap; und &ldaps;), &ie; die Wurzel der &ldap;-Hierarchie, von der aus gestartet werden soll. Oft wird dies auch als <quote>Such-Wurzel</quote> oder <quote>Such-Basis</quote> bezeichnet.

source: It usually looks like <userinput>c=de,o=Foo</userinput>, given as part of the &ldap; &URL;.
de: In der Regel sieht dies aus wie <userinput>c=de,o=Foo</userinput> und ist Teil der &ldap;-&URL;.

source: User Name
de: Benutzername

source: The user name, if any, to use for logging into the server.
de: Der Benutzername, wenn vorhanden, der für die Anmeldung am Server genutzt wird.

source: This column is only shown if the option <guilabel>Show user and password information</guilabel> (below the table) is checked.
de: Diese Spalte wird nur angezeigt, wenn <guilabel>Benutzername und Passwort anzeigen</guilabel> unter der Tabelle ausgewählt ist.

source: Password
de: Passwort

source: The password, if any, to use for logging into the server.
de: Das Passwort, wenn vorhanden, das für die Anmeldung am Server genutzt wird.

source: Check this column if this entry should be used for &x509; (&smime;) certificate searches.
de: Markieren Sie diese Spalte, wenn dieser Eintrag für die Suche nach &x509;-Zertifikaten (&smime;) genutzt werden soll.

source: Only &ldap; (and &ldaps;) servers are supported for &smime;.
de: Es werden nur &ldap;- und &ldaps;-Server für &smime; unterstützt.

source: Check this column if this entry should be used for &openpgp; certificate searches.
de: Markieren Sie diese Spalte, wenn dieser Eintrag für die Suche nach &openpgp;-Zertifikaten genutzt werden soll.

source: You can configure as many &smime; (&x509;) servers as you want, but only one &openpgp; server is allowed at any time. The &GUI; will enforce this.
de: Sie können so viele &smime;-Server (&x509;) einrichten, wie Sie wollen. Jedoch ist nur ein &openpgp;-Server erlaubt. Die &GUI; stellt dies sicher.

source: To add a new server, click on the <guibutton>New</guibutton> button. This duplicates the selected entry, if any, or else inserts a default &openpgp; server. Then you can set the <xref linkend="configuration-directory-services-server-name"/>, the <xref linkend="configuration-directory-services-server-port"/>, the <xref linkend="configuration-directory-services-base-dn"/>, and the usual <xref linkend="configuration-directory-services-password"/> and <xref linkend="configuration-directory-services-user-name"/>, both of which are only needed if the server requires authentication.
de: Um einen neuen Server hinzuzufügen, klicken Sie auf den Knopf <guibutton>Neu</guibutton>. Ist ein bestehender Eintrag ausgewählt, wird dieser dupliziert. Anderenfalls wird ein Standard-&openpgp;-Server eingefügt. Anschließend können Sie den <xref linkend="configuration-directory-services-server-name"/>, den <xref linkend="configuration-directory-services-server-port"/>, die <xref linkend="configuration-directory-services-base-dn"/>, sowie das übliche <xref linkend="configuration-directory-services-password"/> und <xref linkend="configuration-directory-services-user-name"/> einstellen. Letztere beiden werden benötigt, wenn der Server eine Authentifizierung erfordert.

source: To directly insert an entry for &x509; certificates, use <menuchoice><guimenu>New</guimenu><guimenuitem>X.509</guimenuitem></menuchoice>; use <menuchoice><guimenu>New</guimenu><guimenuitem>OpenPGP</guimenuitem></menuchoice> for &openpgp;.
de: Um einen neuen Eintrag für &x509;-Zertifikate einzufügen, nutzen Sie <menuchoice><guimenu>Neu</guimenu><guimenuitem>X.509</guimenuitem></menuchoice>. Für &openpgp; nutzen Sie analog <menuchoice><guimenu>Neu</guimenu><guimenuitem>OpenPGP</guimenuitem></menuchoice>.

source: To remove a server from the search list, select it in the list, then press the <guibutton>Delete</guibutton> button.
de: Um einen Server aus der Suchliste zu entfernen, wählen Sie ihn in der Liste aus und betätigen dann den Knopf <guibutton>Löschen</guibutton>.

source: To set the &ldap; timeout, &ie; the maximum time the backend will wait for a server to respond, simply use the corresponding input field labeled <guilabel>LDAP timeout (minutes:seconds)</guilabel>.
de: Mit dem Eingabefeld <guilabel>LDAP-Zeitüberschreitung (Minuten:Sekunden)</guilabel> können Sie die &ldap;-Zeitüberschreitung einstellen, also die maximale Zeit, die das Hintergrundprogramm auf die Antwort eines Servers warten soll.

source: If one of your servers has a large database, so that even reasonable searches like <userinput>Smith</userinput> hit the <guilabel>maximum number of items returned by query</guilabel>, you might want to increase this limit. You can find out easily if you hit the limit during a search, since a dialog box will pop up in that case, telling you that the results have been truncated.
de: Wenn einer Ihrer Server eine so große Datenbank enthält, dass selbst sinnvolle Suchanfragen wie <userinput>Schmidt</userinput> die <guilabel>Maximale Anzahl Treffer bei Anfragen</guilabel> überschreiten, dann können Sie diese Begrenzung heraufsetzen. Sie können leicht feststellen, wenn das der Fall ist, weil ein Dialog erscheinen wird, der Ihnen mitteilt, dass die Suchergebnisse verkürzt worden sind.

source: Some servers may impose their own limits on the number of items returned from a query. In this case, increasing the limit here will not result in more returned items.
de: Einige Server haben eigene Beschränkungen, wieviele Einträge sie in einer Abfrage zurückgeben. In diesem Fall führt das Heraufsetzen der Begrenzung in diesem Dialog natürlich zu keiner Änderung.

source: Configuring Appearance
de: Erscheinungsbild einrichten

source: Configuring <guilabel>Tooltips</guilabel>
de: <guilabel>Kurzinfos</guilabel> einrichten

source: In the main certificate list, &kleopatra; can show details about a certificate in a tooltip. The information displayed is the same as in the <guilabel>Overview</guilabel> tab of the <guilabel>Certificate Details</guilabel> dialog. Tooltips, however, can be restricted to show only a subset of information for a less verbose experience.
de: In der Hauptliste der Zertifikate kann &kleopatra; Details eines Zertifikats als Kurzinfos anzeigen. Die angezeigten Informationen sind die selben wie in der Karteikarte <guilabel>Übersicht</guilabel> des Fensters <guilabel>Zertifikatsdetails</guilabel>. Allerdings können Kurzinfos nur einige Informationen anzeigen.

source: The <guilabel>Key-ID</guilabel> is <emphasis>always</emphasis> shown. This is to ensure that tooltips for different certificates do, in fact, differ (this is especially important if only <xref linkend="tooltips-validity"/> has been selected).
de: Die <guilabel>Schlüssel-ID</guilabel> wird <emphasis>immer</emphasis> angezeigt. Dies stellt sicher, dass die Kurzinfos unterschiedlicher Zertifikate sich voneinander unterschieden (dies ist besonders dann wichtig, wenn nur <xref linkend="tooltips-validity"/> ausgewählt wurde).

source: You can independently enable or disable the following information sets:
de: Sie können unabhängig voneinander die folgenden Informationen ein- oder ausschalten:

source: Show validity
de: Gültigkeit anzeigen

source: Shows information about the validity of a certificate: its current status, issuer-&dn; (&smime; only), expiry dates (if any) and certificate usage flags.
de: Zeigt Informationen über die Gültigkeit eines Zertifikats an: seinen derzeitigen Status, Aussteller-&dn; (nur bei &smime;), Verfallsdatum (wenn vorhanden) und Markierung zur Nutzung des Zertifikats.

source: Example:
de: Beispiel:

source: <!-- -->This certificate is currently valid. <!-- -->Issuer: CN=Test-ZS 7,O=Intevation GmbH,C=DE <!-- -->Validity: from 25.08.2009 10:42 through 19.10.2010 10:42 <!-- -->Certificate usage: Signing EMails and Files, Encrypting EMails and Files <!-- -->Key-ID: DC9D9E43<!-- -->
de: <!-- -->Dieses Zertifikat ist derzeit gültig. <!-- -->Ausgestellt durch: CN=Test-ZS7,O=Intevation GmbH,C=DE <!-- -->Gültigkeit: von 25.08.2009 10:42 bis 19.10.2010 10:42 <!-- -->Verwendung des Zertifikats: Signieren von E-Mails und Dateien, Verschlüsseln von E-Mails und Dateien <!-- -->Schlüssel-Kennung: DC9D9E43<!-- -->

source: Show owner information
de: Inhaber-Informationen anzeigen

source: Shows information about the owner of the certificate: subject-&dn; (&smime; only), user-IDs (including emails addresses) and ownertrust (&openpgp; only).
de: Zeigt Informationen über den Besitzer des Zertifikats: Verwendungs-&dn; (nur bei &smime;), Benutzer-ID (einschließlich E-Mail-Adressen) und Besitzervertrauen (nur bei &openpgp;).

source: &openpgp; example: <programlisting><!-- -->User-ID: Gpg4winUserA &lt;gpg4winusera@test.hq&gt; <!-- -->Key-ID: C6BF6664 <!-- -->Ownertrust: ultimate<!-- --></programlisting> &smime; example:
de: Beispiel für &openpgp;: <programlisting><!-- -->Benutzer-ID: Gpg4winUserA &lt;gpg4winusera@test.hq&gt; <!-- -->Schlüssel-Kennung: C6BF6664 <!-- -->Eigentümer-Vertrauen: vollständiges Vertrauen<!-- --></programlisting> Beispiel für &smime;:

source: <!-- -->Subject: CN=Gpg4winTestuserA,OU=Testlab,O=Gpg4win Project,C=DE <!-- -->a.k.a.: Gpg4winUserA@test.hq <!-- -->Key-ID: DC9D9E43<!-- -->
de: <!-- -->Verwendung: CN=Gpg4winTestuserA,OU=Testlab,O=Gpg4win Project,C=DE <!-- -->Auch bekannt als: Gpg4winUserA@test.hq <!-- -->Schlüssel-Kennung: DC9D9E43<!-- -->

source: Show technical details
de: Technische Details anzeigen

source: Shows technical information about the certificate: serial number (&smime; only), type, fingerprint and storage location.
de: Zeigt technische Informationen über das Zertifikat an: Seriennummer (nur bei &smime;), Typ, Fingerabdruck und Speicherort.

source: <!-- -->Serial Number: 27 <!-- -->Certificate type: 1,024-bit RSA (secret certificate available) <!-- -->Key-ID: DC9D9E43 <!-- -->Fingerprint: 854F62EEEBB41BFDD3BE05D124971E09DC9D9E43 <!-- -->Stored: on this computer<!-- -->
de: <!-- -->Seriennummer: 27 <!-- -->Zertifikatstyp: 1,024-bit RSA (geheimer Schlüssel vorhanden) <!-- -->Schlüssel-Kennung: DC9D9E43 <!-- -->Fingerabdruck: 854F62EEEBB41BFDD3BE05D124971E09DC9D9E43 <!-- -->Gespeichert: auf diesem Rechner<!-- -->

source: Configuring <guilabel>Certificate Categories</guilabel>
de: <guilabel>Zertifikats-Kategorien</guilabel> einrichten

source: &kleopatra; allows you to customize the appearance of certificates in the list view. This includes showing a small icon, but you can also influence the foreground (text) and background colors, as well as the font.
de: Sie können in &kleopatra; die Darstellung der Schlüssel in der Schlüsselliste einstellen. Dazu gehören die Anzeige kleiner Symbole aber auch die Vordergrund- (Text-) und Hintergrundfarbe sowie der Zeichensatz.

source: Each certificate category in the list is assigned a set of colors, an icon (optional) and a font in which certificates from that category are displayed. The category list also acts as a preview of the settings. Categories can be freely defined by the administrator or the power user, see <xref linkend="admin-key-filters"/> in <xref linkend="admin"/>.
de: Jeder Schlüsselkategorie in der Liste ist ein Satz von Farben, ein optionales Symbol und ein Zeichensatz zugeordnet, in denen die Schlüssel, die zu dieser Kategorie gehören, dargestellt werden. Die Kategorieliste dient auch als Vorschau für die Einstellungen. Der Systemverwalter oder erfahrene Benutzer können die Kategorien frei definieren; siehe dazu <xref linkend="admin-key-filters"/> in <xref linkend="admin"/>.

source: To set or change the icon of a category, select it in the list, and press the <guibutton>Set Icon...</guibutton> button. The standard &kde; icon selection dialog will appear where you can select an existing icon from the &kde; collection, or load a custom one.
de: Um das Symbol einer Kategorie zu ändern, wählen Sie die Kategorie in der Liste aus und klicken auf <guilabel>Symbol einstellen...</guilabel>. Der Standard-Symboldialog von &kde; erscheint, in dem Sie ein Symbol aus der &kde;-Sammlung auswählen oder ein eigenes einstellen können.

source: To remove an icon again, you need to press the <guibutton>Default Appearance</guibutton> button.
de: Um ein Symbol wieder zu löschen, verwenden Sie die Schaltfläche <guilabel>Voreingestelltes Erscheinungsbild</guilabel>.

source: To change the text (&ie; foreground) color of a category, select it in the list, and press the <guibutton>Set Text Color...</guibutton> button. The standard &kde; color selection dialog will appear where you can select an existing color or create a new one.
de: Um die Textfarbe, &ie; den Vordergrund einer Kategorie zu ändern, wählen Sie die Kategorie in der Liste aus und klicken auf <guibutton>Textfarbe einstellen ...</guibutton> Der Standard-Farbdialog von &kde; erscheint, indem Sie eine Farbe auswählen oder eine neue erstellen können.

source: Changing the background color is done in the same way, just press <guibutton>Set Background Color...</guibutton> instead.
de: Die Hintergrundfarbe wird auf die gleiche Weise geändert, verwenden Sie hier die Schaltfläche <guibutton>Hintergrundfarbe einstellen ..</guibutton>.

source: To change the font, you basically have two options:
de: Sie haben zwei Möglichkeiten, den Zeichensatz einzustellen:

source: Modify the standard font, used for all list views in &kde;.
de: Verändern Sie den Standard-Zeichensatz, der für alle Listenanzeigen in &kde; verwendet wird.

source: Use a custom font.
de: Verwenden Sie einen benutzerdefinierten Zeichensatz.

source: The first option has the advantage that the font will follow whichever style you choose &kde;-wide, whereas the latter gives you full control over the font to use. The choice is yours.
de: Die erste Option hat den Vorteil, dass der Zeichensatz Ihren &kde;-weiten Stileinstellungen folgen wird, während Sie bei der letzteren Möglichkeit die volle Kontrolle über den zu verwendenden Zeichensatz haben. Die Wahl liegt bei Ihnen.

source: To use the modified standard font, select the category in the list, and check or uncheck the font modifiers <guilabel>Italic</guilabel>, <guilabel>Bold</guilabel>, and/or <guilabel>Strikeout</guilabel>. You can immediately see the effect on the font in the category list.
de: Um den Standard-Zeichensatz zu verändern, wählen Sie die Kategorie in der Liste und ändern Sie die Modifikatoren <guilabel>Kursiv</guilabel>, <guilabel>Fett</guilabel> und/oder <guilabel>Durchgestrichen</guilabel>. Sie können den Effekt auf den Zeichensatz in der Kategorienliste unmittelbar sehen.

source: To use a custom font, press the <guibutton>Set Font...</guibutton> button. The standard &kde; font selection dialog will appear where you can select the new font.
de: Um einen benutzerdefinierten Zeichensatz einzustellen, klicken Sie auf die Schaltfläche <guibutton>Zeichensatz einstellen ..</guibutton>. Der Standard-Zeichensatzdialog von &kde; erscheint, in dem Sie den neuen Zeichensatz einstellen können.

source: You can still use the font modifiers to change the custom font, just as for modifying the standard font.
de: Beachten Sie, dass Sie die Zeichensatz-Modifikatoren weiterhin für den eigenen Zeichensatz verwenden können; genau wie beim Verändern des Standard-Zeichensatz.

source: To switch back to the standard font, you need to press the <guibutton>Default Appearance</guibutton> button.
de: Um auf den Standard-Zeichensatz zurückzuschalten, verwenden Sie die Schaltfläche <guibutton>Voreingestelltes Erscheinungsbild</guibutton>.

source: Configuring <guilabel>DN-Attribute Order</guilabel>
de: Die <guilabel>&dn;-Attributreihenfolge</guilabel> einstellen

source: Although &dn;s are hierarchical, the order of the individual components (called relative &dn;s (RDNs), or &dn; attributes) is not defined. The order in which the attributes are shown is thus a matter of personal taste or company policy, which is why it is configurable in &kleopatra;.
de: &dn;s sind zwar hierarchisch, aber die Reihenfolge der einzelnen Komponenten (auch relative &dn;s (RDNs) oder &dn;-Attribute genannt) ist nicht definiert. Die Reihenfolge, in der die Attribute angezeigt werden, ist daher eine Frage des persönlichen Geschmacks oder von Firmenvorgaben, weswegen Sie diese Reihenfolge in &kleopatra; konfigurieren können.

source: This setting does not only apply to &kleopatra;, but to all applications using &kleopatra; Technology. At the time of this writing, these include &kmail;, &kaddressbook;, as well as &kleopatra; itself, of course.
de: Diese Einstellung gilt nicht nur für &kleopatra;, sondern für alle Anwendungen, die &kleopatra;-Technologie verwenden. Dazu gehören derzeit &kmail;, &kaddressbook; und natürlich &kleopatra; selbst.

source: This configuration page basically consists of two lists, one for the known attributes (<guilabel>Available attributes</guilabel>), and one describing the <guilabel>Current attribute order</guilabel>.
de: Diese Konfigurationsseite besteht im wesentlichen aus zwei Listen, eine für die bekannten Attribute (<guilabel>Verfügbare Attribute</guilabel>) und eine, die die <guilabel>Aktuelle Attributreihenfolge</guilabel> beschreibt.

source: Both lists contain entries described by the short form of the attribute (&eg; <guilabel>CN</guilabel>) as well as the spelled-out form (<guilabel>Common Name</guilabel>).
de: Beide Listen enthalten Einträge, die sowohl durch die Kurzform des Attributs (&eg; <guilabel>CN</guilabel>) als auch durch die ausgeschriebene Form (<guilabel>Allgemeiner Name</guilabel>) beschrieben werden.

source: The <guilabel>Available attributes</guilabel> list is always sorted alphabetically, while the <guilabel>Current attribute order</guilabel> list's order reflects the configured &dn; attribute order: the first attribute in the list is also the one displayed first.
de: Die Einträge in der Liste <guilabel>Verfügbare Attribute</guilabel> sind immer alphabetisch sortiert, während die Reihenfolge in der Liste <guilabel>Aktuelle Attributreihenfolge</guilabel> die eingestellte Reihenfolge der &dn;-Attribute widerspiegelt; das erste Attribut in dieser Liste wird auch als erstes angezeigt.

source: Only attributes explicitly listed in the <guilabel>Current attribute order</guilabel> list are displayed at all. The rest is hidden by default.
de: Nur Attribute, die explizit in der Liste <guilabel>Aktuelle Attributreihenfolge:</guilabel> aufgeführt sind, werden überhaupt angezeigt. Der Rest ist in der Voreinstellung ausgeblendet.

source: However, if the placeholder entry <guilabel>_X_</guilabel> (<guilabel>All others</guilabel>) is in the <quote>current</quote> list, all unlisted attributes (whether known or not), are inserted at the point of <guilabel>_X_</guilabel>, in their original relative order.
de: Wenn aber der Platzhalter <guilabel>_X_</guilabel> (<guilabel>Alle anderen</guilabel>) in der <quote>aktuellen</quote> Liste steht, dann werden alle nicht aufgeführten Attribute (ob bekannt oder nicht) an der Position des <guilabel>_X_</guilabel> in ihrer ursprünglichen relativen Reihenfolge eingefügt.

source: A small example will help to make this more clear:
de: Ein kleines Beispiel soll dies deutlicher machen:

source: Given the &dn;
de: Im &dn;

source: the default attribute order of <quote>CN, L, _X_, OU, O, C</quote> will produce the following formatted &dn;:
de: die Standardreihenfolge der Attribute <quote>CN, L, _X_, OU, O, C</quote> ergibt folgenden formatierten &dn;.

source: while <quote>CN, L, OU, O, C</quote> will produce
de: <quote>CN, L, OU, O, C</quote> dagegen ergibt

source: To add an attribute to the display order list, select it in the <guilabel>Available attributes</guilabel> list, and press the <guilabel>Add to current attribute order</guilabel> button.
de: Um ein Attribut zur Anzeigeliste hinzuzufügen, wählen Sie es in der Liste der verfügbaren Attribute aus und klicken auf die Schaltfläche <guilabel>Zur aktuellen Attributreihenfolge hinzufügen</guilabel>.

source: To remove an attribute from the display order list, select it in the <guilabel>Current attribute order</guilabel> list, and press the <guilabel>Remove from current attribute order</guilabel> button.
de: Um ein Attribut aus der Anzeigeliste zu entfernen, wählen Sie es in dieser aus und klicken auf die Schaltfläche <guilabel>Von der aktuellen Attributreihenfolge entfernen</guilabel>.

source: To move an attribute to the beginning (end), select it in the <guilabel>Current attribute order</guilabel> list, and press the <guilabel>Move to top</guilabel> (<guilabel>Move to bottom</guilabel>) button.
de: Um ein Attribut an den Anfang oder das Ende zu verschieben, wählen Sie es in der Liste <guilabel>Aktuelle Attributreihenfolge</guilabel> aus und klicken auf eine der Schaltflächen <guilabel>Nach ganz oben</guilabel> oder <guilabel>Nach ganz unten</guilabel>.
