Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdepim/kleopatra.po
Languages: de

source: To move an attribute up (down) one slot only, select it in the <guilabel>Current attribute order</guilabel> list, and press the <guilabel>Move one up</guilabel> (<guilabel>Move one down</guilabel>) button.
de: Um ein Attribut um eine Position nach oben oder unten zu verschieben, wählen Sie es in der Anzeigeliste aus und klicken auf eine der Schaltflächen <guilabel>Nach oben</guilabel> oder <guilabel>Nach unten</guilabel>.

source: Configuring Crypto Operations
de: Kryptografie-Aktionen einrichten

source: Configuring <guilabel>EMail Operations</guilabel>
de: <guilabel>E-Mail-Aktionen</guilabel> einrichten

source: Here you can configure some aspects of the email operations of &kleopatra;'s &uiserver;. Currently, you can only configure whether or not to use <quote>Quick Mode</quote> for signing and encrypting emails, individually.
de: Hier können Sie einige Dinge der E-Mail-Operationen des &kleopatra;-&uiserver;s einstellen. Derzeit lässt sich nur einstellen, ob Sie den <quote>Schnell-Modus</quote> für das Signieren und Verschlüsseln von E-Mails nutzen wollen.

source: When <quote>Quick Mode</quote> is enabled, no dialog is shown when signing (encrypting) emails, respectively, unless there is a conflict that needs manual resolution.
de: Wenn der <quote>Schnell-Modus</quote> aktiviert ist, werden zum Signieren (Verschlüsseln) von E-Mails keine Dialoge erscheinen, solange keine Konflikte auftreten, die eine manuelle Auflösung erfordern.

source: Configuring <guilabel>File Operations</guilabel>
de: <guilabel>Datei-Aktionen</guilabel> einrichten

source: Here you can configure some aspects of the file operations of &kleopatra;'s &uiserver;. Currently, you can only choose the checksum program to use for <command>CHECKSUM_CREATE_FILES</command>.
de: Hier lassen sich einige Dinge der Datei-Operation des &kleopatra;-&uiserver;s einstellen. Derzeit können Sie nur das Programm zum Erstellen der Prüfsummen durch <command>CHECKSUM_CREATE_FILES</command> festlegen.

source: Use <guilabel>Checksum program to use</guilabel> to choose which of the configured checksum programs should be used when creating checksum files.
de: Verwenden Sie <guilabel>Prüfsummen-Programm</guilabel>, um festzulegen, welches der eingestellten Prüfsummen-Programme für das Erstellen von Prüfsummendateien verwendet werden soll.

source: When verifying checksums, the program to use is automatically found, based on the names of the checksum files found.
de: Zum Verifizieren wird das erforderliche Prüfsummen-Programm automatisch aus den Namen der Prüfsummen-Datei ermittelt.

source: The administrator and power user can completely define which checksum programs to make available to &kleopatra; through so-called <quote>Checksum Definitions</quote> in the config file. See <xref linkend="admin-checksum-definitions"/> in <xref linkend="admin"/> for details.
de: Systemverwalter und erfahrene Benutzer können die Prüfsummen-Programme, die &kleopatra; zur Verfügung stehen sollen, völlig frei in den sogenannten <quote>Checksum Definitions</quote> der Einrichtungsdatei definieren. Für Details sei auf <xref linkend="admin-checksum-definitions"/> in <xref linkend="admin"/> verwiesen.

source: Configuring aspects of S/&MIME; Validation
de: S/&MIME;-Prüfung einrichten

source: On this page, you can configure certain aspects of the validation of &smime; certificates.
de: Auf dieser Seite können Sie einige Aspekte der Validierung von &smime;-Zertifikaten einstellen.

source: For the most part, this is simply a more user-friendly version of the same settings you also find in <xref linkend="configuration-gnupg-system"/>. Everything you can configure here, you can configure there, too, with the exception of <xref linkend="configuration-smime-validation-refresh-interval"/>, which is &kleopatra;-specific.
de: In der Regel ist dies eine einfachere und benutzerfreundlichere Version der gleichen Einstellungen, wie sie unter <xref linkend="configuration-gnupg-system"/> zu finden sind. Alles, was Sie hier einstellen können, ist auch dort möglich. Einzige Ausnahme bildet <xref linkend="configuration-smime-validation-refresh-interval"/>, welches spezifisch für &kleopatra; ist.

source: The meaning of the options is as follows:
de: Diese Optionen haben folgende Bedeutung:

source: Configuring interval certificate checking
de: Einstellen des Intervalls zur Zertifikatüberprüfung

source: Check certificate validity every <replaceable>N</replaceable> hours
de: Zertifikatsgültigkeit überprüfen alle <replaceable>N</replaceable> Stunden

source: This option enables interval checking of certificate validity. You can also choose the checking interval (in hours). The effect of interval checking is the same as <xref linkend="view-redisplay"/>; there is no provision for interval scheduling of <xref linkend="certificates-refresh-openpgp"/> or <xref linkend="certificates-refresh-x509"/>.
de: Diese Option aktiviert regelmäßiges Überprüfen der Zertifikatgültigkeit. Sie können außerdem das Intervall in Stunden wählen. Der Effekt der hier eingestellten regelmäßigen Überprüfung ist der gleiche wie der von <xref linkend="view-redisplay"/>. Es gibt keine Vorbedingungen für die Intervallplanung von <xref linkend="certificates-refresh-openpgp"/> oder <xref linkend="certificates-refresh-x509"/>.

source: Validation is performed implicitly whenever significant files in <filename>~/.gnupg</filename> change. This option, just like <xref linkend="certificates-refresh-openpgp"/> and <xref linkend="certificates-refresh-x509"/>, therefore only affects external factors of certificate validity.
de: Die Überprüfung wird vorbehaltlos immer dann ausgeführt, wenn wichtige Dateien in <filename>~/.gnupg</filename> verändert werden. Diese Option, wie auch <xref linkend="certificates-refresh-openpgp"/> und <xref linkend="certificates-refresh-x509"/>, betrifft daher nur äußere Faktoren der Zertifikatgültigkeit.

source: Configuring validation method
de: Einstellung der Überprüfungsmethode

source: Validate certificates using CRLs
de: Zertifikate unter Verwendung von Sperrlisten prüfen

source: If this option is selected, &smime; certificates are validated using Certificate Revocation Lists (&crl;s).
de: Falls diese Einstellung aktiviert ist, werden &smime;-Zertifikate mit Hilfe von Zertifikatsperrlisten (&crl;s) überprüft.

source: See <xref linkend="configuration-smime-validation-use-ocsp"/> for alternative method of certificate validity checking.
de: Siehe <xref linkend="configuration-smime-validation-use-ocsp"/> für eine alternative Methode zur Überprüfung der Zertifikatgültigkeit.

source: Validate certificates online (OCSP)
de: Zertifikate online überprüfen (OCSP)

source: If this option is selected, &smime; certificates are validated online using the Online Certificates Status Protocol (&ocsp;).
de: Wenn diese Einstellung ausgewählt ist, werden &smime;-Zertifikate mittels des Online Certificates Status Protocol (&ocsp;) überprüft.

source: When choosing this method, a request is sent to the server of the &ca; more or less each time you send or receive a cryptographic message, thus theoretically allowing the certificate issuing agency to track whom you exchange (&eg;) mails with.
de: Wenn diese Methode gewählt ist, wird eine Anfrage an den Server des &ca; eigentlich immer dann gestellt, wenn Sie eine verschlüsselte Nachricht empfangen oder senden. Daher ist es dem Zertifikataussteller theoretisch möglich nachzuverfolgen mit wem Sie (&eg;) E-Mails austauschen.

source: To use this method, you need to enter the &URL; of the &ocsp; responder into <xref linkend="configuration-smime-validation-ocsp-url"/>.
de: Um diese Methode nutzen zu können müssen Sie die &URL; des &ocsp;-Antwortservers in <xref linkend="configuration-smime-validation-ocsp-url"/> eingeben.

source: See <xref linkend="configuration-smime-validation-use-ocsp"/> for a more traditional method of certificate validity checking that does not leak information about whom you exchange messages with.
de: Sehen Sie <xref linkend="configuration-smime-validation-use-ocsp"/> für eine traditionellere Methode zur Überprüfung der Zertifikatgültigkeit, die keine Informationen darüber verrät, mit wem sie Nachrichten austauschen.

source: OCSP responder URL
de: Adresse der OCSP-Gegenstelle

source: Enter here the address of the server for online validation of certificates (&ocsp; responder). The &URL; usually starts with <literal>http://</literal>.
de: Geben Sie hier die Adresse des Servers für die Online-Überprüfung von Zertifikaten ein (&ocsp;-Antwortserver). Die Adresse (&URL;) beginnt üblicherweise mit <literal>http://</literal>.

source: OCSP responder signature
de: Signatur der OCSP-Gegenstelle

source: Choose here the certificate with which the &ocsp; server signs its replies.
de: Wählen Sie hier das Zertifikat mit dem der &ocsp;-Server seine Antworten signiert.

source: Ignore service URL of certificates
de: Dienst-Adresse in Zertifikaten ignorieren

source: Each &smime; certificate usually contains the &URL; of its issuer's &ocsp; responder (<xref linkend="certificates-dump-certificate"/> will reveal whether a given certificate contains it).
de: Normalerweise enthält jedes &smime;-Zertifikat die &URL; des &ocsp;-Antwortservers des zugehörigen Ausstellers (<xref linkend="certificates-dump-certificate"/> gibt aus, ob ein bestimmtes Zertifikat diese enthält).

source: Checking this option makes &gpgsm; ignore those &URL;s and only use the one configured above.
de: Auswählen dieser Option lässt &gpgsm; diese &URL;s ignorieren und nutzt nur die oben eingestellten.

source: Use this to &eg; enforce use of a company-wide &ocsp; proxy.
de: Benutzen Sie dies um &eg; die Verwendung eines firmenweiten &ocsp;-Proxys zu erzwingen.

source: Configuring validation options
de: Überprüfungseinstellungen einrichten

source: Do not check certificate policies
de: Zertifikats-Richtlinien nicht überprüfen

source: By default, &gpgsm; uses the file <filename>~/.gnupg/policies.txt</filename> to check if a certificate policy is allowed. If this option is selected, policies are not checked.
de: Standardmäßig verwendet &gpgsm; die Datei <filename>~/.gnupg/policies.txt</filename> zur Überprüfung, ob ein bestimmter Umgang mit einem Zertifikat erlaubt ist. Falls diese Einstellung aktiviert ist, wird die Überprüfung nicht durchgeführt.

source: Never consult a CRL
de: Nie Sperrlisten zu Rate ziehen

source: If this option is checked, Certificate Revocation Lists are never used to validate &smime; certificates.
de: Wenn diese Option ausgewählt ist, werden Zertifikat-Widerrufslisten (Certificate Revocation Lists, CRLs) nie zur Überprüfung von &smime;-Zertifikaten verwendet.

source: Allow to mark root certificates as trusted
de: Das Markieren von Wurzelzertifikaten als vertrauenswürdig zulassen

source: If this option is checked while a root &ca; certificate is being imported, you will be asked to confirm its fingerprint and to state whether or not you consider this root certificate to be trusted.
de: Falls diese Einstellung beim Importieren eines Wurzel-&ca;-Zertifikates aktiviert ist, werden Sie um Bestätigung des Fingerabdrucks und des Status gebeten, egal ob Sie dem Zertifikat vertrauen oder nicht.

source: A root certificate needs to be trusted before the certificates it certified become trusted, but lightly allowing trusted root certificates into your certificate store will undermine the security of the system.
de: Sie müssen einem Wurzelzertifikat vertrauen, damit die damit signierten Zertifikate ebenfalls vertrauenswürdig werden können. Durch leichtfertiges Importieren und Vertrauen von Wurzelzertifikaten können Sie die Sicherheit des gesamten Systems gefährden.

source: Enabling this functionality in the backend can lead to popups from &pinentry; at inopportune times (&eg; when verifying signatures), and can thus block unattended email processing. For that reason, and because it is desirable to be able to <emphasis>distrust</emphasis> a trusted root certificate again, &kleopatra; allows manual setting of trust using <xref linkend="certificates-trust-root"/> and <xref linkend="certificates-distrust-root"/>.
de: Diese Funktion in den Treibereinstellungen zu aktivieren kann zu sich öffnenden Fenstern durch &pinentry; zu unliebsamen Zeitpunkten führen (&eg; beim Überprüfen von Signaturen) und kann dadurch unbeaufsichtigte E-Mail-Bearbeitung blockieren. Aus diesem Grund und weil es wünschenswert sein kann einem vertrauten Wurzelzertifikat wieder zu <emphasis>misstrauen</emphasis>, erlaubt &kleopatra; das manuelle Setzen des Vertrauens mit Hilfe von <xref linkend="certificates-trust-root"/> und <xref linkend="certificates-distrust-root"/>.

source: This setting here does not influence the &kleopatra; function.
de: Diese Einstellung hier beeinträchtigt die &kleopatra;-Funktion nicht.

source: Fetch missing issuer certificates
de: Fehlende Aussteller-Zertifikatsketten einholen

source: If this option is checked, missing issuer certificates are fetched when necessary (this applies to both validation methods, &crl;s and &ocsp;).
de: Falls diese Einstellung aktiviert ist, werden fehlende Ausstellerzertifikate heruntergeladen (das gilt für beide Überprüfungsmethoden, &crl;s und &ocsp;).

source: Configuring &http; request options
de: Einrichten der Optionen für &http;-Anfragen

source: Do not perform any HTTP requests
de: Keine HTTP-Anfragen durchführen

source: Entirely disables the use of &http; for &smime;.
de: Schaltet die Verwendung von &http; für &smime; gänzlich ab.

source: Ignore HTTP CRL distribution point of certificates
de: HTTP-Quellen für Sperrlisten von Zertifikaten ignorieren

source: When looking for the location of a &crl;, the to-be-tested certificate usually contains what are known as <quote>&crl; Distribution Point</quote> (<acronym>DP</acronym>) entries, which are &URL;s describing the way to access the &crl;. The first-found <acronym>DP</acronym> entry is used.
de: Für die Suche der Adresse einer Sperrliste (&crl;) enthält das fragliche Zertifikat häufig die Angabe eines &crl;-Verteilers (<quote>Distribution Point</quote>: <acronym>DP</acronym>), der die Angabe von Adressen (&URL;s) zur Beschreibung des Zugriffs auf die &crl; enthält. Der erste <acronym>DP</acronym>-Eintrag wird verwendet.

source: With this option, all entries using the &http; scheme are ignored when looking for a suitable <acronym>DP</acronym>.
de: Bei dieser Einstellung werden alle Einträge, die das &ldap;-Schema verwenden, bei der Suche nach einem passenden <acronym>DP</acronym>-Eintrag ignoriert.

source: Use system HTTP proxy
de: Systemweiten HTTP-Proxy-Server verwenden

source: If this option is selected, the value of the &http; proxy shown on the right (which comes from the environment variable <envar>http_proxy</envar>) will be used for any &http; request.
de: Falls diese Einstellung aktiviert ist, wird der rechts angezeigte &http;-Proxyserver (die Einstellung stammt aus der Umgebungsvariable <envar>http_proxy</envar>) für alle &http;-Anfragen verwendet.

source: Use this proxy for HTTP requests
de: Diesen Proxy für HTTP-Anfragen verwenden

source: If no system proxy is set, or you need to use a different proxy for &gpgsm;, you can enter its location here.
de: Sollte kein systemweiter Proxy vorgegeben sein oder Sie einen anderen Proxy für &gpgsm; nutzen wollen, können Sie diesen hier angeben.

source: It will be used for all &HTTP; requests relating to S/&MIME;.
de: Dieser wird für alle &HTTP;-Anfragen, die &smime; betreffen, genutzt.

source: The syntax is <userinput><replaceable>host</replaceable><literal>:</literal><replaceable>port</replaceable></userinput>, &eg; <userinput>myproxy.nowhere.com:3128</userinput>.
de: Als Syntax wird <userinput><replaceable>Host</replaceable><literal>:</literal><replaceable>Port</replaceable></userinput>, &eg; <userinput>meinproxy.nirgendwo.de:3128</userinput> benutzt.

source: Configuring &ldap; request options
de: Einrichten der Optionen für &ldap;-Anfragen

source: Do not perform any LDAP requests
de: Keine Verzeichnisdienstanfragen durchführen

source: Entirely disables the use of &ldap; for &smime;.
de: Die Verwendung von &ldap; für &smime; gänzlich abschalten.

source: Ignore LDAP CRL distribution point of certificates
de: Verzeichnisdienst-Quellen für Sperrlisten von Zertifikaten ignorieren

source: When looking for the location of a &crl;, the to-be-tested certificate usually contains what are known as "&crl; Distribution Point" (<acronym>DP</acronym>) entries, which are &URL;s describing the way to access the &crl;. The first found <acronym>DP</acronym> entry is used.
de: Für die Suche der Adresse einer Sperrliste (&crl;) enthält das fragliche Zertifikat häufig die Angabe eines &crl;-Verteilers (<quote>Distribution Point</quote>: <acronym>DP</acronym>), der die Angabe von Adressen (&URL;s) zur Beschreibung des Zugriffs auf die &crl; enthält. Der erste <acronym>DP</acronym>-Eintrag wird verwendet.

source: With this option, all entries using the &ldap; scheme are ignored when looking for a suitable <acronym>DP</acronym>.
de: Bei dieser Einstellung werden alle Einträge, die das &ldap;-Schema verwenden, bei der Suche nach einem passenden <acronym>DP</acronym>-Eintrag ignoriert.

source: Primary host for LDAP requests
de: Primäre Adresse für Anfragen an den Verzeichnisdienst:

source: Entering an &ldap; server here will make all &ldap; requests go to that server first. More precisely, this setting overrides any specified <replaceable>host</replaceable> and <replaceable>port</replaceable> part in an &ldap; &URL; and will also be used if <replaceable>host</replaceable> and <replaceable>port</replaceable> have been omitted from the &URL;.
de: Ist hier ein &ldap;-Server angegeben, werden alle &ldap;-Anfragen zuerst zu diesem Server gesendet. Genauer gesagt überschreibt diese Einstellung hier sämtliche <replaceable>Host</replaceable>- und <replaceable>Port</replaceable>-Teile in einer &ldap;-&URL; und wird auch dann genutzt wenn <replaceable>Host</replaceable> und <replaceable>Port</replaceable> in der &URL; nicht auftauchen.

source: Other &ldap; servers will be used only if the connection to the <quote>proxy</quote> failed. The syntax is <userinput><replaceable>host</replaceable></userinput> or <userinput><replaceable>host</replaceable><literal>:</literal><replaceable>port</replaceable></userinput>. If <replaceable>port</replaceable> is omitted, port 389 (standard &ldap; port) is used.
de: Andere &ldap;-Server werden nur dann genutzt, wenn die Verbindung <quote>Proxy</quote> nicht aufgebaut werden konnte. Die Syntax hierfür ist <userinput><replaceable>Host</replaceable></userinput> oder <userinput><replaceable>Host</replaceable><literal>:</literal><replaceable>Port</replaceable></userinput>. Ist <replaceable>Port</replaceable> ausgelassen, wird Port 389 (der Standard-Port für &ldap;) genutzt.

source: Configuring the &gnupg; System
de: Einrichtung des &gnupg;-Systems

source: This part of the dialog is auto-generated from the output of <command>gpgconf <option>--list-components</option></command> and, for each <replaceable>component</replaceable> that the above command returns, the output of <command>gpgconf <option>--list-options</option> <replaceable>component</replaceable></command>.
de: Dieser Teil des Fensters wird automatisch aus den Ausgaben von <command>gpgconf <option>--list-option</option> <replaceable>Komponente</replaceable></command> generiert, wobei dieser für jede von <command>gpgconf <option>--list-components</option></command> zurückgegebener <replaceable>Komponente</replaceable> ausgeführt wird.

source: The most useful of these options have been duplicated as separate pages in the &kleopatra; config dialog. See <xref linkend="configuration-directory-services"/> and <xref linkend="configuration-smime-validation"/> for the two dialog pages which contain selected options from this part of the dialog.
de: Die nützlichsten dieser Optionen wurden als eigenständige Seiten im Einstellungsdialog von &kleopatra; dupliziert. Sehen Sie <xref linkend="configuration-directory-services"/> und <xref linkend="configuration-smime-validation"/>, um mehr über diese beiden Seiten und die in diesem Teil dieses Fensters enthaltenen Optionen zu erfahren.

source: The exact content of this part of the dialog depends on the version of the &gnupg; backend you have installed and, potentially, the platform you run on. Thus, we will only discuss the general layout of the dialog, including the mapping from &gpgconf; option to &kleopatra; &GUI; control.
de: Der genaue Inhalt dieses Teils des Fensters hängt von der Version des &gnupg;-Treibers ab, den Sie installiert haben. Zudem vermutlich ebenfalls vom Betriebssystem, das Sie nutzen. Daher wird hier nur der allgemeine Aufbau des Fensters einschließlich der Abbildung der &gpgconf;-Optionen auf die &GUI;-Bedienelemente von &kleopatra; erläutert.

source: &gpgconf; returns configuration information for multiple components. Inside each component, individual options are combined into groups.
de: &gpgconf; gibt Informationen über die Einstellungen zahlreicher Optionen. Innerhalb jeder Komponente sind individuelle Optionen zu Gruppen zusammengestellt.

source: &kleopatra; displays one tab per component reported by &gpgconf;; groups are headed by a horizontal line displaying the group name as returned from &gpgconf;.
de: &kleopatra; zeigt eine Registerkarte pro von &gpgconf; zurückgegebener Komponente. Gruppen sind durch horizontale Linien und den Namen der Gruppe, so wie der von &gpgconf; zurückgegeben wird, voneinander getrennt.

source: Each &gpgconf; option has a type. Except for certain well-known options which &kleopatra; backs with specialised controls for a better user experience, the mapping between &gpgconf; types and &kleopatra; controls is as follows:
de: Jede &gpgconf;-Option hat einen Typen. Mit Ausnahme einiger gut bekannter Optionen, die &kleopatra; mit besonderen Bedienelementen für eine bessere Benutzbarkeit gesondert handhabt, ist die Abbildung der &gpgconf;-Typen auf die &GUI;-Bedienelemente wie folgt:

source: Mapping From &gpgconf; Types To &GUI; Controls
de: Abbilden der &gpgconf;-Typen auf die &GUI;-Bedienelemente

source: &gpgconf; type
de: &gpgconf;-Typ

source: &kleopatra; control
de: &kleopatra;-Bedienelement

source: for lists
de: für Listen

source: for non-lists
de: für nicht-Listen

source: Spinbox (<quote>count</quote>-semantics)
de: Spinbox (bezogen auf eine <quote>Anzahl</quote>)

source: Checkbox
de: Ankreuzfeld

source: Lineedit (unformatted)
de: LineEdit (unformatiert)

source: specialised control
de: spezialisiertes Bedienelement

source: See the &gpgconf; manual for more information about what you can configure here, and how.
de: Im Handbuch von &gpgconf; finden Sie weitere Informationen über die Einstellungsmöglichkeiten.

source: Administrator's Guide
de: Handbuch für den Systemverwalter

source: This Administrator's Guide describes ways to customize &kleopatra; that are not accessible via the &GUI;, but only via config files.
de: Dieses Handbuch für den Systemverwalter beschreibt Möglichkeiten, &kleopatra; zu konfigurieren, die nicht über die grafische Benutzerschnittstelle, sondern nur über Konfigurationsdateien erreichbar sind.

source: It is assumed that the reader is familiar with the technology used for &kde; application configuration, including layout, file system location and cascading of &kde; config files, as well as the KIOSK framework.
de: Wir gehen hier davon aus, dass der Leser mit der Technologie zum Konfigurieren von &kde;-Applikationen vertraut ist. Dazu gehören das Format, die Lage im Dateisystem und das Kaskadieren von &kde;-Konfigurationsdateien, sowie das KIOSK-System.

source: Customization of the Certificate-Creation Wizard
de: Anpassung des Assistenten zum Erzeugen von Zertifikaten
