Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdepim/kleopatra.po
Languages: de

source: <shortcut><keycombo action="simul">&Ctrl;&Shift;<keycap>I</keycap></keycombo></shortcut> <guimenu>File</guimenu><guimenuitem>Lookup Certificates on Server...</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;&Shift;<keycap>I</keycap></keycombo></shortcut> <guimenu>Datei</guimenu><guimenuitem>Zertifikate auf Server suchen ...</guimenuitem>

source: <action>Searches for, and imports, certificates from certificate servers into the local keybox.</action> See <xref linkend="functions-search"/> for details.
de: <action>Sucht Zertifikate auf Zertifikatsservern und importiert sie in den lokalen Schlüsselspeicher.</action> Weitere Informationen finden Sie unter <xref linkend="functions-search"/>.

source: You need to have key servers configured for this to work. See <xref linkend="configuration-directory-services"/> for more details.
de: Um diese Funktion verwenden zu können, müssen Schlüsselserver eingerichtet sein. Weitere Informationen finden Sie unter <xref linkend="configuration-directory-services"/>.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>I</keycap></keycombo></shortcut> <guimenu>File</guimenu><guimenuitem>Import Certificates...</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>I</keycap></keycombo></shortcut> <guimenu>Datei</guimenu><guimenuitem>Zertifikate importieren ...</guimenuitem>

source: <action>Imports certificates and/or secret keys from files into the local keybox.</action> See <xref linkend="functions-search"/> for details.
de: <action>Importiert Zertifikate und/oder geheime Schlüssel aus Dateien in den lokalen Schlüsselspeicher.</action> Weitere Informationen finden Sie unter <xref linkend="functions-search"/>.

source: The format of the certificate file must be supported by &gpgsm;/&gpg;. Please refer to the &gpgsm; and &gpg; manuals for a list of supported formats.
de: Das Format der Zertifikatsdatei muss von &gpgsm;/&gpg; unterstützt werden. In den Handbüchern von &gpgsm; und &gpg; finden Sie eine Liste der unterstützten Formate.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>E</keycap></keycombo></shortcut> <guimenu>File</guimenu><guimenuitem>Export Certificates...</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>E</keycap></keycombo></shortcut> <guimenu>Datei</guimenu><guimenuitem>Zertifikate exportieren ...</guimenuitem>

source: Exports the selected certificates to a file.
de: Exportiert die ausgewählten Zertifikate in eine Datei.

source: The filename extension you choose for the export file name determines the format of the export file:
de: Die ausgewählte Dateierweiterung für den Namen der Exportdatei bestimmt gleichzeitig deren Format:

source: For &openpgp; certificates, <filename class="extension">gpg</filename> and <filename class="extension">pgp</filename> will result in a binary file, whereas <filename class="extension">asc</filename> will result in an &ascii;-armored file.
de: Bei &openpgp;-Zertifikaten wird mit der Dateierweiterung <filename class="extension">gpg</filename> und <filename class="extension">pgp</filename> eine binäre Datei, mit der Erweiterung <filename class="extension">asc</filename> eine Datei im &ascii;-Format erstellt.

source: For &smime; certificates, <filename class="extension">der</filename> will result in a binary, &der;-encoded file, whereas <filename class="extension">pem</filename> will result in an &ascii;-armored file.
de: Bei &smime;-Zertifikaten wird mit der Dateierweiterung <filename class="extension">der</filename> eine binäre Datei, mit der Erweiterung <filename class="extension">pem</filename> eine Datei im &ascii;-Format erstellt.

source: Unless multiple certificates are selected, &kleopatra; will propose <filename><replaceable>fingerprint</replaceable>.{asc,pem}</filename> as the export file name.
de: Sofern nicht mehrere Zertifikate ausgewählt sind, wird &kleopatra; <filename><replaceable>Fingerabdruck</replaceable>.{asc,pem}</filename> als Namen der Exportdatei vorschlagen.

source: This function is only available when one or more certificates have been selected.
de: Diese Funktion steht nur zur Verfügung, wenn ein oder mehrere Zertifikate ausgewählt sind.

source: This function exports only the public keys, even if the secret key is available. Use <xref linkend="file-export-secret-key"/> to export the secret keys into a file.
de: Diese Funktion exportiert nur die öffentlichen Schlüssel; auch wenn geheime Schlüssel verfügbar sind. Mit <xref linkend="file-export-secret-key"/> können Sie die geheimen Schlüssel in eine Datei exportieren.

source: <guimenu>File</guimenu><guimenuitem>Export Secret Keys...</guimenuitem>
de: <guimenu>Datei</guimenu> <guimenuitem>Geheime Schlüssel exportieren ...</guimenuitem>

source: Exports the secret key to a file.
de: Exportiert den geheimen Schlüssel in eine Datei.

source: In the dialog that opens, you can choose whether to create a binary or an &ascii;-armored export file (<guilabel>ASCII armor</guilabel>). Next click on the folder icon at the right hand side of the <guilabel>Output file</guilabel> text box and select folder and name of the export file. When exporting &smime; secret keys, you can also choose the <guilabel>Passphrase charset</guilabel>. See the discussion of the <option>--p12-charset&nbsp;<replaceable>charset</replaceable></option> option in the &gpgsm; manual for more details.
de: Im Dialog können Sie entscheiden, ob Sie in eine binäre Datei oder eine im &ascii;-Format (<guilabel>ASCII-Mantel</guilabel>) exportieren möchten. Klicken Sie dann auf das Ordnersymbol rechts neben dem Textfeld <guilabel>Ausgabedatei</guilabel> und wählen den Ordner und den Namen für die Exportdatei. Beim Export von geheimen &smime;-Schlüsseln können Sie zudem den <guilabel>Zeichensatz des Kennsatzes</guilabel> wählen. Hierfür sei auf die Erläuterungen der <option>--p12-charset&nbsp;<replaceable>Zeichensatz</replaceable></option>-Option im Handbuch zu &gpgsm; verwiesen.

source: This function is only available when exactly one certificate has been selected, and the secret key for that certificate is available.
de: Diese Funktion steht nur zur Verfügung, wenn genau ein Zertifikat ausgewählt ist und der zugehörige geheime Schlüssel verfügbar ist.

source: It should rarely be necessary to use this function, and if it is, it should be carefully planned. Planning the migration of a secret key involves choice of transport media and secure deletion of the key data on the old machine, as well as on the transport medium, among other things.
de: Diese Funktion benötigt man nur sehr selten, und wenn das doch einmal der Fall sein sollte, dann sollte dies sorgfältig geplant werden. Zur Planung der Migration eines geheimen Schlüssels gehört neben vielen anderen Dingen die Wahl des Transportmediums und das sichere Löschen der Schlüsseldaten auf dem alten Rechner sowie auf dem Transportmedium.

source: <shortcut><keycombo action="simul">&Ctrl;&Shift;<keycap>E</keycap></keycombo></shortcut> <guimenu>File</guimenu><guimenuitem>Export Certificates to Server...</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;&Shift;<keycap>E</keycap></keycombo></shortcut> <guimenu>Datei</guimenu><guimenuitem>Zertifikate zu einem Server exportieren ...</guimenuitem>

source: <action>Publish the selected certificates on a keyserver</action> (&openpgp; only).
de: <action>Exportiert die ausgewählten Zertifikate</action> zu einem Schlüsselserver. Diese Funktion steht nur für &openpgp; zu Verfügung.

source: The certificate is sent to the certificate server configured for &openpgp; (cf.&nbsp;<xref linkend="configuration-directory-services"/>), if that is set, otherwise to <systemitem class="systemname">keys.gnupg.net</systemitem>.
de: Falls eingestellt, wird das Zertifikat auf den für &openpgp; konfigurierten Zertifikatserver hochgeladen (siehe <xref linkend="configuration-directory-services"/>), anderenfalls auf <systemitem class="systemname">keys.gnupg.net</systemitem>.

source: This function is only available if at least one &openpgp; (and no &smime;) certificates have been selected.
de: Diese Funktion steht nur zur Verfügung, wenn mindestens ein &openpgp;-Zertifikat und kein &smime;-Zertifikat ausgewählt ist.

source: When &openpgp; certificates have been exported to a public directory server, it is nearly impossible to remove them again. Before exporting your certificate to a public directory server, make sure that you have created a revocation certificate so you can revoke the certificate if needed later.
de: Wenn ein &openpgp;-Zertifikat bei einem öffentlichen Verzeichnisdienst registriert wurde, kann es in der Regel von dort nicht mehr entfernt werden. Stellen Sie daher vor der Registrierung sicher, dass Sie ein Widerrufszertifikat erstellt haben, sodass Sie das Zertifikat bei Bedarf zurückziehen können.

source: Most public &openpgp; certificate servers synchronize certificates amongst each other, so there is little point in sending to more than one.
de: Die meisten öffentlichen &openpgp;-Zertifikatserver werden untereinander abgeglichen, so dass es wenig Sinn macht das Zertifikat zu mehr als einen Server hochzuladen.

source: It can happen that a search on a certificate server turns up no results even though you just have sent your certificate there. This is because most public keyserver addresses use <acronym>DNS</acronym> round-robin to balance the load over multiple machines. These machines synchronize with each other, but usually only every 24 hours or so.
de: Es mag vorkommen, dass eine Suche nach einem Zertifikat keine Treffer ergibt, auch wenn es gerade erst hochgeladen wurde. Dies erklärt sich dadurch, dass die meisten öffentlichen Schlüsselserver zur Verteilung der Last <acronym>DNS</acronym>-Ringverteilung nutzen. Diese Server synchronisieren sich untereinander, jedoch in der Regel nur etwa alle 24 Stunden.

source: <guimenu>File</guimenu><guimenuitem>Decrypt/Verify Files...</guimenuitem>
de: <guimenu>Datei</guimenu> <guimenuitem>Dateien entschlüsseln/überprüfen ...</guimenuitem>

source: <action>Decrypts files and/or verifies signatures</action> over files.
de: <action>Entschlüsselt Dateien und/oder überprüft</action> Signaturen von Dateien.

source: <guimenu>File</guimenu><guimenuitem>Sign/Encrypt Files...</guimenuitem>
de: <guimenu>Datei</guimenu> <guimenuitem>Dateien signieren/verschlüsseln ...</guimenuitem>

source: Signs and/or encrypts files.
de: Signiert und/oder verschlüsselt Dateien.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>W</keycap></keycombo></shortcut> <guimenu>File</guimenu><guimenuitem>Close</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>W</keycap></keycombo></shortcut> <guimenu>Datei</guimenu><guimenuitem>Schließen</guimenuitem>

source: <action>Closes &kleopatra;'s main window.</action> You can restore it from the system tray icon at any time.
de: <action>Schließt &kleopatra;s Hauptfenster.</action> Es kann jederzeit durch Klicken auf das Symbol in der Kontrollleiste wieder hergestellt werden.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo></shortcut> <guimenu>File</guimenu><guimenuitem>Quit</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo></shortcut> <guimenu>Datei</guimenu><guimenuitem>Beenden</guimenuitem>

source: Terminates &kleopatra;.
de: Beendet &kleopatra;.

source: View Menu
de: Das Menü Ansicht

source: <shortcut><keycombo action="simul"><keycap>F5</keycap></keycombo></shortcut> <guimenu>View</guimenu><guimenuitem>Redisplay</guimenuitem>
de: <shortcut><keycombo action="simul"><keycap>F5</keycap></keycombo> </shortcut><guimenu>Ansicht</guimenu> <guimenuitem>Aktualisieren</guimenuitem>

source: Refreshes the certificate list.
de: Aktualisiert die Zertifikatsliste.

source: Using this function is usually not necessary, as &kleopatra; monitors the file system for changes and automatically refreshes the certificate list when needed.
de: Diese Funktion ist im Normalfall nicht erforderlich, da &kleopatra; das Dateisystem überwacht und die Zertifikatsliste bei Bedarf automatisch aktualisiert.

source: <shortcut><keycombo action="simul">&Esc;</keycombo></shortcut> <guimenu>View</guimenu><guimenuitem>Stop Operation</guimenuitem>
de: <shortcut><keycombo action="simul">&Esc;</keycombo></shortcut> <guimenu>Ansicht</guimenu> <guimenuitem>Vorgang abbrechen</guimenuitem>

source: <action>Stops (cancels) all pending operations,</action> &eg; a search, keylisting, or a download.
de: <action>Bricht alle schwebenden Operationen ab,</action> etwa eine Suche, Anzeige einer Schlüsselliste oder ein Herunterladen.

source: This function is only available if at least one operation is active.
de: Diese Funktion steht nur zur Verfügung, wenn mindestens eine Operation ausgeführt wird.

source: Due to backend limitations, sometimes operations will hang in such a way that this function won't be able to cancel them, right away, or at all.
de: Es kann vorkommen, dass diese Funktion nicht in der Lage ist Operationen direkt abzubrechen, wenn überhaupt. Dies ist in Einschränkungen der Treiber begründet.

source: In such cases, the only way to restore order is to kill &scdaemon;, &dirmngr;, &gpgsm; and &gpg; processes, in that order, via the operating system tools (<command>top</command>, Task-Manager, &etc;), until the operation get unblocked.
de: Um unter diesen Umständen die Funktionsfähigkeit wiederherzustellen, müssen die Prozesse &scdaemon;, &dirmngr;, &gpgsm; und &gpg; (in dieser Reihenfolge) mit den Werkzeugen des Betriebssystems (<command>top</command>, Systemüberwachung &etc;) gestoppt werden, bis die Blockade der Operation aufgehoben ist.

source: <guimenu>View</guimenu><guimenuitem>Certificate Details</guimenuitem>
de: <guimenu>Ansicht</guimenu> <guimenuitem>Zertifikatsdetails</guimenuitem>

source: Shows the details of the currently selected certificate.
de: Zeigt die Details des derzeit ausgewählten Zertifikats an.

source: This function is only available if exactly one certificate is selected.
de: Diese Funktion steht nur zur Verfügung, wenn genau ein Zertifikat ausgewählt ist.

source: This function is also available by double-clicking the corresponding item in the list view directly.
de: Diese Funktion kann auch direkt durch Doppelklicken des entsprechenden Eintrags in der Zertifikatsliste aufgerufen werden.

source: <guimenu>View</guimenu><guimenuitem>Hierarchical Certificate List</guimenuitem>
de: <guimenu>Ansicht</guimenu> <guimenuitem>Hierarchische Zertifikatsliste</guimenuitem>

source: Toggles between hierarchical and flat certificate list mode.
de: Schaltet zwischen der hierarchischen und der flachen Anzeige der Zertifikatsliste um.

source: In hierarchical mode, certificates are arranged in issuer/subject relation, so it is easy to see which certification hierarchy a given certificate belongs to, but a given certificate is harder to find initially (though you can of course use the <link linkend="functions-search">search bar</link>).
de: Im hierarchischen Modus werden die Zertifikate nach Aussteller und Subjekt angeordnet, sodass man einfach sehen kann, zu welcher Zertifikationshierarchie ein bestimmtes Zertifikat gehört; ein bestimmtes Zertifikat kann aber anfangs schwerer zu finden sein (zum Suchen können Sie aber natürlich die <link linkend="functions-search">Suchleiste</link> verwenden).

source: In flat mode, all certificates are displayed in a flat list, sorted alphabetically. In this mode, a given certificate is easy to find, but it is not directly clear which root certificate it belongs to.
de: In der flachen Ansicht werden alle Zertifikate alphabetisch sortiert in einer flachen Liste angezeigt. In diesem Modus kann man ein bestimmtes Zertifikat leicht finden, aber es ist nicht direkt ersichtlich zu welchem Wurzel-Zertifikat es gehört.

source: This function toggles hierarchical mode per tab, &ie; each tab has its own hierarchy state. This is so that you can have both a flat and a hierarchical listing at hand, each in its own tab.
de: Diese Funktion wechselt zwischen der hierarchischen und flachen Ansicht auf einer Karteikarte, &ie; jede Karteikarte hat ihre eigene hierarchische Ansicht. Dies ermöglicht es zur gleichen Zeit sowohl eine hierarchische und eine flache Ansicht der gleichen Liste griffbereit zu haben.

source: Hierarchical display is currently only implemented for &smime; certificates. There is disagreement amongst the developers regarding the correct way to display &openpgp; certificates hierarchically (basically, <quote>parent &equals; signer</quote> or <quote>parent &equals; signee</quote>).
de: Derzeit steht die hierarchische Ansicht nur für &smime;-Zertifikate zur Verfügung. Es besteht noch Uneinigkeit unter den Entwicklern, wie die hierarchische Ansicht für &openpgp;-Zertifikate auszusehen hat (also: <quote>Elternelement &equals; Unterzeichner</quote> oder <quote>Elternelement &equals; Unterzeichneter</quote>).

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>.</keycap> </keycombo></shortcut><guimenu>View</guimenu><guimenuitem>Expand All</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>.</keycap> </keycombo></shortcut><guimenu>Ansicht</guimenu><guimenuitem>Alle aufklappen</guimenuitem>

source: <action>Expands all list items in the certificate list view,</action> &ie; makes all items visible.
de: <action>Klappt alle Listeneinträge in der Zertifikatsliste auf,</action> macht also die untergeordneten Einträge sichtbar.

source: This is the default when entering hierarchical keylist mode.
de: Dies ist die Standardeinstellung, wenn in die hierarchische Ansicht umgeschaltet wird.

source: You can still expand and collapse each individual item by itself, of course.
de: Natürlich können Sie auch weiterhin jeden Eintrag einzeln ein- und ausklappen.

source: This function is only available when <xref linkend="view-hierarchical-key-list"/> is on.
de: Diese Funktion steht nur zur Verfügung, wenn <xref linkend="view-hierarchical-key-list"/> aktiviert ist.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>,</keycap> </keycombo></shortcut><guimenu>View</guimenu><guimenuitem>Collapse All</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>,</keycap> </keycombo></shortcut><guimenu>Ansicht</guimenu> <guimenuitem>Alle einklappen</guimenuitem>

source: <action>Collapses all list items in the certificate list view,</action> &ie; hides all but the top-level items.
de: <action>Klappt alle Listeneinträge in der Zertifikatsliste ein,</action> macht also alle Einträge außer denen auf der obersten Ebene unsichtbar.

source: Certificates Menu
de: Das Menü Zertifikate

source: <guimenu>Certificates</guimenu><guimenuitem>Change Owner Trust...</guimenuitem>
de: <guimenu>Zertifikate</guimenu> <guimenuitem>Inhaber-Vertrauenswürdigkeit ändern ...</guimenuitem>

source: Changes the Owner Trust of the selected &openpgp; certificate.
de: Ändert die Vertrauenswürdigkeit des Inhabers des ausgewählten &openpgp;-Zertifikats.

source: This function is only available when exactly one &openpgp; certificate is selected.
de: Diese Funktion steht nur zur Verfügung, wenn genau ein &openpgp;-Zertifikat ausgewählt ist.

source: <guimenu>Certificates</guimenu><guimenuitem>Trust Root Certificate</guimenuitem>
de: <guimenu>Zertifikate</guimenu><guimenuitem>Wurzelzertifikat vertrauen</guimenuitem>

source: Marks this (&smime;) root certificate as trusted.
de: Markiert dieses (&smime;-)Wurzelzertifikat als vertrauenswürdig.

source: In some ways, this is the equivalent of <xref linkend="certificates-change-owner-trust"/> for &smime; root certificates. You can, however, only choose between&mdash;in &openpgp; terms&mdash;<quote>ultimate</quote> trust and <quote>never trust</quote>.
de: Gewissermaßen ist dies gleichbedeutend mit <xref linkend="certificates-change-owner-trust"/> für &smime;-Wurzelzertifikate. Allerdings können Sie nur zwischen &mdash; in &openpgp;-Begriffen gesprochen &mdash; <quote>uneingeschränktem</quote> Vertrauen und <quote>niemals vertrauen</quote> wählen.

source: The backend (by way of &gpgagent;) will ask at root certificate import time whether to trust the imported root certificate. However, that function must be explicitly enabled in the backend configuration (<option>allow-mark-trusted</option> in <filename>gpg-agent.conf</filename>, or either <menuchoice><guimenu>GnuPG&nbsp;System</guimenu> <guisubmenu>GPG&nbsp;Agent</guisubmenu> <guimenuitem>Allow clients to mark keys as "trusted"</guimenuitem></menuchoice> or <link linkend="configuration-smime-validation-allow-mark-trusted"><menuchoice><guimenu>S/MIME&nbsp;Validation</guimenu> <guimenuitem>Allow to mark root certificates as trusted</guimenuitem></menuchoice></link> under <xref linkend="configuration"/>).
de: Beim Import eines Wurzelzertifikats wird der Treiber (also &gpgagent;) fragen, ob dem importierten Wurzelzertifikat vertraut werden soll. Allerdings muss diese Funktion in den Treibereinstellungen ausdrücklich aktiviert werden (<option>allow-mark-trusted</option> in <filename>gpg-agent.conf</filename>, oder entweder <menuchoice><guimenu>GnuPG&nbsp;System</guimenu><guisubmenu>GPG&nbsp;Agent</guisubmenu><guimenuitem>Klienten erlauben Schlüssel als "vertrauenswürdig" zu markieren</guimenuitem></menuchoice> oder <link linkend="configuration-smime-validation-allow-mark-trusted"><menuchoice><guimenu>S/MIME&nbsp;Validierung</guimenu><guimenuitem>Erlauben, Wurzelzertifikate als vertrauenswürdig zu markieren</guimenuitem></menuchoice></link> in <xref linkend="configuration"/>).

source: Enabling that functionality in the backend can lead to popups from &pinentry; at inopportune times (&eg; when verifying signatures), and can thus block unattended email processing. For that reason, and because it is desirable to be able to <emphasis>distrust</emphasis> a trusted root certificate again, &kleopatra; allows manual setting of trust.
de: Diese Funktion in den Treibereinstellungen zu aktivieren kann zu sich öffnenden Fenstern durch &pinentry; zu unliebsamen Zeitpunkten führen (&eg; beim Überprüfen von Signaturen) und kann dadurch unbeaufsichtigte E-Mail-Bearbeitung blockieren. Aus diesem Grund und weil es wünschenswert sein kann einem vertrauten Wurzelzertifikat wieder zu <emphasis>misstrauen</emphasis>, erlaubt &kleopatra; das manuelle Setzen des Vertrauens.

source: Due to lack of backend support for this function, &kleopatra; needs to work directly on the &gpgsm; trust database (<filename>trustlist.txt</filename>). When using this function, make sure no other crypto operations are in progress that could race with &kleopatra; for modifications to that database.
de: Auf Grund von fehlender Treiberunterstützung dieser Funktion ist &kleopatra; gezwungen die &gpgsm;-Vertrauensdatenbank (<filename>trustlist.txt</filename>) direkt zu bearbeiten. Stellen Sie sicher, dass beim Verwenden dieser Funktion keine andere Kryptografieanwendung neben &kleopatra; Veränderungen an dieser Datenbank vornimmt.

source: This function is only available when exactly one &smime; root certificate is selected, and that certificate is not yet trusted.
de: Diese Funktion steht nur zur Verfügung, wenn genau ein &smime;-Wurzelzertifikat ausgewählt ist und das Zertifikat noch nicht vertrauenswürdig ist.

source: Use <xref linkend="certificates-distrust-root"/> to undo this function.
de: Benutzen Sie <xref linkend="certificates-distrust-root"/>, um diese Funktion wieder rückgängig zu machen.

source: <guimenu>Certificates</guimenu><guimenuitem>Distrust Root Certificate</guimenuitem>
de: <guimenu>Zertifikate</guimenu><guimenuitem>Wurzelzertifikat nicht vertrauen</guimenuitem>

source: Marks this (&smime;) root certificate as not trusted.
de: Markiert dieses (&smime;-)Wurzelzertifikat als nicht vertrauenswürdig.
