Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdepim/kmail_getting-started.po
Languages: de

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Matthias</firstname><surname>Kiefer</surname> <affiliation><address><email>matthias.kiefer@gmx.de</email></address></affiliation> <contrib>Deutsche Übersetzung</contrib></othercredit> <othercredit role="translator"><firstname>Alexander</firstname><surname>Gretencord</surname> <affiliation><address><email>arutha@gmx.de</email></address></affiliation> <contrib>Überarbeitung</contrib></othercredit> <othercredit role="translator"><firstname>Frank</firstname><surname>Schütte</surname> <affiliation><address><email>F.Schuette@t-online.de</email></address></affiliation> <contrib>Überarbeitung ab Version 1.3</contrib></othercredit><othercredit role="translator"><firstname>Matthias Kalle</firstname><surname>Dalheimer</surname> <affiliation><address><email>kalle@kdab.net</email></address></affiliation> <contrib>Krypto-Übersetzung</contrib></othercredit>

source: Getting Started
de: Erste Schritte

source: This is a short introduction to &kmail; and its usage so you can start working with it right away. For more in-depth information see the <link linkend="using-kmail">Using &kmail;</link> section. Note that &kmail;'s installation is described in <link linkend="installation">the appendix</link>.
de: Dieser Abschnitt ist eine kurze Einführung in &kmail; und seine Benutzung, sodass Sie gleich damit arbeiten können! Für weitergehende Informationen sehen Sie bitte im Abschnitt <link linkend="using-kmail">&kmail; benutzen</link> nach.

source: <title>Account Wizard</title>
de: <title>Zugangs-Assistent</title>

source: <screeninfo>Account Wizard</screeninfo>
de: <screeninfo>Zugangs-Assistent</screeninfo>

source: <phrase>Account Wizard</phrase>
de: <phrase>Zugangs-Assistent</phrase>

source: <para>Account Wizard</para>
de: <para>Zugangs-Assistent</para>

source: The first time you run &kmail; you will be greeted with the Account Wizard.
de: Beim erstmaligen Start von &kmail; wird der Dialog Postfach-Assistent angezeigt.

source: If at anytime you need to run the account wizard again, you can find it under <menuchoice><guimenu>Tools</guimenu><guimenuitem>Account Wizard</guimenuitem></menuchoice>.
de: Möchten Sie diesen Assistenten später nochmal benutzen, wählen Sie <menuchoice><guimenu>Extras</guimenu><guimenuitem>Postfach-Assistent</guimenuitem></menuchoice> aus dem Menü.

source: The wizard will take you through the process of creating your email accounts. Your screens will vary depending on how much the wizard can determine on its own. Below is an outline of the screens you may encounter while using this wizard.
de: Der Assistent unterstützt Sie bei der Erstellung Ihrer E-Mail-Postfächer. Abhängig von den Daten, die der Assistent ermitteln kann, werden die Dialog unterschiedlich aussehen. Im folgenden sehen Sie einen Überblick der Dialog, die Ihnen bei der Benutzung dieses Assistenten präsentiert werden.

source: <guilabel>Provide personal data</guilabel> is the first screen of the wizard. It will prompt you for your basic account information: <guilabel>Full name:</guilabel>, <guilabel>E-mail address</guilabel>, and <guilabel>Password:</guilabel>. By default, the <guilabel>Find provider settings on the Internet</guilabel> option is checked, the wizard will attempt to retrieve the necessary information from the server. Uncheck this option if you are an expert user and you need to set up advanced configuration. Click the <guibutton>Next</guibutton> button once finished.
de: <guilabel>Persönliche Daten angeben</guilabel> ist die erste Dialogseite des Assistenten. Hier geben Sie die Basisinformationen für Ihr Postfach ein: <guilabel>Vollständiger Name</guilabel>, <guilabel>E-Mail</guilabel> und <guilabel>Passwort</guilabel>. Es wird empfohlen, <guilabel>Anbieter-Einstellungen im Internet suchen</guilabel> zu aktivieren, damit der Assistent die benötigten Informationen vom Server abholen kann. Sind Sie ein erfahrener Benutzer und müssen eine schwierigere Einrichtung vornehmen, deaktivieren Sie diese Option. Klicken Sie auf <guibutton>Weiter</guibutton>, wenn alle Felder ausgefüllt ist.

source: If you use GMail 2-step verification you will need to generate an application-specific password within gmail security settings and enter that password in the password text box.
de: Verwender Sie die zweistufige Verifizierung in GMail, müssen Sie ein Passwort für die Anwendung in den Sicherheitseinstellungen von GMail generieren und dieses Passwort hier eingeben.

source: The <guilabel>Select Account Type</guilabel> screen will be next if the wizard cannot determine your account type. Select your account type from the list (if you do not know, you will need to contact your email provider). If your account type is not listed, click the <guibutton>Check for more on Internet</guibutton> button. Once your account type has been selected, click the <guibutton>Next</guibutton> button, and you will be presented with the <guilabel>Personal Settings</guilabel> screen.
de: Kann der Assistent die Art Ihres Postfachs nicht selbständig ermitteln, wird als nächstes der Dialog <guilabel>Art des Postfachs auswählen</guilabel> angezeigt. Wählen Sie einen Typ aus der Liste. Kennen Sie die Art des Postfachs nicht, müssen Sie diese Information bei Ihrem Anbieter erfragen. Wird Ihr Postfach nicht aufgeführt, klicken Sie auf <guibutton>Im Internet nach weiteren suchen</guibutton>. Haben Sie ein Postfach ausgewählt, klicken Sie auf <guibutton>Weiter</guibutton>. Dann erscheint der Dialog <guilabel>Persönliche Einstellungen</guilabel>.

source: The <guilabel>Provide personal data</guilabel> screen will show again with the server details it found if the wizard was successful at determining the account type. Click the <guibutton>Create Account</guibutton> button, and it will set up the account. Click the <guibutton>Finish</guibutton> to complete the wizard and close the window.
de: Die Dialogseite <guilabel>Persönliche Daten angeben</guilabel> zeigt wieder an, ob der Assistent die Art des Postfachs erfolgreich feststellen konnte. Klicken Sie dann auf <guibutton>Postfach erstellen</guibutton> und das Postfach wird eingerichtet. Klicken Sie den Knopf <guibutton>Fertigstellen</guibutton>, um den Assistenten und den Dialog zu schließen.

source: The <guilabel>Personal Settings</guilabel> screen will show if you had to enter your account type. Verify that your information is correct on this page. Select <guilabel>Download all messages for offline use</guilabel> if you want your messages available when you do not have an Internet connection (&imap; only). Click the <guibutton>Next</guibutton> button once finished.
de: Auf der Dialogseite <guilabel>Persönliche Daten angeben</guilabel> wird angezeigt, ob Sie die Art Ihres Postfachs eingeben müssen. Überprüfen Sie, ob alle Angaben auf dieser Seite korrekt sind. Wählen Sie <guilabel>Alle Nachrichten zur Offline-Verwendung herunterladen</guilabel>, wenn Sie Ihre Nachrichten auch ohne Internetverbindung bearbeiten möchten. Diese Einstellung ist nur für &imap;-Postfächer verfügbar. Klicken Sie auf <guibutton>Weiter</guibutton>, wenn Sie fertig sind.

source: Your account will then be set up, and you can click the <guibutton>Finish</guibutton> button to complete the wizard and close the window.
de: Ihr Postfach wird dann eingerichtet, klicken Sie den Knopf <guibutton>Fertigstellen</guibutton>, um den Assistenten und den Dialog zu schließen.

source: For manually creating accounts please continue reading the rest of this document.
de: Für das manuelle Erstellen von Postfächern lesen Sie bitte den nächsten Abschnitt im Dokument.

source: Manual Configuration Quickstart
de: Einführung zur manuellen Einrichtung

source: The Configure window consists of six sections: <guilabel>Identities</guilabel>, <guilabel>Accounts</guilabel>, <guilabel>Appearance</guilabel>, <guilabel>Composer</guilabel>, <guilabel>Security</guilabel>, and <guilabel>Misc</guilabel>.
de: Der Einstellungen-Dialog besteht aus sechs Karteikarten: <guilabel> Identitäten</guilabel>, <guilabel>Zugänge</guilabel>, <guilabel> Erscheinungsbild</guilabel>, <guilabel >E-Mail-Editor</guilabel>, <guilabel >Sicherheit</guilabel> und <guilabel >Diverses</guilabel>.

source: To begin sending and receiving messages you will only have to change some settings in the <guilabel>Identities</guilabel> and <guilabel>Accounts</guilabel> pages.
de: Um Nachrichten senden und empfangen zu können, müssen Sie nur einige Einstellungen auf den Seiten <guilabel >Identitäten</guilabel> und <guilabel>Zugänge</guilabel> ändern.

source: Setting your Identity
de: Einstellen Ihrer Identität

source: The settings in the <guilabel>Identities</guilabel> page are fairly straightforward. Select your default identity and click <guibutton>Modify</guibutton>. Fill in the <guilabel>Your name</guilabel> field with your full name (&eg; <userinput>John Doe</userinput>) and the <guilabel>Organization</guilabel> field (optional) with the appropriate information.
de: Die Einstellungen auf der <guilabel>Identitäten</guilabel>-Seite sind ziemlich einfach. Wählen Sie Ihre Standard-Identität aus und klicken Sie auf <guibutton>Ändern</guibutton>. Tragen Sie unter <guilabel>Ihr name</guilabel> Ihren vollständigen Namen (z.B. <userinput>Hans Mustermann</userinput>) und optional unter <guilabel>Organisation</guilabel> Ihre Organisation ein.

source: Next, fill in the <guilabel>Email address</guilabel> field with your email address (&eg; <userinput>john@example.net</userinput>).
de: Tragen Sie als nächstes unter <guilabel>E-Mail-Adresse</guilabel> Ihre E-Mail-Adresse ein (&eg; <userinput>hans@mustermann.de</userinput>).

source: If you are using <application>PGP</application> or <application>GnuPG</application> you can set your &openpgp; keys and/or &smime; certificates in the <link linkend="configure-identity-cryptography"><guilabel>Cryptography</guilabel></link> tab.
de: Wenn Sie <application>PGP</application> oder <application>GnuPG</application> verwenden, können Sie Ihre &openpgp;-Schlüssel und/oder &smime;-Zertifikate auf der Karteikarte <link linkend="configure-identity-cryptography"><guilabel>Kryptografie</guilabel></link> auswählen.

source: Optionally, go to the <guilabel>Signature</guilabel> tab and enter your signature. This is a short text that will be automatically appended to all your messages. It has nothing to do with <emphasis>digital signatures</emphasis>.
de: Optional können Sie auf der Karteikarte <guilabel>Signatur</guilabel> Ihre Signatur eintragen. Dies ist ein kurzer Text, der automatisch an all Ihre Nachrichten angehängt wird, und hat nichts mit <emphasis>digitalen Signaturen</emphasis> zu tun.

source: Setting up your Account
de: Einrichtung der Postfächer

source: The <guilabel>Accounts</guilabel> page contains the settings that tell &kmail; how to send and receive your email messages. Many of these settings can vary greatly depending on the setup of your system and on the kind of network that your mail server is located in. If you do not know what setting to choose or what to put in a field, consult your Internet Service Provider (<acronym>ISP</acronym>) or system administrator.
de: Die Seite <guilabel>Zugänge</guilabel> enthält die Festlegungen, wie &kmail; Ihre Nachrichten verschicken oder empfangen soll. Viele dieser Einstellungen hängen stark von Ihren System-Einstellungen ab sowie von der Art des Netzwerks, über das Sie Ihren Mail-Server erreichen. Falls Sie nicht wissen, welche Einstellungen Sie wählen sollen oder was Sie in ein Feld eintragen müssen, fragen Sie Ihren Internet Service Provider (<acronym>ISP</acronym>) oder Ihren Systemverwalter.

source: Sending Messages
de: Versenden von Nachrichten

source: The <guilabel>Sending</guilabel> tab provides a list of ways to send messages. The first item in the list is the default way to send messages. Using the <guibutton>Add...</guibutton> button you can choose between two different ways of sending messages: <guilabel>SMTP</guilabel> and <guilabel>Sendmail</guilabel>. &Sendmail; here means a local software installation -- this has a reputation of being difficult to set up, so if you do not already have a working &Sendmail; configuration, choose <guilabel>SMTP</guilabel> and fill in the <guilabel>Name</guilabel> field with a descriptive name (&eg; <userinput>My Mail Account</userinput>). Click the <guibutton>Create and Configure</guibutton> and fill the <guilabel>Outgoing mail server</guilabel> field with the name and domain of your mail server (&eg; <userinput>smtp.provider.com</userinput>). You will probably not need to change the <guilabel>Port</guilabel> setting (the default is <userinput>25</userinput>).
de: Die Karteikarte <guilabel>Versand</guilabel> stellt eine Anzahl von Möglichkeiten zum Versand von Nachrichten bereit. Der erste Listeneintrag ist die Standardmethode des Nachrichtenversandes. Mit dem Knopf <guibutton>Hinzufügen ...</guibutton> kann man zwischen zwei verschiedenen Methoden des Versands wählen, nämlich <guilabel>SMTP</guilabel> und <guilabel>Sendmail</guilabel>. Dabei bezieht sich &Sendmail; auf eine lokale Installation - dieses Programm hat den Ruf, schwierig zu konfigurieren zu sein, falls man also nicht bereits eine funktionierende Konfiguration für &Sendmail; hat, sollte man hier <guilabel>SMTP</guilabel> wählen und das Feld <guilabel>Name</guilabel> mit einem beschreibenden Namen ausfüllen (&eg; <userinput>Mein E-Mail-Konto</userinput>). Klicken Sie auf <guibutton>Erstellen und einrichten</guibutton> und geben in das Feld <guilabel>Ausgehender Mailserver</guilabel> den Namen und die Domäne des Mailservers (z.B. <userinput>smtp.provider.com</userinput>). Die Einstellung des Feldes <guilabel>Port</guilabel> muss selten geändert werden (Standardwert: <userinput>25</userinput>).

source: If you do want to use &Sendmail; and you are using a dial-up connection, follow the instructions for setting up sendmail for a dial-up connection in the <link linkend="faq">&FAQ;</link> section.
de: Falls Sie <application>sendmail</application> benutzen wollen und eine Wählverbindung verwenden, folgen Sie den Anweisungen zum Einrichten von sendmail für eine Wählverbindung im Abschnitt <link linkend="faq">FAQ</link>.

source: The way of sending messages configured here will be used for your default identity and for all other identities that do not have their own way of sending messages. You can use different ways of sending messages for different identities by selecting the <guilabel>Outgoing Account</guilabel> check box in the <guilabel>Advanced</guilabel> tab of the <guilabel>Identities</guilabel> page.
de: Die hier eingestellte Versandart wird für die Standard-Identität und alle die Identitäten verwendet, für die keine eigene Versandart angegeben wurde. Man kann für verschiedene Identitäten unterschiedliche Arten für den Nachrichtenversand durch Markieren von <guilabel>Versand-Zugang</guilabel> in der Karteikarte <guilabel>Erweitert</guilabel> auf der Seite <guilabel>Identitäten</guilabel> bestimmen.

source: A description of the other options can be found in the <link linkend="configure-accounts-sending">Configuration</link> chapter.
de: Eine Beschreibung der weiteren Einstellmöglichkeiten befindet sich im Kapitel <link linkend="configure-accounts-sending">Einrichtung</link>.

source: Options relevant to <acronym>Kolab</acronym> server
de: Optionen, die nur den <acronym>Kolab</acronym>-Server betreffen

source: When configuring an <guilabel>SMTP</guilabel> account with a <guilabel>Kolab</guilabel> server Host, you need to check the <guilabel>Server requires authentication</guilabel> option and to fill in your <guilabel>Kolab</guilabel> user's email address and password in the <guilabel>Login</guilabel> and <guilabel>Password</guilabel> fields. Then select the <guilabel>Security</guilabel> tab and click on the <guibutton>Check What the Server Supports</guibutton> for automated setup of your <guilabel>Security</guilabel> configuration. The default should be <guilabel>TLS/PLAIN</guilabel>. The <guilabel>Kolab</guilabel> server supports <guilabel>SSL/PLAIN</guilabel> as well. These settings may of course be configured manually.
de: Wenn Sie ein <acronym>SMTP</acronym>-Konto mit einem <guilabel>Kolab</guilabel>-Server als Host konfigurieren, dann müssen Sie die Option <guilabel>Server verlangt Authentifizierung</guilabel> ankreuzen und Ihren <guilabel>Kolab</guilabel>-Benutzernamen und -Passwort in die Felder <guilabel>Benutzername</guilabel> und <guilabel>Passwort</guilabel> eintragen. Wechseln Sie zur Seite <guilabel>Sicherheit</guilabel> und klicken Sie auf <guibutton>Fähigkeiten des Servers überprüfen</guibutton>, um automatisch die passende Sicherheitskonfiguration zu wählen. Die Voreinstellung sollte <guilabel>TLS/PLAIN</guilabel> sein. Der <guilabel>Kolab</guilabel>-Server unterstützt auch <guilabel>SSL/PLAIN</guilabel>. Diese Einstellungen können natürlich auch manuell konfiguriert werden.

source: Receiving Messages
de: Empfang von Nachrichten

source: To set up an account so you can receive mail, press the <guibutton>Add...</guibutton> button in the <guilabel>Receiving</guilabel> tab. You will then be prompted for the type of your email account. Most users should select <guilabel>POP3</guilabel> or <guilabel>IMAP E-Mail Server</guilabel>. If you want to use a local mailbox file, please see the <link linkend="faq-file-locking">FAQ about file locking</link>.
de: Um einen Zugang für den Empfang von E-Mail einzurichten, klickt man <guibutton>Hinzufügen...</guibutton> auf der Karteikarte <guilabel>Empfang</guilabel>. Man hat die Wahl, welche Zugangsart man einstellen möchte. In den meisten Fällen ist das entweder <guilabel>POP3</guilabel> oder <guilabel>IMAP-E-Mail-Server</guilabel>. Falls man ein lokales Postfach verwenden möchte findet man wichtige Informationen unter <link linkend="faq-file-locking">FAQ über das Sperren von Dateien</link>.

source: You will then be presented with the <guilabel>Akonadi Resource</guilabel> window. First, fill in the <guilabel>Account name</guilabel> field to name your account. You can choose any name you like. <guilabel>Username</guilabel>, <guilabel>Password</guilabel>, and <guilabel>Incoming mail server</guilabel> should be filled in with the appropriate information from your <acronym>ISP</acronym> or system administrator. You should not need to change the <guilabel>Port</guilabel> setting (the default for POP3 is <userinput>110</userinput>, the default for <acronym>IMAP</acronym> is <userinput>143</userinput>).
de: Es erscheint der Dialog <guilabel>Akonadi-Ressource</guilabel>. Geben Sie zuerst einen Namen für das Postfach im Feld <guilabel >Postfachname</guilabel> an. In die Felder <guilabel >Benutzername</guilabel>, <guilabel >Passwort</guilabel> und <guilabel>Eingangs-Mailserver</guilabel> muss man die entsprechenden Informationen eingeben, die man vom eigenen Internet-Anbieter (ISP) oder vom Systemverwalter erhalten haben sollte. Wieder sollte es nicht nötig sein, die Einstellung von <guilabel>Port</guilabel> zu ändern (der Standard für POP3 ist <userinput>110</userinput>, der Standard für <acronym>IMAP</acronym> ist <userinput>143</userinput>).

source: Select <guilabel>Disconnected IMAP</guilabel> when choosing your <guilabel>Account Type</guilabel>. Fill in the <guilabel>Login</guilabel> and <guilabel>Password</guilabel> fields with respectively your user email address and password on the <guilabel>Kolab</guilabel> server. In the <guilabel>Security</guilabel> section click on the <guilabel>Check What the Server Supports</guilabel> button for automated set-up of your <guilabel>Security</guilabel> configuration. The default should be <guilabel>TLS/PLAIN</guilabel>. The <guilabel>Kolab</guilabel> server supports <guilabel>SSL/PLAIN</guilabel> as well. These settings may of course be configured manually.
de: Wählen Sie <guilabel>Disconnected IMAP</guilabel> als <guilabel>Postfachtyp</guilabel>. Tragen Sie in den Feldern <guilabel>Benutzer</guilabel> und <guilabel>Passwort</guilabel> Ihre E-Mail-Adresse und das Passwort auf dem <guilabel>Kolab</guilabel>-Server ein. Im Abschnitt <guilabel>Sicherheit</guilabel> klicken Sie auf <guilabel>Fähigkeiten des Servers testen</guilabel>, um Ihre Sicherheitskonfiguration automatisch einzurichten. Der Standard sollte <guilabel>TLS/PLAIN</guilabel> sein. Der <guilabel>Kolab</guilabel>-Server unterstützt auch <guilabel>SSL/PLAIN</guilabel>. Diese Einstellungen können natürlich auch manuell konfiguriert werden.

source: If you want to use the <guilabel>"Out of Office" Replies</guilabel> functionality of the <guilabel>Kolab</guilabel> server, set-up the <guilabel>Filtering</guilabel> section of you <guilabel>DIMAP</guilabel> account by checking the <guilabel>Server supports Sieve</guilabel> option as well as <guilabel>Reuse host and login configuration</guilabel>, <guilabel>Managesieve port</guilabel> should be set to 2000 as default.
de: Wenn Sie die <guilabel>Antworten bei Abwesenheit</guilabel> des Kolab-Servers verwenden wollen, dann richten Sie den <guilabel>Filtern</guilabel>-Abschnitt Ihres <guilabel>DIMAP</guilabel>-Kontos durch Anwählen der Option <guilabel>Server unterstützt Sieve</guilabel> sowie von <guilabel>Rechner- und Anmeldekonfiguration wiederverwenden</guilabel> ein. <guilabel>"Sieve"-Verwaltungsport:</guilabel> sollte auf 2000 gesetzt sein.

source: Options only relevant to DIMAP (<acronym>Kolab</acronym> server)
de: Optionen, die nur <acronym>DIMAP</acronym> (Kolab-Server) betreffen

source: After having configured your <guilabel>Disconnect IMAP</guilabel> account, you need to activate the <guilabel>Groupware</guilabel> functionalities and set-up the <guilabel>Misc</guilabel> page for <guilabel>KMail</guilabel>.
de: Nachdem Sie Ihr <guilabel>Disconnected IMAP</guilabel>-Konto konfiguriert haben, müssen Sie die <guilabel>Groupware</guilabel>-Funktionalität aktivieren und die <guilabel>Diverses</guilabel>-Seite von KMail einrichten.

source: In the <guilabel>Misc</guilabel> page, of the <guilabel>Configure</guilabel> dialog, choose the <guilabel>Groupware</guilabel> tab. Check the <guilabel>Enable IMAP resource functionality</guilabel> option and select <guilabel>Kolab (XML)</guilabel> as <guilabel>Format used for the groupware folders</guilabel>. The <guilabel>Resource folders are in account</guilabel> combo-box should be set on the <guilabel>Receiving</guilabel> (kolab user) account of your choice (if you happen to have several accounts). You may if you wish hide the groupware folder by checking this option. It is recommended to check both <guilabel>Groupware Compatibility and Legacy Options</guilabel> for compatibility with an eventual <guilabel>Kolab</guilabel> Microsoft Outlook client for sending invitations and replies from a <guilabel>Kolab</guilabel> KDE client.
de: Auf der <guilabel>Diverses</guilabel>-Seite des Konfigurationsdialogs wählen Sie die Unterseite <guilabel>Groupware</guilabel> aus. Wählen Sie hier die Option <guilabel>Funktionen für IMAP-Ressourcen aktivieren</guilabel> an sowie <guilabel>Kolab (XML)</guilabel> als <guilabel>Format der Groupware-Ordner</guilabel> aus. Das Ausklappmenü <guilabel>Ressource-Ordner gehören zu Konto</guilabel> sollte auf das eingehende Konto Ihrer Wahl gesetzt sein (sofern Sie mehrere Konten haben). Sie können auf Wunsch die Groupware-Ordner ausblenden. Wenn Sie Einladungen oder Antworten auf Einladungen an Benutzer von Microsoft Outlook(tm) verschicken wollen, dann wählen Sie die entsprechenden Optionen unter <guilabel>Kompatibilitätseinstellungen für Arbeitsgruppen</guilabel> ebenfalls an.

source: Options only relevant to <acronym>IMAP</acronym>
de: Optionen, die nur <acronym>IMAP</acronym> betreffen
