Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdepim/kmail_using-kmail.po
Languages: de

source: Using the first row of check boxes, you can toggle when the filter is applied: the <guilabel>Apply this filter to incoming messages</guilabel> option means that the filter is applied to messages when you receive them (&ie; on <guiicon>Check Mail</guiicon>). The filter can be applied to all messages, to all but online IMAP accounts and to a selection of incoming folders.
de: Mit Hilfe der ersten Zeile von Ankreuzfeldern können Sie auswählen, auf welche Nachrichten der entsprechende Filter angewandt wird. Eine Markierung bei <guilabel>Diesen Filter auf eingehende Nachrichten anwenden</guilabel> zeigt, dass der Filter auf gerade ankommende Nachrichten angewandt werden soll (also bei Aufruf von <guiicon>Nach E-Mail sehen</guiicon>). Der Filter kann auf alle Nachrichten angewendet werden, außer für Online-IMAP-Konten und für eine Auswahl von eingehenden Ordnern.

source: The <guilabel>Apply this filter to sent messages</guilabel> option means that the filter is applied to messages when you send them and the <guilabel>Apply this filter on manual filtering</guilabel> option controls whether to apply this filter when filtering is specifically selected (&ie; via <menuchoice><guimenu>Message</guimenu> <guimenuitem>Apply Filters</guimenuitem></menuchoice>.)
de: Eine Auswahl von <guilabel>Diesen Filter auf gesendete Nachrichten anwenden</guilabel> gilt entsprechend für gesendete Nachrichten ( genauer gesagt: <emphasis>nach</emphasis> dem <guiicon>Senden</guiicon>), und eine Markierung bei <guilabel>Diesen Filter bei manueller Filterung anwenden</guilabel> zeigt, ob dieser Filter bei manueller Filterung (also über <menuchoice><guimenu>Nachricht</guimenu> <guimenuitem>Filter anwenden</guimenuitem></menuchoice>) benutzt werden soll.

source: If <guilabel>Apply this filter to sent messages</guilabel> is checked the filter will be triggered <emphasis>after</emphasis> the message is sent and it will only affect the local copy of the message. If the recipient's copy also needs to be modified, please use <guilabel>Apply this filter before sending messages</guilabel>.
de: Wenn <guilabel>Diesen Filter auf gesendete Nachrichten anwenden</guilabel> aktiviert ist, wird der Filter angewendet, <emphasis>nachdem</emphasis> die Nachricht gesendet wurde und er beeinflusst nur die lokale Kopie der Nachricht. Falls die Ausfertigung für den Empfänger auch modifiziert werden soll, so verwenden Sie bitte <guilabel>Diesen Filter vor dem Senden von Nachrichten anwenden</guilabel>.

source: The <guilabel>If this filter matches, stop processing here</guilabel> check box controls whether or not the filters after the current filter will be applied, if the current filter matches.
de: Das Ankreuzfeld <guilabel>Bearbeitung hier beenden, falls Filterbedingung zutrifft</guilabel> bestimmt, ob weitere Filter nach dem aktuellen Filter angewendet werden, falls der aktuelle Filter schon auf die Nachricht zutrifft.

source: If the <guilabel>Add this filter to the Apply Filter menu</guilabel> check box is selected, this filter will be inserted in the <menuchoice><guimenu>Message</guimenu> <guimenuitem>Apply Filter</guimenuitem></menuchoice> submenu. You can then apply this filter to a message. Another way of applying filters is to use <menuchoice><guimenu>Message</guimenu> <guimenuitem>Apply Filters</guimenuitem></menuchoice> menu option, which applies <emphasis>all</emphasis> the filters - one after another until they are all used or one of the filters that matches has the <guilabel>If the filters matches, stop processing here</guilabel>.
de: Wenn das Ankreuzfeld <guilabel>Diesen Filter zum Menü "Filteraktionen anwenden" hinzufügen</guilabel> angekreuzt ist, dann wird dieser Filter in das Untermenü <menuchoice><guimenu>Nachricht</guimenu> <guimenuitem>Filter anwenden</guimenuitem></menuchoice> eingefügt. Sie können diesen Filter dann auf eine Nachricht anwenden. Eine andere Möglichkeit, Filter anzuwenden, besteht darin, den Menüpunkt <menuchoice><guimenu>Nachricht</guimenu> <guimenuitem>Filter anwenden</guimenuitem></menuchoice> zu benutzen. Dieser wendet <emphasis>alle</emphasis> Filter einen nach dem anderen an, bis entweder alle benutzt worden sind, oder einer der Filter zutraf, bei denen <guilabel>Wenn der Filter zutrifft, Verarbeitung hier abbrechen</guilabel>.

source: Filters are automatically named unless you explicitly rename them using the <guibutton>Rename...</guibutton> button. The dialog assumes that it should continue auto-naming the filter as long as the filter name starts with <quote>&lt;</quote>.
de: Filter werden automatisch benannt, wenn man sie nicht explizit durch Klicken auf den Knopf <guibutton>Umbenennen</guibutton> benennt. Der Dialog nimmt an, das die automatische Benennung verwendet werden soll, solange der Filtername mit <quote>&lt;</quote> beginnt.

source: If you apply filter changes, via <guibutton>OK</guibutton> or <guibutton>Apply</guibutton>, only valid filters are actually copied to the internal filter manager.
de: Klickt man auf <guibutton>OK</guibutton> oder <guibutton>Anwenden</guibutton>, werden nur gültige Filter in den internen Filter-Manager übernommen.

source: Similarly, empty rules and actions are removed from the pattern and action list respectively, before the filter is saved.
de: Genauso werden leere Regeln und Aktionen von der Liste der Filterbedingungen und Aktionen entfernt, bevor der Filter gespeichert wird.

source: Search Patterns
de: Filterbedingungen

source: The most common use of filters is to filter on the sender of messages; this can be done by choosing <guilabel>From</guilabel>. A good bet for a mailing list would be <guilabel>&lt;recipients&gt;</guilabel>, but there are other criteria a filter can search for (note that all patterns are interpreted case-insensitively):
de: Die häufigste Verwendung von Filtern stellen Filter nach dem Absender der Nachricht dar. Das kann durch Auswahl von <guilabel>From</guilabel> erreicht werden. Für eine Mailingliste könnte man <guilabel>&lt;Empfänger&gt;</guilabel> verwenden. Es gibt aber auch andere Kriterien für Filter. Hinweis: Alle Suchkriterien machen keinen Unterschied zwischen Groß- und Kleinschreibung:

source: &lt;message&gt;
de: &lt;Nachricht&gt;

source: Searches the whole message (&ie; headers, body and attachments, if any);
de: Durchsucht die gesamte Nachricht (also Vorspann, Nachricht und Anhänge, falls vorhanden).

source: &lt;body&gt;
de: &lt;Nachrichtentext&gt;

source: Searches the body of the message (&ie; the whole message except the headers);
de: Durchsucht den Nachrichtentext (also die gesamte Nachricht außer dem Vorspann).

source: &lt;any header&gt;
de: &lt;Feld im Vorspann&gt;

source: Searches the headers of the message;
de: Durchsucht den Vorspann der Nachricht.

source: &lt;recipients&gt;
de: &lt;Empfänger&gt;

source: Searches the <quote>To</quote> and <quote>CC</quote> header fields of the message;
de: Durchsucht die Vorspannfelder <quote>An</quote> und <quote>Kopie</quote>.

source: &lt;size in bytes&gt;
de: &lt;Größe in Byte&gt;

source: Sets upper or lower bounds on the message size;
de: Setzt eine Unter- und Obergröße für die Nachricht fest.

source: &lt;age in days&gt;
de: &lt;Alter in Tagen&gt;

source: Sets upper or lower bounds on the message age;
de: Setzt obere und untere Grenze für das Alter einer Nachricht.

source: Sets restrictions on the status of the message;
de: Legt Einschränkungen für den Status der Nachricht fest.

source: Any other name
de: Irgendein anderer Name

source: Searches the header field that is given by that name.
de: Durchsucht des Vorspann-Feld, das durch diesen Namen angegeben ist.

source: The list of possible rules depends on what you selected in the first drop down box. The available rules are:
de: Die Liste der möglichen Regeln ist davon abhängig, was Sie im ersten Ausklappmenü ausgewählt haben. Die folgenden Regeln stehen zur Verfügung:

source: Rule
de: Regel

source: Available for
de: Verfügbar für

source: Description
de: Beschreibung

source: <guilabel>contains</guilabel>/<guilabel>does not contain</guilabel>
de: <guilabel>enthält</guilabel>/<guilabel>enthält nicht</guilabel>

source: all textual search items
de: alle Text-Suchelemente

source: Matches if the searched item contains (or does not contain) the given text.
de: Trifft zu, wenn das durchsuchte Element den angegebenen Text (nicht) enthält.

source: <guilabel>equals</guilabel>/<guilabel>does not equal</guilabel>
de: <guilabel>ist gleich</guilabel>/<guilabel>ist ungleich</guilabel>

source: most textual search items
de: die meisten Text-Suchelemente

source: Matches if the searched item is equal to (or not equal to) the given text.
de: Trifft zu, wenn das durchsuchte Element (un-)gleich dem angegebenen Text ist.

source: <guilabel>matches regular expr.</guilabel>/<guilabel>does not match reg. expr.</guilabel>
de: <guilabel>passt auf regulären Ausdruck</guilabel>/<guilabel>passt nicht auf regulären Ausdruck</guilabel>

source: Matches if a part of the searched item matches the given regular expression (or does not match it). If the regular expression editor is installed then you can edit the regular expression by clicking on the <guilabel>Edit...</guilabel> button.
de: Passt, wenn ein Teil des durchsuchten Elements (nicht) auf den angegebenen regulären Ausdruck passt. Wenn der Editor für reguläre Ausdrücke installiert ist, dann können Sie den regulären Ausdruck durch Anklicken der Schaltfläche <guilabel>Editieren ...</guilabel> damit editieren.

source: <guilabel>has an attachment</guilabel>/<guilabel>has no attachment</guilabel>
de: <guilabel>hat einen Anhang</guilabel>/<guilabel>hat keinen Anhang</guilabel>

source: Matches if the message has an attachment (or does not have an attachment).
de: Trifft zu, wenn die Nachricht (k)einen Anhang hat.

source: <guilabel>is in address book</guilabel>/<guilabel>is not in address book</guilabel>
de: <guilabel>ist im Adressbuch</guilabel>/<guilabel>ist nicht im Adressbuch</guilabel>

source: Matches if the searched item contains an address that is in your address book (or if the searched items contains only unknown addresses). Of course, this rule only makes sense for address fields like From or <guilabel>&lt;recipients&gt;</guilabel>
de: Passt, wenn das durchsuchte Element eine Adresse enthält, die sich in Ihrem Adressbuch befindet (wenn die durchsuchten Elemente nur unbekannte Adressen enthalten). Diese Regel ist natürlich nur sinnvoll bei Adressfelder wie Von oder <guilabel>&lt;Empfänger&gt;</guilabel>

source: <guilabel>is in category</guilabel>/<guilabel>is not in category</guilabel>
de: <guilabel>ist in Kategorie</guilabel>/<guilabel>ist nicht in Kategorie</guilabel>

source: Matches if the searched item contains an address that is in the specified category in your address book (or if the searched item contains no address that is in the specified category). Again, this rule only makes sense for address fields.
de: Trifft zu, wenn das durchsuchte Element eine Adresse enthält, die zur angegebenen Kategorie in Ihrem Adressbuch gehört (oder wenn das durchsuchte Element keine Adresse in der angegebenen Kategorie enthält). Auch diese Regel ist natürlich nur bei Adressfeldern sinnvoll.

source: <guilabel>is equal to</guilabel>/<guilabel>is not equal to</guilabel>
de: <guilabel>ist gleich mit</guilabel>/<guilabel>ist nicht gleich mit</guilabel>

source: numerical search items
de: numerische Suchelemente

source: Matches if the value of the search item is equal to (or not equal to) the specified value.
de: Trifft zu, wenn der Wert des Suchelements (un)gleich dem angegebenen Wert ist.

source: is less than
de: ist kleiner als

source: Matches if the value of the search item is less than the specified value.
de: Trifft zu, wenn der Wert des Suchelements kleiner als der angegebene Wert ist.

source: is greater than
de: ist größer als

source: Matches if the value of the search item is greater than the specified value.
de: Trifft zu, wenn der Wert des Suchelements größer als der angegebene Wert ist.

source: is less than or equal to
de: ist kleiner als oder gleich

source: Matches if the value of the search item is less than or equal to the specified value.
de: Trifft zu, wenn der Wert des Suchelements kleiner oder gleich dem angegebenen Wert ist.

source: is greater than or equal to
de: ist größer oder gleich

source: Matches if the value of the search item is greater than or equal to the specified value.
de: Trifft zu, wenn der Wert des Suchelements größer oder gleich dem angegebenen Wert ist.

source: <guilabel>is</guilabel>/<guilabel>is not</guilabel>
de: <guilabel>ist</guilabel>/<guilabel>ist nicht</guilabel>

source: Matches if the message has (or does not have) the specified status.
de: Trifft zu, wenn die Nachricht den angegebenen Status (nicht) hat.

source: Filter Action
de: Filter Aktion

source: The most common use of filters is to sort incoming messages to certain folders; this can be done by choosing <guilabel>Move into Folder</guilabel>. Here is a list of all possible actions:
de: Die häufigste Anwendung für Filter ist das Sortieren von eingehenden Nachrichten in verschiedene Eingangsordner. Das kann durch <guilabel>In Ordner verschieben</guilabel> erreicht werden. Folgende Aktionen sind möglich:

source: Move Into Folder
de: In Ordner verschieben

source: This will file the message into another folder, removing it from its current folder if necessary; you cannot, currently use &imap; folders as a target.
de: Legt die Nachrichten in einen anderem Ordner ab und entfernt sie dazu, wenn nötig, aus dem aktuellen Ordner. Sie können derzeit keine &imap;-Ordner als Ziel benutzen.

source: Copy Into Folder
de: In Ordner kopieren

source: This will copy the message to another folder.
de: Kopiert die Nachricht in einen anderen Ordner.

source: You currently cannot use &imap; folders as a target.
de: &imap;-Ordner können derzeit nicht als Ziel angegeben werden.

source: Set Identity To
de: Identität setzen auf

source: This will set the identity that will be used if you reply to this message.
de: Diese Aktion setzt <emphasis>Ihre</emphasis> Identität für die Antwort auf diese Nachricht fest.

source: Mark As
de: Markieren als

source: This allows you to mark the message as read or important (flagged), but also as forwarded, replied, &etc;
de: Dies erlaubt es, eine Nachricht als gelesen oder wichtig (markiert) aber auch als weitergeleitet, beantwortet &etc; zu kennzeichnen.

source: Send Fake MDN
de: Fingierte Empfangsbestätigung senden

source: This will send a faked message disposition notification (&ie; a read receipt) to the sender of the message.
de: Verschickt eine falsche Zustellbenachrichtigung (&ie; eine Lesebestätigung) an den Absender der Nachricht.

source: Set Transport To
de: Versandart setzen auf

source: This will set the method of transport (&eg; &SMTP;) that will be used if you reply to the message.
de: Diese Aktion setzt die Versandart (&eg; &SMTP;) für die Antwort auf diese Nachricht fest.

source: Set Reply-To To
de: Antwortadresse setzen auf

source: This will modify the <guilabel>Reply-To</guilabel> field of this message. This can be useful for mailing lists that automatically set a Reply-To which you do not like.
de: Diese Aktion ändert das Feld <guilabel>Antwortadresse</guilabel> dieser Nachricht. Das kann für eine Mailingliste sinnvoll sein, da diese automatisch eine Antwortadresse einsetzen, die Sie möglicherweise nicht verwenden wollen.

source: Forward To
de: Weiterleiten an

source: This will forward the message inline (&ie; as if you selected <menuchoice><guimenu>Message</guimenu><guimenuitem>Forward</guimenuitem><guimenuitem>Inline...</guimenuitem></menuchoice>) to another email address. You can select the template to be used when forwarding with this filter with the drop down list.
de: Leitet die Nachricht im Text (&ie; als wenn Sie <menuchoice><guimenu>Nachricht</guimenu><guimenuitem>Weiterleiten</guimenuitem> <guimenuitem>Im Text ...</guimenuitem></menuchoice> ausgewählt hätten) an eine andere Adresse weiter. Die mit diesem Filter zur Weiterleitung benutzte Vorlage können im Auswahlfeld einstellen.

source: Redirect To
de: Umleiten nach

source: This will redirect the message as-is to another email address.
de: Leitet die Nachricht unverändert an eine andere E-Mail-Adresse um.

source: Confirm Delivery
de: Zustellung bestätigen

source: Will try to return a message to the sender that indicates successful delivery of their message, if the sender requested that.
de: Versucht eine Nachricht zum Absender zurückzusenden, um ihn zu benachrichtigen, dass die Mail angekommen ist, falls dieser eine solche angefordert hat.

source: This action allows you to select who will get delivery receipts from you. Though you can globally enable the sending of delivery confirmations in the <guilabel>Configure &kmail;...</guilabel> dialog (<link linkend="configure-security"><guilabel>Security</guilabel> page</link>) we recommended not to send them to everyone, since this makes tracking of spam messages, for example, very easy for the sender.
de: Mit dieser Aktion kann ausgewählt werden, wer von Ihnen eine Zustellungsbestätigung erhält. Obwohl man den Versand einer Zustellungsbestätigung im Dialog <guilabel>&kmail; einrichten ...</guilabel> (Karteikarte <link linkend="configure-security"><guilabel>Sicherheit</guilabel></link>) global aktivieren kann, ist es empfehlenswert, nicht jedem eine solche Bestätigung zu senden, da ansonsten Versender von Werbepost eine leichte Kontrolle haben.

source: Execute Command
de: Befehl ausführen

source: This will execute a program, but will not modify the message. Specify the full path to the program you want to execute; &kmail; will then block until the program returns. If you do not want &kmail; to block then append '&amp;' to the command. You can feed the program with the parts of the mail: <symbol>&percnt;0</symbol>, <symbol>&percnt;1</symbol>, &etc; stand for files representing the message parts; for common messages <symbol>&percnt;0</symbol> is the text, <symbol>&percnt;1</symbol> the first attachment and so on. Additionally, the whole message is fed into the program's <acronym>stdin</acronym>; and every occurrence of <symbol>&percnt;{foo}</symbol> is replaced by the content of the foo header. If you need to identify the message via its storage location in the Akonadi store, you can use the %{itemid} or %{itemurl} placeholders to achieve that.
de: Führt ein Programm aus, verändert aber nicht die Nachricht. Der vollständige Pfad zum Programm muss angegeben werden. &kmail; wird bis zum Beenden dieses Programms blockiert. Wenn &kmail; nicht blockiert werden soll, hängen Sie <quote>&amp;</quote> an den Befehl an. Sie können Nachrichtenteile an das Programm übergeben übergeben: <symbol>&percnt;0</symbol>, <symbol>&percnt;1</symbol> &etc; stehen für Dateien, die die Nachrichtenteile repräsentieren. Für übliche Nachrichten steht <symbol>&percnt;0</symbol> für den Nachrichtentext, <symbol>&percnt;1</symbol> für den ersten Anhang &etc; Zusätzlich wird die gesamte Nachricht über die Standardeingabe <acronym>stdin</acronym> an das Programm übergeben. Jedes Vorkommen von <symbol>&percnt;{irgendwas}</symbol> wird durch den Inhalt des gleichnamigen Vorspannfeldes ersetzt. Wenn Sie die Nachricht über den Speicherort in Akonadi identifizieren müssen, verwenden Sie dazu die Platzhalter %{itemid} und %{itemurl}.

source: This currently only works if the message has <emphasis>at least one</emphasis> attachment. No, not even <symbol>&percnt;0</symbol> will work in the general case!
de: Das funktioniert bisher nur für Nachrichten, die <emphasis>mindestens</emphasis> einen Anhang haben. Nicht einmal <symbol>&percnt;0</symbol> funktioniert ansonsten!

source: You can enter arbitrarily-complex shell commands here, since &kmail; uses a sub shell to execute the command line; therefore, even this command will work (within its limits): <userinput><command>uudecode</command> <option>-o</option> <parameter>$(mktemp kmail-uudecoded.XXXXXX)</parameter> &amp;&amp; <command>echo</command> <parameter>$'\a'</parameter></userinput>
de: Man kann hier beliebig komplexe Shell-Befehle verwenden, da &kmail; diese in einer Subshell ausführt. Daher funktioniert sogar (mit Einschränkungen) dieser Befehl: <userinput><command>uudecode</command> <option>-o</option> <parameter>$(mktemp kmail-uudecoded.XXXXXX)</parameter> &amp;&amp; <command>echo</command> <parameter>$'\a'</parameter></userinput>

source: Pipe Through
de: Durch Programm leiten

source: This will feed the message to a program: if the program returns output, the entire message (including the headers) will be replaced with this output; if the program does not return output or exits with a return code other than 0 (indicating an error occurred), the message will not change. Specify the full path to the program. The same substitutions (<symbol>&percnt;n</symbol>, <symbol>&percnt;{foo}</symbol> as with <guilabel>execute command</guilabel> are performed on the command line.
de: Leitet die Nachricht durch ein Programm. Wenn das Programm eine Ausgabe liefert, wird die gesamte Nachricht durch die erzeugte Ausgabe (einschließlich des Vorspanns) ersetzt. Wenn das Programm keine Ausgabe liefert oder einen anderen Rückgabecode als 0 hat (was auf das Auftreten eines Fehlers hindeutet), wird die Nachricht nicht verändert. Der volle Programmpfad muss angegeben werden. Es werden die gleichen automatischen Ersetzungen in der Befehlszeile (<symbol>&percnt;n</symbol>, <symbol>&percnt;{irgendwas}</symbol>) wie bei <guilabel>Befehl ausführen</guilabel> durchgeführt.

source: Be cautious with this action, as it will easily mess up your messages if the filter program returns garbage or extra lines.
de: Diese Aktion muss mit Vorsicht eingesetzt werden, da man leicht seine Nachrichten zerstören kann, wenn das Filterprogramm nur Müll oder zusätzliche Zeilen zurückgibt.

source: Remove Header
de: Vorspann entfernen

source: Will remove all header fields with the given name from the message. This is useful mainly for removing bogus <quote>Reply-To:</quote> headers.
de: Entfernt <emphasis>alle</emphasis> Vorspannfelder mit dem angegebenen Namen aus der Nachricht. Das ist vor allem nützlich, um ungewünschte <quote>Antwortadressen</quote> zu entfernen.

source: Add Header
de: Vorspann hinzufügen

source: If no such field is already present this will add a new header field with the given name and value to the message; if there already is a header field with that name, it is overwritten with the given value; if there are already multiple headers with the given name (&eg; <quote>Received:</quote> headers), an arbitrary one of them is overwritten and the others are left unchanged -- this is a known limitation. You may want to combine this filter with the <guilabel>remove header</guilabel> filter above to make sure that there are no other headers with that name in the message.
de: Wenn noch kein Vorspannfeld dieses Namens existiert, wird eines hinzugefügt mit dem angegebenen Namen und Wert hinzugefügt. Existiert bereits eines, wird dessen Inhalt überschrieben. Gibt es bereits mehrere Vorspannfelder dieses Namens (z.B. <quote>Received:</quote>-Vorspann) wird ein zufällig ausgewähltes überschrieben und die anderen nicht verändert. Dies ist eine bekannte Einschränkung. Man kann diesen Filter mit dem Filter <guilabel>Vorspann entfernen</guilabel> kombinieren, um sicher zu stellen, dass nur eine Vorspannzeile vorhanden ist.

source: Rewrite Header
de: Vorspann neu schreiben
