Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdepim/kmail_intro.po
Languages: de

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Matthias</firstname><surname>Kiefer</surname> <affiliation><address><email>matthias.kiefer@gmx.de</email></address></affiliation> <contrib>Deutsche Übersetzung</contrib></othercredit> <othercredit role="translator"><firstname>Alexander</firstname><surname>Gretencord</surname> <affiliation><address><email>arutha@gmx.de</email></address></affiliation> <contrib>Überarbeitung</contrib></othercredit> <othercredit role="translator"><firstname>Frank</firstname><surname>Schütte</surname> <affiliation><address><email>F.Schuette@t-online.de</email></address></affiliation> <contrib>Überarbeitung ab Version 1.3</contrib></othercredit> <othercredit role="translator"><firstname>Matthias Kalle</firstname><surname>Dalheimer</surname> <affiliation><address><email>kalle@kdab.net</email></address></affiliation> <contrib>Krypto-Übersetzung</contrib></othercredit>

source: Introduction
de: Einführung

source: <screeninfo>&kmail; Welcome Screen</screeninfo>
de: <screeninfo>&kmail;-Startbildschirm</screeninfo>

source: <phrase>&kmail; Welcome Screen</phrase>
de: <phrase>&kmail;-Startbildschirm</phrase>

source: <para>&kmail; Welcome Screen</para>
de: <para>&kmail;-Startbildschirm</para>

source: The &kmail; Team welcomes you to &kmail;, a user-friendly email client for &kde;. Our goal is to make &kmail; a program that is beautiful and intuitive without sacrificing power.
de: Das &kmail;-Team begrüßt Sie zu &kmail;, dem benutzerfreundlichen E-Mail-Programm für &kde;. Unser Ziel ist eine hübsche und intuitive Oberfläche, ohne dabei die Funktionalität zu vernachlässigen.

source: If you have never set up an email client on a &UNIX; system before, we suggest that you read through the <link linkend="getting-started">Getting Started</link> section first.
de: Falls Sie vorher noch nie ein E-Mail-Programm auf einem &UNIX;-System eingerichtet haben, schlagen wir vor, dass Sie zuerst den Abschnitt <link linkend="getting-started">Erste Schritte</link> lesen.

source: Some &kmail; Features
de: Einige Leistungsmerkmale von &kmail;

source: Some links to the great features available in &kmail;
de: In der folgenden Liste finden Sie Verknüpfungen zu wichtigen Funktionen in &kmail;:

source: You do not have to use your mouse to use &kmail;. Everything can be done by using <link linkend="keyboard-shortcuts">Keyboard Shortcuts</link>.
de: Man muss &kmail; nicht mit der Maus bedienen. Alle Funktionen können auch mit Hilfe von <link linkend="keyboard-shortcuts">Tastatur-Kurzbefehlen</link> ausgeführt werden.

source: Although &kmail; can be considered reliable you should keep backups of your messages, &ie; use one of the export/archive options listed in <link linkend="backups">Backup Options</link> to backup your settings and email to a safe place.
de: Obwohl &kmail; als stabil bezeichnet werden kann, sollten Sie Sicherungen Ihrer Dateien vornehmen. Benutzen Sie eine der Möglichkeiten zum Export bzw. zur Archivierung, die im Kapitel <link linkend="backups">&kmail;-Sicherung</link> genannt werden, um Ihre Einstellungen und E-Mail an einem sichern Ort zu speichern.

source: &kmail; is capable of importing email in several formats from your previous email applications using options in <link linkend="import-restore">Restore and Import in &kmail;</link>.
de: Mit &kmail; können Sie E-Mails in mehreren Formaten von Ihrem vorher benutzten E-Mailprogramm mit den Einstellungen im Kapitel <link linkend="import-restore">Wiederherstellen und Import in &kmail;</link> importieren.

source: Organize your folders with ease using &kmail;s extensive <link linkend="folders">Folders</link> options. Some of the features include handling per folder: mailing lists, acl (&imap; only), and archiving.
de: Organisieren Sie Ihre Ordner in &kmail; für eine bessere Benutzbarkeit mit den umfangreichen Einstellungen für <link linkend="folders">Ordner</link>. Einige dieser Funktionen getrennt für jeden Ordner eingerichtet Werden, zum Beispiel Mailinglisten, Zugriffsrechte (nur für &imap;) und Archivierung.

source: Compliment your folder setup with highly configurable <link linkend="filters">filters</link>.
de: Ergänzen Sie die Einrichtung Ihrer Ordner mit <link linkend="filters">Filtern</link>, die in großen Maße angepasst werden können.

source: By default &kmail; will detect common email <link linkend="configure-security-email-scams">scams</link>. You can also fight SPAM and viruses with built in wizards to work with external programs to scan email as it comes in. See <link linkend="the-anti-spam-wizard">Anti Spam Wizard</link> and <link linkend="the-anti-virus-wizard">Anti-Virus-Wizard</link> for details.
de: In der Voreinstellung erkennt &kmail; häufig vorkommende <link linkend="configure-security-email-scams">betrügerische E-Mails</link>. Zur Abwehr von Spam und Viren können Sie die eingebauten Assistenten benutzen und auch externe Programme zum Scannen von E-Mails beim Empfang einbinden. Weitere Informationen finden Sie in den Abschnitten <link linkend="the-anti-spam-wizard">Anti-Spam-Assistent</link> und <link linkend="the-anti-virus-wizard">Anti-Virus-Assistent</link>.

source: Easily manage per-account settings using multiple <link linkend="configure-identity">identities</link>.
de: Einfache Verwaltung von verschiedenen Einstellungen für ein Postfach mit <link linkend="configure-identity">Identitäten</link>.

source: We hope you will enjoy &kmail;!
de: Wir hoffen, Ihnen gefällt &kmail; !

source: Getting Help
de: Weiterführende Hilfe

source: If you experience any problems migrating to &kmail; 2 please read the chapter <link linkend="troubleshooting">Troubleshooting</link>.
de: Bei Problemen mit dem Umstieg auf KMail 2 lesen Sie das Kapitel <link linkend="troubleshooting">Fehlersuche und -behebung</link>.

source: &kmail;'s homepage can be found at <ulink url="http://userbase.kde.org/KMail">http://userbase.kde.org/KMail</ulink>. There you will find useful links, &eg; to the user and developer mailing lists. Please report bugs in &kmail; using <menuchoice><guimenu>Help</guimenu><guimenuitem>Report Bug...</guimenuitem></menuchoice>.
de: Die Homepage von &kmail; ist <ulink url="http://userbase.kde.org/KMail">http://userbase.kde.org/KMail</ulink>. Hier finden Sie nützliche Links, etwa zu den Mailinglisten für Anwender und für Entwickler. Bitte melden Sie Fehler in &kmail; über <menuchoice><guimenu>Hilfe</guimenu><guimenuitem>Fehler melden ...</guimenuitem></menuchoice>.
