Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdepim/kmail_faq.po
Languages: de

source: Modify your &kmail; configuration to fetch the mail via POP3 from <userinput>localhost</userinput> and ssh will tunnel the connection for you.
de: Konfiguriert man nun &kmail;, die neue Mail per POP3 von <userinput>localhost</userinput> abzuholen, stellt ssh automatisch eine getunnelte Verbindung her.

source: If non-encrypted messages have already been sent via Internet, the only advantage of using <application>ssh</application> is that your <emphasis>password</emphasis> will be sent encrypted to the POP3 server.
de: Falls bereits nicht verschlüsselte Nachrichten über das Internet gesendet wurden, ist der einzige Vorteil von <application>ssh</application>, dass das <emphasis>Passwort</emphasis> verschlüsselt zum POP3-Server gesendet wird.

source: Does &kmail; lock the folders it uses?
de: Sperrt &kmail; die verwendeten Ordner?

source: &kmail; does not lock the files in <filename class="directory">~/local/share</filename>.
de: &kmail; sperrt die Dateien in <filename class="directory">~/local/share</filename> nicht.

source: To avoid the risk of losing mail <emphasis>if using a local account</emphasis> it is necessary to ensure that &kmail; uses the same type of locking as your mail delivery agent.
de: Um das Risiko von Datenverlusten zu vermeiden, falls man ein <emphasis>lokales Konto</emphasis> verwendet, ist es erforderlich, das &kmail; denselben Sperr-Mechanismus wie das E-Mail-Verteilungsprogramm verwendet.

source: There are five different locking options you can use:
de: Für das Sperren gibt es fünf unterschiedliche Optionen:

source: Procmail lockfile
de: Procmail-Sperrdatei

source: <guilabel>FCNTL</guilabel> (default)
de: <guilabel>FCNTL</guilabel> (Standard)

source: none (use with care)
de: Keine (mit Vorsicht zu benutzen)

source: <guilabel>Procmail lockfile</guilabel> will use a small utility that comes with <application>procmail</application> called <command>lockfile</command>. You can use this if your mail folder is in a folder where you have write permission. This will not work on your <filename class="directory">/var/spool/mail/user</filename> file in most cases. It will create <filename>.lock</filename> files on your account when &kmail; is checking for new mail. Please note that this will only work if <application>procmail</application> is installed on your system.
de: Die <guilabel>Procmail lockfile</guilabel> verwendet ein kleines Programm mit Namen <command>lockfile</command>, das zu <application>procmail</application> gehört. Dieses kann man verwenden, falls sich die Mail-Ordner in einem Ordner befinden, auf den man Schreibzugriff hat. Das funktioniert normalerweise nicht in <filename class="directory">/var/spool/mail/user</filename>. Es erzeugt Dateien mit Namen <filename>.lock</filename> für das eigene Konto, wenn &kmail; nach neuen Nachrichten sucht. Diese Option funktioniert nur dann, wenn <application>procmail</application> auf dem System installiert ist.

source: <guilabel>Mutt dotlock</guilabel> and <guilabel>Mutt dotlock privileged</guilabel> will both use a small utility that comes with <application>mutt</application> called <command>mutt_dotlock</command>. <guilabel>Mutt dotlock</guilabel> can be used in the same way as the <guilabel>Procmail lockfile</guilabel> option, with the same limitation with regards to the <filename class="directory">/var/spool/mail/</filename> folders. However, the <guilabel>Mutt dotlock privileged</guilabel> option can create lock files in the <filename class="directory">/var/spool/mail</filename> folder. <command>mutt_dotlock</command> is a setgid program and this option will run it in setgid mode. Please note that these options will only work if <application>mutt</application> is installed on your system.
de: <guilabel>Mutt dotlock</guilabel> und <guilabel>Mutt dotlock privileged</guilabel> verwenden beide ein kleines Programm mit dem Namen <command>mutt_dotlock</command>, das mit <application>mutt</application> ausgeliefert wird. <guilabel>Mutt dotlock</guilabel> kann auf die gleiche Weise verwendet werden wie die <guilabel>Procmail Sperrdatei</guilabel>-Option, mit der gleichen Einschränkung in Bezug auf die <filename class="directory">/var/spool/mail/</filename>-Ordner. Das Programm <guilabel>Mutt dotlock privileged</guilabel> kann darüber hinaus Sperrdateien im Ordner <filename class="directory">/var/spool/mail</filename> anlegen. <command>mutt_dotlock</command> ist ein setgid-Programm und diese Option wird im Modus setgid ausgeführt. Diese Optionen funktionieren natürlich nur dann, wenn <application>mutt</application> auf dem System installiert ist.

source: <guilabel>FCNTL</guilabel> will use the <function>fcntl()</function> system call.
de: Die Standardoption <guilabel>FCNTL</guilabel> verwendet den <function>fcntl()</function>-Systemaufruf.

source: Usage of FCNTL locking might cause system lockups when the mail spool file is on an NFS mounted device.
de: Die Verwendung von FCNTL-Sperrung kann das Einfrieren des Rechners zur Folge haben, wenn sich die Mail-Spooldatei auf einem per NFS eingebundenen Geräte befindet.

source: If you do not want to use any locking, the <guilabel>none</guilabel> option is what you want. However, there are risks of losing mail when no locking is used.
de: Falls man auf Sperrungen verzichten will, kann man die Option <guilabel>keine</guilabel> verwenden. Es besteht allerdings in diesem Fall die Gefahr von Datenverlusten.

source: How do I leave messages on the POP3 server?
de: Wie kann ich die Nachrichten auf dem POP3-Server lassen?

source: If you want to leave all messages on the server: open up the <menuchoice><guimenu>Settings</guimenu><guimenuitem>Configure &kmail;...</guimenuitem> </menuchoice> window. Click on the <guilabel>Accounts</guilabel> page. Select your account from the account list and click the <guibutton>Modify...</guibutton> button. This dialog contains the <guilabel>Leave fetched messages on the server</guilabel> setting which you must enable.
de: Falls man alle Nachrichten auf dem Server belassen möchte, muss man <menuchoice><guimenu>Einstellungen</guimenu><guimenuitem>&kmail; einrichten ...</guimenuitem></menuchoice> auswählen. Gehen Sie dort zur Seite <guilabel>Zugänge</guilabel>. Wählen Sie aus der Postfachliste das gewünschte Postfach aus und drücken Sie den Knopf <guilabel>Ändern ...</guilabel>. Dieser Dialog enthält die Option <guilabel>Abgeholte Nachrichten auf dem Server lassen</guilabel>, die Sie aktivieren müssen.

source: How do I automatically insert a text footer within my messages?
de: Wie kann ich automatisch einen Text am Ende der Nachricht einfügen?

source: The text footer is also called a signature (not to be confused with a cryptographic signature). Select <menuchoice><guimenu>Settings</guimenu> <guimenuitem>Configure &kmail;...</guimenuitem></menuchoice>. Look in the <guilabel>Identity</guilabel> page for the <guilabel>Signature</guilabel> tab and add your signature there. Then go to the <guilabel>General</guilabel> tab on the <guilabel>Composer</guilabel> page and enable <xref linkend="configure-composer-general-append-signature"/>
de: Der Fußnotentext wird Signatur genannt (nicht mit kryptografischen Signaturen zu verwechseln). Wählen Sie <menuchoice><guimenu>Einstellungen</guimenu> <guimenuitem>&kmail; einrichten...</guimenuitem></menuchoice>. Schauen Sie im Abschnitt <guilabel>Identität</guilabel> auf der Seite <guilabel>Signatur</guilabel> nach und geben Sie die gewünschte Signatur hier ein. Wechseln Sie dann zur Karteikarte <guilabel>Allgemein</guilabel> auf der Seite <guilabel>E-Mail-Editor</guilabel> und aktivieren Sie <xref linkend="configure-composer-general-append-signature"/>.

source: How do I set up &Sendmail; to work with &kmail; if I have a dial-up connection?
de: Wie kann ich bei einer Wählverbindung zum Internet &Sendmail; für &kmail; konfigurieren?

source: First you should check if your distribution can do this for you. It probably has already been set up during installation.
de: Zuerst sollte man überprüfen, ob die eigene Distribution das automatisch erledigen kann. Meisten passiert das bereits während der Installation.

source: If that is not the case, you may want to have a look at <ulink url="http://tldp.org/HOWTO/Mail-Queue.html">the Mail Queue HOWTO</ulink>.
de: Wenn das nicht der Fall sein sollte, können Sie auf <ulink url="http://tldp.org/HOWTO/Mail-Queue.html">Mail Queue HOWTO</ulink> nachschauen.

source: I've seen demonstrations of remote control behavior with &kmail;. Is there any documentation on the available interfaces?
de: Ich habe Demonstrationen mit Fernsteuerung von &kmail; gesehen. Gibt es Unterlagen über die verfügbaren Schnittstellen?

source: You can get a list of functions by using this command in a shell: <userinput><command>qdbus</command> <option>org.kde.kmail /KMail</option></userinput>. Then you can control &kmail; like this: <userinput><command>qdbus</command> <option>org.kde.kmail /KMail org.kde.kmail.kmail.folderList</option></userinput>. You can use <application>qdbusviewer</application> to browse available methods in a graphical interface.
de: Sie können eine Liste der verfügbaren Funktion mit folgendem Befehl in einer Shell erhalten: <userinput><command>qdbus</command> <option>org.kde.kmail /KMail</option></userinput>. Dann können Sie &kmail; mit diesen Funktionen wie im Folgenden steuern: <userinput><command>qdbus</command> <option>org.kde.kmail /KMail org.kde.kmail.kmail.folderList</option></userinput>. Es gibt außerdem auch das Programm <application>qdbusviewer</application>, das eine grafische Benutzeroberfläche zur Anzeige aller verfügbaren Funktionen bietet.

source: When I reply to a message, only a part of the message is quoted. How come?
de: Wenn ich auf eine E-Mail antworte, wird nur ein Teil der Nachricht zitiert. Wie kommt das?

source: This can happen when the message contains two dashes and a space on a single line. This is seen as the start of the signature. The remaining part of the message will not be quoted, because when you reply to a message &kmail; strips the signature.
de: Dies kann passieren, wenn die Nachricht zwei Bindestriche und ein Leerzeichen in einer einzelnen Zeile enthält. Diese Zeichenfolge wird als Beginn einer Signatur gewertet. Der nachfolgende Teil der Nachricht wird nicht zitiert, da &kmail; beim Antworten die Signatur abschneidet.

source: I am only using &imap;, can I get rid of those Local Folders in the folder list or at least keep them collapsed all the time?
de: Ich benutze ausschließlich &imap;. Kann ich die Lokalen Ordner irgendwie loswerden oder zumindest erreichen, dass diese immer eingeklappt sind?

source: No, you cannot get rid of them. The local folders function as a fallback when the &imap; server is unreachable. Although you only use &imap;, &kmail; uses the outbox for sending the messages. If we hide all local folders you will not be able to fix messages in the outbox which cannot be send for some reason. But it is possible to keep the local folders collapsed. What you have to do is go to <menuchoice><guimenu>Settings</guimenu><guimenuitem> Configure &kmail;...</guimenuitem></menuchoice> and go to the section Misc, there you can setup the folder on startup. If you change that to a folder on the &imap; account, the Local Folders will stay collapsed when &kmail; starts.
de: Loswerden können Sie diese Ordner nicht. Die Lokalen Ordner fungieren als Notlösung, wenn der &imap;-Server nicht erreichbar ist. Auch wenn Sie ausschließlich &imap; benutzen, benötigt &kmail; den Postausgang zum Versenden von Nachrichten. Würden alle lokalen Ordner ausgeblendet, wären Sie nicht in der Lage Nachrichten, die aus irgendeinem Grund nicht versendet werden können, aus dem Postausgang zu entfernen oder zu korrigieren. Sie können aber die Ordner eingeklappt lassen. Dazu müssen Sie <menuchoice><guimenu>Einstellungen</guimenu><guimenuitem>&kmail; einrichten ...</guimenuitem></menuchoice> auswählen und die Karteikarte <quote>Diverses</quote> anzeigen. Dort können Sie den Ordner einstellen, der beim Programmstart geöffnet ist. Ändern Sie diese Einstellung so, dass sie auf einen &imap;-Zugang verweist, bleiben die Lokalen Ordner beim Start von &kmail; eingeklappt.

source: How to watch the threads?
de: Wie kann Ich Diskussionen überwachen?

source: If you want to follow a thread, right click and choose <menuchoice><guimenu>Mark Thread</guimenu><guimenuitem>Watch Thread</guimenuitem></menuchoice>.
de: Möchten Sie eine Gruppe überwachen, klicken sie mit der &RMBn; darauf und wählen im Kontextmenü <menuchoice><guimenu>Gruppe markieren</guimenu><guimenuitem>Gruppe überwachen</guimenuitem></menuchoice>.

source: From this point on all messages on the thread that starts in this message will be marked as <guilabel>Watched</guilabel>.
de: Jetzt werden alle E-Mails in dieser Gruppe, die nach der markierten Nachricht eintreffen, als <guilabel>Überwacht</guilabel> markiert.

source: How to watch your own threads?
de: Wie überwache Ich Diskussionen mit eigenen Beiträgen?

source: This is useful in case you are registered to a mailing list such as kdepim-users@kde.org and want to filter out the threads you participate in.
de: Dies ist zum Beispiel nützlich, wenn Sie eine Mailingliste wie kdepim-users@kde.org abonniert haben und alle Diskussionen filtern möchten, an denen Sie teilnehmen.

source: Create a filter to mark all your incoming messages to a mailing list as Watched
de: Erstellen Sie einen Filter der alle Ihre eingehenden Nachrichten an Mailinglisten als <quote>Überwacht</quote> markiert

source: To create a filter go to:
de: Diesen Filter erstellen Sie mit:

source: <guimenu>Settings</guimenu><guimenuitem>Configure Filters</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>Filter einrichten ...</guimenuitem>

source: select <guilabel>Match all of the following</guilabel>
de: Wählen Sie <guilabel> Alle folgenden Bedingungen müssen zutreffen</guilabel>

source: Add the conditions:
de: Fügen Sie diese Bedingungen hinzu:

source: <menuchoice><guimenu>From</guimenu><guisubmenu>Contains</guisubmenu><guimenuitem></guimenuitem></menuchoice> <replaceable>yourmail@maildomain</replaceable>
de: <menuchoice><guimenu>Von</guimenu><guisubmenu>enthält</guisubmenu><guimenuitem></guimenuitem></menuchoice> <replaceable>ihremail@maildomain</replaceable>

source: replace <replaceable>yourmail@maildomain</replaceable> with your outgoing mail address
de: Ersetzen Sie <replaceable>ihremail@maildomain</replaceable> mit Ihrer E-Mail-Adresse für Versand

source: <menuchoice><guimenu>List-Id</guimenu><guimenuitem>Contains</guimenuitem></menuchoice> <replaceable>listID</replaceable>
de: <menuchoice><guimenu>List-Id</guimenu><guimenuitem>enthält</guimenuitem></menuchoice> <replaceable>listID</replaceable>

source: replace <replaceable>listID</replaceable> with a specific mailing list id &eg; (&lt;kdepim-users.kde.org&gt;) or just a <quote>.</quote> to include outgoing mail to all mailing lists with <quote>.</quote> in their id (basically all).
de: Ersetzen Sie <replaceable>listID</replaceable> mit der Kennung einer Mailingliste wie &eg; (&lt;kdepim-users.kde.org&gt;) oder mit <quote>.</quote> um alle ausgehenden E-Mails an Mailinglisten zu erfassen, die ein <quote>.</quote> in der Kennung enthalten. Das trifft im Prinzip auf alle Listen zu.

source: Under <guilabel>Filter Actions</guilabel> choose <menuchoice><guimenu>Mark As</guimenu><guimenuitem>Watched</guimenuitem></menuchoice>.
de: Unter <guilabel>Filteraktionen</guilabel> wählen Sie <menuchoice><guimenu>Markieren als</guimenu><guimenuitem>Überwacht</guimenuitem></menuchoice>.

source: In the <guilabel>Advanced</guilabel> tab
de: Auf der Karteikarte <guilabel>Erweitert</guilabel>

source: Uncheck <guilabel>if this filter matches, stop processing here</guilabel>, so that other filters such as sorting the incoming messages from the mailing list to sub-folders would execute.
de: Schalten Sie <guilabel>Bearbeitung hier beenden, falls Filterbedingung zutrifft</guilabel> ab, damit andere Filter wie zum Beispiel zum Sortieren von eingehenden Nachrichten von der Mailingliste in Unterordner noch ausgeführt werden.

source: Place that filter before other filters that may stop the filtering process, or simply put it first. (changing the filters order is done using the two arrows up and down, under the <guilabel>Available filters</guilabel> list)
de: Stellen Sie diesen Filter vor jeden anderen Filter, der die weitere Filterung abbricht oder setzen Sie ihn einfach an die erste Stelle. Die Reihenfolge der Filter können Sie mit den Knöpfen <guilabel>Nach oben</guilabel> und <guilabel>Nach unten</guilabel> unter der Liste <guilabel>Vorhandene Filter</guilabel> ändern.

source: Create a search on mailing list messages
de: Erstellen Sie eine Suche nach Nachrichten von Mailinglisten

source: Go to the folder where your mailing list messages are stored (&eg; Local Folders/KDE-PIM-USERS) and hit <keycap>S</keycap> key or in the menu <menuchoice><guimenu>Edit</guimenu><guimenuitem>Find Messages</guimenuitem></menuchoice>.
de: Gehen Sie in den Ordner in dem die Nachrichten der Mailingliste gespeichert sind (&eg; Lokale Ordner/KDE-PIM-USERS) und drücken Sie die Taste <keycap>S</keycap> oder wählen im Menü <menuchoice><guimenu>Bearbeiten</guimenu><guimenuitem>Nachrichten suchen ...</guimenuitem></menuchoice>

source: Select <guilabel>Match all of the following</guilabel>
de: Wählen Sie <guilabel>Alle folgenden Bedingungen müssen zutreffen</guilabel>

source: Pay attention to the <guilabel>Include sub-folders</guilabel>.
de: Aktivieren Sie <guilabel>Unterordner einbeziehen</guilabel>.

source: Add the condition: <menuchoice><guimenu>Message Status</guimenu><guisubmenu>is</guisubmenu><guimenuitem>Watched</guimenuitem></menuchoice>
de: Fügen Sie die Bedingung <menuchoice><guimenu>Nachrichten-Status</guimenu><guisubmenu>ist gleich</guisubmenu><guimenuitem>Überwacht</guimenuitem></menuchoice> hinzu.

source: Give the search an informative name (<guilabel>Search folder name</guilabel>) like <replaceable>KDE-PIM-USERS-Watched</replaceable>
de: Geben Sie eine Bezeichnung in <guilabel>Suchordner-Name</guilabel> wie zum Beispiel <replaceable>KDE-PIM-USERS-Watched</replaceable> ein.

source: Make the search. After it is done you can close the search window.
de: Führen Sie die Suche durch. Nach dem Ende der Suche können Sie den Dialog „Suchen“ schließen.

source: Now whenever you start a thread or participate in one, it is <guilabel>Watched</guilabel>.
de: Wenn Sie jetzt eine Diskussion beginnen oder daran Teilnehmen, wird sie als <guilabel>Überwacht</guilabel> markiert.

source: How to use E-Mail Translation?
de: Wie kann ich E-Mails übersetzen?

source: To translate text in the composer window read the section <link linkend="using-the-translator">Using the Built-in Translator</link>
de: Informationen zum übersetzen von Text im E-Mail-Editor finden Sie im Abschnitt <link linkend="using-the-translator">Das eingebaute Übersetzungsmodul verwenden</link>

source: In the message preview pane highlight the text you would like to translate and select <guimenuitem>Translate</guimenuitem> (<keycombo action="simul">&Ctrl;&Alt;<keycap>T</keycap></keycombo>) from the &RMB; context menu.
de: Im Nachrichtenvorschaubereich markieren Sie den Text, den Sie übersetzen möchten und wählen dann <guimenuitem>Übersetzen</guimenuitem> (<keycombo action="simul">&Ctrl;&Alt;<keycap>T</keycap></keycombo>) aus dem Kontextmenü der &RMBn;.
