Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdepim/kmail_configure.po
Languages: de

source: This selection allows you to use a different editor. Please note that the composer window will still open, and the external editor will open on top of the composer window. When you are done, save the text and exit the editor. The text will now appear in the composer window, where you can send it. Note that your editor may not return immediately, you have to use &eg; <userinput><command> gvim <option>-f</option> <varname>%f</varname></command></userinput> for <application>gvim</application>.
de: Mit dieser Einstellung können Sie auch einen anderen Editor verwenden. Trotz dieser Einstellung wird zunächst immer das Editorfenster geöffnet und dann der externe Editor gestartet. Nach der Erstellung der Nachricht speichern Sie den Text und schließen den Editor. Sofort erscheint der Text im Editorfenster und kann nun von dort versendet werden. Es kann sein, dass der externe Editor nicht automatisch wieder beendet wird. Für <application>gvim</application> müssen Sie beispielsweise den Befehl <userinput><command>gvim<option> -f</option><varname> %f</varname></command></userinput> verwenden.

source: Security Page
de: Sicherheit

source: Reading
de: Lesen

source: On this tab you can configure security-relevant options for reading messages.
de: Auf dieser Seite können Sie sicherheitsrelevante Optionen für das Lesen von Nachrichten konfigurieren.

source: Prefer HTML to plain text
de: HTML-Ansicht vor Klartext bevorzugen

source: By default &kmail; will show &html; messages in plain text. If you prefer to view messages with &html; formatting and layout automatically, select this option. However, we recommend leaving this option off, as security problems with &html; might show up.
de: Als Standard werden &html;-Nachrichten als einfacher Text angezeigt. Möchten Sie diese Nachrichten automatisch im &html;-Format und -Layout anzeigen lassen, wählen Sie diese Einstellung. Es wird empfohlen, auf die &html;-Formatierung zu verzichten, da es Sicherheitsproblemen bei der Anzeige im &html;-Format auftreten können.

source: You can still easily view messages in &html; format per email by clicking the plain message/html message toggle bar on the left hand side of the message window. Please see <link linkend="configure-appearance-message-window">Message Window</link> to enable this feature.
de: Sie könne trotzdem einzelne E-Mails im &html;-Format betrachten, indem Sie auf die Leiste Klartext-Nachricht/&html;-Nachricht links im Nachrichtenfenster klicken. Weitere Informationen zu dieser Funktion im Abschnitt <link linkend="configure-appearance-message-window">Nachrichtenfenster</link>.

source: Allow messages to load external references from the Internet
de: Nachrichten dürfen externe Referenzen aus dem Internet laden

source: If checked, &kmail; can load external images, stylesheets &etc; from the Internet when you look at an &html; message. We strongly recommend to leave this option off (although it has no effect if you only view plain text messages).
de: Mit <guilabel>Nachrichten dürfen externe Referenzen aus dem Internet laden</guilabel> kann &kmail; externe Bilder, Stilvorlagen &etc; aus dem Internet laden, wenn man eine &html;-Nachricht liest. Diese Option sollte möglichst nicht gewählt werden (sie hat allerdings keine Auswirkungen, wenn man lediglich einfache Text-Nachrichten liest).

source: By adding external references to their messages, people sending spam can detect when you have looked at their message, your location, and alot of other information that gets logged on web servers. Note that this option has no effect on &Java;, JavaScript and Plugins as these are not supported in &kmail; at all, which is a good thing, as most viruses propagate through these.
de: Durch externe Referenzen können Leute, die Spam-Mail versenden, leicht überprüfen, ob und wann man die Nachricht gelesen hat. Zu beachten ist, dass diese Einstellung keinen Effekt auf &Java;, JavaScript und Module hat - diese sind für E-Mails generell deaktiviert und können auch nicht aktiviert werden.

source: Informs if message reading is a suspected email scam
de: Hinweis auf verdächtige betrügerische E-Mails

source: With the popularity of email, unfortunately comes the popularity of email scams. Email scams can include emails made to appear as though they come from legitimate companies, but they really link to malicious web sites requesting your personal information. This can lead to identity theft and worse. By default &kmail; analyzes messages for common scams, and will inform you if the email is a suspected scam. It is highly advised to keep this feature enabled. If you wish to disable this great feature, uncheck <guilabel>Informs if message reading is a suspected email scam</guilabel>.
de: Mit der zunehmenden Verbreitung von E-Mails nimmt leider auch die Anzahl von Betrugsversuchen mit E-Mails zu. Diese betrügerischen E-Mails täuschen zum Beispiel als Absender eine tatsächlich existierende Firma oder Institution vor, aber in Wirklichkeit enthalten sie Verknüpfungen zu bösartigen Webseiten, die Ihre persönlichen Daten abfragen. Das kann zum Identitätsdiebstahl und Schlimmerem führen. In der Voreinstellung analysiert &kmail; Nachrichten auf bekannte Betrugsverfahren und informiert Sie über verdächtige E-Mails. Es wird dringend empfohlen, diese Funktion zu benutzen. Möchten Sie diese Prüfung abschalten, deaktivieren Sie <guilabel>Benachrichtigung über möglicherweise betrügerische E-Mails</guilabel>.

source: If you have legitimate emails being flagged, &eg; from trusted friends, you can add their email to the <guilabel>Whitelist:</guilabel> by clicking the <guibutton>Add...</guibutton> and enter the email into the dialog that pops up. Please note that at this time, only individual emails are supported.
de: Werden &eg; E-Mails von vertrauenswürdigen Freunden fälschlicherweise als betrügerische E-Mails gekennzeichnet, können Sie deren E-Mail-Adresse in die Positivliste eintragen, indem Sie auf <guibutton>Hinzufügen</guibutton> klicken und die Adressen im Dialog eingeben. Beachten Sie, dass zurzeit nur einzelne Adressen unterstützt werden.

source: Encrypted messages
de: Verschlüsselte Nachrichten

source: By default, &kmail; will automatically attempt to decrypt encrypted messages when you view them. If you prefer to do it manually, unselect this option.
de: In der Voreinstellung versucht &kmail; verschlüsselte Nachrichten automatisch zu entschlüsseln. Deaktivieren Sie diese Einstellung, wenn Sie das Entschlüsseln manuell durchführen möchten.

source: Certificate &amp; Key Bundle Attachments
de: Zertifikate &amp; Schlüsselbund-Anhänge

source: If you would like to have &kmail; to <guilabel>Automatically import keys and certificate</guilabel> from incoming messages for decryption, select this option.
de: <guilabel>Schlüssel und Zertifikate automatisch importieren</guilabel>: Aktivieren Sie diese Einstellung, damit Schlüssel und Zertifikate von eingehenden Nachrichten automatisch für die Entschlüsselung importiert werden.

source: Message Disposition Notifications
de: Empfangs- und Lesebenachrichtigungen

source: &mdn;s are a generalization of what is commonly called a <quote>read receipt</quote>. The message author requests a disposition notification to be sent and the receiver's mail program generates a reply from which the author can learn what happened to his message. Common disposition types include <quote>displayed</quote> (&ie; read), <quote>deleted</quote> and <quote>dispatched</quote> (&eg; forwarded).
de: &mdn;s sind eine Generalisierung dessen, was allgemein eine <quote>Lesebestätigung</quote> genannt wird. Der Autor einer Nachricht erbittet das Verschicken einer Benachrichtigung, und das E-Mail-Programm des Empfängers erzeugt eine Antwort, aus der der Autor ersehen kann, was mit seiner Nachricht passiert ist. Gängige Benachrichtigungstypen sind <quote>displayed</quote> (angezeigt, also gelesen), <quote>deleted</quote> (gelöscht) und <quote>dispatched</quote> (z.B. weitergeleitet).

source: The following options (listed as <guilabel>Send policy</guilabel>) are available to control <emphasis>when</emphasis> &kmail; sends &mdn;s:
de: Die folgenden Optionen zur <guilabel>Versandregelung</guilabel> stehen zur Verfügung, um zu steuern, <emphasis>wann</emphasis> &kmail; &mdn;s versenden soll.

source: <guilabel>Ignore</guilabel> (recommended)
de: <guilabel>Ignorieren</guilabel> (empfohlen)

source: Ignores any request for disposition notifications. No &mdn; will ever be sent automatically.
de: Ignoriert automatisch alle Anforderungen nach Bestätigungen. Keine &mdn; wird jemals automatisch versendet werden.

source: <guilabel>Ask</guilabel>
de: <guilabel>Nachfragen</guilabel>

source: Answers requests only after asking the user for permission. This way, you can send &mdn;s for selected messages while denying or ignoring them for others.
de: Versendet Benachrichtigungen erst, nachdem der Benutzer seine Erlaubnis gegeben hat. Auf diese Weise können Sie &mdn;s für ausgewählte Nachrichten verschicken, für andere aber verweigern oder ignorieren.

source: Deny
de: Ablehnen

source: Always sends a <quote>denied</quote> notification. This is only <emphasis>slightly</emphasis> better than always sending &mdn;s. The author will still know that the messages has been acted upon, he just cannot tell whether it was deleted or read &etc;
de: Schickt immer eine <quote>denied</quote> (verweigert)-Benachrichtigung. Das ist nur <emphasis>geringfügig</emphasis> besser als immer &mdn;s zu verwenden. Der Autor weiß trotzdem noch, dass etwas mit den Nachrichten gemacht worden ist, er kann nur nicht sehen, ob diese gelesen, gelöscht &etc; worden ist.

source: Always send
de: Immer senden

source: Always sends the requested disposition notification. That means that the author of the message gets to know when the message was acted upon and, in addition, what happened to it (displayed, deleted, &etc;). This option is strongly discouraged, but since it makes sense where privacy is not a concern, &eg; in customer relationship management, it has been made available.
de: Schickt immer die angeforderten Zustellungsbenachrichtigungen. Das bedeutet, dass der Autor der Nachricht erfährt, wann etwas mit der Nachricht gemacht worden, und was (gelesen, gelöscht &etc;) damit gemacht wurde. Von der Verwendung dieser Option wird dringend abgeraten, aber sie kann sinnvoll sein, wenn der Schutz der Privatsphäre bedeutungslos ist, etwa in der Kundenpflege. Daher ist sie hier enthalten.

source: If you are unsure, experiment a while with <guilabel>Ask</guilabel> and if you find &kmail;s questions annoying, switch to <guilabel>Ignore</guilabel>.
de: Wenn Sie sich nicht sicher sind, experimentieren Sie ein Weilchen mit <guilabel>Nachfragen</guilabel>, und wenn Ihnen &kmail;s Fragen lästig werden, dann schalten Sie auf <guilabel>Ignorieren</guilabel> um.

source: The following options (listed as <guilabel>Quote original message</guilabel>) are available to control <emphasis>how much</emphasis> of the original message &kmail; sends back in &mdn;s.
de: Die folgenden Optionen zu <guilabel>Ursprüngliche Nachricht zitieren</guilabel> stehen zur Verfügung, um zu steuern, <emphasis>wie viel</emphasis> von der ursprünglichen Nachricht von &kmail; in &mdn;s zurückgeschickt werden soll.

source: Nothing
de: Nichts

source: No parts of the message other than the mandatory message-id and the original recipient is included in the &mdn; reply. This preserves enough information for the sender to find the message in his sent messages for which this &mdn; was generated.
de: Kein Teil der Nachricht außer der ursprünglichen Nachrichtenkennung und dem ursprünglichen Empfänger ist in der &mdn;-Antwort enthalten. Dies erhält genug Informationen für den Absender, um die Nachricht unter seinen gesendeten Nachrichten zu finden, für die diese &mdn; erzeugt wurde.

source: Full message
de: Vollständige Nachricht

source: Attaches the complete message to the disposition notification. Usually, this is overkill. It does not add any valuable information that cannot be deduced from the message headers alone, but people sometimes insist on this, since it is much easier for humans to correlate the content of the message than just the headers to what they sent earlier.
de: Hängt die vollständige Nachricht an die Benachrichtigung an. Normalerweise ist dies übertrieben viel. Es wird keine wertvolle Information hinzugefügt, die man nicht schon aus dem Nachrichtenkopf ableiten könnte, aber manche Leute bestehen darauf, weil es für Menschen viel einfacher ist, den Inhalt der Nachricht mit dem zuvor Gesendeten in Beziehung zu setzen, als nur den Nachrichtenkopf.

source: Only headers
de: Nur Vorspann

source: Attaches only the headers to the disposition notification. This is usually enough to enable both humans (by subject) and computers (by message-id) to easily correlate &mdn; and original message.
de: Hängt nur den Vorspann an die Benachrichtigung an. Das ist normalerweise sowohl für Menschen (anhand des Betreffs) und für Rechner (anhand der Nachrichtenkennung) genug, um die &mdn; der ursprünglichen Nachricht zuzuordnen.

source: If unsure, leave the option at the default.
de: Wenn Sie sich unsicher sind, behalten Sie die Voreinstellung.

source: Do not send MDNs in response to encrypted messages
de: Keine MDNs für verschlüsselte Nachrichten senden

source: This option suppresses the sending of &mdn;s if the message is encrypted (partially or in whole). This thwarts attempts to use &kmail;'s &mdn; feature as an <emphasis>oracle</emphasis> to deduce whether you were able to decrypt the message or not.
de: Diese Option unterdrückt das Verschicken von &mdn;s, wenn die Nachricht (ganz oder teilweise) verschlüsselt ist. Das macht Versuche zunichte, die &mdn;-Funktionalität von &kmail; dazu zu verwenden, um herauszufinden, ob Sie in der Lage waren, die Nachricht zu entschlüsseln oder nicht.

source: Strictly speaking, this option is not needed, since &kmail; sends &mdn;s regardless of whether the message could be successfully decrypted or not (the disposition notification request resides in the unencrypted part of the message), but it gives the security-conscious user the choice to either send them always if requested (option unchecked), or never (option checked).
de: Genau genommen braucht man diese Option nicht, weil &kmail; &mdn;s unabhängig davon schickt, ob die Nachricht erfolgreich entschlüsselt werden konnte oder nicht (die Benachrichtigungsanforderung steckt im unverschlüsselten Teil der Nachricht), gibt aber dem sicherheitsbewussten Benutzer die Möglichkeit, die &mdn;s immer wenn verlangt (Option abgewählt) oder nie (Option angewählt) zu verschicken.

source: If unsure, leave the option checked.
de: Wenn Sie sich nicht sicher sind, wählen Sie diese Option an.

source: Automatically import keys and certificates
de: Schlüssel und Zertifikate automatisch importieren

source: If checked, &kmail; automatically imports any attachments containing &openpgp; keys into your local keyring, and any attachments containing &smime; keys into your local key box.
de: Wenn diese Option angewählt ist, importiert &kmail; automatisch alle Anhänge, die &openpgp;-Schlüssel enthalten, in Ihren lokalen Schlüsselring, und alle Anhänge, die &smime;-Schlüssel enthalten in Ihren lokalen Schlüsselspeicher.

source: Verifying &smime; signatures always involves importing the contained certificates. This option thus does not affect this. It is also unrelated to &gpg;'s <option>auto-key-retrieve</option> feature, where &gpg; will try to import unknown keys from a key server.
de: Zum Überprüfen von &smime;-Signaturen müssen immer die enthaltenen Zertifikate importiert werden. Das ist von dieser Option daher nicht betroffen. Dies hat auch nichts mit der Option <option>auto-key-retrieve</option> von &gpg; zu tun, mit der &gpg; versucht, unbekannte Schlüssel von einem Schlüssel-Server zu importieren.

source: Composing
de: Nachrichten erstellen

source: On this tab you can configure security-relevant options for composing messages.
de: Auf dieser Karteikarte können Sie die sicherheitsrelevanten Optionen für das Erstellen von Nachrichten konfigurieren.

source: Automatically sign messages
de: Nachrichten automatisch signieren

source: If checked, the <xref linkend="composer-options-sign-message"/> option in the composer will default to <emphasis>on</emphasis>.
de: Wenn dies ausgewählt ist, dann ist die Standardeinstellung <xref linkend="composer-options-sign-message"/>im Editorfenster <emphasis>an</emphasis>.

source: However, you can still switch it on and off on a per-message basis.
de: Sie können dies aber trotzdem noch für jede einzelne Nachricht ein- und ausstellen.

source: When encrypting emails, always also encrypt to the certificate of my own identity
de: Beim Verschlüsseln von E-Mails immer auch für den eigenen Schlüssel verschlüsseln

source: If checked, any message that is encrypted to the recipients will additionally be encrypted to yourself.
de: Wenn diese Option angewählt ist, dann wird jede Nachricht, die an die Empfänger verschlüsselt wird, auch an Sie selbst verschlüsselt.

source: If you uncheck this option, you may not be able to decrypt the messages written by yourself and encrypted to other people anymore.
de: Wenn Sie diese Option abwählen, dann können Sie Nachrichten, die Sie geschrieben und an andere Leute verschlüsselt haben, möglicherweise nicht mehr lesen.

source: Store sent messages encrypted
de: Versendete Nachrichten verschlüsselt speichern

source: This option enables a mode of using mail encryption that is sometimes (misleadingly) called <quote>transport-only</quote> encryption. In this mode of operation, the message encryption is stripped off as soon as the message has reached its destination. The encryption lasts only while the message is on its way.
de: Diese Option schaltet einen Modus der Nachrichtenverschlüsselung ein, der manchmal (irreführend) <quote>nur-Transport</quote>-Verschlüsselung genannt wird. In diesem Betriebsmodus wird die Nachrichtenverschlüsselung unmittelbar entfernt, wenn die Nachricht ihr Ziel erreicht hat. Die Verschlüsselung dauert also nur solange an, wie sich die Nachricht auf dem Weg befindet.

source: &kmail; supports this mode half-heartedly, since such functionality should better placed at the mail <emphasis>server</emphasis> (<acronym>MTA</acronym>) than at the mail <emphasis>client</emphasis> (<acronym>MUA</acronym>) level. Thus, future versions of &kmail; may drop support for this option.
de: &kmail; unterstützt diesen Modus halbherzig, weil solche Funktionalität besser im E-Mail-<emphasis>Server</emphasis> (<acronym>MTA</acronym>) als im E-Mail-<emphasis>Klient</emphasis> (<acronym>MUA</acronym>) implementiert sein sollte. Zukünftige Versionen von &kmail; werden diese Option daher möglicherweise nicht mehr enthalten.

source: If checked, messages are stored in your <guilabel>sent-mail</guilabel> folder just as you sent them (&ie; if they were encrypted, they are also stored that way).
de: Wenn diese Option angewählt ist, werden Nachrichten in Ihrem Ordner <guilabel>Versendete Nachrichten</guilabel> so gespeichert, wie Sie sie verschickt haben (d.h., wenn sie verschlüsselt verschickt worden sind, dann werden sie auch so gespeichert).

source: If unchecked, messages will <emphasis>always</emphasis> be stored unencrypted in your <guilabel>sent-mail</guilabel> folder, even if they are sent encrypted.
de: Wenn diese Option abgewählt ist, dann werden Nachrichten <emphasis>immer</emphasis> unverschlüsselt in Ihrem Ordner <guilabel>Versendete Nachrichten</guilabel> gespeichert, auch wenn sie verschlüsselt verschickt worden sind.

source: Always show the encryption keys for approval
de: Verschlüsselungsschlüssel immer zur Bestätigung anzeigen.

source: If checked, every time you encrypt a message, a dialog will appear that presents you with the encryption keys that will be used for each recipient. You can then review the choice of keys, change them, and approve or cancel the encryption operation. We recommend to keep this option checked, since it makes the encryption process more transparent.
de: Wenn diese Option angewählt ist, dann erscheint bei jedem Verschlüsseln einer Nachricht ein Dialog, der Ihnen die Verschlüsselungsschlüssel anzeigt, die für die einzelnen Empfänger verwendet werden. Sie können dieses prüfen, verändern, und dann die Verschlüsselungsoperation bestätigen oder abbrechen. Wir empfehlen, diese Option anzuwählen, weil sie den Verschlüsselungsprozess transparenter macht.

source: Automatically encrypt messages whenever possible
de: Nachrichten möglichst automatisch verschlüsseln

source: Also called <quote>opportunistic encryption</quote>. If checked, &kmail; will try to match recipients to (&openpgp; or &smime;) keys even when you did <emphasis>not</emphasis> specifically request encryption. If usable keys are found for all recipients, &kmail; will ask whether or not you want to encrypt the message.
de: Wird auch <quote>opportunistische Verschlüsselung</quote> genannt. Wenn diese Option angewählt ist, dann versucht &kmail; den Empfängern &openpgp;- oder &smime;-Schlüssel zuzuordnen, auch wenn Sie <emphasis>nicht</emphasis> ausdrücklich Verschlüsselung angefordert haben. Wenn für alle Empfänger passende Schlüssel vorhanden sind, fragt &kmail; Sie, ob Sie diese Nachricht verschlüsseln wollen oder nicht.

source: It is highly recommended to turn this on, as it makes encrypting messages really easy to use.
de: Wir empfehlen dringend, diese Option einzuschalten, weil sie das Verschlüsseln von Nachrichten wirklich stark vereinfacht.

source: Never sign/encrypt when saving as draft
de: Nachrichten beim Speichern als Entwurf niemals signieren/verschlüsseln

source: If checked, &kmail; will not attempt to sign and/or encrypt messages that are merely saved to the <guilabel>drafts</guilabel> folder. This is more convenient, and does not result in a gross loss of security, provided the drafts folder is safe. &imap; users might want this option turned off, if their <guilabel>drafts</guilabel> folder is on the server.
de: Wenn diese Option angewählt ist, versucht &kmail; nicht, Nachrichten zu signieren und/oder zu verschlüsseln, die lediglich im <guilabel>Entwürfe</guilabel>-Ordner gespeichert werden. Dies ist bequemer und kein großes Sicherheitsproblem, sofern der Entwürfe-Ordner nicht kompromittiert wird. &imap;-Benutzer sollten diese Option abschalten, wenn sich ihr <guilabel>Entwürfe</guilabel>-Ordner auf dem Server befindet.

source: Miscellaneous
de: Verschiedenes

source: On this tab you can switch security-relevant warnings on and off.
de: Auf dieser Karteikarte können Sie sicherheitsrelevante Warnungen ein- und ausschalten.

source: Warn when trying to send unsigned messages
de: Vor dem Versand unsignierter Nachrichten warnen

source: If checked, &kmail; will show a warning if for whatever reason a message would be sent without being digitally signed.
de: Wenn diese Option angewählt ist, zeigt &kmail; eine Warnung an, wenn eine Nachricht aus beliebigem Grund ohne digitale Signatur versendet werden soll.

source: Warn when trying to send unencrypted messages
de: Vor dem Versand unverschlüsselter Nachrichten warnen

source: If checked, &kmail; will show a warning if for whatever reason a message would be sent without being encrypted.
de: Wenn diese Option angewählt ist, zeigt &kmail; eine Warnung an, wenn aus irgendeinem Grund eine unverschlüsselte Nachricht versendet werden soll.
