Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdepim/kmail_using-kmail.po
Languages: de

source: <para>Folder Setup Example</para>
de: <para>Beispiel der Ordnereinrichtung</para>

source: Message Folders are used to organize your email messages. When you first start &kmail; the <quote>Local Folders</quote> containing <guilabel>inbox</guilabel>, <guilabel>outbox</guilabel>, <guilabel>sent-mail</guilabel>, <guilabel>trash</guilabel>, <guilabel>drafts</guilabel> and <guilabel>templates</guilabel> folders are created. These folders each have special functions:
de: Nachrichtenordner sind nützlich, um Ihre E-Mails zu organisieren. Beim ersten Start von &kmail; wird der <quote>Lokale Ordner</quote> mit den Einträgen <guilabel>Posteingang</guilabel>, <guilabel>Postausgang</guilabel>, <guilabel>Gesendete Nachrichten</guilabel>, <guilabel>Papierkorb</guilabel>, <guilabel>Entwürfe</guilabel> und <guilabel>Vorlagen</guilabel> automatisch angelegt. Diese Ordner haben spezielle Funktionen:

source: inbox:
de: Posteingang:

source: Where &kmail; by default puts your new messages when you ask it to check your mail.
de: Hier legt &kmail; Ihre neu abgeholten Nachrichten ab.

source: &imap; accounts will not use this inbox. The inbox is located on the &imap; server.
de: Bei &imap;-Postfächern wird dieser Ordner nicht benutzt. Der Posteingang befindet sich auf dem &imap;-Server.

source: outbox:
de: Postausgang:

source: Where messages are put while they are waiting to be delivered. Note that you should not drag and drop messages here to send them, use the <guiicon>Send</guiicon> icon in the composer window instead.
de: Hier werden Nachrichten zwischengespeichert, die für den Versand bestimmt sind. Man sollte hierhin keine Nachrichten verschieben, sondern stattdessen das Symbol <guiicon>Senden</guiicon> im Editor-Fenster verwenden.

source: sent-mail:
de: Gesendete Nachrichten:

source: By default copies of all messages that you have sent are put into this folder.
de: Enthält in der Voreinstellung Kopien von allen versandten Nachrichten.

source: trash:
de: Papierkorb:

source: By default all messages that you have moved to trash are moved into this folder.
de: Enthält in der Voreinstellung alle Nachrichten, die Sie in den Papierkorb verschoben haben.

source: drafts:
de: Entwürfe:

source: Contains messages you started to edit but then saved to this folder through <menuchoice><guimenu>Message</guimenu><guimenuitem>Save as Draft</guimenuitem></menuchoice>.
de: Enthält Nachrichten, deren Bearbeitung Sie begonnen haben, aber dann in diesen Ordner mit <menuchoice><guimenu>Nachricht</guimenu><guimenuitem>Als Entwurf speichern</guimenuitem></menuchoice> abgelegt haben.

source: templates:
de: Vorlagen:

source: This folder holds your templates created via <menuchoice><guimenu>Message</guimenu><guimenuitem>Save as Template</guimenuitem></menuchoice> in the composer window. Please see <link linkend="new-compose-from-templates">New Composer Templates</link> for details.
de: Dieser Ordner enthält alle Vorlagen, die mit <menuchoice><guimenu>Nachricht</guimenu><guimenuitem>Als Vorlage speichern</guimenuitem></menuchoice> im Editorfenster erstellt wurden. Weitere Einzelheiten finden Sie im Abschnitt <link linkend="new-compose-from-templates">Neue Vorlagen</link>.

source: Creating and Using Folders
de: Ordner erstellen und benutzen

source: Organize your emails, &eg; by mailing lists, bill receipts &etc;, by creating new folders. To create a new folder, select <menuchoice><guimenu>Folder</guimenu><guimenuitem>Add Folder...</guimenuitem></menuchoice> or <guimenuitem>Add Folder...</guimenuitem> from the &RMB; context menu. A dialog will pop up, enter the name of the new folder in the text box. You can fully customize each folder &eg; views, replies, &etc; in the properties for a folder by selecting the folder you wish to modify in the folders pane and select <guimenuitem>Folder Properties</guimenuitem> from the &RMB; context menu. See <link linkend="folders-properties-window">Properties of Folder</link> for details.
de: Organisieren Sie Ihre E-Mails &eg; nach Mailinglisten, Betreff &etc; durch Erstellen neuer Ordner. Dazu wählen Sie <menuchoice><guimenu>Ordner</guimenu><guimenuitem>Ordner hinzufügen ...</guimenuitem></menuchoice> oder diese Aktion aus dem Kontextmenü eines Ordners. Dann tragen Sie den Namen des neuen Ordners im Dialog ein. Sie können die Einstellungen eines Ordners wie &eg; Ansicht, Antworten &etc; ändern, indem Sie zum Ordner gehen und dann im Kontextmenü <guimenuitem>Ordner-Eigenschaften</guimenuitem> auswählen. Weitere Informationen dazu finden Sie im Abschnitt <link linkend="folders-properties-window">Ordner-Eigenschaften</link>.

source: To move messages from one folder into another, select the message(s) you want to move and press the <keycap>M</keycap> key or select <menuchoice><guimenu>Message</guimenu><guimenuitem>Move Messages To</guimenuitem></menuchoice>. A list of folders will appear; select the folder from the list that you want to move the messages to. Messages can also be moved by dragging them from the Message list to a folder in the Folder list.
de: Um Nachrichten von einem Ordner in einen anderen zu verschieben, wählen Sie diese aus und drücken dann die Taste <keycap>M</keycap> oder wählen <menuchoice><guimenu>Nachricht</guimenu><guimenuitem>Nachricht verschieben nach </guimenuitem></menuchoice> Geben Sie den gewünschten Zielordner an. Alternativ können Sie die Nachrichten auch mit der Maus aus dem Vorspannbereich auf den gewünschten Ordner in der Liste ziehen.

source: If you have folders that are frequently accessed, you can add them to your favorite folders pane in the upper left corner. Add them through the &RMB; context menu <guimenuitem>Add to Favorite Folders</guimenuitem>.
de: Haben Sie einige Ordner, die Sie häufig benutzen, dann fügen Sie sie zu den bevorzugten Ordnern links oben in der Ordnerliste hinzu. Dazu wählen Sie aus dem Kontextmenü eines Ordners <guimenuitem>Zu bevorzugten Ordnern hinzufügen</guimenuitem>.

source: You can create a virtual folder with search parameters by going to either <menuchoice><guimenu>Edit</guimenu><guimenuitem>Find Messages...</guimenuitem></menuchoice>, <menuchoice><guimenu>Tools</guimenu> <guimenuitem>Find Messages...</guimenuitem></menuchoice>, or Keyboard shortcut <keycap>S</keycap>. Enter your search parameters into the dialog. Name your search at the bottom <guilabel>Search folder name:</guilabel> textbox, &eg; <replaceable>emails with the word Blog</replaceable>. Click the <guibutton>Search</guibutton> button. Now select the <guibutton>Open Search Folder</guibutton>. Your results folder will be at the bottom of the Folder pane.
de: Sie können eine virtuellen Ordner mit Suchparametern erstellen, indem Sie entweder <menuchoice><guimenu>Bearbeiten</guimenu><guimenuitem>Nachrichten suchen ...</guimenuitem></menuchoice>, <menuchoice><guimenu>Extras</guimenu> <guimenuitem>Nachrichten suchen ...</guimenuitem></menuchoice> im Menü oder den Kurzbefehl <keycap>S</keycap> verwenden. Geben Sie dann die Parameter für die Suche im Dialog ein. Unten im Dialog können Sie im Feld <guilabel>Suchordner-Name</guilabel> eine aussagekräftige Bezeichnung eintragen, &eg;<replaceable>E-Mails mit dem Wort Blog</replaceable>. Klicken Sie dann auf den Knopf <guibutton>Suchen</guibutton> und wählen Sie <guibutton>Suchordner öffnen</guibutton>. Das Ergebnis der Suche erscheint dann unten in der Ordnerliste.

source: Creating filters to automatically move messages to specified folders is a great way to organize messages by mailing list, sender, subject &etc; Please see <link linkend="filters">Filters</link> for details.
de: Mit Filtern, die Nachrichten automatisch in angegeben Ordner verschieben, können Sie Ihre Nachrichten nach Mailinglisten, Absender, Betreff &etc; organisieren. Lesen Sie dazu den Abschnitt <link linkend="filters">Filter</link>.

source: In the case that you receive emails from a trusted source, &eg; a Blog you signed up for, that is formatted in &HTML; and you would like to enable &HTML; view for just those emails. You can achieve this by doing the following: Create a new folder, set up a <link linkend="filters">filter</link> to place those emails in the new folder, select the folder and select <menuchoice><guimenu>Folder</guimenu><guimenuitem>Prefer &HTML; to Plain Text</guimenuitem></menuchoice>.
de: Erhalten Sie aus einer vertrauenswürdigen Quelle E-Mails, die als &HTML; formatiert sind und die auch im &HTML;-Format angezeigt werden sollen, dann erstellen Sie für diese E-Mails einen neuen Ordner. Richten Sie einen <link linkend="filters">Filter</link> ein, mit dem die Nachrichten in den neuen Ordner verschoben werden. Klicken Sie auf diesen Ordner und wählen aus dem Menü <menuchoice><guimenu>Ordner</guimenu><guimenuitem>&HTML;-Ansicht vor Klartext bevorzugen</guimenuitem></menuchoice>.

source: Some common folder actions are:
de: Dies sind die am meisten benutzen Aktionen für Ordner:

source: <guimenu>Folder</guimenu><guimenuitem>Move All Messages to Trash</guimenuitem>
de: <guimenu>Ordner</guimenu> <guimenuitem>Alle Nachrichten in den Papierkorb werfen</guimenuitem>

source: <action>Moves</action> all your messages in the selected folder to the trash folder.
de: <action>Verschiebt</action> alle Nachrichten im ausgewählten Ordner in den Papierkorb.

source: <guimenu>Folder</guimenu><guimenuitem>Archive Folder</guimenuitem>
de: <guimenu>Ordner</guimenu> <guimenuitem>Ordner archivieren ...</guimenuitem>

source: <action>Create an archive</action> of the folder. See <link linkend="folder-archive">Archive Folder</link> for details.
de: <action>Erstellt ein Archiv</action> eines Ordners. Weitere Informationen dazu im Abschnitt <link linkend="folder-archive">Ordner archivieren</link>.

source: <guimenu>Folder</guimenu><guimenuitem>Delete Folder</guimenuitem>
de: <guimenu>Ordner</guimenu> <guimenuitem>Ordner löschen</guimenuitem>

source: <action>Remove a folder</action> with all its messages and sub-folders.
de: <action>Löscht einen Ordner</action> mit allen darin enthaltenen Nachrichten und Unterordnern-

source: <guimenu>Folder</guimenu><guimenuitem>Remove Duplicate Messages</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>*</keycap></keycombo></shortcut> <guimenu>Ordner</guimenu> <guimenuitem>Doppelte Nachrichten entfernen</guimenuitem>

source: This will <action>search</action> the currently selected folder for duplicates and <action>delete</action> them.
de: Dies <action>durchsucht</action> den aktuell ausgewählten Ordner nach doppelten Nachrichten und <action>löscht</action> sie.

source: Folder Properties
de: Ordner-Eigenschaften

source: <screeninfo>Folder Properties Example</screeninfo>
de: <screeninfo>Beispiel für Ordner-Eigenschaften</screeninfo>

source: <phrase>Folder Properties Example</phrase>
de: <phrase>Beispiel für Ordner-Eigenschaften</phrase>

source: <para>Folder Properties Example</para>
de: <para>Beispiel für Ordner-Eigenschaften</para>

source: The <guilabel>Properties of Folder</guilabel> dialog lets you rename and specify all of its properties. Note that most properties are only available for your own folders and not for default folder like <guilabel>inbox</guilabel> &etc; Default folders also cannot be renamed.
de: Der Dialog <guilabel>Eigenschaften des Ordners</guilabel> erlaubt neben Umbenennen die Angabe aller anderen Eigenschaften des Ordners. Die meisten Eigenschaften sind nur für eigene Ordner und nicht für Standardordner wie <guilabel>inbox</guilabel> &etc; verfügbar. Standardordner können auch nicht umbenannt werden.

source: General
de: Allgemein

source: If you need to rename a folder change the entry in the <guilabel>Name:</guilabel> field.
de: Möchten Sie einen Ordner Umbenennen, ändern Sie den Eintrag im Feld <guilabel>Name:</guilabel>.

source: <guilabel>Act on new/unread mail in this folder</guilabel> is enabled by default on new folders, it allows notifications about new mail that arrives in the folder. Uncheck this option on folders like SPAM and trash that you do not desire notifications.
de: Als Voreinstellung ist bei neuen Ordnern <guilabel>Aktion bei neuen/ungelesenen Nachrichten in diesem Ordner</guilabel> eingeschaltet, damit Sie darüber informiert werden, wenn neue Nachrichten in diesem Ordner eintreffen. Das sollten Sie zum Beispiel für Ordner mit Spam oder den Papierkorb abschalten, da hier eine Benachrichtigung normalerweise nur stört.

source: When replying to messages in this folder, check <guilabel>Keep replies in this folder</guilabel> if you want the replies to be stored in this folder rather than into the default configured sent-mail folder.
de: Wählen Sie <guilabel>Antworten in diesem Ordner aufbewahren</guilabel> aus, wenn Sie möchten, dass Antworten auf Nachrichten in diesem Ordner ebenfalls in diesem Ordner abgelegt werden, anstatt in den speziellen Ordner für gesendete Nachrichten verschoben zu werden.

source: Check <guilabel>Hide this folder in the folder selection dialog</guilabel> if you do not want this folder to be shown in folder selection dialogs, such as the <guimenuitem>Jump to Folder</guimenuitem> and <guimenuitem>Move Message to</guimenuitem> dialogs.
de: Wählen Sie die Einstellung <guilabel>Diesen Ordner im Ordner-Auswahldialog ausblenden</guilabel>, so wird der Ordner nicht in Ordner-Auswahldialogen angezeigt, wie z. B. im Dialog <guimenuitem>In Ordner wechseln</guimenuitem> und <guimenuitem>Nachricht verschieben nach</guimenuitem>.

source: By default new folders use the default identity. Uncheck <guilabel>Use default identity</guilabel> and select a new one from the <guilabel>Sender identity</guilabel> drop down menu. See <link linkend="configure-identity">Identities configuration</link> for information on Identities. Replies to messages that were sent directly to you will still default to the message's <quote>To</quote> address if an according identity is found.
de: Neue Ordner verwenden immer die Standard-Identität. Um dies zu ändern, schalten Sie <guilabel>Standard-Identität verwenden</guilabel> ab und wählen eine andere im Auswahlfeld <guilabel>Absender-Identität</guilabel>. Weitere Informationen zu Identitäten finden Sie im <link linkend="configure-identity">Einrichtungsdialog</link>. Für Antworten auf Nachrichten wird standardmäßig dennoch die im Feld <quote>An</quote> angegebene Adresse verwandt, falls eine entsprechende Identität existiert.

source: If you have groupware, you can change the contents &eg; calendar, notes, &etc; of the folder in the <guilabel>Folder contents:</guilabel> drop down box.
de: Benutzen Sie eine Groupware, können Sie den Inhalt &eg; von Kalender, Notizen &etc; des Ordners im Auswahlfeld <guilabel>Ordnerinhalt</guilabel> ändern.

source: If you share the folder with other users, you can <guilabel>Share unread state with all users</guilabel> which will show the same unread state for all users.
de: Benutzen Sie den Ordner gemeinsam mit anderen Benutzern, können Sie <guilabel>Status „Ungelesen“ mit allen Benutzern teilen</guilabel> aktivieren, so dass dieser Status für alle gleich ist.

source: For example, a ticket system that all emails must be read and multiple users are responsible for reading unread tickets.
de: Dies kann zum Beispiel bei einem System für Kundenanfragen benutzt werden, das von mehreren Personen bearbeite wird und bei dem alle E-Mails gelesen und bearbeitet werden müssen.

source: View
de: Ansicht

source: The <guilabel>Use custom icons</guilabel> option lets you choose icons that are different from the default ones in the folder list.
de: Die Einstellung <guilabel>Eigene Symbole verwenden</guilabel> erlaubt die Auswahl von eigenen Symbolen zur Darstellung in der Ordnerliste.

source: With <guilabel>Show column</guilabel> drop down you can set the visible columns in the header pane to Default, Sender, or Receiver. This is useful if you use a folder to save your own sent messages.
de: Mit <guilabel>Spalten anzeigen</guilabel> kann man die sichtbaren Spalten des Vorspannbereiches auf <guilabel>Standard</guilabel>, <guilabel>Sender</guilabel> oder <guilabel>Empfänger</guilabel> ändern. Das ist nützlich, falls man einen Ordner zur Speicherung von eigenen versandten Nachrichten nutzen will.

source: In the <guilabel>Message List</guilabel> section you can select and configure an <guilabel>Aggregation</guilabel> and <guilabel>Theme</guilabel> for this folder different from the default configured in &kmail;s settings. For more details see the <link linkend="configure-appearance-message-list"> Message List</link> tab in the <guilabel>Appearance</guilabel> page.
de: Im Bereich <guilabel>Nachrichtenliste</guilabel> können Sie eine <guilabel>Zusammenstellung</guilabel> und ein <guilabel>Design</guilabel> für diesen Ordner auswählen und einrichten, abweichen von den Standardeinstellungen im Einrichtungsdialog von &kmail;. Mehr Informationen dazu finden Sie auf der Karteikarte <link linkend="configure-appearance-message-list">Nachrichtenliste</link> auf der Seite <guilabel>Erscheinungsbild</guilabel>.

source: Retrieval
de: Abruf

source: If you have an account that does not receive much mail and you don't want &kmail; to query the server as often, you can uncheck <guilabel>Use options from parent folder or account</guilabel> to set a higher interval in <guilabel>Automatically synchronize after:</guilabel> spin box.
de: Haben Sie ein Postfach, in dem Sie nur wenige Nachrichten erhalten und für das Sie daher den Server nicht so häufig abfragen möchten, deaktivieren Sie <guilabel>Einstellungen des Elternordners oder Postfachs verwenden</guilabel> und wählen im Drehfeld <guilabel>Automatisch abgleichen nach</guilabel> ein größeres Zeitintervall.

source: In <guilabel>Retrieval Options</guilabel> you can change <guilabel>Always retrieve full messages</guilabel> option to <guilabel>Retrieve message bodies on demand</guilabel> if you have a slow connection. You can set how long the message will remain locally in the following spin box.
de: Die <guilabel>Abrufeinstellungen</guilabel> können Sie von <guilabel>Immer vollständige Nachrichten abrufen</guilabel> zu <guilabel>Nachrichteninhalt nach Bedarf abrufen</guilabel> ändern, wenn Sie eine langsame Verbindung benutzen. Im Drehfeld können Sie einstellen, wie lange eine Nachricht lokal vorgehalten wird.

source: Templates
de: Vorlagen

source: On this tab you can define folder-specific templates for your custom folders. For more details see the <link linkend="configure-composer-standard-templates"> Standard Templates</link> tab in the <guilabel>Composer</guilabel> page
de: Auf dieser Karteikarte können Sie Vorlagen für Ihre eigenen Ordner festlegen. Weitere Informationen finden Sie auf der Karteikarte <link linkend="configure-composer-standard-templates">Standard-Vorlagen</link> auf der Seite <guilabel>E-Mail-Editor</guilabel>.

source: Expiry
de: Ablauf

source: You can set automatic cleanup or deletion of emails in this tab. Check the box if you would like to automatically expire read or unread messages respectively. Set the amount of days in the spinbox. If you do not want to permanently delete the messages you can assign a folder to move them to in <guilabel>Move expired messages to:</guilabel> textbox or folder selection dialog. Once you have reviewed the messages and want to permanently delete them, you can go to the folder expiry options of the folder you chose to move them to and set the option <guilabel>Delete expired messages permanently</guilabel>, then click the <guibutton>Save Settings and Expire Now</guibutton>.
de: Auf dieser Karteikarte können Sie das automatische Aufräumen und Löschen von E-Mails einstellen. Kreuzen Sie die entsprechenden Einstellungen an, wenn gelesene und ungelesene Nachrichten automatisch ablaufen sollen und stellen Sie einen passenden Zeitraum im Drehfeld ein. Möchten Sie die E-Mails nach dem Ablauf nicht löschen, können Sie einen Ordner angeben, in den die Nachrichten dann verschoben werden. Haben Sie Nachrichten in einem Ordner bearbeitet und möchten Sie tatsächlich löschen, gehen Sie zu den Ablauf-Einstellungen des gewählten Ordner, wählen <guilabel>Abgelaufene Nachrichten endgültig löschen</guilabel> und klicken Sie auf den Knopf <guibutton>Einstellungen speichern und jetzt ablaufen</guibutton>.

source: Messages that are deleted during expiration of old messages cannot be restored, so be careful with this setting.
de: Verfallene Nachrichten werden gelöscht. Sie werden <emphasis>nicht</emphasis> in den Papierkorb verschoben. Daher sollte man diese Einstellung mit Bedacht einsetzen.

source: Access Control tab (&imap; only)
de: Zugriffskontrolle (nur &imap;)

source: Here you can manage the access control lists (&acl;s) of &imap; folders.
de: Hier können Sie die Zugriffskontrolllisten (&acl;s) von &imap;-Ordnern verwalten.

source: The &imap; server must have user level &acl; configured and enabled for this tab to be visible.
de: Auf dem &imap;-Server müssen Zugriffskontrolllisten (&acl;) auf Benutzerebene eingerichtet und aktiviert sein, damit diese Karteikarte angezeigt wird.

source: The currently active &acl; is shown in the list. It consists of pairs of <guilabel>User Id</guilabel>s and the <guilabel>Permissions</guilabel> granted to users identified by that <guilabel>User Id</guilabel>. <footnote> <para>Note that a single <guilabel>User Id</guilabel> might refer to more than one user. Depending on the &imap; server and its configuration, there may be User Ids that correspond to groups of users, anonymous users, or any user. Consult the manual of your specific &imap; server implementation for more information.</para> </footnote> &acl;s are settable per-folder.
de: Die derzeit aktive &acl; wird in der Liste angezeigt. Sie besteht aus Paaren aus <guilabel>Benutzerkennung</guilabel>s und den <guilabel>Zugriffsrechten</guilabel>, die den Benutzern gewährt werden, die mit dieser <guilabel>Benutzerkennung</guilabel> identifiziert werden. <footnote><para>Beachten Sie, dass eine einzelne <guilabel>Benutzerkennung</guilabel> für mehr als einen Benutzer stehen kann. Je nach &imap;-Server und dessen Konfiguration kann es Benutzerkennungen geben, die für Benutzergruppen, anonyme Benutzer oder beliebige Benutzer stehen. Schlagen Sie im Handbuch Ihres jeweiligen &imap;-Servers nach, um weitere Informationen zu erhalten.</para></footnote> &acl;s werden per Ordner eingestellt.

source: As with everything else when using <emphasis>disconnected &imap;</emphasis>, you need to sync with the server for the changes to be transferred to the server.
de: Wie sonst auch, wenn <emphasis>Disconnected &imap;</emphasis> verwendet wird, müssen Sie einen Abgleich mit dem Server durchführen, damit die Änderungen an den Server übertragen werden.

source: &imap; &acl;s define a lot of fine-grained permissions that you can grant or deny other users. For the sake of clarity, &kmail; will present them as the following five categories that you can choose from (see <xref linkend="table-acl-summary"/> for the details if you already know &imap; &acl;s).
de: &imap;-&acl;s definieren viele fein abgestufte Zugriffsrechte, die Sie anderen Benutzern gewähren oder verweigern können. Aus Gründen der Übersichtlichkeit stellt &kmail; diese als die folgenden fünf Kategorien dar, aus denen Sie auswählen können (unter <xref linkend="table-acl-summary"/> finden Sie die Details, wenn Sie sich schon mit &imap;-&acl;s auskennen).

source: None
de: Keine
