Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdepim/kmail_using-kmail.po
Languages: de

source: Grants the users identified by <guilabel>User Id</guilabel> no rights at all. This is also the default for users not explicitly (or implicitly, as a group) listed in the &acl;. These users will not see this folder in the list of &imap; folders presented to them by their mail clients.
de: Verweigert allen durch die <guilabel>Benutzerkennung</guilabel> identifizierten Benutzern alle Zugriffsrechte. Dies ist auch die Voreinstellung für Benutzer, die nicht explizit (oder implizit als eine Gruppe) in der &acl; aufgeführt sind. Diese Benutzer bekommen diesen Ordner in der Liste der &imap;-Ordner in ihrem E-Mail-Klienten nicht zu sehen.

source: <guilabel>Read</guilabel>
de: <guilabel>Lesen</guilabel>

source: Grants the users identified by <guilabel>User Id</guilabel> reading rights for this folder. This also includes the ability for their mail clients to mark mails as read and store this information on the server.
de: Gewährt allen durch die <guilabel>Benutzerkennung</guilabel> identifizierten Benutzern Leserechte auf diesen Ordner. Dazu gehört auch die Möglichkeit, Nachrichten als gelesen zu markieren und diese Informationen auf dem Server abzulegen.

source: Every user has their own list of read mail, so none of your unread mails will suddenly be marked as read just because someone else has already read them.
de: Jeder Benutzer hat eine eigene Liste gelesener Nachrichten, sodass Ihre eigenen ungelesenen Nachrichten nicht einfach als gelesen markiert werden, nur weil jemand anders sie gelesen hat.

source: These users will see this folder in the list of &imap; folders presented to them by their mail clients.
de: Diese Benutzer werden diesen Ordner in der Liste der &imap;-Ordner sehen, die ihre E-Mail-Klienten ihnen anzeigen.

source: Use this to create a shared folder that others can read, but not modify.
de: Benutzen Sie diese Einstellung, um einen gemeinsam genutzten Ordner anzulegen, den andere lesen, aber nicht verändern können.

source: If you were the editor of a company's news letter, you could create a folder for the purpose of distributing the news letter, grant everyone reading rights, and save the letter to this folder instead of sending it out by email to a catch-all address.
de: Wenn Sie beispielsweise der Redakteur eines Firmenrundbriefs sind, könnten Sie einen Ordner zur Verteilung dieses Rundbriefs anlegen, allen Leserechte darauf geben, und den Rundbrief in diesem Ordner ablegen, anstatt ihn als Nachricht an alle Adressen zu versenden.

source: Append
de: Anhängen

source: (also known as <guilabel>Post</guilabel>)
de: (auch als <guilabel>Posten</guilabel> bekannt)

source: Grants the users identified by <guilabel>User Id</guilabel> reading (see above) and posting rights for this folder.
de: Gewährt allen durch die <guilabel>Benutzerkennung</guilabel> identifizierten Benutzern Lese- (siehe oben) und Anhängerechte für diesen Ordner.

source: Use this to create a shared folder that others can read and post messages to, but cannot otherwise modify.
de: Benutzen Sie diese Einstellung, um einen gemeinsam genutzten Ordner zu bekommen, den andere lesen, und in den sie Nachrichten ablegen können, den sie aber nicht anderweitig verändern können.

source: If you wanted to create a company-wide discussion forum, instead of using a web-based form or a separate company-private usenet server, you could create a bunch of folders (one per topic), and grant everyone reading and posting rights. Instead of posting to an &nntp; server or writing their messages into a web form, people would just write emails and store them in the folder suiting the topic of the message.
de: Wenn Sie eine firmenweites Diskussionsforum anlegen wollen und kein Web-Formular oder einen firmeninternen Usenet-Server einrichten wollen, könnten Sie eine Reihe von Ordnern (einen per Thema) einrichten und allen Lese- und Anhängerechte darauf gewähren. Anstatt auf einem &nntp;-Server zu posten oder seine Nachrichten in einem Web-Formular einzutragen, würden alle Mitarbeiter einfach Nachrichten schreiben und in dem zum Thema passenden Ordner ablegen.

source: Write
de: Schreiben

source: Grants the users identified by <guilabel>User Id</guilabel> reading, posting (see above), and writing rights for this folder.
de: Gewährt allen durch die <guilabel>Benutzerkennung</guilabel> identifizierten Benutzern Lese-, Anhänge- (siehe oben) und Schreibrechte auf diesen Ordner.

source: The right to write to a folder includes deleting of messages, creating subfolders, and storing other attributes than read/unread on the server (&eg; answered).
de: Das Recht, in einen Ordner zu schreiben, beinhaltet das Löschen von Nachrichten, das Anlegen von Unterordnern und das Speichern anderer Attribute als gelesen/ungelesen auf dem Server (etwa <quote>beantwortet</quote>).

source: Use this to create a shared folder that everyone has (almost, see <xref linkend="folders-properties-acl-all"/>) the same rights for.
de: Benutzen Sie diese Einstellung, um einen gemeinsam genutzten Ordner zu bekommen, auf den jeder (fast, siehe <xref linkend="folders-properties-acl-all"/>) die gleichen Rechte hat.

source: In the <xref linkend="folders-properties-acl-append"/> example, you could assign write rights to a group of people acting as moderators, which would then be able to remove off-topic posts, and create sub-topic-folders for high-traffic folders.
de: Im Beispiel <xref linkend="folders-properties-acl-append"/> könnten Sie eine Reihe von Leuten, die als Moderatoren dienen, Schreibrechte einräumen. Diese könnten dann Nachrichten, die nicht zum Thema passen, entfernen, und Unterordner in besonders eifrig genutzten Ordnern anlegen.

source: <guilabel>All</guilabel>
de: <guilabel>Alle</guilabel>

source: Grants the users identified by <guilabel>User Id</guilabel> reading, posting, writing (see above), as well as administration rights, &ie; the right to modify the &acl; of this folder.
de: Gewährt allen durch die <guilabel>Benutzerkennung</guilabel> identifizierten Benutzern Lese-, Anhänge-, Schreib- (siehe oben) und Verwaltungsrechte, d.h. das Recht, die &acl; dieses Ordners zu verändern.

source: This is the default set of rights for the owner of a folder.
de: Dies ist die Voreinstellung für den Besitzer eines Ordners.

source: summarizes the &imap; &acl; rights associated with each permission level.
de: fasst die &imap;-&acl;-Zugriffsrechte für jedes Stufe zusammen.

source: &acl; Rights Summary
de: &acl;-Rechteübersicht

source: &acl; right
de: &acl;-Recht

source: Lookup
de: Nachschlagen

source: <entry>Read</entry>
de: <entry>Lesen</entry>

source: Store Seen
de: Gelesen speichern

source: Insert
de: Einfügen

source: Post
de: Posten

source: Write Flags
de: Schalter schreiben

source: Create
de: Anlegen

source: Delete
de: Löschen

source: Administer
de: Verwalten

source: Mailing List
de: Mailinglisten

source: If you are going to use the folder for a mailing list open the <guilabel>Mailinglist Folder Properties</guilabel> dialog with <menuchoice><guimenu>Folder</guimenu> <guimenuitem>Mailing List Management</guimenuitem> </menuchoice> from the menu. Then you should check <guilabel>Folder holds a mailing list</guilabel> to associate this folder with the mailing list. Next you should click on <guilabel>Detect Automatically</guilabel>. &kmail; will then try to guess some information about the mailing list from the currently selected message. If &kmail; could not determine some addresses then you can add the missing information manually. To do this first select the <guilabel>Address type</guilabel> for which you want to add an address. You can choose between:
de: Wenn Sie den Ordner für eine Mailingliste verwenden möchten, öffnen Sie den Dialog <guilabel>Mailinglistenordner-Eigenschaften</guilabel> mit <menuchoice><guimenu>Ordner</guimenu> <guimenuitem>Verwaltung von Mailinglisten</guimenuitem> </menuchoice> im Menü. Wählen Sie dann <guilabel>Ordner enthält eine Mailingliste</guilabel> sowie auf <guilabel>Automatisch feststellen</guilabel>. &kmail; versucht dann Informationen über die Mailingliste anhand der aktuell ausgewählten Nachricht zu ermitteln. Wenn &kmail; einige der Adressen nicht ermitteln kann, können Sie die fehlenden Informationen von Hand nachtragen. Dazu wählen Sie zunächst den <guilabel>Adresstyp</guilabel> aus, für den Sie eine Adresse hinzufügen wollen. Sie haben die folgenden Wahlmöglichkeiten:

source: Post to List
de: An Liste senden

source: This address is used for sending messages to the mailing list. This is usually an email address.
de: Diese Adresse wird zum Versenden von Nachrichten an die Mailingliste ausgewählt. Dies ist normalerweise eine E-Mail-Adresse.

source: Subscribe to List
de: Mailingliste abonnieren

source: This address is used for subscribing to the mailing list. This can be an email address or the address of a web page.
de: Diese Adresse wird verwendet, um eine Mailingliste zu abonnieren. Dies kann eine E-Mail-Adresse oder die Adresse einer Webseite sein.

source: Unsubscribe From List
de: Abonnement kündigen

source: This address is used for unsubscribing from the mailing list. This can be an email address or the address of a web page.
de: Diese Adresse wird verwendet, um eine Mailingliste abzubestellen. Dies kann eine E-Mail-Adresse oder die Adresse einer Webseite sein.

source: List Archives
de: Mailinglisten-Archive

source: This is the address of the archive of the mailing list. This is usually the address of a web page.
de: Dies ist die Adresse des Archivs der Mailingliste. Dies ist normalerweise die Adresse einer Webseite.

source: List Help
de: Mailinglisten-Hilfe

source: This address is used for requesting help for this mailing list. This is usually an email address.
de: Diese Adresse wird verwendet, um Hilfe für diese Mailingliste anzufordern. Dies ist normalerweise eine E-Mail-Adresse.

source: After selecting the appropriate <guilabel>Address type</guilabel> you enter the email address or the address of the web page and then click on <guilabel>Add</guilabel>. With <guilabel>Remove</guilabel> you can remove addresses.
de: Nachdem Sie den passenden <guilabel>Adresstyp</guilabel> ausgewählt haben, geben Sie die E-Mail-Adresse oder die Adresse der Webseite ein und klicken dann auf <guilabel>Hinzufügen</guilabel>. Mit <guilabel>Entfernen</guilabel> können Sie die Adressen dann wieder entfernen.

source: If all addresses have been added then you can execute an action, &eg; go to the list archives, by selecting the appropriate <guilabel>Address type</guilabel> and then clicking on <guilabel>Invoke Handler</guilabel>. If there is an email address and an address of a web page for the desired action then you will have to select the <guilabel>Preferred handler</guilabel> prior to clicking on <guilabel>Invoke Handler</guilabel>. Select <guilabel>KMail</guilabel> if you want to send a message to the email address and select <guilabel>Browser</guilabel> if you want to go to the web page.
de: Wenn Sie alle Adressen hinzugefügt haben, können Sie eine Aktion ausführen, &eg; das Listenarchiv ansehen, indem Sie den passenden <guilabel>Adresstyp</guilabel> auswählen und dann auf <guilabel>Programm aufrufen</guilabel> klicken. Wenn es für die gewünschte Aktion eine E-Mail-Adresse und eine Adresse einer Webseite gibt, müssen Sie zunächst das <guilabel>Bevorzugte Programm</guilabel> auswählen, bevor Sie auf <guilabel>Programm aufrufen</guilabel> klicken. Wählen Sie <guilabel>KMail</guilabel>, wenn Sie eine Nachricht an die E-Mail-Adresse schicken wollen und <guilabel>Browser</guilabel>, wenn Sie zur Webseite gehen wollen.

source: Alternatively to invoking the handler for <guilabel>Post to List</guilabel> you can send a new message to the mailing list via <menuchoice><guimenu>Message</guimenu><guimenuitem>New Message to Mailing-List...</guimenuitem></menuchoice>
de: Anstatt das Programm für <guilabel>An Liste senden</guilabel> aufzurufen, können Sie mit <menuchoice><guimenu>Nachricht</guimenu><guimenuitem>Neue Nachricht an Mailingliste ...</guimenuitem></menuchoice> ebenfalls eine neue Nachricht an die Mailingliste schicken.

source: Shortcut
de: Kurzbefehl

source: You can define a keyboard shortcut to access the folder.
de: Sie können einen Tastatur-Kurzbefehl für den Zugriff auf diesen Ordner festlegen.

source: Maintenance
de: Wartung

source: This tab shows an overview about the folder type and its size, the number of read and unread messages in the folder and allows you to enable text indexing.
de: Diese Karteikarte zeigt eine Übersicht über die Art des Ordners und seine Größe und die Anzahl der gelesenen und ungelesenen Nachrichten im Ordner. Hier können Sie auch die Textindizierung einschalten.

source: Message Filters
de: Nachrichtenfilter

source: After using &kmail; for a while, you may find that you have trouble sorting out the new messages in your inbox when they arrive. Filters allow you to automatically perform certain actions on incoming messages and to manually perform actions on selected messages in a folder.
de: Wenn Sie &kmail; eine Weile benutzt haben, haben Sie vielleicht Probleme neue Nachrichten in Ihrem Posteingang auszusortieren. Filter erlauben es Ihnen, automatisch bestimmte Aktionen auf eingehende Nachrichten anzuwenden oder manuell auf ausgewählte Nachrichten in einem Ordner.

source: Filters consist of: filter criteria, whose rules are used as criteria to determine whether this filter should be applied to a given message; and a list of filter actions, which describe what is to be done with, or to, the message if the search pattern matches. Read more about filter criteria and filter actions in the following subsections.
de: Filter bestehen aus Suchmustern, deren Regeln bestimmen, ob der Filter auf eine Nachricht angewendet werden soll, und einer Liste von Filteraktionen, die beschreiben, was mit den Nachrichten passieren soll, auf die das Suchmuster zutrifft. Lesen Sie mehr zu Suchmustern und Filteraktionen in den folgenden Unterabschnitten.

source: Filters are considered one after the other, starting with the first filter in the list. The first one whose pattern matches the given message gets executed; you can request that the remaining filters also be applied, but the default is to stop processing at the first matching filter.
de: Filter werden der Reihe nach abgearbeitet, beginnend mit dem ersten Filter in der Liste. Der erste Filter, dessen Muster passt, wird ausgeführt. Sie können wählen, ob nachstehende Filter ebenfalls angewendet werden sollen, aber in der Voreinstellung wird das Anwenden von Filtern für diese Nachricht nach dem ersten passenden Filter angehalten.

source: Usually, filters are used on incoming messages, but they can also be applied to sent messages or to an arbitrary message or group of messages. To selectively filter messages, select the messages you want to filter in the message list and either type <keycombo action="simul">&Ctrl;<keycap>J</keycap> </keycombo> or select <menuchoice><guimenu>Message</guimenu> <guimenuitem>Apply Filter</guimenuitem></menuchoice>: this will apply all filters that have been marked for manual filtering in the <link linkend="filter-dialog">filter dialog</link> to those messages.
de: Normalerweise werden Filter auf eingehende Nachrichten angewandt, aber sie können ebenso auf zu sendende Nachrichten, einzelne oder mehrere Nachrichten angewandt werden. Dazu wählen Sie die Nachrichten in der Nachrichtenliste aus, die Sie filtern wollen, und drücken Sie <keycombo action="simul">&Ctrl;<keycap>J</keycap></keycombo> , oder wählen Sie <menuchoice><guimenu>Nachrichten</guimenu><guimenuitem> Filter anwenden</guimenuitem></menuchoice>. Beachten Sie, dass alle Filter, die im <link linkend="filter-dialog">Filter-Dialog</link> für manuelle Filterung vorgesehen sind, auf diese Nachrichten angewandt werden.

source: Fast Filter Creation
de: Schnelle Filtererstellung

source: There are two methods for creating a filter; the quick method is to use <menuchoice><guimenu>Message</guimenu><guimenuitem>Create Filter</guimenuitem></menuchoice> and select a criteria from the submenu: this will call the filter dialog and present you with a new filter which has the first rule of the search pattern and the first action (as <guilabel>Move into Folder</guilabel>) preset. In most cases, all you have to do is select the folder where the message should be moved to; but you can, of course, edit the filter as you like.
de: Es gibt zwei Möglichkeiten zum Anwenden von Filtern. Als schnellste Methode benutzen Sie <menuchoice><guimenu>Nachricht</guimenu><guimenuitem>Filter anlegen</guimenuitem></menuchoice> und wählen ein Kriterium aus dem Untermenü. Hierdurch wird der Filter-Dialog mit einem neuen Filter aufgerufen, dessen erste Regel und Aktion (<guilabel>In Ordner verschieben</guilabel>) vorbesetzt sind. In den meisten Fällen müssen Sie nur noch den Ordner auswählen, in den die Nachricht verschoben werden soll. Sie können aber den Filter natürlich so einstellen, wie Sie möchten.

source: When creating a filter on mailing list messages this method will try really hard to find a criterion that uniquely identifies messages from that list; If it succeeds, the guessed name of the list is presented in the <menuchoice><guimenu>Message</guimenu><guisubmenu>Create Filter</guisubmenu><guimenuitem>Filter on Mailing-List...</guimenuitem></menuchoice> menu entry.
de: Wenn Sie einen Filter mit einer Mailinglisten-Nachricht erstellen, versucht diese Methode mit allen Mitteln die Kriterien zu finden, die eine Nachricht für diese Liste eindeutig identifiziert. Falls dies gelingt, wird der wahrscheinliche Name der Liste in <menuchoice><guimenu>Nachricht</guimenu><guisubmenu> Filter anlegen</guisubmenu><guimenuitem>Nach Mailingliste filtern ...</guimenuitem></menuchoice> eingefügt.

source: The second method is to manually construct a filter from scratch by calling the filter dialog through <menuchoice><guimenu>Settings</guimenu><guimenuitem>Configure Filters...</guimenuitem></menuchoice>. The filter dialog is described in detail in the following subsection.
de: Die zweite Methode ist, einen Filter manuell durch Aufruf von <menuchoice><guimenu>Einstellungen</guimenu><guimenuitem>Filter einrichten ...</guimenuitem></menuchoice> zu erzeugen. Der Filter-Dialog wird im folgenden Abschnitt detailliert beschrieben.

source: The Filter Dialog
de: Der Filter-Dialog

source: This dialog allows you to manage and edit your list of filters.
de: Dieser Dialog erlaubt es Ihnen Ihre Liste mit Filtern zu verwalten und zu ändern.

source: You can reach it either via <menuchoice><guimenu>Message</guimenu><guisubmenu>Create Filter</guisubmenu></menuchoice> or <menuchoice><guimenu>Settings</guimenu><guimenuitem>Configure Filters...</guimenuitem></menuchoice>.
de: Sie können ihn über <menuchoice><guimenu>Nachricht</guimenu><guisubmenu>Filter anlegen</guisubmenu></menuchoice> oder über <menuchoice><guimenu>Einstellungen</guimenu><guimenuitem>Filter einrichten ...</guimenuitem></menuchoice> erreichen.

source: The dialog is divided into three main sections on the <guilabel>General</guilabel> and <guilabel>Advanced</guilabel> tab:
de: Dieser Dialog enthält drei Abschnitte auf den Karteikarten <guilabel>Allgemein</guilabel> und <guilabel>Erweitert</guilabel>:

source: Available Filters
de: Vorhandene Filter

source: This group contains the list of filters and some action buttons to modify the filters, namely: to create new filters; to move them up or down the list; to delete them; or to rename them. If you select a filter from the list, its properties are shown in the right-hand half of the dialog.
de: Diese Gruppe enthält eine Liste mit Filtern und Aktionsknöpfen, um Filter zu ändern. Filter können hinzugefügt werden, in der Liste nach oben oder unter verschoben werden, oder gelöscht oder umbenannt werden. Wenn Sie einen Filter in der Liste auswählen, werden seine Eigenschaften in der rechten Hälfte des Dialogs angezeigt.

source: Filter Criteria
de: Filterbedingungen

source: In this group you can edit the pattern that messages must match for the filter to be applied to them. You can select here whether all of the defined rules must match or whether it suffices that any one of them matches. See <link linkend="filter-criteria">Search Patterns</link> below for a detailed description of each search rule type.
de: In dieser Gruppe können Sie die Muster ändern, denen eine Nachricht entsprechen muss, damit der Filter auf sie anspricht. Sie können hier auch auswählen, ob alle Muster zutreffen müssen, oder ob es reicht, wenn eines der Muster passt. Sehen Sie dazu auch <link linkend="filter-criteria">Suchmuster</link> weiter unten für eine detaillierte Beschreibung der einzelnen Regeltypen.

source: You can click on <guibutton>More</guibutton> to get an additional (initially empty) rule if you want to define more-complex patterns and on <guibutton>Fewer</guibutton> to remove the last rule. <guibutton>Clear</guibutton> clears the pattern, &ie; it removes all but two rules from screen and resets those two.
de: Sie können auf <guibutton>Mehr</guibutton> klicken um eine zusätzliche (anfangs leere) Filterregel zu erhalten, falls Sie komplexere Muster festlegen wollen. Oder wählen Sie <guibutton>Weniger</guibutton> um die letzte Regel zu entfernen. <guibutton>Löschen</guibutton> löscht das Muster, d.h., es werden alle bis auf zwei Regeln vom Bildschirm entfernt, und diese zurückgesetzt.

source: Invalid or empty rules are not evaluated.
de: Ungültige oder leere Regeln werden nicht ausgewertet.

source: Filter Actions
de: Filteraktionen

source: In this group you can edit the list of actions that are applied to all messages that match the defined filter criteria. See <link linkend="filter-action">Filter Actions</link> below for a detailed description of each action type.
de: In dieser Gruppe können Sie die Liste der Aktionen, die auf Nachrichten angewendet werden, die dem Suchmuster entsprechen, ändern. Siehe<link linkend="filter-action">Filteraktionen</link> weiter unten für eine genauer Beschreibung jedes Aktionstyps.

source: You can click on <guibutton>More</guibutton> to get a new, empty action (if you want to define more than one action) and on <guibutton>Fewer</guibutton> to remove the last action. <guibutton>Clear</guibutton> clears the list, &ie; it removes all but one action and resets that one.
de: Man kann auf <guibutton>Mehr</guibutton> klicken, um eine neue leere Filteraktion zu bekommen, falls man mehr als eine Filteraktion benötigt, sowie auf <guibutton>Weniger</guibutton>, um die letzte Aktion zu entfernen. <guibutton>Alles Löschen</guibutton> löscht die Liste, entfernt also alle bis auf die letzte Aktion und setzt diese zurück.

source: Invalid or empty actions are not executed.
de: Ungültige oder leere Aktionen werden nicht ausgeführt.

source: Advanced Options
de: Erweiterte Einstellungen

source: In this group you can define a few advanced options for filters that allow you to refine your filtering.
de: In diesem Abschnitt können einige Einstellungen zur Verfeinerung des Filters geändert werden.
