Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdepim/kmail_using-kmail.po
Languages: de

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Matthias</firstname><surname>Kiefer</surname> <affiliation><address><email>matthias.kiefer@gmx.de</email></address></affiliation> <contrib>Deutsche Übersetzung</contrib></othercredit> <othercredit role="translator"><firstname>Alexander</firstname><surname>Gretencord</surname> <affiliation><address><email>arutha@gmx.de</email></address></affiliation> <contrib>Überarbeitung</contrib></othercredit> <othercredit role="translator"><firstname>Frank</firstname><surname>Schütte</surname> <affiliation><address><email>F.Schuette@t-online.de</email></address></affiliation> <contrib>Überarbeitung ab Version 1.3</contrib></othercredit>

source: Using &kmail;
de: &kmail; verwenden

source: The Main Window
de: Das Hauptfenster

source: The main window is the window that appears when &kmail; is started. It is by default divided into three panes:
de: Das Hauptfenster erscheint nach dem Start von &kmail;. Es ist in der Voreinstellung in drei Bereiche unterteilt:

source: Folder list (on the left)
de: Ordnerliste (links)

source: <screeninfo>Folder Pane</screeninfo>
de: <screeninfo>Ordnerliste</screeninfo>

source: <phrase>Folder Pane</phrase>
de: <phrase>Ordnerliste</phrase>

source: <para>Folder Pane</para>
de: <para>Ordnerliste</para>

source: This pane contains the list of your message folders (other email programs may call them mailboxes). To select a folder, simply click on it. The messages contained in the folder will now appear in the Headers pane. The folder list can be displayed in both a short view, which takes up only a small portion of the left side of the screen, and a long view, which takes up the entire left side of the screen but is able to show more mailboxes. You can toggle between these two views under <guilabel>Appearance</guilabel>/<guilabel>Layout</guilabel> in the <menuchoice><guimenu>Settings</guimenu><guimenuitem>Configure &kmail;...</guimenuitem></menuchoice> dialog. The top section of the folder pane contains quick links to your favorite folders. Add folders here through the &RMB; context menu <guimenuitem>Add to Favorite Folders</guimenuitem>. Please see the <link linkend="folders">Folders Section</link> for detailed information about how to use folders.
de: Dieser Bereich enthält die Liste Ihrer Nachrichtenordner (andere Programme nennen das eventuell auch Postfächer). Ein Ordner wird durch Klicken mit der Maus ausgewählt. Die Nachrichten, die er enthält, werden dann in der Nachrichtenliste angezeigt. Der Ordnerbereich kann als eine kurze Ansicht, die nur einen kleinen Bereich des Fensters benutzt, oder eine lange Ansicht, die die gesamte linke Seite des Fensters benutzt und daher mehr Ordner gleichzeitig aufnehmen kann, angezeigt werden. In <guilabel>Erscheinungsbild</guilabel>/<guilabel>Layout</guilabel> im Einrichtungsdialog von &kmail; kann zwischen beiden Ansichten umgeschaltet werden. Oben im Ordnerbereich werden Verknüpfungen zu Ihren bevorzugten Ordner angezeigt. Um hier Ordner hinzuzufügen, wählen Sie im Kontextmenü eines Ordners den Eintrag <guimenuitem>Zu bevorzugten Ordnern hinzufügen</guimenuitem>.Nähere Informationen über Benutzung der Ordner bekommen Sie im Kapitel <link linkend="folders">Nachrichtenordner</link>.

source: Message list (in the upper right by default)
de: Nachrichtenliste (in der Voreinstellung oben rechts)

source: Message List with Message View
de: Nachrichtenliste und Nachrichtenanzeige

source: <phrase>Message List and Message View</phrase>
de: <phrase>Nachrichtenliste und Nachrichtenanzeige</phrase>

source: <para>Message List and Message View</para>
de: <para>Nachrichtenliste und Nachrichtenanzeige</para>

source: This pane lists header information (message Status Flags, Sender, Subject, Date, and other optional columns like Size, Attachment Flag, Important Flag, etc.) for the messages in the currently selected folder. Clicking on a header will select that message and display it in the Message pane; you can also select more than one message by holding down the &Ctrl; key when clicking on messages. Change the view of your message list by selecting <menuchoice><guimenu>View</guimenu><guimenuitem>Message List</guimenuitem> <guimenuitem>Theme</guimenuitem></menuchoice>. You have several options here.
de: In diesem Bereich werden Informationen (Status der Nachricht, Absender, Betreff und Absendedatum, optionale Spalten wie Größe, Kennzeichnung für Anhänge, Wichtig etc.) über die Nachrichten im ausgewählten Ordner angezeigt. Wenn Sie auf einen Vorspann klicken, wird die dazugehörige Nachricht ausgewählt und im Nachrichtenbereich angezeigt. Sie können mehrere Nachrichten auswählen, indem Sie beim Klicken die &Ctrl;-Taste gedrückt hält. Ändern Sie die Ansicht Ihrer Nachrichtenliste durch Auswahl von <menuchoice><guimenu>Ansicht</guimenu><guimenuitem>Nachrichtenliste</guimenuitem> <guimenuitem>Design</guimenuitem></menuchoice>. Hier gibt es mehrere Auswahlmöglichkeiten.

source: <guilabel>Classic</guilabel> A simple, backward compatible, single row with clickable sort columns.
de: <guilabel>Klassisch</guilabel> Ein einfaches, rückwärts-kompatibles Design mit nur einer Zeile, die Spalten können durch Klicken sortiert werden.

source: <guilabel>Smart</guilabel> A smart multi-line, multi-item with status icons, no sort columns.
de: <guilabel>Dekorativ</guilabel> Ein dekoratives Design, welches mehrere Zeilen und Objekte mit Statussymbolen verwendet, ohne Sortierung der Spalten.

source: <guilabel>Smart with clickable status</guilabel> A smart multi-line, multi-item, status icons and clickable sort icons.
de: <guilabel>Dekorativ mit anklickbarem Status</guilabel> Ein dekoratives Design, welches mehrere Zeilen und Status-Symbole verwendet und anklickbare Symbole zur Sortierung enthält.

source: <guilabel>Configure...</guilabel> Allows you to customize your own Message List Theme &eg; add or remove columns from the clickable sort bar.
de: <guilabel>Einrichten</guilabel> Dies ermöglicht es Ihnen, eigene Design für die Nachrichtenliste einzustellen, &eg; Spalten aus der anklickbaren Sortierleiste entfernen oder hinzufügen.

source: If you have chosen a theme with a clickable status, you may sort the messages by clicking on the column that you wish to sort; if you click on the same column more than once, sort order will toggle between ascending/descending and some alternative sorting criteria will become available (like sorting by Status when you click on the header of the Subject column). Clicking the &RMB; on the list header shows a pop up menu, which allows you to show or hide several columns in the list. You can customize the columns visible on the sort bar, see <link linkend="customize-messagelist-theme">Configure Appearance Message List</link> for details.
de: Haben Sie ein Design mit anklickbarem Status gewählt, dann können Sie die Nachrichten sortieren, indem Sie einfach auf das Feld in der Kopfzeile der Spalte klicken, nach der Sie sortieren möchten. Klicken Sie mehrmals hintereinander auf dieselbe Spalte, wird die Sortierrichtung zwischen Aufwärts und Abwärts umgeschaltet und einige zusätzliche Sortierkriterien stehen zur Verfügung (wie etwa das Sortieren nach Status, wenn Sie auf den Vorspann der Betreff-Spalte klicken). Wenn Sie mit der &RMBn; Maustaste auf die Kopfzeile der Liste klicken, erscheint ein Kontextmenü, mit dem Sie die verschiedenen Spalten ein- bzw. ausblenden können. Die angezeigten Spalten können angepasst werden, weitere Informationen dazu im Abschnitt <link linkend="customize-messagelist-theme">Erscheinungsbild der Nachrichtenliste einrichten</link>.

source: Message preview pane (in the lower right by default)
de: Nachrichtenbereich (in der Voreinstellung unten rechts)

source: This pane displays the currently selected message. Below you will find options to adjust the reader window to your preference.
de: In diesem Bereich wird der Inhalt der gerade ausgewählte Nachricht angezeigt. Im Folgenden finden Sie Einstellungen, um die Anzeige von Nachrichten anzupassen.

source: The top of the reader window contains various header options. Go to <menuchoice><guimenu>View</guimenu><guisubmenu>Headers</guisubmenu></menuchoice> and try them out until you find one you like! Details for the various headers are as follows:
de: Oben im Editorfenster gibt es mehrere Einstellungen, um die Anzeige der Vorspannzeilen zu ändern. Wählen Sie eine passende Einstellung aus <menuchoice><guimenu>Ansicht</guimenu><guisubmenu>Vorspann</guisubmenu></menuchoice>. Im Folgenden finden Sie ausführliche Informationen über alle vorhandenen Anzeigemöglichkeiten:

source: <guilabel>Enterprise Headers</guilabel> A minimal header with title, From, and To, with a graphical design.
de: <guilabel>Grafisch</guilabel>: Ein minimaler Vorspann mit Betreff, Absender und Empfänger mit grafischem Design.

source: <guilabel>Fancy Headers</guilabel> Minimal header with a spam status notification.
de: <guilabel>Dekorativ</guilabel>: Minimaler Vorspann mit Anzeige des Spam-Status.

source: <guilabel>Brief Headers</guilabel> Title, and in parentheses you will find From and the date.
de: <guilabel>Kurz</guilabel>: Betreff mit Absender und Datum in Klammern.

source: <guilabel>Standard Headers</guilabel> Title, From, and To.
de: <guilabel>Standard</guilabel> Betreff, Absender und Empfänger.

source: <guilabel>Long Headers</guilabel> Title, Date, From, and To.
de: <guilabel>Lang</guilabel> Betreff, Datum, Absender und Empfänger.

source: <guilabel>All Headers</guilabel> List everything you ever wanted to know about the email, including every server it went through, virus/spam scanners it went through, &etc;
de: <guilabel>Alle</guilabel> zeigt die vollständigen Vorspannfelder einer Nachricht an, einschließlich aller Server, die die Nachricht weiter transportiert haben &etc;

source: <guilabel>Custom Headers</guilabel> See <link linkend="configure-appearance-message-window">Message Window configuration</link> <guilabel>Headers:</guilabel> to set up custom headers that can be selected here.
de: <guilabel>Benutzerdefinierter Vorspann</guilabel>: Informationen dazu im Abschnitt <link linkend="configure-appearance-message-window">Einstellungen für das Nachrichtenfenster</link> unter <guilabel>Vorspann</guilabel>.

source: <guilabel>Example</guilabel> An example header from the <guilabel>Download New Themes...</guilabel>.
de: <guilabel>Beispiel</guilabel>: Ein Vorspann, der mit <guilabel>Neue Designs herunterladen ...</guilabel> geholt wurde.

source: <guilabel>Example Fancy</guilabel> An example fancy header from the <guilabel>Download New Themes...</guilabel>.
de: <guilabel>Dekoratives Beispiel</guilabel>: Ein Beispiel für einen dekorativen Vorspann, der mit <guilabel>Neue Designs herunterladen ...</guilabel> geholt wurde.

source: <guilabel>Download New Themes...</guilabel> Allows you to download custom themes created by other &kmail; users.
de: <guilabel>Neue Designs herunterladen ...</guilabel>: Zum Herunterladen von benutzerdefinierten Designs anderer &kmail;-Anwender.

source: If you prefer to view your email in &HTML; format instead of plain text (Default) click on the bar located on the left hand side of the pane. The text on the bar will inform you which view you are in. If this bar is missing you can enable it in the <menuchoice><guimenu>Settings</guimenu><guimenuitem>Configure &kmail;...</guimenuitem></menuchoice> dialog, from there you want the <guilabel>Message Window</guilabel> tab, and select <guilabel>Show &HTML; status bar</guilabel>.
de: Möchten Sie Ihre E-Mail lieber im &HTML;-Format anstatt als einfachen Text (die Voreinstellung) anzeigen, klicken Sie auf die schmale Leiste am linken Rand des Nachrichtenfensters. Der Text auf dieser Leiste zeigt an, welches Format gerade benutzt wird. Fehlt diese Leiste, können Sie sie im Einstellungsdialog auf der Karteikarte <guilabel>Nachrichtenfenster</guilabel> mit <guilabel>&HTML;-Statusleiste anzeigen</guilabel> einblenden.

source: If you would like to change how your attachments appear in your messages, go to <menuchoice><guimenu>View</guimenu><guisubmenu>Attachments</guisubmenu></menuchoice>. Your options are as follows:
de: Mit <menuchoice><guimenu>Ansicht</guimenu><guisubmenu>Anhänge</guisubmenu></menuchoice> können Sie einstellen, wie Anhänge in Ihren Nachrichten angezeigt werden sollen. Folgende Einstellungen sind möglich:

source: <guimenuitem>As Icons</guimenuitem>, all attachments appear as icons at the bottom of the message.
de: <guimenuitem>Als Symbole</guimenuitem>: Alle Anhänge erscheinen als Symbole am unteren Rand der Nachricht.

source: <guimenuitem>Smart</guimenuitem> will show attachments as icons, unless the message suggests that they should be displayed inline. You can suggest that certain attachments should be shown inline in your own messages when you select <guilabel>Suggest automatic display</guilabel> in the attachment's properties dialog.
de: <guimenuitem>Intelligent</guimenuitem> zeigt Anhänge immer dann als Symbole, wenn sie nicht in der Nachricht eingebettet sind. Bei eigenen Nachrichten können Sie Anhänge einbetten, indem Sie <guilabel>Automatische Anzeige vorschlagen</guilabel> im Eigenschaftendialog des Anhangs auswählen.

source: <guimenuitem>Inline</guimenuitem> shows the contents of the attachments at the bottom of the message. Attachments that cannot be displayed, &eg; compressed files, will still be shown as an icon.
de: <guimenuitem>Im Text</guimenuitem>: Anhänge werden am unteren Rand der Nachricht angezeigt. Anhänge, die nicht angezeigt werden können, &eg; komprimierte Dateien, werden auch in diesem Modus als Symbole angezeigt.

source: <guimenuitem>Hide</guimenuitem> will not show attachments.
de: <guimenuitem>Ausgeblendet</guimenuitem> zeigt keine Anhänge an.

source: For complex messages you can show the structure of the message by selecting <menuchoice><guimenu>View</guimenu><guimenuitem>Show Message Structure</guimenuitem></menuchoice>, this will show in the message structure viewer below the preview pane.
de: Für komplexe Nachrichten können Sie sich die Struktur dieser Nachricht einschalten. Wählen Sie dazu <menuchoice><guimenu>Ansicht</guimenu><guimenuitem>Nachrichtenstruktur anzeigen</guimenuitem></menuchoice> in der Menüleiste. Unten im Nachrichtenbereich wird dann die Struktur angezeigt.

source: You can scroll through the message page-by-page using the <keycap>Page Up</keycap> and <keycap>Page Down</keycap> keys, or line-by-line using the <keycap>Up arrow</keycap> and <keycap>Down arrow</keycap> keys; you can also use <link linkend="keyboard-shortcuts">keyboard shortcuts</link> to skip through your messages without having to use the mouse.
de: Sie können den Text seitenweise mit den Tasten <keycap>Bild auf</keycap> und <keycap>Bild ab</keycap>, oder zeilenweise mit den Tasten <keycap>Pfeil hoch</keycap> und <keycap>Pfeil runter</keycap> durchlaufen. Um zu einer anderen Nachricht zu gelangen, ohne die Maus benutzen zu müssen, kann man <link linkend="keyboard-shortcuts">Tastenkürzel</link> verwenden.

source: Keyboard Shortcuts
de: Tastenzuordnung

source: The following keyboard shortcuts are supported in the main window:
de: Folgende Tastenkürzel können im Hauptfenster verwendet werden:

source: Keyboard Shortcut
de: Tastenzuordnungen

source: Action
de: Aktion

source: Space
de: Leertaste

source: Scroll down in the current message or go to the next unread message if you are already at the bottom.
de: Scrollt in der gewählten Nachricht nach unten oder geht zur nächsten ungelesenen Nachricht, falls Sie schon am unteren Rand sind.

source: <keycap>Right Arrow</keycap> or <keycap>N</keycap>
de: <keycap>Pfeil rechts</keycap> Taste oder <keycap>N</keycap>

source: Go to the next message in the current folder and display the message preview.
de: Wechselt zur nächsten Nachricht im aktuellen Ordner und zeigt den Text der E-Mail an.

source: <keycap>Left Arrow</keycap> key or <keycap>P</keycap>
de: <keycap>Pfeil links</keycap> Taste oder <keycap>P</keycap>

source: Go to the previous message in the current folder and display the message preview.
de: Wechselt zur vorigen Nachricht im aktuellen Ordner und zeigt den Text der E-Mail an.

source: &Alt;<keycap>Right Arrow</keycap>
de: &Alt;<keycap>Pfeil rechts</keycap>

source: Scroll down the message list in the current folder, the message preview does not change.
de: Blättert im aktuellen Ordner in der Nachrichtenliste nach unten, die Anzeige des Nachrichtentextes bleibt unverändert.

source: &Alt;<keycap>Left Arrow</keycap>
de: &Alt;<keycap>Pfeil links</keycap>

source: Scroll up the message list in the current folder, the message preview does not change.
de: Blättert im aktuellen Ordner in der Nachrichtenliste nach oben, die Anzeige des Nachrichtentextes bleibt unverändert.

source: Go to the next unread message in the current folder.
de: Wechselt zur nächsten ungelesenen Nachricht in diesem Ordner.

source: Go to the previous unread message in the current folder.
de: Wechselt zur vorigen ungelesenen Nachricht in diesem Ordner.

source: Go to the next folder with unread messages.
de: Wechselt zum nächsten Ordner mit ungelesenen Nachrichten.

source: Go to the previous folder with unread messages.
de: Wechselt zum vorigen Ordner mit ungelesenen Nachrichten.

source: &Alt;<keycap>Up Arrow</keycap>
de: &Alt;<keycap>Pfeil hoch</keycap>

source: Go to the next folder in the folder list (if the folder list has focus.)
de: Geht zum nächsten Ordner in der Ordnerliste (wenn die Ordnerliste den Fokus hat)

source: &Alt;<keycap>Down Arrow</keycap>
de: &Alt;<keycap>Pfeil runter</keycap>

source: Go to the previous folder in the folder list (if the folder list has focus.)
de: Wechselt zum vorigen Ordner in der Ordnerliste (wenn die Ordnerliste den Fokus hat).

source: &Ctrl;<keycap>Left Arrow</keycap>
de: &Ctrl;<keycap>Pfeil links</keycap>

source: Focus on previous folder. Use <keycombo action="simul">&Ctrl;<keycap>Space</keycap></keycombo> to actually enter the folder.
de: Setzt den Fokus zum vorherigen Ordner. Um in den Ordner zu wechseln, muss man <keycombo action="simul">&Ctrl;<keycap>Leertaste</keycap></keycombo> betätigen.

source: &Ctrl;<keycap>Right Arrow</keycap>
de: &Ctrl;<keycap>Pfeil rechts</keycap>

source: Focus on next folder. Use <keycombo action="simul">&Ctrl;<keycap>Space</keycap></keycombo> to actually enter the folder.
de: Setzt den Fokus zum nächsten Ordner. Um in den Ordner zu wechseln, muss man <keycombo action="simul">&Ctrl;<keycap>Leertaste</keycap></keycombo> betätigen.

source: &Ctrl;<keycap>Space</keycap>
de: &Ctrl;<keycap>Leertaste</keycap>

source: Enter the folder that has focus, &ie; the folder that you navigated to using <keycombo action="simul">&Ctrl;<keycap>Left Arrow</keycap></keycombo> or <keycombo action="simul">&Ctrl;<keycap>Right Arrow</keycap></keycombo>.
de: Wechselt in den aktuellen Ordner, also den Ordner, den man mit Hilfe der Tasten <keycombo action="simul">&Ctrl;<keycap>Pfeil links</keycap></keycombo> und <keycombo action="simul">&Ctrl;<keycap>Pfeil rechts</keycap></keycombo> ausgewählt hat.

source: <keycombo action="simul">&Shift;<keycap>Left Arrow</keycap></keycombo> and <keycombo action="simul">&Shift;<keycap>Right Arrow</keycap></keycombo>
de: <keycombo action="simul">&Shift;<keycap>Pfeil links</keycap></keycombo> und <keycombo action="simul">&Shift;<keycap>Pfeil rechts</keycap></keycombo>

source: Select messages in the header pane, starting with the current message.
de: Wählt beginnend mit der aktuellen Nachricht Nachrichten in der Nachrichtenliste aus.

source: For more keyboard shortcuts have a look at the <menuchoice><guimenu>Settings</guimenu><guimenuitem>Configure Shortcuts...</guimenuitem></menuchoice> dialog.
de: Weitere Tastaturkürzel finden Sie im Dialog <menuchoice><guimenu>Einstellungen</guimenu><guimenuitem>Kurzbefehle festlegen ...</guimenuitem></menuchoice>.

source: The Composer Window
de: Nachrichten erstellen

source: The composer window is used to write new, reply, and forward messages; it can be invoked in several ways. Here you will find the various options to composing messages.
de: Im Editorfenster schreiben Sie neue Nachrichten, antworten und leiten Nachrichten weiter. Der Editor kann auf mehrere Arten aufgerufen werden, die im folgenden beschrieben werden.

source: Composing a Message
de: Eine Nachricht schreiben

source: New Message...
de: Neue Nachricht ...

source: The New Message composer window can be invoked the following ways:
de: Das Editorfenster für neue Nachrichten kann auf folgende Arten aufgerufen werden:

source: <guimenu>File</guimenu><guisubmenu>New</guisubmenu><guimenuitem>New Message...</guimenuitem>
de: <guimenu>Datei</guimenu> <guisubmenu>Neu</guisubmenu><guimenuitem>Neue Nachricht ...</guimenuitem>

source: <guimenu>Message</guimenu><guimenuitem>New Message...</guimenuitem>
de: <guimenu>Nachricht</guimenu><guimenuitem>Neue Nachricht ...</guimenuitem>

source: The <guiicon>New</guiicon> icon on the main toolbar.
de: Das Symbol <guiicon>Neue</guiicon> in der Haupt-Werkzeugleiste.

source: To write your message, fill in the appropriate fields in the composer window. Use the <guimenu>View</guimenu> menu to select which header fields are displayed. Some field options offer a <guibutton>Sticky</guibutton> checkbox, that if checked, your selection will remain as the default when you open a new composer window. The following list describes the various headers.
de: Um eine Nachricht zu erstellen, füllen Sie die die entsprechenden Felder im Nachricht-Editor aus. Im Menü <guimenu>Ansicht</guimenu> können Sie die anzuzeigenden Vorspannfelder auswählen. Neben einigen Feldern befindet sich das Ankreuzfeld <guibutton>Beibehalten</guibutton>. Wird mieses Feld markiert, so wird die aktuelle Auswahl die Standard für alle zukünftig erstellten neuen Nachrichten benutzt. Folgende Vorspannfelder können eingestellt werden:

source: The <guimenuitem>Identity</guimenuitem> drop down box allows you to select an identity to use.
de: Mit dem Auswahlfeld <guimenuitem>Identität</guimenuitem> legen Sie die Identität fest, die Sie benutzen möchten.

source: The <guimenuitem>Dictionary</guimenuitem> drop down box allows you to choose your dictionary of choice for use with spellchecking.
de: Mit dem Auswahlfeld <guimenuitem>Wörterbuch</guimenuitem> wählen Sie ein Wörterbuch für die Rechtschreibprüfung aus..

source: The <guimenuitem>Sent-Mail folder</guimenuitem> allows you to change the location to save sent emails.
de: Aktivieren Sie <guimenuitem>Ordner für versendete Nachrichten</guimenuitem>, um den Ordner zur Speicherung von gesendeten E-Mails festzulegen.

source: The <guimenuitem>Mail transport</guimenuitem> allows you to select the outgoing mail server you would like to use.
de: Mit <guimenuitem>Versandweg</guimenuitem> können Sie einen ausgehenden E-Mail-Server wählen, den Sie verwenden möchten.

source: Your traditional From:, Reply To:, To:, and Subject: fields.
de: Die bekannten Felder <guimenuitem>Von</guimenuitem>, <guimenuitem>Antwort an</guimenuitem>, <guimenuitem>An</guimenuitem> und <guimenuitem>Betreff</guimenuitem>.

source: The <guimenuitem>Use Fixed Font</guimenuitem> allows you to toggle fixed fonts on and off.
de: Mit <guimenuitem>Feste Zeichenbreiten</guimenuitem> können Sie die Anzeige mit nicht proportionalen Schriften ein- oder ausschalten.

source: The <guimenuitem>Snippets</guimenuitem> allows you to show the snippets window to store and use often used parts of text.
de: Mit <guimenuitem>Textbausteine</guimenuitem> wird ein Fenster eingeblendet, um häufig benutzte Texte zu speichern und einzufügen.

source: The <guimenuitem>Translator</guimenuitem> allows you to translate your text within the composer window.
de: Mit dem <guimenuitem>Übersetzer</guimenuitem> können Sie den Text im Editor übersetzen.
