Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdepim/kmail_menus.po
Languages: de

source: Prepends your signature (<quote>header</quote>) to the beginning of the message. Please see <link linkend="configure-identity-signature">Configure Identity Signature</link> for details on configuring your signature.
de: Fügt den Inhalt Ihrer Signatur (<quote>als Kopfzeile</quote>) am Anfang der Nachricht ein. Weitere Informationen zum Einrichten der Signatur finden Sie im Abschnitt <link linkend="configure-identity-signature">Signatur</link>.

source: <guimenu>Attach</guimenu> <guimenuitem>Append Signature At Cursor Position</guimenuitem>
de: <guimenu>Anhängen</guimenu> <guimenuitem>Signatur an der Schreibmarke einfügen</guimenuitem>

source: Appends your signature to the current location of your cursor to the message. Please see <link linkend="configure-identity-signature">Configure Identity Signature</link> for details on configuring your signature.
de: Fügt den Inhalt Ihrer Signatur an der aktuellen Cursor-Position in der Nachricht ein. Weitere Informationen zum Einrichten der Signatur finden Sie im Abschnitt <link linkend="configure-identity-signature">Signatur</link>.

source: <guimenu>Attach</guimenu> <guimenuitem>Attach Public Key...</guimenuitem>
de: <guimenu>Anhängen</guimenu> <guimenuitem>Öffentlichen Schlüssel anhängen ...</guimenuitem>

source: Opens the <guilabel>Attach Public OpenPGP Key</guilabel> dialog. Please see <link linkend="configure-identity-cryptography-openpgp-sign">Configure Identity Cryptography OpenPGP Signing</link> for details.
de: Öffnet den Dialog <guilabel>Öffentlichen OpenPGP-Schlüssel anhängen</guilabel>. Weitere Informationen finden Sie im Abschnitt <link linkend="configure-identity-cryptography-openpgp-sign">OpenPGP-Signaturschlüssel</link>.

source: <guimenu>Attach</guimenu> <guimenuitem>Attach My Public Key</guimenuitem>
de: <guimenu>Anhängen</guimenu> <guimenuitem>Eigenen öffentlichen Schlüssel anhängen</guimenuitem>

source: Attaches your <application>GnuPG</application> public key to your message.
de: Hängt den eigenen <application>GnuPG</application>-Schlüssel an die Nachricht an.

source: <guimenu>Attach</guimenu> <guisubmenu>Attach</guisubmenu> <guimenuitem>Attach File...</guimenuitem>
de: <guimenu>Anhängen</guimenu> <guisubmenu>Anhängen</guisubmenu> <guimenuitem>Datei anhängen ...</guimenuitem>

source: Attaches one or more files to the current message. By default attachments are not encrypted, please see <link linkend="cryptographic-message-formats">Cryptographic Message Formats</link> for information on encryption and attachments.
de: Fügt eine oder mehrere Dateien als Anhang an die Nachricht an. In der Voreinstellung werden Anhänge nicht verschlüsselt. Im Abschnitt <link linkend="cryptographic-message-formats">Signieren und Verschlüsseln von Nachrichten</link> finden Sie weitere Informationen zu diesem Thema.

source: <guimenu>Attach</guimenu> <guisubmenu>Attach</guisubmenu> <guimenuitem>Attach Own vCard</guimenuitem>
de: <guimenu>Anhängen</guimenu> <guisubmenu>Anhängen</guisubmenu> <guimenuitem>Eigene vCard anhängen</guimenuitem>

source: Attaches your vCard to the current message.
de: Hängt Ihre vCard (elektronische Visitenkarte) an die aktuelle Nachricht an.

source: <guimenu>Attach</guimenu> <guimenuitem>Remove Attachment</guimenuitem>
de: <guimenu>Anhängen</guimenu> <guimenuitem>Anhang entfernen</guimenuitem>

source: Removes the attachment that is selected in the attachment part of the composer.
de: Entfernt die angehängte Datei, die im Bereich Anhänge des Fensters <guilabel>Nachricht erstellen</guilabel> ausgewählt wurde.

source: <guimenu>Attach</guimenu> <guimenuitem>Save Attachment As...</guimenuitem>
de: <guimenu>Anhängen</guimenu> <guimenuitem>Anhang speichern unter ...</guimenuitem>

source: Saves the attachment that is selected in the attachment window to a file.
de: Speichert die angehängte Datei, die im Bereich Anhänge ausgewählt wurde, in eine Datei.

source: <guimenu>Attach</guimenu> <guimenuitem>Attachment Properties</guimenuitem>
de: <guimenu>Anhängen</guimenu> <guimenuitem>Eigenschaften des Anhangs</guimenuitem>

source: Displays the <link linkend="attachments">properties of the attachment</link> that is selected in the attachment window. It also allows you to sign/encrypt the attachment. Please see <link linkend="configure-security-composing">Configure Security Composing</link> to set up encryption.
de: Zeigt die <link linkend="attachments">Eigenschaften des ausgewählten Anhangs</link> in einem Dialog an. Hier können Sie das Verschlüsseln oder Signieren von Anhängen aktivieren. Weitere Informationen zum Einrichten der Verschlüsselung finden Sie im Abschnitt <link linkend="configure-security-composing">Nachrichten erstellen</link>.

source: If the menu item you are looking for is missing, please see <ulink url="help:/fundamentals/ui.html#menus-tools">Tools Menu</ulink> of the &kde; Fundamentals. The items listed here are &kmail; specific.
de: Hier werden nur die besonderen Einträge für &kmail; aufgeführt, alle sonstigen Menüeinträge finden Sie im <ulink url="help:/fundamentals/ui.html#menus-tools">Menu Extras</ulink> in den &kde;-Grundlagen.

source: <guimenu>Tools</guimenu> <guimenuitem>Select Recipients...</guimenuitem>
de: <guimenu>Extras</guimenu> <guimenuitem>Empfänger auswählen ...</guimenuitem>

source: <action>Opens up the <guilabel>Select Recipient</guilabel> dialog</action> with your personal contacts to select from.
de: <action>Öffnet den Dialog <guilabel>Empfänger auswählen</guilabel></action> mit Ihren persönlichen Kontakten.

source: <guimenu>Tools</guimenu> <guimenuitem>Addressbook...</guimenuitem>
de: <guimenu>Extras</guimenu> <guimenuitem>Adressbuch</guimenuitem>

source: <action>Opens up <ulink url="help:/kaddressbook">&kaddressbook;</ulink></action>.
de: <action>Öffnet <ulink url="help:/kaddressbook/">&kaddressbook;</ulink></action>.

source: <guimenu>Tools</guimenu> <guimenuitem>Save Distribution List...</guimenuitem>
de: <guimenu>Extras</guimenu> <guimenuitem>Verteilerliste speichern ...</guimenuitem>

source: <action>Opens a dialog</action> that allows you to save groups of contacts.
de: <action>Öffnet einen Dialog</action>, um eine Gruppe von Kontakten zu speichern.

source: <guimenu>Settings</guimenu> <guimenuitem>Spellchecker...</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>Rechtschreibprüfung ...</guimenuitem>

source: Allows you to configure <ulink url="help:/sonnet/">&sonnet;</ulink>, &kde;'s spellchecker.
de: Erlaubt es Ihnen <ulink url="help:/sonnet/">&sonnet;</ulink>, die Rechtschreibprüfung von &kde;, zu konfigurieren.

source: <ulink url="help:/fundamentals/ui.html#menus-help">Help Menu</ulink> of the &kde; Fundamentals.
de: Siehe <ulink url="help:/fundamentals/ui.html#menus-help">Hilfe-Menü</ulink> in den &kde;-Grundlagen.
