Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdepim/kmail_menus.po
Languages: de

source: <shortcut> <keycap>,</keycap> </shortcut> <guimenu>View</guimenu> <guimenuitem>Collapse Thread / Group</guimenuitem>
de: <shortcut><keycap>,</keycap></shortcut> <guimenu>Ansicht</guimenu> <guimenuitem>Gruppe einklappen</guimenuitem>

source: <action>This will hide the thread of the current message,</action> &ie; it will hide all messages that are replies to the current message.
de: Damit wird die gesamte Nachrichtengruppe, zu der die aktuelle Nachricht gehört, geschlossen.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>.</keycap></keycombo> </shortcut> <guimenu>View</guimenu> <guimenuitem>Expand All Threads</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>.</keycap></keycombo></shortcut> <guimenu>Ansicht</guimenu> <guimenuitem>Alle Gruppen aufklappen</guimenuitem>

source: Expands all threads in the current folder.
de: Öffnet alle Nachrichtengruppen des aktuellen Ordners.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>,</keycap></keycombo> </shortcut> <guimenu>View</guimenu> <guimenuitem>Collapse All Threads</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>,</keycap></keycombo></shortcut> <guimenu>Ansicht</guimenu> <guimenuitem>Alle Gruppen zusammenklappen</guimenuitem>

source: Collapses all threads in the current folder.
de: Schließt alle Nachrichtengruppen des aktuellen Ordners.

source: <shortcut> <keycap>V</keycap> </shortcut> <guimenu>View</guimenu> <guimenuitem>View Source</guimenuitem>
de: <shortcut><keycap>V</keycap></shortcut> <guimenu>Ansicht</guimenu> <guimenuitem>Nachrichtencode ansehen</guimenuitem>

source: <action>Shows the message and its complete headers in plain text format in a new window.</action> This can be useful to find out the origin of a mail.
de: <action>Zeigt in einem neuen Fenster den gesamten Nachrichtenvorspann und die Nachricht als unformatierten Text</action>. Das kann hilfreich sein, um die Herkunft einer Nachricht zu ermitteln.

source: You should know that it is easy to fake the <literal>From:</literal> header of a mail, but one can still find out which mail servers have been used to send the message by looking at the <literal>Received:</literal> lines in the header.
de: Es ist leicht, das Feld <literal>Von:</literal> einer Nachricht zu fälschen, dennoch kann man herausfinden, welche Mailserver für den Versand der Nachricht verwendet wurden, indem man sich die Inhalte der <literal>Received:</literal>-Vorspannfelder anschaut.

source: <guimenu>View</guimenu> <guimenuitem>Show Message Structure</guimenuitem>
de: <guimenu>Ansicht</guimenu> <guimenuitem>Nachrichtenstruktur anzeigen</guimenuitem>

source: <action>Display the structure viewer,</action> which is a part of the main window that lets you access all parts of a message.
de: <action>Zeigt eine Ansicht der Nachrichtenstruktur im Hauptfenster an</action>. Darin haben Sie Zugriff auf alle Bestandteile der Nachricht.

source: <shortcut> <keycap>X</keycap> </shortcut> <guimenu>View</guimenu> <guimenuitem>Use Fixed Font</guimenuitem>
de: <shortcut><keycap>X</keycap></shortcut> <guimenu>Ansicht</guimenu> <guimenuitem>Feste Zeichenbreiten</guimenuitem>

source: <action>Uses a fixed width (Monospace) font to display the messages in the current folder.</action> The font to be used can be configured in the <link linkend="configure-appearance-fonts">Fonts</link> tab on the <guilabel>Appearance</guilabel> page of the &kmail; configuration dialog.
de: <action>Verwendet einen Zeichensatz fester Breite (nicht-proportional), um die Nachrichten des aktuellen Ordners anzuzeigen</action>. Der gewünschte Zeichensatz kann im Abschnitt auf der Karteikarte <link linkend="configure-appearance-fonts">Schriftarten</link> des Einrichtungsdialogs von &kmail; festgelegt werden.

source: <guimenu>View</guimenu> <guisubmenu>Set Encoding</guisubmenu>
de: <guimenu>Ansicht</guimenu> <guisubmenu>Kodierung festlegen</guisubmenu>

source: <action>Lets you choose the character encoding to be used in the Message Pane.</action> The default, <guilabel>Auto</guilabel>, should work in almost all cases.
de: <action>Die zur Anzeige der Nachrichten verwendete Kodierung kann hier eingestellt werden</action>. Der Standard <guilabel>Automatisch</guilabel> sollte in den meisten Fällen funktionieren.

source: <guimenu>View</guimenu> <guisubmenu>Zoom</guisubmenu>
de: <guimenu>Ansicht</guimenu> <guisubmenu>Skalierung</guisubmenu>

source: Allows to zoom message in the Message Pane.
de: Mit den Aktionen in diesem Untermenü kann die Anzeige der gesamten Nachricht oder nur vom Text im Nachrichtenfenster vergrößert, verkleinert und wieder auf die ursprüngliche Größe zurückgesetzt werden.

source: Go Menu
de: Das Menü Gehe zu

source: <shortcut> <keycap>J</keycap> </shortcut> <guimenu>Go</guimenu> <guimenuitem>Jump to Folder...</guimenuitem>
de: <shortcut><keycap>J</keycap></shortcut><guimenu>Gehe zu</guimenu> <guimenuitem>In Ordner wechseln...</guimenuitem>

source: <action>Show a dialog box with a list of all your folders.</action> Click on the folder you wish to view and it will display it in the message view pane.
de: <action>Zeigt einen Dialog mit einer Liste aller Ordner.</action> Klicken Sie auf einen Ordner, in den Sie wechseln möchten, und er wird in der Nachrichtenliste angezeigt.

source: <shortcut> <keycap>N</keycap> </shortcut> <guimenu>Go</guimenu> <guimenuitem>Next Message</guimenuitem>
de: <shortcut><keycap>N</keycap></shortcut> <guimenu>Gehe zu</guimenu> <guimenuitem>Nächste Nachricht</guimenuitem>

source: <action>Selects the next message in the message list.</action> The keyboard shortcut <keycap>Right Arrow</keycap> also performs this action.
de: <action>Wählt die nächste Nachricht in der Nachrichtenliste</action>. Das Tastenkürzel <keycap>Pfeil rechts</keycap> kann ebenfalls verwendet werden.

source: <shortcut> <keycap>+</keycap> </shortcut> <guimenu>Go</guimenu> <guimenuitem>Next Unread Message</guimenuitem>
de: <shortcut><keycap>+</keycap></shortcut> <guimenu>Gehe zu</guimenu> <guimenuitem>Nächste ungelesene Nachricht</guimenuitem>

source: <action>Selects the next unread message in the message list.</action> If there are not any unread messages below the currently selected message, then the behavior depends on the value of the <xref linkend="configure-misc-folders-go-unread"/> option.
de: <action>Wählt die nächste ungelesene Nachricht in der Nachrichtenliste aus</action>. Wenn es unterhalb der aktuell ausgewählten Nachricht keine ungelesene Nachricht mehr gibt, dann hängt das Verhalten vom Wert der Option <xref linkend="configure-misc-folders-go-unread"/> ab.

source: <shortcut> <keycap>P</keycap> </shortcut> <guimenu>Go</guimenu> <guimenuitem>Previous Message</guimenuitem>
de: <shortcut><keycap>P</keycap></shortcut> <guimenu>Gehe zu</guimenu> <guimenuitem>Vorherige Nachricht</guimenuitem>

source: Selects the previous message in the message list.
de: Zeigt die vorherige Nachricht in der Nachrichtenliste an.

source: <shortcut> <keycap>-</keycap> </shortcut> <guimenu>Go</guimenu> <guimenuitem>Previous Unread Message</guimenuitem>
de: <shortcut><keycap>-</keycap></shortcut> <guimenu>Gehe zu</guimenu> <guimenuitem>Vorherige ungelesene Nachricht</guimenuitem>

source: <action>Selects the previous unread message in the message list.</action> If there is not an unread message above the currently selected message, then the behavior depends on the value of the <xref linkend="configure-misc-folders-go-unread"/> option.
de: <action>Wählt die vorherige ungelesene Nachricht in der Nachrichtenliste aus</action>. Wenn es oberhalb der aktuell ausgewählten Nachricht keine ungelesene Nachricht mehr gibt, dann hängt das Verhalten vom Wert der Option <xref linkend="configure-misc-folders-go-unread"/> ab.

source: <shortcut> <keycombo action="simul">&Alt;<keycap>+</keycap></keycombo> </shortcut> <guimenu>Go</guimenu> <guimenuitem>Next Unread Folder</guimenuitem>
de: <shortcut><keycombo action="simul">&Alt;<keycap>+</keycap></keycombo></shortcut> <guimenu>Gehe zu</guimenu> <guimenuitem>Nächster ungelesener Ordner</guimenuitem>

source: Jumps to the next folder with unread messages.
de: Wechselt zum nächsten Ordner mit ungelesenen Nachrichten.

source: <shortcut> <keycombo action="simul">&Alt;<keycap>-</keycap></keycombo> </shortcut> <guimenu>Go</guimenu> <guimenuitem>Previous Unread Folder</guimenuitem>
de: <shortcut><keycombo action="simul">&Alt;<keycap>-</keycap></keycombo></shortcut> <guimenu>Gehe zu</guimenu> <guimenuitem>Vorheriger ungelesener Ordner</guimenuitem>

source: Jumps to the previous folder with unread messages.
de: Wechselt zum vorherigen Ordner mit ungelesenen Nachrichten.

source: <shortcut> <keycap>Space</keycap> </shortcut> <guimenu>Go</guimenu> <guimenuitem>Next Unread Text</guimenuitem>
de: <shortcut><keycap>Leertaste</keycap></shortcut> <guimenu>Gehe zu</guimenu> <guimenuitem>Nächster ungelesener Text</guimenuitem>

source: Scrolls down if you are not yet at the bottom of a message, otherwise jumps to the next unread message.
de: Geht in der aktuellen Nachricht eine Seite weiter nach unten. Falls das Nachrichtenende erreicht ist, wird der Text der nächsten ungelesenen Nachricht angezeigt.

source: Folder Menu
de: Das Menü Ordner

source: <guimenu>Folder</guimenu> <guimenuitem>Add Folder...</guimenuitem>
de: <guimenu>Ordner</guimenu> <guimenuitem>Ordner hinzufügen ...</guimenuitem>

source: <action>Opens the <link linkend="folders-properties-window">Folder Properties</link> dialog</action> that lets you create a new folder.
de: Öffnet den Dialog <link linkend="folders-properties-window">Ordner-Eigenschaften</link> zur Erstellung eines neuen Ordners.

source: <guimenu>Folder</guimenu> <guimenuitem>Mark All Messages as Read</guimenuitem>
de: <guimenu>Ordner</guimenu> <guimenuitem>Alle Nachrichten als gelesen markieren</guimenuitem>

source: Sets the status of all new and unread messages in the current folder to read.
de: Setzt den Status aller neuen und ungelesenen Nachrichten des aktuellen Ordners auf gelesen.

source: <shortcut> <keycap>F5</keycap> </shortcut> <guimenu>Folder</guimenu> <guimenuitem>Update Folder</guimenuitem>
de: <shortcut><keycap>F5</keycap></shortcut> <guimenu>Ordner</guimenu> <guimenuitem>Ordner aktualisieren</guimenuitem>

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>F5</keycap></keycombo> </shortcut> <guimenu>Folder</guimenu> <guimenuitem>Update Folder and All Its Subfolders</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>F5</keycap></keycombo></shortcut> <guimenu>Ordner</guimenu><guimenuitem>Diesen Ordner und alle seine Unterordner aktualisieren</guimenuitem>

source: <guimenu>Folder</guimenu> <guimenuitem>Move All to Trash</guimenuitem>
de: <guimenu>Ordner</guimenu> <guimenuitem>Alle Nachrichten in den Papierkorb werfen</guimenuitem>

source: Moves all of the messages in the selected folder into the trash folder.
de: Verschiebt alle Nachrichten des ausgewählten Ordners in den Papierkorb.

source: This is only available if the currently selected folder is not a trash folder. If the currently selected folder is a trash folder, you will see <guilabel>Empty Trash</guilabel>. Please see next section for details.
de: Diese Funktion steht nur zur Verfügung, wenn der ausgewählte Ordner kein Papierkorb ist. In diesem Fall wird <guilabel>Papierkorb leeren</guilabel> angezeigt.

source: <guimenu>Folder</guimenu> <guimenuitem>Empty Trash</guimenuitem>
de: <guimenu>Ordner</guimenu> <guimenuitem>Papierkorb leeren</guimenuitem>

source: Permanently deletes all messages.
de: Löscht alle Nachrichten unwiderruflich.

source: This is only available if the currently selected folder is a trash folder.
de: Diese Funktion steht nur zur Verfügung, wenn der aktuelle Ordner ein Papierkorb ist.

source: <guimenu>Folder</guimenu> <guimenuitem>Archive Folder...</guimenuitem>
de: <guimenu>Ordner</guimenu> <guimenuitem>Ordner archivieren ...</guimenuitem>

source: <action>Brings up a dialog to allow you to create an archive of the currently selected folder.</action> Please see <link linkend="folder-archive">Folder Archive</link> for details.
de: <action>Öffnet den Dialog, in dem Sie ein Archi des aktuell ausgewählten Ordners erstellen können.</action>Weitere Informationen dazu im Abschnitt <link linkend="folder-archive">Ordner archivieren</link>.

source: <guimenu>Folder</guimenu> <guimenuitem>Delete Folder</guimenuitem>
de: <guimenu>Ordner</guimenu> <guimenuitem>Ordner entfernen</guimenuitem>

source: Removes the selected folder and all its contents, including subfolders.
de: Entfernt den ausgewählten Ordner und seinen gesamten Inhalt, einschließlich enthaltener Ordner.

source: Please note that there is no way to access the contents of a folder after it has been removed.
de: Hinweis: Es gibt keine Möglichkeit, den Inhalt wieder zu bekommen, nachdem ein Ordner entfernt wurde.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>*</keycap></keycombo> </shortcut> <guimenu>Folder</guimenu> <guimenuitem>Remove Duplicate Messages</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>*</keycap></keycombo></shortcut> <guimenu>Ordner</guimenu> <guimenuitem>Doppelte Nachrichten löschen</guimenuitem>

source: Searches the folder for duplicate messages and deletes them.
de: Durchsucht den Ordner nach doppelten Nachrichten und löscht sie.

source: <guimenu>Folder</guimenu> <guimenuitem>Apply All Filters On Folder</guimenuitem>
de: <guimenu>Datei</guimenu> <guimenuitem>Alle Filter auf diesen Ordner anwenden</guimenuitem>

source: <action>Applies all configured filters on the currently selected folder.</action> Please see <link linkend="filter-dialog-id">Filter dialog</link> for more information on filters.
de: <action>Wendet alle eingerichteten Filter auf den aktuell ausgewählten Ordner an.</action> Weitere Informationen dazu finden Sie im Abschnitt <link linkend="filter-dialog-id">Filterdialog</link>.

source: <guimenu>Folder</guimenu> <guimenuitem>Prefer HTML to Plain Text</guimenuitem>
de: <guimenu>Ordner</guimenu> <guimenuitem>HTML-Ansicht vor Klartext bevorzugen</guimenuitem>

source: If enabled then &html; messages in this folder will be shown using &html; rendering.
de: Zeigt die &html;-Nachrichten in diesem Ordner im &html;-Format an.

source: For security reasons, we recommend to only activate this for folders which only contain trusted messages.
de: Aus Sicherheitsgründen sollte diese Einstellung nur für Ordner mit vertrauenswürdigen Nachrichten verwendet werden.

source: <guimenu>Folder</guimenu> <guimenuitem>Load External References</guimenuitem>
de: <guimenu>Ordner</guimenu> <guimenuitem>Externe Referenzen laden</guimenuitem>

source: If you have &html; messages enabled (see above), then you have the option to enable this to have <action>images and resources linked from the web will load automatically.</action>
de: Haben Sie die Anzeige von &html;-Nachrichten eingeschaltet, können Sie auch noch diese Einstellung auswählen, um <action>Bilder und Ressourcen von Verknüpfungen zum Internet automatisch zu laden.</action>

source: <guimenu>Folder</guimenu> <guimenuitem>Mailing List Management...</guimenuitem>
de: <guimenu>Ordner</guimenu> <guimenuitem>Verwaltung von Mailinglisten ...</guimenuitem>

source: <action>This opens up the mailing list management dialog.</action> Please see <link linkend="folders-properties-mailinglist">Mailing List dialog</link> for more information on mailing lists.
de: <action>Mit dieser Aktion öffnen Sie den Dialog zur Verwaltung von Mailinglisten.</action> Weitere Informationen dazu finden Sie im Abschnitt <link linkend="folders-properties-mailinglist">Mailinglisten</link>.

source: <guimenu>Folder</guimenu> <guimenuitem>Assign Shortcut...</guimenuitem>
de: <guimenu>Ordner</guimenu> <guimenuitem>Kurzbefehl festlegen ...</guimenuitem>

source: This allows you to assign a keyboard shortcut to the currently selected folder.
de: Ermöglicht die Zuweisung eines Kurzbefehls für den aktuell ausgewählten Ordner.

source: Message Menu
de: Das Menü Nachricht

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo> </shortcut> <guimenu>Message</guimenu> <guimenuitem>New Message...</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo></shortcut> <guimenu>Nachricht</guimenu> <guimenuitem>Neue Nachricht ...</guimenuitem>

source: <action>Opens the <link linkend="the-composer-window">composer window</link></action> so you can write a new message.
de: <action>Öffnet das Fenster <link linkend="the-composer-window">Nachricht erstellen</link></action> zur Eingabe einer neuen Nachricht.

source: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>N</keycap></keycombo> </shortcut> <guimenu>Message</guimenu> <guimenuitem>New Message to Mailing-List...</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;&Shift;<keycap>N</keycap></keycombo></shortcut> <guimenu>Nachricht</guimenu> <guimenuitem>Neue Nachricht an Mailingliste ...</guimenuitem>

source: <action>Opens the composer window so you can write a new mail.</action> If the current folder holds a mailing list and has a posting address defined, this address will be the default <guilabel>To:</guilabel> address.
de: <action>Öffnet ein neues ‚Nachricht erstellen‘-Fenster</action>, sodass Sie eine neue Nachricht erstellen können. Falls der momentan ausgewählte Ordner eine Mailingliste beinhaltet und eine Sendeadresse definiert ist, wird diese Adresse für <guilabel>An:</guilabel> verwendet.

source: <shortcut> <keycap>R</keycap></shortcut> <guimenu>Message</guimenu> <guimenuitem>Reply...</guimenuitem>
de: <shortcut><keycap>R</keycap></shortcut> <guimenu>Nachricht</guimenu> <guimenuitem>Antworten ...</guimenuitem>

source: <action>Opens up the composer window, inserts the quoted text of the currently selected message and presets the <guilabel>To:</guilabel> field either with the mailing-list address (if you reply to a mailing-list message) or with the preferred reply address of the sender.</action> If you want to control which address the <guilabel>To:</guilabel> field is preset with then you should use <link linkend="reader-message-reply-special">Reply Special</link>. Your identity will automatically be set to the identity this message was originally sent to.
de: <action>Öffnet das Editorfenster</action>, fügt den markierten Text der aktuellen Nachricht ein, und besetzt das Feld <guilabel>An:</guilabel> entweder mit der Adresse einer Mailingliste (wenn Sie auf eine Nachricht auf einer Mailingliste antworten) oder mit der bevorzugten Antwortadresse des Absenders. Möchten Sie steuern, welche Adresse im Feld <guilabel>An</guilabel> benutzt wird, sollten Sie <link linkend="reader-message-reply-special">Antworten (speziell)</link> verwenden. Als Ihre Identität wird automatisch diejenige verwendet, an die diese Nachricht verschickt worden ist.

source: <shortcut> <keycap>A</keycap> </shortcut> <guimenu>Message</guimenu> <guimenuitem>Reply to All...</guimenuitem>
de: <shortcut><keycap>A</keycap></shortcut> <guimenu>Nachricht</guimenu> <guimenuitem>Allen antworten ...</guimenuitem>

source: <action>Opens up the composer window, inserts the quoted text of the currently selected message and presets the <guilabel>To:</guilabel> field either with the mailing-list address (if you reply to a mailing-list message) or with the preferred reply address of the sender. The <guilabel>Copy to (CC):</guilabel> field is preset with the addresses of all other recipients of the currently selected message excluding your own address.</action> Your identity will automatically be set to the identity this message was originally sent to.
de: <action>Öffnet ein Fenster mit dem E-Mail-Editor, fügt den zitierten Text der aktuellen Nachricht ein, und besetzt das <guilabel>An:</guilabel>-Feld entweder mit der Adresse einer Mailingliste (wenn Sie auf eine Nachricht auf einer Mailingliste antworten) oder mit der bevorzugten Antwortadresse des Absenders</action>. Das Feld <guilabel>Kopie:</guilabel> wird mit den Adressen aller anderen Empfänger der aktuellen Nachricht mit Ausnahme Ihrer eigenen Adresse besetzt. Als Ihre Identität wird automatisch diejenige verwendet, an die diese Nachricht verschickt worden ist.

source: <shortcut> <keycombo action="simul">&Shift;<keycap>A</keycap></keycombo> </shortcut><guimenu>Message</guimenu> <guisubmenu>Reply Special</guisubmenu> <guimenuitem>Reply to Author...</guimenuitem>
de: <shortcut><keycombo action="simul">&Shift;<keycap>A</keycap></keycombo></shortcut> <guimenu>Nachricht</guimenu><guisubmenu>Antworten (speziell)</guisubmenu><guimenuitem>Antwort an Verfasser ...</guimenuitem>

source: <action>Opens up the composer window, inserts the quoted text of the currently selected message and presets the <guilabel>To:</guilabel> field with the preferred reply address of the sender.</action> Your identity will automatically be set to the identity this message was originally sent to.
de: <action>Öffnet ein Fenster mit dem E-Mail-Editor, fügt den zitierten Text der aktuellen Nachricht ein, und trägt die bevorzugte Antwortadresse des Absenders in das <guilabel>An:</guilabel>-Feld ein</action>. Es wird diejenige eigene Identität als Absender gewählt, die auch die ursprüngliche Nachricht erhalten hat.

source: <shortcut> <keycap>L</keycap> </shortcut> <guimenu>Message</guimenu> <guisubmenu>Reply Special</guisubmenu> <guimenuitem>Reply to Mailing-List...</guimenuitem>
de: <shortcut><keycap>L</keycap></shortcut> <guimenu>Nachricht</guimenu><guisubmenu>Antworten (speziell)</guisubmenu> <guimenuitem>An die Mailingliste antworten ...</guimenuitem>

source: <action>Opens up the composer window, inserts the quoted text of the currently selected message and presets the <guilabel>To:</guilabel> field with the mailing-list address.</action> If you did not specify a mailing-list address for the currently selected folder and &kmail; cannot determine the posting address from the currently selected message then the <guilabel>To:</guilabel> field will be empty. Your identity will automatically be set to the identity this message was originally sent to.
de: <action>Öffnet ein Fenster mit dem E-Mail-Editor, fügt den zitierten Text der aktuellen Nachricht ein, und trägt die Antwortadresse der Mailingliste in das Feld <guilabel>An:</guilabel> ein</action>. Wenn Sie keine Mailinglisten-Adresse für den aktuellen Ordner angegeben haben und &kmail; die Adresse nicht aus der aktuellen Nachricht bestimmen kann, verbleibt das Feld <guilabel>An:</guilabel> leer. Als Identität für den Absender wird automatisch jene gewählt, die die ursprüngliche Nachricht erhalten hat.

source: <shortcut> <keycombo action="simul">&Shift;<keycap>R</keycap></keycombo> </shortcut> <guimenu>Message</guimenu> <guisubmenu>Reply Special</guisubmenu> <guimenuitem>Reply Without Quote...</guimenuitem>
de: <shortcut><keycombo action="simul">&Shift;<keycap>R</keycap></keycombo></shortcut> <guimenu>Nachricht</guimenu> <guisubmenu>Antworten (speziell)</guisubmenu><guimenuitem>Ohne Zitat antworten ...</guimenuitem>

source: Works just like <guimenuitem>Reply...</guimenuitem> except that the text of the currently selected message is not quoted.
de: Funktioniert wie <guimenuitem>Antworten ...</guimenuitem>, zitiert aber den Text der aktuellen Nachricht nicht.

source: <guimenu>Message</guimenu> <guisubmenu>Reply Special</guisubmenu> <guimenuitem>Reply With Custom Template</guimenuitem>
de: <guimenu>Nachricht</guimenu><guisubmenu>Antworten (speziell)</guisubmenu> <guimenuitem>Mit eigener Vorlage antworten ...</guimenuitem>
