Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdepim/kmail_menus.po
Languages: de

source: <action>Brings up the Anti-Virus Wizard</action> which can help you to set up scanning messages for viruses. Please see <link linkend="the-anti-virus-wizard">Anti-Virus Wizard</link> for details.
de: <action>Startet einen Assistenten</action>, der Ihnen bei der Einrichtung der Viruserkennung hilft. Weitere Informationen dazu im Abschnitt <link linkend="the-anti-virus-wizard">Anti-Virus-Assistent</link>.

source: Settings Menu
de: Das Menü Einstellungen

source: If the menu item you are looking for is missing, please see <ulink url="help:/fundamentals/ui.html#menus-settings">Settings Menu</ulink> of the &kde; Fundamentals. The items listed here are &kmail; specific.
de: Hier werden nur die besonderen Einträge für &kmail; aufgeführt, alle sonstigen Menüeinträge finden Sie im <ulink url="help:/fundamentals/ui.html#menus-settings">>Menu Einstellungen</ulink> in den &kde;-Grundlagen.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>H</keycap></keycombo> </shortcut> <guimenu>Settings</guimenu> <guimenuitem>Show Quick Search bar</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>H</keycap></keycombo></shortcut> <guimenu>Einstellungen</guimenu> <guimenuitem>Schnellsuche anzeigen</guimenuitem>

source: <action>Allows you to enable the Quick Search bar,</action> which allows you to quickly search for messages matching a search text, is visible.
de: <action>Schaltet die Anzeige der Schnellsuchleiste ein.</action> Wenn diese eingeblendet ist, können Sie in der Suchleiste schnell nach Nachrichten suchen, die einen bestimmten Text im angezeigten Vorspann enthalten.

source: <guimenu>Settings</guimenu> <guimenuitem>Configure Filters...</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>Filter einrichten ...</guimenuitem>

source: Opens the <link linkend="filters">Message Filters</link> window.
de: Öffnet den Dialog <link linkend="filters">Filterregeln</link>.

source: <guimenu>Settings</guimenu> <guimenuitem>Manage Sieve Scripts...</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>„Sieve“-Skripte verwalten ...</guimenuitem>

source: If your mail server supports sieve (server side filtering), you would <action>configure your scripts here</action>.
de: Wenn Ihr E-Mail-Server Sieve (Filtern auf dem Server) unterstützt, können Sie hiermit <action>Ihre Skripte einrichten</action>.

source: <guimenu>Settings</guimenu> <guimenuitem>Configure Automatic Archiving...</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>Automatische Archivierung einrichten ...</guimenuitem>

source: <action>Brings up the dialog to set up automatic archiving.</action> Please see <ulink url="help:/akonadi_archivemail_agent">Automatic Archiving</ulink> for details.
de: <action>Öffnet den Dialog für die automatische Archivierung.</action> Weitere Informationen dazu im Handbuch <ulink url="help:/akonadi_archivemail_agent">Automatische Archivierung</ulink>.

source: <guimenu>Settings</guimenu> <guimenuitem>Configure Send Later Agent...</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>Agent zum späteren Senden einrichten ...</guimenuitem>

source: <action>Brings up a dialog that allows you to modify and remove emails that have been sent using the send later feature.</action> Please see <ulink url="help:/akonadi_sendlater_agent">Send Later Agent</ulink> for details.
de: <action>Öffnet einen Dialog, um das Versenden von geplanten E-Mails zu bearbeiten oder sie zu entfernen.</action> Weitere Informationen dazu im Handbuch <ulink url="help:/akonadi_sendlater_agent">Agent zum späteren Senden</ulink>.

source: <guimenu>Settings</guimenu> <guimenuitem>Configure Folder Archive Agent...</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>Agent zur Ordner-Archivierung einrichten ...</guimenuitem>

source: <action>Brings up a dialog that allows you to configure accounts to use the folder archive agent feature with.</action> Please see <ulink url="help:/akonadi_folderarchive_agent">Folder Archive Agent</ulink> for details.
de: <action>Öffnet einen Dialog, in dem Sie für jedes einzelne Postfach die Funktion zur Archivierung von Ordnern einrichten können.</action> Weitere Informationen dazu im Abschnitt <ulink url="help:/akonadi_folderarchive_agent">Agent zur Ordner-Archivierung</ulink>.

source: <guimenu>Settings</guimenu> <guimenuitem>Configure Notifications...</guimenuitem>
de: <guimenu>Einstellungen</guimenu><guimenuitem>Benachrichtigungen festlegen ...</guimenuitem>

source: <action>Opens a dialog that lets you configure what happens when new mail arrives,</action> &eg; play a sound, display a popup, &etc;
de: <action>Öffnet einen Dialog, in dem Sie Benachrichtigungen einstellen können</action> für den Fall, das neue Nachrichten eingehen, &eg; einen Klang abspielen oder eine Meldung anzeigen &etc;

source: Help Menu
de: Das Menü Hilfe

source: <ulink url="help:/fundamentals/ui.html#menus-help"> Help Menu</ulink> of the &kde; Fundamentals.
de: Siehe <ulink url="help:/fundamentals/ui.html#menus-help">Hilfe-Menü</ulink> in den &kde;-Grundlagen.

source: The &kmail; Composer Window
de: Das &kmail;-Editorfenster

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo> </shortcut> <guimenu>Message</guimenu> <guimenuitem>New Composer</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo></shortcut> <guimenu>Nachricht</guimenu> <guimenuitem>Neue Nachricht</guimenuitem>

source: Opens up a new composer window.
de: Öffnet ein neues Editorfenster zum Schreiben einer neuen Nachricht.

source: <guimenu>Message</guimenu> <guimenuitem>New Main Window</guimenuitem>
de: <guimenu>Nachricht</guimenu> <guimenuitem>Neues Hauptfenster</guimenuitem>

source: Creates a new main window.
de: Öffnet ein neues <guilabel>Hauptfenster</guilabel>.

source: <guimenu>Message</guimenu> <guimenuitem>New AddressBook Contact</guimenuitem>
de: <guimenu>Nachricht</guimenu> <guimenuitem>Neuer Adressbuchkontakt</guimenuitem>

source: <action>Brings up the &kontact; New Contact Dialog</action> to add a new contact your addressbook.
de: <action>Öffnet den Dialog Neuer Kontakt</action>, in dem Sie neue Kontaktdaten in Ihr Adressbuch eingeben können.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Return</keycap></keycombo> </shortcut> <guimenu>Message</guimenu> <guimenuitem>Send Mail</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>Eingabe</keycap></keycombo></shortcut> <guimenu>Nachricht</guimenu> <guimenuitem>E-Mail versenden</guimenuitem>

source: <action>Sends the message immediately.</action> If you use &SMTP; to send your messages and the &SMTP; server is not reachable, the message will be put into the outbox and you will get an error message. After the connection issues are resolved, you can send the messages in the outbox using <menuchoice><guimenu>File</guimenu><guimenuitem>Send Queued Messages</guimenuitem></menuchoice>.
de: <action>Versendet die Nachricht sofort</action>. Falls Sie &SMTP; zum Versand von Nachrichten verwenden und der &SMTP;-Server nicht erreichbar ist, wird die Nachricht nach einer Fehlermeldung in den Postausgang gestellt. Wenn die Verbindungsprobleme gelöst sind, kann die Nachricht dann später über <menuchoice><guimenu>Datei</guimenu><guimenuitem>Postausgang versenden</guimenuitem></menuchoice> abgeschickt werden.

source: <guimenu>Message</guimenu> <guimenuitem>Send Mail Via</guimenuitem>
de: <guimenu>Nachricht</guimenu> <guimenuitem>E-Mail versenden mit</guimenuitem>

source: Allows you to select which outgoing mail server you wish to use to send the message.
de: Mit dieser Aktion können Sie einen ausgehenden E-Mail-Server wählen, den Sie zum Versenden der Nachricht verwenden möchten.

source: <guimenu>Message</guimenu> <guimenuitem>Send Later</guimenuitem>
de: <guimenu>Nachricht</guimenu> <guimenuitem>Später senden</guimenuitem>

source: <action>Brings up the send later dialog.</action> Please see <link linkend="send-later">Send Later</link> for details.
de: <action>Öffnet den Dialog zum späteren Versendet der Nachricht.</action>. Weitere Informationen dazu im Abschnitt <link linkend="send-later">Später senden</link>.

source: <guimenu>Message</guimenu> <guimenuitem>Send Later Via</guimenuitem>
de: <guimenu>Nachricht</guimenu> <guimenuitem>Später senden mit</guimenuitem>

source: Allows you to choose which outgoing account to send your send later configured message.
de: Mit dieser Aktion können Sie einen ausgehenden Versandweg wählen, den Sie zum späteren Versenden der Nachricht verwenden möchten.

source: <guimenu>Message</guimenu> <guimenuitem>Save as File</guimenuitem>
de: <guimenu>Nachricht</guimenu> <guimenuitem>Als Datei speichern</guimenuitem>

source: Saves the message as a text document.
de: Speichert die Nachricht als Textdokument.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>S</keycap></keycombo> </shortcut> <guimenu>Message</guimenu> <guimenuitem>Save as Draft</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>S</keycap></keycombo> </shortcut> <guimenu>Nachricht</guimenu> <guimenuitem>Als Entwurf speichern</guimenuitem>

source: <action>Save the message in the <guilabel>drafts</guilabel> folder</action> so you can later edit and send it.
de: <action>Speichert die Nachricht im Ordner <guilabel>Entwürfe</guilabel></action>. Man kann sie dort später weiter bearbeiten und dann senden.

source: <guimenu>Message</guimenu> <guimenuitem>Save as Template</guimenuitem>
de: <guimenu>Nachricht</guimenu> <guimenuitem>Als Vorlage speichern</guimenuitem>

source: Allows you to <action>save your message as a template.</action> Please see <link linkend="new-compose-from-templates">Compose from templates</link> for details on templates.
de: Mit dieser Aktion können Sie Ihre <action>Nachricht als Vorlage speichern.</action>. Weitere Informationen dazu finden Sie im Abschnitt <link linkend="new-compose-from-templates">Neue Nachricht von Vorlage</link>.

source: <guimenu>Message</guimenu> <guimenuitem>Insert Text File...</guimenuitem>
de: <guimenu>Nachricht</guimenu> <guimenuitem>Textdatei einfügen ...</guimenuitem>

source: <action>Inserts a text file into the message text,</action> starting at the cursor position.
de: <action>Fügt an der aktuellen Cursor-Position eine Textdatei in die Nachricht ein</action>.

source: <guimenu>Message</guimenu> <guimenuitem>Insert Recent Text File...</guimenuitem>
de: <guimenu>Nachricht</guimenu> <guimenuitem>Kürzlich verwendete Textdatei einfügen ...</guimenuitem>

source: Allows you to choose from a list of recently inserted text files to insert into your message. Select <guimenuitem>Clear List</guimenuitem> to clear the list.
de: Ermöglicht die Auswahl von kürzlich verwendeten Dateien, um Sie in Ihre Nachricht einzufügen. Wählen Sie <guimenuitem>Liste leeren</guimenuitem>, um alle Einträge zu entfernen.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>P</keycap></keycombo> </shortcut> <guimenu>Message</guimenu> <guimenuitem>Print...</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>P</keycap></keycombo></shortcut> <guimenu>Nachricht</guimenu> <guimenuitem>Drucken ...</guimenuitem>

source: Prints the current text.
de: Druckt die gerade angezeigte Nachricht.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>W</keycap></keycombo> </shortcut> <guimenu>Message</guimenu> <guimenuitem>Close</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>W</keycap></keycombo></shortcut> <guimenu>Nachricht</guimenu> <guimenuitem>Schließen</guimenuitem>

source: Closes this composer window.
de: Schließt das ‚Nachricht erstellen‘-Fenster.

source: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>O</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Paste as Quotation</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>O</keycap></keycombo> </shortcut> <guimenu>Bearbeiten</guimenu> <guimenuitem>Als Zitat einfügen</guimenuitem>

source: <action>Pastes the text from the clipboard</action> marked as quotation.
de: <action>Fügt den Text aus der Zwischenablage</action> als Zitat markiert ein.

source: <guimenu>Edit</guimenu> <guimenuitem>Paste as Attachment</guimenuitem>
de: <guimenu>Bearbeiten</guimenu> <guimenuitem>Als Anhang einfügen</guimenuitem>

source: <action>Pastes the text from the clipboard</action> as an attachment.
de: <action>Fügt den Text aus der Zwischenablage</action> als Anhang ein.

source: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>V</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Paste Without Formatting</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;&Shift;<keycap>V</keycap></keycombo></shortcut> <guimenu>Bearbeiten</guimenu><guimenuitem>Ohne Formatierung einfügen</guimenuitem>

source: <action>Pastes the text from the clipboard</action> exactly as is, with no formatting.
de: <action>Fügt den Text aus der Zwischenablage</action> unformatiert ein.

source: <guimenu>Edit</guimenu> <guimenuitem>Clean Spaces</guimenuitem>
de: <guimenu>Bearbeiten</guimenu> <guimenuitem>Zwischenräume komprimieren</guimenuitem>

source: This replaces multiple line breaks or spaces with single line breaks or spaces. It works on the current selection or the complete message text if there is no selection.
de: Es werden mehrere Zeilenumbrüche oder Leerzeichen durch ein einziges dieser Zeichen ersetzt. Falls Text ausgewählt ist, bezieht sich die Funktion auf diese Auswahl, ansonsten auf den gesamten Nachrichtentext.

source: <guimenu>Edit</guimenu> <guimenuitem>Add Quote Characters</guimenuitem>
de: <guimenu>Bearbeiten</guimenu> <guimenuitem>Zitatzeichen hinzufügen</guimenuitem>

source: Prepends the selected text with quotation marks.
de: Stellt dem ausgewählten Text Anführungsstriche voran.

source: <guimenu>Edit</guimenu> <guimenuitem>Remove Quote Characters</guimenuitem>
de: <guimenu>Bearbeiten</guimenu> <guimenuitem>Zitatzeichen entfernen</guimenuitem>

source: Removes the left-most quotation marks from the selected text.
de: Entfernt die am weitesten links stehenden Anführungsstriche im ausgewählten Text.

source: <guimenu>Edit</guimenu> <guimenuitem>Uppercase</guimenuitem>
de: <guimenu>Bearbeiten</guimenu> <guimenuitem>Großschreibung</guimenuitem>

source: Convert the selected text to uppercase.
de: Wandelt den ausgewählten Text in Großbuchstaben um.

source: <guimenu>Edit</guimenu> <guimenuitem>Lowercase</guimenuitem>
de: <guimenu>Bearbeiten</guimenu> <guimenuitem>Kleinschreibung</guimenuitem>

source: Convert the selected text to lowercase.
de: Wandelt den ausgewählten Text in Kleinbuchstaben um.

source: <guimenu>Edit</guimenu> <guimenuitem>Insert Special Characters</guimenuitem>
de: <guimenu>Bearbeiten</guimenu> <guimenuitem>Sonderzeichen einfügen</guimenuitem>

source: It allows you to insert special character in composer.
de: Ermöglicht das Einfügen von Sonderzeichen in E-Mails.

source: This menu lets you toggle the display of the header fields and other options in the composer window.
de: Dieses Menü lässt Sie unter anderem bestimmen, welche Felder des Vorspanns im Editorfenster angezeigt werden.

source: Currently visible items will have a checkmark shown next to their name in the menu.
de: Angezeigte Vorspannfelder haben einen Haken links neben dem Menüeintrag.

source: Options available are:
de: Mögliche Einstellungen sind:

source: All Fields
de: Alle Felder

source: Identity
de: Identität

source: Dictionary
de: Wörterbuch

source: Sent-Mail folder
de: Ordner für versandte Nachrichten

source: Mail Transport
de: Versandart

source: From
de: Von

source: Reply To
de: Antwort an

source: Subject
de: Betreff

source: Please see <link linkend="composer-headers">Composer Headers</link> for details on these options.
de: Weitere Informationen zu diesen Einstellungen finden Sie im Abschnitt <link linkend="composer-headers">Vorspannfelder im Feditor</link>.

source: <guimenu>View</guimenu> <guimenuitem>Use Fixed Font</guimenuitem>
de: <guimenu>Ansicht</guimenu> <guimenuitem>Feste Zeichenbreiten</guimenuitem>

source: Uses a fixed width (monospaced) font to display the currently edited message. The font to be used can be configured in the <guilabel>Appearance</guilabel> section of &kmail;'s configuration dialog.
de: Verwendet einen Zeichensatz fester Breite (nicht-proportional), um die Nachrichten des aktuellen Ordners anzuzeigen. Der gewünschte Zeichensatz kann im Abschnitt <guilabel>Erscheinungsbild</guilabel> des Einrichtungsdialogs von &kmail; festgelegt werden.

source: <guimenu>View</guimenu> <guimenuitem>Snippets</guimenuitem>
de: <guimenu>Ansicht</guimenu> <guimenuitem>Textbausteine</guimenuitem>

source: Displays a column on the right side of the composer window that allows you to use and create snippets. Please see <link linkend="setup-text-snippets">Snippets</link> for more information.
de: Zeigt rechts im Editorfenster eine Spalte mit Textbausteinen. Aus dieser Spalte können Sie Textbausteine in das Dokument einfügen oder neue Bausteine erstellen. Weitere Informationen dazu im Abschnitt <link linkend="setup-text-snippets">Textbausteine einrichten</link>.

source: <guimenu>View</guimenu> <guimenuitem>Translator</guimenuitem>
de: <guimenu>Ansicht</guimenu> <guimenuitem>Übersetzer</guimenuitem>

source: Displays the translator tool at the bottom of the composer window. Please see <link linkend="using-the-translator">Using the Translator</link> for more information.
de: Zeigt das Übersetzerfenster unten im Editor an. Im Abschnitt <link linkend="using-the-translator">Übersetzungsmodul</link> finden Sie weitere Informationen.

source: Options Menu
de: Das Menü Optionen

source: This menu lets you toggle various options for the current message.
de: In diesem Menü können verschiedene Einstellungen für die aktuelle Nachricht ändern.

source: Currently used options will have a checkmark shown next to their name in the menu.
de: Aktuell angezeigte Vorspannfelder haben einen Haken links neben dem Menüeintrag.

source: <guimenu>Options</guimenu> <guimenuitem>Urgent</guimenuitem>
de: <guimenu>Optionen</guimenu> <guimenuitem>Dringend</guimenuitem>

source: Sets the priority of the message to Urgent. The receiver's email client has to support this or it will have no effect. &kmail; itself does not support priorities for incoming messages.
de: Legt die Priorität der Nachricht als dringend fest. Falls das E-Mail-Programm des Empfängers keine Prioritäten unterstützt, hat diese Einstellung keine Auswirkungen. &kmail; selbst unterstützt keine Prioritäten für eingehende Nachrichten.

source: <guimenu>Options</guimenu> <guimenuitem>Request Disposition Notification</guimenuitem>
de: <guimenu>Einstellungen</guimenu><guimenuitem>Empfangsbenachrichtigung anfordern</guimenuitem>

source: If you choose this option, you request a confirmation email once your message is downloaded and read by its recipient. This has to be supported and enabled by the receiver's email client in order to work.
de: Wenn Sie diese Option aktivieren, werden Sie eine Bestätigungsnachricht erhalten, wenn Ihre Nachricht vom Empfänger heruntergeladen und gelesen wurde. Die Funktion hängt ebenfalls von den Fähigkeiten des E-Mail-Programms des Empfängers ab.

source: See <xref linkend="configure-security-reading-mdns"/> for background information and ways to customize the read receipts that &kmail; itself sends.
de: In <xref linkend="configure-security-reading-mdns"/> finden Sie Hintergrundinformationen und Einstellungsmöglichkeiten zum Lesen der Bestätigungen, die &kmail; selbst sendet.

source: <guimenu>Options</guimenu> <guisubmenu>Sign Message</guisubmenu>
de: <guimenu>Optionen</guimenu> <guisubmenu>Nachricht signieren</guisubmenu>

source: Digitally sign the message using <application>OpenPGP</application>. You can learn more about this in the <link linkend="pgp">chapter on OpenPGP</link>.
de: Fügt zur Nachricht mit Hilfe von <application>OpenPGP</application> eine digitale Signatur hinzu. Mehr zu diesem Thema findet man im <link linkend="pgp">Kapitel über OpenPGP</link>.

source: <guimenu>Options</guimenu> <guisubmenu>Encrypt Message</guisubmenu>
de: <guimenu>Optionen</guimenu> <guisubmenu>Nachricht verschlüsseln</guisubmenu>

source: Encrypt the message using <application>OpenPGP</application>. You can learn more about this in the <link linkend="pgp">chapter on OpenPGP</link>.
de: Verschlüsselt die Nachricht unter Verwendung von <application>OpenPGP</application>. Mehr zu diesem Thema findet man im <link linkend="pgp">Kapitel über OpenPGP</link>.

source: <guimenu>Options</guimenu> <guisubmenu>Cryptographic Message Format</guisubmenu>
de: <guimenu>Optionen</guimenu> <guisubmenu>Nachrichten-Verschlüsselungsformat</guisubmenu>

source: Choose the cryptographic message format to use to digitally sign and/or encrypt the message in. Please see <link linkend="cryptographic-message-formats"> Cryptographic Message Formats</link> for more information.
de: Wählt das kryptografische Nachrichtenformat aus, mit dem die Nachricht digital signiert und/oder verschlüsselt wird. Mehr Informationen finden Sie im Abschnitt <link linkend="cryptographic-message-formats">Kryptografische Nachrichtenformate</link>.

source: <guimenu>Options</guimenu> <guisubmenu>Rich Text Editing</guisubmenu>
de: <guimenu>Optionen</guimenu> <guisubmenu>Bearbeiten in Rich-Text</guisubmenu>

source: Enables Rich Text/&html; editing.
de: Schaltet das Bearbeiten von „Rich Text“-/&html;-Nachrichten ein.

source: <guimenu>Options</guimenu> <guisubmenu>Encoding</guisubmenu>
de: <guimenu>Optionen</guimenu> <guisubmenu>Kodierung</guisubmenu>

source: Set the charset encoding of this message. The chosen encoding will appear in the header of the outgoing mail. You can use <guilabel>Auto</guilabel> for almost all cases, &kmail; will tell you if you need to select a different encoding manually.
de: Legt die Kodierung für diese Nachricht fest. Die ausgewählte Einstellung erscheint im Vorspann der ausgehenden Nachricht. Man kann in fast allen Fällen <guilabel>Autom. erkennen</guilabel> auswählen. &kmail; meldet sich, wenn die Kodierung manuell festgelegt werden muss.

source: <guimenu>Options</guimenu> <guimenuitem>Wordwrap</guimenuitem>
de: <guimenu>Optionen</guimenu> <guimenuitem>Zeilenumbruch</guimenuitem>

source: Toggles the automatic wordwrap. It may be useful to turn it off if you want to paste long lines that should not wrap.
de: Schaltet den automatischen Zeilenumbruch an/aus. Es kann sinnvoll sein, diese Funktion zu deaktivieren, wenn man lange Zeilen einfügen möchte und diese nicht umgebrochen werden sollen.

source: <guimenu>Options</guimenu> <guimenuitem>Automatic Spellchecking</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>Automatische Rechtschreibprüfung</guimenuitem>

source: Toggles automatic spellchecking.
de: Schaltet die automatische Rechtschreibprüfung ein oder aus.

source: Attach Menu
de: Das Menü Anhängen

source: This menu lets you select attachment options.
de: In diesem Menü können Sie die Einstellungen bezüglich der angehängten Daten ändern.

source: <guimenu>Attach</guimenu> <guimenuitem>Append Signature</guimenuitem>
de: <guimenu>Anhängen</guimenu> <guimenuitem>Signatur anfügen</guimenuitem>

source: Appends your signature (<quote>footer</quote>) to the end of the message. Please see <link linkend="configure-identity-signature">Configure Identity Signature</link> for details on configuring your signature.
de: Fügt den Inhalt Ihrer Signatur-Datei (<quote>Fußnote</quote>) an die Nachricht an. Weitere Informationen zum Einrichten der Signatur finden Sie im Abschnitt <link linkend="configure-identity-signature">Signatur</link>.

source: <guimenu>Attach</guimenu> <guimenuitem>Prepend Signature</guimenuitem>
de: <guimenu>Anhängen</guimenu> <guimenuitem>Signatur voranstellen</guimenuitem>
