Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdepim/kmail_faq.po
Languages: de

source: You <emphasis>really</emphasis> should test if encryption works before you use it. &kmail; partly relies on <application>PGP</application>/<application>GnuPG</application>'s error strings, which often change between different versions.
de: Man sollte <emphasis>unbedingt</emphasis> testen, ob die Verschlüsselung funktioniert, bevor man sie verwendet. &kmail; ist teilweise auf die Fehlermeldungen von <application>PGP</application>/<application>GnuPG</application> angewiesen. Diese können sich aber von Version zu Version ändern.

source: &kmail; will not encrypt messages with an untrusted (unsigned) public key: if you want to encrypt to such a key you should check the identity of the key owner and only then sign the key with your secret key; if you do not want to or cannot check the identity of the key owner but nevertheless want to encrypt the message then please sign the key locally with <userinput><command>gpg</command> <option>--lsign</option> <replaceable>keyID</replaceable></userinput>.
de: &kmail; verschlüsselt Nachrichten nicht mit nicht vertrauenswürdigen (unsignierten) Schlüsseln. Falls man einen solchen Schlüssel zur Verschlüsselung verwenden möchte, sollte man die Identität des Besitzers überprüfen und erste danach den Schlüssel mit dem eigenen geheimen Schlüssel signieren. Falls man die Identität nicht überprüfen kann, die Nachricht aber dennoch verschlüsseln will, sollte man sie lokal durch <userinput><command>gpg</command><option>--lsign</option> <replaceable>SchlüsselID</replaceable></userinput> signieren.

source: Trusting a foreign public key without checking it is not a good idea.
de: Einem fremden öffentlichen Schlüssel ohne Überprüfung zu vertrauen ist keine gute Idee.

source: &kmail; cannot encrypt and sign attachments if you are using the built-in OpenPGP support. For encrypted and signed attachments you need to have crypto plugins installed and configured.
de: &kmail; kann mit der eingebauten OpenPGP-Unterstützung Anhänge weder signieren noch verschlüsseln. Falls man signierte oder verschlüsselte Anhänge verwenden möchte, muss man ein Kryptographie-Modul installieren und einrichten.

source: Starting with GnuPG 1.0.7 you have to set your own key to ultimate ownertrust: it is no longer implicitly done for you.
de: Seit GnuPG 1.0.7 muss man selbst dem eigenen Schlüssel das Attribut uneingeschränktes Vertrauen des Besitzers geben. Das wird nicht mehr automatisch durchgeführt.

source: Where does &kmail; save my settings and my mail?
de: Wo speichert &kmail; die Benutzereinstellungen und meine Nachrichten?

source: Most &kmail; settings are stored in <filename>$(kde4-config --localprefix)/share/config/kmail2rc</filename> and the <emphasis>Akonadi</emphasis>-controlled entries are stored in the following folders and files:
de: Die meisten Einstellungen für &kmail; werden in <filename>$(kde4-config --localprefix)/share/config/kmail2rc</filename> gespeichert und die Einträge für <emphasis>Akonadi</emphasis> finden Sie in den folgenden Ordnern und Dateien:

source: <filename class="directory">$(kde4-config --localprefix)/share/apps/nepomuk/</filename> (&kaddressbook; stores contact groups in <emphasis>Nepomuk</emphasis>.)
de: <filename class="directory">$(kde4-config --localprefix)/share/apps/nepomuk/</filename> (&kaddressbook; speichert Kontaktgruppen in <emphasis>Nepomuk</emphasis>.)

source: Note that some of the files are hidden: remember to also copy those if you want to backup or archive your mails.
de: Beachten Sie dass einige der Dateien versteckt sind. Kopieren Sie auch diese versteckten Dateien, wenn Sie Ihre E-Mails sichern oder archivieren möchten.

source: Why did &kmail; regenerate the index of a folder?
de: Warum erzeugt &kmail; die Index-Datei eines Ordners neu?

source: &kmail; regenerates the index of a folder whenever the index appears to be out of date, &ie; whenever the contents of a folder are newer than the index. &kmail; regenerates the index in this case in order to prevent the loss or corruption of messages. Unfortunately, currently-deleted messages might reappear and message flags (like important, etc.) might be lost when the index is regenerated.
de: &kmail; erzeugt die Index-Datei eines Ordners immer dann neu, wenn dieser Index veraltet erscheint, &ie; wenn der Inhalt eines Ordners neuer als die Index-Datei ist. &kmail; erzeugt die Index-Datei in diesem Fall neu, um den Verlust oder die Zerstörung von Daten zu verhindern. Unglücklicherweise können dadurch gelöschte Nachrichten wieder erscheinen und der Nachrichtenstatus (wie wichtig &etc;) kann verloren gehen.

source: An outdated index can have several causes; the two most important causes are:
de: Ein veralteter Index kann mehrere Gründe haben. Die zwei wichtigsten sind:

source: Some other program modified the contents of the folder: if you want to use &kmail; together with procmail then please read <link linkend="faq-procmail">this &FAQ;</link>. If you want to use &kmail; together with another email client then please read <link linkend="faq-other-muas">this &FAQ;</link>.
de: Ein anderes Programm hat den Inhalt des Ordners verändert. Falls man &kmail; zusammen mit einem anderen Programm wie procmail verwendet, sollte man <link linkend="faq-procmail">diese &FAQ;</link> lesen. Falls man &kmail; zusammen mit einem anderen E-Mail-Programm verwendet, sollte man <link linkend="faq-other-muas">diese &FAQ;</link> ebenfalls lesen.

source: If your mail folder is on a volume which is mounted via NFS and if the clock of the NFS server is ahead of the clock of your computer then the NFS server sometimes reports a wrong file date for the index file. In this case &kmail; assumes that the index is outdated although in reality it is not. To fix this problem you (or your system administrator) have to make sure that the clock of the NFS server and the clock of your computer are always in sync. One way to achieve this is the use of the ntp daemon.
de: Falls sich der Mail-Ordner in einem per NFS eingebundenen Dateisystem befindet und die Uhr des NFS-Servers vorgeht, dann erzeugt der NFS-Server bisweilen ein falsches Datum für die Index-Datei. In diesem Fall geht &kmail; davon aus, das der Index veraltet ist, obwohl er das natürlich nicht ist. Um dieses Problem zu beheben muss der Systemverwalter sicher stellen, das die Uhr des NFS-Servers und die Uhr des lokalen Rechners synchronisiert sind. Dazu kann man unter anderem den ntp-Dämon verwenden.

source: Why does &kmail; not start up?
de: Warum startet &kmail; nicht?

source: <emphasis>Symptom:</emphasis> You want to start &kmail; from a minimal desktop environment like <ulink url="http://en.wikipedia.org/wiki/Fvwm2">fvwm2</ulink>. It does not start.
de: <emphasis>Problem</emphasis>: Sie möchten &kmail; in einer minimalen Arbeitsumgebung wie zum Beispiel <ulink url="http://en.wikipedia.org/wiki/Fvwm2">fvwm2</ulink> starten, aber es funktioniert nicht.

source: <emphasis>Reason:</emphasis> You are missing the <emphasis>dbus</emphasis> functionality.
de: <emphasis>Grund</emphasis>: &kmail; hat keine Verbindung zum <emphasis>&DBus;</emphasis>-System.

source: <emphasis>Solution:</emphasis> Start &kmail; using dbus-launch like this:
de: <emphasis>Lösung</emphasis>: Starten Sie &kmail; mit dbus-launch wie im folgenden Beispiel:

source: Can I use &kmail; together with a different email client, &eg; <application>mutt</application>?
de: Kann ich &kmail; mit einem anderen Programm wie &eg; <application>mutt</application> verwenden?

source: If you're using the mbox format for your folders it is not possible to use a different email client while &kmail; is running. With <application>mutt</application> there may also be problems even if both programs are not running at the same time. We recommend to use the maildir format in this case, this should solve all problems.
de: Falls man das mbox-Format für die Nachrichtenordner verwendet kann man kein anderes E-Mail-Programm verwenden, wenn &kmail; läuft. Mit <application>mutt</application> kann es zusätzliche Probleme geben, auch wenn beide Programme nicht gleichzeitig laufen. In diesem Fall sollte ein Umstieg auf das Maildir-Format alle Probleme beseitigen.

source: How can I convert my mailboxes from mbox to maildir?
de: Wie kann ich meine Postfächer vom mbox- in das Maildir-Format konvertieren?

source: There is no automatic way to do that. You will have to create a new folder in maildir format and copy the messages from the mbox folder into this new folder. Remember to adapt any filter rules connected with the old folder before you delete it.
de: Es gibt keine automatisierte Konvertierung. Man muss einen neuen Nachrichtenordner im Maildir-Format erstellen und die Nachrichten vom mbox-Ordner in diesen neuen Ordner kopieren. Man darf nicht vergessen, alle Filterregeln auf die neuen Ordner umzustellen, bevor man seine alten Ordner entfernt.

source: How can I remove attachments from messages without removing the message itself?
de: Wie kann ich Anhänge entfernen, ohne die zugehörige Nachricht zu entfernen?

source: Open the context menu with a &RMB; click on an attachment and select <guimenuitem>Delete Attachment</guimenuitem>
de: Öffnen Sie das Kontextmenü durch Klicken mit der &RMB; auf einen Anhang und wählen Sie <guimenuitem>Anhang entfernen</guimenuitem>

source: How can I make &kmail; check for new messages at startup?
de: Wie kann ich &kmail; so einrichten, dass beim Programmstart neue Nachrichten abgerufen werden?

source: If &kmail; should always check for new messages at startup then enable <guilabel>Check mail on startup</guilabel> on the <link linkend="configure-accounts-receiving">Accounts configuration page</link>. Otherwise start &kmail; with <command>kmail <option>--check</option></command>.
de: Wenn &kmail; beim Starten immer nach neuen Nachrichten sehen soll, dann schalten Sie die Option <guilabel>Beim Start nach E-Mail sehen</guilabel> auf der Seite <link linkend="configure-accounts-receiving">Zugänge</link> ein. Ansonsten starten Sie &kmail; mit <command>kmail <option>--check</option></command>.

source: Where can I get a list of changes between the versions of &kmail;?
de: Wo kann ich eine Liste der Veränderungen einsehen, die von Version zu Version in &kmail; vorgenommen wurden?

source: The welcome screen lists all important changes for your version. It is displayed when you select <menuchoice><guimenu>Help</guimenu><guimenuitem>&kmail; Introduction</guimenuitem></menuchoice>.
de: Der Begrüßungsbildschirm führt alle wichtigen Änderungen für diese Version auf. Er wird angezeigt, wenn Sie <menuchoice><guimenu>Hilfe</guimenu><guimenuitem>Einführung zu &kmail;</guimenuitem></menuchoice> auswählen.

source: I'm one of those people whose mails consist of 100 quoted lines and one line written by myself. For some reason this annoys other people. Can &kmail; help me and make everyone's life better?
de: Meine E-Mails bestehen häufig aus mehr als 100 zitierten Zeilen und einer einzigen selbst geschriebenen Zeile. Aus für mich unerfindlichen Gründen ärgern sich andere Zeitgenossen darüber. Kann &kmail; hier für Abhilfe sorgen?

source: Sure. Just select a short relevant part of the original mail with the mouse before you reply. Only this part will then be quoted in your reply.
de: Aber sicher. Man wählt einfach den wichtigen Teil der Nachricht mit der Maus aus, bevor man antwortet. Dann wird nur dieser Teil in der Antwort zitiert.

source: For some messages the value in the <guilabel>Date</guilabel> field is <guilabel>unknown</guilabel> or it is not correct.
de: Bei einigen Nachrichten lautet der Eintrag im Feld <guilabel>Datum</guilabel> <guilabel>unbekannt</guilabel> oder er ist falsch.

source: Probably the <quote>Date:</quote> header of these messages is broken and &kmail; cannot interpret it. That is not a bug in &kmail; but in the software that sent the mail.
de: Wahrscheinlich ist der <quote>Date:</quote>-Vorspann dieser Nachrichten kaputt und kann von &kmail; nicht interpretiert werden. Dies ist kein Fehler in &kmail;, sondern in der Software, die die Nachricht versendet hat.

source: My signature has two dashes above it. What's up?
de: Meine Signatur wird immer unterhalb von zwei Strichen eingefügt. Wie kommt das?

source: Separating the signature from the message body with two dashes and a space on a single line is common usage. These symbols permit mail clients who recognize them to trim the signatures from a reply. If your signature does not already have this separator, &kmail; will automatically add it.
de: Zwei Striche und ein Leerzeichen in einer eigenen Zeile vor der Signatur sind ein üblicher E-Mail-Standard. Mit diesem Symbolen können E-Mail-Programme die Signaturen in Antworten abtrennen. Falls diese Zeichen nicht bereits im Signaturtext enthalten sind, stellt &kmail; diese automatisch dem Signaturtext voran.

source: Are there any known bugs in &kmail;?
de: Gibt es Fehler in &kmail;?

source: A list of submitted bugs can be obtained by the query from the <ulink url="https://bugs.kde.org/buglist.cgi?quicksearch=kmail2">Bugzilla page</ulink>. Note that not all these bugs are valid. All in all we think that &kmail; is a very robust piece of software.
de: Eine Liste bisher bekannter Fehler finden Sie mit dieser <ulink url="https://bugs.kde.org/buglist.cgi?quicksearch=kmail2">Abfrage</ulink>. Zu beachten ist, dass nicht alle diese Fehler tatsächlich Fehler sind. Alles in allem ist &kmail; nach unserer Meinung ein sehr robustes Programm.

source: However, you should not run &kmail; while another email client is already accessing the files in the mail directory; if you try to do so, you might lose messages. Note that you should make backups of your messages anyway.
de: Man sollte &kmail; nicht starten, während ein anderes E-Mail-Programm auf die Dateien im Mailordner zugreift. Falls man das dennoch tut, verliert man eventuell Nachrichten. Man sollte sowieso immer Sicherheitskopien seiner Nachrichten anfertigen.

source: &kmail; does not display &HTML; mail properly.
de: &kmail; zeigt &HTML;-Nachrichten nicht korrekt an.

source: References to external content like images, are disabled by default, as they can be used to track whether and when you read a message. Loading external references can be activated in the <guilabel>Security</guilabel> tab in &kmail;'s configuration dialog; also Plugins (like <trademark class="registered">Adobe</trademark> <application>Flash</application>), &Java; and JavaScript will not be displayed in &kmail; for security reasons and there is no way to activate them.
de: Referenzen auf externe Inhalte wie Bilder sind als Voreinstellung abgeschaltet, weil man damit verfolgen kann, ob und wann Sie eine Nachricht lesen. Das Laden externer Referenzen kann auf der Karteikarte <guilabel>Sicherheit</guilabel> im Konfigurationsdialog von &kmail; aktiviert werden. Außerdem werden Module (wie <trademark class="registered">Adobe</trademark> <application>Flash</application>), &Java; und JavaScript in &kmail; aus Sicherheitsgründen grundsätzlich nicht angezeigt werden und es gibt keinen Weg, das zu ändern.

source: Can I use two different versions of &kmail; at the same time? Can I go back from a current version of &kmail; to an older one?
de: Kann man verschiedene Versionen von &kmail; parallel verwenden? Kann man von einer aktuellen Version auf eine ältere Version von &kmail; zurück gehen?

source: You can only run one instance of &kmail; at a time. We also recommend to stick to a certain version and not switch back and forth between different versions. Downgrading to an older version will probably cause problems, &eg; because the index file formats might have changed. Upgrading should never be a problem.
de: Man kann nur eine Instanz von &kmail; starten. Wir empfehlen außerdem, nicht zwischen verschiedenen Versionen hin- und herzuwechseln, sondern bei einer bestimmten Version zu bleiben. Zurück gehen zu einer älteren Version kann Problem bringen, da sich vielleicht das Format der Indexdateien geändert hat. Auf eine aktuellere Version zu wechseln, sollte nie ein Problem darstellen.

source: Does &kmail; support uuencoded files?
de: Unterstützt &kmail; Dateien im Format „UUencode“?

source: Uuencoded attachments are not supported. Save your mail with an uuencoded attachment and use <command>uudecode</command> to decode the attachment.
de: Anhänge in der Kodierung UUencode werden nicht unterstützt. Speichern Sie einen solchen Anhang einer E-Mail und benutzen Sie dann den Befehl <command>uudecode</command> zur Dekodierung.

source: &kmail; crashed while I was writing a mail; is that mail lost now?
de: &kmail; ist beim Schreiben einer E-Mail abgestürzt. Ist diese E-Mail jetzt verloren?

source: &kmail; tries to save your mail to <filename class="directory">$(kde4-config --localprefix)/share/apps/kmail/autosave</filename> in case of a crash. The next time you start &kmail; the mail composer should appear with your mail again; If it does not, try to open the files in <filename class="directory">$(kde4-config --localprefix)/share/apps/kmail/autosave</filename> with an editor. If there are no files in this folder then the crash was so bad that &kmail; could not save your mail.
de: &kmail; versucht im Falle eines Absturzes, die Nachricht unter <filename class="directory">$(kde4-config --localprefix)/share/apps/kmail/autosave</filename> zu sichern. Beim nächsten Start von &kmail; sollte der <guilabel>Nachrichten-Editor</guilabel> mit dieser Nachricht wieder erscheinen. Falls nicht, können Sie versuchen, <filename class="directory">$(kde4-config --localprefix)/share/apps/kmail/autosave</filename> mit einem Editor zu öffnen. Wenn diese Datei nicht existiert, war der Absturz so schlimm, das &kmail; die Nachricht nicht sichern konnte.

source: When I try to set a folder to be mailing list-aware, it does not do anything when receiving an email from the list.
de: Wenn ich versuche, einen Ordner mit einer Mailingliste zu verknüpfen, passiert nichts, wenn ich eine E-Mail von dieser Liste erhalte.

source: Associating a folder with a mailing list has nothing to do with filtering the mailing list messages &mdash; you have to add a new filter rule manually; however, once you associated a folder with a mailing list you can use <menuchoice> <guimenu>Message</guimenu><guimenuitem>Reply to Mailing-List...</guimenuitem></menuchoice> or <menuchoice><guimenu>Message</guimenu><guimenuitem>New Message to Mailing-List...</guimenuitem></menuchoice> and the mailing list address will be set in the <guilabel>To:</guilabel> field.
de: Einen Ordner mit einer Liste zu verknüpfen hat nichts mit dem Filtern von Nachrichten dieser Liste zu tun. Man muss eine Filterregel manuell hinzufügen. Sobald man allerdings einen Ordner mit einer Liste verknüpft hat, kann man <menuchoice><guimenu>Nachricht</guimenu><guimenuitem>An Mailingliste antworten...</guimenuitem></menuchoice> oder <menuchoice><guimenu>Nachricht</guimenu><guimenuitem>Neue Nachricht...</guimenuitem></menuchoice> verwenden. In diesen Fällen wird die Adresse der Mailingliste automatisch in das Feld <guilabel>An:</guilabel> eingetragen.

source: My SMTP server requires authentication; does &kmail; support this?
de: Mein SMTP-Server verlangt eine Authentisierung. Wird das von &kmail; unterstützt?

source: The <guilabel>Authentication</guilabel> can be set in the <guilabel>Advanced</guilabel> tab of the SMTP configuration dialog.
de: Die <guilabel>Authentifizierung</guilabel> kann auf der Karteikarte <guilabel>Erweitert</guilabel> des Einrichtungsdialogs für SMTP eingestellt werden.

source: Can I use &kmail; and <application>procmail</application>?
de: Kann ich &kmail; und <application>procmail</application> verwenden?

source: Yes, but it is important to do it the right way or you might lose mail. In order to use <application>procmail</application> and &kmail; you need to set up &kmail; so that it will fetch new mail from the spoolfiles in which <application>procmail</application> drops your mail. Do <emphasis>not</emphasis> set up procmail to deliver mail in a &kmail; folder, this cannot work.
de: Ja, aber die korrekte Verwendung ist wichtig, damit man keine E-Mails verliert. Um <application>procmail</application> und &kmail; zusammen zu verwenden, muss man &kmail; so konfigurieren, dass es neue Nachrichten aus der Spool-Datei abholt, in die sie von procmail abgelegt werden. <application>procmail</application> darf <emphasis>nicht</emphasis> so konfiguriert werden, dass es Nachrichten direkt in den Ordnern von &kmail; ablegt. Das kann nicht funktionieren.

source: For each procmail spoolfile you then need to create an account from which &kmail; will fetch new mail; you also need to make sure you specify the right lockfile name for this account. When setting up an account, &kmail; will do some minimal parsing on your <filename>.procmail</filename> file, and will try to list every spoolfile it has found, and also the lockfiles next to the <guilabel>procmail lockfile</guilabel> item. procmail lets the user specify lockfiles in three different ways, so there is no way to establish a correspondence between the spoolfiles and lockfiles; so it's really up to you to make sure you specify the right lockfile for each spoolfile.
de: Man muss für jede Spool-Datei von procmail ein eigenes E-Mail-Konto anlegen, aus dem &kmail; neue Nachrichten holt. Außerdem muss die richtige Sperrdatei für dieses Konto angegeben werden. Wenn man ein Konto einrichtet, versucht &kmail;, die Konfigurationsdatei von procmail nach Sperrdatei-Einträgen abzusuchen. Es zeigt dann alle Spool-Dateien und die gefundenen Sperrdateien unter <guilabel>procmail-Sperrdatei</guilabel> an. procmail erlaubt allerdings drei verschiedene Wege, um Sperrdateien zu erstellen. Daher gibt es keine direkte Zuordnung von Spool-Dateien zu Sperrdateien. Daher muss der Benutzer sicherstellen, dass die richtige Sperrdatei für eine Spool-Datei ausgewählt ist.

source: Spellchecking does not recognize non-English characters.
de: Die Rechtschreibprüfung erkennt keine nicht-englischen Buchstaben.

source: Before you can use spellchecking the first time, you have to configure it. You can do so in the composer window's menu under <menuchoice><guimenu>Settings</guimenu> <guimenuitem>Spellchecker...</guimenuitem></menuchoice>. You can set the dictionary there.
de: Vor der ersten Verwendung muss die Rechtschreibprüfung konfiguriert werden. Man kann das im Nachricht-Editor unter dem Menüeintrag <menuchoice><guimenu>Einstellungen</guimenu> <guimenuitem>Rechtschreibprüfung...</guimenuitem></menuchoice> tun. Man kann das Wörterbuch hier auswählen.

source: How do I use my <application>Eudora</application>/&Netscape;/<application>Outlook</application>/... mail folders in &kmail;?
de: Wie verwende ich meine <application>Eudora</application>/&Netscape;/<application>Outlook</application>/... Mail-Ordner in &kmail;?

source: See the section <link linkend="importing-options">Importing in &kmail;</link>.
de: Informationen dazu finden Sie im Abschnitt <link linkend="importing-options">Import in &kmail;</link>.

source: Can I use encryption with my normal (non-<acronym>SSL</acronym>) POP3 account?
de: Kann ich Verschlüsselung auf meinem normalen ( nicht <acronym>SSL</acronym>) POP3-Konto verwenden?

source: If your POP3 server runs an <application>ssh</application> daemon, you can use ssh to tunnel your POP3 connection using the following command:
de: Wenn der POP3-Server einen <application>ssh</application>-Dämon hat, kann man ssh verwenden mit dem folgenden Befehl verwenden, um eine getunnelte Verbindung zum POP3-Server herzustellen:

source: <command>ssh</command> <option>-L 11000:127.0.0.1:110 user@host</option>
de: <command>ssh</command> <option>-L 11000:127.0.0.1:110 Benutzer@Rechner</option>
