Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdepim/kmail_menus.po
Languages: de

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Matthias</firstname><surname>Kiefer</surname> <affiliation><address><email>matthias.kiefer@gmx.de</email></address></affiliation> <contrib>Deutsche Übersetzung</contrib></othercredit> <othercredit role="translator"><firstname>Alexander</firstname><surname>Gretencord</surname> <affiliation><address><email>arutha@gmx.de</email></address></affiliation> <contrib>Überarbeitung</contrib></othercredit> <othercredit role="translator"><firstname>Frank</firstname><surname>Schütte</surname> <affiliation><address><email>F.Schuette@t-online.de</email></address></affiliation> <contrib>Überarbeitung ab Version 1.3</contrib></othercredit> <othercredit role="translator"><firstname>Matthias Kalle</firstname><surname>Dalheimer</surname> <affiliation><address><email>kalle@kdab.net</email></address></affiliation> <contrib>Krypto-Übersetzung</contrib></othercredit>

source: Command and Menu Reference
de: Befehls- und Menüreferenz

source: Each &kmail; specific menu item is discussed below. When there is a keyboard shortcut that performs a menu item function, the default shortcut is listed with the menu item.
de: Die besonderen Menüeinträge für &kmail; sind unten beschrieben. Falls ein Kurzbefehl existiert, die die entsprechende Funktion ausführt, wird die Standardkombination neben dem Menüeintrag aufgeführt.

source: The &kmail; Reader Window
de: Das Hauptfenster von &kmail;

source: File Menu
de: Das Menü Datei

source: <guimenu>File</guimenu> <guisubmenu>New</guisubmenu>
de: <guimenu>Datei</guimenu><guisubmenu>Neu</guisubmenu>

source: Here you can create several new items as follows:
de: Mit diesem Menüeintrag können Sie folgende neue Nachrichten erstellen:

source: <guimenu>File</guimenu> <guisubmenu>New</guisubmenu> <guimenuitem>New Message...</guimenuitem>
de: <guimenu>Datei</guimenu> <guisubmenu>Neu</guisubmenu><guimenuitem>Neue Nachricht ...</guimenuitem>

source: Compose a new message.
de: Erstellt eine neue Nachricht.

source: <guimenu>File</guimenu> <guisubmenu>New</guisubmenu> <guisubmenu>Message from Template</guisubmenu>
de: <guimenu>Datei</guimenu><guisubmenu>Neu</guisubmenu><guisubmenu>Neue Nachricht von Vorlage</guisubmenu>

source: <action>Creates a new message from a selected template.</action> Please see <link linkend="new-compose-from-templates">Compose From Templates</link> for additional information on creating templates.
de: <action>Erstellt eine neue Nachricht auf der Grundlage einer ausgewählten Vorlage.</action> Weitere Informationen dazu finden Sie im Abschnitt <link linkend="new-compose-from-templates">Neue Nachricht von Vorlage</link>.

source: If you do not have any templates saved, you will see <menuchoice><guimenu>Message</guimenu><guisubmenu>Message from Template</guisubmenu><guimenuitem>(no templates)</guimenuitem></menuchoice>.
de: Haben Sie bisher noch keine Vorlagen gespeichert, wird im Menü <menuchoice><guimenu>Nachricht</guimenu><guisubmenu>Neue Nachricht von Vorlage</guisubmenu><guimenuitem>(keine Vorlagen)</guimenuitem></menuchoice>angezeigt.

source: <guimenu>File</guimenu> <guisubmenu>New</guisubmenu> <guimenuitem>Add Folder...</guimenuitem>
de: <guimenu>Datei</guimenu><guisubmenu>Neu</guisubmenu> <guimenuitem>Ordner hinzufügen ...</guimenuitem>

source: Create a new folder.
de: Erstellt einen neuen Ordner.

source: <guimenu>File</guimenu> <guisubmenu>New</guisubmenu> <guimenuitem>New AddressBook Contact...</guimenuitem>
de: <guimenu>Datei</guimenu><guisubmenu>Neu</guisubmenu><guimenuitem>Neuer Adressbuchkontakt ...</guimenuitem>

source: Brings up the <guilabel>New Contact</guilabel> dialog.
de: Öffnet den Dialog zur Eingabe neuer Kontakte.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>O</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Open...</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>O</keycap></keycombo></shortcut> <guimenu>Datei</guimenu> <guimenuitem>Öffnen ...</guimenuitem>

source: Open email messages or mailboxes.
de: Öffnet E-Mail-Nachrichten oder Postfächer.

source: <guimenu>File</guimenu> <guimenuitem>Open Recent</guimenuitem>
de: <guimenu>Datei</guimenu> <guimenuitem>Zuletzt geöffnete Dateien</guimenuitem>

source: <action>Opens recently used messages.</action> Only messages that have been saved and then opened will show up on this list.
de: <action>Öffnet kürzlich benutzte Nachrichten.</action> Nur Nachrichten, die bereit gespeichert und dann wieder geöffnet wurden, erscheinen in dieser Liste.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>S</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Save As...</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>S</keycap></keycombo></shortcut> <guimenu>Datei</guimenu> <guimenuitem>Speichern unter ...</guimenuitem>

source: <action>Saves the currently displayed message to a <filename role="extension">.mbox</filename>.</action> This includes all the headers and attachments.
de: <action>Speichert die gerade angezeigte Nachricht als <filename class="extension">.mbox</filename></action>. Die Datei enthält den vollständigen Vorspann und alle Anhänge.

source: If you would like to save it to a different format &eg; <filename role="extension">.txt</filename>, deselect <guilabel>Automatically select filename extension (.mbox)</guilabel>, and be sure to change the file extension while naming the file.
de: Möchten Sie die Nachricht in einem anderen Format speichern wie &eg; <filename role="extension">.txt</filename>, deaktivieren Sie <guilabel>Dateierweiterung automatisch auswählen (.mbox)</guilabel> und geben Sie bei der Eingabe des Namens die gewünschte Dateierweiterung an.

source: <guimenu>File</guimenu> <guimenuitem>Import Messages...</guimenuitem>
de: <guimenu>Datei</guimenu> <guimenuitem>Nachrichten importieren ...</guimenuitem>

source: <action>Starts up <application>KMailCVT</application></action>. This application lets you import messages from several email clients into &kmail;.
de: <action>Startet <application>KMailCVT</application></action>. Dieses Programm erlaubt den Import der Nachrichten von verschiedenen proprietären E-Mail-Programmen in &kmail;.

source: <guimenu>File</guimenu> <guimenuitem>Print Preview...</guimenuitem>
de: <guimenu>Datei</guimenu> <guimenuitem>Druckvorschau ...</guimenuitem>

source: Display a dialog which shows how your email will be printed.
de: Zeigt eine Vorschau des Ausdrucks Ihrer E-Mail in einem neuen Fenster an.

source: This will only be enabled if a printer has been configured and is online available for use.
de: Diese Funktion steht nur zur Verfügung, wenn ein Drucker eingerichtet, angeschlossen und erreichbar ist.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>P</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Print...</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>P</keycap></keycombo> </shortcut> <guimenu>Datei</guimenu> <guimenuitem>Drucken ...</guimenuitem>

source: Display a dialog that lets you print the currently displayed message.
de: Zeigt einen Dialog zum Drucken der gerade angezeigten Nachricht.

source: <guimenu>File</guimenu> <guimenuitem>Expire All Folders</guimenuitem>
de: <guimenu>Datei</guimenu><guimenuitem>Verfallsdatum für alle Ordner aktivieren</guimenuitem>

source: <action>Delete old messages from all folders.</action> Deletion will occur according to the rules in each folder's <link linkend="folders-properties-window">Properties dialog</link> (the default is not to delete old messages at all).
de: <action>Alle alten Nachrichten in allen Ordnern löschen</action>. Dies erfolgt mit den im Dialog <link linkend="folders-properties-window">Eigenschaften</link> festgelegten Regeln für jeden Ordner. Standard ist, gar keine alten Nachrichten zu löschen.

source: <guimenu>File</guimenu> <guimenuitem>Empty All Trash Folders</guimenuitem>
de: <guimenu>Datei</guimenu> <guimenuitem>Alle Papierkörbe leeren</guimenuitem>

source: <action>Use this to empty all trash folders,</action> &ie; the local trash folder and all trash folders that you might have on &imap; servers.
de: <action>Verwenden Sie diesen Befehl, um alle Papierkörbe zu löschen</action>, also den lokalen und eventuelle Papierkörbe auf &imap;-Servern.

source: <guimenu>File</guimenu> <guimenuitem>Work Offline</guimenuitem>
de: <guimenu>Datei</guimenu><guimenuitem>Offline arbeiten</guimenuitem>

source: <action>Sets &kmail; to offline mode.</action> This turns off all network jobs. This is useful when working with messages without a network connection. This selection will become <menuchoice><guimenu>File</guimenu><guimenuitem>Work Online</guimenuitem></menuchoice>, which needs to be selected to go back online (required to send and receive).
de: <action>Schaltet &kmail; in den Offlinemodus.</action> Damit werden alle Netzwerkaufgaben angehalten. Das ist sinnvoll, wenn Sie Nachrichten ohne Netzwerkverbindung bearbeiten möchten. Dann ändert sich dieser Menüeintrag zu <menuchoice><guimenu>Datei</guimenu><guimenuitem>Online arbeiten</guimenuitem></menuchoice>. Benutzen Sie diesen Eintrag, um wieder Online zu gehen. Das ist für das Senden und Empfangen von Nachrichten nötig.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>L</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Check Mail</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>L</keycap></keycombo></shortcut> <guimenu>Datei</guimenu> <guimenuitem>Nach E-Mail sehen ...</guimenuitem>

source: Checks for new messages in all your accounts.
de: Überprüft alle Postfächer auf neue Nachrichten.

source: <guimenu>File</guimenu> <guisubmenu>Check Mail In</guisubmenu>
de: <guimenu>Datei</guimenu> <guimenuitem>Nach E-Mail sehen in</guimenuitem>

source: <action>Check for new messages from a particular account,</action> these accounts will be listed in the submenu.
de: <action>Überprüft einen bestimmtes Postfach auf neue Nachrichten.</action> Diese Postfächer werden im Untermenü aufgeführt.

source: <shortcut> <keycap>F5</keycap> </shortcut> <guimenu>File</guimenu> <guimenuitem>Update Folder</guimenuitem>
de: <shortcut><keycap>F5</keycap></shortcut> <guimenu>Datei</guimenu> <guimenuitem>Ordner aktualisieren</guimenuitem>

source: Checks whether new mail arrived in the currently selected folder.
de: Überprüft, ob neue Nachrichten im aktuellen Ordner angekommen sind.

source: This is only available for &imap; folders.
de: Diese Funktion steht nur für &imap;-Ordner zur Verfügung.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>F5</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Update This Folder and All Its Subfolders</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>F5</keycap></keycombo></shortcut> <guimenu>Datei</guimenu><guimenuitem>Diesen Ordner und alle seine Unterordner aktualisieren</guimenuitem>

source: Checks whether new mail arrived in the currently selected folder and all of its subfolders.
de: Überprüft, ob neue Nachrichten im aktuellen Ordner und allen Unterordnern angekommen sind.

source: You can also select multiple folders and the menu item will turn into <menuchoice><guimenu>File</guimenu><guimenuitem>Update These Folders and All Their Subfolders</guimenuitem></menuchoice>
de: Sie können auch mehrere Ordner auswählen, dann ändert sich dieser Menüeintrag zu <menuchoice><guimenu>Datei</guimenu><guimenuitem>Diese Ordner und alle Unterordner aktualisieren</guimenuitem></menuchoice>.

source: <guimenu>File</guimenu> <guimenuitem>Send Queued Messages</guimenuitem>
de: <guimenu>Datei</guimenu> <guimenuitem>Postausgang versenden</guimenuitem>

source: <action>Sends the messages that are in your outbox.</action> Messages can end up in your outbox by selecting <guibutton>Queue</guibutton> in the composer menu, composing a message in offline mode, and sending while you have no Internet connection.
de: <action>Versendet die Nachrichten in Ihrem Postausgang.</action> Nachrichten landen in diesem Ordner, wenn Sie <guibutton>In Postausgang</guibutton> im Editormenü wählen oder eine Nachricht im Offline-Modus erstellen und versenden ohne Internet-Verbindung.

source: <guimenu>File</guimenu> <guimenuitem>Send Queued Messages Via</guimenuitem>
de: <guimenu>Datei</guimenu> <guimenuitem>Postausgang versenden über</guimenuitem>

source: <action>Sends the messages that are in your outbox via a specific outgoing account.</action> This allows you to choose which server to send your queued messages from. They must be configured in Configure &kmail; dialog, under the <menuchoice><guiicon>Accounts</guiicon><guilabel>Sending</guilabel></menuchoice> tab to show up here.
de: <action>Versendet die Nachrichten in Ihrem Postausgangsordner über den angegebenen Versandweg.</action> Damit können Sie auswählen, an welchen Server die Nachrichten in der Warteschlange gehen. Diese Versandwege müssen im Einrichtungsdialog von &kmail; auf der Karteikarte <menuchoice><guiicon>Zugänge</guiicon><guilabel>Versand</guilabel></menuchoice> erstellt werden, damit sie in diesem Menü erscheinen.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Quit</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo></shortcut> <guimenu>Datei</guimenu> <guimenuitem>Beenden</guimenuitem>

source: Exits &kmail;.
de: Beendet &kmail;.

source: Edit Menu
de: Das Menü Bearbeiten

source: If the menu item you are looking for is missing, please see <ulink url="help:/fundamentals/ui.html#menus-edit">Edit Menu</ulink> of the &kde; Fundamentals. The items listed here are &kmail; specific.
de: Hier werden nur die besonderen Einträge für &kmail; aufgeführt, alle sonstigen Menüeinträge finden Sie im <ulink url="help:/fundamentals/ui.html#menus-edit">Menu Bearbeiten</ulink> in den &kde;-Grundlagen.

source: <shortcut> <keycap>Del</keycap> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Move to Trash</guimenuitem>
de: <shortcut><keycap>Entf</keycap></shortcut> <guimenu>Bearbeiten</guimenu> <guimenuitem>In den Papierkorb werfen</guimenuitem>

source: <action>Moves the selected messages to the trash folder.</action> If the selected messages are already in the trash folder, they will be permanently deleted.
de: <action>Verschiebt alle ausgewählten Nachrichten in den Papierkorb</action>. Falls die ausgewählten Nachrichten bereits im Papierkorb ist, werden die Nachrichten endgültig gelöscht.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Del</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Move Thread to Trash</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>Entf</keycap></keycombo></shortcut><guimenu>Bearbeiten</guimenu><guimenuitem>Gruppe in den Papierkorb werfen</guimenuitem>

source: <action>Moves the selected thread to the trash folder,</action> &eg; a conversation in a mailing list.
de: <action>Verschiebt die ausgewählte Gruppe in den Papierkorbordner,</action>&eg; eine vollständige Diskussion in einer Mailingliste.

source: <shortcut> <keycap>S</keycap></shortcut> <guimenu>Edit</guimenu> <guimenuitem>Find Messages...</guimenuitem>
de: <shortcut><keycap>S</keycap></shortcut> <guimenu>Bearbeiten</guimenu> <guimenuitem>Nachrichten suchen ...</guimenuitem>

source: <action>Opens up a search window</action> that lets you search for messages with certain characteristics, &eg; a certain subject. Please see <link linkend="filter-criteria">Filter Criteria</link> for details on search options.
de: <action>Öffnet ein Suchfenster</action>, das die Suche nach Nachrichten mit bestimmten Eigenschaften, &eg; einem bestimmten Betreff, erlaubt. Weitere Details zur Einstellungen für die Suche finden Sie im Abschnitt <link linkend="filter-criteria">Filter-Kriterien</link>,

source: Your search results will display in the text area, at which point you can open the <guibutton>Open Search Folder</guibutton> or highlight the desired message and select <guibutton>Open Message</guibutton>.
de: Das Ergebnis der Suche wird im Textfeld angezeigt. Dann können Sie den <guibutton>Suchordner öffnen</guibutton> oder eine Nachricht auswählen und auf <guibutton>Nachricht öffnen</guibutton> klicken.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>F</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Find in Message...</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>F</keycap></keycombo></shortcut> <guimenu>Bearbeiten</guimenu> <guimenuitem>Nachricht durchsuchen ...</guimenuitem>

source: Searches the current message text for a string entered into the <guilabel>Find:</guilabel> textbox.
de: Durchsucht dem aktuellen Nachrichtentext nach dem im Feld <guilabel>Suchen</guilabel> eingegebenen Text.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>A</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Select All Messages</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>A</keycap></keycombo></shortcut> <guimenu>Bearbeiten</guimenu> <guimenuitem>Alle Nachrichten auswählen</guimenuitem>

source: Selects all messages in the current folder.
de: Wählt alle Nachrichten im aktuellen Ordner aus.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>T</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Select All Text</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>T</keycap></keycombo></shortcut> <guimenu>Bearbeiten</guimenu> <guimenuitem>Gesamten Text auswählen</guimenuitem>

source: Selects the text of the currently displayed message.
de: Selektiert den Text der gerade angezeigten Nachricht.

source: View Menu
de: Das Menü Ansicht

source: <guimenu>View</guimenu> <guisubmenu>Message List</guisubmenu>
de: <guimenu>Ansicht</guimenu> <guisubmenu>Nachrichtenliste</guisubmenu>

source: This menu has the following options to change the view of your message list.
de: Diese Menü enthält die folgenden Einstellungen, um die Anzeige der Nachrichtenliste zu ändern.

source: Sorting
de: Sortierung

source: Contains options to customize your sort order as follows:
de: Enthält folgende Einstellungen für die Reihenfolge der Sortierung.

source: <guilabel>Message Sort Order</guilabel> has several options, most are self explanatory. The following options may not be immediately obvious, therefore deserve an explanation.
de: <guilabel>Sortierkriterium für Nachrichten</guilabel> enthält mehrere Optionen, die meisten sind selbsterklärend. Die Bedeutung der folgenden Optionen sind nicht sofort erkennbar, daher werden sie im folgenden erläutert.

source: <guilabel>By Smart Sender/Receiver</guilabel> will display the sender when you are reading in your outbox folder/template folder, and display the receiver when you are in your inbox/inbox subfolders.
de: <guilabel>Nach Absender/Empfänger (intelligent)</guilabel> zeigt den Absender bei der Anzeige im Postausgangs- oder Vorlagenordner und den Empfänger im Posteingang und dessen Unterordnern.

source: <guilabel>By Action Item Status</guilabel> and <guilabel>By Important Status</guilabel> need to be set before they can be sorted. Please see <link linkend="reader-mark-messages">Mark Messages</link> for more information on marking your messages.
de: <guilabel>Nach Aufgaben-Status</guilabel> und <guilabel>Nach Wichtig-Status</guilabel> müssen gesetzt werden, ehe diese Kriterien zur Sortierung verwendet werden können. Weitere Informationen dazu finden Sie im Abschnitt <link linkend="reader-mark-messages">Markierung von Nachrichten</link>

source: <guilabel>Message Sort Direction</guilabel> and <guilabel>Group Sort Direction</guilabel> allow you to change the direction of your messages/groups sort respectively.
de: Mit <guilabel>Sortierung für Nachrichten</guilabel> und <guilabel>Sortierung für Gruppen</guilabel> können Sie die Richtung der Sortierung ändern.

source: <guilabel>Folder always Uses this Sort Order</guilabel> allows you to keep your sort settings per folder.
de: Mit <guilabel>Sortierung für diesen Ordner merken</guilabel> können Sie für jeden Ordner eigene Einstellungen festlegen.

source: Aggregation
de: Zusammenstellung

source: Allows you to set your aggregation view.
de: Ermöglicht die Einstellung der Ansicht der Zusammenstellung.

source: <guilabel>Configure...</guilabel> Allows you to configure aggregation, please see <link linkend="configure-appearance-message-list">Configure Appearance Message List</link> for more information on aggregation.
de: Mit <guilabel>Einrichten</guilabel> können Sie die Zusammenstellung der Nachrichten anpassen. Weiter Informationen dazu finden Sie im Abschnitt <link linkend="configure-appearance-message-list">Anpassung der Nachrichtenliste</link>.

source: Theme
de: Design

source: Allows you to select a theme.
de: Ermöglicht die Auswahl eines Designs.

source: <guilabel>Configure...</guilabel> Allows you to configure themes, please see <link linkend="configure-appearance-message-list">Configure Appearance Message List</link> for more information on themes.
de: Mit <guilabel>Einrichten</guilabel> können Sie das Design anpassen. Weiter Informationen dazu finden Sie im Abschnitt <link linkend="configure-appearance-message-list">Anpassung der Nachrichtenliste</link>.

source: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>O</keycap></keycombo> </shortcut> <guisubmenu>Create New Tab</guisubmenu>
de: <shortcut><keycombo action="simul">&Ctrl;&Shift;<keycap>O</keycap></keycombo></shortcut><guisubmenu>Neues Unterfenster erstellen</guisubmenu>

source: <action>Creates a new tab,</action> then select the folder you would like to display in the tab.
de: <action>Erstellt ein neues leeres Unterfenster.</action> Wählen Sie dann den Ordner aus, der in diesem Unterfenster angezeigt werden soll.

source: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>W</keycap></keycombo> </shortcut> <guisubmenu>Close Tab</guisubmenu>
de: <shortcut><keycombo action="simul">&Ctrl;&Shift;<keycap>W</keycap></keycombo></shortcut><guisubmenu>Unterfenster schließen</guisubmenu>

source: Closes the currently selected tab.
de: Schließt das aktuell ausgewählte Unterfenster.

source: <guimenu>View</guimenu> <guisubmenu>Headers</guisubmenu>
de: <guimenu>Ansicht</guimenu> <guisubmenu>Vorspann</guisubmenu>

source: <action>Select your headers view.</action> Please see <link linkend="using-header-options">Header Options</link> for details on headers.
de: <action>Stellen Sie hier das angezeigte Vorspanndesign ein.</action> Weitere Informationen finden Sie im Abschnitt <link linkend="using-header-options">Vorspann</link>.

source: <guimenu>View</guimenu> <guimenuitem>Attachments</guimenuitem>
de: <guimenu>Ansicht</guimenu> <guimenuitem>Anhänge</guimenuitem>

source: <action>Changes the way attachments appear in the <guilabel>Message Preview Pane</guilabel></action> (independent of the &MIME; Tree). Please see <link linkend="using-attachment-view-options">Attachment Options</link> for details on attachments.
de: <action>Hier wird eingestellt</action>, wie Anhänge im <guilabel>Nachrichtenfenster</guilabel> unabhängig vom &MIME;-Baum angezeigt werden. Weitere Informationen finden Sie im Abschnitt <link linkend="using-attachment-view-options">Anhänge</link>.

source: <shortcut> <keycap>.</keycap></shortcut> <guimenu>View</guimenu> <guimenuitem>Expand Thread / Group</guimenuitem>
de: <shortcut><keycap>.</keycap></shortcut> <guimenu>Ansicht</guimenu> <guimenuitem>Gruppe aufklappen</guimenuitem>

source: <action>This will display the thread of the current message,</action> &ie; all messages that are replies to the current message.
de: <action>Damit wird die aktuelle Nachrichtengruppe angezeigt</action>, &ie; alle Nachrichten, die eine Antwort auf die aktuelle Nachricht sind.
