Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdepim/kmail_troubleshooting.po
Languages: de

source: <firstname>This chapter was converted from the KDE UserBase <ulink url="http://userbase.kde.org/KMail/FAQs Hints and Tips">KMail/FAQs Hints and Tips</ulink> page.</firstname> <surname></surname>
de: <firstname>Dieses Kapitel wurde aus der Webseite <ulink url=" http://userbase.kde.org/KMail/FAQs Hints and Tips">KMail / FAQs Tipps und Tricks</ulink> der &kde;-Userbase erstellt.</firstname> <surname></surname>

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Burkhard</firstname><surname>Lück</surname><affiliation><address><email>lueck@hube-lueck.de</email></address></affiliation><contrib>Übersetzung</contrib></othercredit>

source: &kmail; Troubleshooting
de: Fehlersuche und -behebung in &kmail;

source: KMail doesn't send mail
de: KMail versendet keine E-Mails

source: Some users find that mail does not go out, and it appears that &SMTP; is missing, even though the <guilabel>Settings</guilabel> page looks correct. It has been reported that this is cured by opening <application>akonadiconsole</application> and adding Mail Dispatcher Agent.
de: In einigen Fällen wird keine E-Mail versandt, anscheinend fehlt &SMTP;, obwohl es im Einstellungsdialog als aktiviert angezeigt wird. Manchmal hilft es, das Konsolenprogramm <application>akonadiconsole</application> zu starten und den <guilabel>Agent zur Nachrichten-Auslieferung</guilabel> hinzuzufügen.

source: If the computer was suddenly turned off in suspend mode (&eg; by a power cut) sometimes e-mails simply stay in the outbox without being sent, but no error message is generated either. This may be due to the fact that the Mail Dispatcher Agent is set to <quote>offline</quote> in the configuration file during suspend and is not changed back due to the crash. Edit the following file:
de: Wenn der Rechner im Ruhezustand &eg; durch einen Stromausfall plötzlich abgeschaltet wurde, bleiben E-Mails manchmal im Postausgang. ohne versendet zu werden. Es wird aber auch keine Fehlermeldung angezeigt. Dies kann dadurch verursacht werden, dass die Nachrichten-Auslieferung in der Einstellungsdatei im Ruhezustand <quote>abschaltet</quote> ist und wegen des Stromausfalls nicht wieder aktiviert wurde. Um diesen Fehler zu beheben, bearbeiten Sie folgende Datei:

source: and change
de: und ändern Sie

source: <para>to</para>
de: <para>in</para>

source: Clean start after a failed migration
de: Neue Einrichtung für &kmail; nach einer fehlgeschlagenen Aktualisierung

source: In case migration from &kmail; 1 to &kmail; 2 fails or you have weird problems after it, you can try to do a clean import of your data, instead of migrating the existing settings. Be warned, this needs more manual setup, so do only if you are confident of setting up your &kmail; accounts again; it can generate a large amount of network traffic for &imap; resources.
de: Ist die Aktualisierung von &kmail; 1 auf &kmail; 2 fehlgeschlagen oder haben Sie danach Probleme mit dem Programm, sollten Sie versuchen, &kmail; neu einzurichten und Ihre E-Mails zu importieren. Das erfordert mehr Arbeit zu Wiederherstellung der Funktionsfähigkeit. Daher sollten Sie sich mit der Einstellung der Zugänge zum Empfangen und Versenden von E-Mails auskennen. Bei &imap;-Postfächern kann viel Netzwerkverkehr entstehen.

source: Stop Akonadi and related applications
de: Stoppen Sie Akonadi und alle zugehörigen Programme

source: quit &kmail;/&kontact;/&korganizer;, and issue this command:
de: Beenden Sie &kmail;/&kontact;/&korganizer; und führen diesen Befehl aus:

source: Make sure no <application>Akonadi</application> or <application>MySQL</application> process is running:
de: Überprüfen Sie, dass kein <application>Akonadi</application>- oder <application>MySQL</application>-Prozess mehr ausgeführt wird:

source: They should not show anything else but the <application>grep</application> process itself.
de: In der Ausgabe dieser beiden Befehle darf nur der <application>grep</application>-Prozess selbst angezeigt werden.

source: Remove old Akonadi database and config
de: Entfernen Sie die alte Akonadi-Datenbank und die zugehörigen Einstellungen

source: Delete the following folders
de: Löschen Sie die folgenden Ordner:

source: Delete also the files starting with <emphasis>akonadi</emphasis> from <filename role="directory">~/.kde4/share/config</filename>
de: Löschen Sie ebenso alle Dateien, deren Namen mit <emphasis>akonadi</emphasis> beginnen, aus dem Ordner <filename role="directory">~/.kde4/share/config</filename>

source: Restart Akonadi server
de: Starten Sie den Akonadi-Server erneut.

source: Add back the accounts
de: Versand- und Empfangszugänge wieder hinzufügen

source: Now it is time to add your account back. You can use &kmail; (&kontact;) for it, or you can use the <application>akonadiconsole</application> tool.
de: Nun müssen Sie Ihre Versand- und Empfangszugänge wieder herstellen. Dazu können Sie &kmail; oder &kontact; oder das Konsolenprogramm <application>akonadiconsole</application> verwenden.

source: In &kmail;: <menuchoice><guimenu>Settings</guimenu><guisubmenu>Configure KMail</guisubmenu><guimenuitem>Accounts</guimenuitem></menuchoice> and use <guilabel>Add</guilabel>.
de: In &kmail; öffnen Sie mit <menuchoice><guimenu>Einstellungen</guimenu><guisubmenu>&kmail; einrichten ...</guisubmenu></menuchoice> den Einrichtungsdialog und klicken auf der Seite <guilabel>Zugänge</guilabel> auf den Knopf <guibutton>Hinzufügen</guibutton>.

source: If you use &imap;, add a new <guimenuitem>&imap; E-Mail server</guimenuitem>. If you want disconnected mode (so you can read the mails offline), enable it on the <guilabel>Advanced</guilabel> tab. Be sure to check that you are subscribed to all your important folders.
de: Möchten Sie &imap;, benutzen, fügen Sie einen neuen <guimenuitem>&imap;-E-Mail-Server</guimenuitem> hinzu. Möchten Sie Ihre E-Mails auch Offline lesen und bearbeiten (Disconnected &imap;), aktivieren Sie dies auf der Karteikarte <guilabel>Erweitert</guilabel>. Überprüfen Sie, ob Sie auch alle wichtigen Ordner abonniert haben.

source: You might already see a <guilabel>Local folder</guilabel> resource. This points to a local maildir folder. You can either modify this to point to your existing maildir folders or you can add a new resource for local mails.
de: Wahrscheinlich haben Sie bereits eine Ressource <guilabel>Lokale Ordner</guilabel>. Diese Ressource zeigt auf einen lokalen Maildir-Ordner. Entweder Sie ändern diese Zuordnung zu einem vorhandenen Maildir-Ordner oder fügen eine neue Ressource für lokale E-Mails hinzu.

source: When adding a maildir resource you can choose between <guilabel>&kmail; Mail Folder</guilabel> or <guilabel>Maildir</guilabel>. Unless you have a mixed folder containing <emphasis>both</emphasis> maildir folders and mbox files, you should choose <guilabel>Maildir</guilabel>. For independent mbox files, like the one in the <filename role="directory">/var/spool/mail</filename>, you can set up a new <emphasis>MBox</emphasis> folder.
de: Wenn Sie eine Maildir-Ressource hinzufügen, können Sie zwischen <guilabel>&kmail;-Mailordner</guilabel> oder <guilabel>Maildir</guilabel> wählen. Wenn Sie keine gemischten Ordner <emphasis>sowohl</emphasis> mit Maildir-Ordnern und MBox-Dateien haben, sollten Sie <guilabel>Maildir</guilabel> wählen. Für eigene MBox-Dateien wie in <filename role="directory">/var/spool/mail</filename> sollten Sie neue <emphasis>MBox</emphasis>-Ordner einstellen.

source: Add the POP3 accounts as well. If you have multiple Local Folders set up, on the <guilabel>Advanced</guilabel> tab, choose the destination folder where the newly downloaded mails are put.
de: Fügen Sie ebenso alle POP3-Zugänge hinzu, Haben Sie mehrere lokale Ordner eingestellt, wählen Sie auf der Karteikarte <guilabel>Erweitert</guilabel> den Zielordner zur Speicherung der E-Mails.

source: For all accounts, configure the mail check interval. For Local folders disable interval checking and also disable <guilabel>Include in manual mail check</guilabel> in the <guilabel>Retrieval options</guilabel>.
de: Stellen Sie für alle Zugänge das Abrufintervall ein. Deaktivieren Sie für lokale Ordner das Abrufintervall und schalten Sie auch <guilabel>Bei manueller Prüfung einbeziehen</guilabel> in den <guilabel>Abrufeinstellungen</guilabel> ab.

source: Add the sending (SMTP) accounts.
de: Fügen Sie die Versand-Zugänge (SMTP) hinzu.

source: Fix your filters, identities and favorite folders
de: Stellen Sie Ihre Filter, Identitäten und bevorzugten Order wieder ein.

source: If you have client side filtering (common with POP3 mails), go to <menuchoice><guimenu>Settings</guimenu><guimenuitem>Configure Filters</guimenuitem></menuchoice> and fix the destination folder for the filters, they most probably are wrong. Otherwise mails will end up in folders you don't expect.
de: Filtern Sie die E-Mails auf Ihrem Rechner wie typischerweise mit POP3-Zugängen, wählen Sie <menuchoice><guimenu>Einstellungen</guimenu> <guimenuitem>Filter einrichten ...</guimenuitem></menuchoice> und korrigieren die Zielordner der Filter, die vielfach falsch sind. Ansonsten werden die gefilterten E-Mails in unerwarteten Ordnern abgelegt.

source: Spam filter (at least in version 4.7.3 and earlier) does not work as expected in that the rule that the wizard creates does not send spam to the folder you have defined.
de: Spam-Filter (bis zu Version 4.7.3 und vorher) funktionieren nicht wie erwartet, das die durch den Assistenten erstellten Regeln die Spam-E-Mails nicht in den angegebenen Ordner verschieben.

source: The workaround for this is to change the <quote>spam</quote> and <quote>spam unsure</quote> (if the spam filter you use supports that) from looking at Status-fields in the header <literal>X-Spam-Status</literal> to look <guimenuitem>Anywhere in headers</guimenuitem> for X-<replaceable>your spam filter</replaceable>-Classification: <quote>SPAM or unsure</quote>. Look at the filters the wizard creates and copy the <quote>contains</quote> part. Example for <application>Spambayes</application>: <quote>X-Spambayes-Classification: spam</quote> and <quote>X-Spambayes-Classification: unsure</quote>.
de: Als Übergangslösung für diese Problem können Sie abstellen, das die Filter <quote>Spam</quote> und <quote>Möglicherweise Spam</quote>, wenn das durch den von Ihnen verwendeten Spamfilter unterstützt wird, in dem Statusfeld <literal>X-Spam-Status</literal> im Vorspann <guimenuitem>Irgendwo im Vorspann</guimenuitem> nach Klassifizierungen <quote>SPAM or unsure</quote> suchen. Sehen Sie sich die durch den Assistenten erstellten Filter an und kopieren Sie den Teil <quote>enthält</quote>. Ein Beispiel für <application>Spambayes</application>: <quote>X-Spambayes-Classification: spam</quote> und <quote>X-Spambayes-Classification: unsure</quote>.

source: You also need to verify the identity settings and set the sent-mail, drafts and templates folders to point to the right folders. To do that go to <menuchoice><guimenu>Settings</guimenu><guisubmenu>Configure KMail</guisubmenu><guimenuitem>Identities</guimenuitem></menuchoice>, modify the identity, go to the <guilabel>Advanced</guilabel> tab and modify the above mentioned folder settings.
de: Überprüfen Sie auch die Einstellungen Ihrer Identität und stellen Sie Versendete Nachrichten, Entwürfe und Vorlagen auf die richtigen Ordner ein. Dazu öffnen Sie mit <menuchoice><guimenu>Einstellungen</guimenu><guisubmenu>&kmail; einrichten ...</guisubmenu></menuchoice> den Einrichtungsdialog, gehen zur Seite <guilabel>Identitäten</guilabel>, passen die Einstellungen an und ändern die oben genannten Ordner auf der Karteikarte <guilabel>Erweitert</guilabel>.

source: Check also that your <guilabel>Favorite Folders</guilabel> are the ones you have chosen before.
de: Überprüfen Sie, das Ihre <guilabel>Bevorzugten Ordner</guilabel> mit den Einstellungen vorher übereinstimmen.

source: Initiate a mail check
de: Starten Sie das Abholen von E-Mails

source: Start a mail check for your accounts. It is suggested doing it per account.
de: Sehen Sie nach E-Mails in allen Ihren Zugängen, am besten nacheinander für jeden einzelnen Zugang.

source: First check for &imap;, if you have it.
de: Als erstes sehen Sie nach E-Mails in Ihren &imap;-Zugängen, falls vorhanden.

source: Next check (import) your local mails. One solution is to do a full check in one go <menuchoice><guimenu>File</guimenu><guimenuitem>Check Mail In</guimenuitem></menuchoice> and select the local account; the other is to click one by one on the folders, that should initiate the check for that folder (alternatively right click on the folder name and select <guilabel>Update Folder</guilabel>).
de: Als nächstes sehen Sie nach bzw. importieren Sie Ihre lokalen E-Mails. Eine Möglichkeit ist im Menü <menuchoice><guimenu>Datei</guimenu><guimenuitem>Nach E-Mail sehen in</guimenuitem></menuchoice> zu benutzen und die lokalen Ordner zu wählen. Alternativ klicken Sie nacheinander auf alle Ordner, damit wird in diesen Ordner nach E-Mail gesehen oder Sie klicken mit der &RMBn; auf den Ordnernamen und wählen <guilabel>Ordner aktualisieren</guilabel>.

source: The initial import might be slow and could use a lot of memory, especially if you have folders with a large amount of mail. In that case per-folder check is preferred. If the check (complete or for one folder) is finished and the memory usage is still high, you could restart the Akonadi server &mdash; as seen above &mdash; or just the maildir agent, if you use <varname>akonadiconsole</varname>. Do not worry, this high memory usage is <emphasis>only</emphasis> for initial import.
de: Das erste Abholen bzw. Importieren von E-Mails dauert möglicherweise lange und benötigt viel Arbeitsspeicher, besonders für Ordner mit einer großen Zahl von E-Mails. In diesem Fall sollten Sie die Ordner einzeln nacheinander importieren. Ist der Import für alle E-Mails oder für einen Ordner beendet und es wird immer noch viel Arbeitsspeicher belegt, können Sie den Akonadi-Server &mdash; wie oben beschrieben &mdash; neu starten oder nur den Maildir-Agenten mit <command>akonadiconsole</command>. <emphasis>Nur</emphasis> beim ersten Abholen von E-Mails wird viel Arbeitsspeicher benötigt.

source: Initiate a check mail for POP3 resources.
de: Starten Sie den E-Mail-Import für POP3-Ressourcen.

source: Hopefully after these steps, you will have a much nicer &kmail; experience.
de: Nachdem Sie mit diesem Verfahren &kmail; neu eingerichtet und die E-Mails importiert haben, wird &kmail; viel besser funktionieren.

source: Local Folders is added over and over
de: Lokale Ordner werden immer wieder hinzugefügt

source: In some cases you might end up with a maildir account pointing to a certain place (like <filename>$HOME/Mail</filename>), but you still see a <guilabel>Local Folders</guilabel> folder in the folder list with Inbox/Outbox/Trash/Drafts/&etc; subfolders and &kmail; keeps putting mails there, especially sent mails.
de: Manchmal haben Sie einen Maildir-Zugang für einen bestimmten Ort wie zum Beispiel <filename>$HOME/Mail</filename>, aber immer noch einen Ordner <guilabel>Lokale Ordner</guilabel> in der Ordnerliste mit Posteingang/Postausgang/Papierkorb/Entwürfe/&etc; und &kmail; speichert immer noch die E-Mails, insbesondere Versendete Nachrichten in diesen Ordnern.

source: The problem is that certain folders are marked as special folders (system folders) and if you don't have them, &kmail; cannot operate correctly. That is the reason why it keeps re-creating that folder.
de: Das Problem besteht darin, dass bestimmte Ordner als besondere „System“-Ordner gekennzeichnet sind. Ohne diese System-Ordner funktioniert &kmail; nicht korrekt. Daher werden diese Ordner immer wieder neu erstellt.

source: At this time there is no easy way to change this in the UI for all types of special folders. Here is what you can do:
de: Zurzeit gibt es keine Möglichkeit, dies mit einer grafischen Benutzeroberfläche für alle Arten von besonderen Ordnern zu ändern. Es gibt nur folgende Vorgehensweise:

source: The <emphasis>Sent-Mail, Drafts and Templates</emphasis> folder is configurable for each identity. Go to <menuchoice><guimenu>Settings</guimenu><guisubmenu>Configure KMail</guisubmenu><guimenuitem>Identities</guimenuitem></menuchoice>, select your identity, click on <guilabel>Modify</guilabel>, go to the <guilabel>Advanced</guilabel> tab and set the folders to point to the right place.
de: Die Ordner <guilabel>Versendete Nachrichten</guilabel>, <guilabel>Entwürfe</guilabel> und <guilabel>Vorlagen</guilabel> können für jede Identität getrennt eingestellt werden. Dazu öffnen Sie mit <menuchoice><guimenu>Einstellungen</guimenu><guisubmenu>&kmail; einrichten ...</guisubmenu></menuchoice> den Einrichtungsdialog, gehen zur Seite <guilabel>Identitäten</guilabel>, wählen die Identität und klicken auf <guibutton>Ändern ...</guibutton>. Gehen Sie dann zur Karteikarte <guilabel>Erweitert</guilabel> und stellen den richtigen Ort für die Ordner ein.

source: The default <emphasis>Inbox</emphasis> is configurable for each POP3 account. Go to <menuchoice><guimenu>Settings</guimenu><guisubmenu>Configure KMail</guisubmenu><guimenuitem>Account</guimenuitem></menuchoice>, select your POP3 account, click on <guilabel>Modify</guilabel> go to the <guilabel>Advanced</guilabel> tab and set the <guilabel>Destination folder</guilabel>.
de: Die Voreinstellung für den Zielordner <guilabel>Posteingang</guilabel> kann für jedes POP3-Postfach eingestellt werden. Dazu öffnen Sie mit <menuchoice><guimenu>Einstellungen</guimenu><guisubmenu>&kmail; einrichten ...</guisubmenu></menuchoice> den Einrichtungsdialog, wählen Ihr POP3-Postfach und klicken auf <guibutton>Ändern ...</guibutton>. Gehen Sie zur Karteikarte <guilabel>Erweiterte Einstellungen</guilabel> und geben Sie den richtigen <guilabel>Zielordner</guilabel> an.

source: For IMAP accounts you can configure the <emphasis>Trash</emphasis> folder. Do as above. The setting name is <emphasis>Trash folder</emphasis>.
de: Für IMAP-Konten können Sie den Ordner <guilabel>Papierkorb</guilabel> wie oben beschrieben einstellen. Die Einstellung ist mit <guilabel>Papierkorb-Ordner</guilabel> bezeichnet.

source: The most problematic part is the <emphasis>Outbox</emphasis>. First, locate <filename>specialmailcollectionsrc</filename> in your &kde; configuration directory (<filename>$HOME/.kde4/share/config</filename> or similar). It contains something like this:
de: Der schwierigste Teil ist die Einstellung für den Ordner <guilabel>Postausgang</guilabel>. Suchen Sie zuerst die Datei <filename>specialmailcollectionsrc</filename> in Ihrem &kde;-Einrichtungsordner <filename>$HOME/.kde4/share/config</filename>. Die Datei enthält unter anderem folgende Einträge:

source: Now start <application>akonadiconsole</application>, on the <guilabel>Agents</guilabel> tab locate your local account for your <emphasis>Outbox</emphasis> folder, click on it and note the identifier that appears in the lower part (<replaceable>akonadi_maildir_resource_XXX</replaceable> or similar). Put this identifier in the above shown <filename>specialmailcollectionsrc</filename>, by replacing the existing one.
de: Starten Sie jetzt das Programm <application>akonadiconsole</application>. Suchen Sie auf der Karteikarte <guilabel>Agents</guilabel> das lokale Konto mit Ihrem Ordner <guilabel>Postausgang</guilabel>, klicken Sie darauf und notieren Sie den Namen des <guilabel>Identifier</guilabel> unten im Dialog wie zum Beispiel <replaceable>akonadi_maildir_resource_XXX</replaceable>. Tragen Sie diesen Wert in der vorher erwähnten Datei <filename>specialmailcollectionsrc</filename> als Ersatz des vorhandenen Wertes ein.

source: After that restart <application>akonadi</application> (you can do from the <application>akonadiconsole</application>, <menuchoice><guimenu>Server</guimenu><guimenuitem>Restart Server</guimenuitem></menuchoice> or from command line with:
de: Danach starten Sie das Programm <application>akonadi</application> wieder neu, indem Sie in <application>akonadiconsole</application> <menuchoice><guimenu>Server</guimenu><guimenuitem>Restart Server</guimenuitem></menuchoice> wählen oder folgendes in einer Konsole auf der Befehlszeile eingeben:

source: Now remove the <guilabel>Local Folders</guilabel> that you don't want to use anymore.
de: Entfernen Sie nun die <guilabel>Lokalen Ordner</guilabel>, die Sie nicht mehr benutzen möchten.

source: If it keeps reappearing and the <guilabel>Mail Dispatcher Agent</guilabel> still crashes, you need to do one more thing in <application>akonadiconsole</application>. Go to the <guilabel>Browser</guilabel> tab, find the outbox you <emphasis>want</emphasis> to use, right click on it, select <guilabel>Folder Properties</guilabel>, <guilabel>Attributes</guilabel> tab, enter <userinput>SpecialCollectionAttribute</userinput> then click <guilabel>Add</guilabel>, double click on the <guilabel>Value</guilabel> near the <guilabel>SpecialCollectionAttribute</guilabel> and enter <userinput>outbox</userinput>. Add also another attribute, the attribute name has to be <guilabel>ENTITYDISPLAY</guilabel> and the value <userinput>("outbox" "mail-folder-outbox" "" ())</userinput> (just copy paste from here). Restart <application>akonadi</application> and now you should be able to remove completely the unneeded local folder account.
de: Wenn die <guilabel>Lokalen Ordner</guilabel> trotzdem immer noch erstellt werden und der <guilabel>Agent zur Nachrichten-Auslieferung</guilabel> immer noch abstürzt, müssen Sie noch weitere Einstellungen in <application>akonadiconsole</application> vornehmen. Gehen Sie zur Karteikarte <guilabel>Browser</guilabel>, suchen Sie den Postausgang, den Sie verwenden möchten, und klicken Sie mit der &RMBn; darauf. Wählen Sie <guilabel>Folder Properties</guilabel> und gehen zur Karteikarte <guilabel>Attributes</guilabel>. Geben Sie hier <userinput>SpecialCollectionAttribute</userinput> ein und klicken dann auf <guibutton>Add</guibutton>. Doppelklicken Sie auf <guilabel>Value</guilabel> neben <guilabel>SpecialCollectionAttribute</guilabel> und geben <userinput>outbox</userinput> ein. Fügen Sie auch noch ein weiteres Attribut mit dem Namen <guilabel>ENTITYDISPLAY</guilabel> und dem Wert <userinput>("outbox" "mail-folder-outbox" "" ()</userinput> hinzu. Starten Sie das Programm <application>akonadi</application> erneut. Jetzt sollten Sie alle nicht mehr benötigten lokalen Ordner löschen können.

source: You get the error Unable to fetch item from backend when entering IMAP folder
de: Sie erhalten die Fehlermeldung „Unable to fetch item from backend“ beim Öffnen eines IMAP-Ordners

source: There are a number of possible reasons for this and it is something the &kmail; team hopes to tackle in time. Meanwhile, there are some workarounds:
de: Es gibt mehrere mögliche Ursachen für diesen Fehler und das &kmail;-Teams arbeitet daran. In der Zwischenzeit müssen Sie einige Übergangslösung verwenden.

source: Workaround 1
de: Übergangslösung 1

source: edit <filename>~/.local/share/akonadi/mysql.conf</filename>
de: Bearbeiten Sie die Datei <filename>~/.local/share/akonadi/mysql.conf</filename>

source: Under the <guilabel>[mysql]</guilabel> section, add: <userinput>binlog_format=row</userinput>
de: Fügen Sie im Abschnitt <guilabel>[mysql]</guilabel> den Eintrag <userinput>binlog_format=row</userinput> hinzu

source: If this does not work, try workaround 2 (below).
de: Wenn das nicht funktioniert, versuchen Sie die folgende Übergangslösung 2

source: Workaround 2
de: Übergangslösung 2

source: This one is mostly a matter of restarting so &kmail; can fetch those pesky items... Some possible steps:
de: Dies wird meistens durch einen Neustart erreicht, so dass &kmail; diese Einträge abholen kann. Führen Sie dazu folgende Schritte aus:
