Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdepim/kmail_configure.po
Languages: de

source: While it is common to sign all outgoing messages, encrypting them is not. So unless your company has a policy of never sending any unencrypted messages, it might be a good idea to keep this option switched off and rely on <link linkend="configure-security-composing-opportunistic-encryption">opportunistic encryption</link> to alert you if you <emphasis>could</emphasis> send encrypted messages, but did not request it.
de: Es ist zwar nicht ungewöhnlich, alle ausgehenden Nachrichten zu signieren, aber nicht, alle zu verschlüsseln. Sofern also Ihre Firma eine Regelung hat, nie unverschlüsselte Nachrichten zu verschicken, sollten Sie vielleicht diese Option besser ausgeschaltet lassen und sich stattdessen auf <link linkend="configure-security-composing-opportunistic-encryption">opportunistische Verschlüsselung</link> verlassen, um benachrichtigt zu werden, wenn Sie verschlüsselte Nachrichten versenden <emphasis>könnten</emphasis>, dies aber nicht angefordert haben.

source: Warn if receiver's email address is not in certificate
de: Warnen, falls die E-Mail-Adresse des Empfängers nicht im Zertifikat enthalten ist

source: If checked, &kmail; will emit a warning if an &smime; certificate or &openpgp; key will be used for a recipient whose email address is not listed in the email addresses stored in the certificate.
de: Wenn diese Option angewählt ist, zeigt &kmail; eine Warnung an, wenn ein &smime;-Zertifikat oder ein &openpgp;-Schlüssel für einen Empfänger verwendet wird, dessen E-Mail-Adresse sich nicht unter den im Zertifikat gespeicherten Nachrichten befindet.

source: Situations in which this warning will trigger include when configuring your per-identity &openpgp; keys or &smime; certificates, when encrypting, and when verifying signatures, if the signature was made with a certificate that does not include the email address of the sender.
de: Diese Warnung wird unter anderem angezeigt werden, wenn Sie Ihre &openpgp;-Schlüssel oder &smime;-Zertifikate per Identität konfigurieren, beim Verschlüsseln, beim Überprüfen von Signaturen, wenn die Signatur mit einem Zertifikat vorgenommen wurde, das die E-Mail-Adresse des Absenders nicht enthält.

source: Warn if certificates/keys expire soon
de: Warnen, falls Zertifikate/Schlüssel in Kürze ablaufen (Zeitgrenzen werden weiter unten festgelegt)

source: If checked, &kmail; will warn when an &smime; certificate or &openpgp; key is used which will expire soon.
de: Wenn diese Option angewählt ist, gibt &kmail; eine Warnung aus, wenn ein &smime;-Zertifikat oder ein &openpgp;-Schlüssel verwendet wird, der bald abläuft.

source: The period in which to warn before key/certificate expiration can then be configured separately for signing and encryption keys, as well as (in the case of &smime;), for end-user certificates, intermediate <acronym>CA</acronym> certificates and root certificates.
de: Die Vorwarnzeit, in der gewarnt wird, bevor ein Schlüssel oder Zertifikat abläuft, kann für Signier- und Verschlüsselungsschlüssel separat konfiguriert werden; für &smime; auch separat für Endbenutzerzertifikate, Zwischen-<acronym>CA</acronym>-Zertifikate und Wurzelzertifikate.

source: Re-Enable All &quot;Don&apos;t Ask Again&quot; Warnings
de: Alle „Nicht wieder fragen“-Warnungen reaktivieren

source: Apart from the main warnings described above, there are more warning and information messages, which contain an option to not show them again. If you would like to re-enable them after choosing not to show them again, you can achieve this by pressing this button.
de: Neben den wichtigsten, oben beschriebenen, Warnungen gibt es noch weitere Warnungen und Informationsmeldungen, die eine Option enthalten, sie nicht mehr anzuzeigen. Wenn Sie diese wieder einschalten möchten, nachdem Sie sie abgeschaltet hatten, können Sie dies mit dieser Schaltfläche erreichen.

source: This will re-enable <emphasis>all</emphasis> such warnings for &kmail;. It does not make much sense to allow more fine-grained selection of which warnings to show since you can just check the option to suppress them again when they next show up.
de: Damit werden <emphasis>alle</emphasis> derartigen Warnungen in &kmail; wieder eingeschaltet. Es ergibt nicht sehr viel Sinn, dies genauer einstellen zu können, weil Sie die Optionen, die Sie weiterhin unterdrücken wollen, einfach beim nächsten Auftreten wieder abschalten können.

source: &smime; Validation
de: &smime;-Prüfung

source: This tab contains selected entries from &gpgsm;'s . Please refer to the &gpgsm; manual for a description of these options.
de: Diese Karteikarte enthält ausgewählte Einträge aus dem Einrichtungsdialog von &gpgsm;. Eine Beschreibung der Optionen finden Sie im &gpgsm;-Handbuch.

source: Validate certificates using CRLs
de: Zertifikate unter Verwendung von Sperrlisten prüfen

source: If checked, &smime; certificates are validated using Certificate Revocation Lists (<acronym>CRLs</acronym>).
de: Wenn diese Option angewählt ist, werden S/MIME-Zertifikate mittels Zertifikatswiderrufslisten (Certificate Revocation Lists <acronym>CRLs</acronym>) überprüft.

source: Validate certificates online (OCSP)
de: Zertifikate online überprüfen (OCSP)

source: If this option is selected, &smime; certificates are validated using the Online Certificates Status Protocol (<acronym>OCSP</acronym>).
de: Wenn diese Option ausgewählt ist, werden S/MIME-Zertifikate mittels des Online Certificates Status Protocol (<acronym>OCSP</acronym>) überprüft.

source: Fill in the &URL; of the <acronym>OCSP</acronym> responder in the field reserved at this effect.
de: Geben Sie die &URL; des <acronym>OCSP</acronym>-Antwortservers in das dafür vorgesehene Feld ein.

source: OCSP responder &URL;
de: Adresse des OCSP-Antwortservers

source: Enter the address of the server for online validation of certificates. The &URL; is usually starting with <emphasis>http://</emphasis>.
de: Geben Sie die Adresse des Servers für die Online-Überprüfung von Zertifikaten ein. Die &URL; beginnt normalerweise mit <emphasis>http://</emphasis>.

source: OCSP responder signature
de: Signatur des OCSP-Antwortservers

source: Select or change and enter the &smime; key to use.
de: Geben Sie den zu verwenden S/MIME-Schlüssel ein oder verändern Sie diesen.

source: Ignore service &URL; of certificates
de: Dienst-Adresse von Zertifikaten ignorieren

source: Check this option to skip online validation using the OCSP. This Option requires <emphasis>dirmngr &gt;= 0.9.0</emphasis>.
de: Wählen Sie diese Option an, um die Online-Überprüfung mittels OCSP zu überspringen. Hierzu ist die Version 0.9.0 oder neuer von <emphasis>dirmngr</emphasis> notwendig.

source: Do not check certificate policies
de: Zertifikateinstellungen nicht überprüfen

source: By default, <guilabel>GnuPG</guilabel> uses the file <emphasis>~/.gnupg/policies.txt</emphasis> to check if a certificate policy is allowed. If this option is selected, policies are not checked.
de: Als Voreinstellung verwendet <guilabel>GnuPG</guilabel> die Datei <emphasis>~/.gnupg/policies.txt</emphasis>, um zu überprüfen, ob eine Zertifikatseinstellung zulässig ist. Wenn diese Option ausgewählt ist, werden Einstellungen nicht überprüft.

source: Never consult a CRLs
de: CRLs niemals verwenden

source: If this option is checked, Certificate Revocation Lists are never used to validate &smime; certificates.
de: Wenn diese Option ausgewählt ist, werden Zertifikat-Widerrufslisten (Certificate Revocation Lists, CRLs) nie zur Überprüfung von &smime;-Zertifikaten verwendet.

source: Fetch missing issuer certificates
de: Fehlende Ausstellerzertifikate herunterladen

source: Check this option if you want the missing issuer certificates to be fetched when necessary. This applies to both validation methods, <acronym>CRLs</acronym> and <acronym>OCSP</acronym>.
de: Wenn diese Option ausgewählt ist, werden fehlende Ausstellerzertifikate bei Bedarf nachträglich geholt. Dies gilt für beide Überprüfungsmethoden, <acronym>CRLs</acronym> und <acronym>OCSP</acronym>.

source: Do not perform any &HTTP; requests
de: Keine &HTTP;-Anfragen durchführen

source: Entirely disables the use of &HTTP; for &smime;.
de: Schaltet die Verwendung von &HTTP; für &smime; gänzlich ab.

source: Ignore &HTTP; CRL Distribution Point of certificates
de: &HTTP;-CRL-Verteilungspunkt von Zertifikaten ignorieren

source: When looking for the location of a CRL, the <quote>to-be-tested</quote> certificate usually contains what are known as CRL Distribution Point (<acronym>DP</acronym>) entries, which are &URL;s describing the way to access the &URL;. The first found <acronym>DP</acronym> entry is used. With this option all entries using the &HTTP; scheme are ignored when looking for a suitable <acronym>DP</acronym>.
de: Wenn nach der Adresse einer <acronym>CRL</acronym> gesucht wird, enthält das <quote>zu testende</quote> Zertifikat normalerweise sogenannte CRL-Verteilungspunkt-Einträge (<acronym>DP</acronym>). Diese sind &URL;s, die beschreiben, wie man auf die &URL; zugreift. Der zuerst gefundene Verteilungspunkt-Eintrag wird verwendet. Mit dieser Option werden alle Einträge, die das &HTTP;-Schema verwenden, bei der Suchen nach einem passenden Verteilungspunkt ignoriert.

source: Use system &HTTP; proxy
de: System-&HTTP;-Proxy verwenden

source: If this option is selected, the value of the &HTTP; proxy shown on the right (which comes from the environment variable <varname>http_proxy</varname>) will be used for any &HTTP; request.
de: Wenn diese Option ausgewählt ist, wird der rechts angezeigt Wert für den &HTTP;-Proxy (der aus der Umgebungsvariablen <varname>http_proxy</varname> stammt) für alle &HTTP;-Anfragen verwendet.

source: Use this proxy for &HTTP; requests
de: Diesen Proxy für &HTTP;-Anfragen verwenden

source: Enter here the location of your &HTTP; Proxy, which will be used for all &HTTP; requests relating to &smime; The syntax is <quote>host:port</quote>, for instance <emphasis>myproxy.nowhere.com:3128</emphasis>.
de: Geben Sie hier die Adresse Ihres &HTTP;-Proxies ein, die für alle &smime;-bezogenen &HTTP;-Anfragen verwendet werden soll. Die Syntax lautet <quote>host:port</quote>, also beispielsweise <emphasis>meinproxy.nirgendwo.de</emphasis>.

source: Do not perform any LDAP requests
de: Keine LDAP-Anfragen durchführen

source: Entirely disables the use of LDAP for &smime;.
de: Die Verwendung von <acronym>LDAP</acronym> für &smime; gänzlich abschalten.

source: Ignore LDAP CRL Distribution Point of certificates
de: LDAP-CRL-Verteilungspunkte von Zertifikaten ignorieren

source: When looking for the location of a <acronym>CRL</acronym>, the <quote>to-be-tested</quote> certificate usually contains what are known as CRL Distribution Point (<acronym>DP</acronym>) entries, which are &URL;s describing the way to access the &URL;. The first found <acronym>DP</acronym> entry is used. With this option all entries using the <acronym>LDAP</acronym> scheme are ignored when looking for a suitable <acronym>DP</acronym>.
de: Wenn nach der Adresse einer <acronym>CRL</acronym> gesucht wird, enthält das <quote>zu testende</quote> Zertifikat normalerweise sogenannte CRL-Verteilungspunkt-Einträge (<acronym>DP</acronym>). Diese sind &URL;s, die beschreiben, wie man auf die &URL; zugreift. Der zuerst gefundene Verteilungspunkt-Eintrag wird verwendet. Mit dieser Option werden alle Einträge, die das <acronym>LDAP</acronym>-Schema verwenden, bei der Suchen nach einem passenden Verteilungspunkt <acronym>DP</acronym> ignoriert.

source: Primary host for LDAP requests
de: Primärer Rechner für LDAP-Anfragen

source: Entering a <acronym>LDAP</acronym> server here will make all <acronym>LDAP</acronym> requests go to that server first. More precisely, this setting overrides any specified host and port part in a <acronym>LDAP</acronym> &URL; and will also be used if host and port have been omitted from the &URL;. Other <acronym>LDAP</acronym> servers will be used only if the connection to the <emphasis>proxy</emphasis> failed. The syntax is <acronym>HOST</acronym> or <acronym>HOST:PORT</acronym>. If <acronym>PORT</acronym> is omitted, <quote>port 389</quote> (standard <acronym>LDAP</acronym> port) is used.
de: Wenn Sie hier einen <acronym>LDAP</acronym>-Server angeben, werden alle <acronym>LDAP</acronym>-Anfragen zunächst an diesen Server geschickt. Genauer gesagt überschreibt diese Einstellung die in <acronym>LDAP</acronym> &URL;s angegebenen Rechner und Ports und werden auch dann verwendet, wenn in den &URL;s keine Rechner- und Port-Angaben enthalten sind. Andere <acronym>LDAP</acronym>-Server werden nur dann verwendet, wenn die Verbindung zum <emphasis>Proxy</emphasis> fehlgeschlagen ist. Die Syntax lautet <acronym>HOST</acronym> oder <acronym>HOST:PORT</acronym>. Wenn <acronym>PORT</acronym> nicht angegeben wird, dann wird der Standard-<acronym>LDAP</acronym>-Port <quote>389</quote> verwendet.

source: Misc Page
de: Diverses

source: Folders
de: Ordner

source: Ask for confirmation before moving all messages to trash
de: Nachfrage vor dem Werfen aller Nachrichten in den Papierkorb

source: Enable this option if you want to be asked for confirmation whenever you use <menuchoice><guimenu>Folder</guimenu><guimenuitem>Move All to Trash</guimenuitem></menuchoice>.
de: Aktivieren Sie diese Einstellung, wenn Sie um Bestätigung gefragt werden möchten, wenn Sie <menuchoice><guimenu>Ordner</guimenu><guimenuitem>Alle Nachrichten in den Papierkorb werfen</guimenuitem></menuchoice> verwenden.

source: Exclude important messages from expiry
de: Aufbewahrungsfrist gilt nicht für wichtige Nachrichten

source: Enable this option if important messages should never be deleted during message expiration, &ie; during automatic deletion of old messages.
de: Wenn diese Option angewählt ist, werden wichtige Nachrichten nie als verfallen während der automatischen Löschung verfallener Nachrichten gelöscht.

source: When trying to find unread messages
de: Regelung für die Suche nach ungelesenen Nachrichten

source: This option controls what happens if you press one of the shortcuts to go to the next or previous unread message (&eg; <keycap>Space</keycap>). If you ask &kmail; to go to the next unread message although there is no unread message below the currently selected message then the following happens: <itemizedlist> <listitem> <para>If <guilabel>Do not Loop</guilabel> is selected then nothing will happen. </para> </listitem> <listitem> <para>If <guilabel>Loop in Current Folder</guilabel> is selected then &kmail; will search from the beginning of the current folder for an unread message. If none is found then nothing happens.</para> </listitem> <listitem> <para>If <guilabel>Loop in All Folders</guilabel> is selected then &kmail; will first search in the current folder for another unread message. If none is found then &kmail; will search the next folder containing unread messages. </para> </listitem> </itemizedlist> Correspondingly, if you ask &kmail; to go to the previous unread message.
de: Diese Option steuert, was passiert, wenn Sie eine der Abkürzungen verwenden, um zur nächsten oder vorherigen ungelesenen Nachricht zu gehen (z.B. die Leertaste). Wenn Sie &kmail; bitten, zur nächsten ungelesenen Nachricht zu gehen, obwohl es darunter keine solche mehr gibt, dann passiert Folgendes: <itemizedlist><listitem><para>Wenn <guilabel>Nicht zyklisch suchen</guilabel> angewählt ist, passiert nichts.</para></listitem><listitem><para>Wenn <guilabel>Im aktuellen Ordner zyklisch suchen</guilabel> angewählt ist, dann sucht &kmail; vom Anfang des aktuellen Ordners nach einer ungelesenen Nachricht. Wenn keine gefunden wird, passiert nichts.</para></listitem><listitem><para>Wenn <guilabel>In allen Ordner zyklisch suchen</guilabel> angewählt ist, dann sucht &kmail; zunächst im aktuellen Ordner nach einer anderen ungelesenen Nachricht. Wenn keine solche gefunden wird, dann sucht &kmail; im nächsten Ordner nach ungelesenen Nachrichten.</para></listitem></itemizedlist> Entsprechendes gilt, wenn Sie &kmail; bitten, zur vorherigen ungelesenen Nachricht zu gehen.

source: When entering a folder
de: Beim Öffnen eines Ordners

source: This option controls what happens if you open a folder.
de: Hier kann das Verhalten beim Öffnen eines Ordners eingestellt werden.

source: If <guilabel>Jump to First Unread Message</guilabel> is selected then &kmail; will select the first message it finds that is marked as unread.
de: Mit <guilabel>Zur ersten ungelesenen Nachricht springen</guilabel> geht &kmail; zur ersten Nachricht, die als ungelesen markiert ist.

source: If <guilabel>Jump to Last Selected Message</guilabel> is selected then &kmail; will select the message that was selected when the folder was open the last time.
de: Mit der Einstellung <guilabel>Zur zuletzt ausgewählten Nachricht springen</guilabel> geht &kmail; zur Nachricht, die bei der letzten Anzeige diese Ordners ausgewählt war.

source: If <guilabel>Jump to Newest Message</guilabel> is selected then &kmail; will select the newest message by date.
de: Mit <guilabel>Zur neuesten Nachricht springen</guilabel> geht &kmail; zur neuesten Nachricht unabhängig vom Status.

source: If <guilabel>Jump to Oldest Message</guilabel> is selected then &kmail; will select the oldest message by date.
de: Mit <guilabel>Zur ältesten Nachricht springen</guilabel> geht &kmail; zur ältesten Nachricht unabhängig vom Status.

source: Mark selected message as read after...
de: Aktuelle Nachricht nach dieser Zeitspanne als gelesen markieren:

source: When you select a <guilabel>new</guilabel> or <guilabel>unread</guilabel> message, &kmail; will change the message's status to <guilabel>read</guilabel> after the number of seconds entered here. If you disable this option, messages will keep their <guilabel>new</guilabel> or <guilabel>unread</guilabel> status.
de: Wenn man eine neue oder ungelesene Nachricht auswählt, ändert &kmail; den Nachrichtenstatus nach der angegebenen Zeitspanne in Sekunden auf <guilabel>gelesen</guilabel>. Falls diese Option deaktiviert wird, behält die Nachricht den Status <quote>neu</quote> oder <quote>ungelesen</quote>.

source: Ask for action after dragging messages to another folder
de: Beim Verschieben von Nachrichten in einen anderen Ordner nach der gewünschten Aktion fragen

source: When you drag a message to a different folder, a small popup will ask you if you want to move or copy the message. If you disable this option, the message will be moved immediately, without a popup.
de: Falls man eine Nachricht auf einen anderen Ordner zieht, erscheint ein kleiner Dialog, der fragt, ob die Nachricht kopiert oder verschoben werden soll. Falls diese Option deaktiviert ist, wird die Nachricht ohne Nachfrage verschoben.

source: Open this folder on startup
de: Dieses Ordner beim Start öffnen

source: Here you can set the folder that should be selected by default if you start &kmail;. If you use only &imap; folders then you might want to set this to your &imap; inbox folder. If you do that, you can collapse the local folders in the folder list, and then they will stay collapsed when &kmail; starts.
de: Hier können Sie den Ordner auswählen, der per Voreinstellung beim Start von &kmail; ausgewählt sein soll. Wenn Sie nur &imap;-Ordner verwenden, werden Sie diese Einstellung wahrscheinlich auf Ihren &imap;-Posteingang setzen wollen. Ist das der Fall, können Sie die lokalen Ordner in der Liste einklappen, und sie werden beim Start von &kmail; eingeklappt bleiben.

source: Empty the local trash folder on program exit
de: Beim Beenden lokalen Papierkorb leeren

source: The trash folder is cleared of messages when you quit &kmail; if this option is selected.
de: Wenn diese Option aktiviert ist, dann werden beim Verlassen von &kmail; alle Nachrichten im Papierkorb gelöscht.

source: Invitations
de: Einladungen

source: Mangle From:/To: headers in replies to invitations
de: Vorspannfelder für „Von“ und „An“ in Antworten auf Terminanfragen einsetzen

source: Enable this option to make <application>&Microsoft; Outlook</application> understand your answers to invitations replies.
de: Schalten Sie diese Option ein, damit <application>&Microsoft; Outlook</application> Ihre Antworten auf Einladungen versteht.

source: Send invitations in the mail body
de: Einladung im Textteil der E-Mail verschicken

source: Invitations are usually sent as attachments to a mail. When this option is enabled, invitation are sent in the text of the mail, which is necessary to send invitations and replies to <application>&Microsoft; Outlook</application>.
de: Einladungen werden normalerweise als Anhang einer Nachricht versendet. Durch Einschalten dieser Option verschicken Sie Einladungen im Text der Nachricht. Das ist notwendig ist, damit <application>&Microsoft; Outlook</application> die Einladungen und Antworten versteht.

source: Exchange compatible invitations naming
de: Exchange-kompatible Namensvergabe für Einladungen

source: <application>&Microsoft; Outlook</application>, when used in combination with a &Microsoft; Exchange server, has a problem understanding standards-compliant groupware e-mail. Enable this option to send groupware invitations in a way that &Microsoft; Exchange understands. The invitation will be sent as an attachment with name <filename>ical.ics</filename>.
de: Wenn <application>&Microsoft; Outlook</application> mit einem &Microsoft;-Exchange-Server eingesetzt wird, versteht es keine standardkonformen Arbeitsgruppen-E-Mails. Wenn diese Einstellung aktiviert ist, werden Einladungen in einem Format gesendet, das von &Microsoft; Exchange verstanden wird. Die Einladung wird als Anhang mit dem Namen <filename>ical.ics</filename> gesendet.

source: Outlook compatible invitation reply comments
de: Outlook-kompatible Kommentare in Antworten auf Einladungen

source: When the user provides comments when responding to invitations, send the comment in a way that <application>&Microsoft; Outlook</application> understands. If this option is not enabled, the response comments will not be seen in Outlook.
de: Werden Kommentare mit einer Antwort auf Einladungen verschickt, wird der Kommentar in einem Format gesendet, das von <application>&Microsoft; Outlook</application> verstanden wird. Ist diese Option nicht aktiv, werden der Kommentar in der Antwort in Outlook nicht angezeigt.

source: Show invitation update differences in the Outlook style
de: Unterschiede bei Änderungen an Einladungen im Outlook-Stil anzeigen

source: When viewing updated invitations, this option enables the differences between the previous and current invitations to be displayed in a way very much like <application>&Microsoft; Outlook</application>. This is the default. The user can turn this option off if they want to see the invitation update differences shown in the <quote>classic</quote> &kmail; style.
de: Bei der Anzeige von aktualisierten Einladungen werden mit dieser Einstellung die Unterschiede zwischen der ursprünglichen und der aktuellen Einladung wie in <application>&Microsoft; Outlook</application> dargestellt. Dies ist der Standard. Möchten Sie die Unterschiede im klassischen &kmail;-Stil angezeigt haben, deaktivieren Sie diese Einstellung.

source: Automatic invitation sending
de: Automatisch Einladungen versenden
