Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdepim/kmail_configure.po
Languages: de

source: If checked, &kmail; will quote only the selected text in the message window, instead of the complete message, when replying. With this, it is possible to quickly generate replies that quote only the relevant paragraph to which you are actually replying, and omits the other paragraphs that are not relevant to the context.
de: Ist diese Einstellung aktiv, wird beim Antworten nur der ausgewählte Text im Nachrichtenfenster zitiert, nicht der gesamte Nachrichtentext. Damit kann schnell so geantwortet werden, dass nur die wichtigen Teile der Nachricht, auf die Sie sich beziehen, zitiert wird. Andere Absätze, die in diesem Zusammenhang unwichtig sind, werden weggelassen.

source: Remove the signature when replying
de: Beim Antworten Signatur entfernen

source: If checked, &kmail; will remove the signature from the quoted text when replying to a message. This is useful since it reduces the amount of quoted text, which makes it easier to read the reply.
de: Ist diese Einstellung aktiv, wird beim Antworten auf eine E-Mail die Signatur nicht zitiert. Damit wird die Länge des zitierten Textes kürzer, die Antwort ist besser lesbar.

source: Automatically request message disposition notifications
de: Automatisch Empfangs- und Lesebestätigungen anfordern

source: If checked, <xref linkend="composer-options-request-mdn"/> will default to <emphasis>on</emphasis>. Check this option only if you know what you are doing. &mdn;s are considered a nuisance (or are simply ignored) by a lot of people. It is better to decide to request them on a message-by-message basis.
de: Wenn diese Option angewählt ist, dann ist die Standardeinstellung für <xref linkend="composer-options-request-mdn"/> <emphasis>aktiviert</emphasis>. Verwenden Sie diese Option nur, wenn Sie wissen, was Sie tun. &mdn;s gelten vielen Leuten als lästig (oder werden einfach ignoriert). Es ist besser, von Nachricht zu Nachricht zu entscheiden, ob eine Benachrichtigung angefordert werden soll.

source: Word wrap at column
de: Zeilenumbruch bei Spalte

source: Lets you turn word wrapping on and off in the composer window and lets you set the column at which words will be wrapped (you probably should not need to change the default value, which is <literal>78</literal>).
de: Diese Einstellung steuert den automatischen Umbruch von zu langen Zeilen im E-Mail-Editor und erlaubt Ihnen anzugeben, in welcher Spalte umgebrochen werden soll (der Standardwert von <userinput>78</userinput> Zeichen sollte möglichst nicht geändert werden).

source: Autosave interval
de: Intervall für automatisches Speichern

source: A backup copy of the text in the composer window can be created regularly. This option lets you specify the interval used to create the backup. You can disable autosaving by setting it to the value <literal>0</literal>.
de: Eine Sicherheitskopie des Texts im Editierfenster kann in regelmäßigen Abständen angelegt werden. Mit dieser Option können Sie das Intervall angeben. <literal>0</literal> schaltet das Erstellen von Sicherheitskopien ab.

source: Standard Templates
de: Standard-Vorlagen

source: Here you can add, edit, and delete custom message templates to use when you compose a reply or forwarding message.
de: Hier können Sie benutzerdefinierte Vorlagen hinzufügen, bearbeiten und löschen. Diese Vorlagen werden beim Antworten oder der Weiterleitung einer E-Mail verwendet.

source: Message templates support substitution commands, by simply typing them or selecting them from the <guimenu>Insert Command</guimenu> menu.
de: Die Vorlagen unterstützen das automatische Ersetzen von Platzhaltern; Sie können diese manuell eingeben oder aus dem Menü <guimenu>Platzhalter einfügen</guimenu> wählen.

source: These are global (default) templates. They can be overridden by per-identity templates or per-folder templates if they are specified.
de: Dies sind globale (Standard-)Vorlagen. Sie können von Identitäts- oder Ordner-Vorlagen überschrieben werden, falls solche vorhanden sind.

source: Custom Templates
de: Eigene Vorlagen

source: Here you can add, edit, and delete custom message templates to use when you compose a reply or forwarding message. Create the custom template by typing the name into the input box and press the <guiicon>+</guiicon> button. You can bind a keyboard combination to the template for faster operations.
de: Hier können Sie eigene Vorlagen für das Antworten auf oder das Weiterleiten von Nachrichten erstellen, ändern und löschen. Erstellen Sie eine eigene Vorlage, indem Sie den Namen ins Eingabefeld eintragen und dann auf den Knopf <guiicon>+</guiicon> drücken. Sie können der Vorlage auch eine Tastenkombination zuweisen, um einen schnelleren Zugriff darauf zu haben.

source: There are four types of custom templates: used to <guilabel>Reply</guilabel>, <guilabel>Reply to All</guilabel>, <guilabel>Forward</guilabel>, and <guilabel>Universal</guilabel> which can be used for all kinds of operations. You cannot bind a keyboard shortcut to <guilabel>Universal</guilabel> templates.
de: Es gibt vier Vorlagen-Typen: <guilabel>Antworten</guilabel>, <guilabel>Allen antworten</guilabel>, <guilabel>Weiterleiten</guilabel> und <guilabel>Allgemein</guilabel> für Vorlagen, die zu jeder Aktion passen. Vorlagen des Typs <guilabel>Allgemein</guilabel> können nicht mit einer Tastenkombination verknüpft werden.

source: Subject
de: Betreff

source: This section contains a list of prefixes for <quote>Reply</quote> and <quote>Forward</quote>. If you receive messages that use prefixes different to the standard ones, you can add them here so &kmail; will recognize them. This way &kmail; can ignore them for sorting messages and when setting the subject of a reply or a forwarded messages, and optionally replace them with <quote>Re:</quote> or <quote>Fwd:</quote> respectively.
de: Dieser Abschnitt enthält eine Liste von Präfixen für <quote>Antworten</quote> und <quote>weitergeleitete Nachrichten</quote>. Falls man Nachrichten erhält, die andere Präfixe für diesen Zweck verwenden, kann man sie der Liste in &kmail; hinzufügen, damit &kmail; sie von nun an erkennt. Auf diese Weise kann &kmail; diese Präfixe bei der Sortierung von Nachrichten oder der Erstellung der Betreffzeile einer Antwort ignorieren und optional durch <quote>Re:</quote> oder <quote>Fwd:</quote> ersetzen.

source: Charset
de: Zeichensatz

source: Here you can manage the default charsets used for your own messages. Every message you send will be checked if it is written in one of the listed charsets, starting at the top of the list. If it is, this charset will be used. If it is not, a dialog will show up and tell you that you manually have to choose a charset using <menuchoice><guimenu>Options</guimenu><guisubmenu>Set Encoding</guisubmenu></menuchoice>.
de: Hier kann man die Standardzeichensätze für eigene Nachrichten festlegen. Für jede geschriebene Nachricht wird überprüft, ob sie in einem der aufgelisteten Zeichensätze geschrieben wurde. Begonnen wird dabei oben in der Liste. Falls keiner der gelisteten Zeichensätze für die Nachricht ausreicht, erscheint eine Meldung, die zur manuellen Auswahl eines geeigneten Zeichensatzes im Menü <menuchoice><guimenu>Optionen</guimenu><guisubmenu>Kodierung festlegen</guisubmenu></menuchoice> auffordert.

source: If you select <guilabel>Keep original charset when replying or forwarding (if possible)</guilabel>, the original message's charset will be kept, unless there are now characters that cannot be represented using that charset.
de: Falls man <guilabel>Ursprungs-Zeichensatz beim Beantworten und Weiterleiten möglichst beibehalten</guilabel> markiert, wird der ursprüngliche Zeichensatz beibehalten, wenn es nicht mittlerweile Zeichen gibt, die nicht mehr in diesem Zeichensatz dargestellt werden können.

source: Headers
de: Vorspann

source: Check the <guilabel>Use custom message-id suffix</guilabel> checkbox if you want &kmail; to generate Message-Id's with a custom suffix. Enter the desired suffix in the <guilabel>Custom message-id suffix</guilabel> field. Please make sure that the suffix that you specify is world-wide unique. The best thing is to use the name of a domain which you are the owner of. If you do not check <guilabel>Use custom Message-Id suffix</guilabel> then &kmail; will automatically generate the complete Message-Id. If you do not know what this is all about do not check this option.
de: Mit der Option <guilabel>Benutzerdefinierte Endung für Nachrichtenkennung benutzen</guilabel> kann man &kmail; veranlassen, Nachrichtenkennungen mit einer eigenen Endung zu erzeugen. Die gewünschte Endung kann im Feld <guilabel>Benutzerdefiniert Endung für Nachrichtenkennung</guilabel> eingetragen werden. Die Endung muss weltweit eindeutig sein. Man sollte möglichst den Namen einer eigenen Domain verwenden. Falls man <guilabel>Benutzerdefinierte Endung für Nachrichtenkennung benutzen</guilabel> nicht markiert, generiert &kmail; automatisch die komplette Nachrichtenkennung. Im Zweifelsfalls sollte man dieses Ankreuzfeld nicht markieren.

source: The <guilabel>Define custom mime header fields</guilabel> list sets the headers that &kmail; will use for its outgoing messages. You can both invent new fields and overwrite existing ones. This feature is only useful for advanced users.
de: Die Liste <guilabel>Definieren Sie eigene MIME-Vorspannfelder</guilabel> legt die Vorspannfelder fest, die &kmail; für den Versand von Nachrichten verwendet. Man kann entweder neue Felder erfinden oder existierende überschreiben. Diese Einstellmöglichkeit ist für Anfänger nicht sinnvoll.

source: Attachments
de: Anhänge

source: If you have to send attachments with filenames containing non-English characters to users of <application>&Microsoft; Outlook</application> or <application>&Microsoft; Outlook Express</application> then you might want to check the <guilabel>Outlook-compatible attachment naming</guilabel> option. &kmail; will then encode the attachment names in a non-standard way that is understood by <application>&Microsoft; Outlook</application>.
de: Wenn Sie Anhänge mit Dateinamen, die nicht-englische Zeichen enthalten, an Benutzer von <application>&Microsoft; Outlook</application> oder <application>&Microsoft; Outlook Express</application> verschicken wollen, dann sollten Sie die Option <guilabel>Outlook-kompatible Namensvergabe für Anhänge</guilabel> anwählen. &kmail; kodiert dann die Anhangnamen auf eine nicht-standardisierte Weise, die von <application>&Microsoft; Outlook</application> verstanden wird.

source: Note that &kmail; will create non-standard compliant messages, and consequently it is possible that your messages will not be understood by standard-compliant mail clients. So, unless you have no other choice, you should not enable this option.
de: Beachten Sie, dass &kmail; nicht-standard-konforme Nachrichten erzeugen wird und Ihre Nachrichten daher von standard-konformen E-Mail-Klienten nicht verstanden werden. Sie sollten diese Option also nur verwenden, wenn es gar nicht anders geht.

source: Check the <guilabel>Enable detection of missing attachments</guilabel> checkbox if you want &kmail; to warn you whenever you are about to send a message without attachments although the message text contains certain words which indicate that you wanted to include an attachment. The list of key words can be modified.
de: Wählen Sie <guilabel>Suche nach fehlenden Anhängen aktivieren</guilabel> aus, wenn Sie von &kmail; gewarnt werden wollen, wenn Sie dabei sind, eine Nachricht ohne Anhänge zu versenden, obwohl der Nachrichtentext bestimmte Wörter enthält, die anzeigen, dass Sie eigentlich einen Anhang anhängen wollten. Die Liste der Schlüsselwörter kann bearbeitet werden.

source: Autocorrection
de: Autokorrektur

source: To enable the feature, check the <guilabel>Enable autocorrection</guilabel> option. In the drop down box choose the language you would like to use. You can import settings from <application>LibreOffice</application> or another &kmail; installation by selecting the appropriate choice from the <guilabel>Import</guilabel> drop down box. If you need to save your settings for another installation or application, select the <guibutton>Export</guibutton> button.
de: Um diese Funktion einzuschalten, klicken Sie auf <guilabel>Autokorrektur aktivieren</guilabel>. Wählen Sie dann im Auswahlfeld die Sprache für die Autokorrektureinstellungen. Sie können die Einstellungen aus <application>LibreOffice</application> oder von einer anderen &kmail;-Installation importieren, indem Sie die entsprechenden Optionen im Auswahlfeld <guilabel>Importieren</guilabel> auswählen. Möchten Sie Ihre Einstellungen in einem anderen Programm oder in einer anderen &kmail;-Installation benutzen, wählen Sie den Knopf <guibutton>Exportieren</guibutton>.

source: Autocorrect Options
de: Autokorrektur-Einstellungen

source: Simple Autocorrection
de: Einfache Autokorrektur

source: This allows you to configure &kmail; to autocorrect various simple corrections. Check the box next to the autocorrect feature you would like to enable.
de: Auf dieser Karteikarte können Sie die diverse einfache Autokorrekturen einstellen. Klicken Sie auf das Ankreuzfeld neben der Funktion, die Sie verwenden möchten.

source: Custom Quotes
de: Benutzerdefinierte Anführungszeichen

source: You can replace double or single quotes with typographical quotes by checking the appropriate box. You can also add non breaking space before specific punctuation marks in French text by selecting the option.
de: Sie können doppelte oder einfache Anführungszeichen durch typographische Anführungszeichen ersetzen lassen, wenn Sie die entsprechenden Felder ankreuzen. Außerdem können Sie geschützte Leerzeichen vor bestimmten Satzzeichen für französischen Text einfügen lassen.

source: Advanced Autocorrection
de: Erweiterte Autokorrektur

source: You can enter custom automatic word replacement by checking this option. To enter a custom string to replace automatically enter the word to be replaced in the <guilabel>Find</guilabel> box, and the replacement word in the <guilabel>Replace</guilabel> box and click the <guibutton>Add</guibutton> button. To remove a custom word replacement string, highlight the string and click <guibutton>Remove</guibutton>.
de: Kreuzen Sie <guilabel>Wortersetzung aktivieren</guilabel> an, um benutzerdefinierte automatische Worterstzungen einzugeben. Geben Sie eine eigene zu ersetzende Zeichenkette im Feld <guilabel>Suchen</guilabel> und das Ersetzungswort dazu im Feld <guilabel>Ersetzen</guilabel> ein. Klicken Sie dann auf <guibutton>Hinzufügen</guibutton>. Um eine definierte Wortersetzung zu löschen, klicken Sie auf die Zeile und dann auf <guibutton>Entfernen</guibutton>.

source: Exceptions
de: Ausnahmen

source: This allows you to set exceptions where you would like &kmail; to ignore your autocorrect selections for end of sentence and two uppercase letters. Enter the exception and click <guibutton>Add</guibutton> button. To remove the exception, highlight the string and click <guibutton>Remove</guibutton> button.
de: Hier können Sie Ausnahmen eintragen, die von &kmail; bei der Autokorrektur nicht als Satzende behandelt und als zwei Großbuchstaben zugelassen werden soll. Geben Sie die Ausnahmen ein und klicken Sie dann auf <guibutton>Hinzufügen</guibutton>. Um eine Ausnahme zu löschen, klicken darauf/e und dann auf <guibutton>Entfernen</guibutton>.

source: Once you have made all of your autocorrect selections click the <guibutton>Apply</guibutton> button.
de: Haben Sie alle Einstellungen für die Autokorrektur vorgenommen, klicken Sie auf den Knopf <guibutton>Anwenden</guibutton>.

source: Auto Resize Image
de: Bildgröße automatisch ändern

source: In some circumstances you may need to have &kmail; automatically resize image attachments on outgoing emails. &eg; Mail server limits. To do so, select <guilabel>Automatically resize images</guilabel>. There are several options that come with this feature.
de: Unter manchen Umständen möchten Sie die Größe von Bildern als Anhänge von ausgehenden Nachrichten ändern, &eg; wegen Einschränkungen durch den E-Mail-Server. Wählen Sie dazu <guilabel>Bildgröße automatisch ändern</guilabel>. Es gibt mehrere Einstellungen für diese Funktion.

source: <guilabel>General</guilabel>
de: <guilabel>Allgemein</guilabel>

source: Some general options for auto image resizing are as follows: If you need your images to keep the ratio of length and width intact &eg; Photographs, select <guilabel>Keep ratio</guilabel>. The default behavior is for &kmail; to prompt and ask if you want to resize before resizing, if you want it to resize without asking, unselect <guilabel>Ask before resizing</guilabel>. &kmail; will save the file in <acronym>JPG</acronym>, if you would rather have them save in <acronym>PNG</acronym> format, select it from the <guilabel>Write to format</guilabel> drop down box.
de: Hier können einige allgemeine Einstellungen für die Größenänderung von Bildern angegeben werden. Soll das Verhältnis von Breite zu Höhe erhalten bleiben, &eg; für Fotos, wählen Sie <guilabel>Größenverhältnis beibehalten</guilabel>. Als Voreinstellung wird vor der Änderung der Bildgröße um Bestätigung gefragt, Diese Verhalten können Sie abschalten, indem Sie <guilabel>Nachfragen vor Größenänderung</guilabel> deaktivieren. Normalerweise wird die Datei im Format <acronym>JPG</acronym> gespeichert, möchten Sie aber das Format <acronym>PNG</acronym> benutzen, wählen Sie des im Auswahlfeld <guilabel>Umwandeln in Format</guilabel>.

source: Image
de: Bild

source: Say you have a relative that can only receive image files of a certain size due to their email providers limits, you can use the <guilabel>Reduce image to maximum dimension:</guilabel> option to select a size to reduce the image to and enter their email into the filters on the <guilabel>Recipients</guilabel> tab. The recipients tab is discussed in further detail at the end of this section. If you need a custom size, choose the last option <guilabel>Custom</guilabel> from the width and height drop down boxes, and enter the number in the text box. You can also enlarge images by selecting <guilabel>Enlarge image to minimum dimension</guilabel>. The last option allows you to skip images of a certain filesize (this will verify image size by width x height only).
de: Angenommen Sie haben einen Empfänger, der nur Bilder bis zu einer bestimmten Größe wegen Beschränkungen durch seinen E-Mail-Anbieter empfangen kann. benutzen Sie die Einstellung <guilabel>Bild auf maximale Abmessung verkleinern</guilabel>. Geben Sie dann minimale und maximale Bildgrößen ein und tragen deren E-Mail-Adressen auf der Karteikarte <guilabel>Empfänger</guilabel> ein. Weitere Informationen zu Empfängern werden später gegeben. Möchten Sie eigene Größen verwenden, wählen Sie die letzte Einstellung <guilabel>Benutzerdefiniert</guilabel> in den Auswahlfeldern für Höhe und Breite und geben die gewünschten Dimensionen in die Größenfelder ein. Sie können außerdem auch kleine Bilder vergrößern, indem Sie <guilabel>Bild auf minimale Abmessung vergrößern</guilabel> auswählen. Die letzte Einstellung erlaubt es, Bilder kleiner als die festgelegte Dateigröße zu überspringen.

source: Filename
de: Dateiname

source: Source filter
de: Quellenfilter

source: If you would like the resizing to be done based on the name of the file, you would select the appropriate filter here. &eg; You need to send your boss multiple images daily, and your boss requires them to be the same size. You could name all of your work images work1, work2 &etc; then select <guilabel>Include all files whose names contains one of the patterns</guilabel> and enter work into the <guilabel>Pattern:</guilabel> text box. You can also exclude files in the same way by selecting <guilabel>Exclude all files whose names contains one of the patterns</guilabel>. The default behavior is no filtering.
de: Möchten Sie die Größenänderung auf der anhand der Dateinamen durchführen, Stellen Sie hier den passenden Filter ein, wenn Sie &eg; jeden Tag mehrere Bilder mit der gleichen Größe versenden möchten. Sie könnten dann &etc; für alle Bilder den Text „Arbeit“ im Namen verwenden, dann <guilabel>Alle Dateien einschließen, deren Namen eines der Muster enthält</guilabel> auswählen und „Arbeit“ in das Textfeld <guilabel>Muster</guilabel> eintragen. Auf die gleiche Weise können Sie Dateien ausschließen, indem Sie stattdessen <guilabel>Alle Dateien ausschließen, deren Namen eines der Muster enthält</guilabel> auswählen. Als Voreinstellung wird keine Filterung durchgeführt.

source: Image Format
de: Bildformat

source: Select <guilabel>Resize all images with one of these formats</guilabel> to set a specific format to resize the image to.
de: Wählen Sie <guilabel>Größe aller Bilder in einem dieser Formate ändern</guilabel>, um ein bestimmtes Format für die Größenänderung anzugeben.

source: When this option is enabled you must select the <guibutton>Select Format...</guibutton> button and select a format from the dialog.
de: Ist diese Einstellung aktiviert, müssen Sie auf <guibutton>Format auswählen ...</guibutton> klicken und im Dialog ein Format auswählen.

source: Resize filename
de: Dateinamen geänderter Bilder

source: Select <guilabel>Rename resized images with the following pattern</guilabel> if you would like your resized images to be renamed with a specific pattern. Enter the pattern into the text box. You can use:
de: Wählen Sie <guilabel>In der Größe geänderte Bilder nach folgendem Muster ändern</guilabel>, wenn Sie geänderte Bilder nach einem bestimmten Muster umbenennen möchten. Geben Sie dazu einige der folgenden Platzhalter in das Textfeld ein:

source: %t set current time
de: %t für die aktuelle Zeit

source: %d set current date
de: %d für das aktuelle Datum

source: %n original filename
de: %n für den ursprünglichen Dateinamen

source: %e original extension
de: %e für die ursprüngliche Dateierweiterung

source: %x new extension
de: %x für die neue Dateierweiterung

source: Recipients
de: Empfänger

source: This tab is where you would specify recipients that need to have resized images. &eg; grandma@myfamily.net; boss@mywork.com. You need to decide if you need multiple or only one, and enter the email(s) into the text box using the <quote>;</quote> as a separator when you have multiple. You can also specify if you do not want certain recipient(s) images to be resized. The default is no filtering.
de: Auf dieser Karteikarte geben Sie Empfänger ein, die Bilder mit geänderten Größen erhalten sollen. Sie müssen angeben, ob eine oder mehrere E-Mail-Adressen verwendet werden sollen und dann die Adressen getrennt durch <quote>:</quote> als Trennzeichen eintragen. Sie können auch bestimmte Empfänger eingeben, die keine in der Größe geänderte Bilder erhalten sollen. In der Voreinstellung ist diese Filterung abgeschaltet.

source: External Editor
de: Externer Editor

source: Use external editor instead of composer
de: Externen Editor verwenden
