Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdepim/kmail_using-kmail.po
Languages: de

source: Will scan the given header field, modify its contents and write it back. The search string is always interpreted as a case-sensitive regular expression. The replacement string is inserted literally except for occurrences of <userinput>\n</userinput>, <userinput>$n</userinput> and <userinput>${nn}</userinput>, where <userinput>n</userinput> is a positive (single-digit, except for the third form) number or <userinput>0</userinput>. These constructs are interpreted as back references to substrings captured with parentheses in the search string.
de: Liest das bisherige Vorspannfeld, verändert seinen Inhalt und schreibt diesen veränderten Inhalt. Der Suchtext ist immer ein regulärer Ausdruck mit Unterscheidung der Klein-/Großschreibung. Der Ersetzungstext wird wörtlich eingefügt, außer den Sonderzeichen <userinput>\n</userinput>, <userinput>$n</userinput> und <userinput>${nn}</userinput>, wobei <userinput>n</userinput> für eine positive (mit Ausnahme der dritten Form einziffrige) Zahl oder <userinput>0</userinput> steht. Diese Sonderzeichen verweisen zurück auf Teiltexte in Anführungszeichen, die im Suchtext vorkamen.

source: Analogous restrictions as in the <guilabel>add header</guilabel> action apply here, too.
de: Analog zur <guilabel>add header</guilabel> Aktion bestehen auch hier Einschränkungen.

source: Play Sound
de: Einen Klang abspielen

source: Will play the specified sound.
de: Spielt den angegebenen Klang ab.

source: Filter Examples
de: Beispiele für Filter

source: As of yet &kmail; does not highlight or mark mails that have an extra <replaceable>Priority:</replaceable> header. If I want to flag all <quote>urgent</quote> messages as being <emphasis>important</emphasis>, I can use a filter:
de: Derzeit können E-Mails, die den besonderen Prioritäts-Vorspann <replaceable>Priority:</replaceable> enthalten, nicht automatisch von &kmail; hervorgehoben werden. Stattdessen können Sie aber einen Filter verwenden, der E-Mails für Sie als <emphasis>wichtig</emphasis> markiert, wenn sie den Vorspann <quote>dringend</quote> enthalten:

source: Tagging urgent messages as <emphasis>important</emphasis>
de: Dringende Nachrichten als <emphasis>wichtig</emphasis> markieren

source: Open up the <menuchoice><guimenu>Settings</guimenu><guimenuitem>Configure Filters...</guimenuitem></menuchoice> dialog and click the <guiicon>New</guiicon> icon below the <guilabel>Available Filters</guilabel> list.
de: Wählen Sie <menuchoice><guimenu>Einstellungen</guimenu><guimenuitem>Filter einrichten&nbsp;...</guimenuitem></menuchoice> und dann unter der <guilabel>Liste verfügbarer Filter</guilabel> auf <guiicon>Neu</guiicon>.

source: In the <guilabel>Filter Criteria</guilabel> area, select <guilabel>Anywhere in Headers</guilabel> and <guilabel>contains</guilabel> from the drop down boxes and type <userinput>Priority</userinput> in the text field. Select the same criteria in the next line and type <userinput>urgent</userinput> in the text field of the second drop down box.
de: Im Bereich <guilabel>Filterbedingungen</guilabel> wählen Sie <guilabel>Irgendwo im Nachrichtenvorspann</guilabel> und <guilabel>enthält</guilabel> in den Auswahlfeldern und geben <userinput>Priority</userinput> im das Textfeld ein. Wählen Sie die gleiche Bedingung in der nächsten Zeile und geben Sie <userinput>urgent</userinput> in das zweite Textfeld ein.

source: So your filter will match all messages containing a <quote>Priority: urgent</quote> header field.
de: Auf diese Weise wird Ihr Filter für alle Nachrichten gelten, die das Vorspannfeld <quote>Priority: urgent</quote> enthalten.

source: Skip down to the <guilabel>Filter Actions</guilabel> area. Select <guilabel>Mark As</guilabel> from the first drop down box. A new drop down box containing a list of marker flags is shown to the right. Select <guilabel>Important</guilabel> from the drop down box.
de: Wechseln Sie in den Bereich <guilabel>Filteraktionen</guilabel> und wählen Sie <guilabel>Markieren als</guilabel> aus dem ersten Auswahlfeld. Daraufhin erscheint eine weiteres Auswahlfeld, das die möglichen Markierungen enthält. Wählen Sie hier <guilabel>Wichtig</guilabel> aus.

source: Since you want this filter to <emphasis>not</emphasis> prevent other filters message rules from being applied, carefully <emphasis>uncheck</emphasis> the <guilabel>If this filter matches, stop processing here</guilabel> option.
de: Weil dieser Filter <emphasis>nicht</emphasis> verhindern soll, dass auch noch andere Filter angewendet werden, <emphasis>deaktivieren</emphasis> Sie bitte das Ankreuzfeld <guilabel>Bearbeitung hier beenden, falls Filterbedingung zutrifft</guilabel> in der Karteikarte <guilabel>Erweitert</guilabel>.

source: Click on <guibutton>OK</guibutton>, and you are done.
de: Drücken Sie nun <guibutton>OK</guibutton> und der Filter ist eingerichtet.

source: Just keep in mind to move the <quote>Priority: urgent</quote> filter entry to the top of the <guilabel>Available Filters</guilabel> list, each time, when you have added another filter, so your non-stopping filter will always be applied first.
de: Verschieben Sie diesen Filter <quote>Priority: urgent</quote> immer an den Beginn der <guilabel>vorhandenen Filter</guilabel>, damit er immer angewendet wird.

source: If I am subscribed to the (general) &kde; List, I could create a folder for the list (I will call it <replaceable>KDE-General</replaceable>) and use a filter to automatically transfer new messages from my inbox to my <replaceable>KDE-General</replaceable> folder if they are from the &kde; List. Here is how to create this filter:
de: Wenn man in der Mailingliste für &kde;-Benutzer eingetragen ist, könnte man einen extra Ordner für Nachrichten aus dieser Liste erstellen (er könnte z.B. <replaceable>KDE-Benutzer</replaceable> heißen) und einen Filter benutzen, um automatisch von dieser Liste eingehende Nachrichten in diesen Ordner zu verschieben. Hier ist eine Beschreibung, wie man einen solchen Filter erstellt:

source: Filtering a mailing list
de: Eine Mailingliste herausfiltern

source: Try if <menuchoice><guimenu>Message</guimenu><guisubmenu>Create filter</guisubmenu><guimenuitem>Filter on Mailing-List...</guimenuitem></menuchoice> can identify the mailing list (the name of the list should then appear in the menu item); in this case, this works and I am presented a filter that has <quote>List-Id <guilabel>contains</guilabel> &lt;kde.kde.org&gt;</quote> preset. You select the desired destination folder from the folder pull-down menu in the <guilabel>Filter Action</guilabel> group and that is it.
de: Wenn <menuchoice><guimenu>Nachricht</guimenu><guisubmenu>Filter anlegen</guisubmenu><guimenuitem>Nach Mailingliste filtern ...</guimenuitem></menuchoice> die Mailingliste identifizieren kann, erscheint der Name der Liste im Menüeintrag. Im Beispiel funktioniert es und ein Filter mit dem Eintrag <quote>List-Id<guilabel>enthält</guilabel> &lt;kde.kde.org&gt;</quote> wird angelegt. Wählen Sie den gewünschten Zielordner aus dem Auswahlfeld der Gruppe <guilabel>Filteraktionen</guilabel> aus und der Filter ist fertig!

source: If that does not work, think of a unique way of identifying the messages you want to filter. The (almost) unique property of my &kde; List messages is that they always contain <quote>kde@kde.org</quote> in the <guilabel>To:</guilabel> or <guilabel>CC:</guilabel> field. It is only almost unique, because this fails for cross-posted messages.
de: Falls das nicht funktioniert, überlegen Sie sich einen eindeutigen Weg zum Identifizieren der Nachrichten, die Sie filtern wollen. Das (beinahe) eindeutige Kennzeichen der Nachrichten aus der &kde;-Liste ist, dass die Felder <guilabel>An:</guilabel> oder <guilabel>Kopie:</guilabel> immer <quote>kde@kde.org</quote> enthalten. Das <quote>beinah</quote> erklärt daraus, dass diese Identifikation bei <quote>cross posted</quote>-Nachrichten versagt.

source: Select <menuchoice><guimenu>Settings</guimenu><guimenuitem>Configure Filters...</guimenuitem></menuchoice>.
de: Man wählt <menuchoice><guimenu>Einstellungen</guimenu><guimenuitem>Filter einrichten ...</guimenuitem></menuchoice>.

source: Press the <guibutton>New</guibutton> button to create an empty filter. It will appear as <guilabel>&lt;unknown&gt;</guilabel>.
de: Wählen Sie <guibutton>Neu</guibutton>, um einen leeren Filter zu erzeugen. Er erscheint als <guilabel>&lt;Unbenannt&gt;</guilabel>.

source: In the <guilabel> Filter Criteria</guilabel> area, select <guilabel>All Recipients</guilabel> from the first drop down box, <guilabel>contains</guilabel> from the second drop down box, and type <userinput>kde@kde.org</userinput> in the text field.
de: Im Bereich <guilabel>Filterbedingungen</guilabel> wählen Sie <guilabel>&lt;Alle Empfänger&gt;</guilabel> aus dem ersten Auswahlfeld und <guilabel>enthält</guilabel> aus dem zweiten Auswahlfeld. In das Textfeld geben Sie <userinput>kde@kde.org</userinput> ein.

source: Skip down to the <guilabel>Filter Actions</guilabel> section. Select <guilabel>Move Into Folder</guilabel> from the first drop down box. Click on the folder icon and a window containing a list of folders will appear. Select the folder that you want the filtered messages to be transferred to. For this example, you would select <guilabel>KDE-General</guilabel>.
de: Wechseln Sie in den Bereich <guilabel>Filteraktionen</guilabel> und wählen Sie <guilabel>In Ordner verschieben</guilabel> aus dem ersten Auswahlfeld. Klicken Sie auf das Ordnersymbol und ein Dialog mit allen vorhandenen Ordnern erscheint. Wählen Sie den Ordner, in den Sie die Nachrichten übertragen möchten, falls sie den Filterkriterien entsprechen. In diesem Beispiel würden Sie den Ordner <guilabel>KDE-General</guilabel>wählen.

source: You may find that you need to use more powerful criteria to properly filter your messages; for example, you may only want to filter the &kde; List messages that are written by your friend <replaceable>Fred Johnson &lt;fj@anywhere.com&gt;</replaceable>. This is where the rest of the matching criteria section comes into play:
de: Vielleicht brauchen Sie kompliziertere Kriterien, um Ihre Nachrichten zu filtern. So könnten Sie z.B. nur Nachrichten aus der &kde;-Benutzerliste speichern wollen, die von Ihrem Freund <replaceable>Martin Mustermann &lt;mm@irgendwo.de&gt;</replaceable> geschrieben wurden. Hier kommen die restlichen Filterkriterien ins Spiel:

source: Extending the filter
de: Den Filter erweitern

source: Open up the <guilabel>Configure Filters...</guilabel> window and select the filter you just created.
de: Öffnen Sie das Fenster <guilabel>Filterregeln</guilabel> und wählen Sie den gerade erstellten Filter aus.

source: Since you want to filter all messages that have <replaceable>kde@kde.org</replaceable> in the <guilabel>To:</guilabel> or <guilabel>CC:</guilabel> field <emphasis>and</emphasis> that are from Fred, check the <guibutton>Match all of the following</guibutton> radio button.
de: Da Sie alle Nachrichten filtern wollen, die <replaceable>kde@kde.org</replaceable> im Feld <guilabel >An:</guilabel> oder <guilabel>Kopie:</guilabel> haben <emphasis>und</emphasis> die von Martin Mustermann sind, wählen Sie den Auswahlknopf <guibutton>Trifft auf alle Folgenden zu</guibutton>.

source: Now, go to the second search rule and select the following from the pull-down menus: <guilabel>From</guilabel>, <guilabel>contains</guilabel>. Now, type <userinput>fj@anywhere.com</userinput> in the text field.
de: Gehen Sie jetzt zum zweiten Filterkriterium und wählen Sie folgendes aus den Auswahllisten aus: <guilabel>From</guilabel> und <guilabel>enthält</guilabel>. Im Eingabefeld geben Sie dann <userinput>mm@irgendwo.com</userinput> ein.

source: You now have a filter that transfers all &kde; List messages that are from <userinput>fj@anywhere.com</userinput>.
de: Sie haben nun einen Filter, der alle Nachrichten von <userinput>Martin.Mustermann@Irgendwo.de</userinput> aus der &kde;-Benutzerliste überträgt.

source: Filter Optimization
de: Filteroptimierung

source: It is important to know that, for example, the order of the filters has an impact on the speed of the filter process. Here are some ideas which can help you to improve the filtering:
de: Die Reihenfolge der Filter hat einen Einfluss auf die Geschwindigkeit des Filtervorganges. Die folgenden Ideen sollen Ihnen dabei helfen, Ihre Filter zu optimieren:

source: Stop filter processing as early as possible:
de: Brechen Sie die Filterverarbeitung so früh wie möglich ab:

source: If you know that a filter finally processes a certain class of messages, please make sure to check the option <guilabel>If this filter matches, stop processing here</guilabel> for the filter. This will avoid the evaluation of the filter rules of all subsequent filters. (See the advanced options in the <link linkend="filter-dialog-id"> Filter Dialog</link>).
de: Wenn Sie wissen, dass ein bestimmter Filter eine bestimmte Klasse von Nachrichten endgültig verarbeitet, dann wählen Sie für diesen Filter die Option <guilabel>Bearbeitung hier abbrechen, falls Filterbedingung zutrifft</guilabel>. Damit werden für die folgenden Filter keine Filterregeln mehr ausgewertet. (Siehe dazu auch die fortgeschrittenen Optionen im <link linkend="filter-dialog-id">Filter-Dialog</link>).

source: An example is filtering messages from mailing lists via List-Id header into separate folders. Having found out that a message came from list A means that you can avoid checking the next filter for messages from list B.
de: Ein Beispiel ist das Filter von Nachrichten von Mailinglisten über List-Id-Vorspannzeilen in separate Ordner. Wenn Sie herausgefunden haben, dass eine Nachricht von der Liste A kam, müssen Sie nicht mehr überprüfen, ob sie von der Liste B kam.

source: Consider the costs of the evaluation of filter rules:
de: Denken Sie an den Preis der Auswertung von Filterregeln:

source: The time required to evaluate a filter rule depends on the way the rule is constructed. In particular, scanning for a substring using the <guilabel>contains</guilabel> operation is faster than a pattern matching using the <guilabel>matches regular expr.</guilabel> operation.
de: Wie lange es dauert, eine Filterregel auszuwerten, hängt davon ab, wie die Regel aufgebaut ist. Insbesondere ist das Suchen nach einem Teiltext mit der <guilabel>enthält</guilabel>-Operation schneller als der Mustervergleich mit der Operation <guilabel>passt auf regulären Ausdruck</guilabel>.

source: Another dependency is on the amount of data which is used for the evaluation of a filter rule. If the rule is based on a message header, its evaluation should normally be much faster than the evaluation of a rule based on the complete message.
de: Die Geschwindigkeit der Auswertung von Filterregeln hängt auch von der Menge von Daten ab, die auszuwerten ist. Eine Regel, die auf einer Vorspannzeile basiert, wird normalerweise sehr viel schneller ausgewertet werden, als eine Regel, die auf dem gesamten Nachrichtentext basiert.

source: You should try to keep the filter rules as simple as possible.
de: Sie sollten Ihre Filterregeln so einfach wie möglich halten.

source: Check the order of your filters:
de: Überprüfen Sie die Reihenfolge Ihrer Filter:

source: All the different filter actions have a different complexity. The most expensive filter actions are <guilabel>Pipe Through</guilabel> and <guilabel>Execute Command</guilabel>, because both need external programs to be run. Placing filters containing these filter actions behind other filters that can reduce the number of times these complex actions are required is useful, if the filter logic does allow this.
de: Die einzelnen Filteraktionen sind unterschiedlich komplex. Die teuersten Filteraktionen sind <guilabel>Durch Programm leiten</guilabel> und <guilabel>Befehl ausführen</guilabel>, weil bei beiden externe Programme ausgeführt werden müssen. Wenn man Filter, die diese Aktionen enthalten, hinter andere Filter stellt, kann man die Ausführung dieser komplexen Aktionen reduzieren; natürlich nur, wenn die Logik des Filters das erlaubt.

source: An example is filtering messages from a mailing list and detecting spam messages. For the spam detection you will usually use an external tool via a <guilabel>Pipe Through</guilabel> action. Filtering the messages for the mailing list is done via the List-Id header. If you do not want to check the messages from the mailing list for spam too, it is better to use the filter for the mailing list messages before the filter for the spam detection. This way you avoid the expensive and slow spam check for all messages which were identified as mailing list messages.
de: Ein Beispiel ist das Filtern von Nachrichten aus einer Mailingliste und das Entdecken unerwünschter Mails (SPAM). Zum Entdecken unerwünschter Mails verwenden Sie normalerweise ein externes Programm über die Aktion <guilabel>Durch Programm leiten</guilabel>. Das Filtern von Nachrichten für die Mailingliste geschieht über den Vorspann List-Id. Wenn Sie die Nachrichten, die von dieser Mailingliste kommen, nicht nach unerwünschten Mails durchsuchen wollen, sollten Sie den Filter für die Mailingliste vor den Filter für unerwünschte Mails setzen. Auf diese Weise können Sie die aufwendige und langsame Überprüfung auf unerwünschte Nachrichten für alle Nachrichten vermeiden, die als von der Mailingliste stammend identifiziert worden sind.

source: Filter Log
de: Filterprotokoll

source: If you want to verify that your filters work as intended, you can open a viewer for the filter log via <menuchoice><guimenu>Tools</guimenu> <guimenuitem>Filter Log Viewer...</guimenuitem></menuchoice>.
de: Wenn Sie sicherstellen wollen, das Ihre Filter wie beabsichtigt arbeiten, können Sie mittels <menuchoice><guimenu>Extras</guimenu> <guimenuitem>Filterprotokoll anzeigen ...</guimenuitem></menuchoice> einen Betrachter für das Filter-Protokoll öffnen.

source: In the viewer, there you can configure the logging of the filter processing. You can control the detail level of the log, clear the log or save the log into a file. The log can provide valuable information if you need to debug your filtering process.
de: Hier können Sie das Protokollieren der Filterverarbeitung konfigurieren. Sie können angeben, wie detailliert protokolliert werden soll, das Protokoll löschen oder es in eine Datei speichern. Das Protokoll kann Ihnen wertvolle Informationen liefern, wenn Sie nach Fehlern in Ihren Filtern suchen.

source: Backing up &kmail;
de: &kmail;-Sicherung

source: This section describes various backup solutions within &kmail;.
de: Dieser Abschnitt beschreibt mehrere Lösungen zur Sicherung Ihrer Daten in &kmail;.

source: Archiving
de: Archivierung

source: <guimenu>Folder</guimenu><guimenuitem>Archive Folder...</guimenuitem>
de: <guimenu>Ordner</guimenu> <guimenuitem>Ordner archivieren ...</guimenuitem>

source: This feature is also available through the context menu launched with a &RMB;, then select <guimenuitem>Archive Folder...</guimenuitem>. This will <action>open a dialog</action> that allows you to create a single archive of the currently selected folder.
de: Diese Funktion ist auch im Kontextmenü der &RMBn; verfügbar. Wählen Sie dann <guimenuitem>Ordner archivieren ...</guimenuitem>. Damit wird <action>ein Dialog geöffnet</action>, in dem Sie ein einzelnes Archiv aus dem aktuell ausgewählten Ordner erstellen können.

source: The <guilabel>Folder:</guilabel> shows the currently selected folder, if you wish to change the folder to be archived click the folder icon. The <guilabel>Format:</guilabel> drop down menu allows you to choose a format (choices are: zip, tar, tar.bz2, and tar.gz). If you would like to change the default name or location, click the folder at the end of <guilabel>Archive File</guilabel>.
de: Im Feld <guilabel>Ordner</guilabel> wird der gerade ausgewählte Ordner angezeigt. Um dies zu ändern, klicken Sie auf das Ordnersymbol und wählen einen Ordner zur Archivierung. Als <guilabel>Format</guilabel> können Sie zip, tar, tar.bz2, und tar.gz für das Archiv benutzen. Möchten Sie den Namen oder Speicherort des Archivs ändern, klicken Sie auf das Ordnersymbol am Ende des Felds <guilabel>Archivdatei</guilabel>.

source: Check the <guilabel>Delete folder and subfolders after completion</guilabel> if you would like everything you archived deleted. By default all subfolders will be archived, uncheck <guilabel>Archive all subfolders</guilabel> if you only want to archive the parent folder.
de: Kreuzen Sie <guilabel>Ordner und Unterordner nach Abschluss löschen</guilabel> an, um die archivierten Ordner zu entfernen. In der Voreinstellung ist <guilabel>Alle Unterordner archivieren</guilabel> aktiviert. Soll nur der oberste Ordner archiviert werden, wählen Sie diese Einstellung ab.

source: <guimenu>Settings</guimenu><guimenuitem>Configure Automatic Archiving...</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>Automatische Archivierung einrichten ...</guimenuitem>

source: This is a powerful tool that can be used to assist in backing up your email. Please see <ulink url="help:/akonadi_archivemail_agent">Automatic Archiving</ulink> for details.
de: Dies ist ein wichtiges Hilfsprogramm, das Sie bei der Sicherung Ihrer E-Mails unterstützen kann. Weitere Informationen dazu im Abschnitt <ulink url="help:/akonadi_archivemail_agent">Automatische Archivierung</ulink>.

source: <guimenu>Settings</guimenu><guimenuitem>Configure Folder Archive Agent...</guimenuitem>
de: <guimenu>Einstellungen</guimenu><guimenuitem>Agent zur Archivierung von Ordnern einrichten ...</guimenuitem>

source: This feature allows you to archive single emails to a specified folder.
de: Mit dieser Funktion können Sie einzelne E-Mails in einen angegebenen Ordner verschieben.

source: Folder Archive can be enabled on a per account basis to allow you to archive individual emails through the right click menu.
de: Die Ordner-Archivierung kann für jeden Zugang getrennt eingerichtet werden, damit Sie einzelne E-Mails mithilfe des Kontextmenü archivieren können.

source: Screenshot of Folder Archive
de: Bildschirmfoto der Ordner-Archivierung

source: Folder Archive is used to archive single emails to a specified folder. For instance, you need to archive all of those pesky bill receipts in one place. Folder Archive can easily accommodate those needs. <action>Start by using <menuchoice><guimenu>Settings</guimenu><guimenuitem>Configure Folder Archive Agent...</guimenuitem></menuchoice> in &kmail;'s reader window to open a dialog to set up the folder archive agent.</action>
de: Mit dem der Ordner-Archivierung können Sie einzelne E-Mails in einen angegebenen Ordner archivieren. Diese Funktion hilft Ihnen, E-Mails mit wenig Aufwand in einen Ordner zu verschieben, wenn dies mit Filtern nicht möglich ist.Verwenden Sie <menuchoice><guimenu>Einstellungen</guimenu><guimenuitem>Agent zur Ordner-Archivierung einrichten ...</guimenuitem></menuchoice> im Hauptfenster von &kmail;, um den Dialog für die Einrichtung der Ordner-Archivierung zu öffnen.
