Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdepim/kmail_configure.po
Languages: de

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Matthias</firstname><surname>Kiefer</surname> <affiliation><address><email>matthias.kiefer@gmx.de</email></address></affiliation> <contrib>Deutsche Übersetzung</contrib></othercredit> <othercredit role="translator"><firstname>Alexander</firstname><surname>Gretencord</surname> <affiliation><address><email>arutha@gmx.de</email></address></affiliation> <contrib>Überarbeitung</contrib></othercredit> <othercredit role="translator"><firstname>Frank</firstname><surname>Schütte</surname> <affiliation><address><email>F.Schuette@t-online.de</email></address></affiliation> <contrib>Überarbeitung ab Version 1.3</contrib></othercredit> <othercredit role="translator"><firstname>Matthias Kalle</firstname><surname>Dalheimer</surname> <affiliation><address><email>kalle@kdab.net</email></address></affiliation> <contrib>Übersetzung der Krypto-Dokumentation</contrib></othercredit>

source: Configure &kmail;
de: &kmail; einstellen

source: General Information
de: Allgemeine Informationen

source: <screeninfo>Configure &kmail; Dialog</screeninfo>
de: <screeninfo>&kmail;-Einrichtungsdialog</screeninfo>

source: <phrase>Configure &kmail; Dialog</phrase>
de: <phrase>&kmail;-Einrichtungsdialog</phrase>

source: <para>Configure &kmail; Dialog</para>
de: <para>&kmail;-Einrichtungsdialog</para>

source: &kmail;'s configuration window enables you to configure &kmail; in many ways. You can reach it via <menuchoice><guimenu>Settings</guimenu><guimenuitem>Configure &kmail;...</guimenuitem></menuchoice>
de: &kmail;'s Einrichtungsdialog ermöglicht eine flexible Einrichtung von &kmail;. Man erreicht ihn über <menuchoice><guimenu>Einstellungen</guimenu><guimenuitem>&kmail; einrichten...</guimenuitem></menuchoice>

source: The dialog has several buttons:
de: Der Dialog hat mehrere Schaltflächen:

source: Help
de: Hilfe

source: This will open this manual at the appropriate page.
de: Öffnet dieses Handbuch auf der entsprechenden Seite.

source: Defaults
de: Voreinstellungen

source: This will reset the configuration options on the current page back to the default values.
de: Setzt die Konfigurationsoptionen auf der aktuellen Seite auf die voreingestellten Werte zurück.

source: Reset
de: Zurücksetzen

source: This resets all changes you have made since you last saved the settings.
de: Setzt alle Änderungen zurück, die Sie seit dem letzten Speichern vorgenommen haben.

source: This saves the settings and closes the configuration dialog.
de: Speichert die Einstellungen und schließt den Konfigurationsdialog.

source: Apply
de: Anwenden

source: This saves the settings without closing the configuration dialog.
de: Speichert die Einstellungen, ohne den Konfigurationsdialog zu schließen.

source: Cancel
de: Abbrechen

source: This closes the configuration dialog without saving the changes you have made.
de: Schließt den Einrichtungsdialog, ohne Ihre Änderungen zu speichern.

source: The configuration pages are divided into six pages, each of them represented by one of the icons in the list on the left hand side of the dialog. The pages will be described in detail below.
de: Der Dialog ist in sechs Seiten aufgeteilt, von denen jede durch eines der Symbole links im Dialog repräsentiert wird. Dieses Kapitel beschreibt detailliert jede der Seiten.

source: Identities Page
de: Identitäten

source: You can find a quick introduction to the <guilabel>Identities</guilabel> page in the <link linkend="getting-started">Getting Started</link> section.
de: Eine kurze Einführung zur Seite <guilabel>Identitäten</guilabel> findet man im Abschnitt <link linkend="getting-started">Erste Schritte</link>.

source: This page allows you to create one or more <emphasis>Identities</emphasis>, &ie; combinations of name, email address and other settings. For example, you can create one identity for business communication and one for personal communication. If you have more than one email address, you can create one identity per address. You will then be able to select an identity on a per-message basis.
de: Diese Seite erlaubt die Einrichtung einer oder mehrerer <emphasis>Identitäten</emphasis>; damit ist eine Kombination von Name, E-Mail-Adresse und anderen Einstellungen gemeint. Typischerweise wird man eine Identität für geschäftliche Korrespondenz (also am Arbeitsplatz) und eine für private Korrespondenz einrichten. Verfügt man über mehr als eine E-Mail-Adresse, kann man eine Identität pro Adresse einrichten. Dadurch ist man in der Lage, eine Identität für jede Nachricht auszuwählen.

source: The page consists of a list of identities and buttons to manage them. The identities list will always show at least one identity, which is then the <guilabel>Default</guilabel> identity.
de: Die Seite besteht aus einer Liste von Identitäten und Knöpfen zu deren Verwaltung. Die Identitätenliste zeigt immer mindestens eine Identität, die <guilabel>Standard</guilabel>-Identität.

source: To add a new identity to the identity list, click on the <guibutton>Add...</guibutton> button.
de: Um eine neue Identität zu der Liste hinzuzufügen, klicken Sie auf <guibutton>Hinzufügen ...</guibutton>.

source: The New Identity Dialog
de: Der Dialog Neue Identität

source: <screeninfo>New Identity Dialog</screeninfo>
de: <screeninfo>Dialog Neue Identität</screeninfo>

source: <phrase>New Identity Dialog</phrase>
de: <phrase>Dialog Neue Identität</phrase>

source: <para>New Identity Dialog</para>
de: <para>Dialog Neue Identität</para>

source: You have to enter the name of the new identity into the <guilabel>New Identity</guilabel> edit field. This will be the name shown in the identity list.
de: Den Namen der neuen Identität wird in das Feld <guilabel>Neue Identität</guilabel> eingetragen. Dieser Name erscheint in der Identitätenliste.

source: You can choose how the new identity should be initialized by checking one of the three radio buttons in the middle of the dialog:
de: Die Grundeinstellungen der neuen Identität kann man über die Auswahlknöpfe in der Mitte des Dialoges bestimmen:

source: With empty fields
de: Mit leeren Feldern

source: All fields of the new identity are cleared or preset with standard values.
de: Alle Felder der neuen Identität werden geleert oder mit Standardwerten vorbelegt.

source: Use System Settings values
de: Werte der Systemeinstellungen benutzen

source: Uses the values from <menuchoice><guimenu>Account Details</guimenu> <guimenuitem>Password &amp; User Account</guimenuitem></menuchoice> in the &systemsettings; category <guilabel>Common Appearance and Behavior</guilabel>.
de: Mit dieser Einstellung werden die Daten aus <menuchoice><guimenu>Benutzerkontodetails</guimenu><guimenuitem>Passwort &amp; Benutzerzugang</guimenuitem></menuchoice> im Abschnitt <guilabel>Allgemeines Erscheinungsbild und Verhalten</guilabel> der &systemsettings; verwendet.

source: Duplicate existing identity
de: Existierende Identität kopieren

source: Copies all fields from an existing identity. You can choose which identity to copy from by selecting the corresponding entry in the <guilabel>Existing identities</guilabel> drop down box.
de: Kopiert alle Feldinhalte von einer existierenden Identität. Man kann die gewünschte Identität im erscheinenden Dialog <guilabel>Existierende Identitäten</guilabel> aus einem Auswahlfeld auswählen.

source: <title>General</title>
de: <title>Allgemein</title>

source: <screeninfo>Identity General</screeninfo>
de: <screeninfo>Identität - Allgemein</screeninfo>

source: <phrase>Identity General</phrase>
de: <phrase>Identität - Allgemein</phrase>

source: <para>Identity General</para>
de: <para>Identität - Allgemein</para>

source: The <guilabel>General</guilabel> tab allows you to specify some basic settings for the currently selected identity.
de: Die Karteikarte <guilabel>Allgemein</guilabel> erlaubt die Festlegung einiger Grundeinstellungen für die ausgewählte Identität.

source: Your name
de: Ihr Name

source: Enter your full name here (sometimes also called <emphasis>display name</emphasis>). Although this field is not strictly mandatory, it is recommended to enter the correct value here.
de: Hier kann der volle Name eingetragen werden. Es ist zwar keine Eingabe erforderlich, dennoch wird empfohlen, hier eine korrekte Eintragung vorzunehmen.

source: Organization
de: Organisation

source: Enter your organization here. This field is optional.
de: Geben Sie hier Ihre Organisation ein. Dieses Feld muss nicht ausgefüllt werden.

source: <guilabel>Email address</guilabel>
de: <guilabel>E-Mail-Adresse</guilabel>

source: Enter your email address here, &ie; something like <userinput>joe@example.com</userinput>.
de: Geben Sie hier Ihre E-Mail-Adresse ein, etwa <userinput>hugo@beispiel.de</userinput>.

source: <title>Email address</title>
de: <title>E-Mail-Adresse</title>

source: So if your address is <replaceable>Joe User &lt;joe@example.com&gt;</replaceable>, you should enter <userinput>Joe User</userinput> into the <guilabel>Your name</guilabel> field and <userinput>joe@example.com</userinput> into the <guilabel>Email address</guilabel> field.
de: Wenn die eigene Adresse <replaceable>Karl Mustermann &lt;karl@mustermann.de&gt;</replaceable> lautet, sollte man <userinput>Karl Mustermann</userinput> im Feld <guilabel>Ihr Name</guilabel> und <userinput>karl@mustermann.de</userinput> im Feld <guilabel>E-Mail-Adresse</guilabel> eintragen.

source: <guilabel>Email aliases</guilabel>
de: <guilabel>E-Mail-Aliase</guilabel>

source: This field contains alias addresses that should also be considered as belonging to this identity (as opposed to representing a different identity).
de: Dieses Feld enthält Aliasadressen, die ebenfalls für diese Identität berücksichtigt werden sollen (im Gegensatz zu Adressen, die zu einer anderen Identität gehören).

source: <title>Email aliases</title>
de: <title>E-Mail-Aliase</title>

source: Primary address: first.last@example.org
de: Primäre Adresse: vorname.nachname@beispiel.de

source: Aliases: first@example.org and last@example.org
de: Aliase: vorname@beispiel.de und nachname@beispiel.de

source: Cryptography
de: Kryptografie

source: <screeninfo>Identity Cryptography</screeninfo>
de: <screeninfo>Identität - Kryptografie</screeninfo>

source: <phrase>Identity Cryptography</phrase>
de: <phrase>Identität - Kryptografie</phrase>

source: <para>Identity Cryptography</para>
de: <para>Identität - Kryptografie</para>

source: The <guilabel>Cryptography</guilabel> tab allows you to specify &openpgp; and &smime; keys associated with this identity, as well as choosing the preferred (cryptographic) message format to use.
de: Auf der Karteikarte <guilabel>Kryptografie</guilabel> können Sie die &openpgp;- und &smime;-Schlüssel konfigurieren, die zu dieser Identität gehören, sowie das bevorzugte (kryptografische) Nachrichtenformat auswählen.

source: OpenPGP signing key
de: OpenPGP-Signaturschlüssel

source: Here you can select the key to be used when &openpgp;-signing messages written with this identity in effect.
de: Hier können Sie den Schlüssel auswählen, der von dieser Identität zum &openpgp;-Signieren von Nachrichten verwendet werden soll.

source: For brevity, only the short key id of selected keys is shown. Hovering with the mouse over the key list will show more information in a tooltip.
de: Aus Platzgründen wird nur die kurze Schlüsselkennung der ausgewählten Schlüssel angezeigt. Wenn Sie die Maus über der Schlüsselliste ruhen lassen, werden weitere Informationen in einer Kurzinfo angezeigt.

source: To clear the label press the <guibutton>Clear</guibutton> button. To change the selected key, press the <guibutton>Change...</guibutton> button. A dialog listing all configured secret &openpgp; keys will be shown allowing you to select the one to use. If you do not have key configured yet, click the <guibutton>Start Certificate Manager</guibutton> to open &kleopatra;. See <ulink url="help:kleopatra">&kleopatra;</ulink> for information on using &kleopatra; to create and manage openpgp keys and certificates. Listed below is a brief description of the chosen key/certificate uses.
de: Um das Feld zu löschen, drücken Sie auf den Knopf <guibutton>Leeren</guibutton>. Möchten Sie einen anderen Schlüssel auswählen, klicken Sie auf <guibutton>Ändern</guibutton>. Dann wird ein Dialog mit allen eingerichteten &openpgp;-Schlüsseln zur Auswahl angezeigt. Ist noch kein Schlüssel eingerichtet und die Liste daher leer, drücken Sie auf <guibutton>Zertifikatsverwaltung starten</guibutton>, um das Programm &kleopatra; zu öffnen. Im <ulink url="help:kleopatra">Handbuch zu &kleopatra;</ulink> finden Sie Informationen, wie Sie &openpgp;-Schlüssel erstellen und verwalten können. Im Folgenden finden Sie eine kurze Beschreibung über die Verwendung der ausgewählten Schlüssel oder Zertifikate.

source: OpenPGP encryption key
de: OpenPGP-Schlüssel zum Verschlüsseln

source: Here you can select the key to &openpgp;-encrypt messages to when this identity and <xref linkend="configure-security-composing-encrypt-to-self"/> are in effect. This key is also used for the <xref linkend="composer-attach-attach-my-public-key"/> function of the <link linkend="the-composer-window">Composer</link>.
de: Hier können Sie den Schlüssel auswählen, mit dem Nachrichten &openpgp;-verschlüsselt werden sollen, wenn diese Identität und <xref linkend="configure-security-composing-encrypt-to-self"/> ausgewählt sind. Dieser Schlüssel wird außerdem für die Funktion <xref linkend="composer-attach-attach-my-public-key"/> im <link linkend="the-composer-window">E-Mail-Editor</link> verwendet.

source: &smime; signing certificate
de: &smime;-Signaturzertifikat

source: Here you can select the certificate to be used when &smime;-signing messages written with this identity in effect.
de: Hier können Sie das Zertifikat auswählen, das von dieser Identität zum &smime;-Signieren von Nachrichten verwendet werden soll.

source: &smime; encryption certificate
de: S/MIME-Verschlüsselungszertifikat

source: Here you can select the certificate to &smime;-encrypt messages when this identity and <xref linkend="configure-security-composing-encrypt-to-self"/> are in effect.
de: Hier können Sie das Zertifikat auswählen, mit dem Nachrichten &smime;-verschlüsselt werden sollen, wenn diese Identität und <xref linkend="configure-security-composing-encrypt-to-self"/> ausgewählt sind.

source: Preferred format
de: Bevorzugtes Format

source: Here you can choose which cryptographic message format to use by default with this identity. You can either select any of the four formats supported by &kmail; or leave the option at the recommended default setting of <guilabel>Any</guilabel>, which will choose a suitable format based on the recipients of the message, or might even go so far as to create two copies of the message, one &smime; signed and/or encrypted, the other &openpgp; signed and/or encrypted.
de: Hier können Sie das kryptografische Nachrichtenformat wählen, das als Voreinstellung mit dieser Identität benutzt wird.Sie können entweder eines der vier von &kmail; unterstützten Formate auswählen, oder die Option in der empfohlenen Voreinstellung <guilabel>Alle</guilabel> belassen, wodurch je nach Nachrichtenempfängern ein passendes Format ausgewählt wird, oder sogar zwei Kopien einer Nachricht erstellt werden, eine mit &smime; signierte und/oder verschlüsselte, und eine mit &openpgp; signierte und/oder verschlüsselte.

source: Advanced
de: Erweiterte Einstellungen

source: <screeninfo>Identity Advanced</screeninfo>
de: <screeninfo>Identität - Erweitert</screeninfo>

source: <phrase>Identity Advanced</phrase>
de: <phrase>Identität - Erweitert</phrase>

source: <para>Identity Advanced</para>
de: <para>Identität - Erweitert</para>

source: The <guilabel>Advanced</guilabel> tab allows you to specify some rarely used or otherwise specialized settings for the currently selected identity.
de: Auf der Karteikarte <guilabel>Erweitert</guilabel> kann man einige selten benötigte Spezialeinstellungen für die ausgewählte Identität ändern.

source: Reply-To address
de: Antwortadresse

source: Enter the address to which replies to your messages should be sent. Only fill out this field if it is different from your normal address (specified using the <guilabel>Name</guilabel> and <guilabel>Email Address</guilabel> on the <link linkend="configure-identity-general"><guilabel>General</guilabel> tab</link>), since replies default to the sender's address anyway.
de: Hier kann man die Adresse angeben, an die Antworten auf E-Mails geschickt werden sollen. Dieses Feld muss nur ausgefüllt werden, wenn sich der Eintrag von der normalen Adresse (die für die Felder <guilabel>Name</guilabel> und <guilabel>E-Mail-Adresse</guilabel> auf der Karteikarte <link linkend="configure-identity-general"><guilabel>Allgemein</guilabel></link> verwendet wurde) unterscheidet, da Antworten standardmäßig immer an die Absenderadresse geschickt werden.

source: This field is only useful if you want replies to your mail to go somewhere else than your regular email address, &eg; if you are using this identity to send messages from an email address that cannot receive messages.
de: Das Feld ist nur sinnvoll, falls die Antworten an eine andere als die normale E-Mail-Adresse gehen sollen, wenn man &eg; die Nachricht von einer Adresse versendet, an der man keine Antworten annehmen kann.

source: Note that some mailing lists overwrite this header field with their post address to make sure that replies go to the list instead of individuals. So the usefulness of this field is very limited and it should only be used in rare cases.
de: Außerdem überschreiben einige schlecht konfigurierte Mailinglisten dieses Feld mit der Listenadresse, um sicher zu stellen, dass Antworten an die Liste gehen. Damit ist der Nutzen dieses Feldes recht eingeschränkt, und es sollte nur in seltenen Fällen benutzt werden.

source: BCC addresses
de: Blindkopie-Adresse

source: Optionally enter addresses separated by a comma to which blind copies of your messages should be sent to. When you compose a message with this identity, the <guilabel>BCC</guilabel> field is filled with these addresses. If you want to send a BCC regardless of this setting, you should look at the <guilabel>Headers</guilabel> tab of the <guilabel>Composer</guilabel> page.
de: Wahlweise können Sie hier durch Kommata getrennte Adressen eingeben, an die Blindkopien Ihrer Nachrichten geschickt werden sollen. Wenn Sie eine E-Mail mit dieser Identität schreiben, werden diese Adressen in das Feld <guilabel>Blindkopie</guilabel> eingetragen. Wenn Sie Blindkopien unabhängig von dieser Einstellung verschicken wollen, dann werfen Sie einen Blick auf die Karteikarte <guilabel>Vorspann</guilabel> der Seite <guilabel>E-Mail-Editor</guilabel>.

source: Dictionary
de: Wörterbuch

source: Select the default dictionary for current identity.
de: Legt das Standard-Wörterbuch für die aktuell ausgewählte Identität fest.

source: Sent-mail folder
de: Ordner für versendete Nachrichten

source: Select the folder into which messages should be filed after sending when using this identity. &imap; users should consider changing this to an &imap; folder, so their sent-mail is stored on a server instead of being stored in a local folder. This way they can access these messages from a different location.
de: Wählen Sie den Ordner aus, in den Nachrichten nach dem Versand mit dieser Identität gestellt werden sollen. &imap;-Benutzer sollten hierfür einen &imap;-Ordner verwenden, damit ihre versendeten Nachrichten auf dem Server anstatt in einem lokalen Ordner gespeichert werden. Auf diese Weise können Sie auf die Nachrichten auch von einem anderen Standort aus zugreifen.

source: You can exercise more fine-grained control over where to file sent messages by creating a corresponding <link linkend="filters">message filter</link> that is applied to outgoing messages.
de: Genauer kann der Ablageort für gesendete Nachrichten mit Hilfe eines <link linkend="filters">Filters</link> für zu versendende Nachrichten festgelegt werden.

source: Drafts folder
de: Ordner für Entwürfe

source: Select the folder into which drafts should be filed when using this identity. &imap; users should consider changing this to an &imap; folder, so their drafts are stored on a server instead of being stored in a local folder. This way they can easily continue to work on their drafts at a different location.
de: Wählen Sie den Ordner aus, in den Entwürfe mit dieser Identität gestellt werden sollen. &imap;-Benutzer sollten hierfür einen &imap;-Ordner verwenden, damit ihre Entwürfe auf dem Server anstatt in einem lokalen Ordner gespeichert werden. Auf diese Weise können Sie auf die Entwürfe auch von einem anderen Standort aus zugreifen.

source: Templates folder
de: Vorlagenordner

source: Select the folder into which templates should be filed when using this identity. Please see <link linkend="new-compose-from-templates">Compose from templates</link> for more information on templates.
de: Wählen Sie den Ordner aus, in den Vorlagen mit dieser Identität gestellt werden sollen. Weiter Informationen finden Sie unter <link linkend="new-compose-from-templates">Nachrichten aus Vorlagen</link>.

source: Outgoing Account
de: Versand-Zugang

source: Select or enter an alternative &SMTP; server to be used when sending messages using this identity.
de: Hier kann man einen eigenen &SMTP;-Server auswählen oder eintragen, der für diese Identität verwendet werden soll.

source: You need to configure outgoing mail servers first, before you can choose them from the list. You can do this on the <link linkend="configure-accounts-sending"><guilabel>Sending</guilabel> tab</link> of the <link linkend="configure-accounts"> <guilabel>Accounts</guilabel> page</link>.
de: Mail-Server für den Versand müssen erst eingerichtet werden, bevor man sie aus der Liste auswählen kann. Diese Einrichtung können Sie auf der Karteikarte <link linkend="configure-accounts-sending"><guilabel>Versand</guilabel></link> der Seite <link linkend="configure-accounts"><guilabel>Zugänge</guilabel></link> durchführen.

source: Templates
de: Vorlagen

source: <screeninfo>Identity Templates</screeninfo>
de: <screeninfo>Identität - Vorlagen</screeninfo>

source: <phrase>Identity Templates</phrase>
de: <phrase>Identität - Vorlagen</phrase>

source: <para>Identity Templates</para>
de: <para>Identität - Vorlagen</para>

source: Here you can create and manage templates to use when composing new messages, replies or forwarded messages.
de: Hier können Sie Nachrichtenvorlagen erstellen und verwalten, die Sie beim Schreiben neuer Nachrichten, beim Antworten oder beim Weiterleiten von Nachrichten verwenden können.

source: The message templates support substitution commands, either simply type them or select them from the <guimenu>Insert Command</guimenu> menu.
de: Die Vorlagen unterstützen das automatische Ersetzen von Platzhaltern; Sie können diese manuell eingeben oder aus dem Menü <guimenu>Platzhalter einfügen</guimenu> wählen.

source: Templates specified here are identity-specific. They override global templates, but can be overridden by per-folder templates if they are specified.
de: Vorlagen, die hier erstellt werden, gelten nur für diese Identität. Sie haben Priorität vor globalen Vorlagen, können aber von Ordner-Vorlagen überschrieben werden, falls solche existieren.

source: Signature
de: Signatur

source: <screeninfo>Identity Signature</screeninfo>
de: <screeninfo>Identität - Signatur</screeninfo>

source: <phrase>Identity Signature</phrase>
de: <phrase>Identität - Signatur</phrase>

source: <para>Identity Signature</para>
de: <para>Identität - Signatur</para>
