Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdepim/kmail_troubleshooting.po
Languages: de

source: Use <keycombo>&Alt;<keycap>F2</keycap></keycombo> or &konsole; to type: <userinput><command>kquitapp kmail</command></userinput>, then wait a minute, then <userinput><command>akonadictl stop</command></userinput>, wait a minute, type <userinput><command>akonadictl start</command></userinput>, wait a minute, type <userinput><command>kmail</command></userinput>. This stops &kmail; (closing <emphasis>all</emphasis> windows), stops the &kmail; backend, starts the &kmail; backend, starts &kmail;. Having a working internet connection increases the chances of success. Sometimes, you can also just do <userinput><command>kquitapp kmail</command></userinput>, wait a minute, and start &kmail; again. Often, a few restarts seem to be needed. It is unclear what is the reason for this, but on bad network connections it is more likely to happen.
de: Benutzen Sie <keycombo>&Alt;<keycap>F2</keycap></keycombo> oder &konsole;, um folgendes einzugeben: <userinput><command>kquitapp kmail</command></userinput>, dann warten Sie eine Minute. Als nächstes geben Sie <userinput><command>akonadictl stop</command></userinput> ein, warten wieder eine Minute, geben <userinput><command>akonadictl start</command></userinput>ein, warten wieder eine Minute und starten dann &kmail; mit <userinput><command>kmail</command></userinput>. Mit diesen Befehlen wird &kmail; einschließlich <emphasis>aller</emphasis> Fenster zusammen mit den &kmail;-Backends angehalten und wieder neu gestartet. Mit einer funktionierenden Internetverbindung erhöht die Chance des Erfolgs. Manchmal reicht auch nur <userinput><command>kquitapp kmail</command></userinput> und der Neustart von &kmail; nach einer Minute. Häufig sind mehrere neue Starts erforderlich. Die Ursache für diese Verhalten ist noch unklar, aber mit ungenügenden Netzwerkverbindungen passiert es häufiger.

source: See also the below item for how <application>akonadiconsole</application> can be helpful.
de: Lesen Sie auch in einem der nächsten Absätze, wie <application>akonadiconsole</application> bei solchen Problemen hilfreich sein kann.

source: Your mails are not being sent, without error messages
de: Ihre E-Mails werden nicht gesendet und Sie erhalten keine Fehlermeldungen

source: If &kmail; does not send mail without saying anything, the <quote>agent</quote> responsible for dispatching the messages can be stuck. Of course, you need to ensure you have proper network connectivity for mail to be sent!
de: Wenn &kmail; keine E-Mails versendet und es keine Fehlermeldung gibt, kann der für das Versenden zuständige <quote>Agent</quote> gestoppt sein. Natürlich benötigen Sie eine funktionierende Netzwerkverbindung, um E-Mails zu versenden.

source: To remedy this, it might help to abort the current action and restart it. First, quit &kmail; by using &krunner; (<keycombo>&Alt;<keycap>F2</keycap></keycombo>) or &konsole; and typing: <userinput><command>kquitapp kmail</command></userinput>. Note that a normal <keycombo>&Alt;<keycap>F4</keycap></keycombo> or <menuchoice><guimenu>File</guimenu><guimenuitem>Quit</guimenuitem></menuchoice> does <emphasis>not</emphasis> do the trick! Wait a minute, then start &kmail; again. Now start <application>akonadiconsole</application> using &krunner; (<keycombo>&Alt;<keycap>F2</keycap></keycombo>) or &konsole;. Go to the <guilabel>Mail Dispatcher Agent</guilabel>, do a right-click and abort the current action. You will most likely get some error messages popping up. Go back to &kmail; and choose <menuchoice><guimenu>File</guimenu><guimenuitem>Send Queued Messages</guimenuitem></menuchoice>. Now it might work. If not, instead of aborting the current action, try toggling the offline/online status of the <guilabel>Mail Dispatcher Agent</guilabel> or restarting things as mentioned in workaround 2 of the problem above this one.
de: Um dies zu beheben, ist es oft nützlich, die aktuell ausgeführte Aktion abzubrechen und wieder neu zu starten. Als erstes beenden Sie &kmail;, indem Sie in &krunner; (<keycombo>&Alt;<keycap>F2</keycap></keycombo>) oder in einer &konsole; den Befehl <userinput><command>kquitapp kmail</command></userinput> eingeben. Beachten Sie, dass das normale Beenden von &kmail; mit <keycombo>&Alt;<keycap>F4</keycap></keycombo> or <menuchoice><guimenu>Datei</guimenu><guimenuitem>Beenden</guimenuitem></menuchoice> <emphasis>nicht</emphasis> ausreichend ist. Warten Sie eine Minute und starten Sie dann &kmail; erneut. Starten Sie jetzt das Programm <application>akonadiconsole</application> mit &krunner; (<keycombo>&Alt;<keycap>F2</keycap></keycombo>) oder in einer &konsole;. Gehen Sie zum <guilabel>Mail Dispatcher Agent</guilabel> und brechen Sie die die aktuelle Version mit dem Kontextmenü der &RMBn; ab. Wahrscheinlich wird eine Fehlermeldung angezeigt. Wechseln Sie zu &kmail; zurück und wählen Sie <menuchoice><guimenu>Datei</guimenu><guimenuitem>Postausgang versenden</guimenuitem></menuchoice>. Nun sollte es funktionieren. Falls nicht, versuchen Sie den Status des <guilabel>Mail Dispatcher Agent</guilabel> Offline/Online zu schalten oder wie in der oben genannten Übergangslösung 2 alles wieder neu zu starten.

source: akonadiconsole can be quite helpful for a number of situations as it shows all the <quote>agents</quote>, the separate components of the &kmail; backend. You can stop and start them, put them in offline mode, abort ongoing actions &etc; It can be very helpful when things get stuck.
de: Das Programm <application>akonadiconsole</application> kann in vielen Situationen sehr hilfreich sein, da es alle <quote>Agenten</quote>, d . h. die einzelnen Komponenten des &kmail;-Backends anzeigt.
