Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdepim/kmail_configure.po
Languages: de

source: The next options are the settings for <guilabel>Default Aggregation</guilabel> and <guilabel>Default Theme</guilabel> which can be overridden using the <guilabel>Folder Properties</guilabel> dialog for each folder individually.
de: Als nächstes folgen die Einstellungen für <guilabel>Standard-Zusammenstellung</guilabel> und <guilabel>Standard-Design</guilabel>. Diese Voreinstellungen können für jeden einzelnen Ordner im Dialog <guilabel>Ordner-Eigenschaften</guilabel> überschrieben werden.

source: Using the <guibutton>Configure</guibutton> button opens a window to customize the default aggregation or theme to your needs and allows you to add your own.
de: Mit dem Knopf <guibutton>Einrichten ...</guibutton> öffnen Sie einen Dialog, um die Standardeinstellungen für Zusammenstellung und Design der Nachrichtenliste an Ihre Wünsche anzupassen und neue Voreinstellungen zu definieren.

source: Available aggregations and themes:
de: Verfügbare Zusammenstellungen und -Designs:

source: Default aggregation
de: Standard-Zusammenstellung

source: Senders/Receivers, Flat
de: Absender/Empfänger, flach

source: This view groups the messages by senders or receivers (depending on the folder type). Messages are not threaded.
de: Diese Ansicht zeigt Nachrichten gruppiert nach Absender bzw. Empfänger an (abhängig vom Ordnertyp). Die enthaltenen Nachrichten werden nicht gruppiert.

source: Activity by Date, Flat
de: Aktivität nach Datum, flach

source: This view uses day-by-day groups. Messages are not threaded. So for example, in <quote>Today</quote> you will simply find all the messages arrived today.
de: Diese Ansicht verwendet tagesbezogene Datumsbereiche. Die Nachrichten werden flach angezeigt. Beispiel: Im Datumsbereich <quote>Heute</quote> finden Sie alle Nachrichten, die am heutigen Tag angekommen sind.

source: Activity by Date, Threaded
de: Aktivität nach Datum, gruppiert

source: This view uses day-by-day groups. Messages are threaded. So for example, in <quote>Today</quote> you will find all the messages arrived today and all the threads.
de: Diese Ansicht verwendet tagesbezogene Datumsbereiche; die Nachrichten werden gruppiert angezeigt. Beispiel: Im Datumsbereich <quote>Heute</quote> finden Sie alle Nachrichten, die am heutigen Tag angekommen sind, sowie alle Gruppen, in denen heute eine Nachricht eingegangen ist.

source: Current Activity, Flat
de: Aktuelle Aktivität, flach

source: This view uses smart date range groups. Messages are not threaded. So for example, in <quote>Today</quote> you will simply find all the messages arrived today.
de: Diese Ansicht verwendet intelligente Datumsbereiche. Die Nachrichten werden flach angezeigt. Beispiel: Im Datumsbereich <quote>Heute</quote> finden Sie alle Nachrichten, die am heutigen Tag angekommen sind.

source: Current Activity, Threaded
de: Aktuelle Aktivität, gruppiert

source: This view uses smart date range groups. Messages are threaded. So for example, in <quote>Today</quote> you will find all the messages arrived today and all the threads that have been active today.
de: Diese Ansicht verwendet intelligente Datumsbereiche; die Nachrichten werden gruppiert angezeigt. Beispiel: Im Datumsbereich <quote>Heute</quote> finden Sie alle Nachrichten, die am heutigen Tag angekommen sind, sowie alle Gruppen, in denen heute eine Nachricht eingegangen ist.

source: Thread Starters
de: Diskussionsleiter

source: This view groups the messages in threads and then groups the threads by the starting user.
de: Diese Ansicht fasst Nachrichten in Diskussionsgruppen zusammen und gruppiert diese wiederum nach dem Diskussionsleiter.

source: Flat Date View
de: Flache Datumsansicht

source: This is a plain and old list of messages sorted by date: no groups and no threading.
de: Dies ist eine einfache, altbekannte Nachrichtenliste, nach Datum sortiert: keine Datumsbereiche und keine Gruppierung.

source: Standard Mailing List
de: Standard-Nachrichtenliste

source: This is a plain and old mailing list view: no groups and heavy threading.
de: Dies ist eine einfache, flache Nachrichtenliste: keine Datumsbereiche und starke Gruppierung.

source: Customize...
de: Einrichten ...

source: <screeninfo>Customize Message Aggregation Modes</screeninfo>
de: <screeninfo>Nachrichten-Zusammenstellung anpassen</screeninfo>

source: <phrase>Customize Message Aggregation Modes</phrase>
de: <phrase>Nachrichten-Zusammenstellung anpassen</phrase>

source: <para>Customize Message Aggregation Modes</para>
de: <para>Nachrichten-Zusammenstellung anpassen</para>

source: To create a custom aggregation theme, click the <guibutton>Configure...</guibutton> button. Select an existing aggregation similar to what you want to change it to and click the <guibutton>Clone Aggregation</guibutton>, if none are similar click the <guibutton>New Aggregation</guibutton> button. The <guilabel>General</guilabel> tab allows you to change the <guilabel>Name:</guilabel> and <guilabel>Description:</guilabel>. The <guilabel>Groups &amp; Threading</guilabel> tab allows you to configure several elements to customize your aggregation.
de: Um eine eigene Zusammenstellung zu erstellen, klicken Sie auf den Knopf <guibutton>Einrichten</guibutton>. Wählen Sie eine geeignete vorhandene Sammlung als Ausgangsbasis und klicken Sie auf <guibutton>Zusammenstellung kopieren</guibutton>. Finden Sie keine passende Zusammenstellung, klicken Sie auf <guibutton>Neue Zusammenstellung</guibutton>. Auf der Karteikarte <guilabel>Allgemein</guilabel> können Sie einen <guilabel>Namen</guilabel> und eine <guilabel>Beschreibung</guilabel> eingeben oder ändern. Auf der Karteikarte <guilabel>Gruppierung und Zusammenstellung</guilabel> finden Sie mehrere Einstellungen zur Anpassung Ihrer Zusammenstellung.

source: <guilabel>Grouping:</guilabel> Allows you to select from dates, sender/receiver or none. With the smart options &kmail; will group related emails together.
de: <guilabel>Gruppierung</guilabel> Erlaubt die Auswahl von Datum, Absender, Empfänger oder keine Gruppierung. Mit den intelligenten Einstellungen werden zusammengehörige E-Mails in &kmail; zusammengestellt.

source: <guilabel>Group expand policy:</guilabel> Allows you to set whether &kmail; will automatically expand grouped emails.
de: <guilabel>Aufklapprichtlinie für Gruppen</guilabel> Hier können Sie einstellen, ob Gruppen in &kmail; automatisch aufgeklappt werden.

source: <guilabel>Threading:</guilabel> Allows you to change if &kmail; will include references and subject in determining perfect threading. You can also turn off threading all together.
de: <guilabel>Diskussions-Gruppierung</guilabel> Stellen Sie ein, ob in &kmail; Referenzen und Betreff bei der Gruppierung berücksichtigt werden, die Gruppierung kann auch vollständig abgeschaltet werden.

source: <guilabel>Thread leader:</guilabel> Allows you to change the leader of the thread between most recent message or topmost.
de: <guilabel>Diskussions-Beginn</guilabel> Hier können Sie als Beginn der Diskussion die neueste oder oberste Nachricht auswählen.

source: <guilabel>Thread expand policy:</guilabel> Allows you to change how &kmail; determines whether a thread should be expanded or no expanding at all.
de: <guilabel>Diskussions-Aufklapp-Richtlinie</guilabel> Stellen Sie hier ein, nach welchen Kriterien Gruppen aufgeklappt werden sollen.

source: The <guilabel>Advanced</guilabel> allows you to change the <guilabel>Fill view strategy:</guilabel> You would choose Favor speed if you have a slow connection. Interactivity will show all of your current conversations first. And Batch mode will not sort the view at all.
de: Auf der Karteikarte <guilabel>Erweitert</guilabel> können Sie die <guilabel>Füllstrategie</guilabel> ändern. Sie sollten Geschwindigkeit bevorzugen, wenn Sie eine langsame Verbindung haben. Interaktivität zeigt zuerst Ihre aktuellen Gespräche und im Stapelverarbeitungsmodus wird die Ansicht überhaupt nicht sortiert.

source: Default Theme
de: Standarddesign

source: Classic
de: Klassisch

source: A simple, backward compatible, single row theme
de: Ein einfaches, rückwärts-kompatibles Design, welches nur eine Zeile verwendet.

source: Smart
de: Dekorativ

source: A smart multi-line and multi-item theme
de: Ein dekoratives Design, welches mehrere Zeilen und Objekte verwendet.

source: Smart with Clickable Status
de: Dekorativ mit anklickbarem Status

source: A smart multi-line and multi-item theme with a clickable status column
de: Ein dekoratives Design, welches mehrere Zeilen und Objekte verwendet und anklickbare Status-Symbole enthält.

source: Configure...
de: Einrichten ...

source: <screeninfo>Customize Message List Theme</screeninfo>
de: <screeninfo>Design der Nachrichtenliste anpassen</screeninfo>

source: <phrase>Customize Message List Theme</phrase>
de: <phrase>Design der Nachrichtenliste anpassen</phrase>

source: <para>Customize Message List Theme</para>
de: <para>Design der Nachrichtenliste anpassen</para>

source: To create a custom message list theme, click the <guibutton>Configure...</guibutton> button. Select an existing theme similar to what you want to change it to and click the <guibutton>Clone Theme</guibutton>, if none are similar click the <guibutton>New Theme</guibutton> button. The <guilabel> General</guilabel> tab allows you to change the <guilabel>Name:</guilabel> and <guilabel>Description:</guilabel>.
de: Um ein eigenes Design für die Nachrichtenliste zu erstellen, klicken Sie auf den Knopf <guibutton>Einrichten</guibutton>. Wählen Sie ein geeignetes vorhandenes Design als Ausgangsbasis und klicken Sie auf <guibutton>Design kopieren</guibutton>. Finden Sie kein passendes Design, klicken Sie auf <guibutton>Neues Design</guibutton>. Auf der Karteikarte <guilabel>Allgemein</guilabel> können Sie einen <guilabel>Namen</guilabel> und eine <guilabel>Beschreibung</guilabel> eingeben oder ändern.

source: The <guilabel>Appearance</guilabel> tab allows you to configure visible columns and status items. To add a column, right click the column bar and select <guilabel>Add Column</guilabel>. Name the column and select what the column will represent from the <guilabel>Header click sorts messages:</guilabel> drop down list. By default <guilabel>Visible by default</guilabel> is checked, uncheck it if you only want the column to be available on the &RMB; add or remove menu for the clickable sort bar. Then drag the appropriate label from the <guilabel>Content Items</guilabel> to the column view box under the column bar, &eg; if you chose to add a size column you would drag the Size label to underneath the Size column. Continue to do this until you have all the columns you desire. You can change the font and color of column items through the view area &RMB; menu. Move, delete and resize columns through the &RMB; menu of the column bar.
de: Auf der Karteikarte <guilabel>Erscheinungsbild</guilabel> können Sie die angezeigten Spalten und Statussymbole auswählen und einrichten. Um eine Spalte hinzuzufügen, klicken Sie mit der &RMBn; auf die Zeile mit den Spaltentiteln und wählen <guilabel>Spalte hinzufügen</guilabel> aus dem Kontextmenü. Geben Sie einen Namen an und wählen im Auswahlfeld <guilabel>Ein Klick auf die Spaltenüberschrift sortiert die Nachrichten</guilabel>, wie die Spalte durch Klicken sortiert werden soll. <guilabel>In der Voreinstellung sichtbar</guilabel> ist für neue Spalten immer aktiviert. Deaktivieren Sie diese Einstellung, wenn Sie die Anzeige im Kontextmenü der Titelleiste der Nachrichtenliste nach Bedarf einschalten möchten. Ziehen Sie dann ein passendes Symbol aus dem Bereich <guilabel>Inhalts-Elemente</guilabel> in das Anzeigefeld der Spalte darunter. Schrift und Farbe von Elementen in der Spalte ändern Sie mit dem Kontextmenü in diesem Bereich. Um Spalten zu verschieben, zu löschen oder deren Größe zu ändern, benutzen Sie das Kontextmenü der Spaltenleiste.

source: The <guilabel>Advanced</guilabel> tab allows you to change whether to show headers. You can also change the size of status icons.
de: Auf der Karteikarte <guilabel>Erweitert</guilabel> können Sie einstellen, ob der Vorspann angezeigt wird. Hier kann auch die Größe der Symbole eingestellt werden.

source: In the <guilabel>Date Display</guilabel> section you can choose between several date formats. The <guilabel>Localized Format</guilabel> is the one you can specify under <guilabel>Country/Region &amp; Language</guilabel> in the &systemsettings;. <guilabel>Smart format</guilabel> will show today, yesterday &etc; The <guilabel>Custom</guilabel> format you can get a description of the possible values by clicking on <guilabel>Custom format information</guilabel> option.
de: Im Abschnitt <guilabel>Datumsanzeige</guilabel> kann man zwischen verschiedenen Datumsformaten auswählen. Das <guilabel>Regionale Format</guilabel> ist das in den &systemsettings; unter <guilabel>Land/Region &amp; Sprache</guilabel> in eingestellte Format. Das <guilabel>Intelligente Format</guilabel> zeigt Heute, Gestern und die Wochentage der letzten Woche &etc; an. Für das <guilabel>Benutzerdefinierte Format</guilabel> erhalten Sie eine Beschreibung der möglichen Werte, indem Sie auf <guilabel>Hilfe zum benutzerdefinierten Format</guilabel> klicken.

source: Message Window
de: Nachrichtenfenster

source: If the <guilabel>Close message window after replying or forwarding</guilabel> option is activated, &kmail; will close the message window after replying to or forwarding the message that is displayed in the window. This only applies to the separate message window, not to the embedded message preview pane.
de: Wenn die Einstellung <guilabel>Nachrichtenfenster nach dem Antworten oder Weiterleiten schließen</guilabel>aktiv ist, wird das Fenster sofort nach diesen Aktionen geschlossen. Diese Einstellung betrifft nur getrennte Nachrichtenfenster, nicht die Nachrichtenvorschau.

source: By default, <guilabel>Enable access key</guilabel> is enabled. Access keys allow you to use the keyboard keys for functions which would perhaps normally be done with the mouse, such as following links. For more information on access keys please see <ulink url="http://docs.kde.org/stable/en/applications/konqueror/accesskeys.html">Access keys</ulink>.
de: In der Voreinstellung ist <guilabel>Zugriffstasten aktivieren</guilabel> eingeschaltet. Mit dieser Einstellung können Sie die Tastatur für Funktionen benutzen, die normalerweise mit der Maus ausgeführt werden, wie zum Beispiel dem Folgen von Verknüpfungen. Weitere Informationen dazu finden Sie im Kapitel <ulink url="help:konqueror/index.html#accesskeys">Zugriffstasten</ulink> des &konqueror;-Handbuchs.

source: <guilabel>Show HTML status bar</guilabel> activates a bar at the left side of the reader pane that tells you if a message is &html; or not. This is important because &html; messages might imitate the look of a signed and encrypted message, so you should be aware of the fact that you are reading an &html; message. The &html; status bar itself cannot be influenced by the &html; code of the message.
de: <guilabel>HTML-Statusleiste anzeigen</guilabel> aktiviert eine Leiste an der linken Seite des Nachrichtenbereichs, die anzeigt, ob es sich um eine &html;-Nachricht handelt. Das kann wichtig sein, da eine &html;-Nachricht das Aussehen einer signierten oder verschlüsselten Nachricht imitieren kann, weswegen Sie sich darüber im Klaren sein sollten, dass Sie eine &html;-Nachricht lesen. Die &html;-Statusleiste kann dagegen von einer &html;-Nachricht nicht beeinflusst werden.

source: Enable <guilabel>Replace smileys by emoticons</guilabel> if you want smileys like <userinput>:-)</userinput> appearing in the message text to be replaced by emoticons (small pictures) such as <inlinemediaobject><imageobject> <imagedata fileref="smile.png" format="PNG"/></imageobject> </inlinemediaobject>.
de: Aktivieren Sie <guilabel>Smileys durch Emoticons ersetzen</guilabel>, damit Smileys wie <userinput>:-)</userinput> im Nachrichtentext durch Emoticons (kleine Bilder) wie <inlinemediaobject><imageobject> <imagedata fileref="smile.png" format="PNG"/></imageobject> </inlinemediaobject>ersetzt werden.

source: Enable <guilabel>Reduce font size for quoted text</guilabel> to show quoted text with a smaller font.
de: Wenn <guilabel>Schriftgröße bei Zitaten verkleinern</guilabel> aktiviert ist, wird zitierter Text kleiner angezeigt.

source: Enable <guilabel>Show expand/collapse quote marks</guilabel> to show different levels of quoted text. Disable to hide the levels of quoted text.
de: Schalten Sie <guilabel>Beim Zitieren Markierungen zum Ein-/Ausblenden anzeigen</guilabel> ein, um Zitate verschiedener Ebenen gestaffelt anzuzeigen. Wenn Sie diese Option ausschalten, werden die verschiedenen Ebenen ohne Unterschied dargestellt.

source: <guilabel>Fallback character encoding</guilabel>: Some emails, especially those generated automatically, do not specify the character encoding which needs to be used to properly display them. In such cases a fallback character encoding will be used, which you can configure here. Set it to the character encoding most commonly used in your part of the world. As a default the encoding configured for the whole system is used.
de: <guilabel>Bei fehlendem Zeichensatz diesen verwenden</guilabel>: In einigen E-Mails, insbesondere automatisch erzeugten, können Informationen zur verwendeten Kodierung fehlen. Diese ist aber zur korrekten Darstellung erforderlich. In diesen Fällen wird eine Standardkodierung verwendet, die hier eingestellt werden kann. Verwenden Sie die Kodierung, die in Ihrer Region am häufigsten verwendet wird. Standardmäßig wird die für das Gesamtsystem verwendete Kodierung verwendet.

source: <guilabel>Override character encoding</guilabel>: Changing this from its default <guilabel>Auto</guilabel> will force the use of the specified encoding for all emails, regardless of what they specify themselves.
de: <guilabel>Original-Kodierung übergehen und diese verwenden</guilabel>: Wenn Sie die Einstellung <guilabel>Automatisch</guilabel> nicht verwenden, wird die eingestellte Kodierung auch dann für alle E-Mails verwendet, wenn E-Mails andere Vorgaben enthalten.

source: <guilabel>Minimum font size:</guilabel> This option allows you to set the smallest size a font will show as. This can be helpful if you have a hard time reading really small fonts.
de: <guilabel>Minimale Schriftgröße</guilabel>: Damit wird die kleinste angezeigte Schrift festgelegt, besonders sinnvoll, wenn Sie sehr kleine Schriften schwer lesen können.

source: To customize which headers you would like to view in the message window (&eg; subject, from, to, cc, bcc, date), click the <guibutton>Configure Custom Headers</guibutton> button next to <guilabel>Headers:</guilabel>. Add your selection in the dialog that pops up. If you are using fancy headers, you can enable <guilabel>Show spam status in fancy headers</guilabel> here. Please note that if your email provider does not provide <application>Spamassassin</application> services to check your email for spam, you will need to install it on your computer. &eg; through a package manager (Yast on &SuSE;, &ubuntu; Software Center on &ubuntu; &etc;). For more information see: <link linkend="the-anti-spam-wizard">Anti-Spam Wizard</link> to set up spamassassin with &kmail;.
de: Um einzustellen, welche Vorspannfelder (&eg; subject, from, to, cc, bcc, date) im Nachrichtenfenster angezeigt werden sollen, klicken Sie auf den Knopf <guibutton>Benutzerdefinierten Vorspann einrichten</guibutton>. Ändern Sie dann die anzuzeigenden Felder im nächsten Dialog. Benutzen Sie den dekorativen Vorspann, können Sie hier auch die Anzeige des Spam-Status aktivieren. Wenn Ihr E-Mail-Anbieter keinen <application>Spamassassin</application>-Dienst zur Überprüfung auf Spam anbietet, müssen Sie diesen Dienst lokal auf dem Rechner installieren, &eg; mit einem Paketverwaltungsprogramm (Yast für &SuSE;, &ubuntu; Software Center für &ubuntu; &etc;). Weitere Information zur Einrichtung von <application>Spamassassin</application> finden Sie im Abschnitt <link linkend="the-anti-spam-wizard">Anti-Spam-Assistent</link>.

source: System Tray
de: Systemabschnitt der Kontrollleiste

source: If you enable the system tray icon then a small &kmail; icon with the number of unread messages will be shown in the system tray. You can enable &kmail;'s system tray icon with <guilabel>Enable system tray icon</guilabel>, and with <guilabel>System Tray Mode</guilabel> you can specify whether the tray icon should always be shown or only if you have unread messages.
de: Wenn Sie die Anzeige im Systemabschnitt der Kontrollleiste einschalten, dann zeigt &kmail; ein kleines Symbol mit der Anzahl ungelesener Nachrichten dort an. Sie können das Symbol mit <guilabel>Anzeige im Systemabschnitt der Kontrollleiste</guilabel> einschalten und mit dem <guilabel>Kontrollleistenmodus</guilabel> auswählen, ob das Symbol immer oder nur bei Vorhandensein ungelesener Nachrichten angezeigt werden soll.

source: If the icon is visible then you can hide &kmail;'s main window by clicking on the icon or by clicking on the window close button. By clicking on the icon you can make &kmail;'s main window visible again. If you click on the icon with the <mousebutton>right</mousebutton> mousebutton then you get a menu with a few useful commands. You can check for new mail, create a new message or quit &kmail;. Additionally, there is the entry <guilabel>New Messages In</guilabel> which lists all folders containing unread messages. If you choose one of those folders then this folder will be selected in &kmail;'s main window.
de: Wenn das Symbol sichtbar ist, dann können Sie das Hauptfenster von &kmail; ausblenden, indem Sie auf das Symbol oder den Knopf „Schließen“ des Fensters klicken. Durch Anklicken des Symbols können Sie das Hauptfenster von &kmail; wieder anzeigen. Wenn Sie mit der rechten Maustaste auf das Symbol klicken, dann bekommen Sie ein Menü mit einigen nützlichen Befehlen. Sie können nach neuen Nachrichten schauen, eine neue Nachricht schreiben, oder &kmail; beenden. Außerdem gibt es den Eintrag <guilabel>Neue Nachrichten in</guilabel>, der alle Ordner anzeigt, in denen sich ungelesene Nachrichten befinden. Wenn Sie einen dieser Ordner auswählen, dann wird dieser Ordner im Hauptfenster von &kmail; ausgewählt.

source: Composer Page
de: E-Mail-Editor

source: Automatically insert signature
de: Signatur automatisch einfügen

source: If checked, your signature as defined in the <link linkend="configure-identity-signature">identity page</link> is automatically included at the end of all messages you create (&ie; new messages, replies, &etc;).
de: Wenn diese Option angewählt ist, dann wird Ihre auf der Seite <link linkend="configure-identity-signature">Identitäten</link> eingestellt Signatur automatisch an alle von Ihnen geschriebenen Nachrichten (neue Nachrichten, Antworten &etc;) angehängt.

source: Use smart quoting
de: Intelligent zitieren

source: If checked, &kmail; will break long lines but will try to keep the correct quoting (&eg; the <quote>&gt; </quote> will always be at the start of the line).
de: Bei Aktivierung von <guilabel>Intelligent zitieren</guilabel> wird versucht, umgebrochene lange Zeilen dennoch korrekt zu zitieren (nämlich das Zeichen <quote>&gt;</quote> am Zeilenanfang einzufügen).

source: Only quote selected text when replying
de: Beim Antworten nur ausgewählten Text zitieren
