Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdepim/kmail_using-kmail.po
Languages: de

source: This dialog will have a tab for each of your configured accounts including Local Folders and you will need to configure all accounts that you wish to use this feature with. The first option allows you to enable/disable the folder archive agent. It is disabled by default, to enable check the <guilabel>Enable</guilabel> checkbox. You can set the location of your Archive folder by clicking the folder icon next to <guilabel>Folder:</guilabel> and selecting the folder you wish to use. For example, you could create a folder called <quote>bill receipts</quote> by clicking the <guibutton>New Subfolder...</guibutton> and typing <userinput>bill receipts</userinput> in the dialog. You may choose a folder location anywhere, &eg;.. a folder in your <quote>Local Folders</quote> or on your &imap; server.
de: In diesem Dialog werden Karteikarten mit allen eingerichteten Postfächern einschließlich der lokalen Ordner angezeigt. Auf jeder einzelnen Karteikarte können Sie diese Funktion für ein Postfach einrichten. Als erstes müssen Sie den Archiv-Agenten aktivieren bzw. deaktivieren. In der Voreinstellung ist diese Funktion abgeschaltet. Den Speicherort Ihres Archivs können Sie festlegen, indem Sie auf das Ordnersymbol rechts neben dem Feld <guilabel>Ordner</guilabel> klicken und dann eine Auswahl treffen oder durch Klicken auf <guibutton>Neuer Unterordner</guibutton> einen neuen Ordner für die Archivierung erstellen. Sie können einen beliebigen Ort wie &eg; einen Ordner in <quote>Lokale Ordner</quote> oder auf Ihrem &imap;-Server verwenden.

source: You have several choices on how the emails will be archived:
de: Es gibt mehrere Auswahlmöglichkeiten, wie die E-Mails archiviert werden können:

source: Unique folder
de: Eindeutiger Ordner

source: Uses the selected folder sorted by date.
de: Verwendet die ausgewählten Ordner sortiert nach Datum.

source: Folder by months
de: Ordner nach Monaten

source: Creates new folders inside the selected folder by months.
de: Erstellt neue Ordner innerhalb des ausgewählten Ordners sortiert nach Monat.

source: Folder by years
de: Ordner nach Jahren

source: Creates new folders inside the selected folder by years.
de: Erstellt neue Ordner innerhalb des ausgewählten Ordners sortiert nach Jahr.

source: Now when you receive a bill receipt, &RMB; the email and select <guimenuitem>Archive</guimenuitem> from the menu. The email will be archived into your configured archive folder for easy viewing later on.
de: Wenn Sie jetzt eine E-Mail erhalten, klicken Sie mit der &RMBn; darauf und wählen <guimenuitem>Archivieren</guimenuitem> aus dem Kontextmenü. Dann wird diese E-Mail in den festgelegten Ordner verschoben, in dem Sie sie dann später lesen können.

source: Exporting
de: Export

source: <guimenu>Tools</guimenu><guimenuitem>Export &kmail; Data...</guimenuitem>
de: <guimenu>Extras</guimenu><guimenuitem>&kmail;-Daten exportieren ...</guimenuitem>

source: This feature exports settings and local mail to a compressed file. Please see <ulink url="help:/pimsettingexporter">pimsettingexporter</ulink> for details.
de: Mit dieser Funktion können Sie Einstellungen und lokale E-Mails in eine komprimierte Datei exportieren. Weitere Informationen dazu im Abschnitt <ulink url="help:/pimsettingexporter">PIM-Einstellungs-Export</ulink>.

source: Restore and Import in &kmail;
de: Wiederherstellen und Import in &kmail;

source: This section describes restoring backups and importing in &kmail;
de: Dieser Abschnitt beschreibt die Wiederherstellung von Sicherungen und den Import in &kmail;.

source: Restoring backed up email and settings
de: Wiederherstellung von gesicherten E-Mails und Einstellungen

source: If you used PIM Setting Exporter to backup local email and or settings, please use it again to import back into &kmail;. See <ulink url="help:/pimsettingexporter">pimsettingexporter</ulink> for details.
de: Haben Sie das Programm PIM-Einstellungs-Export benutzt, um lokale E-Mails oder Einstellungen zu sichern, verwenden Sie dies Programm auch dazu, diese Daten wieder zurück in &kmail; zu importieren. Weitere Informationen dazu im Abschnitt <ulink url="help:/pimsettingexporter">PIM-Einstellungs-Export</ulink>.

source: Importing options in &kmail;
de: Importeinstellungen für &kmail;

source: <guimenu>Tools</guimenu> <guimenuitem>Import Wizard...</guimenuitem>
de: <guimenu>Extras</guimenu> <guimenuitem>Import-Assistent ...</guimenuitem>

source: &kmail; has an import wizard to make the transition from another email application extremely easy. Please see <ulink url="help:/importwizard">Import Wizard</ulink> for details.
de: &kmail; stellt einen Import-Assistenten zur Verfügung, der den Wechsel von anderen E-Mail-Programmen sehr leicht macht. Weitere Informationen dazu im Abschnitt <ulink url="help:/importwizard">Import-Assistent</ulink>.

source: <guimenu>File</guimenu><guimenuitem>Import Messages...</guimenuitem>
de: <guimenu>Datei</guimenu> <guimenuitem>Nachrichten importieren ...</guimenuitem>

source: &kmail; can easily import several file formats from the following applications with the <application>KMailCVT</application> tool found in :
de: Mit <application>KMailCVT</application> können Sie mehrere Dateiformate folgender Programme einfach importieren:

source: Plain Text
de: Einfacher Text

source: Please see the <application>KMailCVT</application> documentation at <ulink url="help:kmailcvt">KMailCVT</ulink>.
de: Weitere Informationen finden Sie in der Dokumentation zu <ulink url="help:kmailcvt">KMailCVT</ulink>.

source: Using Multiple Accounts
de: Mehrere Postfächer verwenden

source: Multiple accounts are used to check for messages from more than one email address and/or mail server. Select <menuchoice><guimenu>Settings</guimenu> <guimenuitem>Configure &kmail;...</guimenuitem></menuchoice> and click on the <guilabel>Accounts</guilabel> page to add or change your account settings. See the <link linkend="getting-started">Getting started</link> section for more information on the settings in the <guilabel>Accounts</guilabel> page.
de: Wenn Sie E-Mail von mehreren E-Mail-Adressen und/oder Mailservern bekommen, müssen Sie weitere Postfächer anlegen. Wählen Sie <menuchoice><guimenu>Einstellungen</guimenu><guimenuitem>&kmail; einrichten ...</guimenuitem></menuchoice> und benutzen Sie die Seite <guilabel>Zugänge</guilabel>, um Postfächer hinzuzufügen oder zu ändern. Für Details zu den Einstellungen auf der Seite <guilabel>Zugänge</guilabel> schauen Sie bitte im Kapitel <link linkend="getting-started">Erste Schritte</link> nach.

source: To check for messages from a particular account, use the <menuchoice><guimenu>File</guimenu><guimenuitem>Check Mail In</guimenuitem></menuchoice> submenu to select the account to check for mail. You can also press the mouse button on the <guiicon>Check Mail</guiicon> icon for some time to get a list of accounts.
de: Um neue Nachrichten für ein bestimmtes Postfach abzurufen, wählt man das Untermenü <menuchoice><guimenu>Datei</guimenu><guimenuitem>Nach E-Mail sehen in</guimenuitem></menuchoice> und wählt dort das gewünschte Postfach aus. Man kann auch die linke Maustaste auf dem Symbol <guiicon>Nachrichten abrufen</guiicon> für einige Zeit gedrückt halten, um eine Liste der Postfächer zu erhalten.

source: Signing and Encrypting Messages with <application>GnuPG</application>
de: Signierung und Verschlüsselung von Nachrichten mit Hilfe von <application>GnuPG</application>

source: This is a short introduction on how to setup &kmail;'s <application>GnuPG</application> (<application>&GNU; Privacy Guard</application>) support; it gives some hints on the use of <application>GnuPG</application> too. It is written for people who are beginners in this area; if you are familiar with the use of <application>GnuPG</application>, you can skip most of the steps.
de: Dies ist eine kurze Einleitung zur Einrichtung von &kmail;'s <application>GnuPG</application>-Unterstützung (<application>&GNU; Privacy Guard</application>). Es sind außerdem einige Hinweise zur Verwendung von <application>GnuPG</application> enthalten. Der Abschnitt ist für Anfänger geschrieben. Wenn Sie mit der Bedienung von <application>GnuPG</application> vertraut sind, können Sie die meisten Schritte überspringen.

source: Please also check out the <link linkend="pgp-faq">&FAQ; item about <application>GnuPG</application></link>.
de: Weitere Informationen finden Sie außerdem im <link linkend="pgp-faq">&FAQ;-Eintrag zu <application>GnuPG</application></link>.

source: Attachments will not be signed/encrypted if you are using inline OpenPGP: to sign/encrypt attachments, you have to install GnuPG and some necessary libraries; then, you can decide for each attachment whether it should be signed/encrypted or not.
de: Falls man die eingebaute OpenPGP-Unterstützung verwendet, können Anhänge nicht verschlüsselt und signiert werden. Um Anhänge zu verschlüsseln, muss man zunächst GnuPG und einige notwendige Bibliotheken installieren. Danach kann man für jeden Anhang einzeln festlegen, ob er verschlüsselt werden soll.

source: &kmail; has to rely on <application>GnuPG</application>'s output; this output is often different between different versions of <application>GnuPG</application>, so it is important that you test if encryption really works with your setup before you start using it seriously. &kmail; might <emphasis>not</emphasis> warn you if something fails -- enable <guilabel>Show signed/encrypted text after composing</guilabel>.
de: &kmail; ist auf die Ausgabe von <application>GnuPG</application> angewiesen. Das Ausgabeformat hat sich bei <application>GnuPG</application> mehrfach zwischen den Versionen geändert. Daher ist es unbedingt notwendig, die Verschlüsselung zu testen, bevor man sie ernsthaft verwendet. &kmail; warnt <emphasis>nicht</emphasis> in jedem Fall, wenn etwas schiefgeht. Man sollte sicherheitshalber <guilabel>Signierten/verschlüsselten Text nach der Erstellung anzeigen</guilabel> aktivieren.

source: To setup and use <application>GnuPG</application> support in &kmail; it is necessary to have <application>GnuPG</application> installed and set up properly; of course, we cannot give you a full introduction of <application>GnuPG</application> here. We will only mention the steps you have to do to get <application>GnuPG</application> going. For details you should have a look at the <ulink url="http://www.gnupg.org/docs.html#guides">The &GNU; Privacy Handbook</ulink>.
de: Um die <application>GnuPG</application>-Unterstützung in &kmail; verwenden zu können, muss man zunächst <application>GnuPG</application> installieren und einrichten. Hier kann keine vollständige Einführung zu <application>GnuPG</application> gegeben werden. Die wichtigsten Schritte zur Einrichtung von <application>GnuPG</application> werden aber erläutert. Detaillierte Informationen findet man im <ulink url="http://www.gnupg.org/docs.html#guides">The &GNU; Privacy Handbook</ulink>.

source: It is certainly a good idea to study this documentation as well as an introduction into public key cryptography: there you can learn a lot about the basic concepts, which will help you to understand what is going on; also, many security related issues you should know about are discussed there.
de: Es ist sicherlich hilfreich, diese Dokumentation und eine generelle Einführung in Verschlüsselung mit öffentlichen Schlüsseln zu lesen. Dort werden die grundlegenden Konzepte erläutert, die ein Verständnis des Ablaufes erleichtern. Außerdem werden dort viele sicherheitsrelevante Themen erläutert.

source: Now, let us start.
de: Auf geht's.

source: Preconditions
de: Voraussetzungen

source: &kmail; expects that your <application>GnuPG</application> binary is called <command>gpg</command>. If this is not the case for you, just make a symlink.
de: &kmail; erwartet, dass Ihr <application>GnuPG</application>-Programm den Namen <command>gpg</command> hat. Sollten Ihr Programm einen anderen Namen haben, legen Sie einfach einen symbolischen Link an.

source: If you have not done so, you have to generate a key pair (secret and public key) for your identity. Either do that using &kgpg; or &kleopatra; or do this at the command line: <userinput><command>gpg</command> <option>--gen-key</option></userinput>: &kmail; has no internal support for <application>gpg</application>'s key generation at this time. The identity (normally your name followed by your email address within brackets, such as <userinput>John Doe &lt;john@example.com&gt;</userinput>) and your passphrase are important for the co-operation between &kmail; and <application>GnuPG</application>.
de: Falls noch nicht erfolgt, muss zunächst ein Schlüsselpaar (aus öffentlichem und privatem Schlüssel) für die eigene Identität erzeugt werden. Dazu benutzen Sie &kgpg; oder &kleopatra; oder geben folgendes auf in einer Konsole ein: <userinput><command>gpg</command> <option>--gen-key</option></userinput>. Es gibt in &kmail; noch keine Unterstützung für diese Prozedur der Schlüsselerzeugung. Die Identität (normalerweise der Name gefolgt von der E-Mail-Adresse in spitzen Klammern, wie z.B. <userinput>Hans Mustermann &lt;Hans.Mustermann@beispiel.de&gt;</userinput>) und das Passwort sind wichtig für das Funktionieren von &kmail; und <application>GnuPG</application>.

source: <application>GnuPG</application>-Related Settings in &kmail;
de: Einstellungen zu <application>GnuPG</application> in &kmail;

source: Select the <guilabel>Composing</guilabel> tab on the <guilabel>Security</guilabel> settings page; there you will find the following options:
de: Wählen Sie die Karteikarte <guilabel>Nachrichten erstellen</guilabel> auf der Seite <guilabel>Sicherheit</guilabel> des Einrichtungsdialogs. Dort finden Sie die folgenden Einstellmöglichkeiten:

source: When encrypting emails, always also encrypt to the certificate of my own identity
de: Beim Verschlüsseln von E-Mails immer auch für den eigenen Schlüssel verschlüsseln

source: If this option is off and you want to send an encrypted message to somebody, then you cannot read this message any longer after you have composed and encrypted it. Turn this option on to keep sent encrypted messages readable for you too.
de: Wenn dieses Ankreuzfeld nicht aktiviert ist, kann man nach dem Versenden einer verschlüsselten Nachricht diese nach der Verschlüsselung selbst auch nicht mehr lesen. Will man selbst die Nachricht noch lesen können, sollte man diese Option aktivieren.

source: Store sent messages encrypted
de: Versendete Nachrichten verschlüsselt speichern

source: When this box is checked, sent messages are stored encrypted like they were sent. This is not recommended, as you will not be able to read the messages any longer if a necessary certificate expires.
de: Wenn dieses Ankreuzfeld markiert ist, werden versendete Nachrichten verschlüsselt gespeichert so wie sie versendet wurden. Das wird nicht empfohlen, da Sie die Nachrichten nicht mehr lesen können, sobald eines der Zertifikate abgelaufen ist.

source: Always show the encryption keys for approval
de: Verschlüsselungsschlüssel immer zur Bestätigung anzeigen

source: This will always open a dialog that lets you choose the keys used for each recipient when you are sending an encrypted message; if this option is off, &kmail; will show this dialog only when it cannot find a key for a recipient or when there are conflicting or unset encryption preferences.
de: Es wird vor dem Versand einer verschlüsselten Nachricht immer ein Dialog geöffnet, der die Wahl der Schlüssel für jeden Empfänger ermöglicht. Wenn dieses Ankreuzfeld nicht markiert ist, zeigt &kmail; diesen Dialog nur dann an, wenn für einen der Empfänger kein passender Schlüssel gefunden werden kann oder wenn die Verschlüsselungseinstellungen widersprüchlich oder unvollständig sind.

source: Automatically encrypt messages whenever possible
de: Nachrichten möglichst automatisch verschlüsseln

source: If this option is on, &kmail; will automatically encrypt messages with the built-in OpenPGP support or the PGP/&MIME;-Plugin provided that, for every recipient, a trusted PGP key is found in your keyring and you did not tell &kmail; not to encrypt messages sent to certain recipients. If in doubt, &kmail; will ask whether the message should be encrypted or not.
de: Mit dieser Einstellung verschlüsselt &kmail; Nachrichten automatisch mit Hilfe der eingebauten OpenPGP-Unterstützung oder dem PGP/&MIME;-Modul, vorausgesetzt, es existiert für jeden Empfänger der Nachricht im Schlüsselring ein vertrauenswürdiger PGP-Schlüssel, und weiterhin vorausgesetzt, dass man nicht in &kmail; die Verschlüsselung für einige Empfänger abgeschaltet hat. Im Zweifelsfall fragt &kmail;, ob die Nachricht verschlüsselt werden soll.

source: Now that you have setup the encryption tool you have to tell &kmail; which OpenPGP key you want to use for signing and for encrypting messages; to do this go to the <link linkend="configure-identity">Identities configuration</link> and set the key that should be used on the <guilabel>Cryptography</guilabel> tab of the identity configuration.
de: Nach Einrichtung des Verschlüsselungsprogramms muss man &kmail; mitteilen, welcher OpenPGP-Schlüssel zum Signieren und Verschlüsseln von Nachrichten verwendet werden soll. Dazu legt man bei der <link linkend="configure-identity">Einrichtung der Identität</link> auf der Karteikarte <guilabel>Kryptografie</guilabel> den gewünschten Schlüssel fest.

source: Now you are able to sign outgoing messages; to let people send you encrypted messages and to let them verify your signature you must send them your public key or upload your public key to a public <application>GnuPG</application> key server so that they can fetch your key from there. To send encrypted messages to other people or to verify their signed messages you will need their public keys; you can store your public key(s) on a public <application>GnuPG</application> key server.
de: Nun ist man in der Lage, eigene Nachrichten vor dem Versand zu signieren. Damit andere Benutzer Nachrichten an Sie schicken und Ihre Signatur überprüfen können, muss man seinen öffentlichen Schlüssel an diese Personen senden oder an einen öffentlichen <application>GnuPG</application>-Schlüsselserver schicken, von dem sie dann herunter geladen werden können. Um verschlüsselte Nachrichten an andere Personen versenden zu können oder um signierte Nachrichten anderer Personen zu überprüfen, benötigt man die öffentlichen Schlüssel dieser Personen. Man kann seine öffentlichen Schlüssel auf einem öffentlichen <application>GnuPG</application>-Schlüsselserver speichern.

source: Sign your Messages
de: Signieren von Nachrichten

source: You can compose your message as usual in the composer window of &kmail;. Before you send the message, check the <guibutton>Sign</guibutton> icon on the toolbar of the composer window; then, you can send the message. The identity you are using to write the current message needs to be connected to an <guilabel>OpenPGP Key</guilabel> in the <guilabel>Identity</guilabel> section of the <guilabel>Configure</guilabel> dialog. To sign the message, &kmail; needs to know your <application>GnuPG</application> passphrase: if you did not select <guilabel>Keep passphrase in memory</guilabel> in the <guilabel>Security</guilabel> section, &kmail; will ask you for it; otherwise, if you have already given the phrase to &kmail;, it will sign the message without any further prompt.
de: Man erstellt seine Nachricht wie gewöhnlich im E-Mail-Editor von &kmail;. Vor dem Versand der Nachricht sollte man das Symbol <guibutton>Signieren</guibutton> in der Werkzeugleiste überprüfen. Nun kann man die Nachricht versenden. Für die Signierung muss die verwendete Identität unter <guilabel>Identität</guilabel> im Dialog <guilabel>&kmail; einrichten...</guilabel> mit einem <guilabel>OpenPGP</guilabel>-Schlüssel verbunden worden sein. Für die Signierung ist das <application>GnuPG</application>-Passwort erforderlich. Wenn man nicht <guilabel>Passwort im Speicher halten</guilabel> auf der Seite <guilabel>Sicherheit</guilabel> bei den Einstellungen von &kmail; gewählt hat, fragt &kmail; nach dem Passwort. Anderenfalls wird die Nachricht ohne Nachfrage von &kmail; signiert, falls man das Passwort bereits einmal eingegeben hatte.

source: Encrypt your Messages
de: Verschlüsseln von Nachrichten

source: To send an encrypted message to somebody whose public key you have, you simply create the message in the composer window. Before you send the message, check the <guibutton>Encrypt</guibutton> button in the toolbar of the composer window; note that you might not have to check the button if <guilabel>Automatically encrypt messages whenever possible</guilabel> is selected in &kmail;'s configuration (see <link linkend="pgp-sign-your-messages">above</link>). Then send the message.
de: Um jemandem, dessen öffentlichen Schlüssel man besitzt, eine verschlüsselte Nachricht zu senden, schreibt man die Nachricht zunächst im Editor. Vor dem Versand der Nachricht klickt man auf das Symbol <guibutton>Verschlüsseln</guibutton> in der Werkzeugleiste. Falls Sie im Einrichtungsdialog bereits <guilabel>Nachrichten möglichst automatisch verschlüsseln</guilabel> markiert haben, ist dieser Schritt überflüssig (siehe auch <link linkend="pgp-sign-your-messages">weiter oben</link>). Dann kann die Nachricht versandt werden.

source: If you checked the <guibutton>Encrypt</guibutton> button and &kmail; cannot find a matching key for a recipient, it will display a list containing all available keys in the <guilabel>Encryption Key Selection</guilabel> dialog; if &kmail; finds more than one trusted key for a recipient, it will display a list containing all matching keys for this recipient. In both cases you can select the key(s) which should be used for encrypting this message for the recipient in question. Using the <guilabel>Remember choice</guilabel> checkbox you can save your selection for future messages.
de: Falls man den Knopf <guilabel>Verschlüsseln</guilabel> gedrückt hat und &kmail; für einen Empfänger keinen passenden vertrauenswürdigen Schlüssel findet, wird eine Liste der verfügbaren vertrauenswürdigen Schlüssel im Dialog <guilabel>Wahl des Verschlüsselungs-Schlüssels</guilabel> angezeigt. Falls &kmail; mehr als einen vertrauenswürdigen Schlüssel für einen Empfänger findet, wird eine Liste der Schlüssel für diesen Empfänger angezeigt. In beiden Fällen kann man den Schlüssel auswählen, der zur Verschlüsselung der Nachricht verwendet werden soll. Falls man die Auswahl für zukünftige Nachrichten beibehalten möchte, markiert man das Ankreuzfeld <guilabel>Auswahl speichern</guilabel>.
