Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdepim/kmail_configure.po
Languages: de

source: This tab allows you to specify a signature (sometimes called <quote>footer</quote> or <quote>disclaimer</quote>) to be appended to each message sent using this identity.
de: Auf dieser Karteikarte kann eine Signatur (manchmal auch als <quote>Fußnote</quote>) festgelegt werden, die an jede unter dieser Identität versandte Nachricht angehängt wird.

source: This type of signature has nothing to do with the (digital) signatures for which you can select the keys to use on the <link linkend="configure-identity-cryptography">Cryptography</link> tab. It is just bad wording to call this a signature, but since the term is already used everywhere else, we keep this notation. Just keep in mind that these signatures and digital signatures are two completely different things.
de: Dieser Typ von Signatur hat nichts mit einer (digitalen) Signatur zu tun, die auf der Karteikarte <link linkend="configure-identity-cryptography">Kryptografie</link> gewählt werden konnte. Der Ausdruck Signatur ist hier völlig unpassend, aber weil er sich eingebürgert hat, haben wir ihn beibehalten. Diese Signatur und digitale Signaturen sind zwei völlig unterschiedliche Dinge.

source: Check the <guilabel>Enable signature</guilabel> option if you want to be able to append the signature when using this identity. To <emphasis>automatically</emphasis> append it to every new message you also have to select <guilabel>Automatically insert signature</guilabel> in the <guilabel>Composer</guilabel> configuration page.
de: Falls man eventuelle eine Signatur für diese Identität verwenden möchte, markiert man <guilabel>Signatur anhängen</guilabel>. Um an jede Nachricht <emphasis>automatisch</emphasis> eine Signatur anhängen zu lassen, markiert man <guilabel>Signatur automatisch einfügen</guilabel> im Einrichtungsdialog auf der Seite <guilabel>E-Mail-Editor</guilabel>.

source: &kmail; can obtain the signature text from various sources. The default is <guilabel>Input Field Below</guilabel>. Just enter what you would like your signature to be into the textbox.
de: Der Signaturtext in &kmail; kann aus verschiedenen Quellen stammen. Als Standard ist aus <guilabel>Eingabefeld unten</guilabel> eingestellt. Geben Sie den gewünschten Signaturtext in das Textfeld unterhalb des Auswahlfeldes ein.

source: The traditional way on Unix is to read the text from a file called <filename>.signature</filename> in your home folder. This file can be shared between several programs, so you get the same signature in each mail program you use. Select <guilabel>File</guilabel> from the <guilabel>Obtain Signature text from</guilabel> drop down menu. If you want to edit the file, click the <guilabel>Edit File</guilabel> button.
de: Unter &UNIX; ist es üblich, diesen Text aus einer Datei namens <filename>.signature</filename> im Persönlichen Ordner zu nehmen. Diese Datei kann von verschiedenen Programmen verwendet werden. Damit ist die Signatur unabhängig vom verwendeten Programm. Wählen Sie <guilabel>Datei</guilabel> im Auswahlfeld <guilabel>Signaturtext aus</guilabel>. Möchten Sie die Datei bearbeiten, klicken Sie auf den Knopf <guibutton>Datei bearbeiten</guibutton>.

source: &kmail; can also read the signature text from the output of a command. Thus, you can use programs such as <command>fortune</command> to create a new signature text for every message. Everything the program prints onto <acronym>stdout</acronym> is caught and used as the signature text. To read the text from the output of a command you select <guilabel>Output of Command</guilabel>. Enter the command (preferably with full path) in the <guilabel>Specify command</guilabel> edit field.
de: &kmail; kann den Signaturtext auch von der Befehlsausgabe eines Programms lesen. Auf diese Weise können Sie ein Programm wie <command>fortune</command> verwenden, um für jede Nachricht einen neuen Signaturtext zu erzeugen. Alles was das Programm auf die Befehlsausgabe <acronym>stdout</acronym> ausgibt, wird als Signatur verwendet. Um Text mit dieser Methode einzulesen, wählen Sie <guilabel>Ausgabe eines Befehls</guilabel> und tragen diesen Befehl vorzugsweise mit vollständigem Pfad in das Feld <guilabel>Befehl angeben</guilabel> ein.

source: On the Internet, signatures are by convention separated from the body of the message by a line containing only the three character <quote>-- </quote> (dash, dash, space). &kmail; will automatically prepend the signature text with this line if it is not already present in the signature text.
de: Im Internet ist es üblich, den Signaturtext durch ein drei Zeichen, nämlich <quote>-- </quote> (2 Bindestriche und ein Leerzeichen) von der Nachricht abzusetzen. &kmail; stellt diese Zeichen dem Signaturtext automatisch voran, wenn sie nicht bereits im Signaturtext vorhanden sind.

source: If you do not wish the separator to be prepended automatically by &kmail;, simply add it to the signature text yourself.
de: Falls man &kmail; daran hindern möchte, diese Trennzeichen automatisch einzufügen, stellt man diese einfach selbst dem Signaturtext voran.

source: Picture
de: Bild

source: <screeninfo>Identity Picture</screeninfo>
de: <screeninfo>Identität - Bild</screeninfo>

source: <phrase>Identity Picture</phrase>
de: <phrase>Identität - Bild</phrase>

source: <para>Identity Picture</para>
de: <para>Identität - Bild</para>

source: &kmail; can send a small (48x48 pixels), low-quality, monochrome picture with every message. For example, this could be a picture of you or a glyph. It is shown in the recipient's mail client (if supported).
de: &kmail; kann mit jeder Nachricht ein kleines (48×48 Pixel) Schwarz-Weiß-Bild geringer Qualität versenden. Dabei kann es sich z. B. um ein Porträtfoto oder ein Symbol handeln. Einige E-Mail-Programme zeigen dieses Bild an.

source: Send picture with every message
de: Bild mit jeder Nachricht versenden

source: Check this box if you want &kmail; to add a so-called X-Face header to messages written with this identity. An X-Face is a small (48x48 pixels) black and white image that some mail clients are able to display.
de: Markieren Sie dieses Ankreuzfeld, falls &kmail; zu jeder Nachricht mit dieser Identität ein sogenanntes „X-Face“-Vorspannfeld hinzufügen soll. Dabei handelt es sich um ein kleines (48×48 Pixel) Schwarz-Weiß-Bild, das von einigen E-Mail-Programmen zusammen mit der Nachricht angezeigt wird.

source: External Source
de: externer Quelle

source: Select File...
de: Datei auswählen ...

source: Use this to select an image file to create the picture from. The image should be of high contrast and nearly quadratic shape. A light background helps improve the result.
de: Hiermit kann eine Bilddatei zur Erzeugung des Bildes ausgewählt werden. Die Datei sollte ein Bild mit hohem Kontrast und quadratischer Form enthalten. Ein heller Hintergrund verbessert das Ergebnis.

source: Set From Address Book
de: Aus Adressbuch holen

source: You can use a scaled-down version of the picture you have set in your address book entry.
de: Sie können eine entsprechend skalierte Version Ihres Bildes aus dem Adressbuch verwenden lassen.

source: Input Field Below
de: dem Eingabefeld unten

source: Use this field to enter an arbitrary X-Face string. Examples are available at <ulink url="http://ace.home.xs4all.nl/X-Faces/">http://ace.home.xs4all.nl/X-Faces/</ulink>
de: Verwenden Sie dieses Feld zur Eingabe einer beliebigen X-Face-Zeichenkette. Beispiele finden Sie unter <ulink url="http://ace.home.xs4all.nl/X-Faces/">http://ace.home.xs4all.nl/X-Faces/</ulink>

source: Accounts Page
de: Zugänge

source: You can find a quick introduction to the <guilabel>Accounts</guilabel> page in the <link linkend="setting-up-your-account">Setting up your Account</link> section.
de: Eine kurze Beschreibung zur Seite <guilabel>Zugänge</guilabel> finden Sie im Abschnitt <link linkend="setting-up-your-account">Einrichten Ihres Zugangs</link>.

source: This page allows you to create one or more (incoming and outgoing) <emphasis>accounts</emphasis>, &ie; combinations of mail servers, login information and other settings. Typically, you will create one outgoing (used for sending messages) and one incoming (used to retrieve messages) account. You can create as many accounts as you want, though, and assign each one to different <link linkend="configure-identity">identities</link> or decide on a per-message basis.
de: Auf dieser Seite kann man eines oder mehrere (für Posteingang und Postausgang) <emphasis>Postfächer</emphasis> einrichten, also Kombinationen von Mail-Servern, Anmeldeinformationen und anderen Einstellungen. Üblicherweise richtet man ein Postfach für den Postausgang (zum Versenden von Nachrichten) und eines für den Posteingang (zum Abholen von Nachrichten) ein. Man kann aber auch mehrere Postfächer einrichten und jedes einer anderen <link linkend="configure-identity">Identität</link> zuordnen oder sogar für jede Nachricht einzeln entscheiden.

source: Sending
de: Nachrichten-Versand

source: The <guilabel>Sending</guilabel> tab allows you to define new outgoing mail servers and set some common options.
de: Auf der Karteikarte <guilabel>Versand</guilabel> kann man Mail-Server für den Versand von Nachrichten einrichten und einige allgemeine Einstellungen vornehmen.

source: For basic information, see <link linkend="sending-mail">Setting up your Account: Sending</link>.
de: Grundlegende Informationen findet man unter <link linkend="sending-mail">Einrichtung eines Postfaches: Versand</link>.

source: When you click <guibutton>Add...</guibutton> or <guibutton>Modify...</guibutton> the <guilabel>Create Outgoing Account</guilabel> or <guilabel>Configure account</guilabel> dialogs will open respectively. For sending via &Sendmail; or similar programs you can specify a name and the location of the &Sendmail; program. For &SMTP; you can specify <guilabel>Name</guilabel>, <guilabel>Outgoing mail server</guilabel>, and <guilabel>Port</guilabel> of the server. <guilabel>Server requires authentication</guilabel> will enable the <guilabel>Login</guilabel> and <guilabel>Password</guilabel> fields. If you are not sure about the security settings you can make &kmail; test for the best settings by using <guibutton>Auto Detect</guibutton> on the <guilabel>Advanced</guilabel> tab.
de: Wenn man auf <guibutton>Hinzufügen...</guibutton> oder <guibutton>Ändern ...</guibutton> klickt, wird der Dialog <guilabel>Versand-Zugang erstellen</guilabel> oder <guilabel>Postfach einrichten</guilabel> geöffnet. Zum Versand per &Sendmail; gibt man den Namen und den Pfad des &Sendmail;-Programms an. Bei &SMTP; kann man <guilabel>Name</guilabel>, <guilabel>Ausgehender Mailserver</guilabel> und <guilabel>Port</guilabel> angeben. Die Auswahl von <guilabel>Server erfordert Authentifizierung</guilabel> aktiviert die Felder <guilabel>Benutzer</guilabel> und <guilabel>Passwort</guilabel>. Bei Unsicherheit über die Sicherheitseinstellungen kann man &kmail; durch Klicken auf den Knopf <guibutton>Automatisch erkennen</guibutton> zur automatischen Einstellung der sichersten Methode veranlassen.

source: <guilabel>Confirm before send</guilabel> will pop up a confirmation box every time you send a message.
de: Die Option <guilabel>Vor Versenden nachfragen</guilabel> zeigt vor jedem Nachrichtenversand einen Bestätigungsdialog.

source: <guilabel>Send messages in outbox folder</guilabel> lets you specify when queued messages, &ie; messages in the outbox folder pending to be sent, should be sent. You can choose between:
de: Mit <guilabel>Nachrichten im Postausgang senden</guilabel> können Sie auswählen, wann Nachrichten in der Warteschlange, d.h. Nachrichten im Postausgang-Ordner, die auf den Versand warten, versendet werden sollten. Sie haben folgende Möglichkeiten:

source: Never Automatically
de: Nie automatisch

source: Queued messages will only be sent if you select <menuchoice><guimenu>File</guimenu><guimenuitem>Send queued messages</guimenuitem></menuchoice>.
de: Nachrichten in der Warteschlange werden nur verschickt, wenn Sie <menuchoice><guimenu>Datei</guimenu><guimenuitem>Postausgang versenden</guimenuitem></menuchoice> auswählen.

source: On Manual Mail Checks
de: Bei manuellem Abholen

source: Queued messages will be sent after you have manually checked for new mail, &eg; with <menuchoice><guimenu>File</guimenu><guimenuitem>Check Mail</guimenuitem></menuchoice>. Of course, you can also manually send the queued messages with <menuchoice><guimenu>File</guimenu><guimenuitem>Send queued messages</guimenuitem></menuchoice>.
de: Nachrichten in der Warteschlange werden verschickt, nachdem Sie manuell nach neuen Nachrichten gesehen haben, also nach Auswahl von <menuchoice><guimenu>Datei</guimenu><guimenuitem>Nach E-Mail sehen</guimenuitem></menuchoice>. Natürlich können Sie die Nachrichten in der Warteschlange auch manuell mit <menuchoice><guimenu>Datei</guimenu><guimenuitem>Postausgang versenden</guimenuitem></menuchoice> versenden.

source: On All Mail Checks
de: Bei allen Abholvorgängen

source: Queued messages will be sent after all checks for new mail, &ie; after automatic mail checks as well as after manual mail checks. Of course, you can also manually send the queued messages with <menuchoice><guimenu>File</guimenu><guimenuitem>Send queued messages</guimenuitem></menuchoice>.
de: Wartende Nachrichten werden versendet, sobald das automatische wie auch das manuelle Nachsehen nach neuen Nachrichten abgeschlossen ist.Natürlich können Sie die Nachrichten in der Warteschlange auch manuell mit <menuchoice><guimenu>Datei</guimenu><guimenuitem>Postausgang versenden</guimenuitem></menuchoice> versenden.

source: <guilabel>Default send method</guilabel> lets you define what happens when a message is sent. If <guilabel>Send now</guilabel> is selected, the message is sent to the mail server immediately, while if <guilabel>Send later</guilabel> is selected, the message is queued in the outbox to be sent later with the <menuchoice><guimenu>File</guimenu><guimenuitem>Send Queued Messages</guimenuitem></menuchoice> command or automatically when you check your mail, depending on the setting of <guilabel>Send messages in outbox folder</guilabel> above.
de: Die Option <guilabel>Standard-Sendemethode</guilabel> lässt Sie bestimmen was passiert, wenn eine Nachricht gesendet wird. Wenn <guilabel>Sofort senden</guilabel> ausgewählt ist, wird die Nachricht sofort an den Mailserver geschickt. Ist <guilabel>Später senden</guilabel> aktiviert, so wird die Nachricht zuerst in den Postausgang (<guilabel>Postausgang</guilabel>-Ordner) übertragen, um später automatisch oder mit <menuchoice><guimenu>Datei </guimenu><guimenuitem>Postausgang versenden</guimenuitem></menuchoice> gesendet zu werden, abhängig von den Einstellungen des Ankreuzfeldes <guilabel>Nachrichten im Postausgang senden</guilabel> weiter oben.

source: <guilabel>Default domain</guilabel> lets you specify which domain name should be used to complete email addresses that only consist of the recipient's user name. For example when you set the default domain to <replaceable>kde.org</replaceable> then messages you send to <replaceable>johndoe</replaceable> will be sent to <replaceable>johndoe@kde.org</replaceable>.
de: Im Feld <guilabel>Standard-Domain</guilabel> kann man einen Domain-Namen angeben, der zur Vervollständigung verwendet werden soll, falls man bei einer E-Mailadresse lediglich den Benutzernamen des Empfängers angegeben hat. Falls die Standard-Domain auf <replaceable>kde.org</replaceable> gesetzt ist, wird eine Nachricht bei der Eingabe <replaceable>M.Mustermann</replaceable> an <replaceable>M.Musermann@kde.org</replaceable> gesendet.

source: Receiving
de: Empfang

source: For basic information, see <link linkend="receiving-mail">Setting up your Account: Receiving</link>.
de: Grundlegende Informationen findet man unter <link linkend="receiving-mail">Einrichtung eines Postfaches: Empfang</link>.

source: Using the <guilabel>Retrieval Options</guilabel> popup menu for each resource, lets you specify whether &kmail; should check for new mail immediately after it has been started. You can also select <guilabel>Include in Manual Mail Check</guilabel> and <guilabel>Switch offline on &kmail; Shutdown</guilabel>.
de: Im Aufklappmenü <guilabel>Abrufeinstellungen</guilabel> können Sie für jede Ressource getrennt einstellen, ob &kmail; beim Start sofort nach E-Mail sehen soll. Zusätzlich können Sie auch <guilabel>Bei manueller Prüfung einbeziehen</guilabel> und <guilabel>Beim Beenden in Offline-Modus wechseln</guilabel> aktivieren.

source: With <guilabel>New Mail Notification</guilabel> you can set how &kmail; will notify you if new messages have arrived: <guilabel>Beep</guilabel> will play a short beep sound; if <guilabel>Detailed new mail notification</guilabel> is enabled then &kmail; will show the number of new messages for each folder provided you have chosen to be notified with a dialog. More advanced notification options, like showing a dialog or running a certain command, are available via the <guibutton>Other Actions</guibutton> button.
de: Mit <guilabel>Benachrichtigung bei neuen Nachrichten</guilabel> kann man einstellen, auf welche Art &kmail; sich bemerkbar macht, wenn neue Nachrichten eingetroffen sind. Die Einstellung <guilabel>Signalton</guilabel> lässt einen kurzen Signalton ertönen; wenn <guilabel>Ausführliche Benachrichtigung bei neuen Nachrichten</guilabel> eingeschaltet ist, dann zeigt &kmail; für jeden Ordner die Anzahl neuer Nachrichten, sofern Sie sich per Dialog benachrichtigen lassen. Umfangreichere Benachrichtigungsmöglichkeiten wie das Anzeigen eines Dialogs oder das Ausführen eines bestimmten Befehls können über den Knopf <guibutton>Andere Aktionen</guibutton> eingerichtet werden können.

source: Appearance Page
de: Erscheinungsbild

source: Fonts
de: Schriftarten

source: This section allows you to change the type, size and character set of the display fonts. <guilabel>Message Body</guilabel> sets the font for the reader pane, <guilabel>Composer</guilabel> sets the font for the body of your messages written in &kmail; Composer.
de: Dieser Abschnitt erlaubt die Änderung von Art, Größe und Zeichensatz der verwendeten Schriften. <guilabel>Nachrichtentext</guilabel> stellt den Zeichensatz für die Nachrichtenanzeige, <guilabel>Nachrichten-Editor</guilabel> für den E-Mail-Editor ein.

source: Colors
de: Farben

source: This section allows you to change the color of the text by double clicking on an item in the listbox. <guilabel>Recycle colors on deep quoting</guilabel> will restart the quote coloring at the first level after the third level of quoting has been reached. Note that the <guilabel>Quoted text</guilabel> colors only work in the message reader, not in the composer. If you want folders which are close to their quota (space allotment, usually used on &imap; servers) to be displayed in a different color, you can specify a percentage value as a threshold for this. The color to be used can be configured along with the other custom colors.
de: Auf dieser Karteikarte kann die Textfarbe durch doppelklicken auf einen Eintrag in der Liste geändert werden. <guilabel>Farben bei tief verschachtelten Zitaten wiederholen</guilabel> bedeutet, dass ab der dritten Zitatebene wieder die Farbe der ersten Ebene verwendet wird. Zu beachten ist, das sich die Farben für <guilabel>Zitierten Text</guilabel> nur auf das Hauptfenster beziehen, aber nicht auf das Fenster ‚Nachricht erstellen‘. Sollen Ordner, die fast ihre zulässige Größe erreicht haben (&eg; Speicherplatzzuteilung wie sie üblicherweise auf &imap;-Servern benutzt wird), in einer anderen Farbe angezeigt werden, kann auch ein Schwellwert in Prozent dafür eingestellt werden. Die Farbe für diese Ordner wird wie andere benutzerdefinierte Farben in der Liste ausgewählt.

source: <screeninfo>Default Layout</screeninfo>
de: <screeninfo>Standard-Layout</screeninfo>

source: <phrase>Default Layout</phrase>
de: <phrase>Standard-Layout</phrase>

source: <para>Default Layout</para>
de: <para>Standard-Layout</para>

source: This tab lets you configure the layout of the main window.
de: Auf dieser Karteikarte können Sie die Anordnung der Elemente im Hauptfenster einstellen.

source: In the <guilabel>Folder List</guilabel> section you can choose between the <guilabel>Long folder list</guilabel> (default) using the full height of the window and the <guilabel>Short folder list</guilabel> with the message preview pane using the entire bottom part of the window.
de: Im Abschnitt <guilabel>Ordnerliste</guilabel> können Sie zwischen der Standardeinstellung <guilabel>Lange Ordnerliste</guilabel>, die die ganze Höhe des Hauptfensters benutzt, und <guilabel>Kurze Ordnerliste</guilabel>, die den ganzen Platz für die Nachrichtenvorschau unten im Hauptfenster lässt, wählen.

source: If you want to have your favorite folders and a quick search field for folders at the top left of the main window select the next two options.
de: Möchten Sie Ihre bevorzugten Ordner und die Ordner-Schnellsuche oben links im Hauptfenster angezeigt haben, aktivieren Sie die nächsten zwei Einstellungen.

source: The <guilabel>Show Favorite Folders View</guilabel> section allows you to change how your favorites folder displays your favorite folder. <guilabel>As Icons</guilabel> uses a lot of space, so if you have several favorite folders you might try <guilabel>As List</guilabel>. If you do not have any favorite folders you can disable the view altogether by selecting <guilabel>Never</guilabel>.
de: Im Abschnitt <guilabel>Bevorzugte Ordner anzeigen</guilabel> können Sie einstellen, ob und wie Ihre bevorzugten Ordner angezeigt werden. Die Anzeige <guilabel>Als Symbole</guilabel> belegt viel Platz im Fenster, daher sollten Sie bei mehreren Ordnern besser <guilabel>Als Liste wählen</guilabel>. Mit <guilabel>Niemals</guilabel> können Sie die Anzeige bevorzugter Ordner ganz abschalten.

source: On by default, <guilabel>Folder Tooltips</guilabel> display additional information like the total number of messages, unread messages and storage size when hovering a folder with the mouse pointer. Select <guilabel>Never</guilabel> to disable this feature.
de: In der Voreinstellung zeigen die <guilabel>Ordner-Kurzinfos</guilabel> zusätzliche Informationen wie die gesamte Anzahl der Nachrichten, die Anzahl der ungelesenen Nachrichten und die Größe eines Ordners an, wenn Sie mit dem Mauszeiger darüber fahren. Wählen Sie <guilabel>Niemals</guilabel>, um diese Funktion auszuschalten.

source: You can choose where in relation to the message list you want the <guilabel>Message Preview Pane</guilabel> or disable it all together.
de: Sie können hier auswählen, ob Sie die <guilabel>Nachrichtenvorschau</guilabel> anzeigen möchten oder wo sie im Bezug zur Nachrichtenliste erscheinen soll.

source: Message List
de: Nachrichtenliste

source: In the <guilabel>General</guilabel> section you can alter the appearance of the Message List pane.
de: Im Abschnitt <guilabel>Allgemein</guilabel> können Sie das Erscheinungsbild der Nachrichtenliste einstellen.

source: Choose to <guilabel>Display tooltips for messages and group headers</guilabel>. Check <guilabel>Hide tab bar when only one tab is open</guilabel> to have more space for the messages in the list.
de: Wählen Sie <guilabel>Kurzinfos für Nachrichten und Zusammenfassungsüberschriften aktivieren</guilabel> und <guilabel>Unterfensterleiste für die Nachrichtenliste nur bei Bedarf anzeigen</guilabel>, dann haben Sie mehr Platz für die Anzeige der Nachrichten in der Liste.
