Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdepim/kmail_menus.po
Languages: de

source: Works just like <guimenuitem>Reply...</guimenuitem> with the option to select a custom template that has been configured in <link linkend="configure-composer-custom-templates">Custom Templates</link>.
de: Funktioniert wie <guimenuitem>Antworten ...</guimenuitem> mit der Möglichkeit, eine eigene Vorlage auszuwählen, die als <link linkend="configure-composer-custom-templates">benutzerdefinierte Vorlage</link> erstellt wurde.

source: <guimenu>Message</guimenu> <guisubmenu>Reply Special</guisubmenu> <guimenuitem>Reply to All With Custom Template</guimenuitem>
de: <guimenu>Nachricht</guimenu><guisubmenu>Antworten (speziell)</guisubmenu> <guimenuitem>Allen mit eigener Vorlage antworten ...</guimenuitem>

source: Works just like <guimenuitem>Reply to All...</guimenuitem> with the option to select a custom template that has been configured in <link linkend="configure-composer-custom-templates">Custom Templates</link>.
de: Funktioniert wie <guimenuitem>Antworten an Alle</guimenuitem> mit der Möglichkeit, eine eigene Vorlage auszuwählen, die als <link linkend="configure-composer-custom-templates">benutzerdefinierte Vorlage</link> erstellt wurde.

source: <shortcut> <keycombo action="simul">&Shift;<keycap>F</keycap></keycombo> </shortcut> <guimenu>Message</guimenu> <guisubmenu>Forward</guisubmenu> <guimenuitem>As Attachment</guimenuitem>
de: <shortcut> <keycombo action="simul">&Shift;<keycap>F</keycap></keycombo> </shortcut> <guimenu>Nachricht</guimenu> <guisubmenu>Weiterleiten</guisubmenu> <guimenuitem>Als Anhang ...</guimenuitem>

source: <action>Forwards the message to a new recipient.</action> The message and its attachments will become an attachment of the new message. The original message headers will be included in the forwarded message as well.
de: <action>Leitet die Nachricht an den neuen Empfänger weiter.</action> Die Nachricht und deren Anhänge werden an die neue Nachricht angehängt. Der ursprüngliche Nachrichtenvorspann wird gleichfalls in die weitergeleitete Nachricht eingefügt.

source: <shortcut> <keycap>F</keycap></shortcut> <guimenu>Message</guimenu> <guisubmenu>Forward</guisubmenu> <guimenuitem>Inline</guimenuitem>
de: <shortcut> <keycap>F</keycap></shortcut> <guimenu>Nachricht</guimenu> <guisubmenu>Weiterleiten</guisubmenu> <guimenuitem>Im Text</guimenuitem>

source: <action>The message's text and some important header fields will be copied to the body of the new message with text marking the forwarded part.</action> Attachments will be forwarded as attachments of the new message.
de: <action>Der Nachrichtentext und einige wichtige Vorspannfelder werden in die neue Nachricht kopiert und als weitergeleiteter Teil markiert.</action>Anhänge werden wieder an die neue Nachricht angehängt.

source: <shortcut> <keycap>E</keycap> </shortcut> <guimenu>Message</guimenu> <guisubmenu>Forward</guisubmenu> <guimenuitem>Redirect</guimenuitem>
de: <shortcut> <keycap>E</keycap> </shortcut> <guimenu>Nachricht</guimenu> <guisubmenu>Weiterleiten</guisubmenu> <guimenuitem>Umleiten</guimenuitem>

source: This works like forward, except that the message stays the same (even the <guilabel>From:</guilabel> field). The user who redirected the message is added in special header fields (<literal>Redirect-From</literal>, <literal>Redirect-Date</literal>, <literal>Redirect-To</literal>, &etc;).
de: Dies funktioniert wie die Weiterleitung, nur das die Nachricht unverändert bleibt, sogar das Feld <guilabel>Absender</guilabel>. Der Benutzer, der die Nachricht ungeleitet hat, wird in speziellen Vorspannfeldern (<literal>Redirect-From</literal>, <literal>Redirect-Date</literal>, <literal>Redirect-To</literal>, &etc;) hinzugefügt.

source: <guimenu>Message</guimenu> <guisubmenu>Forward</guisubmenu> <guimenuitem>With Custom Template</guimenuitem>
de: <guimenu>Nachricht</guimenu><guisubmenu>Weiterleiten</guisubmenu> <guimenuitem>Mit eigener Vorlage</guimenuitem>

source: Works just like forward with the option to select a custom template that has been configured in the composer custom templates tab in <link linkend="configure-composer-custom-templates">Custom Templates</link>.
de: Funktioniert wie Weiterleiten mit der Möglichkeit, eine eigene Vorlage auszuwählen, die als <link linkend="configure-composer-custom-templates">benutzerdefinierte Vorlage</link> erstellt wurde.

source: <guimenu>Message</guimenu> <guimenuitem>Send Again...</guimenuitem>
de: <guimenu>Nachricht</guimenu> <guimenuitem>Erneut senden ...</guimenuitem>

source: Opens a composer window with the currently selected message so it can be sent again.
de: Öffnet ein Editorfenster mit der gerade ausgewählten Nachricht, so dass Sie sie bearbeiten und erneut versenden können.

source: This is only available for messages which you have sent or, more precisely, for messages which have the <guilabel>sent</guilabel> status.
de: Diese Funktion steht nur für Nachrichten zur Verfügung, die Sie versendet haben, oder genauer, die den Status <guilabel>gesendet</guilabel> haben.

source: <shortcut> <keycap>T</keycap> </shortcut> <guimenu>Message</guimenu> <guimenuitem>Edit Message</guimenuitem>
de: <shortcut><keycap>T</keycap></shortcut> <guimenu>Nachricht</guimenu> <guimenuitem>Nachricht bearbeiten</guimenuitem>

source: Edits the selected message if it is editable.
de: Öffnet die Nachricht zur Bearbeitung, falls möglich.

source: Only messages in the <guilabel>outbox</guilabel> and <guilabel>drafts</guilabel> folder can be edited.
de: Nur Nachrichten in den Ordnern <guilabel>Postausgang</guilabel> und <guilabel>Entwürfe</guilabel> können bearbeitet werden.

source: <guimenu>Message</guimenu> <guimenuitem>Mailing List</guimenuitem>
de: <guimenu>Nachricht</guimenu> <guimenuitem>Mailingliste</guimenuitem>

source: Offers several options for mailing list messages.
de: In diesem Untermenü finden Sie Aktionen für Nachrichten in Mailinglisten.

source: The current working folder must be configured as a mailing list for this to be available. Please see <link linkend="folders-properties-mailinglist">Folder Properties Mailing List</link> for information on setting up mailing lists.
de: Der aktuelle Ordner muss als Mailinglistenordner eingerichtet sein, damit diese Funktionen verfügbar sind. Weitere Informationen zur Einrichtung von Ordnern für Mailinglisten im Abschnitt <link linkend="folders-properties-mailinglist">Eigenschaften von Mailinglistenordnern</link>.

source: The following options are available to mailing list folders:
de: Die folgenden Einstellungen für Mailinglisten-Ordner können ausgewählt werden:

source: <guimenuitem>Post New Message(email)</guimenuitem> will presets the <guilabel>To:</guilabel> with the address configured in Post to List.
de: <guimenuitem>Neue Nachricht senden (E-Mail)</guimenuitem> besetzt das Feld <guilabel>An</guilabel> mit der Adresse <guilabel>An Liste senden</guilabel> der Mailingliste.

source: <guimenuitem>Request Help(email)</guimenuitem> will presets the <guilabel>To:</guilabel> with the address configured in Post to List and <literal>help</literal> word in the <guilabel>Subject:</guilabel> field.
de: <guimenuitem>Mailinglisten-Hilfe anfordern (E-Mail)</guimenuitem> besetzt das Feld <guilabel>An</guilabel> mit der Adresse <guilabel>An Liste senden</guilabel> der Mailingliste und fügt <literal>help</literal> in das Feld <guilabel>Betreff</guilabel> ein.

source: <guimenuitem>Subscribe to List(web)</guimenuitem> will open your default web browser to the subscribe website of the configured mailing list.
de: <guimenuitem>Mailingliste abonnieren (Web)</guimenuitem> die Webseite zum Abonnieren der eingerichteten Mailingliste in Ihren Standard-Webbrowser.

source: <guimenuitem>Subscribe to List(email)</guimenuitem> will presets the <guilabel>To:</guilabel> with the mailing list subscription address and <literal>subscribe</literal> word in the <guilabel>Subject:</guilabel> field.
de: <guimenuitem>Mailingliste abonnieren (E-Mail)</guimenuitem> besetzt das Feld <guilabel>An</guilabel> mit der Adresse zum Abonnieren der Mailingliste und fügt <literal>subscribe</literal> in das Feld <guilabel>Betreff</guilabel> ein.

source: <guimenuitem>Unsubscribe from List(web)</guimenuitem> will open your default web browser to the unsubscribe website of the configured mailing list.
de: <guimenuitem>Abonnement kündigen (Web)</guimenuitem> öffnet die Webseite zum Kündigen der eingerichteten Mailingliste in Ihren Standard-Webbrowser.

source: <guimenuitem>Unsubscribe from List(email)</guimenuitem> will presets the <guilabel>To:</guilabel> with the mailing list subscription address and <literal>unsubscribe</literal> word in the <guilabel>Subject:</guilabel> field.
de: <guimenuitem>Abonnement kündigen (E-Mail)</guimenuitem> besetzt das Feld <guilabel>An</guilabel> mit der Adresse zum Abonnieren der Mailingliste und fügt <literal>unsubscribe</literal> in das Feld <guilabel>Betreff</guilabel> ein.

source: <guimenu>Message</guimenu> <guisubmenu>Copy Message To</guisubmenu>
de: <guimenu>Nachricht</guimenu> <guisubmenu>Nachricht kopieren nach</guisubmenu>

source: <action>Copies the selected messages to a specified folder,</action> you can choose from recent folders, local folders, or a specific account folder.
de: <action>Kopiert die ausgewählten Nachrichten in den angegebenen Ordner.</action> Im Untermenü können Sie aus zuletzt benutzten Ordnern oder lokalen Ordnern auswählen.

source: <guimenu>Message</guimenu> <guisubmenu>Move Message To</guisubmenu>
de: <guimenu>Nachricht</guimenu> <guisubmenu>Nachricht verschieben nach</guisubmenu>

source: The same as copy message to, except you <action>permanently move the selected messages to a specified folder.</action>
de: Wie das Kopieren einer Nachricht, aber Sie <action>verschieben die ausgewählte Nachricht in den angegebenen Ordner.</action>

source: <guimenu>Message</guimenu> <guisubmenu>Mark Message</guisubmenu>
de: <guimenu>Nachricht</guimenu> <guisubmenu>Nachricht markieren</guisubmenu>

source: Allows you to change the status of the selected message to one of the following states:
de: Erlaubt es Ihnen den Status der ausgewählten Nachricht auf einen der folgenden Werte zu setzen:

source: Meaning
de: Bedeutung

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>R</keycap></keycombo> </shortcut> <guimenuitem>Mark Message as Read</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>V</keycap></keycombo></shortcut> <guimenuitem>Nachricht als gelesen markieren</guimenuitem>

source: The message has been read.
de: Die Nachricht wurde gelesen.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>U</keycap></keycombo> </shortcut> <guimenuitem>Mark Message as Unread</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>Z</keycap></keycombo></shortcut> <guimenuitem>Nachricht als ungelesen markieren</guimenuitem>

source: The message has not been read yet.
de: Die Nachricht wurde noch nicht gelesen.

source: Mark Message as Important
de: Nachricht als wichtig markieren

source: This status will not automatically be set by &kmail;. You can use it freely to mark messages that are in some way important to you.
de: Dieser Status wird nicht automatisch von &kmail; gesetzt. Sie können ihn frei verwenden, um Nachrichten zu markieren, die in irgendeiner Weise wichtig für Sie sind.

source: Remove Important Mark
de: Wichtig-Markierung entfernen

source: Remove a previously set important flag from the message.
de: Entfernt eine vorher gesetzte Markierung „Wichtig“ von der Nachricht.

source: Mark Message as Action Item
de: Nachricht als „Aufgabe“ markieren

source: This status will not automatically be set by &kmail;. Use this to mark messages that are action items &eg; To-do list.
de: Dieser Status wird nicht automatisch von &kmail; gesetzt. Sie können ihn frei verwenden, um Nachrichten als Aktionen zu markieren, &eg; als Aufgabenlisten.

source: Remove Action Item Mark
de: „Aufgabe“-Markierung entfernen

source: Remove a previously set action item mark from the message.
de: Entfernt die vorher gesetzte am Aktionsmarkierung von der ausgewählten Nachricht.

source: <guimenu>Message</guimenu> <guisubmenu>Mark Thread</guisubmenu>
de: <guimenu>Nachricht</guimenu> <guisubmenu>Gruppe markieren</guisubmenu>

source: Allows you to change the status of all messages in a thread as follows:
de: Erlaubt es Ihnen, den Status aller Nachrichten in einer Gruppe auf einen der folgenden Werte zu setzen:

source: Mark Thread as Read
de: Gruppe als gelesen markieren

source: The entire thread has been read.
de: Alle Nachrichten der Gruppe wurden gelesen.

source: Mark Thread as Unread
de: Gruppe als ungelesen markieren

source: The thread has not been read yet.
de: Diese Gruppe wurde noch nicht gelesen.

source: Mark Thread as Important
de: Gruppe als wichtig markieren

source: This status will not automatically be set by &kmail;. You can use it freely to mark threads that are in some way important to you.
de: Dieser Status wird nicht automatisch von &kmail; gesetzt. Sie können ihn frei verwenden, um Gruppen von Nachrichten zu markieren, die in irgendeiner Weise wichtig für Sie sind.

source: Remove Important Thread Mark
de: Markierung „Wichtig“ der Gruppe entfernen

source: Remove a previously set important flag from the thread.
de: Entfernt eine vorher gesetzte Markierung „Wichtig“ von der Gruppe.

source: Mark Thread as Action Item
de: Gruppe als Aufgabe markieren

source: This status will not automatically be set by &kmail;. Use this to mark threads that are action items &eg; To-do list.
de: Dieser Status wird nicht automatisch von &kmail; gesetzt. Sie können ihn frei verwenden, um Gruppen als Aktionen zu markieren, &eg; als Aufgabenlisten.

source: Remove Action Item Thread Mark
de: Gruppen-Markierung „Aufgabe“ entfernen

source: Remove a previously set action item mark from the thread.
de: Entfernt eine vorher gesetzte Markierung „Aufgabe“ von der Gruppe.

source: Watch Thread
de: Gruppe überwachen

source: Set the watched thread status, which allows you to easily view threads your interested in by selecting <guimenu>Watched</guimenu> status in the drop down box found into Quick Search Bar.
de: Setzt den Status der Gruppe auf <guilabel>Überwacht</guilabel>. Dann können Sie problemlos für Sie wichtige Gruppen anzeigen, wenn Sie in der Sortierleiste im Auswahlfeld den Status <guilabel>Überwacht</guilabel> einstellen.

source: Ignore Thread
de: Gruppe ignorieren

source: Allows you to ignore entire threads.
de: Ermöglicht das Ignorieren der gesamten Gruppe.

source: <guimenu>Message</guimenu> <guisubmenu>Create Filter</guisubmenu>
de: <guimenu>Nachricht</guimenu> <guisubmenu>Filter anlegen</guisubmenu>

source: <action>Opens up the <link linkend="filter-dialog-id">Filter dialog</link> with a new filter added.</action> This new filter is based on fields of the current mail, depending on which sub menu item you select from:
de: <action>Öffnet den Dialog <link linkend="filter-dialog-id">Filter</link> mit einem neuen Filter</action>. Dieser neue Filter basiert abhängig vom gewählten Untermenü auf Feldern der aktuellen Nachricht.

source: Filter on Subject...
de: Nach Betreff filtern...

source: Filter on From...
de: Nach Absender filtern ...

source: Filter on To...
de: Nach Empfänger filtern ...

source: Filter on Mailing-List...(currently selected mail must be a mailing list for this to be available)
de: Nach Mailinglisten filtern: nur verfügbar, wenn die aktuell ausgewählte E-Mail in einer Mailingliste ist.

source: <guimenu>Message</guimenu> <guimenuitem>Apply Filter</guimenuitem>
de: <guimenu>Nachricht</guimenu> <guimenuitem>Filter anwenden</guimenuitem>

source: <action>Allows you to <guimenuitem>Apply all Filters</guimenuitem>.</action> If you have spam filtering set up through <link linkend="the-anti-spam-wizard">Anti-Spam Wizard</link> the options <guimenuitem>Classify as Spam</guimenuitem> and <guimenuitem>Classify as NOT Spam</guimenuitem> will be available for spam filtering.
de: <action>Mit dieser Aktion können Sie <guimenuitem>Alle Filter anwenden</guimenuitem>.</action> Haben Sie Spam-Filterung mit dem <link linkend="the-anti-spam-wizard">Anti-Spam-Assistenten</link> eingerichtet haben, erscheinen auch die Einträge <guimenuitem>Als Spam klassifizieren</guimenuitem> und <guimenuitem>Als Nicht-Spam klassifizieren</guimenuitem> in diesem Untermenü.

source: <guimenu>Message</guimenu> <guimenuitem>Create To-do/Reminder</guimenuitem>
de: <guimenu>Nachricht</guimenu> <guimenuitem>Aufgabe/Erinnerung erstellen</guimenuitem>

source: <action>Brings up the &kontact; To-do/Reminder dialog</action> with options to add the selected email as a link, inline, or inline without attachments.
de: <action>Öffnet den Aufgaben-/Erinnerungsdialog von &kontact;</action> mit den Optionen, die ausgewählte E-Mail als Verknüpfung anzuhängen und mit oder ohne Anhänge in den Text einzufügen.

source: <guimenu>Message</guimenu> <guimenuitem>Add Note...</guimenuitem>
de: <guimenu>Nachricht</guimenu> <guimenuitem>Notiz hinzufügen</guimenuitem>

source: Brings up the &kontact; Note dialog to add a note to the selected email.
de: Öffnet einen Dialog zur Eingabe von Text, der als Notiz zur ausgewählten E-Mail hinzugefügt wird.

source: Tools Menu
de: Das Menü Extras

source: <shortcut> <keycap>S</keycap> </shortcut> <guimenu>Tools</guimenu> <guimenuitem>Find Messages...</guimenuitem>
de: <shortcut><keycap>S</keycap></shortcut> <guimenu>Extras</guimenu> <guimenuitem>Nachricht suchen ...</guimenuitem>

source: <guimenu>Tools</guimenu> <guimenuitem>Certificate Manager...</guimenuitem>
de: <guimenu>Extras</guimenu> <guimenuitem>Zertifikatsverwaltung ...</guimenuitem>

source: Starts <ulink url="help:kleopatra">&kleopatra;</ulink>, the &kde; certificate manager.
de: Startet <ulink url="help:kleopatra">&kleopatra;</ulink>, die Zertifikats-Verwaltung von &kde;.

source: <guimenu>Tools</guimenu> <guimenuitem>GnuPG Log Viewer</guimenuitem>
de: <guimenu>Extras</guimenu> <guimenuitem>GnuPG-Protokollanzeige</guimenuitem>

source: <action>Starts <ulink url="help:kwatchgnupg"><application>KWatchGnuPG</application></ulink>,</action> a tool to present the debug output of the <application>GnuPG</application> application. If signing, encryption, or verification mysteriously stop working, you might find out why by looking at this log.
de: <action>Startet <ulink url="help:kwatchgnupg"><application>KWatchGnuPG</application></ulink></action>, ein Hilfsprogramm, mit dem Sie die Ausgaben des Programms <application>GnuPG</application> verfolgen können. Wenn das Signieren, Verschlüsseln oder Überprüfen auf einmal mysteriöserweise nicht mehr funktioniert, können Sie so möglicherweise den Grund dafür herausfinden.

source: <guimenu>Tools</guimenu> <guisubmenu>Edit "Out of Office" Replies...</guisubmenu>
de: <guimenu>Extras</guimenu> <guisubmenu>Abwesenheitsbenachrichtigungen bearbeiten ...</guisubmenu>

source: <action>Launch the <guilabel>Configure "Out of Office" Replies</guilabel> dialog,</action> which allows you to set-up vacation notifications.
de: <action>Startet den Dialog zur Konfiguration der Antworten bei Abwesenheit</action>, wo Sie die entsprechenden Benachrichtigungen einstellen können.

source: <guilabel>Out of Office reply</guilabel> functionality relies on server-side filtering. To be able to use it you need to configure the <link linkend="receiving-mail">Filtering tab</link> (see option relevant to kolab server) of your &imap; account set-up.
de: Die Funktionalität Abwesenheitsbenachrichtigung beruht auf serverseitigen Filtern. Damit Sie diese Funktionalität verwenden können, müssen Sie die Seite <link linkend="receiving-mail">Filter</link> Ihres &imap;-Postfachs einrichten.

source: <guimenu>Tools</guimenu> <guisubmenu>Debug Sieve...</guisubmenu>
de: <guimenu>Extras</guimenu> <guisubmenu>Fehlersuche im Sieve-Filter ...</guisubmenu>

source: <action>Launch the <guilabel>Sieve Diagnostics</guilabel> dialog.</action> This is useful to debug sieve if you are having problems with it.
de: <action>Öffnet den Dialog <guilabel>Diagnose von Sieve</guilabel>.</action> Benutzen Sie diesen Dialog, um Probleme mit Sieve zu untersuchen.

source: You must have sieve support on your email server.
de: Diese Funktion benötigt die Unterstützung für Sieve auf Ihrem E-Mail-Server.

source: <guimenu>Tools</guimenu> <guisubmenu>Filter Log Viewer...</guisubmenu>
de: <guimenu>Extras</guimenu> <guisubmenu>Filterprotokoll anzeigen ...</guisubmenu>

source: <action>Opens up the viewer window for the filter log;</action> there you find some options to control the logging of the filtering process. In the log you will find valuable information about what filter rules were used, what was the result of the evaluation of those rules, and which filter actions were applied to a message.
de: <action>Öffnet das Anzeigefenster für das Filterprotokoll</action>. Hier finden Sie einige Optionen zur Steuerung des Filtervorgangs. Im Protokoll finden Sie wertvolle Informationen darüber, welche Filterregeln verwendet wurden, was das Ergebnis der Auswertung dieser Regeln war, und welche Filteraktionen auf eine Nachricht angewendet wurden.

source: <guimenu>Tools</guimenu> <guisubmenu>Import Wizard...</guisubmenu>
de: <guimenu>Extras</guimenu> <guisubmenu>Import-Assistent ...</guisubmenu>

source: <action>Brings up the Import Wizard dialog</action> which assists in easily importing settings and email. Please see <ulink url="help:/importwizard">Import Wizard</ulink> for details.
de: <action>Startet den Import-Assistenten</action>, der Sie beim Import von Einstellungen und E-Mails anderer Programme unterstützt. Weitere Informationen dazu im Handbuch zum <ulink url="help:/importwizard">Import-Assistent</ulink>.

source: <guimenu>Tools</guimenu> <guisubmenu>Export &kmail; Data...</guisubmenu>
de: <guimenu>Extras</guimenu> <guisubmenu>&kmail;-Daten exportieren ...</guisubmenu>

source: <action>Brings up the PIM Setting Exporter dialog</action> which assists in easily exporting your settings and email. Please see <ulink url="help:/pimsettingexporter">pimsettingexporter</ulink> for details.
de: <action>Startet den Dialog PIM-Einstellungs-Export</action>, der Sie beim Export von Einstellungen und E-Mails unterstützt. Weitere Informationen dazu im Abschnitt <ulink url="help:/pimsettingexporter">PIM-Einstellungs-Export</ulink>.

source: <guimenu>Tools</guimenu> <guisubmenu>Account Wizard...</guisubmenu>
de: <guimenu>Extras</guimenu> <guisubmenu>Postfach-Assistent ...</guisubmenu>

source: <action>Brings up the Account Wizard dialog</action> which assists in easily setting up accounts. Please see <link linkend="account-wizard">Account Wizard</link> for details.
de: <action>Startet den Postfach-Assistenten</action>, der Sie bei der Einrichtung eines Postfachs unterstützt. Weitere Informationen dazu im Abschnitt <link linkend="account-wizard">Postfach-Assistent</link>.

source: <guimenu>Tools</guimenu> <guimenuitem>Anti-Spam Wizard...</guimenuitem>
de: <guimenu>Extras</guimenu> <guimenuitem>Anti-Spam-Assistent ...</guimenuitem>

source: <action>Brings up the Anti-Spam Wizard</action> which can help you to set up spam filtering. Please see <link linkend="the-anti-spam-wizard">Anti-Spam Wizard</link> for details.
de: <action>Startet einen Assistenten</action>, der Ihnen bei der Einrichtung der Spam-Filter hilft. Weitere Informationen dazu im Abschnitt <link linkend="the-anti-spam-wizard">Anti-Spam-Assistent</link>.

source: <guimenu>Tools</guimenu> <guimenuitem>Anti-Virus Wizard...</guimenuitem>
de: <guimenu>Extras</guimenu> <guimenuitem>Anti-Virus-Assistent ...</guimenuitem>
