Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdepim/kmail_using-kmail.po
Languages: de

source: If you are using a key for the first time, there are conflicting Encryption Preferences, or if <guilabel>Always show the encryption keys for approval</guilabel> is selected in the <guilabel>Security</guilabel> section of &kmail;'s configuration dialog, the <guilabel>Encryption Key Approval</guilabel> dialog will appear; here, you can select different keys for the recipients and can set the <guilabel>Encryption Preference</guilabel> for each recipient. The default option, <guilabel>Encrypt whenever encryption is possible</guilabel>, will automatically encrypt your message if there is a trusted key for each recipient.
de: Falls man einen Schlüssel das erste Mal verwendet, widersprüchliche Verschlüsselungseinstellungen vorhanden sind oder man <guilabel>Wahl des Schlüssels für die Verschlüsselung immer bestätigen lassen</guilabel> im Einrichtungsdialog von &kmail; im Abschnitt <guilabel>Sicherheit</guilabel> auf der Karteikarte <guilabel>OpenPGP</guilabel> markiert hat, wird der Dialog <guilabel>Wahl des Verschlüsselungs-Schlüssels bestätigen</guilabel> angezeigt. Hier kann für die Empfänger ein anderer Schlüssel ausgewählt und außerdem für jeden Empfänger ein Primärer Schlüssel festgelegt werden. Die Standardeinstellung <guilabel>Möglichst immer verschlüsseln</guilabel> verschlüsselt jede Nachricht, bei der für alle Empfänger ein vertrauenswürdiger Schlüssel vorhanden ist.

source: As mentioned above, you will not be able to read your own encrypted sent messages if you do not check <guilabel>When encrypting emails, always also encrypt to the certificate of my own identity</guilabel> in the settings' <guilabel>Security</guilabel> page.
de: Weiter oben wurde bereits erwähnt, dass man nicht in der Lage ist, die verschlüsselte Nachricht wieder zu entschlüsseln, wenn man nicht bei den Einstellungen unter <guilabel>Sicherheit</guilabel> das Ankreuzfeld <guilabel>Beim Verschlüsseln von E-Mails auch immer für den eigenen Schlüssel verschlüsseln</guilabel> markiert hat.

source: Send your Public Key
de: Den öffentlichen Schlüssel versenden

source: Prepare a message to the person to whom you want to send your public key; then, choose, in the composer window's menu, <menuchoice><guimenu>Attach</guimenu><guimenuitem>Attach My Public Key</guimenuitem></menuchoice>: this will attach the public key you defined for the current identity to the message. Now you can send the message.
de: Man schreibt zunächst eine Nachricht an die Person, die den öffentlichen Schlüssel erhalten soll. Dann wählt man <menuchoice><guimenu>Anhängen</guimenu><guimenuitem>Öffentlichen Schlüssel anhängen ...</guimenuitem></menuchoice> im Editor-Fenster. Damit wird der für diese Identität festgelegte öffentliche Schlüssel an die Nachricht angefügt. Nun kann man die Nachricht abschicken.

source: Remember that it is not safe at all if you sign the message to make sure that the receiver will get the correct key: there can be a man-in-the-middle attack, as somebody can change the key and sign the message with that other key. That is why the recipient should verify the attached key by checking the key's fingerprint against the one he received in a secure way from you; have a look at the <application>GnuPG</application> documentation for further details.
de: Man sollte daran denken, das die Signierung der Nachricht kein verlässlicher Weg ist, den Schlüsselversand abzusichern. Die Nachricht kann auf dem Weg abgefangen werden (<quote>man-in-the-middle</quote>-Attacke) und von einer Person mit einem falschen Schlüssel versehen und mit diesem falschen Schlüssel auch signiert werden. Daher sollte der Schlüsselempfänger die Signatur mit einer Signatur vergleichen, die er auf einem sicheren Weg erhalten hat. Genauere Hinweise dazu findet man in der Dokumentation zu <application>GnuPG</application>.

source: You received an encrypted Message
de: Empfang einer verschlüsselten Nachricht

source: All you have to do is to select the message in &kmail;. You will be prompted for your passphrase; then, &kmail; will try to decrypt the message and show you the plain text if the message had been encrypted with your public key: if not, then you will not be able to read it. &kmail; stores the messages encrypted, so nobody can read these messages without knowing your passphrase.
de: Man muss lediglich die Nachricht in &kmail; auswählen. Dann wird man nach dem Passwort gefragt. &kmail; versucht nun, die Nachricht zu entschlüsseln und zeigt danach den unverschlüsselten Text, wenn die Nachricht mit dem öffentlichen Schlüssel verschlüsselt worden ist (falls nicht, ist das Ergebnis unleserlich). &kmail; speichert diese Nachricht verschlüsselt ab, sodass niemand ohne Passwort die Nachricht lesen kann.

source: Receiving a Public Key
de: Einen öffentlichen Schlüssel erhalten

source: You can receive a public key as an attachment or via http, ftp or a floppy. Before you can use this key to encrypt a message to the owner of the key, you should verify the key (check its fingerprint or look for trusted signatures); then, you can add this key to your public keyring by typing <userinput><command>gpg</command> <option>--import</option> <replaceable>filename</replaceable></userinput> at the command line. If the key is not certified with a trusted signature you cannot use it to encrypt messages unless you have signed the key with your key.
de: Sie können einen öffentlichen Schlüssel als Anhang oder per http, ftp oder Diskette erhalten. Bevor Sie diesen Schlüssel benutzen, um eine Nachricht an den Besitzer zu verschlüsseln, sollten Sie den Schlüssel überprüfen (Überprüfen Sie den Fingerabdruck oder schauen Sie nach vertrauenswürdigen Signaturen). Danach können Sie den Schlüssel Ihrem Schlüsselbund hinzufügen, indem Sie folgendes eingeben auf der Befehlszeile eingeben: <application>GnuPG</application> <userinput><command>gpg</command><option>--import</option><replaceable> Dateiname</replaceable></userinput>. Falls der Schlüssel keine vertrauenswürdige Signatur enthält, können Sie &kmail; nicht benutzen, um Nachrichten damit zu verschlüsseln, es sei denn Sie signieren den Schlüssel mit dem eigenen Schlüssel.

source: The Anti-Spam Wizard
de: Der Anti-Spam-Assistent

source: Basics
de: Grundlagen

source: &kmail; does not have a built-in spam detection solution: the developers believe using external, but specialized, tools is the better approach. &kmail; uses these tools through its flexible filter architecture. The Anti-Spam Wizard helps you with the initial filter setup.
de: &kmail; besitzt keine eingebaute Funktion zur Erkennung unerwünschter Mails. Die Entwickler sind der Überzeugung, dass die Verwendung externer, spezialisierter Werkzeuge die bessere Lösung ist. &kmail; verwendet diese Werkzeuge über seine flexible Filterarchitektur. Der Assistent für Spam-Filter hilft Ihnen bei der anfänglichen Einrichtung der Filter.

source: What can the wizard do to help you?
de: Wie kann der Assistent Ihnen helfen?

source: It will give you some choices about how you want the spam filtering to be set up. Afterwards it will automatically create the appropriate filter rules.
de: Er bietet Ihnen einige Auswahlmöglichkeiten an, wie Sie das Filtern von Spam einrichten wollen. Danach richtet er automatisch die passenden Filterregeln ein.

source: What are the limitations of the wizard?
de: Welche Einschränkungen hat der Assistent?

source: It can only initially set up the filters for you; and it will provide a standard setup. Manual modifications in existing filters are not considered. Instead, these filters are overwritten by the wizard.
de: Er kann die Filter nur einmal einrichten und eine Standardkonfiguration bereitstellen. Das Modifizieren existierender Filter ist noch nicht möglich. Stattdessen werden diese Filter vom Assistenten überschrieben.

source: You can activate the wizard via <menuchoice><guimenu>Tools</guimenu> <guisubmenu>Anti-Spam Wizard...</guisubmenu></menuchoice>.
de: Sie starten den Assistenten über <menuchoice><guimenu>Extras</guimenu><guimenuitem>Anti-Spam-Assistent ...</guimenuitem></menuchoice>.

source: The wizard scans for known anti-spam tools on your computer. It is also possible to use the results of spam checks made by your service provider by evaluating header information which has been added to the messages. You can let the wizard prepare &kmail; to use one or more of these in parallel. However, note that anti-spam tool operations are usually time consuming. &kmail; can appear to be frozen during the scan of messages for spam; you may encounter problems with the responsiveness of &kmail;. Please consider deleting the filter rules created by the wizard if the filtering becomes too slow for you. Here are some recommendations regarding the supported tools:
de: Der Assistent sucht auf Ihrem Computer nach bekannten Werkzeugen zur Erkennung unerwünschter Nachrichten. Darüber hinaus können Sie die Ergebnisse einer Erkennung durch Ihren Provider nutzen, indem Vorspanninformationen ausgewertet werden, die zu diesem Zweck vom Provider hinzugefügt wurden. Sie können &kmail; mit dem Assistenten für eine oder mehrere Werkzeuge gleichzeitig einrichten. Bedenken Sie aber, dass die Erkennung unerwünschter E-Mails gewöhnlich zeitaufwendig ist. Während des Erkennungsvorgangs kann &kmail; leicht unbedienbar werden. Wenn der Filtervorgang für Sie zu langsam wird, sollten Sie das Löschen der vom Assistenten erstellen Regeln in Erwägung ziehen. Hier sind einige Empfehlungen bezüglich der unterstützten Werkzeuge:

source: Bogofilter is a bayesian filter, that means its spam detection relies on an initial training phase. On the other hand, it's a pretty fast tool. That's why it is recommended to be used by people who primarily want to have fast spam detection, and who won't worry about the initial training before the detection rate increases significantly.
de: Bogofilter ist ein Bayesian-Filter. Das bedeutet die Erkennung unerwünschter E-Mails erfordert zu Beginn eine Lernphase. Anderseits ist dieses Programm sehr schnell. Darum wird es für Anwender empfohlen, die Wert auf eine schnelle Erkennung unerwünschter Mails legen und denen die kurze Lernphase zu Beginn nichts ausmacht.

source: SpamAssassin is a pretty complex tool to use against spam. Although its behavior depends heavily on its configuration, it can detect spam quite well without any training. However, scanning a message takes a little longer compared to pure bayesian filters. Let's say it's not the tool of choice for people without some background information about SpamAssassin's capabilities.
de: SpamAssassin ist ein hochkomplexes Werkzeug gegen unerwünschte E-Mails. Auch wenn sein Verhalten sehr stark von der Konfiguration abhängt, kann dieses Werkzeug auch ohne Lernphase eine hohe Erkennungsrate erzielen. Allerdings dauert der Erkennungsvorgang etwas länger als bei reinen Bayesian-Filtern. Sagen wir so: es ist nicht das Werkzeug der Wahl für Leute ohne Hintergrundwissen über die Möglichkeiten von SpamAssassin.

source: Perhaps not so often used until distributions pick it up. It's clearly a tool for specialists.
de: Wahrscheinlich nur selten verwendet, wenn die Distributionen es nicht irgendwann aufnehmen. Es ist ganz klar ein Werkzeug für Spezialisten.

source: If you get your mail via the GMX freemail provider, your messages are already scanned for spam. The result of that process is documented in a special header field of each message. It's possible to use the content of this header field to sort out spam. There is no slowdown in the filtering if only this tool is used, as the messages have already been processed.
de: Wenn Sie Ihre E-Mails über den Provider GMX-Freemail erhalten, sind diese bereits auf unerwünschte E-Mails durchsucht. Das Ergebnis dieses Vorgangs ist für jede Nachricht in einer speziellen Vorspannzeile abgelegt. Es ist möglich den Inhalt dieser Vorspannzeile zum Ausfiltern von unerwünschten E-Mails zu verwenden. Wenn Sie nur dieses Werkzeug verwenden, entstehen keine Geschwindigkeitseinbußen, da die Nachrichten bereits durchsucht wurden.

source: Advanced
de: Weitergehende Informationen

source: Here are the details of how the wizard works: &kmail; can use several external tools to detect spam messages; it will try to automatically find out which tools are installed on your system and will show you these in a list. The list is ordered by the average speed of the filtering process of the tools. You can mark the tools which you want to be used by &kmail; to detect spam. Of course, you can close the wizard, install a new tool, and restart the wizard again.
de: So funktioniert der Assistent: &kmail; kann verschiedene externe Werkzeuge verwenden, um unerwünschte E-Mails zu entdecken, und versucht automatisch herauszufinden, welche dieser Werkzeuge auf Ihrem Rechner installiert sind. Diese werden Ihnen in einer Liste angezeigt. Die Liste ist nach der durchschnittlichen Schnelligkeit des Filtervorgangs sortiert. Sie können die gewünschten Werkzeuge markieren; Natürlich können Sie den Assistenten schließen, ein neues Werkzeug installieren und den Assistenten dann neu starten.

source: If you have marked at least one tool, &kmail; is able to provide filters which allow the classification of the messages as spam or not spam. It will also provide actions to let you manually classify messages. These actions will be available via the menu and toolbar icons. If any of the tools you selected support Bayesian filtering (&ie; a method to detect spam based on statistical analysis of the messages) then these messages are not only marked but additionally transferred to the tools to enable them to learn thereby improving their detection rate.
de: Wenn Sie zumindest ein Werkzeug markiert haben, ist &kmail; in der Lage Filter anzubieten, die die Einordnung von Nachrichten als erwünscht oder unerwünscht ermöglichen. Darüber hinaus erhalten Sie die Möglichkeit Nachrichten manuell einzuordnen. Diese Aktionen sind über das Menü und die Werkzeugleiste verfügbar. Unterstützt eines der ausgewählten Werkzeuge Baysian-Filterung (eine Methode zur Erkennung unerwünschter E-Mails basierend auf einer statistischen Auswertung der Nachrichten), werden die Nachrichten nicht nur markiert sondern auch zum Lernen an die Werkzeuge übergeben, damit diese ihre Erkennungsrate verbessern können.

source: On the second page, you will be able to select some additional actions to be performed in &kmail; with regard to spam messages: if you want messages detected as spam to be moved into a certain folder, select the appropriate folder and mark the <guilabel>Move known spam to:</guilabel> option; if messages detected as spam should additionally be marked as read, then mark the <guilabel>Mark detected spam messages as read</guilabel> option.
de: Auf der zweiten Seite können Sie weitere in &kmail; durchzuführende Aktionen bezüglich unerwünschter Mails auswählen: wenn als unerwünscht erkannte Nachrichten in einen bestimmten Ordner verschoben werden sollen, wählen Sie den gewünschten Ordner aus und markieren Sie das Ankreuzfeld <guilabel>Erkannte unerwünschte Nachrichten verschieben nach</guilabel>. Wenn als unerwünscht erkannte Nachrichten zusätzlich als gelesen markiert werden sollen, kreuzen Sie die Einstellung <guilabel>Erkannte unerwünschte Nachrichten als gelesen markieren</guilabel> an.

source: Selecting at least one of the available tools will allow the wizard to finish the filter setup. The wizard will not take any modifications in existing filters, formerly created by it, into consideration but will either append new filters or replace existing filters. In any case you may want to inspect the result of this process in the <link linkend="filter-dialog">Filter Dialog</link>. The wizard will also create toolbar buttons for marking messages as spam or as ham; keep in mind that classifying messages as spam will also move those messages to the folder you had specified for spam messages, if you have selected the appropriate option.
de: Wenn Sie zumindest eines der angebotenen Werkzeuge ausgewählt haben, können Sie den Assistenten die Filtereinrichtung abschließen lassen. Der Assistent berücksichtigt existierende Filterregeln nicht, sondern hängt auf jeden Fall neue Regeln an oder ersetzt existierende Filter; Sie sollten das Ergebnis daher im <link linkend="filter-dialog">Filter-Dialog</link> kontrollieren. Wenn Sie die Option <guilabel>Nachrichten von Hand als SPAM/HAM klassifizieren</guilabel> angekreuzt haben, erzeugt der Assistent entsprechende Symbole in der Werkzeugleiste, mit denen Sie Nachrichten als Spam oder als Ham klassifizieren können. Denken Sie dabei daran, dass das Klassifizieren von Nachrichten als Spam diese auch in den Ordner verschiebt, den Sie für unerwünschte Nachrichten angegeben haben.

source: Some More Details for Experts
de: Einige weitere Einzelheiten für Experten

source: The wizard uses information stored in a special configuration file named <filename>kmail.antispamrc</filename> (stored in the global or local &kde; config directory). It will first check the global config file and then the local config file: if the local config file contains entries with higher (newer) version numbers per-tool the configuration data from the local file for that tool is used; that way, both administrators and users can update the wizard configuration.
de: Der Assistent speichert seine Informationen in einer speziellen Konfigurationsdatei namens <filename>kmail.antispamrc</filename> (die im globalen oder lokalen Konfigurationsverzeichnis von &kde; abgelegt wird). Zunächst wird die globale Konfigurationsdatei und danach die lokale durchsucht. wenn die lokale Konfigurationsdatei Einträge mit höheren (neueren) Versionsnummern pro Werkzeug enthält, dann werden für dieses Werkzeug die Konfigurationsdaten aus der lokalen Datei verwendet; auf diese Weise können sowohl Administratoren als auch Benutzer die Konfiguration des Assistenten aktualisieren.

source: The local detection of spam messages is achieved by creating <guilabel>pipe through</guilabel> actions per-tool within a special filter. Another filter contains rules to check for detected spam messages and actions to mark them and (optionally, depending on the choice in the wizard) to move them into a folder. Both filters are configured to be applied on incoming messages and on manual filtering.
de: Die Erkennung unerwünschter Nachrichten funktioniert durch das Anlegen von Aktionen des Typs <guilabel>Durch Programm leiten</guilabel> für jedes Werkzeug in einem speziellen Filter. Ein weiterer Filter enthält Regeln, mit denen erkannte unerwünschte Nachrichten markiert und (optional, je nach Einstellung im Assistenten) in einen Ordner verschoben werden. Beide Filter werden so eingerichtet, dass sie sowohl für eingehende Nachrichten als auch bei manueller Filterung verwendet werden.

source: Two filters are needed for the classification of ham and spam. They contain actions to mark the messages appropriately. As mentioned above, the filter for classification as spam can have another supplementary action to move the messages into a predefined folder. If the selected tools support Bayesian filtering, the wizard will create additional filter actions to pass the messages to the tools (via <guilabel>execute command</guilabel> actions) in the appropriate learning mode.
de: Für die Klassifikation von Ham und Spam werden zwei Filter benötigt. Sie enthalten Aktionen, um die Nachrichten entsprechend zu kennzeichnen. Wie oben erwähnt, kann der Filter zur Klassifikation als Spam eine weitere Aktion enthalten, mit der die Nachricht in einen festgelegten Ordner verschoben wird. Wenn die ausgewählten Werkzeuge Bayes-Filterung unterstützen, erzeugt der Assistent zusätzliche Filteraktionen, um die Nachrichten im jeweiligen Lern-Modus an die Werkzeuge zu übergeben (Aktion vom Typ <guilabel>Befehl ausführen</guilabel>).

source: If you want to fine-tune the filtering process, you might be interested in the chapter about <link linkend="filter-optimization">Filter Optimization</link>.
de: Wenn Sie den Filtervorgang verfeinern wollen, sollten Sie das Kapitel <link linkend="filter-optimization">Filter-Optimierung</link> lesen.

source: The Anti-Virus Wizard
de: Der Anti-Virus-Assistent

source: &kmail; does not have a built-in virus detection solution: the developers believe using external, but specialized, tools is the better approach. &kmail; uses these tools through its flexible filter architecture. The Anti-Virus Wizard helps you with the initial filter setup.
de: &kmail; enthält keine eingebaute Viruserkennung; die Entwickler sind der Meinung, dass externe spezialisierte Werkzeuge die bessere Lösung sind. &kmail; verwendet diese Werkzeuge über seine flexible Filterarchitektur. Der Assistent für Anti-Virus hilft Ihnen bei der anfänglichen Einrichtung dieser Filter.

source: It will give you some choices about how you want virus filtering to be set up. Afterwards it will automatically create the appropriate filter rules.
de: Sie bekommen einige Auswahlmöglichkeiten, wie die Virus-Filterung eingerichtet werden soll. Anschließend werden die nötigen Filterregeln automatisch erzeugt.

source: It can only initially set up the filters for you; and it will provide a standard setup. Modifying existing filters is not yet possible.
de: Er kann die Filter nur einmal einrichten und eine Standardkonfiguration bereitstellen. Das Modifizieren existierender Filter ist noch nicht möglich.

source: You can activate the wizard via <menuchoice><guimenu>Tools</guimenu> <guisubmenu>Anti-Virus Wizard...</guisubmenu></menuchoice>.
de: Sie starten den Assistenten über <menuchoice><guimenu>Extras</guimenu><guimenuitem>Anti-Virus-Assistent</guimenuitem></menuchoice>.

source: The Anti-Virus Wizard basically works exactly as the <link linkend="the-anti-spam-wizard">Anti-Spam Wizard</link> does. Here are the details of how the wizard works: &kmail; can use several external tools to detect messages containing viruses; it will try to automatically find out which of these tools are installed on your system and will show you the result of the search. You can mark the tools which you want to be used by &kmail; to detect viruses. Of course, you can close the wizard, install a new tool, and restart the wizard again.
de: Der Anti-Virus-Assistent funktioniert im Großen und Ganzen wie der <link linkend="the-anti-spam-wizard">Anti-Spam-Assistent</link>: &kmail; kann mehrere externe Werkzeuge verwenden, um Nachrichten zu erkennen, die Viren enthalten. Die auf Ihrem System installierten Werkzeuge werden automatisch erkannt und angezeigt. Sie können die Werkzeuge, mit denen Sie &kmail; nach Viren suchen lassen wollen, markieren. Natürlich können Sie den Assistenten beenden, ein Werkzeug installieren und den Assistenten erneut starten.
