Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdepim/kmail_faq.po
Languages: de

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Matthias</firstname><surname>Kiefer</surname> <affiliation><address><email>matthias.kiefer@gmx.de</email></address></affiliation> <contrib>Deutsche Übersetzung</contrib></othercredit> <othercredit role="translator"><firstname>Alexander</firstname><surname>Gretencord</surname> <affiliation><address><email>arutha@gmx.de</email></address></affiliation> <contrib>Überarbeitung</contrib></othercredit> <othercredit role="translator"><firstname>Frank</firstname><surname>Schütte</surname> <affiliation><address><email>F.Schuette@t-online.de</email></address></affiliation> <contrib>Überarbeitung ab Version 1.3</contrib></othercredit><othercredit role="translator"><firstname>Matthias Kalle</firstname><surname>Dalheimer</surname> <affiliation><address><email>kalle@kdab.net</email></address></affiliation> <contrib>Krypto-Übersetzung</contrib></othercredit>

source: Frequently Asked Questions (&FAQ;)
de: Häufig gestellte Fragen (Frequently Asked Questions &FAQ;)

source: How to set Firefox as your default browser?
de: Wie stelle ich Firefox als meinen Standard-Browser ein?

source: You want to click on a link in &kmail; and have it opened in <application>Firefox</application>. At the moment, another browser is used. You want to change this.
de: Sie möchten eine Verknüpfung in &kmail; mit dem Programm <application>Firefox</application> öffnen. Zurzeit wird ein anderer Browser benutzt, das möchten Sie ändern.

source: This solution will affect all of &kde;, not just &kmail;. Start <menuchoice><guimenu>&systemsettings;</guimenu><guisubmenu>Default Applications</guisubmenu><guimenuitem>Web Browser</guimenuitem><guimenuitem>Open http and https &URL;s in the following browser</guimenuitem><guimenuitem>firefox</guimenuitem></menuchoice>.
de: Die Änderung des Standard-Browsers betrifft Ihr gesamtes &kde;-System, nicht nur &kmail;. Öffnen Sie in den &systemsettings; die <guilabel>Standard-Komponenten</guilabel> und geben auf der Seite <guilabel>Webbrowser</guilabel> für <guilabel>Adressen öffnen, die mit http oder https beginnen</guilabel> <application>firefox</application> ein.

source: If you are an administrator and want to set this setting automatically for your users, it is
de: Möchten Sie als Systemverwalter diese Einstellung automatisch für alle Benutzer einstellen, müssen Sie folgendes ändern:

source: in your user directory in <filename>$(kde4-config --localprefix)/share/config/kdeglobals</filename> add the line <userinput>BrowserApplication[$e]=!firefox</userinput> under category <guilabel>[General]</guilabel>
de: Fügen Sie im Persönlichen Ordner der Benutzer in <filename>$(kde4-config --localprefix)/share/config/kdeglobals</filename> die Zeile <userinput>BrowserApplication[$e]=!firefox</userinput> in der Kategorie <guilabel>[General]</guilabel> ein.

source: You can also use the script in <ulink url="http://userbase.kde.org/Special:myLanguage/Tutorials/Modify_KDE_Software_Defaults">Tutorials/Modify_KDE_Software_Defaults</ulink>
de: Sie können außerdem auch das Skript <ulink url="http://userbase.kde.org/Special:myLanguage/Tutorials/Modify_KDE_Software_Defaults">Tutorials/Modify KDE Software Defaults</ulink> benutzen.

source: How to control your Roaming profile's connection?
de: Wie steuere ich die Verbindung für ein Roaming-Profil?

source: You set up a <emphasis>Roaming profile</emphasis> to access your home server while you are on the road, but it keeps trying to connect even when you are at home. Auto-connection is disabled in the setup screens.
de: Sie haben ein <emphasis>Roaming-Profil</emphasis>, um von unterwegs auf Ihren Server zuzugreifen. Die Verbindung erfolgt aber auch über das Roaming-Profil, wenn Sie direkt am Netzwerk angeschlossen sind. Die automatische Verbindung ist in den Einstellungen abgeschaltet.

source: <menuchoice><guimenu>Settings</guimenu><guisubmenu>Configure KMail</guisubmenu><guimenuitem>Accounts</guimenuitem><guimenuitem>Receiving (tab)</guimenuitem><guimenuitem>(select the account to exclude)</guimenuitem><guimenuitem>Retrieval Options</guimenuitem></menuchoice>, uncheck <guilabel>Include in Manual Mail Check</guilabel>. This will exclude the profile when you hit the download icon, but the profile will still be available from the drop-down list, making it easy to get your mail while away from home.
de: Gehen Sie im Einrichtungsdialog von &kmail; auf der Seite <guilabel>Zugänge</guilabel> zur Karteikarte <guilabel>Empfang</guilabel>. Öffnen Sie die <guilabel>Abrufeinstellungen</guilabel> der betroffenen Ressource und schalten Sie <guilabel>Bei manueller Prüfung einbeziehen</guilabel> ab. Wenn Sie nun im Hauptfenster <guilabel>Nach E-Mail sehen</guilabel> auswählen, ist diese Ressource nicht eingeschlossen. Um sie von unterwegs zu benutzen, wählen Sie sie aus dem Untermenü von <guilabel>Nach E-Mail sehen in</guilabel> direkt aus.

source: How to store sent mails in a special folder?
de: Wie speichere ich gesendete E-Mails in einem speziellen Ordner?

source: <emphasis>Symptom:</emphasis> You want to store mails in a special folder. Maybe you are using an &imap; server and want to store your mails on the server, not in the client.
de: <emphasis>Problem</emphasis>: Sie möchten E-Mails in einem bestimmten Ordner speichern. Sie benutzen zum Beispiel einen &imap;-Server und möchten die gesendeten E-Mails auf dem Server und nicht auf dem Rechner speichern.

source: <emphasis>Solution:</emphasis> In &kmail;, choose <menuchoice><guimenu>Settings</guimenu><guisubmenu>Configure KMail</guisubmenu><guimenuitem>Identities</guimenuitem><guimenuitem>(Choose an identity)</guimenuitem><guimenuitem>Modify</guimenuitem><guimenuitem>Advanced</guimenuitem><guimenuitem>Sent-mail folder</guimenuitem></menuchoice>
de: <emphasis>Lösung</emphasis>: Gehen Sie im Einrichtungsdialog von &kmail; auf der Seite <guilabel>Identitäten</guilabel>. Wählen Sie die richtige Identität aus und drücken Sie auf den Knopf <guilabel>Bearbeiten</guilabel>. Im Dialog wählen Sie dann auf der Karteikarte <guilabel>Erweitert</guilabel> den gewünschten Ordner für <guilabel>Versendete Nachrichten</guilabel> aus.

source: How to store trash mails in a special folder?
de: Wie speichere ich gelöschte E-Mails in einem speziellen Ordner?

source: <emphasis>Symptom:</emphasis> You want to store mails in a special folder. Maybe you are using an &imap; server and want Trashed mails to be stored on the server, not in the client.
de: <emphasis>Problem</emphasis>: Sie möchten E-Mails in einem bestimmten Ordner speichern. Sie benutzen zum Beispiel einen &imap;-Server und möchten die gelöschten E-Mails auf dem Server und nicht auf dem Rechner speichern.

source: In the settings dialog select an &imap; account on the <guilabel>Accounts</guilabel> page. Click on <guibutton>Modify</guibutton> and change the trash folder location on the <guilabel>Advanced</guilabel> tab.
de: Im Einstellungsdialog wählen Sie ein &imap;-Postfach auf der Seite <guilabel>Zugänge</guilabel>. Klicken Sie auf <guibutton>Ändern</guibutton> und ändern Sie den Ordner für den Papierkorb auf der Karteikarte <guilabel>Erweitert</guilabel>.

source: How to store encrypted mails as unencrypted?
de: Wie speichere ich verschlüsselte E-Mails im Klartext?

source: <emphasis>Symptom:</emphasis> You exchange encrypted mail with a friend, but would like to store it unencrypted, once you have opened the message.
de: <emphasis>Problem</emphasis>: Sie erhalten verschlüsselte E-Mails und möchten Sie unverschlüsselt im Klartext speichern, nachdem Sie sie gelesen haben.

source: <emphasis>Solution:</emphasis> To store emails that have been decrypted once in unencrypted format henceforth, add this to your <filename>kmail2rc</filename> configuration file, in the [Reader] section:
de: <emphasis>Lösung</emphasis>: Um bereits entschlüsselte Dateien unverschlüsselt im Klartext zu speichern, fügen Sie folgendes zum Abschnitt [Reader] in Ihrer Einrichtungsdatei <filename>kmail2rc</filename> hinzu:

source: This may only work with <emphasis>SMIME</emphasis> but implementation for <emphasis>OpenPGP</emphasis> is being worked on.
de: Dies funktioniert zurzeit nur mit <emphasis>SMIME</emphasis>, an der Unterstützung für <emphasis>OpenPGP</emphasis> wird noch gearbeitet.

source: How to filter spam on an &imap; server?
de: Wie kann ich Spam auf einem &imap;-Server filtern?

source: <emphasis>Symptom:</emphasis> You intend moving on to reading your mail from an &imap; server, and wonder how filtering and spam handling will occur?
de: <emphasis>Problem</emphasis>: Sie möchten in Zukunft die E-Mails auf einem &imap;-Server lesen, und möchten wissen, wie Filtern und Spam-Bearbeitung funktioniert.

source: <emphasis>Solution:</emphasis> The machine that already has your mail can become your &imap; server. You will need to configure a server application. <guilabel>Dovecot</guilabel> is one such, and the guidance on the project web pages make it easy to set up. That still leaves you with the problem of filtering, as it makes sense to do it on the server (when you point &kmail; at the server you will see the folders that you have created on the server). Again there are options, but one of the best known is <guilabel>procmail</guilabel>. Again there is plenty of information on the Internet on how to set this up. You give it a set of <quote>recipes</quote> - here's an example:
de: <emphasis>Lösung</emphasis>: Der Rechner auf dem sich bereits Ihre E-Mails befinden, kann der neue &imap;-Server werden. Dazu müssen Sie ein Serverprogramm wie <guilabel>Dovecot</guilabel> installieren und einrichten. Anleitungen finden Sie auf der Projektseite. Nun müssen Sie noch das Filtern einrichten, das sollte natürlich auf dem Server stattfinden. Wenn Sie in &kmail; den Server als Ressource einstellen, sehen Sie alle Ordner, die Sie auf dem Server erstellt haben. Eines der besten Programme für die Filterung ist <guilabel>procmail</guilabel>. Zu diesem Programm finden Sie viele Informationen im Internet. Diesem Programm übergeben Sie eine Reihe von Anweisungen wie in diesem Beispiel:

source: If you have <emphasis>maildir</emphasis> folders, each recipe must end with a <quote>/</quote>. If your folders are <emphasis>mbox</emphasis>, just omit the <quote>/</quote>
de: Für <emphasis>maildir</emphasis>-Ordner muss jede Anweisung mit <quote>/</quote> abgeschlossen werden. Benutzen Sie <emphasis>mbox</emphasis>-Ordner, lassen Sie das Zeichen <quote>/</quote> am Ende weg.

source: If you have been using <guilabel>bogofilter</guilabel> with &kmail; you will already have a <emphasis>wordlist</emphasis>. This can be used at server level, too, so you will not have to start training from scratch. The trick is to set this before the <guilabel>procmail</guilabel> recipes:
de: Benutzen Sie bereits <guilabel>bogofilter</guilabel> mit &kmail;. dann haben Sie bereits eine <emphasis>Wortliste</emphasis>. Diese können Sie auch auf dem Server verwenden, damit Sie mit dem Training nicht von vorn beginnen müssen. Dazu müssen Sie diese Liste vor den Anweisungen für <guilabel>procmail</guilabel> setzen.

source: Note that it is going to use a mailbox for spam and one for unsure - I add a 'a-' to the name to ensure that they are easily seen, at the top of the list.
de: Beachten Sie dass hier einen E-Mailordner für „Spam“ und einer für „Unsure“ benutzt wird. Beiden Ordnernamen ist ein „a-“ vorangestellt, damit oben in der Liste leicht zu finden sind.

source: Finally, to improve performance, run the following command occasionally on saved spam and unsures:
de: Um die Leistungsfähigkeit der Filter zu erhöhen, starten Sie gelegentlich den folgenden Befehl für die Ordner „Spam“ und „Unsure“:

source: (don't forget to check the path.)
de: Bitte überprüfen Sie den Pfad.

source: This is not a complete guide to setting up a server, but notes on how to set up the server to work as you expect in &kmail;.
de: Dies ist nur eine kürze Einführung, keine vollständige Anleitung, um einen Server für &kmail; mit diesen Funktionen einzurichten.

source: How to get more screen space in &kmail;?
de: Wie nutze ich den Platz im Fenster von &kmail; besser aus?

source: <emphasis>Symptom:</emphasis> You are using &kmail; on a netbook, and find that the new <emphasis>Aggregation</emphasis> display leaves you little screen space
de: <emphasis>Problem</emphasis>: Sie benutzen &kmail; auf einem Netbook und stellen fest, dass die neue Anzeige der <emphasis>Zusammenstellung</emphasis> zuviel Platz benötigt.

source: <emphasis>Solution:</emphasis>If you want to change the look so that a mail uses a single row instead of two rows, go to <menuchoice><guimenu>View</guimenu><guisubmenu>Message List</guisubmenu><guimenuitem>Theme</guimenuitem></menuchoice> and change the theme to <guilabel>Classic</guilabel>. If you want to disable grouping by date, change the aggregation using <menuchoice><guimenu>View</guimenu><guisubmenu>Message List</guisubmenu><guimenuitem>Aggregation</guimenuitem></menuchoice> to <guilabel>Standard Mailing List</guilabel>. Now your &kmail; will look exactly like it did in earlier versions.
de: <emphasis>Lösung</emphasis>: Wenn Sie für die Ansicht der E-Mail in der Nachrichtenliste nur eine statt zwei Zeilen verwenden möchten, wählen Sie im Menü <menuchoice><guimenu>Ansicht</guimenu><guisubmenu>Nachrichtenliste</guisubmenu> <guimenuitem>Design</guimenuitem></menuchoice>. Ändern Sie das Design zu <guilabel>Klassisch</guilabel>. Möchten Sie die Gruppierung nach Datum ausschalten, ändern Sie die Zusammenstellung mit <menuchoice><guimenu>Ansicht</guimenu><guisubmenu>Nachrichtenliste</guisubmenu> <guimenuitem>Zusammenstellung</guimenuitem></menuchoice> auf <guilabel>Standard-Nachrichtenliste</guilabel>. Dann wird die Nachrichtenliste wie in früheren Versionen von &kmail; angezeigt.

source: In <menuchoice><guimenu>Settings</guimenu><guisubmenu>Configure KMail</guisubmenu><guimenuitem>Appearance</guimenuitem><guimenuitem>Fonts</guimenuitem></menuchoice> you can select <guilabel>Use custom fonts</guilabel> and change the setting for each component in the list. This is when you discover that your folder list and the message bodies do use the fonts you want, but the message list still has too large a font.
de: Gehen Sie im Einrichtungsdialog von &kmail; auf der Seite <guilabel>Erscheinungsbild</guilabel> zur Karteikarte <guilabel>Schriftarten</guilabel>. Aktivieren Sie <guilabel>Eigene Schriftarten benutzen</guilabel>. Dann können Sie für jeden Bestandteil einer Nachricht Schriftart, -stil und -größe nach Ihren Wünschen einstellen.

source: You can make the font changes by right-clicking on the Message List headers, and selecting <menuchoice><guimenu>Theme</guimenu><guisubmenu>Configure</guisubmenu><guimenuitem>Appearance</guimenuitem></menuchoice> tab. Each one of those column headers needs to be clicked on, and your new custom font set. At the end of this, the message list will display in the same font as the rest of your layout.
de: Zur Änderung der Schriftarten klicken Sie mit der &RMB; auf die Vorspannzeile der Nachrichtenliste und wählen dann aus dem Kontextmenü <menuchoice><guimenu>Design</guimenu><guisubmenu>Einrichten</guisubmenu></menuchoice>. Auf der Karteikarte <guilabel>Erscheinungsbild</guilabel> müssen Sie auf jeden Spaltentitel mit der &RMBn; klicken und dann die Schriftart anpassen. Dann wird in der Nachrichtenliste die gleiche Schriftart wie auf den anderen Bereichen des Fensters verwendet.

source: How to unconfigure &kmail; folder tool tips?
de: Wie kann ich in &kmail; Kurzinfos für Ordner abschalten?

source: <emphasis>Symptom:</emphasis> You are using &kmail; on a netbook, and find that the <emphasis>tooltips</emphasis> over folders hide too many folder names
de: <emphasis>Problem</emphasis>: Sie benutzen &kmail; auf einem Netbook und stellen fest, dass die Kurzinfos, die beim Verweilen des Mauszeigers auf den Ordnern angezeigt werden, zu viele Ordnernamen verdecken.

source: <emphasis>Solution:</emphasis> Right-clicking on the header of the <guilabel>Folder List</guilabel> and unselect <guilabel>Display Tooltips</guilabel>.
de: <emphasis>Lösung:</emphasis> Klicken Sie mit der &RMBn; auf die Kopfzeile der <guilabel>Ordnerliste</guilabel> und deaktivieren Sie <guilabel>Kurzinfos anzeigen</guilabel>.

source: How to unconfigure &kmail; message list tool tips?
de: Wie schalte Ich in &kmail; die Anzeige der Kurzinfos in der Nachrichtenliste ab?

source: In &kmail;, <menuchoice><guimenu>Settings</guimenu><guisubmenu>Configure KMail</guisubmenu><guimenuitem>Appearance</guimenuitem><guimenuitem>Message List</guimenuitem></menuchoice> uncheck <menuchoice><guimenu>General</guimenu><guimenuitem>Display tooltips for messages and group headers</guimenuitem></menuchoice>
de: Öffnen Sie im Einrichtungsdialog von &kmail; die Karteikarte <guilabel>Nachrichtenliste</guilabel> auf der Seite <guilabel>Erscheinungsbild</guilabel> und schalten Sie hier die Einstellung <guilabel>Kurzinfos für Nachrichten und Zusammenfassungsüberschriften aktivieren</guilabel> aus.

source: How to remove alternate line colourings?
de: Wie schalte Ich den alternativen Farbhintergrund der Zeilen ab?

source: In <menuchoice><guimenu>&systemsettings;</guimenu><guisubmenu>Application Appearance</guisubmenu><guimenuitem>Colors</guimenuitem><guimenuitem>Colors</guimenuitem></menuchoice>, for each color set except <guilabel>Common Colors</guilabel> (which doesn't have it), change the <guilabel>Alternate Background</guilabel> to be the same as the <guilabel>Normal Background</guilabel>.
de: Gehen Sie in den &systemsettings; zur Karteikarte <guilabel>Farbauswahl</guilabel> auf der Seite <menuchoice><guimenu>Erscheinungsbild von Anwendungen</guimenu><guimenuitem>Farben</guimenuitem></menuchoice>. Für jeden Farbsatz mit Ausnahme von <guilabel>Allgemeine Farben</guilabel> setzen Sie den <guilabel>Alternativen Hintergrund</guilabel> auf die Farbe des <guilabel>Normalen Hintergrunds</guilabel>.

source: <emphasis>Mandriva</emphasis> and <emphasis>Mageia</emphasis> doesn't use the name <guilabel>System Settings</guilabel>. As in <guilabel>KControl</guilabel>, the KDE 3 control centre, they name it <quote>Configure your Desktop</quote> to distinguish it from <quote>Configure your Computer</quote>, a.k.a. the Mandriva/Mageia Control Center (MCC). Other than this name change, the method is as described above.
de: <emphasis>Mandriva</emphasis> und <emphasis>Mageia</emphasis> verwenden den Begriff &systemsettings; nicht. Wie im &kde;3-Kontrollzentrum benutzen sie den Begriff <quote>Einrichtung der Arbeitsfläche</quote>, um es von <quote>Einrichtung des Rechners</quote>, dem Mandriva/Mageia-Kontrollzentrum (MCC) abzugrenzen. Die oben beschriebene Methode kann dort aber genauso ausgeführt werden.

source: How to transfer mail and settings to another computer (or another user account on the same machine)?
de: Wie übertrage ich die E-Mails und Einstellungen auf einen anderen Rechner oder zu einem anderen Benutzer auf demselben Rechner?

source: Use <menuchoice><guimenu>Tools</guimenu><guimenuitem>Export &kmail; Data...</guimenuitem></menuchoice> to export and import settings and data. Please see <ulink url="help:/pimsettingexporter">PIM Setting Exporter</ulink> for details.
de: Benutzen Sie <menuchoice><guimenu>Extras</guimenu><guimenuitem>&kmail;-Daten exportieren</guimenuitem></menuchoice>, um Einstellungen und Daten zu exportieren und zu importieren. Weiter Details finden Sie unter <ulink url="help:/pimsettingexporter">PIM-Einstellungs-Export</ulink>.

source: Why am I not able to copy mails to a USB stick?
de: Warum kann ich meine E-Mails nicht auf einen USB-Stick kopieren?

source: <emphasis>Symptom:</emphasis> You are setting up a new computer and want to transfer all your mail. You decide to copy everything to a USB stick. The job starts, then you start to get failure message,
de: <emphasis>Problem</emphasis>: Sie richten einen neuen Rechner ein und möchten Ihre gesamten E-Mails darauf übertragen. Dazu kopieren Sie alle Dateien auf einen USB-Stick. Das Kopieren startet, bricht aber mit dieser Fehlermeldung ab:

source: Unable to copy ............Invalid argument
de: Kopieren nicht möglich ............Ungültiges Argument

source: <emphasis>Solution:</emphasis> Your usb stick is <ulink url="http://wiki.linuxquestions.org/wiki/VFAT">(V)FAT</ulink> formatted, and thus can't handle <emphasis>maildir</emphasis> folder names (nor can it handle <emphasis>permissions</emphasis>, which can cause many other problems). You have two choices. Either format your <acronym>USB</acronym> stick as ext2 (in which case you should be aware it can't be read on &Windows; OSes without installing additional software there) or create a tar file of all your mail, copy that to the stick and extract it to your new host.
de: <emphasis>Lösung</emphasis>: Der USB-Stick ist mit <ulink url="http://wiki.linuxquestions.org/wiki/VFAT">(V)FAT</ulink> formatiert, das für <emphasis>maildir</emphasis>-Ordnernamen und <emphasis>Berechtigungen</emphasis> nicht geeignet ist. Entweder formatieren Sie den USB-Stick als ext2-Dateisystem, dann kann der USB-Stick auf &Windows; Betriebssystemen ohne zusätzliche Software nicht benutzt werden, oder Sie erstellen für die gesamte E-Mail ein Tar-Archiv, kopieren es auf den USB-Stick und packen dann das Archiv auf dem neuen Rechner wieder aus.

source: Why are my filters not applied to incoming messages of &imap; accounts?
de: Warum werden meine Filter nicht auf eingehende Nachrichten von &imap;-Postfächern angewandt?

source: Normal &imap; mode does not support filtering, but the new disconnected &imap; account type does. You could try to use server-side filtering (ask your admin for how to install filters on the server and in which format), since &imap; is all about managing your email <emphasis>on the server</emphasis>. Unfortunately, although there exists a mail filter language (Sieve, defined in RFC3028), there is no standardized access protocol for installing or editing server-side Sieve scripts. If such a protocol becomes available in the future, &kmail; will most probably include support for it.
de: Der normale &imap;-Modus unterstützt keine Filter, wohl aber der neue Zugangstyp <quote>disconnected IMAP</quote>. Sie können es mit serverseitiger Filterung probieren (fragen Sie Ihren Administrator, wie und in welchem Format Filter auf dem Server installiert werden können), weil es bei &imap; nur darum geht, Nachrichten <emphasis>auf dem Server</emphasis> zu verwalten. Obwohl es eine Sprache für Nachrichtenfilter gibt, (Sieve, definiert in RFC3028), existiert kein standardisiertes Zugriffsprotokoll zur Installation und Bearbeitung von Sieve-Skripten auf dem Server. Falls ein solches Protokoll verfügbar wird, wird dessen Unterstützung aller Wahrscheinlichkeit nach in &kmail; nachgerüstet.

source: What should I know if I want to use <application>PGP</application>/<application>GnuPG</application> with &kmail;?
de: Warum sollte ich <application>PGP</application>/<application>GnuPG</application> mit &kmail; verwenden?

source: &kmail; provides a simple and easy-to-use interface for the basic functions of these programs; still you should understand how these programs work and what might make their use insecure. Some important issues:
de: &kmail; unterstützt die grundlegenden Funktionen dieser Programme auf einfache Weise. Dennoch sollte man diese beiden Programme grundlegend verstehen und die Stellen kennen, die deren Verwendung unsicher machen kann. Einige wichtige Dinge:
