Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdepim/kmail_getting-started.po
Languages: de

source: If you are using <acronym>IMAP</acronym>, you can optionally specify a path in the <guilabel>Prefix to folders</guilabel> field. This tells &kmail; where it can find your folders on the server. If you also have a shell account on the server and the messages are stored in your home folder it might be useful to store the messages in a subfolder <filename class="directory">Mail</filename>. Use this as a value in the <guilabel>Prefix to folders</guilabel> field so that &kmail; does not mix up mailbox files and other files. If you are not interested in this feature, simple leave the field blank.
de: Falls man <acronym>IMAP</acronym> auswählt, kann man optional einen Pfad im Feld <guilabel>Präfix für Ordner</guilabel> angeben. Damit legt man fest, wo &kmail; die Verzeichnisse des Benutzers auf dem Server findet. Falls man einen Shell-Zugang auf diesem Rechner besitzt und die Nachrichten im Persönlichen Ordner gespeichert sind, ist es sinnvoll, sie in einem Unterordner <filename class="directory">Mail</filename> zu speichern. Damit &kmail; Nachrichten-Ordner und andere Dateien nicht mischt, sollte man diesen Pfad bei <guilabel>Präfix für Ordner</guilabel> verwenden. Falls man daran nicht interessiert ist, lässt man das Feld einfach leer.

source: If you check <guilabel>Automatically compact folders</guilabel> &kmail; removes the messages you deleted from the server as soon as you leave a folder. Otherwise the messages are only marked as deleted and it is up to you to compact the folders manually by using the menu item <menuchoice><guimenu>File</guimenu><guimenuitem>Compact All Folders</guimenuitem></menuchoice>.
de: Wenn man <guilabel>Ordner automatisch komprimieren</guilabel> markiert, entfernt &kmail; die entsprechenden Nachrichten vom Server, sobald der Benutzer das Verzeichnis verlässt. Ansonsten bleiben die Nachrichten nur zur endgültigen Löschung markiert und man muss sie manuell durch Auswahl von <menuchoice><guimenu>Datei</guimenu><guimenuitem>Alle Ordner komprimieren</guimenuitem></menuchoice> entfernen.

source: If you check <guilabel>Show hidden folders</guilabel>, folders whose name starts with a dot are also displayed.
de: Falls man <guilabel>Versteckte Verzeichnisse anzeigen</guilabel> aktiviert, werden auch die Verzeichnisse angezeigt, deren Name mit einem Punkt beginnt.

source: Options only relevant to POP3
de: Optionen, die nur POP3 betreffen

source: Select <guilabel>Leave fetched messages on the server</guilabel> if you want to leave your messages on the server after you downloaded them.
de: Wählen Sie <guilabel>Abgeholte Nachrichten auf dem Server lassen</guilabel>, falls Sie Ihre Nachrichten nach dem Herunterladen auf dem Server lassen wollen.

source: Select <guilabel>Include in Manual Mail Check</guilabel> if you want to check this account whenever you use <menuchoice><guimenu>File</guimenu><guimenuitem>Check Mail</guimenuitem></menuchoice>. If you unselect this option you can still check for new messages on this account with <menuchoice><guimenu>File</guimenu><guimenuitem>Check Mail In</guimenuitem></menuchoice>.
de: Um einen Zugang in die automatische Überprüfung einzubeziehen, die durch <menuchoice><guimenu>Datei</guimenu><guimenuitem>Nach E-Mail sehen...</guimenuitem></menuchoice> ausgelöst wird, aktivieren Sie <guilabel>Bei manueller Prüfung einbeziehen</guilabel>. Ist diese Einstellung deaktiviert, können Sie dennoch manuell nach neuen Nachrichten für diesen Zugang suchen lassen durch <menuchoice><guimenu>Datei</guimenu><guimenuitem>Nach E-Mail sehen in</guimenuitem></menuchoice>.

source: Select <guilabel>Enable interval mail checking</guilabel> if you want &kmail; to check for new messages automatically. The interval can be specified below under <guilabel>Check mail interval</guilabel>.
de: Wählen Sie <guilabel>Posteingang regelmäßig überprüfen</guilabel> falls Sie möchten, dass &kmail; automatisch auf neue Nachrichten prüft. Der Zeitraum kann unter <guilabel>Prüfintervall</guilabel> eingestellt werden.

source: <guilabel>inbox</guilabel> is the default folder for incoming messages. If you want to change that for some reason, you can do so with <guilabel>Destination folder</guilabel>. But what you probably want is a <link linkend="filters">filter</link>, which has nothing to do with this option.
de: <guilabel>Posteingang</guilabel> ist der Standardordner für eingehende Nachrichten. Falls Sie dies aus irgendeinem Grund ändern wollen, können Sie dies über <guilabel>Zielordner</guilabel> tun. Aber normalerweise sollten Sie <link linkend="filters">Filter</link> benutzen, was nichts mit dieser Option zu tun hat.

source: With <guilabel>Pre-command</guilabel> you can specify any program that &kmail; will execute just before fetching mail. Please specify the full path (do not use <quote>~</quote>) and note that &kmail; will not continue until the program returns.
de: Unter <guilabel>Vorverarbeitungsbefehl</guilabel> kann man ein beliebiges Programm angeben, das von &kmail; vor dem Abrufen von E-Mail ausgeführt werden soll. Man muss hier den ganzen Pfad angeben (hier darf keine <quote>~</quote> verwendet werden). &kmail; fährt mit der Programmausführung erst fort, wenn das externe Programm beendet ist.

source: In the <guilabel>POP Settings</guilabel> group you can select <guilabel>Use pipelining for faster mail download</guilabel> if this is supported by your server. You should carefully test this to make sure it works safely.
de: Im Abschnitt <guilabel>POP-Einstellungen</guilabel> kann man <guilabel>Pipelining zum schnelleren Abholen aktivieren</guilabel>, falls diese Einstellung vom Server unterstützt wird. Man sollte die zuverlässige Arbeitsweise dieser Funktion ausreichend testen.

source: Options for both <acronym>IMAP</acronym> and POP3
de: Einstellungen für <acronym>IMAP</acronym> und POP3

source: &kmail; supports encryption via <guilabel>SSL/TLS</guilabel> and <guilabel>STARTTLS</guilabel> (<guilabel>SSL/TLS</guilabel> should be preferred if it is available).
de: &kmail; unterstützt Verschlüsselung per <guilabel>SSL/TLS</guilabel> und <guilabel>STARTTLS</guilabel>, <guilabel>SSL/TLS</guilabel> sollte verwendet werden, falls es verfügbar ist.

source: For POP3 &kmail; supports:
de: Für POP3 unterstützt &kmail; Folgendes:

source: <guilabel>Clear text</guilabel>,
de: <guilabel>Einfacher Text</guilabel>,

source: <guilabel>CRAM-MD5</guilabel> (recommended if <guilabel>DIGEST-MD5</guilabel> is not available),
de: <guilabel>CRAM-MD5</guilabel> (empfohlen, falls <guilabel>DIGEST-MD5</guilabel> nicht verfügbar ist),

source: <guilabel>DIGEST-MD5</guilabel> (recommended) and
de: <guilabel>DIGEST-MD5</guilabel> (empfohlen) und

source: <guilabel>APOP</guilabel> authentication.
de: <guilabel>APOP</guilabel>-Authentifizierung.

source: <guilabel>DIGEST-MD5</guilabel>, <guilabel>CRAM-MD5</guilabel> and <guilabel>APOP</guilabel> are secure on their own, the other options are only secure when used together with <guilabel>SSL</guilabel> or <guilabel>TLS</guilabel>. You should only use <guilabel>Clear text</guilabel> if your server does not support any of the other authentication methods. Additionally, for <acronym>IMAP</acronym> <guilabel>Anonymous</guilabel> is supported, but <guilabel>APOP</guilabel> is not. Use the <guibutton>Check what the server supports</guibutton> button on the <guilabel>Security</guilabel> tab to automatically select the most secure settings supported by your server.
de: <guilabel>DIGEST-MD5</guilabel>, <guilabel>CRAM-MD5</guilabel> und <guilabel>APOP</guilabel> sind von sich aus sicher, alle anderen Optionen sind nur sicher, wenn <guilabel>SSL</guilabel> oder <guilabel>TLS</guilabel> verwendet wird. Sie sollten <guilabel>Einfacher Text</guilabel> nur benutzen wenn Ihr Server keine andere Möglichkeit bietet. Für <acronym>IMAP</acronym> wird zusätzlich <guilabel>Anonym</guilabel> unterstützt, aber <guilabel>APOP</guilabel> nicht. Man kann den Knopf <guibutton>Fähigkeiten des Servers testen</guibutton> auf der Karteikarte <guilabel>Sicherheit</guilabel> verwenden, um die sicherste Methode zu finden, die der eigene Server unterstützt.

source: You are now ready to send and receive mail. For <acronym>IMAP</acronym>, just open your folders in the folder tree in &kmail;'s main window. &kmail; then connects to your server and displays the messages it finds. For POP3 use <menuchoice><guimenu>File</guimenu><guimenuitem>Check Mail</guimenuitem></menuchoice>.
de: Sie sind nun bereit Nachrichten zu senden und zu empfangen. Für <acronym>IMAP</acronym> öffnet man einfach die Ordner in der Ordnerliste in &kmail;'s Hauptfenster. &kmail; wird sich dann mit Ihrem Server verbinden und die Nachrichten anzeigen, die es findet. Für POP3 benutzen Sie <menuchoice><guimenu>Datei</guimenu><guimenuitem>Nach E-Mail sehen</guimenuitem></menuchoice>.

source: Testing your Setup
de: Testen der Einstellungen

source: First, you should send yourself a message to test your configuration. To send a message, either hit <keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo>, select the <guiicon>New Message</guiicon> icon or select the <menuchoice><guimenu>Message</guimenu><guimenuitem>New Message...</guimenuitem></menuchoice> menu item. The <link linkend="the-composer-window">composer window</link> will appear. Fill in the <guilabel>To:</guilabel> field with your email address and type something in the <guilabel>Subject</guilabel> field. Send the message by selecting <menuchoice><guimenu>Message</guimenu> <guimenuitem>Send Mail</guimenuitem> </menuchoice>.
de: Zunächst sollten Sie sich selbst eine Nachricht senden, um die Einrichtung zu testen. Um eine Nachricht zu senden, drücken Sie <keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo>, wählen Sie das Symbol <guiicon>Neue Nachricht</guiicon> (das leere Blatt Papier) oder wählen Sie <menuchoice><guimenu>Nachricht</guimenu><guimenuitem>Neue Nachricht</guimenuitem></menuchoice>. Das Fenster <link linkend="the-composer-window">Nachricht erstellen</link> wird erscheinen. Füllen Sie das Feld <guilabel>An:</guilabel> mit Ihrer Adresse und schreiben Sie etwas in das Feld <guilabel>Betreff</guilabel> Senden Sie die Nachricht, indem Sie <menuchoice><guimenu>Nachricht</guimenu> <guimenuitem>E-Mail versenden</guimenuitem> </menuchoice> wählen.

source: To check your email, select <menuchoice><guimenu>File</guimenu><guimenuitem>Check Mail</guimenuitem></menuchoice>. In the lower right corner of the main window, a progress bar will indicate how many messages are being downloaded. If you receive the message you just sent, then congratulations! If, however, you receive any error messages while testing your setup, make sure that your network connection is working and recheck your settings at <menuchoice><guimenu>Settings</guimenu> <guimenuitem>Configure &kmail;...</guimenuitem></menuchoice>.
de: Um nach zuschauen, ob neue E-Mail vorhanden ist, wählen Sie <menuchoice><guimenu>Datei</guimenu><guimenuitem>Nach E-Mail sehen</guimenuitem></menuchoice> In der rechten unteren Ecke wird angezeigt, wie viele E-Mails von Ihrem Postfach geholt werden. Wenn Sie die Nachricht erhalten, die Sie gerade gesendet haben, dann Herzlichen Glückwunsch! Falls Sie während dieses Test irgendeine Fehlermeldung erhalten, prüfen Sie die Verbindung zum Netzwerk und schauen Sie nochmal genau Ihre Einstellungen durch, indem Sie <menuchoice><guimenu>Einstellungen</guimenu> <guimenuitem>&kmail; einrichten...</guimenuitem></menuchoice> wählen.
