Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdepim/kmail_configure.po
Languages: de

source: When this is checked, you will not see the mail composer window. Instead, all invitation mails are sent automatically. If you want to see the mail before sending it, you can uncheck this option. However, be aware that the text in the composer window is in iCalendar syntax, and you should not try modifying it by hand.
de: Falls diese Einstellung aktiviert ist, erscheint das Fenster zur Nachrichteneingabe nicht. Stattdessen werden alle Einladungen automatisch versendet. Falls Sie die Nachrichten vor dem Versand sehen möchten, müssen Sie diese Einstellung deaktivieren. Der Text der Einladung ist allerdings in der Syntax von iCalendar verfasst und sollte daher nicht von Hand verändert werden.

source: Delete invitation emails after the reply to them has been sent
de: Einladungen löschen, nachdem eine Antwort versendet wurde

source: When this is checked, received invitation emails that have been replied to will be moved to the Trash folder, once the reply has been successfully sent.
de: Wenn diese Einstellung aktiviert ist, werden Einladungs-Nachrichten in den Papierkorb verschoben, nachdem die Antwort auf sie erfolgreich versendet wurde.

source: Options without a user interface representation
de: Optionen, die nicht über die Bedienoberfläche einzurichten sind

source: Apart from the options presented in the configuration dialog, some options can only be set directly in the &kmail; configuration file or through KIOSK (&eg; Input into &konsole;). These so called <quote>hidden</quote> configuration options cannot be changed via the normal &kmail; Settings dialog; they must be made by modifying the configuration file using a text editor or the <command>kwriteconfig</command> program. The configuration file is to be written in the format of [Section Name] and the following lines are the variables and their settings. If you are manually editing the configuration file you will need to add the [Section Name] before adding variables. The <command>kwriteconfig</command> will add the section for you as long as you use the <userinput>--group</userinput> switch.
de: Zusätzlich zu den Optionen im Einrichtungsdialog können einige Optionen direkt in der Einrichtungsdatei von &kmail; oder durch das KIOSK-System (&eg; Eingabe in einer &konsole;)gesetzt werden. Diese sogenannten <quote>versteckten</quote> Einstellungen können nicht im normalen Einrichtungsdialog von &kmail; geändert werden. Dazu muss die Einrichtungsdatei mit einem Texteditor oder mit dem Programm <command>kwriteconfig</command> geändert werden. Die Einrichtungsdatei hat das Format [Abschnittsname] gefolgt von Zeilen mit Variablen und deren Einstellung. Wenn Sie die Einrichtungsdatei manuell ändern, müssen Sie <quote>[Abschnittsname]</quote> vor den Variablen einfügen. Der Befehl <command>kwriteconfig</command> kann diesen Abschnitt für Sie hinzufügen, wenn Sie die Option <userinput>--group</userinput> verwenden.

source: The &kmail; configuration file is called <filename>kmail2rc</filename> and can be found in your home directory. The location can vary according to your operating system or distribution, but can always be found by running the command <userinput><command>kde4-config --path config --locate kmail2rc</command></userinput>. For the remainder of this section, assume that the configuration file is located in <filename>/path/to/kmail2rc</filename>.
de: Die Einrichtungsdatei von &kmail; hat den Namen <filename>kmail2rc</filename> und befindet sich im persönlichen Ordner des Benutzers. Je nach Betriebssystem oder Distribution gibt es unterschiedliche Speicherorte für diese Datei. Die Ausgabe des Befehls <userinput><command>kde4-config --path config --locate kmail2rc</command></userinput> zeigt den Pfad zur Einrichtungsdatei an. Für die folgenden Beispiele in diesem Kapitel wird als Pfad der Datei <filename>/pfad/zu/kmail2rc</filename> benutzt.

source: Whenever changing these options, make sure to quit &kmail; first before editing the configuration file. Only restart &kmail; after you have made <emphasis>and saved</emphasis> the changes to the configuration file.
de: Beenden Sie zuerst &kmail; ehe Sie die Einrichtungsdatei bearbeiten. Starten Sie &kmail; erst dann neu, wenn die Datei geändert und die Änderungen <emphasis>gespeichert</emphasis> sind.

source: Send Message Disposition Notifications with an empty sender string. Some servers might be configured to reject such messages, so if you are experiencing problems sending MDNs, make sure this option is set to false. To enable this feature, add to the <quote>[MDN]</quote> section:
de: Sendet Empfangs- und Lesebenachrichtigungen mit leerem Absender-Vorspann. Manche Server sind so eingerichtet, dass Sie solche Nachrichten zurückweisen. Falls Sie also Schwierigkeiten beim Versenden von MDNs haben, setzen Sie diese Option auf <quote>false</quote>. Um dies wieder zu aktivieren, fügen Sie folgendes im Abschnitt <quote>[MDN]</quote> ein:

source: Configuration file:
de: Einrichtungsdatei:

source: <prompt>&percnt;</prompt> <userinput><command>kwriteconfig</command> <option>--file <replaceable>/path/to/kmail2rc</replaceable> --group MDN --key SendMDNsWithEmptySender true</option></userinput>
de: <prompt>&percnt;</prompt> <userinput><command>kwriteconfig</command> <option>--file <replaceable>/pfad/zu/kmail2rc</replaceable> --group MDN --key SendMDNsWithEmptySender true</option></userinput>

source: The default setting of <quote>false</quote> strictly speaking violates Internet standards, but is set that way for practical reasons, to avoid servers rejecting MDNs that &kmail; generates because they think they are SPAM.
de: Die Standardeinstellung <quote>false</quote> verstößt streng genommen gegen Internet-Standards, wird aber aus praktischen Gründen so eingestellt. Dies verhindert, dass Server von &kmail; erzeugte MDNs zurückweisen, weil sie als Span eingestuft werden.

source: This option allows you to configure the application to close fully, even if there is a system tray icon configured, which would normally keep the application running. To enable the feature, add to the <quote>[General]</quote> section:
de: Mit dieser Option kann eingestellt werden, dass das Programm vollständig beendet wird, auch wenn das Kontrollleistensymbol aktiviert ist und damit normalerweise das Programm weiter läuft. Um dieses Verhalten zu aktivieren, geben sie folgendes im Abschnitt <quote>[General]</quote> ein:

source: <prompt>&percnt;</prompt> <userinput><command>kwriteconfig</command> <option>--file <replaceable>/path/to/kmail2rc</replaceable> --group General --key CloseDespiteSystemTray true</option></userinput>
de: <prompt>&percnt;</prompt> <userinput><command>kwriteconfig</command> <option>--file <replaceable>/pfad/zu/kmail2rc</replaceable> --group General --key CloseDespiteSystemTray true</option></userinput>

source: In versions prior to 1.9, &kmail; saved all attachments to disk with permissions set to 600 &mdash; only readable or writable by the owner of the file. In response to user feedback, this was made configurable in &kmail; version 1.9, with the defaults changed to honour the umask set on the user account while saving files to disk. To enable this feature, add to the <quote>[General]</quote> section:
de: In den Versionen von &kmail; vor 1.9 wurden alle Anhänge mit den Berechtigungen 600 &mdash; Lese- und Schreibrecht nur für den Eigentümer der Datei &mdash; auf der Festplatte gespeichert. Auf Wunsch vieler Benutzer wurde in &kmail; Version 1.9 diese Verhalten geändert, beim Speichern von Dateien werden jetzt die Einstellungen des Benutzerkontos aus der „umask“ berücksichtigt. Um dieses Verhalten als Standard zu aktivieren, geben sie folgendes im Abschnitt <quote>[General]</quote> ein:

source: <prompt>&percnt;</prompt> <userinput><command>kwriteconfig</command> <option>--file <replaceable>/path/to/kmail2rc</replaceable> --group General --key disregardUmask true</option></userinput>
de: <prompt>&percnt;</prompt> <userinput><command>kwriteconfig</command> <option>--file <replaceable>/pfad/zu/kmail2rc</replaceable> --group General --key disregardUmask true</option></userinput>

source: With this option enabled, &kmail; will check on every startup if there is an active out-of-office configured and show a warning if this is the case. To disable the feature, add to the <quote>[OutOfOffice]</quote> section:
de: Ist diese Einstellung aktiv, wird bei jedem Start überprüft, ob eine aktive Abwesenheits-Benachrichtigung eingerichtet ist und in diesem Fall eine Warnung angezeigt. Um dieses Verhalten abzuschalten, geben sie folgendes im Abschnitt <quote>[OutOfOffice]</quote> ein:

source: <prompt>&percnt;</prompt> <userinput><command>kwriteconfig</command> <option>--file <replaceable>/path/to/kmail2rc</replaceable> --group OutOfOffice --key CheckOutOfOfficeOnStartup false</option></userinput>
de: <prompt>&percnt;</prompt> <userinput><command>kwriteconfig</command> <option>--file <replaceable>/pfad/zu/kmail2rc</replaceable> --group OutOfOffice --key CheckOutOfOfficeOnStartup false</option></userinput>

source: In case you don't want users to be able to upload their own out-of-office scripts to the server you can add to the <quote>[OutOfOffice]</quote> section:
de: Soll es Benutzern nicht erlaubt werden, eigene Skripte für Abwesenheits-Benachrichtigungen auf den Server zu laden, fügen Sie zum Abschnitt <quote>[OutOfOffice]</quote> folgendes hinzu:

source: <prompt>&percnt;</prompt> <userinput><command>kwriteconfig</command> <option>--file <replaceable>/path/to/kmail2rc</replaceable> --group OutOfOffice --key AllowOutOfOfficeSettings false</option></userinput>
de: <prompt>&percnt;</prompt> <userinput><command>kwriteconfig</command> <option>--file <replaceable>/pfad/zu/kmail2rc</replaceable> --group OutOfOffice --key AllowOutOfOfficeSettings false</option></userinput>

source: If you want to allow your users to upload their own out-of-office scripts but you do not want them to be able to change the domain to react to and the react-to-spam setting, you can add to the <quote>[OutOfOffice]</quote> section:
de: Soll es den Benutzern erlaubt werden, eigene Skripte für Abwesenheits-Benachrichtigungen auf den Server zu laden, aber ohne Möglichkeit zur Änderung der Einstellungen von Domäne und Spam-Reaktion, fügen Sie zum Abschnitt <quote>[OutOfOffice]</quote> folgendes hinzu:

source: <prompt>&percnt;</prompt> <userinput><command>kwriteconfig</command> <option>--file <replaceable>/path/to/kmail2rc</replaceable> --group OutOfOffice --key AllowOutOfOfficeUploadButNoSettings true</option></userinput>
de: <prompt>&percnt;</prompt> <userinput><command>kwriteconfig</command> <option>--file <replaceable>/pfad/zu/kmail2rc</replaceable> --group OutOfOffice --key AllowOutOfOfficeUploadButNoSettings false</option></userinput>

source: When editing vacation (out-of-office) scripts, the user can specify a domain to limit the sending of such replies to. Applying defaults to the out-of-office configuration dialog via the corresponding button will restore this domain, in case the user has changed it. To pre-load this setting with a default value, add to the <quote>[OutOfOffice]</quote> section:
de: In Skripten für Abwesenheits-Benachrichtigungen kann eine Domäne angegeben werden, um das Senden solcher Antworten zu begrenzen. Wenn Sie die <guibutton>Voreinstellung</guibutton> im Einrichtungsdialog für Abwesenheits-Benachrichtigungen wählen, wird die Domäne auf diesen Wert zurück gesetzt. Um die Voreinstellung für eine Domäne zu setzen, fügen Sie zum Abschnitt <quote>[OutOfOffice]</quote> folgendes hinzu:

source: <prompt>&percnt;</prompt> <userinput><command>kwriteconfig</command> <option>--file <replaceable>/path/to/kmail2rc</replaceable> --group OutOfOffice --key OutOfOfficeDomain myMailDomain.test</option></userinput>
de: <prompt>&percnt;</prompt> <userinput><command>kwriteconfig</command> <option>--file <replaceable>/pfad/zu/kmail2rc</replaceable> --group OutOfOffice --key OutOfOfficeDomain myMailDomain.test</option></userinput>

source: By default, out-of-office replies are not sent to messages marked as SPAM. To override this behavior, add to the [OutOfOffice] section:
de: Als Standard werden Abwesenheits-Antworten nicht für E-Mails gesendet, die als Spam markiert sind. Um dieses Verhalten zu ändern, fügen Sie zum Abschnitt [OutOfOffice] hinzu:

source: <prompt>&percnt;</prompt> <userinput><command>kwriteconfig</command> <option>--file <replaceable>/path/to/kmail2rc</replaceable> --group OutOfOffice --key OutOfOfficeReactToSpam true</option></userinput>
de: <prompt>&percnt;</prompt> <userinput><command>kwriteconfig</command> <option>--file <replaceable>/pfad/zu/kmail2rc</replaceable> --group OutOfOffice --key OutOfOfficeReactToSpam true</option></userinput>

source: Starting in version 1.9, &kmail; can show the User-Agent or X-Mailer value from the message header when using Fancy Headers (see <menuchoice><guimenu>View</guimenu> <guisubmenu>Headers</guisubmenu></menuchoice> menu). To enable this feature, add to the <quote>[Reader]</quote> section:
de: Ab &kmail; Version 1.9 können die Vorspannzeilen „User-Agent“ und „X-Mailer“ im dekorativen Vorspannformat (siehe <menuchoice><guimenu>Ansicht</guimenu> <guisubmenu>Vorspann</guisubmenu></menuchoice> im Menü) angezeigt werden. Um dies zu aktivieren, geben sie folgende Zeile im Abschnitt <quote>[Reader]</quote> ein:

source: <prompt>&percnt;</prompt> <userinput><command>kwriteconfig</command> <option>--file <replaceable>/path/to/kmail2rc</replaceable> --group Reader --key ShowUserAgent true</option></userinput>
de: <prompt>&percnt;</prompt> <userinput><command>kwriteconfig</command> <option>--file <replaceable>/pfad/zu/kmail2rc</replaceable> --group Reader --key ShowUserAgent true</option></userinput>
