Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdepim/kmail_using-kmail.po
Languages: de

source: If you have chosen at least one tool you will be able to select actions to be done in &kmail; to messages containing viruses: to let &kmail; detect messages containing viruses you definitely should mark the <guilabel>Check messages using the anti-virus tools</guilabel> option; if you want messages detected as virus-infected to be moved into a certain folder, select the appropriate folder and mark the <guilabel>Move detected viral messages to the selected folder</guilabel> option; if messages detected as virus-infected should additionally be marked as read, then mark the <guilabel>Additionally, mark detected viral messages as read</guilabel> option.
de: Wenn Sie wenigstens ein Werkzeug zur Verwendung ausgewählt haben, können Sie einige Aktionen auswählen, die &kmail; bei Nachrichten mit Viren ausführen soll: Auf jeden Fall sollten sie &kmail; Nachrichten automatisch mit <guilabel>Nachrichten mit Anti-Virus-Programmen prüfen</guilabel> nach Viren suchen lassen. Wenn als mit Viren infizierte Nachrichten in einen bestimmten Ordner verschoben werden sollen, wählen Sie bitte diesen Ordner aus und kreuzen Sie die Option <guilabel>Erkannte Viren-Nachrichten in den ausgewählten Ordner verschieben</guilabel> an. Wenn infizierte Nachrichten außerdem noch als gelesen markiert werden sollen, dann kreuzen Sie auch die Option <guilabel>Erkannte Viren-Nachrichten zusätzlich als gelesen markieren</guilabel> an.

source: Selecting at least one of these options will allow the wizard to finish the filter setup. The wizard will not take any existing filter rules into consideration but will append new rules. In any case you may want to inspect the result of this process in the <link linkend="filter-dialog">Filter Dialog</link>.
de: Wenn Sie wenigstens eine dieser letzten Optionen ausgewählt haben, können Sie den Assistenten die Filtereinrichtung abschließen lassen. Der Assistent berücksichtigt keine existierenden Filterregeln, sondern hängt in jedem Fall neue Regeln an; Sie können sich das Ergebnis dieses Vorgangs im <link linkend="filter-dialog">Filter-Dialog</link> anschauen.

source: The wizard uses information stored in a special configuration file named <filename>kmail.antivirusrc</filename> (stored in the global or local &kde; config directory). It will first check the global config file and then the local config file: if the local config file contains entries with higher (newer) version numbers per-tool the configuration data from the local file for that tool is used; that way, both administrators and users can update the wizard configuration.
de: Der Assistent speichert seine Informationen in einer speziellen Konfigurationsdatei namens <filename>kmail.antivirusrc</filename> (die im globalen oder lokalen Konfigurationsverzeichnis von &kde; abgelegt wird). Zunächst wird die globale Konfigurationsdatei und danach die lokale durchsucht. wenn die lokale Konfigurationsdatei Einträge mit höheren (neueren) Versionsnummern pro Werkzeug enthält, dann werden für dieses Werkzeug die Konfigurationsdaten aus der lokalen Datei verwendet; auf diese Weise können sowohl Administratoren als auch Benutzer die Konfiguration des Assistenten aktualisieren.

source: The detection of messages containing viruses is achieved by creating <guilabel>pipe through</guilabel> actions per-tool within a special filter. Another filter contains rules to check for detected viral messages and actions to mark them and (optionally, depending on the choice in the wizard) to move them into a folder. Both filters are configured to be applied on incoming messages and on manual filtering.
de: Die Erkennung mit Viren infizierter Nachrichten funktioniert durch das Anlegen von Aktion des Typs <guilabel>Durch Befehl leiten</guilabel> für jedes Werkzeug in einem speziellen Filter. Ein weiterer Filter enthält Regeln, mit denen erkannte infizierte Nachrichten markiert und (optional, je nach Einstellung im Assistenten) in einen Ordner verschoben wird. Beide Filter werden so konfiguriert, dass sie sowohl für eingehende Nachrichten als auch bei manueller Filterung verwendet werden.
