Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdepim/kmail_using-kmail.po
Languages: de

source: There are a variety of shortcuts to help you with writing your messages. The <guibutton>Select...</guibutton> buttons next to the <guilabel>To:</guilabel>, <guilabel>CC:</guilabel>, and <guilabel>BCC:</guilabel> fields will call up the address book so that you can select addresses from there.
de: Für die Erstellung der Nachricht gibt es eine Reihe von Abkürzungen. Die Knöpfe <guibutton>Auswählen ...</guibutton> neben den Feldern <guilabel>An:</guilabel>, <guilabel>Kopie:</guilabel> und <guilabel>Blindkopie:</guilabel> ermöglichen die Auswahl von Adressen direkt aus dem Adressbuch.

source: When you start typing an address in the <guilabel>To:</guilabel>/<guilabel>CC:</guilabel>/<guilabel>BCC:</guilabel> fields, a popup will appear that offers matching addresses that have been used recently and matching addresses from your address book; if you do not like the automatic popup you can disable it by clicking with the &RMB; on the field and choosing a different completion mode.
de: Wenn Sie anfangen, eine Adresse in das Feld <guilabel>An:</guilabel>/<guilabel>Kopie </guilabel>/<guilabel>Blindkopie</guilabel> einzugeben, wird ein Ausklappmenü erscheinen, welches entsprechende Adressen anbietet, welche Sie vor Kurzem benutzt haben, oder die in Ihrem Adressbuch vorhanden sind. Man kann dieses automatische Ausklappmenü deaktivieren, indem man mit der rechten Maustaste auf das Feld klickt und einen anderen Vervollständigungsmodus auswählt.

source: Whenever you want to add more than one recipient in one of the fields, use a comma to separate each address from the next one. You may need to specify fully qualified addresses (&ie; <userinput>user@example.com</userinput>) even for local users, depending on your system configuration.
de: Wann immer Sie mehr als einen Empfänger in einem der Felder eingeben wollen, trennen Sie diese bitte mit einem Komma. Sie müssen abhängig von der Systemkonfiguration u. U. vollständige Adressen (also <userinput>benutzer@domain.de</userinput>) auch für lokale Benutzer angeben.

source: When you are finished with your message, you click the <guiicon>Send</guiicon> icon (the envelope) to send the message now, or click the <guiicon>Queue</guiicon> icon to put the message in the outbox. If your message is not finished yet, select <menuchoice><guimenu>Message</guimenu><guimenuitem>Save as Draft</guimenuitem></menuchoice> to save for later editing. If you would like to print your message, select <menuchoice><guimenu>Message</guimenu><guimenuitem>Print Preview</guimenuitem></menuchoice> to preview the message, and <menuchoice><guimenu>Message</guimenu><guimenuitem>Print</guimenuitem></menuchoice> to print it.
de: Wenn die Nachricht fertig geschrieben ist, klicken Sie auf das Symbol <guiicon>Senden</guiicon>, um die Nachricht sofort zu versenden, oder <guiicon>In Postausgang</guiicon>, um die Nachricht in den Ordner Postausgang zu stellen. Falls die Nachricht noch nicht fertig ist, können Sie im Menü <menuchoice><guimenu>Nachricht</guimenu><guimenuitem>Als Entwurf speichern</guimenuitem></menuchoice> auswählen, um die Nachricht später zu weiter zu bearbeiten. Um eine Nachricht zu drucken oder eine Vorschau des Ausdrucks anzuzeigen, wählen Sie <menuchoice><guimenu>Nachricht</guimenu><guimenuitem>Druckvorschau</guimenuitem></menuchoice> oder <menuchoice><guimenu>Nachricht</guimenu><guimenuitem>Drucken</guimenuitem></menuchoice>.

source: <menuchoice><guimenu>Message</guimenu><guimenuitem>Send Later</guimenuitem></menuchoice> allows you to schedule your emails to send at a specific date and time. Please see <ulink url="help:/akonadi_sendlater_agent">Send Later Agent</ulink> for details.
de: Mit <menuchoice><guimenu>Nachricht</guimenu><guimenuitem>Später senden</guimenuitem></menuchoice> in &kmail;s Editorfenster können Sie das Versenden der E-Mail zu einem späteren Datum und Uhrzeit planen. Weitere Informationen dazu unter <ulink url="help:/akonadi_sendlater_agent">Agent zum späteren Senden</ulink>.

source: <guimenu>File</guimenu><guisubmenu>New</guisubmenu><guisubmenu>Message From Template</guisubmenu> <guimenuitem><replaceable>My Super Template</replaceable></guimenuitem>
de: <guimenu>Datei</guimenu><guisubmenu>Neu</guisubmenu><guisubmenu>Neue Nachricht von Vorlage</guisubmenu> <guimenuitem><replaceable>Meine tolle Vorlage</replaceable></guimenuitem>

source: Compose a new Message from Template is useful if you have created a masterpiece message that you would like to save as a template for use in future new messages. Select <menuchoice><guimenu>Message</guimenu><guimenuitem>Save as Template</guimenuitem></menuchoice> and this will place your new template in the <guilabel>templates:</guilabel> folder. You can revise the template at anytime by selecting it in this folder. The saved template will now be listed under this menu to use for new messages. Please see <link linkend="compose-new-message">Compose New Message</link> for further details on composing a message.
de: Das Schreiben einer neuen Nachricht auf Grundlage einer Vorlage ist nützlich, wenn Sie eine Nachricht erstellt haben, die Sie als Vorlage für zukünftige E-Mails benutzen möchten. Wählen Sie <menuchoice><guimenu>Nachricht</guimenu><guimenuitem>Als Vorlage speichern</guimenuitem></menuchoice>, um die E-Mail im Ordner <guilabel>Vorlagen</guilabel> zu speichern. Diese Vorlage können Sie jederzeit ändern, wenn Sie sie in diesem Ordner auswählen und bearbeiten. Die gespeicherte Vorlage wird nun in diesem Menü als Vorlage für neue Nachrichten aufgeführt. Bitte lesen Sie den Abschnitt <link linkend="compose-new-message">Neue Nachrichten erstellen</link> mit weiteren Details zum Erstellen von Nachrichten.

source: Signing and Encrypting Messages
de: Signieren und Verschlüsseln von Nachrichten

source: If you want to send an <link linkend="pgp-encrypt-your-messages">encrypted</link> or <link linkend="pgp-sign-your-messages">digitally signed</link> message, select the <guiicon>Sign Message</guiicon> or <guiicon>Encrypt Message</guiicon> icons in the toolbar. Moreover you can select the format that should be used to sign and/or encrypt the message. Depending on the installed encryption programs you can choose between:
de: Falls man eine Nachricht <link linkend="pgp-encrypt-your-messages">verschlüsselt</link> oder <link linkend="pgp-sign-your-messages">digital signiert</link> versenden möchte, muss man das Symbol <guiicon>Nachricht verschlüsseln</guiicon> bzw. <guiicon>Nachricht signieren</guiicon> in der Werkzeugleiste auswählen. Außerdem können Sie das Format auswählen, das zum Signieren und/oder Verschlüsseln der Nachrichten verwendet werden soll. Je nach installierten Verschlüsselungsprogrammen können Sie wählen zwischen:

source: <guilabel>Any</guilabel>
de: <guilabel>Alle</guilabel>

source: &kmail; will use a format which is understood by all recipients of the message. The preferred format of the recipients can be specified in the &kde; Address Book.
de: &kmail; verwendet ein Format, dass alle Empfänger der Nachricht verstehen. Das bevorzugte Format der Empfänger kann im &kde;-Adressbuch hinterlegt werden.

source: Inline OpenPGP (deprecated)
de: Inline-OpenPGP (veraltet)

source: This format is outdated. If you use this format then only the message text will be signed and/or encrypted. <emphasis>Attachments will neither be signed nor encrypted.</emphasis> &HTML; messages cannot be signed with this format. You should only use this format if necessary, &ie; if you send messages to users of email clients that cannot handle the more advanced formats.
de: Dieses Format ist veraltet. Wenn Sie dieses Format verwenden, wird nur der Nachrichtentext signiert und/oder verschlüsselt. <emphasis>Anhänge werden weder signiert noch verschlüsselt.</emphasis> &HTML;-Nachrichten können mit diesem Format nicht signiert werden. Sie sollten dieses Format nur verwenden, wenn es absolut nötig ist, d. h., wenn Sie Nachrichten an Benutzer von E-Mail-Programmen verschicken, die die moderneren Formate nicht verstehen.

source: This format is the successor of the inline OpenPGP format. If you use this format then the message text and all attachments will be signed and/or encrypted (at least by default). This is the recommended format if you use OpenPGP.
de: Dieses Format ist der Nachfolger des Inline-OpenPGP-Formats. Wenn Sie dieses Format verwenden, dann werden der Nachrichtentext und alle Anhänge signiert und/oder verschlüsselt (zumindest in der Voreinstellung). Dies ist das empfohlene Format, wenn Sie OpenPGP verwenden.

source: This format is an alternative format to OpenPGP/&MIME;. If you use this format then the message text and all attachments will be signed and/or encrypted (at least by default). This format is mostly used by corporations.
de: Dieses Format ist eine Alternative zu OpenPGP/&MIME;. Wenn Sie dieses Format verwenden, dann werden der Nachrichtentext und alle Anhänge signiert und/oder verschlüsselt (zumindest als Voreinstellung). Dieses Format wird hauptsächlich von großen Firmen und Behörden verwendet.

source: S/&MIME; opaque
de: S/&MIME;-opak

source: This format is a variant of the S/&MIME; format. It should only be used if necessary.
de: Dieses Format ist eine Variante des S/&MIME;-Formats. Es sollte nur verwendet werden, wenn es absolut notwendig ist.

source: Creating &HTML; Messages
de: &HTML;-Nachrichten schreiben

source: Note that &HTML; messages are often regarded as an annoyance; therefore, you should avoid sending &HTML; messages if possible. Particularly, you should never send &HTML; messages to a mailing list unless &HTML; messages are explicitly allowed.
de: Beachten Sie, dass &HTML;-Nachrichten häufig als Ärgernis empfunden werden. Sie sollten das Versenden solcher Nachrichten daher vermeiden. Das gilt insbesondere in Mailinglisten, sofern &HTML;-Nachrichten dort nicht ausdrücklich erlaubt sind.

source: In order to be able to create &HTML; messages you first have to enable the markup tools. To do this enable <guimenuitem>Rich text editing</guimenuitem> in the <menuchoice><guimenu>Options</guimenu></menuchoice> menu. A toolbar with several tools to format the message will appear. Via the drop down box you can select between standard text and six different types of lists (three bulleted lists with different symbols and three numbered lists with different numbering). Moreover, you can select the font family, the font size, the font style (bold, italic, underlined) and the text color. Last but not least, you can select the alignment of the text (left aligned, centered, right aligned).
de: Um &HTML;-Nachrichten zu erzeugen, müssen Sie zunächst die Auszeichnungswerkzeuge einschalten. Das geschieht durch Anwählen von <guimenuitem>Bearbeiten in Rich-Text</guimenuitem> im Menü <menuchoice><guimenu>Optionen</guimenu></menuchoice>. Eine Werkzeugleiste mit mehreren Werkzeugen zum Formatieren der Nachricht wird erscheinen. Über das Ausklappmenü können Sie zwischen Standardtext und sechs verschiedenen Listentypen (drei unnummerierten Listen mit verschiedenen Symbolen und drei nummerierten Listen mit unterschiedlichen Nummerierungen) auswählen. Außerdem können Sie den Zeichensatz, die Zeichengröße, den Zeichenstil (fett, kursiv, unterstrichen) und die Zeichenfarbe bestimmen. Und schließlich können Sie die Ausrichtung des Textes (linksbündig, zentriert oder rechtsbündig) auswählen.

source: Creating tables and embedding images is currently not possible.
de: Das Erstellen von Tabellen und eingebetteten Bildern ist derzeit nicht möglich.

source: Adding Attachments
de: Dateien anhängen (Attachments)

source: You can attach files to your message by using one of the methods below:
de: Folgende Möglichkeiten gibt es, Dateien an eine Nachricht anzuhängen:

source: Click the <guiicon>Attach File</guiicon> (paper clip) icon and select the file you wish to attach;
de: Klicken Sie auf <guiicon>Datei anhängen</guiicon> (Büroklammer) und wählen Sie die Datei, die Sie anhängen wollen.

source: Drag a file from the desktop or another folder into the composer window;
de: Ziehen Sie eine Datei mit der Maus von der Arbeitsfläche oder einem Ordner in das Fenster zum Erstellen der Nachrichten und lassen Sie sie dort fallen.

source: Drag a message from &kmail;'s message list into the composer window -- that message will then be attached;
de: Ziehen Sie eine Nachricht aus der Nachrichtenliste von &kmail; in das Fenster zum Erstellen von Nachrichten -- diese Nachricht wird dann angehängt.

source: Select one of the options in the <menuchoice><guimenu>Attach</guimenu></menuchoice> menu.
de: Wählen Sie einen Punkt aus dem Menü <guilabel>Anhängen</guilabel>.

source: Select <menuchoice><guimenu>Message</guimenu><guimenuitem>Insert Recent text file</guimenuitem></menuchoice>.
de: Wählen Sie <menuchoice><guimenu>Nachricht</guimenu><guimenuitem>Kürzlich verwendete Datei einfügen</guimenuitem></menuchoice>.

source: Once a file is attached to your message, it appears in the attachments pane at the bottom of the composer window. You can use the &RMB; on each attachment to <guimenuitem>Open</guimenuitem>, <guimenuitem>View</guimenuitem>, <guimenuitem>Save As...</guimenuitem> or <guimenuitem>Remove</guimenuitem> the attachment.
de: Wenn eine Datei angehängt wurde, erscheint diese im Anhang-Bereich am unteren Ende des Nachrichten-Editor-Fensters. Sie können eine angehängte Datei wieder entfernen, speichern oder die Eigenschaften ändern, indem auf die Nachricht mit der &RMBn; klicken und im angezeigten Menü <guilabel >Öffnen</guilabel>, <guilabel >Anzeigen</guilabel>, <guilabel>Speichern unter</guilabel> oder <guilabel>Entfernen</guilabel> wählen.

source: Use the <guimenuitem>Properties</guimenuitem> item to open the <guilabel>Message Part Properties</guilabel> dialog. The first field contains the attachment's &MIME; type. Just like the <guilabel>Name</guilabel> field, it should be automatically filled with an appropriate value. Sometimes the &MIME; type value may be wrong. You can then type in any &MIME; type or choose from the list of common &MIME; types. You can also select an encoding method for your file from the list of encoding options (normally, the default value works fine). Check the <guilabel>Suggest automatic display</guilabel> option if you want to suggest to the recipient the automatic (inline) display of this attachment. Whether this works or not depends on the recipient's email client and on his settings.
de: Der Eintrag <guimenuitem>Eigenschaften</guimenuitem> öffnet den Dialog <guilabel>Eigenschaften des Nachrichtenteils</guilabel>. Das erste Feld enthält den &MIME;-Typ des Anhangs. Es wurde wie das Feld <guilabel>Name</guilabel> automatisch mit einem geeigneten Wert gefüllt. Der &MIME;-Typ kann manchmal falsch sein. Sie können ihn dann selbst eintippen, oder aus einer Liste den korrekten Typ wählen. Sie können auch noch eine Kodierungsmethode auswählen (normalerweise ist der Standardwert in Ordnung). Man kann <guilabel>Automatische Anzeige vorschlagen</guilabel> auswählen, um den Empfänger die automatische Anzeige dieses Nachrichtenteils in der Nachrichtenvorschau anstelle des Standardsymbols vorzuschlagen. Ob dies funktioniert oder nicht hängt vom E-Mail-Programm des Empfängers und dessen Einstellungen ab.

source: You can also attach public keys to the message by using the appropriate options in the <menuchoice><guimenu>Attach</guimenu></menuchoice> menu. <application>GnuPG</application> key attachments are handled like file attachments.
de: Sie können auch öffentliche Schlüssel anhängen, indem Sie die entsprechende Option aus dem Menü <guilabel>Anhängen</guilabel> auswählen. Angehängte <application>GnuPG</application>-Schlüssel werden wie angehängte Dateien behandelt.

source: Checking the Spelling of your Message
de: Die Nachricht auf Rechtschreibfehler überprüfen

source: &kmail; will automatically check the spelling of your message (in &HTML; mode this currently does not work) and display unknown words using red color. If there are too many unknown words &kmail; will disable its checking. To select the language used for checking, select <menuchoice><guimenu>View</guimenu> <guimenuitem>Dictionary</guimenuitem></menuchoice>. You can disable automatic spellchecking in the <menuchoice><guimenu>Options</guimenu></menuchoice> menu.
de: &kmail; überprüft automatisch die Rechtschreibung Ihrer Nachricht (dies funktioniert derzeit nicht im &HTML;-Modus) und zeigt unbekannte Wörter in roter Farbe an. Wenn zu viele unbekannte Wörter gefunden werden, schaltet &kmail; die Rechtschreibprüfung ab. Um die verwendete Sprache auszuwählen, benutzen Sie <menuchoice><guimenu>Ansicht</guimenu><guimenuitem>Wörterbuch</guimenuitem></menuchoice>. Sie können die automatische Rechtschreibkontrolle im Menü <menuchoice><guimenu>Optionen</guimenu></menuchoice> abschalten.

source: If you need to write mails in different languages, enable the <guilabel>Dictionary</guilabel> drop down box with <menuchoice><guimenu>View</guimenu> <guimenuitem>Dictionary</guimenuitem></menuchoice> from the menu. Using this drop down box allows you to change the spellchecker's language with one mouse click.
de: Schreiben Sie häufig E-Mails in verschiedenen Sprachen, dann sollten Sie die Anzeige des Auswahlfeldes <guilabel>Wörterbuch</guilabel> mit <menuchoice><guimenu>Ansicht</guimenu> <guimenuitem>Wörterbuch</guimenuitem></menuchoice> aus den Menü einschalten. Mit diesem Auswahlfeld können Sie die Sprache der Rechtschreibprüfung mit einem Mausklick ändern.

source: To check the spelling of your message using a dialog, select <menuchoice><guimenu>Tools</guimenu> <guimenuitem>Spelling...</guimenuitem></menuchoice>. &kmail; uses <ulink url="help:sonnet">&sonnet;</ulink> to check spelling, which is the &kde; frontend to the <application>ispell</application> or <application>aspell</application> spelling checker. Note that you may first need to configure the spellchecker using <menuchoice><guimenu>Settings</guimenu> <guimenuitem>Spellchecker...</guimenuitem></menuchoice>.
de: Um die Rechtschreibung Ihrer Nachricht zu überprüfen, benutzen Sie <menuchoice><guimenu>Extras</guimenu> <guimenuitem>Rechtschreibung ...</guimenuitem></menuchoice>. &kmail; benutzt <ulink url="help:sonnet">&sonnet;</ulink> um die Rechtschreibung zu überprüfen. Dies ist die &kde;-Oberfläche für <application>ispell</application> oder <application>aspell</application>. Bitte beachten Sie, dass Sie die Rechtschreibprüfung über <menuchoice><guimenu>Einstellungen</guimenu> <guimenuitem>Rechtschreibprüfung ...</guimenuitem></menuchoice> zuerst einrichten müssen.

source: Setting Up the Text Snippets Tool
de: Textbausteine einrichten

source: When editing in the composer window you can store often used parts of text as snippets. To configure the capabilities of the mail snippets part select <menuchoice> <guimenu>View</guimenu> <guimenuitem>Snippets</guimenuitem> </menuchoice> from the menubar. A new panel will appear on the right side of the composer.
de: Bei der Bearbeitung im E-Mail-Editor können Sie oft benutzte Textpassagen als Textbausteine speichern. Zur Einrichtung dieser Textbausteine wählen Sie <menuchoice><guimenu>Ansicht</guimenu><guimenuitem>Textbausteine</guimenuitem></menuchoice> in der Menüleiste. Auf der rechten Seite des Editors wird dann ein neues Fenster angezeigt.

source: To add a new snippet to Snippet Panel, right click on panel, click on <menuchoice><guimenu>Add Snippet</guimenu></menuchoice> in the context menu. A snippet editor dialog will appear, in which new text can be added and the snippet can be given a name. Also a <guilabel>Shortcut</guilabel> can be associated with the snippet. Snippets can be grouped together as well by creating groups and adding snippets to a particular group. If you want to view the stored text in a tooltip window keep the mouse cursor over the title of that snippet.
de: Um einen neuen Textbaustein einzufügen, klicken Sie mit der rechten Maustaste in dieses Fenster und wählen <menuchoice><guimenu>Textbaustein hinzufügen ...</guimenu></menuchoice>. Geben Sie dann im Dialog einen Namen, den Text und einen <guilabel>Kurzbefehl</guilabel> für diesen Baustein ein. Textbausteine können in Gruppen angeordnet werden, entweder durch Erstellen einer neuen Gruppe oder durch Hinzufügen zu einer bereits vorhandenen Gruppe. Führen Sie den Mauszeiger über den Titel eines Textbausteins, dann wird dessen Text als Kurzinfo angezeigt.

source: The <guilabel>Snippets</guilabel> tool allows for a variable text in predefined places any time you insert a snippet into a file. To accomplish this <guilabel>Snippets</guilabel> provides its own variables mechanism. You can insert variables in the snippet text itself by using separators ( $ ) that enclose the variable names. For example: $variablename$, $invoicenumber$, $weekno$.
de: Mit Textbausteinen ist es auch möglich, Textvariablen an festgelegten Stellen mit dem Textbaustein einzufügen. Dazu wird ein eigener Variablenmechanismus verwendet. Im <guilabel>Textbaustein</guilabel> wird der Name der Variablen mit dem Trennzeichen „$“ eingefasst, zum Beispiel $variablename$, $rechnungsnummer$, $kalenderwoche$.

source: The variable separator can be changed to another character by changing <varname>snippetDelimiter</varname> in the [SnippetPart] section in the Text Snippet configuration file, which can be found at $KDEHOME/share/config/kmailsnippetrc .
de: Das Trennzeichen für Variablen kann durch Bearbeitung des Wertes von <varname>snippetDelimiter</varname> im Abschnitt [SnippetPart] geändert werden. Die Einrichtungsdatei für Textbausteine finden Sie unter $KDEHOME/share/config/kmailsnippetrc.

source: Using the Built-in Translator
de: Das eingebaute Übersetzungsmodul verwenden

source: &kmail; 2 composer provides a built-in translator that can be accessed by selecting <menuchoice><guimenu>View</guimenu><guimenuitem>Translator</guimenuitem></menuchoice> from the menubar. A new panel will appear at the bottom of the composer.
de: Der E-Mail-Editor in &kmail; enthält ein eingebautes Übersetzungsmodul, das Sie mit <menuchoice><guimenu>Ansicht</guimenu><guimenuitem>Übersetzer</guimenuitem></menuchoice> aus der Menüleiste aufrufen. Dann wird im Editorfenster ein neues Unterfenster angezeigt.

source: To translate a section of text, first select the text you would like translated to the box with the <guilabel>Drag text that you want to translate.</guilabel>. Select the language it currently is, in the <guilabel>From:</guilabel> drop down box. Select the language you would like to translate to in the <guilabel>To:</guilabel> drop down box, and click the <guibutton>Translate</guibutton> button. Your translated text will appear in the next box. If you need to translate in the other direction you can just click the <guibutton>Invert</guibutton> button. To clear all text, click the <guibutton>Clear</guibutton> button.
de: Um eine Textauswahl zu übersetzen, wählen Sie zuerst den zu übersetzenden Text aus und kopieren Sie ihn in das Feld links unten. Wählen Sie die aktuelle Sprache des zu übersetzenden Texts im Auswahlfeld <guilabel>Von</guilabel> und die Zielsprache der Übersetzung im Auswahlfeld <guilabel>Nach</guilabel>. Drücken Sie dann den Knopf <guibutton>Übersetzen</guibutton>. Dann wird die Übersetzung des Textes im rechten Feld angezeigt. Möchten Sie von der Zielsprache in die Quellsprache übersetzen, klicken Sie auf den Knopf <guibutton>Umkehren</guibutton>. Um den gesamten Text zu entfernen, klicken Sie auf <guibutton>Leeren</guibutton>.

source: Message Folders
de: Nachrichtenordner

source: <screeninfo>Folder Setup Example</screeninfo>
de: <screeninfo>Beispiel der Ordnereinrichtung</screeninfo>

source: <phrase>Folder Setup Example</phrase>
de: <phrase>Beispiel der Ordnereinrichtung</phrase>
