Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdepim/knode_journey.po
Languages: de

source: A journey in the World of Newsgroups
de: Ein Streifzug durch die Welt der Newsgruppen

source: This chapter is supposed to be glance over the World of Newsgroups and their <quote>inhabitants</quote>; someone who has never dared to go there before will encounter some strange customs, which may give you a feeling of being a lonely alien without backup; but stay calm, it is not like this. The Usenet is a meeting place for all kinds of normal and not-so-normal folks; it is here where they are distributing a lot of information but also gossip and other stuff.
de: Dieses Kapitel soll Ihnen einen kurzen Überblick über die Welt der Newsgruppen und Ihre <quote>Bewohner</quote> vermitteln. Wer sich hier noch nie hergewagt hat, wird zu Anfang sicherlich auf fremdartige Bräuche und Absonderlichkeiten stoßen, die einem leicht den Eindruck vermitteln, man sei hier nur ein Fremder ohne Beistand. Aber seien Sie beruhigt, dem ist nicht so. Das Usenet ist ein Tummelplatz für allerhand normale und schräge Geister, die hier wertvolle Informationen, Hochgeistiges aber auch Tratsch und andere Belanglosigkeiten verbreiten.

source: References to more detailed and qualified essays on the Usenet can be found at <link linkend="knode-more-info">More Resources</link>
de: Verweise auf ausführlichere und kompetentere Abhandlungen zum Usenet finden Sie unter<link linkend="knode-more-info">Weitere Informationsquellen.</link>

source: What are ...
de: Was sind eigentlich ...

source: ... online-readers?
de: ... Online-Reader?

source: An online-reader connects to a newsserver and gives you access to its content. &knode; is an online-reader: you are reading your News and publishing your own <glossterm>articles</glossterm> while the online-reader stays connected.
de: Ein Online-Reader stellt die Verbindung zum News-Server her und gewährt Zugriff auf dessen Inhalt. &knode; ist solch ein Online-Reader. Sie lesen Ihre News und versenden eigene <glossterm>Artikel</glossterm>, während die Verbindung besteht.

source: ... offline-readers?
de: ... Offline-Reader?

source: An offline-reader connects to the Server and fetches only the headers of new articles; then, the connection is closed and you can mark (offline) the articles you are really interested in. When you connect next time the offline-reader fetches the articles you marked and sends the articles you have written whilst offline.
de: Ein Offline-Reader stellt die Verbindung zum Server her und holt nur die Vorspanne der neuen Artikel ab. Dann wird die Verbindung getrennt, und Sie können die Artikel zum Abholen markieren, die Sie wirklich interessieren. Wenn Sie das nächste Mal online gehen, holt der Offline-Newsreader die zuvor markierten Artikel ab bzw. versendet die zwischenzeitlich von Ihnen verfassten Artikel.

source: There is no connection while you are reading or writing articles.
de: Beim Newslesen und Schreiben besteht keine Verbindung zum Server.

source: ... newsgroups?
de: ... Newsgruppen?

source: You can look at newsgroups as public bulletin boards and forums, where everybody is allowed to participate. Articles you have published in a newsgroup can be read by everybody subscribed to this newsgroup and, normally, everybody is allowed to publish their articles in a newsgroup.
de: Newsgruppen sind im Prinzip öffentliche schwarze Bretter und Diskussionsforen, an denen jeder teilnehmen kann. Artikel, die Sie in einer Newsgruppe veröffentlichen, können von jedem gelesen werden, der diese Newsgruppe abonniert hat. Und normalerweise kann jeder auch eigene Artikel darin veröffentlichen.

source: News is the collective term for articles published in a newsgroup.
de: Als News bezeichnet man die Artikel, die in den Newsgruppen veröffentlicht werden.

source: A thread is a topic of discussion in a newsgroup.
de: Thread (zu Deutsch: Faden) ist der englische Begriff für eine Diskussion in einer Newsgruppe. Auch in den deutschsprachigen Gruppen werden Sie sehr häufig diese Bezeichnung für eine Diskussion antreffen.

source: Online Manners
de: Benimmregeln

source: There are lot of different people meeting and talking in newsgroups; it is seen as some kind of courtesy to obey some rules of manner, the basics of which are listed here.
de: In den Newsgruppen treffen viele Leute unterschiedlichster Art zusammen und unterhalten sich. Dabei ist es eine Notwendigkeit und gilt als höflich, gewisse Regeln, die Netiquette, einzuhalten. Einige davon seien hier kurz angeführt.

source: Before you ask questions be sure you have read the newsgroup's <acronym>FAQ</acronym> (Frequently Asked Questions) and didn't find the answer.
de: Bevor Sie eine Frage zu einem Thema stellen, vergewissern Sie sich vorher, dass Sie die <acronym>FAQ</acronym> (Fragen und Antworten) dieser Newsgruppe gelesen und dort die Antwort nicht gefunden haben.

source: If you take part in a discussion be aware of the fact that everybody can read the answer: do not say anything that you would not say to the others if you were facing them; avoid insults.
de: Wenn Sie an einer Diskussion teilnehmen, sollten Sie daran denken, dass jeder Ihre Antworten lesen kann. Sagen Sie nichts, was Sie Ihrem Diskussionspartner nicht auch ins Gesicht sagen würden. Vermeiden Sie Bloßstellungen, persönliche Angriffe oder Beleidigungen.

source: Try to avoid crossposting: do not ask a question in more than one newsgroup when you do not know which is the right one. Ask in one newsgroup; if it is wrong, you will be told which is right one.
de: Vermeiden Sie so genannte Crosspostings, d. h. stellen Sie eine Frage nicht in mehreren Newsgruppen gleichzeitig, nur weil Sie nicht genau wissen, welche die richtige ist.

source: Formulate your articles accurately; nobody likes to read an article with lots of typos, even with content worth a Pulitzer. Think of your articles as letters: your letter speaks for you; it represents you; somebody reading your article will draw conclusions about you from it, wrong or right.
de: Seien Sie sorgfältig beim Formulieren Ihrer Artikel. Niemand liest einen längeren Artikel, dessen Inhalt zwar nobelpreiswürdig ist, der aber durch Tippfehler und Wortdreher oder schlimmeres unlesbar wird. Betrachten Sie jeden Ihrer Artikel als einen Brief, mit dem Sie sich darstellen. Man wird durch Ihre Artikel immer Rückschlüsse auf Sie selbst ziehen, ob diese nun berechtigt sind oder nicht.

source: Remember, nobody sees your grin when you are writing an ironic sentence: it may be funny for you, but it can be very serious for the person reading it. It is very difficult to include emotions in an article.
de: Denken Sie daran, niemand sieht Ihr Grinsen, wenn Sie diesen für Sie überaus witzigen Satz schreiben. Für andere kann es todernst aussehen. Ihre Artikel können Emotionen nur sehr schwer übermitteln.

source: The most important rule: use your common sense when you are answering or publishing an article.
de: Eine der wichtigsten Regeln: Setzen Sie beim Antworten und Veröffentlichen von Artikeln Ihren gesunden Menschenverstand ein.

source: The Usenet language
de: Die Sprache des Usenet

source: You will not be surprised about English being the main language on the Usenet; however, there are special trees for German (de.*), French (fr.*) and many other languages. If you are unable to determine the main language of a newsgroup the only possibility is careful listening or a possible explanation in the description of the group in the grouplist.
de: Es wird Sie kaum überraschen, wenn Sie feststellen, dass die Sprache des Usenet Englisch ist. Es gibt aber auch sehr viele Newsgruppen, in denen Deutsch (de.*), Französisch (fr.*) und viele andere Sprachen gesprochen werden. Viele Newsgruppen sind in eine Hierarchie eingeordnet, an deren Bezeichnung man bereits die dort geläufige Sprache feststellen kann. Die Newsgruppen der de-Hierarchie sind beispielsweise deutschsprachig, auch wenn viele deutsche Gruppen englische Bezeichnungen tragen. Anderen Gruppen wiederum kann man nicht ohne weiteres ansehen, welche Sprache darin vorherrscht. Hier hilft nur das Hineinhorchen oder ein Blick in die Gruppencharta oder, sofern vorhanden, die Beschreibung der Gruppe in der Gruppenliste des News-Servers.

source: In addition, over the time the Usenet has developed its own language but it is easy to learn.
de: Darüber hinaus hat das Usenet im Laufe der Zeit seine eigene Sprache entwickelt. Aber keine Angst, sie ist relativ leicht erlernbar.

source: <acronym>RTFM</acronym> and other typos
de: <acronym>RTFM</acronym> und andere Tippfehler

source: When you read news, after some time you will read some strange combinations of letters; for example, you can get a reply like:
de: Wenn Sie News lesen, werden Ihnen nach einiger Zeit bestimmte Buchstabenkombinationen auffallen, die äußerst kryptisch erscheinen. Es kann Ihnen passieren, dass Sie von einem Usenet-Teilnehmer die äußerst knappe Antwort

source: Nothing else. Strange, but absolutely intended; to solve the riddle: those, most of the time, are shortcuts, acronyms. It is easier to drop some letters than to write the same sentence over and over again.
de: Sonst nichts. Seltsam, aber durchaus beabsichtigt. Wir wollen das Rätsel lösen: Es handelt sich hierbei fast immer um Abkürzungen, um Akronyme, deren Bedeutung für den nicht englischsprachigen Usenet-Teilnehmer kaum zu erraten ist. Es ist einfacher ein paar Buchstaben hinzuwerfen, als immer dieselbe Floskel mühsam in die Tastatur zu hämmern.

source: But what is the meaning of <acronym>RTFM</acronym>? The writer is asking you to read the manual, documentation or <acronym>FAQ</acronym> before asking questions in the newsgroup. It stands for: (R)ead (T)he (F)...ing (M)anual; <acronym>BTW</acronym> this is advice you should adopt.
de: Was heißt denn nun <acronym>RTFM</acronym>? Nun, es ist die kurze und bündige Aufforderung gefälligst das Handbuch oder die Dokumentation zu irgendetwas zu lesen, bevor Sie Ihre Frage in die Newsgruppe stellen. Genauer gesagt heißt RTFM nämlich (R)ead (T)he (F)ucking (M)anual, oder auf gut deutsch: Lies das verdammte Handbuch! <acronym>BTW</acronym> ein Ratschlag, den Sie sich zu Herzen nehmen sollten.

source: Wait, what is <acronym>BTW</acronym> now? Another often-seen acronym which means (B)y (T)he (W)ay. It is easy when you know it; to avoid you having to continuously speculate over the meaning of acronyms there is table at he end of this section containing the most-often-used acronyms.
de: Tja, und was soll das <acronym>BTW</acronym> heißen? Auch dies ist ein sehr häufig anzutreffendes Akronym und bedeutet (B)y (T)he (W)ay, zu deutsch: Nebenbei gesagt. Wenn man es weiß, ist es ganz einfach. Damit Sie diese Abkürzungen nicht ständig zum Grübeln bringen, ist im folgenden Abschnitt eine Tabelle mit den häufigsten Akronymen enthalten. ;-)

source: This table does not try to be complete and is based on a list by Martin Imlau.
de: Diese Tabelle erhebt keinen Anspruch auf Vollständigkeit und basiert ursprünglich auf einer von Martin Imlau zusammengestellten Liste.

source: Acronyms on Usenet
de: Abkürzungen im Usenet

source: Acronym
de: Abkürzung

source: Meaning
de: Bedeutung

source: As a matter of fact
de: As a matter of fact (Tatsache ist ...)

source: Acknowledge
de: Acknowledge (Einverstanden, Zustimmung)

source: As far as I know
de: As far as I know (So weit ich weiß)

source: As far as I remember
de: As far as I remember (Soweit ich mich entsinne)

source: Are we going to have to go through this again?
de: Are we going to have to go through this again? (Müssen wir das nochmal durchkauen?)

source: As soon as possible
de: As soon as possible (So schnell wie möglich)

source: Bye for now!
de: Bye for now! (Erstmal Tschüss!)

source: By the way
de: By the way (Nebenbei bemerkt/Übrigens)

source: But you knew that
de: But you knew that (Aber das weißt Du ja.)

source: Correct me if I'm wrong
de: Correct me if I'm wrong (Korrigiert mich, wenn ich falsch liege.)

source: See you!
de: See you! (Tschüss!)

source: See you too!
de: See you too! (Auch Tschüß!)

source: See you later!
de: See you later! (Bis später!)

source: German abbreviation for the silliest user you can imagine (Dümmster anzunehmender User)
de: Dümmster anzunehmender Benutzer (User)

source: End of discussion
de: End of discussion (Ende der Diskussion)

source: Endless snorts of stupid laughter
de: Endless snorts of stupid laughter (Endlose Ausbrüche dummen Gelächters)

source: For your information
de: For your information (Zu Deiner Information)

source: God only knows
de: God only knows (Das weiß Gott allein.)

source: Have a nice day!
de: Have a nice day! (Einen schönen Tag noch!)

source: Hope that helps
de: Hope that helps (Hoffe, das hilft.)

source: How should I know?
de: How should I know? (Woher soll ich das wissen?)

source: In any event
de: In any event (Auf jeden Fall)

source: I am not a lawyer
de: I am not a lawyer (Bin doch kein Anwalt.)

source: If I remember correctly
de: If I remember correctly (Wenn ich mich recht entsinne.)

source: In my considered opinion
de: In my considered opinion (So wie ich das sehe.)

source: In my humble opinion
de: In my humble opinion (Meiner bescheidenen Meinung nach)

source: In my not so humble opinion
de: In my not so humble opinion (Meiner nicht ganz so unbedeutenden Meinung nach)

source: In no particular order
de: In no particular order (In keiner besonderen Reihenfolge)

source: In other words
de: In other words (Mit anderen Worten)

source: Laughing my ass off
de: Laughing my ass off (Ich lach mir den Arsch ab)

source: Laughing out loudly
de: Laughing out loud (Laut lachend)

source: Not acknowledged
de: Not acknowledged (Nicht einverstanden)

source: No big deal
de: No big deal (Keine Ursache)

source: No f...ing way
de: No fucking way (Auf gar keinen Fall!)

source: Rolling on the floor, laughing
de: Rolling on the floor, laughing (Sich vor Lachen kugelnd.)

source: Read the f...ing manual
de: Read the fucking manual! (Lies das verdammte Handbuch!)

source: Sorry, could not resist
de: Sorry, could not resist (Tut mir leid, konnte nicht widerstehen.)

source: Thanks in advance
de: Thanks in advance (Danke im Voraus.)

source: Smile!
de: Bitte lächeln!

source: Again, such a strange thing. What is this ;-) meant to be? Turn your head so the left side of your screen is on top; got it? It's a smile with a wink? This is a so-called emoticon; emoticons are an often-used possibility to express emotions, one thing missing in conversation on the Usenet (but there is a substitute, remember? ;-)
de: Und schon wieder eine Seltsamkeit. Was soll dieses ;-)? Drehen Sie mal den Kopf so, dass die linke Seite Ihres Bildschirms oben ist. Nun? Erkennen Sie das Grinsegesicht mit dem Augenzwinkern? Es handelt sich um ein sogenanntes Emoticon, ein vielfach im Internet verwendetes Ausdrucksmittel, um die fehlende Mimik bei einem Gespräch zu vermitteln.

source: It is very difficult to express emotions in email or news; your joking comment appear to be very serious to the recipient and can lead to unmeant reactions or conflicts (flames); so use emoticons to express your intention.
de: Durch das elektronische Medium E-Mail bzw. News lassen sich nur schwerlich Emotionen vermitteln. So gerät ein scherzhaft gemeinter Satz zuweilen beim Empfänger zu einer ernsthaften Äußerung und zieht damit ungewollte Reaktionen oder sogar Streitigkeiten (Flames) nach sich.

source: There are a lots of emoticons, which express a great variety of emotions; the interpretation is easy if you turn your head and think of a face.
de: Es gibt eine Vielzahl von Emoticons, die eine ebenso große Vielfalt an Emotionen ausdrücken können. Sie werden sehen, die Interpretation ist relativ einfach, wenn man den Kopf zur Seite legt und an ein Gesicht denkt.

source: PLONK!
de: PLONCK!

source: This PLONK! looks like some comic-sound, does it not? And that is exactly what it is used for. The one who reads it knows he was just added to the killfile of a newsreader; normally this means the recipient of the PLONK! annoyed the sender. The PLONK! is meant to play back the sound of the recipients name hitting the ground in the <glossterm>killfile</glossterm>.
de: Sieht aus wie der Text in der Sprechblase eines Comics, oder? Es erfüllt auch genau diesen Zweck. Es macht dem, der es liest klar, dass dort jemand im killfile eines Newsreaders gelandet ist, weil er dem Verfasser des PLONCK-Geräusches auf die Nerven ging. Das PLONCK! symbolisiert das Geräusch des Aufschlags im <glossterm>killfile</glossterm>. Weniger abstrakt könnte man sagen, derjenige hat dem anderen gerade den Rücken gekehrt.
