Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdepim/knode_using-morefeatures.po
Languages: de

source: The Search Dialog Box has four tabs which allow several search criteria: the first tab contains the settings for the <guilabel>Subject</guilabel> and <guilabel>From</guilabel> criteria; the second tab contains the settings for the <guilabel>Message-IDs</guilabel> of an article and its references; the third tab contains the settings for the <guilabel>Status</guilabel> of an article; the fourth tab, <guilabel>Additional</guilabel>, contains the remaining criteria.
de: Der Dialog „Suchen“ besteht aus vier Karteikarten, die eine Unterteilung der Suchkriterien vornehmen und die Sie über die Reiter oben anwählen können. Die erste Karteikarte enthält die Einstellungen für die Suchkriterien <guilabel>Betreff</guilabel> und <guilabel>Absender</guilabel>. Die zweite Karteikarte enthält die Angaben für die <guilabel>Message-ID</guilabel> des Artikels und seiner Referenzen. Die dritte Karteikarte enthält die Einstellungen, die den <guilabel>Status</guilabel> einer Nachricht betreffen und die letzte, die den Titel <guilabel>Sonstiges</guilabel> trägt, Suchkriterien, die sich nicht den anderen Kategorien zuordnen lassen.

source: You have probably already noticed the similarities between the Filter Dialog Box and the Search Dialog Box: the usage is the same and should not be too complicated if you have already defined your own filters.
de: Wie Sie bereits bemerkt haben werden, ähnelt der Dialog <guilabel>Suchen</guilabel> sehr stark dem Dialog für die Definition von Filtern. Die Bedienung ist identisch und sollte Ihnen keine Probleme bereiten, wenn Sie bereits eigene Filter definiert haben.

source: &knode; always searches in the currently-active newsgroup; a search in all newsgroups is not possible at the moment. After the Search has finished the articles found appear in the article view; when you close the Search Dialog Box using <guibutton>Close</guibutton> the search results are deleted, and the old view of the newsgroup appears again.
de: Die Such-Funktion von &knode; bezieht sich auf die aktuelle Newsgruppe. Eine Suche über alle Newsgruppen ist derzeit nicht möglich. Wenn Sie eine Suche durchgeführt haben, erscheinen die betreffenden Artikel in der Artikelansicht. Sobald Sie den Dialog <guibutton>Suchen</guibutton> mit <guibutton>Schließen</guibutton> beenden, wird das Suchergebnis in der Artikelansicht gelöscht, und die vorherige Ansicht der Newsgruppe wird angezeigt.

source: Search
de: Suchen

source: With this button you start the Search with the search criteria you defined; all articles in the selected newsgroup, fulfilling these criteria, appear in the article view.
de: Mit diesem Knopf starten Sie die Suche nach den von Ihnen vorgegebenen Kriterien. Im Betrachter erscheinen alle Artikel der Newsgruppe, die die Suchkriterien erfüllen.

source: Clear
de: Löschen

source: This button resets all search criteria.
de: Dieser Knopf löscht alle eingestellten Suchkriterien.

source: Supersede and Cancel Articles
de: Überschreiben und Zurücknehmen von Artikeln

source: This chapter deals with superseding and canceling articles. You will not use these two features very often, but they do exist should you, one day, need them.
de: Diese Kapitel befasst sich mit dem Überschreiben und Zurücknehmen von Artikeln, zwei Funktionen, die Sie normalerweise nicht sehr oft benötigen, die aber zu den Komfortfunktionen eines Newsreaders gehören.

source: Both functions need a news server prepared to handle them; you should also remember that there is no guarantee that no one has already read your article before it is superseded or canceled.
de: Beide Funktionen setzen voraus, dass die News-Server mit dieser Funktionalität umgehen können. Zudem sollten Sie bedenken, dass diese Funktionen nicht garantieren können, dass der zu löschende oder zu überschreibende Artikel nicht bereits von anderen Usenet-Teilnehmern gelesen wurde, ehe der News-Server die Anweisung zum Überschreiben oder Zurücknehmen erhält.

source: So first think, then post.
de: Dies sollten sie vor allem dann im Auge behalten, wenn Sie bislang der Meinung waren, ein unbedacht veröffentlichter <glossterm>Artikel</glossterm> lasse sich ja ganz einfach wieder löschen. Es gilt also weiterhin: Erst nachdenken, dann veröffentlichen.

source: Cancel
de: Zurücknehmen

source: Canceling an article means deleting it from the newsgroup.
de: Einen <glossterm>Artikel</glossterm> zurücknehmen bedeutet eigentlich, ihn aus der Newsgruppe zu löschen. Im Englischen wird hierfür der Begriff Cancel verwendet.

source: Why should you want to cancel an article? Perhaps you flamed somebody in a rage and now you want to get this article out of the newsgroup because you regret what you wrote: a personal insult, read by everybody, doesn't look good, especially when you regret it; so, there is only one thing you can do &mdash; cancel the article.
de: Warum sollte man einen Artikel zurücknehmen? Manchmal hat man sich einfach im Affekt zu einer Reaktion hinreißen lassen, die man nun nicht einfach so stehen lassen will. Eine persönliche Beleidigung, die von allen gelesen werden kann, macht sich nicht gut, vor allem dann, wenn es einem später Leid tut. Also hilft nur noch eins: Sie müssen den Artikel zurücknehmen.

source: Select the article you want to cancel and choose <guimenuitem>Cancel article</guimenuitem> from its context menu. If you are sure it is the right article, confirm &knode;s question with <guibutton>Yes</guibutton>. Now you will be asked if you want to send the Cancel message now or later; for this example we decide to send it <guibutton>Later</guibutton>. You will notice the new message in the folder <guilabel>Outbox</guilabel>.
de: Dazu markieren Sie den Artikel, den Sie zurücknehmen wollen, und wählen im Kontextmenü den Eintrag <guimenuitem>Artikel zurücknehmen</guimenuitem> . Wenn Sie sicher sind, dass es der richtige Artikel ist, bestätigen Sie die Nachfrage von &knode; mit <guibutton>Ja</guibutton>. Daraufhin werden Sie gefragt, ob Sie die Zurücknahme-Nachricht sofort oder erst später verschicken möchten. Zur Anschauung entscheiden wir uns jetzt für den Knopf <guibutton>Später</guibutton>. Sie werden feststellen, das jetzt eine neue Nachricht im Ordner <guilabel>Ausgang</guilabel> liegt.

source: Now we want to look at the so-called cancel message. In the subject you will find something like:
de: Nun wollen wir die so genannte Zurückname-Nachricht näher betrachten. Im Betreff steht nun etwa der Wortlaut:

source: This strange letters between the brackets are the Message-ID of the article you want to cancel. This message tells the newsserver to delete your article: if you look at complete header of this message, by selecting <menuchoice><guimenu>View</guimenu><guisubmenu>Headers</guisubmenu><guimenuitem>All Headers</guimenuitem></menuchoice>, you will notice a line with the name <emphasis>control</emphasis> and the content <emphasis>cancel &lt;xxxxx@ddddd.dd&gt;</emphasis> &mdash; this line tells the server that this message is a control message and, in our case, tells the server to cancel your article.
de: Die seltsame Zeichenfolge in spitzen Klammern ist die Message-ID des Artikels, den Sie zurücknehmen wollen, und die Nachricht ist eine Mitteilung für den News-Server, Ihren Artikel zu löschen. Wenn Sie den Artikel im Betrachter betrachten und dabei über <menuchoice> <guimenu>Ansicht</guimenu> <guisubmenu>Vorspannanzeige</guisubmenu><guimenuitem>Alle Vorspannzeilen</guimenuitem></menuchoice> den Vorspann einblenden, wie er vom Server gelesen wird, erkennen Sie, dass der Vorspann eine Zeile mit dem Namen <emphasis>control</emphasis> und dem Inhalt <emphasis>cancel &lt;xxxxx@ddddd.dd&gt;</emphasis> enthält. Daran erkennt der Server, dass es sich nicht um einen gewöhnlichen Artikel, sondern um eine Steuernachricht handelt. In diesem Fall um das Löschen (cancel) eines Artikels.

source: You can still delete the control message from the <guilabel>Outbox</guilabel> should you change your mind.
de: Da wir uns dafür entschieden haben, die Steuernachricht nicht sofort abzuschicken, können wir Sie selbst an diesem Punkt noch aus dem Ordner <guilabel>Ausgang</guilabel> löschen.

source: Keep in mind that articles can only be identified by their Message-IDs; you need this Message-ID if you want to cancel an article. Normally, your article gets a Message-ID when it arrives at the newsserver &mdash; that's why you can only cancel an article once it has been published. The articles in the <guilabel>Sent</guilabel> folder have no Message-ID, so you cannot cancel them from there.
de: Beachten Sie bitte, dass ein Artikel eindeutig nur über seine Message-ID zu identifizieren ist. Das setzt für das Zurücknehmen des Artikels das Vorhandensein der Message-ID voraus. Normalerweise erhält der Artikel seine Message-ID erst, wenn er beim News-Server anlangt. Darum können Sie Ihre Artikel nur Zurücknehmen, wenn Sie bereits in der Newsgruppe veröffentlicht wurden. Die Artikel im Ordner <guilabel>Gesendete</guilabel> besitzt noch keine Message-ID und sind darum von dort aus nicht zu löschen.

source: There is one exception: if you have configured &knode; to generate a Message-ID you can cancel you articles in folder <guilabel>Sent</guilabel> too.
de: Eine Ausnahme gibt es: Wenn Sie &knode; so konfiguriert haben, dass er selbst eine Message-ID generiert, können Sie Ihre Artikel auch aus dem Ordner <guilabel>Gesendete</guilabel> heraus zurücknehmen.

source: &knode; allows only to cancel your own articles: it refuses to cancel articles from other authors.
de: &knode; erlaubt nur das Zurücknehmen eigener Artikel und weigert sich ganz einfach die Artikel anderer Usenet-Teilnehmer zu löschen.

source: Since the cancel feature is so easily fooled, by newsreaders that let you cancel any post, many news servers do not acknowledge cancel messages from posters; even if your own <acronym>ISP</acronym> accepts the cancel and passes it on, many other servers will ignore it <emphasis>and will not pass it on</emphasis>.
de: Da die Zurücknehmen-Funktion leicht von Newsreadern, die das Zurücknehmen beliebiger Artikel gestatten, ausgehebelt werden kann, bestätigen Newsserver Zurücknehmen-Nachrichten häufig nicht. Auch falls der eigene Internet-Anbieter die Zurücknehmen-Nachricht akzeptiert und weiterleitet, werden viele andere Server sie ignorieren und <emphasis>nicht weiterleiten</emphasis>.

source: You should consider any previously-sent article, canceled or not, to be published and publicly available.
de: Man sollte jeden gesendeten Artikel, zurückgenommen oder nicht, als veröffentlicht und öffentlich verfügbar betrachten.

source: Supersede
de: Überschreiben

source: Supersede overwrites your article with a new version. One reason for doing this could be:
de: Das Überschreiben, im Englischen mit supersede bezeichnet, dient dazu einen <glossterm> Artikel</glossterm> durch eine neue bzw. geänderte Fassung zu ersetzen. Ein Beispiel für die Anwendung der Überschreiben Funktion wäre folgendes Szenario:

source: You have written a long article and have already posted it; now, you have found an error in this article: you could cancel this article, and post a new, corrected, article; or, you can use Supersede.
de: Sie haben gerade einen recht langen Artikel über ein bestimmtes Thema verfasst und diesen bereits versendet. Leider fällt Ihnen dabei auf, dass der letzte Abschnitt einen peinlichen Fehler enthält. Nun könnten Sie hingehen und den Artikel über die Funktion <guilabel>Zurücknehmen</guilabel> möglichst schnell löschen und einen neuen, überarbeiteten Artikel in der Newsgruppe zu veröffentlichen. Es geht aber auch einfacher.

source: Select the article in the article view. From its context menu select <guimenuitem>Supersede article...</guimenuitem>. &knode; will ask you if you really want to overwrite this article; if you confirm with <guibutton>Yes</guibutton> the Composer appears.
de: Markieren Sie den betreffenden Artikel in der Artikelansicht und wählen Sie über das Kontextmenü den Eintrag <guimenuitem>Artikel überschreiben</guimenuitem>. &knode; fragt Sie nun, ob Sie diesen Artikel tatsächlich überschreiben wollen. Bejahen Sie diese Frage, wird der Artikel-Editor mit dem Inhalt des betreffenden Artikels geöffnet.

source: In the Composer you can now make the desired corrections and changes. You can then publish this article in the same way as you post every other article; when the newsserver receives this article it reads some special lines in the header which tell the newsserver to supersede the older article. Select <menuchoice><guimenu>File</guimenu><guimenuitem>Send Later</guimenuitem></menuchoice> for now, because we want to look at the article's header in the <guilabel>Outbox</guilabel>.
de: Im Editor können Sie nun die beabsichtigten Änderungen oder Korrekturen vornehmen und den Artikel wie einen gewöhnlichen Artikel versenden. Wenn der Artikel nun vom News-Server in Empfang genommen wird, erkennt dieser anhand bestimmter Vorspannzeilen, dass dieser Artikel einen bestimmten anderen ersetzen soll. Versenden Sie den <glossterm>Artikel</glossterm> probeweise über <menuchoice><guimenu>Datei</guimenu><guimenuitem>Später versenden</guimenuitem></menuchoice>, damit wir den betreffenden <glossterm>Artikel</glossterm> im Ordner <guilabel>Ausgang</guilabel> betrachten können.

source: Activate <menuchoice><guimenu>View</guimenu><guisubmenu>Headers</guisubmenu><guimenuitem>All Headers</guimenuitem></menuchoice>, because we want to see all the headers the newsserver receives. You will notice a line like:
de: Schalten Sie über <menuchoice><guimenu>Ansicht</guimenu><guisubmenu>Vorspannanzeige</guisubmenu><guimenuitem>Alle Vorspannzeilen</guimenuitem></menuchoice> die Ansicht des Vorspanns ein, den der News-Server erhält. Wenn Sie genau hinsehen, werden Sie eine Zeile wie diese sehen:

source: This is the instruction for the newsserver for superseding the article with the Message-ID &lt;oggcm8.4n5.ln@konqi.org&gt; with the new article.
de: Dies ist die Anweisung für den News-Server, den<glossterm> Artikel</glossterm> mit der<glossterm> Message-ID</glossterm> &lt;oggcm8.4n5.ln@konqi.org&gt; durch den neu eingetroffenen<glossterm> Artikel</glossterm> zu ersetzen.

source: Besides this, Supersede is used for periodical posted articles, &eg; an <acronym>FAQ</acronym>. The new article supersedes the old one and the newsgroups do not end up with lots of different versions.
de: Abgesehen von diesem Beispiel findet das Überschreiben von Artikel vor allem bei regelmäßig veröffentlichten Artikeln wie beispielsweise den <acronym>FAQ</acronym>s seine Anwendung. So werden ältere Artikel einfach von den aktualisierten Artikeln überschreiben, ohne dass sich eine Fülle verschiedener Versionen in der betreffenden Newsgruppe ansammelt.

source: Again, using this function is only possible if the article already has a Message-ID. Normally, articles get their Message-ID from the newsserver: this means that you can only supersede articles which have already been published.
de: Auch hier gilt: Der Einsatz dieser Funktion ist nur möglich, wenn &knode; die Message-ID des betreffenden Artikels kennt. Diese ist aber im Allgemeinen erst bekannt, wenn der Artikel bereits in der Newsgruppe veröffentlicht wurde, da die Message-ID vom News-Server vergeben wird. Ein Überschreiben ist also nur über den bereits veröffentlichten Artikel in der Newsgruppe möglich.

source: You can configure &knode; to generate this Message-ID, then you can supersede your articles in the folder <guilabel>Sent</guilabel>, too.
de: Eine Ausnahme ist dann gegeben, wenn Sie &knode; so konfiguriert haben, dass er selbst eine Message-ID generiert. In diesem Fall können Sie Ihre Artikel auch über den Ordner <guilabel>Gesendete</guilabel> überschreiben.

source: &knode; allows you to only supersede your own articles.
de: &knode; gestattet nur das Überschreiben eigener Artikel.

source: As with cancels, supersede messages have been abused in the past, with, for example, certain parties sending hundreds or even thousands of them to overwrite legitimate posts with random computer generated junk; again, as with cancels, many news servers do not honor supersede messages, nor do they pass them on.
de: Wie bei Zurücknahme-Nachrichten wurden auch Überschreib-Nachrichten in der Vergangenheit häufig missbraucht, um z. B. Hunderte oder sogar Tausende davon zu senden und damit die Beiträge anderer Benutzer mit rechnererzeugten zufälligen Zeichenfolgen zu überschreiben. Daher ignorieren viele Newsserver Überschreib-Nachrichten und leiten diese auch nicht weiter.

source: Score, watch, ignore
de: Bewerten, Überwachen und Ignorieren

source: Score, Watch and Ignore are different names for the same feature.
de: Das Bewerten sowie das Überwachen und Ignorieren von Diskussionen sind im Grunde nur drei unterschiedliche Bezeichnungen für ein und denselben Vorgang.

source: By scoring a thread, you determine its importance. &knode; allows scores between -100000 and 100000. A normal article will get a score of 0 if you do not change this; threads with a score below 0 are less important than average; threads with a score above 0 are more important than average.
de: Mit dem Bewerten einer Diskussion legen Sie deren Wichtigkeit fest. &knode; erlaubt eine Bewertung zwischen -100000 und 100000, wobei ein Artikel immer eine Bewertung von 0 erhält, sofern Sie dies nicht ändern. Daraus können Sie ableiten, dass Diskussionen, die eine Bewertung von &lt; 0 haben, als unterdurchschnittlich wichtig zu betrachten sind. Andererseits wären somit Artikel, die eine Bewertung von &gt; 0 erhalten, wichtiger als der Durchschnitt.

source: The score is an attribute of the thread and the articles in this thread, so you can use the score for filtering and searching articles; for example, you can define a filter to show only articles with a score &gt; 0, i.e. all articles in which you are specifically interested.
de: Die Bewertung ist eine Eigenschaft der Diskussion und jedes Artikels darin. Demzufolge können Sie die Bewertung auch als Filterkriterium und bei der Suche nach Artikeln einsetzen. Beispielsweise könnten Sie einen Filter definieren, der alle Artikel anzeigt, die eine Bewertung von &gt; 0 haben, also von Ihnen als wichtig angesehen werden.

source: The function <guilabel>Watch</guilabel> sets the score of all article in a thread to 100; this way they get a high score and &knode; labels them with a special icon.
de: Die Funktion <guilabel>Überwachen</guilabel> bewirkt nichts anderes, als dass alle Artikel einer Diskussion automatisch die Bewertung 100 erhalten. Sie erhalten also eine hohe Bewertung und werden von &knode; mit einem besonderen Symbol gekennzeichnet.

source: The function <guilabel>Ignore</guilabel> does the opposite: it scores all articles in a thread with -100 so &knode; does not show these articles anymore.
de: Die Funktion <guilabel>Ignorieren</guilabel> bewirkt genau das Gegenteil. Die betreffenden Artikel erhalten standardmäßig die Bewertung -100, und &knode; zeigt diese Artikel dann einfach nicht mehr an.

source: The English word <quote>scoring</quote> is used in many other countries, too.
de: Das Bewerten eines Artikels wird im Englischen als <quote>Scoring</quote> bezeichnet, und dieser Begriff wird auch von vielen deutschen Usenet-Teilnehmern bevorzugt.

source: You can score an article or a thread manually with the right mouse button or with the <guimenu>Scoring</guimenu> menu &mdash; here you can score with <guilabel>Watch Thread</guilabel> and <guilabel>Ignore Thread</guilabel> directly. Apart from scoring manually you can let &knode; score the articles with scoring rules automatically; you can configure these rules at <menuchoice><guimenu>Settings</guimenu><guimenuitem>Configure KNode...</guimenuitem><guimenuitem>Reading News</guimenuitem><guimenuitem>Scoring</guimenuitem></menuchoice> or at <menuchoice><guimenu>Scoring</guimenu><guimenuitem>Edit scoring rules...</guimenuitem></menuchoice> &mdash; the only difference between these dialogs is that the last one has the rule-list next to the rule configuration. In the following guide I'm using the editor that appears if <menuchoice><guimenu>Scoring</guimenu><guimenuitem>Edit scoring rules...</guimenuitem></menuchoice> is chosen.
de: Die Bewertung eines Artikels oder einer Diskussion können Sie entweder manuell über die rechte Maustaste oder das Menü <guimenu>Bewerten</guimenu> vornehmen. Hier können Sie erst einmal die Bewertung mit <guilabel>Diskussion überwachen</guilabel> und <guilabel>Diskussion ignorieren</guilabel> den Wert direkt setzen. Außerdem können Sie die Bewertung von &knode; durch die Definition von Bewertungsregeln automatisch vornehmen lassen. Diese können Sie unter <menuchoice><guimenu>Einstellungen</guimenu><guimenuitem>KNode einrichten ...</guimenuitem> <guimenuitem>News lesen</guimenuitem><guimenuitem>Bewertung</guimenuitem> </menuchoice> oder unter <menuchoice><guimenu>Bewertung</guimenu><guimenuitem>Bewertungsregeln bearbeiten ...</guimenuitem></menuchoice> einrichten. Die Dialoge unterscheiden sich nur dadurch, dass bei letzterem der Bereich mit der Regelliste neben den Einstellungen angedockt ist. Ich werde mich in der folgenden Anleitung auf den Editor beziehen, den Sie über <menuchoice><guimenu>Bewertung</guimenu><guimenuitem>Bewertungsregeln bearbeiten ...</guimenuitem> </menuchoice> erreichen.

source: <screeninfo>The Rule Editor</screeninfo>
de: <screeninfo>Der Regel-Editor</screeninfo>

source: <phrase>The Rule Editor</phrase>
de: <phrase>Der Regel-Editor</phrase>

source: <para>The Rule Editor</para>
de: <para>Der Regel-Editor</para>

source: The composer consists of 4 areas: on the left side is the list of the rules; with the buttons below the list you can add, delete or copy an existing rule; below that you have the possibility to limit the rules which are shown &mdash; you have the choice whether to show all rules or only the rules for a specific <glossterm>newsgroup</glossterm>.
de: Der Regel-Editor besteht aus vier Bereichen. Links sehen Sie eine Liste aller bereits vorhandener Regeln. Mit den Knöpfen unter der Liste können Sie eine neue Regel hinzufügen, eine bestehende Regel löschen oder eine Regel kopieren. Ganz unten haben Sie noch die Möglichkeit, die Anzeige der Regeln zu beschränken. Es können wahlweise alle oder nur die Regeln, die für eine bestimmte <glossterm>Newsgruppe</glossterm> gelten, angezeigt werden.
