Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdepim/knode_commands.po
Languages: de

source: Command reference
de: Befehlsreferenz

source: The following keybindings assume you did not change the default settings.
de: Die im Folgenden beschriebene Tastaturbelegung gilt nur, wenn Sie die Standard-Tastaturbelegung nicht verändert haben.

source: The main &knode; window
de: Das &knode; Hauptfenster

source: The <guimenu>File</guimenu> menu
de: Das Menü <guimenu>Datei</guimenu>

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>S</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Save As...</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>S</keycap> </keycombo> </shortcut> <guimenu>Datei</guimenu> <guimenuitem>Speichern unter ...</guimenuitem>

source: Saves the selected article in a file.
de: Speichert den ausgewählten Artikel in eine Datei.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>P</keycap> </keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Print...</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>P</keycap></keycombo> </shortcut> <guimenu>Datei</guimenu> <guimenuitem>Drucken ...</guimenuitem>

source: Prints the selected article.
de: Druckt den ausgewählten Artikel.

source: <guimenu> File</guimenu> <guimenuitem>Send Pending Messages</guimenuitem>
de: <guimenu>Datei</guimenu> <guimenuitem>Wartende Nachrichten versenden</guimenuitem>

source: The messages in the <guilabel>Outbox</guilabel> folder are sent.
de: Versendet die Nachrichten, die im Ordner <guilabel>Ausgang</guilabel> liegen.

source: <guimenu> File</guimenu> <guimenuitem>Stop Network</guimenuitem>
de: <guimenu>Datei</guimenu> <guimenuitem>Netzwerk anhalten</guimenuitem>

source: Disconnects the current connection to a newsserver.
de: Unterbricht bestehende Verbindungen zum News/E-Mail-Server &knode;

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Quit</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl; <keycap>Q</keycap> </keycombo> </shortcut> <guimenu>Datei</guimenu> <guimenuitem>Beenden</guimenuitem>

source: Quits &knode;.
de: Beendet &knode;.

source: The <guimenu>Edit</guimenu> menu
de: Das Menü <guimenu>Bearbeiten</guimenu>

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>C</keycap> </keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Copy</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl; <keycap>C</keycap> </keycombo> </shortcut> <guimenu>Bearbeiten</guimenu> <guimenuitem>Kopieren</guimenuitem>

source: Copy the selected text to the clipboard.
de: Kopiert den markierten Text in die Zwischenablage.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>A</keycap></keycombo></shortcut> <guimenu>Edit</guimenu> <guimenuitem>Select All</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl; <keycap>A</keycap> </keycombo> </shortcut> <guimenu>Bearbeiten</guimenu> <guimenuitem>Alles auswählen</guimenuitem>

source: Selects the whole article.
de: Markiert den gesamten Inhalt des Artikels

source: <shortcut> <keycap>F4</keycap></shortcut><guimenu>Edit</guimenu> <guimenuitem>Search Articles...</guimenuitem>
de: <shortcut> <keycap>F4</keycap></shortcut><guimenu>Bearbeiten</guimenu> <guimenuitem>Nach Artikeln suchen ...</guimenuitem>

source: Opens the <guilabel>Search for Articles</guilabel> dialog box for searching in the active group.
de: Öffnet den Dialog <guilabel>Nach Artikeln suchen</guilabel>, um in der aktuellen Gruppe zu suchen.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>F</keycap> </keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Find in Article...</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>F</keycap> </keycombo> </shortcut> <guimenu>Bearbeiten</guimenu> <guimenuitem>Suchen in Artikel ...</guimenuitem>

source: To be written
de: Noch nicht geschrieben

source: <guimenu>Edit</guimenu> <guimenuitem>Fetch Article with ID...</guimenuitem>
de: <guimenu>Bearbeiten</guimenu> <guimenuitem>Artikel mit dieser ID abholen ...</guimenuitem>

source: Enables the download of an article with a specified article-ID.
de: Ermöglicht den Download eines Artikels mit einer vorgegebenen Artikel-ID

source: The <guimenu>View</guimenu> menu
de: Das Menü <guimenu>Ansicht</guimenu>

source: <guimenu>View</guimenu> <guimenuitem>Show Threads</guimenuitem>
de: <guimenu>Ansicht</guimenu> <guimenuitem>Diskussionen anzeigen</guimenuitem>

source: When this is activated, &knode; shows discussions as a tree view in the article view.
de: Ist diese Einstellung markiert, zeigt &knode; Diskussionen in der Artikelansicht als Baumstruktur an.

source: <guimenu>View</guimenu> <guimenuitem>Expand All Threads</guimenuitem>
de: <guimenu>Ansicht</guimenu> <guimenuitem>Alle Diskussionsverläufe anzeigen</guimenuitem>

source: When this is activated, &knode; shows the complete threads; this is only functional when <guilabel>Show threads</guilabel> is active.
de: Ist diese Einstellung markiert, zeigt &knode; Diskussionsverläufe vollständig an. Diese Einstellung hat nur Wirkung, wenn <guilabel>Diskussionen anzeigen</guilabel> markiert ist.

source: <guimenu>View</guimenu> <guimenuitem>Collapse All Threads</guimenuitem>
de: <guimenu>Ansicht</guimenu> <guimenuitem>Diskussionsverläufe ausblenden</guimenuitem>

source: When this is activated, &knode; shows no threads; this is only functional when <guilabel>Show threads</guilabel> is active.
de: Ist diese Einstellung markiert, zeigt &knode; Diskussionsverläufe nicht an. Diese Einstellung hat nur Wirkung, wenn <guilabel>Diskussionen anzeigen</guilabel> aktiv ist.

source: <shortcut><keycap>T</keycap></shortcut> <guimenu>View</guimenu> <guimenuitem>Toggle Subthread</guimenuitem>
de: <shortcut> <keycap>T</keycap> </shortcut> <guimenu>Ansicht</guimenu> <guimenuitem>Diskussion anzeigen/ausblenden</guimenuitem>

source: Toggles between showing and collapsing the selected thread.
de: Zeigt den Verlauf einer Diskussion an bzw. blendet ihn aus.

source: <guimenu>View</guimenu> <guimenuitem>Filter</guimenuitem>
de: <guimenu>Ansicht</guimenu> <guimenuitem>Filter</guimenuitem>

source: Allows you to choose a filter for the article view.
de: Erlaubt die Auswahl eines Filters für die Artikelansicht.

source: <guimenu>View</guimenu> <guimenuitem>Sort</guimenuitem>
de: <guimenu>Ansicht</guimenu> <guimenuitem>Sortieren</guimenuitem>

source: Allows you to sort the article view.
de: Erlaubt die Auswahl des Sortierkriteriums für die Artikelansicht

source: <shortcut><keycap>F5</keycap></shortcut> <guimenu>View</guimenu> <guimenuitem>Refresh List</guimenuitem>
de: <shortcut> <keycap>F5</keycap> </shortcut> <guimenu>Ansicht</guimenu><guimenuitem>Artikelansicht aktualisieren</guimenuitem>

source: Refreshes the article view
de: Aktualisiert die Anzeige in der Artikelansicht

source: <guimenu>View</guimenu> <guimenuitem>Unscramble (ROT 13)</guimenuitem>
de: <guimenu>Ansicht</guimenu> <guimenuitem>Entschlüsseln (Rot-13)</guimenuitem>

source: When this setting is activated, &knode; shows all characters of the complete article rotated by 13 characters.
de: Ist diese Einstellung markiert, zeigt &knode; sämtliche Buchstaben eines Artikels um 13 Zeichen verschoben an.

source: <shortcut><keycap>V</keycap></shortcut> <guimenu>View</guimenu> <guimenuitem>View Source</guimenuitem>
de: <shortcut> <keycap>V</keycap> </shortcut> <guimenu>Ansicht</guimenu> <guimenuitem>Quelltext anzeigen</guimenuitem>

source: The source code of the active article is opened in a new window.
de: Der Quelltext des aktiven Artikels wird in einem eigenen Fenster angezeigt.

source: <shortcut><keycap>X</keycap></shortcut> <guimenu>View</guimenu> <guimenuitem>Use Fixed Font</guimenuitem>
de: <shortcut> <keycap>X</keycap> </shortcut> <guimenu>Ansicht</guimenu> <guimenuitem>Schrift mit fester Breite verwenden</guimenuitem>

source: Activates the configured fixed-width font for the viewer.
de: Aktiviert die in den Einstellungen vorgegebene Festbreitenschrift für den Betrachter.

source: <guimenu>View</guimenu> <guimenuitem>Set charset</guimenuitem>
de: <guimenu>Ansicht</guimenu> <guimenuitem>Zeichensatz einstellen</guimenuitem>

source: Here you can configure the charset which is used for the articles.
de: Hier kann man einstellen, mit welchem Zeichensatz die Artikel angezeigt werden sollen.

source: The <guimenu>Go</guimenu> menu
de: Das Menü <guimenu>Gehe zu</guimenu>

source: <shortcut><keycap>P</keycap></shortcut> <guimenu>Go</guimenu> <guimenuitem>Previous Article</guimenuitem>
de: <shortcut> <keycap>P</keycap> </shortcut> <guimenu>Gehe zu</guimenu> <guimenuitem> Vorheriger Artikel</guimenuitem>

source: Jumps to previous article in the article view.
de: Springt zum vorherigen Artikel in der Artikelansicht.

source: <shortcut><keycap>N</keycap></shortcut> <guimenu>Go</guimenu> <guimenuitem>Next Article</guimenuitem>
de: <shortcut> <keycap>N</keycap> </shortcut><guimenu>Gehe zu</guimenu> <guimenuitem>Nächster Artikel</guimenuitem>

source: Jumps to next article in the article view.
de: Springt zum nächsten Artikel in der Artikelansicht.

source: <shortcut><keycombo action="simul">&Alt;&Shift;<keycap>Space</keycap></keycombo> </shortcut> <guimenu>Go</guimenu> <guimenuitem>Next Unread Article</guimenuitem>
de: <shortcut> <keycombo action="simul">&Alt;&Shift;</keycombo> </shortcut> <guimenu>Gehe zu</guimenu> <guimenuitem>Nächster ungelesener Artikel</guimenuitem>

source: Jumps to the next unread article, and to the first unread article of the next newsgroup if necessary.
de: Springt zum nächsten ungelesenen Artikel und ggf. zum ersten ungelesenen in der nachfolgenden Newsgruppe.

source: <shortcut><keycombo action="simul">&Shift;<keycap>Space</keycap></keycombo></shortcut> <guimenu>Go</guimenu> <guimenuitem>Next Unread Thread</guimenuitem>
de: <shortcut> <keycombo action="simul">&Shift; <keycap> Leertaste</keycap> </keycombo> </shortcut> <guimenu>Gehe zu</guimenu> <guimenuitem>Nächste ungelesene Diskussion</guimenuitem>

source: Jumps to the next unread thread, and to the next unread thread in the next newsgroup if necessary.
de: Springt zur nächsten ungelesenen Diskussion und ggf. zur nächsten ungelesenen Diskussion in der nachfolgenden Newsgruppe.

source: <shortcut><keycap>-</keycap></shortcut> <guimenu>Go</guimenu> <guimenuitem>Previous Group</guimenuitem>
de: <shortcut> <keycap>-</keycap> </shortcut> <guimenu>Gehe zu</guimenu> <guimenuitem>Vorherige Gruppe</guimenuitem>

source: Jumps to the previous news group in the folder view
de: Springt zur vorherigen Gruppe in der Ordneransicht.

source: <shortcut><keycap>+</keycap></shortcut> <guimenu>Go</guimenu> <guimenuitem>Next Group</guimenuitem>
de: <shortcut> <keycap>+</keycap> </shortcut> <guimenu>Gehe zu</guimenu> <guimenuitem>Nächste Gruppe</guimenuitem>

source: Jumps to the next newsgroup in the folder view
de: Springt zur nächsten Newsgruppe in der Ordneransicht.

source: The <guimenu>Account</guimenu> menu
de: Das Menü <guimenu>Zugang</guimenu>

source: <guimenu>Account</guimenu> <guimenuitem>Get New Articles in All Groups</guimenuitem>
de: <guimenu>Zugang</guimenu> <guimenuitem>Neue Artikel für alle Gruppen abholen</guimenuitem>

source: Connects with the active account and fetches any new messages.
de: Baut eine Verbindung zum aktiven Zugang auf und holt neue Artikel ab.

source: <guimenu>Account</guimenu> <guimenuitem>Get New Articles in All Accounts</guimenuitem>
de: <guimenu>Zugang</guimenu> <guimenuitem>Neue Artikel für alle Gruppen abholen</guimenuitem>

source: Connects with all account and fetches any new messages.
de: Baut eine Verbindung zu allen Zugängen auf und holt neue Artikel ab.

source: <guimenu>Account</guimenu> <guimenuitem>Subscribe to Newsgroups...</guimenuitem>
de: <guimenu>Zugang</guimenu> <guimenuitem>Newsgruppen abonnieren ...</guimenuitem>

source: Opens the Dialog Box for subscribing to newsgroups for the active account.
de: Ruft den Dialog zum Abonnieren der Gruppen für den aktiven Zugang auf.

source: <guimenu>Account</guimenu> <guimenuitem>Expire All Groups</guimenuitem>
de: <guimenu>Zugang</guimenu> <guimenuitem>Alle Gruppen auf veraltete Artikel prüfen</guimenuitem>

source: Here you can expire all groups of an account manually.
de: Hier kann man &knode; manuell anweisen, alle Newsgruppen nach alten Beiträgen zu durchsuchen und diese zu löschen.

source: <guimenu>Account</guimenu> <guimenuitem>Account Properties</guimenuitem>
de: <guimenu>Zugang</guimenu> <guimenuitem>Zugangseinstellungen</guimenuitem>

source: Opens the properties dialog for the active account.
de: Ruft den Einstellungsdialog für den aktiven Zugang auf.

source: <guimenu>Account</guimenu> <guimenuitem>Delete Account</guimenuitem>
de: <guimenu>Zugang</guimenu> <guimenuitem>Zugang löschen</guimenuitem>

source: Deletes the active account and all subscribed newsgroups therein.
de: Löscht den aktiven Zugang und alle abonnierten Gruppen dieses Zugangs.

source: The <guimenu>Group</guimenu> menu
de: Das Menü <guimenu>Gruppen</guimenu>

source: <guimenu>Group</guimenu> <guimenuitem>Get New Articles</guimenuitem>
de: <guimenu>Gruppen</guimenu> <guimenuitem>Neue Artikel abholen</guimenuitem>

source: <guimenu>Group</guimenu> <guimenuitem>Expire Group</guimenuitem>
de: <guimenu>Gruppen</guimenu> <guimenuitem>Gruppe auf veraltete Artikel prüfen</guimenuitem>

source: Checks if there are any old articles and, if so, deletes them.
de: Überprüft die Newsgruppe auf veraltete Artikel und löscht diese.

source: <guimenu>Group</guimenu> <guimenuitem>Reorganize Group</guimenuitem>
de: <guimenu>Gruppen</guimenu> <guimenuitem>Gruppe reorganisieren</guimenuitem>

source: Rebuilds the article view by using the configured sortings.
de: Aktualisiert die Artikelansicht anhand des eingestellten Sortierkriteriums.

source: <guimenu>Group</guimenu> <guimenuitem>Mark All as Read</guimenuitem>
de: <guimenu>Gruppen</guimenu> <guimenuitem>Alle als gelesen markieren</guimenuitem>

source: Sets the status of all articles in the active newsgroup to read.
de: Setzt den Status aller Artikel in der Newsgruppe auf gelesen.

source: <guimenu>Group</guimenu> <guimenuitem>Mark All as Unread</guimenuitem>
de: <guimenu>Gruppen</guimenu> <guimenuitem>Alle als ungelesen markieren</guimenuitem>

source: Sets the status of all articles in the active newsgroup to unread.
de: Setzt den Status aller Artikel in der Newsgruppe auf ungelesen.

source: <guimenu>Group</guimenu> <guimenuitem>Mark Last as Unread</guimenuitem>
de: <guimenu>Gruppen</guimenu> <guimenuitem>Letzte als ungelesen markieren</guimenuitem>

source: To be written.
de: Noch nicht beschrieben.

source: <guimenu>Group</guimenu> <guimenuitem>Group Properties</guimenuitem>
de: <guimenu>Gruppen</guimenu> <guimenuitem>Gruppen-Einstellungen</guimenuitem>

source: Opens the dialog for the group properties.
de: Öffnet den Dialog für die Gruppeneigenschaften.

source: <guimenu>Group</guimenu> <guimenuitem>Unsubscribe From Group</guimenuitem>
de: <guimenu>Gruppen</guimenu> <guimenuitem>Gruppe kündigen</guimenuitem>

source: Unsubscribes from the active newsgroup
de: Kündigt die gerade aktive Newsgruppe.

source: The <guimenu>Folder</guimenu> menu
de: Das Menü <guimenu>Ordner</guimenu>

source: <guimenu>Folder</guimenu> <guimenuitem>New Folder</guimenuitem>
de: <guimenu>Ordner</guimenu> <guimenuitem>Neuer Ordner</guimenuitem>

source: Creates a new main folder.
de: Legt einen neuen Hauptordner an.

source: <guimenu>Folder</guimenu> <guimenuitem>New Subfolder</guimenuitem>
de: <guimenu>Ordner</guimenu> <guimenuitem>Neuer Unterordner</guimenuitem>

source: Creates a new subfolder.
de: Legt einen neuen Unterordner an.

source: <guimenu>Folder</guimenu> <guimenuitem>Rename Folder</guimenuitem>
de: <guimenu>Ordner</guimenu> <guimenuitem>Ordner umbenennen</guimenuitem>

source: Here you can rename the active folder.
de: Hiermit kann man den markierten Ordner umbenennen.

source: <guimenu>Folder</guimenu> <guimenuitem>Import MBox Folder...</guimenuitem>
de: <guimenu>Ordner</guimenu> <guimenuitem>MBox-Ordner importieren ...</guimenuitem>

source: With this function it is possible to import an MBox folder into the active folder.
de: Mit dieser Funktion kann man einen MBox-Ordner in den markierten Ordner importieren.

source: <guimenu>Folder</guimenu> <guimenuitem>Export as MBox Folder...</guimenuitem>
de: <guimenu>Ordner</guimenu> <guimenuitem>Als MBox-Ordner exportieren ...</guimenuitem>

source: With this function you can export the active folder as an MBox folder.
de: Mit dieser Funktion können Sie den markierten Ordner in einen MBox-Ordner exportieren.

source: <guimenu>Folder</guimenu> <guimenuitem>Compact Folder</guimenuitem>
de: <guimenu>Ordner</guimenu> <guimenuitem>Ordner komprimieren</guimenuitem>

source: Removes all deleted articles from the active folder.
de: Entfernt gelöschte Nachrichten aus dem markierten Ordner.

source: <guimenu>Folder</guimenu> <guimenuitem>Compact All Folders</guimenuitem>
de: <guimenu>Ordner</guimenu> <guimenuitem>Alle Ordner komprimieren</guimenuitem>

source: Removes all deleted articles from the every folder.
de: Entfernt gelöschte Nachrichten aus allen Ordnern.

source: <guimenu>Folder</guimenu> <guimenuitem>Empty Folder</guimenuitem>
de: <guimenu>Ordner</guimenu> <guimenuitem>Ordner leeren</guimenuitem>

source: Deletes all articles from the active folder.
de: Löscht alle Nachrichten aus dem markierten Ordner.

source: <guimenu>Folder</guimenu> <guimenuitem>Delete Folder</guimenuitem>
de: <guimenu>Ordner</guimenu> <guimenuitem>Ordner löschen</guimenuitem>

source: Deletes the active folder.
de: Löscht den markierten Ordner.

source: The <guimenu>Article</guimenu> menu
de: Das Menü <guimenu>Artikel</guimenu>

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo> </shortcut> <guimenu>Article</guimenu> <guimenuitem>Post to Newsgroup...</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl; <keycap>N</keycap> </keycombo> </shortcut> <guimenu>Artikel</guimenu> <guimenuitem>In Newsgruppe veröffentlichen ...</guimenuitem>

source: Opens the Composer, with the settings for writing new articles set to those of the active newsgroup.
de: Ruft den Artikel-Editor mit den Vorgaben zum Verfassen eines neuen Artikels für die aktive Newsgruppe auf.

source: <shortcut><keycap>R</keycap></shortcut> <guimenu>Article</guimenu> <guimenuitem>Followup to Newsgroup</guimenuitem>
de: <shortcut> <keycap>R</keycap> </shortcut> <guimenu>Artikel</guimenu> <guimenuitem>Folgenachricht an Newsgruppe</guimenuitem>

source: Opens the Composer for writing a followup, with the content of the active article.
de: Ruft den Artikel-Editor zum Verfassen einer Folgenachricht mit dem Inhalt des gerade aktiven Artikels auf.

source: <shortcut><keycap>A</keycap></shortcut> <guimenu>Article</guimenu> <guimenuitem>Reply by Email...</guimenuitem>
de: <shortcut> <keycap>A</keycap> </shortcut> <guimenu>Artikel</guimenu> <guimenuitem>Antworten per E-Mail ...</guimenuitem>

source: Opens the Composer for writing an e-mail to the author of the active article.
de: Ruft den Artikel-Editor zum Verfassen einer E-Mail an den Verfasser des gerade aktiven Artikels auf.

source: <shortcut><keycap>F</keycap></shortcut> <guimenu>Article</guimenu> <guimenuitem>Forward by Email...</guimenuitem>
de: <shortcut> <keycap>F</keycap> </shortcut> <guimenu>Artikel</guimenu> <guimenuitem>Weiterleiten per E-Mail ...</guimenuitem>

source: Opens the Composer for forwarding the active article as e-mail.
de: Ruft den Artikel-Editor zum Weiterleiten des gerade aktiven Artikels per E-Mail auf.

source: <shortcut><keycap>D</keycap></shortcut> <guimenu>Article</guimenu> <guisubmenu>Mark as Read</guisubmenu>
de: <shortcut> <keycap>D</keycap> </shortcut> <guimenu>Artikel</guimenu> <guisubmenu>Als gelesen markieren</guisubmenu>

source: Set the status of the active article to <quote>read</quote>
de: Setzt den Status des aktiven Artikels auf <quote>gelesen</quote>.

source: <shortcut><keycap>U</keycap></shortcut> <guimenu>Article</guimenu> <guisubmenu>Mark as Unread</guisubmenu>
de: <shortcut> <keycap>U</keycap> </shortcut> <guimenu>Artikel</guimenu> <guisubmenu>Als ungelesen markieren</guisubmenu>

source: Set the status of the active article to <quote>unread</quote>
de: Setzt den Status des aktiven Artikels auf <quote>ungelesen</quote>.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>D</keycap></keycombo></shortcut> <guimenu>Article</guimenu> <guisubmenu>Mark Thread as Read</guisubmenu>
de: <shortcut> <keycombo action="simul">&Ctrl; <keycap>D</keycap> </keycombo> </shortcut> <guimenu>Artikel</guimenu> <guisubmenu>Diskussion als gelesen markieren</guisubmenu>

source: Set the status of the active thread to <quote>read</quote>
de: Setzt den Status der Artikel der aktiven Diskussion auf <quote>gelesen</quote>.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>U</keycap></keycombo></shortcut> <guimenu>Article</guimenu> <guisubmenu>Mark Thread as Unread</guisubmenu>
de: <shortcut> <keycombo action="simul">&Ctrl; <keycap>U</keycap> </keycombo> </shortcut> <guimenu>Artikel</guimenu> <guisubmenu>Diskussion als ungelesen markieren</guisubmenu>

source: Set the status of the active thread to <quote>unread</quote>
de: Setzt den Status der Artikel der aktiven Diskussion auf <quote>ungelesen</quote>.

source: <guimenu>Article</guimenu> <guimenuitem>Cancel Article</guimenuitem>
de: <guimenu>Artikel</guimenu> <guimenuitem>Artikel zurücknehmen</guimenuitem>

source: Generate a message which deletes the active Article in Usenet; you can only use this with your own articles.
de: Generiert eine Nachricht, die den aktiven Artikel im Usenet löscht. Diese Funktion kann nur auf eigene Artikel angewendet werden.

source: <guimenu>Article</guimenu> <guimenuitem>Supersede Article</guimenuitem>
de: <guimenu>Artikel</guimenu> <guimenuitem>Artikel überschreiben</guimenuitem>

source: Opens the Composer with the content of the active article; when this article is posted it overwrites the original article. You can only use this with your own articles.
de: Ruft den Artikel-Editor mit dem Inhalt des aktiven Artikels auf. Wird dieser Artikel versendet, ersetzt er den ursprünglichen Artikel. Diese Funktion kann nur auf eigene Artikel angewendet werden.

source: <shortcut><keycap>O</keycap></shortcut> <guimenu>Article</guimenu> <guimenuitem>Open in Own Window</guimenuitem>
de: <shortcut> <keycap>O</keycap> </shortcut> <guimenu>Artikel</guimenu> <guimenuitem>In eigenem Fenster öffnen</guimenuitem>

source: The active article is opened in a new window.
de: Der aktive Artikel wird in einem eigenen Betrachter geöffnet.

source: <shortcut><keycap>E</keycap></shortcut> <guimenu>Article</guimenu> <guimenuitem>Edit Article...</guimenuitem>
de: <shortcut> <keycap>E</keycap> </shortcut> <guimenu>Artikel</guimenu> <guimenuitem>Artikel bearbeiten</guimenuitem>

source: <action> Opens the Composer for editing the active article;</action> you can only use this in the <guilabel>Outbox</guilabel> and <guilabel>Drafts</guilabel> folders.
de: <action> Öffnet den Artikel-Editor zum Bearbeiten des aktiven Artikels.</action> Es können nur Artikel in den Ordnern <guilabel>Ausgang</guilabel> und <guilabel>Entwürfe</guilabel> bearbeitet werden.

source: <shortcut><keycap>Del</keycap></shortcut> <guimenu>Article</guimenu> <guimenuitem>Delete Article</guimenuitem>
de: <shortcut> <keycap>Entf</keycap> </shortcut> <guimenu>Artikel</guimenu> <guimenuitem>Artikel löschen</guimenuitem>

source: <action> Deletes the active article.</action> You can only use this in the <guilabel>Outbox</guilabel> and <guilabel>Drafts</guilabel> folders.
de: <action>Löscht den aktiven Artikel.</action> Es können nur Artikel in den Ordnern <guilabel>Ausgang</guilabel> und <guilabel>Entwürfe</guilabel> gelöscht werden.
