Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdepim/knode_introduction.po
Languages: de

source: Introduction
de: Einführung

source: &knode; is an easy-to-use, convenient newsreader; it is intended to allow even newbies to use a newsreader under &kde;, but it also offers advanced features appealing to experienced users. &knode; is a online-reader but could work together with a newsserver like <application>leafnode</application> as an offline-reader.
de: &knode; ist ein einfach zu bedienender, komfortabler Newsreader. Er wurde mit dem Ziel entwickelt, auch dem unerfahrenen Anwender den Einsatz eines Newsreaders unter &kde; zu ermöglichen. Abgesehen davon bietet &knode; aber auch weitergehende Fähigkeiten, die den erfahreneren Anwender ansprechen. &knode; ist ein Online-Reader, kann aber im Zusammenspiel mit einem lokalen News-Server, z. B. <application>leafnode</application>, quasi als Offline-Reader betrieben werden.

source: As of version 0.4 &knode; complies with all the requirements of the <ulink url="http://www.gnksa.org/"><glossterm>GNKSA</glossterm></ulink>.
de: &knode; erfüllt seit der Version 0.4 alle Anforderungen der <ulink url="http://www.gnksa.org/"><glossterm>GNKSA</glossterm></ulink>.

source: If you have problems or questions about this program, please contact the mailing list for &kde; users (for subscription, see <ulink url="http://www.kde.org/support/mailinglists/">Homepage of the &kde; mailing lists</ulink>) or one of the &kde; newsgroups:
de: Wenn Sie Probleme und Fragen zu diesem Programm haben, wenden Sie sich an die englischsprachige Mailingliste für &kde;-Benutzer (Anmeldung siehe: <ulink url="http://www.kde.org/support/mailinglists/"> Homepage der &kde; Mailinglisten</ulink>) oder eine der &kde;-Newsgruppen:

source: comp.windows.x.kde
de: comp.windows.x.kde (englischsprachig)

source: de.comp.os.unix.apps.kde (german)
de: de.comp.os.unix.apps.kde (deutschsprachig)

source: If you have found a bug or have suggestions regarding the functionality of &knode; please report them via the <menuchoice><guimenu>Help</guimenu><guimenuitem>Report bug...</guimenuitem></menuchoice> menu.
de: Finden Sie einen Fehler oder haben Sie Anregungen, die die Funktionalität von &knode; betreffen, melden Sie diese bitte über den Menüpunkt <menuchoice><guimenu>Hilfe</guimenu> <guimenuitem>Probleme oder Wünsche berichten ...</guimenuitem></menuchoice>.

source: Please make sure when asking questions in the newsgroups and mailing lists mentioned above that the question you are asking is not answered in this manual.
de: Bitte achten Sie darauf, dass Sie in den erwähnten Newsgruppen und der Mailingliste keine Fragen stellen, die bereits ausreichend durch dieses Handbuch beantwortet werden.

source: For those new to reading news and posting articles, the <link linkend="knode-journey">A journey through Usenet</link> chapter is recommended; it is not so much about &knode; as how to move about in the Usenet with its help. In general, it is not sufficient to just master a news reader for writing news articles: imagine a car driver who masters his car perfectly but does not know about the traffic rules or signs; do you want to encounter such a driver when out in traffic? So please take your time to learn at least a little about the <quote>traffic rules</quote> of the Usenet; the other participants will thank you.
de: In diesem Zusammenhang möchte ich jedem, der gerade erst anfängt News zu lesen und selbst Artikel zu verfassen, die Lektüre des Kapitels<link linkend="knode-journey"> Ein Streifzug durch das Usenet</link> wärmstens ans Herz legen. Es beschäftigt sich weniger mit dem Programm &knode; als vielmehr damit, wie man sich mit seiner Hilfe im Usenet bewegt. Es reicht im allgemeinen nicht aus, die Bedienung eines Newsreaders zu beherrschen, um News zu verfassen. Man stelle sich einen Autofahrer vor, der sein Fahrzeug perfekt beherrscht, aber weder die Verkehrsregeln noch die entsprechenden Verkehrsschilder kennt. Möchten Sie so einem Autofahrer im Straßenverkehr begegnen? Also nehmen Sie sich die Zeit, die <quote>Verkehrsregeln</quote> des Usenet zumindest anzulesen. Die anderen Teilnehmer im Usenet werden es Ihnen danken.

source: &knode; supports you in many cases with hints and warnings: if you do not simply ignore them you will avoid many beginners' mistakes; but, do not exclusively depend on them either.
de: &knode; unterstützt Sie in vielen Fällen mit Hinweisen und Warnungen. Wenn Sie diese nicht einfach in den Wind schlagen, vermeiden Sie eine Reihe von Anfängerfehlern. Aber verlassen Sie sich nicht ausschließlich darauf.

source: Please address suggestions and criticisms at the author or at the responsible translator for your language.
de: Anregungen und Kritik zu diesem Handbuch richten Sie bitte an den Autor bzw. den für Ihre Sprache zuständigen Übersetzer.
