Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdepim/knode_using-morefeatures.po
Languages: de

source: The Advanced &knode; Features
de: Weiterführende Funktionen von &knode;

source: Defining and Using Filters
de: Definieren und Anwenden von Filtern

source: You may already have read about using filters in the chapter explaining the configuration of &knode;; there, we were talking about the built-in filters provided by &knode; there. You can configure the built-in filters like all the others. The screenshot below shows the dialog box for configuring the filters.
de: Im Kapitel über die Einrichtung von &knode; haben wir bereits die Anwendung von Filtern anhand der vordefinierten Filter betrachtet, die &knode; zur Verfügung stellt. Auch diese können, wie alle Filter, jederzeit von Ihnen bearbeitet und an Ihre persönlichen Bedürfnisse angepasst werden. Die Abbildung zeigt den Dialog zum Bearbeiten der Filter.

source: While filters and scoring are very powerful and have many uses, one of the most common requirements is simply to add all posts written by someone you don't wish to read to a <quote>killfile</quote>. At the <link linkend="killfiles">end of this section</link> is a quick guide to using filters and scores to create such a killfile.
de: Obwohl Filtern und Bewerten leistungsfähige Funktionen sind und vielfältig eingesetzt werden können, ist eine der meistgefragten Funktionen die Möglichkeit alle Artikel eines Absenders, von dem Sie nichts lesen wollen, in ein <quote>killfile</quote> einzutragen. Am Ende <link linkend="killfiles">dieses Abschnitts</link> finden Sie eine kurze Anleitung wie Sie das mit Filtern und Bewerten erreichen.

source: <screeninfo>The <guilabel>New Filter</guilabel> dialog</screeninfo>
de: <screeninfo>Der Dialog <guilabel>Neuer Filter</guilabel></screeninfo>

source: <phrase>The <guilabel>New Filter</guilabel> dialog</phrase>
de: <phrase>Der Dialog <guilabel>Neuer Filter</guilabel></phrase>

source: <para>The <guilabel>New Filter</guilabel> dialog</para>
de: <para>Der Dialog <guilabel>Neuer Filter</guilabel></para>

source: First we will create a new filter. You may, at some point, want to find your own articles amongst all the others; or, you may not want to see the articles posted by a particular person at all: both cases can be solved by a simple filter on the Sender. Here are some examples:
de: Zunächst wollen wir einen neuen Filter erstellen. Es gibt sicherlich den Fall, dass Sie Ihre eigenen Artikel im Wust der anderen finden möchten, oder aber Artikel einer bestimmten Person überhaupt nicht sehen möchten. Beide Fälle können sehr einfach durch einen Filter auf den Absender abgedeckt werden. Hier einige Beispiele für Filter:

source: Do Not Show The Articles by a Particular Person
de: <glossterm> Artikel</glossterm> einer bestimmten Person nicht anzeigen

source: <guimenu>Settings</guimenu><guimenuitem>Configure KNode...</guimenuitem><guilabel>Reading News</guilabel><guilabel>Filters</guilabel>
de: <guimenu> Einstellungen</guimenu> <guimenuitem> KNode einrichten ...</guimenuitem> <guilabel> News lesen</guilabel> <guilabel> Filter</guilabel>

source: Select <guibutton>New...</guibutton>
de: Wählen Sie <guibutton>Neu ...</guibutton>

source: Insert <userinput>Do not show idiot</userinput> in the Text Box <guilabel>Name</guilabel>
de: Im Feld <guilabel>Name</guilabel> geben Sie <userinput>Nervensäge nicht anzeigen</userinput> ein.

source: To make the filter appear on the menu, check <guilabel>Show in menu</guilabel>.
de: Damit der Filter im Menü später angezeigt wird, markieren Sie das Ankreuzfeld <guilabel>Im Menü anzeigen</guilabel>.

source: Go to the <guilabel>From</guilabel> area.
de: Begeben Sie sich in den Bereich <guilabel>Absender</guilabel>.

source: Choose <guilabel>Does NOT contain</guilabel> from the drop-down box.
de: Wählen Sie in der nebenstehenden Auswahlbox den Eintrag <guilabel>enthält NICHT</guilabel> aus.

source: Insert the name of the person you want to ignore in the now- active Text Box; for example, <userinput>Idiot</userinput>.
de: In das nun aktiv gewordene Eingabefeld tragen Sie den Namen des unerwünschten Absenders ein. Beispielsweise <userinput>Nervensäge</userinput>.

source: Confirm the filter settings with <guibutton>OK</guibutton>.
de: Bestätigen Sie das Erstellen des Filters mit <guibutton>OK</guibutton>.

source: The filter now shows all articles, except the ones containing <quote>Idiot</quote> in the From: line.
de: Der Filter zeigt nun alle <glossterm>Artikel</glossterm> an, außer denen, die den Absender <quote>Nervensäge</quote> haben.

source: You can combine the settings of the 'Subject + From' tab with the settings on the other tabs. For example:
de: Selbstverständlich können Sie die Einstellungen der Dialogseite Betreff + Absender mit den Einstellungen auf den anderen Dialogseiten kombinieren. Ein Beispiel hierzu:

source: Show only discussion with unread follow-ups on own articles.
de: Nur Diskussionen anzeigen, in denen ungelesene Folgenachrichten auf Ihre <glossterm>Artikel</glossterm> vorliegen

source: Select the predefined filter <guilabel>threads with own articles</guilabel>
de: Wählen Sie den vordefinierten Filter <guilabel>Diskussionen mit eigenen Artikeln</guilabel> aus.

source: Select <guibutton>Copy</guibutton>
de: Betätigen Sie <guibutton>Kopieren</guibutton>

source: Insert <userinput>My threads with unread</userinput> in the <guilabel>Name</guilabel> field.
de: Im Feld <guilabel>Name</guilabel> geben Sie <userinput>Meine Diskussionen mit Ungelesenen</userinput> ein.

source: Select the <guilabel>Status</guilabel> tab
de: Wechseln Sie zur Dialogseite <guilabel>Status</guilabel>.

source: Select <guilabel>has new followups</guilabel>
de: Wählen Sie das Ankreuzfeld <guilabel>ungelesene Folgenachrichten liegen vor</guilabel>

source: Select <guilabel>true</guilabel> in the drop-down box next to it.
de: Wählen Sie in der Auswahlbox daneben die Einstellung <guilabel>wahr</guilabel>.

source: Confirm the filter settings with <guibutton>OK</guibutton>
de: Bestätigen Sie das Erstellen des Filters mit <guibutton>OK</guibutton>

source: This filter shows all the threads your are participating in which have unread messages; also, you have seen the possibility of using existing filters as a base for new ones: this makes life easier for complex filters.
de: Der Filter zeigt nun alle Diskussionen an, bei denen sie beteiligt sind und in denen noch ungelesene Antworten auf Ihre Artikel vorliegen. Gleichzeitig haben Sie gesehen, dass Sie neue Filter auf Grundlage bereits vorhandener Filter erstellen können. Dies stellt bei komplexeren Filtern, die sich nur durch Details unterscheiden eine große Erleichterung dar.

source: Show all articles, no older than 3 days, containing KNode in the subject.
de: Alle Artikel zeigen, die im Betreff das Wort KNode enthalten und nicht älter als drei Tage sind.

source: Select <guibutton>Add</guibutton>
de: Wählen Sie <guibutton>Hinzufügen</guibutton>

source: Insert <userinput>Latest KNode threads</userinput> in the <guilabel>Name</guilabel> field.
de: Im Feld <guilabel>Name</guilabel> geben Sie <userinput>Letzte KNode Diskussionen</userinput> ein.

source: To make the filter appear in the menu, check <guilabel>show in menu</guilabel>.
de: Damit der Filter im Menü später angezeigt wird, markieren Sie das Ankreuzfeld <guilabel>Im Menü anzeigen</guilabel>.

source: From the <guilabel>apply on</guilabel> drop-down box select <guilabel>single articles</guilabel>
de: In der Auswahlbox <guilabel>Anwenden auf</guilabel> wählen Sie <guilabel>Einzelne Artikel</guilabel>

source: Go to the <guilabel>Subject</guilabel> area and select <guilabel>does contain</guilabel> in the drop-down box.
de: Wählen Sie im Bereich <guilabel>Betreff</guilabel> den Eintrag <guilabel>enthält</guilabel> aus dem Auswahlfeld aus.

source: Insert <userinput>knode</userinput> in the text box.
de: In das Eingabefeld tragen Sie das Wort <userinput>knode</userinput> ein.

source: Change to the <guilabel>Additional</guilabel> tab
de: Wechseln Sie zur Dialogseite <guilabel>Weitere</guilabel>

source: Select the <guilabel>Age</guilabel> check box
de: Wählen Sie das Ankreuzfeld <guilabel>Alter</guilabel>

source: Enter the following settings: <guilabel>0 &lt; days &lt;= 3</guilabel>
de: Treffen Sie folgende Einstellung <guilabel> 0 &lt; Tage &gt;= 3</guilabel>

source: This filter, now, shows all articles, no older than 3 days, containing <emphasis>knode</emphasis> in the subject.
de: Der Filter zeigt nun alle Artikel an, die nicht älter als drei Tage sind, und in denen im Betreff der Begriff<emphasis> knode</emphasis> auftaucht.

source: Creating a Killfile
de: Das Anlegen eines Killfiles

source: &knode; offers viewing filters (<guilabel>all</guilabel>, <guilabel>unread only</guilabel>, <guilabel>my posts</guilabel>, &etc;) and scoring filters (threads and articles start with a score of zero and can be adjusted according to author, thread, &etc;).
de: &knode; bietet Ansichtsfilter (<guilabel>Alle</guilabel>, <guilabel>Ungelesene</guilabel>, <guilabel>Eigene Artikel</guilabel>) und Bewertungsfilter (Diskussionen und Artikel haben zunächst eine Bewertung von 0 und dies kann abhängig von Autor, Diskussion &etc; angepasst werden).

source: Using viewing filters you could hide articles according to poster, but this is not really suitable when you want to kill several posters universally.
de: Mit den Ansichtsfiltern können Sie Artikel abhängig vom Autor ausblenden. Aber das ist nicht wirklich nützlich, wenn Sie mehrere Autoren übergreifend ignorieren möchten.

source: Using the scoring gives lots of control but filters only at the thread level, i.e. you can watch and ignore threads; the disadvantage of this, however, is that you may lose otherwise-useful threads just because of one poster.
de: Die Verwendung der Bewertungsfunktion ermöglicht Vieles, funktioniert aber nur auf der Ebene von Diskussionen: Sie können Diskussionen überwachen und ignorieren. Das hat aber den Nachteil, dass Sie hierbei ansonsten interessante Diskussionen nur wegen eines Autors komplett ignorieren müssten.

source: The solution is to use these in combination.
de: Die Lösung liegt in der Kombination dieser Funktionalitäten.

source: Go to <menuchoice><guimenu>Settings</guimenu><guimenuitem>Configure KNode</guimenuitem><guilabel>Reading News</guilabel><guilabel>Filters</guilabel></menuchoice>.
de: Öffnen Sie <menuchoice><guimenu>Einstellungen</guimenu><guimenuitem>KNode einrichten ...</guimenuitem><guilabel>News lesen</guilabel><guilabel>Filter</guilabel></menuchoice>.

source: Create a new filter below <guilabel>unread</guilabel>, called <userinput>killfile on</userinput>. Be sure that <guilabel>Apply to single articles</guilabel> is set and then click on the <guilabel>Additional</guilabel> tab. Set score <quote>equal to or less than zero</quote> (<guilabel>&lt;=</guilabel>); then click the <guibutton>OK</guibutton> until you have exited the dialog.
de: Erstellen Sie einen neuen Filter unter <guilabel>Ungelesene</guilabel> und geben Sie ihm den Namen <userinput>killfile an</userinput>. Stellen Sie sicher, dass <guilabel>Anwenden auf einzelne Artikel</guilabel> gesetzt ist und wechseln Sie zur Karteikarte <guilabel>Sonstiges</guilabel>. Setzen Sie Bewertung auf <quote>kleiner oder gleich Null</quote> (<guilabel>&lt;=</guilabel>); und klicken Sie auf <guibutton>OK</guibutton>, um den Dialog zu schließen.

source: Open an article whose author should be killed and just type <keycombo action="simul">&Ctrl;<keycap>L</keycap></keycombo> (or select, from the <guimenu>Scoring</guimenu> menu, <guimenuitem>Lower Score for Author</guimenuitem>). This opens the Rule Editor (a part of scoring). You can optionally give the rule a name that matches the author (<userinput>Kook</userinput>, for example.) and then, if this is to be permanent, uncheck the <guilabel>Expire rule automatically</guilabel> box; you'll see that this rule will change the author's score to minus ten (or the score you entered); finally, click <guibutton>OK</guibutton>.
de: Öffnen Sie einen Artikel eines Absenders, der in das killfile soll und geben Sie <keycombo action="simul">&Ctrl;<keycap>L</keycap></keycombo> ein (oder wählen Sie im Menü <guimenu>Bewertung</guimenu>, <guimenuitem>Bewertung für Autor herabsetzen</guimenuitem>). Der Regeleditor wird geöffnet. Optional können Sie der Regel einen Namen geben (z. B. <userinput>Kook</userinput>) und diese dauerhaft machen, indem Sie das Ankreuzfeld <guilabel>Regel wird automatisch ungültig</guilabel> ausschalten. Sie werden feststellen, dass diese Regel die Bewertung des Absenders auf -10 (oder den gewünschten Wert) setzt. Speichern Sie die Regel mit <guibutton>OK</guibutton>.

source: Go to the menu item <menuchoice><guimenu>View</guimenu><guisubmenu>Filter</guisubmenu><guimenuitem>killfile on</guimenuitem> </menuchoice>.
de: Gehen Sie zum Menüpunkt <menuchoice><guimenu>Ansicht</guimenu><guisubmenu>Filter</guisubmenu><guimenuitem>killfile</guimenuitem> </menuchoice>.

source: This will cause any articles with scores less than zero will disappear; to kill additional authors you only need repeat the <keycombo action="simul">&Ctrl;<keycap>L</keycap></keycombo> part of these instructions.
de: Alle Artikel mit einer Bewertung, die kleiner als 0 ist, werden nicht mehr angezeigt. Um weitere Absender in das killfile einzutragen, müssen Sie nur die den mit <keycombo action="simul">&Ctrl;<keycap>L</keycap></keycombo> durchgeführten Teil dieser Anleitung für diesen Absender wiederholen.

source: The Composer
de: Der Editor

source: The &knode; composer provides many features, especially for posting and replying to articles.
de: Der Editor von &knode; bietet neben den bereits vorgestellten Funktionen weitere Eigenschaften, die das Verfassen und Beantworten von Artikeln und E-Mails erleichtern.

source: Publish Articles in Multiple Newsgroups
de: Artikel in mehreren Newsgruppen veröffentlichen

source: By selecting the Button <guilabel>Browse</guilabel> you can choose additional newsgroups you want to publish your article in.
de: Über den Knopf <guilabel>Auswählen</guilabel> können Sie weitere Newsgruppen auswählen, in denen Ihr Artikel erscheinen soll.

source: It is generally undesirable to post articles in multiple newsgroups: please think twice about it; if you are not sure where to post your article ask in one of the possible groups &mdash; somebody will tell you were to post.
de: Das Veröffentlichen eines Artikels in mehreren Newsgruppen ist in den allermeisten Fällen unerwünscht und sollte sehr sorgfältig erwogen werden. Wenn Sie nicht genau wissen, wohin Ihr Artikel gehört, fragen Sie lieber in einer der in Frage kommenden Gruppen nach. Dort wird man Sie ggf. in die richtige Newsgruppe umleiten.

source: Redirect Followups
de: Folgenachrichten umleiten

source: The main use of this feature is when a thread has gone off topic for the newsgroup in which it is posted; for example, a thread may start in a &kde; newsgroup discussing how to redirect a followup in &knode;, but may leads to a dicussion about graphical and text based newsreaders.
de: Die hauptsächliche Verwendung dieser Funktion erfolgt dann, wenn im Verlauf einer Diskussion ein Themenwechsel stattfindet, der dazu führt, dass diese off-topic wird, d. h. die Diskussion verlässt das Themengebiet der Newsgruppe. Ein Beispiel hierfür wäre eine Diskussion in einer &kde;-Gruppe, die ursprünglich aus der Frage bestand, wie man mit &knode; eine Folgenachricht umleitet und die dann zu der Diskussion führt, ob grundsätzlich grafischen den textorientierten Newsreadern der Vorzug zu geben ist.

source: Sometimes it happens that usenet users post an article into the wrong newsgroup; very often those articles are just ignored. If it looks like the author did this unintentionally, you might like to tell them politely and make the followup articles go into the right group.
de: Zuweilen kommt es vor, dass ein Usenet-Teilnehmer, sei es aus Unwissenheit oder Ignoranz einen Artikel veröffentlicht, der in dieser Newsgruppe eigentlich nichts verloren hat. Sehr häufig werden diese Artikel einfach ignoriert. Wenn aber deutlich ist, dass der Verfasser dies eher unabsichtlich getan hat, sollten Sie ihn in Ihrer Antwort höflich darauf hinweisen und gleichzeitig dafür sorgen, dass die nachfolgende Artikel dieser Diskussion in die richtige Newsgruppe umgeleitet werden.

source: Another reason for using <guilabel>Followup-To:</guilabel> is a when dealing with articles cross-posted across in multiple newsgroups: you should take care that the replies are only posted in one single newsgroup.
de: Eine weitere Anwendung für <guilabel>Folgenachricht an</guilabel> ist die Veröffentlichung eines Artikels in mehreren Newsgruppen, ein sogenanntes Crossposting. Sie sollten dafür sorgen, dass die Antworten nur noch in einer Newsgruppe landen.

source: You can activate this by filling the text box <guilabel>Followup-To:</guilabel>; here you can enter the suitable group. If there are multiple newsgroups in the <guilabel>Groups:</guilabel> field, they are shown in the drop-down list.
de: Dies geschieht über das Auswahlfeld <guilabel>Folgenachricht an</guilabel>. In diesem Feld können Sie die passende Newsgruppe eintragen. Sind unter <guilabel>Gruppen:</guilabel> bereits mehrere Gruppen eingetragen, werden diese bereits als Auswahl angeboten.

source: If you enter <userinput>poster</userinput> here, instead of a newsgroup, the replies will go directly to the author, not to the newsgroup.
de: Wenn Sie hier <userinput> poster</userinput> anstelle einer Newsgruppe eingeben, wird Ihre Antwort per E-Mail an den Verfasser des Artikels (den Poster) umgeleitet und nicht in die Newsgruppe.

source: Some people put an email address here, but this is not a valid entry: use <userinput>poster</userinput> and correctly set your Reply-To address in the normal &knode; settings.
de: Einige Leute tragen hier eine E-Mailadresse ein, aber das ist kein gültiger Eintrag. Verwenden Sie <userinput>poster</userinput> und tragen Sie die Antwortadresse in den &knode;-Einstellungen korrekt ein.

source: Working With an External Editor
de: Arbeiten mit einem externen Editor

source: Using <menuchoice><guimenu>Tools</guimenu><guimenuitem>Start External Editor</guimenuitem></menuchoice> you can start an editor of your choice for editing the reply; this way you can use your preferred Editor for writing articles and e-mails.
de: Über den Menüpunkt <menuchoice><guimenu>Extras</guimenu><guimenuitem> Externen Editor aufrufen</guimenuitem></menuchoice> wird ein Editor Ihrer Wahl aufgerufen, in dem Sie den geöffneten Artikel bearbeiten können. Dies hat den Vorteil, dass Sie Ihren bevorzugten Editor zum Verfassen der Artikel und E-Mails verwenden können.

source: Spelling
de: Rechtschreibprüfung

source: By selecting <menuchoice><guimenu>Tools</guimenu><guimenuitem>Spelling</guimenuitem></menuchoice>, you can check the article in the composer for spelling errors.
de: Über den Menüpunkt <menuchoice><guimenu>Extras</guimenu><guimenuitem>Rechtschreibung ...</guimenuitem> </menuchoice> können Sie die den Inhalt des Artikels im Editor auf Rechtschreibfehler überprüfen lassen. Es erscheint der Dialog für die Rechtschreibprüfung von &kde;.

source: <title>Sending Attachments</title>
de: <title>Anhänge versenden</title>

source: By selecting <menuchoice><guimenu>Attach</guimenu><guimenuitem>Attach File</guimenuitem></menuchoice> you can open the File Selection Dialog Box; here you can choose the file you want to attach.
de: Über den Menüpunkt <menuchoice><guimenu>Anhängen</guimenu><guimenuitem>Datei anhängen</guimenuitem></menuchoice> öffnet sich der Dateiauswahl-Dialog, in dem Sie bequem die anzuhängende Datei auswählen können.

source: Most of the time, &knode; determines the correct <acronym>MIME</acronym> type for the attachment; if &knode; detects it incorrectly, you can correct the <acronym>MIME</acronym> type manually.
de: &knode; erkennt in den allermeisten Fällen selbstständig den korrekten <acronym>MIME</acronym>-Typ des Anhangs. Sollte sich &knode; einmal irren, können Sie den <acronym>MIME</acronym>-Typ notfalls auch von Hand ändern.

source: This screenshot shows the Composer with 2 attachments: a text file and a PNG picture.
de: Die Abbildung zeigt den Artikel-Editor mit einer PNG-Grafik und einer Textdatei, die als Anhang versendet werden sollen.

source: <screeninfo>Sending Attachments</screeninfo>
de: <screeninfo>Anhänge versenden</screeninfo>

source: <phrase>Sending Attachments</phrase>
de: <phrase>Anhänge versenden</phrase>

source: <para>Sending Attachments</para>
de: <para>Anhänge versenden</para>

source: Only do this if you know what you're doing! An incorrect <acronym>MIME</acronym> type could cause the attachment to be sent incorrectly, or mean that the attachment will not be able to be rebuilt after sending.
de: Tun Sie dies aber nur, wenn Sie genau wissen, was Sie tun. Ein falsch eingetragener <acronym>MIME</acronym>-Typ kann dazu führen, dass der Anhang nicht korrekt versendet wird bzw. später nicht mehr korrekt wiederhergestellt werden kann.

source: The English word attachment is used all over the world; you can use it in your language, too.
de: Anhänge werden im Englischen als Attachments bezeichnet, und viele Usenet Teilnehmer verwenden vorzugsweise diesen Ausdruck.

source: In most newsgroups, attachments are prohibited: do not send unsolicited attachments; if you are asked to send them, look who is asking for them &mdash; normally, the person will want you to send them by email.
de: In den allermeisten Newsgruppen sind Anhänge verpönt. Versenden Sie einen Anhang nicht ohne explizit dazu aufgefordert worden zu sein, und selbst dann sollten Sie darauf achten, wer Sie dazu auffordert. Oft wird es so sein, dass der entsprechende Teilnehmer Sie auffordert, ihm die entsprechenden Anhänge, sofern Sie nötig sind, per E-Mail zu schicken.

source: The news server will probably reject articles with attachments for most groups anyway; those that do accept attachments normally have the word <quote>binaries</quote> in their name. Some news servers even stop carrying non-binaries newsgroups that continuously receive attachments.
de: Der Newsserver weist Artikel mit Anhängen für die meisten Gruppen sowieso zurück. Die Gruppen, bei denen Anhänge akzeptiert werden, tragen meist den Bestandteil <quote>binaries</quote> im Namen. Einige Server akzeptieren Gruppen nicht, bei denen regelmäßig Anhänge auftauchen.

source: Searching for Articles
de: Das Suchen nach Artikeln

source: Sooner or later, you will want to search for one specific article; the &knode; search feature is an easy way to do this.
de: Wenn Sie häufiger News lesen und eine Reihe von Gruppen abonniert haben, werden Sie früher oder später in die Situation kommen, dass Sie einen ganz bestimmten Artikel suchen. Die Suchen-Funktion von &knode; bietet hier eine wesentliche Erleichterung.

source: You can reach the search function by selecting <menuchoice><guimenu>Edit</guimenu><guimenuitem>Search Articles...</guimenuitem></menuchoice> or the by pressing <keycap>F4</keycap>. The screenshot below shows the Search Dialog Box.
de: Sie erreichen die Suchen-Funktion von &knode; über <menuchoice><guimenu>Bearbeiten</guimenu> <guimenuitem>Nach Artikeln suchen ...</guimenuitem> </menuchoice> oder die Taste <keycap>F4</keycap> . Die folgende Abbildung zeigt den Dialog „Suchen“.

source: <screeninfo>The Search Dialog Box</screeninfo>
de: <screeninfo>Der Dialog „Suchen“</screeninfo>

source: <phrase>The Search Dialog Box</phrase>
de: <phrase>Der Dialog „Suchen“</phrase>

source: <para>The Search Dialog Box</para>
de: <para>Der Dialog „Suchen“</para>
