Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdepim/knode_commands.po
Languages: de

source: <guimenu>Article</guimenu> <guimenuitem>Send Now</guimenuitem>
de: <guimenu>Artikel</guimenu> <guimenuitem>Sofort versenden</guimenuitem>

source: <action> Sends the active article.</action> You can only use this in the <guilabel>Outbox</guilabel> and <guilabel>Drafts</guilabel> folders.
de: <action>Versendet die aktive Nachricht.</action> Diese Funktion steht nur in den Ordnern <guilabel>Ausgang</guilabel> und <guilabel>Entwürfe</guilabel> zur Verfügung.

source: The <guimenu>Scoring</guimenu> menu
de: Das Menü <guimenu>Bewertung</guimenu>

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>E</keycap></keycombo></shortcut> <guimenu>Scoring</guimenu> <guimenuitem>Edit Scoring Rules...</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl; <keycap>E</keycap> </keycombo> </shortcut> <guimenu>Bewertung</guimenu> <guimenuitem>Bewertungsregeln bearbeiten ...</guimenuitem>

source: The dialog to edit the scoring rules will be opened.
de: Der Dialog zum Bearbeiten der Bewertungsregeln wird geöffnet.

source: <guimenu>Scoring</guimenu> <guimenuitem>Recalculate Scores</guimenuitem>
de: <guimenu>Bewertung</guimenu> <guimenuitem>Neuberechnung der Bewertungen</guimenuitem>

source: The scores will be reset and recalculated.
de: Die Bewertung wird zurückgesetzt und nach den eingestellten Regeln neu berechnet.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>L</keycap></keycombo></shortcut> <guimenu>Scoring</guimenu> <guimenuitem>Lower Score for Author...</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl; <keycap>L</keycap> </keycombo> </shortcut> <guimenu>Bewertung</guimenu> <guimenuitem>Bewertung für Autor herabsetzen ...</guimenuitem>

source: Creates a rule for lowering the score of all articles posted by the author of the active article.
de: Erstellt eine Regel, nach der alle Artikel des Autors des markierten Artikels eine niedrigere Bewertung erhalten.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>I</keycap></keycombo></shortcut> <guimenu>Scoring</guimenu> <guimenuitem>Raise Score for Author...</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl; <keycap>I</keycap> </keycombo> </shortcut> <guimenu>Bewertung</guimenu> <guimenuitem>Bewertung für Autor heraufsetzen ...</guimenuitem>

source: Creates a rule for raising the score of all articles posted by the author of the active article.
de: Erstellt eine Regel, nach der sämtliche Artikel des Autors des markierten Artikels eine höhere Bewertung erhalten.

source: <shortcut><keycap>W</keycap></shortcut><guimenu>Scoring</guimenu> <guimenuitem>Watch Thread</guimenuitem>
de: <shortcut> <keycap>W</keycap> </shortcut> <guimenu>Bewertung</guimenu> <guimenuitem>Diskussion überwachen</guimenuitem>

source: Sets the score for this thread to the configured score of watched threads (standard = 100).
de: Setzt die Bewertung der Diskussion auf die eingestellte Bewertung für überwachte Diskussionen (Standard = 100).

source: <shortcut><keycap>I</keycap></shortcut> <guimenu>Scoring</guimenu> <guimenuitem>Ignore Thread</guimenuitem>
de: <shortcut> <keycap>I</keycap> </shortcut> <guimenu>Bewertung</guimenu> <guimenuitem>Diskussion ignorieren</guimenuitem>

source: Sets the score for this thread to the configured score of ignored threads (standard = -100).
de: Setzt die Bewertung der Diskussion auf die eingestellte Bewertung für ignorierte Diskussionen (Standard = -100).

source: The <guimenu>Settings</guimenu> menu
de: Das Menü <guimenu>Einstellungen</guimenu>

source: <guimenu>Settings</guimenu> <guimenuitem>Show Toolbar</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>Werkzeugleiste anzeigen</guimenuitem>

source: This option toggles whether the toolbar is shown or not.
de: Diese Einstellung legt fest, ob die Werkzeugleiste angezeigt oder ausgeblendet wird.

source: <guimenu>Settings</guimenu> <guimenuitem>Show Statusbar</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>Statusleiste anzeigen</guimenuitem>

source: This option toggles whether the statusbar is shown or not.
de: Diese Einstellung legt fest, ob die Statusleiste angezeigt oder ausgeblendet wird.

source: <guimenu>Settings</guimenu> <guimenuitem>Configure Shortcuts...</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>Kurzbefehle festlegen ...</guimenuitem>

source: Opens a dialog for configuring the key bindings.
de: Es wird der Dialog zur Einstellung der Tastenbelegung aufgerufen.

source: <guimenu>Settings</guimenu> <guimenuitem>Configure Toolbars...</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>Werkzeugleisten einrichten ...</guimenuitem>

source: Opens a dialog for configuring the toolbars.
de: Es wird der Dialog zur Einrichtung der Werkzeugleisten aufgerufen.

source: <guimenu>Settings</guimenu> <guimenuitem>Configure &knode;...</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>&knode; einrichten ...</guimenuitem>

source: Opens a dialog for configuring &knode;.
de: Es wird der Dialog zur Einrichtung von &knode; aufgerufen.

source: The <guimenu>Help</guimenu> menu
de: Das Menü <guimenu>Hilfe</guimenu>

source: The Composer Menus
de: Das Menü Editor

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>Return</keycap></keycombo></shortcut> <guimenu>File</guimenu> <guimenuitem>Send Now</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>Eingabe</keycap></keycombo></shortcut> <guimenu>Datei</guimenu> <guimenuitem>Sofort versenden</guimenuitem>

source: Sends the current article immediately.
de: Versendet den Artikel im Editor.

source: <guimenu>File</guimenu> <guimenuitem>Send Later</guimenuitem>
de: <guimenu>Datei</guimenu> <guimenuitem>Später senden</guimenuitem>

source: Stores the current article in the <guilabel>Outbox</guilabel> to be sent later.
de: Legt den bearbeiteten Artikel im Ordner <guilabel>Ausgang</guilabel> zum späteren Versenden ab.

source: <guimenu>File</guimenu> <guimenuitem>Save as Draft</guimenuitem>
de: <guimenu>Datei</guimenu> <guimenuitem>Als Entwurf speichern</guimenuitem>

source: Saves the current article in the <guilabel> Drafts</guilabel> folder, so you can finish editing it another time.
de: Legt den bearbeiteten Artikel im Ordner <guilabel>Entwürfe</guilabel> zur späteren Fertigstellung ab.

source: <guimenu>File</guimenu> <guimenuitem>Delete</guimenuitem>
de: <guimenu>Datei</guimenu> <guimenuitem>Entfernen</guimenuitem>

source: Deletes the current article, closing the editor.
de: Löscht den bearbeiteten Artikel und schließt den Editor.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>W</keycap></keycombo></shortcut> <guimenu>File</guimenu> <guimenuitem>Close</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl; <keycap>W</keycap> </keycombo> </shortcut> <guimenu>Datei</guimenu> <guimenuitem>Schließen</guimenuitem>

source: Closes the editor window
de: Schließt das Editorfenster

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>Z</keycap></keycombo></shortcut> <guimenu>Edit</guimenu> <guimenuitem>Undo</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>Z</keycap></keycombo></shortcut> <guimenu>Bearbeiten</guimenu> <guimenuitem>Rückgängig</guimenuitem>

source: Undo the last edit.
de: Macht die letzte Änderung rückgängig.

source: <shortcut><keycombo action="simul">&Ctrl;&Shift;<keycap>Z</keycap></keycombo></shortcut> <guimenu>Edit</guimenu> <guimenuitem>Redo</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;&Shift; <keycap>Z</keycap> </keycombo> </shortcut> <guimenu>Bearbeiten</guimenu> <guimenuitem>Rückgängig</guimenuitem>

source: Redo the last action undone with the <guimenuitem> Undo</guimenuitem> menu entry.
de: Hebt die Wirkung von <guimenuitem>Rückgängig</guimenuitem> wieder auf.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>X</keycap></keycombo></shortcut> <guimenu>Edit</guimenu> <guimenuitem>Cut</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl; <keycap>X</keycap> </keycombo> </shortcut> <guimenu>Bearbeiten</guimenu> <guimenuitem>Ausschneiden</guimenuitem>

source: Cuts the currently-selected text to the clipboard, deleting it from the editor window.
de: Entfernt den markierten Text und legt ihn in die Zwischenablage.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>C</keycap></keycombo></shortcut> <guimenu>Edit</guimenu> <guimenuitem>Copy</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl; <keycap>C</keycap> </keycombo> </shortcut> <guimenu>Bearbeiten</guimenu> <guimenuitem>Kopieren</guimenuitem>

source: Copies the selected text to the clipboard.
de: Kopiert den markierten Text in die Zwischenablage.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>V</keycap></keycombo></shortcut> <guimenu>Edit</guimenu> <guimenuitem>Paste</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl; <keycap>V</keycap> </keycombo> </shortcut> <guimenu>Bearbeiten</guimenu> <guimenuitem>Einfügen</guimenuitem>

source: Pastes the current contents of the clipboard into the editor window.
de: Fügt den Inhalt der Zwischenablage an der Position des Cursors ein.

source: <guimenu>Edit</guimenu> <guimenuitem>Paste as Quotation</guimenuitem>
de: <guimenu>Bearbeiten</guimenu> <guimenuitem>Als Zitat einfügen</guimenuitem>

source: <action> Pastes the current contents of the clipboard into the editor window with a quote character </action> (<quote>&gt;</quote>) at the beginning of each line.
de: <action>Fügt den Inhalt der Zwischenablage an der Position des Cursors ein</action> und setzt an den Zeilenanfang ein Zitatzeichen (<quote>&gt;</quote>).

source: Selects all the text in the editor window.
de: Markiert den gesamten Inhalt des Editorfensters.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>F</keycap></keycombo></shortcut> <guimenu>Edit</guimenu> <guimenuitem>Find</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl; <keycap>F</keycap> </keycombo> </shortcut> <guimenu>Bearbeiten</guimenu> <guimenuitem>Suchen</guimenuitem>

source: Opens the Find dialog.
de: Ruft den Dialog zur Suche auf.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>R</keycap></keycombo></shortcut> <guimenu>Edit</guimenu> <guimenuitem>Replace...</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl; <keycap>R</keycap> </keycombo> </shortcut> <guimenu>Bearbeiten</guimenu> <guimenuitem>Ersetzen</guimenuitem>

source: Opens the Replace dialog.
de: Ruft den Dialog zum Ersetzen von Text im Editorfenster auf.

source: The <guimenu>Attach</guimenu> menu
de: Das Menü <guimenu>Anhängen</guimenu>

source: <guimenu>Attach</guimenu> <guimenuitem>Append Signature</guimenuitem>
de: <guimenu>Anhängen</guimenu> <guimenuitem>Signatur</guimenuitem>

source: Inserts your signature at the end of the article you are editing.
de: Fügt die eigene Signatur an das Ende der bearbeiteten Nachricht.

source: <guimenu>Attach</guimenu> <guimenuitem>Insert File...</guimenuitem>
de: <guimenu>Anhängen</guimenu> <guimenuitem>Datei einfügen ...</guimenuitem>

source: Inserts the contents of a file into the editor window.
de: Fügt den Inhalt einer Datei in das Editorfenster ein.

source: <guimenu>Attach</guimenu> <guimenuitem>Insert File (in a box)...</guimenuitem>
de: <guimenu>Anhängen</guimenu> <guimenuitem>Datei in Bereich einfügen</guimenuitem>

source: Inserts the contents of a file into the editor window and puts a box around of it.
de: Fügt den Inhalt einer Datei in das Editorfenster ein und erstellt einen Rahmen aus ASCII-Zeichen darum.

source: <guimenu>Attach</guimenu> <guimenuitem>Attach File...</guimenuitem>
de: <guimenu>Anhängen</guimenu> <guimenuitem>Datei anhängen ...</guimenuitem>

source: Inserts a file as an attachment.
de: Fügt eine Datei als Anhang hinzu.

source: The <guimenu>Options</guimenu> menu
de: Das Menü <guimenu>Optionen</guimenu>

source: <guimenu>Options</guimenu> <guimenuitem>Send News Article</guimenuitem>
de: <guimenu>Optionen</guimenu> <guimenuitem>News-Artikel versenden</guimenuitem>

source: Toggles whether the message is to be sent as an article or not.
de: Diese Einstellung legt fest, ob die Nachricht als Artikel versendet wird oder nicht.

source: <guimenu>Options</guimenu> <guimenuitem>Send Email</guimenuitem>
de: <guimenu>Optionen</guimenu> <guimenuitem>E-Mail versenden</guimenuitem>

source: Toggles whether the message is to be sent as an email or not; if it's configured, an external editor will be activated.
de: Diese Einstellung legt fest, ob die Nachricht als E-Mail versendet wird oder nicht.

source: <guimenu>Options</guimenu> <guimenuitem>Set Charset</guimenuitem>
de: <guimenu>Optionen</guimenu> <guimenuitem>Zeichensatz einstellen</guimenuitem>

source: Here you can configure the charset used for this article; normally you use us-ascii for English-speaking areas.
de: Hier können Sie den Zeichensatz des Artikels vorgeben. Üblich ist ISO-8859-1.

source: <guimenu>Options</guimenu> <guimenuitem>Word Wrap</guimenuitem>
de: <guimenu>Optionen</guimenu> <guimenuitem>Zeilenumbruch</guimenuitem>

source: Toggles the word wrapping in the editor on or off.
de: Aktiviert/Deaktiviert den Zeilenumbruch im Editor.

source: The <guimenu>Tools</guimenu> menu
de: Das Menü <guimenu>Extras</guimenu>

source: <guimenu>Tools</guimenu> <guimenuitem>Add Quote Characters</guimenuitem>
de: <guimenu>Extras</guimenu> <guimenuitem>Zitatzeichen hinzufügen</guimenuitem>

source: Puts <quote>&gt;</quote> in front of the marked lines.
de: Stellt den markierten Zeilen ein <quote>&gt;</quote> voran.

source: <guimenu>Tools</guimenu> <guimenuitem>Remove Quote Characters</guimenuitem>
de: <guimenu>Extras</guimenu> <guimenuitem>Zitatzeichen entfernen</guimenuitem>

source: Removes the quote characters at the beginning of the marked lines.
de: Entfernt ggf. ein vorhandenes Zitatzeichen am Anfang der markierten Zeilen.

source: <guimenu>Tools</guimenu> <guimenuitem>Add Box</guimenuitem>
de: <guimenu>Extras</guimenu> <guimenuitem>Bereich hinzufügen</guimenuitem>

source: Puts the marked lines in an ASCII box.
de: Stellt die markierten Zeilen in einem ASCII-Fenster dar.

source: <guimenu>Tools</guimenu> <guimenuitem>Remove Box</guimenuitem>
de: <guimenu>Extras</guimenu> <guimenuitem>Bereich entfernen</guimenuitem>

source: Removes the ASCII box around the marked area.
de: Entfernt das ASCII-Fenster um den markierten Bereich.

source: <guimenu>Tools</guimenu> <guimenuitem>Sign Article with PGP</guimenuitem>
de: <guimenu>Extras</guimenu> <guimenuitem>Artikel mit PGP signieren</guimenuitem>

source: Signs the article with PGP.
de: Signiert den Artikel mit PGP.

source: <guimenu>Tools</guimenu> <guimenuitem>Get Original Text (not rewrapped)</guimenuitem>
de: <guimenu>Extras</guimenu> <guimenuitem>Ursprünglichen Text wiederherstellen (ohne Umbruch)</guimenuitem>

source: Rebuilds the original posting when answering to an article.
de: Stellt bei Antworten die ursprüngliche Nachricht wieder her.

source: <guimenu>Tools</guimenu> <guimenuitem>Scramble (Rot-13)</guimenuitem>
de: <guimenu>Extras</guimenu> <guimenuitem>Verschlüsseln (Rot-13)</guimenuitem>

source: Encrypts the marked text by rotating every character 13 characters of the alphabet.
de: Verschlüsselt den markierten Text, indem die Buchstaben um 13 Zeichen im Alphabet verschoben werden.

source: <guimenu>Tools</guimenu> <guimenuitem>Start External Editor</guimenuitem>
de: <guimenu>Extras</guimenu> <guimenuitem>Externen Editor aufrufen</guimenuitem>

source: Start the external editor (if one is configured) with the current contents of the editor window.
de: Startet den externen Editor (sofern eingerichtet) mit dem Inhalt des Editorfensters.

source: <guimenu>Tools</guimenu> <guimenuitem>Spelling...</guimenuitem>
de: <guimenu>Extras</guimenu> <guimenuitem>Rechtschreibung ...</guimenuitem>

source: Opens a dialog box to check your spelling.
de: Ruft den Dialog für die Rechtschreibprüfung auf.

source: Toggles whether the toolbar should be shown or not.
de: Diese Einstellung legt fest, ob die Werkzeugleiste angezeigt oder ausgeblendet wird.

source: Toggles whether the statusbar should be shown or not.
de: Diese Einstellung legt fest, ob die Statusleiste angezeigt oder ausgeblendet wird.

source: <guimenu>Settings</guimenu> <guimenuitem>Configure KNode...</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>KNode einrichten ...</guimenuitem>

source: Open the &knode; Preferences dialog.
de: Ruft den Dialog für die Einrichtung von &knode; auf.
