Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdepim/knode_using-morefeatures.po
Languages: de

source: If you choose a rule-name in the list the rule will be displayed on the right-hand side; now you can edit the rule. At the top you can change the name of the rule and set the newsgroups to which this rule applies. You can choose one or more than one group, note that group names must be separated by a semicolon. You can choose from the subscribed groups with the drop-down list and the <guibutton>Add group</guibutton> button; or you can use regular expressions and wild cards, &eg; <quote>.*</quote> for all groups. The <guilabel>Expire rule automatically</guilabel> option makes it possible to delete the rule automatically after the configured number of days; this is useful if a specific person behaves badly and you do not want to read anything from this person for a few days.
de: Wenn Sie in der Liste eine Regel auswählen, erscheint diese auf der rechten Seite und kann dort bearbeitet werden. Oben können Sie zuerst den Namen der Regel verändern und festlegen, für welche Newsgruppen die Regel gelten soll. Sie können hier entweder eine oder mehrere Gruppen angeben, ggf. durch Semikola getrennt. Weiterhin haben Sie die Möglichkeit, abonnierte Gruppen mit dem Auswahlfeld und dem Knopf <guibutton>Gruppe hinzufügen</guibutton> hinzuzufügen oder einen regulären Ausdruck zu verwenden, &eg; <quote>.*</quote> für alle Gruppen. Die Einstellung <guilabel>Regel wird automatisch ungültig</guilabel> ermöglicht es, die Regel automatisch von &knode; nach den eingestellten Tagen löschen zu lassen. Dies macht z. B. dann Sinn, wenn sich eine Person etwas daneben benimmt und Sie erst einmal einige Tage nichts mehr von demjenigen lesen wollen.

source: In the <guilabel>Condition</guilabel> field you enter the condition on which this rule is activated. Normally, you can enter only one condition, but you can change this by pressing the <guibutton>More</guibutton> and <guibutton>Fewer</guibutton> buttons. If you have more than one condition, you must tell knode whether all conditions need to be fulfilled or only one of them; this can be done by choosing <guilabel>Match all conditions</guilabel> or <guilabel>Match any condition</guilabel> respectively.
de: Im Feld <guilabel>Bedingungen</guilabel> geben Sie die Bedingungen an, die erfüllt sein müssen, damit die Regel greift. Standardmäßig ist dort nur eine Bedingung vorgesehen, das können Sie aber mit den Knöpfen <guibutton>Mehr</guibutton> und <guibutton>Weniger</guibutton> verändern. Wenn Sie mehrere Bedingungen haben, bestimmt das Feld <guilabel>Passt auf alle Bedingungen</guilabel>, dass die Regel erst dann greift, wenn alle Bedingungen erfüllt sind. Ist das Feld <guilabel>Passt auf beliebige Bedingungen</guilabel> ausgewählt, reicht es, wenn eine Bedingung erfüllt ist, damit die Regel greift.

source: Each condition consists of 2 drop-down lists and a text field. In the first list you chose the part of the message which should be used for the condition &mdash; this part will be compared with the text field; the second drop-down list tells &knode; how it is to be compared, for example, whether the chosen header should be identical to the text entered in the text field, or if it just needs to match part of it. Regular expressions are allowed, too. If you check <guilabel>Not</guilabel> then the conditions under which the condition is satisfied are reversed, and the condition will be satisfied if the opposite of its shown conditions is true.
de: Die Bedingung besteht grundsätzlich aus zwei Auswahlfeldern und einem freien Text. In dem ersten Auswahlfeld wird der Teil des Artikels ausgewählt, auf den sich die Bedingung bezieht. Dieser Teil wird mit dem freien Textfeld verglichen. Wie das verglichen wird, gibt das zweite Auswahlfeld an. Hier kann bestimmt werden, ob der freie Text ein Teil des ausgewählten Vorspannfeldes sein soll, ob er dem genau entsprechen soll, ob er größer oder kleiner sein soll. Auch reguläre Ausdrücke sind hier wieder möglich. Wenn Sie bei <guilabel>Nicht</guilabel> einen Haken setzen, ist die Bedingung erfüllt, wenn die Vorgabe nicht zutrifft.

source: Now, let's have a look at some examples.
de: Jetzt ein paar praktische Beispiele.

source: Maybe you want to filter away all the postings by Theodor Test; to do this choose the <guilabel>From</guilabel> header line from the first drop-down list, choose <guilabel>is exactly the same as</guilabel> from the second drop-down list, and enter his name in the text field. But, before doing this you should have a look at the <glossterm>header</glossterm> of one of Theodor's articles and see what is in the <quote>From</quote> line.
de: Sie wollen alle Artikel von Theodor Test ausfiltern. Dann stellen Sie im ersten Auswahlfeld als Vorspannzeile <guilabel>Absender</guilabel> ein und im zweiten Auswahlfeld <guilabel>stimmt genau überein mit</guilabel>. In das Textfeld geben Sie nun den Namen ein. Aber schauen Sie sich vorher einmal die <glossterm>Vorspannzeile</glossterm> eines Artikels von Theodor Test an, um den tatsächlichen Inhalt der Zeile <quote>From</quote> zu überprüfen.

source: If you do not want to read articles with more than 100 lines, choose the header entry <guilabel>Lines</guilabel> from the first drop-down list, choose <guilabel>greater than</guilabel> from the second, and enter <userinput>100</userinput> in the text field. You probably, then, want to score down the message.
de: Wenn Sie Artikel mit mehr als 100 Zeilen gar nicht erst lesen wollen, wählen Sie im ersten Auswahlfeld <guilabel>Zeilen</guilabel> und im zweiten <guilabel>größer als</guilabel> aus und geben im Textfeld den Wert <userinput>100</userinput> ein. Gegebenenfalls können Sie dann noch die Bewertung der Nachricht herabsetzen.

source: Last example: of course, you're very interested in every article that refers to &knode;. Choose the header entry <guilabel>Subject</guilabel>, then <guilabel>contains substring</guilabel> and enter <userinput>knode</userinput> in the text field. But what do you do if &knode; is not mentioned in the <guilabel>Subject</guilabel>? I suggest using a regular expression: change <guilabel>contains substring</guilabel> to <guilabel>matches regular expression</guilabel> and type <userinput>knode|newsreader|usenet</userinput> into the text field to match either knode, newsreader or usenet &mdash; the <userinput>|</userinput> symbol means OR. Alternatively, you can make 3 conditions &mdash; one that matches knode, one that matches newsreader and so on &mdash; and choose <guilabel>Match any condition</guilabel>; but, this needs a lot of space and it is not very elegant, is it?
de: Letztes Beispiel: Sie interessieren sich natürlich brennend für alle Artikel, die mit &knode; zu tun haben. Wählen Sie den Eintrag <guilabel>Betreff</guilabel>, dann <guilabel>Enthält Teilzeichenkette</guilabel> und im Textfeld den Wert <userinput>knode</userinput>. Was machen Sie aber, wenn &knode; nicht erwähnt wird? In diesem Fall bietet sich aber ein regulärer Ausdruck an. Hier ist der Einsatz eines regulären Ausdrucks angebracht. Ändern Sie <guilabel>Enthält Teilzeichenkette</guilabel> auf <guilabel>Trifft auf regulären Ausdruck zu</guilabel> und geben Sie in das Textfeld <userinput>knode|newsreader|usenet</userinput> ein. Damit fangen Sie alle Artikel ein, bei denen eines der drei Worte im Betreff vorkommt. Das Zeichen <userinput>|</userinput> hat hier die Bedeutung eines ODER. Alternativ können Sie natürlich für die drei Worte auch drei Bedingungen anlegen und die Option <guilabel>passt auf beliebige Bedingung</guilabel> auswählen. Aber diese nimmt deutlich mehr Platz in Anspruch und ist eher unelegant.

source: Once your condition is ready you should set an action down in the <guilabel>Actions</guilabel> section. The most important action is <guilabel>adjust score</guilabel>; if this action is chosen you can raise or lower the score, by the configured value, for articles to which this rule applies. &knode; can also show you a little message when finding such an article or colorize the header in the article list; for example, you could make interesting articles screaming pink so you would notice them very quickly.
de: Zu guter Letzt können und sollten Sie noch festlegen, was mit den ausgewählten Artikeln jetzt eigentlich passieren soll. Hierzu dient der Bereich <guilabel>Aktion</guilabel>. Die wichtigste Aktion hier ist <guilabel>Bewertung anpassen</guilabel>. Ist diese Aktion ausgewählt, kann die Bewertung der Artikels, die auf die Regel passen, um den angegebenen Wert erhöht oder verringert werden. &knode; kann auch eine Nachricht anzeigen, wenn ein solcher Artikel gefunden wird oder die Nachricht in der Artikelliste andersfarbig darstellen. Interessante Artikel lassen sich so zum Beispiel in grellem Lila darstellen und fallen sofort ins Auge.

source: When leaving the editor, or when the <menuchoice><guimenu>Scoring</guimenu><guimenuitem>Recalculate scores</guimenuitem></menuchoice> menu item is chosen, the rules are executed; furthermore, the rules are automatically used for new <glossterm>articles</glossterm>. Scoring makes the most sense when used with filters: by scoring some articles down and filtering them away they won't appear in the article list.
de: Wenn Sie nach dem Bearbeiten den Editor verlassen oder den Menüpunkt <menuchoice><guimenu>Bewertung</guimenu><guimenuitem>Neuberechnung der Bewertung</guimenuitem></menuchoice> anwählen, werden die Regeln auf die vorhandenen <glossterm>Artikel</glossterm> angewendet. Außerdem werden Sie automatisch auf alle neuen <glossterm>Artikel</glossterm> angewendet. Bewertungen machen am meisten Sinn im Zusammenhang mit Filtern, d. h. Sie setzen die Bewertung herunter und filtern die betreffenden Artikel über den Wert aus der Anzeige heraus.

source: Group identities
de: Lokale Identitäten

source: With &knode; you can use a different identity with every newsgroup to which you are subscribed; i.e. you can set a name, email address, reply-to address and signature to use with that group.
de: Mit &knode; können Sie für jede abonnierte Newsgruppe eine eigene Identität festlegen, d. h. Sie können für die betreffende Newsgruppe Name, E-Mail-Adresse, Antwortadresse und Signatur unabhängig von den globalen Einstellungen festlegen.

source: It is easy to set group identities. First, with the right mouse button, click on the name of the newsgroup in which to have a different identity in; then, select <guimenuitem>Group Properties</guimenuitem> from the context menu that appears. In the dialog that appears the second tab contains fields identical to the global identity settings; enter your settings here and click <guibutton>OK</guibutton> to confirm the changes: then, your articles in this group will always posted with this newly-entered identity.
de: Die Einrichtung einer lokalen Identität ist denkbar einfach und erfolgt hinsichtlich der Eingabe, wie bei Ihrer globalen Identität. Um eine lokale Identität anzulegen, markieren Sie den News-Zugang oder die entsprechende <glossterm>Newsgruppe</glossterm> in der Ordneransicht und wählen aus dem Kontextmenü den Menüeintrag <guimenuitem>Gruppen-Einstellungen</guimenuitem>. Die zweite Karteikarte entspricht dem von den Eingabemöglichkeiten dem Dialog für die globale Identität. Bestätigen Sie Ihre Eingaben mit <guibutton>OK</guibutton>, werden alle Ihre Artikel für diese Newsgruppe bzw. fortan mit den hier getroffenen Einstellungen veröffentlicht.

source: When you unsubscribe from a group you lose its identity settings for this group: if you re-subscribe to the group, you will need to re-enter its identity settings. For new newsgroups, the global identity is used.
de: Wenn Sie eine abonnierte Gruppe kündigen, bei der Sie eine lokale Identität eingestellt hatten, gehen diese Einstellungen verloren. Abonnieren Sie dieselbe Gruppe zu einem späteren Zeitpunkt wieder, müssen Sie die entsprechenden Einstellungen erneut vornehmen. Für neu abonnierte Newsgruppen gilt als Voreinstellung immer die globale Identität.

source: Managing Multiple News Accounts
de: Mehrere News-Zugänge verwalten

source: &knode; can handle an unlimited number of news server accounts in addition to your main news server; most users don't need this feature, but it can be very useful to if your main newsserver does not provide all groups you want to read. Typical cases of this are when support groups for commercial software are hosted on a special, private, server or binary newsgroups, which are only available from some servers.
de: &knode; bietet Ihnen die Möglichkeit Ihre News von mehreren Servern zu beziehen. Im Allgemeinen besteht keine Notwendigkeit, mehrere News-Zugänge anzulegen, aber diese Möglichkeit ist dann nützlich, wenn der News-Zugang, den Sie normalerweise verwenden nicht alle gewünschten Newsgruppen anbietet. Typische Fälle sind Support-Gruppen für kommerzielle Software oder Newsgruppen, in denen Binärdateien angeboten, die nur auf speziellen Servern angeboten werden.

source: Another example of why you sometimes need more than one newsserver is that sometimes not all interesting newsgroups are on one server; in fact, there is very often only a selection of newsgroups. For example, many servers do not support binary groups with pictures or programs; if you want such a newsgroup and your newsserver provider does not want to serve it you can configure &knode; to get it from another server.
de: Ein anderes Beispiel für die Notwendigkeit eines zweiten oder mehrerer News-Zugänge ergibt sich aus der Tatsache, dass ein News-Server nicht alle existierenden Newsgruppen bereitstellen muss. Hiervon sind vor allem Gruppen betroffen, in denen binäre Inhalte wie Bilder und Programmen angeboten werden. Bietet Ihr News-Server die von Ihnen gewünschte Gruppe nicht an und findet sich der Betreiber auch nicht bereit, diese auf Ihre Bitte hin bereitzustellen, können Sie &knode; anweisen, diese Newsgruppe bei einem anderen News-Server anzufordern.

source: Or, perhaps you find you are just subscribed to too many newsgroups, and would like to organize them a little better; you could set up several accounts for the same server, perhaps one for groups you read every day, and one for groups you read less often, so that you do not have to search for your <quote>everyday</quote> groups in a long list of subscribed groups.
de: Oder wenn Sie der Meinung sind, dass Sie zu viele Newsgruppen abonniert haben und diese daher übersichtlicher organisieren wollen. Dazu können Sie verschiedene Zugänge zum gleichen Server einrichten, z. B. einen für Newsgruppen, die Sie täglich lesen und einen für seltener gelesene Gruppen. Damit müssen Sie die <quote>täglichen</quote> Gruppen nicht in einer langen Liste mühsam suchen.

source: In order to add an new account, open the preferences dialog via <menuchoice><guimenu>Settings</guimenu><guimenuitem>Configure KNode...</guimenuitem><guilabel>Accounts</guilabel><guilabel>Newsgroup Servers</guilabel> </menuchoice>. The <guibutton>New</guibutton> button creates a new account; you then have to enter the same data as for your first account, typically a name for the account, the host name, and a user name and password if the server requires authentication. When this is done the new server will appear both in the configuration dialog and in the group view: you can now subscribe to newsgroups.
de: Um einen neuen News-Zugang anzulegen, gehen Sie über <menuchoice><guimenu>Einstellungen</guimenu> <guimenuitem>KNode einrichten ...</guimenuitem><guilabel>Zugänge</guilabel><guilabel>Newsgruppen-Server</guilabel> </menuchoice> in den Einstellungsdialog für die News-Zugänge. Hier können Sie über den Knopf <guibutton>Hinzufügen</guibutton> einen neuen Zugang anlegen. Das Einrichten ist identisch mit dem Ihres ersten News-Zugangs, abgesehen davon, dass Sie natürlich die entsprechenden Daten wie den Servernamen und die Zugangsdaten entsprechend anpassen müssen. Wenn der Zugang angelegt ist, erscheint er in der Ordneransicht, und Sie können nun die gewünschten Newsgruppen abonnieren.

source: You can delete the currently-selected account by pressing the <guibutton>Delete</guibutton> button.
de: Das Löschen eines vorhandenen News-Zugangs erfolgt über den Knopf <guibutton>Löschen</guibutton>.

source: In the <guimenu>Account properties</guimenu> dialog (available from the context menu of the newsserver) you can setup an identity for use only on this newsserver.
de: Über <guimenu>Zugangseinstellungen</guimenu> im Kontextmenü des News-Zugangs können Sie eine Identität einstellen, die nur für diesen News-Zugang gültig ist.

source: Sign and Verify Articles with <acronym>PGP</acronym>
de: Artikel mit <acronym>PGP</acronym> signieren und überprüfen

source: <acronym>PGP</acronym> is the most-widespread method used to encrypt or sign data. Using the <glossterm>PGP-signature</glossterm> you can verify if an article is really from the original author or if it has been changed by others. You can find PGP-programs and guides at <ulink url="http://www.pgpi.org">http://www.pgpi.org</ulink>.
de: <acronym>PGP</acronym> ist das verbreitetste Verfahren, zur Verschlüsselung von Daten und zum Signieren. Anhand der <glossterm>PGP-Signatur</glossterm> kann man überprüfen, ob der Artikel tatsächlich von dem angegebenen Absender stammt oder ob die Daten durch Dritte verfälscht wurden. PGP-Programme inklusive Anleitungen finden Sie im Internet unter<ulink url="http://www.pgpi.org"> http://www.pgpi.org</ulink>.

source: With &knode; you can sign an article with <acronym>PGP</acronym> and to verify <acronym>PGP</acronym>-signed article. After you have configured the <acronym>PGP</acronym> support, at <menuchoice><guimenu>Settings</guimenu><guimenuitem>Configure Knode...</guimenuitem><guilabel>Signing/Verifying</guilabel></menuchoice>, you can sign articles in the editor with the <menuchoice><guimenu>Tools</guimenu><guimenuitem>Sign article with PGP</guimenuitem></menuchoice> menu item &mdash; you will be asked for your passphrase and after that the article will be signed.
de: &knode; bietet Ihnen die Möglichkeit, Ihre Artikel mit <acronym>PGP</acronym> zu signieren und mit <acronym>PGP</acronym> signierte Artikel zu überprüfen. Nachdem Sie die <acronym>PGP</acronym>-Unterstützung unter <menuchoice><guimenu>Einstellungen</guimenu><guimenuitem>KNode einrichten ...</guimenuitem> <guilabel> Signieren / Prüfen</guilabel> </menuchoice> eingerichtet haben, können Sie einen Artikel signieren, indem Sie im Editor im Menü <menuchoice> <guimenu>Extras</guimenu> <guimenuitem> Artikel mit PGP signieren</guimenuitem> </menuchoice> auswählen. Sie werden daraufhin nach Ihrem PGP-Passwort gefragt und die Nachricht wird anschließend signiert.

source: Your <application>GnuPG</application>/<acronym>PGP</acronym> <acronym>ID</acronym> is automatically built from your name and your email address and is identical to the sender of the message (<quote>From</quote>-header).
de: Ihre <application>GnuPG</application>/<acronym>PGP</acronym>-<acronym>ID</acronym> wird automatisch aus dem eingestellten Namen und der E-Mail-Adresse gebildet und ist mit dem <quote>Absender</quote> im Header des Artikels identisch.
