Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdepim/knode_more.po
Languages: de

source: Further Information
de: Weitere Informationen

source: In this section we will detail some additional information resources which could be useful to you. Many of the articles listed below (for which <acronym>URL</acronym>s are given) are posted to news groups regularly; some of those groups are also listed here.
de: In diesem Abschnitt werden einige nützliche weitergehende Informationen geliefert. Einige der aufgeführten Artikel (für die eine <acronym>URL</acronym> angegeben ist) werden üblicherweise an Newsgruppen gesendet. Einige dieser Gruppen werden hier ebenfalls genannt.

source: Informative Newsgroups
de: Informative Newsgruppen

source: de.newsusers.infos (German)
de: de.newsusers.infos (deutschsprachig)

source: de.answers (German)
de: de.answers (deutschsprachig)

source: de.comp.os.unix.linux.infos (German)
de: de.comp.os.unix.linux.infos (deutschsprachig)

source: de.newusers.answers (German)
de: de.newusers.answers (deutschsprachig)

source: de.newusers.questions (German)
de: de.newusers.questions (deutschsprachig)

source: For beginners it is especially recommended to read these articles at least partially: informed users have strong advantages in news groups. There are some more-specialized news groups where <acronym>FAQ</acronym>s and introductory <glossterm>articles</glossterm> are posted frequently, &eg; the <glossterm>newsgroup</glossterm> de.comp.os.unix.linux.infos (German), which contains a lot of useful articles about the &Linux; operating system. Just have a look on the group list of your newsserver for it.
de: Anfänger sollten diese Artikel wenigstens zum Teil lesen. Gut informierte Benutzer haben in Newsgruppen deutliche Vorteile. In einige speziellen Newsgruppen werden <acronym>FAQ</acronym>s und einführende <glossterm>Artikel</glossterm> regelmäßig gepostet, &eg; enthält die <glossterm>Newsgruppe</glossterm> de.comp.os.unix.linux.infos (deutschsprachig) eine Menge nützliche Artikel über das Betriebssystem &Linux;. Sie ist in der Gruppenliste Ihres Newsservers bestimmt aufgeführt.

source: Test Groups
de: Testgruppen

source: The following groups were created especially for testing, &ie; after successfully configuring &knode; you should post some articles to those groups to test your settings.
de: Die folgenden Gruppen wurde extra zu Testzwecken eingerichtet, &ie; nach der erfolgreichen Einrichtung von &knode; kann man zum Test dort einige Artikel posten.

source: Some groups support automatic replies through email to enable you to test whether your entered identity is correct and mail-replies actually arrive in your mailbox.
de: Einige dieser Gruppen senden automatische E-Mail-Antworten auf die getesteten Artikel. Damit können Sie Ihre eigenen Einstellungen zur Identität überprüfen und feststellen, ob Antworten per E-Mail in Ihrem Postfach ankommen.

source: In addition, some scripts are offered which check your articles for erroneous settings and generate a followup with useful hints.
de: Einige Skripte überprüfen zusätzlich die eingehenden Artikel auf Konfigurationsfehler und senden Folgenachrichten mit nützlichen Hinweisen.

source: de.test (German test newsgroup)
de: de.test (deutsche Test-Newsgruppe)

source: Informative technical articles in the world wide web
de: Informative technische Artikel im Internet

source: These <acronym>URL</acronym>s are from the corresponding article in the <glossterm>newsgroup</glossterm> <emphasis>de.newusers.infos</emphasis> and have the same contents as the articles posted there.
de: Die folgenden <acronym>URL</acronym>s stammen von in der <glossterm>Newsgruppe</glossterm> <emphasis>de.newusers.infos</emphasis> und haben den gleichen Inhalt wie die dort veröffentlichten Nachrichten.

source: Introduction for de.newusers.infos: <ulink url="http://www.kirchwitz.de/~amk/dni/einleitung">http://www.kirchwitz.de/~amk/dni/einleitung</ulink> (German)
de: Einführung zu de.newusers.infos: <ulink url="http://www.kirchwitz.de/~amk/dni/einleitung">http://www.kirchwitz.de/~amk/dni/einleitung</ulink> (deutschsprachig)

source: The newsgroups of the de.alt hierarchy: <ulink url="http://www.kirchwitz.de/~amk/dni/de-alt-newsgruppen"> http://www.kirchwitz.de/~amk/dni/de-alt-newsgruppen</ulink> (German)
de: Die Newsgruppen der de.alt-Hierarchie: <ulink url="http://www.kirchwitz.de/~amk/dni/de-alt-newsgruppen">http://www.kirchwitz.de/~amk/dni/de-alt-newsgruppen</ulink> (deutschsprachig)

source: The newsgroups of the de-hierarchy: <ulink url="http://www.kirchwitz.de/~amk/dni/de-newsgruppen">http://www.kirchwitz.de/~amk/dni/de-newsgruppen</ulink> (German)
de: Die Newsgruppen der de-Hierarchie: <ulink url="http://www.kirchwitz.de/~amk/dni/de-newsgruppen">http://www.kirchwitz.de/~amk/dni/de-newsgruppen</ulink> (deutschsprachig)

source: First read, then post: <ulink url="http://www.kirchwitz.de/~amk/dni/erst-lesen-dann-schreiben">http://www.kirchwitz.de/~amk/dni/erst-lesen-dann-schreiben</ulink> (German)
de: Zuerst lesen, dann schreiben: <ulink url="http://www.kirchwitz.de/~amk/dni/erst-lesen-dann-schreiben">http://www.kirchwitz.de/~amk/dni/erst-lesen-dann-schreiben</ulink> (deutschsprachig)

source: First steps in the usenet: <ulink url="http://www.kirchwitz.de/~amk/dni/erste-schritte">http://www.kirchwitz.de/~amk/dni/erste-schritte</ulink> (German)
de: Erste Schritte im Usenet: <ulink url="http://www.kirchwitz.de/~amk/dni/erste-schritte">http://www.kirchwitz.de/~amk/dni/erste-schritte</ulink> (deutschsprachig)

source: Questions and answers from de.newusers.questions: <ulink url="http://www.kirchwitz.de/~amk/dni/faq">http://www.kirchwitz.de/~amk/dni/faq</ulink> (German)
de: Fragen und Antworten aus de.newusers.questions: <ulink url="http://www.kirchwitz.de/~amk/dni/faq">http://www.kirchwitz.de/~amk/dni/faq</ulink> (deutschsprachig)

source: Seven theses about behavior in the internet: <ulink url="http://www.kirchwitz.de/~amk/dni/hoeflichkeit">http://www.kirchwitz.de/~amk/dni/hoeflichkeit</ulink> (German)
de: Sieben Verhaltensregeln für das Internet: <ulink url="http://www.kirchwitz.de/~amk/dni/hoeflichkeit">http://www.kirchwitz.de/~amk/dni/hoeflichkeit</ulink> (deutschsprachig)

source: Introduction to the usenet: <ulink url="http://www.kirchwitz.de/~amk/dni/usenet-einfuehrung">http://www.kirchwitz.de/~amk/dni/usenet-einfuehrung</ulink> (German)
de: Einführung zum Usenet: <ulink url="http://www.kirchwitz.de/~amk/dni/usenet-einfuehrung">http://www.kirchwitz.de/~amk/dni/usenet-einfuehrung</ulink> (deutschsprachig)

source: Why should I take the rules seriously? <ulink url="http://www.kirchwitz.de/~amk/dni/warum-regeln">http://www.kirchwitz.de/~amk/dni/warum-regeln</ulink> (German)
de: Warum sollte ich die Regeln ernst nehmen? <ulink url="http://www.kirchwitz.de/~amk/dni/warum-regeln">http://www.kirchwitz.de/~amk/dni/warum-regeln</ulink> (deutschsprachig)

source: The newsreader <acronym>FAQ</acronym>: <ulink url="http://www.thomas-huehn.de/usenet/newsreaderFAQ.txt">http://www.thomas-huehn.de/usenet/newsreaderFAQ.txt</ulink> (German)
de: Die News-Reader-<acronym>FAQ</acronym>: <ulink url="http://www.thomas-huehn.de/usenet/newsreaderFAQ.txt">http://www.thomas-huehn.de/usenet/newsreaderFAQ.txt</ulink> (Deutsch)

source: The correct quoting: <ulink url="http://www.afaik.de/usenet/faq/zitieren">http://www.afaik.de/usenet/faq/zitieren</ulink> (German)
de: Korrektes Zitieren: <ulink url="http://www.afaik.de/usenet/faq/zitieren">http://www.afaik.de/usenet/faq/zitieren</ulink> (deutschsprachig)

source: The German umlauts <acronym>FAQ</acronym>: <ulink url="http://www.westfalen.de/paefken/de.newusers/umlaute-faq.txt"> http://www.westfalen.de/paefken/de.newusers/umlaute-faq.txt</ulink> (German)
de: <acronym>FAQ</acronym> zu deutschen Umlauten: <ulink url="http://www.westfalen.de/paefken/de.newusers/umlaute-faq.txt"> http://www.westfalen.de/paefken/de.newusers/umlaute-faq.txt</ulink> (deutschsprachig)

source: Informative technical articles
de: Informative technische Artikel

source: If you are interested in further technical information in connection to news, you should not miss the following <acronym>URL</acronym>s.
de: Falls man an weitergehenden technischen Informationen zum Thema News interessiert ist, kann man bei den folgenden <acronym>URL</acronym>s starten.

source: Header entries: <ulink url="http://www.kirchwitz.de/~amk/dni/headerzeilen"> http://www.kirchwitz.de/~amk/dni/headerzeilen</ulink> (German)
de: Vorspannfelder: <ulink url="http://www.kirchwitz.de/~amk/dni/headerzeilen"> http://www.kirchwitz.de/~amk/dni/headerzeilen</ulink> (deutschsprachig)

source: A very useful message-ID <acronym>FAQ</acronym>: <ulink url="http://www.hanau.net/usenet/faq/messageid.php"> http://www.hanau.net/usenet/faq/messageid.php (German)</ulink>
de: Eine sehr nützliche <acronym>FAQ</acronym> zu Message-IDs: <ulink url="http://www.hanau.net/usenet/faq/messageid.php"> http://www.hanau.net/usenet/faq/messageid.php (Deutsch)</ulink>

source: A lot of links about newsreaders and related topics: <ulink url="http://www.leafnode.org/links.shtml">http://www.leafnode.org/links.shtml</ulink>
de: Viele Informationen über Newsreader und verwandte Themen: <ulink url="http://www.leafnode.org/links.shtml">http://www.leafnode.org/links.shtml</ulink>

source: <acronym>RFC</acronym>s, Drafts and documents for the technical interested: <ulink url="http://tools.ietf.org/wg/usefor/"> http://tools.ietf.org/wg/usefor/</ulink>
de: <acronym>RFC</acronym>s, Entwürfe (Drafts) und Dokumente für technisch Interessierte: <ulink url="http://tools.ietf.org/wg/usefor/"> http://tools.ietf.org/wg/usefor/</ulink>
