Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdepim/knotes.po
Languages: de

source: The &knotes; Handbook
de: Das Handbuch zu &knotes;

source: Reviewer
de: Durchsicht

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Gregor</firstname><surname>Zumstein</surname><affiliation><address><email>zumstein@ssd.ethz.ch</email></address></affiliation><contrib>Übersetzung von</contrib></othercredit>

source: Fabian Del Santo
de: Fabian Dal Santo

source: &knotes; is a sticky notes application for the desktop.
de: &knotes; sind die Post-It's&reg; für die Arbeitsfläche.

source: notes
de: notizen

source: Introduction
de: Einleitung

source: &knotes; is a program that lets you write the computer equivalent of sticky notes. The notes are saved automatically when you exit the program, and they display when you open the program.
de: &knotes; erlaubt das Anbringen virtueller Haftnotizen (<quote>Post-it</quote>) auf dem Bildschirm. Die Notizen werden beim Beenden des Programms automatisch gespeichert und beim Neustart wieder geladen und angezeigt.

source: You may print and mail your notes if you configure &knotes; to use helper applications.
de: Wenn die entsprechenden Einstellungen vorgenommen sind, können die Notizen auch gedruckt oder per E-Mail versendet werden.

source: Display features of notes such as color and font may be customized for each note. You may also customize the defaults.
de: Die Notizen verwenden frei einstellbare Farben und Schriftarten. Es können sowohl die Standardeinstellungen wie auch die Einstellungen für einzelne Notizen verändert werden.

source: After starting &knotes; for the first time you will have a resource installed that saves all notes in a file under <filename>$<envar>HOME</envar>/.kde/share/apps/knotes/notes.ics</filename>.
de: Nach dem ersten Start von &knotes; wird eine Ressource installiert, in der alle Notizen in einer Datei im Ordner <filename>$<envar>HOME</envar>/.kde/share/apps/knotes/notes.ics</filename> gespeichert werden.

source: Using &knotes;
de: Wie benutze ich &knotes;

source: Creating a new note:
de: Erstellen einer neuen Notiz:

source: To create a new note &RMB; click on the &knotes; panel icon and select <guimenuitem>New Note</guimenuitem>.
de: Um eine neue Notiz zu erstellen, klicken Sie mit der rechten Maustaste auf das &knotes;-Symbol im Systemabschnitt und wählen <guimenuitem>Neue Notiz</guimenuitem>.

source: You can create a new note containing the contents of the clipboard by selecting <guimenuitem>New Note From Clipboard</guimenuitem>.
de: Sie können auch eine neue Notiz erzeugen, die bereits den Inhalt der Zwischenablage als Text hat. Wählen Sie hierzu <guimenuitem>Neue Notiz aus der Zwischenablage</guimenuitem>.

source: Writing your note:
de: Eine Notiz schreiben:

source: To write your note, simply type the note in the space provided. Normal keyboard and mouse editing functions are supported. <mousebutton>Right</mousebutton> clicking in the editing space provides the following menu options:
de: Um eine Notiz zu machen, schreibt man einfach im freien Bereich. Die gewöhnliche Tastatur- und Mausfunktionalität ist vorhanden. Ein <mousebutton>Rechts-</mousebutton>Klick im Editorbereich stellt die folgenden Menüpunkte zur Verfügung:

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>Z</keycap></keycombo> </shortcut><guimenuitem>Undo</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>Z</keycap></keycombo> </shortcut><guimenuitem>Rückgängig</guimenuitem>

source: <shortcut><keycombo action="simul">&Ctrl;&Shift;<keycap>Z</keycap></keycombo> </shortcut><guimenuitem>Redo</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;&Shift;<keycap>Z</keycap></keycombo> </shortcut><guimenuitem>Wiederherstellen</guimenuitem>

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>X</keycap></keycombo> </shortcut><guimenuitem>Cut</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>X</keycap></keycombo> </shortcut><guimenuitem>Ausschneiden</guimenuitem>

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>C</keycap></keycombo> </shortcut><guimenuitem>Copy</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>C</keycap></keycombo> </shortcut><guimenuitem>Kopieren</guimenuitem>

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>V</keycap></keycombo> </shortcut><guimenuitem>Paste</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>V</keycap></keycombo></shortcut><guimenuitem>Einfügen</guimenuitem>

source: Delete
de: Löschen

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>A</keycap></keycombo> </shortcut><guimenuitem>Select All</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>A</keycap></keycombo></shortcut><guimenuitem>Alles auswählen</guimenuitem>

source: Check Spelling
de: Rechtschreibprüfung

source: Auto Spell Check
de: Autom. Rechtschreibprüfung

source: Allow Tabulations
de: Anordnung mit Tabulatoren erlauben

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>F</keycap></keycombo> </shortcut><guimenuitem>Find</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>F</keycap></keycombo> </shortcut><guimenuitem>Suchen</guimenuitem>

source: <shortcut><keycap>F3</keycap> </shortcut><guimenuitem>Find Next</guimenuitem>
de: <shortcut><keycap>F3</keycap> </shortcut><guimenuitem>Weitersuchen</guimenuitem>

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>R</keycap></keycombo> </shortcut><guimenuitem>Replace</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>R</keycap></keycombo> </shortcut><guimenuitem>Ersetzen</guimenuitem>

source: Speak Text
de: Text vorlesen

source: Text may be selected by holding down the &LMB; and moving the mouse, or by holding down the &Shift; key and using the <keycap>arrow</keycap> keys.
de: Text wird ausgewählt indem entweder die <mousebutton>linke</mousebutton> Maustaste gedrückt und die Maus bewegt wird oder die &Shift;-Taste gedrückt wird und die <keycap>Pfeil</keycap>-Tasten verwendet werden.

source: Inserting the date:
de: Datum einfügen:

source: To insert the current date in the note &RMB; click on the title bar of the note and select <guimenuitem>Insert Date</guimenuitem>.
de: Um das aktuelle Datum in die Notiz einzufügen, klicken Sie mit der <mousebutton>rechten</mousebutton> Maustaste auf die Titelzeile der Notiz und wählen <guimenuitem>Datum einfügen</guimenuitem>.

source: The current date and time will be inserted at the cursor position in the text of the note.
de: Daraufhin wird das aktuelle Datum an der Cursor-Position im Text eingefügt.

source: Renaming a note:
de: Eine Notiz umbenennen:

source: To rename a note &RMB; click on the note titlebar and select <guimenuitem>Rename...</guimenuitem>.
de: Um eine Notiz umzubennen, klicken Sie mit der &RMBn; auf die Titelleiste der Notiz und wählen <guimenuitem>Umbenennen ...</guimenuitem>.

source: Type the new name of the note in the dialog that appears. To accept the new name, press the <guibutton>OK</guibutton> button. To exit the dialog without renaming the note, press the <guibutton>Cancel</guibutton> button.
de: Im sich öffnenden Dialog muss der neue Name eingegeben werden. <guibutton>OK</guibutton> ändert den Namen, <guibutton>Abbrechen</guibutton> kehrt zur Notiz zurück, ohne etwas zu ändern.

source: Mailing a note:
de: Eine Notiz versenden:

source: To mail a note &RMB; click on the note titlebar and select <guimenuitem>Mail...</guimenuitem>.
de: Um eine Notiz als E-Mail zu versenden, klicken Sie mit der &RMBn; auf die Titelleiste der Notiz und wählen <guimenuitem>Versenden ...</guimenuitem>.

source: What happens next depends on how you configured the Mail action in the <guilabel>Settings</guilabel> dialog.
de: Das weitere Vorgehen hängt vom Befehl ab, der im Dialog <guilabel>Einstellungen</guilabel> unter Aktionen angegeben wurde.

source: Printing a note:
de: Eine Notiz drucken:

source: To print a note &RMB; click on the note titlebar and select <menuchoice><shortcut><keycombo action="simul">&Ctrl;<keycap>P</keycap></keycombo> </shortcut><guimenuitem>Print</guimenuitem></menuchoice>.
de: Um eine Notiz zu drucken, klicken Sie mit der &RMBn; auf die Titelleiste der Notiz und wählen <menuchoice><shortcut><keycombo action="simul">&Ctrl;<keycap>P</keycap></keycombo> </shortcut><guimenuitem>Drucken ...</guimenuitem></menuchoice>.

source: A standard &kde; print dialog will open.
de: Ein &kde;-Standarddruckdialog wird angezeigt.

source: Deleting a note:
de: Eine Notiz löschen:

source: To delete a note &RMB; click on the note titlebar and select <guimenuitem>Delete</guimenuitem>.
de: Um eine Notiz zu löschen, klicken Sie mit der &RMBn; auf die Titelleiste der Notiz und wählen <guimenuitem>Löschen</guimenuitem>.

source: Hiding a note:
de: Eine Notiz verstecken:

source: To hide a note, click the <guiicon>X</guiicon> in the upper right corner of the titlebar of the note or select <menuchoice><shortcut> &Esc;</shortcut><guimenuitem>Hide</guimenuitem> </menuchoice> in the context menu. The note will no longer be displayed on the screen. The note itself will not be deleted.
de: Um eine Notiz auszublenden, klicken Sie auf das <guiicon>X</guiicon> in der oberen rechten Ecke der Titelleiste oder wählen im Kontextmenü . <menuchoice><shortcut> &Esc;</shortcut><guimenuitem>Ausblenden</guimenuitem> </menuchoice>. Die Notiz erscheint nicht weiter auf dem Bildschirm, wird aber nicht gelöscht.

source: Setting an alarm:
de: Einstellen einer Erinnerung:

source: Select <guimenuitem>Set Alarm</guimenuitem> in the context menu of the note titlebar. Check <guilabel>Alarm at</guilabel> in the next dialog and adjust the date and time for the reminder. At alarm time a popup window will be displayed and list all notes with the actual alarm date.
de: Wählen Sie <guimenuitem>Erinnerung einstellen</guimenuitem> im Kontextmenü der Titelleiste der Notiz. Aktivieren Sie <guilabel>Erinnerung um</guilabel> im nächsten Dialog und stellen Sie Zeit und Datum passend ein. Zum Zeitpunkt einer Erinnerung wird ein Fenster geöffnet, das eine Liste aller Notizen mit dem aktuellen Erinnerungsdatum enthält.

source: Sending a note:
de: Senden einer Notiz:

source: To send a note to an other computer select <guimenuitem>Send...</guimenuitem> in the context menu of the note titlebar. Add a hostname or ip or choose a recipient from the list of previously sent notes. If the recipients has enabled incoming notes, the note will appear on his screen, indicating the sender id in the titlebar.
de: Um eine Notiz an einen anderen Rechner zu schicken, wählen Sie <guimenuitem>Versenden</guimenuitem> aus dem Kontextmenü der Titelleiste. Geben Sie einen Rechnernamen oder eine IP-Adresse ein und wählen Sie einen Empfänger aus einer Liste früher versendeten Notizen. Wenn der Empfänger das Annehmen von Notizen erlaubt hat, wird die Notiz auf seinem Bildschirm mit der Kennung des Senders in der Titelleiste angezeigt.

source: Locking a note:
de: Sperren einer Notiz:

source: To prevent accidental changes in a note select <guimenuitem>Lock</guimenuitem> in the context menu of the note titlebar.
de: Um unbeabsichtigte Änderungen einer Notiz zu verhindern, wählen Sie <guimenuitem>Sperren</guimenuitem> im Kontextmenü der Titelleiste.

source: Saving a note:
de: Speichern einer Notiz:

source: To save a note select <guimenuitem>Save As...</guimenuitem> in the context menu of the note titlebar. The note can be saved as a plain text file or in &HTML; format, if <guilabel>Rich text</guilabel> is enabled.
de: Um eine Notiz zu speichern, wählen Sie <guimenuitem>Speichern unter</guimenuitem> im Kontextmenü der Titelleiste. Eine Notiz kann als einfacher Text oder im &HTML;-Format gespeichert werden, wenn <guilabel>Rich-Text</guilabel> aktiviert ist.

source: Displaying notes:
de: Anzeige von Notizen:

source: When you start &knotes;, all notes are hidden. If you want to display them, &LMB; on the &knotes; panel icon and select the note you wish to display.
de: Beim Start von &knotes; werden keine Notizen auf dem Bildschirm angezeigt. Wenn eine Notiz angezeigt werden soll, klicken Sie mit der &LMB; auf das &knotes;-Symbol im Systemabschnitt der Kontrollleiste und wählen die Notiz aus, die Sie anschauen möchten.

source: Searching in all notes:
de: Suche in allen Notizen:

source: Click with the &RMB; on the panel icon and select <menuchoice><shortcut><keycombo action="simul">&Ctrl;<keycap>F</keycap></keycombo> </shortcut><guimenuitem>Find</guimenuitem></menuchoice> in the context menu.
de: Klicken Sie mit der &RMBn; auf das Symbol im Systemabschnitt der Kontrollleiste und wählen Sie im Kontextmenü <menuchoice><shortcut><keycombo action="simul">&Ctrl;<keycap>F</keycap></keycombo> </shortcut><guimenuitem>Suchen</guimenuitem></menuchoice>.

source: A standard &kde; dialog will open where you enter the text to be searched for in all notes.
de: Ein &kde;-Standarddialog wird geöffnet, in dem Sie einen Text zur Suche in allen Notizen eingeben können.

source: Desktop functions:
de: Funktionen für die Arbeitsflächen:

source: To send a note to a specific desktop, &RMB; click on the title bar of the note and select <guisubmenu>To Desktop</guisubmenu>. Choose the desktop desired, or alternatively, <guimenuitem>All Desktops</guimenuitem>
de: Um eine Notiz auf eine bestimmte Arbeitsfläche zu senden, müssen Sie mit der rechten Maustaste auf die Titelleiste der Notiz klicken und <guisubmenu>Auf Arbeitsfläche ...</guisubmenu>wählen. Wählen Sie die gewünschte Arbeitsfläche oder alternativ <guimenuitem>Auf alle Arbeitsflächen</guimenuitem>.

source: To make the note remain on top of other windows &RMB; click on the titlebar of the note and select <guimenuitem>Keep Above Others</guimenuitem>.
de: Um eine Notiz immer zuoberst auf der Arbeitsfläche zu haben, klicken Sie mit der &RMBn; auf die Titelleiste der Notiz und wählen <guimenuitem>Im Vordergrund halten</guimenuitem>.

source: To return the note to more normal window behavior, select <guimenuitem>Keep Below Others</guimenuitem>.
de: Um zur normalen Einstellung zurückzukehren, wählen Sie <guimenuitem>Im Hintergrund halten</guimenuitem>.

source: Quitting &knotes;
de: &knotes; beenden

source: To quit &knotes; &RMB; click on the panel icon and select <guimenuitem>Quit</guimenuitem>.
de: Um &knotes; zu beenden, müssen Sie auf das Symbol im Systemabschnitt klicken und <guimenuitem>Beenden</guimenuitem> auswählen.

source: Configuration
de: Einrichtung

source: Configuring &knotes; Default Settings
de: Standard &knotes;-Einstellungen vornehmen

source: To configure &knotes; &RMB; click on the panel icon. Select <guimenuitem>Configure KNotes...</guimenuitem> The &knotes; <guilabel>KNotes Settings</guilabel> dialog will open.
de: Um &knotes; einzurichten, klicken Sie mit der rechten Maustaste auf das Symbol im Systemabschnitt der Kontrollleiste. Wählen Sie <guimenuitem>KNotes einrichten ...</guimenuitem> aus. Damit wird der Dialog <guilabel>Einstellungen</guilabel>geöffnet.

source: The Display Section
de: Der Abschnitt Anzeige

source: Text color:
de: Textfarbe:

source: The color square shows the current text color. By clicking this color square you open the standard &kde; color selection dialog.
de: Die aktuell eingestellte Farbe wird rechts mit einem farbigen Rechteck angezeigt. Ein Klick auf dieses Rechteck öffnet den Standard-&kde;Dialog zur Farbauswahl.

source: Background color:
de: Hintergrundfarbe:

source: The color square shows the current background color. By clicking this color square you open the standard &kde; color selection dialog.
de: Die aktuell eingestellte Farbe wird rechts mit einem farbigen Rechteck angezeigt. Ein Klick auf dieses Rechteck öffnet den Standard-&kde;-Dialog zur Farbauswahl.

source: Default width:
de: Standardbreite:

source: The width of the note in pixels. Edit this number as desired.
de: Die Breite der Notiz in Pixeln. Diese kann nach Herzenslust geändert werden.

source: Default height:
de: Standardhöhe:

source: The height of the note in pixels. Edit this number as desired.
de: Die Höhe der Notiz in Pixeln. Diese kann nach Herzenslust geändert werden.

source: Show note in taskbar
de: Notiz in Fensterleiste anzeigen

source: By default, &knotes; notes do not show an entry in the taskbar for each note. If you prefer they do so, enable this option.
de: Standardmäßig erscheinen &knotes;-Notizen nicht einzeln im Programmumschalter. Wenn Sie dies jedoch vorziehen, muss diese Einstellung aktiviert werden.

source: The Editor Section
de: Der Abschnitt Texteingabe

source: Tab Size
de: Tabulatorbreite

source: This is the size of the indent produced by the &Tab; key in spaces. Edit this number as desired.
de: Gibt an, wie vielen Leerzeichen ein Tabulator entspricht. Diese Zahl kann den eigenen Bedürfnissen entsprechend geändert werden.

source: Auto Indent
de: Automatisch einrücken

source: This is a check box. If selected, auto-indenting is on.
de: Wenn dieses Ankreuzfeld angewählt ist, so wird eine neue Zeile automatisch so weit wie die vorhergehende eingerückt.

source: Check this option to have a format toolbar at the bottom of any note window.
de: Aktivieren diese Einstellung, um eine Format-Werkzeugleiste unten in allen Notizfenstern anzuzeigen.

source: Title font:
de: Schriftart für Titel:

source: You can change the font used for the title of your notes.
de: Man kann die Schriftart für die Titel der Notizen ändern.

source: Click <guibutton>Choose...</guibutton> to open the standard &kde; font selection dialog.
de: Ein Klick auf den Knopf <guibutton>Auswählen ...</guibutton>öffnet den Standard-&kde;-Dialog zur Schriftauswahl.

source: Text font
de: Schriftart für Text

source: You can change the font used for the text of your notes.
de: Man kann die Schriftart für den Text der Notizen ändern.

source: The Actions Section
de: Der Abschnitt Aktionen

source: Mail action
de: E-Mail-Aktion

source: Type a mail command and any required command line switches in this box.
de: Hier muss ein E-Mail-Programm inklusive aller Befehlszeilenparameter angegeben werden.

source: By using <token>%f</token> in the command line you can pass the plain text of the note and by using <token>%t</token> the title of the note to the mail command.
de: Mit dem Platzhalter <token>%f</token> auf der Befehlszeile können Sie den einfachen Text und mit <token>%t</token> den Titel der Notiz an das E-Mail-Programm zu übertragen.

source: The Network Section
de: Der Abschnitt Netzwerk

source: Accept incoming notes
de: Eingehende Notizen akzeptieren

source: Enable this option to allow receiving notes from other computers.
de: Aktivieren Sie diese Einstellung, damit Notizen von anderen Rechnern angenommen werden.

source: Sender ID
de: Absender-Kennung

source: The id will be shown in the note title together with the original title, hostname or ip and date of sending.
de: Diese Kennung wird im Titel der Notiz zusammen mit dem ursprünglichen Titel, Rechnernamen oder IP-Adresse und dem Sendedatum angezeigt.

source: The port used for sending the notes via the network, default is 24837.
de: Der Port für das Versenden von Notizen über das Netzwerk, Standard ist 24837.

source: The Style Section
de: Der Abschnitt Stil

source: Style
de: Stil

source: Only <guilabel>Plain</guilabel> text format is selectable so far.
de: Zur Zeit kann hier nur <guilabel>Einfach</guilabel> als Textformat ausgewählt werden.

source: Customizing a Single Note Display
de: Die Anzeige einer einzelnen Notiz einstellen

source: You can customize each note independently of the global settings. The settings you can customize are identical to those described in the <link linkend="configuration">Configuration</link> section, but they will apply only to the note you are changing. Any other open notes, and any new notes you create, will use the default settings.
de: Man kann die Einstellungen jeder Notiz unabhängig von den globalen Einstellungen vornehmen. Die Einstellmöglichkeiten entsprechen denen im Abschnitt <link linkend="configuration">Einrichtung</link>, gelten aber nur für die aktuelle Notiz. Alle anderen geöffneten Notizen und alle neuen Notizen verwenden die Standardeinstellungen.

source: To customize a single note display &RMB; click on the note title bar and select <guimenuitem>Preferences...</guimenuitem>.
de: Um die Anzeige einer einzelnen Notiz zu ändern, klicken Sie mit der rechten Maustaste auf die Titelleiste der Notiz und wählen <guimenuitem>Einstellungen ...</guimenuitem>.

source: A dialog with the <guilabel>Display</guilabel> and <guilabel>Editor</guilabel> pages will open, allowing you to configure the note.
de: Daraufhin öffnet sich ein Dialog mit den Seiten <guilabel>Anzeige</guilabel> und <guilabel>Texteingabe</guilabel>, wo eine einzelne Notiz eingerichtet werden kann.

source: Credits and License
de: Danksagungen und Lizenz

source: Program copyright 1997 Bernd Wuebben &Bernd.Johannes.Wuebben.mail;
de: Copyright für das Programm 1997 &Bernd.Johannes.Wuebben.mail;

source: Contributors:
de: Beiträge von:

source: Documentation copyright 2000 &Greg.M.Holmes; <email>holmegm@earthlink.net</email>
de: Copyright für die Dokumentation 2000 &Greg.M.Holmes; <email>holmegm@earthlink.net</email>

source: Documentation updated 2001 by Fabian Del Santo &Fabian.DalSanto.mail; and 2003 by &Lauri.Watts; &Lauri.Watts.mail;.
de: Überarbeitung der Dokumentation 2001 von Fabian Dal Santo &Fabian.DalSanto.mail; und 2003 von &Lauri.Watts; &Lauri.Watts.mail;.

source: CREDIT_FOR_TRANSLATORS
de: <para>Deutsche &Uuml;bersetzung von Gregor Zumstein <email>zumstein@ssd.ethz.ch</email></para>
