Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdepim/konsolekalendar.po
Languages: de

source: The &konsolekalendar; Handbook
de: Handbuch zu &konsolekalendar;

source: Reviewer
de: Korrektur

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Noch</firstname><surname>Niemand</surname><contrib>Deutsche Übersetzung</contrib></othercredit>

source: &konsolekalendar; is a command line interface to &kde; calendars.
de: &konsolekalendar; ist eine Befehlszeilenschnittstelle für &kde;-Kalender.

source: Introduction
de: Einleitung

source: &konsolekalendar; is a command line interface to &kde; calendars. It lets you view, insert, remove, or modify calendar events by way of the command line or from a scripting language. Additionally, &konsolekalendar; can create a new &kde; calendar, export a &kde; calendar to a variety of other formats, and import another &kde; calendar.
de: &konsolekalendar; ist eine Befehlszeilenschnittstelle für &kde;-Kalender. Mit seiner Hilfe kann man Termine über die Befehlszeile oder eine Skriptsprache ansehen, einfügen, löschen oder verändern. Weiterhin kann &konsolekalendar; einen neuen &kde;-Kalender erstellen, ihn in einer ganzen Anzahl Formate exportieren und andere &kde;-Kalender importieren.

source: In its basic mode, &konsolekalendar; displays the list of events in your default calendar for the current day (from 7:00 to 17:00).
de: Standardmäßig zeigt &konsolekalendar; die Terminliste des Standardkalenders für den heutigen Tag (von 7:00 bis 17:00 Uhr) an.

source: Main features of &konsolekalendar;:
de: Die Hauptfunktionen von &konsolekalendar;:

source: View calendar entries from a start date/time to end date/time
de: Anzeigen von Kalendereinträgen mit Startzeitpunkt und Endzeitpunkt

source: Insert (add) calendar entries
de: Einfügen (add) von Kalendereinträgen

source: Remove (delete) calendar entries
de: Entfernen (delete) von Kalendereinträgen

source: Modify (change) calendar entries
de: Ändern (modify) von Kalendereinträgen

source: Create a new calendar
de: Erstellen eines neuen Kalenders

source: Export calendar entries to other file formats
de: Exportieren eines Kalender in fremde Dateiformate

source: Import an existing &kde; calendar
de: Importieren eines &kde;-Kalenders

source: &konsolekalendar; is <emphasis>not</emphasis> another graphical user interface to a &kde; calendar (i.e. &korganizer;). &konsolekalendar; is intended solely for uses where a graphical user interface is not practical or possible.
de: Bei &konsolekalendar; handelte es sich <emphasis>nicht</emphasis> um eine weitere grafische Benutzeroberfläche eines &kde;-Kalenders (also &korganizer;). Stattdessen kommt &konsolekalendar; genau dann zum Einsatz, wenn eine grafische Oberfläche nicht gewünscht oder nicht nutzbar ist.

source: &konsolekalendar; does <emphasis>not</emphasis> provide a full-featured language for making queries of the user's calendar: nor is it the intention of the authors to ever write such a capability. Primitive command line options are provided for accessing calendar events within a consecutive range of dates/time stamps.
de: &konsolekalendar; bietet <emphasis>weder</emphasis> eine vollständige Programmiersprache zur Abfrage von Kalendern noch ist es die Absicht der Autoren, solch eine Programmiersprache jemals zu erstellen. Mit einfachen Befehlszeilenparametern kann eine Liste von Terminen bearbeitet werden.

source: Features
de: Merkmale

source: In this chapter you'll learn about the main features of &konsolekalendar; and how to control them using the command line parameters (remember that &konsolekalendar; is not a graphical user interface; it is a command line program only).
de: Dieses Kapitel erläutert die Funktionen von &konsolekalendar; und deren Kontrolle über Befehlszeilenparameter (wiederum: &konsolekalendar; ist keine grafische Benutzeroberfläche, sondern lediglich ein Befehlszeilenprogramm).

source: You'll learn about inserting, deleting, and changing calendar events, and how to export events to other file formats. The creation and importation of &kde; calendars will also be covered in this chapter.
de: Das Einfügen, Entfernen und Verändern von Terminen und der Export in andere Dateiformate wird erläutert. Weiterhin wird die Erzeugung und der Import eines &kde;-Kalenders erklärt.

source: Viewing Events
de: Termine anzeigen lassen

source: In its default mode, or by using the <parameter>--view</parameter> option, &konsolekalendar; will list all events within the range of a specified date/time.
de: Der Standardmodus entspricht dem Parameter <parameter>--view</parameter> und zeigt alle Termine in einem angegebenen Zeitrahmen an.

source: To view all of today's events (from 7:00 to 17:00), simply run:
de: Alle heutigen Termine zwischen 7:00 Uhr und 17:00 Uhr:

source: In this next example, we view all events for the week of August 18-22:
de: Das folgende Beispiel zeigt alle Termine der Woche vom 18. - 22. August an:

source: Show the next event(s) on the calendar from the current time forward:
de: Zeigt das nächste Ereignis oder die nächsten Ereignisse ab der aktuellen Uhrzeit an:

source: To view all events for the next 5 days run:
de: Um alle Ereignisse der nächsten 5 Tage zu sehen, geben Sie ein:

source: Inserting Events
de: Termine einfügen

source: &konsolekalendar; can insert events into a &kde; calendar or calendar resource using the <parameter>--add</parameter> command line argument. Events successfully inserted will be immediately shown by &kde; calendar applications (like &korganizer;).
de: &konsolekalendar; kann Ereignisse in einen &kde;-Kalender oder eine Kalender-Ressource mit dem Befehlszeilenparameter <parameter>--add</parameter> eintragen. Erfolgreich eingetragene Ereignisse werden von den &kde;-Kalenderapplikationen (wie &korganizer;) unmittelbar angezeigt.

source: In the following example, an event starting on 2003-06-04 (June 4, 2003) at 1000 and ending at 1200 with summary "Doctor Visit" will be inserted into the user's default calendar resource:
de: Das folgende Beispiel fügt einen Termin für den 4. Juni 2003 um 10:00 Uhr ein, der um 12:00 Uhr ende. Der Termin mit dem Titel <quote>Arztbesuch</quote> wird im Standardkalender des Benutzers eingefügt:

source: <prompt>%</prompt><userinput> <command>konsolekalendar</command> <option>--add</option> <option>--date <replaceable>2003-06-04</replaceable></option> <option>--time <replaceable>10:00</replaceable></option> \ <option>--end-time <replaceable>12:00</replaceable></option> <option>--summary <replaceable>"Doctor Visit"</replaceable></option></userinput>
de: <prompt>%</prompt><userinput> <command>konsolekalendar</command> <option>--add</option> <option>--date <replaceable>2003-06-04</replaceable></option> <option>--time <replaceable>10:00</replaceable></option> \ <option>--end-time <replaceable>12:00</replaceable></option> <option>--summary <replaceable>"Arztbesuch"</replaceable></option></userinput>

source: In this example, a birthday event is added into the user's default calendar resource:
de: Das folgende Beispiel fügt den eigenen Geburtstag in den Standardkalender ein:

source: <prompt>%</prompt><userinput> <command>konsolekalendar</command> <option>--add</option> <option>--date <replaceable>2003-06-06</replaceable></option> <option>--summary <replaceable>"My Birthday"</replaceable></option> \ <option>--description <replaceable>"Party Time"</replaceable></option></userinput>
de: <prompt>%</prompt><userinput> <command>konsolekalendar</command> <option>--add</option> <option>--date <replaceable>2003-06-06</replaceable></option> <option>--summary <replaceable>"Mein Geburtstag"</replaceable></option> \ <option>--description <replaceable>"Feier"</replaceable></option></userinput>

source: Here a one week vacation is inserted into a shared <replaceable>vacation</replaceable> calendar:
de: Eine Woche <replaceable>Urlaub</replaceable> wird in einen gemeinsam genutzten Kalender eingefügt:

source: <prompt>%</prompt><userinput> <command>konsolekalendar</command> <option>--add</option> <option>--file <replaceable>vacation.ics</replaceable></option> <option>--date <replaceable>2003-08-01</replaceable></option> \ <option>--end-date <replaceable>2003-08-07</replaceable></option> <option>--summary <replaceable>"Vacation"</replaceable></option> <option>--description <replaceable>"Nobody will ever find me!"</replaceable></option></userinput>
de: <prompt>%</prompt><userinput> <command>konsolekalendar</command> <option>--add</option> <option>--file <replaceable>vacation.ics</replaceable></option> <option>--date <replaceable>2003-08-01</replaceable></option> \ <option>--end-date <replaceable>2003-08-07</replaceable></option> <option>--summary <replaceable>"Urlaub"</replaceable></option> <option>--description <replaceable>"Ich löse mich in Luft auf!"</replaceable></option></userinput>

source: Removing Entries
de: Einträge entfernen

source: &konsolekalendar; supports the removal of entries in a calendar file or resource using the <parameter>--delete</parameter> command line argument. Calendar entries to be removed are specified exactly by their Unique-string identifier (<acronym>UID</acronym>) using the <parameter>--uid</parameter> option. <acronym>UIDs</acronym> are found by first viewing the event, using the <parameter>--view</parameter> option.
de: Einträge werden durch den Parameter <parameter>--delete</parameter> von &konsolekalendar; aus der Kalenderdatei oder anderen Ressourcen entfernt. Dazu muss die eindeutige Kennung (<acronym>UID</acronym>) über den Parameter <parameter>--uid</parameter> angegeben werden. Diese <acronym>UID</acronym> findet man, indem man den Termin zunächst über den Parameter <parameter>--view</parameter> anzeigen lässt.

source: Events successfully deleted will be immediately removed from within &kde; calendar applications (&korganizer; for example).
de: Erfolgreich gelöschte Ereignisse werden unmittelbar aus den &kde;-Kalender-Applikationen (wie &korganizer;) gelöscht.

source: When you delete something from the calendar you <emphasis>cannot</emphasis> undo it! In other words, when you delete an entry you cannot reverse the deletion. It's gone for good.
de: Das Entfernen eines Eintrages kann <emphasis>nicht</emphasis> rückgängig gemacht werden. Ein entfernter Eintrag ist und bleibt entfernt.

source: Here we delete a calendar entry with <acronym>UID</acronym> <replaceable>&konsolekalendar;-1887551750.196</replaceable>:
de: Im folgenden Beispiel wird der Termin mit der <acronym>UID</acronym> <replaceable>&konsolekalendar;-1887551750.196</replaceable> entfernt:

source: Modifying Entries
de: Einträge ändern

source: &konsolekalendar; supports the modification of existing entries in a calendar file or resource using the <parameter>--change</parameter> command line argument. Calendar entries to be modified are specified exactly by their Unique-string identifier (<acronym>UID</acronym>) using the <parameter>--uid</parameter> option. <acronym>UIDs</acronym> are found by first viewing the event, using the <parameter>--view</parameter> option.
de: Der Parameter zum Ändern von Einträgen in &konsolekalendar; lautet <parameter>--change</parameter>. Auch hier muss der Termin über die eindeutige Kennung (<acronym>UID</acronym>) mit dem Parameter <parameter>--uid</parameter> identifiziert werden. Die <acronym>UID</acronym> kann man ermitteln, indem man sich den Termin mit <parameter>--view</parameter> anzeigen lässt.

source: Changing behaves in the same way as inserting: you can change an event's start date and time, end date and time, summary, location, and description. Events successfully changed will be immediately shown modified within &kde; calendar applications (&korganizer;).
de: Änderungen verhalten sich genauso wie neu eingefügte Termine: Sie können Startzeitpunkt, Endzeitpunkt, Beschreibung, Ort und Zusammenfassung angeben. Erfolgreich geänderte Termine werden unmittelbar in den &kde;-Kalenderapplikationen (wie &korganizer;) geändert.

source: <emphasis>Example:</emphasis> Here we change the summary and description of a calendar entry with <acronym>UID</acronym> <replaceable>&konsolekalendar;-1887551750.196</replaceable>:
de: <emphasis>Beispiel:</emphasis> Die Zusammenfassung (summary) und Beschreibung (description) eines Termins mit der <acronym>UID</acronym> <replaceable>&konsolekalendar;-1887551750.196</replaceable> wird verändert.

source: <prompt>%</prompt><userinput> <command>konsolekalendar</command> <option>--change</option> <option>--uid <replaceable>&konsolekalendar;-1887551750.196</replaceable></option> <option>--summary <replaceable>"Get my head examined"</replaceable></option> <option>--description <replaceable>"don't go to that doctor anymore!"</replaceable></option> </userinput>
de: <prompt>%</prompt><userinput> <command>konsolekalendar</command> <option>--change</option> <option>--uid <replaceable>&konsolekalendar;-1887551750.196</replaceable></option> <option>--summary <replaceable>"Untersuchung"</replaceable></option> <option>--description <replaceable>"Termin beim Nervenarzt."</replaceable></option> </userinput>

source: Creating a New Calendar File
de: Einen neuen Kalender erzeugen

source: &konsolekalendar; can be used to create a new &kde; calendar file. Since you cannot insert an entry into a calendar that does not exist, you must create the file first using the <parameter>--create</parameter> and <parameter>--file</parameter> command line arguments.
de: Mit &konsolekalendar; kann man auch eine neue &kde;-Kalenderdatei erzeugen. Bevor man Einträge in den neuen Kalender einfügen kann, muss er zunächst mit Hilfe von <parameter>--create</parameter> und <parameter>--file</parameter> erzeugt werden.

source: Create a calendar file named <filename><replaceable>/data/share/calendars/vacation.ics</replaceable></filename>:
de: Die Kalenderdatei <filename><replaceable>/data/share/calendars/vacation.ics</replaceable></filename> wird erzeugt:

source: Exporting to Other Formats
de: Kalender in andere Formate exportieren

source: &konsolekalendar; can export a &kde; calendar to other well known formats. Exporting is a special form of viewing. By default, events are viewed in <quote>&konsolekalendar; text</quote> format. To change the viewing format use the <parameter>--export-type</parameter> command line argument.
de: Mit &konsolekalendar; können &kde;-Kalender in einige gängige Formate exportiert werden. Dabei handelt es sich um eine besondere Form der Anzeige. Standardmäßig werden Termine im Format <quote>&konsolekalendar;-Text</quote> angezeigt. Ein davon abweichendes Format stellt man über den Parameter <parameter>--export-type</parameter> ein.

source: To see a list of all supported export formats, use the <parameter>--export-list</parameter> option, as in:
de: Eine vollständige Liste aller unterstützten Exportformate erhält man durch den Parameter <parameter>--export-list</parameter>:

source: Export Formats
de: Exportformate

source: Some, but not necessarily all, of the supported formats are described in the this section.
de: Einige der wichtigsten Exportformate werden im folgenden Abschnitt beschrieben.

source: &konsolekalendar; Text Format is &konsolekalendar;'s native format and is designed to be comfortable to read and to be parsed by follow-on scripts.
de: Das &konsolekalendar;-Textformat ist das Standardformat von &konsolekalendar; und dazu gedacht, einfach lesbar und für nachfolgende Skripte verarbeitbar zu sein.

source: The &konsolekalendar; Text Format is:
de: Das &konsolekalendar;-Textformat lautet:

source: Date:\t&lt;Incidence Date&gt;(dddd yyyy-MM-dd) [\t&lt;Incidence Start Time&gt;(hh:mm) - &lt;Incidence End Time&gt;(hh:mm)] Summary: \t&lt;Incidence Summary | "(no summary available)"&gt; Location: \t&lt;Incidence Location | "(no location available)"&gt; Description: \t&lt;Incidence Description | "(no description available)"&gt; UID: \t&lt;Incidence UID&gt; --------------------------------------------------
de: Datum:\t&lt;Ereignisdatum&gt;(dddd jjjj-MM-tt) [\t&lt;Ereignisstartzeit&gt;(hh:mm) - &lt;Ereignisendzeit&gt;(hh:mm)] Zusammenfassung: \t&lt;Ereigniszusammenfassung | "(keine Zusammenfassung verfügbar)"&gt; Ort: \t&lt;Ereignisort | "(kein Ort verfügbar)"&gt; Beschreibung: \t&lt;Ereignisbeschreibung | "(keine Beschreibung verfügbar)"&gt; UID: \t&lt;Ereignis-UID&gt; --------------------------------------------------

source: For example:
de: Beispiel:

source: Date: Tuesday 2003-11-01 08:00 - 09:00 Summary: Staff Meeting Location: Conference Room Description: Meet with the entire staff to discuss the project. UID: &konsolekalendar;-1128954167.1013 --------------------------------------------------
de: Date: 01.11.2003 8:00 - 9:00 Summary: Besprechung Ort: Konferenzraum Description: Die gesamte Abteilung trifft sich im großen Konferenzraum. UID: &konsolekalendar;-1128954167.1013

source: &konsolekalendar; Short Text Format
de: &konsolekalendar;-Kurztextformat

source: Short Text Format provides a more compact, less verbose version of &konsolekalendar;'s native format.
de: Das Kurztextformat ist eine kompaktere, weniger wortreiche Variante des nativen Formats von &konsolekalendar;.

source: The &konsolekalendar; Short Text Format is:
de: Das &konsolekalendar;-Kurztextformat lautet:

source: [--------------------------------------------------] {&lt;Incidence Date&gt;(dddd yyyy-MM-dd)] [&lt;Incidence Start Time&gt;(hh:mm) - &lt;Incidence End Time&gt;(hh:mm) | "\t"] \t&lt;Incidence Summary | \t&gt;[, &lt;Incidence Location&gt;] \t\t&lt;Incidence Description | "\t"&gt;
de: [--------------------------------------------------] {&lt;Ereignisdatum&gt;(dddd jjjj-MM-tt)] [&lt;Ereignisstartzeit&gt;(hh:mm) - &lt;Ereignisendzeit&gt;(hh:mm) | "\t"] \t&lt;Ereigniszusammenfassung | \t&gt;[, &lt;Ereignisort&gt;] \t\t&lt;Ereignisbeschreibung | "\t"&gt;

source: -------------------------------------------------- Tuesday 2003-11-01 08:00 - 09:00 Staff Meeting, Conference Room Meet with the entire staff to discuss the project.
de: -------------------------------------------------- Tuesday 2003-11-01 08:00 - 09:00 Mitarbeiterbesprechung, Konferenzraum Das gesamte Team trifft sich zu einer Projektbesprechung.

source: Comma-Separated Values (<acronym>CSV</acronym>) Format
de: durch Kommas getrennte Werte (<quote><acronym>CSV</acronym></quote>-Format)

source: Comma-Separated Value Format displays the event values in the same order as &konsolekalendar; Text format. The only difference is that all the information is on the same row with each field separated by a comma. The resulting exported files can be imported directly into spreadsheet programs like &kspread;, <application>OpenOffice.org Calc</application>, and <application>&Microsoft; Excel</application>. Also, <acronym>CSV</acronym> format is easy to parse with follow-on scripts.
de: Die Informationen des Termins werden in der gleichen Reihenfolge wie im &konsolekalendar;-Textformat angezeigt. Der einzige Unterschied ist, alle Informationen befinden sich in einer Zeile in einer durch Kommas getrennten Liste. Dieses Format kann z.B. von Tabellenkalkulationsprogrammen wie &kspread;, <application>OpenOffice.org</application> und <application>&Microsoft; Excel</application> gelesen werden. Das <acronym>CSV</acronym>-Format eignet sich auch gut zur Weiterverarbeitung durch Skripte.

source: The Comma-Separated Value (<acronym>CSV</acronym>) format is:
de: Das <acronym>CSV</acronym>-Format lautet:

source: YYYY-MM-DD,HH:MM,YYYY-MM-DD,HH:MM,Summary,Location,Description,UID
de: YYYY-MM-DD,HH:MM,YYYY-MM-DD,HH:MM,Zusammenfassung,Ort,Beschreibung,Kennung

source: 2003-11-01,08:00,2003-11-01,09:00,Staff Meeting,Conference Room,Meet in the big conference \ room with the entire staff.,&konsolekalendar;-1128954167.1013
de: 2003-11-01,08:00,2003-11-01,09:00,Besprechung,Konferenzraum,Die gesamte Abteilung trifft sich \ im großen Konferenzraum.,&konsolekalendar;-1128954167.1013

source: The &HTML; export format will produce a valid &HTML; file that can be published to the <acronym>WWW</acronym>. This export format is not suitable for follow-on script parsing, but is very nice for publishing calendars for easy public viewing.
de: Der &HTML;-Export erzeugt eine gültige &HTML; -Datei zur Veröffentlichung im <acronym>WWW</acronym>. Das Format ist nicht geeignet zur Verarbeitung durch Skripte aber zur einfachen Veröffentlichung.

source: <emphasis>TODO:</emphasis> Insert screenshot here
de: <emphasis>TODO:</emphasis> Bildschirmfoto einfügen

source: This format produces an &HTML; file showing all appointments in the months specified by the date range. This export format is not suitable for follow-on script parsing, but is very nice for publishing calendars for easy public viewing.
de: Dieses Format produziert eine &HTML;-Datei, die alle Termine im angegebenen Zeitraum enthält. Das Format ist nicht geeignet zur Verarbeitung durch Skripte aber zur einfachen Veröffentlichung.

source: Importing Calendars
de: Kalender importieren

source: &konsolekalendar; can import an iCal or vCal calendar file into a &kde; calendar. All events from the calendar being imported from will be inserted, including identical events. In the next &konsolekalendar; release identical events will not be inserted.
de: &konsolekalendar; kann iCal- oder vCal-Kalenderdateien in das &kde;-Kalenderformat importieren. Alle Termine, auch identische Termine, werden eingefügt. Dieser letzte Punkt soll in der nächsten Version von &konsolekalendar; bereinigt werden.

source: To import calendar file <filename><replaceable>another.ics</replaceable></filename> into calendar <filename><replaceable>current.ics</replaceable></filename> run:
de: Folgendermaßen wird die Kalenderdatei <filename><replaceable>irgendein_Name.ics</replaceable></filename> in den Kalender <filename><replaceable>current.ics</replaceable></filename> übernommen:

source: <prompt>%</prompt><userinput> <command>konsolekalendar</command> <option>--import <replaceable>another.ics</replaceable></option> <option>--file <replaceable>current.ics</replaceable></option></userinput>
de: <prompt>%</prompt><userinput> <command>konsolekalendar</command> <option>--import <replaceable>irgendein_Name.ics</replaceable></option> <option>--file <replaceable>current.ics</replaceable></option></userinput>

source: Command Line Arguments
de: Befehlszeilenparameter

source: &konsolekalendar; supports the following options:
de: Folgende Optionen versteht &konsolekalendar;:

source: Description
de: Beschreibung

source: Shows help about the program options.
de: Zeigt Hilfetexte zu den Optionen an.

source: Shows the program author information.
de: Zeigt Informationen über die Programmautoren.

source: Shows the program version information.
de: Zeigt die Versionsnummer des Programms an.

source: Shows the program license information.
de: Zeigt Informationen zu den Lizenzbestimmungen.

source: Print helpful runtime messages.
de: Gibt nützliche Laufzeitmeldungen aus.

source: Print what would have been done, but do not execute. Do not change any files; do not insert, remove, modify any existing files, nor create any new files.
de: Es wird ausgegeben, was getan würde, die Aktionen werden aber nicht wirklich durchgeführt (eignet sich gut für Testzwecke).

source: Permit resources which might need an interactive user interface. In normal operation, only resources which never will require a user interface are used (like file-based calendars).
de: Ressourcen zulassen, die möglicherweise ein Benutzerschnittstelle erfordern. Bei den meistem Funktionen werden nur Ressourcen (wie Datei-basierte Kalender) benutzt, die keine Benutzerschnittstelle erfordern.

source: <option>--file</option> <replaceable>&nbsp;calendar-file</replaceable>
de: <option>--file</option><replaceable>&nbsp;Kalenderdatei</replaceable>

source: Specify a calendar file to use.
de: Legt die zu benutzende Kalenderdatei fest.
