Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdepim/konsolekalendar.po
Languages: de

source: If not specified then your default &korganizer; resource is used.
de: Ansonsten wird die Standardeinstellung von &korganizer; verwendet.

source: Major Operation Modes:
de: Hauptarbeitsmodi:

source: Print calendar events in specified export format.
de: Gibt Termine im angegebenen Ausgabeformat aus.

source: Insert an event into the calendar.
de: Fügt einen Termin in den Kalender ein.

source: Modify an existing calendar event.
de: Ändert die Daten eines bestehenden Termins.

source: Remove an existing calendar event.
de: Entfernt einen bestehenden Termin.

source: Create a new calendar file if one does not exist.
de: Erstellt eine neue Kalenderdatei, falls noch keine existiert.

source: <option>--import</option> <replaceable>&nbsp;import-file</replaceable>
de: <option>--import</option> <replaceable>&nbsp;Dateiname</replaceable>

source: Import this calendar to the main calendar.
de: Importiert diesen Kalender in den Hauptkalender.

source: Operation modifiers:
de: Parameter für die Operationen:

source: View all calendar entries.
de: Zeigt alle Kalendereinträge an.

source: View next activity in calendar.
de: Nächste Aktivität im Kalender anzeigen.

source: <option>--show-next</option> <replaceable>&nbsp;days</replaceable>
de: <option>--show-next</option> <replaceable>&nbsp;Tage</replaceable>

source: Starting at specified date show next # days' activities.
de: Ab dem angegebenen Datum die Aktivitäten der nächsten n Tage anzeigen.

source: <option>--uid</option> <replaceable>&nbsp;UID</replaceable>
de: <option>--uid</option> <replaceable>&nbsp;Kennung</replaceable>

source: View, delete, or change the event with this Unique-string IDentifier.
de: Der Termin mit dieser Kennung wird angezeigt, entfernt oder geändert.

source: <option>--date</option> <replaceable>&nbsp;date</replaceable>
de: <option>--date</option> <replaceable>&nbsp;Datum</replaceable>

source: Start at this day [YYYY-MM-DD]. Default date is Today
de: Beginnt mit dem angegebenen Tag [JJJJ-MM-DD]. Der Standardwert ist heute.

source: <option>--time</option> <replaceable>&nbsp;time</replaceable>
de: <option>--time</option> <replaceable>&nbsp;Zeitpunkt</replaceable>

source: Start at this time [HH:MM]. Default time for viewing is 07:00.
de: Beginnt mit der angegebenen Zeit [HH:MM]. Der Standardwert ist 07:00.

source: To add or change a floating event, use the <option>--time float</option> or the <option>--end-time float</option> options.
de: Um einen beweglichen Termin einzutragen oder zu ändern, verwenden Sie eine der Optionen <option>--time float</option> oder <option>--end-time float</option>.

source: <option>--end-date</option> <replaceable>&nbsp;end-date</replaceable>
de: <option>--end-date</option> <replaceable>&nbsp;Datum</replaceable>

source: End at this day [YYYY-MM-DD]. Default is set by <option>--date</option>.
de: Endet am angegebenen Tag [JJJJ-MM-DD]. Der Standardwert ist der unter <option>--date</option> angegebene Tag.

source: <option>--end-time</option> <replaceable>&nbsp;end-time</replaceable>
de: <option>--end-time</option> <replaceable>&nbsp;Zeitpunkt</replaceable>

source: End at this time [HH:MM]. Default end-time for viewing is 17:00.
de: Endet zu dieser Zeit [HH:MM]. Der Standardwert für die Ansicht ist 17:00.

source: <option>--epoch-start</option> <replaceable>&nbsp;epoch-time</replaceable>
de: <option>--epoch-start</option> <replaceable>&nbsp;Zeit</replaceable>

source: Start at this time [seconds since epoch].
de: Beginnt zu dieser Zeit [Sekunden seit epoch].

source: <option>--epoch-end</option> <replaceable>&nbsp;epoch-time</replaceable>
de: <option>--epoch-end</option> <replaceable>&nbsp;Zeit</replaceable>

source: End at this time [seconds since epoch].
de: Endet zu dieser Zeit [Sekunden seit epoch].

source: <option>--summary</option> <replaceable>&nbsp;summary</replaceable>
de: <option>--summary</option> <replaceable>&nbsp;Zusammenfassung</replaceable>

source: Add summary to event (works with add and change).
de: Fügt eine Zusammenfassung zum Termin hinzu (bei <quote>add</quote> und <quote>change</quote>).

source: <option>--description</option> <replaceable>&nbsp;description</replaceable>
de: <option>--description</option> <replaceable>&nbsp;Beschreibung</replaceable>

source: Add description to event (works with add and change).
de: Fügt eine Beschreibung zum Termin hinzu (bei <quote>add</quote> und <quote>change</quote>).

source: <option>--location</option> <replaceable>&nbsp;location</replaceable>
de: <option>--location</option> <replaceable>&nbsp;Ort</replaceable>

source: Add location to event (works with add and change).
de: Fügt einen Ort zum Termin hinzu (bei <quote>add</quote> und <quote>change</quote>).

source: Export options:
de: Exportparameter:

source: <option>--export-type</option> <replaceable>&nbsp;export-type</replaceable>
de: <option>--export-type</option> <replaceable>&nbsp;Typ</replaceable>

source: Export file type. Default export file type is Text
de: Export zum angegebenen Typ. Der Standardtyp ist Text.

source: <option>--export-file</option> <replaceable>&nbsp;export-file</replaceable>
de: <option>--export-file</option> <replaceable>&nbsp;Dateiname</replaceable>

source: Export to file. By default, output is written to standard output.
de: Export in die angegebene Datei. Standardmäßig wird der Export zur Standardausgabe durchgeführt.

source: Print list of export types supported and exit.
de: Zeigt eine Liste der unterstützten Exportformate an.

source: Questions and Answers
de: Fragen und Antworten

source: What configuration files does &konsolekalendar; use?
de: Welche Konfigurationsdateien verwendet &konsolekalendar;?

source: None.
de: Keine.

source: What are the application names of &konsolekalendar;?
de: Wie lauten die Namen von &konsolekalendar;?

source: &konsolekalendar;'s application name is <application>konsolekalendar</application>.
de: Der Name von &konsolekalendar; ist <application>konsolekalendar</application>.

source: What is the date specification format?
de: In welchem Format müssen Datumsangaben gemacht werden?

source: &konsolekalendar; will reject dates specified on the command line unless they are specified according to ISO 8601 standards, namely: YYYY-MM-DD. Where YYYY represents a four-digit year (like 2003), MM represents a two-digit month (01,02,..,12), and DD represents a two-digit day (01,02,...,31).
de: &konsolekalendar; erfordert die Eingabe von Datumsangaben nach dem ISO-8601-Standard, also: JJJJ-MM-DD. Dabei bedeutet JJJJ die Jahresangabe mit vier Ziffern (z.B. 2003), MM die Monatsangabe mit zwei Ziffern (01,02,...,12) und DD die Tagesangabe mit zwei Ziffern (01,02,...,31).

source: &konsolekalendar; always exports dates according to the ISO 8601 format.
de: &konsolekalendar; exportiert Datumsangaben immer nach dem ISO-8601-Format.

source: What is the time specification format?
de: In welchem Format müssen Zeitangaben gemacht werden?

source: &konsolekalendar; will reject times specified on the command line unless they are specified according to ISO 8601 standards, namely: HH:MM:SS. Where HH represents a two-digit hour (01,02,...,24), MM represents a two-digit minute (01,02,..,60), and SS represents a two-digit second (01,02,...,60).
de: Zeitangaben für &konsolekalendar; müssen unbedingt in Übereinstimmung mit dem ISO-8601-Standard eingegeben werden, also HH:MM:SS. Dabei bedeutet HH die Stunde zweiziffrig (01,02,...,24), MM die Minuten zweiziffrig (01,02,...,60), und SS die Sekunden ebenfalls zweiziffrig (01,02,...,60).

source: &konsolekalendar; always exports times according to the ISO 8601 format.
de: &konsolekalendar; exportiert Zeitangaben immer entsprechend dem ISO-8601-Standard.

source: Will &konsolekalendar; insert a new event that is identical to one that already exists in the calendar?
de: Fügt &konsolekalendar; bei übereinstimmenden Zeiten einen neuen Termin ein, der identisch zu einem bereits vorhandenen ist?

source: No. See next question.
de: Nein. Siehe nächste Frage.

source: How does &konsolekalendar; determine if an event is identical to one that already exists in the calendar?
de: Wie stellt &konsolekalendar; fest, ob ein Termin identisch zu einem bereits im Kalender vorhandenen ist?

source: &konsolekalendar; checks the specified start date and time, end date and time, and summary against all events in the calendar. An event match is determined if all three values match to an existing event.
de: &konsolekalendar; vergleicht Startzeitpunkt, Endzeitpunkt und Zusammenfassung mit allen im Kalender vorhandenen Terminen. Falls alle drei Angaben übereinstimmen, sind die Termine identisch.

source: Can a non-floating event be changed to a floating event?
de: Kann ein nicht-beweglicher Termin in einen beweglichen Termin umgewandelt werden?

source: Yes. Use the <option>--time float</option> option with <option>--change</option>.
de: Ja. Benutzen Sie die Option <option>--time float</option> mit <option>--change</option>.

source: Why are event <acronym>UIDs</acronym> printed in most export formats?
de: Warum werden in den meisten Exportformaten die Kennungen (<acronym>UIDs</acronym>) ausgegeben?

source: Because you need to specify <acronym>UIDs</acronym> to delete or change events. If you do not want to see event <acronym>UIDs</acronym> then use the <emphasis>short</emphasis> export type (<option>--export-type short</option>).
de: Weil Sie die Kennungen (<acronym>UIDs</acronym>) zum Löschen oder Ändern von Ereignissen benötigen. Wenn Sie die <acronym>UIDs</acronym> von Terminen nicht sehen möchten, dann verwenden Sie den <emphasis>kurzen</emphasis> Exporttyp (<option>--export-type short</option>).

source: How do I have my question added to this <acronym>FAQ</acronym>?
de: Wie kann ich eine Frage zu den <acronym>FAQ</acronym> hinzufügen?

source: Send your questions to <email>winter@kde.org</email>.
de: Senden Sie Ihre Fragen an <email>winter@kde.org</email>.

source: Credits and License
de: Danksagungen und Lizenz

source: &konsolekalendar; Program copyright 2002-2007:
de: &konsolekalendar; Programm Copyright 2002-2007:

source: Documentation copyright 2003:
de: Dokumentation Copyright 2003:

source: CREDIT_FOR_TRANSLATORS
de: <para>Noch niemand</para>

source: How to obtain &konsolekalendar;
de: Wie bekomme ich &konsolekalendar;?

source: &konsolekalendar; comes included with &kde;4 and is not available separately.
de: &konsolekalendar; ist Bestandteil von &kde;4 und nicht separat erhältlich.

source: Requirements
de: Voraussetzungen

source: &konsolekalendar; requires the standard &kde; libraries to be installed (the <filename>kdelibs</filename> package and <filename>kdepimlibs</filename>). To compile from source, you also need the &Qt;, <filename>kdelibs</filename> and <filename>kdepimlibs</filename> development packages.
de: Für &konsolekalendar; müssen die &kde;-Standardbibliotheken (also das <filename>kdelibs</filename> und das <filename>kdepimlibs</filename>-Paket) installiert sein. Zur Kompilierung wird außerdem &Qt; und die Entwicklerpakete zu <filename>kdelibs</filename> und <filename>kdepimlibs</filename> benötigt.

source: You can find a list of changes in the <filename>ChangeLog</filename> file.
de: Ein Liste von Änderungen finden Sie in der Datei <filename>ChangeLog</filename>.

source: Configuration
de: Einrichtung

source: No special configuration is required to set up &konsolekalendar; to run on the &kde; desktop.
de: Zur Verwendung von &konsolekalendar; mit der &kde;-Arbeitsoberfläche sind keine weiteren Konfigurationen notwendig.
