Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdepim/kontact-admin.po
Languages: de

source: The &kappname; Administrator's Guide
de: Handbuch zu &kappname; für den Systemverwalter

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Burkhard</firstname><surname>Lück</surname><affiliation><address><email>lueck@hube-lueck.de</email></address></affiliation><contrib>Übersetzung</contrib></othercredit>

source: This is the administrator's manual for &kappname;, the integrated solution to your personal information management (&PIM;) needs. &kappname; combines well-known &kde; applications like &kmail;, &korganizer; and &kaddressbook; into a single interface to provide easy access to mail, scheduling, address book and other &PIM; functionality.
de: Dies ist das Handbuch für den Systemverwalter zu &kappname; dem integrierten Programm für Persönliches Informationsmanagement (&PIM;). Es kombiniert bekannte &kde;-Programme wie &kmail;, &korganizer; und &kaddressbook; unter einer einheitlichen Oberfläche. Damit hat man einfachen Zugriff auf E-Mail, Termine, Adressbuch und weitere &PIM;-Funktionen.

source: administration
de: Verwaltung

source: administer
de: Verwalten

source: calendar
de: Kalender

source: contact
de: Kontakt

source: Introduction
de: Einführung

source: This is the administrator's manual for &kappname;, the integrated solution to your personal information management (&PIM;) needs. This document is intended to aid the groupware administrator with typical tasks needed to setup &kappname; and make it work smoothly in various environments.
de: Dies ist das Handbuch für den Systemverwalter zu &kappname; dem integrierten Programm für Persönliches Informationsmanagement (&PIM;). Dies Dokument soll dem Systemverwalter für Groupware bei den typischen Aufgaben helfen, &kappname; so einzurichten, dass es problemlos in verschiedenen Softwareumgebungen läuft.

source: &kappname; combines well-known &kde; applications like &kmail;, &korganizer; and &kaddressbook; into a single interface to provide easy access to mail, scheduling, address book and other &PIM; functionality.
de: &kappname; kombiniert bekannte &kde;-Programme wie &kmail;, &korganizer; und &kaddressbook; unter einer einheitlichen Oberfläche. Damit hat man einfachen Zugriff auf E-Mail, Termine, Adressbuch und weitere &PIM;-Funktionen.

source: Compatibility Issues
de: Kompatibilitäts-Probleme

source: This chapter provides help with how to make &kappname; communicate effectively with various groupware solutions.
de: In diesem Kapitel finden Sie Anleitungen, um die Kommunikation von &kappname; mit anderen Groupware-Lösungen zu verbessern.

source: Outlook and Exchange
de: Outlook und Exchange

source: In the &kappname; configuration dialog, under <menuchoice><guimenu>Mail</guimenu> <guimenuitem>Misc</guimenuitem></menuchoice> on the <guilabel>Invitations</guilabel> page you will find the following options that will help the user communicate with Microsoft Outlook(tm) running in a Kolab environment or in a Microsoft Exchange(tm) environment.
de: Im Einrichtungsdialog von &kappname; finden Sie unter <menuchoice><guimenu>E-Mail</guimenu><guimenuitem>Diverses</guimenuitem></menuchoice> auf der Seite <guilabel>Einladungen</guilabel> einige Einstellungen, die dem Benutzer bei der Kommunikation mit Microsoft Outlook(tm) in einer Kolab-Umgebung oder in einer Microsoft Exchange(tm)-Umgebung helfen.

source: Mangle From:/To: headers in replies to invitations
de: Vorspannfelder für „Von“ und „An“ in Antworten auf Terminanfragen einsetzen

source: Enable this option to make Microsoft Outlook(tm) understand your answers to invitation replies.
de: Schalten Sie diese Option ein, damit Microsoft Outlook(tm) Ihre Antworten auf Einladungen versteht.

source: Microsoft Outlook has a number of shortcomings in its implementation of the iCalendar standard; this option works around one of them. If you have problems with Outlook users not being able to get your replies, try setting this option.
de: Das Programm Microsoft Outlook implementiert den iCalendar-Standard nicht vollständig korrekt. Diese Einstellung schafft Abhilfe für einen solchen Fehler. Falls Benutzer von Outlook Ihre Antworten nicht erhalten, versuchen Sie es mit dieser Einstellung.

source: Details: When mailing an iCal invitation this makes the message have the From: header the same as the To: header. It also sets header X-KMail-Identity to the To:'s UIOD and makes sure the BCC: is blank. Outlook will only understand the reply if the From: header is the same as the To: header of the invitation message.
de: Details: Beim Senden einer iCal-Einladung wird mit dieser Einstellung der im Vorspann der Nachricht der gleiche Wert für „Von“ für das Feld „An” benutzt. Außerdem wird im Vorspann für „X-KMail-Identity“ der UIOD des Feldes „An” und der Wert des Feldes „Blindkopie“ gelöscht. Outlook versteht die Antwort nur dann, wenn im Vorspann der Einladung die Felder „Von“ und „An” den gleichen Wert haben

source: Send invitations in the mail body
de: Einladung im Textteil der E-Mail verschicken

source: Invitations are normally sent as attachments to a mail. This switch changes the invitation to be sent in the text of the mail instead; this is necessary to send invitations and replies to Microsoft Outlook. But, when you do this, you no longer get descriptive text that mail programs can read; so, to people who have email programs that do not understand the invitations, the resulting messages look very odd. People that have email programs that do understand invitations will still be able to work with this.
de: Terminanfragen werden normalerweise als Anhang versendet. Diese Einstellung bewirkt, dass Terminanfragen stattdessen im Text der Mail versendet werden. Dies ist bei Terminanfragen und Antworten an Microsoft Outlook nötig. Wenn Sie diese Einstellung verwenden, erhalten Sie keinen erläuternden Text mehr, der von einem E-Mail-Programm gelesen werden kann. Für Personen, deren E-Mail-Programme Terminanfragen nicht verstehen, sehen die entsprechenden Nachrichten sehr merkwürdig aus. Personen, deren E-Mail-Programm Terminanfragen versteht, können weiterhin damit arbeiten.

source: Details: When mailing an iCal invitation this option makes the message body from the attachment data and sets the Content-Type header to 'text/calendar; method=something; charset="utf-8"'.
de: Details: Beim Senden einer iCal-Einladung wird mit dieser Einstellung der Nachrichtentext aus den Daten des Anhangs erzeugt und im Vorspann als Content-Typ 'text/calendar; method=something; charset="utf-8"'. eingetragen.

source: Auto-sending is also turned on so there is no human intervention required for composing.
de: Das Automatische Versenden ist auch eingeschaltet, daher ist für das Verfassen der Nachricht keine Aktion durch den Benutzer nötig.

source: Encryption and self-signing are disabled.
de: Verschlüsselung und eigene Signierung sind nicht möglich.

source: Exchange-compatible invitation naming
de: Exchange-kompatible Namensvergabe für Einladungen

source: Microsoft Outlook, when used in combination with a Microsoft Exchange(tm) server, has a problem understanding standards-compliant groupware email. Enable this option to send groupware invitations in a way that Microsoft Exchange(tm) understands. The invitation will be sent as an attachment with name <filename>ical.ics</filename>.
de: Wenn Microsoft Outlook mit einem Microsoft-Exchange-Server eingesetzt wird, versteht es keine standardkonformen Arbeitsgruppen-E-Mails. Wenn diese Einstellung aktiviert ist, werden Einladungen in einem Format gesendet, das von Microsoft Exchange verstanden wird. Die Einladung wird als Anhang mit dem Namen <filename>ical.ics</filename> gesendet.

source: Details: When mailing an iCal invitation this makes the message have the subject "(Declined|Tentative|Accepted|Delegated): subject". The invitation will be sent as an attachment with name <filename>ical.ics</filename>.
de: Details: Beim Senden einer iCal-Einladung wird mit dieser Einstellung dem Betreff der Nachricht "(Abgelehnt|Vorläufig|Akzeptiert|Delegiert). Betreff" vorangestellt. Die Einladung wird als Anhang mit dem Namen <filename>ical.ics</filename> versendet.

source: Outlook compatible invitation reply comments
de: Outlook-kompatible Kommentare in Antworten auf Einladungen

source: When the user provides comments when responding to invitations, send the comment in a form that Microsoft Outlook(tm) understands. If this option is not enabled, the response comments will not be seen in Outlook.
de: Werden Kommentare mit einer Antwort auf Einladungen verschickt, wird der Kommentar in einem Format gesendet, das von Microsoft Outlook(tm) verstanden wird. Ist diese Option nicht aktiv, werden der Kommentar in der Antwort in Outlook nicht angezeigt.

source: Details: When answering the invitation comments will be sent as a DESCRIPTION iCal property instead of the COMMENT iCal property (in violation of RFC2446).
de: Details: Kommentare in einer Antwort auf Einladungen werden als iCal-Eigenschaft DESCRIPTION anstatt als iCal-Eigenschaft COMMENT unter Missachtung von RFC2446 verschickt.

source: Behavioral Issues
de: Anpassung des Verhaltens

source: This chapter provides instructions on how to make &kappname; behave more like other groupware clients.
de: In diesem Kapitel finden Sie Anleitungen, um das Verhalten von &kappname; besser an andere Groupware-Programme anzupassen.

source: Composing Messages
de: Nachrichten erstellen

source: Outlook users are accustomed to typing a list of addresses in the To:, CC: or BCC: fields separated by a semicolon (';') character in addition to a comma (','). By default, &kappname; only allows the comma as an address separator character. To also allow the semicolon, change the <option>AllowSemicolonAsAddressSeparator</option> from false to true in the installed <filename>share/config.kcfg/kmail.kcfg</filename> file.
de: Benutzer von Outlook sind daran gewöhnt, mehrere Adressen bei der Eingabe in die Felder „An“, „Kopie“ und „Bindkopie“ durch ein Semikolon (';') oder durch zu einem Komma (',') zu trennen. In der Voreinstellung ist &kappname; nur das Komma als Trennzeichen zwischen Adressen erlaubt. Um hier auch das Semikolon verwenden zu können, ändern Sie in der installierten Datei <filename>share/config.kcfg/kmail.kcfg</filename> den Wert <option>AllowSemicolonAsAddressSeparator</option> von „false“ auf „true“.

source: RFC Compromises
de: RFC-Kompromisse

source: &kappname; is designed to interoperate as well as is possible with a wide variety of groupware solutions. To that end, we sometimes make design compromises with respect to the various Internet RFCs that provide the basis for low-level libraries on which &kappname; relies heavily.
de: &kappname; wird mit dem Ziel entwickelt, so gut wie möglich mit vielen verschiedenen Groupware-Lösungen zusammen zu arbeiten. Um das zu erreichen, sind manchmal Kompromisse im Hinblick auf verschieden Internet-RFCs nötig, die die Grundlage der von &kappname; verwendeten Bibliotheken bilden.

source: We never knowingly violate any RFC.
de: Die Regelungen von RFCs werden niemals absichtlich missachtet.

source: The following list of RFC compromises is made by &kappname; or the low-levels libraries used by &kappname;:
de: Im Folgenden werden die von &kappname; und den zugehörigen Bibliotheken verwendeten RFC-Kompromisse aufgeführt:

source: When writing duration values into iCalendar files, &kappname; never writes the DURATION property in terms of weeks (i.e., 1*DIGIT "W"); instead, the integer number of weeks is always multiplied by 7 and written in terms of days (i.e. 1*DIGIT "D").
de: Beim Schreiben von Zeiträumen in iCalendar-Dateien verwendet &kappname; niemals die Dauer in Wochen (&ie; 1*DIGIT "W"), sondern multipliziert die Anzahl der Wochen immer mit dem Faktor sieben und schreibt den Zeitraum als Tage (&ie; 1*DIGIT "D").

source: Common Problems
de: Häufige Probleme

source: This chapter deals with common problems the administrator is likely to encounter.
de: Dieses Kapitel behandelt häufige Probleme, auf die jeder Systemverwalter wahrscheinlich trifft.

source: FreeBusy common problems ...
de: Häufige Probleme mit FreeBusy...

source: Credits and License
de: Danksagungen und Lizenz

source: Documentation Copyright &copy; 2009 Klarälvdalens Datakonsult AB, a KDAB Group company, <email>info@kdab.net</email>
de: Dokumentation Copyright &copy; 2009 Klarälvdalens Datakonsult AB, a KDAB Group company, <email>info@kdab.net</email>

source: CREDIT_FOR_TRANSLATORS
de: <para>Übersetzung Burkhard Lück<email>lueck@hube-lueck.de</email></para>

source: How to obtain &kappname;
de: Bezugsquellen von &kappname;

source: Compilation and Installation
de: Kompilierung und Installation
