Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdepim/korganizer.po
Languages: de

source: <guimenu>File</guimenu> <guisubmenu>Import</guisubmenu> <guimenuitem>Get Hot New Stuff...</guimenuitem>
de: <guimenu>Datei</guimenu> <guisubmenu>Importieren</guisubmenu> <guimenuitem>"Neue Erweiterungen" abholen ...</guimenuitem>

source: This action will open the <guilabel>Get Hot New Stuff</guilabel> dialog, which offers a list of calendars to download. These events can be added to your calendar.
de: Dieser Eintrag öffnet den Dialog <guilabel>„Neue Erweiterungen“ herunterladen</guilabel>, welcher es Ihnen einen Liste von Kalendern zum Herunterladen anbietet. Diese Termin können Ihrem Kalender hinzugefügt werden.

source: For more information about this action, please refer to <xref linkend="managing-get-hot-new-stuff"/>.
de: Weitere Informationen hierzu finden Sie unter <xref linkend="managing-get-hot-new-stuff"/>.

source: <guimenu>File</guimenu> <guisubmenu>Export</guisubmenu> <guimenuitem>Export Web Page...</guimenuitem>
de: <guimenu>Datei</guimenu> <guimenuitem>Exportieren</guimenuitem> <guimenuitem>Als Webseite exportieren ...</guimenuitem>

source: You can export your calendar or a part of it as a &HTML; file, suitable for publishing on the World Wide Web.
de: Sie können den Kalender oder Teile von ihm als &HTML; Datei exportieren, um sie dann z.B. im Internet zu veröffentlichen.

source: For more information about this action, please refer to <xref linkend="managing-export"/>.
de: Weitere Informationen hierzu finden Sie unter <xref linkend="managing-export"/>.

source: <guimenu>File</guimenu> <guisubmenu>Export</guisubmenu> <guimenuitem>Export as iCalendar</guimenuitem>
de: <guimenu>Datei</guimenu> <guisubmenu>Exportieren</guisubmenu> <guimenuitem>Als iCalendar exportieren ...</guimenuitem>

source: This action will export all your active events, to-dos and journal entries (independent of to which resource they belong) as a new iCalendar file.
de: Dieser Menüpunkt exportiert unabhängig von der Ressource, zu der sie gehören, alle Ihre aktiven Termin, Aufgaben und Journaleinträge in eine neue iCalender-Datei.

source: <guimenu>File</guimenu> <guisubmenu>Export</guisubmenu> <guimenuitem>Export as vCalendar</guimenuitem>
de: <guimenu>Datei</guimenu> <guisubmenu>Exportieren</guisubmenu> <guimenuitem>Als vCalendar exportieren ...</guimenuitem>

source: This action will export all your active events, to-dos and journal entries (independent of to which resource they belong) as a new vCalendar file.
de: Dieser Menüpunkt exportiert unabhängig von der Ressource, zu der sie gehören, alle Ihre aktiven Termin, Aufgaben und Journaleinträge in eine neue vCalender-Datei.

source: <guimenu>File</guimenu> <guimenuitem>Archive Old Entries...</guimenuitem>
de: <guimenu>Datei</guimenu> <guimenuitem>Alte Einträge archivieren ...</guimenuitem>

source: From time to time you should delete your old events.
de: Von Zeit zu Zeit sollten Sie Ihre alten Termine löschen.

source: For more information about this action, please refer to <xref linkend="managing-purge-archive"/>.
de: Weitere Informationen hierzu finden Sie unter <xref linkend="managing-purge-archive"/>.

source: <guimenu>File</guimenu> <guimenuitem>Purge Completed To-dos</guimenuitem>
de: <guimenu>Datei</guimenu> <guimenuitem>Erledigte Aufgaben entfernen</guimenuitem>

source: This action will remove all the completed to-dos from your active calendar.
de: Dieser Menüpunkt löschte alle erledigten Aufgaben aus Ihrem aktiven Kalender.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Quit</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo> </shortcut> <guimenu>Datei</guimenu> <guimenuitem>Beenden</guimenuitem>

source: When you choose <guimenuitem>Quit</guimenuitem> or click the <guiicon>Quit</guiicon> icon, <action>the current calendar window will quit, prompting you to save if the current calendar has been modified but not yet saved.</action>
de: Wenn Sie <guimenuitem>Beenden</guimenuitem> auswählen oder auf das Symbol <guiicon>Beenden</guiicon> klicken, <action>wird das &korganizer;-Fenster geschlossen, Sie bekommen jedoch vorher die Möglichkeit, Ihren Kalender zu speichern wenn Sie dort Änderungen durchgeführt haben.</action>

source: This has no effect on other calendar windows which may be opened. You have to quit each calendar window individually.
de: Diese Funktion schließt immer nur ein &korganizer;-Fenster. Wenn mehrere Fenster geöffnet sind, müssen Sie jedes einzeln schließen.

source: Edit
de: Bearbeiten

source: With the <guilabel>Edit</guilabel> menu you can edit and search events and to-dos.
de: Mit dem Menü <guilabel>Bearbeiten</guilabel> können Sie Termine und Aufgaben suchen und bearbeiten.

source: <guimenuitem>Cut</guimenuitem>, <guimenuitem>Copy</guimenuitem>, and <guimenuitem>Paste</guimenuitem> menu items behave in the same fashion as in other &kde; applications. With the <guimenuitem>Find</guimenuitem> menu item you can find events and to-dos across the current calendar.
de: <guimenuitem>Ausschneiden</guimenuitem>, <guimenuitem>Kopieren</guimenuitem> und <guimenuitem>Einfügen</guimenuitem> funktionieren genau so wie bei allen anderen &kde; Programmen. Mit dem Menüeintrag <guimenuitem>Suchen ...</guimenuitem> können Sie Termine und Aufgaben in Ihrem gesamten Kalender suchen.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Z</keycap></keycombo> </shortcut> <guimenu> Edit</guimenu> <guimenuitem>Undo</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Z</keycap></keycombo> </shortcut> <guimenu>Bearbeiten</guimenu> <guimenuitem>Rückgängig</guimenuitem>

source: <action>Undo the latest action</action>, or in other words, return the calendar to the state it was immediately before the latest action.
de: <action>Macht die letzte Aktion rückgängig</action> oder anders formuliert setzt den Kalender auf den Status kurz vor der letzten Aktion zurück.

source: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>Z</keycap></keycombo> </shortcut> <guimenu> Edit</guimenu> <guimenuitem>Redo</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>Z</keycap></keycombo> </shortcut> <guimenu>Bearbeiten</guimenu> <guimenuitem>Wiederherstellen</guimenuitem>

source: <action>Redo the latest action</action>, or in other words, return the calendar to the state it was immediately before the latest undo.
de: <action>Stellt die letzte Aktion wieder her</action>oder anders formuliert setzt den Kalender auf den Status kurz vor dem letzten <quote>Rückgängig machen</quote> zurück.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>X</keycap></keycombo> </shortcut> <guimenu> Edit</guimenu> <guimenuitem>Cut</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>X</keycap></keycombo> </shortcut> <guimenu> Bearbeiten</guimenu> <guimenuitem>Ausschneiden</guimenuitem>

source: Cuts the currently selected event(s) to the clipboard, removing them from your calendar.
de: Entfernt die ausgewählten Termine aus dem Kalender und kopiert sie in die Zwischenablage.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>C</keycap></keycombo> </shortcut> <guimenu> Edit</guimenu> <guimenuitem>Copy</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>C</keycap></keycombo> </shortcut> <guimenu>Bearbeiten</guimenu> <guimenuitem>Kopieren</guimenuitem>

source: Copies the currently selected item(s) to the clipboard, but leaving them untouched.
de: Kopiert die ausgewählten Einträge in die Zwischenablage ohne sie zu verändern.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>V</keycap></keycombo> </shortcut> <guimenu> Edit</guimenu> <guimenuitem>Paste</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>V</keycap></keycombo> </shortcut> <guimenu>Bearbeiten</guimenu> <guimenuitem>Einfügen</guimenuitem>

source: <guimenuitem>Paste</guimenuitem> <action>inserts the contents of the clipboard into your calendar</action>. The clipboard must contain a valid vCalendar or iCalendar item, provided either by a previous Cut/Copy operation or from a selection made outside of &korganizer;. You will be warned if the contents of the clipboard cannot be understood.
de: <guimenuitem>Einfügen</guimenuitem> <action>kopiert den Inhalt der Zwischenablage in Ihren Kalender</action>. Die Zwischenablage muss dazu einen gültigen Eintrag für iCalender oder vCalendar enthalten, entweder durch eine Ausschneiden/Kopieren-Operation oder durch ein externes Programm. Sie werden gewarnt, wenn der Inhalt der Zwischenablage nicht interpretiert werden kann.

source: However, you can safely use <keycombo action="simul">&Ctrl; <keycap>C</keycap></keycombo> and <keycombo action="simul">&Ctrl; <keycap>V</keycap></keycombo> hotkeys to copy text data from any outside application to a &korganizer; Edit Event window and vice versa.
de: Sie können übrigens ohne Probleme <keycombo action="simul">&Ctrl; <keycap>C</keycap></keycombo> und <keycombo action="simul"> &Ctrl; <keycap>V</keycap></keycombo> benutzen, um einen beliebigen Text mit externen Programmen im Fenster „Eintrag bearbeiten“ auszutauschen.

source: <guimenu> Edit</guimenu> <guimenuitem>Delete</guimenuitem>
de: <guimenu>Bearbeiten</guimenu> <guimenuitem>Löschen</guimenuitem>

source: Delete the currently selected item(s), removing them from your calendar.
de: Entfernt die ausgewählten Einträge aus dem Kalender.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>F</keycap></keycombo> </shortcut> <guimenu> Edit</guimenu> <guimenuitem>Find</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>F</keycap></keycombo> </shortcut> <guimenu>Bearbeiten</guimenu> <guimenuitem>Suchen ...</guimenuitem>

source: Choose <guimenuitem>Find</guimenuitem> from the <guimenu>Edit</guimenu> or click the <guiicon>Find</guiicon> icon to <action>find events, to-dos and journal entries according to their title, description, and/or categories</action>.
de: Wählen Sie <guimenuitem>Suchen</guimenuitem> aus dem Menü <guimenu>Bearbeiten</guimenu> oder klicken Sie auf das Symbol <guiicon>Suchen</guiicon>, <action>um Termine, aufgaben und Journaleinträge anhand Ihrer Zusammenfassung, Beschreibung und/oder Kategorien zu suchen</action>.

source: For more information about this action, please refer to <xref linkend="search-view"/>.
de: Weitere Informationen hierzu finden Sie unter <xref linkend="search-view"/>.

source: View
de: Ansicht

source: There are several different <quote>views</quote> available for displaying your events, to-dos and journal entries. &korganizer; is smart enough to remember in between sessions what the last active view was, and the next time it is started, it will display that view.
de: Es gibt verschiedene <quote>Ansichten</quote>, um Ihre Termine und Aufgaben darzustellen. &korganizer; merkt sich beim Beenden automatisch, welche Ansicht zuletzt gewählt war und verwendet diese beim nächsten Start wieder.

source: In general, each view will provide a way of displaying your journal entries, to-dos and events, constrained to a particular time period or style of display. Click any item to select it for further action. <mousebutton>Right</mousebutton> click an item to bring up a menu with options such as <guimenuitem>Edit</guimenuitem>, <guimenuitem>Delete</guimenuitem>, and so on. You can also use the <guimenu>Action</guimenu> menu to perform similar operations.
de: Jede Ansicht stellt Journaleinträge, Aufgaben und Termine dar; je nach ausgewählter Ansicht für einen speziellen Zeitbereich oder in einem speziellen Stil. Klicken Sie einen Eintrag an, um mit ihm zu arbeiten. <mousebutton>Rechtsklicken</mousebutton> Sie auf einen Eintrag, um sein Kontextmenü aufzurufen, das ihnen Optionen wie <guimenuitem>Bearbeiten</guimenuitem>, <guimenuitem>Löschen</guimenuitem> &etc; bietet. Sie können für diese Aktionen auch das Menü <guimenu>Aktionen</guimenu> benutzen.

source: <guimenu>View</guimenu> <guimenuitem>Agenda</guimenuitem>
de: <guimenu>Ansicht</guimenu> <guimenuitem>Tagesansicht</guimenuitem>

source: Switch the display to the Agenda view.
de: Zeigt den Kalender in der Terminplanansicht an.

source: For more information about this action, please refer to <xref linkend="agenda-view"/>.
de: Weitere Informationen hierzu finden Sie unter <xref linkend="agenda-view"/>.

source: <guimenu>View</guimenu> <guimenuitem>Month View</guimenuitem>
de: <guimenu>Ansicht</guimenu> <guimenuitem>Monat</guimenuitem>

source: Switch the display to the Month view.
de: Stellt den Kalender in der Monatsansicht dar.

source: For more information about this action, please refer to <xref linkend="month-view"/>.
de: Weitere Informationen hierzu finden Sie unter <xref linkend="month-view"/>.

source: <guimenu>View</guimenu> <guimenuitem>Timeline</guimenuitem>
de: <guimenu>Ansicht</guimenu> <guimenuitem>Zeitleiste</guimenuitem>

source: Switch the display to the Timeline view.
de: Stellt den Kalender in der Zeitleistenansicht dar.

source: For more information about this action, please refer to <xref linkend="timeline-view"/>.
de: Weitere Informationen hierzu finden Sie unter <xref linkend="timeline-view"/>.

source: <guimenu>View</guimenu> <guimenuitem>To-do List</guimenuitem>
de: <guimenu>Ansicht</guimenu> <guimenuitem>Aufgabenliste</guimenuitem>

source: Switch the display to the To-do List view.
de: Zeigt Aufgaben in Listenform an.

source: For more information about this action, please refer to <xref linkend="todo-view"/>.
de: Weitere Informationen finden Sie unter<xref linkend="todo-view"/>.

source: <guimenu> View</guimenu><guimenuitem>Event List</guimenuitem>
de: <guimenu>Ansicht</guimenu> <guimenuitem>Terminliste</guimenuitem>

source: Switch the display to the list view.
de: Zeigt Termine in Listenform an.

source: For more information about this action, please refer to <xref linkend="list-view"/>.
de: Weitere Informationen hierzu finden Sie unter <xref linkend="list-view"/>.

source: <guimenu> View</guimenu><guimenuitem>What's Next</guimenuitem>
de: <guimenu>Ansicht</guimenu> <guimenuitem>Was kommt als Nächstes</guimenuitem>

source: Switch the display to the what's next view.
de: Schaltet die Anzeige auf die "Was kommt als Nächstes" Ansicht um.

source: This view displays your next events and to-dos. Events and to-dos are displayed one per line.
de: Zeigt Ihre nächsten Termine und Aufgaben an. Sie werden immer mit einem Eintrag pro Zeile angezeigt.

source: For more information about this action, please refer to <xref linkend="whatsnext-view"/>.
de: Weitere Informationen hierzu finden Sie unter <xref linkend="whatsnext-view"/>.

source: <guimenu>View</guimenu> <guimenuitem>Journal</guimenuitem>
de: <guimenu>Ansicht</guimenu> <guimenuitem>Journal</guimenuitem>

source: Switch the display to the Journal view.
de: Zeigt die Journalansicht an.

source: For more information about this action, please refer to <xref linkend="journal-view"/>.
de: Weitere Information finden Sie unter <xref linkend="journal-view"/>.

source: <guimenu>View</guimenu> <guimenuitem>Refresh</guimenuitem>
de: <guimenu>Ansicht</guimenu> <guimenuitem>Aktualisieren</guimenuitem>

source: Updates or refreshes the currently displayed view.
de: Erneuert die Bildschirmdarstellung in der ausgewählten Ansicht.

source: <guimenu>View</guimenu><guisubmenu>Zoom</guisubmenu>
de: <guimenu>Ansicht</guimenu><guisubmenu>Zoom</guisubmenu>

source: Use this submenu to adjust the current view to show more or less data.
de: Benutzen Sie diesen Menüeintrag um die aktuelle Ansicht so zu einzustellen, dass Sie mehr oder weniger Daten sehen.

source: In the Agenda view (Day(s) or Week view), you can use the zoom actions to show more or less days (<menuchoice><guisubmenu>Zoom</guisubmenu> <guimenuitem>In Horizontally</guimenuitem></menuchoice> and <menuchoice> <guisubmenu>Zoom</guisubmenu><guimenuitem>Out Horizontally</guimenuitem></menuchoice>), or more or less hours in the day (<menuchoice><guisubmenu>Zoom</guisubmenu> <guimenuitem>In Vertically</guimenuitem></menuchoice> and <menuchoice><guisubmenu>Zoom</guisubmenu><guimenuitem>Out Vertically</guimenuitem> </menuchoice>).
de: In den Terminplanansichten (Tages- oder Wochenansicht), können Sie diese Funktion benutzen, um mehr oder weniger Tage anzuzeigen. Mit <guimenuitem>Waagerecht vergrößern</guimenuitem> bzw. <guimenuitem>Waagerecht verkleinern</guimenuitem> bekommen Sie mehr oder weniger Tage angezeigt und mit <guimenuitem>Senkrecht vergrößern</guimenuitem> bzw. <guimenuitem>Senkrecht verkleinern</guimenuitem> mehr oder weniger Stunden.

source: <guimenu>View</guimenu> <guisubmenu>Filter</guisubmenu>
de: <guimenu>Ansicht</guimenu> <guisubmenu>Filter</guisubmenu>

source: This submenu offers access to the filters already created using the <link linkend="menu-settings-edit-filters"><guilabel>Edit Calendar Filters</guilabel></link> dialog. <action>Select on this submenu the filter that will be used in &korganizer; view</action>. If you do not want to use a filter, choose <guilabel>No filter</guilabel>.
de: Dieses Untermenü erlaubt den Zugriff auf schon im Dialog <link linkend="menu-settings-edit-filters"><guilabel>Kalenderfilter bearbeiten</guilabel></link> erstellte Filter. <action>Wählen Sie in diesem Untermenü den Filter, der für die Ansicht von &korganizer; benutzt werden soll.</action>. Falls Sie keinen Filter benutzen möchten, können Sie <guilabel>Kein Filter</guilabel> auswählen.

source: <title>Go</title>
de: <title>Gehe zu</title>

source: For more information about browsing &korganizer; views, please refer to <xref linkend="description-view"/>.
de: Weitere Informationen über das Benutzen von &korganizer;-Ansichten finden Sie unter <xref linkend="description-view"/>.

source: <guimenu> Go</guimenu><guimenuitem>Backward</guimenuitem>
de: <guimenu>Gehe zu</guimenu> <guimenuitem>Zurück</guimenuitem>

source: Go to the previous day, week or month, depending on the view.
de: Geht je nach Ansicht zum vorherigen Tag, Woche, Monat oder Jahr.

source: <guimenu> Go</guimenu><guimenuitem>Forward</guimenuitem>
de: <guimenu>Gehe zu</guimenu> <guimenuitem>Vorwärts</guimenuitem>

source: Go to the next day, week, or month, depending on the view.
de: Geht je nach Ansicht zum nächsten Tag, Woche, Monat oder Jahr.

source: <guimenu> Go</guimenu><guimenuitem>To Today</guimenuitem>
de: <guimenu>Gehe zu</guimenu> <guimenuitem>Gehe zu Heute</guimenuitem>

source: Go to the period of time that includes the current day.
de: Geht zu der Ansicht die den aktuellen Tag enthält.

source: <guimenu> Go</guimenu><guimenuitem>Day</guimenuitem>
de: <guimenu>Gehe zu</guimenu> <guimenuitem>Tag</guimenuitem>

source: Switch the display to the Day view.
de: Stellt den Kalender in der Tagesansicht an.

source: <guimenu> Go</guimenu><guimenuitem>Next x Days</guimenuitem>
de: <guimenu>Gehe zu</guimenu> <guimenuitem>Nächsten x Tage</guimenuitem>

source: Switch the display to the Next x Day view, where x is defined in &korganizer; main configuration.
de: Stellt den Kalender in der Ansicht für die nächsten x Tage dar, wobei x im Einrichtungsdialog von &korganizer; definiert wird.

source: <guimenu>Go</guimenu><guimenuitem>Work Week</guimenuitem>
de: <guimenu>Gehe zu</guimenu> <guimenuitem>Arbeitswoche</guimenuitem>

source: Switch the display to the Work Week view.
de: Stellt den Kalender in der Arbeitswochenansicht dar.

source: This is the same as the Week view, except only the working days of the week are shown.
de: Diese Ansicht ähnelt der Wochenansicht, allerdings werden nur die Arbeitstage der Woche angezeigt.

source: <guimenu> Go</guimenu> <guimenuitem>Week</guimenuitem>
de: <guimenu>Gehe zu</guimenu> <guimenuitem>Woche</guimenuitem>

source: Switch the display to the Week view.
de: Stellt den Kalender in der Wochenansicht dar.

source: The Week view provides a view similar to the Day view. Events for seven days are shown next to each other. All of the functions available for the Day view are available in the Week view, too.
de: Die Wochenansicht ähnelt der Tagesansicht. Termine für insgesamt sieben Tage werden nebeneinander dargestellt. Alle Funktionen der Tagesansicht stehen auch hier zur Verfügung.

source: Actions
de: Aktionen

source: <guimenu>Actions</guimenu> <guimenuitem>New Event...</guimenuitem>
de: <guimenu>Aktionen</guimenu> <guimenuitem>Neuer Termin ...</guimenuitem>

source: Choose <guilabel>New Event...</guilabel> to <action>create a new event</action>.
de: Wählen Sie <guilabel>Neuer Termin</guilabel> um <action>einen neuen Termin zu erstellen</action>.

source: You can get a detailed description of the event window in <link linkend="entering-data-events">the Entering Events</link> section.
de: Detaillierte Informationen zum Erstellen von Terminen finden Sie im Abschnitt <link linkend="entering-data-events">Eingabe von Terminen</link>.

source: <guimenu>Actions</guimenu> <guimenuitem>New To-do...</guimenuitem>
de: <guimenu>Aktionen</guimenu> <guimenuitem>Neue Aufgabe</guimenuitem>

source: Choose <guilabel>New To-do...</guilabel> to <action>create a new to-do</action>. Initially the to-do has no due date, but you can specify one.
de: Wählen Sie <guilabel>Neue Aufgabe...</guilabel>, um <action>eine neue Aufgabe zu erstellen</action>. Standardmäßig hat die Aufgabe keinen Fälligkeitstermin, Sie können jedoch einen angeben.

source: You can get a detailed description of the to-do window in <link linkend="entering-data-to-do">the Entering To-dos</link> section.
de: Detaillierte Informationen zum Erstellen von Aufgaben finden Sie im Abschnitt <link linkend="entering-data-to-do">Eingabe von Aufgaben</link>.

source: <guimenu>Actions</guimenu> <guimenuitem>New Sub-to-do...</guimenuitem>
de: <guimenu>Aktionen</guimenu> <guimenuitem>Neue Unteraufgabe</guimenuitem>

source: Choose <guilabel>New Sub-to-do...</guilabel> to <action>start writing a new sub-to-do. The currently selected to-do will be the sub-to-do parent</action>. Initially the to-do has no due date, but you can specify one.
de: Wählen Sie <guilabel>Neue Unteraufgabe...</guilabel>, um <action>eine neue Unteraufgabe zu erstellen. Die aktuelle Aufgabe wird Vaterobjekt für die Unteraufgabe</action>. Standardmäßig hat die Aufgabe keinen Fälligkeitstermin, Sie können jedoch einen angeben.

source: You can get a detailed description of the to-do window in <link linkend="entering-data-to-do">Entering To-dos</link> section.
de: Detaillierte Informationen zu Aufgaben finden Sie im Abschnitt <link linkend="entering-data-to-do">Eingabe von Aufgaben</link>.

source: <guimenu>Actions</guimenu> <guimenuitem>New Journal...</guimenuitem>
de: <guimenu>Aktionen</guimenu> <guimenuitem>Neues Journal...</guimenuitem>

source: Choose <guilabel>New Journal...</guilabel> to <action>start writing a new journal entry</action>.
de: Wählen Sie <guilabel>Neues Journal</guilabel> um<action>einen neuen Journaleintrag zu schreiben</action>.

source: <guimenu>Actions</guimenu> <guimenuitem>Show</guimenuitem>
de: <guimenu>Aktionen</guimenu> <guimenuitem>Anzeigen</guimenuitem>

source: Choose <guilabel>Show</guilabel> to <action>open a dialog showing the details of the currently selected journal entry, event or to-do.</action>
de: Mit <guilabel>Anzeigen</guilabel> können Sie <action>das ausgewählte Ereignis, die ausgewählte Aufgabe oder das ausgewählte Journal anzeigen</action> lassen.

source: <guimenu>Actions</guimenu> <guimenuitem>Edit...</guimenuitem>
de: <guimenu>Aktionen</guimenu> <guimenuitem>Bearbeiten ...</guimenuitem>

source: Choose <guilabel>Edit...</guilabel> to <action>edit the currently selected journal entry, event or to-do.</action>
de: Mit <guilabel>Bearbeiten...</guilabel> können Sie <action>den ausgewählte Termin, die ausgewählte Aufgabe oder das Journal bearbeiten</action>.
