Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdepim/korganizer.po
Languages: de

source: Besides calendar storage, groupware servers typically offer contacts, mail and <link linkend="glossary" endterm="gloss-freebusy">free/busy information</link> storage. Therefore, some of the resources discussed here may be related to other resources from &kmail; and &kaddressbook; (the mail and contacts components of &kontact;), or to the <link linkend="config-main-free-busy">free/busy settings in the main configuration</link>.
de: Neben der Speicherung der Kalender stellen Groupware-Server typischerweise Kontakte, E-Mail und <link linkend="glossary" endterm="gloss-freebusy">Frei/Belegt-Informationen</link> zur Verfügung. Daher können einige hier erwähnte Ressourcen mit anderen Ressourcen aus &kmail;, &kaddressbook; und den <link linkend="config-main-free-busy">Frei/Belegt-Einstellungen in der Hauptkonfiguration</link> zusammenhängen. &kmail; und &kaddressbook; sind die E-Mail und Kontakt-Komponenten von &kontact;.

source: Please note that &korganizer; <link linkend="group-scheduling">group scheduling</link> communication is based on a peer to peer email standard. This means that you do not need a groupware server to use it!
de: Bitte beachten Sie, dass die &korganizer; Kommunikation für <link linkend="group-scheduling">Gruppentermine</link> auf einem <quote>peer to peer</quote> Standard mittels E-Mails basiert. Die bedeutet, dass Sie keinen Groupware-Server benötigen, um diese Funktionalität zu benutzen.

source: <screeninfo>A screenshot of &korganizer;'s Add Calendars dialog</screeninfo>
de: <screeninfo>Ein Bildschirmfoto vom Dialog <quote>Kalender hinzufügen</quote></screeninfo>

source: <phrase>A screenshot of &korganizer;'s Add Calendars dialog</phrase>
de: <phrase>Ein Bildschirmfoto vom Dialog <quote>Kalender hinzufügen</quote></phrase>

source: <para>A screenshot of &korganizer;'s Add Calendars dialog</para>
de: <para>Ein Bildschirmfoto vom Dialog <quote>Kalender hinzufügen</quote>.</para>

source: Adding a New &korganizer; Resource
de: Hinzufügen einer neuen &korganizer;-Ressource

source: Open &korganizer;'s settings dialog with <menuchoice><guimenu>Settings</guimenu> <guimenuitem>Configure &korganizer;...</guimenuitem></menuchoice> and select the <guilabel>Calendars</guilabel> tab from the <guilabel>General</guilabel> page.
de: Öffnen Sie den Einrichtungsdialog von &korganizer; mit <menuchoice><guimenu>Einstellungen</guimenu> <guimenuitem>&korganizer; einrichten...</guimenuitem></menuchoice> und wählen Sie die Karteikarte <guilabel>Kalender</guilabel> auf der Seite <guilabel>Allgemein</guilabel>.

source: Alternatively open the context menu in the <guilabel>Calendar Manager</guilabel> sidebar with a &RMB; click and select <guilabel>Add Calendar...</guilabel>
de: Alternativ öffnen Sie das Kontextmenü der <guilabel>Kalenderverwaltung</guilabel> in der Seitenleiste durch Klicken mit der &RMBn; und wählen Sie dann <guilabel>Kalender hinzufügen ...</guilabel>

source: If the <guilabel>Calendar Manager</guilabel> is not displayed on the sidebar, choose the <menuchoice><guimenu>Settings</guimenu><guisubmenu>Sidebar</guisubmenu> <guimenuitem>Show Calendar Manager</guimenuitem></menuchoice> menu item to display it.
de: Wenn die <guilabel>Kalenderverwaltung</guilabel> in der Seitenleiste nicht angezeigt wird, können Sie die Ansicht mit <menuchoice><guimenu>Einstellungen</guimenu><guisubmenu>Seitenleiste</guisubmenu> <guimenuitem>Kalenderverwaltung anzeigen</guimenuitem></menuchoice> aktivieren.

source: Press the <guibutton>Add...</guibutton> button to add new resources to the list of available resources.
de: Mit dem Knopf <guibutton>Hinzufügen...</guibutton> können Sie der Liste der verfügbaren Ressourcen neue Ressourcen hinzufügen.

source: Check or uncheck the resource box to enable or disable it.
de: Wählen Sie diesen Eintrag an und ab, um ihn ein- und auszuschalten.

source: Later, if you want to edit or delete a resource, select it on the <guilabel>Calendar Manager</guilabel> sidebar and press <guibutton>Delete Calendar</guibutton> to delete it or <guibutton>Calendar Properties...</guibutton> to modify it.
de: Wenn Sie später eine Ressource bearbeiten oder löschen möchten, wählen Sie diese aus der <guilabel>Kalenderverwaltung</guilabel> in der Seitenleiste und können <guilabel>Kalender löschen</guilabel> zum Entfernen oder <guilabel>Kalender-Eigenschaften.</guilabel> zum Ändern benutzen.

source: Among the existing resources, you can find in &korganizer;:
de: Unter den vorhandenen Ressourcen finden Sie in &korganizer;:

source: Birthdays &amp; Anniversaries
de: Geburtstage und Jahrestage

source: Provides access to birthday and anniversary dates of contacts in your address book as calendar events.
de: Ermöglicht den Zugriff auf Geburtstage und Jahrestage von Kontakten aus dem KDE-Adressbuch in Form von Kalendereinträgen..

source: DAV groupware resource
de: DAV-Groupware-Ressource

source: Resource to manage DAV calendars and address books (CalDAV, GroupDAV).
de: Ressource zur Verwaltung von DAV-Kalendern und -Adressbüchern (CalDAV, GroupDAV).

source: ICal Calendar File
de: ICal-Kalenderdatei

source: Loads data from an iCal file.
de: Daten werden aus einer lokalen iCal-Datei geladen.

source: KDE Address Book (traditional)
de: KDE-Adressbuch (herkömmlich)

source: Loads data from a traditional KDE address book resource.
de: Lädt Daten aus einer herkömmlichen KDE-Adressbuch-Ressource.

source: Provides access to Kolab groupware folders on an IMAP server (IMAP accounts need to be set up separately).
de: Ermöglicht den Zugriff auf Kolab Groupware-Ordner auf einem IMAP-Server (IMAP-Zugänge müssen separat erstellt werden).

source: Provides access to the appointments, tasks, and contacts of an Open-Xchange groupware server.
de: Ermöglicht den Zugriff auf Termine, Aufgaben und Kontakte, die auf einem Open-Xchange-Server gespeichert sind.

source: Alternatively, you can configure the &korganizer; resources (plus all other &kde; resources), in the &systemsettings;, using the <guilabel>&kde; Resources</guilabel> configuration module.
de: Alternativ können Sie die &korganizer;-Ressourcen und alle anderen &kde; Ressourcen in den &systemsettings;, unter <guilabel>&kde;-Ressourcen</guilabel> einrichten.

source: Provides access to calendars stored in Akonadi calendar folders.
de: Ermöglicht den Zugriff auf Kalender, die in Akonadi-Ordnern gespeichert sind.

source: Journal in a blog
de: Journal in einem Blog

source: Add this resource to be able to read your blogs as journal entries, directly from blog servers, such as blogger and drupal.
de: Fügen Sie diese Ressource hinzu, wenn Sie Ihre Blogs als Journaleinträge direkt von einem Blog-Server wie blogger und drupal lesen wollen.

source: Bugzilla To-do List
de: Bugzilla-Aufgabenliste

source: Add this resource to load bugzilla open bugs as to-dos. This resource is based on the &kbugbuster; application, and uses its bug cache information. Bugzilla is an open source bug tracking system.
de: Fügen Sie diese Ressource hinzu, um die offenen Bugs aus Bugzilla als Aufgaben zu laden. Diese Ressource basiert auf dem Programm &kbugbuster; und benutzt dessen Bug-Cache Informationen. Bugzilla ist ein Open Source Fehlerverfolgungssystem.

source: If you are a developer working on a project that uses bugzilla, you can use this resource to view as to-dos the open bugs of the applications or libraries you are interested in (they are called <quote>products</quote> and/or <quote>components</quote> in bugzilla). This resource is available as part of the &kde; Software Development kit.
de: Arbeiten Sie als Entwickler an einem Projekt mit, das Bugzilla verwendet, können Sie diese Ressource benutzen, um die offenen Fehler der Programme oder Bibliotheken als Aufgaben anzuzeigen. Programme oder Bibliotheken werden in Bugzilla <quote>products</quote> und/oder <quote>components</quote> genannt. Diese Ressource gehört zur &kde;-Software-Entwicklung.

source: Calendar in Local File
de: Kalender in lokaler Datei

source: Add this resource to be able to save (and load) your events, to-dos and journal entries to a local file. The file can be in the iCalendar or in the vCalendar standard format. &korganizer; uses this resource by default, storing your calendar information under <filename>$KDEHOME/share/apps/korganizer/std.ics</filename>.
de: Fügen Sie diese Ressource hinzu, um Ihre Termine, Aufgaben und Journaleinträge in eine lokale Datei zu speichern und zu laden. Diese Datei kann in den Standardformaten iCalendar oder vCalendar geschrieben werden. &korganizer; benutzt standardmäßig diese Ressource, um Ihren Kalender unter <filename>$KDEHOME/share/apps/korganizer/std.ics</filename> zu speichern.

source: GroupDav Server (e.g. Open Groupware)
de: GroupDAV-Server (z. B. Open Groupware)

source: If you have access to a server that supports the <ulink url="http://www.groupdav.org">GroupDav protocol</ulink>, add this resource in order to be able to save (and load) events and to-dos to the server. To add the resource, you will need to know the server &URL;, your user name and your password. The GroupDav protocol supports the storage of contacts, so you may want to add and configure the &kaddressbook; resource too.
de: Wenn Sie Zugriff auf einen Server haben, der das <ulink url="http://www.groupdav.org">GroupDav-Protokoll</ulink> unterstützt, können Sie diese Ressource hinzufügen, damit Sie Ihre Termine und Aufgaben von diesem Server laden und dort ablegen können. Um diese Ressource hinzuzufügen ,benötigen Sie die &URL; des Servers, Ihren Benutzernamen und das Passwort. Das GroupDav-Protokoll unterstützt das Speichern von Kontakten und Sie können daher auch in &kaddressbook; diese Ressource entsprechend hinzufügen und einrichten.

source: As of June 2005, the groupware servers that implement this protocol are the <ulink url="http://www.opengroupware.org">OpenGroupware server</ulink> and the <ulink url="http://www.citadel.org">Citadel server</ulink>. An up to date list can be obtained at the <ulink url="http://www.groupdav.org">GroupDav website</ulink>.
de: Seit Juni 2005 unterstützen die Groupware-Server <ulink url="http://www.opengroupware.org">OpenGroupware</ulink> und <ulink url="http://www.citadel.org">Citadel</ulink> dieses Protokoll. Eine aktuelle Liste in englisch finden Sie auf der <ulink url="http://www.groupdav.org">GroupDav Webseite</ulink>.

source: Calendar on IMAP Server via &kmail;
de: Kalender auf einem IMAP-Server via &kmail;

source: If you have access to a server that shares calendar data via IMAP, add this resource in order to be able to save (and load) events, to-dos, free/busy information and journal entries to the IMAP server. To enable IMAP access, you will need to configure &kmail; first, then add the &korganizer; resource. Also, since you are using &kmail; to contact the server, &korganizer; will open &kmail; automatically, and use it to access your data. The <quote>IMAP server via &kmail;</quote> schema supports the storage of contacts, so you may want to add the &kaddressbook; resource too.
de: Haben Sie Zugriff auf einen Server, der Kalenderdaten mittels IMAP zur Verfügung stellt, können Sie diese Ressource hinzufügen, um Ihre Termine, Aufgaben, Frei/Belegt-Informationen und Journaleinträge auf dem IMAP-Server zu speichern bzw. abzuholen. Um den IMAP-Zugriff einzurichten, müssen Sie zuerst &kmail; einrichten und danach die &korganizer;-Ressource hinzufügen. Da Sie &kmail; für die Verbindung mit dem Server verwenden, benutzt &korganizer; es automatisch, um auf Ihre Daten zuzugreifen. Das Schema <quote>Kalender aus einem IMAP Server via &kmail;</quote> unterstützt das Speichern von Kontakten. Sie wollen vielleicht daher diese Ressource in &kaddressbook; ebenfalls hinzufügen.

source: Most IMAP servers can be used to hold calendar and address book resources, allowing you to access your data from just anywhere! If you are a user looking for a simple way to access and manage your groupware information, this is a simple and very efficient solution.
de: Die meisten IMAP-Server können dazu benutzt werden Kalender und Adressbücher zu speichern, damit Sie Ihre Daten von überall erreichen können. Falls Sie nach einer einfachen Methode suchen, Ihre Groupware-Informationen zu verwalten, ist dies eine einfache und effiziente Lösung.

source: To use this resource, it is necessary to configure &kmail; first. Choose the <menuchoice><guimenu>Settings</guimenu> <guimenuitem>Configure &kmail;...</guimenuitem></menuchoice> menu item. Click the <guilabel>Accounts</guilabel> icon in the configure dialog sidebar and add the IMAP server as a disconnected IMAP incoming account. Now click the <guilabel>Misc</guilabel> icon in the sidebar and click the <guilabel>Groupware</guilabel> tab to enable and configure the IMAP resource folder options. Only then you can add the &korganizer; (and &kaddressbook;) resources. For more information on configuring &kmail;, consult the &kmail; handbook.
de: Um diese Ressource zu benutzen, müssen Sie zuerst &kmail; einrichten. Wählen Sie dazu <menuchoice><guimenu>Einstellungen</guimenu> <guimenuitem>&kmail; einrichten ...</guimenuitem></menuchoice> aus dem Menü. Wählen Sie das Symbol <guilabel>Zugänge</guilabel> in der Seitenleiste und fügen Sie dort den IMAP-Server als <quote>Disconnected IMAP</quote> hinzu. Unter <guilabel>Diverses</guilabel> in der Seitenleiste finden Sie eine Karteikarte <guilabel>Arbeitsgruppen</guilabel>, um den IMAP-Ressource-Ordner zu aktivieren und einzurichten. Erst danach können Sie die Ressource in &korganizer; und &kaddressbook; hinzufügen. Weitere Informationen über die Einrichtung von &kmail; finden Sie im Handbuch von &kmail;.

source: A more complete implementation of this schema is the <ulink url="http://www.kolab.org">Kolab Server</ulink>. This groupware implementation offers additional features for system administrators, such as support of mixed client environments (&Microsoft; Outlook&reg;, &kde; <acronym>PIM</acronym> and web mail), a web administration interface, shared address book, email server, &etc; As of June 2005, the groupware servers that implement the <quote>Kolab 1</quote> and <quote>Kolab 2</quote> protocols are the Kolab server, version 1 and 2, and the <ulink url="http://www.citadel.org">Citadel server</ulink> (Kolab 1 only). An up to date list can be obtained at the <ulink url="http://www.kolab.org">Kolab website</ulink>.
de: Eine vollständigere Implementierung dieses Schemas ist der <ulink url="http://www.kolab.org">Kolab-Server</ulink>. Dieses Groupware-Anwendung stellt weitere Funktionen für Systemadministratoren zur Verfügung. Zum Beispiel die Unterstützung von Umgebungen mit gemischten Clients (&Microsoft; Outlook&reg;, &kde; <acronym>PIM</acronym> und Web-Mail), eine Web-Schnittstelle zur Administration, ein gemeinsames Adressbuch, E-Mail-Server &etc; Im Juni 2005 unterstützen die folgenden Groupware-Server das <quote>Kolab 1</quote> und <quote>Kolab 2</quote> Protokoll: Kolab Server, Version 1 und 2, und der <ulink url="http://www.citadel.org">Citadel Server</ulink> (nur Kolab 1). Eine aktuelle englische Liste kann auf der <ulink url="http://www.kolab.org">Kolab Webseite</ulink> gefunden werden.

source: The most practical way to configure the access to a Kolab server is to use the <application>kolabwizard</application> wizard application. You can start it from the command line prompt:
de: Der einfachste Weg, den Zugriff auf einen Kolab-Server einzurichten, ist die Verwendung des Assistenten <application>kolabwizard</application>. Sie können diesen Assistenten von der Befehlszeile starten:

source: Calendar in Local Directory
de: Kalender in lokalem Ordner

source: Add this resource to be able to save and load your events, to-dos and journal entries from a local folder. Each calendar item will be saved in a separate file, inside the folder.
de: Fügen Sie diese Ressource hinzu, um Ihre Termine, Aufgaben und Journaleinträge von einem lokalen Ordner zu laden und dort abzulegen. Jeder Kalendereintrag wird in einer anderen Datei in diesem Ordner gespeichert.

source: Since there is only one file per event, to-do, or journal entry, &korganizer; does not need to parse one big calendar file, sometimes with thousands of items when saving or loading, just one single calendar item. Also, in case of file corruption, you will lose only one calendar item, not the whole calendar.
de: Da es nur eine Datei pro Termin, Aufgabe oder Journaleintrag gibt, muss &korganizer; keine große Kalenderdatei durchsuchen, um unter tausenden von Einträgen einen einzigen Kalendereintrag zu ändern. Wenn die Datei zerstört wird, verlieren Sie auch nur diesen Eintrag und nicht den ganzen Kalender.

source: Calendar in Remote File
de: Kalender in Datei auf Fremdrechner

source: Add this resource to be able to save and load your events, to-dos and journal entries from a remote file. There are two main advantages of keeping your calendar data in a remote server: you can access your data even if you are away from your computer, and you can let other people (for instance, a secretary) view it. &korganizer; keeps a cache of the data locally.
de: Fügen Sie diese Ressource hinzu, um Ihre Termine, Aufgaben und Journaleinträge in einer Datei auf einem Fremdrechner zu sichern. Es gibt zwei große Vorteile, wenn Sie Ihre Daten auf einem Server ablegen. Sie können Ihre Daten auch erreichen, wenn Sie nicht an Ihrem Rechner sind und Sie können anderen Personen, z. B. Ihrer Sekretärin, Zugriff auf die Dateien gewähren. &korganizer; hält eine lokale Kopie der Daten.

source: <screeninfo>A screenshot of &korganizer;'s Remote File Resource Configuration</screeninfo>
de: <screeninfo>Ein Bildschirmfoto der Einrichtung von &korganizer;s Ressource für Dateien auf einem entfernten Rechner</screeninfo>

source: <phrase>A screenshot of &korganizer;'s Remote File Resource Configuration</phrase>
de: <phrase>Ein Bildschirmfoto der Einrichtung von &korganizer;s Ressource für Dateien auf einem entfernten Rechner</phrase>

source: <para>A screenshot of &korganizer;'s Remote File Resource Configuration</para>
de: <para>Ein Bildschirmfoto der Einrichtung von &korganizer;s Ressource für Dateien auf einem entfernten Rechner</para>

source: You can configure the resource to be read only, keeping the remote file untouched. In this case, you won't need to supply a <guilabel>Upload to</guilabel> location, just a <guilabel>Download from</guilabel> location for the remote file. If you plan to use a writable remote resource, you will have to supply both locations. The reason to have separate locations, is that some servers may have an upload queue, a place where you need to put the upload file, different from its final location. In most cases, if you have write access to the remote file, the <guilabel>Upload to</guilabel> and <guilabel>Download from</guilabel> file locations should be the same.
de: Sie können diese Ressource als <quote>Nur Lesen</quote> konfigurieren, damit Sie die entfernte Datei nicht ändern. In diesem Fall müssen Sie keine Angaben bei <guilabel>Hochladen nach</guilabel> machen. Nur <guilabel>Herunterladen von</guilabel> muss angegeben werden. Falls Sie eine beschreibbare entfernte Datei benutzen wollen, müssen Sie beide Adressen angeben. Unterschiedliche Adressen sind möglich, da einige Server eine Warteschlange für hochzuladende Dateien haben, in die Sie Ihre Daten einstellen müssen und die sich vom endgültigen Speicherort unterscheidet. In den meisten Fällen, in denen Sie Schreibberechtigung auf eine entfernte Datei haben, werden <guilabel>Hochladen nach</guilabel> und <guilabel>Herunterladen von</guilabel> auf dieselbe Datei zeigen.

source: It is important to understand that the remote file resource does not add or remove individual items from the remote file, it simply saves the remote file over local cache when downloading and save the local cache over the remote file when uploading. Therefore, if the resource is read only, it makes sense to set the <guilabel>Automatic Reload</guilabel> option to a <guilabel>Regular interval</guilabel>, but if not (if the resource is writable), it is recommended to reload the file only before starting to edit it, by setting the <guilabel>Automatic Reload</guilabel> option to <guilabel>On startup</guilabel>, and to save it before exiting, by setting the <guilabel>Automatic Save</guilabel> option at least to <guilabel>On exit</guilabel>, or better yet, if you have a fast and stable connection to the remote file, set it to <guilabel>On every change</guilabel> to avoid data loss.
de: Es ist wichtig, dass Sie sich darüber im Klaren sind, dass in der entfernten Datei keine einzelnen Einträge hinzugefügt oder entfernt werden. Die entfernte Datei überschreibt beim Herunterladen einfach die lokale Kopie und beim Heraufladen überschreibt die lokale Kopie die entfernte Datei. Wenn diese Ressource nur lesbar ist, ist es daher sinnvoll unter <guilabel>Automatisch neu laden</guilabel> die Option <guilabel>Regelmäßige Abstände</guilabel> anzugeben. Falls Sie Schreibberechtigung auf die Datei haben, empfehlen wir Ihnen die Datei einmal vor dem Bearbeiten herunterzuladen. Dies können Sie unter <guilabel>Automatisch neu laden</guilabel> mit der Option <guilabel>Beim Start</guilabel> erreichen. Um Sie beim Beenden zu speichern, sollten Sie unter <guilabel>Automatisches Speichern</guilabel> die Option <guilabel>Beim Beenden</guilabel> auswählen oder, wenn Sie eine schnelle, stabile Verbindung zur entfernten Datei haben, <guilabel>Bei jeder Änderung</guilabel>, um Datenverlust zu vermeiden.

source: If you add, change or remove events, journal entries or to-dos and reload the remote file, all your local changes will be lost, and the file will revert to its previous state. This can happen in different scenarios (for instance if the system crashes, &korganizer; will reload the remote file on the next start, if you set the <guilabel>Automatic Save</guilabel> to <guilabel>Never</guilabel>, or if you set the <guilabel>Automatic Reload</guilabel> to a regular interval). If you plan to use a calendar resource in writable mode, make sure that your connection is stable, configure the resource to save the file on each change (or at frequent intervals), and do not reload the file at regular intervals.
de: Wenn Sie Termine, Journaleinträge oder Aufgaben hinzufügen, ändern oder löschen und die entfernte Datei herunterladen, sind alle Ihre lokalen Änderungen verloren und die Datei enthält die vorherigen Informationen. Dies kann in verschiedenen Situationen passieren, z. B. wenn Ihr System abstürzt. &korganizer; lädt die entfernte Datei beim nächsten Start, wenn Sie <guilabel>Automatisches Speichern</guilabel> auf <guilabel>Nie</guilabel> gesetzt oder <guilabel>Automatisch neu laden</guilabel> auf ein regelmäßiges Intervall gesetzt haben. Falls Sie planen, die Kalender-Ressource schreibbar zu benutzen, sollten Sie sich vergewissern, dass Ihre Verbindung stabil ist, die Ressource so einrichten, dass Sie die Datei bei jeder Änderung oder in kleinen Intervallen, speichert und die Datei nicht in regelmäßigen Intervallen laden.
