Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdepim/korganizer.po
Languages: de

source: You can also browse your calendar view by choosing the <menuchoice><guimenu>Go</guimenu> <guimenuitem>Backward</guimenuitem></menuchoice> menu item (or pressing the <inlinemediaobject><imageobject><imagedata fileref="go-previous.png" format="PNG"/></imageobject></inlinemediaobject>toolbar button), which goes to the previous day, week, month or year, choosing the <menuchoice><guimenu> Go</guimenu><guimenuitem>Forward</guimenuitem></menuchoice> menu item (or pressing the <inlinemediaobject><imageobject> <imagedata fileref="go-next.png" format="PNG"/></imageobject> </inlinemediaobject>toolbar button), which goes to the next day, week, month or year (depending on the view), or choosing the <menuchoice><guimenu>Go</guimenu><guimenuitem>To Today</guimenuitem> </menuchoice> menu item (or pressing the <inlinemediaobject><imageobject> <imagedata fileref="go-jump-today.png" format="PNG"/></imageobject> </inlinemediaobject>toolbar button), which will include the current day in the current view.
de: Sie können auch durch Ihren Kalender blättern, indem Sie im Menü <menuchoice><guimenu>Gehe zu</guimenu><guimenuitem>Zurück</guimenuitem></menuchoice> oder den entsprechenden Knopf <inlinemediaobject><imageobject><imagedata fileref="go-previous.png" format="PNG"/></imageobject></inlinemediaobject> in der Werkzeugleiste drücken. Beides bringt Sie, abhängig von der aktuellen Ansicht, zum vorangegangenen Tag, der vorangegangenen Woche, dem vorangegangenen Monat oder dem vorangegangenen Jahr. Analog kommen Sie mit dem Menüeintrag <menuchoice><guimenu>Gehe zu</guimenu><guimenuitem>Vorwärts</guimenuitem></menuchoice> oder dem Knopf<inlinemediaobject><imageobject> <imagedata fileref="go-next.png" format="PNG"/></imageobject> </inlinemediaobject> in der Werkzeugleiste zum nächsten Tag, der nächsten Woche, dem nächsten Monat oder dem nächste Jahr. Mit <menuchoice><guimenu>Gehe zu</guimenu><guimenuitem>Gehe zu Heute</guimenuitem> </menuchoice> oder dem Knopf <inlinemediaobject><imageobject> <imagedata fileref="go-jump-today.png" format="PNG"/></imageobject> </inlinemediaobject> in der Werkzeugleiste wird die aktuelle Ansicht so dargestellt, dass sie den heutigen Tag anzeigt.

source: What's Next View
de: Die Ansicht <quote>Was kommt als Nächstes</quote>

source: This view displays events and to-dos in a simple format you can quickly read. All open to-dos will be displayed, but only the events from the days selected in the <guilabel>Date Navigator</guilabel> sidebar will be shown. Events and to-dos are displayed one per line.
de: Diese Ansicht zeigt Ihre Termine und Aufgaben in einem einfachen Format, das Sie schnell lesen können. Alle offenen Aufgaben und die Termine des ausgewählten Tages im <guilabel>Datumsnavigator</guilabel> werden angezeigt. Es wird in jeder Zeile ein Termin oder eine Aufgabe angezeigt.

source: Switch to the What's Next view by choosing the <menuchoice><guimenu>View</guimenu> <guimenuitem>What's Next</guimenuitem></menuchoice> menu item.
de: Die Ansicht <quote>Was kommt als Nächstes</quote> können Sie über das Menü unter <menuchoice><guimenu>Ansicht</guimenu> <guimenuitem>Was kommt als Nächstes</guimenuitem></menuchoice> auswählen.

source: Event List View
de: Die Ansicht <quote>Terminliste</quote>

source: This view displays all your to-dos, events and journal entries for the dates selected in the Date Navigator as a list. Open to-dos that are not due on the selected dates are not shown. This view is good for displaying many different items in a compact fashion. It is also useful if your events are spread out over a long time period that would not be displayed completely on the screen when using one of the other views.
de: Diese Ansicht zeigt alle Ihre Aufgaben, Termine und Journaleinträge für den ausgewählte Zeitraum als Liste an. Terminlisten eignet sich gut, wenn Sie an einem Tag viele unterschiedliche Termine haben und diese kompakt angezeigt werden sollen. Offene Aufgaben, die nicht im angezeigten Zeitraum fällig sind, werden nicht angezeigt. Diese Ansicht ist auch sehr nützlich, wenn Ihre Termine über einen größeren Zeitraum verstreut sind und die anderen Ansichten nicht alle darstellen können.

source: The items are displayed one per line. Columns show if a reminder is set (a bell icon displayed in it means the reminder is set), if it repeats multiple times (a chasing-arrows icon means a repeating event), the start and end time information. Hovering the mouse over an item will bring up a tooltip with detailed information about the item.
de: Es wird jeweils ein Eintrag pro Zeile angezeigt. Die Spalten zeigen, ob eine Erinnerung gesetzt ist (Glocke wird angezeigt), ob das Ereignis sich wiederholt (zwei Pfeile) sowie den Anfangs- und Endzeitpunkt. Wenn Sie den Mauszeiger über einen Eintrag bewegen, erscheint ein Hinweisfenster mit detaillierteren Informationen zu diesem Eintrag.

source: Switch the display to the list view by choosing the <menuchoice><guimenu>View</guimenu> <guimenuitem>Event List</guimenuitem></menuchoice> menu item.
de: Wechseln Sie zur Terminliste mit <menuchoice><guimenu>Ansicht</guimenu> <guimenuitem>Terminliste</guimenuitem></menuchoice> im Menü.

source: Agenda View
de: Terminplanansicht

source: The Agenda view presents your events or due to-dos for one or more days, sorted chronologically. You can also see the length of each event in the day timetable. To enable the Agenda view choose the <menuchoice><guimenu>View</guimenu> <guimenuitem>Agenda</guimenuitem></menuchoice> menu item or press the <inlinemediaobject><imageobject><imagedata fileref="view-calendar-agenda.png" format="PNG"/></imageobject></inlinemediaobject>toolbar button.
de: Die Terminplanansichten zeigen Ihre Termine oder anstehenden Aufgaben in zeitlicher Reihenfolge für einen oder mehrere Tage. Die Dauer aller Termine wird ebenfalls angezeigt.Wechseln Sie zur Terminplanansicht, in dem Sie im Menü <menuchoice><guimenu>Ansicht</guimenu> <guimenuitem>Tagesansicht</guimenuitem></menuchoice> auswählen oder den Knopf <inlinemediaobject><imageobject><imagedata fileref="view-calendar-day.png" format="PNG"/></imageobject></inlinemediaobject> in der Werkzeugleiste drücken.

source: The <guilabel>Day</guilabel>, <guilabel>Work Week</guilabel> and <guilabel>Week</guilabel> views are variations of the Agenda view. In fact, you can set the days shown in the Agenda view at any time by selecting them in the Date Navigator.
de: Die Ansichten <guilabel>Tag</guilabel>, <guilabel>Arbeitswoche</guilabel> und <guilabel>Woche</guilabel> sind Varianten der Terminplanansicht. Sie können die in der Terminplanansicht angezeigten Tage jederzeit festlegen, indem Sie diese im Datumsnavigator auswählen.

source: Time is indicated by a time bar on the left side of the view. A scrollbar on the right is provided when the whole day cannot be displayed on a single screen (which is the usual case). Each rectangle in the view represents an individual event or to-do due for that time, and displays the start and end time and summary. A <guiicon>bell</guiicon> icon is displayed if a reminder is set, and a <guiicon>chasing-arrows</guiicon> icon is displayed if it repeats multiple times. Hovering the mouse over an calendar item will bring up a tooltip with the item detailed information. To make &korganizer; show a red line marking the current-time on the current day (the Marcus Bains line), check the <guilabel>Show current-time (Marcus Bains) line</guilabel> box in the <link linkend="config-main-views">&korganizer; view configuration</link>.
de: In dieser Ansicht wird die Tageszeit auf der linken Seite angezeigt. Reicht die Darstellung nicht für einen kompletten Tag, wird am rechten Rand eine Bildlaufleiste dargestellt (der Normalfall). Jedes Rechteck in der Ansicht stellt einen Termin dar. Start- und Endzeit sowie die Zusammenfassung werden ebenfalls angezeigt. Ein <guiicon>Glocken-Symbol</guiicon> wird angezeigt, wenn dem Termin eine Erinnerung zugeordnet wurde. Ein Symbol mit <guiicon>zwei Pfeilen</guiicon> wird dargestellt, wenn der Termin sich mehrmals wiederholt. Sobald Sie den Mauszeiger über einen Eintrag bewegen, wird ein Kurztipp angezeigt, der Details des Termins angezeigt. Damit &korganizer; die aktuelle Uhrzeit des heutigen Tages durch eine rote Linie (die so genannte Marcus-Bains-Linie) anzeigt, müssen Sie im <link linkend="config-main-views">Einrichtungsdialog von &korganizer;</link> das Ankreuzfeld <guilabel>Aktuelle Zeit (Marcus-Bains-Linie) anzeigen</guilabel> markieren.

source: Any event can be re-sized with your mouse. Simply move the mouse pointer near the top or bottom edge of the event, and drag the edge up or down. This way you can visually modify the starting and ending time of your event. This also works in the Week and Work Week views. In other words, it is possible to change start and end times with the mouse by just moving the upper or lower border of the event to the new time.
de: Die Dauer jedes Termins kann mit der Maus verändert werden. Platzieren Sie den Mauszeiger am oberen oder unteren Ende des Termins und bewegen Sie den Mauszeiger bei gedrückter Maustaste aufwärts bzw. abwärts. Dadurch können Sie visuell die Start- und Endzeiten eines Termins verändern. Das funktioniert übrigens auch in der Arbeitswochen- und Wochenansicht. Mit anderen Worten: Sie können Anfangs- oder Endzeit mit der Maus verschieben, indem Sie die betreffenden Markierungen verschieben.

source: Any event can be rescheduled with your mouse. Move the mouse pointer over the event, and drag it to a new time location. This also works in the Week and Work Week views. Events can be moved to other, presently non-visible dates. Move the mouse pointer over the event, and drag it to the Date Navigator.
de: Jeder Termin kann mit der Maus an einen anderen Zeitpunkt verschoben werden. Bewegen Sie den Mauszeiger auf den Termin und ziehen Sie ihn bei gedrückter Maustaste an die neue Position. Dies funktioniert auch in der Arbeitswochen- und Wochenansicht. Termine können auch auf Tage verschoben werden, die nicht zu sehen sind. Bewegen Sie dazu den Termin mit dem Mauszeiger durch Ziehen-und-Ablegen im Datumsnavigator auf das gewünschte Datum.

source: Since the Agenda view cannot contain the whole day on most screens, you will have to scroll up and down to see the whole day. There is a useful hint that tells you if there are any currently invisible events above or below your current view; it is a small down-pointing arrow at the bottom of each day view or up-pointing arrow at the top.
de: Da auf den meisten Bildschirmen in der Terminplanansicht nicht der ganze Tag auf einmal dargestellt werden kann, wird rechts eine Bildlaufleiste eingeblendet, die das Verschieben der Anzeige ermöglicht. Auf gerade nicht sichtbare Termine wird jedoch immer hingewiesen, und zwar durch ein kleines Pfeilsymbol am oberen bzw. unteren Rand.

source: There are two useful shortcuts for adding events:
de: Es gibt zwei nützliche Abkürzungen zum Hinzufügen von Ereignissen.

source: Double-click any open region of time, and &korganizer; will automatically create an event with default duration (which is customizable in the preferences dialog). You can immediately add the title. The events <quote>snap</quote> to half-hour increments, rounding off to the closest half hour from where you clicked.
de: Doppelklicken Sie auf einen noch freien Zeitpunkt; dadurch legt &korganizer; automatisch einen Termin mit der Standarddauer (die Sie in <quote>Persönliche Einstellungen ...</quote> festlegen können) an. Sie können sofort den Titel eingeben. Die Termine werden in einem halbstündigen <quote>Raster</quote> angelegt und beim Klicken auf die nächste halbe Stunden gerundet.

source: Select any open region of time, and double click it or start writing the title of the event. &korganizer; will automatically set the duration and start time as defined by the selection area in the Agenda view.
de: Wählen Sie einen beliebigen freien Zeitraum aus und führen darauf einen Doppelklick aus, können Sie den Titel des Termins eingeben. &korganizer; legt die Dauer und die Startzeit automatisch anhand des ausgewählten Zeitraums fest.

source: To help you organize your agenda, the color of the events reflect their category, and depending on the <link linkend="config-main-views">&korganizer; view configuration</link>, it may also reflect its <link linkend="managing-resources">resource</link>. Therefore, if you assign <link linkend="categories-view">categories to events</link> and <link linkend="config-main-colors">different colors to categories</link> , you will be able to quickly identify the type of event by its color.
de: Um Ihnen dabei zu helfen Ihre Agenda zu organisieren, zeigt die Farbe eines Termins dessen Kategorie in Abhängigkeit der <link linkend="config-main-views">Ansichts-Einstellungen für &korganizer;</link> an. Die Farbe kann ebenso die <link linkend="managing-resources">Ressource</link> anzeigen. Wenn Sie also den <link linkend="categories-view">Ereignissen Kategorien</link> und den <link linkend="config-main-colors">Kategorien unterschiedliche Farben</link> zuordnen, können sie die Art des Ereignisses sehr schnell an der Farbe erkennen.

source: The Agenda view can display events from all your calendars merged into one view or show a view per calendar. Having both views available via tabs is also possible and can be <link linkend="config-main-views">customized in the preferences dialog</link>.
de: In der Terminplanansicht können Ereignisse aus allen Ihren Kalendern zusammen in einer Ansicht oder einzeln für jeden Kalender angezeigt werden. Beide Ansichtsarten können auch gleichzeitig in verschiedenen Unterfenstern benutzt werden, dies wird im <link linkend="config-main-views">Einrichtungsdialog</link> eingestellt.

source: Day View
de: Tagesansicht

source: This view presents the <link linkend="agenda-view">Agenda view</link> for a single day.
de: Diese Ansicht zeigt die <link linkend="agenda-view">Terminplanansicht</link> für einen einzelnen Tag.

source: Switch the display to the Day view by choosing the <menuchoice><guimenu>Go</guimenu> <guimenuitem>Day</guimenuitem></menuchoice> menu item or pressing the <inlinemediaobject><imageobject><imagedata fileref="view-calendar-day.png" format="PNG"/></imageobject></inlinemediaobject><guilabel>Day</guilabel> button in the toolbar.
de: Wechseln Sie zur Tagesansicht, in dem Sie im Menü unter <menuchoice><guimenu>Geh zu</guimenu> <guimenuitem>Tage</guimenuitem></menuchoice> auswählen oder den Knopf für den <inlinemediaobject><imageobject><imagedata fileref="view-calendar-day.png" format="PNG"/></imageobject></inlinemediaobject><guilabel>Tag</guilabel> in der Werkzeugleiste drücken.

source: Next X Days View
de: Die Ansicht <quote>Nächste x Tage</quote>

source: This view presents the <link linkend="agenda-view">Agenda view</link> for the next days, starting from today. You can change the number of days to be displayed in the <link linkend="config-main-views">&korganizer; view configuration</link>. The default value is 3.
de: Diese Ansicht stellt eine <link linkend="agenda-view">Terminplanansicht</link> für die nächsten Tage ab heute dar. Sie können die Anzahl der Tage, die angezeigt werden, in den <link linkend="config-main-views">Ansichts-Einstellungen für &korganizer;</link> ändern. Der Standardwert ist 3.

source: Switch the display to the next days view by choosing the <menuchoice><guimenu>Go</guimenu> <guimenuitem>Next X Days</guimenuitem></menuchoice> menu item, (X represents the number of days, usually 3).
de: Die Ansicht <quote>Nächste x Tage</quote> können Sie über das Menü unter <menuchoice><guimenu>Gehe zu</guimenu> <guimenuitem>Nächsten x Tage</guimenuitem></menuchoice> ändern. Hierbei ist X die Anzahl der Tage, normalerweise 3.

source: Week View
de: Wochenansicht

source: The Week view provides a view similar to the Day view. Events for seven days are shown next to each other.
de: Die Wochenansicht stellt eine ähnliche Ansicht wie die Tagesansicht zur Verfügung. Die Termine der nächsten sieben Tage werden nebeneinander angezeigt.

source: Switch the display to the Week view by choosing the <menuchoice><guimenu>Go</guimenu> <guimenuitem>Week</guimenuitem></menuchoice> menu item or pressing the <inlinemediaobject><imageobject><imagedata fileref="view-calendar-week.png" format="PNG"/></imageobject></inlinemediaobject><guilabel>Week</guilabel> button in the toolbar.
de: Wechseln Sie zur Wochenansicht, indem Sie im Menü unter <menuchoice><guimenu>Gehe zu</guimenu> <guimenuitem>Woche</guimenuitem></menuchoice> auswählen oder den Knopf <inlinemediaobject><imageobject><imagedata fileref="view-calendar-week.png" format="PNG"/></imageobject></inlinemediaobject><guilabel>Woche</guilabel> in der Werkzeugleiste benutzen.

source: Work Week View
de: Die Ansicht <quote>Arbeitswoche</quote>

source: This is the same as the Week view, except that it shows only the working days of the week.
de: Diese Ansicht ähnelt der Wochenansicht, allerdings werden nur die Arbeitstage angezeigt.

source: Switch the display to the Work Week view by choosing the <menuchoice><guimenu>Go</guimenu> <guimenuitem>Work Week</guimenuitem></menuchoice> menu item.
de: Zur Ansicht <quote>Arbeitswoche</quote> können Sie über das Menü unter <menuchoice><guimenu>Gehe zu</guimenu> <guimenuitem>Arbeitswoche</guimenuitem></menuchoice> wechseln.

source: Month View
de: Monatsansicht

source: The Month view shows all the events and due to-dos for the current month in a familiar month calendar layout. Each cell in the view represents a day, and each day contains all of the events that can fit in the area provided (maximizing the window will enable you to see more appointments). Information on repeating and reminder status is indicated through <guiicon>bell</guiicon> and <guiicon>chasing arrows</guiicon> icons, just as in other views.
de: Die Monatsansicht zeigt die Termine des aktuellen Monats in einer typischen Kalenderdarstellung an. Für jeden Tag werden so viele Termine angezeigt, wie der verfügbare Platz zulässt. Um mehr Termine zu sehen, brauchen Sie also nur das &korganizer;-Fenster zu maximieren. Informationen über Erinnerungen und Wiederholungen werden durch die Symbole <guiicon>Glocke</guiicon> und <guiicon>Kreisende Pfeile</guiicon> angezeigt, genau wie in den anderen Ansichten.

source: Navigate the Month view using the Date Navigator arrows, or the items and toolbar buttons from the <guilabel>Go</guilabel> menu. Since the visible area of a day cell may not contain all events and to-dos, you can use the keyboard to browse the items, or you can use the scrollbars to see all the events and to-dos from that day.
de: Bewegen Sie sich durch die Monatsansicht indem Sie die Navigationspfeile, die Einträge im Menü <guilabel>Gehe zu</guilabel> oder die Knöpfe in der Werkzeugleiste benutzen. Da der sichtbare Bereich eines Tages unter Umständen nicht alle Termine und Aufgaben enthält, können Sie die Tastatur zum Wechseln zwischen den Einträgen benutzen oder die Bildlaufleisten dazu benutzen, alle Termine und Aufgaben anzuzeigen.

source: Hover your mouse over any calendar item to display a tooltip with the item details. Double click an empty area to create an event, double click any calendar item to edit it.
de: Bewegen Sie den Mauszeiger auf einen beliebigen Kalendereintrag, damit eine Kurzinfo mit den Details zu diesem Eintrag angezeigt wird. Führen Sie einen Doppelklick auf einen freien Bereich aus, um einen neuen Termin zu erstellen, oder auf einen beliebigen Kalendereintrag, um diesen zu bearbeiten.

source: To help you organize your data, the color of the events may reflect their category, and its <link linkend="managing-resources">resource</link>, depending on the <link linkend="config-main-views">&korganizer; view configuration</link>. Therefore, if you assign <link linkend="categories-view">categories to events</link> and <link linkend="config-main-colors">different colors to categories</link>, you can identify the type of event (or resource) by its color.
de: Als Orientierungshilfe kann die Farbe eines Ereignisses seine Kategorie und seine <link linkend="managing-resources">Ressource</link> in Abhängigkeit der <link linkend="config-main-views">Ansichts-Einstellungen für &korganizer;</link> wiederspiegeln. Wenn Sie also <link linkend="categories-view">Kategorien zu Ereignissen</link> zuordnen und <link linkend="config-main-colors">unterschiedliche Farben für Kategorien</link> benutzen, können Sie den Typ oder die Ressource des Ereignisses an seiner Farbe erkennen.

source: Switch the display to the Month view by choosing the <menuchoice><guimenu>View</guimenu> <guimenuitem>Month View</guimenuitem></menuchoice> menu item or pressing the <inlinemediaobject><imageobject><imagedata fileref="view-calendar-month.png" format="PNG"/></imageobject></inlinemediaobject><guilabel>Month</guilabel> button in the toolbar.
de: Wechseln Sie zur Monatsansicht, indem Sie im Menü unter <menuchoice><guimenu>Ansicht</guimenu> <guimenuitem>Monatsansicht</guimenuitem></menuchoice> auswählen oder den Knopf <inlinemediaobject><imageobject><imagedata fileref="view-calendar-month.png" format="PNG"/></imageobject></inlinemediaobject><guilabel>Monat</guilabel> in der Werkzeugleiste benutzen.

source: Timeline View
de: Zeitleistenansicht

source: The Timeline view shows all events for the selected timespan in a gantt view. Every calendar is displayed in a separate line.
de: Die Zeitleistenansicht zeigt alle Termine für die ausgewählte Zeitspanne in einem Gantt-Diagramm. Jeder Kalender wird auf einer eigenen Zeile angezeigt.

source: To-do List
de: Aufgabenliste

source: The To-do List provides a place for you to jot down quick (or long-term) notes about things that need to be done. The To-do View sidebar component appears right below the Date Navigator. You can also display it in the main panel if you click the <inlinemediaobject><imageobject> <imagedata fileref="view-calendar-tasks.png" format="PNG"/></imageobject> </inlinemediaobject><guilabel>To-do List</guilabel> view toolbar button or if you choose the <menuchoice><guimenu>View</guimenu><guimenuitem>To-do List</guimenuitem></menuchoice> menu item.
de: Die Aufgabenliste bietet Raum für schnelle Notizen über noch (auch längerfristig) zu erledigende Dinge. Die Aufgabenliste wird unterhalb des Datumsnavigators dargestellt. Sie können sie zusätzlich im Hauptfenster darstellen, indem Sie den Knopf <inlinemediaobject><imageobject> <imagedata fileref="view-calendar-tasks.png" format="PNG"/></imageobject> </inlinemediaobject><guilabel>Aufgabenliste</guilabel> in der Werkzeugleiste benutzen oder im Menü den Eintrag <menuchoice><guimenu>Ansicht</guimenu><guimenuitem>Aufgabenliste</guimenuitem></menuchoice> auswählen.

source: You can give your to-do a <quote>date due</quote>, in other words a date when the to-do should be finished.
de: Sie können Ihrer Aufgabe eine <quote>Fälligkeit</quote> zuweisen, also einen Zeitpunkt an dem die Aufgabe spätestens erledigt sein sollte.

source: You can also assign priorities to to-dos, and they will appear sorted in order of priority. The lower the number, the higher the priority, except that zero (0) is defined as <quote>no priority.</quote>
de: Sie können Ihren Aufgaben auch Prioritäten zuweisen.Sie werden dann nach Priorität sortiert angezeigt. Je kleiner die Zahl um so höher die Priorität. Ausnahme ist hier die Null (0), die definiert ist als <quote>keine Priorität</quote>.
