Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdepim/korganizer.po
Languages: de

source: Enter the &URL; for the server on which your Free/Busy information will be published. Ask the server administrator for this information.
de: Geben Sie hier die Adresse des Servers ein, auf dem die Frei/Belegt-Informationen veröffentlicht werden sollen. Sie können diese Information vom Systemverwalter des Servers bekommen.

source: Kolab2 server example: <userinput>webdavs://kolab2.com/freebusy/joe@kolab2.com.ifb</userinput>
de: Beispiel für den Kolab2-Server:<userinput>webdavs://kolab2.com/freebusy/jakob@kolab2.de.ifb</userinput>

source: Username
de: Benutzername

source: Enter the login information relative to your account on the server
de: Geben Sie die Anmeldeinformationen Ihres Kontos auf dem Server ein

source: Kolab2 server specificity: your registered UID (Unique IDentifier), by default, would be similar to your email address on the Kolab2 server but it may be different. In this case enter your UID. Ask the server administrator about your UID if you do not know it.
de: Nur für den Kolab2-Server: Registrieren Sie hier Ihre UID (Unique IDentifier, eindeutiger Bezeichner). Von Haus aus ist dies ähnlich Ihrer E-Mail-Adresse auf dem Kolab2-Server, kann aber auch anders sein. Wenn es etwas anderes ist, dann geben Sie das hier ein. Wenn Sie sich nicht sicher sind, fragen Sie den Systemverwalter des Servers.

source: Password
de: Passwort

source: Enter your password (server login password) here.
de: Geben Sie hier Ihr Passwort auf dem Server ein.

source: Remember password
de: Passwort speichern

source: Check this option if you want &korganizer; to remember your password and skip asking you each time it uploads your Free/Busy information.
de: Wählen Sie diese Option an, wenn Sie wollen, dass &korganizer; Ihr Passwort speichert, sodass Sie es nicht jedes Mal beim Veröffentlichen Ihrer Frei/belegt-Informationen eingeben müssen.

source: It is not recommended to store your password in the configuration file for security reasons.
de: Aus Sicherheitsgründen raten wir davon ab, Ihr Passwort in der Konfigurationsdatei zu speichern.

source: Retrieve
de: Abholen

source: By retrieving other people's free/busy information, you can take their busy time schedule into account when inviting them to an event.
de: Durch das Abholen der Frei/Belegt-Informationen anderer Personen können Sie diese Informationen benutzen, wenn Sie einen Termin planen.

source: Retrieve other people's free/busy information automatically
de: Frei/Belegt-Listen anderer Leute automatisch herunterladen

source: Automate the process for retrieving other users free/busy time. Fill in the server information section below to enable this option.
de: Sie können den Vorgang zum Abholen der Frei/Belegt-Informationen anderer automatisieren. Füllen Sie den Abschnitt mit Server-Informationen unten aus, um diese Option einzuschalten.

source: Use full email address for retrieval
de: Beim Abholen die vollständige E-Mail-Adresse verwenden

source: This setting lets you change the name of the file which will be fetched from the server. If you check this option, it will download a free/busy file called <userinput>user@domain.ifb</userinput>, else it will fetch <userinput>user.ifb</userinput>. Ask the server administrator if you are not sure about how to configure this option.
de: Mit dieser Einstellung können Sie den Namen der Datei ändern, die vom Server abgeholt wird. Wenn Sie diese Option einschalten, dann wird eine Frei/Belegt-Datei namens <userinput>benutzer@domaene.ifb</userinput> abgeholt, ansonsten <userinput>benutzer.ifb</userinput>. Fragen Sie den Systemverwalter des Servers, wenn Sie sich nicht sicher sind, was Sie hier eintragen sollen.

source: <guilabel>Kolab2 server specificity:</guilabel> If you are configuring &korganizer; as a component to a <guilabel>&kde; Kolab client (&kontact;/Kolab)</guilabel> you have to check this option.
de: <guilabel>Nur für den Kolab2-Server:</guilabel> Wenn Sie &korganizer;als eine Komponente Ihres <guilabel>&kde; Kolab-Klienten (&kontact;/Kolab)</guilabel> konfigurieren, dann müssen Sie diese Option anwählen.

source: Enter the &URL; for the server from which your Free/Busy information will be fetched. Ask the server administrator for this information.
de: Geben Sie die Adresse des Servers ein, von dem Ihre Frei/Belegt-Informationen abgeholt werden sollen. Fragen Sie den Systemverwalter des Servers, wenn Sie nicht wissen, was Sie hier eintragen sollen.

source: <guilabel>Kolab2 server example: </guilabel><userinput>webdavs://kolab2.com/freebusy/</userinput>
de: <guilabel>Beispiel für den Kolab2-Server:</guilabel> <userinput>webdavs:://kolab2.de/freebusy/</userinput>

source: Enter the login information relative to your account on the server.
de: Geben Sie die Anmeldeinformationen Ihres Kontos auf dem Server ein

source: Check this option if you want &korganizer; to remember your password and skip asking you each time it fetches the free/busy files.
de: Wählen Sie diese Option, wenn &korganizer; Ihr Passwort speichern soll, damit Sie es nicht jedes Mal eingeben müssen, wenn die Frei/Belegt-Dateien abgeholt werden sollen.

source: Plugins
de: Module

source: For more information about configuring plugins, please refer to <xref linkend="plugins-chapter"/>
de: Weitere Informationen zur Einrichtung von Modulen finden Sie unter <xref linkend="plugins-chapter"/>

source: Toolbars Configuration
de: Werkzeugleisten einrichten

source: &korganizer; has four toolbars: a Main toolbar (with <guiicon>New Event</guiicon>, <guiicon>New To-do</guiicon>, <guiicon>New Journal</guiicon>, <guiicon>Back</guiicon>, <guiicon>Forward</guiicon>, <guiicon>Today</guiicon>, <guiicon>Day</guiicon> and <guiicon>Week</guiicon> buttons), a <guiicon>Views</guiicon> toolbar (for selecting between <guiicon>Agenda</guiicon>, <guiicon>Month View</guiicon>, <guiicon>Timeline</guiicon>, <guiicon>To-do List</guiicon> and <guiicon>Journal</guiicon> views), a Schedule toolbar (with <guiicon>Publish Item Information</guiicon>, <guiicon>Send Invitations to Attendees</guiicon>, <guiicon>Send Status Update</guiicon> and <guiicon>Address Book</guiicon> buttons) and a Filters toolbar, which allows you to choose a filter for the &korganizer; views and manage the view filters as well. You can customize these toolbars in various ways: you can add new icons, change the icon size, change toolbar position and add text description to the icons.
de: &korganizer; hat vier Werkzeugleisten: Zunächst die Hauptleiste (mit den Knöpfen <guiicon>Neuer Termin</guiicon>, <guiicon>Neue Aufgabe</guiicon>, <guiicon>Neues Journal</guiicon>, <guiicon>Zurück</guiicon>, <guiicon>Vorwärts</guiicon>, <guiicon>Heute</guiicon>, <guiicon>Tag</guiicon>, <guiicon>Woche</guiicon>), einer <guiicon>Ansichten</guiicon>-Werkzeugleiste (um zwischen <guiicon>Tagesansicht</guiicon>, <guiicon>Monatsansicht</guiicon>, <guiicon>Zeitleiste</guiicon>, <guiicon>Aufgabeliste</guiicon> und <guiicon>Journal</guiicon> zu wechseln), einer Planung-Werkzeugleiste (mit den Knöpfen <guiicon>Informationen zum Eintrag veröffentlichen</guiicon>, <guiicon>Einladungen an die Teilnehmer verschicken</guiicon>, <guiicon>Aktualisierung versenden</guiicon> und <guiicon>Adressbuch</guiicon>) und eine Filter-Werkzeugleiste, um einen Filter für die &korganizer;-Ansichten auszuwählen und die Ansichtsfilter zu verwalten. Sie können diese Werkzeugleisten auf verschiedene Arten anpassen: Sie können neue Knöpfe hinzufügen, Größe ändern, Position verändern und eine Textbeschreibung zu den Knöpfen hinzufügen.

source: There are two ways to change the position of the toolbars:
de: Die Position von Werkzeugleisten kann auf zwei Arten geändert werden:

source: You can right click the toolbar to bring up the <guimenu>Toolbar Menu</guimenu>. The icon size and text position can also be adjusted from this menu.
de: Durch Klicken mit der rechten Maustaste auf einer Werkzeugleiste erscheint das Kontextmenü <guimenu>Werkzeugleisten-Einstellungen</guimenu>. Symbolgröße und Textposition kann ebenfalls mit diesem Menü geändert werden.

source: If a toolbar is unlocked, you can simply drag the toolbar by the handle on the left border of each toolbar, and drop it whenever you wish. Also look at other easy <link linkend="other-features-drag-and-drop">drag-and-drop operations</link>.
de: Wenn die Werkzeugleiste nicht gesperrt ist, können Sie die Leiste an ihrem linken Ende anklicken, an eine andere Stelle auf dem Bildschirm ziehen und dort ablegen. Es gibt auch noch weitere einfache <link linkend="other-features-drag-and-drop">Operationen bei den Sie etwas Ziehen und ablegen können</link>.

source: The toolbars are configured in two places:
de: Die Werkzeugleisten werden an zwei Stellen eingerichtet:

source: The tool set is configured in the <menuchoice><guimenu> Settings</guimenu><guimenuitem>Configure Toolbars...</guimenuitem></menuchoice> menu item.
de: Die Werkzeugleisten werden über das Menü <menuchoice><guimenu>Einstellungen</guimenu><guimenuitem>Werkzeugleisten einrichten ...</guimenuitem></menuchoice> eingerichtet.

source: The graphic style (icon size, text position, &etc;) is adjusted through the <guimenu>Toolbar Context Menu</guimenu>. Right click the toolbar to access this menu.
de: Der grafische Stil, wie z. B. Symbolgröße, Textpostion &etc;, der Werkzeugleisten wird im Kontextmenü <guimenu>Werkzeugleisten-Einstellungen</guimenu> angepasst. Dieses Menü erscheint durch Klicken mit der rechten Maustaste auf eine Werkzeugleiste.

source: Configure Toolbars Dialog
de: Der Dialog <quote>Werkzeugleisten einrichten</quote>

source: This dialog allows you to customize the selection of tools on the toolbar. Open it choosing the <menuchoice><guimenu>Settings</guimenu><guimenuitem> Configure Toolbars...</guimenuitem></menuchoice> menu item.
de: Dieser Dialog erlaubt es Ihnen die Auswahl an Werkzeugen in der Werkzeugleiste anzupassen. Sie können ihn über das Menü <menuchoice><guimenu>Einstellungen</guimenu><guimenuitem> Werkzeugleisten einrichten ...</guimenuitem></menuchoice> öffnen.

source: Choosing the toolbar
de: Auswahl einer Werkzeugleiste

source: First you need to choose the toolbar that you want to modify. All actions apply to the toolbar that is selected from the drop down menu at the top of the window.
de: Zunächst müssen Sie die zu verändernde Leiste auswählen. Alle Änderungen beziehen sich auf die oben im Fenster angegebene Leiste.

source: Available Actions
de: Verfügbare Aktionen

source: There are two rectangles below the toolbar title: <guilabel>Available actions</guilabel> and <guilabel>Current actions</guilabel>. Using the left and right arrows (located between the rectangles) you can move icons from the <guilabel>Available actions</guilabel> group to the <guilabel>Current actions</guilabel> group. The toolbar will have every icon that is in the <guilabel>Current actions</guilabel> box. The up and down arrows allow you to reposition an icon.
de: Es gibt zwei Auswahllisten unter dem Namen der Leiste: <guilabel>Verfügbare Aktionen</guilabel> und <guilabel>Angezeigte Aktionen</guilabel>. Mit den Links- und Rechts-Pfeilen zwischen den Auswahlfeldern können Sie Befehle von den verfügbaren zu den <guilabel>Angezeigten Aktionen</guilabel> verschieben. Die Leiste wird zukünftig alle Befehle enthalten, die in der Liste <guilabel>Angezeigte Aktionen</guilabel> stehen. Die Aufwärts- und Abwärts-Pfeile erlauben die Veränderung der Reihenfolge der Symbole.

source: The buttons below the <guilabel>Current actions</guilabel> list allows you to change the icon and the text of a button. In the <guilabel>Change Text</guilabel> dialog you can select <guilabel>Hide text when toolbar shows text alongside icons</guilabel> to save space in this mode so that all buttons are visible.
de: Mit den Knöpfen unter der Liste <guilabel>Angezeigte Aktionen</guilabel> können Sie das Symbol und den Text für einen Knopf ändern. Im Dialog <guilabel>Text ändern</guilabel> können Sie <guilabel>Text ausblenden, wenn sich dieser neben den Symbolen in der Werkzeugleiste befindet</guilabel> wählen, um Platz in der Werkzeugleiste zu sparen, so dass alle Knöpfe sichtbar sind.

source: Remember that less icons may be better, because the screen is less busy and therefore it is easier to find the toolbar buttons you actually use. For instance if you always cut and paste with the keyboard hotkeys, you do not need the <guiicon>Cut</guiicon>, <guiicon>Copy</guiicon> and <guiicon>Paste</guiicon> icons.
de: Weniger ist oft mehr - der Bildschirm wirkt bei wenigen Symbolen nicht so durcheinander. Wenn Sie zum Beispiel zum Ausschneiden und Einfügen Tastenkürzel benutzen, dann brauchen Sie die Knöpfe <guiicon>Ausschneiden</guiicon>, <guiicon>Kopieren</guiicon> und <guiicon>Einfügen</guiicon> nicht in Ihrer Werkzeugleiste.

source: Toolbar Context Menu
de: Kontextmenü der Werkzeugleisten

source: This menu allows you to change the look of the toolbars. <mousebutton>Right</mousebutton> click the toolbar to access this menu.
de: In diesem Menü kann das Aussehen der Werkzeugleisten verändert werden. Um das Menü aufzurufen, klicken Sie mit der <mousebutton>rechten</mousebutton> Maustaste auf eine Werkzeugleiste.

source: Show Text
de: Text anzeigen

source: If text is shown alongside icons choose if the text of the button is displayed.
de: Wenn der Text neben den Symbolen angezeigt wird, können Sie auswählen, ob der Text auf den Knöpfen gezeigt wird.

source: Initially, icons have text alongside each icon. You may prefer having text under each icon. You can also have plain texts without any icons or icons only.
de: Als Voreinstellung werden Texte neben Symbolen angezeigt. Sie können dies jedoch einstellen, sodass die Texte unter den Symbolen dargestellt werden. Auch reiner Text ohne Symbole und nur Symbole ohne Text kann eingestellt werden.

source: Icon Size
de: Symbolgröße

source: You can change the size of the icons. Make your choice between small, medium, large and huge icons.
de: Sie können die Größe der Symbole ändern. Wählen Sie zwischen kleinen, mittleren und großen Symbolen.

source: Lock Toolbar Position
de: Werkzeugleisten sperren

source: If you unlock a toolbar, you can move the toolbar to the top, bottom, left, right side or even outside the main &korganizer; window.
de: Wenn Sie eine Werkzeugleiste entsperren, können Sie sie nach oben, nach unten, auf die linke oder rechte Seite und sogar außerhalb des Hauptfensters von &korganizer; schieben

source: &korganizer; provides you with the possibility of extending the application with plugins.
de: &korganizer; bietet Ihnen die Möglichkeit die Anwendung mit Modulen zu erweitern.

source: The plugins can be configured under the &korganizer; main configuration dialog. Choose <menuchoice><guimenu>Settings</guimenu><guimenuitem> Configure &korganizer;</guimenuitem></menuchoice> and click the <guilabel>Plugins</guilabel> icon on the icon list sidebar of the dialog.
de: Die Module können im Einrichtungsdialog von &korganizer; eingestellt werden. Wählen Sie den Menüeintrag <menuchoice><guimenu>Einstellungen</guimenu> <guimenuitem>&korganizer; einrichten ...</guimenuitem> </menuchoice>und klicken dann auf das Symbol <guilabel>Module</guilabel> in der Seitenleiste mit den Symbolen des Dialogs.

source: Available Plugins
de: Verfügbare Module

source: Date Numbers Plugin for Calendars
de: Kalendertag-Modul für Kalender

source: This plugin adds the number of the day in the year to the Agenda view. For instance, February 1 is day number 32.
de: Dieses Modul fügt den Kalendertag zur Terminplanansicht hinzu. So ist zum Beispiel der 1. Februar der Kalendertag 32.

source: Wikipedia 'This Day in History' Plugin
de: Wikipedia-Modul „Dieser Tag in der Geschichte“

source: This plugin provides links to Wikipedia's <quote>This Day in History</quote> pages.
de: Dieses Modul stellt eine Verknüpfung zu <quote>Dieser Tag in der Geschichte</quote> in Wikipedia zur Verfügung.

source: Wikipedia Picture of the Day Plugin for Calendars
de: Bild des Tages aus Wikipedia für den Kalender

source: This plugin provides the Wikipedia <quote>Picture of the Day</quote>.
de: Dieses Modul stellt das <quote>Bild des Tages</quote> aus Wikipedia zur Verfügung.

source: Jewish Calendar Plugin
de: Modul für jüdischen Kalender

source: This plugin provides Jewish calendar dates in addition to the Gregorian calendar dates. In the configuration dialog of the plugin, you can choose if you want to display Israeli holidays, weekly prasha, day of Omer and/or Chol HaMoed.
de: Dieses Modul zeigt neben dem Datum des gregorianischen Kalenders das Datum nach dem jüdischen Kalender an. Im Einrichtungsdialog können Sie festlegen, ob israelische Feiertage, der wöchentliche Parsha, der Omer-Tag und/oder Chol HaMoed angezeigt werden sollen.

source: Journal Print Style
de: Journal-Druckstil

source: This plugin allows you to print out journal entries (diary entries).
de: Mit diesem Modul können Journaleinträge (Tagebucheinträge) gedruckt werden.

source: Yearly Print Style
de: Jahres-Druckstil

source: This plugin allows you to print out a yearly calendar.
de: Mit diesem Modul können Jahresübersichten gedruckt werden.

source: Reference
de: Referenz

source: Menus
de: Menüs

source: When &korganizer; starts, the main &korganizer; window appears. The window has several components: a menubar, a toolbar, a month calendar, a main panel with the current <quote>view</quote> of events, and a to-do list.
de: Beim Start von &korganizer; erscheint das Hauptfenster. Das Fenster besteht aus mehreren Teilen: Menüleiste, Werkzeugleiste, Monatskalender, Hauptfenster mit der aktuellen <quote>Ansicht</quote>der Termine und einer Aufgabenliste.

source: The menus provide access to all the common operations that can be performed with the calendar, including saving, loading, adding and deleting events, to-dos and journal entries, printing and more.
de: Mit den Menüs können alle gängigen Operationen im Programm durchgeführt werden, inklusive Speichern, Laden, Hinzufügen und Löschen von Aufgaben, Terminen und Journaleinträgen, Druck- und weiteren Operationen.

source: Please note that when using &korganizer; as the calendar component of &kontact;, the menus differ from the stand alone application.
de: Beachten Sie bitte, dass wenn Sie &korganizer; als Kalenderkomponente von &kontact; benutzen, die Menüs anders sind als bei der allein laufenden Anwendung.

source: File
de: Datei

source: The <guimenu>File</guimenu> menu provides access to functions involving the entire calendar.
de: Das <guimenu>Datei</guimenu> Menü enthält Funktionen, die den gesamten Kalender betreffen.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>O</keycap></keycombo> </shortcut> <guimenu> File</guimenu> <guimenuitem>Open</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>O</keycap></keycombo> </shortcut> <guimenu>Datei</guimenu> <guimenuitem>Öffnen</guimenuitem>

source: <action>Opens a file dialog allowing you to select a new vCalendar or iCalendar file to load.</action> If you have made changes to the current calendar, you will be given the option of saving them before loading a new one.
de: <action>Öffnet einen Dialog, in dem Sie eine vCalendar-Datei zum Öffnen auswählen können.</action> Wenn Sie an dem momentan geöffneten Kalender Änderungen vorgenommen haben, werden Sie gefragt, ob diese gespeichert werden sollen.

source: For more information about this, please refer to <xref linkend="managing-import-export"/>.
de: Weitere Informationen hierzu finden Sie unter <xref linkend="managing-import-export"/>.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>P</keycap></keycombo> </shortcut> <guimenu> File</guimenu> <guimenuitem>Print</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>P</keycap></keycombo> </shortcut> <guimenu>Datei</guimenu> <guimenuitem>Drucken</guimenuitem>

source: Choose <guimenuitem>Print</guimenuitem> or click the <guilabel>Print</guilabel> icon to <action>print the current calendar</action>. You can specify the range of dates to be printed (either manually or with the Calendar Widget) and the Print Style (Day, Week, Month or To-dos and Journal).
de: Wählen Sie <guimenuitem>Drucken ...</guimenuitem> oder klicken Sie auf das Symbol <guilabel>Drucken</guilabel>, um <action>den aktuellen Kalender zu drucken</action>. Sie können die Bereich der zu druckenden Tage, entweder von Hand oder mit dem Auswahlfeld, und die Ansicht (Tag, Woche, Monat, Aufgaben oder Journaleinträge) wählen.

source: <guimenu> File</guimenu><guimenuitem>Print Preview</guimenuitem>
de: <guimenu>Datei</guimenu> <guimenuitem>Druckvorschau</guimenuitem>

source: If you choose <guimenuitem>Print Preview</guimenuitem> or click the <guiicon>Print Preview</guiicon> icon, <action>the current calendar will be printed on your screen, instead of on your printer</action>. Use this feature to check if the printout will be correct before you start printing.
de: Wenn Sie <guimenuitem>Druckvorschau</guimenuitem> auswählen oder auf das Symbol <guiicon>Druckvorschau</guiicon> klicken, <action>wird der Ausdruck des aktuellen Kalenders auf dem Bildschirm angezeigt, aber nicht gedruckt</action>. Benutzen Sie diese Funktion, um den Ausdruck vor dem Drucken zu überprüfen.

source: You can specify the range of dates to be printed (either manually or with the Calendar Widget) and the View Type (Day, Week, Month or To-do).
de: Sie können die Bereich der zu druckenden Tage, entweder von Hand oder mit dem Auswahlfeld, und die Ansicht (Tag, Woche, Monat, Aufgaben oder Journaleinträge) wählen.

source: <guimenu>File</guimenu> <guisubmenu>Import</guisubmenu> <guimenuitem>Import Calendar</guimenuitem>
de: <guimenu>Datei</guimenu> <guisubmenu>Importieren</guisubmenu> <guimenuitem>Kalender importieren</guimenuitem>

source: If you have a different iCalendar or vCalendar file somewhere, and you would like to <action>merge its contents into your own calendar, add as a new resource or open it as a new window</action>, choose this menu item. A good time to do this would be if you received a vCalendar with a few entries via email, for instance.
de: Dieser Menüeintrag ermöglicht es Ihnen, den Inhalt einer anderen iCalender oder vCalendar-Datei Ihrer eigenen <action>hinzuzufügen</action>, als neue Ressource einzufügen oder in einem neuen Fenster. Dies ist zum Beispiel dann sinnvoll, wenn Sie via E-Mail einige Terminen in einer vCalendar-Datei erhalten haben und diese in Ihrem ursprünglichen Kalender haben möchten.

source: For more information about this action, please refer to <xref linkend="managing-import"/>.
de: Weitere Informationen hierzu finden Sie unter <xref linkend="managing-import"/>.

source: <guimenu>File</guimenu> <guisubmenu>Import</guisubmenu> <guimenuitem>Import From UNIX Ical Tool</guimenuitem>
de: <guimenu>Datei</guimenu> <guisubmenu>Importieren</guisubmenu> <guimenuitem>Aus einem &UNIX;-iCal importieren</guimenuitem>

source: If you have used <application>ical</application>, a popular but older calendar program for &UNIX;, you may wish to <action>import your events and to-do</action> directly to &korganizer;. This action will read the <filename>.calendar</filename> file from your home folder and merge any entries it contains into your current calendar. If any errors or suspicious things occur during the process, you will be notified via a message box.
de: Wenn Sie vorher <application>ical</application>, ein beliebtes aber veraltetes Programm für &UNIX;, verwendet haben, können Sie mit dieser Funktion <action>Ihre Termine und Aufgaben direkt in &korganizer; importieren</action>. Dazu wird die <filename>.calendar</filename>-Datei in Ihrem Persönlichen Ordner ausgelesen und die Einträge dem aktuellen Kalender hinzugefügt. Wenn Fehler oder Unklarheiten beim Import auftauchen, werden Sie darüber mit einem Dialogfeld benachrichtigt.
