Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdepim/korganizer.po
Languages: de

source: In this example, you'll enter an event. You need to arrange a meeting on <emphasis>the next Monday</emphasis> regarding launch of your new Product. Your boss <emphasis>Joan Holden</emphasis> will be the event chairwoman <emphasis>owner</emphasis>, and you, Jack Smith, will be the event <emphasis>organizer</emphasis>. There will be two more <emphasis>attendees</emphasis> (participants): <emphasis>Peter Krzinski</emphasis> and <emphasis>Kirsten Friese</emphasis>. Joan gave you the program of the meeting. The appointment will start at <emphasis>12 noon</emphasis> and end at <emphasis>1 pm</emphasis>. The same appointment should be scheduled <emphasis>(recurred)</emphasis> each Monday.
de: In diesem Beispiel geben Sie einen Termin ein. Sie müssen ein Treffen am <emphasis>nächsten Montag</emphasis> arrangieren, weil dann Ihr neues Produkt auf den Markt kommt. Ihr Chef <emphasis>Max Meister</emphasis> wird das Treffen <emphasis>leiten</emphasis>, und Sie, Moritz Mustermann, werden das Treffen <emphasis>organisieren</emphasis>. Es wird bei dem Treffen zwei weitere <emphasis>Teilnehmer</emphasis> geben: <emphasis>Peter Palpatine</emphasis> und <emphasis>Kirsten Komisch</emphasis>. Max gab Ihnen den Plan für das Treffen. Das Treffen beginnt um <emphasis>12.00 Uhr</emphasis> und endet um <emphasis>13.00 Uhr</emphasis>. Dieses Treffen soll jeden Montag <emphasis>wiederholt</emphasis> werden.

source: Using the Date Navigator, go to the next Monday.
de: Benutzen Sie den Navigator, um zum nächsten Montag zu springen.

source: Choose the <menuchoice><guimenu>Actions</guimenu><guimenuitem>New Event...</guimenuitem></menuchoice>, or select the area between <emphasis>12 noon</emphasis> and end at<emphasis>1 pm</emphasis>, and start typing the event title.
de: Wählen Sie dort <menuchoice><guimenu>Aktionen</guimenu><guimenuitem>Neuer Termin ...</guimenuitem></menuchoice> oder wählen Sie den Bereich zwischen <emphasis>12:00</emphasis> und <emphasis>13:00 Uhr</emphasis> aus und geben Sie den Titel des Termins ein.

source: Enter a suitable title. It's important to choose the right brief description, because this is the only field that can be searched. We suggest that you enter <userinput>Product launch event</userinput>.
de: Geben Sie einen passenden Titel ein. Es ist wichtig, eine griffige Beschreibung zu wählen, denn nur dieses Feld kann durchsucht werden. Ein Vorschlag wäre <userinput>Treffen wegen Produktveröffentlichung</userinput>.

source: Enter the detailed event program into the largest rectangle area. For the sake of this simple example, enter <userinput>Introduction, The Plan, Conclusion</userinput> on three separate lines.
de: Geben Sie nun eine detaillierte Beschreibung in das große Textfeld ein. Um das Beispiel kurz zu halten, geben Sie einfach <userinput>Einleitung, Der Plan, Schlussfolgerung</userinput> in drei Zeilen ein.

source: Go to the <guilabel>Reminder</guilabel> tab. Set the reminder time to 15 minutes, just long enough to brew a cup of tea prior to the meeting start.
de: Wechseln Sie zur Karteikarte <guilabel>Erinnerung</guilabel> an, wenn &korganizer; Sie an einen Termin erinnern soll. Die Erinnerungszeit beträgt 15 Minuten - gerade lange genug für eine Tasse Tee vor Beginn einer Besprechung.

source: Select <guilabel>Appointment</guilabel> from the <guilabel>Categories</guilabel> drop down box.
de: Wählen Sie <guilabel>Termin</guilabel> und aus dem Auswahlfeld <guilabel>Kategorie</guilabel>.

source: Go to the <guilabel>Recurrence</guilabel> tab and select the <guilabel>Weekly</guilabel> repeats.
de: Gehen Sie zur Karteikarte <guilabel>Wiederholung</guilabel> und wählen Sie <guilabel>Wöchentlich</guilabel> aus.

source: Most work has been done for you automatically. &korganizer; defaults to recurring weekly. Also note that <guilabel>Ends:</guilabel> <guilabel>never</guilabel> is chosen. This means that this event will be repeated each Monday (starting, of course, on Monday August 30, 2010) until the end of time (that is, until you delete it).
de: Die meiste Arbeit wurde schon automatisch erledigt. &korganizer; stellt standardmäßig wöchentliche Wiederholung ein. Sie werden auch feststellen, dass <guilabel>Endet</guilabel> <guilabel>nie</guilabel>ausgewählt ist. Das heißt, dass der Termin jeden Montag wiederholt wird, ab ausgewählten Montag bis zum Ende des Universums oder bis Sie es löschen, je nachdem was vorher kommt.

source: Since everything is all right here, click the <guilabel>Attendees</guilabel> tab.
de: Da hier bereits alles richtig ist, klicken Sie nun auf die Karteikarte <guilabel>Teilnehmer</guilabel>.

source: In the <guilabel>Attendees</guilabel> tab you should do the following:
de: In der Karteikarte <guilabel>Teilnehmer</guilabel> sollten Sie folgendes machen:

source: You will see that you are the organizer of the event.
de: Sie werden sehen, dass Sie der Organisator des Termins sind.

source: In the first input field enter the email in the <userinput>Name &#060;email&#062;</userinput> format. In our example, enter <userinput>Joan Holden &#060;jholden@thiscompany.com&#062;</userinput>.
de: Im ersten Feld geben Sie bitte die E-Mail im Format <userinput>Name &#060;email&#062;</userinput> ein. Für unser Beispiel also <userinput>Max Meister &#060;mmeister@diesefirma.de&#062;</userinput>.

source: If the attendees are already in your &kde; address book, instead of typing the names and emails, you can press the <guibutton>Select Attendees...</guibutton> button to add them.
de: Wenn die Teilnehmer in Ihrem &kde;-Adressbuch sind können Sie statt der Eingabe der Namen und E-Mailadressen den Knopf <guibutton>Teilnehmer auswählen ...</guibutton> benutzen.

source: Choose <emphasis>Chair</emphasis> as the role.
de: Wählen Sie <emphasis>Leiter</emphasis> als Rolle.

source: In the next input field enter <userinput>Peter Krzinski &#060;pkrzinski@thiscompany.com&#062;</userinput>.
de: Im nächsten Feld geben Sie <userinput>Peter Palpatine &#060;ppalpatine@diesefirma.de&#062;</userinput> ein.

source: In the next input field enter <userinput>Kirsten Friese &#060;kfriese@thiscompany.com&#062;</userinput>.
de: Geben Sie jetzt im nächsten Feld <userinput>Kirsten Komisch &#060;kkomisch@diesefirma.de&#062;</userinput> ein.

source: If you have configured &korganizer; to use groupware communication, you will be asked if you want to send an email to the attendees, with details of the event and asking for a response if the <guilabel>Request response</guilabel> box from the <guilabel>Attendees</guilabel> tab is checked. Else, you can send the invitations choosing the <menuchoice><guimenu>Schedule</guimenu> <guimenuitem>Send Invitation to Attendees</guimenuitem></menuchoice> menu item.
de: Wenn Sie &korganizer; so konfiguriert haben, dass die Groupware-Kommunikation benutzt wird, werden Sie gefragt, ob Sie eine E-Mail an die Teilnehmer senden wollen. Diese enthält die Einzelheiten des Termins und eine Bitte um Antwort falls <guilabel>Antwort erbitten</guilabel> in der Karteikarte <guilabel>Teilnehmer</guilabel> ausgewählt war. Anderenfalls können Sie die Einladungen mit dem Menüeintrag <menuchoice><guimenu>Planer</guimenu> <guimenuitem>Einladungen an die Teilnehmer verschicken</guimenuitem></menuchoice> senden.

source: Review the event setup by clicking on the tabs. If you are satisfied, click <guibutton>OK</guibutton>.
de: Sie sind jetzt wieder im Hauptfenster des Termins. Prüfen Sie jetzt Ihre Eingaben auf allen Karteikarten. Wenn Sie zufrieden sind, klicken Sie auf <guibutton>OK</guibutton>.

source: Congratulations, you've scheduled your first event!
de: Herzlichen Glückwunsch, Sie haben gerade Ihren erste Termin eingegeben!

source: &korganizer; Configuration
de: &korganizer; einrichten

source: To change &korganizer;'s look and behavior, choose the <menuchoice><guimenu>Settings</guimenu><guimenuitem>Configure &korganizer;...</guimenuitem></menuchoice> menu item. You can get more information about all the configure options and possibilities in <xref linkend="config-main"/>.
de: Um das Aussehen und Verhalten von &korganizer; zu ändern, können Sie im Menü den Eintrag <menuchoice><guimenu>Einstellungen</guimenu><guimenuitem>&korganizer; einrichten ...</guimenuitem> </menuchoice> benutzen. Weitere Informationen über alle Optionen bei den Einstellungen finden Sie unter <xref linkend="config-main"/>.

source: To customize the set of tools available on the bar, choose the <menuchoice><guimenu>Settings</guimenu><guimenuitem>Configure Toolbars... </guimenuitem></menuchoice> menu item and read the <link linkend="config-toolbars">configure toolbars detailed description</link>.
de: Um die in der Leiste verfügbaren Werkzeuge anzupassen können Sie den Menüeintrag <menuchoice><guimenu>Einstellungen</guimenu><guimenuitem>Werkzeugleisten einrichten ... </guimenuitem></menuchoice> benutzen und eine <link linkend="config-toolbars">Beschreibung zur Anpassung der Werkzeugleisten</link> lesen.

source: To move toolbars around the screen, point your mouse over the toolbar handle and drag the toolbar to a new position on the &korganizer; window.
de: Um eine Werkzeugleiste auf dem Bildschirm zu verschieben ziehen Sie diese mit der Maus an die gewünschte Position im &korganizer;-Fenster und legen Sie dort ab.

source: Localization information like date and time formats can be configured from &systemsettings; within the <guilabel>Country/Region &amp; Language</guilabel> module. This control module can be accessed from within &korganizer;: just choose the <menuchoice><guimenu> Settings</guimenu><guimenuitem>Configure Date &amp; Time...</guimenuitem></menuchoice> menu item. &korganizer; has to be restarted for changes done in &systemsettings; to take effect.
de: Informationen wie Datum- und Zeitformat in Ihrem Land können in den &systemsettings; mit dem Modul <guilabel>Land/Region &amp; Sprache </guilabel> eingestellt werden. Dieses Modul kann auch aus &korganizer; im Menü unter <menuchoice><guimenu>Einstellungen</guimenu><guimenuitem>Datum und Uhrzeit einstellen ...</guimenuitem></menuchoice> aufgerufen werden. &korganizer; muss neu gestartet werden, damit Änderungen in den &systemsettings; wirksam werden.

source: To configure where &korganizer; stores and retrieves calendar events, journal entries and to-dos, (in local files, groupware servers, journal entries as blogs, network files, &etc;), please check <xref linkend="managing-resources"/>.
de: Um einzustellen wo &korganizer; seine Kalendertermine, Journaleinträge und Aufgaben speichert, lesen Sie bitte <xref linkend="managing-resources"/>. Dies können z. B. lokale Dateien, Dateien im Netz, Groupware Server, für Journaleinträge Blogs &etc; sein.

source: &korganizer; Main Configuration
de: Hauptkonfiguration von &korganizer;

source: The options dialog lets you configure a number of different areas of &korganizer;.
de: Mit diesem Dialog können Sie &korganizer; vielfältig an Ihre Bedürfnisse anpassen.

source: General page
de: Die Seite Allgemein

source: Personal tab
de: Karteikarte Persönlich

source: The personal options relate to your personal identity, and other miscellaneous things that do not fall under any of the other general categories.
de: Die persönlichen Optionen enthalten die Einstellungen zu Ihrer Identität und diversen anderen Dingen, die in keine andere Kategorie passen.

source: Use email settings from System Settings
de: E-Mail-Einstellungen aus den Systemeinstellungen verwenden

source: Check this box to use your name and email address as set in &systemsettings; (<menuchoice><guimenuitem>Account Details</guimenuitem> <guimenuitem>Password &amp; User Account</guimenuitem></menuchoice>).
de: Markieren Sie dieses Ankreuzfeld, um Namen und E-Mail-Adresse aus den &systemsettings; zu verwenden (<menuchoice><guimenuitem>Benutzerkontodetails</guimenuitem> <guimenuitem>Passwort &amp; Benutzerzugang</guimenuitem></menuchoice>).

source: Full name
de: Vollständiger Name

source: <guilabel>Full name</guilabel> is initially set to <quote>Anonymous</quote> with an email address of <quote>nobody@nowhere</quote>. You can change your name by directly entering it here or you can use your Email Settings from &systemsettings; (see above). This name will be displayed by default as <guilabel>Organizer</guilabel> in to-dos and Events.
de: <guilabel>Vollständiger Name</guilabel> enthält zu Beginn <quote>Anonym</quote> und die E-Mail-Adresse <quote>unbekannt@nirgendwo</quote>. Sie können den Namen entweder direkt hier eingeben oder Ihre E-Mail-Einstellungen aus den &systemsettings; verwenden (siehe unten). Dieser Name wird dann als <guilabel>Organisator</guilabel> bei Aufgaben und Terminen angezeigt.

source: Email address
de: E-Mail-Adresse

source: <guilabel>Email address</guilabel> will be used to identify the owner of the calendar. When another person opens your calendar or events, he/she will not be able to modify it because it will be read-only.
de: Die <guilabel>E-Mail-Adresse</guilabel> wird benutzt, um den Besitzer des Kalenders zu identifizieren. Wenn jemand anderes Ihren Kalender öffnet, kann er/sie nichts darin verändern, denn der Kalender ist dann auf nur-lesen gesetzt.

source: Default email attachment method
de: Standardmethode zum Anhängen von E-Mails an Termine

source: This option allows you to select the way an email is attached to an event. You can attach an email as the complete email including attachments, the email excluding attachments or only a link to the email.
de: In diesem Abschnitt kann eingestellt werden, in welcher Form E-Mails an Ereignisse angehängt werden. Es gibt folgende Möglichkeiten: <guilabel>Immer nachfragen</guilabel>, <guilabel>Nur eine Verknüpfung zur E-Mail hinzufügen</guilabel>, <guilabel>Vollständige E-Mail hinzufügen</guilabel> und <guilabel>E-Mail ohne Anhänge hinzufügen</guilabel>.

source: Note that attaching an email without attachments might invalidate its signature.
de: Beachten Sie, dass das Entfernen von Anhängen aus E-Mails deren Signatur ungültig machen kann.

source: Save tab
de: Karteikarte Speichern

source: Export to &HTML; periodically
de: Regelmäßig als &HTML; exportieren

source: By checking this option, you can order &korganizer; to export your calendar and to-do list to an &HTML; file in your home folder at an interval which defaults to 10 minutes.
de: Durch Anwählen dieser Option veranlassen Sie &korganizer;,in der Standardeinstellung alle 10 Minuten Ihren Kalender und Ihre Aufgabenliste als &HTML;-Datei in Ihrem Persönlichen Ordner zu exportieren.

source: Confirm deletes
de: Löschen bestätigen

source: When you check <guilabel>Confirm deletes</guilabel> box, &korganizer; will ask you to confirm each deletion. If this is not checked, &korganizer; will not ask before deleting events.
de: Wenn Sie <guilabel>Löschen bestätigen</guilabel> ankreuzen, wird &korganizer; bei jedem Löschvorgang zuerst nachfragen. Ansonsten wird &korganizer; nie nachfragen, bevor ein Termin gelöscht wird.

source: New Events, To-dos and Journal Entries Should
de: Neue Ereignisse, Aufgaben und Journaleinträge sollen wie folgt behandelt werden:

source: This option lets you choose between adding new items to the standard calendar or making &korganizer; ask you which calendar should be used to save each new item.
de: Mit dieser Option können Sie neue Termine oder Aufgaben entweder zum Standard-Kalender hinzufügen oder &korganizer; nachfragen lassen, wo sie hingehören.

source: Kolab2 server specificity: It is recommended to choose <guilabel>Be asked which calendar to use</guilabel>, if you intend to use the shared folder functionality of the <guilabel>Kolab</guilabel> server. This will allow you to keep control of which information is available only to you, and which information is published in the shared folders.
de: Nur für den Kolab2-Server: Wir empfehlen, <guilabel>Nachfragen, welcher Kalender benutzt werden soll</guilabel> einzuschalten, wenn Sie gemeinsam genutzte Ordner auf dem <guilabel>Kolab</guilabel>-Server verwenden wollen. Damit behalten Sie die Kontrolle welche Informationen nur für Sie verfügbar sind und welche Informationen in den gemeinsam genutzten Ordnern veröffentlicht werden.

source: Time and Date
de: Zeit und Datum

source: Regional tab
de: Regionales

source: Day begins at
de: Tag beginnt um

source: Select the time you start your day from the drop down list. It could be the time when you usually get up, or the time when you start working. This setting does not prevent you from adding or viewing items before this time, it just sets the time that will be displayed by default on the top of the calendar view. Use the scrollbar to display earlier or later events in the Agenda view.
de: Wählen Sie die Zeit an der Sie Ihren Tag beginnen aus dem Auswahlfeld. Dies kann die Zeit sein, an der Sie üblicherweise aufstehen oder die Zeit zu der Sie anfangen zu arbeiten. Diese Einstellung verhindert nicht Einträge vor dieser Zeit zu setzen oder sich anzusehen. Es ist nur die Uhrzeit mit der der Kalender oben seine Anzeige beginnt. Mit der Bildlaufleiste können Sie frühere oder spätere Termin in der Terminplanansicht anzeigen.

source: Use holiday region
de: Region für Feiertage

source: Select your country from the drop down list, or if it is not listed, select <guilabel>(None)</guilabel>. If your country is selected, &korganizer; will recognize and display its important dates and holidays in the calendar view.
de: Wählen Sie Ihr Land aus dem Auswahlfeld oder, falls es dort nicht erscheint wählen Sie <guilabel>(Keine)</guilabel>. Nach Ihr Land ausgewählt wurde wird &korganizer; die wichtige Tage und Feiertage in der Kalenderansicht anzeigen.

source: Working Period
de: Arbeits-/Bürozeiten

source: The options <guilabel>Daily starting hour</guilabel> and <guilabel>Daily ending hour</guilabel> let you specify when your working day starts and when it ends. &korganizer; sets the working hours apart by marking them with a different color from the non working hours, holidays and non working days.
de: Mit den Optionen <guilabel>Tag beginnt um</guilabel> und <guilabel>Tag endet um</guilabel> können Sie angeben, wann Ihr Arbeitstag beginnt und endet. &korganizer; setzt die Arbeitsstunden ab, indem Sie mit einer anderen Farbe als die Nicht-Arbeitsstunden, Ferien und Nicht-Arbeitstage markiert.

source: Additionally, you have check boxes beside each day of the week. Check the week days that are working days for you, in order to mark the working hours in these days. Checking <guilabel>Exclude holidays</guilabel> prevents &korganizer; from marking the working hours for the holiday days in the region defined in the <guilabel>Use holiday region</guilabel> drop down above.
de: Zusätzlich können Sie noch die Wochentage ankreuzen, an denen Sie arbeiten, um die Arbeitsstunden auf diese Tage einzuschränken. Benutzen Sie <guilabel>An freien Tagen keine Arbeits-/Bürozeiten anzeigen</guilabel> um zu verhindern, das &korganizer; Arbeitsstunden in der von Ihnen definierten <guilabel>Region für Feiertage</guilabel> anzeigt.

source: Default Values tab
de: Voreinstellungen

source: Default appointment time
de: Vorgegebene Verabredungszeit

source: Select the default start time for events from the drop down list. When you choose <link linkend="menu-actions-new-event">New Event</link> from the <link linkend="entering-data-events">Actions Menu</link>, or create an event in some other manner such that &korganizer; cannot guess when you would like your event to start, &korganizer; will put this hour in the start time editor as the default value.
de: Wählen Sie die Standard-Startzeit für Termine aus dem Auswahlfeld. Wenn Sie einen Termin mit <link linkend="entering-data-events">Neuer Termin</link> aus dem <link linkend="menu-actions-new-event">Menü Aktionen</link> oder auf sonstige Weise erstellen, bei der &korganizer; nicht erkennen kann, zu welcher Uhrzeit der Termin beginnen soll, wird &korganizer; die hier eingegebene Uhrzeit als Startzeit annehmen.

source: Default duration of new appointment (HH:MM):
de: Vorgegebene Dauer eines neuen Termins (HH:MM):

source: Select the default duration for events using the spin box. When you choose <link linkend="menu-actions-new-event">New Event</link> from the <link linkend="entering-data-events">Actions Menu</link>, or create an event in some other manner such that &korganizer; cannot guess its duration, &korganizer; will use this as the default value.
de: Wählen Sie die Standardzeit für Termine hier aus. Wenn Sie einen Termin mit <link linkend="entering-data-events">Neuer Termin</link> aus dem <link linkend="menu-actions-new-event">Menü Aktionen</link> oder auf sonstige Weise, bei der &korganizer; nicht erkennen kann wie lange die Verabredung dauert, erstellen, wird &korganizer; die hier eingetragene Dauer annehmen.

source: Reminders
de: Erinnerungen

source: Select a <guilabel>Default reminder time</guilabel> to determine how long before the actual event's scheduled time the reminder will activate.
de: Wählen Sie eine <guilabel>Standard-Erinnerungszeit</guilabel> aus, die festlegt, wie weit im voraus eine Erinnerung zu einem Termin ausgelöst werden soll.

source: Set a file to be used as the default sound file for new reminders. You can always specify another file in the Advanced Reminder accessible from the event or to-do editors.
de: Wählen Sie eine Audio-Datei als Standard für neue Erinnerungen. Sie können jederzeit eine andere Datei im erweiterten Erinnerungsdialog zugänglich über den Termin- oder Aufgabeneditor auswählen.

source: Check the next two boxes if you want to enable reminders for all newly created events or to-dos. You can always turn-off the reminders in the editor dialogs.
de: Aktivieren Sie die nächsten zwei Einstellungen, falls Sie Erinnerungen für alle neu erstellten Termine und Aufgaben aktivieren möchten. Die Erinnerungen können können später immer noch in den Bearbeitungsdialogen abgeschaltet werden.

source: Views
de: Ansichten

source: These options let you configure &korganizer; views:
de: Auf dieser Karteikarte können Sie die Ansichten von &korganizer; einrichten.

source: General tab
de: Allgemein

source: Next x days:
de: Nächste x Tage:

source: This option allows you to change the number of days shown by the <guimenu>Next x Days</guimenu> menu item in the <guimenu>Go</guimenu> menu.
de: Die Option erlaubt es Ihnen die Anzahl der Tage des Menüeintrags <guimenu>Nächste x Tage</guimenu> im Menü <guimenu>Gehe zu</guimenu> zu ändern.

source: Enable tooltips for displaying summaries
de: Kurzinfos für Anzeige von Zusammenfassungen einschalten

source: If your summary for an event is longer than would fit in the current View, the remaining characters are not displayed. Check <guilabel>Enable tooltips for displaying summaries</guilabel> if you want the full summary displayed when hovering the mouse pointer over the appointment for a few seconds.
de: Wenn Ihre Zusammenfassung eines Termins zu lang für die Anzeige ist, wird die Ausgabe am rechten Rand abgeschnitten. Kreuzen Sie <guilabel>Kurzinfos für Anzeige von Zusammenfassungen einschalten</guilabel> an, wenn Sie die ganze Zusammenfassung angezeigt bekommen möchten, sobald die Maus einige Sekunden über der Zusammenfassung bleibt.

source: To-dos use category colors
de: Aufgaben in Kategorienfarben anzeigen

source: Check this box so that to-dos will use category colors and not colors specific to their due, due today or overdue state.
de: Wenn Sie diese Einstellung aktivieren, werden Aufgaben nicht in den Farben der Fälligkeit, sondern in den Kategorienfarben dargestellt..

source: <link linkend="description-view">Date Navigator</link> options:
de: Optionen des <link linkend="description-view">Datumsnavigator</link>:

source: Show items that recur daily
de: Täglich wiederkehrende Termine anzeigen
