Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdepim/korganizer.po
Languages: de

source: Currently, &korganizer; <emphasis>will</emphasis> display items owned by other people and marked as confidential. Other clients may treat them differently, but be careful when publishing private or confidential events: vCalendar and iCalendar are text files, and can be read with any text editor (if someone has read access to them). So if you want to keep items really confidential, make sure you use a resource that only you can access.
de: Zurzeit <emphasis>wird</emphasis> &korganizer; Einträge anzeigen die anderen Leuten gehören und als vertraulich markiert wurden. Andere Klienten können dies anders handhaben. Sie sollten daher vorsichtig sein wenn Sie private oder vertrauliche Daten veröffentlichen: vCalendar und iCalendar sind Textdateien und können mit jedem Textbearbeitungsprogramm gelesen werden, wenn jemand Leseberechtigung hat. Wenn Sie also Einträge wirklich vertraulich bewahren wollen, müssen Sie sich sicher sein das Sie eine Ressource benutzen auf die nur Sie Zugriff haben.

source: Attendees Tab
de: Die Karteikarte Teilnehmer

source: Choose in this tab the people you want to invite to your event.
de: Benutzen Sie diese Karteikarte,um die Personen auszuwählen, die zu dem Termin eingeladen werden.

source: <screeninfo>A screenshot of &korganizer;'s Edit Event dialog - Attendees tab</screeninfo>
de: <screeninfo>Ein Bildschirmfoto vom Dialog <quote>Neuer Termin</quote> - Karteikarte Teilnehmer</screeninfo>

source: <phrase>A screenshot of &korganizer;'s Edit Event dialog - Attendees tab</phrase>
de: <phrase>Ein Bildschirmfoto vom Dialog <quote>Neuer Termin</quote> - Karteikarte Teilnehmer</phrase>

source: <para>A screenshot of &korganizer;'s Edit Event dialog - Attendees tab</para>
de: <para>Ein Bildschirmfoto vom Dialog <quote>Neuer Termin</quote> - Karteikarte Teilnehmer</para>

source: Meeting Organizer:
de: Organisator:

source: Sets the identity corresponding to the organizer of this to-do or event. If &korganizer; is configured to send invitation emails, the identity selected on this combo box will be used when sending these emails. The default identity can be set in the <guilabel>Personal</guilabel> section of the &korganizer; configuration, other identities in the <guilabel>Account Details</guilabel>-&gt; <guilabel>Password &amp; User Account</guilabel> module of the &systemsettings;. In addition, identities are gathered from your &kmail; settings and from your address book. If you choose to set it globally for &kde; in the &systemsettings;, be sure to check the <guilabel>Use email settings from System Settings</guilabel> box in the <guilabel>Personal</guilabel> section of the &korganizer; configuration.
de: Setzen Sie die Identität auf den Organisator dieses Aufgabe oder Termins. Wenn &korganizer; so eingestellt ist das E-Mails zur Einladung gesendet werden, werden die Mails von dieser Identität gesendet. Die Standardidentität kann im Abschnitt <guilabel>Persönlich</guilabel> in den Einstellungen von &korganizer; gesetzt werden. Weitere Identitäten können unter <guilabel>Benutzerkontodetails</guilabel>-&gt;<guilabel>Passwort &amp; Benutzerzugang</guilabel> in den &systemsettings; hinzugefügt werden. Darüber hinaus werden Identitäten aus Ihren Einstellungen für &kmail; und aus Ihrem Adressbuch eingesammelt. Wenn Sie diese global in den &kde;-&systemsettings; setzen wollen, so müssen Sie die Option <guilabel>E-Mail-Einstellungen aus den Systemeinstellungen benutzen</guilabel> im Abschnitt <guilabel>Persönlich</guilabel> in den Einstellungen für &korganizer; auswählen.

source: Attendee list
de: Teilnehmerliste

source: The list in the center of the tab displays the attendees selected for this event, and lets you add attendees by entering the name and mail address, edit or remove them.
de: Die Liste in der Mitte der Karteikarte zeigt alle für diesen Termin ausgewählten Teilnehmer. Sie können Teilnehmer durch Eingabe von Name und E-Mail-Adresse hinzufügen, die Daten bearbeiten oder Teilnehmer entfernen.

source: If the attendee(s) are in your Address Book, you do not have to remember or type his email address to add it to the attendee list. Just click the <guibutton>Select Addressee...</guibutton> button and choose the attendee(s) from the list. Please note that this is the standard &kde; address book, which is also used by &kmail; and can also be called as a separate application (&kaddressbook;).
de: Wenn der Teilnehmer in Ihrem Adressbuch ist, müssen Sie seine E-Mail-Adresse nicht im Kopf haben. Klicken Sie einfach auf <guilabel>Teilnehmer auswählen ...</guilabel> und suchen Sie den Teilnehmer aus der Liste aus. Beachten Sie, dass dies das Standard-&kde;-Adressbuch ist, das auch von &kmail; benutzt wird. Es kann außerdem mit dem Befehl &kaddressbook; separat gestartet werden.

source: Participants
de: Teilnehmer

source: Choose the role of the attendee (Participant, Optional Participant, Observer, Chair) from the drop down menu at the left side of an entry. The role is a simple reminder of what part the attendee plays in this event.
de: Wählen Sie eine Funktion (Teilnehmer, freiwilliger Teilnehmer, Beobachter, Leiter) für den Teilnehmer im Auswahlfeld links neben dem Eintrag aus. Die Funktion soll als kleine Gedächtnisstütze dienen, welche Rolle der Teilnehmer bei diesem Termin einnimmt.

source: Choose the status of the attendee (Needs Action, Accepted, Declined, Tentative, Delegated) from the drop down menu at the right side of an entry. If you use groupware schedule and request responses from your attendees, as you receive the responses the status of the attendee will be updated. If you do not request responses, you will have to update the status manually.
de: Wählen Sie einen Status für den Teilnehmer (Aktivität nötig, Angenommen, Abgelehnt, Vorläufig, Delegiert, Abgeschlossen, In Bearbeitung) im Auswahlfeld rechts neben dem Eintrag. Wenn Sie einen Gruppentermin festlegen und eine Antwort von Ihren Teilnehmern erwarten wird der Status aktualisiert, wenn Sie antworten erhalten. Wenn Sie keine Antworten erwarten, müssen Sie den Status manuell aktualisieren.

source: Request Response
de: Antwort erbitten

source: Select <guilabel>Request Response</guilabel> from the drop down box if this attendee should respond to your schedule plan. Consequently the attendee will be emailed with the event schedule information. A small envelope will appear in the details list to indicate this. This feature is specially useful when groupware scheduling is enabled, as the attendee's status is updated automatically.
de: Wählen Sie <guilabel>Antwort erbitten</guilabel> im Auswahlfeld, wenn der Teilnehmer auf Ihren Termin antworten soll. Logischerweise bekommt der Teilnehmer dazu eine Kopie Ihres Termins per E-Mail. Ein kleiner Briefumschlag wird im Fenster angezeigt, falls Sie diese Option nutzen. Sie macht aber erst wirklich Sinn, sobald Sie einen Gruppentermin veranlassen, da dann der Status automatisch aktualisiert wird.

source: Reminder Tab
de: Karteikarte Erinnerung

source: Reminder
de: Erinnerung

source: Select a default reminder in the drop down box and press <guibutton>Add</guibutton> if &korganizer; should remind you about an event.
de: Wählen Sie eine <guilabel>Standard-Erinnerung</guilabel> im Auswahlfeld und drücken Sie <guibutton>Hinzufügen</guibutton>, wenn &korganizer; Sie an einen Termin erinnern soll.

source: Use the <guibutton>Configure</guibutton> button to open the <guilabel>Edit existing reminder</guilabel> dialog. Using this dialog, you can choose how many minutes, hours or days before or after the events start or end you want to be reminded, you can set repeating intervals for your reminders, and create special reminders that display text, send emails, play sounds or run programs and scripts.
de: Benutzen Sie den Knopf <guibutton>Einrichten</guibutton>, um den Dialog <guilabel>Bestehende Erinnerung bearbeiten</guilabel> zu öffnen. In diesem Dialog können Sie auswählen, wieviele Minuten, Stunden oder Tage Sie vor dem Beginn oder Ende des Termins erinnert werden möchten. Sie können die Wiederholungsintervalle für Ihre Erinnerungen setzen und spezielle Erinnerungen einrichten , die Text anzeigen, E-Mails versenden, Musik spielen oder Programme oder Skripte starten.

source: If you select to run a specific program or script at the reminder time, make sure, however, that you have sufficient rights to run that program; if you do not, the program will not run.
de: Haben Sie ein bestimmtes Programm oder Skript ausgewählt, das als Erinnerung ausgeführt werden soll, überprüfen Sie ob Sie ausreichende Rechte zur Ausführung haben. Fehlen Ihnen diese Berechtigungen, kann das Programm oder Skript nicht starten.

source: Recurrence tab
de: Karteikarte Wiederholung

source: Some events take place regularly. You can specify their exact scheduling here.
de: Einige Termine finden regelmäßig statt. Hier können Sie einen genauen Zeitplan eingeben.

source: <screeninfo>A screenshot of &korganizer;'s Edit Event dialog - Recurrence tab</screeninfo>
de: <screeninfo>Ein Bildschirmfoto vom Dialog <quote>Termin bearbeiten</quote> - Karteikarte <quote>Wiederholung</quote></screeninfo>

source: <phrase>A screenshot of &korganizer;'s Edit Event dialog - Recurrence tab</phrase>
de: <phrase>Ein Bildschirmfoto vom Dialog <quote>Termin bearbeiten</quote> - Karteikarte <quote>Wiederholung</quote></phrase>

source: <para>A screenshot of &korganizer;'s Edit Event dialog - Recurrence tab</para>
de: <para>Ein Bildschirmfoto vom Dialog <quote>Termin bearbeiten</quote> - Karteikarte <quote>Wiederholung</quote></para>

source: To activate the settings, start by selecting a recurrence rule at the right of <guilabel>Repeats</guilabel> from the drop down box. If <guilabel>Never</guilabel> is selected, you are not able to make any changes on this tab.
de: Um die Einstellungen zu aktivieren, wählen Sie als erstes eine Regel rechts neben <guilabel>Wiederholungen </guilabel> aus dem Auswahlfeld. Ist hier <guilabel>Nie</guilabel> eingestellt, können Sie auf dieser Seite keine Änderungen vornehmen.

source: Recurrence Rule
de: Wiederholungsregel

source: Choose if you want to repeat this event daily, weekly, monthly or yearly. More detailed options are as follows:
de: Wählen Sie aus, ob der Termin täglich, wöchentlich, monatlich oder jährlich auftritt. Detaillierte Beschreibung wie folgt:

source: Daily
de: Täglich

source: Specify whether the event occurs every day (1), every other day (2) and so on.
de: Geben Sie an, ob der Termin jeden Tag (1), jeden zweiten Tag (2) &etc; auftritt.

source: Weekly
de: Wöchentlich

source: Specify whether the event occurs every week (1), every other week (2) and so on. Also specify the days (Sunday ... Monday) on which the event occurs.
de: Geben Sie an, ob der Termin jede Woche (1), jede zweite Woche (2) &etc; auftritt. Geben Sie auch die Tage (So ... Sa) an, an denen der Termin stattfindet.

source: Monthly
de: Monatlich

source: You can either have the event occur on the same day of the month, or in a specific week on a specific day of the week. You need to choose between these two possibilities. By default, &korganizer; assumes you want to repeat on the same calendar day of the month (for instance the 15th). You can also adjust the period, so you can repeat monthly, tri-monthly and so on.
de: Sie können einen Termin entweder am selben Kalendertag jeden Monats oder in einer bestimmten Woche an einem bestimmten Wochentag wiederholen lassen. Sie müssen zwischen den beiden Möglichkeiten auswählen. Standardmäßig nimmt &korganizer; an, dass Sie die Wiederholung für den Kalendertag definieren (z.B am 15.). Sie können auch das Intervall einstellen, also monatlich, alle 2 Monate &etc;

source: Yearly
de: Jährlich

source: This is similar to Monthly. You need to choose whether or not you are indicating a calendar day of the year (&eg;, the 250th day of the year), in a specific week on a specific day of the week of a month (&eg;, the 2nd Tuesday of March), or the day of the month in a particular month of the year. By default, &korganizer; assumes you mean the day of the month. You can adjust the period to reflect events that occur bi-annually, every four years, and so on.
de: Dies funktioniert fast wie monatliche Wiederholungen. Sie müssen auswählen, ob der Termin an einem Kalendertag des Jahres auftritt, &eg; dem 250. Tag des Jahres, in einer bestimmten Woche oder an einem bestimmten Tag der Woche eines Monats, &eg; am 2. Dienstag im März, an einem Tag in einem bestimmten Monat des Jahres. Der Standard ist der Tag im Monat. Sie können auch hier ein Intervall wählen, also den Termin jährlich, jedes zweite Jahr &etc; wiederholen lassen.

source: Recurrence Range
de: Wiederholungszeitraum

source: By default, events which repeat will do so forever; there is no <quote>end</quote> to the repetition. This may or may not be desirable, so you are able to terminate the repetition by selecting an end date or a number of occurrences.
de: Als Voreinstellung werden sich wiederholende Termine ewig wiederholt, es gibt keine letzte Ausführung. Das ist aber vielleicht nicht immer gewünscht, deshalb gibt es zwei Wege, wie Sie die Wiederholung beenden können: entweder mit einem Enddatum, oder durch Angabe der Gesamtzahl an Vorkommen.

source: Exceptions
de: Ausnahmen

source: You may have a very nice recurrence rule set up, but realize that there are a few exceptions. If you set up your college class schedule for instance, you may want to make exceptions for holidays and the like. In this area, you can add, change, and delete dates from the list of exceptions (&ie; times when even if the recurrence rule matches, the event will <emphasis>not be scheduled</emphasis>). Pick a date with the date selector, and press <guibutton>Add</guibutton> to include it. For removing dates, highlight them in the box on the right side, and then click <guibutton>Delete</guibutton>.
de: Auch bei einem perfekt geplanten Termin kann es Ausnahmen geben, etwa bei einem Stundenplan, der in den Ferien nicht angewendet werden soll. Daher können Sie in diesem Eingabefeld verschiedene Ausnahmen für die Wiederholungsregeln erstellen, ändern und löschen an Zeiten, an denen der Termin nicht auftreten soll <emphasis>obwohl er geplant war</emphasis>. Zum Hinzufügen suchen Sie sich einfach ein Datum aus der Liste aus und klicken anschließend auf <guibutton>Hinzufügen</guibutton> um es in die Liste aufzunehmen. Um ein Datum zu löschen klicken Sie es in der Liste an und dann auf <guibutton>Löschen</guibutton>.

source: Attachments
de: Anhänge

source: Events and to-dos can contain attachments. Attachments can either be stored as links or inline. To add an attachment press the <guibutton>Add</guibutton> button.
de: Termine und Aufgaben können Anhänge enthalten. Diese Anhänge werden entweder als Verknüpfung oder im Text eingebettet gespeichert. Um einen Anhang hinzuzufügen, klicken Sie auf den Knopf <guibutton>Hinzufügen</guibutton>.

source: <screeninfo>A screenshot of &korganizer;'s Edit Event dialog - Attachments tab</screeninfo>
de: <screeninfo>Ein Bildschirmfoto vom Dialog <quote>Termin bearbeiten</quote> - Karteikarte <quote>Anhänge</quote></screeninfo>

source: <phrase>A screenshot of &korganizer;'s Edit Event dialog - Attachments tab</phrase>
de: <phrase>Ein Bildschirmfoto vom Dialog <quote>Termin bearbeiten</quote> - Karteikarte <quote>Anhänge</quote></phrase>

source: <para>A screenshot of &korganizer;'s Edit Event dialog - Attachments tab</para>
de: <para>Ein Bildschirmfoto vom Dialog <quote>Termin bearbeiten</quote> - Karteikarte <quote>Anhänge</quote></para>

source: Checking <guilabel>Store attachment inline</guilabel> will cause the attachment to be stored inside your calendar, which can take a lot of space depending on the size of the attachment. If this option is not checked, then only a link pointing to the attachment will be stored. Do not use a link for attachments that change often or may be moved (or removed) from their current location.
de: Ist <guilabel>Anhang eingebettet speichern</guilabel> aktiv, wird der Anhang in Ihrem Kalender gespeichert, was zu sehr großem Platzbedarf führen kann, abhängig von der Größe der Anhänge. Ist die Einstellung nicht aktiviert, wird nur eine Verknüpfung zu der angehängten Datei gespeichert. Verwenden Sie die Verknüpfungsfunktion nicht, wenn es sich um einen öfters ändernden Anhang handelt, der verschoben oder entfernt werden könnte.

source: The following actions in the context menu are provided to work with attachments:
de: Im Kontextmenü gibt es folgende Aktionen zur Bearbeitung von Anhängen:

source: Open
de: Öffnen

source: Display the selected attachment with the associated application.
de: Zeigt den ausgewählten Anhang mit dem zugehörigen Programm an.

source: Save As...
de: Speichern unter ...

source: Allows to save an existing attachment with a different name.
de: Ermöglicht die Speicherung eines vorhandenen Anhangs unter einem anderen Namen.

source: <guimenuitem>Copy</guimenuitem>, <guimenuitem>Cut</guimenuitem> and <guimenuitem>Paste</guimenuitem>
de: <guimenuitem>Kopieren</guimenuitem>, <guimenuitem>Ausschneiden</guimenuitem> and <guimenuitem>Einfügen</guimenuitem>

source: Allows to copy, cut and paste to and from the clipboard.
de: Ermöglicht das Kopieren, Ausschneiden, Einfügen unter Verwendung der Zwischenablage.

source: Remove
de: Entfernen

source: Deletes the selected attachment.
de: Entfernt den ausgewählten Anhang.

source: Properties...
de: Eigenschaften ...

source: Allows to change an existing attachment.
de: Ermöglicht die Bearbeitung eines vorhandenen Anhangs.

source: Manage Templates
de: Vorlagen verwalten

source: The <guibutton>Manage Templates</guibutton> button opens a dialog which enables you to save the current event as a template, so that you can reuse the data entered for future events. As an example you can save a template for a meeting that takes place at the same location and with the same people.
de: Mit dem Knopf <guilabel>Vorlage verwalten</guilabel> können Sie den aktuelle Termin als Vorlage speichern, sodass Sie die eingegebenen Daten in der Zukunft wieder verwenden können. Beispielsweise könnten Sie eine Vorlage für ein Treffen speichern, das regelmäßig am gleichen Ort und mit den gleichen Teilnehmern statt findet.

source: With the <guibutton>Apply</guibutton> button you can use an existing template for your event. Continuing the example in the preceding paragraph you can specify the agenda of the meeting.
de: Mit dem Knopf <guilabel>Anwenden</guilabel> können Sie eine existierende Vorlage für Ihren Termin laden. Um im Beispiel aus dem vorigen Absatz zu bleiben, können Sie die Tagesordnung des Treffens angeben.

source: To-dos
de: Aufgaben

source: The To-do List is a place for you to write down notes to yourself about things that you need to do. To-dos are tasks, that may or may not be scheduled. There are short-term and long-term to-dos. For instance you should go to a hairdresser within a week, and you should sell your old car within a year. You likely do not want a reminder go off at a particular time, you just want to have a list of things that you must do, and dates when they must be finished at the latest (date due).
de: Die Aufgabenliste bietet die Möglichkeit, Nachrichten über unerledigte Dinge für Sie selbst zu hinterlassen. Aufgaben können, müssen aber nicht, einen Endtermin haben. Es gibt Kurzzeit- und Langzeitaufgaben. Sie wollen zum Beispiel innerhalb einer Woche zum Friseur und wollen Ihr Auto innerhalb eines Jahres verkaufen. Es braucht keine Erinnerung zu einer bestimmten Zeit ausgelöst werden, es handelt sich nur um eine Liste mit Sachen, die Sie erledigen müssen, und einem Datum, bis zu dem Sie spätestens fertig sein müssen (Termin).

source: To enter a new to-do, choose <menuchoice><guimenu>Actions</guimenu><guimenuitem>New To-do...</guimenuitem></menuchoice>. A window with five tabs at the bottom will appear.
de: Um eine neue Aufgabe zu erstellen, klicken Sie auf <menuchoice><guimenu>Aktionen</guimenu><guimenuitem>Neue Aufgabe ...</guimenuitem></menuchoice>. Ein Fenster mit fünf Karteikarten unten wird eingeblendet.

source: <screeninfo>A screenshot of &korganizer;'s Edit To-do dialog</screeninfo>
de: <screeninfo>Ein Bildschirmfoto vom Dialog <quote>Neue Aufgabe</quote></screeninfo>

source: <phrase>A screenshot of &korganizer;'s Edit To-do dialog</phrase>
de: <phrase>Ein Bildschirmfoto vom Dialog <quote>Neue Aufgabe</quote></phrase>

source: <para>A screenshot of &korganizer;'s Edit To-do dialog</para>
de: <para>Ein Bildschirmfoto vom Dialog <quote>Neue Aufgabe</quote></para>

source: This tab shares a lot of options with the <guilabel>Edit Events</guilabel> dialog, but has some additional items for to-dos:
de: Auf dieser Karteikarte finden Sie viele Einstellungen wie im Dialog <guilabel>Termine bearbeiten</guilabel>, aber mit einigen zusätzlichen Einträgen für Aufgaben:

source: Completion
de: Erledigt

source: This is a percent completed pull down menu initially set at 0% complete. Later on, you can indicate your progress by adjusting the percent completed in steps of 10%.
de: Diese Auswahlliste zeigt die prozentuale Vervollständigung der Aufgabe an. Sie ist anfangs auf 0% gesetzt. Man kann seinen Arbeitsfortschritt durch Anpassung der Anzeige in 10%-Schritten dokumentieren.

source: Priority
de: Priorität

source: Assign a priority to your to-do. This drop down menu offers priorities from one to nine, one being the highest. Initially to-dos are set to priority five (medium).
de: Zuweisung einer Priorität für eine Aufgabe. Diese Auswahlliste bietet Prioritätswerte zwischen Eins und Neun an, wobei Eins die höchste Priorität bedeutet. Der Standardwert für Aufgaben ist der Wert Fünf (mittelmäßig).

source: Required Fields
de: Erforderliche Eingaben

source: This is an overview of what fields are required and what fields can be empty when entering events and to-dos:
de: Dieser Überblick zeigt, welche Angaben bei der Eingabe von Terminen und Aufgaben unbedingt benötigt werden und welche ausgelassen werden können:

source: In the <guilabel>General</guilabel> Tab, you should at least fill the <guilabel>Title</guilabel> field and the description (the large rectangle), even though neither is mandatory. If you set a <guilabel>Reminder</guilabel>, you should also specify the time, and either the sound to be played or the program to be run.
de: Auf der Karteikarte <guilabel>Allgemein</guilabel> müssen Sie das Feld <guilabel>Titel</guilabel> und die Beschreibung (das große Textfeld) ausfüllen, obwohl beides nicht strikt vorgeschrieben ist. Wenn Sie <guilabel>Erinnerung</guilabel> auswählen, sollten Sie auch eine Zeit und entweder eine Audio-Datei oder ein auszuführendes Programm angeben.

source: The <guilabel>Attendees</guilabel> tab may be left completely empty.
de: Die Karteikarte <guilabel>Teilnehmer</guilabel> kann komplett leer gelassen werden.

source: The <guilabel>Recurrence</guilabel> tab must only be filled if you select a daily, weekly, monthly or yearly repeat.
de: Die Karteikarte <guilabel>Wiederholung</guilabel> muss nur ausgefüllt werden, falls Sie eine tägliche, wöchentliche, monatliche oder jährliche Wiederholung eingeben möchten.

source: The <guilabel>Attachments</guilabel> dialog may be left completely empty.
de: Der Dialog <guilabel>Anhänge</guilabel> kann komplett leer gelassen werden.

source: Group Scheduling
de: Gruppenplanung
