Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdepim/korganizer.po
Languages: de

source: <shortcut> <keysym>Del</keysym> </shortcut> <guimenu>Actions</guimenu> <guimenuitem>Delete</guimenuitem>
de: <shortcut> <keysym>Entf</keysym> </shortcut> <guimenu>Aktionen</guimenu> <guimenuitem>Löschen</guimenuitem>

source: Choose <guilabel>Delete</guilabel> to <action>remove the currently selected journal entry, event or to-do.</action>
de: Mit <guilabel>Löschen</guilabel> <action>können Sie den ausgewählten Journaleintrag, den Termin oder die Aufgabe löschen.</action>

source: <guimenu>Actions</guimenu> <guimenuitem>Make Sub-to-do Independent</guimenuitem>
de: <guimenu>Aktionen</guimenu> <guimenuitem>Unteraufgabe verselbständigen</guimenuitem>

source: Choose <guilabel>Make Sub-to-do Independent</guilabel> to detach the currently selected sub-to-do item from its parent and make it an independent to-do item.
de: Mit <guilabel>Unteraufgabe verselbständigen</guilabel> können Sie die ausgewählte Unteraufgabe von Ihrem Vaterobjekt abhängen und sie dadurch unabhängig machen.

source: Schedule
de: Planer

source: <guimenu>Schedule</guimenu> <guimenuitem>Publish Item Information...</guimenuitem>
de: <guimenu>Planer</guimenu> <guimenuitem>Informationen zum Eintrag veröffentlichen...</guimenuitem>

source: Email the selected event, to-do or journal entry in the iCalendar format.
de: Versendet das ausgewählte Ereignis, die Aufgabe oder den Journaleintrag im iCalendar Format über E-Mail.

source: For more information about this action, please refer to <xref linkend="publish"/>.
de: Weitere Informationen hierzu finden Sie unter <xref linkend="publish"/>.

source: <guimenu>Schedule</guimenu> <guimenuitem>Send Invitation to Attendees</guimenuitem>
de: <guimenu>Planer</guimenu> <guimenuitem>Einladung an die Teilnehmer verschicken</guimenuitem>

source: Send the selected to-do or event to the attendees, and, if necessary, request a response from them.
de: Sendet die ausgewählte Aufgabe oder den Termin an die Teilnehmer und erwartet, falls nötig, eine Antwort von ihnen.

source: For more information about this action, please refer to <xref linkend="request"/>.
de: Weitere Informationen hierzu finden Sie unter <xref linkend="request"/>.

source: <guimenu>Schedule</guimenu> <guimenuitem>Send Status Update</guimenuitem>
de: <guimenu>Planer</guimenu> <guimenuitem>Aktualisierung versenden</guimenuitem>

source: If you changed your status as an attendee, choose this menu item to send your updated status (accepted, tentative, &etc;) to the item's organizer.
de: Wenn Sie Ihren Status als Teilnehmer ändern, sollten Sie diesen Menüeintrag auswählen, um Ihren aktuellen Status (Akzeptiert, Unter Vorbehalt, &etc;) an den Organisator zu versenden.

source: For more information about this action, please refer to <xref linkend="reply"/>.
de: Weitere Informationen hierzu finden Sie unter <xref linkend="reply"/>.

source: <guimenu>Schedule</guimenu> <guimenuitem>Send Cancellation to Attendees</guimenuitem>
de: <guimenu>Planer</guimenu> <guimenuitem>Absage an die Teilnehmer verschicken</guimenuitem>

source: If you plan to cancel an event or to-do, select it, and choose this menu item to notify the attendees about the cancellation.
de: Wenn Sie planen einen Termin oder eine Aufgabe abzusagen, sollten Sie diesen Menüeintrag benutzen, um die Teilnehmer darüber zu informieren.

source: For more information about this action, please refer to <xref linkend="cancel"/>.
de: Weitere Informationen hierzu finden Sie unter <xref linkend="cancel"/>.

source: <guimenu>Schedule</guimenu> <guimenuitem>Request Update</guimenuitem>
de: <guimenu>Planer</guimenu> <guimenuitem>Nach Aktualisierung fragen</guimenuitem>

source: Request the latest version of the selected event or to-do from the organizer.
de: Holt die neuestes Version des aktuellen Termins oder der aktuellen Aufgabe vom Organisator.

source: For more information about this action, please refer to <xref linkend="refresh"/>.
de: Weitere Informationen hierzu finden Sie unter <xref linkend="refresh"/>.

source: <guimenu>Schedule</guimenu> <guimenuitem>Request Change</guimenuitem>
de: <guimenu>Planer</guimenu> <guimenuitem>Änderung vorschlagen</guimenuitem>

source: Send an alternative proposal to the organizer of the selected event or to-do.
de: Sendet einen Gegenvorschlag an den Organisator des Termins oder der Aufgabe.

source: For more information about this action, please refer to <xref linkend="counter"/>.
de: Weitere Informationen hierzu finden Sie unter <xref linkend="counter"/>.

source: <guimenu>Schedule</guimenu> <guimenuitem>Mail Free Busy Information...</guimenuitem>
de: <guimenu>Planer</guimenu> <guimenuitem>Frei/Belegt-Information per E-Mail versenden</guimenuitem>

source: Email your Free Busy information to one or more email addresses.
de: Versendet Ihre Frei/Belegt-Informationen an eine oder mehrere E-Mail Adressen.

source: For more information about this action, please refer to <xref linkend="free-busy"/>.
de: Weitere Informationen hierzu finden Sie unter <xref linkend="free-busy"/>.

source: <guimenu>Schedule</guimenu> <guimenuitem>Upload Free Busy Information</guimenuitem>
de: <guimenu>Planer</guimenu> <guimenuitem>Frei/Belegt-Information veröffentlichen</guimenuitem>

source: Upload your Free Busy information to the groupware server. Other users will then be able to retrieve the information.
de: Ermöglicht Ihnen Ihre Frei/Belegt-Informationen auf einen Groupware-Server hochzuladen. Andere Benutzer können diese Informationen dann abholen.

source: Settings
de: Einstellungen

source: <guimenu>Settings</guimenu> <guisubmenu>Toolbars Shown</guisubmenu>
de: <guimenu>Einstellungen</guimenu> <guisubmenu>Angezeigte Werkzeugleisten</guisubmenu>

source: Click the menu items of this submenu to show or hide &korganizer; toolbars.
de: Benutzen Sie die Untermenüs dieses Eintrags um &korganizer;s Werkzeugleisten ein- oder auszublenden.

source: <guimenu>Settings</guimenu> <guimenuitem>Show Statusbar</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>Statusleiste anzeigen</guimenuitem>

source: <action>Choose this menu item to toggle the display of the status bar on and off</action>.
de: <action>Benutzen Sie diesen Menüeintrag um die Anzeige der Statusleiste ein- und auszublenden</action>.

source: <guimenu>Settings</guimenu> <guisubmenu>Sidebar</guisubmenu>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>Seitenleiste</guimenuitem>

source: <action>Click the menu items of this submenu to show or hide &korganizer; sidebar components</action>. Note that the sidebar is visible only when <link linkend="config-main-views">the current view does not use the full window.</link>
de: <action>Benutzen Sie die Untermenüs dieses Eintrags um die Komponenten der Seitenleiste von &korganizer; ein- und auszublenden</action>. Beachten Sie dabei dass die Seitenleiste nur sichtbar ist, wenn <link linkend="config-main-views">die aktuelle Ansicht nicht das komplette Fenster benutzt.</link>

source: <guimenu>Settings</guimenu> <guimenuitem>Configure Date &amp; Time...</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>Datum und Uhrzeit einstellen...</guimenuitem>

source: <action>Click this menu item to set the desktop date and time formats</action>. Note that this setting is shared between other desktop applications.
de: <action>Benutzen Sie diesen Menüeintrag um das Format für die Zeit und Datumseinstellungen der Arbeitsfläche zu setzen</action>. Beachten Sie das diese Einstellungen für alle Programme gilt.

source: <guimenu>Settings</guimenu> <guisubmenu>Manage View Filters...</guisubmenu>
de: <guimenu>Einstellungen</guimenu> <guisubmenu>Ansichtsfilter verwalten ...</guisubmenu>

source: <action>Choose this menu item to open the <guilabel>Edit Filters</guilabel> dialog</action>. Using this dialog, you can create, delete and edit filters that will affect which items will be displayed by &korganizer;.
de: <action>Benutzen Sie diesen Menüeintrag, um den Dialog <guilabel>Kalenderfilter bearbeiten</guilabel> zu öffnen</action>. Mit diesem Dialog können Sie Filter erstellen, löschen und bearbeiten, um die Einträge die &korganizer; anzeigt zu verändern.

source: <guimenu>Settings</guimenu> <guimenuitem>Manage Categories...</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>Kategorien verwalten ...</guimenuitem>

source: <action>Choose this menu item to open the <guilabel>Edit Categories</guilabel> dialog</action>. Using this dialog, you can create, delete and edit calendar item categories. Categories are used to organize your events and to-dos in related groups.
de: <action>Benutzen Sie diesen Menüeintrag, um den Dialog <guilabel>Kategorien bearbeiten</guilabel> zu öffnen</action>. Mit diesem Dialog können Sie die Kategorien für Ihre Kalendereinträge erstellen, löschen und bearbeiten. Kategorien werden benutzt um Ihre Termine und Aufgaben in zusammengehörige Gruppen zu organisieren.

source: <guimenu> Settings</guimenu> <guimenuitem>Configure Shortcuts...</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>Kurzbefehle festlegen ...</guimenuitem>

source: <action>Choose this menu item to open the <guilabel>Configure Shortcuts</guilabel> dialog</action>. This dialog allows you to assign shortcuts to &korganizer; actions, and configure the shortcuts already assigned.
de: <action>Benutzen Sie diesen Menüeintrag, um den Dialog <guilabel>Kurzbefehle festlegen</guilabel> zu öffnen</action>. Dieser Dialog ermöglicht es Ihnen &korganizer; Aktionen Tastaturkürzel zuzuweisen und die schon konfigurierten Tastaturkürzel neu zuzuweisen.

source: <guimenu> Settings</guimenu> <guimenuitem>Configure Toolbars...</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>Werkzeugleisten einrichten ...</guimenuitem>

source: <action>Choose this menu item to open the <link linkend="config-toolbars"><guilabel>Configure Toolbars</guilabel> dialog</link></action>. This dialog allows you to add, remove and change the order of the actions in &korganizer; toolbars.
de: <action>Benutzen Sie diesen Menüeintrag, um den Dialog <link linkend="config-toolbars"><guilabel>Werkzeugleisten einrichten</guilabel> zu öffnen</link></action>. Dieser Dialog erlaubt es Ihnen Aktionen hinzuzufügen, zu entfernen und die Reihenfolge der Aktionen in den Werkzeugleisten von &korganizer; zu ändern.

source: <guimenu> Settings</guimenu><guimenuitem>Configure &korganizer;...</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>&korganizer; einrichten ...</guimenuitem>

source: Choose the <menuchoice><guimenu>Settings</guimenu> <guimenuitem>Configure &korganizer;...</guimenuitem> </menuchoice> menu item to display &korganizer; <link linkend="config-main">Configure dialog</link>.
de: Wählen Sie den Menüeintrag <menuchoice><guimenu>Einstellungen</guimenu> <guimenuitem>&korganizer; einrichten...</guimenuitem> </menuchoice> um den &korganizer; <link linkend="config-main">Einrichten Dialog</link> zu öffnen.

source: For more information about this action, please refer to <xref linkend="config-main"/>.
de: Weitere Informationen hierzu finden Sie unter <xref linkend="config-main"/>.

source: Help
de: Hilfe

source: HotKeys
de: Kurzbefehle

source: This is a reference to all hotkeys and their corresponding description in the handbook.
de: Dies ist eine komplette Übersicht über die Kurzbefehle mit Verknüpfungen zu ihrer Funktion.

source: Hotkeys Sorted Alphabetically
de: Kurzbefehle alphabetisch sortiert

source: Hotkey
de: Kurzbefehl

source: Description
de: Beschreibung

source: <link linkend="menu-edit-copy"><menuchoice><guimenu>Edit</guimenu> <guimenuitem>Copy</guimenuitem></menuchoice></link> equivalent; copy the selection to clipboard.
de: <link linkend="menu-edit-copy"><menuchoice><guimenu>Bearbeiten</guimenu> <guimenuitem>Kopieren</guimenuitem></menuchoice></link> kopiert die Auswahl in die Zwischenablage.

source: <link linkend="menu-edit-find"><menuchoice><guimenu>Edit</guimenu> <guimenuitem>Find</guimenuitem></menuchoice></link> equivalent; Find data in current calendar.
de: <link linkend="menu-edit-find"><menuchoice><guimenu>Bearbeiten</guimenu> <guimenuitem>Suchen</guimenuitem></menuchoice></link> sucht Daten im aktuellen Kalender.

source: <menuchoice><guimenu>Help</guimenu> <guimenuitem>Contents</guimenuitem></menuchoice> equivalent; help for &korganizer;.
de: <menuchoice><guimenu>Hilfe</guimenu> <guimenuitem>Inhalt</guimenuitem></menuchoice> zeigt die Hilfe zu &korganizer; an.

source: <link linkend="menu-file-open"><menuchoice><guimenu>File</guimenu> <guimenuitem>Open</guimenuitem></menuchoice></link> equivalent; open a calendar file in the current window.
de: <link linkend="menu-file-open"><menuchoice><guimenu>Datei</guimenu> <guimenuitem>Öffnen</guimenuitem></menuchoice></link> öffnet eine Kalenderdatei im aktuellen Fenster.

source: <link linkend="menu-file-print"><menuchoice><guimenu>File</guimenu> <guimenuitem>Print</guimenuitem></menuchoice></link> equivalent; print current calendar.
de: <link linkend="menu-file-print"><menuchoice><guimenu>Datei</guimenu> <guimenuitem>Drucken</guimenuitem></menuchoice></link> druckt den aktuellen Kalender.

source: <link linkend="menu-file-quit"><menuchoice><guimenu>File</guimenu> <guimenuitem>Quit</guimenuitem></menuchoice></link> equivalent; quit current calendar.
de: <link linkend="menu-file-quit"><menuchoice><guimenu>Datei</guimenu> <guimenuitem>Beenden</guimenuitem></menuchoice></link> beendet den aktuellen Kalender.

source: <link linkend="menu-edit-paste"><menuchoice><guimenu>Edit</guimenu> <guimenuitem>Paste</guimenuitem></menuchoice></link> equivalent; paste data from clipboard.
de: <link linkend="menu-edit-paste"><menuchoice><guimenu>Bearbeiten</guimenu> <guimenuitem>Einfügen</guimenuitem></menuchoice></link> fügt Daten von der Zwischenablage ein.

source: <link linkend="menu-edit-cut"><menuchoice><guimenu>Edit</guimenu> <guimenuitem>Cut</guimenuitem></menuchoice></link> equivalent; cut the selection to the clipboard.
de: <link linkend="menu-edit-cut"><menuchoice><guimenu>Bearbeiten</guimenu> <guimenuitem>Ausschneiden</guimenuitem></menuchoice></link> schneidet die aktuelle ausgewählten Daten aus und fügt sie in die Zwischenablage ein.

source: Hotkeys Sorted by Function
de: Kurzbefehle nach Funktion sortiert

source: <emphasis>Copy:</emphasis> <link linkend="menu-edit-copy"> <menuchoice> <guimenu>Edit</guimenu> <guimenuitem>Copy</guimenuitem></menuchoice> </link> equivalent; copy the selection to clipboard.
de: <emphasis>Kopieren:</emphasis> <link linkend="menu-edit-copy"> <menuchoice> <guimenu>Bearbeiten</guimenu> <guimenuitem>Kopieren</guimenuitem></menuchoice> </link> kopiert die aktuelle Auswahl in die Zwischenablage.

source: <emphasis>Cut:</emphasis> <link linkend="menu-edit-cut"> <menuchoice> <guimenu>Edit</guimenu> <guimenuitem>Cut</guimenuitem></menuchoice> </link> equivalent; cut the selection to the clipboard.
de: <emphasis>Ausschneiden:</emphasis> <link linkend="menu-edit-cut"> <menuchoice> <guimenu>Bearbeiten</guimenu> <guimenuitem>Ausschneiden</guimenuitem></menuchoice> </link> schneidet die aktuelle Auswahl aus und fügt die Daten in die Zwischenablage ein.

source: <emphasis>Find:</emphasis> <link linkend="menu-edit-find"> <menuchoice> <guimenu>Edit</guimenu> <guimenuitem>Find</guimenuitem></menuchoice></link> equivalent; Find data in current calendar.
de: <emphasis>Suchen:</emphasis> <link linkend="menu-edit-find"> <menuchoice> <guimenu>Bearbeiten</guimenu> <guimenuitem>Suchen</guimenuitem></menuchoice></link> sucht Daten im aktuellen Kalender.

source: <emphasis>Help:</emphasis> <menuchoice> <guimenu>Help</guimenu> <guimenuitem>Contents</guimenuitem></menuchoice> equivalent; help for &korganizer;.
de: <emphasis>Hilfe:</emphasis> <menuchoice> <guimenu>Hilfe</guimenu> <guimenuitem>Inhalte</guimenuitem></menuchoice> zeigt die Hilfe zum &korganizer; an.

source: <emphasis>Open:</emphasis> <link linkend="menu-file-open"> <menuchoice> <guimenu>File</guimenu> <guimenuitem>Open</guimenuitem></menuchoice></link> equivalent; open a calendar file in the current window.
de: <emphasis>Öffnen:</emphasis> <link linkend="menu-file-open"> <menuchoice> <guimenu>Datei</guimenu> <guimenuitem>Öffnen</guimenuitem></menuchoice></link> öffnet eine Kalenderdatei im aktuellen Fenster.

source: <emphasis>Paste:</emphasis> <link linkend="menu-edit-paste"> <menuchoice> <guimenu>Edit</guimenu> <guimenuitem>Paste</guimenuitem></menuchoice></link> equivalent; paste data from clipboard.
de: <emphasis>Einfügen:</emphasis> <link linkend="menu-edit-paste"> <menuchoice> <guimenu>Bearbeiten</guimenu> <guimenuitem>Einfügen</guimenuitem></menuchoice></link> fügt Daten von der Zwischenablage ein.

source: <emphasis>Print:</emphasis> <link linkend="menu-file-print"> <menuchoice> <guimenu>File</guimenu> <guimenuitem>Print</guimenuitem> </menuchoice> </link> equivalent; print current calendar.
de: <emphasis>Drucken:</emphasis> <link linkend="menu-file-print"> <menuchoice> <guimenu>Datei</guimenu> <guimenuitem>Drucken</guimenuitem> </menuchoice> </link> druckt den aktuellen Kalender.

source: <emphasis>Quit:</emphasis> <link linkend="menu-file-quit"> <menuchoice> <guimenu>File</guimenu> <guimenuitem>Quit</guimenuitem></menuchoice></link> equivalent; quit current calendar.
de: <emphasis>Beenden:</emphasis> <link linkend="menu-file-quit"> <menuchoice> <guimenu>Datei</guimenu> <guimenuitem>Beenden</guimenuitem></menuchoice></link> beendet den aktuellen Kalender.

source: Action Buttons
de: Schaltknöpfe

source: Many windows contain <guibutton>Default</guibutton>, <guibutton>Delete</guibutton>, <guibutton>OK</guibutton>, <guibutton>Apply</guibutton>, and <guibutton>Cancel</guibutton> buttons. With these buttons you can decide whether the data that you entered into the window will be saved or forgotten.
de: Viele Fenster enthalten Knöpfe wie <guibutton>Standard</guibutton>, <guibutton>Speichern</guibutton>, <guibutton>OK</guibutton>, <guibutton>Anwenden</guibutton> und <guibutton>Abbrechen</guibutton>. Mit diesen Knöpfen können Sie entscheiden, ob die von Ihnen eingegebenen Daten gespeichert oder verworfen werden.

source: Default
de: Standard

source: If you click the <guibutton>Default</guibutton> button, changes you have made will be forgotten, and all choices will be returned to their default values.
de: Ein Druck auf den Knopf <guibutton>Standard</guibutton> führt dazu, dass alle Werte auf ihre Standardeinstellung gesetzt werden und die Änderungen des Benutzers verloren gehen.

source: Delete
de: Löschen

source: Click <guibutton>Delete</guibutton> to completely remove the event or data that you are editing from the calendar.
de: Klicken Sie auf <guibutton>Löschen</guibutton> um den ausgewählten Termin komplett oder den Termin, den Sie gerade im Kalender bearbeiten, zu löschen.

source: When you click the <guibutton>OK</guibutton> button, your changes will be remembered and &korganizer; will close the window.
de: Beim Klicken auf <guibutton>OK</guibutton> werden Ihre Änderungen gesichert und &korganizer; schließt das Fenster.

source: Apply
de: Anwenden

source: When you click the <guibutton>Apply</guibutton> button, your changes will be remembered, and the window will remain on-screen for further editing.
de: Ein Klick auf <guibutton>Anwenden</guibutton> speichert Ihre Änderungen. Das Fenster bleibt jedoch offen für weitere Änderungen.

source: Cancel
de: Abbrechen

source: If you click the <guibutton>Cancel</guibutton> button, your editing will be forgotten, and &korganizer; will close the window.
de: Wenn Sie auf <guibutton>Abbrechen</guibutton> klicken, werden Ihre Änderungen verworfen und &korganizer; schließt das Fenster.

source: Other Features
de: Andere Funktionen

source: In this chapter, you'll learn of other useful features of &korganizer;: what tricks you can do with a click of your mouse and what interaction between &korganizer; and &konqueror; is possible.
de: In diesem Kapitel bekommen Sie Informationen zu anderen nützlichen Funktionen in &korganizer;. Z.B. Tipps zur Behandlung der Maus und welche Interaktion zwischen &korganizer; und &konqueror; möglich ist.

source: Command Line
de: Befehlszeile

source: A nice program to access a &kde; calendar from the command line is konsolekalendar, which is included in the kdepim package together with &korganizer;.
de: Ein hilfreiches Programm für den Zugriff auf einen &kde;-Kalender von der Befehlszeile ist konsolekalendar, das im kdepim-Paket zusammen mit &korganizer; enthalten ist.

source: Drag and Drop Operations
de: <quote>Ziehen und ablegen</quote> Operationen

source: &korganizer; can be easily controlled with your mouse. The supported drag-and-drop operations are detailed below.
de: &korganizer; kann problemlos mit der Maus kontrolliert werden. Die unterstützten Funktionen werden hier beschrieben.

source: Any event can be re-sized with your mouse. Simply move the mouse pointer near the top or bottom edge of the event, and drag the edge up or down. This way you can visually modify the starting and ending time of your appointment. This works in the Day, Week and Work Week views.
de: Die Dauer jedes Termins kann mit der Maus verändert werden. Bewegen Sie einfach den Mauszeiger an das obere oder untere Ende eines Termins und ziehen Sie dann den Rand hinauf oder hinunter. So können Sie die Start- und Endzeit des Termins visuell verändern. Das funktioniert in der Tages-, Arbeitswochen- und Wochenansicht.

source: Any event can be rescheduled with your mouse. Move the mouse pointer over the event, and drag it to a new time location. This works in the Day, Week and Work Week views.
de: Jedes Ereignis kann zu einem neuen Zeitpunkt verschoben werden. Bewegen Sie den Mauszeiger über den Termin und ziehen Sie es auf den gewünschten Zeitpunkt. Dies funktioniert in der Tages-, Arbeitswochen- und Wochenansicht.

source: Events can be copied to other, presently non-visible dates. Move the mouse pointer over the event, and drag it to the Date Navigator on the left side of the current calendar, or to the Date Navigator of a different calendar.
de: Ereignisse können auch zu gerade nicht sichtbaren Tagen geschoben werden. Bewegen Sie den Mauszeiger über den Termin und ziehen Sie es auf den Navigator auf der linken Seite des Fensters oder auf den Navigator eines anderen &korganizer;-Fensters.

source: However, you cannot drag from Agenda view in one calendar to Agenda view in another calendar.
de: Sie können jedoch Ereignisse von der Terminplanansicht eines Kalenders nicht in die Terminplanansicht eines anderen Kalenders ziehen.

source: Toolbars can be dragged on the screen. Move the mouse pointer over the toolbar's handle, and drag it to a new location on your screen.
de: Die Werkzeugleisten können auf dem Bildschirm verschoben werden. Bewegen Sie die Maus an den linken Rand der Leiste und ziehen Sie sie an die gewünschte neue Position auf Ihrem Bildschirm.

source: &konqueror; Interaction
de: Interaktion mit &konqueror;

source: &konqueror; recognizes the vCalendar format used by &korganizer;. If you use &konqueror; to navigate to your calendar, it will be displayed <emphasis>inside</emphasis> &konqueror; as a live object. You will be able to perform most operations with your calendar inside &konqueror;; you will not need to start &korganizer;. In technical jargon, this is described as <quote>embedding vCalendar as KPart inside &konqueror;</quote>.
de: &konqueror; erkennt das vCalendar-Format, welches &korganizer; benutzt. Wenn Sie mit &konqueror; eine vCalendar-Datei öffnen, wird diese <emphasis>innerhalb</emphasis> des &konqueror;-Fensters dargestellt. Sie können dort die meisten Funktionen mit Ihrem Kalender durchführen und müssen &korganizer; nicht starten. Technisch ausgedrückt nennt man das <quote>Einbetten von vCalendar als KPart innerhalb von &konqueror;</quote>.

source: Questions and Answers
de: Fragen und Antworten
