Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdepim/korganizer.po
Languages: de

source: A related, but opposite problem, is that two users cannot safely edit the same remote file at the same time, because the remote file resource does not offer a conflict resolution mechanism. For instance, if someone else changes (and saves) the remote file, after you loaded it, and at some later time you save the file, his changes will be lost.
de: Ein ähnliches, aber gegensätzliches Problem besteht darin, dass zwei Benutzer dieselbe entfernte Datei zur gleichen Zeit bearbeiten können, da die Ressource für Dateien auf Fremdrechner keinen Mechanismus zur Konfliktlösung bietet. Wenn als z. B. ein anderer die entfernte Datei ändert und speichert, nachdem Sie diese geladen haben, und wenn Sie diese Datei danach ändern und speichern, gehen die Änderungen der anderen Person verloren.

source: Importing, Exporting and Maintaining Calendars
de: Import, Export und Verwaltung von Kalendern

source: While local files are just one among many other resources that can be used by &korganizer;, they are the most convenient way to share calendars, save copies, or import items from your old calendar program.
de: Obwohl lokale Dateien nur eine von vielen Ressourcen sind, die &korganizer; benutzen kann, sind sie doch die bequemste Art, um Kalender gemeinsam zu nutzen, Kopien zu speichern oder Einträge von Ihrem alten Kalender zu importieren.

source: Importing Calendars
de: Kalender importieren

source: If you have an iCalendar or vCalendar file, and you would like to import it, choose the <menuchoice><guimenu>File</guimenu> <guisubmenu>Import</guisubmenu><guimenuitem>Import Calendar...</guimenuitem> </menuchoice> menu item. &korganizer; will ask you if you want to <guilabel>Add as new calendar</guilabel>, which adds the calendar file as a new local file resource, <guilabel>Merge into existing calendar</guilabel>, which merges the calendar items into an existing resource or <guilabel>Open in separate window</guilabel>, which will allow you to view and edit the calendar, but will not add it to its default view.
de: Wenn Sie eine iCalendar- oder vCalendar-Datei haben und diese importieren wollen, müssen Sie dem Menüeintrag <menuchoice><guimenu>Datei</guimenu> <guisubmenu>Importieren</guisubmenu><guimenuitem>Kalender importieren ...</guimenuitem> </menuchoice> auswählen. &korganizer; fragt Sie dann, ob Sie die Datei <guilabel>Als neuen Kalender hinzufügen</guilabel> oder <guilabel>In den bestehenden Kalender zusammenführen</guilabel> wollen. Die erste Option fügt die Kalenderdatei als neue lokale Datei-Ressource hinzu, die zweite nimmt die importierten Kalendereinträge in eine existierende Ressource auf. Als dritte Möglichkeit können Sie den Kalender <guilabel>In eigenem Fenster öffnen</guilabel>, wodurch Sie den Kalender sehen und bearbeiten können, ihn aber nicht der Standardansicht hinzufügen.

source: A good time to do this would be if you received a vCalendar with a few entries via email, for instance, or if you are planning to import your calendar from another application. In the latter case, the first thing to do is to use that application to export the calendar data in one of the formats above, or use a tool to convert from the application's native format.
de: Ein guter Zeitpunkt dafür wäre z. B., wenn Sie einen vCalendar mit wenigen Einträgen per E-Mail bekommen haben oder wenn Sie die Absicht haben den Kalender aus einem anderen Programm zu importieren. Im letzteren Fall müssen Sie zuerst die Kalenderdaten in eines der oben erwähnten Formate exportieren oder ein Werkzeug benutzen, das dies für Sie erledigt.

source: If you have used <application>ical</application>, a popular but older calendar program for &UNIX;, you may wish to <action>import your events, journal entries, and to-dos</action> directly to &korganizer;. To do so, choose the <menuchoice><guimenu>File</guimenu><guisubmenu>Import</guisubmenu> <guimenuitem>Import From &UNIX; Ical Tool</guimenuitem></menuchoice> menu item. This action will read the <filename class="extension">.calendar</filename> file from your home folder and merge any entries it contains into your current calendar. If any errors or suspicious things occur during the process, you will be notified via a message box.
de: Haben Sie bislang <application>ical</application>, ein altes aber beliebtes Kalender-Programm für &UNIX;, benutzt, wollen Sie vielleicht Ihre <action>Termine, Journaleinträge und Aufgaben direkt in &korganizer; importieren</action>. Dazu müssen Sie im Menü <menuchoice><guimenu>Datei</guimenu><guisubmenu>Importieren</guisubmenu> <guimenuitem>aus Ical importieren</guimenuitem></menuchoice> auswählen. Hierdurch wird die <filename class="extension">.calendar</filename>-Datei aus Ihrem persönlichen Ordner eingelesen und alle dort enthaltenen Einträge werden in Ihren aktuellen Kalender eingefügt. Sie erhalten eine Mitteilung, sollten während des Importvorgangs Fehler oder Unklarheiten auftreten.

source: Exporting Calendars
de: Kalender exportieren

source: You can export your data as a web page, or as an iCalendar or vCalendar file, which are supported by most scheduling applications. The web page can be used to publish your calendar and to-do list on the web or on the local network. Either way, &korganizer; will export all calendar items from the enabled (checked) resources which are <link linkend="filters-view">not filtered out</link> (let's call these items <quote>active</quote> items). In other words, if you cannot see a calendar item, it won't be in the exported file. To filter out the undesired items before exporting them, you can create <link linkend="filters-view">filters</link>. Filters are even more effective if you classify your events and to-dos in <link linkend="categories-view">categories</link>. To enable and disable resources, check or uncheck the resource box in the <link linkend="managing-resources"><guilabel>Calendar Manager</guilabel> </link> sidebar.
de: Sie können Ihre Daten als Webseite, als iCalendar- oder vCalendar-Datei, die von den meisten Terminplanern unterstützt wird, exportieren. Die Webseite kann dazu benutzt werden Ihren Kalender und Aufgaben im Netz oder im lokalen Netzwerk zu veröffentlichen. &korganizer; exportiert alle Kalendereinträge der aktivierten (markierten) Ressourcen, die nicht <link linkend="filters-view">ausgefiltert</link> wurden. Diese Einträge werden als <quote>aktiv</quote> bezeichnet. Mit anderen Worten, wenn Sie einen Kalendereintrag nicht sehen können, wird er auch nicht exportiert. Um unerwünschte Einträge vor dem Export auszufiltern, können Sie einen entsprechenden <link linkend="filters-view">Filter</link> erstellen. Filter sind noch effektiver, wenn Sie Ihre Termine und Aufgaben in <link linkend="categories-view">Kategorien</link> zuweisen. Um Ressourcen zu aktivieren bzw. deaktivieren können Sie die Ressource in der <link linkend="managing-resources"><guilabel>Kalender-Verwaltung</guilabel></link> in der Seitenleiste markieren bzw. die Markierung entfernen.

source: To export all your <quote>active</quote> events, to-dos and journal entries (independent of to what resource they belong) as a new iCalendar file, choose the <menuchoice><guimenu>File</guimenu><guisubmenu>Export</guisubmenu> <guimenuitem>Export as iCalendar...</guimenuitem></menuchoice> menu item. To export the same data as a new vCalendar file choose the <menuchoice><guimenu>File</guimenu> <guisubmenu>Export</guisubmenu> <guimenuitem>Export as vCalendar...</guimenuitem> </menuchoice> menu item. The <guilabel>Save As</guilabel> dialog will pop up. Enter the file name and location for the new file to complete the export action.
de: Um alle Ihre <quote>aktiven</quote> Termine, Aufgaben und Journaleinträge, unabhängig von der Ressource, zu der sie gehören, in eine neue iCalendar-Datei zu exportieren, wählen Sie im Menü <menuchoice><guimenu>Datei</guimenu><guisubmenu>Exportieren</guisubmenu> <guimenuitem>Als iCalendar exportieren ...</guimenuitem></menuchoice>. Dieselben Daten können Sie mit <menuchoice><guimenu>Datei</guimenu> <guisubmenu>Exportieren</guisubmenu> <guimenuitem>Als vCalendar exportieren ...</guimenuitem> </menuchoice> in eine vCalendar-Datei exportieren. Der Dialog <guilabel>Speichern unter</guilabel> erscheint daraufhin. Geben Sie hier den Dateinamen und den Ordner an, in dem die neue Datei gespeichert wird, um den Export abzuschließen.

source: You can export your calendar or a part of it as an &HTML; file, suitable for publishing on the web. Anyone with access to this file, using a web browser, will be able to view it. This is an easy way to share calendar information with your colleagues and friends.
de: Sie können Ihren Kalender oder einen Teil davon als &HTML;-Datei zur Veröffentlichung im Netzwerk exportieren. Jeder, der auf diese Datei mit einem Webbrowser zugreifen kann, kann den Inhalt anzeigen lassen. Dies ist eine einfache Art, um Ihren Kalender mit Kollegen und Freunden zu teilen.

source: Disable all the resources you do not want to export, and filter out the items you do not want to export.
de: Deaktivieren Sie die Ressourcen, die nicht exportiert werden sollen, und filtern Sie die Einträge aus, die Sie nicht exportieren wollen.

source: Choose the <menuchoice><guimenu>File</guimenu> <guisubmenu>Export</guisubmenu><guimenuitem>Export Web Page...</guimenuitem> </menuchoice> menu item. You will get a window with three tabs: <guilabel>General</guilabel>, <guilabel>Events</guilabel>, and <guilabel>To-dos</guilabel>.
de: Wählen Sie aus dem Menü <menuchoice><guimenu>Datei</guimenu> <guisubmenu>Exportieren</guisubmenu><guimenuitem>Als Webseite exportieren ...</guimenuitem> </menuchoice>. Daraufhin wird ein Fenster mit drei Karteikarten angezeigt: <guilabel>Allgemein</guilabel>, <guilabel>Termine</guilabel> und <guilabel>Aufgaben</guilabel>.

source: <guilabel>General</guilabel> tab:
de: Karteikarte <guilabel>Allgemein</guilabel>:

source: Specify the date range that you want published. Enter dates manually or use the Calendar Widget.
de: Geben Sie Anfangs- und Enddatum an (von Hand oder mit Hilfe des Auswahlfeldes).

source: If you want to export to-dos, check the <guilabel>Export to-do list</guilabel> box.
de: Wenn Sie Aufgaben exportieren wollen, müssen Sie die Option <guilabel>Aufgabenliste exportieren</guilabel> markieren.

source: If you want to export the items displayed in the Month view, check the <guilabel>Export in month view</guilabel> box.
de: Wenn Sie Einträge aus der Monatsansicht exportieren wollen, müssen Sie die Option <guilabel>In Monatsansicht exportieren</guilabel> markieren.

source: If you want to export events formatted as a list of events, check the <guilabel>Export events as list</guilabel> box.
de: Wenn Sie die Termine als Liste formatiert exportieren wollen, müssen Sie die Option <guilabel>Ereignisse als Liste exportieren</guilabel> markieren.

source: Specify the web output file in the <guilabel>Output filename</guilabel> field. If you want to set another location, press the <inlinemediaobject> <imageobject><imagedata fileref="document-open.png" format="PNG"/></imageobject> </inlinemediaobject><guibutton>Open file dialog</guibutton> button to find it.
de: Geben Sie den Speicherort im Feld <guilabel>Name der Zieldatei</guilabel> ein. Falls Sie eine andere Datei angeben möchten, können Sie den Knopf <inlinemediaobject> <imageobject><imagedata fileref="document-open.png" format="PNG"/></imageobject> </inlinemediaobject> <guibutton>Dateiauswahl</guibutton> benutzen, um diese zu finden.

source: <guilabel>Events</guilabel> tab: specify if you want to include categories and attendees in the exported web page.
de: Karteikarte <guilabel>Termine</guilabel>: Legen Sie fest, ob Kategorien und Teilnehmer exportiert werden sollen.

source: <guilabel>To-dos</guilabel> tab: specify if you want to list Due Dates, Categories, and Attendees.
de: Karteikarte <guilabel>Aufgaben</guilabel>: Legen Sie fest, ob Sie Fälligkeitstermine, Kategorien und Teilnehmer aufgeführt werden sollen.

source: Maintaining Your Calendars
de: Das Verwalten Ihrer Kalender

source: Contemporary computers have ample storage space. However, if you synchronize your &korganizer; calendar with a limited-memory machine like the Palm device, you will find archiving useful. The performance of &korganizer; can also become worse when there are many events. To archive old items, follow the procedure below:
de: Moderne Rechnern bieten mehr als genug Speicherplatz. Wenn Sie allerdings Ihren &korganizer; Kalender mit einem Gerät abgleichen wollen, das über wenig Speicher verfügt, z. B.ein PalmPilot, ist das Archivieren sehr nützlich. Zudem kann bei vielen Einträgen die Verarbeitungsgeschwindigkeit von &korganizer; leiden. Um alte Einträge zu archivieren, folgen Sie den nachfolgenden Anweisungen:

source: Choose the <menuchoice><guimenu>File</guimenu><guimenuitem>Archive Old Entries...</guimenuitem></menuchoice> menu item.
de: Wählen Sie den Menüeintrag <menuchoice><guimenu>Datei</guimenu><guimenuitem>Alte Einträge archivieren ...</guimenuitem></menuchoice>.

source: Fill in the date in <guilabel>Archive now items older than</guilabel> field or use the Calendar Widget to choose the date. Alternatively, you can automatically archive all items older than a certain period of time.
de: Geben Sie im Eingabefeld <guilabel>Jetzt Termine archivieren, die älter sind als</guilabel> ein Datum ein, oder benutzen Sie das Auswahlfeld, um ein Datum auszuwählen. Alternativ können Sie auch alle Einträge archivieren, die älter sind als ein bestimmter Zeitpunkt.

source: If you have chosen archiving, you must also provide a filename for the archive in the <guilabel>Archive File</guilabel> field. If you want to re-use an older archive file, press the <guilabel>Open file dialog</guilabel> button and find an existing archive. The entries will be added to the file, so any item already in the file will not be modified.
de: Wenn Sie Archivieren wählen, müssen Sie Eingabefeld <guilabel>Archivdatei</guilabel> einen Dateinamen für das Archiv angeben. Möchten Sie ein altes Archiv wiederverwenden, klicken Sie den Knopf <guilabel>Dateiauswahl</guilabel> an, um eine bestehende Archivdatei zu suchen. Die Einträge werden zu dieser Datei hinzugefügt, die bereits vorhandenen Einträge bleiben dabei erhalten.

source: Archiving will keep all old items in a file, including completed to-dos. But if you do not want to keep completed to-dos at all, choose the <menuchoice><guimenu>File</guimenu><guimenuitem>Purge Completed To-dos</guimenuitem> </menuchoice> menu item to remove all the completed to-dos from your active resources. If you want to keep your completed to-dos, but do not wish to view them in the to-do lists, consider <link linkend="filters-view">filtering them out</link> instead of purging them.
de: Die Archivierung speichert alte Einträge, auch erledigte Aufgaben, in eine Datei. Wenn Sie die erledigten Aufgaben ausschließen wollen, müssen Sie zuerst im Menü <menuchoice><guimenu>Datei</guimenu><guimenuitem>Erledigte Aufgaben entfernen</guimenuitem> </menuchoice> anwählen, um alle abgeschlossenen Aufgaben Ihrer aktiven Ressourcen vorher zu löschen. Wenn Sie die abgeschlossenen Aufgaben behalten wollen, ohne sie in Ihrer Aufgabenliste anzuzeigen, sollten Sie diese Aufgaben besser <link linkend="filters-view">ausfiltern</link>.

source: Downloading Using Get Hot New Stuff
de: <quote>Neue Erweiterungen</quote> herunterladen

source: To open the <guilabel>Get Hot New Stuff</guilabel> dialog, which offers a list of calendars to download, choose the <menuchoice><guimenu>File</guimenu><guisubmenu>Import</guisubmenu> <guimenuitem>Get Hot New Stuff...</guimenuitem></menuchoice> menu item. If you select one of the calendars, a dialog with the list of events from the calendars will appear. To merge the displayed events with your default resource, press <guilabel>Merge</guilabel>.
de: Zum Anzeigen des Dialogs <guilabel>Neue Erweiterungen</guilabel>, der Ihnen eine Liste von Kalendern zum Herunterladen anbietet, müssen Sie <menuchoice><guimenu>Datei</guimenu><guisubmenu>Importieren</guisubmenu> <guimenuitem>„Neue Erweiterungen“ abholen ...</guimenuitem></menuchoice> auswählen. Wählen Sie einen der Kalender aus, erscheint ein Dialog mit der Liste der Termine dieses Kalenders. Um diese in Ihren Standard-Kalender zu übernehmen, müssen Sie den Knopf <guilabel>Fortsetzen</guilabel> benutzen.

source: Views and Filters
de: Ansichten und Filter

source: While calendars (resources) can hold events, to-dos and/or journal entries, these items are very different in nature. To-dos may have no date associated with them, so a schedule view is not suitable to them. Journal entries are a collection your reflections, occurrences or experiences. They require their own view mode, as they are not related with the list of upcoming events or the list of to-dos, &etc;
de: Kalenderressourcen können Termine, Aufgaben und/oder Journaleinträge enthalten. Diese Einträge sind aber sehr unterschiedlich in ihrer Natur. Aufgaben haben unter Umständen kein Datum und eine Ansicht nach Zeit passt daher nicht für sie. Journaleinträge sind eine Sammlung Ihrer Erinnerungen und Erfahrungen. Sie benötigen eine eigene Ansicht, da sie nicht mit der Liste anstehender Termine oder Aufgaben &etc; zusammenhängen.

source: To solve the challenge of displaying your information in a useful and intuitive fashion, &korganizer; offers different views, filters and search capabilities. You can also assign related events and to-dos to categories, which will help you to view them later, using filters or colors.
de: Um der Herausforderung gerecht zu werden, Ihre unterschiedlichen Daten sinnvoll darzustellen, stellt Ihnen &korganizer; verschiedene Ansichten, Filter und Suchmöglichkeiten zur Verfügung. Zudem können Sie zusammenhängenden Terminen und Aufgaben Kategorien zuordnen. Dies hilft Ihnen, diese später über Filter und Farben entsprechend darzustellen.

source: &korganizer; Views
de: &korganizer;-Ansichten

source: In this section, we describe the different view modes, and present an overview of how to browse your personal data using &korganizer;.
de: In diesem Abschnitt erläutern wir die verschiedenen Darstellungsmodi (Ansichten) und bieten einen Überblick darüber, wie Sie Ihre persönlichen Daten mit &korganizer; durchsuchen können.

source: The &korganizer; window can be divided into two main areas: the main window and the sidebar. The main window displays the main views and the sidebar displays the Date Navigator, the To-do View, the Item Viewer and the Calendar Manager View. To show or hide the sidebar components, check or uncheck the menu items under the <menuchoice><guimenu>Settings</guimenu> <guisubmenu>Sidebar</guisubmenu></menuchoice> submenu.
de: Das &korganizer;-Fenster kann in zwei Bereiche unterteilt werden: das Hauptfenster und die Seitenleiste. Das Hauptfenster beherbergt die Ansichten und die Seitenleiste den Datumsnavigator, die Aufgabenansicht und die Kalenderverwaltung. Um festzulegen, was in der Seitenleiste angezeigt wird, können Sie die entsprechenden Menüeinträge unter <menuchoice><guimenu>Einstellungen</guimenu> <guisubmenu>Seitenleiste</guisubmenu></menuchoice> aktiveren/deaktivieren.

source: The Date Navigator is provided to browse and select dates. Today's date will be outlined with a small box, dates which have events scheduled on them will be bold (daily or weekly recurring events may not be marked as bold, <link linkend="config-main-views">depending on the view configuration</link>), and holidays will be colored red. If you want to jump to a date, simply click on it. Hold down the mouse to select multiple contiguous dates at once. The <guilabel>What's Next</guilabel>, <guilabel>List</guilabel>, <guilabel>Agenda</guilabel> and <guilabel>Journal</guilabel> views will only show events, to-dos or journals items from the dates selected in the Date Navigator. The <guilabel>Month</guilabel> view will show events or to-dos from the first month shown in the Date Navigator (the selected days in the month won't change the Month view, only month changes).
de: Mit dem Datumsnavigator können Sie nach einem Datum suchen oder dieses auswählen. Der heutige Tag ist mit einem schwarzen Kästchen umrandet. Tage, an denen Termine liegen, werden durch Fettschrift markiert (täglich oder wöchentlich wiederkehrende Termine werden unter Umständen, <link linkend="config-main-views">abhängig von der Konfiguration der Ansicht</link>, nicht mit Fettschrift markiert), die Wochenenden sind rot markiert. Wollen Sie zu einem Datum springen, reicht es dieses einfach auszuwählen. Sie können bei gedrückter Maustaste auch mehrere zusammenhängende Tage auswählen. Die Ansichten <guilabel>Was kommt als Nächstes</guilabel>, <guilabel>Terminliste</guilabel>, <guilabel>Tagesansicht</guilabel> und <guilabel>Journal</guilabel> zeigen nur Termine, Aufgaben und Journaleinträge für die Tage an, die mit dem Datumsnavigator ausgewählt wurden. Die <guilabel>Monats</guilabel>-Ansicht zeigt nur die Termine und Aufgaben aus dem ersten Monat, der im Datumsnavigator ausgewählt ist. Ausgewählte Tage in dem Monat ändern die Monatsansicht nicht, nur das Auswählen eines anderen Monats.

source: The To-do View sidebar component lists your to-dos, just like the <link linkend="todo-view">To-do view</link>. It is useful if you want to see your to-dos while using the other views.
de: Die Aufgabenliste in der Seitenleiste zeigt Ihre Aufgaben wie die <link linkend="todo-view">Aufgabenansicht</link>. Dies ist nützlich, damit Sie Ihre Aufgabenliste auch dann sehen, wenn Sie eine andere Ansicht benutzen.

source: The Item Viewer sidebar component shows details of the currently selected events, to-dos or journal entries.
de: Der Betrachter für Einträge zeigt die Details des ausgewählten Termins, der ausgewählten Aufgabe oder des ausgewählten Journaleintrags an.

source: Finally, Calendar Manager Viewer sidebar component allow you to enable or disable the resources on the list, by checking or unchecking the resource box, and to manage your resources. For more information, please check <xref linkend="managing-resources"/>.
de: Die Kalenderverwaltung erlaubt die Einbindung der angezeigten Ressourcen, indem Sie diese markieren und die Verwaltung der Ressourcen. Weitere Informationen finden Sie unter <xref linkend="managing-resources"/>.
