Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdepim/korganizer.po
Languages: de

source: The group schedule functionality of &korganizer; allows you to organize appointments, meetings and shared to-do items, request responses from attendees and publish items. If you are being invited to an event or to-do, you can reply to it, stating if you will be able to attend, or send a counter proposal, with different arrangements, like a different time or location. You can also publish your free/busy schedule, to let people know when you are available, and request the same information from others.
de: Die Gruppenplanung von &korganizer; erlaubt es Ihnen Verabredungen, Termine und gemeinsame Aufgaben zu organisieren. Sie können Antworten von den Teilnehmern anfordern und Einträge veröffentlichen. Wenn Sie zu einem Termin oder einer Aufgabe eingeladen werden, können Sie antworten, ob Sie kommen können oder einen anderen Terminvorschlag mit einem anderen Zeitraum oder einem anderen Ort machen. Sie können ebenfalls Ihre Frei/Belegt-Zeiten veröffentlichen, um den anderen mitzuteilen, wann Sie verfügbar sind und dieselben Informationen von diesen anfordern.

source: Currently, &korganizer; schedules events and to-dos using email to transport the data, in a standards based scheme, the IMIP-protocol for group scheduling. Being a standard, IMIP is a used by many other clients too. For example &Microsoft;<application>Outlook</application>, Lotus <application>Notes</application> and Novell <application>Evolution</application>. This means that you can share events with other users using one of these clients. &korganizer; is integrated with &kmail; for receiving, processing, and sending events, event responses, updates, cancellations, &etc; For instance, when you get an invitation in &kmail;, and decide to accept it, by clicking the <guilabel>accept</guilabel> link in the mail body, the event is added to your calendar, and a response to the event's organizer is sent automatically.
de: Zurzeit transportiert &korganizer; Informationen über Termine und Aufgaben mit einer Standardschema, dem IMIP-Protokoll für E-Mail. IMIP als Standard wird auch von anderen Klienten wie z.B. &Microsoft; <application>Outlook</application>, Lotus <application>Notes</application> und Novell <application>Evolution</application> benutzt. Sie können daher auch Termine mit anderen kommunizieren die einen dieser Klienten benutzen. &korganizer; ist mit &kmail; integriert, damit Ereignisse, Antworten, Aktualisierungen, Absagen &etc; empfangen und verarbeitet werden können. Wenn Sie z.B. eine Einladung mit &kmail; bekommen und sich dafür entscheiden diese zu durch das Drücken auf die Verknüpfung <guilabel>Akzeptieren</guilabel> zu akzeptieren, so wird das Ereignis Ihrem Kalender hinzugefügt und die Antwort zum Organisator automatisch gesendet.

source: If you check the <guilabel>Use Groupware Communication</guilabel> box in the <link linkend="config-main-groupscheduling">&korganizer; group scheduling configuration</link>, &korganizer; will handle the group scheduling communication for you. In other words, you will seldom need to use the <guimenu>Schedule</guimenu> menu directly to perform the scheduling actions. For instance, if you <link linkend="entering-data-events">create an event or to-do</link> with attendees, &korganizer; will ask you if you want to send the invitations to the attendees, so you will not need to use the <menuchoice> <guimenu>Schedule</guimenu><guimenuitem>Send Invitation to Attendees</guimenuitem> </menuchoice> menu item later. Also, if you change your status as an attendee for an event you were invited to, it will ask you if you want to send your updated status to the event's organizer, so you will not need to use the <menuchoice> <guimenu>Schedule</guimenu><guimenuitem>Send Status Update</guimenuitem> </menuchoice> menu item later.
de: Wenn Sie <guilabel>Groupware Kommunikation verwenden</guilabel> in <link linkend="config-main-groupscheduling">Einrichtung von Gruppenplanung in &korganizer;</link> einschalten, wird &korganizer; die Kommunikation für die Gruppenplanung für Sie verwenden Mit anderen Worten, Sie werden selten den Menüeintrag <guimenu>Planer</guimenu> direkt benutzen, entsprechende Aktionen zu starten. Wenn Sie z.B. <link linkend="entering-data-events">einen Termin oder eine Aufgabe mit Teilnehmern erstellen</link> wird &korganizer; Sie fragen, ob Sie Einladungen an die Teilnehmer versenden wollen, damit Sie den Menüeintrag <menuchoice><guimenu>Planer</guimenu><guimenuitem>Einladungen an die Teilnehmer verschicken</guimenuitem></menuchoice> nicht später benutzen müssen. Auch wenn Sie Ihren Status als Teilnehmer eines Ereignisses, zu dem Sie eingeladen wurden, ändern werden Sie gefragt, ob der aktualisierte Status an den Organisator versendet werden soll. Sie müssen dann den Menüeintrag <menuchoice><guimenu>Planer</guimenu><guimenuitem>Aktualisierung versenden</guimenuitem> </menuchoice> nicht später benutzen.

source: Publishing an Event, To-do or Journal Entry
de: Einen Termin, eine Aufgabe oder einen Journaleintrag veröffentlichen

source: If you simply want to send an event, to-do or journal entry, choose the <menuchoice><guimenu>Schedule</guimenu><guimenuitem>Publish Item Information...</guimenuitem></menuchoice> menu item, when the item is selected. Then a dialog appears, asking you the email addresses which will receive the event or to-do. The item will be sent by email, in the iCalendar format.
de: Wenn Sie einen Termin, eine Aufgabe oder einen Journaleintrag senden wollen, so können Sie dies einfach mit dem Menüeintrag <menuchoice><guimenu>Planer</guimenu><guimenuitem>Informationen zum Eintrag veröffentlichen</guimenuitem></menuchoice> machen, nachdem Sie den Eintrag ausgewählt haben. Im darauf erscheinenden Dialog werden Sie nach den E-Mail Adressen gefragt welche das Ereignis oder die Aufgabe bekommen sollen. Der Eintrag wird dann per E-Mail im iCalendar Format gesendet.

source: Please note that you can use this action to email any item to anyone, not just to the item's attendees. In fact, you can publish an item with no attendees at all, as publishing does not request an answer from the attendees.
de: Beachten Sie hierbei, dass Sie hiermit den Eintrag an jeden senden können und nicht nur an die Teilnehmer der Eintrags. Sie können sogar einen Eintrag veröffentlichen, der gar keine Teilnehmer hat, da hier keine Antwort von den Teilnehmern erwartet wird.

source: An example: you are playing in a band and, from time to time, you give live concerts. To notify your fans about the concerts, you maintain a mailing list. If you use &korganizer; to organize your concert dates, you can just choose the <menuchoice><guimenu>Schedule</guimenu> <guimenuitem>Publish Item Information...</guimenuitem></menuchoice> menu item, put in the address of the mailing list and the event gets sent. Mailing list subscribers who use &korganizer; get the concert date automatically inserted in their calendar.
de: Ein Beispiel: Sie spielen in einer Band und veranstalten von Zeit zu Zeit Live-Konzerte. Um Ihre Fans über diese Konzerte zu informieren können Sie eine Mailingliste verwalten. Wenn Sie nun &korganizer; benutzen, um Ihre Konzertdaten zu organisieren, können Sie einfach <menuchoice><guimenu>Planer</guimenu> <guimenuitem>Informationen zum Eintrag veröffentlichen</guimenuitem></menuchoice> auswählen und als Adresse die Mailingliste angeben. Das Ereignis wird dann gesendet. Die Teilnehmer der Mailingliste, die &korganizer; benutzen, bekommen den Konzerttermin automatisch in Ihren Kalender eingetragen.

source: Publishing an event as described above will only inform the receiver about the event, but not give her the option to ask for attendance. Use <menuchoice><guimenu>Schedule</guimenu><guimenuitem>Send as iCalendar...</guimenuitem></menuchoice> if you want to provide that option instead.
de: Bei der Veröffentlichung eines Ereignisses wie oben beschrieben werden die Empfänger nur darüber informiert, haben aber keine Möglichkeit, um Teilnahme zu bitten. Um Ihnen dies zu erlauben, wird <menuchoice><guimenu>Planer</guimenu><guimenuitem>Als iCalendar senden ...</guimenuitem></menuchoice> benutzt.

source: Acting as Organizer in Group Scheduling
de: Die Gruppenplanung organisieren

source: When you create <link linkend="entering-data-events">an event</link> or <link linkend="entering-data-to-do">a to-do</link>, and <link linkend="entering-data-events-attendees">add attendees to it</link>, you are acting as the event organizer. To add attendees, use the <link linkend="entering-data-events-attendees"> attendee tab</link>, in the <guilabel>Edit Event</guilabel>, or <guilabel>Edit To-do</guilabel> dialog. In the <link linkend="agenda-view">Agenda view</link>, a little icon <inlinemediaobject> <imageobject> <imagedata fileref="organizer.png" format="PNG"/> </imageobject> <textobject> <phrase>Organizer Icon</phrase> </textobject> </inlinemediaobject> is placed in the event, if you are the organizer of a group scheduling event.
de: Wenn Sie <link linkend="entering-data-events">einen Termin</link> oder <link linkend="entering-data-to-do">eine Aufgabe</link> erstellen und <link linkend="entering-data-events-attendees">Teilnehmer hinzufügen</link> sind Sie der Organisator des Ereignisses. Um Teilnehmer hinzuzufügen, müssen Sie die Karteikarte <link linkend="entering-data-events-attendees">Teilnehmer</link> in den Dialogen <guilabel>Termin bearbeiten</guilabel> und <guilabel>Aufgabe bearbeiten</guilabel> benutzen. In der <link linkend="agenda-view">Terminplanansicht</link> wird ein kleines <inlinemediaobject> <imageobject> <imagedata fileref="organizer.png" format="PNG"/> </imageobject> <textobject> <phrase>Organizer Symbol</phrase> </textobject> </inlinemediaobject> beim Termin anzeigen, dass es Sich um eine Gruppenplanung handelt.

source: The organizer is responsible for sending the invitations, collecting the attendees responses, and for keeping the data of the event or to-do up to date for all people involved.
de: Der Organisator ist dafür verantwortlich, die Einladungen zu versenden, die Antworten der Teilnehmer einzusammeln und die Daten der Termine und Aufgaben für alle beteiligten Personen auf den aktuellen Stand zu halten.

source: Sending Invitations and Processing Responses
de: Einladungen versenden und Antworten verarbeiten

source: To organize an event or to-do, <link linkend="entering-data-events">create it</link> in &korganizer; and add all the people that should attend using the attendees tab. &korganizer; can send invitations to the attendees, either automatically (depending on <link linkend="config-main-groupscheduling">&korganizer; group scheduling configuration</link>), or by selecting the event or to-do and choosing the <menuchoice><guimenu>Schedule</guimenu><guimenuitem>Send Invitation to Attendees</guimenuitem></menuchoice> menu item. The attendees get an email containing all the relevant information for the event or to-do. They can respond to the meeting proposal by accepting or rejecting it or by making a counter proposal. They can also delegate or forward the invitation. All this information is sent to you by email again and, if you have configured &kmail; appropriately, the attendees responses are automatically inserted in your calendar. If there are additional attendees willing to participate (e.g. by accepting a forwarded invitation) you will be asked to accept the new attendees.
de: Um einen Termin oder eine Aufgabe zu organisieren, <link linkend="entering-data-events">erstellen</link> Sie diese in &korganizer; und fügen alle Leute, die teilnehmen sollen, auf der Karteikarte Teilnehmer hinzu. &korganizer; kann die Einladungen an die Teilnehmer automatisch senden, abhängig von der <link linkend="config-main-groupscheduling">Konfiguration von &korganizer;s Gruppenplanung</link>, oder durch das Auswählen des Termins oder der Aufgabe und benutzen des Menüeintrags <menuchoice><guimenu>Planer</guimenu><guimenuitem>Einladungen an die Teilnehmer verschicken</guimenuitem></menuchoice>. Die Teilnehmer bekommen eine E-Mail, die alle relevanten Informationen enthält. Sie können dem Vorschlag zustimmen, ihn ablehnen oder einen Gegenvorschlag machen. Außerdem können die Teilnehmer die Einladung delegieren oder weiterleiten.Diese Informationen werden dann wieder per E-Mail an Sie gesendet und, wenn Sie &kmail; entsprechend konfiguriert haben, die Antworten in Ihren Kalender eingepflegt. Gibt es zusätzliche Personen, die teilnehmen möchten – zum Beispiel weil die Einladung weitergeleitet wurde – müssen Sie diese neuen Teilnehmer akzeptieren.

source: Cancelling an Event or To-do
de: Einen Termin oder eine Aufgabe absagen

source: To cancel an event or to-do you have to be the organizer. If you checked the <guilabel>Use Groupware Communication</guilabel> box in the <link linkend="config-main-groupscheduling">&korganizer; group scheduling configuration</link>, just delete the item, and &korganizer; will ask you to send the cancellation. If not, simply select the item, and choose the <menuchoice><guimenu>Schedule</guimenu> <guimenuitem>Send Cancellation to Attendees</guimenuitem></menuchoice> menu item.
de: Um ein Termin oder eine Aufgabe abzusagen, müssen Sie der Organisator sein. Wenn Sie die Option <guilabel>Groupware Kommunikation verwenden</guilabel> in der <link linkend="config-main-groupscheduling">Konfiguration von &korganizer;s Gruppenplanung</link> aktiviert haben, reicht es den Eintrag zu löschen und &korganizer; wird Sie fragen, ob es die Absage senden soll. Falls nicht, so müssen Sie den Eintrag auswählen und im Menü den Eintrag <menuchoice><guimenu>Planer</guimenu> <guimenuitem>Absage an die Teilnehmer verschicken</guimenuitem></menuchoice> benutzen.

source: This action will send a cancel-message to all attendees, so they can remove the item from their calendars too.
de: Diese Aktion sendet eine Absagemitteilung an alle Teilnehmer, damit diese den Eintrag auch aus Ihrem Kalender entfernen können.

source: Acting as the Attendee
de: Als Teilnehmer agieren

source: When you get an email with an invitation and accept it, the event or to-do is added to your calendar. If it is an event, a little icon <inlinemediaobject> <imageobject> <imagedata fileref="groupevent.png" format="PNG"/> </imageobject> <textobject> <phrase>Attendee Icon</phrase> </textobject> </inlinemediaobject> is placed in the event in the <link linkend="agenda-view">Agenda view</link>.
de: Wenn Sie eine E-Mail mit einer Einladung bekommen und diese annehmen wird der Termin oder die Aufgabe Ihrem Kalender hinzugefügt. Wenn es ein Termin ist erscheint ein <inlinemediaobject> <imageobject> <imagedata fileref="groupevent.png" format="PNG"/> </imageobject> <textobject> <phrase>Teilnehmersymbol</phrase> </textobject> </inlinemediaobject> neben dem Termin in der <link linkend="agenda-view">Terminplanansicht</link>.

source: Answering an Invitation
de: Eine Einladung beantworten

source: If you have an invitation in your &kmail; inbox you can either press <guibutton>Reject</guibutton> to ignore the request, or press <guibutton>Accept</guibutton> or <guibutton>Accept Cond.</guibutton>. The last two actions will insert the item into your calendar. In any case, &kmail; will send your response to the organizer automatically.
de: Wenn Sie eine Einladung in Ihrem &kmail; Eingangskorb haben können Sie diese entweder <guibutton>Ablehnen</guibutton>, um die Anfrage zu ignorieren, <guibutton>Akzeptieren</guibutton> oder <guibutton>Vorläufig akzeptieren</guibutton>. Die letzten beiden Möglichkeiten fügen den Eintrag in Ihrem Kalender ein. In jedem Fall wird &kmail; Ihre Antwort automatisch an den Organisator senden.

source: You can also <guibutton>Delegate</guibutton> or <guibutton>Forward</guibutton> the invitation. When delegating, you can suggest another person as your proxy. Using <guibutton>Forward</guibutton> you can forward the invitation to one or more people not yet invited. When the receiver of the delegation or forward accepts the invitation, the organizer will be asked to approve the new attendee.
de: Außerdem können Sie Einladungen <guibutton>Delegieren</guibutton> oder <guibutton>Weiterleiten</guibutton>. Beim Delegieren können Sie eine andere Person als Ihren Vertreter vorschlagen. Beim Weiterleiten schicken Sie die Einladung an eine oder mehrere noch nicht beteiligte Personen. Wenn der Empfänger bei beiden Verfahren die Einladung annimmt, muss der Organisator sie als neue Teilnehmer akzeptieren.

source: If for any reason you changed your mind, edit your status in the item's <link linkend="entering-data-events-attendees">attendee tab</link>. If you checked the <guilabel>Use Groupware Communication</guilabel> box in the <link linkend="config-main-groupscheduling">&korganizer; group scheduling configuration</link>, &korganizer; will ask you to send an email updating your attendee status. If not, choose the <menuchoice> <guimenu>Schedule</guimenu><guimenuitem>Send Status Update</guimenuitem> </menuchoice> menu item to send your status update.
de: Fall Sie aus irgendeinen Grund Ihre Meinung ändern, können Sie den Status in der <link linkend="entering-data-events-attendees">Karteikarte Teilnehmer</link>des Eintrags bearbeiten. Wenn Sie die Option <guilabel>Groupware-Kommunikation verwenden</guilabel> in der <link linkend="config-main-groupscheduling">Einrichtung von Gruppen-Planungen für &korganizer;</link> eingeschaltet haben werden Sie gefragt, ob eine entsprechende E-Mail zur Aktualisierung des Status der Teilnehmer gesendet werden soll. Falls nicht, so können Sie mit dem Menüeintrag <menuchoice> <guimenu>Planer</guimenu><guimenuitem>Aktualisierung versenden</guimenuitem> </menuchoice> die Statusaktualisierung manuell versenden.

source: Sending an Alternative Proposal
de: Einen alternativen Termin vorschlagen

source: If you are not satisfied with some of the characteristics of the event or to-do you got invited to, and want to send a counter proposal to the organizer (for instance an alternative location or time), just edit the item and send it back as your proposal, by selecting the item and choosing the <menuchoice> <guimenu>Schedule</guimenu><guimenuitem>Request Change</guimenuitem> </menuchoice> menu item.
de: Falls Sie mit einigen Punkten, des Termins oder der Aufgabe zu der Sie eingeladen wurden, nicht einverstanden sind und dem Organisator einen anderen Vorschlag machen wollen, z.B einen anderen Ort, so können Sie den Eintrag bearbeiten und als Vorschlag zurücksenden indem Sie im Menü <menuchoice> <guimenu>Planer</guimenu><guimenuitem>Änderung vorschlagen</guimenuitem> </menuchoice> auswählen.

source: The organizer of the event will get your proposal by email, and will be able to accept it or decline.
de: Der Organisator des Termin wird Ihren Gegenvorschlag per E-Mail erhalten und kann diesen dann akzeptieren oder ablehnen.

source: Requesting the Latest Version of an Event or To-do
de: Neueste Version eines Termins oder einer Aufgabe anfordern

source: To request the latest version of an event or to-do, select the item, and choose the <menuchoice><guimenu>Schedule</guimenu> <guimenuitem>Request Update</guimenuitem></menuchoice> menu item. The organizer should then send you back the latest version of the item.
de: Um die neueste Version eines Termins oder einer Aufgabe zu erhalten müssen Sie den Eintrag auswählen und im Menü <menuchoice><guimenu>Planer</guimenu><guimenuitem>Nach Aktualisierung fragen</guimenuitem> </menuchoice> benutzen. Der Organisator sollte Ihnen dann die letzte Version Ihres Eintrags zurücksenden.

source: Free Busy information
de: Frei/Belegt-Informationen

source: The free/busy information represents an availability schedule. By presenting the intervals when one already has previous commitments, others can avoid arranging appointments for these periods. Note that only the times are published, not the events, reasons or attendees.
de: Die Frei/Belegt-Informationen zeigen Ihnen verfügbare Termine, durch die schon belegten Intervalle an. Sie können dann die Verabredungen so legen, dass der Zeitabschnitt frei ist. Beachten Sie dabei, dass nur die Zeiten veröffentlicht werden, nicht jedoch der Termin oder die Teilnehmer.

source: &korganizer; supports publishing and retrieving free/busy information, either manually or automatically.
de: &korganizer; unterstützt das manuelle oder automatische Veröffentlichen und Empfangen von Frei/Belegt-Informationen.

source: To email your free/busy information, choose the <menuchoice><guimenu>Schedule</guimenu> <guimenuitem>Mail Free Busy Information...</guimenuitem></menuchoice> menu item. Enter the email addresses you want to send the information to in the dialog and press <guilabel>OK</guilabel>.
de: Um Ihre Frei/Belegt-Informationen zu versenden, können Sie im Menü <menuchoice><guimenu>Planer</guimenu> <guimenuitem>Frei/Belegt-Informationen per E-Mail versenden ...</guimenuitem></menuchoice> benutzen. Geben Sie dann die E-Mail-Adressen ein, an die Sie Ihren Informationen senden wollen und drücken Sie <guilabel>OK</guilabel>.

source: Groupware servers usually have a standard location for uploading your free busy information, so that other users can access your data, and you can access other user's free busy schedule. You can configure &korganizer; to upload and download free busy information automatically, using the <link linkend="config-main-free-busy">Free Busy preferences</link>, in the &korganizer; <guilabel>Configure</guilabel> dialog.
de: Groupware-Server haben normalerweise einen Bereich zu dem die Frei/Belegt-Informationen hochgeladen werden damit andere Benutzer auf diese Informationen zugreifen können. Sie können &korganizer; so einrichten, dass er die Frei/Belegt-Informationen automatisch hoch und runter lädt. Benutzen Sie dazu die <link linkend="config-main-free-busy">Frei/Belegt-Festlegung</link> im Dialog <guilabel>Einrichten</guilabel> von &korganizer;.

source: To upload your free/busy information to the server set in &korganizer; preferences, choose the <menuchoice><guimenu>Schedule</guimenu> <guimenuitem>Upload Free Busy Information</guimenuitem></menuchoice> menu item.
de: Um Ihre Frei/Belegt-Informationen zum dem in den &korganizer; Einstellungen angegebenen Server hochzuladen können Sie den Menüeintrag <menuchoice><guimenu>Planer</guimenu> <guimenuitem>Frei/Belegt-Informationen veröffentlichen</guimenuitem></menuchoice> benutzen.

source: Examples
de: Beispiele

source: Entering a New Group Event
de: Einen neuen Gruppentermin eintragen
