Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdepim/korganizer.po
Languages: de

source: Can I import my old <application>Ical</application> data?
de: Kann ich meine alten <application>Ical</application>-Daten importieren?

source: Sure! Follow the instructions in <link linkend="menu-file-import-ical">Import From &UNIX; Ical section</link>.
de: Ja. Folgen Sie den Anweisungen im Abschnitt <link linkend="menu-file-import-ical">Aus Ical importieren</link>.

source: Can I use freebusy-time with &korganizer;?
de: Kann man in &korganizer; bestimmte Zeiten als frei bzw. belegt kennzeichnen?

source: Yes, follow the instructions in <link linkend="config-main-free-busy">Free/Busy</link>.
de: Ja. Folgen Sie den Anweisungen im Abschnitt <link linkend="config-main-free-busy">Frei/Belegt</link>.

source: Credits and License
de: Danksagungen und Lizenz

source: Program copyright 2000-2010, The &kde; Developers
de: Copyright für das Programm 2000-2010, Die &kde;-Entwickler

source: Contributors:
de: Beiträge von:

source: Documentation copyright 2000 &Milos.Prudek;
de: Copyright für die Dokumentation 2000 &Milos.Prudek;

source: Documentation copyright 2001 Paul E. Ahlquist, Jr <email>&Paul.E.Ahlquist.Jr.mail;</email>
de: Copyright für die Dokumentation 2001 Paul E. Ahlquist, Jr <email>&Paul.E.Ahlquist.Jr.mail;</email>

source: Documentation copyright 2004 J&uuml;rgen Nagel <email>juergen.nagel@student.fh-reutlingen.de</email>
de: Copyright für die Dokumentation 2004 J&uuml;rgen Nagel<email>juergen.nagel@student.fh-reutlingen.de</email>

source: Documentation copyright 2005 Carlos Leonhard Woelz <email>carloswoelz@imap-mail.com</email>
de: Copyright für die Dokumentation 2005 Carlos Leonhard Woelz <email>carloswoelz@imap-mail.com</email>

source: CREDIT_FOR_TRANSLATORS
de: <para>Deutsche &Uuml;bersetzung Copyright 2000 Stefan Winter<email>kickdown@online.de</email></para><para>Oliver Dörr<email>digikam-de@doerr-privat.de</email></para>

source: How to Obtain &korganizer;
de: Wo erhält man &korganizer;?

source: Click the <guisubmenu>Applications</guisubmenu> menu of the <guimenu>main</guimenu> menu to see if &korganizer; is already installed on your system. If &korganizer; is not there, either it is not installed, or perhaps the administrator of your system has moved it to some other place.
de: Klicken Sie auf das <guisubmenu>Anwendungen</guisubmenu> Menü Ihrem <guimenu>Start</guimenu> Menü um zu überprüfen ob &korganizer; bereits auf Ihrem System installiert ist. Wenn &korganizer; dort nicht steht, wurde es entweder nicht installiert oder Ihr Administrator hat es an einen anderen Ort verschoben.

source: Compilation and Installation
de: Kompilierung und Installation

source: Glossary
de: Glossar

source: Calendar Widget
de: Kalender-Auswahlliste

source: A tool for choosing the date inside certain entry windows, such as the event editing window. It is displayed as a small button to the right of the date field. When you click the button, you will see a month calendar. Use the arrows to go to a desired date, or click the month name or year number to go directly to the desired month or year.
de: Ein Werkzeug, um in verschiedenen Fenstern, wie der Termineingabe, ein Datum anzugeben. Es wird als kleiner Knopf rechts von einem Datumsfeld angezeigt. Wenn Sie auf den Knopf drücken, sehen Sie einen Monatskalender. Benutzen Sie die Pfeiltasten, um zu einem Datum zu gehen oder wählen Sie einen Monatsnamen oder Jahreszahl aus, um direkt zu dem entsprechenden Monat oder Jahr zu springen.

source: Date Navigator
de: Datumsnavigator

source: The calendar that is in the upper-left corner of the &korganizer; window. It is the main way provided to navigate among dates, and to select from them. The single-arrow icons move forwards and backwards in time by increments of a month, while the double-arrows allow moving by a year at a time. Today's date will be outlined with a small box. Dates which have events scheduled on them will be bold. If you want to select a date, simply click it. Hold down the &Ctrl; key and click the dates if you wish to select multiple neighboring dates at once. The dates will be displayed in the main panel.
de: Der Kalender wird in der oberen linken Ecke des &korganizer;-Fensters dargestellt. Dies ist der Hauptweg, um zwischen Tagen zu navigieren, und diese auszuwählen. Die Knöpfe mit einem Pfeil bewegen den Kalender monatsweise vor und zurück, die Knöpfe mit den zwei Pfeilen jahresweise. Das heutige Datum wird und Tage mit Terminen werden fett gedruckt dargestellt. Wenn Sie ein Datum auswählen wollen, dann klicken Sie einfach darauf. Wenn Sie mehrere nebeneinander liegende Tage auswählen wollen, halten Sie die &Ctrl;-Taste gedrückt und klicken Sie dann nacheinander auf die gewünschten Tage. Diese Tage werden dann rechts im Hauptfenster angezeigt.

source: Recurring events are not always displayed. You can prevent the display of recurring appointments in the Date Navigator. Get more information in the <link linkend="config-main-views">Views chapter</link>.
de: Sich wiederholende Termine werden nicht immer dargestellt, da Sie die Anzeige im Navigator unterbinden können. Nähere Informationen hierzu gibt es im Kapitel <link linkend="config-main-views">Ansichten</link>.

source: Due Date
de: Fälligkeit

source: A due date is simply the date when your to-do must be finished. For instance, if your to-do is that you must return your books to the library by 16th November, that date is called <quote>the to-do due date</quote>
de: Ein Fälligkeitsdatum ist das Datum an dem eine Aufgabe abgeschlossen sein muss. Wenn Sie beispielsweise die Aufgabe <quote>Bücher bis 16. November zurückbringen</quote> definiert haben, dann ist der 16. November das <quote>Fälligkeitsdatum</quote> für diese Aufgabe.

source: Main panel
de: Hauptfenster

source: Normally the largest part of the screen, to the right of the Date Navigator. It displays the View of the Day, Workdays, Week or Month, the List View or the To-do List view.
de: Normalerweise ist der größte Teil des Bildschirms rechts vom Navigator. Dieser zeigt die Tages-, Arbeitswochen-, Wochen- oder Monatsansicht, die Listenansicht oder die Aufgabenliste an.

source: The right mouse button can be used in the List view and To-do List view only. It displays a local menu. The left mouse button can be used in any view.
de: Die rechte Maustaste kann nur in der Listenansicht und der Aufgabenliste zum Anzeigen eines Kontextmenüs verwendet werden. Die linke Maustaste kann in jeder Ansicht verwendet werden.

source: Free/busy
de: Frei/Belegt

source: The free/busy information is a set of busy time intervals. By presenting the intervals when one already has previous commitments, others can avoid arranging appointments for these periods. Note that only the times are published, not the event titles, descriptions or attendees. In other words, the free/busy information is the availability schedule.
de: Die Frei/Belegt-Informationen ist eine Menge von Intervallen in den Sie beschäftigt sind. Durch das Anschauen dieser Intervalle, an denen man schon andere Termine hat, können andere es vermeiden Ihnen für diese Zeiten Verabredungen vorzuschlagen. Beachten Sie das nur die Zeiten veröffentlicht werden und keine Titel, Beschreibungen oder Teilnehmer der Ereignisse. Mit anderen Worten die Frei/Belegt-Informationen sind die verfügbaren Termine.

source: When adding attendees to your event, you need to know if they are busy or free at that particular time before sending the invitations. If the attendees make their free/busy information available, &korganizer; can retrieve this information and display it in the <guilabel>Free/Busy</guilabel> tab of the <guilabel>Edit Event</guilabel> dialog.
de: Wenn Sie Teilnehmer zu Ihrem Termin einladen müssen Sie wissen, ob diese an einer bestimmten Zeit frei haben, bevor Sie die Einladungen versenden. Wenn die Teilnehmer Ihre Frei/Belegt-Informationen veröffentlicht haben, kann &korganizer; diese auslesen und in der Karteikarte <guilabel>Frei/Belegt</guilabel> des Dialogs <guilabel>Termin bearbeiten</guilabel> anzeigen.
