Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdepim/korganizer.po
Languages: de

source: To make a new to-do entry, right click the To-do View sidebar component, or the To-do List view, and choose the <guimenuitem>New To-do</guimenuitem> menu item. If you right click an already existing to-do, you will get more choices: you can <guimenuitem>Show</guimenuitem> the summary, <guimenuitem>Edit...</guimenuitem> the to-do details, <guimenuitem>Delete</guimenuitem> the to-do altogether, or you can create a <guimenuitem>New Sub-To-do...</guimenuitem> You could for example make a large to-do like building a house, and make sub-to-dos like choosing the right building site, hiring an architect, hiring workers and finally arranging a party for your friends.
de: Zum Erstellen einer Aufgabe klicken Sie rechts in der Aufgabenliste der Seitenleiste oder der Aufgabenliste-Ansicht. Ein Menü mit der Option <guimenuitem>Neue Aufgabe</guimenuitem> erscheint. Wenn Sie auf eine bereits bestehende Aufgabe geklickt haben, erhalten Sie mehr Auswahlmöglichkeiten: <guimenuitem>Anzeigen</guimenuitem> der Zusammenfassung, <guimenuitem>Bearbeiten...</guimenuitem> der Aufgabendetails, <guimenuitem>Löschen</guimenuitem> der gesamten Aufgabe, oder <guimenuitem>Neue Unteraufgabe</guimenuitem> erstellen. Sie könnten zum Beispiel eine große Aufgabe wie <quote>Haus bauen</quote> definieren, und dazu dann Unteraufgaben wie <quote>Bauplatz suchen</quote>, <quote>Architekt beauftragen</quote>, <quote>Arbeiter einstellen</quote> und schließlich <quote>Einweihungsparty feiern</quote>.

source: When you choose <guimenuitem>New To-do...</guimenuitem>, a dialog will pop up, allowing you to enter all necessary <link linkend="entering-data-to-do">information</link>.
de: Wenn Sie <guimenuitem>Neue Aufgabe...</guimenuitem> auswählen, wird eine neue Aufgabe erstellt und Sie können alle notwendigen <link linkend="entering-data-to-do">Informationen</link> eingeben.

source: Click any to-do in the list to highlight it. If you click the thick-line box on the left of the to-do description, you will change the <quote>completed</quote> status of the to-do. If you double-click the to-do description, you will be able to edit all its details.
de: Klicken Sie auf eine bestehende Aufgabe, um sie hervorzuheben. Ein Klick auf das fett gedruckte Kästchen links ändert den <quote>Erledigt</quote> Status der Aufgabe. Wenn Sie auf die Beschreibung der Aufgabe doppelklicken, können Sie die Details dieser Aufgabe bearbeiten.

source: You may also pick <link linkend="managing-purge-archive">Purge Completed</link> from the <mousebutton>right</mousebutton> mouse button menu to delete all to-do entries that you have marked completed.
de: Sie können auch <link linkend="managing-purge-archive">Abgeschlossene löschen</link> aus dem Menü der <mousebutton>rechten</mousebutton> Maustaste auswählen um alle Aufgaben zu löschen, die sie als erledigt markiert haben.

source: To-dos can also be dragged around with the mouse to rearrange the hierarchy or to exchange to-dos with other calendar windows. You can also read an <link linkend="other-features-drag-and-drop">overview</link> of all available drag-and-drop operations.
de: Aufgaben können auch mit der Maus an eine neue Position in der Liste gezogen und sogar zwischen zwei &korganizer;-Fenstern ausgetauscht werden. Lesen Sie hierzu am besten den <link linkend="other-features-drag-and-drop">Überblick</link> über alle verfügbaren <quote>Ziehen und Ablegen</quote> Operationen.

source: Journal View
de: Journalansicht

source: The Journal view provides a place for you to record your reflections, occurrences or experiences. You can display the Journal view in the main panel if you press the <inlinemediaobject><imageobject> <imagedata fileref="view-calendar-journal.png" format="PNG"/></imageobject> </inlinemediaobject><guilabel>Journal View</guilabel> toolbar button or if you choose the <menuchoice><guimenu>View</guimenu><guimenuitem>Journal</guimenuitem> </menuchoice> menu item.
de: Die Journalansicht stellt Ihnen einen Platz zum speichern Ihrer Erinnerungen und Erfahrungen zur Verfügung. Sie können diese Ansicht im Hauptfenster angezeigt bekommen wenn Sie den Knopf <inlinemediaobject><imageobject> <imagedata fileref="view-calendar-journal.png" format="PNG"/></imageobject> </inlinemediaobject><guilabel>Journal</guilabel> in der Werkzeugleiste benutzen oder wenn Sie im Menü <menuchoice><guimenu>Ansicht</guimenu><guimenuitem>Journal</guimenuitem> </menuchoice> auswählen.

source: When you click the <guilabel>add journal entry</guilabel> link, a new journal entry will be created. If you want to edit a journal entry, just click the text box and edit it! To remove a journal entry, press the <inlinemediaobject> <imageobject><imagedata fileref="edit-delete.png" format="PNG"/> </imageobject></inlinemediaobject>delete button next to the <guilabel>Title</guilabel> of the journal entry.
de: Wenn Sie auf <guilabel>Journaleintrag hinzufügen</guilabel> klicken wird ein neuer Eintrag erstellt. Wenn Sie einen Eintrag bearbeiten wollen reicht es in das Textfeld zu klicken. Wenn Sie einen Eintrag löschen wollen können Sie dazu den <inlinemediaobject> <imageobject><imagedata fileref="edit-delete.png" format="PNG"/> </imageobject></inlinemediaobject>Löschknopf rechts vom <guilabel>Titel</guilabel> des Eintrags benutzen.

source: <title>Categories</title>
de: <title>Kategorien</title>

source: To help you organize your entries in related groups, you can assign categories to events, to-dos and journal entries. If you assign categories, you can use them later when searching, filtering, and displaying events and to-dos.
de: Um Ihre Einträge in zusammengehörenden Gruppen zu organisieren können Sie Ereignissen, Aufgaben und Journaleinträgen Kategorien zuordnen. Kategorien können Sie später bei der Suche, Filterung und Anzeige der Ereignisse und Aufgaben benutzen

source: To assign categories when editing or creating new <link linkend="entering-data-events-general">events</link> or <link linkend="entering-data-to-do-general">to-dos</link>, select a category from the drop down box labelled <guilabel>Categories</guilabel> in the <guilabel>General</guilabel> tab. You can assign more than one category for each item.
de: Um die Kategorien während der Bearbeitung oder Erstellung der <link linkend="entering-data-events-general">Termine</link> oder <link linkend="entering-data-to-do-general">Aufgaben</link> zuzuordnen, wählen Sie eine Kategorie aus dem Auswahlfeld <guilabel>Kategorien</guilabel> in der Karteikarte <guilabel>Allgemein</guilabel>. Sie können jedem Eintrag mehr als eine Kategorie zuordnen.

source: To create, delete and edit categories, choose the <menuchoice> <guimenu>Settings</guimenu><guimenuitem>Manage Categories...</guimenuitem> </menuchoice> menu item to open the <guilabel>Edit Categories</guilabel> dialog. If you assign <link linkend="config-main-colors">different colors to categories</link>, you will be able to quickly identify the type of event by its color, either in the Agenda view or in the Month view (depending on the <link linkend="config-main-views">&korganizer; view configuration</link>).
de: Um Kategorien zu erstellen, löschen und zu bearbeiten können Sie im Menü unter <menuchoice> <guimenu>Einstellungen</guimenu><guimenuitem>Kategorien bearbeiten...</guimenuitem> </menuchoice> auswählen. Dies öffnet den Dialog <guilabel>Kategorien bearbeiten</guilabel>. Wenn Sie den <link linkend="config-main-colors">Kategorien unterschiedliche Farben</link> zuordnen werden Sie den Typ des Ereignisses schneller in der Terminplanansicht oder Monatsansicht erkennen . Dies hängt von Ihren <link linkend="config-main-views">Ansichts-Einstellungen für &korganizer;</link> ab.

source: Filters
de: Filter

source: To help you view, find and export your data, you can create and use filters for your calendars. For instance, if you do not want to view completed to-dos, you can filter them out, instead of <link linkend="managing-purge-archive">purging them</link>. If you assign categories, you can use them to create filters.
de: Um Ihre Daten schneller zu finden und zu exportieren, können Sie Filter für Ihre Kalender erstellen und benutzen. Wenn Sie z. B. die erledigten Aufgaben nicht sehen möchten, können Sie diese ausfiltern anstatt <link linkend="managing-purge-archive">sie zu löschen</link>. Wenn Sie Kategorien zuordnen, können Sie diese bei der Erstellung der Filter benutzen.

source: To create, delete and edit filters, choose the <menuchoice> <guimenu>Settings</guimenu><guimenuitem>Manage View Filters...</guimenuitem> </menuchoice> menu item to open the <guilabel>Edit Calendar Filters</guilabel> dialog. Using this dialog, you can create, delete and edit filters that will affect which items will be displayed by &korganizer;.
de: Zum Erstellen, Löschen und Bearbeiten von Filtern, müssen Sie im Menü <menuchoice> <guimenu>Einstellungen</guimenu><guimenuitem>Filter bearbeiten...</guimenuitem> </menuchoice> auswählen, damit der Dialog <guilabel>Kalenderfilter bearbeiten</guilabel> erscheint. Mit diesem Dialog können Sie die Filter für die Einträge von &korganizer; erstellen, löschen und bearbeiten.

source: The <menuchoice><guimenu>View</guimenu> <guisubmenu>Filter</guisubmenu></menuchoice> submenu and the filter toolbar drop down offer access to all available filters created using the <link linkend="menu-settings-edit-filters"><guilabel>Edit Calendar Filters</guilabel></link> dialog. To toggle the display of the filters toolbar on and off, choose the <menuchoice><guimenu>Settings</guimenu> <guisubmenu>Toolbars Shown</guisubmenu><guimenuitem>Filters Toolbar</guimenuitem></menuchoice>. If you do not want to use any filter, choose <guilabel>No filter</guilabel>.
de: Das Menü <menuchoice><guimenu>Ansicht</guimenu> <guisubmenu>Filter</guisubmenu></menuchoice> und die Filter-Werkzeugleiste ermöglicht den Zugriff auf alle verfügbaren Filter die mit <link linkend="menu-settings-edit-filters"><guilabel>Kalenderfilter bearbeiten</guilabel></link> erstellt wurden. Sie können die Filter-Werkzeugleiste an- und ausschalten über das Menü<menuchoice><guimenu>Einstellungen</guimenu> <guisubmenu>Angezeigte Werkzeugleisten</guisubmenu><guimenuitem>Filter-Werkzeugleiste</guimenuitem></menuchoice>. Wenn Sie keinen Filter benutzen wollen, so sollten Sie <guilabel>Kein Filter</guilabel> wählen.

source: Filters are useful when <link linkend="managing-export">exporting your calendar</link>. If you use a filter, only the filtered (visible) items will be exported. Also, filters are more effective when the items are already classified and organized in <link linkend="categories-view">categories</link>, as you can easily create filters based on categories.
de: Filter sind besonders nützlich, wenn Sie <link linkend="managing-export">Ihren Kalender exportieren</link>. Wenn Sie einen Filter benutzen, werden nur die gefilterten - also sichtbaren - Elemente exportiert. Filter sind effektiver, wenn die Einträge bereits klassifiziert und in <link linkend="categories-view">Kategorien</link> organisiert sind, da Sie dann leicht Filter basierend auf diesen Kategorien erstellen können.

source: Searching
de: Suchen

source: Choose the <menuchoice><guimenu>Edit</guimenu> <guimenuitem>Find</guimenuitem></menuchoice> menu item or press the <keycombo action="simul">&Ctrl;<keycap>F</keycap> </keycombo> shortcut to find items (events, to-dos or journal entries) according to title, description, and/or categories. The find action will only search the specified fields.
de: Wählen Sie den Eintrag <menuchoice><guimenu>Bearbeiten</guimenu> <guimenuitem>Suchen</guimenuitem></menuchoice> im Menü oder benutzen Sie <keycombo action="simul">&Ctrl;<keycap>F</keycap> </keycombo> auf der Tastatur, um Einträge wie Termine, Aufgaben und Journaleinträge anhand Ihres Titels, Beschreibung und/oder Kategorie zu finden. Suchen wird nur die angegebenen Felder durchsuchen.

source: You can use wildcards if you do not remember the exact summary. If you do not know a single character of the summary, put <userinput>?</userinput> instead of the missing character. If you do not know more characters, use <userinput>*</userinput>. For instance if you know that the event or to-do has <emphasis>meeting</emphasis> in the beginning and <emphasis>product</emphasis> after, you would write <userinput>meeting*product</userinput> in the Find dialog. &korganizer; will locate entries like <quote>To-do: arrange meeting about the new product</quote>, <quote>Meeting to discuss the old product line</quote> and similar. Letter case is ignored.
de: Sie können bei der Suche Platzhalter verwenden. Wenn Sie einen einzelnen Buchstaben nicht wissen, können Sie <userinput>?</userinput> statt des Buchstabens eingeben. Wenn Sie mehrere Buchstaben nicht wissen, benutzen Sie <userinput>*</userinput>. Wenn Sie beispielsweise einen Termin suchen, bei dem <emphasis>Arbeit</emphasis> irgendwo in der Mitte steht, dann sollten Sie <userinput>*Arbeit*</userinput> im Suchen-Dialog eingeben. &korganizer; wird dann Einträge wie <quote>Ich muss zur Arbeit</quote>, <quote>Arbeitsgruppe Wein</quote> und ähnliche finden. Die Groß-/Kleinschreibung wird dabei ignoriert.

source: The result of the Find operation is a list of events, journal entries and/or to-dos with the specified keyword. The search list characteristics are the same as the <link linkend="list-view">List View</link>.
de: Als Ergebnis liefert der Suchen-Dialog eine Liste mit den Terminen, Journaleinträgen und/oder Aufgaben die Ihren Suchkriterien entsprechen. Die angezeigten Spalten in der Liste sind die gleichen wie die Spalten in der <link linkend="list-view">Terminlisten-Ansicht</link>.

source: This resulting list is active. You can double-click a line to display or edit the event or to-do details. Get more information about these details in <xref linkend="entering-data-events"/> and <xref linkend="entering-data-to-do"/>.
de: Die Liste mit den Suchergebnissen ist aktiv. Sie können auf einen Eintrag doppelklicken, um ihn sich anzeigen zu lassen oder zu bearbeiten. Hierzu gibt es weitere Informationen unter <xref linkend="entering-data-events"/> und <xref linkend="entering-data-to-do"/>.

source: Entering Data
de: Dateneingabe

source: Events
de: Termine

source: Events are future or past appointments, like business meetings, personal anniversaries and cinema visits. An event can also take several days, like holidays.
de: Termine sind Geschehnisse wie z.B. Geschäftstreffen, Geburtstage und Kinobesuche in der Zukunft oder Vergangenheit. Sie können auch mehrere Tage dauern, z.B. ein Urlaub.

source: Entering a new event is very easy. Just choose the <menuchoice><guimenu>Actions</guimenu><guimenuitem>New Event...</guimenuitem></menuchoice> menu item. A window with five tabs at the bottom will appear.
de: Einen neuen Termin einzugeben ist sehr einfach. Klicken Sie auf <menuchoice><guimenu>Aktionen</guimenu><guimenuitem>Neuer Termin...</guimenuitem></menuchoice>. Ein Fenster mit den fünf Karteikarten unten erscheint.

source: If you wish you can use a different way to create a new event:
de: Sie können Termine auch auf einem anderen Weg erstellen:

source: Use the Date Navigator to go to the event date.
de: Benutzen Sie den Navigator, um zum Ereignistag zu springen.

source: Switch to <guilabel>Agenda</guilabel> view and click the desired view's icon on the <guimenu>View Toolbar</guimenu> or select the desired view from the <guimenu>Go</guimenu> menu. Since your event starts at a particular time, you should choose a <link linkend="reference-menus-view">view</link> that displays hours of the day. You may choose <guimenuitem>Day</guimenuitem>, <guimenuitem>Work Week</guimenuitem> view or <guimenuitem>Week</guimenuitem> view. The <guimenuitem>Month</guimenuitem> view is more suitable for to-dos, described below.
de: Wechseln Sie zu einer Terminplanansicht und wählen Sie die gewünschte Ansicht auf der <guimenu>Ansichten</guimenu>-Werkzeugleiste. Da ihr Termin zu einer bestimmten Uhrzeit startet, sollten Sie eine <link linkend="reference-menus-view">Ansicht</link> wählen, die die einzelnen Stunden des Tags darstellt. Sie können Tag, Arbeitswoche oder Woche wählen. Die Monatsansicht dagegen eignet sich eher für Aufgaben, siehe weiter unten.

source: In the main panel, double click the time and date when your event starts.
de: Doppelklicken Sie nun in der Hauptansicht auf den Tag und die Uhrzeit, an dem Ihr Termin beginnen soll.

source: A dialog with five tabs at the bottom of the window appears. Enter your data as described below.
de: Ein Fenster mit fünf Karteikarten unten erscheint. Geben Sie ihre Daten wie folgt ein:

source: <screeninfo>A screenshot of &korganizer;'s Edit Event dialog</screeninfo>
de: <screeninfo>Ein Bildschirmfoto vom Dialog <quote>Termin bearbeiten</quote></screeninfo>

source: <phrase>A screenshot of &korganizer;'s Edit Event dialog</phrase>
de: <phrase>Ein Bildschirmfoto vom Dialog <quote>Termin bearbeiten</quote></phrase>

source: <para>A screenshot of &korganizer;'s Edit Event dialog</para>
de: <para>Ein Bildschirmfoto vom Dialog <quote>Termin bearbeiten</quote></para>

source: This is a thorough description of the individual event window fields and widgets. Not all fields have to be filled in; some can be left empty. Read the <link linkend="entering-data-required-fields">Required fields</link> section for detailed information. And if you prefer to learn by example, there's one in the <link linkend="examples-entering-event">Entering event</link> section.
de: Dies ist eine detaillierte Beschreibung der einzelnen Felder und Optionen. Nicht alle Felder müssen ausgefüllt werden, einige können frei bleiben. Lesen Sie die Sektion <link linkend="entering-data-required-fields">Unbedingt nötige Felder</link> für genauere Informationen. Und ein Beispiel zur Termineingabe finden Sie im Abschnitt <link linkend="examples-entering-event">Termineingabe</link>.

source: Title:
de: Titel:

source: Enter short description of the event into the <guilabel>Title</guilabel> field. This description is the text shown on the &korganizer; main panel.
de: Geben Sie eine kurze Beschreibung des Eintrages im Feld <guilabel>Titel</guilabel> ein. Diese Beschreibung ist der Text, der im Hauptfenster von &korganizer; angezeigt wird.

source: Location:
de: Ort:

source: Enter short description of the <guilabel>location</guilabel> where the event will take place.
de: Geben Sie hier eine kurze Beschreibung des <guilabel>Orts</guilabel> ein, an dem der Termin statt finden soll.

source: <guilabel>Start</guilabel> and <guilabel>End</guilabel>
de: <guilabel>Start</guilabel> und <guilabel>Fällig</guilabel>

source: The &korganizer; suggested Start and End dates of your event. Events are expected to start and end on the same date. Change these dates as desired. Enter the dates directly or use the <link linkend="glossary" endterm="gloss-calendar-widget"> Calendar Widget</link>. Select the time from quarter hour intervals, or enter the desired time directly into the time fields. These fields are only available when the <guilabel>All Day</guilabel> box is not checked.
de: Von &korganizer; vorgeschlagene Start- und Enddaten ihres Termins. Standardmäßig geht &korganizer; davon aus, dass ein Termin an dem Tag endet, an dem er beginnt. Sie können das aber beliebig ändern. Geben Sie das Datum entweder direkt ein oder benutzen Sie das <link linkend="glossary" endterm="gloss-calendar-widget">Kalender-Fenster</link>. Wählen Sie bei der Zeiteingabe aus Viertelstunden-Intervallen oder geben Sie die Zeit direkt ein. Diese Felder stehen nur zur Verfügung, wenn <guilabel>Ganzer Tag</guilabel> nicht angekreuzt ist.

source: General Tab
de: Die Karteikarte Allgemein

source: Enter a long description of the event in the large, untitled rectangle. You can write as many details as you wish here. For example, If the event is, say, planned general repair of your car, you can list all items that need repairing. Later on you can print this list and hand it over to the serviceman. If the event is shopping, you should list the goods that you need to buy. Print the event and take it to the shop with you.
de: Sie können in dem großen Eingabefeld Details zu Ihrem Termin eingeben. Sie können dort beliebig viele Details eingeben. Einige Beispiele: Ihr Auto muss repariert werden. Dann können Sie hier auflisten, was alles repariert werden muss. Später können Sie die Liste ausdrucken und sie dem Mechaniker geben. - Wenn Sie Einkaufen wollen, können sie hier eine Einkaufsliste eintragen. Wenn Sie dann losgehen, drucken Sie diese einfach aus und nehmen sie mit.

source: <guilabel>Categories</guilabel>
de: <guilabel>Kategorien</guilabel>

source: You can assign several <link linkend="categories-view">categories</link> to a calendar item. Click the drop down box to display all available categories. Check the category boxes to assign suitable categories to the event.
de: Sie können einem Kalendereintrag mehrere <link linkend="categories-view">Kategorien</link> zuweisen. Klicken Sie auf das Auswahlfeld <guilabel>Kategorien</guilabel>, um die vorhandenen Kategorien anzuzeigen. Markieren Sie die Ankreuzfelder vor den passenden Kategorien für den Termin.

source: You can also add a new category, modify a category or delete a category in the <guilabel>Edit Categories</guilabel> dialog. Open this dialog with <menuchoice> <guimenu>Settings</guimenu> <guimenuitem>Manage Categories</guimenuitem></menuchoice>.
de: Im Dialog <guilabel>Kategorien</guilabel> können Sie Kategorien hinzufügen, bearbeiten und löschen. Diesen Dialog öffnen Sie mit <menuchoice> <guimenu>Einstellungen</guimenu> <guimenuitem>Kategorien verwalten</guimenuitem></menuchoice>.

source: Your language lesson at work may belong to both Business and Education categories, while the anniversary of your marriage belongs to either Personal or Special Occasion - it is your choice.
de: Ein Sprachkurs an Ihrer Arbeitsstätte könnte z.B. zu Geschäft und Bildung gehören. Ihr Hochzeitstag gehört aber entweder zu Persönlich oder Besonderes - das ist Ihre Entscheidung.

source: Access:
de: Zugriff:

source: Choose <guilabel>Public</guilabel>, <guilabel>Private</guilabel> or <guilabel>Confidential</guilabel> to keep the event private or confidential. Currently, this choice correctly sets the <quote>CLASS</quote> attribute of the events to <quote>PUBLIC</quote>, <quote>PRIVATE</quote> or <quote>CONFIDENTIAL</quote>. However, whether these settings are really used to restrict the access of the information depends on the client and/or groupware server implementation.
de: Wählen Sie <guilabel>Privat</guilabel> oder <guilabel>Vertraulich</guilabel> um ein Ereignis persönlich oder vertraulich zu behandeln. Zurzeit setzt diese Wahl das Attribut <quote>CLASS</quote> des Ereignisses zu <quote>PUBLIC</quote>, <quote>PRIVATE</quote> oder <quote>CONFIDENTIAL</quote>. Ob diese Einstellungen Ihre Informationen wirklich so behandelt hängt aber von dem verwendeten Klient und/oder Groupware Server ab.
