Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdepim/korganizer.po
Languages: de

source: The &korganizer; Handbook
de: Das Handbuch zu &korganizer;

source: Developer
de: Entwickler

source: Reviewer
de: Korrektur

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Stefan</firstname><surname>Winter</surname><affiliation><address><email>kickdown@online.de</email></address></affiliation><contrib>Deutsche &Uuml;bersetzung</contrib></othercredit><othercredit role="translator"><firstname>Oliver</firstname><surname>D&ouml;rr</surname><affiliation><address><email>digikam-de@doerr-privat.de</email></address></affiliation><contrib>Deutsche &Uuml;bersetzung</contrib></othercredit>

source: &korganizer; is an easy to use personal information manager (<acronym>PIM</acronym>). You can write journal entries, schedule appointments, events, and to-dos. &korganizer; will remind you about pending tasks, and help you keep your schedule.
de: &korganizer; ist ein einfach zu bedienender persönlicher Informationsmanager (<acronym>PIM</acronym>). Sie können Verabredungen, Termine und Aufgaben eingeben. &korganizer; erinnert Sie an ausstehende Aufgaben und hilft Ihnen dabei Ihren Zeitplan einzuhalten.

source: time
de: Zeit

source: schedule
de: Planer

source: reminder
de: Erinnerung

source: appointment
de: Verabredung

source: event
de: Termin

source: to-do
de: Aufgabe

source: Introduction
de: Einführung

source: &korganizer; is an intuitive and easy to use personal information manager (<abbrev>PIM</abbrev>). You can schedule appointments, events, create to-dos and write journal entries. &korganizer; will remind you about pending tasks, record your occurrences, experiences, and reflections and help you keep your schedule.
de: &korganizer; ist ein persönlicher Informationsmanager (<abbrev>PIM</abbrev>). Sie können Termine, Verabredungen, Aufgaben planen und Einträge in das Journal schreiben. &korganizer; erinnert Sie an ausstehende Aufgaben und hilft Ihnen dabei Ihren Zeitplan einzuhalten.

source: But &korganizer; is not only about your personal calendar, it can help you to interact with your colleagues and friends too. With &korganizer;, you can publish a calendar as a web page, invite anyone with an email address to an event and process responses, share a calendar (using a groupware server or simply a file over the network), and share events (&eg; the schedule of a championship or a conference), using the get hot new stuff framework. &korganizer; is based on open standards, and works with many different group scheduling servers, giving you the control over your information and the freedom to choose the best solutions.
de: Aber &korganizer; ist nicht nur Ihr persönlicher Kalender, es kann Ihnen auch dabei helfen mit Ihren Freunden und Kollegen zu interagieren. Mit &korganizer; können Sie Ihren Kalender als Webseite veröffentlichen, Einladungen zu einem Termin an alle verschicken, die eine E-Mail Adresse haben und die Antworten verwalten, einen Kalender mit einem Groupware-Server oder als einfache Datei über das Netzwerk teilen und Termine wie z. B. den Termin für eine Meisterschaft oder eine Konferenz mit anderen über die <quote>Neuen Erweiterungen</quote> koordinieren. &korganizer; basiert auf offenen Standards und arbeitet mit vielen unterschiedlichen Groupware-Servern zusammen, damit Sie Kontrolle über ihre Daten haben und die Freiheit, die für Sie beste Lösung zu wählen.

source: &korganizer; is also the calendar, journal and to-do component of &kontact;, offering you an integrated solution for your communication and information management needs: email, notes, contacts management, news reader and news feeds reader. Even if you do not use it inside &kontact;, &korganizer; is integrated with the other &kde; <acronym>PIM</acronym> applications. For instance, you can configure it to show birthdays from &kaddressbook; in your agenda, use &kmail; to send and receive invitations, &etc;
de: &korganizer; ist darüber hinaus die Kalender-, Journal- und Aufgabenkomponente von &kontact; und stellt Ihnen eine integrierte Lösung für Ihre Kommunikation und Informationsverwaltung zur Verfügung: E-Mail, Notizen, Verwaltung von Kontakten, News-Leser und Nachrichten-Sammler. Selbst wenn Sie &korganizer; nicht aus &kontact; benutzen, sind die anderen <acronym>PIM</acronym>-Anwendungen von &kde; integriert. Sie können es z. B. so konfigurieren, dass es die Geburtstage aus &kaddressbook; in Ihrer Agenda anzeigt und &kmail; benutzt, um Einladungen zu verschicken und zu empfangen.

source: Main features of &korganizer;:
de: Hauptfunktionen von &korganizer;:

source: Create To-dos, schedule events, and write journal entries.
de: Aufgaben erstellen, Termine planen und Einträge in das Journal schreiben.

source: Organize your events and to-dos by grouping the related items in categories.
de: Organisieren Sie Ihre Termine und Aufgaben, in dem Sie verwandte Punkte in Kategorien gruppieren.

source: Highlight categories with colors.
de: Heben Sie Ihre Kategorien mit Farben hervor.

source: Open multiple calendars, and seamlessly view and edit them.
de: Lassen Sie sich mehrere Kalender anzeigen und bearbeiten Sie diese gleichzeitig.

source: Reschedule your events by drag-and-drop.
de: Verschieben Sie Ihre Termine durch <quote>Ziehen und Ablegen</quote>.

source: Generate recurring events easily.
de: Einfache Erstellung wiederkehrender Termine

source: Organize or attend events using the group scheduling features.
de: Termine organisieren und an Terminen teilnehmen mit Hilfe der Gruppenfunktionen.

source: Choose among the multiple supported groupware servers.
de: Wählen Sie einen der unterstützten Groupware-Server

source: vCalendar and iCalendar (open standards) native support.
de: Unterstützung der offenen Standards vCalendar und iCalendar.

source: Calendar merging and import.
de: Kalender zusammenführen und importieren.

source: Drag-and-drop between open calendars.
de: <quote>Ziehen und Ablegen</quote> zwischen offenen Kalendern.

source: Embedding collaboration with &konqueror;.
de: Eingebettete Zusammenarbeit mit &konqueror;

source: Customizable icon sets.
de: Benutzerdefinierte Symbole.

source: Drag-and-drop tool panels.
de: <quote>Ziehen und Ablegen</quote> in den Werkzeugleisten.

source: Much more...
de: Vieles mehr ...

source: Now take a <link linkend="five-minute-course">Five-minute fly-over course</link> of &korganizer;, or delve into <link linkend="managing-data">the documentation</link>!
de: Unternehmen Sie nun einen Ausflug mit dem <link linkend="five-minute-course">Fünf-Minuten-Überblick </link> über &korganizer; oder tauchen Sie ein in die <link linkend="managing-data">Dokumentation </link>.

source: Five-minute Fly-over Course of &korganizer;
de: Fünf-Minuten-Überblick über &korganizer;

source: (for the experienced and for the impatient)
de: (für die Erfahrenen und Ungeduldigen)

source: Pressed for time? Let's get you kick-started with a fast, hands-on overview of &korganizer;!
de: Keine Zeit? Dann sind Sie hier beim Überblick über &korganizer; genau richtig.

source: If you ever worked with a personal information program before, you'll be right at home with &korganizer;. You can enter new events, reschedule existing events, assign categories to your events, devise new categories, enter and modify lists of attendees and their roles, email event invitations automatically and exchange data with other &korganizer; calendars, create to-dos and write journal entries.
de: Wenn Sie bereits einen Informationsmanager benutzt haben, werden Sie sich bei &korganizer; wie zu Hause fühlen. Sie können neue Termine eingeben, bestehende ändern, den Terminen Kategorien zuordnen, neue Kategorien erstellen, Listen von Mitarbeitern und deren Aufgaben erstellen, Einladungen zu Terminen automatisch per E-Mail versenden und Daten mit anderen &korganizer;-Kalendern austauschen.

source: This course assumes that you know how to work with the &kde;, and that you prefer to explore on your own. Only the basic functions of &korganizer; are covered here.
de: Dieser Überblick geht davon aus, dass Sie sich mit der &kde; auskennen und dass Sie es vorziehen, auf eigene Faust zu experimentieren. Hier werden nur die Basisfunktionen von &korganizer; erläutert.

source: Entering Events
de: Eingabe von Terminen

source: Click the <inlinemediaobject><imageobject> <imagedata fileref="view-calendar-agenda.png" format="PNG"/></imageobject> </inlinemediaobject><guibutton>Agenda</guibutton> toolbar button or choose the <menuchoice><guimenu>View</guimenu> <guimenuitem>Agenda</guimenuitem></menuchoice> menu item. This will bring up the <link linkend="agenda-view"><guilabel>Agenda View</guilabel> </link>.
de: Klicken Sie auf den Knopf <inlinemediaobject><imageobject> <imagedata fileref="view-calendar-agenda.png" format="PNG"/></imageobject> </inlinemediaobject><guibutton>Tagesansicht</guibutton> in der Werkzeugleiste oder wählen Sie <menuchoice><guimenu>Ansicht</guimenu> <guimenuitem>Tagesansicht</guimenuitem></menuchoice> im Menü aus, um die <link linkend="agenda-view"><guilabel>Terminplanansicht</guilabel> </link> anzuzeigen.

source: Click on the desired date in the <link linkend="glossary" endterm="gloss-date-navigator">Date Navigator</link>.
de: Klicken Sie auf das gewünschte Datum im <link linkend="glossary" endterm="gloss-date-navigator">Datumsnavigator</link>.

source: Select the text area beside the desired hour in the main panel that reflects the time of the event. Double click this area, or just start typing the title of the event to open the <guilabel>New Event</guilabel> dialog.
de: Wählen Sie den Textbereich neben der gewünschten Stunde für den Termin im Hauptfenster und führen Sie einen Doppelklick darauf aus. Alternativ können Sie auch einfach mit der Eingabe des Titel für den Termin beginnen, um das Fenster für einen <guilabel>Neuen Termin</guilabel> zu öffnen.

source: <link linkend="entering-data-events">Enter event details</link>. Use the five tabs at the bottom of the window to move around the dialog and access all the event's characteristics.
de: <link linkend="entering-data-events">Termindetails eingeben</link>. Benutzen Sie die fünf Karteikarte unten, um sich im Dialog zu bewegen und alle Eigenschaften des Termins festzulegen.

source: Press <guibutton>OK</guibutton> to save the event.
de: Klicken Sie auf <guibutton>OK</guibutton>, um den Termin zu speichern.

source: Entering To-dos
de: Aufgaben eingeben

source: Select the <xref linkend="menu-actions-new-todo"/> menu item to open the <guilabel>New To-do</guilabel> dialog.
de: Wählen Sie im Menü <xref linkend="menu-actions-new-todo"/> aus, um den Dialog <guilabel>Neue Aufgabe</guilabel> zu öffnen.

source: <link linkend="entering-data-to-do">Enter the to-do details</link>. Use the five tabs at the bottom of the window to move around the dialog and access all the event's characteristics.
de: <link linkend="entering-data-to-do">Aufgabendetails eingeben</link>. Benutzen Sie die fünf Karteikarten unten, um sich im Dialog zu bewegen und alle Eigenschaften des Termins festzulegen.

source: Press <guibutton>OK</guibutton> to save the to-do.
de: Klicken Sie auf <guibutton>OK</guibutton>, um die Aufgabe zu speichern.

source: Adding Journal Entries
de: Journaleinträge hinzufügen

source: Select the <inlinemediaobject><imageobject> <imagedata fileref="view-calendar-journal.png" format="PNG"/></imageobject> </inlinemediaobject><menuchoice><guimenu>View</guimenu> <guimenuitem>Journal</guimenuitem></menuchoice> menu item to open the <link linkend="journal-view"><guilabel>Journal</guilabel> main view</link>.
de: Wählen Sie den Eintrag <inlinemediaobject><imageobject> <imagedata fileref="view-calendar-journal.png" format="PNG"/></imageobject> </inlinemediaobject><menuchoice><guimenu>Ansicht</guimenu> <guimenuitem>Journal</guimenuitem></menuchoice> im Menü, um die <link linkend="journal-view">Hauptansicht des <guilabel>Journals</guilabel></link> anzuzeigen.

source: Select the <menuchoice><guimenu>Actions</guimenu> <guimenuitem>New Journal</guimenuitem></menuchoice> menu item.
de: Wählen Sie im Menü <menuchoice> <guimenu>Aktionen</guimenu> <guimenuitem>Neues Journal ...</guimenuitem> </menuchoice>.

source: Enter journal entry title and text.
de: Journaltitel und -text eingeben.

source: Rescheduling Events
de: Termine verschieben

source: Rescheduling events is a simple drag-and-drop operation:
de: Das Verschieben von Terminen ist eine einfache <quote>Ziehen und Ablegen</quote>-Operation:

source: Using the <link linkend="glossary" endterm="gloss-date-navigator">Date Navigator</link> go to the date of the event that you want to reschedule.
de: Benutzen Sie den <link linkend="glossary" endterm="gloss-date-navigator">Datumsnavigator</link>, um zu dem Datum zu wechseln, an dem Sie einen Termin verschieben möchten.

source: You should choose an appropriate <link linkend="reference-menus-view">view</link> before beginning this operation. Only the <link linkend="agenda-view"><guilabel>Agenda</guilabel> view </link> (Day, Work Week and Week views) shows individual hours and are suitable for rescheduling exactly-timed events (appointments), while the Month view only shows days. Therefore the Month view is most suitable for long-term events like holidays.
de: Zuvor sollten Sie eine passende <link linkend="reference-menus-view">Ansicht</link> wählen. Nur die <link linkend="agenda-view"><guilabel>Terminplanansicht</guilabel> </link> (Tag-, Arbeitswoche- und die Wochenansicht) zeigt einzelne Stunden an und ist für das Verschieben von Terminen mit Angabe der Uhrzeit geeignet, wohingegen die Monatsansicht nur die Tage anzeigt. Daher ist die Monatsansicht am besten für Langzeittermine wie Urlaub geeignet.

source: To display the Week view select the Agenda view, press the <inlinemediaobject><imageobject> <imagedata fileref="view-calendar-week.png" format="PNG"/></imageobject> </inlinemediaobject><guibutton>Week</guibutton> view toolbar button, or choose the <menuchoice><guimenu>Go</guimenu> <guimenuitem>Week</guimenuitem></menuchoice> menu item.
de: Um die Wochenansicht anzuzeigen, wechseln Sie zur Terminplanansicht und drücken dann den Knopf <inlinemediaobject><imageobject> <imagedata fileref="view-calendar-week.png" format="PNG"/></imageobject> </inlinemediaobject><guibutton>Woche</guibutton> aus der Werkzeugleiste oder wählen im Menü <menuchoice><guimenu>Gehe zu</guimenu> <guimenuitem>Woche</guimenuitem></menuchoice> aus.

source: Drag and drop the event to the new date and time location.
de: Halten Sie die Maustaste gedrückt, ziehen Sie den Termin zu seinem neuen Datum bzw. zur neuen Uhrzeit und lassen Sie dann die Maustaste los.

source: If you wish to reschedule more precisely, double-click the event and change the start and end time using the drop down menus that divide the day into quarter hours. If that is not precision enough, you can enter the desired time directly.
de: Wenn Sie den Termin noch exakter verschieben möchten, klicken Sie auf diesen und ändern Sie die Start- und Endzeit mit den Menüs, die den Tag in Viertelstunden teilen. Wenn diese Genauigkeit nicht ausreicht, können Sie die gewünschte Zeit auch direkt eingeben.

source: Rescheduling or Editing To-dos
de: Verschieben oder Bearbeiten von Aufgaben

source: You should choose an appropriate <link linkend="reference-menus-view">view</link> before beginning this operation. Only the <link linkend="todo-view"><inlinemediaobject><imageobject> <imagedata fileref="view-calendar-tasks.png" format="PNG"/></imageobject> </inlinemediaobject><guilabel>To-do List</guilabel> view </link> and <link linkend="description-view">the To-do View sidebar component </link> show to-dos which do not have a due date.
de: Sie sollten eine passende <link linkend="reference-menus-view">Ansicht</link> wählen, bevor Sie hiermit anfangen. Nur die <link linkend="todo-view"><inlinemediaobject><imageobject> <imagedata fileref="view-calendar-tasks.png" format="PNG"/></imageobject> </inlinemediaobject><guilabel>Aufgabenliste</guilabel> </link> und die <link linkend="description-view">Aufgabenliste in der Seitenleiste</link> zeigen die Aufgaben an, die unbefristet sind.

source: To display the To-do List view, press the <inlinemediaobject><imageobject> <imagedata fileref="view-calendar-tasks.png" format="PNG"/></imageobject> </inlinemediaobject><guibutton>To-do List</guibutton> view toolbar button, or choose the <menuchoice><guimenu>View</guimenu> <guimenuitem>To-do List</guimenuitem></menuchoice> menu item.
de: Um die Aufgabenliste anzuzeigen, drücken Sie den Knopf <inlinemediaobject><imageobject> <imagedata fileref="view-calendar-tasks.png" format="PNG"/></imageobject> </inlinemediaobject><guibutton>Aufgabenliste</guibutton> in der Werkzeugleiste, oder wählen Sie <menuchoice><guimenu>Ansicht</guimenu> <guimenuitem>Aufgabenliste</guimenuitem></menuchoice> aus dem Menü.

source: To reschedule a to-do, right click it. This will bring up a context menu. Choose the <guimenuitem>Copy to</guimenuitem> or <guimenuitem>Move to</guimenuitem> menu items and select the new date from the calendar now appearing. The to-do is now copied or moved to the selected date. Alternatively, if the main panel holds a <guilabel>To-do List</guilabel> view, just right click the column <guilabel>Due Date/Time</guilabel>. A calendar will appear instantly, allowing you to set the new due date.
de: Um eine Aufgabe zu verschieben, klicken Sie mit der rechten Maustaste auf die Aufgabe. Wählen Sie <guimenuitem>Kopieren nach</guimenuitem> oder <guimenuitem>Verschieben nach</guimenuitem> im Kontextmenü, und wählen Sie im angezeigten Kalender das neue Datum aus. Die Aufgabe wird an das ausgewählte Datum kopiert oder verschoben. Alternativ, wenn im Hauptfenster die <guilabel>Aufgabenliste</guilabel> zu sehen ist, können Sie auch mit der rechten Maustaste auf die Spalte <guilabel>Fällig</guilabel> klicken. Im Kalender können Sie das Datum neu setzen.

source: To <link linkend="entering-data-to-do">edit a to-do</link>, right click it and choose the <guimenuitem>Edit...</guimenuitem> menu item.
de: Um eine <link linkend="entering-data-to-do">Aufgabe zu bearbeiten</link>,klicken Sie mit der rechten Maustaste darauf und wählen <guimenuitem>Bearbeiten...</guimenuitem> aus dem Kontextmenü.

source: Conclusion
de: Zusammenfassung

source: This five-minute course covered only the basic operation of &korganizer;. Now you should go on and read the rest of this manual to unleash the full power of &korganizer;'s capabilities. But if you do not feel like it, you should at least skip through the <link linkend="faq">&FAQ;</link>.
de: Dieser Fünf-Minuten-Kurs hat nur die Basisfunktionen von &korganizer; abgedeckt. Sie sollten jetzt weiterlesen, damit Sie den vollen Umfang der Fähigkeiten von &korganizer; kennenlernen. Falls Sie das nicht wollen, sollten Sie sich aber auf jeden Fall die <link linkend="faq">&FAQ;</link> anschauen.

source: Importing, Exporting, and Managing Calendars
de: Import, Export und Verwaltung von Kalendern

source: &korganizer; can store (and retrieve) events, journal entries and to-dos using various methods, and to different locations. Each of these locations is called a <firstterm>calendar resource</firstterm>.
de: &korganizer; kann Termine, Journaleinträge und Aufgaben mit verschiedenen Methoden an unterschiedlichen Orten speichern und laden. Jeder dieser Orte wird als <firstterm>Kalender-Ressource</firstterm> bezeichnet.

source: &korganizer; supports calendar files based on standards such as iCalendar and vCalendar natively (adding them as new resources), but you can import the data (merge) into an existing resource and open the file in a new window too. Importing files in the format used by the old <application>ical</application> application is also supported.
de: &korganizer; unterstützt Kalenderdateien, die auf Standards wie iCalendar und vCalendar basieren. Diese können als neue Ressource hinzugefügt, ihre Daten in eine existierende Ressource importiert oder in einem neuen Fenster geöffnet werden. Der Import von Dateien im Format des alten Programms <application>ical</application> wird ebenfalls unterstützt.

source: You can export your data as a web page, as an iCalendar or vCalendar file. These files are supported by most scheduling applications. The web page can be used to publish your calendar and to-do list on the web or on the local network.
de: Sie können Daten als Webseite, als iCalendar- oder als vCalendar-Datei exportieren. Diese Dateien werden von den meisten Terminverwaltungsprogrammen unterstützt. Die Webseite können Sie benutzen, um Ihren Kalender und Aufgaben im Web oder im lokalen Netzwerk zu veröffentlichen.

source: In this chapter, we will explain how to manage your calendar, using the resources, import and export actions and the get hot new stuff scheme.
de: In diesem Kapitel werden wir Ihnen erklären wie Sie Ihren Kalender mit Ressourcen verwalten, Aktionen importieren und exportieren und das <quote>Neue Erweiterungen</quote> Schema nutzen.

source: Calendar Resources
de: Kalender-Ressourcen

source: &korganizer; uses a local file, usually <filename>$KDEHOME/share/apps/korganizer/std.ics</filename>, as its default resource. But this is not your only option: there are several other resources you can add: groupware servers, journal entries as blogs, network files, &etc; If you use more than one resource, &korganizer; <link linkend="config-main-general-personal">can be configured to use the default resource or ask which resource to use</link> when saving new events, to-dos or journal entries. &korganizer; will seamlessly merge the items from two or more resources in the <link linkend="description-view">views</link>.
de: &korganizer; benutzt eine lokale Datei, normalerweise<filename>$KDEHOME/share/apps/korganizer/std.ics</filename>, als Standardressource. Dies ist aber nicht Ihre einzige Option, es existieren verschiedene andere Ressourcen, die Sie hinzufügen können: Groupware-Server, Journaleinträge als Blogs, Dateien im Netzwerk &etc; Wenn Sie mehr als eine Ressource benutzen, kann &korganizer; <link linkend="config-main-general-personal"> eingerichtet werden, eine Standardressource zu benutzen oder nachzufragen, welche Ressource verwendet werden soll</link>, wenn Termine, Aufgaben und Journaleinträge gespeichert werden sollen. &korganizer; integriert die Einträge von zwei oder mehr Ressourcen nahtlos in den <link linkend="description-view">Ansichten</link>.

source: The default resource is a good choice for many use cases, but you may want to use another resource, especially if you use a supported groupware server. Please ask the server administrator for the information required to configure the groupware resource, including free/busy information publishing and retrieving. Access to free/busy information allows an event organizer to take the attendee's calendar into consideration when adding him to the event's attendee list.
de: Die Standardressource ist für viele Anwendungen eine gute Wahl, aber möglicherweise möchten Sie eine andere Ressource benutzen, insbesondere wenn Sie z. B. einen der unterstützten Groupware-Server benutzen. Bitte fragen Sie Ihren Server-Administrator nach den Informationen zur Konfiguration, inklusive der Informationen wie Frei/Belegt gesendet und empfangen werden kann. Der Zugriff auf die Frei/Belegt-Informationen erlaubt es einem Organisator, den Kalender von Teilnehmern abzufragen, wenn diese der Teilnehmerliste eines Ereignisses hinzugefügt wird.
