Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdepim/korganizer.po
Languages: de

source: If the <guilabel>Show items that recur daily</guilabel> box is checked, the days containing daily recurring events are shown in bold typeface in the Date Navigator.
de: Wenn <guilabel>Täglich wiederkehrende Termine anzeigen</guilabel> angekreuzt ist, werden Tage mit täglich wiederkehrenden Terminen im Navigator in Fettschrift angezeigt.

source: Show items that recur weekly
de: Wöchentliche wiederkehrende Ereignisse anzeigen

source: If the <guilabel>Show items that recur weekly</guilabel> box is checked, the days containing weekly recurring events are shown in bold typeface in the Date Navigator.
de: Wenn <guilabel>Wöchentlich wiederkehrende Ereignisse anzeigen</guilabel> angekreuzt ist, werden Tage mit wöchentlich wiederkehrenden Ereignissen im Navigator in Fettschrift angezeigt.

source: Show to-dos instead of events when in Todo View
de: Aufgaben statt Ereignisse anzeigen (in der Aufgaben-Ansicht)

source: Check this box to show the days containing to-dos in bold typeface in the Date Navigator when in To-do view.
de: Aktivieren Sie diese Einstellung, um Tage mit anstehenden Aufgaben in Fettschrift im Datumsnavigator darzustellen, falls die Aufgaben-Ansicht aktiviert ist.

source: Show journals instead of events when in Journal View
de: Journale statt Ereignisse anzeigen (in der Journal-Ansicht)

source: Check this box to show the days containing journals in bold typeface in the Date Navigator when in Journal view.
de: Aktivieren Sie diese Einstellung, um Tage mit Journalen in Fettschrift im Datumsnavigator darzustellen, falls die Journal-Ansicht aktiviert ist.

source: Week numbers select a work week when in work week mode
de: Beim Klick auf Wochenzahlen Arbeitswochen statt Kalenderwochen auswählen

source: If the <guilabel>Week numbers select a work week when in work week mode</guilabel> box is checked, clicking on the week numbers along the side of the Date Navigator will navigate through work weeks rather than through normal 7-day weeks.
de: Aktivieren Sie diese Einstellung, so wird bei einem Klick auf eine Kalenderwoche an der Seite des Datumsnavigators die Arbeitswoche anstelle der ganzen Woche mit sieben Tagen ausgewählt.

source: Agenda View tab
de: Terminplanansicht

source: <link linkend="agenda-view">Agenda View</link> options:
de: Einstellungen für die <link linkend="agenda-view">Terminplanansicht</link>:

source: Hour size:
de: Darstellungsgröße einer Stunde:

source: By using this you can control the height of the rows in the Agenda view.
de: Mit diesem Schieberegler können Sie die Höhe der Zeilen in der Terminplanansicht einstellen.

source: Show icons in agenda view items
de: Ereignis-Symbole in Terminplanansicht anzeigen

source: Check this box to display icons (reminder, recursion &etc;) in Agenda view items
de: Aktivieren Sie diese Einstellung, um in der Terminplanansicht auch Symbole anzeigen zu lassen (Erinnerung, Wiederholung &etc;)

source: Show to-dos
de: Aufgaben anzeigen

source: This check box toggles the display of to-dos in the Day, Week and Month views in the Agenda view. If you have too many to-dos which have a due date associated, you may want to turn them off to avoid clutter.
de: Mit dieser Option schalten Sie die Anzeige der Aufgaben in den Terminplanansicht an und aus. Falls Sie viele Aufgaben mit einem Enddatum haben, wollen Sie diese eventuell nicht angezeigt bekommen, um Verwirrung zu vermeiden.

source: Show current-time (Marcus Bains) line
de: Aktuelle Zeit (Marcus-Bains-Linie) anzeigen

source: This check box toggles on or off a red line in the Day or Week view indicating the current time (Marcus Bains line). This line gives you an indication of how much time is left &eg; until a meeting takes place.
de: Wenn diese Option eingeschaltet ist, wird die aktuelle Uhrzeit mit einer roten Linie (Marcus-Bains-Linie) angezeigt. Damit können Sie in etwa sehen, wieviel Zeit z.B. noch übrig ist, bis etwa ein Meeting beginnt.

source: Show seconds on current-time (Marcus Bains) line
de: Sekunden auf der Marcus-Bains-Linie anzeigen

source: This check box toggles on or off the seconds on the current-time line (Marcus Bains line).
de: Diese Option schaltet die Anzeige der Sekunden auf der aktuellen Zeitlinie (Marcus-Bains-Linie) an und aus.

source: Time range selection in agenda view starts event editor
de: Auswahl eines Zeitraums in der Terminplanansicht startet den Ereigniseditor

source: Check this box to start the event editor automatically when you select a time range in the daily and weekly view. To select a time range, drag the mouse from the start time to the end time of the event you are about to plan.
de: Benutzen Sie diese Option wenn der Termineditor automatisch gestartet werden soll, sobald Sie einen Zeitbereich in der Tages- oder Wochenansicht auswählen. Um eine Zeitbereich auszuwählen müssen Sie die Maus nur von der Startzeit zur Endzeit Ihres Termins ziehen und dort ablegen.

source: Color Usage
de: Farbverwendung

source: Select the <guilabel>Category inside, calendar outside</guilabel> option if you would like to draw calendar items in their associated category color, with the item's border drawn in the color of its calendar.
de: Wählen Sie die Einstellung<guilabel>Kategoriefarbe innen, Kalenderfarbe außen</guilabel>, wenn Kalendereinträge mit der zugeordneten Kategoriefarbe angezeigt werden sollen, und die Umrandung in der Farbe des Kalenders.

source: Select the <guilabel>Calendar inside, category outside</guilabel> option if you would like to draw calendar items in their associated calendar color, with the item's border drawn in the color of its category.
de: Wählen Sie die Einstellung <guilabel>Kalenderfarbe innen, Kategoriefarbe außen</guilabel>, wenn Kalendereinträge mit der zugeordneten Farbe des Kalenders angezeigt werden sollen, und die Umrandung in der Farbe der Kategorie.

source: Select the <guilabel>Only category</guilabel> option if you would like to draw calendar items (both inside and border) in the color of their associated category.
de: Wählen Sie die Einstellung <guilabel>Nur Kategoriefarbe</guilabel>, wenn Kalendereinträge (innen und außen) in der zugeordneten Kategoriefarbe angezeigt werden sollen.

source: Select the <guilabel>Only calendar</guilabel> option if you would like to draw calendar items (both inside and border) in the color of their calendar.
de: Wählen Sie die Einstellung <guilabel>Nur Kalenderfarbe</guilabel>, wenn Kalendereinträge (innen und außen) in der zugeordneten Farbe des Kalenders angezeigt werden sollen.

source: Please use the <link linkend="config-main-colors">Colors and Fonts</link> configuration page for setting these colors.
de: Die Farben für Kalender und Ressourcen können Sie im Einstellungsdialog unter <link linkend="config-main-colors">Farben und Schriftarten</link> einrichten.

source: Color busy days with a different background color
de: Belegte Tage mit einer anderen Hintergrundfarbe anzeigen

source: Check this box if you want Agenda view's background to be filled with a different color on days which have at least one all day event marked as busy.
de: Wählen Sie diese Einstellung, falls der Hintergrund der Tagesansicht an Tagen mit mindestens einem als belegt markierten Ganztagstermin in einer anderen Farbe ausgefüllt werden soll.

source: Please look in the Colors configuration area to select the Agenda view background busy color of your choosing.
de: Auf der Karteikarte „Farben“ im Einrichtungsdialog stellen Sie für die Terminplanansicht eine Hintergrundfarbe für belegte Tage ein.

source: Multiple Calendar Display
de: Multi-Kalender-Ansicht

source: Select if all calendars should be merged into one Agenda view, each calendar should be displayed in its own Agenda view or if each view should be available via tabs. The side by side view can be customized with <guimenuitem>Configure View</guimenuitem> from the context menu.
de: Wählen Sie hier aus, ob alle Kalender in einer Ansicht, ob jeder Kalender in einer eigenen Ansicht oder ob beide Ansichtsarten in einzelnen Unterfenstern angezeigt werden sollen. Werden Kalender nebeneinander angezeigt, können Sie diese Ansicht mit <guimenuitem>Ansicht einrichten</guimenuitem>aus dem Kontextmenü Ihren Bedürfnissen anpassen.

source: Month View tab
de: Monatsansicht

source: <link linkend="month-view">Month view</link> options:
de: Optionen der <link linkend="month-view">Monatsansicht</link>:

source: Display Options
de: Anzeigeoptionen

source: Use the first four check boxes to display the time, icons (reminder, recursion &etc;), to-dos or journals in Month view.
de: Benutzen Sie die ersten vier Ankreuzfelder, um Zeit, Symbole (Erinnerungen, Wiederholungen &etc;), Aufgaben oder Journale in der Monatsansicht anzuzeigen.

source: Month view uses full window
de: Monatsansicht fensterfüllend anzeigen

source: If you check this box, the Month view will be displayed in the whole &korganizer; window instead of sharing the window with the sidebar (the Date Navigator, the to-dos and the calendar resources).
de: Wenn Sie diese Option einschalten, wird die Monatsansicht im gesamten &korganizer;-Fenster angezeigt, und teilt sich das Fenster nicht mit dem Datumsnavigator, den Aufgaben und den Kalendern.

source: Check this box if you want Month view's background to be filled with a different color on days which have at least one all day event marked as busy.
de: Wählen Sie diese Einstellung, falls der Hintergrund der Monatsansicht an Tagen mit mindestens einem als belegt markierten Ganztagstermin in einer anderen Farbe ausgefüllt werden soll.

source: Please look in the Colors configuration area to select the Agenda/Month view background busy color of your choosing.
de: Auf der Karteikarte „Farben“ im Einrichtungsdialog stellen Sie für die Tagesplan- oder Monatsansicht eine Hintergrundfarbe für belegte Tage ein.

source: Configure the colors for the Month view as in <link linkend="config-main-views-agenda">Agenda view</link>.
de: Stellen Sie die Farben für die Monatsansicht wie in den <link linkend="config-main-views-agenda">Terminplanansichten</link> ein.

source: Todo View tab
de: Aufgaben-Ansicht

source: <link linkend="todo-view">Todo view</link> options:
de: Optionen der <link linkend="todo-view">Aufgaben-Ansicht</link>:

source: Always display completed to-dos at the bottom of the list
de: Erledigte Aufgaben immer an Ende der Liste anzeigen

source: If you enable this option, all completed to-dos will be always grouped at the bottom of the To-do List.
de: Aktivieren Sie diese Einstellung, wenn abgeschlossene Aufgaben immer am Ende der Liste gruppiert werden sollen.

source: To-do list view uses full window
de: Aufgabenliste fensterfüllend anzeigen

source: Enable this option to use the full &korganizer; window when displaying the To-do List view. You will gain some space for the To-do List view, but other widgets, such as the Date Navigator, the to-do details and the calendars list, will not be displayed.
de: Aktivieren Sie diese Einstellung, wenn bei der Aufgabenansicht das gesamte &korganizer;-Fenster benutzt werden soll. Dadurch bekommen Sie mehr Platz für die Aufgabenansicht. Allerdings werden andere Elemente, wie zum Beispiel der Datumsnavigator, die Detailansicht von Aufgaben und die Kalenderliste nicht angezeigt.

source: Record completed to-dos in journal entries
de: Erledigte Aufgaben in Journaleinträgen aufzeichnen

source: If you check this box, &korganizer; will automatically add a journal entry for every completed to-do.
de: Wenn Sie diese Option einschalten wird &korganizer; automatisch einen Journaleintrag für jede erledigte Aufgabe hinzufügen.

source: Colors and Fonts
de: Farben und Schriftarten

source: Colors
de: Farben

source: Choose the color used for holidays, for highlighting, and for specific event categories. You can choose a different color for each category. Of course too many colors may be confusing, so use common sense. The use of color depends also on the <link linkend="config-main-views">view preferences.</link>
de: Wählen Sie die Farben für Feiertage, Hervorhebungen und für die Ereigniskategorien aus. Sie können für jede Kategorie verschiedene Farben wählen. Zu viele Farben wirken normalerweise verwirrend, lassen Sie also Vernunft walten. Ihre Farben hängen ebenfalls von den <link linkend="config-main-views">Ansichtseinstellungen</link> ab.

source: Holiday color
de: Farbe für Ferien/Feiertage

source: This button opens the <guilabel>Select Color</guilabel> dialog, allowing you to select the holiday color. The holiday color will be used for the holiday name in the Month view and the holiday date in the Date Navigator.
de: Dieser Knopf öffnet den Dialog <guilabel>Farbauswahl</guilabel> und erlaubt es Ihnen Ihre Farbe für Ferien/Feiertage auszuwählen. Die Farbe für Ferien/Feiertage wird für den Namen der Ferien/Feiertage in der Monatsansicht und der Feriendatum im Datumsnavigator benutzt.

source: Agenda view background color
de: Hintergrundfarbe für Terminplanansicht

source: This button opens the <guilabel>Select Color</guilabel> dialog, allowing you to select the Agenda view background color.
de: Dieser Knopf öffnet den Dialog <guilabel>Farbauswahl</guilabel> und erlaubt es Ihnen die Hintergrundfarbe für die Terminplanansicht auszuwählen.

source: Busy days background color
de: Hintergrundfarbe für belegte Tage

source: This button opens the <guilabel>Select Color</guilabel> dialog, allowing you to select the Agenda or Month view background busy color. This color is only used when the option for drawing busy days with a different color is set in either of these views.
de: Dieser Knopf öffnet den Dialog <guilabel>Farbauswahl</guilabel> und erlaubt es Ihnen die Hintergrundfarbe für belegte Tage in den Terminplan- und Monatsansichten auszuwählen. Diese Farbe wird nur dann verwendet, wenn die Einstellung <guilabel>Belegte Tage mit einer anderen Hintergrundfarbe anzeigen</guilabel> in einer dieser Ansichten aktiviert ist.

source: Agenda view current-time line color
de: Farbe der Marcus-Bains-Linie in der Terminplanansicht

source: This button opens the <guilabel>Select Color</guilabel> dialog, allowing you to select a color for the current-time (Marcus Bains) line.
de: Dieser Knopf öffnet den Dialog <guilabel>Farbauswahl</guilabel> und erlaubt es Ihnen eine Farbe für die aktuelle Zeit (Marcus-Bains-Linie) in der Terminplanansicht auszuwählen.

source: Working hours color
de: Farbe für Arbeitsstunden

source: This button opens the <guilabel>Select Color</guilabel> dialog, allowing you to select the color of the working hours background in the Agenda view.
de: Dieser Knopf öffnet den Dialog <guilabel>Farbauswahl</guilabel> und erlaubt es Ihnen, die Farbe für Anzeige der Arbeitsstunden in der Terminplanansicht auszuwählen.

source: To-do due today color
de: Farbe für heute fällige Aufgaben

source: This button opens the <guilabel>Select Color</guilabel> dialog, allowing you to select the to-do due today color.
de: Dieser Knopf öffnet den Dialog <guilabel>Farbauswahl</guilabel> und erlaubt es Ihnen, die Farbe für die für heute fälligen Aufgaben auszuwählen.

source: To-do overdue color
de: Farbe für überfällige Aufgaben

source: This button opens the <guilabel>Select Color</guilabel> dialog, allowing you to select the to-do overdue color.
de: Dieser Knopf öffnet den Dialog <guilabel>Farbauswahl</guilabel> und erlaubt es Ihnen, die Farbe für überfällige Aufgaben auszuwählen.

source: This group allows you to assign a color to each category. Select a category in the drop down list, and press the button to open the <guilabel>Select Color</guilabel> dialog, allowing you to select the color for that category. <link linkend="config-main-views">Depending on the view preferences</link>, this color will be used to mark events and to-dos which belong to this category in the Agenda and Month views.
de: Dieser Eintrag erlaubt es Ihnen jeder Kategorie eine Farbe zuzuweisen. Wählen Sie dazu die Kategorie aus, drücken Sie den Knopf für die <guilabel>Farbauswahl</guilabel> und wählen Sie die gewünschte Farbe aus. <link linkend="config-main-views">Abhängig von Ihren Einstellungen der Ansicht</link> wird diese Farbe benutzt, um Termine und Aufgaben dieser Kategorie in der Tages- und Monatsansicht zu markieren.

source: Resources
de: Ressourcen

source: This group allows you to assign a color to each resource. Select a resource in the drop down list, and press the button to open the <guilabel>Select Color</guilabel> dialog, allowing you to select the color for that resource. <link linkend="config-main-views">Depending on the view preferences</link>, this color will be used to mark events and to-dos which are stored using this resource in the Agenda and Month views.
de: Dieser Eintrag erlaubt es Ihnen jeder Ressource eine Farbe zuzuweisen. Wählen Sie dazu die Ressource aus, drücken Sie den Knopf für die <guilabel>Farbauswahl</guilabel> und wählen Sie die gewünschte Farbe aus. <link linkend="config-main-views">Abhängig von Ihren Einstellungen der Ansicht</link> wird diese Farbe benutzt, um Termine und Aufgaben dieser Ressource in der Tages- und Monatsansicht zu markieren.

source: Fonts tab
de: Schriften

source: Time bar
de: Zeitleiste

source: Press this button to pick the font, font style and size for the time bar.
de: Benutzen Sie diesen Knopf, um Schriftart, Schriftgröße und Schriftstil für die Zeitleiste zu ändern.

source: Month view
de: Monatsansicht

source: Press this button to pick the font, font style and size for the Month view.
de: Benutzen Sie diesen Knopf um Schriftart, Schriftgröße und Schriftstil für die Monatsanzeige zu ändern.

source: Agenda view
de: Terminplanansicht

source: Press this button to pick the font, font style and size for the Agenda view (Day, Week and Work Week views).
de: Benutzen Sie diesen Knopf um Schriftart, Schriftgröße und Schriftstil für die Tages-, Wochen- und Arbeitswochenansicht zu ändern.

source: Current-time line
de: Anzeige der aktuellen Zeit

source: Press this button to pick the font, font style and size for the Marcus Bains line (a colored line in the Agenda view indicating the current time).
de: Benutzen Sie diesen Knopf um Schriftart, Schriftgröße und Schriftstil für die Marcus-Bains-Linie (eine farbige Linie in der Terminplanansicht, die die aktuelle Zeit angibt) zu ändern.

source: Use Groupware Communication
de: Groupware-Kommunikation verwenden

source: Check this box to automatically send emails when creating, updating or deleting events or to-dos which involve others. This email can be an invitation to attendees of an event you created, a cancellation of an event you created, an answer or an update on your invitation status, an event change request, &etc; Check this option if you want to use the groupware functionality (&eg; Configuring &kontact; as a &kde; <guilabel>Kolab</guilabel> client).
de: Schaltet das automatische Verwenden von E-Mails beim Erzeugen, Aktualisieren und Löschen von Terminen, Aufgaben und Journal-Einträgen ein. Wählen Sie diese Option an, wenn Sie die Groupware-Funktionalität verwenden wollen, &eg; wenn &kontact; als &kde;-<guilabel>Kolab</guilabel>-Client konfiguriert wird.

source: Send copy to owner when mailing events
de: Beim Versand von Termin-E-Mails Kopie an Besitzer schicken

source: When you check the <guilabel>Send copy to owner when mailing events</guilabel> box, you will get a copy of all email messages that &korganizer; sends at your request to the event attendees.
de: Falls Sie das Kästchen <guilabel>Beim Versand von Termin-E-Mails Kopie an Besitzer schicken</guilabel> ankreuzen, dann bekommen Sie eine Kopie aller E-Mails die &korganizer; in Ihrem Auftrag an Teilnehmer eines Ereignisses schickt.

source: Mail transport
de: Versandweg

source: Here you can choose which type of mail transport you would like to use. You can either use &kmail; or the &Sendmail; command (which must be installed on your system in order to work).
de: Hier können Sie auswählen, welchen E-Mail-Transport Sie benutzen wollen. Sie können entweder &kmail; oder den Befehl &Sendmail;, der auf Ihrem System installiert sein muss, verwenden.

source: Additional email addresses
de: Zusätzliche E-Mail-Adressen

source: This tells &korganizer; which further email addresses you have. You can add, edit or remove additional email addresses. These email addresses are the ones you have in addition to the one set in <link linkend="config-main-general-personal">personal preferences</link>. If you get an invitation to an event through another email address, you need to list the address here so that &korganizer; can recognize it as yours, and add the item to your calendar.
de: Hiermit können Sie für &korganizer; weitere Adressen von Ihnen verwalten. Sie können diese hinzufügen, bearbeiten und löschen. Diese E-Mail Adressen sind die, die Ihnen außer der in Ihren <link linkend="config-main-general-personal">persönlichen Einstellungen</link> hinterlegten zur Verfügung stehen Wenn Sie eine . Einladung zu einem Termin bekommen, aber dort eine andere E-Mailadresse benutzen, müssen Sie diese Adresse hier aufzählen, damit &korganizer; weiss das es Ihre ist und den Eintrag Ihrem Kalender hinzufügt.

source: Free/Busy
de: Frei/Belegt

source: Publish
de: Veröffentlichen

source: By publishing your free/busy information, you allow others to take your busy time schedule into account when inviting you to an event.
de: Durch die Veröffentlichung Ihrer Frei/Belegt-Informationen erlauben Sie es Anderen, Ihren Terminplan einzusehen, wenn diese Sie zu einem Termin einladen.

source: Publish free/busy information automatically
de: Frei/Belegt-Informationen automatisch veröffentlichen

source: Enable this option if you wish your Free/Busy information to be uploaded automatically. Note that you may skip this option and choose to mail or upload your Free/Busy information via the <guilabel>Schedule</guilabel> menu of &korganizer;.
de: Benutzen Sie diese Option wenn Sie Ihre Frei/Belegt-Informationen automatisch veröffentlichen wollen. Sie können aber auch auf diese Option verzichten und Ihre Frei/Belegt-Informationen mit dem Menü <guilabel>Planer</guilabel> von &korganizer; veröffentlichen bzw. per E-Mail verschicken.

source: If your application is setup to work as a <guilabel>&kde; Kolab client</guilabel>, this is not required. The <guilabel>Kolab2</guilabel> server can take care of publishing your Free/Busy information and manage the access to it from other users.
de: Wenn Ihre Anwendung als <guilabel>&kde;-Kolab-Klient</guilabel> eingerichtet ist, ist dies nicht zwingend notwendig. Der <guilabel>Kolab2</guilabel>-Server kümmert sich um das Veröffentlichen Ihrer Frei/Belegt-Informationen und verwaltet den Zugriff anderer Benutzer darauf.

source: Minimum time between uploads (in minutes)
de: Minimaler Zeitraum zwischen Veröffentlichungen (in Minuten)

source: If you choose to publish your information automatically, you can configure the interval of time in minutes between each upload.
de: Wenn Sie Ihre Informationen automatisch veröffentlichen lassen, können Sie hier einstellen, wie viele Minuten zwischen den einzelnen Veröffentlichungen vergehen sollen.

source: Publish (default 60) days of free/busy information
de: Veröffentlichen (Voreinstellung: 60) Tage mit Frei/Belegt-Informationen

source: Configure the number of calendar days you wish to be published and available to others
de: Konfiguriert die Anzahl von Tagen, die im voraus veröffentlicht und für andere verfügbar gemacht werden

source: Server &URL;
de: Server-Adresse
