Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdepim/ktimetracker.po
Languages: de

source: The &ktimetracker; Handbook
de: Das Handbuch zu &ktimetracker;

source: Reviewer
de: Korrektur gelesen von

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Gregor</firstname><surname>Zumstein</surname><contrib>Deutsche Übersetzung</contrib><affiliation><address><email>zumstein@ssd.ethz.ch</email></address></affiliation></othercredit> <othercredit role="translator"><firstname>Thomas</firstname><surname>Reitelbach</surname><contrib>Deutsche Übersetzung</contrib><affiliation><address><email>tr@erdfunkstelle.de</email></address></affiliation></othercredit>

source: &ktimetracker; tracks time spent on various tasks.
de: &ktimetracker; misst die Zeit, die für verschiedene laufende Aufgaben benötigt wird.

source: time
de: zeit

source: tracker
de: verfolger

source: project
de: projekt

source: Introduction
de: Einleitung

source: &ktimetracker; tracks time spent on various tasks. It is useful for tracking billable hours and can report the hours logged by task and day.
de: &ktimetracker; misst die Zeit, die für verschiedene Aufgaben aufgewendet wird. Das Programm ist nützlich, wenn z. B. die für verschiedene Kunden aufgewendeten Stunden verrechnet werden müssen oder einfach nur, wenn Sie wissen möchten, wieviele Stunden am Tag Sie Doom spielen oder den Heise-Newsticker lesen.

source: This time history can be exported to a comma-delimited text file for import into other billing and/or project management tools.
de: Der zeitliche Ablauf kann in eine durch Komma getrennte Liste exportiert werden und ist leicht in Abrechnungs- oder Projektverwaltungs-Software importierbar.

source: &ktimetracker; detects when your keyboard and mouse are idle and can associate different tasks with different desktops, two tools that can help keep the timer running on the correct task.
de: &ktimetracker; erkennt automatisch, wenn Ihre Tastatur und Maus unbenutzt sind und kann verschiedene Aufgaben unterschiedlichen Arbeitsflächen zuordnen. Dies hilft der Stoppuhr, die Zeit für die jeweils korrekte Aufgabe zu messen.

source: &ktimetracker; was originally written by &Sirtaj.Singh.Kang;. Its home page is <ulink url="http://userbase.kde.org/KTimeTracker">http://userbase.kde.org/KTimeTracker</ulink>.
de: &ktimetracker; wurde ursprünglich von &Sirtaj.Singh.Kang; geschrieben. Die Webseite finden Sie unter <ulink url="http://userbase.kde.org/KTimeTracker">http://userbase.kde.org/KTimeTracker</ulink>.

source: Using &ktimetracker;
de: &ktimetracker; verwenden

source: Starting &ktimetracker;
de: Starten von &ktimetracker;

source: Type <command>ktimetracker</command> at a command prompt or select <guimenuitem>Personal Time Tracker</guimenuitem> from the <menuchoice> <guimenu>Applications</guimenu><guisubmenu>Utilities</guisubmenu> </menuchoice> group in the <guimenu>KDE start menu</guimenu>. The standard &Qt; and &kde; command options are available, and can be listed by entering <userinput><command>ktimetracker</command> <option>--help</option></userinput> at the command line.
de: Geben Sie <command>ktimetracker</command> auf der Befehlszeile ein oder wählen Sie <guimenuitem>KDE-Zeitplaner (Zeiterfassung)</guimenuitem> aus der Gruppe <menuchoice> <guimenu>Programme</guimenu><guisubmenu>Dienstprogramme</guisubmenu></menuchoice> im <guimenu>KDE-Startmenü</guimenu>. Die Standard-Befehlszeilenoptionen von &Qt; und &kde; sind verfügbar und können mit dem Befehl <userinput><command>ktimetracker <option>--help</option></command></userinput> auf der Befehlszeile abgefragt werden.

source: &ktimetracker; provides an additional command option that allows you to enter the name of the iCalendar file that is used to store your labor history. You enter a remote iCalendar file by using http or ftp as part of the file name; for example, http://www.mysite.com/mydata/mylabor.ics.
de: &ktimetracker; verfügt über einen Befehlszeilenparameter, mit dem Sie den Namen einer iCalendar-Datei angeben können, in die der Zeitverlauf gespeichert werden kann. Sie können auch eine entfernte Kalenderdatei angeben, indem Sie den http- oder ftp-Teil als Teil des Dateinamens angeben. Zum Beispiel http://www.meinserver.de/meinedaten/zeiterfassung.ics.

source: Tasks
de: Aufgaben

source: <emphasis>Problem:</emphasis> You are a freelance software consultant with many clients. Some clients have multiple projects. During the course of a day, you switch back and forth between different projects. You need to track your time to generate monthly invoices.
de: <emphasis>Problemstellung:</emphasis> Sie sind Berater für freie Software und haben viele Kunden. Einige Kunden haben mehrere Projekte. Im Laufe eines Tages arbeiten Sie abwechselnd an unterschiedlichen Projekten. Sie müssen die Arbeitszeiten für jedes Projekt messen, damit Sie am Monatsende die Rechnung stellen können.

source: <emphasis>Solution:</emphasis> Create one top-level task for each client and a subtask for each client project. For projects that require more detailed tracking, create a list of project subtasks. Track time by double-clicking on the task you are currently working on.
de: <emphasis>Lösung:</emphasis> Erstellen Sie für jeden Kunden eine Aufgabe und eine Teilaufgabe für jedes Kundenprojekt. Falls Sie eine detailliertere Verfolgung für ein Projekt benötigen, erstellen Sie eine Liste von Projekt-Teilaufgaben. Sie verfolgen die aufgewendete Zeit für ein Teilprojekt, indem Sie auf die Aufgabe in &ktimetracker; doppelklicken.

source: &ktimetracker; provides great flexibility in tracking your time, allowing unlimited tasks and task depth. Time may be logged to any task, and more than one task can be active at any given time.
de: &ktimetracker; lässt Ihnen jede erdenkliche Flexibilität beim Erfassen der aufgewendeten Zeit. Sie können beliebig viele Aufgaben und Teilaufgaben erstellen. Sie können die Zeit auch für mehrere Aufgaben gleichzeitig messen.

source: &ktimetracker; allows you to edit your task's history and to put a comment for every event that you have stopped.
de: &ktimetracker; ermöglicht es Ihnen, den Aufgabenverlauf zu bearbeiten und einen Kommentar für jedes Ereignis, das angehalten wurde, hinzuzufügen.

source: To create a top-level task, select <menuchoice> <shortcut> <keycombo action="simul">&Ctrl;<keycap>T</keycap></keycombo> </shortcut> <guimenu>Task</guimenu> <guimenuitem>New Task...</guimenuitem> </menuchoice>. To create a subtask, highlight the parent task and select <menuchoice> <shortcut> <keycombo action="simul">&Ctrl;&Alt;<keycap>N</keycap></keycombo> </shortcut> <guimenu>Task</guimenu> <guimenuitem>New Subtask...</guimenuitem> </menuchoice>.
de: Um eine neue Hauptaufgabe zu erstellen, wählen Sie <menuchoice> <shortcut><keycombo action="simul">&Ctrl;<keycap>T</keycap></keycombo></shortcut><guimenu>Aufgabe</guimenu> <guimenuitem>Neu ...</guimenuitem></menuchoice>. Um eine neue Teilaufgabe zu erstellen, wählen Sie zuerst die Hauptaufgabe und dann <menuchoice> <shortcut> <keycombo action="simul">&Ctrl;&Alt;<keycap>N</keycap></keycombo></shortcut><guimenu>Aufgabe</guimenu> <guimenuitem>Neue Teilaufgabe ...</guimenuitem></menuchoice>.

source: When &ktimetracker; exits, the task list is saved to a file on your disk. When it next opens, it reloads the task list from the same file.
de: Beim Beenden von &ktimetracker; wird die Aufgabenliste in einer Datei gespeichert. Beim nächsten Programmstart wird die Aufgabenliste wieder aus dieser Datei geladen.

source: &ktimetracker; can import and export tasks to minimize your work. See <link linkend="interfaces">Other Systems</link>.
de: &ktimetracker; kann Aufgaben übrigens auch importieren und exportieren und Ihnen damit die Arbeit erleichtern. Schauen Sie dazu unter <link linkend="interfaces">Andere Systeme</link>.

source: Timers
de: Zeitmesser

source: <emphasis>Problem:</emphasis> To remain solvent, you must bill an average of five hours a day. To stay on track, you watch your daily and weekly totals.
de: <emphasis>Problemstellung:</emphasis> Um rentabel zu sein, müssen Sie jeden Tag mindestens 5 Stunden Arbeitszeit berechnen können. Um auf dem Laufenden zu bleiben, überwachen Sie Ihre täglichen und wöchentlichen Ergebnisse.

source: <emphasis>Solution:</emphasis> Reset the session timer at the beginning of each work day and reset all timers at the beginning of each week.
de: <emphasis>Lösung:</emphasis> Setzen Sie die Zeitmessung der Sitzung zu Beginn jedes Arbeitstages und alle Zeitmessungen zu Beginn jeder Woche zurück.

source: &ktimetracker; makes tracking time simple. To start logging time against a task, double-click on the task. To stop logging time, double-click the task again. Active tasks display a small clock in the <guilabel>Session Time</guilabel> column.
de: Mit &ktimetracker; ist die Zeiterfassung einer Aufgabe sehr einfach. Um die Zeiterfassung einer Aufgabe zu starten, klicken Sie doppelt auf die Aufgabe. Zum Stoppen doppelklicken Sie erneut darauf. Neben allen aktiven Aufgaben sehen Sie eine kleine animierte Uhr in der Spalte <guilabel>Sitzungszeit</guilabel>.

source: Another visual clue of logging activity is the &ktimetracker; system tray icon. When a task is active, the second hand in the icon moves. If you rest the mouse pointer over this icon, the name of the active task will display in a tooltip. If more than one task is active, the task names in the tooltip are separated by commas.
de: Ein weiterer visueller Hinweis auf die aktive Zeiterfassung ist das Symbol von &ktimetracker; im Systemabschnitt der Kontrollleiste. Wenn gerade eine Aufgabe aktiv ist, wird die kleine Uhr animiert. Wenn Sie mit dem Mauszeiger über dem Symbol verweilen, wird ein kleines Infofenster angezeigt, dem Sie die aktiven Aufgaben entnehmen können.

source: &ktimetracker; maintains two timers for each task: one for the session time and one for the total time. In the default configuration, &ktimetracker; displays two columns for each timer, resulting in a total of four columns for each task:
de: &ktimetracker; verwaltet zwei Stoppuhren je Aufgabe: Eine für die Sitzungszeit und eine für die Gesamtzeit. In der Voreinstellung werden zwei Spalten für jede Stoppuhr angezeigt. Daraus ergeben sich vier Spalten pro Aufgabe.

source: Session Time
de: Sitzungszeit

source: The time spent on the task since the session began.
de: Die seit Sitzungsbeginn abgelaufene Zeit.

source: Time
de: Zeit

source: The time spent on the task since all times were reset.
de: Die für die Aufgabe aufgewendet Zeit seit dem letzten Zurücksetzen der Stoppuhren.

source: Total Session Time
de: Gesamte Sitzungszeit

source: The time spent on the task and all its subtasks since the session began.
de: Die für die Aufgabe und alle Unteraufgaben aufgewendete Zeit seit Sitzungsbeginn.

source: Total Time
de: Gesamtzeit

source: The time spent on the task and all its subtasks since all times were reset.
de: Die Zeit, die für die Aufgabe und alle Unteraufgaben seit dem letzten Zurücksetzen aufgewendet wurde.

source: To start a new session, select <menuchoice> <guimenu>File</guimenu> <guimenuitem>Start New Session</guimenuitem> </menuchoice>
de: Um eine neue Sitzung zu beginnen, wählen Sie <menuchoice> <guimenu>Datei</guimenu> <guimenuitem>Neue Sitzung starten</guimenuitem> </menuchoice>.

source: To reset all times, select <menuchoice> <guimenu>File</guimenu> <guimenuitem>Reset All Times</guimenuitem> </menuchoice>
de: Um alle Zeiten zurückzusetzen, wählen Sie <menuchoice> <guimenu>Datei</guimenu> <guimenuitem>Alle Zeiten zurücksetzen</guimenuitem> </menuchoice>

source: Desktop Tracking
de: Arbeitsflächen beobachten

source: <emphasis>Problem:</emphasis> You have two main projects that you switch between each day. To help organize your work, you keep your project 1 files on Desktop 1 and your project 2 files on Desktop 2.
de: <emphasis>Problemstellung:</emphasis> Sie haben zwei Hauptprojekte, an denen Sie während des Tages abwechselnd arbeiten. Um Ihre Arbeitsorganisation zu erleichtern, halten Sie die Dateien und Programme für Projekt 1 auf der Arbeitsfläche 1 und die für Projekt 2 auf der Arbeitsfläche 2 vor.

source: <emphasis>Solution:</emphasis> Associate project 1 task with Desktop 1 and the project 2 task with Desktop 2. When you switch from Desktop 2 to Desktop 1 active, &ktimetracker; automatically stops the project 2 task and starts the project 1 task.
de: <emphasis>Lösung:</emphasis> Ordnen Sie die Aufgabe für Projekt 1 der Arbeitsfläche 1 und die Aufgabe für Projekt 2 der Arbeitsfläche 2 zu. Wenn Sie von der Arbeitsfläche 2 zu 1 wechseln, hält &ktimetracker; die Zeiterfassung für Projekt 2 an und startet die Zeiterfassung für Projekt 1.

source: To associate a task with a one or more desktops, select <menuchoice> <shortcut> <keycombo action="simul">&Ctrl;<keycap>E</keycap></keycombo> </shortcut> <guimenu>Task</guimenu> <guimenuitem>Edit...</guimenuitem> </menuchoice>. Turn on <guilabel>Auto Tracking</guilabel> and select the desktop or desktops to associate with this task. When any of the selected desktops becomes active, after a short delay &ktimetracker; will be automatically start logging time against that task.
de: Um eine Aufgabe mehreren Arbeitsflächen zuzuordnen, wählen Sie <menuchoice> <shortcut><keycombo action="simul">&Ctrl;<keycap>E</keycap></keycombo> </shortcut> <guimenu>Aufgabe</guimenu> <guimenuitem>Bearbeiten ...</guimenuitem> </menuchoice>. Schalten Sie die Funktion <guilabel>Automatisches Verfolgen</guilabel> ein und wählen Sie die Arbeitsflächen mit den Ankreuzfeldern aus. Wenn eine der gewählten Arbeitsflächen aktiv wird, startet &ktimetracker; nach kurzer Zeit automatisch die Zeiterfassung für die Aufgabe.

source: Idle Detection
de: Untätigkeit erkennen

source: <emphasis>Problem:</emphasis> You leave work early on Friday to run an errand and forget to stop the timer. When you return on Monday, the timer is still running.
de: <emphasis>Problemstellung:</emphasis> Sie verlassen am Freitag Nachmittag die Arbeit früher als geplant, weil Sie vielleicht noch Besorgungen machen müssen. In der Eile vergessen Sie, die Zeiterfassung anzuhalten. Wenn Sie am nächsten Montag auf die Arbeit kommen, läuft die Stoppuhr immer noch.

source: <emphasis>Solution:</emphasis> Turn on idle detection on the <guilabel>Behavior</guilabel> page of the settings dialog.
de: <emphasis>Lösung:</emphasis> Schalten Sie die Erkennung von Untätigkeit im Einrichtungsdialog auf der Seite <guilabel>Verhalten</guilabel> ein.

source: &ktimetracker; can be configured to detect when the mouse and keyboard become idle. If the mouse and keyboard are idle for longer than the specified number of minutes, &ktimetracker; displays the following dialog:
de: &ktimetracker; kann so eingerichtet werden, dass es automatisch erkennt, wenn weder Maus noch Tastatur benutzt werden. Wenn Sie länger als die angegebene Zeit untätig sind, zeigt &ktimetracker; den folgenden Dialog an:

source: &ktimetracker; Idle Detection
de: &ktimetracker; Untätigkeit erkennen

source: &ktimetracker; Idle Detection Dialog
de: &ktimetracker; Untätigkeit erkennen

source: Continue timing
de: Zeitmessung weiterlaufen lassen

source: Apply the idle time to all active timers and keep them running.
de: Zählt die untätige Zeit zur regulären Zeitmessung und belässt die Zeitmessung aktiviert.

source: You were working on the task(s) while your computer was idle and still are.
de: Obwohl Sie am Rechner untätig waren, haben Sie dennoch an der Aufgabe gearbeitet und sind immer noch damit beschäftigt.

source: Revert timing
de: Zeitmessung zurücksetzen

source: Subtract the amount of idle time from all active timers and stop them.
de: Zieht die untätig verbrachte Zeit von den aktiven Zeitmessungen ab und hält diese an.

source: You were not working on the task(s) while your computer was idle and you are still not.
de: Während der Rechner untätig war haben Sie nicht an der Aufgabe gearbeitet und Sie beschäftigen sich immer noch mit etwas anderem.

source: Other Systems
de: Andere Systeme

source: &ktimetracker;, like &korganizer; and Apple's iCal, uses the industry standard <ulink url="http://www.faqs.org/rfcs/rfc2445.html">iCalendar</ulink> format for its data. &ktimetracker; can read and write the to-do lists created by these two applications.
de: &ktimetracker; verwendet wie &korganizer; und Apples iCal den Industriestandard <ulink url="http://www.faqs.org/rfcs/rfc2445.html">iCalendar</ulink> als Datenformat. &ktimetracker; kann die Datendateien dieser beiden Programme sowohl lesen als auch schreiben.

source: You can even work synchronously on one file with &korganizer; and &ktimetracker;. If one program changes the file, the updates will be propagated to the other application automatically.
de: Sie können sogar gleichzeitig mit einer Datei in &korganizer; und &ktimetracker; arbeiten. Ändert eines der Programme die Daten, werden die Aktualisierungen automatisch an das andere Programm weitergegeben.

source: Planner
de: Planer

source: As a typical usecase, you might want to plan a project with the project management tool Imendio Planner (from <ulink url="http://live.gnome.org/Planner">live.gnome.org/Planner</ulink>) and import its tasks to &ktimetracker; with <menuchoice><guimenu>File</guimenu> <guisubmenu>Import</guisubmenu><guimenuitem>Import Tasks From Planner...</guimenuitem> </menuchoice>, to have them in the industry standard <ulink url="http://www.faqs.org/rfcs/rfc2445.html">iCalendar</ulink> format. Having done so, you are able to schedule the tasks in &korganizer;, and account your time to them in &ktimetracker;. That's one way to help ensure your project stays on time and under budget.
de: Ein typischer Anwendungsfall wäre die Planung eines Projekts mit dem Projektplanungsprogramm Imendio Planner (von <ulink url="http://live.gnome.org/Planner">live.gnome.org/Planner</ulink> und der Import der Aufgaben in &ktimetracker; mit <menuchoice><guimenu>Datei</guimenu> <guisubmenu>Importieren</guisubmenu><guimenuitem>Aufgaben aus Planner übernehmen ...</guimenuitem></menuchoice>, um sie im <ulink url="http://www.faqs.org/rfcs/rfc2445.html">iCalendar</ulink>-Format vorliegen zu haben. Wenn Sie dies erledigt haben, sind Sie in der Lage, die Aufgaben in &korganizer; zu planen und die Zeit mit &ktimetracker; zu erfassen. Dies ist eine der Möglichkeiten, Ihr Projekt zu planen und im Budgetrahmen zu halten.

source: &DBus; is the mechanism &kde; programs use to communicate with each other. A &kde; program provides a list of functions that other programs (a Bash script, for example) can use.
de: &DBus; ist der gängige Weg unter &kde;, auf dem Programme miteinander kommunizieren. &kde;-Programme veröffentlichen via &DBus; eine Liste der Funktionen, die andere Programme (z. B. ein Bash-Skript) benutzen können.

source: Bash script that echoes &ktimetracker;'s version
de: Es folgt ein Bash-Skript, das die Version von &ktimetracker; ausgibt:

source: qdbus org.kde.ktimetracker /KTimeTracker version 2>/dev/null || echo "ktimetracker not running"
de: qdbus org.kde.ktimetracker /KTimeTracker version 2>/dev/null || echo "KTimetracker läuft nicht"

source: &ktimetracker;'s current &DBus; interface is currently used mainly for automated testing, so it is very limited. For the full interface definition, see <link linkend="dcopappendix">&DBus; Interface Appendix</link>.
de: Derzeit wird die &DBus;-Schnittstelle von &ktimetracker; nur für automatisiertes Testen verwendet. Daher ist die Liste der Funktionen noch sehr kurz. Die vollständige Schnittstellen-Definition finden Sie im Abschnitt <link linkend="dcopappendix">Die &DBus;-Schnittstelle</link>.

source: To see the full &DBus; interface of the &ktimetracker; version installed on your system, run the following Bash script:
de: Mit dem folgenden Bash-Skript können Sie die vollständige &DBus;-Schnittstelle Ihrer &ktimetracker;-Version einsehen:

source: List &ktimetracker;'s &DBus; interface to console
de: Auflistung der &DBus;-Schnittstelle für &ktimetracker; auf die Konsole

source: qdbus org.kde.ktimetracker /KTimeTracker 2>/dev/null || echo "ktimetracker not running"
de: qdbus org.kde.ktimetracker /KTimeTracker 2>/dev/null || echo "KTimetracker läuft nicht"

source: Export Totals to CSV
de: Als CVS-Datei exportieren

source: &ktimetracker; can export both totals and history to a comma-delimited file format. To export totals, select <menuchoice> <guimenu>File</guimenu> <guisubmenu>Export</guisubmenu> <guimenuitem>Export Times...</guimenuitem> </menuchoice> and &ktimetracker; displays the following export dialog:
de: &ktimetracker; kann sowohl die Gesamtzeiten als auch den Verlauf in eine durch Komma getrennte Datei exportieren. Dafür wählen Sie <menuchoice> <guimenu>Datei</guimenu> <guisubmenu>Export</guisubmenu> <guimenuitem>Zeiten exportieren ...</guimenuitem> </menuchoice>. Daraufhin sehen Sie den folgenden Dialog:

source: <screeninfo>&ktimetracker; CSV Export Dialog</screeninfo>
de: <screeninfo>CVS-Export</screeninfo>

source: <phrase>&ktimetracker; CSV Export Dialog</phrase>
de: <phrase>CSV-Export</phrase>

source: Enter the filename that you would like to export the data to, and modify the other dialog defaults if necessary. Click <guibutton>Export</guibutton> and &ktimetracker; exports the totals for all tasks to the file you selected.
de: Geben Sie den Namen der Datei ein, in die die Zeiten exportiert werden sollen und stellen die restlichen Einstellungen nach Bedarf ein. Klicken Sie nun auf <guibutton>Exportieren</guibutton>. &ktimetracker; exportiert nun die Gesamtzeit für die Aufgaben in die ausgewählte Datei.

source: Use the <guibutton>Export to Clipboard</guibutton> button to export the times to the clipboard
de: Benutzen Sie den Knopf <guibutton>In die Zwischenablage exportieren</guibutton>, um die Zeiten auch dort einzufügen.

source: Here is an example of the output format:
de: Hier sehen Sie eine Beispielausgabe:

source: <computeroutput> "kde",,,,,0.00,0.00,6.88,9.83 ,"ktimetracker",,,,6.88,8.70,6.88,9.83 ,,"3.2 feature plan",,,0.00,0.00,0.00,0.00 ,,"bugs",,,0.00,1.13,0.00,1.13 ,,"checkin changes - translation strings",,,0.00,0.00,0.00,0.00 ,,"time card report",,,0.00,0.00,0.00,0.00 ,"kopete",,,,0.00,0.00,0.00,0.00 ,"promo",,,,0.00,0.00,0.00,0.00 ,"web stuff",,,,0.00,0.00,0.00,0.00 </computeroutput>
de: <computeroutput> „Übersetzung KDE“,,1,05,1,30,2,20,2,65 ,„KTimetracker-Doku“,1,15,1,35,1,15,1,35 </computeroutput>

source: Top-level tasks are output in the first column, sub-tasks in the second, and so on. The time data is output after the maximum task depth (five in this example). The first time column is <guilabel>Session Time</guilabel>, the second is <guilabel>Time</guilabel>, the third is <guilabel>Total Session Time</guilabel> and the fourth is the <guilabel>Total Time</guilabel>.
de: Hauptaufgaben erscheinen in der ersten Spalte, Teilaufgaben in der zweiten, und so weiter. Die Zeitdaten werden nach der maximalen Aufgabenverschachtelung (zwei in diesem Beispiel) ausgegeben. Die erste Zeit-Spalte enthält die <guilabel>Sitzungszeit</guilabel>, die zweite die <guilabel>Zeit</guilabel>, die dritte die <guilabel>Gesamte Sitzungszeit</guilabel> und die vierte ist die <guilabel>Gesamtzeit</guilabel>.

source: Export History to CSV
de: Verlauf als CSV exportieren

source: To export task history, select <menuchoice> <guimenu>File</guimenu> <guisubmenu>Export</guisubmenu> <guimenuitem>Export History...</guimenuitem> </menuchoice> and &ktimetracker; displays the same export dialog as shown above.
de: Um den Aufgabenverlauf in eine durch Komma getrennte Liste zu exportieren, wählen Sie <menuchoice> <guimenu>Datei</guimenu> <guisubmenu>Export</guisubmenu> <guimenuitem>Verlauf exportieren ...</guimenuitem> </menuchoice>. &ktimetracker; zeigt den obigen Dialog an.
