Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdepim/ktimetracker.po
Languages: de

source: Enter the filename that you would like to export the data to, and select a date range that you want the task history to cover. Modify the other dialog defaults if necessary. Click <guibutton>Export</guibutton> and &ktimetracker; exports the task history to the chosen file.
de: Geben Sie den Namen der Datei ein, in die der Verlauf exportiert werden soll. Dann wählen Sie den Datumsbereich und stellen die restlichen Einstellungen nach Bedarf ein. Klicken Sie nun auf <guibutton>Exportieren</guibutton>. &ktimetracker; exportiert nun den Verlauf des gewählten Datumsbereichs in die ausgewählte Datei.

source: Use the <guibutton>Export to Clipboard</guibutton> button to export the history to the clipboard.
de: Benutzen Sie den Knopf <guibutton>In die Zwischenablage exportieren</guibutton>, um den Verlauf auch dort einzufügen.

source: <computeroutput> Task History From Tuesday 06 July 2004 to Tuesday 13 July 2004 Printed on: 2004-07-13 18:10 2004-07-06,2004-07-07,2004-07-08,2004-07-09,2004-07-10,2004-07-11,2004-07-12,2004-07-13, ,,,,,,,,0.00,"kde" ,,1.77,3.23,1.73,,1.37,0.82,8.95,,"ktimetracker" ,,,,,,,,0.00,,,"3.2 feature plan" ,1.13,,,,,,,1.13,,,"bugs" ,,,,,,,,0.00,,,"checkin changes - translation strings" ,,,,,,,,0.00,,,"time card report" ,,,,,,,,0.00,,"kopete" ,,,,,,,,0.00,,"promo" ,,,,,,,,0.00,,"web stuff" </computeroutput>
de: <computeroutput> Aufgabenverlauf Von Montag 30 Januar 2006 bis Montag 30 Januar 2006 Gedruckt am: 30.01.2006 19:50 2006-01-30,Summe,Gesamtsumme,Aufgabenhierarchie 0,00,0,00,0,00,,„Übersetzung KDE“ 0,00,0,00,0,00,,,„KTimetracker-Doku“ 0,00,0,00,,Gesamt </computeroutput>

source: The first three lines identify when the report was generated and for which date range. The fourth row is a comma-delimited list of the dates in the date range, in ISO 8601 format (YYYY-MM-DD). All subsequent rows list the time logged against each task. The last numeric column is the row total across all days. The task name prints after the total column, and is indented to indicate the task/sub-task relationship. Top level task names appear in the first column after the total.
de: Die ersten drei Zeilen geben an, wann und für welchen Datumsbereich der Bericht erstellt wurde. Die vierte Zeile enthält eine durch Komma getrennte Liste der Daten im Format ISO 8601 (JJJJ-MM-TT). Alle folgenden Zeilen enthalten die Daten für jede Aufgabe. Die letzte Zahlenspalte enthält das Gesamtergebnis pro Zeile für alle Tage. Die letzte Spalte enthält den Aufgabennamen, eingerückt nach Aufgaben und Teilaufgaben. Hauptaufgaben erscheinen direkt nach der Summenspalte.

source: The &ktimetracker; interface
de: Die Benutzeroberfläche von &ktimetracker;

source: The main &ktimetracker; window has the following components: menubar, toolbar, searchbar, task/time window and status bar.
de: Das Hauptfenster von &ktimetracker; besteht aus den folgenden Komponenten: Menüleiste, Werkzeugleiste, Suchleiste, Zeit/Aufgaben-Fenster und Statusleiste.

source: The searchbar is a combined field. As long as you do not press &Enter;, it acts as a filter. Then, only tasks that match your input are shown. As soon as you press &Enter;, your input is used as a name to create a new task.
de: Die Suchleiste hat zwei Funktionen: Wenn Sie nur etwas eingeben, ohne die &Enter;-Taste zu drücken, so funktioniert das Feld als Filter, nur auf den Filter passende Aufgaben werden angezeigt. Drücken Sie allerdings die Taste &Enter;, so wird eine neue Aufgabe mit dem eingegebenen Namen angelegt.

source: Choose <guilabel>Configuration for PDA</guilabel> in the <guilabel>Appearance</guilabel> page of the settings dialog if you have a touchscreen and your screen real estate is precious. It will disable the search bar and every click will pop up a context menu.
de: Wählen Sie <guilabel>Einstellungen für PDA</guilabel> im Einrichtungsdialog auf der Seite <guilabel>Erscheinungsbild</guilabel>, wenn Sie über einen Touchscreen mit wenig Platz verfügen. Die Suchleiste wird dadurch abgeschaltet, jeder Klick wird ein Kontextmenü öffnen.

source: <screeninfo>&ktimetracker; Screen</screeninfo>
de: <screeninfo>&ktimetracker; Hauptfenster</screeninfo>

source: <phrase>&ktimetracker; Screen</phrase>
de: <phrase>&ktimetracker; Hauptfenster</phrase>

source: The Task/Time window
de: Das Zeit/Aufgaben-Fenster

source: The various tasks are displayed in this window, along with the time accumulated for each in the current session and in total. Tasks being timed have a small clock icon next to the session time.
de: Hier werden die verschiedenen Aufgaben angezeigt, inklusive der mit dieser Aufgabe verbrachten Zeit (aktuelle Sitzung und total). Aufgaben, die gemessen werden, haben ein kleines Symbol in der Spalte Sitzungszeit.

source: Subtasks can be created for each task. Clicking the plus sign and minus sign in front of the main task toggles the view of its associated subtasks. The total time accrued for a task includes the times for its subtasks, as well as its own accumulated time.
de: Für jede Aufgabe können Unteraufgaben erstellt werden. Ein Klick auf das Plus-Symbol neben einer Aufgabe zeigt alle Teilaufgaben an, ein weiterer Klick blendet sie aus. Die Gesamtzeit einer Aufgabe setzt sich zusammen aus der Zeit aller Teilaufgaben und der eigenen Zeit.

source: The Toolbar and Statusbar
de: Die Werkzeug- und Statusleiste

source: The toolbar contains icons for the following commands:
de: Die Werkzeugleiste enthält Symbole für die folgenden Befehle:

source: All behave identically to the menu command.
de: Alle verhalten sich wie die entsprechenden Menübefehle.

source: New Task
de: Neue Aufgabe

source: New Subtask
de: Neue Teilaufgabe

source: Stop
de: Stopp

source: Delete
de: Löschen

source: Edit
de: Bearbeiten

source: Open
de: Öffnen

source: Save
de: Speichern

source: The statusbar reports the name of the file where the data was saved.
de: Die Statusleiste zeigt den Namen der Datei an, in die die Daten gespeichert wurden.

source: Credits and License
de: Danksagungen und Lizenz

source: Program copyright:
de: Copyright des Programms:

source: Contributors (in alphabetical order)
de: Mitwirkende (in alphabetischer Reihenfolge)

source: &ktimetracker; was inspired by Harald Tveit Alvestrand's very useful utility called <application>titrax</application>, the only failing of which is that it is based on the Xt toolkit.
de: &ktimetracker; wurde von Harald Tveit Alvestrands nützlichem Werkzeug <application>Titrax</application> inspiriert, dessen einziger Mangel das verwendete Xt-Toolkit ist.

source: Documentation copyright 2000-2004 &Jonathan.Singer; &Jonathan.Singer.mail; and &Sirtaj.Singh.Kang; &Sirtaj.Singh.Kang.mail;.
de: Copyright für die Dokumentation 2000-2004 &Jonathan.Singer; &Jonathan.Singer.mail; and &Sirtaj.Singh.Kang; &Sirtaj.Singh.Kang.mail;.

source: CREDIT_FOR_TRANSLATORS
de: <para>Übersetzung Gregor Zumstein <email>zumstein@ssd.ethz.ch</email>, Thomas Reitelbach <email>tr@erdfunkstelle.de</email></para>

source: Glossary
de: Glossar

source: active task
de: Aktive Aufgabe

source: A task which has a timer running.
de: Eine Aufgabe mit laufender Zeitmessung.

source: The interprocess communication protocol used in &kde;. Short for Desktop Bus.
de: Das Interprozess-Kommunikationsprotokoll von &kde;. Dies ist die Abkürzung für Desktop-Bus.

source: desktop
de: Arbeitsfläche

source: &GNU;/&Linux;, FreeBSD and other systems that run X-Windows have multiple desktops. You can typically have four different desktops installed by default. Each desktop can display its own set of programs and files. When &kde; first starts up, the desktop you see is Desktop 1. If you press <keycombo action="simul">&Ctrl;<keycap>F2</keycap></keycombo>, you will see Desktop 2. Pressing <keycombo action="simul">&Ctrl;<keycap>F1</keycap></keycombo> will bring back Desktop 1.
de: &GNU;/&Linux;, FreeBSD und andere Betriebssysteme, die X-Windows verwenden, haben mehrere Arbeitsflächen. Typischerweise haben Sie in KDE vier verschiedene Arbeitsflächen installiert. Jede kann einen eigenen Satz an Programmen und Dateien enthalten. Beim ersten &kde;-Start sehen Sie normalerweise die 1. Arbeitsfläche. Wenn Sie <keycombo action="simul">&Ctrl;<keycap>F2</keycap></keycombo> drücken sehen Sie die Arbeitsfläche 2. Wenn Sie <keycombo action="simul">&Ctrl;<keycap>F1</keycap></keycombo> drücken, sehen Sie wieder die Arbeitsfläche 1.

source: history
de: Verlauf

source: If &ktimetracker; is configured to log history, it will record every start/stop timer event. This history is not cleared when times are reset and remains on file until the task is deleted.
de: Wenn &ktimetracker; Funktion <quote>Verlauf protokollieren</quote> aktiv ist, wird jedes Start/Stopp-Ereignis der Stoppuhren protokolliert. Der Verlauf wird beim Zurücksetzen der Zeiten nicht gelöscht und bleibt auch in der Datei gespeichert, bis die Aufgabe gelöscht wird.

source: session
de: Sitzung

source: A user-defined starting point for the session timers. A new session begins when you select <menuchoice> <guimenu>File</guimenu> <guimenuitem>Start New Session</guimenuitem> </menuchoice>. Session data is not saved when you create a new session.
de: Ein benutzerdefinierter Startpunkt für eine Sitzungs-Zeitmessung. Eine neue Sitzung beginnt, wenn Sie <menuchoice> <guimenu>Datei</guimenu> <guimenuitem>Neue Sitzung starten</guimenuitem> </menuchoice> auswählen. Die Sitzungsdaten werden nicht gespeichert, wenn Sie eine neue Sitzung beginnen.

source: system tray
de: Systemabschnitt der Kontrollleiste

source: The system tray is in the bar that (by default) appears at the bottom of the screen. In this system tray <inlinemediaobject> <imageobject> <imagedata fileref="systray.png" format="PNG"/></imageobject> </inlinemediaobject> the &ktimetracker; icon is on the far right.
de: Der Systemabschnitt der Kontrollleiste ist (in der Voreinstellung) der rechte untere Bereich in der Kontrollleiste, in dem das <inlinemediaobject> <imageobject><imagedata fileref="systray.png" format="PNG"/></imageobject> </inlinemediaobject> Symbol von &ktimetracker; angezeigt wird.

source: top level task
de: Hauptaufgabe

source: A task with no parent tasks.
de: Eine Aufgabe auf der obersten Ebene; sie hat keine Eltern-Aufgaben.

source: How to obtain &ktimetracker;
de: Woher Sie &ktimetracker; erhalten

source: &DBus; Interface
de: Die &DBus;-Schnittstelle

source: Return &ktimetracker;'s version.
de: Gibt die Versionsnummer von &ktimetracker; zurück.

source: Description
de: Beschreibung

source: <function>version()</function> is a &DBus; call that returns &ktimetracker;'s version number; for example 4.3.1. The version number is returned as a string in the typical &GNU; format of major.minor.bugfix.
de: <function>version()</function> ist ein &DBus;-Aufruf, der die Versionsnummer von &ktimetracker; zurückgibt; z. B. 4.3.1. Die Versionsnummer wird als Zeichenkette im typischen &GNU;-Format als Major.Minor.Bugfix ausgegeben.

source: Return &ktimetracker;'s quit.
de: Liefert den Beenden-Status von &ktimetracker; zurück.

source: <function>quit()</function> is a &DBus; call that provides a way that an external program can gracefully shutdown &ktimetracker;.
de: <function>quit()</function> ist ein &DBus;-Aufruf, mit dem eine externe Anwendung &ktimetracker; auf regulärem Weg beenden kann.

source: Add new task.
de: Fügt eine neue Aufgabe hinzu.

source: QString addTask(QString taskname)
de: QString addTask(QString Aufgabenname)

source: Parameters
de: Parameter

source: taskname
de: Aufgabenname

source: The name of new task.
de: Der Name der neuen Aufgabe.

source: <function>addTask(QString taskname)</function> is a &DBus; call that adds a new top-level to-do to the current storage. The UID of the new task is returned.
de: <function>addTask(QString Aufgabenname)</function> ist ein &DBus;-Aufruf, mit dem Sie eine neue Aufgabe zur geöffneten Datei hinzufügen können. Der Rückgabewert enthält die UID der neuen Aufgabe.
