Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdepim/ktnef.po
Languages: de

source: The TNEF File Viewer Handbook
de: Handbuch zu KTnef

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Burkhard</firstname><surname>Lück</surname><affiliation><address><email>lueck@hube-lueck.de</email></address></affiliation><contrib>Übersetzung</contrib></othercredit>

source: The TNEF File Viewer is an application for <ulink url="http://en.wikipedia.org/wiki/TNEF">TNEF</ulink> mail attachments.
de: KTnef ist ein Anzeigeprogramm für E-Mail-Anhänge im <ulink url="http://de.wikipedia.org/wiki/TNEF">TNEF</ulink>-Format.

source: Introduction
de: Einleitung

source: The TNEF File Viewer allows to handle easily mail attachments using the TNEF format. Those attachments are usually found in mails coming from <trademark class="registered">Microsoft</trademark> mail servers and embed the mail properties as well as the actual attachments.
de: Das Anzeigeprogramm KTnef erleichtert den Umgang mit E-Mail-Anhängen im TNEF-Format. Diese Anhänge finden Sie üblicherweise in E-Mails von <trademark class="registered">Microsoft</trademark>-Mail-Servern und enthalten sowohl die Eigenschaften der E-Mail als auch die Anhänge.

source: An attachment in TNEF format is most often named <filename>winmail.dat</filename> or <filename>win.dat</filename>.
de: Ein Anhang im TNEF-Format hat meistens den Namen <filename>winmail.dat</filename> oder <filename>win.dat</filename>.

source: <screeninfo>TNEF Main Window</screeninfo>
de: <screeninfo>TNEF-Hauptfenster</screeninfo>

source: <phrase>TNEF Main Window</phrase>
de: <phrase>TNEF-Hauptfenster</phrase>

source: This utility program allows to perform various operations on those attachments:
de: Dieses Dienstprogramm ermöglicht es, solche Anhänge in folgender Weise zu bearbeiten:

source: View/open attachments with associated applications.
de: Betrachten und Öffnen von Anhängen mit zugeordneten Anwendungen.

source: Extract actual attachments
de: Anhänge entpacken

source: View message properties (TNEF/MAPI)
de: Eigenschaften der Nachricht anzeigen (TNEF/MAPI)

source: View/extract message formatted text (in RTF format)
de: Nachrichtentext anzeigen/entpacken (im RTF-Format)

source: &kmail; automatically shows the content of a TNEF attachment. You can open or save the attachments using the actions in the context menu.
de: &kmail; zeigt automatisch den Inhalt eines TNEF-Anhangs. Mit den Aktionen im Kontextmenü können Sie die Anhänge öffnen oder speichern.

source: <screeninfo>TNEF attachment in &kmail;</screeninfo>
de: <screeninfo>TNEF-Anhang in &kmail;</screeninfo>

source: <phrase>TNEF attachment in &kmail;</phrase>
de: <phrase>TNEF-Anhang in &kmail;</phrase>

source: Credits and License
de: Danksagungen und Lizenz

source: Program copyright 2000 &Michael.Goffioul; <email>kde-print@kde.org</email>.
de: Programm Copyright 2000 &Michael.Goffioul; <email>kde-print@kde.org</email>.

source: Program copyright 2012 Allen Winter <email>winter@kde.org</email>.
de: Programm Copyright 2012 Allen Winter <email>winter@kde.org</email>.

source: CREDIT_FOR_TRANSLATORS
de: <para>Übersetzung Burkhard Lück<email>lueck@hube-lueck.de</email></para>
