Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdepim/kwatchgnupg.po
Languages: de

source: The &kwatchgnupg; Handbook
de: Das Handbuch zu &kwatchgnupg;

source: Developer
de: Entwickler

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Matthias</firstname><othername>Kalle</othername><surname>Dalheimer</surname><affiliation><address><email>kalle@klaralvdalens-datakonsult.se</email></address></affiliation><contrib>Deutsche Übersetzung</contrib></othercredit>

source: &kwatchgnupg; is a simple &gnupg; log viewer.
de: &kwatchgnupg; ist ein einfacher Betrachter für die Protokollausgabe von &gnupg;

source: Log viewer
de: Protokollbetrachter

source: Introduction
de: Einführung

source: &kwatchgnupg; is simple &gnupg; log viewer for the &gnupg; versions 1.4 and 2.0. It works as a &GUI; wrapper around the command line tool &watchgnupg;, which listens on a socket for log lines from the &gnupg; backend applications. See <userinput>info watchgnupg</userinput> for more information about &watchgnupg;.
de: &kwatchgnupg; ist ein einfacher Betrachter für die Protokollausgabe der &gnupg;-Versionen 1.4 und 2.0. Es funktioniert als eine &GUI; um das Befehlszeilenprogramm &watchgnupg;. welches an einem Socket auf Protokollzeilen von den &gnupg;-Hintergrundapplikationen wartet. Nähere Informationen zu &watchgnupg; finden Sie unter <userinput>info watchgnupg</userinput>.

source: &kwatchgnupg; can be started from the <menuchoice><guimenu>Tools</guimenu><guimenuitem>GnuPG Log Viewer</guimenuitem></menuchoice> menu of both &kleopatra; and &kmail;, as well as from the command line. The &kwatchgnupg; executable is named <userinput>kwatchgnupg</userinput>.
de: &kwatchgnupg; kann aus dem Menü <menuchoice><guimenu>Extras</guimenu><guimenuitem>GnuPG-Protokollanzeige</guimenuitem></menuchoice> sowohl von &kleopatra; als auch von &kmail;, wie auch von der Befehlszeile gestartet werden. Der Name der ausführbaren Datei von &kwatchgnupg; lautet <userinput>kwatchgnupg</userinput>.

source: Main Functions
de: Wichtige Funktionen

source: Viewing the Log
de: Betrachten des Protokolls

source: &kwatchgnupg;'s main function is of course to present the &gnupg; debugging and logging information to the user. The main window is divided into a large text viewing area, where &gnupg; messages will appear as they are generated, a toolbar giving quick access to the most often needed functions, as well as the obligatory menu bar.
de: Die wichtigste Funktion von &kwatchgnupg; ist natürlich das Aufbereiten der &gnupg;-Informationen zur Fehlersuche und Protokollierung für den Betrachter. Das Hauptfenster besteht aus einem großen Bereich, in dem die &gnupg;-Nachrichten angezeigt werden, wenn sie ausgegeben werden, eine Werkzeugleiste, mit der die wichtigsten Funktionen schnell erreicht werden können, sowie der obligatorischen Menüleiste.

source: Each line in the text view is normally prefixed with a <acronym>FD</acronym> identifier and a time stamp in ISO format. The <acronym>FD</acronym> identifier can be used to distinguish between output from different &gnupg; instances running in parallel. Following the timestamp is the name of the component that is the source of the log line, together with some internal information in sqare brackets, followed by the original debugging or log output as printed by the component.
de: Jede Zeile in der Textansicht ist normalerweise ein <acronym>FD</acronym>-Bezeichner und ein Datumsstempel im ISO-Format vorangestellt. Der <acronym>FD</acronym>-Bezeichner kann dazu verwendet werden, Ausgaben von verschiedenen, gleichzeitig laufenden &gnupg;-Instanzen voneinander zu unterscheiden. Auf den Datumsstempel folgt der Name der Komponente, aus der die Protokollzeile stammt, sowie interne Informationen in eckigen Klammern. Anschließend folgt die ursprüngliche Fehlersuch- oder Protokollausgabe, wie sie von der Komponente ausgegeben wurde.

source: By default, the number of log lines that are kept in the history is limited to 10000 lines. You can configure the history size in the configuration dialog.
de: Als Standard ist die Anzahl der Protokollzeilen, die wieder abgerufen werden kann, auf 10 000 begrenzt. Sie können diese Anzahl aber im Einstellungsdialog verändern.

source: Saving the Contents of the Log Window to a File
de: Den Inhalt des Protokollfensters in einer Datei speichern

source: Sometimes it might be convenient to save the current log window contents to a file, &eg; to mail it to the developers as part of a bug report. There are two ways to achieve this in &kwatchgnupg;:
de: Manchmal ist es nützlich, den Inhalt des aktuellen Protokollfensters in einer Datei abzuspeichern, etwa um ihn den Entwicklern als Teil einer Fehlermeldung zu schicken. Dies können Sie &kwatchgnupg; auf zweierlei Weise erreichen:

source: First, you can choose <menuchoice><guilabel>File</guilabel><guimenuitem>Save As...</guimenuitem></menuchoice> (or the corresponding toolbar icon) to save the complete log window contents to a file. You will be prompted to specify a save file location.
de: Einmal können Sie <menuchoice><guilabel>Datei</guilabel><guimenuitem>Speichern unter ...</guimenuitem></menuchoice> (oder die entsprechende Schaltfläche in der Werkzeugleiste) verwenden, um den gesamten Inhalt des Protokollfensters in einer Datei zu speichern. Sie werden nach der zu verwendenden Datei gefragt.

source: Second, you can select the interesting lines with normal left-mouse selection and paste them into a word processor or mail user agent, just like any other text. You should make sure, though, that lines are not broken, since this reduces the readability of the log.
de: Zum anderen können Sie auch die interessanten Zeilen wie gewohnt mit der linken Maustaste auswählen und dann in eine Textverarbeitung oder ein E-Mail-Programm einkopieren, genau wie anderen Text auch. Sie sollten aber sicherstellen, dass die Zeilen nicht umbrochen werden, weil das die Lesbarkeit des Protokolls herabsetzen würde.

source: Clearing the Log Window
de: Das Protokollfenster leeren

source: For convenience, you can instruct &kwatchgnupg; to clear the log window using <menuchoice><guimenu>File</guimenu><guimenuitem>Clear History</guimenuitem></menuchoice> (or the corresponding toolbar icon).
de: Mit <menuchoice><guimenu>Datei</guimenu><guimenuitem>Verlaufspeicher löschen</guimenuitem></menuchoice> (oder der entsprechenden Schaltfläche in der Werkzeugleiste) können Sie den Inhalt des Protokollfensters löschen.

source: Use this prior to starting the crypto operation that you want to monitor to get only the output from that operation. You can then save the log using <menuchoice><guimenu>File</guimenu><guimenuitem>Save As...</guimenuitem></menuchoice> as described above.
de: Dies können Sie beispielsweise vor dem Start einer Krypto-Operation tun, um nur die Ausgabe dieser einen Operation zu sehen. Das Protokoll können Sie dann wie oben beschrieben mit <menuchoice><guimenu>Datei</guimenu><guimenuitem>Speichern unter ...</guimenuitem></menuchoice> abspeichern.

source: Clearing the log discards any previous log window contents. If you are unsure about whether you'll need the current contents afterwards, you should save them to a file (see above) before clearing.
de: Das Leeren des Protokolls verwirft alle vorherigen Inhalte des Protokollfensters. Wenn Sie sich nicht sicher sind, ob Sie den aktuellen Inhalt später noch benötigen, sollten Sie diesen wie oben beschrieben vorher in einer Datei speichern.

source: Configuring &kwatchgnupg;
de: &kwatchgnupg; einrichten

source: To configure &kwatchgnupg;, select <menuchoice><guimenu>Settings</guimenu><guimenuitem>Configure &kwatchgnupg;</guimenuitem></menuchoice>, or the corresponding toolbar icon. &kwatchgnupg;'s configure dialog is divided into two parts, each of which will be described below.
de: Zur Einrichtung von &kwatchgnupg; wählen Sie <menuchoice><guimenu>Einstellungen</guimenu><guimenuitem>&kwatchgnupg; einrichten ...</guimenuitem></menuchoice> aus dem Menü aus oder betätigen die entsprechende Schaltfläche in der Werkzeugleiste. Der Einrichtungsdialog von &kwatchgnupg; besteht aus zwei Teilen, die hier beide beschrieben werden.

source: &watchgnupg; Settings
de: &watchgnupg;-Einstellungen

source: &watchgnupg; is the process that actually monitors the logging socket for activity and formats the lines as seen in the &kwatchgnupg; text view. Settings in this group are passed down to the backend using the &gpgconf; mechanism.
de: &watchgnupg; ist der Prozess, der das Protokollsocket auf Aktivität überwacht in die Zeilen so formatiert, wie sie in der Textansicht von &kwatchgnupg; zu sehen sind. Die Einstellungen in dieser Gruppe werden über den &gpgconf;-Mechanismus an das Hintergrundprogramm weitergereicht.

source: <guilabel>Executable</guilabel> contains the path to the &watchgnupg; application. If &watchgnupg; is in your <varname>$PATH</varname>, you can keep the default <userinput>watchgnupg</userinput>. If &watchgnupg; is not in your <varname>$PATH</varname>, or if you have more than one version installed, enter the absolute filename of the watchgnupg executable here.
de: <guilabel>Ausführbares Programm</guilabel> enthält den Pfad zum &watchgnupg;-Programm. Wenn sich &watchgnupg; in Ihrem <varname>$PATH</varname> befindet, können Sie es bei der Standardeinstellung <userinput>watchgnupg</userinput> belassen. Wenn sich &watchgnupg; nicht in Ihrem <varname>$PATH</varname> befindet oder Sie mehr als eine Version installiert haben, dann sollten Sie hier den vollständigen Dateinamen der ausführbaren Datei angeben.

source: <guilabel>Socket</guilabel> contains the socket that &watchgnupg; should listen on. A change here is distributed to all &gnupg; backend modules using &gpgconf;, so you don't need to change this setting if your &gnupg; config files have another <varname>log-file</varname> set.
de: <guilabel>Socket</guilabel> enthält das Socket, an dem &watchgnupg; lauschen soll. Eine Änderung dieses Wertes wird über den &gpgconf;-Mechanismus an alle &gnupg;-Hintergrundprogramm-Module weitergereicht, sodass Sie diese Einstellung nicht ändern müssen, wenn in Ihren &gnupg;-Einrichtungsdateien eine andere Protokolldatei (<varname>log-file</varname>) eingestellt ist.

source: <guilabel>Default log level</guilabel> determines the amount of logging information returned by the backend modules. See the &watchgnupg; documentation for what level includes which information. A change here is distributed to all &gnupg; backend modules using &gpgconf;, so you don't need to change this setting if your &gnupg; config files have another <varname>log-level</varname> set.
de: <guilabel>Standard-Protokollniveau</guilabel> bestimmt die Menge der Protokollinformationen, die von den Hintergrundprogramm-Modulen zurückgegeben werden soll. Die &watchgnupg;-Dokumentation beschreibt, welches Protokollniveau welche Informationen beinhaltet. Eine Änderung dieser Einstellung wird über den &gpgconf;-Mechanismus an alle &gnupg;-Hintergrundprogramm-Module weitergereicht, sodass Sie diese Einstellung in Ihren &gnupg;-Konfigurationsdateien nicht ändern müssen, wenn dort ein anderer <varname>log-level</varname> eingestellt ist.

source: Log Window Settings
de: Protokollfenster-Einstellungen

source: Here, you can configure the size of the history buffer, &ie; the number of log lines that is kept. If more lines have been emitted by the &gnupg; backend since the last clearance of the history, then the oldest lines are discarded until there is enough room for the new lines again.
de: Hier können Sie die Größe des Verlaufspeichers einstellen, also wieviele Protokollzeilen im Speicher gehalten werden sollen. Wenn seit dem letzten Löschen des Verlaufs mehr Zeilen von &gnupg; ausgegeben wurden, als hier eingestellt ist, dann werden die ältesten Zeilen gelöscht, bis wieder genug Raum für die neuen Zeilen vorhanden ist.

source: You can disable the history size limit by clicking <guibutton>Set Unlimited</guibutton>. Note, however, that &kwatchgnupg;'s memory consumption will grow with the number of lines it currently displays. If you use an unlimited history size, then make sure to run &kwatchgnupg; only for short operations, or regularly clear the history manually.
de: Sie können die Größenbeschränkung des Verlaufspeichers durch Anklicken von <guibutton>Auf Unbegrenzt setzen</guibutton> abschalten. Beachten Sie aber, dass sich der Speicherverbrauch von &kwatchgnupg; mit der Anzahl der angezeigten Zeilen vergrößert. Wenn Sie eine unbeschränkte Größe für den Verlaufspeicher verwenden, dann sollten Sie entweder &kwatchgnupg; nur kurze Zeit laufen lassen oder den Verlaufspeicher regelmäßig von Hand löschen.

source: Credits and License
de: Danksagungen und Lizenz

source: Documentation copyright 2004 Klar&auml;lvdalens Datakonsult AB
de: Dokumentation Copyright 2004 Klar&auml;lvdalens Datakonsult AB

source: Contributors
de: Mitwirkende

source: CREDIT_FOR_TRANSLATORS
de: <para>Übersetzung Matthias Kalle Dalheimer <email>kalle@klaralvdalens-datakonsult.se</email></para>
