Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/kdepim/desktop_kdepim.po
Languages: de

# Comment
source: This plugin provides the Wikipedia Picture of the Day
de: Dieses Modul stellt das Bild des Tages aus Wikipedia zur Verfügung.

# Name
source: Wikipedia 'This Day in History' Plugin
de: Wikipedia-Modul „Dieser Tag in der Geschichte“

# Comment
source: This plugin provides links to Wikipedia's 'This Day in History' pages
de: Dieses Modul stellt eine Verknüpfung auf „Dieser Tag in der Geschichte“ in Wikipedia zur Verfügung.

# Name
source: Journal in a blog
de: Journal in einem Blog

# Comment
source: Allows to post calendar journal entries as blog entries
de: Mit diesem Modul können Journaleinträge an ein Blog übertragen werden.

# Name
source: Calendar in Remote File
de: Datei-Kalender auf Fremdrechner

# Comment
source: Provides access to a calendar in a remote file using KDE's network framework KIO
de: Ermöglicht den Zugriff auf einen entfernten Kalender über KDEs Netzwerk-Zugriffsystem KIO.

# Name
source: Behavior
de: Verhalten

# Comment
source: Configure Behavior
de: Verhalten einrichten

# X-KDE-Keywords
source: ktimetracker, configure, settings
de: KTimetracker,einstellen,konfigurieren,Konfiguration,Einrichtung,Einstellungen

# Comment
source: Configure Appearance
de: Erscheinungsbild einrichten

# Name
source: Storage
de: Speichern

# Comment
source: Configure Storage
de: Einstellungen zum Speichern einrichten

# Name
source: KTimeTracker Component
de: Zeiterfassungskomponente

# Name
source: KTimeTracker
de: KDE-Zeiterfassung

# GenericName
source: Personal Time Tracker
de: Zeiterfassung

# GenericName
source: TNEF File Viewer (proprietary format used by outlook)
de: TNEF-Dateibetrachter (Proprietäres Format von Outlook)

# Comment
source: A viewer/extractor for TNEF files
de: Betrachten und Extrahieren von TNEF-Dateien

# Name
source: LDAP Server Settings
de: LDAP-Server-Einstellungen

# Comment
source: Configure the available LDAP servers
de: Verfügbare LDAP-Server einrichten

# X-KDE-Keywords
source: kaddressbook, configure, settings, LDAP
de: KAddressbook,einstellen,konfigurieren,Konfiguration,Einrichtung,Einstellungen,LDAP

# Name
source: TAR (PGP®-compatible)
de: TAR (PGP®-kompatibel)

# Name
source: Not Validated Key
de: Ungeprüfter Schlüssel

# Name
source: Expired Key
de: Abgelaufener Schlüssel

# Name
source: Revoked Key
de: Widerrufener Schlüssel

# Name
source: Trusted Root Certificate
de: Vertrauenswürdiges Wurzelzertifikat

# Name
source: Not Trusted Root Certificate
de: Nicht vertrauenswürdiges Wurzelzertifikat

# Name
source: Keys for Qualified Signatures
de: Schlüssel für qualifizierte Signaturen

# Name
source: Other Keys
de: Andere Schlüssel

# Name
source: Smartcard Key
de: Smartcard-Zertifikat

# Name
source: TAR (with bzip2 compression)
de: TAR (mit bzip2-Kompression)

# Name
source: Move to directory
de: In Ordner schieben

# Comment
source: Message Viewer
de: Nachrichtenanzeige

# Name
source: New Ad-Block list download done
de: Das Herunterladen der neuen Werbefilterliste ist abgeschlossen

# Comment
source: New Ad-Block list download done
de: Das Herunterladen der neuen Werbefilterliste ist abgeschlossen

# Name
source: New Ad-Block list download failed
de: Das Herunterladen der neuen Werbefilterliste ist fehlgeschlagen

# Comment
source: New Ad-Block list download failed
de: Das Herunterladen der neuen Werbefilterliste ist fehlgeschlagen

# Name
source: Example
de: Beispiel

# Description
source: Example theme for header.
de: Beispieldesign für den Vorspann.

# Name
source: Example fancy
de: Dekoratives Beispiel

# Description
source: Create fancy theme with grantlee.
de: Dekoratives mit Grantlee erstelltes Design

# Keywords
source: mobile
de: Mobil

# Comment
source: KDE Kontact Touch e-mail client
de: E-Mail-Programm für KDE Kontact Touch

# Name
source: Kontact Touch Mail
de: Mail-Modul für Kontact Touch

# Name
source: Error while sending email
de: Fehler beim Versenden der E-Mail

# Comment
source: There was an error while trying to send the e-mail.
de: Beim Senden der E-Mail ist ein Fehler aufgetreten.

# Name
source: Notes
de: Notizen

# Name
source: Tasks
de: Aufgaben

# Name
source: PIM Setting Exporter
de: PIM-Einstellungs-Export

# Comment
source: PIM Setting Exporter allows to save all data from PIM apps and restore them in other system.
de: Speichert alle Daten von PIM-Anwendungen, um sie später in anderen Systemen wiederherzustellen.

# Comment
source: A bodypart formatter plugin for TNEF attachments
de: Ein Textinhalt-Formatierungsmodul für TNEF-Anhänge (Outlook)

# Comment
source: A bodypart formatter plugin for text/calendar
de: Ein Textinhalt-Formatierungsmodul für text/calender

# Comment
source: A bodypart formatter plugin for text/vcard
de: Ein Textinhalt-Formatierungsmodul für text/vcard

# Comment
source: A bodypart formatter plugin for text/x-patch
de: Ein Textinhalt-Formatierungsmodul für text/x-patch

# Comment
source: StorageServiceManager
de: Speicherdienstverwaltung

# Name
source: Action Failed
de: Aktion ist fehlgeschlagen

# Comment
source: An error was returned
de: Ein Fehler wurde zurückgegeben

# Name
source: Cloud Storage Manager
de: Cloud-Speicherverwaltung

# GenericName
source: Cloud Storage Manager
de: Cloud-Speicherverwaltung
