Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/kdepim/desktop_kdepim.po
Languages: de

# Comment
source: Archive Mail Agent
de: Agent zur E-Mail-Archivierung

# Name
source: Archive Mail Agent
de: Agent zur E-Mail-Archivierung

# Name
source: Archive Mail finished
de: E-Mail-Archivierung beendet

# Name
source: Archive Mail started
de: E-Mail-Archivierung gestartet

# Name
source: Directory does not exist
de: Der Ordner existiert nicht

# Name
source: Archive Mail Error
de: E-Mail-Archivierungsfehler

# Name
source: Folder Archive Agent
de: Agent zur Ordner-Archivierung

# Comment
source: Folder Archive Agent allows to store mails in specific archive folder
de: Der Agent zur Ordner-Archivierung ermöglicht das Speichern von E-Mails in angegebenen Archivordnern

# Comment
source: Followup reminder agent
de: Agent zur Erinnerung an Folgenachrichten

# Name
source: Mail Follow Up Received
de: Folgenachricht erhalten

# Name
source: Followup Reminder Agent
de: Agent zur Erinnerung an Folgenachrichten

# Comment
source: Followup Reminder Agent allows to remind you when an email was not answered.
de: Der Agent zur Erinnerung an Folgenachrichten erinnert Sie, wenn eine E-Mail nicht beantwortet wurde.

# Comment
source: Mail Filter Agent
de: Agent zur E-Mail-Filterung

# Name
source: Mail Filter Agent
de: Agent zur E-Mail-Filterung

# Name
source: Mail filter log enabled
de: E-Mail-Filterprotokoll aktiviert

# Name
source: An error occurred during filtering
de: Beim Filtern ist ein Fehler aufgetreten

# Comment
source: Extension to filter emails
de: Erweiterung zur Filterung von E-Mails

# Comment
source: Notes Agent
de: Notizen-Agent

# Name
source: Received a note
de: Notiz erhalten

# Name
source: Notes Agent
de: Notizen-Agent

# Comment
source: Adds notes received via network and handles note alarm notifications
de: Fügt Notizen hinzu, die über das Netzwerk erhalten wurden und verarbeitet Benachrichtigungen über Notiz-Erinnerungen

# Comment
source: Send Later Agent
de: Agent zum späteren Senden

# Name
source: Mail is sent
de: E-Mail wurde versendet

# Name
source: Send mail failed
de: Das Versenden der E-Mail ist fehlgeschlagen

# Name
source: Send Later Agent
de: Agent zum späteren Senden

# Name
source: Akonadi Console
de: Akonadi-Konsole

# Comment
source: Akonadi Management and Debugging Console
de: Akonadi-Konsole zur Verwaltung und Fehlersuche

# Name
source: Advanced
de: Erweitert

# Comment
source: Advanced Feed Reader Settings
de: Erweiterte Einstellungen für den Nachrichtenbetrachter

# X-KDE-Keywords
source: akregator, configure, settings, advanced
de: Akregator,einstellen,konfigurieren,Konfiguration,Einrichtung,Einstellungen,weiterführend

# Name
source: Appearance
de: Erscheinungsbild

# Comment
source: Configure the Feed Reader Appearance
de: Erscheinungsbild des Nachrichtenbetrachters einrichten

# X-KDE-Keywords
source: akregator, configure, settings, appearance, look, feel
de: Akregator,einstellen,konfigurieren,Konfiguration,Einrichtung,Einstellungen,Erscheinungsbild,Aussehen,Handhabung

# Name
source: Archive
de: Archiv

# Comment
source: Configure Feed Archive
de: Einrichtung des Nachrichten-Archivs

# X-KDE-Keywords
source: akregator, configure, settings, archive
de: Akregator,einstellen,konfigurieren,Konfiguration,Einrichtung,Einstellungen,Archiv

# Comment
source: Configure Internal Browser Component
de: Einrichtung der internen Browser-Komponente

# X-KDE-Keywords
source: akregator, configure, settings, Browser, Web, Internal
de: Akregator,einstellen,konfigurieren,Konfiguration,Einrichtung,Einstellungen,Browser,Web,intern

# Name
source: General
de: Allgemein

# Comment
source: Configure Feeds
de: Einrichtung der Nachrichtenquellen

# X-KDE-Keywords
source: akregator, configure, settings, General
de: Akregator,einstellen,konfigurieren,Konfiguration,Einrichtung,Einstellungen,allgemein

# Name
source: Metakit storage backend
de: Metakit Archiv-Modul

# Comment
source: Plugin for Akregator
de: Modul für Akregator

# X-KDE-Keywords
source: akregator, configure, settings, online readers
de: Akregator,einstellen,konfigurieren,Konfiguration,Einrichtung,Einstellungen,online Reader

# Name
source: Online Readers
de: Online-Leser

# Comment
source: Configure Online Readers
de: Online-Leser einrichten

# Name
source: Akregator Online Feed Reader Support
de: Akregator-Unterstützung für Online-Leser

# Name
source: Share Services
de: Veröffentlichungsdienste

# Comment
source: Configure Share Services
de: Veröffentlichungsdienste einrichten

# Name
source: Akregator Online Article Share
de: Akregator-Online-Artikelfreigabe

# GenericName
source: Feed Reader
de: Nachrichtenbetrachter

# Comment
source: A KDE News Feed Reader
de: Ein Nachrichtensammler für KDE

# Name
source: Feed added
de: Nachrichtenquelle hinzugefügt

# Comment
source: A new feed was remotely added to Akregator
de: Eine neue Nachrichtenquelle wurde von außerhalb zu Akregator hinzugefügt

# Name
source: New Articles
de: Neue Artikel

# Comment
source: New articles were fetched
de: Neue Artikel wurden abgeholt

# Name
source: aKregatorPart
de: aKregator-Komponente

# GenericName
source: A KDE Blogging Client
de: Ein Blogging-Programm für KDE

# Name
source: Calendar Plugin Interface
de: Kalender-Modulschnittstelle

# Comment
source: Calendar Plugin
de: Kalender-Modul

# Name
source: List Print Style
de: Listen-Druckstil

# Comment
source: This plugin allows you to print out events and to-dos in list form.
de: Mit diesem Modul können Ereignisse und Aufgaben in Listenform ausgedruckt werden.

# Name
source: What's Next Print Style
de: „Was kommt als nächstes“-Druckstil

# Comment
source: This plugin allows you to print out a list of all upcoming events and to-dos.
de: Mit diesem Modul kann eine Liste der als nächstes anliegenden Ereignisse und Aufgaben gedruckt werden

# Name
source: Calendar Decoration Interface
de: Dekoration für den Kalender

# Comment
source: Calendar Decoration Plugin
de: Dekoration für den Kalender

# Name
source: Letter home/private address
de: Postanschrift (privat)

# Name
source: Letter business/work address
de: Postanschrift (geschäftlich)

# Name
source: KonsoleKalendar
de: Konsolen-Kalender

# Name
source: Kontact Administration
de: Kontact-Verwaltung

# Comment
source: Coisceim Plugin
de: Coisceim-Modul

# Comment|KMail plasma widget's comment, NOT translators' e-mail addresses.
source: Your emails
de: Ihre E-Mails

# Name
source: mailreader
de: E-Mail-Programm

# GenericName
source: A KDE4 Application
de: Eine KDE-4-Anwendung

# Name
source: Contact Theme Editor
de: Designeditor für Kontakte

# GenericName
source: Contact Theme Editor
de: Designeditor für Kontakte

# Name
source: KMail Header Theme Editor
de: KMail-Designeditor für Vorspann

# GenericName
source: Mail Header Theme Editor
de: Designeditor für E-Mail-Vorspann

# Name
source: KMail Import Wizard
de: KMail-Import-Assistent

# Comment
source: Launch the import wizard to migrate data from mailer as thunderbird/evolution etc.
de: Starten Sie den Import-Assistenten für den Import aus E-Mail-Programmen wie Thunderbird, Evolution usw.

# Name
source: KAddressbook import file
de: Adressbuch-Importdatei

# Name
source: KAddressBook
de: Adressbuch

# GenericName
source: Contact Manager
de: Kontaktverwaltung

# Name
source: Example big title
de: Beispiel mit großem Titel

# Description
source: Example big title grantlee printing theme
de: Beispiel für Grantlee-Druckstil mit großem Titel

# Name
source: Default
de: Standard

# Description
source: Default grantlee printing theme
de: Grantlee-Standarddruckstil

# Name
source: Full Information
de: Vollständige Information

# Description
source: Display All Information
de: Alle Informationen anzeigen

# Description
source: Default kaddressbook theme.
de: Standarddesign für KAddressBook.

# Comment
source: KAlarm autostart at login
de: Autostart von KAlarm bei der Anmeldung

# GenericName
source: Personal Alarm Scheduler
de: Persönliche Termin-Erinnerung

# Name
source: Alarms
de: Erinnerungen

# Name
source: Alarms in Local File
de: Erinnerungen in lokaler Datei

# Comment
source: Provides access to an alarm calendar stored in a single local file
de: Ermöglicht den Zugriff auf einen Erinnerungen-Kalender in einer lokalen Datei.

# Name
source: Alarms in Local Directory
de: Erinnerungen in lokalem Ordner

# Comment
source: Provides access to an alarm calendar stored in a local directory, in which each calendar item is stored in a separate file
de: Ermöglicht den Zugriff auf einen Erinnerungen-Kalender in einem lokalen Ordner, in dem jeder Kalender-Eintrag als separate Datei gespeichert ist.

# Name
source: Alarms in Remote File
de: Erinnerungen in Datei auf Fremdrechner

# Comment
source: Provides access to an alarm calendar in a remote file using KDE's network framework KIO
de: Ermöglicht den Zugriff auf einen entfernten Erinnerungen-Kalender über KDEs Netzwerk-Zugriffsystem KIO.

# Name
source: Set RTC wakeup time
de: Den Zeitpunkt zum Aufwachen gemäß der Echtzeituhr setzen

# Description
source: Set RTC wake-from-suspend time
de: Den Zeitpunkt zum Aufwachen aus dem Ruhezustand gemäß der Echtzeituhr setzen

# GenericName
source: Note Taker
de: Elektronischer Notizblock

# Name
source: Misc
de: Diverses

# Comment
source: Setup misc for KJots
de: Verschiedene Einstellungen für KJots

# Name
source: Akonotes list plasmoid
de: Akonotes-Listen-Plasmoid

# Comment
source: Akonotes list plasmoid
de: Akonotes-Listen-Plasmoid

# Name
source: Akonotes note plasmoid
de: Akonotes-Notizen-Plasmoid

# Comment
source: Akonotes note plasmoid
de: Akonotes-Notizen-Plasmoid

# Comment
source: Colors & Fonts Configuration
de: Farb- & Schrifteneinrichtung

# X-KDE-Keywords
source: color,font, configuration
de: Farben,Schriftarten,Konfiguration,Einrichtung,Einstellungen

# Name
source: Crypto Operations
de: Kryptografie-Aktionen

# Comment
source: Configuration of Crypto Operations
de: Einrichtung der Kryptografie-Aktionen

# X-KDE-Keywords
source: sign,encrypt,email,quick mode,checksum,configuration
de: signieren,verschlüsseln,E-Mail,email,schneller Modus,Prüfsumme,Konfiguration,Einrichtung,Einstellungen

# Name
source: Directory Services
de: Zertifikatsserver

# Comment
source: Configuration of directory services
de: Einrichtung von Zertifikatsservern

# X-KDE-Keywords
source: ldap,directory,services,hkp,keyserver
de: LDAP,Verzeichnis,Dienste,HKP,Schlüsselserver

# Comment
source: Configuration of GnuPG System options
de: Einrichtung der Optionen zum GnuPG-System

# X-KDE-Keywords
source: gpg,gpgsm,gpg-agent,dirmngr,scdaemon,kleopatra,signing,encryption
de: GPG,GPGSM,GPG-Agent,dirmngr,SC-Daemon,Kleopatra,signieren,verschlüsseln

# Name
source: S/MIME Validation
de: S/MIME-Prüfung

# Comment
source: Configuration of S/MIME certificate validation options
de: Einrichtung der Optionen zur S/MIME-Zertifikatüberprüfung

# X-KDE-Keywords
source: smime,validation,kleopatra,signing,encryption
de: SMIME,Überprüfung,Kleopatra,signieren,verschlüsseln

# GenericName
source: Certificate Manager and Unified Crypto GUI
de: Zertifikatsverwaltung und Kryptografie-Oberfläche

# Name
source: Kleopatra Decrypt/Verify Files
de: Kleopatra – Dateien entschlüsseln/überprüfen

# Name
source: Decrypt/Verify File
de: Datei entschlüsseln/überprüfen

# Name
source: Kleopatra Decrypt/Verify All Files In Folder
de: Kleopatra – Alle Dateien in einem Ordner entschlüsseln/überprüfen

# Name
source: Decrypt/Verify All Files In Folder
de: Alle Dateien im Ordner entschlüsseln/überprüfen

# Comment
source: Certificate Manager and Unified Crypto GUI
de: Zertifikatsverwaltung und Kryptografie-Oberfläche

# Name
source: Kleopatra Sign/Encrypt Files
de: Kleopatra – Signieren/Verschlüsseln von Dateien

# Name
source: Sign & Encrypt File
de: Datei signieren & verschlüsseln

# Name
source: Encrypt File
de: Datei verschlüsseln

# Name
source: OpenPGP-Sign File
de: Datei mit OpenPGP signieren

# Name
source: S/MIME-Sign File
de: Datei mit S/MIME signieren

# Name
source: Kleopatra Sign/Encrypt Folders
de: Kleopatra – Ordner Signieren/Verschlüsseln

# Name
source: Archive, Sign && Encrypt Folder
de: Ordner packen, signieren und verschlüsseln

# Name
source: Archive && Encrypt Folder
de: Ordner packen und verschlüsseln

# Comment
source: Mail program with a D-Bus interface
de: E-Mail-Programm mit D-Bus-Schnittstelle

# GenericName
source: Mail Client
de: E-Mail-Programm

# Name
source: Akonadi server sent a warning
de: Warnung des Akonadi-Servers

# Comment
source: Akonadi server sent a warning
de: Warnung des Akonadi-Servers

# Name
source: Akonadi server sent an error
de: Fehlermeldung des Akonadi-Servers

# Comment
source: Akonadi server sent an error
de: Fehlermeldung des Akonadi-Servers

# Name
source: A resource is broken
de: Eine Ressource ist nicht funktionsfähig

# Comment
source: A resource change its state to broken
de: Eine Ressource meldet eine Funktionsstörung

# Name
source: Error While Checking Mail
de: Fehler beim Sehen nach neuen Nachrichten

# Comment
source: There was an error while checking for new mail
de: Beim Sehen nach neuen Nachrichten ist ein Fehler aufgetreten

# Name
source: Archive Mails in Folder done
de: E-Mail-Archivierung im Ordner beendet

# Name
source: Folder Archive Error
de: Ordner-Archivierungs-Fehler

# Name
source: Send as Email Attachment
de: Als E-Mail-Anhang versenden

# Name
source: Accounts
de: Zugänge

# Comment
source: Setup for Sending and Receiving Messages
de: Einstellungen zum Senden und Empfangen von Nachrichten

# X-KDE-Keywords
source: kmail,accounts
de: KMail,Zugänge

# Comment
source: Customize Visual Appearance
de: Erscheinungsbild anpassen

# X-KDE-Keywords
source: kmail,appearance
de: KMail,Erscheinungsbild

# Name
source: Composer
de: E-Mail-Editor

# Comment
source: Message Composer Settings
de: Einstellungen für den E-Mail-Editor

# X-KDE-Keywords
source: kmail,composer
de: KMail,Komposer,Editor

# Name
source: Identities
de: Identitäten

# Comment
source: Manage Identities
de: Identitäten verwalten

# X-KDE-Keywords
source: kmail,identity
de: KMail,Identitäten

# Comment
source: Settings that don't fit elsewhere
de: Verschiedene Einstellungen

# X-KDE-Keywords
source: kmail,misc
de: KMail,Verschiedenes

# Name
source: Security
de: Sicherheit

# Comment
source: Security & Privacy Settings
de: Sicherheit und Privatsphäre

# X-KDE-Keywords
source: kmail,security
de: KMail,Sicherheit

# Name
source: KMail view
de: KMail-Ansicht

# GenericName
source: News Reader
de: Usenet-Newsreader

# Comment
source: Setup for Newsgroup and Mail Servers
de: Einstellungen für Newsgruppen- und Mailserver

# Name
source: Cleanup
de: Aufräumen

# Comment
source: Preserving Disk Space
de: Platz auf dem Datenträger bewahren

# Name
source: Identity
de: Identität

# Comment
source: Personal Information
de: Persönliche Angaben

# Name
source: Posting News
de: Artikelversand

# Name
source: Signing/Verifying
de: Signieren/Verifizieren

# Comment
source: Protect your privacy by signing and verifying postings
de: Schutz der Privatsphäre durch Signieren und Verifizieren von Beiträgen.

# Name
source: Reading News
de: Artikel lesen

# Name
source: Actions
de: Aktionen

# Comment
source: Setup actions for notes
de: Aktionen für Notizen einrichten

# Name
source: Collections
de: Sammlungen

# Comment
source: Setup collections for notes
de: Sammlungen für Notizen einrichten

# Name
source: Display
de: Anzeige

# Comment
source: Setup display for notes
de: Anzeige von Notizen einrichten

# Comment
source: Setup editor
de: Editor einrichten

# Name
source: Network
de: Netzwerk

# Comment
source: Network Settings
de: Netzwerkeinstellungen

# Name
source: Print
de: Drucken

# Comment
source: Setup printing for notes
de: Drucken für Notizen einrichten

# GenericName
source: Popup Notes
de: Haftnotizen

# Name
source: Note with background color
de: Notiz mit Hintergrundfarbe

# Description
source: Theme which use note background color
de: Design mit Hintergrundfarbe für die Notizen

# Name
source: Big Title
de: Großer Titel

# Description
source: KNote printing theme with big title
de: KNote-Druckdesign mit großem Titel

# Description
source: Default knotes printing theme
de: KNotes-Standarddruckstil

# Name
source: Feeds
de: Nachrichten

# Comment
source: Feed Reader
de: Anzeige von RSS-Nachrichtenquellen

# Comment
source: Akregator Plugin
de: Akregator-Modul

# Name
source: Contacts
de: Kontakte

# Comment
source: Address Book Component
de: Adressbuch-Komponente

# Comment
source: Kontact KAddressBook Plugin
de: Adressbuch-Modul für Kontact

# Name
source: Notebooks
de: Notizbücher

# Comment
source: Notebooks Component
de: Notizblock-Komponente

# Comment
source: Kontact KJots Plugin
de: KJots-Modul für Kontact

# Name
source: New Messages
de: Neue Nachrichten

# Comment
source: Mail Summary Setup
de: Mailübersicht-Einstellungen

# X-KDE-Keywords
source: email, summary, configure, settings
de: E-Mail,email,Übersicht,einstellen,konfigurieren,Konfiguration,Einrichtung,Einstellungen

# Name
source: Mail
de: E-Mail

# Comment
source: Mail Component
de: Mail-Komponente

# Comment
source: Kontact KMail Plugin
de: KMail-Modul für Kontact

# Comment
source: Usenet Component
de: Usenet-Komponente

# Comment
source: Kontact KNode Plugin
de: KNode-Modul für Kontact

# Name
source: New Notes
de: Neue Notizen

# Comment
source: Notes Summary Setup
de: Einstellung der Notizen-Übersicht

# X-KDE-Keywords
source: notes, summary, configure, settings
de: Notizen,Übersicht,einstellen,konfigurieren,Konfiguration,Einrichtung,Einstellungen

# Name
source: Popup Notes
de: Haftnotizen

# Comment
source: Popup Notes Component
de: Haftnotizen-Komponente

# Comment
source: Kontact KNotes Plugin
de: KNotes-Modul für Kontact

# Comment
source: Kontact KOrganizer Journal Plugin
de: Kontact KOrganizer-Modul für Journaleinträge

# Name
source: Journal
de: Journale

# Name
source: Upcoming Events
de: Anstehende Ereignisse

# Comment
source: Upcoming Events Summary Setup
de: Einstellung der Übersicht über anstehende Ereignisse

# X-KDE-Keywords
source: calendar, events, configure, settings
de: Ereignisse,Kalender,einstellen,konfigurieren,Konfiguration,Einrichtung,Einstellungen

# Name
source: Pending To-dos
de: Zu erledigende Aufgaben

# Comment
source: Pending To-dos Summary Setup
de: Einstellung der Übersicht über zu erledigende Aufgaben

# X-KDE-Keywords
source: calendar, todos, configure, settings
de: Kalender,Aufgaben,einstellen,konfigurieren,Konfiguration,Einrichtung,Einstellungen

# Name
source: Calendar
de: Kalender

# Comment
source: Calendar Component
de: Kalender-Komponente

# Comment
source: Kontact KOrganizer Plugin
de: KOrganizer-Modul für Kontact

# Comment
source: Kontact KOrganizer To-do List Plugin
de: Kontact KOrganizer-Aufgabenlisten-Modul

# Name
source: To-do List
de: Aufgaben

# Name
source: Time Tracker
de: Zeiterfassung

# Comment
source: Time Tracker Component
de: Zeiterfassungs-Komponente

# Comment
source: TimeTracker Plugin
de: Modul für die persönliche Zeiterfassung

# Name
source: Planner
de: Planer

# Comment
source: Planner Setup
de: Planer-Einrichtung

# Comment
source: Planner Summary
de: Planer-Übersicht

# Comment
source: Planner Plugin
de: Planer-Modul

# Name
source: Upcoming Special Dates
de: Besondere anstehende Termine

# Comment
source: Upcoming Special Dates Summary Setup
de: Einstellung der Übersicht über besondere anstehende Termine

# X-KDE-Keywords
source: birthday, anniversary, holiday, configure, settings
de: Geburtstag,Jahrestag,Feiertag,einstellen,konfigurieren,Konfiguration,Einrichtung,Einstellungen

# Name
source: Special Dates Summary
de: Übersicht über besondere Termine

# Comment
source: Special Dates Summary Component
de: Komponente für Übersicht über besondere Termine

# Name
source: Special Dates
de: Besondere Termine

# Comment
source: Special Dates Plugin
de: Modul für besondere Termine

# Name
source: Summaries
de: Übersichten

# Comment
source: Summary Selection
de: Zusammenstellung der Übersicht

# Name
source: Summary
de: Übersicht

# Comment
source: Summary View
de: Zusammenfassungsansicht

# Comment
source: Kontact SummaryView Plugin
de: Übersichts-Modul für Kontact

# GenericName
source: Personal Information Manager
de: Persönlicher Informationsmanager

# Name
source: Kontact Configuration
de: Einrichtung von Kontact

# Comment
source: Default KDE Kontact Component
de: Standard-Komponente von Kontact

# Name
source: KOrganizer Reminder Client
de: KOrganizer Erinnerungsfunktion

# GenericName
source: KOrganizer Reminder Daemon Client
de: Hintergrund-Erinnerungsfunktion für KOrganizer

# Name
source: Reminder Daemon
de: Erinnerungsmodul

# Comment
source: Event and task reminder daemon
de: Erinnerungsdienst für Ereignisse und Termine

# Name
source: DBUSCalendar
de: D-Bus-Kalender

# Comment
source: Organizer with a D-Bus interface
de: Organizer mit D-Bus-Schnittstelle

# Name
source: KOrganizer Part Interface
de: KOrganizer-Komponenten-Schnittstelle

# Comment
source: KOrganizer Part
de: KOrganizer-Komponente

# Name
source: Colors and Fonts
de: Farben und Schriftarten

# Comment
source: KOrganizer Colors and Fonts Configuration
de: Farb- und Schriftdarstellung für KOrganizer

# X-KDE-Keywords
source: korganizer,colors,fonts
de: KOrganizer,Farben,Schriftarten

# Name
source: Custom Pages
de: Benutzerdefinierte Seiten

# Comment
source: Configure the Custom Pages
de: Einstellungen für benutzerdefinierte Seiten

# X-KDE-Keywords
source: korganizer, configure, settings, custom fields
de: KOrganizer,einstellen,konfigurieren,Konfiguration,Einrichtung,Einstellungen,benutzerdefinierte Felder

# Name
source: Free/Busy
de: Frei/Belegt

# Comment
source: KOrganizer Free/Busy Configuration
de: Frei/Belegt-Festlegung für KOrganizer

# X-KDE-Keywords
source: korganizer,freebusy,scheduling
de: KOrganizer,Frei/Beschäftigt,Frei/Belegt,Ablaufplanung

# Name
source: Group Scheduling
de: Gruppenplanung

# Comment
source: KOrganizer Group Scheduling Configuration
de: Einrichtung von Gruppen-Planungen für KOrganizer

# X-KDE-Keywords
source: korganizer,group,scheduling
de: KOrganizer,Gruppe,Ablaufplanung

# Comment
source: KOrganizer Main Configuration
de: Grundeinrichtung für KOrganizer

# X-KDE-Keywords
source: korganizer,main
de: KOrganizer,allgemein

# Name
source: Plugins
de: Module

# Comment
source: KOrganizer Plugin Configuration
de: Modul-Einrichtung für KOrganizer

# X-KDE-Keywords
source: korganizer,plugin,module
de: KOrganizer,Modul,Modul

# Name
source: Time and Date
de: Zeit und Datum

# Comment
source: KOrganizer Time and Date Configuration
de: KOrganizer-Einstellungen für Zeit/Datum

# X-KDE-Keywords
source: korganizer,time
de: KOrganizer,Zeit

# Name
source: Views
de: Ansichten

# Comment
source: KOrganizer View Configuration
de: Ansichts-Einstellungen für KOrganizer

# X-KDE-Keywords
source: korganizer,view
de: KOrganizer,Ansicht

# Comment
source: Calendar and Scheduling Program
de: Ein Kalender und Zeitplaner

# GenericName
source: Personal Organizer
de: Persönliche Daten organisieren

# Name
source: Date Numbers Plugin for Calendars
de: Kalendertag-Modul für Kalender

# Comment
source: For each day this plugin shows its daynumber of the year at the top of the agenda view. For example, February 1 is day 32 of the year.
de: Für jeden Tag des Jahres wird mit diesem Modul der Kalendertag oben in der Terminplanansicht angezeigt. Der 1. Februar ist beispielsweise der 32. Kalendertag des Jahres.

# Name
source: Jewish Calendar Plugin
de: Modul für jüdischen Kalender

# Comment
source: Shows all dates in KOrganizer also in the Jewish calendar system.
de: Zeigt alle Daten in KOrganizer auch im jüdischen Kalendarium an.

# Name
source: Wikipedia Picture Of the Day Plugin for Calendars
de: Bild des Tages aus Wikipedia für den Kalender
