Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/kdepim/kabcclient.po
Languages: de

# NAME OF TRANSLATORS
source: Your names
de: Thomas Reitelbach

# EMAIL OF TRANSLATORS
source: Your emails
de: tr@erdfunkstelle.de

source: Interprets input as a unique KABC contact identifier
de: Interpretiert Eingaben als eindeutige KABC-Kontakt-Bezeichner

source: Interprets input as vCard data
de: Interpretiert Eingaben als vCard-Daten.

source: Warning: using codec '%1' with input format vcard, but vCards are usually expected to be in UTF-8.
de: Warnung: Verwendung des Codecs „%1“ mit dem Eingabeformat vcard, aber vCards werden normalerweise als UTF-8 erwartet.

source: Interprets input as email and optional name
de: Interpretiert Eingaben als E-Mail-Adresse und optionalen Namen

source: Tries to get email and name from input, otherwise sets input text for both
de: Versucht E-Mail-Adresse und Name aus der Eingabe zu erkennen. Anderenfalls wird der Eingabetext für beide gesetzt.

source: Interprets the input as a name. Recommended format is 'lastname, firstname middlename'
de: Interpretiert die Eingabe als Name. Empfohlenes Format ist „Nachname, Vorname 2. Vorname“

source: Interprets the input as a delimiter separated list of fields.
de: Interpretiert die Eingabe als trennzeichenseparierte Feldliste.

source: Specify one of the following CSV templates:
de: Geben Sie eine der folgenden CSV-Vorlagen an:

source: Select contacts in a dialog instead of reading input text
de: Wählt Kontakte in einem Dialog aus anstelle des Einlesens von Textdaten

source: Saving modifications to address book failed
de: Speichern der Änderungen in das Adressbuch ist fehlgeschlagen.

source: Input number %1 matches more than one contact. Skipping it to avoid undesired results
de: Eingabekennung %1 passt auf mehrere Kontakte. Diese wird übersprungen, um unerwünschte Ergebnisse zu vermeiden.

source: Input format '%1' not usable with operation '%2'
de: Eingabeformat „%1“ ist nicht mit der Operation „%2“ anwendbar.

source: KDE address book command-line client
de: Befehlszeilen-Client für das KDE-Adressbuch

source: Primary Author
de: Hauptautor

source: Add input data as new address book entries
de: Eingabedaten als neuen Adressbucheintrag hinzufügen

source: Remove entries matching the input data
de: Einträge entfernen, die auf die Eingabedaten passen

source: Merge input data into the address book
de: Eingabedaten in das Adressbuch zusammenführen

source: Search for entries matching the input data
de: Nach Einträgen im Adressbuch suchen, die auf die Eingabedaten passen

source: List all entries in address book
de: Alle Adressbuch-Einträge auflisten

source: Do not save changes to the address book on add/remove operations
de: Änderungen am Adressbuch beim Hinzufügen/Entfernen nicht speichern

source: How to interpret the input data.
de: Legt fest, wie die Eingabedaten interpretiert werden sollen.

source: Input options for the selected format
de: Eingabe-Optionen für das ausgewählte Format

source: How to present the output data.
de: Legt fest, wie die Ausgabe-Daten angezeigt werden sollen

source: Output options for the selected format
de: Ausgabe-Optionen für das ausgewählte Format

source: How to convert the input text.
de: Legt fest, wie der Eingabetext umgewandelt werden soll.

source: How to convert the output text.
de: Legt fest, wie der Ausgabetext umgewandelt werden soll.

source: Match key fields case sensitive. UID is always matched case sensitive
de: Groß-/Kleinschreibung in Datenfeldern berücksichtigen. Beim Feld „UID“ wird Groß-/Kleinschreibung immer beachtet.

source: +[input data]
de: +[eingabe daten]

source: Input to use instead of reading stdin
de: Zu verwendende Eingabe an Stelle der Standardeingabe „stdin“

source: No operation specified, assuming --search
de: Keine Operation angegeben, es wird --search angenommen

source: Invalid input format "%1". See --input-format help
de: Ungültiges Eingabeformat „%1“. Weiteres dazu in der Hilfe zu --input-format.

source: Invalid options for input format "%1". See --input-format-options help
de: Ungültige Optionen für Eingabeformat „%1“. Weiteres dazu in der Hilfe zu --input-format-options.

source: Invalid output format "%1". See --output-format help
de: Ungültiges Ausgabeformat „%1“. Weiteres dazu in der Hilfe zu --output-format.

source: Invalid options for output format "%1". See --output-format-options help
de: Ungültige Optionen für Ausgabeformat „%1“. Weiteres dazu in der Hilfe zu --output-format-options.

source: Invalid input codec "%1"
de: Ungültiger Eingabe-Codec „%1“

source: Invalid output codec "%1"
de: Ungültiger Ausgabe-Codec „%1“

source: Unable to perform requested operation
de: Die angeforderte Operation kann nicht ausgeführt werden

source: The following input formats are available:
de: Die folgenden Eingabeformate stehen zur Verfügung:

source: No description available
de: Keine Beschreibung verfügbar

source: No options available for input format %1
de: Für das Eingabeformat „%1“ sind keine Optionen verfügbar

source: The following options are available for input format %1:
de: Die folgenden Optionen sind für das Eingabeformat „%1“ verfügbar:

source: The following output formats are available:
de: Die folgenden Ausgabeformate stehen zur Verfügung:

source: No options available for output format %1
de: Für das Ausgabeformat „%1“ sind keine Optionen verfügbar

source: The following options are available for output format %1:
de: Die folgenden Optionen für das Ausgabeformat „%1“ sind verfügbar:

source: The input codec transforms the input text data into an universal internal format
de: Der Eingabe-Codec überführt die Eingabetextdaten in ein universelles internes Format

source: Default input encoding is 'local' unless input format is 'vcard', in which case the default encoding will be 'utf8'.
de: Die Standard-Eingabekodierung ist „local“, es sei denn, das Eingabeformat ist „vcard“. In diesem Fall ist die Standardkodierung „utf8“.

source: The output codec transforms the output text data from the internal format to an 8-bit text format
de: Der Ausgabe-Codec überführt die Ausgabetextdaten aus dem internen Format in ein 8-Bit-Textformat.

source: Default output encoding is 'local' unless output format is 'vcard', in which case the default encoding will be 'utf8'.
de: Die Standard-Ausgabekodierung ist „local“, es sei denn, das Ausgabeformat ist „vcard“. In diesem Fall ist die Standardkodierung „utf8“.

source: Built-in codecs are UTF8 and LOCAL, respectively using the 8-bit unicode format or your local encoding
de: Die eingebauten Codecs sind UTF8 und LOCAL, die das 8-Bit-Unicode-Format bzw. Ihre lokale Kodierung benutzen.

source: Other codecs can be specified by their ISO code, for example 'ISO 8859-15' for western european languages, including the Euro sign
de: Andere Codecs können durch die Angabe ihres ISO-Codes angegeben werden, beispielsweise „ISO 8859-15“ für westeuropäische Sprachen einschließlich des Euro-Symbols.

source: kabc - mutt converter
de: kabc – mutt-Konverter

source: Contributor
de: Beiträge

source: Only show contacts where name or address matches <placeholder>substring</placeholder>
de: Kontakte nur anzeigen, wenn Name oder Adresse auf <placeholder>zeichenkette</placeholder> passt.

source: Default format is 'alias'. 'query' returns email[tab]name[tab], as needed by mutt's query_command
de: Das Standardformat ist „alias“. „query“ gibt email[tab]name[tab] zurück, so wie es query_command von mutt verlangt.

source: Default key format is 'JohDoe', this option turns it into 'jdoe'
de: Das Standard-Schlüsselformat ist „JohDoe“. Diese Einstellung ändert es auf „jdoe“.

source: Make queries case insensitive
de: Abfragen ignorieren Groß-/Kleinschreibung

source: Return all mail addresses, not just the preferred one
de: Alle E-Mail-Adressen zurückliefern, nicht nur die bevorzugte

source: Searching KDE address book
de: KDE-Adressbuch wird durchsucht

source: No matches in KDE address book
de: Keine Übereinstimmung im KDE-Adressbuch

source: Writes the unique KABC contact identifier
de: Schreibt den eindeutigen Bezeichner für KABC-Kontakte

source: Exports to vCard format
de: Exportiert in das vCard-Format

source: Optionally use a different vCard version (default is %1)
de: Optional eine andere vCard-Version verwenden (Voreinstellung: %1)

source: Uses the vCard version 2.1
de: Verwendet vCard in Version 2.1

source: Warning: using codec '%1' with output format vcard, but vCards are usually expected to be in UTF-8.
de: Achtung: Die Kodierung „%1“ wird mit dem Ausgabeformat „vcard“ verwendet; vCards werden jedoch in der Kodierung „UTF-8“ erwartet.

source: Writes email address or formatted name &lt;email address&gt;
de: Schreibt die E-Mail-Adresse oder den formatierten Namen &lt;E-Mail-Adresse&gt;

source: Comma separated list of: allemails, withname
de: Kommagetrennte Liste von: alle Mails, mit Name

source: List all email addresses of each contact
de: Alle E-Mail-Adressen jedes Kontaktes auflisten

source: Prepend formatted name, e.g John Doe &lt;jdoe@foo.com&gt;
de: Formatierten Namen voranstellen, z. B. Thomas Reitelbach&lt;treitelbach@meinedomain.com&gt;

source: Formats output as needed by the mail client mutt
de: Formatiert die Ausgabe so, wie sie vom E-Mail-Programm mutt benötigt wird

source: Comma separated list of: allemails, query, alias, altkeys, prefernick, alsonick. Default is alias
de: Kommagetrennte Liste von: alle Mails, Abfrage, Alias, Alt. Tasten, Bevorzugter Kurzname, Alternativer Kurzname. Voreinstellung ist Alias

source: Use mutt's query format, e.g. jdoe@foo.com [tab] John Doe Conflicts with alias
de: Abfrageformat von Mutt verwenden. D. h. jdoe@foo.com [tab] John Doe Steht in Konflikt mit Alias

source: Use mutt's alias format, e.g. alias JohDoe[tab]John Doe &lt;jdoe@foo.com&gt; Conflicts with query
de: Abfrageformat von Mutt verwenden. D. h. jdoe@foo.com [tab] John Doe Steht in Konflikt mit Abfrage

source: Use alternative keys with alias format, e.g. alias jdoe[tab]John Doe &lt;jdoe@foo.com&gt;
de: Alternative Tasten mit Alias-Format verwenden. D. h. alias jdoe[tab]John Doe &lt;jdoe@foo.com&gt;

source: If a nick name exists use it instead of the key, e.g. alias johnny[tab]John Doe &lt;jdoe@foo.com&gt;
de: Sofern ein Kurzname existiert, verwende diesen an Stelle der Taste. D. h. alias johnny[tab]John Doe &lt;jdoe@foo.com&gt;

source: Generate additional aliases with the nick name as the key, e.g. alias johnny[tab]John Doe &lt;jdoe@foo.com&gt; Deactivates 'prefernick' to avoid duplicates
de: Weitere Aliase mit dem Kurznamen als Schlüssel erzeugen, z. B. Alias johnny[tab]John Doe &lt;jdoe@foo.com&gt; Deaktiviert 'Bevorzugter Kurzname', um Duplikate zu vermeiden

source: preferred
de: bevorzugt

source: Writes the data as a delimiter separated list of values
de: Schreibt die Daten in eine mit Trennzeichen separierte Liste von Werten.
