Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/kdepim/kmailcvt.po
Languages: de

# NAME OF TRANSLATORS
source: Your names
de: Matthias Kiefer, Frank Schütte

# EMAIL OF TRANSLATORS
source: Your emails
de: kiefer@kde.org, F.Schuette@t-online.de

source: KMailCVT Import Tool
de: KMailCVT – Dienstprogramm zum Importieren

source: Step 1: Select Filter
de: 1. Schritt: Filter auswählen

source: Step 2: Importing...
de: 2. Schritt: Importieren ...

source: Import in progress
de: Importvorgang läuft

source: Import finished
de: Import abgeschlossen

source: <p><i>Written by %1.</i></p>
de: <p><i>Geschrieben von %1.</i></p>

source: Mail Import Tool
de: Dienstprogramm zum Importieren von E-Mails

source: Copyright © 2000–2014 KMailCVT authors
de: Copyright © 2000–2014 KMailCVT-Autoren

source: Maintainer & New filter & cleanups
de: Betreuer & Neue Filter & Überarbeitungen

source: Original author
de: Ursprünglicher Autor

source: Previous Maintainer & New filters
de: Früherer Betreuer & Neue Filter

source: New GUI & cleanups
de: Neue Oberfläche & Überarbeitungen

source: Port to Akonadi
de: Portierung auf Akonadi

source: Click 'Back' to import more emails or contacts
de: Für den Import von weiteren E-Mails oder Kontakten klicken Sie bitte auf „Zurück“.

source: <!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0//EN" "http://www.w3.org/TR/REC-html40/strict.dtd"> <html><head><meta name="qrichtext" content="1" /><style type="text/css"> p, li { white-space: pre-wrap; } </style></head><body style=" font-family:'Sans Serif'; font-size:10pt; font-weight:400; font-style:normal;"> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-family:'DejaVu Sans'; font-size:9pt; font-weight:600;">Welcome to KMailCVT - The Mail Import Tool</span><span style=" font-family:'DejaVu Sans'; font-size:9pt;"> <br /><br />This program will help you import your email from your previous email program.<br /><br />Please select the program you would like to import from. Next, select the folder you would like to import to, then click 'Next'.</span></p></body></html>
de: <!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0//EN" "http://www.w3.org/TR/REC-html40/strict.dtd"> <html><head><meta name="qrichtext" content="1" /><style type="text/css"> p, li { white-space: pre-wrap; } </style></head><body style=" font-family:'Sans Serif'; font-size:10pt; font-weight:400; font-style:normal;"> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-family:'DejaVu Sans'; font-size:9pt; font-weight:600;">Willkommen bei KMailCVT – Dem Dienstprogramm zum Importieren von E-Mails</span><span style=" font-family:'DejaVu Sans'; font-size:9pt;"> <br /><br />Dieses Programm unterstützt Sie beim Importieren Ihrer E-Mails aus Ihrem früheren E-Mail-Programm.<br /><br />Bitte wählen Sie das Programm aus, von dem Ihre E-Mails importiert werden sollen. Wählen Sie anschließend den zu importierenden Ordner aus und klicken Sie dann auf „Weiter“.</span></p></body></html>

source: Please select the folder to import to:
de: Bitte wählen Sie den Ordner aus, in den importiert werden soll:

source: Remove &duplicate messages during import
de: &Doppelte Nachrichten beim Importieren entfernen
