Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/kdepim/korgac.po
Languages: de

# NAME OF TRANSLATORS
source: Your names
de: Stefan Winter

# EMAIL OF TRANSLATORS
source: Your emails
de: swinter@kde.org

# @title:window
source: Reminders
de: Erinnerungen

# @action:button
source: Dismiss Reminder
de: Erinnerung ausblenden

# @info:tooltip
source: Dismiss the reminders for the selected incidences
de: Erinnerungen für die ausgewählten Ereignisse bestätigen

# @action:button
source: Dismiss All
de: Alle ausblenden

# @info:tooltip
source: Dismiss the reminders for all listed incidences
de: Erinnerungen für alle aufgelisteten Ereignisse bestätigen

# @action:button
source: Edit...
de: Bearbeiten ...

# @info:tooltip
source: Edit the selected incidence
de: Das ausgewählte Ereignis bearbeiten

# @action:button
source: Suspend
de: Später erinnern

# @info:tooltip
source: Suspend the reminders for the selected incidences by the specified interval
de: Erinnerungen für die ausgewählten Ereignisse für die angegebene Zeit zurückstellen

# @label
source: Reminders: Click on a title to toggle the details viewer for that item
de: Erinnerungen: Klicken Sie auf einen Titel, um die Detailansicht für den Eintrag ein-/auszuschalten.

# @title:column reminder title
source: Title
de: Titel

# @title:column happens at date/time
source: Date Time
de: Datum, Zeit

# @title:column trigger date/time
source: Trigger Time
de: Auslösezeitpunkt

# @info:tooltip
source: The event or to-do title
de: Titel des Ereignisses oder der Aufgabe

# @info:tooltip
source: The reminder is set for this date/time
de: Die Erinnerung ist für diesen Zeitpunkt eingerichtet

# @info:tooltip
source: The date/time the reminder was triggered
de: Der Zeitpunkt, an dem die Erinnerung ausgelöst wurde

# @info default incidence details string
source: <emphasis>Select an event or to-do from the list above to view its details here.</emphasis>
de: <emphasis>Wählen Sie oben ein Ereignis oder eine Aufgabe aus, so können Sie hier die Details dazu anschauen.</emphasis>

# @label:spinbox
source: Suspend &duration:
de: &Wartezeit bis zur nächsten Erinnerung:

# @info:tooltip
source: Suspend the reminders by this amount of time
de: Erinnerungen für die angegebene Wartezeit aussetzen

# @info:whatsthis
source: Each reminder for the selected incidences will be suspended by this number of time units. You can choose the time units (typically minutes) in the adjacent selector.
de: Jede Erinnerung für das gewählte Ereignis wird für die festgelegte Anzahl Zeiteinheiten ausgesetzt. Die Zeiteinheiten (üblicherweise „Minuten“) können Sie im angrenzenden Auswahlfeld einstellen.

# @item:inlistbox suspend in terms of minutes
source: minute(s)
de: Minute(n)

# @item:inlistbox suspend in terms of hours
source: hour(s)
de: Stunde(n)

# @item:inlistbox suspend in terms of days
source: day(s)
de: Tag(e)

# @item:inlistbox suspend in terms of weeks
source: week(s)
de: Woche(n)

# @info:tooltip
source: Suspend the reminders using this time unit
de: Erinnerung mit dieser Zeiteinheit aussetzen.

# @info:whatsthis
source: Each reminder for the selected incidences will be suspended using this time unit. You can set the number of time units in the adjacent number entry input.
de: Jede Erinnerung für das gewählte Ereignis wird mit dieser Zeiteinheit ausgesetzt. Die Anzahl Zeiteinheiten können Sie im angrenzenden Auswahlfeld festlegen.

# @info
source: "%1" is a read-only item so modifications are not possible.
de: „%1“ ist ein nur lesbares Ereignis, daher können keine Änderungen vorgenommen werden.

# @title
source: Reminder
de: Erinnerung

# @title
source: Reminder: %1
de: Erinnerung: %1

# @info
source: Could not start KOrganizer so editing is not possible.
de: KOrganizer lässt sich nicht starten, daher sind Änderungen nicht möglich.

# @info
source: An internal KOrganizer error occurred attempting to modify "%1"
de: Beim Ändern von „%1“ ist ein interner Fehler in KOrganizer aufgetreten.

# @title:window
source: KOrganizer Reminder Daemon
de: KOrganizer-Erinnerungsmodul

# @info
source: Cannot load system tray icon.
de: Das Symbol für den Systembereich kann nicht geladen werden.

# @action:inmenu
source: Suspend All Reminders
de: An alle später erinnern

# @action:inmenu
source: Dismiss All Reminders
de: Alle Erinnerungen ausblenden

# @action:inmenu
source: Enable Reminders
de: Erinnerungen aktivieren

# @action:inmenu
source: Start Reminder Daemon at Login
de: Erinnerungsmodul bei der Anmeldung starten

# @info:status
source: There is 1 active reminder.
de: Es ist 1 Erinnerung aktiv.

# @info:status
source: No active reminders.
de: Keine aktiven Erinnerungen

# @info
source: Do you want to quit the KOrganizer reminder daemon?<nl/><note> you will not get calendar reminders unless the daemon is running.</note>
de: Soll das Erinnerungsmodul von KOrganizer beendet werden?<nl/><note>Es werden keine Kalender-Erinnerungen angezeigt, wenn das Modul nicht läuft.</note>

# @title:window
source: Close KOrganizer Reminder Daemon
de: KOrganizer-Erinnerungsmodul beenden

# @info
source: Do you want to start the KOrganizer reminder daemon at login?<nl/><note> you will not get calendar reminders unless the daemon is running.</note>
de: Soll das Erinnerungsmodul von KOrganizer beim Anmelden gestartet werden?<nl/><note>Beachten Sie, dass keine Kalender-Erinnerungen angezeigt werden, wenn das Modul nicht läuft.</note>

# @action:button start the reminder daemon
source: Start
de: Starten

# @action:button do not start the reminder daemon
source: Do Not Start
de: Nicht starten

source: KOrganizer Reminder Daemon
de: KOrganizer-Erinnerungsmodul

source: Former Maintainer
de: Ehemaliger Betreuer

source: Free Busy Object
de: Frei/Belegt-Objekt

source: Free Busy Message
de: Frei/Belegt-Nachricht
