Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/kdepim/notes-mobile.po
Languages: de

# NAME OF TRANSLATORS
source: Your names
de: Frederik Schwarzer, Felix Wolfsteller

# EMAIL OF TRANSLATORS
source: Your emails
de: schwarzer@kde.org, felix.wolfsteller@intevation.de

source: 1 note book
de: 1 Notizbuch

source: Kontact Touch Notes
de: Notizen-Modul für Kontact Touch

source: Notes
de: Notizen

source: New Note
de: Neue Notiz

source: Import Notes
de: Notizen importieren

source: Export Notes From This Account
de: Notizen aus diesem Konto exportieren

source: Export Displayed Notes
de: Angezeigte Notizen exportieren

source: You do not appear to have any resources for notes. Please create one first.
de: Sie haben ncoh keine Ressource für Notizen eingerichtet. Bitte erstellen Sie eine.

source: No resources available
de: Keine Ressource verfügbar

source: Notebook Properties
de: Notizbuch-Eigenschaften

source: New Sub Notebook
de: Neues Unter-Notizbuch

source: Synchronize This Notebook
de: Dieses Notizbuch synchronisieren

source: Delete Notebook
de: Notizbuch löschen

source: Move Notebook To
de: Notizbuch verschieben nach

source: Copy Notebook To
de: Notizbuch kopieren nach

source: Copy Note To
de: Notiz kopieren nach

source: Move Note To
de: Notiz verschieben nach

source: Delete Note
de: Notiz löschen

source: Synchronize All Accounts
de: Alle Konten synchronisieren

# @title:window
source: New Account
de: Neues Konto

source: Could not create account: %1
de: Das Konto kann nicht erstellt werden: „%1“

source: Account creation failed
de: Konto-Erstellung fehlgeschlagen

# @title:window
source: Delete Account?
de: Konto löschen?

source: Do you really want to delete the selected account?
de: Möchten Sie das ausgewählte Konto wirklich löschen?

source: Home
de: Start

source: Select Multiple Notebooks
de: Mehrere Notizbücher auswählen

source: Accounts
de: Konten

source: Account
de: Konto

source: Folder
de: Ordner

source: Edit
de: Bearbeiten

source: View
de: Ansicht

source: Add View As Favorite
de: Ansicht als Favoriten hinzufügen

source: Switch To Editing Mode
de: Zum Bearbeiten-Modus umschalten

source: Folders
de: Ordner

source: Select Notebooks
de: Notizbücher auswählen

# %1 is e.g. 3 folders, %2 is e.g. from 2 accounts, %3 is e.g. 9 emails
source: You have selected %1 %2 %3
de: Sie haben %1 %2 %3 ausgewählt

source: 1 folder
de: 1 Ordner

source: from 1 account
de: von einem Konto

source: 1 note
de: mit einer Notiz

source: Select
de: Auswählen

source: Change Selection
de: Auswahl ändern

source: No notes in this notebook
de: Keine Notizen in diesem Notizbuch

source: Actions
de: Aktionen

source: One note found
de: Eine Notiz gefunden

source: Which notes shall be exported?
de: Welche Notizen sollen exportiert werden?

source: All Notes
de: Alle Notizen

source: Notes in current folder
de: Notizen in ausgewähltem Ordner

source: Unable to open MBox file %1
de: Die MBox-Datei %1 kann nicht geöffnet werden

source: Unable to save notes to MBox file %1
de: In der MBox-Datei %1 lassen sich keine Notizen speichern

source: Select MBox to Import
de: Wählen Sie die zu importierende MBox-Datei

source: Select the folder the imported note(s) shall be saved in:
de: Wählen Sie, in welchem Ordner die importierte(n) Notiz(en) gespeichert werden soll(en):

source: Select Folder
de: Ordner auswählen

source: Importing one note to %2
de: Eine Notiz wird nach %2 importiert

source: MBox Import Failed
de: Importieren der MBox-Datei ist fehlgeschlagen

# @info
source: <para>When trying to read the MBox, there was an error opening the file <filename>%1</filename>:</para>
de: <para>Während des Lesens der MBox-Datei gab es einen Fehler beim Öffnen der Datei <filename>%1</filename>:</para>

source: No notes were imported, due to errors with the MBox.
de: Aufgrund von Fehlern mit der MBox-Datei, sind keine Notizen importiert worden.

source: The MBox does not contain any notes.
de: Die MBox enthält keine Notizen

source: Search for:
de: Suchen nach:

source: Titles
de: Titel

source: Contents
de: Inhalte

source: Located in:
de: Suchen in:

source: any folder
de: allen Ordnern

source: only in folder
de: nur im Ordner
