Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/extragear-office/tellico.appdata.po
Languages: de

source: Collection Manager
de: Sammlungsverwaltung

source: Features:
de: Funktionen:

source: Supports user-defined custom collections
de: Unterstützt benutzerdefinierte Sammlungen

source: Handles entries with multiple authors, genres, keywords, etc
de: Verarbeitet Einträge mit mehreren Autoren, Genres, Stichwörtern usw.

source: Automatically formats titles and names
de: Automatische Formatierung von Titeln und Namen

source: Supports collection searching and view filtering
de: Unterstützt das Durchsuchen von Sammlungen und Filterung der Ansichten

source: Sorts and groups collection by various properties
de: Sortiert und Gruppiert Sammlungen nach verschiedenen Eigenschaften

source: Allows customizable entry templates through XSLT
de: Erlaubt anpassbare Vorlagen für Einträge mittels XSLT

source: Imports MODS, Bibtex, RIS, CSV, PDF metadata, and many other formats
de: Import von MODS-, Bibtex-, RIS-, CSV-, PDF-Metadaten und vielen anderen Formaten

source: Exports to Bibtex, ONIX, CSV, HTML, PilotDB, and other formats
de: Export zu Bibtex, ONIX, CSV, HTML, PilotDB, und andere Formate

source: Imports information directly from Amazon.com, IMDb, z39.50 servers, PubMed, SRU servers, CrossRef.org, various other websites, and from external scripts
de: Importiert Informationen direkt von Amazon.com, IMDb, z39.50-Servern, PubMed, SRU-Servern, CrossRef.org, verschiedenen anderen Webseiten und von externen Skripten

source: Imports CDDB data for cataloging audio CDs
de: Importiert CDDB-Daten für die Katalogisierung von Audi-CDs

source: Scans and imports audio file collections, such as mp3 or ogg
de: Durchsucht und importiert Sammlungen von Audio-Dateien wie zum Beispiel mp3 oder ogg
