Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/kdeaccessibility/desktop_kdeaccessibility_jovie.po
Languages: de

# Name
source: String Replacer
de: Zeichenkettenersetzer

# Comment
source: Generic String Replacement Filter Plugin for Jovie
de: Ein allgemeines Modul zur Zeichenkettenersetzung für Jovie

# Name
source: Talker Chooser
de: Sprecherauswahl

# Comment
source: Generic Talker Chooser Filter Plugin for Jovie
de: Ein allgemeines Modul zur Sprecherauswahl für Jovie

# Name
source: XML Transformer
de: XML-Umformer

# Comment
source: Generic XML Transformation Filter Plugin for Jovie
de: Ein allgemeines Modul zur XML-Umformung für Jovie

# Comment
source: KDE Text To Speech Service
de: KDE Sprachausgabedienst

# GenericName
source: Text To Speech Service
de: Sprachausgabedienst

# Name
source: Text-to-Speech
de: Sprachausgabe

# Comment
source: Text-to-Speech Control Module
de: Kontrollmodul für die Sprachausgabe

# X-KDE-Keywords
source: kttsd,kcmkttsmgr,kttsmgr,tts,ttsd,ktts,text,to,speech,speak,synthesizer,synth,festival,command,freetts,proklam,via,voice
de: kttsd,kcmkttsmgr,kttsmgr,tts,ttsd,ktts,text,to,speech,speak,synthesizer,synth,festival,command,freetts,proklam,via,voice,Sprachsynthese,Vorlesen,Sprache,Sprachausgabe

# Name
source: The text-to-speech system seems to be functioning properly.
de: Die Sprachausgabe scheint ordnungsgemäß zu funktionieren.
