Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/kdemultimedia/mplayerthumbsconfig.po
Languages: de

# NAME OF TRANSLATORS
source: Your names
de: Frederik Schwarzer

# EMAIL OF TRANSLATORS
source: Your emails
de: schwarzer@kde.org

source: Create strips around thumbnails
de: Filmstreifen um die Vorschaubilder erzeugen

source: Clean Cache
de: Zwischenspeicher leeren

source: Blacklisted File Extensions
de: Dateierweiterungen auf der Sperrliste

source: MPlayerThumbs Configuration Utility
de: Einrichtungsprogramm für MPlayerThumbs

source: (C) 2006 Marco Gulino
de: © 2006 Marco Gulino

source: mplayer config
de: MPlayer-Konfiguration

source: Enter the path for mplayer executable file.
de: Geben Sie den Pfad zur MPlayer-Programmdatei ein.

source: Custom arguments for mplayer
de: Eigene Argumente für MPlayer

source: General
de: Allgemein

source: Cleaning the cache will delete all the previously generated thumbnails. Note that as there is a single common thumbnail cache, the thumbnails for all other file types will also be deleted. Do you really want to clean up the cache?
de: Das Leeren des Zwischenspeichers wird alle bisher erstellten Vorschaubilder löschen. Da nur ein einziger gemeinsamer Zwischenspeicher für die Vorschaubilder existiert, werden auch die Vorschaubilder aller anderen Dateitypen gelöscht. Möchten Sie den Zwischenspeicher wirklich leeren?
