Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/kdewebdev/desktop_kdewebdev.po
Languages: de

# GenericName
source: Search & Replace Tool
de: Werkzeug zum Suchen & Ersetzen

# Comment
source: A batch search and replace tool
de: Ein Werkzeug zum Suchen und Ersetzen im Stapelbetrieb

# GenericName
source: File Replace View
de: KFileReplace

# GenericName
source: HTML Image Map Editor
de: Editor für HTML-Bildkarten (Imagemaps)

# Comment
source: An HTML imagemap editor
de: Ein Editor für HTML-Bildkarten (Imagemaps)

# GenericName
source: Link Checker
de: Überprüfungswerkzeug für Verknüpfungen

# Name
source: KLinkStatusPart
de: KLinkStatus-Komponente

# Name
source: Automation plugin
de: Modul zur Automatisierung

# Comment
source: Allow configuration of automated tasks
de: Einrichtung von automatisierten Aufgaben erlauben

# Name
source: Scripting plugin
de: Skript-Modul

# Comment
source: Allow execution of scripts
de: Ausführung von Skripten erlauben

# GenericName
source: Dynamic Dialog Editor
de: Editor für dynamische Dialoge

# Comment
source: Dynamic Dialog Editor
de: Editor für dynamische Dialoge

# Comment
source: Executor for Kommander dialogs
de: Ausführung von Kommander-Dialogen

# Name
source: Kommander Executor
de: Kommander-Exekutor

# Comment
source: Kommander File
de: Kommander-Datei
