Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/kdewebdev/klinkstatus.po
Languages: de

# NAME OF TRANSLATORS
source: Your names
de: Stephan Johach,Georg Schuster,Martin Ereth

# EMAIL OF TRANSLATORS
source: Your emails
de: hunsum@gmx.de,gschuster@utanet.at,martin.ereth@arcor.de

source: New Session
de: Neue Sitzung

source: Open URL...
de: URL öffnen ...

source: Close Session
de: Sitzung schließen

source: Download New Stylesheets...
de: Neue Stilvorlagen herunterladen ...

source: Configure KLinkStatus...
de: KLinkStatus einrichten ...

source: About KLinkStatus
de: Über KLinkStatus

source: &Report Bug...
de: Probleme oder Wünsche be&richten ...

source: All...
de: Alle ...

source: Broken...
de: Kaputt ...

source: Create Site Map...
de: Sitemap erstellen ...

source: &Follow Last Link
de: Letzter Verknüpfung &folgen

source: Follow last Link checked (slower)
de: Der zuletzt geprüften Verknüpfung folgen (langsamer)

source: &Hide Search Panel
de: &Suchleiste ausblenden

source: &Reset Search Options
de: Sucheinstellungen &zurücksetzen

source: &Disable Updates on Results Table
de: Aktualisierungen in der Ergebnistabelle &deaktivieren

source: Disable Updates on Results Table (faster)
de: Aktualisierungen in der Ergebnistabelle deaktivieren (schneller)

source: &Start Search
de: &Suche starten

source: &Pause Search
de: Suche &pausieren

source: St&op Search
de: Suche &stoppen

source: Search in Background
de: Im Hintergrund suchen

source: Check Links in background and update results when finished (faster)
de: Überprüft Verknüpfungen im Hintergrund und zeigt das Ergebnis erst an, wenn die Prüfung beendet ist (schneller)

source: &Broken Links
de: &Kaputte Verknüpfungen

source: &Displayed Links
de: &Angezeigte Verknüpfungen

source: &Unreferred Documents...
de: &Nicht verknüpfte Dokumente ...

source: &Fix All...
de: Alle &reparieren ...

source: Check Links
de: Verknüpfungen überprüfen

source: Unreferred Documents
de: Nicht verknüpfte Dokumente

source: Previous View
de: Vorherige Ansicht

source: Next View
de: Nächste Ansicht

source: Previous Session
de: Vorherige Sitzung

source: Next Session
de: Nächste Sitzung

source: Change View
de: Ansicht wechseln

source: Whether to use the system real name and e-mail
de: Legt fest, ob systemweiter Realname und E-Mail-Adresse verwendet werden

source: The name associated to the user
de: Name des Benutzers

source: The email associated to the user
de: E-Mail-Adresse des Benutzers

source: Maximum number of entries in the combo url.
de: Maximale Anzahl Einträge im Kombinationsfeld URL.

source: Maximum number of simultaneous connections.
de: Maximale Anzahl gleichzeitiger Verbindungen.

source: Timeout on getting an URL.
de: Wartezeit beim Aufruf einer URL.

source: History of combo url.
de: Verlauf des Kombinationsfeldes URL.

source: Maximum depth to check.
de: Maximale Prüftiefe.

source: Whether to check parent folders.
de: Legt fest, ob übergeordnete Ordner geprüft werden sollen.

source: Whether to check external links.
de: Legt fest, ob externe Verknüpfungen überprüft werden sollen.

source: Whether to remember the check settings like depth, and so on, on exit.
de: Legt fest, ob die Einstellungen beim Beenden gespeichert werden sollen.

source: Whether preview prefix in Quanta project is used to set the URL to check.
de: Ob Quantas Projektvorschau-Präfix zur Bestimmung der zu prüfenden URL verwendet wird.

source: Whether to display a tree view or a flat view in the results view.
de: Ob die Ergebnisse in einer Baumansicht oder einer Listensicht angezeigt werden sollen.

source: Whether to automatically adjust the width of the result columns (Not used).
de: Ob die Breite der Ergebnisspalten automatisch angepasst werden soll (wird nicht verwendet).

source: Whether the viewport of the result view should follow the last link checked.
de: Ob die Anzeige des Ergebnisses der zuletzt geprüften Verknüpfung folgen soll.

source: Whether to send an User-Agent in HTTP requests.
de: Ob die Browserkennung in HTTP-Anforderungen mitgesendet werden soll.

source: Defines the HTTP User-Agent to send.
de: Legt die zu sendende Browserkennung fest.

source: Whether the user can see if the markup is valid by showing a column with an icon indicator.
de: Ob der Benutzer die Gültigkeit der Seitenbeschreibung durch die Anzeige einer Spalte mit einem Symbol sehen kann.

source: Available Stylesheets for exporting the results in HTML
de: Verfügbare Stilvorlagen für den Export als HTML

source: Defines the stylesheet to use when exporting results to HTML
de: Gibt die Stilvorlage an, die für den Export als HTML verwendet wird

source: This option specifies the number of spaces Tidy uses to indent content, when indentation is enabled.
de: Diese Einstellung gibt die Anzahl der Leerzeichen an, die Tidy verwenden soll, um Inhalt einzurücken, wenn Einrücken aktiviert ist.

source: Whether to do line wrapping.
de: Legt fest, ob Zeilen umgebrochen werden sollen.

source: This option specifies the right margin Tidy uses for line wrapping. Tidy tries to wrap lines so that they do not exceed this length.
de: Diese Einstellung gibt den rechten Rand an, den Tidy für den Zeilenumbruch verwenden soll. Tidy versucht Zeilen so umzubrechen, dass diese Länge nicht überschritten wird.

source: This option specifies if Tidy should output tag names in upper case. The default is no, which results in lower case tag names, except for XML input, where the original case is preserved.
de: Diese Einstellung gibt an, ob Tidy Tag-Namen in Großbuchstaben ausgeben soll. Der Standard ist nein, wodurch Kleinbuchstaben ausgegeben werden. Ausnahme: XML, die ursprüngliche Großschreibung wird beibehalten.

source: This option specifies if Tidy should output attribute names in upper case. The default is no, which results in lower case attribute names, except for XML input, where the original case is preserved.
de: Diese Einstellung gibt an, ob Tidy Attributnamen in Großbuchstaben ausgeben soll. Der Standard ist nein, wodurch Kleinbuchstaben ausgegeben werden. Ausnahme: XML, die ursprüngliche Großschreibung wird beibehalten.

source: This option specifies the DOCTYPE declaration generated by Tidy. If set to "omit" the output won't contain a DOCTYPE declaration. If set to "auto" (the default) Tidy will use an educated guess based upon the contents of the document. If set to "strict", Tidy will set the DOCTYPE to the strict DTD. If set to "loose", the DOCTYPE is set to the loose (transitional) DTD. Alternatively, you can supply a string for the formal public identifier (FPI).
de: Diese Einstellung gibt die von Tidy erzeugte DOCTYPE-Definition an. Wenn dies auf „weglassen“ gestellt wird, enthält die Ausgabe keine DOCTYPE-Definition. Wenn dies auf „automatisch“ (Standard) gestellt wird, wird Tidy eine wohlbedachte Wahl aufgrund des Inhalts der Datei treffen. Wenn dies auf „strikt“ gestellt wird, wird Tidy eine strikte DTD verwenden. Wenn dies auf „locker“ gestellt wird, wird Tidy eine lockere DTD auswählen. Alternativ können Sie eine Zeichenkette für den Formalen Öffentlichen Indentifizierer (FPI) angeben.

source: This option specifies if Tidy should pretty print output, writing it as well-formed XML. Any entities not defined in XML 1.0 will be written as numeric entities to allow them to be parsed by a XML parser. The original case of tags and attributes will be preserved, regardless of other options.
de: Diese Einstellung gibt an, ob Tidy die Ausgabe schön darstellen soll, geschrieben als wohlgeformtes XML. Jedes nicht in XML 1.0 definierte Zeichen wird durch seine numerische Entität ersetzt, wodurch eine Verarbeitung durch einen XML-Parser gewährleistet ist, unabhängig von anderen Einstellungen.

source: This option specifies if Tidy should strip out surplus presentational tags and attributes replacing them by style rules and structural markup as appropriate. It works well on the HTML saved by Microsoft Office products.
de: Diese Einstellung gibt an, ob Tidy überflüssige Tags und Attribute entfernen und durch Stil-Regeln und strukturierten Quelltext, wo möglich, ersetzen soll. Funktioniert bei von Microsoft Office-Produkten erzeugtem HTML wunderbar.

source: This option specifies the character encoding Tidy uses for both the input and output.
de: Diese Einstellung gibt an, welche Zeichenkodierung Tidy für Eingabe und Ausgabe verwenden soll.

source: Name of the configuration, e.g. kdewebdev
de: Name der Konfiguration, z. B. kdewebdev

source: Periodicity of the check
de: Periodizität der Überprüfung

source: Hour in which the task will be executed
de: Stunde, in der die Überprüfung gestartet wird

source: URL of the site to check
de: Adresse der zu prüfenden Seite

source: For protocols different than HTTP, specify the root of your files, e.g. '/var/www'
de: Für Protokolle außer HTTP, geben Sie das Basisordner Ihrer Dateien an, z. B. „/var/www“

source: Depth of recursive search, -1 is unlimited
de: Tiefe der Rekursion beim Suchen. -1 für unbegrenzt

source: Whether to check links in parent folders
de: Legt fest, ob Verknüpfungen in übergeordneten Ordner geprüft werden

source: Whether to check external links
de: Legt fest, ob externe Verknüpfungen überprüft werden sollen

source: The URLs that match the regexp will not be checked
de: Adressen, die auf den regulären Ausdruck passen, werden nicht geprüft

source: Whether to include only broken links in the result
de: Legt fest, ob nur kaputte Verknüpfungen im Ergebnis aufgeführt werden

source: The directory where the results will be saved
de: Der Ordner, in dem die Ergebnisse gespeichert werden

source: The e-mail address to where results will be emailed
de: Die E-Mail-Adresse, an die die Ergebnisse gesendet werden

source: No Content
de: Kein Inhalt

source: redirection
de: Umleitung

source: Could not find the KLinkStatus part; did you configure with '--prefix=/$KDEDIR' and perform 'make install'?
de: Die Komponente KLinkStatus kann nicht gefunden werden. Haben Sie beim Kompilieren configure mit „--prefix=$KDEDIR“ aufgerufen und ein „make install“ durchgeführt?

source: A Link Checker
de: Ein Prüfprogramm für Verknüpfungen

source: Check
de: Prüfen

source: Results
de: Ergebnisse

source: Identification
de: Browserkennung

source: Configure the way KLinkstatus reports itself
de: Einstellung der Browserkennung von KLinkstatus

source: Mail Transport
de: E-Mail-Transport

source: KLinkStatus Part
de: KLinkStatus-Komponente

source: (C) 2004 Paulo Moura Guedes
de: © 2004 Paulo Moura Guedes

source: &File
de: &Datei

source: Export to HTML
de: Als HTML exportieren

source: &Settings
de: &Einstellungen

source: &View
de: &Ansicht

source: S&earch
de: &Suche

source: Recheck
de: Erneut prüfen

source: &Validate
de: Ü&berprüfen

source: Manual Fix
de: Manuell reparieren

source: &Window
de: &Fenster

source: &Help
de: &Hilfe

# @title:menu
source: Main Toolbar
de: Haupt-Werkzeugleiste

source: &Tools
de: E&xtras

source: A Link Checker. KLinkStatus belongs to the kdewebdev module from KDE.
de: Prüft Verknüpfungen (Links). KLinkStatus ist Teil der kdewebdev-Module von KDE.

source: (C) 2004-2008 Paulo Moura Guedes
de: © 2004–2008 Paulo Moura Guedes

source: Document to open
de: Zu öffnendes Dokument

source: Use System Identity
de: Systemidentität verwenden

source: E-Mail address
de: E-Mail-Adresse

source: Configure PIM information
de: PIM-Informationen einrichten

source: User Information
de: Benutzerinformationen

source: Hourly
de: Stündlich

source: Daily
de: Täglich

source: Weekly
de: Wöchentlich

source: Scheduling
de: Planung

source: Periodicity
de: Periodizität

source: Hour
de: Stunde

source: Show Broken Links Only
de: Nur kaputte Verknüpfungen anzeigen

source: Results Folder
de: Ergebnis-Ordner

source: E-Mail Recipient
de: E-Mail-Empfänger

source: Search Options
de: Sucheinstellungen

source: Document Root
de: Basisordner für Dokumente

source: Depth
de: Tiefe

source: Unlimited
de: Unbegrenzt

source: Check Parent Folders
de: Übergeordnete Ordner prüfen

source: Check External Links
de: Externe Verknüpfungen prüfen

source: Do not check Regular Expression
de: Reguläre Ausdrücke nicht prüfen

source: Configure Site check Automation
de: Seitenprüf-Automatik einrichten

source: New...
de: Neu ...

source: Remove
de: Entfernen

source: empty
de: leer

source: Could not delete configuration file %1
de: Konfigurationsdatei %1 kann nicht gelöscht werden

source: Recurring Check Name
de: Wiederkehrender Prüfungsname

source: Schedule Link Checks...
de: Verknüpfungsprüfung planen ...

source: Edit Script Actions...
de: Skript-Aktionen bearbeiten ...

source: Reset Script Actions...
de: Skript-Aktionen zurücksetzen

source: Links Checked
de: Verknüpfungen geprüft

source: Good
de: Gut

source: Broken
de: Kaputt

source: Undetermined
de: Unbestimmt

source: Statistics
de: Statistik

source: Statistics Script
de: Statistik-Skript

source: Choose a Document Root
de: Basisordner für Dokumente wählen

source: As you are using a protocol other than HTTP, there is no way to guess where the document root is, in order to resolve relative URLs like the ones started with "/". Please specify one:
de: Da ein anderes Protokoll als HTTP verwendet wird, gibt es keine Möglichkeit die Basisadresse festzustellen, um relative URLs, wie die mit „/“ startenden, aufzulösen. Bitte geben Sie eine an:

source: Login Input
de: Eingabe der Anmeldung

source: Domain
de: Domäne

source: <!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0//EN" "http://www.w3.org/TR/REC-html40/strict.dtd"> <html><head><meta name="qrichtext" content="1" /><style type="text/css"> p, li { white-space: pre-wrap; } </style></head><body style=" font-family:'Sans Serif'; font-size:10pt; font-weight:400; font-style:normal;"> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;">URL to send to the HTTP POST request, e.g. '<span style=" font-family:'Courier New,courier';">POST </span><span style=" font-family:'Courier New,courier'; font-weight:600;">/login/login</span><span style=" font-family:'Courier New,courier';"> HTTP/1.1</span>'. Should be the same as the action attribute in the form element, e.g.: '<a name="line163"></a><span style=" font-family:'Courier New,courier';">&lt;</span><span style=" font-family:'Courier New,courier';">form action="/login/login"&gt;</span></p></body></html>
de: <!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0//EN" "http://www.w3.org/TR/REC-html40/strict.dtd"> <html><head><meta name="qrichtext" content="1" /><style type="text/css"> p, li { white-space: pre-wrap; } </style></head><body style=" font-family:'Sans Serif'; font-size:10pt; font-weight:400; font-style:normal;"> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;">Adresse, an die die POST-Abfrage gesendet werden soll, z. B. „<span style=" font-family:'Courier New,courier';">POST </span><span style=" font-family:'Courier New,courier'; font-weight:600;">/login/login</span><span style=" font-family:'Courier New,courier';"> HTTP/1.1</span>“. Sollte das gleiche sein wie das Attribut „action“ im Element „form“, z. B.: <a name="line163"></a><span style=" font-family:'Courier New,courier';">&lt;</span><span style=" font-family:'Courier New,courier';">form action="/login/login"&gt;</span></p></body></html>

source: POST URL
de: POST-Adresse

source: <!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0//EN" "http://www.w3.org/TR/REC-html40/strict.dtd"> <html><head><meta name="qrichtext" content="1" /><style type="text/css"> p, li { white-space: pre-wrap; } </style></head><body style=" font-family:'Sans Serif'; font-size:10pt; font-weight:400; font-style:normal;"> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;">URL to send to the HTTP POST request, e.g. 'POST <span style=" font-weight:600;">/login/login</span></p></body></html>
de: <!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0//EN" "http://www.w3.org/TR/REC-html40/strict.dtd"> <html><head><meta name="qrichtext" content="1" /><style type="text/css"> p, li { white-space: pre-wrap; } </style></head><body style=" font-family:'Sans Serif'; font-size:10pt; font-weight:400; font-style:normal;"> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;">Adresse, an die die HTTP-POST-Anfrage gesendet werden soll, z. B. POST <span style=" font-weight:600;">/login/login</span></p></body></html>

source: POST Data
de: POST Daten

source: <!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0//EN" "http://www.w3.org/TR/REC-html40/strict.dtd"> <html><head><meta name="qrichtext" content="1" /><style type="text/css"> p, li { white-space: pre-wrap; } </style></head><body style=" font-family:'Sans Serif'; font-size:10pt; font-weight:400; font-style:normal;"> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;">Insert the fields to send to the POST request. Typically, the keys are <span style=" font-weight:600;">user</span>, <span style=" font-weight:600;">password</span> and <span style=" font-weight:600;">button</span> 'name' attributes in the <span style=" font-weight:600;">input</span> elements inside the form definition</p></body></html>
de: <!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0//EN" "http://www.w3.org/TR/REC-html40/strict.dtd"> <html><head><meta name="qrichtext" content="1" /><style type="text/css"> p, li { white-space: pre-wrap; } </style></head><body style=" font-family:'Sans Serif'; font-size:10pt; font-weight:400; font-style:normal;"> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;">Geben Sie die Felder der POST-Anfrage ein. Normalerweise sind die Schlüsselwörter <span style=" font-weight:600;">user</span>, <span style=" font-weight:600;">password</span> und <span style=" font-weight:600;">button</span> „name“ Attribute in dem Element <span style=" font-weight:600;">input</span> in der Definition von „form“</p></body></html>

source: Key
de: Schlüssel

source: Value
de: Wert

source: Add
de: Hinzufügen

source: S&earch:
de: &Suche:

source: All Links
de: Alle Verknüpfungen

source: Good Links
de: Gültige Verknüpfungen

source: Broken Links
de: Kaputte Verknüpfungen

source: Malformed Links
de: Ungültige Verknüpfungen

source: Undetermined Links
de: Unbestimmte Verknüpfungen

source: Clear filter
de: Filter zurücksetzen

source: Enter the terms to filter the result link list
de: Suchbegriffe zur Eingrenzung der Ergebnisse eingeben

source: Choose what kind of link status to show in result list
de: Wahl der Art des Status der Verknüpfungen zur Anzeige in der Ergebnisliste

source: Label
de: Bezeichnung

source: Javascript not supported
de: Javascript wird nicht unterstützt

source: Checking...
de: Beim Prüfen ...

source: Cowardly refusing to check an empty URL.
de: Nicht bereit, eine leere URL zu prüfen.

source: Stopped
de: Angehalten

source: Ready
de: Bereit

source: Finished checking %1
de: Überprüfung von %1 abgeschlossen

source: Paused
de: Angehalten

source: Adding level...
de: Eine Suchebene hinzufügen ...

source: Resuming
de: Fortgesetzt

source: Export Results as HTML
de: Ergebnisse als HTML exportieren

source: Create XML Site Map
de: XML-Sitemap erstellen

source: Use a protocol other than HTTP, e.g. file, ftp, sftp, fish, etc., so the files can be saved.
de: Verwenden Sie ein anderes Protokoll als HTTP, wie beispielsweise file, ftp, sftp, fish usw., damit die Dateien gespeichert werden können.

source: Checking %1
de: %1 wird geprüft

source: Done rechecking %1
de: Erneute Überprüfung von %1 abgeschlossen

source: Search
de: Suche

source: Cookie based authentication, only possible with HTTP based protocol.
de: Cookie-basierte Authentifizierung, nur mit HTTP-basiertem Protokoll möglich.

source: Login
de: Anmeldung

source: Depth:
de: Tiefe:

source: Do &not check parent folders
de: Übergeordnete Ordner &nicht prüfen

source: Chec&k external links
de: Externe Ver&knüpfungen prüfen

source: Do not check regular expression:
de: Reguläre Ausdrücke nicht prüfen:

source: Checked Links:
de: Überprüfte Verknüpfungen:

source: Elapsed time:
de: Verstrichene Zeit:

source: HTTP Identification
de: HTTP-Kennung

source: Send Identification
de: Kennung senden

source: User-Agent
de: Browserkennung

source: Default
de: Standard

source: Identity
de: Identität

source: View
de: Ansicht

source: Tree
de: Baumansicht

source: Flat (faster)
de: Flach (schneller)

source: Misc
de: Verschiedenes

source: Follow Last Link Checked
de: Der zuletzt geprüften Verknüpfung folgen

source: Export Results
de: Ergebnisse exportieren

source: Preferred Style Sheet:
de: Bevorzugte Stilvorlage:

source: Network
de: Netzwerk

source: Number of simultaneous connections:
de: Anzahl gleichzeitiger Verbindungen:

source: Timeout in seconds:
de: Wartezeit in Sekunden:

source: Input
de: Eingabe

source: Check external links
de: Externe Verknüpfungen prüfen

source: Number of items in URL history:
de: Anzahl Einträge im URL-Verlauf:

source: Check parent folders
de: Übergeordnete Ordner prüfen

source: Check this one if you want to use Quanta's project preview prefix in the URL to check
de: Aktivieren Sie diese Einstellung, um Quantas Projektvorschau-Präfix in den zu prüfenden URLs zu verwenden

source: Use preview prefix
de: Vorschau-Präfix verwenden

source: Remember settings when exit
de: Einstellungen beim Beenden merken

source: Open new tab
de: Neues Unterfenster öffnen

source: Close the current tab
de: Aktuelles Unterfenster schließen

source: Session%1
de: Sitzung%1

source: KLinkStatus - Link Checker
de: KLinkStatus – Prüfprogramm für Verknüpfungen

source: Invalid URL.
de: Ungültige URL.

source: ROOT URL.
de: Wurzel-URL.

source: Edit Referrer
de: Referrer bearbeiten

source: All
de: Alle

source: Open URL
de: URL öffnen

source: Open Referrer URL
de: Referrer-URL öffnen

source: Copy URL
de: URL kopieren

source: Copy Referrer URL
de: Referrer-URL kopieren

source: Copy Cell Text
de: Zelleninhalt kopieren

source: Delete checked Documents
de: Überprüfte Dokumente löschen

source: Delete All Documents
de: Alle Dokumente löschen

source: Cannot crawl through directories using HTTP. Try using file, ftp, sftp or fish, for example.
de: Ordner können nicht mit HTTP durchgesehen werden. Versuchen Sie beispielsweise file, sftp oder fish als Protokoll.

source: Crawling folders...
de: Ordner werden durchsucht ...

source: Matching results...
de: Passende Ergebnisse ...

source: Unreferred DocumentsWidget
de: Bedienelement für nicht verknüpfte Dokumente

source: Base Folder:
de: Basisordner:

source: Filter Documents...
de: Dokumente filtern ...
