Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/kdewebdev/kommander.po
Languages: de

source: Delete Toolbar
de: Werkzeugleiste löschen

source: Delete Toolbar '%1'
de: Lösche Werkzeugleiste „%1“

source: Delete Separator
de: Trennzeichen löschen

source: Delete Item
de: Element löschen

source: Insert Separator
de: Trennlinie einfügen

source: Delete Action '%1' From Toolbar '%2'
de: Aktion „%1“ aus Werkzeugleiste „%2“ löschen

source: Add Separator to Toolbar '%1'
de: Trennlinie in Werkzeugleiste „%1“ einfügen

source: Add Action '%1' to Toolbar '%2'
de: Aktion „%1“ zu Werkzeugleiste „%2“ hinzufügen

source: Insert/Move Action
de: Aktion einfügen/verschieben

source: Action '%1' has already been added to this toolbar. An Action may only occur once in a given toolbar.
de: Die Aktion „%1“ wurde bereits der Werkzeugleiste hinzugefügt. Sie können eine Aktion nur einmal in eine Werkzeugleiste einfügen.

source: Add Widget '%1' to Toolbar '%2'
de: Widget „%1“ zu Werkzeugleiste „%2“ hinzufügen

source: Rename Item...
de: Element umbenennen ...

source: Delete Menu '%1'
de: Menü „%1“ löschen

source: Rename Menu Item
de: Menüeintrag umbenennen

source: Menu text:
de: Menütext:

source: Rename Menu '%1' to '%2'
de: Menü „%1“ zu „%2“ umbenennen

source: Move Menu '%1'
de: Menü „%1“ verschieben

source: Delete Action '%1' From Popup Menu '%2'
de: Aktion „%1“ von Aufklappmenü „%2“ löschen

source: Add Separator to Popup Menu '%1'
de: Trennlinie zu Aufklappmenü „%1“ hinzufügen

source: Add Action '%1' to Popup Menu '%2'
de: Aktion „%1“ zu Aufklappmenü „%2“ hinzufügen

source: Action '%1' has already been added to this menu. An Action may only occur once in a given menu.
de: Die Aktion „%1“ wurde diesem Menü schon hinzugefügt. Eine Aktion darf nur einmal in einem bestimmten Menü vorkommen.

source: Edit Actions
de: Aktionen bearbeiten

source: Create new Action
de: Neue Aktionen erstellen

source: Delete current Action
de: Aktuelle Aktion löschen

source: Connect current Action
de: Aktuelle Aktion verbinden

source: Actions
de: Aktionen

source: New &Action
de: Neue &Aktion

source: New Action &Group
de: Neue &Gruppe für Aktionen

source: New &Dropdown Action Group
de: Neue Gruppe für &Dropdown-Aktionen

source: &Connect Action...
de: &Connect-Aktion ...

source: Delete Action
de: Aktion löschen

source: Edit Text
de: Text bearbeiten

source: &Widget:
de: Bedien&element:

source: &Text for:
de: &Text für:

source: Insert
de: Einfügen

source: &Function...
de: &Funktion ...

source: Wi&dget:
de: Be&dienelement:

source: Fi&le...
de: &Datei ...

source: Set the 'text association' of '%1'
de: Setze die „Text Zuordnung“ von „%1“

source: Set the 'population text' of '%1'
de: Setze den „Population Text“ von „%1“

source: <qt>Cannot open file<br><b>%1</b></qt>
de: <qt>Die Datei<br><b>%1</b> kann nicht geöffnet werden</qt>

source: Choose Widget
de: Bedienelement auswählen

source: &Cancel
de: &Abbrechen

source: Find:
de: Suchen:

source: Widgets
de: Oberflächenelemente

source: Set 'name' Property
de: Eigenschaft „Name“ festlegen

source: The name of a widget must be unique. '%1' is already used in form '%2', so the name has been reverted to '%3'.
de: Der Name des Widgets muss eindeutig sein. „%1“ wird bereits im Formular „%2“ verwendet. Der Name wurde auf „%3“ zurückgesetzt.

source: The name of a widget must not be null. The name has been reverted to '%1'.
de: Der Name des Widgets darf nicht leer sein. Der Name wurde auf „%1“ zurückgesetzt.

source: Edit Connections
de: Verbindungen bearbeiten

source: <b>Edit Connections</b><p>Add and remove connections in the current form.</p><p>Select a signal and a corresponding slot then press the <b>Connect</b> button to create a connection.</p><p>Select a connection from the list then press the <b>Disconnect</b> button to delete the connection.</p>
de: <b>Verbindungen bearbeiten </b> <p>Hinzufügen und entfernen von Verbindungen im aktuellen Formular.</p> <p>Wählen Sie ein Signal und einen passenden Slot und drücken Sie den Knopf <b> Verbinden</b>, um eine Verbindung herzustellen.</p> <p>Wählen Sie eine Verbindung aus der Liste und drücken Sie den Knopf <b> Trennen</b>, um eine Verbindung zu lösen.</p>

source: Displays the connections between the sender and the receiver.
de: Zeigt die Verbindungen zwischen dem Sender und dem Empfänger an.

source: Sender
de: Absender

source: Receiver
de: Empfänger

source: <b>A list of slots for the receiver.</b><p>The slots that are displayed are only those which have arguments that correspond with the arguments of the signal that is currently selected in the Signal-list.</b>
de: <b>Eine Liste von Slots für den Empfänger.</b> <p>Es werden nur Slots mit Argumenten angezeigt, die den Argumenten des aktuell aus der Signalliste ausgewählten Signals entsprechen.</b>

source: Connec&tions:
de: &Verbindungen:

source: Co&nnect
de: &Verbinden

source: Create connection
de: Verbindung herstellen

source: Create a connection between a signal and a slot.
de: Erstellen einer Verbindung zwischen einem Signal und einem Slot.

source: &Disconnect
de: &Trennen

source: Remove the selected connection
de: Entfernen der ausgewählten Verbindung

source: Remove the selected connection.
de: Entfernen der ausgewählten Verbindung.

source: Displays the list of signals that the widget emits.
de: Anzeige der Liste der von diesem Bedienfeld ausgesandten Signale.

source: Si&gnals:
de: Si&gnale:

source: Close the dialog and apply all the changes.
de: Den Dialog schließen und alle Änderungen übernehmen.

source: Close the dialog and discard any changes.
de: Den Dialog schließen und alle Änderungen verwerfen.

source: Connect/Disconnect the signals and slots of '%1' and '%2'
de: Verbinden/Trennen der Signale und Slots von „%1“ und von „%2“

source: Remove Connection
de: Verbindung entfernen

source: Remove Connections
de: Verbindungen entfernen

source: Add Connection
de: Verbindung hinzufügen

source: Add Connections
de: Verbindungen hinzufügen

source: Create Template
de: Vorlage erstellen

source: Template &name:
de: &Vorlage:

source: Name of the new template
de: Name der neu erstellten Vorlage

source: Enter the name of the new template
de: Geben Sie hier den Namen der neuen Vorlage ein

source: Class of the new template
de: Klasse der neuen Vorlage

source: Enter the name of the class which should be used as the template's base class
de: Geben Sie den Namen der Klasse ein, die als Basisklasse der Vorlage verwendet werden soll

source: C&reate
de: &Anlegen

source: Creates the new template
de: Erstellt die neue Vorlage

source: Closes the Dialog
de: Schließt den Dialog

source: &Baseclass for template:
de: Basisklasse für die &Vorlage:

source: Failed to save file '%1'. Do you want to use another file name?
de: Datei „%1“ kann nicht gespeichert werden. Möchten Sie einen anderen Dateinamen vergeben?

source: Try Another
de: Eine andere versuchen

source: Do Not Try
de: Nicht versuchen

source: '%1' saved.
de: „%1“ gespeichert.

source: *.kmdr|Kommander Files
de: *.kmdr|Kommander-Dateien

source: Save Form '%1' As
de: Formular „%1“ speichern &unter

source: The file already exists. Do you wish to overwrite it?
de: Die Datei existiert bereits. Möchten Sie die Datei überschreiben?

source: Overwrite
de: Überschreiben

source: Overwrite File?
de: Datei überschreiben?

source: Dialog '%1' was modified.Do you want to save it?
de: Dialog „%1“ wurde geändert. Möchten Sie ihn speichern?

source: Save File?
de: Soll die Datei gespeichert werden?

source: unnamed
de: Unbenannt

source: <b>Form Settings</b><p>Change settings for the form. Settings like <b>Comment</b> and <b>Author</b> are for your own use and are not required.</p>
de: <b>Formular-Einstellungen</b><p>Ändern der Einstellungen des Formulars. Einstellungen wie <b>Kommentar</b> und<b>Autor</b> sind nur Ihre Verwendung gedacht und nicht erforderlich.</p>

source: La&youts
de: &Anordnungen

source: Default mar&gin:
de: Standard&rand:

source: D&efault spacing:
de: &Standardabstand:

source: &Settings
de: &Einstellungen

source: Enter a comment about the form.
de: Geben Sie einen Kommentar über das Formular ein.

source: Co&mment:
de: &Kommentar:

source: &License:
de: &Lizenz:

source: Enter your name
de: Geben Sie ihren Namen ein

source: Enter your name.
de: Geben Sie ihren Namen ein.

source: A&uthor:
de: Au&tor:

source: &Vertical
de: &Vertikal

source: <b>A %1 (custom widget)</b> <p>Click <b>Edit Custom Widgets...</b> in the <b>Tools|Custom</b> menu to add and change custom widgets. You can add properties as well as signals and slots to integrate custom widgets into <i>Qt Designer</i>, and provide a pixmap which will be used to represent the widget on the form.</p>
de: <b>Ein %1 (benutzerdefiniertes Widget)</b> <p>Klicken Sie auf <b>Benutzerdefinierte Widgets bearbeiten ...</b> im Menü <b>Extras|Benutzerdefiniert</b>, um benutzerdefinierte Widgets anzulegen oder zu bearbeiten. Sie können Properties sowie Signale und Slots anlegen, um sie in <i>Qt Designer</i> zu integrieren, sowie eine Pixmap angeben, die zur Darstellung des Widgets im Formular verwendet wird.</p>

source: A %1 (custom widget)
de: Ein %1 (benutzerdefiniertes Widget)

source: <b>A %1</b><p>%2</p>
de: <b>Ein %1</b><p>%2</p>

source: Reparent Widgets
de: Abhängigkeiten der Widgets neu festlegen

source: Insert %1
de: %1 einfügen

source: Connect '%1' with...
de: Verbinde „%1“ mit ...

source: Change Tab Order
de: Tab-Reihenfolge ändern

source: Connect '%1' to '%2'
de: Verbinde „%1“ mit „%2“

source: You tried to insert a widget into the layout Container Widget '%1'. This is not possible. In order to insert the widget, the layout of '%2' must first be broken. Break the layout or cancel the operation?
de: Sie haben versucht, ein Objekt in das Layout-Objekt „%1“ einzufügen. Dies ist nicht möglich. Um das Objekt dennoch einfügen zu können, muss das Layout von „%2“ zerstört werden. Das Layout zerstören oder die Operation abbrechen?

source: Inserting Widget
de: Widget wird eingefügt

source: &Break Layout
de: Anordnung &auflösen

source: Move
de: Verschieben

source: Use Size Hint
de: Größentipp verwenden

source: Delete
de: Löschen

source: Adjust Size
de: Größe anpassen

source: Click widgets to change the tab order...
de: Klicken Sie auf die Widgets, um die Tab-Reihenfolge zu ändern ...

source: Drag a line to create a connection...
de: Ziehen Sie eine Linie, um eine Verbindung herzustellen ...

source: Click on the form to insert a %1...
de: Klicken Sie in das Formular, um ein %1 einzufügen ...

source: Lower
de: Nach unten

source: Accelerator '%2' is used once.
de: Tastenkürzel „%2“ wird einmal verwendet.

source: Check Accelerators
de: Kurzbefehle prüfen

source: &Select
de: Au&swählen

source: No accelerator is used more than once.
de: Es wird kein Kurzbefehl mehrfach verwendet.

source: Raise
de: Nach oben

source: Lay Out Horizontally
de: Waagerecht anordnen

source: Lay Out Vertically
de: Senkrecht anordnen

source: Lay Out Horizontally (in splitter)
de: Waagerecht anordnen (in Splitter)

source: Lay Out Vertically (in splitter)
de: Senkrecht anordnen (in Splitter)

source: Lay Out in a Grid
de: Gitteranordnung

source: Lay Out Children Horizontally
de: Abhängige Rahmen horizontal anordnen

source: Lay Out Children Vertically
de: Abhängige Rahmen vertikal anordnen

source: Lay Out Children in a Grid
de: Abhängige Rahmen an Gitter ausrichten

source: Break Layout
de: Anordnung auflösen

source: Edit connections...
de: Verbindungen bearbeiten ...

source: Function Browser
de: Funktionsauswahl

source: Description:
de: Beschreibung:

source: &Parameters
de: &Parameter

source: Widget:
de: Bedienelement:

source: Insert function
de: Funktion einfügen

source: Clear edited text
de: Bearbeiteten Text löschen

source: Inserted &text:
de: Eingefügter &Text:

source: Text to be inserted
de: Text, der eingefügt werden soll

source: &Group:
de: &Gruppe:

source: &Function:
de: &Funktion:

source: <p>Parameters are not obligatory.
de: <p>Parameter sind nicht zwingend.

source: <p>Only first argument is obligatory.
de: <p>Nur das erste Argument ist erforderlich.

source: <qt><h3>%1</h3><p><b>Description:</b> %2 <p><b>Syntax:</b> <i>%3</i>%4</qt>
de: <qt><h3>%1</h3><p><b>Beschreibung:</b> %2 <p><b>Syntax:</b><i>%3</i>%4</qt>

source: (Constructor)
de: (Konstruktor)

source: (Destructor)
de: (Destruktor)

source: Class
de: Klasse

source: Database
de: Datenbank

source: Add Page to %1
de: Neue Seite zu „%1“ hinzufügen

source: Delete Page %1 of %2
de: Seite %1 von %2 löschen

source: Edit Iconview
de: Symbolansicht bearbeiten

source: <b>Edit Iconview</b><p>Add, edit or delete items in the icon view.</p><p>Click the <b>New Item</b> button to create a new item, then enter text and choose a pixmap.</p><p>Select an item from the view and click the <b>Delete Item</b> button to remove the item from the iconview.</p>
de: <b>Symbolansicht bearbeiten</b><p>Einträge zur Symbolansicht hinzufügen, bearbeiten oder löschen.</p><p>Klicken Sie auf den Knopf <b>Neuer Eintrag</b>, um einen neuen Eintrag anzulegen. Geben Sie dann den Text ein und wählen Sie eine Pixmap.</p><p>Wählen Sie einen Eintrag in der Ansicht aus und klicken Sie auf den Knopf <b>Eintrag löschen</b>, um den Eintrag aus der Symbolansicht zu löschen.</p>

source: All items in the iconview.
de: Alle Einträge in der Symbolansicht werden berücksichtigt.

source: &New Item
de: &Neuer Eintrag

source: Add an item
de: Eintrag hinzufügen

source: Create a new item for the iconview.
de: Erstellt einen neuen Eintrag für die Symbolansicht.

source: &Delete Item
de: Eintrag &löschen

source: Delete item
de: Element löschen

source: Delete the selected item.
de: Löscht den ausgewählten Eintrag.

source: &Item Properties
de: &Eigenschaften für Einträge

source: Change text
de: Text ändern

source: Change the text for the selected item.
de: Ändert den Text für den ausgewählten Eintrag.

source: Delete Pixmap
de: Pixmap löschen

source: Delete the selected item's pixmap.
de: Löscht die Pixmap des ausgewählten Eintrags.

source: Select a Pixmap
de: Wählen Sie eine Pixmap aus

source: Select a pixmap file for the current item.
de: Wählen Sie eine Pixmap für den aktuellen Eintrag.

source: &Help
de: &Hilfe

source: &Apply
de: An&wenden

source: Apply all changes.
de: Alle Änderungen anwenden.

source: New Item
de: Neues Element

source: Edit Items of '%1'
de: Bearbeite Einträge von „%1“

source: Edit Listbox
de: Auswahlfeld bearbeiten

source: <b>Edit Listbox</b><p>Add, edit or delete items in the listbox.</p><p>Click the <b>New Item</b> button to create a new listbox entry, then enter text and choose a pixmap.</p><p>Select an item from the list and click the <b>Delete Item</b> button to remove the item from the list.</p>
de: <b>Auswahlfeld bearbeiten</b> <p>Hinzufügen, Bearbeiten oder Löschen von Einträgen im Auswahlfeld.</p><p>Klicken Sie auf den Knopf <b>Neuer Eintrag</b>, um einen neuen Eintrag für das Auswahlfeld anzulegen. Geben Sie den Text ein und wählen Sie eine Pixmap aus.</p> <p>Wählen Sie einen Eintrag aus und klicken Sie den Knopf <b>Eintrag löschen</b>, um einen Eintrag aus der Liste zu entfernen.</p>

source: The list of items.
de: Die Liste der Einträge.

source: Choose a pixmap file for the selected item.
de: Legt eine Pixmap-Datei für den ausgewählten Eintrag fest.

source: Change the selected item's text.
de: Ändert den Text des ausgewählten Eintrags.

source: <b>Add a new item.</b><p>New items are appended to the list.</p>
de: <b>Hinzufügen eines neuen Eintrags</b> <p>Neue Einträge werden an die Liste angehängt.</p>

source: Delete the selected item
de: Löscht den ausgewählten Eintrag

source: Move up
de: Nach oben verschieben

source: Moves the selected item up.
de: Verschiebt den ausgewählten Eintrag nach oben.

source: Move down
de: Nach unten verschieben

source: Move the selected item down.
de: Verschiebt den ausgewählten Eintrag nach unten.

source: Edit
de: Bearbeiten

source: Column 1
de: Spalte 1

source: &Add
de: &Hinzufügen

source: &Remove
de: &Entfernen

source: Re&name
de: &Umbenennen

source: &Close
de: Schl&ießen

source: Edit Listview
de: Listenansicht bearbeiten

source: <b>Edit Listview</b><p>Use the controls on the <b>Items</b> tab to add, edit or delete items in the listview. Change the column configuration of the listview using the controls on the <b>Columns</b> tab.</p>Click the <b>New Item</b> button to create a new item, then enter text and add a pixmap.</p><p>Select an item from the list and click the <b>Delete Item</b> button to remove the item from the list.</p>
de: <b>Listenansicht bearbeiten</b><p>Verwenden Sie die Elemente auf der Karteikarte <b>Einträge</b>, um der Listenansicht Einträge hinzuzufügen oder Einträge zu bearbeiten oder zu löschen. Ändern Sie die Spaltendarstellung der Listenansicht mit den Elementen auf der Karteikarte <b>Spalten</b>.</p><p>Klicken Sie den Knopf <b>Neuer Eintrag</b>, um einen neuen Eintrag zu erzeugen. Geben Sie dann einen Text ein und fügen Sie eine Pixmap hinzu.</p><p>Wählen Sie einen Eintrag in der Listenansicht und drücken Sie den Knopf <b>Eintrag löschen</b>, um einen Eintrag aus der Liste zu entfernen.</p>

source: &Items
de: &Elemente

source: <b>Deletes the selected item.</b><p>Any sub-items are also deleted.</p>
de: <b>Löscht den ausgewählten Eintrag.</b><p>Alle untergeordneten Einträge werden ebenfalls gelöscht.</p>

source: Item &Properties
de: Eintrag-&Eigenschaften

source: <b>Change the text of the item.</b><p>The text will be changed in the current column of the selected item.</p>
de: <b>Ändern Sie den Text des Eintrags.</b><p>Der Text in der aktuellen Spalte des ausgewählten Eintrags wird geändert.</p>

source: Change column
de: Spalte ändern

source: <b>Select the current column.</b><p>The item's text and pixmap will be changed for the current column</p>
de: <b>Selektiert die aktuelle Spalte.</b><p>Text und Pixmap des Eintrags werden für die ausgewählte Spalte geändert.</p>

source: Colu&mn:
de: &Spalte:

source: <b>Delete the selected item's pixmap.</b><p>The pixmap in the current column of the selected item will be deleted.</p>
de: <b>Löscht die Pixmap des ausgewählten Eintrags.</b><p>Die Pixmap in der aktuellen Spalte des ausgewählten Eintrags wird gelöscht.</p>

source: <b>Select a pixmap file for the item.</b><p>The pixmap will be changed in the current column of the selected item.</p>
de: <b>Wählen Sie eine Pixmap für den Eintrag.</b><p>Die Pixmap in der aktuellen Spalte des ausgewählten Eintrags wird geändert.</p>

source: <b>Adds a new item to the list.</b><p>The item will be inserted at the top of the list and can be moved using the up and down buttons.</p>
de: <b>Fügt einen neuen Eintrag in die Liste ein.</b> <p>Der Eintrag wird am Anfang der Liste eingefügt und kann mit den Knöpfen „Nach oben“ und „Nach unten“ verschoben werden.</p>

source: New &Subitem
de: Neuer &Untertyp

source: Add a subitem
de: Untereintrag hinzufügen

source: <b>Create a new sub-item for the selected item.</b><p>New sub-items are inserted at the top of the list of sub-items, and new levels are created automatically.</p>
de: <b>Erzeugt einen Untereintrag für den ausgewählten Eintrag.</b><p>Neue Untereinträge werden am Anfang der untergeordneten Listeneinträge eingefügt. Neue Ebenen werden automatisch angelegt.</p>

source: <b>Move the selected item up.</b><p>The item will be moved within its level in the hierarchy.</p>
de: <b>Verschiebt den ausgewählten Eintrag nach oben.</b><p>Der Eintrag wird in der Hierarchie innerhalb seiner Ebene verschoben.</p>

source: <b>Move the selected item down.</b><p>The item will be moved within its level in the hierarchy.</p>
de: <b>Verschiebt den ausgewählten Eintrag nach unten.</b><p>Der Eintrag wird in der Hierarchie innerhalb seiner Ebene verschoben.</p>

source: Move left
de: Nach links verschieben

source: <b>Move the selected item one level up.</b><p>This will also change the level of the item's sub-items.</p>
de: <b>Verschiebt den ausgewählten Eintrag um eine Ebene nach oben.</b><p>Hierdurch wird auch die Ebene der untergeordneten Einträge geändert.</p>

source: Move right
de: Nach rechts verschieben

source: <b>Move the selected item one level down.</b><p>This will also change the level of the item's sub-items.</p>
de: <b>Verschiebt den ausgewählten Eintrag um eine Ebene nach unten.</b><p>Hierdurch wird auch die Ebene der untergeordneten Einträge geändert.</p>

source: Co&lumns
de: &Spalten

source: Column Properties
de: Spalten-Eigenschaften

source: Delete the pixmap of the selected column.
de: Löscht die Pixmap der ausgewählten Spalte.

source: <b>Select a pixmap file for the selected column.</b><p>The pixmap will be displayed in the header of the listview.</p>
de: <b>Auswahl einer Pixmap-Datei für die ausgewählte Spalte.</b><p>Die Pixmap wird in der Kopfzeile der Listenansicht angezeigt.</p>

source: Enter column text
de: Spaltentext eingeben

source: <b>Enter the text for the selected column.</b><p>The text will be displayed in the header of the listview.</p>
de: <b>Geben Sie den Text für die ausgewählte Spalte ein.</b> <p>Der Text wird in der Kopfzeile der Listenansicht angezeigt.</p>

source: Clicka&ble
de: &Anklickbar

source: If this option is checked, the selected column will react to mouse clicks on the header.
de: Ist diese Einstellung markiert, reagiert die ausgewählte Spalte auf Mausklicks in der Kopfzeile.

source: Re&sizable
de: &Größenverstellbar

source: The column's width will be resizeable if this option is checked.
de: Die Spaltenbreite wird änderbar, wenn diese Einstellung aktiviert ist.

source: &Delete Column
de: Spalte &löschen

source: Delete column
de: Spalte löschen

source: Deletes the selected Column.
de: Löscht die ausgewählte Spalte.

source: <b>Move the selected item down.</b><p>The top-most column will be the first column in the list.</p>
de: <b>Verschiebt den ausgewählten Eintrag nach unten.</b> <p>Die oberste Spalte wird als erste Spalte in der Liste dargestellt.</p>

source: &New Column
de: &Neue Spalte

source: Add a Column
de: Spalte hinzufügen

source: <b>Create a new column.</b><p>New columns are appended at the end of (right of) the list and may be moved using the up and down buttons.</p>
de: <b>Neue Spalte anlegen.</b><p>Neue Spalten werden am Ende (rechts) der Liste angelegt und können mit den Knöpfen „Nach oben“ und „Nach unten“ verschoben werden.</p>

source: <b>Move the selected item up.</b><p>The top-most column will be the first column in the list.</p>
de: <b>Verschiebt den ausgewählten Eintrag nach oben.</b> <p>Die oberste Spalte wird als erste Spalte in der Liste dargestellt.</p>

source: The list of columns.
de: Die Liste der Spalten.

source: Edit Items and Columns of '%1'
de: Einträge und Spalten von „%1“ bearbeiten

source: New Column
de: Neue Spalte

source: Kommander is a graphical editor of scripted dialogs.
de: Kommander ist ein grafischer Editor für Skriptdialoge.

source: Based on Qt Designer, (C) 2000 Trolltech AS.
de: Auf Grundlage von Qt-Designer, © 2000 Trolltech AS.

source: (C) 2002-2005 Kommander authors
de: © 2002–2005 Kommander-Autoren

source: Original author
de: Ursprünglicher Autor

source: Project manager
de: Projectverwalter

source: Current maintainer
de: Aktueller Betreuer

# NAME OF TRANSLATORS
source: Your names
de: Thomas Reitelbach,Martin Ereth

# EMAIL OF TRANSLATORS
source: Your emails
de: tr@erdfunkstelle.de,martin.ereth@arcor.de

source: Dialog to open
de: der zu öffnende Dialog

source: Welcome to the Kommander Editor
de: Willkommen im Kommander Editor

source: Properties
de: Eigenschaften

source: Property Editor
de: Eigenschafteneditor
