Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/kdewebdev/kommander.po
Languages: de

source: <h2>The Property Editor</h2><p>You can change the appearance and behavior of the selected widget in the property editor.</p><p>You can set properties for components and forms at design time and see the immediately see the effects of the changes. Each property has its own editor which (depending on the property) can be used to enter new values, open a special dialog, or to select values from a predefined list. Click <b>F1</b> to get detailed help for the selected property.</p><p>You can resize the columns of the editor by dragging the separators in the list's header.</p><p><b>Signal Handlers</b></p><p>In the Signal Handlers tab you can define connections between the signals emitted by widgets and the slots in the form. (These connections can also be made using the connection tool.)
de: <b>Der Eigenschafteneditor</b> <p>Sie können das Aussehen und Verhalten des ausgewählten Bedienelementes (Widgets) im Eigenschafteneditor ändern.</p> <p>Sie können die Eigenschaften der Komponenten und Formulare zum Erstellungszeitpunkt setzen und sehen sofort die Auswirkungen der Änderungen. Für jede Eigenschaft gibt es einen eigenen Editor, der (abhängig von der Eigenschaft), zur Eingabe neuer Werte, zum Öffnen spezieller Dialoge oder zur Auswahl von Werten aus vordefinierten Listen verwendet werden kann. Durch Drücken von <b>F1</> gelangen Sie zu eingehender Hilfe für die ausgewählte Eigenschaft.</p> <p>Sie können die Breite der Spalten des Editors durch Ziehen der Trennlinien im Kopfbereich der Liste ändern.</p> <p><b>Signal-Handler</b></p><p>Im Unterfenster Signalbehandlung können Verbindungen zwischen den ausgesendeten Signalen der Bedienelemente (Widgets) und den Slots im Formular (Fenster) festgelegt werden. (Diese Verbindungen können auch mit dem Verbindungswerkzeug erstellt werden.)</p>

source: Object Explorer
de: Objekt-Explorer

source: <h2>The Object Explorer</h2><p>The Object Explorer provides an overview of the relationships between the widgets in a form. You can use the clipboard functions using a context menu for each item in the view. It is also useful for selecting widgets in forms that have complex layouts.</p><p>The columns can be resized by dragging the separator in the list's header.</p><p>The second tab shows all the form's slots, class variables, includes, etc.</p>
de: <b>Der Objekt-Explorer</b> <p> Der Objekt-Explorer stellt eine Übersicht der Beziehungen zwischen den Bedienelementen (Widgets) in einem Formular (Fenster) bereit. Sie können die Funktionalität der Zwischenablage mittels des Kontextmenüs für jedes Element in der Ansicht verwenden. Dieses ist auch für die Auswahl von Bedienelementen in Formularen mit komplexem Layout nützlich.</p> <p>Die Spaltenbreite kann durch Ziehen de Trennlinie im Listenkopf verändert werden</p> <p>Der zweite Reiter zeigt alle Slots (Ereignisempfänger) des Formulars, alle Variablen der Klasse, Includes usw.</p>

source: Dialogs
de: Dialoge

source: Start typing the buffer you want to switch to here (ALT+B)
de: Beginnen Sie mit der Eingabe des Puffers, zu dem Sie wechseln möchten. (ALT+B)

source: <h2>The File Overview Window</h2><p>The File Overview Window displays all open dialogs.</p>
de: <h2>Das Fenster Datei-Überblick</h2> <p>Das Datei-Überblick Fenster zeigt alle offenen Dialoge.</p>

source: Action Editor
de: Aktionseditor

source: <b>The Action Editor</b><p>The Action Editor is used to add actions and action groups to a form, and to connect actions to slots. Actions and action groups can be dragged into menus and into toolbars, and may feature keyboard shortcuts and tooltips. If actions have pixmaps these are displayed on toolbar buttons and beside their names in menus.</p>
de: <b>Der Aktionseditor</b> <p>Der Aktionseditor wird zum Hinzufügen von Aktionen und Aktionsgruppen zu einem Formular (Fenster) benutzt, sowie zum Verbinden von Aktionen mit Slots. Aktionen und Aktionsgruppen können in Menüs und in Werkzeugleisten gezogen werden und können über Tastenkürzel und Kurzinfos verfügen. Wenn für eine Aktion ein Bild definiert ist, wird diese auf Werkzeugleistenknöpfen und neben dem Namen im Menü angezeigt.</p>

source: Message Log
de: Nachrichtenprotokoll

source: There is a dialog already running.
de: Es wird schon ein Dialog ausgeführt.

source: Run
de: Ausführen

source: <b>The Form Window</b><p>Use the various tools to add widgets or to change the layout and behavior of the components in the form. Select one or multiple widgets to move them or lay them out. If a single widget is chosen it can be resized using the resize handles.</p><p>Changes in the <b>Property Editor</b> are visible at design time, and you can preview the form in different styles.</p><p>You can change the grid resolution, or turn the grid off in the <b>Preferences</b> dialog from the <b>Edit</b> menu.<p>You can have several forms open, and all open forms are listed in the <b>Form List</b>.
de: <b>Das Formular-Fenster</b> <p>Verwenden Sie eines der zahlreichen Werkzeuge zum Hinzufügen oder Ändern von Bedienelementen oder Ändern des Layouts und Verhalten der Komponenten, die im Formular genutzt werden. Wählen Sie eines oder mehrere Bedienelemente aus, um diese zu verschieben oder auszurichten. Für ein einzelnes ausgewähltes Bedienelement kann mittels Anfassern die Größe verändert werden.</p><p>Änderungen im <b>Eigenschaften-Editor</b> sind sofort sichtbar und das Formular kann in verschiedenen Stilen in Vorschau betrachtet werden.</p><p>Die Rasterauflösung können Sie verändern oder im Dialog <b>Einstellungen</b> des Menüs <b>Bearbeiten</p> gänzlich abschalten.</p><p>Es können mehrere Formulare gleichzeitig geöffnet sein; alle offenen Formulare werden in der <b>Formularliste</b> angezeigt.

source: &Undo: %1
de: &Rückgängig: %1

source: &Undo: Not Available
de: &Rückgängig: nicht verfügbar

source: &Redo: %1
de: &Wiederherstellen: %1

source: &Redo: Not Available
de: &Wiederherstellen: nicht verfügbar

source: Choose Pixmap...
de: Pixmap auswählen ...

source: Edit Text...
de: Text bearbeiten ...

source: Edit Title...
de: Titel bearbeiten ...

source: Edit Page Title...
de: Seitentitel bearbeiten ...

source: Edit Kommander Text...
de: Kommander Text bearbeiten ...

source: Delete Page
de: Seite löschen

source: Add Page
de: Seite hinzufügen

source: Edit...
de: Bearbeiten ...

source: Edit Pages...
de: Seiten bearbeiten ...

source: Add Menu Item
de: Menüeintrag hinzufügen

source: Add Toolbar
de: Werkzeugleiste hinzufügen

source: New text:
de: Neuer Text:

source: Set the 'text' of '%1'
de: „text“ für „%1“ festlegen

source: Title
de: Titel

source: New title:
de: Neuer Titel:

source: Set the 'title' of '%1'
de: Lege den „Titel“ von „%1“ fest

source: Page Title
de: Seitentitel

source: New page title:
de: Neuer Seitentitel:

source: Set the 'pageTitle' of '%1'
de: Lege den „Seitentitel“ von „%1“ fest

source: Set the 'pixmap' of '%1'
de: Lege das „Bild“ von „%1“ fest

source: Rename page %1 of %2
de: Seite %1 von %2 umbenennen

source: Add Toolbar to '%1'
de: Neue Werkzeugleiste zu „%1“ hinzufügen

source: Add Menu to '%1'
de: Neues Menü „%1“ hinzufügen

source: Edit %1...
de: %1 bearbeiten ...

source: Kommander found some temporary saved files, which were written when Kommander crashed last time. Do you want to load these files?
de: Kommander hat einige zwischengespeicherte Dateien gefunden, die vor dem letzten Absturz von Kommander angelegt wurden. Sollen diese Dateien geladen werden?

source: Restoring Last Session
de: Letzte Sitzung wird wiederhergestellt

source: Load
de: Laden

source: Do Not Load
de: Nicht laden

source: There is no help available for this dialog at the moment.
de: Derzeit ist keine Hilfe zu diesem Dialog verfügbar.

source: Help
de: Hilfe

source: <qt>Could not open file:<br><b>%1</b><br>File does not exist.</qt>
de: <qt>Kann die Datei nicht öffnen:<br>%1<b></b><br>Diese Datei existiert nicht.</qt>

source: Open File
de: Datei öffnen

source: <p>Toolbars contain a number of buttons to provide quick access to often used functions.<br>Click on the toolbar handle to hide the toolbar, or drag and place the toolbar to a different location.</p>
de: <p>Werkzeugleisten beinhalten eine Reihe von Knöpfen, um oft verwendete Funktionen schneller erreichen zu können.<br>Klickt man auf die Werkzeugleiste, wird sie ausgeblendet, man kann sie aber auch verschieben.</p>

source: <p>Toolbars contain a number of buttons to provide quick access to often used functions. Click on a button to insert a single widget, or double click to insert multiple %1.<br>Click on the toolbar handle to hide the toolbar, or drag and place the toolbar to a different location.</p>
de: <p>Werkzeugleisten beinhalten eine Reihe von Knöpfen, um oft verwendete Funktionen schneller erreichen zu können. Klicken Sie auf einen Knopf, um ein einzelnes Objekt einzufügen oder klicken Sie doppelt, um mehrere %1 einzufügen.<br>Klickt man auf die Werkzeugleiste, wird sie ausgeblendet, man kann sie aber auch verschieben.</p>

source: Undoes the last action
de: Der letzte Bearbeitungsschritt wird rückgängig gemacht

source: Redoes the last undone operation
de: Nimmt die letzte Rückgängig-Aktion zurück

source: Cuts the selected widgets and puts them on the clipboard
de: Schneidet das ausgewählte Widget aus und legt es in die Zwischenablage

source: Copies the selected widgets to the clipboard
de: Kopiert das ausgewählte Widget in die Zwischenablage

source: Pastes the clipboard's contents
de: Fügt den Inhalt der Zwischenablage ein

source: Deletes the selected widgets
de: Löscht die ausgewählten Widgets

source: Selects all widgets
de: Wählt alle Widgets aus

source: Bring to Front
de: Ganz nach vorne

source: Raises the selected widgets
de: Bringt die ausgewählten Miniprogramme nach vorn

source: Send to Back
de: Ganz nach hinten

source: Lowers the selected widgets
de: Stellt die ausgewählten Widgets nach hinten

source: Checks if the accelerators used in the form are unique
de: Überprüft die im Formular verwendeten Kurzbefehle auf Eindeutigkeit

source: Opens a dialog for editing connections
de: Öffnet einen Dialog zur Bearbeitung von Connections

source: Form Settings...
de: Formular-Einstellungen ...

source: Opens a dialog to change the form's settings
de: Öffnet einen Dialog zum Ändern der Formulareinstellungen

source: <b>The Edit toolbar</b>
de: <b>Die Bearbeiten-Werkzeugleiste</b>

source: &Edit
de: &Bearbeiten

source: Adjusts the size of the selected widget
de: Passt die Größe des ausgewählten Widgets an

source: Lays out the selected widgets horizontally
de: Ordnet die ausgewählten Widgets horizontal an

source: Lays out the selected widgets vertically
de: Ordnet die ausgewählten Widgets vertikal an

source: Lays out the selected widgets in a grid
de: Ordnet die ausgewählten Widgets in einem Gitter an

source: Lay Out Horizontally in Splitter
de: Ordne horizontal an in Splitter

source: Lays out the selected widgets horizontally in a splitter
de: Ordnet die ausgewählten Widgets in einem Splitter horizontal an

source: Lay Out Vertically in Splitter
de: Vertikal anordnen in Splitter

source: Lays out the selected widgets vertically in a splitter
de: Ordnet die ausgewählten Widgets in einem Splitter vertikal an

source: Breaks the selected layout
de: Löst die ausgewählte Anordnung auf

source: Add
de: Hinzufügen

source: Insert a %1
de: Ein %1 hinzufügen

source: <b>A %1</b><p>%2</p><p>Click to insert a single %3,or double click to keep the tool selected.
de: <b>Ein %1</b><p>%2</p><p>Klicken Sie, um ein einzelnes %3 hinzuzufügen, oder führen Sie einen Doppelklick aus, um das Selektionswerkzeug beizubehalten.

source: <b>The Layout toolbar</b>
de: <b>Die Layout-Werkzeugleiste</b>

source: Pointer
de: Mauszeiger

source: Selects the pointer tool
de: Wählt das Werkzeug für Mauszeiger aus

source: Connect Signal/Slots
de: Signal/Slots verbinden

source: Selects the connection tool
de: Wählt das Werkzeug für Connections aus

source: Tab Order
de: Tab-Reihenfolge

source: Selects the tab order tool
de: Wählt das Werkzeug für die Festlegung der Tab-Reihenfolge aus

source: <b>The Tools toolbar</b>
de: <b>Die Extras-Werkzeugleiste</b>

source: Tools
de: Extras

source: &Tools
de: E&xtras

source: <b>The %1</b>
de: <b>Die %1</b>

source: <b>The %1 Widgets</b>
de: <b>Die %1-Elemente</b>

source: <b>A %1</b>
de: <b>Ein %1</b>

source: <p>Double click on this tool to keep it selected.</p>
de: <p>Führen Sie einen Doppelklick auf das Werkzeug aus, damit es ausgewählt bleibt.</p>

source: <b>The File toolbar</b>
de: <b>Die Datei-Werkzeugleiste</b>

source: File
de: Datei

source: &File
de: &Datei

source: Creates a new dialog
de: Erstellt einen neuen Dialog

source: Opens an existing dialog
de: Öffnet einen bestehenden Dialog

source: Opens recently open file
de: Öffnet zuletzt geöffnete Datei

source: Closes the current dialog
de: Schließt den aktuellen Dialog

source: Saves the current dialog
de: Speichert den aktuellen Dialog

source: Saves the current dialog with a new filename
de: Speichert den aktuellen Dialog in einer neuen Datei

source: Save All
de: Alles speichern

source: Saves all open dialogs
de: Alle geöffneten Dialoge speichern

source: Quits the application and prompts to save any changed dialogs
de: Beendet die Anwendung und fragt für jeden geänderten Dialog, ob gespeichert werden soll

source: &Run
de: &Ausführen

source: Run Dialog
de: Dialog ausführen

source: Executes dialog
de: Führt den Dialog aus

source: Tile
de: Kacheln

source: Tiles the windows so that they are all visible
de: Ordnet die Fenster als Kacheln an, sodass alle sichtbar sind

source: Cascade
de: Gestaffelt

source: Cascades the windows so that all their title bars are visible
de: Staffelt die Fenster, sodass alle Titelleisten sichtbar sind

source: Closes the active window
de: Schließt das aktuelle Fenster

source: Close All
de: Alle schließen

source: Closes all form windows
de: Schließt alle Formularfenster

source: Next
de: Nächster

source: Activates the next window
de: Aktiviert das nächste Fenster

source: Previous
de: Vorheriger

source: Activates the previous window
de: Aktiviert das vorherige Fenster

source: &Window
de: &Fenster

source: Vie&ws
de: &Ansichten

source: Tool&bars
de: &Werkzeugleisten

source: Opens a dialog to change shortcuts
de: Öffnet einen Dialog zum Ändern der Tastaturkürzel

source: Opens a dialog to change preferences
de: Öffnet einen Dialog zum Ändern der Einstellungen

source: Configure &plugins...
de: M&odule einrichten ...

source: Opens a dialog to configure plugins
de: Öffnet einen Dialog zum Einrichten der Module

source: Create a new dialog...
de: Erstellen eines neuen Dialoges ...

source: Open a file...
de: Datei öffnen ...

source: Open Files
de: Dateien öffnen

source: Reading file '%1'...
de: Datei „%1“ wird eingelesen ...

source: Loaded file '%1'
de: Datei „%1“ geladen

source: Could not load file '%1'
de: Die Datei „%1“ kann nicht geladen werden

source: Load File
de: Datei laden

source: Enter a filename...
de: Dateiname eingeben ...

source: Qt Designer is crashing. Attempting to save files...
de: Qt-Designer stürzt ab. Versuche die Daten zu speichern ...

source: NewTemplate
de: Neue Vorlage

source: Could not create the template
de: Die Vorlage kann nicht erstellt werden

source: Cannot paste widgets. Designer could not find a container to paste into which does not contain a layout. Break the layout of the container you want to paste into and select this container and then paste again.
de: Es können keine Widgets eingefügt werden. Designer kann keinen Container zum Einfügen finden, der noch kein Layout enthält. Lösen Sie das Layout des Containers auf, in den Sie einfügen möchten, und versuchen Sie es erneut.

source: Paste Error
de: Einfügefehler

source: Edit the current form's settings...
de: Bearbeiten der Einstellungen des aktuellen Formulars ...

source: Edit preferences...
de: Einstellungen bearbeiten ...

source: Copy Current &Line
de: Aktuelle Zei&le kopieren

source: &Copy Content
de: Inhalt &kopieren

source: &Save As...
de: Speichern &unter ...

source: Clear
de: Löschen

source: *.log|Log Files (*.log) *|All Files
de: *.log|Protokolldateien (*.log) *|Alle Dateien

source: Save Log File
de: Protokolldatei speichern

source: <qt>File<br><b>%1</b><br>already exists. Overwrite it?</qt>
de: <qt>Die Datei<br><b>%1</b><br>existiert bereits. Möchten Sie sie überschreiben?</qt>

source: <qt>Cannot save log file<br><b>%1</b></qt>
de: <qt>Die Protokolldatei<br><b>%1</b>kann nicht gespeichert werden</qt>

source: Stdout
de: Ausgabe

source: Stderr
de: Fehler

source: Edit Multiline Edit
de: Mehrzeiliges Eingabefeld bearbeiten

source: <b>Edit Multiline Edit</b><p>Enter the text and click the <b>OK</b> button to apply the changes.</p>
de: <b>Mehrzeiliges Eingabefeld bearbeiten</b> <p>Den Text eingeben und den Knopf <b> OK</b> drücken, um die Änderungen durchzuführen.</p>

source: Enter your text here.
de: Den Text hier eingeben.

source: Set Text of '%1'
de: Text von „%1“ festlegen

source: New File
de: Neue Datei

source: <b>New Form</b><p>Select a template for the new form and click the <b>OK</b>-button to create it.</p>
de: <b>Neues Formular</b><p>Wählen Sie eine Vorlage für das neue Formular und klicken Sie den Button <b>OK</b>, um es anzulegen.</p>

source: Create a new form using the selected template.
de: Ein neues Formular unter Verwendung der ausgewählten Vorlage anlegen.

source: Close the dialog without creating a new form.
de: Schließt den Dialog ohne ein neues Formular anzulegen.

source: Displays a list of the available templates.
de: Zeigt eine Liste der verfügbaren Vorlagen an.

source: Load Template
de: Vorlage laden

source: Could not load form description from template '%1'
de: Die Formularbeschreibung der Vorlage „%1“ kann nicht geladen werden

source: Wizard
de: Assistent

source: Edit Palette
de: Palette bearbeiten

source: Build Palette
de: Palette erstellen

source: &3D effects:
de: &3D-Effekte:

source: Choose a color
de: Wählen Sie eine Farbe

source: Choose the effect-color for the generated palette.
de: Wählen Sie die Effektfarbe für die generierte Palette.

source: Back&ground:
de: &Hintergrund:

source: Choose the background color for the generated palette.
de: Wählen Sie die Hintergrundfarbe für die generierte Palette.

source: &Tune Palette...
de: Palette &abstimmen ...

source: Preview
de: Vorschau

source: Select &palette:
de: &Palette auswählen:

source: Active Palette
de: Aktive Palette

source: Inactive Palette
de: Inaktive Palette

source: Disabled Palette
de: Ausgeschaltete Palette

source: Tune Palette
de: Palette abstimmen

source: <b>Edit Palette</b><p>Change the current widget or form's palette.</p><p>Use a generated palette or select colors for each color group and each color role.</p><p>The palette can be tested with different widget layouts in the preview section.</p>
de: <b>Palette Bearbeiten</b><p>Ändern der Palette des aktuellen Elements oder Formulars.</p><p>Verwenden Sie eine generierte Palette oder wählen Sie für jede Farbgruppe und Farbrolle die Farben aus.</p><p>Die Palette kann in der Vorschau mit verschiedenen Element-Anordnungen getestet werden.</p>

source: Auto
de: Automatisch

source: Build the inactive palette from the active palette.
de: Erstellen der inaktiven Palette aus der aktiven Palette.

source: Build the disabled palette from the active palette.
de: Erstellen der ausgeschalteten Palette aus der aktiven Palette.

source: Central Color &Roles
de: Zentrale Fa&rb-Rollen

source: Choose the central color role
de: Wählen Sie die zentrale Farbrolle

source: <b>Select a color role.</b><p>Available central color roles are: <ul> <li>Background - general background color.</li> <li>Foreground - general foreground color. </li> <li>Base - used as the background color for example, for text entry widgets; it is usually white or another light color. </li> <li>Text - the foreground color used with Base. Usually this is the same as the Foreground, in which case it must provide good contrast both with the Background and with the Base. </li> <li>Button - general button background color; useful where buttons need a background different from Background, as in the Macintosh style. </li> <li>ButtonText - a foreground color used with the Button color. </li> <li>Highlight - a color used to indicate a selected or highlighted item. </li> <li>HighlightedText - a text color that contrasts to Highlight. </li> <li>BrightText - a text color that is very different from Foreground and contrasts well with, for example, black. </li> </ul> </p>
de: <b>Farbrolle auswählen</b> <p>Verfügbare zentrale Farbrollen sind: <ul> <li>Hintergrund – allgemeine Hintergrundfarbe </li> <li>Vordergrund – allgemeine Vordergrundfarbe </li> <li>Grundfarbe – wird als Hintergrundfarbe für z. B. Textfelder verwendet; normalerweise Weiß oder eine andere helle Farbe. </li> <li>Text – die mit Grundfarbe verwendete Vordergrundfarbe. Normalerweise dieselbe Farbe wie Vordergrund, wobei sie einen guten Kontrast sowohl mit Hintergrund als auch mit der Grundfarbe aufweisen muss. </li> <li>Knopf – die Hintergrundfarbe für Knöpfe, nützlich dann, wenn ein Button eine andere Hintergrundfarbe benötigt als Hintergrund. Dies ist z. B. im Macintosh-Stil der Fall. </li> <li>Hervorgehoben – eine Farbe die zur Darstellung ausgewählter oder hervorgehobener Elemente benutzt wird.</li> <li>Hervorgehobener Text – eine Textfarbe, die zu Hervorgehoben einen passend Kontrast bildet.</li> <li>Leuchtender Text – eine Textfarbe, die sich stark von Vordergrund abhebt und einen sehr guten Kontrast zu beispielsweise Schwarz bildet. </li></ul></p>

source: Background
de: Hintergrund

source: Foreground
de: Vordergrund

source: Button
de: Knopf

source: Base
de: Basis

source: ButtonText
de: Knopfbeschriftung

source: Highlight
de: Hervorhebung

source: HighlightText
de: Text-Hervorhebung

source: Link
de: Verknüpfung

source: LinkVisited
de: Besuchte Verknüpfung

source: Choose pi&xmap:
de: Pi&xmap auswählen:

source: Select a pixmap
de: Wählen Sie eine Pixmap aus

source: Choose a pixmap file for the selected central color role.
de: Wählen Sie eine Pixmap-Datei für die ausgewählte zentrale Farbrolle.

source: &Select color:
de: Farb&auswahl:

source: Choose a color for the selected central color role.
de: Wählen Sie eine Farbe für die ausgewählte zentrale Farbrolle.

source: 3D Shadow &Effects
de: 3D-Schatt&eneffekte

source: Build &from button color:
de: Von &Knopffarbe ableiten:

source: Generate shadings
de: Schattierungen erstellen

source: Check to let 3D-effect colors be calculated from the button-color.
de: Markieren Sie diese Einstellung, um die Farben für 3-D-Effekte aus der Knopffarbe berechnen zu lassen.

source: Choose 3D-effect color role
de: Wählen Sie die Farbrolle für 3-D-Effekte

source: <b>Select a color effect role.</b><p>Available effect roles are: <ul> <li>Light - lighter than Button color. </li> <li>Midlight - between Button and Light. </li> <li>Mid - between Button and Dark. </li> <li>Dark - darker than Button. </li> <li>Shadow - a very dark color. </li> </ul>
de: <b>Eine Farbeffekt-Rolle auswählen</b> <p>Verfügbare Effekt-Rollen sind: <ul> <li>Hell – heller als die Farbe für Knöpfe. </li> <li>Mittelhell – zwischen Knopf und Hell. </li> <li>Mittel – zwischen Knopf und Dunkel. </li> <li>Dunkel – dunkler als Knopf.</li> <li>Schatten – eine sehr dunkle Farbe. </li></ul>

source: Light
de: Hell

source: Dark
de: Dunkel

source: Shadow
de: Schatten

source: Select co&lor:
de: &Farbauswahl:

source: Choose a color for the selected effect color role.
de: Wählen Sie eine Farbe für die ausgewählte Effekt-Farbrolle.

source: All Pixmaps
de: Alle Bilder

source: %1-Pixmaps (%2)
de: %1-Bilder (%2)

source: All Files (*)
de: Alle Dateien (*)

source: Choose Pixmap
de: Pixmap auswählen
