Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/kdewebdev/kommander.po
Languages: de

source: &Enter arguments for loading the pixmap:
de: &Argumente für das Laden der Pixmap:

source: Preferences
de: Einstellungen

source: <b>Preferences</b><p>Change the preferences of Qt Designer. There is always one tab with general preferences. There may be additional tabs, depending on which plugins are installed.</p>
de: <b>Einstellungen</b><p>Ändern Sie die Einstellungen von Qt Designer. Die Karteikarte mit den allgemeinen Einstellungen wird immer angezeigt, die Anzeige weiterer Karteikarten hängt von den installierten Komponenten ab.</p>

source: General
de: Allgemein

source: Backgro&und
de: H&intergrund

source: Select a color in the color dialog.
de: Wählen Sie eine Farbe im Farbauswahldialog.

source: Co&lor
de: &Farbe

source: Use a background color
de: Verwenden Sie eine Hintergrundfarbe

source: Use a background color.
de: Verwende eine Hintergrundfarbe.

source: Use a background pixmap
de: Hintergrund Pixmap verwenden

source: Use a background pixmap.
de: Verwende eine Hintergrund-Pixmap.

source: Choose a pixmap file.
de: Pixmap-Datei auswählen.

source: Show &grid
de: Raster anzei&gen

source: Show Grid
de: Gitter anzeigen

source: <b>Customize the grid appearance for all forms.</b><p>When <b>Show Grid</b> is checked, all forms show a grid.</p>
de: <b> Einrichten der Rasteranzeige für alle Formulare</b> <p>Wenn<b>Raster Anzeigen</b> aktiviert ist, wird in allen Formularen ein Raster angezeigt.</p>

source: Gr&id
de: &Raster

source: Sn&ap to grid
de: An Gitter &ausrichten

source: Snap to the grid
de: Am Gitter ausrichten

source: <b>Customize the grid-settings for all forms.</b><p>When <b>Snap to Grid</b> is checked, the widgets snap to the grid using the X/Y resolution.</p>
de: <b>Festlegen der Gittereinstellungen für alle Formulare.</b><p>Ist <b>An Gitter ausrichten</b> aktiv, werden die Bedienelemente entsprechend der X/Y-Auflösung am Gitter ausgerichtet.</p>

source: Grid resolution
de: Gitterauflösung

source: <b>Customize the grid-settings for all forms.</b><p>When <b>Show Grid</b> is checked, a grid is shown on all forms using the X/Y resolution.</p>
de: <b>Festlegen der Gittereinstellungen für alle Formulare.</b> <p>Ist die Einstellung <b>Gitter anzeigen</b> aktiv, wird bei allen Formularen ein Gitter mit der eingestellten X/Y-Auflösung angezeigt.</p>

source: Grid-&X:
de: Gitterauflösung &X-Achse:

source: Grid-&Y:
de: Gitterauflösung &Y-Achse:

source: Ge&neral
de: &Allgemein

source: Restore last &workspace on startup
de: Beim Programmstart zu&letzt bearbeitetes Projekt öffnen

source: Restore last workspace
de: Zuletzt verwendete Arbeitssitzung wiederherstellen

source: The current workspace settings will be restored the next time you start Qt Designer if this option is checked.
de: Ist die Einstellung aktiv, werden die Einstellungen der aktuellen Arbeitssitzung werden beim nächsten Start von Qt Designer wiederhergestellt.

source: Show &splash screen on startup
de: &Startbildschirm anzeigen

source: Show Splashscreen
de: Startbildschirm anzeigen

source: A splash screen is displayed when starting Qt Designer if this option is checked.
de: Ist diese Einstellung aktiv, wird ein Startbildschirm beim Aufruf von Qt Designer angezeigt.

source: Disable data&base auto-edit in preview
de: &Autobearbeiten der Datenbank in der Vorschau ausschalten

source: &Documentation path:
de: &Pfad zur Dokumentation:

source: <b>Enter the path to the documentation.</b><p>You may provide an $environment variable as the first part of the pathname.</p>
de: <b>Pfad zur Dokumentation eingeben</b> <p>Sie können eine Umgebungsvariable als ersten Teil des Pfades eingeben.</p>

source: Select path
de: Pfad auswählen

source: Look for the documentation path.
de: Suchen Sie nach dem Dokumentationspfad.

source: &Toolbars
de: &Werkzeugleisten

source: Show &big icons
de: Große Sym&bole anzeigen

source: Big Icons
de: Große Symbole

source: Big icons will be used in the toolbars if this is checked.
de: Ist diese Einstellung markiert, werden in den Werkzeugleisten große Symbole verwendet.

source: Show text lab&els
de: Texteinträge anz&eigen

source: Text Labels
de: Textbeschreibung

source: Text labels will be used in the toolbars if this is checked.
de: Ist diese Einstellung markiert, werden in den Werkzeugleisten Texteinträge angezeigt.

source: Preview Window
de: Vorschaufenster

source: ComboBox
de: Kombinationsfeld

source: Reset the property to its default value
de: Setzt den Wert der Eigenschaft auf die Voreinstellung zurück.

source: Click this button to reset the property to its default value
de: Klicken Sie hier, um die Eigenschaft auf den voreingestellten Wert zurückzusetzen.

source: False
de: Falsch

source: True
de: Wahr

source: width
de: Breite

source: height
de: Höhe

source: Red
de: Rot

source: Green
de: Grün

source: Blue
de: Blau

source: Family
de: Familie

source: Point Size
de: Schriftgröße

source: Bold
de: Fett

source: Italic
de: Kursiv

source: Underline
de: Unterstrichen

source: Strikeout
de: Durchgestrichen

source: Connection
de: Verbindung

source: Table
de: Tabelle

source: Field
de: Feld

source: horizontalStretch
de: Horizontale Streckung

source: verticalStretch
de: Vertikale Streckung

source: Arrow
de: Pfeil

source: Up-Arrow
de: Pfeil hoch

source: Cross
de: Kreuz

source: Waiting
de: Wartend

source: Size Vertical
de: Senkrecht vergrößern

source: Size Horizontal
de: Waagerecht vergrößern

source: Size Slash
de: Diagonal vergrößern

source: Size Backslash
de: Diagonal verkleinern

source: Size All
de: Größenänderung in alle Richtungen

source: Blank
de: Leer

source: Split Vertical
de: Senkrecht teilen

source: Split Horizontal
de: Waagerecht teilen

source: Pointing Hand
de: Deutende Hand

source: Forbidden
de: Unzulässig

source: Property
de: Eigenschaft

source: Value
de: Wert

source: Set '%1' of '%2'
de: Setze „%1“ von „%2“

source: Sort &Categorized
de: Nach &Kategorien sortieren

source: Sort &Alphabetically
de: &Alphabetisch sortieren

source: Reset '%1' of '%2'
de: „%1“ von „%2“ zurücksetzen

source: <p><b>QWidget::%1</b></p><p>There is no documentation available for this property.</p>
de: <p><b>QWidget::%1</b></p><p>Für diese Eigenschaft ist keine Dokumentation verfügbar.</p>

source: New Signal Handler
de: Neuer Signal-Handler

source: Delete Signal Handler
de: Signal-Handler löschen

source: P&roperties
de: &Eigenschaften

source: S&ignal Handlers
de: S&ignalbehandlung

source: Property Editor (%1)
de: Eigenschafteneditor (%1)

source: Paste
de: Einfügen

source: Resize
de: Größe ändern

source: Edit Table
de: Tabelle bearbeiten

source: <b>Move the selected item up.</b><p>The top-most column will be the first column of the list.</p>
de: <b>Verschiebt den ausgewählten Eintrag nach oben.</b> <p>Die oberste Spalte wird als erste Spalte in der Liste dargestellt.</p>

source: <b>Move the selected item down.</b><p>The top-most column will be the first column of the list.</p>
de: <b>Verschiebt den ausgewählten Eintrag nach unten.</b> <p>Die oberste Spalte wird als erste Spalte in der Liste dargestellt.</p>

source: Table:
de: Tabelle:

source: &Field:
de: &Feld:

source: &Rows
de: &Zeilen

source: &New Row
de: &Neue Zeile

source: &Delete Row
de: Zeile &löschen

source: Edit Rows and Columns of '%1'
de: Bearbeite Zeilen und Spalten von „%1“

source: Tab
de: Tabulator

source: Push Button
de: Knopf

source: Tool Button
de: Werkzeug-Knopf

source: Radio Button
de: Auswahlknopf

source: Check Box
de: Ankreuzfeld

source: Group Box
de: Gruppierfeld

source: Button Group
de: Gruppe von Knöpfen

source: Frame
de: Rahmen

source: Tabwidget
de: Unterfenster-Element

source: List Box
de: Listenfeld

source: List View
de: Listenansicht

source: Icon View
de: Symbolansicht

source: Data Table
de: Datentabelle

source: Line Edit
de: Eingabefeld

source: Spin Box
de: Drehfeld

source: Date Edit
de: Datumseingabefeld

source: Time Edit
de: Zeiteingabefeld

source: Date-Time Edit
de: Datum- und Uhrzeiteingabefeld

source: Multi Line Edit
de: Mehrzeiliges Eingabefeld

source: Rich Text Edit
de: Rich-Text-Eingabefeld

source: Combo Box
de: Kombinationsfeld

source: Slider
de: Schieberegler

source: Scrollbar
de: Bildlaufleiste

source: Dial
de: Wählen

source: Label
de: Beschriftung

source: LCD Number
de: LCD-Nummer

source: Progress Bar
de: Fortschrittsanzeige

source: Text View
de: Textansicht

source: Spacer
de: Abstand

source: The Spacer provides horizontal and vertical spacing to be able to manipulate the behavior of layouts.
de: Der Abstand sichert horizontal und vertikal Raum zur Änderung des Verhaltens im Layout.

source: Text Label
de: Textfeld

source: The Text Label provides a widget to display static text.
de: Das Textfeld ist ein Bedienelement zur Anzeige statischen Textes.

source: Pixmap Label
de: Bildfeld

source: The Pixmap Label provides a widget to display pixmaps.
de: Das Bildfeld ist ein Bedienelement zur Anzeige von Bildern.

source: A line edit
de: Ein Eingabefeld

source: A rich text edit
de: Ein Feld zum Bearbeiten von Rich Text

source: A combo box
de: Ein Kombinationsfeld

source: A tree widget
de: Ein Baum-Bedienelement

source: A table widget
de: Ein Tabellen-Bedienelement

source: A button that when clicked, execute a command
de: Ein Knopf, der beim Anklicken einen Befehl ausführt

source: A button that closes the dialog it is in
de: Ein Kopf, der den Dialog schließt

source: A listbox showing output of a script
de: Ein Listenfeld, das die Ausgabe eines Skriptes anzeigt

source: A widget made up of a line edit and push button, for selecting files and folders
de: Ein Bedienelement aus einem Eingabefeld mit einem Knopf daneben, zur Auswahl von Dateien und Ordnern

source: A check box
de: Ein Ankreuzfeld

source: A radio button
de: Ein Auswahlknopf

source: A widget for grouping buttons together
de: Ein Bedienelement zum Gruppieren von Knöpfen

source: A widget for grouping other widgets together
de: Ein Bedienelement zum Gruppieren von Bedienelementen

source: A widget with tabs
de: Ein Bedienelement mit Reitern

source: A spin box
de: Ein Drehfeld

source: A small rich text editor
de: Ein kleines Rich-Text-Eingabefeld

source: A status bar
de: Eine Statusleiste

source: A progress bar
de: Eine Fortschrittsanzeige

source: A hidden script container
de: Ein versteckter Skript-Behälter

source: A timer for running scripts periodically
de: Ein Zeitgeber zum regelmäßigen Ausführen von Skripts

source: Move Tab Page
de: Karteikarte verschieben

source: Tab 1
de: Karteikarte 1

source: Tab 2
de: Karteikarte 2

source: Page
de: Seite

source: Page 1
de: Seite 1

source: Page 2
de: Seite 2

source: Wizard Page Editor
de: Editor für Assistenten-Seiten

source: Wizard pages:
de: Assistenten-Seiten:

source: Edit Wizard Pages
de: Assistenten-Seiten bearbeiten

source: Swap Pages %1 and %2 of %3
de: Seite %1 und %2 von %3 vertauschen

source: <No Project>
de: <Kein Projekt>

source: Files
de: Dateien

source: &Open Source File...
de: Quelldatei öff&nen ...

source: &Remove Source File From Project
de: &Quelltextdatei aus dem Projekt entfernen

source: &Open Form...
de: Öffne ein F&ormular ...

source: &Remove Form From Project
de: Formula&r aus dem Projekt löschen

source: &Remove Form
de: Entfe&rne das Formular

source: &Open Form Source...
de: Öffne die F&ormular-Quelle ...

source: <qt>Unable to create dialog.</qt>
de: <qt>Es kann kein Dialog erzeugt werden.</qt>

source: <qt>Kommander file<br><b>%1</b><br>does not exist.</qt>
de: <qt> Kommander Datei<br>%1<b></b><br>existiert nicht.</qt>

source: <qt>This file does not have a <b>.kmdr</b> extension. As a security precaution Kommander will only run Kommander scripts with a clear identity.</qt>
de: <qt>Diese Datei besitzt nicht die Erweiterung <b>.kmdr</b>. Aus Sicherheitsgründen führt Kommander nur Skripte aus, die eine eindeutige Zuordnung aufweisen.</qt>

source: Wrong Extension
de: Ungültige Erweiterung

source: <qt>This dialog is running from your <i>/tmp</i> directory. This may mean that it was run from a KMail attachment or from a webpage. <p>Any script contained in this dialog will have write access to all of your home directory; <b>running such dialogs may be dangerous: </b><p>are you sure you want to continue?</qt>
de: <qt>Dieser Dialog wird von Ihrem <i>/tmp</i>-Ordner aus ausgeführt. Das kann bedeuten, dass es von einem KMail-Anhang oder von einer Webseite aufgerufen wurde. <p>Jedes Skript dieses Dialogs hat Schreibzugriff auf Ihren Persönlichen Ordner. <b>Das Ausführen solcher Dialoge kann gefährlich sein: </b><p>sind Sie sicher, dass Sie fortfahren möchten?</qt>

source: Run Nevertheless
de: Dennoch starten

source: <qt>The Kommander file <i>%1</i> does not have the <b>executable attribute</b> set and could possibly contain dangerous exploits.<p>If you trust the scripting (viewable in kmdr-editor) in this program, make it executable to get rid of this warning.<p>Are you sure you want to continue?</qt>
de: <qt>Die Kommander-Datei <i>%1</i> hat das <b>Attribut Ausführbar</b> nicht gesetzt und kann möglicherweise gefährliche Sicherheitslücke enthalten.<p>Sollten Sie dem Code (ansehbar im kmdr-Editor) in diesem Programm vertrauen, machen Sie es ausführbar, um diese Warnung loszuwerden.<p>Sind Sie sich sicher, dass Sie fortfahren möchten?</qt>

source: Executor is a component of the Kommander dialog system that executes .kmdr files given as arguments or via stdin
de: Der Executor ist ein Bestandteil des Kommander Dialogsystems, dass mittels Argument oder über die Standardeingabe (stdin) angegebene .kmdr Dateien ausführt

source: (c) 2002, Marc Britton
de: © 2002, Marc Britton

source: Read dialog from standard input
de: Lese den Dialog von der Standardeingabe

source: Use given catalog for translation
de: Benutze den gegebenen Katalog für die Übersetzung

source: Error: no dialog given. Use --stdin option to read dialog from standard input.
de: Fehler: kein Dialog angegeben. Verwenden Sie den Parameter --stdin, um den Dialog von der Standardeingabe zu lesen.

source: error
de: Fehler

source: Enter a password
de: Passwort eingeben

source: Unterminated @execBegin ... @execEnd block.
de: Unbeendeter Block: @execBegin ... @execEnd.

source: Unterminated @forEach ... @end block.
de: Unbeendeter Block: @forEach ... @end.

source: Unterminated @if ... @endif block.
de: Unbeendeter Block: @if ... @endif.

source: Unterminated @switch ... @end block.
de: Unbeendeter Block: @switch ... @end.

source: Unknown widget: @%1.
de: Unbekanntes Bedienelement: @%1.

source: Infinite loop: @%1 called inside @%2.
de: Endlosschleife: @%1 innerhalb von @%2 aufgerufen.

source: Script for @%1 is empty.
de: Skript für @%1 ist leer.

source: Invalid state for associated text.
de: Ungültiger Status für den verbundenen Text.

source: Line %1: %2.
de: Zeile %1: %2.

source: Unknown special: '%1'.
de: Unbekannte Anweisung: „%1“.

source: Unmatched parenthesis in D-Bus call '%1'.
de: Nicht erreichbare Klammer im D-Bus-Aufruf „%1“.

source: Incorrect arguments in D-Bus call '%1'.
de: Ungültige Argumente im D-Bus-Aufruf „%1“.

source: <qt>Error in widget <b>%1</b>:<p><i>%2</i></qt>
de: <qt>Fehler im Bedienelement <b>%1</b>:<p><i>%2</i></qt>

source: Error
de: Fehler

source: Continue
de: Fortfahren

source: Continue && Ignore Next Errors
de: Fortfahren und weitere Fehler ignorieren

source: Stop
de: Stopp

source: Error in widget %1: %2
de: Fehler im Bedienelement %1: %2

source: Unmatched parenthesis after '%1'.
de: Nicht geschlossene Klammer nach „%1“.

source: Unmatched quotes in argument of '%1'.
de: Nicht geschlossene Anführungszeichen im Argument von „%1“.

source: Unknown function group: '%1'.
de: Unbekannte Funktiongruppe: „%1“.

source: Unknown function: '%1' in group '%2'.
de: Unbekannte Funktion: „%1“ in Gruppe „%2“.

source: Unknown widget function: '%1'.
de: Unbekannte Bedienelement-Funktion: „%1“.

source: Not enough arguments for '%1' (%2 instead of %3).<p>Correct syntax is: %4
de: Nicht genug Argumente für „%1“ (%2 anstelle von %3). <p>Die korrekte Syntax ist: %4

source: Too many arguments for '%1' (%2 instead of %3).<p>Correct syntax is: %4
de: Zu viele Argumente für „%1“ (%2 anstelle von %3). <p>Die korrekte Syntax ist: %4

source: Invalid character: '%1'.
de: Ungültiges Zeichen: „%1“.

source: Constant value expected.
de: Konstanter Wert erwartet.

source: '%1' (%2) is not a widget.
de: „%1“ (%2) ist kein Bedienelement.

source: '%1' is not a function.
de: „%1“ ist keine Funktion.

source: Expected a value.
de: Es wird ein Wert erwartet.

source: Division by zero.
de: Division durch Null.

source: In function '%1': too few parameters.
de: Zu wenig Parameter in der Funktion „%1“.

source: In function '%1': too many parameters.
de: Zu viele Parameter in der Funktion „%1“.

# Parser error - %2 is an error message
source: In function '%1': %2
de: In Funktion „%1“: %2

# Parser error - %1 is a widget, %2 is a var, %3 is an error message.
source: In widget function '%1.%2': %3
de: In Bedienelement-Funktion „%1.%2“: %3

source: '%1' is not a widget.
de: „%1“ ist kein Bedienelement.

source: Unexpected symbol after variable '%1'.
de: Unerwartetes Symbol nach der Variable „%1“.

source: Expected '%1'<br><br>Possible cause of the error is having a variable with the same name as a widget.
de: Es wurde „%1“ erwartet<br><br>Eine mögliche Ursache für diesen Fehler ist, das eine Variable und ein Bedienelement den gleichen Namen haben.

source: Expected '%1' got '%2'.
de: Erwartet „%1“, aber „%2“ erhalten.

source: Expected variable
de: Erwartete Variable

source: Inserts the item if it will not create a duplicate.
de: Fügt das Element ein, wenn nicht ein Duplikat erstellt wird.

source: Returns scripts associated with widget. This is an advanced feature that would not be commonly used.
de: Gibt die mit dem Bedienelement verbundenen Skripte zurück. Dies ist eine fortgeschrittene Funktion, die nicht allgemein verwendet wird.

source: Stops execution of the script associated with the widget.
de: Hält die Ausführung des mit dem Bedienelement (Widget) verbundenen Skriptes an.

source: Returns text of a cell in a table.
de: Gibt den Text einer Zelle in einer Tabelle zurück.

source: Returns 1 for checked boxes, 0 for unchecked.
de: Gibt für aktivierte Optionsfelder eine 1, und 0 für leere zurück.

source: Returns the list of child widgets contained in the parent widget. Set the <i>recursive</i> parameter to <i>true</i> to include widgets contained by child widgets.
de: Gibt eine Liste der im Eltern-Bedienelement enthaltenen Kinder-Bedienelemente zurück. Setzen Sie den <i>rekursiv</i> Parameter auf <i>wahr</i>, um die in den Kind-Bedienelementen enthaltenen Bedienelemente mit einzuschließen.

source: Removes all content from the widget.
de: Entfernt den gesamten Inhalt vom Bedienelement.

source: Returns number of items in a widget such as combobox or listbox.
de: Gibt die Anzahl der Elemente in einem Bedienelement (Widget) wie Kombinationsfeld oder Listenfeld zurück.

source: Returns index of current column.
de: Gibt den Index der aktuellen Spalte zurück.

source: Returns index of current item.
de: Gibt den Index des aktuellen Elementes zurück.

source: Returns index of current row.
de: Gibt den Index der aktuellen Zeile zurück.

source: Executes the script associated with the widget. With the new parser the execute method can take one or more arguments.
de: Führt das Skript aus, das mit dem Widget verbunden ist. Mit dem neuen Verarbeiter kann die ausführende Methode ein oder mehere Argumente aufnehmen.

source: Returns the index of an item with the given text.
de: Gibt den Index eines Elementes mit dem gegebenen Text zurück.

source: Inserts new column (or <i>count</i> columns) at <i>column</i> position.
de: Fügt eine neue Spalte (oder <i>count</i> Spalten) an der <i>column</i> Position ein.

source: Inserts item at <i>index</i> position.
de: Fügt das Element an der <i>Index</i> Position ein.

source: Inserts multiple items (EOL-separated) at <i>index</i> position.
de: Fügt eine (mit Zeilenschaltung getrennte) Liste von Elementen an der<i>Index</i> Position ein .

source: Inserts new row (or <i>count</i> rows) at <i>row</i> position.
de: Fügt eine neue Reihe (oder <i>count</i> Zeilen) an der <i>row</i> Position ein.

source: Returns the text of the item at the given index.
de: Gibt den Text eines Elementes am angegebenen Index zurück.

source: Returns the depth of the current item in the tree. Root items have depth 0.
de: Gibt die Gliederungstiefe des aktuellen Elementes im Baum zurück. Wurzelelemente haben die Tiefe 0.

source: Returns the slash-separated path to the given item in the tree.
de: Gibt den Querstrich-gegliederten Pfad zum angegebenen Element im Bau zurück.

source: Removes the column (or <i>count</i> consecutive columns) with the given index.
de: Entfernt die Spalte (oder <i>count</i> zusammenhängende Spalten) mit dem gegebenen Index.

source: Removes the item with the given index.
de: Entfernt das Element mit dem gegebenen Index.

source: Removes the row (or <i>count</i> consecutive rows) with the given index.
de: Entfernt die Reihe (oder <i>count</i> zusammenhängende Reihen) mit dem gegebenen Index.

source: Returns selected text or text of current item. In case of Table widgets, returns the selection coordinates, separated by commas in TopRow,LeftColumn,BottomRow,RightColumn form.
de: Gibt den ausgewälten Text oder den Text des aktuellen Elements zurück. Sollte es sich um ein TabellenWidget handeln, gibt es die Koordinaten getrennt durch Kommata in der Form ObereReihe,LinkeSpalte,UntereReihe,Rechte Spalte zurück.

source: Sets scripts associated with widget. This is an advanced feature that would not be commonly used.
de: Legt die mit dem Bedienelement verbundenen Skripte fest. Dies ist eine fortgeschrittene Funktion, die nicht allgemein verwendet wird.

source: Enables or disables widget.
de: Aktiviert oder deaktiviert Bedienelemente.

source: Sets text of a cell in a table.
de: Setzt den Text einer Zelle in einer Tabelle.

source: Inserts a widget into a cell of a table.
de: Setzt ein Bedienelement in eine Zelle in einer Tabelle.

source: Returns the name of a widget inserted into a cell, or an empty string if the cell contains no widget or an unknown widget type.
de: Gibt den Namen eines Bedienelements, das in eine Zelle eingefügt wurde, aus, oder eine leere Zeichenkette, wenn die Zelle kein Bedienelement oder einen unbekannten Typ eines Bedienelements enthält.

source: Sets/unsets checkbox.
de: Aktiviert/deaktiviert ein Ankreuzfeld.

source: Sets caption of the column <i>column</i>.
de: Setzt die Überschrift der Spalte <i>column</i>.

source: Selects the item at the specified index. Indexes are zero based.
de: Wählt das Element mit dem angegebenen Index. Die Indexierung beginnt mit Null.

source: Inserts a tab to the tabwidget with the specified label at the given index. Indexes are zero based.
de: Fügt einen Tabulator in das Tabellenelement mit dem angegebenen Namen am angegebenen Index ein. Die Indexierung beginnt mit Null.

source: Sets maximum numeric value
de: Setzt den maximalen numerischen Wert

source: Sets pixmap at the given index to the specified icon. Use <i>index = -1</i> to set the pixmap for all items.
de: Legt das Bild für den angegebenen Index auf das gewählte Symbol fest. Mit <i>Index = -1</i> kann das Bild für alle Elemente festgelegt werden.

source: Sets caption of the row <i>row</i>.
de: Setzt die Überschrift der Reihe <i>row</i>.

source: Selects given text or select item containing given text.
de: Wählt einen vorgegebenen Text oder ein Element, das diesen Text enthält, aus.

source: Sets widget's content.
de: Legt den Inhalt des Bedienelementes fest.

source: Shows/hides widget.
de: Bedienelemente anzeigen/ausblenden.

source: Returns content of widget.
de: Gibt den Inhalt des Bedienelementes zurück.
