Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/kdewebdev/kommander.po
Languages: de

source: Remove the widget from the index position, returns the index of the removed widget or -1 if no widget was found.
de: Entfernt das Bedienelement von der Index-Position, gibt den Index des entfernten Bedienelements zurück oder -1, falls kein Bedienelement gefunden wurde.

source: Activates the selected widget.
de: Aktiviert das ausgewählte Bedienelement.

source: Returns the index of the active widget.
de: Gibt den Index des aktiven Elements zurück.

source: Returns the widget having the supplied index.
de: Gibt das Element mit dem angegebenen Index zurück.

source: Returns the index of the widget, -1 if the widget is not part of the toolbox.
de: Gibt den Index des Bedienelementes zurück, -1, wenn es nicht Teil der Werkzeugkiste ist.

source: Add column at end with column header
de: Spalte am Ende einfügen, mit folgendem Spaltenkopf

source: Set sorting for a column
de: Sortieren für eine Spalte festlegen

source: Get the column count
de: Anzahl der Spalten holen

source: Get the column caption for column index
de: Die Spaltenüberschrift des Spaltenindizes holen

source: Set the pixel width for column index - use 0 to hide
de: Pixelbreite der Spaltenindizes – 0 zum ausblenden
