Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/kdewebdev/kommander.po
Languages: de

source: Returns type(class) of widget.
de: Gibt den Typ (Klasse) des Bedienelementes zurück.

source: Makes the widget editable or read only, depending on the editable argument.
de: Setzt das Bedienelement auf bearbeitbar oder nur-lesbar, abhängig von dem Bearbeiten-Argument.

source: Return the widget's geometry as <i>x y w h</i>. This is useful for positioning a created widget.
de: Gibt die Geometrie des Bedienelements in der Form <i>x y b h</i> zurück. Dies ist für das Positionieren eines erzeugten Bedienelements nützlich.

source: Returns true if the widget has focus.
de: Gibt WAHR zurück, wenn das Element den Fokus hat.

source: Returns current widget's content. This was required inside widget A to return widget A content when requested by widget B. The new method is to use @A.text inside B instead of just @A if you just want the unaltered text.
de: Gibt den Inhalt des aktuellen Bedienelementes (Widget) zurück. Dies war innerhalb von Bedienelement A erforderlich, um den Inhalt von Bedienelement A zurückzugeben, wenn Bedienelement B dies anfordert. Die neue Methode ist, stattdessen @A.text innerhalb von B anstelle von nur @A zu verwenden, wenn nur der unveränderte Text gebraucht wird.

source: Returns selected text or text of current item. This is deprecated for <i>@mywidget.selected</i>.
de: Gibt den ausgewählten Text oder den Text des aktuellen Elementes zurück. Dies ist wegen neu <i>@mywidget.selected</i> veraltet.

source: Does nothing. This is useful if you request a CheckBox or RadioButton to return a value where a state, typically the unchecked state, has no value. The @null prevents an error indicating it is empty.
de: Tut nichts. Dies ist nützlich, wenn von einem Ankreuzfeld (Checkbox) oder Auswahlfeld (RadioButton) ein Statuswert zurückgeliefert werden soll, aber, typischerweise im nicht ausgewählten Status, kein Wert vorhanden ist. Die @null verhindert die Fehlermeldung, dass es leer sei.

source: Returns the pid (process ID) of the current process.
de: Gibt die pid (Prozess-ID) des aktuellen Prozesses zurück.

source: Returns D-Bus identifier of current process. This is shorthand for <i>kmdr-executor-@pid</i>.
de: Gibt den D-Bus-Bezeichner des aktuellen Prozesses zurück. Dies ist eine Kurzform von für <i>kmdr-executor-@pid></i>.

source: Returns the pid of the parent Kommander window.
de: Gibt die pid des Kommander Eltern-Fensters zurück.

source: Writes <i>text</i> on stderr.
de: Schreibt <i>text</i> auf die Standardfehlerausgabe.

source: Writes <i>text</i> on standard output.
de: Schreibt <i>text</i> auf die Standardausgabe.

source: Executes a script block. Bash is used if no shell is given. It is primarily for use in non-button widgets where script actions are not expected. Full path is not required for the shell which may be useful for portability. <p><i>If this is used inside a button it allows alternate script languages to be used and will return a value to the main script, which may be unexpected.</i>
de: Führt einen Skript-Block aus. Die Bash wird verwendet, wenn keine Shell angegeben wurde. Es dient in erster Linie für Bedienelemente ohne Schaltknöpfe, in denen Skript-Aktionen nicht zu erwarten sind. Der volle Pfad ist für die Shell nicht erforderlich, was für die Übertragbarkeit nützlich sein kann.<p><i>Wenn dies innerhalb eines Knopfes verwendet wird, ermöglicht es die Benutzung anderer Skriptsprachen und gibt dem Haupt-Skript einen Wert zurück, der unvorhersehbar sein könnte.</i>

source: Returns value of an environment (shell) variable. Do not use <i>$</i> in the name. For example, <i>@env(PATH)</i>.
de: Gibt den Wert einer Umgebungs- (Shell) Variable zurück. Verwenden Sie nicht das <i>$</i> Zeichen im Namen. Zum Beispiel <i>@env(PATH)</i>.

source: Executes an external shell command.
de: Führt einen externen Shell-Befehl aus.

source: Parses an expression and returns computed value.
de: Analysiert einen Ausdruck und gibt einen berechneten Wert zurück.

source: Executes loop: values from <i>items</i> list (passed as EOL-separated string) are assigned to the variable. <br><b>Old</b><br> <i>@forEach(i,A\nB\nC\n)<br> @# @i=A<br>@end</i><br><b>New</b><br><i>foreach i in MyArray do<br> //i = key, MyArray[i] = val<br>end
de: Führt eine Schleife aus: Werte aus der Liste <i>Elemente</i> Liste (als durch Zeilenende getrennte Zeichenkette) werden der Variable zugewiesen. <i>@forEach(i,A\nB\nC\n)<br> @# @i=A<br>@end</i><br><b>New</b><br><i>foreach i in MyArray do<br> //i = key, MyArray[i] = val<br>end

source: Executes loop: variable is set to <i>start</i> and is increased by <i>step</i> each time loop is executed. Execution stops when variable becomes larger than <i>end</i>. <br><b>Old</b><br><i>@for(i,1,10,1)<br> @# @i=1<br>@endif</i><br><b>New</b><br><i>for i=0 to 20 step 5 do<br> debug(i)<br>end</i>.
de: Führt eine Schleife aus: die Variable wird auf <i>start</i> gesetzt und bei jedem Schleifendurchlauf um <i>step</i>erhöht. Die Ausführung endet, wenn die Variable größer wird als <i>end</i>. <br><b>Alt</b><br><i>@for(i,1,10,1)<br> @# @i=1<br>@endif</i><br><b>New</b><br><i>for i=0 to 20 step 5 do<br> debug(i)<br>end</i>.

source: Returns the value of a global variable.
de: Gibt den Wert einer globalen Variablen zurück.

source: Translates the string into the current language. Texts in GUI would be automatically extracted for translation.
de: Übersetzt die Zeichenkette in die aktuelle Sprache. Texte in der GUI werden automatisch für die Übersetzung herausgeholt.

source: Executes block if expression is true (non-zero number or non-empty string.) <p><b>Old</b>Close with <b>@endif</b></p><p><b>New</b><br>if val == true then<br>// do op<br>elseif cond<br>// second chance<br>else<br>// cond failed<br>endif</p>
de: Führt den Block aus, wenn der Ausdruck wahr ergibt (eine Zahl ungleich null oder einen leeren String.) <p><b>Alt</b>Close with <b>@endif</b></p><p><b>Neu</b><br>if val == true then<br>// do op<br>elseif cond<br>// second chance<br>else<br>// cond failed<br>endif</p>

source: Executes another Kommander dialog. Current dialog directory is used if no path is given. Arguments may be given as named arguments which will become global variables in the new dialog. For instance: <i>var=val</i>
de: Führt einen anderen Kommander-Dialog aus. Der aktuelle Dialog-Ordner wird benutzt, wenn kein anderer Pfad angegeben wird. Die Argumente können als benannte Argumente übergeben werden und werden dadurch globale Variable im neuen Dialog, wie: <i>var = val</i>

source: Reads setting from configuration file for this dialog.
de: Liest die Einstellung für diesen Dialog aus der Konfigurationsdatei.

source: Sets the value of a global variable. Global variables exist for the life of the Kommander window.
de: Setzt den Wert einer globalen Variable. Globale Variable existierten für die gesamte Lebensdauer des Kommander-Fensters.

source: Stores setting in configuration file for this dialog.
de: Speichert die Einstellungen für diesen Dialog in einer Konfigurationsdatei.

source: Begin of <b>switch</b> block. Following <b>case</b> values are compared to <i>expression</i>.<p>@switch()<br>@case()<br>@end
de: Beginn eines <b>switch</b> Blocks. Folgende <b>case</b> Werte werden mit dem <i>Ausdruck</i> verglichen.<p>@switch()<br>@case()<br>@end

source: Executes an external D-Bus call.
de: Führt einen externen D-Bus-Aufruf aus.

source: Adds a comment to EOL that Kommander will not parse
de: Fügt einen Kommentar zu EOL (Zeilenende) hinzu, den Kommander ignoriert

source: Creates a new widget with the specified type and as the child of parent.
de: Erzeugt ein neues Bedienelement des angegebenen Typs und als untergeordneten Element des Elternelements.

source: Returns true if there is a widget with the passed name, false otherwise.
de: Gibt wahr zurück, wenn es ein Element mit dem übergebenen Namen gibt, anderenfalls falsch.

source: Connects the signal of sender with the slot of the receiver
de: Verbindet das Signal des Sender mit dem Slot des Empfängers

source: Disconnects the signal of sender from the slot of the receiver
de: Entfernt die Verbindung zwischen dem Signal des Senders und dem Slot des Empfängers

source: Exits script execution and returns
de: Beendet die Skriptausführung und springt zurück

source: Exits the current block of a while, for or foreach loop
de: Beendet des aktuellen Block einer while, for oder foreach-Schleife

source: Exit a step and return to the beginning of a loop
de: Beendet einen Schritt und springt zurück an den Anfang einer Schleife

source: Return from a script, optionaly with a value from the script to the caller
de: Beendet ein Skript und übergibt optional dem Aufrufer einen Wert

source: Returns an EOL-separated list of all values in the array.
de: Gibt eine durch Zeilenschaltung getrennte Liste von allen Werten im Feld zurück.

source: Returns an EOL-separated list of all keys in the array.
de: Gibt eine durch Zeilenschaltung getrennte Liste von allen Schlüsseln im Feld zurück.

source: Removes all elements from the array.
de: Entfernt alle Elemente aus dem Feld.

source: Returns the number of elements in the array.
de: Gibt die Anzahl der Elemente im Feld zurück.

source: Returns the value associated with the given key.
de: Gibt den unter diesem Schlüssel gespeicherten Wert zurück.

source: Removes element with the given key from the array.
de: Entfernt das unter diesem Schlüssel gespeicherte Element aus dem Feld.

source: Adds element with the given key and value to the array
de: Fügt das Element mit dem angegebenen Schlüssel und Wert zum Feld hinzu

source: Adds all elements in the string to the array. String should have <i>key\tvalue\n</i> format.
de: Fügt alle Elemente in der Zeichenkette zum Feld hinzu. Die Zeichenkette sollte das Format <i>Schlüssel\tWert\n</i> haben.

source: Returns all elements in the array in <pre>key\tvalue\n</pre> format.
de: Gibt alle Elemente im Feld im<pre>Schlüssel\tWert\n</pre> Format zurück.

source: Create an integer indexed array - starting from 0 - from a string. Use the separator character to split the string. The separator's default value is '\t'.
de: Erzeugt ein Ganzzahl-indiziertes Array – beginnend von 0 – von einer Zeichenkette. Verwendet das Trennzeichen, um die Zeichenkette zu aufzuteilen. Der Standardwert des Trennzeichens ist „\t“.

source: Create a string from an integer indexed array. Concatenate the elements with the separator character. The separator's default value is '\t'.
de: Erzeugt eine Zeichenkette aus einem Ganzzahl-indizierten Array. Fügt die Elemente mit dem Trennzeichen zusammen. Der Standardwert des Trennzeichens ist „\t“.

source: Remove keyNum elements starting with keyStart from an indexed array and reindex the array. If keyNum is not specified, remove only the keyStart element.
de: Die Anzahl Elemente beginnend bei Anfang aus einem indizierten Array entfernen und das Array neu indizieren. Wenn die Anzahl nicht angegeben ist, wird nur das Element Anfang entfernt.

source: Insert the elements from string starting at key and reindex the array. Use the separator to separate the elements from the string. The separator's default value is '\t'.
de: Die Elemente von einer Zeichenkette beginnend bei dem Schlüssel einfügen und das Array neu indizieren. Verwenden Sie das Trennzeichen, um Elemente von der Zeichenkette einzugrenzen. Der Standardwert des Trennzeichens ist „\t“.

source: Returns number of chars in the string.
de: Gibt die Anzahl der Zeichen in der Zeichenkette zurück.

source: Checks if the string contains the given substring.
de: Prüft, ob die Zeichenkette die angegebene Subzeichenkette enthält.

source: Returns the position of a substring in the string, or -1 if it is not found.
de: Gibt die Position einer Subzeichenkette in einer Zeichenkette zurück, oder -1, wenn nicht vorhanden.

source: Returns the position of a substring in the string, or -1 if it is not found. String is searched backwards
de: Gibt die Position einer Subzeichenkette in einer Zeichenkette zurück, oder -1, wenn nicht vorhanden. Die Zeichenkette wird von rückwärts durchsucht

source: Returns the first <i>n</i> chars of the string.
de: Gibt die ersten<i>n</i> Zeichen einer Zeichenkette zurück.

source: Returns the last <i>n</i> chars of the string.
de: Gibt die letzten<i>n</i> Zeichen einer Zeichenkette zurück.

source: Returns <i>n</i> chars of the string, starting from <i>start</i>.
de: Gibt <i>n</i> Zeichen einer Zeichenkette zurück, beginnend mit <i>Start</i>.

source: Removes all occurrences of given substring.
de: Entfernt die gegebenen Subzeichenkette überall.

source: Replaces all occurrences of the given substring with the given replacement.
de: Ersetzt die gegebene Zeichenkette mit der angegebenen Ersetzung überall.

source: Converts the string to uppercase.
de: Wandelt die Zeichenkette zur Großschreibung um.

source: Converts the string to lowercase.
de: Wandelt die Zeichenkette zur Kleinschreibung um.

source: Compares two strings. Returns 0 if they are equal, -1 if the first one is lower, 1 if the first one is higher
de: Vergleicht zwei Zeichenketten. Wenn sie gleich sind, wird 0 zurückgegeben, wenn die erste kleiner ist, -1 und 1, wenn die erste größer ist

source: Checks if the string is empty.
de: Prüft, ob die Zeichenkette leer ist.

source: Checks if the string is a valid number.
de: Prüft, ob die Zeichenkette eine gültige Zahl ist.

source: Returns given section of a string.
de: Gibt den angegebenen Sektor einer Zeichenkette zurück.

source: Returns the given string with %1, %2, %3 replaced with <i>arg1</i>, <i>arg2</i>, <i>arg3</i> accordingly.
de: Gibt die angegebene Zeichenkette mit %1, %2, %3 entsprechend ersetzt durch <i>arg1</i>, <i>arg2</i>, <i>arg3</i> zurück.

source: Convert a string to an integer. If not possible, use the default value.
de: Eine Zeichenkette in eine Ganzzahl konvertieren. Falls nicht möglich, wird der Standard-Wert verwendet.

source: Convert a string to a double precision floating point value. If not possible, use the default value.
de: Eine Zeichenkette in eine Fließkommazahl mit doppelter Genauigkeit konvertieren. Falls nicht möglich, wird der Standard-Wert verwendet.

source: Returns content of given file.
de: Gibt den Inhalt der angegebenen Datei zurück.

source: Writes given string to a file.
de: Schreibt die angegebene Zeichenkette in eine Datei.

source: Appends given string to the end of a file.
de: Hängt die angegebene Zeichenkette ans Ende einer Datei an.

source: Checks to see if file exists.
de: Auswählen, um zu sehen, ob die Datei existiert.

source: Shows color dialog. Returns color in #RRGGBB format. Defaults to the parameter, if specified.
de: Zeigt den Farbauswahldialog an. Gibt die Farbe im Format #RRGGBB zurück. Es wird der Standardwert genommen, falls angegeben.

source: Shows text selection dialog. Returns entered text.
de: Zeigt den Textauswahldialog an. Gibt den eingegebenen Text zurück.

source: Shows a dialog asking user for password and returns it.
de: Zeigt eine Passwortabfrage an und gibt dieses zurück.

source: Shows value selection dialog. Returns entered value.
de: Zeigt den Wertauswahldialog an. Gibt den eingegebenen Wert zurück.

source: Shows float value selection dialog. Returns entered value.
de: Zeigt den Wertauswahldialog für eine Fließkommazahl an. Gibt den eingegebenen Wert zurück.

source: Shows existing file selection dialog. Returns selected file.
de: Zeigt den Dateiauswahldialog an. Gibt die ausgewählte Datei zurück.

source: Shows save file selection dialog. Returns selected file.
de: Zeigt den Dialog zum Datei speichern an. Gibt die ausgewählte Datei zurück.

source: Shows directory selection dialog. Returns selected directory.
de: Zeigt den Ordnerauswahldialog an. Gibt den gewählten Ordner zurück.

source: Shows multiple files selection dialog. Returns EOL-separated list of selected files.
de: Zeigt den Mehrfach-Dateiauswahldialog an. Gibt durch Zeilenschaltungen getrennte Liste der ausgewählten Dateien zurück.

source: Shows an information dialog.
de: Öffnet ein Info-Fenster.

source: Shows an error dialog.
de: Zeigt einen Fehlerdialog an.

source: Shows a warning dialog with up to three buttons. Returns number of selected button.
de: Zeigt einen Warndialog mit bis zu drei Schaltflächen. Gibt die Nummer der gewählten Schaltfläche zurück.

source: Shows a question dialog with up to three buttons. Returns number of selected button.
de: Zeigt einen Auswahldialog mit bis zu drei Schaltflächen. Gibt die Nummer der gewählten Schaltfläche zurück.

source: kmdr-plugins is a component of the Kommander dialog system that manages installed plugins.
de: kmdr-Module ist eine Komponente des Kommander-Dialogsystems, das installierte Module verwaltet.

source: Kommander Plugin Manager
de: Kommander-Modul-Verwaltung

source: (C) 2004-2005 Kommander authors
de: © 2004–2005 Kommander-Autoren

source: Register given library
de: Registriere die angegebene Bibliothek

source: Remove given library
de: Entferne die angegebene Bibliothek

source: Check all installed plugins and remove those missing
de: Überprüfe alle installierten Module und entferne die nicht auffindbaren

source: List all installed plugins
de: Liste alle installierten Module auf

source: Error adding plugin '%1'
de: Fehler beim Hinzufügen von Modul %1

source: Error removing plugin '%1'
de: Fehler beim Entfernen von Modul %1

source: <qt>Unable to load Kommander plugin<br><b>%1</b></qt>
de: <qt>Das Kommander-Modul <br><b>%1</b> kann nicht geladen werden</qt>

source: Cannot add plugin
de: Kann das Modul nicht hinzufügen

source: Sets information about the application. This is the first method that must be called, any addition to the dialog done before initialization will be ignored.
de: Setzt Informationen über die Anwendung. Dies ist die erste Methode, die aufgerufen werden muss, jegliches Hinzufügen vor der Initialisierung wird ignoriert.

source: Add an author. Only the author name is required.
de: Einen Autor hinzufügen. Nur der Name wird benötigt.

source: Add a translator. Only the name is required.
de: Geben Sie einen Übersetzer ein. Nur der Name wird benötigt.

source: Set a short description text.
de: Geben Sie einen kurzen Beschreibungstext an.

source: Set a homepage address.
de: Geben Sie eine Homepageadresse an.

source: Set an email address, where bugs can be reported.
de: Geben Sie eine E-Mail-Adresse an, wo Fehlerberichte eingeschickt werden können.

source: Sets license information of the application. The parameter can be one of the license keys - GPL_V2, LGPL_V2, BSD, ARTISTIC -, or a freely specified text.
de: Setzt die Lizenzinformation der Anwendung an. Der Parameter kann etwas aus den folgenden sein, oder ein frei angegebener Text: GPL_V2, LGPL_V2, BSD, ARTISTIC.

source: Returns the set version string.
de: Gibt die gesetzte Versionszeichenkette zurück.

source: Failed to start shell process.
de: Start des shell-Prozesses fehlgeschlagen.

source: Shell process exited with an error.
de: Der Shell-Prozess wurde mit einem Fehler beendet.

source: Make the combobox expose its list without needing to use the mouse.
de: Die Liste des Kombinationsfeldes ohne Verwendung der Maus anzeigen.

source: Kommander HTML part plugin.
de: Kommander HTML-Plugin

source: Sets the default font for the dialog, by specifying the family, the size and other style options.
de: Setzt die Standardschriftart für den Dialog, indem die Familie, die Größe und andere Stiloptionen angegeben werden.

source: Returns the font family.
de: Gibt die Schriftfamilie zurück.

source: Returns the font size in points.
de: Gibt die Schriftgröße in Punkt zurück.

source: Returns true if the font is bold.
de: Gibt wahr zurück, wenn die Schriftart fett ist.

source: Returns true if the font is italic.
de: Gibt wahr zurück, wenn die Schriftart kursiv ist.

source: Insert an item into the popup menu. The executeWidget's execute method will be run when this item is selected. Returns the id of the inserted item. Use -1 as the index to insert at the end. The icon is optional.
de: Ein Element in das Aufklappmenü einfügen. Die Ausführen-Methode des Ausführen-Bedienelements wird ausgeführt, wenn das Element ausgewählt ist. Gibt die Nummer des eingefügten Elements zurück. Verwenden Sie den Index -1 für das Einfügen am Ende. Das Symbol ist optional.

source: Insert a separator item into the popup menu. Use -1 as the index to insert at the end.
de: Ein Trenn-Element in das Aufklappmenü einfügen. Verwenden Sie den Index -1 für das Einfügen am Ende.

source: Change an item specified by id in the popup menu. The executeWidget's execute method will be run when this item is selected.
de: Ein durch den Namen angegebenes Element im Aufklapp-Menü ändern. Die Ausführen-Methode des Ausführen-Bedienelements wird ausgeführt, wenn das Element ausgewählt wird.

source: Enable the item specified by id in the popup menu.
de: Das durch die Nummer angegebene Element im Aufklapp-Menü aktivieren

source: Check if the item specified by id is enabled.
de: Auswählen, falls das durch die Nummer angegebene Element sichtbar ist.

source: Make the item specified by id visible.
de: Das durch die Nummer angegebene Element sichtbar machen.

source: Apply checked status for the item specified by id.
de: Ausgewählten Status auf das durch die Nummer angegebene Element anwenden.

source: Check if the item specified by id is visible.
de: Auswählen, wenn das durch die Nummer angegebene Menü sichtbar ist.

source: Verify if the item specified by id is checked.
de: Überprüfen, falls das durch die Nummer angegebene Element überprüft wird.

source: Insert submenu widget into the popup menu. Use -1 as the index to insert at the end. The icon is optional.
de: Untermenü-Element in das Aufklappmenü einfügen. Verwenden Sie den Index -1 für das Einfügen am Ende. Das Symbol ist optional.

source: Sets a column to sort ascending or descending. Optionally can sort with rows intact for database use. wholeRows is ignored under KDE4.
de: Setzt, ob eine Spalte auf- oder absteigend sortiert werden soll. Optional können Sie mit intakten Zeilen zur Verwendung mit Datenbanken sortieren. ganzeZeilen wird unter KDE4 ignoriert.

source: Scrolls the table so the cell indicated is visible.
de: Verschiebt die Tabelle so, dass die angedeutete Zelle sichtbar wird.

source: Select cells using the upper left and lower right cell addresses
de: Zellen durch die Adressen der Zellen oben links und unten rechts auswählen

source: Select the row with the zero based index.
de: Die Spalte mit dem Nullbasierten Index auswählen.

source: Select the column with the zero based index.
de: Die Spalte mit dem Nullbasierten Index auswählen.

source: Set the column read only using zero based index.
de: Die Spalte mit einem Nullbasierten Index als nur-lesbar setzen.

source: Set the row read only using zero based index.
de: Die Zeile mit einem Nullbasierten Index als nur-lesbar setzen.

source: See if the widget has been modified.
de: überprüfen, ob das Bedienelement verändert wurde.

source: Set the timer timeout interval in ms.
de: Das Zeitüberschreitungsintervall des Timers in ms setzen.

source: Adds a widget to the toolbox. Returns the index of the widget.
de: Fügt ein Bedienelement der Werkzeugkiste hinzu. Gibt den Index des Bedienelements zurück.

source: Returns the name of the active widget.
de: Gibt den Namen des aktiven Bedienelements zurück.

source: Remove the selected widget, returns the index of the removed widget or -1 if no such widget was found.
de: Entfernt das ausgewählte Bedienelement, gibt den Index des entfernten Bedienelements zurück oder -1, falls kein Bedienelement gefunden wurde.
