Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdesdk/cervisia.po
Languages: de

source: To generate the log that is the base for the <guilabel>CVS Log</guilabel> dialog, &cervisia; issues the following command:
de: Um das Protokoll für den Dialog <guilabel>CVS-Protokoll</guilabel> zu erstellen, setzt &cervisia; den folgenden Befehl ab:

source: <command>cvs log <replaceable>file name</replaceable></command>
de: <command>cvs log <replaceable>Dateinamen</replaceable></command>

source: Browsing the History
de: Die Versionsgeschichte durchsuchen

source: If the used repository has logging enabled, &cervisia; can present you a history of certain events like checkouts, commits, tags, updates and releases. Choose <guimenuitem>History</guimenuitem> from the <guimenu>View</guimenu> menu, and &cervisia; will issue the command
de: Ist im verwendeten &CVS;-Archiv die Protokollierung eingeschaltet, kann &cervisia; Ihnen eine Historie bestimmter Ereignisse wie Auslesen, Einspielen, Aktualisierungen und Freigaben darstellen. Wählen Sie den Eintrag <guimenuitem>Versionsgeschichte</guimenuitem> aus dem Menü <guimenu>Ansicht</guimenu>, und &cervisia; setzt den folgenden Befehl ab:

source: This fetches the complete logging file from the server, &ie; a list of the events for all users and all modules. This can be a huge amount of data.
de: Hierdurch wird die komplette Protokolldatei vom Server geholt, &ie; eine Liste der Vorgänge aller Benutzer und Module. Hierbei kann es sich um eine gewaltige Datenmenge handeln.

source: Now you can see the list of events, sorted by date. In the second column, the type of the event is shown:
de: Sie können nun die Liste der Ereignisse nach Datum sortiert sehen. In der zweiten Spalte wird die Art des Ereignisses angezeigt:

source: Checkout - The user who is displayed in the 'Author' column has checked out a module
de: Auslesen - Der in der Spalte ‚Autor‘ aufgeführte Benutzer hat ein Modul aus dem &CVS;-Archiv ausgelesen.

source: Tag - A user has used the command <command>cvs rtag</command>. Note that the usage of <command>cvs tag</command> (as done by &cervisia;'s <menuchoice><guimenu>Advanced</guimenu><guimenuitem>Tag/Branch...</guimenuitem></menuchoice> command) is not recorded in the history database. This has historical reasons (see the &CVS; <acronym>FAQ</acronym>).
de: Tag - Ein Benutzer hat den Befehl <command>cvs rtag</command> verwendet. Beachten Sie, dass die Verwendung des Befehls <command>cvs tag</command> (das Sie in &cervisia; über den Menüpunkt <menuchoice><guimenu>Erweitert</guimenu><guimenuitem>Tag setzen/Verzweigen ...</guimenuitem></menuchoice> ausführen können) nicht in der Historien-Datenbank gespeichert wird. Dieses Verhalten hat historische Gründe, die Sie in der &CVS; <acronym>FAQ</acronym> nachlesen können.

source: Release - A user has released a module. Actually, this command is rarely used and not of much value.
de: Freigabe - Ein Benutzer hat ein Modul freigegeben. Dieser Befehl wird eigentlich selten benutzt und ist von geringem Nutzen.

source: Update, Deleted - A user has made an update on a file which was deleted in the repository. As a consequence, the file was deleted in his working copy.
de: Aktualisiert, Gelöscht - Ein Benutzer hat eine Datei aktualisiert, die im &CVS;-Archiv bereits gelöscht war. Das hat zur Folge, dass seine Arbeitskopie ebenfalls gelöscht wurde.

source: Update, Copied - A user has made an update on a file. A new version was copied into working copy.
de: Aktualisiert, Kopiert - Ein Benutzer hat eine Datei aktualisiert. Eine neue Version wurde in den Arbeitsordner kopiert.

source: Update, Merged - A user has made an update on a file. The modifications in the repository version on the file were merged into his working copy.
de: Aktualisiert, Zusammengeführt - Ein Benutzer hat eine Datei aktualisiert. Die Änderungen im &CVS;-Archiv wurden in seine Arbeitskopie eingefügt.

source: Update, Conflict - A user has made an update on a file, and a conflict with his own modifications was detected.
de: Aktualisiert, Konflikt - Ein Benutzer hat eine Datei aktualisiert. Dabei wurde ein Konflikt mit den von ihm durchgeführten Änderungen festgestellt.

source: Commit, Modified - A user committed a modified file.
de: Einspielen, Geändert - Ein Benutzer hat eine geänderte Datei eingespielt.

source: Commit, Added - A user added a file and committed it.
de: Einspielen, Hinzufügen - Ein Benutzer hat eine Datei zum &CVS;-Archiv hinzugefügt und diese eingespielt.

source: Commit, Removed - A user removed a file and committed it.
de: Einspielen, Entfernt - Ein Benutzer hat eine Datei aus dem &CVS;-Archiv entfernt und diese Änderung eingespielt.

source: <title>A screenshot of &cervisia;'s history dialog</title>
de: <title>Ein Bildschirmfoto Dialogs <quote>CVS-Versionsgeschichte</quote></title>

source: <phrase>A screenshot of &cervisia;'s history dialog</phrase>
de: <phrase>Ein Bildschirmfoto Dialogs <quote>CVS-Versionsgeschichte</quote></phrase>

source: You can sort the list by other criteria simply by clicking on the respective column header. In order to sort out the history entries you are interested in, there are various filter options activated by check boxes:
de: Sie können die Liste nach anderen Kriterien sortieren, indem Sie die entsprechende Spaltenüberschrift anklicken. Sie können die Sie interessierenden Einträge aus der Historie über verschiedene Filter darstellen, die über Ankreuzfelder auswählbar sind.

source: Show commit events - shows commits
de: Einspiel-Ereignisse anzeigen - Anzeige der Einspielvorgänge

source: Show checkout events - shows checkouts
de: Auslese-Ereignisse anzeigen - Auslese

source: Show tag events - shows taggings
de: Tag-Ereignisse anzeigen - Das Setzen von Tags anzeigen

source: Show other events - shows events not included in the above
de: Andere Ereignisse anzeigen - Vorgänge anzeigen, die nicht durch die obigen abgedeckt werden.

source: Only user - shows only events caused by a certain user
de: Nur dieser Benutzer - Zeigt nur Ereignisse an, die von diesem Benutzer verursacht wurden

source: Only file names matching - filters file names by a regular expression
de: Nur die zutreffenden Dateinamen - Filtert Dateinamen mittels regulärer Ausdrücke

source: Only folders matching - filters folder names by a regular expression
de: Nur die zutreffenden Ordnernamen - Filtert Ordnernamen mittels regulärer Ausdrücke

source: Special characters recognized by the regular expression matcher are:
de: Folgende Sonderzeichen werden bei regulären Ausdrücken ausgewertet:

source: <literal>x*</literal> matches any number of occurrences of the character <literal>x</literal>.
de: <literal>x*</literal> trifft auf eine beliebige Anzahl des Zeichens <literal>x</literal> zu.

source: <literal>x+</literal> matches one or more of occurrences of the character <literal>x</literal>.
de: <literal>x+</literal> trifft auf das Vorkommen eines oder mehrere Zeichen <literal>x</literal> zu.

source: <literal>x?</literal> matches zero or one occurrences of the character <literal>x</literal>.
de: <literal>x?</literal> trifft auf kein oder einmaliges Vorkommen des Zeichens <literal>x</literal>.zu.

source: <literal>^</literal> matches the start of the string.
de: <literal>^</literal> Vorkommen am Anfang einer Zeichenkette.

source: <literal>$</literal> matches the end of the string.
de: <literal>$</literal> Vorkommen am Ende einer Zeichenkette.

source: <literal>[a-cx-z]</literal> matches a set of characters, &eg; here the set consisting of a,b,c,x,y,z.
de: <literal>[a-cx-z]</literal> Vorkommen einer Gruppe von Zeichen, &eg; in diesem Fall einer Zeichengruppe bestehend aus a,b,c,x,y,z.

source: Advanced Usage
de: Weiterführende Funktionen

source: Updating to Tag, Branch or Date
de: Zum Tag, Zweig oder Datum aktualisieren

source: Branches of a module are parallel versions of this module. A good real life example of the use of this feature is the release of a software project. After a major release, there are bugs in the code that should be fixed, but people want to add new features to the application too. It is very hard to do both at the same time because new features usually introduce new bugs, making it hard to track down the old ones. To solve this dilemma, &CVS; lets you create a parallel version, that we will call the &quot;stable release branch&quot;, where you can only add bugfixes, leaving the main branch (HEAD) open for adding new features.
de: Zweige eines Moduls sind parallele Versionen des Moduls. Eine gutes Beispiel für die Verwendung ist das Release eines Sotware-Projekts. Nach einem Haupt-Release gibt es Fehler, die korrigiert werden müssen, aber die Entwickler wollen auch neue Features hinzufügen. Es ist schwer, beides gleichzeitig zu tun, da neue Features normalerweise neue Fehler mit sich bringen, was es schwer machen, die alten Fehler zu finden. Um dieses Problem zu umgehen, können Sie in &CVS; eine parallele Version erstellen, die wir hier &quot;stabiler Release-Zweig&quot; nennen, in den Sie nur Fehlerbereinigungen einpflegen. Der Hauptzweig (HEAD) bleibt offen für das Hinzufügen neuer Features.

source: Tags are used to mark a version of a project. &CVS; stamps one version of each file with the tag, so when you checkout or update to a specific tag, you will get always the same file versions; therefore, as opposed to branches, tags are not dynamic: you cannot develop a tag. Tags are useful to mark releases, big changes in the code, &etc;
de: Mit Tags markieren Sie Versionen eines Projekts. &CVS; markiert eine Version jeder Datei mit dem Tag, sodass Sie beim Auslesen eines Tags immer die gleichen Versionen der Dateien bekommen. Somit ist der Unterschied zum Zweig, dass ein Tag nicht dynamisch ist: Sie können in einem Tag nicht entwickeln. Tags sind sinnvoll um Releases, große Änderungen im Code &etc; zu markieren.

source: When you are developing or following the development of a software project, you do not necessarily work with the main branch all the time. After a release, you may want to stay with the released branch for a while, to enjoy its relative stability, fix bugs, translate the sources, &etc; To do all that, you have to update to the released branch. All your files will be updated to the latest version of the files in that branch. After updating, all your new commits will be uploaded to the new branch as well.
de: Wenn Sie in einem Software-Projekt entwickeln, oder dessen Entwicklung verfolgen, arbeiten Sie nicht unbedingt die ganze Zeit im Hauptzweig. Nach einem Release könnten Sie in dem Release-Zweig bleiben wollen, um ein stabiles System zu haben, Fehler zu korrigieren, die Quellen zu übersetzen &etc; Um das zu tun, müssen Sie auf den Release-Zweig aktualisieren. Alle Ihre Dateien werden auf die letzte Version des Release-Zweiges aktualisiert. Nach der Aktualisierung werden auch alle Ihre Commits in den Release-Zweig eingespielt.

source: Also, if you want to track a bug that was reported against a past tagged release, &CVS; offers you the possibility to retrieve the software as it was released, by updating to that tag. Besides, if you want to fetch a past version of your project, you can update your working copy to a specific date. This may be useful if an error was introduced in the project between two releases, and you have an opinion on when that was. When you update to a date or tag, the versions of your files will be the same as the versions in that specific date or the versions stamped by that tag.
de: Auch wenn Sie einen Fehler nachvollziehen möchten, der in einer älteren Version gemeldet wurde, können Sie mit &CVS; die Version des Releases beziehen, indem Sie auf dieses Tag aktualisieren. Zudem können Sie auf eine beliebige ältere Version aktualisieren, indem Sie das Datum angeben. Das ist nützlich, wenn es zwischen zwei Releases einen Fehler gab, von dem Sie ungefähr wissen, wann er auftrat. Wenn Sie auf ein Datum oder ein Tag aktualisieren, werden Ihre Dateien sein wie die an dem bestimmten Datum oder wie die Versionen, die mit dem Tag markiert sind.

source: Before updating to a different branch or tag, make sure you committed all your changes to the branch you are working with. If your are not ready to commit your changes, but do not want to discard them, do not update to the new branch, as you may lose your changes. As an alternative, you can do a new <link linkend="checkingout">checkout</link>, to work in parallel with both versions.
de: Bevor Sie auf einen anderen Zweig oder ein Tag aktualisieren, versichern Sie sich, dass Sie alle Änderungen, die für den aktuellen Zweig gedacht sind, eingespielt haben. Sollten die Änderungen noch nicht bereit zum Einspielen sein, aber auch nicht verworfen werden, aktualisieren Sie nicht auf den neuen Zweig, da Sie sonst Ihre Änderungen verlieren. Alternativ können Sie in einen anderen Ordner <link linkend="checkingout">auschecken</link> und parallel an zwei Versionen arbeiten.

source: <title>A screenshot of &cervisia;'s update to tag dialog</title>
de: <title>Ein Bildschirmfoto des Dialogs <quote>CVS aktualisieren</quote></title>

source: <phrase>A screenshot of &cervisia;'s update to tag dialog</phrase>
de: <phrase>Ein Bildschirmfoto des Dialogs <quote>CVS aktualisieren</quote></phrase>

source: Update to branch
de: Auf Zweig aktualisieren

source: Select this option to update to a branch. Enter the name of the branch in the drop down text box (or press the <guilabel>Fetch List</guilabel> button to retrieve the list of branches from the &CVS; server, and select the one you want in the drop down list).
de: Wählen Sie dies, um auf einen Zweig zu aktualisieren. Geben Sie den Namen des Zweigs in das Kombinationsfeld ein (oder drücken Sie den Knopf <guilabel>Liste holen</guilabel> um eine Liste der Zweige vom &CVS;-Server zu beziehen, und wählen Sie den gewünschten Zweig aus dem Auswahlfeld).

source: Update to tag
de: Auf Tag aktualisieren

source: Select this option to update to a tag. Enter the name of the tag in the drop down text box (or press the <guilabel>Fetch List</guilabel> button to retrieve the list of tags from the &CVS; server, and select the one you want in the drop down list).
de: Wählen Sie dies, um auf ein Tag zu aktualisieren. Geben Sie den Namen des Tags in das Kombinationsfeld ein (oder drücken Sie den Knopf <guilabel>Liste holen</guilabel> um eine Liste der Tags vom &CVS;-Server zu beziehen, und wählen Sie das gewünschte Tag aus dem Auswahlfeld).

source: Update to date
de: Auf Datum aktualisieren

source: Select this option to update to a date. In the field below, you can enter a wide variety of date formats. One possible format is <literal>yyyy-mm-dd</literal> where <literal>yyyy</literal> is the year, <literal>mm</literal> is the month (numerically) and <literal>dd</literal> is the day. Alternatives are some English phrases like <literal>yesterday</literal> or <literal>2 weeks ago</literal>.
de: Wählen Sie dies, um auf ein Datum zu aktualisieren. In dem zugehörigen Eingabefeld können Sie ein Datum in verschiedenen Formaten eingeben. Ein mögliches Format ist <literal>yyyy-mm-dd</literal>, wobei <literal>yyyy</literal> das Jahr ist, <literal>mm</literal> der Monat (als Zahlenwert) und <literal>dd</literal> der Tag. Alternativen sind einige englische Begriffe wie <literal>yesterday</literal> oder <literal>2 weeks ago</literal>.

source: Updating to a tag or date make them 'sticky', &ie; you cannot commit further modifications on that files (unless the tag is a branch tag). In order to get back to the main branch, use the menu item <menuchoice><guimenu>Advanced</guimenu><guimenuitem>Update to HEAD</guimenuitem></menuchoice>.
de: Beide oben erwähnten Möglichkeiten bewirken, dass ein Tag oder Datum den Status <quote>sticky</quote> erhält, &ie; Sie können keine weiteren Änderungen für diese Dateien einspielen (es sei denn, es handelt sich um ein Verzweigungs-Tag). Um wieder zum Hauptzweig zurückzukehren, verwenden Sie den Menüeintrag <menuchoice><guimenu>Erweitert</guimenu> <guimenuitem>Auf HEAD aktualisieren</guimenuitem></menuchoice>.

source: The command issued to update to a branch or tag is:
de: Der Befehl zum Aktualisieren eines Zweiges oder eines Tags lautet:

source: The command issued to update to a date is:
de: Der Befehl, der zur Aktualisierung auf ein Datum abgesetzt wird, lautet:

source: <command>cvs update -D <replaceable>date</replaceable></command>
de: <command>cvs update -D <replaceable>Datum</replaceable></command>

source: The command issued to update to the main branch (HEAD) is:
de: Der Befehl, der zur Aktualisierung auf den Hauptzweig (HEAD) abgesetzt wird, lautet:

source: Tagging and Branching
de: Taggen und Verzweigen

source: We discuss here only the technical aspects of tagging and branching. If you are only a <emphasis>user</emphasis>, not the administrator of the repository, you will probably not be confronted with the problem. If however you are your own administrator, you should first read about the non-technical problems that accompany branching, in order to get an impression of how time-consuming and error-prone maintaining different branches of a project can be. The appendix includes some references about this topic.
de: Dieses Handbuch behandelt nur die technischen Aspekte von Taggen und Verzweigen. Wenn Sie nur ein <emphasis>Benutzer</emphasis> und nicht der Administrator des &CVS;-Archivs sind, werden Sie mit dieser Problematik wahrscheinlich gar nicht in Berührung kommen. Sind Sie allerdings der Administrator, sollten Sie sich, zunächst mit den nicht-technischen Problemen beschäftigen, die mit dem Verzweigen einhergehen, damit Sie sich einen Eindruck darüber verschaffen können, wie zeitaufwendig und fehleranfällig die Verwaltung mehrere Projektzweige sein kann. Im Anhang finden Sie einige Verweise auf Quellen zu diesem Thema.

source: Simple tagging is something you usually do when a release is made, so that you can at any time easily get back to the project state at that time. Tags are usually given a name consisting of the project name and the version number. For example, &cervisia; 1.0 is available under the tag <literal>CERVISIA_1_0</literal>. &cervisia; enforces &CVS;'s strict rules about what constitutes valid tag name. It must begin with a letter and may contain letters, digits, hyphens and underscores.
de: Das Taggen ist ein Vorgang, den Sie normalerweise durchführen, wenn Sie eine Version Ihrer Software freigeben. Durch das Taggen der Quelltexte können Sie später jederzeit zu genau diesem Zustand der Auslieferung zurückkehren. Tags erhalten gewöhnlich einen Namen bestehend aus dem Namen des Projekts und einer Versionsnummer. &cervisia; 1.0 ist beispielsweise unter dem Tag <literal>CERVISIA_1_0</literal> verfügbar. &cervisia; erzwingt die strikten Regeln von &CVS; betreffend der Namensgebung von Tags. Ein Tag muss mit einem Buchstaben beginnen und darf Buchstaben, Ziffern, Binde- und Unterstriche enthalten.

source: Normally, you will want to tag the whole project (although &CVS; of course allows you to tag only a subset). To this end, mark the toplevel folder in the view and choose <menuchoice><guimenu>Advanced</guimenu><guimenuitem>Tag/Branch</guimenuitem></menuchoice>. Now enter the name of the tag, press <keycap>Return</keycap> and you are done.
de: Normalerweise möchten Sie das ganze Projekt taggen (wobei &CVS; natürlich auch das Taggen von Teilen des Projektes unterstützt). Dazu markieren Sie den Hauptordner des Projektes und wählen <menuchoice><guimenu>Erweitert</guimenu><guimenuitem>Tag setzen/verzweigen</guimenuitem></menuchoice>. Geben Sie nun den Namen des Tags ein und drücken Sie <keycap>Eingabe</keycap>. Fertig.

source: Creating a branch is not significantly more difficult: In the tag dialog, check the box <guibutton>Create branch with this tag</guibutton>. You can also delete an existing tag: Choose <menuchoice><guimenu>Advanced</guimenu><guimenuitem>Delete Tag</guimenuitem></menuchoice> in the main view.
de: Das Anlegen einer Verzweigung ist nicht wesentlich schwerer. Im Tag-Dialog markieren Sie das Ankreuzfeld <guibutton>Verzweigung mit diesem Tag anlegen</guibutton>. Genauso gut können Sie ein existierendes Tag löschen. Wählen Sie <menuchoice><guimenu>Erweitert</guimenu><guimenuitem>Tag löschen</guimenuitem></menuchoice> in der Hauptansicht.

source: Another aspect of branching is the merging of modifications from a branch to the current branch. If you are going to do this, choose <menuchoice><guimenu>Advanced</guimenu><guimenuitem>Merge...</guimenuitem></menuchoice>. The dialog that appears now gives you two options:
de: Ein weiterer Aspekt des Verzweigens ist die Zusammenführung von Änderungen aus einem Zweig in den aktuellen Zweig. Hierzu rufen Sie <menuchoice><guimenu>Erweitert</guimenu><guimenuitem>Zusammenführen ...</guimenuitem></menuchoice> auf. Der erscheinende Dialog bietet Ihnen zwei Optionen:

source: Either you may merge all modifications done on a branch to the current branch. In that case, check the box <guibutton>Merge from branch</guibutton> and fill in the branch you want to merge from. &cervisia; will then execute the command
de: In dem einen Fall möchten Sie alle Änderungen, die sie in einem Zweig durchgeführt haben, in den aktuellen Zweig einpflegen. In diesem Fall markieren Sie das Ankreuzfeld <guibutton>Aus Zweig zusammenführen</guibutton> und geben den Zweig an, von dem Sie die Änderungen einpflegen wollen. &cervisia; führt daraufhin den folgende Befehl aus:

source: <command>cvs update <option>-j</option> <replaceable>branchtag</replaceable></command>
de: <command>cvs update <option>-j</option> <replaceable>Verzweigungs-Tag</replaceable></command>

source: The other possibility is that you want to merge only the modifications made between two tags on a branch. This usually happens when you merge from the same branch to the trunk several times. In that case, check the box <guibutton>Merge modifications</guibutton> and enter (in the correct order) the two relevant tags. This will result in a command
de: Die andere Möglichkeit besteht darin, dass Sie nur die Änderungen zusammenführen möchten, die zwischen zwei Tags in einem Zweig durchgeführt wurden. Das geschieht normalerweise, wenn sie mehrmals aus demselben Zweig in den HEAD-Zweig einpflegen wollen. In diesem Fall markieren Sie das Ankreuzfeld <guibutton>Änderungen zusammenführen</guibutton> und geben die beiden Tags in der richtigen Reihenfolge ein. Hierauf wird folgendes ausgeführt:

source: <command>cvs update <option>-j</option> <replaceable>branchtag1</replaceable> <option>-j</option> <replaceable>branchtag2</replaceable></command>
de: <command>cvs update <option>-j</option> <replaceable>Verzweigungs-Tag1</replaceable> <option>-j</option> <replaceable>Verzweigungs-Tag2</replaceable></command>

source: Using Watches
de: Überwachen

source: A watch is the conventional name for &CVS;'s feature to notify users of the repository whenever a file has been changed or a developer has started editing a file. The usage of watches requires that the file <filename><envar>$CVSROOT</envar>/CVSROOT/notify</filename> has been set up properly. This is not discussed here; if you need further information on the setup from the administrator's point of view, read one of the books listed in the appendix.
de: Eine Überwachung ist die übliche Bezeichnung für die Fähigkeit von &CVS; die Benutzer zu benachrichtigen, wenn eine Datei geändert wurde oder ein anderer Entwickler mit deren Bearbeitung begonnen hat. Die Verwendung von Überwachungen setzt voraus, dass die Datei <filename><envar>$CVSROOT</envar>/CVSROOT/notify</filename> entsprechend eingerichtet wurde. Dieses Thema wird hier nicht weiter behandelt. Wenn Sie weitergehende Informationen benötigen, finden Sie diese in den im Anhang erwähnten Büchern.
