Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdesdk/cervisia.po
Languages: de

source: Opens all branches in the file tree so that you can see all files and folders. See <xref linkend="mainscreen"/>.
de: Öffnet alle Verzweigungen des Dateibaums, sodass Sie alle Dateien und Ordner sehen können. Siehe <xref linkend="mainscreen"/>.

source: <guimenu>View</guimenu><guimenuitem>Fold File Tree</guimenuitem>
de: <guimenu>Anzeigen</guimenu><guimenuitem>Dateibaum einklappen</guimenuitem>

source: Closes all branches in the file tree. See <xref linkend="mainscreen"/>.
de: Klappt alle Verzweigungen im Dateibaum ein. Siehe <xref linkend="mainscreen"/>.

source: The Advanced Menu
de: Das Menü Erweitert

source: <guimenu>Advanced</guimenu><guimenuitem>Tag/Branch...</guimenuitem>
de: <guimenu>Erweitert</guimenu><guimenuitem>Tag setzen/verzweigen ...</guimenuitem>

source: Tags or branches the selected files. See <xref linkend="taggingbranching"/>.
de: Setzt ein Tag oder verzweigt die ausgewählten Dateien. Siehe <xref linkend="taggingbranching"/>.

source: <guimenu>Advanced</guimenu><guimenuitem>Delete Tag...</guimenuitem>
de: <guimenu>Erweitert</guimenu><guimenuitem>Tag löschen ...</guimenuitem>

source: Removes a given tag from the selected files. See <xref linkend="taggingbranching"/>.
de: Entfernt das angegebene Tag von den ausgewählten Dateien. Siehe <xref linkend="taggingbranching"/>.

source: <guimenu>Advanced</guimenu><guimenuitem>Update to Tag/Date...</guimenuitem>
de: <guimenu>Erweitert</guimenu><guimenuitem>Auf Tag/Datum aktualisieren ...</guimenuitem>

source: Brings the selected files to a given tag or date, making it sticky. See <xref linkend="updatingto"/>.
de: Setzt die ausgewählten Dateien dauerhaft auf das angegebene Tag oder Datum. Siehe <xref linkend="updatingto"/>.

source: <guimenu>Advanced</guimenu><guimenuitem>Update to HEAD...</guimenuitem>
de: <guimenu>Erweitert</guimenu><guimenuitem>Auf HEAD aktualisieren ...</guimenuitem>

source: Brings the selected files to the respective HEAD revision. See <xref linkend="updatingto"/>.
de: Setzt die ausgewählten Dateien auf die entsprechende HEAD-Revision. Siehe <xref linkend="updatingto"/>.

source: <guimenu>Advanced</guimenu><guimenuitem>Merge...</guimenuitem>
de: <guimenu>Erweitert</guimenu><guimenuitem>Zusammenführen ...</guimenuitem>

source: Merges either a given branch or the modifications between two tags into the selected files. See <xref linkend="taggingbranching"/>.
de: Führt entweder die angegebene Verzweigung oder die Unterschiede zwischen zwei Tags mit den ausgewählten Dateien zusammen. Siehe <xref linkend="taggingbranching"/>.

source: <guimenu>Advanced</guimenu><guimenuitem>Add Watch...</guimenuitem>
de: <guimenu>Erweitert</guimenu><guimenuitem>Status „Überwachen“ setzen ...</guimenuitem>

source: Adds a watch for a set of events on the selected files. See <xref linkend="watches"/>.
de: Setzt für die ausgewählten Dateien eine Überwachung für bestimmte Ereignisse. Siehe <xref linkend="watches"/>.

source: <guimenu>Advanced</guimenu><guimenuitem>Remove Watch...</guimenuitem>
de: <guimenu>Erweitert</guimenu><guimenuitem>Status „Überwachen“ entfernen ...</guimenuitem>

source: Removes a watch for a set of events from the selected files. See <xref linkend="watches"/>.
de: Entfernt eine Überwachung für bestimmte Ereignisse von den ausgewählten Dateien. Siehe <xref linkend="watches"/>.

source: <guimenu>Advanced</guimenu><guimenuitem>Show Watchers</guimenuitem>
de: <guimenu>Erweitert</guimenu><guimenuitem>Überwacher anzeigen</guimenuitem>

source: Lists the watchers of the selected files. See <xref linkend="watches"/>.
de: Zeigt eine Liste der Überwacher der ausgewählten Dateien an. Siehe <xref linkend="watches"/>.

source: <guimenu>Advanced</guimenu><guimenuitem>Edit Files</guimenuitem>
de: <guimenu>Erweitert</guimenu><guimenuitem>Dateien bearbeiten</guimenuitem>

source: Runs <command>cvs edit</command> on the selected files. See <xref linkend="watches"/>.
de: Führt den Befehl <command>cvs edit</command> für die ausgewählten Dateien aus. Siehe <xref linkend="watches"/>.

source: <guimenu>Advanced</guimenu><guimenuitem>Unedit Files</guimenuitem>
de: <guimenu>Erweitert</guimenu><guimenuitem>Status „In Bearbeitung“ zurücknehmen</guimenuitem>

source: Runs <command>cvs unedit</command> on the selected files. See <xref linkend="watches"/>.
de: Führt den Befehl <command>cvs unedit</command> für die ausgewählten Dateien aus. Siehe <xref linkend="watches"/>.

source: <guimenu>Advanced</guimenu><guimenuitem>Show Editors</guimenuitem>
de: <guimenu>Erweitert</guimenu><guimenuitem>Bearbeiter anzeigen</guimenuitem>

source: Runs <command>cvs editors</command> on the selected files. See <xref linkend="watches"/>.
de: Führt den Befehl <command>cvs editors</command> für die ausgewählten Dateien aus. Siehe <xref linkend="watches"/>.

source: <guimenu>Advanced</guimenu><guimenuitem>Lock Files</guimenuitem>
de: <guimenu>Erweitert</guimenu><guimenuitem>Datei sperren</guimenuitem>

source: Locks the selected files. See <xref linkend="locking"/>.
de: Sperrt die ausgewählten Dateien. Siehe <xref linkend="locking"/>.

source: <guimenu>Advanced</guimenu><guimenuitem>Unlock Files</guimenuitem>
de: <guimenu>Erweitert</guimenu><guimenuitem>Dateien freigeben</guimenuitem>

source: Unlocks the selected files. See <xref linkend="locking"/>.
de: Gibt die ausgewählten Dateien frei. Siehe <xref linkend="locking"/>.

source: <guimenu>Advanced</guimenu><guimenuitem>Create Patch Against Repository...</guimenuitem>
de: <guimenu>Erweitert</guimenu> <guimenuitem>Patch gegen das &CVS;-Archiv erstellen ...</guimenuitem>

source: Creates a patch from the modifications in your sandbox. See <xref linkend="creatingpatches"/>.
de: Erstellt einen Patch aus den Änderungen in Ihrem Arbeitsordner. Siehe <xref linkend="creatingpatches"/>.

source: The Repository Menu
de: Das Menü Archiv

source: <guimenu>Repository</guimenu><guimenuitem>Create...</guimenuitem>
de: <guimenu>Archiv</guimenu><guimenuitem>Herunterladen ...</guimenuitem>

source: Opens a dialog which allows you to create a new local repository. See <xref linkend="accessing-repository"/>.
de: Öffnet einen Dialog, der das Erstellen eines neuen lokalen &CVS;-Archivs ermöglicht. Siehe <xref linkend="accessing-repository"/>.

source: <guimenu>Repository</guimenu><guimenuitem>Checkout...</guimenuitem>
de: <guimenu>Archiv</guimenu><guimenuitem>Herunterladen ...</guimenuitem>

source: Opens a dialog which allows you to checkout a module from a repository. See <xref linkend="checkingout"/>.
de: Öffnet einen Dialog, der das Herunterladen eines Moduls aus einem &CVS;-Archiv ermöglicht. Siehe <xref linkend="checkingout"/>.

source: <guimenu>Repository</guimenu><guimenuitem>Import...</guimenuitem>
de: <guimenu>Archiv</guimenu><guimenuitem>Importieren ...</guimenuitem>

source: Opens a dialog which allows you to import a package into the repository. See <xref linkend="importing"/>.
de: Öffnet einen Dialog, der das Importieren eines Softwarepakets in das &CVS;-Archiv ermöglicht. Siehe <xref linkend="importing"/>.

source: <guimenu>Repository</guimenu><guimenuitem>Repositories...</guimenuitem>
de: <guimenu>Archiv</guimenu><guimenuitem>Archive ...</guimenuitem>

source: Configures a list of repositories you often use and how to access them. See <xref linkend="accessing-repository"/>.
de: Dieser Dialog erlaubt die Konfiguration von &CVS;-Archiven, auf die Sie häufig zugreifen. Siehe <xref linkend="accessing-repository"/>.

source: The Settings Menu
de: Das Menü Einstellungen

source: <guimenu>Settings</guimenu><guimenuitem>Show Toolbar</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>Werkzeugleiste anzeigen</guimenuitem>

source: Determines whether the toolbar is displayed.
de: Gibt an, ob die Werkzeugleiste angezeigt wird.

source: <guimenu>Settings</guimenu><guimenuitem>Create Folders on Update</guimenuitem>
de: <guimenu>Einstellungen</guimenu><guimenuitem>Beim Aktualisieren fehlende Ordner anlegen</guimenuitem>

source: Determines whether updates create folders in the sandbox which were not there before (Option <option>-d</option> to <command>cvs update</command>).
de: Legt fest, ob im Arbeitsordner noch nicht vorhandene Ordner automatisch angelegt werden. (Option <option>-d</option> für <command>cvs update</command>).

source: <guimenu>Settings</guimenu><guimenuitem>Prune Empty Folders on Update</guimenuitem>
de: <guimenu>Einstellungen</guimenu><guimenuitem>Leere Ordner beim Aktualisieren entfernen</guimenuitem>

source: Determines whether updates remove empty folders in the sandbox. (Option <option>-P</option> to <command>cvs update</command>).
de: Legt fest, ob leere Ordner beim Aktualisieren aus dem Arbeitsordner gelöscht werden. (Option <option>-P</option> für <command>cvs update</command>).

source: <guimenu>Settings</guimenu><guimenuitem>Update Recursively</guimenuitem>
de: <guimenu>Einstellungen</guimenu><guimenuitem>Unterordner beim Aktualisieren einbeziehen</guimenuitem>

source: Determines whether updates are recursive (Option <option>-r</option> to <command>cvs update</command>).
de: Legt fest, ob beim Aktualisieren Unterordner mit einbezogen werden sollen. (Option <option>-r</option> für <command>cvs update</command>).

source: <guimenu>Settings</guimenu><guimenuitem>Commit &amp; Remove Recursively</guimenuitem>
de: <guimenu>Einstellungen</guimenu><guimenuitem>Unterordner beim Einspielen und Entfernen einbeziehen</guimenuitem>

source: Determines whether commits and removes are recursive (Option <option>-r</option> to <command>cvs add</command>, <command>cvs remove</command> resp.).
de: Legt fest, ob beim Einspielen und Entfernen Unterordner mit einbezogen werden sollen. (Option <option>-r</option> für <command>cvs add</command>, bzw. <command>cvs remove</command>).

source: <guimenu>Settings</guimenu><guimenuitem>Do cvs edit Automatically When Necessary</guimenuitem>
de: <guimenu>Einstellungen</guimenu><guimenuitem>Bei Bedarf automatisch Status "In Bearbeitung" setzen.</guimenuitem>

source: Determines whether <command>cvs edit</command> is executed automatically whenever you edit a file.
de: Legt fest, ob beim Bearbeiten einer Datei automatisch der Befehl <command>cvs edit</command> ausgeführt wird.

source: <guimenu>Settings</guimenu><guimenuitem>Configure Shortcuts...</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>Kurzbefehle festlegen ...</guimenuitem>

source: Opens a dialog for configuring shortcuts.
de: Öffnet einen Dialog zum Festlegen der Kurzbefehle.

source: <guimenu>Settings</guimenu><guimenuitem>Configure Toolbars...</guimenuitem>
de: <guimenu>Einstellungen</guimenu><guimenuitem>Werkzeugleisten einrichten ...</guimenuitem>

source: Opens a dialog for configuring &cervisia;'s toolbars.
de: Öffnet einen Dialog zur Einrichtung der Werkzeugleisten in &cervisia;.

source: <guimenu>Settings</guimenu><guimenuitem>Configure &cervisia;...</guimenuitem>
de: <guimenu>Einstellungen</guimenu><guimenuitem>&cervisia; einrichten ...</guimenuitem>

source: Opens a dialog for customizing &cervisia;.
de: Öffnet einen Dialog zur Einrichtung von &cervisia;.

source: The Help Menu
de: Das Menü Hilfe

source: Apart from the standard &kde; <guimenu>Help</guimenu> menu items described above you will have this additional menu entry:
de: Zusätzlich zu den oben beschriebenen Standardeinträgen des &kde;-Menüs <guimenu>Hilfe</guimenu> gibt es folgende Menüeinträge:

source: <guimenu>Help</guimenu><guimenuitem>CVS Manual</guimenuitem>
de: <guimenu>Hilfe</guimenu><guimenuitem>CVS-Handbuch</guimenuitem>

source: Opens the &CVS; info pages in the &kde; help system.
de: Öffnet die Info-Seiten zu &CVS; im &kde;-Hilfesystem.

source: Credits And License
de: Danksagungen und Lizenz

source: Program copyright
de: Copyright des Programms

source: 2002-2008 the &cervisia; authors
de: 2002-2008 Die &cervisia;-Autoren

source: Documentation Copyright 1999-2002 &Bernd.Gehrmann; &Bernd.Gehrmann.mail; and 2004 Carlos Woelz carloswoelz@imap-mail.com
de: Dokumentation Copyright 1999-2002 &Bernd.Gehrmann; &Bernd.Gehrmann.mail; und 2004 Carlos Woelz carloswoelz@imap-mail.com

source: CREDIT_FOR_TRANSLATORS
de: <para>Übersetzung Stephan Johach <email>hunsum@gmx.de</email></para>
