Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdesdk/cervisia.po
Languages: de

source: <phrase>A screenshot of &cervisia;'s main view</phrase>
de: <phrase>Ein Bildschirmfoto von &cervisia;s Hauptansicht</phrase>

source: The commands in the File menu usually act only on the files which you have marked. You may also mark folders. Now choose <menuchoice> <guimenu>File</guimenu> <guimenuitem>Status</guimenuitem> </menuchoice> or press <keycap>F5</keycap>. &cervisia; issues a
de: Die Befehle im Dateimenü beziehen sich nur auf die gerade markierten Dateien. Sie können ebenso Ordner markieren. Wählen Sie nun <menuchoice><guimenu>Datei</guimenu><guimenuitem>Status</guimenuitem></menuchoice> oder drücken Sie <keycap>F5</keycap>&cervisia; setzt folgenden Befehl ab:

source: <command>cvs update -n <replaceable>file names</replaceable></command>
de: <command>cvs update -n <replaceable>Dateinamen</replaceable></command>

source: command to get status information for the marked files. Note that &cervisia; goes recursively into subfolders only if you have the according option in the <guimenu>Settings</guimenu> menu set. According to the respective file's status, you now see an entry in the <guilabel>Status</guilabel> column:
de: um den Status der markieren Dateien abzufragen. Beachten Sie, dass &cervisia; Unterordner nur dann einbezieht, wenn Sie diese Einstellung unter <guimenu>Einstellungen</guimenu> markiert haben. Nach Ausführung des Befehls sehen Sie nun den aktuellen Status der Datei(en) in der Spalte <guilabel>Status</guilabel>:

source: Locally Modified
de: Lokal geändert

source: This means you have modified the file compared to the version in the repository.
de: Das bedeutet, Ihre lokale Arbeitskopie der Datei wurde gegenüber dem Original im &CVS;-Archiv geändert.

source: Locally Added
de: Lokal hinzugefügt

source: This means the file does not exist in the repository, but in your working copy and you have scheduled it for addition. The actual insertion into the repository only happens after a commit.
de: Das bedeutet, die Datei existiert noch nicht im &CVS;-Archiv, aber sie wurde bereits in Ihrem Arbeitsordner für das Hinzufügen vorbereitet. Die Datei wird erst beim Einspielen dem &CVS;-Archiv hinzugefügt.

source: Locally Removed
de: Lokal entfernt

source: This means you have scheduled the file for removal, but it still exists in the repository. The actual removal happens only after a commit.
de: Das bedeutet, dass Sie die Datei für das Entfernen aus dem &CVS;-Archiv vorbereitet haben. Die Datei wird aber erst beim nächsten Einspielen aus dem &CVS;-Archiv entfernt.

source: Needs Update
de: Aktualisierung erforderlich

source: This is shown if a newer version of the file exists in the repository, &eg; because someone committed a modification. Normally, you want to update this file so you have an up-to-date version in your folder.
de: Dieser Status wird angezeigt, wenn im &CVS;-Archiv eine neuere Version der Datei vorliegt, beispielsweise weil jemand zwischenzeitlich eine Änderung eingespielt hat. Üblicherweise möchten Sie eine solche Datei aktualisieren, damit Sie die neueste Version in Ihrem Arbeitsordner vorliegen haben.

source: Needs Patch
de: Patch erforderlich

source: This is essentially the same as before; the difference is that in case of an update, the &CVS; server transfers only a patch instead of the whole file to you.
de: Dies ist im Wesentlichen dasselbe wie der zuvor erwähnte Status <quote>Aktualisierung erforderlich</quote>, mit dem Unterschied, dass der &CVS;-Server beim Aktualisieren der lokalen Kopie nicht die ganze Datei ersetzt, sondern diese mit den Änderungen versieht (&ie; einen Patch schickt).

source: Needs Merge
de: Zusammenführung erforderlich

source: Indicates that a merge of the revision of this file in your working copy with the version in the repository is necessary. This typically happens if you have made modifications to the file while someone else has committed his modifications. If you choose to update, the modifications in the repository are merged into your file. In case of a conflict (&ie; if someone else has changed some of the same lines like you) the new status is then "Conflict".
de: Dieser Zustand zeigt an, dass eine Zusammenführung der Version im &CVS;-Archiv mit Ihrer lokalen Kopie erforderlich ist. Dies tritt normalerweise dann auf, wenn Sie lokal Änderungen durchgeführt haben und jemand anders seinerseits Änderungen im &CVS;-Archiv eingespielt hat. Beim nächsten Aktualisieren werden die Änderungen im &CVS;-Archiv mit den lokalen Änderungen zusammengeführt. Treten hierbei Konflikte auf, beispielsweise wenn die lokalen Änderungen dieselben Zeilen betreffen wie die Änderungen im &CVS;-Archiv, erhält die Datei den Status <quote>Konflikt</quote>.

source: Up to Date
de: Aktuell

source: Indicates that the file is identical with the version in the repository.
de: Dieser Status zeigt an, dass Ihre lokale Kopie mit der Version im &CVS;-Archiv identisch ist.

source: Conflict
de: Konflikt

source: This is shown if this file still has conflict markers in it. Maybe you have previously updated the file and not resolved the conflicts.
de: Dieser Zustand wird angezeigt, wenn die Datei Konflikt-Markierungen enthält, die durch Zusammenführen einer geänderten lokalen Kopie mit einer aktuelleren Version aus dem &CVS;-Archiv zustande gekommen sind.

source: Not In CVS
de: Nicht im CVS

source: Indicates that the file is not registered in the &CVS; repository. If you want it to available for others, you should add it to the repository. If not, you may consider adding it to your <filename>.cvsignore</filename> file.
de: Dieser Status zeigt an, dass die betreffende Datei nicht im &CVS;-Archiv verwaltet wird. Wollen Sie diese Datei anderen zur Verfügung stellen, sollten Sie sie zum &CVS;-Archiv hinzufügen. Falls das nicht der Fall ist, können Sie die Datei in die <filename>.cvsignore</filename> eintragen.

source: Now that you have got an overview of the current status of the &CVS;, you may want to do an update. Mark some files (or the root of the folder tree which is equivalent to marking all files in this folder). Now choose <menuchoice> <guimenu>File</guimenu> <guimenuitem>Update</guimenuitem> </menuchoice> (Of course, you could have chosen this at the beginning of the session). For some of the files the status may change now. Typically, files which had "Needs Patch" or "Needs Update" are updated. So the following new items are possible in the status column:
de: Jetzt, da Sie einen Überblick über den Zustand des &CVS;-Archivs gewonnen haben, möchten Sie vielleicht Ihren Arbeitsordner aktualisieren. Markieren Sie einige Dateien (oder das Wurzelverzeichnis, was dem Markieren aller darin enthaltenen Dateien entspricht) und wählen Sie <menuchoice><guimenu>Datei</guimenu><guimenuitem>Aktualisieren</guimenuitem></menuchoice> (Dies könnte natürlich zu Beginn einer Sitzung getan werden). Möglicherweise ändert sich nun der Status einiger Dateien. Normalerweise werden Dateien mit dem Status <quote>Patch erforderlich</quote> oder <quote>Aktualisieren erforderlich</quote> aktualisiert. Nach diesem Vorgang sind in der Status-Spalte folgende neuen Einträge möglich:

source: Updated
de: Aktualisiert

source: Shown if the file was updated from the repository.
de: Dieser Status wird angezeigt, wenn die Datei aus dem &CVS;-Archiv aktualisiert wurde.

source: Patched
de: Gepatcht

source: Indicates that the &CVS; server has sent a patch for this file and the patch has been successfully applied. If the patch was not successful because there was a conflict between your modifications and those someone else committed to the repository, the status is now <guilabel>Conflict</guilabel>.
de: Dieser Status zeigt an, dass der &CVS;-Server diese Datei erfolgreich mit einem Patch aktualisiert hat. Traten bei diesem Vorgang Konflikte zwischen Ihren Änderungen und den Änderungen im &CVS;-Archiv auf, hat die Datei nun den Status <quote>Konflikt</quote>.

source: You may have noticed that according to the status of the file, its row has a different color. The colors are chosen to somehow reflect the priority of the status. For example, a file with a conflict is marked red to show you that you have to resolve a conflict before you can continue working with the file. If your folder contains a high number of files, you may nevertheless lose the overview. To get more concise information about which files have an unusual status, simply click on the header of the <guilabel>Status</guilabel> column. The file list is then sorted by priority, so you have all important information at the top of the list. To get back to the alphabetically sorted view, click on the header of the <guilabel>File name</guilabel> column.
de: Ihnen wird aufgefallen sein, dass der Eintrag einer Datei in der Hauptansicht entsprechend Ihrem Status eingefärbt wird. Die Farben sollen gewissermaßen die Priorität des Status wiedergeben. Eine Datei mit dem Status <quote>Konflikt</quote> wird beispielsweise rot markiert, um anzuzeigen, dass Sie diesen Konflikt erst auflösen müssen, bevor Sie mit dieser Datei arbeiten können. Nichtsdestotrotz können Sie bei einer Vielzahl von Dateien im Arbeitsordner schnell den Überblick verlieren. Um eine bessere Übersicht darüber zu gewinnen, welche Dateien einen ungewöhnlichen Status aufweisen, reicht ein Klick auf die Überschrift der Spalte <guilabel>Status</guilabel>. Die Dateiliste wird nun nach der Priorität der Status sortiert, sodass die wichtigsten Informationen zu Anfang der Liste stehen. Um wieder die normale Sortierung zu erhalten, klicken Sie auf die Überschrift der Spalte <guilabel>Dateiname</guilabel>.

source: Working With Files
de: Arbeiten mit Dateien

source: All commonly used &CVS; functionality is directly available in &cervisia;'s main view. Commands usually act on several files at once, namely all which currently selected. If the selection includes folders, its interpretation depends on the settings made under the <guimenu>Settings</guimenu> menu. For example, if <menuchoice><guimenu>Settings</guimenu><guimenuitem>Commit &amp; Remove Recursively</guimenuitem></menuchoice> is checked and you choose <menuchoice><guimenu>File</guimenu><guimenuitem>Commit...</guimenuitem></menuchoice> while a folder is selected, then all files in the tree under that folder are committed. Otherwise, only the regular files in the folder itself are affected.
de: Die am häufigsten verwendeten &CVS;-Funktionalitäten sind direkt in der Hauptansicht von &cervisia; verfügbar. Befehle wirken sich normalerweise auf mehrere Dateien gleichzeitig aus, nämlich auf die gerade markierten. Werden Ordner markiert, wirkt sich dies abhängig von den unter <guimenu>Einstellungen</guimenu> eingestellten Optionen aus. Ist dort beispielsweise die Option <menuchoice><guimenu>Einstellungen</guimenu> <guimenuitem>Unterordner beim Einspielen und Entfernen einbeziehen</guimenuitem> </menuchoice> markiert, werden bei Auswahl von <menuchoice><guimenu>Datei</guimenu> <guimenuitem>Einspielen ...</guimenuitem></menuchoice> alle Dateien in den markierten Ordnern eingespielt. Anderenfalls wird der Befehl nur auf die im aktuellen Ordner befindlichen Dateien angewandt.

source: A screenshot of &cervisia;'s context menu
de: Ein Bildschirmfoto des Kontextmenüs von &cervisia;

source: The most used actions are also available by right clicking the files in the tree view, through the context menu. <xref linkend="screenshot-popup"/> shows &cervisia;'s main window context menu.
de: Auch im Kontextmenü, das Sie über einen Rechtsklick auf Dateien erreichen, finden Sie die am häufigsten verwendeten Funktionen. <xref linkend="screenshot-popup"/> zeigt das Kontextmenü des Hauptfensters.

source: You can simply edit a file by double-clicking on it or selecting it and pressing &Enter;. This starts the default application that handles that file type (the default application for each file type is a &kde; wide setting). If the default application is not the one you want to use, you can right click the file and choose the <menuchoice> <guisubmenu>Edit With</guisubmenu> </menuchoice> submenu, and select one of the other applications that handle that file type.
de: Sie können eine Datei bearbeiten, indem Sie auf diese Doppelklicken, oder indem Sie sie markieren und &Enter; drücken. Es wird die Anwendung gestartet, die dem Dateityp zugeordnet ist (die Zuordnung erfolgt &kde;-weit). Möchten Sie die Datei nicht mit der, ihr zugeordneten Anwendung starten, können Sie im Kontextmenü das Untermenü <menuchoice><guisubmenu>Bearbeiten mit</guisubmenu></menuchoice> wählen und eine der anderen Anwendungen verwenden.

source: Adding Files
de: Hinzufügen von Dateien

source: Adding files to a project requires two steps: first, the files must be registered with &CVS;, or in other words, <emphasis>added to the repository</emphasis>. This is necessary, but not sufficient. In order to actually put the files into the repository, you must <emphasis>commit</emphasis> them. This procedure has an important advantage: you can commit the files together with modifications to other parts of the project. When doing this, one can easily see (&eg; in commit emails) that all these changes are part of a whole.
de: Das Hinzufügen von Dateien zu einem Projekt bedarf zweier Schritte: Zuerst müssen die Dateien in &CVS; registriert, mit anderen Worten <emphasis>dem Archiv hinzugefügt</emphasis> werden. Das ist notwendig, aber noch nicht alles. Damit die Dateien tatsächlich in das &CVS;-Archiv gelangen, müssen Sie die hinzugefügten Dateien <emphasis>einspielen</emphasis>. Diese Vorgehensweise hat den Vorteil, dass Sie die hinzugefügten Dateien zusammen mit anderen lokal vorgenommenen Änderungen in das &CVS;-Archiv einspielen können. Sie können beispielsweise in einer versandten <quote>Einspiel-Benachrichtigung</quote> leicht nachvollziehen, dass alle diese Änderungen in einem Arbeitsschritt durchgeführt wurden.

source: To this end, mark all files to be added in &cervisia;'s main view. Then, choose <menuchoice><guimenu>File</guimenu><guimenuitem>Add to Repository...</guimenuitem></menuchoice>, or right click the marked files and choose <guimenuitem>Add to Repository...</guimenuitem>. The <guilabel>CVS Add</guilabel> dialog will appear, listing the files you marked, and asks for confirmation. Press <guibutton>OK</guibutton>.
de: Markieren Sie in der Hauptansicht von &cervisia; alle Dateien, die Sie hinzufügen möchten. Wählen Sie nun <menuchoice><guimenu>Datei</guimenu><guimenuitem>Zum CVS-Archiv hinzufügen ...</guimenuitem></menuchoice>, oder klicken Sie mit der rechten Maustaste auf eine der markierten Dateien und wählen <guimenuitem>Zum CVS-Archiv hinzufügen</guimenuitem>. Der Dialog <guilabel>Zu CVS hinzufügen (add)</guilabel> erscheint und zeigt eine Liste der ausgewählten Dateien. Bestätigen Sie diesen mit <guibutton>OK</guibutton>.

source: &cervisia; issues a command
de: &cervisia; setzt folgenden Befehl ab:

source: <command>cvs add <replaceable>file names</replaceable></command>
de: <command>cvs add <replaceable>Dateinamen</replaceable></command>

source: If the operation was successful, the status column should have "Added to repository" for the added files.
de: Nach erfolgreicher Durchführung des Befehls, sollte in der Status-Spalte für die betreffenden Dateien der Eintrag <quote>Zum &CVS;-Archiv hinzugefügt</quote> erscheinen.

source: &CVS; is not designed to provide meaningful revision control for binary files. For example, merging binary files normally does not make sense. Furthermore, by default &CVS; performs keyword expansion (&eg; on the string <literal>&dollar;Revision: 1.6 &dollar;</literal>) when a file is committed. In binary files, such replacements may corrupt the file and make it completely unusable.
de: &CVS; ist nicht auf eine Versionsverwaltung für Binärdateien ausgerichtet. So ergibt beispielsweise das Zusammenführen von Binärdateien keinen Sinn. Darüberhinaus führt &CVS; in der Standardkonfiguration eine automatische Ersetzung von Schlüsselwörtern durch (&eg; während des Einspielens bei einem Eintrag der Form <literal>&dollar;Revision: 1.6 &dollar;</literal>). Bei Binärdateien kann die Ersetzung solcher Zeichenketten zur Zerstörung der Datei führen.

source: In order to switch the above behavior off, you should commit binary files (or other files, like Postscript or PNG images) by choosing <menuchoice><guimenu>File</guimenu><guimenuitem>Add Binary...</guimenuitem></menuchoice>. The <guilabel>CVS Add</guilabel> dialog will appear, listing the binary files you marked, and asks for confirmation. Press <guibutton>OK</guibutton>.
de: Damit dieses Verhalten unterdrückt wird, sollten Sie zum Einspielen von Binärdateien (oder anderen Dateien etwa Postscript oder PNG-Bildern) <menuchoice><guimenu>Datei</guimenu><guimenuitem>Binärdatei hinzufügen ...</guimenuitem></menuchoice> wählen. Der Dialog <guilabel>CVS Binärdateien hinzufügen</guilabel> erscheint und zeigt eine Liste der ausgewählten Dateien. Bestätigen Sie diesen mit <guibutton>OK</guibutton>.

source: <command>cvs add -kb <replaceable>file names</replaceable></command>
de: <command>cvs add -kb <replaceable>Dateinamen</replaceable></command>

source: Removing Files
de: Entfernen von Dateien

source: Like adding files, removing files is done in two steps: First, the files have to be registered as removed by choosing <menuchoice><guimenu>File</guimenu><guimenuitem>Remove From Repository...</guimenuitem></menuchoice> or right clicking the marked files and choosing <guimenuitem>Remove From Repository...</guimenuitem> from the context menu. The <guilabel>CVS Remove</guilabel> dialog will appear, listing the files you marked, and asking for confirmation. Press <guibutton>OK</guibutton>. &cervisia; issues the command
de: Das Entfernen von Dateien erfolgt, genau wie das Hinzufügen, in zwei Schritten: Zunächst werden die Dateien über <menuchoice><guimenu>Datei</guimenu> <guimenuitem>Aus CVS-Archiv entfernen ...</guimenuitem></menuchoice> oder durch einen Rechtsklick auf eine der markierten Dateien und Auswahl von <guimenuitem>Aus CVS-Archiv entfernen ...</guimenuitem> aus dem Kontextmenü. Der Dialog <guilabel>Aus CVS entfernen</guilabel> erscheint und zeigt eine Liste der markierten Dateien. Bestätigen Sie diesen Dialog mit <guibutton>OK</guibutton>. &cervisia; setzt folgenden Befehl ab:

source: <command>cvs remove -f <replaceable>file names</replaceable></command>
de: <command>cvs remove -f <replaceable>Dateinamen</replaceable></command>

source: After that, this modification to the sandbox has to be committed, possibly together with other modifications to the project.
de: Danach muss die Änderung im Arbeitsordner noch in das &CVS;-Archiv eingespielt werden, ggf. zusammen mit anderen lokal erfolgten Änderungen.

source: The above command only works if the file is up-to-date. Otherwise, you get an error message. This behavior is sensible: If you have modified the file compared to the version in the repository, or if someone else has made any modifications, you will first want to check if you really want to discard them.
de: Der zuvor erwähnte Befehl funktioniert nur, wenn die betreffende Datei im Arbeitsordner aktuell ist. Dieses Verhalten ist durchaus vernünftig. Wenn Sie eine Version im Arbeitsordner haben, die gegenüber der im &CVS;-Archiv vorliegenden Dateiversion Unterschiede aufweist, möchten Sie wahrscheinlich zunächst prüfen, ob Sie diese Änderungen tatsächlich verwerfen wollen.

source: Adding and Removing Folders
de: Hinzufügen und Entfernen von Ordnern

source: Folders are handled fundamentally different from ordinary files by &CVS;. They are not under revision control, &ie; you cannot tell which folders existed in the project at a certain time. Furthermore, folders can never be explicitly removed (except by removing them directly in the repository).
de: Ordner werden durch &CVS; grundsätzlich anders behandelt als normale Dateien. Sie unterliegen keiner Versionsverwaltung, &ie; Sie können nicht nachvollziehen, welche Ordner in einem Projekt zu einem bestimmten Zeitpunkt existiert haben. Darüberhinaus können Ordner nicht mehr aus dem &CVS;-Archiv entfernt werden. Die einzige Möglichkeit hierzu ist das direkte Entfernen im &CVS;-Archiv auf dem Server.

source: As a substitute, &CVS; follows the convention that a folder is "non-existent" in a version of the project if it is empty. This convention can be enforced by using the option <option>-P</option> to <command>cvs update</command> and <command>cvs checkout</command>. This option can be set in the menu <menuchoice><guimenu>Settings</guimenu><guimenuitem>Prune Empty Folders on Update</guimenuitem></menuchoice>.
de: Aus diesem Grund folgt &CVS; der Konvention, einen Ordner als <quote>nicht existent</quote> zu betrachten, wenn es keine Dateien enthält. Diese Konvention kann durch die Option <option>-P</option> für <command>cvs update</command> und <command>cvs checkout</command> erzwungen werden. In &cervisia; erreichen Sie dies über Markieren von <menuchoice><guimenu>Einstellungen</guimenu><guimenuitem>Leere Ordner beim Aktualisieren entfernen</guimenuitem></menuchoice>.

source: A folder can be added to the repository choosing <menuchoice><guimenu>File</guimenu><guimenuitem>Add to Repository...</guimenuitem></menuchoice> or right clicking the marked folder and choosing <guimenuitem>Add to Repository...</guimenuitem> from the context menu. Note that in contrast to adding files, adding folders does not require a commit afterwards. &cervisia; issues the command
de: Einen Ordner fügen Sie mit <menuchoice><guimenu>Datei</guimenu><guimenuitem>Zum CVS-Archiv hinzufügen ...</guimenuitem></menuchoice> zum Archiv hinzu, oder indem Sie mit der rechten Maustaste auf den markierten Ordner klicken und aus dem Kontextmenü <guimenuitem>Zum Archiv hinzufügen ...</guimenuitem> wählen. Beachten Sie, dass anders als beim Hinzufügen von Dateien kein darauffolgendes Einspielen des Ordners erforderlich ist. &cervisia; setzt den folgenden Befehl ab:

source: <command>cvs add <replaceable>dirname</replaceable></command>
de: <command>cvs add <replaceable>Ordnername</replaceable></command>

source: Committing Files
de: Einspielen von Dateien

source: When you have made a certain number of changes to your working copy, and you want other developers to have access to them, you <emphasis>commit</emphasis> them. With a commit, you place your versions of the modified files as new revisions into the repository. A subsequent update by another developer will bring your modifications into their working copy.
de: Wenn Sie eine Reihe von Änderungen in Ihrem Arbeitsordner vorgenommen haben und diese nun anderen Entwicklern zur Verfügung stellen wollen, spielen Sie die betreffenden Dateien in das &CVS;-Archiv ein. Beim Einspielen werden die von Ihnen veränderten Versionen der Dateien zur aktuellen Version im &CVS;-Archiv. Aktualisiert ein anderer Entwickler später sein Arbeitsordner, erhält er Ihre Änderungen aus dem &CVS;-Archiv.

source: In order to commit a couple of files, select them in &cervisia;'s main view and choose <menuchoice><guimenu>File</guimenu><guimenuitem>Commit...</guimenuitem></menuchoice> or right click the marked files and choose <guimenuitem>Commit...</guimenuitem> from the context menu.
de: Wenn Sie Dateien einspielen möchten, markieren Sie diese in der Hauptansicht von &cervisia; und wählen Sie im Menü <menuchoice><guimenu>Datei</guimenu><guimenuitem>Einspielen ...</guimenuitem></menuchoice> oder klicken Sie mit der rechten Maustaste auf eine der markierten Dateien und wählen Sie <guimenuitem>Einspielen ...</guimenuitem> aus dem Kontextmenü.

source: A screenshot of &cervisia;'s commit dialog
de: Ein Bildschirmfoto des Dialogs <quote>Einspielen</quote>
