Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdesdk/cervisia.po
Languages: de

source: Practically all &CVS; commands started in a sandbox which belongs to a remote repository need a connection to the &CVS; server. This is affected by delays from the network connection or a high load on the server. For this reason, for commands like <menuchoice><guimenu>View</guimenu><guimenuitem>Difference to Repository...</guimenuitem></menuchoice> &cervisia; opens a dialog which indicates that the command is still running and which allows you to abort it. Furthermore, this dialog is used to show you error messages from &CVS;. As this dialog may become annoying after some time, it is shown only after a certain timeout which is 4 seconds by default. Here you can change this value.
de: Nahezu alle &CVS;-Befehle, die in einem Arbeitsordner ausgeführt werden, das zu einem nichtlokalen Archiv gehört, benötigen eine Verbindung zum &CVS;-Server. Hierbei spielen Verzögerungen bei der Netzwerkverbindung oder die Auslastung des Servers eine Rolle. Aus diesem Grund öffnet &cervisia; für Befehle wie <menuchoice><guimenu>Ansicht</guimenu> <guimenuitem>Abweichungen vom Archiv ...</guimenuitem></menuchoice> einen Dialog, der anzeigt, dass die Ausführung des Befehls noch nicht beendet ist. Zudem erlaubt dieser Dialog den Abbruch des laufenden Befehls und dient der Anzeige von &CVS;-Fehlermeldungen. Da dieser Dialog möglicherweise störend wirkt, erscheint er erst nach einer gewissen Verzögerung, die in der Voreinstellung 4 Sekunden beträgt. Diesen Wert können Sie hier ändern.

source: Default compression level:
de: Standard-Kompressionsstufe:

source: The <command>cvs</command> client compresses files and patches when they are transferred over a network. With the command line option <option>-z</option>, the compression level can be set. You can setup &cervisia; to use this option by configuring the level here. The value set here is used only as a default; additionally there is a per-repository setting available in <menuchoice><guimenu>Repository</guimenu><guimenuitem>Repositories...</guimenuitem></menuchoice>.
de: Der Befehl <command>cvs</command> komprimiert Dateien und Patches, sofern sie über ein Netzwerk übertragen werden. Mit dem Befehlszeilenschalter <option>-z</option> kann die Kompressions-Stufe eingestellt werden. Sie können die ausgewählte Kompressions-Stufe hier einstellen. Der hier eingestellte Wert ist nur eine Voreinstellung. Sie können die Kompressions-Stufe zusätzlich für jedes &CVS;-Archiv über <menuchoice><guimenu>Archiv</guimenu> <guimenuitem>Archive ...</guimenuitem></menuchoice> anpassen.

source: Utilize a running or start a new ssh-agent process
de: Laufenden ssh-Agent-Prozess verwenden oder einen neuen starten

source: Check this box if you use <link linkend="rsh">ext (&rsh;) repositories</link>, the &ssh; remote shell to communicate with the repository and <application>ssh-agent</application> to manage your keys.
de: Markieren Sie dieses Kästchen, wenn Sie <link linkend="rsh">ext-(&rsh;)-Archive</link> verwenden, die &ssh;-Shell um mit dem Archiv zu kommunizieren und <application>ssh-agent</application> um die Schlüssel zu verwalten.

source: Appearance
de: Erscheinungsbild

source: Font for Protocol Window...
de: Schriftart für das Protokoll-Fenster ...

source: Press this button to open the <guilabel>Select Font</guilabel> dialog, to set the font used in the protocol window (this is the window showing the output of the <command>cvs</command> client).
de: Drücken Sie diesen Knopf, um den Dialog <guilabel>Schriftart auswählen</guilabel> zu öffnen, der die Schriftart für das Protokoll-Fenster vorgibt in dem die Ausgaben des Befehls <command>cvs</command> angezeigt werden.

source: Font for Annotate View...
de: Schriftart für die Anmerkungs-Ansicht ...

source: Press this button to open the <guilabel>Select Font</guilabel> dialog, to set the font used in the <link linkend="annotate">annotate view</link>.
de: Drücken Sie diesen Knopf, um den Dialog <guilabel>Schriftart auswählen</guilabel> zu öffnen, der die Schriftart für die <link linkend="annotate">Anmerkungs-Ansicht</link> vorgibt.

source: Font for Diff View...
de: Schriftart für Diff-Ansicht ...

source: Press this button to open the <guilabel>Select Font</guilabel> dialog, to set the font used in <link linkend="diff">diff dialogs</link>.
de: Drücken Sie diesen Knopf, um den Dialog <guilabel>Schriftart auswählen</guilabel> zu öffnen, der die Schriftart für die <link linkend="diff">Diff-Ansicht</link> vorgibt.

source: Colors
de: Farben

source: Press the colored buttons to open the <guilabel>Select Color</guilabel> dialog, to set the color used for <guilabel>Conflict</guilabel>, <guilabel>Local change</guilabel>, or <guilabel>Remote change</guilabel>, in the main view or <guilabel>Diff change</guilabel>, <guilabel>Diff insertion</guilabel>, or <guilabel>Diff deletion</guilabel>, in &cervisia;'s built-in diff frontend.
de: Drücken Sie die farbigen Knöpfe, um den Dialog <guilabel>Farbe wählen</guilabel> zu öffnen und die Farben für <guilabel>Konflikt</guilabel>, <guilabel>Lokale Änderung</guilabel> oder <guilabel>Änderung im Archiv</guilabel> in der Hauptansicht, und <guilabel>Diff-Änderung</guilabel>, <guilabel>Diff-Einfügung</guilabel> oder <guilabel>Diff-Entfernung</guilabel> in der Diff-Oberfläche von &cervisia; einzustellen.

source: Split main window horizontally
de: Hauptfenster waagerecht aufteilen

source: &cervisia;'s main window is normally split vertically into a window with the file tree above and one with the &CVS; output below; alternatively, you can arrange them horizontally.
de: &cervisia;s Hauptfenster ist normalerweise senkrecht aufgeteilt. Ein Bereich zeigt den Dateibaum, der andere die &CVS;-Ausgaben. Sie können die Fenster auch waagerecht aufteilen.

source: Appendix
de: Anhang

source: Ignored Files
de: Ignorierte Dateien

source: In its main file tree, &cervisia; does not display all files which are actually there. This is analog to <command>cvs</command> itself and helps to avoid clutter caused by uninteresting stuff like object files. &cervisia; tries to mimic <command>cvs</command>'s behavior as close as possible, &ie; it gets ignore lists from the following sources:
de: Im Dateibaum zeigt &cervisia; nicht alle Dateien an, die vorhanden sind. Dieses Verhalten ist analog zum Befehl <command>cvs</command> und verhindert eine Überfüllung der Anzeige mit Dateien, die für die Bearbeitung durch &cervisia; nicht von Interesse sind. &cervisia; versucht hierbei so gut wie möglich das Verhalten von <command>cvs</command> zu imitieren und zieht für das Ignorieren von Dateien folgende Quellen heran:

source: A static list of entries which includes things like <literal role="extension">*.o</literal> and <filename>core</filename>. For details, see the &CVS; documentation.
de: Eine statische Liste, die Einträge wie <literal role="extension">*.o</literal> und <filename>core</filename> enthält. Weitere Einzelheiten hierzu finden Sie in der &CVS;-Dokumentation.

source: The file <filename><envar>$HOME</envar>/.cvsignore</filename>.
de: Die Datei <filename><envar>$HOME</envar>/.cvsignore</filename>.

source: The environment variable <envar>$CVSIGNORE</envar>.
de: Die Umgebungsvariable <envar>$CVSIGNORE</envar>.

source: The <filename>.cvsignore</filename> file in the respective folder.
de: Die Datei <filename>.cvsignore</filename> im jeweiligen Ordner.

source: <command>cvs</command> itself additionally looks up entries in <filename><envar>$CVSROOT</envar>/CVSROOT/cvsignore</filename>, but this is a file on the server, and &cervisia; should be able to start up offline. If you are working with a group that prefers to use an ignore list on the server, it's probably a good idea to take a look which patterns are listed there and to put them into the <filename>.cvsignore</filename> file in your home folder.
de: <command>cvs</command> selbst überprüft darüberhinaus noch die Einträge in <filename><envar>$CVSROOT</envar>/CVSROOT/cvsignore</filename>, aber dies ist eine Datei auf dem Server und &cervisia; muss auch ohne Verbindung zum Server starten. Arbeiten Sie in einer Gruppe, die die Verwendung einer Ignore-Liste auf dem Server bevorzugt, ist es möglicherweise ratsam einen Blick auf die dort eingetragenen Dateimuster zu werfen und diese in die Datei <filename>.cvsignore</filename> in Ihrem Persönlichen Ordner einzutragen.

source: Further Information and Support
de: Weitere Informationen und Unterstützung bei Problemen

source: &CVS; comes with a complete set of documentation in the form of info pages, known as "The Cederqvist". If it is properly installed, you can browse it by typing in <userinput>info:/cvs</userinput> into the locationbar of &konqueror;, or you can just choose <menuchoice><guimenu>Help</guimenu><guimenuitem>CVS Manual</guimenuitem></menuchoice> in &cervisia;. An on-line &HTML; version of the Cederqvist is available <ulink url="http://ximbiot.com/cvs/manual/">on the web</ulink>.
de: &CVS; verfügt über eine umfassende Dokumentation in Form von Info-Seiten, die unter dem Namen <quote>The Cederqvist</quote> bekannt sind. Bei einer korrekten &CVS;-Installation können Sie über den Befehl <userinput>info:/cvs</userinput> in der Eingabezeile von &konqueror; darauf zugreifen. Alternativ können Sie in &cervisia; <menuchoice><guimenu>Hilfe</guimenu><guimenuitem>CVS-Handbuch</guimenuitem></menuchoice> aufrufen. Eine &HTML;-Version des <quote>Cederqvist</quote> ist <ulink url="http://ximbiot.com/cvs/manual">hier</ulink> verfügbar.

source: As this book is maintained together with &CVS;, it is normally the most up-to-date reference; nevertheless, considering other documentation for learning to use &CVS; is recommended, in particular the following.
de: Da dieses Buch gemeinsam mit &CVS; weiterentwickelt wird, ist es normalerweise die aktuellste Referenz. Erwägen Sie trotzdem andere Dokumentationen zum Erlernen der Anwendung von &CVS; hinzuzuziehen. Insbesondere sind dies:

source: Karl Fogel has written the excellent book <ulink url="http://cvsbook.red-bean.com/index.html">Open Source Development with &CVS;</ulink>. About half of this book is about the development process of Open Source software. The other half is a technical documentation of &CVS;. Thankfully, the technical part of the book has been made freely redistributable under the GPL, so that you can download a &HTML; version of it. A list of errata is available on the web page mentioned above.
de: Karl Fogel hat ein ausgezeichnetes Buch geschrieben: <ulink url="http://cvsbook.red-bean.com/index.html">Open Source Development with &CVS;</ulink>. Über die Hälfte des Buches beschäftigt sich mit dem Entwicklungsprozess von Open Source Software. Die andere Hälfte ist eine technische Dokumentation von &CVS;. Dankenswerterweise wurde der technische Teil des Buches unter der GPL frei verfügbar gemacht, sodass Sie diesen als &HTML;-Version herunterladen können. Auf der oben erwähnten Webseite findet sich zudem eine Liste von Berichtigungen.

source: &CVS; issues are discussed on a dedicated <ulink url="http://mail.gnu.org/mailman/listinfo/info-cvs">mailing list</ulink>.
de: Themen in Zusammenhang mit &CVS; werden auf einer besonderen <ulink url="http://mail.gnu.org/mailman/listinfo/info-cvs">Mailingliste</ulink> behandelt.

source: There is USENET group <literal>comp.software.config-mgmt</literal> dedicated to configuration management in general. &CVS; is only marginally a topic in this group, but nevertheless it may be interesting for discussing merits of various revision control systems compared to &CVS;.
de: Es gibt eine USENET Gruppe - <literal>comp.software.config-mgmt</literal>, - die sich mit Konfigurations-Management im Allgemeinen befasst. &CVS; ist in dieser Gruppe nur ein Randbereich, sie dürfte aber zur Diskussion der Vorteile anderer Versionsverwaltungssysteme gegenüber &CVS; von Interesse sein.

source: Last but not least, there is a (low traffic) <ulink url="http://lists.sourceforge.net/mailman/listinfo/cervisia-user">&cervisia; mailing list</ulink>.
de: Zu guter Letzt gibt es noch eine <ulink url="http://lists.sourceforge.net/mailman/listinfo/cervisia-user"> &cervisia; Mailingliste</ulink>.

source: Command Reference
de: Befehlsreferenz

source: The File Menu
de: Das Menü <guimenu>Datei</guimenu>

source: <guimenu>File</guimenu><guimenuitem>Open Sandbox...</guimenuitem>
de: <guimenu>Datei</guimenu><guimenuitem>Arbeitsordner öffnen ...</guimenuitem>

source: Opens a sandbox in the main window. See <xref linkend="mainscreen"/>.
de: Öffnet einen Arbeitsordner im Hauptfenster. Siehe <xref linkend="mainscreen"/>.

source: <guimenu>File</guimenu><guisubmenu>Recent Sandboxes</guisubmenu>
de: <guimenu>Datei</guimenu><guisubmenu>Zuletzt geöffnete Arbeitsordner</guisubmenu>

source: Opens one of the sandboxes that were in use recently.
de: Öffnet einen der Arbeitsordner, mit denen zuletzt gearbeitet wurde.

source: <guimenu>File</guimenu><guimenuitem>Insert ChangeLog Entry...</guimenuitem>
de: <guimenu>Datei</guimenu><guimenuitem>Changelog-Eintrag hinzufügen ... </guimenuitem>

source: Opens the ChangeLog editor, prepared such that you can add a new entry with the current date. See <xref linkend="committingfiles"/>.
de: Öffnet den Changelog-Editor so, dass Sie einen neuen Eintrag mit dem aktuellen Datum hinzufügen können. Siehe <xref linkend="committingfiles"/>.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>U</keycap></keycombo></shortcut> <guimenu>File</guimenu><guimenuitem>Update</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>U</keycap></keycombo></shortcut> <guimenu>Datei</guimenu><guimenuitem>Aktualisieren</guimenuitem>

source: Runs 'cvs update' on selected files and changes the status and revision numbers in the listing accordingly. See <xref linkend="mainscreen"/>.
de: Ruft ‚cvs update‘ für die ausgewählten Dateien auf und ändert den Status und die Revisionsnummer entsprechend in der Dateiliste. Siehe <xref linkend="mainscreen"/>.

source: <shortcut><keycap>F5</keycap></shortcut> <guimenu>File</guimenu><guimenuitem>Status</guimenuitem>
de: <shortcut><keycap>F5</keycap></shortcut> <guimenu>Datei</guimenu><guimenuitem>Status</guimenuitem>

source: Runs 'cvs -n update' on selected files and changes the status and revision numbers in the listing accordingly. See <xref linkend="mainscreen"/>.
de: Ruft ‚cvs -n update‘ für die ausgewählten Dateien auf und ändert den Status und die Revisionsnummer entsprechend in der Dateiliste. Siehe <xref linkend="mainscreen"/>.

source: <guimenu>File</guimenu><guimenuitem>Edit</guimenuitem>
de: <guimenu>Datei</guimenu><guimenuitem>Bearbeiten</guimenuitem>

source: Opens the selected file in &kde;'s default editor for the selected file's type.
de: Öffnet die ausgewählte Datei in dem für diesen Dateityp eingestellten Standardeditor in &kde;.

source: <guimenu>File</guimenu><guimenuitem>Resolve...</guimenuitem>
de: <guimenu>Datei</guimenu><guimenuitem>Konflikte auflösen ...</guimenuitem>

source: Opens a dialog for the selected file which allows you to resolve merge conflicts in it. See <xref linkend="resolvingconflicts"/>.
de: Öffnet einen Dialog für die ausgewählte Datei, der die Auflösung von Konflikten ermöglichte, die beim Zusammenführen von Änderungen entstanden sind. Siehe <xref linkend="resolvingconflicts"/>.

source: <shortcut><keycap>#</keycap></shortcut> <guimenu>File</guimenu><guimenuitem>Commit...</guimenuitem>
de: <shortcut><keycap>#</keycap></shortcut> <guimenu>Datei</guimenu><guimenuitem>Einspielen ...</guimenuitem>

source: Allows you to commit the selected files. See <xref linkend="committingfiles"/>.
de: Ermöglicht das Einspielen der ausgewählten Dateien. Siehe <xref linkend="committingfiles"/>.

source: <shortcut><keycap>Ins</keycap></shortcut> <guimenu>File</guimenu><guimenuitem>Add to Repository...</guimenuitem>
de: <shortcut><keycap>Einfg</keycap></shortcut> <guimenu>File</guimenu><guimenuitem>Zum &CVS;-Archiv hinzufügen ...</guimenuitem>

source: Allows you to add the selected files to the repository. See <xref linkend="addingfiles"/>.
de: Ermöglicht das Hinzufügen der ausgewählten Dateien zum Archiv. Siehe <xref linkend="addingfiles"/>.

source: <guimenu>File</guimenu><guimenuitem>Add Binary...</guimenuitem>
de: <guimenu>File</guimenu><guimenuitem>Binärdatei hinzufügen ...</guimenuitem>

source: Allows you to add the selected files to the repository as binaries (<command>cvs add<option>-kb</option></command>). See <xref linkend="addingfiles"/>.
de: Ermöglicht das Hinzufügen der ausgewählten Dateien als Binärdateien. (<command>cvs add<option>-kb</option></command>). Siehe <xref linkend="addingfiles"/>.

source: <shortcut><keycap>Del</keycap></shortcut> <guimenu>File</guimenu><guimenuitem>Remove from Repository...</guimenuitem>
de: <shortcut><keycap>Entf</keycap></shortcut> <guimenu>Datei</guimenu><guimenuitem>Aus &CVS;-Archiv entfernen ...</guimenuitem>

source: Allows you to remove the selected files from the repository. See <xref linkend="removingfiles"/>.
de: Ermöglicht das Entfernen der ausgewählten Dateien aus dem &CVS;-Archiv. Siehe <xref linkend="removingfiles"/>.

source: <guimenu>File</guimenu><guimenuitem>Revert</guimenuitem>
de: <guimenu>Datei</guimenu><guimenuitem>Zurücknehmen</guimenuitem>

source: Discards any local changes you have made to the selected files and reverts to the version in the repository (Option <option>-C</option> to <command>cvs update</command>).
de: Verwirft alle lokal durchgeführten Änderungen an den markierten Dateien und geht auf die im &CVS;-Archiv enthaltene Version zurück. (Option <option>-C</option> für <command>cvs update</command>).

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo></shortcut> <guimenu>File</guimenu><guimenuitem>Quit</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo></shortcut> <guimenu>Datei</guimenu><guimenuitem>Beenden</guimenuitem>

source: Quits &cervisia;.
de: Beendet &cervisia;.

source: The View Menu
de: Das Menü Anzeigen

source: <shortcut><keycap>Escape</keycap></shortcut> <guimenu>View</guimenu><guimenuitem>Stop</guimenuitem>
de: <shortcut><keycap>Escape</keycap></shortcut> <guimenu>Anzeigen</guimenu><guimenuitem>Anhalten</guimenuitem>

source: Aborts any running subprocesses.
de: Bricht laufende Unterprozesse ab.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>L</keycap></keycombo></shortcut> <guimenu>View</guimenu><guimenuitem>Browse Log...</guimenuitem>
de: <shortcut><keycombo>&Ctrl;<keycap>L</keycap></keycombo></shortcut> <guimenu>Anzeigen</guimenu><guimenuitem>Protokoll durchsuchen ...</guimenuitem>

source: Shows the log browser of the selected file versions. See <xref linkend="browsinglogs"/>.
de: Zeigt die Protokollansicht der markierten Dateiversionen. Siehe <xref linkend="browsinglogs"/>.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>A</keycap></keycombo></shortcut> <guimenu>View</guimenu><guimenuitem>Annotate...</guimenuitem>
de: <shortcut><keycombo>&Ctrl;<keycap>A</keycap></keycombo></shortcut> <guimenu>Anzeigen</guimenu> <guimenuitem>Anmerkung ...</guimenuitem>

source: Shows an annotated view of the selected file, &ie; a view where you can for each line see which author modified it last. See <xref linkend="annotate"/>.
de: Zeigt eine mit Anmerkungen versehene Ansicht der ausgewählten Datei, &ie; es wird für jede Zeile der Autor und das Datum der letzten Änderung angezeigt. Siehe <xref linkend="annotate"/>.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>D</keycap></keycombo></shortcut> <guimenu>View</guimenu><guimenuitem>Difference to Repository (BASE)...</guimenuitem>
de: <shortcut><keycombo>&Ctrl;<keycap>D</keycap></keycombo></shortcut> <guimenu>Anzeigen</guimenu><guimenuitem>Abweichungen vom &CVS;-Archiv ...</guimenuitem>

source: Shows the differences between the selected file in the sandbox and the revision you last updated (BASE). See <xref linkend="diff"/>.
de: Zeigt die Unterschiede zwischen der ausgewählten Datei im Arbeitsordner und der Revision, die beim letzten Aktualisieren aus dem Archiv geholt wurde (BASE). Siehe <xref linkend="diff"/>.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>H</keycap></keycombo></shortcut> <guimenu>View</guimenu><guimenuitem>Difference to Repository (HEAD)...</guimenuitem>
de: <shortcut><keycombo>&Ctrl;<keycap>H</keycap></keycombo></shortcut> <guimenu>Anzeigen</guimenu><guimenuitem>Abweichungen vom &CVS;-Archiv (HEAD) ...</guimenuitem>

source: Shows the differences between the selected file in the sandbox and the revision you last updated (HEAD). See <xref linkend="diff"/>.
de: Zeigt die Unterschiede zwischen der ausgewählten Datei im Arbeitsordner und der Revision, die beim letzten Aktualisieren aus dem &CVS;-Archiv geholt wurde (HEAD). Siehe <xref linkend="diff"/>.

source: <guimenu>View</guimenu><guimenuitem>Last Change...</guimenuitem>
de: <guimenu>Anzeigen</guimenu><guimenuitem>Letzte Änderung ...</guimenuitem>

source: Shows the differences between the revision of the selected file you last updated (BASE) and the revision before. See <xref linkend="diff"/>.
de: Zeigt die Unterschiede zwischen der Revision der ausgewählten Datei, die Sie zuletzt geholt haben (BASE) und der Vorgängerversion. Siehe <xref linkend="diff"/>.

source: <guimenu>View</guimenu><guimenuitem>History...</guimenuitem>
de: <guimenu>Anzeigen</guimenu><guimenuitem>Versionsgeschichte ...</guimenuitem>

source: Shows the &CVS; history as reported by the server. See <xref linkend="browsinghistory"/>.
de: Zeigt die &CVS;-Versionsgeschichte an, wie Sie vom Server bereitgestellt wird. Siehe <xref linkend="browsinghistory"/>.

source: <guimenu>View</guimenu><guimenuitem>Hide All Files</guimenuitem>
de: <guimenu>Anzeigen</guimenu><guimenuitem>Nur Ordner anzeigen</guimenuitem>

source: Determines whether only folders are shown in the main tree view. See <xref linkend="mainscreen"/>.
de: Gibt an, ob nur Ordner in der Hauptansicht angezeigt werden. Siehe <xref linkend="mainscreen"/>.

source: <guimenu>View</guimenu><guimenuitem>Hide Unmodified Files</guimenuitem>
de: <guimenu>Anzeigen</guimenu><guimenuitem>Nicht geänderte Dateien ausblenden</guimenuitem>

source: Determines whether unknown and up to date files are hidden in the main tree view. See <xref linkend="mainscreen"/>.
de: Gibt an, ob Dateien mit unbekanntem Status und solche, die nicht verändert wurden, in der Hauptansicht ausgeblendet werden. Siehe <xref linkend="mainscreen"/>.

source: <guimenu>View</guimenu><guimenuitem>Hide Removed Files</guimenuitem>
de: <guimenu>Anzeigen</guimenu><guimenuitem>Dateien mit Status „Entfernt“ ausblenden</guimenuitem>

source: Determines whether removed files are hidden in the main tree view. See <xref linkend="mainscreen"/>.
de: Gibt an, ob entfernte Dateien in der Hauptansicht ausgeblendet werden. Siehe <xref linkend="mainscreen"/>.

source: <guimenu>View</guimenu><guimenuitem>Hide Non-CVS Files</guimenuitem>
de: <guimenu>Anzeigen</guimenu><guimenuitem>Dateien ausblenden, die nicht zum Archiv gehören</guimenuitem>

source: Determines whether files not in &CVS; are hidden in the main tree view. See <xref linkend="mainscreen"/>.
de: Gibt an, ob Dateien, die nicht zum Archiv gehören, in der Hauptansicht ausgeblendet werden. Siehe <xref linkend="mainscreen"/>.

source: <guimenu>View</guimenu><guimenuitem>Hide Empty Folders</guimenuitem>
de: <guimenu>Anzeigen</guimenu><guimenuitem>Leere Ordner ausblenden</guimenuitem>

source: Determines whether folders without visible entries are hidden in the main tree view. See <xref linkend="mainscreen"/>.
de: Gibt an, ob Ordner, ohne sichtbare Einträge in der Hauptansicht ausgeblendet werden. Siehe <xref linkend="mainscreen"/>.

source: <guimenu>View</guimenu><guimenuitem>Unfold File Tree</guimenuitem>
de: <guimenu>Anzeigen</guimenu><guimenuitem>Dateibaum ausklappen</guimenuitem>
