Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdesdk/cervisia.po
Languages: de

source: &cervisia; Manual
de: Das Handbuch zu &cervisia;

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"> <firstname>Stephan</firstname> <surname>Johach</surname><affiliation> <address><email>hunsum@gmx.de</email></address> </affiliation> <contrib>Übersetzung</contrib> </othercredit>

source: &cervisia; provides a graphical view of &CVS;.
de: &cervisia; ist eine grafische Benutzeroberfläche für &CVS;.

source: version control
de: Versionsverwaltung

source: revision control
de: Revisionsverwaltung

source: Introduction
de: Einführung

source: <ulink url="http://www.kde.org/apps/cervisia/">&cervisia;</ulink> is a user friendly version control system front-end. The aim is to support &CVS; and other version control system programs in a unified interface, featuring conflict resolution, difference and history viewers, status for the working copy files, and support for most version control functions. You can get &cervisia; by building the kdesdk module or installing the kdesdk package provided by your distribution. Currently, only &CVS; is supported, but other version control systems may be integrated in the future.
de: <ulink url="http://www.kde.org/apps/cervisia/">&cervisia;</ulink> ist eine anwenderfreundliche Benutzeroberfläche für Versionsverwaltungssysteme. Die Zielsetzung besteht darin eine einheitliche Oberfläche für &CVS; und andere Versionsverwaltungen zu schaffen, die das Auflösen von Versionskonflikten, die Darstellung von Versionsunterschieden und Änderungsverläufen und die Verwaltung von lokalen Arbeitskopien anbietet. &cervisia; ist im Paket kdesdk enthalten, das Sie selbst kompilieren oder direkt als Paket passend zu Ihrer Distribution installieren können. Derzeit wird nur &CVS; unterstützt, aber in Zukunft könnten weitere Versionsverwaltungssysteme folgen.

source: A version control system is a tool to record, manage, and distribute different versions of files. &CVS; is a version control system. It allows you to share your modifications easily, as each of the contributors can work on their local copy at the same time, without fear of overwriting each others' modifications. It allows the recovery of past versions (useful for tracking bugs), the creation of branches (for experimental development or for releases of code) and more.
de: Ein Versionsverwaltungssystem ist ein Werkzeug zur Erfassung, Verwaltung und Verteilung von Dateiversionen. &CVS; ist ein Versionsverwaltungssystem. Sie können damit Ihre Änderungen mit anderen teilen, ohne dass Sie befürchten müssen, die Änderungen der anderen zu überschreiben, denn jeder Beitragende arbeitet mit einer eigenen lokalen Kopie. Es ermöglicht das Wiederherstellen alter Versionen (nützlich bei der Fehlersuche), das Anlegen von Verzweigungen (für experimentelle Entwicklung oder die Verwaltung von Auslieferungen) und vieles mehr.

source: The main <firstterm>repository</firstterm> usually holds a collaborative project (commercial or not), but you can take advantage of the nice revision control features offered by &CVS; even for a project developed exclusively by you. It is easy to set up a local repository, and you will gain the ability to track changes that caused bugs, revert changes, avoid accidental loss of information, &etc;
de: Das <firstterm>&CVS;-Archiv</firstterm> enthält gewöhnlich ein (kommerzielles oder nichtkommerzielles) Projekt, an dem mehrere Parteien arbeiten, aber sie können die nützlichen Funktionen von &CVS; auf für Projekte nutzen, auf die nur Sie allein Zugriff haben. Ein lokales &CVS;-Archiv ist leicht aufgesetzt, und Sie gewinnen dadurch die Fähigkeit Änderungen zu verfolgen, die zu Fehlern geführt haben, können Änderungen zurücknehmen, den versehentlichen Verlust von Informationen vermeiden &etc;

source: The repository holds the project files, and every contributor keeps their own local copy, named <firstterm>working copy</firstterm> or <firstterm>sandbox</firstterm>; one can then add their modifications to the main repository (a process called &quot;committing&quot;) and/or update their own copy to reflect recent changes made by other contributors.
de: Obwohl das CVS-Archiv die Projektdateien enthält und jeder Mitarbeiter seine eigene lokale Kopie, genannt <firstterm>Arbeitskopie</firstterm> oder <firstterm>Arbeitsordner</firstterm> führt, können diese ihre Änderungen in das CVS-Archiv einfügen (ein Vorgang, den wir mit &quot;einspielen&quot; bezeichnen) und / oder seine eigene Kopie aktualisieren, um die letzten Änderungen der anderen Mitarbeiter zu erhalten.

source: Getting Started
de: Erste Schritte

source: Accessing The Repository
de: Zugriff auf das &CVS;-Archiv

source: In this section, we show how to use the basic version control system functionality using &cervisia; to checkout modules from the repository and work with them. To do that, you must have access to the repository as a client, meaning that someone (probably the administrator of the &CVS; repository) gave you an account on the server machine. Alternatively, you can easily create a local repository for your own project.
de: In diesem Abschnitt zeigen wir, wie Sie die grundlegenden Funktionen des Versionsverwaltungssystems mit &cervisia; nutzen. Dabei liegt der Schwerpunkt auf dem Auslesen von Modulen aus dem &CVS;-Archiv und der Arbeit an diesen. Dazu müssen Sie Zugriff auf das &CVS;-Archiv haben, &ie; jemand (wahrscheinlich der Administrator des &CVS;-Archivs) hat Ihnen einen Zugang erteilt. Alternativ können Sie sich für Ihr eigenes Projekt einfach ein lokales &CVS;-Archiv anlegen.

source: If you plan to develop a complex project, it is a good idea to use the &CVS; features, even if you are the only developer. You can make all changes in the working copy, and use &cervisia; (or any other &CVS; tool) to update and commit. This way, you will gain the ability to track changes that caused bugs, revert changes, avoid accidental loss of information, &etc; Using &cervisia;, it is simple to create a local repository.
de: Wenn Sie ein aufwendigeres Projekt planen, ist es ratsam die Funktionalität von &CVS; zu nutzen, selbst wenn Sie der einzige Entwickler sind. Sämtliche Änderungen führen Sie an Ihrer Arbeitskopie durch und spielen diese mit &cervisia; (oder einem anderen Werkzeug für &CVS;) ein. Auf diese Weise sind Sie in der Lage, Änderungen zu finden, die Fehler hervorgerufen haben, können Änderungen rückgängig machen, vermeiden den versehentlichen Verlust von Informationen &etc; Mit &cervisia; ist das Anlegen eines lokalen Archivs sehr einfach.

source: Creating a Local Repository
de: Das Anlegen eines lokalen &CVS;-Archivs

source: Open the <guilabel>Create New Repository (cvs init)</guilabel> dialog by choosing <menuchoice><guimenu>Repository</guimenu> <guimenuitem>Create...</guimenuitem></menuchoice>.
de: Öffnen Sie den Dialog <guilabel>Neues CVS-Archiv anlegen (cvs init)</guilabel> durch Auswahl von <menuchoice><guimenu>Archiv</guimenu><guimenuitem>Erstellen ...</guimenuitem></menuchoice> aus dem Menü.

source: Press the <guilabel>...</guilabel> button to select the folder where you want to create the repository, or enter its location in the text box. For instance, if you want to place the repository in the <filename>/home/user</filename> folder, and to name it <filename>cvsroot</filename>, you should type <filename>/home/user/cvsroot</filename> in the text box, or select the <filename>/home/user</filename> folder using the file picker, and add <filename>cvsroot</filename>.
de: Wählen Sie mit dem Knopf <guilabel>...</guilabel> den Ordner aus, in dem das Archiv erstellt werden soll oder geben Sie den Speicherort in das Textfeld ein. Möchten Sie das Archiv beispielsweise im Ordner <filename>/home/usr</filename> unterbringen und mit dem Namen <filename>cvsroot</filename> versehen, geben Sie <filename>/home/user/cvsroot</filename> in das Textfeld ein oder wählen Sie mit der Maus den Ordner <filename>/home/user</filename> aus und fügen <filename>cvsroot</filename> hinzu.

source: Confirm by pressing the <guibutton>OK</guibutton> button. &cervisia; will create and initialize the new repository folder.
de: Bestätigen Sie Ihre Eingaben mit <guibutton>OK</guibutton>. &cervisia; legt nun den neuen Archiv-Ordner an und initialisiert ihn.

source: Now you can import your current work to the repository, or simply create a folder in the repository to start a new module from scratch.
de: Jetzt können Sie den aktuellen Stand ihres Projektes in das Archiv importieren oder einfach einen neuen Ordner im Archiv anlegen, wenn Sie ein neues Modul anlegen wollen.

source: &cervisia; offers an integrated front-end to manage all your repository locations, the <guilabel>Configure Access to Repositories</guilabel> dialog. To display it, select the <menuchoice><guimenu>Repository</guimenu> <guimenuitem>Repositories...</guimenuitem></menuchoice> menu item.
de: &cervisia; bietet eine Benutzeroberfläche zur Verwaltung Ihrer Archive. Wählen Sie aus dem Menü <menuchoice><guimenu>Archiv</guimenu><guimenuitem>Archive ... </guimenuitem></menuchoice>, um den Dialog <guilabel>Zugang zu den &CVS;-Archiven einrichten</guilabel> aufzurufen.

source: <title>A screenshot of &cervisia;'s Configure Access to Repositories dialog</title>
de: <title>Ein Bildschirmfoto des Dialogs <quote>Zugang zu den CVS-Archiven einrichten</quote></title>

source: <phrase>A screenshot of &cervisia;'s Configure Access to Repositories dialog</phrase>
de: <phrase>Ein Bildschirmfoto des Dialogs <quote>Zugang zu den CVS-Archiven einrichten</quote></phrase>

source: There are several methods to access a &CVS; repository. It may be reached via password authentication (:pserver:), secure shell (using :ext:), local repository (:local:), &etc; The format for the repository location is (optional items appear between square brackets):
de: Sie können auf verschiedene Arten auf ein &CVS;-Archiv zugreifen. Der Zugriff kann über Passwort-Authentifizierung (:puser:), die Secure Shell (unter Verwendung von :ext:), lokal (:lokal:) &etc; erfolgen. Das Format für den Zugriffspfad auf ein Archiv ist wie folgt (optionale Bestandteile sind in eckige Klammern eingefasst):

source: [:method:][[user][:password]@]hostname[:[port]]/path/to/repository
de: [:method:][[user][:password]@]hostname[:[port]]/pfad/zum/archiv

source: Not all these items (user, password, hostname, port) are always necessary to access the repository. The required information depends on the access method used, which can be categorized as follows:
de: Es werden nicht immer alle Elemente (user, password, hostname, port) benötigt, um auf das Archiv zuzugreifen.Die benötigten Informationen hängen von der Methode ab, mit der auf das Archiv zugegriffen wird, die wie folgt eingeteilt werden können:

source: Local
de: Lokal

source: The local access method is the default method used by &CVS;. Therefore, it is optional to add the :local: method to the repository location: you can enter simply the path to the folder which stores the &CVS; repository, and is accessible from your computer, like <filename class="directory">/path/to/repository</filename> or to give a real life example, <filename class="directory">/home/cvs</filename>.
de: Die lokale Zugriffsmethode ist die Standardmethode für &CVS;. Daher ist die Angabe der :local:-Methode im Pfad des &CVS;-Archivs freiwillig. Geben Sie nur den Pfad zum Ordner Ihres &CVS;-Archivs an, auf das Sie von Ihrem Rechner aus Zugriff haben: <filename class="directory">/pfad/zum/archiv</filename>, oder, um ein richtiges Beispiel zu geben, <filename class="directory">/home/cvs</filename>.

source: It may physically be on a disk which is mounted via <acronym>NFS</acronym>, but this is an irrelevant detail. If you created a local repository, the location will be simple the path to it.
de: Das Archiv kann physisch auf einem Datenträger liegen, der über <acronym>NFS</acronym> eingebunden ist, das ist hier aber unwichtig. Wenn Sie ein lokales Archiv angelegt haben, ist der Pfad des &CVS;-Archivs der Verzeichnispfad.

source: The repository location is something like <filename>:ext:username@host.url.org:/path/to/repository</filename>.
de: Der Name des &CVS;-Archivs sieht so aus: <filename>:extbenutzername@host.url.org:/pfad/zum/archiv</filename>.

source: This method requires that you have a user account on the server machine (in this example, <systemitem class="systemname">host.url.org</systemitem>) and use a remote shell for communication. By default, &CVS; uses &rsh; for this purpose; however, &rsh; has long considered to be insecure, and is widely replaced by &ssh;.
de: Diese Methode setzt voraus, dass Sie einen Benutzerzugang auf dem Server (in diesem Beispiel <systemitem class="systemname">host.url.org</systemitem>)besitzen und auf diesen über eine Remote-Shell zugreifen. &CVS; benutzt dazu normalerweise &rsh;. Da &rsh; jedoch allgemein als unsicher gilt, wird es mittlerweile weitgehend durch &ssh; verdrängt.

source: If you wish to use &ssh;, you must set the environment variable $<envar>CVS_RSH</envar> to &ssh; when using the <command>cvs</command> client. &cervisia; supports this easily.
de: Wenn Sie den Befehl <command>cvs</command> verwenden und der Zugriff über &ssh; erfolgen soll, müssen Sie die Umgebungsvariable $<envar>CVS_RSH</envar> mit dem Wert &ssh; belegen. &cervisia; unterstützt auch diese Art der Verbindung.

source: Note that &cervisia; cannot answer possible password requests from the server machine. You must make sure that a remote login works without requiring you to enter the password. With plain vanilla &rsh;, this can be achieved for example by creating a <filename>.rhosts</filename> file in your home folder with a list of trusted hosts (see the &rsh; manpage).
de: Beachten Sie, dass &cervisia; mögliche Passwortabfragen des Servers nicht beantworten kann. Sie müssen sicherstellen, dass die Anmeldung beim Server ohne Eingabe eines Passwortes funktioniert. Mit einem normalen &rsh; erreichen Sie dies beispielsweise durch Anlegen einer Datei <filename>.rhosts</filename> in Ihrem Persönlichen Ordner, in der eine Liste der vertrauenswürdigen Host-Rechner eingetragen wird. Näheres dazu finden Sie in der Manpage zu &rsh;.

source: With &ssh;, it can be achieved by copying your public key located in the file <filename>identity.pub</filename>, located in the <filename>$<envar>HOME</envar>/.ssh/</filename> folder to the server. In this case, the key must not be encrypted with a passphrase (see the &ssh; manpage and the &CVS;/<acronym>SSH</acronym> <acronym>FAQ</acronym> on SourceForge). If you are unsure about these issues, ask your system administrator.
de: Verwenden Sie &ssh;, erreichen Sie dies durch Kopieren Ihres öffentlichen Schlüssels aus der Datei <filename>identity.pub</filename> (liegt in <filename>$<envar>HOME</envar>/.ssh/</filename>) auf den Server. In diesem Fall darf der Schlüssel nicht mit einer Passphrase verschlüsselt sein. Beachten Sie hierzu auch die Manpage zu &ssh; und die &CVS;/<acronym>SSH</acronym> <acronym>FAQ</acronym> auf SourceForge. Wenn Sie mit diesen Angaben nicht zurecht kommen, fragen Sie Ihren Systemadministrator.

source: The repository location looks like <filename>:pserver:username@host.url.org:/path/to/repository</filename>
de: Der Name des &CVS;-Archivs sieht so aus: <filename>:pserver:benutzername@host.url.org:/pfad/zum/archiv</filename>

source: This method accesses the server via a special protocol with a relatively weak authentication (<literal>pserver</literal> stands for password authentication). Before you can use such a server, you need a username and password given by the &CVS; server administrator, and you have to login. Note that your &CVS; password authentication username does not necessarily match the system's username. Before accessing the &CVS; server, you will need to login.
de: Diese Methode greift über ein spezielles Protokoll auf den Server zu. Die hier verwendete Authentifizierung ist nicht sonderlich sicher (<literal>pserver</literal> steht hier für Password-Authentifizierung). Bevor Sie einen solchen Server nutzen können, benötigen Sie einen Benutzernamen und ein Passwort vom &CVS;-Serveradministrator, müssen Sie sich anmelden. Beachten Sie, dass Ihr &CVS;-Benutzername nicht mit dem des Systems übereinstimmen muss. Bevor Sie auf den &CVS;-Server zugreifen können, müssen Sie sich anmelden.

source: Open-source projects typically offer Anonymous &CVS; access to their sources. This means you can easily grab the latest sources, modify, and create patches (differences) against the repository without asking for a &CVS; account. As a general rule, Anonymous &CVS; uses password authentication (:pserver:), and is a read-only repository, not allowing you to upload your changes directly.
de: Open-Source-Projekte bieten normalerweise anonymen &CVS;-Zugriff zu den Quelltexten. Sie können so die neusten Versionen beziehen, verändern, und Patches (Unterschiede zwischen Dateien) mit dem Archiv erstellen, ohne einen &CVS;-Account zu haben. Normalerweise verwendet anonymes &CVS; Passwort-Authentisierung (:pserver:), und stellt das Archiv nur lesend bereit, sodass Sie Ihre Änderungen nicht direkt einspielen können.

source: Knowing the access method and location to the repository, you can add it to &cervisia;'s repositories list:
de: Wenn Sie die Zugriffsmethode und den Ort des CVS-Archivs kennen, können Sie es zur Liste der CVS-Archive in &cervisia; hinzufügen:

source: Adding a New Repository
de: Hinzufügen eines neuen &CVS;-Archivs

source: Open the <guilabel>Configure Access to Repositories</guilabel> dialog by choosing the <menuchoice><guimenu>Repository</guimenu> <guimenuitem>Repositories...</guimenuitem></menuchoice> menu item.
de: Öffnen Sie den Dialog <guilabel>Zugang zu den &CVS;-Archiven einrichten</guilabel>, indem Sie aus dem Menü <menuchoice><guimenu>Archiv</guimenu><guimenuitem>Archive ...</guimenuitem></menuchoice> wählen.

source: Press the <guilabel>Add...</guilabel> button to open the <guilabel>Add Repository</guilabel> dialog.
de: Mit den Knopf <guilabel>Hinzufügen ...</guilabel> öffnen Sie den Dialog <guilabel>Archiv hinzufügen</guilabel>.

source: Enter the repository location in the <guilabel>Repository:</guilabel> text box. &cervisia; will automatically disable the areas of the dialog that are not relevant to the access method you entered.
de: Geben Sie die Ort des CVS-Archivs in das Textfeld <guilabel>Archiv:</guilabel> ein. &cervisia; wird die Teile des Dialogs, die für die eingegebene Zugriffsmethode nicht wichtig sind, automatisch ausblenden.

source: If you are using the ext method to access the repository, enter the remote shell you wish to use (&eg; &ssh;) in the <guilabel>Use remote shell (only for :ext: repositories):</guilabel> text box.
de: Wenn Sie die Methode <quote>ext</quote> zum Zugriff auf das CVS-Archiv verwenden, geben Sie die gewünschte Remote-Shell (&eg; &ssh;) in das Textfeld <guilabel>Remote-Shell verwenden:</guilabel> ein.

source: Press <guibutton>OK</guibutton>. You will see the repository you just entered on the repositories list.
de: Drücken Sie <guibutton>OK</guibutton>. Nun sehen Sie das neu angelegte CVS-Archiv in der Liste der CVS-Archive.

source: If the access method to the repository you just entered is password authentication (pserver), you will need to login before connecting the server. Click the repository on the list to select it, and press the <guilabel>Login...</guilabel> button. Enter your password in the upcoming dialog.
de: Haben Sie für das CVS-Archiv die Zugriffsmethode Passwort-Authentisierung (pserver) gewählt, müssen Sie sich anmelden, bevor Sie zum Server eine Verbindung herstellen können. Klicken Sie auf das CVS-Archiv in der Liste um es auszuwählen, und drücken Sie <guilabel>Anmeldung ...</guilabel>. Geben Sie Ihr Passwort in den erscheinenden Dialog ein.

source: If you successfully enter your password, the <guilabel>Status</guilabel> column entry of the pserver repository will change from <guilabel>Not logged in</guilabel> to <guilabel>Logged in</guilabel>.
de: Wenn Ihre Passworteingabe erfolgreich war, ändert sich die Spalte <guilabel>Status</guilabel> für das pserver-CVS-Archiv von <guilabel>Nicht angemeldet</guilabel> zu <guilabel>Angemeldet</guilabel>.

source: Press <guibutton>OK</guibutton> to apply your modifications, or add another location to the list. &cervisia; will store as many locations as you like.
de: Drücken Sie <guibutton>OK</guibutton> um Ihre Änderungen anzuwenden, oder fügen Sie der Liste ein weiteres CVS-Archiv hinzu. &cervisia; speichert beliebig viele CVS-Archive.

source: Importing a Module Into the Repository
de: Ein Modul in das &CVS;-Archiv importieren

source: In this section, we discuss how you can put a new project into the &CVS; repository. If you just want to work with an existing project which is already in a repository, you may skip this section.
de: Dieser Abschnitt behandelt das Hinzufügen eines neuen Projektes in ein &CVS;-Archiv. Wenn Sie nur mit Projekten arbeiten, die bereits in einem &CVS;-Archiv sind, können Sie diesen Abschnitt überspringen.

source: There are two ways to put a project into the &CVS;:
de: Es gibt zwei Wege, Ihr Projekt in ein CVS-Archiv zu bringen:

source: Import the files and folders to a new <firstterm>module</firstterm>, using &cervisia;'s import dialog. Modules are the top folders in the &CVS; repository folder tree, and are used to separate and organize the different software projects inside the repository.
de: Die Dateien und Ordner mit dem &cervisia;-Importdialog in ein neues <firstterm>Modul</firstterm> importieren. Module sind die obersten Ordner des Verzeichnisbaums im &CVS;-Archiv und werden zur Organisation verschiedener Projekte in einem &CVS;-Archiv verwendet.

source: Create an empty module and add the new files and folders manually. You will have more control, but it will probably take a little more time.
de: Ein leeres Modul erstellen, und die neuen Dateien und Ordner selbst hinzufügen. So haben Sie mehr Kontrolle, aber es ist etwas zeitaufwändiger.

source: Keep in mind that &CVS; was initially designed to handle text files. Many features, like revision merging, creating differences in a readable form, &etc; are only performed to text files. This does not mean you cannot use &CVS; to keep binary files, it just means you have to <emphasis>explicitly tell &CVS; if it is a text or binary file</emphasis>. If you declare the wrong file type, you will experience problems with the &CVS; functionality for these files, and they may get corrupted.
de: Beachten Sie, dass &CVS; ursprünglich entwickelt wurde, um Textdateien zu verwalten. Viele Eigenschaften, wie Zusammenführen von Revisionen, Anzeigen von Unterschieden in lesbarer Form &etc;, sind nur mit Textdateien möglich. Das bedeutet nicht, dass Sie &CVS; nicht zur Verwaltung binärer Dateien verwenden können, sie müssen jedoch <emphasis>&CVS; ausdrücklich sagen, ob es sich um eine Text- oder Binärdatei handelt</emphasis>. Geben Sie einen falschen Dateityp an, funktioniert &CVS; mit diesen Dateien nicht richtig, und sie können beschädigt werden.
