Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdesdk/cervisia.po
Languages: de

source: You get a dialog that shows you a list of the selected files on the top section and a log message for your changes below. &cervisia; helps you in several ways to find a meaningful log message: first, in the file list you can double-click a file or press <keycap>Return</keycap> in order to see the changes you have made to the file. Second, it gives you a list of log messages you have previously used in a combo box. Third, this dialog is integrated with &cervisia;'s changelog editor described below. When you have finished the dialog, the command
de: &cervisia; unterstützt Sie auf vielfältige Weise bei der Erstellung des Log-Eintrags. Zum Einen können Sie eine Datei in der Liste durch Doppelklick oder Betätigen von <keycap>Eingabe</keycap> auswählen, um die Änderungen zu sehen, die Sie an dieser Datei durchgeführt habe. Desweiteren bietet Ihnen &cervisia; eine Liste der von Ihnen zuletzt eingegebenen Log-Einträge zur Auswahl. Und zu guter Letzt ist der Dialog mit dem weiter unten beschriebenen Changelog-Dialog verbunden. Der Befehl

source: <command>cvs commit -m <replaceable>message</replaceable> <replaceable>file names</replaceable></command>
de: <command>cvs commit -m <replaceable>Log-Eintrag</replaceable> <replaceable>Dateinamen</replaceable></command>

source: is used.
de: wird verwendet.

source: A common error you may encounter when committing is <errorname>Up-to-date check failed</errorname>. This indicates that someone has committed changes to the repository since you last updated; or, more technically, that your <literal>BASE</literal> revision is not the newest on its branch. In such a case, &CVS; refuses to merge your modifications into the repository. The solution is to update, resolve any conflicts and commit again. Of course, if you are working on a software project, it is normally good style to check if the program still works after you have updated - after all, there could be bad interactions between your modifications and the other modifications which break the code.
de: Eine häufig anzutreffende Fehlermeldung beim Einspielen ist die Meldung <errorname>Up-to-date check failed</errorname>. Das bedeutet, dass jemand anders seit Ihrem letzten Aktualisieren Änderungen in das &CVS;-Archiv eingespielt hat. Oder technisch ausgedrückt: Ihre <literal>BASE</literal>-Version der Dateien, auf denen Sie Ihre Änderungen durchgeführt haben, ist nicht die aktuellste im &CVS;-Archiv. In einem solchen Fall weigert sich &CVS; Ihre Änderungen in das &CVS;-Archiv einzuspielen. Um dieses Problem zu lösen, müssen Sie Ihre lokale, geänderte Kopie aus dem &CVS;-Archiv aktualisieren, sämtliche auftretenden Konflikte auflösen und versuchen die so geänderte Datei erneut einspielen. Sofern Sie in einem Software-Projekt arbeiten, ist es natürlich empfehlenswert, zunächst zu prüfen, ob das Programm nach dem Update und dem Auflösen der Konflikte noch funktioniert, bevor Sie Ihre Version einspielen. Es können durch das Auflösen der Konflikte ohne weiteres Nebeneffekte auftreten, die das Funktionieren des Programms beeinträchtigen.

source: Another popular mistake results in the error message <errorname>Sticky tag 'X' for file 'X' is not a branch</errorname>. This happens if you try to commit a file which you have previously brought to a certain revision or tag with the command
de: Ein weiterer beliebter Fehler führt zu der Meldung <errorname>Sticky tag ‚X‘ for file ‚X‘ is not a branch</errorname>. Diese Fehler tritt auf, wenn Sie versuchen eine Datei einzuspielen, die Sie vorher auf ein bestimmtes Tag oder eine bestimmte Version gesetzt haben. Dies geschieht durch den Befehl:

source: (which is &eg; used by the menu item <menuchoice><guimenu>Advanced</guimenu><guimenuitem>Update to Tag/Date...</guimenuitem></menuchoice>). In such a case, the tag on the file gets sticky, &ie; further updates do not bring you to the newest revision on the branch. If you want to commit further revisions to the branch, you have to update to the branch tag before you do further commits.
de: Dieser Befehl wird von dem Menüeintrag <menuchoice><guimenu>Erweitert</guimenu><guimenuitem>Auf Tag/Datum aktualisieren ...</guimenuitem></menuchoice> verwendet. In einem solchen Fall wird die Datei <quote>sticky</quote>, &ie; Sie wird auf diesen Stand <quote>festgenagelt</quote>, sodass ein späteres Aktualisieren die Datei nicht auf die neueste Version im Zweig bringt. Wollen Sie weitere Versionen in den Zweig einspielen, müssen Sie die Datei erst auf das Zweig-Tag aktualisieren.

source: With &cervisia;, it is quite easy to maintain a ChangeLog file that is compliant with the format laid out in the &GNU; coding guidelines. To use it, choose <menuchoice><guimenu>File</guimenu><guimenuitem>Insert ChangeLog Entry...</guimenuitem></menuchoice>. If a file with the name <filename>ChangeLog</filename> exists in the toplevel folder of your sandbox, this file will be loaded and you have the possibility to edit it. To this end, at the top of the file, an entry with the current date and your user name (which can be configured as described in <xref linkend="customize-general"/>) is inserted. When you are finished the dialog can be closed by clicking <guibutton>OK</guibutton>, the next commit dialog you open will have the log message set to the message you last entered in the ChangeLog.
de: Mit &cervisia; ist es ziemlich einfach eine Changelog-Datei zu pflegen, die dem in den &GNU; Coding Guidelines festgelegten Format entspricht. Diese Funktionalität erreichen Sie über <menuchoice><guimenu>Datei</guimenu><guimenuitem>Changelog-Eintrag hinzufügen ...</guimenuitem></menuchoice>. Existiert im Hauptverzeichnis Ihres Arbeitsordners eine Datei mit dem Namen <filename>Changelog</filename>, wird diese geöffnet. Sie können diese nun bequem bearbeiten. Hierzu wird am Anfang der Datei ein Eintrag mit dem aktuellen Datum und Ihrem Benutzernamen eingefügt. Näheres zur Einstellung des Benutzernamens finden Sie unter <xref linkend="customize-general"/>. Beenden Sie den Dialog mit <guibutton>OK</guibutton>. Beim nächsten Öffnen finden Sie den hier eingegebenen Text als Voreinstellung für den Log-Eintrag im Einspielen-Dialog.

source: Resolving Conflicts
de: Auflösen von Konflikten

source: Conflicts may occur whenever you have made changes to a file which was also modified by another developer. The conflict is detected by &CVS; when you update the modified file; &CVS; then tries to merge the modifications committed by the other developer into your working copy. The merge fails if both your and his modifications are in overlapping parts of the file, and the &CVS; server issues an error message.
de: Konflikte können immer dann auftreten, wenn Sie eine Datei ändern und gleichzeitig ein anderer Entwickler Änderungen an derselben Datei durchgeführt hat. Solche Konflikte werden von &CVS; beim Aktualisieren entdeckt. &CVS; versucht dann, die von dem anderen Entwickler durchgeführten Änderungen mit Ihrer lokalen Kopie zusammenzuführen. Das schlägt dann fehl, wenn sich Ihre Änderungen mit denen des anderen Entwicklers überschneiden. Der &CVS;-Server gibt in diesem Fall eine Fehlermeldung aus.

source: In &cervisia;'s main view, files with conflicts are indicated with "Conflict" in the status column and with a red color. It is your job now to resolve these conflicts before you commit the file. &CVS; will refuse to commit any files with conflicts until they have been edited. From the main view, you can of course resolve conflicts the traditional way: just double-click the file in question and edit it with your favorite editor.
de: In der Hauptansicht von &cervisia; werden Dateien mit Konflikten durch den Text <quote>Konflikt</quote> in der Status-Spalte und durch Rotfärbung gekennzeichnet. Es ist Ihre Aufgabe, diese Konflikte vor dem Einspielen der Dateien aufzulösen. &CVS; wird sich weigern, Dateien mit Konflikten einzuspielen, bis Sie sie bearbeitet haben. Natürlich können Sie Konflikte auf die traditionelle Art durch Doppelklick und anschließendes Bearbeiten der Datei im Editor auflösen.

source: &CVS; marks the conflicting changes by placing marks in the middle of the files, in the following manner:
de: &CVS; markiert Stellen an denen Konflikte auftreten in den Dateien wie folgt:

source: &lt;&lt;&lt;&lt;&lt;&lt;&lt; Changes in your working copy ======= Changes in the repository &gt;&gt;&gt;&gt;&gt;&gt;&gt; revision_number
de: &lt;&lt;&lt;&lt;&lt;&lt;&lt; Änderungen in der Arbeitskopie ======= Änderungen im &CVS;-Archiv &gt;&gt;&gt;&gt;&gt;&gt;&gt; Revisionsnummer

source: You should replace this whole block with the new merged version. Of course, you have a great amount of freedom when resolving a set of conflicts: for each conflict you can decide to take one of the two alternative versions. You can also decide that both approaches are broken and rewrite a whole routine or the complete file from scratch.
de: Sie sollten den gesamten Block durch eine zusammengeführte Version ersetzen. Beim Auflösen der Konflikte haben Sie große Freiheiten. Sie können bei jedem Konflikt entscheiden, ob Sie die eine oder die andere Variante beibehalten wollen. Genausogut können Sie beide Änderungen verwerfen und die komplette Funktion oder sogar die ganze Datei neu schreiben.

source: Fortunately, &cervisia; offers a nicer interface for handling these conflicts. This does not mean that you will never need to manually edit the files, but at least can eliminate the need to do so for the trivial conflict resolution. To use &cervisia;'s <guilabel>CVS Resolve</guilabel> dialog choose <menuchoice><guimenu>File</guimenu><guimenuitem>Resolve...</guimenuitem></menuchoice> or right click the marked file and choose <guimenuitem>Resolve...</guimenuitem> from the context menu.
de: Glücklicherweise bietet &cervisia; eine schöne Oberfläche, um Konflikte zu behandeln. Das bedeutet nicht, dass Sie niemals Dateien von Hand bearbeiten müssen, aber einfache Konflikte lassen sich so ohne manuelles Editieren lösen. Um den Dialog <guilabel>Auflösen von Konflikten</guilabel> zu verwenden, wählen Sie <menuchoice><guimenu>Datei</guimenu><guimenuitem>Konflikte auflösen ...</guimenuitem></menuchoice> aus dem Menü, oder klicken Sie mit der rechten Maustaste auf eine der markierten Dateien und wählen Sie aus dem Kontextmenü <guimenuitem>Konflikt auflösen</guimenuitem>.

source: <title>A screenshot of &cervisia;'s resolve dialog</title>
de: <title>Ein Bildschirmfoto des Dialogs <quote>Auflösen von Konflikten</quote></title>

source: <phrase>A screenshot of &cervisia;'s resolve dialog</phrase>
de: <phrase>Ein Bildschirmfoto des Dialogs <quote>Auflösen von Konflikten</quote></phrase>

source: On the top of the dialog, you see <guilabel>Your version (A)</guilabel> of the file on the left hand side and the version in the repository, <guilabel>Other version (B)</guilabel>, on the right hand side. The differences between them are marked in red color. Below these two versions, you can see the <guilabel>Merged version</guilabel>. The merged version reflects what that section will be in your working copy if you press the <guibutton>Save</guibutton> button.
de: Im oberen Teil des Dialogs sehen Sie auf der linken Seite <guilabel>Ihre Version (A):</guilabel> und auf der rechten Seite die <guilabel>Andere Version (B):</guilabel>, die im &CVS;-Archiv vorliegt. Die Unterschiede zwischen den Dateien sind rot markiert. Unterhalb der beiden Versionen sehen Sie die <guilabel>Zusammengeführte Version:</guilabel>, die gespeichert wird, sobald Sie den Knopf <guibutton>Speichern</guibutton> betätigen.

source: You can go back and forward between the conflicting sections by pressing <guibutton>&lt;&lt;</guibutton> and <guibutton>&gt;&gt;</guibutton>. In the lower middle of the dialog you can see which section is currently marked. For example, <literal>2 of 3</literal> means that you are currently at the second differing section of 3 total.
de: Mit den Knöpfen <guibutton>&lt;&lt;</guibutton> und <guibutton>&gt;&gt;</guibutton> können Sie zwischen den abweichenden Bereichen hin- und herschalten. Sie können im Dialog sehen, welcher Abschnitt gerade markiert ist. Die Anzeige <literal>2 von 3</literal> bedeutet, dass Sie sich gerade im zweiten von insgesamt drei voneinander abweichenden Bereichen befinden.

source: Now you can decide section by section which version you want to have in the merged file. By pressing <guibutton>A</guibutton>, you take over the version you edited. By pressing <guibutton>B</guibutton>, you take over the version from the repository. By pressing <guibutton>A+B</guibutton>, both versions will be added, and your version will come first. <guibutton>B+A</guibutton> yields the same result, but the order will be different: first the repository version, then yours.
de: In jedem Abschnitt können Sie sich für eine der beiden Versionen entscheiden, die dann in der zusammengeführten Datei gespeichert wird. Mit dem Knopf <guibutton>A</guibutton> übernehmen Sie Ihre Version, mit dem Knopf <guibutton>B</guibutton> die Version aus dem &CVS;-Archiv. <guibutton>A+B</guibutton> bedeutet, dass beide Versionen übernommen werden, erst Ihre, dann die aus dem Archiv. Auch mit <guibutton>B+A</guibutton> werden beide Versionen übernommen, jedoch in umgekehrter Reihenfolge; zuerst die aus dem Archiv, dann Ihre.

source: If you are not happy with any of these versions, press <guibutton>Edit</guibutton> to open a simple text editor where you can edit the section. When you are finished editing, press <guibutton>OK</guibutton> to return to the <guilabel>CVS Resolve</guilabel> dialog and resume solving conflicts. You will see the section you just edited in the <guilabel>Merged version</guilabel>, with your modifications.
de: Sollten Sie mit einer der Versionen nicht zufrieden sein, können Sie mit dem Knopf <guibutton>Bearbeiten</guibutton> einen einfachen Editor zum Bearbeiten des Abschnitts öffnen. Sind Sie damit fertig, drücken Sie <guibutton>OK</guibutton> um zum Dialog <guilabel>Auflösen von Konflikten</guilabel> zurück zu kehren und die weiteren Konflikte aufzulösen. In der <guilabel>Zusammengeführten Version:</guilabel> sehen Sie nun die eben gemachten Änderungen.

source: To save your modifications, overwriting the working copy version, press <guibutton>Save</guibutton>. Note that this will save the choices not only the section you are currently viewing, but all sections in the file. If you want to save it to another file, press <guibutton>Save As...</guibutton>. Press <guibutton>Close</guibutton> to exit the dialog. If you close the dialog without saving, the changes you made will be lost.
de: Um die Änderungen zu speichern und die Arbeitskopie zu überschreiben, drücken Sie <guibutton>Speichern</guibutton>. Beachten Sie, dass alle Abschnitte gespeichert werden, nicht nur der aktuell angezeigte. Möchten Sie die Änderungen in eine andere Datei speichern, drücken Sie <guibutton>Speichern unter ...</guibutton>. Zum verlassen des Dialoges drücken Sie <guibutton>Schließen</guibutton>. Wenn Sie den Dialog schließen, ohne zu speichern, gehen die Änderungen verloren.

source: Obtaining Information About Files and Creating Patches
de: Informationen über Dateien erhalten und Patches erstellen

source: Watching Differences Between Revisions
de: Untersuchen von Unterschieden zwischen Dateiversionen

source: There are several places in &cervisia; where you can ask for a window showing the differences between revisions of a file:
de: Es gibt in &cervisia; verschiedene Stellen, an denen Sie sich die Unterschiede zwischen den einzelnen Versionen einer Datei anzeigen lassen können:

source: In the main view, you can choose <menuchoice><guimenu>View</guimenu><guimenuitem>Difference to Repository (BASE)...</guimenuitem></menuchoice>. This is based on the command <command>cvs diff</command> and shows you the differences between the version in your sandbox and the version to which you last updated (also known as <literal>BASE</literal>). This is in particular useful just before you commit a file, so you can find an appropriate log message.
de: In der Hauptansicht tun Sie dies mit <menuchoice><guimenu>Ansicht</guimenu><guimenuitem>Abweichungen vom Archiv ...</guimenuitem></menuchoice>. Es wird der Befehl <command>cvs diff</command> verwendet, und Ihnen werden die Unterschiede zwischen der Version in Ihrem Arbeitsordner und der Version auf die Sie zuletzt aktualisiert haben (auch als <literal>BASE</literal> bekannt) angezeigt. Dies ist vor dem Einspielen einer Datei sinnvoll, um eine angemessene Nachricht für das Protokoll schreiben zu können.

source: You can view the differences between the version in your sandbox and the version in the main development branch (also called <literal>HEAD</literal>) by choosing <menuchoice><guimenu>View</guimenu> <guimenuitem>Difference to Repository (HEAD)...</guimenuitem></menuchoice>.
de: Sie können sich auch die Unterschiede zwischen der Version in Ihrem Arbeitsordner und der Version im Haupt-Entwicklungszweig (auch als <literal>HEAD</literal> bekannt) anzeigen lassen, indem Sie im Menü <menuchoice><guimenu>Ansicht</guimenu><guimenuitem>Abweichungen vom Archiv (HEAD) ...</guimenuitem></menuchoice> wählen.

source: You can view the differences between the last two revisions of the selected file choosing <menuchoice><guimenu>View</guimenu> <guimenuitem>Last Change...</guimenuitem></menuchoice>.
de: Die Unterschiede zwischen den letzten beiden Dateiversionen bekommen Sie über <menuchoice><guimenu>Ansicht</guimenu><guimenuitem>Letzte Änderung ...</guimenuitem></menuchoice> angezeigt.

source: You can access the <guimenuitem>Difference to Repository (BASE)...</guimenuitem>, <guimenuitem>Difference to Repository (HEAD)...</guimenuitem> and <guimenuitem>Last Change...</guimenuitem> menu items from the main view context menu, by right-clicking the file you want to view.
de: Sie können <guimenuitem>Abweichungen vom Archiv ...</guimenuitem>, <guimenuitem>Abweichungen vom Archiv (HEAD) ...</guimenuitem> und <guimenuitem>Letzte Änderung ...</guimenuitem> zusätzlich über das Kontextmenü der Hauptansicht erreichen, indem Sie auf die gewünschte Datei rechtsklicken.

source: In the dialog that is shown when a you commit a set of files, you can request a difference window by selecting a file name in the selection list, either by double-clicking it or by pressing <keycap>Return</keycap>. This is quite similar to using <menuchoice><guimenu>View</guimenu><guimenuitem>Difference to Repository (BASE)...</guimenuitem></menuchoice> with the respective file in the main view.
de: Im Dialog, der beim Einspielen von Dateien angezeigt wird, können Sie eine Ansicht der Unterschiede aufrufen, indem Sie entweder die Datei mit der Maus Doppelklicken oder die Taste <keycap>Eingabe</keycap> drücken. Dies ist vergleichbar mit dem Aufruf von <menuchoice><guimenu>Ansicht</guimenu> <guimenuitem>Abweichungen zum Archiv ...</guimenuitem></menuchoice> in der Hauptansicht.

source: In the Browse Logs dialog, you can mark two revisions of a file and request a dialog showing the differences between them (see <xref linkend="browsinglogs"/>).
de: Im Dialog <quote>CVS-Log</quote> können Sie zwei Versionen einer Datei markieren und sich die Unterschiede in einem Dialog anzeigen lassen. Näheres dazu finden Sie unter <xref linkend="browsinglogs"/>.

source: As you may have expected, &cervisia; does not just dump the output of the <command>diff</command> command into your terminal, but shows you a graphical view as seen in <xref linkend="screenshot-log"/>.
de: Wie Sie vielleicht erwarten, zeigt &cervisia; nicht einfach nur die Ausgabe des Befehls <command>diff</command> an, sondern bietet eine grafische Ansicht wie Sie sie unter <xref linkend="screenshot-log"/> sehen.

source: <title>A screenshot of &cervisia;'s diff dialog</title>
de: <title>Ein Bildschirmfoto des Dialogs <quote>CVS-Diff</quote></title>

source: <phrase>A screenshot of &cervisia;'s diff dialog</phrase>
de: <phrase>Ein Bildschirmfoto des Dialogs <quote>CVS-Diff</quote></phrase>

source: The text in the dialog is an improved variant of the text given by the diff command with the <option>-u</option> option. You can see the differing versions in two windows, with lines arranged such that you can do a side-by-side comparison. That means, where text has been added or deleted, the respective window shows empty lines with the marker <literal>+++++</literal> at the left hand side. Elsewhere, you can see the running number of each line in the left column.
de: Der im Dialog anzeigte Text ist eine verbesserte Variante der Ausgabe des Diff-Befehls mit dem Parameter <option>-u</option>. Die beiden Versionen der Datei werden in zwei Fenstern so nebeneinander dargestellt, dass Sie einen direkten Vergleich der einzelnen Zeilen vornehmen können. D. h. dass beispielsweise dort, wo Zeilen entfernt oder hinzugefügt wurden, diese als Leerzeile mit der linksseitigen Markierung <literal>+++++</literal> dargestellt werden. Ansonsten wird die Zeilennummer in der linken Spalte angezeigt.

source: In the second column in the right window, you can see which kind of change has been made. Possible types are <literal>Add</literal>, <literal>Delete</literal> and <literal>Change</literal>. The respective lines are marked in blue, green and red color. In the middle of the dialog a compressed image of the color markers is shown. In this way, you can get a quick overview of the overall changes to the file. You can also use the position of the colored regions in the compressed image as an orientation when you using the scroll bars.
de: Die zweite Spalte im rechten Fenster zeigt an, welche Änderung durchgeführt wurde. Möglich sind <literal>Hinzugefügt</literal>, <literal>Gelöscht</literal> und <literal>Geändert</literal>. Die entsprechenden Zeilen sind in blau, grün und rot markiert. In der Mitte des Dialogs wird eine komprimierte Version der Farbmarkierungen dargestellt. Auf diese Weise erhalten Sie einen schnellen Überblick über die in der Datei aufgetretenen Änderungen. Sie können darüber hinaus die Position der eingefärbten Bereiche als Orientierungshilfe beim Blättern in der Datei nutzen.

source: Normally, the scrollbars at the left and the right window are synchronized, &ie; if you scroll on the left hand side, the right hand side is scrolled by the same amount. You can change this by checking the box <guibutton>Synchronize scroll bars</guibutton>.
de: Normalerweise werden die Bildlaufleisten des rechten und linken Fensters synchronisiert, &ie; wenn Sie im linken Fenster blättern, wird das rechte Fenster automatisch mitgeführt. Sie können dieses Verhalten über das Ankreuzfeld <guibutton>Bildlaufleisten synchronisieren</guibutton> ändern.

source: For information about how to customize the diff dialog, see <xref linkend="customize-diff"/>.
de: Weitere Information zur Anpassung des Diff-Dialogs finden Sie unter <xref linkend="customize-diff"/>.

source: Creating Patches
de: Patches erstellen
