Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdesdk/cervisia.po
Languages: de

source: Importing a project (as a new module) has some advantages: you will import all files and folders recursively, and the module will automatically be created for you. This makes importing large existing projects to the repository easier. However, there are some disadvantages: you cannot use &cervisia;'s import dialog to add files to existing modules, and you can either import the files as text or binary files. You can work around this limitation by creating a folder with files of only one of the types, or by informing the patterns of the files that should be ignored during the import process.
de: Ein Projekt (als neues Modul) zu importieren, hat einige Vorteile: Sie importieren alle Dateien und Ordner rekursiv, und das Modul wird automatisch erstellt. Das vereinfacht den Import großer, existierender Projekte. Der Nachteil dabei ist, dass Sie nicht den Importdialog von &cervisia; benutzen können, um Dateien zum bestehenden Modul hinzuzufügen. Zudem können Sie die Dateien entweder als Text- oder Binärdateien importieren. Um dieses Problem zu umgehen, erstellen Sie einen Ordner für jeden der Dateitypen, oder Sie erstellen eine Liste mit Mustern für Dateinamen, die beim Import ignoriert werden sollen.

source: For instance, suppose your project contains text files and some PNG images (binary files) only. You can tell &CVS; to ignore all files with the pattern <filename class="extension">*.png</filename> while importing the other files as text, or you can move the images to a separate folder, and then import the remaining files (as text files). Either way, you will have to <link linkend="checkingout">checkout</link> the newly imported module to a new working copy, copy the missing files and folders to it, <link linkend="addingfiles">add</link> and <link linkend="committingfiles">commit</link> them to the repository to complete the import process.
de: Stellen Sie sich &eg; vor, Ihr Projekt besteht nur aus Textdateien und einigen PNG-Bildern (Binärdateien). Sie können &CVS; sagen, dass alle Dateien, die auf das Muster <filename class="extension">*.png</filename> passen, ignoriert werden sollen, während die anderen Dateien als Textdateien importiert werden. Oder Sie verschieben die Bilder in einen anderen Ordner und importieren alle verbleibenden Dateien (als Textdateien). In jedem Fall müssen Sie das neu importierte Modul als neue Arbeitskopie <link linkend="checkingout">auslesen</link>, die fehlenden Dateien und Ordner hineinkopieren, diese <link linkend="addingfiles">hinzufügen</link> und sie in das &CVS;-Archiv <link linkend="committingfiles">einspielen</link> um den Import abzuschließen.

source: As an alternative, you can add the files and folders manually, creating an empty module for them. To add an empty module to a repository, just create a new folder in the &CVS; repository root folder. The name of this new folder will be the name of the module. <link linkend="checkingout">Checkout</link> the new empty module. Then copy the files and folders to the working copy, <link linkend="addingfiles">add</link> and <link linkend="committingfiles">commit</link> to upload them to the &CVS; repository.
de: Alternativ können Sie Dateien und Ordner auch manuell hinzufügen, indem Sie für sie ein Modul erstellen. Um ein leeres Modul zu einem Archiv hinzuzufügen, erstellen Sie einen neuen Ordner im Wurzelverzeichnis des &CVS;-Archivs. Der Name des Ordners ist gleichzeitig der Modulname. <link linkend="checkingout">Checken Sie das neue, leere Modul aus</link>, kopieren Sie die Dateien und Ordner in die Arbeitskopie, <link linkend="addingfiles">fügen Sie sie dem Archiv hinzu</link> und <link linkend="committingfiles">spielen Sie sie in das &CVS;-Archiv ein</link>.

source: <title>A screenshot of &cervisia;'s import dialog</title>
de: <title>Ein Bildschirmfoto des Dialogs <quote>Importieren</quote></title>

source: <phrase>A screenshot of &cervisia;'s import dialog</phrase>
de: <phrase>Ein Bildschirmfoto des Dialogs <quote>Importieren</quote></phrase>

source: In <xref linkend="screenshot-import"/> you can see the dialog which helps you to <emphasis>import</emphasis> a project as a module. To access &cervisia;'s import dialog, choose the <menuchoice><guimenu>Repository</guimenu> <guimenuitem>Import...</guimenuitem></menuchoice> menu item.
de: In <xref linkend="screenshot-import"/> sehen Sie den Dialog, der Sie beim <emphasis>Importieren</emphasis> eines Projekts als Modul unterstützt. Um den Importdialog in &cervisia; aufzurufen, wählen Sie <menuchoice><guimenu>Archiv</guimenu><guimenuitem>Importieren ...</guimenuitem></menuchoice> aus dem Menü.

source: Repository:
de: Archiv:

source: Enter or select from the drop down box the name of the &CVS; repository, also known as $<envar>CVSROOT</envar>. You must have write access to it, and the repository must be properly initialized. If the repository does not yet exist, you can create one choosing the <menuchoice> <guimenu>Repository</guimenu> <guimenuitem>Create...</guimenuitem> </menuchoice> menu item.
de: In dem Auswahlfeld können Sie den Namen des &CVS;-Archivs, auch bekannt als $<envar>CVSROOT</envar>, eingeben oder auswählen. Sie müssen Schreibrechte im Archiv besitzen, und das &CVS;-Archiv muss entsprechend eingerichtet sein. Existiert das Archiv noch nicht, erstellen Sie es mit dem Menübefehl <menuchoice><guimenu>Archiv</guimenu><guimenuitem>Erstellen ...</guimenuitem></menuchoice>.

source: The drop down box shows a list of the repositories you previously entered using the <guilabel>Configure Access to Repositories</guilabel> dialog box. If the repository is remote, make sure that authentication works. See <xref linkend="accessing-repository"/> for more information.
de: Das Auswahlfeld zeigt eine Liste der Archive, die Sie zuvor über den Dialog <guilabel>Zugang zu den &CVS;-Archiven einrichten</guilabel> eingegeben haben. Handelt es sich um ein Archiv auf einem entfernten Rechner, müssen Sie zuvor sicherstellen, dass Sie sich erfolgreich anmelden können . Näheres hierzu finden Sie unter <xref linkend="accessing-repository"/>.

source: Module:
de: Modul:

source: The name of the module under which the project will be stored. After the import, the project can be checked out under this name. See <xref linkend="checkingout"/> for more information. This is also the name of the corresponding folder in the repository.
de: Der Name des Moduls, in dem das Projekt abgelegt wird. Nach dem Importieren kann das Projekt unter diesem Namen vom Server heruntergeladen werden. Näheres hierzu finden Sie unter <xref linkend="checkingout"/>. Dies ist gleichzeitig der Name des zugehörigen Ordners im &CVS;-Archiv.

source: Working Folder:
de: Arbeitsordner:

source: The toplevel folder of the project you want to import. The import starts from this folder and goes down recursively.
de: Dies ist der Hauptordner des Projektes, das Sie importieren möchten. Der Importvorgang beginnt in diesem Ordner und durchläuft rekursiv alle Unterordner.

source: Vendor tag:
de: Herkunfts-Tag:

source: The vendor tag is historically used for tracking third-party sources. Just use your user name if you have no better idea. It does not matter much what you enter here.
de: Das Herkunfts-Tag wurde ursprünglich dazu verwendet Quelltexte Dritter im Archiv zu kennzeichnen. Wenn Ihnen nichts besseres einfällt, tragen Sie hier Ihren Benutzernamen ein. Es ist völlig egal, was Sie hier eintragen.

source: Release tag:
de: Freigabe-Tag:

source: This tag is also historically used for importing different versions of third-party software. If you are not doing this, use the word <literal>start</literal> or a string <literal>FOO_1_0</literal> where <literal>FOO</literal> is the name of your project and <literal>1.0</literal> is the version number of the imported release.
de: Dieses Tag wird aus historischen Gründen für den Import verschiedener Versionen von Drittanbieter-Software verwendet. Wenn Sie so etwas nicht vorhaben, verwenden Sie einfach <literal>start</literal> oder den Bezeichner <literal>FOO_1_0</literal>, wobei <literal>FOO</literal> der Name ihres Projektes ist und <literal>1.0</literal> die Version der importierten Software.

source: Ignore files:
de: Folgende Dateien ignorieren:

source: If you fill out this field, an additional <option>-I <replaceable>file names</replaceable></option> option is given go the <command>cvs import</command> command. This entry is interpreted as a whitespace-separated list of file name patterns which are ignored. In general, a cleaner and less error-prone way to control which files go into the repository is to create a folder with only the files which you want to import and start from that. Nevertheless, this entry may be useful if the project contains files which are by default ignored by &CVS;, &eg; files with the name <filename>core</filename>. In such a case, simply enter the character <literal>!</literal> in this field: this overrules &CVS;'s scheme of ignored files, see <xref linkend="ignoredfiles"/>.
de: Wenn Sie dieses Eingabefeld ausfüllen, wird dem Befehl <command>cvs import</command> zusätzlich die Option <option>-I <replaceable>Dateinamen</replaceable></option> übergeben. Dieser Eintrag wird als eine Liste durch Whitespaces getrennter Dateinamen (oder Mustern) interpretiert, die beim Importieren ignoriert werden sollen. Allgemein ist es sicherer und weniger fehleranfällig, einen Ordner anzulegen, in dem nur solche Dateien vorhanden sind, die importiert werden sollen. Dennoch erweist sich diese Option als nützlich, wenn das Projekt Dateien enthält, die normalerweise von &CVS; ignoriert werden, &eg; Dateien mit dem Namen <filename>core</filename>. In diesem Fall geben Sie in das entsprechende Eingabefeld das Zeichen <literal>!</literal> ein. Damit werden die Standardeinstellungen von &CVS; für ignorierte Dateien überschrieben. Weitere Informationen dazu finden Sie unter <xref linkend="ignoredfiles"/>.

source: Comment:
de: Kommentar:

source: Use this field to record the comments you might have about the origin, use, development, &etc; of the files you are importing.
de: Verwenden Sie dieses Feld für Kommentare über Herkunft, Benutzung, Entwicklung &etc; der importierten Dateien.

source: Import as binaries
de: Als Binärdatei importieren

source: If you check this box, all files are imported in binary mode, &ie; an argument <option>-kb</option> is given to <command>cvs import</command>.
de: Ist dieses Ankreuzfeld markiert, werden alle Dateien im Binär-Modus importiert, &ie; dem Befehl <command>cvs import</command> wird die Option <option>-kb</option> übergeben.

source: Use file's modification as time of import
de: Änderungszeit der Datei als Zeit für den Import verwenden

source: If you check this box, the time of import will be the file's modification time instead of the import time.
de: Ist dieses Ankreuzfeld markiert, wird anstatt der eigentlichen Importzeit, die Zeit der letzten Änderung als Importzeit verwendet.

source: After you have filled out this form and confirmed by pressing <guibutton>OK</guibutton>, the following &CVS; command is used:
de: Wenn Sie die Eingabefelder ausgefüllt und Ihre Eingaben mit <guibutton>OK</guibutton> bestätigt haben, wird der folgende &CVS;-Befehl abgesetzt:

source: <command>cvs</command> -d <co id="co-repository"></co><replaceable>repository</replaceable> import -m "<co id="co-comment"></co>" <co id="co-module"></co><replaceable>module</replaceable> <co id="co-vendortag"></co><replaceable>vendortag</replaceable> <co id="co-releasetag"></co><replaceable>releasetag</replaceable>
de: <command>cvs</command> -d <co id="co-repository"></co><replaceable>archiv</replaceable> import -m "<co id="co-comment"></co>" <co id="co-module"></co><replaceable>modul</replaceable> <co id="co-vendortag"></co><replaceable>herkunfts_tag</replaceable> <co id="co-releasetag"></co><replaceable>freigabe_tag</replaceable>

source: Checkout a Module From the Repository
de: Herunterladen eines Moduls aus dem &CVS;-Archiv

source: Now that you successfully defined your repository location, and imported the initial files to the repository, it is time to retrieve the module from the &CVS; repository, creating your working copy.
de: Nachdem Sie erfolgreich den Speicherort des &CVS;-Archivs eingestellt und die benötigten Dateien eingespielt haben, können Sie nun das Modul aus dem &CVS;-Archiv auslesen um Ihre Arbeitskopie zu erstellen.

source: You should also know the name of the <firstterm>branch</firstterm> or <firstterm>tag</firstterm> you want to use.
de: Sie sollten den Namen des <firstterm>Zweigs</firstterm> oder <firstterm>Tags</firstterm> kennen, den Sie verwenden möchten.

source: Branches of a module are parallel versions of this module. A good real-life example of the use of this feature is the release of a software project. After a major release, there are bugs in the code that should be fixed, but people want to add new features to the application too. It is very hard to do both at the same time because new features usually introduce new bugs, making it hard to track down the old ones. To solve this dilemma, &CVS; lets you create a parallel version, that we will call the &quot;stable release branch&quot;, where you can only add bugfixes, leaving the main branch (HEAD) open for adding new features.
de: Zweige eines Moduls sind Parallele Versionen des Moduls. Ein praxisnahes Beispiel für diese Eigenschaft ist die Freigabe einer Version eines Softwareprojekts. Nach der Freigabe einer Hauptversion gibt es Fehler in dem Programm, die beseitigt werden sollten. Gleichzeitig möchten die Entwickler dem Programm aber auch neue Features hinzufügen. Beides gleichzeitig zu tun ist sehr schwierig, da neue Features normalerweise neue Fehler mit sich bringen, was das Beseitigen der alten Fehler erschwert. Um diesen Konflikt zu löschen, kann in &CVS; eine parallele Version erstellt werden, die wir &quot;stabilen Freigabezweig&quot; nennen, in dem Sie ausschließlich Fehler korrigieren. Der Hauptzweig (HEAD) bleibt so offen für neue Features.

source: Tags are used to mark a version of a project. &CVS; stamps one version of each file with the tag, so when you checkout or update to a specific tag, you will get always the same file versions. Therefore, in opposition to branches, tags are not dynamic: you cannot develop a tag. Tags are useful to mark releases, big changes in the code, &etc; Using tags, you can easily return the project to a previous state, to reproduce and track bugs, generate the release code again, &etc;
de: Tags werden verwendet, um Versionen des Projekts zu markieren. &CVS; markiert eine Version jeder Datei mit dem Tag. Wenn Sie also ein bestimmtes Tag auslesen oder aktualisieren, bekommen Sie immer die gleiche Versionen der Dateien. Daher sind Tags im Gegensatz zu Zweigen nicht dynamisch: Sie können nicht in einem Tag entwickeln. Tags sind nützlich, um Versionen für die Freigabe, große Änderungen am Programm &etc; zu markieren. Mit Tags können Sie schnell zu einem früheren Stand zurückkehren, um Fehler zu reproduzieren oder zu suchen, den Quelltext der Freigabeversion neu zu generieren &etc;

source: <title>A screenshot of &cervisia;'s checkout dialog</title>
de: <title>Ein Bildschirmfoto des Dialogs <quote>Aus CVS auslesen</quote>.</title>

source: <phrase>A screenshot of &cervisia;'s checkout dialog</phrase>
de: <phrase>Ein Bildschirmfoto des Dialogs <quote>Aus CVS auslesen</quote>.</phrase>

source: The name of the &CVS; repository, also known as <filename><envar>$CVSROOT</envar></filename>. The drop down box shows a list of the repositories you previously entered using the <guilabel>Configure Access to Repositories</guilabel> dialog box. If the repository is remote, make sure that authentication works. See <xref linkend="accessing-repository"/> for more information.
de: Der Name des &CVS;-Archivs, auch als <filename><envar>$CVSROOT</envar></filename> bezeichnet. Das Auswahlfeld zeigt eine Liste der Archive, die sie zuvor über den Dialog <guilabel>Zugang zu den &CVS;-Archiven einrichten</guilabel> eingegeben haben. Handelt es sich um ein Archiv auf einem entfernten Rechner, müssen Sie zuvor sicherstellen, dass Sie sich erfolgreich anmelden können. Näheres hierzu finden Sie unter <xref linkend="accessing-repository"/>.

source: The name of the module to be checked out. If you are working with an existing repository, you can probably get this name from the system administrator; or, if it is an open-source repository, you can get the module names from the project web pages. If you want to create a new module from scratch using a local repository, just create a new folder in the local repository root folder. The name of the folder will be the same as the name of the empty module.
de: Der Name des Moduls, das Sie auslesen. Wenn Sie mit einem bestehenden &CVS;-Archiv arbeiten, erfahren Sie diesen Namen wahrscheinlich vom Systemadministrator oder von der Webseite des Projekts. Um ein neues Modul in einem lokalen &CVS;-Archiv anzulegen, erstellen Sie einen Ordner im Wurzelverzeichnis des &CVS;-Archivs. Der Name des Ordners ist gleichzeitig der Name des leeren Moduls.

source: Alternatively, if the repository has a <filename><envar>$CVSROOT</envar>/modules</filename> file, you can retrieve a list of available modules by pressing the <guibutton>Fetch List</guibutton> button.
de: Falls das &CVS;-Archiv die Datei <filename><envar>$CVSROOT</envar>/modules</filename> enthält, können Sie eine Liste der verfügbaren Module mit dem Knopf<guibutton>Liste abholen</guibutton> auslesen.

source: Note that it is possible to checkout any existing subfolder of the module, without retrieving the rest of the module. Just enter the path to the subfolder as well. For instance, if you want to get only the <filename class="directory">doc/cervisia</filename> subfolder of the kdesdk module, enter <filename class="directory">kdesdk/doc/cervisia</filename> in this field.
de: Beachten Sie, dass es möglich ist, jeden beliebigen Unterordner eines Moduls auszulesen, ohne das gesamte Module zu beziehen. Geben Sie dazu den Unterordner mit an. Möchten Sie, zum Beispiel, nur den Unterordner <filename class="directory">doc/cervisia</filename> des Moduls kdesdk herunterladen, schreiben Sie <filename class="directory">kdesdk/doc/cervisia</filename> in dieses Feld.

source: Branch tag:
de: Verzweigungs-Tag:

source: The name of the branch or tag you want to check out. If you leave this field empty, &cervisia; will retrieve the main (HEAD) branch.
de: Der Name des Zweiges oder Tags, den Sie auslesen möchten. Wenn Sie in dieses Feld nichts eingeben, bezieht &cervisia; den Hauptzweig (HEAD).

source: Working folder:
de: Arbeitsordner:

source: The folder under which the module should be checked out. Note that the working copy toplevel folder is named after the module you are retrieving, unless you give it an alternative name in the <guilabel>Check out as:</guilabel> field.
de: Der Ordner, aus dem das Modul ausgelesen werden soll. Beachten Sie, dass der Hauptordner der Arbeitskopie immer den Namen des Moduls erhält, sofern Sie ihm mit <guilabel>Auslesen als:</guilabel> keinen anderen Namen zuweisen.

source: Check out as:
de: Auslesen als:

source: This results in the working copy files being checked out to an alternative folder under the working folder rather than a folder named after the module.
de: Wenn der Name des Ordners nicht dem Namen des Moduls entsprechen soll, geben Sie hier den gewünschten Namen ein.

source: Export only
de: Nur exportieren

source: If you check this box, the files will be exported rather than checked out. Exporting obtains a copy of the source for the module without the &CVS; administrative folders. For example, export may be used to prepare the source code for a release.
de: Ist diese Einstellung markiert, werden die Dateien exportiert anstatt ausgelesen. Beim Exportieren wird eine Kopie des Moduls ohne die administrativen Ordner von &CVS; erstellt. Das ist zum Beispiel sinnvoll, wenn der Quelltext zur Veröffentlichung vorbereitet wird.

source: Recursive checkout
de: Rekursiv auslesen (checkout)

source: Checkout all files and folders recursively.
de: Liest alle Dateien und Ordner rekursiv aus.

source: The Main Screen, Viewing File Status and Updating
de: Der Hauptbildschirm, Dateistatus und Aktualisierung

source: When you start &cervisia;, and open a working copy by choosing <menuchoice> <guimenu>File</guimenu> <guimenuitem>Open Sandbox...</guimenuitem> </menuchoice>, you can see two main areas in &cervisia;'s main window: the top one is a hierarchical (tree) view of the current working copy; the bottom area is used to display the &CVS; commands &cervisia; issues to perform its tasks, as well as the output generated by these commands.
de: Wenn Sie nach dem Starten von &cervisia; mit <menuchoice><guimenu>Datei</guimenu><guimenuitem>&CVS;-Arbeitsordner öffnen ...</guimenuitem></menuchoice> eine Arbeitskopie öffnen, sehen Sie zwei Hauptbereiche im Hauptfenster von &cervisia;: im oberen befindet sich eine Baumansicht der Arbeitskopie; der untere zeigt die &CVS;-Befehle und deren Ausgaben an, die &cervisia; ausführt um bestimmte Aufgaben zu erledigen.

source: By default, &cervisia; does not display the files contained by the sub-folders, so you will have to click the folders you want to see. To display all files of the working copy, select <menuchoice> <guimenu>View</guimenu> <guimenuitem>Unfold File Tree</guimenuitem> </menuchoice>. To close back all folders from the working copy, choose <menuchoice> <guimenu>View</guimenu> <guimenuitem>Fold File Tree</guimenuitem> </menuchoice>.
de: Voreingestellt zeigt &cervisia; Dateien in Unterordnern nicht an, sie müssen die Unterordner also anklicken, um die enthaltenen Dateien zu sehen. Um alle Dateien Ihrer Arbeitskopie anzuzeigen, wählen Sie <menuchoice><guimenu>Ansicht</guimenu><guimenuitem>Dateibaum ausklappen</guimenuitem></menuchoice>. Um alle Ordner wieder zu schließen, wählen Sie <menuchoice><guimenu>Ansicht</guimenu><guimenuitem>Dateibaum einklappen</guimenuitem></menuchoice>.

source: According to the settings in your <filename>.cvsignore</filename> files, the files you usually do not want to include into the repository - such as object files - are not shown in the tree view. For each file, you see its corresponding status. In the default setting, after opening the sandbox, this is "Unknown" because &cervisia; delays the fetching of information until you select the files and folders whose status you want to update or view and choose <menuchoice> <guimenu>File</guimenu> <guimenuitem>Update</guimenuitem> </menuchoice> or <menuchoice> <guimenu>File</guimenu> <guimenuitem>Status</guimenuitem> </menuchoice>. With this approach, you have a minimal amount of functionality available even if you do not have a permanent connection to the &CVS; server.
de: Abhängig von den Einstellungen in der Datei <filename>.cvsignore</filename> werden die Dateien, die sie normalerweise nicht in das &CVS;-Archiv einspielen wollen, nicht angezeigt. Das betrifft beispielsweise Objekt-Dateien, die beim Übersetzen stets neu angelegt werden. Für jede Datei wird der Status angezeigt. Zunächst steht hier <quote>Unbekannt</quote>, da &cervisia; die Informationen erst aus dem &CVS;-Archiv lädt, wenn Sie <menuchoice><guimenu>Datei</guimenu><guimenuitem>Aktualisieren</guimenuitem></menuchoice> oder <menuchoice><guimenu>Datei</guimenu><guimenuitem>Status</guimenuitem></menuchoice> wählen. Auf diese Weise können Sie über eine minimale Funktionalität verfügen, selbst wenn Sie keine permanente Verbindung zum &CVS;-Server haben.

source: <title>A screenshot of &cervisia;'s main view</title>
de: <title>Ein Bildschirmfoto von &cervisia;s Hauptansicht</title>
