Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdesdk/cervisia.po
Languages: de

source: Sometimes you want to offer your modifications for review, before committing them, or you do not have write access to the repository (therefore you cannot commit). &CVS; offers standard formats to share the modifications in your working copy, so other people can review your changes, test them in their working copy and apply them to the &CVS; repository. A file containing these differences is called a <firstterm>patch</firstterm>, and is generated by the <command>cvs diff</command> command, in the same way as the differences in <xref linkend="diff"/>. Sharing patches instead of sets of files requires less bandwidth, and patches are easier to handle, as you can send only one patch file containing all the differences from many source files.
de: Es kommt vor, dass Sie Ihre Änderungen jemandem zur Durchsicht zeigen möchten, bevor Sie sie einspielen. Oder Sie haben keine Schreibrechte für das &CVS;-Archiv, können also nicht Einspielen. &CVS; bietet Standardformate zum Austausch von Änderungen aus dem Arbeitsordner, sodass andere Entwickler Ihre Patches durchsehen, testen und in das &CVS;-Archiv einspielen können. Die Datei, die diese Unterschiede enthält, heißt <firstterm>Patch</firstterm> und wird mit dem Befehl <command>cvs diff</command> erstellt, wie unter <xref linkend="diff"/> beschrieben. Patches anstatt ganzer Dateien auszutauschen benötigt weniger Bandbreite, und Patches sind einfacher zu verwalten, da man Änderungen in vielen Dateien in einer Patchdatei speichern kann.

source: &cervisia; gives you access to this feature by choosing <menuchoice><guimenu>Advanced</guimenu> <guimenuitem>Create Patch Against Repository...</guimenuitem></menuchoice>.
de: In &cervisia; erreichen Sie diese Eigenschaft über <menuchoice><guimenu>Erweitert</guimenu><guimenuitem>Patch gegen das Archiv erstellen ...</guimenuitem></menuchoice>.

source: The <guimenuitem>Create Patch Against Repository...</guimenuitem> action creates a patch with all modifications in all files in your working copy (sandbox) against the <literal>BASE</literal> repository. Therefore, the selection of files in the main view does not affect the patch that will be generated.
de: Die Aktion <guimenuitem>Patch gegen das Archiv erstellen ...</guimenuitem> erstellt einen Patch mit allen Änderungen in allen Dateien in Ihrem Arbeitsordner gegen das <literal>BASE</literal>-Archiv. Daher beeinflussen Markierungen in der Hauptansicht nicht die Erstellung des Patches.

source: Another possibility is to select one file in the main view and choose <guimenuitem>Browse Log...</guimenuitem> from the <guimenu>View</guimenu> menu or right click the marked file and choose <guimenuitem>Browse Log...</guimenuitem> from the context menu, in order to open the <link linkend="browsinglogs">Browse log dialog</link>. Now, select the version you want to create a patch against, as revision &quot;A&quot; and press the button <guilabel>Create Patch...</guilabel>. This will generate a patch with the differences between the <emphasis>marked file</emphasis> in your working copy and the version selected as revision &quot;A&quot;.
de: Sie können auch in der Hauptansicht eine Datei markieren und <guimenuitem>Protokoll durchsuchen ...</guimenuitem> aus dem Menü <guimenu>Ansicht</guimenu> wählen oder mit der rechten Maustaste auf die markierte Datei klicken und <guimenuitem>Protokoll durchsuchen ...</guimenuitem> aus dem Kontextmenü wählen, um den Dialog <link linkend="browsinglogs">CVS-Protokoll</link> zu öffnen. Wählen Sie nun die Version gegen die Sie den Patch erstellen möchten als Revision &quot;A&quot;, und drücken Sie den Knopf <guilabel>Patch erstellen ...</guilabel>. Das erstellt einen Patch mit den Unterschieden zwischen der <emphasis>markierten Datei</emphasis> in Ihrem Arbeitsordner und der Version, die als Revision &quot;A&quot; gewählt wurde.

source: Before generating the patch, &cervisia; displays a dialog allowing you to configure the output format.
de: Bevor der Patch erstellt wird, zeigt &cervisia; einen Dialog an, der es Ihnen ermöglicht, das Ausgabeformat einzustellen.

source: <title>A screenshot of &cervisia;'s patch dialog</title>
de: <title>Ein Bildschirmfoto des Patch-Dialogs</title>

source: <phrase>A screenshot of &cervisia;'s patch dialog</phrase>
de: <phrase>Ein Bildschirmfoto des Patch-Dialogs</phrase>

source: Output Format
de: Ausgabeformat

source: There are three output formats available:
de: Es gibt drei Ausgabeformate:

source: <guilabel>Normal</guilabel>: a format that can be used to cause the ed editor to automatically make another copy of the old file match the new file. In the normal output format, the characters &lt; and &gt; mark the changes, and there is no context information.
de: <guilabel>Normal</guilabel>: In dieses Format erstellt der Editor Ed automatisch eine Kopie der alten Datei, die zur neuen Datei passt. Im normalen Ausgabeformat markieren die Zeichen <quote>&lt;</quote> und <quote>&gt;</quote> die Änderungen, und es gibt keine Kontextinformationen.

source: <guilabel>Unified</guilabel>: the most used format for exchanging patches. The unified format uses context lines in addition to line numbers to record the differences. This makes the process of applying patches more robust. This format displays the differences in a compact and readable form, with a header for each file involved, and separate sections (chunks) for each difference. The context lines available for each difference make reading the modifications easier. In the unified output format, the characters + and - mark the changes.
de: <guilabel>Vereinheitlicht (unified)</guilabel>: Das am meisten verwendete Format zum Austausch von Patches. Zusätzlich zu den Zeilennummern verwendet es Kontextzeilen zum Anzeigen der Unterschiede. Dadurch wird das Anwenden von Patches robuster. Das Format ist kompakt und lesbar mit einem Header für jede geändert Datei und getrennte Abschnitte (chunks) für jede Änderung. Durch die Kontextzeilen für jeden Unterschied ist das Lesen der Änderungen einfacher. Im vereinheitlichten Format markieren die Zeichen <quote>+</quote> und <quote>-</quote> die Änderungen.

source: <guilabel>Context</guilabel>, which presents the same information as the unified format, but in a less compact way. In the context output format, the character ! marks the changes.
de: <guilabel>Kontext</guilabel>: liefert die gleichen Informationen wie das vereinheitlichte Format, aber weniger Kompakt. Im Kontext-Format markiert das Zeichen <quote>!</quote> die Änderungen.

source: Number of context lines:
de: Anzahl Kontextzeilen im Diff-Dialog:

source: Set here the number of context lines for the unified or context output formats. This option is not available for the normal output format, as in this format no context information is recorded. More context information makes reading the raw output easier, and applying the patch more precise, but increases the patch size. It is recommended to use at least two context lines for proper patch operation.
de: Geben Sie hier die gewünschte Anzahl der Kontextzeilen im vereinheitlichten und Kontext-Format an. Diese Einstellung gilt nicht für das normale Ausgabeformat, da es keine Kontextinformationen besitzt. Eine höhere Zahl Kontextzeilen macht es einfacher, die Rohdaten des Patches zu lesen und das Anbringen des Patches wird präziser. Durch mehr Zeilen wird der Patch aber auch größer. Es wird empfohlen, wenigstens zwei Zeilen zu verwenden, damit der Patch ordentlich verarbeitet werden kann.

source: Ignore Options
de: Einstellungen ignorieren

source: Check here the changes that should not be considered as differences when generating the patch.
de: Markieren Sie hier die Änderungen, die bei der Erstellung eines Patches nicht als Unterschiede betrachtet werden sollen.

source: After setting the output format, &cervisia; generates the patch and displays the <guilabel>Save As</guilabel> dialog. Enter in this dialog the file name and location of the patch file.
de: Nachdem Sie das Ausgabeformat eingestellt haben, erstellt &cervisia; den Patch und öffnet den Dialog <guilabel>Speichern unter</guilabel>. Geben Sie hier den gewünschten Namen und den Ort für den Patch an.

source: Watching an Annotated View of a File
de: Die Anmerkungsansicht einer Datei betrachten

source: With the command <command>cvs annotate</command>, &CVS; offers the possibility to see - for each line in a file - who has modified a line the most recently. This view may be helpful in order to find out who has introduced a change in the behavior of a program or who should be asked about some change or bug in the code.
de: Der &CVS;-Befehl <command>cvs annotate</command> bietet die Möglichkeit, für jede Zeile einer Datei den letzten Bearbeiter anzuzeigen. Diese Ansicht kann sich als hilfreich erweisen, wenn man herausfinden möchte, wer eine bestimmte Änderung eingebaut hat.

source: &cervisia; gives you access to this feature, but it further enriches the information in an interactive way. You obtain an annotate view by choosing <menuchoice><guimenu>View</guimenu><guimenuitem>Annotate...</guimenuitem></menuchoice>. Another possibility is to press the button <guilabel>Annotate</guilabel> in the <link linkend="browsinglogs">Browse log dialog</link>, in which you can select which version of the file you want to display. In <xref linkend="screenshot-annotate"/> you can see a screenshot of the dialog.
de: &cervisia; ermöglicht auch dies, bereichert die hier dargestellten Informationen aber darüberhinaus auf interaktive Weise. Sie erhalten eine Anmerkungsansicht über <menuchoice><guimenu>Ansicht</guimenu> <guimenuitem>Anmerkung ...</guimenuitem></menuchoice>. Eine weitere Möglichkeit besteht darin, den Knopf <guilabel>Anmerkung</guilabel> im Dialog <link linkend="browsinglogs">Durchsuchen der Log-Einträge</link> zu benutzen, in dem Sie wählen können, welche Version der Datei Sie anzeigen möchten. Unter <xref linkend="screenshot-annotate"/> finden Sie ein Bildschirmfoto des Dialogs.

source: <title>A screenshot of &cervisia;'s annotate dialog</title>
de: <title>Ein Bildschirmfoto des Dialogs <quote>CVS-Anmerkung</quote></title>

source: <phrase>A screenshot of &cervisia;'s annotate dialog</phrase>
de: <phrase>Ein Bildschirmfoto des Dialogs <quote>CVS-Anmerkung</quote></phrase>

source: In the annotate dialog, you see in a window the latest version of the selected file (or the revision &quot;A&quot; version, in case you launched the annotate dialog from the <link linkend="browsinglogs">Browse log dialog</link>). In the columns before the text, you get some information related to the latest change in each line. In the first column the line number is displayed. In the second column you see the name of the author and revision number. Finally, in the third column you see the actual content of that line.
de: Im Anmerkungs-Dialog wird in Ihnen die letzte Version der ausgewählten Datei angezeigt (oder die Revision &quot;A&quot;, wenn Sie die Anmerkungsansicht aus dem Dialog <link linkend="browsinglogs">Protokoll durchsuchen</link> aufgerufen haben). In den Spalten vor dem Text erhalten Sie für jede Zeile Informationen über die letzte Änderung. In der ersten Spalte wird die Versionsnummer angezeigt, in der zweiten der Name des Autors, der die letzte Änderung durchgeführt hat. In der dritten Spalte wird das Datum dieser letzten Änderung angezeigt.

source: Consequently, when a certain line appears strange to you or you assume a bug there, you can immediately see who is responsible for that line. But not only that, you can also find out <emphasis>why</emphasis> that line was changed. To this end, move the mouse cursor over the respective revision number. Then a tooltip appears that shows the log message and the date of the change.
de: Wenn Sie auf eine seltsame Stelle im Quellcode stoßen oder einen Fehler vermuten, können Sie so direkt sehen, wer für diese Zeile verantwortlich ist. Aber das ist nicht alles. Sie können sogar herausfinden, <emphasis>warum</emphasis> diese Zeile geändert wurde. Hierzu bewegen Sie den Mauszeiger über die betreffende Versionnummer. Daraufhin erscheint ein Tooltip, das den zugehörigen Log-Eintrag und das Datum der Änderung anzeigt.

source: Browsing &CVS; Logs
de: &CVS;-Protokolle durchsuchen

source: When you mark one file in the main view and choose <guimenuitem>Browse Log...</guimenuitem> from the <guimenu>View</guimenu> menu or right click the marked file and choose <guimenuitem>Browse Log...</guimenuitem> from the context menu, the <guilabel>CVS Log</guilabel> dialog is shown (if you mark more than one, nothing happens, as &cervisia; can only generate and parse the log for one file at a time). This dialog offers functionality that is beyond viewing the file's history. Using it as a version browser you can:
de: Wenn Sie in der Hauptansicht eine Datei markieren und <guimenuitem>Protokoll durchsuchen ...</guimenuitem> aus dem Menü <guimenu>Ansicht</guimenu> wählen, oder mit der rechten Maustaste auf die Datei klicken und aus dem Kontextmenü <guimenuitem>Protokoll durchsuchen ...</guimenuitem> wählen, wird der Dialog <guilabel>CVS-Protokoll</guilabel> angezeigt. (Bei mehr als einer Datei passiert nichts, da &cervisia; nur das Protokoll einer Datei zur gleichen Zeit bearbeiten kann.) Der Dialog bietet mehr als nur das Betrachten der Versionsgeschichte einer Datei. Sie können mit ihm:

source: View the revision, author, date, branch, commit message, and tags for each version of the marked file.
de: Die Informationen über Revision, Autor, Datum, Zweig, Commitnachricht und Tags für jede Version der markierten Datei betrachten.

source: View a graphical tree representation showing the branching and tagging of the marked file.
de: Eine grafische Baumansicht der Zweige und Tags der markierten Datei betrachten.

source: View any version of the marked file (with the default application).
de: Beliebige Version der markierten Datei (mit der Standardanwendung) betrachten.

source: Watch an annotated view of any version of the marked file
de: Die Anmerkungsansicht einer beliebigen Version der markierten Datei betrachten.

source: View the differences between any pair of versions of the marked file, including pairs with the current working copy version of the marked file.
de: Unterschiede zwischen beliebigen Versionen der markierten Datei betrachten.

source: Create patches containing the differences between any pair of versions of the marked file, including pairs with the current working copy version of the marked file.
de: Patches mit den Unterschieden zwischen beliebigen Versionen der markierten Datei erstellen.

source: <title>A screenshot of &cervisia;'s browse logs dialog</title>
de: <title>Ein Bildschirmfoto des Dialogs <quote>Protokoll durchsuchen</quote></title>

source: <phrase>A screenshot of &cervisia;'s browse logs dialog</phrase>
de: <phrase>Ein Bildschirmfoto des Dialogs <quote>Protokoll durchsuchen</quote></phrase>

source: You can choose to see the history as provided by the <command>cvs log</command> command (<guilabel>CVS Output</guilabel>), as a <guilabel>Tree</guilabel>, or in <guilabel>List</guilabel> form. What you prefer is of course a matter of taste and it depends on what information you are interested in. The tree is an intuitive representation of what has been done on different branches by which authors. As tooltips, you can see the corresponding log messages. The list is by its nature linear and, therefore, does not give an immediate view of branches; on the other hand, it concentrates more otherwise relevant information on less screen estate, namely the time of each change of the file and the first part of the log message. The &CVS; output information is complete, but long, and difficult to read. To alleviate these problems, you have the ability to search the text of the &CVS; output, by pressing the <guibutton>Find...</guibutton> button.
de: Sie können wählen, ob die Versionsgeschichte wie vom Befehl <command>cvs log</command> (<guilabel>CVS-Ausgabe</guilabel>), als <guilabel>Baum</guilabel> oder als <guilabel>Liste</guilabel> dargestellt werden soll. Dies ist natürlich Geschmacksache und hängt davon ab, an welchen Informationen Sie interessiert sind. Die Baumdarstellung zeigt deutlich, welche Änderungen in den verschiedenen Zweigen von welchem Autor durchgeführt wurden. Die zugehörigen Protokolleinträge werden als Kurzinfo angezeigt. Die Listenansicht ist schon aufgrund der Darstellung weniger für eine Ansicht der Zweige geeignet, hat aber den Vorteil, dass Sie sich auf andere relevante Informationen konzentriert und dabei weniger Platz auf dem Bildschirm einnimmt. Hierunter fallen insbesondere der Zeitpunkt jeder Änderung und der Anfang der Protokolleinträge. Die &CVS;-Ausgabe ist vollständig, aber lang und schwer zu lesen. Um dies zu erleichtern, können Sie die &CVS;-Ausgabe durchsuchen, indem Sie auch den Knopf <guibutton>Suchen ...</guibutton> drücken.

source: To obtain more information about a certain revision, you can click on it either in the list or the tree view. The fields in the middle of the dialog are then filled with the complete information provided by <command>cvs log</command>. You can mark two revisions, called &quot;A&quot; and &quot;B&quot;, which are relevant if you make use of further features provided by the buttons. Revision &quot;A&quot; can be chosen with the left mouse button, revision &quot;B&quot; with the middle one. In the list view, you can also navigate with your cursor keys. In order to mark revisions &quot;A&quot; and &quot;B&quot;, use the shortcuts <keycombo action="simul">&Ctrl;<keycap>A</keycap></keycombo>, <keycombo action="simul">&Ctrl;<keycap>B</keycap></keycombo>, respectively. Using the <guilabel>CVS Output</guilabel> view, you can click on the <guilabel>Select for revision A</guilabel> and <guilabel>Select for revision B</guilabel> to mark the revisions.
de: Wollen Sie mehr Informationen über eine bestimmt Dateiversion, erhalten Sie diese sowohl in der Baum- als auch in der Listenansicht durch Anklicken des betreffenden Eintrags. In den Feldern in der Mitte des Dialogs werden dann sämtliche Informationen angezeigt, die der Befehl <command>cvs log</command> ergibt. Sie können auch zwei Versionen gleichzeitig markieren. Diese werden dann mit &quot;A&quot; und &quot;B&quot; bezeichnet. Version &quot;A&quot; können Sie durch Anklicken mit der linken Maustaste markieren, Version &quot;B&quot; markieren Sie durch Anklicken mit der mittleren Maustaste. In der Listenansicht können Sie sich auch mit Hilfe der Pfeiltasten bewegen. Um hier die Versionen &quot;A&quot; und &quot;B&quot; zu markieren, können Sie die Kurztasten <keycombo>&Ctrl;<keycap>A</keycap></keycombo> bzw. <keycombo>&Ctrl;<keycap>B</keycap></keycombo> verwenden. In der <guilabel>CVS-Ausgabe</guilabel>-Ansicht können Sie die Knöpfe <guilabel>Als Revision A auswählen</guilabel> und <guilabel>Als Revision B auswählen</guilabel> verwenden, um die Revisionen zu markieren.

source: If you press the <guibutton>Annotate</guibutton> button, you get a dialog showing the text of file belonging to the revision marked as &quot;A&quot;. Every line is prefixed with the information about who edited this last time, and at which revision this happened. You can get more information about viewing annotated versions in <xref linkend="annotate"/>.
de: Wenn Sie den Knopf <guibutton>Anmerkung</guibutton> drücken, wird ein Dialog angezeigt, der den Text der Datei in der Version &quot;A&quot; anzeigt. Vor jeder Zeile wird die Information ausgegeben, wer sie zuletzt bearbeitet hat und in welcher Version der Datei dies geschehen ist. Mehr Informationen über das Betrachten von Anmerkungen zu Versionen erhalten Sie unter <xref linkend="annotate"/>.

source: If you press the <guibutton>Diff</guibutton> button, a <command>cvs diff</command> call is issued and you get a dialog in which all the modifications between the two marked revisions are shown. If you mark revision &quot;A&quot;, but not revision &quot;B&quot;, &cervisia; will generate the modifications between the file version marked as revision &quot;A&quot; and the working copy version of the file. This allows you to view the differences between your version of the file and any version available in &CVS;. To make it easy to see the changes, different colors are used to mark lines which have been added, removed or simply changed. You can get more information about viewing differences in <xref linkend="diff"/>.
de: Drücken Sie den Knopf <guibutton>Diff</guibutton>, wird der Befehl <command>cvs diff</command> abgesetzt und ein Dialog erscheint, in dem die Unterschiede zwischen den beiden markierten Versionen angezeigt werden. Wenn Sie Revision &quot;A&quot; aber nicht Revision &quot;B&quot; markieren, wird &cervisia; die Unterschiede zwischen der als Revision &quot;A&quot; markierten Dateiversion und der Version in Ihrem Arbeitsordner anzeigen. Dies erlaubt Ihnen den Vergleich zwischen Ihrer Version einer Datei mit jeder Version, die im &CVS;-Archiv verfügbar ist. Um die Änderungen deutlicher hervorzuheben, sind die Zeilen, die hinzugefügt, entfernt oder geändert wurden, in unterschiedlichen Farben dargestellt. Mehr Informationen über das betrachten von Unterschieden erhalten Sie unter <xref linkend="diff"/>.

source: If you press the <guibutton>Create Patch...</guibutton> button, you get a dialog in which you can set the format options for generating a file containing all the modifications between the two marked revisions which are shown. If you mark revision &quot;A&quot;, but not revision &quot;B&quot;, &cervisia; will generate the modifications between the file version marked as revision &quot;A&quot; and the working copy version of the file. This allows you to generate a patch, or difference file, between your version of the file and any version available in &CVS;. After configuring the format of the patch in the dialog, and pressing <guibutton>OK</guibutton>, a <command>cvs diff</command> command is issued to generate the difference file. A <guilabel>Save As</guilabel> dialog will pop up. Enter the file name and location of the patch file &cervisia; generated, in order to save it. You can get more information about creating patches, and the patch format options in <xref linkend="creatingpatches"/>.
de: Wenn Sie den Knopf <guibutton>Patch erstellen ...</guibutton> drücken, erscheint ein Dialog zum Einstellen des Formats, in dem die Änderungen zwischen den beiden markierten Revisionen angezeigt werden. Wenn Sie eine Revision &quot;A&quot;, aber keine Revision &quot;B&quot; angeben, erstellt &cervisia; einen Patch zwischen der Dateiversion, die als Revision &quot;A&quot; markiert ist und der Dateiversion in Ihrem Arbeitsordner. Nachdem Sie das Format für den Patch eingestellt haben, drücken Sie auf <guibutton>OK</guibutton>. Der Befehl <command>cvs diff</command> wird abgesetzt um die Datei mit den Unterschieden zu erstellen. Es öffnet sich der Dialog <guilabel>Speichern unter</guilabel>, in dem Sie den Name und den Ort für die von &cervisia; erstellte Datei festlegen können um sie zu speichern. Mehr zum Thema Erstellen von Patches und den Format-Einstellungen finden Sie unter <xref linkend="creatingpatches"/>.

source: If you press the <guibutton>View</guibutton> button, &cervisia; will retrieve the revision marked as &quot;A&quot; and display it using the default application for its file type.
de: Wenn Sie auf den Knopf <guibutton>Anzeigen</guibutton> drücken, bezieht &cervisia; die als &quot;A&quot; markierte Revision und zeigt sie über die, diesem Dateityp zugeordnete Standardanwendung an.

source: Press the <guibutton>Close</guibutton> button to leave the dialog and return to the main view.
de: Drücken Sie den <guibutton>Schließen</guibutton>-Knopf um den Dialog zu verlassen und zur Hauptansicht zurück zu kehren.
