Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdesdk/cervisia.po
Languages: de

source: &cervisia;'s main support of watches are six menu items.
de: &cervisia;s Unterstützung für Überwachungen umfasst sechs Menüpunkte.

source: In order to add a watch to one or several files, use <menuchoice><guimenu>Advanced</guimenu><guimenuitem>Add Watch...</guimenuitem></menuchoice>. In the dialog you get, you can choose to get notified for any of the types of events that &CVS; supports. For example, if you only want to get notified when a file is committed, check the boxes <guibutton>Only</guibutton> and <guibutton>Commits</guibutton>. If you want to get notified about any event related to the marked files, check the box <guibutton>All</guibutton>. The command line used when you accept the dialog is
de: Möchten Sie für eine oder mehrere Dateien eine Überwachung setzen, verwenden Sie den Menüeintrag <menuchoice><guimenu>Erweitert</guimenu><guimenuitem>Status „Überwachen“ setzen ...</guimenuitem></menuchoice>. Der erscheinende Dialog bietet Ihnen die Möglichkeit über alle von &CVS; unterstützten Vorgänge benachrichtigt zu werden. Möchten Sie beispielsweise eine Benachrichtigung erhalten, wenn eine Datei eingespielt wird, markieren Sie die Ankreuzfelder <guibutton>Nur</guibutton> und <guibutton>Einspielungen</guibutton>. Möchten Sie über alle Vorgänge benachrichtigt werden, markieren Sie das Ankreuzfeld <guibutton>Alle</guibutton>. Bei Abschließen des Dialogs wird folgende Befehlszeile ausgeführt:

source: <command>cvs watch add -a commit <replaceable>file names</replaceable></command>
de: <command>cvs watch add -a commit <replaceable>Dateinamen</replaceable></command>

source: or with a similar option, depending on the events you chose to watch.
de: oder eine ähnlichen Befehlszeile, abhängig von den im Dialog ausgewählten Ereignissen.

source: If you are not interested in some files anymore, you can remove your watches on them. To this end, use <menuchoice><guimenu>Advanced</guimenu><guimenuitem>Remove Watch...</guimenuitem></menuchoice>. In the dialog you get here, the same options are offered as in the form you filled out when adding the watch. When you confirm this dialog, &cervisia; issues the command
de: Wenn Sie an einigen Dateien nicht mehr interessiert sind, können Sie die Überwachung aufheben. Hierzu wählen Sie im Menü <menuchoice><guimenu>Erweitert</guimenu><guimenuitem>Status „Überwachen“ entfernen ...</guimenuitem></menuchoice>. In diesem Dialog werden dieselben Optionen angeboten wie beim Setzen der Überwachung. Schließen Sie diesen Dialog ab, setzt &cervisia; folgenden Befehl ab:

source: <command>cvs watch remove <replaceable>file names</replaceable></command>
de: <command>cvs watch remove <replaceable>Dateinamen</replaceable></command>

source: possibly with an option <option>-a</option> for the chosen events.
de: gegebenenfalls mit der Option <option>-a</option> für das ausgewählte Ereignis.

source: Finally, you can get a list of the people who are watching a couple of files. Choose <menuchoice><guimenu>Advanced</guimenu><guimenuitem>Show Watchers</guimenuitem></menuchoice>. Using this menu item will result in a command
de: Darüberhinaus können Sie eine Liste von Benutzern anfordern, die bestimmte Dateien überwachen. Wählen Sie im Menü <menuchoice> <guimenu>Erweitert</guimenu> <guimenuitem>Überwacher anzeigen</guimenuitem></menuchoice>. Hierdurch wird folgender Befehl ausgeführt:

source: <command>cvs watchers <replaceable>file names</replaceable></command>
de: <command>cvs watchers <replaceable>Dateinamen</replaceable></command>

source: In the normal usage scenario of &CVS;, each developer works separately in his checked out sandbox. When he wants to modify some file, he can just open it in his editor and start working on it. Nobody else will know about this work until the file gets committed.
de: Gewöhnlich wird &CVS; dergestalt eingesetzt, dass jeder Entwickler in seinem lokalen Arbeitsordner arbeitet. Möchte er eine Datei ändern, öffnet er sie in seinem Editor und bearbeitet sie. Erst das Einspielen der geänderten Datei bewirkt, dass andere Entwickler bemerken, dass er an dieser Datei arbeitet.

source: For some developer groups, this is not the preferred model of cooperation. They want to get notified about someone working on a file <emphasis>as soon as</emphasis> he starts with it. This can be achieved by some further &CVS; commands. Before you start editing a file, select it in &cervisia;'s main window and choose <menuchoice><guimenu>Advanced</guimenu><guimenuitem>Edit Files</guimenuitem></menuchoice>. This will execute the command
de: Manche Entwicklergruppen bevorzugen eine andere Vorgehensweise. Sie möchten informiert werden, wenn jemand eine Datei bearbeitet, und zwar <emphasis>sobald</emphasis> er damit beginnt. Dies erreicht man durch die Anwendung weiterer &CVS;-Befehle. Möchte Sie eine Datei bearbeiten, wählen Sie sie in &cervisia; aus und rufen Sie den Menüpunkt <menuchoice><guimenu>Erweitert</guimenu> <guimenuitem>Datei bearbeiten</guimenuitem></menuchoice> auf. Hierdurch wird der folgende Befehl ausgeführt:

source: <command>cvs edit <replaceable>file names</replaceable></command>
de: <command>cvs edit <replaceable>Dateinamen</replaceable></command>

source: This will send out a notification to everyone who has set an <literal>edit</literal> watch on this file. It will also register you as an <emphasis>editor</emphasis> of the file. You can obtain a list of all editors of a certain file by using <menuchoice><guimenu>Advanced</guimenu><guimenuitem>Show Editors</guimenuitem></menuchoice>. This is equivalent to typing on the command line
de: Hierdurch erhalten alle Benutzer eine Mitteilung, die für diese Datei die Überwachung des Ereignisses <literal>Bearbeiten</literal> gesetzt haben. Gleichzeitig werden Sie als <emphasis>Bearbeiter</emphasis> der Datei registriert. Eine Liste aller Bearbeiter einer Datei erhalten Sie über <menuchoice><guimenu>Erweitert</guimenu><guimenuitem>Bearbeiter anzeigen</guimenuitem></menuchoice>. Dies entspricht dem Befehl:

source: <command>cvs editors <replaceable>file names</replaceable></command>
de: <command>cvs editors <replaceable>Dateinamen</replaceable></command>

source: An editing session is automatically ended when you commit the affected file. At that moment, an <literal>unedit</literal> notification gets sent out to all people who have registered a respective watch on the file. Of course, sometimes you may not want to commit the file, but abort the editing session and revert to the previous version of the file. This is done by using <menuchoice><guimenu>Advanced</guimenu><guimenuitem>Unedit Files</guimenuitem></menuchoice>. Note that &cervisia; will not ask you for confirmation; that means if you use this menu item, all your work done since you used <menuchoice><guimenu>Advanced</guimenu><guimenuitem>Edit Files</guimenuitem></menuchoice> will be lost. Precisely, &cervisia; uses the command line
de: Eine Bearbeitungs-Sitzung wird automatisch beim Einspielen der betreffenden Datei beendet. Zu diesem Zeitpunkt wird an alle, die eine entsprechende Überwachung für diese Datei gesetzt haben, eine <literal>unedit</literal>-Benachrichtigung verschickt. Natürlich kann es auch vorkommen, dass Sie eine Datei nicht einspielen möchten und die Bearbeitungs-Sitzung abbrechen, um auf die zuletzt eingespielte Version der Datei zurückzugehen. Hierzu wählen Sie im Menü <menuchoice><guimenu>Erweitert</guimenu><guimenuitem>Status „in Bearbeitung“ zurücknehmen</guimenuitem></menuchoice>. Beachten Sie hierbei, dass &cervisia; diesen Befehl ohne Rückfrage ausführt. Das bedeutet im Klartext, dass sämtliche Änderungen, die Sie seit dem letzten Aufruf von <menuchoice><guimenu>Erweitert</guimenu><guimenuitem>Datei bearbeiten</guimenuitem></menuchoice> durchgeführt haben, verloren gehen. Genau gesagt führt &cervisia; folgenden Befehl aus:

source: <command>echo y | cvs unedit <replaceable>file names</replaceable></command>
de: <command>echo y | cvs unedit <replaceable>Dateinamen</replaceable></command>

source: So far, we have only discussed the case where edits and unedits are used voluntarily be the developers. In addition &CVS; supports a model which <emphasis>enforces</emphasis> the usage of these commands. The responsible command to switch to this model is <command>cvs watch on</command> which we will not explain further because it is mostly used by the administrator of the repository. However, the important point from the developer's point of view is that when the project enforces edits, working copies are checked out <emphasis>readonly</emphasis>. That means you cannot edit a file by default (unless you use tricks like <command>chmod</command>). Only when you use <menuchoice><guimenu>Advanced</guimenu><guimenuitem>Edit Files</guimenuitem></menuchoice>, the file becomes writable. It is made read-only again when you commit the file or use <menuchoice><guimenu>Advanced</guimenu><guimenuitem>Unedit Files</guimenuitem></menuchoice>.
de: Bislang haben wir nur den Fall besprochen, bei dem die Entwickler die Bearbeitungs-Befehle freiwillig benutzen. Darüber hinaus unterstützt &CVS; ein Entwicklungsmodell, bei dem der Einsatz dieser Befehle <emphasis>erzwungen</emphasis> wird. Der hierfür verantwortliche Befehl lautet <command>cvs watch on</command>. Er soll hier nicht weiter erläutert werden, da er normalerweise vom Administrator des &CVS;-Archivs verwendet wird. Für den Entwickler ist hierbei nur wichtig, dass bei diesem erzwungenen Bearbeitungs-Modus, die Arbeitskopien der Dateien beim Auslesen aus dem &CVS;-Archiv den Status <emphasis><quote>nur lesen</quote></emphasis> erhalten. Das bedeutet, dass Sie eine Datei normalerweise nicht ändern können (es sei denn, Sie verwenden Tricks wie den Befehl <command>chmod</command>). Erst wenn Sie <menuchoice><guimenu>Erweitert</guimenu><guimenuitem>Dateien bearbeiten</guimenuitem></menuchoice> auswählen, wird die Datei beschreibbar. Sobald Sie die Datei einspielen oder im Menü <menuchoice><guimenu>Erweitert</guimenu><guimenuitem>Status „in Bearbeitung“ zurücknehmen</guimenuitem></menuchoice> auswählen, wird die Datei erneut <quote>nur lesbar</quote>.

source: &cervisia;'s editor interface helps you with projects that enforce watches also in a different way. If you just started an editor with a readonly file by double-clicking on it or by using <menuchoice><guimenu>File</guimenu><guimenuitem>Edit</guimenuitem></menuchoice>, you would not be able to save your modifications later. This has of course a reason: Whenever you want to change a file, you should run <command>cvs edit</command> before, so that all people watching the file get a notification that you are working on it.
de: &cervisia;s Editor-Schnittstelle unterstützt Sie bei Projekten, die Überwachungen erzwingen, auch auf andere Weise. Wenn Sie einen Editor durch Doppelklick auf eine Datei mit dem Status <quote>nur lesen</quote> oder durch Auswahl von <menuchoice> <guimenu>Datei</guimenu> <guimenuitem>Bearbeiten</guimenuitem> </menuchoice> öffnen, wären Sie später nicht in der Lage, Ihre Änderungen abzuspeichern. Das hat natürlich seine Gründe. Immer dann, wenn Sie eine Datei ändern wollen, sollten Sie zuvor den Befehl <command>cvs edit</command> ausführen, sodass alle Anwender, die diese Datei überwachen, darüber benachrichtigt werden, dass Sie diese Datei bearbeiten.

source: In such a case, it is advisable to check the option <menuchoice><guimenu>Settings</guimenu><guimenuitem>Do cvs edit Automatically When Necessary</guimenuitem></menuchoice>. Now, whenever you edit a file by double-clicking it, &cervisia; will run <command>cvs edit</command> before the editor is actually executed. Then you can edit your file as usual. When you have finished your work, commit your files, and the committed files are read-only again.
de: In einem solchen Fall ist es ratsam, die Option <menuchoice><guimenu>Einstellungen</guimenu><guimenuitem>Bei Bedarf automatisch Status „in Bearbeitung“ setzen</guimenuitem></menuchoice> zu markieren. Jetzt führt &cervisia;, sobald Sie eine Datei mit einem Doppelklick öffnen, erst den Befehl <command>cvs edit</command> aus, bevor der Editor mit der Datei aufgerufen wird. Sie können diese Datei dann wie sonst auch bearbeiten. Wenn Sie die Änderungen durchgeführt haben, spielen Sie die Datei ein, und die eingespielte Datei erhält wieder den Status <quote>nur lesen</quote>.

source: Locking
de: Sperren

source: The development model usually followed when &CVS; is used is called <emphasis>unreserved checkouts</emphasis>. Each developer has his own sandbox where he can edit files as he likes. If when the watch features - like <command>cvs edit</command> - are used, multiple developers can work on files synchronously. Changes done by a different developer are merged into the local sandbox when an update is performed.
de: Das Entwicklungsmodell, das bei der Verwendung von &CVS; benutzt wird nennt sich <emphasis>unreserved checkouts</emphasis> (was soviel bedeutet wie <quote>uneingeschränktes Auslesen</quote>). Jeder Entwickler hat seinen eigenen Arbeitsordner, in dem er die Dateien nach Belieben bearbeiten kann. Verschiedene Entwickler können synchron auf den Dateien arbeiten, sofern die Überwachungsfunktionen wie <command>cvs edit</command> verwendet werden. Änderungen, die von einem anderen Entwickler durchgeführt wurden, werden beim nächsten Aktualisieren des Arbeitsordners mit den lokalen Änderungen zusammengeführt.

source: Other revision control systems - like <acronym>RCS</acronym> and <application>SourceSafe</application> use a different model. When a developer wants to a edit a file, he has to <emphasis>lock</emphasis> it. Only one developer at a time can a lock a file. When he has finished editing, the lock is released. On the one hand, with this model, conflicts can never happen. On the other hand, two developers cannot work on the same file at the same time, even when their changes do not affect each other. This can be a bottleneck. We are not going to discuss the organizational benefits of both approaches. Nevertheless we mention that although &CVS; has some support for locking, it is not the preferred way of working with &CVS;. You should not use these features unless you are sure that your project manager allows them.
de: Andere Versionskontrollsysteme wie <acronym>RCS</acronym> und <application>SourceSafe</application> verwenden ein hiervon abweichendes Modell. Möchte ein Entwickler eine Datei bearbeiten, muss er diese <emphasis>sperren</emphasis>. Eine Datei kann zur selben Zeit nur von einem Entwickler gesperrt sein. Ist die Änderung der Datei abgeschlossen, wird die Sperrung aufgehoben. Bei diesem Modell können niemals Konflikte auftreten. Andererseits können auch nie zwei Entwickler gleichzeitig an derselben Datei arbeiten, selbst dann nicht, wenn Ihre Änderungen sich nicht beeinflussen. Das kann sich bei der Entwicklung als Flaschenhals erweisen. Wir wollen hier nicht die organisatorischen Vorteile beider Modelle besprechen. Nichtsdestotrotz soll aber erwähnt werden, dass, auch wenn das Sperren von Dateien in gewisser Weise unterstützt wird, diese Vorgehensweise nicht den bevorzugten Weg beim Einsatz von &CVS; darstellt. Sie sollten diese Funktionalität nur einsetzen, wenn Sie sich sicher sind, dass der Projektleiter dies erlaubt.

source: With &cervisia;, you lock files as follows. Select the desired files in the main view. Then choose <menuchoice><guimenu>Advanced</guimenu><guimenuitem>Lock Files</guimenuitem></menuchoice>. This runs the command
de: Mit &cervisia; können Sie Dateien wie folgt sperren. Wählen Sie die gewünschte Datei aus. Der Menüpunkt <menuchoice><guimenu>Erweitert</guimenu> <guimenuitem>Datei sperren</guimenuitem></menuchoice> führt den folgenden Befehl aus:

source: <command>cvs admin -l <replaceable>file names</replaceable></command>
de: <command>cvs admin -l <replaceable>Dateinamen</replaceable></command>

source: The reverse effect is achieved by using <menuchoice><guimenu>Advanced</guimenu><guimenuitem>Unlock Files</guimenuitem></menuchoice>. This runs the command
de: Den umgekehrten Effekt erreicht man über <menuchoice><guimenu>Erweitert</guimenu> <guimenuitem>Dateien freigeben</guimenuitem></menuchoice>. Hierbei wird folgender Befehl ausgeführt:

source: <command>cvs admin -u <replaceable>file names</replaceable></command>
de: <command>cvs admin -u <replaceable>Dateinamen</replaceable></command>

source: Customizing &cervisia;
de: Einrichten von &cervisia;

source: &cervisia; can be customized in various ways to your needs and preferences. Some options which you may want to change regularly are directly available in the <guimenu>Settings</guimenu> menu.
de: Sie können &cervisia; für Ihre persönlichen Bedürfnisse einrichten. Einige der Einstellungen, die Sie möglicherweise häufiger ändern möchten, sind direkt über das Menü <guimenu>Einrichtung</guimenu> erreichbar.

source: General
de: Allgemein

source: User name for the change log editor:
de: Benutzername für den Changelog-Editor:

source: Whenever you use the menu item <menuchoice><guimenu>File</guimenu><guimenuitem>Insert ChangeLog Entry...</guimenuitem></menuchoice>, a new ChangeLog entry is generated with the current date and your username. Normally, it is considered good style to insert your full name and your email address into each of your ChangeLog entries. &cervisia; automatically adds the full name and email address entered here.
de: Immer dann, wenn Sie den Menüpunkt <menuchoice><guimenu>Datei</guimenu> <guimenuitem>Changelog-Eintrag hinzufügen ...</guimenuitem></menuchoice> verwenden, wird ein neuer Changelog-Eintrag mit dem aktuellen Datum und Ihrem Benutzernamen angelegt. Es wird allgemein als guter Stil angesehen, wenn Sie in jedem Changelog-Eintrag Ihren vollen Namen und Ihre E-Mail-Adresse hinterlassen. &cervisia; fügt automatisch die hier eingegebenen Informationen ein.

source: Path to CVS executable, or 'cvs':
de: Pfad zur CVS-Programmdatei oder 'cvs':

source: Here you can set the name (or path) to the <command>cvs</command> command line client. By default, the &CVS; executable found in your <envar>$PATH</envar> is used by &cervisia;.
de: Hier können Sie den Namen (oder den Pfad) zum Befehlszeilenprogramm <command>cvs</command> eintragen. Als Voreinstellung wird von &cervisia; die ausführbare Datei aufgerufen, die in Ihrem <envar>$PATH</envar> gefunden wird.

source: Diff Viewer
de: Diff-Betrachter

source: Number of context lines in the diff dialog:
de: Anzahl Kontextzeilen im Diff-Dialog:

source: For the diff dialog, &cervisia; uses the option <option>-U</option> to <command>diff</command>. This lets <command>diff</command> show only a limited number of lines around each difference region (context lines). Here you can set the argument to <option>-U</option>.
de: Für den Diff-Dialog verwendet &cervisia; beim Aufruf des Befehls <command>diff</command> die Option <option>-U</option>. Der Befehl <command>diff</command> zeigt hierdurch nur eine begrenzte Anzahl von Zeilen in direkter Nachbarschaft zu einer Änderung an (Kontextzeilen). An dieser Stelle können Sie das Argument zur Option <option>-U</option> einstellen.

source: Additional options for cvs diff:
de: Weitere Optionen für „cvs diff“:

source: Here you can add additional arguments to the <command>diff</command>. A popular example is <option>-b</option> which lets <command>diff</command> ignore changes in the amount of whitespace.
de: An dieser Stelle können Sie zusätzliche Optionen für den Befehl <command>diff</command> angeben. Ein beliebtes Beispiel ist die Option <option>-b</option>, bei deren Anwendung der Befehl <command>diff</command> Änderungen bei Whitespaces (also Leerzeichen, Tabulatoren &etc;) ignoriert.

source: Tab width in diff dialog:
de: Tabulatorweite im Diff-Dialog:

source: In the diff dialog, tab characters present in your file or in the output of the <command>diff</command> command are expanded into a fixed number of space characters. By default, each tab is replaced by eight spaces, but here you can setup a different number.
de: Im Diff-Dialog werden Tabulatorzeichen in den Dateien oder in der Ausgabe des Befehls <command>diff</command> durch eine feste Anzahl Leerzeichen ersetzt. Als Voreinstellung wird ein Tabulatorzeichen durch 8 Leerzeichen ersetzt. Diese Voreinstellung können Sie hier an Ihre Bedürfnisse anpassen.

source: External diff frontend:
de: Externe Diff-Oberfläche:

source: When you use any of the features which show the diff dialog, like <menuchoice><guimenu>View</guimenu><guimenuitem>Difference to Repository...</guimenuitem></menuchoice>, &cervisia; invokes its internal diff frontend. If you prefer a different one, like &kompare;, <application>TkDiff</application>, or <application>xxdiff</application>, enter its file name and path here.
de: Immer dann, wenn Sie eine der Funktionalitäten aufrufen, die den Diff-Dialog verwenden, ruft &cervisia; seine interne Diff-Oberfläche auf. Bevorzugen Sie eine andere Oberfläche, beispielsweise &kompare;, <application>TkDiff</application> oder <application>xxdiff</application>, können Sie diese hier angeben.

source: When opening a sandbox from a remote repository, start a File-&gt;Status command automatically
de: Den Befehl Datei-&gt;Status beim Öffnen der Arbeitskopie eines entfernten Archivs automatisch ausführen.

source: When you check this option, the <menuchoice><guimenu>File</guimenu><guimenuitem>Status</guimenuitem></menuchoice> command is started whenever you open a remote sandbox. This command may need some time and also needs a connection to the server for remote repositories (making it unusable for offline usage).
de: Ist diese Einstellung markiert, setzt &cervisia; den Befehl <menuchoice><guimenu>Datei</guimenu><guimenuitem>Status</guimenuitem></menuchoice> automatisch ab, wenn ein entfernter Arbeitsordner geöffnet wird. Die Ausführung dieses Befehls kann einige Zeit in Anspruch nehmen und setzt eine Verbindung zum entfernten &CVS;-Archiv voraus. Daher ist die Ausführung offline nicht möglich.

source: When opening a sandbox from a local repository, start a File-&gt;Status command automatically
de: Den Befehl Datei-&gt;Status beim Öffnen der Arbeitskopie eines lokalen Archivs automatisch ausführen.

source: When you check this option, the <menuchoice><guimenu>File</guimenu><guimenuitem>Status</guimenuitem></menuchoice> command is started whenever you open a local sandbox.
de: Ist diese Einstellung markiert, setzt &cervisia; den Befehl <menuchoice><guimenu>Datei</guimenu><guimenuitem>Status</guimenuitem></menuchoice> automatisch ab, wenn ein lokaler Arbeitsordner geöffnet wird.

source: Advanced
de: Erweitert

source: Timeout after which a progress dialog appears (in ms):
de: Verzögerung in Millisekunden, nach der eine Fortschrittsanzeige erscheint:
