Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdesdk/kcachegrind.po
Languages: de

source: More advanced use is to dump out profile data whenever a given function of your application is called. E.g. for &konqueror;, to see profile data only for the rendering of a Web page, you could decide to dump the data whenever you select the menu item <menuchoice><guimenu>View</guimenu><guimenuitem>Reload </guimenuitem></menuchoice>. This corresponds to a call to <methodname>KonqMainWindow::slotReload</methodname>. Use: <blockquote><para><userinput> <command>valgrind</command> <option>--tool=callgrind</option> <option>--dump-before=KonqMainWindow::slotReload</option> <replaceable>konqueror</replaceable> </userinput></para></blockquote> This will produce multiple profile data files with an additional sequential number at the end of the filename. A file without such an number at the end (only ending in the process PID) will also be produced; by loading this file into &kcachegrind;, all others are loaded too, and can be seen in the <guilabel>Parts Overview</guilabel> and <guilabel>Parts</guilabel> list.
de: Eine fortgeschrittenere Methode ist es, Profiling-Daten immer nur dann zu erzeugen, wenn eine bestimmte Funktion Ihres Programms aufgerufen wird. Wenn Sie beispielsweise für &konqueror; die Profiling-Daten zum Rendern einer Webseite erzeugen möchten, könnten Sie Daten erheben, wenn der Menüeintrag Ansicht/Aktualisieren benutzt wird (dies ist gleichzusetzen mit einem Aufruf von <menuchoice><guimenu>Ansicht</guimenu><guimenuitem>Erneut Laden</guimenuitem></menuchoice>). Dies entspricht dem Aufruf von <methodname>KonqMainWindow::slotReload</methodname>. Benutzen Sie dazu den folgenden Aufruf: <blockquote><para><userinput> <command>valgrind</command> <option>--tool=callgrind</option> <option>--dump-before=KonqMainWindow::slotReload</option> <replaceable>konqueror</replaceable></userinput></para></blockquote> Dadurch werden mehrere Profiler-Dateien erzeugt, jede mit einer eindeutigen, aufsteigenden Nummer im Dateinamen. Es wird auch eine Datei ohne aufsteigende Nummer erzeugt. Diese können Sie in &kcachegrind; laden; die Folgedateien werden automatisch auch geladen und können in der <guilabel>Komponenten-Übersicht</guilabel> und <guilabel>Komponenten</guilabel>-Liste betrachtet werden.

source: &oprofile; is available from <ulink url="http://oprofile.sf.net">its home page</ulink>. Follow the installation instructions on the Web site, but, before you do, check whether your distribution does not already provide it as package (like &SuSE;).
de: &oprofile; finden Sie unter <ulink url="http://oprofile.sf.net">http://oprofile.sf.net</ulink>. Folgen Sie der Installationsanleitung auf der Webseite. Bevor Sie dies allerdings tun, prüfen Sie, ob das Programm bereits von Ihrer Distribution mitgeliefert wird (so &eg; bei &SuSE;).

source: System-wide profiling is only permitted to the root user, as all actions on the system can be observed; therefore, the following has to be done as root. First, configure the profiling process, using the &GUI; <command>oprof_start</command> or the command-line tool <command>opcontrol</command>. Standard configuration should be timer mode (&TBS;, see introduction). To start the measurement, run <userinput><command>opcontrol</command> <option>-s</option></userinput>. Then run the application you are interested in and, afterwards, do a <userinput><command>opcontrol</command> <option>-d</option></userinput>. This will write out the measurement results into files under folder <filename class="directory">/var/lib/oprofile/samples/</filename>. To be able to visualize the data in &kcachegrind;, do in an empty directory: <blockquote><para><userinput> <command>opreport</command> <option>-gdf</option> | <command>op2callgrind</command> </userinput></para></blockquote> This will produce a lot of files, one for every program which was running on the system. Each one can be loaded into &kcachegrind; on its own.
de: Systemweites Profiling ist nur dem Systemverwalter erlaubt, da so alle Aktionen im System überwacht werden können. Die folgenden Schritte müssen Sie also als Systemverwalter ausführen. Richten Sie zuerst den Profiling-Prozess ein; mit der &GUI; <command>oprof_start</command> oder mit dem Befehlszeilenprogramm <command>opcontrol</command>. Der Timer-Modus (&TBS;, siehe Einführung) sollte voreingestellt sein. Um die Messung zu starten, führen Sie <userinput><command>opcontrol</command> <option>-s</option></userinput> aus. Starten Sie nun die Anwendung an deren Werten Sie interessiert sind und führen Sie anschließend <userinput><command>opcontrol</command> <option>-d</option></userinput> aus. Die Messergebnisse werden in Dateien im Ordner <filename class="directory">/var/lib/oprofile/samples/</filename> gespeichert. Um die Daten zu betrachten, führen Sie <blockquote><para><userinput> <command>opreport</command> <option>-gdf</option> | <command>op2callgrind</command> </userinput></para></blockquote> in einem leeren Ordner aus. Es wird für jedes auf dem Systen laufende Programm eine Datei angelegt, die für sich in &kcachegrind; geöffnet werden kann.

source: User Interface Basics
de: Grundlagen der Benutzeroberfläche

source: When starting &kcachegrind; with a profile data file as argument, or after loading one with <menuchoice><guimenu>File</guimenu> <guimenuitem>Open</guimenuitem></menuchoice>, you will see a navigation panel containing the function list at the left; and, on the right the main part, an area with views for a selected function. This view area can be arbitrarily configured to show multiple views at once.
de: Wenn Sie &kcachegrind; mit einer Profildaten-Datei als Argument starten, oder nachdem Sie über <menuchoice><guimenu>Datei</guimenu> <guimenuitem>Öffnen</guimenuitem> </menuchoice> eine Datei geöffnet haben, sehen Sie eine Navigationsleiste mit der Liste der Funktionen links und dem Hauptbereich rechts, in dem die ausgewählte Funktion dargestellt wird. Dieser Bereich kann so eingerichtet werden, dass er mehrere Ansichten anzeigt.

source: At first start, this area will be divided into a top and a bottom part, each with different tab-selectable views. To move views, use the tabs' context menu, and adjust the splitters between views. To switch quickly between different viewing layouts, use <menuchoice><shortcut><keycombo action="simul">&Ctrl;<keycap>→</keycap> </keycombo></shortcut> <guimenu>View</guimenu><guisubmenu>Layout</guisubmenu> <guimenuitem>Go to Next</guimenuitem></menuchoice> and <menuchoice><shortcut><keycombo action="simul">&Ctrl;<keycap>←</keycap> </keycombo></shortcut> <guimenu>View</guimenu><guisubmenu>Layout</guisubmenu> <guimenuitem>Go to Previous</guimenuitem></menuchoice>.
de: Beim ersten Start ist dieser Bereich in zwei übereinander angeordnete Ansichten aufgeteilt, jede Ansicht kann auswählbare Unterfenster enthalten. Benutzen Sie das Kontextmenü der Unterfensterreiter oder den Trennbalken, um diese Ansichten anzupassen, Um schnell zwischen den verschiedenen Ansichten zu wechseln, benutzen Sie <menuchoice><shortcut><keycombo action="simul">&Ctrl;<keycap>Pfeil rechts</keycap> </keycombo></shortcut> <guimenu>Ansicht</guimenu><guisubmenu>Layout</guisubmenu> <guimenuitem>Nächstes Layout</guimenuitem></menuchoice> und <menuchoice><shortcut><keycombo action="simul">&Ctrl;<keycap>Pfeil links</keycap> </keycombo></shortcut> <guimenu>Ansicht</guimenu><guisubmenu>Layout</guisubmenu> <guimenuitem>Vorheriges Layout</guimenuitem></menuchoice>.

source: The active event type is important for visualization: for &callgrind;, this is, for example, cache misses or cycle estimation; for &oprofile;, this is <quote>Timer</quote> in the simplest case. You can change the event type via a combobox in the toolbar or in the <guilabel>Event Type</guilabel> view. A first overview of the runtime characteristics should be given when you select function <function>main</function> in the left list; look then at the call graph view. There, you see the calls occurring in your program. Note that the call graph view only shows functions with high event count. By double-clicking a function in the graph, it will change to show the called functions around the selected one.
de: Der aktuelle Ereignistyp ist wichtig für die Darstellung: Für &callgrind; ist das zum Beispiel <quote>Cache Misses</quote> oder <quote>Cycle Estimation</quote>; für &oprofile; im einfachsten Fall <quote>Timer</quote>. Sie können den Ereignistyp mit dem Kombinationsfeld in der Werkzeugleiste oder in der <guilabel>Ereignistyp</guilabel>-Ansicht ändern. Wenn Sie die Funktion <function>main</function> wählen und einen Blick auf den Aufruf-Graphen werfen, sehen Sie einen ersten Überblick über die Laufzeit-Charakteristik. Sie sehen dort die Aufrufe, die von Ihrem Programm getätigt wurden. Beachten Sie, dass die Aufruf-Graph-Ansicht nur Funktionen anzeigt, die eine hohe Anzahl Ereignisse aufweisen. Wenn Sie im Aufruf-Graphen auf eine Funktion klicken, werden die aufgerufenen Funktionen um die ausgewählte herum angezeigt.

source: To explore the &GUI; further, in addition to this manual, also have a look at the documentation section <ulink url="http://kcachegrind.sf.net">on the Web site</ulink>. Also, every widget in &kcachegrind; has <quote>What's this</quote> help.
de: Um die &GUI; besser kennen zu lernen, lesen Sie zusätzlich zu diesem Handbuch auch den Dokumentationsabschnitt auf der Webseite <ulink url="http://kcachegrind.sf.net">http://kcachegrind.sf.net</ulink>. Zudem hat jedes Element in &kcachegrind; eine <quote>Was ist das</quote>-Hilfe.

source: Basic Concepts
de: Grundlegende Konzepte

source: This chapter explains some concepts of the &kcachegrind;, and introduces terms used in the interface.
de: Dieses Kapitel erläutert einige in &kcachegrind; verwendete Konzepte und Begriffe aus der Bedienungsoberfläche.

source: The Data Model for Profile Data
de: Das Datenmodell der Profildaten

source: Cost Entities
de: Kosteneinheiten

source: Cost counts of event types (like L2 Misses) are attributed to cost entities, which are items with relationship to source code or data structures of a given program. Cost entities not only can be simple code or data positions, but also position tuples. For example, a call has a source and a target, or a data address can have a data type and a code position where its allocation happened.
de: Kosten von Ereignistypen (wie L2-Misses) sind Kostenpunkten zugeordnet, was Elemente mit Bezugspunkten im Quelltext oder in Datenstrukturen eines gegebenen Programms sind. Kostenpunkte können nicht nur einfache Positionen im Quelltext oder in Daten sein, sondern auch Positions-Tupel. Ein Aufruf, zum Beispiel, hat eine Quelle und ein Ziel, und eine Datenadresse kann einen Datentyp und eine Adresse im Quelltext haben, an der er alloziert wird.

source: The cost entities known to &kcachegrind; are given in the following. Simple Positions: <variablelist> <varlistentry> <term>Instruction</term> <listitem><para> An assembler instruction at a specified address. </para></listitem> </varlistentry> <varlistentry> <term>Source Line of a Function</term> <listitem><para> All instructions that the compiler (via debug information) maps to a given source line specified by source file name and line number, and which are executed in the context of some function. The latter is needed because a source line inside of an inlined function can appear in the context of multiple functions. Instructions without any mapping to an actual source line are mapped to line number 0 in file <filename>???</filename>. </para></listitem> </varlistentry> <varlistentry> <term>Function</term> <listitem><para> All source lines of a given function make up the function itself. A function is specified by its name and its location in some binary object if available. The latter is needed because binary objects of a single program each can hold functions with the same name (these can be accessed &eg; with <function>dlopen</function> or <function>dlsym</function>; the runtime linker resolves functions in a given search order of binary objects used). If a profiling tool cannot detect the symbol name of a function, &eg; because debug information is not available, either the address of the first executed instruction typically is used, or <function>???</function>. </para></listitem> </varlistentry> <varlistentry> <term>Binary Object</term> <listitem><para> All functions whose code is inside the range of a given binary object, either the main executable or a shared library. </para></listitem> </varlistentry> <varlistentry> <term>Source File</term> <listitem><para> All functions whose first instruction is mapped to a line of the given source file. </para></listitem> </varlistentry> <varlistentry> <term>Class</term> <listitem><para> Symbol names of functions typically are hierarchically ordered in name spaces, &eg; C++ namespaces, or classes of object-oriented languages; thus, a class can hold functions of the class or embedded classes itself. </para></listitem> </varlistentry> <varlistentry> <term>Profile Part</term> <listitem><para> Some time section of a profile run, with a given thread ID, process ID, and command line executed. </para></listitem> </varlistentry> </variablelist> As can be seen from the list, a set of cost entities often defines another cost entity; thus, there is a inclusion hierarchy of cost entities.
de: &kcachegrind; sind die wie folgt genannten Kostenpunkte bekannt. Einfache Positionen: <variablelist><varlistentry><term>Instruktion</term> <listitem><para> Eine Assembler-Instruktion an einer bestimmten Adresse.</para></listitem> </varlistentry> <varlistentry> <term>Quelltextzeile einer Funktion</term> <listitem><para> Alle Instruktionen, die der Compiler (über Debug-Informationen) einer Quelltextzeile zuordnet (Dateiname und Zeilennummer) und die im Kontext einer Funktion ausgeführt werden. Letzteres ist wichtig, da eine Zeile innerhalb einer Inline-Funktion im Kontext verschiedener Funktionen auftauchen kann. Instruktionen ohne Zuordnung erscheinen mit Zeilennummer 0 in Datei <filename>???</filename>. </para></listitem> </varlistentry> <varlistentry> <term>Funktion</term> <listitem><para> Alle Quelltextzeilen einer Funktion. Eine Funktion wird über ihren Namen und, sofern vorhanden, ihre Position in einem Binärobjekt angegeben. Letzteres ist wichtig, da jedes Binärobjekt eines Programms Funktionen mit demselben Namen enthalten kann (auf diese kann &eg; mit <function>dlopen</function> oder <function>dlsym</function> zugegriffen werden; der Laufzeit-Linker löst Funktionen in verwendeten Binärobjekten in einer bestimmten Suchreihenfolge auf). Wenn ein Profiling-Werkzeug den Symbolnamen einer Funktion nicht bestimmen kann, &eg; weil keine Debug-Informationen verfügbar sind, wird entweder die Adresse der zuerst ausgeführten Instruktion, oder <function>???</function> angegeben. </para></listitem> </varlistentry> <varlistentry><term>Binärobjekt</term> <listitem><para> Alle Funktionen, die innerhalb der Grenzen eines gegebenen Binärobjekts liegen. Dies gilt für die primäre Programmdatei, sowie für Shared-Libraries. </para></listitem> </varlistentry> <varlistentry> <term>Quelltextdatei</term> <listitem><para> Alle Funktionen, deren erste Instruktion einer Zeile der gegebenen Quelltextdatei zugeordnet ist. </para></listitem> </varlistentry> <varlistentry> <term>Klasse</term> <listitem><para> Symbolnamen von Funktionen sind normalerweise hierarchisch in Namensräumen geordnet, &eg; C++-Namensräume, oder Klassen in objektorientierten Sprachen; daher kann eine Klasse selbst Funktionen der Klasse und eingebetteter Klassen enthalten. </para></listitem> </varlistentry> <varlistentry> <term>Profilabschnitt</term> <listitem><para> Ein Zeitabschnitt eines Profiler-Durchlaufs mit einem gegebenen Thread-ID, Prozess-ID und ausgeführter Befehlszeile.</para></listitem> </varlistentry> </variablelist> Wie Sie an der Liste erkennen können, definiert ein Satz Kostenpunkte oft einen neuen Kostenpunkt; daher entsteht eine Einrechnungshierarchie von Kostenpunkten, die durch die obige Beschreibung ersichtlich sein sollte.

source: Positions tuples: <itemizedlist> <listitem><para> Call from instruction address to target function. </para></listitem> <listitem><para> Call from source line to target function. </para></listitem> <listitem><para> Call from source function to target function. </para></listitem> <listitem><para> (Un)conditional jump from source to target instruction. </para></listitem> <listitem><para> (Un)conditional jump from source to target line. </para></listitem> </itemizedlist> Jumps between functions are not allowed, as this makes no sense in a call graph; thus, constructs like exception handling and long jumps in C have to be translated to popping the call stack as needed.
de: Positions-Tupel: <itemizedlist> <listitem><para>Aufruf von Instruktionsadresse auf Zielfunktion.</para></listitem> <listitem><para>Aufruf von Quelltextzeile auf Zielfunktion.</para></listitem> <listitem><para>Aufruf von Quellfunktion auf Zielfunktion.</para></listitem> <listitem><para>(Un)bedingter Sprung von Quellinstruktion auf Zielinstruktion.</para></listitem> <listitem><para>(Un)bedingter Sprung von Quellzeile auf Zielzeile.</para></listitem> </itemizedlist> Sprünge zwischen Funktionen werden nicht unterstützt, da diese in einem Aufrufgraphen nicht sinnvoll sind; daher müssen Konstruktionen wie Ausnahmen (Exceptions) und Long-Jumps in C so verändert werden, dass sie, sofern nötig, als Pop-Instruktion auf den Aufrufstapel ausgeführt werden.

source: Event Types
de: Ereignistypen

source: Arbitrary event types can be specified in the profile data by giving them a name. Their cost related to a cost entity is a 64-bit integer.
de: In den Profildaten können weitere Ereignistypen angegeben werden, indem ihnen ein Name zugeordnet wird. Ihre Kosten bezogen auf einen Kostenpunkt ist ein 64-Bit-Integer.

source: Event types whose costs are specified in a profile data file are called real events. Additionally, one can specify formulas for event types calculated from real events, which are called inherited events.
de: Ereignistypen, deren Kosten in einer Profildaten-Datei angegeben sind, heißen <quote>echte Ereignisse</quote>. Zusätzlich können Sie Formeln für Ereignistypen definieren, die aus echten Ereignissen errechnet werden. Diese heißen abgeleitete Ereignisse.

source: Visualization State
de: Darstellungsstatus

source: The visualization state of a &kcachegrind; window includes: <itemizedlist> <listitem><para> the primary and secondary event type chosen for display, </para></listitem> <listitem><para> the function grouping (used in the <guilabel>Function Profile</guilabel> list and entity coloring), </para></listitem> <listitem><para> the profile parts whose costs are to be included in visualization, </para></listitem> <listitem><para> an active cost entity (&eg; a function selected from the function profile sidedock), </para></listitem> <listitem><para> a selected cost entity. </para></listitem> </itemizedlist> This state influences the views.
de: Der Darstellungsstatus eines &kcachegrind;-Fensters beinhaltet: <itemizedlist> <listitem><para>den anzuzeigenden primären und sekundären Ereignistyp,</para></listitem> <listitem><para>die Funktionsgruppierung (für die <guilabel>Funktionsprofil</guilabel>-Liste und die Einfärbung der Elemente),</para></listitem> <listitem><para>die Abschnitte des Profils, die in die Darstellung eingehen</para></listitem> <listitem><para>ein aktiver Kostenpunkt (&eg; eine Funktion, die aus der Funktionsprofil-Ansicht ausgewählt wurde),</para></listitem> <listitem><para> ein ausgewählter Kostenpunkt.</para></listitem> </itemizedlist> Dieser Status beeinflusst die Darstellung.

source: Views are always shown for one cost entity, the active one. When a given view is inappropriate for a cost entity, it is disabled: when selecting &eg; an &ELF; object in the group list, source annotation makes no sense.
de: Ansichten werden immer nur für einen Kostenpunkt (den aktiven) dargestellt. Ist eine Darstellung nicht angemessen für einen Kostenpunkt, wird sie ausgeblendet (&eg; wenn ein &ELF;-Objekt aus der Gruppenliste ausgewählt wird, sind Anmerkungen am Quelltext nicht sinnvoll).

source: For example, for an active function, the callee list shows all the functions called from the active one: one can select one of these functions without making it active. Also, if the call graph is shown beside, it will automatically select the same function.
de: Zum Beispiel zeigt die Aufgerufene-Liste einer aktiven Funktion alle Funktionen, die auf der aktiven heraus aufgerufen wurden. Sie können eine dieser Funktionen markieren, ohne sie zu aktivieren. Wird der Aufruf-Graph daneben angezeigt, wird hier automatisch die gleiche Funktion ausgewählt.

source: Parts of the &GUI;
de: Bestandteile der Benutzeroberfläche

source: Sidedocks
de: Navigationsbereich

source: Sidedocks are side windows which can be placed at any border of a &kcachegrind; window. They always contain a list of cost entities sorted in some way.
de: Docks sind Seitenfenster, die an jeder Seite des &kcachegrind;-Fensters angebracht werden können. Sie enthalten jeweils eine Liste mit Kostenpunkten in einer bestimmten Ordnung.

source: The <guilabel>Function Profile</guilabel> is a list of functions showing inclusive and exclusive cost, call count, name and position of functions.
de: Das <guilabel>Funktionsprofil</guilabel> ist eine Liste von Funktionen, in der die Inklusiv- und Exklusivkosten, die Anzahl der Aufrufe, der Name und die Position der Funktionen angezeigt werden.

source: <guilabel>Parts Overview</guilabel>
de: <guilabel>Übersicht der Profilabschnitte</guilabel>

source: <guilabel>Call Stack</guilabel>
de: <guilabel>Aufrufstapel</guilabel>

source: View Area
de: Ansichtsbereiche

source: The view area, typically the right part of a &kcachegrind; main window, is made up of one (default) or more tabs, lined up either horizontally or vertically. Each tab holds different views of only one cost entity at a time. The name of this entity is given at the top of the tab. If there are multiple tabs, only one is active. The entity name in the active tab is shown in bold, and determines the active cost entity of the &kcachegrind; window.
de: Der Anzeigebereich, gewöhnlich der rechte Bereich im &kcachegrind;-Hauptfenster, ist aus einem (Standard), oder mehreren Unterfenstern aufgebaut, die entweder waagerecht oder senkrecht angeordnet sind. Jedes Unterfenster enthält verschiedene Ansichten, die jeweils immer einen Kostenpunkt anzeigen. Der Name dieses Kostenpunkts wird oben im Unterfenster angezeigt. Sind mehrere Unterfenster vorhanden, ist immer nur eines von ihnen aktiv. Der Name des Kostenpunkts wird im aktiven Unterfenster fett dargestellt und bestimmt den aktiven Kostenpunkt im &kcachegrind;-Fenster.

source: Areas of a Tab
de: Bereiche eines Unterfensters

source: Each tab can hold up to four view areas, namely Top, Right, Left, and Bottom. Each area can hold multiple stacked views. The visible part of an area is selected by a tab bar. The tab bars of the top and right area are at the top; the tab bars of the left and bottom area are at the bottom. You can specify which kind of view should go into which area by using the tabs' context menus.
de: Jedes Unterfenster kann bis zu vier Bereiche enthalten: oben, rechts, links und unten. Zudem kann jeder Bereich mehrere Ansichten enthalten. Der sichtbare Teil eines Bereichs wird über die Unterfensterleiste ausgewählt. Die Unterfensterleisten der oberen und rechten Bereiche befindet sich oben; die der linken und unteren Bereiche befinden sich unten. Sie können festlegen, welche Darstellungsart in welchem Bereich angezeigt wird, indem Sie das Kontextmenü des Unterfensters verwenden.
