Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdesdk/kcachegrind.po
Languages: de

source: You have activated a function below <function>main()</function>, which obviously costs less than <function>main()</function> itself. For every function, it is shown only the part of the cost spent while the <emphasis>activated</emphasis> function is running; that is, the cost shown for any function can never be higher than the cost of the activated function.
de: Sie haben eine Funktion unterhalb von <function>main()</function> gewählt, die geringere Kosten als <function>main()</function> selbst hat. Für jede Funktion wird nur der Teil der Kosten angezeigt, der von der <emphasis>aktivierten</emphasis> Funktion verursacht wird. Daher können die Kosten für eine Funktion nie höher sein als die der aktivierten Funktion.

source: Cost Entity
de: Kostenpunkt

source: An abstract item related to source code to which event counts can be attributed. Dimensions for cost entities are code location (&eg; source line, function), data location (&eg; accessed data type, data object), execution location (&eg; thread, process), and tuples or triples of the aforementioned positions (&eg; calls, object access from statement, evicted data from cache).
de: Abstraktes Element mit Bezug zu Stellen im Quelltext denen sich Ereigniszahlen zuordnen lassen. Kostenpunkte werden in den Größen Position im Quelltext (&eg; Zeile, Funktion), Position der Daten (&eg; aufgerufene Datentypen, Datenobjekt), Ort der Ausführung (&eg; Thread, Prozess) und Tupel oder Tripel der genannten Positionen (&eg; Aufrufe, Zugriff auf Objekte, aus dem Cache entfernte Daten) angegeben.

source: Event Costs
de: Ereigniskosten

source: Sum of events of some event type occurring while the execution is related to some cost entity. The cost is attributed to the entity.
de: Summe der Ereignisse eines Ereignistyps, der während der Ausführung aufgetreten ist und zu einem bestimmten Kostenpunkt gehört. Die Kosten werden dem Punkt zugeordnet.

source: <glossterm>Event Type</glossterm>
de: <glossterm>Ereignistyp</glossterm>

source: The kind of event of which costs can be attributed to a cost entity. There are real event types and inherited event types.
de: Art eines Ereignisses, dessen Kosten einem Kostenpunkt zugeordnet werden können. Es gibt echte und abgeleitete Ereignistypen.

source: Inherited Event Type
de: Abgeleiteter Ereignistyp

source: A virtual event type only visible in the view, defined by a formula to be calculated from real event types.
de: Virtueller Ereignistyp, der nur in Darstellungen angezeigt wird, die mit einer Formel aus einem echten Ereignistyp errechnet werden.

source: Profile Data File
de: Profildaten-Datei

source: A file containing data measured in a profile experiment, or part of one, or produced by post-processing a trace. Its size is typically linear with the code size of the program.
de: Eine Datei mit Daten, die Messwerte eines Profil-Experiments (oder eines Abschnitts davon) enthält oder beim Nachverarbeiten von Profildaten erzeugt wurde. Die Datenmenge verhält normalerweise linear zur Größe des Quelltextes.

source: Profile Data Part
de: Profildaten-Abschnitt

source: Data from a profile data file.
de: Daten aus einer Profildaten-Datei.

source: Profile Experiment
de: Profil-Experiment

source: A program run supervised by a profiling tool, producing possibly multiple profile data files from parts or threads of the run.
de: Ein Programmablauf, der von einem Profiling-Werkzeug überwacht wird und eine oder mehrere Profildaten-Dateien aus Abschnitten und/oder Threads des Ablaufs erzeugt.

source: Profile Project
de: Profil-Projekt

source: A configuration for profile experiments used for one program to profile, perhaps in multiple versions. Comparisons of profile data typically only makes sense between profile data produced in experiments of one profile project.
de: Eine Konfiguration für Profil-Experimente, die für ein zu überwachendes Programm, vielleicht in mehreren Versionen, verwendet wird. Profildaten zu vergleichen, ist nur dann sinnvoll, wenn sie in Experimenten eines Profil-Projekts erzeugt wurden.

source: The process of collecting statistical information about runtime characteristics of program runs.
de: Der Prozess des Sammelns statistischer Informationen über die Laufzeit-Eigenschaften eines Programmablaufs.

source: Real Event Type
de: Echte Ereignistypen

source: An event type that can be measured by a tool. This requires the existence of a sensor for the given event type.
de: Ereignistyp, der mit einem entsprechenden Werkzeug gemessen werden kann. Es ist ein Sensor für den gegebenen Ereignistyp erforderlich.

source: Trace
de: Profildaten

source: A sequence of timestamped events that occurred while tracing a program run. Its size is typically linear with the execution time of the program run.
de: Eine Abfolge zeitlich markierter Ereignisse, die beim Überwachen eines Programmablaufs aufgetreten sind. Die Datenmenge verhält sich normalerweise linear zu Laufzeit des Programms.

source: Trace Part
de: Profildaten-Abschnitt

source: The process of supervising a program run and storing its events, sorted by a timestamp, in an output file, the trace.
de: Der Prozess des Überwachens eines Programmaufrufs. Dabei werden auftretende Ereignisse nach Zeitstempeln sortiert in eine Datei geschrieben, die Profildaten-Datei.

source: Credits and License
de: Danksagungen und Lizenz

source: Thanks to Julian Seward for his excellent &valgrind;, and Nicholas Nethercote for the &cachegrind; addition. Without these programs, &kcachegrind; would not exist. Some ideas for this &GUI; were from them, too.
de: Dank an Julian Seward für seine einzigartige Anwendung &valgrind; und Nicholas Nethercote für den &cachegrind;-Zusatz. Ohne diese Programme würde &kcachegrind; nicht existieren. Viele Ideen für die Benutzeroberfläche stammen ebenfalls von ihnen.

source: Thanks for all the bug reports and suggestions from different users.
de: Danke für die vielen Fehlerberichte und Vorschläge von verschiedenen Benutzern.

source: CREDIT_FOR_TRANSLATORS
de: <para>Übersetzung Thomas Reitelbach <email>tr@erdfunkstelle.de</email></para>

source: How to obtain &kcachegrind;
de: Bezugsquellen von &kcachegrind;

source: &kcachegrind; is part of the &package; package of &kde;. For less supported interim releases, &callgrind; and further documentation, see <ulink url="http://kcachegrind.sf.net">the Web page</ulink>. Look there for further installation and compile instructions.
de: &kcachegrind; ist Teil des &kde;-Paketes &package;. Zusätzlich gibt es das Programm, &callgrind;, und weitere Dokumentation Sie auf der Webseite <ulink url="http://kcachegrind.sf.net"> http://kcachegrind.sf.net</ulink>. Dort gibt es weitere Installations- und Kompilierungshinweise.

source: Requirements
de: Anforderungen

source: In order to use &kcachegrind;, you need &kde; 4.x. To generate profile data, &cachegrind; or &calltree;/&callgrind; is recommended.
de: Um &kcachegrind; benutzen zu können, benötigen Sie &kde; 4.x. Um die Ablaufprotokolle zu erzeugen, sind zusätzlich &cachegrind; oder &calltree;/&callgrind; erforderlich.

source: Compilation and Installation
de: Kompilierung und Installation

source: Configuration
de: Einrichtung

source: All configuration options are either in the configuration dialog or in the context menus of the views.
de: Alle Einstellungsmöglichkeiten sind entweder im Einstellungsdialog oder in den Kontextmenüs der Graphen zu finden.
