Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdesdk/kcachegrind.po
Languages: de

source: Synchronized View with Selected Entity in a Tab
de: Abgleich von Ansichten über ein ausgewähltes Element in einem Unterfenster

source: Besides an active entity, each tab has a selected entity. As most view types show multiple entities with the active one somehow centered, you can change the selected item by navigating inside a view (by clicking with the mouse or using the keyboard). Typically, selected items are shown in a highlighted state. By changing the selected entity in one of the views of a tab, all other views highlight the new selected entity accordingly.
de: Neben einem aktiven Element hat jedes Unterfenster ein ausgewähltes Element. Da die meisten Darstellungsarten mehrere Elemente anzeigen, wobei das aktive irgendwie zentriert wird, können Sie das gewählte Element ändern, indem Sie in der Ansicht navigieren (mit Mausklick oder der Tastatur). Ausgewählte Elemente werden hervorgehoben. Wenn Sie die Auswahl in einer Ansicht eines Unterfensters ändern, wird die Hervorhebung in allen anderen Ansichten ebenfalls geändert.

source: Synchronization between Tabs
de: Abgleich zwischen Unterfenstern

source: If there are multiple tabs, a selection change in one tab leads to an activation change in the next tab, be it right of the former or under it. This kind of linkage should, for example, allow for fast browsing in call graphs.
de: Sind mehrere Unterfenster vorhanden, ändert eine Auswahländerung in einem Unterfenster eine Aktivitätsänderung im nächsten Unterfenster rechts oder unter dem ersten Unterfenster. Diese Verknüpfung ermöglicht eine schnelle Navigation in Aufruf-Graphen.

source: The layout of all the tabs of a window can be saved (<menuchoice><guimenu>View </guimenu><guisubmenu>Layout</guisubmenu></menuchoice>). After duplicating the current layout (<menuchoice><shortcut><keycombo action="simul">&Ctrl; <keycap>+</keycap></keycombo></shortcut> <guimenu>View</guimenu> <guisubmenu>Layout</guisubmenu><guimenuitem>Duplicate</guimenuitem> </menuchoice>) and changing some sizes or moving a view to another area of a tab, you can quickly switch between the old and the new layout via <keycombo action="simul"> &Ctrl;<keycap>←</keycap></keycombo> and <keycombo action="simul">&Ctrl; <keycap>→</keycap></keycombo>. The set of layouts will be stored between &kcachegrind; sessions of the same profiled command. You can make the current set of layouts the default one for new &kcachegrind; sessions, or restore the default layout set.
de: Das Layout aller Unterfensteransichten eines Fensters kann gespeichert werden (siehe Menüpunkt <menuchoice><guimenu>Ansicht</guimenu><guisubmenu>Layout</guisubmenu></menuchoice>). Nach dem Kopieren des aktuellen Layouts (<menuchoice><shortcut><keycombo action="simul">&Ctrl; <keycap>+</keycap></keycombo></shortcut> <guimenu>Ansicht</guimenu> <guisubmenu>Layout</guisubmenu><guimenuitem>Kopieren</guimenuitem> </menuchoice>) und Ändern einiger Größen oder Verschieben einer Darstellungsansicht in einen anderen Bereich einer Unterfensteransicht können Sie mit <keycombo action="simul">&Ctrl;<keycap>Pfeil links</keycap></keycombo> bzw. <keycombo action="simul">&Ctrl;<keycap>Pfeil rechts</keycap></keycombo> zwischen dem alten und dem neuen Layout umschalten. Die Layouts werden über &kcachegrind;-Sitzungen mit dem gleichen Profiler-Befehl hinweg gespeichert. Sie können die aktuellen Layouts als Voreinstellung für neue Sitzungen speichern, oder das Standard-Layout wiederherstellen.

source: Flat Profile
de: Flaches Profil

source: The <guilabel>Flat Profile</guilabel> contains a group list and a function list. The group list contains all groups where cost is spent in, depending on the chosen group type. The group list is hidden when grouping is switched off.
de: Das <guilabel>flache Profil</guilabel> enthält eine Gruppenliste und eine Funktionsliste. Die Gruppenliste zeigt alle Gruppen, in denen Kosten verursacht werden, abhängig vom gewählten Gruppentyp. Die Gruppenliste ist ausgeblendet, wenn die Gruppierung ausgeschaltet ist.

source: The function list contains the functions of the selected group (or all functions if grouping is switched off), ordered by some column, &eg; inclusive or self costs spent therein. There is a maximum number of functions shown in the list, configurable in <menuchoice><guimenu>Settings</guimenu><guimenuitem>Configure KCachegrind</guimenuitem></menuchoice>.
de: Die Funktionsliste enthält die Funktionen der gewählten Gruppe (oder alle Funktionen, wenn die Gruppierung abgeschaltet ist), sortiert nach Spalten, &eg; Inklusiv- oder Exklusivkosten. Die Anzahl der Elemente in der Liste ist begrenzt, und kann unter <menuchoice><guimenu>Einstellungen</guimenu><guimenuitem>&kcachegrind; einrichten ...</guimenuitem></menuchoice> angepasst werden.

source: <title>Parts Overview</title>
de: <title>Übersicht der Profilabschnitte</title>

source: In a profile run, multiple profile data files can be produced, which can be loaded together into &kcachegrind;. The <guilabel>Parts Overview</guilabel> sidedock shows these, ordered horizontally according to creation time; the rectangle sizes are proportional to the cost spent each part. You can select one or several parts to constrain the costs shown in the other &kcachegrind; views to these parts only.
de: Während eines Profiler-Durchlaufs können mehrere Profildaten-Dateien erzeugt werden, die alle zusammen in &kcachegrind; geladen werden können. Das Dock <guilabel>Übersicht der Profilabschnitte</guilabel> zeigt diese an, waagerecht angeordnet nach Erstellungszeit. Die Größen der Rechtecke sind proportional zu den Kosten der Abschnitte. Sie können einen oder mehrere Abschnitte auswählen um die Anzeige der Kosten in den anderen &kcachegrind;-Ansichten auf diese Abschnitte zu beschränken.

source: The parts are further subdivided between a partitioning and an inclusive cost split mode:
de: Die Abschnitte sind weiter unterteilt in einen Partitions- und einen Inklusivkosten-Modus:

source: Partitioning Mode
de: Anzeigemodus für Details

source: The partitioning is shown in groups for a profile data part, according to the group type selected. For example, if &ELF; object groups are selected, you see colored rectangles for each used &ELF; object (shared library or executable), sized according to the cost spent therein.
de: Die Aufteilung der Dateien eines Profildaten-Abschnitts wird in Gruppen angezeigt, je nachdem, welcher Gruppentyp ausgewählt ist. Sind zum Beispiel &ELF;-Objektgruppen ausgewählt, sehen Sie farbige Rechtecke für jedes benutzte &ELF;-Objekt (Shared-Library oder Programmdatei), deren Größe durch die verursachten Kosten bestimmt wird.

source: Diagram Mode
de: Diagramm-Modus

source: A rectangle showing the inclusive cost of the current active function in the part is shown. This, again, is split up to show the inclusive costs of its callees.
de: Es wird ein Rechteck mit den Inklusivkosten der aktiven Funktion angezeigt. Dieses ist wiederum in die Inklusivkosten der aufgerufenen Funktionen unterteilt.

source: <title>Call Stack</title>
de: <title>Aufrufstapel</title>

source: This is a purely fictional <quote>most probable</quote> call stack. It is built up by starting with the current active function, and adds the callers and callees with highest cost at the top and to bottom.
de: Dieser Aufrufstapel ist nicht echt sondern ein <quote>sehr wahrscheinliches</quote> Abbild. Er wird von der aktiven Funktion her aufgebaut und enthält alle Aufrufer und Aufgerufenen absteigend mit den höchsten Kosten oben.

source: The <guilabel>Cost</guilabel> and <guilabel>Calls</guilabel> columns show the cost used for all calls from the function in the line above.
de: Die Spalten <guilabel>Kosten</guilabel> und <guilabel>Aufrufe</guilabel> zeigen die Kosten aller Aufrufe der Funktion eine Zeile höher.

source: Views
de: Ansichten

source: <title>Event Type</title>
de: <title>Ereignistyp</title>

source: The <guilabel>Event Type</guilabel> list shows all cost types available and the corresponding self and inclusive cost of the current active function for that event type.
de: Die <guilabel>Ereignistyp</guilabel>-Liste zeigt alle verfügbaren Kostentypen und die dazugehörigen Exklusiv- und Inklusivkosten der derzeit aktiven Funktion für den Ereignistyp.

source: By choosing an event type from the list, you change the type of costs shown all over &kcachegrind; to the selected one.
de: Wenn Sie einen Ereignistyp wählen, ändern Sie den Kostentyp, der überall in &kcachegrind; angezeigt wird.

source: Call Lists
de: Aufruflisten

source: These lists show calls to and from the current active function. With <guilabel>All Callers</guilabel> and <guilabel>All Callees</guilabel> are meant those functions reachable in the caller and callee direction, even when other functions are in between.
de: Diese Listen zeigen Aufrufe auf und von der derzeit aktiven Funktion. <guilabel>Alle Aufrufer</guilabel> und <guilabel>Alle Aufgerufenen</guilabel> bedeutet, dass diese Funktionen in Richtung vom Aufrufer zum Aufgerufenen erreichbar sind, selbst wenn andere Funktionen dazwischen stehen.

source: Call list views include:
de: Die Ansicht von Aufruflisten enthält:

source: Direct <guilabel>Callers</guilabel>
de: Direkte <guilabel>Aufrufer</guilabel>

source: Direct <guilabel>Callees</guilabel>
de: Direkt <guilabel>Aufgerufene</guilabel>

source: All Callers
de: Alle Aufrufer

source: All Callees
de: Alle Aufgerufenen

source: Maps
de: Karten

source: A treemap view of the primary event type, up or down the call hierarchy. Each colored rectangle represents a function; its size is approximately proportional to the cost spent therein while the active function is running (however, there are drawing constrains).
de: Eine Baumstruktur-Darstellung des primären Ereignistyps, auf- oder abwärts in der Aufrufhierarchie. Jedes farbige Rechteck stellt eine Funktion dar; die Größe ist (abgesehen von zeichnerischen Ungenauigkeiten) proportional zu den verursachten Kosten, während die aktive Funktion ausgeführt wird.

source: For the <guilabel>Caller Map</guilabel>, the graph shows the nested hierarchy of all callers of the currently activated function; for the <guilabel>Callee Map</guilabel>, it shows that of all callees.
de: In der <guilabel>Aufruferkarte</guilabel> zeigt der Graph die eingebettete Hierarchie aller Aufrufer der aktiven Funktion; in der <guilabel>Aufrufkarte</guilabel> werden alle aufgerufenen Funktionen angezeigt.

source: Appearance options can be found in the context menu. To get exact size proportions, choose <guimenuitem>Skip Incorrect Borders</guimenuitem>. As this mode can be very time-consuming, you may want to limit the maximum drawn nesting level before. <guilabel>Best</guilabel> determinates the split direction for children from the aspect ratio of the parent. <guilabel>Always Best</guilabel> decides on remaining space for each sibling. <guilabel>Ignore Proportions</guilabel> takes space for function name drawing before drawing children. Note that size proportions can get heavily wrong.
de: Einstellungen zum Erscheinungsbild finden Sie im Kontextmenü. Wählen Sie <guimenuitem>Unpassende Ränder nicht zeichnen</guimenuitem> um genaue Größen-Proportionen zu bekommen. Da dieser Modus sehr zeitintensiv sein kann, ist es ratsam, die maximale Verschachtelungstiefe zu begrenzen. <guilabel>Beste Teilungsrichtung pro Ebene</guilabel> bestimmt die Teilungsrichtung anhand des Seitenverhältnisses des übergeordneten Elements. <guilabel>Immer beste Teilungsrichtung</guilabel> entscheidet anhand des verbleibenden Platzes für jedes Geschwister. <guilabel>Proportionen ignorieren</guilabel> nutzt den Platz zuerst für die Funktionsbeschriftung. Beachten Sie, dass das Größenverhältnis stark abweichen kann.

source: Keyboard navigation is available with the left and right arrow keys for traversing siblings, and up and down arrow keys to go a nesting level up and down. &Enter; activates the current item.
de: Tastatursteuerung ist mit der linken und rechten Pfeiltaste möglich, um die Geschwister zu durchlaufen; und mit den Tasten Pfeil hoch/runter, um Verschachtelungebenen hoch bzw. runter zu gehen. Die Eingabetaste aktiviert das aktuelle Element.

source: Call Graph
de: Aufrufgraph

source: This view shows the call graph around the active function. The cost shown is only the cost spent while the active function was actually running, &ie; the cost shown for <function>main()</function> (if it's visible) should be the same as the cost of the active function, as that is the part of inclusive cost of <function>main()</function> spent while the active function was running.
de: Diese Ansicht zeigt den Aufrufgraph um die aktive Funktion herum an. Die angezeigten Kosten sind nur die Kosten, die bei der Ausführung der Funktion angefallen sind; &ie; die Kosten für <function>main()</function>, sofern angezeigt, sollten den Kosten der aktiven Funktion entsprechen, da diese ein Teil der Inklusivkosten von <function>main()</function> sind, die bei der Ausführung der aktiven Funktion angefallen sind.

source: For cycles, blue call arrows indicate that this is an artificial call, which never actually happened, added for correct drawing.
de: Für Zyklen wird ein blauer Pfeil angezeigt, der angibt, dass es sich nicht um einen echten Aufruf handelt; er wird nie ausgeführt, sondern nur zum richtigen Zeichnen benötigt.

source: If the graph is larger than the drawing area, a bird's eye view is shown on a side. There are view options similar to those of the call maps; the selected function is highlighted.
de: Ist der Graph größer als der Zeichenbereich, wird in einer Ecke eine Übersicht angezeigt. Es gibt ähnliche Darstellungen für die Aufruf-Baumansicht; die ausgewählte Funktion ist hervorgehoben.

source: Annotations
de: Code-Anmerkungen

source: The annotated source or assembler lists show the source lines or disassembled instructions of the current active function together with the (self) cost spent executing the code of a source line or instruction. If there was a call, lines with details on the call are inserted into the source: the (inclusive) cost spent inside of the call, the number of calls happening, and the call destination.
de: Die Quelltext/Assembler-Listen mit Anmerkungen zeigen die Quelltextzeilen bzw. disassemblierten Instruktionen der aktiven Funktion zusammen mit den (Exklusiv)-Kosten, die beim Ausführen der Quelltextzeile/Instruktion verursacht wurden. Im Falle eines Aufrufs werden Zeilen mit Details zum Aufruf in den Quelltext eingefügt: (Inklusiv)-Kosten innerhalb des Aufrufs, Anzahl der Aufrufe und Aufrufziel.

source: Select such a call information line to activate the call destination.
de: Wählen Sie so eine Aufrufinformationslinie, um das Aufrufziel zu aktivieren.

source: Command Reference
de: Befehlsreferenz

source: The main &kcachegrind; window
de: Das Hauptfenster von &kcachegrind;

source: The <guimenu>File</guimenu> Menu
de: Das Menü <guimenu>Datei</guimenu>

source: <shortcut> <keycombo>&Ctrl;<keycap>N</keycap></keycombo> </shortcut> <guimenu>File</guimenu><guimenuitem>New</guimenuitem>
de: <shortcut> <keycombo>&Ctrl;<keycap>N</keycap></keycombo> </shortcut> <guimenu>Datei</guimenu> <guimenuitem>Neu</guimenuitem>

source: <action>Opens an empty top-level window</action> in which you can load profile data. This action is not really necessary, as <menuchoice> <guimenu>File</guimenu><guimenuitem>Open</guimenuitem></menuchoice> gives you a new top-level window if the current one already shows some data.
de: <action>Öffnet ein leeres Hauptfenster, in das Sie Profildaten laden können.</action> Diese Aktion wird eigentlich nicht benötigt, da <menuchoice><guimenu>Datei</guimenu> <guimenuitem>Öffnen ...</guimenuitem> </menuchoice> ein neues Hauptfenster öffnet, wenn im aktuellen Fenster bereits Daten angezeigt werden.

source: <shortcut> <keycombo>&Ctrl;<keycap>O</keycap></keycombo> </shortcut> <guimenu>File</guimenu><guimenuitem>Open</guimenuitem>
de: <shortcut> <keycombo>&Ctrl;<keycap>O</keycap></keycombo> </shortcut> <guimenu>Datei</guimenu> <guimenuitem>Öffnen ...</guimenuitem>

source: <action>Pops up the &kde; file selector</action> to choose a profile data file to be loaded. If there is some data already shown in the current top-level window, this will open a new window; if you want to open additional profile data in the current window, use <menuchoice> <guimenu>File</guimenu><guimenuitem>Add</guimenuitem></menuchoice>.
de: <action>Öffnet den "Datei öffnen"-Dialog zur Auswahl der zu ladenden Profildaten-Datei.</action> Wenn im aktuellen Fenster bereits Daten angezeigt werden, wird ein neues Hauptfenster geöffnet. Zum Hinzufügen zusätzlicher Profildaten im aktuellen Fenster, verwenden Sie <menuchoice><guimenu>Datei</guimenu> <guimenuitem>Hinzufügen ...</guimenuitem> </menuchoice>.

source: The name of profile data files usually ends in <literal role="extension">.<replaceable>pid</replaceable>.<replaceable>part</replaceable>-<replaceable>threadID</replaceable></literal>, where <replaceable>part</replaceable> and <replaceable>threadID</replaceable> are optional. <replaceable>pid</replaceable> and <replaceable>part</replaceable> are used for multiple profile data files belonging to one application run. By loading a file ending only in <literal role="extension"><replaceable>pid</replaceable></literal>, any existing data files for this run with additional endings are loaded as well.
de: Der Name von Profildaten-Dateien endet normalerweise auf <literal role="extension"><replaceable>pid</replaceable>.<replaceable>part</replaceable>-<replaceable>threadID</replaceable></literal>, wobei <replaceable>part</replaceable> und <replaceable>threadID</replaceable> optional sind. <replaceable>pid</replaceable> und <replaceable>part</replaceable> werden für mehrere Profildaten-Dateien eines einzelnen Programmdurchlaufs verwendet. Wenn Sie eine Datei mit der Erweiterung <literal role="extension"><replaceable>pid</replaceable></literal> öffnen, werden vorhandene Daten-Dateien desselben Durchlaufs mit zusätzlichen Erweiterungen automatisch geladen.

source: If there exist profile data files <filename>cachegrind.out.123</filename> and <filename>cachegrind.out.123.1</filename>, by loading the first, the second will be automatically loaded too.
de: Beispiel: Existieren die Profildaten-Dateien <filename>cachegrind.out.123</filename> und <filename>cachegrind.out.123.1</filename>, wird beim Laden der ersten Datei automatisch die zweite Datei mit geladen.

source: <guimenu>File</guimenu><guimenuitem>Add</guimenuitem>
de: <guimenu>Datei</guimenu> <guimenuitem>Hinzufügen ...</guimenuitem>

source: <action>Adds a profile data file</action> to the current window. Using this, you can force multiple data files to be loaded into the same top-level window even if they are not from the same run, as given by the profile data file naming convention. For example, this can be used for side-by-side comparison.
de: <action>Fügt im aktuellen Fenster eine Profildaten-Datei hinzu.</action> Hiermit können Sie das Laden mehrerer Daten-Dateien in einem Hauptfenster erzwingen, obwohl diese nicht aus demselben Durchlauf stammen, also nicht den Namenskonventionen für Profildaten-Dateien entsprechen. Das ist vor allem zum Direktvergleich einsetzbar.

source: <shortcut> <keycombo><keycap>F5</keycap></keycombo> </shortcut> <guimenu>File</guimenu><guimenuitem>Reload</guimenuitem>
de: <shortcut> <keycombo><keycap>F5</keycap></keycombo> </shortcut> <guimenu>Datei</guimenu><guimenuitem>Neu laden</guimenuitem>

source: <action>Reload the profile data</action>. This is useful when another profile data file was generated for an already loaded application run.
de: <action>Profildaten neu laden.</action> Dies ist vor allem dann sinnvoll, wenn eine neue Profildaten-Datei für eine bereits geladene Anwendung erzeugt worden ist.

source: <shortcut> <keycombo>&Ctrl;<keycap>Q</keycap></keycombo> </shortcut> <guimenu>File</guimenu><guimenuitem>Quit</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo> </shortcut><guimenu>Datei</guimenu><guimenuitem>Beenden</guimenuitem>

source: <action>Quits</action> &kappname;
de: <action>Beendet</action> &kappname;

source: Questions and Answers
de: Fragen und Antworten

source: What is &kcachegrind; for? I have no idea.
de: Wozu ist &kcachegrind; gut?

source: &kcachegrind; is a helpful at a late stage in software development, called profiling. If you don't develop applications, you don't need &kcachegrind;.
de: &kcachegrind; ist nützlich für die späte Software-Entwicklungs-Phase Profiling. Wenn man keine Anwendungen entwickelt, dann braucht man &kcachegrind; nicht.

source: What is the difference between <guilabel>Incl.</guilabel> and <guilabel>Self</guilabel>?
de: Was ist der Unterschied zwischen <guilabel>Incl.</guilabel> und <guilabel>Self</guilabel>?

source: These are cost attributes for functions regarding some event type. As functions can call each other, it makes sense to distinguish the cost of the function itself (<quote>Self Cost</quote>) and the cost including all called functions (<quote>Inclusive Cost</quote>). <quote>Self</quote> is sometimes also referred to as <quote>Exclusive</quote> costs.
de: Dies sind Kosteneigenschaften für Funktionen hinsichtlich einiger Ereignistypen. Da sich Funktionen gegenseitig aufrufen können, ist es sinvoll, zwischen Kosten zu unterscheiden, die die Funktion selbst verursacht (<quote>Exklusivkosten</quote>) und solchen, die alle aufgerufenen Funktionen berücksichtigt (<quote>Inklusivkosten</quote>).

source: So, for example, for <function>main()</function>, you will always have an inclusive cost of almost 100%, whereas the self cost is negligible when the real work is done in another function.
de: Also werden Sie für <function>main()</function> immer Inklusivkosten von nahezu 100 % haben, wogegen die Exlusivkosten vernachlässigbar sind, wenn die eigentliche Arbeit in einer anderen Funktion erledigt wird.

source: The toolbar and menubar of my &kcachegrind; look spartan. Is this normal?
de: Die Werkzeug- und Menüleiste ist bei mir sehr spartanisch. Ist das normal?

source: &kcachegrind; has probably been installed incorrectly on your system. It is recommended to compile it with the installation prefix set to your system-wide &kde; base folder, like <userinput><command>configure <option>--prefix=<replaceable>/opt/kde4</replaceable></option></command>; <command>make install</command></userinput>. If you choose another folder, like <filename class="directory">$<envar>HOME</envar>/kde</filename>, you should set the environment variable <envar>KDEDIR</envar> to this folder before running &kcachegrind;.
de: Ihre &kcachegrind;-Installation ist wahrscheinlich fehlerhaft. Es wird empfohlen, das Programm mit dem Installationspräfix-Pfad Ihrer systemweiten &kde;-Installation zu übersetzen, wie &eg; <userinput><command>configure <option>--prefix=<replaceable>/opt/kde4</replaceable></option></command>; <command>make install</command></userinput>. Wenn Sie einen anderen Ordner, &eg; <filename class="directory">$<envar>HOME</envar>/kde</filename> wählen, müssen Sie die Umgebungsvariable <envar>KDEDIR</envar> auf diesen Ordner setzen, bevor Sie &kcachegrind; ausführen.

source: If I double-click on a function down in the <guilabel>Call Graph</guilabel> view, it shows for function <function>main()</function> the same cost as the selected function. Isn't this supposed to be constant at 100%?
de: Wenn ich in der <guilabel>Aufrufgraph</guilabel>-Ansicht auf eine Funktion klicke, werden für <function>main()</function> die gleichen Kosten angezeigt, wie für die gewählte Funktion. Sollten diese nicht immer 100 % betragen?
