Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdesdk/kompare.po
Languages: de

source: The command used to run the diff program (default <application>diff</application>).
de: Der Befehl für das diff-Programm (Voreinstellung <application>diff</application>).

source: <screeninfo>&kompare; Format Settings</screeninfo>
de: <screeninfo>Einstellung des Ausgabeformats für &kompare;</screeninfo>

source: <phrase>&kompare; Format Settings</phrase>
de: <phrase>Einstellung des Ausgabeformats für &kompare;</phrase>

source: Adjust options for the <guilabel>Output Format</guilabel> and number of <guilabel>Lines of Context</guilabel>.
de: Stellen Sie hier das <guilabel>Ausgabeformat</guilabel> und die Anzahl der <guilabel>Kontextzeilen</guilabel> ein.

source: Output Format
de: Ausgabeformat

source: Context
de: Mit Kontextzeilen

source: The context output format adds several lines of context around the lines that differ.
de: Im Kontextformat werden mehrere Zeilen vor und nach den Zeilen mit Abweichungen hinzugefügt.

source: The normal output format displays differing lines without any surrounding lines of context.
de: Im Normalformat werden keine Zeilen vor und nach den Zeilen mit Abweichungen ausgegeben.

source: Unified
de: Vereinheitlichtes Kontext-Format (unified)

source: The unified output format is a variation on the context format. It is considered better than context because the output is more compact than that of context as it omits redundant context lines.
de: Diese Ausgabeformat ist eine Abwandlung des Kontextformats, aber einer kompakteren Ausgabe, da doppelte Kontextzeilen ausgelassen werden.

source: Lines of Context
de: Kontextzeilen

source: Number of context lines
de: Anzahl

source: When performing a diff with context or unified output format use this parameter to control the number of context lines included.
de: Für eine Diff-Ausgabe im Kontext- oder Unified-Format wird die hier angegebene Zahl an Kontextzeilen verwendet.

source: Options
de: Einstellungen

source: <screeninfo>&kompare; Options Settings</screeninfo>
de: <screeninfo>Einstellungen für &kompare;</screeninfo>

source: <phrase>&kompare; Options Settings</phrase>
de: <phrase>Einstellungen für &kompare;</phrase>

source: The <guilabel>Options</guilabel> tab form allows configuration of the options supported by the diff program.
de: Auf der Karteikarte <guilabel>Optionen</guilabel> können die Einstellungen für das Programm Diff bearbeitet werden.

source: General
de: Allgemein

source: Treat new files as empty
de: Neue Dateien als leer betrachten

source: With this option enabled diff will treat a file that only exists in one of the directories as empty in the other directory. This means that the file is compared with an empty file and because of this will appear as one big insertion or deletion.
de: Ist diese Einstellung aktiviert, behandelt Diff Dateien, die nur in einem der Ordner existieren als leere Dateien in dem anderen Ordner. Das bedeutet, dass die Datei mit einer leeren Datei verglichen wird, also als ein großer hinzugefügter oder gelöschter Block erscheint.

source: Look for smaller changes
de: Nach kleineren Änderungen suchen

source: Forces diff to display changes in case, punctuation, space, &etc; when checked.
de: Ist diese Einstellung aktiv, werden Unterschiede in Groß-/Kleinschreibung, in Satz- und Leerzeichen angezeigt.

source: Optimize for large files
de: Für große Dateien optimieren

source: Switches diff to process files with high-speed when checked.
de: Ist diese Einstellung aktiv, bearbeitet das Programm „Diff“ die Dateien schneller.

source: Ignore changes in case
de: Änderungen bei Groß-/Kleinschreibung ignorieren

source: Lower and Uppercase character changes are omitted when this option is checked.
de: Mit dieser Einstellung werden Abweichungen bei der Groß- und Kleinschreibung ignoriert

source: Ignore regexp
de: Regulären Ausdruck ignorieren

source: Ignore lines matching a regular expression.
de: Ignoriert Zeilen, die auf einen regulären Ausdruck passen.

source: Whitespace
de: Leerzeichen

source: Expand tabs to spaces in output
de: In der Ausgabe Tabulatoren in Leerzeichen umwandeln

source: When checked diff outputs will converts tab characters to the number of spaces defined in the <guilabel>Preferences</guilabel> dialog <guimenu>View</guimenu> menu <guilabel>Tabs to Spaces</guilabel> option.
de: Ist diese Einstellung aktiv, werden in der Ausgabe von Diff alle Tabulatorzeichen durch die Anzahl der Leerzeichen ersetzt, die auf der Seite <guilabel>Ansicht</guilabel> in der Einstellung <guilabel>Anzahl Leerzeichen für Tabulator</guilabel> festgelegt sind.

source: Ignore added or removed empty lines
de: Neue oder entfernte Leerzeilen ignorieren

source: lines of zero length that differ between source and destination are ignored when this option is checked.
de: Ist diese Einstellung aktiv, werden abweichende leere Zeilen in Quell- und Zieltext ignoriert.

source: Ignore changes in the amount of whitespace
de: Änderung der Anzahl aufeinanderfolgernder Leerräume ignorieren

source: White space before, after and between lines may change depending on different editors. When this option is checked such changes are ignored.
de: Leerzeichen vor, nach und zwischen Zeilen können in einzelnen Editoren unterschiedlich behandelt werden. Mit dieser Einstellung werden solche Abweichungen ignoriert.

source: Ignore all whitespace
de: Leerräume beim Vergleich ignorieren

source: when checked white space differences are completely ignored.
de: Ist diese Einstellung aktiv, werden alle Abweichungen von Leerräumen ignoriert.

source: Ignore changes due to tab expansion
de: Änderungen durch Tabulator-Expansion ignorieren

source: when checked white space resulting from tab characters is ignored.
de: Ist diese Einstellung aktiv, werden alle Abweichungen durch Tabulatorzeichen ignoriert.

source: Exclude
de: Ausschließen

source: The <guilabel>Exclude</guilabel> form enables use of the filter options provided by the diff program.
de: Auf der Karteikarte <guilabel>Ausschließen</guilabel> können Filter für das Programm Diff eingestellt werden.

source: <screeninfo>&kompare; Exclude Settings</screeninfo>
de: <screeninfo>Einstellung für Ausschluss</screeninfo>

source: <phrase>&kompare; Exclude Settings</phrase>
de: <phrase>Einstellung für Ausschluss</phrase>

source: <title>File Pattern to Exclude</title>
de: <title>Dateimuster für Ausschluss</title>

source: <guilabel>File Pattern to Exclude</guilabel>
de: <guilabel>Dateimuster für Ausschluss</guilabel>

source: Exclude files based on wild card filtering
de: Hier können Sie ein Dateimuster für die Namen der Dateien eingeben, die beim Vergleich nicht berücksichtigt werden sollen.

source: <title>File with Filenames to Exclude</title>
de: <title>Datei mit Liste der auszuschließenden Dateien</title>

source: <guilabel>File with Filenames to Exclude</guilabel>
de: <guilabel>Datei mit Liste der auszuschließenden Dateien</guilabel>

source: Define the filter based on the content of an externally managed file.
de: Die Filtereinstellungen werden aus einer externen Datei mit der Namen der auszuschließenden Dateien gelesen.

source: Command Reference
de: Befehlsreferenz

source: The File Menu
de: Das Menü Datei

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>O</keycap></keycombo> </shortcut> <guimenu>File</guimenu><guimenuitem>Open Diff...</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>O</keycap></keycombo> </shortcut> <guimenu>Datei</guimenu><guimenuitem>Diff öffnen...</guimenuitem>

source: Displays the <guilabel>Open</guilabel> dialog.
de: Zeigt den Dialog <guilabel>Öffnen</guilabel> an.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>C</keycap></keycombo> </shortcut> <guimenu>File</guimenu><guimenuitem>Compare Files...</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>C</keycap></keycombo> </shortcut> <guimenu>Datei</guimenu><guimenuitem>Dateien vergleichen ...</guimenuitem>

source: Displays the <guilabel>Compare Files or Folders</guilabel> dialog.
de: Zeigt den Dialog <guilabel>Dateien oder Ordner vergleichen</guilabel>.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>B</keycap></keycombo> </shortcut> <guimenu>File</guimenu><guimenuitem>Blend URL with Diff...</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>B</keycap></keycombo> </shortcut> <guimenu>Datei</guimenu><guimenuitem>URL mit Diff mischen ...</guimenuitem>

source: Displays the <guilabel>Blend File/Folder with diff Output</guilabel> dialog.
de: Zeigt den Dialog <guilabel>Datei/Ordner mit Ausgabe von diff mischen</guilabel>.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>S</keycap></keycombo> </shortcut> <guimenu>File</guimenu><guimenuitem>Save</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>S</keycap></keycombo></shortcut> <guimenu>Datei</guimenu> <guimenuitem>Speichern</guimenuitem>

source: Writes applied differences to current source and or destination file.
de: Speichert die angewendeten Abweichungen in der aktuellen Quell- und Zieldatei.

source: <guimenu>File</guimenu><guimenuitem>Save All</guimenuitem>
de: <guimenu>Datei</guimenu> <guimenuitem>Alles speichern</guimenuitem>

source: Writes applied differences to all source and or destination files.
de: Speichert alle angewendeten Abweichungen in allen Quell- und Zieldateien.

source: <guimenu>File</guimenu><guimenuitem>Save Diff...</guimenuitem>
de: <guimenu>Datei</guimenu><guimenuitem>Diff speichern ...</guimenuitem>

source: Displays the <guilabel>Diff Options</guilabel> dialog to define diff format and options.
de: Öffnet den Dialog <guilabel>Diff-Optionen</guilabel>, in dem Sie das Diff-Format und alle Optionen einstellen können.

source: <guimenu>File</guimenu><guimenuitem>Swap Source with Destination</guimenuitem>
de: <guimenu>Datei</guimenu><guimenuitem>Quelle mit Ziel austauschen</guimenuitem>

source: Changes source and destination.
de: Vertauscht Quelle und Ziel.

source: <guimenu>File</guimenu><guimenuitem>Show Statistics</guimenuitem>
de: <guimenu>Datei</guimenu><guimenuitem>Statistik anzeigen</guimenuitem>

source: Displays the <guilabel>Display Statistics</guilabel> dialog.
de: Zeigt den Dialog <guilabel>Diff-Statistik</guilabel> an.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo> </shortcut> <guimenu>File</guimenu><guimenuitem>Quit</guimenuitem>
de: <shortcut><keycombo action="simul"> &Ctrl;<keycap>Q</keycap> </keycombo></shortcut> <guimenu>Datei</guimenu> <guimenuitem>Beenden</guimenuitem>

source: Exits &kompare;.
de: Beendet &kompare;.

source: The Difference Menu
de: Das Menü Abweichung

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>U</keycap></keycombo> </shortcut> <guimenu>Difference</guimenu><guimenuitem>Unapply All</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>U</keycap></keycombo> </shortcut> <guimenu>Abweichung</guimenu><guimenuitem>Alle Änderungen zurücknehmen</guimenuitem>

source: Unapply all differences previously applied between source and destination.
de: Alle vorher angewendeten Abweichungen zwischen Quelle und Ziel werden wieder zurückgenommen.

source: <shortcut>&Backspace;</shortcut> <guimenu>Difference</guimenu><guimenuitem>Unapply Difference</guimenuitem>
de: <shortcut>&Backspace;</shortcut> <guimenu>Abweichung</guimenu><guimenuitem>Annahme rückgängig</guimenuitem>

source: Revert a selected difference previously applied.
de: Die ausgewählte angewendete Abweichung wird wieder zurückgenommen.

source: <shortcut><keycap>Space</keycap></shortcut> <guimenu>Difference</guimenu><guimenuitem>Apply Difference</guimenuitem>
de: <shortcut><keycap>Leertaste</keycap></shortcut> <guimenu>Abweichung</guimenu><guimenuitem>Abweichung annehmen</guimenuitem>

source: Apply a selected difference.
de: Die ausgewählte Abweichung zwischen Quelle und Ziel wird angewendet.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>A</keycap></keycombo> </shortcut> <guimenu>Difference</guimenu><guimenuitem>Apply All</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>A</keycap></keycombo> </shortcut> <guimenu>Abweichung</guimenu><guimenuitem>Alle annehmen</guimenuitem>

source: Apply all differences between source and destination.
de: Alle Abweichungen zwischen Quelle und Ziel werden angewendet.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>PgUp</keycap></keycombo> </shortcut> <guimenu>Difference</guimenu><guimenuitem>Previous File</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Bild auf</keycap></keycombo> </shortcut> <guimenu>Abweichung</guimenu><guimenuitem>Vorige Datei</guimenuitem>

source: Make the previous difference, in the list of differences, the current file in the view pane.
de: Geht zurück zur vorigen Datei mit Abweichungen und zeigt sie im Hauptfenster an.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>PgDown</keycap></keycombo> </shortcut> <guimenu>Difference</guimenu><guimenuitem>Next File</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Bild ab</keycap></keycombo> </shortcut> <guimenu>Abweichung</guimenu><guimenuitem>Nächste Datei</guimenuitem>

source: Make the next difference, in the list of differences, the current file in the view pane.
de: Geht zur nächsten Datei mit Abweichungen und zeigt sie im Hauptfenster an.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Up</keycap></keycombo> </shortcut> <guimenu>Difference</guimenu><guimenuitem>Previous Difference</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Pfeil hoch</keycap></keycombo> </shortcut> <guimenu>Abweichung</guimenu><guimenuitem>Vorige Abweichung</guimenuitem>

source: Select the difference above the currently selected difference.
de: Geht zurück zur vorigen Abweichung,

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Down</keycap></keycombo> </shortcut> <guimenu>Difference</guimenu><guimenuitem>Next Difference</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Pfeil runter</keycap></keycombo> </shortcut> <guimenu>Abweichung</guimenu><guimenuitem>Nächste Abweichung</guimenuitem>

source: Select the difference below the currently selected difference.
de: Geht weiter zur nächsten Abweichung.

source: The Settings Menu
de: Das Menü Einstellungen

source: <guimenu>Settings</guimenu><guimenuitem>Show Toolbar</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>Werkzeugleiste anzeigen</guimenuitem>

source: Toggle the toolbar display ON/OFF.
de: Blendet die Werkzeugleiste ein bzw. aus.

source: <guimenu>Settings</guimenu><guimenuitem>Show Statusbar</guimenuitem>
de: <guimenu>Einstellungen</guimenu><guimenuitem>Statusleiste anzeigen</guimenuitem>

source: Toggle the status bar display ON/OFF.
de: Schaltet die Anzeige der Statusleiste ein und aus.

source: <guimenu>Settings</guimenu><guimenuitem>Show Text View</guimenuitem>
de: <guimenu>Einstellungen</guimenu><guimenuitem>Text-Ansicht</guimenuitem>

source: Display the <guilabel>Text View</guilabel> pane.
de: Zeigt das Fenster <guilabel>Text-Ansicht</guilabel> an.

source: <guimenu>Settings</guimenu><guimenuitem>Configure Shortcuts...</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>Kurzbefehle festlegen ...</guimenuitem>

source: Display the <guilabel>Configure Shortcuts</guilabel> dialog.
de: Öffnet den Dialog <guilabel>Kurzbefehle festlegen</guilabel>.

source: <guimenu>Settings</guimenu><guimenuitem>Configure Toolbars...</guimenuitem>
de: <guimenu>Einstellungen</guimenu><guimenuitem>Werkzeugleisten einrichten ...</guimenuitem>

source: Display the <guilabel>Configure Toolbar</guilabel>.
de: Öffnet den Dialog <guilabel>Werkzeugleisten einrichten</guilabel>.

source: <guimenu>Settings</guimenu><guimenuitem>Configure &kompare;...</guimenuitem>
de: <guimenu>Einstellungen</guimenu><guimenuitem>&kompare; einrichten ...</guimenuitem>

source: Display the &kompare; <guilabel>Preference</guilabel> dialog.
de: Öffnet den Dialog <guilabel>Einstellungen</guilabel> von &kompare;.

source: The Help Menu
de: Das Menü Hilfe

source: Credits and License
de: Danksagungen und Lizenz

source: Program copyright 2001-2004, &John.Firebaugh; &John.Firebaugh.mail; and Otto Bruggeman <email>otto.bruggeman@home.nl</email>
de: Programm Copyright 2001-2004, &John.Firebaugh; &John.Firebaugh.mail; und Otto Bruggeman <email>otto.bruggeman@home.nl</email>

source: Documentation Copyright &copy; 2007 Sean Wheller <email>sean@inwords.co.za</email>
de: Dokumentation Copyright &copy; 2007 Sean Wheller <email>sean@inwords.co.za</email>

source: CREDIT_FOR_TRANSLATORS
de: <para>Übersetzung Ingo Malchow <email>ingomalchow@googlemail.com</email></para>

source: How to obtain &kompare;
de: Woher Sie &kompare; erhalten

source: Compilation and Installation
de: Kompilierung und Installation
