Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdesdk/kompare.po
Languages: de

source: In this case select <menuchoice><guimenu>File</guimenu><guimenuitem>Swap Source with Destination</guimenuitem></menuchoice>. This will switch the files displayed in all &kompare; panels.
de: In diesem Fall wählen Sie <menuchoice><guimenu>Datei</guimenu><guimenuitem>Quelle mit Ziel austauschen</guimenuitem></menuchoice>. Dadurch werden die Dateien in allen Ansichten von &kompare; vertauscht.

source: Displaying Difference Statistics
de: Anzeige der Statistik der Unterschiede

source: For a quick overview of the differences, select <menuchoice><guimenu>File</guimenu><guimenuitem>Show Statistics</guimenuitem></menuchoice>. This will display the <guilabel>Diff Statistics</guilabel> dialog. The following information is provided:
de: Für eine schnelle Übersicht der Unterschiede wählen Sie <menuchoice><guimenu>Datei</guimenu><guimenuitem>Statistik anzeigen</guimenuitem></menuchoice>. Damit wird der Dialog <guilabel>Diff-Statistik</guilabel> geöffnet. Die folgenden Informationen werden darin angezeigt:

source: Old file:
de: Alte Datei:

source: The file name of what is usually the source file or file that is unmodified.
de: Der Name der Quelldatei oder der unveränderten Datei.

source: New file:
de: Neue Datei:

source: The file name of what is usually the destination file or file that is modified and to which differences will be applied.
de: Der Name der Zieldatei oder der Datei, die durch das Anwenden der Abweichungen verändert wird.

source: The diff format used to display the difference (see <xref linkend="diff-format"/>).
de: Das Diff-Format, das zur Darstellung der Unterschiede verwendet wird (siehe <xref linkend="diff-format"/>).

source: Number of hunks:
de: Anzahl Gruppen (hunks):

source: The number of hunks found in the difference.
de: Die Anzahl an Gruppen, die in den Änderungen gefunden wurden.

source: A hunk is a <quote>c<emphasis>hunk</emphasis></quote> of lines that have been marked as different between source and destination and may include context lines depending on the diff format <guilabel>Lines of Context</guilabel> value (see <xref linkend="diff-format"/>).
de: Eine Gruppe besteht aus einer Anzahl von Zeilen, die als abweichend in Quelle und Ziel markiert wurden und zusätzlich Kontextzeilen enthalten könnten, abhängig vom gewählten Diff-Format.

source: Number of differences
de: Anzahl Abweichungen

source: The actual number of differences found, not hunks. A hunk can contain one or more differences when the line change range and the context lines of any two or more changes overlap.
de: Die Anzahl der gefundenen Abweichungen, nicht der Gruppen. Eine Gruppe kann eine oder mehrere Abweichungen enthalten, wenn die Bereiche mit abweichenden Zeilen und Kontextzeilen sich überlappen.

source: Navigating the Difference View
de: Navigation in der Ansicht der Abweichungen

source: &kompare; enables rapid navigation of differences on a file level and of multiple difference files when comparing folder trees.
de: &kompare; ermöglicht eine schnelle Navigation durch die Abweichungen einzelner Dateien und auch mehrerer Dateien beim Vergleichen von Ordnern.

source: Selecting a Difference
de: Auswahl einer Abweichung

source: A difference can be selected using by:
de: Eine Abweichung kann ausgewählt werden durch:

source: clicking a line in the Source and Destination Line Changes pane (top right of the main window).
de: Anklicken einer Zeile im Fenster mit der Ansicht der Abweichungen an Quell- und Zielzeilen (oben rechts im Hauptfenster).

source: clicking the highlighted difference in the View pane.
de: Anklicken der hervorgehobenen Abweichungen im Ansichtsbereich.

source: traversing the listed differences in a comparison (see <xref linkend="traversing-differences"/>).
de: Durchgehen der aufgelisteten Abweichungen in einem Vergleich (siehe <xref linkend="traversing-differences"/>).

source: When a difference is selected it is considered to be <quote>in focus</quote> and is displayed in a brighter color that non-selected differences.
de: Wenn eine Abweichung ausgewählt ist, dann besitzt sie den <quote>Fokus</quote> und wird in einer helleren Farbe als die übrigen Abweichungen dargestellt.

source: Traversing Differences
de: Durchgehen der Abweichungen

source: When a comparison finds many differences one of the best ways to approach reviewing them is to traverse the differences in a logical order, usually from top to bottom.
de: Wenn ein Vergleich viele Abweichungen findet, ist die beste Arbeitsweise, sie in einer logischen Reihenfolge durchzugehen, normalerweise von oben nach unten.

source: By default &kompare; selects the first difference found in a comparison. By selecting <menuchoice><guimenu>Difference</guimenu><guimenuitem>Next Difference</guimenuitem></menuchoice> (<keycombo action="simul">&Ctrl;<keycap>Down</keycap></keycombo>) the difference following the current selection is brought into focus. To select the difference before the current difference select <menuchoice><guimenu>Difference</guimenu><guimenuitem>Previous Difference</guimenuitem></menuchoice> (<keycombo action="simul">&Ctrl;<keycap>Up</keycap></keycombo>).
de: Als Standard wählt &kompare; die erste gefundene Abweichung aus. Durch <menuchoice><guimenu>Abweichung</guimenu><guimenuitem>Nächste Abweichung</guimenuitem></menuchoice> (<keycombo action="simul">&Ctrl;<keycap>Pfeil runter</keycap></keycombo>) wird die darauf folgende Abweichung ausgewählt. Um zur vorigen Abweichung zu gehen, benutzen Sie <menuchoice><guimenu>Abweichung</guimenu><guimenuitem>Vorige Abweichung</guimenuitem></menuchoice> (<keycombo action="simul">&Ctrl;<keycap>Pfeil hoch</keycap></keycombo>).

source: In this way it is possible to traverse differences in an orderly manner, applying and unapply differences upon review.
de: Auf diese Weise ist es möglich, die Abweichungen während der Durchsicht nacheinander durchzugehen, anzuwenden und eventuell zurückzunehmen.

source: Switching Between Files
de: Wechseln zwischen Dateien

source: When a comparison is performed on folder level, many files may be found with differences. A complete list of the files compared with difference found is provided in the <quote>Source and Destination Folders</quote>, and <quote>Source and Destination Files</quote> panes. However, &kompare; displays differences between source and destination one comparison at time.
de: Bei einem Vergleich von Ordnern werden unter Umständen viele Dateien mit Abweichungen gefunden. Eine vollständige Liste dieser Dateien und Ordner wird dann in den Bereichen <quote>Quell- und Zielordner</quote> sowie <quote>Quell- und Zieldatei</quote> angezeigt. Im Hauptfenster von &kompare; werden jedoch immer die Abweichungen zwischen einer Quell- und Zieldatei dargestellt.

source: To switch between documents in this scenario the following options are available:
de: In diesem Fall gibt es folgende Möglichkeiten, zwischen den Dokumenten zu wechseln:

source: Select the <quote>Source and Destination Folders</quote> pane to display file differences found in the <quote>Source and Destination Files</quote> pane, then select a file.
de: Klicken Sie in den Bereich <quote>Quell- und Zielordner</quote>, um die abweichenden <quote>Quell- und Zieldateien</quote> anzuzeigen. Wählen Sie dann daraus eine Datei aus.

source: Select <menuchoice><guimenu>Difference</guimenu><guimenuitem>Previous File</guimenuitem></menuchoice> (<keycombo action="simul">&Ctrl;<keycap>PgUp</keycap></keycombo>) or <menuchoice><guimenu>Difference</guimenu><guimenuitem>Next File</guimenuitem></menuchoice> (<keycombo action="simul">&Ctrl;<keycap>PgDown</keycap></keycombo>) to display the previous or next difference file found in the <quote>Source and Destination Files</quote> pane.
de: Wählen Sie <menuchoice><guimenu>Abweichung</guimenu><guimenuitem>Vorige Datei</guimenuitem></menuchoice> (<keycombo action="simul">&Ctrl;<keycap>Bild auf</keycap></keycombo>) oder <menuchoice><guimenu>Abweichung</guimenu><guimenuitem>Nächste Datei</guimenuitem></menuchoice> (<keycombo action="simul">&Ctrl;<keycap>Bild ab</keycap></keycombo>) um die vorige oder nächste Datei mit Abweichungen im Bereich <quote>Quell- und Zieldatei</quote> anzuzeigen.

source: Merging Differences
de: Abweichungen zusammenführen

source: &kompare; makes the task of applying and unapplying differences as simple as point and click. Multiple apply and unapply operations can be performed on a difference as all operations are performed in memory and not written to the files on disk until the save operation is performed.
de: &kompare; erleichtert das Arbeit mit Abweichungen erheblich. Abweichungen können mehrfach angewendet und auch wieder zurückgenommen werden. Alle Aktionen werden nur im Arbeitsspeicher ausgeführt und erst beim Speichern in die Dateien geschrieben.

source: Applying a Difference
de: Anwenden einer Abweichung

source: To apply a difference, click the highlighted difference region, then select <menuchoice><guimenu>Difference</guimenu><guimenuitem>Apply Difference</guimenuitem></menuchoice> (<keycombo><keycap>Space</keycap></keycombo>).
de: Um eine Abweichung anzuwenden, klicken Sie auf einen Bereich mit unterschiedlichen Zeilen im Hauptfenster und wählen dann <menuchoice><guimenu>Abweichung</guimenu><guimenuitem>Abweichung annehmen</guimenuitem></menuchoice> (<keycombo><keycap>Leertaste</keycap></keycombo>).

source: Unapplying a Difference
de: Zurücknehmen einer Abweichung

source: To unapply a difference, click the highlighted difference region previously applied, then select <menuchoice><guimenu>Difference</guimenu><guimenuitem>Unapply Difference</guimenuitem></menuchoice> (<keycombo>&Backspace;</keycombo>).
de: Um ein Abweichung wieder zurückzunehmen, klicken Sie auf einen Bereichen mit Zeilen, für die vorher eine Abweichung angewandt wurde, und wählen dann <menuchoice><guimenu>Abweichung</guimenu><guimenuitem>Annahme rückgängig</guimenuitem></menuchoice> (<keycombo>&Backspace;</keycombo>).

source: Applying All Differences
de: Anwenden aller Abweichungen

source: After reviewing differences between files and finding all acceptable it is possible apply them all with a single operation by selecting <menuchoice><guimenu>Difference</guimenu><guimenuitem>Apply All</guimenuitem></menuchoice> (<keycombo action="simul">&Ctrl;<keycap>A</keycap></keycombo>).
de: Es ist auch möglich, in einem Zuge alle Abweichungen zwischen den Dateien zu übernehmen. Wählen Sie dazu im Menü <menuchoice><guimenu>Abweichung</guimenu><guimenuitem>Alle annehmen</guimenuitem></menuchoice> (<keycombo action="simul">&Ctrl;<keycap>A</keycap></keycombo>).

source: Unapplying All Differences
de: Zurücknehmen aller angewendeten Abweichungen

source: To revert all differences that have been applied previously select <menuchoice><guimenu>Difference</guimenu><guimenuitem>Unapply All</guimenuitem></menuchoice> (<keycombo action="simul">&Ctrl;<keycap>U</keycap></keycombo>).
de: Um alle vorher angewendeten Abweichungen zurückzunehmen, wählen Sie im Menü <menuchoice><guimenu>Abweichung</guimenu><guimenuitem>Alle Änderungen zurücknehmen</guimenuitem></menuchoice> (<keycombo action="simul">&Ctrl;<keycap>U</keycap></keycombo>).

source: Saving Changes
de: Änderungen speichern

source: Once differences have been applied they can be saved by selecting <menuchoice><guimenu>File</guimenu><guimenuitem>Save</guimenuitem></menuchoice> or <menuchoice><guimenu>File</guimenu><guimenuitem>Save All</guimenuitem></menuchoice>.
de: Sobald Abweichungen angewendet wurden, können die Änderungen durch Auswahl von <menuchoice><guimenu>Datei</guimenu><guimenuitem>Speichern</guimenuitem></menuchoice> oder <menuchoice><guimenu>Datei</guimenu><guimenuitem>Alles speichern</guimenuitem></menuchoice> gespeichert werden.

source: Applied differences are saved to both the source and destination file.
de: Angewandte Abweichungen werden sowohl in Quell- als auch Zieldatei gespeichert.

source: Working with Diff Files
de: Arbeiten mit Diff-Dateien

source: Diff files contain only the changes made between files, or a set of files within a folder system, and may or may not contain a number of context lines before and after line changes. The sum of a line change and its context lines is known a hunk. A diff file therefore may contain multiple hunks from one or more files. When the context lines of two or more hunks overlap, they are considered a single hunk. Diff files can be used to:
de: Diff-Dateien enthalten nur die Abweichungen zwischen zwei Dateien oder mehreren Dateien in einem Ordner und sowie eventuell einige Kontextzeilen vor und nach den geänderten Zeilen. Zusammenhängende geänderte Zeilen und die zugehörige Kontextzeilen werden als Gruppe bezeichnet. Eine Diff-Datei kann daher mehrere Gruppen aus einer oder mehreren Dateien enthalten. Wenn sich die Kontextzeilen von zwei oder mehr Gruppen überlappen, werden sie als einzelne Gruppe betrachtet. Diff-Dateien können benutzt werden, um:

source: Apply the changes contained in the hunks to an original file.
de: Änderungen in den Gruppen auf eine Originaldatei anzuwenden.

source: Apply the changes contained in the hunks to a file or set of original files within a folder system.
de: Änderungen in den Gruppen auf eine Datei oder mehrere Dateien in einem Ordner anzuwenden.

source: Modified before being applied to an original file or set of original files within a folder system.
de: Nach Bearbeitung die Änderungen auf eine Datei oder mehrere Dateien in einem Ordner anzuwenden.

source: Creating a Diff
de: Erstellen einer Diff-Datei

source: To create a diff file a comparison must be displayed in &kompare;. Assuming this is the case, then select <menuchoice><guimenu>File</guimenu><guimenuitem>Save Diff...</guimenuitem></menuchoice> This will display the <guilabel>Diff Options</guilabel> dialog (see <xref linkend="diff-settings"/> for more information on diff formats and options). After configuring these options, click the <guibutton>Save</guibutton> button and save the diff to a file with the extension <filename class="extension">.diff</filename>.
de: Um eine Diff-Datei zu erstellen, muss in &kompare; die Abweichungen von Dateien angezeigt werden. Dann wählen Sie im Menü <menuchoice><guimenu>Datei</guimenu><guimenuitem>Diff speichern...</guimenuitem></menuchoice> und öffnen damit den Dialog <guilabel>Diff-Optionen</guilabel> (siehe <xref linkend="diff-settings"/> für mehr Informationen zum Diff-Format und dessen Optionen). Nachdem alle Einstellungen ausgewählt sind, drücken Sie auf den Knopf <guibutton>Speichern</guibutton> und speichern damit den Diff in einer Datei mit der Endung <filename class="extension">.diff</filename>.

source: Displaying a Diff
de: Anzeigen einer Diff-Datei

source: It is possible to display the contents of a diff file within &kompare; by opening the diff file from <menuchoice><guimenu>File</guimenu><guimenuitem>Open Diff...</guimenuitem></menuchoice>.
de: Es ist möglich, den Inhalt einer Diff-Datei in &kompare; anzuzeigen, indem Sie die Diff-Datei mit <menuchoice><guimenu>Datei</guimenu><guimenuitem>Diff öffnen ...</guimenuitem></menuchoice> auswählen.

source: When viewing a diff file the hunks between the source and destination file are shown, remember that only the hunks are shown, no unmodified lines will be shown. In some cases a diff file is created with 0 lines of context. In this case only the changed lines will be displayed.
de: Bei der Anzeige einer Diff-Datei werden nur die Gruppen mit geänderten Zeilen sowie eventuell Kontextzeilen dargestellt, aber keine Zeilen ohne Abweichungen. Wurde eine Diff-Datei ohne Kontextzeilen erstellt, enthält sie nur abweichende Zeilen.

source: When a diff file contains hunks from multiple files &kompare; displays the hunks from each file one at a time and you can switch between files as though they were real files even though this information is only provided by the diff file contents.
de: Wenn eine Diff-Datei Gruppen aus mehreren Dateien enthält, werden jeweils nur die Gruppen aus einer Datei in &kompare; angezeigt. Sie können nun zwischen den angezeigten Dateiein wie zwischen richtigen Dateien wechseln, obwohl diese Information nur in einer einzigen Diff-Datei enthalten ist.

source: Applying Differences in a Diff File
de: Anwenden von Abweichungen in einer Diff-Datei

source: When viewing differences in a diff file it is possible to apply difference as you would when comparing source and destination files (see <xref linkend="merging-differences"/>).
de: Beim Betrachten von Abweichungen in einer Diff-Datei ist es möglich, die Abweichungen anzuwenden, genau wie beim Vergleich von Quell- und Zieldateien (siehe <xref linkend="merging-differences"/>).

source: Blending a &URL; with a Diff
de: URL mit einem Diff mischen

source: In cases where a diff file is provided it is possible to compare the hunks in the diff against a file or folder. To do this select <menuchoice><guimenu>File</guimenu><guimenuitem>Blend URL with Diff...</guimenuitem></menuchoice>. Then input the <guilabel>File/Folder</guilabel> and <guilabel>Diff Output</guilabel> paths.
de: Auch eine Diff-Datei kann benutzt werden, um die Gruppen mit den Abweichungen darin mit einer Datei oder einem Ordner zu vergleichen. Dazu wählen Sie <menuchoice><guimenu>Datei</guimenu><guimenuitem>URL mit Diff mischen ...</guimenuitem></menuchoice> und geben dann <guilabel>Datei/Ordner</guilabel> und den Pfad der <guilabel>Ausgabe von diff</guilabel> ein.

source: When viewing differences between a source file and a diff file it is possible to apply difference as you would when comparing source and destination files (see <xref linkend="merging-differences"/>).
de: Beim Betrachten von Abweichungen zwischen einer Quelldatei und einer Diff-Datei ist es möglich, die Abweichungen anzuwenden, genau wie beim Vergleich von Quell- und Zieldateien (siehe <xref linkend="merging-differences"/>).

source: Configuring Preferences
de: Einstellungen ändern

source: &kompare; enables users to set appearance preferences for difference formatting in the main interface and set behavioural properties of the diff program. The <guilabel>Preferences</guilabel> dialog can be accessed by selecting <menuchoice><guimenu>Settings</guimenu><guisubmenu>Configure &kompare;...</guisubmenu></menuchoice>.
de: In &kompare; kann die Anzeige von Abweichungen im Hauptfenster und die Arbeitsweise des Programms diff eingestellt werden. Öffnen Sie dazu mit <menuchoice><guimenu>Einstellungen</guimenu><guisubmenu>&kompare; einrichten ...</guisubmenu></menuchoice> den Dialog <guilabel>Einstellungen</guilabel>.

source: To configure preferences for appearance select the <guilabel>View</guilabel> menu item (see <xref linkend="view-settings"/>).
de: Die Einstellungen für das Erscheinungsbild finden Sie auf der Seite <guilabel>Ansicht</guilabel>, siehe auch <xref linkend="view-settings"/>)

source: To configure preferences for diff program properties select the <guilabel>Diff</guilabel> menu item (see <xref linkend="diff-settings"/>).
de: Die Einstellungen für das Programm „Diff“ finden Sie auf der Seite <guilabel>Diff</guilabel>, siehe auch <xref linkend="diff-settings"/>)

source: View Settings
de: Ansichtseinstellungen

source: The <guimenu>View</guimenu> page in the <guilabel>Preferences</guilabel> dialog displays the <guilabel>Appearance</guilabel> and <guilabel>Fonts</guilabel> tabbed forms.
de: Die Seite <guilabel>Ansicht</guilabel> des Einstellungsdialogs besteht aus den Karteikarten <guilabel>Erscheinungsbild</guilabel> und <guilabel>Schriftarten</guilabel>.

source: Appearance
de: Erscheinungsbild

source: The <guilabel>Appearance</guilabel> form provides controls to manage the <guilabel>Colors</guilabel> used to denote difference in the main interface, behaviour of the <guilabel>Mouse Wheel</guilabel> when jogging up and down and how <guilabel>Tabs to Spaces</guilabel> conversion is managed.
de: Hier finden Sie Einstellungen für die <guilabel>Farben</guilabel>, die zur Anzeige der Abweichungen im Hauptfenster verwendet werden, für die Schrittweite der Navigation mit dem <guilabel>Mausrad</guilabel> und Sie können die <guilabel>Anzahl Leerzeichen für Tabulator</guilabel> einstellen.

source: <screeninfo>&kompare; Appearance Settings</screeninfo>
de: <screeninfo>Einstellung des Erscheinungsbildes für &kompare;</screeninfo>

source: <phrase>&kompare; Appearance Settings</phrase>
de: <phrase>Einstellung des Erscheinungsbildes für &kompare;</phrase>

source: Color Group
de: Farben

source: To adjust color preferences used when displaying differences, click the color button to display the <guilabel>Select Color</guilabel> dialog for the following states:
de: Um die Farben zur Anzeige von Abweichungen zu ändern, klicken Sie auf das Farbfeld rechts von den Einträgen. Damit wird der Dialog <guilabel>Farbe auswählen</guilabel> für zur Einstellung der Farben für folgende Zustände geöffnet:

source: Removed color
de: Farbe für Gelöschtes:

source: Lines that have been removed, do not exist, between source and destination.
de: Farbe der gelöschten oder nicht vorhandenen Zeilen beim Vergleich zwischen Quell- und Zieltext.

source: Changed color
de: Farbe für Geändertes:

source: Lines that have been changed, modified, between source and destination.
de: Farbe der geänderten Zeilen beim Vergleich zwischen Quell- und Zieltext.

source: Added color
de: Farbe für Neues:

source: Lines that have been added between source and destination.
de: Farbe der hinzugefügten Zeilen beim Vergleich zwischen Quell- und Zieltext.

source: Applied color
de: Farbe für Übernommenes:

source: Any of the above states where the difference has been applied between source and destination.
de: Farbe der Zeilen, deren Abweichung zwischen Quelle- und Zieldatei bereits übernommen wurde.

source: Mouse Wheel
de: Mausrad

source: Number of lines
de: Anzahl Zeilen:

source: The number of lines to jog the differences when turning the mouse wheel forward or backward.
de: Schrittweite der Navigation bei der Drehung des Mausrades vorwärts oder rückwärts.

source: Tabs to Spaces
de: Tabulatoren in Leerzeichen umwandeln

source: Number of spaces to convert a tab character to
de: Anzahl Leerzeichen für Tabulator:

source: Convert each tab character to n space characters.
de: Dieser Wert gibt die Anzahl der Leerzeichen an, durch die ein Tabulatorzeichen ersetzt wird.

source: Fonts
de: Schriftarten

source: <screeninfo>&kompare; Fonts Settings</screeninfo>
de: <screeninfo>Einstellung der Schriftarten für &kompare;</screeninfo>

source: <phrase>&kompare; Fonts Settings</phrase>
de: <phrase>Einstellung der Schriftarten für &kompare;</phrase>

source: Select the font family and size to display when displaying differences.
de: Auswahl der Schriftart und -größe für die Anzeige der Abweichungen.

source: Diff Settings
de: Diff-Optionen

source: The <guimenu>Diff</guimenu> page in the <guilabel>Preferences</guilabel> dialog displays the <guilabel>Diff</guilabel>, <guilabel>Format</guilabel>, <guilabel>Options</guilabel> and <guilabel>Exclude</guilabel> tabbed forms. These forms can be used to configure the behavioural properties of the Diff program.
de: Auf der Seite <guimenu>Diff</guimenu> im Dialog <guilabel>Einstellungen</guilabel> gibt es die Karteikarten <guilabel>Diff</guilabel>, <guilabel>Format</guilabel>, <guilabel>Einstellungen</guilabel> und <guilabel>Ausschließen</guilabel>. Mit den Optionen auf diesen Karteikarten kann die Arbeitsweise des Programms Diff gesteuert werden.

source: <screeninfo>&kompare; Diff Settings</screeninfo>
de: <screeninfo>Einstellung der Diff-Optionen für &kompare;</screeninfo>

source: <phrase>&kompare; Diff Settings</phrase>
de: <phrase>Einstellung der Diff-Optionen für &kompare;</phrase>
