Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdesdk/kompare.po
Languages: de

source: The &kompare; Handbook
de: Das Handbuch zu &kompare;

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Ingo</firstname><surname>Malchow</surname><affiliation><address><email>ingomalchow@googlemail.com</email></address></affiliation><contrib>Übersetzung</contrib></othercredit>

source: &kompare; is a &GUI; front-end program that enables differences between source files to be viewed and merged. &kompare; can be used to compare differences on files or the contents of folders. &kompare; supports a variety of diff formats and provide many options to customize the information level displayed.
de: &kompare; ist ein Programm mit grafischer Bedienungsoberfläche, um Abweichungen zwischen Textdateien zu betrachten und sie zusammenzuführen. &kompare; kann Abweichungen zwischen einzelnen Dateien oder zwischen Ordnern und deren Inhalt anzeigen. &kompare; unterstützt eine Vielzahl an Diff-Formaten und bietet viele Einstellungsmöglichkeiten für die Anzeige der Abweichungen.

source: This document describes &kompare; version &version;.
de: Dieses Dokument beschreibt &kompare; Version &version;.

source: Merge
de: Zusammenführen

source: Hunk
de: Gruppe

source: Introduction
de: Einleitung

source: When two or more people are working on a file and passing it back and forth between one another, it becomes difficult to see what changes have been made to a new version or copy of the file. Opening the new copy and the original, side-by-side in the application used to create it is one solution but, laborious, time consuming, and prone to error. This is where a program to show differences, diffs for short, is useful.
de: Wenn mehrere Personen an einer Datei arbeiten und immer wieder untereinander austauschen, dann ist es schwierig zu erkennen, welche Änderungen an einer neuen Version der Datei oder der Kopie gemacht wurden. Die neue Kopie und das Original nebeneinander im Editorprogramm zu vergleichen, ist eine Lösung, aber arbeitsaufwendig, zeitaufwendig und fehleranfällig. Dafür ist ein Programm zur Anzeige von Abweichungen - sogenannter Diffs - besser geeignet.

source: As would be expected, an appropriate name for such a program would be &quot;diff&quot;. As it happens, the program diff is installed on most &Linux;-based systems and is used for exactly this purpose. Developers often use diff, as a command line tool, to show differences between versions of a source code file. However, the use of diff is not limited to showing differences in code source files, it can be used on many text-based file types.
de: Natürlich ist der naheliegende Name für ein solches Programm &quot;diff&quot;. Zufällig ist das Programm diff auch auf den meisten &Linux;-basierten Systemen installiert und wird genau für diesen Zweck verwendet. Entwickler verwenden diff als Werkzeug in einer Konsole, um Unterschiede zwischen verschiedenen Versionen einer Quelltextdatei aufzuzeigen. Dennoch ist <command>diff</command> nicht nur für die Anzeige von Unterschieden zwischen Quelltextdateien geeignet, es kann für viele andere Textdateien verwendet werden.

source: Using diff from the command line can be confusing, learning the diff command syntax and deciphering the output can bewilder most people. This is where &kompare; comes into play. Providing a graphical front-end to the diff program, the interface displays source and destination files side-by-side with all differences automatically highlighted. From this starting point, changes in one file can be sequentially applied to the other file on a selective and controlled basis. Not all changes need to be applied and if you do apply a change it can always be &apos;unapplied&apos;. When all required changes have been applied they can be saved and will display as normal in the original application used to create the file.
de: Arbeiten mit dem Programm <command>diff</command> auf der Befehlszeile erfordert die Kenntnis aller Optionen für diesen Befehl. Die Ausgabe des Programms ist für Anwender schwierig zu lesen und zu verstehen. Diese Aufgabe wird durch das Programm &kompare; erleichtert. Es bietet eine grafische Oberfläche für das Programm <command>diff</command> und zeigt die Quell- und Zieldatei nebeneinander an, die Abweichungen werden dabei automatisch hervorgehoben. Nun können die Änderungen aus einer Datei nacheinander an der anderen Datei angewendet werden. Nicht alle Änderungen müssen angewendet werden, wenn Sie eine Änderung anwenden, kann diese jederzeit &apos; zurückgesetzt&apos; werden. Wenn alle benötigten Änderungen angewendet wurden, kann das Ergebnis gespeichert werden. Im Editor mit dem die Datei erstellt wurde, wird sie wie jede beliebige Datei angezeigt.

source: In addition to displaying differences between a source and destination file, &kompare; can be used to create and view a special file called a &apos;diff&apos;. This file captures the differences between the two sources into a single file that can be used to view and apply changes to any other copy of the file. For example, if two people are editing a document. The first person wants to make changes and send just the changes made to the second person. Normally, the first person would send a complete copy of the modified document to the second person, who would then have to compare the modified document side-by-side with unmodified version. The process for this is much like what we have described in the previous paragraphs. With &kompare; the first person would first make a local copy of the file to be modified, then make changes and compare the original and modified copy. Now using &kompare; a diff file can be created that captures only the changes made. This can be sent to the second person in place of a whole file containing the changes.
de: Zusätzlich zu der Anzeige von Abweichungen zwischen Quell- und Zieldateien kann &kompare; dazu benutzt werden, eine spezielle Datei zu erstellen, die &apos;diff&apos; genannt wird. Diese Datei enthält alle Abweichungen zwischen zwei Quelldateien und kann benutzt werden, um Änderungen anzusehen und an einer anderen Kopie der Datei anzuwenden. Wenn zum Beispiel zwei Personen am gleichen Dokument arbeiten und die erste Person möchte Änderungen durchführen und nur diese Änderungen an die zweite Person senden. Normalerweise würde die erste Person die komplette veränderte Datei an die zweite Person senden, welche dann beide Dateien nebeneinander vergleichen müsste. Dieser Prozess entspricht der in den vorherigen Abschnitten erklärten Arbeitsweise. Mit &kompare; würde die erste Person zunächst eine lokale Kopie der zu verändernden Datei anlegen, dann Änderungen durchführen und dann das Original mit der veränderten Datei vergleichen. Mit &kompare; kann eine diff-Datei angelegt werden, die nur die Änderungen enthält. Diese kann dann der zweiten Person anstelle der kompletten Datei geschickt werden.

source: Using &kompare; the second person can view the diff file, compare it to the local copy of the document and apply the changes made by the first person. So the process can go on for many versions of the document, each person making changes, creating diffs, distributing them and applying them. This process is commonly called &quot;patching&quot;, a term taken from the program named &quot;patch&quot; which is another command line tool specifically designed for the purpose of applying diff files.
de: Mithilfe von &kompare; kann nun die zweite Person die diff-Datei ansehen, mit der lokalen Kopie des Dokuments vergleichen und die Änderungen der ersten Person anwenden. Und so kann der Prozess für viele Versionen des Dokuments weitergehen, jede Person macht Änderungen, verteilt sie und wendet sie an. Dieser Prozess ist weitläufig &quot;Patchen&quot; genannt, ein Begriff benannt nach dem Programm &quot;patch&quot;, ein weiteres Befehlszeilenprogramm zur Verarbeitung von diff-Dateien.

source: It sometimes happens that people edit a file at the same time. In this situation it is likely that people will make changes in the document at exactly the same line. This creates a problem because, without applied caution, people could be overwriting each others work as they apply the diff files they receive. Fortunately the developers of the diff and patch programs took this into consideration and so these tools will not allow such changes to be applied without manual intervention. When this state is reached, it is known as a &quot;conflict&quot;. &kompare; will display conflicts so that you can manually resolve them, deciding which changes should be applied to which file.
de: Manchmal wird eine Datei durch mehrere Personen gleichzeitig bearbeitet. Dann kann es auch vorkommen, dass Änderungen in der gleichen Zeile in der Datei erfolgt sind. Würden jetzt die Diff-Dateien angewendet, könnten die Änderungen gegenseitig überschrieben werden. Glücklicherweise haben die Entwickler diese Situation bei der Entwicklung dieser Programme bedacht, es ist in diesem Fall nicht möglich, diese Änderungen ohne manuelle Bearbeitung durchzuführen. Dieses Problem wird als &quot;Konflikt&quot; bezeichnet. In &kompare; werden diese Konflikte angezeigt. Dann können Sie sie manuell lösen können, indem Sie entscheiden, welche Änderungen an welcher Datei durchgeführt werden sollen.

source: &kompare; is also a great program for comparison of file changes on a folder level. When used to compare folders &kompare; recursively examines subfolders and their file contents for differences. In this use case, each file where differences are found are automatically opened and listed by &kompare; where easy navigation between the various files is possible.
de: &kompare; kann zusätzlich auch Ordner vergleichen. In diesem Fall werden rekursiv alle Unterordner und deren Dateien auf Abweichungen untersucht. Dann werden alle Dateien mit Abweichungen automatisch geöffnet und von &kompare; aufgelistet, damit wird das Navigieren in den verschiedenen Dateien erleichtert.

source: Using &kompare;
de: Arbeiten mit &kompare;

source: Getting Started
de: Erste Schritte

source: This section provides instructions for starting &kompare; and provides a quick tour to the &kompare; main interface.
de: Dieser Abschnitt beschreibt, wie &kompare; gestartet wird, und bietet einen kurzen Überblick über die Bedienungsoberfläche von &kompare;.

source: Starting &kompare;
de: Starten von &kompare;

source: A shortcut for starting &kompare; can be found in the K menu in the Development group <menuchoice><guimenu>Development</guimenu><guimenuitem>Kompare</guimenuitem></menuchoice>.
de: Zum Starten von &kompare; wählen Sie im Programmstarter aus der Gruppe <menuchoice><guimenu>Entwicklung</guimenu><guimenuitem>Kompare</guimenuitem></menuchoice>.

source: When &kompare; starts the first thing it does is display a dialog from which to select the files you wish to compare. Special settings for the properties of the diff and the appearance thereof can also be selected. In the file form select a source and destination source to compare. This can be any two files, folders or a &URL; and a file. Once the source and destination are selected click the <guibutton>Compare</guibutton> button.
de: Beim Start zeigt &kompare; einen Dialog zur Auswahl der Dateien für den Vergleich an. In diesem Dialog können auch Einstellungen für das Programm „Diff“ und für das Erscheinungsbild ausgewählt werden. Geben Sie zuerst Quelle und Ziel an, die miteinander verglichen werden sollen. Es können Dateien, Ordner oder eine &URL; und eine Datei angegeben werden. Zum Starten drücken Sie dann den Knopf <guibutton>Vergleichen</guibutton>.

source: Once &kompare; has discovered the differences it will display the main interface. When comparing two files or a URL and a file the process takes just a few seconds. However, when comparing folders with many subfolders and files, this process can take awhile.
de: Sobald &kompare; die Abweichungen ermittelt hat, wird das Hauptfenster angezeigt. Wenn zwei Dateien oder eine URL und eine Datei verglichen werden, dauert dieser Prozess nur wenige Sekunden. Aber wenn Sie Ordner mit vielen Unterordnern und Dateien vergleichen, kann der Prozess durchaus länger dauern.

source: For explanation of the options available from diff and appearance forms see <xref linkend="configure-preferences"/>.
de: Informationen über die möglichen Einstellungen für „Diff“ und „Erscheinungsbild“ finden im <xref linkend="configure-preferences"/>.

source: The Main Interface
de: Das Hauptfenster

source: This section provides a quick tour of the main interface which is comprised of the following areas:
de: Dieser Abschnitt bietet einen kurze Übersicht über die Bedienungsoberfläche, die folgende Bereiche enthält:

source: <para>Menus</para>
de: <para>Menüs</para>

source: <para>Toolbar</para>
de: <para>Werkzeugleiste</para>

source: <para>Source and Destination Folders</para>
de: <para>Quell- und Zielordner</para>

source: <para>Source and Destination Files</para>
de: <para>Quell- und Zieldateien</para>

source: <para>Source and Destination Line Changes</para>
de: <para>Abweichende Zeilen in der Quell- und Zieldatei</para>

source: Source and Destination Text View
de: Anzeige des Textes in Quelle und Ziel

source: <para>Statusbar</para>
de: <para>Statusleiste</para>

source: <title>Menus</title>
de: <title>Menüs</title>

source: &kompare; provides a menu driven interface. Explanation to the menu items and their options is provided in <xref linkend="command-reference"/>.
de: &kompare; bietet eine menügesteuerte Oberfläche. Erklärungen zu dem Menü und den Menüeinträgen finden Sie unter im <xref linkend="command-reference"/>.

source: <title>Toolbar</title>
de: <title>Werkzeugleiste</title>

source: The &kompare; toolbar provides shortcuts to the most frequently used diff and merge operations. The toolbar orientation, text positioning, icon size properties and which shortcut icons are displayed can be customized from the toolbar context menu accessed when right-clicking the toolbar with the mouse. The toolbar context menu also enables the toolbar to be hidden. If the toolbar is hidden and you wish to unhide it, select <menuchoice><guimenu>Settings</guimenu><guimenuitem>Show Toolbar</guimenuitem></menuchoice>.
de: In der Werkzeugleiste von &kompare; finden Sie die am häufigsten gebrauchten Aktionen für Abweichungen und das Zusammenführen. Die Ausrichtung, Textposition, Symbolgröße und die angezeigten Aktionen können in einem Kontextmenü eingestellt werden, das mit dem Klicken der rechten Maustaste auf die Werkzeugleiste geöffnet wird. Im Kontextmenu lässt sich die Werkzeugleiste auch ausblenden. Um sie wieder anzuzeigen, wählen Sie im Menü <menuchoice><guimenu>Einstellungen</guimenu><guimenuitem>Werkzeugleiste anzeigen</guimenuitem></menuchoice>.

source: <title>Source and Destination Folders</title>
de: <title>Quell- und Zielordner</title>

source: The source folder and destination folder panes display the folders in which compared files reside. When many subfolders are included in the comparison, then selecting a folder will display the first document in that folder where a difference was found between the source and destination.
de: Diese Ansicht zeigt die Ordner mit den darin enthaltenen Dateien. Wenn viele Unterordner vorhanden sind, dann wird bei der Auswahl eines Ordners das erste Dokument angezeigt, das eine Abweichung zwischen Quelle und Ziel aufweist.

source: <title>Source and Destination Files</title>
de: <title>Quell- und Zieldateien</title>

source: The source and destination file pane displays files where a difference was found for the currently selected source or destination folder. When a folder has multiple documents containing differences, all documents with a difference are listed. The selected document is displayed.
de: Die Ansicht der Quell- und Zieldateien zeigt alle Dateien, in denen Abweichungen zwischen dem aktuell gewählten Quell- und Zielordner gefunden wurden. Wenn ein Ordner mehrere Dokumente mit Abweichungen enthält, werden alle diese Dokumente angezeigt. Der Inhalt des ausgewählte Dokuments wird in der Quell- und Zielansicht dargestellt.

source: <title>Source and Destination Line Changes</title>
de: <title>Abweichende Zeilen in der Quell- und Zieldatei</title>

source: The source and destination line changes pane summarizes the differences found between the current source and destination documents. Selecting a record within the pane highlights and selects the difference. This is a useful way to navigate and inspect long documents with many differences.
de: In dieser Ansicht wird eine Übersicht der gefundenen Abweichungen zwischen den Quell und Zieldateien angezeigt. Wird hier ein Eintrag ausgewählt, dann wird die Abweichung im Hauptfenster hervorgehoben und ausgewählt. Auf diese Weise kann auch ein langes Dokument mit vielen Abweichungen schnell durchsucht werden.

source: Source and Destination View
de: Quell- und Zielansicht

source: The source and destination view is the main workspace of &kompare;. The contents and highlighted differences of the currently selected source and destination file are displayed here with line numbers.
de: Die Quell- und Zielansicht ist der Hauptarbeitsbereich von &kompare;. Hier werden der Inhalt und die hervorgehobenen Abweichungen der aktuell ausgewählten Quell- und Zieldatei mit den Zeilennummern angezeigt.

source: Text View
de: Text-Ansicht

source: The <guilabel>Text View</guilabel> is not displayed by default. It can be opened by selecting <menuchoice><guimenu>Settings</guimenu><guimenuitem>Show Text View</guimenuitem></menuchoice>.
de: Die <guilabel>Text-Ansicht</guilabel> wird in der Voreinstellung nicht angezeigt. Sie kann mit <menuchoice><guimenu>Einstellungen</guimenu><guimenuitem>Text-Ansicht</guimenuitem></menuchoice> geöffnet werden.

source: <title>Statusbar</title>
de: <title>Statusleiste</title>

source: The status bar provides a summary of the current source and destination file or folder under comparison. The status bar also reports the number of changes found in the current document and counts the differences that have been applied. Furthermore, the status bar shows the overall number of documents containing differences and the current document number selected from this set. For example, a comparison run over two folders may return 1890 files with differences. The currently selected document is number 18 of 1890.
de: In der Statusleiste wird eine Übersicht über die aktuelle Quell- und Zieldatei oder Ordner angezeigt, dazu auch die Anzahl der Änderungen in dem aktuellen Dokument und die Anzahl bereits angewendeten Abweichungen. Zusätzlich wird noch die Anzahl der Dokumente mit Abweichungen und die Nummer des aktuellen Dokuments angegeben. Zum Beispiel könnte ein Vergleich über zwei Ordner zu einer Anzahl von 1890 Dateien mit Abweichungen führen. Das aktuell ausgewählte Dokument ist dann vielleicht Nummer 18 von 1890 Dateien.

source: Viewing Differences
de: Anzeige von Unterschieden

source: Managing Screen Real-Estate
de: Bildschirmplatz ausnutzen

source: &kompare; displays the source and destination file under using equal percentage of the main interface view work area. This view area provides some features that help optimize use of screen real-estate while viewing differences, including:
de: &kompare; zeigt die Quell- und Zieldatei in zwei gleichgroßen Fenstern im Hauptfensters an. Dieser Ansichtsbereich bietet einige Funktionen, den verfügbaren Bildschirmplatz optimal auszunutzen, darunter:

source: Dual Scrollbars
de: Zweifache Bildlaufleisten

source: The most obvious feature is that scrollbars are provided both on the right and bottom edges of the view area. Using the scrollbars it is possible to move rapidly through the comparison.
de: Der Ansichtsbereich hat sowohl am rechten wie auch am unteren Rand Bildlaufleisten. Damit ist es möglich, die angezeigten Abweichungen in den Dateien schnell durchzublättern.

source: Share Grip Handle
de: Dokumententrennbalken

source: The vertical space between the source and destination view not only makes it possible to clearly see the start and end of lines in each of the panes, but is also a grip handle that allows adjustment of percentage occupied between the source and destinate views that comprise the view pane. To change pane size for one of the views, hover the mouse pointer over the grip handle then hold down the mouse button and drag left or right. Naturally, increasing the area of one pane will decrease the area available to the opposite pane within the view panel area.
de: Der vertikale Streifen zwischen der Quell- und Zieldatei ermöglicht nicht nur eine einfache Ansicht von Anfang und Ende jeder Zeile in den beiden Bereichen, er dient auch als Griff, um den Anteil der Ansicht von Quelle und Ziel zu verändern. Dazu führen Sie den Mauszeiger über den Trennbalken, halten den linken Mausknopf gedrückt und ziehen Sie ihn nach links oder rechts. Das Vergrößern des einen Bereiches führt natürlich zu einer Verkleinerung des anderen Bereichs innerhalb des Ansichtsfensters.

source: A second horizontal handle is available between the navigation panel and the source and destination view.
de: Ein zweiter horizontaler verschieblicher Trennbalken befindet sich zwischen dem Navigationsbereich und der Quell- und Zielansicht

source: Docking
de: Andocken

source: The navigation panel can be undocked from the main interface by clicking the <inlinemediaobject> <imageobject><imagedata fileref="undock.png" format="PNG"/></imageobject></inlinemediaobject> icon located top right of the panel. This opens it in a window of its own, allowing you to move it across the screen. You can even hide the navigation panel by clicking the <inlinemediaobject><imageobject><imagedata fileref="dock.png" format="PNG"/></imageobject></inlinemediaobject> icon. To display a hidden navigation bar again, click with the &RMB; into the menubar and select <guilabel>Navigation</guilabel> from the context menu.
de: Der Navigationsbereich kann durch Klicken auf das Symbol <inlinemediaobject> <imageobject><imagedata fileref="undock.png" format="PNG"/></imageobject></inlinemediaobject> rechts oben aus dem Hauptfenster gelöst und als getrenntes Fenster angezeigt werden. Dieses Fenster kann auf dem Bildschirm beliebig verschoben werden. Durch Klicken auf das Symbol <inlinemediaobject><imageobject><imagedata fileref="dock.png" format="PNG"/></imageobject></inlinemediaobject> kann der Navigationsbereich ausgeblendet werden. Um ihn wieder anzuzeigen, klicken Sie mit der &RMBn; in der Menüleiste und wählen <guilabel>Navigation</guilabel> aus dem Kontextmenü.

source: Statusbar Toggle
de: Anzeige der Statusleiste

source: The status bar of the view panel can be toggled on and off by selecting <menuchoice><guimenu>Settings</guimenu><guimenuitem>Show Statusbar</guimenuitem></menuchoice>.
de: Die Anzeige der Statusleiste können Sie mit <menuchoice><guimenu>Einstellungen</guimenu><guimenuitem>Statusleiste anzeigen</guimenuitem></menuchoice> ein- und ausschalten.

source: Switching Source and Destination Views
de: Wechseln zwischen Quell- und Zielansichten

source: Sometimes it can be useful to consider what the file to which differences where to be applied as the source. For example, when comparing two modified versions of a file and discovering that the one file has many more modifications that the other. The file with more changed would be better as the source, since then fewer differences would need to be applied.
de: Manchmal sollte überlegt werden, welche Datei mit den Abweichungen als Quelle angenommen wird. Wenn zum Beispiel beim Vergleich von zwei veränderte Versionen einer Datei festgestellt wird, dass die eine Datei viel mehr Änderungen als die andere enthält, ist die Datei mit mehr Änderungen dann besser als Quelldatei geeignet, da dann weniger Änderungen angewendet werden müssen.
