Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdesdk/lokalize.po
Languages: de

source: The &lokalize; Handbook
de: Das Handbuch zu &lokalize;

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Ingo</firstname><surname>Malchow</surname><affiliation><address><email>ingomalchow@googlemail.com</email></address></affiliation><contrib>Übersetzung</contrib></othercredit><othercredit role="translator"><firstname>Justus</firstname><surname>Seifert</surname><affiliation><address><email>justus.seifert@googlemail.com</email></address></affiliation><contrib>Übersetzung</contrib></othercredit><othercredit role="translator"><firstname>Johannes</firstname><surname>Obermayr</surname><affiliation><address><email>johannesobermayr@gmx.de</email></address></affiliation><contrib>Überarbeitung der Übersetzung</contrib></othercredit>

source: &lokalize; is a computer-aided translation system that focuses on productivity and quality assurance. It has components usually included in CAT tools like translation memory, glossary, and also a unique translation merging (synchronization) capability. It is targeted for software translation and also integrates external conversion tools for freelance office document translation.
de: &lokalize; ist ein rechnergestütztes Übersetzungssystem, das auf Produktivität und Qualitätssicherung ausgelegt ist. Es besteht aus den üblichen Komponenten für solche Systeme: Übersetzungsdatenbank, Glossar und auch eine einzigartige Möglichkeit zum Zusammenführen der Übersetzung mit dem Quelldokument (Synchronisation). Es ist für die Übersetzung von Software gedacht und bindet externe Umwandlungswerkzeuge für die freie Übersetzung von Bürodokumenten ein.

source: localization
de: Lokalisierung

source: internationalization
de: Internationalisierung

source: translation
de: Übersetzung

source: globalization
de: Globalisierung

source: Introduction
de: Einführung

source: Usually program messages and documentation are written in English. Using a framework made of a set of tools and libraries, it is possible to have your favorite applications speak your native non-English language. This process of adapting an application to a specific language is known as <emphasis>localization</emphasis>. The localization process includes translating the program's interfaces and documentation to the various languages users need and, in some countries or regions, making the inputs and outputs conform to particular conventions. &lokalize; is a tool which will assist you in the localization process to make an application's interface speaks many languages.
de: Normalerweise werden die Texte der grafischen Oberfläche und die Dokumentation von Programmen auf Englisch geschrieben. Durch Verwendung von Dienstprogrammen und Bibliotheken ist es möglich, dass diese Programmtexte und Dokumentationen in der Muttersprache des Benutzers angezeigt werden. Der Prozess der Anpassung eines Programms an eine bestimmte Sprache wird <emphasis>Lokalisierung</emphasis> genannt. Lokalisierung umfasst die Übersetzung der Programmtexte und Dokumentation in verschieden Sprachen und für manche Länder und Regionen die Anpassung von Ein- und Ausgaben an die lokalen Besonderheiten. &lokalize; ist ein Werkzeug, das Sie bei der Lokalisierung der Texte in verschiedenen Sprachen unterstützt.

source: Every internationalization-aware program makes available for translation one or more message-catalog files. The extension of these files is <filename class="extension">.pot</filename>. <acronym>POT</acronym> is an acronym for <quote>Portable Object Template</quote>. &lokalize; is an advanced and easy to use PO file (&GNU; gettext message catalogs) editor. It is a computer-aided translation system for translators, written from scratch using the &kde; Platform 4 framework. Aside from basic editing of PO files with nifty auxiliary details, it integrates support for glossary, translation memory, diff-modes for QA, project managing, &etc; It has many features like full navigation capabilities, extensive editing functionality, search functions, syntax checking and statistics functions.
de: Jedes für die Internationalisierung vorbereitete Programm stellt ein oder mehrere Nachrichtenkataloge bereit. Diese Dateien haben die Erweiterung <filename> class="extension">.pot</filename>. <acronym>POT</acronym> ist ein Akronym für <quote>Portable Object Template</quote>. &lokalize; ist ein hoch entwickelter und einfach zu bedienender Editor für PO-Dateien (&GNU;-Gettext-Nachrichtenkataloge). Es ist ein computer-unterstütztes Übersetzungssystem, von Grund auf neu auf der Basis der &kde;-4-Plattform entwickelt. Neben der grundlegenden Bearbeitung von PO-Dateien mit raffinierten Hilfen unterstützt es ein Glossar, eine Übersetzungsdatenbank, Diff-Modi zu Qualitätskontrolle, Projektverwaltung &etc; Es enthält Funktionen wie Navigation, erweiterte Bearbeitungsmöglichkeiten, Suchfunktionen, Syntaxüberprüfung und Statistiken.

source: Portable Object (.po) files: Each translator takes a copy of one of these POT templates and begins to fill in the blanks: each message is translated into the language desired. The file containing the translated text is referred to as a PO (Portable Object) file.
de: Portable-Object-Dateien (.po): Jeder Übersetzer nimmt eine Kopie dieser POT-Vorlagen und beginnt damit, die fehlenden Übersetzungen einzutragen. Jede Nachricht wird in die gewünschte Sprache übersetzt. Die Datei mit den übersetzten Texten wird als PO-Datei (Portable Object) bezeichnet.

source: Main Window
de: Hauptfenster

source: By default, the main window contains six parts. The upper-right box is read-only and contains the current msgid (source text) field from the opened PO-file. The edit box just below this contains the msgstr (target text) field related to the msgid shown and here you can input or edit the translated text.
de: In der Voreinstellung besteht das Hauptfenster aus sechs Bereichen. Oben rechts wird der Quelltext (msgid) der geöffneten PO-Datei nur lesbar angezeigt. Darunter befindet sich der Editorbereich mit dem Zieltext (msgstr), der zur angezeigten msgid gehört. Hier kann die Übersetzung eingegeben und bearbeitet werden.

source: The main default &lokalize; window
de: Das Hauptfenster von &lokalize; in der Voreinstellung

source: This shows the default window when a file is opened.
de: Standardfenster, wenn eine Datei geöffnet wurde.

source: The top-left part of the main window shows the Translation Units. Below this, there is Unit Metadata section and it contains comments relevant to the currently displayed source text. In the lower-left, there is a Translation Memory section which shows the suggested translations from the translation memory database for the current source text entry. On the lower-right corner of the window, the glossary section is shown.
de: Oben links im Hauptfenster werden die Übersetzungseinheiten als Liste angezeigt. Darunter befinden sich die Übersetzungs-Metadaten mit Kommentaren zum gerade angezeigten Quelltext. Unten links werden im Bereich Übersetzungsdatenbank Vorschläge vorhandener Übersetzungen aus der Datenbank zum aktuellen Quelltexteintrag angezeigt. Unten rechts im Hauptfenster erscheint das Glossar.

source: Translation files are opened in separate tabs, with two big multi-line edits as well as a bunch of <emphasis>tool views</emphasis>. These views can be stacked (similar to tabs), shown separately, or hidden. Translation files consist of many English-target pairs called <emphasis>units</emphasis>. A <emphasis>unit</emphasis> typically correspond to a single string in the user interface, or one paragraph in the documentation. The purpose of the first multi-line edit is to display the original part of the pair. The purpose of the second multi-line edit is to display the translation. You can navigate through the <emphasis>units</emphasis> via the <guilabel>Translation Units</guilabel> view or by using <keycap>Page Down</keycap> and <keycap>Page Up</keycap>.
de: Die Übersetzungsdateien werden in zusätzlichen Unterfenstern mit zwei großen Fenstern zur Anzeige von Original und Übersetzung sowie einigen <emphasis>Werkzeugansichten</emphasis> geöffnet. Diese Ansichten können als Bestandteil des Hauptfensters nebeneinander oder gestapelt als Unterfenster und als unabhängige Fenster angezeigt oder auch ausgeblendet. Die Übersetzungsdateien bestehen aus vielen Paaren von Originaltext und Übersetzung, den sog. <emphasis>Einheiten</emphasis>. Eine <emphasis>Einheit</emphasis> entspricht üblicherweise einer einzelnen Zeichenkette in der Benutzeroberfläche oder einem Absatz in der Dokumentation. Im ersten Fenster (oben) wird der zu übersetzende Text angezeigt. Im zweiten Fenster (unten) kann die Übersetzung dieses Textes bearbeitet werden. Mit Hilfe der <guilabel>Übersetzungsliste</guilabel> oder durch die Verwendung der Tasten <keycap>Bild ab</keycap> und <keycap>Bild auf</keycap> kann durch die <emphasis>Einheiten</emphasis> geblättert werden.

source: A unit may be <emphasis>translated</emphasis> or <emphasis>untranslated</emphasis>. A translation of a translated unit may be <emphasis>ready</emphasis> or <emphasis>not ready</emphasis> (also called <emphasis>fuzzy</emphasis> sometimes). If the unit is not ready, its translation is rendered in italics. &lokalize; allows you to easily navigate through the file according to the state of their translation. See <guilabel>Go</guilabel> menu for the shortcuts. The status bar at the bottom of the window shows the current string number, total number of strings, total untranslated strings, total not ready (fuzzy) strings and status of the current string respectively. When navigating, untranslated units are treated as not ready. Also, you may use the filtering feature of <guilabel>Translation Units</guilabel> toolview. Pressing <keycap>Page Down</keycap> actually takes you to the next unit in filtered/sorted list of that tool view.
de: Eine Einheit kann <emphasis>übersetzt</emphasis> oder <emphasis>nicht übersetzt</emphasis> sein. Eine bereits übersetzte Einheit kann den Status <emphasis>fertig</emphasis> oder <emphasis>nicht fertig</emphasis> (teilweise auch als <emphasis>fraglich</emphasis> bezeichnet) besitzen. Die Übersetzung einer <emphasis>nicht fertigen</emphasis> Einheit wird kursiv dargestellt. In &lokalize; kann anhand des Status schnell durch eine Datei navigiert werden. Die Menüeinträge und Kurzbefehle dazu sind im Menü <guimenu>Gehe zu</guimenu> auffindbar. Die Statusleiste unten im Hauptfenster zeigt die Nummer der aktuellen Nachricht, die gesamte Anzahl der Nachrichten, die Zahl aller nicht übersetzten Nachrichten und Anzahl der nicht fertigen (fraglichen) Nachrichten und den Status der aktuellen Nachricht an. Bei der Navigation in der <guilabel>Übersetzungsliste</guilabel> werden nicht übersetzte Nachrichten als <emphasis>nicht fertig</emphasis> berücksichtigt. Mit <keycap>Bild ab</keycap> kann zum nächsten Element in der gefilterten bzw. sortierten Liste gesprungen werden.

source: To the main window one can add many more sections like <guilabel>Alternate Translations</guilabel>, <guilabel>Primary Sync</guilabel>, <guilabel>Secondary Sync</guilabel>, <guilabel>Binary Units</guilabel> by using <menuchoice><guimenu>Settings</guimenu><guimenuitem>Toolviews</guimenuitem></menuchoice> from the main menu.
de: Zum Hauptfenster können Sie weitere Abschnitte wie <guilabel>Alternative Übersetzungen</guilabel>, <guilabel>Primärer Abgleich</guilabel>, <guilabel>Sekundärer Abgleich</guilabel> und <guilabel>Binäreinheiten</guilabel> hinzufügen, indem Sie sie aus dem Menü <menuchoice><guimenu>Einstellungen</guimenu><guimenuitem>Ansichten</guimenuitem></menuchoice> auswählen.

source: Toolbars
de: Werkzeugleisten

source: You can add or remove actions in the toolbars using <menuchoice><guimenu>Settings</guimenu><guimenuitem>Configure Toolbars...</guimenuitem></menuchoice> from the main menu.
de: Sie können Aktionen zur Werkzeugleiste hinzufügen oder entfernen, indem Sie <menuchoice><guimenu>Einstellungen</guimenu><guimenuitem>Werkzeugleisten einrichten ...</guimenuitem></menuchoice> aus dem Menü wählen.

source: Configure Toolbars
de: Werkzeugleisten einrichten

source: Here you can configure the toolbars.
de: Hier können Sie die Werkzeugleisten einrichten

source: For more information read the section about <ulink url="help:/fundamentals/config.html#toolbars">Toolbars</ulink> of the &kde; Fundamentals.
de: Weitere Informationen dazu finden Sie im Abschnitt <ulink url="help:/fundamentals/config.html#toolbars">Anpassung der Werkzeugleisten</ulink> der &kde;-Grundlagen.

source: Shortcut keys
de: Kurzbefehle

source: You can save time by using shortcut keys during translation. To configure shortcut keys, use <menuchoice><guimenu>Settings</guimenu><guimenuitem>Configure Shortcuts...</guimenuitem></menuchoice> from the main menu.
de: Die Benutzung von Kurzbefehlen bei der Übersetzung ermöglicht ein sehr effektives Arbeiten. Um diese Kurzbefehle einzustellen, verwenden Sie <menuchoice><guimenu>Einstellungen</guimenu><guimenuitem>Kurzbefehle einrichten ...</guimenuitem></menuchoice>aus dem Hauptmenü.

source: Configure Shortcuts
de: Kurzbefehle einrichten

source: Here you can configure the shortcut keys.
de: Hier können Sie Kurzbefehle einrichten.

source: For more information read the section about <ulink url="help:/fundamentals/config.html#shortcuts">Shortcuts</ulink> of the &kde; Fundamentals.
de: Weitere Informationen dazu finden Sie im Abschnitt <ulink url="help:/fundamentals/config.html#shortcuts">Kurzbefehle</ulink> der &kde;-Grundlagen.

source: General Tips
de: Allgemeine Hinweise

source: If you are doing translations for &kde;, then either you will already have &lokalize; project file in your language folder (usually named <filename>index.lokalize</filename>), or you can select <menuchoice><guimenu>Project</guimenu><guimenuitem>Create new project</guimenuitem></menuchoice> and the wizard will download translation files for your language and will create project for you.
de: Beim Übersetzen von &kde; liegt entweder bereits eine Projektdatei (meist <filename>index.lokalize</filename>) im Projektordner vor oder es kann mittels <menuchoice><guimenu>Projekt</guimenu><guimenuitem>Neues Projekt erstellen</guimenuitem></menuchoice> ein neues Projekt erstellt werden. Beim Erstellen eines neuen Projekts lädt der Assistent die Dateien für die Übersetzung herunter.

source: It is recommended that you get used to the keyboard shortcuts instead of the menus and toolbars for increased productivity. For example, use the <keycombo>&Ctrl;<keycap>L</keycap></keycombo> to focus <guilabel>Quick search</guilabel> input line to filter the unit list in <guilabel>Translation Units</guilabel> view. Once you are done, press <keycap>Page Down</keycap> to start moving along the filtered list.
de: Zum effektiveren Arbeiten sollten die Tastenkürzel anstelle der Menüeinträge oder der Knöpfe in den Werkzeugleisten verwendet werden. Zum Beispiel wird mit <keycombo>&Ctrl;<keycap>L</keycap></keycombo> zur Eingabezeile der <guilabel>Schnellsuche</guilabel> für das Filtern der Einheiten in der <guilabel>Übersetzungsliste</guilabel> gesprungen. Mit <keycap>Bild ab</keycap> ist dann das Bewegen in der gefilterten Liste möglich.

source: If you are working with translation files in XLIFF format (definitely the case when you translate OpenDocument), then extended states are available (<emphasis>new</emphasis>, <emphasis>needs review</emphasis>, <emphasis>approved</emphasis>, &etc;). You may select them in drop-down menu of <guilabel>Approved</guilabel> button in the toolbar. Classification of the state as <emphasis>ready</emphasis> or <emphasis>not ready</emphasis> depends on the current <emphasis>workflow phase</emphasis> (<emphasis>translation</emphasis>, <emphasis>review</emphasis>, <emphasis>approval</emphasis>). A default phase for you depends on your <emphasis>role</emphasis> in the project (set in project settings). Each unit usually contains information about phase it was changed last time, and for each phase its owner is logged to the file.
de: Falls mit Übersetzungsdateien im „XLIFF“-Format (definitiv bei OpenDocument) gearbeitet wird, sind weitere Status verfügbar (<emphasis>Neu</emphasis>, <emphasis>Benötigt Prüfung</emphasis>, <emphasis>Freigegeben</emphasis>, usw.). Diese können im Auswahlfeld <guilabel>Freigegeben</guilabel> in der Werkzeugleiste ausgewählt werden. Das Festlegen des Status <emphasis>Fertig</emphasis> oder <emphasis>Nicht fertig</emphasis> hängt vom aktuellen <emphasis>Arbeitsschritt</emphasis> ab (<emphasis>Übersetzung</emphasis>, <emphasis>Prüfung</emphasis> oder <emphasis>Freigabe</emphasis>). Der standardmäßige Arbeitsschritt hängt von der jeweiligen <emphasis>Rolle</emphasis> innerhalb des Projekts ab (siehe <menuchoice><guimenu>Projekt</guimenu><guimenuitem>Projekt einrichten ...</guimenuitem></menuchoice>). Jede Einheit enthält in der Regel Informationen über die letztmalige Änderung und den jeweils in der Datei festgelegten <emphasis>Eigentümer</emphasis> des Arbeitsschritts.

source: Projects
de: Projekte

source: General Notes
de: Allgemeine Anmerkungen

source: The projects are one of the main concepts in &lokalize;. A project is represented by a file that contains paths, folders with translations, templates, and other files: glossary file, automation scripts, translation memories. Whenever &lokalize; opens a file without a project loaded, it will search for a project file in the parent folders (up to four levels). Alternatively, you can specify the project file via the <userinput>--project</userinput> flag when starting &lokalize; from the command line.
de: Projekte sind eines der wichtigsten Konzepte von &lokalize;. Ein Projekt besteht aus einer Datei, die Pfade zu den Ordnern mit Übersetzungen und Vorlagen enthält. Zu einem Projekt gehören noch weitere Dateien wie zum Beispiel eine Glossar-Datei, Skripte und eine Übersetzungsdatenbank. Wenn Sie mit &lokalize; eine Datei öffnen, ohne dass ein Projekt geladen ist, sucht &lokalize; in bis zu 4 Ebenen oberhalb des Ordners mit der Übersetzungsdatei nach einer Projektdatei. Alternativ können Sie die Projektdatei über die Option <userinput>--project</userinput> angeben, wenn Sie &lokalize; über die Befehlszeile starten.

source: For each project you select your role in it (<emphasis>translator</emphasis>, <emphasis>reviewer</emphasis>, <emphasis>approver</emphasis>), which in turn affects the workflow phase &lokalize; automatically picks up for files you edit.
de: Für jedes Projekt wird die eigene Rolle (<emphasis>Übersetzer</emphasis>, <emphasis>Prüfer</emphasis> oder <emphasis>Schlusszeichner</emphasis>) vergeben und bestimmt dadurch den automatischen Ablauf für die zu bearbeitenden Dateien.

source: Translation memories (unlike project files, glossary and scripts) are not shared between the translation team members, as they are created and stored under the user's home folder, meaning that the translation memories for all of the projects are stored in the same folder and thus can be used when other projects are opened.
de: Anders als die Projektdateien, das Glossar und die Skripte kann die Übersetzungsdatenbank nicht gemeinsam von den Mitgliedern eines Übersetzungsteams genutzt werden, da sie lokal in einem Ordner eines Benutzers erstellt und gespeichert wird. Alle Übersetzungsdatenbanken der verschiedenen Projekte werden im gleichen Ordner gespeichert. Die Einträge in den verschiedenen Datenbanken können dann in allen Projekten verwendet werden.

source: Project Overview tab
de: Projektübersicht

source: When you start &lokalize; first time, you will see an empty <guilabel>Project Overview</guilabel> tab. Project Overview is a file manager view, which helps you keep an overview of your PO files. The &lokalize; suite will help you to translate quickly and also to keep translations consistent. &lokalize; workflow implies that you start with creating/opening a project. The Project Overview tab displays a file tree with statistics with current project, such as percentage of the translated units completed and the last translator. It allows you to open a selected file in a tab of current &lokalize; window.
de: Wenn Sie &lokalize; zum ersten Mal starten, wird ein leeres Unterfenster <guilabel>Projektübersicht</guilabel> angezeigt. Diese Übersicht enthält eine Dateiverwaltungsansicht mit einem Überblick aller PO-Dateien. &lokalize; hilft Ihnen schnell zu übersetzen und konsistente Übersetzungen zu erstellen. Der Arbeitsablauf in &lokalize; setzt voraus, dass Sie mit dem Öffnen oder Erstellen eines Projekts beginnen. Die Projektübersicht zeigt einen Dateibaum mit Statistiken zum geöffneten Projekt, wie zum Beispiel dem Prozentsatz der fertig übersetzten Nachrichten und dem letzten Übersetzer. In der Projektübersicht können Sie eine Datei öffnen, die dann zur Bearbeitung in einem eigenen Unterfenster geöffnet wird,

source: To create a new project, use <menuchoice><guimenu>Project</guimenu><guimenuitem>Create new project</guimenuitem></menuchoice>. This will guide through the steps to create a new project. In <guimenu>Project</guimenu> menu you can also find options like <guimenuitem>Project overview</guimenuitem>, <guimenuitem>Configure project</guimenuitem>, <guimenuitem>Open project</guimenuitem>, and <guimenuitem>Open recent project</guimenuitem>.
de: Für ein neues Projekt wählen Sie <menuchoice><guimenu>Projekt</guimenu><guimenuitem>Neues Projekt erstellen</guimenuitem></menuchoice>. Im Menü <guimenu>Projekt</guimenu> finden Sie außerdem die Aktionen <guimenuitem>Projektübersicht</guimenuitem>, <guimenuitem>Projekt einrichten</guimenuitem>, <guimenuitem>Projekt öffnen</guimenuitem> und <guimenuitem>Kürzlich verwendetes Projekt öffnen</guimenuitem>.

source: Project Overview Tab
de: Das Unterfenster Projektübersicht

source: Here you can configure the project.
de: Hier können Sie Ihr Projekt einrichten.

source: The <guilabel>Project Overview</guilabel> tab displays a file tree with statistics for a current project, such as the percentage of translated units completed and the last translator. It allows you to open a selected file in a new tab of the current &lokalize;, window.
de: Die <guilabel>Projektübersicht</guilabel> stellt eine Baumansicht der Dateien mit Statistiken wie den prozentualen Anteil übersetzter Einheiten und dem letzten Übersetzer dar. Sie ermöglicht das Öffnen einer ausgewählte Datei in einem neuen Unterfenster in &lokalize;.

source: Glossary
de: Glossar

source: Have you ever become tired of typing the same long text sequence several times just because it would take more time to find its translation for a copy and paste? Now you will only have to find the (frequent) word sequence in the <guilabel>Glossary View</guilabel>, and then insert it by pressing a shortcut.
de: Um die mehrfache Eingabe eines identischen Textes zu vermeiden, kann dieser Text in der <guilabel>Glossaransicht</guilabel> gesucht und mit einer Tastenkombination einfügt werden.

source: Of course the glossary should be populated with word sequences first. &lokalize; has a handy glossary editor that allows an explicit search over the entire glossary.
de: Natürlich muss das Glossar zuerst mit Einträgen gefüllt werden. Dazu bietet &lokalize; einen praktischen Glossareditor, der auch eine detaillierte Suche im gesamten Glossar ermöglicht.

source: <screeninfo>Glossary view in the bottom right corner displays glossary entries appropriate for the current unit</screeninfo>
de: <screeninfo>Das Glossar rechts unten zeigt alle passenden Einträge für die aktuelle Einheit</screeninfo>

source: <phrase>Glossary view in the bottom right corner displays glossary entries appropriate for the current unit</phrase>
de: <phrase>Das Glossar rechts unten zeigt alle passenden Einträge für die aktuelle Einheit</phrase>

source: Translation Memory
de: Übersetzungsdatenbank
