Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdesdk/lokalize.po
Languages: de

source: The <guilabel>Translation Memory</guilabel> view allows you to drag and drop a folder with translation files from say &dolphin; into the view, and then, within few minutes, translation suggestions will be shown automatically on the unit switch. To insert the translation suggestions into the file, use <keycombo>&Ctrl;<keycap>1</keycap></keycombo>, <keycombo>&Ctrl;<keycap>2</keycap></keycombo> and so on, depending on the number of suggestion.
de: In das Fenster mit der <guilabel>Übersetzungsdatenbank</guilabel> können beispielsweise Ordner mit Übersetzungsdateien aus &dolphin; gezogen werden. Dann werden die Übersetzungen in diesen Dateien in die Datenbank übernommen. Um Übersetzungsvorschläge in das Übersetzungsfenster einzufügen, wird <keycombo>&Ctrl;<keycap>1</keycap></keycombo>, <keycombo>&Ctrl;<keycap>2</keycap></keycombo>, usw. verwendet (je nach Anzahl der Vorschläge).

source: Use <menuchoice><guimenu>Tools</guimenu><guimenuitem>Manage translation memories</guimenuitem></menuchoice> to add/manage projects to your Translation Memory. Here you can also import or export data from <filename role="extension">tmx</filename> file format.
de: Benutzen Sie <menuchoice><guimenu>Extras</guimenu><guimenuitem>Übersetzungsdatenbanken verwalten</guimenuitem></menuchoice>, um Projekte zu Ihrer Übersetzungsdatenbank hinzuzufügen. Hier können Sie auch Daten vom <filename role="extension">tmx</filename>-Dateiformat importieren oder in dieses Format exportieren.

source: Pressing <keycombo><keycap>F7</keycap></keycombo> will open <guilabel>Translation Memory</guilabel> tab, which allows you to query the TM freely. Clicking a search result will open the corresponding file and unit. If you want to quickly open some file in the project (and it is added to TM), then instead of browsing <guilabel>Project Overview</guilabel> you can just type its name into the <guilabel>File mask</guilabel> field, accompanied by '*'.
de: Durch Drücken der Taste <keycap>F7</keycap> wird ein neues Unterfenster mit der <guilabel>Übersetzungsdatenbank</guilabel> geöffnet. In diesem Unterfenster können Einheiten in der Übersetzungsdatenbank gesucht werden. Das Klicken auf das Ergebnis einer Suche öffnet die zugehörige Datei mit dieser Einheit. Um eine Datei schnell zu öffnen, die bereits in die Übersetzungsdatenbank eingelesen wurde, muss nur der Dateiname gefolgt von '*' in das Feld <guilabel>Dateimaske</guilabel> eingegeben werden, es ist nicht nötig, die Datei in der <guilabel>Projektübersicht</guilabel> zu suchen.

source: The TM engine indexes all entries, including non-ready and untranslated ones. This allows it to completely replace the Search-in-Files feature which required scanning every file in the project each time a search is done.
de: In der Übersetzungsdatenbank werden alle Einheiten einschließlich der fraglichen und nicht übersetzten indiziert. Damit müssen bei einer Suche nicht mehr alle Dateien im Projekt eingelesen und auf einen passenden Eintrag überprüft werden.

source: <screeninfo>&lokalize; with translation memory search results for the current unit</screeninfo>
de: <screeninfo>&lokalize; mit dem Ergebnis der Suche für die aktuelle Einheit aus der Übersetzungsdatenbank</screeninfo>

source: <phrase>&lokalize; with translation memory search results for the current unit</phrase>
de: <phrase>&lokalize; mit dem Ergebnis der Suche für die aktuelle Einheit aus der Übersetzungsdatenbank</phrase>

source: Batch Translation:
de: Grob-Übersetzung:

source: To insert the exactly matching suggestion automatically from the translation memory database, use <menuchoice><guimenu>Tools</guimenu><guimenuitem>Fill in all exact suggestions</guimenuitem></menuchoice> OR <guimenuitem>Fill in all exact suggestions and mark as fuzzy</guimenuitem>. This feature is similar rough translation feature in &kbabel;.
de: Um genau passende Übersetzungen automatisch aus der Übersetzungsdatenbank einzufügen, wählen Sie <menuchoice><guimenu>Extras</guimenu><guimenuitem>Alle exakten Übersetzungen einfügen</guimenuitem></menuchoice> oder <guimenuitem>Alle exakten Übersetzungen einfügen und als fraglich markieren</guimenuitem> aus dem Menü. Diese Funktionen entsprechen den Grobübersetzungen in &kbabel;.

source: Translation Synchronization Capabilities
de: Abgleich von Übersetzungen

source: The <guilabel>Sync Mode</guilabel> (previously known as <guilabel>Merge Mode</guilabel>) saves a great deal of time for the editors, and for cases when two or more translators are working simultaneously on the same file, or when one has to maintain translations for several branches of software.
de: Der <guilabel>Abgleichmodus</guilabel> erspart viel Arbeit, wenn zwei oder mehr Übersetzer gleichzeitig an derselben Datei arbeiten, oder wenn ein Übersetzer verschiedene Zweige einer Software betreut.

source: &lokalize; allows quick navigation through units that differ, and displays word-by-word differences. Also, &lokalize; has two Sync views - <guilabel>Primary Sync</guilabel> and <guilabel>Secondary Sync</guilabel>. They are identical, but the former is usually used to merge translations and second to keep in sync translations for two software branches.
de: &lokalize; ermöglicht eine schnelle Navigation durch die Einheiten mit unterschiedlichen Übersetzungen und zeigt die Unterschiede Wort für Wort an. Des Weiteren besitzt &lokalize; zwei Abgleichansichten - den <guilabel>Primären Abgleich</guilabel> und den <guilabel>Sekundären Abgleich</guilabel>. Beide Ansichten verhalten sich gleich, aber die erste wird normalerweise für das Zusammenführen und die zweite zum Abgleich von Übersetzungen in zwei verschiedenen Softwarezweigen verwendet.

source: After you copied translation from auxiliary file (<emphasis>synchronized</emphasis> it), any subsequent changes made to this unit will be replicated back to auxiliary file.
de: Nachdem eine Übersetzung aus einer zusätzlichen Datei kopiert wurde (bzw. mit dieser <emphasis>abgeglichen</emphasis> wurde), werden alle nachfolgenden Änderungen an der entsprechenden Einheit auf die zusätzliche Datei zurück kopiert.

source: Merging
de: Zusammenführen

source: One use of <guilabel>Sync Mode</guilabel> is reviewing changes made by (new) contributors, when you cannot be sure of the quality of the work done.
de: Eine Verwendung findet der <guilabel>Abgleichmodus</guilabel> im Prüfen der (geänderten) Übersetzungen von (neuen) Übersetzern (sofern für die Qualität der Übersetzungen keine Sicherheit gegeben ist).

source: Open a base file, then drop its changed version into the <guilabel>Primary Sync</guilabel> view, followed by <keycombo>&Alt;<keycap>Down</keycap></keycombo> or <keycombo>&Alt; <keycap>Up</keycap></keycombo> (remember that shortcuts may be modified in a usual way for all &kde; applications) to navigate through entries that are different.
de: Hierzu wird die Ausgangsdatei geöffnet, die überarbeitete Datei in das Fenster <guilabel>Primärer Abgleich</guilabel> gezogen und schließlich mittels <keycombo>&Alt;<keycap>Pfeil runter</keycap></keycombo> oder <keycombo>&Alt; <keycap>Pfeil hoch</keycap></keycombo> durch die Einträge mit abweichenden Übersetzungen geblättert.

source: <screeninfo>&lokalize; used for merging changes in translation</screeninfo>
de: <screeninfo>&lokalize; beim Zusammenführen von Änderungen in Übersetzungen</screeninfo>

source: <phrase>&lokalize; used for merging changes in translation</phrase>
de: <phrase>&lokalize; beim Zusammenführen von Änderungen in Übersetzungen</phrase>

source: Replication
de: Abgleichen

source: <guilabel>Sync Mode</guilabel> may also be used to make changes to translation for two branches simultaneously. Set <guilabel>Branch folder</guilabel> path in your project options to the path that corresponds to base folder of the branch, and <guilabel>Secondary Sync</guilabel> view will automatically open files from branch. Then, each time you make changes in files of your main branch, they will automatically be replicated to the branch (of course, if it contains the same English string).
de: Im <guilabel>Abgleichmodus</guilabel> können Änderungen an Übersetzungen von zwei Zweigen gleichzeitig vorgenommen werden. Der Pfad zum Basisordner des Zweiges wird hierzu als <guilabel>Zweig-Ordner</guilabel> in den Projekteinstellungen gesetzt. Dann werden die Dateien in diesem Zweig automatisch als <guilabel>Sekundärer Abgleich</guilabel> geöffnet. Wenn nun Übersetzungen in Dateien im Hauptzweig geändert werden, werden diese Änderungen automatisch auch in den Dateien des Nebenzweiges vorgenommen (sofern der Originaltext in beiden Dateien übereinstimmt).

source: For example, if you work on &kde; translation, you can checkout trunk to <filename class="directory">/home/xx/hacking/kde/trunk/l10n-kde4/YOUR_LANG</filename> and branch to <filename class="directory">/home/xx/hacking/kde/branches/stable/l10n-kde4/YOUR_LANG</filename>. Create &lokalize; project: <filename>/home/xx/hacking/kde/trunk/l10n-kde4/YOUR_LANG/project.lokalize</filename> and set <filename class="directory">BranchDir=../../../branches/stable/l10n-kde4/YOUR_LANG</filename>, then work via this project, and commit changes in both trunk and branch folders.
de: Wenn beispielsweise an der Übersetzung von &kde; gearbeitet wird, kann „trunk“ nach <filename class="directory">/home/xx/hacking/kde/trunk/l10n-kde4/de</filename> und „branch“ nach <filename class="directory">/home/xx/hacking/kde/branches/stable/l10n-kde4/de</filename> ausgecheckt werden. Das &lokalize;-Projekt <filename>/home/xx/hacking/kde/trunk/l10n-kde4/de/projekt.lokalize</filename> wird erstellt und <filename class="directory">BranchDir=../../../branches/stable/l10n-kde4/de</filename> gesetzt. Beim Bearbeiten des Projekts werden dann die Änderungen gleichzeitig im „trunk“- und „branch“-Verzeichnis ausgeführt.

source: Alternate Translations
de: Alternative Übersetzungen

source: Each unit may have several <emphasis>alternate translations</emphasis> associated with it. Such translations may appear during file update, when the source string is slightly changed. In this case the old translation with it's (old) source is moved to alternate translations list, so that they are not lost.
de: Jede Einheit hat verschiedene <emphasis>Alternative Übersetzungen</emphasis>, die mit ihr im Zusammenhang stehen. Solche Übersetzungen können während der Aktualisierung der Datei bei kleineren Änderungen der Quelle entstehen. In diesem Fall wird die alte Übersetzung zusammen mit der alten Quelle zu den <emphasis>Alternativen Übersetzungen</emphasis> verschoben und beide sind somit nicht verloren.

source: When translating software, usually gettext tools are used to prepare translation files. When original text changes, gettext tools update translation files and mark entries with changed original text as <emphasis>fuzzy</emphasis> (or <emphasis>non-ready</emphasis> in other terminology). They store previous original text so that translators could see what changes exactly were made. &lokalize; simplifies the life of the translator and highlights parts of the original text that were changed in the <guilabel>Alternate Translations</guilabel> view.
de: Beim Übersetzen von Software werden meist die „gettext“-Werkzeuge für die Aufbereitung der Übersetzungsdateien verwendet. Wenn sich der Originaltext für die Übersetzung ändert, aktualisieren die „gettext“-Werkzeuge die Übersetzungsdateien und markieren Einträge mit verändertem Originaltext als <emphasis>nicht fertig</emphasis>. Sie speichern den früheren Originaltext, sodass die Übersetzer genau sehen können, was sich verändert hat. &lokalize; erleichtert die Übersetzung, indem es die veränderten Teile des Originaltextes im Fenster <guilabel>Alternative Übersetzungen</guilabel> hervorhebt.

source: <screeninfo>&lokalize; highlighting parts of original text that were changed since translation was last reviewed</screeninfo>
de: <screeninfo>&lokalize; hebt die Teile des Ausgangstextes hervor die seit der letzten Überprüfung der Übersetzung verändert wurden</screeninfo>

source: <phrase>&lokalize; highlighting parts of original text that were changed since translation was last reviewed</phrase>
de: <phrase>&lokalize; hebt die Teile des Ausgangstextes hervor die seit der letzten Überprüfung der Übersetzung verändert wurden</phrase>

source: Scripting &lokalize;
de: Skripte in &lokalize;

source: &lokalize; is extensible using scripts in several interpreted languages, including Python and JavaScript. Scripts are usually integrated into the &lokalize; UI as menu actions (to which you may assign a keyboard shortcut). The location and name of the menu entry for the script is defined in its accompanying .rc file. On each project open, &lokalize; scans <filename>PROJECTDIR/lokalize-scripts</filename> folder for .rc files and adds them to a <emphasis>cache</emphasis> file called <filename>PROJECTDIR/lokalize-scripts/scripts.rc</filename> (so you shouldn't generally want to add it project's version control system). RC files also contain script paths, which may be relative to .rc file folder, or to a system scripts folder - they both are tried (though they <emphasis>should</emphasis> be kept in a relative location if you want to share them with other people in your project). For example, you can specify <filename>../../scripts/lokalize/opensrc.py</filename> to load a script from the <ulink url="http://websvn.kde.org/trunk/l10n-kde4/scripts/lokalize/">global kde4-l10n scripts folder</ulink> (&ie; not specific to your language).
de: &lokalize; ist durch die Verwendung von Skripten in verschiedenen Programmiersprachen (einschl. Python und JavaScript) erweiterbar. Die Skripte werden üblicherweise als Menüeinträge (ggf. mit Tastenkürzel) in die grafische Benutzeroberfläche von &lokalize; eingebunden. Der Ort und Name des Menüeintrags für das Skript wird in seiner <filename>.rc</filename>-Datei festgelegt. Beim Öffnen jedes Projekts durchsucht &lokalize; den Ordner <filename>Projektordner/lokalize-scripts</filename> nach <filename>.rc</filename>-Dateien und fügt diese zur <emphasis>Zwischenspeicher</emphasis>-Datei namens <filename>Projektordner/lokalize-scripts/scripts.rc</filename> hinzu (daher sollte vom Hinzufügen seines Projektverwaltungssystems abgesehen werden). Die <filename>.rc</filename>-Dateien enthalten auch die Skript-Pfade, welche möglicherweise relativ zum Ordner der <filename>.rc</filename>-Datei oder eines System-Skripts sind - sie unterstützen beides (die <filename>.rc</filename>-Dateien <emphasis>sollten</emphasis> für die gemeinsame Nutzung im Projekt <filename>relativ</filename> sein). Damit kann beispielsweise in <filename>../../scripts/lokalize/opensrc.py</filename> festgelegt werden, dass Skripte vom <ulink url="http://websvn.kde.org/trunk/l10n-kde4/scripts/lokalize/">allgemeinen Skript-Ordner</ulink> geladen werden (und nicht vom sprachenspezifischen Ordner).

source: Examples of .rc files may be found in &lokalize; install folder (usually <filename>/usr/share/kde4/apps/lokalize/scripts/</filename>) and in the <ulink url="http://websvn.kde.org/trunk/l10n-kde4/scripts/lokalize/">&kde; repository</ulink>. <ulink url="http://websvn.kde.org/trunk/l10n-kde4/ru/lokalize-scripts/">Here</ulink> you can find more script examples, including JavaScript-based <filename>check-gui.js</filename> that runs automatically on each file save (this is achieved via special option in .rc file). If you're familiar with Python or JavaScript, the code should be self-explanatory.
de: Beispiele für <filename>.rc</filename>-Dateien sind möglicherweise im Installationsordner von &lokalize; (<filename>/usr/share/kde4/apps/lokalize/scripts/</filename> und <ulink url="http://websvn.kde.org/trunk/l10n-kde4/scripts/lokalize/">&kde;-Quelltextarchiv</ulink> zu finden. <ulink url="http://websvn.kde.org/trunk/l10n-kde4/ru/lokalize-scripts/">Hier</ulink> sind weitere Skript-Beispiele wie beispielsweise das JavaScript-basierte <filename>check-gui.js</filename>, das bei jedem Speichern einer Datei läuft (dies wird durch eine spezielle Einstellung in der <filename>.rc</filename>-Datei bewerkstelligt). Bei Kenntnissen in Python oder JavaScript sollte der Quelltext selbsterklärend sein.

source: Below are links to API references. Everything marked as <emphasis>Q_SCRIPTABLE</emphasis> may be used from scripts.
de: Nachstehend werden Verknüpfungen zu den Programmierschnittstellen (API-Referenzen) aufgeführt. Alles mit <emphasis>Q_SCRIPTABLE</emphasis> kann in Skripten Verwendung finden.

source: <ulink url="http://api.kde.org/4.x-api/kdesdk-apidocs/lokalize/html/classEditorTab.html">Editor</ulink> object API reference
de: <ulink url="http://api.kde.org/4.x-api/kdesdk-apidocs/lokalize/html/classEditorTab.html">Editor</ulink>-Programmierschnittstelle

source: <ulink url="http://api.kde.org/4.x-api/kdesdk-apidocs/lokalize/html/classLokalizeMainWindow.html">&lokalize;</ulink> object API reference
de: <ulink url="http://api.kde.org/4.x-api/kdesdk-apidocs/lokalize/html/classLokalizeMainWindow.html">&lokalize;</ulink>-Programmierschnittstelle

source: <ulink url="http://api.kde.org/4.x-api/kdesdk-apidocs/lokalize/html/classProjectTab.html">Project</ulink> object API reference
de: <ulink url="http://api.kde.org/4.x-api/kdesdk-apidocs/lokalize/html/classProjectTab.html">Projekt</ulink>-Programmierschnittstelle

source: Credits and License
de: Danksagungen und Lizenz

source: Program Copyright &copy; 2007-2009, Nick Shaforostoff <email>shaforostoff@kde.ru</email>
de: Programm Copyright &copy; 2007-2009, Nick Shaforostoff <email>shaforostoff@kde.ru</email>

source: Some code was taken from &kbabel;, the &lokalize; predecessor.
de: Einiger Quelltext wurde vom &lokalize;-Vorläufer &kbabel; übernommen.

source: Documentation Copyright &copy; 2007-2009 Nick Shaforostoff <email>shaforostoff@kde.ru</email>
de: Dokumentation Copyright &copy; 2007-2009 Nick Shaforostoff <email>shaforostoff@kde.ru</email>

source: Author:
de: Autor:

source: See the <ulink url="http://userbase.kde.org/lokalize">&lokalize; homepage</ulink> for more details.
de: Weitere Informationen finden sind auf der <ulink url="http://userbase.kde.org/lokalize">&lokalize;-Webseite</ulink> verfügbar.

source: CREDIT_FOR_TRANSLATORS
de: <para>Übersetzung: Ingo Malchow <email>ingomalchow@googlemail.com</email>, Justus Seifert <email>justus.seifert@googlemail.com</email></para><para>Überarbeitung der Übersetzung: Johannes Obermayr <email>johannesobermayr@gmx.de</email></para>
