Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdesdk/scripts_man-zonetab2pot.py.1.po
Languages: de

source: April 7, 2003
de: 7. April 2003

source: Converts a timezone list to a PO file template.
de: Wandelt eine Zeitzonenliste in eine PO-Datei um.

source: <command>zonetab2pot.py</command> <group><option><replaceable>timezone-list</replaceable></option></group>
de: <command>zonetab2pot.py</command> <group><option><replaceable>Zeitzonen-Liste</replaceable></option></group>

source: Description
de: Beschreibung

source: <command>zonetab2pot.py</command> reads the timezone list given on the command-line and converts it to a gettext message file (PO-file) template containing the names of the individual timezones.
de: <command>zonetab2pot.py</command> liest eine Zeitzonen-Liste von der Befehlszeile ein und wandelt sie in eine POT-Vorlagendatei im Gettext-Format um, die dann die Namen der individuellen Zeitzonen enth√§lt.

source: The given timezone list should be in the same format as the system zone.tab. If no timezone list is specified on the command-line, <filename>/usr/share/zoneinfo/zone.tab</filename> will be used.
de: Die angegebene Zeitzonen-Liste sollte im gleichen Format vorliegen wie die Datei zone.tab des Systems. Wenn keine Zeitzonen-Liste auf der Befehlszeile angegeben wird, wird stattdessen <filename>/usr/share/zoneinfo/zone.tab</filename> verwendet.

source: The new PO-file template will be written to standard output.
de: Die neue POT-Datei wird auf die Standard-Ausgabe ausgegeben.

source: This utility is part of the KDE Software Development Kit.
de: Dieses Hilfsprogramm ist Teil der &kde; Software-Entwicklungswerkzeuge.

source: Authors
de: Autoren

source: zonetab2pot.py was written by <personname><firstname>Lukas</firstname><surname>Tinkl</surname></personname><email>lukas@kde.org</email>
de: zonetab2pot.py wurde geschrieben von <personname><firstname>Lukas</firstname><surname>Tinkl</surname></personname><email>lukas@kde.org</email>

source: This manual page was prepared by <personname><firstname>Ben</firstname><surname>Burton</surname></personname><email>bab@debian.org</email>
de: Diese Handbuchseite wurde geschrieben von <personname><firstname>Ben</firstname><surname>Burton</surname></personname><email>bab@debian.org</email>
