Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdesdk/scripts_man-cheatmake.1.po
Languages: de

source: March 8, 2003
de: 8. März 2003

source: fool <command>make</command> into not rebuilding certain files
de: täusche <command>make</command> so, dass bestimmte Dateien nicht neu erstellt werden

source: Description
de: Beschreibung

source: <command>cheatmake</command> is used to save time when recompiling. It can fool make into skipping files that haven't changed in a meaningful way. This can be used for instance when you change a comment in a file but none of the actual code.
de: <command>cheatmake</command> wird benutzt, wenn Sie beim Neukompilieren Zeit sparen wollen. Es täuscht make dahingehend, dass Dateien übersprungen werden, an denen keine besonderen Änderungen vorgenommen wurden, zum Beispiel, wenn Sie in einem Quelltext nur einen Kommentar geändert haben.

source: This utility is part of the &kde; Software Development Kit.
de: Dieses Hilfsprogramm ist Teil der &kde; Software-Entwicklungswerkzeuge.

source: Options
de: Aufrufparameter

source: Hides the fact that file was changed by setting the timestamp into the past. Use with care!
de: Verhindert, dass die Änderung der Datei erkannt wird, indem der Zeitstempel zurückdatiert wird. Verwenden Sie diese Funktion mit Vorsicht.

source: Lists what files <command>make</command> currently needs to rebuild
de: Gibt eine Liste der Dateien aus, die von <command>make</command> neu erstellt werden würden.

source: Explains why make must rebuild file
de: Beschreibt, aus welchem Grund diese Datei neu erstellt werden muss.

source: Environment
de: Umgebung

source: One of the following variables (but not both) should be set if the source directory is different from the build directory. If the build directory is simply a subdirectory of the source directory, the simpler variable <envar>OBJ_SUBDIR</envar> should be used.
de: Eine der folgenden Variablen (aber nicht beide) sollte gesetzt sein, wenn das Verzeichnis, in dem der Erstellungsvorgang stattfindet nicht mit dem Quelltextverzeichnis übereinstimmt. Handelt es sich beim Erstellungsverzeichnis um ein Unterverzeichnis des Quelltextverzeichnisses, sollte die einfachere Variable <envar>OBJ_SUBDIR</envar> verwendet werden.

source: Indicates that the build directory is in the given subdirectory of the source directory. For instance, if the source directory is <filename class="directory">kdesdk</filename> and the build directory is <filename class="directory">kdesdk/obj-i386-linux</filename>, then <envar>OBJ_SUBDIR</envar> should be set to <parameter>obj-i386-linux</parameter>.
de: Zeigt an, dass das Erstellungsverzeichnis im angegebenen Unterverzeichnis des Quelltextverzeichnisses liegt. Ist das Quelltextverzeichnis beispielsweise <filename class="directory">kdesdk</filename> und das Erstellungsverzeichnis <filename class="directory">kdesdk/obj-i386-linux</filename>, sollte <envar>OBJ_SUBDIR</envar> auf den Wert <parameter>obj-i386-linux</parameter> gesetzt werden.

source: A <command>sed</command> expression that is used to transform the source directory into the build directory. For instance, if the source directory is <filename class="directory">kdesdk/obj-i386-linux</filename>, then <envar>OBJ_REPLACEMENT</envar> should be set to <parameter>s#kdesdk#kdesdk-obj#</parameter>.
de: Ein <command>sed</command>-Ausdruck, der zum Umwandeln des Quelltextverzeichnisses in das Erstellungsverzeichnis benutzt wird. Wenn beispielsweise das Quelltextverzeichnis <filename class="directory">kdesdk/obj-i386-linux</filename> ist, sollte <envar>OBJ_REPLACEMENT</envar> auf <parameter>s#kdesdk#kdesdk-obj#</parameter> gesetzt werden.

source: See Also
de: Siehe auch

source: Authors
de: Autoren

source: <command>cheatmake</command> was written by &David.Faure; &David.Faure.mail;. This manual page was prepared by <personname><firstname>Ben</firstname><surname>Burton</surname></personname> <email>bab@debian.org</email> for the Debian <acronym>GNU</acronym>/&Linux; system (but may be used by others).
de: <command>cheatmake</command> wurde von &David.Faure; &David.Faure.mail; geschrieben. Diese MAN-Page wurde von <personname><firstname>Ben</firstname><surname>Burton</surname></personname> <email>bab@debian.org</email> für das Debian <acronym>GNU</acronym>/&Linux; System erstellt (kann aber auch von anderen System benutzt werden).
