Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdesdk/scripts_man-fixincludes.1.po
Languages: de

source: April 7, 2003
de: 7. April 2003

source: Reduce the number of #includes in &kde; source files
de: Reduziert die Anzahl der #includes in den Quelltexten von &kde;.

source: Description
de: Beschreibung

source: <command>fixincludes</command> tries to reduce the number of #includes in C++ source files. Much of it's processing is specific to &kde; sources and so it might not work so well with sources for non-&kde; applications.
de: <command>fixincludes</command> versucht die Anzahl der #include-Anweisungen in den C++-Quelltexten zu verringern. Die Verarbeitung ist auf &kde;-Quelltexte zugeschnitten, sodass dieses Skript mit den Quelltexten anderer Anwendungen nicht so gut funktioniert.

source: The following problems are identified by <command>fixincludes</command>:
de: Die folgenden Probleme werden von <command>fixincludes</command> erkannt:

source: Including headers that are no longer supported but which exist for compatibility with older Qt/KDE versions;
de: Eingebundene Header, die nicht mehr unterstützt werden, aber aus Kompatibilitätsgründen zu älteren Versionen von Qt oder KDE noch vorhanden sind.

source: Including the same file multiple times.
de: Das mehrfache Einbinden derselben Datei.

source: There is also an experimental mode which tries removing each #include one at a time (with a few exceptions) to see whether the source still compiles. Note that this experimental mode will modify the original sources.
de: Es steht auch ein experimenteller Modus zur Verfügung, der durch das probeweise Entfernen von #include-Anweisungen (mit einigen Ausnahmen) festzustellen versucht, ob der Quellcode noch übersetzbar ist. Beachten Sie, dass dieser Modus die Quelltexte ändert.

source: By default the sources will not be modified; the identified problems will simply be written to standard output.
de: In der Voreinstellung werden die Quelltext nicht geändert, die festgestellten Probleme werden nur auf die Standardausgabe ausgegeben.

source: The list of C++ sources to examine should be given on the command-line. If no files are given, all C++ sources in or beneath the current directory will be examined (with the exception of directories whose <filename>Makefile.am</filename> contains <option>-UQT_NO_COMPAT</option> or <option>-UKDE_NO_COMPAT</option>)
de: Die Liste der zu untersuchenden C++-Quelltext sollte auf der Befehlszeile übergeben werden. Fehlt diese Angabe, werden alle C++-Quelltext innerhalb des aktuellen Verzeichnisses und dessen Unterordnern untersucht. (Hierbei gilt eine Ausnahme für Verzeichnisse, deren <filename>Makefile.am</filename> die Optionen <option>-UQT_NO_COMPAT</option> oder <option>-UKDE_NO_COMPAT</option> enthält.

source: This utility is part of the KDE Software Development Kit.
de: Dieses Hilfsprogramm ist Teil der &kde; Software-Entwicklungswerkzeuge.

source: Options
de: Optionen

source: Verbose mode. Additional debugging output is written to standard output.
de: Ausführlichere Modus. Zusätzliche Informationen werden auf der Standardausgabe ausgegeben.

source: Experimental mode, as described above in detail. Note that this option implies <option>--modify</option>.
de: Experimenteller Modus, wie bereits beschrieben. Beachten Sie, dass dieser Modus die Option <option>--modify</option> beinhaltet.

source: As well as writing messages to standard output, actually modify the original sources to fix any problems that were found.
de: Neben der Ausgabe der Meldungen auf die Standardausgabe, werden die festgestellten Probleme in den Quelltexten behoben.

source: Authors
de: Autoren

source: <command>fixincludes</command> was written by Dirk Mueller <email>mueller@kde.org</email>.
de: <command>fixincludes</command> wurde von Dirk Mueller <email>mueller@kde.org</email> geschrieben.
