Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdesdk/scripts_man-transxx.1.po
Languages: de

source: April 7, 2003
de: 7. April 2003

source: Create a pseudo translated PO file from a PO template file
de: Erzeugt eine peudo-übersetzte PO-Datei aus einer PO-Vorlage

source: <command>transxx</command> <group><option><replaceable>template.pot</replaceable></option></group>
de: <command>transxx</command> <group><option><replaceable>vorlage.pot</replaceable></option></group>

source: Description
de: Beschreibung

source: <command>transxx</command> is a command-line tool that produces a basic fleshed-out PO-file from a PO-template file. Some of the formatting and structure of the msgid strings will be copied to the msgstr strings, but otherwise text will be translated to <quote>xx</quote>.
de: Das Befehlszeilen-Werkzeug <command>transxx</command> erzeugt aus einer PO-Vorlage eine mit Inhalt gefüllte PO-Datei. Einige Format-Anweisungen werden aus der Vorlagendatei übernommen, alle anderen Texte werden einfach zusätzlich mit den zwei Buchstaben <quote>xx</quote> übersetzt.

source: The fleshed-out PO-file is sent to standard output.
de: Die fertige PO-Datei wird auf der Standard-Ausgabe ausgegeben.

source: Running your software with the language <quote>xx</quote> will quickly show you any user visible strings that are not translatable.
de: Das Ausführen eines Programms mit der Sprache <quote>xx</quote> zeigt Ihnen auf diese Weise sehr schnell, welche vom Benutzer sichtbaren Texte noch nicht für die Übersetzung vorbereitet sind.

source: This utility is part of the KDE Software Development Kit.
de: Dieses Hilfsprogramm ist Teil der &kde; Software-Entwicklungswerkzeuge.

source: Authors
de: Autoren

source: The PO-XML tools were written by &Stephan.Kulow; &Stephan.Kulow.mail;
de: Die PO-XML-Hilfsprogramme wurden von &Stephan.Kulow;&Stephan.Kulow.mail; geschrieben.

source: This manual page was prepared by <personname><firstname>Ben</firstname><surname>Burton</surname></personname><email>bab@debian.org</email>
de: Diese Handbuchseite wurde geschrieben von <personname><firstname>Ben</firstname><surname>Burton</surname></personname><email>bab@debian.org</email>
