Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdesdk/scripts_man-reportview.1.po
Languages: de

source: April 7, 2003
de: 7. April 2003

source: ask KWeatherService to display a weather report
de: Lässt den KDE-Wetterdienst den Wetterbericht anzeigen.

source: <command>reportview;</command> <group><option>KDE Generic Options</option></group> <group><option>Qt Generic Options</option></group>
de: <command>reportview;</command> <group><option>Allgemein KDE-Optionen</option></group> <group><option>Allgemeine Qt-Optionen</option></group>

source: Description
de: Beschreibung

source: <command>reportview</command> is not intended to be used directly.
de: Das Programm <command>reportview</command> ist nicht für den direkten Aufruf bestimmt.

source: <command>reportview</command> is a small program that asks KWeatherService to display a weather report. Information shown includes the temperature, wind speed and air pressure.
de: Das Programm <command>reportview</command> lässt den KDE Wetterdienst einen Wetterbericht anzeigen. Der Wetterbericht beinhaltet Temperatur, Windgeschwindigkeit und den Luftdruck.

source: KWeatherService is a DCOP service used by both reportview and the &kweather; panel applet to provide weather data. There is no need to start KWeatherService separately; reportview will start the service itself if needed.
de: Der KDE-Wetterdienst ist ein DCOP-Dienst und liefert die Wetterdaten für reportview und das &kweather;-Miniprogramm für die Kontrollleiste. Der KDE-Wetterdienst muss nicht manuell gestartet werden; reportview wird ihn bei Bedarf selber starten.

source: See Also
de: Siehe auch

source: More detailed user documentation is available from <ulink url="help:/kweather">help:/kweather</ulink> (either enter this <acronym>URL</acronym> into &konqueror;, or run <userinput><command>khelpcenter</command> <parameter>help:/kweather</parameter></userinput>).
de: Eine tiefergehende Dokumentation für Benutzer ist unter <ulink url="help:/kweather">help:/kweather</ulink> erhältlich. (Geben Sie diese Adresse in &konqueror; ein oder führen Sie <userinput><command>khelpcenter</command> <parameter>help:/kweather</parameter></userinput> aus.)

source: Authors
de: Autoren

source: &kweather; was written by &Ian.Reinhart.Geiser; &Ian.Reinhart.Geiser.mail; and &Nadeem.Hasan; &Nadeem.Hasan.mail;
de: &kweather; wurde von &Ian.Reinhart.Geiser; &Ian.Reinhart.Geiser.mail; und &Nadeem.Hasan; &Nadeem.Hasan.mail; geschrieben.

source: This manual page was prepared by <personname><firstname>Ben</firstname><surname>Burton</surname></personname><email>bab@debian.org</email>
de: Diese Handbuchseite wurde geschrieben von <personname><firstname>Ben</firstname><surname>Burton</surname></personname><email>bab@debian.org</email>
