Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdesdk/scripts_man-pruneemptydirs.1.po
Languages: de

source: April 8, 2003
de: 8. April 2003

source: Detects stale source directories in a CVS tree
de: Spürt verwaiste Quelltext-Ordner in einem CVS-System auf.

source: Description
de: Beschreibung

source: <command>pruneemptydirs</command> is used to clean up a local CVS tree. It detects directories containing remnants of old stuff which has been removed from the CVS. Such stale directories often break compilation. The current directory and all directories beneath it will be examined.
de: <command>pruneemptydirs</command> wird zum Aufräumen einer lokalen CVS-Arbeitskopie verwendet. Es spürt Ordner mit Überresten von Code-Teilen auf, die bereits aus dem CVS-System entfernt wurden. Solche Überbleibsel verursachen oftmals Fehler beim Kompilieren. Durchsucht wird der aktuelle und alle darunterliegenden Ordner.

source: Note that this tool does not remove anything; it simply prints what to do as a series of remove commands. You can copy and paste these commands, or use them with eval in a script.
de: Dieses Werkzeug entfernt nichts, sondern listet nur eine Reihe Befehle auf, mit denen die Überbleibsel entfernt werden könnten. Sie können diese Befehle kopieren und einfügen oder mittels eval in einem Skript weiterverwenden.

source: This tool works better if the source directory is not the same as the build directory, since it will not print directories containing old executables.
de: Dieses Werkzeug funktioniert besser, wenn der Quellordner nicht zum Kompilieren verwendet wird, weil das Programm dann keine Ordner mit alten Binärdateien ausgibt.

source: This utility is part of the KDE Software Development Kit.
de: Dieses Hilfsprogramm ist Teil der &kde; Software-Entwicklungswerkzeuge.

source: Options
de: Optionen

source: Actually perform the deletions instead of just printing them out. Use this option with care.
de: Die gefundenen Dateien tatsächlich löschen, anstatt sie nur aufzulisten. Verwenden Sie diese Option mit Bedacht.

source: Authors
de: Autoren

source: <command>pruneemptydirs</command> was written by &David.Faure; &David.Faure.mail;
de: <command>pruneemptydirs</command> wurde von &David.Faure; &David.Faure.mail; geschrieben.

source: This manual page was prepared by <personname><firstname>Ben</firstname><surname>Burton</surname></personname><email>bab@debian.org</email>
de: Diese Handbuchseite wurde geschrieben von <personname><firstname>Ben</firstname><surname>Burton</surname></personname><email>bab@debian.org</email>
