Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdesdk/umbrello_working_with_umbrello.po
Languages: de

source: Again, there is a <emphasis>big</emphasis> difference between removing an object from a diagram, and deleting an object from your model: If you delete an object from within a diagram, you are only removing the object from that particular diagram: the element will still be part of your model and if there are other diagrams using the same element they will not suffer any change. If, on the other hand, you delete the element from the Tree View, you are actually deleting the element from your <emphasis>model</emphasis>. Since the element no longer exist in your model, it will be automatically removed from all the diagrams it appears in.
de: Hier zeigt sich wiederum der <emphasis>große</emphasis> Unterschied zwischen einem Element aus einem Diagramm und einem Element aus dem Modell zu entfernen. Löscht man ein Element in einem Diagramm, dann wird es nur aus diesem speziellen Diagramm entfernt. Das Element ist aber weiterhin Teil des Modells und falls es in anderen Diagrammen genutzt wird, werden diese nicht verändert. Löscht man hingegen das Element in der Baumansicht, dann löscht man das Element im ganzen <emphasis>Modell</emphasis>. Da das Element dann nicht länger im Modell existiert, wird es ebenfalls in allen Diagrammen gelöscht, in denen es verwendet wird.

source: Editing Elements
de: Elemente bearbeiten

source: You can edit most of the &UML; elements in your model and diagrams by opening its Properties dialog and selecting the appropriate options. To edit the properties of an object, select <guimenuitem>Properties</guimenuitem> from its context menu (&RMB; click). Each element has a dialog consisting of several pages where you can configure the options corresponding to that element. For some elements, like actors you can only set a couple of options, like the object name and documentation, while for other elements, like classes, you can edit its attributes and operations, select what you want to be shown in the diagram (whole operation signature or just operation names, etc) and even the colors you want to use for the line and fill of the class' representation on the diagram.
de: Man kann die meisten &UML;-Elemente des Modells ändern, indem man den Eigenschaftendialog öffnet und die gewünschten Änderungen vornimmt. Um zum Beispiel ein Objekt zu verändern, ist es auszuwählen und dann <guimenuitem>Eigenschaften</guimenuitem> aus seinem Kontextmenü (rechte Maustaste) zu wählen. Jedes Element verfügt über solch einen Dialog, der aus mehreren Seiten besteht, abhängig vom Typ des zu bearbeitenden Elementes. Für einige Elemente, wie Akteure, kann man lediglich einige wenige Parameter wie den Namen oder die Dokumentation ändern. Für andere Elemente hingegen, wie Klassen, kann man viele Einstellungen vornehmen wie Attribute und Operationen, Sichtbarkeit und die Darstellung im Diagramm (nur Operationen oder komplette Signatur der Operationen). Man kann sogar die Linienfarben und die Füllfarbe für die Visualisierung der Klasse im Diagramm einstellen.

source: For &UML; elements you can also open the properties dialog by double clicking on it if you are using the selection tool (arrow).
de: Für &UML;-Elemente kann man diesen Eigenschaftendialog durch einen Doppelklick auf das entsprechende Element mit dem Auswahlwerkzeug (Pfeil) aufrufen.

source: Note that you can also select the properties option from the context menu of the elements in the Tree View. This allows you to also edit the properties for the diagrams, like setting whether the grid should be shown or not.
de: Man kann den Eigenschaftendialog auch über das Kontextmenü in der Baumansicht erreichen. Dadurch kann man die Eigenschaften für Diagramme bearbeiten, zum Beispiel ob der Raster anzuzeigen ist oder nicht.

source: Editing Classes
de: Klassen bearbeiten

source: Even though editing the properties of all objects was already covered in the previous section, classes deserve a special section because they are a bit more complicated and have more options than most of the other &UML; elements.
de: Obwohl das Bearbeiten der Eigenschaften von Objekten bereits im letzten Abschnitt erörtert wurde, folgt ein weiterer Abschnitt zu Klassen, da sie komplizierter als alle anderen &UML;-Elemente sind.

source: In the properties dialog for a class you can set everything, from the color it uses to the operations and attributes it has.
de: Im Eigenschaftendialog der Klassen kann man alles von der Farbe bis zu den Operationen und Attributen bearbeiten.

source: Class General Settings
de: Allgemeine Klasseneinstellungen

source: The General Settings page of the properties dialog is self-explanatory. Here you can change the class' name, visibility, documentation, &etc; This page is always available.
de: Die Seite im Eigenschaftendialog für die allgemeinen Einstellungen ist selbsterklärend. Dort kann man den Klassennamen, die Sichtbarkeit, die Dokumentation &etc; ändern. Diese Seite ist immer verfügbar.

source: Class Attribute Settings
de: Attributeinstellungen von Klassen

source: In the Attributes Settings page you can add, edit, or delete attributes (variables) of the class. You can move attributes up and down the list by pressing the arrow button on the side. This page is always available.
de: Auf der Seite für die Attributeinstellungen kann man Attribute der Klasse hinzufügen, bearbeiten und löschen. Man kann weiterhin die Attribute in der Liste nach oben und nach unten über die Pfeile verschieben. Diese Seite ist ebenfalls immer verfügbar.

source: Class Operations Settings
de: Operationseinstellungen von Klassen

source: Similar to the Attribute Settings Page, in the Operation Settings Page you can add, edit, or remove operations for your class. When adding or editing an operation, you enter the basic data in the <emphasis>Operation Properties</emphasis> dialog. If you want to add parameters to your operation you need to click the <guibutton>New Parameter</guibutton> button, which will show the <emphasis>Parameter Properties</emphasis> dialog. This page is always available
de: Wie in der Seite für die Attributeinstellungen, kann man auf der Seite für die Operationseinstellungen Operationen hinzufügen, bearbeiten und aus der Klasse entfernen. Fügt man eine Operation hinzu oder verändert eine bestehende, dann geschieht dies über den Dialog <emphasis>Operationseigenschaften</emphasis>. Um einen neuen Parameter zu einer Operation hinzuzufügen, muss man den Knopf <guibutton>Neuer Parameter</guibutton> benutzen, der den Dialog <emphasis>Parametereigenschaften</emphasis> aufruft. Diese Seite ist immer verfügbar.

source: Class Template Settings
de: Einstellung für parametrisierbare Klasse

source: This page allows you to add class templates which are unspecified classes or datatypes. In Java 1.5 these will be called Generics.
de: Auf dieser Seite kann man Klassen-Vorlagen, das sind unspezifizierte Klassen und Datentypen, einfügen. In Java 1.5 werden sie unter der Bezeichnung Generics eingeführt.

source: Class Associations Page
de: Seite der Klassenassoziationen

source: The <guilabel>Class Associations</guilabel> page shows all the associations of this class in the current diagram. Double clicking on an association shows its properties, and depending on the type of association you may modify some parameters here such as setting multiplicity and Role name. If the association does not allow such options to be modified, the Association Properties dialog is read-only and you can only modify the documentation associated with this association.
de: Die Seite <guilabel>Assoziationen</guilabel> zeigt alle mit der Klasse verbundenen Assoziationen im aktuellen Diagramm. Ein Doppelklick auf eine Assoziation zeigt den entsprechenden Eigenschaftsdialog. Je nach Assoziationstyp kann man einige Parameter wie Multiplizität und Rollennamen ändern. Verfügt die gewählte Assoziation nicht über solche Parameter, dann ist der Eigenschaftendialog nicht änderbar und man kann lediglich die Dokumentation der Assoziation ändern.

source: This page is only available if you open the Class Properties from within a diagram. If you select the class properties from the context menu in the Tree View this page is not available.
de: Diese Seite ist nur verfügbar, wenn man die Klasseneigenschaften aus einem Diagramm heraus aufruft. Erfolgt hingegen der Aufruf aus der Baumansicht, ist diese Seite nicht verfügbar.

source: Class Display Page
de: Seite Anzeige

source: In the <guilabel>Display Options</guilabel> page, you can set what is to be shown in the diagram. A class can be shown as only one rectangle with the class name in it (useful if you have many classes in your diagram, or are for the moment not interested in the details of each class) or as complete as showing packages, stereotypes, and attributes and operations with full signature and visibility
de: In der Seite <guilabel>Anzeige</guilabel> kann man einstellen, wie die Klasse im Diagramm dargestellt wird. Eine Klasse kann zum Beispiel als einfaches Rechteck mit dem Namen dargestellt werden. Dies ist besonders nützlich, wenn man sehr viele Klassen im Diagramm hat, oder sich noch nicht für Details interessiert. Man kann aber auch die komplette Klasse mit Paketen, Stereotypen, Attributen und Operationen mit Signatur und Sichtbarkeit anzeigen lassen.

source: Depending on the amount of information you want to see you can select the corresponding options in this page. The changes you make here are only <emphasis>display options</emphasis> for the diagram. This means that <quote>hiding</quote> a class' operations only makes them not to be shown in the diagram, but the operation are still there as part of your model. This option is only available if you select the class properties from within a Diagram. If you open the class properties from the Tree View this page is missing since such Display Options do not make sense in that case
de: Je nach gewünschtem Informationsumfang, kann man die entsprechenden Optionen auf dieser Seite wählen. Die hier gemachten Einstellungen sind lediglich <emphasis>Anzeigeeinstellungen</emphasis> für das aktuelle Diagramm. Das bedeutet, <quote>ausgeblendete</quote> Operationen im Diagramm sind trotzdem weiterhin Teil des gesamten Modells. Diese Seite ist nur verfügbar, wenn der Eigenschaftendialog der Klasse aus einem Diagramm heraus aufgerufen wurde. Wird der Eigenschaftendialog lediglich aus der Baumansicht aufgerufen, fehlen die Darstellungseinstellungen logischerweise.

source: Class Style Page
de: Seite Klassenstil

source: In the <guilabel>Widget Style</guilabel> page you can configure the colors you want for the line and the fill of the widget. This option obviously makes sense only for classes displayed in diagrams, and is missing if you open the class' properties dialog from the Tree View.
de: Auf der Seite <guilabel>Stil der Bedienelemente</guilabel> kann man die Linienfarben und die Füllfarbe einstellen. Diese Seite ist nur verfügbar, wenn die Eigenschaften der Klasse aus einem Diagramm aufgerufen wurden und nicht aus der Baumansicht.

source: Associations
de: Assoziationen

source: Associations relate two &UML; objects to each other. Normally associations are defined between two classes, but some types of associations can also exists between use cases and actors.
de: Assoziationen bringen zwei &UML;-Elemente miteinander in Verbindung. Normalerweise werden Assoziationen zwischen Klassen definiert, aber einige können auch zwischen Anwendungsfällen und Akteuren angelegt werden.

source: To create an association select the appropriate tool from the Work Toolbar (generic Association, Generalization, Aggregation, &etc;) and single click on the first element participating in the association and then single click on the second item participating. Note that those are two clicks, one on each on the objects participating in the association, it is <emphasis>not</emphasis> a drag from one object to the other.
de: Um eine Assoziation anzulegen, ist das entsprechende Werkzeug aus der vertikalen Werkzeugleiste auszuwählen (zum Beispiel allgemeine Assoziation, Verallgemeinerung, Aggregation &etc;) und auf das Ausgangselement zu klicken. Danach muss man auf den 2. Partner der Assoziation klicken. Es handelt sich dabei um 2 Klicks und <emphasis>nicht</emphasis> um einen Klick mit anschließendem Ziehen von einem Element zum anderen!

source: If you try to use an association in a way against the &UML; specification &umbrello; will refuse to create the association and you will get an error message. This would be the case if, for example, a Generalization exists from class A to class B and then you try to create another Generalization from Class B to class A
de: Versucht man eine Assoziation anzulegen, die nicht mit den &UML;-Spezifikationen vereinbar ist, dann verhindert dies &umbrello; und gibt einen entsprechenden Hinweis aus. Dies ist zum Beispiel der Fall, wenn zwischen Klasse A und B eine Verallgemeinerung existiert und nun versucht wird, eine Verallgemeinerung von B nach A anzulegen.

source: <mousebutton>Right</mousebutton> clicking on an association will show a context menu with the actions you can apply on it. If you need to delete an association simply select the <guimenuitem>Delete</guimenuitem> option from this context menu. You can also select the <guimenuitem>Properties</guimenuitem> option and, depending on the association type edit attributes such as roles and multiplicity.
de: Durch einen <mousebutton>Rechtsklick</mousebutton> auf eine Assoziation erscheint ein Menü mit den Einträgen, die man auf die Assoziation anwenden kann. Um zum Beispiel eine Assoziation zu löschen, muss man den Eintrag <guimenuitem>Löschen</guimenuitem> aus dem Kontextmenü auswählen. Man kann über den Eintrag <guimenuitem>Eigenschaften</guimenuitem> je nach Typ der Assoziation in einem Dialog die Attribute der Assoziation wie Rollenname und Multiplizität ändern.

source: Anchor Points
de: Ankerpunkte

source: Associations are drawn, by default, as a straight line connecting the two objects in the diagram.
de: Assoziationen werden standardmäßig als durchgezogene Linie zwischen den beiden zu verbindenden Objekten im Diagramm gezeichnet.

source: You can add anchor points to bend an association by <mousebutton>double</mousebutton> clicking some where along the association line. This will insert an anchor point (displayed as a blue point when the association line is selected) which you can move around to give shape to the association
de: Man kann solch einen zusätzlichen Ankerpunkt durch einen <mousebutton>Doppelklick</mousebutton> auf die Assoziation an einer beliebigen Stelle einfügen. Diesen eingefügten Ankerpunkt (dargestellt durch einen blauen Punkt, wenn die Assoziation ausgewählt ist) kann man nun verschieben, um der Assoziation die gewünschte Form zu geben.

source: If you need to remove an anchor point, <mousebutton>double</mousebutton> click on it again to remove it
de: Um einen Ankerpunkt zu entfernen, muss man diesen lediglich <mousebutton>doppelt</mousebutton> mit der linken Maustaste anklicken.

source: Note that the only way to edit the properties of an association is through the context menu. If you try to <mousebutton>double</mousebutton> click on it as with other &UML; objects, this will only insert an anchor point.
de: Es ist zu beachten, dass man den Eigenschaftsdialog einer Assoziation lediglich über ihr Kontextmenü aufrufen kann. Ein <mousebutton>Doppelklick</mousebutton>, wie bei anderen &UML;-Elementen, fügt einen Ankerpunkt ein.

source: Notes, Text and Boxes
de: Textnotizen, Anmerkungen und Rahmen

source: Notes, Lines Of Text and Boxes are elements that can be present in any type of diagram and have no real semantic value, but are very helpful to add extra comments or explanations that can make your diagram easier to understand.
de: Textnotizen, Textzeilen und Rahmen sind Elemente, die in allen Diagrammtypen verfügbar sind. Sie haben keine inhaltliche Bedeutung für das Modell, sie können aber hilfreiche Kommentare und Erklärungen enthalten, die ein Diagramm leichter lesbar machen.

source: To add a Note or a Line Of Text, select the corresponding tool from the Work Toolbar and single click on the diagram where you want to put your comment. You can edit the text by opening the element through its context menu or in the case of notes by <mousebutton>double</mousebutton> clicking on them as well.
de: Um eine Textnotiz oder eine Textzeile einzufügen, wählt man das entsprechende Werkzeug aus der vertikalen Werkzeugleiste und klickt im Diagramm an die Stelle, wo das Kommentar erscheinen soll. Man kann den Text über das Kontextmenü ändern oder im Fall von Textnotizen durch einen <mousebutton>Doppelklick</mousebutton> auf den Text.

source: Anchors
de: Anker

source: Anchors are used to link a text note and another &UML; Element together. For example, you normally use a text note to explain or make some comment about a class or a particular association, in which case you can use the anchor to make it clear that the note <quote>belongs</quote> to that particular element.
de: Mit Ankern kann man ein &UML;-Element mit einer Textnotiz verbinden. Möchte man zum Beispiel mit einer Textnotiz einige Hinweise über eine Klasse angeben, dann verbindet man diese Textnotiz mit der Klasse. Dadurch ist ersichtlich, dass die Textnotiz sich auf das entsprechende Element <quote>bezieht</quote>.

source: To add an anchor between a note and another &UML; element, use the anchor tool from the work toolbar. You first need to click on the note and then click on the &UML; element you want the note to be linked to.
de: Um einen Anker zwischen einer Textnotiz und einem &UML;-Element einzufügen, muss man das entsprechende Werkzeug von der vertikalen Werkzeugleiste wählen. Zuerst klickt man auf die gewünschte Textnotiz und mit dem zweiten Klick auf das zu verknüpfende &UML;-Element.
