Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdesdk/umbrello_working_with_umbrello.po
Languages: de

source: Working with &umbrello;
de: Mit &umbrello; arbeiten

source: This chapter will introduce you to &umbrello;'s user interface and will tell you all you need to know to start modelling. All actions in &umbrello; are accessible via the menu and the toolbars, but &umbrello; also makes extensive use of &RMB; context menus. You can &RMB; click on almost any element in &umbrello;'s work area or tree view to get a menu with the most useful functions that can be applied to the particular element you are working on. Some users find this a little confusing at the beginning because they are more used to working with the menu or tool bars, but once you get used to <mousebutton>right</mousebutton> clicking it will greatly speed up your work.
de: Dieses Kapitel gibt eine Einführung in die Oberfläche von &umbrello; und vermittelt alle Kenntnisse, um sofort mit der Modellierung anzufangen. Wie normalerweise üblich, sind (fast) alle Aktionen über &umbrello;s Menüs und Werkzeugleisten erreichbar. Allerdings nutzt &umbrello; ebenfalls sehr stark die über rechte Maustaste erreichbaren Kontextmenüs. Man kann fast auf jedes Element in &umbrello;s Arbeitsbereich oder Baumansicht mit der rechten Maustaste klicken, um für das gewählte Element sinnvoll erscheinende Funktionen zu erreichen. Für einige Benutzer ist dies am Anfang sehr verwirrend, da sie meist die Arbeit über Menüs und Werkzeugleisten gewöhnt sind. Aber hat man sich erst einmal an den <mousebutton>Rechtsklick</mousebutton> gewöhnt, kann man sein Arbeitstempo wesentlich erhöhen.

source: User Interface
de: Benutzeroberfläche

source: &umbrello;'s main window is divided in three areas that will help you keep an overview of your entire system and access the different diagrams quickly while working on your model.
de: &umbrello;s Hauptfenster unterteilt sich in 3 Bereiche, die dabei helfen den Überblick über das gesamte System zu wahren, verschiedene Diagramme schnell aufzurufen und letztendlich am Modell zu arbeiten.

source: These areas are called:
de: Diese Bereiche werden folgendermaßen bezeichnet:

source: <para>Tree View</para>
de: <para>Baumansicht</para>

source: <para>Work Area</para>
de: <para>Arbeitsbereich</para>

source: Documentation and Command history Window
de: Dokumentation und Befehlsverlauf

source: <screeninfo>&umbrello;'s User Interface</screeninfo>
de: <screeninfo>&umbrello;s Benutzeroberfläche</screeninfo>

source: <phrase>&umbrello;'s User Interface</phrase>
de: <phrase>&umbrello;s Benutzeroberfläche</phrase>

source: <para>&umbrello;'s User Interface</para>
de: <para>&umbrello;s Benutzeroberfläche</para>

source: <title>Tree View</title>
de: <title>Baumansicht</title>

source: The Tree View is usually located on the top left hand side of the window and shows the all the diagrams, classes, actors and use cases that build up your model. The Tree View allows you to have a quick overview of the elements composing your model. The Tree View also gives you a quick way to switch between the different diagrams in your model and inserting elements from your model into the current diagram.
de: Die Baumansicht befindet sich am oberen linken Rand des Fensters und zeigt alle Diagramme, Klassen, Akteure und Anwendungsfälle, aus denen das Modell besteht. Mit der Baumansicht bekommt man einen schnellen Überblick über die Elemente, die das System formen. Weiterhin kann man mit der Baumansicht sehr elegant zwischen den einzelnen Diagrammen wechseln und Elemente aus dem Modell in das aktuelle Diagramm einfügen.

source: If you are working on a model with more than just a few classes and diagrams, the Tree View may help you stay on top of things by organizing your model elements in folders. You can create folders by selecting the appropriate option from the context menu (&RMB; click on one of the folders in the tree view) and you can organize your elements by moving them to the appropriate folder (drag and drop)
de: Besteht das Modell aus vielen Klassen und Diagrammen, hilft die Baumansicht bei der Wahrung der Übersicht, indem man das Modell mittels Ordnern besser organisiert. Man kann Ordner anlegen, indem man vom Kontextmenü (Klick mit rechter Maustaste auf ein Ordnerelement in der Baumansicht) den entsprechenden Befehl wählt. Die Elemente kann man einfach in die gewünschten Ordner mittels Drag'n Drop (Ziehen und Ablegen) verschieben.

source: Documentation and Command History Window
de: Dokumentation und Befehlsverlauf

source: The Documentation and Command history Window is the small window located on the left bottom of &umbrello;, and it gives you a quick preview of the documentation for the currently selected item and the command history of your work session. The Documentation Window is rather small because it is intended to allow you just a quick pick into the element's documentation and the overview of the command history while taking as little screen space as possible. If you need to view the documentation in more detail you can always open the item's properties.
de: Das Dokumentation und Befehlsverlauf wird am unteren linken Rand des &umbrello;-Fensters. Es zeigt eine Überblick der für das aktuell gewählte Objekt hinterlegten Dokumentation und den Befehlsverlauf der Arbeitssitzung. Das Dokumentationsfenster ist sehr klein, da es nur einen kurzen Einblick in die hinterlegte Dokumentation und einen Überblick des Befehlsverlaufs geben soll. Die komplette Dokumentation ist natürlich über die Eigenschaften des Elementes verfügbar.

source: <title>Work Area</title>
de: <title>Arbeitsbereich</title>

source: The Work Area is the main window in &umbrello; and is where the real action takes place. You use the Work Area to edit and view the diagrams in your model. The Work Area shows the currently active diagram. Currently only one diagram can be shown on the Work Area at any time.
de: Der Arbeitsbereich ist der Hauptteil des Fensters. Hier findet die eigentliche Arbeit statt. Er wird zum bearbeiten und anschauen der im Modell hinterlegten Diagramme genutzt. Der Arbeitsbereich zeigt das aktuell aktive Diagramm. Momentan kann immer nur 1 Diagramm im Arbeitsbereich zu einem Zeitpunkt dargestellt werden.

source: Creating, Loading and Saving Models
de: Erstellen, Laden und Speichern von Modellen

source: The first thing you need to start doing something useful with &umbrello; is to create a model to work on. When you start &umbrello; it always loads the last used model or creates a new, empty model (depending on your preferences set in the configuration dialog). This will allow you to start working right away.
de: Um etwas Sinnvolles mit &umbrello; machen zu können, muss man zuerst ein Modell anlegen, an dem man arbeiten kann. Während &umbrello;s Start wird entweder das zuletzt bearbeitete Modell geladen oder ein neues leeres Modell angelegt. Die hängt von den Einstellungen im Einstellungsfenster ab. Dadurch kann man sofort mit der gewünschten Arbeit beginnen.

source: New Model
de: Neues Modell

source: If at any time you need to create a new model you can do this by selecting the <guimenuitem>New</guimenuitem> entry from the <guimenu>File</guimenu> menu, or by clicking on the <guiicon>New</guiicon> icon from the application toolbar. If you are currently working on a model which has been modified &umbrello; will ask you if it should save your changes before loading the new model.
de: Um zu irgendeinem Zeitpunkt ein neues Modell anzulegen, wählt man <guimenuitem>Neu</guimenuitem> aus dem Menü <guimenu>Datei</guimenu> oder klickt auf das Symbol <guiicon>Neu</guiicon> in der horizontalen Werkzeugleiste. Arbeitet man gerade an einem Modell, fragt &umbrello; zuerst nach, ob man das aktuelle Modell nicht speichern will, bevor man ein neues Element anlegt.

source: Save Model
de: Modell speichern

source: You can save your model at any time by selecting the option <guimenuitem>Save</guimenuitem> from the <guimenu>File</guimenu> Menu or by clicking on the <guiicon>Save</guiicon> button from the application toolbar. If you need to save your model under a different name you can use the option <guimenuitem>Save As</guimenuitem> from the <guimenu>File</guimenu> Menu.
de: Man kann zu jedem Zeitpunkt das Modell speichern indem man den Eintrag <guimenuitem>Speichern</guimenuitem> aus dem Menü <guimenu>Datei</guimenu> wählt, oder auf das entsprechende Symbol in der horizontalen Werkzeugleiste klickt. Soll das Modell unter einem anderen Dateinamen gespeichert werden, wählt man den Eintrag <guimenuitem>Speichern unter ...</guimenuitem> aus dem Menü <guimenu>Datei</guimenu>.

source: For your convenience &umbrello; also offers you the option to automatically save your work each certain time period. You can configure if you want this option as well as the time intervals in the <guimenu>Settings</guimenu> from &umbrello;
de: Zur Absicherung bietet &umbrello; die Möglichkeit, das Modell automatisch nach einem bestimmten Zeitabschnitt zu speichern. Man kann diese Möglichkeit und das Zeitintervall in &umbrello;s <guimenu>Einstellungen</guimenu> definieren.

source: Load Model
de: Modell laden

source: For loading an already existing model you may select the option <guimenuitem>Open</guimenuitem> from the <guimenu>File</guimenu> Menu or click on the <guiicon>Open</guiicon> icon from the application toolbar. The most recently used models are also available under the submenu <guimenuitem>Open Recent</guimenuitem> in the <guimenu>File</guimenu> Menu to speed up access to your most frequently used models.
de: Um ein bereits existierendes Modell zu laden, muss man <guimenuitem>Öffnen</guimenuitem> aus dem Menü <guimenu>Datei</guimenu> oder das entsprechende Symbol aus der horizontalen Werkzeugleiste wählen. Die zuletzt bearbeiteten Modelle sind ebenfalls über das Untermenü <guimenuitem>Zuletzt geöffnete Dateien</guimenuitem> im Menü <guimenu>Datei</guimenu> verfügbar. Dadurch kann man häufig verwendete Modelle wesentlich schneller aufrufen.

source: &umbrello; can only work on one model at a time, so if you ask the program to load a model for you and your current model has been modified since the last time you save it, &umbrello; will ask you whether your changes should be saved to prevent any loss of work. You can start two or more instances of &umbrello; at any one time, you can also copy and paste between instances.
de: Mit &umbrello; kann man immer nur an einem Modell gleichzeitig arbeiten. Fordert man das Programm zum Laden eines anderen Modells auf und wurde das momentan bearbeitete Modell seit dem letzten Speichern verändert, fragt &umbrello; nach, ob man die Änderungen nicht zuerst speichern will. Dadurch wird ein möglicher Datenverlust verhindert. Man kann aber mehrere Instanzen von &umbrello; starten und auch zwischen den Instanzen Objekte kopieren und einfügen.

source: Editing Models
de: Modelle bearbeiten

source: In &umbrello;, there are basically two ways for editing the elements in your model.
de: In &umbrello; gibt es prinzipiell 2 Möglichkeiten die Elemente des Modells zu verändern.

source: Edit model elements directly through the Tree View
de: Man kann die Elemente direkt in der Baumansicht bearbeiten.

source: Edit model elements through a Diagram
de: Man kann die Elemente in den Diagrammen bearbeiten.

source: Using the context menu of the different items in the Tree View you are able to add, remove, and modify almost all the elements in your model. <mousebutton>Right</mousebutton> clicking on the folders in the Tree View will give you options for creating the different types of diagrams as well as, depending on whether the folder is a <emphasis>Use Case View</emphasis> or a <emphasis>Logical View</emphasis>, Actors, Use Cases, Classes, etc.
de: Über das mit der rechten Maustaste erreichbare Kontextmenü kann man in der Baumansicht fast alle Elemente des Modells hinzufügen, entfernen oder verändern. Klickt man zum Beispiel mit der <mousebutton>rechten</mousebutton> Maustaste auf einen Ordner in der Baumansicht, kann man eines der verschiedenen Diagramme sowie Akteure, Klassen und Anwendungsfälle anlegen, je nachdem ob der Ordner der <emphasis>logischen Sicht</emphasis> oder der <emphasis>Anwendungsfallsicht</emphasis> untergeordnet ist.

source: Once you have added elements to your model you can also edit an element by accessing its properties dialog, which you find by selecting the option <emphasis>Properties</emphasis> from the context menu shown when <mousebutton>right</mousebutton> clicking on the items in the Tree View.
de: Nachdem man ein Element dem Modell hinzugefügt hat, kann man seine Eigenschaften über den Eigenschaftendialog ändern. Diesen erreicht man über den Punkt <emphasis>Eigenschaften</emphasis> aus dem Kontextmenü des jeweiligen Elements.

source: You can also edit your model by creating or modifying elements through diagrams. More details on how to do this are given in the following sections.
de: Weiterhin kann man das Modell durch das Anlegen und Ändern von Elementen in den Diagrammen bearbeiten. Weitere Details, wie das geht, sind in den folgenden Abschnitten zu finden.

source: Adding and Removing Diagrams
de: Diagramme hinzufügen und entfernen

source: Your &UML; model consists of a set of &UML; elements and associations between them. However you cannot see the model directly, you use <emphasis>Diagrams</emphasis> to look at it.
de: Das &UML;-Modell besteht aus &UML;-Elementen und den Assoziationen zwischen diesen. Man kann aber das Modell nicht direkt sehen, sondern man nutzt <emphasis>Diagramme</emphasis>, um es zu betrachten.

source: Creating Diagrams
de: Diagramme anlegen

source: To create a new diagram in your model simply select the diagram type you need from the <guimenuitem>New</guimenuitem> submenu in the <guimenu>Diagram</guimenu> menu and give a name to it. The diagram will be created and made active, and you will immediately see it in the tree view.
de: Um ein neues Diagramm dem Modell hinzufügen, muss man lediglich den Diagrammtyp aus dem Untermenü <guimenuitem>Neu</guimenuitem> aus dem Menü <guimenu>Diagramm</guimenu> wählen und dem Kind einen Namen geben. Das Diagramm wird angelegt und als aktives Diagramm für den Arbeitsplatz ausgewählt. Es taucht sofort in der Baumansicht auf.

source: Remember that &umbrello; makes extensive use of context menus: you can also &RMB; click on a folder in the Tree View and select the appropriate diagram type from the <guisubmenu>New</guisubmenu> submenu in the context menu. Note that you can create Use Case Diagrams only in Use Case View folders, and the other types of diagram can only be created in the Logical View folders.
de: Man sollte sich daran erinnern, dass &umbrello; sehr starken Gebrauch von den Kontextmenüs, erreichbar über die rechte Maustaste, macht. So kann man auf einen Ordner in der Baumansicht mit der rechten Maustaste klicken und aus dem Untermenü <guisubmenu>Neu</guisubmenu> den gewünschten Typ auswählen. Es ist zu beachten, dass man in der Anwendungsfallsicht lediglich Anwendungsfalldiagramme hinzufügen kann und in der logischen Sicht alle anderen Diagrammtypen.

source: Removing Diagrams
de: Diagramme entfernen

source: Should you need to remove a diagram from your model, you can do this by making it active and selecting <guimenuitem>Delete</guimenuitem> from the <guimenu>Diagram</guimenu> Menu. You can also achieve this by selecting <guimenuitem>Delete</guimenuitem> from the diagrams context menu in the Tree View
de: Will man ein Diagramm aus dem Modell entfernen, muss man es aktivieren und dann <guimenuitem>Löschen</guimenuitem> aus dem Menü <guimenu>Diagramm</guimenu> aufrufen. Man kann dies ebenfalls über den Eintrag <guisubmenu>Löschen</guisubmenu> im Kontextmenü des entsprechenden Diagramms in der Baumansicht machen.

source: Since deleting a diagram is something serious that could cause loss of work if done by accident, &umbrello; will ask you to confirm the delete operation before actually removing the Diagram. Once a diagram has been deleted and the file has been saved there is no way to undo this action.
de: Da das Löschen eines Diagramms ein ernster Eingriff ist, der Datenverlust verursachen kann, falls es unbeabsichtigt passiert, fragt &umbrello; um Bestätigung, bevor die Löschoperation ausgeführt wird. Wurde das Diagramm einmal gelöscht und die Datei gespeichert, gibt es keine Möglichkeit, die Aktion rückgängig zu machen!

source: Renaming Diagrams
de: Diagramme umbenennen

source: If you want to change the name of an existing diagram you can easily do this by selecting the Rename option from its &RMB; menu in the Tree View.
de: Will man ein Diagramm umbenennen, kann man dies durch den Eintrag <guisubmenu>Umbenennen</guisubmenu> im Kontextmenü des Diagramms in der Baumansicht erreichen.

source: Another way to rename a diagram is to do this via its properties dialog, which you obtain by selecting Properties from its Context Menu or by double clicking on it in the Tree View.
de: Ein anderer Weg ist der Eigenschaftendialog des Diagramms, der durch den Eintrag Eigenschaften aus dem über die rechte Maustaste erreichbaren Kontextmenüs des Diagramms aufgerufen werden kann. Weiterhin kann man in der Baumansicht mit einem Doppelklick auf das Diagramm den Eigenschaftendialog ebenfalls aufrufen.

source: Editing Diagrams
de: Diagramme bearbeiten

source: When working on a diagram, &umbrello; will try to guide you by applying some simple rules as to which elements are valid in the different types of diagrams, as well as the relationships that can exist between them. If you are an &UML; expert you will probably not even notice it, but this will help &UML; novices create standard-conformant diagrams.
de: Während der Arbeit mit Diagrammen versucht &umbrello; einen durch die Anwendung einfacher Regeln zu unterstützen, indem nur die möglichen Elemente in einem Diagramm zur Verfügung stehen und nur die sinnvollen Beziehungen zwischen diesen angelegt werden können. Als &UML;-Experte wird man dies vielleicht gar nicht bemerken, für Anfänger ist es eine große Unterstützung bei der Erstellung von standardkonformen Diagrammen.

source: Once you have created your diagrams it is time to start editing them. Here you should notice the (for beginners subtle) difference between editing your diagram, and editing the <emphasis>model</emphasis>. As you already know, Diagrams are <emphasis>views</emphasis> of your model. For example, if you create a class by editing a Class Diagram, you are really editing both, your Diagram and your model. If you change the color or other display options of a Class in your Class Diagram, you are only editing the Diagram, but nothing is changed in your model.
de: Nachdem man ein Diagramm angelegt hat, kann man es bearbeiten. Es ist dabei der Unterschied zwischen Diagramm- und Modellbearbeitung, für Anfänger schwieriger verständlich, zu beachten. Wie bereits dargelegt wurde, sind Diagramme eine <emphasis>Sicht</emphasis> auf das <emphasis>Modell</emphasis>. Legt man zum Beispiel in einem Klassendiagramm eine Klasse an, dann bearbeitet man eigentlich sowohl Modell wie auch Diagramm. Ändert man hingegen lediglich die Farbe oder andere Darstellungsoptionen einer Klasse in einem Klassendiagramm, dann wird dadurch lediglich das Diagramm, aber nicht das Modell verändert.

source: Insert Elements
de: Elemente einfügen

source: One of the first things you will do when editing a new diagram is to insert elements into them (Classes, Actors, Use Cases, &etc;) There is basically two ways of doing this:
de: Eines der ersten Dinge mit einem neuen Diagramm ist es, Elemente wie Klassen, Akteure oder Anwendungsfälle einzufügen. Es gibt prinzipiell 2 Möglichkeiten, wie dies geschehen kann.

source: Dragging existing elements in your model from the Tree View
de: Existierende Elemente aus der Baumansicht in das Diagramm schieben.

source: Creating new elements in your model and adding them to your diagram at the same time, by using one of the edit Tools in the Work Toolbar
de: Ein neues Element mithilfe der Werkzeuge in der vertikalen Werkzeugleiste anlegen und gleichzeitig dem aktiven Diagramm hinzuzufügen.

source: To insert elements that already exist in your model, just drag them from the Tree View and drop them where you want them to be in your diagram. You can always move elements around in your Diagram using the Select Tool
de: Um ein im Modell bereits existierendes Element in das aktuelle Diagramm einzufügen, muss man es lediglich von der Baumansicht in das Diagramm an die gewünschte Stelle ziehen. Man kann das Element jederzeit mit dem Auswahlwerkzeug im Diagramm verschieben.

source: The second way of adding elements to your diagram is by using the Work Toolbar's edit tools (note that this will also add the elements to your model).
de: Die zweite Möglichkeit Elemente hinzuzufügen ist es, eines der Werkzeuge aus der vertikalen Werkzeugleiste am rechten Bildschirmrand zu benutzen. Dabei wird das Element ebenfalls dem Modell hinzugefügt.

source: The Work Toolbar was by default located on the top of the window. The tools available on this toolbar (the buttons you see on it) change depending on the type of diagram you are currently working on. The button for the currently selected tool is activated in the toolbar. You can switch to the select tool by pressing the &Esc; key.
de: Die Diagramm-Werkzeugleiste befindet sich standardmäßig am oberen Fenster des Anwendungsfensters, man kann sie allerdings an andere Stellen verschieben oder sie über allen anderen Bereichen schwebend positionieren. Die in dieser Werkzeugleiste verfügbaren Werkzeuge, dargestellt durch die verschiedenen Knöpfe, ändern sich je nach momentan bearbeiteten Diagrammtyp. Das momentan gewählte Werkzeug wird hervorgehoben in der Werkzeugleiste dargestellt. Über die Taste &Esc; kann man das Auswahl-Werkzeug auswählen.

source: When you have selected an edit tool from the Work Toolbar (for example, the tool to insert classes) the mouse pointer changes to a cross, and you can insert the elements in your model by single clicking in your diagram. Note that elements in &UML; must have a <emphasis>Unique Name</emphasis>. So that if you have a class in one diagram whose name is <quote>ClassA</quote> and then you use the insert Class tool to insert a class into another diagram you cannot name this new class <quote>ClassA</quote> as well. If these two are supposed to be two different elements, you have to give them a unique name. If you are trying to add the <emphasis>same</emphasis> element to your diagram, then the Insert Class is not the right tool for that. You should drag and drop the class from the Tree View instead.
de: Hat man ein Bearbeitungswerkzeug aus der Werkzeugleiste ausgewählt, zum Beispiel um eine Klasse einzufügen, ändert sich der Mauszeiger in ein Kreuz. Man kann nun das Element in das Diagramm über einen einzelnen Klick mit der linken Maustaste im Diagramm einfügen. &UML;-Elemente müssen immer <emphasis>eindeutige Namen</emphasis> haben. Gibt es zum Beispiel in einem Diagramm die Klasse <quote>KlasseA</quote>, dann kann man in einem anderen Diagramm keine neue Klasse mit dem gleichen Namen einfügen. Soll es sich bei den beiden Klassen um unterschiedliche Elemente handeln, dann müssen diese auch unterschiedliche Namen haben. Um das <emphasis>gleiche</emphasis> Element nochmals einzufügen, ist das Werkzeug Klasse einfügen nicht das richtige Hilfsmitteln. Man muss in solch einem Fall lediglich die gewünschte Klasse aus der Baumansicht in das Diagramm ziehen.

source: Deleting Elements
de: Elemente löschen

source: You can delete any element by selecting the option <guimenuitem>Delete</guimenuitem> from its context menu.
de: Man kann jedes Element über den Eintrag <guimenuitem>Löschen</guimenuitem> aus dem Kontextmenü entfernen.
