Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdesdk/umbrello_uml_basics.po
Languages: de

source: &UML; Basics
de: &UML;-Grundlagen

source: About &UML;
de: Über &UML;

source: This chapter will give you a quick overview of the basics of &UML;. Keep in mind that this is not a comprehensive tutorial on &UML; but rather a brief introduction to &UML; which can be read as a &UML; tutorial. If you would like to learn more about the Unified Modelling Language, or in general about software analysis and design, refer to one of the many books available on the topic. There are also a lot of tutorials on the Internet which you can take as a starting point.
de: Dieses Kapitel gibt einen kurzen Überblick über die &UML;-Grundlagen. Man sollte sich aber bewusst sein, dass es keine vollständige &UML;-Anleitung ist. Wenn man mehr über die Unified Modelling Language, oder allgemein über Software Analyse und Design, lernen will, dann sollte man eines der vielen zu diesem Thema publizierten Bücher lesen. Man kann natürlich die vielen Einführungen im Internet zum Thema als Ausgangspunkt wählen.

source: The Unified Modelling Language (&UML;) is a diagramming language or notation to specify, visualize and document models of Object Oriented software systems. &UML; is not a development method, that means it does not tell you what to do first and what to do next or how to design your system, but it helps you to visualize your design and communicate with others. &UML; is controlled by the Object Management Group (<acronym>OMG</acronym>) and is the industry standard for graphically describing software.
de: Die Unified Modelling Language (&UML;) ist eine Diagrammnotation zum spezifizieren, visualisieren und dokumentieren von Modellen objektorientierter Softwaresysteme. &UML; ist kein Vorgehensmodell, d.h. es sagt nichts über die einzelnen Schritte aus, die nötig sind, um ein System zu gestalten. Aber &UML; hilft ihnen ihr Design zu visualisieren und mit anderen zu kommunizieren. Der &UML;-Standard wird von der Object Management Group (<acronym>OMG</acronym>) gepflegt und ist der Industriestandard zur Beschreibung von Softwaremodellen.

source: &UML; is designed for Object Oriented software design and has limited use for other programming paradigms.
de: &UML; wurde für das objektorientierte Softwaredesign entwickelt und ist daher nur von begrenztem Nutzen bei anderen Programmierparadigmen.

source: &UML; is composed of many model elements that represent the different parts of a software system. The &UML; elements are used to create diagrams, which represent a certain part, or a point of view of the system. The following types of diagrams are supported by &umbrello;:
de: &UML; setzt sich zusammen aus vielen Modellelementen, die für sich einen bestimmten Sachverhalt des Softwaresystems repräsentieren. Diese Elemente werden zu Diagrammen kombiniert, die einen Ausschnitt oder einen bestimmten Blickpunkt auf das System darstellen. Folgende Diagrammtypen werden von &umbrello; unterstützt:

source: <emphasis><link linkend="use-case-diagram">Use Case Diagrams</link></emphasis> show actors (people or other users of the system), use cases (the scenarios when they use the system), and their relationships
de: <emphasis><link linkend="use-case-diagram">Anwendungsfalldiagramm</link> </emphasis>, stellt Akteure (Menschen oder andere Benutzer des Systems), Anwendungsfälle (Szenario, wie die Akteure das System nutzen) und die Beziehungen dazwischen dar

source: <emphasis><link linkend="class-diagram">Class Diagrams</link></emphasis> show classes and the relationships between them
de: <emphasis><link linkend="class-diagram">Klassendiagramm</link></emphasis>, stellt Klassen und ihre Beziehungen untereinander dar

source: <emphasis><link linkend="sequence-diagram">Sequence Diagrams</link></emphasis> show objects and a sequence of method calls they make to other objects.
de: <emphasis><link linkend="sequence-diagram">Sequenzdiagramm</link></emphasis>, stellt Objekte und ihre Beziehungen dar, wobei der Schwerpunkt auf dem chronologischen Nachrichtenaustausch zwischen den Objekten liegt

source: <emphasis><link linkend="collaboration-diagram">Collaboration Diagrams</link></emphasis> show objects and their relationship, putting emphasis on the objects that participate in the message exchange
de: <emphasis><link linkend="collaboration-diagram">Kollaborationsdiagramm </link></emphasis>, stellt Objekte und ihre Beziehungen dar, wobei der Schwerpunkt auf Objekten liegt, die am Nachrichtenaustausch beteiligt sind

source: <emphasis><link linkend="state-diagram">State Diagrams</link></emphasis> show states, state changes and events in an object or a part of the system
de: <emphasis><link linkend="state-diagram">Zustandsdiagramm</link> </emphasis>, stellt Zustände, Zustandsänderungen und Ereignisse in einem Objekt oder Teilsystem dar

source: <emphasis><link linkend="activity-diagram">Activity Diagrams</link></emphasis> show activities and the changes from one activity to another with the events occurring in some part of the system
de: <emphasis><link linkend="activity-diagram">Aktivitätsdiagram</link> </emphasis>, stellt die Aktivitäten, Zustände und Zustandsänderungen von Objekten und die Ereignisse in Teilsystemen dar

source: <emphasis><link linkend="component-diagram">Component Diagrams</link></emphasis> show the high level programming components (such as KParts or Java Beans).
de: <emphasis><link linkend="component-diagram">Komponentendiagramm</link> </emphasis>, stellt die höheren Programmierkomponenten (wie KParts und Java Beans) dar.

source: <emphasis><link linkend="deployment-diagram">Deployment Diagrams</link></emphasis> show the instances of the components and their relationships.
de: <emphasis><link linkend="deployment-diagram">Verteilungsdiagramm</link></emphasis> , stellt die Instanzen der Komponenten und ihre Beziehungen dar.

source: <emphasis><link linkend="entity-relationship-diagram">Entity Relationship Diagrams</link></emphasis> show data and the relationships and constraints between the data.
de: <emphasis><link linkend="class-diagram">Entitäten-Beziehungs-Diagramm</link></emphasis>, stellt Daten und ihre Beziehungen beziehungsweise Einschränkungen untereinander dar.

source: &UML; Elements
de: &UML;-Elemente

source: Use Case Diagram
de: Anwendungsfalldiagramm

source: Use Case Diagrams describe the relationships and dependencies between a group of <emphasis>Use Cases</emphasis> and the Actors participating in the process.
de: Anwendungsfalldiagramme beschreiben die Beziehungen und Abhängigkeiten zwischen einer Gruppe von <emphasis>Anwendungsfällen</emphasis> und den teilnehmenden Akteuren in einem Prozess.

source: It is important to notice that Use Case Diagrams are not suited to represent the design, and cannot describe the internals of a system. Use Case Diagrams are meant to facilitate the communication with the future users of the system, and with the customer, and are specially helpful to determine the required features the system is to have. Use Case Diagrams tell, <emphasis>what</emphasis> the system should do but do not &mdash; and cannot &mdash; specify <emphasis>how</emphasis> this is to be achieved.
de: Dabei ist zu beachten, dass ein Anwendungsfalldiagramm nicht das Systemdesign widerspiegelt und damit keine Aussage über die Systeminterna trifft. Anwendungsfalldiagramme werden zur Vereinfachung der Kommunikation zwischen Entwickler und zukünftigen Benutzer bzw. Kunde erstellt. Sie sind vor allem bei der Festlegung der benötigten Kriterien des zukünftigen Systems hilfreich. Somit treffen Anwendungsfalldiagramme eine Aussage, <emphasis>was</emphasis> zu tun ist, aber nicht <emphasis>wie</emphasis> wie das erreicht wird.

source: An example Use Case diagram.
de: Ein beispielhaftes Anwendungsfalldiagramm.

source: <phrase>&umbrello; showing a Use Case Diagram</phrase>
de: <phrase>&umbrello; bei der Darstellung eines Anwendungfalldiagramms</phrase>

source: <para>&umbrello; showing a Use Case Diagram</para>
de: <para>&umbrello; bei der Darstellung eines Anwendungfalldiagramms</para>

source: Use Case
de: Anwendungsfall

source: A <emphasis>Use Case</emphasis> describes &mdash; from the point of view of the actors &mdash; a group of activities in a system that produces a concrete, tangible result.
de: Ein <emphasis>Anwendungsfall</emphasis> beschreibt, aus der Sicht des Akteurs eine Reihe von Aktivitäten im System, die ein konkret fassbares Ergebnis liefern.

source: Use Cases are descriptions of the typical interactions between the users of a system and the system itself. They represent the external interface of the system and specify a form of requirements of what the system has to do (remember, only what, not how).
de: Anwendungsfälle dienen als Beschreibung von typischen Interaktionen zwischen Benutzer und dem System. Sie stellen die externe Schnittstelle dar und spezifizieren damit die Anforderungen, was das System zu tun hat (nur das was, aber nicht das wie!).

source: When working with Use Cases, it is important to remember some simple rules:
de: Bei der Arbeit mit Anwendungsfällen, sollte man folgende einfache Regeln beachten:

source: Each Use Case is related to at least one actor
de: jeder Anwendungsfall ist mindestens mit einem Akteur verbunden

source: Each Use Case has an initiator (&ie; an actor)
de: jeder Anwendungsfall hat einen Auslöser (also einen Akteur)

source: Each Use Case leads to a relevant result (a result with <quote>business value</quote>)
de: jeder Anwendungsfall führt zu einem relevanten Ergebnis (<quote>messbar und wirtschaftlich relevant</quote>)

source: Use Cases can also have relationships with other Use Cases. The three most typical types of relationships between Use Cases are:
de: Anwendungsfälle können untereinander in Verbindung stehen. Die 3 gebräuchlichsten Beziehungen zwischen Anwendungsfällen sind:

source: <emphasis>&lt;&lt;include&gt;&gt;</emphasis> which specifies that a Use Case takes place <emphasis>inside</emphasis> another Use Case
de: <emphasis>&lt;&lt;include&gt;&gt;</emphasis>, wodurch ausgesagt wird, dass ein Anwendungsfall <emphasis>in</emphasis> einem anderen Anwendungsfall stattfindet.

source: <emphasis>&lt;&lt;extends&gt;&gt;</emphasis> which specifies that in certain situations, or at some point (called an extension point) a Use Case will be extended by another.
de: <emphasis>&lt;&lt;extends&gt;&gt;</emphasis>, wodurch ausgesagt wird, dass in einer bestimmten Situation (oder einem bestimmten Erweiterungspunkt) der Anwendungsfall durch einen anderen erweitert wird.

source: <emphasis>Generalization</emphasis> specifies that a Use Case inherits the characteristics of the <quote>Super</quote>-Use Case, and can override some of them or add new ones in a similar way as the inheritance between classes.
de: <emphasis>Verallgemeinerung</emphasis>, wodurch ausgesagt wird, dass ein Anwendungsfall die Eigenschaften eines <quote>Super</quote>anwendungsfalls (übergeordneten) erbt und diese überschreiben oder erweitern kann, ganz ähnlich wie bei der Vererbung zwischen Klassen.

source: Actor
de: Akteur

source: An actor is an external entity (outside of the system) that interacts with the system by participating (and often initiating) a Use Case. Actors can be in real life people (for example users of the system), other computer systems or external events.
de: Ein Akteur ist ein externes Objekt (außerhalb des Systems), welches mit dem System durch die Teilnahme und Auslösung von Anwendungsfällen in Kontakt tritt. Akteure können echte Menschen (&eg; der Benutzer des Systems), Computersysteme oder externe Ereignisse sein.

source: Actors do not represent the <emphasis>physical</emphasis> people or systems, but their <emphasis>role</emphasis>. This means that when a person interacts with the system in different ways (assuming different roles) he will be represented by several actors. For example a person that gives customer support by the telephone and takes orders from the customer into the system would be represented by an actor <quote>Support Staff</quote> and an actor <quote>Sales Representative</quote>
de: Akteure stellen somit nicht die <emphasis>physische</emphasis> Person oder System dar, sondern vielmehr die <emphasis>Rollen</emphasis> dieser Objekte. Steht eine physische Person auf verschiedenen Wegen (&eg; durch verschiedene Rollen) mit dem System in Kontakt, dann wird sie durch verschiedene Akteure dargestellt. So würde eine Person, die im Kundensupport genauso wie in der Auftragsannahme tätig ist, einmal als Akteur <quote>Supportmitarbeiter</quote> und einmal als Akteur <quote>Vertriebsmitarbeiter</quote> dargestellt werden.

source: Use Case Description
de: Anwendungsfallbeschreibung

source: Use Case Descriptions are textual narratives of the Use Case. They usually take the form of a note or a document that is somehow linked to the Use Case, and explains the processes or activities that take place in the Use Case.
de: Eine Anwendungsfallbeschreibung legt in Textform den Anwendungsfall dar. Normalerweise werden dazu Notizen oder sonst wie mit dem Anwendungsfall verlinkte Dokumente dargestellt und beschreiben die Prozesse oder Aktivitäten, die im Anwendungsfall stattfinden.

source: Class Diagram
de: Klassendiagramm

source: Class Diagrams show the different classes that make up a system and how they relate to each other. Class Diagrams are said to be <quote>static</quote> diagrams because they show the classes, along with their methods and attributes as well as the static relationships between them: which classes <quote>know</quote> about which classes or which classes <quote>are part</quote> of another class, but do not show the method calls between them.
de: Klassendiagramme zeigen die verschiedenen Klassen, aus denen das System besteht, und wie diese untereinander in Abhängigkeit stehen. Die Klassendiagramme werden als <quote>statisch</quote> bezeichnet, da sie lediglich die Klassen mit ihren Methoden und Attributen sowie die statischen Verbindungen zwischen ihnen darstellen. Dabei wird gezeigt, welche Klassen von anderen Klassen <quote>etwas wissen</quote> und welche Klassen <quote>ein Teil</quote> von anderen Klassen sind. Es wird aber nicht der Nachrichtenaustausch (Methodenaufrufe) zwischen den Klassen dargestellt.

source: An example of a Class Diagram
de: ein beispielhaftes Klassendiagramm

source: <phrase>&umbrello; showing a Class Diagram</phrase>
de: <phrase>&umbrello; bei der Darstellung eines Klassendiagramms</phrase>

source: <para>&umbrello; showing a Class Diagram</para>
de: <para>&umbrello; bei der Darstellung eines Klassendiagramms</para>

source: Class
de: Klasse

source: A Class defines the attributes and the methods of a set of objects. All objects of this class (instances of this class) share the same behavior, and have the same set of attributes (each object has its own set). The term <quote>Type</quote> is sometimes used instead of Class, but it is important to mention that these two are not the same, and Type is a more general term.
de: Eine Klasse definiert die Attribute und Methoden einer Menge von Objekten. Alle Objekte dieser Klasse (die Instanzen) haben das gleiche Verhalten und die gleichen Attribute (aber mit unterschiedlichen Werten). Der Begriff <quote>Typ</quote> wird manchmal synonym für Klasse verwendet, aber es muss beachtet werden, dass Typ allgemeiner ist und daher die beiden Begriffe nicht identisch in ihrer Bedeutung sind.

source: In &UML;, Classes are represented by rectangles, with the name of the class, and can also show the attributes and operations of the class in two other <quote>compartments</quote> inside the rectangle.
de: In der &UML; werden Klassen als Rechtecke mit dem Klassennamen dargestellt. Sie können die Attribute und Operationen der Klasse in 2 extra <quote>abgetrennten Bereichen</quote> innerhalb des Rechteck enthalten.

source: A Class in &UML;
de: eine Klasse in der &UML;

source: <phrase>Visual representation of a Class in &UML;</phrase>
de: <phrase>visuelle Darstellung einer Klasse in der &UML;</phrase>

source: <para>Visual representation of a Class in &UML;</para>
de: <para>visuelle Darstellung einer Klasse in der &UML;</para>

source: Attributes
de: Attribut

source: In &UML;, Attributes are shown with at least their name, and can also show their type, initial value and other properties. Attributes can also be displayed with their visibility:
de: In der &UML; werden Attribute mindestens mit ihrem Namen dargestellt, es können aber noch der Typ, der Anfangswert und weitere Eigenschaften mit angezeigt werden. So kann man &eg; die Sichtbarkeit von Attributen mit darstellen:

source: <literal>+</literal> Stands for <emphasis>public</emphasis> attributes
de: <literal>+</literal>, steht für <emphasis>public</emphasis> (öffentliche) Attribute

source: <literal>#</literal> Stands for <emphasis>protected</emphasis> attributes
de: <literal>#</literal>, steht für <emphasis>protected</emphasis> (geschützte) Attribute

source: <literal>-</literal> Stands for <emphasis>private</emphasis> attributes
de: <literal>-</literal>, steht für <emphasis>private</emphasis> Attribute

source: Operations
de: Operation

source: Operations (methods) are also displayed with at least their name, and can also show their parameters and return types. Operations can, just as Attributes, display their visibility:
de: Operationen (Methoden) müssen ebenfalls mindestens mit ihrem Namen dargestellt werden und können weiterhin die Parameter und die Rückgabewerte in der Darstellung enthalten. Wie bei Attributen, ist die Sichtbarkeit ebenfalls darstellbar:

source: <literal>+</literal> Stands for <emphasis>public</emphasis> operations
de: <literal>+</literal>, steht für <emphasis>public</emphasis> (öffentliche) Operationen

source: <literal>#</literal> Stands for <emphasis>protected</emphasis> operations
de: <literal>#</literal>, steht für <emphasis>protected</emphasis> (geschützte) Operationen

source: <literal>-</literal> Stands for <emphasis>private</emphasis> operations
de: <literal>-</literal>, steht für <emphasis>private</emphasis> Operationen

source: Templates
de: Klassen-Templates

source: Classes can have templates, a value which is used for an unspecified class or type. The template type is specified when a class is initiated (&ie; an object is created). Templates exist in modern C++ and will be introduced in Java 1.5 where they will be called Generics.
de: Klassen können als Klassen-Templates genutzt werden um zu zeigen, dass es sich um eine unspezifizierte Klasse oder Typ handelt. Der Klassentyp wird während der Instanzbildung (also Objekt wird angelegt) bestimmt. Template-Klassen gibt es in modernen Sprachen wie C++ und ab Java 1.5, wo sie Generics genannt werden.

source: Class Associations
de: Klassenassoziation

source: Classes can relate (be associated with) to each other in different ways:
de: Klassen können sich auf unterschiedlichen Wegen aufeinander beziehen (assoziieren):

source: <title>Generalization</title>
de: <title>Verallgemeinerung</title>

source: Inheritance is one of the fundamental concepts of Object Oriented programming, in which a class <quote>gains</quote> all of the attributes and operations of the class it inherits from, and can override/modify some of them, as well as add more attributes and operations of its own.
de: Die Vererbung ist ein Basiskonzept der objektorientierten Programmierung. Ein Klasse <quote>erhält</quote> dabei alle Attribute und Operationen der Klasse, von der sie abgeleitet wird. Die Klasse kann diese Operationen/Attribute überschreiben und ändern, sowie neue hinzufügen.

source: In &UML;, a <emphasis>Generalization</emphasis> association between two classes puts them in a hierarchy representing the concept of inheritance of a derived class from a base class. In &UML;, Generalizations are represented by a line connecting the two classes, with an arrow on the side of the base class.
de: In der &UML; wird durch die Assoziation <emphasis>Verallgemeinerung</emphasis> zwischen 2 Klassen eine Hierarchie aufgebaut, die das Konzept von abgeleiteter Klasse und Basisklasse verkörpert. Die Verallgemeinerung zwischen 2 Klassen wird in der &UML; durch eine Linie zwischen den 2 Klassen dargestellt, wobei sich ein Pfeil auf der Seite der Basisklasse befindet.

source: <screeninfo>Generalization</screeninfo>
de: <screeninfo>Verallgemeinerung</screeninfo>

source: <phrase>Visual representation of a generalization in &UML;</phrase>
de: <phrase>visuelle Darstellung der Verallgemeinerung in &UML;</phrase>

source: <para>Visual representation of a generalization in &UML;</para>
de: <para>visuelle Darstellung der Verallgemeinerung in &UML;</para>

source: Associations
de: Assoziation

source: An association represents a relationship between classes, and gives the common semantics and structure for many types of <quote>connections</quote> between objects.
de: Eine Assoziation stellt den Zusammenhang zwischen Klassen dar und beschreibt damit die allgemeine Bedeutung und Struktur verschiedenster Typen von <quote>Verbindungen</quote> zwischen Objekten.

source: Associations are the mechanism that allows objects to communicate to each other. It describes the connection between different classes (the connection between the actual objects is called object connection, or <emphasis>link</emphasis>.
de: Assoziationen sind der Mechanismus, der es den Objekten erlaubt untereinander zu kommunizieren. Sie beschreiben die Verbindungen zwischen verschiedenen Klassen (die Verbindung zwischen den eigentlichen Objekten werden als Objektverbindungen oder als <emphasis>Link</emphasis> bezeichnet).

source: Associations can have a role that specifies the purpose of the association and can be uni- or bidirectional (indicates if the two objects participating in the relationship can send messages to the other, of if only one of them knows about the other). Each end of the association also has a multiplicity value, which dictates how many objects on this side of the association can relate to one object on the other side.
de: Assoziationen können Rollen haben, die den Zweck der Verbindung beschreiben und entweder uni- oder bidirektional sind (ob die Verbindung zwischen den Objekten ein- oder zweiseitig ist). Beide Enden einer Assoziation verfügen über einen Multiplizitätswert, der angibt, wieviele Objekte auf der einen Seite mit wieviel Objekten auf der anderen Seite verbunden sein können.

source: In &UML;, associations are represented as lines connecting the classes participating in the relationship, and can also show the role and the multiplicity of each of the participants. Multiplicity is displayed as a range [min..max] of non-negative values, with a star (<literal>*</literal>) on the maximum side representing infinite.
de: In der &UML; wird die Assoziation durch eine Linie zwischen den in der Beziehung teilnehmenden Klassen dargestellt. Dabei kann die Rolle und die Multiplizität ebenfalls angezeigt werden. Multiplizität wird als Bereich [min..max] von nicht negativen Werten dargestellt, wobei der Stern (<literal>*</literal>) auf der Maximumseite einen unendlichen Wert repräsentiert.

source: &UML; Association
de: &UML;-Assoziation

source: <phrase>Visual representation of an Association in &UML;</phrase>
de: <phrase>visuelle Darstellung einer &UML;-Assoziation</phrase>

source: <para>Visual representation of an Association in &UML;</para>
de: <para>visuelle Darstellung einer &UML;-Assoziation</para>
