Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdesdk/umbrello_uml_basics.po
Languages: de

source: Aggregations are a special type of associations in which the two participating classes don't have an equal status, but make a <quote>whole-part</quote> relationship. An Aggregation describes how the class that takes the role of the whole, is composed (has) of other classes, which take the role of the parts. For Aggregations, the class acting as the whole always has a multiplicity of one.
de: Aggregationen sind eine Spezialart von Assoziationen. Dabei haben die verbundenen Klassen nicht den gleichen Status, sondern es wird eine <quote>Teil eines Ganzes</quote> Beziehung dargestellt. Ein Aggregation beschreibt, wie die Klasse, die die Rolle des Ganzen vertritt, sich aus anderen Klassen, die die Rollen des Teil innehaben, zusammensetzt. Bei Aggregationen hat die Klasse mit der Rolle des Ganzen immer eine Multiplizität von 1.

source: In &UML;, Aggregations are represented by an association that shows a rhomb on the side of the whole.
de: In der &UML; werden Aggregationen durch Assoziationen dargestellt, wobei auf der Seite des Ganzen ein Rhombus ist.

source: <phrase>Visual representation of an Aggregation relationship in &UML;</phrase>
de: <phrase>visuelle Darstellung einer Aggregationsbeziehung in der &UML;</phrase>

source: <para>Visual representation of an Aggregation relationship in &UML;</para>
de: <para>visuelle Darstellung einer Aggregationsbeziehung in der &UML;</para>

source: <title>Composition</title>
de: <title>Komposition</title>

source: Compositions are associations that represent <emphasis>very strong</emphasis> aggregations. This means, Compositions form whole-part relationships as well, but the relationship is so strong that the parts cannot exist on its own. They exist only inside the whole, and if the whole is destroyed the parts die too.
de: Kompositionen sind Assoziationen, die eine <emphasis>sehr starke</emphasis> Aggregation darstellen. Das bedeutet, dass Kompositionen ebenfalls eine Teil eines Ganzen Beziehung darstellen, wobei die Beziehung aber so stark ist, dass die Teile nicht allein existieren können. Sie bestehen nur innerhalb des Ganzen und werden zerstört, wenn das Ganze zerstört wird.

source: In &UML;, Compositions are represented by a solid rhomb on the side of the whole.
de: In der &UML; werden Kompositionen durch ein ausgefülltes Rhombus auf der Seite des Ganzen dargestellt.

source: <screeninfo>Composition</screeninfo>
de: <screeninfo>Komposition</screeninfo>

source: Visual representation of a Composition relationship in &UML;
de: visuelle Darstellung einer Kompositionsbeziehung in der &UML;

source: Other Class Diagram Items
de: Andere Klassendiagramm-Elemente

source: Class diagrams can contain several other items besides classes.
de: Neben Klassen können weitere Elemente in einem Klassendiagramm dargestellt werden.

source: Interfaces
de: Schnittstelle

source: Interfaces are abstract classes which means instances cannot be directly created of them. They can contain operations but no attributes. Classes can inherit from interfaces (through a realisation association) and instances can then be made of these diagrams.
de: Schnittstellen (Interfaces) sind abstrakte Klassen. Das bedeutet, von der Klasse können keine Instanzen direkt gebildet werden. Schnittstellen können Operationen aber keine Attribute beinhalten. Klassen können durch eine Realisierungsassoziation von Schnittstellen abgeleitet werden und von der Klasse können dann Instanzen gebildet werden.

source: Datatypes
de: Datentypen

source: Datatypes are primitives which are typically built into a programming language. Common examples include integers and booleans. They cannot have relationships to classes but classes can have relationships to them.
de: Datentypen sind Primitive, die normalerweise in den Programmiersprachen verfügbar sind wie Integer und Boolean. Sie können keine Beziehung zu Klassen haben, aber Klassen zu ihnen.

source: Enums
de: Aufzählungen

source: Enums are a simple list of values. A typical example is an enum for days of the week. The options of an enum are called Enum Literals. Like datatypes they cannot have relationships to classes but classes can have relationships to them.
de: Aufzählungen sind eine einfache Liste von Werten. Ein typisches Beispiel für eine Aufzählung sind die Wochentage. Die einzelnen Einträge in der Aufzählung werden als Aufzählungswert bezeichnet. Wie Datentypen können sie keine Beziehung zu Klassen haben, aber Klassen können Beziehungen zu ihnen haben.

source: Packages
de: Pakete

source: Packages represent a namespace in a programming language. In a diagram they are used to represent parts of a system which contain more than one class, maybe hundereds of classes.
de: Pakete stehen für Namensräume (Namespace) in Programmiersprachen. In einem Diagramm stehen sie stellvertretend für Teilsysteme, die aus mehr als einer Klasse, manchmal hunderte, bestehen können.

source: Sequence Diagrams
de: Sequenzdiagramm

source: Sequence Diagrams show the message exchange (&ie; method call) between several Objects in a specific time-delimited situation. Objects are instances of classes. Sequence Diagrams put special emphasis in the order and the times in which the messages to the objects are sent.
de: Sequenzdiagramme zeigen den Nachrichtenaustausch (also Methodenaufruf) zwischen Objekten in einem spezifischen Zeitrahmen. Dabei wird besondere Betonung auf die Reihenfolge und die Zeiten gelegt, in denen die Nachrichten an die Objekte gesendet werden.

source: In Sequence Diagrams objects are represented through vertical dashed lines, with the name of the Object on the top. The time axis is also vertical, increasing downwards, so that messages are sent from one Object to another in the form of arrows with the operation and parameters name.
de: Im Sequenzdiagramm wird das Objekt durch eine vertikal verlaufende gestrichelte Linie gekennzeichnet. Der Objektname befindet sich am oberen Ende. Die Zeitachse verläuft ebenfalls vertikal, wobei sie sich nach unten hin erhöht. Nachrichten zwischen den Objekten werden als Pfeile mit den Operationen- und Parameternamen gekennzeichnet.

source: Sequence Diagram
de: Sequenzdiagramm

source: <phrase>&umbrello; showing a Sequence Diagram</phrase>
de: <phrase>&umbrello; bei der Darstellung eines Sequenzdiagramms</phrase>

source: <para>&umbrello; showing a Sequence Diagram</para>
de: <para>&umbrello; bei der Darstellung eines Sequenzdiagramms</para>

source: Messages can be either synchronous, the normal type of message call where control is passed to the called object until that method has finished running, or asynchronous where control is passed back directly to the calling object. Synchronous messages have a vertical box on the side of the called object to show the flow of program control.
de: Nachrichten können synchron oder asynchron sein. Bei synchronen Nachrichten erfolgt ein normaler Nachrichtenaufruf und die Kontrolle wird an das gerufene Objekt übergeben. Asynchrone Aufrufe geben sofort die Kontrolle an das rufende Objekt zurück. Synchrone Nachrichten haben eine vertikale Box auf der Seite des gerufenen Objektes um den Programmverlauf darzustellen.

source: Collaboration Diagrams
de: Kollaborationsdiagramm

source: Collaboration Diagrams show the interactions occurring between the objects participating in a specific situation. This is more or less the same information shown by Sequence Diagrams but there the emphasis is put on how the interactions occur in time while the Collaboration Diagrams put the relationships between the objects and their topology in the foreground.
de: Kollaborationsdiagramme zeigen die Interaktionen zwischen Objekten, die an einer spezifischen Situation teilnehmen. Dies entspricht im Wesentlichen den Informationen aus dem Sequenzdiagramm, wobei bei diesen der Schwerpunkt auf dem zeitlichen Auftreten liegt. Bei Kollaborationsdiagramm wird hingegen vordergründig die Verbindung zwischen Objekten und ihrer Topologie gelegt.

source: In Collaboration Diagrams messages sent from one object to another are represented by arrows, showing the message name, parameters, and the sequence of the message. Collaboration Diagrams are specially well suited to showing a specific program flow or situation and are one of the best diagram types to quickly demonstrate or explain one process in the program logic.
de: Die Nachrichten zwischen den Objekten werden in Kollaborationsdiagrammen durch Pfeile dargestellt, an denen Name, Parameter und die Nachrichtensequenz steht. Die Kollaborationsdiagramme sind hervorragend dafür geeignet eine spezielle Programmabfolge oder Situation zu zeigen. Man kann damit sehr leicht und schnell einen Teil der Programmlogik demonstrieren und erklären.

source: Collaboration
de: Kollaboration

source: <phrase>&umbrello; showing a Collaboration Diagram</phrase>
de: <phrase>&umbrello; bei der Darstellung eines Kollaborationdiagramms</phrase>

source: <para>&umbrello; showing a Collaboration Diagram</para>
de: <para>&umbrello; bei der Darstellung eines Kollaborationdiagramms</para>

source: <title>State Diagram</title>
de: <title>Zustandsdiagramm</title>

source: State Diagrams show the different states of an Object during its life and the stimuli that cause the Object to change its state.
de: Zustandsdiagramme zeigen Objekte in ihren verschiedenen Zuständen während ihres Lebens und sie zeigen die Einflüsse, die die Objekte in einen anderen Zustand bringen.

source: State Diagrams view Objects as <emphasis>state machines</emphasis> or finite automates that can be in one of a set of finite states and that can change its state via one of a finite set of stimuli. For example an Object of type <emphasis>NetServer</emphasis> can be in one of following states during its life:
de: Zustandsdiagramme betrachten Objekte als <emphasis>Zustandsmaschinen </emphasis> oder endliche Automaten, die in einer endlichen Anzahl von Zuständen sein können und die ihren Zustand durch eine endliche Anzahl von Einflüssen verändern. So kann sich zum Beispiel das Objekt <emphasis>NetServer</emphasis> während seines Lebens in folgenden Zuständen befinden:

source: Ready
de: bereit

source: Listening
de: wartend

source: Working
de: arbeitend

source: Stopped
de: angehalten

source: and the events that can cause the Object to change states are
de: und die Ereignisse, die eine Zustandsänderung des Objektes auslösen, könnten sein:

source: Object is created
de: Objekt ist angelegt

source: Object receives message listen
de: Objekt erhält Nachricht zu warten

source: A Client requests a connection over the network
de: ein Client fordert eine Verbindung über ein Netzwerk an

source: A Client terminates a request
de: ein Client beendet eine Anforderung

source: The request is executed and terminated
de: eine Anforderung wird bearbeitet und beendet

source: Object receives message stop
de: Objekt empfängt Nachricht anhalten

source: <para>etc</para>
de: <para>usw.</para>

source: <screeninfo>State Diagram</screeninfo>
de: <screeninfo>Zustandsdiagramm</screeninfo>

source: <phrase>&umbrello; showing a State Diagram</phrase>
de: <phrase>&umbrello; bei der Darstellung eines Zustandsdiagramms</phrase>

source: <para>&umbrello; showing a State Diagram</para>
de: <para>&umbrello; bei der Darstellung eines Zustandsdiagramms</para>

source: State
de: Zustand

source: States are the building block of State Diagrams. A State belongs to exactly one class and represents a summary of the values the attributes of a class can take. A &UML; State describes the internal state of an object of one particular class
de: Zustände sind die Bausteine des Zustandsdiagramms. Ein Zustand gehört zu genau einer Klasse und steht für eine bestimmte Konstellation der Attributwerte dieser Klasse. Somit beschreibt ein Zustand in der &UML; den internen Zustand eines Objektes einer bestimmten Klasse.

source: Note that not every change in one of the attributes of an object should be represented by a State but only those changes that can significantly affect the workings of the object
de: Wichtig ist dabei, dass nicht jede Attributveränderung im Objekt zu einem neuen Zustand führen soll, sondern lediglich Attributwerte mit spürbaren Auswirkungen als Zustand des Objektes zu vermerken sind.

source: There are two special types of States: Start and End. They are special in that there is no event that can cause an Object to return to its Start state, in the same way as there is no event that can possible take an Object out of its End state once it has reached it.
de: Zwei besondere Zustände sind Start und Ende. So kann es kein Ereignis geben, dass ein Objekt in seinen Startzustand zurückversetzt und kein Ereignis kann ein Objekt in einen anderen Zustand versetzen, wenn dieses bereits seinen Endzustand erreicht hat.

source: Activity Diagram
de: Aktivitätsdiagramm

source: Activity Diagrams describe the sequence of activities in a system with the help of Activities. Activity Diagrams are a special form of State Diagrams, that only (or mostly) contains Activities.
de: Aktivitätsdiagramme beschreiben die Abfolge von Aktivitäten in einem System. Sie sind dabei eine spezielle Form der Zustandsdiagramme, indem sie fast ausschließlich Aktivitäten beinhalten.

source: An example Activity Diagram.
de: ein beispielhaftes Aktivitätsdiagramm

source: <phrase>&umbrello; showing an Activity Diagram</phrase>
de: <phrase>&umbrello; bei der Darstellung eines Aktivitätsdiagramms</phrase>

source: <para>&umbrello; showing an Activity Diagram</para>
de: <para>&umbrello; bei der Darstellung eines Aktivitätsdiagramms</para>

source: Activity Diagrams are similar to procedural Flux Diagrams, with the difference that all Activities are clearly attached to Objects.
de: Aktivitätsdiagramme sind den prozeduralen Flussdiagrammen sehr ähnlich. Der Unterschied ist, dass Aktivitäten klar an Objekte gekoppelt sind.

source: Activity Diagrams are always associated to a <emphasis>Class</emphasis>, an <emphasis>Operation</emphasis> or a <emphasis>Use Case</emphasis>.
de: Aktivitätsdiagramme gehören immer eindeutig zu <emphasis>Klassen</emphasis>, <emphasis>Operationen</emphasis> oder <emphasis>Anwendungsfällen</emphasis>.

source: Activity Diagrams support sequential as well as parallel Activities. Parallel execution is represented via Fork/Wait icons, and for the Activities running in parallel, it is not important the order in which they are carried out (they can be executed at the same time or one after the other)
de: In Aktivitätsdiagrammen können sowohl sequenzielle wie auch parallele Aktivitäten dargestellt werden. Parallele Bearbeitung wird mittels der Fork/Wait Symbole umgesetzt. Für parallel laufende Aktivitäten ist es dabei unerheblich, in welcher Reihenfolge sie ablaufen. Sie können zum gleichen Zeitpunkt aber auch nacheinander ausgeführt werden.

source: Activity
de: Aktivität

source: An Activity is a single step in a process. One Activity is one state in the system with internal activity and, at least, one outgoing transition. Activities can also have more than one outgoing transition if they have different conditions.
de: Eine Aktivität ist ein einzelner Schritt in einem Prozess. Somit ist eine Aktivität ein Zustand des Systems mit einer internen Aktivität und mindestens einem Übergang. Es sind allerdings mehrere Übergänge möglich, wenn die Aktivität unterschiedliche Bedingungen enthält.

source: Activities can form hierarchies, this means that an Activity can be composed of several <quote>detail</quote> Activities, in which case the incoming and outgoing transitions should match the incoming and outgoing transitions of the detail diagram.
de: Aktivitäten können eine Hierarchie bilden, indem man eine Aktivität aus anderen zusammensetzen kann. Dabei müssen die eingehenden und ausgehenden Übergänge mit den entsprechenden Übergängen in der Verfeinerung übereinstimmen.

source: Helper Elements
de: Hilfselemente

source: There are a few elements in &UML; that have no real semantic value for the model, but help to clarify parts of the diagram. These elements are
de: In der &UML; sind einige Elemente, die keine semantische Bedeutung für das Modell haben, aber Diagramme verständlicher machen können. Die Elemente sind:

source: Text lines
de: Textzeile

source: Text Notes and anchors
de: Textnotiz und entsprechende Verbindung

source: Boxes
de: Rahmen

source: Text lines are useful to add short text information to a diagram. It is free-standing text and has no meaning to the Model itself.
de: Mit der Textzeile kann eine Kurzinformation in das Diagramm eingefügt werden. Der Text ist freistehend und hat keine Bedeutung für das Modell.

source: Notes are useful to add more detailed information about an object or a specific situation. They have the great advantage that notes can be anchored to &UML; Elements to show that the note <quote>belongs</quote> to a specific object or situation.
de: Mittels der Textnotiz können detaillierte Informationen über ein Objekt oder eine Situation eingefügt werden. Der große Vorteil der Textnotiz ist, dass sie mit einem &UML;-Element verbunden werden kann und somit die Notiz zu diesem speziellen Objekt oder der speziellen Situation <quote>gehört</quote>.

source: Boxes are free-standing rectangles which can be used to group items together to make diagrams more readable. They have no logical meaning in the model.
de: Rahmen sind frei schwebende Rechtecke, die zur visuellen Gruppierung von Objekten in Diagrammen genutzt werden können. Sie machen ein Diagramm besser lesbar, haben aber keine logische Bedeutung für das Modell.

source: Component Diagrams
de: Komponentendiagramm

source: Component Diagrams show the software components (either component technologies such as KParts, CORBA components or Java Beans or just sections of the system which are clearly distinguishable) and the artifacts they are made out of such as source code files, programming libraries or relational database tables.
de: Komponentendiagramme stellen die Software Komponenten (entweder Komponententechnologien wie KParts, CORBA Komponenten oder Java Beans oder klar abgrenzbare Systemeinheiten) dar und die Resultate wie Quelltextdateien, Programmbibliotheken oder relationale Datenbanktabellen.

source: Components can have interfaces (&ie; abstract classes with operations) that allow associations between components.
de: Komponenten können Schnittstellen (also abstrakte Klasse mit Operationen) enthalten, mit denen Verbindungen zwischen Komponenten möglich werden.

source: Deployment Diagrams
de: Verteilungsdiagramm

source: Deployment diagrams show the runtime component instances and their associations. They include Nodes which are physical resources, typically a single computer. They also show interfaces and objects (class instances).
de: Verteilungsdiagramme zeigen die Laufzeitobjekte der Komponenten und ihre Beziehungen. Sie beinhalten Knoten als physische Ressourcen, typischerweise ein Computer. Weiterhin zeigen sie Schnittstellen und Objekte (Klasseninstanzen).

source: Entity Relationship Diagrams
de: Entitäten-Beziehungs-Diagramm

source: Entity Relationship Diagrams (ER Diagrams) show the conceptual design of database applications. They depict the various entities (concepts) in the information system and the existing relationships and constraints between them. An extension of Entity Relationship Diagrams named 'Extended Entity Relationship Diagrams' or 'Enhanced Entity Relationship Diagrams' (EER), are used to incorporate Object Oriented design techniques in ER Diagrams.
de: Entitäten-Beziehungs-Diagramme (ER-Diagramme) stellen das konzeptuelle Design von Datenbankanwendungen dar. Sie beschreiben die verschiedenen Entitäten (Konzepte) im Informationssystem und die vorhandenen Beziehungen sowie Einschränkungen untereinander. Eine Weiterentwicklung der Entitäten-Beziehungs-Diagramme sind 'Extended Entity Relationship Diagrams' oder 'Enhanced Entity Relationship Diagrams' (EER). Damit werden Objektorientierte-Entwurfstechniken für ER-Diagramme eingeführt.

source: An example Entity Relationship diagram.
de: Ein beispielhaftes Entitäten-Beziehungs-Diagramm

source: <phrase>Umbrello showing an Entity Relationship Diagram</phrase>
de: <phrase>&umbrello; bei der Darstellung eines Entitäten-Beziehungs-Diagramms</phrase>

source: <para>Umbrello showing an Entity Relationship Diagram</para>
de: <para>&umbrello; bei der Darstellung eines Entitäten-Beziehungs-Diagramms</para>

source: Entity
de: Entität

source: An <emphasis>Entity</emphasis> is any concept in the real world with an independent existence. It may be an object with a physical existence ( example, Computer, Robot) or it may be an object with a conceptual existence ( eq: University Course). Each entity has a set of attributes which describe the properties of the Entity.
de: Eine <emphasis>Entität</emphasis> ist jedes Konzept in der realen Welt mit einer unabhängigen Existenz. Das kann ein physikalisch existierendes Objekt wie ein Rechner oder Roboter sein, oder ein konzeptionell existierendes Objekt wie zum Beispiel ein Kurs an der Universität. Jede Entität hat Attribute, die ihre Eigenschaften beschreiben.

source: <emphasis>Note:</emphasis> No standard notations exist for depicting ER Diagrams. Different texts on this subject use different notations. The concepts and notations for EER diagrams used in Umbrello are from the following book : <emphasis>Elmasri R. and Navathe S. (2004). Fundamentals of Database Systems 4th edn. Addison Wesley</emphasis>
de: <emphasis>Hinweis</emphasis>: Es gibt keine Standard-Schreibweise zur Darstellung von ER-Diagrammen. In der Literatur werden verschiedene System verwendet. Die in Umbrello benutzen Konzepte und Schreibweisen orientieren sich an folgendem Buch: <emphasis>Elmasri R. and Navathe S. (2004). Fundamentals of Database Systems 4th edn. Addison Wesley.</emphasis>

source: In an ER Diagram, Entities are represented by rectangles, with the name of the entity at the top, and can also show the attributes of the entity in another <quote>compartment</quote> inside the rectangle.
de: In einem Entitäten-Beziehungs-Diagramm (ER-Diagramm) werden Entitäten als Rechtecke mit dem Namen der Entität oben im Rechteck dargestellt. Die Attribute der Entität können in einem extra <quote>abgetrennten Bereich</quote> innerhalb des Rechteck angezeigt werden.

source: An Entity in an ER Diagram;
de: Eine Entität in einem ER-Diagramm

source: <phrase>Visual representation of an entity in an ER Diagram</phrase>
de: <phrase>Visuelle Darstellung einer Entität in einem ER-Diagramm</phrase>

source: <para>Visual representation of an entity in an ER Diagram</para>
de: <para>Visuelle Darstellung einer Entität in einem ER-Diagramm</para>

source: Entity Attributes
de: Entitätsattribute

source: In ER Diagrams , Entity Attributes are shown with their name in a different compartment of the Entity to which they belong.
de: In ER-Diagrammen werden Attribute der Entität mit ihrem Namen in einem abgetrennten Bereich innerhalb der Entität angezeigt werden.

source: Constraints
de: Einschränkungen

source: Constraints in ER Diagrams specify the restrictions on data in the information schema.
de: Einschränkungen in ER-Diagrammen bestimmen die Beschränkung der Daten im Informationsschema.

source: There are four types of constraints supported in Umbrello :
de: In Umbrello werden vier Arten von Einschränkungen unterstützt:
