Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdesdk/umbrello_uml_basics.po
Languages: de

source: <emphasis>Primary Key:</emphasis> The set of attributes declared as <emphasis>primary key</emphasis> are unique to the entity. There can be only one primary key in an Entity and none of its constituent attributes can be NULL.
de: <emphasis>Primärschlüssel:</emphasis> Die Menge der als <emphasis>Primärschlüssel</emphasis> deklarierten Attribute müssen für eine Entität eindeutig sein. Es darf nur einen Primärschlüssel in einer Entität geben und keiner seiner konstituierende Attribute darf den Wert NULL haben.

source: <emphasis>Unique Key:</emphasis> The set of attributes declared as <emphasis>unique</emphasis> are unique to the entity. There can be many unique constraints on an Entity. Its constituent attributes can be NULL. Unique Keys and Primary Keys uniquely identify a row in a table ( entity )
de: <emphasis>Eindeutiger Schlüssel:</emphasis> Die Menge der als <emphasis>eindeutig</emphasis> deklarierten Attribute müssen für eine Entität eindeutig sein. Es darf mehrere eindeutige Einschränkungen in einer Entität geben. Die konstituierende Attribute dürfen den Wert NULL haben. Eindeutige Schlüssel und Primärschlüssel bestimmen eindeutig eine Zeile in einer Tabelle (Entität).

source: <emphasis>Foreign Key:</emphasis> A Foreign Key is a referential constraint between two tables. The foreign key identifies a column or a set of columns in one (referencing) table that refers to a column or set of columns in another (referenced) table. The columns in the referenced table must form a primary key or unique key.
de: <emphasis>Fremdschlüssel:</emphasis> Ein Fremdschlüssel ist eine referentielle Einschränkung zwischen zwei Tabellen. Der Fremdschlüssel bestimmt eine oder mehrere Spalten in einer Tabelle als Referenz auf eine oder mehrere Spalten in einer anderen Tabelle. Die Spalten in der referenzierten Tabelle müssen einen Primärschlüssel oder eindeutigen Schlüssel bilden.

source: <emphasis>Check Constraint:</emphasis> A check constraint (also known as table check constraint) is a condition that defines valid data when adding or updating an entry in a table of a relational database. A check constraint is applied to each row in the table. The constraint must be a predicate. It can refer to a single or multiple columns of the table.
de: <emphasis>Prüf-Einschränkung:</emphasis> Eine Prüf-Einschränkung ist eine Bedingung, die die Gültigkeit von Daten definiert, wenn ein Eintrag in einer Tabelle einer relationalen Datenbank hinzugefügt oder aktualisiert wrd. Eine Prüf-Einschränkung wird auf jede Zeile einer Tabelle angewendet. Die Einschränkung muss eine Eigenschaft sein. Sie kann sich auf eine oder mehrere Spalten einer Tabelle beziehen.

source: Example: price >= 0
de: Beispiel: Preis >= 0

source: Extended Entity Relationship (EER) Diagram Concepts
de: Konzepte der erweiterten Entitäten-Beziehungs-Diagramme (EER-Diagramme)

source: Specialization
de: Spezialisierung

source: Specialization is a way to form new entities using entities that have already been defined. The new entities, known as derived entities, take over (or inherit) attributes of the pre-existing entities, which are referred to as base entities . It is intended to help reuse existing data with little or no modification.
de: Spezialisierung ist eine Möglichkeit, neue Entitäten unter Verwendung bereits definierter Entitäten zu erstellen. Die neuen Entitäten - auch abgeleitete Entitäten genannt - übernehmen oder erben die Attribute bereits existierender Entitäten, die auch als Basis-Entitäten bezeichnet werden. Dies ermöglicht es, bereits vorhandene Daten mit keiner oder nur geringen Änderungen wiederzuverwenden.

source: In Umbrello, one can specify Disjoint and Overlapping Specialization
de: In Umbrello können Zerlegungs- und Überschneidungs-Spezialisierungen definiert werden.

source: Disjoint Specialization
de: Zerlegungs-Spezialisierung

source: Disjoint Specialization specifies that the subclasses of the specialization must be disjoint. This means that an entity can be a member of at most one of the derived entities of the specialization
de: Die Zerlegungs-Spezialisierung legt fest, dass die Unterklassen der Spezialisierung getrennt sein müssen. Das bedeutet, dass eine Entität nur ein Mitglied höchstens einer der abgeleiteten Entitäten der Spezialisierung sein kann.

source: Entities taking part in Disjoint Specialization
de: Entitäten in einer Zerlegungs-Spezialisierung

source: <phrase>Visual representation of Disjoint Specialization in EER Diagram</phrase>
de: <phrase>Visuelle Darstellung einer Zerlegungs-Spezialisierung in einem EER-Diagramm</phrase>

source: <para>Visual representation of Disjoint Specialization in EER Diagram</para>
de: <para>Visuelle Darstellung einer Zerlegungs-Spezialisierung in einem EER-Diagramm</para>

source: Overlapping Specialization
de: Überschneidungs-Spezialisierung

source: When the derived entities are not constrained to be disjoint, their set of entities are said to be in overlapping specialization. This means that the same real world entity may be a member of more than one derived entity of the specialization
de: Wenn die abgeleitete Entitäten nicht durch eine Zerlegung eingeschränkt sind, wird die Menge der Entitäten als Überschneidungs-Spezialisierung bezeichnet. Das bedeutet, dass eine Entität ein Mitglied von mehr als einer abgeleiteten Entität der Spezialisierung sein kann.

source: Entities taking part in Overlapping Specialization
de: Entitäten in einer Überschneidungs-Spezialisierung

source: <phrase>Visual representation of Overlapping Specialization in EER Diagram</phrase>
de: <phrase>Visuelle Darstellung einer Überschneidungs-Spezialisierung in einem EER-Diagramm</phrase>

source: <para>Visual representation of Overlapping Specialization in EER Diagram</para>
de: <para>Visuelle Darstellung einer Überschneidungs-Spezialisierung in einem EER-Diagramm</para>

source: Category
de: Kategorie

source: A derived Entity is said to be a <emphasis>Category</emphasis> when it represents a collection of objects that is a subset of Union of the distinct entity types. A Category is modelled when the need arises for a single superclass/subclass relationship with more than one superclass, where the superclasses represent different entity types. ( Much like multiple inheritance in Object Oriented Programming ).
de: Eine abgeleitete Entität wird als <emphasis>Kategorie</emphasis> bezeichnet, wenn sie eine Sammlung von Objekten darstellt, die aus einer Teilmenge der Vereinigung von verschiedenen Entitätstypen besteht. Eine Kategorie wird dann gebildet, wenn eine Beziehung zwischen mehreren Ober- und einer Unterklasse benötigt wird, die Oberklassen bestehen dabei unterschiedliche Entitätstypen. Das entspricht etwa der Mehrfachvererbung in der Objektorientierten Programmierung.

source: Entities taking part in a Category relationship
de: Entitäten in einer Kategorien-Beziehung

source: <phrase>Visual representation of a Category in EER Diagram</phrase>
de: <phrase>Visuelle Darstellung einer Kategorie in einem EER-Diagramm</phrase>

source: <para>Visual representation of a Category in EER Diagram</para>
de: <para>Visuelle Darstellung einer Kategorie in einem EER-Diagramm</para>
