Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdesdk/umbrello_authors.po
Languages: de

source: Authors and History
de: Autoren und Geschichte

source: This project was started by Paul Hensgen as one of his University projects. The original name of the application was <application>UML Modeller</application>. Paul did all the development until the end of 2001 when the program reached version 1.0.
de: Dieses Projekt wurde von Paul Hensgen als eines seiner Universitätsprojekte initiiert. Der Originalname des Projektes lautete <application>UML Modeller</application>. Paul hatte die Entwicklung bis Ende 2001, als die Version 1.0 erschien, vorangetrieben.

source: Version 1.0 already offered a lot of functionality, but after the project had been reviewed at Paul's University, other developers could join and they started making valuable contributions to <application>UML Modeller</application>, like switching from a binary file format to an &XML; file, support for more types of &UML; Diagrams, Code Generation and Code Import just to name a few.
de: Version 1.0 bot schon eine Vielzahl von Funktionen. Nachdem Paul bei seiner Universität die Arbeit eingereicht hatte, konnten andere Entwickler dem Projekt beitreten, um es weiter zu verbessern. So wurde das ursprünglich binäre Dateiformat zugunsten von &XML;-Dateien fallen gelassen, es wurde Unterstützung für weitere &UML;-Diagramme hinzugefügt, genauso wie die Quelltexterzeugung und das Einlesen von Quelltext, um nur ein paar wenige Verbesserungen zu nennen.

source: Paul had to retire from the development team in Summer 2002 but, as Free and Open Source Software, the program continues to improve and evolve and is being maintained by a group of developers from different parts of the world. In September 2002 the project changed its name from <application>&UML; Modeller</application>, to &umbrello;. There are several reasons for the change of names, the most important ones being that just <quote>uml</quote> &mdash; as it was commonly known &mdash; was a much too generic name and caused problems with some distributions. The other important reason is that the developers think <application>Umbrello</application> is a much cooler name.
de: Paul musste sich im Sommer 2002 aus dem Entwicklungsteam leider zurückziehen, aber das Programm lebt weiter und entwickelt sich, wie andere Open Source Software. Es wird heute von einer Gruppe von Entwicklern von überall aus der Welt gepflegt. Im September 2002 wurde der Projektname von <application>&UML; Modeller</application> in &umbrello; geändert. Dafür gab es gute Gründe, &eg; war <quote>uml</quote> &mdash; wie es allgemein genannt wurde &mdash; zu allgemein und es gab deswegen Probleme mit einigen Distributionen. Und außerdem sind die Entwickler der Meinung, dass <application>Umbrello </application> ein viel coolerer Name ist.

source: The development of &umbrello; as well as discussions as to where the program should head for future versions is open and takes place over the Internet. If you would like to contribute to the project, please do not hesitate to contact the developers. There are many ways in which you can help &umbrello;:
de: &umbrello;s Entwicklung, genauso wie die Diskussion wo in zukünftigen Versionen die Schwerpunkte liegen sollen, ist offen und wird über das Internet geführt. Falls sie zu dem Projekt beitragen wollen, zögern sie nicht die Entwickler zu kontaktieren! Es gibt viele Möglichkeiten, wie man zu &umbrello; beitragen kann:

source: Reporting bugs or improvements suggestions
de: Fehler berichten oder Vorschläge für Verbesserungen machen

source: Fixing bugs or adding features
de: Fehler beheben oder neue Funktionen hinzufügen

source: Writing good documentation or translating it to other languages
de: Eine gute Dokumentation schreiben oder Umbrello in eine andere Sprache übersetzen

source: And of course...coding with us!
de: Und natürlich mit uns programmieren!

source: As you see, there are many ways in which you can contribute. All of them are very important and everyone is welcome to participate.
de: Es ist ersichtlich, dass es viele Möglichkeiten gibt, zum Projekt beizutragen. Alle Aufgaben dabei sind gleich wichtig und jeder ist herzlich willkommen uns zu helfen.

source: The &umbrello; developers can be reached at <email>umbrello-devel@kde.org</email>.
de: Die Entwickler von &umbrello; sind per E-Mail erreichbar unter: <email>umbrello-devel@kde.org</email>.
