Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/kdesdk/desktop_kdesdk_kdesdk-kioslaves.po
Languages: de

# Name
source: KDED Subversion Module
de: Subversion-Unterstützung

# Description
source: Subversion ioslave
de: Ein-/Ausgabemodul für Subversion

# Name
source: Apply Patch...
de: Patch einspielen ...

# Comment
source: Apply the patch to another folder/file
de: Spielt den Patch in einen/eine andere(n) Ordner/Datei ein

# Name
source: Add to Repository
de: Zum SVN-Archiv hinzufügen

# Name
source: Delete From Repository
de: Aus dem SVN-Archiv löschen

# Name
source: Revert Local Changes
de: Lokale Änderungen zurücknehmen

# Comment
source: Remove any changes made locally. Warning - this cannot be undone.
de: Nimmt alle lokal durchgeführten Änderungen zurück. Warnung: Dieser Vorgang kann nicht rückgängig gemacht werden.

# Name
source: Rename...
de: Umbenennen ...

# Comment
source: Rename a file locally and in the repository. Use this rather than adding and deleting to rename a file.
de: Benennt eine Datei lokal und im SVN-Archiv um. Verwenden Sie besser diese Funktion zum Umbenennen einer Datei als Hinzufügen und Löschen.

# Name
source: Import Repository
de: SVN-Archiv importieren

# Comment
source: Put folder into an existing repository to put it under revision control.
de: Schiebt den Ordner in ein existierendes SVN-Archiv, um ihn in die Versionsverwaltung aufzunehmen.

# Name
source: Checkout From Repository...
de: Aus SVN-Archiv herausholen ...

# Comment
source: Checkout out files from an existing repository into this folder.
de: Legt Dateien aus einem existierenden SVN-Archiv in diesem Ordner ab.

# Name
source: Switch...
de: Wechseln (switch) ...

# Comment
source: Switch given working copy to another branch
de: Wechselt von der vorhandenen Arbeitskopie zu einer anderen Verzweigung (branch).

# Name
source: Merge...
de: Zusammenführen ...

# Comment
source: Merge changes between this and another branch
de: Führt Änderungen aus dieser und einer anderen Verzweigung zusammen

# Comment
source: See who wrote each line of the file and in what revision
de: Zeigt an, wer die Zeilen einer Datei wann geändert hat.

# Name
source: Create Patch...
de: Patch erstellen ...

# Name
source: Export...
de: Exportieren ...

# Comment
source: Checkout out an unversioned copy of a tree from a repository
de: Herausholen eines Baums aus dem SVN-Archiv ohne Versionsinformationen

# Name
source: Diff (local)
de: Diff (lokal)

# Comment
source: Show local changes since last update
de: Zeigt die lokal durchgeführten Änderungen seit der letzten Aktualisierung

# Name
source: SVN Update
de: Aktualisieren (SVN)

# Name
source: SVN Commit
de: Einspielen (SVN)
