Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/kdesdk/fileviewsvnplugin.po
Languages: de

# @item:inmenu
source: SVN Update
de: Aktualisieren (SVN)

# @item:inmenu
source: Show Local SVN Changes
de: Lokale SVN-Änderungen anzeigen

# @item:inmenu
source: SVN Commit...
de: Einspielen (SVN) ...

# @item:inmenu
source: SVN Add
de: Hinzufügen (SVN)

# @item:inmenu
source: SVN Delete
de: Löschen (SVN)

# @item:inmenu
source: Show SVN Updates
de: SVN-Aktualisierungen anzeigen

# @info:status
source: SVN status update failed. Disabling Option "Show SVN Updates".
de: Die SVN-Statusaktualisierung ist fehlgeschlagen. „SVN-Aktualisierungen anzeigen“ wird deaktiviert.

# @info:status
source: Updating SVN repository...
de: SVN-Archiv wird aktualisiert ...

# @info:status
source: Update of SVN repository failed.
de: Die Aktualisierung des SVN-Archivs ist fehlgeschlagen.

# @info:status
source: Updated SVN repository.
de: Das SVN-Archiv wurde aktualisiert.

# @label
source: Description:
de: Beschreibung:

# @title:window
source: SVN Commit
de: Einspielen (SVN)

# @action:button
source: Commit
de: Einspielen

# @info:status
source: Commit of SVN changes failed.
de: Fehler beim Einspielen der SVN-Änderungen.

# @info:status
source: Committing SVN changes...
de: SVN-Änderungen werden eingespielt ...

# @info:status
source: Committed SVN changes.
de: SVN-Änderungen wurden eingespielt.

# @info:status
source: Adding files to SVN repository...
de: Dateien werden zum SVN-Archiv hinzugefügt ...

# @info:status
source: Adding of files to SVN repository failed.
de: Das Hinzufügen von Dateien zum SVN-Archiv ist fehlgeschlagen.

# @info:status
source: Added files to SVN repository.
de: Dateien wurden zum SVN-Archiv hinzugefügt.

# @info:status
source: Removing files from SVN repository...
de: Dateien werden aus dem SVN-Archiv entfernt ...

# @info:status
source: Removing of files from SVN repository failed.
de: Das Entfernen von Dateien aus dem SVN-Archiv ist fehlgeschlagen.

# @info:status
source: Removed files from SVN repository.
de: Dateien wurden aus dem SVN-Archiv entfernt.

source: Show updates
de: Aktualisierungen anzeigen
