Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/kdesdk/kio_svn.po
Languages: de

# NAME OF TRANSLATORS
source: Your names
de: Frederik Schwarzer

# EMAIL OF TRANSLATORS
source: Your emails
de: schwarzer@kde.org

source: Log Message
de: Protokollmeldung

source: &Cancel
de: &Abbrechen

source: Looking for %1...
de: Suchen nach %1 ...

source: For reasons of safety, directories are not yet supported.
de: Aus Sicherheitsgründen sind Ordner noch nicht unterstützt.

source: Nothing to commit.
de: Nichts zum Übertragen.

source: Committed revision %1.
de: Revision %1 übertragen.

source: Restored %1.
de: Wiederhergestellt: %1

source: Reverted %1.
de: Rückgängig gemacht: %1

source: Failed to revert %1. Try updating instead.
de: Rückgängigmachen von %1 ist fehlgeschlagen. Versuchen Sie stattdessen zu aktualisieren.

source: Resolved conflicted state of %1.
de: Konfliktstatus von %1 aufgelöst.

source: Skipped missing target %1.
de: Fehlendes Ziel wurde übersprungen: %1

source: Skipped %1.
de: Übersprungen: %1

source: Exported external at revision %1.
de: External wurde exportiert bei Revision %1.

source: Exported revision %1.
de: Revision exportiert: %1

source: Checked out external at revision %1.
de: External ausgelesen bei Revision %1.

source: Checked out revision %1.
de: Revision ausgelesen: %1

source: Updated external to revision %1.
de: External aktualisiert zu Revision: %1

source: Updated to revision %1.
de: Aktualisiert zu Revision: %1

source: External at revision %1.
de: External bei Revision: %1

source: At revision %1.
de: Bei Revision: %1

source: External export complete.
de: Export von Externals abgeschlossen.

source: Export complete.
de: Export abgeschlossen.

source: External checkout complete.
de: Auslesen von Externals abgeschlossen.

source: Checkout complete.
de: Auslesen abgeschlossen.

source: External update complete.
de: Aktualisierung von Externals abgeschlossen.

source: Update complete.
de: Aktualisierung abgeschlossen.

source: Fetching external item into %1.
de: Eintrag von External werden geholt nach: %1

source: Status against revision: %1.
de: Status zu Revision: %1

source: Performing status on external item at %1.
de: Status für External-Eintrag bei %1

source: Sending %1
de: Wird gesendet: %1

source: Adding (bin) %1.
de: Wird hinzugefügt (bin): %1

source: Adding %1.
de: Wird hinzugefügt: %1

source: Deleting %1.
de: Wird gelöscht: %1

source: Replacing %1.
de: Wird ersetzt: %1

source: Transmitting file data
de: Datei-Daten werden übertragen

source: Request not recognized - it might not be implemented yet.
de: Unbekannte Anfrage. Diese Funktion ist möglicherweise noch nicht eingebaut.

source: Feature Not Implemented
de: Funktion nicht eingebaut

source: Subversion Helper
de: Subversion-Hilfe

source: KDE frontend for SVN
de: KDE-Programm für SVN

source: Update given URL
de: Übergebene Adresse aktualisieren (update)

source: Commit given URL
de: Übergebene Adresse einspielen (commit)

source: Checkout in given directory
de: In übergebenen Ordner auslesen (checkout)

source: Add given URL to the working copy
de: Übergebene Adresse der Arbeitskopie hinzufügen (add)

source: Delete given URL from the working copy
de: Übergebene Adresse aus Arbeitskopie entfernen (delete)

source: Switch given working copy to another branch
de: Übergebene Arbeitskopie zu einem anderen Zweig wechseln (switch)

source: Revert local changes
de: Lokale Änderungen verwerfen (revert)

source: Merge changes between two branches
de: Änderungen aus zwei Zweigen zusammenführen (merge)

source: Show locally made changements with diff
de: Lokale Änderungen anzeigen (diff)

source: URL to update/commit/add/delete from Subversion
de: Adresse zum Aktualisieren/Einspielen/Hinzufügen/Entfernen in Subversion

source: Revision (0 for HEAD):
de: Revision (0 für HEAD):

source: Subversion Log
de: Subversion-Protokoll
