Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/extragear-sysadmin/partitionmanager_referencemanual.po
Languages: de

source: Command Reference
de: Befehlsreferenz

source: Overview
de: Übersicht

source: This chapter gives detailed explanations of all commands available in &partman;. It is intended as a reference to accompany the information given in <xref linkend="usermanual"/>.
de: Dieses Kapitel erklärt detailliert alle Befehle, die in &partman; vorhanden sind. Es ist als Referenz gedacht, um Informationen in <xref linkend="usermanual"/> zu ergänzen.

source: The <guimenu>File</guimenu> Menu
de: Das Menü <quote>Datei</quote>

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo></shortcut> <guimenu>File</guimenu> <guimenuitem>Quit</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo> </shortcut><guimenu>Datei</guimenu><guimenuitem>Beenden</guimenuitem>

source: <action>Quits &partman;</action> without applying any pending operations. The application will however ask you to confirm your choice to quit if there are pending operations.
de: <action>Beendet &partman;</action> ohne die ausstehenden Operationen anzuwenden. &partman; bittet Sie jedoch, das Beenden zu bestätigen, wenn Operationen ausstehen.

source: The <guimenu>Edit</guimenu> Menu
de: Das Menü <quote>Bearbeiten</quote>

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>Z</keycap></keycombo></shortcut> <guimenu>Edit</guimenu> <guimenuitem>Undo</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>Z</keycap></keycombo></shortcut> <guimenu>Bearbeiten</guimenu> <guimenuitem>Rückgängig</guimenuitem>

source: <action>Undoes the last operation</action> that has been added to the operation stack.
de: <action>Macht die letzte Operation rückgängig</action>, die als letztes zur Liste der Operationen hinzugefügt wurde.

source: This command is only enabled if the list of operations is not empty.
de: Dieser Befehl ist nur verfügbar, wenn die Liste der Operationen nicht leer ist.

source: <guimenu>Edit</guimenu> <guimenuitem>Clear</guimenuitem>
de: <guimenu>Bearbeiten</guimenu> <guimenuitem>Löschen</guimenuitem>

source: <action>Clears the list of operations</action> without applying any of them.
de: <action>Löscht die Liste der Operationen</action>, ohne diese anzuwenden.

source: <guimenu>Edit</guimenu> <guimenuitem>Apply</guimenuitem>
de: <guimenu>Bearbeiten</guimenu> <guimenuitem>Anwenden</guimenuitem>

source: <action>Applies the list of operations</action>. This command will apply all operations in the list so that all changes are permanently written to your disks. After the operations have been applied, the list is cleared and there will be no way to undo any operation.
de: <action>Wendet die Liste von Operationen an</action>. Dieser Befehl wendet alle Operationen in der Liste an, sodass die Änderungen dauerhaft auf die Festplatten geschrieben werden. Nach Anwendung der Änderungen wird die Liste der anstehenden Änderungen geleert und es gibt keine Möglichkeit, die Änderungen rückgängig zu machen.

source: The <guimenu>View</guimenu> Menu
de: Das Menü <quote>Ansicht</quote>

source: <guimenu>View</guimenu> <guimenuitem>Devices</guimenuitem>
de: <guimenu>Ansicht</guimenu> <guimenuitem>Geräte</guimenuitem>

source: <action>Toggles the Devices panel</action>: This command turns the display of the devices list on and off.
de: <action>Ein-/Ausblenden der Geräteliste</action>: Dieser Befehl blendet die Liste der Geräte ein oder aus.

source: <guimenu>View</guimenu> <guimenuitem>Pending Operations</guimenuitem>
de: <guimenu>Ansicht</guimenu> <guimenuitem>Ausstehende Operationen</guimenuitem>

source: <action>Toggles the Pending Operations panel</action>: This command turns the display of the operation list on and off.
de: <action>Ein-/Ausblenden der Liste ausstehender Operationen</action>: Dieser Befehl blendet die Liste der ausstehenden Operationen ein oder aus.

source: <guimenu>View</guimenu> <guimenuitem>Information</guimenuitem>
de: <guimenu>Ansicht</guimenu> <guimenuitem>Informationen</guimenuitem>

source: <action>Toggles the Information panel</action>: This command turns the display of the information panel on and off. The information panel will either display details about the currently selected device or, if one is selected, the selected partition.
de: <action>Ein-/Ausblenden der Informations-Kontrollleiste</action>: Dieser Befehl blendet die Informations-Kontrollleiste ein oder aus. Die Informations-Kontrollleiste zeigt Detailinformationen über das ausgewählte Gerät an oder die ausgewählte Partition an.

source: <guimenu>View</guimenu> <guimenuitem>Log Output</guimenuitem>
de: <guimenu>Ansicht</guimenu> <guimenuitem>Protokollausgabe</guimenuitem>

source: <action>Toggles the Log Output panel</action>: This command turns the display of the log output panel on and off.
de: <action>Ein-/Ausblenden der Protokollausgabe</action>: Dieser Befehl blendet die Protokollausgabe ein oder aus.

source: <guimenu>View</guimenu> <guimenuitem>File System Support</guimenuitem>
de: <guimenu>Ansicht</guimenu> <guimenuitem>Dateisystem-Unterstützung</guimenuitem>

source: <action>Shows the file system support dialog.</action> This dialog shows in detail which operations can be performed for which of the supported file systems.
de: <action>Zeigt die Liste unterstützter Dateisysteme an.</action> Dieser Dialog zeigt an, welche Operationen für einzelne Dateisysteme unterstützt werden.

source: Here is an example how the dialog might look like with most external tools installed:
de: Hier sehen Sie eine Beispielansicht der Liste unterstützter Dateisysteme, wenn die meisten externen Dienstprogramme installiert sind:

source: File system support dialog with most external tools installed
de: Liste unterstützter Dateisysteme, wenn die meisten externen Dienstprogramme installiert sind

source: The blue check marks mean <quote>supported</quote>, the red crosses mean <quote>not supported</quote>. Some combinations are never supported, for example checking a linuxswap file system, because they are inherently impossible. Others cannot be supported because the external tools lack the functionality. This is for instance the case with writing labels for FAT file systems.
de: Blaue Haken bedeuten <quote>unterstützt</quote>, rote Kreuze bedeuten <quote>nicht unterstützt</quote>. Einige Kombinationen werden nicht unterstützt, weil sie sich ausschließen, beispielsweise die Überprüfung eines linuxswap-Dateisystems. Andere Operationen werden nicht unterstützt, weil die zugrunde liegenden Dienstprogramme die Funktionalität nicht unterstützen. Dies ist beispielsweise für das Schreiben von Bezeichnungen für FAT-Dateisysteme der Fall.

source: If you have installed new tools while &partman; is running click on <guibutton>Rescan Support</guibutton> to force a recheck of installed file system support tools.
de: Wenn Sie neue Dienstprogramme installieren, während &partman; ausgeführt wird, wählen Sie <guibutton>Erneut prüfen</guibutton>, um eine erneute Überprüfung auf installierte Dienstprogramme zu erzwingen.

source: Also see <xref linkend="requirements"/> for which external tool is required for which operation.
de: In <xref linkend="requirements"/> finden Sie weitere Informationen darüber, welche Dienstprogramme für welche Operationen benötigt werden.

source: <shortcut><keycap>F5</keycap></shortcut> <guimenu>View</guimenu> <guimenuitem>Refresh Devices</guimenuitem>
de: <shortcut><keycap>F5</keycap></shortcut> <guimenu>Ansicht</guimenu> <guimenuitem>Geräte aktualisieren</guimenuitem>

source: <action>Refreshes the devices</action>: This command forces &partman; to scan and read the devices on your computer again. This may for example be useful if you plugged in an external USB hard disk after you started &partman;.
de: <action>Aktualisiert die Geräteliste</action>: Dieser Befehl erzwingt ein erneutes Analysieren und Einlesen der Geräte in Ihrem Computer. Dies kann beispielsweise notwendig sein, wenn Sie während der Ausführung von &partman; eine externe USB-Festplatte anschließen.

source: The <guimenu>Device</guimenu> Menu
de: Das Menü <quote>Gerät</quote>

source: <shortcut><keycombo action="simul">&Ctrl;&Shift;<keycap>N</keycap></keycombo></shortcut> <guimenu>Device</guimenu> <guimenuitem>Create New Partition Table</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;&Shift;<keycap>N</keycap></keycombo></shortcut> <guimenu>Gerät</guimenu> <guimenuitem>Neue Partitionstabelle</guimenuitem>

source: <action>Creates a new partition table</action>: This command creates a new and empty MSDOS partition table on the currently selected device. This will delete all partitions on the device and all data on them, so you will want to be careful with this command.
de: <action>Erstellt eine neue Partitionstabelle</action>: Dieser Befehl erstellt eine neue, leere MSDOS-Partitionstabelle auf dem aktuell ausgewählten Gerät. Dadurch werden alle Partitionen und somit alle Daten auf dem Gerät gelöscht. Seien Sie daher vorsichtig bei der Anwendung dieses Befehls.

source: This command is only enabled if a device is selected and no partition on this device is currently mounted.
de: Dieser Befehl ist nur verfügbar, wenn ein Gerät ausgewählt ist und keine Partition des Gerätes eingebunden ist.

source: The <guimenu>Partition</guimenu> Menu
de: Das Menu <quote>Partition</quote>

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo></shortcut> <guimenu>Partition</guimenu> <guimenuitem>New</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo></shortcut> <guimenu>Partition</guimenu> <guimenuitem>Neu</guimenuitem>

source: <action>Creates a new partition</action>: Opens the dialog to create a new partition where you will be able to set type, size, position and file system of the partition to create.
de: <action>Erstellt eine neue Partition</action>: Öffnet den Dialog zum Erstellen einer neuen Partition. In diesem Dialog können Sie den Typ, die Größe, Position und das Dateisystem der zu erstellenden Partition einrichten.

source: Please note that the partition table on a device may impose restrictions on how many partitions can be created. MS-DOS partition tables, for example, allow only four primary partitions.
de: Bitte beachten Sie, dass die Partitionstabelle auf einem Gerät unter Umständen vorgibt, wie viele Partitionen maximal erstellt werden können. MSDOS-Partitionstabellen ermöglichen beispielsweise nur vier primäre Partitionen.

source: This command is only enabled if an unallocated area on a device is selected.
de: Der Befehl ist nur verfügbar, wenn ein nicht zugewiesener Bereich des Gerätes ausgewählt wurde.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>R</keycap></keycombo></shortcut> <guimenu>Partition</guimenu> <guimenuitem>Resize/Move</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>R</keycap></keycombo></shortcut> <guimenu>Partition</guimenu> <guimenuitem>Größe ändern/verschieben</guimenuitem>

source: <action>Resizes or moves a partition</action>: Opens the dialog to resize or move an existing partition. Depending on the partition's file system and the external tools installed on your computer, not all three possible resize-related actions -- that is, moving the partition, making it smaller (<quote>shrinking</quote> it) or making it larger (<quote>growing</quote> it) -- may be available in this dialog. See <xref linkend="menu-view-filesystemsupport"/>.
de: <action>Verändert die Größe einer Partition oder verschiebt diese</action>: Öffnet den Dialog zur Größenänderung oder zum Verschieben einer existierenden Partition. Je nach dem Dateisystem der Partition und den auf Ihrem Computer installierten Dienstprogrammen sind nicht alle der Operationen zur Größenänderung (Verschieben, Verkleinern oder Vergrößern der Partition) verfügbar. Weitere Informationen finden Sie im Kapitel <xref linkend="menu-view-filesystemsupport"/>.

source: This command is only enabled if a partition is selected that is not currently mounted and whose file system can be shrunk, grown or moved. For an extended partition, it is only enabled if none of the logicals in the extended partition are mounted.
de: Dieser Befehl ist nur verfügbar, wenn eine Partition ausgewählt ist, die nicht eingebunden ist und für deren Dateisystem die Operationen Verkleinern, Vergrößern oder Verschieben unterstützt werden. Eine erweiterte Option kann nur bearbeitet werden, wenn keine der logischen Partitionen in der erweiterten Partition eingebunden ist.

source: <shortcut><keycap>Del</keycap></shortcut> <guimenu>Partition</guimenu> <guimenuitem>Delete</guimenuitem>
de: <shortcut><keycap>Del</keycap></shortcut> <guimenu>Partition</guimenu> <guimenuitem>Löschen</guimenuitem>

source: <action>Deletes a partition</action>: This command deletes the currently selected partition.
de: <action>Löscht eine Partition</action>: Dieser Befehl löscht die aktuell ausgewählte Partition.

source: This command is only enabled if a partition is selected that is not currently mounted. For an extended partition, it is only enabled if it does not contain any logical partitions.
de: Dieser Befehl ist nur verfügbar, wenn eine Partition ausgewählt ist, die nicht eingebunden ist. Eine erweiterte Partition kann nur gelöscht werden, wenn sie keine logischen Partitionen enthält.

source: Warning: Possible loss of data
de: Achtung: Dieser Befehl kann zu Datenverlust führen

source: Deleting a partition means that all data on the partition is destroyed.
de: Das Löschen einer Partition führt zur Vernichtung aller auf der Partition befindlichen Daten.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>C</keycap></keycombo></shortcut> <guimenu>Partition</guimenu> <guimenuitem>Copy</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>C</keycap></keycombo></shortcut> <guimenu>Partition</guimenu> <guimenuitem>Kopieren</guimenuitem>

source: <action>Copies a partition</action>: This command copies the currently selected partition to &partman;'s clipboard.
de: <action>Kopiert eine Partition</action>: Dieser Befehl kopiert die aktuell ausgewählte Partition in die Zwischenablage von &partman;.

source: This command is only enabled if a partition is selected that is not currently mounted and whose file system can be copied. Extended partitions can not be copied.
de: Dieser Befehl ist nur verfügbar, wenn eine Partition ausgewählt ist, die nicht eingebunden ist und deren Dateisystem kopiert werden kann. Erweiterte Partitionen können nicht kopiert werden.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>V</keycap></keycombo></shortcut> <guimenu>Partition</guimenu> <guimenuitem>Paste</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>V</keycap></keycombo></shortcut> <guimenu>Partition</guimenu> <guimenuitem>Einfügen</guimenuitem>

source: <action>Paste a partition</action>: This command pastes the partition from &partman;'s clipboard to the currently selected partition or unallocated area.
de: <action>Fügt eine Partition ein</action>: Dieser Befehl fügt eine Partition aus der Zwischenablage von &partman; in die aktuell ausgewählte Partition oder nicht zugewiesenen Speicherbereich ein.

source: When pasting to an unallocated area, a dialog will open allowing you to move or grow the inserted copy. When overwriting an existing partition this dialog will not be shown.
de: Beim Einfügen in einen nicht zugewiesenen Bereich erscheint ein Dialog, in dem Sie die einzufügende Partition verschieben oder Vergrößern können. Dieser Dialog erscheint nicht beim Überschreiben einer bereits existierenden Partition.

source: This command is only enabled if a partition is currently in the clipboard and a valid target (either a partition or an unallocated area) is selected. The target must also be large enough to hold the source and can not be mounted. You can not copy a partition onto itself.
de: Der Befehl ist nur verfügbar, wenn eine Partition in der Zwischenablage liegt und ein gültiges Ziel (entweder eine Partition oder nicht zugewiesener Speicherplatz) ausgewählt ist. Des Weiteren muss das Ziel groß genug für die einzufügende Partition sein und darf nicht eingebunden sein. Eine Partition kann nicht auf sich selbst kopiert werden.

source: Pasting a partition on an existing one means that all data on the existing partition is destroyed and replaced with the data from the pasted partition.
de: Das Einfügen einer Partition in eine bereits existierende führt zu einem unumkehrbaren Überschreiben aller Daten auf der bereits existierenden Partition.

source: <guimenu>Partition</guimenu> <guimenuitem>Mount/Unmount</guimenuitem>
de: <guimenu>Partition</guimenu> <guimenuitem>Einbinden/Einbindung lösen</guimenuitem>

source: <action>Mounts or umounts a partition</action>: This command mounts or unmounts the selected partition, depending on its current state.
de: <action>Bindet eine Partition ein oder löst die Einbindung</action>: Dieser Befehl bindet eine ausgewählte Partition ein, wenn sie nicht eingebunden ist oder löst deren Einbindung, wenn sie eingebunden ist.

source: This command is only enabled if a partition is selected that can be mounted or unmounted. If the operating system does not know a mount point for the partition you can not mount it from &partman;.
de: Dieser Befehl ist nur verfügbar, wenn eine Partition ausgewählt ist, die eingebunden werden kann bzw. deren Einbindung gelöst werden kann. Wenn dem Betriebssystem der Pfad, an dem die Partition eingebunden werden soll, nicht bekannt ist, kann &partman; sie nicht einbinden.

source: <guimenu>Partition</guimenu> <guimenuitem>Check</guimenuitem>
de: <guimenu>Partition</guimenu> <guimenuitem>Prüfen</guimenuitem>

source: <action>Checks a partition</action>: This command checks the selected partition and its file system for errors and tries to correct any problems it finds. During this process the file system on the partition will also be resized to fill the partition completely.
de: <action>Überprüft eine Partition</action>: Dieser Befehl überprüft eine ausgewählte Partition und deren Dateisystem auf Fehler und versucht, gefundene Fehler zu beheben. Während dieses Prozesses wird die Größe des Dateisystems auf der Partition geändert, sodass es die komplette Partition umfasst.

source: This command is only enabled if a partition is selected that can be checked and is not currently mounted.
de: Dieser Befehl ist nur verfügbar, wenn eine Partition ausgewählt ist, die überprüft werden kann und die nicht eingebunden ist.

source: <guimenu>Partition</guimenu> <guimenuitem>Backup</guimenuitem>
de: <guimenu>Partition</guimenu> <guimenuitem>Sichern</guimenuitem>

source: <action>Backs up a partition</action>: This command backs up the file system on the selected partition to a file. You will be asked where to store the image file after activating this command.
de: <action>Sichert eine Partition</action>: Dieser Befehl sichert das Dateisystem auf einer ausgewählten Partition in eine Datei. Nach Auswahl des Befehls werden Sie dazu aufgefordert, den Speicherort für die Abbilddatei anzugeben.

source: The created image file is a sector-for-sector copy of the file system on the partition. It is not compressed and does not have any additional meta information or header added to it, thus it can be directly mounted using a loop device outside of &partman; if the operation system supports that.
de: Beim Sichern einer Partition in eine Abbilddatei wird das Dateisystem Sektor für Sektor in die Abbilddatei geschrieben. Das Abbild ist nicht komprimiert und enthält keinerlei zusätzliche Meta-Informationen oder Kenninformationen und kann daher direkt als Gerät außerhalb von &partman; eingebunden werden, wenn dies vom Betriebssystem unterstützt wird.

source: This command is only enabled if a partition is selected and the file system on it can be backed up. The partition must also not be mounted.
de: Dieser Befehl ist nur verfügbar, wenn eine Partition ausgewählt ist, die gesichert werden kann und die nicht eingebunden ist.

source: <guimenu>Partition</guimenu> <guimenuitem>Restore</guimenuitem>
de: <guimenu>Partition</guimenu> <guimenuitem>Wiederherstellen</guimenuitem>

source: <action>Restores a partition</action>: This command restores a file system from an image file to a partition. You will be asked for the name of the image file to restore after activating this command. The target to restore to must be large enough for the image file.
de: <action>Stellt eine Partition wieder her</action>: Dieser Befehl stellt das Dateisystem einer Abbilddatei auf eine Zielpartition wieder her. Nach Auswahl des Befehls werden Sie dazu aufgefordert, den Speicherort der Abbilddatei anzugeben. Die Zielpartition muss groß genug für die Abbilddatei sein.

source: The command is only enabled if either an unallocated area is selected or a partition that is not currently mounted.
de: Dieser Befehl ist nur verfügbar, wenn nicht zugewiesener Speicherplatz oder eine Partition, die nicht eingebunden ist, ausgewählt ist.

source: Restoring a partition on an existing one means that all data on the existing partition is destroyed and replaced with the data from the restored image file.
de: Das Wiederherstellen einer Partition in eine bereits existierende führt zu einem unumkehrbaren Überschreiben aller Daten auf der bereits existierenden Partition.

source: <guimenu>Partition</guimenu> <guimenuitem>Properties</guimenuitem>
de: <guimenu>Partition</guimenu> <guimenuitem>Eigenschaften</guimenuitem>

source: <action>Shows a partition's properties</action>: This command shows a dialog with information about the currently selected partition or unallocated space.
de: <action>Zeigt die Eigenschaften einer Partition</action>: Dieser Befehl zeigt einen Dialog mit Informationen über die aktuell ausgewählte Partition oder den nicht zugewiesenen Speicherplatz an.

source: What is displayed and what can be modified in this dialog depends on the type of partition, the type of the file system on the partition and on the partition being currently mounted or not.
de: Die angezeigten Informationen und Änderungsmöglichkeiten in diesem Dialog hängen vom Typ der Partition und des Dateisystems auf der Partition ab, sowie davon, ob die Partition eingebunden ist oder nicht.

source: Not all file systems, for example, support setting a label. It is also generally not possible to modify any properties if the partition is mounted.
de: Das Setzen von Bezeichnungen wird beispielsweise nicht von jedem Dateisystem unterstützt. Des Weiteren ist es nicht möglich, Eigenschaften zu ändern, wenn die Partition eingebunden ist.

source: This is a list of all partition and file system properties that can in general be modified in this dialog:
de: Die folgende Liste enthält alle Eigenschaften von Partitionen und Dateisystemen, die über diesen Dialog geändert werden können:

source: Set or modify a file system's label
de: Setzen oder Ändern der Bezeichnung für ein Dateisystem.

source: Change the partition's file system.
de: Verändern des Dateisystems auf der Partition.

source: Changing the file system for a partition always means that all data on the partition is destroyed.
de: Das Verändern des Dateisystems einer Partition führt immer dazu, dass alle Daten auf der Partition unwiederbringlich gelöscht werden.

source: Recreate the file system on the partition
de: Neuerstellung des Dateisystems auf der Partition
