Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/extragear-sysadmin/partitionmanager_referencemanual.po
Languages: de

source: Recreating a file system on a partition always means that all data on the partition is destroyed. Recreating a file system should only be used as a last resort if the file system on a partition cannot be repaired anymore.
de: Die Neuerstellung des Dateisystems einer Partition führt immer dazu, dass alle Daten auf der Partition unwiederbringlich gelöscht werden. Diese Option sollte nur als letzte Lösungsmöglichkeit genutzt werden, wenn das Dateisystem auf einer Partition nicht mehr repariert werden kann.

source: Change a partition's flags
de: Änderung der Schalter einer Partition

source: Depending on the type of partition table used, there will be several flags available for each partition on the partition table. In most cases, modifying the flags is not necessary and should be considered an advanced feature.
de: Abhängig vom Typ der verwendeten Partitionstabelle gibt es verschiedene Schalter für jede Partition in der Partitionstabelle. In den meisten Fällen ist es nicht notwendig, Schalter von Partitionen zu verändern, weshalb dieser Befehl für fortgeschrittene Benutzer gedacht ist.

source: The command is only enabled if either an unallocated area or a partition is selected.
de: Dieser Befehl ist nur verfügbar, wenn entweder nicht zugewiesener Speicherplatz oder eine Partition ausgewählt ist.

source: The <guimenu>Settings</guimenu> Menu
de: Das Menü <quote>Einstellungen</quote>

source: This is the common <guimenu>Settings</guimenu> menu present in most &kde; applications. Please see the &kde; documentation for details on this menu.
de: Dies ist das in &kde; standardmäßig verwendete Menü für <guimenu>Einstellungen</guimenu>. Details zu den verfügbaren Befehlen erhalten Sie in der Dokumentation zu &kde;.

source: The <guimenu>Help</guimenu> Menu
de: Das Menü <quote>Hilfe</quote>
