Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/extragear-sysadmin/partitionmanager_glossary.po
Languages: de

source: Command
de: Befehl

source: In &partman; commands are what <link linkend="glossary-job">jobs</link> are made up of. These are very low level steps being taken, often executed by an external tool, and only visible in the detailed progress report.
de: In &partman; besteht eine <link linkend="glossary-job">Einzelaufgabe</link> aus mehreren Befehlen. Es handelt sich dabei um systemnahe Befehle, die oftmals von externen Dienstprogrammen ausgeführt werden und lediglich im detaillierten Fortschrittsbericht angezeigt werden.

source: The user normally does not have to bother with commands at all.
de: Der Benutzer muss sich normalerweise nicht mit Befehlen befassen.

source: Cylinder
de: Zylinder

source: A unit used to divide up a <link linkend="glossary-device">device</link>. Some operating systems and many disk tools require <link linkend="glossary-partition">partitions</link> to begin and end on a cylinder. &partman; therefore automatically snaps partitions to cylinder boundaries when changing their start or end.
de: Eine Einheit, die zur Aufteilung eines <link linkend="glossary-device">Geräts</link> verwendet wird. Einige Betriebssysteme und viele Dienstprogramme zur Festplattenverwaltung erwarten <link linkend="glossary-partition">Partitionen</link>, die bei einem Zylinder beginnen und enden. &partman; setzt daher Partitionen innerhalb von Zylindergrenzen, wenn ihr Anfang oder Ende geändert wird.

source: Cylinder Size
de: Zylindergröße

source: The number of <link linkend="glossary-sector">sectors</link> per <link linkend="glossary-cylinder">cylinder</link> on a <link linkend="glossary-device">device</link>. Calculated as the number of <link linkend="glossary-head">heads</link> multiplied by the number of <link linkend="glossary-sector">sectors</link> per track.
de: Die Anzahl von <link linkend="glossary-sector">Sektoren</link> pro <link linkend="glossary-cylinder">Zylinder</link> auf einem <link linkend="glossary-device">Gerät</link>. Berechnet durch Multiplikation der Anzahl der <link linkend="glossary-head">Köpfe</link> mit der Anzahl von <link linkend="glossary-sector">Sektoren</link> pro Spur.

source: Device
de: Gerät

source: A physical disk device. Physical disk devices are divided into logical sections called <link linkend="glossary-partition">partitions</link> with the use of <link linkend="glossary-partitiontable">partition tables</link>.
de: Ein physikalisches Platten-Gerät. Physikalische Platten-Geräte sind unter Verwendung einer <link linkend="glossary-partitiontable">Partitionstabelle</link> in logische Teile namens <link linkend="glossary-partition">Partitionen</link> eingeteilt.

source: Disk Label
de: Festplattenbezeichnung

source: Another name for a <link linkend="glossary-partitiontable">partition table</link> stemming from the SUN/BSD world.
de: Ein andere Bezeichnung für eine <link linkend="glossary-partitiontable">Partitionstabelle</link> aus der SUN/BSD-Welt.

source: They are easy to mix up, but a disk label has nothing to do with a <link linkend="glossary-filesystemlabel">file system label</link>.
de: Dieser Begriff ist leicht mit der <link linkend="glossary-filesystemlabel">Bezeichnung des Dateisystems</link> zu verwechseln, hat damit jedoch nichts zu tun.

source: See <ulink url="http://en.wikipedia.org/wiki/BSD_disklabel">this Wikipedia entry</ulink> for details on the name.
de: In diesem <ulink url="http://en.wikipedia.org/wiki/BSD_disklabel">Wikipedia Artikel</ulink> finden Sie genauere Informationen zum Namen.

source: Extended Partition
de: Erweiterte Partition

source: A <link linkend="glossary-partition">partition</link> that contains other partitions. Extended partitions can only be <link linkend="glossary-primarypartition">primary partitions</link> themselves. Whether extended partitions are available or not depends on the <link linkend="glossary-partitiontable">partition table</link> type used. MS-DOS partition tables allow one extended partition per <link linkend="glossary-device">device</link>.
de: Eine <link linkend="glossary-partition">Partition</link>, die andere Partitionen enthält. Erweiterte Partitionen können nur <link linkend="glossary-primarypartition">primäre Partitionen</link> sein. Es hängt vom Typ der <link linkend="glossary-partitiontable">Partitionstabelle</link> ab, ob erweiterte Partitionen verfügbar sind oder nicht. Partitionstabellen vom Typ MS-DOS erlauben eine erweiterte Partition pro <link linkend="glossary-device">Gerät</link>.

source: File System
de: Dateisystem

source: A file system defines how the storage of data (files with their metadata, folders and their metadata, free space) is organized within a <link linkend="glossary-partition">partition</link>. There are various different types of file systems, some coming originally from the Unix/Linux world, some not. Examples for commonly used file systems on Unix/Linux are ext2, ext3, reiserfs and xfs.
de: Ein Dateisystem legt fest, wie die Daten (Dateien inklusive Metadaten, Verzeichnisse inklusive Metadaten, freier Speicherplatz) innerhalb einer <link linkend="glossary-partition">Partition</link> geordnet sind. Es gibt viele verschiedene Dateisysteme; einige davon stammen aus der Unix/Linux-Welt, andere nicht. Häufig verwendete Dateisysteme auf Unix/Linux sind beispielsweise ext2, ext3, reiserfs und xfs.

source: File System Label
de: Bezeichnung des Dateisystems

source: A title of a file system. Some file systems (among them ext2/3/4, FAT16/32 and NTFS) support setting a label for the file system so it can be identified in tools like &partman; or other applications.
de: Bezeichnung eines Dateisystems. Einige Dateisysteme (unter anderem ext2/3/4, FAT16/32 und NTFS) unterstützen das Setzen von Bezeichnungen für ein Dateisystem, damit es von Dienstprogrammen wie &partman; oder anderen Anwendungen erkannt werden kann.

source: They are easy to mix up, but a file system label has nothing to do with a <link linkend="glossary-disklabel">disk label</link>.
de: Die Bezeichnung von Dateisystemen kann leicht mit der <link linkend="glossary-disklabel">Festplattenbezeichnung</link> verwechselt werden.

source: Flag
de: Schalter

source: Head
de: Kopf

source: A unit used to divide up a <link linkend="glossary-device">device</link>.
de: Eine Einheit zur Aufteilung eines <link linkend="glossary-device">Gerätes</link>.

source: <glossterm>Job</glossterm>
de: <glossterm>Einzelaufgabe</glossterm>

source: In &partman; a number of jobs is what <link linkend="glossary-operation">operations</link> are made up of. You normally do not have to bother with jobs at all; it only becomes apparent when applying the list of pending operations: &partman; will then show a progress dialog that is made up of all operations and their jobs and show which operation and which job is currently being executed.
de: In &partman; bestehen <link linkend="glossary-operation">Operationen</link> aus mehreren Einzelaufgaben. Um diese Einzelaufgaben müssen Sie sich im Regelfall nicht kümmern; sie werden lediglich sichtbar, wenn die Liste der ausstehenden Operationen angewendet wird: in diesem Fall zeigt &partman; einen Fortschrittsdialog an, der aus allen Operationen und deren Einzelaufgaben besteht, um anzuzeigen, welche Operation und welche Einzelaufgabe davon im Moment bearbeitet werden.

source: Label
de: Bezeichnung

source: Either a <link linkend="glossary-disklabel">disk label</link> or a <link linkend="glossary-filesystemlabel">file system label</link>.
de: Entweder eine <link linkend="glossary-disklabel">Festplattenbezeichnung</link> oder eine <link linkend="glossary-filesystemlabel">Dateisystembezeichnung</link>.

source: Logical Partition
de: Logische Partition

source: A <link linkend="glossary-partition">partition</link> inside an <link linkend="glossary-extendedpartition">extended partition</link>.
de: Eine <link linkend="glossary-partition">Partition</link> innerhalb einer <link linkend="glossary-extendedpartition">logischen Partition</link>.

source: &partman; divides the work it does up in operations, <link linkend="glossary-job">jobs</link> and <link linkend="glossary-command">commands</link>.
de: &partman; teilt seine Aufgaben in Operationen, <link linkend="glossary-job">Einzelaufgaben</link> und <link linkend="glossary-command">Befehle</link> auf.

source: Operations are the most visible of the three. If you pick an action in the graphical user interface, this will likely result in a new operation being added to the list of pending operations. The idea behind that is: You will most probably want to set up quite a number of steps to transform the current state of your disk devices to the state you have in mind. Some of these steps may take quite a long time to execute (like copying a large file system or resizing a file system that is nearly full). To save you from having to sit in front of your computer for a long time waiting for one step to finish and then starting the next one, operations allow you to exactly specify how the computer's devices should look like once everything is finished, then let &partman; apply the operations and come back when it has executed all of them.
de: Operationen werden vom Benutzer am häufigsten verwendet. Wenn Sie eine Aktion in der grafischen Benutzeroberfläche auswählen, führt dies vermutlich dazu, dass eine neue Operation zur Liste ausstehender Operationen hinzugefügt wird. Die Idee dahinter: mit hoher Wahrscheinlichkeit soll eine größere Anzahl von Schritten ausgeführt werden, um den aktuellen Status Ihrer Festplatten in einen neuen Status zu überführen. Einige dieser Teilaufgaben können eine lange Zeit in Anspruch nehmen (beispielsweise das Kopieren großer Dateisysteme oder die Größenänderung eines Dateisystems mit wenig freiem Speicherplatz). Damit Sie nicht auf die Fertigstellung der einzelnen Schritte warten müssen, bevor Sie den nächsten Schritt starten können, können Sie mit Operationen die Geräte Ihres Computers so einrichten, wie der Endzustand nach Anwendung aller Änderungen aussehen soll. &partman; wird dann alle Operationen nacheinander ausführen.

source: Operations are kept in a list of pending operations. As long as an operation has not been applied it can still be <link linkend="menu-edit-undo">taken back easily</link> and nothing will have been modified.
de: Operationen werden in der Liste ausstehender Operationen gespeichert. Solange eine Operation noch nicht angewandt wurde, kann sie jederzeit <link linkend="menu-edit-undo">rückgängig gemacht werden</link>, ohne dass eine Änderung vorgenommen wird.

source: A section of a <link linkend="glossary-device">hard disk device</link> that can hold a <link linkend="glossary-filesystem">file system</link> or other partitions. Without at least one valid partition, a disk can not be used.
de: Ein Teil der <link linkend="glossary-device">Festplatte</link>, der ein <link linkend="glossary-filesystem">Dateisystem</link> oder andere Partitionen enthält. Eine Festplatte kann nur verwendet werden, wenn Sie mindestens eine gültige Partition enthält.

source: Partition Flag
de: Partitionsschalter

source: A marker for a <link linkend="glossary-partition">partition</link>. The availability of these flags depends on the type of <link linkend="glossary-partitiontable">partition table</link> used.
de: Ein Schalter für eine <link linkend="glossary-partition">Partition</link>. Der Typ der verwendeten <link linkend="glossary-partitiontable">Partitionstabelle</link> gibt vor, ob und welche Schalter verfügbar sind.

source: Partition Table
de: Partitionstabelle

source: A small section at the beginning of a <link linkend="glossary-device">device</link> used to store information about the layout of the device's <link linkend="glossary-partition">partitions</link>. There are different types of partition tables, each with their own limitations.
de: Ein kleiner Bereich am Anfang eines <link linkend="glossary-device">Gerätes</link>, das Informationen über die Anordnung der <link linkend="glossary-partition">Partitionen</link> auf dem Gerät enthält. Es gibt verschiedene Typen von Partitionstabellen, wobei jede spezielle Beschränkungen mit sich bringt.

source: Sometimes also referred to as <quote>disk label</quote>.
de: Manchmal werden Partitionen auch <quote>Festplattenbezeichnung</quote> genannt.

source: Primary Partition
de: Primäre Partition

source: A <link linkend="glossary-partition">partition</link> directly inside a <link linkend="glossary-partitiontable">partition table</link>, as opposed to <link linkend="glossary-logicalpartition">logical partitions</link>, which are in <link linkend="glossary-extendedpartition">extended partitions</link>.
de: Eine <link linkend="glossary-partition">Partition</link> direkt innerhalb einer <link linkend="glossary-partitiontable">Partitionstabelle</link>, im Gegensatz zu <link linkend="glossary-logicalpartition">logischen Partitionen</link>, die in <link linkend="glossary-extendedpartition">erweiterten Partitionen</link> eingebettet sind.

source: <link linkend="glossary-partitiontable">Partition tables</link> usually impose restrictions on the maximum number of primary partitions that can be created on a <link linkend="glossary-device">device</link>. For MS-DOS type partition tables, for example, this maximum number is four.
de: <link linkend="glossary-partitiontable">Partitionstabellen</link> geben vor, wie viele primäre Partitionen maximal auf einem <link linkend="glossary-device">Gerät</link> erstellt werden können. MS-DOS Partitionstabellen ermöglichen beispielsweise nur vier primäre Partitionen.

source: Sector
de: Sektor

source: A unit used to divide up a <link linkend="glossary-device">device</link>. <link linkend="glossary-partition">Partitions</link> must always begin and end on a sector.
de: Eine Einheit zur Aufteilung eines <link linkend="glossary-device">Gerätes</link>. <link linkend="glossary-partition">Partitionen</link> müssen stets auf einem Sektor beginnen und enden.

source: Sector Size
de: Sektorgröße

source: The number of bytes per <link linkend="glossary-sector">sector</link> on a <link linkend="glossary-device">device</link>. The sector size of most devices in use today is 512 bytes.
de: Die Anzahl der Byte je <link linkend="glossary-sector">Sektor</link> auf einem <link linkend="glossary-device">Gerät</link>. Als Sektorgröße wird heute normalerweise 512 Byte benutzt.
