Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/extragear-sysadmin/partitionmanager_usermanual.po
Languages: de

source: Using &partman;
de: &partman; verwenden

source: The Main Window
de: Das Hauptfenster

source: Besides the main view showing the currently selected device in a graphical and a tree view, &partman; uses &Qt;'s <quote>dock widgets</quote> or panels to display some information and allow selections. See the following screen shot for an overview of &partman;'s main window.
de: Neben der Hauptansicht, die das aktuell ausgewählte Gerät in einer grafischen und einer Baumansicht darstellt, verwendet &partman; &Qt;-Bedienelemente oder Kontrollleisten zur Auswahl von Elementen und um Informationen anzuzeigen. Auf dem folgenden Bildschirmfoto ist das Hauptfenster von &partman; dargestellt.

source: &partman;'s main window
de: Hauptfenster von &partman;

source: Main Window
de: Hauptfenster

source: Menubar: The menu bar presents some custom and some non-standard menus to choose actions to perform. All commands are described in detail in <xref linkend="reference"/>.
de: Menüleiste: Die Menüleiste stellt gebräuchliche und auch seltener verwendete Menüs zur Verfügung, um Aktionen auszuführen. Alle Befehle werden detailliert im Abschnitt <xref linkend="reference"/> beschrieben.

source: Toolbar: &partman;'s tool bar is a &kde; 4 standard tool bar. It can be fully customized; for details see <xref linkend="menu-settings"/>.
de: Werkzeugleiste: Die Werkzeugleiste in &partman; ist eine Standard-Werkzeugleiste, wie sie in &kde; 4 zum Einsatz kommt. Sie kann beliebig angepasst werden; nähere Details hierzu finden Sie im Kapitel <xref linkend="menu-settings"/>.

source: Devices Panel: This panel lists all <glossterm linkend="glossary-device">devices</glossterm> found on your computer that &partman; can handle. Select a device in this panel to view or modify it in the graphical device view or in the tree device view.
de: Geräteliste: Diese Liste zeigt alle <glossterm linkend="glossary-device">Geräte</glossterm> auf Ihrem Rechner an, die &partman; verwalten kann. Wählen Sie in dieser Liste ein Gerät aus, um es in der grafischen Geräteansicht oder der Baumansicht anzuzeigen und zu bearbeiten.

source: Graphical Device View: In this view &partman; shows a graphical representation of the currently selected device. Each of the device's <glossterm linkend="glossary-partition">partitions</glossterm> has its own box with device node name (<quote>sda1</quote> for the first partition in the screenshot above) and usage information (the dark violet area in the screenshot).
de: Grafische Geräteansicht: Diese Ansicht stellt eine grafische Ansicht des aktuell ausgewählten Gerätes dar. Jede <glossterm linkend="glossary-partition">Partition</glossterm> auf dem Gerät wird durch ein eigenes Rechteck repräsentiert, welches mit dem Knotennamen (<quote>sda1</quote> für die erste Partition im Bildschirmfoto) beschriftet ist und in welchem der belegte Speicherplatz angezeigt wird (entspricht der dunkel-violetten Fläche im Bildschirmfoto).

source: <glossterm linkend="glossary-extendedpartition">Extended partitions</glossterm> are visually distinct by their extra border (light green in the screenshot above) around them.
de: <glossterm linkend="glossary-extendedpartition">Erweiterte Partitionen</glossterm> werden grafisch durch einen zusätzlichen Rahmen um das entsprechende Rechteck repräsentiert (entspricht dem hellgrünen Rahmen im Bildschirmfoto).

source: You can select a partition by clicking on it in the graphical device view. A double click opens <link linkend="menu-partition-properties">the partition's properties dialog</link>. A right click shows the partition context menu.
de: Sie können sich eine Partition anzeigen lassen, indem Sie sie in der grafischen Geräteansicht anklicken. Mit einem Doppelklick auf eine Partition öffnet sich <link linkend="menu-partition-properties">der Eigenschaftsdialog der Partition</link>. Mit einem Rechtsklick können Sie sich das Kontextmenü der Partition anzeigen lassen.

source: Tree Device View: The tree device view shows extended information about each partition on the selected device. The currently selected partition is highlighted. Double-clicking a partition opens <link linkend="menu-partition-properties">the partition's properties dialog</link>. A right click shows the partition context menu.
de: Die Baumansicht: Die Baumansicht zeigt erweiterte Informationen über jede Partition auf dem ausgewählten Gerät an. Die aktuell ausgewählte Partition ist hervorgehoben. Mit einem Doppelklick auf eine Partition öffnet sich <link linkend="menu-partition-properties">der Eigenschaftsdialog der Partition</link>. Mit einem Rechtsklick können Sie sich das Kontextmenü der Partition anzeigen lassen.

source: Information Panel: The information panel shows some details about the currently selected device or partition. It is not enabled by default.
de: Informations-Kontrollleiste: Die Informations-Kontrollleiste zeigt Detail-Informationen über das aktuell ausgewählte Gerät oder die ausgewählte Partition an. In der Standardeinstellung wird es nicht angezeigt.

source: Pending Operations Panel: This panel lists all operations that will be executed once you choose <xref linkend="menu-edit-apply"/>.
de: Liste ausstehender Operationen: Diese Liste zeigt alle Operationen an, die bei der Menüauswahl <xref linkend="menu-edit-apply"/> ausgeführt werden.

source: In the screenshot above, one operation is pending: If the user applies the operations now, the <glossterm linkend="glossary-filesystem">file system</glossterm> on /dev/sdb3 will be checked for errors and, if required, repaired.
de: Im oben dargestellten Bildschirmfoto gibt es eine ausstehende Operation: wenn der Benutzer die Operationen nun anwendet, wird das <glossterm linkend="glossary-filesystem">Dateisystem</glossterm> auf /dev/sdb3 auf Fehler hin überprüft und, sofern notwendig, repariert.

source: Statusbar: The status bar shows how many operations are currently pending.
de: Statusleiste: Die Statusleiste zeigt an, wie viele Operationen im Moment noch ausstehen.

source: Log Output Panel: This panel shows log information. It is only of secondary importance for non-advanced users and is not enabled by default.
de: Protokollausgabe: die Protokollausgabe zeigt Protokoll-Informationen an. Da diese Informationen nur für fortgeschrittene Benutzer hilfreich sind, wird die Protokollausgabe standardmäßig nicht angezeigt.
