Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/extragear-sysadmin/partitionmanager_appendix.po
Languages: de

source: How to obtain &partman;
de: Wie Sie &partman; erhalten

source: The main website for &partman; is <ulink url="http://www.partitionmanager.org">www.partitionmanager.org</ulink>. For the most current version, this is the place to go.
de: Die Haupt-Webseite für &partman; ist <ulink url="http://www.partitionmanager.org">www.partitionmanager.org</ulink>. Hier finden Sie auch immer die aktuelle Version von &partman;.

source: Requirements
de: Voraussetzungen

source: In order to successfully use &partman;, you need &kde; 4.2 or later and &Qt; 4.4.0 or later. You do however not need to be logged into &kde; to use it: &partman; will run just fine under any other desktop environment as long as you have the basic &kde; libraries installed.
de: Um &partman; erfolgreich ausführen zu können, benötigen Sie &kde; 4.2 oder neuer und &Qt; 4.4.0 oder neuer. Sie müssen jedoch nicht angemeldet sein: &partman; funktioniert auch unter anderen Arbeitsumgebungen, wenn die Standardbibliotheken von &kde; installiert sind.

source: For a large part of its basic functionality &partman; relies on <ulink url="http://www.gnu.org/software/parted/index.shtml">libparted</ulink>. To generate UUIDs for copied file systems, it uses libuuid, which is part of <ulink url="http://e2fsprogs.sourceforge.net">e2fsprogs</ulink>. It also uses the <ulink url="http://userweb.kernel.org/~kzak/util-linux-ng/">libblkid library from the util-linux-ng project</ulink> to obtain information about partitions and file systems. All of these are required to build or run &partman;.
de: Für den Großteil der Basisfunktionen verwendet &partman; <ulink url="http://www.gnu.org/software/parted/index.shtml">libparted</ulink>. Um UUIDs für kopierte Dateisysteme zu erstellen, wird libuuid verwendet, welches Bestandteil von <ulink url="http://e2fsprogs.sourceforge.net">e2fsprogs</ulink> ist. Des Weiteren wird die <ulink url="http://userweb.kernel.org/~kzak/util-linux-ng/">Bibliothek libblkid des util-linux-ng Projekts verwendet</ulink>, um Informationen über Partitionen und Dateisysteme abzurufen. Alle genannten Bibliotheken werden benötigt, um &partman; zu kompilieren und auszuführen.

source: &partman; makes extensive use of external tools to support a wide range of file systems. A specific tool is only required if you need the support for an operation it provides for a certain file system. For example, if you have no need to resize NTFS file systems you do not require to have <quote>ntfsresize</quote> installed. None of these tools are required to build &partman; from sources.
de: &partman; verwendet viele externe Dienstprogramme, um eine große Anzahl an Dateisystemen zu unterstützen. Spezielle Dienstprogramme werden nur benötigt, wenn die Unterstützung für eine Operation auf einem bestimmten Dateisystem benötigt wird. Wenn Sie beispielsweise die Größe eines NTFS-Dateisystems ändern möchten, muss <quote>ntfsresize</quote> installiert sein. Um &partman; aus den Quellen zu kompilieren, werden jedoch keine dieser Dienstprogramme benötigt.

source: Here is a list of all external tools &partman; can make use of:
de: Hier ist eine Liste aller von &partman; benutzten externen Programme:

source: &debugfsreiser4;: Reads usage information and file system labels for reiser4 file systems. Part of the reiser4progs utility suite that can be downloaded from <ulink url="http://www.kernel.org/pub/linux/utils/fs/reiser4/reiser4progs/"></ulink>.
de: &debugfsreiser4;: Liest Informationen über die Speicherplatzbelegung und Bezeichnungen für das Dateisystem <quote>reiser4</quote>. Teile der Dienstprogramme <quote>reiser4progs</quote> können unter <ulink url="http://www.kernel.org/pub/linux/utils/fs/reiser4/reiser4progs/"></ulink> heruntergeladen werden.

source: &debugreiserfs;: Reads usage information and file system labels for reiserfs file systems. Part of the reiserfsprogs utility suite that can be downloaded from <ulink url="http://www.kernel.org/pub/linux/utils/fs/reiserfs/"></ulink>.
de: &debugreiserfs;: Liest Informationen über die Speicherplatzbelegung und Bezeichnungen für das Dateisystem reiserfs. Teile der Dienstprogramme reiserfsprogs können unter <ulink url="http://www.kernel.org/pub/linux/utils/fs/reiserfs/"></ulink> heruntergeladen werden.

source: &dumpe2fs;: Reads usage information for ext2/ext3/ext4 file systems. Part of the e2fsprogs utility suite that can be downloaded from <ulink url="http://e2fsprogs.sourceforge.net/"></ulink>.
de: &dumpe2fs;: Liest Information für ext2/ext3/ext4-Dateisysteme. Teile der e2fsprogs-Dienstprogramme können unter <ulink url="http://e2fsprogs.sourceforge.net/"></ulink> heruntergeladen werden.

source: &e2label;: Reads and writes file system labels for ext2/ext3/ext4 file systems. Part of the e2fsprogs utility suite that can be downloaded from <ulink url="http://e2fsprogs.sourceforge.net/"></ulink>.
de: &e2label;: Liest und schreibt Beschreibungen für ext2/ext3/ext4-Dateisysteme. Teile der e2fsprogs Dienstprogramme können unter <ulink url="http://e2fsprogs.sourceforge.net/"></ulink> heruntergeladen werden.

source: &fsckmsdos;: Reads usage information and checks FAT16 and FAT32 file systems. Part of the dosfstools utility suite that can be downloaded from <ulink url="http://www.daniel-baumann.ch/software/dosfstools/"></ulink>.
de: &fsckmsdos;: Liest Informationen über die Speicherplatzbelegung und überprüft FAT16- und FAT32-Dateisysteme. Teile der Dienstprogramme <quote>dosfstools</quote> können unter <ulink url="http://www.daniel-baumann.ch/software/dosfstools/"></ulink> heruntergeladen werden.

source: &hfsck;: Reads file system labels and checks HFS file systems. Part of the hfsutils utility suite that can be downloaded from <ulink url="http://www.mars.org/home/rob/proj/hfs/"></ulink>.
de: &hfsck;: Liest Beschreibungen und überprüft HFS-Dateisysteme. Teile der Dienstprogramme <quote>hfsutils</quote> können unter <ulink url="http://www.mars.org/home/rob/proj/hfs/"></ulink> heruntergeladen werden.

source: &hpfsck;: Checks HFS+ file systems. Part of the hfsplusutils utility suite that can be downloaded from <ulink url="http://www.penguinppc.org/historical/hfsplus/"></ulink>.
de: &hpfsck;: Überprüft das Dateisystem HFS+. Teile der Dienstprogramme <quote>hfsplusutils </quote>können unter <ulink url="http://www.penguinppc.org/historical/hfsplus/"></ulink> heruntergeladen werden.

source: &jfsdebugfs;: Reads usage information for JFS file systems. Part of the jfsutils utility suite that can be downloaded from <ulink url="http://jfs.sourceforge.net/"></ulink>.
de: &jfsdebugfs;: Liest Informationen über die Speicherplatzbelegung für das JFS-Dateisystem. Teile der Dienstprogramme <quote>jfsutils</quote> können unter <ulink url="http://jfs.sourceforge.net/"></ulink> heruntergeladen werden.

source: &jfstune;: Reads and writes file system labels for JFS file systems. Part of the jfsutils utility suite that can be downloaded from <ulink url="http://jfs.sourceforge.net/"></ulink>.
de: &jfstune;: Liest und schreibt Bezeichnungen für JFS-Dateisysteme. Teile der Dienstprogramme jfsutils können unter <ulink url="http://jfs.sourceforge.net/"></ulink> heruntergeladen werden.

source: &ntfslabel;: Reads and writes file system labels for NTFS file systems. Part of the ntfsprogs utility suite that can be downloaded from <ulink url="http://www.linux-ntfs.org/"></ulink>.
de: &ntfslabel;: Liest und schreibt Bezeichnungen für NTFS-Dateisysteme. Teile der Dienstprogramme ntfsprogs können unter <ulink url="http://www.linux-ntfs.org/"></ulink> heruntergeladen werden.

source: &ntfsresize;: Reads usage information, checks and resizes NTFS file systems. Part of the ntfsprogs utility suite that can be downloaded from <ulink url="http://www.linux-ntfs.org/"></ulink>.
de: &ntfsresize;: Liest Informationen über die Speicherplatzbelegung, überprüft NTFS-Dateisysteme und ändert deren Größe. Teile der Dienstprogramme <quote>ntfsprogs</quote> können unter <ulink url="http://www.linux-ntfs.org/"></ulink> heruntergeladen werden.

source: &swapoff;: Deactivates swap file systems. Part of the util-linux-ng utility suite that can be downloaded from <ulink url="ftp://ftp.us.kernel.org/pub/linux/utils/util-linux-ng/"></ulink>.
de: &swapoff;: Deaktiviert swap-Dateisysteme. Teile der Dienstprogramme util-linux-ng können unter <ulink url="ftp://ftp.us.kernel.org/pub/linux/utils/util-linux-ng/"></ulink> heruntergeladen werden.

source: &swapon;: Activates swap file systems. Part of the util-linux-ng utility suite that can be downloaded from <ulink url="ftp://ftp.us.kernel.org/pub/linux/utils/util-linux-ng/"></ulink>.
de: &swapon;: Aktiviert swap-Dateisysteme. Teile der Dienstprogramme util-linux-ng können unter <ulink url="ftp://ftp.us.kernel.org/pub/linux/utils/util-linux-ng/"></ulink> heruntergeladen werden.

source: &volid;: Reads file system labels for linuxswap file systems. Part of udev that can be downloaded from <ulink url="http://www.us.kernel.org/pub/linux/utils/kernel/hotplug/"></ulink>.
de: &volid;: Liest Bezeichnungen für linuxswap-Dateisysteme. Teile von udev können unter <ulink url="http://www.us.kernel.org/pub/linux/utils/kernel/hotplug/"></ulink> heruntergeladen werden.

source: &xfsdb;: Reads usage information and reads and writes file system labels for XFS file systems. Part of the xfsprogs utility suite that can be downloaded from <ulink url="ftp://oss.sgi.com/projects/xfs/cmd_tars/"></ulink>.
de: &xfsdb;: Liest Informationen über die Speicherplatzbelegung, liest und schreibt Bezeichnungen für das XFS-Dateisystem. Teile der Dienstprogramme xfsprogs können unter <ulink url="ftp://oss.sgi.com/projects/xfs/cmd_tars/"></ulink> heruntergeladen werden.

source: Compilation and Installation
de: Kompilierung und Installation

source: Further Reading
de: Weiterführende Lektüre

source: <ulink url="http://www.linfo.org/">The Linux Information Project</ulink> has a ton of information on many aspects of Linux. Their article on <ulink url="http://www.linfo.org/partition.html">partitions</ulink> is very informative. But also see their entries on <ulink url="http://www.linfo.org/partition_table.html">partition tables</ulink>, <ulink url="http://www.linfo.org/hdd.html">hard disk devices</ulink> and <ulink url="http://www.linfo.org/filesystem.html">file systems</ulink>.
de: <ulink url="http://www.linfo.org/">The Linux Information Project</ulink> stellt viele Informationen über verschiedenste Bereiche in Linux bereit. Der dort verfügbare Artikel über <ulink url="http://www.linfo.org/partition.html">Partitionen</ulink> ist sehr informativ. Des Weiteren gibt es Artikel über <ulink url="http://www.linfo.org/partition_table.html">Partitionstabellen</ulink>, <ulink url="http://www.linfo.org/hdd.html">Festplattengeräte</ulink> und <ulink url="http://www.linfo.org/filesystem.html">Dateisysteme</ulink>.

source: The <ulink url="http://tldp.org/HOWTO/Partition/index.html">Linux Partition HOWTO</ulink> is a basic overview of handling and partitioning disk devices on Linux and the native Linux file systems. It also covers swap partitions.
de: Das <ulink url="http://tldp.org/HOWTO/Partition/index.html">Linux Partition HOWTO</ulink> gibt einen grundlegenden Überblick über das Arbeiten mit und Partitionieren von Festplatten-Geräten auf Linux und Linux-Dateisystemen. Swap-Partitionen werden ebenfalls behandelt.

source: <ulink url="http://www.wikipedia.org">Wikipedia</ulink> has an entry on <ulink url="http://en.wikipedia.org/wiki/Disk_partitioning">disk partitioning</ulink>.
de: Auf der <ulink url="http://www.wikipedia.org">Wikipedia</ulink> gibt es einen Eintrag über <ulink url="http://de.wikipedia.org/wiki/Partition_(Informatik)">Partition (Informatik)</ulink>.
