Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdenetwork/kget.po
Languages: de

source: The &kget; Handbook
de: Das Handbuch zu &kget;

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Frank</firstname><surname>Schütte</surname><affiliation><address><email>F.Schuette@t-online.de</email></address></affiliation><contrib>Übersetzung</contrib></othercredit>

source: &kget; is the download manager for &kde;
de: &kget; ist die Download- Verwaltung für &kde;.

source: download
de: herunterladen

source: Introduction
de: Einleitung

source: Start &kget; (you should see a Drop Target)
de: Starten Sie &kget;, dann wird das Zielfeld angezeigt.

source: Drag and drop the required &URL; in the &kget; window/Drop Target.
de: Ziehen Sie eine Adresse (&URL; und lassen Sie sie über dem Fenster oder Zielfeld von &kget; fallen.

source: <screeninfo>Screenshot of &kget;</screeninfo>
de: <screeninfo>Bildschirmfoto von &kget;</screeninfo>

source: <phrase>Screenshot of &kget;</phrase>
de: <phrase>Bildschirmfoto von &kget;</phrase>

source: &kget; Drop Target
de: Zielfeld von &kget;

source: The &kget; Drop Target has four options.
de: Im Zielfeld von &kget; gibt es vier Einstellungen.

source: <screeninfo>Screenshot of &kget; drop target</screeninfo>
de: <screeninfo>Bildschirmfoto des Zielfelds von &kget;</screeninfo>

source: <phrase>Screenshot of &kget; drop target</phrase>
de: <phrase>Bildschirmfoto des Zielfelds von &kget;</phrase>

source: &kget; Drop Target options
de: Einstellungen für das Zielfeld von &kget;

source: Right click on the drop target to see the options.
de: Klicken Sie mit der &RMBn; auf das Zielfeld, um das Kontextmenü zu öffnen.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>R</keycap></keycombo> </shortcut> <guimenuitem>Start / Resume All</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>R</keycap></keycombo> </shortcut><guimenuitem>Alle starten / wiederaufnehmen</guimenuitem>

source: To start a download or resume all the pending downloads. The shortcut for doing this is <keycombo action="simul">&Ctrl;<keycap>R</keycap></keycombo>
de: Startet das Herunterladen oder setzt alle angefangenen Download wieder fort. Der Kurzbefehl für diese Aktion ist <keycombo action="simul">&Ctrl;<keycap>R</keycap></keycombo>.

source: Show/Hide Main Window
de: Hauptfenster anzeigen/ausblenden

source: This option shows or minimizes the main window to the system tray.
de: Mit dieser Aktion wird das Hauptfenster angezeigt oder ausgeblendet und erscheint minimiert im Systemabschnitt der Kontrollleiste.

source: Sticky
de: Position beibehalten

source: Makes the &kget; drop target undraggable.
de: Mit dieser Einstellung kann das Zielfeld nicht mehr verschoben werden.

source: Quit &kget;
de: &kget; beenden

source: Quits &kget;
de: Beendet &kget;

source: &kget;'s Configuration window
de: Einrichtungsdialog von &kget;

source: <guimenu>Settings</guimenu> <guimenuitem>Configure &kget;</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>&kget; einrichten ...</guimenuitem>

source: Opens the &kget; configuration window
de: Öffnet den Dialog zum Einrichten von &kget;

source: <title>Appearance</title>
de: <title>Erscheinungsbild</title>

source: <screeninfo>Appearance</screeninfo>
de: <screeninfo>Erscheinungsbild</screeninfo>

source: <phrase>Appearance</phrase>
de: <phrase>Erscheinungsbild</phrase>

source: <guimenuitem>Appearance</guimenuitem>
de: <guimenuitem>Erscheinungsbild</guimenuitem>

source: You can modify the various appearance related stuff here.
de: Auf dieser Seiten fnden Sie Einstellungen zum Erscheinungsbild.

source: Show splashscreen
de: Startbildschirm anzeigen

source: Check this check box to show a splashscreen before startup.
de: Aktivieren Sie diese Einstellung, um den Startbildschirm beim Start anzuzeigen.

source: Show drop target
de: Zielfeld anzeigen

source: Uncheck this if you do not want the &kget; Drop Target.
de: Schalten sie diese Einstellung aus, um das Zielfeld auszublenden.

source: Enable animations
de: Animationen aktivieren

source: Enables few fancy animations.
de: Schaltet einige Animationen ein.

source: Groups
de: Gruppen

source: You can group downloads.
de: Hier können Gruppen für Downloads verwaltet werden.

source: <screeninfo>&kget; Groups</screeninfo>
de: <screeninfo>Gruppen in &kget;</screeninfo>

source: <phrase>&kget; Groups</phrase>
de: <phrase>Gruppen in &kget;</phrase>

source: Use default folders for groups as suggestion
de: Standardordner der Gruppen als Vorschlag verwenden

source: Tick this box if you want &kget; to use default folders for your downloads.
de: Ist diese Einstellung aktiviert, werden die Standardordner der Gruppen in &kget; verwendet.

source: Network
de: Netzwerk

source: You can modify your network related settings here.
de: Hier können alle Einstellungen zum Netzwerk vorgenommen werden.

source: <screeninfo>&kget; Network</screeninfo>
de: <screeninfo>Netzwerkeinstellungen für &kget;</screeninfo>

source: <phrase>&kget; Network</phrase>
de: <phrase>Netzwerkeinstellungen für &kget;</phrase>

source: Limit Maximum Downloads Per Group
de: Maximale Anzahl an Downloads pro Gruppe festlegen

source: Check this box if you want Download limits to be implemented.
de: Mit dieser Einstellung kann das Herunterladen begrenzt werden.

source: Number of downloads
de: Anzahl an gleichzeitigen Downloads

source: You can set the maximum simultaneous downloads using this box.
de: Hier dann die maimale Anzahl der gleichzeitigen Downloads eingestellt werden.

source: Speed Limit
de: Geschwindigkeitsbeschränkung

source: Check this box if you want the Global speed limits to be used.
de: Aktivieren Sie dieses Feld, um die Geschwindigkeit des Herunterladens einstellen zu können.

source: Global download limit
de: Globale Downloadbegrenzung

source: Set the maximum global download limit.
de: Geben Sie hier eine globale Grenze für das Herunterladen an.

source: Global upload limit
de: Globale Uploadbegrenzung

source: Set the maximum upload limit.
de: Geben Sie hier eine globale Grenze für das Hochladen an.

source: Reconnect on Error or Broken Connection
de: Bei abgebrochenen Verbindungen erneut verbinden

source: Check this box if you want &kget; to reconnect after an error or a broken connection.
de: Aktivieren Sie diese Einstellung, damit &kget; nach einem Fehler oder einer abgebrochenen Verbindung das Herunterladen erneut wieder eine Verbindung herstellt.

source: Number of retries
de: Versuche

source: Set the maximum number of time &kget; will try to reconnect.
de: Legt die maximale Anzahl für erneute Verbindungsversuche fest.

source: Retry after
de: Erneut verbinden nach

source: Set the retrying interval here (in seconds)
de: Bestimmt die Zeit in Sekunden bis zum erneuten Verbindungsversuch.

source: Web Interface
de: Web-Oberfläche

source: To enable the web interface, check <guilabel>Enable Web Interface</guilabel>; default port is 8080, and you configure any port higher than 1024. Then set <guilabel>User</guilabel> and <guilabel>Password</guilabel>. You can access your web interface at http://127.0.0.1:&lt;port&gt;. You will need to enter the username and password to get access.
de: Klicken Sie auf das Ankreuzfeld, um die <guilabel>Web-Oberfläche zu aktivieren</guilabel>; Als Standardport ist 8080 eingestellt, sie können jeden Port größer als 1024 benutzen. Geben Sie dann <guilabel>Benutzer</guilabel> und <guilabel>Passwort</guilabel> ein. Die Web-Oberfläche erreichen Sie dann unter der &URL; http://127.0.0.1:&lt;port&gt;. Dann müssen Sie Benutzername und Passwort zum Anmeldung eingeben.

source: <screeninfo>&kget; Web Interface</screeninfo>
de: <screeninfo>&kget;-Web-Oberfläche</screeninfo>

source: <phrase>&kget; Web Interface</phrase>
de: <phrase>&kget;-Web-Oberfläche</phrase>

source: Verification
de: Verifizierung

source: Verify your downloads.
de: Einstellungen zum Überprüfen der heruntergeladenen Dateien.

source: <screeninfo>&kget; Verification</screeninfo>
de: <screeninfo>Verifizierung</screeninfo>

source: <phrase>&kget; Verification</phrase>
de: <phrase>Verifizierung</phrase>

source: Using the two methods <guilabel>Checksums</guilabel> and <guilabel>Signature</guilabel> you can verify your downloads. You just have to tick the Automatic verification check box.
de: Mit den beiden Methoden <guilabel>Prüfsummen</guilabel> und <guilabel>Signatur</guilabel> können Sie Ihre heruntergeladenen Dateien überprüfen. Dazu aktivieren Sie das Ankreuzfeld <guilabel>Automatische Verifizierung</guilabel>.

source: Advanced
de: Erweiterte Einstellungen

source: Modify Advanced Options.
de: Hier können erweiterte Einstellungen vorgenommen werden.

source: <screeninfo>&kget; Advanced Options</screeninfo>
de: <screeninfo>Erweiterte Einstellungen für &kget;</screeninfo>

source: <phrase>&kget; Advanced Options</phrase>
de: <phrase>Erweiterte Einstellungen für &kget;</phrase>

source: Disable confirmation dialogs (less verbosity)
de: Bestätigungsfenster abschalten (weniger gesprächig)

source: <action>Disables the confirmation dialogs</action>, which causes verbosity.
de: <action>Schaltet</action> den Bestätigungsdialog ab.

source: Enable system tray icon
de: Symbol in der Kontrollleiste anzeigen

source: This check box enables the &kget; system tray icon.
de: Ist dies aktiv, wird das Symbol für &kget; im Systemabschnitt der Kontrollleiste angezeigt.

source: Execute action after all downloads have been finished
de: Nach Abschluss aller Transfers folgende Aktion ausführen

source: Check this box to enable Quitting &kget; after all downloads have finished. At startup you can choose to Restore Download state. Such as Stop All downloads/ Start All downloads.
de: Mit dieser Einstellung wird &kget; nach dem Herunterladen beendet. Für den Start können Sie auswählen, ob der Downloadstatus wiederhergestellt werden soll.

source: History backend
de: Verlaufsmodul

source: You can choose your history backend as Sqlite or Xml.
de: Hier kann Sqlite oder Xml für die Speicherung des Verlaufs ausgewählt werden.

source: Use as download manager for Konqueror
de: Als Download-Verwaltung für Konqueror verwenden

source: You can set &kget; as your download manager for &konqueror;.
de: Ist dies aktiviert, wird &kget; als Download-Verwaltung für Konqueror verwendet.

source: Monitor clipboard for files to download
de: Zwischenablage auf Dateien zum Herunterladen überwachen

source: Enable &kde; global progress tracking
de: Globale Fortschrittsanzeige von &kde; aktivieren

source: You can set &kget; to show every single download or show overall progress.
de: Wählen Sie hier aus, ob einzelne Downloads oder der Gesamtfortschritt angezeigt wird.

source: Main Window
de: Hauptfenster

source: Overview of &kget;'s Main Window
de: Übersicht des Hauptfensters von &kget;

source: The <guimenu>File</guimenu> Menu
de: Das Menü <guimenu>Datei</guimenu>

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>New Download...</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo> </shortcut> <guimenu>Datei</guimenu> <guimenuitem>Neuer Download ...</guimenuitem>

source: Add a new file to download
de: Fügt eine neue Datei zum Herunterladen hinzu.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>I</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Import Transfers...</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>I</keycap></keycombo></shortcut><guimenu>Datei</guimenu><guimenuitem>Transferliste importieren ...</guimenuitem>

source: Loads a *.kgt, *.metalink, *.meta4 or *.torrent file.
de: Lädt eine *.kgt, *.metalink, *.meta4 or *.torrent Datei.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>E</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Export Transfers List...</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>E</keycap></keycombo></shortcut><guimenu>Datei</guimenu><guimenuitem>Transferliste exportieren ...</guimenuitem>

source: Export the highlighted links to a .kgt file, to be loaded later.
de: Exportiert die hervorgehobenen Verknüpfungen in eine „.kget“-Datei, um die Daten später zu herunterzuladen.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>P</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Export Transfers as Plain Text...</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>P</keycap></keycombo> </shortcut> <guimenu>Datei</guimenu> <guimenuitem>Transferliste als Text exportieren ...</guimenuitem>

source: Exports the links being downloaded as plain text.
de: Exportiert die Verknüpfungen, die heruntergeladen werden, als einfachen Text.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>L</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Import Links...</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>L</keycap></keycombo> </shortcut> <guimenu>Datei</guimenu> <guimenuitem>Verknüpfungen importieren ...</guimenuitem>

source: <screeninfo>Import Links</screeninfo>
de: <screeninfo>Verknüpfungen importieren</screeninfo>

source: <phrase>Import Links</phrase>
de: <phrase>Verknüpfungen importieren</phrase>

source: This action brings up another window, where you can see and manipulate which file to download. Also you can make a selection based on <guilabel>Videos</guilabel>, <guilabel>Images</guilabel>, <guilabel>Audio</guilabel> and <guilabel>Archives</guilabel>. There is also a text box to filter out results.
de: Mit dieser Aktion öffnen Sie einen weiteren Dialog, in dem die Dateien zum Herunterladen angezeigt und bearbeitet werden können. Die Anzeige kann auf <guilabel>Videos</guilabel>, <guilabel>Bilder</guilabel>, <guilabel>Audio</guilabel> and <guilabel>Archive</guilabel> beschränkt werden. Zusätzlich lassen sich die Ergebnisse mit einem Textfeld filtern.

source: <guimenu>File</guimenu> <guimenuitem>Create a Metalink</guimenuitem>
de: <guimenu>Datei</guimenu> <guimenuitem>Einen Metalink erstellen</guimenuitem>

source: Creating a metalink0
de: Erstellen eines Metalinks

source: Creating a Metalink0
de: Erstellen eines Metalinks

source: Select between creating a new Metalink and loading an existing Metalink. Click the <guilabel>Next</guilabel> button to proceed.
de: Wählen Sie zwischen der Erstellung eines neuen Metalinks den Laden eines bereits vorhandenen. Klicken Sie auf <guilabel>Weiter</guilabel> um zur nächsten Seite zu kommen.

source: Creating a metalink1
de: Erstellen eines Metalinks

source: Creating a Metalink1
de: Erstellen eines Metalinks

source: Here you can choose to enter some general optional information. Such as where can this metalink be obtained from (Enter the &URL; in the text box next to <guilabel>Origin</guilabel>).
de: Auf dieser Seite werden allgemeine optionale Informationen zum Metalink eingetragen, zum Beispiel die <guilabel>Herkunft</guilabel> durch Eingabe einer &URL; in das Textfeld.

source: Creating a metalink2
de: Erstellen eines Metalinks

source: Creating a Metalink2
de: Erstellen eines Metalinks

source: Here you have to enter the &URL; from where you are trying to download the file. Also you can enter some optional information such as Preference (Priority) for a particular mirror if you are adding more then one mirrors, for the file you want to download.
de: Geben Sie hier die &URL; für das Herunterladen der Datei ein. Zusätzlich kann die Priorität für einen bestimmten Spiegelserver festgelegt werden, wenn es für die herunterzuladende Datei mehrere Spiegelserver gibt.

source: Creating a metalink 3
de: Erstellen eines Metalinks

source: Creating a Metalink 3
de: Erstellen eines Metalinks

source: You should be able to see a new window where all your files which will be imported will be shown.
de: Dann wird ein neues Fenster mit allen Dateien angezeigt, die importiert werden.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>H</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Transfer History</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>H</keycap></keycombo></shortcut><guimenu>Datei</guimenu><guimenuitem>Transfer-Verlauf</guimenuitem>

source: <screeninfo>Transfer History</screeninfo>
de: <screeninfo>Transfer-Verlauf</screeninfo>

source: <phrase>Transfer History</phrase>
de: <phrase>Transfer-Verlauf</phrase>

source: Opens a new window where you can see all the files downloaded using &kget;. You can manage your history here, including filter and clear the history.
de: Mit dieser Aktion öffnen Sie einen neues Fenster, das alle mit &kget; heruntergeladenen Dateien anzeigt. Verwalten Sie hier den Verlauf. Mit Hilfe des Filterfeldes und der Auswahl eines Bereichs kann die Anzeige eingeschränkt werden.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Quit</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo> </shortcut> <guimenu>Datei</guimenu> <guimenuitem>Beenden</guimenuitem>

source: Credits and License
de: Danksagungen und Lizenz

source: Documentation copyright &copy; 2009 Gaurav Chaturvedi <email>gaurav.p.chaturvedi@gmail.com </email>
de: Copyright für die Dokumentation &copy; 2009 Gaurav Chaturvedi <email>gaurav.p.chaturvedi@gmail.com </email>

source: Thanks to:
de: Dank an :

source: &Anne-Marie.Mahfouf; &Anne-Marie.Mahfouf.mail; (for helping me with DocBook related stuff)
de: &Anne-Marie.Mahfouf; &Anne-Marie.Mahfouf.mail; (für die Hilfe mit dem Docbookformat).

source: &Jonathan.Drews; &Jonathan.Drews.mail; (copy and pasted a lot of things from his old &kget; documentation)
de: &Jonathan.Drews; &Jonathan.Drews.mail; (Schrieb die vorherige Dokumentation für &kget;, die hier teilweise mit benutzt wurde)

source: CREDIT_FOR_TRANSLATORS
de: <para>Deutsche Übersetzung Frank Schütte<email>F.Schuette@t-online.de</email></para>

source: How to obtain &kget;
de: Wie Sie &kget; erhalten

source: Compilation and installation
de: Kompilierung und Installation
