Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdenetwork/kopete.po
Languages: de

source: The &kopete; Handbook
de: Das Handbuch zu &kopete;

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Luc</firstname><surname>de Louw</surname><affiliation><address><email>luc@delouw.ch</email></address></affiliation><contrib>Deutsche Übersetzung</contrib></othercredit>

source: &kopete; is &kde;'s multi-protocol instant messenger client.
de: &kopete; ist das Multiprotokoll-Instant-Messenger-Programm von &kde;.

source: Introduction
de: Einleitung

source: &kopete;, the &kde; instant messaging client
de: &kopete; ist das Instant-Messenger-Programm von &kde;.

source: Before starting...
de: Vor dem Start ...

source: If you're not familiar with Instant Messaging, please read the <link linkend="getting-started">Getting Started</link> section to learn about this wonderful world before continuing.
de: Falls Sie bereits Erfahrung mit Instant-Messaging haben, können Sie den Abschnitt <link linkend="getting-started">Erste Schritte</link> überspringen, ansonsten sollten Sie zumindest einen kurzen Blick darauf werfen.

source: What is &kopete;?
de: Was ist &kopete;?

source: &kopete; is the &kde; instant messaging (&im;) client. It allows you to communicate with your friends and colleagues using various instant messaging services. A single program is easy to learn and convenient if your friends or colleagues use more than one &im; service.
de: &kopete; ist das Instant-Messaging-Programm (&im;) von &kde;. Sie können damit mit Freunden und Kollegen über verschiedene Instant-Messaging-Dienste kommunizieren. Ein einzelnes Programm ist leichter zu lernen und bequemer, wenn Ihre Freund und Kollegen unterschiedliche &im;-Dienste benutzen.

source: &kopete; is designed to integrate well with your &kde; desktop; to make it immediately familiar. The user interface is clean and simple, without any frills to distract the user. At the same time, &kopete; aims to make communication the focus of &im;, by removing the differences between different &im; systems. One feature &kopete; introduced to support this is the <link linkend="organise-contacts-metacontacts">Metacontact</link>, combining the various means there are to contact someone into a single <quote>person</quote> in your contact list. Other multiprotocol instant messengers list the same person's various &im; accounts separately, making it confusing for non experienced people. &kopete; makes life easy: a metacontact is a person, and contacts are ways to communicate with that person. You will recognize contacts in a metacontact easily as small icons representing the &im; services you could use to communicate with that person.
de: &kopete; ist in die &kde;-Arbeitsoberfläche integriert, sodass Ihnen der Umgang mit dem Programm sogleich vertraut sein dürfte. Die Oberfläche ist einfach und klar, ohne ablenkenden Schnickschnack. Gleichzeitig wird der Fokus auf die Kommunikation gelegt, indem die Unterschiede zwischen verschiedenen &im;-Systemen durch die Oberfläche kompensiert werden. Eine wichtige Hilfe dabei sind <link linkend="organise-contacts-metacontacts">Metakontakte</link>. Sie kombinieren die verschiedenen Möglichkeiten, eine bestimmte Person zu erreichen, zu <quote>einem Eintrag</quote> in der Kontaktliste. Die übliche Methode, eine Person mehrfach aufzulisten, führte häufig zu Verwirrung. In &kopete; entspricht ein Metakontakt einer Person, und Kontakte sind verschiedene Arten, mit dieser Person in Verbindung zu treten. Die Kontakte werden innerhalb des Metakontaktes als kleine Symbole für die sie repräsentierenden &im;-Dienste dargestellt.

source: &kopete; is intended for all levels of users. Out of the box, it supports a minimal set of functions to make chatting as easy as possible. More advanced users can add extra functions such as Statistics with &kopete;'s <link linkend="plugins">plugin system</link>.
de: &kopete; ist für unterschiedlich erfahrene Benutzer entworfen. In der Standardeinstellung stehen nur wenige Funktionen zur Verfügung. Dafür ist die Benutzung möglichst einfach. Erfahrene Benutzer können Sonderfunktionen wie eine Statistik durch das <link linkend="plugins">Modulsystem</link> von &kopete; leicht hinzufügen.

source: More &kopete; Information on the Web
de: Weitere Informationen zu &kopete; im Internet

source: For more info about the &kopete; project; the team maintains a website at &kopetewww;. The latest news and updates are always available there.
de: Für weitere Informationen über das &kopete;-Projekt betreibt das Team die Internetseite &kopetewww;. Dort finden Sie immer die aktuellsten Neuigkeiten und Aktualisierungen.

source: If you need to contact the team, the &kopete; developers' mailing list is hosted at <ulink url="https://mail.kde.org/mailman/listinfo/kopete-devel">https://mail.kde.org/mailman/listinfo/kopete-devel</ulink>.
de: Wenn Sie Kontakt mit dem Team aufnehmen möchten, finden Sie die Mailingliste der &kopete;-Entwickler unter <ulink url="https://mail.kde.org/mailman/listinfo/kopete-devel">https://mail.kde.org/mailman/listinfo/kopete-devel</ulink>.

source: If you want live support, there is an Internet Relay Chat channel for &kopete; where you can find the team discussing technical (well, not always) issues or just hanging out. You can use any IRC client to join the channel (including &kopete;), just add an IRC contact and use <userinput>irc.freenode.org</userinput> as the server and <userinput>#kopete</userinput> as the channel name. See you there!
de: Direkte Unterstützung finden Sie im Internet Relay Chat Kanal für &kopete;. Zur Verbindung können Sie jedes IRC-Programm (einschließlich &kopete;) verwenden. Fügen Sie einfach einen IRC-Kontakt mit dem Server <userinput>irc.freenode.org</userinput> und dem Kanal <userinput>#kopete</userinput> hinzu.

source: Introduction to Instant Messaging
de: Eine Einführung in das Instant-Messaging

source: What is Instant Messaging (&im;)? &im; is a way for you to communicate instantly with your friends over the Internet. That might not sound so different to email. Have you ever noticed how cumbersome it is to have a brief conversation via email? You have to click Reply to each message, then find the right spot in the message to type something new, then send it. Then you have to wait for the next message to arrive! &im; lets you to have a conversation almost as naturally as on the phone or face to face, by typing messages into a window shared between you and your friend's screens.
de: Was versteht man unter Instant Messaging (&im;)? Bei &im; handelt es sich um eine Form der Kommunikation mit Freunden über das Internet. Das klingt ähnlich wie E-Mail, allerdings kann selbst eine kurze Konversation per E-Mail schon anstrengend sein. Sie müssen jedes Mal auf <quote>Antworten</quote> klicken, dann die richtige Stelle im Text finden und schließlich die E-Mail absenden. Es vergeht immer eine gewisse Wartezeit, bis die nächste Nachricht ankommt. Mit &im; ist die Konversation ähnlich flüssig wie per Telefon oder im persönlichen Gespräch. Die Nachrichten werden in ein gemeinsames Fenster eingegeben.

source: Another difference between &im; and email is that with &im; you can see your friends' presence, that is, whether they are actually on-line at the same time as you. This lets you send messages truly instantly, instead of sending off a mail and having to wait for your friend to check their mailbox. An &im; message pops up on the other person's screen as soon as you send it. Of course, if you'd rather not be interrupted, you can change your own presence so others will know not to disturb you.
de: Weiterhin kann man bei &im; die Anwesenheit der Freunde feststellen, ob sie wirklich zur selben Zeit wie man selbst Online sind. Dadurch werden die Nachrichten direkt versandt, anstatt davon abhängig zu sein, wann die Freunde ihre Postfächer leeren. Die Nachricht erscheint direkt auf dem Bildschirm der angeschriebenen Person. Falls man selbst nicht unterbrochen werden möchte, kann man seinen eigenen Status entsprechend ändern.

source: There are lots of other fun and useful &im; features you can explore with &kopete;, like group chats, file transfers and emoticons that reflect your mood. Read on to find out more!
de: Es gibt viele weitere nützliche Anwendungen für &im;. Mit &kopete; können Sie alle diese Funktionen wie Gruppen-Chat, Dateiübertragungen und Emoticons, die die eigene Gemütslage darstellen, ausprobieren. In den weiteren Abschnitten finden sich Informationen dazu.

source: Getting Started
de: Erste Schritte

source: To use &kopete; you need to set up one or more accounts for the instant messaging services you wish to use.
de: Bevor Sie &kopete; verwenden können, müssen Sie einen oder auch mehrere Zugänge für den gewünschten Instant-Messaging-Dienst (oder die gewünschten Instant-Messaging-Dienste) einrichten.

source: You've probably already chosen a messaging service, either because you already use &im;, or you need to use the same service as your friends. If you don't fit into either of these categories, please consider using a messaging service based on open standards, because these are designed for use by Free Software. Other messaging services are prone to changing the underlying technology without making the details freely available, making them harder for Free Software developers to support.
de: Wahrscheinlich haben Sie sich zu diesem Zeitpunkt bereits für einen Dienst entschieden, entweder, weil Sie bereits einen Dienst benutzen, oder weil Sie den gleichen Dienst wie Ihre Freunde benutzen möchten. Falls das nicht zutrifft, sollten Sie einen Instant-Messaging-Dienst auswählen, der auf offenen Standards beruht. Andere Dienste könnten ungestraft die zugrunde liegenden Protokolle ändern. Das macht es schwerer, für diese Dienste freie Programme zu entwickeln und zu pflegen.

source: The messaging services that &kopete; supports that are based on open standards are Jabber and IRC.
de: Die von &kopete; unterstützten auf offenen Standards basierenden Dienste sind Jabber und IRC.

source: The following section assumes you are registered with an &im; service already. If not, you can register with Gadu-Gadu, Jabber, and <trademark>WLM</trademark> from inside &kopete;; for other services, you'll have to register using their respective web site before creating an account in &kopete;.
de: Der folgende Abschnitt ist für Benutzer, die bereits einen Zugang bei einem &im;-Dienst besitzen. Falls nicht, können Sie &kopete; zur Registrierung bei Gadu-Gadu, Jabber oder <trademark>WLM</trademark> benutzen; bei den anderen Diensten müssen Sie sich vor der Einrichtung eines Zugangs in &kopete; zunächst über die Internetseite des jeweiligen Anbieters registrieren.

source: Creating Accounts
de: Das Erstellen von Zugängen

source: To create an account, use <menuchoice><guimenu>Settings</guimenu> <guimenuitem>Configure...</guimenuitem> </menuchoice> to display the Configure window.
de: Über den Menüeintrag <menuchoice><guimenu>Einstellungen</guimenu><guimenuitem>Einrichten ...</guimenuitem></menuchoice> gelangen Sie zum Einrichtungsdialog.

source: The Configure window is the main way to set up and customize &kopete;. On the left a column of icons control which aspect of &kopete; is being configured. Click the <guiicon>Accounts</guiicon> icon. The main pane will change to display the account management pane. This is currently empty, but will soon list your &im; accounts. Click <guibutton>Add Account</guibutton> to display the <interface>Account Wizard</interface>.
de: Im Einrichtungsdialog wird &kopete; an die Wünsche des Benutzers angepasst. In der Symbolleiste links können Sie auswählen, welchen Bereich von &kopete; Sie einrichten möchten. Klicken Sie auf das Symbol <guiicon>Zugänge</guiicon>. Daraufhin erscheint im Hauptbereich die Zugangsdatenverwaltung. Dieser Bereich ist zunächst leer und dient zur Aufnahme der eigenen &im;-Zugänge. Klicken Sie auf <guibutton>Zugang hinzufügen ...</guibutton>, um den <interface>Zugangsassistenten</interface> aufzurufen.

source: The <interface>Account Wizard</interface> helps you create an &im; account. On the first page, you are asked to select the messaging service that you'd like to use. Click one of the services shown and then click <guibutton>Next</guibutton>. On the following page, you should enter your registration details for that instant messaging service.
de: Der <interface>Zugangsassistent</interface> hilft bei der Einrichtung eines &im;-Zugangs. Auf der ersten Seite werden Sie nach dem einzurichtenden Dienst gefragt. Wählen Sie einen der Dienste aus und gehen Sie durch Klicken auf <guibutton> Weiter</guibutton> zur nächsten Seite. Dort müssen Sie die Details zur Registrierung bei diesem Dienst eintragen.

source: Most services just require you to enter a username or unique identifying number (<acronym>UIN</acronym>) and password. The special purpose services Winpopup and <acronym>SMS</acronym> work slightly differently, so please see their specific sections. There are a couple of other options that apply to most services that you should look at:
de: Die meisten Dienste erfordern lediglich die Eingabe eines Benutzernamens oder einer eindeutigen Nummer (<acronym>UIN</acronym>) und eines Passworts. Spezielle Dienste wie Winpopup und <acronym>SMS</acronym> arbeiten etwas anders. Einige der anderen Optionen sind auf die meisten Dienste anwendbar:

source: Remember password
de: Passwort merken

source: When this is checked, &kopete; will store the password for you, so you don't have to enter it every time you connect to the &im; service. If you are security-conscious or want to limit access to the &im; account you can leave this unchecked.
de: Ist dieses Ankreuzfeld markiert, speichert &kopete; das Passwort. Daher muss es nicht bei jeder Verbindung zum &im;-Dienst wieder neu eingegeben werden. Aus Sicherheitsgründen können Sie dieses Feld unmarkiert lassen.

source: Connect at startup
de: Beim Start verbinden

source: When this is checked, &kopete; will try to connect to the &im; service as when it starts. If you use a <acronym>LAN</acronym>, <acronym>DSL</acronym> or other <quote>always-on</quote> connection, this is appropriate; dial-up modem users should turn this off and connect manually when you have dialed up.
de: Ist dieses Ankreuzfeld markiert, versucht &kopete;, beim Start eine Verbindung zu diesem &im;-Dienst herzustellen. Falls Sie eine <acronym>LAN</acronym>- oder <acronym>DSL</acronym>-Verbindung oder eine andere <quote>ständige</quote> Internetverbindung benutzen, ist diese Einstellung sinnvoll. Modembenutzer sollten dieses Ankreuzfeld unmarkiert lassen und die Verbindung bei Bedarf manuell herstellen.

source: Once you've entered your &im; details, you can proceed to the <guilabel>Finished!</guilabel> page and then dismiss the wizard and the Configure window.
de: Nach Eingabe der &im;-Details können Sie auf <guilabel>Fertigstellen</guilabel> klicken und damit den Assistenten und den Einrichtungsdialog schließen.

source: Go Online and Start Chatting!
de: Online gehen und einen Chat beginnen

source: Now you'll notice that an icon representing the account has appeared in the status bar at the bottom of the &kopete; <interface>Contact List</interface> window. This represents your current presence for this account. <mousebutton>Right</mousebutton> click on it and you can go online from the menu that appears. The status bar icon will animate while &kopete; connects to the &im; service.
de: In der Statusleiste unten im Fenster mit der <interface>Kontaktliste</interface> von &kopete; erscheint ein Symbol, das den eingerichteten Zugang repräsentiert. Klicken Sie mit der <mousebutton>rechten</mousebutton> Maustaste darauf, können Sie über das angezeigte Menü direkt Online gehen. Während des Verbindungsaufbaus zum &im;-Dienst zeigt die Statusleiste eine kleine Animation.

source: Once you're online, if you've used this &im; service before, your contacts will be fetched from the server and displayed in the <interface>Contact List</interface>. To start a chat with a contact, just click their name and a Chat window will appear. The upper part of the window is where the conversation appears - to say something, type into the bottom part of the window and click <guibutton>Send</guibutton>.
de: Falls Sie diesen &im;-Dienst bereits verwendet haben, werden als nächstes ihre Kontakte vom Server geholt und in der <interface>Kontaktliste</interface> angezeigt. Einen Chat starten Sie durch Klicken auf einen der Namen in dieser Liste. Im oberen Teil des neu erscheinenden Fensters erscheint die Konversation, während eigene Beiträge im unteren Teil des Fensters geschrieben und durch Klicken auf <guibutton>Senden</guibutton> abgeschickt werden.

source: If you've just created a new account you won't have any contacts. See <link linkend="organise-contacts-adding">Adding Contacts</link> for details on how to add contacts.
de: Ein neu eingerichteter Zugang enthält noch keine Kontakte. Unter <link linkend="organise-contacts-adding">Kontakte hinzufügen</link> finden Sie Hinweise zum Hinzufügen von Kontakten.

source: The shortcut for <guibutton>Send</guibutton> is set to <keycombo action="simul">&Ctrl;&Enter;</keycombo> by default; you can change it in the Chat window using <menuchoice><guimenu>Settings</guimenu><guimenuitem>Configure Shortcuts...</guimenuitem></menuchoice>.
de: Der Kurzbefehl für <guibutton>Senden</guibutton> ist standardmäßig <keycombo action="simul">&Ctrl;&Enter;</keycombo>. Diese Festlegung kann unter <menuchoice><guimenu>Einstellungen</guimenu><guimenuitem>Kurzbefehle festlegen ...</guimenuitem></menuchoice> geändert werden.

source: Using &kopete;
de: Arbeiten mit &kopete;

source: This chapter gives an overview of &kopete;'s basic features. We will look first at the contact list, where your contacts are displayed, and then at the Chat window, where you carry out a conversation.
de: In diesem Kapitel werden die grundlegenden Funktionen von &kopete; vorgestellt. Zuerst wird die Kontaktliste und danach das Chatfenster vorgestellt.

source: The Contact List
de: Die Kontaktliste

source: The <interface>Contact List</interface> appears when you start &kopete;. It's the main window where you can set your presence, start a chat, organize your contacts, configure &kopete; and quit.
de: Die <interface>Kontaktliste</interface> erscheint als erstes beim Start von &kopete;. Sie befindet sich im Hauptfenster, in dem Sie auch Ihren Anwesenheitsstatus setzen, einen Chat beginnen, Ihre Kontakte verwalten, &kopete; einrichten und beenden können.

source: Layout of the Contact List window
de: Gestaltung des Kontaktlistenfensters

source: Menu
de: Menü

source: You will usually find the menubar at the top of the contact list. If it is not there, you might have turned it off; you can re-enable it with <keycombo action="simul">&Ctrl;<keycap>M</keycap></keycombo>. Details on each menu item can be found in the <link linkend="menus">chapter on menu structure</link>.
de: Die Menüleiste befindet sich oben über der Kontaktliste. Falls sie dort nicht ist, wurde sie deaktiviert. Durch <keycombo action="simul">&Ctrl;<keycap>M</keycap></keycombo> wird sie wieder aktiviert. Hinweise zu den Menüpunkten finden Sie im <link linkend="menus">Kapitel über die Menüstruktur</link>.

source: Tool bar
de: Werkzeugleiste

source: The toolbar holds the most frequently used &kopete; actions. You can customize it with <menuchoice><guimenu>Settings</guimenu> <guimenuitem>Configure Toolbars...</guimenuitem></menuchoice>. Notice the <guibutton>Show Offline Users</guibutton> and <guibutton>Show Empty Groups</guibutton> buttons. With these you can hide contacts and groups that are offline.
de: In der Werkzeugleiste befinden sich die in &kopete; am meisten benötigten Aktionen. Sie können diese Leiste mit <menuchoice><guimenu>Einstellungen</guimenu> <guimenuitem>Werkzeugleisten einrichten ...</guimenuitem></menuchoice> anpassen.

source: &kopete; makes it even easier to set a status message to let your contacts know about your mood or why you're busy at the moment. Click on the <guibutton>Set Status Message</guibutton> button and start typing to enter a new message, or choose from one of the previous messages you have used.
de: &kopete; erleichtert die Eingabe einer Statusmeldung, um den Kontakten Ihre Stimmung mitzuteilen oder anzuzeigen, warum Sie gerade so beschäftigt sind. Klicken Sie auf das Notizsymbol und geben Sie eine neue Meldung ein oder wählen Sie eine der vorher benutzten Meldungen aus.

source: The <guilabel>Quick Search Toolbar</guilabel> quickly filters the contact list, by typing a few letters from a contact's name.
de: Mit der Suchleiste können die Einträge in der Kontaktliste gefiltert werden, indem Sie einige Buchstaben eines Kontaktnamens eingeben.

source: Contact List
de: Kontaktliste

source: The <interface>Contact List</interface> takes up the main part of the window. All your contacts are listed here, in the groups you have chosen for them. You can open or close groups by clicking the plus symbol adjacent to the group. You can reverse the order the groups are sorted in by clicking the <guilabel>Contacts</guilabel> label above the list.
de: Die <interface>Kontaktliste</interface> nimmt den größten Teil des Hauptfensters ein. Alle Kontakte werden hier innerhalb der gewählten Gruppen angezeigt. Einzelne Gruppen können durch Klicken auf das nebenstehende Plussymbol geöffnet oder geschlossen werden. Die Sortierreihenfolge kann durch Klicken auf den Spaltenkopf <guilabel>Kontakte</guilabel> umgekehrt werden.

source: The context menu in the <interface>Contact List</interface> changes depending on the item under the mouse. <link linkend="organise-contacts-grouping">Groups</link>, <link linkend="organise-contacts-metacontacts">Metacontacts</link> and &im; system specific contacts have their own options. In empty areas of the <interface>Contact List</interface>, the context menu allows you to add contacts or groups, or change the viewing options for the list.
de: Das Kontextmenü der <interface>Kontaktliste</interface> passt sich dem Eintrag an, für den es geöffnet wird. <link linkend="organise-contacts-grouping">Gruppen</link>, <link linkend="organise-contacts-metacontacts">Metakontakte</link> und &im;-spezifische Kontakte habe jeweils eigene Optionen. In freien Bereichen der <interface>Kontaktliste</interface> können Sie über das Kontextmenü neue Kontakte oder Gruppen hinzufügen bzw. die Ansichtseinstellungen der Liste verändern.

source: Status bar
de: Statusleiste

source: The status bar shows an icon for each &im; account you have created. The icons represent the current presence of each account, which can be changed by <mousebutton>right</mousebutton>-clicking the account icon.
de: In der Statusleiste wird für jeden &im;-Zugang ein Symbol angezeigt. Die Symbole zeigen für jeden Zugang den aktuellen Anwesenheitsstatus an. Dieser kann durch Klicken mit der <mousebutton>rechten</mousebutton> Maustaste über dem Symbol geändert werden.

source: &kopete; also shows your current status message in the <guilabel>Status Bar></guilabel>. By clicking on the note icon in the corner, you can change or clear the status message as well.
de: &kopete; zeigt auch Ihre aktuelle Statusmeldung in der Statusleiste an. Klicken Sie auf das Notizsymbol auf der linken Seite und Sie können den Text ändern oder löschen.

source: Setting Your Presence
de: Einstellung des Anwesenheitsstatus
