Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdenetwork/kopete.po
Languages: de

source: There are several ways you can present the contact list here. Of particular interest may be the <guilabel>Use contact photos when available</guilabel> option, that shows the contact list using photos chosen by your contacts or the &kde; Address Book
de: Es gibt verschiedene Ansichten für die Kontaktliste. Besonders interessant ist der Modus <guilabel>Kontaktfotos verwenden, falls verfügbar</guilabel>, in dem in der Kontaktliste auch je das Foto des Kontaktes angezeigt wird. Das Foto kommt entweder vom Nachrichtendienst oder aus dem KDE-Adressbuch.

source: Contact List Animations
de: Animationen der Kontaktliste

source: This controls the degree of animation of the contact list. Turning this off will make &kopete; more responsive on slower machines.
de: Hier wird eingestellt, welche Änderungen in der Kontaktliste animiert werden. Das Deaktivieren der Einstellungen führt bei langsamen Maschinen zu besseren Reaktionszeiten.

source: Contact List Auto-Hide
de: Kontaktliste automatisch ausblenden

source: By enabling this, the contact list will automatically disappear a few seconds after the pointer leaves the window.
de: Falls diese Einstellung eingeschaltet ist, wird die Kontaktliste kurz nachdem die Maus das Fenster verlassen hat, automatisch ausgeblendet.

source: Change Tooltip Contents...
de: Kurztipp-Inhalte ändern ...

source: You have a lot of control over how much or how little detail appears in the tooltips shown on the contact list using this dialog.
de: Sie haben die volle Kontrolle über den Inhalt der Kurztipps. Diese werden in der Kontaktliste angezeigt, wenn die Maus über einem Kontakt verweilt.

source: Colors and Fonts
de: Farben &amp; Schriftarten

source: Chat Window Colors
de: Farben des Chatfensters

source: Here you can alter the base font and text colors used for chatting.
de: Hier können die Grundschriftart und die Textfarben der Chatfenster eingestellt werden.

source: Formatting Overrides
de: Aufhebung von Formatierungen

source: If your contacts tend to choose fonts and colors that you dislike, you can tell &kopete; to ignore these and use your regular font.
de: Wenn Ihre Kontakte Farb- und Schrifteinstellungen benutzen, die Ihnen nicht gefallen, können Sie die Einstellungen der Kontakte in diesem Abschnitt überschreiben und Ihre eigenen verwenden.

source: Some &im; systems let you see whether contacts are idle at their computers. This option enables you to change the color used for idle contacts.
de: Einige &im;-Dienste übermitteln Informationen über den Leerlauf der Rechner von Kontakten. Durch diese Option kann für Rechner im Leerlauf die Farbe des zugehörigen Kontakts geändert werden.

source: Devices
de: Geräte

source: The Devices section allows you to choose and configure which multimedia devices are used for A/V chatting. Whether this works for you is highly dependent on the hardware you have and how well it is supported by your operating system.
de: Im Abschnitt Geräte können Sie auswählen und einstellen, welche Multimediageräte für das Chatten mit Audio oder Video verwendet werden. Es hängt von der Hardware und deren Unterstützung durch das Betriebssystem ab, ob sie mit Multimediageräten chatten können.

source: &kopete; uses the Video4Linux 2 system for video. This shows a blue square if no video device is found, or a preview if the camera is working. For up-to-date information on &kopete; webcam support, see the <ulink url="http://userbase.kde.org/Kopete/Webcam_Support">Kopete Webcam Support wiki page</ulink>.
de: &kopete; benutzt für Videos das System Video4Linux 2. Wurde kein Videogerät gefunden, wird nur ein Kamerasymbol angezeigt, sonst eine Bildvorschau. Aktuelle Informationen über die Webcam-Unterstützung finden Sie auf der <ulink url="http://userbase.kde.org/Kopete/Webcam_Support">Kopete-Webcam</ulink>-Webseite.

source: Audio support in &kopete; is at an experimental stage. If you have an Audio tab, you are probably using a preview build of &kopete;.
de: Unterstützung für Audio ist in &kopete; noch im experimentellen Stadium, daher ist diese Seite nur in Entwicklerversionen vorhanden.

source: Loading Plugins
de: Module laden

source: You can customize &kopete; with special functions that may be useful or just a bit of fun. Bring up the <guilabel>Select and Configure Plugins</guilabel> panel with <menuchoice><guimenu>Settings</guimenu><guimenuitem>Configure...</guimenuitem></menuchoice> and then the <guilabel>Plugins</guilabel> entry.
de: Die Fähigkeiten von &kopete; können mit einigen besonderen Funktionen erweitert werden, die nützlich oder mindestens lustig sind. Sie finden diese auf der Seite <guilabel>Module</guilabel> im Einrichtungsdialog, den Sie über das Menü unter <menuchoice><guimenu>Einstellungen</guimenu><guimenuitem>Einrichten ...</guimenuitem></menuchoice> aufrufen.

source: Plugins can be turned on or off in the list on the left side of the page. Each plugin may be configured on the right side. See the <link linkend="plugins">chapter on plugins</link> for details on each plugin.
de: In der Liste kann jedes einzelne Modul links ein- oder ausgeschaltet und auf der rechten Seite dessen Einstellungen verändert werden. Im <link linkend="plugins">nächsten Kapitel</link> finden Sie zu jedem Modul genauere Informationen.

source: &kopete;'s Protocols
de: &kopete;'s Protokolle

source: &kopete; calls different &im; systems 'Protocols'. When you add an account, it is specific to a single protocol. Although &kopete; tries to make instant messaging appear the same, no matter what protocol you use, there are some differences in the level of support for advanced features such as file transfer and multimedia.
de: In &kopete; werden die verschiedenen &im;-System als „Protokolle“ bezeichnet. Wenn Sie einen neuen Zugang einrichten, müssen Sie dafür ein Protokoll bestimmen. Obwohl in &kopete; unabhängig vom Protokoll alle &im;-Dienste unter einer einheitlichen Oberfläche angezeigt werden, gibt es Unterschiede in der Unterstützung erweiterter Fähigkeiten wie Dateiübertragung und Multimedia.

source: Protocols
de: Protokolle

source: AIM supports chatrooms. Use the <guilabel>Join Chat...</guilabel> command on the AIM account menu to join a chatroom. Contact pictures and custom emoticons are also supported.
de: AIM unterstützt Chaträume. Verwenden Sie <guilabel>Kanal beitreten ...</guilabel> aus dem AIM-Zugangsmenü, um einen Chatraum zu betreten. Kontaktbilder und benutzerdefinierte Emoticons können ebenfalls benutzt werden.

source: ICQ has an Invisibility feature which allows you to hide from selected contacts. You may also search the ICQ user folder when adding a contact. A wide range of contact details can be set using the <guilabel>Properties</guilabel> option.
de: In ICQ können Sie den Status auf „Unsichtbar“ ändern, um die eigene Anwesenheit vor anderen Benutzern zu verbergen. Wenn Sie einen Kontakt hinzufügen, können Sie den ICQ-Benutzerordner suchen. Weitere Details zum Kontakt können Sie mit der Option <guilabel>Eigenschaften</guilabel> einstellen.

source: File transfer and multi user chats work. To transfer a file, drag the file from &dolphin; or the desktop into the chat window. To invite someone else into a chat, drag them from the Contact List into the chat window. The <menuchoice><guimenu>File</guimenu></menuchoice> menu also contains these commands. In addition, WLM supports custom emoticons.
de: Dateiübertragungen und Chats mit mehreren Personen werden unterstützt. Um eine Datei zu übertragen, ziehen Sie sie von der Arbeitsfläche oder aus &dolphin; in das Chatfenster. Um andere Personen zum Chat einladen, ziehen Sie den Kontakt aus der Kontaktliste in das Chatfenster oder wählen Sie im Menü <menuchoice><guimenu>Chat</guimenu><guisubmenu>Einladen</guisubmenu><guimenuitem>&lt;Kontaktname&gt;</guimenuitem></menuchoice>. Zusätzlich können in WLM auch benutzerdefinierte Emoticons verwendet werden.

source: To use file transfer, make sure port 6891 is forwarded to your computer.
de: Um die Dateiübertragung zu benutzen, muss der Port 6891 zu Ihrem Rechner weitergeleitet werden.

source: Yahoo can send and receive webcam video. It also supports Yahoo mail and the Yahoo address book from the account menu. Conferencing is also possible.
de: In Yahoo ist der Austausch von Webcam-Videos möglich, außerdem Zugriff auf Yahoo-Mail und das Yahoo-Adressbuch über das Zugangsmenü. Konferenzen können ebenfalls abgehalten werden.

source: Jabber, also known as XMPP, supports file transfer, conferencing and any other services supplied by the Jabber server. For example, many Jabber servers have a user directory, and some provide transports to other messaging systems. To access services, use <menuchoice><guimenu>Services...</guimenu></menuchoice> on the account menu. Jabber file transfer can work without port forwarding, but enjoys better performance where a direct connection is possible. By default, port 8010 is used for port forwarding, but this is configurable in each account's settings.
de: Jabber, auch unter dem Namen XMPP bekannt, ermöglicht Dateiübertragungen, Konferenzen und weitere Dienste, die vom Jabberserver angeboten werden. Einige Jabberserver haben zum Beispiel Benutzerordner und übertragen die Nachrichten in andere Messaging-Systeme. Mit <menuchoice><guimenu>Dienste ...</guimenu></menuchoice> im Zugangsmenü können Sie auf diese Dienste zugreifen. Die Dateiübertragung funktioniert ohne Port-Weiterleitung, ist aber bei direkter Verbindung schneller. In der Voreinstellung wird Port 8010 zur Weiterleitung verwendet, das lässt sich für jeden Zugang einzeln ändern.

source: Since Google Talk is based upon Jabber, it is well supported in &kopete; with the exception of voice chat, which is worked upon.
de: Da Google Talk auf Jabber basiert, wird es in &kopete; gut unterstützt, nur das Chatten mit Sprachausgabe funktioniert nicht.

source: To configure &kopete; for Google Talk: Use your complete Google Mail address as the user name. Check <guilabel>Use protocol encryption (SSL)</guilabel>, <guilabel>Allow plain-text password authentication</guilabel> and <guilabel>Override default server information</guilabel>. The server is <quote>talk.google.com</quote> or <quote>gmail.com</quote> and ports 443 or 5223 should be used.
de: Einrichtung von &kopete; für Google Talk: Geben Sie Ihre gesamte Google E-Mailadresse als Benutzername ein. Aktivieren Sie die Einstellungen <guilabel>Protokollverschlüsselung verwenden (SSL)</guilabel>, <guilabel>Authentifizierung mit Klartextpasswort zulassen</guilabel> und <guilabel>Standardserverinformationen übergehen</guilabel>. Als Server ist <quote>talk.google.com</quote> oder <quote>gmail.com</quote> einzutragen und als Port sollte 443 oder 5223 benutzt werden.

source: GroupWise Messenger is an enterprise messenging system from Novell Inc. The full range of features are supported, including privacy, group chat, rich text and user search.
de: GroupWise ist ein Unternehmens-Nachrichtensystem von Novell Inc. Alle Funktionen sind verfügbar, einschließlich privater Unterhaltung, Gruppenchats, formatierter Text und Suche nach Benutzern.

source: Gadu-Gadu is a chat system originating from Poland. At present, &kopete; supports basic chat functions.
de: Gadu-Gadu ist ein Chatsystem aus Polen. Zurzeit unterstützt &kopete; nur die wichtigsten Chat-Funktionen.

source: WinPopup is a way to use &kopete; to send and receive messages with &Windows; computers on the local network. The WinPopup protocol only supports single, plain-text messages.
de: WinPopup ist ein in &kopete; benutztes Protokoll um Nachrichten mit &Windows;-Rechnern im lokalen Netz auszutauschen. In diesem Protokoll ist nur unformatierter Text erlaubt.

source: Other protocols
de: Weitere Protokolle

source: As well as the protocols named above, &kopete; has support for several other protocols. In most cases, this is not enabled by default or an additional plugin must be installed. Meanwhile, SMS, Skype and SILC are provided in this way. See &kopetewww; for details, however, the &kopete; team are not responsible for these protocols.
de: Zusätzlich zu den oben genannten Protokollen unterstützt &kopete; noch weitere Protokolle. Diese sind in der Voreinstellung entweder nicht aktiviert oder es müssen zusätzliche Module installiert werden, dies gilt für die Protokolle SMS, Skype and SILC. Auf &kopetewww; finden Sie weitere Informationen dazu, die Unterstützung für diese Protokolle kommt nicht vom Kopete-Team.

source: &kopete;'s Plugins
de: Module von &kopete;

source: &kopete; offers plugins that provide functions that aren't essential for messaging, but are useful for some people.
de: Die Module von &kopete; bieten Funktionen, die zwar nicht essentiell für die Nachrichtendienste, aber für einige Leute dennoch nützlich sind.

source: Plugins
de: Module

source: Auto Replace
de: Automatische Ersetzung

source: <guilabel>Auto Replace</guilabel> allows you to correct frequently misspelled words or save typing certain words using abbreviations.
de: <guilabel>Automatische Ersetzung</guilabel> ermöglicht die automatische Korrektur häufig falsch getippter Worte und das automatische Einsetzen von Worten durch Verwendung von Abkürzungen.

source: Bookmarks
de: Lesezeichen

source: The <guilabel>Bookmarks</guilabel> plugin creates bookmarks in your &kde; bookmarks list from URLs that are received in &im; messages.
de: Das Modul <guilabel>Lesezeichen</guilabel> erstellt Lesezeichen für die &kde;-Lesezeichenliste aus URLs, die in &im;-Nachrichten enthalten sind.

source: Contact Notes
de: Kontakt-Notizen

source: <guilabel>Contact Notes</guilabel> allows you to note down any useful bits of information on a metacontact.
de: <guilabel>Kontakt-Notizen</guilabel> sind nützliche Informationen, die man für Metakontakte speichern kann.

source: Cryptography
de: Kryptografie

source: The Cryptography plugin allows you to send and receive encrypted and/or signed messages.
de: Das Kryptografie-Modul ermöglicht es ihnen, verschlüsselte und/oder signierte Nachrichten zu senden und zu empfangen.

source: Cryptography lets you use an OpenPGP implementation to encrypt and sign messages in conversations. Note that this is not the same as an SSL secured chat session. Cryptography can encrypt your messages to a single individual so that only the holder of the matching key can read it. If you wish that the recipient of your messages can verify that you have sent your messages, you may sign messages. Signing and encryption can be used separately or together. When you receive a message, if it has been encrypted, you will see a lock icon. If it has been signed with a verifiable signature (you have the public key of the sender), you will see a pen icon. For a non-verifiable signature, a red pen icon will be shown.
de: Kryptografie ermöglicht es Ihnen, OpenPGP zum Verschlüsseln und Signieren von Nachrichten in Unterhaltungen zu benutzen. Dies ist nicht das Gleiche wie mit SSL gesicherte Chat-Sitzungen. Kryptografie kann Nachrichten für einen einzelnen Benutzer verschlüsseln, so dass die Nachricht nur vom Eigentümer des passenden Schlüssels gelesen werden kann. Damit der Empfänger Ihrer Nachrichten überprüfen kann, ob sie tatsächlich von Ihnen gesendet wurden, können Sie die Nachrichten signieren. Verschlüsseln und Signieren kann getrennt oder zusammen verwendet werden. Erhalten Sie eine verschlüsselte Nachricht, wird das durch ein Schlosssymbol angezeigt. Ist die Nachricht signiert und Sie können die Signatur überprüfen, weil Sie den öffentlichen Schlüssel des Absenders haben, wird dies durch ein Stiftsymbol angezeigt. Bei einer nicht überprüfbaren Signatur hat das Stiftsymbol eine rote Farbe.

source: To configure Cryptography, select your private key in the plugin configuration page. Then, using <menuchoice><guimenuitem>Select Public Key...</guimenuitem></menuchoice> from each meta-contact's context menu, choose their public key. You will be prompted for your passphrase when using this plugin.
de: Wählen Sie ihren eigenen privaten Schlüssel auf der Einrichtungsseite, um Kryptographie zu aktivieren. Wählen Sie dann <menuchoice><guimenuitem>Öffentlichen Schlüssel auswählen</guimenuitem></menuchoice> aus dem Kontextmenü für jeden Kontakt und wählen Sie jeweils den passenden Schlüssel. Bei Verwendung dieses Moduls werden Sie nach ihrem Passwort gefragt.

source: Due to limitations in some of the instant messaging protocols that &kopete; uses, encrypted messages cannot be sent with those protocols. If you attempt to use an unsupported protocol, you will be warned.
de: Auf Grund von Beschränkungen in den von &kopete; verwendeten Instant-Messaging-Protokollen können verschlüsselte Nachrichten mit diesen Protokollen nicht versendet werden. Versuchen Sie ein nicht unterstütztes Protokoll zu benutzen, wird eine Warnung angezeigt.

source: Cryptography can use the public keys stored in your &kde; address book for each contact. However, it must be able to know which address book entry is associated with which meta-contact. To provide this information, choose Properties from the meta-contact context menu, and then set the Address Book Link. Cryptography can also export public keys that you have set to your address book. If a meta-contact has an address book link, then the key will go in the correct address book entry, replacing an existing one. If no link exists (possibly because no address book entry exists for the individual in question), a new entry will be created. This entry will have two fields filled: the public key from &kopete; and the meta-contact's display name.
de: Kryptografie kann die öffentlichen Schlüssel verwenden, die in Ihrem &kde;-Adressbuch für jeden Kontakt gespeichert sind. Die Verknüpfung zwischen einem Eintrag im Adressbuch und einem Metakontakt muss jedoch bekannt sein. Um diese Information einzugeben, wählen Sie Eigenschaften aus dem Kontextmenü des Metakontakts und setzen die Verknüpfung zum Adressbuch. Kryptografie kann auch die öffentlichen Schlüssel aus Ihrem Adressbuch exportieren. Hat ein Metakontakt eine Verknüpfung zum Adressbuch, wird der Schlüssel zum richtigen Eintrag im Adressbuch hinzugefügt und ein vorhandener Schlüssel ersetzt. Ist keine Verknüpfung vorhanden, weil es zum Beispiel noch keinen Eintrag im Adressbuch für die Person gibt, wird ein neuer Eintrag erstellt. Für diesen Eintrag werden zwei Felder ausgefüllt: der Öffentliche Schlüssel von &kopete; und der Anzeigename des Metakontakts.

source: Documentation copyright &copy; &Olivier.Goffart; &Olivier.Goffart.mail; and &copy; 2007 &Charles.Connell; &Charles.Connell.mail;
de: Dokumentation Copyright &copy; &Olivier.Goffart; &Olivier.Goffart.mail; and &copy; 2007 &Charles.Connell; &Charles.Connell.mail;

source: Highlight
de: Hervorgehoben

source: <guilabel>Highlight</guilabel> works a little like email filters, in that it allows you to make things happen in response to particular messages. As well as highlighting the text, you can play sounds.
de: <guilabel>Hervorgehoben</guilabel> arbeitet ähnlich zu E-Mail-Filtern, indem aufgrund von bestimmten Nachrichten festgelegte Aktionen ausgelöst werden. Es kann Text hervorgehoben, aber auch ein Klang abgespielt werden.

source: History
de: Verlauf

source: The <guilabel>History</guilabel> plugin, when activated, records conversations using any &im; system and allows you to view old conversations later. A <menuchoice><guimenuitem>History</guimenuitem></menuchoice> item appears in each Metacontact's context menu so you can view the message history for that metacontact.
de: Das Modul <guilabel>Verlauf</guilabel> speichert die über irgendeinen &im;-Dienst geführten Konversationen und erlaubt so den Rückgriff auf alte Konversationen. Der Zugriff erfolgt über den Menüeintrag <menuchoice><guimenuitem>Verlauf</guimenuitem></menuchoice> im Kontextmenü jedes Metakontakts.

source: The following item is added to the Contact List's menus:
de: Der folgende Eintrag wird zu den Kontaktlistenmenüs hinzugefügt:

source: <guimenu>Edit</guimenu> <guimenuitem>View History</guimenuitem>
de: <guimenu>Bearbeiten</guimenu><guimenuitem>Verlauf anzeigen</guimenuitem>

source: (Enabled when a contact is selected) This displays the History browser for the selected contact.
de: Dieser Menüeintrag ist nur aktiviert, wenn ein Kontakt ausgewählt ist, er zeigt für den gewählten Kontakt den Verlauf des Chats an.

source: The following items are added to the Chat window's menus:
de: Die folgenden Einträge werden zu den Chatfenster-Menüs hinzugefügt:

source: <shortcut><keycombo action="simul">&Alt;&Shift;<keycap>Left Arrow</keycap></keycombo> </shortcut> <guimenu>Tools</guimenu> <guimenuitem>History Previous</guimenuitem>
de: <shortcut><keycombo action="simul">&Alt;&Shift;<keycap>Pfeil links</keycap></keycombo></shortcut><guimenu>Extras</guimenu><guimenuitem>Voriger Verlauf</guimenuitem>

source: This enables you to view the next oldest set of messages from the History in the Chat window.
de: Zeigt die nächstältesten Nachrichten des Verlaufs im Chatfenster an.

source: <shortcut><keycombo action="simul">&Alt;&Shift;<keycap>Right Arrow</keycap></keycombo> </shortcut> <guimenu>Tools</guimenu> <guimenuitem>History Next</guimenuitem>
de: <shortcut><keycombo action="simul">&Alt;&Shift;<keycap>Pfeil rechts</keycap></keycombo></shortcut><guimenu>Extras</guimenu><guimenuitem>Nächster Verlauf</guimenuitem>

source: This shows the next newest set of messages from the History in the Chat window.
de: Zeigt die nächstneueren Nachrichten des Verlaufs im Chatfenster an.

source: <guimenu>Tools</guimenu> <guimenuitem>History Last</guimenuitem>
de: <guimenu>Extras</guimenu><guimenuitem>Letzter Verlauf</guimenuitem>

source: This shows the most recent set of messages from the History in the Chat window.
de: Zeigt die neuesten Nachrichten des Verlaufs im Chatfenster an.

source: KopeteTeX allows scientists and mathematicians to hold conversations using the LaTeX markup language. Expressions entered within $$ are rendered as a graphic in the chatwindow, and can be cut and pasted as the original Latex. To use this plugin you must have LaTeX installed
de: KopeteTeX ermöglicht Wissenschaftlern und Mathematikern Gespräche in der Sprache LaTeX. Ausdrücke zwischen $$ werden als Grafik im Chatfenster dargestellt und können als original LaTeX-Quelltext kopiert und eingefügt werden. Um dieses Modul nutzen zu können, muss LaTeX installiert sein.

source: Now Listening
de: Im Hintergrund läuft

source: With the <guilabel>Now Listening plugin</guilabel>, let people you're chatting with know what you're listening to, by typing <userinput>/media</userinput> in a chat, or with <menuchoice><guimenu>Tools</guimenu><guimenuitem>Send Media Info</guimenuitem></menuchoice> in the Chat window.
de: Mit dem Modul <guilabel>Im Hintergrund läuft</guilabel> teilen Sie anderen Gesprächsteilnehmern automatisch mit, welche Musik Sie hören, indem Sie <userinput>/media</userinput> in einem Gespräch eingeben oder im Chatfenster aus dem Menü <menuchoice><guimenu>Extras</guimenu><guimenuitem>Medien-Infos senden</guimenuitem></menuchoice> auswählen.
