Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdenetwork/kopete_icq.po
Languages: de

source: <firstname>This documentation was converted from the KDE UserBase <ulink url=" http://userbase.kde.org/Kopete/ICQ">Kopete/ICQ</ulink> page.</firstname> <surname></surname>
de: <firstname>Diese Dokumentation wurde aus der <ulink url=" http://userbase.kde.org/Kopete/ICQ">Kopete/ICQ</ulink>-Webseite der &kde;-Userbase erstellt.</firstname> <surname></surname>

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Torbjörn</firstname><surname>Klatt</surname><affiliation><address><email>torbjoern.k@googlemail.com</email></address></affiliation><contrib>Deutsche Übersetzung</contrib></othercredit>

source: ICQ Handbook
de: Handbuch zu ICQ

source: About ICQ
de: Über ICQ

source: This tutorial will help you to use ICQ, a common chat protocol in &kopete;.
de: Diese Anleitung wird Ihnen bei der Verwendung von ICQ, einem verbreiteten Chatprotokoll, in &kopete; helfen.

source: <ulink url="http://www.icq.com/en.html">ICQ</ulink> is a proprietary instant messaging program, first developed by the Israeli company Mirabilis. It uses AOL's OSCAR network protocol for sending the text messages. To identify people, it uses a number, called UIN (Unified Identification Number). If you register an ICQ account, you also have to enter an e-mail address. Some ICQ clients support login with that e-mail address instead of your UIN (but not &kopete;).
de: <ulink url="http://www.icq.com/en.html">ICQ</ulink> ist ein proprietäres Instant-Messaging-Programm, das zuerst von der israelischen Firma Mirabilis entwickelt wurde. Zum Versenden von Textnachrichten verwendet es das OSCAR-Netzwerk-Protokol von AOL. Für die Identifizierung von Personen wird eine UIN (engl.: „unified identification number“) verwendet. Bei der Registrierung eines ICQ-Zugangs müssen Sie eine E-Mail-Adresse angeben. Einige ICQ-Klienten (nicht &kopete;) unterstützen die Verwendung dieser E-Mail-Adresse bei der Anmeldung.

source: Features
de: Funktionen

source: Offline messages
de: Offline-Nachrichten

source: multi user chat
de: Gruppenchats

source: file transfer
de: Dateiübertragung

source: Features not yet supported by Kopete
de: Funktionen, die noch nicht von Kopete unterstützt werden

source: games
de: Spiele

source: sending SMS
de: SMS senden

source: Criticism
de: Kritik

source: Privacy: according to the security analyst Jeffrey Carr, the russian secret service could gain access to chat protocols. For further information see <ulink url="http://greylogic.us/2010/07/13/your-icq-identity-now-belongs-to-the-fsb/">here</ulink>
de: Privatsphäre: Der Sicherheitsanalytiker Jeffrey Carr gab bekannt, dass der russische Geheimdienst Zugriff auf die Chatprotokolle erhalten könne. Für weitere Informationen sehen Sie <ulink url="http://greylogic.us/2010/07/13/your-icq-identity-now-belongs-to-the-fsb/">hier.</ulink>

source: Spam: there is a lot of spam (unwanted advertisement or viruses) in the ICQ network
de: Spam: Es existiert sehr viel Spam (unerwünschte Werbung oder Viren) im ICQ-Netzwerk

source: Copyright: according to the <ulink url="http://www.icq.com/legal/policy.html">ICQ Acceptable Use Policy</ulink>, you allow ICQ to use posted material in any manner they want
de: Copyright: Gemäß der „<ulink url="http://www.icq.com/legal/policy.html">ICQ Acceptable User Policy</ulink>“ erlauben Sie ICQ, sämtliches gesendete Material zu verwenden.

source: Create your ICQ account
de: Ihren ICQ-Zugang erstellen

source: Before you can chat via ICQ, you have to create an ICQ account. If you already have one, you can skip this page.
de: Vor dem Chatten über ICQ müssen Sie sich anmelden. Haben Sie bereits einen ICQ-Zugang, überspringen Sie die folgenden Informationen.

source: Go to the registration page with your preferred web browser (&eg; <guilabel>Firefox</guilabel>, <guilabel>Konqueror</guilabel>, <guilabel>Chromium</guilabel>) <ulink url="https://www.icq.com/register/">www.icq.com/register</ulink>
de: Gehen Sie mit Ihrem Browser (&eg; <guilabel>Firefox</guilabel>, <guilabel>Konqueror</guilabel>, <guilabel>Chromium</guilabel>) auf die Registrierungsseite <ulink url="https://www.icq.com/register/">www.icq.com/register</ulink>.

source: <phrase>Enter you data</phrase>
de: <phrase>Geben Sie Ihre Daten ein</phrase>

source: <para>Enter you data</para>
de: <para>Geben Sie Ihre Daten ein</para>

source: Now you have to wait until you get an e-mail from ICQ, which contains your verification link.
de: Nun müssen Sie die E-Mail von ICQ abwarten, die Ihre Bestätigungsverknüpfung enthält.

source: <phrase>click on the verification link in your e-mail to verify you registration</phrase>
de: <phrase>Klicken Sie auf die Bestätigungsverknüpfung in Ihrer E-Mail, um die Registrierung abzuschließen.</phrase>

source: <para>click on the verification link in your e-mail to verify you registration</para>
de: <para>Klicken Sie auf die Bestätigungsverknüpfung in Ihrer E-Mail, um die Registrierung abzuschließen.</para>

source: Now you have your ICQ account! But at the moment, you can only login with Kopete using UINs (Unified Identification Number). ICQ does not show you your UIN by default. You have to go with your browser to <ulink url="https://www.icq.com/people">www.icq.com/people</ulink> and login there.
de: Nun besitzen Sie einen ICQ-Zugang. Allerdings können Sie sich zunächst nur mit &kopete; über die UIN („Unified Identification Number“) anmelden. ICQ zeigt Ihre UIN standardmäßig nicht an. Sie müssen in Ihrem Browser <ulink url="https://www.icq.com/people">www.icq.com/people</ulink> aufrufen und sich dort anmelden.

source: <phrase>login on www.icq.com</phrase>
de: <phrase>Anmeldung bei www.icq.com</phrase>

source: <para>login on www.icq.com</para>
de: <para>Anmeldung bei www.icq.com</para>

source: Then you have to go to your profile:
de: Nun navigieren Sie zu Ihrem Profil:

source: <phrase>click on My Profile</phrase>
de: <phrase>Klicken Sie auf My Profile</phrase>

source: <para>click on My Profile</para>
de: <para>Klicken Sie auf My Profile</para>

source: Now you will get an information page about your account. If you click on <quote>More about me</quote> you will see an entry called ICQ#. This is your UIN:
de: Nun erhalten Sie eine Seite mit Informationen über Ihren Zugang. Mit einem Klick auf <quote>More about me</quote> wird Ihnen ein Eintrag mit der Bezeichnung „ICQ#“ angezeigt. Dies ist Ihre UIN:

source: Connect through Kopete
de: Mittels &kopete; verbinden

source: The first time, you start &kopete;, you will see a window like this:
de: Beim erstmaligen Start von &kopete; werden Sie ein ähnliches Fenster wie das folgende sehen:

source: <phrase>Kopete on the first startup</phrase>
de: <phrase>&kopete; beim ersten Start</phrase>

source: <para>Kopete on the first startup</para>
de: <para>&kopete; beim ersten Start</para>

source: To add your ICQ account click on <guilabel>Click to add an account</guilabel>. Or if you have already entered another account (like MSN or Jabber) you go to menu <menuchoice><guimenu>Settings</guimenu><guimenuitem>Configure...</guimenuitem></menuchoice> and click on <guilabel>Add Account</guilabel>.
de: Um Ihren ICQ-Zugang hinzuzufügen, klicken Sie auf <guilabel>Klicken, um einen neuen Zugang hinzuzufügen</guilabel>. Sollten Sie bereits einen anderen Zugang eingegeben haben (wie MSN oder Jabber), gehen Sie im Menü auf <menuchoice><guimenu>Einstellungen</guimenu><guimenuitem>Einrichten ...</guimenuitem></menuchoice> und wählen Sie <guilabel>Zugang hinzufügen ...</guilabel>.

source: Now you see a list of all chat protocols available for &kopete;. In this case, as you want to use ICQ, you have to choose the ICQ entry:
de: Hier sehen Sie eine Liste in &kopete; verfügbarer Chatprotokolle. In diesem Fall, da Sie ICQ verwenden möchten, müssen Sie den Eintrag „ICQ“ auswählen:

source: <phrase>Choose your protocol</phrase>
de: <phrase>Wählen Sie ein Protokoll</phrase>

source: <para>Choose your protocol</para>
de: <para>Wählen Sie ein Protokoll</para>

source: Now you see the configure dialog for your account. Click on <guilabel>Basic Setup</guilabel> above in the tab bar. There you have to enter your UIN. If you don't want to enter your password every startup, you can add your password, too.
de: Nun sehen Sie den Einrichtungsdialog für Ihren Zugang. Klicken Sie auf <guilabel>Grundeinstellungen</guilabel> in der oberen Registerkartenleiste. Hier müssen Sie Ihre UIN eingeben. Wenn Sie nicht bei jedem Start Ihr Passwort eingeben wollen, können Sie es hier angeben.

source: <phrase>Basic account setup</phrase>
de: <phrase>Grundeinstellungen für den Zugang</phrase>

source: <para>Basic account setup</para>
de: <para>Grundeinstellungen für den Zugang</para>

source: The <guilabel>Account Preferences</guilabel> tab contains more detailed settings:
de: Die Registerkarte <guilabel>Zugangseinstellungen</guilabel> enthält weitere Einstellungen:

source: <phrase>More settings</phrase>
de: <phrase>Weitere Einstellungen</phrase>

source: <para>More settings</para>
de: <para>Weitere Einstellungen</para>

source: &kopete; should work without changing any settings here. So if you don't understand points mentioned below, don't panic, just skip this section.
de: &kopete; sollte funktionieren ohne hier Änderungen vornehmen zu müssen. Sollten Sie also einige der im Folgenden genannten Punkte nicht verstehen, können Sie diesen Abschnitt getrost überspringen.

source: Options explained
de: Hinweise zu den Einstellungen

source: <guilabel>Require authorization before someone can add you to their contact list:</guilabel> Choose this option if you want to be asked before someone else can add you to his buddy list. Normally, everyone can search you and add you to his list. This means every stranger you don't even know can see whether you are online or not or can send you messages. If you don't want this, you can check this options and afterwards you will be asked if you want to confirm someone before he can chat with you.
de: <guilabel>Autorisierung erforderlich, bevor jemand Sie zu seiner Kontaktliste hinzufügen kann</guilabel>: Wählen Sie diese Einstellung, wenn Sie wünschen, dass Sie gefragt werden bevor jemand Sie zu seiner Kontaktliste hinzufügen kann. Normalerweise kann jeder Sie suchen und zu seiner Kontaktliste hinzufügen. Das bedeutet, dass jeder Fremde, den Sie nicht kennen, Ihren Onlinestatus sehen und Ihnen Nachrichten senden kann. Wenn Sie dies nicht wünschen, wählen Sie diese Einstellung aus und Sie werden jedes Mal nach Ihrer Zustimmung gefragt, bevor jemand Sie zu seiner Kontaktliste hinzufügen kann.

source: <guilabel>Hide IP address:</guilabel> If you don't want others to see your <ulink url="http://en.wikipedia.org/wiki/IP_address">IP</ulink>, you can check this option. The IP address is an ID to identify you in the Internet. This number is unique. An average Internet user cannot get your name out of your IP Address, only your provider can do this! ICQ saves your IP address anyway for a specific time. So it is no real privacy problem not to choose this option.
de: <guilabel>IP-Adresse ausblenden</guilabel>: Wenn Sie möchten, dass andere Ihre <ulink url="http://de.wikipedia.org/wiki/IP-Adresse">IP</ulink> sehen können, wählen Sie diese Einstellung. Die IP-Adresse ist eine Nummer, mit der Sie im Internet identifiziert werden können. Diese Nummer ist eindeutig. Normale Internetnutzer können Ihren Namen nicht aus der IP-Adresse ablesen. Nur Provider können dies. Ohnehin speichert ICQ Ihre IP-Adresse für eine Weile. Daher ist es nicht unbedingt ein Schutz der Privatsphäre, diese Einstellung nicht zu wählen.

source: <guilabel>Make my status available via ICQ's unified messaging center:</guilabel> If you choose this option, your status will be published on the messaging center (visible for everyone at www.icq.com/people).
de: <guilabel>Den eigenen Status über das ICQ-Unified-Messaging-Center zugänglich machen</guilabel>: Wenn Sie diese Einstellung gewählt haben, wird Ihr Status öffentlich im Messaging-Center sichtbar (für jeden auf www.icq.com/people).

source: <guilabel>Override default server information:</guilabel> If you want to modify the address where &kopete; log in to the ICQ network, this option makes it possible (normally you won't need this setting).
de: <guilabel>Standardserverinformationen übergehen</guilabel>: Möchten Sie die Adresse ändern, die &kopete; standardmäßig nutzt, um sich in das ICQ-Netzwerk einzuwählen, können Sie dies hier tun (in der Regel benötigen Sie diese Einstellung nicht).

source: <guilabel>Enable Proxy:</guilabel> connect through a <ulink url="http://en.wikipedia.org/wiki/Proxy_server">Proxy server</ulink>. Proxy servers are servers that transfer requests. Some companies, schools and universities use these servers to deny access to some websites. Users connecting from their home won't need this setting.
de: <guilabel>Proxy aktivieren</guilabel>: Über einen <ulink url="http://de.wikipedia.org/wiki/Proxy_(Rechnernetz)">Proxyserver</ulink>. Proxyserver sind Server, die Anfragen weiterleiten. Einige Firmen, Schulen und Universitäten nutzen solche Server, um den Zugriff auf einige Webseiten zu unterbinden. Benutzer daheim benötigen diese Einstellung normalerweise nicht.

source: <guilabel>Port Range:</guilabel> This option tells &kopete; which ports should be used for peer to peer connection. Further explanations of the function of ports would go too far here. If you want more information take a look at the <ulink url="http://en.wikipedia.org/wiki/Port_numbers">Wikipedia article</ulink>. Normally you won't get any problems with the default settings.
de: <guilabel>Port-Bereich</guilabel>: Diese Einstellung legt fest, welche Ports &kopete; für Peer-to-Peer-Verbindunen verwenden soll. Weitere Erläuterungen über die Funktionsweise von Ports führt hier zu weit. Wollen Sie mehr erfahren, sei auf den <ulink url="http://de.wikipedia.org/wiki/Port_(Protokoll)">Wikipedia-Artikel</ulink> verwiesen. In der Regel sollten Sie mit den Standardeinstellungen keine Probleme haben.

source: <guilabel>Timeout:</guilabel> defines, how many seconds &kopete; should wait before it drops connection. For example you send a file to one of your contacts but your contact's Internet connection is troubled so he does not get the file. This option tells &kopete; how long it should try to send the file. Normally you don't have to change this.
de: <guilabel>Zeitüberschreitung</guilabel> legt fest, wie viele Sekunden lang &kopete; bis zum Abbrechen einer Verbindung warten soll. Vergrößern Sie den hier eingestellten Wert, wenn Sie wegen instabiler Verbindung zum Internet (entweder Ihre eigene Verbindung oder die Ihres Kontaktpartners) Probleme beim Versenden von Dateien haben. Diese Einstellung legt fest, wie lange &kopete; versuchen soll, die Datei zu senden. In der Regel brauchen Sie diese Einstellung nicht zu ändern.

source: <guilabel>Default encoding:</guilabel> sets the encoding of the messages. Windows users will use the <quote>windows-125*</quote> (windows-1250 to windows-1258) encoding, so if you are going to chat with windows users, choose this option. And even if you only talk to persons not using windows it is likely that they will also use the windows-125* setting (because they perhaps chat with people using windows). The different windows encodings are for different countries. Choose the most fitting one (for example the <quote>Windows-1252 Western</quote> for countries like France or Germany). The difference between these encodings are only some special characters,so if they are not displayed correctly, try another.
de: <guilabel>Standardkodierung für Nachrichten</guilabel> legt die Zeichenkodierung der Nachrichten fest. Windows-Benutzer sollten die <quote>Windows-125*</quote>-Kodierung (Windows-1250 bis Windows-1258) verwenden. Sollten Sie also mit Windows-Benutzern chatten, wählen Sie diese Einstellung. Selbst wenn Sie nur mit Personen chatten, die kein Windows verwenden, ist es sehr wahrscheinlich, dass diese dennoch die windows-125*-Kodierung eingestellt haben (weil sie eventuell mit Windows-Benutzern chatten). Die verschiedenen Windows-Kodierungen sind für verschiedene Länder. Wählen Sie die, die für sie am besten zutrifft (zum Beispiel <quote>Windows-1252 Westeuropäisch</quote> für Länder wie Frankreich oder Deutschland). Die Unterschiede zwischen den einzelnen Kodierungen beziehen sich auf einige Sonderzeichen. Sollten also einige Zeichen nicht richtig dargestellt werden, probieren Sie eine andere Kodierung aus.

source: Now you have successfully configured your ICQ account. You can click on <guilabel>Next</guilabel> and <guilabel>Finish</guilabel>. If you have more than one account, you can choose different colors for them, so you can easily see which contacts come from which account.
de: Sie haben Ihren ICQ-Zugang nun erfolgreich eingerichtet. Zum Abschließen klicken Sie auf <guilabel>Weiter</guilabel> und <guilabel>Fertigstellen</guilabel>. Haben Sie mehr als einen Zugang, können Sie für jeden eine andere Farbe festlegen, so dass Sie schnell erkennen können, welcher Kontakt zu welchem Zugang gehört.

source: Add a contact
de: Einen Kontakt hinzufügen

source: Now you have connected &kopete; and your account. The window should look like this:
de: Nun, da Sie &kopete; mit Ihrem Zugang verbunden haben, sollte das Fenster wie folgt aussehen:

source: <phrase>Connected</phrase>
de: <phrase>Verbunden</phrase>

source: <para>Connected</para>
de: <para>Verbunden</para>

source: To add a contact press <guilabel>Add</guilabel> in the toolbar and choose your account (in this case it is your UIN), or you can use the menu <menuchoice><guimenu>File</guimenu><guisubmenu>Add Contact</guisubmenu><guimenuitem><replaceable>your account</replaceable></guimenuitem></menuchoice>. There you can enter the UIN of the person you want to add.
de: Um einen Kontakt hinzuzufügen, klicken Sie in der Werkzeugleiste auf <guilabel>Hinzufügen</guilabel> und wählen Sie Ihren Zugang (in diesem Fall Ihre UIN). Alternativ können Sie im Menü <menuchoice><guimenu>Datei</guimenu><guisubmenu>Kontakt hinzufügen</guisubmenu><guimenuitem><replaceable>Ihr Zugang</replaceable></guimenuitem></menuchoice> verwenden. Dort können Sie die UIN der Person, die Sie hinzufügen möchten, eingeben.

source: If you do not know the UIN, but perhaps the nickname or the e-mail address of a person, it is also possible to search for your contact. Click on the <guilabel>Search</guilabel> button.
de: Kennen Sie die UIN der Person, die Sie hinzufügen möchten, nicht, ist es auch möglich nach dem Benutzernamen oder E-Mail-Adresse der Person zu suchen. Klicken Sie hierfür auf den Knopf <guilabel>Suchen</guilabel>.

source: <phrase>It is also possible to search UINs</phrase>
de: <phrase>Suche nach UINs</phrase>

source: <para>It is also possible to search UINs</para>
de: <para>Suche nach UINs</para>

source: Being added
de: Hinzugefügt werden

source: If you use ICQ, it is very likely that you will get added by someone else. If this happens, &kopete; will display a message which contains the UIN of the person who wants to add you to his list.
de: Wenn Sie ICQ verwenden, ist es sehr wahrscheinlich, dass Sie von anderen hinzugefügt werden. Passiert dies, wird &kopete; eine Nachricht anzeigen, die die UIN der Person enthält, die Sie zu ihrer eigenen Kontaktliste hinzufügen möchte.

source: <phrase>authorization request</phrase>
de: <phrase>Autorisierungsanfrage</phrase>

source: <para>authorization request</para>
de: <para>Autorisierungsanfrage</para>

source: To get more information about the person click on <guilabel>Info...</guilabel>. A window will open which contains all the information available about the person.
de: Um mehr Informationen über die Person zu bekommen, klicken Sie auf <guilabel>Informationen ...</guilabel>. Ein Fenster mit den verfügbaren Informationen über die Person wird sich öffnen.

source: Now you can authorize or block the person. If you authorize, you can chat with him and vice versa, if you block him, he can't talk with you.
de: Nun können Sie die Person autorisieren oder blockieren. Autorisieren Sie, können Sie mit der Person chatten und diese mit Ihnen. Blockieren Sie, kann diese Person nicht mit Ihnen chatten.

source: Chatting
de: Chatten

source: To chat, click on one of your contacts. A chat window will appear. There you can type your text and send it.
de: Um zu chatten klicken Sie auf einen Ihrer Kontakte und ein Chatfenster wird sich öffnen. Hier können Sie Ihren Text eingeben und absenden.

source: <phrase>Chat with your contacts</phrase>
de: <phrase>Chatten Sie mit Ihren Kontakten</phrase>

source: <para>Chat with your contacts</para>
de: <para>Chatten Sie mit Ihren Kontakten</para>

source: It is also possible to send messages to persons that are offline. They will receive your message as soon as they go online.
de: Es ist auch möglich, Nachrichten an Personen zu schicken, die gerade nicht online sind. Diese werden die Nachricht erhalten, sobald sie wieder online sind.

source: Sadly, there is a lot of spam (spam are messages you don't want, usually advertisement or viruses) on the ICQ network. To avoid spam, you should authorize only people you know. There is nothing you can really do about this problem. Just ignore them!
de: Leider gibt es viel Spam im ICQ-Netzwerk (Spam sind ungewünschte Nachrichten und in der Regel Werbung oder Viren). Um Spam zu vermeiden, sollten Sie nur Personen autorisieren, die Sie kennen. Außer ignorieren können Sie nicht viel bei diesem Problem machen.
