Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdenetwork/kopete.po
Languages: de

source: File Transfers
de: Dateiübertragungen

source: Some &im; systems allow you to send and receive files. You can access this function from the contact's context menu. If you're already chatting, and want to send a file, simply drag the file from any other part of &kde; into the Chat Window, or select the <menuchoice><guimenu>Chat</guimenu><guimenuitem>Send File</guimenuitem></menuchoice> menu.
de: Einige &im;-Dienste können Dateien übertragen. Diese Funktion erreichen Sie über das Kontextmenü des Kontakts. Während eines Chats müssen Sie lediglich die Datei in das Chatfenster ziehen oder im Menü <menuchoice><guimenu>Chat</guimenu><guisubmenu>Datei senden</guisubmenu></menuchoice> auswählen.

source: Keyboard Shortcuts
de: Tastenzuordnungen

source: The following keyboard shortcuts are supported in the Chat window:
de: Folgende Tastaturkürzel sind im Chatfenster verfügbar:

source: Send the message in the <interface>Input Area</interface>.
de: Sendet die Nachricht im <interface>Eingabebereich</interface>.

source: Print the contents of the Chat View.
de: Druckt den Inhalt der Chat-Ansicht.

source: Save the contents of the Chat View.
de: Speichert den Inhalt der Chat-Ansicht.

source: Close the current Chat View. The Chat window will close unless there is more than one tab in the window.
de: Schließt die aktuelle Chat-Ansicht. Damit schließt sich auch das Chatfenster, wenn sich nicht mehr als ein Unterfenster in diesem Fenster befindet.

source: Change to the previous tab.
de: Wechselt zum vorherigen Unterfenster.

source: Change to the next tab.
de: Wechselt zum nächsten Unterfenster.

source: Detach a tabbed chat into a separate window.
de: Verselbständigen eines Chat-Unterfensters und Darstellung in einem eigenen Fenster.

source: Complete a partially typed nickname belonging to someone you're chatting with.
de: Automatische Vervollständigung des Namens eines der Chat-Teilnehmer.

source: Configuring &kopete;
de: &kopete; einrichten

source: To configure &kopete;, look in the <menuchoice><guimenu>Settings</guimenu></menuchoice> menu.
de: Die Einrichtung von &kopete; wird über das Menü <menuchoice><guimenu>Einstellungen</guimenu></menuchoice> durchgeführt.

source: Global Shortcuts
de: Globale Kurzbefehle

source: &kopete; defines some shortcuts which are valid in any &kde; application.
de: &kopete; definiert einige Tastenkürzel, die in jeder &kde;-Anwendung verwendet werden können.

source: Global Keyboard Shortcuts
de: Globale Tastenzuordnungen

source: Read Message. This is useful if you have hidden the <interface>Contact List</interface> window and the system tray icon is animating to tell you you have a new message.
de: Nachricht lesen. Diese Funktion ist sinnvoll, falls die <interface>Kontaktliste</interface> ausgeblendet ist und das Kontrollleistensymbol eine neue Nachricht signalisiert.

source: Show/hide (Dock) the <interface>Contact List</interface> window. <emphasis>Warning:</emphasis> If you have disabled &kopete;'s System Tray icon or don't have a system tray, this can make the <interface>Contact List</interface> vanish - the only way to restore it is to repeat this shortcut.
de: Ein-/Ausblenden der <interface>Kontaktliste</interface>. <emphasis>Warnung:</emphasis> Falls das Kontrollleistensymbol von &kopete; deaktiviert ist oder keine Kontrollleiste vorhanden ist, verschwindet die <interface>Kontaktliste</interface> vollständig - lediglich durch Wiederholung des Tastaturkurzbefehls kann sie wiederhergestellt werden.

source: The Configure &kopete; Dialog
de: Der Dialog &kopete; einrichten

source: Adding and Editing Accounts
de: Hinzufügen und Bearbeiten von Zugängen

source: We briefly showed you how to add an account in <link linkend="getting-started">Getting Started</link>. To change an account's settings later, open up the <guilabel>Configure &kopete;</guilabel> dialog, with <menuchoice><guimenu>Settings</guimenu><guimenuitem>Configure...</guimenuitem></menuchoice>. Much like the &kde; &systemsettings;, the configuration is separated into sections. The icons on the left side of the dialog switch between sections.
de: Unter <link linkend="getting-started">Erste Schritte</link> wurde erklärt, wie Sie einen Zugang hinzufügen. Die Einstellungen eines Zugangs können Sie später im Einrichtungsdialog ändern, den Sie im Menü über <menuchoice><guimenu>Einstellungen</guimenu><guimenuitem>Einrichten ...</guimenuitem></menuchoice> aufrufen. Wie auch in anderen Einrichtungsdialogen wie zum Beispiel in den &kde;-&systemsettings; ist die Einrichtung auf mehrere Seiten aufgeteilt. Mit den Symbolen auf der linken Seite wird zwischen den Seiten umgeschaltet.

source: On the Accounts page, you can <link linkend="creating-accounts"><guibutton>Add</guibutton></link>, <guibutton>Remove</guibutton>, or <guibutton>Modify</guibutton> accounts. Editing accounts is much the same as adding them, but note that you cannot change the UIN, buddy name, or whatever account identifier your &im; system uses. This is intrinsic to the account. If you want to change this, you will have to add another account with the new account identifier and (optionally) remove the old account.
de: Auf der Seite <link linkend="creating-accounts">Zugänge</link> können Sie <guibutton>Zugänge hinzufügen</guibutton>, <guibutton>Zugänge entfernen</guibutton> oder <guibutton>Zugänge ändern</guibutton>. Die Änderung von Einträgen funktioniert ähnlich wie das Hinzufügen. Allerdings kann die UIN, der Name oder was immer das &im;-System zur Identifikation des Zugangs verwendet, nicht geändert werden. Falls Sie diese Einstellung ändern möchten, müssen Sie einen neuen Zugang einrichten und möglicherweise den alten löschen.

source: You can quickly distinguish between multiple accounts using the same &im; system by giving a custom color to each account's status bar entry and contact icons. To do so, select the account and click the color selector on the right side of the page.
de: Zur besseren Unterscheidung mehrerer Zugänge für das gleiche &im;-System können Sie unterschiedliche Farben für die Statusleiste und Kontaktsymbole vergeben. Wählen Sie dazu den gewünschten Zugang aus und klicken Sie auf den Farbauswahlknopf rechts.

source: You can control the priority of accounts using the <guiicon>Up</guiicon> and <guiicon>Down</guiicon> icons on this page. If you have more than one way to message a contact, this determines the &im; system &kopete; will use to communicate them.
de: Mit Hilfe der Maus können Sie die Zugänge in der Liste verschieben und so die Priorität der Zugänge verändern. Bei Kontakten, die auf mehrere Arten erreicht werden können, wird hierüber das gewünschte &im;-System von &kopete; ausgewählt.

source: Global Identity
de: Standard-Identität

source: &kopete;'s Global Identity lets you set your own nickname and photo once for all your &im; accounts. You can read these details from the &kde; address book entry for yourself, from a single one of your contacts, or add a completely new nickname or photo. If you have an exciting dual life, you can create multiple identities and switch between them in the <guilabel>Identity</guilabel> section.
de: Mit &kopete;s „Standard-Identität“ kann ein Spitzname und ein Foto sowie weitere Addressdaten zur Verwendung für alle &im;-Zugänge eingegeben werden. Es ist auch möglich, mehrere <guilabel>Identitäten</guilabel> zu erstellen und zwischen ihnen zu wechseln.

source: Behavior
de: Verhalten

source: Behavior covers the way &kopete; integrates with your desktop, <emphasis>Away</emphasis> settings, and chat user interface options.
de: Unter Verhalten befinden sich Einstellungen zur Integration von &kopete; in ihre Arbeitsfläche und Einstellungen zur Oberfläche der Chatfenster.

source: The General tab
de: Die Karteikarte Allgemein

source: Here you can customize &kopete;'s desktop integration, and control the way the contact list is laid out.
de: Hier können Sie die Arbeitsflächenintegration und das Erscheinungsbild der Kontaktliste von &kopete; festlegen.

source: Show system tray icon
de: Symbol im Systemabschnitt der Kontrollleiste anzeigen

source: By default, &kopete; places an icon in the &kde; System Tray. If you prefer, you can turn this off here.
de: Standardmäßig fügt &kopete; ein Symbol zur &kde; Kontrollleiste hinzu. Das können Sie hier abschalten.

source: Start with hidden main window
de: Mit ausgeblendetem Hauptfenster starten

source: This causes &kopete; to start with the <interface>Contact List</interface> window hidden (docked). You can make it visible by clicking the system tray icon or with the <link linkend="configuring-global-shortcuts">Show Contact List global shortcut</link>.
de: Diese Einstellung lässt &kopete; mit ausgeblendeter <interface>Kontaktliste</interface> starten. Sie wird erst durch Klicken auf das Kontrollleistensymbol oder über <link linkend="configuring-global-shortcuts">Anzeigen/Ausblenden der Kontaktliste</link> eingeblendet.

source: Open messages instantly
de: Nachrichten sofort öffnen

source: New messages open chat windows as soon as they arrive.
de: Beim Eintreffen neuer Nachrichten wird sofort ein neues Chatfenster geöffnet.

source: Use message queue
de: Nachrichtenwarteschlange verwenden

source: The message queue is where &kopete; puts messages when there is no chat window open. This allows you to be notified of new messages with popup <quote>speech bubbles</quote>; or by animating the System Tray icon. If you choose to disable the message queue, chat windows will open as soon as you receive a new message.
de: In die Nachrichtenwarteschlange platziert &kopete; die Nachrichten, wenn kein Chatfenster geöffnet ist. Das ermöglicht die Benachrichtigung mit <quote>Sprechblasen</quote> oder über ein animiertes Kontrollleistensymbol bei neuen Nachrichten. Bei deaktivierter Nachrichtenwarteschlange wird bei einer eintreffenden Nachricht sofort ein Chatfenster geöffnet.

source: Use message stack
de: Ungelesene Nachrichten in Warteschlange ablegen

source: If you use a message stack, &kopete; shows recently received messages starting with the last message received.
de: Ungelesene Nachrichten werden in einem bereits offenen, aber inaktiven Fenster angezeigt. Nur eingehende Nachrichten in der Warteschlange werden in der Sprechblase und über das animierte Symbol angezeigt. Wenn diese Einstellung inaktiv ist, werden nur neue eingehende Nachrichten in die Warteschlange gestellt, d. h. Nachrichten, die nicht direkt angezeigt werden können.

source: Notifications
de: Benachrichtigungen

source: Show a bubble on new message
de: Bei neuer Nachricht Sprechblase anzeigen

source: This option shows a <quote>speech bubble</quote>; coming from the System Tray icon when you receive a new message. You can start a chat or ignore the message. &URL;s are extracted from the message; if you click a link, your preferred browser will open the link and the message will be dismissed.
de: Diese Option zeigt bei einer neuen Nachricht eine <quote>Sprechblase</quote> an, die aus dem Kontrollleistensymbol kommt. Sie können die Nachricht ignorieren oder einen Chat beginnen. &URL;s werden aus der Nachricht extrahiert. Beim Klicken darauf öffnet sich der eingestellte Browser und die Nachricht verschwindet.

source: Flash the system tray on new messages
de: Bei neuer Nachricht Systemabschnitt aufblinken lassen

source: This option causes the System Tray icon to animate when you receive a new message. Clicking the icon will show the message in a chat window.
de: Durch diese Option wird eine Animation des Systemabschnittsymbols bei Ankunft einer neuen Nachricht angezeigt. Klicken auf das Symbol zeigt die Nachricht in einem neu geöffneten Chatfenster.

source: Enable events while away
de: Ereignisse bei Abwesenheit aktivieren

source: If you do not wish to be distracted by these notifications while you are set <emphasis>Away</emphasis>, uncheck this box.
de: Falls Sie nicht von Benachrichtigungen abgelenkt werden wollen, solange der Status <emphasis>Abwesend</emphasis> gesetzt ist, entfernen Sie diese Markierung.

source: Configure Sounds &amp; Events
de: Klänge &amp; Ereignisse einrichten

source: Sounds, flashing taskbar entries, passive popups and more exotic notifications are supported in &kopete; using the &kde; notification system. Type <userinput>help:/kcontrol/kcmnotify</userinput> in &konqueror; or select the Help tab in the <guilabel>System Notifications</guilabel> section of the &systemsettings; for more information.
de: &kopete; unterstützt Klänge, blinkende Fensterleisteneinträge, passive Meldungsfenster und andere ungewöhnliche Benachrichtigungsarten mit Hilfe des &kde;-Benachrichtigungssystems. Tippen Sie <userinput>help:/kcontrol/kcmnotify</userinput> in &konqueror; oder wählen Sie die Hilfe im Abschnitt <guilabel>Benachrichtigungen</guilabel> der &systemsettings; für genauere Informationen.

source: To add custom notifications for a contact, right click that contact in the Contact List and select Properties. This lets you start chats, play a custom sound effect, or display a message for that contact or group. Otherwise you can use the <quote>Execute a program</quote> notification to perform custom notifications. As an example, if you have <application>XOSD</application> (X On-Screen Display) installed, you can get OSD online notifications by executing the following command when the <quote>User goes online</quote> event takes place:
de: Zum Einrichten einer benutzerdefinierten Benachrichtigung für einen Kontakt klicken Sie mit der rechten Maustaste auf den Kontakt in der Kontaktliste und wählen dann Eigenschaften. Auf diese Weise können Chats gestartet, Sound-Effekte wiedergegeben oder Nachrichten für diesen Kontakt oder die Gruppe angezeigt werden. Außerdem kann man <quote>Programm ausführen</quote> als benutzerdefinierte Benachrichtigung verwenden. Beispielsweise können Sie mit <application>XOSD</application> (X On-Screen-Display) eine OSD-Benachrichtigung erhalten, wenn das Ereignis <quote>Benutzer geht Online</quote> auftritt:

source: OhReally at the &kde; Forum suggests having your online notifications read out by a speech synthesizer, using <ulink url="http://mambo.ucsc.edu/psl/mbrola">MBROLA</ulink> like so:
de: Sie können nach einem Vorschlag im &kde;-Forum die Online-Benachrichtigungen mit einem Sprachsynthesizer mit <ulink url="http://mambo.ucsc.edu/psl/mbrola">MBROLA</ulink> vorlesen lassen:

source: The 'sed' in the middle phoneticises &kopete;'s output to so the synthesizer has a better Dutch pronunciation.
de: Das <quote>sed</quote> in der Mitte dient dazu, für die Ausgabe von &kopete; eine bessere holländische Aussprache zu erzielen.

source: Away Settings
de: Abwesenheitseinstellungen

source: Notify all open chats when I go away
de: Alle geöffneten Chats von meiner Abwesenheit informieren

source: Be careful if you enable this item; it will cause a message to be sent to open chats when you become away, which some people may find intrusive.
de: Bedenken Sie vor dem Aktivieren dieser Einstellung, dass bei ihrer Abwesenheit an jeden offenen Chat eine Nachricht gesendet wird. Einige könnten das als aufdringlich empfinden.

source: Auto Away
de: Automatische Abwesenheit

source: Here you can choose to have &kopete; set you away after a period of inactivity.
de: Hier können Sie einstellen, dass &kopete; nach einer gewissen Inaktivitätszeit auf Abwesenheit umschaltet.

source: Predefined Away Messages
de: Vordefinierte Abwesenheitsnachrichten

source: You can define as many custom away messages as you like here, and choose from them when you go <emphasis>Away</emphasis> using the <guibutton>Status</guibutton> button on the <link linkend="contact-list-layout-toolbar">main toolbar</link>.
de: Sie können beliebig viele Abwesenheitsnachrichten vordefinieren und von diesen beim Umschalten auf <emphasis>Abwesenheit</emphasis> eine auswählen. Dazu verwenden Sie den Knopf <guibutton>Status</guibutton> in der <link linkend="contact-list-layout-toolbar">Hauptwerkzeugleiste</link>.

source: Chat Settings
de: Chat-Einstellungen

source: Raise window/tab on new messages
de: Fenster bei neuen Nachrichten nach vorne holen

source: This causes a chat window to pop up when it receives a new message.
de: Damit öffnet sich ein Chatfenster, wenn es eine neue Nachricht erhält.

source: Show events in chat window
de: Ereignisse im Chatfenster anzeigen

source: Some &im; systems can give extra information, like people joining or leaving chats. This option lets you receive these messages in your chat window.
de: Einige &im;-Dienste bieten zusätzliche Informationen wie hinzukommende oder sich entfernende Personen. Diese Option zeigt derartige Informationen im Chatfenster an.

source: Highlight messages containing your nickname
de: Nachrichten mit ihrem Spitznamen farblich hervorheben

source: This simply emphasizes messages in a chat that contain your nickname. For more powerful control over highlighting and other events, see the <link linkend="plugins-highlight">Highlight plugin</link>.
de: Hiermit werden Nachrichten, die den eigenen Spitznamen enthalten, hervorgehoben. Weiter reichende Einstellungen zu Hervorhebungen und anderen Ereignissen finden Sie im Modul <link linkend="plugins-highlight">Hervorgehoben</link>.

source: Interface Preference
de: Schnittstellenauswahl

source: &kopete; can send messages using either a <quote>fire and forget</quote> interface that does not wait for a reply, or a chat window where the conversation is visible as it unfolds. Here you can choose which style to use by default.
de: Die Eingabe von Nachrichten in &kopete; kann entweder über ein <quote>Senden und Vergessen</quote>-Interface, das nicht auf eine Antwort wartet, oder über ein Chatfenster, das den Dialog so darstellt, wie er sich entwickelt, erfolgen. Hier kann der Standardstil ausgewählt werden.

source: Chat Window Grouping Policy
de: Regelungen zur Gruppierung von Chatfenstern

source: If you wish to group chats within tabs in a single window, &kopete; lets you choose several ways to determine the grouping.
de: Falls Sie Chatfenster als Unterfenster innerhalb eines Fensters anordnen möchten, bietet &kopete; dafür einige Einstellungen.

source: Open all messages in a new chat window
de: Jede Nachricht in einem eigenen Chatfenster anzeigen.

source: Group all messages from the same account in the same chat window
de: Alle Nachrichten des gleichen Zugangs im gleichen Chatfenster zusammenfassen

source: Group all messages in the same chat window
de: Alle Nachrichten werden in einem Chatfenster gruppiert angezeigt

source: Group all messages in the same group in the same chat window
de: Alle Nachrichten der gleichen Gruppe werden im selben Chatfenster angezeigt

source: Group all messages from the same metacontact in the same chat window
de: Alle Nachrichten des gleichen Metakontaktes werden im selben Chatfenster angezeigt

source: Chat Window Line Limit
de: Zeilenanzahl des Chatfensters

source: Maximum number of chat window lines
de: Maximale Anzahl der Zeilen im Chatfenster

source: This limits the number of lines of text the chat window can display.
de: Hiermit wird die maximale Anzahl von Textzeilen des Chatfensters begrenzt.

source: Appearance
de: Erscheinungsbild

source: Appearance governs the style of the Chat window, its colors and fonts, and lets you choose your preferred emoticons.
de: Das Erscheinungsbild beeinflusst den Stil der Chatfenster, deren Farben und Schriftarten, und ermöglicht die Auswahl von bevorzugten Emoticons.

source: Emoticons (also known as smileys) are combinations of characters such as <userinput>;-)</userinput>that look like a face, and communicate moods or expressions. &kopete; can optionally use graphical emoticons in place of the characters themselves.
de: Emoticons (auch bekannt als <quote>Smileys</quote>) sind Kombinationen von Zeichen wie &eg; <userinput>;-)</userinput>, die wie Gesichter aussehen und Stimmungen ausdrücken sollen. &kopete; kann an Stelle der Zeichen grafische Emoticons verwenden.

source: On this tab, you can select which emoticon set you prefer, or turn off graphical emoticons altogether.
de: Auf dieser Seite kann der gewünschte Stil der Emoticons ausgewählt oder grafische Emoticons komplett abgeschaltet werden.

source: Chat Window
de: Chatfenster

source: Styles
de: Stile

source: The style of the chat view can be altered to look like other clients. Installed styles are shown in the list on the left and are previewed in the main panel. See <link linkend="chatwindowstyleguide">Chat Window Style guide</link> for a document how to make your own style.
de: Sie können den Stil des Chatfensters an das Aussehen anderer Programme anpassen oder selbst einen Stil erfinden. Sie finden die installierten Stile in der Liste links und deren Vorschau im Hauptbereich. Weitere Informationen zum Erstellen eigener Stile finden Sie in <link linkend="chatwindowstyleguide">Einführung in Chatfenster-Stile</link>.

source: Third party styles are available at <ulink url="http://kde-look.org">http://kde-look.org</ulink>. &kopete; 0.12 now supports styles from Adium(an &im; program on &Mac; OS X). So you can download styles from Adium here: <ulink url="http://www.adiumxtras.com/">Adium Xtras</ulink> and select Message View Styles.
de: Stile, die von Dritten bereitgestellt werden, finden Sie auf <ulink url="http://kde-look.org">http://kde-look.org</ulink>. Beginnend mit &kopete; 0.12 werden Stile von Adium (ein &im;-Programm für &Mac; OS X) unterstützt. Sie können nun Stile für Adium unter folgender Adresse herunterladen: <ulink url="http://www.adiumxtras.com/">Adium Xtras</ulink>. Wählen Sie hier <quote>Message View Styles</quote>.

source: To install a style, click <guibutton>Install...</guibutton>. Select an archive file containing the style. To delete a style, select a style in the list and click <guibutton>Delete</guibutton>.
de: Um einen Stil zu installieren, klicken Sie <guibutton>Installieren ...</guibutton>. Wählen Sie das Archiv aus, in dem der Stil enthalten ist. Um einen Stil zu löschen, wählen Sie diesen in der Liste aus und drücken <guibutton>Löschen</guibutton>.

source: <guilabel>Group consecutive messages</guilabel> is a useful option to make your chats more readable. If you receive several messages in a row from the same contact, they are grouped without repeating the sender name.
de: <guilabel>Aufeinander folgende Nachrichten gruppieren</guilabel> ist eine Einstellung die es erleichtert, den Chat zu lesen. Hiermit werden aufeinanderfolgende Nachrichten, die vom selben Benutzer kommen, ohne wiederholte Anzeige des Sendernamens gruppiert.

source: Arrange metacontacts by group
de: Metakontakte nach Gruppen ordnen

source: By disabling this, &kopete;'s groups are hidden, and contacts are divided only into <guilabel>Online Contacts</guilabel> and <guilabel>Offline Contacts</guilabel>.
de: Durch Deaktivierung dieser Option blendet &kopete; Gruppen aus und die Kontakte sind nur in <guilabel>Online-Kontakte</guilabel> und <guilabel>Offline-Kontakte</guilabel> unterteilt.

source: Show tree branch lines
de: Baumartige Linien anzeigen

source: Usually &kopete; displays contacts and groups as a tree, where group members are indented. For a simpler appearance, you can disable this, so the contact list becomes a flat list. You can also control whether branches are indented here.
de: Üblicherweise zeigt &kopete; Kontakte und Gruppen in einer Baumstruktur an, bei der Gruppenmitglieder eingerückt sind. Das kann zugunsten eines einfacheren Erscheinungsbildes in eine einfache Liste umgewandelt werden.

source: Contact Display Mode
de: Kontaktanzeigemodus
