Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdenetwork/kopete_menus.po
Languages: de

source: Menu Entries
de: Menüeinträge

source: Each menu item is discussed below. When there is a keyboard shortcut that performs a menu item function, the default shortcut is listed with the menu item.
de: Die einzelnen Menüeinträge sind unten beschrieben. Falls eine Tastenkombination existiert, die die entsprechende Funktion ausführt, wird die Standardkombination neben dem Menüeintrag aufgeführt.

source: The Contact List Window's Menus
de: Fenstermenü der Kontaktliste

source: File Menu
de: Das Menü Datei

source: <guimenu>File</guimenu> <guisubmenu>Set Status</guisubmenu> <guimenuitem>Online</guimenuitem>
de: <guimenu>Datei</guimenu> <guisubmenu>Status setzen</guisubmenu><guimenuitem> Online</guimenuitem>

source: Go online with all accounts
de: Mit allen Zugängen Online gehen

source: <guimenu>File</guimenu> <guisubmenu>Set Status</guisubmenu> <guimenuitem>Away</guimenuitem>
de: <guimenu>Datei</guimenu> <guisubmenu>Status setzen</guisubmenu> <guimenuitem>Abwesend</guimenuitem>

source: Set all connected accounts away
de: Alle Online-Zugänge auf den Status Abwesend setzen

source: <guimenu>File</guimenu> <guisubmenu>Set Status</guisubmenu> <guimenuitem>Offline</guimenuitem>
de: <guimenu>Datei</guimenu> <guisubmenu>Status</guisubmenu> <guimenuitem>Offline</guimenuitem>

source: Set all accounts offline
de: Mit allen Zugängen Offline gehen

source: <guimenu>File</guimenu> <guimenuitem>Add Contact...</guimenuitem>
de: <guimenu>Datei</guimenu> <guimenuitem>Kontakt hinzufügen ...</guimenuitem>

source: This displays the Add Contact Wizard, which allows you to add a new contact to your list
de: Dies startet den Assistent zum Hinzufügen von Kontakten, mit dem Sie einen neuen Kontakt zu Ihrer Liste hinzufügen können.

source: <guimenu>File</guimenu> <guimenuitem>Create New Group...</guimenuitem>
de: <guimenu>Datei</guimenu> <guimenuitem>Neue Gruppe erstellen ...</guimenuitem>

source: Prompts you for the new group's name and adds it to the contact list.
de: Fragt nach einem Gruppennamen und fügt diesen zur Kontaktliste hinzu.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Quit</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo> </shortcut><guimenu>Datei</guimenu><guimenuitem>Beenden</guimenuitem>

source: Disconnects you from all &im; systems, closes all the windows and exits the application.
de: Trennt die Verbindungen zu allen &im;-Diensten und beendet das Programm.

source: Edit Menu
de: Das Menü Bearbeiten

source: <guimenu>Edit</guimenu> <guimenuitem>Send Single Message...</guimenuitem>
de: <guimenu>Bearbeiten</guimenu><guimenuitem>Einzelne Nachricht senden ...</guimenuitem>

source: Opens an email-style message window with the selected contact, to send a single message.
de: Öffnet ein Fenster ähnlich einem E-Mail-Fenster, um an den ausgewählten Kontakt eine Nachricht zu schicken.

source: <guimenu>Edit</guimenu> <guimenuitem>Start Chat...</guimenuitem>
de: <guimenu>Bearbeiten</guimenu><guimenuitem>Chat starten ...</guimenuitem>

source: Opens a chat window with the selected contact, to have a conversation.
de: Öffnet ein Chatfenster, um mit dem ausgewählten Kontakt eine Unterhaltung zu beginnen.

source: <guimenu>Edit</guimenu> <guimenuitem>Send File...</guimenuitem>
de: <guimenu>Bearbeiten</guimenu> <guimenuitem>Datei senden ...</guimenuitem>

source: If supported by the &im; system, this opens a file selector to choose a file to send to the selected contact.
de: Öffnet einen Dateiauswahldialog zur Auswahl einer Datei, die an den ausgewählten Kontakt gesendet wird, falls der &im;-Dienst dieses unterstützt.

source: <guimenu>Edit</guimenu> <guisubmenu>Move To</guisubmenu>
de: <guimenu>Bearbeiten</guimenu> <guisubmenu>Verschieben nach</guisubmenu>

source: (Enabled when a contact is selected) Choose another group from the sub-menu, and the contact will move to that group.
de: Dieser Menüeintrag ist nur aktiviert, wenn ein Kontakt ausgewählt ist, damit verschieben Sie den Kontakt in die Gruppe, die Sie aus dem Untermenü auswählen können.

source: <guimenu>Edit</guimenu> <guisubmenu>Copy To</guisubmenu>
de: <guimenu>Bearbeiten</guimenu> <guisubmenu>Kopieren nach</guisubmenu>

source: (Enabled when a contact is selected) Choose a group from the sub-menu, and the contact will be copied to group. &im; systems that allow contacts to be in more than one group on the server contact list will be updated accordingly.
de: Dieser Menüeintrag ist nur aktiviert, wenn ein Kontakt ausgewählt ist. Dies kopiert den Kontakt in die Gruppe, die Sie aus dem Untermenü auswählen können. Falls der &im;-Dienst erlaubt, Kontakte in mehr als einer Gruppe zu haben, werden die Daten auf dem Server automatisch aktualisiert.

source: <guimenu>Edit</guimenu> <guisubmenu>Add Contact...</guisubmenu>
de: <guimenu>Bearbeiten</guimenu><guisubmenu>Kontakt hinzufügen</guisubmenu>

source: (Enabled when a contact is selected) Choose another account from the submenu, and you can add another way to message that person using that account.
de: Dieser Menüeintrag ist nur aktiviert, wenn ein Kontakt ausgewählt ist. Wählen Sie einen weiteren Zugang aus dem Untermenü, um zu diesem Kontakt einen weiteren Nachrichtendienst hinzuzufügen.

source: <guimenu>Edit</guimenu> <guimenuitem>Add to Your Contact List...</guimenuitem>
de: <guimenu>Bearbeiten</guimenu> <guimenuitem>Zu Kontaktliste hinzufügen</guimenuitem>

source: (Enabled when a contact is selected) Sometimes people will message you who aren't on your contact list already. In this case, &kopete; creates a temporary entry for them, but to keep them on your contact list, use this function.
de: Dieser Menüeintrag ist nur aktiviert, wenn ein Kontakt ausgewählt ist. Manchmal erhalten Sie Nachrichten von Personen, die noch nicht in der Kontaktliste stehen. In diesem Fall erzeugt &kopete; einen temporären Eintrag. Diese Funktion fügt den Kontakt dauerhaft zur Kontaktliste hinzu.

source: <shortcut><keycombo><keycap>Del</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Delete Contact</guimenuitem>
de: <shortcut><keycombo><keycap>Entf</keycap></keycombo> </shortcut> <guimenu>Bearbeiten</guimenu> <guimenuitem>Kontakt löschen</guimenuitem>

source: (Enabled when a contact is selected) Removes a contact from the contact list entirely.
de: Dieser Menüeintrag ist nur aktiviert, wenn ein Kontakt ausgewählt ist. Damit wird ein Kontakt aus der Kontaktliste gelöscht.

source: <shortcut><keycombo><keycap>F2</keycap></keycombo></shortcut> <guimenu>Edit</guimenu> <guimenuitem>Rename</guimenuitem>
de: <shortcut><keycombo><keycap>F2</keycap></keycombo></shortcut> <guimenu>Bearbeiten</guimenu> <guimenuitem>Umbenennen</guimenuitem>

source: (Enabled when a contact is selected) Renames the contact on the contact list. If you do this, the contact list entry will no longer change if the contact changes their display name remotely. You can re-enable this using the contact's Properties dialog.
de: Dieser Menüeintrag ist nur aktiviert, wenn ein Kontakt ausgewählt ist. Der Kontakt in der Kontaktliste wird umbenannt. Danach ändert sich der Kontaktlisteneintrag nicht mehr automatisch, wenn der Kontakt seinen Spitznamen ändert. Das kann über den Eigenschaftendialog wieder eingeschaltet werden.

source: <guimenu>Edit</guimenu> <guimenuitem>Properties</guimenuitem>
de: <guimenu>Bearbeiten</guimenu> <guimenuitem>Eigenschaften</guimenuitem>

source: The Properties dialog lets you choose custom icons for the selected item, and change its name.
de: In diesem Dialog können Sie benutzerdefinierte Symbole für den Kontakt wählen und dessen Namen ändern.

source: For contacts, you can change the &kde; Address Book entry that they are associated with.
de: Sie können den &kde;-Adressbucheintrag ändern, mit dem ein Kontakt verknüpft ist.

source: <guimenu>Edit</guimenu> <guimenuitem>Remove Group</guimenuitem>
de: <guimenu>Bearbeiten</guimenu><guimenuitem>Gruppe entfernen</guimenuitem>

source: (Enabled when a group is selected) Removes a group from the contact list entirely. Any contacts that are only in this group are moved to the top level.
de: Dieser Menüeintrag ist nur aktiviert, wenn eine Gruppe ausgewählt ist. Damit wird eine Gruppe aus der Kontaktliste entfernt. Alle Kontakte der Gruppe werden in die oberste Ebene verschoben.

source: <guimenu>Edit</guimenu> <guimenuitem>Rename Group</guimenuitem>
de: <guimenu>Bearbeiten</guimenu><guimenuitem>Gruppe umbenennen</guimenuitem>

source: (Enabled when a group is selected) Renames the group.
de: Benennt die Gruppe um. Dieser Menüeintrag ist nur aktiviert, wenn eine Gruppe ausgewählt ist.

source: Settings Menu
de: Das Menü Einstellungen

source: &kopete; has a default &kde; Settings menu as described in the <ulink url="help:/fundamentals/ui.html#menus-settings">&kde; Fundamentals</ulink> with additional entries:
de: &kopete; hat das bekannten &kde;-Menü <guimenu>Einstellungen</guimenu> aus den <ulink url="help:/fundamentals/ui.html#menus-settings">&kde;-Grundlagen</ulink> mit zusätzlichen Einträgen:

source: <guimenu>Settings</guimenu> <guimenuitem>Show Offline Users</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>Offline-Benutzer anzeigen</guimenuitem>

source: This shows/hides contacts who are currently offline. They will become visible when they go online again.
de: Blendet die Kontakte, die aktuelle Offline sind, ein/aus. Sie werden sichtbar, sobald Sie Online gehen.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>G</keycap></keycombo> </shortcut> <guimenu>Settings</guimenu> <guimenuitem>Show Empty Groups</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>G</keycap> </keycombo></shortcut><guimenu>Einstellungen</guimenu> <guimenuitem> Anzeige leerer Gruppen</guimenuitem>

source: This shows/hides groups which do not have any members, or where all the members are offline and hidden (see above).
de: Blendet Gruppen ein/aus, die keine Mitglieder haben bzw. deren Mitglieder alle Offline und ausgeblendet sind (siehe weiter oben).

source: <guimenu>Settings</guimenu> <guimenuitem>Configure Global Shortcuts...</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>Globale Kurzbefehle einrichten ...</guimenuitem>

source: Displays the &kde; standard Configure Global Shortcuts dialog, where you can change keyboard shortcuts that work all the time under &kde;.
de: Zeigt den &kde;-Standarddialog zur Festlegung der globalen Tastenzuordnungen an. Dort können Zuordnungen festgelegt werden, die in jedem Programm unter &kde; aktiv sind.

source: Help Menu
de: Das Menü Hilfe

source: The contact list window has the common &kde; Help menu items, for more information read the section about the <ulink url="help:/fundamentals/ui.html#menus-help">Help Menu</ulink> of the &kde; Fundamentals.
de: Das Kontaktlistenfenster benutzt die bekannten &kde;-Einträge im Menü <guimenu>Hilfe</guimenu>, weitere Informationen dazu finden Sie im Abschnitt über das Menü <ulink url="help:/fundamentals/uihtml#menus-help">Hilfe</ulink> der &kde;-Grundlagen.

source: The Chat Window's Menus
de: Die Menüs des Chatfensters

source: Chat Menu
de: Das Menü Chat

source: <shortcut><keycap>Return</keycap> </shortcut> <guimenu>Chat</guimenu> <guimenuitem>Send Message</guimenuitem>
de: <shortcut><keycap>Eingabe</keycap> </shortcut> <guimenu>Chat</guimenu> <guimenuitem>Nachricht senden</guimenuitem>

source: Sends a message.
de: Sendet eine Nachricht.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>S</keycap></keycombo> </shortcut> <guimenu>Chat</guimenu> <guimenuitem>Save</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>S</keycap></keycombo> </shortcut><guimenu>Chat</guimenu><guimenuitem>Speichern</guimenuitem>

source: Saves the content of the chat to a file.
de: Speichert den Inhalt des Chats in einer Datei.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>P</keycap></keycombo> </shortcut> <guimenu>Chat</guimenu> <guimenuitem>Print...</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap></keycap></keycombo> </shortcut><guimenu>Chat</guimenu> <guimenuitem>Drucken ...</guimenuitem>

source: Prints off a hard copy of the chat.
de: Druckt eine Kopie des Chats aus.

source: <guimenu>Chat</guimenu> <guisubmenu>Contacts</guisubmenu>
de: <guimenu>Chat</guimenu><guisubmenu>Kontakte</guisubmenu>

source: This menu lists all the people in the chat. You have access to the same contact menu you get by <mousebutton>right</mousebutton>-clicking a contact's name in the Contact List, allowing you to perform contact specific actions such as sending them a file, viewing their user info or blocking them.
de: Dieses Menü listet alle Personen im Chat auf. Sie finden hier für jeden Kontakt die gleichen Menüeinträge, die auch über die <mousebutton>rechten</mousebutton> Maustaste in der Kontaktliste zur Verfügung stehen. Damit können Sie kontaktspezifische Aktionen wie <quote>Datei senden</quote>, <quote>Benutzerinfo anzeigen</quote> oder einen <quote>Kontakt blockieren</quote> durchführen.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>W</keycap></keycombo> </shortcut> <guimenu>Chat</guimenu> <guimenuitem>Close</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>W</keycap></keycombo> </shortcut><guimenu>Chat</guimenu><guimenuitem>Schließen</guimenuitem>

source: Closes the current chat. If there are chats taking place in other tabs in this window, the window will stay open.
de: Schließt den aktuellen Chat. Falls in anderen Karteikarten des Fensters noch Chats laufen, bleibt das Fenster offen.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo> </shortcut> <guimenu>Chat</guimenu> <guimenuitem>Quit</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo> </shortcut><guimenu>Chat</guimenu> <guimenuitem>Beenden</guimenuitem>

source: Closes all chats taking place in this window.
de: Beendet alle Chats in diesem Fenster.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>X</keycap></keycombo></shortcut> <guimenu>Edit</guimenu> <guimenuitem>Cut</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>X</keycap></keycombo></shortcut> <guimenu>Bearbeiten</guimenu> <guimenuitem>Ausschneiden</guimenuitem>

source: Cutting text works as with most editors: the selected text is removed and put into the clipboard. Note that you can also select text and drag it to a new position.
de: Text ausschneiden funktioniert analog zu einem Textverarbeitungsprogramm. Der ausgewählte Text wird entfernt und in die Zwischenablage gestellt.Sie können außerdem einen Textabschnitt auswählen und mit dem Mauszeiger an eine neue Stelle ziehen.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>C</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Copy</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>C</keycap></keycombo></shortcut> <guimenu>Bearbeiten</guimenu> <guimenuitem>Kopieren</guimenuitem>

source: Copying text works as with most editors: the selected text is copied to the clipboard. Note that you can also select text while holding the &Ctrl; key, and drag it to a new position to copy it.
de: Text kopieren funktioniert analog zu einem Textverarbeitungsprogramm. Der ausgewählte Text wird in die Zwischenablage kopiert. Alternativ können Sie einen Textabschnitt auswählen und bei gedrückter &Ctrl;-Taste mit der Maus an eine neue Stelle ziehen, um ihn zu kopieren.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>V</keycap></keycombo></shortcut> <guimenu>Edit</guimenu> <guimenuitem>Paste</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>V</keycap></keycombo></shortcut> <guimenu>Bearbeiten</guimenu> <guimenuitem>Einfügen</guimenuitem>

source: Pasting works the same as with most editors: the text from the clipboard is pasted at the current cursor position.
de: Text einfügen arbeitet analog zu den meisten Texteditoren: Der Text aus der Zwischenablage wird an der aktuellen Cursor-Position in den Text eingefügt.

source: Format Menu
de: Das Menü Format

source: <guimenu>Format</guimenu> <guisubmenu>Add Smiley</guisubmenu>
de: <guimenu>Format</guimenu><guisubmenu>Smiley hinzufügen</guisubmenu>

source: This menu contains all the smileys/emoticons that the current emoticon scheme includes. You can change the scheme <link linkend="configuring-appearance-emoticons">in the Configure Kopete Dialog</link>.
de: In diesem Menü sind alle Smileys/Emoticons des aktuellen Satzes enthalten. Den Symbolsatz können Sie im <link linkend="configuring-appearance-emoticons">Einrichtungsdialog von Kopete</link> ändern.

source: Tabs Menu
de: Das Menü Unterfenster

source: <guimenu>Tabs</guimenu> <guisubmenu>Tab Placement</guisubmenu>
de: <guimenu>Unterfenster</guimenu><guisubmenu>Platzierung</guisubmenu>

source: This menu allows you to change whether tabs appear at the top or the bottom of the chat view.
de: Hier können Sie festlegen, ob die Unterfenster oberhalb oder unterhalb des Chatfensters erscheinen.

source: <shortcut><keycombo action="simul">&Ctrl;&Shift;<keycap>B</keycap></keycombo> </shortcut> <guimenu>Tabs</guimenu> <guimenuitem>Detach Chat</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;&Shift;<keycap>B</keycap></keycombo> </shortcut><guimenu>Unterfenster</guimenu><guimenuitem>Chat verselbstständigen</guimenuitem>

source: Separates the current chat into its own window.
de: Koppelt den aktuellen Chat in ein eigenes Fenster ab.

source: <guimenu>Tabs</guimenu> <guisubmenu>Move Tab to Window</guisubmenu>
de: <guimenu>Unterfenster</guimenu> <guisubmenu>Verschieben in Fenster</guisubmenu>

source: You can move chats between windows using this menu. Choose the chat window the tab should move to from the menu.
de: Mit diesem Menü können Chats zwischen Fenstern verschoben werden. Wählen Sie das Fenster im Menü, in das der Chat verschoben werden soll.

source: Tools Menu
de: Das Menü Extras

source: This menu contains items added by the plugins you have loaded. See the <link linkend="plugins">plugins chapter</link> for details.
de: Dieses Menü enthält die Einträge, die durch geladene Module hinzugefügt wurden. Genauere Informationen finden Sie im <link linkend="plugins">Kapitel Module</link>.

source: <guimenu>Settings</guimenu> <guisubmenu>Show Participants</guisubmenu>
de: <guimenu>Einstellungen</guimenu> <guisubmenu>Teilnehmer anzeigen</guisubmenu>

source: This menu controls whether the Participants list appears on the right of the Chat View.
de: Hier wird eingestellt, ob die Teilnehmerliste des Chats auf der linken oder rechten Seite angezeigt wird.

source: The chat window has the common &kde; Help menu items, for more information read the section about the <ulink url="help:/fundamentals/ui.html#menus-help">Help Menu</ulink> of the &kde; Fundamentals.
de: Das Chat-Fenster benutzt die bekannten &kde;-Einträge im Menü <guimenu>Hilfe</guimenu>, weitere Informationen dazu finden Sie im Abschnitt über das Menü <ulink url="help:/fundamentals/uihtml#menus-help">Hilfe</ulink> der &kde;-Grundlagen.
