Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdenetwork/kopete.po
Languages: de

source: We introduced you to setting presence <link linkend="go-online">in the previous chapter</link>. 'Presence' determines how visible you are on the &im; network. To use the network at all, you have to connect to the network, so you can send and receive messages and see others' presence. Once you are connected, most &im; systems allow you to indicate what you're doing and whether you want to chat by setting special types of presence such as <emphasis>Away</emphasis> or <emphasis>Free For Chat</emphasis>. The difference presence settings are particular to each away system; but &kopete; allows you some control all your &im; systems at once by setting them to <emphasis>Away</emphasis> or <emphasis>Available</emphasis> at the same time.
de: Im <link linkend="go-online">vorigen Kapitel</link> wurde eine Einführung zum Anwesenheitsstatus gegeben. Die <quote>Anwesenheit</quote> legt fest, inwieweit Sie für andere Benutzer im &im;-Netzwerk sichtbar sind. Dazu müssen Sie natürlich zunächst einmal eine Verbindung herstellen, um Nachrichten empfangen und den Anwesenheitsstatus anderer Benutzer sehen zu können. Anschließend ermöglichen die meisten &im;-Systeme einen speziellen Status wie <emphasis>Abwesend</emphasis> oder <emphasis>Bereit zum Chat</emphasis> anzunehmen. Die unterschiedlichen &im;-Systeme haben jeweils eigene Statuseinstellungen, aber &kopete; ermöglicht das Setzen einiger der gebräuchlichsten Statusmeldungen wie <emphasis>Abwesend</emphasis> oder <emphasis>Verfügbar</emphasis> für alle Dienste gleichzeitig.

source: You set your presence for individual &im; accounts by <mousebutton>right</mousebutton> clicking the account's icon in the <interface>status</interface> bar at the bottom of the <interface>Contact List</interface>. The context menu for each account lets you choose the possible presence settings for each &im; system.
de: Für einzelne &im;-Zugänge setzen Sie den Status über einen Klick mit der <mousebutton>rechten</mousebutton> Maustaste auf das entsprechende Symbol in der <interface>Statusleiste</interface> unten in der <interface>Kontaktliste</interface>. Das Kontextmenü jedes Zugangs enthält die möglichen Statusmeldungen für das jeweilige &im;-System.

source: To change all your accounts' presence together, click the <guibutton>Status</guibutton>, or use the <menuchoice><guimenu>File</guimenu> <guimenuitem>Status</guimenuitem></menuchoice> menu.
de: Um den Status für alle Zugänge gleichzeitig zu ändern, klicken Sie auf den Knopf <guibutton>Status</guibutton> oder verwenden im Menü <menuchoice><guimenu>Datei</guimenu><guimenuitem>Status</guimenuitem></menuchoice>.

source: Start A Chat From The Contact List
de: Das Starten eines Chats aus der Kontaktliste

source: To start a chat from the <interface>Contact List</interface>, simply click a contact. A <link linkend="chat-window">Chat window</link> will appear.
de: Um einen Chat mit einem Eintrag der <interface>Kontaktliste</interface> zu starten, klicken Sie auf den gewünschten Kontakt. Es erscheint ein <link linkend="chat-window">Chatfenster</link>.

source: You can also <mousebutton>right</mousebutton> click a contact and select either <menuchoice><guimenuitem>Send Message</guimenuitem></menuchoice> or <menuchoice><guimenuitem>Start Chat</guimenuitem></menuchoice>. <menuchoice><guimenuitem>Send Message</guimenuitem></menuchoice> works differently in that it just sends a single message without opening the <interface>Chat window</interface>, using a simple dialog. Use it for <quote>fire-and-forget</quote> messages.
de: Alternativ können Sie mit der <mousebutton>rechten</mousebutton> Maustaste auf einen Kontakt klicken und <menuchoice><guimenuitem>Nachricht senden</guimenuitem></menuchoice> oder <menuchoice><guimenuitem>Chat starten</guimenuitem></menuchoice> wählen. Der Unterschied ist, dass <menuchoice><guimenuitem>Nachricht senden</guimenuitem></menuchoice> eine einzige Nachricht an den Empfänger versendet, ohne ein <interface>Chat-Fenster</interface> zu öffnen.

source: Send A File
de: Das Übertragen einer Datei

source: You can send files from the <interface>Contact List</interface>, using the context menu on the person you want to send to. If &kopete; supports file transfer on their &im; system, there will be a <menuchoice><guimenuitem>Send File...</guimenuitem></menuchoice> item. Alternatively, you can drag a file from anywhere else in &kde; onto their name to start a file transfer.
de: Dateien können Sie aus der <interface>Kontaktliste</interface> über das Kontextmenü des Empfängers versenden. Falls &kopete; für dessen &im;-Dienst diese Funktion bereitstellt, findet sich dort ein Eintrag <menuchoice><guimenuitem>Datei senden ...</guimenuitem></menuchoice>. Alternativ können Sie eine Dateiübertragung durch Ziehen einer Datei auf den gewünschten Namen starten.

source: Organizing Contacts
de: Das Verwalten von Kontakten

source: A Word about Metacontacts
de: Einige Hinweise zu Metakontakten

source: One of the principles behind &kopete; is that it offers a standardized way to use &im; systems. Differences between &im; systems are smoothed over, making it easier to communicate. We follow this principle in the way contacts are organized. When you use &kopete; you just find contacts by name; the actual &im; system used is less important. Some people have more than one &im; account - &kopete; puts the person using the account first.
de: Eines der Hauptprinzipien von &kopete; ist, eine einheitliche Oberfläche für unterschiedliche &im;-Dienste zu bieten. Dazu werden die Unterschiede der &im;-Dienste möglichst angeglichen. Das gilt auch für die Kontaktverwaltung. Kontakte sind in &kopete; nach Namen geordnet, der darunterliegende &im;-Dienst spielt eine untergeordnete Rolle. Es gibt viele Personen, die mehrere &im;-Dienste verwenden. Daher ist die Liste nach Namen geordnet.

source: To support this, &kopete; introduced <quote>Metacontacts</quote>, which represent the person you want to chat with. One Metacontact contains all the different &im; IDs they may have, making it easy to see with a glance at the Metacontact 'smiley icon' whether someone is available, regardless of which &im; system they are using right now.
de: &kopete; verwendet hierzu <quote>Metakontakte</quote>, die jeweils eine Person repräsentieren. Ein Metakontakt enthält alle Informationen zu den verschiedenen &im;-Diensten, die von dieser Person benutzt werden. Damit können Sie den Anwesenheitsstatus der Person schnell überprüfen, unabhängig vom gerade verwendeten &im;-Dienst.

source: A Word about Grouping Contacts
de: Hinweise zur Gruppierung von Kontakten

source: &kopete; lets you create groups to sort your contacts. A contact may be in more than one group. Where possible, groupings are saved on server side contact lists, so if you use other &im; programs, group memberships are kept in sync. However, if you change groups in another &im; program, &kopete; cannot know to move a metacontact automatically; it is up to you to resolve this by hand.
de: Mit &kopete; können Sie Kontakte in Gruppen einordnen. Dabei kann ein Kontakt zu mehreren Gruppen gehören. Falls möglich, speichert das Programm die Gruppeninformationen auf dem Server, sodass die Kontakte auch bei Verwendung anderer &im;-Programme aktuell bleiben. Falls Sie allerdings Gruppen in einem anderen &im;-Programm verändern, kann &kopete; das nicht automatisch nachvollziehen. Solche Veränderungen müssen Sie von Hand anpassen.

source: To change the group a metacontact appears in, you can use its context menu to move it or copy it to a new group, or remove it from a group. You can also use drag and drop here - just drop the metacontact on a different group name.
de: Um die Gruppe zu ändern, in der ein Metakontakt erscheint, können Sie das Kontextmenü des Kontakts zum Verschieben, Kopieren oder Löschen benutzen, oder Sie ziehen Sie den Kontakt einfach auf die gewünschte Gruppe.

source: Adding Contacts
de: Das Hinzufügen von Kontakten

source: To add a contact, either select <menuchoice><guimenu>File</guimenu><guimenuitem>Add Contact</guimenuitem></menuchoice> or click the <guibutton>Add</guibutton> button on the toolbar. This brings up the Add Contact Wizard.
de: Um einen Kontakt hinzuzufügen, wählen Sie entweder im Menü <menuchoice><guimenu>Datei</guimenu><guimenuitem>Kontakt hinzufügen ...</guimenuitem></menuchoice> oder klicken auf das Symbol <guibutton>Hinzufügen ...</guibutton> in der Werkzeugleiste. Es erscheint jeweils der Kontaktassistent.

source: The Add Contact Wizard creates a new Metacontact using one or more &im; systems, by leading you through the following pages.
de: Der Kontaktassistent dient zum Anlegen eines neuen Metakontakts unter Verwendung eines oder mehrerer &im;-Systeme:

source: Welcome Page. Here you can choose whether you want to use the &kde; Address Book for this contact. Storing &im; information in the &kde; Address Book will enable other &kde; &im; programs to share contact information with &kopete; and in future &kde; applications may use &kopete; to send information via &im;. If you prefer to keep your &im; contacts separated, clear the check box here.
de: Die Begrüßungsseite. Auf dieser Seite können Sie auswählen, ob Sie das &kde;-Adressbuch zur Speicherung dieses Kontakts verwenden wollen. Die Speicherung des &im;-Kontakts im &kde;-Adressbuch hat den Vorteil, dass andere &kde; &im;-Programme ebenfalls die Kontaktinformationen von &kopete; verwenden können. Zukünftige &kde;-Programme können vielleicht sogar &kopete; verwenden, um Nachrichten über &im;-Dienste zu versenden. Falls Sie die &im;-Kontakte getrennt speichern möchten, entfernen Sie die entsprechende Markierung.

source: Choose &kde; Address Book entry. By choosing an entry from your &kde; Address Book, you can use its name as a Display Name in &kopete;. You can also create a new entry here. This page doesn't show if you chose not to use the &kde; Address Book.
de: Wählen Sie den &kde;-Adressbucheintrag. Durch die Auswahl wird der Name des ausgewählten Eintrags als Anzeigename in &kopete; verwendet. Sie können auch einen neuen Eintrag erstellen. Diese Seite wird nicht angezeigt, wenn Sie das &kde;-Adressbuch nicht zur Speicherung von Kontakten verwenden.

source: Select Display Name and Group. Here you can enter a Display Name (the name used for this person inside &kopete;), and choose the <link linkend="organise-contacts-grouping">groups</link> they are a member of.
de: Anzeigename und Gruppe auswählen. Hier können Sie einen Anzeigenamen (der innerhalb von &kopete; für diese Person verwendete Name) und die <link linkend="organise-contacts-grouping">Gruppen</link> auswählen, zu denen der Kontakt gehören soll.

source: Select &im; Accounts. Here you can choose which accounts you want to use to chat to the new contact. If you only have one &im; account, you won't see this screen.
de: Auswahl des &im;-Zugangs. Hier können Sie auswählen, welche Zugänge Sie für den Chat mit dem neuen Kontakt verwenden wollen. Diese Seite wird nicht angezeigt, falls Sie nur über einen &im;-Zugang verfügen.

source: Account-specific Add Contact Pages. For each account, you'll get one page where you can enter the <acronym>UIN</acronym>, buddy name or Email address, depending on the &im; system in use.
de: Zugangsspezifische Seite zum Hinzufügen von Kontakten. Es erscheint für jeden Zugang eine Seite, auf der abhängig vom verwendeten &im;-Dienst <acronym>UIN</acronym>, Spitzname oder E-Mail-Adresse eingetragen werden muss.

source: Finish Screen. All done. Except if the &im; system requires authorization (such as <trademark>ICQ</trademark>) to add a contact to your list - in which case, you'll be prompted after the wizard exits.
de: Fertigstellungsseite. Diese Seite erscheint als Abschluss. Falls der &im;-Dienst eine Autorisierung erfordert, um einen Kontakt zu Ihrer Kontaktliste hinzuzufügen (<trademark>ICQ</trademark> ist ein Beispiel dafür), erscheint nach Beenden des Assistenten eine Passwortabfrage.

source: You can add contacts to an existing Metacontact using its context menu.
de: Über das Kontextmenü können zu weitere Kontakte zu einem Metakontakt hinzufügen.

source: Renaming Contacts
de: Das Umbenennen von Kontakten

source: You can rename a contact using <menuchoice><guimenu>Edit</guimenu><guimenuitem>Rename Contact</guimenuitem></menuchoice> or with the same item on the metacontact context menu.
de: Über den Menüeintrag <menuchoice><guimenu>Bearbeiten</guimenu><guimenuitem>Kontakt umbenennen</guimenuitem></menuchoice> oder dem gleichnamigen Eintrag im Kontextmenü können Sie einen Kontakt umbenennen.

source: Some &im; systems allow you to set a <quote>Display Name</quote> that is different to your username, such as <quote>Alice loves crypto!</quote>. If you change a contact's name manually, this will override their Display Name. To get it back, open the Properties dialog for that contact and check the <guilabel>Use the name given by the server</guilabel> checkbox.
de: Einige &im;-Systeme erlauben das Setzen eines speziellen <quote>Angezeigten Namens</quote>, der sich vom Benutzernamen unterscheidet, also &eg; <quote>Alice liebt Krypto</quote>. Falls Sie allerdings den Namen des Kontakts manuell ändern, wird der Angezeigte Name überschrieben. Um diesen wiederherzustellen, öffnen Sie den Eigenschaftendialog zum Kontakt und markieren <guilabel>Den vom Server vergebenen Namen verwenden</guilabel>.

source: Removing Contacts
de: Das Entfernen von Kontakten

source: If you no longer want a contact to be in the contact list, you can remove a Metacontact and all the contacts under it with <menuchoice><guimenu>Metacontact context menu</guimenu><guimenuitem>Remove Contact</guimenuitem></menuchoice>.
de: Falls Sie einen Kontakt aus der Kontaktliste entfernen möchten, können Sie dessen Metakontakt mit allen darin befindlichen Kontakten im Kontextmenü mit <guimenuitem>Kontakt entfernen</guimenuitem> löschen.

source: Moving Contacts between Metacontacts
de: Das Verschieben von Kontakten zwischen Metakontakten

source: You can change the metacontact a contact belongs to. In practice, you only have to do this when you have just added multiple accounts to &kopete;, and you know that HotDog76 and mikejones@hotmail.com are both the same person.
de: Sie können einen Kontakt einem anderen Metakontakt zuordnen. In der Praxis kommt das nur dann vor, wenn Sie gerade in &kopete; viele Zugänge hinzugefügt haben und nachher feststellen, dass sich hinter <quote>HotDog76</quote> und <quote>mikejones@hotmail.com</quote> die gleiche Person verbirgt.

source: There are two ways to do this:
de: Sie können dieses auf zwei Arten bewerkstelligen:

source: Drag and Drop
de: Ziehen und Ablegen

source: The contact icon to the right of the metacontact name may be dragged from one metacontact to another.
de: Das Kontaktsymbol rechts vom Namen des Metakontakts kann von einem Metakontakt auf einen anderen gezogen werden.

source: Contact Context Menu
de: Im Kontextmenü des Kontakts

source: The context menu for contacts (<mousebutton>Right</mousebutton>-click the contact icon) allows you to choose the new metacontact from a dialog.
de: Öffnen Sie das Kontextmenü des Kontakts (<mousebutton>rechte</mousebutton> Maustaste auf dem Kontaktsymbol betätigen) und wählen Sie im Dialog den neuen Metakontakt.

source: If the move would leave a Metacontact empty (with no contacts), you'll be asked if you want to delete this contact.
de: Falls durch die Verschiebung ein Metakontakt leer wird (ohne Kontakte), werden Sie gefragt, ob dieser Metakontakt gelöscht werden soll.

source: Removing Contacts from Metacontacts
de: Das Entfernen von Kontakten aus Metakontakten

source: To remove a contact from a Metacontact, choose <menuchoice><guimenu>Contact context menu</guimenu><guimenuitem>Delete Contact...</guimenuitem></menuchoice>.
de: Um einen Kontakt aus einem Metakontakt zu löschen, wählen Sie im Kontextmenü <guimenuitem>Kontakt löschen ...</guimenuitem>.

source: Configure &kopete;
de: Das Einrichten von &kopete;

source: You can configure &kopete; using <menuchoice><guimenu>Settings</guimenu><guimenuitem>Configure...</guimenuitem></menuchoice>. See the <link linkend="configuring">next chapter</link> for details.
de: Sie können &kopete; über den Menüpunkt <menuchoice><guimenu>Einstellungen</guimenu><guimenuitem>Einrichten ...</guimenuitem></menuchoice> konfigurieren. Näheres dazu im Kapitel <link linkend="configuring">Kopete einrichten</link>.

source: Exiting &kopete;
de: Das Beenden von &kopete;

source: To exit &kopete; you should use <menuchoice><guimenu>File</guimenu><guimenuitem>Quit</guimenuitem></menuchoice>, <keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo>, or the &kopete; System Tray icon's context menu. If you just close the <interface>Contact List</interface> window, &kopete; will continue to run in the &kde; System Tray.
de: &kopete; wird durch Auswahl von <menuchoice><guimenu>Datei</guimenu><guimenuitem>Beenden</guimenuitem></menuchoice>, die Tastenkombination <keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo> oder durch Auswahl des entsprechenden Eintrags im Kontextmenü des Kontrollleistensymbols von &kopete; beendet. Falls Sie lediglich das <interface>Kontaktlisten</interface>-Fenster schließen, bleibt &kopete; weiterhin in der Kontrollleiste aktiv.

source: Keyboard shortcuts
de: Tastenkürzel

source: The following keyboard shortcuts are supported in the <interface>Contact List</interface> window:
de: Folgende Tastenkürzel unterstützt &kopete; im <interface>Kontaktlisten</interface>-Fenster:

source: Keyboard Shortcut
de: Tastenzuordnung

source: Action
de: Aktion

source: Up Arrow
de: Pfeil hoch

source: Select the previous item in the contact list.
de: Wählt den vorherigen Eintrag in der Kontaktliste.

source: Down Arrow
de: Pfeil runter

source: Select the next item in the contact list.
de: Wählt den nächsten Eintrag in der Kontaktliste.

source: Left Arrow
de: Pfeil links

source: Close the current group.
de: Schließt die aktuelle Gruppe.

source: Right Arrow
de: Pfeil rechts

source: Open the current group.
de: Öffnet die aktuelle Gruppe.

source: Start a chat with the selected contact.
de: Startet einen Chat mit dem ausgewählten Kontakt.

source: Show/Hide the menu bar.
de: Anzeigen/Ausblenden der Menüleiste.

source: Show/Hide offline users.
de: Anzeigen/Ausblenden von Benutzern, die offline sind.

source: Show/Hide empty groups.
de: Anzeigen/Ausblenden leerer Gruppen.

source: The Chat Window
de: Das Chatfenster

source: Layout of the Chat Window
de: Gestaltung des Chatfensters

source: The Chat View
de: Die Chat-Ansicht

source: The Chat View usually takes up most of the Chat window and is where the conversation between you and your contacts takes place. Messages appear in the order they are received, with the earliest messages at the top of the view.
de: Die Chat-Ansicht nimmt gewöhnlich den größten Teil des Chatfensters ein. In diesem Bereich findet die eigentliche Konversation statt. Die Nachrichten erscheinen in der empfangenen Reihenfolge mit der jüngsten Nachricht oben.

source: You can <link linkend="configuring-appearance">control</link> the appearance of the <interface>Chat View</interface>, making it look like other &im; clients or create a completely individual look.
de: Sie können das Erscheinungsbild der <interface>Chat-Ansicht</interface> <link linkend="configuring-appearance">verändern</link>, um es anderen &im;-Programmen anzupassen oder ganz individuell zu gestalten.

source: Chat Members List
de: Chat-Mitgliederliste

source: Since some &im; systems allow you to chat as a group, it is useful to see who is chatting at the moment. The Chat Members List appears to the left or the right of the Chat View. You can change this using <menuchoice><guimenu>Settings</guimenu><guisubmenu>Chat Members List</guisubmenu></menuchoice>. The contact context menu is available in the Chat Members List.
de: Da einige &im;-Dienste Gruppen-Chats unterstützen, ist es nützlich zu sehen, wer gerade am Chat teilnimmt. Die Chat-Mitgliederliste erscheint links oder rechts der Chat-Ansicht. Das kann über <menuchoice><guimenu>Einstellungen</guimenu><guisubmenu>Teilnehmer anzeigen</guisubmenu></menuchoice> geändert werden. In der Chat-Mitgliederliste ist auch das Kontaktkontextmenü verfügbar.

source: Input Area
de: Eingabebereich

source: The Input Area is below the Chat View. This is where you type messages before sending them. You can change the font and color of the message using the usual tools on the toolbar. If the &im; system supports this, your messages will appear in color when your contacts read them.
de: Der Eingabebereich befindet sich unterhalb der Chat-Ansicht. In diesen Bereich werden eigene Nachrichten eingetippt. Sie können sowohl die Schriftart als auch die Farbe für die Nachricht mithilfe der Werkzeugleiste ändern. Ob die Nachricht bei den Gesprächspartnern auch in dieser Formatierung angezeigt wird, hängt von den Fähigkeiten des verwendeten &im;-Dienstes ab.

source: By default, the keyboard shortcut to send messages is &Enter;.
de: Das voreingestellte Tastaturkürzel zum Senden ist &Enter;.

source: Status Bar
de: Statusleiste

source: The Status Bar contains temporary messages, such as notification that someone else is typing, as well as the <guibutton>Send</guibutton> button.
de: Die Statusleiste enthält neben temporären Meldungen, wie &eg; dass jemand gerade eine Nachricht eintippt, den Knopf <guibutton>Senden</guibutton>.

source: Tabbing
de: Unterfenster

source: &kopete; lets you carry on multiple conversations in one window, by putting each one in its own tab within the window. The tab titles change color to show when a new message has been received:
de: &kopete; kann mehrere Konversationen in einem einzigen Fenster darstellen, indem jede ein eigene Unterfenster in diesem Fenster erhält. Trifft eine neue Nachricht ein, ändert der Titel des Unterfensters seine Farbe:

source: <term>Red</term>
de: <term>rot</term>

source: Someone typed a message.
de: Jemand hat eine Nachricht geschrieben.

source: Green
de: grün

source: Someone is typing a message.
de: Jemand schreibt gerade eine Nachricht.

source: Blue
de: blau

source: Someone typed a message containing your nickname.
de: Jemand hat eine Nachricht geschrieben, die ihren Spitznamen enthält.

source: There are several different ways to control grouping. To configure this behavior, go to the Chat tab of the Behavior page of the Configure &kopete; dialog. You can also move chats between windows using the <menuchoice><guimenu>Tabs</guimenu></menuchoice> menu, and control the placement of the tabs in the window.
de: Die Gruppierung von Chats kann auf mehrere Arten erfolgen. Die Gruppierung wird im Dialog <quote>&kopete; einrichten ...</quote> unter Verhalten auf der Karteikarte Chat eingestellt. Mithilfe des Menüs <menuchoice><guimenu>Unterfenster</guimenu></menuchoice> können Konversationen zwischen verschiedenen Fenstern verschoben und die Platzierung der Unterfenster im Chatfenster geändert werden.

source: Group Chats in &kopete;
de: Gruppen-Chats in &kopete;

source: You can use &kopete; to chat one to one, or in a group, where the &im; system supports this.
de: &kopete; kann entweder für Chats zu zweit oder mehreren Personen verwendet werden. Nicht jeder &im;-Dienst unterstützt allerdings Gruppen-Chats.

source: To invite others into a chat, drag them from the Contact List into the chat window, or use <menuchoice><guimenu>Chat</guimenu><guisubmenu>Invite</guisubmenu><guimenuitem>&lt;contact name&gt;</guimenuitem></menuchoice>.
de: Um andere Personen zum Chat einladen, ziehen Sie den Kontakt aus der Kontaktliste in das Chatfenster oder wählen Sie im Menü <menuchoice><guimenu>Chat</guimenu><guisubmenu>Einladen</guisubmenu><guimenuitem>&lt;Kontaktname&gt;</guimenuitem></menuchoice>.
