Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdenetwork/kopete_chatstyle.po
Languages: de

source: &kopete; Chat Window Style Guide
de: Stilrichtlinie für das Chatfenster von &kopete;

source: &kopete; Chat Window Style reference.
de: Stilreferenz für das Chatfenster von &kopete;

source: Beginning with &kopete; 0.12, we are now using <ulink url="http://www.adiumx.com/">Adium</ulink> format for our Chat Window style. The theme format is based on <acronym>HTML</acronym> templates and <acronym>CSS</acronym>. They are easier to make and develop, only a knowledge of <acronym>HTML</acronym> and <acronym>CSS</acronym> is needed. Also, styles can have variants (defined as <acronym>CSS</acronym> file) which add more customization value :).
de: Ab Version 0.12 verwendet &kopete; das <ulink url="http://www.adiumx.com/">Adium</ulink>-Format für den Stil des Chatfensters. Das Designformat basiert auf <acronym>HTML</acronym>-Vorlagen und <acronym>CSS</acronym>. Damit sind Design einfacher zu erstellen und weiterzuentwickeln, nur Kenntnisse von <acronym>HTML</acronym> und <acronym>CSS</acronym> sind erforderlich. Damit sind außerden auch Varianten für Stile möglich, sie werden als <acronym>CSS</acronym>-Dateien definiert und erlauben eine leichtere Anpassung.

source: Reference guide.
de: Stilreferenz

source: Adium format consist of a directory structure, <acronym>HTML</acronym> templates, <acronym>CSS</acronym> files and keywords that are replaced each time the template is processed. The final conversation is a <acronym>XHTML</acronym> page where messages are added with <acronym>DOM</acronym> operations. The central element is a div element named <filename>Chat</filename>. Before and after this div element goes the Header and Footer template. Messages are children of the <filename>Chat</filename> div element.
de: Das Adium-Format besteht aus einer Ordnerstruktur, <acronym>HTML</acronym>-Vorlagen, <acronym>CSS</acronym>-Dateien und Schlüsselwörten, die bei der Verarbeitung der Vorlagen durch Werte ersetzt werden. Das endgültige Ergebnis ist eine <acronym>XHTML</acronym>-Datei, in der die Nachrichten mit <acronym>DOM</acronym>-Operationen eingefügt werden. Der wichtigste Bestandteil ist ein div-Element namens <filename>Chat</filename>. Vor und nach diesem Element werden Vorlagen für die Kopf- und Fusszeilen eingefügt. Nachrichten sind untergeordnete Teile des div-Elements.

source: Directory Structure
de: Ordnerstruktur

source: A style must respect this directory structure. Code in &kopete; are thinking around this directory structure. When archiving the style, archive the <filename>styleName</filename> directory. The directory structure is a structure of a <application>Mac OS X</application> bundle for those familiar with that operating system. Also you must respect the case displayed here, because a <acronym>UNIX</acronym> system is case-sensitive.
de: Ein Stil muss diese Ordnerstruktur einhalten, das wird von &kopete; vorausgesetzt. Ein Stil muss im Ordner <filename>styleName</filename> gespeichert werden. Die Ordnerstruktur entspricht einem Anwendungsverzeichnis (Bundle) in <application>Mac OS X</application>. Da in einem <acronym>UNIX</acronym>-System zwischen Groß- und Kleinschreibung unterschieden wird, das ist hier zu beachten.

source: styleName\ (can have .adiumMessageStyle as suffix, because in Mac OS X it is a bundle) Contents\ Info.plist Resources\ main.css Header.html Footer.html Status.html Incoming\ (and Outgoing\) Content.html NextContent.html (for consecutive messages) Context.html (for message history) NextContext.html Action.html Variants\ *.css
de: styleName\ (.adiumMessageStyle darf angehängt werden, das es in Mac OS X ein Anwendungsverzeichnis / Bundle ist) Contents\ Info.plist Resources\ main.css Header.html Footer.html Status.html Incoming\ (and Outgoing\) Content.html NextContent.html (für aufeinanderfolgende Nachrichten) Context.html (for message history) NextContext.html Action.html Variants\ *.css

source: About &lt;div id="insert"&gt;&lt;/div&gt;
de: Über &lt;div id=<quote>insert</quote>&gt;&lt;/div&gt;

source: This is a special div element used internally. It is a placeholder to indicate where to insert the next message. If it is a new message, it is removed and the new message take place. But if it is a consecutive message, the div element is replaced with the content of new message. This special div element is <emphasis>required</emphasis> in Content,Context,NextContent,NextContext templates. Though it not harm to put it also in Action and Status template.
de: Die ist ein besonderes intern verwendetes div-Element. Es dient als Platzhalter, um anzuzeigen, wo die nächste Nachricht eingefügt wird. Bei einer neuen Nachricht wird dies Element entfernt und durch die neue Nachricht ersetzt. Bei einer aufeinanderfolgenden Nachricht wird das div-Element durch den Inhalt der neuen Nachricht ersetzt. Dieses besondere div-Element <emphasis>muss</emphasis> in Content-, Context-, NextContent- und NextContext-Vorlagen enthalten sein, es sollte auch in Action- und Status-Vorlagen eingefügt werden.

source: HTML templates.
de: HTML-Vorlagen.

source: Template description.
de: Beschreibung der Vorlagen.

source: <filename>Header.html</filename> (Required)
de: <filename>Header.html</filename> (erforderlich)

source: Use the Header template to display a nice header to the conversation. This template is inserted before <filename>Chat</filename> div element. If you don't use it, just put an empty file.
de: Wird zur Anzeige einer Kopfzeile für die Unterhaltung verwendet. Diese Vorlage wird vor dem div-Element <filename>Chat</filename> eingefügt und kann bei Bedarf auch durch eine leere Datei ersetzt werden.

source: <filename>Footer.html</filename> (Required)
de: <filename>Footer.html</filename> (erforderlich)

source: This is mostly the same as Header but it is for the footer of a conversation. This template is inserted after <filename>Chat</filename> div element. If you don't use it, just put an empty file.
de: Wird zur Anzeige einer Fusszeile für die Unterhaltung verwendet. Diese Vorlage wird nach dem div-Element <filename>Chat</filename> eingefügt und kann bei Bedarf auch durch eine leere Datei ersetzt werden.

source: <filename>Status.html</filename> (Required)
de: <filename>Status.html</filename> (erforderlich)

source: This template is used to display an internal message. Internal messages such as status change, message from Kopete (&eg; Incoming File Transfer). When the style do not supply an Action template, it is used to display Action message.
de: Diese Vorlage wird zur Anzeige einer internen Nachricht verwendet, wie zum Beispiel eine Statusänderung oder eine Nachricht von Kopete &eg; eingehende Dateiübertragung. Wenn der Stil keine Action-Vorlage enthält, wird diese Vorlage auch für Action-Meldungen verwendet.

source: <filename>Outgoing/Content.html</filename> (Required)
de: <filename>Outgoing/Content.html</filename> (erforderlich)

source: The content template is the message core. Think it as a block that will hold messages. Make sure it is ready to receive consecutive messages, don't design it to only display one message. Consecutive messages will be inserted at the div insert element.
de: Die Content-Vorlagen beinhalten die eigentliche Nachricht. Diese Vorlagen müssen fortlaufende Nachrichten aufnehmen können und nicht nur zur Anzeige einer einzelnen Nachricht entworfen worden sein. Aufeinanderfolgende Nachrichten werden am div-Element eingefügt.

source: <filename>Outgoing/NextContent.html</filename> (Required)
de: <filename>Outgoing/NextContent.html</filename> (erforderlich)

source: The NextContent template is a message fragment for consecutive messages. It will be inserted into the main message block. The HTML template should contain the bare minimum to display a message.
de: Die Vorlage NextContent ist ein Nachrichten-Fragment für fortlaufende Nachrichten und wird in den Hauptblock für die Nachrichten eingefügt. Diese HTML-Vorlage sollte nur das enthalten, was für die Anzeige nötig ist.

source: <filename>Outgoing/Action.html</filename> (Optional) (&kopete; Extension)
de: <filename>Outgoing/Action.html</filename> (wahlweise) (Erweiterung von &kopete;)

source: This template is a &kopete; extension to the Adium format. It is available for Incoming and Outgoing direction. Action messages are special message to tell we are doing an action. Example: "/me is installing &kopete;" would be displayed as "DarkShock is installing &kopete;".
de: Diese Vorlage ist eine Erweiterung von &kopete; für das Adium-Format. Diese Vorlage ist für die ein- und ausgehende Richtung verfügbar. Action-Nachrichten werden verwendet, um über Aktionen des Benutzers zu informieren. Beispiel: „/me installiert &kopete;“ wird als „DarkShock installiert &kopete;“ angezeigt.

source: <filename>Outgoing/NextContext.html</filename> (Optional)
de: <filename>Outgoing/NextContext.html</filename> (wahlweise)

source: These templates are not used in Kopete. In Adium, they are used to display history. It is mostly the same thing as Content and NextContent but with some differences to distinguish from normal messages.
de: Diese Vorlagen werden in Kopete nicht verwendet. In Adium wird damit der Verlauf angezeigt. Diese Vorlagen unterscheiden sich nur geringfügig von den Vorlagen für Content und NextContent.

source: About CSS styles and Variants
de: Über CSS-Stile und Varianten

source: HTML template are used to describe how the structure is made. But all the style is described in <acronym>CSS</acronym> files. <filename>main.css</filename> is the main style, where variants are just alterations of the main style. Examples of variants are different colors, no display of user photo. Both <filename>main.css</filename> and variants and imported in final <acronym>XHTML</acronym> page.
de: HTML-Vorlagen werden zur Beschreibung einer Struktur verwendet, der Stil selbst wird in <acronym>CSS</acronym>-Dateien beschrieben. Der Hauptstil ist <filename>main.css</filename>, Varianten werden davon abgeleitet. Beispiele für Varianten sind geänderte Farben oder keine Anzeige eines Benutzerfotos. <filename>main.css</filename> und die Varianten werden in die endgültige <acronym>XHTML</acronym>-Datei eingebunden.

source: This is the main <acronym>CSS</acronym> file which is common for all variants. This file should contain all the main description of the style.
de: Dies ist die Haupt-<acronym>CSS</acronym>-Datei, die in allen Varianten benutzt wird. Diese Datei sollte alle wichtigen Beschreibungen für Ihren Stil enthalten.

source: Variants are <acronym>CSS</acronym> files located in <filename>Variants/</filename> directory. Each variant is a single <acronym>CSS</acronym> file that include the <filename>main.css</filename> and do alteration to the main style.
de: Varianten sind <acronym>CSS</acronym>-Dateien im Ordner <filename>Variants/</filename>. Jede Variante ist eine einzelne <acronym>CSS</acronym>-Datei, die die Datei <filename>main.css</filename> enthalten und den Hauptstil verändern.

source: Debugging styles
de: Fehlersuche in Stilen

source: Here is two tips for testing a style while creating it.
de: Zwei Tipps zur Fehlersuche für Stile, die Sie neu erstellen:

source: -Save a sample conversation.
de: - Speichern Sie eine Unterhaltung.

source: In Chat Window, you can <action>save</action> a conversation. This is a copy of the internal XHTML page displayed. Use it in <application>Konqueror</application> to test your <acronym>CSS</acronym> files.
de: Im Chatfenster können Sie eine Unterhaltung <action>speichern</action>. Das ist eine Kopie der angezeigten XHTML-Seite. Benutzen Sie diese Seite, um Ihre <acronym>CSS</acronym>-Dateien in <application>Konqueror</application> zu überprüfen.

source: -Disable style cache.
de: - Deaktivieren Sie den Zwischenspeicher für Stile.

source: A little configuration switch exist to disable the style cache. When enabled, it reload the HTML templates each time the style is asked. Add the following lines to your <filename>kopeterc</filename>. Very useful when testing a style in &kopete;
de: Zur Abschaltung des Zwischenspeicher für Stile gibt es einen Einstellungsparameter. Ist der Zwischenspeicher abgeschaltet, wird bei jeder Anforderung die HTML-Vorlage neu eingelesen, das ist erleichtert das Testen eines Stiles in &kopete;. Fügen Sie folgende Zeilen in die Datei <filename>kopeterc</filename> ein:

source: Keywords reference
de: Referenz der Schlüsselworte

source: Keywords are likes holes to fill with details. On each new message, they are replaced with the correct value corresponding to their context. To fully support all features of Kopete, we added some keywords extensions to the Adium. Also some keywords are only available in certain context.
de: Schlüsselworte sind Platzhalter, die in jeder neuen Nachricht durch einen Wert passend zum Kontext ersetzt werden. Um alle Fähigkeiten von Kopete zu unterstützen, ist das Adium-Format um einige Schlüsselworte erweitert worden. Außerdem sind einige Schlüsselworte nur in bestimmten Kontexten zulässig.

source: Keywords list for Header and Footer templates.
de: Schlüsselwortliste für Header- und Footer-Vorlagen.

source: There keywords are processed at the beginning of the chat.
de: Diese Schlüsselworte werden am Beginn des Chats verarbeitet.

source: This is the name of the current chat session. For a typical session, it display the name of the contact and his status. For <acronym>IRC</acronym>, it display the topic of a channel.
de: Dies ist der Name der aktuellen Chat-Sitzung. Üblicherweise wird der Name des Kontakts und sein Status hier angezeigt. Im <acronym>IRC</acronym> ist dies das Thema des Kanals.

source: These are the name of the contacts for a chatsession. <filename>%sourceName%</filename> is your name. <filename>%destinationName%</filename> is the name of the contact you are chatting with. Prefer <filename>%chatName%</filename> over those, because they could be confusing for groupchat and IRC.
de: Zeigt den Namen des Kontakts in einer Chat-Sitzung an. <filename>%sourceName%</filename> wird durch Ihren Namen ersetzt, <filename>%destinationName%</filename> durch den Namen des Chat-Partners. Verwenden Sie besser <filename>%chatName%</filename> anstatt <filename>%sourceName%</filename> oder <filename>%destinationName%</filename>, das ist in einem Chat mit mehreren Personen oder im IRC eindeutig.

source: These are the image/photo/avatar of the contacts for a chatsession. Incoming represent the contact photo and Outgoing represent your own photo. If they are no photo available, it use <filename>buddy_icon.png</filename> image which is located in <filename>Incoming</filename> or <filename>Outgoing</filename> directory.
de: Das Bild, Foto oder der Atavar für den Kontakt einer Chatsitzung. Für die eingehende Richtung ist dies das Foto des Kontakts und für die ausgehende Richtung Ihr eigenes Foto. Sind diese Fotos nicht vorhanden, wird je nach Richtung der Nachricht das Bild aus der Datei <filename>buddy_icon.png</filename> im Ordner <filename>Incoming</filename> oder <filename>Outgoing</filename> benutzt.

source: It is the time when the chat session begin. <filename>%timeOpened%</filename> use the default time format for the current locale. If you want to use a specific time format, use <filename>%timeOpened{X}%</filename> where X is a string containing the time format. The time parameters are the same as the glibc function <function>strftime</function>. Do <command>man strftime</command> to get the list of available parameters.
de: Zeit und Datum, an dem die Chatsitzung begonnen hat, dabei wird in <filename>%timeOpened%</filename> das lokal eingestellte Datumsformat verwendet. Ein abweichendes Format kann mit <filename>%timeOpened{X}%</filename> mit X als Zeichenkette für das Datumsformat eingestellt. Es werden die gleichen Parameter wie in der glibc-Funktion <function>strftime</function> verwendet. Mit <command>man strftime</command> auf der Konsole wird eine Liste aller verfügbaren Parameter angezeigt.

source: Keywords list for Content, NextContent, Context, NextContext, Action template
de: Schlüsselwortliste für Content-, NextContent-, Context-, NextContext- und Action-Vorlagen.

source: There keywords are processed for each message.
de: Diese Schlüsselworte werden für jede Nachricht verarbeitet.

source: This is the image/photo/avatar of the contact associated with the message. If they are no photo available, it use <filename>buddy_icon.png</filename> image which is located in <filename>Incoming</filename> and <filename>Outgoing</filename> directory depending of the message direction.
de: Das Bild, Foto oder der Atavar für den Kontakt der Nachricht. Ist diese Foto nicht vorhanden, wird je nach Richtung der Nachricht das Bild aus der Datei <filename>buddy_icon.png</filename> im Ordner <filename>Incoming</filename> oder <filename>Outgoing</filename> benutzt.

source: This is the contact ID of the contact associated with the message. Examples: me@hotmail.com, 45566576, JohnSmith.
de: Dies ist die ID des Kontaktes der Nachricht, zum Beispiel ich@hotmail.com, 45566576, MaxMustermann.

source: This is the name of the contact associated with the message. It use MetaContact display name as a source.
de: Dies ist die Name des Kontaktes der Nachricht und wird aus dem Anzeigenamen des Metakontakts gelesen.

source: Display the name of the service associated with the message. Examples: Jabber, Yahoo, MSN.
de: Zeigt den Namen des Dienstes der Nachricht an, zum Beispiel Jabber, Yahoo oder MSN.

source: In &kopete;, this keyword is used to represent the highlight background color. Ignore parameter in the braces and only use it as <filename>%textbackgroundcolor{}</filename>.
de: In &kopete; wird dieses Schlüsselwort für die Hintergrundfarbe von Hervorhebungen benutzt. Verwenden Sie keine Parameter innerhalb der Klammern, verwenden Sie nur die Form <filename>%textbackgroundcolor{}</filename>.

source: <filename>%senderStatusIcon%</filename> (&kopete; extension)
de: <filename>%senderStatusIcon%</filename> (&kopete;-Erweiterung)

source: Display the status icon of the contact associated with the message. It's a file path.
de: Zeigt das Statussymbol des Kontakts der Nachricht. Dieser Wert enthält den Pfad zu einer Datei.

source: <filename>%senderColor{N}%</filename> (&kopete; extension)
de: <filename>%senderColor{N}%</filename> (&kopete;-Erweiterung)

source: Generate a color from the sender contact id. Can be used to display a different color for contact nickname.
de: Erstellt eine Farbe aus der Kontakt-ID des Senders. Damit können unterschiedliche Farben für die Anzeige der Spitznamen der Kontakte benutzt werden.

source: <filename>%senderColor{N}%</filename> where N is a positive number. If N is greater than 100, it represent a lighter color than the contact's color. If N equal 150 it is a color which is 50% brighter. If N is less than 100 then it is a darker color. Useful for having a background colored differently for each contact.
de: In <filename>%senderColor{N}%</filename> ist N eine positive ganze Zahl. Ist N größer 100, wird die Farbe für den Kontakt aufgehellt, mit N= 150 um 50 %. Werte von N kleiner 100 dunkeln die Farbe ab. Damit können die Hintergrundfarben für jeden Kontakt unterschiedlich eingestellt werden.

source: If you want to use theses colors in a variant, but not in the main style, you have to workaround. <programlisting> <![CDATA[ <div style="color:%senderColor%;border:none;border-color:%senderColor{40}%;"><p class="message">...</p></div> ]]> </programlisting> you can apply color to the p.message element in your <filename>main.css</filename> file, and in your variant put something like
de: Sollen diese Farben nur in einer Variante, aber nicht im Hauptstil verwendet werden, gibt es folgende Lösung für diese Problem: <programlisting> <![CDATA[ <div style="color:%senderColor%;border:none;border-color:%senderColor{40}%;"><p class="message">...</p></div> ]]> </programlisting> Geben Sie Farben für das Element p.message in der Datei <filename>main.css</filename> an und in der Variante stellen Sie folgendes ein:

source: Keyword list common for messages and Status.html
de: Schlüsselwortliste für Nachrichten und Status.html

source: The message itself. This is a HTML fragment.
de: Die eigentliche Nachricht, ein HTML-Fragment.

source: The time when the message was received. <filename>%time%</filename> use the default time format for the current locale. If you want to use a specific time format, use <filename>%time{X}%</filename> where X is a string containing the time format. The time parameters are the same as the glibc function <function>strftime</function>. Do <command>man strftime</command> to get the list of available parameters.
de: Zeit und Datum, an dem die Nachricht empfangen wurde, dabei wird in <filename>%time%</filename> das lokal eingestellte Datumsformat verwendet. Ein abweichendes Format kann mit <filename>%time{X}%</filename> mit X als Zeichenkette für das Datumsformat eingestellt werden. Es werden die gleichen Parameter wie in der glibc-Funktion <function>strftime</function> verwendet. Mit <command>man strftime</command> auf der Konsole wird eine Liste aller verfügbaren Parameter angezeigt.

source: <filename>%messageDirection%</filename> (&kopete; Extension)
de: <filename>%messageDirection%</filename> (&kopete;-Erweiterung)

source: Represent the message direction, if the message must be displayed right-to-left or left-to-right. The values are either "rtl" or "ltr". Read <link linkend="chatstyle-guideline-direction">Message Direction guideline</link> to see how to use this keyword properly.
de: Bestimmt die Schreibrichtung der Nachricht. Zulässige Werte sind entweder „rtl“ oder „ltr“. Weitere Informationen zu richtigen Anwendung dieses Schlüsselwortes finden Sie im Abschnitt <link linkend="chatstyle-guideline-direction">Schreibrichtung</link>.

source: &kopete; Chat Window Style Guideline
de: Stilrichtlinie für das Chatfenster von &kopete;

source: The &kopete; Chat Window Style Guideline is a set of things that your Chat Window style must support to be compliant with Kopete.
de: Die Stilrichtlinien für das Chatfenster von &kopete; ist ein Satz von Regeln, die Ihr Chatfensterstil einhalten muss, um kompatibel zu Kopete sein.

source: Support highlight
de: Unterstützung für Hervorhebungen

source: Your style must show highlight. In Kopete and Adium, the <filename>%textbackgroundcolor{}%</filename> is replaced with the highlight color. Add this style attribute: <userinput>background-color: %textbackgroundcolor{}%</userinput> to the HTML element that display the message.
de: Ihr Stil muss Hervorhebungen anzeigen. In Kopete und Adium wird <filename>%textbackgroundcolor{}%</filename> durch die Farbe für Hervorhebungen ersetzt. Fügen Sie das Stilattribut <userinput>background-color: %textbackgroundcolor{}%</userinput> zum HTML-Element hinzu, das die Meldungen anzeigt.

source: Consecutive message templates are required.
de: Vorlagen für aufeinanderfolgende Nachrichten sind erforderlich.

source: This guideline is for people rewriting old XSL styles to the new format. All styles must supply a template for consecutive messages. It is now a default feature.
de: Dies ist ein Hinweis für das Überarbeiten von alten XSL-Stilen in das neue Format. Alle Stile müssen eine Vorlage für aufeinanderfolgende Nachrichten enthalten, dies ist jetzt die Standardeinstellung.

source: Use <acronym>UTF-8</acronym> encoding.
de: <acronym>UTF-8</acronym>-Kodierung verwenden.

source: The title said it all. You must save your files to <acronym>UTF-8</acronym>.
de: Ihre Dateien müssen in der Kodierung <acronym>UTF-8</acronym> gespeichert werden.

source: Supply <filename>Contents/Info.plist</filename> for interopability with Adium
de: Verwenden Sie <filename>Contents/Info.plist</filename> für die Kompatibilität mit Adium
