Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdenetwork/kopete.po
Languages: de

source: The <guilabel>OTR</guilabel> plugin allows you to encrypt conversations using the Off-The-Record encryption method. This encryption method basically works like the PGP encryption but it is optimized for instant messaging and handles the key exchange on its own. The only thing you have to do, is to make sure that you really are writing to the person you expect by using one of OTR's authentication mechanisms.
de: Mit dem Modul <guilabel>OTR</guilabel> können Konversationen mit dem Off-The-Record-Verfahren verschlüsselt werden. Das Verfahren funktioniert im Prinzip wie die PGP-Verschlüsselung, ist aber für Instant-Messaging optimiert und führt den Austausch der Schlüssel selbst durch. Es muss durch die OTR-Authentifizierung nur sichergestellt werden, dass der Kontakt wirklich die behauptete Identität besitzt.

source: Menu items
de: Menüeinträge

source: <guimenu>Edit</guimenu> <guimenuitem>OTR Policy</guimenuitem>
de: <guimenu>Bearbeiten</guimenu><guimenuitem>OTR-Regelung</guimenuitem>

source: (Enabled when a contact is selected) You can set the encryption policy for each contact here. Setting this entry to "Default" causes &kopete; to use the default setting in the configure dialog
de: Dieser Menüeintrag ist nur aktiviert, wenn ein Kontakt ausgewählt ist. Hier kann für jeden Kontakt eine eigene Verschlüsselungsregelung eingestellt werden. Mit der Auswahl von „Standard“ wird die Standardeinstellungen aus dem Einrichtungsdialog verwendet.

source: <guimenu>Tools</guimenu> <guimenuitem>OTR Settings</guimenuitem> <guimenuitem>Start OTR session</guimenuitem>
de: <guimenu>Extras</guimenu><guimenuitem>OTR-Einstellungen</guimenuitem><guimenuitem>OTR-Sitzung starten</guimenuitem>

source: This lets you initiate an OTR encrypted session.
de: Startet eine OTR-verschlüsselte Sitzung.

source: <guimenu>Tools</guimenu> <guimenuitem>OTR Settings</guimenuitem> <guimenuitem>End OTR session</guimenuitem>
de: <guimenu>Extras</guimenu><guimenuitem>OTR-Einstellungen</guimenuitem><guimenuitem>OTR-Sitzung beenden</guimenuitem>

source: This lets you end a previously established OTR session.
de: Beendet eine bestehende OTR-verschlüsselte Sitzung.

source: <guimenu>Tools</guimenu> <guimenuitem>OTR Settings</guimenuitem> <guimenuitem>Authenticate contact</guimenuitem>
de: <guimenu>Extras</guimenu><guimenuitem>OTR-Einstellungen</guimenuitem><guimenuitem>Kontakt authentifizieren</guimenuitem>

source: Use this menu entry if you wish to authenticate the contact.
de: Mit diesem Menüeintrag kann ein Kontakt authentifiziert werden.

source: The settings dialog
de: Der Einrichtungsdialog

source: In the setting dialog you have various options to set the modules behaviour during your chatsessions. The most important of them is the default policy configuration. Set the policy to "Opportunistic" if you wish &kopete; to check if you contacts support OTR and establish an encrypted session on its own or to "Manual" if you wish to control each encryption state on your own. The options "Always" and "Never" are recommended only for experienced users that wish to set the policy on a per-contact base. In the "Private Keys" Pane you have the possibility to create you personal keypair for each account. You don't need to do this manually. If an account does not have a keypair it will be generated automatically the first time it is required. In the "Known Fingerprints" tab you have the possibility to see, verify and delete known public fingerprints of your contacts.
de: In diesem Dialog gibt es Einstellungen für das Verhalten des Moduls in Chatsitzungen. Das Wichtigste ist die Einstellung der Standardregelung. Wählen Sie dafür „Opportunistisch“, dann wird überprüft, ob der Kontakt OTR unterstützt und die Sitzung automatisch verschlüsselt. Mit „Manuell“ können Sie den Verschlüsselungsstaus selbst einstellen. Nur erfahrene Benutzer, die die Regelung für jeden Kontakt einzeln einstellen möchten, sollten „Immer“ oder „Nie“ wählen. Auf der Seite „Private Schlüssel“ kann ein persönliches Schlüsselpaar für jeden Zugang erzeugt werden. Dies muss aber nicht manuell durchgeführt werden. Wenn es für einen Zugang noch kein Schlüsselpaar gibt, wird es automatisch beim ersten Mal generiert. Auf der Karteikarte „Bekannte Fingerabdrücke“ können bekannte öffentliche Fingerabdrücke angezeigt, überprüft und gelöscht werden.

source: Authentication
de: Authentifizierung

source: You've probably received email from people pretending to be banks, credit agencies, even wealthy Nigerian expatriates. People lie about who they are all the time on the Internet. Authentication is a way to make sure that nobody can lie to you about who they are when they use OTR.
de: Sie haben sicher schon E-Mails von Personen erhalten, die vorgeben Mitarbeiter einer Bank oder eines Kreditinstituts zu sein. Diese Personen geben Ihnen eine falsche Identität an. Mit einer Authentifizierung durch mit dem Modul OTR können Sie die Identität eines Kontakts überprüfen.

source: <title>When to authenticate</title>
de: <title>Wann sollte authentifiziert werden?</title>

source: You should authenticate a buddy the very first time that you talk to them using OTR. If you don't, then you cannot really be sure that someone else isn't impersonating them or trying to listen in on your conversation. However, once you've authenticated your buddy once, you don't have to do it again. OTR will automatically do the authentication for all of your future conversations with that buddy.
de: Einen Kontakt sollten Sie beim ersten Chat mit OTR authentifizieren. Wenn Sie das erst später nachholen, können Sie nicht sicher sein, ob es sich wirklich um den Kontakt handelt oder ob jemand Ihre Konversation abhört. Wenn der Kontakt erst einmal authentifiziert ist, kann OTR in Zukunft den Chat mit dem Kontakt automatisch authentifizieren.

source: The only exceptions occur when your buddy switches between multiple computers or multiple &im; accounts. In this case, you will need to authenticate once for each computer and account. Once you've done this, your buddy can freely use any of the computers you've authenticated them on, and OTR will recognize them automatically. If your buddy uses a new computer or account that OTR does not recognize, a message will pop up in your conversation window telling you about it.
de: Wenn Ihr Kontakt mehrere Rechner oder mehrere &im;-Zugänge benutzt, dann muss die Authentifizierung für jeden Rechner und jeden Zugang durchgeführt werden. Danach kann Ihr Kontakt einen beliebigen authentifizierten Rechner oder Zugang benutzen, das wird automatisch von OTR erkannt. Benutzt Ihr Kontakt einen neuen Rechner oder Zugang, der OTR noch nicht bekannt ist, werden Sie durch eine Meldung im Chatfenster darüber informiert.

source: <phrase>When to authenticate</phrase>
de: <phrase>Wann sollte authentifiziert werden?</phrase>

source: How to authenticate
de: Wie wird authentifiziert?

source: To authenticate someone, open a conversation with them and click on "Authenticate Contact" on the OTR button. A wizard will be shown, asking you what authentication method you would like to use. Please follow the steps in this wizard.
de: Öffnen Sie dazu eine Konversation mit einem Kontakt und klicken dann auf den Knopf „Kontakt authentifizieren“. Damit öffnen Sie einen Assistenten, wählen ein Authentifizierungsverfahren und folgen den weiteren Anleitungen im Assistenten.

source: If the authentication was successful, then you know that you are really talking to your friend. Any imposter should have a hard time guessing what you're typing in, so you'll be able to catch them in the act.
de: War die Authentifizierung erfolgreich, können sie sicher sein, dass der Kontakt tatsächlich die behauptete Identität besitzt.

source: Pipes
de: Umleitungen

source: Pipes allows you to pipe incoming or outgoing messages through an external script or executable. An incoming message will be piped through the executable before it reaches your chat window, while outgoing messages will be piped through the executable before they are sent over the Internet. Pipes can receive text in one of three forms: <variablelist> <varlistentry> <term>Plain text body</term> <listitem><para>The body of the message, in plain &ascii; text</para></listitem> </varlistentry> <varlistentry> <term>&html; text body</term> <listitem><para>The body of the message, in &html;, as it would be if your chat peer had sent &html; to you, which will be rendered in the chat window</para></listitem> </varlistentry> <varlistentry> <term>&xml; full message</term> <listitem><para>An &xml; document that describes all the characteristics of the message, including the &html; body.</para></listitem> </varlistentry> </variablelist> For most purposes, you probably want to use the plain text body or &html; text body options. These can be used with programs such as translators or summarizers. The &xml; format is only appropriate for use with a program or script written specifically to work with this plugin. If you would like to write a program or script that does work with this plugin, see <link linkend="pipes">the more detailed documentation</link>.
de: Mit diesem Modul können ein- oder ausgehende Nachrichten durch ein externes Skript oder Programm geleitet werden. Durch das Programm geleitet werden alle eingehen Nachrichten, ehe sie das Chatfenster erreichen und alle ausgehenden Nachrichten, ehe sie ins Internet geschickt werden. Für Umleitungen gibt es drei verschiedene Format für den Text: <variablelist> <varlistentry> <term>Unformatierter Text</term> <listitem><para>Die eigentliche Nachricht im &ascii;-Textformat</para></listitem> </varlistentry> <varlistentry> <term>&html;-Text</term> <listitem><para>Die eigentliche Nachricht im &html;-Format, die für die Anzeige im Chatfenster gerendert wird</para></listitem> </varlistentry> <varlistentry> <term>Vollständige &xml;-Nachricht</term> <listitem><para>Ein &xml;-Dokument mit einer vollständigen Beschreibung der Nachricht einschließlich des &html;-Textteils</para></listitem> </varlistentry> </variablelist>Unformatierter Text oder &html;-Text kann &eg; für Übersetzungsprogramme verwendet werden. Das &xml;-Format kann nur mit einem Skript oder Programm speziell für dieses Modul benutzt werden. Weitere Informationen zu diesem Modul finden Sie im Kapitel <link linkend="pipes">Handbuch zur Implementierung für das Modul Umleitung</link>.

source: Statistics
de: Statistik

source: This plugin uses a database to gather information about your contacts' activity patterns. You can use this to see when a contact is usually online, for example.
de: Dieses Modul verwendet eine Datenbank, um Informationen über das Verhalten Ihrer Kontakte zu sammeln. Sie können diese Daten &eg; verwenden, um herauszufinden, wann einer Ihrer Kontakte üblicherweise online ist.

source: Text Effect
de: Texteffekte

source: Text Effect applies funny effects to your messages before sending them, like coloring them or changing the case of the words. Just don't forget you have activated it - we've had bug reports from forgetful <guilabel>Text Effect</guilabel> users!
de: <guilabel>Texteffekte</guilabel> verändern den Text einer Nachricht vor dem Absenden. Beispiele sind die Einfärbung der Buchstaben in verschiedenen Farben oder die Änderung von Klein- und Großschreibung buchstabenweise.

source: Translator
de: Übersetzer

source: The Translator plugin lets you define a preferred language for each Metacontact, and then translates messages to or from them using web based translation services such as <trademark>Google</trademark>. Set your own preferred language in the <guilabel>Select and Configure Plugins</guilabel> dialog. Each contact's preferred language can be set on its context menu.
de: Das Übersetzermodul ermöglicht die Angabe einer bevorzugten Sprache für jeden Metakontakt und übersetzt Nachrichten an oder von diesem Kontakt mithilfe von Internetdiensten wie <trademark>Google</trademark>. Die eigene bevorzugte Sprache können Sie im Einrichtungsdialog des Moduls festlegen. Die Sprache eines Kontakts können Sie über dessen Kontextmenü festlegen.

source: The following item is added to the Chat window's menus:
de: Der folgende Eintrag wird zu den Chatfenster-Menüs hinzugefügt:

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>T</keycap></keycombo> </shortcut> <guimenu>Tools</guimenu> <guimenuitem>Translate</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>T</keycap></keycombo></shortcut><guimenu>Extras</guimenu><guimenuitem>Übersetzen</guimenuitem>

source: If you did not turn on automatic translation, this translates the current chat.
de: Falls die automatische Übersetzung abgeschaltet ist, kann so der aktuelle Chat übersetzt werden.

source: Web Presence
de: Web-Präsenz

source: Web Presence allows you to publicize your &im; presence on the Web. Give it the path to a file on an &FTP; server (for example), and it will upload a short piece of &HTML; to that file, which you can include in your homepage. &kde;'s network transparency makes this simple. Useful for bloggers to make friends with, or you could use it to use &im; in your business.
de: Web-Präsenz ermöglicht das Darstellen ihres &im;-Status im Internet. Das Modul lädt eine kurze HTML-Datei zu einem angegebenen FTP-Server hoch, die dann in ihre Internetseite eingebunden werden kann. Das wird durch &kde;s Netzwerktransparenz erleichtert. Damit können Sie &eg; in ihrer Firma &im;-Dienste verwenden.

source: Example: <userinput>sftp://username@somehost.org/path/to/homes/user/im.html</userinput> uses the <acronym>SFTP</acronym> protocol to upload your presence directly onto the webserver.
de: Beispiel: <userinput>sftp://username@somehost.org/Pfad/zu/Persönlichem Ordner/im.html</userinput> verwendet das <acronym>SFTP</acronym>-Protokoll, um ihre Anwesenheitsinformation direkt auf einen Internetserver zu übertragen.

source: See <ulink url="help:/kioslave/index.html">the KIO manuals</ulink> for tips on specific network protocols.
de: Informationen zu den verschiedenen Netzwerkprotokollen finden Sie in den <ulink url="help:/kioslave/sftp/index.html">KIO-Handbüchern</ulink>.

source: Contributing a plugin
de: Ein Modul beitragen

source: &kopete; is designed to make it easy to create plugins that give it extra functions. So if you've got a great idea to make &kopete; even better, <link linkend="intro-to-kopete-web">get in touch</link>!
de: Die Modulstruktur von &kopete; erlaubt eine einfache Erweiterung um zusätzliche Funktionen. Falls Sie eine Idee zu einer in &kopete; fehlenden Funktion haben, <link linkend="intro-to-kopete-web">melden Sie sich</link>.

source: Frequently Asked Questions
de: Fragen und Antworten

source: What does &kopete; mean? How do I pronounce it?
de: Was bedeutet &kopete;? Wie wird &kopete; ausgesprochen?

source: &kopete;'s name comes from the chilean word Copete, meaning <quote>a drink with your friends</quote>. Duncan, the original author, recorded an <ulink type="audio/x-vorbis+ogg" url="http://kopete.kde.org/files/kopete_en.ogg">audio sample</ulink>.
de: &kopete; kommt vom chilenischen Wort <quote>Copete</quote>, das <quote>mit Freunden einen Trinken gehen</quote> bedeutet. Duncan, der ursprüngliche Autor von &kopete; hat die Aussprache <ulink type="audio/x-vorbis+ogg" url="http://kopete.kde.org/files/kopete_en.ogg">aufgenommen</ulink>.

source: When I have more than one messaging service under a user's name in my contact list and I click on that user's name, it will message them on the wrong messaging service.
de: Ich habe bei einem Benutzer mehrere Nachrichtendienste eingerichtet, über die dieser Benutzer erreicht werden kann. Wenn ich in der Kontaktliste auf diesen Benutzernamen klicke, wird leider der falsche Nachrichtendienst gestartet.

source: You can change the order of accounts &kopete; tries to message people with by using the Up and Down arrows in the bottom right corner of the account configuration screen. &kopete; will try to connect with accounts starting from the top. However, if one service has a higher status value than the others for that user, &kopete; will use that one. For example, if a person has three services and two are marked as away and the third is marked as online, &kopete; will always try to message the user using the online service.
de: Sie können die Reihenfolge der Nachrichtendienste ändern, die &kopete; beim Senden einer Nachricht benutzt, indem Sie die Einträge mit der Maus verschieben. &kopete; probiert den oben stehenden Nachrichtendienst zuerst aus. Falls allerdings einer der Zugänge einen höheren Status als die anderen hat, wird dieser zuerst benutzt. Falls beispielsweise von drei Zugängen zwei als abwesend markiert sind und einer als <quote>Online</quote>, wird sofort dieser dritte Zugang verwendet.

source: If you click on the small protocol icon on the right of the menu item, instead of on the person's name, you will always try to contact the person using that service!
de: Um einen bestimmten Nachrichtendienst für die Nachricht an eine bestimmte Person zu verwenden, klicken Sie auf das kleine Protokollsymbol rechts des Menüeintrags anstatt auf den Namen selbst.

source: I need to connect via a SOCKS proxy, but I cannot find any proxy configuration options in &kopete;. How do I set up &kopete; to use SOCKS?
de: Ich bin gezwungen, einen SOCKS-Proxy zur Verbindung zu verwenden. Ich finde dazu keinerlei Einstellmöglichkeiten in &kopete;. Wie kann ich &kopete; dazu bewegen, SOCKS zu benutzen?

source: <trademark>WLM</trademark>, <trademark>ICQ</trademark>, <trademark>AIM</trademark>, Jabber, and <trademark>Yahoo</trademark> use the &kde; network infrastructure. Their SOCKS proxy details are configured with the rest of &kde;, in &systemsettings;, <menuchoice><guimenu>Network and Connectivity</guimenu><guisubmenu>Network Settings</guisubmenu><guimenuitem>Proxy</guimenuitem></menuchoice>.
de: Die Dienste <trademark>WLM</trademark>, <trademark>ICQ</trademark>, <trademark>AIM</trademark>, Jabber und Yahoo verwenden die &kde;-Netzwerkinfrastruktur. Der SOCKS-Proxy wird für alle &kde;-Anwendungen gemeinsam in den &systemsettings; unter <menuchoice><guimenu>Netzwerk und Verbindungen</guimenu><guisubmenu>Netzwerkeinstellungen</guisubmenu><guimenuitem>Proxy</guimenuitem></menuchoice> eingerichtet.

source: Is it possible to customize the icons I see in &kopete;?
de: Kann ich für &kopete; eigene Symbole verwenden?

source: You can switch between different emoticons using the Emoticons tab of the Appearance page of the Configure &kopete; dialog.
de: Sie können auf der Seite Erscheinungsbild unter Emoticons des Dialogs <quote>&kopete; einrichten</quote> zwischen mehreren Symbolstilen wählen.

source: To install new emoticons, first look at <ulink url="http://www.kde-look.org/content/search.php">KDE-Look.org</ulink>, where there are a lot of additional emoticon sets to download.
de: Zusätzliche Sätze von Emoticons zum Herunterladen finden Sie auf <ulink url="http://www.kde-look.org/content/search.php">KDE-Look.org</ulink>:

source: The emoticons are easy to install - you just place a folder containing the icon files along with an &XML; file describing the mapping from text to picture in $KDEDIR/share/apps/kopete/pics/emoticons (or $KDEHOME, for example, in /home/joeuser/.kde/).
de: Die Installation von Emoticons ist vergleichsweise einfach - fügen Sie einfach unter $KDEDIR/share/apps/kopete/pics/emoticons (oder $KDEHOME, &eg; in /home/benutzer/.kde/) einen Ordner mit den Symboldateien und einer XML-Datei mit den Zuordnungen von Texten zu Symbolen hinzu.

source: Copy the extracted folder to $KDEDIR/share/apps/kopete/pics/emoticons or $HOME/.kde/share/apps/kopete/pics/emoticons (or wherever $KDEHOME is)
de: Kopieren Sie den ausgepackten Ordner nach $KDEDIR/share/apps/kopete/pics/emoticons oder $HOME/.kde/share/apps/kopete/pics/emoticons (oder wo sich $KDEHOME sonst befindet).

source: Select Configure &kopete; from the Settings menu and click on Appearance in the left panel of the Preferences window and click on the Emoticons tab
de: Wählen Sie aus dem Menü <quote>Einstellungen</quote> <quote>&kopete; einrichten</quote> und klicken Sie unter Erscheinungsbild in den linken Bereich des Einstellungsfensters, und wählen Sie die Karteikarte Emoticons.

source: Select the emoticons set you just installed from the list
de: Wählen Sie den gerade installierten Satz von Symbolen aus der Liste

source: Now you can use the newly installed emoticons in &kopete;
de: Sofort können Sie die neu installierten Symbole in &kopete; verwenden

source: To replace the protocol icons, you'll have to replace the icons in $KDEDIR/share/apps/kopete/icons, or provide replacements to override them in the same folder under $KDEHOME. At present there aren't any complete replacement sets that you can simply extract there.
de: Um die Protokollsymbole zu ersetzen, müssen Sie andere Symbole nach $KDEDIR/share/apps/kopete/icons kopieren oder sie mit entsprechenden Symbolen unter $KDEHOME überschreiben. Bisher gibt es keine vollständigen Sätze von Symbolen, die Sie verwenden können.

source: How come file transfers don't work?
de: Warum funktioniert die Dateiübertragung nicht?

source: Credits and License
de: Danksagungen und Lizenz

source: &kopete;: copyright 2001-2007, &kopete; Developers
de: &kopete; Copyright 2001-2007, &kopete;-Entwickler

source: CREDIT_FOR_TRANSLATORS
de: <para>Deutsche Übersetzung von Luc de Louw <email>luc@delouw.ch</email></para>

source: The Team
de: Das Entwicklerteam

source: Current Development Team
de: Aktuelles Entwicklerteam

source: Pali Rohár (pali.rohar at gmail com): Developer and Maintainer
de: Pali Rohár (pali.rohar at gmail com): Entwickler und Betreuer

source: Duncan Mac-Vicar Prett (duncan at kde org): Original author, developer, and project leader
de: Duncan Mac-Vicar Prett (duncan at kde org): Ursprünglicher Autor, Entwickler und Projektleiter

source: Till Gerken (till at tantalo net): Developer, Jabber maintainer
de: Till Gerken (till at tantalo net): Entwickler, Betreuer des Jabber-Moduls

source: Olivier Goffart (ogoffart at tiscalinet be): Lead Developer, WLM Plugin Maintainer
de: Olivier Goffart (ogoffart at tiscalinet be): Hauptentwickler, Betreuer des WLM-Moduls

source: Andy Goossens (andygoossens at telenet be): Developer
de: Andy Goossens (andygoossens at telenet be): Entwickler

source: Grzegorz Jaskiewicz (gregj at pointblue com pl): Developer, Gadu-gadu Plugin Maintainer
de: Grzegorz Jaskiewicz (gregj at pointblue com pl): Entwickler, Betreuer des Gadu-gadu-Moduls

source: Jason Keirstead (jason at keirstead org): Developer
de: Jason Keirstead (jason at keirstead org): Entwickler

source: &Matt.Rogers; (mattr at kde org): Lead Developer, AIM and ICQ plugin maintainer
de: &Matt.Rogers; (mattr at kde org): Hauptentwickler, Betreuer der Module AIM und ICQ

source: Richard Smith (lilachaze at hotmail com): Developer, UI maintainer
de: Richard Smith (lilachaze at hotmail com): Entwickler, Betreuer der Benutzeroberfläche

source: &Will.Stephenson; (lists at stevello free-online co uk): Developer, icons, plugins, manual author
de: &Will.Stephenson; (lists at stevello free-online co uk): Entwickler, Symbole, Module, Handbuchautor

source: Michel Hermier (michel.hermier at wanadoo fr): IRC Plugin Maintainer
de: Michel Hermier (michel.hermier at wanadoo fr): Betreuer des Moduls IRC

source: Andre Duffeck (andre at duffeck de): Developer: Developer, Yahoo plugin maintainer
de: Andre Duffeck (andre at duffeck de): Entwickler, Betreuer des Moduls Yahoo

source: &Michael.Larouche; (michael.larouche at kdemail net): Developer, WLM, Chat Window.
de: &Michael.Larouche; (michael.larouche at kdemail net): Entwickler, WLM, Chat-Fenster.

source: Former Developers (&kopete; Hall Of Fame)
de: Weitere Entwickler (Ruhmeshalle von &kopete;)
