Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdenetwork/kopete_chatstyle.po
Languages: de

source: The <filename>Contents/Info.plist</filename> file is not used in Kopete yet. But if you want your style to be compatible with <application>Adium</application>, you must supply that file. Here a basic example file. Strings to replace are enclosed with "$".
de: Die Datei <filename>Contents/Info.plist</filename> wird zurzeit noch nicht in Kopete benutzt. Damit der Stil aber kompatibel zu <application>Adium</application> bleibt, sollte die Datei vorhanden sein. Ein einfaches Beispiel für diese Datei, alle Texte zwischen den Zeichen „$“ sind durch passende Werte zu ersetzen:

source: <![CDATA[ <?xml version="1.0" encoding="UTF-8"?> <!DOCTYPE plist PUBLIC "-//Apple Computer//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd"> <plist version="1.0"> <dict> <key>CFBundleDevelopmentRegion</key> <string>English</string> <key>CFBundleGetInfoString</key> <string>$Your style full name$</string> <key>CFBundleIdentifier</key> <string>$Your style ID in the form: com.adiumx.smooth.operator.style$</string> <key>CFBundleInfoDictionaryVersion</key> <string>1.0</string> <key>CFBundleName</key> <string>$Your style name here$</string> <key>CFBundlePackageType</key> <string>AdIM</string> <key>MessageViewVersion</key> <integer>3</integer> </dict> </plist> ]]>
de: <![CDATA[ <?xml version="1.0" encoding="UTF-8"?> <!DOCTYPE plist PUBLIC "-//Apple Computer//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd"> <plist version="1.0"> <dict> <key>CFBundleDevelopmentRegion</key> <string>English</string> <key>CFBundleGetInfoString</key> <string>$Der vollständige Name Ihres Stils$</string> <key>CFBundleIdentifier</key> <string>$Die ID des Stils im Format: com.adiumx.smooth.operator.style$</string> <key>CFBundleInfoDictionaryVersion</key> <string>1.0</string> <key>CFBundleName</key> <string>$Name Ihres Stils$</string> <key>CFBundlePackageType</key> <string>AdIM</string> <key>MessageViewVersion</key> <integer>3</integer> </dict> </plist> ]]>

source: Supply <filename>buddy_icon.png</filename>
de: Unterstützung für <filename>buddy_icon.png</filename>

source: You must place a file named <filename>buddy_icon.png</filename> in the <filename>Incoming</filename> and <filename>Outgoing</filename>. These images will be used when the contact have no photo.
de: In den Ordnern <filename>Incoming</filename> und <filename>Outgoing</filename> muss eine Datei namens <filename>buddy_icon.png</filename> vorhanden sein. Diese Bilder werden verwendet, wenn für den Kontakt kein Foto vorhanden ist.

source: Support right-to-left languages with <filename>%messageDirection%</filename> keyword.
de: Unterstützung für Sprachen mit der Schreibrichtung von rechts nach links mit dem Schlüsselwort <filename>%messageDirection%</filename>.

source: <filename>%messageDirection%</filename> keyword is present for languages in the world that write right-to-left. It define the message direction, if it is "rtl" (right-to-left) or "ltr" (left-to-right). Add this style attribute to the HTML element that display the message: <userinput>direction: %messageDirection%</userinput>. Style preview in appearance config include a right-to-left to check if your style display it correctly. It should begin the string from the right.
de: Das Schlüsselwort <filename>%messageDirection%</filename> ist für Sprachen mit Schreibrichtung von rechts nach links vorgesehen. Mit „rtl“ wird von rechts nach links und mit „ltr“ wird von links nach rechts geschrieben. Dieses Stilattribut wird zum HTML-Element hinzugefügt, das die Nachrichten anzeigt: <userinput>direction: %messageDirection%</userinput>. In der Einstellung des Erscheinungsbildes wird für die Stilvorschau die angegebene Schreibrichtung überprüft und entsprechend angezeigt.
