Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdenetwork/kopete.po
Languages: de

source: These people have moved on from &kopete;, so don't contact them for &kopete; support. We're eternally grateful for their contributions.
de: Diese Personen sind nicht mehr für &kopete; tätig. Sie haben sich anderen Projekten zugewandt. Bitte richten Sie keine Fragen an sie. Für ihre Unterstützung sind wir diesen Personen ewig dankbar.

source: Christopher TenHarmsel (tenharmsel at users sourceforge net)Developer, Oscar hacker
de: Christopher TenHarmsel (tenharmsel at users sourceforge net) Entwickler, Oscar-Programmierer

source: Ryan Cumming (ryan at kde org): Core developer
de: Ryan Cumming (ryan at kde org): Kernentwickler

source: Richard Stellingwerff (remenic at linuxfromscratch org): Developer
de: Richard Stellingwerff (remenic at linuxfromscratch org): Entwickler

source: Hendrik vom Lehn (hennevl at hennevl de): Developer
de: Hendrik vom Lehn (hennevl at hennevl de): Entwickler

source: Stefan Gehn (sgehn at gmx net): Developer
de: Stefan Gehn (sgehn at gmx net): Entwickler

source: &Robert.Gogolok; (robertgogolock at gmx de): Developer
de: &Robert.Gogolok; (robertgogolock at gmx de): Entwickler

source: &Nick.Betcher; (nbetcher at kde org): Original author of ICQ, AIM and IRC plugins
de: &Nick.Betcher; (nbetcher at kde org): Ursprünglicher Autor der ICQ-, AIM- und IRC-Module

source: Daniel Stone (dstone at kde org): Original Jabber plugin author
de: Daniel Stone (dstone at kde org): Ursprünglicher Autor des Jabber-Moduls

source: James Grant (topace at lightbox org): Developer, importer Plugin author
de: James Grant (topace at lightbox org): Entwickler Autor des Import-Moduls

source: Zack Rusin (zack at kde org): Developer, old Gadu-gadu Plugin author
de: Zack Rusin (zack at kde org): Entwickler, alter Autor des Gadu-gadu-Moduls

source: Gav Wood (gav at kde org): WinPopup Plugin author
de: Gav Wood (gav at kde org): Autor des WinPopup-Moduls

source: Martijn Klingens (klingens at kde org): Developer, WLM hacker
de: Martijn Klingens (klingens at kde org): Entwickler, WLM-Programmierer

source: Documentation
de: Dokumentation

source: Documentation copyright 2003,2004,2005 &Will.Stephenson; (lists at stevello free-online co uk), copyright 2005 &Matt.Rogers; (mattr at kde org), copyright 2005,2006 &Michael.Larouche; (michael.larouche at kdemail net).
de: Copyright der Dokumentation 2003,2004,2005 &Will.Stephenson; (lists at stevello free-online co uk), Copyright 2005 &Matt.Rogers; (mattr at kde org), Copyright 2005,2006 &Michael.Larouche; (michael.larouche at kdemail net).

source: How to obtain &kopete;
de: Wie Sie &kopete; erhalten

source: Development versions may be downloaded at &kopetewww;.
de: Entwicklerversionen können von &kopetewww; heruntergeladen werden.

source: Required Libraries
de: Erforderliche Bibliotheken

source: If you installed &kopete; as part of your distribution, you probably have these installed already.
de: Falls Sie &kopete; als Teil ihrer Distribution installiert haben, sind diese vermutlich bereits installiert.

source: The Gadu-gadu plugin requires the libgadu package, see <ulink url="http://gj.pointblue.com.pl/projects/kopete/">this page</ulink> for details.
de: Das Gadu-gadu-Modul benötigt das Paket <quote>libgadu</quote>. Es ist auf <ulink url="http://gj.pointblue.com.pl/projects/kopete/">dieser Seite</ulink> zu finden.

source: The Now Listening plugin needs libxmms if you want to access what <application>xmms</application> is currently playing; this should be available in your distribution but is available as part of the xmms package at <ulink url="http://www.xmms.org">the xmms homepage</ulink>.
de: Das Modul <quote>Ich höre gerade diese Musik</quote> benötigt die Bibliothek <quote>libxmms</quote>, falls Sie auf den aktuellen Titel von <application>xmms</application> zugreifen möchten; diese Bibliothek sollte sich in ihrer Distribution befinden. Alternativ ist sie auf der <ulink url="http://www.xmms.org">Internetseite von xmms</ulink> verfügbar.

source: Compilation and Installation
de: Kompilierung und Installation
