Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdenetwork/kppp_getting-online.po
Languages: de

source: Getting online the easy way
de: Einen Zugang einfach erstellen.

source: A few things you should have ready before you start
de: Diese Dinge sollten Sie vorbereitet haben, bevor Sie beginnen:

source: If you have a fairly modern &Linux; distribution, you might find the rest of this document superfluous. &kppp; comes with a clever little wizard that in many cases can have you up and running with an internet connection in just a few minutes.
de: Falls Sie eine aktuelle vollständige &Linux; Distribution besitzen, so halten Sie die folgenden Informationen vielleicht für überflüssig. &kppp; besitzt einen sogenannten Wizard, der Ihnen behilflich ist, Ihre Internet Verbindung in einigen Minuten einzurichten.

source: Whether using the wizard or not, you should know the following information before you begin:
de: Ob Sie den Wizard nun benutzen oder nicht, Sie sollten trotzdem über folgendes informiert sein, bevor Sie beginnen:

source: Your <acronym>ISP</acronym> modem pool phone number.
de: Ihre <acronym>ISP</acronym> Modem Pool Telefonnummer.

source: Your username and password for your <acronym>ISP</acronym>.
de: Ihren Benutzernamen und Passwort für Ihren <acronym>ISP</acronym>.

source: Your <acronym>ISP</acronym>'s <acronym>DNS</acronym> servers (one is sufficient, but two is better).
de: Ihren <acronym>ISP</acronym>'s <acronym>DNS</acronym> (einer ist ausreichend, zwei jedoch besser)

source: Other optional information you should find out to fully access your <acronym>ISP</acronym>'s services are:
de: Andere optionale Informationen für den vollständigen Zugriff auf Ihren <acronym>ISP</acronym>'s-Service sind:

source: The incoming mail server address (often <systemitem class="systemname">pop.yourisp.com</systemitem> or <systemitem class="systemname">mail.yourisp.com</systemitem>)
de: Ihre Eingangs-Mailserver Adresse (oftmals <systemitem class="systemname">pop.IhreISP.com</systemitem> oder <systemitem class="systemname">mail.IhreISP.com</systemitem>)

source: Also find out if your <acronym>ISP</acronym> uses the POP3 protocol or IMAP.
de: Sie sollten wissen, ob Ihr <acronym>ISP</acronym> das POP3 Protokoll oder IMAP benutzt.

source: The outgoing (<acronym>SMTP</acronym>) mail server address (it could be the same as the incoming mail server, or it is often called something like <systemitem class="systemname">smtp.yourisp.com</systemitem>).
de: Die Ausgangs- (<acronym>SMTP</acronym>)-Mailserver Adresse (möglicherweise dieselbe wie die Eingangs-Mailserver Adresse oder oftmals eine Adresse in der Form:<systemitem class="systemname">smtp.IhreISP.com</systemitem>).

source: The Usenet News (<acronym>NNTP</acronym>) server address (possibly <systemitem class="systemname">news.yourisp.com</systemitem> or <systemitem class="systemname">nntp.yourisp.com</systemitem>).
de: Die Usenet News (<acronym>NNTP</acronym>)-Server Adresse (möglicherweise <systemitem class="systemname">news.IhreISP.com</systemitem> oder <systemitem class="systemname">nntp.IhreISP.com</systemitem>).

source: Any proxy servers your <acronym>ISP</acronym> has set up.
de: Irgendeinen Proxy-Server, den Ihre <acronym>ISP</acronym> eingerichtet hat.

source: All this information is probably available on any paperwork you received from your <acronym>ISP</acronym> when you signed up with them, or you can find it out from your <acronym>ISP</acronym>'s support telephone line.
de: Alle diese Informationen sind wahrscheinlich nachzulesen in den Unterlagen, die Sie von Ihrem <acronym>ISP</acronym> erhalten haben, als Sie sich anmeldeten. Sie können diese Informationen aber auch über die Support-Telefonverbindung Ihres <acronym>ISP</acronym> erhalten.

source: Armed with the above, and a fairly recent default installation of &Linux;, you may well find that setting up an internet connection is as simple as running the &kppp; wizard.
de: Ausgestattet mit diesen Informationen und einer vollständigen aktuellen Standard-Installation von &Linux;, ist die Einstellung des Internet-Zugangs genauso leicht, wie mit dem &kppp;-Assistenten.
