Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdenetwork/kppp_chap.po
Languages: de

source: <acronym>PAP</acronym> and <acronym>CHAP</acronym>
de: <acronym>PAP</acronym> und <acronym>CHAP</acronym>

source: Starting with version 0.9.1, &kppp; has supported directly the most commonly used form of <acronym>PAP</acronym> authentication.
de: Seit Version 0.9.1 unterstützt &kppp; die verbreitetste Authentifizierung <acronym>PAP</acronym> direkt.

source: <acronym>PAP</acronym> with &kppp;
de: <acronym>PAP</acronym> mit &kppp;

source: There are two different ways to use <acronym>PAP</acronym>.
de: Es gibt zwei unterschiedliche Methoden, <acronym>PAP</acronym> zu nutzen.

source: Client side authentication
de: Authentifizierung auf Seiten des Clients

source: This variant is used by many commercial <acronym>ISP</acronym>'s. It basically means that you (or rather, your computer) must authenticate yourself to the <acronym>ISP</acronym>'s <acronym>PPP</acronym> server. The <acronym>PPP</acronym> server does not need to authenticate itself to your computer. This is no security issue, as you should know which computer you just tried to dial to.
de: Diese Variante wird von vielen kommerziellen <acronym>ISP</acronym> genutzt. Grundsätzlich bedeutet das, dass Sie (oder Ihr Computer) sich selbst beim <acronym>PPP</acronym>-Server des <acronym>ISP</acronym>s authentifizieren müssen. Der <acronym>PPP</acronym>-Server darf sich nicht selbst auf Ihrem Computer authentifizieren, und normalerweise ist das auch nicht notwendig, da Sie wissen, mit welchem Computer Sie verbunden sind (da die Verbindung von Ihnen selbst hergestellt wurde).

source: If your <acronym>ISP</acronym> gives you a username and password, and tells you to use <acronym>PAP</acronym> authentication, this is the variant you should choose.
de: Falls Ihr <acronym>ISP</acronym> Ihnen nur einen Benutzernamen und ein Passwort gibt, und Ihnen sagt, <acronym>PAP</acronym>-Authentifizierung zu benutzen, müssen Sie diese Variante nehmen.

source: Two way authentication
de: Zwei-Wege-Authentifizierung

source: As above, but in this case your computer requires the <acronym>ISP</acronym> <acronym>PPP</acronym> server to authenticate itself. In order to establish a connection, you must chose the authentication method <guilabel>Script based</guilabel>, not <guilabel>PAP</guilabel>, and you will have to manually edit <filename>/etc/ppp/pap-secrets</filename>. While &kppp; doesn't provide built in support for this variant, it is nevertheless easy to establish a connection.
de: Gleich wie oben, aber Ihr Computer fordert den PPP-Server des ISP auf, sich selbst zu authentifizieren. Um eine Verbindung aufzubauen, müssen Sie die Authentifizierungs-Methode <emphasis>Skript-basiert</emphasis> und nicht <emphasis>PAP</emphasis> wählen, und müssen dann Sie die Datei <literal>/etc/ppp/pap-secrets</literal> manuell bearbeiten. Obwohl <emphasis>Kppp</emphasis> keine eingebaute Unterstützung für diese Variante bietet, ist es einfach, eine Verbindung mit dieser Variante von PAP mit <emphasis>Kppp</emphasis> aufzubauen. Die Einzelheiten sind im nächsten Abschnitt ‚PAP und CHAP mit <emphasis>Kppp</emphasis>‘ nachzulesen.

source: Preparing &kppp; for <acronym>PAP</acronym>
de: Vorbereitung von &kppp; für <acronym>PAP</acronym>

source: Make sure that the file <filename>/etc/ppp/options</filename> (and <filename>&tilde;/.ppprc</filename> if it exists) do <emphasis>not</emphasis> contain one of the following arguments:
de: Stellen Sie sicher, dass <filename>/etc/ppp/options</filename> (und <filename>&tilde;/.ppprc</filename>, falls Sie eine solche Datei haben) <emphasis>keinen</emphasis> der folgenden Parameter enthält:

source: It is very unlikely that any of these options are already there, but just to be sure, please check.
de: Es ist sehr unwahrscheinlich, dass einer dieser Parameter bereits dort steht, aber nur zur Sicherheit.

source: Start &kppp;
de: &kppp; starten

source: Click <guibutton>Configure</guibutton>
de: Klicken Sie auf <guibutton>Einrichten</guibutton>

source: Choose the account you want to use <acronym>PAP</acronym> with and click <guibutton>Edit</guibutton>
de: Wählen Sie den Zugang, für den Sie <acronym>PAP</acronym> nutzen möchten, und klicken Sie auf <guibutton>Bearbeiten</guibutton>

source: Choose the <guilabel>Dial</guilabel> tab
de: Klicken Sie auf die Karteikarte <guilabel>Wählen</guilabel>

source: Select <acronym>PAP</acronym> in the <guilabel>Authentication</guilabel> drop down box.
de: Wählen Sie nun <acronym>PAP</acronym> im Listenfeld <guilabel>Authentifizierung</guilabel>.

source: If you do not want to retype the password each time you dial in, select <guilabel>Store password</guilabel>. This will save the password to a file, so make sure that nobody else has access to your account.
de: Falls Sie das Passwort nicht bei jeder Einwahl erneut eingeben möchten, wählen Sie <guilabel>Passwort speichern</guilabel>. Damit wird das Passwort gespeichert. Stellen Sie sicher, dass niemand anderes als Sie Zugriff auf den Zugang hat, sonst hat diese Person Zugriff auf Ihr Passwort.

source: That's it. Close the dialogs, type in the username and password your <acronym>ISP</acronym> supplied, and click <guibutton>Connect</guibutton>.
de: Das war's. Schließen Sie die Dialoge, geben Sie den Benutzernamen und das Passwort, die Sie von Ihrem <acronym>ISP</acronym> erhalten haben, an und klicken Sie auf <guibutton>Verbinden</guibutton>.

source: An alternative method of using <acronym>PAP</acronym> and <acronym>CHAP</acronym> with &kppp;
de: Eine alternative Methode zur Verwendung von <acronym>PAP</acronym> und <acronym>CHAP</acronym> mit &kppp;.

source: This section is based on an email from Keith Brown <email>kbrown@pdq.net</email> and explains how to make &kppp; work with a generic <acronym>PAP</acronym> or <acronym>CHAP</acronym> account. If your <acronym>ISP</acronym> just gave you a user id and a password for an account, you probably can skip this section, and the instructions in the previous one will be all you need.
de: Das Folgende basiert auf einer E-Mail von Keith Brown <email>kbrown@pdg.net</email> und beschreibt, wie man &kppp; mit einem <acronym>PAP</acronym>- oder <acronym>CHAP</acronym>-Zugang zum Laufen bringt. Falls Ihr <acronym>ISP</acronym> Ihnen gerade eine Benutzerkennung und ein Passwort für einen Zugang gegeben hat, können Sie wahrscheinlich diesen Abschnitt überspringen und nur den vorherigen Abschnitt lesen.

source: <acronym>PAP</acronym> seems a lot more complicated at first glance than it really is. The server (the machine you are connecting to) basically tells the client (your machine) to authenticate using <acronym>PAP</acronym>. The client (<application>pppd</application>) looks in a specific file for an entry that contains a matching server name, and a client name for this connection, and then sends the password it finds there. That's about it!
de: PAP scheint auf den ersten Blick wesentlich komplizierter, als es in Wirklichkeit ist. Der Server (die Maschine, mit der Sie sich verbinden) sagt dem Client (ihrer Maschine), sich per PAP zu authentifizieren. Der Client (<emphasis>pppd</emphasis>) sucht in einer bestimmten Datei nach einem Eintrag, der für diese Verbindung passende Server- und Clientnamen enthält und schickt das dort gefundene Passwort. Das war's! Und so kann man das machen. Ich nehme eine <emphasis>pppd</emphasis>-Version von 2.2.0 an und eine Standardinstallation der Konfigurationsdateien unter <literal>/etc/ppp</literal>.

source: Now here's how to make that happen. I am assuming a <acronym>pppd</acronym> version of 2.2.x or better and a standard installation of configuration files under <filename class="directory">/etc/ppp</filename>.
de: Nun die Anleitung: Ich nehme mindestens Version 2.2.x von <acronym>pppd</acronym> und eine Standard-Installation der Konfigurationsdateien in <filename class="directory">/etc/ppp</filename> an.

source: For the purposes of illustration, imagine that you have an internet account with <systemitem>glob.net</systemitem> with the username <systemitem>userbaz</systemitem> and the password <literal>foobar</literal>
de: Angenommen man besitzt einen Internet-Zugang mit <systemitem>glob.net</systemitem>, Benutzername <systemitem>userbaz</systemitem> und Passwort <literal>geheim</literal>

source: First, you need to add all this to a file called <filename>/etc/ppp/pap-secrets</filename>. The format of an entry for our purposes is:
de: Als erstes müssen alle diese Informationen in eine Datei namens <filename>/etc/ppp/pap-secrets</filename> eingetragen werden. Das Format eines Eintrages lautet:

source: <userinput>USERNAME SERVERNAME PASSWORD</userinput>
de: <userinput>BENUTZERNAME SERVERNAME PASSWORT</userinput>

source: So you would add the following line to <filename>/etc/ppp/pap-secrets</filename> and then save it :
de: Daher würde man folgende Zeile an die Datei <filename>/etc/ppp/pap-secrets</filename> anhängen und speichern :

source: You can use any name for the server you wish, so long as you use the same name in the <application>pppd</application> arguments, as you'll see shortly. Here it's been shortened to <userinput>glob</userinput>, but this name is only used to locate the correct password.
de: Man kann jeden Namen für den Server nehmen, solange man den gleichen Namen bei den <application>pppd</application>-Argumenten angibt, wie man später sehen wird. Hier wurde das mit <userinput>glob</userinput> abgekürzt. Dieser Name ist nur dazu da, um das richtige Passwort zu finden.

source: Next you need to set up the connection in &kppp;. The basics are the same as any other connection, so we won't go into details here, except to say that you probably want to make sure that <filename>/etc/ppp/options</filename> is empty, and you don't want to create a login script either.
de: Als nächstes muss die Verbindung in &kppp; eingerichtet werden. Die grundlegenden Einstellungen entsprechen denen für jede andere Verbindung, daher werden hier keine Einzelheiten genannt. Man sollte allerdings darauf achten, dass die Datei <filename>/etc/ppp/options</filename> keine Einträge enthält. Ein Einwahlskript sollte ebenfalls nicht existieren.

source: In the &kppp; settings dialog, at the bottom of the <guilabel>Dial</guilabel> tab, is a <guibutton>Customize pppd Arguments</guibutton> button. This brings up an editing dialog. Here you can enter values that will be sent to <application>pppd</application> as command line arguments, and in the case of multiple value arguments, you need to enter each value as a separate entry in the listbox, in the correct order.
de: Im Einrichtungsdialog von &kppp; gibt es unten auf der Karteikarte <guilabel>Wählen</guilabel> den Knopf <guibutton>pppd-Argumente bearbeiten ...</guibutton>. Dieser zeigt einen Bearbeitungsdialog an. Hier kann man Werte eingeben, die an <application>pppd</application> als Befehlszeilenparameter übergeben werden. Bei Parametern mit mehreren Werten müssen diese getrennt in der richtigen Reihenfolge eingetragen werden.

source: You can put in any other arguments you want first. Then add the arguments that <application>pppd</application> uses to handle <acronym>PAP</acronym> authentication. In this example, we are going to add <userinput>user</userinput>, <userinput>userbaz</userinput>, <userinput>remotename</userinput> and <userinput>glob</userinput> in that order.
de: Man kann beliebige Parameter hinzufügen. Dann fügt man die Parameter hinzu, die <application>pppd</application> für die <acronym>PAP</acronym>-Authentifizierung benötigt. Im Beispiel fügt man <userinput>user</userinput>, <userinput>userbaz</userinput>, <userinput>remotename</userinput> und <userinput>glob</userinput> in dieser Reihenfolge hinzu.

source: The <option>user</option> tells the <application>pppd</application> what user name to look for in the <filename>pap-secrets</filename> file and then to send to the server. The remotename is used by <application>pppd</application> to match the entry in the <filename>pap-secrets</filename> file, so again, it can be anything you want so long as it is consistent with the entry in the <filename>pap-secrets</filename> file.
de: Der Parameter <option>user</option> gibt an, welchen Benutzernamen <application>pppd</application> verwenden soll. Dieser wird in der Datei <filename>pap-secrets</filename> gesucht und dann zum Server geschickt. Der Parameter <option>remotename</option> wird von <application>pppd</application> verwendet, um den passenden Eintrag in <filename>pap-secrets</filename> zu finden, daher kann er beliebig sein, muss nur mit dem Eintrag in der Datei <filename>pap-secrets</filename> übereinstimmen.

source: That's all there is to it, and you should now be able to set up your own connection to a server with <acronym>PAP</acronym> authentication. <acronym>CHAP</acronym> is not much different. You can see the &Linux; Network Administrators Guide for a <filename>chap-secrets</filename> file format, and the <application>pppd</application> arguments used, and the rest should be simple.
de: Das ist auch schon alles. Sie sollten jetzt in der Lage sein, Ihre eigene Verbindung zu einem Server mit PAP-Authentifizierung einzustellen. CHAP ist nur wenig anders. Schlagen Sie im <ulink url="http://www.tldp.org/LDP/nag/">Linux Network Administrators' Guide</ulink> für das Dateiformat von <literal>chap-secrets</literal> und den zu benutzenden <emphasis>pppd</emphasis>-Parametern nach. Der Rest sollte einfach sein, aber&hellip; Ihr persönliches Vorgehen, sie wissen schon.
