Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdenetwork/kppp_kppp-faq.po
Languages: de

source: Questions and Answers
de: Fragen und Antworten

source: Questions about Dialing
de: Fragen zur Einwahl

source: I can't get &kppp; to work. &kppp; tells me <application>pppd</application> has died or that a timeout has expired. What's going on?
de: Ich kann &kppp; nicht zum laufen bringen. &kppp; erzählt mir, dass <application>pppd</application> beendet wurde oder dass eine Zeitüberschreitung eingetreten ist!

source: Did you read this manual carefully? Here are once more the most common pitfalls:
de: Haben Sie dieses Handbuch sorgfältig gelesen? Hier sind nochmal die häufigsten Fallen:

source: Click on the <guibutton>Details</guibutton> button. &kppp; will you give an excerpt from the <acronym>PPP</acronym> log messages (may not work on non-&Linux; systems, or even on some &Linux; distributions). The log will help you to track down the bug.
de: Klicken Sie auf den <guibutton>Details</guibutton>-Knopf. &kppp; zeigt Ihnen dann einen Auszug aus dem <acronym>PPP</acronym>-Protokoll (funktioniert evtl. nur auf &Linux;-System und nicht mit allen Distributionen). Diese Meldungen können Ihnen helfen, den Fehler zu finden.

source: Make sure that <application>pppd</application> is the actual <application>pppd</application> binary not a script
de: Stellen Sie sicher, dass <application>pppd</application> wirklich das <application>pppd</application>-Programm ist, und kein Skript!

source: Make sure that <application>pppd</application> is setuid <systemitem>root</systemitem>. You may set this mode by issuing <userinput><command>chmod</command> <option>u+s pppd</option></userinput> as <systemitem>root</systemitem>.
de: Das Programm <application>pppd</application> muss als setuid <systemitem>root</systemitem> ausgeführt werden. Diesen Modus kann man als <systemitem>root</systemitem> mit dem Befehl <userinput><command>chmod</command> <option>u+s pppd</option></userinput> setzen.

source: Make sure that your <filename>/etc/ppp/options</filename> file exists and that it doesn't contain any conflicting entries. If in doubt: Leave this file empty.
de: Stellen Sie sicher, das die Datei <literal>/etc/ppp/options</literal> existiert und keine widersprüchlichen Einträge enthält. Falls Sie sich nicht sicher sind, lassen Sie diese Datei leer.

source: Make sure that you <emphasis>don't</emphasis> use the option <option>lock</option> as an argument for <application>pppd</application> (&kppp; is already taking care of device locking).
de: Stellen Sie sicher, dass Sie <emphasis>NICHT</emphasis> den Parameter <option>lock</option> für <application>pppd</application> angegeben haben (&kppp; kümmert sich bereit um die Gerätesperrung)!

source: Remove the <option>lock</option> option from <emphasis>both</emphasis> your <filename>/etc/ppp/options</filename> <emphasis>and</emphasis> <filename>&tilde;/.ppprc</filename> files!
de: Entfernen Sie den ``lock''-Parameter aus den Dateien <literal>/etc/ppp/options</literal> und <literal>&tilde;/.ppprc</literal>!

source: Using the symbolic link <filename class="symlink">/dev/modem</filename> may cause some conflicts. Eliminate this source of trouble by using the real device, &ie; <filename>/dev/cuaX</filename> or <filename>/dev/ttySX</filename>.
de: Wenn Sie den symbolischen Link <literal>/dev/modem</literal> benutzen, kann das zu Konflikten führen. Verhindern Sie diese Art Ärger, indem Sie das reale Gerät verwenden, &eg; <literal>/dev/cuaX</literal> oder <literal>/dev/ttySX</literal>. Hinweis: COM1 ist ttyS0, COM2 ist ttyS1 &etc;

source: <hardware>COM1</hardware> equals <filename>ttyS0</filename>, <hardware>COM2</hardware> is <filename>ttyS1</filename> and so on.
de: <hardware>COM1</hardware> entspricht <filename>ttyS0</filename>, <hardware>COM2</hardware> entspricht <filename>ttyS1</filename> und so weiter.

source: Make sure you set the right permission. In case of trouble you might want to run it as root first and then later, when everything is working fine give it less harmful permission if you can not afford to run &kppp; setuid <systemitem>root</systemitem>. The proper way to proceed would probably be creating a <systemitem>modem</systemitem> group.
de: Stellen Sie sicher, dass Sie die richtigen Berechtigungen eingestellt haben. Im Fall von Problemen sollten Sie es vielleicht zuerst als root ausführen, und dann, wenn alles gut funktioniert, weniger gefährliche Berechtigungen nehmen, wenn Sie es sich nicht leisten können &kppp; mit <systemitem>root</systemitem>-Rechten laufen zu lassen. Die richtige Vorgehensweise wäre vermutlich die Erzeugung einer eigenen <systemitem>modem</systemitem>-Gruppe.

source: You might be launching <application>pppd</application> too early, &ie; before the remote server is ready to negotiate a <acronym>PPP</acronym> connection. If you are using a login script, you should use the built-in terminal to verify your login procedure. Some providers will require you to issue a simple <command>Send</command> or <command>Send ppp</command> to launch <acronym>PPP</acronym>. Some users even reported, that they had to append <command>Pause 1</command> or <command>Pause 2</command> to their script to solve timing conflicts.
de: Eventuell starten Sie <application>pppd</application> zu früh, &eg; bevor der entfernte Server bereit ist, eine <acronym>PPP</acronym>-Verbindung aufzubauen. Wenn Sie ein Anmeldeskript benutzen, sollten Sie das eingebaute Terminal benutzen, um Ihre Anmelde-Prozedur zu überprüfen. Manche Provider erwarten von Ihnen ein einfaches <command>Send</command> oder <command>Send ppp</command>, um <acronym>PPP</acronym> zu starten. Einige Benutzer berichteten, dass Sie <command>Pause 1</command> oder <command>Pause 2</command> an Ihr Skript anhängen mussten, um Timing-Probleme zu lösen.

source: If nothing helps, you might obtain some debugging info from your systems log by issuing:
de: Wenn gar nichts hilft, sollten Sie evtl. Debug-Informationen aus Ihrem Systemprotokoll erhalten, indem Sie folgendes eingeben:

source: pppd died - The remote system is required to authenticate itself ...
de: pppd abgestürzt - Das entfernte System muss sich selbst identifizieren ...

source: Typical error message in system log:
de: Eine typische Fehlermeldung in der Systemprotokolldatei:

source: As far as I can tell there are two causes for this problem:
de: Für dieses Problem gibt es nach der Erfahrung zwei mögliche Gründe:

source: <filename>/etc/ppp/options</filename> contains the <option>auth</option> option. Simply put a <prompt>#</prompt> comment in front and try again.
de: Die Datei <filename>/etc/ppp/options</filename> enthält die Option <option>auth</option>. Das lässt sich durch ein <prompt>#</prompt>-Kommentarzeilen vor der fraglichen Zeile beheben.

source: Your system already has a default route. Have you set up a local network? In this case recent versions of pppd will behave as if <option>auth</option> had been specified. To override this you may add <option>noauth</option> to the pppd arguments in kppp' setup dialog. Alternatively you could take down the local network prior to dialing in. I'd be thankful if someone could provide instructions on how to peacefully combine the two network connections.
de: Das System hat bereits eine <quote>default route</quote>. Befinden Sie sich in einem lokalen Netzwerk? In diesem Fall verhalten sich aktuelle Versionen von pppd wie bei der Option <option>auth</option>. Das lässt sich beheben, indem man explizit <option>noauth</option> im Einrichtungsdialog von kppp einträgt. Alternativ kann man das lokale Netzwerk auch deaktivieren, bevor man die Internetverbindung herstellt. Es wird immer noch nach einer einfachen Möglichkeit der Kombination eines lokalen Netzwerks mit dem Internet gesucht.

source: pppd dies with 2.4.x Linux kernel
de: pppd stürzt mit der Kernelversion 2.4.x ab

source: Typical error messages in the system log:
de: Eine typische Fehlermeldung im Systemprotokoll lautet:

source: Install pppd 2.4.0b1 or better. See <filename>Documentation/Changes</filename> in the kernel sources for more info.
de: Installieren Sie pppd 2.4.0b1 oder aktueller. Siehe auch in <filename>Documentation/Changes</filename> in den Quelltexten des Kernels für weitere Informationen.

source: Why does &kppp; tell me <errorname>Unable to open the modem</errorname>?
de: Warum gibt &kppp; die Fehlermeldung <errorname>Das Modem kann nicht geöffnet werden (Sorry, can't open the modem)</errorname>?

source: This means that &kppp; doesn't have permissions to open the modem device or that you selected a modem device on the <guilabel>Modem</guilabel> Tab Dialog that is not valid. First make sure you selected the right modem device. Once you are sure you have selected the right modem device, you must give &kppp; the right permission to access the modem device and to be able to modify <filename>/etc/resolv.conf</filename> in case you want &kppp; to configure <acronym>DNS</acronym> correctly for you. If you can afford to run &kppp; setuid <systemitem>root</systemitem> this would solve all access problems for you, if not you will have to figure out what the right permissions are for your purposes. In order to give &kppp; setuid <systemitem>root</systemitem> permissions do the following:
de: Das bedeutet, dass &kppp; keine Berechtigung hat, das Modemgerät zu öffnen, oder dass Sie ein ungültiges Modemgerät auf der <guilabel>Modem</guilabel>-Karteikarte gewählt haben. Stellen Sie zunächst sicher, dass Sie das richtige Modemgerät gewählt haben. Wenn Sie sicher sind, dass dies der Fall ist, müssen Sie &kppp; die richtige Berechtigung geben, um auf das Modemgerät zugreifen zu können, und in der Lage zu sein, <filename>/etc/resolv.conf</filename> zu ändern, im Fall, dass Sie möchten, dass &kppp; den <acronym>DNS</acronym> richtig für Sie einstellt. Falls Sie in der Lage sind, &kppp; als setuid <systemitem>root</systemitem> auszuführen, würde das alle Zugriffsprobleme für Sie lösen, wenn nicht, müssen Sie herausfinden, was die richtigen Berechtigungen für Ihre Zwecke sind. Um &kppp; setuid <systemitem>root</systemitem>-Berechtigung zu geben, machen Sie Folgendes:

source: Why does &kppp; tell me it can't create a modem lock file?
de: &kppp; sagt mir, dass es keine Modemsperrung erzeugen kann.

source: This in most instances means that you have installed &kppp; without setuid bit on while you, the person executing &kppp;, doesn't have write access to the lock file folder which by default is <filename class="directory">/var/lock</filename>. This for example is the case on &RedHat; systems. Check the modem dialog for the precise location you have chosen. The solution is easy -- either run &kppp; setuid if you can afford to, or give regular users write access to <filename class="directory">/var/lock</filename> or create a modem group that will have access to the <filename class="directory">/var/lock</filename> file.
de: In den meisten Fällen bedeutet das, dass Sie &kppp; mit gesetztem SETUID-Bit installiert haben, während Sie, die Person, die &kppp; ausführt, keine Schreibberechtigung für den Sperrdateiordner haben, das standardmäßig <literal>/var/lock</literal> ist. Das ist zum Beispiel der Fall auf RedHat-Systemen. Überprüfen Sie den Modem-Dialog nach der genauen Position der Sperrdatei. Die Lösung ist einfach, entweder &kppp; SETUID laufen zu lassen, falls Sie können, oder normalen Benutzern Schreibzugriff auf <literal>/var/lock</literal> zu gewähren oder eine modem-Gruppe zu erstellen, die Zugriff auf die <literal>/var/lock</literal>-Datei hat.

source: Why is &kppp; installed with the setuid bit on?
de: Warum wird &kppp; mit gesetztem SETUID-Bit installiert?

source: There is no need for the setuid bit, if you know a bit of &UNIX; systems administration. Simply create a <systemitem>modem</systemitem> group, add all users that you want to give access to the modem to that group and make the modem device read/writable for that group. Also if you want <acronym>DNS</acronym> configuration to work with &kppp;, then <filename>/etc/resolv.conf</filename> must be read/writable by the members of that group. The same counts for <filename>/etc/ppp/pap-secrets</filename> and <filename>/etc/ppp/chap-secrets</filename> if you want to use the built-in <acronym>PAP</acronym> or <acronym>CHAP</acronym> support, respectively.
de: Das SETUID-Bit muss nicht gesetzt sein, wenn Sie sich ein bisschen mit Unix-Systemadministration auskennen. Erstellen Sie einfach eine Modemgruppe, fügen Sie alle Benutzer, denen Sie Zugriff auf das Modem gewähren wollen, dieser Gruppe hinzu und machen Sie das Modemgerät les- und schreibbar für diese Gruppe. Wenn Sie auch DNS-Konfiguration mit &kppp; benutzen wollen, muss <literal>/etc/resolv.conf</literal> les- und schreibbar von den Mitgliedern dieser Gruppe sein. Das gleiche gilt für <literal>/etc/ppp/pap-secrets</literal> und <literal>/etc/ppp/chap-secrets</literal>, wenn Sie die eingebaute PAP- und CHAP-Unterstützung benutzen wollen.

source: The &kppp; team has lately done a lot of work to make &kppp; setuid-safe. But it's up to you to decide if you install and how you install it.
de: Das &kppp;-Team hat in letzter Zeit sehr viel daran gearbeitet, um &kppp; SETUID-Sicher zu machen. Aber es liegt an Ihnen, ob und wie Sie es installieren.

source: You might also want to read the <link linkend="security">Security</link> section.
de: Eventuell wollen Sie dazu auch das Kapitel <link linkend="security">&kppp; und die Sicherheit</link> lesen.

source: What do I do when &kppp; just sits there and waits with the message: <computeroutput>Expecting OK</computeroutput>
de: Was mache ich, wenn &kppp; nichts tut und nur mit der Meldung <computeroutput>OK erwartet (Expecting OK)</computeroutput> wartet?

source: Have you played with the CR/LF setting? Try CR, LF or CR/LF.
de: Haben Sie an der CR/LF-Einstellung herumgespielt? Probieren Sie CR, LF oder CR/LF.

source: Alternatively, your modem might need some time to respond to its initialization. Open the <guilabel>Modem Commands</guilabel> dialog on the <guilabel>Modem</guilabel> tab and adjust the <guilabel>Pre-Init</guilabel> and <guilabel>Post-Init</guilabel> delays. See if you are successful when drastically increasing their values, and then do some fine-tuning later.
de: Ihr Modem braucht vielleicht einige Zeit, um auf seine Initialisierung zu antworten. Öffnen Sie den Dialog <guilabel>Modembefehle</guilabel> auf der Karteikarte <guilabel>Modem</guilabel> und stellen Sie die Verzögerungen <guilabel>Pre-Init</guilabel> und <guilabel>Post-Init</guilabel> ein. Probieren Sie, ob Sie erfolgreich sind, wenn Sie die Werte drastisch senken und stellen Sie sie dann später genauer ein.

source: The connection works fine, but I can't start any applications!
de: Der Verbindungsaufbau funktioniert gut, aber ich kann keine Programme starten.

source: You have probably selected the <link linkend="auto-configure-hostname">Auto Configure Host Name</link> option, and the X Server has problems connecting to your newly named host. If you really need this option (and chances are you really don't), you are unfortunately on your own to set up the appropriate authorizations. Issuing <userinput><command>xhost</command> <option>+</option></userinput> before starting the connection would do the job, but be warned of the security risks involved, since this effectively gives everyone else access to your X Server.
de: Sie haben vielleicht die Option <quote><link linkend="auto-configure-hostname">Konfiguriere Hostname automatisch von dieser IP</link></quote> aktiviert und der X-Server hat Probleme zum neu eingestellten Hostnamen zu verbinden. Falls Sie diese Option wirklich benötigen (wahrscheinlich eher nicht), müssen Sie auf eigene Faust die nötigen Authorisationen einstellen. Eingabe von <userinput><command>xhost</command> <option>+</option></userinput> löst das Problem, aber seien Sie gewarnt vor Sicherheitsrisiken, die sich daraus ergeben, da dann jeder Zugang zu Ihrem X-Server hat.

source: &kppp; reports a successful connection, but &konqueror; just says <errorname>Unknown host <replaceable>hostname</replaceable></errorname>, and &Netscape; reports <errorname>The server does not have a DNS entry</errorname>.
de: &kppp; meldet eine erfolgreiche Verbindung, aber &konqueror; gibt nur die Meldung <errorname>Unbekannter Rechner (Unknown host) <replaceable>Rechnername</replaceable></errorname>; &Netscape; meldet <errorname>Der Server hat keinen DNS-Eintrag (The server does not have a DNS entry)</errorname>.

source: Try pinging another server by its <acronym>IP</acronym> number, &eg; <userinput><command>ping</command> <option>195.0.254.76</option></userinput>. If that works, you could try the following:
de: Versuchen Sie, mit ping einen anderen Server über seine <acronym>IP</acronym>-Adresse, zu erreichen, <option>ping 195.0.254.76</option>. Wenn das funktioniert, sollten Sie das Folgende versuchen:

source: Check if you have provided &kppp; with at least one <acronym>DNS</acronym> address.
de: Prüfen Sie, ob Sie für &kppp; mindestens eine <acronym>DNS</acronym>-Adresse angegeben haben.

source: Check the contents of <filename>/etc/host.conf</filename>. There should be a line saying something similar to <literal>order hosts, bind</literal>. The <option>bind</option> keyword advises the resolver library to include a name server query when performing an address lookup. If such a line is not there, try adding it.
de: den Inhalt von <literal>/etc/host.conf</literal> prüfen. Es sollte eine Zeile vorhanden sein, in der etwas ähnliches wie <literal>order hosts, bind</literal> steht. Der <literal>bind</literal>-Schlüsselbegriff sagt der resolver-Bibliothek, dass sie einen Nameserver einbinden soll, wenn Sie eine Adresse sucht.

source: How do I make &kppp; send a <keysym>\n</keysym> or a <keysym>\r</keysym>
de: Wie kann man über &kppp; ein <keysym>\n</keysym> oder ein <keysym>\r</keysym> senden?

source: Just send an empty string such as in the following script:
de: Schicken Sie einfach eine leere Zeichenfolge, so wie im folgenden Skript:

source: Send # send an empty string Expect ID: Send itsme Expect word: Send forgot Expect granted Send ppp
de: Send # eine leere Zeichenfolge senden Expect ID: Send itsme Expect word: Send forgot Expect granted Send ppp

source: How can I stop &kppp; complaining: <errorname>Can't create lock file</errorname>?
de: Wie kann man die Fehlermeldung <errorname>Kann Sperrdatei nicht erzeugen (Can't create lock file</errorname> von &kppp; beseitigen?

source: This happens because you don't have permissions to create a lock file. If you chose to use a lock file, you must have write permission to the folder (typically <filename class="directory">/var/lock</filename>). This is of course no problem if you have given &kppp; setuid permissions. Please read the section on <link linkend="lock-files">Lock files</link>.
de: Das bedeutet, dass Sie keine Berechtigung haben, eine Sperrdatei zu erzeugen. Wenn Sie eine Sperrdatei benutzen wollen, müssen Sie Schreibrechte in dem Ordner haben, indem die Datei erzeugt werden soll (typischerweise /var/lock). Das ist natürlich kein Problem, wenn Sie &kppp; SETUID-Berechtigung gegeben haben. Lesen Sie bitte den Abschnitt über die <link linkend="lock-files">Modem-Sperrdatei</link>.

source: Why is my modem making so much noise when dialing?
de: Warum macht mein Modem beim Wählen großen Lärm?

source: Click on <guibutton>Setup</guibutton>, then <guilabel>Modem</guilabel>. You can control the modem volume here in three steps: Off, medium and high. For most modems, medium or high result in the same volume. If changing this setting doesn't work, make sure the correct settings for your modem are specified in <guibutton>Setup</guibutton>, <guilabel>Modem</guilabel>, <guibutton>Modem Commands</guibutton>.
de: Klicken Sie auf Einstellungen/Modem Sie können die Lautstärke des Modems hier in drei Schritten einstellen: aus, mittel, groß. Bei den meisten Modems bekommen Sie die gleiche Lautstärke für <quote>mittel</quote> und <quote>groß</quote>. Falls das nicht funktioniert, stellen Sie sicher, dass Sie die richtigen Einstellungen in Einstellungen/Modem/Modembefehle eingestellt haben"

source: I turned the modem volume to <quote>Off</quote> and verified the modem commands, but I still hear that awful noise during dialing. Why?
de: Ich habe die Modemlautstärke <quote>ausgeschaltet</quote> und die Modembefehle überprüft. Warum höre ich immer noch Wählgeräusche?

source: The volume initialization string can get lost if your modem can't cope with the speed it is receiving commands from &kppp;. Increase the value of <guilabel>Post-Init Delay</guilabel> in <guibutton>Setup</guibutton>, <guilabel>Modem</guilabel>, <guibutton>Modem Commands</guibutton>.
de: Die Zeichenkette zur Initialisierung der Lautstärke kann verloren gehen, wenn das Modem nicht mit der Übertragungsgeschwindigkeit von &kppp; zurechtkommt. In diesem Fall sollte man den Wert in <guilabel>Post-Init Verzögerung</guilabel> unter <guibutton>Einstellungen</guibutton>, <guilabel>Modem</guilabel>, <guibutton>Modembefehle</guibutton> erhöhen.

source: &kppp; keeps reporting unusual modem speeds like <quote>115200</quote> or <quote>57600</quote>
de: &kppp; meldet ungewöhnliche Modemgeschwindigkeiten, wie <quote>115200</quote>, <quote>57600</quote> oder Ähnliches.

source: Many modems only report the speed of the serial line and not the speed over the telephone line as default. You must configure these modems to report the true line speed by adding some commands to the modem init or dial strings. For many modems this command is <command>ATW2</command>. If you want to add it to the dial string (which normally starts with <command>ATD</command>), the new dial string would be <command>ATW2D</command>.
de: Viele Modems melden standardmäßig nur die Geschwindigkeit der seriellen Schnittstelle und nicht die Geschwindigkeit über die Telefonleitung. Sie müssen diese Modem erst so einstellen, dass Sie die wirkliche Datenübertragungsgeschwindigkeit melden (fügen Sie dies dem Init- oder Wählstring bei). Bei vielen Modems ist der Befehl ATW2. Wenn Sie dies dem Wählstring (typischerweise ATD) beifügen wollen, wäre der neue Wählstring ATW2D.

source: Why does &kppp; report <quote>Unknown speed</quote>
de: Warum meldet &kppp; <quote>Unbekannte Geschwindigkeit (Unknown speed)</quote>?

source: New modems often have very complex connection messages like <computeroutput>CONNECT LAP.M/V42.bis/115000:RX/31200:TX</computeroutput>, and &kppp; cannot parse this message correctly. Turn on <guibutton>Show Log</guibutton> and you'll see the connection speed.
de: Neue Modems haben oft komplizierte Verbindungsmeldungen wie <quote>CONNECT LAP.M/V42.bis/115000:RX/31200:TX</quote>, und &kppp; kann die Nachrichten nicht korrekt behandeln. Schalten Sie Protokollfenster anzeigen ein, und Sie werden die Verbindungsgeschwindigkeit sehen. Ich arbeite gerade an einer Lösung dieses Problems, und der Parser ist schon viel besser, aber immer noch nicht perfekt.

source: I get a slow connection speed
de: Die Übertragungsgeschwindigkeit ist langsam.
