Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdenetwork/kppp_dialog-setup.po
Languages: de

source: &kppp; will wait for the specified string to be received to exit the loop. If the string given by the corresponding <varname>LoopStart</varname> is received first, it will trigger a jump to the line after <varname>LoopStart</varname>, enabling repetition of username/password style paired dialogs.
de: &kppp; wartet auf den Empfang der angegebenen Zeichenkette und beendet die Schleife. Falls die Zeichenkette vom entsprechenden <varname>LoopStart</varname> zuerst empfangen wird, wird ein Sprung in die Zeile nach <varname>LoopStart</varname> vorgenommen, was eine Wiederholung von Benutzernamen/Passwort-Dialogen ermöglicht.

source: Example Scripts
de: Beispielskripte

source: A simple example login script
de: Ein einfaches Beispiel für ein Anmeldeskript

source: Here is a simple example script I could use to connect to my <acronym>ISP</acronym>
de: Hier ist ein einfaches Skript, das ich zur Verbindung zu meinem <acronym>ISP</acronym> verwenden könnte:

source: Expect ID: <lineannotation># wait for ID:</lineannotation> Send myid <lineannotation># you have to substitute myid with your id</lineannotation> Expect word: <lineannotation># wait for 'password'</lineannotation> Send 4u3fjkl <lineannotation># send my password '4u3fjkl'</lineannotation> Expect granted <lineannotation># My ISP send 'Permission granted' on login success.</lineannotation> Send ppp <lineannotation># This starts a ppp connection for # me on the ISP side.</lineannotation>
de: Expect ID: <lineannotation># auf 'ID:' warten</lineannotation> Send myid <lineannotation># Sie müssen 'myid' durch Ihren Benutzernamen ersetzen</lineannotation> Expect word: <lineannotation># warte auf 'password'</lineannotation> Send 4u3fjkl <lineannotation># sendet mein Passwort '4u3fjkl'</lineannotation> Expect granted <lineannotation># Mein ISP sendet 'Permission granted' bei Verbindungserfolg</lineannotation> Send ppp <lineannotation># Das startet eine PPP-Verbindung für mich # auf Seiten des ISPs.</lineannotation>

source: A login script that prompts for ID and password, and has loops.
de: Ein Anmeldeskript, das mit Hilfe von Schleifen nach Benutzername und Passwort fragt.

source: Here is a script for the same account with an <acronym>ID</acronym> and password prompt. This script will prompt for <acronym>ID</acronym> and password each time, no matter what is typed into the <guilabel>Login ID</guilabel> and <guilabel>password</guilabel> fields on &kppp;'s main screen.
de: Hier ist ein Skript für den gleichen Zugang mit einer Abfrage für Benutzername und Passwort. Das Skript fragt jedes Mal nach Benutzername und Passwort, egal was im Feld <guilabel>Benutzername</guilabel> und <guilabel>Passwort</guilabel> des Hauptfensters von &kppp; eingetragen ist.

source: This script also illustrates the use of the LoopStart/LoopEnd structure. If something goes wrong during the login procedure, for example, I mistype the password, my <acronym>ISP</acronym> will print an error message and restart the id/password loop by issuing the string <computeroutput>ID:</computeroutput> again. If the string <computeroutput>ID:</computeroutput> is caught before the LoopEnd keyword was parsed, &kppp; will start the script again, from the line after the LoopStart keyword.
de: Dieses Skript zeigt auch die Benutzung der LoopStart/LoopEnd-Struktur. Falls während des Anmeldevorgangs etwas schiefgeht, ich zum Beispiel das Passwort falsch eingegeben habe, gibt mein <acronym>ISP</acronym> eine Fehlermeldung aus und beginnt die Benutzername/Passwort-Schleife erneut, indem er die Zeichenkette <computeroutput>ID:</computeroutput> erneut sendet. Falls die Zeichenkette <computeroutput>ID:</computeroutput> vor der Abarbeitung von LoopEnd empfangen wird, startet &kppp; das Skript erneut nach dem LoopStart-Befehl.

source: LoopStart ID: <lineannotation># wait for ID:</lineannotation> Prompt Enter ID: <lineannotation># Prompt me for my ID and send it off.</lineannotation> Expect word: <lineannotation># wait for 'password'</lineannotation> PWPrompt Enter Password: <lineannotation># Prompt me for my password and send it off.</lineannotation> LoopEnd granted <lineannotation># My ISP send 'Permission granted' on login success.</lineannotation> Send ppp <lineannotation># This starts a ppp connection for me</lineannotation>
de: LoopStart ID: <lineannotation># wartet auf 'ID:'</lineannotation> Prompt Benutzername eingeben: <lineannotation># fragt nach meinem Benutzernamen und sendet ihn.</lineannotation> Expect word: <lineannotation># wartet auf 'password'</lineannotation> PWPrompt Passwort eingeben: <lineannotation># fragt mich nach meinem Passwort und sendet es.</lineannotation> LoopEnd granted <lineannotation># Mein ISP sendet 'Permission granted' bei Verbindungserfolg</lineannotation> Send ppp <lineannotation># Das startet eine PPP-Verbindung für mich</lineannotation>

source: Prompts for information not filled in on the main dialog.
de: Fragt Informationen ab, die im Hauptdialog nicht angegeben worden sind.

source: Here is the script that I actually use to connect to my <acronym>ISP</acronym>. This script will prompt for <acronym>ID</acronym> and password only if I haven't filled in the respective fields on &kppp;'s main dialog.
de: Hier ist das Skript, das ich zur Verbindung zu meinem <acronym>ISP</acronym> nutze: Dieses Skript fragt nur nach Benutzernamen und Passwort, falls sie nicht in den entsprechenden Feldern in &kppp;'s Hauptdialog eingegeben wurden.

source: LoopStart ID: <lineannotation># wait for ID:</lineannotation> ID Enter ID: <lineannotation># Prompt me for my ID and send it off.</lineannotation> Expect word: <lineannotation># wait for 'password'</lineannotation> Password Enter Password <lineannotation># Prompt me for my password and send it off.</lineannotation> LoopEnd granted <lineannotation># My ISP send 'Permission granted' on login success.</lineannotation> Send ppp <lineannotation># This starts a ppp connection for me</lineannotation> <lineannotation># on the ISP side</lineannotation>
de: LoopStart ID: <lineannotation># wartet auf ID:</lineannotation> ID Benutzername eingeben: <lineannotation># fragt nach meinem Benutzernamen und sendet ihn.</lineannotation> Expect word: <lineannotation># wartet auf 'password'</lineannotation> Password Passwort eingeben: <lineannotation># fragt mich nach meinem Passwort und sendet es.</lineannotation> LoopEnd granted <lineannotation># Mein ISP sendet 'Permission granted' bei Verbindungserfolg</lineannotation> Send ppp <lineannotation># Das startet eine PPP-Verbindung für mich</lineannotation> <lineannotation># auf Seiten des ISPs.</lineannotation>

source: A script for an <acronym>ISP</acronym> using challenge/response authentication.
de: Ein Skript für eine Authentifizierung beim <acronym>ISP</acronym> nach dem Frage/Antwort-Verfahren (challenge/response).

source: Here is a script that I use to connect to an <acronym>ISP</acronym> which is using some sort of challenge/response authentication. Usually you got a hardware token (a smart card with a display and calculator like keypad) from the <acronym>ISP</acronym>. You have to know a password to use the token. After dialing in your <acronym>ISP</acronym> displays your challenge. You have to type in the challenge to your token and get a dynamic password as a response. Then you have to enter that password.
de: Hier ist das Skript, das ich zur Verbindung mit einem <acronym>ISP</acronym> benutze, der eine Art Frage/Antwort-Authentifizierung benutzt. Normalerweise erhält man dazu eine Hardware-Ausrüstung (eine kleine Karte mit einem Display und einer Taschenrechner ähnlichen Tastatur) von seinem <acronym>ISP</acronym>. Sie müssen ein Passwort kennen, um dieses Gerät nutzen zu können. Nach der Einwahl zeigt der <acronym>ISP</acronym> die Forderung an. Sie müssen diese in Ihr Gerät eingeben und erhalten als Antwort ein dynamisches Passwort. Dieses müssen Sie dann an den <acronym>ISP</acronym> zurücksenden.

source: LoopStart ID: <lineannotation># wait for ID:</lineannotation> ID Enter ID: <lineannotation># Prompt me for my ID and send it off.</lineannotation> Scan Challenge: <lineannotation># Scan for 'Challenge' and store everything behind up to the next newline.</lineannotation> Expect Password: <lineannotation># wait for 'password'</lineannotation> Prompt Your token is ## - Enter Password # Prompt me for my password and send it off. LoopEnd granted <lineannotation># My ISP sends 'Permission granted' on login success.</lineannotation> Send ppp <lineannotation># This starts a ppp connection for me # on the ISP side</lineannotation>
de: LoopStart ID: <lineannotation># wartet auf ID:</lineannotation> ID Enter ID: <lineannotation># fragt mich nach meiner ID und sendet sie</lineannotation> Scan Challenge: <lineannotation># Wartet auf 'Challenge' und speichert alles dahinter bis zum nächsten Zeilenumbruch.</lineannotation> Expect Password: <lineannotation># warte auf 'password'</lineannotation> Prompt Your token is ## - Enter Password <lineannotation># fragt mich nach meinen Passwort und sendet es.</lineannotation> LoopEnd granted <lineannotation># Mein ISP sendet 'Permission granted' bei Verbindungserfolg</lineannotation> Send ppp <lineannotation># Das startet eine PPP-Verbindung für mich</lineannotation> <lineannotation># auf Seiten des ISPs.</lineannotation>

source: Using Scan and Save in scripts
de: Verwendung von Scan und Save in Skripten

source: The following log shows the login procedure of a fictitious <acronym>ISP</acronym> that provides a new password on each login. The new password has to be verified and recorded for the next session.
de: Das folgende Protokoll zeigt die Anmeldeprozedur eines fiktiven <acronym>ISP</acronym>, der bei jeder Anmeldung ein neues Passwort vergibt. Das neue Passwort muss überprüft und für die nächste Anmeldung gespeichert werden.

source: University of Lummerland Login:mylogin Password: The password for your next session is: YLeLfkZb Please record and enter it for verification. Verification:YLeLfkZb 1 = telnet 2 = SLIP 3 = PPP Your choice:
de: Universität von Lummerland Login:mylogin Password: Das Passwort fuer Ihre naechste Anmeldung ist: YLeLfkZb Bitte speichern Sie es und geben Sie es zur Ueberpruefung ein. Ueberpruefung:YLeLfkZb 1 = telnet 2 = SLIP 3 = PPP Ihre Wahl:

source: &kppp; can be used to this cumbersome task for you, eliminating the risk of losing that little sheet of paper that holds your current password at the same time. The key part of the following script is the combination of Scan/Save keywords.
de: &kppp; kann dazu benutzt werden, diese Aufgabe für Sie zu übernehmen (und schaltet dabei das Risiko aus, dass Sie das kleine Blatt Papier, auf dem Ihr derzeitiges Passwort steht, verlieren). Der wichtigste Teil des folgenden Skripts ist die Kombination des Scan/Save Teils.

source: 7 Expect Login: <lineannotation># wait for login prompt</lineannotation> ID <lineannotation># send ID</lineannotation> Expect Password: <lineannotation># wait for password prompt</lineannotation> Password <lineannotation># send password</lineannotation> Scan is: <lineannotation># wait for '... next session is:' and # scan the preceding password</lineannotation> Save password <lineannotation># save the new password for next login</lineannotation> Expect Verification: <lineannotation># wait for 'Verification:'</lineannotation> Password <lineannotation># send new password</lineannotation> Expect choice: <lineannotation># wait for a prompt that let's you choose</lineannotation> <lineannotation># between different options (telnet, SLIP, PPP)</lineannotation> Send 3 <lineannotation># choose option 3, i.e. PPP</lineannotation>
de: Expect Login: <lineannotation># warte auf Login-Prompt</lineannotation> ID <lineannotation># sende ID</lineannotation> Expect Password: <lineannotation># warte auf Passwort-Prompt</lineannotation> Password <lineannotation># sende password</lineannotation> Scan ist: <lineannotation># warte auf '... naechste Anmeldung ist:' und</lineannotation> <lineannotation># scanne das folgende Passwort</lineannotation> Save password <lineannotation># speichere das neue Passwort für nächste Anmeldung</lineannotation> Expect Verification: <lineannotation># warte auf 'Ueberpruefung:'</lineannotation> Password <lineannotation># sende neues Passwort</lineannotation> Expect choice: <lineannotation># warte auf Prompt, bei dem Sie zwischen verschiedenen</lineannotation> <lineannotation># Optionen (telnet, SLIP, PPP) wählen können</lineannotation> Send 3 <lineannotation># wähle Option 3, PPP</lineannotation>

source: The Execute tab
de: Die Karteikarte Ausführen

source: <screeninfo>The Accounts <guilabel>Execute</guilabel> tab</screeninfo>
de: <screeninfo>Die Karteikarte <guilabel>Ausführen</guilabel> für Zugänge</screeninfo>

source: <phrase>The Accounts <guilabel>Execute</guilabel> tab</phrase>
de: <phrase>Die Karteikarte <guilabel>Ausführen</guilabel> für Zugänge</phrase>

source: <para>The Accounts <guilabel>Execute</guilabel> tab</para>
de: <para>Die Karteikarte <guilabel>Ausführen</guilabel> für Zugänge</para>

source: Here you can select commands to run at certain stages of the connection. These commands are run with your real user id, so you cannot run any commands here requiring root permissions, unless you are of course dialled in as root (a bad thing to do for many reasons!)
de: Hier kann man Befehle angeben, die an bestimmten Stellen der Verbindung ausgeführt werden sollen. Diese Befehle werden mit dem eigenen Benutzernamen ausgeführt, daher kann man keine Befehle angeben, die Systemverwalter-Berechtigungen erfordern, wenn man die Verbindung nicht gerade als Systemverwalter (root) aufbaut (aus vielen Gründen eine schlechte Idee).

source: Make sure to supply the whole path to the program, otherwise &kppp; may not be able to find it.
de: Es ist wichtig, den kompletten Programmpfad anzugeben, da &kppp; es sonst möglicherweise nicht findet.

source: You can add commands to be run at four distinct times during the connection process:
de: Man kann Programme an vier festgelegten Stellen der Verbindung ausführen lassen:

source: Before Connect
de: Vor Verbindungsaufbau

source: Run this command before the dialing is initiated, so it is already running when you connect to your <acronym>ISP</acronym>.
de: Dieser Befehl wird vor der Einwahl gestartet, läuft also bereits, wenn die Verbindung zum <acronym>ISP</acronym> aufgebaut wird.

source: Upon Connect
de: Nach Verbindungsaufbau

source: Run this command only after a successful connection is made.
de: Dieser Befehl wird nur nach einem erfolgreichen Verbindungsaufbau ausgeführt.

source: Before disconnect
de: Vor Trennung der Verbindung

source: Run this command while still connected, before hanging up the modem.
de: Dieser Befehl wird ausgeführt, solange die Verbindung noch besteht.

source: Upon disconnect
de: Nach Trennung der Verbindung

source: Run this command after the connection has been closed.
de: Dieser Befehl wird ausgeführt, nachdem die Verbindung beendet worden ist.

source: You might for example want to run <application>leafnode</application> as soon as you have connected, or check your mail. You might want to make sure any mail in your queue is sent, before you close your connection down. You might want a <quote>clean-up</quote> script to tidy up logs and clear your cache after you have disconnected.
de: Zum Beispiel möchte man vielleicht das Programm <application>leafnode</application> zum Herunterladen von Nachrichten ausführen lassen, sobald die Verbindung aufgebaut wurde. Weiterhin möchte man vielleicht sämtliche im Postausgang wartenden Nachrichten versenden, ehe die Verbindung beendet wird und könnte zu diesem Zweck ein <quote>clean-up</quote>-Skript starten und nach dem Verbindungsabbau einen eventuellen Zwischenspeicher leeren lassen.

source: The Accounting tab
de: Die Karteikarte Abrechnung

source: <screeninfo>The Accounts <guilabel>Accounting</guilabel> tab</screeninfo>
de: <screeninfo>Die Karteikarte <guilabel>Abrechnung</guilabel> für Zugänge</screeninfo>

source: <phrase>The Accounts <guilabel>Accounting</guilabel> tab</phrase>
de: <phrase>Die Karteikarte <guilabel>Abrechnung</guilabel> für Zugänge</phrase>

source: <para>The Accounts <guilabel>Accounting</guilabel> tab</para>
de: <para>Die Karteikarte <guilabel>Abrechnung</guilabel> für Zugänge</para>

source: Check the <guilabel>Enable Accounting</guilabel> box to enable or disable telephone cost accounting for this account.
de: Man muss das Ankreuzfeld <guilabel>Abrechnung aktivieren</guilabel> markieren, um die Abrechnung von Telefonkosten für diesen Zugang durchführen zu lassen.

source: Select from the list the applicable rule for your telecoms provider.
de: Aus der Liste wählt man dann die passende Regel für den eigenen Provider.

source: If you can't find one, you can write one yourself by copying the supplied template, which you will find in an <link linkend="appendix-accounting-template">appendix</link>.
de: Falls man den eigenen Provider nicht in der Liste findet, kann man einen Eintrag hinzufügen, indem man die bereitgestellt Vorlage kopiert, die sich in einem <link linkend="appendix-accounting-template">Anhang</link> befindet.

source: The final option on this page is <guilabel>Volume Accounting</guilabel>, described below.
de: Die letzte Einstellmöglichkeit dieser Seite lautet <guilabel>Volumenberechnung</guilabel> und wird weiter unten beschrieben.

source: Volume Accounting
de: Volumenberechnung

source: What is volume accounting?
de: Was ist Volumenberechnung?

source: Basically, it means to count the number of bytes transmitted to and from the Internet. &kppp; can count incoming bytes, outgoing bytes, or both. It's up to you what you want (or must) use.
de: Hauptsächlich ist damit die Zählung der Bytes, die gesendet oder empfangen werden, gemeint. &kppp; kann eingehende, empfangene Bytes oder beides zählen. Es liegt an Ihnen, was Sie benutzen wollen (oder müssen).

source: Why should I use volume accounting?
de: Warum sollte ich Volumenberechnung benutzen?

source: Many Internet Service Providers bill their customers based on the number of bytes transferred. Even more commonly, <acronym>ISP</acronym>'s offer a flat rate up to some arbitrary transfer limit, and then charge more for every megabyte above this limit. &kppp; shows you your current volume and can help you keep your bills to the minimum. Of course, even if you're not billed based on volume, you can turn on volume accounting just to satisfy your own curiosity.
de: Weil heutzutage viele Internet Service Provider dazu übergehen, die Gebühren nach der Menge der gesendeten Daten zu berechnen. Oder oft ist es so, dass ein <acronym>ISP</acronym> eine Grenze der zu übertragenden Daten festlegt, und Sie für jedes darüberliegende Megabyte zahlen müssen. &kppp; zeigt Ihnen an, wieviele Daten sie bisher übertragen haben und kann Ihnen dabei helfen, Ihre Rechnungen zu senken. Natürlich können Sie die Volumenberechnung auch benutzen, wenn Sie keine Begrenzung der Datenmenge haben.

source: What type of volume accounting should I select?
de: Welche Art der Volumenberechnung soll ich wählen?

source: That depends mainly on your provider. Many of them only count how many megabytes you download from the Internet, and ignore how much you send. In that case you should choose <guilabel>Bytes In</guilabel>. If you have to pay for both, you should choose <guilabel>Bytes In and Out</guilabel>. <guilabel>Bytes Out</guilabel> is really only here for completeness, as we're not aware of any providers using it as a billing basis. It might be useful to those of you running a web or &FTP; server at home though.
de: Das hängt von Ihrem Provider ab. Viele berechnen nur die Menge der heruntergeladenen Daten und kümmern sich nicht darum, wieviele Daten gesendet werden. In diesem Fall sollten Sie <guilabel>Bytes empfangen</guilabel> wählen. Wenn Sie für Übertragungen in beide Richtungen zahlen müssen, sollten Sie <guilabel>Bytes gesendet/empfangen</guilabel> wählen. <guilabel>Bytes gesendet</guilabel> ist nicht sehr nützlich und ist nur der Vollständigkeit wegen vorhanden. Es könnte vielleicht nützlich sein, falls man einen Web- oder &FTP;-Server zu Haus betreibt.

source: Drawbacks
de: Einschränkungen

source: Unfortunately, there is a drawback on volume accounting. &kppp; will only count the number of bytes, regardless of their origin. Many providers set their limit only for Internet access, and not for data on their own network. Some providers set different limits for data that is on their own network, in the same country, and coming from overseas. So, if you're doing not much websurfing, and getting most of your pages from your <acronym>ISP</acronym>'s own proxy cache, then your provider is probably not charging you for that data. &kppp; will not know these <acronym>IP</acronym> packets are coming from the proxy, and so it will count them. So if you this situation applies to you, or, as another example, your provider uses a caching news server such as <application>nntpcached</application>, then the volume reported by &kppp; may be higher than the amount you are going to be billed for. On the bright side, at least &kppp; will never underestimate your bills.
de: Unglücklicherweise gibt es eine Einschränkung bei der Volumenberechnung. &kppp; zählt alle Daten unabhängig von Ihrem Ursprung. Viele Provider setzen Ihre Grenzen aber nur für den Internetzugang, nicht für Ihr eigenes Netzwerk. Wenn Sie also im Web surfen und dabei einen Proxy benutzen, wird dieser Proxy zum Netzwerk Ihres Providers gehören und Ihnen werden keine Gebühren für Daten, die von diesem Proxy stammen, berechnet. &kppp; weiß nicht, dass diese <acronym>IP</acronym>-Pakete von diesem Proxy stammen, und sie mitzählen. Wenn Sie also einen Proxy benutzen, oder Ihr Provider benutzt einen Newsserver mit Zwischenspeicher (wie &eg; <application>nntpcached</application>), wird die von &kppp; angezeigte Datenmenge größer sein.
