Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdenetwork/kppp_global-settings.po
Languages: de

source: Global &kppp; settings
de: Globale Einstellungen von &kppp;

source: The changes made here affect all accounts you have set up in &kppp;
de: Die hier vorgenommenen Einstellungen betreffen alle Verbindungen, die man mit &kppp; eingerichtet hat.

source: The Accounts tab
de: Die Karteikarte Zugänge

source: <screeninfo>The <guilabel>Accounts</guilabel> tab</screeninfo>
de: <screeninfo>Die Karteikarte <guilabel>Zugänge</guilabel></screeninfo>

source: <phrase>The <guilabel>Accounts</guilabel> tab</phrase>
de: <phrase>Die Karteikarte <guilabel>Zugänge</guilabel></phrase>

source: <para>The <guilabel>Accounts</guilabel> tab</para>
de: <para>Die Karteikarte <guilabel>Zugänge</guilabel></para>

source: In this dialog, you can manage the accounts themselves. The names of the accounts appear in a list on the left of the dialog.
de: In diesem Dialog kann man die Zugänge einrichten. Die Namen der Zugänge erscheinen in einer Liste auf der linken Seite des Dialogs.

source: To delete an account, select the <guibutton>Delete</guibutton> button. You will be asked to confirm before the account is finally deleted.
de: Um einen Zugang zu entfernen, klickt man auf <guibutton>Entfernen</guibutton>. Vor dem Löschen wird man um Bestätigung gebeten.

source: You can make a copy of an account with the <guibutton>Copy</guibutton> button. You could use this for example, to separate different users in the family, although that would normally be better done by having them be different users in the OS as well! Or perhaps you just have more than one account with the same <acronym>ISP</acronym> and wish to use both of them.
de: Man kann einen Zugang kopieren, indem man auf den Knopf <guibutton>Kopieren</guibutton> klickt. Das kann man verwenden, um &eg; für unterschiedliche Benutzer in der Familie unterschiedliche Zugänge einzurichten, obwohl es sicher besser wäre, für diese auch unterschiedliche Benutzernamen im Betriebssystem einzurichten. Falls man mehr als einen Zugang zum gleichen <acronym>ISP</acronym> einrichten möchte, kann man diese Funktion verwenden.

source: Choosing <guibutton>Edit...</guibutton> will take you to the dialog described in <link linkend="dialog-setup">Dialog Setup</link>, but with the selected accounts details.
de: Klickt man auf <guibutton>Bearbeiten ...</guibutton>, so erscheint der unter <link linkend="dialog-setup">Einrichtungsdialog</link> mit den Einstellungen des ausgewählten Zugangs.

source: Choosing <guibutton>New...</guibutton> will offer you the choice between the <link linkend="wizard">Wizard</link> or the <link linkend="dialog-setup">Dialog Setup</link> already described.
de: Klickt man auf <guibutton>Neu ...</guibutton>, so wird die Auswahl zwischen dem <link linkend="wizard">Assistenten</link> oder der <link linkend="dialog-setup">Manuellen Einrichtung</link> angeboten.

source: If you select an account, and you have turned on <link linkend="account-accounting">accounting</link> then the accumulated information for that account will appear in the two panels labelled <guilabel>Phone Costs:</guilabel> and <guilabel>Volume:</guilabel> respectively.
de: Falls man einen Zugang auswählt und <link linkend="account-accounting">Abrechnung</link> aktiviert ist, werden die gesammelten Informationen für diesen Zugang in den zwei Feldern <guilabel>Telefonkosten</guilabel> und <guilabel>Volumen</guilabel> angezeigt.

source: To the left of the accounting display, are two buttons: <guibutton>Reset...</guibutton> and <guibutton>View Logs</guibutton>.
de: Auf der rechten Seite befinden sich die zwei Knöpfe <guibutton>Zurücksetzen ...</guibutton> und <guibutton>Protokolldateien anzeigen</guibutton>.

source: Pressing <guibutton>Reset...</guibutton> will reset the <guilabel>Phone Costs:</guilabel> and <guilabel>Volume:</guilabel> information to 0. You would typically want to do this once a month or quarter, when you have received your phone bill and reconciled the telephone costs. You can reset either independently, and are offered the choice of which item you want to reset, when you press the <guibutton>Reset</guibutton> button.
de: Ein Klick auf <guibutton>Zurücksetzen ...</guibutton> setzt die <guilabel>Telefonkosten:</guilabel> und das <guilabel>Volumen:</guilabel> auf Null. Das wird man typischerweise einmal im Monat oder im Vierteljahr durchführen, wenn man die aufsummierten Werte mit den eingegangenen Telefonrechnungen vergleichen hat. Man kann auch beide Werte unabhängig von einander zurücksetzen. Beim Klicken auf den Knopf <guibutton>Zurücksetzen ...</guibutton> wird ein Dialog angezeigt, der eine Auswahl erlaubt.

source: Pressing <guibutton>View Logs</guibutton> will open another window, where a log of all the calls made with &kppp; will be displayed. If you have kept logs, you can move forward and backward, in monthly steps. This might be useful if you have received an abnormally large phone bill and are investigating why!
de: Klickt man auf <guibutton>Protokolldateien anzeigen</guibutton>, erscheint ein Fenster, in dem die Protokolldatei aller Anrufe von &kppp; angezeigt wird. Falls man alte Protokolldateien aufbewahrt, kann man in Monatsschritten vorwärts und rückwärts gehen. Das kann sehr nützlich sein, falls man eine ungewöhnlich hohe Telefonrechnung erhält und die Gründe dafür erforschen möchte.

source: The Modems tab
de: Die Karteikarte Modems

source: This tab displays all configured modems and allows you to add, edit, copy and delete modems.
de: Auf dieser Karteikarte werden alle eingerichteten Modems angezeigt. Sie können Modems hinzufügen, bearbeiten, kopieren und löschen.

source: Click on <guibutton>New</guibutton> or <guibutton>Edit</guibutton> opens the next dialog.
de: Klicken Sie auf <guibutton>Neu</guibutton> oder <guibutton>Bearbeiten</guibutton>, um den nächsten Dialog zu öffnen.

source: The Device tab
de: Die Karteikarte Gerät

source: <screeninfo>The <guilabel>Device</guilabel> tab</screeninfo>
de: <screeninfo>Karteikarte <guilabel>Gerät</guilabel></screeninfo>

source: <phrase>The <guilabel>Device</guilabel> tab</phrase>
de: <phrase>Karteikarte <guilabel>Gerät</guilabel></phrase>

source: <para>The <guilabel>Device</guilabel> tab</para>
de: <para>Karteikarte <guilabel>Gerät</guilabel></para>

source: Here you can select and configure your modem.
de: Hier kann man ein Modem auswählen und einrichten.

source: Modem Device
de: Modemgerät

source: Choose the device appropriate for your hardware.
de: Wählen Sie das passende Gerät für Ihre Hardware.

source: DOS or &Windows; users will know this as COM1, while COM2 is <filename>/dev/ttys1</filename> and so on. These devices are the ones normally used on &Linux; systems.
de: DOS oder &Windows;-Benutzer kennen dies als COM1, COM2 ist <filename>/dev/ttyS1</filename> und so weiter. Diese Geräte werden hauptsächlich unter &Linux; benutzt.

source: The first serial line (COM1). COM2 is usually <filename>/dev/cua1</filename> and so on. These devices are commonly used on BSD systems, namely FreeBSD, NetBSD and OpenBSD. Older &Linux; systems may also have these, although on &Linux; they were renamed some time ago to <filename>/dev/ttyS<replaceable>x</replaceable></filename>.
de: Die erste serielle Schnittstelle (COM1). COM2 ist üblicherweise <filename>/dev/cua1</filename> und so weiter. Diese Gerätenamen werden hauptsächlich auf BSD-Systemen, also FreeBSD, NetBSD und OpenBSD, verwendet. Ältere Versionen von &Linux; könnten diese Gerätenamen ebenfalls verwenden, obwohl bereits vor einiger Zeit die Umbenennung auf <filename>/dev/ttyS<replaceable>x</replaceable></filename> erfolgte.

source: On &Linux; these belong to internal <acronym>ISDN</acronym> cards. These devices emulate a common Hayes compatible modem. <filename>/dev/ttyI0</filename> is for the first, <filename>/dev/ttyI1</filename> is for the second <acronym>ISDN</acronym> card and so on. These devices are only available in the &Linux; version.
de: Unter &Linux; gehört dieses zu internen <acronym>ISDN</acronym>-Karten. Diese Geräte emulieren ein gewöhnliches Hayes-kompatibles Modem. <filename>/dev/ttyI0</filename> ist die erste, <filename>/dev/ttyI1</filename> die zweite <acronym>ISDN</acronym>-Karte &etc; Diese Geräte sind nur in der &Linux;-Version vorhanden.

source: Many &Linux; distributions make a symbolic link from the real modem device to <filename class="symlink">/dev/modem</filename>. <emphasis>You should avoid using this one.</emphasis>. Use the real device that it is pointing to instead.
de: Viele &Linux;-Distributionen erstellen einen symbolischen Link vom realen Modemgerät zu <filename class="symlink">/dev/modem</filename>. <emphasis>Sie sollten es vermeiden, diesen Link zu benutzen.</emphasis> Verwenden Sie besser den Gerätenamen.

source: Flow Control
de: Flusskontrolle

source: Select from Hardware (CRTSCTS), Software (XON/XOFF) and no flow control. The recommended setting is Hardware flow control.
de: Wählen Sie aus Hardware- (CRTSCTS), Software- (XON/XOFF) und keiner Flusskontrolle. Die empfohlene Einstellung ist Hardware-Flusskontrolle.

source: Line Termination
de: Zeilenende

source: Choose the correct <quote>Enter</quote> character sequence for your modem. Most modems will use <quote>CR/LF</quote>, however some modems need a different setting. If you experience trouble while running a login script, play with this parameter.
de: Wählen Sie die richtige <quote>Enter</quote>-Zeichenfolge für Ihr Modem. Die meisten Modems nutzen <quote>CR/LF</quote>. Trotzdem benötigen manche Modems eine andere Einstellung. Falls bei Ihnen Probleme beim Ablauf eine Skripts auftreten: Spielen Sie mit diesem Parameter herum.

source: Connection Speed
de: Geschwindigkeit

source: Choose from the list of connection speeds supported by your serial port. Note that the serial port supports much higher speeds than your modem in most cases. You should probably start with the highest number available, and only reduce it if you have connection problems.
de: Aus der Liste kann man zwischen verschiedenen Übertragungsgeschwindigkeiten die von der seriellen Schnittstelle Unterstützte auswählen. Zu beachten ist, dass die meisten seriellen Schnittstellen wesentlich höhere Geschwindigkeiten als das Modem unterstützen. Man sollte mit der größten Zahl anfangen und diese nur bei Verbindungsproblemen verringern.

source: Use Lock File
de: Sperrdatei verwenden

source: Activate this option if you want &kppp; to create a lockfile. Under &Linux; the folder for such a file will be <filename class="directory">/var/lock</filename>. Programs such as <application>mgetty</application> depend on the existence of such lock files, and &kppp; will not work with <application>mgetty</application> if the lock file is not set. Make sure that you don't use the option <option>lock</option> for <application>pppd</application> if you want &kppp; to lock the modem, since the <application>pppd</application> option <option>lock</option> will induce <application>pppd</application> to try to lock the modem device. Since &kppp; will have already locked the device, <application>pppd</application> will fail, and &kppp; will display the error <errorname>pppd died unexpectedly</errorname>.
de: Aktivieren Sie diese Option, wenn &kppp; eine Sperrdatei erstellen soll. Unter &Linux; wird diese Datei in <filename class="directory">/var/lock</filename> erstellt. Programme wie <application>mgetty</application> bestehen auf der Existenz solcher Sperrdateien und &kppp; arbeitet nicht mit <application>mgetty</application>, wenn die Sperrdatei nicht verwendet wird. Stellen Sie sicher, dass Sie nicht die Option <option>lock</option> bei <application>pppd</application> nutzen, falls &kppp; die Modemsperrung übernimmt, da die Option <option>lock</option> <application>pppd</application> dazu bringt, selbst das Modemgerät sperren zu wollen. Da &kppp; dann bereits das Modem gesperrt hat, scheitert <application>pppd</application> und &kppp; wird sich mit <errorname>pppd died unexpectedly</errorname> melden.

source: Modem Timeout
de: Modem-Wartezeit

source: This is the time in seconds that &kppp; will wait for the <returnvalue>CONNECT</returnvalue> response from your modem. A setting of about 30 seconds should be sufficient for most purposes.
de: Diese Zeitspanne in Sekunden wartet &kppp; auf die Antwort <returnvalue>CONNECT</returnvalue> des Modems. Ein Wert von 30 Sekunden sollte für die meisten Fälle ausreichen.

source: The Modem tab
de: Die Karteikarte Modem

source: <screeninfo>The <guilabel>Modem</guilabel> tab</screeninfo>
de: <screeninfo>Karteikarte <guilabel>Modem</guilabel></screeninfo>

source: <phrase>The <guilabel>Modem</guilabel> tab</phrase>
de: <phrase>Karteikarte <guilabel>Modem</guilabel></phrase>

source: <para>The <guilabel>Modem</guilabel> tab</para>
de: <para>Karteikarte <guilabel>Modem</guilabel></para>

source: Busy Wait
de: Besetzt-Wartezeit

source: This is the length of time the modem should wait before redialing, after it has received a busy signal. Note there are requirements by telecom providers in some countries, which ask you to not set this too low.
de: Das ist die Zeitspanne, die das Modem nach einem Besetzt-Zeichen bis zur Wiederanwahl warten soll. Hier sollte man die länderspezifischen Anforderungen der Telekommunikationsfirmen beachten, die normalerweise eine untere Grenze für diese Zeitspanne vorschreiben.

source: Modem volume
de: Modem-Lautstärke

source: Use the slider to set the modem volume. Left is low volume, center is medium volume, and right is high volume. On some modems, low volume is the same as turning the volume off, and on other modems, medium and high are effectively the same thing.
de: Mit dem Schieberegler kann man die Modem-Lautstärke einstellen. Links bedeutet geringe Lautstärke, Mitte bedeutet mittlere Lautstärke und Rechts bedeutet hohe Lautstärke. Bei einigen Modems ist geringe Lautstärke gleichbedeutend mit dem Ausschalten des Lautsprechers, bei Anderen besteht kein Unterschied zwischen den Einstellungen Mitte und Rechts.

source: Modem Commands
de: Modembefehle

source: In this dialog you can fill in any particular commands appropriate for your modem. If you own a Hayes compatible modem, you most likely won't need to change any of the defaults, but you are encouraged to read the <link linkend="appendix-hayes-commands">Hayes Commands</link> Appendix in this help file. The information supplied there can be very helpful in cases where you experience trouble setting up a stable connection with your <acronym>ISP</acronym>'s modems. In particular the two settings for <guilabel>Pre-Init Delay</guilabel> and for <guilabel>Post-Init Delay</guilabel> if you are experiencing modem lockups. These settings make &kppp; pause a little just before and just after sending the initialization string to your modem. The <guilabel>Pre-Init Delay</guilabel> will by default also send a CR, unless you have set it the delay interval to 0.
de: Damit kommen Sie in einen Dialog, den Sie mit den passenden Modembefehlen für Ihr Modem ausfüllen müssen. Falls Sie ein Hayes-kompatibles Modem besitzen, müssen Sie wahrscheinlich die Standardeinstellungen nicht ändern. Ich empfehle Ihnen aber trotzdem den Abschnitt über <link linkend="appendix-hayes-commands">Hayes-Befehle</link> im Anhang dieser Dokumentation zu lesen. Die dort gebotenen Informationen sollten auch von Hilfe sein für den Fall, dass Sie auf Probleme bei der Einstellung einer stabilen Verbindung zu Ihrem <acronym>ISP</acronym> stoßen. Die zwei Einstellungen <guilabel>Pre-Init Verzögerung</guilabel> und <guilabel>Post-Init Verzögerung</guilabel> könnten von besonderem Interesse sein, wenn Sie Modem lock-ups testen. Diese Optionen veranlassen &kppp; dazu, vor und nach dem Senden des Init-Strings kurz anzuhalten. Die <guilabel>Pre-Init-Verzögerung</guilabel> wird durch Senden eines CR abgeschlossen, wenn nicht als Verzögerungsintervall 0 eingestellt wurde.

source: Query Modem
de: Modemabfrage

source: Pushing this button will make &kppp; ask your modem to identify itself. On success, your modems response will be displayed in a dialog. This may or may not prove to be informative, depending on your modem.
de: Auf Betätigung des Modemabfrage-Knopfs hin befragt &kppp; Ihr Modem nach seiner Identifikation. Bei Erfolg wird die Antwort Ihres Modems in einem Dialog dargestellt. Das kann, abhängig von Ihrem Modem, mehr oder weniger informativ sein.

source: Pushing the <guibutton>Terminal</guibutton> button will bring up a mini terminal. You can use the mini terminal to test your modem and to experiment with the negotiation protocol for initializing a ppp connection with your <acronym>ISP</acronym>. You no longer need a terminal program such as <application>minicom</application> or <application>Seyon</application>.
de: Durch Betätigung des <guibutton>Terminal</guibutton>-Knopfs wird ein Miniterminal gestartet. Sie können das Miniterminal benutzen, um Ihr Modem zu testen, und mit dem Anmeldeprotokoll für eine PPP-Verbindung mit Ihrem <acronym>ISP</acronym> zu experimentieren. Sie benötigen nicht länger ein Terminalprogramm wie <application>minicom</application> oder <application>Seyon</application>.

source: The Graph tab
de: Die Karteikarte Grafik

source: <screeninfo>The <guilabel>Graph</guilabel> tab</screeninfo>
de: <screeninfo>Karteikarte <guilabel>Grafik</guilabel></screeninfo>

source: <phrase>The <guilabel>Graph</guilabel> tab</phrase>
de: <phrase>Karteikarte <guilabel>Grafik</guilabel></phrase>

source: <para>The <guilabel>Graph</guilabel> tab</para>
de: <para>Die Karteikarte <guilabel>Grafik</guilabel></para>

source: Here you can set the colors used by the &kppp; graph. You can set different colors for <guilabel>Background</guilabel>, <guilabel>Text</guilabel>, <guilabel>Input bytes</guilabel> and <guilabel>Output bytes</guilabel>.
de: Hier kann man die von &kppp; für die grafische Darstellung des Datendurchsatzes verwendeten Farben einstellen. Man kann verschiedene Farben für <guilabel>Hintergrund</guilabel>, <guilabel>Text</guilabel>, <guilabel>Empfangene Bytes</guilabel> und <guilabel>Gesendete Bytes</guilabel> festlegen.

source: The Misc tab
de: Die Karteikarte Verschiedenes

source: <screeninfo>The <guilabel>Misc</guilabel> tab</screeninfo>
de: <screeninfo>Karteikarte <guilabel>Verschiedenes</guilabel></screeninfo>

source: <phrase>The <guilabel>Misc</guilabel> tab</phrase>
de: <phrase>Karteikarte <guilabel>Verschiedenes</guilabel></phrase>

source: <para>The <guilabel>Misc</guilabel> tab</para>
de: <para>Die Karteikarte <guilabel>Verschiedenes</guilabel></para>

source: Here are some options that don't really fit in with other sections, but can be very useful nonetheless.
de: Hier befinden sich einige nützliche Einstellmöglichkeiten, die in keinen der anderen Abschnitte passen.

source: The version number of the pppd daemon on your system.
de: Die Versionsnummer des pppd-Dämons, der auf diesem Rechner eingesetzt wird.

source: pppd Timeout
de: pppd-Wartezeit

source: &kppp; will wait this amount of time after running the script and starting <application>pppd</application> for <application>pppd</application> to establish a valid <acronym>ppp</acronym> link before giving up and killing <application>pppd</application>
de: &kppp; wartet diese Zeit nach dem Ablauf des Skripts und dem Start von <application>pppd</application>, bis <application>pppd</application> eine gültige <acronym>PPP</acronym>-Verbindung aufgebaut hat, bevor es aufgibt und <application>pppd</application> beendet.

source: Dock into Panel on Connect
de: Bei Verbindung in Kontrollleiste einbinden

source: If this option is chosen, &kppp; will dock into the panel where it will be symbolized by a small animated icon. Use the <mousebutton>left</mousebutton> mouse button on this icon to restore &kppp;'s window. The <mousebutton>right</mousebutton> mouse button will open a popup menu that offers to restore the window, show transfer statistics, or close the connection. This option overrides <guilabel>Minimize Window on Connect</guilabel>.
de: Wenn dieses Ankreuzfeld markiert wird, dockt &kppp; als kleines animiertes Symbol an die Kontrollleiste an. Durch Klicken mit der <mousebutton>linken</mousebutton> Maustaste auf das Symbol kann man das Fenster von &kppp; wiederherstellen. Ein Klick mit der <mousebutton>rechten</mousebutton> Maustaste öffnet ein Menü mit Optionen zur Wiederherstellung des Fensters, Anzeige von Übertragungsstatistiken und zum Schließen der Verbindung. Diese Option hat Vorrang vor der Einstellung <guilabel>Fenster nach dem Verbinden minimieren</guilabel>.

source: Automatic Redial on Disconnect
de: Automatische Neuwahl nach Trennung

source: Selectintg this will have &kppp; try to reconnect if you are disconnected.
de: Diese Auswahl bewirkt, dass &kppp; versucht, sich erneut zu verbinden, falls Sie unabsichtlich getrennt werden während Sie online sind.

source: Show Clock on Caption
de: Zeige Verbindungsdauer im Fenstertitel

source: This will have &kppp; display the time connected on the caption of the &kppp; window, while you are online.
de: Damit zeigt &kppp; die Verbindungszeit im Titel des &kppp;-Fensters während Sie online sind an.

source: Disconnect on X-server shutdown
de: Trennen bei Schließen des X-Servers

source: Checking this will cause &kppp; to terminate the <acronym>ppp</acronym> link, disconnect the modem, and terminate accounting in an orderly fashion, when the X-server shuts down. This is useful if you are prone to forgetting you are online, when you shut down the X-server, or if you simply don't want to worry about manually disconnecting your session. If you don't want &kppp; to hang up the modem on X-server exit, you should leave this checkbox empty. Beware that if you have accounting enabled, and you leave this option turned off, you will have an unterminated accounting entry in your logs, from each time the X-server exits and &kppp; terminates.
de: Die Aktivierung dieser Option bewirkt, dass &kppp; die <acronym>PPP</acronym>-Verbindung beendet, das Modem auflegen lässt und die Gebührenzählung in ordentlicher Weise beendet, wenn der X-Server beendet wird. Das ist nützlich, falls sie immer wieder vergessen, &kppp; vor Beenden des X-Servers zu schließen, oder falls Sie sich einfach keine Sorgen über das Trennen Ihrer Verbindung machen möchten. Falls Sie nicht möchten, dass &kppp; das Modem bei Beenden des X-Servers auflegen lässt, sollten Sie diese Option nicht aktivieren. Denken Sie aber daran, dass Sie bei eingeschalteter Gebührenzählung einen nicht beendeten Gebühreneintrag in Ihrer Gebührenabrechnung haben werden, wenn der X-Server sich und damit &kppp; beendet.

source: Quit on Disconnect
de: Bei Trennung beenden

source: If enabled, &kppp; will exit when you disconnect from the internet. If disabled, &kppp; will stay open after disconnection.
de: Falls diese Option aktiviert ist, beendet sich &kppp; nach dem Trennen der Internetverbindung, ansonsten bleibt das Programm &kppp; auch nach der Trennung aktiv.

source: Minimize Window on Connect
de: Minimiere Fenster nach dem Verbinden

source: If this option is chosen, &kppp; will be minimized after a connection is established. The elapsed connection time will be shown in the taskbar.
de: Das &kppp;-Fenster wird nach dem Aufbau einer Verbindung minimiert. Die verstrichene Verbindungszeit wird in der Programmleiste angezeigt.
