Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdenetwork/kppp_wizard.po
Languages: de

source: The &kppp; wizard
de: Der &kppp;-Assistent

source: Starting the Wizard.
de: Den Assistenten starten.

source: You can start the wizard from &kppp;'s initial screen. Start &kppp; from your <guimenu>K</guimenu> menu, where you will find its entry in the <guisubmenu>Internet</guisubmenu> as <guimenuitem>Internet Dial-Up Tool</guimenuitem>.
de: Man kann den Assistenten von &kppp;'s Eingangsbildschirm starten. Man startet &kppp;, aus dem <guimenu>K</guimenu>-Menü. Der Eintrag befindet sich im Untermenü <guisubmenu>Internet</guisubmenu> als <guimenuitem>Einwahl ins Internet</guimenuitem>.

source: The following dialog will appear:
de: Der folgende Dialog erscheint:

source: <screeninfo>The &kppp; dialer startup screen</screeninfo>
de: <screeninfo>Der Eingangsbildschirm von &kppp;</screeninfo>

source: <phrase>The &kppp; dialer startup screen</phrase>
de: <phrase>Der Eingangsbildschirm von &kppp;</phrase>

source: <para>The &kppp; dialer startup screen</para>
de: <para>Der Eingangsbildschirm von &kppp;</para>

source: It will probably not have any entries to begin with, and that's what we're about to do now.
de: Bisher gibt es vermutlich noch keine Einträge. Diese müssen nun hinzugefügt werden.

source: Click the <guibutton>Configure</guibutton> button to open the <guilabel>&kppp; Configuration</guilabel> dialog. On the <guilabel>Accounts</guilabel> tab select <guilabel>New...</guilabel> to begin setting up a new Internet connection.
de: Klicken Sie auf den Knopf <guibutton>Einrichten</guibutton>, um den Dialog <guilabel>&kppp;-Einrichtung</guilabel> zu öffnen. Auf der Karteikarte <guilabel>Zugänge</guilabel> wählen Sie <guibutton>Neu ...</guibutton> und geben die Zugangsdaten für eine neue Internetverbindung an.

source: The dialog will offer you three choices, <guibutton>Wizard</guibutton>, <guibutton>Manual Setup</guibutton> and <guibutton>Cancel</guibutton>
de: Der Dialog bietet drei Wahlmöglichkeiten an, nämlich <guibutton>Assistent</guibutton>, <guibutton>Manuelle Einrichtung</guibutton> und <guibutton>Abbrechen</guibutton>.

source: <screeninfo>The dialog asks you what you want to do...</screeninfo>
de: <screeninfo>Der Dialog fragt Sie, wie Sie fortfahren möchten ...</screeninfo>

source: <phrase>The dialog asks you what you want to do...</phrase>
de: <phrase>Der Dialog fragt Sie, wie Sie fortfahren möchten ...</phrase>

source: The dialog asks you what you want to do
de: Der Dialog fragt, wie Sie fortfahren möchten

source: Wizard
de: Assistent

source: If you have a fairly standard modem, and use one of the larger ISP's for your country, the wizard will probably be able to set you up immediately with a working Internet Connection. Try this first, before you try to set up the connection manually.
de: Falls man über ein Standardmodem verfügt und eine Verbindung zu einem größeren ISP des eigenen Landes einrichten möchte, kann der Assistent vermutlich automatisch eine funktionierende Verbindung einrichten. Das sollte man in jedem Fall zunächst probieren, bevor man sich an die manuelle Einrichtung macht.

source: Manual Setup
de: Manuelle Einrichtung

source: If you don't succeed with the Wizard, or you just want to do things yourself, choose this. The wizard currently is only useful for a small subset of countries and Internet Providers.
de: Falls der Assistent nicht erfolgreich ist oder man die Einstellungen lieber selbst vornimmt, sollte man diesen Knopf wählen. Der Assistent funktioniert momentan nur für eine kleine Auswahl an Ländern und Providern.

source: Cancel
de: Abbrechen

source: Choose this if you really don't want to be setting up a new account right now. The message box will go away, and you will be left with the dialer screen as before.
de: Wählen Sie diesen Knopf, wenn Sie keine neue Verbindung einrichten möchten. Der Dialog verschwindet und es bleibt das Hauptfenster zurück.

source: For the purposes of this chapter, we'll assume you are choosing <guibutton>Wizard</guibutton>, and the dialog based setup will be described in a later chapter.
de: Für die weiteren Erklärungen wird davon ausgegangen, das man <guibutton>Assistent</guibutton> ausgewählt hat. Der Einrichtungsdialog wird in einem anderen Kapitel beschrieben.

source: The Rest of the Wizard
de: Weitere Schritte mit dem Assistenten

source: The first screen you see contains just introductory text, explaining the things you read about in the first section of this chapter. Press <guibutton>Next</guibutton> to move on.
de: Im ersten Fenster befindet sich lediglich ein einleitender Text. Zum Fortfahren klickt man auf <guibutton>Weiter</guibutton>.

source: The second screen asks you to choose the country you live in. Not all countries are represented here, and if the country you live in is not listed, you will have to press <guibutton>Cancel</guibutton>, in which case the <link linkend="dialog-setup">Dialog based setup</link> will start for you to continue with.
de: Im zweiten Fenster muss man das eigene Land auswählen. Hier sind nicht alle Länder aufgelistet. Falls das eigene Land sich nicht in der Liste befindet, muss man auf <guibutton>Abbrechen</guibutton> klicken. In diesem Falls wird der <link linkend="dialog-setup">Einrichtungsdialog</link> gestartet.

source: On the next screen, you will be given a choice of Internet Providers that &kppp; knows about, based on your choice of location in the previous screen. Again, if your <acronym>ISP</acronym> is not listed here, you will have to press <guibutton>Cancel</guibutton> and do your setup in the <link linkend="dialog-setup">Dialog based setup</link>
de: Im nächsten Fenster hat man die Auswahl zwischen allen Providern, die &kppp; für diese Länderauswahl kennt. Falls der eigene <acronym>ISP</acronym> sich nicht in der Liste befindet, muss man wiederum auf <guibutton>Abbrechen</guibutton> klicken und die weitere Einrichtung über den <link linkend="dialog-setup">Einrichtungsdialog</link> durchführen.

source: You will now be asked to enter your username and password for your internet connection. Please note, that for some <acronym>ISP</acronym>s this differs from your mail account user name and password, so make sure you use the right one. Choose <guibutton>Next</guibutton> to continue.
de: Nun muss man den Benutzernamen und das Passwort für die Internet-Verbindung eingeben. Bei einigen <acronym>ISP</acronym>s unterscheiden sich diese Angaben von Benutzername und Passwort für den E-Mail-Zugang. Nach erfolgtem Eintrag klickt man auf <guibutton>Weiter</guibutton>.

source: On the next screen, you have a chance to enter any special dial prefixes you might have - for example, if you must dial <quote>0</quote> for an outside line, or if have a prefix you can dial to turn off call waiting. Choose <guibutton>Next</guibutton> to continue.
de: Im nächsten Fenster kann man eventuelle besondere Vorwahlen angeben - falls man für eine Amtsleitung eine <quote>0</quote> vorwählen muss ode Ähnliches. Danach wählt man <guibutton>Weiter</guibutton>.

source: And that's all! If you want to revisit any of your choices, you can use the <guibutton>Back</guibutton> and <guibutton>Next</guibutton> buttons to move back and forth through the dialogs. When you're happy, press the <guibutton>Finish</guibutton> button, and you're all done.
de: Das war alles. Falls man eine der Eintragungen ändern möchte, kann man mit Hilfe der Knöpfe <guibutton>Zurück</guibutton> und <guibutton>Weiter</guibutton> zwischen den Dialogfenstern wechseln. Wenn alle Einstellungen richtig sind, klickt man auf <guibutton>Abschließen</guibutton>.

source: Of course, any of this information can be edited at a later time, from the &kppp; Configuration dialog.
de: Natürlich können alle Eintragungen später mit Hilfe des Einrichtungsdialoges von &kppp; geändert werden.
