Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdenetwork/kppp_security.po
Languages: de

source: &kppp; and security issues
de: &kppp; und die Sicherheit

source: This section is mainly for superusers (<systemitem>root</systemitem>) people with high security demands, or simply technically interested people. It is not necessary to read this if you only use &Linux; at home for yourself, although you may learn a thing or two in any case.
de: Dieses Kapitel ist hauptsächlich für Administratoren(<systemitem>root</systemitem>), Leute mit hohen Sicherheitsansprüchen oder einfach technisch Interessierte. Es ist nicht notwendig, dieses Kapitel zu lesen, wenn Sie nur &Linux; für sich zu Hause laufen lassen (obwohl Sie vielleicht etwas Neues lernen könnten, wenn Sie es lesen).

source: Restricting access to &kppp;
de: Den Zugang zu &kppp; beschränken

source: A system administrator might want to restrict access as to who is allowed to use &kppp;. There are two ways to accomplish this.
de: Ein Systemadministrator möchte vielleicht Zugang zu &kppp; auf diejenigen beschränken, denen es erlaubt ist, es zu benutzen. Es gibt zwei Wege, dies zu tun:

source: Restricting access with group permissions
de: Den Zugang zu &kppp; durch Gruppenrechte beschränken

source: Create a new group (you might want to name it <systemitem>dialout</systemitem> or similar), and put every user that should be allowed to use &kppp; into that group. Then type at the prompt:
de: Man erstellt zunächst eine neue Benutzergruppe (sie könnte &eg; <systemitem>dialout</systemitem> heißen) und fügt jeden Benutzer, der &kppp; benutzen darf, zu dieser Gruppe hinzu. Dann tippt man folgendes ein:

source: This assumes that &kde; was installed in <filename class="directory"> /opt/kde/</filename> and that your new group is named <systemitem>dialout</systemitem>.
de: Dabei wird vorausgesetzt, dass sich &kde; in <filename class="directory">/opt/kde</filename> befindet und die neue Gruppe <systemitem>dialout</systemitem> heißt.

source: Restricting access &kppp;'s way
de: Den Zugang mit den Mitteln von &kppp; beschränken

source: Before doing anything, &kppp; checks if there is a file named <filename>/etc/kppp.allow</filename>. If such a file exists, only users named in this file are allowed to dial out. This file must be readable by everyone (but of course <emphasis>NOT</emphasis> writable.) Only login names are recognized, so you cannot use <acronym>UID</acronym>'s in this file. Here is a short example:
de: Beim Start überprüft &kppp;, ob eine Datei <filename>/etc/kppp.allow</filename> existiert. Falls es eine solche Datei gibt, können nur Benutzer, die in dieser Datei aufgelistet sin, eine Verbindung herstellen. Diese Datei muss für jeden Benutzer lesbar sein (natürlich <emphasis>nicht</emphasis> für jeden schreibbar). Nur Benutzernamen werden erkannt, man kann also keine <acronym>UID</acronym> verwenden. Hier ein kurzes Beispiel:

source: # /etc/kppp.allow # comment lines like this are ignored # as well as empty lines fred karl daisy
de: # /etc/kppp.allow # Kommentare und Leerzeilen werden ignoriert. # fred karl daisy

source: In the example above, only the users <systemitem>fred</systemitem>, <systemitem>karl</systemitem> and <systemitem>daisy</systemitem> are allowed to dial out, as well as every user with a <acronym>UID</acronym> of 0 (so you don't have to explicitly list root in the file).
de: Im obigen Beispei dürfen nur die Benutzer <systemitem>fred</systemitem>, <systemitem>karl</systemitem> und <systemitem>daisy</systemitem> eine Verbindung herstellen. Außerdem darf das jeder Benutzer mit der <acronym>UID</acronym> 0 (daher muss root nicht explizit genannt werden).

source: &kppp; has the <acronym>SUID</acronym> bit on? What about security?
de: &kppp; hat das <acronym>SUID</acronym>-Bit gesetzt. Wo bleibt die Sicherheit?

source: It's virtually impossible to write a dialer without the <acronym>SUID</acronym> bit that is both safe and easy to use for inexperienced users. &kppp; addresses the security issues with the following strategy.
de: Es ist realistisch gesehen nicht möglich, ein Wählprogramm ohne gesetztes <acronym>SUID</acronym>-Bit zu schreiben, das sicher und dabei für unerfahrene Benutzer einfach zu benutzen ist. &kppp; geht das Sicherheitsproblem mit folgender Strategie an:

source: Immediately after the program starts, &kppp; forks.
de: Gleich nach dem Programmstart startet &kppp; einen neuen Prozess.

source: The master process, which handles all the <acronym>GUI</acronym> operations (such as user interaction), drops the <acronym>SUID</acronym> state after the fork, and runs with normal user privileges.
de: Der Masterprozess (der die <acronym>GUI</acronym>, Benutzerinteraktion u.ä. verwaltet) legt den <acronym>SUID</acronym>-Status danach ab und läuft dann mit den normalen Benutzerprivilegien.

source: The slave process keeps its privileges, and is responsible for all actions that need <systemitem>root</systemitem> privileges. To keep this part safe, no &kde; or &Qt; library calls are used here, just simple library calls. The source code for this process is short (around 500 lines) and well documented, so it's easy for you to check it for security holes.
de: Der Slaveprozess behält seine Privilegien bei und kümmert sich um alles, für das man <systemitem>root</systemitem>-Rechte benötigt. Um diesen Teil sicher zu machen, werden hier keine Funktionen der &kde;-/&Qt;-Bibliotheken aufgerufen, sondern nur einfache Funktionen der C-Bibliothek. Der Quellcode für diesen Prozess ist kurz (etwa 500 Zeilen) und gut dokumentiert. Dadurch ist es einfach, Sicherheitslöcher zu entdecken.

source: Master and slave processes communicate with standard &UNIX; <acronym>IPC</acronym>.
de: Master- und Slaveprozess kommunizieren mit standard &UNIX; <acronym>IPC</acronym>.

source: Special thanks to Harri Porten for writing this excellent piece of code. It was thought to be impossible, but he managed it within a week.
de: Vielen Dank an Harri Porten für das Schreiben dieses exzellenten Quelltextes. Ich dachte, es sei unmöglich - er schrieb es in einer Woche.
