Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdenetwork/kppp_tricks.po
Languages: de

source: Modem Tricks and Hints
de: Modem-Tricks &amp; -Hinweise

source: This section should get the fearful started on the (not so) arcane art of modem tweaking. The commands here are all Hayes AT standard, but all modems are not equal, so your mileage may vary.
de: Dieser Abschnitt soll den schwierigen Einstieg in die (nicht so) hohe Kunst der Modemeinstellung bieten. Die Befehle hier sind alle Hayes-AT-Standard, aber nicht alle Modems sind gleich, sodass Ihre Vorgangsweise unterschiedlich sein kann.

source: Modem Sessions
de: Modemsitzungen

source: A Modem session allows you to interact with the modem directly. You type commands, and it will respond. To obtain a modem session, when no connection is active, open the <guilabel>Configure &kppp;</guilabel> dialog, select to edit a modem and then click the <guibutton>Terminal</guibutton> button on the <guilabel>Modem</guilabel> tab. This will open a window for interactive configuration of the modem. Try typing <userinput><command>ATZ</command></userinput> (which resets your modem) Your should get an OK response. Use <menuchoice><guimenu>File</guimenu><guimenuitem>Close</guimenuitem></menuchoice> to end the session.
de: Eine Modemsitzung gibt Ihnen die Möglichkeit, direkt mit dem Modem zu interagieren. Sie geben Befehle ein und es antwortet. Um eine Modemsitzung zu starten, wenn keine Verbindung aktiv ist, öffnen Sie den Dialog <guilabel>&kppp;-Einrichtung</guilabel>, wählen Sie ein Modem aus und drücken <guibutton>Terminal</guibutton> auf der Karteikarte <guilabel>Modem</guilabel>. Das öffnet ein Fenster zur interaktiven Konfiguration des Modems. Versuchen Sie, <literal>ATZ</literal> einzugeben (das setzt Ihr Modem zurück). Sie sollten eine <literal>OK</literal>-Antwort erhalten. Benutzen Sie <quote>Datei/Beenden</quote>, um die Sitzung zu beenden.

source: Modem Profiles
de: Modemprofile

source: One reason you might want to send the modem commands directly is if you have a set of modem configurations you want to keep, and not have to specify for every connection. A good way to do that is via modem profiles. Modems can have several stored profiles numbered 0,1,... <command>AT&amp;V</command> can be used to view them all. The default profile is usually 0 (this can be changed via <command>AT&amp;Y</command>.) The profile currently in use is called the <quote>active</quote> profile.
de: Ein Grund, weshalb Sie dem Modem direkt Befehle senden möchten, könnte sein, dass Sie mehrere Modemeinstellungen haben, die Sie behalten und nicht für jede Verbindung eingeben möchten. Ein guter Weg, dies zu tun, führt über Modemprofile. Modems können mehrere gespeicherte Profile haben, nummeriert mit 0,1, ... <command>AT&amp;V</command> kann zur genutzt werden, um alle anzusehen. Das Standardprofil ist üblicherweise 0 (das kann über <command>AT&amp;Y</command> geändert werden). Das derzeit verwendete Profil wird <quote>aktives</quote> Profil genannt.

source: When you change a setting, the active profile is modified. The <command>ATZ</command> command will have the modem load the default profile, erasing any changes you have made. To save changes, Load the profile you want to change via <command>ATZ<replaceable>n</replaceable></command> (where <replaceable>n</replaceable> is the profile number). Make the changes you want, then save it with <command>AT&amp;W<replaceable>n</replaceable></command>. To have kppp use the profile you want, change the modem initialization string (<guibutton>Modem Commands</guibutton> <guilabel>Initialization String</guilabel> on the <guilabel>Modem</guilabel> tab). For example <command>ATZ1</command> will have the kppp reset the modem and use stored profile #1.
de: Wenn Sie eine Einstellung ändern, wird das aktive Profil verändert. Der <command>ATZ</command>-Befehl veranlasst das Modem, das Standardprofil zu laden und alle Ihre Änderungen zu verwerfen. Um Änderungen zu speichern, laden Sie das Profil, das Sie ändern möchten über <command>ATZ<replaceable>n</replaceable></command> (wobei <replaceable>n</replaceable> die Profilnummer ist). Machen Sie die gewünschten Änderungen, dann speichern Sie sie mit <command>AT&amp;W<replaceable>n</replaceable></command>. Damit &kppp; das von Ihnen gewünschte Profil nutzt, ändern Sie den Initialisierungs-String (<guibutton>Modembefehle</guibutton> <guilabel>Init-Zeichenfolge 1</guilabel> auf der Karteikarte <guilabel>Modem</guilabel>). Zum Beispiel bewirkt <command>ATZ1</command>, dass &kppp; das Modem zurücksetzt und das gespeicherte Profil #1 lädt.

source: If you want reset you modem to get back to some known starting point, use <command>AT&amp;F&amp;W</command> to set the active profile to the factory defaults, and store those settings as the default profile.
de: Falls Sie Ihr Modem auf einen bekannten Urzustand zurücksetzen möchten, benutzen Sie <command>AT&amp;F&amp;W</command>, um das aktive Profil auf die Fabrikeinstellungen zu setzen, und diese im Standardprofil zu sichern.

source: Examples of profile changes are in the next section
de: Beispiele von Profiländerungen finden Sie im nächsten Abschnitt.

source: Getting the modem to hang up
de: Das Modem zum Auflegen bewegen

source: Sometimes you may find that &kppp; has difficulties hanging up the modem. This is likely the result of a mismatch between &kppp; settings and those of the modem. A standard modem uses two methods to decide to hangup: <link linkend="hangup-command-method">Command</link>, and <link linkend="hangup-dtr-method"><acronym>DTR</acronym></link>. The Command method involves sending an escape sequence to the modem, which puts it in command mode, then issuing the hangup command (<command>ATH</command>).
de: Manchmal könnte &kppp; Schwierigkeiten beim Auflegen des Modem haben. Das ist vermutlich die Folge eines Unterschieds zwischen den Einstellungen von &kppp; und denen des Modems. Ein Standardmodem nutzt zwei Methoden, um sich zum Auflegen zu entscheiden: Befehl und DTR. Die Befehlsmethode besteht aus dem Senden einer Abbruchsequenz an das Modem, das es in den Befehlsmodus versetzt, und dann dem Senden des Auflegen-Befehls (<command>ATH</command>).

source: Outside of &kppp;, when configuring the <application>pppd</application> package manually, it's often helpful to use the command method, so that one can exit a terminal session, and then start <application>pppd</application> without having the modem hangup. In most other situations, the <acronym>DTR</acronym> method is preferred, as it is simpler.
de: Außerhalb von &kppp;, wenn Sie das <application>pppd</application>-Paket manuell konfigurieren, ist es oft hilfreich die Befehlsmethode zu nutzen, sodass Sie eine Terminalsitzung verlassen können, und dann <application>pppd</application> starten, ohne das Modem auflegen zu lassen. In den meisten anderen Situationen wird die <acronym>DTR</acronym>-Methode bevorzugt, weil sie einfacher ist.

source: <acronym>DTR</acronym> (<command>AT&amp;Dn</command>) method
de: <acronym>DTR</acronym> (<command>AT&amp;Dn</command>)-Methode

source: The <acronym>DTR</acronym> method will have the modem hangup whenever &kppp; stops using the modem. If you obtain a modem session, and query the state via <command>AT&amp;V</command>, and you can see among the displayed settings for the active profile a <command>&amp;D0</command>, then the <acronym>DTR</acronym> hangup method is disabled. To enable the <acronym>DTR</acronym> method, use the <guibutton>Terminal</guibutton> button to get a modem session, then:
de: Die <acronym>DTR</acronym>-Methode lässt das Modem immer dann auflegen, wenn &kppp; es nicht mehr nutzt. Wenn Sie eine Modemsitzung starten und den Zustand über <command>AT&amp;V</command> abfragen, und unter den angezeigten Einstellungen für das aktive Profil ist auch <command>&amp;D0</command>, dann ist die <acronym>DTR</acronym>-auflegen-Methode abgeschaltet. Um <acronym>DTR</acronym> einzuschalten, benutzen Sie <guibutton>Terminal</guibutton>, um eine Modemsitzung zu starten. Dann:

source: <userinput><command>ATZ</command></userinput> <lineannotation># reset to default profile</lineannotation> <userinput><command>AT&amp;D2</command></userinput> <lineannotation># Set to hang up on DTR drop</lineannotation> <userinput><command>AT&amp;W</command></userinput> <lineannotation># Write to default profile</lineannotation>
de: <userinput><command>ATZ</command></userinput> <lineannotation># Standardprofil wählen</lineannotation> <userinput><command>AT&amp;D2</command></userinput> <lineannotation># Auflegen nach DTR-auflegen</lineannotation> <userinput><command>AT&amp;W</command></userinput> <lineannotation># Als Standardprofil speichern</lineannotation>

source: How the <acronym>DTR</acronym> method works
de: Wie die <acronym>DTR</acronym>-Methode funktioniert

source: Whenever the Data Terminal Ready (<acronym>DTR</acronym>) line on the serial line between the host computer and the modem goes high, the modem hangs up. When &kppp; opens the serial port, the <acronym>DTR</acronym> line is pulled low, on an external modem, you can see the <acronym>DTR</acronym> (or <acronym>TR</acronym>) light come on when this happens. When the <acronym>TR</acronym> light goes out (because &kppp; has closed the serial port, or something worse!), the modem will hangup.
de: Jedesmal wenn die Data Terminal Ready (<acronym>DTR</acronym>)-Leitung der seriellen Verbindung zwischen dem Computer und dem Modem Spannung führt, legt das Modem auf. Wenn &kppp; die serielle Schnittstelle öffnet, wird dir <acronym>DTR</acronym>-Leitung auf niedrige Spannung gesetzt, und bei einem externen Modem können Sie das <acronym>DTR</acronym> (oder <acronym>TR</acronym>)-Lämpchen angehen sehen, wenn das passiert. Wenn das <acronym>TR</acronym>-Lämpchen ausgeht (weil &kppp; die serielle Schnittstelle geschlossen hat, oder Schlimmeres!), legt das Modem auf.

source: Command method
de: Befehlsmethode

source: The other way to have a modem hang up when connected (used when <command>AT&amp;D<replaceable>n</replaceable></command> where <replaceable>n</replaceable> is not <returnvalue>2</returnvalue>) is to have the modem accept the command when a session is in progress. To have it hang up properly, get a modem session, and set the guard time to a short interval like so:
de: Der andere Weg, ein Modem auflegen zu lassen, wenn man verbunden ist (mit <command>AT&amp;D<replaceable>n</replaceable></command>, wobei <replaceable>n</replaceable> nicht 2 ist), ist, das Modem den Befehl annehmen zu lassen, wenn eine Sitzung läuft. Um es richtig auflegen zu lassen, starten Sie eine Modemsitzung und stellen Sie die Guardzeit auf ein kleines Intervall ein, wie folgt:

source: Then use the <guilabel>Guard Time</guilabel> slider in the Modem commands section to match the register (<varname>S12</varname> to this value <returnvalue>5</returnvalue>. The modem should then hangup properly.
de: Dann benutzen Sie den <emphasis>Einstellungen/Modem/Modembefehle/Guard-Zeit</emphasis>-Regler, um den Wert aus Register (S12) auf (5) einzustellen. Das Modem sollte dann richtig auflegen.

source: How the Command Method Works
de: Wie die Befehlsmethode funktioniert

source: When the local modem is connected to a remote modem, it is in the <quote>connect</quote> state, where it passes all characters it receives to the remote modem without interpretation. To have the modem accept the characters as commands for itself, one must put the modem into the command state. The escape code does this.
de: Wenn das lokale Modem mit einem entfernten Modem verbunden ist, ist es im <quote>connect</quote>-Zustand, in dem es alle empfangenen Zeichen, ohne sie auszuwerten, an das entfernte Modem weitergibt. Damit das Modem Befehle für sich selbst annimmt, muss man das Modem in den Befehlszustand versetzen. Der Abbruchcode macht dies.

source: The escape code is defined as being three intervals of time whose length is defined by <varname>S12</varname> in fiftieths of a second.
de: Der Abbruchcode ist definiert als drei Zeitintervalle, deren Länge durch <varname>S12</varname> definiert wird (in fünfzigstel Sekunden).

source: Quiet (must last more than <varname>S12</varname>/50 seconds)
de: Ruhe (muss mindestens <varname>S12</varname>/50 Sekunden dauern)

source: Escape character (defined by the register <varname>S2</varname>, the default is <quote>+</quote>), repeated three times (less than <varname>S12</varname>/50 seconds between each.
de: Abbruchzeichen (definiert durch Register <varname>S2</varname>, Standard ist <quote>+</quote>) drei Mal wiederholt (weniger als <varname>S12</varname>/50 Sekunden zwischen jedem)

source: Once the modem is in the command state, you can send it commands. To have it hang up, send the command <command>ATH</command>. The escape codes and the hangup string used by &kppp; are shown in the <link linkend="modem-commands"><guilabel>Modem Commands</guilabel></link> dialog. These should match your modem.
de: Sobald das Modem im Befehlsmodus ist, können Sie ihm Befehle senden. Um es auflegen zu lassen, senden Sie <command>ATH</command>. Die Abbruchcodes und die Auflegenfolge, die &kppp; nutzt, werden im <emphasis>Einstellungen/Modem/Modembefehle</emphasis>-Dialog angezeigt. Diese sollten zu Ihrem Modem passen.

source: Make Tone dialing faster
de: Tonwahl beschleunigen

source: If you can use tone dialing, the amount of time it takes to dial can be changed using the <varname>S11</varname> register. It gives the duration (in 100hundreds of a second) to send each tone while dialing. The default is usually 95 (almost a second.) How fast you can dial depends on the phone company's switching equipment which handles your line. The minimum duration is 50, almost twice as fast, and that speed often works.
de: Falls Sie Tonwahl nutzen können, kann die Zeit, die zum Wählen benötigt wird, mit dem <varname>S11</varname>-Register verändert werden. Es gibt die Dauer (in hundertstel Sekunden) an, um einen Ton während der Wahl zu senden. Der Standard ist üblicherweise 95 (fast eine Sekunde). Wie schnell Sie wählen können, hängt von den Geräten Ihrer Telefongesellschaft ab. Die minimale Dauer ist 50, fast doppelt so schnell, und diese Geschwindigkeit funktioniert häufig.

source: <userinput><command>ATZ</command></userinput> <lineannotation># reset to default profile</lineannotation> <userinput><command>ATS11=50</command></userinput> <lineannotation># fastest possible dialing, use a higher number if it doesn't work</lineannotation> <userinput><command>AT&amp;W</command></userinput> <lineannotation># write to default profile</lineannotation>
de: <userinput><command>ATZ</command></userinput> <lineannotation># Standardprofil auswählen</lineannotation> <userinput><command>ATS11=50</command></userinput> <lineannotation># schnellstmögliche Anwahl; verwenden Sie eine größere Zahl, falls es nicht funktioniert.</lineannotation> <userinput><command>AT&amp;W</command></userinput> <lineannotation># Als Standardprofil speichern</lineannotation>
