Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdenetwork/kppp_dialog-setup.po
Languages: de

source: Setting up a connection with the dialogs
de: Mit Hilfe von Dialogen eine Verbindung einrichten

source: Setting up a connection with the dialog based setup is not too much more difficult than using the wizard.
de: Die Einrichtung einer Verbindung mit Hilfe von Dialogen ist nicht wesentlich schwerer als die Verwendung des Assistenten.

source: You can reach the setup dialog the same way you did the wizard. Start &kppp; from your <guimenu>K</guimenu> menu, where you will find its entry in the <guisubmenu>Internet</guisubmenu> as <guimenuitem>Internet Dialer</guimenuitem>.
de: Der Einrichtungsdialog wird auf die gleiche Weise wie der Assistent aufgerufen. Man startet &kppp; aus dem <guimenu>K</guimenu>-Menü im Untermenü <guisubmenu>Internet</guisubmenu> unter der Bezeichnung <guimenuitem>Einwahl ins Internet</guimenuitem>.

source: The following dialog will appear:
de: Der folgende Dialog erscheint:

source: <screeninfo>The &kppp; dialer startup screen</screeninfo>
de: <screeninfo>Der &kppp;-Eingangsbildschirm</screeninfo>

source: <phrase>The &kppp; dialer startup screen</phrase>
de: <phrase>Der &kppp;-Eingangsbildschirm</phrase>

source: <para>The &kppp; dialer startup screen</para>
de: <para>Der &kppp;-Eingangsbildschirm</para>

source: It will probably not have any entries to begin with, and that's what we're about to do now.
de: Es befinden sich in diesem Fenster vermutlich keinerlei Einträge. Diese werden wir jetzt hinzufügen.

source: Click the <guibutton>Configure</guibutton> button to open the <guilabel>&kppp; Configuration</guilabel> dialog. On the <guilabel>Accounts</guilabel> tab select <guilabel>New...</guilabel> to begin setting up a new Internet connection.
de: Klicken Sie auf den Knopf <guibutton>Einrichten</guibutton>, um den Dialog <guilabel>&kppp;-Einrichtung</guilabel> zu öffnen. Auf der Karteikarte <guilabel>Zugänge</guilabel> wählen Sie <guibutton>Neu ...</guibutton> und geben die Zugangsdaten für eine neue Internetverbindung an.

source: This time, choose <guilabel>Manual Setup</guilabel> and you'll see the following Dialog appear:
de: Nun klickt Sie auf <guilabel>Manuelle Einrichtung</guilabel> und es erscheint der folgende Dialog:

source: <screeninfo>The <guilabel>New Account</guilabel> Dialog</screeninfo>
de: <screeninfo>Der Dialog <guilabel>Neuer Zugang</guilabel></screeninfo>

source: <phrase>The <guilabel>New Account</guilabel> Dialog</phrase>
de: <phrase>Der Dialog <guilabel>Neuer Zugang</guilabel></phrase>

source: <para>The <guilabel>New Account</guilabel> Dialog</para>
de: <para>Der Dialog <guilabel>Neuer Zugang</guilabel></para>

source: The <guilabel>New Account</guilabel> dialog contains the following sections:
de: Der Dialog <guilabel>Neuer Zugang</guilabel> enthält folgende Abschnitte:

source: Dial
de: Wählen

source: Login Script
de: Anmelde-Skript

source: Execute
de: Ausführen

source: Accounting
de: Abrechnung

source: You normally won't need to fill in all these, although each of them is described in the following sections.
de: Obwohl jeder Bereich im folgenden Abschnitt beschrieben wird, benötigt man in der Regel nicht alle auszufüllen.

source: The Dial tab
de: Die Karteikarte Wählen

source: <screeninfo>The Accounts <guilabel>Dial</guilabel> tab</screeninfo>
de: <screeninfo>Die Karteikarte <guilabel>Wählen</guilabel> des Zugangs</screeninfo>

source: <phrase>The Accounts <guilabel>Dial</guilabel> tab</phrase>
de: <phrase>Die Karteikarte <guilabel>Wählen</guilabel> des Zugangs</phrase>

source: <para>The Accounts <guilabel>Dial</guilabel> tab</para>
de: <para>Die Karteikarte <guilabel>Wählen</guilabel> des Zugangs</para>

source: The <guilabel>Dial</guilabel> tab has the following options:
de: Die Karteikarte <guilabel>Wählen</guilabel> enthält folgende Einstellmöglichkeiten:

source: Connection Name:
de: Zugangsname:

source: You must give the account a name. This can be anything you like, but if you have more than one account, each name must be unique.
de: Sie müssen einen Zugangsnamen angeben. Sie können einen beliebigen Namen wählen, aber wenn Sie mehrere Zugänge haben, muss dieser eindeutig sein.

source: Phone Number:
de: Telefonnummer:

source: Specify the phone number to dial. You can use characters such as <quote>-</quote> to make the number more legible. If you concatenate a series of numbers separated by a colon (&eg; <userinput>1111111:2222222:3333333</userinput>), &kppp; will try these numbers one after the other whenever it receives a busy signal. You can use the <guibutton>Add</guibutton> button to add another number, <guibutton>Remove</guibutton> to remove a number from the list, and the <guiicon>up</guiicon> and <guiicon>down</guiicon> arrows to change the order of the list.
de: Hier muss man die zu wählende Telefonnummer angeben. Man kann Zeichen wie <quote>-</quote> zur besseren Lesbarkeit der Nummer verwenden. Falls man mehrere durch Doppelpunkt getrennte Nummern verwendet (&eg; <userinput>111111:222222:333333</userinput>), versucht &kppp; diese Nummern nacheinander, solange ein Besetztzeichen ertönt. Man kann mit dem Knopf <guibutton>Hinzufügen</guibutton> eine weitere Nummer hinzufügen, durch <guibutton>Entfernen</guibutton> eine Nummer aus der Liste löschen, und mit Hilfe der Pfeilknöpfe <guiicon>Aufwärts</guiicon> und <guiicon>Abwärts</guiicon> die Reihenfolge der Nummern ändern.

source: Authentication
de: Authentifizierung

source: Choose the appropriate method of authentication that &kppp; should use to log into the server. Check with your provider for more information. Use of <acronym>PAP</acronym> and <acronym>CHAP</acronym> are described in the chapter <xref linkend="chap-and-pap"/>.
de: Wählen Sie die passende Authentifizierungsmethode, die &kppp; benutzen soll, um Sie bei Ihrem Provider anzumelden. Erkundigen Sie sich bei Ihrem Provider. Weitere Hinweise zu <acronym>PAP</acronym> oder <acronym>CHAP</acronym> findet man im Kapitel <xref linkend="chap-and-pap"/>.

source: Store password
de: Passwort speichern

source: Check this option if you want &kppp; to remember your password between sessions.
de: Aktivieren Sie diese Option, wenn &kppp; bei der nächsten Verbindung Ihr Passwort automatisch eingeben soll.

source: Customize pppd arguments...
de: pppd-Argumente bearbeiten...

source: This will bring up the <application>pppd</application> arguments dialog. You can use this dialog to add any desired options that you want &kppp; to hand to <application>pppd</application>. See the <application>pppd</application> man page for a list of available options, but unless you know exactly what you are doing, you should probably restrain yourself from tinkering with these.
de: Das öffnet den Dialog <application>pppd</application>-Argumente. Sie können diesen Dialog nutzen, um jede gewünschte Option hinzuzufügen, die &kppp; an <application>pppd</application> weitergeben soll. Sehen Sie in der <application>pppd</application>-Handbuchseite für eine Liste der verfügbaren Optionen nach. Solange Sie nicht genau wissen, was Sie tun, sollten Sie davon Abstand nehmen, an den <application>pppd</application>-Optionen herumzuspielen.

source: The IP tab
de: Die Karteikarte IP

source: <screeninfo>The Accounts <guilabel>IP</guilabel> tab</screeninfo>
de: <screeninfo>Die <guilabel>IP</guilabel>-Karteikarte für Zugänge</screeninfo>

source: <phrase>The Accounts <guilabel>IP</guilabel> tab</phrase>
de: <phrase>Die <guilabel>IP</guilabel>-Karteikarte für Zugänge</phrase>

source: <para>The Accounts <guilabel>IP</guilabel> tab</para>
de: <para>Die <guilabel>IP</guilabel>-Karteikarte für Zugänge</para>

source: Dynamic IP Address
de: Dynamische IP-Adresse

source: Check this if your <acronym>ISP</acronym> uses dynamic <acronym>IP</acronym> address assignment. In this case, your <acronym>IP</acronym> address will change every time you establish a connection.
de: Aktivieren Sie diese Option, wenn Ihr <acronym>ISP</acronym> dynamische <acronym>IP</acronym>-Adresszuweisung benutzt. Das bedeutet, dass sich Ihre <acronym>IP</acronym>-Adresse vermutlich bei jedem Verbindungsaufbau ändert.

source: Static IP Address
de: Statische IP-Adresse

source: Check this if your <acronym>ISP</acronym> has given you a static <acronym>IP</acronym> address. In that case you will also need to fill in that address in the <guilabel>IP Address</guilabel> box, and any <guilabel>Subnet Mask</guilabel> if applicable. Ask your <acronym>ISP</acronym> if unsure. Dynamically assigned addresses are used in the huge majority if <acronym>ISP</acronym>'s and leaving this checked will in most cases be the right choice.
de: Diese Option muss man markieren, falls man vom <acronym>ISP</acronym> eine statische <acronym>IP</acronym>-Adresse erhalten hat. Weiterhin muss diese Adresse im Feld <guilabel>IP-Adresse</guilabel> eingetragen werden und möglicherweise eine <guilabel>Subnetz-Maske</guilabel>. Bei Unsicherheit sollte man seinen <acronym>ISP</acronym> befragen. Meistens werden von <acronym>ISP</acronym>s dynamische Adressen verwendet, sodass man dieses Feld in der Regel nicht markieren muss.

source: Auto-configure hostname from this IP
de: Rechnernamen automatisch von dieser IP einrichten

source: Select this option if you want &kppp; to set the hostname and domain for your machine after a successful <acronym>ppp</acronym> connection.
de: Dieses Ankreuzfeld muss man markieren, falls &kppp; den Rechnernamen und den Domain-Namen nach dem Aufbau einer <acronym>ppp</acronym>-Verbindung automatisch einstellen soll.

source: This is done by querying the defined Domain Name Server with the <acronym>IP</acronym> assigned for the <acronym>ppp</acronym> link.
de: Das wird durch die Abfrage des angegebenen Domain Nameservers mit der für die <acronym>ppp</acronym>-Verbindung zugeordneten <acronym>IP</acronym>-Adresse erreicht.

source: This option is useful for those stand-alone machines which want to use protocols such as talk, which require the hostname to be the same as your machine is known on the internet. It overrides the <guilabel>Domain Name</guilabel> option in the <guilabel>DNS</guilabel> section, and the machine defaults are restored to their original values when you close the <acronym>ppp</acronym> connection.
de: Dieses Ankreuzfeld ist sinnvoll für diejenigen Einzelplatzrechner, die Protokolle wie talk verwenden möchten, für die der Rechnername mit dem im Internet bekannten Namen übereinstimmen muss. Die Einstellung hat Vorrang vor <guilabel>Domain-Name</guilabel> auf der Karteikarte <guilabel>DNS</guilabel>. Die Standardwerte werden beim Beenden der <acronym>ppp</acronym>-Verbindung automatisch wieder hergestellt.

source: This option is <emphasis>not</emphasis> useful if you just want to connect to the internet and surf, check mail, or chat. It has the side-effect of disallowing any new connections to your X server - in other words, you can't open any more <acronym>GUI</acronym> programs.
de: Die Einstellung ist <emphasis>nicht</emphasis> sinnvoll, wenn man nur eine Verbindung zum Surfen, Chatten oder Nachrichten herunterladen aufbaut. Es gibt einen Seiteneffekt: Es sind keine neuen Verbindungen zum eigenen X-Server mehr möglich - mit anderen Worten, man kann keine neuen <acronym>GUI</acronym>-Programme mehr starten.

source: Only turn this on if you are absolutely sure you need it.
de: Dieses Ankreuzfeld sollte man daher nur dann markieren, wenn es unbedingt notwendig ist.

source: The Gateway tab
de: Die Karteikarte Gateway

source: <screeninfo>The Accounts <guilabel>Gateway</guilabel> tab</screeninfo>
de: <screeninfo>Die Karteikarte <guilabel>Gateway</guilabel> für Zugänge</screeninfo>

source: <phrase>The Accounts <guilabel>Gateway</guilabel> tab</phrase>
de: <phrase>Die Karteikarte <guilabel>Gateway</guilabel> für Zugänge</phrase>

source: <para>The Accounts <guilabel>Gateway</guilabel> tab</para>
de: <para>Die Karteikarte <guilabel>Gateway</guilabel> für Zugänge</para>

source: Default Gateway
de: Standard-Gateway

source: Check this if you want <application>pppd</application> to use the default Gateway for your machine. This is the default.
de: Wählen Sie das, wenn <application>pppd</application> den Standard-Gateway für Ihre Maschine verwenden soll.

source: Static Gateway
de: Fester Gateway-Rechner

source: Check this if you want to specify the Gateway to be used in place of the default.
de: Wählen Sie diese Einstellung, wenn Sie den zu benutzenden Gateway angeben möchten.

source: Assign the Default Route to this Gateway
de: Standardroute auf diesen Gateway setzen

source: You almost certainly will need this to be checked (the default).
de: Dieses Ankreuzfeld muss fast mit Sicherheit markiert sein (Standard).

source: The DNS tab
de: Die Karteikarte DNS

source: <screeninfo>The Accounts <guilabel>DNS</guilabel> tab</screeninfo>
de: <screeninfo>Die Karteikarte <guilabel>DNS</guilabel> für Zugänge</screeninfo>

source: <phrase>The Accounts <guilabel>DNS</guilabel> tab</phrase>
de: <phrase>Die Karteikarte <guilabel>DNS</guilabel> für Zugänge</phrase>

source: <para>The Accounts <guilabel>DNS</guilabel> tab</para>
de: <para>Die Karteikarte <guilabel>DNS</guilabel> für Zugänge</para>

source: Domain Name:
de: Domänenname:

source: Specify the domain name for your machine. As with <acronym>DNS</acronym> addresses, it is restored to the original specified in <filename>/etc/resolv.conf</filename> when the connection goes down. If it is left blank, no changes are made to the domain name specified in <filename>/etc/resolv.conf</filename>
de: Geben Sie den Domänennamen für Ihre Maschine an. Wie bei <acronym>DNS</acronym>-Adressen wird dies auf die ursprünglichen Angaben aus <filename>/etc/resolv.conf</filename> zurückgesetzt, wenn die Verbindung beendet wird. Falls Sie hier nichts eintragen, werden keine Änderungen am Domänennamen vorgenommen, der in <filename>/etc/resolv.conf</filename> angegeben ist.

source: Configuration:
de: Einrichtung

source: Choose between <guilabel>Automatic</guilabel> (the <acronym>ISP</acronym> will automatically issue you <acronym>DNS</acronym> server addresses when you connect) and <guilabel>Manual</guilabel>. If you choose manual, the <guilabel>DNS IP Address</guilabel> section is then enabled.
de: Man kann zwischen <guilabel>Automatisch</guilabel> (der <acronym>ISP</acronym> stellt automatisch <acronym>DNS</acronym>-Serveradressen beim Verbindungsaufbau bereit) und <guilabel>Manuell</guilabel>. Falls man manuell wählt, wird das Eingabefeld <guilabel>DNS-IP-Adresse</guilabel> aktiviert.

source: DNS IP Address
de: DNS-IP-Adresse

source: This section is only enabled if you chose <guilabel>Manual</guilabel> in the previous option. Add the Domain Name Servers assigned to you by your <acronym>ISP</acronym>. You must specify at least one Domain Name Server for your <acronym>OS</acronym> to be able to resolve human readable <acronym>IP</acronym> addresses such as <systemitem>ftp.kde.org</systemitem>. The <acronym>DNS</acronym> server addresses supplied must be in numeric form, &eg; <systemitem>128.231.231.233</systemitem>. These addresses will be added at runtime to <filename>/etc/resolv.conf</filename>.
de: Fügen Sie die Domain Name Server von Ihrem ISP an. Sie müssen mindestens einen Domain Name Server angeben, um menschlich lesbare IP-Adressen wie <systemitem>ftp.kde.org</systemitem> aufzulösen. Die angegebenen DNS-Serveradressen müssen in numerischer Form vorliegen, &eg; <systemitem>128.231.231.233</systemitem>. Die Adressen werden zur Laufzeit zu denen aus <filename>/etc/resolv.conf</filename> hinzugefügt.

source: Choose the <guibutton>Add</guibutton> button to add each new <acronym>DNS</acronym> server address to the list box below. Choose <guibutton>Remove</guibutton> to remove an entry from the list.
de: Um eine neue <acronym>DNS</acronym>-Adresse zur DNS-Adressliste hinzuzufügen, wählt man den Knopf <guibutton>Hinzufügen</guibutton>. Mit dem Knopf <guibutton>Entfernen</guibutton> kann man Einträge aus der Liste löschen.

source: Disable existing DNS Servers during Connection
de: Bereits vorhandene DNS-Server während der Verbindung deaktivieren

source: If you check this box, any <acronym>DNS</acronym> servers listed in <filename>/etc/resolv.conf</filename> will be disabled while the connection remains up.
de: Falls man dieses Ankreuzfeld markiert, werden alle <acronym>DNS</acronym>-Server, die in der Datei <filename>/etc/resolv.conf</filename> aufgelistet sind, deaktiviert, solange die Verbindung besteht.

source: The Login Script tab
de: Die Karteikarte Anmelde-Skript

source: <screeninfo>The Accounts <guilabel>Login Script</guilabel> tab</screeninfo>
de: <screeninfo>Die Karteikarte <guilabel>Anmelde-Skript</guilabel> für Zugänge</screeninfo>

source: <phrase>The Accounts <guilabel>Login Script</guilabel> tab</phrase>
de: <phrase>Die Karteikarte <guilabel>Anmelde-Skript</guilabel> für Zugänge</phrase>

source: <para>The Accounts <guilabel>Login Script</guilabel> tab</para>
de: <para>Die Karteikarte <guilabel>Anmelde-Skript</guilabel> für Zugänge</para>

source: Use this dialog to compose a dial in script for your <acronym>ISP</acronym> dialup connection. You can use the mini-terminal and the information supplied by your <acronym>ISP</acronym> to find out what sequence of actions needs to be executed.
de: Mit diesem Dialog können Sie ein Einwahlskript für Ihren <acronym>ISP</acronym> erstellen. Benutzen Sie das Mini-Terminal und die Informationen von Ihrem <acronym>ISP</acronym>, um herauszufinden, welche Reihenfolge von Aktionen ausgeführt werden muss.

source: Choose an option from the drop down box on the left, and then add any parameters for that action in the edit box on the right. Use <guibutton>Add</guibutton> to add each entry to the <emphasis>bottom</emphasis> of the script, which is displayed in the lower part of the dialog. Use <guibutton>Insert</guibutton> to insert an entry anywhere in the script, and use <guibutton>Remove</guibutton> to delete a line from the script.
de: Man wählt eine Möglichkeit aus dem Auswahlfeld auf der linken Seite und trägt alle Parameter in das Eingabefeld rechts davon ein. Dann betätigt man den Knopf <guibutton>Hinzufügen</guibutton>, um diesem Eintrag an das <emphasis>Ende</emphasis> der unten angezeigten Befehlsliste anzuhängen. Mit Hilfe von <guibutton>Einfügen</guibutton> kann man den Eintrag an beliebiger Stelle einfügen, und mit <guibutton>Entfernen</guibutton> kann man einen Eintrag aus der Liste löschen.

source: The options available are:
de: Die Auswahlmöglichkeiten sind:

source: &kppp; will wait for the specified string to be received.
de: &kppp; wartet auf den Empfang der angegebenen Zeichenfolge.

source: &kppp; will send the specified string.
de: &kppp; sendet die angegebene Zeichenfolge.

source: &kppp; will scan the input stream for the specified string, and will store any character from the end of the string up to the next newline, in an internal buffer. Trailing and leading whitespace will be stripped off.
de: &kppp; durchsucht die eingehenden Daten nach der gegebenen Zeichenfolge und speichert die darauffolgenden Zeichen bis zum nächsten Zeilenumbruch in einem internen Puffer. Leerzeichen am Anfang und Ende der gespeicherten Zeichenfolge werden entfernt.

source: Permanently store the previously scanned string in the specified register. Currently the only valid register is <varname>password</varname>.
de: Speichert die vorher mit <quote>Scan</quote> gesuchte Zeichenkette permanent im angegebenen Register. Das einzige gültige Register ist bisher <varname>password</varname>.

source: Pause for the specified number of seconds.
de: Die angegebene Anzahl Sekunden warten.

source: &kppp; will send the <command>hangup</command> to the modem.
de: &kppp; sendet den Aufhängen-Befehl an das Modem.

source: &kppp; will set the modem into answer mode.
de: &kppp; versetzt das Modem in den Antwort-Modus.

source: Change the default timeout to the specified number of seconds dynamically during the script. You can change the timeout several times during script execution if necessary.
de: Ändert die Standard-Zeitüberschreitung auf die angegebene Anzahl Sekunden dynamisch während der Skript-Ausführung. Sie können dies während der Skript-Ausführung mehrmals tun, falls nötig.

source: Prompt the &kppp; user to enter a string, given the specified string as a hint. The user will see what is typed. If the specified string includes the mark <userinput>##</userinput>, the mark will be replaced with the current content of the internal scan buffer, as previously stored with the <guilabel>scan</guilabel> command.
de: Bittet den &kppp;-Benutzer, eine Zeichenkette einzugeben, mit der angegebenen Zeichenfolge als Hinweis. Der Benutzer sieht dabei, was er eingibt. Wenn die angegebene Zeichenfolge die Marke <userinput>##</userinput> enthält, wird diese durch den Inhalt des internen Puffers ersetzt, der durch den letzten <guilabel>Scan</guilabel>-Befehl gespeichert wurde.

source: Prompt the &kppp; user to enter a string, given the specified string as a hint. An asterisk will be printed for each character the user types.
de: Bittet den &kppp;-Benutzer, eine Zeichenkette einzugeben, mit der angegebenen Zeichenfolge als Hinweis. Der Benutzer sieht ein Sternchen für jedes eingegebene Zeichen.

source: <guilabel>ID</guilabel>
de: <guilabel>IP</guilabel>

source: If the <guilabel>Login ID</guilabel> field on &kppp;'s main dialog is filled in, send that <acronym>ID</acronym>. If the <guilabel>Login ID</guilabel> field is not filled in, prompt the &kppp; user to enter an <acronym>ID</acronym>, given the specified string as a hint. The user will see what is typed. On a second pass, such as in a loop on a second iteration, or during callback authentication, the prompt will be displayed regardless of whether the <guilabel>Login ID</guilabel> field is filled in.
de: Falls das <guilabel>Benutzername</guilabel>-Feld in &kppp;'s-Hauptfenster ausgefüllt ist, wird dieser Benutzername gesendet. Falls das <guilabel>Benutzername</guilabel>-Feld nicht ausgefüllt ist, wird der &kppp;-Benutzer nach seinem Benutzernamen gefragt, mit der angegebenen Zeichenfolge als Hinweis. Der Benutzer sieht, was er eingibt. Bei einem zweiten Aufruf, zum Beispiel aus einer Schleife oder bei Authentifizierung durch Rückruf, wird in jedem Fall eine Eingabe gefordert mit der angegebenen Zeichenfolge als Hinweis.

source: If the <guilabel>Password</guilabel> field on &kppp;'s main dialog is filled in, send that password. If the <guilabel>Password</guilabel> field is not filled in, prompt the &kppp; user to enter a password, with the specified string as a hint. An asterisk will be printed for each character typed. On a second pass, such as in a loop on a second iteration, or during callback authentication, the prompt will be displayed regardless of whether the <guilabel>Password</guilabel> field is filled in.
de: Wenn das <guilabel>Passwort</guilabel>-Feld in &kppp;'s-Hauptfenster ausgefüllt ist, wird dieses gesendet. Falls nicht, wird der &kppp;-Benutzer aufgefordert, ein Passwort einzugeben, mit der angegebenen Zeichenfolge als Hinweis. Es wird ein Sternchen für jedes eingegebene Zeichen ausgegeben. Bei einem zweiten Aufruf, zum Beispiel aus einer Schleife oder bei Authentifizierung durch Rückruf, wird in jedem Fall eine Eingabe gefordert mit der angegebenen Zeichenfolge als Hinweis.

source: &kppp; will wait for the specified string to be received. It will save the string for use by <varname>LoopEnd</varname>.
de: &kppp; wartet auf den Empfang der angegebenen Zeichenkette. Die Zeichenkette wird gespeichert für die Nutzung durch <varname>LoopEnd</varname>.
