Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdenetwork/kppp_hayes.po
Languages: de

source: <command>&amp;W0</command> or <command>&amp;W</command>
de: <command>&amp;W0</command> oder <command>&amp;W</command>

source: Store profile
de: Profil speichern

source: In <acronym>NVRAM</acronym> (<command>&amp;W0</command>, <command>&amp;W1</command> etc. for multiple profiles) Some settings cannot be stored. These often don't show on <command>&amp;V</command> or <command>ATI4</command>
de: Im <acronym>NVRAM</acronym> (<command>&amp;W0</command>, <command>&amp;W1</command> &etc; bei mehreren Profilen). Einige Einstellungen können nicht gespeichert werden. Diese werden häufig beim Befehl <command>&amp;V</command> oder <command>ATI4</command> nicht angezeigt.

source: <command>&amp;Y0</command> or <command>&amp;Y</command>
de: <command>&amp;Y0</command> oder <command>&amp;Y</command>

source: Select configuration loaded at power-up
de: Startkonfiguration auswählen

source: Load profile 0 (default)
de: Profil 0 laden (Standard)

source: Load profile 1
de: Profil 1 laden

source: Soft reset and load stored profile number <replaceable>n</replaceable>
de: Modem zurücksetzen und das gespeichert Profil Nummer <replaceable>n</replaceable> laden

source: Note that all items after the <command>&amp;Z</command> on the command line are ignored
de: Beachten Sie, dass alle Befehle nach dem <command>&amp;Z</command> in der Zeile ignoriert werden.

source: Backslash and Percent Commands
de: Befehle mit Schrägstrich links (Backslash) und Prozentzeichen

source: <command>\A0</command> or <command>\A</command>
de: <command>\A0</command> oder <command>\A</command>

source: Character maximum <acronym>MNP</acronym> block size
de: Maximale <acronym>MNP</acronym>-Zeichenblockgröße

source: 64 character maximum
de: 64-Zeichen-Maximum

source: 128 character maximum
de: 128-Zeichen-Maximum

source: 192 character maximum
de: 192-Zeichen-Maximum

source: 256 character maximum
de: 256-Zeichen-Maximum

source: <command>&percnt;C0</command> or <command>&percnt;C</command>
de: <command>&percnt;C0</command> oder <command>&percnt;C</command>

source: Data Compression Enable/Disable
de: Datenkompression aktivieren/deaktivieren

source: Disabled
de: Deaktiviert

source: MNP5 enabled
de: MNP5 aktiviert

source: V.42bis (<acronym>BTLZ</acronym>) Enabled
de: V.42bis (<acronym>BTLZ</acronym>) aktiviert

source: MNP5 &amp; V.42bis (<acronym>BTLZ</acronym>) Enabled
de: MNP5 &amp; V.42bis (<acronym>BTLZ</acronym>) aktiviert

source: <command>&percnt;D0</command> or <command>&percnt;D</command>
de: <command>&percnt;D0</command> oder <command>&percnt;D</command>

source: Data compression
de: Datenkompression

source: 512 BLTZ dictionary size
de: 512 BLTZ Dictionary-Größe

source: 1024 BLTZ dictionary size
de: 1024 BLTZ Dictionary-Größe

source: 2048 BLTZ dictionary size
de: 2048 BLTZ Dictionary-Größe

source: 4096 BLTZ dictionary size
de: 4096 BLTZ Dictionary-Größe

source: <command>&percnt;E0</command> or <command>&percnt;E1</command>
de: <command>&percnt;E0</command> oder <command>&percnt;E1</command>

source: Escape method
de: Abbruch-Methode

source: ESCAPE DISABLED
de: ESCAPE DEAKTIVIERT

source: <command>+++AT</command> method (default)
de: <command>+++AT</command>-Methode (Standard)

source: <computeroutput>Break</computeroutput> <command>AT</command> method
de: <computeroutput>Break</computeroutput> <command>AT</command>-Methode

source: BOTH methods enabled
de: Beide Methoden aktiviert

source: Disable <computeroutput>OK</computeroutput> to <command>+++</command>
de: <computeroutput>OK</computeroutput> für den Befehl <command>+++</command> deaktivieren

source: Enable <computeroutput>OK</computeroutput> to <command>+++</command>
de: <computeroutput>OK</computeroutput> für den Befehl <command>+++</command> aktivieren

source: <command>\J0</command> or <command>\J</command>
de: <command>\J0</command> oder <command>\J</command>

source: <acronym>DTE</acronym> Auto Rate Adjustment
de: <acronym>DTE</acronym> Datenrate automatisch anpassen

source: <acronym>DTE</acronym> rate is adjusted to match carrier rate.
de: <acronym>DTE</acronym> Rate wird an den Träger angepasst.

source: <command>\N0</command> or <command>\N</command>
de: <command>\N0</command> oder <command>\N</command>

source: Connection type
de: Verbindungstyp

source: Normal connection (see below for definitions)
de: Normale Verbindung (Definition siehe unten)

source: Direction connection
de: Direkte Verbindung

source: <acronym>MNP</acronym> Auto-reliable connection
de: <acronym>MNP</acronym> Auto-reliable Verbindung

source: Auto-reliable connection
de: Auto-reliable Verbindung

source: V.42bis reliable link with phase detection
de: V.42bis zuverlässige Verbindung mit Phasenerkennung

source: V.42bis auto-reliable link with phase detection
de: V.42bis auto-verlässliche Verbindung mit Phasenerkennung

source: V.42 reliable link with phase detection
de: V.42 verlässliche Verbindung mit Phasenerkennung

source: V.42 auto-reliable link with phase detection
de: V.42 auto-verlässliche Verbindung mit Phasenerkennung

source: A direct connection is a simple straight-through connection without any error connection or data compression. In this case, the computer-to-modem and modem-to-modem speeds must be identical.
de: Eine direkte Verbindung ist eine simple Verbindung ohne Fehlererkennung und Datenkompression. In diesem Falls muss die Verbindung Computer-Modem die gleiche Geschwindigkeit wie die Verbindung Modem-Modem haben.

source: A normal connection uses flow control (either software or hardware) to buffer the data being sent or received, so that the modem can transmit data at a different rate than the computer is actually sending or receiving it. For example, a computer may send actual data at 57kbps, but using compression, the modem only actually sends 28.8kbps. This is the mode use by most modems.
de: Eine normale Verbindung verwendet eine Flusskontrolle (entweder software- oder hardware-kontrolliert) um die gesendeten oder empfangenen Datenpakete zu puffern, sodass das Modem die Daten mit einer anderen Geschwindigkeit als der Computer übertragen kann. Zum Beispiel sendet vielleicht der Computer Daten mit 57kbps einschließlich Kompression und das Modem sendet nur mit 28.8kbps. Dieser Modus wird von den meisten Modems verwendet.

source: A reliable connection is a type of normal connection; if, for some reason, data compression or error correction cannot be established or maintained, the connection will hang up. (In essence, such a modem ensures that all connections are reliable, for it will hang up if the connection isn't.)
de: Eine verlässliche Verbindung ist eine Art von normaler Verbindung. Falls aus irgendeinem Grund die Fehlererkennung oder Kompression nicht eingerichtet oder beibehalten werden kann, wird die Verbindung getrennt. (Das Modem stellt sicher, dass alle übertragenen Daten korrekt sind oder es beendet die Verbindung).

source: Likewise, an auto-reliable connection is virtually the same, except that the modem will try to renegotiate the connection in order to establish a reliable connection. Again, this is the mode that most modems use.
de: Ähnlich verhält es sich mit einer auto-verlässlichen Verbindung. Das Modem versucht hierbei, die Übertragungsparameter so anzupassen, das die Verbindung wieder verlässlich wird. Das ist ebenfalls eine Methode, die die meisten Modems verwenden.

source: S-Registers
de: S-Register

source: S Registers
de: S Register

source: Range
de: Bereich

source: Default
de: Standard

source: Function
de: Funktion

source: 0-255 rings
de: 0-255 Klingelzeichen

source: Answer on ring number. Don't answer if 0
de: Antwortet beim angegebenen Klingelzeichen. Bei 0 wird nicht geantwortet

source: if <varname>S0</varname> is greater than <returnvalue>0</returnvalue> this register counts the incoming rings.
de: Wenn der Wert in <varname>S0</varname> größer als <returnvalue>0</returnvalue> ist, zählt dieses Register die eingehenden Klingelzeichen.

source: Escape to command mode character
de: Zeichen zum Abbruch in den Befehlsmodus

source: no ESC
de: kein ESC

source: Carriage return character
de: Zeilenende-Zeichen

source: Line feed character
de: Zeilenvorschub-Zeichen

source: Backspace character
de: Rückgängig-Zeichen

source: 2-255 seconds
de: 2-255 Sekunden

source: Dial tone wait time (blind dialing, see <link linkend="hayes-basic-x1">X<replaceable>n</replaceable></link>)
de: Wartezeit auf den Wahlton (für blindes Wählen siehe <link linkend="hayes-basic-x1">X<replaceable>n</replaceable></link>)

source: 1-255 seconds
de: 1-255 Sekunden

source: Wait time for remote carrier
de: Wartezeit auf das entfernte Trägersignal

source: 0-255 seconds
de: 0-255 Sekunden

source: Comma pause time used in dialing
de: Wartezeit bei Eingabe eines Komma bei der Anwahl

source: 1-255 1/10ths second
de: 1-255 1/10tel Sekunden

source: Carrier detect time required for recognition
de: Trägersignalzeit, die zur Erkennung notwendig ist

source: Time between loss of carrier and hangup
de: Zeit zwischen Verlust des Trägersignals und Verbindungsende

source: 50-255 milliseconds
de: 50-255 Millisekunden

source: Duration and spacing of tones when tone dialing
de: Dauer und Abstand der Töne bei der Tonwahl

source: 0-255 1/50th seconds
de: 0-255 1/50tel Sekunden

source: Guard time for pause around <command>+++</command> command sequence
de: Wachzeit für eine Pause um die Befehlssequenz <command>+++</command>

source: Fallback options when error correction link fails:
de: Sicherheitsoptionen, falls die Fehlerkorrektur fehlschlägt:

source: 0 - Disconnect
de: 0 - Verbindung beenden

source: 1 - Establish Direct Connection
de: 1 - Direkte Verbindung herstellen

source: 3 - Establish Normal Connection
de: 3 - Normale Verbindung herstellen

source: 4 - Establish an <acronym>MNP</acronym> connection if possible, else disconnect
de: 4 - Möglichst eine <acronym>MNP</acronym>-Verbindung herstellen, ansonsten Verbindung beenden

source: 5 - Establish an <acronym>MNP</acronym> connection if possible, else Direct Connection.
de: 5 - Möglichst eine <acronym>MNP</acronym>-Verbindung herstellen, ansonsten eine direkte Verbindung.

source: 7 - Establish an <acronym>MNP</acronym> connection if possible, else Normal connection
de: 7 - Möglichst eine <acronym>MNP</acronym>-Verbindung herstellen, ansonsten eine normale Verbindung

source: Negotiation Failure Treatment
de: Übertragungsparameterfehlerbehandlung

source: <returnvalue>7</returnvalue> = 1200/75 bps (v.23 mode)
de: <returnvalue>7</returnvalue> = 1200/75 bps (v.23-Modus)

source: Negotiation Speed (Initial handshake)
de: Verbindungsgeschwindigkeit (Anfangsverbindung)

source: Many modems have dozens, even hundreds, of S registers, but only the first dozen or so are fairly standard. They are changed with a command like <command>ATS<replaceable>n</replaceable>=<replaceable>N</replaceable></command>, and examined with <command>ATS<replaceable>n</replaceable>?</command> (&eg; <userinput><command>AT</command> <command>S10</command><option>=70</option> <command>S1?</command></userinput> would tell the modem not to hang up for seven seconds should it not hear the answering modem, and return the number of times the phone last rang.)
de: Einige Modems haben Dutzende, manche sogar Hunderte, von S-Registern, von denen nur ungefähr das erste Dutzend standardisiert ist. Sie werden durch einen Befehl wie <command>ATS<replaceable>n</replaceable>=<replaceable>N</replaceable></command> verändert und durch <command>ATS<replaceable>n</replaceable>?</command> (&eg; <userinput><command>AT</command> <command>S10</command><option>=70</option> <command>S1?</command></userinput> würde das Modem veranlassen, für sieben Sekunden aufzulegen, falls das entfernte Modem nicht antwortet, und die Anzahl der Anwahlversuche auszugeben) ausgelesen.
