Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdenetwork/kppp_kppp-faq.po
Languages: de

source: If you are not satisfied with the modem speed, make sure you've set the connection speed (you can reach it by clicking on <guibutton>Setup</guibutton>, <guilabel>Device</guilabel>, <guibutton>Connection Speed</guibutton>) to 57600 or higher. Make sure your serial ports support higher speeds. Many older systems based on i486 do not work correctly if you set the speed to 115200. If you have an old <hardware>8250 UART</hardware> chip, it won't work. If you have a <hardware>16550</hardware> or <hardware>16550A</hardware> it should work flawlessly.
de: Wenn Sie mit der Modemgeschwindigkeit nicht zufrieden sind, stellen Sie sicher, dass die Verbindungsgeschwindigkeit (Einstellungen/Gerät/Geschwindigkeit) auf 57600 oder höher eingestellt ist. Stellen Sie sicher, dass Ihre serielle Schnittstelle höhere Geschwindigkeiten unterstützt. Viele auf i486 basierende Systeme arbeiten nicht korrekt, wenn die Geschwindigkeit auf 115200 eingestellt ist. Wenn Sie einen 8250 UART Chip haben, wird es nicht funktionieren. Wenn Sie einen 16550 oder 16550A haben, sollte es problemlos funktionieren.

source: Additionally, you should consult your modem manual to look for init strings that enable a high speed mode.
de: Schauen Sie zusätzlich in Ihrem Modem-Handbuch nach Init-Strings, die den Hochgeschwindigkeit-Modus aktivieren.

source: I get a <emphasis>REALLY</emphasis> slow connection speed!
de: Die Übertragungsgeschwindigkeit ist <emphasis>sehr</emphasis> langsam.

source: If data drips on at a rate of just a few bytes per second, you should check your hardware setup. If moving your mouse speeds up the transmission this is definitely a hardware issue!
de: Wenn die Datenübertragungsrate nur ein paar Byte pro Sekunde beträgt, sollten Sie Ihre Hardware-Einstellungen überprüfen. Falls Bewegungen der Maus die Datenübertragung beschleunigen, ist das auf jeden Fall ein Hardwareproblem.

source: You can obtain some information about your serial port with <userinput><command>setserial</command> <option>-a <replaceable>/dev/ttySx</replaceable></option></userinput> and check for interrupt conflicts with other components of your system.
de: Sie erhalten Informationen über Ihre serielle Schnittstelle mit <userinput><command>setserial</command> <option>-a <replaceable>/dev/ttySx</replaceable></option></userinput>. Schauen Sie nach Interrupt-Konflikten mit anderen Komponenten Ihres Systems.

source: My phone line needs pulse dialing instead of tone dialing (or vice-versa). How do I change that?
de: Meine Telefonleitung benutzt das Impuls- anstatt das Tonwahlverfahren (oder umgekehrt). Wie kann ich die Einstellung ändern?

source: You must modify your modem dial string. Nearly all modems support the following AT commands:
de: Sie müssen den Modem-Wählstring verändern. Fast alle Modems unterstützen die folgenden AT-Befehle:

source: Selects tone dialing
de: Aktiviert das Tonwahlverfahren

source: Selects pulse dialing
de: Aktiviert das Impulswahlverfahren

source: Questions about Telephone Cost Rules
de: Fragen über Telefongebühren-Regeln

source: How do I write a telephones cost rules file?
de: Wie erstelle ich eine Telefongebühren-Regeldatei?

source: Just follow the <filename>TEMPLATE</filename> rules file supplied with &kppp;. You should be able to find a copy in <filename class="directory">$KDEDIR/doc/HTML/<replaceable>yourlang</replaceable>/kppp/</filename>. Use the <option>-r</option> &kppp; command line option to check the syntax of your proposed rules file.
de: Sehen Sie sich die <literal>TEMPLATE</literal>-Regeldatei, die bei &kppp; dabei ist, an. Sie sollten eine Kopie davon in <literal>&dollar;KDEDIR/doc/HTML/en/kppp</literal> finden. Benutzen Sie den Befehlszeilen-Parameter <literal>-r</literal> von &kppp;, um die Syntax Ihrer Gebührenregel-Datei zu überprüfen.

source: I have written a telephone cost rules for my region. Where can I submit it so that others can make use of it?
de: Ich habe eine Gebührenregel-Datei für meine Region geschrieben. Wem kann ich sie schicken, sodass auch andere sie nutzen können?

source: Can my phone cost rulefile contain fractional time units like "(0.17, 45.5)"?
de: Kann meine Telefongebühren-Regeldatei Bruchteile einer Zeiteinheit enthalten, &eg; <quote>(0.17,45.5)</quote>?

source: Yes this is possible. But you shouldn't use unusually small time units below a tenth of a second, because this would result in higher <acronym>CPU</acronym> load, although you probably won't notice on a modern <acronym>CPU</acronym>.
de: Ja, das ist möglich. Aber Sie sollten kein ungewöhnlich kleinen Bruchteile benutzen (unter einer 1/10 Sekunde), da dies in einer höheren <acronym>CPU</acronym>-Belastung resultieren würde. (Obwohl ich nicht glaube, dass Sie das bei einer modernen <acronym>CPU</acronym> bemerken würden.:-)

source: My country observes other <quote>moving</quote> holidays than Easter.
de: Mein Land hat außer Ostern noch weiter <quote>verschiebbare</quote> Feiertage.

source: In that case, you need to write new code that allows for the computation of that holiday. Please have a look at <filename>ruleset.cpp</filename> and emulate the <quote>easter</quote> example. Then send in the patches!.
de: In diesem Fall müssen Sie neuen Code schreiben, der Ihnen die Berechnung dieses Feiertags ermöglicht. Sehen Sie in <literal>ruleset.cpp</literal> nach und imitieren Sie das ``easter''-Beispiel. Dann senden Sie <ulink url="mailto:wuebben@math.cornell.edu">mir</ulink> die Patches.

source: Questions about the System Logs
de: Fragen zu den System-Protokolldateien

source: I see a message saying <errorname>Serial line is looped back</errorname>. What does this mean?
de: Eine Meldung besagt <errorname>Serial line is looped back</errorname>. Was bedeutet das?

source: Short answer: You didn't start the <acronym>PPP</acronym> software on the peer system.
de: Kurze Antwort: Sie haben die <acronym>PPP</acronym>-Software auf dem entfernten System nicht gestartet.

source: The logs show <errorname>Signal 15</errorname>
de: Die Protokolldateien zeigen <errorname>Signal 15</errorname>.

source: If you see the following lines, you've probably just received a timeout error from &kppp;. &kppp; has been waiting for the <acronym>PPP</acronym> interface to come up and gave up after the specified timeout. <application>pppd</application> was signalled to shut down, with signal number 15, &ie; <errorcode>SIGTERM</errorcode>.
de: Wenn Sie die folgenden Zeilen sehen, haben Sie evtl. gerade einen Fehler wegen Zeitüberschreitung von &kppp; erhalten. &kppp; hat darauf gewartet, dass das <acronym>PPP</acronym>-Interface startete, und hat dann nach einer bestimmten Zeit aufgegeben. Dem <application>pppd</application> wurde mit dem Signal 15 (i.A. <errorcode>SIGTERM</errorcode>) signalisiert, abzubrechen.

source: What about <errorname>Receive serial link is not 8-bit clean</errorname>
de: Was bedeutet <errorname>Receive serial link is not 8-bit clean</errorname>?

source: The <acronym>PPP</acronym> daemon is alarmed by the fact that all the data it receives has bit 8 set to zero. In most cases this simply indicates that the remote <acronym>PPP</acronym> server isn't running yet. You might still be confronted by a login prompt that echoes back all the data sent by your <application>pppd</application>.
de: Der <acronym>PPP</acronym>-Dämon wurde misstrauisch, da alle empfangenen Daten das Bit 8 auf Null gesetzt hatten. In den meisten Fällen zeigt das an, dass der entfernte <acronym>PPP</acronym>-Server noch nicht gestartet ist. Es wird dort vielleicht immer noch einen Anmeldeprompt geben, der alle Daten, die von Ihrem <application>pppd</application> gesendet wurden, zurücksendet.

source: and <errorname>can't locate module ppp-compress</errorname>? What's this?
de: Was bedeutet <errorname>can't locate module ppp-compress</errorname>?

source: Do you see the following messages?
de: Bekommen Sie folgende Nachrichten?

source: Just add the lines:
de: Fügen Sie einfach diese Zeilen

source: to your <filename>/etc/conf.modules</filename> file.
de: zu Ihrer Datei <filename>/etc/conf.modules</filename> hinzu.
