Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdenetwork/kppp_hayes.po
Languages: de

source: The Hayes Modem Command Set
de: Der Hayes-Modem-Befehlssatz

source: Here is a description of the Hayes Command Set. Most modems follow this command set to large extent. If you lost your modem manual or never had one in the first place, this reference might come in handy. I for instance finally found out how to turn my modems speaker off: <command>ATM0</command> -- Finally: Silence!
de: Es folgt eine Beschreibung des Hayes-Befehlssatzes. Die meisten Modems verwenden diese Befehle zu einem großen Anteil. Diese Referenz ist nützlich, falls man seine Modem-Beschreibung verloren hat oder niemals eine hatte. Der Befehl zum Ausschalten des Lautsprechers lautet zum Beispiel <command>ATM0</command>.

source: The modem initialization string consists of a series of commands. It prepares the modem for communications, setting such features as dialing mode, waits, detection of the busy signal and many other settings. Newer modem communications programs reset the initializations string for you according to which menu options you select, which features you enable, &etc;
de: Die Modem-Initialisierungszeichen bestehen aus einer Kette von Befehlen. Sie richten das Modem für die Kommunikation ein, legen den Wahlmodus, Wartezeiten, Erkennung des Besetztzeichens und viele andere Dinge fest. Neuere Modem-Kommunikationsprogramme stellen die Initialisierungszeichen abhängig von den gewählten Menüeinstellungen automatisch zusammen.

source: For many years Hayes modems have been the standard. As the field of modem manufactures has grown, most have adhered at least loosely to the Hayes standard. The following is a partial list of the Hayes command set. (called the <quote>AT</quote> commands). The Hayes Command Set can be divided into four groups:
de: Hayes-Modems haben für viele Jahre den Standard bestimmt. Bei der Weiterentwicklung des Marktes haben alle Hersteller mindestens teilweise den Hayes-Standard verwendet. Es folgt eine unvollständige Liste des Hayes-Befehlssatzes. (auch <quote>AT</quote>-Befehle genannt). Der Befehlssatz kann in vier Bereiche eingeteilt werden:

source: Basic Command Set
de: Grundlegender Befehlssatz

source: A capital character followed by a digit. For example, <command>M1</command>.
de: Ein großer Buchstabe gefolgt von einer Ziffer. Zum Beispiel <command>M1</command>.

source: Extended Command Set
de: Erweiterter Befehlssatz

source: An <quote>&amp;</quote> (ampersand) and a capital character followed by a digit. This is an extension of the basic command set. For example, <command>&amp;M1</command>. Note that <command>M1</command> is different from <command>&amp;M1</command>.
de: Ein <quote>&amp;</quote> (Ampersand) und ein Großbuchstabe gefolgt von einer Ziffer. Es handelt sich um eine Erweiterung des grundlegenden Befehlssatzes. Zum Beispiel: <command>&amp;M1</command>. Beachten Sie, dass <command>M1</command> sich in der Bedeutung von <command>&amp;M1</command> unterscheidet.

source: Proprietary Command Set
de: Herstellerabhängiger Befehlssatz

source: Usually started by either a backslash (<quote>\</quote>), or a percent sign (<quote>&percnt;</quote>), these commands vary widely among modem manufacturers. For that reason, only a few of these commands are listed below.
de: Diese Befehle beginnen entweder mit einem umgekehrten Schrägstrich(<quote>\</quote>) oder einem Prozentzeichen (<quote>&percnt;</quote>). Sie variieren sehr stark von Hersteller zu Hersteller. Aus diesem Grund werden hier nur wenige dieser Befehle aufgelistet.

source: Register Commands
de: Registerbefehle

source: <command>S<replaceable>r</replaceable>=<replaceable>n</replaceable></command> where <replaceable>r</replaceable> is the number of the register to be changed, and <replaceable>n</replaceable> is the new value that is assigned.
de: <command>S<replaceable>r</replaceable>=<replaceable>n</replaceable></command> wobei <replaceable>r</replaceable> die Nummer des zu ändernden Registers und <replaceable>n</replaceable> der neue Wert dieses Registers ist.

source: A <quote>register</quote> is computerese for a specific physical location in memory. Modems have small amounts of memory onboard. This fourth set of commands is used to enter values in a particular register (memory location). The register will be storing a particular <quote>variable</quote> (alpha-numeric information) which is utilized by the modem and communication software. For example, <command>S7=60</command> instructs your computer to <quote>Set register #7 to the value 60</quote>.
de: Ein <quote>Register </quote> ist eine Bezeichnung für eine bestimmte Stelle im Speicher. Modems haben einen kleinen Speicher integriert. Diese vierte Gruppe von Befehlen wird verwendet, um Werte in einem bestimmten Register (Speicherplatz) zu verändern. Jedes Register speichert eine bestimmte <quote>Variabel</quote> (alphanumerische Information), die vom Modem und dem Kommunikationsprogramm verwendet wird. Zum Beispiel setzt der Befehl <command>S7=60</command> das <quote>Register #7 auf den Wert 60</quote>.

source: Although most commands are defined by a letter-number combination (<command>L0</command>, <command>L1</command> &etc;), the use of a zero is optional. In this example, <command>L0</command> is the same as a plain <command>L</command>. Keep this in mind when reading the table below!
de: Obwohl die meisten Befehle aus einer Buchstaben-Ziffern-Kombination (<command>L0</command>, <command>L1</command> &etc;) bestehen, ist die Verwendung der Null optional. Im Beispiel können Sie statt <command>L0</command> auch einfach <command>L</command> verwenden. Das ist wichtig für die folgende Tabelle.

source: Here are some of the most important characters that may appear in the modem initialization string. These characters normally should not be changed.
de: Hier werden einige der wichtigsten Buchstaben einer Initialisierungs-Zeichenkette aufgelistet. Die Buchstaben sollten Sie normalerweise nicht verändern.

source: Tells the modem that modem commands follow. This must begin each line of commands.
de: Informiert das Modem, dass ein Modem-Befehl folgt. Diese Zeichen müssen am Anfang jeder Befehlszeile stehen.

source: Resets the modem to its default state
de: Setzt das Modem in den Standardzustand.

source: <command>,</command> (a comma)
de: <command>,</command> (ein Komma)

source: makes your software pause for a second. You can use more than one <command>,</command> in a row. For example, <command>,,,,</command> tells the software to pause four seconds. (The duration of the pause is governed by the setting of register <varname>S8</varname>.)
de: Hält das Programm für eine Sekunde an. Es können auch mehrere Kommata hintereinander verwendet werden. Zum Beispiel <command>,,,,</command> sorgt für eine Pause von vier Sekunden. (Die Dauer der Pause ist abhängig vom Inhalt des Registers <varname>S8</varname>).

source: Sends the terminating Carriage Return character to the modem. This is a control code that most communication software translates as <quote>Carriage Return</quote>
de: Sendet einen abschließenden Zeilenende-Befehl an das Modem. Diese Kontrollsequenz wird von den meisten Kommunikationsprogrammen auch als <quote>Zeilenvorschub</quote> interpretiert.

source: The Basic Hayes Command Set
de: Der grundlegende Hayes-Modem-Befehlssatz

source: In alphabetical order:
de: In alphabetischer Reihenfolge:

source: Basic Hayes Command Set
de: Der grundlegende Hayes-Modem-Befehlssatz

source: Command
de: Befehl

source: Description
de: Beschreibung

source: Comments
de: Kommentar

source: <command>A0</command> or <command>A</command>
de: <command>A0</command> oder <command>A</command>

source: Answer incoming call
de: Eingehenden Anruf beantworten

source: Repeat last command
de: Letzten Befehl wiederholen

source: Don't preface with <command>AT</command>. Enter usually aborts.
de: Es wird kein <command>AT</command> vorangestellt. Das Eingabezeichen bricht normalerweise ab.

source: <command>B0</command> or <command>B</command>
de: <command>B0</command> oder <command>B</command>

source: Call negotiation
de: Anruf-Verhandlung

source: Verbose/Quiet On Answer
de: Wortreich/still beantworten

source: Dial
de: Wählen

source: Dial the following number and then handshake in originate mode.
de: Die folgende Nummer wählen und die Verbindung im Originate-Modus herstellen.

source: Pulse Dial
de: Pulswahl

source: Touch Tone Dial
de: Tonwahl

source: Wait for the second dial tone
de: Auf einen zweiten Wahlton warten

source: Pause for the time specified in register <varname>S8</varname> (usually 2 seconds)
de: Warte die im Register <varname>S8</varname> angegebene Zeitspanne (normalerweise 2 Sekunden)

source: Remain in command mode after dialing.
de: Nach der Anwahl im Befehlsmodus bleiben.

source: Flash switch-hook (Hang up for a half second, as in transferring a call.)
de: Für eine halbe Sekunde auflegen, wie bei der Weiterverbindung eines Anrufs.

source: Dial last number
de: Letzte Nummer noch einmal wählen

source: <command>E0</command> or <command>E</command>
de: <command>E0</command> oder <command>E</command>

source: No Echo
de: Kein Echo

source: Will not echo commands to the computer
de: Befehle werden nicht auf dem Computer angezeigt.

source: Will echo commands to the computer (so one can see what one types)
de: Zeigt die Befehle auch auf dem Computer an (so kann man sehen, was man tippt)

source: Hook Status
de: Verbindungsstatus

source: On hook - Hang up
de: Bei Verbindung - Auflegen

source: Hook status
de: Verbindungsstatus

source: Off hook - phone picked up
de: Ohne Verbindung - Telefon wurde abgehoben

source: <command>I0</command> or <command>I</command>
de: <command>I0</command> oder <command>I</command>

source: Inquiry, Information, or Interrogation
de: Anfrage, Information oder Befragung

source: This command is very model specific. <command>I0</command> usually returns a number or code, while higher numbers often provide much more useful information.
de: Dieser Befehl ist sehr modellabhängig. <command>I0</command> wird üblicherweise mit einer Nummer oder einer Zeichenkette beantwortet, während höhere Ziffern häufig viele wertvolle Informationen liefern.

source: <command>L0</command> or <command>L</command>
de: <command>L0</command> oder <command>L</command>

source: Speaker Loudness. Modems with volume control knobs will not have these options.
de: Lautstärke. Modems mit Lautstärkeregler verfügen nicht über diese Option.

source: Off or low volume
de: Aus oder geringe Lautstärke

source: Low Volume
de: Geringe Lautstärke

source: Medium Volume
de: Mittlere Lautstärke

source: Loud or High Volume
de: Laut oder große Lautstärke

source: <command>M0</command> or <command>M</command>
de: <command>M0</command> oder <command>M</command>

source: Speaker off
de: Lautsprecher aus

source: <command>M3</command> is also common, but different on many brands
de: Der Befehl <command>M3</command> wird häufig verwendet, aber leider in unterschiedlichen Bedeutungen

source: Speaker on until remote carrier detected (&ie; until the other modem is heard)
de: Lautsprecher an bis zum Verbindungsaufbau (carrier detected, also bis das andere Modem antwortet)

source: Speaker is always on (data sounds are heard after CONNECT)
de: Lautsprecher immer an (Datenübertragungen können nach dem Verbindungsaufbau gehört werden)

source: <command>N0</command> or <command>N</command>
de: <command>N0</command> oder <command>N</command>

source: Handshake Speed
de: Verbindungsgeschwindigkeit

source: Handshake only at speed in <link linkend="hayes-s37"><varname>S37</varname></link>
de: Verbindung nur mit der Geschwindigkeit <link linkend="hayes-s37"><varname>S37</varname></link>

source: Handshake at highest speed larger than <link linkend="hayes-s37"><varname>S37</varname></link>
de: Verbindung mit der größtmöglichen Geschwindigkeit größer als <link linkend="hayes-s37"><varname>S37</varname></link>

source: <command>O0</command> or <command>O</command>
de: <command>O0</command> oder <command>O</command>

source: Return Online
de: Wechsel in den Online-Zustand

source: See also <link linkend="hayes-basic-x1"><command>X1</command></link> as dial tone detection may be active.
de: Sie auch <link linkend="hayes-basic-x1"><command>X1</command></link>, da die Wahltonerkennung aktiv sein kann.

source: Return Online after an equalizer retrain sequence
de: Neusynchronisation und Wechsel in den Online-Zustand

source: <command>Q0</command> or <command>Q1</command>
de: <command>Q0</command> oder <command>Q1</command>

source: Quiet Mode
de: Stiller Modus

source: Off - Displays result codes, user sees command responses (&eg; <computeroutput>OK</computeroutput>)
de: Aus - Zeigt Resultate, der Benutzer sieht die Befehlsantworten (also &eg; <computeroutput>OK</computeroutput>)

source: On - Result codes are suppressed, user does not see responses.
de: An - Resultate werden unterdrückt, der Benutzer sieht keine Antworten.

source: Query the contents of S-register <replaceable>n</replaceable>
de: Abfrage des Inhalts von S-Register <replaceable>n</replaceable>

source: Store
de: Speichern

source: Store the value of <replaceable>r</replaceable> in S-register <replaceable>n</replaceable>
de: Speichert den Wert <replaceable>r</replaceable> im S-Register <replaceable>n</replaceable>

source: <command>V0</command> or <command>V</command>
de: <command>V0</command> oder <command>V</command>

source: Verbose
de: Wortreich

source: Numeric result codes
de: nummerische Resultate

source: English result codes (&eg; <computeroutput>CONNECT</computeroutput>, <computeroutput>BUSY</computeroutput>, <computeroutput>NO CARRIER</computeroutput> &etc;)
de: Englische Textresultate (&eg; <computeroutput>CONNECT</computeroutput>, <computeroutput>BUSY</computeroutput>, <computeroutput>NO CARRIER</computeroutput> &etc;)

source: <command>X0</command> or <command>X</command>
de: <command>X0</command> oder <command>X</command>

source: Hayes Smartmodem 300 compatible result codes
de: Hayes Smartmodem 300 kompatible Resultate

source: Usually adds connection speed to basic result codes (&eg; <computeroutput>CONNECT 1200</computeroutput>)
de: Verbindungsgeschwindigkeit wird zusätzliche angezeigt (&eg; <computeroutput>CONNECT 1200</computeroutput>)

source: Usually adds dial tone detection (preventing blind dial, and sometimes preventing <command>AT0</command>)
de: Aktiviert die Wahltonerkennung (verhindert blindes Anwählen und manchmal <command>AT0</command>)

source: Usually adds busy signal detection
de: Aktiviert die Besetztzeichenerkennung

source: Usually adds both busy signal and dial tone detection
de: Aktiviert sowohl Wahlton- als auch Besetztzeichenerkennung

source: <command>Z0</command> or <command>Z</command>
de: <command>Z0</command> oder <command>Z</command>

source: Reset modem to stored configuration. Use <command>Z0</command>, <command>Z1</command> &etc; for multiple profiles. This is the same as <command>&amp;F</command> for factory default on modems without <acronym>NVRAM</acronym> (non-volatile memory)
de: Setzt das Modem auf die gespeicherte Konfiguration zurück. Für unterschiedliche Einstellungen muss man <command>Z0</command>, <command>Z1</command> &etc; verwenden. Für Modems ohne <acronym>NVRAM</acronym> (non volatile memory) ist das gleichbedeutend mit <command>&amp;F</command> für die Fabrikeinstellungen.

source: The Extended Hayes Command Set
de: Der Erweiterte Hayes-Modem-Befehlssatz

source: Ampersand Commands
de: Ampersand-Befehle

source: <command>&amp;B0</command> or <command>&amp;B</command>
de: <command>&amp;B0</command> oder <command>&amp;B</command>

source: Retrain Parameters
de: Verzögerungsparameter

source: Disable auto retrain function
de: Automatische Verzögerung deaktivieren

source: Enable auto retrain function
de: Automatische Verzögerung aktivieren

source: Enable auto retrain, but disconnect if no line improvement over the period dictated by <link linkend="hayes-s7"><varname>S7</varname></link>
de: Automatische Verzögerung wird aktiviert, aber falls innerhalb der Verzögerungszeit in <link linkend="hayes-s7"><varname>S7</varname></link> keine Verbesserung erfolgt, wird die Verbindung beendet

source: <command>&amp;C0</command> or <command>&amp;C1</command>
de: <command>&amp;C0</command> oder <command>&amp;C1</command>

source: Carrier detect
de: Antwort erkennen (Carrier detect)

source: Signal always on
de: Signal ist immer an

source: Indicates remote carrier (usual preferred default)
de: Zeigt die entfernte Antwort an (normalerweise der Standard)

source: <command>&amp;D0</command> or <command>&amp;D</command>
de: <command>&amp;D0</command> oder <command>&amp;D</command>

source: Signal ignored (This is modem specific, you must see your manual for information on this one!)
de: Signal ignoriert (Das ist modemspezifisch, man muss im Handbuch für Informationen zu diesem Befehl nachlesen)

source: If <acronym>DTR</acronym> goes from On to Off the modem goes into command mode (Some modems only)
de: Wenn das Signal <acronym>DTR</acronym> von An zu Aus wechselt, wechselt das Modem in den Befehlsmodus (nur einige Modems)

source: Some modems hang up on <acronym>DTR</acronym> On to Off transition (This is the usual preferred default)
de: Einige Modems beenden die Verbindung beim Wechsel von <acronym>DTR</acronym> von An zu Aus (das ist das übliche Standardverhalten)

source: Hang up, reset the modem, and return to command mode upon <acronym>DTR</acronym>
de: Bei <acronym>DTR</acronym> Verbindung beenden, Modem zurücksetzen und in den Befehlsmodus wechseln.

source: <command>&amp;F0</command> or <command>&amp;F</command>
de: <command>&amp;F0</command> oder <command>&amp;F</command>

source: Factory defaults
de: Fabrikeinstellungen laden

source: Generic Hayes-compatible defaults.
de: Generische Hayes-kompatible Standardeinstellungen.

source: This is usually a good thing to use in your init string, since the <command>&amp;F1</command>-<command>&amp;F3</command> settings can vary among modems, and they may actually be the cause of connection problems. (Since you never know exactly what Brand X's <command>&amp;F2</command> really changes.)
de: Dieser Befehl sollte in Initialisierungskette stehen, da die Befehle <command>&amp;F1</command>-<command>&amp;F3</command> von Modem zu Modem variieren und die Ursache für Verbindungsprobleme sein können. (Da man niemals genau weiß, was das Modem der Marke X beim <command>&amp;F2</command>-Befehl genau ändert.)

source: On the other hand, it pays to try out the other options below; many people's problems can be solved by replacing a complicated init string with a simple <command>&amp;F2</command> or the like. However, if you're building an init string, it's best to start with a simple <command>&amp;F</command>, and not use the <quote>customized</quote> form of defaults.
de: Auf der anderen Seite lohnt das Ausprobieren alternativer Werte, da einige Probleme statt mit einer komplizierten Init-Kette mit einem simplen <command>&amp;F2</command> gelöst werden können. Falls man mit dem Aufbau einer Init-Kette beginnt, sollte man mit einem <command>&amp;F</command> und nicht mit der <quote>modemspezifischen</quote> Variante anfangen.

source: Factory Defaults
de: Fabrikeinstellungen

source: Factory Defaults tailored to an IBM <acronym>PC</acronym> compatible user
de: Fabrikeinstellungen für einen IBM-<acronym>PC</acronym>-kompatiblen Computer

source: Factory defaults for a Mac w/software handshaking
de: Fabrikeinstellungen für einen Mac mit Software-Handshaking

source: Factory defaults for a Mac w/hardware handshaking
de: Fabrikeinstellungen für einen Mac mit Hardware-Handshaking

source: <command>&amp;G0</command> or <command>&amp;G</command>
de: <command>&amp;G0</command> oder <command>&amp;G</command>

source: Guard tones
de: Wachton

source: Disable guard tones
de: Wachtöne deaktivieren

source: <command>&amp;K0</command> or <command>&amp;K</command>
de: <command>&amp;K0</command> oder <command>&amp;K</command>

source: Local flow control
de: Lokale Flusskontrolle

source: Disable local flow control
de: Lokale Flusskontrolle deaktivieren

source: Enable RTS/CTS hardware local flow control
de: Lokale RTS/CTS-Hardware-Flusskontrolle aktivieren

source: Enable XON/XOFF software local flow control
de: Lokale XON/XOFF-Software-Flusskontrolle aktivieren

source: <command>&amp;L0</command> or <command>&amp;L</command>
de: <command>&amp;L0</command> oder <command>&amp;L</command>

source: Dial mode
de: Wahlmodus

source: Select dial-up mode
de: Wahlmodus festlegen

source: <command>&amp;M0</command> or <command>&amp;M</command>
de: <command>&amp;M0</command> oder <command>&amp;M</command>

source: Error control mode
de: Fehlerkontrollmodus

source: Select asynchronous non-<acronym>EC</acronym> mode (the same as <command>&amp;Q0</command>)
de: Hier kann man asynchronen nicht-<acronym>EC</acronym>-Modus wählen (das gleiche wie <command>&amp;Q0</command>)

source: <command>&amp;P0</command> or <command>&amp;P</command>
de: <command>&amp;P0</command> oder <command>&amp;P</command>

source: Pulse dialing ratio
de: Pulswahlverhältnis

source: U.S./Canada pulse dialing 39% make / 61% break ratio
de: In den USA und Kanada wird bei Pulswahl ein Verhältnis von 39&nbsp;% Wahl und 61&nbsp;% Abbruch verwendet.

source: U.K./Hong Kong pulse dialing 33% make / 67% break ratio
de: In Großbritannien und Hongkong wird bei Pulswahl ein Verhältnis von 33&nbsp;% Wahl und 67&nbsp;% Abbruch verwendet

source: <command>&amp;Q0</command> or <command>&amp;Q</command>
de: <command>&amp;Q0</command> oder <command>&amp;Q</command>

source: Asynchronous non-<acronym>EC</acronym> more. No data buffering. <acronym>ASB</acronym> disabled.
de: Asynchroner nicht-<acronym>EC</acronym>-Modus. Keine Datenpufferung. <acronym>ASB</acronym> deaktiviert.

source: Select V.42 <acronym>EC</acronym> operation (requires flow control)
de: Wählt V.42 <acronym>EC</acronym>-Operation (erfordert Flusskontrolle)

source: Asynchronous mode with <acronym>ASB</acronym> (requires flow control)
de: Asynchroner Modus mit <acronym>ASB</acronym> (erfordert Flusskontrolle)

source: Select alternate <acronym>EC</acronym> protocol (<acronym>MNP</acronym>)
de: Wählt alternatives <acronym>EC</acronym>-Protokoll (<acronym>MNP</acronym>)

source: Conditional data compression: V.42bis = yes, MNP5 = no.
de: Bedingte Datenkompression: V.42bis = ja, MNP5 = nein.

source: <command>&amp;S0</command> or <command>&amp;S</command>
de: <command>&amp;S0</command> oder <command>&amp;S</command>

source: <acronym>DSR</acronym> action select
de: <acronym>DSR</acronym>-Aktion auswählen

source: Always on (default)
de: Immer an (Standard)

source: Follows <acronym>EIA</acronym> specification (Active following carrier tone, and until carrier is lost.)
de: Folgt der <acronym>EIA</acronym>-Spezifikation (Folgt aktiv dem Trägerton bis dieser verloren geht.)

source: <command>&amp;T0</command> or <command>&amp;T</command>
de: <command>&amp;T0</command> oder <command>&amp;T</command>

source: Self test
de: Selbsttest

source: Model specific self test on some modems
de: Bei einigen Modems wird ein modellspezifischer Selbsttest durchgeführt

source: <command>&amp;U0</command> or <command>&amp;U</command>
de: <command>&amp;U0</command> oder <command>&amp;U</command>

source: Enable V.32 <acronym>TCM</acronym>
de: Aktiviert V.32 <acronym>TCM</acronym>

source: Disable V.32 <acronym>TCM</acronym>
de: Deaktiviert V.32 <acronym>TCM</acronym>

source: <command>&amp;V0</command> or <command>&amp;V1</command>
de: <command>&amp;V0</command> oder <command>&amp;V1</command>

source: View active
de: Aktive

source: (and often stored) configuration profile settings (or <command>ATI4</command>)
de: (und häufig gespeichert) Profileinstellungen (oder <command>ATI4</command>) anzeigen
