Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdenetwork/krfb.po
Languages: de

source: The &krfb; Handbook
de: Das Handbuch zu &krfb;

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Frank</firstname><surname>Schütte</surname><affiliation><address><email>F.Schuette@t-online.de</email></address></affiliation><contrib>Übersetzung</contrib></othercredit>

source: &krfb; is a server application that allows you to share your current session with a user on another machine, who can use a <acronym>VNC</acronym> client to view or even control the desktop.
de: &krfb; ist eine Serveranwendung, welche die gemeinsame Benutzung der aktuellen Sitzung mit einem Benutzer auf einem anderen Rechner ermöglicht, der mit Hilfe eines <acronym>VNC</acronym>-Programms den Bildschirminhalt sehen oder sogar die Arbeitsfläche bedienen kann.

source: Desktop Sharing
de: Freigabe der Arbeitsfläche

source: Remote Control
de: Fernsteuerung

source: Remote Assistance
de: Fernunterstützung

source: Remote Desktop
de: Arbeitsfläche des Fremdgeräts

source: Introduction
de: Einleitung

source: You would typically use &krfb; with the &kde; <acronym>VNC</acronym> client, which is &krdc;, since it closely matches the special features of &krfb;.
de: Üblicherweise wird &krfb; zusammen mit dem &kde; <acronym>VNC</acronym>-Programm &krdc; verwendet, da dessen Funktionsumfang am besten auf die Funktionen von &krfb; abgestimmt ist.

source: &krfb; doesn't require you to start a new X session - it can share the current session. This makes it very useful when you want someone to help you perform a task.
de: Für &krfb; ist keine eigene X-Sitzung erforderlich. Das Programm kann die aktuelle Sitzung verwenden. Damit können sie sich unkompliziert bei einer Aufgabe helfen lassen.

source: Please report any problems or feature requests to the &kde; mailing lists or file a bug at <ulink url="http://bugs.kde.org">http://bugs.kde.org</ulink>.
de: Bitte berichten Sie alle Probleme oder Wünsche in den &kde;-Mailinglisten oder unter <ulink url="http://bugs.kde.org">http://bugs.kde.org</ulink>.

source: The Remote Frame Buffer protocol
de: Das <quote>Remote Frame Buffer</quote>-Protokoll

source: This chapter provides a brief description of the Remote Frame Buffer protocol used by &krfb; and by other compatible systems. If you are already familiar with Remote Frame Buffer, you can safely skip this chapter.
de: In diesem Kapitel wird das von &krfb; und kompatiblen Systemen verwendete Übertragungsprotokoll (<quote>Remote Frame Buffer</quote>-Protokoll) kurz beschrieben. Falls sie dieses Protokoll bereits kennen, können Sie dieses Kapitel überspringen.

source: The high level implementation of a system using the Remote Frame Buffer protocol is known as Virtual Network Computer, or more often just as <acronym>VNC</acronym>.
de: Es gibt eine umfangreiche Implementierung des <quote>Remote Frame Buffer</quote>-Protokolls, bekannt unter dem Namen <acronym>VNC</acronym> (<quote>Virtual Network Computer</quote>).

source: Remote Frame Buffer (or <acronym>RFB</acronym> for short) is a simple protocol for remote access to graphical user interfaces. It works at the frame-buffer level, which roughly corresponds to the rendered screen image, which means that it can be applied to all windowing systems (including X11, &MacOS; and &Microsoft; &Windows;). Remote Frame Buffer applications exist for many platforms, and can often be freely re-distributed.
de: <quote>Remote Frame Buffer</quote> (<acronym>RFB</acronym>) ist ein einfaches Protokoll für den entfernten Zugriff auf eine grafische Benutzeroberfläche. Es arbeitet auf der Ebene des <quote>Frame-buffers</quote>, der grob der gerasterten Bildschirmdarstellung entspricht. Daher kann das Protokoll für alle Fenstersysteme (einschließlich X11, &MacOS; und &Microsoft; &Windows;) verwendet werden. <quote>Remote Frame Buffer</quote>-Programme finden sich für viele Plattformen und können meistens frei verteilt werden.

source: In the Remote Frame Buffer protocol, the application that runs on the machine where the user sits (containing the display, keyboard and pointer) is called the client. The application that runs on the machine where the framebuffer is located (which is running the windowing system and applications that the user is remotely controlling) is called the server. &krfb; is the &kde; server for the Remote Frame Buffer protocol. &krdc; is the &kde; client for the Remote Frame Buffer protocol.
de: Das Programm auf dem Rechner, an dem der Benutzer sitzt (der also Bildschirm, Tastatur und Maus besitzt), wird im <quote>Remote Frame Buffer</quote>-Protokoll als Client bezeichnet. Das Programm auf dem Rechner mit dem <quote>Frame buffer</quote> (der Rechner mit Fenstersystem, der von einem Fremdgerät gesteuert wird) wird als Server bezeichnet. Der &kde;-Server mit dem <quote>Remote Frame Buffer</quote>-Protokoll ist &krfb;. Der &kde;-Client für das <quote>Remote Frame Buffer</quote>-Protokoll ist &krdc;.

source: It takes a reasonable amount of network traffic to send an image of the framebuffer, so Remote Frame Buffer works best over high bandwidth links, such as a local area network. It is still possible to use &krfb; over other links, but performance is unlikely to be as good.
de: Für die Übertragung eines Bildes des <quote>Frame buffers</quote> benötigt man eine erhebliche Übertragungsrate, daher sollte <quote>Remote Frame Buffer</quote> nur in Netzwerken ausreichender Bandbreite &eg; in lokalen Netzwerken eingesetzt werden. Bei Verwendung von &krfb; über langsamere Verbindungen ist die Arbeitsgeschwindigkeit zu langsam.

source: Using &krfb;
de: Verwendung von &krfb;

source: It is very easy to use &krfb; - it has a simple interface, as shown in the screenshot below.
de: Die Verwendung von &krfb; ist leicht - die einfache Oberfläche ist im Bildschirmfoto unten zu sehen.

source: Here's a screenshot of &krfb;
de: Bildschirmfoto von &krfb;

source: &krfb; main window
de: Das Hauptfenster von &krfb;

source: When you want to allow someone to access your desktop, you can create an personal invitation using the <guibutton>New Personal Invitation...</guibutton> button, which will bring up a window containing the information needed to access your desktop. An example is shown below.
de: Falls Sie jemandem den Zugriff auf ihre Arbeitsfläche gestatten möchten, können Sie eine persönliche Einladung versenden durch den Knopf <guibutton>Neue persönliche Einladung ...</guibutton>. Es erscheint ein Fenster, das alle nötigen Informationen zum Zugriff enthält. Ein Beispiel ist weiter unten zu sehen.

source: <screeninfo>Example &krfb; personal invitation</screeninfo>
de: <screeninfo> Beispiel einer persönlichen Einladung mit &krfb;</screeninfo>

source: <phrase>Example &krfb; personal invitation</phrase>
de: <phrase>Beispiel einer persönlichen Einladung mit &krfb;</phrase>

source: To increase security, the invitation is only valid for an hour after it is created, and of course the person connecting has to have the correct password.
de: Aus Sicherheitsgründen ist die Einladung nur eine Stunde lang gültig und nur nach Eingabe des richtigen Passworts.

source: Since you may want to invite someone to access your desktop by email, &krfb; can create invitations as email messages. You can create such an invitation using the <guibutton>New Email Invitation...</guibutton> button on the &krfb; main window. This will usually bring up an email message that looks like the following, ready for you to type in the email address of the person you are sending the invitation to.
de: Soll die Einladung per E-Mail ausgesprochen werden soll, kann &krfb; diese Einladungen erstellen. Dazu klicken Sie auf <guibutton>Neue Einladung per E-Mail ...</guibutton> im Hauptfenster von &krfb;. Es erscheint eine E-Mail, die dem folgenden Beispiel ähnelt. Es muss lediglich der Adressat eingetragen und die E-Mail abgeschickt werden.

source: <screeninfo>Example &krfb; email invitation</screeninfo>
de: <screeninfo>Beispiel einer &krfb;-Einladung per E-Mail</screeninfo>

source: <phrase>Example &krfb; email invitation</phrase>
de: <phrase>Beispiel einer &krfb;-Einladung per E-Mail</phrase>

source: &krfb; will warn you about the security implications of sending this information across an insecure link. You must heed those warnings.
de: &krfb; warnt vor den Sicherheitsrisiken der Versendung einer solchen Einladung über eine unsichere Verbindung. Diese Warnung sollte man beherzigen.

source: If you cannot encrypt the email (or otherwise secure the link), sending invitations by email is a very serious security risk, since anyone can read the password and address from the email as it passes over the network. This means that they can potentially take control of your machine.
de: Falls man die E-Mail nicht verschlüsselt (oder alternativ eine sichere Verbindung verwendet) stellt die Einladung ein hohes Sicherheitsrisiko dar, da jeder auf dem Weg der E-Mail gelegene Rechner die E-Mail mitlesen und das Passwort verwenden kann, um so möglicherweise die Kontrolle über ihren Rechner übernehmen zu können.

source: If you cannot encrypt the email message, it may be better to use a personal invitation, telephone the person you are giving access to, verify the identity of that person, and provide the required invitation information that way.
de: In diesem Fall sollte man lieber zu einer persönlichen Einladung per Telefon greifen. So kann man sich von der Identität der anderen Person überzeugen und dann die relevanten Daten per Telefon weiter geben.

source: Managing &krfb; invitations
de: Verwaltung von &krfb;-Einladungen

source: Having created an invitation (either a personal invitation or one that was sent by email), &krfb; main window allows you to delete existing invitations. To just delete one of the invitations, select it with the mouse (it should become highlighted), and then select the <guibutton>Delete</guibutton>. To delete all invitations, just select the <guibutton>Delete All</guibutton> button.
de: Weiterhin können in diesem Hauptfenster bereits persönlich oder oer E-Mail ausgesprochene Einladungen gelöscht werden. Dazu wählt man die gewünschte Einladung aus (sie sollte hervorgehoben erscheinen) und klickt auf <guibutton>Entfernen</guibutton>. Um alle Einladungen zu löschen, klickt man auf den Knopf <guibutton>Alle entfernen</guibutton>.

source: Quit &krfb;
de: &krfb; beenden

source: If you close the &krfb; main window the server keeps running, which is indicated by an icon in the system tray. To stop &krfb; right click on the icon in the systems tray and select <guimenuitem>Quit</guimenuitem>.
de: Wird das Hauptfenster von &krfb; geschlossen, läuft der Server weiter. Dies wird durch ein Symbol im Systemabschnitt der Kontrollleiste angezeigt. Um &krfb; zu beenden, klicken Sie mit der &RMBn; auf dieses Symbol und wählen dann <guimenuitem>Beenden</guimenuitem>.

source: Configuring &krfb;
de: Einrichtung von &krfb;

source: In addition to the main &krfb; interface shown and described above, you can also control &krfb; using the <guibutton>Configure...</guibutton> on the &krfb; main window. The &krfb; configuration has two pages, as shown in the screenshot below:
de: Außer im Hauptfenster kann man &krfb; auch durch Klicken auf den Knopf <guibutton>Einrichten ...</guibutton> aus dem &krfb;-Hauptfenster den Einstellungsdialog öffnen. Dieser Dialog besteht aus zwei Seiten wie im unten angezeigten Bildschirmfoto:

source: The <guilabel>Network</guilabel> page allows control over the port that &krfb; uses, as shown below.
de: Auf der Seite <guilabel>Netzwerk</guilabel> kann man den von &krfb; verwendeten Port einstellen (siehe unten).

source: <screeninfo>&krfb; Configuration (Network page)</screeninfo>
de: <screeninfo>Einrichtung von &krfb; (Netzwerk)</screeninfo>

source: <phrase>&krfb; Configuration (Network page)</phrase>
de: <phrase>Einrichtung von &krfb; (Netzwerk)</phrase>

source: The <guilabel>Announce service on the network</guilabel> checkbox controls whether &krfb; announces invitations over the network using Service Location Protocol. This is normally a good idea, but only works really well with a Service Location Protocol aware client, such as &krdc;.
de: Wenn das Ankreuzfeld <guilabel>Dienst im lokalen Netzwerk veröffentlichen</guilabel> markiert ist, dann macht &krfb; Einladungen über das Netzwerk mithilfe des <quote>Service Location</quote>-Protokolls bekannt. Diese Funktion arbeitet nur mit einem Programm wie &krdc; einwandfrei.

source: If you select the <guilabel>Use default port</guilabel> checkbox, then &krfb; will locate a suitable port, and invitations will match this port. If you deselect this checkbox, you can specify a particular port. Specifying a particular port may be useful if you are using port-forwarding on the firewall. Note that if Service Location Protocol is turned on, this will automatically deal with identifying the correct port.
de: Falls <guilabel>Standardport verwenden</guilabel> aktiviert ist, wählt &krfb; einen geeigneten Port aus und verwendet diesen auch in Einladungen. Falls diese Einstellung nicht markiert ist, kann man einen festen Port zuweisen. Das ist nützlich, falls man sich hinter einem Firewall befindet. Falls das <quote>Service Location</quote>-Protokoll aktiviert ist, identifiziert es den richtigen Port automatisch.

source: The <guilabel>Security</guilabel> page allows you configure settings related to access to the &krfb; server.
de: Auf der Seite <guilabel>Sicherheit</guilabel> befinden sich Einstellmöglichkeiten, die den Zugriff auf den &krfb;-Server beeinflussen.

source: <screeninfo>&krfb; Configuration (Security page)</screeninfo>
de: <screeninfo>Einrichtung von &krfb; (Sicherheit)</screeninfo>

source: <phrase>&krfb; Configuration (Security page)</phrase>
de: <phrase>Einrichtung von &krfb; (Sicherheit)</phrase>

source: The <guilabel>Allow uninvited connections</guilabel> check box controls whether &krfb; allows connection without an invitation. If uninvited connections are allowed, then you should probably specify a password. You can also use the check boxes here to choose whether you have to confirm the connection before it proceeds, and whether the person connecting can control the desktop, or only view.
de: Mithilfe des Ankreuzfeldes <guilabel>Uneingeladene Verbindungen akzeptieren</guilabel> wird kontrolliert, ob &krfb; auch uneingeladene Verbindungen ermöglicht. Für solche Verbindungen sollte man ein Passwort festlegen. Mit weiteren Ankreuzfeldern kann man festlegen, ob Verbindungen nur nach vorheriger Rückfrage hergestellt werden können, und ob die Arbeitsfläche nur eingesehen oder auch gesteuert werden kann.

source: If the machine is a workstation, and you choose to allow uninvited connections, you probably want to select the <guilabel>Ask before accepting connections </guilabel>. Conversely, if the machine is a server and you are using &krfb; for remote administration, you probably want to deselect this option.
de: Falls es sich bei dem Rechner um eine Workstation handelt und man uneingeladene Verbindungen erlauben möchte, sollte man das Ankreuzfeld <guilabel>Vor dem Akzeptieren von Verbindungen nachfragen</guilabel> markieren. Falls es sich bei dem &krfb;-Rechner um einen Server handelt und &krfb; zur Administrierung dieses Servers eingesetzt werden soll, sollte man dieses Ankreuzfeld nicht markieren.

source: &krfb; uses the normal <acronym>RFB</acronym> password system, which does not transfer your password in the clear across the network. Instead, it uses a challenge-response system. This is reasonably secure, as long as the password is securely guarded.
de: &krfb; verwendet für Passwörter das <acronym>RFB</acronym>-System, das keine unverschlüsselten Passwörter über das Netzwerk überträgt. Stattdess wird ein Frage-Antwort-System (<quote>Challenge Response</quote>) verwendet. Das ist normalerweise sicher, solange das Passwort geheim gehalten wird.

source: What happens when someone connects to &krfb;
de: Was passiert bei der Verbindung zu &krfb;

source: When someone connects to &krfb; on your machine, you will get a pop-up notification that looks like the following screenshot, unless you are accepting uninvited connections without warning.
de: Sobald jemand eine Verbindungsanfrage an &krfb; auf ihrem Rechner stellt, erscheint ein Benachrichtigungsfenster, das ähnlich dem folgenden Bildschirmfoto aussieht (falls man uneingeladene Verbindungen ohne Warnung aktiviert hat, erscheint das Fenster nicht).

source: <screeninfo>&krfb; Connection Window</screeninfo>
de: <screeninfo>Verbindungsfenster von &krfb;</screeninfo>

source: <phrase>&krfb; Connection Window</phrase>
de: <phrase>Verbindungsfenster von &krfb;</phrase>

source: If you <guibutton>Accept Connection</guibutton>, the client can proceed to authenticate (which requires the correct password for a personal invitation or email invitation). If you <guibutton>Refuse Connection</guibutton>, then the attempt to connect will be terminated.
de: Klickt man auf <guibutton>Verbindung akzeptieren</guibutton>, so kann sich der Client authentifizieren (erfordert die korrekte Eingabe des Passworts, das zu der persönlichen Einladung oder der E-Mail-Einladung gehört). Klickt man auf <guibutton>Verbindung verweigern</guibutton>, so wird der Verbindungsversuch abgebrochen.

source: The <guilabel>Allow remote user to control keyboard and mouse</guilabel> check box determines whether this client can only observe, or can take control of your machine.
de: Über das Ankreuzfeld <guilabel>Steuerung von Tastatur und Maus durch die Gegenstelle erlauben</guilabel> wird festgelegt, ob der Client lediglich die Arbeitsfläche einsehen oder sogar steuern kann.

source: If the client connection is successful, and used the password from a personal invitation or email invitation, then that invitation is deleted and cannot be used again. You will also get a small pop-up window in the dock, that shows that the connection has been made.
de: Falls die Verbindung erfolgreich hergestellt und das korrekte Passwort für eine persönliche Einladung verwendet wurde, wird diese Einladung gelöscht und kann nicht noch einmal verwendet werden. Es erscheint ein kleines Fenster in der Kontrollleiste, das die Verbindung anzeigt.

source: Credits and License
de: Danksagungen und Lizenz

source: Program copyright 2002 Tim Jansen <email>tim@tjansen.de</email>
de: Programn Copyright 2002 Tim Jansen <email>tim@tjansen.de</email>

source: Contributors:
de: Mitwirkende:

source: Documentation Copyright &copy; 2003 &Brad.Hards; &Brad.Hards.mail;
de: Dokumentation Copyright&copy; 2003 &Brad.Hards; &Brad.Hards.mail;

source: CREDIT_FOR_TRANSLATORS
de: <para>Deutsche Übersetzung: Frank Schütte <email>F.Schuette@t-online.de</email></para>

source: How to obtain &krfb;
de: Woher man &krfb; bekommt

source: Compilation and Installation
de: Kompilierung und Installation
