Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdegraphics/kcontrol_kgamma.po
Languages: de

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Marco</firstname><surname>Wegner</surname><affiliation><address><email>mail@marcowegner.de</email></address> </affiliation> <contrib>Übersetzung</contrib></othercredit><othercredit role="translator"><firstname>Kilian</firstname><surname>Kluge</surname> <affiliation><address><email>kilian@klugeworld.de</email></address></affiliation><contrib>Deutsche Übersetzung</contrib></othercredit>

source: System Settings
de: Systemeinstellungen

source: Calibration
de: Kalibrierung

source: Introduction
de: Einleitung

source: This module is a tool for monitor gamma correction. With proper gamma settings, your display (websites, images, &etc;) will look the same on your monitor as on other monitors.
de: Dieses Modul ist ein Werkzeug zum Korrigieren der Gamma-Werte Ihres Monitors. Mit den richtigen Gammawerten zeigt Ihr Bildschirm Websites, Bilder &etc; genauso an wie andere Monitore.

source: It allows you to alter the monitor's gamma correction of the &X-Server;. But that's not all to do. For good results you have to set the correct brightness, contrast and color balance of your monitor. This may be difficult and you have to repeat every step several times. For perfect results you need really good (and expensive) hardware.
de: Sie können die &X-Server;-Gammakorrektur des Monitors ändern. Aber das ist noch nicht alles. Um gute Resultate zu erzielen, müssen Sie die korrekten Werte für Helligkeit, Kontrast und Farbskalierung setzen. Das ist sehr schwierig und Sie werden die einzelnen Schritte mehrmals wiederholen müssen. Für perfekte Ergebnisse brauchen Sie wirklich gute (und teure) Hardware.

source: Use the four sliders to define the gamma correction either as a single value, or separately for the red, green and blue components. The &X-Server; default setting for gamma is 1.00 (&Mac; 1.80, WinXX 2.20). The test images help you to find proper settings.
de: Benutzen Sie die vier Regler um die Gammakorrektur entweder insgesamt oder für Rot, Grün und Blau einzeln einzustellen. Der Standardwert vom &X-Server; für Gamma ist 1,00 (Auf &Mac;s ist es 1,80, unter Windows XX 2,20). Die Testbilder helfen Ihnen die korrekten Einstellungen zu finden.

source: To store the gamma settings system wide, enable the option <guilabel>Save settings system wide</guilabel>. The system settings will be restored at next &X-Server; startup. You need root access to use this option. Use this if you want to correct the gamma settings for all users and graphical environments on this machine.
de: Um die Gammawerte systemweit zu speichern, aktivieren Sie das Kästchen <guilabel>Einstellungen systemweit speichern</guilabel>. Die Einstellungen werden dann nach einem Neustart des &X-Server;s übernommen. Sie brauchen Systemverwalter-Rechte, wenn Sie diese Option nutzen wollen. Benutzen Sie diese Funktion, wenn Sie die Gammakorrektur für alle Benutzer und grafische Anwendungen auf diesem Computer übernehmen wollen.

source: To store the gamma settings to your personal &kde; configuration, do not enable that option. The user settings will be restored at next &kde; startup and replace temporary the system gamma settings. The system settings are not removed by that and will be restored at next &X-Server; startup.
de: Um die Gammawerte nur für Ihre eigene Konfiguration von &kde; zu verwenden, lassen Sie diese Funktion deaktiviert. Diese persönlichen Einstellungen des Benutzers werden nach dem nächsten Start von &kde; wirksam und ersetzen dann die systemweiten Einstellungen der Gammawerte. Die Systemwerte werden nicht entfernt oder verändert und beim nächsten Starts des &X-Server;s wieder verwendet.

source: On multi head systems, select the screen you want to alter with the combo box. This will also work with xinerama enabled. If you want to set all screens to the same gamma values, enable the <guilabel>Sync screens</guilabel> option. On systems with only one screen this option will take no effect.
de: Auf Systemen mit mehreren Bildschirmen wählen Sie den Schirm, dessen Werte Sie ändern wollen, mit dem Kombinationsfeld in der unteren rechten Ecke. Das funktioniert auch, wenn Xinerama aktiviert ist. Wenn Sie alle Bildschirme auf dieselben Gammawerte einstellen wollen, aktivieren Sie <guilabel>Bildschirme synchronisieren</guilabel>. Auf Systemen mit nur einem Bildschirm hat das keine Auswirkung.

source: Using the Test Images
de: Testbilder benutzen

source: This module provides six different test pictures selectable from the drop down box at the top of the window.
de: Dieses Modul enthält sechs verschiedene Testbilder, die aus dem Auswahlfeld oben im Dialog ausgewählt werden können.

source: Grey Scale Test Image
de: Testbild Grauskala

source: You should be able to see the following:
de: Sie sollten das Folgende sehen:

source: A grayscale with 20 different sections
de: Eine Grauskala mit 20 verschiedenen Abschnitten.

source: The darkest section pure black
de: Der dunkelste Abschnitt ist vollkommen schwarz

source: The lightest section pure white
de: Der hellste Abschnitt völlig weiß

source: No hint of any color in the gray tones
de: Keine Anzeichen irgendwelcher Farben in den Grautönen

source: If you cannot see all of the 20 sections, use your monitors contrast settings or the <guilabel>Gamma</guilabel> slider to correct this. If black is not pure black, try to darken the monitor, if white is not pure white, try to lighten it. If you see any colors in the gray tones alter the color balance settings of your monitor or the <guilabel>Red</guilabel>, <guilabel>Green</guilabel> and <guilabel>Blue</guilabel> slider.
de: Wenn Sie nicht alle der 20 Abschnitte sehen können, benutzen Sie die Kontrasteinstellungen des Bildschirms oder den <guilabel>Gamma</guilabel>regler um dies zu korrigieren. Wenn die schwarze Fläche nicht vollkommen schwarz ist, versuchen Sie die Helligkeit des Bildschirms zu verringern. Ist die weiße Fläche nicht völlig weiß, versuchen Sie die Helligkeit zu erhöhen. Wenn Sie irgendwelche Farben in den Grautönen sehen, verändern Sie die Farbeinstellungen Ihres Monitors oder benutzen Sie die <guilabel>Rot</guilabel>-, <guilabel>Grün</guilabel>- und <guilabel>Blau</guilabel>regler.

source: RGB Scale Test Picture
de: Testbild RGB-Skala

source: You should be able to see three strips, each with 16 sections of red, green or blue tones. The darkest sections should be pure black, the brightest should be pure red, green or blue. If you don't see all sections of a color strip, try to lighten or darken this color.
de: Sie sollten drei Streifen sehen können, jeder mit 16 Stufen, jeweils in Rot-, Grün- oder Blautönen. Die dunkelste Stufe sollte vollkommen schwarz, die hellste vollkommen rot, grün oder blau sein. Wenn Sie nicht alle Abstufungen einer Farbe sehen, sollten Sie versuchen, diese Farbe mit dem entsprechenden Regler zu erhellen oder zu verdunkeln.

source: CMY Scale Test Picture
de: Testbild CMY-Skala

source: You should be able to see three strips, each with 11 sections of cyan, magenta or yellow tones. The brightest sections should be pure white, the darkest should be pure cyan, magenta or yellow.
de: Sie sollten drei Streifen sehen können, jeder mit 11 Stufen Cyan-, Magenta- oder Gelbtönen. Die hellsten Stufe sollten völlig weiß, die dunkelste rein Cyan, Magenta oder Gelb sein.

source: If you cannot see all cyan sections, try to lighten or darken red
de: Wenn Sie nicht alle Cyanstufen sehen können, versuchen Sie den Rotwert zu verändern, bis alle Abstufungen erkennbar sind.

source: If you cannot see all magenta sections, try to lighten or darken green
de: Wenn Sie nicht alle Magentastufen sehen können, versuchen Sie den Grünwert zu verändern.

source: If you cannot see all yellow sections, try to lighten or darken blue
de: Wenn Sie nicht alle Gelbstufen sehen können, versuchen Sie den Gelbwert zu erhellen oder zu verdunkeln.

source: Advanced Test Pictures
de: Erweiterte Testbilder

source: The following three pictures show you the abilities of your monitor at three points of the gray spectrum. If you cannot see all of the details, don't be worry, or buy better hardware.
de: Die folgenden drei Bilder zeigen Ihnen die Fähigkeiten Ihres Monitors in bestimmten Bereichen des Grauspektrums. Wenn Sie nicht alle Details sehen können, obwohl Sie die für Ihren Monitor idealen Einstellungen verwenden, liegt es vermutlich an Ihrer Hardware.

source: Dark Gray Test Picture
de: Testbild Dunkelgrau

source: You should be able to see 10 different rectangles of dark gray within a black box. The chart shows you 1% steps from black.
de: Sie sollten zehn verschiedene, dunkelgraue Rechtecke in einem schwarzen Kasten sehen können. Das Diagramm zeigt Ihnen die Graustufen in 1&nbsp;%-Schritten ausgehend von Schwarz.

source: Mid Gray Test Picture
de: Testbild Mittelgrau

source: This picture shows you 11 gray rectangles within a 50% gray box. You should be able to see all of the rectangles except the middle one. The rectangles represent the steps from 45% to 55% gray.
de: Dieses Bild zeigt Ihnen 11 graue Rechtecke in einem 50&nbsp;% grauen Kasten. Sie sollten alle diese Rechtecke bis auf das mittlere sehen können. Die Rechtecke stellen die Stufen von 45&nbsp;% bis 55&nbsp;% Grau dar.

source: Light Gray Test Picture
de: Testbild Hellgrau

source: You should be able to see 10 different rectangles of light gray within a white box. The chart shows you 1% steps from white.
de: Sie sollten zehn verschiedene, hellgraue Rechtecke in einem weißen Kasten sehen. Das Diagramm zeigt Ihnen die Graustufen in Schritten von 1&nbsp;% ausgehend von Weiß .
