Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdegraphics/kolourpaint.po
Languages: de

source: If you hold &Ctrl; before moving the selection, then you will move a copy of it. The selection will be smeared when moving it while &Shift; is held.
de: Wenn Sie die &Ctrl;-Taste drücken, ehe Sie die Auswahl verschieben, wird die Auswahl kopiert. Wenn Sie die &Shift;-Taste drücken, ehe Sie die Auswahl verschieben, wird die Auswahl verwischt.

source: There are two selection modes: Opaque (default) and Transparent. If you use the Transparent selection mode, all pixels of the background color will be transparent (background subtraction). This allows you to paste a selection without the background. To perform background subtraction on a dithered image, use a <link linkend="color-box">Color Similarity</link> setting other than Exact.
de: Es gibt zwei Auswahl-Modi: Deckend (Voreinstellung) und Transparent. Benutzen Sie den transparenten Auswahl-Modus, dann sind alle Pixel in der Hintergrundfarbe transparent (Hintergrund-Subtraktion). Damit können Sie einen Bereich ohne den Hintergrund auswählen. Um die Hintergrund-Subtraktion in einem Bild mit Dither anzuwenden, müssen Sie die <link linkend="color-box">Farbähnlichkeit</link> auf einen anderen Wert als Exakt einstellen.

source: You can apply Image Effects to a selection - see the <link linkend="image-effects-section">Image Effects</link> section for more information.
de: Sie können Bildeffekte auf eine Auswahl anwenden - weitere Informationen finden Sie unter <link linkend="image-effects-section">Bildeffekte</link>.

source: Spraycan
de: Sprühdose

source: Click and drag to spray graffiti. Hold down the mouse button for a more concentrated spray.
de: Klicken und ziehen Sie, um Farbe aufzusprühen. Halten Sie den Mauszeiger mit gedrückter Taste länger auf die gleiche Stelle, um die Farbe kräftiger aufzutragen.

source: Click on one of the shapes to select the spray size. You can select from spray sizes of 9x9, 17x17 and 29x29.
de: Klicken Sie auf eine Form, um die Größe der Sprühdose einzustellen. Zur Auswahl stehen Ihnen Größen von 9x9, 17x17 und 29x29 Pixeln.

source: Click and drag an area in which to write text. As soon as the border will be shown you can start writing the text. Click and drag on the border to move it. You can resize the text box by dragging on the handles or by using the <link linkend="image-resize-scale">Resize</link> dialog.
de: Klicken und ziehen Sie, um ein Textfeld für die Eingabe zu öffnen. Sobald der Rand angezeigt wird, können Sie Text eingeben. Klicken und ziehen Sie den Rand, um das Feld zu verschieben. Die Größe des Textfeldes können Sie mit den Kontrollpunkten oder im Dialog <link linkend="image-resize-scale">Größe ändern</link> einstellen.

source: If you have deselected a text box you can use <guimenuitem>Undo</guimenuitem> to edit the text again.
de: Wenn Sie das Textfeld abgewählt haben, können Sie mit <guimenuitem>Rückgängig</guimenuitem> den Text noch einmal bearbeiten.

source: Using the Transparent Color
de: Arbeiten mit transparenten Farben

source: The left picture shows the example image. The right picture shows the addition of text with opaque foreground and background colors.
de: Links sehen Sie ein Beispielbild. Rechts das Bild mit Text in deckenden Vorder- und Hintergrundfarben.

source: The left picture shows the addition of text with opaque foreground colors and a transparent background color. The right picture shows the addition of text with a transparent foreground color and opaque background color.
de: Links sehen Sie das Beispielbild mit eingefügtem Text in deckender Vordergrundfarbe und transparenter Hintergrundfarbe. Rechts das Beispielbild mit eingefügtem Text in transparenter Vordergrundfarbe und deckender Hintergrundfarbe.

source: Common Tool Options
de: Gemeinsame Optionen für Werkzeuge

source: Click on one of the squares to select the eraser size. You can select from squares of side length 2, 3, 5, 9, 17 and 29 pixels.
de: Klicken Sie auf ein Quadrat, um die Größe der Radierer einzustellen. Zur Auswahl stehen Quadrate mit Seitenlängen von 2, 3, 5, 9, 17 und 29 Pixeln.

source: The eraser size setting affects the <link linkend="tool-erasers">Erasers</link>.
de: Diese Einstellung der Größe wirkt sich auf alle <link linkend="tool-erasers">Radierer</link> aus.

source: Click on one of the lines to select the line width. You can select from line widths of 1, 2, 3, 5 and 8 pixel(s).
de: Klicken Sie auf eine der Linien, um die Breite einzustellen. Zur Auswahl stehen Linienbreiten von 1, 2, 3, 5 und 8 Pixeln.

source: The line width setting affects the <link linkend="tool-polystar">Connected Lines</link>, <link linkend="tool-curve">Curve</link>, <link linkend="tool-ellipse">Ellipse</link>, <link linkend="tool-line">Line</link>, <link linkend="tool-polystar">Polygon</link>, <link linkend="tool-rectangles">Rectangle</link> and <link linkend="tool-rectangles">Rounded Rectangle</link> tools.
de: Die Einstellung der Linienbreite wirkt sich auf <link linkend="tool-polystar">Linienzug</link>, <link linkend="tool-curve">Kurve</link>, <link linkend="tool-ellipse">Ellipse</link>, <link linkend="tool-line">Linien</link>, <link linkend="tool-polystar">Polygon</link>, <link linkend="tool-rectangles">Rechteck</link> und <link linkend="tool-rectangles">Abgerundetes Rechteck</link> aus.

source: Click on one of the rectangles to select the fill style. You can select from No Fill, Fill with Background Color and Fill with Foreground Color.
de: Klicken Sie auf eines der Rechtecke, um die Flächenfüllung einzustellen. Zur Auswahl stehen <quote>Keine Füllung</quote> und Füllung mit Vorder- oder Hintergrundfarbe.

source: The fill style setting affects the <link linkend="tool-ellipse">Ellipse</link>, <link linkend="tool-polystar">Polygon</link>, <link linkend="tool-rectangles">Rectangle</link> and <link linkend="tool-rectangles">Rounded Rectangle</link> tools.
de: Die Einstellung der Flächenfüllung wirkt sich auf <link linkend="tool-ellipse">Ellipse</link>, <link linkend="tool-polystar">Polygon</link>, <link linkend="tool-rectangles">Rechteck</link> und <link linkend="tool-rectangles">Abgerundetes Rechteck</link> aus.

source: <title>Working with Color</title>
de: <title>Arbeiten mit Farben</title>

source: The Color Box
de: Das Farbfeld

source: Color Box
de: Farbfeld

source: The Color Box has 3 main sections: the Color Tablet, the Color Palette and the Color Similarity Selector.
de: Das Farbfeld ist in drei Abschnitte eingeteilt. Die Farbtafel, die Farbpalette und die Auswahl der Farbähnlichkeit.

source: The Color Tablet shows the current foreground color as a square on top of another square representing the current background color. When drawing with the &LMB;, the foreground color is used, and when drawing with the &RMB; the background color is used (except for the <link linkend="tool-erasers">Erasers</link>). You can click on the double-ended arrow to swap the foreground and background colors.
de: Die Farbtafel zeigt die aktuelle Vordergrundfarbe als Quadrat auf einem anderen Quadrat mit der Hintergrundfarbe. Die <mousebutton>linke</mousebutton> Maustaste zeichnet in der Vordergrundfarbe, die <mousebutton>rechte</mousebutton> Maustaste in der Hintergrundfarbe (mit Ausnahme der <link linkend="tool-erasers">Radierer</link>). Ein Klick auf den Doppelpfeil vertauscht Vorder- und Hintergrundfarbe.

source: The Color Palette shows a selection of colors for you to choose from. The translucent pyramid represents the transparent color. Left-click on a color to set the foreground color and right-click on a color to set the background color. You can also drag and drop any opaque color into the Color Tablet squares. To edit a color in the Color Tablet or Palette, double-click on it. The <link linkend="tool-color-picker">Color Picker</link> tool allows you to select a color from the image.
de: Die Farbpalette zeigt eine Reihe von Farben zur Auswahl an. Die durchsichtige Pyramide stellt die transparente Farbe dar. Ein Klick mit der linken Maustaste auf eine Farbe setzt die Vordergrundfarbe, ein Klick mit der rechten Maustaste auf eine Farbe die Hintergrundfarbe. Außerdem können Sie jede deckende Farbe auf die Quadrate der Farbtafel ziehen. Mit einem Doppelklick bearbeiten Sie Farben in der Farbtafel oder Farbpalette. Mit dem Werkzeug <link linkend="tool-color-picker">Farbwahl</link> können Sie auch eine Farbe aus dem Bild auswählen.

source: Color Similarity allows you to work more effectively with dithered images and photos, in a comparable manner to the <quote>Magic Wand</quote> feature of other paint programs. It applies to transparent selections, as well as the <link linkend="tool-flood-fill">Flood Fill</link>, <link linkend="tool-eraser-clr">Color Eraser</link> and <link linkend="image-autocrop">Autocrop / Remove Internal Border</link> tools. Double-click on the Color Similarity Selector to choose how similar colors must be to be considered identical. When using selections in Transparent mode, any color in the selection that is similar to the background color will also be made transparent.
de: Mit Farbähnlichkeit können Sie Bilder und Fotos mit Dither besser bearbeiten, etwa so wie mit der Eigenschaft <quote>Zauberstab</quote> anderer Zeichenprogramme. Farbähnlichkeit wird angewendet auf transparente Auswahl, aber auch auf die Werkzeuge <link linkend="tool-flood-fill">Fläche füllen</link>, <link linkend="tool-eraser-clr">Farbradierer</link> und <link linkend="image-autocrop">Automatisch zuschneiden / Internen Rand entfernen</link>. Mit Doppelklick auf das Symbol Farbähnlichkeit können Sie einstellen, wie ähnlich Farben sein müssen, um als gleich bewertet zu werden. Arbeiten Sie mit einer Auswahl im transparenten Modus, wird jede Farbe der Auswahl, die der Hintergrundfarbe ähnlich ist, auch transparent.

source: The left picture shows the example image. The right pictures demonstrate the use of a flood fill, with Color Similarity settings of 5%, 15% and 30%. In this example, with a Color Similarity setting of <guilabel>Exact</guilabel>, a flood fill at (80, 100) would only fill one pixel, as the surrounding pixels are similar but not identical. As Color Similarity is increased, more pixels that are similar in color are considered identical, hence the fill extends further.
de: Das Bild links zeigt ein Beispiel. Die rechten Bilder zeigen die Anwendung der Flächenfüllung mit Farbähnlichkeiten von 5&nbsp;%, 15&nbsp;% und 30&nbsp;%. In diesem Beispiel füllt die Flächenfüllung mit einer Farbähnlichkeit <guilabel>Exakt</guilabel> in (80, 100) nur einen Punkt, da die benachbarten Pixel ähnlich, aber nicht gleich sind. Wird die Einstellung für die Farbähnlichkeit vergrößert, werden auch mehr Pixel mit ähnlicher Farbe als gleich bewertet, dadurch vergrößert sich die Flächenfüllung.

source: <title>View Options</title>
de: <title>Ansichtsoptionen</title>

source: View Options Reference
de: Referenz der Ansichtsoptionen

source: <link linkend="view-zoom">Zoom incorporating the Grid</link>
de: <link linkend="view-zoom">Vergrößerung einschließlich des Gitters</link>

source: <link linkend="view-thumbnail">Thumbnail</link>
de: <link linkend="view-thumbnail">Vorschaubild</link>

source: <title>Zoom incorporating the Grid</title>
de: <title>Vergrößerung einschließlich des Gitters</title>

source: Increase the zoom level to edit images with more precision, or reduce it to see more of the image.
de: Erhöhen Sie den Vergrößerungsfaktor, um Bilder genauer bearbeiten zu können, oder verringern Sie ihn, um das gesamte Bild zu sehen.

source: At zoom levels that aren't multiples of 100%, parts of the image may appear to move when the user interacts with it. Other minor redraw glitches may also occur at such zoom levels.
de: Bei Vergrößerungsfaktoren, die kein Vielfaches von 100&nbsp;% sind, können sich Teile des Bildes bei der Bearbeitung verschieben. Außerdem treten auch kleinere Darstellungsfehler auf.

source: At zoom levels of 400% or greater that are also multiples of 100%, you can <guimenuitem>Show Grid</guimenuitem> to more accurately edit individual pixels.
de: Bei Vergrößerungsfaktoren von mehr als 400&nbsp;%, die ein Vielfaches von 100&nbsp;% sind, können Sie ein <guimenuitem>Gitter anzeigen</guimenuitem> lassen, um einzelne Pixel genauer bearbeiten zu können.

source: The first picture shows the <link linkend="tool-text">Text</link> tool icon, while the latter shows it at 600% zoom with the grid on.
de: Das erste Bild zeigt das Werkzeugsymbol <link linkend="tool-text">Text</link>, das nächste das gleiche Symbol bei einem Vergrößerungsfaktor von 600&nbsp;% mit eingeschaltetem Gitter.

source: Another way of zooming when not drawing is to scroll the <mousebutton>wheel</mousebutton> while holding &Ctrl;.
de: Zusätzlich können Sie mit dem <mousebutton>Mausrad</mousebutton> bei gedrückter &Ctrl;taste die Vergrößerung ändern.

source: <title>Thumbnail</title>
de: <title>Vorschaubild</title>

source: If <guimenuitem>Zoomed Thumbnail Mode</guimenuitem> is selected, the entire image is displayed, scaled as required to fit the thumbnail window (top-right picture).
de: Im <guimenuitem>Modus „Vollständiges Vorschaubild“</guimenuitem> wird das gesamte Bild so skaliert, das es vollständig in das Vorschaufenster passt (Bild rechts-oben).

source: Otherwise, the thumbnail displays as much of the image as possible, starting from the top-left of the main view (bottom-right picture).
de: Ansonsten zeigt das Vorschaubild den oberen linken Bereich des Bildes im Hauptfensters an (Bild rechts-unten).

source: <title>Image Effects</title>
de: <title>Bildeffekte</title>

source: Image Effects Reference
de: Referenz der Bildeffekte

source: <link linkend="image-autocrop">Autocrop / Remove Internal Border</link>
de: <link linkend="image-autocrop">Automatisch zuschneiden / Internen Rand entfernen</link>

source: <link linkend="image-balance">Balance</link>
de: <link linkend="image-balance">Abgleich</link>

source: <link linkend="image-clear">Clear</link>
de: <link linkend="image-clear">Löschen</link>

source: <link linkend="image-emboss">Emboss</link>
de: <link linkend="image-emboss">Relief</link>

source: <link linkend="image-flatten">Flatten</link>
de: <link linkend="image-flatten">Einfärben</link>

source: <link linkend="image-flip">Flip (upside down)</link>
de: <link linkend="image-flip">Senkrecht spiegeln</link>

source: <link linkend="image-invert">Invert</link>
de: <link linkend="image-invert">Invertieren</link>

source: <link linkend="image-reduce-colors">Reduce Colors</link>
de: <link linkend="image-reduce-colors">Farben reduzieren</link>

source: <link linkend="image-grayscale">Reduce to Grayscale</link>
de: <link linkend="image-grayscale">In Graustufen umwandeln</link>

source: <link linkend="image-monochrome">Reduce to Monochrome (Dithered)</link>
de: <link linkend="image-monochrome">In Schwarzweiß umwandeln (mit Dither)</link>

source: <link linkend="image-mirror">Mirror (horizontally)</link>
de: <link linkend="image-mirror">Waagerecht spiegeln</link>

source: <link linkend="image-resize-scale">Resize / Scale</link>
de: <link linkend="image-resize-scale">Größe ändern / Skalieren</link>

source: <link linkend="image-rotate">Rotate</link>
de: <link linkend="image-rotate">Drehen</link>

source: <link linkend="image-set-as-image">Set as Image (Crop)</link>
de: <link linkend="image-set-as-image">Als Bild verwenden (Zuschneiden)</link>

source: <link linkend="image-skew">Skew</link>
de: <link linkend="image-skew">Kippen</link>

source: <link linkend="image-soften-sharpen">Soften &amp; Sharpen</link>
de: <link linkend="image-soften-sharpen">Weich- &amp; Scharfzeichnen</link>

source: <link linkend="image-more-effects">More Effects</link>
de: <link linkend="image-more-effects">Mehr Effekte</link>

source: <link linkend="image-notes">Notes</link>
de: <link linkend="image-notes">Anmerkungen</link>

source: <title>Autocrop / Remove Internal Border</title>
de: <title>Automatisch zuschneiden / Internen Rand entfernen</title>

source: This automatically removes the border of an image or selection. Use Autocrop if you have a figure that does not fill the entire image or selection and you wish to remove the excess whitespace. To use this feature with a dithered image border, you will also need to use <link linkend="color-box">Color Similarity</link>.
de: Entfernt automatisch den Randbereich eines Bildes oder einer Auswahl. Benutzen Sie ‚Automatisch zuschneiden‘ für eine Zeichnung, die das gesamte Bild oder die Auswahl nicht ausfüllt, wenn Sie den überstehenden Randbereich abschneiden wollen. Verwenden Sie diese Eigenschaft bei einem Randbereich mit Dither, müssen Sie auch die <link linkend="color-box">Farbähnlichkeit</link> einstellen.

source: <title>Balance</title>
de: <title>Abgleich</title>

source: This feature is accessible from the <link linkend="image-more-effects">More Effects</link> dialog.
de: Diese Eigenschaft erreichen Sie über den Dialog <link linkend="image-more-effects">Mehr Effekte</link>.

source: This allows you to set the brightness, contrast and gamma of the image or selection.
de: Hier können Sie Helligkeit, Kontrast und Gammawert des Bildes oder der Auswahl einstellen.

source: The more common measure of gamma (a decimal from 0.10 to 10.00) is located between the <guilabel>Gamma</guilabel> spinbox and the <guibutton>Reset</guibutton> button.
de: Der gebräuchliche Wert für Gamma (ein Dezimalwert von 0,10 bis 10,00) wird zwischen dem Drehfeld <guilabel>Gamma</guilabel> und dem Knopf <guibutton>Zurücksetzen</guibutton> angezeigt.

source: <title>Clear</title>
de: <title>Löschen</title>

source: This fills the entire image or selection with the background color.
de: Dies füllt das gesamte Bild oder die Auswahl mit der Hintergrundfarbe.

source: Double-click on the <link linkend="tool-eraser-std">Eraser</link> icon to clear the entire image.
de: Mit einem Doppelklick auf das Symbol <link linkend="tool-eraser-std">Radierer</link> löschen Sie das gesamte Bild.

source: <title>Emboss</title>
de: <title>Relief</title>

source: Check <guilabel>Enable</guilabel> to apply the Emboss effect. This emphasises the edges and gives the image or selection an &quot;engraved look&quot;.
de: Kreuzen Sie <guilabel>Aktivieren</guilabel> an, um den Prägeeffekt zu verwenden. Dies betont die Kanten und gibt dem Bild oder der Auswahl ein &quot;eingraviertes Aussehen&quot;.

source: <title>Flatten</title>
de: <title>Einfärben</title>

source: This recolors the image with varying shades of the two selected colors.
de: Färbt das Bild in verschiedenen Zwischentönen der beiden ausgewählten Farben.

source: <title>Flip (upside down)</title>
de: <title>Senkrecht spiegeln</title>

source: This flips the entire image or selection vertically.
de: Spiegelt das gesamte Bild oder die Auswahl senkrecht.

source: <title>Invert</title>
de: <title>Invertieren</title>

source: This allows you to invert one or more RGB channels in the image or selection. Select <guilabel>All</guilabel> to change a photo into a negative and vice versa. This generally looks quite funny.
de: Invertiert einen oder mehr RGB-Kanäle eines Bildes oder einer Auswahl. Wählen Sie <guilabel>Alle</guilabel>, um ein Foto in ein Negativ und umgekehrt zu ändern.

source: To quickly invert all channels, you do not need to use this dialog. You can instead access the <guimenuitem>Invert Colors</guimenuitem> item in the <guimenu>Image</guimenu> or <guimenu>Selection</guimenu> menu. The <guimenu>Selection</guimenu> item is only displayed in the menubar if you use one of the selection tools. Additionally you can reach this action from the context menu opened with a &RMB; click in the image area.
de: Um schnell alle Kanäle zu invertieren, müssen Sie nicht diesen Dialog verwenden. Wählen Sie stattdessen den Eintrag <guimenuitem>Farben invertieren</guimenuitem> im Menü <guimenu>Bild</guimenu> oder im Menü <guimenu>Auswahl</guimenu>. Das Menü <guimenu>Auswahl</guimenu> wird nur dann angezeigt, wenn Sie ein Auswahlwerkzeug verwenden. Zusätzlich finden Sie diese Aktion im Kontextmenü, das durch einen Klick mit der &RMBn; in den Bildbereich geöffnet wird.

source: <title>Mirror (horizontally)</title>
de: <title>Waagerecht spiegeln</title>

source: This mirrors the entire image or selection horizontally.
de: Spiegelt das gesamte Bild oder die Auswahl waagerecht.

source: <title>Reduce Colors</title>
de: <title>Farben reduzieren</title>

source: This reduces the number of colors used by the image or selection, with or without dithering.
de: Dies verringert die Anzahl der im Bild oder der Auswahl benutzten Farben, mit oder ohne Dither.

source: Dithering generally provides better quality results, however, you may wish to disable it for artistic effects; &eg; using <guilabel>Monochrome</guilabel> instead of <guilabel>Monochrome (Dithered)</guilabel> gives a silhouette effect.
de: Dither ergibt im allgemeinen bessere Ergebnisse, für künstliche Effekte aber können Sie Dither auch abschalten, &eg; erzeugt <guilabel>Schwarzweiß</guilabel> anstelle von <guilabel>Schwarzweiß (Dither)</guilabel> eine Silhouette als Effekt.

source: Another important distinction is that while <guilabel>Monochrome (Dithered)</guilabel> will always reduce the entire image or selection to black and white, <guilabel>Monochrome</guilabel> will do this only if the image or selection contains more than 2 colors.
de: Ein weiterer wichtiger Unterschied: Während <guilabel>Schwarzweiß (Dither)</guilabel> immer das gesamte Bild oder die Auswahl in schwarzweiß umwandelt, geschieht das bei <guilabel>Schwarzweiß</guilabel> nur wenn, das Bild oder die Auswahl mehr als zwei Farben enthält.

source: For a quick, dithered monochrome image or selection, use the <link linkend="image-monochrome">Reduce to Monochrome (Dithered)</link> item of the <guimenu>Image</guimenu> or <guimenu>Selection</guimenu> menu. The <guimenu>Selection</guimenu> item is only displayed in the menubar if you use one of the selection tools. Additionally you can reach this action from the context menu opened with a &RMB; click in the image area.
de: Mit dem Menüeintrag <link linkend="image-monochrome">In Schwarzweiß umwandeln (mit Dither)</link> aus dem Menü <guimenu>Bild</guimenu> oder <guimenu>Auswahl</guimenu> können Sie schnell ein Bild oder eine Auswahl in Schwarzweiß umwandeln. Das Menü <guimenu>Auswahl</guimenu> wird nur dann angezeigt, wenn Sie ein Auswahlwerkzeug verwenden. Zusätzlich finden Sie diese Aktion im Kontextmenü, das durch einen Klick mit der &RMBn; in den Bildbereich geöffnet wird.

source: Changing the number of colors here has no effect on the color depth of the file format. If you want to change the color depth, you should select it in the file saving dialogs. Note that, confusingly, changing the color depth also changes the number of colors.
de: Die Änderung der Anzahl der Farben hier hat keine Auswirkungen auf die Farbtiefe des Dateiformates. Wenn Sie die Farbtiefe ändern wollen, müssen Sie dies im Dialog <quote>Datei speichern</quote> eingeben. Beachten Sie aber, das die Änderung der Farbtiefe auch die Anzahl der Farben ändert.

source: <title>Reduce to Grayscale</title>
de: <title>In Graustufen umwandeln</title>

source: This reduces the entire image or selection to grayscale.
de: Wandelt das gesamte Bild oder die Auswahl in Graustufen um.

source: <title>Reduce to Monochrome (Dithered)</title>
de: <title>In Schwarzweiß umwandeln (mit Dither)</title>

source: This reduces the entire image or selection to black and white.
de: Dies wandelt das gesamte Bild oder die Auswahl in Schwarzweiß um.

source: If you do not want the image or selection to be dithered, use the <link linkend="image-reduce-colors"> Reduce Colors</link> dialog.
de: Benutzen Sie den Dialog <link linkend="image-reduce-colors">Farben reduzieren</link>, wenn die Umwandlung ohne Dither erfolgen soll
