Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdegraphics/kolourpaint.po
Languages: de

source: <title>Resize / Scale</title>
de: <title>Größe ändern / Skalieren</title>

source: Resizing the image changes the dimensions of the image without applying a transformation to the existing contents. Scaling the image will stretch the existing contents to the new dimensions. <guibutton>Smooth Scale</guibutton> generally provides better quality results than Scaling, by blending neighbouring colors.
de: Die Änderung der Größe eines Bildes verändert nicht den vorhandenen Inhalt. Eine Skalierung des Bildes jedoch passt den Inhalt an die neue Größe an. <guibutton>Intelligent Skalieren</guibutton> ergibt im allgemeinen bessere Ergebnisse durch Mischen benachbarter Farben als Skalieren.

source: You can express the new dimensions in pixels, or as a percentage of the original size. If you select <guilabel>Keep aspect ratio</guilabel>, the width and height will be scaled by the same percentage.
de: Die neuen Abmessungen können Sie in Pixeln oder als Verhältnis zur Originalgröße eingeben. Wenn Sie <guilabel>Seitenverhältnis beibehalten</guilabel> ankreuzen, wird Breite und Höhe um den gleichen Faktor verändert.

source: You can free-form <guibutton>Resize</guibutton> the entire image or <guibutton>Smooth Scale</guibutton> the selection using the corresponding handles.
de: Mit den Kontrollpunkten können Sie das ganze Bild in der <guibutton>Größe ändern</guibutton> oder eine Auswahl <guibutton>Intelligent Skalieren</guibutton>.

source: Only scaling is supported for selections, and only resizing is supported for text boxes. See <link linkend="image-notes">Notes</link> for additional details about applying these effects.
de: Eine Auswahl können Sie nur Skalieren und ein Textfeld nur in der Größe verändern. In den <link linkend="image-notes">Anmerkungen</link> finden Sie weitere Einzelheiten über die Anwendung dieser Effekte.

source: <title>Rotate</title>
de: <title>Drehen</title>

source: This rotates the image. You can specify the angle and direction of rotation.
de: Dreht das Bild. Geben Sie Winkel und Richtung der Drehung ein.

source: You can reverse the direction of rotation by specifying a negative custom angle.
de: Die Drehrichtung können Sie mit der Eingabe eines negativen Winkels umkehren.

source: See <link linkend="image-notes">Notes</link> for details about applying this effect to a selection.
de: In den <link linkend="image-notes">Anmerkungen</link> finden Sie Einzelheiten über die Anwendung dieses Effektes auf eine Auswahl.

source: <title>Set as Image (Crop)</title>
de: <title>Als Bild verwenden (Zuschneiden)</title>

source: This will set the selection as the image.
de: Ersetzt das Bild durch die Auswahl.

source: This is only available when you have an active selection.
de: Dies kann nur bei einer aktiven Auswahl angewählt werden.

source: <title>Skew</title>
de: <title>Kippen</title>

source: This skews the entire image or selection horizontally and/or vertically.
de: Kippt das gesamte Bild oder die Auswahl waagerecht und/oder senkrecht.

source: <title>Soften &amp; Sharpen</title>
de: <title>Weich- &amp; Scharfzeichnen</title>

source: Use this effect to soften or sharpen the image.
de: Mit diesem Effekt können Sie das Bild weich- oder scharfzeichnen.

source: <title>More Effects</title>
de: <title>Mehr Effekte</title>

source: This dialog contains the <link linkend="image-balance">Balance</link>, <link linkend="image-emboss">Emboss</link>, <link linkend="image-flatten">Flatten</link>, <link linkend="image-invert">Invert</link>, <link linkend="image-reduce-colors">Reduce Colors</link> and <link linkend="image-soften-sharpen">Soften &amp; Sharpen</link> features.
de: Dieser Dialog enthält die Eigenschaften <link linkend="image-balance">Abgleich</link>, <link linkend="image-emboss">Relief</link>, <link linkend="image-flatten">Einfärben</link>, <link linkend="image-invert">Invertieren</link>, <link linkend="image-reduce-colors">Farben reduzieren</link> und <link linkend="image-soften-sharpen">Weich- &amp; Scharfzeichnen</link>.

source: <title>Notes</title>
de: <title>Anmerkungen</title>

source: <link linkend="image-resize-scale">Resizing / Scaling</link>, <link linkend="image-rotate">Rotating</link> and <link linkend="image-skew">Skewing</link> may change the dimensions of the image. You can view the new dimensions in the dialog.
de: <link linkend="image-resize-scale">Größe ändern / Skalieren</link>, <link linkend="image-rotate">Drehen</link> und <link linkend="image-skew">Kippen</link> können die Größe des Bildes verändern. Die neuen Abmessungen sehen Sie im Dialog.

source: If you apply these effects to an image, the image will be resized if necessary. However, if you apply these effects to a selection, the image will not be resized, even if the transformed selection does not fit.
de: Wenn Sie diese Effekte auf ein Bild anwenden, wird dessen Größe verändert, falls erforderlich. Wenden Sie diese Effekte jedoch auf eine Auswahl an, wird die Größe des Bildes nicht verändert, sogar wenn die umgeformte Auswahl nicht ins Bild passt.

source: The left image has been rotated 30 degrees clockwise to form the right image. &kolourpaint; has automatically enlarged the image to accommodate the larger contents.
de: Das linke Bild wurde um 30 Grad im Uhrzeigersinn gedreht und ergibt damit das rechte Bild. &kolourpaint; hat das Bild automatisch vergrößert, um den größeren Inhalt ein zu passen.

source: The left <emphasis>selection</emphasis> has been rotated 30 degrees clockwise to form the right selection. The image size has remained the same, hence parts of the selection will not be visible without <link linkend="image-resize-scale">Resizing</link> the <emphasis>image</emphasis>.
de: Die linke <emphasis>Auswahl</emphasis> wurde um 30 Grad im Uhrzeigersinn gedreht und ergibt damit die rechte Auswahl. Die Größe des Bildes ist unverändert, daher sind Teile der Auswahl ohne <link linkend="image-resize-scale">Anpassung der Größe</link> des <emphasis>Bildes</emphasis> nicht sichtbar.

source: Credits and License
de: Danksagungen und Lizenz

source: It might not be concise documentation; it might not be complete documentation; but it is honest documentation.
de: Dies ist vielleicht nicht die prägnanteste und nicht die vollständige Dokumentation, aber die aufrichtigste Dokumentation.

source: Program Copyright &copy; 2003, 2004, 2005 &Clarence.Dang; &Clarence.Dang.mail;
de: Programm Copyright &copy; 2003, 2004, 2005 &Clarence.Dang; &Clarence.Dang.mail;

source: &kolourpaint;-specific icons Copyright &copy; 2004, 2005 Kristof Borrey <email>borrey@kde.org</email>, Nuno Pinheiro <email>nf.pinheiro@gmail.com</email>, &Danny.Allen; <email>dannya40uk@yahoo.co.uk</email>
de: Symbole für &kolourpaint; Copyright &copy; 2004, 2005 Kristof Borrey <email>borrey@kde.org</email>, Nuno Pinheiro <email>nf.pinheiro@gmail.com</email>, &Danny.Allen; <email>dannya40uk@yahoo.co.uk</email>

source: Documentation and additional documentation artwork Copyright &copy; 2004, 2005 &Thurston.Dang; &Thurston.Dang.mail;
de: Dokumentation und zusätzliche Vorlagen für die Dokumentation Copyright &copy; 2004, 2005 &Thurston.Dang; &Thurston.Dang.mail;.

source: Portions reproduced with permission from <ulink url="http://kolourpaint.sourceforge.net/"></ulink>.
de: Teile der Dokumentation mit Genehmigung von <ulink url="http://kolourpaint.sourceforge.net/"></ulink>.

source: CREDIT_FOR_TRANSLATORS
de: <para>Übersetzung Burkhard Lück <email>lueck@hube-lueck.de</email></para>

source: This program is licensed as follows:
de: Diese Programm hat folgende Lizenz:

source: How to obtain &kolourpaint;
de: Wie Sie &kolourpaint; erhalten

source: More frequent releases with support for previous versions of &kde; are available at <ulink url="http://kolourpaint.sourceforge.net/">http://kolourpaint.sourceforge.net/</ulink>.
de: Auf <ulink url="http://kolourpaint.sourceforge.net/">http://kolourpaint.sourceforge.net/</ulink> finden Sie häufig neuere Versionen des Programms, die auch unter älteren Versionen von &kde; laufen.

source: Compilation and Installation
de: Kompilierung und Installation

source: If you are reading this help in the &khelpcenter;, then &kolourpaint; has already been installed on this system and you do not need to follow these generic instructions.
de: Wenn Sie dieses Handbuch im &khelpcenter-de; lesen, dann ist &kolourpaint; bereits auf Ihrem System installiert und Sie müssen die folgenden grundsätzlichen Anweisungen nicht mehr beachten.
