Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdegraphics/kolourpaint.po
Languages: de

source: The &kolourpaint; Handbook
de: Das Handbuch zu &kolourpaint;

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Burkhard</firstname><surname>Lück</surname><affiliation><address><email>lueck@hube-lueck.de</email></address></affiliation><contrib>Übersetzung</contrib></othercredit>

source: &kolourpaint; is a free, easy-to-use paint program for &kde;.
de: &kolourpaint; ist ein freies und einfach zu benutzendes Mal- und Zeichenprogramm für &kde;.

source: Introduction
de: Einleitung

source: &kolourpaint; is a free, easy-to-use paint program for &kde;. It's perfect for everyday tasks such as:
de: &kolourpaint; ist ein freies und einfach zu benutzendes Mal- und Zeichenprogramm für &kde;. Es ist gut geeignet für alltägliche Aufgaben wie:

source: Painting - drawing diagrams and <quote>finger painting</quote>
de: Zeichnen von Diagrammen und <quote>Freihandzeichnen</quote>

source: Manipulating Screenshots - acquiring and editing screenshots
de: Bearbeitung von Bildschirmfotos - Aufnehmen und verändern

source: Image Manipulation - editing photos and acquired images; applying effects
de: Bildbearbeitung - Fotos und eingescannte Fotos bearbeiten, Effekte anwenden

source: Icon Editing - drawing clipart and logos with transparency
de: Bearbeitung von Symbolen - Zeichnen von Cliparts und Logos mit Transparenz

source: Using &kolourpaint;
de: Arbeiten mit &kolourpaint;

source: Click on the following links to explore &kolourpaint;'s capabilities:
de: Klicken Sie auf folgende Verknüpfungen, um die Eigenschaften von &kolourpaint; kennen zu lernen:

source: <link linkend="tools-chapter">Tools</link>
de: <link linkend="tools-chapter">Werkzeuge</link>

source: <link linkend="working-with-color">Working with Color</link>
de: <link linkend="working-with-color">Arbeiten mit Farben</link>

source: <link linkend="view-options-chapter">View Options</link>
de: <link linkend="view-options-chapter">Ansichtsoptionen</link>

source: <link linkend="image-effects-chapter">Image Effects</link>
de: <link linkend="image-effects-chapter">Bildeffekte</link>

source: <title>Tools</title>
de: <title>Werkzeuge</title>

source: Acquiring Screenshots
de: Aufnehmen von Bildschirmfotos

source: A <quote>screenshot</quote> is a snapshot of what is on your computer's screen. It can be useful to explain some actions that should be done to obtain the result, or to show the issue that you have found.
de: Ein <quote>Bildschirmfoto</quote> zeigt den Inhalt des Bildschirms Ihres Rechners. Damit können Sie erklären, welche Aktionen für ein bestimmte Aufgabe ausgeführt werden sollen oder Probleme zeigen, die Sie gefunden haben.

source: To make screenshot ready for editing in &kolourpaint; window you can use <menuchoice><guimenu>File</guimenu> <guimenuitem>Acquire Screenshot</guimenuitem></menuchoice> item from &kolourpaint; main menu.
de: Um Bildschirmfotos zur Bearbeitung in das &kolourpaint; zu laden wählen Sie <menuchoice><guimenu>Datei</guimenu><guimenuitem>Bildschirmfoto aufnehmen</guimenuitem></menuchoice> aus dem Menü.

source: Using the opened dialog you can change <guilabel>Screenshot Delay</guilabel> (in seconds), and choose to <guilabel>Hide Main Window</guilabel> during screenshoting. When you are ready to take screenshot just click <guibutton>OK</guibutton>. The screenshot taken will be placed directly into the &kolourpaint; editing area.
de: Stellen Sie dann im Dialog eine <guilabel>Verzögerung für Bildschirmfotos</guilabel> ein und aktivieren oder deaktivieren <guilabel>Hauptfenster ausblenden</guilabel> für die Aufnahme. Haben Sie alles richtig eingestellt, drücken Sie auf <guibutton>OK</guibutton>. Das aufgenommenen Bildschirmfoto wird dann direkt im Bearbeitungsbereich von &kolourpaint; angezeigt.

source: Tool Reference
de: Referenz der Werkzeuge

source: A quick way to select a tool in &kolourpaint; is to press the single key shortcut associated with it, documented below and in the <interface>Tool Box</interface> tooltips. You can also hold <keycombo action="simul">&Alt;&Shift;</keycombo> while pressing the key, which is necessary when you are writing text (as the single key shortcuts will be disabled). For example, to select the brush, press <keycombo action="simul">&Alt;&Shift;<keycap>B</keycap></keycombo> or just B (when not writing text).
de: Um ein Werkzeug in &kolourpaint; schnell auszuwählen, drücken Sie das einzelne zugeordnete Tastenkürzel. Diese Tastenkürzel werden im folgenden Text und in den Kurztipps des <interface>Werkzeugkastens</interface> beschrieben. Sie können diese Tastenkürzel auch mit gedrückten <keycombo action="simul">&Alt;&Shift;</keycombo>-Tasten benutzen, dies ist sogar bei der Texteingabe erforderlich (die einzelnen Tastenkürzel sind hier abgeschaltet). Um zum Beispiel den Pinsel auszuwählen, drücken Sie <keycombo action="simul">&Alt;&Shift;<keycap>B</keycap></keycombo> oder nur B, wenn Sie keinen Text eingeben.

source: <link linkend="tool-brush"><guiicon> <inlinemediaobject><imageobject><imagedata fileref="tool_brush.png" format="PNG"/> </imageobject></inlinemediaobject> </guiicon></link> <link linkend="tool-brush">Brush</link> (B)
de: <link linkend="tool-brush"><guiicon> <inlinemediaobject><imageobject><imagedata fileref="tool_brush.png" format="PNG"/> </imageobject></inlinemediaobject> </guiicon></link> <link linkend="tool-brush">Pinsel</link> (B)

source: <link linkend="tool-eraser-clr"><guiicon> <inlinemediaobject><imageobject> <imagedata fileref="tool_color_washer.png" format="PNG"/> </imageobject> </inlinemediaobject> </guiicon> </link> <link linkend="tool-eraser-clr">Color Eraser</link> (O)
de: <link linkend="tool-eraser-clr"><guiicon> <inlinemediaobject><imageobject> <imagedata fileref="tool_color_washer.png" format="PNG"/> </imageobject> </inlinemediaobject> </guiicon> </link> <link linkend="tool-eraser-clr">Farbradierer</link> (O)

source: <link linkend="tool-color-picker"><guiicon> <inlinemediaobject> <imageobject> <imagedata fileref="tool_color_picker.png" format="PNG"/> </imageobject> </inlinemediaobject> </guiicon> </link> <link linkend="tool-color-picker">Color Picker</link> (C)
de: <link linkend="tool-color-picker"><guiicon> <inlinemediaobject> <imageobject> <imagedata fileref="tool_color_picker.png" format="PNG"/> </imageobject> </inlinemediaobject> </guiicon> </link> <link linkend="tool-color-picker">Farbauswahl</link> (C)

source: <link linkend="tool-polystar"> <guiicon> <inlinemediaobject> <imageobject> <imagedata fileref="tool_polyline.png" format="PNG"/> </imageobject> </inlinemediaobject> </guiicon> </link> <link linkend="tool-polystar">Connected Lines</link> (N)
de: <link linkend="tool-polystar"> <guiicon> <inlinemediaobject> <imageobject> <imagedata fileref="tool_polyline.png" format="PNG"/> </imageobject> </inlinemediaobject> </guiicon> </link> <link linkend="tool-polystar">Linienzug</link> (N)

source: <link linkend="tool-curve"> <guiicon> <inlinemediaobject> <imageobject> <imagedata fileref="tool_curve.png" format="PNG"/> </imageobject> </inlinemediaobject> </guiicon> </link> <link linkend="tool-curve">Curve</link> (V)
de: <link linkend="tool-curve"> <guiicon> <inlinemediaobject> <imageobject> <imagedata fileref="tool_curve.png" format="PNG"/> </imageobject> </inlinemediaobject> </guiicon> </link> <link linkend="tool-curve">Kurve</link> (V)

source: <link linkend="tool-eraser-std"> <guiicon> <inlinemediaobject> <imageobject> <imagedata fileref="tool_eraser.png" format="PNG"/> </imageobject> </inlinemediaobject> </guiicon> </link> <link linkend="tool-eraser-std">Eraser</link> (A)
de: <link linkend="tool-eraser-std"> <guiicon> <inlinemediaobject> <imageobject> <imagedata fileref="tool_eraser.png" format="PNG"/> </imageobject> </inlinemediaobject> </guiicon> </link> <link linkend="tool-eraser-std">Radierer</link> (A)

source: <link linkend="tool-flood-fill"> <guiicon> <inlinemediaobject> <imageobject> <imagedata fileref="tool_flood_fill.png" format="PNG"/> </imageobject> </inlinemediaobject> </guiicon> </link> <link linkend="tool-flood-fill">Flood Fill</link> (F)
de: <link linkend="tool-flood-fill"> <guiicon> <inlinemediaobject> <imageobject> <imagedata fileref="tool_flood_fill.png" format="PNG"/> </imageobject> </inlinemediaobject> </guiicon> </link> <link linkend="tool-flood-fill">Fläche füllen</link> (F)

source: <link linkend="tool-line"> <guiicon> <inlinemediaobject> <imageobject> <imagedata fileref="tool_line.png" format="PNG"/> </imageobject> </inlinemediaobject> </guiicon> </link> <link linkend="tool-line">Line</link> (L)
de: <link linkend="tool-line"> <guiicon> <inlinemediaobject> <imageobject> <imagedata fileref="tool_line.png" format="PNG"/> </imageobject> </inlinemediaobject> </guiicon> </link> <link linkend="tool-line">Linie</link> (L)

source: <link linkend="tool-pen"> <guiicon> <inlinemediaobject> <imageobject> <imagedata fileref="tool_pen.png" format="PNG"/> </imageobject> </inlinemediaobject> </guiicon> </link> <link linkend="tool-pen">Pen</link> (P)
de: <link linkend="tool-pen"> <guiicon> <inlinemediaobject> <imageobject> <imagedata fileref="tool_pen.png" format="PNG"/> </imageobject> </inlinemediaobject> </guiicon> </link> <link linkend="tool-pen">Stift</link> (P)

source: <link linkend="tool-rectangles"> <guiicon> <inlinemediaobject> <imageobject> <imagedata fileref="tool_rectangle.png" format="PNG"/> </imageobject> </inlinemediaobject> </guiicon> </link> <link linkend="tool-rectangles">Rectangle</link> (R)
de: <link linkend="tool-rectangles"> <guiicon> <inlinemediaobject> <imageobject> <imagedata fileref="tool_rectangle.png" format="PNG"/> </imageobject> </inlinemediaobject> </guiicon> </link> <link linkend="tool-rectangles">Rechteck</link> (R)

source: <link linkend="tool-rectangles"> <guiicon> <inlinemediaobject> <imageobject> <imagedata fileref="tool_rounded_rectangle.png" format="PNG"/> </imageobject> </inlinemediaobject> </guiicon> </link> <link linkend="tool-rectangles">Rounded Rectangle</link> (U)
de: <link linkend="tool-rectangles"> <guiicon> <inlinemediaobject> <imageobject> <imagedata fileref="tool_rounded_rectangle.png" format="PNG"/> </imageobject> </inlinemediaobject> </guiicon> </link> <link linkend="tool-rectangles">Abgerundetes Rechteck</link> (U)

source: <link linkend="tool-selections"> <guiicon> <inlinemediaobject> <imageobject> <imagedata fileref="tool_elliptical_selection.png" format="PNG"/> </imageobject> </inlinemediaobject> </guiicon> </link> <link linkend="tool-selections">Selection (Elliptical)</link> (I)
de: <link linkend="tool-selections"> <guiicon> <inlinemediaobject> <imageobject> <imagedata fileref="tool_elliptical_selection.png" format="PNG"/> </imageobject> </inlinemediaobject> </guiicon> </link> <link linkend="tool-selections">Auswahl (elliptisch)</link> (I)

source: <link linkend="tool-selections"> <guiicon> <inlinemediaobject> <imageobject> <imagedata fileref="tool_free_form_selection.png" format="PNG"/> </imageobject> </inlinemediaobject> </guiicon> </link> <link linkend="tool-selections">Selection (Free-Form)</link> (M)
de: <link linkend="tool-selections"> <guiicon> <inlinemediaobject> <imageobject> <imagedata fileref="tool_free_form_selection.png" format="PNG"/> </imageobject> </inlinemediaobject> </guiicon> </link> <link linkend="tool-selections">Auswahl (Freihand)</link> (M)

source: <link linkend="tool-selections"> <guiicon> <inlinemediaobject> <imageobject> <imagedata fileref="tool_rect_selection.png" format="PNG"/> </imageobject> </inlinemediaobject> </guiicon> </link> <link linkend="tool-selections">Selection (Rectangular)</link> (S)
de: <link linkend="tool-selections"> <guiicon> <inlinemediaobject> <imageobject> <imagedata fileref="tool_rect_selection.png" format="PNG"/> </imageobject> </inlinemediaobject> </guiicon> </link> <link linkend="tool-selections">Auswahl (rechteckig)</link> (S)

source: <link linkend="tool-spraycan"> <guiicon> <inlinemediaobject> <imageobject> <imagedata fileref="tool_spraycan.png" format="PNG"/> </imageobject> </inlinemediaobject> </guiicon> </link> <link linkend="tool-spraycan">Spraycan</link> (Y)
de: <link linkend="tool-spraycan"> <guiicon> <inlinemediaobject> <imageobject> <imagedata fileref="tool_spraycan.png" format="PNG"/> </imageobject> </inlinemediaobject> </guiicon> </link> <link linkend="tool-spraycan">Sprühdose</link> (Y)

source: Brush
de: Pinsel

source: Click or click and drag with the brush to draw.
de: Klicken oder Ziehen Sie mit der gedrückten linken Maustaste, um mit dem Pinsel zu malen.

source: Click on one of the shapes to select the brush shape. You can use a circular, square, slash or backslash brush shape.
de: Klicken Sie auf eine der Formen, um die Art des Pinsels auszuwählen. Es gibt Pinsel als Kreis, Quadrat, Schrägstrich und umgekehrten Schrägstrich.

source: The &LMB; draws in the foreground color. The &RMB; draws in the background color.
de: Die &LMB; zeichnet in der Vordergrundfarbe, die &RMB; in der Hintergrundfarbe.

source: Color Picker
de: Farbauswahl

source: To set the foreground color, <mousebutton>left</mousebutton> click on a pixel. To set the background color, <mousebutton>right</mousebutton> click on a pixel. &kolourpaint; will then return to the previously selected tool.
de: Um die Vordergrundfarbe einzustellen, klicken Sie mit der <mousebutton>linken</mousebutton> Maustaste auf ein Pixel im Bild. Für die Hintergrundfarbe benutzen Sie die <mousebutton>rechte</mousebutton> Maustaste. &kolourpaint; arbeitet dann mit dem vorher gewählten Werkzeug weiter.

source: Connected Lines and Polygon
de: Linienzug und Polygon

source: Click and drag to draw connected lines. The polygon tool is used in the same way, however, the start and end points are automatically connected to form a polygon.
de: Klicken oder Ziehen Sie mit der gedrückten linken Maustaste, um Linienzüge zu zeichnen. Für Polygone klicken Sie einzelne Punkte, die Anfangs- und Endpunkte werden dann automatisch zu einem Polygon verbunden.

source: The &LMB; draws in the foreground color. The &RMB; draws in the background color, and will also reverse the fill color for polygons.
de: Die &LMB; zeichnet in der Vordergrundfarbe, die &RMB; Maustaste in der Hintergrundfarbe und kehrt auch die Füllfarbe für Polygone um.

source: You can <link linkend="tool-options">set the line width</link>. For polygons, you can also <link linkend="tool-options">set the fill style</link>.
de: Sie können die <link linkend="tool-options">Linienbreite</link> und für Polygone auch die <link linkend="tool-options">Flächenfüllung</link> einstellen.

source: Curve
de: Kurve

source: Click and drag to draw a line - this sets the start and end points. You can set up to two control points by dragging. To finish the curve without using both or any control points, click the other mouse button. The curve tool draws a Cubic Bezier.
de: Mit Klicken und Ziehen zeichnen Sie eine Linie - dies legt den Anfangs- und Endpunkt der Kurve fest. Durch Ziehen können Sie bis zu zwei Kontrollpunkte setzen. Um die Kurve ohne diese Kontrollpunkte zu zeichnen, klicken Sie mit der anderen Maustaste. Das Werkzeug Kurve zeichnet eine kubische Bezier-Kurve.

source: You can also <link linkend="tool-options">set the line width</link>.
de: Sie können auch die <link linkend="tool-options">Linienbreite</link> einstellen.

source: Click and drag to draw an ellipse.
de: Klicken und ziehen Sie, um eine Ellipse zu zeichnen.

source: The &LMB; draws in the foreground color. The &RMB; draws in the background color, and will reverse the fill color.
de: Die &LMB; zeichnet in der Vordergrundfarbe, die &RMB; in der Hintergrundfarbe und kehrt die Füllfarbe um.

source: You can also <link linkend="tool-options">set the line width and fill style</link>.
de: Sie können auch die <link linkend="tool-options">Linienbreite und die Flächenfüllung</link> einstellen.

source: For additional functionality, use the modifier keys:
de: Weitere Funktionen erreichen Sie mit diesen Zusatztasten:

source: Hold &Shift; and drag to draw a circle.
de: Halten Sie die &Shift;-Taste gedrückt und ziehen Sie, um einen Kreis zu zeichnen.

source: To draw an ellipse with a center point of your choice, hold &Ctrl;, click on the center point, and drag until the ellipse is the correct size and shape.
de: Um eine Ellipse mit einem bestimmten Mittelpunkt zu zeichnen, halten Sie die &Ctrl;-Taste, klicken auf den Mittelpunkt und ziehen, bis die Ellipse die gewünschte Größe und Form hat.

source: To draw a circle with a center point of your choice, hold &Ctrl; and &Shift;, click on the center point, and drag until the circle is the correct size.
de: Um einen Kreis mit einem bestimmten Mittelpunkt zu zeichnen, halten Sie die &Ctrl;- und die &Shift;-Tasten, klicken auf den Mittelpunkt und ziehen, bis der Kreis die gewünschte Größe hat.

source: Erasers
de: Die Radierer

source: Eraser
de: Radierer

source: Click and drag with the eraser to rub out mistakes.
de: Klicken und ziehen Sie mit dem Radierer, um Fehler zu beseitigen.

source: Unlike other tools, the erasers draw in the background color. To draw in the foreground color, use the &RMB;.
de: Im Gegensatz zu den anderen Werkzeugen zeichnet der Radierer in der Hintergrundfarbe. Um mit der Vordergrundfarbe zu radieren, benutzen Sie die &RMB;.

source: The eraser only has <link linkend="tool-options">square shapes</link>. To draw with other shapes such as circles use the <link linkend="tool-brush">Brush</link> and the &RMB;.
de: Der Radierer hat nur eine <link linkend="tool-options">quadratische </link>Form. Um mit anderen Formen zu radieren, benutzen Sie den <link linkend="tool-brush">Pinsel</link> und die &RMB;.

source: Double-click on the Eraser icon to clear the entire image. This is equivalent to using the <link linkend="image-clear">Clear</link> option on the Image menu.
de: Ein Doppelklick auf das Symbol Radierer löscht die gesamte Zeichnung. Dies erreichen Sie auch mit <link linkend="image-clear">Löschen</link> im Menü Bild.

source: Color Eraser
de: Farbradierer

source: Click and drag to replace pixels of the foreground color with the background color. To replace all pixels similar (but not necessarily exactly equal) to the foreground color, such as in dithered images and photos, use a <link linkend="color-box">Color Similarity</link> setting other than Exact.
de: Klicken und ziehen Sie, um in den Pixeln die Vordergrundfarbe durch die Hintergrundfarbe zu ersetzen. Um alle Pixel auf gleiche Art (aber nicht zwingend genau gleich) in die Vordergrundfarbe umzuwandeln, wie zum Beispiel Bilder mit Dither oder Fotos, benutzen Sie als Einstellung für <link linkend="color-box">Farbähnlichkeit</link> einen anderen Wert als Exakt.

source: Unlike other tools, the erasers draw in the background color. To replace pixels of the background color with the foreground color, use the &RMB;.
de: Im Gegensatz zu den anderen Werkzeugen zeichnet der Radierer in der Hintergrundfarbe. Um in den Pixeln die Hintergrundfarbe durch die Vordergrundfarbe zu ersetzen, benutzen Sie die &RMB;.

source: You can configure the <link linkend="tool-options">eraser size</link>.
de: Sie können die <link linkend="tool-options">Größe des Radierers</link> einstellen.

source: Double-click on the Color Eraser icon to apply it to the entire image.
de: Mit einem Doppelklick auf das Symbol „Farbradierer“ bearbeiten Sie das gesamte Bild.

source: Flood Fill
de: Fläche füllen

source: Click to fill a region. To fill a dithered region, use a <link linkend="color-box">Color Similarity</link> setting other than Exact.
de: Klicken Sie in einen Bereich, um ihn mit Farbe zu füllen. Für eine Füllung mit Dither stellen Sie die <link linkend="color-box">Farbähnlichkeit</link> auf einen andern Wert als Exakt ein.

source: The &LMB; fills in the foreground color. The &RMB; fills in the background color.
de: Die &LMB; füllt mit der Vordergrundfarbe, die &RMB; mit der Hintergrundfarbe.

source: Line
de: Linie

source: Click and drag to draw a line.
de: Klicken und ziehen Sie, um eine Linie zu zeichnen.

source: Hold &Ctrl; to draw lines angled at the nearest multiple of 30 degrees - these are the lines in the red diagram.
de: Mit gedrückter &Ctrl;-Taste zeichnen Sie Linien mit Winkeln in 30 Grad-Schritten - dies sind die Linien im roten Diagramm.

source: Hold &Shift; to draw lines angled at the nearest multiple of 45 degrees - these are the lines in the blue diagram.
de: Mit gedrückter &Shift;-Taste zeichnen Sie Linien mit Winkeln in 45 Grad-Schritten - dies sind die Linien im blauen Diagramm.

source: Hold &Ctrl; and &Shift; to draw lines angled at the nearest multiple of 30 or 45 degrees - these are the lines in the green diagram.
de: Mit gedrückter &Ctrl;- und &Shift;-Taste zeichnen Sie Linien mit Winkeln in 30 und 45 Grad-Schritten - dies sind die Linien im grünen Diagramm.

source: <title>Pen</title>
de: <title>Stift</title>

source: Click to draw a dot or click and drag to draw a freehand line.
de: Mit Klicken zeichnen Sie einen Punkt, mit Klicken und Ziehen eine Freihandlinie.

source: Rectangles
de: Rechtecke

source: Click and drag to draw a rectangle. The Rounded Rectangle is a Rectangle with rounded corners.
de: Klicken und ziehen Sie, um ein Rechteck zu zeichnen. Das Abgerundete Rechteck wird mit runden Ecken gezeichnet.

source: Hold &Shift; and drag to draw a square.
de: Ziehen bei gedrückter &Shift;-Taste zeichnet ein Quadrat.

source: To draw a rectangle with a center point of your choice, hold &Ctrl;, click on the center point, and drag until the rectangle is the correct size and shape.
de: Um ein Rechteck mit einem bestimmten Mittelpunkt zu zeichnen, halten Sie die &Ctrl;-Taste, klicken auf den Mittelpunkt und ziehen, bis das Rechteck die gewünschte Größe und Form hat.

source: To draw a square with a center point of your choice, hold &Ctrl; and &Shift;, click on the center point, and drag until the square is the correct size.
de: Um ein Quadrat mit einem bestimmten Mittelpunkt zu zeichnen, halten Sie die &Ctrl;- und die &Shift;-Tasten, klicken auf den Mittelpunkt und ziehen, bis das Quadrat die gewünschte Größe hat.

source: Selections
de: Auswahl

source: Use the selection tools to draw out the boundary of a selection.
de: Mit den Auswahlwerkzeugen können Sie die Grenzen einer Auswahl zeichnen.

source: To move the selection, click and drag on it. The main view will scroll as required to allow you to move the selection to part of the image that is not currently displayed.
de: Klicken Sie auf eine Auswahl und ziehen Sie, um sie zu verschieben. Die Ansicht des gesamten Bildes wird, falls notwendig, auch verschoben, damit Sie sie die Auswahl auch in aktuell nicht angezeigte Teile des Bildes bewegen können.

source: You can free-form <link linkend="image-resize-scale">Resize</link> the entire image or <link linkend="image-resize-scale">Smooth Scale</link> the selection using the corresponding handles. Hold &Shift; while free-form scaling the selection to maintain aspect ratio. The &RMB; invokes a context menu with common <guimenu>Edit</guimenu> commands and <link linkend="image-effects-section">Image Effects</link>.
de: Sie können das ganze Bild mit <link linkend="image-resize-scale">Größe verändern</link> oder die Auswahl mit <link linkend="image-resize-scale">Intelligent skalieren</link> durch Ziehen an den Kontrollpunkten bearbeiten. Drücken Sie die &Shift;taste beim Ziehen, um das Seitenverhältnis einer Auswahl beizubehalten. Die &RMB; öffnet ein Kontextmenü mit den Befehlen <guimenu>Bearbeiten</guimenu> und <link linkend="image-effects-section">Bildeffekte</link>.

source: You can use the cursor keys while drawing out the boundary of the selection or while moving it.
de: Sie können auch die Cursor-Tasten benutzen, um die Grenze einer Auswahl zu zeichnen oder sie zu verschieben.
