Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdegraphics/kruler.po
Languages: de

source: The &kruler; Handbook
de: Das Handbuch zu &kruler;

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Robert</firstname><surname>Gogolok</surname> <affiliation><address><email>robertgogolok@gmx.de</email></address></affiliation> <contrib>Übersetzung des Handbuchs</contrib></othercredit> <othercredit role="translator"><firstname>Marco</firstname><surname>Wegner</surname> <affiliation><address><email>mail@marcowegner.de</email></address></affiliation> <contrib>Überarbeitung der Übersetzung</contrib></othercredit> <othercredit role="translator"><firstname>Stefan</firstname><surname>Winter</surname> <affiliation><address><email>swinter@kde.org</email></address></affiliation> <contrib>Übersetzung der Programmoberfläche</contrib></othercredit>

source: &kruler; can be used to measure objects on the screen.
de: &kruler; kann verwendet werden, um Objekte auf dem Bildschirm zu vermessen.

source: Introduction
de: Einleitung

source: &kruler; is a very simple application, with only one aim in life. To measure pixel distances and colors on your screen. It is useful for working on layout of dialogs, web pages &etc;
de: &kruler; ist eine sehr einfache Anwendung mit nur einem Ziel: Abstände von Pixeln und Farben auf dem Bildschirm zu messen. Es hilft z. B. bei Arbeiten an Webseiten-Layouts oder bei der Arbeit an Dialogen &etc;

source: To start &kruler;, choose <menuchoice><guimenu>Applications</guimenu><guisubmenu>Graphics</guisubmenu> <guisubmenu>More Applications</guisubmenu> <guimenuitem>Screen Ruler</guimenuitem></menuchoice> from your &kmenu;.
de: Um &kruler; zu starten, wählen Sie <menuchoice><guimenu>Programme</guimenu><guisubmenu>Grafik</guisubmenu> <guisubmenu>Weitere Programme</guisubmenu> <guimenuitem>Bildschirmlineal - KRuler</guimenuitem></menuchoice> aus dem &kmenu;.

source: Clicking with the &LMB; on the &kruler; will turn the cursor to a cross with four arrows and enables you to drag &kruler; around the screen.
de: Klicken mit der <mousebutton>linken</mousebutton> Maustaste auf &kruler; ändert den Mauszeiger in ein Kreuz mit vier Pfeilen und ermöglicht es Ihnen, &kruler; auf dem Bildschirm zu verschieben.

source: When you move the mouse over &kruler;, your cursor will turn into an elongated arrow, with a circle at one end. As you move the cursor, &kruler; will display how far from the point marked <guilabel>0</guilabel> the circle on the end of the cursor currently is. &kruler; will also display the &HTML; color code of the color currently under the circle. This is very useful for picking out colors from an image. If you move the mouse far enough that the arrow cursor is no longer touching &kruler;, the cursor will revert to normal, allowing you to carry on working with your other applications.
de: Wenn Sie die Maus über &kruler; bewegen, ändert sich ihr Zeiger in einen verlängerten Pfeil mit einem Kreis an einem Ende. Wenn Sie den Mauszeiger bewegen, zeigt &kruler; an, wie weit der Kreis am Ende des Zeigers gerade von dem Punkt entfernt ist, der mit <guilabel>0</guilabel> markiert ist. &kruler; zeigt auch den &HTML;-Code der Farbe unter dem Kreis an. Das ist sehr nützlich beim Auslesen von Farben eines Bildes. Wenn sie die Maus weit genug fort bewegen, sodass der Zeiger mit dem Pfeil nicht mehr &kruler; berührt, kehrt der Zeiger in den normalen Zustand zurück, der es Ihnen erlaubt, die Arbeit mit anderen Anwendungen fortzusetzen.

source: You can change the orientation in three different ways:
de: Sie können die Ausrichtung des Lineals auf drei verschieden Arten ändern:

source: Clicking the &MMB; switches the ruler from vertical to horizontal orientation
de: Klicken Sie mit der &MMBn; auf das Lineal, um zwischen der vertikalen und horizontalen Ausrichtung zu wechseln.

source: By clicking the rotation buttons to turn 90 degrees to the left or right. If the rotation buttons are not displayed on the ruler, enable them with <guilabel>Show rotation buttons</guilabel> in the <link linkend="settings-dialog">settings dialog</link>
de: Klicken Sie auf die Drehsymbole, um das Lineal in Schritten von 90 Grad im oder gegen den Uhrzeigersinn zu drehen. Werden die Drehsymbole auf dem Lineal nicht angezeigt, aktivieren Sie die Anzeige mit <guilabel>„Drehen“-Knopf anzeigen</guilabel> im <link linkend="settings-dialog">Einrichtungsdialog</link>.

source: Using the context menu, described in the next chapter
de: Benutzen Sie das Kontextmenü, wie im nächsten Kapitel beschrieben.

source: Menu Reference
de: Menüreferenz

source: Clicking with the &RMB; on the ruler will pop up a context menu, with the following entries:
de: Das Klicken mit der <mousebutton>rechten</mousebutton> Maustaste auf das Lineal öffnet ein Kontextmenü mit den folgenden Einträgen:

source: Orientation
de: Ausrichtung

source: This submenu contains entries that allow you to change the orientation of &kruler;
de: Dieses Untermenü enthält Einträge, die es Ihnen erlauben, die Ausrichtung von &kruler; zu ändern.

source: <shortcut> <keycap>N</keycap> </shortcut> <guisubmenu>Orientation</guisubmenu> <guimenuitem>North</guimenuitem>
de: <shortcut> <keycap>N</keycap> </shortcut> <guisubmenu>Ausrichtung</guisubmenu> <guimenuitem>Nord</guimenuitem>

source: Turns &kruler; so the ruler is horizontal, and the measurements are on the top (North) of the ruler
de: Dreht &kruler; so, dass das Lineal waagerecht liegt und der Maßstab im oberen Teil (Norden) des Lineals ist.

source: <shortcut> <keycap>E</keycap> </shortcut> <guisubmenu>Orientation</guisubmenu> <guimenuitem>East</guimenuitem>
de: <shortcut> <keycap>E</keycap> </shortcut> <guisubmenu>Ausrichtung</guisubmenu> <guimenuitem>Ost</guimenuitem>

source: Turns &kruler; so the ruler is vertical, and the measurements are on the right (East) of the ruler
de: Dreht &kruler; so, dass das Lineal senkrecht liegt und sich der Maßstab auf der rechten Seite (Osten) des Lineals befindet.

source: <shortcut> <keycap>S</keycap> </shortcut> <guisubmenu>Orientation</guisubmenu> <guimenuitem>South</guimenuitem>
de: <shortcut> <keycap>S</keycap> </shortcut> <guisubmenu>Ausrichtung</guisubmenu> <guimenuitem>Süd</guimenuitem>

source: Turns &kruler; so the ruler is horizontal, and the measurements are on the bottom (South) of the ruler
de: Dreht &kruler; so, dass das Lineal waagerecht liegt und sich der Maßstab im unteren Teil (Süden) des Lineals befindet.

source: <shortcut> <keycap>W</keycap> </shortcut> <guisubmenu>Orientation</guisubmenu> <guimenuitem>West</guimenuitem>
de: <shortcut><keycap>W</keycap></shortcut> <guisubmenu>Ausrichtung</guisubmenu><guimenuitem>West</guimenuitem>

source: Turns &kruler; so the ruler is vertical, and the measurements are on the left (West) of the ruler
de: Dreht &kruler; so, dass das Lineal senkrecht liegt und sich der Maßstab auf der linken Seite (Westen) des Lineals befindet.

source: <shortcut> <keycap>R</keycap> </shortcut> <guisubmenu>Orientation</guisubmenu> <guimenuitem>Turn Right</guimenuitem>
de: <shortcut><keycap>R</keycap></shortcut> <guisubmenu>Ausrichtung</guisubmenu><guimenuitem>Im Uhrzeigersinn drehen</guimenuitem>

source: Turns the ruler 90 Degrees to the right. For example, if it is oriented South, it will rotate to be oriented West.
de: Dreht das Lineal 90 Grad nach rechts. War es zum Beispiel nach Süden orientiert, so ändert sich die Ausrichtung auf West.

source: <shortcut> <keycap>L</keycap> </shortcut> <guisubmenu>Orientation</guisubmenu> <guimenuitem>Turn Left</guimenuitem>
de: <shortcut><keycap>L</keycap></shortcut> <guisubmenu>Ausrichtung</guisubmenu><guimenuitem>Gegen den Uhrzeigersinn drehen</guimenuitem>

source: Turns the ruler 90 Degrees to the left. For example, if it is oriented West, it will rotate to be oriented South.
de: Dreht das Lineal 90 Grad nach links. War es zum Beispiel nach Westen orientiert, so ändert sich die Ausrichtung auf Süd.

source: Length
de: Länge

source: This submenu contains entries that allow you to change the length of &kruler;
de: Dieses Untermenü enthält Einträge, die es Ihnen erlauben, die Länge von &kruler; zu verändern.

source: <shortcut><keycombo action="simul">&Ctrl; <keycap>S</keycap></keycombo> </shortcut> <guisubmenu>Length</guisubmenu> <guimenuitem>Short</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl; <keycap>S</keycap></keycombo> </shortcut> <guisubmenu>Länge</guisubmenu> <guimenuitem>Kurz</guimenuitem>

source: Makes &kruler; short - about 385 pixels long.
de: Minimale Länge für &kruler; - etwa 385 Pixel.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>M</keycap></keycombo> </shortcut> <guisubmenu>Length</guisubmenu> <guimenuitem>Medium</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>M</keycap></keycombo> </shortcut> <guisubmenu>Länge</guisubmenu> <guimenuitem>Mittel</guimenuitem>

source: Makes &kruler; a medium length - about 640 pixels long.
de: Mittlere Länge für &kruler; - etwa 640 Pixel.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>T</keycap></keycombo> </shortcut> <guisubmenu>Length</guisubmenu> <guimenuitem>Tall</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>T</keycap></keycombo> </shortcut> <guisubmenu>Länge</guisubmenu> <guimenuitem>Lang</guimenuitem>

source: Makes &kruler; long - about 960 pixels in length.
de: Maximale Länge für &kruler; - etwa 960 Pixel.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>F</keycap></keycombo> </shortcut> <guisubmenu>Length</guisubmenu> <guimenuitem>Full Screen Width</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>F</keycap></keycombo> </shortcut> <guisubmenu>Länge</guisubmenu> <guimenuitem>Volle Bildschirmbreite</guimenuitem>

source: Makes &kruler; the same size as your screen width.
de: Bringt &kruler; auf Bildschirmbreite.

source: <guisubmenu>Length</guisubmenu> <guimenuitem>Length...</guimenuitem>
de: <guisubmenu>Länge</guisubmenu> <guimenuitem>Länge ...</guimenuitem>

source: Opens a dialog to enter the size in pixel.
de: Öffnet einen Dialog, in dem Sie die Größe direkt eingeben können.

source: Additionally, you can change the length and move the right side of the ruler using the mousewheel. When holding the &Shift; key the opposite side will change.
de: Zusätzlich können Sie die Länge und die rechte Seite des Lineals mit dem Mausrad ändern. Wenn Sie dabei die &Shift;taste gedrückt halten, wird die linke Seite geändert.

source: Scale
de: Skalieren

source: This option lets you set the ruler scale to <guilabel>Right to Left</guilabel> (<keycap>D</keycap>), <guilabel>Center Origin</guilabel> (<keycap>C</keycap>), <guilabel>Offset</guilabel> (<keycap>O</keycap>) and <guilabel>Percentage</guilabel>.
de: Für die Skala des Lineals gibt es folgende Einstellungen: <guilabel>Rechts nach links</guilabel> (<keycap>D</keycap>), <guilabel>Ursprung zentriert</guilabel> (<keycap>C</keycap>), <guilabel>Versatz</guilabel> (<keycap>O</keycap>) und <guilabel>Prozent</guilabel>.

source: Changing the offset via the mousewheel is also possible when holding the &LMB;.
de: Der Versatz kann auch mit dem Mausrad geändert geändert werden, wenn Sie dabei die &LMB; gedrückt halten.

source: Opacity
de: Durchsichtigkeit

source: This menu item displays a slider to change the opacity of &kruler;.
de: Dieses Menüeintrag zeigt einen Schieberegler um die Deckkraft von &kruler; zu ändern.

source: Configure Shortcuts...
de: Kurzbefehle festlegen ...

source: The <guilabel>Configure Shortcut</guilabel> dialog allows you to assign shortcuts to &kruler; actions, and configure the shortcuts already assigned.
de: Der Dialog <guilabel>Kurzbefehle festlegen</guilabel> ermöglicht es Ihnen, &kruler;-Aktionen Tastaturkürzel zuzuweisen und die schon vorhandene Kurzbefehl einzurichten.

source: For more information, read the section about the <ulink url="help:/fundamentals/config.html#shortcuts">Shortcuts</ulink> of the &kde; Fundamentals.
de: Weitere Informationen dazu finden Sie im Abschnitt <ulink url="help:/fundamentals/confightml#shortcuts">Kurzbefehle</ulink> der &kde;-Grundlagen.

source: Configure &kruler;...
de: &kruler; einrichten ...

source: <screeninfo>&kruler;'s settings dialog</screeninfo>
de: <screeninfo>&kruler;s Einstellungsdialog</screeninfo>

source: <phrase>&kruler;'s settings dialog</phrase>
de: <phrase>&kruler;s Einstellungsdialog</phrase>

source: In this dialog you can change the background color and font, enable rotation and close buttons on the ruler and enable the tray icon.
de: In diesem Dialog können Sie die Hintergrundfarbe, die Schriftart auf dem Lineal, die Knöpfe zum Schließen und Drehen aktivieren und &kruler; als Symbol in der Kontrollleiste anzeigen lassen.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>C</keycap></keycombo> </shortcut> <guimenuitem>Copy Color</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>C</keycap></keycombo> </shortcut> <guimenuitem>Farbe kopieren</guimenuitem>

source: Copies the &HTML; color code of the color currently under the circle to the clipboard.
de: Kopiert den Farbcode der aktuellen Farbe unter dem Kreis im &HTML;-Format in die Zwischenablage.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>W</keycap></keycombo> </shortcut> <guimenuitem>Close</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>W</keycap></keycombo> </shortcut> <guimenuitem>Schließen</guimenuitem>

source: <action>Hides</action> &kruler;. It can be shown again using the icon in the system tray. The context menu displays this item only when <guilabel>Show tray icon</guilabel> is checked in the <link linkend="settings-dialog">settings dialog</link>.
de: <action>Blendet</action> &kruler; aus. Durch Klicken auf das Symbol in der Kontrollleiste kann &kruler; wieder angezeigt werden. Das Kontextmenü enthält diesen Eintrag nur, wenn <guilabel>Symbol im Systemabschnitt der Kontrollleiste</guilabel> im <link linkend="settings-dialog">Einrichtungsdialog</link> aktiviert ist.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo> </shortcut> <guimenuitem>Quit</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo> </shortcut> <guimenuitem>Beenden</guimenuitem>

source: <action>Quits</action> &kruler;
de: <action>Beendet</action> &kruler;

source: &kruler; has the common &kde; <guimenu>Help</guimenu> menu item, for more information read the section about the <ulink url="help:/fundamentals/ui.html#menus-help">Help Menu</ulink> of the &kde; Fundamentals.
de: &kruler; benutzt die bekannten &kde;-Einträge im Menü <guimenu>Hilfe</guimenu>, weitere Informationen dazu finden Sie im Abschnitt über das Menü <ulink url="help:/fundamentals/uihtml#menus-help">Hilfe</ulink> der &kde;-Grundlagen.

source: Credits and License
de: Danksagungen und Lizenz

source: Thanks to Gunnstein Lye <email>gl@ez.no</email> for the initial port to &kde; 2
de: Dank geht an Gunnstein Lye <email>gl@ez.no</email> für die ursprüngliche Portierung auf &kde; 2

source: Documentation Copyright &Lauri.Watts; &Lauri.Watts.mail;
de: Copyright für die Dokumentation &Lauri.Watts; &Lauri.Watts.mail;

source: CREDIT_FOR_TRANSLATORS
de: <para>Übersetzung des Handbuchs: Robert Gogolok <email>robertgogolok@gmx.de</email> und Marco Wegner <email>mail@marcowegner.de</email></para> <para>Übersetzung der Programmoberfläche: Stefan Winter <email>swinter@kde.org</email></para>
