Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdegraphics/okular.po
Languages: de

source: If %f is not specified, then the document name is appended to the specified command.
de: Wenn %f nicht angegeben wird, wird der Dateiname automatisch an den Aufruf angehängt.

source: Credits and License
de: Danksagungen und Lizenz

source: Program Copyright:
de: Copyright des Programms:

source: &Albert.Astals.Cid; &Albert.Astals.Cid.mail; Current maintainer
de: &Albert.Astals.Cid; &Albert.Astals.Cid.mail; Aktueller Betreuer

source: Enrico Ros <email>eros.kde@email.it</email> &kpdf; developer
de: Enrico Ros <email>eros.kde@email.it</email> &kpdf;-Entwickler

source: Documentation Copyright:
de: Copyright der Dokumentation:

source: Titus Laska <email>titus.laska@gmx.de</email> Some updates and additions
de: Titus Laska <email>titus.laska@gmx.de</email> Bearbeitung und Erweiterung

source: CREDIT_FOR_TRANSLATORS
de: <para>Übersetzung Burkhard Lück<email>lueck@hube-lueck.de</email></para>

source: How to obtain &okular;
de: Woher Sie &okular; bekommen

source: Compilation and Installation
de: Kompilierung und Installation

source: If you are reading this help in the &khelpcenter;, &okular; has already been installed on this system and you do not need install it anymore.
de: Wenn Sie dieses Handbuch im &khelpcenter-de; lesen, dann ist &okular; bereits auf Ihrem System installiert und Sie müssen die folgenden Anweisungen nicht mehr beachten.
