Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdegraphics/okular.po
Languages: de

source: For more details on editor configuration please refer to the <link linkend="configeditor">corresponding section of this manual</link>.
de: Weitere Details zur Einrichtung des Editors finden Sie in <link linkend="configeditor">diesem Kapitel des Handbuchs</link>.

source: <screeninfo>Configuring &okular;</screeninfo>
de: <screeninfo>Einrichtung von &okular;</screeninfo>

source: <phrase>Configuring editor in &okular;</phrase>
de: <phrase>Einrichtung des Editors in &okular;</phrase>

source: <para>Configuring editor in &okular;</para>
de: <para>Einrichtung des Editors in &okular;</para>

source: &okular; Advanced Features
de: Weitergehende Funktionen von &okular;

source: Embedded Files
de: Eingebettete Dateien

source: If the current document has some files embedded in it, when you open it a yellow bar will appear above the page view to notify you about the embedded files.
de: Enthält das aktuelle Dokument eingebettete Dateien, wird beim Öffnen eine gelbe Leiste über dem Ansichtsfenster mit einem Hinweis auf diese eingebetteten Dateien angezeigt.

source: <screeninfo>The embedded files bar</screeninfo>
de: <screeninfo>Die Statusleiste für eingebettete Dateien</screeninfo>

source: <phrase>The embedded files bar</phrase>
de: <phrase>Die Statusleiste für eingebettete Dateien</phrase>

source: In this case, you can either click on the link in the text of the bar or choose <menuchoice><guimenu>File</guimenu><guimenuitem>Embedded Files</guimenuitem></menuchoice> to open the embedded files dialog. The dialog allows you to view the embedded files and to extract them.
de: Dann können Sie entweder auf die Verknüpfung im Text klicken oder im Menü <menuchoice><guimenu>Datei</guimenu><guimenuitem>Eingebettete Dateien</guimenuitem></menuchoice> wählen, um den Dialog für eingebettete Dateien zu öffnen. In diesem Dialog werden diese Dateien angezeigt und Sie können sie speichern.

source: Forms
de: Formulare

source: If the current document has forms, when you open it a bar will appear above the page view where you can enable the forms.
de: Enthält das aktuelle Dokument Formulare, wird beim Öffnen eine Leiste über dem Ansichtsfenster angezeigt, in der Sie die Formularfelder zur Eingabe aktivieren können.

source: <screeninfo>The forms bar</screeninfo>
de: <screeninfo>Die Formularleiste</screeninfo>

source: <phrase>The forms bar</phrase>
de: <phrase>Die Formularleiste</phrase>

source: In this case, you can either click on <guilabel>Show Forms</guilabel> in the bar or choose <menuchoice><guimenu>View</guimenu><guimenuitem>Show Forms</guimenuitem></menuchoice> to enter data into the form fields.
de: Dann können Sie entweder auf <guilabel>Formulare anzeigen</guilabel> klicken oder im Menü <menuchoice><guimenu>Ansicht</guimenu><guimenuitem>Formulare anzeigen</guimenuitem></menuchoice> wählen, um Text in die Formularfelder einzugeben.

source: <title>Annotations</title>
de: <title>Anmerkungen</title>

source: &okular; allows you to review and annotate your documents. Annotations created in &okular; are automatically saved in the internal local data folder for each user. &okular; does not implicitly change any document it opens.
de: In &okular; können Sie Anmerkungen zu Dokumenten schreiben. Diese Anmerkungen werden automatisch im lokalen Datenordner des Benutzers gespeichert, nicht im Dokument. Geöffnete Dokumente werden in &okular; nicht geändert.

source: <screeninfo>&okular;'s Annotations</screeninfo>
de: <screeninfo>&okular;s Anmerkungen</screeninfo>

source: <phrase>&okular;'s Annotations</phrase>
de: <phrase>&okular;s Anmerkungen</phrase>

source: &okular; has two different kind of annotations:
de: In &okular; gibt es zwei Arten von Anmerkungen:

source: Text annotations like <guilabel>Yellow Highlighter</guilabel> and <guilabel>Black Underlining</guilabel> for files with text like &eg; &PDF;.
de: Text-Anmerkungen wie der <guilabel>Gelbe Textmarker</guilabel> und <guilabel>Schwarz unterstrichen</guilabel> für Dateien mit Text wie &eg; &PDF;-Dateien.

source: Graphic annotations like <guilabel>Pop-up Note</guilabel>, <guilabel>Inline Note</guilabel>, <guilabel>Freehand Line</guilabel>, <guilabel>Highlighter</guilabel>, <guilabel>Straight Line</guilabel>, <guilabel>Polygon</guilabel>, <guilabel>Stamp</guilabel>, <guilabel>Underline</guilabel>, and <guilabel>Ellipse</guilabel> for all formats supported by &okular;.
de: Grafik-Anmerkungen wie <guilabel>Notiz</guilabel>, <guilabel>Haftnotiz</guilabel>, <guilabel>Freihandlinie</guilabel>, <guilabel>Hervorhebung</guilabel>, <guilabel>Grade Linie</guilabel>, <guilabel>Vieleck</guilabel>, <guilabel>Stempel</guilabel>, <guilabel>Unterstrichen</guilabel> und <guilabel>Ellipse</guilabel> für alle von &okular; unterstützen Dateiformate.

source: Using the context menu either in the <guilabel>Reviews</guilabel> view of the navigation panel or in the main window you can open a <guilabel>Pop up Note</guilabel> for any kind of annotation and add or edit comments.
de: Benutzen Sie das Kontextmenü in der Ansicht <guilabel>Rezensionen</guilabel> im Navigationsbereich oder im Hauptfenster, um für jede Art von Anmerkungen eine <guilabel>Haftnotiz</guilabel> zu öffnen und Kommentare einzugeben oder zu ändern.

source: Annotations are not only limited to &PDF; files, they can be used for any format &okular; supports.
de: Rezensionen können nicht nur für Dateien im &PDF;-Format eingegeben werden, sondern für alle Formate, die &okular; unterstützt.

source: Since &kde; 4.2, &okular; has the "document archiving" feature. This is an &okular;-specific format for carrying the document plus various metadata related to it (currently only annotations). You can save a "document archive" from the open document by choosing <menuchoice><guimenu>File</guimenu><guisubmenu>Export As</guisubmenu><guimenuitem>Document Archive</guimenuitem></menuchoice>. To open an &okular; document archive, just open it with &okular; as it would be &eg; a &PDF; document.
de: Seit &kde; 4.2 kann &okular; „Dokumentarchive“ erstellen. Diese Archive haben ein eigenes nur von &okular; verwendetes Format und enthalten das Dokument sowie zugehörige Metadaten, zurzeit nur Anmerkungen. Um ein geöffnetes Dokument als Archiv zu speichern, wählen Sie <menuchoice><guimenu>Datei</guimenu><guisubmenu>Exportieren als</guisubmenu><guimenuitem>Dokumentarchiv</guimenuitem></menuchoice>. Dieses Dokumentarchiv kann mit &okular; wie &eg; eine &PDF;-Datei geöffnet werden.

source: Since &okular; 0.15 you can <emphasis>also</emphasis> save annotations directly into &PDF; files. This feature is only available if &okular; has been built with version 0.20 or later of <ulink url="http://poppler.freedesktop.org/">Poppler rendering library</ulink>. You can use <menuchoice><guimenu>File</guimenu> <guimenuitem>Save As...</guimenuitem></menuchoice> to save the copy of &PDF; file with annotations.
de: Seit &okular; 0.15 können Anmerkungen <emphasis>auch</emphasis> direkt in den &PDF;-Dateien gespeichert werden. Diese Funktion ist nur verfügbar, wenn &okular; mit der <ulink url="http://poppler.freedesktop.org/">Renderbibliothek Poppler</ulink> ab Version 0.20 kompiliert wurde. Mit dem Menüeintrag <menuchoice><guimenu>Datei</guimenu> <guimenuitem>Speichern unter ...</guimenuitem></menuchoice> wird eine Kopie der &PDF;-Datei mit den Anmerkungen gespeichert.

source: It is not possible to save annotations into &PDF; file if original file was encrypted and &okular; uses Poppler libraries of version which is lower than 0.22.
de: Anmerkungen können nicht in der &PDF;-Datei gespeichert werden, wenn die ursprüngliche Datei verschlüsselt war und &okular; die Poppler-Bibliotheken in Versionen vor 0.22 verwendet.

source: If you open a &PDF; with existing annotations, your annotation changes are not automatically saved in the internal local data folder, and you need to save the modified document (using <menuchoice><guimenu>File</guimenu><guimenuitem>Save As...</guimenuitem></menuchoice>) before closing it. Should you forget to do this &okular; will show confirmation window that allows you to save the document.
de: Wenn Sie eine &PDF;-Datei mit bereits vorhandenen Anmerkungen öffnen, werden Ihre Anmerkungen nicht automatisch im internen lokalen Datenordner gespeichert. Sie müssen das geänderte Dokument mit <menuchoice><guimenu>Datei</guimenu><guimenuitem>Speichern unter ...</guimenuitem></menuchoice> vor dem Schließen speichern. Vergessen Sie das, wird ein Dialog angezeigt und Sie können das Dokument dann speichern.

source: Due to DRM limitations (typically with &PDF; documents), adding, editing some properties or removing annotations could not be possible.
de: Bei Dateien mit DRM-Einschränkungen (&eg; häufig bei &PDF;-Dokumenten) ist es manchmal nicht möglich, Eigenschaften hinzuzufügen oder zu bearbeiten oder Anmerkungen zu entfernen.

source: Any action on annotations (creation and removal of annotations, editing arbitrary annotation properties, relocating annotations with &Ctrl;+drag, and editing the text contents of an annotation) can be <link linkend="edit-undo">undone</link> or <link linkend="edit-redo">redone</link> using the corresponding item from the <guimenu>Edit</guimenu> menu. It is also possible to undo the action by pressing <keycombo>&Ctrl;<keycap>Z</keycap></keycombo> and redo the undone action by pressing <keycombo>&Ctrl;&Shift;<keycap>Z</keycap></keycombo>.
de: Alle Aktionen für Anmerkungen (Erstellen, Löschen, Ändern beliebiger Eigenschaften, Verschieben mit &Ctrl;+&LMB; und Bearbeitung des Inhalts) können <link linkend="edit-undo">zurückgenommen</link> oder <link linkend="edit-redo">wiederhergestellt</link> werden. Benutzen Sie dazu die entsprechenden Einträge im Menü <guimenu>Bearbeiten</guimenu>. Außerdem können Sie auch die Kurzbefehle <keycombo>&Ctrl;<keycap>Z</keycap></keycombo> für das Zurücknehmen und <keycombo>&Ctrl;&Shift;<keycap>Z</keycap></keycombo> für das Wiederherstellen drücken.

source: Since &okular; 0.17 you can configure the default properties and appearance of each annotating tool. Please refer to the <link linkend="configannotations">corresponding section in this documentation</link>.
de: Seit &okular; 0.17 können Sie die Voreinstellungen der Eigenschaften und des Erscheinungsbilds jeder einzelnen Anmerkung ändern. Weitere Details dazu finden Sie in <link linkend="configannotations">diesem Kapitel des Handbuchs</link>.

source: Adding annotations
de: Anmerkungen hinzufügen

source: To add some annotations to the document, you have to activate the annotating toolbar. This is done by either selecting <menuchoice><guimenu>Tools</guimenu><guimenuitem>Review</guimenuitem></menuchoice> or pressing <keycap>F6</keycap>. Once the annotating toolbar is shown, just press one of its buttons or use keyboard shortcuts (keys from <keycap>1</keycap> to <keycap>9</keycap>) to start constructing that annotation.
de: Um Anmerkungen zum Dokument hinzuzufügen, aktivieren zuerst Sie die Werkzeugleiste dafür, indem Sie entweder <menuchoice><guimenu>Extras</guimenu><guimenuitem>Rezension</guimenuitem></menuchoice> wählen oder die Taste <keycap>F6</keycap> drücken. Drücken Sie dann einen der Knöpfe oder die Kurzbefehle von <keycap>1</keycap> bis <keycap>9</keycap> auf der Leiste, um mit dieser Anmerkung zu beginnen.

source: The annotating toolbar helps you to make annotations with drawings, shapes, and text messages. You can use the annotating toolbar to mark up a document (&eg; add lines, ellipses, polygons, stamps, highlights, underlines &etc;). The table below describes exactly what the default set of annotating toolbar buttons does.
de: Diese Werkzeugleiste hilft Ihnen beim Anlegen von Anmerkungen für Zeichnungen, Objekte und Textdokumente. Sie können Markierungen &eg; Linien, Ellipsen, Vielecke, Stempel, Hervorhebungen. Unterstreichungen &etc; in ein Dokument einfügen. Die folgende Tabelle beschreibt genau, wie die Standardanmerkungen funktionieren.

source: Button
de: Knopf

source: Tool Name
de: Werkzeugname

source: Description
de: Beschreibung

source: Pop-up Note
de: Notiz

source: To draw multiline note. The note will can be viewed by double clicking on an icon in the document.
de: Eine Notiz zeichnen. Die Notiz wird angezeigt, wenn Sie auf das Symbol der Notiz im Dokument doppelklicken.

source: Click on the tool button, then click on the place in the document where the pop-up note should be added. Enter the text of pop-up note then click on the <guilabel>Close this note</guilabel> button in the top right corner of the pop-up window.
de: Klicken Sie auf den Werkzeugknopf, klicken Sie dann auf die Stelle im Dokument, an der Sie die Notiz einfügen möchten. Geben Sie den Text ein und klicken Sie dann auf den Knopf <guilabel>Diese Notiz schließen</guilabel> in der oberen rechten Ecke des Notizfensters.

source: Inline Note
de: Haftnotiz

source: To draw inline note. The note will be shown inline as is.
de: Eine Haftnotiz zeichnen. Die Notiz wird im Text angezeigt.

source: Click on the tool button, then click with the &LMB; and hold to place the top-left corner of the note, then drag to place the bottom-right one. Enter the text of the note then click on the <guibutton>OK</guibutton> to save the note, <guibutton>Cancel</guibutton> to cancel note entering or <guibutton>Clear</guibutton> to clear the note.
de: Klicken Sie auf den Werkzeugknopf, klicken Sie dann mit der &LMBn; für die obere linke Ecke der Notiz, halten den Mausknopf gedrückt und ziehen den Mauszeiger zur rechten unteren Ecke der Notiz. Geben Sie den Text für die Notiz ein, klicken Sie dann auf <guibutton>OK</guibutton> zum Speichern, auf <guibutton>Abbrechen</guibutton> zum Beenden der Eingabe oder auf <guibutton>Löschen</guibutton>, um den Text der Notiz zu löschen.

source: Freehand Line
de: Freihandlinie

source: To draw free-form lines.
de: Freihandlinien zeichnen.

source: Click on the tool button, then click with the &LMB; and hold to place the start of the line, then drag to draw the line.
de: Klicken Sie auf den Werkzeugknopf und klicken Sie dann mit der &LMB; für den Start der Linie, halten die Maustaste gedrückt und ziehen, um die Linie zu zeichnen.

source: Highlighter
de: Hervorhebung

source: To highlight text in the document with some given background color.
de: Hervorhebung von Text im Dokument mit der eingestellten Hintergrundfarbe.

source: Click on the tool button, then click with the &LMB; and hold to place the beginning of the highlighted text snippet, then drag to highlight it.
de: Klicken Sie auf den Werkzeugknopf und dann mit der gedrückten &LMBn; auf den Beginn des hervorzuhebenden Textes, ziehen Sie dann, um den Text zu markieren.

source: Straight Line
de: Grade Linie

source: To mark with a line.
de: Markierung mit einer Linie.

source: Click on the tool button, then click with the &LMB; to place the starting point of the line, then drag to place of the ending point of the line should be and click once more.
de: Klicken Sie auf den Werkzeugknopf und dann mit der &LMBn; auf den Startpunkt der Linie, führen den Mauszeiger zum Endpunkt und klicken dann noch einmal.

source: Polygon
de: Vieleck

source: To draw a closed plane figure from three or more segments. The corresponding note can be viewed by double clicking inside the polygon.
de: Zeichnet ein geschlossenes Vieleck mit drei oder mehr Segmenten. Die zugehörige Notiz kann durch Doppelklicken in das Vieleck angezeigt werden.

source: Click on the tool button, then click with the &LMB; to place the first vertex of the polygon, then drag to place of the second vertex. Proceed until you draw the whole polygon up to the first vertex. Click twice if you want to add some note to the polygon. Enter the text of the note then click on the <guibutton>OK</guibutton> to save the note, <guibutton>Cancel</guibutton> to cancel note entering or <guibutton>Clear</guibutton> to clear the note.
de: Klicken Sie auf den Werkzeugknopf, klicken Sie dann mit der &LMBn; auf den ersten Punkt des Vielecks und ziehen Sie zum zweiten Punkt und klicken Sie wieder mit der Maustaste. Führen Sie dies bis zum ersten Punkt fort, bis das Vieleck fertig ist. Geben Sie den Text für die Notiz ein, klicken Sie dann auf <guibutton>OK</guibutton> zum Speichern, auf <guibutton>Abbrechen</guibutton> zum Beenden der Eingabe oder auf <guibutton>Löschen</guibutton>, um den Text der Notiz zu löschen.

source: Stamp
de: Stempel

source: To mark the text or image with some predefined shape.
de: Text oder Bilder mit voreingestellten Stempeln markieren.

source: Click on the tool button then click with the &LMB; to place the stamp.
de: Klicken Sie auf den Werkzeugknopf und dann mit der &LMBn; um den Stempel zu platzieren.

source: A single click just places a square stamp (useful for icons). To add a rectangular stamp you can click with the &LMB; and hold to place the top-left point, then drag to place the bottom-right one.
de: Um Stempel als Quadrate zum Beispiele für Symbole einzufügen, klicken Sie einmal mit der &LMBn;, um den Einfügepunkt links-oben anzugeben. Möchten Sie einen Stempel als Rechteck einfügen, klicken Sie mit der &LMBn; für den Eckpunkt links-oben und ziehen mit gedrückter Maustaste bis zum Eckpunkt rechts-unten.

source: Underline
de: Unterstrichen

source: To underline some text.
de: Unterstreichen von Text.

source: Click on the tool button, then click with the &LMB; and hold to place the beginning of the underlined text snippet, then drag to underline it.
de: Klicken Sie auf den Werkzeugknopf und dann mit der gedrückten &LMBn; auf den Beginn des zu unterstreichenden Textes, ziehen Sie dann, um Text zu unterstreichen.

source: To draw an ellipse around some chosen area.
de: Zeichnet eine Ellipse um einen ausgewählten Bereich.

source: Click on the tool button, then click with the &LMB; and hold to place the top-left corner of the circumscribed rectangular for the ellipse, then drag to place the bottom-right one.
de: Klicken Sie auf den Werkzeugknopf, klicken Sie dann mit der &LMBn; auf die linke obere Ecke des umschreibenden Rechtecks der Ellipse, halten die Maustaste gedrückt und ziehen Sie zur unteren rechten Ecke und lassen Sie die Maustaste los.

source: The contents of the annotating toolbar can be configured using the <link linkend="configannotations">Annotations page of &okular; configuration dialog</link>. This page can be opened with &RMB; clicking on the annotating toolbar then choosing <guimenuitem>Configure Annotations...</guimenuitem> from the context menu.
de: Der Inhalt der Anmerkungs-Werkzeugleiste kann im &okular;-Einrichtungsdialog auf der Seite <link linkend="configannotations">Anmerkungen</link> angepasst werden. Diese Seite öffnen Sie durch Klicken mit der &RMBn; auf die Anmerkungs-Werkzeugleiste und Auswahl von <guimenuitem>Anmerkungen einrichten ...</guimenuitem> aus dem Kontextmenü.

source: With a single &LMB; click on an annotation tool button you can use a tool once. If you &eg; want to highlight all important parts of a text, activate that tool permanently by double clicking on the tool button. Press the <keycap>Esc</keycap> key or click the tool button again to leave the permanent mode.
de: Mit einen einfachen Klick mit der &LMBn; auf ein Anmerkungs-Symbol können Sie dieses Werkzeug einmal benutzen. Wenn Sie &eg; alle wichtigen Texte in einem Dokument hervorheben möchten, können Sie diese Werkzeug dauerhaft aktivieren, indem Sie darauf doppelklicken. Drücken Sie die Taste <keycap>Esc</keycap> oder klicken Sie wieder auf das Symbol, um diesen Modus wieder zu beenden.

source: The annotating toolbar can be docked in any side of the viewing area: just drag it to move it to another place.
de: Die Werkzeugleiste für Anmerkungen kann an jeder Seite des Anzeigebereichs verankert werden, ziehen Sie die Leiste mit der Maus an den gewünschten Platz.

source: Activating the annotating toolbar will make you switch to the Browse Tool Mode.
de: Durch Aktivierung der Werkzeugleiste wechseln Sie in den normalen Navigationsmodus.

source: You can stop the construction any time by pressing again on the button of the annotation you are constructing, or by pressing the &Esc; key.
de: Klicken Sie wieder auf den zugehörigen Knopf in der Werkzeugleiste oder drücken Sie die &Esc;-Taste, um die Eingabe der Anmerkung zu beenden.

source: The newly constructed annotation will have as author the author you set in the <link linkend="configannotations"><guilabel>Annotations</guilabel> page</link> in &okular;s configuration dialog. The <guilabel>Annotations</guilabel> page can also be used to configure the content of the annotating toolbar.
de: Als Autor einer neu erstellten Anmerkung wird die Einstellung auf der Seite <link linkend="configannotations"><guilabel>Anmerkungen</guilabel></link> in &okular;s Einrichtungsdialog verwendet. Auf dieser Seite können auch die Einträge in der Anmerkungs-Werkzeugleiste eingerichtet werden.

source: Removing annotations
de: Anmerkungen löschen

source: To remove an annotation, just click on it with the &RMB;, and select <guimenuitem>Delete</guimenuitem>.
de: Um Anmerkungen zu löschen, klicken Sie mit der &RMBn; und wählen dann <guimenuitem>Löschen</guimenuitem>.

source: When removing the annotation, its window will be closed if open.
de: Wenn Sie eine Anmerkung entfernen, wird das zugehörige Fenster geschlossen, falls es geöffnet ist.

source: This option could not be enabled because the document does not allow removing annotations.
de: Wenn es ein Dokument es nicht erlaubt, Anmerkungen zu entfernen, kann diese Einstellung ist nicht ausgewählt werden.

source: Editing annotations
de: Anmerkungen bearbeiten

source: To edit an annotation, click on it with the &RMB; and select <guimenuitem>Properties</guimenuitem>. A dialog will appear with the general annotation settings (like color and opacity, author, &etc;) and the settings specific to that annotation type.
de: Um eine Anmerkung zu bearbeiten, klicken Sie mit der &RMBn; darauf und wählen <guimenuitem>Eigenschaften</guimenuitem> Damit öffnen Sie einen Dialog mit allgemeinen Einstellungen (wie Farbe, Deckkraft, Autor &etc;) und spezielle Einstellungen für diesen Typ von Anmerkung.

source: <screeninfo>Annotation Property Dialog</screeninfo>
de: <screeninfo>Der Eigenschaftsdialog für Anmerkungen</screeninfo>

source: <phrase>Annotation Property Dialog</phrase>
de: <phrase>Der Eigenschaftsdialog für Anmerkungen</phrase>

source: To move an annotation, hold down the &Ctrl; key, move the mouse pointer on it and then start dragging with the &LMB;.
de: Um eine Anmerkung zu verschieben, halten Sie die &Ctrl;taste gedrückt, gehen mit dem Mauszeiger auf die Anmerkung und ziehen sie dann mit der &LMBn;.

source: Depending on the document permissions (typically with &PDF; documents), some options can be disabled.
de: Bei Dokumenten mit eingeschränkten Berechtigungen (typisch für &PDF;-Dokumente) kann die Änderung einiger Einstellungen nicht erlaubt sein.

source: Bookmark Management
de: Lesezeichenverwaltung

source: &okular; has a very flexible bookmark system. &okular; saves the position on the page in bookmark and allows you to define more than one bookmark per page.
de: &okular; hat ein sehr flexibles System für Lesezeichen. &okular; speichert die Position des Lesezeichens auf der Seite und ermöglicht daher mehr als ein Lesezeichen je Seite.

source: To manage bookmarks in &okular; you can use <guilabel>Bookmarks</guilabel> view from <guilabel>Navigation Panel</guilabel>, <link linkend="menubookmarks">Bookmarks menu</link> or context menu of document view (click with &RMB; to open it).
de: Zur Verwaltung von Lesezeichen in &okular; verwenden Sie die Ansicht <guilabel>Lesezeichen</guilabel> im <guilabel>Navigationsbereich</guilabel>, das <link linkend="menubookmarks">Lesezeichenmenü</link> oder das Kontextmenü der Dokumentenansicht, das mit der &RMB; geöffnet wird.
