Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdegraphics/okular.po
Languages: de

source: This submenu is active only if the current type of document supports different page sizes.
de: Dieser Menüeintrag ist nur aktiviert, wenn der Typ des geöffnete Dokuments verschiedene Seitengrößen erlaubt.

source: <guimenu>View</guimenu> <guimenuitem>Trim Margins</guimenuitem>
de: <guimenu>Ansicht</guimenu> <guimenuitem>Ränder stutzen</guimenuitem>

source: Remove the white border of pages when viewing pages.
de: Entfernt für die Anzeige den unbedruckten Rand der Seiten.

source: <guimenu>View</guimenu> <guimenuitem>Show/Hide Forms</guimenuitem>
de: <guimenu>Ansicht</guimenu> <guimenuitem>Formulare anzeigen/ausblenden</guimenuitem>

source: <action>Show or hides the display</action> of the form fields of the document.
de: <action>Schaltet die Anzeige</action> von Formularfeldern im Dokuments ein oder aus.

source: This menu item is active only if the current document has form fields.
de: Dieser Menüeintrag ist nur aktiviert, wenn das geöffnete Dokument Formularfelder enthält.

source: The Go Menu
de: Das Menü Gehe zu

source: <guimenu>Go</guimenu> <guimenuitem>Previous Page</guimenuitem>
de: <guimenu>Gehe zu</guimenu> <guimenuitem>Vorige Seite</guimenuitem>

source: <action>View the previous page</action> of the document.
de: <action>Zeigt die vorige Seite</action> des Dokuments an.

source: <guimenu>Go</guimenu> <guimenuitem>Next Page</guimenuitem>
de: <guimenu>Gehe zu</guimenu> <guimenuitem>Nächste Seite</guimenuitem>

source: <action>View the next page</action> of the document.
de: <action>Zeigt die nächste Seite</action> des Dokuments an.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>Home</keycap></keycombo></shortcut> <guimenu>Go</guimenu> <guimenuitem>Beginning of the document</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl; <keycap>Pos1</keycap></keycombo></shortcut> <guimenu>Gehe zu</guimenu> <guimenuitem>Anfang des Dokuments</guimenuitem>

source: <action>Go to the beginning</action> of the document.
de: <action>Geht zum Anfang</action> des Dokuments.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>End</keycap></keycombo></shortcut> <guimenu>Go</guimenu> <guimenuitem>End of the document</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl; <keycap>Ende</keycap></keycombo></shortcut> <guimenu>Gehe zu</guimenu> <guimenuitem>Ende des Dokuments</guimenuitem>

source: <action>Go to the end</action> of the document.
de: <action>Geht zum Ende</action> des Dokuments.

source: <shortcut><keycombo action="simul">&Alt;&Shift;<keysym>Left</keysym></keycombo></shortcut> <guimenu>Go</guimenu> <guimenuitem>Back</guimenuitem>
de: <shortcut><keycombo action="simul">&Alt;&Shift;<keysym>Pfeil links</keysym></keycombo></shortcut> <guimenu>Gehe zu</guimenu> <guimenuitem>Zurück</guimenuitem>

source: <action>Go back to the previous view</action> of the document.
de: <action>Geht zurück zur vorher angezeigten Seite</action> des Dokuments.

source: <shortcut><keycombo action="simul">&Alt;&Shift;<keysym>Right</keysym></keycombo></shortcut> <guimenu>Go</guimenu> <guimenuitem>Forward</guimenuitem>
de: <shortcut><keycombo action="simul">&Alt;&Shift;<keysym>Pfeil rechts</keysym></keycombo></shortcut> <guimenu>Gehe zu</guimenu> <guimenuitem>Nach vorne</guimenuitem>

source: <action>Move forward to the next view</action> of the document. This only works if you have already moved back before.
de: <action>Geht weiter zur nächsten Ansicht</action> des Dokuments. Dies ist nur möglich, wenn Sie bereits zu einer Seite zurückgegangen sind.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>G</keycap></keycombo></shortcut> <guimenu>Go</guimenu> <guimenuitem>Go to Page...</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl; <keycap>G</keycap></keycombo></shortcut> <guimenu>Gehe zu</guimenu> <guimenuitem>Gehe zu Seite ...</guimenuitem>

source: Open a dialog which allows you to <action>go to any page</action> of the document.
de: Öffnet einen Dialog, um zu einer <action>bestimmten Seite</action> des Dokuments zu gehen.

source: The Bookmarks Menu
de: Das Menü Lesezeichen

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>B</keycap></keycombo></shortcut> <guimenu>Bookmarks</guimenu> <guimenuitem>Add/Remove Bookmark</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl; <keycap>B</keycap></keycombo></shortcut> <guimenu>Lesezeichen</guimenu> <guimenuitem>>Lesezeichen hinzufügen/entfernen</guimenuitem>

source: <action>Add or remove a bookmark for the current position</action>.
de: <action>Fügt für die aktuelle Position ein Lesezeichen ein oder entfernt es</action>.

source: <guimenu>Bookmarks</guimenu> <guimenuitem>Rename Bookmark</guimenuitem>
de: <guimenu>Lesezeichen</guimenu> <guimenuitem>Lesezeichen umbenennen</guimenuitem>

source: <action>Rename a bookmark for the current position</action>.
de: <action>Benennt das Lesezeichen an der aktuellen Position um</action>.

source: <guimenu>Bookmarks</guimenu> <guimenuitem>Previous Bookmark</guimenuitem>
de: <guimenu>Lesezeichen</guimenu> <guimenuitem>Vorheriges Lesezeichen</guimenuitem>

source: <action>Go to the previous bookmark</action>, or do nothing if there are no bookmarks prior to the current one.
de: <action>Geht zum vorherigen Lesezeichen</action>. Wenn es vor dem aktuellen Lesezeichen keine weiteren Lesezeichen gibt, ist diese Aktion wirkungslos.

source: <guimenu>Bookmarks</guimenu> <guimenuitem>Next Bookmark</guimenuitem>
de: <guimenu>Lesezeichen</guimenu> <guimenuitem>Nächstes Lesezeichen</guimenuitem>

source: <action>Go to the next bookmark</action>, or do nothing if there are no bookmarks after the current one.
de: <action>Geht zum nächsten Lesezeichen</action>. Wenn es nach dem aktuellen Lesezeichen keine weiteren Lesezeichen gibt, ist diese Aktion wirkungslos.

source: <guimenu>Bookmarks</guimenu> <guimenuitem>No Bookmarks</guimenuitem>
de: <guimenu>Lesezeichen</guimenu> <guimenuitem>Keine Lesezeichen</guimenuitem>

source: This is an always disabled action that appears in this menu only if the current document has no bookmarks. Otherwise a list of all bookmarks is displayed here. Clicking on these bookmarks allows you to go directly to the associated position.
de: Diesen Eintrag können Sie nicht auswählen, er wird immer dann angezeigt, wenn keine Lesezeichen im Dokument vorhanden sind. Anderenfalls finden Sie hier eine Liste aller Lesezeichen, klicken Sie auf einer dieser Einträge, um direkt zur entsprechenden Position im Dokument zu gehen.

source: The Tools Menu
de: Das Menü Extras

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>1</keycap></keycombo></shortcut> <guimenu>Tools</guimenu> <guimenuitem>Browse Tool</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl; <keycap>1</keycap></keycombo></shortcut> <guimenu>Extras</guimenu> <guimenuitem>Navigation</guimenuitem>

source: The mouse will have its normal behavior, &LMB; for dragging the document and following links and &RMB; for adding bookmarks and fit to width.
de: Die Maus hat das normale Verhalten, mit der &LMBn; verschieben Sie den Ansichtsbereich für das Dokument und folgen Verknüpfungen, mit der &RMBn; fügen Sie Lesezeichen ein und stellen die Ansicht auf die volle Seitenbreite ein.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>2</keycap></keycombo></shortcut> <guimenu>Tools</guimenu> <guimenuitem>Zoom Tool</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>2</keycap></keycombo></shortcut> <guimenu>Extras</guimenu> <guimenuitem>Lupe</guimenuitem>

source: The mouse will work as a zoom tool. Clicking &LMB; and dragging will zoom the view to the selected area, clicking &RMB; will bring the document back to the previous zoom.
de: Die Maus arbeitet wie ein Vergrößerungswerkzeug. Klicken mit der &LMBn; und Ziehen vergrößert die Ansicht des ausgewählten Bereichs, Klicken mit der &RMBn; bringt Sie zur vorigen Ansicht zurück.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>3</keycap></keycombo></shortcut> <guimenu>Tools</guimenu> <guimenuitem>Selection Tool</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl; <keycap>3</keycap></keycombo></shortcut> <guimenu>Extras</guimenu> <guimenuitem>Auswahl</guimenuitem>

source: The mouse will work as a select tool. In that mode clicking &LMB; and dragging will give the option of copying the text/image of current selected area to the clipboard, speak a text or to save an image to a file.
de: Die Maus arbeitet als Auswahlwerkzeug. In diesem Modus können Sie durch Klicken mit der &LMBn; und Ziehen einen Bereich auswählen und ihn als Text oder Bild in die Zwischenablage kopieren, einen Text vorsprechen lassen oder ein Bild in einer Datei speichern.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>4</keycap></keycombo></shortcut> <guimenu>Tools</guimenu> <guimenuitem>Text Selection Tool</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl; <keycap>4</keycap></keycombo></shortcut> <guimenu>Extras</guimenu> <guimenuitem>Textauswahl</guimenuitem>

source: The mouse will work as a text selection tool. In that mode clicking &LMB; and dragging will give the option of selecting the text of the document. Then, just click with the &RMB; to copy to the clipboard or speak the current selection.
de: Die Maus arbeitet als Auswahlwerkzeug für Text. In diesem Modus können Sie durch Klicken mit der &LMBn; und Ziehen einen Text auswählen. Klicken Sie dann mit der &RMBn;, um den Text in die Zwischenablage zu kopieren oder vorsprechen zu lassen.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>5</keycap></keycombo></shortcut> <guimenu>Tools</guimenu> <guimenuitem>Table Selection Tool</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl; <keycap>5</keycap></keycombo></shortcut> <guimenu>Extras</guimenu> <guimenuitem>Tabellenauswahl</guimenuitem>

source: Draw a rectangle around the text for the table, then use the click with the &LMB; to divide the text block into rows and columns. A &LMB; click on a existing line removes it and merges the adjacent rows or columns.
de: Ziehen Sie mit der Maus ein Rechteck um den Text für die Tabelle, klicken Sie dann mit der &LMBn; zur Aufteilung des Blocks in Zeilen und Spalten. Klicken Sie mit der &LMBn; auf vorhandenen Linien, um sie zu löschen und die angrenzenden Zeilen oder Spalten zu verschmelzen.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>6</keycap></keycombo></shortcut> <guimenu>Tools</guimenu> <guimenuitem>Magnifier</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>6</keycap></keycombo></shortcut> <guimenu>Extras</guimenu> <guimenuitem>Lupe</guimenuitem>

source: Activates the magnifier mode for the mouse pointer. Press and hold the &LMB; to activate magnifier widget, move the pointer for panning through the document. The magnifier scales each pixel in the document into 10 pixels in the magnifier widget.
de: Aktiviert den Lupenmodus für den Mauszeiger. Halten Sie die &LMB; gedrückt, um die Lupe zu aktivieren und verschieben Sie den Mauszeiger durch das Dokument. Die Lupe vergrößert jedes Pixel im Dokument um das Zehnfache.

source: <shortcut><keycap>F6</keycap></shortcut> <guimenu>Tools</guimenu> <guimenuitem>Review</guimenuitem>
de: <shortcut><keycap>F6</keycap></shortcut> <guimenu>Extras</guimenu> <guimenuitem>Rezension</guimenuitem>

source: <action>Open the review toolbar</action>. The review toolbar allows you to add annotations on the document you are reading. For more information, please see the section about <link linkend="annotations">Annotations</link>.
de: <action>Blendet die Werkzeugleiste für Rezensionen ein</action>. Mit dieser Werkzeugleiste können Sie Anmerkungen für das Dokument hinzufügen. Weitere Informationen dazu finden Sie im Kapitel <link linkend="annotations">Anmerkungen</link>.

source: <guimenu>Tools</guimenu> <guimenuitem>Speak Whole Document</guimenuitem>
de: <guimenu>Gehe zu</guimenu> <guimenuitem>Gesamtes Dokument vorlesen</guimenuitem>

source: <guimenu>Tools</guimenu> <guimenuitem>Speak Current Page</guimenuitem>
de: <guimenu>Ansicht</guimenu> <guimenuitem>Aktuelle Seite vorlesen</guimenuitem>

source: <guimenu>Tools</guimenu> <guimenuitem>Stop Speaking</guimenuitem>
de: <guimenu>Extras</guimenu> <guimenuitem>Vorlesen anhalten</guimenuitem>

source: These items allow you to speak the whole document or just the current page and stop speaking using the &kde; Text-to-Speech system &jovie;.
de: Mit diesen Menüeinträgen können Sie sich das gesamte Dokument oder nur die angezeigte Seite vorlesen lassen und das Vorlesen anhalten. Dazu wird das &kde;-Sprachausgabesystem &jovie; benutzt.

source: The <guilabel>Speak ...</guilabel> actions are enabled only if &jovie; is available in the system.
de: Die Aktionen <guilabel>Vorlesen</guilabel> sind nur dann aktiviert, wenn &jovie; im System installiert ist.

source: The Settings Menu
de: Das Menü Einstellungen

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>M</keycap></keycombo></shortcut> <guimenu>Settings</guimenu> <guimenuitem>Show Menubar</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>M</keycap></keycombo></shortcut> <guimenu>Einstellungen</guimenu> <guimenuitem>Menüleiste anzeigen</guimenuitem>

source: <action>Toggle the Menubar display</action> on and off. Once hidden it can be made visible using the shortcut <keycombo action="simul">&Ctrl;<keycap>M</keycap></keycombo> again. If the menubar is hidden, the context menu opened with a right mouse button click anywhere in the view area has an extra entry <guimenuitem>Show Menubar</guimenuitem>.
de: <action>Schaltet die Anzeige der Menüleiste</action> an und aus. Ist die Menüleiste ausgeblendet, können Sie sie mit dem Kurzbefehl <keycombo action="simul">&Ctrl;<keycap>M</keycap></keycombo> wieder anzeigen. Ist die Menüleiste ausgeblendet, enthält das Kontextmenü, das durch Klicken mit der &RMBn; in den Anzeigebereich geöffnet wird, den zusätzlichen Eintrag <guimenuitem>Menüleiste anzeigen</guimenuitem>.

source: <guimenu>Settings</guimenu> <guimenuitem>Show Toolbar</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>Werkzeugleiste anzeigen</guimenuitem>

source: <action>Toggle the Toolbar display</action> on and off.
de: <action>Schaltet die Anzeige der Werkzeugleiste</action> an und aus.

source: <shortcut><keycap>F7</keycap></shortcut> <guimenu>Settings</guimenu> <guimenuitem>Show Navigation Panel</guimenuitem>
de: <shortcut><keycap>F7</keycap></shortcut> <guimenu>Einstellungen</guimenu> <guimenuitem>Navigationsbereich anzeigen</guimenuitem>

source: <action>Toggle the navigation panel</action> on and off.
de: <action>Schaltet die Anzeige des Navigationsbereichs</action> ein und aus.

source: <guimenu>Settings</guimenu> <guimenuitem>Show Page Bar</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>Seitendarstellungsleiste anzeigen</guimenuitem>

source: <action>Toggle the page bar</action> at the bottom of document area on and off to save vertical place in &okular; window.
de: <action>Blendet die Anzeige der Seitendarstellungsleiste</action> am unteren Rand des Dokumentbereichs ein oder aus. Ist die Seitendarstellungsleiste ausgeblendet, steht mehr Platz für die Anzeige des Dokuments zur Verfügung.

source: <shortcut><keycombo action="simul">&Ctrl;&Shift;<keycap>F</keycap></keycombo></shortcut> <guimenu>Settings</guimenu> <guimenuitem>Full Screen Mode</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;&Shift;<keycap>F</keycap></keycombo></shortcut> <guimenu>Einstellungen</guimenu> <guimenuitem>Vollbildmodus</guimenuitem>

source: <action>Enables the full screen mode</action>. Note that full screen mode is different from <link linkend="presentationMode">presentation mode</link> insofar as the only peculiarity of full screen mode is that it hides the window decorations, the menubar and the toolbar.
de: <action>Schaltet den Vollbildmodus</action> ein. Im Unterschied zum <link linkend="presentationMode">Präsentationsmodus</link> wird nur die Anzeige von Fensterdekoration, Menüleiste und Werkzeugleiste ausgeschaltet.

source: <guimenu>Settings</guimenu> <guimenuitem>Configure Shortcuts...</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>Kurzbefehle festlegen ...</guimenuitem>

source: Opens a window that lets you <action>configure the keyboard shortcuts</action> for many menu commands.
de: Öffnet ein Fenster zur <action>Einrichtung der Tastenkürzel</action> für viele Menüeinträge.

source: <guimenu>Settings</guimenu> <guimenuitem>Configure Toolbars...</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>Werkzeugleisten einrichten ...</guimenuitem>

source: Opens a window that lets you choose which icons are visible in the toolbar.
de: Öffnet ein Fenster für die Auswahl der Symbole für die Werkzeugleiste.

source: <guimenu>Settings</guimenu> <guimenuitem>Configure Backends...</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>Anzeigemodule einrichten ...</guimenuitem>

source: Opens the <link linkend="configure-backends">Backend Configuration</link> window.
de: Öffnet den Dialog <link linkend="configure-backends">Anzeigemodule einrichten</link>.

source: <guimenu>Settings</guimenu> <guimenuitem>Configure &okular;...</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>&okular; einrichten ...</guimenuitem>

source: Opens the <link linkend="configure">Configure</link> window.
de: Öffnet den Dialog zur <link linkend="configure">Einrichtung von &okular;</link>.

source: The Help Menu
de: Das Menü Hilfe

source: Configuring &okular; Backends
de: Einrichtung der Anzeigemodule von &okular;

source: You can configure &okular; backends by choosing <menuchoice> <guimenu>Settings</guimenu> <guimenuitem>Configure Backends...</guimenuitem> </menuchoice>. Currently, configuration options are provided for EPub, &PostScript;, FictionBook, Txt, OpenDocument Text, and &PDF; backends only.
de: Mit <menuchoice><guimenu>Einstellungen</guimenu><guimenuitem>Anzeigemodule einrichten ...</guimenuitem> </menuchoice> öffnen Sie einen Dialog für die Einrichtung einige Module, zu Zeit nur für EPUB, &PostScript;, FictionBook, Text, OpenDocument Text and &PDF;.

source: <screeninfo>The backends configuration dialog</screeninfo>
de: <screeninfo>Der Einrichtungsdialog für die Anzeigemodule</screeninfo>

source: <phrase>The backends configuration dialog</phrase>
de: <phrase>Der Einrichtungsdialog für die Anzeigemodule</phrase>

source: Using backend configuration pages for EPub, FictionBook, Txt and OpenDocument Text you can define the font to render documents in the corresponding formats. The <guibutton>Choose...</guibutton> button in these pages opens standard &kde; font configuration window. Please refer to the <ulink url="help:/fundamentals/fonts.html">&kde; Fundamentals documentation</ulink> for the details.
de: Auf den Seiten für EPUB, &PostScript;, FictionBook, Text und OpenDocument Text können Sie die Schrift für das Rendern der Dokumente für diese Formate einstellen. Mit dem Knopf <guibutton>Auswählen</guibutton> öffnen Sie den bekannten &kde;-Schriftendialog, Weitere Informationen dazu finden Sie in der Dokumentation zu den <ulink url="help:/fundamentals/fonts.html">&kde;-Grundlagen</ulink>.

source: The description of &PostScript; and &PDF; backends configuration pages can be found below.
de: Im folgenden werden die Einstellungsseiten für die Module &PostScript; und &PDF; beschrieben.

source: &PostScript; backend configuration
de: Einrichtung des &PostScript;-Anzeigemoduls

source: You can configure &okular; &PostScript; rendering backend based on <ulink url="http://www.ghostscript.com/">Ghostscript</ulink> by choosing <guilabel>Ghostscript</guilabel> from the list on the left part of the configuration dialog. The only configurable option is as follows.
de: Das &okular;-Anzeigemodul &PostScript; auf der Grundlage von <ulink url="http://www.ghostscript.com/">Ghostscript</ulink> können Sie einstellen, in dem Sie dies in der Liste auf der linken Seite des Einrichtungsdialogs auswählen. Es gibt nur eine Option:

source: Use platform fonts
de: Plattformspezifische Schriftarten verwenden

source: This option determines whether Ghostscript should be allowed to use platform fonts, if unchecked only usage of fonts embedded in the document will be allowed. This option is checked by default.
de: Diese Einstellung legt fest, ob Ghostscript auch plattformspezifische Schriften verwenden soll. Ansonsten werden nur im Dokument eingebettete Schriften benutzt. Diese Einstellung ist als Standard aktiviert.

source: &PDF; backend configuration
de: Einrichtung des &PDF;-Anzeigemoduls

source: You can configure &okular; &PDF; rendering backend based on <ulink url="http://poppler.freedesktop.org/">Poppler</ulink> by choosing <guilabel>&PDF;</guilabel> from the list on the left part of the configuration dialog. The only configurable option is as follows.
de: Das &okular;-Anzeigemodul &PDF; auf der Grundlage der Bibliothek <ulink url="http://poppler.freedesktop.org/">Poppler</ulink> können Sie einstellen, in dem Sie dies in der Liste auf der linken Seite des Einrichtungsdialogs auswählen. Es gibt nur eine Option:

source: Enhance thin lines
de: Anzeige dünner Linien verbessern

source: Drawing lines in &okular; is implemented in two steps: generation of the clipping path and filling this clipping path. When the line in the original document is less than one pixel this two step implementation could cause problems. For those lines, the clipping path is filled with the filling color that depends on the thickness of the line part inside the clipping area. If the part of the line inside the clipping area gets very small the contrast between the shape and the background color can become too low for the line to be recognizable. The grids of such lines then looks very unpretty.
de: Das Zeichnen von Linien in &okular; ist in zwei Schritten implementiert: Generierung und Füllung des Freistellungspfads. Beträgt die Breite einer Linie im ursprünglichen Dokument weniger als ein Pixel, kann dieses Verfahren zu Problemen führen. Für solche Linien wird der Freistellungspfad mit der Farbe gefüllt, die von der Breite des Linienteils im Freistellungspfad abhängt. Wird der Teil der Linie im Freistellungspfad sehr klein, kann der Kontrast zwischen der Form und der Hintergrundfarbe zu klein werden, um die Linie zu erkennen. Ein Gitter aus solchen Linien sieht dann sehr unschön aus.

source: Thin line (red), its clipping path (dashed line) and pixel boundaries (black solid lines)
de: Dünne Linie (Rot), deren Freistellungspfad (Gestrichelt) und Pixelgrenzen (Schwarz)

source: Thin line shown at a low contrast
de: Anzeige dünner Linien bei geringem Kontrast

source: To enhance the look of the thin lines &okular; implements two options.
de: Für die Verbesserung der Anzeige dünner Linien in &okular; gibt es zwei Einstellungen:

source: The first option is <guimenuitem>Solid</guimenuitem>. With this option &okular; adjusts clipping path and line position so that clipping path and line are on the same pixel boundary, &ie; &okular; enlarges the thin lines to one pixel on the output device. This mode is similar to the <guilabel>Enhance thin lines</guilabel> in <trademark class="registered">Adobe</trademark> <trademark class="registered">Reader</trademark>. If this option is chosen, the thin lines are always enlarged.
de: Mit der ersten Einstellung <guimenuitem>Einfarbig</guimenuitem> passt &okular;den Freistellungspfad und die Position der Linie so an, dass beide auf der selben Pixelgrenze liegen. &ie; &okular; verbreitert dünne Linien auf ein Pixel des Ausgabegeräts. Dieser Modus entspricht etwa der Einstellung <guilabel>Anzeige dünner Linien verbessern</guilabel> im <trademark class="registered">Adobe</trademark> <trademark class="registered">Reader</trademark>. Mit dieser Einstellung werden dünne Linien immer verbreitert.
