Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdegraphics/okular.po
Languages: de

source: <phrase>Thin line with <guimenuitem>Solid</guimenuitem> enhancement</phrase>
de: <phrase>Dünne Linie mit der Einstellung <guimenuitem>Einfarbig</guimenuitem></phrase>

source: <para>Thin line with <guimenuitem>Solid</guimenuitem> enhancement</para>
de: <para>Dünne Linie mit der Einstellung <guimenuitem>Einfarbig</guimenuitem></para>

source: The second option is <guimenuitem>Shape</guimenuitem>. With this option the clipping path and line are adjusted to pixel boundary as well, but the line intensity is corrected according to its width.
de: Mit der zweiten Einstellung <guimenuitem>Form</guimenuitem> wird der Freistellungspfad und die Linie ebenfalls an Pixelgrenzen angepasst, aber die Intensität der Linienfarbe wird entsprechend der Breite korrigiert.

source: <phrase>Thin line with <guimenuitem>Shape</guimenuitem> enhancement</phrase>
de: <phrase>Dünne Linie mit der Einstellung <guimenuitem>Form</guimenuitem></phrase>

source: <para>Thin line with <guimenuitem>Shape</guimenuitem> enhancement</para>
de: <para>Dünne Linie mit der Einstellung <guimenuitem>Form</guimenuitem></para>

source: The thin lines are not enhanced by default (option <guimenuitem>No</guimenuitem>).
de: In der Voreinstellung mit der Option <guimenuitem>Nein</guimenuitem> bleibt die Anzeige dünner Linien unverändert.

source: <title>Configuring &okular;</title>
de: <title>Einrichtung von &okular;</title>

source: General configuration
de: Einstellungen

source: You can configure &okular; by choosing <menuchoice><guimenu>Settings</guimenu> <guimenuitem>Configure &okular;...</guimenuitem></menuchoice>. The configuration dialog is split into six sections. This chapter describes the available options in detail.
de: Mit <menuchoice><guimenu>Einstellungen</guimenu><guimenuitem>&okular; einrichten ...</guimenuitem> </menuchoice> öffnen Sie einen Dialog mit sechs Abschnitten. Dieses Kapitel beschreibt ausführlich alle vorhandenen Optionen.

source: <link linkend="configgeneral">General</link>
de: <link linkend="configgeneral">Allgemein</link>

source: <link linkend="configaccessibility">Accessibility</link>
de: <link linkend="configaccessibility">Zugangshilfen</link>

source: <link linkend="configperformance">Performance</link>
de: <link linkend="configperformance">Leistung</link>

source: <link linkend="configpresentation">Presentation</link>
de: <link linkend="configpresentation">Präsentation</link>

source: <link linkend="configannotations">Annotations</link>
de: <link linkend="configannotations">Anmerkungen</link>

source: <screeninfo>The configuration dialog</screeninfo>
de: <screeninfo>Der Einrichtungsdialog</screeninfo>

source: <phrase>The configuration dialog</phrase>
de: <phrase>Der Einrichtungsdialog</phrase>

source: Depending on the currently installed backends, the <menuchoice><guimenu>Settings</guimenu> <guimenuitem>Configure Backends...</guimenuitem></menuchoice> menu item could be enabled. This particular configuration dialog holds the configurations of the backends that can actually be configured.
de: Für einige der installierten Anzeigemodule ist der Menüeintrag <menuchoice><guimenu>Einstellungen</guimenu><guimenuitem>Anzeigemodule einrichten ...</guimenuitem> </menuchoice> vorhanden. Damit öffnen Sie einen Dialog zur Einstellung des aktiven Anzeigemoduls.

source: <title>General</title>
de: <title>Allgemein</title>

source: Show scrollbars
de: Bildlaufleisten anzeigen

source: Whether to show scrollbars for the document view.
de: Schaltet die Anzeige der Bildlaufleisten an oder aus.

source: Link the thumbnails with the page
de: Vorschaubilder mit der Seite verknüpfen

source: Whether the thumbnails view should always display the current page or not.
de: Verbindet die Seitenanzeige mit der Anzeige der Vorschaubilder.

source: Show hints and info messages
de: Tipps und Infomeldungen anzeigen

source: Whether to show some informative messages on startup, file load, &etc;
de: Zeigt beim Start Informationen über die geladene Datei an.

source: Display document title in titlebar if available
de: Dokumenttitel in der Titelleiste anzeigen, falls verfügbar

source: Whether to show the current document title in the titlebar of &okular; window. If no metadata for title found in the document or this item is unchecked &okular; shows filename of the document.
de: Legt fest, ob der Titel des aktuellen Dokuments in der Titelleiste vom &okular;-Fenster angezeigt wird. Wurden keine Metadaten für den Titel im Dokument gefunden oder ist diese Einstellung abgeschaltet, wird der Dateiname des Dokuments angezeigt.

source: When not displaying document title
de: Wenn kein Dokumenttitel angezeigt wird

source: You can choose any of two options, <guilabel>Display file name only</guilabel> or <guilabel>Display full file path</guilabel>.
de: Hier können Sie zwei Einstellungen wählen: <guilabel>Nur Dateinamen anzeigen</guilabel> oder <guilabel>Vollständigen Dateipfad anzeigen</guilabel>

source: Obey DRM limitations
de: DRM-Beschränkungen beachten

source: Whether &okular; should obey <firstterm>DRM</firstterm> (Digital Rights Management) restrictions. DRM limitations are used to make it impossible to perform certain actions with &PDF; documents, such as copying content to the clipboard. Note that in some configurations of &okular;, this option is not available.
de: Wählen Sie, ob &okular; <firstterm>DRM</firstterm> (Digital Rights Management) beachten soll. DRM-Beschränkungen werden eingesetzt, um bestimmte Aktionen für &PDF;-Dokumente wie das Kopieren des Inhalts in die Zwischenablage unmöglich zu machen. In einigen Versionen von &okular; ist diese Option nicht vorhanden.

source: Open new files in tabs
de: Neue Dateien in Unterfenstern öffnen

source: Whether to open new documents in tabs. The tabs are disabled by default.
de: Ob neue Dokumente in Unterfenstern geöffnet werden. Dies ist in der Voreinstellung ausgeschaltet.

source: The default shortcuts to switch between tabs are <keycombo>&Ctrl;<keycap>.</keycap></keycombo> (<guilabel>Next tab</guilabel>) and <keycombo>&Ctrl;<keycap>,</keycap></keycombo> (<guilabel>Previous tab</guilabel>).
de: Die Standard-Kurzbefehle für das Wechseln zwischen Unterfenstern sind <keycombo>&Ctrl;<keycap>.</keycap></keycombo> (<guilabel>Nächstes Unterfenstr</guilabel>) and <keycombo>&Ctrl;<keycap>,</keycap></keycombo> (<guilabel>Vorheriges Unterfenster</guilabel>).

source: Reload document on file change
de: Geänderte Dokumentdateien neu laden

source: Whether opened files should be automatically checked for changes and updated, if necessary.
de: Überprüft automatisch, ob angezeigte Dateien auf dem Speichermedium geändert wurden.

source: Show backend selection dialog
de: Auswahldialog für Anzeigemodule anzeigen

source: Whether &okular; should ask the user which backend to use in case of more than one backend able to open the current file. If unchecked, &okular; will use the backend with the highest priority.
de: Wenn es für die zu öffnende Datei mehrere Anzeigemodule gibt, erhalten Sie mit dieser Einstellung einen Auswahldialog für das Anzeigemodul. Ist diese Einstellung nicht aktiviert, benutzt &okular; das Anzeigemodul mit der höchsten Priorität.

source: Overview columns
de: Übersichtsspalten:

source: This option represents the number of columns to use in the overview mode.
de: Mit dieser Einstellung legen Sie die Anzahl der Spalten im Übersichtmodus fest.

source: Page Up/Down overlap
de: Überschneidung für die Tasten „Bild hoch/runter“

source: Here you can define the percentage of the current viewing area that should be visible after pressing <keycap>Page Up</keycap>/<keycap>Page Down</keycap> keys.
de: Mit diesem Wert kann eingestellt werden, wieviel Prozent des zurzeit dargestellten Anzeigebereichs noch sichtbar sind, nachdem eine der Tasten <keycap>Bild auf</keycap>/<keycap>Bild ab</keycap> gedrückt wurde.

source: Default Zoom
de: Standardvergrößerung

source: This options specifies the default zoom mode for file which were never opened before. For those files which were opened before the previous zoom mode is applied.
de: Mit dieser Einstellung legen Sie die Vergrößerung für Dateien fest, die zum ersten Mal geöffnet werden. Alle bereits vorher geöffneten Dateien werden in der letzten benutzen Vergrößerungsstufe angezeigt.

source: <title>Accessibility</title>
de: <title>Zugangshilfen</title>

source: Draw border around links
de: Verknüpfungen umrahmen

source: Whether to draw a border around links.
de: Zeichnet einen Rahmen um Verknüpfungen.

source: Change colors
de: Farben ändern

source: <action>Enables</action> the color changing options.
de: <action>Aktiviert</action> die Optionen zur Änderung der Farben.

source: Invert Colors
de: Farben umkehren

source: <action>Inverts</action> colors on the view, &ie; black objects will be shown white.
de: <action>Vertauscht</action> die Farben der Anzeige, &ie; schwarz wird als weiß dargestellt.

source: Change Paper Color
de: Papierfarbe ändern

source: <action>Changes</action> the paper's color, &ie; the document's background.
de: <action>Ändert</action> die Papierfarbe, &ie; den Hintergrund des Dokuments.

source: Change Dark &amp; Light Colors
de: Helle und dunkle Farben ändern

source: <action>Changes</action> the dark and light color to your preference, that means black will not be rendered as black but as the selected dark color and white will not be rendered as white but as the selected light color.
de: <action>Ändert</action> die helle und dunkle Farbe, das heißt schwarz wird nicht schwarz, sondern als dunkle Farbe und weiß als helle Farbe angezeigt.

source: Convert to Black &amp; White
de: In Schwarzweiß umwandeln

source: <action>Converts</action> the document to black and white. You can set the threshold and the contrast. Setting the threshold to a higher value by moving it to the right will result in lighter grays used.
de: <action>Wandelt die Farben</action> im Dokument in Schwarzweiß um. Sie können Schwellwert und Kontrast einstellen. Mit einem höheren Schwellwert (rechts auf dem Schieberegler)wird ein helleres Grau verwendet.

source: <title>Performance</title>
de: <title>Leistung</title>

source: Enable transparency effects
de: Transparenzeffekte aktivieren

source: Draw selections and other special graphics using transparency effects. Disable the option to draw them using outline or opaque fill styles and increase speed on selections.
de: Zeichnet die Auswahl und andere besondere Grafiken mit transparenten Effekten. Schalten Sie diese Option aus, um nur Umrisse zu verwenden, dadurch wird die Arbeitsgeschwindigkeit bei der Auswahl erhöht.

source: Memory Usage
de: Speicherausnutzung

source: &okular; can achieve best performance by tuning the memory usage, based on your system and your tastes. The more memory you let it to use, the faster the program will behave. The Default profile is good for every system, but you can prevent &okular; from using more memory than necessary by selecting the Low profile, or let it get the most out of your system using Aggressive. Use Greedy profile to preload all pages without risk of system memory overfull (only 50% of total memory or free memory will be used).
de: &okular; erreicht die beste Leistung durch Anpassung der Speichernutzung an Ihr System und Ihre Anforderungen. Je mehr Speicher Sie dem Programm zuweisen, desto schneller arbeitet es. Die Standardeinstellung ist für ein normales System richtig, aber mit der Einstellung ‚Gering‘ können Sie die Speichernutzung von &okular; einschränken oder mit der Einstellung ‚Aggressiv‘ die Leistung Ihres Systems voll ausnutzen. Mit der Einstellung „Gierig“ werden alle Seiten vorgeladen, aber der Hauptspeicher nicht vollständig belegt. Es werden maximal 50 % des gesamten oder freien Speichers benutzt.

source: Rendering
de: Rendern

source: Using this group of options you can improve text and image rendering in &okular;. The result depends on the device to display the document. <guilabel>Enable Text Antialias</guilabel> and <guilabel>Enable Graphics Antialias</guilabel> items can be used to switch on and off <ulink url="http://en.wikipedia.org/wiki/Spatial_anti-aliasing">spatial anti-aliasing</ulink> of text and images in document, correspondingly. <guilabel>Enable Text Hinting</guilabel> item is meant to be a switcher for <ulink url="http://en.wikipedia.org/wiki/Font_hinting">font hinting</ulink>. Antialiasing and hinting change how the documents are displayed, you may want to tweak them to your preference.
de: Mit diesen Einstellungen können Sie das Rendern und die Darstellung von Text und Grafik in &okular; verbessern. Das Ergebnis wird durch das für die Anzeige verwendete Gerät beeinflusst. Mit den Ankreuzfeldern <guilabel>Kantenglättung für Text aktivieren</guilabel> und <guilabel>Kantenglättung für Grafik aktivieren</guilabel> wird <ulink url="http://de.wikipedia.org/wiki/Antialiasing_(Computergrafik)">Kantenglättung oder Antialiasing</ulink> von Text und Bildern in Dokumenten ein- und ausgeschaltet. Mit dem Eintrag <guilabel>Hinting für Text aktivieren</guilabel> wird das <ulink url="http://de.wikipedia.org/wiki/Hinting">Hinting</ulink> aktiviert. Kantenglättung und Hinting ändern die Anzeige von Dokumenten auf dem Bildschirm, optimieren Sie diese Einstellungen für Ihre Ansprüche.

source: <title>Presentation</title>
de: <title>Präsentation</title>

source: Advance every
de: Weitergehen alle

source: Enables automatic advancing of pages given a time period.
de: Zeigt automatisch nach der festgelegten Zeit die nächste Seite.

source: Loop after last page
de: Nach der letzten Seite von vorn beginnen

source: When navigating on presentation mode and going past the last page the first page will appear.
de: Im Präsentationsmodus wird nach der letzten Seite die erste Seite angezeigt.

source: Background color
de: Hintergrundfarbe

source: The color that will fill the part of the screen not covered by the page when on presentation mode.
de: Die Farbe für den Bereich des Bildschirms, der im Präsentationsmodus nicht von der Seite abgedeckt wird.

source: Pencil color
de: Stiftfarbe

source: The color of the pencil used when drawing on the pages during the presentation mode.
de: Die Farbe für den Zeichenstift im Präsentationsmodus.

source: Mouse cursor
de: Mauszeiger

source: Whether the mouse should be always hidden, always shown or hidden after a small time of inactivity.
de: Hier können Sie einstellen, ob der Mauszeiger immer angezeigt oder ausgeblendet wird oder ob er nach kurzer Zeit ohne Mausbewegung ausgeschaltet wird.

source: Show progress indicator
de: Fortschrittsanzeige einblenden

source: Whether to show a progress circle that shows the current page and the total number of pages on the upper right corner of the presentation screen every time you change the page.
de: Zeigt ein Fortschritts-Symbol als Kreis mit der aktuellen Seite und der Anzahl aller Seiten in der rechten oberen Ecke des Präsentationsfensters an.

source: Show summary page
de: Zusammenfassung anzeigen

source: Whether to show a summary page at the beginning of the presentation with the title, author and number of pages of the document.
de: Zeigt am Beginn einer Präsentation eine Seite mit Namen, Autor und Seitenzahl des Dokuments.

source: Enable transitions
de: Übergänge aktivieren

source: Use this check box to enable or disable transition effects between pages.
de: Mit diesem Ankreuzfeld können Übergangseffekte zwischen Seiten ein- oder ausgeschaltet werden.

source: Default transition
de: Standardübergang

source: The transition effect between page and page if the document does not specify one. Set this to <guilabel>Random Transition</guilabel> to make &okular; randomly choose one of the available effects.
de: Der Effekt für den Übergang zwischen den einzelnen Seiten, sofern er nicht durch das Dokument festgelegt. Stellen Sie <guilabel>Zufälliger Übergang</guilabel> ein, damit &okular; wahllos einen der vorhandenen Effekte benutzt.

source: Placement
de: Platzierung

source: In this section you can select the <guilabel>Screen</guilabel> used to display the presentation.
de: In diesem Abschnitt können Sie den <guilabel>Bildschirm</guilabel> für die Anzeige der Präsentation auswählen.

source: <guilabel>Current Screen</guilabel> is same screen of the &okular; window that starts the presentation mode.
de: <guilabel>Aktueller Bildschirm</guilabel> ist der Bildschirm des &okular;-Fensters, in dem die Präsentation gestartet wird.

source: <guilabel>Default Screen</guilabel> is the screen marked as default in the xinerama configuration.
de: <guilabel>Standard-Bildschirm</guilabel> ist der in der Xinerama-Einstellung als Standard vorgegebene Bildschirm.

source: <guilabel>Screen 0</guilabel>, <guilabel>Screen 1</guilabel> &etc; are the available screens.
de: <guilabel>Bildschirm 0</guilabel>,<guilabel> Bildschirm 1</guilabel> &etc; bezeichnen die verfügbaren Bildschirme.

source: <screeninfo>The Annotations page of the configuration dialog</screeninfo>
de: <screeninfo>Die Seite Anmerkungen im Einrichtungsdialog</screeninfo>

source: <phrase>The Annotations page of the configuration dialog</phrase>
de: <phrase>Die Seite Anmerkungen im Einrichtungsdialog</phrase>

source: Author
de: Autor

source: The author of the contents added on a document. Default is the name from the <guilabel>Password &amp; User Account</guilabel> page of the &systemsettings; module <guilabel>Account Details</guilabel>.
de: Der Autor der Anmerkungen zum Dokument. Als Voreinstellung wird der Name aus der Seite <guilabel>Passwort &amp; Benutzerzugang</guilabel> des &systemsettings;-Kategorie <guilabel>Benutzerkontodetails</guilabel> verwendet.

source: Annotation tools
de: Anmerkungs-Werkzeuge

source: This pane is used to configure your <link linkend="annotations-add">annotating toolbar</link>.
de: In diesem Bereich kann die <link linkend="annotations-add">Werkzeugleiste für Anmerkungen</link> eingerichtet werden.

source: There are five buttons (<guibutton>Add</guibutton>, <guibutton>Edit</guibutton>, <guibutton>Remove</guibutton>, <guibutton>Move Up</guibutton>, <guibutton>Move Down</guibutton>) and a list box (which lists the contents of the current annotating toolbar) which are used to configure the toolbar.
de: Es gibt fünf Knöpfe (<guibutton>Hinzufügen</guibutton>, <guibutton>Bearbeiten</guibutton>, <guibutton>Entfernen</guibutton>, <guibutton>Nach oben</guibutton>, <guibutton>Nach unten</guibutton>) und ein Listenfeld mit dem Inhalt der aktuellen Werkzeugleiste mit Anmerkungen. Damit können Sie die Werkzeugleiste anpassen.

source: If you need to add some tool button on the toolbar click on the <guibutton>Add</guibutton> button. You can choose the <guilabel>Name</guilabel>, the <guilabel>Type</guilabel> and the <guilabel>Appearance</guilabel> of the created tool.
de: Brauchen Sie zusätzliche Knöpfe für Anmerkungen in der Werkzeugleiste, klicken Sie auf den Knopf <guibutton>Hinzufügen</guibutton>. Dann können Sie <guilabel>Name</guilabel>, <guilabel>Typ</guilabel> und <guilabel>Erscheinungsbild</guilabel> für den neuen Anmerkungstyp einstellen.

source: Please remember that annotation tools in &okular; are highly configurable. For example, you can have two buttons of the same tool but with different color. Do not hesitate to experiment in choosing the button set that is exactly tailored to your workflow.
de: Bitte denken Sie daran, dass die Werkzeuge für Anmerkungen vielfältig eingestellt werden können. Sie können zum Beispiel zwei Knöpfe für das selbe Werkzeug in verschieden Farben benutzen. Probieren Sie aus, welche Werkzeuge in den verschiedenen möglichen Einstellungen am besten für Ihre Arbeitsweise geeignet sind.

source: Click on some item in the list box then click on the corresponding button at the right part of the page to edit, remove, move up or move down the item. The keyboard shortcut of the tool (keys from <keycap>1</keycap> to <keycap>9</keycap>) depends on its position in the list of annotating toolbar.
de: Klicken Sie auf ein Element im Listenfeld und dann auf die entsprechenden Knöpfe auf der rechten Seite, um das Element zu bearbeiten, zu löschen, oder nach unten bzw. nach oben zu verschieben. Die Kurzbefehle der Elemente (Tasten von <keycap>1</keycap> bis <keycap>9</keycap>) entsprechen der Position in der Liste.

source: Choose the editor you want to launch when &okular; wants to open a source file. This is the case when the document has references to the various points (usually row and column number) of sources it was generated from. The &DVI; format supports natively the addition of the information about the sources the LaTeX document was generated from. A similar system exists for &PDF; documents, called <acronym>pdfsync</acronym>, which stores these extra information in an external file named after the &PDF; file itself (for example <filename>mydocument.pdfsync</filename> for <filename>mydocument.pdf</filename>).
de: Wählen Sie hier den Editor aus, der zur Bearbeitung der Quelldatei des Dokuments gestartet wird. In einigen Dokumenten sind Verweise - normalerweise Zeilen- und Spaltennummer - auf die Quelldatei enthalten, aus der das Dokument generiert wurde. Im &DVI;-Format werden zum Beispiel Informationen über die LaTeX-Quelltexte gespeichert. Ein ähnliches System namens <acronym>pdfsync</acronym> gibt es für &PDF;-Dokumente. Hier werden die zusätzlichen Informationen in einer eigenen Datei gespeichert, die nach der &PDF;-Datei benannt ist, zum Beispiel <filename>meindokument.pdfsync</filename> mit den Metadaten für das Dokument <filename>meindokument.pdf</filename>.

source: &okular; ships with preconfigured settings for the following editors: <ulink url="http://kate-editor.org/">&kate;</ulink>, <ulink url="http://kile.sourceforge.net/">Kile</ulink>, <ulink url="http://www.scintilla.org/SciTE.html">SciTE</ulink>, <ulink url="http://www.gnu.org/software/emacs/">&Emacs; client</ulink>, and <ulink url="http://www.lyx.org/">LyX client</ulink>.
de: &okular; enthält Voreinstellungen für folgende Editoren: <ulink url="http://kate-editor.org/">&kate;</ulink>, <ulink url="http://kile.sourceforge.net/">Kile</ulink>, <ulink url="http://www.scintilla.org/SciTE.html">SciTE</ulink>, <ulink url="http://www.gnu.org/software/emacs/">&Emacs;</ulink>und <ulink url="http://www.lyx.org/">LyX</ulink>.

source: To use inverse search in <application>Kile</application>, you have to compile your &latex; file with the <guilabel>Modern</guilabel> configuration.
de: Um die Rückwärtssuche in <application>Kile</application> verwenden zu können, muss die &latex;-Datei mit der Einstellung <guilabel>Modern</guilabel> kompiliert werden.

source: Command
de: Befehl

source: This is the command and its parameters to invoke the selected editor with the source file of the actual document.
de: Hier wird der Befehl und dessen Parameter zum Aufruf des gewählten Editors mit dem Quelltext des aktuellen Dokuments eingegeben.

source: This field will be filled automatically if you use one of the preconfigured editors. Otherwise, please choose <guimenuitem>Custom Text Editor</guimenuitem> in <guilabel>Editor</guilabel> drop down box and refer to the documentation on your favorite editor to find the proper command.
de: Dieses Feld wird automatisch ausgefüllt, wenn Sie einen der voreingestellten Editoren benutzen. Ansonsten wählen Sie <guimenuitem>Benutzerdefinierter Texteditor</guimenuitem> im Auswahlfeld <guilabel>Editor</guilabel> und lesen die Dokumentation des Editors, um den richtigen Befehl einzutragen.

source: You can use the following placeholders:
de: Die folgenden Platzhalter können benutzt werden:

source: %f - the file name
de: %f - der Dateiname

source: %l - the line of the file to be reached
de: %l - die anzuspringende Zeile in der Datei

source: %c - the column of the file to be reached
de: %c - die anzuspringende Spalte in der Datei
