Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdegraphics/okular.po
Languages: de

source: Bookmarks view
de: Lesezeichenansicht

source: To open <guilabel>Bookmarks</guilabel> view click on <guilabel>Bookmarks</guilabel> item on the <guilabel>Navigation Panel</guilabel>. If the <guilabel>Navigation Panel</guilabel> is not shown, use <menuchoice><shortcut><keycap>F7</keycap></shortcut> <guimenu>Settings</guimenu><guimenuitem>Show Navigation Panel</guimenuitem> </menuchoice> main menu item to make it visible.
de: Um die Ansicht der <guilabel>Lesezeichen</guilabel> zu öffnen, klicken Sie auf den Eintrag <guilabel>Lesezeichen</guilabel> im <guilabel>Navigationsbereich</guilabel>. Wenn der <guilabel>Navigationsbereich</guilabel> nicht angezeigt wird, wählen Sie im Menü <menuchoice><shortcut><keycap>F7</keycap></shortcut> <guimenu>Einstellungen</guimenu><guimenuitem>Navigationsbereich anzeigen</guimenuitem></menuchoice>

source: <screeninfo>Bookmark view context menu</screeninfo>
de: <screeninfo>Kontextmenü der Lesezeichenansicht</screeninfo>

source: <phrase>Bookmark view context menu</phrase>
de: <phrase>Kontextmenü der Lesezeichenansicht</phrase>

source: The filter bar at the top of <guilabel>Bookmarks</guilabel> view can be used to filter the content of bookmark list pane according to the text in the box.
de: Mit der Filterleiste in der Ansicht <guilabel>Lesezeichen</guilabel> kann der Inhalt der Lesezeichenliste entsprechend dem Text im Eingabefeld gefiltert werden.

source: The list pane permits to view the bookmark list in a tree-like fashion: each document in the list can be <quote>expanded</quote> or <quote>collapsed</quote> by clicking on the <guiicon>&lt;</guiicon> or <guiicon>v</guiicon> icon next to it.
de: In dieser Ansicht kann die Liste der Lesezeichen als Baumstruktur dargestellt werden: Die Lesezeichen für jedes Dokument in der Liste können durch Klicken auf die Symbole <guiicon>&lt;</guiicon> oder <guiicon>v</guiicon> neben dem Dateinamen aus- oder eingeklappt werden.

source: Click on <inlinemediaobject><imageobject><imagedata fileref="rating.png" format="PNG"/></imageobject></inlinemediaobject> icon below the list to show only the bookmarks from the current document.
de: Klicken Sie auf das Symbol <inlinemediaobject><imageobject><imagedata fileref="rating.png" format="PNG"/></imageobject></inlinemediaobject> unter der Liste, um nur die Lesezeichen im gerade geöffneten Dokument anzuzeigen.

source: Right-click menu of document item can be used to open document, rename its item or remove it from the list. Remember that the removal of a document item leads to the removal of all bookmarks in the corresponding document.
de: Mit den Aktionen im Kontextmenü des Dokumenteintrags kann das Dokument geöffnet, der Eintrag umbenannt oder aus der Liste entfernt werden. Beachten Sie, dass mit dem Dokument auch alle zugehörigen Lesezeichen entfernt werden.

source: Right-click menus of individual bookmark items allow you to go to the bookmark, rename or remove it.
de: Im Kontextmenü der einzelnen Lesezeichen können Sie zum Lesezeichen springen, es umbenennen oder entfernen.

source: Command Line Options
de: Befehlszeilenoptionen

source: Though &okular; may most often be started from the &kde; program menu, or a desktop icon, it can also be opened at the command line prompt of a terminal window. There are a few useful options that are available when doing this.
de: Auch wenn &okular; meistens vom &kde;-Menü oder über ein Arbeitsflächensymbol geöffnet wird, kann es von einer Befehlszeile in einem Terminalfenster gestartet werden. Es gibt hierbei einige nützliche Optionen.

source: Specify a File
de: Angabe eines Dateinamens

source: By specifying the path and name of a particular file the user can have &okular; open that file immediately upon startup. This option might look something like the following:
de: Der Benutzer kann Pfad und Dateinamen einer Datei angeben, die dann beim Starten von &okular; geöffnet wird. Hierzu ein Beispiel:

source: For &PDF; documents, the name can be given as <replaceable>document_name</replaceable>#<replaceable>named_destination</replaceable> where <replaceable>named_destination</replaceable> is a particular named destination embedded in the document.
de: Bei &PDF;-Dokumenten kann der Name in der Form <replaceable>document_name</replaceable>#<replaceable>named_destination</replaceable> angegeben werden. Dabei ist <replaceable>named_destination</replaceable> ein bestimmter benannter Bereich im Dokument.

source: Other Command Line Options
de: Weitere Befehlszeilenoptionen

source: The following command line help options are available
de: Die folgenden Hilfe-Möglichkeiten sind über die Befehlszeile verfügbar

source: This lists the most basic options available at the command line.
de: Zeigt die grundsätzlichen Möglichkeiten für die Befehlszeile an.

source: This lists the options available for changing the way &okular; interacts with &Qt;.
de: Zeigt die Optionen für die Einstellung der Zusammenarbeit von &okular; mit &Qt; an.

source: This lists the options available for changing the way &okular; interacts with &kde;.
de: Zeigt die Optionen für die Einstellung der Zusammenarbeit von &okular; mit &kde; an.

source: This lists all of the command line options.
de: Zeigt alle verfügbaren Befehlszeilenoptionen an.

source: Lists &okular;'s authors in the terminal window
de: Dieser Befehl zeigt die Autoren von &okular; im Terminalfenster an

source: Lists version information for &Qt;, &kde;, and &okular;. Also available through <userinput><command>okular</command> <option>-v</option></userinput>
de: Zeigt Versionsinformation für &Qt;, &kde; und &okular; an. Auch verfügbar durch: <userinput><command>okular</command> <option>-v</option></userinput>

source: Shows license information.
de: Zeigt Informationen zu den Lizenzbestimmungen.

source: <command>okular</command> <option>--page <replaceable>number</replaceable></option>
de: <command>okular</command> <option>--page <replaceable>zahl</replaceable></option>

source: Open a page with a given number in the document. Also available through <userinput><command>okular</command> <option>-p <replaceable>number</replaceable></option></userinput>
de: Öffnet die angegebene Seite im Dokument. Auch über die Option <userinput><command>okular</command> <option>-p <replaceable>zahl</replaceable></option></userinput> verfügbar.

source: Start the document in presentation mode.
de: Startet die Anzeige des Dokuments im Präsentationsmodus.

source: Start with print dialog.
de: Startet mit dem Druckdialog.

source: Unique instance control.
de: Nur eine Instanz des Programms verwenden.

source: Allows to prevent &okular; window raising after the start.
de: Mit dieser Option startet &okular; minimiert in der Kontrollleiste.

source: End of options.
de: Ende der Optionen.

source: The Menubar
de: Die Menüleiste

source: The File Menu
de: Das Menü Datei

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>O</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Open...</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>O</keycap></keycombo> </shortcut> <guimenu>Datei</guimenu> <guimenuitem>Öffnen ...</guimenuitem>

source: <action>Open</action> a supported file or &okular; archive. If there is already an opened file it will be closed. For more information, see the section about <link linkend="opening">Opening Files</link>.
de: <action>Öffnet</action> eine unterstützte Datei oder ein &okular;-Archiv. Vorher wird eine bereits geöffnete Datei geschlossen. Weitere Einzelheiten erfahren Sie im Abschnitt <link linkend="opening">Dateien öffnen</link>.

source: <guimenu>File</guimenu> <guisubmenu>Open Recent</guisubmenu>
de: <guimenu>Datei</guimenu> <guisubmenu>Zuletzt geöffnete Dateien</guisubmenu>

source: <action>Open</action> a file which was used previously from a submenu. If a file is currently being displayed it will be closed. For more information, see the section about <link linkend="opening">Opening Files</link>.
de: <action>Öffnet</action> eine der zuletzt geöffneten Dateien. Vorher wird eine bereits geöffnete Datei geschlossen. Weitere Einzelheiten erfahren Sie im Abschnitt <link linkend="opening">Dateien öffnen</link>.

source: <guimenu>File</guimenu> <guimenuitem>Import PostScript as &PDF;...</guimenuitem>
de: <guimenu>Datei</guimenu> <guimenuitem>PostScript als &PDF; importieren ...</guimenuitem>

source: <action>Open</action> a &PostScript; file and convert it to &PDF;.
de: <action>Öffnet</action> eine &PostScript;-Datei und wandelt sie in das &PDF;-Format um.

source: <guimenu>File</guimenu> <guimenuitem>Save As...</guimenuitem>
de: <guimenu>Datei</guimenu> <guimenuitem>Speichern unter ...</guimenuitem>

source: <action>Save</action> the currently open file under a different name using the document backend. With the &PDF; backend (Poppler >= 0.8 required) it is possible to save the document with the changed values of the form fields. It can be possible (provided that the data were not secured using DRM) to save annotations with &PDF; files (Poppler >= 0.22 required).
de: <action>Speichert</action> die gerade geöffnete Datei unter einem anderen Namen unter Verwendung des Anzeigemoduls für das Dokument. Mit dem &PDF;-Anzeigemodul mit Poppler in Version >= 0.8 können Sie das Dokument mit den geänderten Werten der Formularfelder speichern. Mit Poppler >= 0.22 ist es möglich, Anmerkungen in der &PDF;-Datei zu speichern, wenn sie nicht durch DRM geschützt ist.

source: <guimenu>File</guimenu> <guimenuitem>Save Copy As...</guimenuitem>
de: <guimenu>Datei</guimenu> <guimenuitem>Kopie speichern unter ...</guimenuitem>

source: <action>Save</action> a copy of the currently open file under a different name without using the current document backend.
de: <action>Speichert</action> eine Kopie der gerade geöffnete Datei unter einem anderen Namen ohne Verwendung des Anzeigemoduls.

source: <shortcut><keycap>F5</keycap></shortcut> <guimenu>File</guimenu> <guimenuitem>Reload</guimenuitem>
de: <shortcut><keycap>F5</keycap></shortcut><guimenu>Datei</guimenu><guimenuitem>Neu laden</guimenuitem>

source: <action>Reload</action> the currently open file.
de: <action>Lädt</action> die gerade geöffnete Datei erneut.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>P</keycap></keycombo></shortcut> <guimenu>File</guimenu> <guimenuitem>Print...</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>P</keycap></keycombo> </shortcut> <guimenu>Datei</guimenu> <guimenuitem>Drucken ...</guimenuitem>

source: <action>Print</action> the currently displayed document.
de: <action>Druckt</action> das angezeigte Dokument.

source: <guimenu>File</guimenu> <guimenuitem>Print Preview...</guimenuitem>
de: <guimenu>Datei</guimenu> <guimenuitem>Druckvorschau ...</guimenuitem>

source: <action>Show a preview</action> of how the currently displayed document would be printed with the default options.
de: <action>Zeigt eine Vorschau</action>, wie das aktuelle Dokument mit den Standardeinstellungen gedruckt wird.

source: <guimenu>File</guimenu> <guimenuitem>Properties</guimenuitem>
de: <guimenu>Datei</guimenu> <guimenuitem>Eigenschaften</guimenuitem>

source: <action>Display some basic information</action> about the document, such as title, author, creation date, and details about the fonts used. The available information depends on the type of document.
de: <action>Zeigt einige grundlegenden Informationen</action> über das Dokument, wie Titel, Autor, Datum der Erstellung und die verwendeten Schriften. Die angezeigten Informationen sind vom Typ des Dokuments abhängig.

source: <guimenu>File</guimenu> <guimenuitem>Embedded Files...</guimenuitem>
de: <guimenu>Datei</guimenu> <guimenuitem>Eingebettete Dateien ...</guimenuitem>

source: <action>Show the files embedded</action> in the document, if the document has any. For more information, see the section about the <link linkend="embedded-files">Embedded Files</link>.
de: <action>Zeigt die eingebetteten Dateien</action> im Dokument an. Weitere Informationen dazu finden Sie im Kapitel <link linkend="embedded-files">Eingebettete Dateien</link>.

source: <guimenu>File</guimenu> <guisubmenu>Export As</guisubmenu>
de: <guimenu>Datei</guimenu> <guisubmenu>Exportieren als</guisubmenu>

source: This item contains the export formats the current document can be exported to. The first entry for all kind of documents is always <guimenuitem>Plain Text...</guimenuitem>
de: Dieser Menüeintrag enthält alle Formate, in die das geöffnete Dokument exportiert werden kann. Für alle Dokumente gibt es immer als ersten Eintrag das Format <guimenuitem>Einfacher Text ...</guimenuitem>.

source: The second entry is <guimenuitem>Document Archive</guimenuitem>, which allows you to save the document with your annotations into an &okular;-specific archive format. Thus it is easily possible to share the original document and your annotations with other &okular; users or work with them collaboratively.
de: Der zweite Eintrag ist <guimenuitem>Dokumentarchiv</guimenuitem>. Damit können Dokumente zusammen mit den Anmerkungen in einen nur mit &okular; lesbaren Archivformat gespeichert werden. Dieses Archiv ermöglicht es, ein Dokument zusammen mit den Anmerkungen als eine Datei an andere Personen zu senden.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo></shortcut> <guimenu>File</guimenu> <guimenuitem>Quit</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl; <keycap>Q</keycap></keycombo></shortcut> <guimenu>Datei</guimenu> <guimenuitem>Beenden</guimenuitem>

source: <action>Close</action> &okular;.
de: <action>Beendet</action> &okular;.

source: The Edit Menu
de: Das Menü Bearbeiten

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>Z</keycap></keycombo></shortcut> <guimenu>Edit</guimenu> <guimenuitem>Undo</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>Z</keycap></keycombo></shortcut> <guimenu>Bearbeiten</guimenu> <guimenuitem>Rückgängig</guimenuitem>

source: <action>Undo</action> the last annotation editing command (creation and removal of annotations, editing arbitrary annotation properties, relocating annotations with &Ctrl;+drag, and editing the text contents of an annotation).
de: <action>Nimmt</action> den letzte Aktion zur Änderung einer Anmerkung zurück. Das betrifft das Erstellen und Löschen, beliebige Änderungen von Eigenschaften, das Verschieben durch Ziehen mit gedrückte &Ctrl;-Taste und Änderung am Text der Anmerkung.

source: <shortcut><keycombo action="simul">&Ctrl;&Shift;<keycap>Z</keycap></keycombo></shortcut> <guimenu>Edit</guimenu> <guimenuitem>Redo</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;&Shift;<keycap>Z</keycap></keycombo></shortcut> <guimenu>Bearbeiten</guimenu><guimenuitem>Wiederherstellen</guimenuitem>

source: <action>Redo</action> the last undo step when editing annotations.
de: <action>Wiederholt</action> den zuletzt rückgängig gemachten Schritt bei der Bearbeitung von Anmerkungen.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>C</keycap></keycombo></shortcut> <guimenu>Edit</guimenu> <guimenuitem>Copy</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>C</keycap></keycombo></shortcut> <guimenu>Bearbeiten</guimenu> <guimenuitem>Kopieren</guimenuitem>

source: <action>Copy</action> the currently selected text in <guibutton>Text Selection</guibutton> mode to the clipboard.
de: <action>Kopiert</action> den ausgewählten Text im Modus <guibutton>Textauswahl</guibutton> in die Zwischenablage.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>A</keycap></keycombo></shortcut> <guimenu>Edit</guimenu> <guimenuitem>Select All</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>A</keycap></keycombo></shortcut> <guimenu>Bearbeiten</guimenu> <guimenuitem>Alles auswählen</guimenuitem>

source: <action>Selects</action> all the text (if the document provides it). This works only in <guibutton>Text Selection</guibutton> mode.
de: <action>Wählt</action> den gesamten Text aus, wenn es das Dokument zulässt. Das funktioniert nur im Modus <guibutton>Textauswahl</guibutton>.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>F</keycap></keycombo></shortcut> <guimenu>Edit</guimenu> <guimenuitem>Find...</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl; <keycap>F</keycap></keycombo></shortcut> <guimenu>Bearbeiten</guimenu> <guimenuitem>Suchen ...</guimenuitem>

source: Show the find bar on the bottom of the viewing area that allows you to <action>search for a string in the document</action>.
de: Zeigt die Suchleiste unten im Anzeigebereich an, um nach einer <action>Zeichenkette in Dokument zu suchen</action>.

source: <shortcut><keycap>F3</keycap></shortcut> <guimenu>Edit</guimenu> <guimenuitem>Find Next</guimenuitem>
de: <shortcut><keycap>F3</keycap></shortcut> <guimenu>Bearbeiten</guimenu> <guimenuitem>Weitersuchen</guimenuitem>

source: Try to <action>find the previous searched string again</action> in the document.
de: <action>Wiederholt die Suche</action> nach der letzten Zeichenkette im Dokument.

source: <shortcut><keycombo action="simul">&Shift;<keycap>F3</keycap></keycombo></shortcut> <guimenu>Edit</guimenu> <guimenuitem>Find Previous</guimenuitem>
de: <shortcut><keycombo action="simul">&Shift;<keycap>F3</keycap></keycombo></shortcut> <guimenu>Bearbeiten</guimenu> <guimenuitem>Frühere suchen</guimenuitem>

source: <action>Goes to the previous occurrence of the search string</action> in the document.
de: <action>Sucht nach der vorherigen Fundstelle des Suchtextes</action> im Dokument.

source: The View Menu
de: Das Menü Ansicht

source: <shortcut><keycombo action="simul">&Ctrl;&Shift;<keycap>P</keycap></keycombo></shortcut> <guimenu>View</guimenu> <guimenuitem>Presentation</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;&Shift;<keycap>P</keycap></keycombo></shortcut> <guimenu>Ansicht</guimenu> <guimenuitem>Präsentation</guimenuitem>

source: <action>Activates</action> the Presentation Mode. For more information, see the section about <link linkend="presentationMode">Presentation Mode</link>.
de: <action>Schaltet</action> den Präsentationsmodus ein. Weitere Informationen dazu finden Sie im Kapitel <link linkend="presentationMode">Präsentationsmodus</link>.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>+</keycap></keycombo></shortcut> <guimenu>View</guimenu> <guimenuitem>Zoom In</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>+</keycap></keycombo></shortcut> <guimenu>Ansicht</guimenu> <guimenuitem>Vergrößern</guimenuitem>

source: <action>Increase the magnification</action> of the document view.
de: <action>Erhöht den Vergrößerungsfaktor</action> der Ansicht des Dokuments.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>-</keycap></keycombo></shortcut> <guimenu>View</guimenu> <guimenuitem>Zoom Out</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>-</keycap></keycombo></shortcut> <guimenu>Ansicht</guimenu> <guimenuitem>Verkleinern</guimenuitem>

source: <action>Decrease the magnification</action> of the document view.
de: <action>Verringert den Vergrößerungsfaktor</action> der Ansicht des Dokuments.

source: <guimenu>View</guimenu> <guimenuitem>Fit Width</guimenuitem>
de: <guimenu>Ansicht</guimenu> <guimenuitem>Seitenbreite</guimenuitem>

source: <action>Change the magnification</action> of the document view to a value that makes the pages' width equal to the document view's width.
de: <action>Ändert den Vergrößerungsfaktor</action> der Ansicht des Dokuments, sodass die Seitenbreite in den Ansichtsbereich passt.

source: <guimenu>View</guimenu> <guimenuitem>Fit Page</guimenuitem>
de: <guimenu>Ansicht</guimenu> <guimenuitem>Ganze Seite</guimenuitem>

source: <action>Change the magnification</action> of the document view to a value that makes at least one whole page visible.
de: <action>Ändert den Vergrößerungsfaktor</action> der Ansicht des Dokuments, sodass die ganze Seite in der Ansicht angezeigt wird.

source: <guimenu>View</guimenu> <guimenuitem>Auto Fit</guimenuitem>
de: <guimenu>Ansicht</guimenu> <guimenuitem>Automatisch einpassen</guimenuitem>

source: <action>Change the magnification</action> of the document view to a value that, depending on the size relation between the page and the view area, automatically either makes the pages' width equal to the document view's width (like fit-width), the pages' height equal to the document view's height (like fit-height), or the whole page visible (like fit-page).
de: <action>Ändert die Vergrößerung</action> des angezeigten Dokuments abhängig vom Größenverhältnis zwischen der Seite und dem Anzeigebereich automatisch nach folgenden Regel: Entweder wird die Seitenbreite oder die Seitenhöhe oder die ganze Seite in den Ansichtsbereich eingepasst.

source: <guimenu>View</guimenu> <guimenuitem>Continuous</guimenuitem>
de: <guimenu>Ansicht</guimenu> <guimenuitem>Fortlaufend</guimenuitem>

source: <action>Enable the continuous page mode</action>. In continuous mode, all pages of the document are shown, and you can scroll through them without having to use the <menuchoice><guimenu>Go</guimenu> <guimenuitem>Previous Page</guimenuitem></menuchoice> and <menuchoice><guimenu>Go</guimenu><guimenuitem>Next Page</guimenuitem> </menuchoice> options.
de: <action>Zeigt die Seiten fortlaufend an</action>. In diesem Anzeigemodus werden alle Seiten des Dokuments hintereinander dargestellt. Um zu blättern, müssen Sie dann nicht das Menü <menuchoice><guimenu>Gehe zu</guimenu><guimenuitem>Vorige Seite</guimenuitem></menuchoice> und <menuchoice><guimenu>Gehe zu</guimenu><guimenuitem>Nächste Seite</guimenuitem></menuchoice> benutzen.

source: <guimenu>View</guimenu> <guisubmenu>View Mode</guisubmenu>
de: <guimenu>Ansicht</guimenu> <guisubmenu>Anzeigemodus</guisubmenu>

source: This submenu makes you choose the view mode for the pages. The possible options are: <guimenuitem>Single Page</guimenuitem> (only one page per row), <guimenuitem>Facing Pages</guimenuitem> (two pages per row, in a book style), <guimenuitem>Facing Pages (Center First Page)</guimenuitem> and <guimenuitem>Overview</guimenuitem> (the number of columns is the one specified in the <link linkend="configure">&okular; settings</link>).
de: In diesem Untermenü können Sie den Anzeigemodus der Seiten einstellen. Sie haben folgende Auswahl: <guimenuitem>Einzelne Seiten</guimenuitem>, <guimenuitem>Gegenüberliegende Seiten</guimenuitem> (wie bei Büchern), <guimenuitem>Gegenüberliegende Seiten (erste Seite zentrieren)</guimenuitem> und <guimenuitem>Übersicht</guimenuitem> mit der Anzahl der Spalten, die im <link linkend="configure">Einrichtungsdialog von &okular;</link> eingestellt sind.

source: <guimenu>View</guimenu> <guisubmenu>Orientation</guisubmenu>
de: <guimenu>Ansicht</guimenu> <guisubmenu>Ausrichtung</guisubmenu>

source: This submenu allows you to <action>changes the orientation</action> of the pages of the document.
de: In diesem Untermenü können Sie die <action>Ausrichtung der Seiten des Dokuments ändern</action>.

source: The rotation is applied to the orientation of every page.
de: Die Ausrichtung wird auf alle Seiten des Dokuments angewendet.

source: You can select <guimenuitem>Original Orientation</guimenuitem> to restore the orientation of the document, discarding all the rotations applied manually.
de: Wählen Sie <guimenuitem>Ursprüngliche Ausrichtung</guimenuitem>, um alle geänderten Ausrichtungen wieder rückgängig zu machen.

source: <guimenu>View</guimenu> <guisubmenu>Page Size</guisubmenu>
de: <guimenu>Ansicht</guimenu> <guisubmenu>Seitengröße</guisubmenu>

source: <action>Changes the size of the pages</action> of the document.
de: <action>Ändert die Größe der Seiten</action> des Dokuments.
