Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdegraphics/okular.po
Languages: de

source: The &okular; Handbook
de: Das Handbuch zu &okular;

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Burkhard</firstname><surname>Lück</surname><affiliation><address><email>lueck@hube-lueck.de</email></address></affiliation><contrib>Übersetzung</contrib></othercredit>

source: &okular; is a &kde; universal document viewer based on &kpdf; code.
de: &okular; ist ein &kde;-Betrachter für alle Dokumente auf der Grundlage des &kpdf;-Quelltextes.

source: annotation
de: Anmerkung

source: Introduction
de: Einleitung

source: &okular; is a &kde; universal document viewer based on the code of the &kpdf; application. Although being based on &kpdf; code, &okular; has some unique features such as overview mode, improved presentation support and annotation support.
de: &okular; ist ein &kde;-Betrachter für alle Dokumente auf der Grundlage des Quelltextes von &kpdf;. &okular; hat im Vergleich zu &kpdf; jedoch zusätzliche Eigenschaften wie einen Übersichtmodus, einen verbesserten Präsentationsmodus und Unterstützung für Anmerkungen.

source: &okular; supports a lot of different formats like &PDF;, &PostScript;, Tiff, CHM, DjVU, Images (png, jpg, &etc;) XPS, Open Document (ODT), Fiction Books, Comic Book, Plucker, EPub and Fax. For all supported formats and their features see <ulink url="http://okular.kde.org/formats.php"> &okular; Document Format Handlers</ulink>.
de: &okular; unterstützt eine große Zahl von Formaten wie &PDF;, &PostScript;, Tiff, CHM, DjVU, Images (png, jpg, &etc;) XPS, Open Document (ODT), Fiction Books, Comic Book, Plucker, EPub und Fax. Informationen über alle unterstützten Formate und deren Funktionen finden Sie auf der Seite <ulink url="http://okular.kde.org/formats.php">&okular;-Dokumentformate</ulink>.

source: <screeninfo>&okular;s Main Window</screeninfo>
de: <screeninfo>&okular;s Hauptfenster</screeninfo>

source: <phrase>&okular;s Main Window</phrase>
de: <phrase>&okular;s Hauptfenster</phrase>

source: Basic Usage
de: Grundlagen

source: Opening Files
de: Dateien öffnen

source: To view any supported file in &okular;, select <menuchoice><guimenu>File</guimenu><guimenuitem>Open...</guimenuitem> </menuchoice>, choose a supported file in the dialog and click <guibutton>Open</guibutton>. Your file should now be displayed in the main window.
de: Um eine Datei in &okular; anzusehen, wählen Sie <menuchoice><guimenu>Datei</guimenu><guimenuitem>Öffnen ...</guimenuitem></menuchoice>, dann im Dialogfenster eine Datei in einem der unterstützten Formate und drücken <guibutton>Öffnen</guibutton>. Ihre Datei wird nun im Hauptfenster angezeigt.

source: The new document will be opened in a new tab should the <guilabel>Open new files in tabs</guilabel> option on the <link linkend="configgeneral">General configuration page</link> is checked.
de: Das neue Dokument wird in einem neuen Unterfenster geöffnet, wenn die <guilabel>Neue Dateien in neuen Unterfenstern öffnen</guilabel> im <link linkend="configgeneral">Einrichtungsdialog auf der Seite Allgemein</link> aktiviert ist.

source: If you have already opened files in &okular; before, you can quickly access them by selecting them in the <menuchoice><guimenu>File</guimenu><guisubmenu>Open Recent</guisubmenu></menuchoice> menu.
de: Wenn Sie bereits vorher Dateien in &okular; geöffnet hatten, können Sie am schnellsten über das Menü <menuchoice><guimenu>Datei</guimenu><guisubmenu>Zuletzt geöffnete Dateien</guisubmenu> </menuchoice> wieder darauf zugreifen.

source: &okular; is the default &kde; application for &PDF; and &PostScript; files, launched when you click with the &LMB; on such a file type in the filemanager. If you want to open any file whose format is supported by &okular; use <menuchoice><guimenu>Open with...</guimenu><guimenuitem>&okular;</guimenuitem> </menuchoice> from context menu in the filemanager.
de: &okular; ist das &kde;-Standardprogramm für &PDF;- und &PostScript;-Dateien. Wenn Sie im Dateiverwaltungsprogramm mit der &LMBn; auf eine Datei diese Typs klicken, wird sie in &okular; geöffnet. Möchten Sie auch andere Dateien öffnen, die von &okular; angezeigt werden können, wählen Sie <menuchoice><guimenu>Öffnen mit </guimenu><guimenuitem>&okular;</guimenuitem> </menuchoice> aus dem Kontextmenü in der Dateiverwaltung.

source: After having a file opened you probably want to read it and therefore navigate through it. Go to the <link linkend="navigating">next section</link> to learn more about this.
de: Nachdem Sie eine Datei geöffnet haben, wollen Sie sie vermutlich lesen und daher im Text blättern. Im <link linkend="navigating">nächsten Abschnitt</link> lernen Sie mehr darüber.

source: Navigating
de: Navigation

source: This section describes how you can navigate through a document in &okular;.
de: Dieser Abschnitt erklärt, wie Sie sich in &okular; in einem Dokument bewegen können.

source: There are multiple ways of scrolling the viewing area. One is to use the <keysym>Up Arrow</keysym> and <keysym>Down Arrow</keysym> keys. You may also use the scrollbar, your mousewheel or the <keycap>Page Up</keycap> and <keycap>Page Down</keycap> keys.
de: Es gibt mehrere Möglichkeiten, im Dokument zu blättern. Sie können den Ansichtsbereich mit den Tasten <keysym>Pfeil hoch</keysym> und <keysym>Pfeil runter</keysym> verschieben. Dazu können Sie auch die Bildlaufleisten, das Mausrad oder die Tasten <keycap>Bild auf</keycap> und <keycap>Bild ab</keycap> benutzen.

source: You can also use <application>vim</application>-like navigation keys, namely <keycap>H</keycap> to move to the top of the previous page, <keycap>L</keycap> to move to the top of the next page, <keycap>J</keycap> to move one line down, and <keycap>K</keycap> to move one line up.
de: Benutzen Sie Navigationstasten wie im Programm <application>vim</application>, und zwar <keycap>H</keycap> um zum Anfang der vorherigen Seite und <keycap>L</keycap> um zum Anfang der nächsten Seite zu gehen. Mit <keycap>J</keycap> gehen Sie eine Zeile nach unten und mit <keycap>K</keycap> eine Zeile nach oben.

source: Another way is to hold the &LMB; down at any place on the document while dragging the mouse in the opposite direction of where you want to move. This procedure only works if the Browse Tool is enabled, which you can select by choosing <menuchoice><guimenu>Tools</guimenu> <guimenuitem>Browse Tool</guimenuitem></menuchoice>.
de: Außerdem können Sie mit der &LMBn; auf eine beliebige Stelle im Dokument drücken und durch Ziehen der Maus die Ansicht verschieben. Dies funktioniert aber nur, wenn Sie im Menü <menuchoice><guimenu>Extras</guimenu><guimenuitem>Navigation</guimenuitem></menuchoice> ausgewählt haben.

source: When viewing a document in the <link linkend="presentationMode">Presentation mode</link> use <keysym>Up Arrow</keysym> and <keysym>Down Arrow</keysym> keys to switch between pages or slides. The number and the position of the current slide will be shown in the overlay at the right upper corner of screen.
de: Wird ein Dokument im <link linkend="presentationMode">Präsentationsmodus </link> angezeigt, wechseln Sie mit den Tasten <keysym>Pfeil abwärts</keysym> und <keysym>Pfeil aufwärts</keysym> zwischen den Seiten oder Folien. Die Seitenzahl und Position der aktuellen Seite im Dokument werden in der rechten oberen Ecke des Bildschirms als Symbol eingeblendet.

source: If you want to read a document with several pages use the automatic scrolling feature of &okular;. Start automatic scrolling with <keycombo action="simul">&Shift;<keysym>Down Arrow</keysym></keycombo> or <keycombo action="simul">&Shift;<keysym>Up Arrow</keysym></keycombo>. Then use these keys to increase and decrease the scrolling speed. You can start or stop automatic scrolling temporarily by pressing the &Shift; key; pressing any other key deactivates this feature.
de: Möchten Sie ein Dokument mit mehreren Seiten lesen, dann können Sie das automatische Blättern in &okular; aktivieren. Starten Sie es mit <keycombo action="simul">&Shift;<keysym>Pfeil runter</keysym></keycombo> oder <keycombo action="simul">&Shift;<keysym>Pfeil hoch</keysym></keycombo>. Benutzen Sie dann diese Tasten, um die Geschwindigkeit des Blättern zu ändern. Mit der &Shift;-Taste können Sie das automatische Blättern vorübergehend anhalten und wieder starten. Drücken Sie auf eine beliebige andere Tasten, um diese Funktion abzuschalten.

source: Another way to navigate through a document with several pages is to use the mouse pointer. Drag the page up or down, continue to drag even while reaching the bottom or top of the screen and behold. Once you cross the border of a page, the mouse cursor appears on top or bottom of the screen again and you can just continue to drag.
de: Weiterhin gibt es die Möglichkeit, in einem mehrseitigen Dokument mit dem Mauszeiger zu blättern. Halten Sie dazu die linke Maustaste gedrückt und ziehen Sie dann den Mauszeiger nach oben oder unten und setzen diese Bewegung auch über den oberen oder unteren Rand des Bildschirms fort. Überschreiten Sie den Rand der Seite, erscheint der Mauszeiger wieder unten oder oben auf dem Bildschirm und Sie können das Blättern in der gewünschten Richtung fortsetzen.

source: The navigation panel on the left side of the screen enables two more ways of navigating through a document:
de: Im Navigationsbereich auf der linken Seite des Fensters haben Sie zwei weitere Möglichkeiten, sich im einem Dokument zu bewegen.

source: If you click on a page thumbnail the viewing area will be brought to that page.
de: Wenn Sie auf ein Vorschaubild klicken, wird die zugehörige Seite angezeigt.

source: If the document has a table of contents, clicking on a table of contents item will bring the document to the page linked to that item.
de: Wenn das Dokument ein Inhaltsverzeichnis hat, können Sie mit Klicken auf einen Eintrag die zugehörige Seite anzeigen.

source: If the document has bookmarks, enable the <guilabel>Bookmarks</guilabel> view and click them to go to the associated page. If bookmarks are not only shown for the current document, you can quickly switch to bookmarks in all recently opened files.
de: Enthält ein Dokument Lesezeichen, wechseln Sie zur Ansicht <guilabel>Lesezeichen</guilabel>. Klicken Sie dann auf die einzelnen Lesezeichen, um zur zugehörigen Seite zu gehen. Werden Lesezeichen nicht nur für das aktuelle Dokument angezeigt, können Sie schnell zu allen Lesezeichen in den kürzlich geöffneten Dateien wechseln.

source: If the document has annotations, enable the <guilabel>Reviews</guilabel> view and click the annotations or select them with the <keysym>Up Arrow</keysym> and <keysym>Down Arrow</keysym> keys and press <keycap>Return</keycap> to go to the associated page.
de: Enthält ein Dokument Anmerkungen, wechseln Sie zur Ansicht <guilabel>Rezensionen</guilabel>. Klicken Sie auf die Anmerkungen oder wählen Sie sie mit den Tasten <keysym>Pfeil hoch</keysym> oder <keysym>Pfeil runter</keysym>, drücken dann die <keycap>Eingabe</keycap>taste, dann wird die zugehörige Seite angezeigt.

source: Some documents have links. In this case you can click on them and the view will change to the page it links to. If the link is to a web page or some other document the default &kde; handler for that format will be invoked. For example, clicking on a link pointing to <quote>http://www.kde.org</quote> will open the web page in the default &kde;'s web browser.
de: Enthält das Dokument Verknüpfungen, können Sie mit einem Klick darauf die verknüpfte Seite anzeigen lassen. Zeigt die Verknüpfung auf eine Webseite oder andere Dokumente, wird der das &kde;-Standardprogramm für dieses Format mit der verknüpften Datei gestartet. Klicken Sie zum Beispiel auf eine Verknüpfung zu <quote>http://www.kde.org</quote>, wird diese Webseite im Standard-Webbrowser des &kde;-Arbeitsumgebung geöffnet.

source: The document internal links work only when <link linkend="menutools">Browse Tool</link> is used.
de: Interne Verknüpfungen im Dokument funktionieren nur im <link linkend="menutools">Navigationsmodus</link>.

source: Additionally, you may use the following functionality to quickly move to specific places in the document:
de: Zusätzlich können Sie mit diesen Methoden schnell an bestimmte Stellen des Dokuments springen:

source: You can go to the beginning of the document using <keycombo action="simul">&Ctrl;<keycap>Home</keycap></keycombo> or using <menuchoice> <guimenu>Go</guimenu> <guimenuitem>Beginning of the document</guimenuitem> </menuchoice>.
de: Zum Anfang eines Dokuments mit <keycombo action="simul">&Ctrl;<keycap>Pos1</keycap></keycombo> oder mit <menuchoice> <guimenu>Gehe zu</guimenu> <guimenuitem>Anfang des Dokuments</guimenuitem> </menuchoice>.

source: You can go to the end of the document using <keycombo action="simul">&Ctrl;<keycap>End</keycap></keycombo> or using <menuchoice> <guimenu>Go</guimenu> <guimenuitem>End of the document</guimenuitem> </menuchoice>.
de: Zum Ende eines Dokuments mit <keycombo action="simul">&Ctrl;<keycap>Ende</keycap></keycombo> oder mit <menuchoice> <guimenu>Gehe zu</guimenu> <guimenuitem>Ende des Dokuments</guimenuitem> </menuchoice>.

source: You can go forward in the document using <keycap>Space</keycap> or <keycap>Page Down</keycap>. To go to the next page of the document use the <guibutton>Next Page</guibutton> Toolbar button or <menuchoice> <guimenu>Go</guimenu> <guimenuitem>Next Page</guimenuitem> </menuchoice> in the menubar.
de: Weiter vorwärts im Dokument mit der <keycap>Leertaste</keycap> oder mit der Taste <keycap>Bild ab</keycap>. Zur nächsten Seite eines Dokuments kommen Sie mit <guibutton>Nächste Seite</guibutton> in der Werkzeugleiste oder mit <menuchoice> <guimenu>Gehe zu</guimenu> <guimenuitem>Nächste Seite</guimenuitem> </menuchoice> im Menü.

source: You can go back in the document using &Backspace; or <keycap>Page Up</keycap>. To go to the previous page of the document use <guibutton>Previous Page</guibutton> Toolbar button or <menuchoice> <guimenu>Go</guimenu> <guimenuitem>Previous Page</guimenuitem> </menuchoice> in the menubar.
de: Zurück im Dokument mit der &Backspace; oder mit der Taste <keycap>Bild auf</keycap>. Zur vorigen Seite eines Dokuments kommen Sie mit <guibutton>Vorige Seite</guibutton> in der Werkzeugleiste oder mit <menuchoice> <guimenu>Gehe zu</guimenu> <guimenuitem>Vorige Seite</guimenuitem> </menuchoice> im Menü.

source: You can go back to the positions in the document where you came from in a chronological order. Consider &eg; reading the phrase <quote>As shown in [15], …</quote>, and you want to know quickly lookup reference [15]. So you click on it, and &okular; will jump to the list of references. Using <keycombo>&Alt;&Shift;<keysym>Left</keysym></keycombo> or <menuchoice> <guimenu>Go</guimenu> <guimenuitem>Back</guimenuitem> </menuchoice> in the menubar will bring you back to exactly the position where you came from.
de: Sie können zu Positionen im Dokument in zeitlicher Reihenfolge wieder zurückgehen. Angenommen Sie lesen den Satz <quote>wie in [15] gezeigt</quote> und Sie möchten sofort die Referenz [15] nachlesen. Also klicken Sie darauf und &okular; geht zur Referenzliste. Mit dem Kurzbefehl <keycombo>&Alt;&Shift;<keysym>Pfeil links</keysym></keycombo> oder <menuchoice> <guimenu>Gehe zu</guimenu> <guimenuitem>Zurück</guimenuitem> </menuchoice> aus der Menüleiste gelangen Sie direkt wieder zur Ausgangsposition zurück.

source: You can go forward in the document after the jumping back as described above using <keycombo>&Alt;&Shift;<keysym>Right</keysym></keycombo> or <menuchoice> <guimenu>Go</guimenu> <guimenuitem>Forward</guimenuitem> </menuchoice> in the menubar.
de: Nachdem Sie wie vorher beschrieben zurückgegangen sind, können Sie mit dem Kurzbefehl <keycombo>&Alt;&Shift;<keysym>Pfeil rechts</keysym></keycombo> oder <menuchoice> <guimenu>Gehe zu</guimenu> <guimenuitem>Nach vorne</guimenuitem> </menuchoice> aus der Menüleiste nach vorne gehen.

source: You can go to the next match when searching using <keycap>F3</keycap> or &Enter; (when the focus is on <guilabel>Find</guilabel> text field) keys or <menuchoice> <guimenu>Edit</guimenu> <guimenuitem>Find Next</guimenuitem> </menuchoice> menu item or move back to the previous match using <keycombo>&Shift;<keysym>F3</keysym></keycombo> or <keycombo>&Shift;&Enter;</keycombo> (when the focus is on <guilabel>Find</guilabel> text field) keys or <menuchoice> <guimenu>Edit</guimenu> <guimenuitem>Find Previous</guimenuitem> </menuchoice> menu item.
de: Zur nächsten Übereinstimmung beim Suchen gelangen Sie mit den Tasten <keycap>F3</keycap> oder &Enter; (wenn das Eingabefeld <guilabel>Suchen</guilabel> den Fokus hat) oder mit dem Menüeintrag<menuchoice> <guimenu>Bearbeiten</guimenu> <guimenuitem>Weitersuchen</guimenuitem> </menuchoice>, zur vorherigen Übereinstimmung mit dem Kurzbefehl <keycombo>&Shift;<keysym>F3</keysym></keycombo> oder <menuchoice> <guimenu>Bearbeiten</guimenu> <guimenuitem>Frühere suchen</guimenuitem> </menuchoice>.

source: Presentation Mode
de: Präsentationsmodus

source: The Presentation mode represents another way to view documents in &okular;. It can be enabled in <menuchoice><guimenu>View</guimenu><guimenuitem>Presentation</guimenuitem></menuchoice>. It shows the document on a page per page basis. The pages are shown with zoom to page, that means all the page is visible.
de: Der Präsentationsmodus ist eine andere Art, Dokumente in &okular; anzuzeigen. Diesen Modus können Sie mit <menuchoice><guimenu>Ansicht</guimenu><guimenuitem>Präsentation</guimenuitem></menuchoice> einschalten. In diesem Modus wird das Dokument seitenweise angezeigt. Die Vergrößerung wird so eingestellt, dass die ganze Seite sichtbar ist.

source: &PDF; documents can even specify that they are always opened in presentation mode.
de: Es gibt auch &PDF;-Dokumente, die nur im Präsentationsmodus angezeigt werden können.

source: When in presentation mode, you have an helper bar located on the top of the screen. Just move the mouse cursor to the top of the screen to make it appear.
de: Im Präsentationsmodus wird eine Werkzeugleiste am oberen Bildschirmrand angezeigt, wenn Sie den Mauszeiger dorthin bewegen.

source: <screeninfo>&okular; in Presentation Mode</screeninfo>
de: <screeninfo>&okular; im Präsentationsmodus</screeninfo>

source: <phrase>&okular; in Presentation Mode</phrase>
de: <phrase>&okular; im Präsentationsmodus</phrase>

source: To navigate between pages you may use the &LMB; (next page) and the &RMB; (previous page), the mouse wheel, the arrow icons or the line edit in the top bar, or the keys specified in the <link linkend="navigating">Navigating</link> section.
de: Zwischen den Seiten können Sie mit der &LMBn; (nächste Seite), mit der &RMBn; (vorige Seite), mit dem Mausrad, durch Klicken auf die Pfeilsymbole oder direkte Eingabe der Seitenzahl in der Leiste am oberen Rand des Fenster oder mit den Tasten aus dem Abschnitt <link linkend="navigating">Navigation</link> blättern.

source: Use <guilabel>Play/Pause</guilabel> button in the top bar to start playing presentation or pause it, correspondingly.
de: Benutzen Sie <guilabel>Anhalten/Wiedergeben</guilabel>in der oberen Leiste, um die Wiedergabe der Präsentation anzuhalten und wieder zu starten.

source: You can exit presentation mode at any time by pressing the &Esc; key or clicking the <guiicon>Quit</guiicon> icon in the top bar.
de: Sie können die Präsentation jederzeit mit der &Esc;-Taste oder mit einem Klick auf das Symbol <guiicon>Präsentationsmodus beenden</guiicon> in der Navigationsleiste oben in Fenster wieder verlassen.

source: You can also draw on the current page with a pencil. Click on the <guilabel>Toggle Drawing Mode</guilabel> icon in the top bar to enable or disable the possibility to draw in the presentation mode. The drawings are cleared automatically when leaving the presentation mode. You can also click on the <guilabel>Erase Drawings</guilabel> icon to remove the drawings in the current page.
de: Außerdem können Sie auf der angezeigten Seite Linien zeichnen. Klicken Sie auf das Symbol <guilabel>Zeichenmodus umschalten</guilabel> in der Werkzeugleiste, um diesen Modus ein- oder auszuschalten. Die Linien werden automatisch gelöscht, wenn Sie den Präsentationsmodus verlassen. Mit der Auswahl des Symbols <guilabel>Zeichnungen löschen</guilabel> in der Werkzeugleiste können Sie Ihre Linien auch auf der aktuell angezeigten Seite löschen.

source: The presentation mode has support for more than one screen in a multi-monitor configuration. With more than one screen a new button will appear in the top bar, with the icon of a screen: this is a drop down box that allows you to move the presentation to any of the other available screens.
de: Im Präsentationsmodus können Sie auch mehrere Bildschirme benutzen, sofern vorhanden und eingerichtet, Dann erscheint ein zusätzlicher Knopf in der Leiste am oberen Bildschirmrand mit dem Symbol eines Bildschirms. Hier können Sie einen der vorhandenen Bildschirme zur Anzeige der Präsentation wählen.

source: Presentation mode has some configuration options, you can find their description in the chapter <link linkend="configpresentation">Configuring &okular;</link>.
de: Der Präsentationsmodus hat einige Einstellungsoptionen, die Sie unter <link linkend="configpresentation">&okular; einrichten ...</link> finden.

source: Inverse Search between &latex; Editors and &okular;
de: Rückwärtssuche zwischen &latex;-Editoren und &okular;

source: Inverse search is a very useful feature when you are writing a &latex; document yourself. If everything is set up properly, you can click into &okular;'s window with the <mousebutton>left</mousebutton> mouse button while pressing &Shift;. After that editor loads the &latex; source file and jumps to the proper paragraph.
de: Die Rückwärtssuche ist beim Schreiben eines &latex;-Dokuments sehr hilfreich. Wenn alles richtig eingestellt ist, kann sie in &okular; durch Klicken mit der &LMB; und der &Shift;-Taste ausgeführt werden. Dann lädt der Editor lädt die &latex;-Quelldatei und springt zur entsprechenden Stelle.

source: Inverse search cannot work unless:
de: Die folgenden Voraussetzungen sind für die Rückwärtssuche notwendig:

source: The source file has been compiled successfully.
de: Die Quelldatei wurde erfolgreich kompiliert.

source: &okular; knows which editor you would like to use.
de: Der Editor, den Sie verwenden möchten, muss in &okular; eingestellt werden.

source: The Browse Tool has to be enabled, which you can select by choosing <menuchoice><guimenu>Tools</guimenu><guimenuitem>Browse Tool </guimenuitem></menuchoice>.
de: Die inverse Suche funktioniert nur im Navigationsmodus, den Sie im Menü <menuchoice><guimenu>Extras</guimenu><guimenuitem> Navigation</guimenuitem></menuchoice> einschalten können.

source: With this feature of &okular;, a left mouse click while pressing &Shift; in the &DVI; or &PDF; document will result in editor opening the corresponding &latex; document and attempt to go to the corresponding line. Remember to tell &okular; to use proper editor, in &okular;'s menu item <menuchoice><guimenu>Settings</guimenu><guimenuitem>Configure Okular...</guimenuitem></menuchoice> (on the page <guimenuitem>Editor</guimenuitem>).
de: Mit dieser Funktion in &okular; wird mit einem Klick der &LMBn; und dem Gedrückthalten der &Shift;-Taste im &DVI;- oder &PDF;-Dokument das entsprechende &latex;-Dokument im Editor geöffnet und zur entsprechenden Zeile gesprungen. Hierzu muss der Editor in &okular; als Texteditor festgelegt werden (<menuchoice><guimenu>Einstellungen</guimenu><guimenuitem>Okular einrichten ...</guimenuitem><guilabel>Editor</guilabel></menuchoice>)
