Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/kde-runtime/drkonqi.po
Languages: de

# @info
source: Report saved to <filename>%1</filename>.
de: Der Fehlerbericht wurde in <filename>%1</filename> gespeichert.

# @info
source: Could not create a file in which to save the report.
de: Die Datei zum Speichern des Fehlerberichts lässt sich nicht erstellen.

# @title:window
source: Select Filename
de: Dateinamen auswählen

# @info
source: Cannot open file <filename>%1</filename> for writing.
de: Datei <filename>%1</filename> lässt sich nicht zum Schreiben öffnen.

# @title:tab general information
source: &General
de: All&gemein

# @title:tab
source: &Developer Information
de: &Entwickler-Informationen

# @info
source: <para>We are sorry, <application>%1</application> closed unexpectedly.</para>
de: <para>Es tut uns sehr leid; das Programm <application>%1</application> wurde unerwartet beendet.</para>

# @info
source: <para>As the Crash Handler itself has failed, the automatic reporting process is disabled to reduce the risks of failing again.<nl /><nl />Please, <link url='%1'>manually report</link> this error to the KDE bug tracking system. Do not forget to include the backtrace from the <interface>Developer Information</interface> tab.</para>
de: <para>Der Assistent zum Berichten von Fehlern ist selbst abgestürzt. Zum Ausschluss weiterer Abstürze ist das automatische Fehlberichten deaktiviert.<nl /><nl />Bitte Erstellen Sie einen <link url='%1'>manuellen Fehlerbericht</link> für das Produkt „drkonqi“ im KDE-Fehlerdatenbank. Bitte vergessen Sie dabei nicht die Übermittlung der Rückverfolgungsdaten aus der Karteikarte für <interface>Entwickler</interface>.</para>

# @info
source: <para>The reporting assistant is disabled because the crash handler dialog was started in safe mode.<nl />You can manually report this bug to %1 (including the backtrace from the <interface>Developer Information</interface> tab.)</para>
de: <para>Der Assistent zum Berichten von Fehlern ist deaktiviert, weil der Dialog zur Fehlerbehandlung im abgesicherten Modus gestartet wurde.<nl />Sie können den Fehler aber manuell an %1 berichten. Übermitteln Sie bitte auch die Daten zur Rückverfolgung aus der Karteikarte für <interface>Entwickler</interface>.</para>

# @info
source: <para>You can help us improve KDE Software by reporting this error.<nl /><link url='%1'>Learn more about bug reporting.</link></para><para><note>It is safe to close this dialog if you do not want to report this bug.</note></para>
de: <para>Sie können uns behilflich sein, KDE-Software zu verbessern, indem Sie diesen Fehler melden.<nl /><link url='%1'>Mehr über Fehlerberichte</link></para><para><note>Falls Sie diesen Fehler nicht melden möchten, können Sie dieses Fenster ohne weiteres schließen.</note></para>

# @info
source: <para>You cannot report this error, because <application>%1</application> does not provide a bug reporting address.</para>
de: <para>Sie können diesen Fehler nicht melden, da die Anwendung <application>%1</application> keine Adresse zum Melden von Fehlern angibt.</para>

# @info Note the time information is divided into date and time parts
source: <para>Executable: <application>%1</application> PID: <numid>%2</numid> Signal: %3 (%4) Time: %5 %6</para>
de: <para>Ausführbare Datei: <application>%1</application> PID: <numid>%2</numid> Signal: %3 (%4) Datum: %5 %6</para>

# @action:button
source: Report &Bug
de: Probleme oder Wünsche berichten

# @info:tooltip
source: Starts the bug report assistant.
de: Startet den Assistenten zum Berichten von Fehlern.

source: &Debug
de: Fehlersuche

# @info:tooltip
source: Starts a program to debug the crashed application.
de: Startet ein Programm zur Fehlersuche in der abgestürzten Anwendung.

# @action:button
source: &Restart Application
de: Anwendung neu starten

# @info:tooltip
source: Use this button to restart the crashed application.
de: Mit diesem Knopf können Sie die abgestürzte Anwendung neu starten.

# @info:tooltip
source: Close this dialog (you will lose the crash information.)
de: Dieses Fenster schließen (Sie verlieren die Informationen zu dem Absturz)

# @action:inmenu 1 is the debugger name
source: Debug in <application>%1</application>
de: Fehlersuche in <application>%1</application>

source: Failed to retrieve the config data.
de: Die Konfigurationsdaten können nicht geholt werden.

source: The KDE Crash Handler gives the user feedback if a program has crashed.
de: Die KDE-Absturzbehandlung gibt dem Benutzer eine Rückmeldung, wenn ein Programm abgestürzt ist.

source: The KDE Crash Handler
de: Die KDE-Absturzbehandlung

source: (C) 2000-2009, The DrKonqi Authors
de: © 2000–2009, die DrKonqi-Autoren

# @info:shell
source: The signal number that was caught
de: Die empfangene Signalnummer

# @info:shell
source: Name of the program
de: Name des Programms

# @info:shell
source: Path to the executable
de: Pfad zur ausführbaren Datei

# @info:shell
source: The version of the program
de: Programmversion

# @info:shell
source: The bug address to use
de: Zu benutzende Adresse für Fehlerberichte

# @info:shell
source: Translated name of the program
de: Übersetzter Programmname

# @info:shell
source: The PID of the program
de: Die PID des Programms

# @info:shell
source: Startup ID of the program
de: ID-Kennung des Programms

# @info:shell
source: The program was started by kdeinit
de: Dieses Programm wurde von kdeinit gestartet

# @info:shell
source: Disable arbitrary disk access
de: Willkürlichen Festplattenzugriff deaktivieren

# @info:shell
source: The program has already been restarted
de: Das Programm wurde bereits neu gestartet

# @info:shell
source: Keep the program running and generate the backtrace at startup
de: Das Programm weiterhin ausführen und die Rückverfolgung beim Aufrufen erstellen

# @info:shell
source: The thread id of the failing thread
de: Die Nummer des abgestürzten Threads.

source: the KDE Bug Tracking System
de: Die KDE-Fehlerdatenbank

# @title:window
source: Crash Reporting Assistant
de: Assistent zum Berichten von Fehlern

# @title
source: Welcome to the Reporting Assistant
de: Willkommen beim Assistenten zum Berichten von Fehlern

# @title
source: Fetching the Backtrace (Automatic Crash Information)
de: Die Rückverfolgung wird abgerufen (Automatische Absturzinformationen)

# @title
source: Results of the Analyzed Crash Details
de: Ergebnisse der analysierten Absturzinformationen

# @title
source: Login into %1
de: Anmeldung bei %1

# @title
source: Look for Possible Duplicate Reports
de: Nach möglichen doppelten Fehlerberichten suchen

# @title
source: Enter the Details about the Crash
de: Informationen zum Absturz

# @title
source: Preview the Report
de: Berichtsvorschau

# @action:button
source: Close the assistant
de: Assistenten schließen

# @action:button
source: Cancel
de: Abbrechen

# @action:button
source: Save information and close
de: Informationen speichern und schließen

# @info
source: Do you really want to close the bug reporting assistant? <note>The crash information is still valid, so you can save the report before closing if you want.</note>
de: Möchten Sie diesen Assistenten wirklich beenden? <note>Die Informationen zum Absturz sind weiterhin gültig, Sie können die Daten speichern, bevor Sie den Assistenten schließen.</note>

# @title:window
source: Close the Assistant
de: Assistenten schließen

# @info
source: Do you really want to close the bug reporting assistant?
de: Möchten Sie diesen Assistenten wirklich beenden?

# @info
source: This crash information is not useful enough, do you want to try to improve it? You will need to install some debugging packages.
de: Die Informationen zum Absturz enthalten nicht genug nützliche Daten, möchten Sie Ihren Bericht verbessern? Dazu müssen Sie einige Debug-Pakete installieren.

# @title:window
source: Crash Information is not useful enough
de: Absturz-Informationen unzureichend

source: What I was doing when the application "%1" crashed
de: Was ich tat, als das Programm „%1“ abstürzte

# @label examples about information the user can provide
source: Examples: %1
de: Beispiele: %1

# @action:button
source: &Show Contents of the Report
de: &Inhalt des Fehlerberichts anzeigen

# @info:tooltip
source: Use this button to show the generated report information about this crash.
de: Klicken Sie auf diesen Knopf, um den erzeugten Fehlerbericht zu diesem Absturz einzusehen.

# @info
source: The automatically generated crash information is useful.
de: Die automatisch erzeugten Absturz-Informationen sind ausreichend nützlich.

# @info
source: The automatically generated crash information lacks some details but may be still be useful.
de: Die automatisch erzeugten Absturz-Informationen sind zwar nicht vollständig, könnten aber dennoch nützlich sein.

# @info
source: The automatically generated crash information lacks important details and it is probably not helpful.
de: Die automatisch erzeugten Absturz-Informationen sind unvollständig und es fehlen wichtige Details – sie sind vermutlich nicht nützlich.

# @info
source: The crash information was not generated because it was not needed.
de: Die Absturzinformationen werden nicht erzeugt, weil sie nicht benötigt werden.

# @info
source: The automatically generated crash information does not contain enough information to be helpful.
de: Die automatisch erzeugten Absturz-Informationen sind zu unvollständig, um nützlich zu sein.

# @info
source: <note>You can improve it by installing debugging packages and reloading the crash on the Crash Information page. You can get help with the Bug Reporting Guide by clicking on the <interface>Help</interface> button.</note>
de: <note>Sie können die Informationen verbessern, indem Sie Debug-Software-Pakete installieren und den Absturz neu laden. Hilfe zu diesem Assistenten erhalten Sie über den Knopf <interface>Hilfe</interface>.</note>

# @info
source: The information you can provide could be considered helpful.
de: Die von Ihnen beigesteuerten Informationen werden als hilfreich eingestuft.

# @info
source: The information you can provide is not considered helpful enough in this case.
de: Die von Ihnen beigesteuerten Informationen werden in diesem Fall als nicht ausreichend hilfreich eingestuft.

# @info
source: Your problem has already been reported as bug <numid>%1</numid>.
de: Ihr Problem wurde bereits als Fehler <numid>%1</numid> berichtet.

# @info
source: This report is considered helpful.
de: Dieser Bericht wird als hilfreich eingestuft.

# @info
source: This application's bugs are reported to the KDE bug tracking system: click <interface>Next</interface> to start the reporting process. You can manually report at <link>%1</link>
de: Fehler zu diesem Programm werden an die KDE-Fehlerdatenbank übermittelt: Klicken Sie auf <interface>Weiter</interface>, um fortzufahren. Sie können Fehler auch ohne diesen Assistenten berichten; besuchen Sie dazu die Adresse <link>%1</link>.

# @info
source: This application is not supported in the KDE bug tracking system. Click <interface>Finish</interface> to report this bug to the application maintainer. Also, you can manually report at <link>%1</link>.
de: Dieses Programm wird nicht von der KDE-Fehlerdatenbank unterstützt. Klicken Sie bitte auf <interface>Fertigstellen</interface>, um einen Fehlerbericht direkt an den Betreuer des Programms zu übermitteln. Sie können auch einen Bericht von Hand verfassen, indem Sie die Webseite <link>%1</link> besuchen.

# @info
source: This report does not contain enough information for the developers, so the automated bug reporting process is not enabled for this crash.
de: Dieser Fehlerbericht enthält ungenügend Informationen für die Entwickler, daher ist die automatische Berichterstattung für diesen Absturz deaktiviert.

# @info
source: If you wish, you can go back and change your answers.
de: Auf Wunsch können Sie auch zurückgehen und Ihre Antworten überarbeiten.

# @info
source: You can manually report this bug at <link>%1</link>. Click <interface>Finish</interface> to close the assistant.
de: Sie können manuell einen Fehlerbericht verfassen; besuchen Sie dazu die Adresse <link>%1</link>. Klicken Sie auf <interface>Fertigstellen</interface>, um diesen Assistenten zu beenden.

# @info
source: You can manually report this bug to its maintainer at <link>%1</link>. Click <interface>Finish</interface> to close the assistant.
de: Sie können einen Bericht an den Programmbetreuer senden, indem Sie die Webseite <link>%1</link> besuchen. Klicken Sie auf <interface>Fertigstellen</interface>, um diesen Assistenten zu beenden.

# @info/plain report to url/mail address
source: Report to %1
de: An %1 berichten

# @title:window
source: Contents of the Report
de: Inhalt des Fehlerberichts

# @action:button
source: &Save to File...
de: In Datei &speichern ...

# @info:tooltip
source: Use this button to save the generated crash report information to a file. You can use this option to report the bug later.
de: Klicken Sie auf diesen Knopf, um den Fehlerbericht in eine Datei zu speichern. Auf diese Weise können Sie den Bericht später erneut öffnen und übermitteln.

# @info:status '1' is replaced with the short URL of the bugzilla
source: You need to login with your %1 account in order to proceed.
de: Um fortzufahren, müssen Sie sich mit Ihrem Zugang %1 anmelden.

# @action:button
source: Login
de: Anmelden

# @info:tooltip
source: Use this button to login to the KDE bug tracking system using the provided username and password.
de: Drücken Sie diesen Knopf, um sich mit Ihren Benutzerdaten an der KDE-Fehlerdatenbank anzumelden.

# @info/rich
source: <note>You need a user account on the <link url='%1'>KDE bug tracking system</link> in order to file a bug report, because we may need to contact you later for requesting further information. If you do not have one, you can freely <link url='%2'>create one here</link>. Please do not use disposable email accounts.</note>
de: <note>Sie benötigen einen Zugang zur <link url='%1'>KDE-Fehlerdatenbank</link>, um einen Fehler zu melden. Dies ist erforderlich, damit wir Sie später kontaktieren können, um nähere Informationen zu erfragen. Wenn Sie noch keinen Zugang haben, können Sie <link url='%2'>hier</link> einen neuen Zugang anlegen. Bitte geben Sie hierbei Ihre „richtige“ E-Mail-Adresse an.</note>

# @info:status
source: Error when trying to login: <message>%1.</message>
de: Fehler bei der Anmeldung: <message>%1</message>

# @info:status the user is logged at the bugtracker site as USERNAME
source: Logged in at the KDE bug tracking system (%1) as: %2.
de: An der KDE-Fehlerdatenbank (%1) angemeldet als: %2.

source: Failed to communicate with kded. Make sure it is running.
de: Die Kommunikation mit kded ist fehlgeschlagen. Stellen Sie sicher, dass der Dienst läuft.

source: Failed to load KCookieServer. Check your KDE installation.
de: KCookieServer kann nicht geladen werden. Überprüfen Sie Ihre KDE-Installation.

source: Failed to communicate with KCookieServer.
de: Die Kommunikation mit KCookieServer ist fehlgeschlagen.

# @info 1 is the bugzilla website url
source: Cookies are not allowed in your KDE network settings. In order to proceed, you need to allow %1 to set cookies.
de: Sie haben in Ihren KDE-Netzwerkeinstellungen das Setzen von Cookies verboten. Um fortzufahren, müssen Sie %1 erlauben, Cookies zu setzen.

# @action:button 1 is the bugzilla website url
source: Allow %1 to set cookies
de: %1 das Setzen von Cookies erlauben

# @action:button do not allow the bugzilla website to set cookies
source: No, do not allow
de: Ablehnen

# @info:status '1' is a url, '2' the username
source: Performing login at %1 as %2...
de: Anmeldung an %1 wird durchgeführt als %2 ...

# @info:status/rich
source: <b>Error: Invalid username or password</b>
de: <b>Fehler: Benutzername oder Passwort ungültig</b>

# @label:listbox KDE distribution method
source: Unspecified
de: Unbekannt (andere)

# @label:listbox KDE distribution method
source: Ubuntu (and derivatives)
de: Ubuntu (und abgeleitete)

# @label:listbox KDE distribution method
source: FreeBSD (Ports)
de: FreeBSD (Portierungen)

# the minimum required length of a text was reached
source: Minimum length reached
de: Mindestlänge ist erreicht

# the minimum required length of a text wasn't reached yet
source: Provide more information
de: Weitere Informationen sind notwendig

# @info
source: The description about the crash details does not provide enough information yet.<br /><br />
de: Die Beschreibung des Absturzes enthält noch nicht genügend Informationen.<br /><br />

# @info
source: The amount of required information is proportional to the quality of the other information like the backtrace or the reproducibility rate.<br /><br />
de: Je mehr Informationen Sie liefern können, desto nützlicher werden auch die anderen Informationen des Berichts und das Problem lässt sich besser reproduzieren.<br /><br />

# @info
source: Previously, you told DrKonqi that you could provide some contextual information. Try writing more details about your situation. (even little ones could help us.)<br /><br />
de: Zuvor haben Sie angegeben, Kontext-Informationen liefern zu können. Versuchen Sie bitte, weitere Details über die Situation anzugeben, in der das Problem auftrat. (Auch Kleinigkeiten können hilfreich sein.)<br /><br />

# @info
source: If you cannot provide more information, your report will probably waste developers' time. Can you tell us more?
de: Wenn dem Fehlerbericht nicht mehr Informationen beigefügt werden, so verschwendet er möglicherweise nur die Zeit der Entwickler. Können Sie weitere Informationen beisteuern?

source: Yes, let me add more information
de: Ja, ich möchte mehr Informationen angeben

source: No, I cannot add any other information
de: Nein, ich kann nicht mehr Informationen angeben

# @title:window
source: We need more information
de: Wie benötigen mehr Informationen

# @info:tooltip examples of good bug report titles
source: <strong>Examples of good titles:</strong><nl />"Plasma crashed after adding the Notes widget and writing on it"<nl />"Konqueror crashed when accessing the Facebook application 'X'"<nl />"Kopete suddenly closed after resuming the computer and talking to a MSN buddy"<nl />"Kate closed while editing a log file and pressing the Delete key a couple of times"
de: <strong>Beispiele für gute Titel (diese sollten auf Englisch verfasst werden!):</strong><nl />„Plasma crashed after adding the Notes widget and writing on it“<nl />„Konqueror crashed when accessing the Facebook application ‚X‘“<nl />„Kopete suddenly closed after resuming the computer and talking to a MSN buddy“<nl />„Kate closed while editing a log file and pressing the Delete key a couple of times“

# @info:tooltip help and examples of good bug descriptions
source: Describe in as much detail as possible the crash circumstances:
de: Beschreibung der möglichst genauen Umstände beim Absturz:

# @info:tooltip help and examples of good bug descriptions
source: - Detail which actions were you taking inside and outside the application an instant before the crash.
de: – Informationen zu den durchgeführten Aktionen vor dem Absturz (innerhalb und außerhalb der Anwendung).

# @info:tooltip help and examples of good bug descriptions
source: - Note if you noticed any unusual behavior in the application or in the whole environment.
de: – Anmerkungen zu festgestelltem ungewöhnlichen Verhalten der Anwendung oder des Systems.

# @info:tooltip help and examples of good bug descriptions
source: - Note any non-default configuration in the application.
de: – Anmerkungen zu geänderten Einstellungen der Anwendung.

source: Examples: %1
de: Beispiele: %1

# @action:button
source: Retry...
de: Erneut versuchen ...

# @info:tooltip
source: Use this button to retry sending the crash report if it failed before.
de: Drücken Sie diesen Knopf, um den Fehlerbericht erneut zu senden, falls ein vorheriger Versuch fehlgeschlagen ist.

# @action:button
source: Sho&w Contents of the Report
de: &Inhalt des Fehlerberichts anzeigen

# @info:status
source: Sending crash report... (please wait)
de: Fehlerbericht wird gesendet ... (bitte warten)

# @info/rich
source: Crash report sent.<nl/>URL: <link>%1</link><nl/>Thank you for being part of KDE. You can now close this window.
de: Der Fehlerbericht wurde gesendet.<nl/>URL: <link>%1</link><nl/>Vielen Dank für Ihren Beitrag zu KDE. Sie können dieses Fenster nun schließen.

# @info:status
source: Error sending the crash report: <message>%1.</message>
de: Der Fehlerbericht kann nicht gesendet werden: <message>%1.</message>

# @info/plain report to KDE bugtracker address
source: Report to %1
de: An %1 berichten

# @title:window
source: Unhandled Bugzilla Error
de: Nicht behandelter Bugzilla-Fehler

# @action:button save html to a file
source: Save to a file
de: In eine Datei speichern

# @label
source: There was an unhandled Bugzilla error: %1.<br />Below is the HTML that DrKonqi received. Try to perform the action again or save this error page to submit a bug against DrKonqi.
de: Es ist ein unbehandelter Bugzilla-Fehler aufgetreten: %1.<br />Unten sehen Sie das HTML, das DrKonqi empfangen hat. Versuchen Sie, die Operation erneut auszuführen oder speichern Sie diese Fehlerseite, um einen Fehlerbericht für DrKonqi zu schreiben.

# @item:intable custom/manaul bug report number
source: Manual
de: Manuell

# @item:intable custom bug report number description
source: Manually enter a bug report ID
de: Nummer des Fehlerberichts manuell eingeben

# @info:tooltip / whatsthis
source: Select this option to manually load a specific bug report
de: Ist diese Einstellung aktiviert, wird der spezifische Fehlerbericht automatisch geladen.

# @action:button
source: Search for more reports
de: Weitere Fehlerberichte suchen

# @info:tooltip
source: Use this button to search for more similar bug reports on an earlier date.
de: Drücken Sie diesen Knopf, um nach weiteren ähnlichen Berichten zu einem früheren Datum zu suchen.

# @action:button
source: Retry search
de: Erneut suchen

# @info:tooltip
source: Use this button to retry the search that previously failed.
de: Drücken Sie diesen Knopf, um eine fehlgeschlagene Suche erneut zu versuchen.

# @action:button
source: Open selected report
de: Ausgewählten Bericht öffnen

# @info:tooltip
source: Use this button to view the information of the selected bug report.
de: Drücken Sie diesen Knopf, um Details zu dem ausgewählten Fehlerbericht zu sehen.

# @action:button
source: Stop searching
de: Suche abbrechen

# @info:tooltip
source: Use this button to stop the current search.
de: Drücken Sie diesen Knopf, um die aktuelle Suche abzubrechen.

# @action:button remove the selected item from a list
source: Remove
de: Entfernen

# @info:tooltip
source: Use this button to remove a selected possible duplicate
de: Mit diesem Knopf können Sie ein ausgewähltes mögliches Duplikat entfernen.

source: There are no real duplicates
de: Es gibt keine echten Duplikate

source: Press this button to declare that, in your opinion and according to your experience, the reports found as similar do not match the crash you have experienced, and you believe it is unlikely that a better match would be found after further review.
de: Drücken Sie diesen Knopf um zu bestätigen, dass Ihrer Meinung nach und Ihren Erfahrungen zufolge, die gefundenen, ähnlichen Berichte nicht dem von Ihnen entdeckten Fehler entsprechen und Sie sich sicher sind, dass nach weiterer Überprüfung kein passenderer Bericht gefunden werden kann.

source: Let me check more reports
de: Weitere Fehlerberichte suchen

source: Press this button if you would rather review more reports in order to find a match for the crash you have experienced.
de: Drücken Sie diesen Knopf, wenn Sie zuvor lieber weitere Berichte überprüfen möchten, um einen passenden Bericht für den vorgefallenen Absturz zu finden.
