Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/kde-runtime/drkonqi.po
Languages: de

# @info
source: You have not selected any possible duplicates, or a report to which to attach your crash information. Have you read all the reports, and can you confirm that there are no real duplicates?
de: Sie haben weder Duplikate ausgewählt, noch einen Bericht, an den Sie die Absturz-Informationen anhängen möchten. Haben Sie alle Fehlerberichte gelesen und sind sich sicher, dass es sich tatsächlich nicht um Duplikate handelt?

# @title:window
source: No selected possible duplicates
de: Kein mögliches Duplikat ausgewählt

# @info:status
source: Searching for duplicates (from %1 to %2)...
de: Es wird nach Duplikaten gesucht (von %1 bis %2) ...

# @info:status
source: Search stopped.
de: Suche abgebrochen.

# @info:status
source: Search stopped. Showing results from %1 to %2
de: Suche abgebrochen. Ergebnisse von %1 bis %2 werden angezeigt

# @info:status
source: Showing results from %1 to %2
de: Ergebnisse von %1 bis %2 werden angezeigt.

# @info/plain bug status
source: [Open]
de: [Offen]

# @info/plain bug resolution
source: [Fixed]
de: [Behoben]

# @info/plain bug resolution
source: [Non-reproducible]
de: [Nicht nachvollziehbar]

# @info/plain bug resolution
source: [Duplicate report]
de: [Doppelter Bericht]

# @info/plain bug resolution
source: [Invalid]
de: [Ungültig]

# @info/plain bug resolution
source: [External problem]
de: [Externes Problem]

# @info/plain bug status
source: [Incomplete]
de: [Unvollständig]

# @info:status
source: Search Finished. No reports found.
de: Die Suche ist beendet. Es wurden keine Fehlerberichte gefunden.

# @label
source: Your crash is a <strong>duplicate</strong> and has already been reported as <a href="%1">Bug %1</a>.
de: Ihr Absturz ist ein <strong>Duplikat</strong> und wurde bereits als <a href="%1">Fehler %1</a> berichtet.

# @label
source: Your crash has already been reported as <a href="%1">Bug %1</a>, which is a <strong>duplicate</strong> of <a href="%2">Bug %2</a>
de: Ihr Absturz wurde bereits als <a href="%1">Fehler %1</a> berichtet, der ein <strong>Duplikat</strong> von <a href="%2">Fehler %2</a> ist.

# @label
source: Only <strong><a href="%1">attach</a></strong> if you can add needed information to the bug report.
de: Nur <strong><a href="%1">anhängen</a></strong>, wenn Sie zum Fehlerbericht benötigte Informationen beitragen können.

# @label
source: Your crash has already been reported as <a href="%1">Bug %1</a> which has been <strong>closed</strong>.
de: Ihr Absturz wurde bereits als <a href="%1">Fehler %1</a> berichtet, der bereits <strong>geschlossen</strong> wurde.

# @label
source: Your crash has already been reported as <a href="%1">Bug %1</a>, which is a duplicate of the <strong>closed</strong> <a href="%2">Bug %2</a>.
de: Ihr Absturz ist bereits als <a href="%1">Fehler %1</a> berichtet, der ein Duplikat des <strong>geschlossenen</strong> <a href="%2">Fehlers %2</a> ist.

# @info:status
source: Error fetching the bug report list
de: Fehler beim Einholen der Fehlerbericht-Liste

# @info/rich
source: Error fetching the bug report list<nl/><message>%1.</message><nl/>Please wait some time and try again.
de: Fehler beim Einholen der Fehlerbericht-Liste<nl/><message>%1</message><nl/>Bitte warten Sie einen Augenblick und versuchen Sie es dann erneut.

# @title:window
source: Enter a custom bug report number
de: Geben Sie eine eigene Fehlernummer ein

# @label
source: Enter the number of the bug report you want to check
de: Geben Sie die Nummer des Fehlerberichtes ein, den Sie überprüfen möchten

# @label
source: The report is going to be <strong>attached</strong> to bug <numid>%1</numid>. <a href="#">Cancel</a>
de: Der Bericht wird an den Fehler mit der Nummer <numid>%1</numid> <strong>angehängt</strong>. <a href="#">Abbrechen</a>

# @title:window
source: Bug Description
de: Fehlerbeschreibung

# @info:tooltip
source: Use this button to retry loading the bug report.
de: Drücken Sie diesen Knopf, um das Laden des Fehlerberichts noch einmal zu versuchen.

# @action:button
source: Suggest this crash is related
de: Mit Bericht in Verbindung bringen

# @info:tooltip
source: Use this button to suggest that the crash you experienced is related to this bug report
de: Drücken Sie diesen Knopf, um den Absturz mit diesen Fehlerbericht in Verbindung zu bringen.

# @info
source: <link url='%1'>Report's webpage</link>
de: <link url='%1'>Webseite des Berichts</link>

# @info:status
source: Loading information about bug <numid>%1</numid> from %2....
de: Informationen zum Fehlerbericht <numid>%1</numid> von %2 werden geladen ...

# @info/plain
source: Backtrace of the crash I experienced:
de: Rückverfolgung des Absturzes:

# @action:button let the user to choose to read the main report
source: Yes, read the main report
de: Ja, den Hauptbericht lesen

# @action:button let the user choose to read the original report
source: No, let me read the report I selected
de: Nein, den von mir gewählten Bericht lesen

# @info
source: The report you selected (bug <numid>%1</numid>) is already marked as duplicate of bug <numid>%2</numid>. Do you want to read that report instead? (recommended)
de: Der von Ihnen gewählte Bericht (Fehler <numid>%1</numid>) ist bereits als Duplikat von Fehler <numid>%2</numid> markiert. Möchten Sie diesen stattdessen lesen? (empfohlen)

# @title:window
source: Nested duplicate detected
de: Verschachtelte Duplikate gefunden

# comment $number to use as subtitle
source: <h4>Comment %1:</h4>
de: <h4>Kommentar %1:</h4>

# @info bug status
source: Opened (Unconfirmed)
de: Geöffnet (Unbestätigt)

# @info bug status
source: Opened (Unfixed)
de: Geöffnet (Nicht behoben)

# @info bug resolution, fixed in version
source: Fixed in version "%1"
de: Behoben in Version „%1“

# @info bug resolution, fixed by kde devs in version
source: the bug was fixed by KDE developers in version "%1"
de: Der Fehler wurde von KDE-Entwicklern in Version „%1“ behoben

# @info bug resolution
source: Fixed
de: Bereinigt

# @info bug resolution
source: the bug was fixed by KDE developers
de: Der Fehler wurde von KDE-Entwicklern behoben

# @info bug resolution
source: Non-reproducible
de: Nicht nachvollziehbar

# @info bug resolution
source: Duplicate report (Already reported before)
de: Doppelter Bericht (Bereits zuvor berichtet)

# @info bug resolution
source: Not a valid report/crash
de: Kein gültiger Bericht/Absturz

# @info bug resolution
source: Not caused by a problem in the KDE's Applications or libraries
de: Nicht verursacht durch ein Problem in KDE-Anwendungen oder -Bibliotheken.

# @info bug resolution
source: the bug is caused by a problem in an external application or library, or by a distribution or packaging issue
de: Der Fehler wird durch ein Problem in einer externen Anwendung oder Bibliothek oder durch fehlerhafte Paketierung einer Distribution verursacht.

# @info bug status, %1 is the resolution
source: Closed (%1)
de: Geschlossen (%1)

# @info bug status
source: Temporarily closed, because of a lack of information
de: Aufgrund fehlender Informationen vorübergehend geschlossen

source: <p><note>The bug report's title is often written by its reporter and may not reflect the bug's nature, root cause or other visible symptoms you could use to compare to your crash. Please read the complete report and all the comments below.</note></p>
de: <p><note>Die Zusammenfassungen der Fehlerberichte sind in den meisten Fällen von den Berichterstattern verfasst und stellen möglicherweise nicht die Eigenheiten, Ursache oder andere sichtbare Ungereimtheiten für den direkten Vergleich der Abstürze dar. Bitte lesen Sie deshalb den vollständigen Bericht und alle dazugehörigen Kommentare.</note></p>

source: <p><note>This bug report has %1 duplicate report. That means this is probably a <strong>common crash</strong>. <i>Please consider only adding a comment or a note if you can provide new valuable information which was not already mentioned.</i></note></p>
de: <p><note>Dieser Fehlerbericht hat %1 Duplikat. Das bedeutet, dass es sich hierbei um einen <strong>allgemeinen Absturz</strong> handeln könnte. <i>Kommentare oder Anmerkungen sollten nur bei neuen verwertbaren Informationen hinzugefügt werden.</i></note></p>

source: <p><note>This bug report is not about a crash or about any other critical bug.</note></p>
de: <p><note>Dieser Fehlerbericht handelt nicht von einem Absturz oder anderen schwerwiegenden Fehler.</note></p>

# @info bug report status
source: <h4>Bug Report Status: %1</h4>
de: <h4>Status des Fehlerberichts: %1</h4>

# @info bug report product and component
source: <h4>Affected Component: %1 (%2)</h4>
de: <h4>Betroffene Komponente: %1 (%2)</h4>

# @info bug report description
source: <h3>Description of the bug</h3><p>%1</p>
de: <h3>Fehlerbeschreibung</h3><p>%1</p>

# @label:textbox bug report comments (already formatted)
source: <h2>Additional Comments</h2>%1
de: <h2>Zusätzliche Kommentare</h2>%1

# @info:status
source: Showing bug <numid>%1</numid>
de: Fehler <numid>%1</numid> wird angezeigt

# @info/rich
source: Error fetching the bug report<nl/><message>%1.</message><nl/>Please wait some time and try again.
de: Fehler beim Einholen des Fehlerberichts<nl/><message>%1</message><nl/>Bitte warten Sie einen Augenblick und versuchen Sie es dann erneut.

# @info
source: Error fetching the bug report
de: Fehler beim Einholen des Fehlerberichts

# @info:status
source: Error fetching the bug report
de: Fehler beim Einholen des Fehlerberichts

# @title:window
source: Related Bug Report
de: Verbundener Fehlerbericht

# @action:button
source: Cancel (Go back to the report)
de: Abbrechen (zum Bericht zurückkehren)

# @action:button continue with the selected option and close the dialog
source: Continue
de: Fortsetzen

source: You are going to mark your crash as related to bug <numid>%1</numid>
de: Der Absturz wird mit Fehler <numid>%1</numid> in Verbindung gebracht

# @info
source: The report is closed because %1. <i>If the crash is the same, adding further information will be useless and will consume developers' time.</i>
de: Dieser Fehlerbericht wurde als geschlossen markiert. Grund: %1. <i>Sollte es sich um denselben Absturz handeln, ist das Hinzufügen von weiteren Informationen nutzlos und nimmt die Zeit der Entwickler nur unnötig in Anspruch.</i>

# @info/plain
source: <placeholder>In detail, tell us what you were doing when the application crashed.</placeholder>
de: <placeholder>Erklären Sie bitte ganz genau, was Sie machten, als das Programm abstürzte.</placeholder>

# @label question
source: <strong>Do you remember what you were doing prior to the crash?</strong>
de: <strong>Erinnern Sie sich, was Sie getan haben, bevor der Absturz auftrat?</strong>

source: Yes
de: Ja

source: No
de: Nein

# @label question
source: <strong>Does the application crash again if you repeat the same situation?</strong>
de: <strong>Stürzt die Anwendung erneut ab, wenn Sie die gleiche Situation wiederholen?</strong>

# @info:tooltip
source: If you tried to repeat the situation, select how often the application crashes
de: Falls Sie Ihre Aktion(en) wiederholten, geben Sie bitte an, wie oft die Anwendung dabei abstürzte.

# @info:whatsthis
source: If you tried to repeat the situation, select how often the application crashes
de: Falls Sie Ihre Aktion(en) wiederholten, geben Sie bitte an, wie oft die Anwendung dabei abstürzte.

# @item:inlistbox user didn't tried to repeat the crash situation
source: I did not try again
de: Ich habe es nicht noch einmal versucht

# @item:inlistbox the crash cannot be reproduce. reproduciblity->never
source: Never
de: Nie

# @item:inlistbox the bug can be reproduced sometimes
source: Sometimes
de: Manchmal

# @item:inlistbox the bug can be reproduced every time
source: Every time
de: Immer

# @label question
source: <strong>Please select which additional information you can provide:</strong>
de: <strong>Bitte wählen Sie, welche zusätzlichen Informationen Sie geben können:</strong>

# @info:tooltip
source: Check this option if you can describe what were you doing inside the application before it crashed
de: Markieren Sie dieses Ankreuzfeld, wenn Sie Informationen über Ihre ausgeführten Aktionen innerhalb der abgestürzten Anwendung geben können (vorm Absturz).

# @info:whatsthis
source: Check this option if you can describe what were you doing inside the application before it crashed
de: Markieren Sie dieses Ankreuzfeld, wenn Sie Informationen über Ihre ausgeführten Aktionen innerhalb der abgestürzten Anwendung geben können (vorm Absturz).

# @info:tooltip
source: Check this option if you can describe any unusual behavior or appearance in the application or the whole desktop
de: Markieren Sie dieses Ankreuzfeld, wenn Sie ein ungewöhnliches Verhalten oder Erscheinungsbild der abgestürzten Anwendung bzw. gesamten Arbeitsfläche beschreiben können.

# @info:whatsthis
source: Check this option if you can describe any unusual behavior or appearance in the application or the whole desktop
de: Markieren Sie dieses Ankreuzfeld, wenn Sie ein ungewöhnliches Verhalten oder Erscheinungsbild der abgestürzten Anwendung bzw. gesamten Arbeitsfläche beschreiben können.

# @option:check kind of information the user can provide about the crash
source: Unusual desktop behavior I noticed
de: Ungewöhnliches Verhalten der Arbeitsumgebung, das ich bemerkt habe

# @info:tooltip
source: Check this option if you can provide application specific details or settings that may be related to the crash. You can check the examples (if available.)
de: Markieren Sie dieses Ankreuzfeld, wenn Sie zum Absturz führende, anwendungsspezifische Informationen oder Einstellungen geben können. Sie können ebenfalls die Beispiele markieren (falls verfügbar).

# @info:whatsthis
source: Check this option if you can provide application specific details or settings that may be related to the crash. You can check the examples (if available.)
de: Markieren Sie dieses Ankreuzfeld, wenn Sie zum Absturz führende, anwendungsspezifische Informationen oder Einstellungen geben können. Sie können ebenfalls die Beispiele markieren (falls verfügbar).

# @option:check kind of information the user can provide about the crash
source: Custom settings of the application that may be related
de: Benutzerdefinierte Einstellungen der Anwendung, die möglicherweise in Zusammenhang zu bringen sind

source: <a href="#">Examples</a>
de: <a href="#">Beispiele</a>

# @info/rich
source: See if your bug has already been reported. Double click a report in the list and compare it to yours. You can suggest that your crash is a duplicate of that report or directly attach your information to it.
de: Bitte prüfen Sie, ob dieser Fehler bereits berichtet wurde. Doppelklicken Sie auf einen Bericht in der Liste und vergleichen Sie ihn mit Ihrem. Sie können Ihren Bericht auch als mögliches Duplikat eines anderen Berichts markieren oder Ihre Informationen dem bestehenden Bericht hinzufügen.

# @title:column
source: Bug ID
de: Fehler-Kennung

# @title:column
source: Description
de: Beschreibung

# @label title of a listbox where the possible duplicate bug numbers are put in
source: Possible duplicates:
de: Liste möglicher Duplikate:

source: Show the backtrace of the crash I experienced to compare (advanced)
de: Eigene Absturz-Rückverfolgung zum Vergleichen anzeigen (erweitert)

source: This is likely to be a <strong>common crash</strong>, and a lot of different cases' details may have been provided already. <i>Proceed only if you can add new information (not already mentioned). </i>
de: Es könnte sich um einen <strong>allgemeinen Fehler</strong> handeln, für den möglicherweise bereits einige Informationen zu verschiedenen Fällen zur Verfügung stehen. <i>Setzen Sie den Fehlerbericht nur fort, wenn Sie neue Informationen bieten können.</i>

source: <strong>Do you want to proceed with the reporting process?</strong>
de: <strong>Möchten Sie den Vorgang fortsetzen?</strong>

source: No, do not file a new bug report, and cancel the assistant
de: Nein. Keinen neuen Fehlerbericht erstellen und den Assistenten beenden

source: Proceed with reporting the bug
de: Fehlerbericht fortsetzen

source: <strong>Are you sure this report matches your crash situation?</strong>
de: <strong>Sind Sie sicher, dass dieser Bericht mit Ihrem Absturz übereinstimmt?</strong>

source: Not really sure: mark as a possible duplicate
de: Nicht wirklich sicher: Als mögliches Duplikat markieren

source: Completely sure: attach my information to this report
de: Ganz sicher: Informationen an diesen Bericht anhängen

# @info/rich
source: <strong>Please provide the following information in English.</strong>
de: <strong>Bitte geben Sie die folgenden Informationen in Englisch ein.</strong>

# @label:textbox
source: <strong>Title of the bug report:</strong> (<a href="#">examples</a>)
de: <strong>Titel des Fehlerberichts:</strong> (<a href="#">Beispiele</a>)

# @label:textbox
source: <strong>Information about the crash:</strong> (<a href="#">help and examples</a>)
de: <strong>Informationen zum Absturz:</strong> (<a href="#">Hilfe und Beispiele</a>)

# @title:group
source: Distribution method:
de: Distribution:

# @option:check
source: KDE Platform is compiled from sources
de: KDE ist aus Quelltexten kompiliert

# @info/rich
source: <note>The crash and system information will be automatically added to the bug report.</note>
de: <note>Die Informationen zum Absturz und zu Ihrem System werden automatisch an den Fehlerbericht angehängt.</note>

# @label:textbox bugzilla account username
source: Username:
de: Benutzername:

# @label:textbox bugzilla account password
source: Password:
de: Passwort:

# @option:check
source: Save login information using the KDE Wallet system
de: Anmeldeinformationen im Passwortspeicher speichern

# @label
source: This is a preview of the report's contents which will be sent. <nl /> If you want to modify it go to the previous pages.
de: Sie sehen eine Vorschau des Fehlerberichts, so wie er gesendet wird.<nl /> Falls Sie Änderungen vornehmen möchten, gehen Sie bitte zurück zu den vorherigen Seiten.

# @option:check
source: Open the bug report page when clicking the Finish button
de: Nach dem Fertigstellen die Webseite des Fehlerberichts öffnen

# @option:check
source: Restart the application when clicking the Finish button
de: Nach dem Fertigstellen die Anwendung neu starten

source: Restart the application when clicking the Finish button
de: Nach dem Fertigstellen die Anwendung neu starten

# @info
source: This assistant will analyze the crash information and guide you through the bug reporting process.
de: Dieser Assistent wird den Absturz analysieren und Sie durch den Meldevorgang führen.

# @info note before starting the bug reporting process
source: <p><note>Since communication between you and the developers is required for effective debugging, to continue reporting this bug <strong>it is required for you to agree that developers may contact you.</strong></note></p><p>Feel free to close this dialog if you do not accept this.</p>
de: <p><note>Die Kommunikation zwischen Ihnen und den Entwicklern ist entscheidend für die Fehlersuche und -behebung. Um den Assistenten fortsetzen zu können, <strong>müssen Sie zustimmen, dass die Entwickler Kontakt mit Ihnen aufnehmen dürfen.</strong></note></p><p>Falls Sie dies nicht wünschen, können Sie den Assistenten an dieser Stelle selbstverständlich einfach beenden.</p>

source: Show backtrace content (advanced)
de: Inhalt der Rückverfolgung anzeigen (erweitert)
