Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/kde-runtime/drkonqi.po
Languages: de

# NAME OF TRANSLATORS
source: Your names
de: Thomas Diehl

# EMAIL OF TRANSLATORS
source: Your emails
de: thd@kde.org

# @title title of the dialog
source: About Bug Reporting - Help
de: Über Fehlerberichte – Hilfe

# @title
source: Information about bug reporting
de: Wissenswertes über das Berichten von Fehlern

# @info/rich
source: You can help us improve this software by filing a bug report.
de: Sie können uns beim Verbessern dieser Software helfen, indem Sie einen Fehlerbericht einsenden.

# @info/rich
source: <note>It is safe to close this dialog. If you do not want to, you do not have to file a bug report.</note>
de: <note>Sie können diesen Dialog auch einfach schließen, wenn Sie keinen Fehlerbericht einsenden möchten.</note>

# @info/rich
source: In order to generate a useful bug report we need some information about both the crash and your system. (You may also need to install some debug packages.)
de: Um einen nützlichen Fehlerbericht zu erhalten, benötigen wir einige Informationen über den Absturz und über Ihr System. (Möglicherweise müssen Sie auch einige Debug-Pakete installieren.)

# @title
source: Bug Reporting Assistant Guide
de: Assistent zum Einsenden von Fehlerberichten

# @info/rich
source: This assistant will guide you through the crash reporting process for the KDE bug tracking system. All the information you enter on the bug report <strong>must be written in English</strong>, if possible, as KDE is formed internationally.
de: Dieser Assistent führt Sie durch die nötigen Schritte, um einen Fehlerbericht an die KDE-Fehlerdatenbank zu senden. Bitte verfassen Sie alle <strong>Texte in englischer Sprache</strong> (sofern es Ihnen möglich ist), da KDE international entwickelt wird.

# @title
source: What do you know about the crash?
de: Was wissen Sie über den Absturz?

# @info/rich
source: In this page you need to describe how much do you know about the desktop and the application state before it crashed.
de: Auf dieser Seite müssen Sie beschreiben, wieviel Sie über den Zustand von KDE und des Programms wissen, bevor es abgestürzt ist.

# @info/rich
source: If you can, describe in as much detail as possible the crash circumstances, and what you were doing when the application crashed (this information is going to be requested later.) You can mention:
de: Beschreiben Sie die näheren Umstände des Absturzes bitte so detailliert wie möglich. Was haben Sie gerade gemacht oder versucht, als das Programm abstürzte? Sie können z. B. angeben:

# @info/rich crash situation example
source: actions you were taking inside or outside the application
de: Dinge, die Sie im oder außerhalb des Programms gemacht haben

# @info/rich crash situation example
source: documents or images that you were using and their type/format (later if you go to look at the report in the bug tracking system, you can attach a file to the report)
de: Dokumente oder Bilder die Sie gerade in Verwendung hatten sowie deren Typ/Format (Sie haben später auch noch die Möglichkeit, Ihrem Fehlerbericht eine Datei als Anlage mitzusenden)

# @info/rich crash situation example
source: widgets that you were running
de: Miniprogramme, die Sie verwendeten

# @info/rich crash situation example
source: the URL of a web site you were browsing
de: die Adresse der Webseite, die Sie gerade besuchten

# @info/rich crash situation example
source: configuration details of the application
de: Details zur Einrichtung des Programms

# @info/rich crash situation example
source: or other strange things you notice before or after the crash.
de: oder weitere Besonderheiten, die Sie kurz vor dem Absturz bemerkt haben.

# @info/rich
source: Screenshots can be very helpful sometimes. You can attach them to the bug report after it is posted to the bug tracking system.
de: Bildschirmfotos können in einigen Fällen sehr hilfreich sein. Nachdem Sie den Fehlerbericht gesendet haben, können Sie in der KDE-Fehlerdatenbank ein Bildschirmfoto hinzufügen.

# @title
source: Crash Information (backtrace)
de: Absturz-Informationen (Rückverfolgung)

# @info/rich
source: This page will generate a "backtrace" of the crash. This is information that tells the developers where the application crashed.
de: Diese Seite erstellt eine Rückverfolgung (Backtrace) des Absturzes. Diese Informationen gibt dem Entwickler einen Hinweis darauf, wo die Anwendung abgestürzt ist.

# @info/rich
source: If the crash information is not detailed enough, you may need to install some debug packages and reload it (if the <interface>Install Debug Symbols</interface> button is available you can use it to automatically install the missing information.)
de: Falls die Informationen zum Absturz nicht detailliert genug sind, müssen Sie möglicherweise Debug-Pakete installieren und die Absturz-Informationen neu laden (falls der Knopf <interface>Debug-Symbole installieren</interface> vorhanden ist, können Sie mit seiner Hilfe die fehlenden Informationen automatisch installieren).

# @info/rich
source: You can find more information about backtraces, what they mean, and how they are useful at <link>%1</link>
de: Auf <link>%1</link> finden Sie weitere Informationen über Rückverfolgungen, was sie bedeuten und worin ihr Nutzen liegt.

# @info/rich
source: Once you get a useful backtrace (or if you do not want to install the missing debugging packages) you can continue.
de: Sobald Sie eine detaillierte Rückverfolgung des Absturzes erhalten haben können Sie fortfahren.

# @title
source: Conclusions
de: Rückschlüsse

# @info/rich
source: Using the quality of the crash information gathered, and your answers on the previous page, the assistant will tell you if the crash is worth reporting or not.
de: Mit Hilfe der gesammelten Informationen zu dem Absturz und Ihren Antworten auf den vorherigen Seiten wird Ihnen der Assistent mitteilen, ob es sinnvoll ist, den Fehler zu berichten.

# @info/rich
source: If the crash is worth reporting but the application is not supported in the KDE bug tracking system, you will need to directly contact the maintainer of the application.
de: Wenn ein Fehlerbericht sinnvoll ist, das Programm aber nicht von der KDE-Fehlerdatenbank unterstützt wird, sollten Sie direkt mit dem Betreuer/Entwickler des Programms Kontakt aufnehmen.

# @info/rich
source: If the crash is listed as being not worth reporting, and you think the assistant has made a mistake, you can still manually report the bug by logging into the bug tracking system. You can also go back and change information and download debug packages.
de: Falls der Assistent den Fehler als nicht berichtenswert einstuft, Sie aber anderer Meinung sind, so können Sie den Bericht selbstverständlich dennoch einsenden. Dazu müssen Sie sich an der KDE-Fehlerdatenbank anmelden und den Fehlerbericht dort von Hand eintragen. Außerdem können Sie im Assistenten einige Seiten zurückgehen und die angegebenen Informationen verbessern oder entsprechende Debug-Pakete für Ihr System installieren, um einen aussagekräftigeren Bericht zu erhalten.

# @title
source: Login into the bug tracking system
de: An der KDE-Fehlerdatenbank anmelden

# @info/rich
source: We may need to contact you in the future to ask for further information. As we need to keep track of the bug reports, you need to have an account on the KDE bug tracking system. If you do not have one, you can create one here: <link>%1</link>
de: Möglicherweise haben wir Rückfragen und müssen Sie dazu kontaktieren. Dazu müssen Sie einen Zugang zur KDE-Fehlerdatenbank haben. Falls Sie noch keinen haben, können Sie diesen hier erhalten: <link>%1</link>

# @info/rich
source: Then, enter your username and password and press the Login button. You can use this login to directly access the KDE bug tracking system later.
de: Anschließend geben Sie bitte Ihren Benutzernamen und Ihr Passwort ein und melden sich an. Mit diesen Zugangsdaten können Sie sich später auch über die Internetseite der KDE-Fehlerdatenbank anmelden.

# @info/rich
source: The KWallet dialog may appear when pressing Login to save your password in the KWallet password system. Also, it will prompt you for the KWallet password upon loading to autocomplete the login fields if you use this assistant again.
de: Möglicherweise öffnet sich beim Anmelden der Passwortspeicher von KDE, um Ihre Zugangsdaten zur späteren Verwendung zu speichern. Falls Sie diesen Assistenten später erneut benutzen, werden Sie dann nur noch nach Ihrem Passwort für den Passwortspeicher gefragt.

# @title
source: List of possible duplicate reports
de: Liste möglicher doppelter Fehlerberichte

# @info/rich
source: This page will search the bug report system for similar crashes which are possible duplicates of your bug. If there are similar bug reports found, you can double click on them to see details. Then, read the current bug report information so you can check to see if they are similar.
de: In diesem Schritt wird in der Fehlerdatenbank nach ähnlichen Absturzberichten gesucht. Wenn ähnliche Fehlerberichte gefunden werden, können Sie darauf doppelklicken, um Details zu lesen. Bitte überprüfen Sie, ob bereits ein Fehlerbericht für diesen Absturz vorhanden ist.

# @info/rich
source: If you are very sure your bug is the same as another that is previously reported, you can set your information to be attached to the existing report.
de: Wenn Sie sich sicher sind, dass Ihr Fehler mit einem zuvor berichteten Fehler identisch ist, können Sie Ihre Informationen dem bestehenden Fehlerbericht hinzufügen.

# @info/rich
source: If you are unsure whether your report is the same, follow the main options to tentatively mark your crash as a duplicate of that report. This is usually the safest thing to do. We cannot uncombine bug reports, but we can easily merge them.
de: Falls Sie unsicher sind, ob Ihr Fehlerbericht der gleiche ist, folgen Sie bitte den Hauptoptionen, um Ihren Bericht als Duplikat zu markieren.

# @info/rich
source: If not enough possible duplicates are found, or you did not find a similar report, then you can force it to search for more bug reports (only if the date range limit is not reached.)
de: Wenn nicht genügend Duplikate oder ähnliche Berichte gefunden wurden, können Sie eine Suche nach weiteren Fehlerberichten erzwingen (sofern der Datumsbereich noch nicht überschritten ist).

# @info/rich
source: If you do not find any related reports, your crash information is not useful enough, and you really cannot give additional information about the crash context, then it is better to not file the bug report, thereby closing the assistant.
de: Wenn Sie keine ähnlichen Fehlerberichte finden und auch sonst keine näheren Angaben zum Absturz machen können, sind Ihre Absturzinformationen nicht hilfreich. In dem Fall wäre es besser, den Fehlerbericht nicht zu senden und den Assistenten an dieser Stelle abzubrechen.

# @title
source: Details of the bug report and your system
de: Details zu dem Fehlerbericht und Ihrem System

# @info/rich
source: In this case you need to write a title and description of the crash. Explain as best you can.
de: In diesem Fall sollten Sie eine Überschrift und eine Beschreibung zu dem Absturz schreiben. Beschreiben Sie bitte so gut Sie können.

# @info/rich
source: You can also specify your distribution method (GNU/Linux distribution or packaging system) or if you compiled the KDE Platform from sources.
de: Sie können auch angeben, wie Sie KDE beziehen (GNU/Linux-Distribution oder Paketsystem) oder ob Sie KDE aus den Quellen übersetzt haben.

# @info/rich
source: <note>You should <strong>write those information in English</strong>.</note>
de: <note>Bitte schreiben Sie diese <strong>Informationen auf Englisch</strong>.</note>

# @title
source: Sending the Crash Report
de: Der Fehlerbericht wird gesendet

# @info/rich
source: The last page will send the bug report to the bug tracking system and will notify you when it is done. It will then show the web address of the bug report in the KDE bug tracking system, so that you can look at the report later.
de: In diesem Schritt wird der Fehlerbericht an die KDE-Fehlerdatenbank übermittelt; Sie werden benachrichtigt, wenn dies abgeschlossen ist. Anschließend wird die Internet-Adresse des Fehlerberichts in der KDE-Fehlerdatenbank angezeigt, damit Sie Ihren Bericht auch später noch ansehen und ändern können.

# @info/rich
source: If the process fails, you can click <interface>Retry</interface> to try sending the bug report again. If the report cannot be sent because the bug tracking system has a problem, you can save it to a file to manually report later.
de: Falls der Vorgang fehlschlägt, klicken Sie bitte auf <interface>Erneut versuchen ...</interface>, um den Bericht noch einmal zu senden. Wenn der Fehlerbericht aufgrund von Serverproblemen nicht gesendet werden kann. können Sie ihn in eine Datei speichern und später manuell in die Fehlerdatenbank einstellen.

# @info/rich
source: Thank you for being part of KDE!
de: Vielen Dank für Ihren Beitrag zu KDE!

# @info/rich
source: If you are interested in helping us to keep the KDE bug tracker system clean and useful, which allows the developers to be more focused on fixing the real issues, you are welcome to <link url='http://techbase.kde.org/Contribute/Bugsquad'>join the BugSquad team</link>.
de: Möchten Sie mithelfen, das KDE-Fehlerverfolgungssystem in einem aufgeräumten und brauchbaren Zustand zu behalten, der es den Entwicklern erlaubt, sich mehr auf die tatsächliche Korrektur von Fehlern zu konzentrieren, sollten Sie beim <link url='http://techbase.kde.org/Contribute/Bugsquad'>BugSquad-Team</link> mitarbeiten.

# @info examples about information the user can provide
source: Widgets you have in your desktop and panels (both official and unofficial), desktop settings (wallpaper plugin, themes), activities, and dashboard configuration.
de: Miniprogramme auf der Arbeitsfläche und den Kontrollleisten (offizielle als auch inoffizielle), Einstellungen der Arbeitsfläche (Hintergrund-Module, Designs), Aktivitäten und Dashboard-Einstellungen.

# @info examples about information the user can provide
source: State of Desktop Effects (Compositing), kind of effects enabled, window decoration, and specific window rules and configuration.
de: Status der Arbeitsflächen-Effekte (Compositing), Art der aktivierten Effekte, Fensterdekorationen sowie besondere Fenstereinstellungen.

# @info examples about information the user can provide
source: sites you were visiting, number of opened tabs, plugins you have installed, and any other non-default setting.
de: Besuchte Webseiten, Anzahl der geöffneten Unterfenster, installierte Module und alle Nicht-Standard-Einstellungen.

# @info examples about information the user can provide
source: File view mode, grouping and sorting settings, preview settings, and directory you were browsing.
de: Dateiansichts-Modus, Einstellungen zu Gruppierung, Sortierung und Vorschaubildern sowie der Ordner, den Sie durchgesehen haben.

# @info examples about information the user can provide
source: Instant Messaging protocols you use, and plugins you have installed (official and unofficial).
de: Verwendete Instant-Messaging-Protokolle und installierte -Module (offizielle sowie inoffizielle).

# @info examples about information the user can provide
source: Mail protocols and account-types you use.
de: Verwendete Mail-Protokolle und Zugangsarten.

# @info examples about information the user can provide
source: Type of the document you were editing.
de: Art des Dokuments, das Sie bearbeitet haben.

# @info examples about information the user can provide
source: Type of media (extension and format) you were watching and/or listening to.
de: Art der Mediendatei (Dateinamenserweiterung und das Format), die Sie betrachtet oder angehört haben.

# @action:button
source: &Reload
de: &Neu laden

# @info:tooltip
source: Use this button to reload the crash information (backtrace). This is useful when you have installed the proper debug symbol packages and you want to obtain a better backtrace.
de: Mit diesem Knopf können Sie die Rückverfolgung des Absturzes neu laden (Backtrace). Dies kann nützlich sein, wenn Sie die notwendigen Software-Pakete mit Debug-Symbolen installiert haben und mehr Details in der Rückverfolgung erhalten möchten.

# @action:button
source: &Install Debug Symbols
de: Debug-Symbole &installieren

# @info:tooltip
source: Use this button to install the missing debug symbols packages.
de: Drücken Sie diesen Knopf, um die fehlenden Debug-Symbol-Pakete zu installieren.

# @info:tooltip
source: Use this button to copy the crash information (backtrace) to the clipboard.
de: Mit diesem Knopf können Sie die Detail-Informationen zum Absturz (Backtrace) in die Zwischenablage kopieren.

# @info:tooltip
source: Use this button to save the crash information (backtrace) to a file. This is useful if you want to take a look at it or to report the bug later.
de: Mit diesem Knopf können Sie die Rückverfolgungs-Informationen des Absturzes in eine Datei speichern. Dies kann nützlich sein, falls Sie sich die Daten später noch einmal ansehen, oder den Fehler erst später berichten möchten.

source: <h2>What is a "backtrace" ?</h2><p>A backtrace basically describes what was happening inside the application when it crashed, so the developers may track down where the mess started. They may look meaningless to you, but they might actually contain a wealth of useful information.<br />Backtraces are commonly used during interactive and post-mortem debugging.</p>
de: <h2>Was ist eine Rückverfolgung (backtrace)?</h2><p>Die Rückverfolgung beschreibt im Grunde die Ereignisse innerhalb der Anwendung zum Zeitpunkt des Absturzes. Möglicherweise können die Entwickler damit den Ursprung des Absturzes finden. Für den unversierten Anwender erscheinen diese oft bedeutungslos, können aber ein Reihe nützlicher Informationen enthalten.<br />Rückverfolgungen werden bei der interaktiven und analysierenden Fehlersuche verwendet.</p>

# @info:status
source: Loading...
de: Wird geladen ...

# @info:status
source: Generating backtrace... (this may take some time)
de: Rückverfolgunginformationen werden gesammelt ... (dies kann eine Weile dauern)

# @info
source: Another debugger is currently debugging the same application. The crash information could not be fetched.
de: Die Anwendung wird bereits von einem anderen Debug-Programm untersucht. Die Absturz-Details können nicht abgerufen werden.

# @info:status
source: The crash information could not be fetched.
de: Die Absturz-Details können nicht abgerufen werden.

# @info/rich
source: Another debugging process is attached to the crashed application. Therefore, the DrKonqi debugger cannot fetch the backtrace. Please close the other debugger and click <interface>Reload</interface>.
de: Ein anderes Debug-Programm ist bereits an die Anwendung gekoppelt. Daher kann DrKonqi keine Details zu dem Absturz abrufen (Backtrace). Beenden Sie bitte das andere Debug-Programm und klicken Sie anschließend auf <interface>Neu laden</interface>.

# @info
source: The generated crash information is useful
de: Die gesammelten Absturzinformationen sind nützlich

# @info
source: The generated crash information may be useful
de: Die gesammelten Absturzinformationen könnten nützlich sein

# @info
source: The generated crash information is probably not useful
de: Die gesammelten Absturzinformationen sind wahrscheinlich nutzlos

# @info
source: The generated crash information is not useful
de: Die gesammelten Absturzinformationen sind nutzlos

# @info
source: The rating of this crash information is invalid. This is a bug in DrKonqi itself.
de: Die Bewertung dieser Absturzinformationen ist ungültig. Es handelt sich dabei um einen Fehler in DrKonqi selbst.

# @info/rich
source: You can click the <interface>Install Debug Symbols</interface> button in order to automatically install the missing debugging information packages. If this method does not work: please read <link url='%1'>How to create useful crash reports</link> to learn how to get a useful backtrace; install the needed packages (<link url='%2'>list of files</link>) and click the <interface>Reload</interface> button.
de: Um fehlende Symbole zur Fehlersuche automatisch zu installieren, können Sie den Knopf <interface>Debug-Symbole installieren</interface> drücken. Falls dies nicht funktioniert, lesen Sie bitte den Hilfetext <link url='%1'>wie man nützliche Fehlerberichte erstellt</link>. Dort erfahren Sie, wie man eine gute Rückverfolgung eines Absturzes erzeugen kann. Nachdem Sie die benötigten Softwarepakete (<link url='%2'>Dateiliste</link>) installiert haben, klicken Sie bitte auf <interface>Neu laden</interface>.

# @info/rich
source: Please read <link url='%1'>How to create useful crash reports</link> to learn how to get a useful backtrace; install the needed packages (<link url='%2'>list of files</link>) and click the <interface>Reload</interface> button.
de: Bitte lesen Sie den Hilfstext <link url='%1'>wie man nützliche Fehlerberichte erstellt</link>, um zu erfahren, wie man eine nützliche Rückverfolgung eines Absturzes erzeugen kann. Nachdem Sie die nötigen Softwarepakete (<link url='%2'>Dateiliste</link>) installiert haben, klicken Sie auf bitte auf <interface>Neu laden</interface>.

# @info:status
source: The debugger has quit unexpectedly.
de: Das Debug-Programm wurde unerwartet beendet.

# @info:status
source: The crash information could not be generated.
de: Die Absturzinformationen können nicht erzeugt werden.

# @info/rich
source: You could try to regenerate the backtrace by clicking the <interface>Reload</interface> button.
de: Sie können versuchen, die Rückverfolgung neu zu erzeugen, indem Sie auf <interface>Neu laden</interface> klicken.

# @info:status
source: <strong>The debugger application is missing or could not be launched.</strong>
de: <strong>Die Debug-Anwendung fehlt oder kann nicht gestartet werden.</strong>

# @info/rich
source: <strong>You need to first install the debugger application (%1) then click the <interface>Reload</interface> button.</strong>
de: <strong>Bitte installieren Sie die Debug-Anwendung (%1) und drücken Sie anschließend auf <interface>Neu laden</interface>.</strong>

# @title:window
source: Error during the installation of debug symbols
de: Fehler beim Installieren der Debug-Symbole

source: The packages containing debug information for the following application and libraries are missing:
de: Für die folgenden Anwendungen und Bibliotheken fehlen die Pakete mit den Debug-Informationen:

# messagebox title
source: Missing debug information packages
de: Fehlende Pakete mit Debug-Informationen

# @info
source: Invalid report information (malformed data). This could mean that the bug report does not exist, or the bug tracking site is experiencing a problem.
de: Ungültige Berichtsinformationen (fehlerhafte Daten). Dies könnte bedeuten, dass der Fehlerbericht nicht vorhanden ist oder Probleme bei der Fehlerberichtsseite vorliegen.

# @info
source: Invalid bug list: corrupted data
de: Ungültige Fehlerliste: fehlerhafte Daten

# @info
source: Received unexpected error code %1 from bugzilla. Error message was: %2
de: Unerwarteter Fehlercode „%1“ von Bugzilla empfangen. Die Fehlermeldung lautet: %2

# @title:window
source: Missing debug symbols
de: Fehlende Debug-Symbole

# @info:progress
source: Requesting installation of missing debug symbols packages...
de: Die automatische Installation fehlender Debug-Symbole wird angefordert ...

# @info
source: Could not find debug symbol packages for this application.
de: Die Pakete mit den Debug-Symbolen für diese Anwendung können nicht gefunden werden.

# @info
source: An error was encountered during the installation of the debug symbol packages.
de: Bei der Installation der Debug-Symbol-Pakete ist ein Fehler aufgetreten.
