Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/kde-runtime/kcm_device_automounter.po
Languages: de

# NAME OF TRANSLATORS
source: Your names
de: Johannes Obermayr

# EMAIL OF TRANSLATORS
source: Your emails
de: johannesobermayr@gmx.de

source: Device Automounter
de: Automatische Wechselmedieneinbindung

source: Automatically mounts devices at login or when attached
de: Automatisches Einbinden der Geräte beim Anschließen oder KDE-Start.

source: (c) 2009 Trever Fischer
de: © 2009, Trever Fischer

source: When this is unchecked, no device automounting of any kind will happen, regardless of anything selected in the "Device Overrides" section.
de: Wenn diese Einstellung nicht aktiviert ist, werden keinerlei Geräte automatisch eingebunden. Dabei ist es unerheblich, ob im Abschnitt „Vorrangige Geräte-Behandlung“ besondere Einstellungen vorgenommen wurden.

source: Enable automatic mounting of removable media
de: Automatisches Einbinden von Wechselmedien aktivieren

source: When this is checked, only remembered devices will be automatically mounted. A device is 'remembered' if it has ever been mounted before. For instance, plugging in a USB media player to charge is not sufficient to 'remember' it - if the files are not accessed, it will not be automatically mounted the next time it is seen. Once they have been accessed, however, the device's contents will be automatically made available to the system.
de: Wenn diese Einstellung aktiviert ist, wird KDE nur Geräte automatisch einbinden, die auch schon zuvor einmal eingebunden waren. Ein USB-Medienspieler, der lediglich zum Laden eingebunden war, wird hier nicht berücksichtigt, da dabei auf keine Dateien zugegriffen wurde und KDE wird den Medienspieler beim nächsten Anschließen nicht automatisch einbinden. Wenn allerdings einmal auf Dateien zugegriffen wurde, wird sich KDE daran erinnern und den Inhalt des Medienspielers auch beim nächsten Mal verfügbar machen.

source: Only automatically mount removable media that has been manually mounted before
de: Nur Geräte automatisch einbinden, die schon zuvor eingebunden wurden

source: If any removable storage devices are connected to your system when you login to your desktop, their contents will automatically be made available to your system for other programs to read.
de: Wenn bei Ihrer Anmeldung an KDE bereits Wechselmedien angeschlossen sind, wird deren Inhalt automatisch für Sie verfügbar gemacht.

source: Mount all removable media at login
de: Alle Wechselmedien beim Anmelden einbinden

source: When this is checked, the contents of any storage device will automatically be made available to the system when it is plugged in or attached.
de: Wenn diese Einstellung aktiviert ist, wird der Inhalt von Wechselmedien automatisch verfügbar gemacht, sobald sie angeschlossen werden.

source: Automatically mount removable media when attached
de: Wechselmedien beim Anschluss automatisch einbinden

source: Device Overrides
de: Vorrangige Geräte-Behandlung

source: This list contains the storage devices known to the system. If "Automount on Login" is checked, the device will be automatically mounted even though "Mount all removable media at login" is unchecked. The same applies for "Automount on Attach". If "Enable automatic mounting of removable media" is unchecked, the overrides do not apply and no devices will be automatically mounted.
de: Diese Liste zeigt alle Geräte, die dem System bekannt sind. Wenn die Einstellung „Automatisches Einbinden beim Anmelden“ aktiviert ist, wird das Gerät automatisch eingebunden, selbst wenn die Einstellung „Alle Wechselmedien beim Anmelden einbinden“ nicht aktiviert ist. Das Gleiche gilt für die Einstellung „Automatisches Einbinden beim Anschluss des Gerätes“. Wenn die Einstellung „Automatisches Einbinden von Wechselmedien aktivieren“ ausgeschaltet ist, ist die vorrangige Geräte-Behandlung inaktiv und es werden keine Geräte automatisch eingebunden.

source: Clicking this button causes the selected devices to be 'forgotten'. This is only useful if "Only automatically mount removable media that has been manually mounted before" is checked. Once a device is forgotten and the system is set to only automatically mount familiar devices, the device will not be automatically mounted.
de: Durch Drücken dieses Knopfes vergisst KDE die ausgewählten Geräte. Dies ist nur nützlich, wenn Sie die Funktion „Nur Geräte automatisch einbinden, die schon zuvor eingebunden wurden“ verwenden. Wenn Sie KDE ein Gerät vergessen lassen, wird es zukünftig nicht mehr automatisch durch diese Funktion eingebunden.

source: Forget Device
de: Gerät vergessen

source: Device
de: Gerät

source: Automount on Login
de: Automatisches Einbinden beim Anmelden

source: Automount on Attach
de: Automatisches Einbinden beim Anschluss des Gerätes

source: This device will be automatically mounted at login.
de: Dieses Gerät wird automatisch bei der Anmeldung eingebunden.

source: This device will not be automatically mounted at login.
de: Dieses Gerät wird nicht automatisch bei der Anmeldung eingebunden.

source: This device will be automatically mounted when attached.
de: Dieses Gerät wird automatisch eingebunden, sobald es angeschlossen wird.

source: This device will not be automatically mounted when attached.
de: Dieses Gerät wird nicht automatisch eingebunden, sobald es angeschlossen wird.

source: Attached Devices
de: Angeschlossene Geräte

source: Disconnected Devices
de: Nicht angeschlossene Geräte
