Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/kde-runtime/kcmcomponentchooser.po
Languages: de

# NAME OF TRANSLATORS
source: Your names
de: Thomas Diehl,Thomas Reitelbach

# EMAIL OF TRANSLATORS
source: Your emails
de: thd@kde.org,tr@erdfunkstelle.de

source: <qt>Open <b>http</b> and <b>https</b> URLs</qt>
de: <qt>Adressen öffnen, die mit <b>http</b> oder <b>https</b> beginnen</qt>

source: in an application based on the contents of the URL
de: in einem Programm, das auf Inhalten der Adresse basiert

source: in the following browser:
de: mit folgendem Browser:

source: Unknown
de: Unbekannt

source: <qt>You changed the default component of your choice, do want to save that change now ?</qt>
de: <qt>Sie haben die Standardkomponente geändert. Soll die neue Einstellung gespeichert werden?</qt>

source: No description available
de: Keine Beschreibung verfügbar

source: Choose from the list below which component should be used by default for the %1 service.
de: Wählen Sie aus der Liste unten die Standardkomponente für den Dienst %1.

source: Here you can change the component program. Components are programs that handle basic tasks, like the terminal emulator, the text editor and the email client. Different KDE applications sometimes need to invoke a console emulator, send a mail or display some text. To do so consistently, these applications always call the same components. You can choose here which programs these components are.
de: Hier können Sie das Komponentenprogramm wechseln. „Komponenten“ sind Programme, die elementare Aufgaben erledigen, so etwa der Terminal-Emulator, der Texteditor oder das E-Mail-Programm. KDE-Programme müssen gelegentlich einen Terminal-Emulator aufrufen, eine E-Mail verschicken oder Text darstellen. Um die Einheitlichkeit zu wahren, verwenden die Anwendungen dieselben Standardkomponenten. Hier können Sie die Programme für diese Komponenten auswählen.

source: Default Component
de: Standard-Komponente

source: <qt> <p>This list shows the configurable component types. Click the component you want to configure.</p> <p>In this dialog you can change KDE default components. Components are programs that handle basic tasks, like the terminal emulator, the text editor and the email client. Different KDE applications sometimes need to invoke a console emulator, send a mail or display some text. To do so consistently, these applications always call the same components. Here you can select which programs these components are.</p> </qt>
de: <qt> <p>Diese Liste zeigt die einstellbaren Komponententypen an. Klicken Sie auf einen der Einträge, wenn Sie Festlegungen dazu treffen möchten.</p> <p>In diesem Dialog können Sie zu anderen KDE-Standardkomponenten wechseln. „Komponenten“ sind Programme, die elementare Aufgaben erledigen, so etwa der Terminal-Emulator, der Texteditor oder das E-Mail-Programm. Einige KDE-Programme müssen gelegentlich einen Terminal-Emulator aufrufen, eine E-Mail verschicken oder Text darstellen. Um die Einheitlichkeit zu wahren, verwenden die Anwendungen dieselben Standardkomponenten. Hier können Sie die Programme für diese Komponenten auswählen.</p> </qt>

source: Select preferred Web browser application:
de: Bevorzugten Webbrowser auswählen:

source: Select preferred email client:
de: Bevorzugtes E-Mail-Programm auswählen:

source: Select preferred terminal application:
de: Bevorzugtes Terminalprogramm auswählen:

source: The new window manager will be used when KDE is started the next time.
de: Der neue Fenstermanager wird mit dem nächsten KDE-Start verwendet.

source: Window Manager Change
de: Fenstermanager-Wechsel

source: A new window manager is running. It is still recommended to restart this KDE session to make sure all running applications adjust for this change.
de: Ein neuer Fenstermanager ist nun aktiv. Es ist ratsam, diese KDE-Sitzung neu zu starten, damit alle Anwendungen sich an die Änderung anpassen können.

source: Window Manager Replaced
de: Fenstermanager ersetzt

source: Your running window manager will be now replaced with the configured one.
de: Der laufende Fenstermanager wird nun mit dem neu eingerichteten ersetzt.

source: Config Window Manager Change
de: Einrichtung der Fenstermanager-Änderung

source: &Accept Change
de: Änderungen an&wenden

source: &Revert to Previous
de: Zur &vorherigen Einrichtung zurückkehren

source: The configured window manager is being launched. Please check it has started properly and confirm the change. The launch will be automatically reverted in 20 seconds.
de: Der eingestellte Fenstermanager wird nun gestartet. Bitte prüfen Sie, dass er ordnungsgemäß gestartet wurde und bestätigen Sie dies. Der Start wird ansonsten in 20 Sekunden automatisch rückgängig gemacht.

source: The running window manager has been reverted to the default KDE window manager KWin.
de: Der laufende Fenstermanager wurde zurückgesetzt auf die KDE-Voreinstellung „KWin“.

source: The new window manager has failed to start. The running window manager has been reverted to the default KDE window manager KWin.
de: Der neue Fenstermanager lässt sich nicht starten. Der laufende Fenstermanager wurde zurückgesetzt auf die KDE-Voreinstellung „KWin“.

source: Running the configuration tool failed
de: Die Ausführung des Einrichtungsprogrammes ist fehlgeschlagen.

source: Kmail is the standard Mail program for the KDE desktop.
de: KMail ist das Standard-E-Mail-Programm für KDE.

source: &Use KMail as preferred email client
de: &KMail als bevorzugtes E-Mail-Programm festlegen

source: Select this option if you want to use any other mail program.
de: Wählen Sie diese Einstellung, wenn Sie ein anderes E-Mail-Programm verwenden möchten.

source: Use a different &email client:
de: Anderes E-&Mail-Programm verwenden:

source: <ul> <li>%t: Recipient's address</li> <li>%s: Subject</li> <li>%c: Carbon Copy (CC)</li> <li>%b: Blind Carbon Copy (BCC)</li> <li>%B: Template body text</li> <li>%A: Attachment </li> <li>%u: Full mailto: URL </li></ul>
de: <ul> <li>%t: Empfängeradresse</li> <li>%s: Betreff</li> <li>%c: Kopie (CC)</li> <li>%b: Blindkopie (BCC)</li> <li>%B: Textvorlage</li> <li>%A: Dateianhang </li> <li>%u: Vollständige mailto:-Adresse</li></ul>

source: Press this button to select your favorite email client. Please note that the file you select has to have the executable attribute set in order to be accepted.<br/> You can also use several placeholders which will be replaced with the actual values when the email client is called:<ul> <li>%t: Recipient's address</li> <li>%s: Subject</li> <li>%c: Carbon Copy (CC)</li> <li>%b: Blind Carbon Copy (BCC)</li> <li>%B: Template body text</li> <li>%A: Attachment </li> </ul>
de: Klicken Sie auf diesen Knopf, um Ihr bevorzugtes E-Mail-Programm auszuwählen. Bitte beachten Sie, dass es sich um eine ausführbare Datei handeln muss.<br/>Sie können außerdem verschiedene Variablen verwenden, die beim Start des E-Mail-Programms mit den übergebenen Werten ausgefüllt werden:<ul> <li>%t: Empfängeradresse</li> <li>%s: Betreff</li> <li>%c: Kopie (CC)</li> <li>%b: Blindkopie (BCC)</li> <li>%B: Textvorlage</li> <li>%A: Dateianhang </li> </ul>

source: Click here to browse for the mail program file.
de: Klicken Sie hier, um nach der ausführbaren Datei des E-Mail-Programms zu suchen.

source: Activate this option if you want the selected email client to be executed in a terminal (e.g. <em>Konsole</em>).
de: Aktivieren Sie diese Einstellung, wenn Sie möchten, dass das ausgewählte E-Mail-Programm in einem Befehlsfenster (also einem Terminalprogramm wie <em>Konsole</em>) ausgeführt wird.

source: &Run in terminal
de: In &Terminal ausführen

source: Browse directories using the following file manager:
de: Ordner mit dem folgenden Dateimanager durchsehen:

source: Other: click Add... in the dialog shown here:
de: Anderer: Klicken Sie auf Hinzufügen in diesem Dialog:

source: Component Chooser
de: Komponentenauswahl

source: (c), 2002 Joseph Wenninger
de: © 2002, Joseph Wenninger

source: 1 second remaining:
de: Noch 1 Sekunde:

source: &Use Konsole as terminal application
de: K&onsole als Terminalprogramm verwenden

source: Use a different &terminal program:
de: Anderes &Terminalprogramm verwenden:

source: Press this button to select your favorite terminal client. Please note that the file you select has to have the executable attribute set in order to be accepted.<br/> Also note that some programs that utilize Terminal Emulator will not work if you add command line arguments (Example: konsole -ls).
de: Drücken Sie diesen Knopf, um Ihr bevorzugtes Terminalprogramm auszuwählen. Bitte beachten Sie, dass die ausgewählte Datei als ausführbar gekennzeichnet sein muss, um akzeptiert zu werden.<br/>Beachten Sie außerdem, dass manche Programme, die Terminalemulatoren verwenden, nicht korrekt funktionieren, wenn Sie Befehlszeilenargumente übergeben (wie z. B. konsole -ls).

source: Click here to browse for terminal program.
de: Klicken Sie hier, um nach der ausführbaren Datei des Terminalprogramms zu suchen.

source: &Use the default KDE window manager (KWin)
de: KDE-&Voreinstellung für den Fenstermanager verwenden (KWin)

source: Use a different &window manager:
de: Einen anderen &Fenstermanager verwenden:

source: Configure
de: Einrichten

source: Note: Most window managers have their own configuration and do not follow KDE settings.
de: Hinweis: Die meisten Fenstermanager haben eine eigene Einrichtung und richten sich nicht nach KDE-Einstellungen.
