Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/kde-runtime/kcmlocale.po
Languages: de

source: <p>Here you can set the text to be displayed for PM.</p>
de: <p>Hier können Sie einstellen, welches Zeichen zur Anzeige der PM-Zeit verwendet wird.</p>

source: Long date format:
de: Langformat für Datum:

source: <p>The text in this textbox will be used to format long dates. The sequences below will be replaced:</p><table><tr><td><b>YYYY</b></td><td>The year with century as a decimal number.</td></tr><tr><td><b>YY</b></td><td>The year without century as a decimal number (00-99).</td></tr><tr><td><b>MM</b></td><td>The month as a decimal number (01-12).</td></tr><tr><td><b>mM</b></td><td>The month as a decimal number (1-12).</td></tr><tr><td><b>SHORTMONTH</b></td><td>The first three characters of the month name.</td></tr><tr><td><b>MONTH</b></td><td>The full month name.</td></tr><tr><td><b>DD</b></td><td>The day of month as a decimal number (01-31).</td></tr><tr><td><b>dD</b></td><td>The day of month as a decimal number (1-31).</td></tr><tr><td><b>SHORTWEEKDAY</b></td><td>The first three characters of the weekday name.</td></tr><tr><td><b>WEEKDAY</b></td><td>The full weekday name.</td></tr><tr><td><b>ERAYEAR</b></td><td>The Era Year in local format (e.g. 2000 AD).</td></tr><tr><td><b>SHORTERANAME</b></td><td>The short Era Name.</td></tr><tr><td><b>YEARINERA</b></td><td>The Year in Era as a decimal number.</td></tr><tr><td><b>DAYOFYEAR</b></td><td>The Day of Year as a decimal number.</td></tr><tr><td><b>ISOWEEK</b></td><td>The ISO Week as a decimal number.</td></tr><tr><td><b>DAYOFISOWEEK</b></td><td>The Day of the ISO Week as a decimal number.</td></tr></table>
de: <p>Der Text in diesem Textfeld wird zur Formatierung von Datumsangaben im Langformat verwendet. Folgende Platzhalter werden ersetzt:</p><table><tr><td><b>JJJJ</b></td><td>Das Jahr mit Jahrhundert als Zahl.</td></tr><tr><td><b>JJ</b></td><td>Das Jahr ohne Jahrhundert als Zahl (00–99).</td></tr><tr><td><b>MM</b></td><td>Der Monat als Zahl (01–12).</td></tr><tr><td><b>mM</b></td><td>Der Monat als Zahl (1–12).</td></tr><tr><td><b>KURZMONAT</b></td><td>Die ersten drei Zeichen des Monatsnamens.</td></tr><tr><td><b>MONAT</b></td><td>Der volle Monatsname.</td></tr><tr><td><b>TT</b></td><td>Der Tag des Monats als Zahl (01–31).</td></tr><tr><td><b>tT</b></td><td>Der Tag des Monats als Zahl (1–31).</td></tr><tr><td><b>WOCHENTAGKURZ</b></td><td>Die ersten zwei Zeichen des Wochentages.</td></tr><tr><td><b>WOCHENTAG</b></td> <td>Der volle Name des Wochentages.</td></tr><tr><td><b>ÄRAJAHR</b></td><td>Das Jahr allgemeiner Zeitrechnung im lokalen Format (z. B. 2000 n. Chr.).</td></tr><tr><td><b>ÄRAKURZ</b></td><td>Der Kurzname der Zeitrechnung.</td></tr><tr><td><b>JAHRINÄRA</b></td><td>Das Jahr in der Zeitrechnung als Zahl.</td></tr><tr><td><b>TAGDESJAHRES</b></td><td>Der Tag im Jahr als Zahl.</td></tr><tr><td><b>ISOWOCHE</b></td><td>Die ISO-Woche als Zahl.</td></tr><tr><td><b>TAGDERISOWOCHE</b></td><td>Der Tag in der ISO-Woche als Zahl.</td></tr></table>

source: YYYY
de: JJJJ

source: YY
de: JJ

source: SHORTMONTH
de: KURZMONAT

source: MONTH
de: MONAT

source: dD
de: tT

source: DD
de: TT

source: SHORTWEEKDAY
de: WOCHENTAGKURZ

source: WEEKDAY
de: WOCHENTAG

source: ERAYEAR
de: ÄRAJAHR

source: YEARINERA
de: JAHRINÄRA

source: SHORTERANAME
de: ÄRAKURZ

source: DAYOFYEAR
de: TAGDESJAHRES

source: ISOWEEK
de: ISOWOCHE

source: DAYOFISOWEEK
de: TAGDERISOWOCHE

# some reasonable date formats for the language
source: WEEKDAY MONTH dD YYYY SHORTWEEKDAY MONTH dD YYYY
de: WOCHENTAG, tT. MONAT JJJJ tT. MONAT JJJJ tT. KURZMONAT. JJ

source: Short date format:
de: Kurzformat für Datum:

source: <p>The text in this textbox will be used to format short dates. For instance, this is used when listing files. The sequences below will be replaced:</p><table><tr><td><b>YYYY</b></td><td>The year with century as a decimal number.</td></tr><tr><td><b>YY</b></td><td>The year without century as a decimal number (00-99).</td></tr><tr><td><b>MM</b></td><td>The month as a decimal number (01-12).</td></tr><tr><td><b>mM</b></td><td>The month as a decimal number (1-12).</td></tr><tr><td><b>SHORTMONTH</b></td><td>The first three characters of the month name.</td></tr><tr><td><b>MONTH</b></td><td>The full month name.</td></tr><tr><td><b>DD</b></td><td>The day of month as a decimal number (01-31).</td></tr><tr><td><b>dD</b></td><td>The day of month as a decimal number (1-31).</td></tr><tr><td><b>SHORTWEEKDAY</b></td><td>The first three characters of the weekday name.</td></tr><tr><td><b>WEEKDAY</b></td><td>The full weekday name.</td></tr><tr><td><b>ERAYEAR</b></td><td>The Era Year in local format (e.g. 2000 AD).</td></tr><tr><td><b>SHORTERANAME</b></td><td>The short Era Name.</td></tr><tr><td><b>YEARINERA</b></td><td>The Year in Era as a decimal number.</td></tr><tr><td><b>DAYOFYEAR</b></td><td>The Day of Year as a decimal number.</td></tr><tr><td><b>ISOWEEK</b></td><td>The ISO Week as a decimal number.</td></tr><tr><td><b>DAYOFISOWEEK</b></td><td>The Day of the ISO Week as a decimal number.</td></tr></table>
de: <p>Der Text in diesem Textfeld wird zur Formatierung von Datumsangaben im Kurzformat verwendet, das beispielsweise beim Auflisten von Dateien verwendet wird. Folgende Platzhalter werden ersetzt:</p><table><tr><td><b>JJJJ</b></td><td>Das Jahr mit Jahrhundert als Zahl.</td></tr><tr><td><b>JJ</b></td><td>Das Jahr ohne Jahrhundert als Zahl (00–99).</td></tr><tr><td><b>MM</b></td><td>Der Monat als Zahl (01–12).</td></tr><tr><td><b>mM</b></td><td>Der Monat als Zahl (1–12).</td></tr><tr><td><b>KURZMONAT</b></td><td>Die ersten drei Zeichen des Monatsnamens.</td></tr><tr><td><b>MONAT</b></td><td>Der volle Monatsname.</td></tr><tr><td><b>TT</b></td><td>Der Tag des Monats als Zahl (01–31).</td></tr><tr><td><b>tT</b></td><td>Der Tag des Monats als Zahl (1–31).</td></tr><tr><td><b>WOCHENTAGKURZ</b></td><td>Die ersten zwei Zeichen des Wochentages.</td></tr><tr><td><b>WOCHENTAG</b></td> <td>Der volle Name des Wochentages.</td></tr><tr><td><b>ÄRAJAHR</b></td><td>Das Jahr allgemeiner Zeitrechnung im lokalen Format (z. B. 2000 n. Chr.).</td></tr><tr><td><b>ÄRAKURZ</b></td><td>Der Kurzname der Zeitrechnung.</td></tr><tr><td><b>JAHRINÄRA</b></td><td>Das Jahr in der Zeitrechnung als Zahl.</td></tr><tr><td><b>TAGDESJAHRES</b></td><td>Der Tag im Jahr als Zahl.</td></tr><tr><td><b>ISOWOCHE</b></td><td>Die ISO-Woche als Zahl.</td></tr><tr><td><b>TAGDERISOWOCHE</b></td><td>Der Tag in der ISO-Woche als Zahl.</td></tr></table>

# some reasonable short date formats for the language
source: YYYY-MM-DD dD.mM.YYYY DD.MM.YYYY
de: TT.MM.JJJJ tT.mM.JJJJ TT-MM-JJJJ

source: Possessive month names:
de: Monatsnamen (besitzanzeigend):

source: <p>This option determines whether possessive form of month names should be used in dates.</p>
de: <p>Diese Einstellung legt fest, ob spezielle Formen von Monatsnamen bei Datumsangaben verwendet werden sollen.</p>

source: <p>Here you can define the set of digits used to display dates and times. If digits other than Arabic are selected, they will appear only if used in the language of the application or the piece of text where the date or time is shown.</p><p>Note that the set of digits used to display numeric and monetary values have to be set separately (see the 'Numbers' or 'Money' tabs).</p>
de: <p>Hier können Sie die Art der Ziffernzeichen festlegen, die zur Darstellung von Datums- und Zeitangaben verwendet wird. Wenn nicht-arabische Ziffern ausgewählt sind, erscheinen sie ausschließlich in der Sprache der Anwendung oder des Textstücks, in dem diese dargestellt werden.</p> <p>Beachten Sie, dass die Art der Ziffernzeichen für Zahlen und Währungsangaben separat eingestellt wird (siehe die Karteikarten „Zahlen“ und „Währung“).</p>

source: Page size:
de: Seitengröße:

source: <p>Here you can define the default page size to be used in new documents.</p><p>Note that this setting has no effect on printer paper size.</p>
de: <p>Hier können Sie die Standard-Seitengröße festlegen, die in neuen Dokumenten verwendet wird.</p><p>Beachten Sie, dass diese Einstellung keinen Einfluss auf die Seitengröße beim Drucken hat.</p>

# Page size
source: C5 Envelope
de: C5-Umschlag

# Page size
source: US Common 10 Envelope
de: US Common 10 Umschlag

# Page size
source: DLE Envelope
de: DLE-Umschlag

# Page size
source: Custom
de: Benutzerdefiniert

source: Measurement system:
de: Maßsystem:

source: <p>Here you can define the measurement system to use.</p>
de: <p>Hier können Sie das zu verwendende Maßsystem einstellen.</p>

source: Metric System
de: Metrisch

source: Imperial System
de: Imperial

source: Byte size units:
de: Einheiten für Byte-Werte:

source: <p>This changes the units used by most KDE programs to display numbers counted in bytes. Traditionally "kilobytes" meant units of 1024, instead of the metric 1000, for most (but not all) byte sizes.<ul><li>To reduce confusion you can use the recently standardized IEC units which are always in multiples of 1024.</li><li>You can also select metric, which is always in units of 1000.</li><li>Selecting JEDEC restores the older-style units used in KDE 3.5 and some other operating systems.</li></ul></p>
de: <p>Hiermit werden die Einheiten zur Anzeige von Byte-Werten in den meisten KDE-Anwendungen geändert. Ursprünglich wurden Kilobytes mit 1024 (= 2^10) anstelle der metrischen 1000 (= 10^3) Bytes für die meisten (aber nicht alle) Byte-Werte angegeben.<ul><li>Zum Reduzieren dieser verwirrenden Angaben können die aktuell gültigen IEC-Einheiten (×1024) verwendet werden.</li><li>Sie können auch die metrischen Einheiten (×1000) auswählen.</li><li>Durch Auswahl von JEDEC werden die älteren Einheiten aus KDE 3.5 oder einigen anderen Betriebssystemen verwendet.</li></ul></p>

# Unit of binary measurement
source: IEC Units (KiB, MiB, etc)
de: IEC-Einheiten (KiB, MiB usw.)

# Unit of binary measurement
source: JEDEC Units (KB, MB, etc)
de: JEDEC-Einheiten (KB, MB usw.)

# Unit of binary measurement
source: Metric Units (kB, MB, etc)
de: Metrische Einheiten (kB, MB usw.)

# Example test for binary unit dialect
source: Example: 2000 bytes equals %1
de: Beispiel: 2000 Bytes entsprechen %1

source: Page size
de: Seitengröße

source: Measurement system
de: Maßsystem

source: Byte size units
de: Einheiten für Byte-Werte
