Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/kde-runtime/kcmlocale.po
Languages: de

# NAME OF TRANSLATORS
source: Your names
de: Thomas Diehl, Thomas Reitelbach

# EMAIL OF TRANSLATORS
source: Your emails
de: thd@kde.org,tr@erdfunkstelle.de

source: Country Selector
de: Länderauswahl

source: without name
de: ohne Name

# @item:inlistbox Country
source: Not set (Generic English)
de: Nicht festgelegt (Allgemeines Englisch)

source: Localization options for KDE applications
de: Sprach- und Regionaleinstellungen für KDE-Anwendungen

source: Maintainer
de: Betreuer

source: You have the language with code '%1' in your list of languages to use for translation but the localization files for it could not be found. The language has been removed from your configuration. If you want to add it again please install the localization files for it and add the language again.
de: Die Sprache mit der Abkürzung „%1“ befindet sich in der Liste der zu verwendenden Übersetzungen, jedoch können die dazugehörigen Übersetzungsdateien nicht gefunden werden. Die Übersetzung ist deshalb aus der Einrichtung entfernt worden. Zum erneuten Hinzufügen müssen zunächst die entsprechenden Übersetzungsdateien installiert und sodann die Sprache erneut hinzugefügt werden.

source: Changed language settings apply only to newly started applications. To change the language of all programs, you will have to logout first.
de: Die Änderung der Sprache betrifft nur Programme, die neu gestartet werden. Um die Sprache für alle Programme zu ändern, müssen Sie sich erst neu anmelden.

source: Applying Language Settings
de: Spracheinstellungen werden übernommen

source: <h1>Country/Region & Language</h1> <p>Here you can set your localization settings such as language, numeric formats, date and time formats, etc. Choosing a country will load a set of default formats which you can then change to your personal preferences. These personal preferences will remain set even if you change the country. The reset buttons allow you to easily see where you have personal settings and to restore those items to the country's default value.</p>
de: <h1>Land/Region & Sprache</h1> <p>Hier können Sie Lokalisierungseinstellungen vornehmen, wie z. B. Sprache, Zahlenformate, Datums- und Zeitformat usw. Beim Auswählen eines Landes werden automatisch einige Standardeinstellungen geladen, die Sie dann anpassen können. Ihre individuellen Einstellungen bleiben auch dann erhalten, wenn Sie ein anderes Land auswählen. Mit den Knöpfen zum Zurücksetzen der individuellen Einstellungen können Sie die Standardwerte des ausgewählten Landes übernehmen. Außerdem erkennen Sie an den Knöpfen, welche Einstellungen Sie abweichend vom Standard vorgenommen haben.

source: Reset item to its default value
de: Eintrag auf seinen Vorgabewert zurücksetzen

# No separator symbol
source: None
de: Keiner

# Space separator symbol
source: Single Space
de: Einzelnes Leerzeichen

source: Country
de: Land

source: Languages
de: Sprachen

source: Numbers
de: Zahlen

source: Money
de: Währung

source: Calendar
de: Kalendersystem

source: Date && Time
de: Datum && Zeit

source: Other
de: Weitere

source: Numbers:
de: Zahlen:

source: This is how positive numbers will be displayed.
de: So werden positive Zahlen dargestellt.

source: This is how negative numbers will be displayed.
de: So werden negative Zahlen dargestellt.

source: Money:
de: Währung:

source: This is how positive monetary values will be displayed.
de: So werden positive Währungseinheiten dargestellt.

source: This is how negative monetary values will be displayed.
de: So werden negative Währungseinheiten dargestellt.

source: Date:
de: Datum:

source: This is how long dates will be displayed.
de: So werden Datumswerte in Langform dargestellt.

source: Short date:
de: Datum (Kurzform):

source: This is how short dates will be displayed.
de: So werden Datumswerte in Kurzform dargestellt.

source: Time:
de: Zeit:

source: This is how time will be displayed.
de: So werden Zeitangaben dargestellt.

source: Country:
de: Land oder Region:

source: <p>This is the country where you live. The KDE Workspace will use the settings for this country or region.</p>
de: <p>Dies ist das Land in dem Sie leben. KDE wird die Einstellungen für dieses Land oder diese Region verwenden.</p>

# %1 is the system country name
source: System Country (%1)
de: Systemeinstellung (%1)

source: No Country (Default Settings)
de: Kein Land (Voreinstellung)

source: Subdivision:
de: Verwaltungseinheit:

source: <p>This is the country subdivision where you live, e.g. your state or province. The KDE Workspace will use this setting for local information services such as holidays.</p>
de: <p>Dies ist die Verwaltungseinheit, in der Sie leben, beispielsweise Ihr Bundesland oder Ihre Provinz. Diese Einstellung wird verwendet, um ortsbezogene Informationen anzuzeigen, wie z. B. Ferien.</p>

source: Available Languages:
de: Verfügbare Sprachen:

source: <p>This is the list of installed KDE Workspace language translations not currently being used. To use a language translation move it to the 'Preferred Languages' list in the order of preference. If no suitable languages are listed, then you may need to install more language packages using your usual installation method.</p>
de: <p>Dies ist eine Liste der installierten Übersetzungen für die KDE-Arbeitsumgebung, die momentan nicht verwendet werden. Verschieben Sie eine Sprache in die Liste der „Bevorzugten Sprachen“. Ordnen Sie diese in der Reihenfolge an, in der sie verwendet werden sollen. Falls keine passenden Sprachen aufgeführt sind, müssen Sie evtl. zusätzliche Sprachpakete installieren. Verwenden Sie dazu Ihre übliche Installationsmethode.</p>

source: Preferred Languages:
de: Bevorzugte Sprachen:

source: <p>This is the list of installed KDE Workspace language translations currently being used, listed in order of preference. If a translation is not available for the first language in the list, the next language will be used. If no other translations are available then US English will be used.</p>
de: <p>Dies ist die Liste der installierten Übersetzungen für die KDE-Arbeitsumgebung, die momentan verwendet werden. Sie sind in der Reihenfolge aufgeführt, in der nach Übersetzungen gesucht wird, falls für die erste Sprache in der Liste keine passende Übersetzung gefunden wird. Falls keine Übersetzung verfügbar ist, wird Amerikanisches Englisch verwendet.</p>

# %1 = default language name
source: %1 (Default)
de: %1 (Standard)

source: Install more languages
de: Weitere Sprachen installieren

source: <p>Click here to install more languages</p>
de: <p>Klicken Sie hier, um weitere Sprachen zu installieren</p>

source: Digit grouping:
de: Zifferngruppierung:

source: <p>Here you can define the digit grouping used to display numbers.</p><p>Note that the digit grouping used to display monetary values has to be set separately (see the 'Money' tab).</p>
de: <p>Hier können Sie die Zifferngruppierung festlegen, die zur Darstellung von Zahlen verwendet wird.</p><p>Beachten Sie, dass die Zifferngruppierung zur Darstellung von Währungsangaben separat eingestellt wird (siehe die Karteikarte „Währung“).</p>

source: Group separator:
de: Tausender-Unterteilung:

source: <p>Here you can define the digit group separator used to display numbers.</p><p>Note that the digit group separator used to display monetary values has to be set separately (see the 'Money' tab).</p>
de: <p>Hier können Sie das Zeichen festlegen, das zur Abtrennung bzw. Gruppierung von Ziffern (Tausender-Einheiten) verwendet wird.</p><p>Beachten Sie, dass das Zeichen für die Gruppierung von Ziffern bei Währungsangaben separat eingestellt wird (siehe die Karteikarte „Währung“).</p>

source: Decimal separator:
de: Dezimalzeichen:

source: <p>Here you can define the decimal separator used to display numbers (i.e. a dot or a comma in most countries).</p><p>Note that the decimal separator used to display monetary values has to be set separately (see the 'Money' tab).</p>
de: <p>Hier können Sie das Dezimalzeichen festlegen, das zur Darstellung von Zahlen benutzt wird (in den meisten Ländern ein Komma oder ein Punkt).</p> <p>Beachten Sie, dass das Dezimalzeichen für Währungsangaben separat eingestellt wird (siehe die Karteikarte „Währung“).</p>

source: Decimal places:
de: Dezimalstellen:

source: <p>Here you can set the number of decimal places displayed for numeric values, i.e. the number of digits <em>after</em> the decimal separator.</p><p>Note that the decimal places used to display monetary values has to be set separately (see the 'Money' tab).</p>
de: <p>Hier können Sie die Anzahl Dezimalstellen festlegen, die zur Darstellung von Währungsangaben verwendet wird. Damit sind die Stellen <em>nach</em> dem Dezimalzeichen gemeint.</p><p>Beachten Sie, dass die Dezimalstellen für Geldbeträge separat eingestellt werden (siehe die Karteikarte „Währung“).</p>

source: Positive sign:
de: Positives Vorzeichen:

source: <p>Here you can specify text used to prefix positive numbers. Most locales leave this blank.</p><p>Note that the positive sign used to display monetary values has to be set separately (see the 'Money' tab).</p>
de: <p>Hier können Sie das Zeichen festlegen, das zur Markierung von positiven Zahlen verwendet wird. In den meisten Sprachen wird dieses Feld üblicherweise leergelassen.</p><p>Beachten Sie, dass das positive Vorzeichen für Geldbeträge separat eingestellt wird (siehe die Karteikarte „Währung“).</p>

# No positive symbol
source: None
de: Keines

source: Negative sign:
de: Negatives Vorzeichen:

source: <p>Here you can specify text used to prefix negative numbers. This should not be empty, so you can distinguish positive and negative numbers. It is normally set to minus (-).</p><p>Note that the negative sign used to display monetary values has to be set separately (see the 'Money' tab).</p>
de: <p>Hier können Sie das Zeichen festlegen, das zur Markierung von negativen Zahlen verwendet wird. Dieses Feld sollte nicht leer sein, um die Unterscheidung von positiven und negativen Zahlen zu ermöglichen. Üblicherweise wird für diese Einstellung ein Minus-Zeichen (-) verwendet.</p><p>Beachten Sie, dass das negative Vorzeichen für Geldbeträge separat eingestellt wird (siehe die Karteikarte „Währung“).</p>

# No negative symbol
source: None
de: Keines

source: Digit set:
de: Ziffernzeichen:

source: <p>Here you can define the set of digits used to display numbers. If digits other than Arabic are selected, they will appear only if used in the language of the application or the piece of text where the number is shown.</p> <p>Note that the set of digits used to display monetary values has to be set separately (see the 'Money' tab).</p>
de: <p>Hier können Sie die Art der Ziffernzeichen festlegen, die zur Darstellung von Zahlen verwendet wird. Wenn nicht arabische Ziffern ausgewählt sind, erscheinen sie ausschließlich in der Sprache der Anwendung oder dem Textstück, in dem diese dargestellt werden.</p><p>Beachten Sie, dass die Art der Ziffernzeichen für Währungsangaben separat eingestellt wird (siehe die Karteikarte „Währung“).</p>

source: Currency:
de: Währung:

source: <p>Here you can choose the currency to be used when displaying monetary values, e.g. United States Dollar or Pound Sterling.</p>
de: <p>Hier können Sie die Währung zur Darstellung von Geldbeträgen auswählen, z. B. Euro oder United States Dollar.</p>

source: Currency symbol:
de: Währungssymbol:

source: <p>Here you can choose the symbol to be used when displaying monetary values, e.g. $, US$ or USD.</p>
de: <p>Hier können Sie das Symbol festlegen, das zur Darstellung von Geldbeträgen verwendet wird, z. B. € oder EUR.</p>

source: <p>Here you can define the digit grouping used to display monetary values.</p><p>Note that the digit grouping used to display other numbers has to be defined separately (see the 'Numbers' tab).</p>
de: <p>Hier können Sie die Zifferngruppierung festlegen, die zur Darstellung von Währungsangaben verwendet wird.</p><p>Beachten Sie, dass die Zifferngruppierung für sonstige Zahlen separat eingestellt wird (siehe die Karteikarte „Zahlen“).</p>

source: <p>Here you can define the group separator used to display monetary values.</p><p>Note that the thousands separator used to display other numbers has to be defined separately (see the 'Numbers' tab).</p>
de: <p>Hier können Sie das Zeichen festlegen, das zur Abtrennung bzw. Gruppierung von Tausender-Einheiten bei Währungen verwendet wird.</p> <p>Beachten Sie, dass das Zeichen für die Gruppierung von Tausendern bei sonstigen Zahlen separat eingestellt wird (siehe die Karteikarte „Zahlen“).</p>

source: <p>Here you can define the decimal separator used to display monetary values.</p><p>Note that the decimal separator used to display other numbers has to be defined separately (see the 'Numbers' tab).</p>
de: <p>Hier können Sie das Dezimalzeichen festlegen, das zur Darstellung von Währungsangaben verwendet wird.</p><p>Beachten Sie, dass das Dezimalzeichen für sonstige Zahlen separat eingestellt wird (siehe die Karteikarte „Zahlen“).</p>

source: <p>Here you can set the number of decimal places displayed for monetary values, i.e. the number of digits <em>after</em> the decimal separator.</p><p>Note that the decimal places used to display other numbers has to be defined separately (see the 'Numbers' tab).</p>
de: <p>Hier können Sie die Anzahl Dezimalstellen festlegen, die zur Darstellung von Währungsangaben verwendet wird. Damit sind die Stellen <em>nach</em> dem Dezimaltrennzeichen gemeint.</p><p>Beachten Sie, dass die Dezimalstellen für sonstige Zahlen separat eingestellt werden (siehe die Karteikarte „Zahlen“).</p>

source: Positive format:
de: Positivformat:

source: <p>Here you can set the format of positive monetary values.</p><p>Note that the positive sign used to display other numbers has to be defined separately (see the 'Numbers' tab).</p>
de: <p>Hier können Sie das Format für positive Geldbeträge festlegen.</p><p>Beachten Sie, dass das positive Vorzeichen für sonstige Zahlen separat festgelegt wird (siehe die Karteikarte „Zahlen“).</p>

source: Sign position:
de: Vorzeichenposition:

source: Parentheses Around
de: Einklammern

source: Before Quantity Money
de: Vor Betrag

source: After Quantity Money
de: Nach Betrag

source: Before Money
de: Vor Währungssymbol

source: After Money
de: Nach Währungssymbol

source: Here you can select how a positive sign will be positioned. This only affects monetary values.
de: Hier können Sie auswählen, welche Position das Positiv-Zeichen einnimmt. Davon sind ausschließlich Währungsangaben betroffen.

source: Prefix currency symbol
de: Währungssymbol voranstellen

source: If this option is checked, the currency sign will be prefixed (i.e. to the left of the value) for all positive monetary values. If not, it will be postfixed (i.e. to the right).
de: Wenn dieses Feld angekreuzt ist, dann wird allen positiven Währungsangaben das Währungssymbol vorangestellt (es steht also links). Ist es nicht angekreuzt, wird das Währungssymbol nachgestellt (steht also rechts).

source: Negative format:
de: Negativformat:

source: <p>Here you can set the format of negative monetary values.</p><p>Note that the negative sign used to display other numbers has to be defined separately (see the 'Numbers' tab).</p>
de: <p>Hier können Sie das Format für negative Geldbeträge festlegen.</p><p>Beachten Sie, dass das negative Vorzeichen für sonstige Zahlen separat festgelegt wird (siehe die Karteikarte „Zahlen“).</p>

source: Here you can select how a negative sign will be positioned. This only affects monetary values.
de: Hier können Sie auswählen, welche Position das Negativ-Zeichen einnimmt. Davon sind ausschließlich Währungsangaben betroffen.

source: If this option is checked, the currency sign will be prefixed (i.e. to the left of the value) for all negative monetary values. If not, it will be postfixed (i.e. to the right).
de: Wenn dieses Feld angekreuzt ist, dann wird allen negativen Währungsangaben das Währungssymbol vorangestellt (es steht also links). Ist es nicht angekreuzt, wird das Währungssymbol nachgestellt (steht also rechts).

source: <p>Here you can define the set of digits used to display monetary values. If digits other than Arabic are selected, they will appear only if used in the language of the application or the piece of text where the number is shown.</p><p>Note that the set of digits used to display other numbers has to be defined separately (see the 'Numbers' tab).</p>
de: <p>Hier können Sie die Art der Ziffernzeichen festlegen, die zur Darstellung von Währungsangaben verwendet wird. Wenn andere als arabische Ziffern ausgewählt sind, erscheinen sie ausschließlich in der Sprache der Anwendung oder dem Text, in dem diese dargestellt werden.</p> <p>Beachten Sie, dass die Art der Ziffernzeichen für sonstige Zahlen separat eingestellt wird (siehe die Karteikarte „Zahlen“).</p>

source: Calendar system:
de: Kalendersystem:

source: <p>Here you can set the Calendar System to use to display dates.</p>
de: <p>Hier können Sie das Kalendersystem festlegen, das zur Anzeige von Daten verwendet wird.</p>

source: Use Common Era
de: Allgemeine Zeitrechnung verwenden

source: <p>This option determines if the Common Era (CE/BCE) should be used instead of the Christian Era (AD/BC).</p>
de: <p>Diese Einstellung legt fest, ob die „Common Era“ (CE/BCE) anstelle der „Christian Era“ (AD/BC) verwendet werden soll.</p>

source: Short year window:
de: Bereich für das Jahr in Kurzform:

# label between two year inputs, i.e. 1930 to 2029
source: to
de: bis

source: <p>This option determines what year range a two digit date is interpreted as, for example with a range of 1950 to 2049 the value 10 is interpreted as 2010. This range is only applied when reading the Short Year (YY) date format.</p>
de: <p>Diese Einstellung legt fest, in welchem Bereich Daten liegen, die mit Jahreszahlen mit zwei Ziffern angegeben werden. Beispielsweise wird das Jahr 10 in einem Bereich von 1950 bis 2049 als 2010 interpretiert. Dieser Bereich gilt nur, wenn ein Jahr in Kurzform (JJ) verarbeitet wird.</p>

source: Week number system:
de: System zur Wochen-Nummerierung:

source: <p>This option determines how the Week Number will be calculated. There are four options available:</p> <ul><li><b>ISO Week</b> Use the ISO standard Week Number. This will always use Monday as the first day of the ISO week. This is the most commonly used system.</li><li><b>Full First Week</b> The first week of the year starts on the first occurrence of the <i>First day of the week</i>, and lasts for seven days. Any days before Week 1 are considered part of the last week of the previous year. This system is most commonly used in the USA.</li><li><b>Partial First Week</b> The first week starts on the first day of the year. The second week of the year starts on the first occurrence of the <i>First day of the week</i>, and lasts for seven days. The first week may not contain seven days.</li><li><b>Simple Week</b> The first week starts on the first day of the year and lasts seven days, with all new weeks starting on the same weekday as the first day of the year.</li></ul>
de: <p>Diese Einstellung bestimmt, wie die Wochennummern berechnet werden. Es gibt vier Möglichkeiten:</p> <ul><li><b>ISO-Woche</b> ISO-Standard-Wochennummern verwenden. Montag ist immer der erste Tag der ISO-Woche. Dies ist das am häufigsten verwendete System.</li><li><b>Erste ganze Woche</b> Die erste Woche des Jahres beginnt am ersten auftretenden <i>ersten Tag der Woche</i>, und dauert sieben Tage. Alle Tage vor der ersten Woche werden der letzten Woche des vorherigen Jahres zugeordnet. Dieses System wird hauptsächlich in den USA verwendet.</li><li><b>Erste Teilwoche</b> Die erste Woche beginnt am ersten Tag des Jahres. Die zweite Woche des Jahres beginnt am ersten auftretenden <i>ersten Tag der Woche</i>, und dauert sieben Tage. Die erste Woche kann weniger als sieben Tage enthalten.</li><li><b>Einfache Woche</b> Die erste Woche beginnt am ersten Tag des Jahres und dauert sieben Tage, wobei jede neue Woche am gleichen Wochentag beginnt, wie der Jahresbeginn.</li></ul>

source: ISO Week
de: ISO-Woche

source: Full First Week
de: Erste ganze Woche

source: Partial First Week
de: Erste Teilwoche

source: Simple Week
de: Einfache Woche

source: First day of week:
de: Erster Tag der Woche:

source: <p>This option determines which day will be considered as the first one of the week. This value may affect the Week Number System.</p>
de: <p>Diese Einstellung legt fest, welcher Tag als der erste der Woche angesehen wird. Dieser Wert kann das System zur Wochen-Nummerierung beeinflussen.</p>

source: First working day of week:
de: Erster Arbeitstag der Woche:

source: <p>This option determines which day will be considered as the first working day of the week.</p>
de: <p>Diese Einstellung legt fest, welcher Tag der Woche als der erste Arbeitstag angesehen wird.</p>

source: Last working day of week:
de: Letzter Arbeitstag der Woche:

source: <p>This option determines which day will be considered as the last working day of the week.</p>
de: <p>Diese Einstellung legt fest, welcher Tag der Woche als der letzte Arbeitstag angesehen wird.</p>

source: Week day for special religious observance:
de: Religiöser Feiertag in der Woche:

source: <p>This option determines which day if any will be considered as the day of the week for special religious observance.</p>
de: <p>Diese Einstellung legt fest, ob ein Tag der Woche als besonderer religiöser Feiertag angesehen wird.</p>

# Day name list, option for no special day of religious observance
source: None / None in particular
de: Keiner/Kein bestimmter

source: Time format:
de: Zeitformat:

source: <p>The text in this textbox will be used to format time strings. The sequences below will be replaced:</p><table><tr><td><b>HH</b></td><td>The hour as a decimal number using a 24-hour clock (00-23).</td></tr><tr><td><b>hH</b></td><td>The hour (24-hour clock) as a decimal number (0-23).</td></tr><tr><td><b>PH</b></td><td>The hour as a decimal number using a 12-hour clock (01-12).</td></tr><tr><td><b>pH</b></td><td>The hour (12-hour clock) as a decimal number (1-12).</td></tr><tr><td><b>MM</b></td><td>The minutes as a decimal number (00-59).</td></tr><tr><td><b>SS</b></td><td>The seconds as a decimal number (00-59).</td></tr><tr><td><b>AMPM</b></td><td>Either 'AM' or 'PM' according to the given time value. Noon is treated as 'PM' and midnight as 'AM'.</td></tr></table>
de: <p>Der Text in diesem Textfeld wird zur Formatierung von Zeitangaben verwendet. Folgende Platzhalter werden ersetzt:</p> <table> <tr> <td><b>SS</b></td> <td>Stunden als Dezimalzahl (24-Stunden-Format) (00–23).</td> </tr><tr> <td><b>sS</b></td> <td>Stunden als Dezimalzahl (24-Stunden-Format) (0–23).</td> </tr> <tr> <td><b>PS</b></td> <td>Stunden als Dezimalzahl (12-Stunden-Format) (01–12).</td> </tr> <tr> <td><b>pS</b></td> <td>Stunden als Dezimalzahl (12-Stunden-Format) (1–12).</td> </tr> <tr> <td><b>MM</b></td> <td>Minuten als Dezimalzahl (00–59).</td> </tr> <tr> <td><b>SEKSEK</b></td> <td>Sekunden als Dezimalzahl (00–59).</td> </tr> <tr> <td><b>AMPM</b></td> <td>Entweder „AM“ (ante meridiem – vormittags) oder „PM“ (post meridiem – nachmittags), je nach Wert. Mittag wird als „PM“ behandelt, Mitternacht als „AM“.</td> </tr> </table>

source: HH
de: SS

source: hH
de: sS

source: PH
de: PS

source: pH
de: pS

source: SS
de: SEKSEK

# some reasonable time formats for the language
source: HH:MM:SS pH:MM:SS AMPM
de: SS:MM:SEKSEK

source: AM symbol:
de: AM-Zeichen:

source: <p>Here you can set the text to be displayed for AM.</p>
de: <p>Hier können Sie einstellen, welches Zeichen zur Anzeige der AM-Zeit verwendet wird.</p>

source: PM symbol:
de: PM-Zeichen:
