Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/kde-runtime/kde-menu.po
Languages: de

# NAME OF TRANSLATORS
source: Your names
de: Thomas Reitelbach

# EMAIL OF TRANSLATORS
source: Your emails
de: tr@erdfunkstelle.de

source: Menu item '%1' could not be highlighted.
de: Menüeintrag „%1“ kann nicht hervorgehoben werden.

source: KDE Menu query tool. This tool can be used to find in which menu a specific application is shown. The --highlight option can be used to visually indicate to the user where in the KDE menu a specific application is located.
de: KDE-Menüsuche Mit der KDE-Menüsuche finden Sie heraus, in welchem Untermenü ein Programm angezeigt wird. Die Option „--highlight“ können Sie benutzen, um visuell darzustellen, an welcher Stelle im Menü sich das Programm tatsächlich befindet.

source: kde-menu
de: kde-menü

source: (c) 2003 Waldo Bastian
de: © 2003 Waldo Bastian

source: Author
de: Autor

source: Output data in UTF-8 instead of local encoding
de: Daten in UTF-8 statt der lokalen Kodierung ausgeben

source: Print menu-id of the menu that contains the application
de: Menü-Kennung des Menüs ausgeben, das die Anwendung enthält

source: Print menu name (caption) of the menu that contains the application
de: Menü-Name des Menüs ausgeben, das die Anwendung enthält

source: Highlight the entry in the menu
de: Eintrag im Menü hervorheben

source: Do not check if sycoca database is up to date
de: Prüfung auf aktualisierte sycoca-Datenbank überspringen

source: The id of the menu entry to locate
de: Die Kennung des Menü-Eintrags, der gefunden werden soll

source: You must specify an application-id such as 'kde4-konsole.desktop'
de: Sie müssen eine Anwendungs-Kennung wie z. B. „kde4-konsole.desktop“ angeben.

source: You must specify at least one of --print-menu-id, --print-menu-name or --highlight
de: Sie müssen wenigstens --print-menu-id, --print-menu-name oder --highlight angeben

source: No menu item '%1'.
de: Menü-Eintrag „%1“ existiert nicht.

source: Menu item '%1' not found in menu.
de: Menü-Eintrag „%1“ im Menü nicht gefunden.
