Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/kde-runtime/kio_floppy.po
Languages: de

source: Could not access drive %1. The drive is still busy. Wait until it is inactive and then try again.
de: Zugriff auf Laufwerk %1 nicht möglich. Das Laufwerk ist noch beschäftigt. Warten Sie bitte, bis es nicht mehr aktiv ist, und versuchen Sie es dann erneut.

source: Could not write to file %1. The disk in drive %2 is probably full.
de: Schreiben in Datei %1 nicht möglich. Die Diskette in Laufwerk %2 ist vermutlich voll.

source: Could not access %1. There is probably no disk in the drive %2
de: Kein Zugriff auf %1. Es ist vermutlich keine Diskette in Laufwerk in %2.

source: Could not access %1. There is probably no disk in the drive %2 or you do not have enough permissions to access the drive.
de: Kein Zugriff auf %1. Wahrscheinlich befindet sich keine Diskette in Laufwerk %2, oder Ihre Zugriffsrechte darauf sind unzureichend.

source: Could not access %1. The drive %2 is not supported.
de: Kein Zugriff auf %1. Das Laufwerk %2 wird nicht unterstützt.

source: Could not access %1. Make sure the floppy in drive %2 is a DOS-formatted floppy disk and that the permissions of the device file (e.g. /dev/fd0) are set correctly (e.g. rwxrwxrwx).
de: Kein Zugriff auf %1. Vergewissern Sie sich, dass die Diskette in Laufwerk %2 für DOS formatiert ist und dass die Berechtigungen für die Gerätedatei (z. B. /dev/fd0) korrekt eingestellt sind (z. B. rwxrwxrwx).

source: Could not access %1. The disk in drive %2 is probably not a DOS-formatted floppy disk.
de: Kein Zugriff auf %1. Die Diskette in Laufwerk %2 ist vermutlich nicht für DOS formatiert.

source: Access denied. Could not write to %1. The disk in drive %2 is probably write-protected.
de: Zugriff verweigert. Schreiben auf %1 nicht möglich. Die Diskette in Laufwerk %2 ist wahrscheinlich schreibgeschützt.

source: Could not read boot sector for %1. There is probably not any disk in drive %2.
de: Lesen des Startsektors in %1 nicht möglich. Es ist vermutlich keine Diskette in Laufwerk %2.

source: Could not start program "%1". Ensure that the mtools package is installed correctly on your system.
de: Das Programm „%1“ lässt sich nicht starten. Vergewissern Sie sich, dass das Paket „mtools“ korrekt auf Ihrem System installiert ist.
