Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/kde-runtime/kioclient.po
Languages: de

source: Command-line tool for network-transparent operations
de: Befehlszeilenprogramm für netzwerk-transparente Arbeitsvorgänge

source: kioclient openProperties 'url' # Opens a properties menu
de: kioclient openProperties „adresse“ # Öffnet ein Eigenschaften-Menü

source: kioclient exec 'url' ['mimetype'] # Tries to open the document pointed to by 'url', in the application # associated with it in KDE. You may omit 'mimetype'. # In this case the mimetype is determined # automatically. Of course URL may be the URL of a # document, or it may be a *.desktop file. # 'url' can be an executable, too.
de: kioclient exec „url“ ['mimetype'] # Versucht, das Dokument unter „url“ mit der in KDE zugewiesenen # Anwendung zu öffnen. „mimetype“ kann dabei ausgelassen werden. # In dem Fall wird der Mimetyp automatisch ermittelt. # Die Adresse kann eine Adresse für ein Dokument oder eine # *.desktop-Datei sein. # Bei „url“ kann es sich auch um eine ausführbare Datei handeln

source: kioclient move 'src' 'dest' # Moves the URL 'src' to 'dest'. # 'src' may be a list of URLs.
de: kioclient move „quelle“ „ziel“ # Verschiebt die Adresse „quelle“ nach „ziel“, # wobei „quelle“ auch eine Liste von Quellen sein kann.

source: # 'dest' may be "trash:/" to move the files # to the trash.
de: # „ziel“ kann z. B. „trash:/“ sein, um Dateien in den # Papierkorb zu werfen.

source: # the short version kioclient mv # is also available.
de: # die Kurzfassung kioclient mv # ist auch verfügbar.

source: kioclient download ['src'] # Copies the URL 'src' to a user-specified location'. # 'src' may be a list of URLs, if not present then # a URL will be requested.
de: kioclient download ['quelle'] # Kopiert die Adresse „quelle“ an einen benutzerdefinierten Ort. # „quelle“ kann auch eine Liste von Adressen sein. Ist keine # Adresse angegeben, so wird sie erfragt.

source: kioclient copy 'src' 'dest' # Copies the URL 'src' to 'dest'. # 'src' may be a list of URLs.
de: kioclient copy „quelle“ „ziel“ # Kopiert „quelle“ nach „ziel“, # wobei „quelle“ auch eine Liste von Adressen sein kann.

source: # the short version kioclient cp # is also available.
de: # die Kurzfassung kioclient cp # ist auch verfügbar.

source: kioclient cat 'url' # Writes out the contents of 'url' to stdout
de: kioclient cat „adresse“ # Gibt den Inhalt der Adresse „url“ nach stdout aus

source: kioclient ls 'url' # Lists the contents of the directory 'url' to stdout
de: kioclient ls „url“ # Gibt den Inhalt des Ordners „url“ nach stdout aus

source: kioclient remove 'url' # Removes the URL # 'url' may be a list of URLs.
de: kioclient remove „adresse“ # Löscht die Adresse # wobei „adresse“ auch eine Liste von Adressen sein kann.

source: # the short version kioclient rm # is also available.
de: # die Kurzfassung kioclient rm # ist auch verfügbar.

source: *** Examples: kioclient exec file:/root/Desktop/cdrom.desktop "Mount default" // Mounts the CDROM
de: *** Beispiele: kioclient exec file:/root/Desktop/cdrom.desktop „Mount default“ # Bindet eine CD-ROM ein.

source: kioclient exec file:/home/weis/data/test.html // Opens the file with default binding
de: kioclient exec file:/home/weis/data/test.html // Öffnet die Datei mit der Standardanwendung.

source: kioclient exec file:/home/weis/data/test.html Netscape // Opens the file with netscape
de: kioclient exec file:/home/weis/data/test.html Netscape // Öffnet die Datei mit netscape.

source: kioclient exec ftp://localhost/ // Opens new window with URL
de: kioclient exec ftp://localhost/ // Öffnet ein neues Fenster mit der Adresse.

source: kioclient exec file:/root/Desktop/emacs.desktop // Starts emacs
de: kioclient exec file:/root/Desktop/emacs.desktop // Startet emacs.

source: kioclient exec file:/root/Desktop/cdrom.desktop // Opens the CDROM's mount directory
de: kioclient exec file:/root/Desktop/cdrom.desktop # Öffnet den Systemordner der eingebundenen CD-ROM.

source: kioclient exec . // Opens the current directory. Very convenient.
de: kioclient exec . // Öffnet den aktuellen Arbeitsordner – sehr komfortabel.

source: Non-interactive use: no message boxes
de: Nicht interaktive Verwendung: es erscheinen keine Dialogfenster mit Rückfragen

source: Overwrite destination if it exists (for copy and move)
de: Ziel überschreiben, wenn es existiert (für Kopieren und Verschieben)

source: file or URL
de: Datei oder Adresse

source: Source URL or URLs
de: Quell-Adresse(n)

source: Destination URL
de: Ziel-Adresse

source: Show available commands
de: Verfügbare Befehle anzeigen

source: Command (see --commands)
de: Befehl (siehe --commands)

source: Arguments for command
de: Argumente für Befehl

# @info:shell
source: %1: Syntax error, not enough arguments
de: %1: Syntaxfehler, zu wenig Argumente

# @info:shell
source: %1: Syntax error, too many arguments
de: %1: Syntaxfehler, zu viele Argumente

source: Unable to download from an invalid URL.
de: Herunterladen von einer ungültigen Adresse ist unmöglich.

# @info:shell
source: %1: Syntax error, unknown command '%2'
de: %1: Syntaxfehler: Unbekannter Befehl „%2“
