Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/kde-runtime/knotify4.po
Languages: de

# NAME OF TRANSLATORS
source: Your names
de: Thomas Reitelbach

# EMAIL OF TRANSLATORS
source: Your emails
de: tr@erdfunkstelle.de

source: Devices notification
de: Geräte-Benachrichtigungen

source: Could not mount the following device: %1
de: Folgendes Gerät kann nicht eingebunden werden: %1.

source: Could not unmount the following device: %1 One or more files on this device are open within an application
de: Folgendes Gerät kann nicht aus der Einbindung gelöst werden: %1. Mindestens eine Datei auf dem Gerät ist noch in einer Anwendung geöffnet.

source: The following device can now be safely removed: %1
de: Folgendes Gerät kann nun sicher entfernt werden: %1.

source: Could not eject the following device: %1 One or more files on this device are open within an application
de: Folgendes Gerät kann nicht ausgeworfen werden: %1. Mindestens eine Datei auf dem Gerät ist noch in einer Anwendung geöffnet.

source: The following device can now be safely removed: %1
de: Folgendes Gerät kann nun sicher entfernt werden: %1.

source: KDE Notification Daemon
de: Dienst für KDE-Systemnachrichten

source: (C) 1997-2008, KDE Developers
de: © 1997–2008, die KDE-Entwickler

source: Current Maintainer
de: Aktueller Betreuer

source: Previous Maintainer
de: Vorheriger Betreuer

source: Sound support
de: Klang-Unterstützung

source: Porting to KDE 4
de: Portierung auf KDE 4

source: Starting Jovie Text-to-Speech Service Failed
de: Das Starten des Sprachausgabedienstes Jovie ist fehlgeschlagen
