Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/kde-runtime/plasma_scriptengine_qscript.po
Languages: de

source: Images
de: Bilder

source: Configuration Definitions
de: Einrichtungs-Definitionen

source: User Interface
de: Benutzeroberfläche

source: Data Files
de: Datendateien

source: Executable Scripts
de: Ausführbare Skripte

source: Translations
de: Übersetzungen

source: Animation scripts
de: Animationsskripte

source: Main Script File
de: Haupt-Skriptdatei

source: Unable to load script file: %1
de: Fehler beim Laden der Skriptdatei: %1

source: debug takes one argument
de: „debug“ benötigt ein Argument.

source: print() takes one argument
de: print() benötigt ein Argument.

source: listAddons takes one argument: addon type
de: „listAddons“ benötigt ein Argument: Den Typ der Erweiterung.

source: loadAddon takes two arguments: addon type and addon name to load
de: „loadAddon“ benötigt zwei Argumente: Den Typ und Namen der zu ladenden Erweiterung.

source: Failed to find Addon %1 of type %2
de: Fehler bei der Suche nach der Erweiterung %1 vom Typ %2.

source: Failed to open script file for Addon %1: %2
de: Fehler beim Laden der Skriptdatei für die Erweiterung %1: %2

source: setData() takes at least one argument
de: setData() erwartet mindestens ein Argument.

source: Could not extract the DataEngineObject
de: „DataEngineObject“ lässt sich nicht extrahieren.

source: Could not extract the DataEngine
de: „DataEngine“ lässt sich nicht extrahieren.

source: removeAllData() takes at least one argument (the source name)
de: removeAllData() erwartet mindestens ein Argument (Name der Quelle).

source: removeData() takes at least two arguments (the source and key names)
de: removeData() erwartet mindestens zwei Argumente (Name der Quelle und des Schlüssels).

source: Service requires at least one parameter: the name of the service
de: Der Dienst benötigt mindestens einen Parameter: Den Namen des Dienstes.

source: Requested service %1 was not found in the Package.
de: Der angefragte Dienst „%1“ kann im Paket nicht gefunden werden.

source: Authorization for required extension '%1' was denied.
de: Die Autorisierung für die benötigte Erweiterung „%1“ wurde abgelehnt.

source: loadui() takes one argument
de: loadui() benötigt ein Argument.

source: Unable to open '%1'
de: Fehler beim Öffnen von „%1“

source: Constructor takes at least 1 argument
de: Dem Konstruktor muss mindestens 1 Argument übergeben werden.

source: dataEngine() takes one argument
de: dataEngine() benötigt ein Argument.

source: Could not extract the Applet
de: „Applet“ lässt sich nicht extrahieren.

source: service() takes two arguments
de: service() benötigt zwei Argumente.

source: service() takes one argument
de: „service()“ benötigt zwei Argumente.

source: Error in %1 on line %2.<br><br>%3
de: Fehler in der Datei %1 in Zeile %2.<br><br>%3

source: animation() takes one argument
de: animation() benötigt ein Argument.

source: %1 is not a known animation type
de: %1 ist kein bekannter Animationstyp.

source: i18n() takes at least one argument
de: i18n() erwartet mindestens ein Argument.

source: i18nc() takes at least two arguments
de: i18nc() erwartet mindestens zwei Argumente.

source: i18np() takes at least two arguments
de: i18np() erwartet mindestens zwei Argumente.

source: i18ncp() takes at least three arguments
de: i18ncp() erwartet mindestens drei Argumente.
