Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdemultimedia/dragonplayer.po
Languages: de

source: The &dragonplayer; Handbook
de: Das Handbuch zu &dragonplayer;

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"> <firstname>Ingo</firstname><surname>Malchow</surname> <affiliation><address><email>ingomalchow@googlemail.com</email></address></affiliation> <contrib>Deutsche Übersetzung</contrib> </othercredit>

source: &dragonplayer; is a simple video player for &kde;.
de: &dragonplayer; ist ein einfacher Videospieler für &kde;

source: Introduction
de: Einführung

source: &dragonplayer; Screenshot
de: Bildschirmfoto von &dragonplayer;

source: Screenshot
de: Bildschirmfoto

source: &dragonplayer; is a simple media player using &phonon; technology. &dragonplayer; is a no frills media player that excels at playing DVDs and movie files without getting in your way.
de: &dragonplayer; ist ein einfacher Medienabspieler, basierend auf der &phonon;-Technologie. &dragonplayer; ist ein schnörkelloser Medienabspieler, der sich dadurch auszeichnet, DVDs und Videodateien abzuspielen, ohne die Bedienungsoberfläche mit unnötigen Funktionen zu überladen.

source: Select a Media
de: Medien auswählen

source: If you start &dragonplayer; from the application launcher or use <guibutton>Play Media</guibutton> (<keycombo action="simul">&Ctrl;<keycap>O</keycap></keycombo>) from the toolbar or from the <guimenu>Play</guimenu> menu this window is displayed:
de: Wenn Sie &dragonplayer; vom Startmenü aufrufen oder <guibutton>Medien wiedergeben</guibutton> (<keycombo action="simul">&Ctrl;<keycap>O</keycap></keycombo>) in der Werkzeugleiste oder aus dem Menü <guimenu>Wiedergabe</guimenu> benutzen, wird diese Fenster angezeigt:

source: <screeninfo>Play Media</screeninfo>
de: <screeninfo>Medien wiedergeben</screeninfo>

source: <phrase>Play Media</phrase>
de: <phrase>Medien wiedergeben</phrase>

source: There are three ways to play a video file:
de: Es gibt drei Möglichkeiten, eine Videodatei abzuspielen:

source: <guibutton>Play File</guibutton> opens the file dialog and allows you to select a file to play.
de: <guibutton>Datei</guibutton> öffnet den Dateiauswahldialog, hier können Sie eine Datei zur Wiedergabe auswählen.

source: <guibutton>Play Disc</guibutton> to play a &CD; or DVD.
de: <guibutton>CD/DVD wiedergeben</guibutton> um eine &CD; oder DVD abzuspielen.

source: <guibutton>Play Stream</guibutton> opens a dialog to enter an address of some <ulink url="http://en.wikipedia.org/wiki/Streaming_media">multimedia stream</ulink>.
de: Mit <guibutton>Stream wiedergeben</guibutton> wird ein Dialog geöffnet, in dem die Adresse (URL) eines <ulink url="http://de.wikipedia.org/wiki/Streaming_Media">Multimedia-Streams</ulink> eingegeben werden kann.

source: Double click on an entry in the play list with recently opened files to start playing it. The context menu of the play list shows actions to remove a selected entry or clear the whole play list. Any file you played will be automatically added to the list.
de: Klicken Sie zweimal auf einen Eintrag in der Wiedergabeliste mit zuletzt geöffneten Dateien, um die Wiedergabe zu starten. Im Kontextmenü der Wiedergabeliste finden Sie Aktionen, um einen ausgewählten Eintrag zu löschen oder die gesamte Liste zu leeren. Jede gespielte Datei wird automatisch zur Liste hinzugefügt.

source: Features
de: Funktionen

source: Full Screen Mode
de: Vollbildmodus

source: While playing a movie, you can enter full screen mode. This uses the entire monitor to display the movie. Moving the mouse shows a toolbar at the top of the screen in full screen mode. Toggle the full screen mode using the <guimenu>Settings</guimenu> menu, the action in the toolbar, double click on the video or use the shortcut <keycap>F</keycap>.
de: Einen Film können Sie auch im Vollbildmodus abspielen. Dann wird der gesamte Bildschirm für das Video benutzt. Wenn Sie die Maus bewegen, wird eine Werkzeugleiste am oberen Rand des Bildschirms eingeblendet. Um diesen Modus ein- und auszuschalten, benutzen Sie das Menü <guimenu>Einstellungen</guimenu>. die Aktion in der Werkzeugleiste, den Kurzbefehl <keycap>F</keycap> oder klicken zweimal auf das Video.

source: Video Settings
de: Videoeinstellungen

source: Select this action from the <guimenu>Settings</guimenu> menu to adjust <guilabel>Brightness</guilabel>, <guilabel>Contrast</guilabel>, <guilabel>Hue</guilabel> and <guilabel>Saturation</guilabel>. These settings are stored together with the playback position for each video file. This enables you resume playing a video with the selected video settings and the position where you stopped playing.
de: Wählen Sie diese Aktion aus dem Menü <guimenu>Einstellungen</guimenu>, um <guilabel>Helligkeit</guilabel>, <guilabel>Kontrast</guilabel>, <guilabel>Farbton</guilabel> und <guilabel>Sättigung</guilabel> einzustellen. Diese Einstellungen werden zusammen mit der Abspielposition für jede Videodatei gespeichert. Das erlaubt es Ihnen, ein Video mit allen ausgewählten Einstellungen da weiter anzusehen, wo Sie das letzte Mal aufgehört haben.

source: The shortcut <keycap>PgUp</keycap> brings you 10% forward, <keycap>PgDown</keycap> 10% backward. Use <menuchoice><guimenu>Settings</guimenu> <guimenuitem>Menu Toggle</guimenuitem></menuchoice> (<keycap>R</keycap>) to switch to the video menu and select another chapter to play. <menuchoice><guimenu>Play</guimenu><guimenuitem>Play/Pause</guimenuitem></menuchoice> (<keysym>Space</keysym>) allows you to pause and resume playback if a movie is loaded. <menuchoice><guimenu>Play</guimenu><guimenuitem>Stop</guimenuitem></menuchoice> (<keycap>S</keycap>) stops playback. Go to the previous or next chapter of a video with <guimenuitem>Previous Chapter</guimenuitem> (<keycap>,</keycap>) or <guimenuitem>Next Chapter</guimenuitem> (<keycap>.</keycap>) from the <guimenu>Play</guimenu> menu.
de: Mit dem Kurzbefehl <keycap>Bild auf</keycap> gehen Sie 10 % der Spielzeit nach vorne, mit <keycap>Bild ab</keycap> 10 % zurück. Benutzen Sie <menuchoice><guimenu>Einstellungen</guimenu> <guimenuitem>Menü umschalten</guimenuitem></menuchoice> (<keycap>R</keycap>), um zum Menü des Videos zu wechseln und ein anderes Kapitel abzuspielen. Mit <menuchoice><guimenu>Wiedergabe</guimenu><guimenuitem>Wiedergabe/Pause</guimenuitem></menuchoice> (<keysym>Leertaste</keysym>) halten Sie den Film an und starten ihn wieder. Wenn ein Film geladen ist, können Sie mit <menuchoice><guimenu>Wiedergabe</guimenu><guimenuitem>Anhalten</guimenuitem></menuchoice> (<keycap>S</keycap>) das Abspielen beenden. Zum vorherigen oder nächsten Kapitel eines Videos gehen Sie mit <guimenuitem>Vorheriges Kapitel</guimenuitem> (<keycap>,</keycap>) oder <guimenuitem>Nächstes Kapitel</guimenuitem> (<keycap>.</keycap>) aus dem Menü <guimenu>Wiedergabe</guimenu>.

source: Volume control
de: Lautstärkeeinstellung

source: If you play videos with a hidden toolbar, you can use the shortcut <keycap>M</keycap> to mute or unmute the sound; and the shortcut <keycap>V</keycap> to toggle the display of the volume slider right to the video.
de: Spielen Sie ein Video mit ausgeblendeter Werkzeugleiste ab, können Sie den Ton mit dem Kurzbefehl <keycap>M</keycap> ein- oder ausschalten. Mit dem Kurzbefehl <keycap>V</keycap> wird der Lautstärkeregler rechts neben dem Video ein- und ausgeblendet.

source: <guimenu>Settings</guimenu> <guisubmenu>Aspect Ratio</guisubmenu>
de: <guimenu>Einstellungen</guimenu> <guisubmenu>Seitenverhältnis</guisubmenu>

source: This menu lets you pick the aspect ratio of the playing movie. The aspect ratio is width of movie compared to the height.
de: Dieses Menü erlaubt Ihnen, das Seitenverhältnis des abgespielten Filmes zu wählen. Das Seitenverhältnis ist die Breite des Filmes verglichen mit der Höhe.

source: <guisubmenu>Subtitles</guisubmenu> and <guisubmenu>Audio Channels</guisubmenu>
de: <guimenu>Untertitel</guimenu> und <guisubmenu>Audiokanäle</guisubmenu>

source: These menu items from the <guimenu>Settings</guimenu> menu are active if there are any subtitles or additional audio channels (&eg; with different languages) available from the currently playing movie. Note that it may take a few seconds of playback before the subtitles or audio channels become available.
de: Diese Einträge aus dem Menü <guimenu>Einstellungen</guimenu> können ausgewählt werden, wenn der momentan gespielte Film über Untertitel oder zusätzliche Audiokanäle (&eg; mit verschiedenen Sprachen) verfügt. Beachten Sie, dass es einige Sekunden dauern kann, bevor die Untertitel oder die Audiokanäle verfügbar werden.

source: Credits and License
de: Danksagungen und Lizenz

source: Program copyright 2004 Max B. Howell <email>max.howell@methylblue.com</email>
de: Programm Copyright 2004 Max B. Howell <email>max.howell@methylblue.com</email>

source: Program copyright 2007 Ian A. Monroe <email>imonroe@kde.org</email>
de: Programm Copyright 2007 Ian A. Monroe <email>imonroe@kde.org</email>

source: Documentation copyright 2004 Mike Diehl <email>madpenguin8@yahoo.com</email>
de: Dokumentation Copyright 2004 Mike Diehl <email>madpenguin8@yahoo.com</email>

source: Documentation copyright 2007 Ian Monroe <email>imonroe@kde.org</email>
de: Dokumentation Copyright 2007 Ian Monroe <email>imonroe@kde.org</email>

source: CREDIT_FOR_TRANSLATORS
de: <para>Übersetzung Ingo Malchow<email>ingomalchow@googlemail.com</email></para>
