Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdemultimedia/juk.po
Languages: de

source: The Advanced Search dialog is used to create <link linkend="juk-search-playlists">Search Playlists</link>. It allows you to make a fine-grained search among the different tags of your song collection.
de: Der erweiterte Suchdialog kann verwendet werden um <link linkend="juk-search-playlists">Wiedergabelisten</link> zu erstellen. Er erlaubt Ihnen eine genaue Suche in den verschiedenen Metadaten Ihrer Stücke.

source: At the top of the dialog, you can type in the name of your search playlist. Then, you can define your search criteria in the <guilabel>Search Criteria</guilabel> group.
de: Am oberen Rand des Fensters können Sie den Namen der Wiedergabeliste eingeben. Dann können Sie die Kriterien im Bereich <guilabel>Suchkriterien</guilabel> festlegen.

source: The top of the <guilabel>Search Criteria</guilabel> group has two radio buttons, <guilabel>Match any of the following</guilabel> and <guilabel>Match all of the following</guilabel>. If you select <guilabel>Match any of the following</guilabel>, then a match by any of the conditions you define will include the song in the playlist. Otherwise, every condition you define must match in order to include the song in the playlist.
de: Am Beginn der Gruppe <guilabel>Suchkriterium</guilabel> befinden sich zwei Auswahlknöpfe, <guilabel>Übereinstimmung mit einem der Kriterien</guilabel> und <guilabel>Übereinstimmung mit allen Kriterien</guilabel>. Wenn Sie <guilabel>Übereinstimmung mit einem der Kriterien</guilabel> auswählen, wird eine Übereinstimmung mit einem der angegebenen Kriterien das Stück zur Wiedergabeliste hinzufügen. Anderenfalls muss das Stück alle angegebenen Kriterien erfüllen um zur Wiedergabeliste hinzugefügt zu werden.

source: Below the radio buttons are the condition definitions. You can add more conditions by using the <guibutton>More</guibutton> button, and remove conditions by using the <guibutton>Fewer</guibutton> button. Any conditions you leave blank are ignored, so you do not have to use <guibutton>Fewer</guibutton> to eliminate empty conditions.
de: Unter den Auswahlknöpfen befinden sich die Eingabezeilen, mit denen Sie Kriterien festlegen können. Als Standard werden zwei Eingabezeilen angezeigt, falls Sie mehr als zwei Kriterien festlegen möchten, können Sie sich mit dem Knopf <guibutton>Mehr</guibutton> eine weitere Eingabezeile anzeigen lassen. Um die jeweils unterste Eingabezeile der Liste zu entfernen, müssen Sie auf den Knopf <guibutton>Weniger</guibutton> klicken. Falls Sie eine Eingabezeile leer lassen, wird diese von &juk; ignoriert, sodass Sie den Knopf <guibutton>Weniger</guibutton> nicht verwenden müssen, wenn Sie eine Eingabezeile leer lassen.

source: Every condition definition has three parts: The tag chooser list on the left, the matching style list on the right, and the search text in the middle. The tag chooser lets &juk; know what tag you want to search for the text in. If you choose the special tag "&lt;All Visible&gt;", then any tag that you can see in the Collection List listing is fair game to match the search text.
de: Jede Eingabezeile besteht aus drei Teilen. Ganz links befindet sich die Auswahlliste mit der Sie auswählen können welche Art von Metadaten übereinstimmen soll. Die Auswahlliste der Art der Übereinstimmung befindet sich ganz rechts, und in der Mitte finden Sie das Eingabefeld für den zu suchenden Text. Wenn Sie in der Auswahlliste der Metadaten, die übereinstimmen sollen, den Eintrag <quote>&lt;Alle Sichtbaren&gt;</quote> auswählen, werden alle Metadaten, die in Ihrer Sammlungsliste angezeigt werden, durchsucht.

source: The match style list lets &juk; know which search method to use. The search methods you can use are as follows:
de: Die Auswahlliste der Art der Übereinstimmung können Sie verwenden um &juk; mitzuteilen, welche Suchmethode verwendet werden soll. Folgende Suchmethoden können ausgewählt werden:

source: Normal Matching
de: Normale Übereinstimmung

source: This is the default matching style. It searches for the given text anywhere in the chosen tag, ignoring case differences. For example a search for mode in the Artist tag would match Depeche Mode.
de: Dies ist die Standardeinstellung. &juk; sucht nach dem zu suchenden Text überall in den ausgewählten Metadaten. Dabei ignoriert es Groß- und Kleinschreibung. Zum Beispiel würde eine Suche nach <quote>mode</quote> im Künstlernamen auch zu <quote>Depeche Mode</quote> als Ergebnis führen.

source: Case Sensitive
de: Groß-/Kleinschreibung beachten

source: This search is just like Normal Matching, except that the search must match the exact case of the text.
de: Diese Suchmethode ähnelt der Standard-Methode, allerdings wird die Groß- und Kleinschreibung beachtet. Folglich müssten Sie, wenn Sie nach <quote>Depeche Mode</quote> suchen wollen, als Suchbegriff <quote>Mode</quote> eingeben.

source: Pattern Matching
de: Übereinstimmende Muster

source: This is the most powerful search method. The search text you type in will define a regular expression used to search within the tag. Regular expressions are beyond the scope of this documentation, but the application &kregexpeditor; can help you form a regular expression. &juk; uses the &Qt; regular expression style.
de: Dies ist die vielseitigste Suchmethode. Der eingegebene Suchtext wird einen regulären Ausdruck definieren, der benutzt wird um innerhalb der Metadaten zu suchen. Reguläre Ausdrücke sind außerhalb des Rahmens dieser Dokumentation, aber das Programm &kregexpeditor; kann Ihnen helfen einen regulären Ausdruck zu formen. &juk; verwendet reguläre Ausdrücke im Stil von Qt.

source: Simply choose the conditions you want to include in your search, and click <guibutton>OK</guibutton> to create your search playlist!
de: Erstellen Sie die Suchkriterien, die Sie für Ihre Suche verwenden wollen, und klicken Sie auf <guibutton>OK</guibutton>, um Ihre Wiedergabeliste aus einer Suche zu erstellen.

source: The &juk; Toolbar
de: Die &juk;-Werkzeugleiste

source: The Main Toolbar
de: Die Hauptwerkzeugleiste

source: <screeninfo>The &juk; toolbar.</screeninfo>
de: <screeninfo>Die &juk;-Werkzeugleiste</screeninfo>

source: <phrase>The &juk; toolbar.</phrase>
de: <phrase>Die &juk;-Werkzeugleiste</phrase>

source: <para>The &juk; toolbar.</para>
de: <para>Die &juk;-Werkzeugleiste</para>

source: From left to right in the screenshot above, the icons on the default toolbar are:
de: Von links nach rechts im Bildschirmfoto oben, sind folgende Symbole zu sehen:

source: <guiicon>New</guiicon>
de: <guiicon>Neu</guiicon>

source: Create a new playlist. If you hold down the button, a menu will pop up allowing you to select the different kinds of playlists to create.
de: Erstellen einer neuen Wiedergabeliste. Wenn Sie die linke Maustaste beim klicken auf das Symbol gedrückt halten, erscheint ein Menü, in dem Sie zwischen den verschiedenen Arten von Wiedergabelisten wählen können.

source: Empty Playlist...
de: Leere Wiedergabeliste ...

source: This prompts you for a playlist name, and then inserts it into the Playlist view. The playlist starts out completely empty.
de: Wenn Sie diese Option auswählen, wird eine vollkommen leere Wiedergabeliste zum Wiedergabelistenbereich hinzugefügt, nachdem Sie einen Namen für die neue Wiedergabeliste vergeben haben.

source: Playlist From Folder...
de: Wiedergabeliste aus Ordner ...

source: This prompts you for a folder to open, and then creates a playlist containing the music within the folder and any sub-folders. The name of the created playlist is the same as the name of the selected folder.
de: Wählen Sie zuerst einen Ordner aus, aus dem dann eine Wiedergabeliste erstellt wird, die alle Dateien des angegebenen Ordners und allen seinen Unterordnern enthält. Der Name der erstellten Wiedergabeliste stimmt mit dem Namen des ausgewählten Ordners überein.

source: Search Playlist...
de: Wiedergabeliste durchsuchen ...

source: This brings up the Advanced Search Dialog, allowing you to create a <quote>virtual playlist</quote>. Any songs in your Collection List that match the search criteria that you specify in the Advanced Search Dialog will be added to the new playlist. As your Collection List changes, the new playlist will as well. For example, if you create a playlist of all of your Depeche Mode songs, and then add another Depeche Mode song to your Collection List, it will show up in the Depeche Mode playlist with no special action required on your part.
de: Diese Option ruft den erweiterten Suchdialog auf, der es Ihnen erlaubt, eine <quote>virtuelle Wiedergabeliste</quote> zu erstellen. Alle Stücke die zu den angegebenen Suchkriterien passen, die Sie im erweiterten Suchdialog angegeben haben, werden zur neuen Wiedergabeliste hinzugefügt. Wenn Sie später Stücke zu Ihrer Sammlungsliste hinzufügen, die zu den angegebenen Suchkriterien passen, werden diese automatisch zur virtuellen Wiedergabeliste hinzugefügt. Wenn Sie zum Beispiel eine Wiedergabeliste für alle Ihre <quote>Depeche Mode</quote>-Stücke erstellen, und Sie ein weiteres <quote>Depeche Mode</quote>-Stück zu Ihrer Sammlungsliste hinzufügen, wird dieses auch automatisch dieser Wiedergabeliste hinzugefügt.

source: Open
de: Öffnen

source: Add a file to the collection list (if it's active) or to the currently selected playlist. Adding a file to a playlist will add it to the collection list automatically, but not vice versa.
de: Fügen Sie eine Datei zur Sammlungsliste oder zur gerade aktiven (im Fenster angezeigten) Wiedergabeliste hinzu. Das Hinzufügen einer Datei zu einer Wiedergabeliste wird diese auch automatisch zur Sammlungsliste hinzufügen; umgekehrt gilt das allerdings nicht.

source: Save
de: Speichern

source: Save the currently selected playlist. To save a tag you have edited, either select another item, or press <keycombo action="simul">&Ctrl;<keycap>T</keycap></keycombo> instead.
de: Speichern der gerade aktiven Wiedergabeliste. Um geänderte Metadaten zu speichern, klicken Sie irgendwo in das &juk;-Programmfenster oder drücken Sie den Kurzbefehl <keycombo action="simul">&Ctrl;<keycap>T</keycap></keycombo>.

source: <guiicon>Cut</guiicon>
de: <guiicon>Ausschneiden</guiicon>

source: If a playlist or song is selected, cut (remove) it from the list. If the tag editor is active, this works like cut in any editor, removing the selected text, but keeping a copy on the clipboard.
de: Wenn ein Stück in einer Wiedergabeliste ausgewählt ist, wird es dadurch aus der Wiedergabeliste entfernt. Wenn der Metadaten-Editor aktiv ist, funktioniert der Knopf wie in jedem anderem Editor auch, das heißt, er entfernt den ausgewählten Text und speichert ihn in der Zwischenablage.

source: <guiicon>Copy</guiicon>
de: <guiicon>Kopieren</guiicon>

source: If the tag editor is active, this works like copy in any editor, placing a copy of the selected text on the clipboard.
de: Wenn der Metadaten-Editor aktiv ist, funktioniert der Knopf wie in jedem anderem Editor auch, er kopiert den ausgewählten Text in die Zwischenablage.

source: If you use copy on a song in the collection list, the url is placed on the clipboard, so you can paste it. For example, you could paste the url into a text editor, &konqueror;, or another playlist.
de: Wenn Sie die Funktion verwenden, während ein Stück in der Sammlungsliste ausgewählt ist, wird dessen URL in der Zwischenablage gespeichert, sodass Sie sie anderswo einfügen können. Zum Beispiel in einen Texteditor, &konqueror;, oder eine andere Wiedergabeliste.

source: <guiicon>Paste</guiicon>
de: <guiicon>Einfügen</guiicon>

source: If you previously either cut or copied a url from the collection list, you can paste the url back into a new playlist. You could also paste a url you have copied from &konqueror; or any other application. If you are operating in the tag editor, paste will paste any text currently on the clipboard into the selected field.
de: Wenn Sie bereits vorher eine URL in die Zwischenablage kopiert haben, können Sie diese mit dieser Funktion wieder in eine Wiedergabeliste einfügen. Natürlich können Sie auch eine URL einfügen, die Sie aus &konqueror; oder einem anderem Programm kopiert oder ausgeschnitten haben. Wenn der Metadaten-Editor aktiv ist wird diese Funktion den derzeitigen Inhalt der Zwischenablage in das ausgewählte Feld einfügen.

source: Show Search Bar
de: Suchleiste anzeigen

source: Show or hide <link linkend="search-bar">the search bar</link>.
de: Anzeigen oder Ausblenden der <link linkend="search-bar">Suchleiste</link>.

source: Show Tag Editor
de: Metadaten-Editor anzeigen

source: Show or hide <link linkend="tagging-a-single-file">the tag editor</link>.
de: Anzeigen oder Ausblenden <link linkend="tagging-a-single-file">des Metadaten-Editors</link>.

source: Play controls
de: Wiedergabe

source: These work like any standard media player you may have come across. The controls are <guiicon>Play</guiicon>, <guiicon>Pause</guiicon>, <guiicon>Stop</guiicon>, <guiicon>Previous </guiicon> and <guiicon>Next</guiicon>.
de: Dies funktioniert wie in jedem anderen Audio-Wiedergabeprogramm auch. Die Funktionen, die zur Verfügung stehen, sind <guiicon>Wiedergabe</guiicon>, <guiicon>Pause</guiicon>, <guiicon>Stopp</guiicon>, <guiicon>Vorheriger</guiicon> und <guiicon>Nächster</guiicon>.

source: There is also a tracking bar, showing how far along (relatively) in the current song you are. You can drag this slider with the mouse in order to skip forwards or backwards within a track.
de: In die Programmoberfläche ist auch eine Fortschrittsanzeige in Form eines Schiebereglers integriert, die anzeigt, wie weit (relativ) Sie ein Stück schon gehört haben. Sie können den Schieberegler mit der Maus bewegen, um innerhalb des Stücks vorwärts oder rückwärts zu springen.

source: Finally there is a volume slider. As you may expect, this raises and lowers the volume. <quote>Loud</quote> is on the right, and <quote>Quiet</quote> is on the left.
de: Zu guter Letzt befindet sich in der Programmoberfläche auch ein Lautstärkeregler. Wie Sie bereits ahnen, können Sie damit die Lautstärke verändern, also lauter und leiser stellen. <quote>Laut</quote> befindet sich ganz rechts und <quote>Leise</quote> ganz links.

source: The Search bar
de: Die Suchleiste

source: The search bar allows you to quickly search for a song in the collection list or a playlist.
de: Mit der Suchleiste können Sie schnell und einfach nach einem Stück in der Sammlungsliste oder der gerade aktiven Wiedergabeliste suchen.

source: Simply typing text into the search bar will reduce the visible list of songs to those which contain that text in any visible column. Pressing &Enter; will start playing the top match in the playlist view.
de: Die Eingabe eines Suchbegriffs in die Suchleiste wird die Liste der angezeigten Stücke auf jene reduzieren die den eingegebenen Suchbegriff in einer sichtbaren Spalte enthalten. Das Drücken der &Enter;taste wird das oberste Stück der reduzierten Liste abspielen.

source: Searching begins instantly when text is entered into the search field. Searching is incremental, that is, as you type each character into the text field, the search is narrowed further. This is useful to find a song where you only remember part of a name, for instance.
de: Die Suche beginnt augenblicklich wenn Sie beginnen den Suchbegriff in das Suchfeld einzugeben. Die Suche ist inkrementell, das heißt mit jedem Zeichen das Sie eingeben, wird das Suchergebnis eingeengt. Dies ist praktisch wenn Sie sich zum Beispiel nur an den Teil eines Stücknamens erinnern.

source: Menu and Command Reference
de: Menü- und Befehlsreferenz

source: Menus
de: Menüs

source: File Menu
de: Das Menü Datei

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo> </shortcut> <guimenu>File</guimenu><guisubmenu>New</guisubmenu><guimenuitem>Empty Playlist...</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo></shortcut><guimenu>Datei</guimenu><guisubmenu>Neu</guisubmenu><guimenuitem>Leere Wiedergabeliste ...</guimenuitem>

source: Create a new playlist
de: Erstellt eine neue Wiedergabeliste.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>F</keycap></keycombo> </shortcut> <guimenu>File</guimenu><guisubmenu>New</guisubmenu><guimenuitem>Search Playlist...</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>F</keycap></keycombo></shortcut><guimenu>Datei</guimenu><guisubmenu>Neu</guisubmenu><guimenuitem> Wiedergabeliste aus Suche erstellen ...</guimenuitem>

source: Creates a new <link linkend="juk-search-playlists">search playlist</link>.
de: Erstellt eine neue <link linkend="juk-search-playlists">Wiedergabeliste aus einer Suchanfrage</link>.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>D</keycap></keycombo> </shortcut> <guimenu>File</guimenu><guisubmenu>New</guisubmenu><guimenuitem>Playlist From Folder...</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>D</keycap></keycombo></shortcut><guimenu>Datei</guimenu><guisubmenu>Neu</guisubmenu><guimenuitem>Wiedergabeliste aus Ordner ...</guimenuitem>

source: Creates a new playlist, containing all music files in a folder and any sub-folders. Any music within playlists files that &juk; recognizes will also be added.
de: Erstellt eine neue Wiedergabeliste, die alle Musikdateien eines Ordners und seiner Unterordner enthält. Jedes Stück innerhalb einer Wiedergabeliste die &juk; im Ordner oder einem Unterordner findet, wird ebenfalls zur Sammlungsliste hinzugefügt.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>O</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Open...</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>O</keycap></keycombo> </shortcut> <guimenu>Datei</guimenu> <guimenuitem>Öffnen ...</guimenuitem>

source: Select a file (or files) to add to the collection list. If you select a playlist file, every file in the playlist will be added.
de: Wählen Sie eine oder mehrere Dateien aus und fügen Sie sie zur Sammlungsliste hinzu. Wenn Sie eine Wiedergabeliste auswählen, werden alle enthaltenen Stücke zur Sammlungsliste hinzugefügt.

source: <guimenu>File</guimenu><guimenuitem>Manage Folders...</guimenuitem>
de: <guimenu>Datei</guimenu><guimenuitem>Ordner verwalten ...</guimenuitem>

source: This menu item opens the same window that is shown on a first &juk; start
de: Dieser Menüeintrag öffnet das gleiche Fenster, das beim ersten Start von &juk; angezeigt wird.

source: Select a folder (or folders) to add to the collection list. These folders will also be rescanned whenever &juk; is started or <menuchoice><guimenu>File</guimenu><guimenuitem>Reload</guimenuitem> </menuchoice> is chosen.
de: Wählen Sie einen oder mehrere Ordner aus. Der oder die Ordner werden zur Sammlungsliste hinzugefügt und bei jedem Start von &juk; neu eingelesen und eventuelle Änderungen übernommen. Alternativ können Sie die Ordner auch nach dem Start von &juk; über den Menüpunkt <menuchoice><guimenu>Datei</guimenu><guimenuitem>Erneut laden</guimenuitem> </menuchoice> neu einlesen.

source: You can also select folders that should not be automatically searched (which would override the list of folders to scan on startup). This way you can avoid having to completely change up your music layout on-disk just to keep &juk; from automatically grabbing songs you do not want or need managed from within &juk;.
de: Außerdem können Sie auch Ordner auswählen, die nicht automatisch durchsucht werden. Dies überschreibt die Liste der Ordner, die beim Start eingelesen werden. Damit vermeiden Sie, Ihre Anordnung der Musik auf der Festplatte vollständig ändern zu müssen, nur um das automatische Einfügen von nicht erwünschten Liedern durch &juk; zu verhindern oder Ordner auszuschließen, die in &juk; verwaltet werden sollen.

source: The Manage Folders dialog
de: Der Dialog Ordnerliste

source: Screenshot of the Manage Folders Dialog.
de: Bildschirmfoto des Dialogs Ordnerliste

source: If you want to remove files that are already in the collection list, you can enable the <guilabel>File Name (full path)</guilabel> column in a playlist and then use the search bar to find the offending path name, select and remove the files that are shown.
de: Möchten Sie Dateien entfernen, die bereits in der Sammlungsliste enthalten sind, können Sie die Spalte <guilabel>Dateiname /Vollständiger Pfad</guilabel> in der Wiedergabeliste anzeigen. Verwenden Sie dann die Suchleiste, um nach dem gewünschten Pfadnamen zu filtern und entfernen Sie die angezeigten Dateien.

source: <guimenu>File</guimenu> <guimenuitem>Rename...</guimenuitem>
de: <guimenu>Datei</guimenu><guimenuitem>Umbenennen ...</guimenuitem>

source: Rename a playlist.
de: Umbenennen einer Wiedergabeliste.

source: <guimenu>File</guimenu><guimenuitem>Duplicate...</guimenuitem>
de: <guimenu>Datei</guimenu><guimenuitem>Duplizieren ...</guimenuitem>

source: Create a duplicate of the selected playlist, and prompt for a new name.
de: Erzeugt ein Duplikat der ausgewählten Wiedergabeliste, und fragt nach einem neuen Namen für die neue Liste.

source: <guimenu>File</guimenu><guimenuitem>Reload</guimenuitem>
de: <guimenu>Datei</guimenu><guimenuitem>Erneut laden</guimenuitem>

source: Reloads the tag information on every file in the selected playlist.
de: Lädt alle Metadaten der in der ausgewählten Wiedergabeliste enthaltenen Stücke neu.

source: <guimenu>File</guimenu><guimenuitem>Remove</guimenuitem>
de: <guimenu>Datei</guimenu><guimenuitem>Entfernen</guimenuitem>

source: Remove the selected playlist.
de: Entfernt die ausgewählte Wiedergabeliste.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>S</keycap></keycombo> </shortcut> <guimenu>File</guimenu><guimenuitem>Save</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>S</keycap></keycombo> </shortcut> <guimenu>Datei</guimenu><guimenuitem>Speichern</guimenuitem>

source: Save the selected playlist.
de: Speichert die ausgewählte Wiedergabeliste.

source: <guimenu>File</guimenu><guimenuitem>Save As...</guimenuitem>
de: <guimenu>Datei</guimenu><guimenuitem>Speichern unter ...</guimenuitem>

source: Save the selected playlist, with a different name.
de: Speichert die ausgewählte Wiedergabeliste unter einem anderen Namen.

source: Edit Menu
de: Das Menü Bearbeiten

source: <guimenu>Edit</guimenu><guimenuitem>Clear</guimenuitem>
de: <guimenu>Bearbeiten</guimenu><guimenuitem>Löschen</guimenuitem>

source: Removes the selected songs from the playlist.
de: Entfernt die ausgewählten Stücke aus der Wiedergabeliste.

source: View Menu
de: Das Menü Ansicht

source: <guimenu>View</guimenu><guimenuitem>Show Search Bar</guimenuitem>
de: <guimenu>Ansicht</guimenu><guimenuitem>Suchleiste anzeigen</guimenuitem>

source: This is a toggle action that sets whether or not the <link linkend="search-bar">Search Bar</link> is shown.
de: Mit dieser Funktion können Sie die <link linkend="search-bar">Suchleiste</link> ein- bzw. ausblenden.

source: <guimenu>View</guimenu><guimenuitem>Show Tag Editor</guimenuitem>
de: <guimenu>Ansicht</guimenu><guimenuitem>Metadaten-Editor anzeigen</guimenuitem>

source: This is a toggle action that sets whether or not the <interface>Tag Editor</interface> is shown.
de: Mit dieser Funktion können Sie den <interface>Metadaten-Editor</interface> ein- bzw ausblenden.

source: <guimenu>View</guimenu><guimenuitem>Show History</guimenuitem>
de: <guimenu>Ansicht</guimenu><guimenuitem>Verlauf anzeigen</guimenuitem>

source: This is a toggle action that sets whether or not the <link linkend="juk-history-playlists">History Playlist</link> is shown.
de: Mit dieser Funktion können Sie die<link linkend="juk-history-playlists">Verlauf-Wiedergabeliste</link> ein- bzw. ausblenden.
