Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdemultimedia/juk.po
Languages: de

source: <guimenu>View</guimenu><guisubmenu>View Modes</guisubmenu><guimenuitem>Default</guimenuitem>
de: <guimenu>Ansicht</guimenu><guisubmenu>Anzeigemodi</guisubmenu><guimenuitem>Standard</guimenuitem>

source: Switches to <link linkend="juk-viewmode-default">Default View mode</link>.
de: Wechselt zur <link linkend="juk-viewmode-default">Standardansicht</link>.

source: <guimenu>View</guimenu><guisubmenu>View Modes</guisubmenu><guimenuitem>Compact</guimenuitem>
de: <guimenu>Ansicht</guimenu><guisubmenu>Anzeigemodi</guisubmenu><guimenuitem>Kompakt</guimenuitem>

source: Switches to <link linkend="juk-viewmode-compact">Compact View mode</link>.
de: Wechselt zur <link linkend="juk-viewmode-compact">Kompaktansicht</link>.

source: <guimenu>View</guimenu><guisubmenu>View Modes</guisubmenu><guimenuitem>Tree</guimenuitem>
de: <guimenu>Ansicht</guimenu><guisubmenu>Anzeigemodi</guisubmenu><guimenuitem>Baum</guimenuitem>

source: Switches to <link linkend="juk-viewmode-tree">Tree View mode</link>.
de: Wechselt zur <link linkend="juk-viewmode-tree">Baumansicht</link>.

source: Player Menu
de: Das Menü Wiedergabe

source: <guimenu>Player</guimenu><guimenuitem>Random Play</guimenuitem>
de: <guimenu>Wiedergabe</guimenu><guimenuitem>Zufallswiedergabe</guimenuitem>

source: This is a toggle option which controls the Random Play setting. If Random Play is enabled, then &juk; will randomly select a random song from the current playlist when the currently playing song is over.
de: Mit dieser Funktion können Sie &juk; dazu bringen, nach dem Ende der Wiedergabe des aktuellen Stücks, zufällig ein Stück aus der ausgewählten Wiedergabeliste auszuwählen und dieses abzuspielen.

source: <guimenu>Player</guimenu><guimenuitem>Loop Playlist</guimenuitem>
de: <guimenu>Wiedergabe</guimenu><guimenuitem>Wiedergabeliste wiederholen</guimenuitem>

source: This is a toggle option which controls the Loop Playlist setting. If Loop Playlist is enabled, then &juk; will start playing from the beginning when it has finished playing every song in the current playlist.
de: Wenn Sie diese Funktion aktivieren, wird &juk;, nachdem es das Ende einer Wiedergabeliste erreicht hat, diese wieder vom Beginn an abspielen.

source: <guimenu>Player</guimenu><guimenuitem>Play</guimenuitem>
de: <guimenu>Wiedergabe</guimenu><guimenuitem>Wiedergabe</guimenuitem>

source: This command starts playing the currently selected song, or resumes playback of the song if it was paused.
de: Dieser Befehl spielt entweder das gerade ausgewählte Stück ab oder setzt die Wiedergabe eines Stücks fort, wenn diese pausiert wurde.

source: <guimenu>Player</guimenu><guimenuitem>Pause</guimenuitem>
de: <guimenu>Wiedergabe</guimenu><guimenuitem>Pause</guimenuitem>

source: This command pauses the currently playing song. Use the Play command to restart playback.
de: Mit diesem Befehl können Sie die Wiedergabe eines Stücks pausieren. Mit dem Wiedergabebefehl können Sie selbige dann wieder fortsetzen.

source: <guimenu>Player</guimenu><guimenuitem>Stop</guimenuitem>
de: <guimenu>Wiedergabe</guimenu><guimenuitem>Stopp</guimenuitem>

source: This command stops the playback of the currently playing song. You cannot resume playback from its current position after that.
de: Dieser Befehl stoppt die Wiedergabe des aktuellen Stücks. Sie können die Wiedergabe des Stücks nicht wieder an derselben Stelle fortsetzen.

source: <guimenu>Player</guimenu><guimenuitem>Next</guimenuitem>
de: <guimenu>Wiedergabe</guimenu><guimenuitem>Nächster</guimenuitem>

source: This command skips to the next song to play in the playlist.
de: Dieser Befehl springt zum nächsten Stück in der Wiedergabeliste.

source: <guimenu>Player</guimenu><guimenuitem>Previous</guimenuitem>
de: <guimenu>Wiedergabe</guimenu><guimenuitem>Vorheriger</guimenuitem>

source: This command plays the song that was playing before the currently playing song.
de: Dieser Befehl spielt das Stück ab das vor dem aktuellen Stück abgespielt wurde.

source: Tagger Menu
de: Das Menü Metadaten

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>T</keycap></keycombo></shortcut> <guimenu>Tagger</guimenu><guimenuitem>Save</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>T</keycap></keycombo></shortcut> <guimenu>Metadaten</guimenu><guimenuitem>Speichern</guimenuitem>

source: This command saves any changes to the tags that you are editing. Normally, changes are not saved until you deselect the file you are editing.
de: Dieser Befehl speichert alle Änderungen der Metadaten der Datei die Sie gerade bearbeiten. Normalerweise werden Änderungen nicht gespeichert bis Sie mit der Maus in einen anderen Teil des &juk;-Programmfensters klicken.

source: <guimenu>Tagger</guimenu><guimenuitem>Delete</guimenuitem>
de: <guimenu>Metadaten</guimenu><guimenuitem>Löschen</guimenuitem>

source: This command deletes the currently selected files from the Collection List and any playlists containing it, and then deletes the selected file from the disk.
de: Dieser Befehl löscht das gerade ausgewählte Stück aus der Sammlungsliste und allen Wiedergabelisten in denen es enthalten ist. Danach wird die zum Stück gehörige Datei von der Festplatte gelöscht.

source: <guimenu>Tagger</guimenu><guimenuitem>Refresh</guimenuitem>
de: <guimenu>Metadaten</guimenu><guimenuitem>Aktualisieren</guimenuitem>

source: This command allows you to refresh playlist tags after changing them.
de: Dieser Befehl ermöglicht das erneute Einlesen der Wiedergabeliste nach Änderungen.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>G</keycap></keycombo></shortcut> <guimenu>Tagger</guimenu><guisubmenu>Guess Tag Information</guisubmenu><guimenuitem>From Filename</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>G</keycap></keycombo></shortcut> <guimenu>Metadaten</guimenu><guisubmenu>Metadaten raten</guisubmenu><guimenuitem>Vom Dateinamen</guimenuitem>

source: This command tries to guess the tags of the selected files by scanning the filename. You can configure the patterns used for guessing by selecting <menuchoice><guimenu>Settings</guimenu> <guimenuitem>Tag Guesser...</guimenuitem></menuchoice>, which opens the <link linkend="juk-tag-guesser-configuration">Tag Guesser Configuration dialog</link>.
de: Diese Funktion versucht, die Metadaten eines Stücks anhand des Dateinamens zu erraten. Sie können die zu verwendenden Schemen über den Menüpunkt <menuchoice><guimenu>Einstellungen</guimenu> <guimenuitem>Metadaten raten ...</guimenuitem></menuchoice> bearbeiten, welcher den Dialog <link linkend="juk-tag-guesser-configuration">Einrichtung des Metadaten-Raters</link> öffnet.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>I</keycap></keycombo></shortcut> <guimenu>Tagger</guimenu><guisubmenu>Guess Tag Information</guisubmenu><guimenuitem>From Internet</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>I</keycap></keycombo></shortcut> <guimenu>Metadaten</guimenu><guisubmenu>Metadaten raten</guisubmenu><guimenuitem>Aus dem Internet</guimenuitem>

source: This command tries to guess the tags of the selected files by using the <application>TunePimp</application> library provided with <ulink url="http://www.musicbrainz.org/">MusicBrainz</ulink>.
de: Diese Funktion versucht die Metadaten einer Datei zu erraten, indem sie <application>TunePimp</application> von <ulink url="http://www.musicbrainz.org/">MusicBrainz</ulink> verwendet.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>R</keycap></keycombo></shortcut> <guimenu>Tagger</guimenu><guimenuitem>Rename File</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>R</keycap></keycombo></shortcut> <guimenu>Metadaten</guimenu><guimenuitem>Datei umbenennen</guimenuitem>

source: This command allows you to rename a file or a group of files for the selected songs in the playlist. Before the real rename happens &juk; will show a preview dialog where you can confirm or cancel the action.
de: Mit dieser Aktion kann eine Datei oder eine Gruppe von Dateien für die ausgewählten Stücke in der Wiedergabeliste umbenannt werden. Vor der tatsächlichen Ausführung wird das Ergebnis des Umbenennens in einem Vorschaudialog angezeigt. Dann können Sie die Ausführung bestätigen oder abbrechen.

source: The files will be renamed according to the parameters defined using <link linkend="juk-rename-dialog">Rename File dialog</link>.
de: Die Dateien werden mit den Parametern definiert, die im <link linkend="juk-rename-dialog">Dialog Umbenennen</link> festgelegt wurden.

source: Settings Menu
de: Das Menü Einstellungen

source: <guimenu>Settings</guimenu><guisubmenu>Toolbars Shown</guisubmenu> <guimenuitem>Main / Play Toolbar</guimenuitem>
de: <guimenu>Einstellungen</guimenu><guisubmenu>Angezeigte Werkzeugleisten</guisubmenu> <guimenuitem>Haupt- / Wiedergabe-Werkzeugleiste</guimenuitem>

source: These commands show or hide the <link linkend="main-toolbar">Main Toolbar</link> and the <link linkend="play-toolbar">Play Toolbar</link>.
de: Dieser Befehl blendet die <link linkend="main-toolbar">Haupt-Werkzeugleiste</link> und die <link linkend="play-toolbar">Wiedergabe-Werkzeugleiste</link> ein bzw. aus.

source: <guimenu>Settings</guimenu> <guimenuitem>Show Splash Screen on Startup</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>Begrüßungsbildschirm beim Starten anzeigen</guimenuitem>

source: This is a toggle option. If enabled, &juk; will display an informational screen upon startup as it loads your music collection.
de: Wenn Sie diese Funktion aktivieren, wird &juk; bei jedem Programmstart, während es Ihre Musiksammlung lädt, einen Begrüßungsbildschirm anzeigen, auf dem Informationen über die Sammlung angezeigt werden.

source: <guimenu>Settings</guimenu> <guimenuitem>Dock in System Tray</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>Im Systembereich der Kontrollleiste andocken</guimenuitem>

source: This is a toggle option. If enabled, &juk; will display an icon in your system tray. You can use the system tray icon to tell if &juk; is playing, and control playback.
de: Diese Option wird, wenn sie aktiviert wurde, ein &juk;-Symbol im Systemabschnitt der Kontrollleiste anzeigen. Über dieses Symbol zeigt &juk; an, ob es gerade ein Stück wiedergibt. Außerdem können Sie durch das Symbol bequem auf die Wiedergabefunktion von &juk; zugreifen.

source: <guimenu>Settings</guimenu> <guimenuitem>Stay in System Tray on Close</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>Nach dem Schließen in der Kontrollleiste bleiben</guimenuitem>

source: This is a toggle option. If enabled, &juk; will remain running if you close the main window. The <guimenuitem>Dock in System Tray</guimenuitem> option must also be enabled. To quit &juk;, use the <menuchoice><guimenu>File</guimenu> <guimenuitem>Quit</guimenuitem></menuchoice> command from the main window, or the <guimenuitem>Quit</guimenuitem> command from the system tray's context menu.
de: Wenn Sie diese Option aktiviert haben, wird &juk; nicht beendet wenn Sie das Programmfenster schließen, sondern bleibt im Systemabschnitt der Kontrollleiste als &juk;-Symbol weiterhin aktiv. Um diese Funktion nutzen zu können, muss die Option <guimenuitem>Im Systembereich der Kontrollleiste andocken</guimenuitem> ebenfalls aktiviert sein. Um &juk; zu beenden, müssen Sie dann entweder den Befehl <menuchoice><guimenu>Datei</guimenu> <guimenuitem>Beenden</guimenuitem></menuchoice> im Programmfenster auswählen, oder Sie erledigen dies bequem über das Symbol im Systemabschnitt der Kontrollleiste. Dazu klicken Sie mit der rechten Maustaste auf das Symbol und wählen dann die Option <guimenuitem>Beenden</guimenuitem> aus.

source: If &juk; is started up when it is set to dock in the system tray on startup a simple notification will be shown (as otherwise the user may wonder why &juk; window did not open up). It is possible to remove this additional notification by going to <menuchoice><guimenu>Common Appearance and Behavior</guimenu> <guimenuitem>Application and System Notifications</guimenuitem></menuchoice> in &systemsettings; to manage <guilabel>JuK music player</guilabel> application notifications. Just uncheck <guilabel>Show a message in a popup</guilabel> item for <guimenuitem>JuK running in dock mode</guimenuitem>. More information on &kde; notification settings can be found <ulink url="help:/kcontrol/kcmnotify">here</ulink>.
de: Wenn &juk; mit der Einstellung <guilabel>Im Systembereich der Kontrollleiste andocken</guilabel> gestartet wird, dann wird eine einfache Benachrichtigung am oberen Bildschirmrand angezeigt, da sich ansonsten mancher Benutzer wundern könnte, dass kein &juk;-Fenster angezeigt wird. Diese zusätzliche Benachrichtigung kann abgeschaltet werden. Dazu öffnen Sie in den &systemsettings; <menuchoice><guimenu>Allgemeines Erscheinungsbild und Verhalten</guimenu> <guimenuitem>Anwendungs- und Systembenachrichtigungen</guimenuitem></menuchoice>. Auf der Seite <guilabel>Benachrichtigungen verwalten</guilabel> wählen Sie <guilabel>Juk-Audio-Wiedergabe</guilabel> und und wählen Sie <guilabel>Meldungsfenster anzeigen</guilabel> für <guimenuitem>JuK läuft im Systemabschnitt der Kontrollleiste</guimenuitem>. Weitere Informationen über Einstellungen zu &kde;-Benachrichtigungen finden Sie in <ulink url="help:/kcontrol/kcmnotify">dieser Dokumentation</ulink>.

source: <guimenu>Settings</guimenu> <guimenuitem>Popup Track Announcement</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>Titelankündigung anzeigen</guimenuitem>

source: This is a toggle option. If enabled, &juk; will display an indicator whenever a song starts playing, with information on the artist and title, and with buttons allowing you to quickly switch to a different song. The Dock in System Tray option must also be enabled.
de: Wenn diese Option aktiviert ist, wird &juk; ein kleines Fenster einblenden, das Informationen über den Künstler und das Stück enthält dessen Wiedergabe gerade begonnen hat und Knöpfe für das schnelle wechseln zu einem anderem Stück enthält. Die Option <quote>An der Kontrollleiste andocken</quote> muss ebenfalls aktiviert sein.

source: <guimenu>Settings</guimenu> <guimenuitem>Tag Guesser...</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>Metadaten raten ...</guimenuitem>

source: This command brings up the <link linkend="juk-tag-guesser-configuration">Tag Guesser Configuration dialog box</link>, where you can alter the patterns used to guess tag information from filenames.
de: Dieser Menüpunkt öffnet den Dialog <link linkend="juk-tag-guesser-configuration">Einrichtung des Metadaten-Raters</link>. Dort können Sie alle Schemata bearbeiten, nach denen &juk; versucht die Metadaten aus Dateinamen zu erraten.

source: <guimenu>Settings</guimenu> <guimenuitem>File Renamer...</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>Dateien umbenennen ...</guimenuitem>

source: This command brings up the <link linkend="juk-rename-dialog">File Renamer Configuration dialog box</link>, where you can alter the way &juk; renames files for you.
de: Dieser Menüpunkt öffnet den Konfigurationsdialog <link linkend="juk-rename-dialog">Dateien umbenennen</link>, in dem Sie einstellen können, nach welchen Schemata &juk; die Dateien umbenennen soll.

source: Additionally &juk; has the common &kde; <guimenu>Settings</guimenu> and <guimenu>Help</guimenu> menu items, for more information read the sections about the <ulink url="help:/fundamentals/ui.html#menus-settings">Settings Menu</ulink> and <ulink url="help:/fundamentals/ui.html#menus-help">Help Menu</ulink> of the &kde; Fundamentals.
de: Zusätzlich hat &juk; die bekannten &kde;-Einträge im Menü <guimenu>Einstellungen</guimenu> und <guimenu>Hilfe</guimenu>, weitere Informationen dazu finden Sie in den Abschnitten über die Menüs <ulink url="help:/fundamentals/ui.html#menus-settings">Einstellungen</ulink> und <ulink url="help:/fundamentals/uihtml#menus-help">Hilfe</ulink> der &kde;-Grundlagen.

source: Keybinding Reference
de: Tastenbelegung

source: Key Combination
de: Tastenkombinationen (Kurzbefehle)

source: Action
de: Aktion

source: &Ctrl;<keycap>A</keycap>
de: &Ctrl;<keycap>Q</keycap>

source: Select all
de: Alles auswählen

source: <entry>Copy</entry>
de: <entry>Kopieren</entry>

source: Rename file
de: Datei umbenennen

source: Guess tags from the Internet.
de: Metadaten aus dem Internet raten.

source: Guess tags from the filename.
de: Metadaten aus dem Dateinamen raten.

source: New <link linkend="juk-search-playlists">search playlist</link>.
de: Neue <link linkend="juk-search-playlists">Wiedergabeliste aus Suche</link> erstellen.

source: New empty Playlist
de: Neue leere Wiedergabeliste

source: New playlist from folder.
de: Neue Wiedergabeliste aus Ordner erstellen.

source: Save changes to edited tags.
de: Geänderte Metadaten speichern.

source: Credits and License
de: Danksagungen und Lizenz

source: &juk; Copyright &copy; 2002-2013 &Scott.Wheeler;, Michael Pyne, and others.
de: &juk; Copyright &copy; 2002-2013 &Scott.Wheeler;, Michael Pyne, und Andere.

source: &juk; is developed and maintained by &Scott.Wheeler; &Scott.Wheeler.mail; and Michael Pyne <email>michael.pyne@kdemail.net</email>.
de: &juk; wird von &Scott.Wheeler; &Scott.Wheeler.mail; und Michael Pyne <email>michael.pyne@kdemail.net</email> entwickelt und gepflegt.

source: Many thanks to the following people who have contributed to &juk;:
de: Vielen Dank an die nachfolgenden Leute, die zu &juk; beigetragen haben:

source: &Daniel.Molkentin; &Daniel.Molkentin.mail; for system tray docking, <quote>inline</quote> tag editing, bug fixes, evangelism, moral support.
de: &Daniel.Molkentin;&Daniel.Molkentin.mail; für das Systemabschnittsymbol, den <quote>eingebetteten</quote> Metadaten-Editor, Fehlerkorrekturen, Evangelismus und moralische Unterstützung.

source: Tim Jansen <email>tim@tjansen.de</email> for the <application>GStreamer</application> port
de: Tim Jansen <email>tim@tjansen.de</email> für den<application>GStreamer</application>-Anschluss von &juk;.

source: Stefan Asserh&auml;ll <email>stefan.asserhall@telia.com</email> for global shortcut support.
de: Stefan Asserh&auml;ll <email>stefan.asserhall@telia.com</email> für die Unterstützung globaler Tastenkürzel.

source: Stephen Douglas <email>stephen_douglas@yahoo.com</email> for track announcement popups.
de: Stephen Douglas <email>stephen_douglas@yahoo.com</email> für das Titelankündigungsfenster.

source: &Frerich.Raabe; &Frerich.Raabe.mail; for automagical track data guessing, and bugfixes.
de: &Frerich.Raabe;&Frerich.Raabe.mail; für automatisches raten der Stückdaten und Fehlerkorrekturen.

source: Zack Rusin <email>zack@kde.org</email> for more automagical things, including MusicBrainz support.
de: Zack Rusin <email>zack@kde.org</email> für mehrere automatische Dinge, auch MusicBrainz-Support.

source: Adam Treat <email>manyoso@yahoo.com</email> for co-conspiring in MusicBrainz wizardry.
de: Adam Treat <email>manyoso@yahoo.com</email> für die Mitarbeit am MusicBrainz-Support.

source: Matthias Kretz <email>kretz@kde.org</email> for being the friendly neighborhood &arts; guru.
de: Matthias Kretz <email>kretz@kde.org</email>, den freundlichen &arts;-Guru in der Nachbarschaft.

source: Maks Orlovich <email>maksim@kde.org</email> for making &juk; friendlier to people with terabytes of music.
de: Maks Orlovich <email>maksim@kde.org</email> für Ideen, die Leuten mit Terabytes von Musik das Leben mit &juk; leichter machen.

source: Antonio Larrosa Jimenez <email>larrosa@kde.org</email> for the &DCOP; interface.
de: Antonio Larrosa Jimenez <email>larrosa@kde.org</email> für die &DCOP;-Schnittstelle.

source: Allan Sandfield Jensen <email>kde@carewolf.com</email> for the <acronym>FLAC</acronym> and <acronym>MPC</acronym> support.
de: Allan Sandfield Jensen <email>kde@carewolf.com</email> für die Unterstützung von<acronym>FLAC</acronym> und <acronym>MPC</acronym>.

source: Nathan Toone <email>nathan@toonetown.com</email> for the Album cover manager.
de: Nathan Toone <email>nathan@toonetown.com</email> Cover-Verwaltung von Alben.

source: Pascal Klein <email>4pascal@tpg.com.au</email> for the splash screen.
de: Pascal Klein <email>4pascal@tpg.com.au</email> für den Startbildschirm.

source: Laurent Montel <email>montel@kde.org</email> for the porting to &kde; 4 when no one else around.
de: Laurent Montel <email>montel@kde.org</email> für die Portierung auf KDE 4, als kein anderer es tun wollte.

source: Georg Grabler <email>georg@grabler.net</email> for the &kde; Platform porting efforts.
de: Georg Grabler <email>georg@grabler.net</email> für die weitere Portierung auf die &kde;-Plattform.

source: Martin Sandsmark <email>martin.sandsmark@kde.org</email> for the Last.fm scrobbling support, lyrics, prepping for &kde; Frameworks.
de: Martin Sandsmark <email>martin.sandsmark@kde.org</email> für die Unterstützung der Last.fm-Übermittlung, Liedtexte, Vorbereitung für &kde;-Frameworks.

source: Eike Hein <email>hein@kde.org</email> for the MPRIS2 interface implementation.
de: Eike Hein <email>hein@kde.org</email> für die Implementierung der MPRIS2-Schnittstelle.

source: Documentation Copyright &copy; 2003, &Lauri.Watts;, and copyright &copy; 2004-2013 Michael Pyne.
de: Copyright der Dokumentation &copy; 2003, &Lauri.Watts;, und &copy; 2004-2013 Michael Pyne.

source: CREDIT_FOR_TRANSLATORS
de: <para>Übersetzung Patrick Trettenbrein<email>patrick.trettenbrein@kdemail.net</email></para>
