Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdemultimedia/juk.po
Languages: de

source: The &juk; Handbook
de: Das Handbuch zu &juk;

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Patrick</firstname><surname>Trettenbrein</surname><affiliation><address><email>patrick.trettenbrein@kdemail.net</email></address></affiliation><contrib>Übersetzer</contrib></othercredit> <othercredit role="translator"><firstname>Arnold</firstname><surname>Krille</surname><affiliation><address><email>arnold@arnoldarts.de</email></address></affiliation><contrib>Korrekturleser</contrib></othercredit>

source: &juk; is a jukebox, tagger and music collection manager.
de: &juk; ist Jukebox, Metadaten-Editor und ein Programm zur Verwaltung von Musiksammlungen.

source: tagger
de: Metadaten-Editor

source: Introduction
de: Einführung

source: &juk; is, well, a jukebox. As is typical with many jukebox applications, &juk; allows you to edit the <quote>tags</quote> of your audio files, and manage your collection and playlists.
de: &juk; ist eine Jukebox. Und wie mit vielen anderen Jukebox-Anwendungen auch, können Sie mit &juk; die <quote>Metadaten</quote> Ihrer Musikdatei bearbeiten und Ihre Sammlung und Wiedergabelisten verwalten.

source: Using &juk;
de: &juk; verwenden

source: Here's a screenshot of &juk;
de: Ein Bildschirmfoto von &juk;

source: Screenshot of &juk; in action.
de: Ein Bildschirmfoto von &juk; in Aktion.

source: &juk; maintains a list of all files that it knows about. This is called the <guilabel>Collection List</guilabel>. The collection list is specific to &juk; and is not shared with other applications.
de: &juk; enthält eine Liste aller Dateien von denen es weiß, dass sie sich auf dem Rechner befinden. Diese wird <guilabel>Sammlungsliste</guilabel> genannt. Die Sammlungsliste ist speziell für &juk; und wird nicht von anderen Programmen verwendet.

source: Independent of the Collection List, are playlists. You can have as many playlists as you want. You can use &juk; created playlists with other media players (such as &amarok; or <application>xmms</application>) and you can manage playlists created in those applications from within &juk;.
de: Unabhängig von der Sammlungsliste sind Wiedergabelisten. Es können so viele Wiedergabelisten verwaltet werden, wie erwünscht. Erstellte Wiedergabelisten können auch mit anderen Abspielprogrammen (wie zum Beispiel &amarok; oder <application>XMMS</application>) abgespielt werden, und dort erstellte Wiedergabelisten können in &juk; verwendet werden.

source: You can add files to the Collection List individually, using <menuchoice><guimenu>File</guimenu><guimenuitem>Open ...</guimenuitem></menuchoice> and selecting them from a standard &kde; file dialog. You can add entire folders using <menuchoice><guimenu>File</guimenu><guimenuitem>Manage Folders...</guimenuitem></menuchoice>. Folders added this way will be rescanned every time you start &juk;. You can even define folders inside these folders that will be excluded from scan. You can force the folders to be rescanned by right-clicking on the <guilabel>Collection List</guilabel> icon, and selecting <guimenuitem>Reload</guimenuitem>.
de: Einzelne Dateien können zur Sammlungsliste über den Menüpunkt <menuchoice><guimenu>Datei</guimenu><guimenuitem>Öffnen ...</guimenuitem></menuchoice> und der Auswahl der Dateien mittels des Standard-&kde;-Dateidialogs hinzugefügt werden. Ganze Ordner können über den Menüpunkt <menuchoice><guimenu>Datei</guimenu><guimenuitem>Ordner verwalten ...</guimenuitem></menuchoice> in die Sammlungsliste aufgenommen werden. Ordner, die Sie auf diese Weise hinzugefügt haben, werden bei jedem Start von &juk; neu eingelesen.Es können aber auch Unterordner in den Ordner für die Sammlungsliste vom Einlesen ausgeschlossen werden. Sie können alle Ordner, die Sie bereits für ihre Sammlungsliste eingelesen haben, mit einem Rechtsklick auf das Symbol der <guilabel>Sammlungsliste</guilabel> und Auswahl von <guimenuitem>Erneut laden</guimenuitem> nochmals einlesen, also aktualisieren.

source: Adding a song to a playlist will automatically add its file to the Collection List, but adding a file to the Collection List won't automatically add the song to any playlists.
de: Das Hinzufügen eines Stücks zu einer Wiedergabeliste wird die Datei des Stücks automatisch zur Sammlungsliste hinzufügen, aber das Hinzufügen einer Datei zur Sammlungsliste wird das Stück nicht automatisch zu einer Wiedergabeliste hinzufügen.

source: You can quickly create a playlist from your entire Collection List, by &RMB; clicking on the <guilabel>Collection List</guilabel> icon, and choosing <guimenuitem>Duplicate</guimenuitem>. The resulting playlist is a normal playlist, and editing it will not affect the <guilabel>Collection List</guilabel>.
de: Sie können ganz einfach eine Wiedergabeliste aus ihrer vollständigen Sammlungsliste erstellen, indem sie einen Rechtsklick auf das Symbol <guilabel>Sammlungsliste</guilabel> machen und dort den Menüpunkt <guimenuitem>Duplizieren</guimenuitem> auswählen. Die erstellte Wiedergabeliste ist eine normale Wiedergabeliste, daher wird das Verändern dieser Wiedergabeliste nicht die <guilabel>Sammlungsliste</guilabel> verändern.

source: You can add playlist files created outside &juk; individually by selecting them with <menuchoice><guimenu>File</guimenu><guimenuitem>Open ...</guimenuitem></menuchoice>. Any playlist files found in folders you add with <menuchoice><guimenu>File</guimenu><guimenuitem>Manage Folders...</guimenuitem></menuchoice> will also be added automatically.
de: Sie können einzelne Wiedergabelisten, die Sie nicht mit &juk; erstellt haben, mit <menuchoice><guimenu>Datei</guimenu><guimenuitem>Öffnen ...</guimenuitem></menuchoice> hinzufügen. Alle Wiedergabelisten in einem Ordner, den Sie mit dem Menüpunkt <menuchoice><guimenu>Datei</guimenu><guimenuitem>Ordner verwalten ...</guimenuitem></menuchoice> in die Sammlungsliste aufgenommen haben, werden automatisch hinzugefügt.

source: You can create a new empty playlist, a search playlist or a playlist from a folder by choosing <menuchoice><guimenu>File</guimenu><guisubmenu>New</guisubmenu></menuchoice> or the <guiicon>New</guiicon> icon on the toolbar. You will be prompted for a name, and then an icon for that playlist will appear in the playlist pane. You can now drag and drop files from the Collection List, or from other playlists, to your playlist. Use the <guiicon>Save</guiicon> icon or <menuchoice><guimenu>File</guimenu><guimenuitem>Save</guimenuitem></menuchoice> to save the playlist at any time.
de: Sie können eine neue leere Wiedergabeliste, eine Wiedergabeliste aus einer Suche oder Wiedergabeliste aus einem Ordner über den Menüpunkt <menuchoice><guimenu>Datei</guimenu><guisubmenu>Neu</guisubmenu></menuchoice> oder mit einem Klick auf das Symbol <guiicon>Neu</guiicon> in der Werkzeugleiste hinzufügen. Sie werden nach einem Namen für die neue Wiedergabeliste gefragt. Nach der Eingabe erscheint ein Symbol für die neue Wiedergabeliste in der Kontrollleiste. Jetzt können Sie Dateien mittels <quote>drag and drop</quote> von der Sammlungsliste zur Wiedergabeliste, oder von einer bestehenden oder zu Ihrer soeben erstellten Wiedergabeliste hinzufügen. Um die Änderungen in der Wiedergabeliste zu speichern klicken Sie auf das Symbol <guiicon>Speichern</guiicon> oder verwenden Sie den Menüpunkt <menuchoice><guimenu>Datei</guimenu><guimenuitem>Speichern</guimenuitem></menuchoice>.

source: The Song List
de: Die Stückliste

source: When you are viewing the Collection List, the main pane contains all the files that &juk; knows about. When you are viewing a playlist, only the songs that are in that playlist are shown. In either case, the appearance and behavior of the list is the same.
de: Wenn Sie sich die Sammlungsliste ansehen, enthält das Hauptfenster alle Dateien, die &juk; eingelesen hat. Wenn Sie sich eine Wiedergabeliste ansehen, werden nur die Stücke angezeigt, die sich in dieser Liste befinden. In beiden Fällen ist das Aussehen und das Verhalten der Liste identisch.

source: Each song takes one row in the display. There is a column for each metadata field that &juk; tracks. These columns correspond to the fields available to edit in the tag editor.
de: Jedes Stück nimmt eine Zeile im Anzeigefenster ein. Für jedes Metadaten-Feld, das &juk; verarbeitet, wird eine Spalte angezeigt. Diese Felder stimmen mit den Feldern überein, die man im Metadaten-Editor editieren kann.

source: You can reorder the list at any time by &LMB; clicking on the column header. This will first sort the files in ascending order based on the contents of that column. If you &LMB; click again on the same header, the files will be re-sorted in descending order.
de: Sie können die Liste jederzeit mit einem Linksklick auf den Spaltentitel ordnen. Dies wird die Einträge in aufsteigender Reihenfolge, basierend auf dem Inhalt der Spalten sortieren. Wenn Sie erneut einen Linksklick auf denselben Spaltentitel machen, werden die Dateien in absteigender Reihenfolge geordnet.

source: The columns are initially sized wide enough to show the longest entry available. You can resize the columns by placing your mouse cursor on the divider between two columns. When the cursor changes from a pointer, &LMB; click and drag in the direction you want to resize the columns.
de: Die Spalten sind anfänglich groß genug um den längsten Eintrag in der jeweiligen Spalte anzuzeigen. Sie können die Größe der Spalten ändern indem Sie ihren Mauszeiger auf den Teiler zwischen zwei Spalten bewegen. Dann können Sie nach einem Linksklick auf den Teiler bei gedrückter linker Maustaste die Größe der Spalte ändern.

source: You can reorder the columns by &LMB; clicking on a header and dragging the header to the left or right. You cannot drag past the edge of the window when doing this however, so you may need to scroll a little to the left or right, and repeat dragging the header, until you have placed it in your preferred position.
de: Sie können die Spaltentitel ordnen indem Sie einen Linksklick auf den gewünschten Titel machen und ihn entweder nach rechts oder links in die gewünschte Position ziehen. Sie können ihn jedoch nicht über den Rand des Fensters hinaus bewegen, sodass Sie etwas nach rechts oder links scrollen und den Titel erneut bewegen müssen, bis er sich in der gewünschten Position befindet.

source: You can hide or unhide columns by &RMB; clicking on a column header, and clicking on the name of the column to change.
de: Sie können Spalten ausblenden oder ausgeblendete Spalten anzeigen lassen, indem Sie einen Rechtsklick auf einen Spaltentitel machen und dort die anzuzeigende oder auszublendende Spalte an oder abwählen.

source: &LMB; double clicking on a file will play it with the built-in player. If another song was already playing, it will stop, and the new song will play.
de: Ein Doppelklick mit der linken Maustaste auf ein Stück wird dieses mit dem integrierten Abspielprogramm wiedergeben. Wenn bereits ein anders Stück gespielt wird, wird dessen Wiedergabe gestoppt und die Wiedergabe des neu ausgewählten Stückes beginnt.

source: &RMB; clicking on a file offers you several options:
de: Ein Klick mit der &RMBn; auf ein Stück bringt ein Menü zum Vorschein:

source: Add to Play Queue
de: An die Warteschlange anhängen

source: This will start playing the file as soon as the current song is over. If no song is playing, the file will be played when you next hit the <guiicon>Play</guiicon> button. If you have already chosen the <guimenuitem>Add to Play Queue</guimenuitem> option on a different file, then this file will override that selection.
de: Dies wird das Stück abspielen nachdem das zurzeit spielende Stück vorüber ist. Wenn gerade kein Stück spielt wird die Datei abgespielt wenn Sie das nächste mal den Knopf <guiicon>Wiedergabe</guiicon> drücken. Falls Sie die Funktion <guimenuitem>An die Warteschlange anhängen</guimenuitem> bereits für ein anderes Stück festgelegt hatten, wird anstatt des bereits festgelegten Stücks das neu ausgewählte abgespielt.

source: <guimenuitem>Cut</guimenuitem>
de: <guimenuitem>Ausschneiden</guimenuitem>

source: <guimenuitem>Copy</guimenuitem>
de: <guimenuitem>Kopieren</guimenuitem>

source: <guimenuitem>Paste</guimenuitem>
de: <guimenuitem>Einfügen</guimenuitem>

source: Remove from Playlist
de: Aus der Wiedergabeliste entfernen

source: If you are viewing the Collection List, choosing this action will remove the file from the list, and will also remove all corresponding entries for this song from all playlists. You should note that if this file is in a folder that &juk; scans on startup, it will be readded to the Collection List the next time you start up &juk; but it won't be automatically added to any playlists.
de: Wenn Sie ein Stück in der Sammlungsliste markiert haben und diese Aktion auswählen, wird das Stück aus der Sammlungsliste und allen in &juk; geladenen Wiedergabelisten gelöscht. Sie sollten beachten, dass, wenn sich die Datei, die Sie gelöscht haben, in einem Ordner befindet, den &juk; beim Starten einliest, das Stück automatisch wieder zur Sammlungsliste hinzugefügt wird, wenn Sie &juk; das nächste Mal starten. Allerdings wird es nicht automatisch wieder zu einer Wiedergabeliste hinzugefügt.

source: If you are viewing a playlist, <guimenuitem>Remove from Playlist</guimenuitem> will simply remove the song from the playlist.
de: Wenn Sie eine Wiedergabeliste anzeigen lassen und dort ein Stück markiert haben, wird die Option <guimenuitem>Aus der Wiedergabeliste entfernen</guimenuitem> das Stück nur aus der Wiedergabeliste entfernen.

source: Edit <replaceable>Column Title</replaceable>
de: <replaceable>Spaltentitel</replaceable> bearbeiten

source: Will allow you to edit the currently highlighted song, in the column you clicked in. For example, if you do not have the tag editor visible, and you are busy creating a playlist, but you notice a mis-spelling in an artist name, you can edit it directly with this menu item.
de: Erlaubt Ihnen das aktuell ausgewählte Stück in der Spalte, in der Sie es angeklickt haben, zu bearbeiten. Zum Beispiel: Wenn Sie den Metadaten-Editor gerade nicht angezeigt haben und Sie schnell eine Wiedergabeliste erstellen wollen, Sie aber einen Rechtschreibfehler in einem Künstlernamen bemerkt haben, können Sie diesen direkt über diesen Menüpunkt bearbeiten.

source: Changes made in this manner are always saved immediately as soon as you click elsewhere and are finished editing.
de: Änderungen die auf diese Weise durchgeführt wurden werden immer gespeichert, sobald Sie irgendwo anders hinklicken und damit das Bearbeiten beenden.

source: This menu item will be disabled if &juk; detects that the track you have selected is read-only.
de: Dieser Menüpunkt wird allerdings nicht verfügbar sein wenn &juk; bemerkt, dass Sie für das ausgewählte Stück nur Leserechte besitzen.

source: Refresh
de: Aktualisieren

source: This will reload the tag information of the selected files, in case the files have been changed while &juk; was running.
de: Diese Option wird die Metadaten des ausgewählten Stücks erneut laden, vorausgesetzt, die Metadaten wurden geändert, während &juk; gestartet war.

source: Delete
de: Löschen

source: This will remove the file from the Collection List, remove all entries for the song in all playlists, and delete the file from your disk. You cannot undo this, although you will be asked to confirm your choice. Use this with caution.
de: Dies wird das Stück aus der Sammlungsliste und allen Wiedergabelisten löschen, weiter wird die zum Stück gehörige Datei von der Festplatte gelöscht. Dieser Vorgang kann nicht rückgängig gemacht werden, deshalb müssen Sie ihn bestätigen bevor er ausgeführt wird. Benutzen Sie dies mit Vorsicht.

source: Guess Tag Information
de: Metadaten raten

source: This will make &juk; try to guess information such as the Artist and Title of a song. &juk; employs different methods of guessing:
de: Mit dieser Aktion wird versucht, die Metadaten wie Künstler und Titel eines Stücks zu erraten. &juk; verwendet verschiedene Methoden:

source: From File Name
de: Vom Dateinamen

source: &juk; will try to guess the tags of the song based on its filename. For example, a song name such as <filename>Roxette - You've Got the Look.mp3</filename> would guess Roxette for the artist and You've Got the Look as the title. You can adjust the way &juk; guesses for tags by selecting <menuchoice><guimenu>Settings </guimenu><guimenuitem>Tag Guesser...</guimenuitem></menuchoice>, which will open the <link linkend="juk-tag-guesser-configuration">Tag Guesser dialog</link>. &juk; will not replace tags that it did not guess from the file name.
de: &juk; wird versuchen die Metadaten des Stücks basierend auf dem Dateinamen des Stücks zu ergänzen. Zum Beispiel werden einem Stück mit dem Dateinamen <filename>Roxette - You‚ve Got the Look.mp3</filename> der Eintrag <quote>Roxette</quote> als Künstler und <quote>You‘ve Got the Look</quote> als Titel in die Metadaten eingetragen. Sie können die Vorgehensweise, wie &juk; die Metadaten errät, über den Menüpunkt <menuchoice><guimenu>Einstellungen</guimenu><guimenuitem>Metadaten raten ...</guimenuitem></menuchoice> anpassen. &juk; ersetzt aus Dateinamen nur Metadaten, die es selbst hinzugefügt hat. Wenn Sie Informationen zum Beispiel per Hand eingegeben haben, werden diese von &juk; nicht verändert.

source: From Internet
de: Aus dem Internet

source: &juk; will try to guess the tags of the song by using the MusicBrainz program. You must have MusicBrainz installed for this command to work.
de: &juk; wird versuchen die Metadaten des Stückes zu erraten indem es das MusicBrainz-Programm verwendet. Um diese Option zu verwenden müssen Sie MusicBrainz auf Ihrem System installiert haben.

source: Rename File
de: Datei umbenennen

source: This will rename the selected files to conform to a given format. You must choose the way you want the files renamed first by selecting <menuchoice> <guimenu>Settings</guimenu><guimenuitem>File Renamer...</guimenuitem></menuchoice>. The resulting name of each file is based on its metadata tags. For example, the Ogg Vorbis song <quote>The Theme (Metroid)</quote> by Stemage could result in <filename>/usr/share/music/Stemage/The Theme (Metroid).ogg</filename>.
de: Dies wird die ausgewählten Stücke gemäß dem angegebenen Muster umbenennen. Um diese Option benutzen zu können, müssen Sie zuerst im Menüpunkt <menuchoice> <guimenu>Einstellungen</guimenu><guimenuitem>Dateien umbenennen ...</guimenuitem></menuchoice> einstellen, nach welchem Muster die Dateien umbenannt werden sollen. Der endgültige Name einer Datei basiert auf ihren Metadaten. Zum Beispiel kann das Ogg-Vorbis-Stück <quote>The Theme (Metroid)</quote> von Stemage in <filename>/usr/share/music/Stemage/The Theme (Metroid).ogg</filename> umbenannt werden.

source: Create Playlist From Selected Items
de: Wiedergabeliste aus den ausgewählten Stücken erstellen

source: This allows you to quickly create a playlist from songs in your Collection List. This function will prompt you for a name for the new playlist, and will then insert all of the songs that are selected into the new playlist.
de: Dies erlaubt Ihnen schnell und einfach eine Wiedergabeliste aus den Stücken Ihrer Sammlungsliste zu erstellen. Diese Funktion wird Sie zuerst nach einem Namen für die neue Wiedergabeliste fragen, danach werden alle aktuell ausgewählten Stücke zur neu erstellten Wiedergabeliste hinzugefügt.

source: Add Selected Items to Audio or Data CD
de: Ausgewählte Einträge zu Audio- oder Daten-CD hinzufügen

source: This allows you to quickly create a K3b &CD;-burning project from your selected songs. &juk; will ask you if you would like an Audio &CD; project or a Data &CD; project, unless K3b already has a project open.
de: Dies erlaubt Ihnen schnell ein K3b-CD-Projekt aus Ihren aktuell ausgewählten Stücken zu erstellen. &juk; wird Sie fragen, ob Sie eine Audio-&CD; oder eine Daten-&CD; erstellen wollen, wenn nicht bereits ein K3b-Projekt geöffnet ist.

source: If K3b is not already running, &juk; will start it up for you. After that, &juk; will add your selected files to the current K3b project. You can then save the project in K3b for burning later, or burn the &CD; right away.
de: Wenn K3b nicht bereits gestartet ist, wird &juk; es automatisch für Sie starten. Danach wird &juk; automatisch alle ausgewählten Stücke zum aktuellen K3b-Projekt hinzufügen. Sie können nun Ihr K3b-Projekt entweder speichern um es später zu brennen oder sofort eine CD aus dem Projekt erstellen.

source: &juk; Playlists
de: &juk;-Wiedergabelisten

source: A playlist is simply a collection of songs grouped by some category. For example, you may have a playlist of songs that you listen to while coding, while trying to sleep, or even when you need a laugh. &juk; supports several different types of playlists.
de: Eine Wiedergabeliste ist einfach eine Sammlung von Stücken zu einem Thema. Zum Beispiel könnten Sie eine Wiedergabeliste haben von Stücken die Sie hören wenn Sie programmieren, wenn Sie versuchen zu schlafen oder wenn Sie lachen wollen. &juk; unterstützt verschiedene Formen von Wiedergabelisten.

source: Normal playlists
de: Normale Wiedergabelisten

source: This is the most common kind of playlist. It is a playlist composed of files, just like the Collection List.
de: Die häufigste Wiedergabeliste. Sie ist aus Dateien zusammengestellt, wie die Sammlungsliste.

source: The history playlist
de: Verlauf

source: If you enable this playlist (by enabling <menuchoice><guimenu>View</guimenu><guimenuitem>Show History</guimenuitem></menuchoice>, this playlist will record every song that &juk; plays. The playlist will have an extra column, <guilabel>Time</guilabel>, which records the exact time and date the song played. The playlist doesn't start tracking the history until it is enabled, however.
de: Wenn Sie diese Wiedergabeliste aktivieren (Menüpunkt <menuchoice><guimenu>Ansicht</guimenu><guimenuitem>Verlauf anzeigen</guimenuitem></menuchoice>), wird diese Wiedergabeliste jedes Stück, das &juk; abspielt, aufzeichnen. Die Wiedergabeliste verfügt über eine zusätzliche Spalte <guilabel>Zeit</guilabel>, welche exakt aufzeichnet, zu welcher Zeit und zu welchem Datum das Stück abgespielt wurde. Die Wiedergabeliste verfolgt den Verlauf aber erst nach Aktivierung.

source: Search playlists
de: Wiedergabeliste durchsuchen

source: This is a playlist which is based off of a search. You can create a playlist like this by clicking <menuchoice> <guimenu>File</guimenu><guisubmenu>New</guisubmenu><guimenuitem>Search Playlist</guimenuitem></menuchoice>, or by clicking on the <link linkend="juk-advanced-search-dialog">Search Playlist</link> button on the toolbar.
de: Diese Funktion basiert auf einer Suche. Eine Wiedergabeliste dieser Form können Sie über den Menüpunkt <menuchoice><guimenu>Datei</guimenu><guisubmenu>Neu</guisubmenu><guimenuitem>Wiedergabeliste durchsuchen</guimenuitem></menuchoice> oder durch einen Klick auf den Knopf <link linkend="juk-advanced-search-dialog">Wiedergabeliste durchsuchen</link> neben der <link linkend="search-bar">Suchleiste</link> erstellen.

source: After creating this playlist, it will keep track of which songs in the Collection List match your criteria, and automatically update itself accordingly whenever the Collection List changes.
de: Nach dem Erstellen einer solchen Wiedergabeliste werden automatisch alle Stücke aus Ihrer Sammlungsliste zu denen von Ihnen angegebenen Kriterien passend zur Wiedergabeliste hinzugefügt. Die Wiedergabeliste wird sich automatisch aktualisieren wenn sich Stücke Ihrer Sammlungsliste ändern.
