Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdemultimedia/juk.po
Languages: de

source: Playlists are organized in the <guilabel>Playlist pane</guilabel>, which is the vertical bar at the left. In this pane is an icon for every playlist you have. There are different view mode for this pane, which can be selected from the <menuchoice><guimenu>View</guimenu><guisubmenu>View Modes</guisubmenu></menuchoice> menu.
de: Wiedergabelisten werden im <guilabel>Wiedergabelisten Bereich</guilabel>, dem senkrechten Bereich links im &juk; Programmfenster, aufgelistet. In diesem Fenster erscheint ein Symbol für jede Wiedergabeliste die Sie zu &juk; hinzugefügt haben. Für dieses Fenster gibt es verschiedene Ansichtsmöglichkeiten, welche Sie über den Menüpunkt <menuchoice><guimenu>Ansicht</guimenu><guisubmenu>Anzeigemodi</guisubmenu></menuchoice> auswählen können.

source: Default View mode
de: Standardanzeigemodus

source: This is the default view mode. In this mode, all the playlists are shown as large icons, one above the other in the view mode.
de: Dies ist der Standardansichtsmodus. In dieser Ansicht werden alle Wiedergabelisten als große Symbole untereinander dargestellt.

source: Compact View mode
de: Kompakter Anzeigemodus

source: This mode is similar to the Normal Viewmode, with the exception that the playlists are represented with horizontal bars with small icons instead of with square boxes.
de: Diese Anzeigemodus ist ähnlich dem normalen Anzeigemodus, mit dem Unterschied, dass die Wiedergabelisten durch horizontale Streifen mit kleinen Symbolen dargestellt werden.

source: Tree View mode
de: Baum-Anzeigemodus

source: This mode is the most powerful. This mode is just like the Compact viewmode, except that the Collection List is now the root of a tree of virtual playlists. The Collection List has three children nodes, Artist, Album, and Genre. Each of these node has children representing all of the entries from that specific category. For example, if your Collection List contains music from 4 different artists, you would have 4 entries under the artist node.
de: Dieser Anzeigemodus ist der komplexeste von allen. Er ist ähnlich dem kompakten Anzeigemodus, außer das die Sammlungsliste jetzt die <quote>Wurzel</quote> des Baumes darstellt. Die Sammlungsliste hat in dieser Ansicht drei <quote>Äste</quote>, sprich Unterpunkte: Künstler, Album und Genre. Jeder dieser Unterpunkte steht für die Einträge in der dazugehörigen Kategorie. Falls Sie zum Beispiel vier verschiedene Künstler in Ihrer Sammlungsliste haben, haben Sie im Unterpunkt Künstler noch einmal vier Unterpunkte mit den jeweiligen Künstlernamen.

source: One nifty feature of the tree view mode is something called drag-and-drop retagging. Simply select some files in the track list, and drag them onto one of the artist, album, or genre nodes under Collection List. The songs will automatically be retagged to match the item you dropped the tracks on. For example, if you drag a group of tracks onto a Genre called "Rock", all of the tracks will be retagged will a Genre tag of Rock.
de: Eines der raffinierten Extras des Baum-Ansichtsmodus ist das Aktualisieren der Metadaten durch Ziehen und Ablegen. Wählen Sie einige Dateien aus der Stückliste aus und ziehen Sie diese auf einen der Knoten Künstler, Album oder Genre in der Sammlungsliste und die Metadaten der Stücke werden automatisch geändert. Wenn Sie zum Beispiel einige Stücke auf ein Genre <quote>Rock</quote> ziehen, wird bei jedem der Stücke das Genre auf <quote>Rock</quote> geändert.

source: The &juk; Tag Editor
de: Der Metadaten-Editor von &juk;

source: For many file formats, it is practical to use the filename to describe the contents of the file: <quote><filename>Report for the board - June 2003.doc</filename></quote> for example, may be all the information you need in order to find that file again. Trying to capture all the useful information about a particular song however, could lead to filenames like this: <quote><filename>Type O Negative - The Glorious Liberation Of The Peoples Technocratic Republic Of Vinnland By The Combined Forces Of The United Territories Of Europa.mp3</filename></quote> or <quote><filename>Various Artists_15_The Smithsonian Collection of Classic Jazz Volume II_Jimmie Lunceford &amp; His Orchestra - Organ Grinder's Swing.mp3</filename></quote>. These are neither very practical to use, nor do they contain all of the useful information that you might have collected about the song. Adding the album, and track number, for example, to the first would make it even longer and more unmanageable, while still not telling you at a glance the year it was released, or what style of music it is, if you're not familiar with the artist.
de: Für viele Dateitypen ist es vorteilhaft, den Dateinamen einer Datei zu verwenden um deren Inhalt anzugeben: <quote><filename>Report für die Anschlagtafel - Juni 2004.sxw</filename></quote>. Dieser Dateiname enthält alle Informationen, die Sie wahrscheinlich benötigen um die Datei wieder zu finden. Wenn Sie aber versuchen, alle nützlichen Informationen über ein Stück in seinem Dateinamen anzugeben, führt dies zu Dateinamen wie: <quote><filename>Type O Negative - The Glorious Liberation Of The Peoples Technocratic Republic Of Vinnland By The Combined Forces Of The United Territories Of Europa.ogg</filename></quote> oder <quote><filename>Various Artists_15_The Smithsonian Collection of Classic Jazz Volume II_Jimmie Lunceford &amp; His Orchestra - Organ Grinder's Swing.mp3</filename></quote>. Solche Dateinamen sind nicht wirklich schön anzuschauen und auch nicht wirklich praktisch. Wenn Sie jetzt zu solch einer Datei auch noch Informationen wie Album und Stücknummer hinzufügen, wird der Dateiname immer länger und länger. Und trotzdem enthält der Dateiname noch nicht alle Informationen wie zum Beispiel den Musikstil oder das Jahr in dem das Stück veröffentlicht wurde.

source: The solution then, is to store this kind of metadata inside the files themselves. Mp3 and ogg files can also contain small snippets of text which you can use to describe the content of the file. There are several formats, but &juk; hides the details of the differences between them, and provides a standard way to edit a standard subset of well known tags for all your audio files.
de: Die Lösung dieses Problems ist es, einfach alle wichtigen Informationen innerhalb der Datei zu speichern. Mp3- und Ogg-Dateien können sogar kurze Texte enthalten in denen Sie den Inhalt der Datei kurz beschreiben können. Es gibt verschiedene Formate um solche Informationen innerhalb von Dateien abzuspeichern, aber &juk; verbirgt die Unterschiede zwischen ihnen und ermöglicht es, auf einem einzigen Weg alle Metadaten, die &juk; auslesen kann, zu bearbeiten.

source: &juk;'s full featured tag editor allows you to edit the tags in both mp3 and ogg files. You can edit single files or multiple files, and you can select a mix of mp3 and ogg files to edit. The only requirement is that you have write access to the files themselves; you cannot edit the tags of a file that is mounted from a &CD-ROM; for example.
de: &juk; ist ein vollwertiger Metadaten-Editor, der es Ihnen ermöglicht, die Metadaten von Mp3- und Ogg-Dateien zu bearbeiten. Sie können einzelne Dateien oder mehrere gleichzeitig bearbeiten. Wenn Sie mehrere Dateien gleichzeitig bearbeiten, spielt es keine Rolle, ob einige vom Typ Mp3 und einige vom Typ Ogg sind. Die einzige Voraussetzung um die Metadaten zu bearbeiten ist, dass Sie Schreibrechte für die Datei besitzen. Das heißt, Sie können keine Metadaten von Stücken bearbeiten, die sich zum Beispiel auf einer eingebundenen &CD-ROM; befinden.

source: Editing the Tags in a Single File
de: Metadaten einer einzelnen Datei ändern

source: To edit the tag in a single file, select it in either the collection list or any entries it has in any playlist. If the tag editor is not visible, enable it by choosing <menuchoice><guimenu>View</guimenu><guimenuitem>Show Tag Editor</guimenuitem></menuchoice>. The tag editor displays in the bottom of the list view.
de: Um die Metadaten einer einzelnen Datei zu ändern, muss die zu ändernde Datei entweder in der Sammlungsliste oder ein Eintrag der Datei aus einer Wiedergabeliste ausgewählt werden. Falls der Metadaten-Editor nicht sichtbar ist, können Sie ihn über den Menüpunkt <menuchoice><guimenu>Ansicht</guimenu><guimenuitem>Metadaten-Editor anzeigen</guimenuitem></menuchoice> anzeigen lassen. Er erscheint dann im unteren Bereich der Listenansicht.

source: Simply type into any of the editable fields to change the information. When you are done, &LMB; click back in the list, and you will be prompted to save your changes.
de: Um die Metadaten zu ändern, müssen Sie nur die gewünschte Information in das dafür vorgesehene Feld eingeben. Wenn Sie Ihre Eingabe beendet haben, klicken Sie mit der linken Maustaste auf die Listenansicht, und Sie werden aufgefordert, das Speichern Ihrer Änderungen zu bestätigen.

source: You may find that the tag editor remains disabled when you've clicked on a file. This happens when &juk; has detected that the track is read-only.
de: Sie haben vielleicht schon bemerkt, dass es sein kann, dass der Metadaten-Editor ausgegraut angezeigt wird, sodass Sie nichts ändern können, wenn Sie auf eine Datei klicken. Dies ist immer dann der Fall, wenn &juk; bemerkt hat, das Sie für das Stück nur Leserechte haben.

source: Tag Editor Fields
de: Felder des Metadaten-Editors

source: Artist Name:
de: Künstler:

source: The name of the Artist(s) who released the song.
de: Der Name des Künstlers / der Künstler, der/die das Stück veröffentlichte/n.

source: Track name:
de: Titel:

source: The name of the song.
de: Der Name des Stückes.

source: Album name:
de: Album:

source: The name of the album the song was released on.
de: Der Name des Albums auf dem das Stück veröffentlicht wurde.

source: The <quote>Style</quote> of the music. &juk; provides a list corresponding roughly to the informal id3 standard, but you are free to type your own entries in this list.
de: Der <quote>Stil</quote> der Musik (zum Beispiel: Rock). &juk; enthält bereits eine Liste von Genres konform zum ID3-Standard, aber Sie können auch Ihre eigenen Einträge zur Liste hinzufügen.

source: File name:
de: Dateiname:

source: The file name of the actual file on disk. You can edit this directly, and when you save, the file will be renamed.
de: Der Name der Datei auf dem Datenträger. Der Eintrag kann direkt bearbeitet werden. Die Datei wird dann beim Speichern umbenannt.

source: Track:
de: Stück:

source: The position of the track on the original recording.
de: Die Position des Stückes auf der Originalaufnahme.

source: Year:
de: Jahr:

source: The year the song was released.
de: Das Jahr in dem das Stück veröffentlicht wurde.

source: Length:
de: Länge:

source: This is not editable, it is simply shown for information.
de: Ist nicht veränderbar, wird nur zu Informationszwecken angezeigt.

source: Comment:
de: Kommentar:

source: You can add your own free text comment here, with additional notes &etc;
de: Hier können Sie Ihren eigenen Kommentar zum Stück einfügen.

source: You can explicitly and immediately save your changes at any time using the <menuchoice><guimenu>Tagger</guimenu><guimenuitem>Save</guimenuitem></menuchoice> menu entry or by pressing <keycombo action="simul">&Ctrl;<keycap>T</keycap></keycombo>.
de: Sie können Ihre Änderungen jederzeit speichern, indem Sie entweder den Menüpunkt <menuchoice><guimenu>Metadaten</guimenu><guimenuitem>Speichern</guimenuitem></menuchoice> auswählen oder den Kurzbefehl <keycombo action="simul">&Ctrl;<keycap>T</keycap></keycombo> drücken.

source: Editing the Tags in Multiple Files
de: Bearbeiten der Metadaten von mehreren Dateien

source: You can select multiple files in the list view, and edit one or more fields in the tags for all files at once.
de: Sie können mehrere Dateien im Listenansicht-Fenster auswählen und ein oder mehrere Felder der Metadaten für alle Dateien bearbeiten.

source: Use &Shift; and the &LMB; to select a contiguous list of files, and &Ctrl; and &LMB; to select individual non-contiguous files.
de: Verwenden Sie die &Shift;taste und den Linksklick, um benachbarte Dateien auszuwählen, und &Ctrl; und den Linksklick um nicht benachbarte Dateien auszuwählen.

source: If the tag editor is not visible, you can enable it by choosing <menuchoice><guimenu>View</guimenu><guimenuitem>Show Tag Editor</guimenuitem></menuchoice>. The tag editor displays in the bottom of the list view.
de: Falls der Metadaten-Editor nicht sichtbar ist, können Sie ihn über den Menüpunkt <menuchoice><guimenu>Ansicht</guimenu><guimenuitem>Metadaten-Editor anzeigen</guimenuitem></menuchoice> jederzeit einblenden. Der Metadaten-Editor erscheint dann am unteren Rand der Listenansicht.

source: The tag editor behaves slightly differently when you have selected multiple files.
de: Der Metadaten-Editor verhält sich geringfügig anders, wenn Sie mehrere Dateien ausgewählt haben.

source: Each field in the tag editor will now show an <guilabel>Enable</guilabel> check box next to it. Any field that has exactly the same contents for all the files you selected, displays that content, and is enabled for editing, with the <guilabel>Enable</guilabel> check box checked.
de: Jedes Feld des Metadaten-Editors wird jetzt ein kleines Feld neben sich haben mit dem Sie es <guilabel>aktivieren</guilabel> können. Jedes Feld, dessen Inhalt bei allen ausgewählten Dateien gleich ist, wird diesen Inhalt anzeigen. Um ein Feld zu editieren, müssen Sie das kleine Feld neben dem Eingabefeld <guilabel>aktivieren</guilabel>.

source: Any field that does not have matching contents in all selected files is not initially editable, and does not display any contents at all.
de: Jedes Feld, das keinen übereinstimmenden Inhalt bei allen ausgewählten Dateien hat ist anfänglich nicht bearbeitbar, und zeigt keinen Inhalt an.

source: To change the content of any field, check the <guilabel>Enable</guilabel> check box if it is not already checked, and edit the field as you normally would.
de: Um den Inhalt eines Feldes zu ändern, müssen Sie dieses aktivieren, indem Sie das Ankreuzfeld <guilabel>Aktivieren</guilabel> neben dem Eingabefeld markieren, falls es nicht schon markiert ist. Dann können Sie den Inhalt des Feldes wie gewohnt editieren.

source: When you are done, &LMB; click back in the list view and you will be prompted to save your changes. The prompt dialog will show you a list of the affected files, so you have a chance to check that you are indeed altering the files you intended to.
de: Wenn Sie mit dem Bearbeiten aller Felder fertig sind, genügt ein Klick mit der &LMBn; in die Listenansicht, und Sie müssen das Speichern Ihrer Änderungen bestätigen. Der Speicherdialog zeigt Ihnen eine Liste der betroffenen Dateien an, damit Sie sichergehen können, dass Sie nur Dateien ändern, die Sie auch wirklich ändern wollen.

source: <title>The Rename File dialog</title>
de: <title>Umbenennen</title>

source: <screeninfo>The Rename File dialog</screeninfo>
de: <screeninfo>Der Dialog Umbenennen</screeninfo>

source: Screenshot of the Rename File dialog.
de: Ein Bildschirmfoto des Dialogs Umbenennen

source: The File Renamer Configuration dialog box is used to configure the Rename File action, which renames a song's based on the information contained within its metadata tags.
de: Der Einrichtungsdialog dieser Funktion wird benutzt, um einzustellen, wie ein Stück basierend auf seinen Metadaten umbenannt wird.

source: The whole Rename File feature is used to get consistent file names for your music collection (including moving the files if necessary). For example you may have some songs which appear on disk as <filename>01 - Title.mp3</filename> if you got them from <ulink url="http://amazon.com">Amazon</ulink>, while songs from <ulink url="http://ocremix.org/">OCRemix</ulink> might be <filename>Ailsean- Mega_Man_3_Mega_Fire_(OC_Remix).mp3</filename> or something along those lines.
de: Die Umbenennungsfunktion kann benutzt werden, um Ihrer Musiksammlung konsistente einheitliche Namen zu geben, einschließlich der Verschiebung von Dateien, falls erforderlich. Sie haben einige Stücke auf der Festplatte wie zum Beispiel <filename>01 - Title.mp3</filename>, wenn Sie sie von <ulink url="http://amazon.com">Amazon</ulink> heruntergeladen haben. Stücke von <ulink url="http://ocremix.org/">OCRemix</ulink>können Namen wie <filename>Ailsean- Mega_Man_3_Mega_Fire_(OC_Remix).mp3</filename> oder ähnlich haben.

source: Using the file renamer allows &juk; to rename those songs to something <quote>sane</quote> on-disk, such as <filename>Ailsean - Mega Fire.mp3</filename> and <filename>The Strokes - Reptilia.mp3</filename>. You can even include paths throughout to automatically sort the music (&eg; by year or album), like <filename>$HOME/Music/2003/The Strokes - Reptilia.mp3</filename>.
de: Mit der Umbenennung können solche Stücke in <quote>normale</quote> Namen auf der Festplatte umbenannt werden, wie zum Beispiel <filename>Ailsean - Mega Fire.mp3</filename> und <filename>The Strokes - Reptilia.mp3</filename>. Sie können sogar Pfadtrennzeichen dazwischen einfügen, um die Musikstücke automatisch zum Beispiel nach Jahr oder Albenname wie <filename>$HOME/Music/2003/The Strokes - Reptilia.mp3</filename> zu sortieren.

source: Doing this is as simple as activating the <quote>Rename File</quote> action, either from the <guimenu>Tagger</guimenu> menu, or right-clicking on the files. The default is the <keycombo>&Ctrl;<keycap>R</keycap></keycombo> shortcut. But before this is done you should setup how the files are to be renamed.
de: Dazu müssen Sie nur die Aktion <quote>Umbenennen</quote> entweder aus dem Menü <guimenu>Metadaten</guimenu> oder aus dem Kontextmenü benutzen, das Sie mit einem Klick der &RMBn; auf Dateien öffnen. Der Standardkurzbefehl ist <keycombo>&Ctrl;<keycap>R</keycap></keycombo>. Bevor Sie diese Funktion benutzen, sollten Sie einstellen, wie die Dateien umbenannt werden.

source: That is done from the above mentioned dialog that can be opened with <menuchoice><guimenu>Settings</guimenu><guimenuitem>File Renamer...</guimenuitem></menuchoice> menu item. You can define a destination path, by using a base music folder and then adding pieces to there. These path pieces would be based on the music metadata such as song title, artist, &etc;, and are added using the <guilabel>Add Category</guilabel> selector.
de: Diese Einrichtung erfolgt im oben genannten Dialog, der mit dem Menüeintrag <menuchoice><guimenu>Einstellungen</guimenu><guimenuitem>Dateien Umbenennen</guimenuitem></menuchoice> geöffnet wird. Sie können einen Zielpfad mit der Angabe eines Musikordners definieren und dann weitere Pfadteile hinzufügen. Diese Pfadteile basieren auf den Musik-Metadaten des Stücks wie Titel, Interpret &etc;. Weitere Pfadteile können mit <guilabel>Kategorie einfügen</guilabel> hinzugefügt werden.

source: Each "path piece" has a check box between it allowing a folder separator to be added.
de: Zwischen jedem Teil des „Pfads“ gibt es ein Ankreuzfeld, um Ordnertrennzeichen einzufügen.

source: The options for each piece, which simply control what happens if the appropriate metadata is empty, and allow a prefix/suffix when the entry is substituted in, can help you to make the renaming procedure more effective.
de: Die Einstellungen für jeden Teil des neuen Namens bestimmen den neuen Namen, wenn zugehörenden Metadaten für ein Stück nicht vorhanden sind. Es kann ein Präfix oder Suffix benutzt werden, wenn die Einträge ersetzt werden. Damit wird das Umbenennen noch effektiver.

source: <title>The Tag Guesser Configuration dialog</title>
de: <title>Einrichtung des Metadaten-Raters</title>

source: <screeninfo>The Tag Guesser Configuration dialog</screeninfo>
de: <screeninfo>Einrichtung des Metadaten-Raters</screeninfo>

source: Screenshot of the Tag Guesser Configuration dialog.
de: Bildschirmfoto der Einrichtung des Metadaten-Raters

source: The Tag Guesser Configuration dialog is used to configure the <guilabel>Guess from File Name</guilabel> action.
de: Der Dialog <quote>Einrichtung des Metadaten-Raters</quote> wird benutzt, um die Aktion <guilabel>Vom Dateinamen raten</guilabel> einzurichten.

source: In the dialog you will see a list on the left of different filename scheme patterns. &juk; includes an extensive set of defaults patterns to match most common filenaming styles. If you'd like to add a new scheme, click on the <guibutton>Add</guibutton> button, and type in your scheme and click on <guibutton>OK</guibutton>.
de: Im Dialogfenster sehen Sie links eine Liste mit den verschiedenen Dateinamensmustern. &juk; enthält eine umfangreiche Sammlung von Mustern um die am häufigsten verwendeten Schemata bei der Benennung von Dateien abzudecken. Wenn Sie ein neues Schema hinzufügen wollen, klicken Sie auf den Knopf <guibutton>Hinzufügen</guibutton>, geben Ihr neues Schema ein und klicken auf <guibutton>OK</guibutton>.

source: Here you can see the currently configured file name schemes which the tag editor uses to extract tag information from a file name. Each string may contain one of the following placeholders:
de: Diese Schemata werden von der aktuellen Einstellung im Metadaten-Editor verwendet, um aus dem Dateinamen mögliche Metadaten zu extrahieren. Jeder Eintrag kann folgende Platzhalter enthalten:

source: %t: Title
de: %t: Titel

source: %a: Artist
de: %a: Interpret

source: %T: Track
de: %T: Stücknummer

source: %c: Comment
de: %c: Kommentar

source: For example, the file name scheme <quote>[%T] %a - %t</quote> would match <quote>[01] Deep Purple - Smoke on the water</quote> but not <quote>(Deep Purple) Smoke on the water</quote>. For that second name, you would use the scheme <quote>(%a) %t</quote>.
de: So passt zum Beispiel das Schema <quote>[%T] %a – %t</quote> zu <quote>[01] Deep Purple – Smoke on the water</quote> aber nicht zu <quote>(Deep Purple) Smoke on the water</quote>. Für den zweiten Namen sollte dann das Schema <quote>(%a) %t</quote> verwendet werden. Die Reihenfolge der Schemata in dieser Liste gibt die Priorität an. Das von oben her erste passende wird verwendet.

source: &juk; will try the schemes you have listed one at a time, starting at the top of the list. The first scheme which results in a match will be the scheme used to guess the song's tags. Some songs may match more than one scheme. You can make sure that the correct scheme matches first by selecting the scheme in the list box and then using the arrow buttons to move it to the top of the list.
de: &juk; versucht, die vorhandenen Schemata der Reihe nach durchzugehen, beginnend am Anfang der Liste. Das erste Schema, das auf den Dateinamen zutrifft, wird verwendet um die Metadaten des Stücks zu ergänzen. Auf einige Dateien wird eventuell mehr als ein Schema zutreffen. Um sicherzustellen, dass das richtige Schema verwendet wird, müssen Sie dieses in der Liste markieren und mit den Pfeilknöpfen an die Spitze der Liste bewegen.

source: You can also edit or remove a scheme from the list. Just select the scheme in the list, and use the <guibutton>Modify</guibutton> button to change the scheme, or the <guibutton>Remove</guibutton> button to remove the scheme from the list.
de: Sie können vorhandene Schemata auch bearbeiten oder aus der Liste löschen. Um ein Schema zu bearbeiten oder zu löschen müssen Sie es markieren und dann entweder auf <guibutton>Ändern</guibutton> oder auf <guibutton>Entfernen</guibutton> klicken.

source: <title>The Advanced Search dialog</title>
de: <title>Erweiterte Suche</title>

source: <screeninfo>The Advanced Search dialog</screeninfo>
de: <screeninfo>Erweiterte Suche</screeninfo>

source: Screenshot of the Advanced Search Dialog.
de: Bildschirmfoto des erweiterten Suchdialogs
