Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdemultimedia/kcontrol_cddbretrieval.po
Languages: de

source: CDDB Retrieval
de: CDDB-Abfrage

source: Developer
de: Entwickler

source: Reviewer
de: Gegengelesen von

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Gregor</firstname><surname>Zumstein</surname><affiliation><address><email>zumstein@ssd.ethz.ch</email></address></affiliation><contrib>Übersetzung</contrib></othercredit><othercredit role="translator"><firstname>Frank</firstname><surname>Schütte</surname><affiliation><address><email>f.schuette@t-online.de</email></address></affiliation><contrib>Überarbeitung der Übersetzung</contrib></othercredit>

source: The module <guilabel>CDDB Retrieval</guilabel> is divided in the <guilabel>Lookup</guilabel> tab and the <guilabel>Submit</guilabel> tab.
de: Das Modul <guilabel>CDDB-Abfrage</guilabel> besteht aus den Karteikarten <guilabel>Abfrage</guilabel> und <guilabel>Übertragung</guilabel>.

source: The Lookup Tab
de: Die Karteikarte Abfrage

source: <screeninfo>The <guilabel>Lookup</guilabel> tab</screeninfo>
de: <screeninfo>Der Dialog <guilabel>Abfrage</guilabel></screeninfo>

source: <phrase>The <guilabel>Lookup</guilabel> tab</phrase>
de: <phrase>Der Dialog <guilabel>Abfrage</guilabel></phrase>

source: The <guilabel>Lookup</guilabel> tab sets up the <acronym>CDDB</acronym> functions of &kde;.
de: Die Karteikarte <guilabel>Abfrage</guilabel> ermöglicht die Einstellung der <acronym>CDDB</acronym>-Funktionen von &kde;.

source: You can select the options <guilabel>Enable MusicBrainz lookup</guilabel> or <guilabel>Enable freedb lookup</guilabel>.
de: Sie können die Optionen <guilabel>MusicBrainz-Abfrage aktivieren</guilabel> oder <guilabel>Freedb-Abfrage aktivieren</guilabel> wählen.

source: The <guilabel>Freedb server</guilabel> section determines which CDDB mirror site is used by &kde; to get album information. You can enter a server name, port number and protocol using the text boxes and drop down boxes or you can click the <guibutton>Show Mirror List</guibutton> button. Clicking this button will open a new window with a list of CDDB mirrors and their locations. Simply select the server you want from the list and click <guibutton>OK</guibutton>.
de: Im Abschnitt <guilabel>Freedb-Server</guilabel> stellen Sie ein, welcher CDDB-Spiegelserver von &kde; benutzt wird, um an die Albuminformationen zu kommen. Sie können den Server, die Portnummer und das Protokoll mithilfe der Textfelder und Auswahlfelder eingeben, oder auf <guibutton>Liste der Spiegelserver anzeigen</guibutton> klicken. Dieser Knopf öffnet ein neues Fenster mit einer Liste von CDDB-Spiegelservern und deren &URL;s. Wählen Sie einen Server aus und klicken auf <guibutton>OK</guibutton>.

source: The section labeled <guilabel>Cache Locations</guilabel> lets you determine where the CDDB information is saved on your computer. To add a folder, enter the folder location in the text box at the top of the section and click <guibutton>Add</guibutton>. You can also select a folder by clicking on the blue file folder to the right of the text box. To delete a folder, click on the folder name once with the &LMB; and click <guibutton>Remove</guibutton>. You can change the order the folders are searched by clicking on the folder name and clicking on the <guibutton>Move Up</guibutton> and <guibutton>Move Down</guibutton> buttons.
de: Im Abschnitt <guilabel>Lokaler Speicher</guilabel> können Sie eingeben, wo &kde; die CDDB-Informationen auf Ihrem Rechner speichert. Um einen Ordner hinzuzufügen, geben Sie den Pfad zum Ordner in das Textfeld am oberen Ende des Abschnitts ein und drücken dann <guibutton>Hinzufügen</guibutton>. Alternativ können Sie auch auf das blaue Symbol des Dateiordners rechts vom Textfeld drücken. Um einen Ordner zu entfernen, drücken Sie einmal auf den Ordnernamen mit der &LMB; in der Liste und drücken dann <guibutton>Entfernen</guibutton>. Sie können die Reihenfolge ändern, in der &kde; die Ordner durchsucht, indem Sie auf den Ordner auswählen und <guibutton>Nach oben</guibutton> und <guibutton>Nach unten</guibutton> benutzen.

source: The <guibutton>Help</guibutton> button opens the this help contents page. The <guibutton>Defaults</guibutton> button restores the default values of all entries in this dialog; <guibutton>OK</guibutton> saves the current settings and exits; <guibutton>Apply</guibutton> saves the current settings without exiting.
de: Der Knopf <guibutton>Hilfe</guibutton> öffnet diese Hilfeseiten. Der Knopf <guibutton>Voreinstellungen</guibutton> setzt alle Einträge auf die Standardeinstellungen zurück. <guibutton>OK</guibutton> speichert die aktuellen Einstellungen und beendet den Einrichtungsdialog. <guibutton>Anwenden</guibutton> speichert die aktuellen Einstellungen, ohne den Dialog zu verlassen.

source: The Submit Tab
de: Die Karteikarte Übertragung

source: The Submit tab
de: Die Karteikarte Übertragung

source: The <guilabel>Submit</guilabel> tab sets up connection to a mail server or a web server to submit new <acronym>CDDB</acronym> entries. This is useful if you do not have your own system configured as a server.
de: Die Karteikarte <guilabel>Übertragung</guilabel> erlaubt Einstellungen, um eigene, neue Einträge an <acronym>CDDB</acronym>-Server zu übertragen. Das ist nützlich, falls Sie Ihr System nicht als Server eingerichtet haben.

source: If you plan to submit a CDDB entry, enter your email address into the first textbox, then you must decide between submitting between &HTTP; and submitting the entry as an email (via &SMTP;).
de: Falls Sie einen CDDB-Eintrag übertragen wollen, geben Sie ihre E-Mail-Adresse in das erste Textfeld ein. Dann müssen Sie entscheiden, ob Sie die Daten über &HTTP; oder als E-Mail (über &SMTP;) übertragen wollen.

source: It is simpler to submit new entries using &HTTP;. Some firewalls block this traffic. If your firewall prevents you from sending new entries using &HTTP;, you can use &SMTP;.
de: Es ist einfacher, die neuen Einträge über &HTTP; zu senden. Einige Firewalls blockieren diesen Weg aber. Falls Ihre Firewall Sie daran hindert, neue Einträge über &HTTP; zu übertragen, können Sie &SMTP; benutzen.

source: First select either <guilabel>&HTTP;</guilabel> or <guilabel>SMTP (Email)</guilabel> to determine which protocol to use.
de: Zuerst wählen Sie entweder <guilabel>&HTTP;</guilabel> oder <guilabel> SMTP (E-Mail)</guilabel> zur Bestimmung des zu verwendenden Protokolls.

source: Using &HTTP; to send CDDB information
de: &HTTP; zum Senden von CDDB-Informationen

source: You can enter a server name or port number in the text boxes provided. If you want to send this information to the international servers, you do not need to change anything.
de: Sie können einen Servernamen oder eine Portnummer in die vorhandenen Textfelder eintragen. Falls Sie diese Informationen zu den internationalen Servern senden wollen, brauchen Sie nichts zu ändern.

source: Using &SMTP; (Email) to send CDDB information
de: &SMTP; (E-Mail) zum Senden von CDDB-Informationen

source: To prepare to submit information using email, enter your email address in the text box labeled <guilabel>Reply-To:</guilabel>, your email server in the text box labeled <guilabel>SMTP server:</guilabel> and select the port number in the spinbox labeled <guilabel>Port:</guilabel>.
de: Zur Vorbereitung der Informationsübertragung über eine E-Mail tragen Sie ihre E-Mail-Adresse in das Textfeld <guilabel>Antwort an</guilabel> ein, sowie Ihren E-Mail-Server in das Textfeld <guilabel>SMTP-Server</guilabel>. Die Portnummer können in dem Drehfeld <guilabel>Port</guilabel> auswählen.

source: If you need to use a password to send email using the email server, place a mark in the check box labeled <guilabel>Server needs authentication</guilabel> and enter your username in the text box labeled <guilabel>Username</guilabel>.
de: Falls Sie zum Senden der E-Mail über den E-Mail-Server ein Passwort verwenden müssen, markieren Sie das Ankreuzfeld <guilabel>Der Server verlangt eine Authentifizierung</guilabel> und füllen das Textfeld <guilabel>Benutzername</guilabel> mit Ihrem Benutzernamen.

source: The CD Database Editor
de: Der &CD;-Dateneditor

source: <screeninfo>The &CD; Database Editor</screeninfo>
de: <screeninfo>Der &CD;-Dateneditor</screeninfo>

source: <phrase>The &CD; Database Editor</phrase>
de: <phrase>Der &CD;-Dateneditor</phrase>

source: The &CD; Database Editor allows you to modify, download, save, annotate, and upload <link linkend="cddb-support"><acronym>CDDB</acronym> (Compact Disc Data Base)</link> entries.
de: Der &CD;-Dateneditor erlaubt die Veränderung, das Herunterladen, die Kommentierung und das Heraufladen von <link linkend="cddb-support"><acronym>CDDB</acronym> (Compact Disc Data Base)</link>-Einträgen.

source: If there is an entry in your local <acronym>CDDB</acronym> tree (see the <link linkend="cddb-page">CDDB subsection</link> in the Configuration chapter) for the &CD; in your &CD-ROM; drive, or if the disc could be found in the freedb, you will see the name of the artist and the title of the &CD; in the <guilabel>Artist:</guilabel> and <guilabel>Title</guilabel> fields and a list of tracks with song titles in the <interface>Tracks</interface> selection box. Otherwise, you will see a list of tracks and play times without titles.
de: Falls die &CD; in Ihrem &CD-ROM;-Laufwerk entweder in Ihrem lokalen <acronym>CDDB</acronym>-Verzeichnisbaum (siehe auch <link linkend="cddb-page">CDDB</link> im Abschnitt Einrichtung) oder in der freedb-Datenbank gefunden wurde, werden der Künstlername und der &CD;-Titel in den Feldern <guilabel>Künstler</guilabel> und <guilabel>Titel</guilabel> und eine Stückliste in der Liste <interface>Stücke</interface> angezeigt. Anderenfalls sehen Sie eine Liste der Stücknummern und Stücklängen ohne Titel.

source: You can make an annotation for the entire disc with the <guilabel>Comment</guilabel> field under the <guilabel>Title</guilabel> field, or for a selected track in the <guilabel>Tracks</guilabel> selection box with the adjacent <guibutton>Comment</guibutton> button. If you select a track in the <guilabel>Tracks</guilabel> selection box, the title, if present, will appear in the <guilabel>Title</guilabel> field below. You can type a title for the track in the box, or edit the entry to suit your needs. Press the <keycap>Return</keycap> key on your keyboard, and the text will appear in the proper line in the selection box.
de: Sie können einen Kommentar für die gesamte CD im Feld <guilabel>Kommenar</guilabel> unterhalb von <guilabel>Titel</guilabel> oder für ein bestimmtes Stück rechts von <guilabel>Stücke</guilabel> ebenfalls im Feld <guibutton>Kommentar</guibutton> hinzufügen. Falls ein Stück im Auswahlfeld <guilabel>Stücke</guilabel> ausgewählt ist, erscheint, falls vorhanden, der zugehörige Titel im Feld <guilabel>Titel</guilabel>. Nun können Sie einen Titel für das Stück eintragen oder den vorhandenen nach eigenen Wünschen ändern. Durch Drücken auf die <keycap>Eingabetaste</keycap> auf der Tastatur werden die Änderungen in die zugehörige Zeile der Auswahlliste übernommen.

source: Once all tracks have been given titles and the <guilabel>Artist:</guilabel> and <guilabel>Title</guilabel> fields have been filled out, you can press the <guibutton>Upload</guibutton> button to send your submission by email to freedb.
de: Nachdem Sie alle Stücke mit den richtigen Stücktiteln versehen und die Felder <guilabel>Künstler</guilabel> und <guilabel>Titel</guilabel> ausgefüllt haben, können sie durch Klicken auf <guibutton>Hochladen</guibutton> Ihre Einträge per E-Mail an freedb abschicken.

source: You will be prompted to select a category for the submission. The <guilabel>Disc ID</guilabel> section displays the 32 bit <acronym>ID</acronym> code used by freedb to identify a compact disc. Above the <acronym>ID</acronym> code is the category of the <guilabel>freedb</guilabel> entry. These categories correspond to the subfolders tree of the folder chosen in the <guilabel>freedb Base Folder:</guilabel> in the <link linkend="cddb-page"><guilabel>CDDB</guilabel> page</link> of the configuration window.
de: Sie werden nach einer Kategorie für den Eintrag gefragt. Das Feld <guilabel>CD-ID</guilabel> zeigt die 32-Bit-<acronym>ID</acronym> an, der von freedb zur Identifikation der CD verwendet wird. Oberhalb der <acronym>ID</acronym> befindet sich der Eintrag für die <guilabel>freedb</guilabel>-Kategorien. Die Kategorien entsprechen den Unterverzeichnissen des Verzeichnisses, das Sie als <guilabel>freedb-Basisverzeichnis</guilabel> auf der Karteikarte <link linkend="cddb-page"><guilabel>CDDB</guilabel></link> dieses Einrichtungsmoduls eingetragen haben.

source: The <guilabel>Length:</guilabel> display shows the total play time of the &CD;.
de: Das Feld <guilabel>Länge</guilabel> zeigt die gesamte Spielzeit der &CD; an.

source: Press the <guibutton>Fetch Info</guibutton> button to download <acronym>CDDB</acronym> data. Press the <guibutton>OK</guibutton> button to save your changes locally. The <guibutton>Cancel</guibutton> button closes the &CD; Database Editor without saving.
de: Durch Klicken auf <guibutton>Informationen holen</guibutton> können Sie einen <acronym>CDDB</acronym>-Eintrag aus dem Internet laden. Der Knopf <guibutton>Abbrechen</guibutton> schließt den &CD;-Datenbank Editor ohne zu speichern.

source: <acronym>CDDB</acronym> Support
de: <acronym>CDDB</acronym>-Unterstützung

source: freedb is a distributed network database accessible over the Internet that contains information about most audio &CD;s in circulation. If you have Internet access, you will likely never have to manually enter track information for your &CD;s if you have this set up properly. See <link linkend="cddb-page">The CDDB Page</link> section for detailed instructions on how to configure this service, and the <link linkend="cddb-editor">&CD; Database Editor</link> section for instructions on how to edit <acronym>CDDB</acronym> entries.
de: Die freedb-Datenbank ist eine verteilte Netzwerkdatenbank, die über das Internet erreichbar ist. Sie enthält Informationen über die meisten Audio-&CD;s, die verfügbar sind. Wenn Sie einen Internetzugang haben, werden Sie vermutlich niemals selbst Stückinformationen für Ihre &CD;s eintragen müssen. Genaueres zur Konfiguration von <acronym>CDDB</acronym> finden Sie im Abschnitt über die Karteikarte <link linkend="cddb-page">CDDB</link>. Informationen zum Ändern von <acronym>CDDB</acronym>-Einträgen finden Sie unter <link linkend="cddb-editor">&CD;-Dateneditor</link>.

source: Use of the <acronym>CDDB</acronym> is free. Submissions from users are encouraged.
de: Die Verwendung der <acronym>CDDB</acronym> ist kostenlos. Beiträge sind willkommen.

source: When preparing entries for the <acronym>CDDB</acronym>, please keep the following points in mind:
de: Wenn Sie Beiträge für die <acronym>CDDB</acronym> vorbereiten, bedenken Sie bitte folgende Punkte:

source: Use <quote>standard</quote> latin characters in the entries. Some special characters are supported, but Cyrillic or Greek alphabet submissions, for example, cannot be accepted.
de: Verwenden Sie einen <quote>Standard</quote>-Latinzeichensatz in den Einträgen. Einige Sonderzeichen werden unterstützt, aber das kyrillische oder griechische Alphabet für kann für Beiträge nicht akzeptiert werden.

source: Use only one <keysym>/</keysym> character in the <guilabel>Disc Artist / Title</guilabel> field in the &CD; Database Editor.
de: Verwenden Sie nur ein <keysym>/</keysym>-Zeichen im Feld <guilabel>Künstler / Titel</guilabel> im &CD;-Datenbank Editor.

source: For classical &CD;s, it is standard practice to put the composer's name in the Artist section (before the slash) and the performer's name in the Title section (after the slash).
de: Bei klassischen &CD;s ist es üblich, den Namen des Komponisten vor dem Schrägstrich und den Namen des Ausführenden hinter dem Schrägstrich einzutragen.

source: If you send an entry that already exists in the database, any additional information you provide may be added to the existing entry.
de: Wenn Sie einen Eintrag einsenden, der bereits existiert, werden alle zusätzlichen Informationen dem existierenden Eintrag hinzugefügt.

source: By default, the standard <acronym>CDDB</acronym> categories are installed in <filename class="directory">$HOME/.cddb</filename>. You can create as many category subfolders as you like. However, when uploading, only the official <acronym>CDDB</acronym> categories are displayed. The default upload address is <email>freedb-submit@freedb.org</email>. For more information about <abbrev>freedb</abbrev> visit the <abbrev>freedb</abbrev> homepage.
de: Standardmäßig werden die üblichen <acronym>CDDB</acronym> Kategorien in <filename class="directory">$HOME/.cddb</filename> installiert. Sie können so viele Kategorien erstellen, wie Sie möchten. Wenn Sie allerdings einen Eintrag einsenden möchten, werden nur die Standardeinträge der <acronym>CDDB</acronym> angezeigt. Die Standardadresse ist <email>freedb-submit@freedb.org</email>. Weitere Informationen über <abbrev>freedb</abbrev> finden Sie auf der <abbrev>freedb</abbrev>-Internetseite.

source: The local <acronym>CDDB</acronym> entry for a particular &CD; is stored in the file <filename><replaceable>category name</replaceable>/<replaceable>disc ID</replaceable></filename> under the <acronym>CDDB</acronym> Base Folder. These files can be edited with any text editor.
de: Der lokale <acronym>CDDB</acronym>-Eintrag für eine bestimmte &CD; wird gespeichert unter <filename><replaceable>Kategorie</replaceable>/<replaceable>CD-Kennung</replaceable></filename> unter dem <acronym>CDDB</acronym>-Basisverzeichnis. Diese Dateien können Sie auch mit einem Texteditor bearbeiten.
