Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdemultimedia/kioslave_audiocd.po
Languages: de

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Marco</firstname><surname>Wegner</surname><affiliation><address><email>mail@marcowegner.de</email></address></affiliation><contrib>Übersetzer</contrib></othercredit>

source: Allows treating audio <acronym>CD</acronym>s like a <quote>real</quote> filesystem, where tracks are represented as files and, when copied from the folder, are digitally extracted from the <acronym>CD</acronym>. This ensures a perfect copy of the audio data.
de: Erlaubt das Verwenden von Audio-<acronym>CD</acronym>s wie ein <quote>richtiges</quote> Dateisystem, wobei die Stücke als Dateien dargestellt und beim Kopieren aus dem Verzeichnis digital von der <acronym>CD</acronym> ausgelesen werden. Dies garantiert eine perfekte Kopie der Audiodaten.

source: To see how this slave works, insert an audio <acronym>CD</acronym> in your &CD-ROM; drive and type <userinput>audiocd:/</userinput> into &konqueror;. Within a few seconds you should see a list of tracks and some folders.
de: Um zu sehen, wie dieses Modul arbeitet, legen Sie eine Audio-<acronym>CD</acronym> in Ihr &CD-ROM;-Laufwerk ein und geben <userinput>audiocd:/</userinput> im &konqueror; ein. Innerhalb weniger Sekunden sollten Sie eine Liste von Stücken und einige Ordner sehen.

source: Audio <acronym>CD</acronym>s don't really have folders, but the audiocd slave provides them as a convenience. If you look inside these folders you will see that they all contain the same number of tracks. If you are connected to the Internet, some folders will have the actual track titles shown as the filenames.
de: Auf Audio-<acronym>CD</acronym>s gibt es eigentlich keine Ordner, aber das audiocd-Modul stellt diese nützliche Erweiterung bereit. Wenn Sie in diese Ordner schauen, werden Sie feststellen, dass sie alle die gleiche Anzahl Titel enthalten. Falls Sie mit dem Internet verbunden sind, werden in einigen Verzeichnissen sogar die Stück-Titel als Dateinamen angezeigt.

source: The reason that these separate folders exist are so that you can choose in which format you would like to listen to (or copy) the tracks on the <acronym>CD</acronym>.
de: Diese separaten Ordner existieren, damit Sie auswählen können, in welchem Format Sie die Stücke auf der <acronym>CD</acronym> anhören (oder kopieren) wollen.

source: If you drag a track from the <filename class="directory">Ogg Vorbis</filename> folder and drop it on another &konqueror; window open at your home folder, you should see a progress window showing you that the track is being extracted from the <acronym>CD</acronym> and saved to a file. Note that Ogg Vorbis is a compressed format, so the file in your home folder will appear a great deal smaller than it would have been if you had copied the raw data.
de: Wenn Sie einen Titel aus dem Ordner <filename class="directory">Ogg Vorbis</filename> ziehen und ihn über einem anderen offenen &konqueror;-Fenster ablegen, sollten Sie ein Fenster sehen, das Ihnen anzeigt, dass der Titel von der <acronym>CD</acronym> ausgelesen und in einer Datei gespeichert wird. Beachten Sie, dass Ogg Vorbis ein komprimiertes Format ist, sodass die gespeicherte Datei erheblich kleiner sein wird als eine von den Rohdaten kopierte.

source: The mechanism behind this is quite simple. When the audiocd slave is asked to retrieve a track from the <filename class="directory">Ogg Vorbis</filename> folder, it starts extracting the digital audio data from the <acronym>CD</acronym>. As it sends the data over to the file in your home folder, it simultaneously encodes it in Ogg Vorbis format (<acronym>CD</acronym> audio is in an uncompressed format to start with).
de: Der Mechanismus dahinter ist recht einfach. Wenn das audiocd-Modul aufgefordert wird, einen Titel aus dem Ordner <filename class="directory">Ogg Vorbis</filename> zu erzeugen, liest es die digitalen Audiodaten von der <acronym>CD</acronym>. Während das Modul die Daten zur Speicherung in eine Datei ablegt, werden diese in das Format Ogg Vorbis umgewandelt (<acronym>CD</acronym>-Audio ist kein spezielles Format, es sind einfach binäre Daten).

source: You could also try dragging a file ending in <literal role="extension">.wav</literal> and dropping it on the &kde; Media Player, &juk;. In this case, the procedure that happens behind the scenes is similar, except that instead of encoding the audio data in Ogg Vorbis format, it is put through a very simple conversion, from raw binary data (which the <literal role="extension">.cda</literal> files in the toplevel folder represent) to <quote>RIFF WAV</quote> format, a non-compressed format that most media players understand.
de: Sie könnten auch versuchen, eine auf <literal role="extension">.wav</literal> endende Datei auf die &kde;-Medienwiedergabe (&juk;) zu ziehen. In diesem Fall ist der Vorgang, der dahinter steckt, ganz ähnlich, nur dass an Stelle einer Umwandlung der Audiodaten in das Format Ogg Vorbis hier eine sehr einfache Umwandlung stattfindet: von binären Rohdaten (repräsentiert von den <literal role="extension">.cda</literal>-Dateien im Basisordner) ins Format <quote>RIFF WAV</quote>, ein unkomprimiertes Format, das von den meisten Medien-Abspielern verstanden wird.

source: &juk; should quite happily play the <literal role="extension">.wav</literal> file, but if it has trouble, you may consider using the <option>paranoia_level</option> option, explained below.
de: &juk; sollte problemlos die <literal role="extension">.wav</literal>-Datei abspielen, aber wenn es Schwierigkeiten gibt, können sie versuchen, die Option <option>paranoia_level</option> zu verwenden, die später noch erklärt wird.

source: Options
de: Optionen

source: Set the path to the audio <acronym>CD</acronym> device, &eg; <userinput>audiocd:/<option>?device</option>=<parameter>/dev/sdc</parameter></userinput>. Normally, the slave will try to find a <acronym>CD</acronym> drive with an audio <acronym>CD</acronym> inserted, but if it fails or you have more than one <acronym>CD</acronym> drive, you may want to try this option. Note that the configuration dialog allows you to set a default value for this option.
de: Setzt den Pfad zum Audio-<acronym>CD</acronym>-Gerät, &eg; <userinput>audiocd:/<option>?device</option>=<parameter>/dev/sdc</parameter></userinput>. Normalerweise wird das Modul versuchen, ein <acronym>CD</acronym>-Laufwerk mit einer eingelegten Audio-<acronym>CD</acronym> zu finden, aber wenn das nicht funktioniert oder Sie mehr als ein <acronym>CD</acronym>-Laufwerk besitzen, können Sie es mit dieser Option versuchen. Beachten Sie, dass der Einrichtungsdialog es Ihnen erlaubt, eine Voreinstellung für diese Option zu setzen.

source: Set the file name template, &eg; <userinput>audiocd:/<option>?fileNameTemplate</option>=<parameter>Track %{number}</parameter></userinput>. Note that the configuration dialog allows you to set a default value for this option. A warning that if you set it to an empty string no files will show up.
de: Setzt das Schema für Dateinamen, zum Beispiel <userinput>audiocd:/<option>?fileNameTemplate</option>=<parameter>Track %{number}</parameter></userinput>. Der Standardwert für diese Option kann im Konfigurationsdialog gesetzt werden. Warnung: Wenn Sie eine leere Zeichenkette angeben, werden keine Dateien erscheinen.

source: Set the album name template, &eg; <userinput>audiocd:/<option>?albumNameTemplate</option>=<parameter>%{albumartist} %{albumtitle}</parameter></userinput>. Note that the configuration dialog allows you to set a default value for this option.
de: Setzt das Schema für Alben, zum Beispiel <userinput>audiocd:/<option>?albumNameTemplate</option>=<parameter>%{albumartist} %{albumtitle}</parameter></userinput>.Der Standardwert für diese Option kann im Konfigurationsdialog gesetzt werden.

source: niceLevel
de: Nice-Ebene

source: Sets the process nice level for encoders, &eg; <userinput>audiocd:/<option>?albumNameTemplate</option>=<parameter>niceLevel=10</parameter></userinput>. Note that the configuration dialog allows you to set a default value for this option.
de: Setzt die Nice-Ebene für die Kodierer, zum Beispiel <userinput>audiocd:/<option>?albumNameTemplate</option>=<parameter>niceLevel=10</parameter></userinput>. Im Konfigurationsdialog kann für diesen Parameter ein Standardwert eingegeben werden.

source: Set the amount of error detection and correction used when extracting data.
de: Setzt den Wert für Fehlererkennung und -korrektur beim Auslesen von Audiodaten.

source: Level 0
de: Stufe 0

source: No detection or correction. Only useful if you have a perfect <acronym>CD</acronym> drive (unlikely).
de: Keine Erkennung oder Korrektur. Das ist nur sinnvoll, falls Sie ein perfektes <acronym>CD</acronym>-Laufwerk haben (also eher unwahrscheinlich).

source: Level 1
de: Stufe 1

source: Enable basic error checking and correction.
de: Ermöglicht grundlegende Fehlerkontrolle und -korrektur.

source: Level 2
de: Stufe 2

source: Default. Specifies that only a perfect extraction will be accepted.
de: Voreinstellung. Legt fest, dass nur ein fehlerfreies Auslesen akzeptiert wird.

source: Note that there is a disadvantage to level 2. Extraction can be very slow, so real-time digital playback may not work properly. If you have a good quality <acronym>CD</acronym> drive (note that more expensive does not necessarily mean better quality) then you probably won't experience very slow extraction, but a poor drive may take days (!) to extract the audio from one <acronym>CD</acronym>.
de: Beachten Sie, dass es einen Nachteil der Stufe 2 gibt: Das Auslesen kann sehr langsam sein, sodass das digitale Abspielen in Echtzeit möglicherweise nicht korrekt arbeitet. Falls Sie ein qualitativ hochwertiges <acronym>CD</acronym>-Laufwerk besitzen (dabei gilt, dass teurer nicht notwendigerweise auch bessere Qualität bedeutet), werden Sie ein langsames Auslesen wahrscheinlich nicht erleben, aber ein schlechtes Laufwerk kann Tage brauchen (!), um die Audiodaten einer einzigen <acronym>CD</acronym> auszulesen.

source: cddbChoice
de: CDDB-Auswahl

source: Specify which Internet <acronym>CD</acronym> Database entry to use. Audio <acronym>CD</acronym>s don't have track names, but the Internet <acronym>CD</acronym> Database is a clever system which uses a special unique identifier generated from the number and length of tracks on each <acronym>CD</acronym> to cross-reference a track listing. Track listings are contributed by the Internet community and made available to all. Occasionally there will be multiple entries. You can specify which one to use.
de: Legt fest, dass die Namen der Titel der eingelegten <acronym>CD</acronym> in einer Internet-<acronym>CD</acronym>-Datenbank nachgeschlagen werden. Auf Audio-<acronym>CD</acronym>s sind die Titel der Stücke nicht gespeichert, aber die Internet-<acronym>CD</acronym>-Datenbank ist ein raffiniertes System, das ein spezielles einzigartiges Identifizierungsmerkmal verwendet, das aus der Anzahl und Länge der Titel auf jeder <acronym>CD</acronym> erstellt wird, um auf eine dazugehörende Titel-Liste zu verweisen. Diese Titel-Listen werden von der Internetgemeinschaft bereitgestellt und für alle verfügbar gemacht. Ab und an können mehrere Einträge gefunden werden, aus denen dann ausgewählt werden muss.

source: You can submit your own track listings using &kscd;, the &kde; <acronym>CD</acronym> player.
de: Sie können Ihre eigenen Titel-Listen mittels &kscd; hinzufügen, dem <acronym>CD</acronym>-Spieler der &kde;.

source: By default audiocd tries to pick the best one.
de: Standardmäßig wählt audiocd den am besten passenden.

source: Examples
de: Beispiele

source: Gives a listing of the tracks on the audio <acronym>CD</acronym> inserted in <filename class="devicefile">/dev/scd0</filename>, which on &Linux; specifies the first <acronym>SCSI</acronym> &CD-ROM; device. If you copy tracks from the <acronym>CD</acronym>, digital extraction will be performed without error correction or detection. The <acronym>CDDB</acronym> Database entry 0 will be used.
de: Gibt eine Liste der Stücke auf der Audio-<acronym>CD</acronym> aus, die in <filename class="devicefile">/dev/scd0</filename> eingelegt wurde. (Das steht unter &Linux; für das erste <acronym>SCSI</acronym>-&CD-ROM;-Gerät.) Falls Sie Titel von der <acronym>CD</acronym> kopieren, wird das digitale Auslesen ohne Fehlerkorrektur oder -erkennung ausgeführt. Die Internet-<acronym>CD</acronym>-Datenbank Eintrag 0 wird verwendet.

source: Frequently Asked Question
de: Eine oft gestellte Frage

source: I get <errorname>The file or folder / does not exist</errorname>. How do I fix that? I have an audio <acronym>CD</acronym> in my drive!
de: Ich bekomme die Fehlermeldung <errorname>Die Datei oder der Ordner / existiert nicht</errorname>. Was muss ich tun? Ich habe eine Audio-<acronym>CD</acronym> in meinem Laufwerk.

source: Try running <userinput><command>cdparanoia</command> <option>-vsQ</option></userinput> as yourself (not <systemitem class="username">root</systemitem>). Do you see a track list? If not, make sure you have permission to access the <acronym>CD</acronym> device. If you're using <acronym>SCSI</acronym> emulation (possible if you have an <acronym>IDE</acronym> <acronym>CD</acronym> writer) then make sure you check that you have read and write permissions on the generic <acronym>SCSI</acronym> device, which is probably <filename class="devicefile">/dev/sg0</filename>, <filename class="devicefile">/dev/sg1</filename>, If it still doesn't work, try typing <userinput>audiocd:/?device=/dev/sg0</userinput> (or similar) to tell kio_audiocd which device your &CD-ROM; is.
de: Versuchen Sie es mit dem Befehl <userinput><command>cdparanoia</command> <option>-vsQ</option></userinput> (nicht als <systemitem class="username">root</systemitem>). Sehen Sie eine Titel-Liste? Falls nicht, stellen Sie sicher, dass Sie die Berechtigung haben, auf das <acronym>CD</acronym>-Laufwerk zuzugreifen. Sollten Sie die <acronym>SCSI</acronym>-Emulation verwenden (&eg; wenn Sie einen <acronym>IDE</acronym>-<acronym>CD</acronym>-Brenner haben), prüfen Sie die Zugriffsrechte der <acronym>SCSI</acronym>-Geräte, also <filename class="devicefile">/dev/sg0</filename>, <filename class="devicefile">/dev/sg1</filename> &etc; Falls es immer noch nicht funktioniert, versuchen Sie es mit der Eingabe von <userinput>audiocd:/?device=/dev/sg0</userinput> (oder ähnlich), um dem audiocd-Modul mitzuteilen, welches Gerät Ihr &CD-ROM; ist.
