Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdemultimedia/kmix.po
Languages: de

source: The &kmix; Handbook
de: Das Handbuch zu &kmix;

source: Developer
de: Entwickler

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Gregor</firstname><surname>Zumstein</surname><affiliation><address><email>zumstein@ssd.ethz.ch</email></address></affiliation><contrib>Übersetzung</contrib></othercredit><othercredit role="translator"><firstname>Frank</firstname><surname>Schütte</surname><affiliation><address><email>F.Schuette@t-online.de</email></address></affiliation><contrib>Überarbeitung der Übersetzung</contrib></othercredit><othercredit role="translator"><firstname>Arnold</firstname><surname>Krille</surname><affiliation><address><email>arnold@arnoldarts.de</email></address></affiliation><contrib>Überarbeitung der Übersetzung</contrib></othercredit>

source: &kmix; is an application that allows you to change the volume of your sound card.
de: &kmix; ist eine Anwendung, die es Ihnen erlaubt, die Lautstärkeeinstellungen Ihrer Soundkarte zu verändern.

source: volume
de: Mixer

source: mixer
de: Lautstärkeregelung

source: Introduction
de: Einleitung

source: &kmix; supports several platforms and sound drivers.
de: &kmix; unterstützt verschiedene Betriebssysteme und Sound-Treiber.

source: If you have both ALSA and Open Sound System drivers installed, &kmix; will use the ALSA driver.
de: Wenn sowohl ALSA als auch das Open Sound System installiert sind, benutzt &kmix; standardmäßig ALSA.

source: <screeninfo>Screenshot of &kmix;</screeninfo>
de: <screeninfo>Bildschirmfoto von &kmix;</screeninfo>

source: <phrase>Screenshot of &kmix;</phrase>
de: <phrase>Bildschirmfoto von &kmix;</phrase>

source: Main Window
de: Hauptfenster

source: Overview of &kmix; Main Window
de: Übersicht über das Hauptfenster von &kmix;

source: File Options
de: Dateioptionen

source: <screeninfo>&kmix; File options</screeninfo>
de: <screeninfo>Dateioptionen von &kmix;</screeninfo>

source: <phrase>&kmix; File options</phrase>
de: <phrase>Dateioptionen von &kmix;</phrase>

source: <shortcut> <keycombo action="simul">&Esc;</keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Hide Mixer Window</guimenuitem>
de: <shortcut> <keycombo action="simul">&Esc;</keycombo> </shortcut> <guimenu>Datei</guimenu> <guimenuitem>Lautstärkeregler ausblenden</guimenuitem>

source: Hide Mixer Window
de: Lautstärkeregler ausblenden

source: Settings
de: Einstellungen

source: <screeninfo>&kmix; Settings</screeninfo>
de: <screeninfo>Einstellungen von &kmix;</screeninfo>

source: <phrase>&kmix; Settings</phrase>
de: <phrase>Einstellungen von &kmix;</phrase>

source: <guimenu>Settings</guimenu> <guimenuitem>Audio Setup</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>Audio-Einrichtung</guimenuitem>

source: <action>Open <ulink url="help:/kcontrol/phonon">&phonon; &systemsettings; module</ulink></action> to configure the sound and video device preference and the backends used by &kde; multimedia API, &phonon;.
de: <action>Öffnet</action> das <ulink url="help:/kcontrol/phonon">&systemsettings;-Modul für &phonon;</ulink>, um die Gerätepriorität für Audio und Video sowie die Backends für die &kde;-Schnittstelle zu &phonon; festzulegen.

source: Select Master Channel
de: Auswahl des Hauptkanals

source: <screeninfo>&kmix; Master Channel</screeninfo>
de: <screeninfo>&kmix;-Hauptkanal</screeninfo>

source: <phrase>&kmix; Master Channel</phrase>
de: <phrase>&kmix;-Hauptkanal</phrase>

source: Select your &kmix; master channel.
de: Wählen Sie Ihren &kmix;-Hauptkanal.

source: Configure &kmix;
de: &kmix; einrichten

source: General configuration
de: Allgemeine Einstellungen

source: <screeninfo>General configuration of &kmix;</screeninfo>
de: <screeninfo>Allgemeine Einstellungen von &kmix;</screeninfo>

source: <phrase>General configuration of &kmix;</phrase>
de: <phrase>Allgemeine Einstellungen von &kmix;</phrase>

source: Configure general &kmix; parameters.
de: Stellen Sie verschiedene allgemeine &kmix;-Parameter ein.

source: <guimenu>Behavior</guimenu> <guimenuitem>Volume Feedback</guimenuitem>
de: <guimenu>Verhalten</guimenu> <guimenuitem>Rückmeldung der Lautstärke</guimenuitem>

source: Check this box to enable audible feedback on volume change.
de: Aktivieren Sie diese Option, um eine akustische Rückmeldung beim Ändern derLautstärke zu erhalten.

source: <guimenu>Behavior</guimenu> <guimenuitem>Volume Overdrive</guimenuitem>
de: <guimenu>Verhalten</guimenu> <guimenuitem>Lautstärke-Übersteuerung</guimenuitem>

source: Check this box to allow volume to be more than recommended value (sometimes PulseAudio maximal volume exceeds the normal value). &kmix; restart is needed for this setting to take effect.
de: Aktivieren Sie dieses Ankreuzfeld, um für die Lautstärke erhöhte Werte zuzulassen. Manchmal überschreitet die maximale Lautstärke von PulseAudio den normalen Wert. Damit diese Einstellung wirksam wird, muss &kmix; neu gestartet werden.

source: Uncheck this item if there are audible sound distortions at the maximal volume.
de: Gibt es hörbare Verzerrungen bei maximaler Lautstärke, schalten Sie dies ab.

source: <guimenu>Visual</guimenu> <guimenuitem>Show tickmarks</guimenuitem>
de: <guimenu>Visuell</guimenu> <guimenuitem>Skalenstriche anzeigen</guimenuitem>

source: Check this box to show tickmarks on controls.
de: Aktivieren Sie diese Option, um Skalenstriche an den Lautstärkereglern anzuzeigen.

source: <guimenu>Visual</guimenu> <guimenuitem>Show labels</guimenuitem>
de: <guimenu>Visuell</guimenu> <guimenuitem>Bezeichnungen anzeigen</guimenuitem>

source: Check this box to show labels of controls.
de: Aktivieren Sie diese Option, um die Bezeichnungen der Lautstärkeregler anzuzeigen.

source: <guimenu>Visual</guimenu> <guimenuitem>Show On Screen Display (OSD)</guimenuitem>
de: <guimenu>Visuell</guimenu> <guimenuitem>On-Screen-Display (OSD) anzeigen</guimenuitem>

source: Check this box to enable OSD show on hovering &kmix; tray widget.
de: Aktivieren Sie diese Option, um beim Überfahren des &kmix;-Symbols in der Kontrollleiste das OSD (On Screen Display) anzuzeigen.

source: <guimenu>Slider orientation</guimenu> <guimenuitem>Horizontal</guimenuitem>
de: <guimenu>Regler-Ausrichtung</guimenu> <guimenuitem>Horizontal</guimenuitem>

source: Check this radio button to orientate the control slider horizontally.
de: Wählen Sie diese Einstellung, wenn die Lautstärkeregler horizontal dargestellt werden sollen.

source: <guimenu>Slider orientation</guimenu> <guimenuitem>Vertical</guimenuitem>
de: <guimenu>Regler-Ausrichtung</guimenu> <guimenuitem>Vertikal</guimenuitem>

source: Check this radio button to orientate the control slider vertically.
de: Wählen Sie diese Einstellung, wenn die Lautstärkeregler vertikal dargestellt werden sollen.

source: <guimenu>Slider orientation (System tray volume control)</guimenu> <guimenuitem>Horizontal/Vertical</guimenuitem>
de: <guimenu>Ausrichtung der Lautstärkeregler in Kontrollleiste</guimenu> <guimenuitem>Horizontal/Vertikal</guimenuitem>

source: Same as the previous two radio buttons but for the system tray volume control (the panel that is shown after &LMB; click on &kmix; tray icon).
de: Die Ausrichtung der Lautstärkeregler, diesmal im Systemabschnitt der Kontrollleiste, das durch Klicken mit der &LMBn; auf das &kmix;-Symbol angezeigt wird.

source: Start configuration
de: Starteinstellungen

source: <screeninfo>Start configuration of &kmix;</screeninfo>
de: <screeninfo>Starteinstellungen für &kmix;</screeninfo>

source: <phrase>Start configuration of &kmix;</phrase>
de: <phrase>Starteinstellungen für &kmix;</phrase>

source: This page allows you to configure various &kmix; start parameters.
de: Auf dieser Seite können Sie verschiedene Parameter für den Start von &kmix; einstellen.

source: <guimenu>Startup</guimenu> <guimenuitem>Restore volumes on login</guimenuitem>
de: <guimenu>Programmstart</guimenu> <guimenuitem>Lautstärken beim Anmelden wiederherstellen</guimenuitem>

source: Check this box to enable volume restoration on login.
de: Aktivieren Sie diese Option, wenn die in der vorherigen Sitzung eingestellte Lautstärke beim Anmelden wiederhergestellt werden soll.

source: Dynamic controls from PulseAudio and MPRIS2 will not be restored.
de: Dynamische Steuerung von Pulseaudio und MPRIS2 wird nicht wieder hergestellt.

source: <guimenu>Startup</guimenu> <guimenuitem>Autostart</guimenuitem>
de: <guimenu>Programmstart</guimenu> <guimenuitem>Automatisch starten</guimenuitem>

source: Check this box to enable &kmix; autostart with desktop environment.
de: Aktivieren Sie diese Option, im &kmix; automatisch mit der Arbeitsflächenumgebung zu starten.

source: Sound menu configuration
de: Einrichtung des Soundmenüs

source: <screeninfo>Sound menu configuration of &kmix;</screeninfo>
de: <screeninfo>Einrichtung des Soundmenüs für &kmix;</screeninfo>

source: <phrase>Sound menu configuration of &kmix;</phrase>
de: <phrase>Einrichtung des Soundmenüs für &kmix;</phrase>

source: This page allows you to configure various &kmix; sound menu parameters.
de: Auf dieser Seite stellen Sie die verschiedenen &kmix;-Parameter des Soundmenüs ein.

source: Dock in system tray
de: An Kontrollleiste andocken

source: Check this box to dock &kmix; in system tray.
de: Aktivieren Sie diese Option, um &kmix; an die Kontrollleiste anzudocken.

source: It is possible to select mixers that will be shown in the sound menu using the corresponding list on this page.
de: Es können Mixer aus der zugehörigen Liste auf dieser Seite ausgewählt werden, die dann im Soundmenü angezeigt werden.

source: Advanced usage
de: Weiterführende Funktionen

source: Remote controlling and scripting via &DBus;
de: Fernsteuerung und Skripte für &DBus;

source: You can control &kmix; via &DBus;. This is for advanced users who want to achieve special tasks, like muting the PC every day at 10 pm, or for any other scripting task.
de: &kmix; kann über &DBus; gesteuert werden. Dies ist für erfahrene Anwender gedacht, um besondere Aufgaben durchzuführen wie zum Beispiel den Rechner jeden Tag um 10 Uhr stummzuschalten und um &kmix; über Skripte zu steuern.

source: List all &kmix; related &DBus; methods and properties
de: Alle &DBus;-Methoden und -Eigenschaften für &kmix; auflisten:

source: Getting volume level (0-100%):
de: Lautstärke (0-100 %) abfragen:

source: Setting volume level (0-100%):
de: Lautstärke (0-100 %) einstellen:

source: Credits and License
de: Danksagungen und Lizenz

source: Documentation copyright &copy; 2010 Gaurav Chaturvedi <email>gaurav.p.chaturvedi@gmail.com </email>
de: Copyright für die Dokumentation &copy; 2010 Gaurav Chaturvedi <email>gaurav.p.chaturvedi@gmail.com </email>

source: Thanks to:
de: Dank an:

source: &Matt.Johnston; &Matt.Johnston.mail; (copy and pasted a lot of things from his old &kmix; documentation)
de: &Matt.Johnston; &Matt.Johnston.mail; (brachte einiges aus seiner alten &kmix;-Dokumentation ein)

source: CREDIT_FOR_TRANSLATORS
de: <para>Übersetzung Gregor Zumstein <email>zumstein@ssd.ethz.ch</email></para> <para>Überarbeitung der Übersetzung Frank Schütte <email>F.Schuette@t-online.de</email></para><para>Arnold Krille<email>arnold@arnoldarts.de</email></para>

source: How to obtain &kmix;
de: Wie erhalte ich &kmix;?

source: Compilation and installation
de: Kompilierung und Installation
