Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/kdeartwork/kwin_art_clients.po
Languages: de

source: Draw titlebar &stipple effect
de: &Punkte-Effekt in der Titelleiste

source: When selected, active titlebars are drawn with a stipple (dotted) effect; otherwise, they are drawn without the stipple.
de: Wenn diese Einstellung aktiv ist, wird die Titelleiste mit einem Punkte-Effekt angezeigt, anderenfalls werden keine Punkte angezeigt.

source: Draw g&rab bar below windows
de: &Anfasserleisten unterhalb von Fenstern

source: When selected, decorations are drawn with a "grab bar" below windows; otherwise, no grab bar is drawn.
de: Wenn diese Einstellung aktiv ist, werden die Dekorationen mit einer „Anfasserleiste“ unterhalb der Fenster versehen. Anderenfalls wird keine Leiste angezeigt.

source: Draw &gradients
de: &Farbverlauf

source: When selected, decorations are drawn with gradients for high-color displays; otherwise, no gradients are drawn.
de: Wenn diese Einstellung aktiv ist, werden Dekorationen mit einem Farbverlauf versehen. Anderenfalls wird kein Farbverlauf angezeigt.

source: Display the window &icon in the caption bubble
de: Fenstersymbol &in der Ausbuchtung anzeigen

source: Check this option if you want the window icon to be displayed in the caption bubble next to the titlebar text.
de: Wenn diese Einstellung aktiv ist, wird das Fenstersymbol in der Ausbuchtung neben dem Text der Titelleiste angezeigt.

source: Draw &small caption bubbles on active windows
de: Kleine Au&sbuchtungen bei aktiven Fenstern

source: Check this option if you want the caption bubble to have the same size on active windows that it has on inactive ones. This option is useful for laptops or low resolution displays where you want maximize the amount of space available to the window contents.
de: Markieren Sie diese Einstellung, wenn Sie möchten, dass die Ausbuchtung bei aktiven Fenstern genauso groß ist wie bei inaktiven. Das ist bei Laptops und Bildschirmen mit niedrigen Auflösung von Vorteil, da hier der zur Verfügung stehende Platz optimal für den Fensterinhalt ausgenutzt werden soll.

source: Draw g&rab bars below windows
de: Anfasse&rleisten unterhalb von Fenstern

source: Check this option if you want a grab bar to be drawn below windows. When this option is not selected only a thin border will be drawn in its place.
de: Wenn diese Einstellung aktiv ist, werden die Dekorationen mit einer "Anfasserleiste" unterhalb der Fenster gemalt. Andernfalls wird stattdessen nur ein schmaler Rahmen gemalt.

source: Use shadowed &text
de: Schattierten &Text verwenden

source: Check this option if you want the titlebar text to have a 3D look with a shadow behind it.
de: Wenn diese Einstellung aktiviert ist, wirft der Text in der Titelleiste einen Schatten.

source: <center><b>Keramik preview</b></center>
de: <center><b>Keramik-Vorschau</b></center>

source: Menu
de: Menü

source: Not on all desktops
de: Nicht auf allen Arbeitsflächen

source: On all desktops
de: Auf allen Arbeitsflächen

source: Help
de: Hilfe

source: Minimize
de: Minimieren

source: Maximize
de: Maximieren

source: Close
de: Schließen

source: Keep Above Others
de: Immer im Vordergrund

source: Keep Below Others
de: Immer im Hintergrund

source: Unshade
de: Einrollen rückgängig

source: Shade
de: Einrollen

source: Restore
de: Wiederherstellen

source: &Show window resize handle
de: &Anfasser zur Größenänderung anzeigen

source: When selected, all windows are drawn with a resize handle at the lower right corner. This makes window resizing easier, especially for trackballs and other mouse replacements on laptops.
de: Ist diese Einstellung markiert, werden die Fensterdekorationen mit einem „Anfasser“ in der unteren rechten Ecke des Fensters versehen. Hierdurch werden Größenänderungen einfacher, insbesondere bei Verwendung von Trackballs und anderen Mausersätzen bei Laptops.

source: Here you can change the size of the resize handle.
de: Hier können Sie die Größe des Anfassers ändern.

source: Small
de: Klein

source: Medium
de: Mittel

source: Large
de: Groß

source: Draw window frames using &titlebar colors
de: Fensterrahmen in den Farben der Titelleiste darstellen

source: When selected, the window decoration borders are drawn using the titlebar colors; otherwise, they are drawn using normal border colors instead.
de: Wenn diese Einstellung ausgewählt ist, werden die Rahmen der Fensterdekoration in den Farben der Titelleiste dargestellt. Anderenfalls werden die normalen Rahmenfarben verwendet.

source: Quartz &extra slim
de: Quartz &extraschlank

source: Quartz window decorations with extra-small title bar.
de: Eine Quartz-Fensterdekoration mit besonders kleiner Titelleiste
