Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/kdeartwork/kxsconfig.po
Languages: de

# @option:radio
source: Don't Rotate
de: Nicht drehen

# @item screen saver name
source: LCDscrub
de: LCD-Bereinigung

# @info screen saver description
source: This screen saver is not meant to look pretty, but rather, to repair burn-in on LCD monitors. Believe it or not, screen burn is not a thing of the past. It can happen to LCD screens pretty easily, even in this modern age. However, leaving the screen on and displaying high contrast images can often repair the damage. That's what this screen saver does. See also: http://docs.info.apple.com/article.html?artnum=88343 http://toastycode.com/blog/2008/02/05/lcd-scrub/ Inspired by the like-named program by Daniel Sandler. Written by Jamie Zawinski; 2008.
de: Dieser Bildschirmschoner soll nicht schön aussehen, sondern eingebrannte Muster auf LCD-Monitoren reparieren. Ob Sie es glauben oder nicht, ist das Einbrennen keine Sache der Vergangenheit. Es kann selbst bei den heutigen LCD-Monitoren sehr leicht auftreten. Die Anzeige eines Bildes mit hohem Kontrast auf einem angelassenen Bildschirm kann den Schaden jedoch oft reparieren. Dies ist was dieser Bildschirmschoner tut. Siehe auch http://docs.info.apple.com/article.html?artnum=88343 und http://toastycode.com/blog/2008/02/05/lcd-scrub/. Inspiriert durch das gleich benannte Programm von Daniel Sandler. Geschrieben von Jamie Zawinski; 2008.

# @label:spinbox
source: Line spread
de: Linienabstand

# @label:spinbox
source: Cycles
de: Zyklen

# @option:check
source: Horizontal white
de: Weiß horizontal

# @option:check
source: Vertical white
de: Weiß vertikal

# @option:check
source: Diagonal white
de: Weiß diagonal

# @option:check
source: Solid white
de: Durchgehendes Weiß

# @option:check
source: Primary colors
de: Primärfarben

# @option:check
source: Horizontal black
de: Schwarz horizontal

# @option:check
source: Vertical black
de: Schwarz vertikal

# @option:check
source: Diagonal black
de: Schwarz diagonal

# @option:check
source: Solid black
de: Durchgehendes Schwarz

# @item screen saver name
source: Lightning
de: Blitz

# @info screen saver description
source: This screen saver was removed from the XScreenSaver distribution as of version 5.08. Crackling fractal lightning bolts. Written by Keith Romberg; 1997.
de: Dieser Bildschirmschoner ist in XScreenSaver ab Version 5.08 nicht mehr enthalten. Krachende fraktale Blitze. Geschrieben 1997 von Keith Romberg.

# @info screen saver description
source: This screen saver was removed from the XScreenSaver distribution as of version 5.08. Lissajous loops. http://en.wikipedia.org/wiki/Lissajous_curve Written by Caleb Cullen; 1997.
de: Dieser Bildschirmschoner ist in XScreenSaver ab Version 5.08 nicht mehr enthalten.Lissajous-Figuren (http://de.wikipedia.org/wiki/Lissajous-Figur). Geschrieben von Caleb Cullen; 1997.

# @label:slider
source: Steps
de: Stufen

# @item:inrange Steps
source: Few
de: Wenige

# @item:inrange Steps
source: Many
de: Viele

# @item:inrange Size
source: Small
de: Klein

# @item:inrange Size
source: Large
de: Groß

# @info screen saver description
source: This screen saver was removed from the XScreenSaver distribution as of version 5.08. Lissajous loops. This one draws the progress of circular shapes along a path. http://en.wikipedia.org/wiki/Lissajous_curve Written by Alexander Jolk; 1997.
de: Dieser Bildschirmschoner ist in XScreenSaver ab Version 5.08 nicht mehr enthalten.Lissajous-Kreise. Es werden Kreise auf ihrem Weg gezeichnet. http://de.wikipedia.org/wiki/Lissajous-FigurGeschrieben von Alexander Jolk; 1997.

# @label:spinbox
source: Size
de: Größe

# @item screen saver name
source: LMorph
de: Morphing-Linien

# @info screen saver description
source: This screen saver was removed from the XScreenSaver distribution as of version 5.08. This generates random spline-ish line drawings and morphs between them. Written by Sverre H. Huseby and Glenn T. Lines; 1995.
de: Dieser Bildschirmschoner ist in XScreenSaver ab Version 5.08 nicht mehr enthalten.Erzeugt zufällige spline-artige Zeichnungen und verformt zwischen ihnen. Geschrieben 1995 von Sverre H. Huseby und Glenn T. Lines.

# @label:slider
source: Control points
de: Kontrollpunkte

# @item:inrange Control points
source: Few
de: Wenige

# @item:inrange Control points
source: Many
de: Viele

# @label:slider
source: Interpolation steps
de: Interpolationsschritte

# @item:inrange Interpolation steps
source: Less
de: Weniger

# @item:inrange Interpolation steps
source: More
de: Mehr

# @option:radio
source: Open and closed figures
de: Offene und geschlossene Figuren

# @option:radio
source: Open figures
de: Offene Figuren

# @option:radio
source: Closed figures
de: Geschlossene Figuren

# @info screen saver description
source: A translucent spinning, blinking thing. Sort of a cross between the wards in an old combination lock and those old backlit information displays that animated and changed color via polarized light. Written by Leo L. Schwab; 2007.
de: Ein durchsichtiges, sich drehendes und blinkendes Etwas. Eine ungefähre Mischung aus den Besatzungen alter Türschlösser und alten hintergrundbeleuchteten Anzeigetafeln, die Bewegungen und Farben durch polarisiertes Licht erzeugten. Geschrieben von Leo L. Schwab; 2007.

# @label:slider
source: Miniumum rotator idle time
de: Minimale Pause der Drehungen

# @item:inrange Miniumum rotator idle time
source: Low
de: Niedrig

# @item:inrange Miniumum rotator idle time
source: High
de: Hoch

# @label:slider
source: Minimum blink idle time
de: Minimale Pause des Blinkens

# @item:inrange Minimum blink idle time
source: Low
de: Niedrig

# @item:inrange Minimum blink idle time
source: High
de: Hoch

# @label:slider
source: Minimum blink dwell time
de: Minimale Haltezeit des Blinkens

# @item:inrange Minimum blink dwell time
source: Low
de: Niedrig

# @item:inrange Minimum blink dwell time
source: High
de: Hoch

# @option:check
source: Blinking effects
de: Blinkeffekte

# @label:slider
source: Maximum rotator idle time
de: Maximale Pause der Drehungen

# @item:inrange Maximum rotator idle time
source: Low
de: Niedrig

# @item:inrange Maximum rotator idle time
source: High
de: Hoch

# @label:slider
source: Maximum blink idle time
de: Maximale Pause des Blinkens

# @item:inrange Maximum blink idle time
source: Low
de: Niedrig

# @item:inrange Maximum blink idle time
source: High
de: Hoch

# @label:slider
source: Maximum blink dwell time
de: Maximale Haltezeit des Blinkens

# @item:inrange Maximum blink dwell time
source: Low
de: Niedrig

# @item:inrange Maximum blink dwell time
source: High
de: Hoch

# @item screen saver name
source: Loop
de: Schleifenförmige Kolonien

# @info screen saver description
source: A cellular automaton that generates loop-shaped colonies that spawn, age, and eventually die. http://en.wikipedia.org/wiki/Langton%27s_loops Written by David Bagley; 1999.
de: Ein zellenförmiger Automat, der schleifenförmige Kolonien zeichnet, die sich ausbreiten, altern und vielleicht auch aussterben. (http://de.wikipedia.org/wiki/Langton-Schleife) Geschrieben von David Bagley; 1999.

# @info screen saver description
source: Generates loop-shaped colonies that spawn, age, and eventually die. http://en.wikipedia.org/wiki/Langton%27s_loops Written by David Bagley; 1999.
de: Zeichnet schleifenförmige Kolonien, die sich ausbreiten, altern und vielleicht auch aussterben. (http://de.wikipedia.org/wiki/Langton-Schleife) Geschrieben von David Bagley; 1999.

# @item screen saver name
source: m6502
de: Mikroprozessor 6502

# @info screen saver description
source: This emulates a 6502 microprocessor, and runs some example programs on it. The family of 6502 chips were used throughout the 70's and 80's in machines such as the Atari 2600, Commodore PET, VIC20 and C64, Apple ][, and the NES. Some example programs are included, and it can also read in an assembly file as input. Original JavaScript Version by Stian Soreng: http://www.6502asm.com/. Ported to XScreenSaver by Jeremy English. Written by Stian Soreng and Jeremy English; 2007.
de: Dies emuliert einen 6502-Mikroprozessor und führt einige Beispielprogramme darauf aus. Die 6502-Prozessoren waren in den 70er und 80er Jahren weit verbreitet und in Geräten wie Atari 2600, Commodore PET, VIC20, C64, Apple ][ und dem NES eingebaut. Dieser Bildschirmschoner enthält einige Beispielprogramme und kann auch Assembly-Dateien als Eingabe lesen. Ursprüngliche JavaScript-Version von Stian Soreng: http://www.6502asm.com/. Auf XScreenSaver portiert von Jeremy English. Geschrieben von Stian Soreng und Jeremy English; 2007.

# @info screen saver description
source: This emulates a 6502 microprocessor. The family of 6502 chips were used throughout the 70's and 80's in machines such as the Atari 2600, Commodore PET, VIC20 and C64, Apple ][, and the NES. Some example programs are included, and it can also read in an assembly file as input. Original JavaScript Version by Stian Soreng: http://www.6502asm.com/. Ported to XScreenSaver by Jeremy English. Written by Stian Soreng and Jeremy English; 2007.
de: Dies emuliert einen 6502-Mikroprozessor. Die 6502-Prozessoren waren in den 70er und 80er Jahren weit verbreitet und in Geräten wie Atari 2600, Commodore PET, VIC20, C64, Apple ][ und dem NES eingebaut. Dieser Bildschirmschoner enthält einige Beispielprogramme und kann auch Assembly-Dateien als Eingabe lesen. Ursprüngliche JavaScript-Version von Stian Soreng: http://www.6502asm.com/. Auf XScreenSaver portiert von Jeremy English. Geschrieben von Stian Soreng und Jeremy English; 2007.

# @label:slider
source: Display time for each program
de: Anzeigedauer für jedes Programm

# @item:inrange Display time for each program
source: 5 seconds
de: 5 Sekunden

# @item:inrange Display time for each program
source: 2 minutes
de: 2 Minuten

# @label:chooser
source: Assembly file
de: Assembler-Datei

# @item screen saver name
source: Maze
de: Labyrinth

# @info screen saver description
source: This generates random mazes, with three different algorithms: Kruskal, Prim, and a depth-first recursive backtracker. It also solves them. Backtracking and look-ahead paths are displayed in different colors. http://en.wikipedia.org/wiki/Maze_generation_algorithm http://en.wikipedia.org/wiki/Maze_solving_algorithm Written by Martin Weiss, Dave Lemke, Jim Randell, Jamie Zawinski, Johannes Keukelaar, and Zack Weinberg; 1985.
de: Dieser Bildschirmschoner erzeugt zufällige Labyrinthe mit drei verschiedenen Generator-Algorithmen (Kruskal, Prim und Tiefensuche-Backtracking) und löst sie. Mit dem Rücksetzverfahren (Backtracking) oder mit der Vorwärtssuche (Look Ahead) ermittelte Pfade werden in unterschiedlichen Farben angezeigt. http://en.wikipedia.org/wiki/Maze_generation_algorithm http://de.wikipedia.org/wiki/Lösungsalgorithmen_für_Irrgärten Geschrieben 1985 von Martin Weiss, Dave Lemke, Jim Randell, Jamie Zawinski, Johannes Keukelaar, und Zack Weinberg

# @info screen saver description
source: This generates random mazes (with three different maze-generation algorithms), and then solves them. Backtracking and look-ahead paths are displayed in different colors. http://en.wikipedia.org/wiki/Maze_generation_algorithm Written by Martin Weiss, Dave Lemke, Jim Randell, Jamie Zawinski, Johannes Keukelaar, and Zack Weinberg; 1985.
de: Dieser Bildschirmschoner erzeugt zufällige Labyrinthe mit drei verschiedenen Generator-Algorithmen und löst sie. Mit dem Rücksetzverfahren (Backtracking) oder mit der Vorwärtssuche (Look Ahead) ermittelte Pfade werden in unterschiedlichen Farben angezeigt. http://en.wikipedia.org/wiki/Maze_generation_algorithm http://de.wikipedia.org/wiki/Lösungsalgorithmen_für_Irrgärten Geschrieben 1985 von Martin Weiss, Dave Lemke, Jim Randell, Jamie Zawinski, Johannes Keukelaar, und Zack Weinberg

# @option:radio
source: Random maze generator
de: Zufallsgenerator

# @option:radio
source: Depth-first backtracking maze generator
de: Tiefensuche mit rückwärtsgehendem Generator

# @option:radio
source: Wall-building maze generator (Prim)
de: Mauerbau-Generator (Prim)

# @option:radio
source: Set-joining maze generator (Kruskal)
de: Verbindender Generator (Kruskal)

# @option:radio
source: Head toward exit
de: Richtung Eingang zugehen

# @option:radio
source: Ignorant of exit direction
de: Richtung zum Ausgang ignorieren

# @label:spinbox
source: Grid size
de: Gittergröße

# @label:slider
source: Linger before solving
de: Warten vor dem Lösen

# @item:inrange Linger before solving
source: 0 seconds
de: 0 Sekunden

# @item:inrange Linger before solving
source: 10 seconds
de: 10 Sekunden

# @label:slider
source: Linger after solving
de: Warten nach dem Lösen

# @item:inrange Linger after solving
source: 0 seconds
de: 0 Sekunden

# @item:inrange Linger after solving
source: 10 seconds
de: 10 Sekunden

# @item screen saver name
source: MemScroller
de: Speicherläufer

# @info screen saver description
source: This draws a dump of its own process memory scrolling across the screen in three windows at three different rates. Written by Jamie Zawinski; 2004.
de: Zeichnet einen Auszug seines eigenen Prozessspeicherbedarfs, der sich in drei Fenstern in drei verschiedenen Geschwindigkeiten über den Bildschirm bewegt. Geschrieben von Jamie Zawinski; 2004.

# @option:radio
source: Dump memory
de: Speicher ausgeben

# @option:radio
source: Draw random numbers
de: Zufallszahlen zeichnen

# @option:radio
source: Draw in RGB
de: In RGB zeichnen

# @option:radio
source: Draw green
de: In Grün zeichnen

# @item screen saver name
source: Menger
de: Menger-Schwamm

# @info screen saver description
source: This draws the recursive Menger Gasket, a cube-based fractal object analagous to the Sierpinski Tetrahedron. http://en.wikipedia.org/wiki/Menger_sponge http://en.wikipedia.org/wiki/Sierpinski_carpet Written by Jamie Zawinski; 2001.
de: Zeichnet einen rekursiven „Menger-Schwamm“, ein würfelförmiges Fraktal ähnlich wie das Sierpinski-Tetraeder. (http://de.wikipedia.org/wiki/Menger-Schwamm; http://de.wikipedia.org/wiki/Sierpinski-Teppich)Geschrieben von Jamie Zawinski; 2001.

# @info screen saver description
source: This draws the three-dimensional variant of the recursive Menger Gasket, a cube-based fractal object analagous to the Sierpinski Tetrahedron. http://en.wikipedia.org/wiki/Menger_sponge http://en.wikipedia.org/wiki/Sierpinski_carpet Written by Jamie Zawinski; 2001.
de: Zeichnet eine dreidimensionale Variante des rekursiven „Menger-Schwamms“, ein würfelförmiges Fraktal ähnlich wie das Sierpinski-Tetraeder. (http://de.wikipedia.org/wiki/Menger-Schwamm; http://de.wikipedia.org/wiki/Sierpinski-Teppich)Geschrieben von Jamie Zawinski; 2001.

# @label:spinbox
source: Max depth
de: Maximale Tiefe

# @item screen saver name
source: MetaBalls
de: Metabälle

# @info screen saver description
source: Draws two dimensional metaballs: overlapping and merging balls with fuzzy edges. http://en.wikipedia.org/wiki/Metaballs Written by W.P. van Paassen; 2003.
de: Zeichnet zweidimensionale Metabälle: überlappende und verschmelzende Bälle mit unscharfen Rändern. Siehe auch http://de.wikipedia.org/wiki/Metaball. Geschrieben von W.P. van Paassen; 2003.

# @label:slider
source: Metaball count
de: Anzahl der Metabälle

# @item:inrange Metaball count
source: Two
de: Zwei

# @item:inrange Metaball count
source: Many
de: Viele

# @item:inrange MetaBall Radius
source: Small
de: Klein

# @item:inrange MetaBall Radius
source: Big
de: Groß

# @label:slider
source: MetaBall Movement
de: Metaball-Bewegung

# @item:inrange MetaBall Movement
source: Small
de: Wenig

# @item:inrange MetaBall Movement
source: Big
de: Viel

# @item screen saver name
source: MirrorBlob
de: Spiegelbild-Blob

# @info screen saver description
source: Draws a wobbly blob that distorts the image behind it. Written by Jon Dowdall; 2003.
de: Zeichnet einen wabbeligen Klecks, der das dahinter befindliche Bild verzerrt. Geschrieben von Jon Dowdall; 2003.

# @item:inrange Time until loading a new image
source: 5 sec
de: 5 Sek.

# @label:slider
source: Transition duration
de: Dauer des Übergangs

# @item:inrange Transition duration
source: None
de: Keine

# @item:inrange Transition duration
source: 30 sec
de: 30 Sek.

# @label:slider
source: Bumps
de: Beulen

# @item:inrange Bumps
source: None
de: Keine

# @item:inrange Bumps
source: 50 bumps
de: 50 Beulen

# @label:slider
source: Transparency
de: Transparenz

# @item:inrange Transparency
source: Clear
de: Durchsichtig

# @item:inrange Transparency
source: Opaque
de: Undurchsichtig

# @option:check
source: Enable walls
de: Wände aktivieren

# @option:check
source: Enable colouring
de: Färbung aktivieren

# @option:check
source: Enable reflected image
de: Reflektieren des Bildes aktivieren

# @option:check
source: Show image on background
de: Bild als Hintergrund anzeigen

# @option:check
source: Offset texture coordinates
de: Textur-Koordinatenversatz

# @item screen saver name
source: Mismunch
de: Mismampfen

# @info screen saver description
source: This screen saver was removed from the XScreenSaver distribution as of version 5.08. It was merged with the "Munch" screen saver. Munching errors! This is a creatively broken misimplementation of the classic munching squares graphics hack. See the "Munch" screen saver for the original. http://en.wikipedia.org/wiki/HAKMEM http://en.wikipedia.org/wiki/Munching_square Written by Steven Hazel; 2004.
de: Dieser Bildschirmschoner ist in XScreenSaver ab Version 5.08 nicht mehr enthalten. Er wurde mit dem Bildschirmschoner „Mampfen“ vereinigt. Mampfende Fehler! Diese Implementierung der klassischen mampfenden Quadrate ist absichtlich fehlerhaft. Beachten Sie auch den ursprünglichen Bildschirmschoner „Mampfen“. Siehe auch http://en.wikipedia.org/wiki/HAKMEM http://en.wikipedia.org/wiki/Munching_square . Geschrieben von Steven Hazel; 2004.

# @label:slider
source: Simultaneous squares
de: Zeitgleiche Quadrate

# @item:inrange Simultaneous squares
source: One
de: Eins

# @item:inrange Simultaneous squares
source: Many
de: Viele

# @option:radio
source: XOR
de: Ausschließendes Oder

# @item screen saver name
source: Moebius
de: Möbius

# @info screen saver description
source: This animates a 3D rendition M.C. Escher's "Moebius Strip II", an image of ants walking along the surface of a moebius strip. http://en.wikipedia.org/wiki/Moebius_strip http://en.wikipedia.org/wiki/Maurits_Cornelis_Escher Written by Marcelo F. Vianna; 1997.
de: Dies animiert eine 3D-Darstellung von M.C. Eschers „Möbiusband II“, ein Bild von Ameisen, die auf der Oberfläche eines Möbiusbands laufen (http://de.wikipedia.org/wiki/Möbiusband, http://de.wikipedia.org/wiki/Maurits_Cornelis_Escher). Geschrieben von Marcelo F. Vianna; 1997.

# @option:check
source: Solid floor
de: Feste Oberfläche

# @option:check
source: Draw ants
de: Ameisen zeichnen

# @item screen saver name
source: MoebiusGears
de: Möbius-Räder

# @info screen saver description
source: Draws a closed, interlinked chain of rotating gears. The layout of the gears follows the path of a moebius strip. See also the "Pinion" and "Gears" screen savers. http://en.wikipedia.org/wiki/Involute_gear http://en.wikipedia.org/wiki/Moebius_strip Written by Jamie Zawinski; 2007.
de: Zeichnet eine geschlossene Kette von ineinander verzahnten, rotierenden Zahnrädern. Das Anordnung der Zahnräder ähnelt dem eines Möbiusbands. Siehe auch die Bildschirmschoner „Pinion“ und „Zahnräder“ (http://en.wikipedia.org/wiki/Involute_gear http://de.wikipedia.org/wiki/Möbiusband). Geschrieben von Jamie Zawinski; 2007.

# @label:spinbox
source: Number of gears
de: Anzahl der Räder

# @label:spinbox
source: Number of teeth
de: Anzahl der Zähne

# @info screen saver description
source: When the lines on the screen Make more lines in between, That's a moire'! http://en.wikipedia.org/wiki/Moire_pattern Written by Jamie Zawinski and Michael Bayne; 1997.
de: Wenn Linienraster auf dem Bildschirm zusätzliche Raster erzeugen, dann ist das ein Moiré-Effekt (http://de.wikipedia.org/wiki/Moiré-Effekt). Geschrieben von Jamie Zawinski und Michael Bayne; 1993.

# @label:slider
source: Offset
de: Versatz

# @item:inrange Offset
source: Small
de: Gering

# @item:inrange Offset
source: Large
de: Groß

# @info screen saver description
source: Generates fields of concentric circles or ovals, and combines the planes with various operations. The planes are moving independently of one another, causing the interference lines to spray. http://en.wikipedia.org/wiki/Moire_pattern Written by Jamie Zawinski; 1998.
de: Es werden konzentrische Kreise oder Ovale gezeichnet, deren Ebenen mit verschiedenen Operationen verknüpft werden. Die Ebenen werden unabhängig voneinander bewegt und „zerstäuben“ so die Inferenzlinien (http://de.wikipedia.org/wiki/Moiré-Effekt). Geschrieben von Jamie Zawinski; 1998.

# @label:spinbox
source: Thickness
de: Dicke

# @item screen saver name
source: Molecule
de: Molekül

# @info screen saver description
source: Draws several different representations of molecules. Some common molecules are built in, and it can also read PDB (Protein Data Bank) files as input. http://en.wikipedia.org/wiki/Protein_Data_Bank_%28file_format%29 Written by Jamie Zawinski; 2001.
de: Zeichnet verschiedene Darstellungen von Molekülen. Einige bekannte Moleküle sind bereits eingebaut. Zusätzlich kann es auch PDB-Dateien (Proteindatenbank) als Informationsquelle benutzen. Siehe http://en.wikipedia.org/wiki/Protein_Data_Bank_(file_format). Geschrieben von Jamie Zawinski; 2001.

# @option:check
source: Label atoms
de: Atome beschriften

# @option:check
source: Describe molecule
de: Molekül beschreiben

# @option:check
source: Draw atomic nuclei
de: Atomkerne zeichnen

# @option:check
source: Draw atomic bonds
de: Atomare Bindungen zeichnen

# @option:check
source: Draw electron shells
de: Elektronenhüllen zeichnen

# @label:chooser
source: PDB file or directory
de: PDB-Datei oder -Ordner

# @item screen saver name
source: Morph3D
de: Stachelballon

# @info screen saver description
source: Platonic solids that turn inside out and get spikey. http://en.wikipedia.org/wiki/Platonic_solid Written by Marcelo Vianna; 1997.
de: Platonische Körper, die sich von Innen nach Außen kehren und zuspitzen. Siehe auch http://de.wikipedia.org/wiki/Platonischer_Körper. Geschrieben von Marcelo Vianna; 1997.

# @option:radio
source: Cube
de: Würfel

# @option:radio
source: Octahedron
de: Oktaeder

# @option:radio
source: Dodecahedron
de: Dodekaeder

# @option:radio
source: Icosahedron
de: Ikosaeder

# @item screen saver name
source: Mountain
de: Berg

# @info screen saver description
source: Generates random 3D plots that look vaguely mountainous. Written by Pascal Pensa; 1997.
de: Erzeugt dreidimensionale Gitterzeichnungen, die etwas wie Berge aussehen. Geschrieben von Pascal Pensa; 1997.

# @label:slider
source: Peaks
de: Gipfel

# @item:inrange Peaks
source: One
de: Einer

# @item:inrange Peaks
source: Lots
de: Viele

# @item screen saver name
source: Munch
de: Mampfen
