Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/kdeartwork/kxsconfig.po
Languages: de

# @item:inrange Detail
source: Low
de: Niedrig

# @item:inrange Detail
source: High
de: Hoch

# @option:check
source: Translate
de: Übersetzen

# @option:check
source: Scale
de: Skala

# @item screen saver name
source: IMSMap
de: IMS-Karte

# @info screen saver description
source: This generates random cloud-like patterns. The idea is to take four points on the edge of the image, and assign each a random "elevation". Then find the point between them, and give it a value which is the average of the other four, plus some small random offset. Coloration is done based on elevation. Written by Juergen Nickelsen and Jamie Zawinski; 1992.
de: Zeichnet ein zufälliges wolkenförmiges Muster. Sieht unterschiedlich in Graustufen- oder Farbdarstellung aus. Die Idee ist, an den Kanten eines Bildes vier Punkte zu nehmen und jedem eine zufällige „Erhöhung“ zu geben. Dann wird der Punkt zwischen ihnen genommen und ihm der Durchschnittswert plus einer kleinen Verschiebung zugewiesen. Die Färbung wird dann durch die Erhöhung bestimmt. Dazu wird die Erhöhung auf einen Farbwert, die Sättigung oder die Helligkeit abgebildet. Geschrieben von Juergen Nickelsen und Jamie Zawinsk:1992.

# @item:inrange Linger
source: 1 Second
de: 1 Sekunde

# @option:radio
source: Hue gradients
de: Farbwertübergang

# @option:radio
source: Saturation gradients
de: Sättigungsübergang

# @option:radio
source: Brightness gradients
de: Helligkeitsübergang

# @info screen saver description
source: Pale pencil-like scribbles slowly fill the screen. A surface is filled with a hundred medium to small sized circles. Each circle has a different size and direction, but moves at the same slow rate. Displays the instantaneous intersections of the circles as well as the aggregate intersections of the circles. Though actually it doesn't look like circles at all! Written by Casey Reas, William Ngan, Robert Hodgin, and Jamie Zawinski; 2004.
de: Bleiche Bleistift-Kritzeleien füllen langsam den Bildschirm. Eine Oberfläche ist mit hundert mittelgroßen bis kleinen Kreisen gefüllt. Jeder Kreis hat eine unterschiedliche Größe und Richtung, bewegt sich jedoch mit der gleichen langsamen Geschwindigkeit. Zeigt die Schnittpunkte zwischen den Kreisen, sowie die verbundenen Schnittpunkte an. Tatsächlich sieht es jedoch gar nicht nach Kreisen aus! Geschrieben von Casey Reas, William Ngan, Robert Hodgin und Jamie Zawinski; 2004.

# @info screen saver description
source: A surface is filled with a hundred medium to small sized circles. Each circle has a different size and direction, but moves at the same slow rate. Displays the instantaneous intersections of the circles as well as the aggregate intersections of the circles. Though actually it doesn't look like circles at all! Written by Casey Reas, William Ngan, Robert Hodgin, and Jamie Zawinski; 2004.
de: Eine Oberfläche ist mit hundert mittelgroßen bis kleinen Kreisen gefüllt. Jeder Kreis hat eine unterschiedliche Größe und Richtung, bewegt sich jedoch mit der gleichen langsamen Geschwindigkeit. Zeigt die Schnittpunkte zwischen den Kreisen, sowie die verbundenen Schnittpunkte an. Tatsächlich sieht es jedoch gar nicht nach Kreisen aus! Geschrieben von Casey Reas, William Ngan, Robert Hodgin und Jamie Zawinski; 2004.

# @label:slider
source: Number of discs
de: Anzahl der Scheiben

# @item:inrange Number of discs
source: Few
de: Wenige

# @item:inrange Number of discs
source: Many
de: Viele

# @item screen saver name
source: Interference
de: Störung

# @info screen saver description
source: Color field based on computing decaying sinusoidal waves. Written by Hannu Mallat; 1998.
de: Farbfeld auf der Grundlage von berechneten abklingenden sinusförmiger Wellen. Geschrieben von Hannu Mallat; 1998.

# @label:slider
source: Wave size
de: Wellengröße

# @item:inrange Wave size
source: Small
de: Klein

# @item:inrange Wave size
source: Large
de: Groß

# @label:slider
source: Number of waves
de: Anzahl der Wellen

# @item:inrange Number of waves
source: Few
de: Wenige

# @item:inrange Number of waves
source: Many
de: Viele

# @label:slider
source: Magnification
de: Vergrößerung

# @item:inrange Magnification
source: Low
de: Niedrig

# @item:inrange Magnification
source: High
de: Hoch

# @label:slider
source: Hue
de: Farbton

# @item screen saver name
source: Intermomentary
de: Zwischenaugenblicklich

# @info screen saver description
source: Blinking dots interact with each other circularly. A surface is filled with a hundred medium to small sized circles. Each circle has a different size and direction, but moves at the same slow rate. Displays the instantaneous intersections of the circles as well as the aggregate intersections of the circles. The circles begin with a radius of 1 pixel and slowly increase to some arbitrary size. Circles are drawn with small moving points along the perimeter. The intersections are rendered as glowing orbs. Glowing orbs are rendered only when a perimeter point moves past the intersection point. Written by Casey Reas, William Ngan, Robert Hodgin, and Jamie Zawinski; 2004.
de: Blinkende Punkte interagieren kreisförmig miteinander. Eine Oberfläche ist mit hundert mittelgroßen bis kleinen Kreisen gefüllt. Jeder Kreis hat eine unterschiedliche Größe und Richtung, bewegt sich jedoch mit der gleichen langsamen Geschwindigkeit. Zeigt die Schnittpunkte zwischen den Kreisen, sowie die verbundenen Schnittpunkte an. Die Kreise beginnen mit einem Radius von 1 Pixel und werden langsam größer. Kreise werden durch kleine Punkte Punkte gezeichnet, die sich entlang des Umkreises bewegen. Die Schnittpunkte werden als leuchtende Kugeln dargestellt. Leuchtende Kugeln werden nur dargestellt, wenn sich ein Punkt auf dem Umkreis über den Schnittpunkt heraus bewegt. Geschrieben von Casey Reas, William Ngan, Robert Hodgin und Jamie Zawinski; 2004.

# @info screen saver description
source: A surface is filled with a hundred medium to small sized circles. Each circle has a different size and direction, but moves at the same slow rate. Displays the instantaneous intersections of the circles as well as the aggregate intersections of the circles. The circles begin with a radius of 1 pixel and slowly increase to some arbitrary size. Circles are drawn with small moving points along the perimeter. The intersections are rendered as glowing orbs. Glowing orbs are rendered only when a perimeter point moves past the intersection point. Written by Casey Reas, William Ngan, Robert Hodgin, and Jamie Zawinski; 2004.
de: Eine Oberfläche ist mit hundert mittelgroßen bis kleinen Kreisen gefüllt. Jeder Kreis hat eine unterschiedliche Größe und Richtung, bewegt sich jedoch mit der gleichen langsamen Geschwindigkeit. Zeigt die Schnittpunkte zwischen den Kreisen, sowie die verbundenen Schnittpunkte an. Die Kreise beginnen mit einem Radius von 1 Pixel und werden langsam größer. Kreise werden durch kleine Punkte Punkte gezeichnet, die sich entlang des Umkreises bewegen. Die Schnittpunkte werden als leuchtende Kugeln dargestellt. Leuchtende Kugeln werden nur dargestellt, wenn sich ein Punkt auf dem Umkreis über den Schnittpunkt heraus bewegt. Geschrieben von Casey Reas, William Ngan, Robert Hodgin und Jamie Zawinski; 2004.

# @item screen saver name
source: JigglyPuff
de: Wackelnde Windbeutel

# @info screen saver description
source: This does bad things with quasi-spherical objects. You have a tetrahedron with tesselated faces. The vertices on these faces have forces on them: one proportional to the distance from the surface of a sphere; and one proportional to the distance from the neighbors. They also have inertia. The resulting effect can range from a shape that does nothing, to a frenetic polygon storm. Somewhere in between there it usually manifests as a blob that jiggles in a kind of disturbing manner. Written by Keith Macleod; 2003.
de: Macht böse Sachen mit quasi-sphärischen Objekten. Sie haben ein Tetraeder mit mosaikartiger Fläche. Die Eckpunkte der Fläche haben Kräfte auf Ihnen: eine proportional zur Entfernung zur Oberfläche der Sphäre; und eine proportional zur Entfernung zu den Nachbarn. Sie haben auch Trägheit. Der daraus resultierende Effekt reicht von einer Form, die nichts tut, bis zu einem fanatischen Polygon-Sturm. Irgendwo dazwischen bewegt es sich in der Regel als Klecks, der in einer aufwühlenden Art umher wackelt. Geschrieben von Keith Macleod; 2003.

# @option:check
source: Randomize almost everything
de: Fast alles zufällig

# @option:radio
source: Cycle
de: Zyklus

# @option:radio
source: Flower box
de: Blumenkiste

# @option:radio
source: Clown barf
de: Clownskotze

# @option:radio
source: Chrome
de: Chrom

# @option:radio
source: Sphere
de: Kugel

# @option:radio
source: Tetrahedron
de: Tetraeder

# @label:slider
source: Inertial damping
de: Anfängliche Dämpfung

# @item:inrange Inertial damping
source: Low
de: Niedrig

# @item:inrange Inertial damping
source: High
de: Hoch

# @label:slider
source: Vertex-vertex force
de: Vertex-Vertex-Kraft

# @item:inrange Vertex-vertex force
source: None
de: Keine

# @item:inrange Vertex-vertex force
source: Strong
de: Stark

# @label:slider
source: Sphere strength
de: Spähren-Stärke

# @item:inrange Sphere strength
source: None
de: Keine

# @item:inrange Sphere strength
source: Strong
de: Stark

# @label:slider
source: Vertex-vertex behavior
de: Vertex-Vertex-Verhalten

# @item:inrange Vertex-vertex behavior
source: Expand
de: Ausklappen

# @item:inrange Vertex-vertex behavior
source: Collapse
de: Zusammenklappen

# @label:slider
source: Spookiness
de: Spukhaftigkeit

# @item:inrange Spookiness
source: None
de: Keine

# @item:inrange Spookiness
source: Spoooooky
de: Gruuuuuselig

# @item screen saver name
source: Jigsaw
de: Puzzle

# @info screen saver description
source: This carves an image up into a jigsaw puzzle, shuffles it, and solves it. http://en.wikipedia.org/wiki/Jigsaw_puzzle http://en.wikipedia.org/wiki/Tessellation Written by Jamie Zawinski; 1997.
de: Zerlegt ein Bild in kleine Puzzleteile, mischt die Teile durcheinander und löst anschließend das Puzzle. http://de.wikipedia.org/wiki/Puzzle) (http://de.wikipedia.org/wiki/Parkettierung Geschrieben von Jamie Zawinski; 1997.

# @info screen saver description
source: This grabs a screen image, carves it up into a jigsaw puzzle, shuffles it, and then solves the puzzle. http://en.wikipedia.org/wiki/Jigsaw_puzzle http://en.wikipedia.org/wiki/Tessellation Written by Jamie Zawinski; 1997.
de: Nimmt ein Bild, schneidet es in kleine Puzzleteile, mischt die Teile durcheinander und löst anschließend das Puzzle (http://de.wikipedia.org/wiki/Puzzle) (http://de.wikipedia.org/wiki/Parkettierung). Geschrieben von Jamie Zawinski; 1997.

# @label:slider
source: Puzzle pieces
de: Puzzleteile

# @item:inrange Puzzle pieces
source: Few
de: Wenige

# @item:inrange Puzzle pieces
source: Many
de: Viele

# @item:inrange Resolution
source: Chunky
de: Klötzchen

# @option:check
source: Tilt
de: Neigung

# @item screen saver name
source: Juggle
de: Jonglieren

# @info screen saver description
source: This screen saver was removed from the XScreenSaver distribution as of version 5.09. It has been replaced by the "Juggler3D" screen saver. Written by Tim Auckland; 2002.
de: Dieser Bildschirmschoner ist in XScreenSaver ab Version 5.09 nicht mehr enthalten.Er wurde durch den Bildschirmschoner "Jonglieren 3D" ersetzt. Geschrieben von Tim Auckland; 2002.

# @info screen saver description
source: This screen saver was removed from the XScreenSaver distribution as of version 5.09. It has been replaced by the "Juggler3D" screen saver. http://en.wikipedia.org/wiki/Siteswap Written by Tim Auckland; 2002.
de: Dieser Bildschirmschoner ist in XScreenSaver ab Version 5.09 nicht mehr enthalten.Er wurde durch den Bildschirmschoner "Jonglieren 3D" ersetzt. (http://de.wikipedia.org/wiki/Siteswap). Geschrieben von Tim Auckland; 2002.

# @label:slider
source: Performance length
de: Dauer der Vorstellung

# @item:inrange Performance length
source: Short
de: Kurz

# @item:inrange Performance length
source: Long
de: Lang

# @item:inrange Trail length
source: None
de: Keine

# @option:check
source: Balls
de: Bälle

# @option:check
source: Clubs
de: Kegel

# @option:check
source: Rings
de: Ringe

# @option:check
source: Knives
de: Messer

# @option:check
source: Flaming torches
de: Brennende Fackeln

# @option:check
source: Bowling balls
de: Bowlingkugeln

# @option:check
source: Print Cambridge juggling pattern descriptions
de: Jongliermuster-Notationen anzeigen

# @label:textbox
source: Juggle this pattern
de: Dieses Muster jonglieren:

# @item screen saver name
source: Juggler3D
de: Jonglieren 3D

# @info screen saver description
source: Draws a 3D juggling stick-man, with Cambridge juggling pattern notation used to describe the patterns he juggles. http://en.wikipedia.org/wiki/Siteswap Written by Tim Auckland and Jamie Zawinski; 2002.
de: Zeichnet ein jonglierendes Strichmännchen in 3D mit einer Notation von Jongliermustern für die Beschreibung des Musters (http://de.wikipedia.org/wiki/Siteswap). Geschrieben von Tim Auckland und Jamie Zawinski; 2002.

# @info screen saver description
source: Draws a 3D juggling stick-man. http://en.wikipedia.org/wiki/Siteswap Written by Tim Auckland and Jamie Zawinski; 2002.
de: Zeichnet ein jonglierendes Strichmännchen in 3D (http://de.wikipedia.org/wiki/Siteswap). Geschrieben von Tim Auckland und Jamie Zawinski; 2002.

# @info screen saver description
source: Animates the Julia set (a close relative of the Mandelbrot set). The small moving dot indicates the control point from which the rest of the image was generated. See also the "Discrete" screen saver. http://en.wikipedia.org/wiki/Julia_set Written by Sean McCullough; 1997.
de: Animation der Julia-Menge, verwandt mit der Mandelbrot-Menge. Der kleine sich bewegende Punkt zeigt den Kontrollpunkt, von dem der Rest des Bildes generiert wurde. Siehe auch den Bildschirmschoner „Diskret“. https://de.wikipedia.org/wiki/Julia_Menge. Geschrieben 1997 von Sean McCullough.

# @item:inrange Count
source: Lots
de: Viele

# @label:slider
source: Iterations
de: Wiederholungen

# @item:inrange Iterations
source: Small
de: Wenige

# @item:inrange Iterations
source: Large
de: Viele

# @item screen saver name
source: Kaleidescope
de: Kaleidoskop

# @info screen saver description
source: A simple kaleidoscope made of line segments. See "GLeidescope" for a more sophisticated take. http://en.wikipedia.org/wiki/Kaleidoscope Written by Ron Tapia; 1997.
de: Ein einfaches Kaleidoskop aus Linienabschnitten. Siehe auch das kompliziertere „Kaleidoskop (GL)“ (http://de.wikipedia.org/wiki/Kaleidoskop). Geschrieben von Ron Tapia; 1997.

# @info screen saver description
source: A simple kaleidoscope. See also "GLeidescope". http://en.wikipedia.org/wiki/Kaleidoscope Written by Ron Tapia; 1997.
de: Ein einfaches Kaleidoskop. Siehe auch „Kaleidoskop (GL)“ (http://de.wikipedia.org/wiki/Kaleidoskop). Geschrieben von Ron Tapia; 1997.

# @label:slider
source: Segments
de: Abschnitte

# @item:inrange Segments
source: Few
de: Wenige

# @item:inrange Segments
source: Many
de: Viele

# @label:slider
source: Symmetry
de: Symmetrie

# @label:slider
source: Trails
de: Spuren

# @item:inrange Trails
source: Few
de: Wenige

# @item:inrange Trails
source: Many
de: Viele

# @item screen saver name
source: Kaleidocycle
de: Kaleidoskop-Zyklus

# @info screen saver description
source: Draw a ring composed of tetrahedra connected at the edges that twists and rotates toroidally. When a series of tetrahedra are joined at the edges in a loop, it is possible for them to rotate continously through the center without deforming. This only works with an even number of tetrahedra, and there must be eight or more, or they don't fit. Written by Jamie Zawinski; 2013.
de: Zeichnet einen Ring aus dreieckigen Tetraedern, die an einer Kante verbunden sind und sich verwinden und ringförmig drehen. Wenn eine Reihe von Tetraedern an den Kanten zu einem Kreis verbunden werden, können sie sich fortlaufend im die Mitte drehen, ohne verformt zu werden. Dies funktioniert nur mit einer geraden Anzahl von mehr als acht Tetraedern. Geschrieben 2013 von Jamie Zawinski

# @item screen saver name
source: Klein
de: Kleinsche Flasche

# @info screen saver description
source: This animates a Klein bottle, the 4D analog of a moebius strip. You can walk on the surface of the bottle or rotate it in 4D or walk on it while it rotates in 4D. Inspired by Thomas Banchoff's book "Beyond the Third Dimension: Geometry, Computer Graphics, and Higher Dimensions", Scientific American Library, 1990. http://en.wikipedia.org/wiki/Klein_bottle Written by Carsten Steger; 2008.
de: Animiert eine Kleinsche Flasche, das vierdimensionale Gegenstück zum Möbiusband. Sie können auf der Oberfläche der Kleinschen Flasche laufen, sie in 4D drehen oder beides kombinieren. Inspiriert von Thomas Banchoffs Buch „Beyond the Third Dimension: Geometry, Computer Graphics, and Higher Dimensions“, Scientific American Library, 1990. http://de.wikipedia.org/wiki/Kleinsche_Flasche Geschrieben 2008 von Carsten Steger

# @info screen saver description
source: This shows a 4D Klein bottle. You can walk on the Klein bottle or rotate it in 4D or walk on it while it rotates in 4D. Inspired by Thomas Banchoff's book "Beyond the Third Dimension: Geometry, Computer Graphics, and Higher Dimensions", Scientific American Library, 1990. http://en.wikipedia.org/wiki/Klein_bottle Written by Carsten Steger; 2008.
de: Dieser Bildschirmschoner zeigt eine 4-Dimensionale Kleinsche Flasche. Sie können auf der Kleinschen Flasche laufen, sie in 4D drehen oder beides kombinieren. Inspiriert von Thomas Banchoffs Buch „Beyond the Third Dimension: Geometry, Computer Graphics, and Higher Dimensions“, Scientific American Library, 1990. http://en.wikipedia.org/wiki/Klein_bottle Geschrieben 2008 von Carsten Steger

# @option:radio
source: Figure 8
de: Figur 8

# @option:radio
source: Random motion
de: Zufällige Bewegung

# @option:radio
source: Walk
de: Laufen

# @option:radio
source: Turn
de: Drehen

# @option:radio
source: Walk and turn
de: Laufen und drehen

# @option:check
source: Show orientation marks
de: Orientierungssymbol anzeigen

# @option:radio
source: Random surface
de: Zufällige Fläche

# @option:radio
source: Wireframe mesh
de: Drahtgitternetz

# @option:radio
source: Solid surface
de: Feste Oberfläche

# @option:radio
source: Transparent surface
de: Transparente Oberfläche

# @option:radio
source: Random pattern
de: Zufälliges Muster

# @option:radio
source: See-through bands
de: Klarsichtbänder

# @option:radio
source: Rainbow colors
de: Regenbogenfarben

# @option:radio
source: 4d depth colors
de: 4D-Farbentiefe

# @option:radio
source: Random 3D
de: Zufällig 3D

# @option:radio
source: Random 4D
de: Zufällig 4D

# @label:slider
source: Walking direction
de: Laufrichtung

# @label:slider
source: Walking speed
de: Laufgeschwindigkeit

# @info screen saver description
source: Spiraling, spinning, and very, very fast splashes of color rush toward the screen. Written by Teemu Suutari; 1998.
de: Spiralförmige, drehende und sehr schnelle Farbspritzer, die sich über den Bildschirm bewegen. Geschrieben von Teemu Suutari; 1998.

# @option:check
source: Randomize
de: Zufällig anordnen

# @info screen saver description
source: Animates a simulation of Lemarchand's Box, the Lament Configuration, repeatedly solving itself. Warning: occasionally opens doors. http://en.wikipedia.org/wiki/Lemarchand%27s_box Written by Jamie Zawinski; 1998.
de: Simuliert LeMarchands-Schachtel, die „Lament Configuration“, die sich immer wieder selbst löst. Vorsicht: öffnet hin und wieder Dimensionstore. Siehe auch: http://de.wikipedia.org/wiki/Hellraiser_–_Das_Tor_zur_Hölle http://en.wikipedia.org/wiki/Lemarchand%27s_box . Geschrieben von Jamie Zawinski; 1998.

# @info screen saver description
source: This screen saver was removed from the XScreenSaver distribution as of version 5.08. Moving radiating lines, that look vaguely like scanning laser beams. (Frankie say relax.) Written by Pascal Pensa; 1997.
de: Dieser Bildschirmschoner ist in XScreenSaver ab Version 5.08 nicht mehr enthalten. Sich bewegende, radiale Linien, die etwas wie Strahlen eines Laserscanners aussehen. Geschrieben von Pascal Pensa; 1997.

# @item screen saver name
source: Lavalite
de: Lavalampe

# @info screen saver description
source: Draws a 3D Simulation a Lava Lite(r). Odd-shaped blobs of a mysterious substance are heated, slowly rise to the top of the bottle, and then drop back down as they cool. This simulation requires a fairly fast machine (both CPU and 3D performance.) "LAVA LITE(r) and the configuration of the LAVA(r) brand motion lamp are registered trademarks of Haggerty Enterprises, Inc. The configuration of the globe and base of the motion lamp are registered trademarks of Haggerty Enterprises, Inc. in the U.S.A. and in other countries around the world." http://en.wikipedia.org/wiki/Lava_lamp http://en.wikipedia.org/wiki/Metaballs http://en.wikipedia.org/wiki/Lavarand Written by Jamie Zawinski; 2002.
de: Zeichnet eine 3D-Simulation eine Lava-Lampe(r): Seltsam geformte Tropfen einer mysteriösen Substanz werden erhitzt, steigen langsam in der Flasche auf und fallen dann wieder herunter, wenn sie abkühlen. Dieses Programm erfordert OpenGL und einen relativ schnellen Rechner (sowohl CPU als auch 3D-Performance). „LAVA LITE(r) und die Konfiguration der LAVA(r)-Marke Bewegungslampe sind eingetragene Warenzeichen der Haggerty Enterprises, Inc. Die Konfiguration des Globus und Basis der Bewegungslampe sind eingetragene Warenzeichen der Haggerty Enterprises, Inc. in den USA und in anderen Ländern auf der ganzen Welt.“ http://de.wikipedia.org/wiki/Lavalampe http://de.wikipedia.org/wiki/Metaball Geschrieben von Jamie Zawinski; 2002.

# @info screen saver description
source: Draws a 3D Simulation a Lava Lite(r). Odd-shaped blobs of a mysterious substance are heated, slowly rise to the top of the bottle, and then drop back down as they cool. This simulation requires a fairly fast machine (both CPU and 3D performance.) "LAVA LITE(r) and the configuration of the LAVA(r) brand motion lamp are registered trademarks of Haggerty Enterprises, Inc. The configuration of the globe and base of the motion lamp are registered trademarks of Haggerty Enterprises, Inc. in the U.S.A. and in other countries around the world." http://en.wikipedia.org/wiki/Lava_lamp http://en.wikipedia.org/wiki/Metaballs Written by Jamie Zawinski; 2002.
de: Zeichnet eine 3D-Simulation eine Lava-Lampe(r): Seltsam geformte Tropfen einer mysteriösen Substanz werden erhitzt, steigen langsam in der Flasche auf und fallen dann wieder herunter, wenn sie abkühlen. Dieses Programm erfordert OpenGL und einen relativ schnellen Rechner (sowohl CPU als auch 3D-Performance). „LAVA LITE(r) und die Konfiguration der LAVA(r)-Marke Bewegungslampe sind eingetragene Warenzeichen der Haggerty Enterprises, Inc. Die Konfiguration des Globus und Basis der Bewegungslampe sind eingetragene Warenzeichen der Haggerty Enterprises, Inc. in den USA und in anderen Ländern auf der ganzen Welt.“ http://de.wikipedia.org/wiki/Lavalampe http://de.wikipedia.org/wiki/Metaball Geschrieben von Jamie Zawinski; 2002.

# @label:slider
source: Max blobs
de: Max. Kleckse

# @item:inrange Resolution
source: Low
de: Niedrig

# @item:inrange Resolution
source: High
de: Hoch

# @option:check
source: Impatient
de: Ungeduldig

# @option:check
source: Smooth
de: Weich

# @option:radio
source: Classic Lavalite
de: Klassische Lavalampe

# @option:radio
source: Giant Lavalite
de: Riesige Lavalampe

# @option:radio
source: Cone Lavalite
de: Lavalampe in Kegelform

# @option:radio
source: Rocket Lavalite
de: Lavalampe in Raketenform

# @option:radio
source: Random Lamp Style
de: Zufällige Lampenart
