Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/kdeartwork/kxsconfig.po
Languages: de

# @info screen saver description
source: This generates random inkblot patterns via a reflected random walk. Any deep-seated neurotic tendencies which this program reveals are your own problem. http://en.wikipedia.org/wiki/Rorschach_inkblot_test http://en.wikipedia.org/wiki/Random_walk Written by Jamie Zawinski; 1992.
de: Dieser Bildschirmschoner generiert zufällige Tintenklecksmuster aus einer reflektieren Zufallsbewegung (Random Walk). Alle tiefliegenden neurotischen Tendenzen, die dieses Programm aufdeckt, sind Ihr eigenes Problem. http://de.wikipedia.org/wiki/Rorschachtest http://de.wikipedia.org/wiki/Random_Walk Geschrieben 1997 von Jamie Zawinski.

# @option:check
source: With X symmetry
de: Mit X-Symmetrie

# @option:check
source: With Y symmetry
de: Mit Y-Symmetrie

# @info screen saver description
source: This screen saver was removed from the XScreenSaver distribution as of version 5.08. Draws a line segment moving along a complex spiraling curve. Written by Tom Lawrence; 1997.
de: Dieser Bildschirmschoner ist in XScreenSaver ab Version 5.08 nicht mehr enthalten. Zeichnet ein Liniensegment, das sich auf einer komplexen Spiralbahn bewegt. Geschrieben von Tom Lawrence; 1997.

# @label:slider
source: Length
de: Länge

# @item:inrange Length
source: Short
de: Kurz

# @item:inrange Length
source: Long
de: Lang

# @item screen saver name
source: RotZoomer
de: Rotieren und Vergrößern

# @info screen saver description
source: Distorts an image by rotating and scaling random sections of it. Written by Claudio Matsuoka; 2001.
de: Verzerrt ein Bild durch Drehen und Skalieren zufälliger Ausschnitten des Bilds. Geschrieben von Claudio Matsuoka; 2001.

# @info screen saver description
source: Creates a collage of rotated and scaled portions of the screen. Written by Claudio Matsuoka; 2001.
de: Zeichnet eine Collage von rotierten und skalierten Ausschnitten des Bildschirms. Geschrieben von Claudio Matsuoka; 2001.

# @label:spinbox
source: Rectangle count
de: Anzahl von Rechtecken

# @option:radio
source: Stationary rectangles
de: Stationäre Rechtecke

# @option:radio
source: Wandering rectangles
de: Bewegende Rechtecke

# @option:radio
source: Sweeping arcs
de: Wischende Bögen

# @option:check
source: Animate
de: Animation

# @item screen saver name
source: Rubik
de: Rubiks Würfel

# @info screen saver description
source: Draws a Rubik's Cube that rotates in three dimensions and repeatedly shuffles and solves itself. See also the "GLSnake" and "Cube21" screen savers. http://en.wikipedia.org/wiki/Rubik%27s_Cube Written by Marcelo Vianna; 1997.
de: Zeichnet einen „Rubik-Würfel“, der sich in drei Dimensionen dreht und sich dabei mischt und selbst löst (http://de.wikipedia.org/wiki/Zauberwürfel). Schauen Sie sich auch die Bildschirmschoner „GL-Schlange“ und „Cube 21“ an. Geschrieben von Marcelo Vianna; 1997.

# @option:check
source: Hide shuffling
de: Mischen verbergen

# @info screen saver description
source: Animates the Rubik's Mirror Blocks puzzle. See also the "Rubik", "Cube21", and "GLSnake" screen savers. http://en.wikipedia.org/wiki/Combination_puzzles#Irregular_cuboids Written by Vasek Potocek; 2009.
de: Animiert ein Rubik's Mirror Blocks Puzzle (http://en.wikipedia.org/wiki/Combination_puzzles#Irregular_cuboids). Siehe auch die Bildschirmschoner „Rubiks Würfel“, „Cube 21“ und „GL-Schlange“. Geschrieben von Vasek Potocek; 2009.

# @info screen saver description
source: Animates the Rubik's Mirror Blocks puzzle. See also the "Rubik", "Cube21", and "GLSnake" screen savers. http://en.wikipedia.org/wiki/Combination_puzzles#Irregular_Cuboids Written by Vasek Potocek; 2009.
de: Animiert ein Rubik's Mirror Blocks Puzzle (http://en.wikipedia.org/wiki/Combination_puzzles#Irregular_cuboids). Siehe auch die Bildschirmschoner „Rubiks Würfel“, „Cube 21“ und „GL-Schlange“. Geschrieben von Vasek Potocek; 2009.

# @item screen saver name
source: SBalls
de: Rotierende Bälle

# @info screen saver description
source: Draws an animation of textured balls spinning like crazy. Written by Eric Lassauge; 2002.
de: Zeichnet eine Animation von sich verrückt drehenden, strukturierten Bällen. Geschrieben von Eric Lassauge; 2002.

# @option:radio
source: Plane
de: Ebene

# @option:radio
source: Pyramid
de: Pyramide

# @option:radio
source: Star
de: Stern

# @info screen saver description
source: This draws smoothly-shaded oscillating oval patterns that look something like vapor trails or neon tubes. Written by Shane Smit; 1999.
de: Zeichnet ein weich schattiertes, oval oszillierendes Muster, das wie Kondensstreifen oder Neonröhren aussieht. Geschrieben von Shane Smit; 1999.

# @item:inrange Count
source: One
de: Eins

# @info screen saver description
source: This draws the two-dimensional variant of the recursive Sierpinski triangle fractal. See also the "Sierpinski3D" screen saver. http://en.wikipedia.org/wiki/Sierpinski_triangle Written by Desmond Daignault; 1997.
de: Zeichnet eine zweidimensionale Variante des rekursiven Sierpinski-Dreieckfraktals. Siehe auch Bildschirmschoner "Sierpinski3D". http://de.wikipedia.org/wiki/Sierpinski-Dreieck. Geschrieben von Desmond Daignault.

# @label:slider
source: Points
de: Punkte

# @item:inrange Points
source: Few
de: Wenige

# @item:inrange Points
source: Many
de: Viele

# @info screen saver description
source: The recursive Sierpinski tetrahedron fractal. http://en.wikipedia.org/wiki/Sierpinski_triangle#Analogs_in_higher_dimension Written by Jamie Zawinski and Tim Robinson; 1999.
de: Zeichnet die rekursive fraktale Sierpinski-Pyramide. http://de.wikipedia.org/wiki/Sierpinski-Dreieck#Sierpinski-Pyramide. Geschrieben von Jamie Zawinski und Tim Robinson; 1999.

# @info screen saver description
source: This draws the Sierpinski tetrahedron fractal, the three-dimensional variant of the recursive Sierpinski triangle. http://en.wikipedia.org/wiki/Sierpinski_triangle#Analogs_in_higher_dimension Written by Jamie Zawinski and Tim Robinson; 1999.
de: Zeichnet die fraktale Sierpinski-Pyramide, eine dreidimensionale Variante des rekursiven Sierpinski-Dreieck. http://de.wikipedia.org/wiki/Sierpinski-Dreieck#Sierpinski-Pyramide. Geschrieben von Jamie Zawinski und Tim Robinson; 1999.

# @info screen saver description
source: There is a tentacled abomination in the sky. From above you it devours. Written by Jamie Zawinski; 2008.
de: Am Himmel befindet sich ein Monster mit Tentakeln, das etwas zu verschlingen versucht. Geschrieben von Jamie Zawinski; 2008.

# @label:slider
source: Flexibility
de: Elastizität

# @item:inrange Flexibility
source: Low
de: Niedrig

# @item:inrange Flexibility
source: High
de: Hoch

# @label:slider
source: Wiggliness
de: Taumelstärke

# @item:inrange Wiggliness
source: Low
de: Niedrig

# @item:inrange Wiggliness
source: High
de: Hoch

# @label:slider
source: X resolution
de: X-Auflösung

# @item:inrange X resolution
source: Low
de: Niedrig

# @item:inrange X resolution
source: High
de: Hoch

# @label:slider
source: Y resolution
de: Y-Auflösung

# @item:inrange Y resolution
source: Low
de: Niedrig

# @item:inrange Y resolution
source: High
de: Hoch

# @option:check
source: Draw skin
de: Haut zeichnen

# @option:check
source: Cartoony
de: Cartoon-mäßig

# @option:check
source: Tentacles can intersect
de: Tentakeln dürfen sich überschneiden

# @item screen saver name
source: SlideScreen
de: Schiebepuzzle

# @info screen saver description
source: A variant on a "fifteen puzzle", operating on the screen or an image. It divides the image into a grid and randomly shuffles the squares. http://en.wikipedia.org/wiki/Fifteen_puzzle Written by Jamie Zawinski; 1994.
de: Eine Variante des „15er-Puzzle“, das aus dem Bildschirmhintergrund oder einen Bild entsteht Das Bild wird in ein Gitter geteilt und die Quadrate werden zufällig gemischt. http://de.wikipedia.org/wiki/15-Puzzle Geschrieben von Jamie Zawinski; 1994.

# @info screen saver description
source: This takes an image, divides it into a grid, and then randomly shuffles the squares around as if it was one of those "fifteen-puzzle" games where there is a grid of squares, one of which is missing. http://en.wikipedia.org/wiki/Fifteen_puzzle Written by Jamie Zawinski; 1994.
de: Nimmt ein Bild, teilt es in ein Kachelmuster und verschiebt dann die Quadrate zufällig wie bei dem „15er-Puzzle“, bei dem auf einem 4×4-Feld 15 Steine liegen und durch verschieben sortiert werden müssen (http://de.wikipedia.org/wiki/15-Puzzle). Geschrieben von Jamie Zawinski; 1994.

# @item:inrange Pause
source: Short
de: Kurz

# @item:inrange Pause
source: Long
de: Lang

# @label:slider
source: Slide speed
de: Schiebegeschwindigkeit

# @item:inrange Slide speed
source: Slow
de: Langsam

# @item:inrange Slide speed
source: Fast
de: Schnell

# @label:spinbox
source: Gutter size
de: Gittergröße

# @info screen saver description
source: This throws some random bits on the screen, then sucks them through a jet engine and spews them out the other side. To avoid turning the image completely to mush, every now and then it will it interject some splashes of color into the scene, or go into a spin cycle, or stretch the image like taffy. Written by Scott Draves and Jamie Zawinski; 1997.
de: Zeichnet zufällige Punkte auf den Bildschirm, die dann durch ein Jet-Triebwerk gesaugt und auf der anderen Seite ausgespuckt werden. Um das Bild nicht ganz zu Brei werden zu lassen, werden verschiedene Effekte angewandt: Farbflecken hinzufügen, Schleudergang oder Bild der Arbeitsfläche „durchkauen“. Geschrieben von Scott Draves und Jamie Zawinski; 1997.

# @info screen saver description
source: This draws a sonar screen that pings (get it?) the hosts on your local network, and plots their distance (response time) from you. The three rings represent ping times of approximately 2.5, 70 and 2,000 milliseconds respectively. Alternately, it can run a simulation that doesn't involve hosts. http://en.wikipedia.org/wiki/Ping#History Written by Jamie Zawinski and Stephen Martin; 1998.
de: Dieses Programm zeichnet eine Simulation eines Echolots, das die Rechner in Ihrem lokalen Netzwerk pingt (verstanden?) und deren Entfernung (Antwortzeit) von Ihnen in einem Graphen darstellt. Die drei Ringe repräsentieren Ping-Zeiten von ca. 2,5, 70 und 2.000 Millisekunden. Alternativ kann es Simulationen ausführen, die nicht auf Rechner zurückgreifen. http://de.wikipedia.org/wiki/Ping_(Datenübertragung) Geschrieben von Jamie Zawinski und Stephen Martin; 1998.

# @info screen saver description
source: This draws a sonar screen that pings (get it?) the hosts on your local network, and plots their distance (response time) from you. The three rings represent ping times of approximately 2.5, 70 and 2,000 milliseconds respectively. Alternately, it can run a simulation that doesn't involve hosts. (If pinging doesn't work on Linux, you may need to make the executable be setuid.) http://en.wikipedia.org/wiki/Ping#History Written by Jamie Zawinski and Stephen Martin; 1998.
de: Dieses Programm zeichnet eine Simulation eines Echolots, das die Rechner in Ihrem lokalen Netzwerk pingt (verstanden?) und deren Entfernung (Antwortzeit) von Ihnen in einem Graphen darstellt. Die drei Ringe repräsentieren Ping-Zeiten von ca. 2,5, 70 und 2.000 Millisekunden. Alternativ kann es Simulationen ausführen, die nicht auf Rechner zurückgreifen. (Falls Ping nicht funktioniert, müssen Sie unter Linux auf die ausführbare Datei vielleicht setuid anwenden.) http://de.wikipedia.org/wiki/Ping_(Datenübertragung) Geschrieben von Jamie Zawinski und Stephen Martin; 1998.

# @info screen saver description
source: This draws a sonar screen that pings (get it?) the hosts on your local network, and plots their distance (response time) from you. The three rings represent ping times of approximately 2.5, 70 and 2,000 milliseconds respectively. Alternately, it can run a simulation that doesn't involve hosts. (If pinging doesn't work, you may need to make the executable be setuid.) http://en.wikipedia.org/wiki/Ping#History Written by Jamie Zawinski and Stephen Martin; 1998.
de: Dieses Programm zeichnet eine Simulation eines Echolots, das die Rechner in Ihrem lokalen Netzwerk pingt (verstanden?) und deren Entfernung (Antwortzeit) von Ihnen in einem Graphen darstellt. Die drei Ringe repräsentieren Ping-Zeiten von ca. 2,5, 70 und 2.000 Millisekunden. Alternativ kann es Simulationen ausführen, die nicht auf Rechner zurückgreifen. (Falls Ping nicht funktioniert, müssen Sie auf die ausführbare Datei vielleicht setuid anwenden.) http://de.wikipedia.org/wiki/Ping_(Datenübertragung) Geschrieben von Jamie Zawinski und Stephen Martin; 1998.

# @option:radio
source: Ping local subnet
de: Lokales Netzwerk überprüfen (Ping)

# @option:radio
source: Ping subnet/24 (254 hosts)
de: Subnetz/24 pingen (254 Rechner)

# @option:radio
source: Ping subnet/25 (126 hosts)
de: Subnetz/25 pingen (126 Rechner)

# @option:radio
source: Ping subnet/26 (62 hosts)
de: Subnetz/26 pingen (62 Rechner)

# @option:radio
source: Ping subnet/27 (31 hosts)
de: Subnetz/27 pingen (31 Rechner)

# @option:radio
source: Ping subnet/28 (14 hosts)
de: Subnetz/28 pingen (14 Rechner)

# @option:radio
source: Ping subnet/29 (6 hosts)
de: Subnetz/29 pingen (6 Rechner)

# @option:radio
source: Ping subnet/30 (2 hosts)
de: Subnetz/30 pingen (2 Rechner)

# @option:radio
source: Ping known SSH hosts
de: Bekannte SSH-Rechner pingen

# @option:radio
source: Ping Google, Facebook, etc.
de: Google, Facebook usw. pingen

# @option:radio
source: Simulation (don't ping)
de: Simulation (kein Ping)

# @label:slider
source: Font size
de: Schriftgröße

# @item:inrange Font size
source: Tiny
de: Sehr klein

# @item:inrange Font size
source: Huge
de: Riesig

# @label:textbox
source: Simulation team A name
de: Name von Team A in der Simulation

# @label:spinbox
source: A count
de: Anzahl A

# @label:textbox
source: Simulation team B name
de: Name von Team B in der Simulation

# @label:spinbox
source: B count
de: Anzahl B

# @option:check
source: Resolve host names
de: Rechnernamen auflösen

# @option:check
source: Show ping times
de: Ping-Zeiten anzeigen

# @item screen saver name
source: SpeedMine
de: Tunnelfahrt

# @info screen saver description
source: Simulates speeding down a rocky mineshaft, or a funky dancing worm. Written by Conrad Parker; 2001.
de: Simuliert das Rasen durch einen steinigen Minentunnel oder einen tanzenden Wurm. Geschrieben von Conrad Parker; 2001.

# @label:slider
source: Max velocity
de: Maximale Geschwindigkeit

# @item:inrange Max velocity
source: Slow
de: Langsam

# @item:inrange Max velocity
source: Fast
de: Schnell

# @label:slider
source: Thrust
de: Schubkraft

# @item:inrange Thrust
source: Slow
de: Langsam

# @item:inrange Thrust
source: Fast
de: Schnell

# @item:inrange Gravity
source: Low
de: Niedrig

# @item:inrange Gravity
source: High
de: Hoch

# @option:radio
source: Worm
de: Wurm

# @option:check
source: Rocky walls
de: Steinige Wände

# @option:check
source: Allow wall collisions
de: Kollisionen mit Wänden erlauben

# @option:check
source: Present bonuses
de: Bonus aktivieren

# @option:check
source: Display crosshair
de: Fadenkreuz anzeigen

# @item screen saver name
source: Sphere
de: Kugel

# @info screen saver description
source: This screen saver was removed from the XScreenSaver distribution as of version 5.08. Draws shaded spheres in multiple colors. Written by Tom Duff and Jamie Zawinski; 1982, 1997.
de: Dieser Bildschirmschoner ist in XScreenSaver ab Version 5.08 nicht mehr enthalten. Zeichnet schattierte Kugeln in verschiedenen Farben. Geschrieben von Tom Duff und Jamie Zawinski; 1982, 1997.

# @item screen saver name
source: Spheremonics
de: Sphärenharmonie

# @info screen saver description
source: These closed objects are commonly called spherical harmonics, although they are only remotely related to the mathematical definition found in the solution to certain wave functions, most notably the eigenfunctions of angular momentum operators. http://en.wikipedia.org/wiki/Spherical_harmonics#Visualization_of_the_spherical_harmonics Written by Paul Bourke and Jamie Zawinski; 2002.
de: Diese geschlossenen Objekte werden sphärische Harmonien genannt, obwohl sie nur entfernt mit der mathematischen Definition verwandt sind, die in der Lösung einiger Wellenfunktionen vorkommt (Eigenwerte von Winkelgeschwindigkeitsoperatoren) (http://de.wikipedia.org/wiki/Kugelfl%C3%A4chenfunktionen). Geschrieben von Paul Bourke und Jamie Zawinski; 2002.

# @option:check
source: Smoothed lines
de: Geglättete Linien

# @item screen saver name
source: Spiral
de: Spirale

# @info screen saver description
source: This screen saver was removed from the XScreenSaver distribution as of version 5.08. Moving circular moire patterns. Written by Peter Schmitzberger; 1997.
de: Dieser Bildschirmschoner ist in XScreenSaver ab Version 5.08 nicht mehr enthalten. Bewegte kreisförmige Moiremuster. Geschrieben von Peter Schmitzberger: 1997.

# @item:inrange Cycles
source: Low
de: Niedrig

# @item:inrange Cycles
source: High
de: Hoch

# @item screen saver name
source: Spotlight
de: Scheinwerferlicht

# @info screen saver description
source: A spotlight scanning across a black screen, illuminating a loaded image when it passes. Written by Rick Schultz and Jamie Zawinski; 1999.
de: Ein Scheinwerferlicht fährt über einen schwarzen Bildschirm und erleuchtet ein geladenes Bild beim Passieren. Geschrieben von Rick Schultz und Jamie Zawinski; 1999.

# @info screen saver description
source: Draws a spotlight scanning across a black screen, illuminating the underlying desktop (or a picture) when it passes. Written by Rick Schultz and Jamie Zawinski; 1999.
de: Zeichnet ein Scheinwerferlicht, das über einen schwarzen Bildschirm fährt und die darunterliegende Arbeitsfläche (oder ein Bild) erleuchtet. Geschrieben von Rick Schultz und Jamie Zawinski; 1999.

# @label:slider
source: Spotlight size
de: Scheinwerfergröße

# @item:inrange Spotlight size
source: Small
de: Klein

# @item:inrange Spotlight size
source: Large
de: Groß

# @item screen saver name
source: Sproingies
de: Sprungfeder

# @info screen saver description
source: Slinky-like creatures walk down an infinite staircase and occasionally explode! http://en.wikipedia.org/wiki/Slinky http://en.wikipedia.org/wiki/Q%2Abert http://en.wikipedia.org/wiki/Marble_Madness Written by Ed Mackey; 1997.
de: Kreaturen wie Schraubenfedern (Slinky) gehen eine unendliche Treppe hinunter und explodieren gelegentlich. http://de.wikipedia.org/wiki/Slinky http://de.wikipedia.org/wiki/Q*bert http://de.wikipedia.org/wiki/Marble_Madness Geschriebenen von 1997 Ed Mackey.

# @label:slider
source: Sproingies
de: Sprungfeder

# @item:inrange Sproingies
source: One
de: Eine

# @item:inrange Sproingies
source: Lots
de: Viele

# @option:check
source: Fall off edge
de: Von der Kante fallen

# @info screen saver description
source: Draws a set of interacting, square-spiral-producing automata. The spirals grow outward until they hit something, then they go around it. Written by Jeff Epler; 1999.
de: Zeichnet eine Menge von interagierenden Automaten, die quadratische Spiralen produzieren. Die Spiralen wachsen nach außen, bis sie auf etwas stoßen, das sie dann umgehen. Geschrieben von Jeff Epler; 1999.

# @label:slider
source: Randomness
de: Zufälligkeit

# @item:inrange Randomness
source: Low
de: Niedrig

# @item:inrange Randomness
source: High
de: Hoch

# @label:spinbox
source: Seeds
de: Samen

# @label:slider
source: Handedness
de: Händigkeit

# @item:inrange Handedness
source: Left
de: Links

# @item:inrange Handedness
source: Right
de: Rechts

# @item screen saver name
source: Stairs
de: Treppenstufen

# @info screen saver description
source: Escher's infinite staircase. http://en.wikipedia.org/wiki/Maurits_Cornelis_Escher Written by Marcelo Vianna; 1998.
de: Eschers unendliche Treppen (http://de.wikipedia.org/wiki/M._C._Escher). Geschrieben von Marcelo Vianna; 1998.

# @item screen saver name
source: Starfish
de: Seestern

# @info screen saver description
source: Undulating, throbbing, star-like patterns pulsate, rotate, and turn inside out. Another display mode uses these shapes to lay down a field of colors, which are then cycled. The motion is very organic. Written by Jamie Zawinski; 1997.
de: Gewellte, pochende, sternähnliche Mustern, die pulsieren, rotieren und ihr Inneres nach Außen drehen. In einem anderen Modus werden diese Muster zu Farbfeldern, deren Farben sich zyklisch ändern. Sieht sehr organisch aus. Geschrieben von Jamie Zawinski; 1997.

# @info screen saver description
source: This generates a sequence of undulating, throbbing, star-like patterns which pulsate, rotate, and turn inside out. Another display mode uses these shapes to lay down a field of colors, which are then cycled. The motion is very organic. Written by Jamie Zawinski; 1997.
de: Zeichnet eine Sequenz von gewellten, pochenden, sternähnlichen Mustern, die pulsieren, rotieren und ihr Inneres nach Außen drehen. In einem anderen Modus werden diese Muster zu Farbfeldern, deren Farben sich zyklisch ändern. Sieht sehr organisch aus. Geschrieben von Jamie Zawinski; 1997.

# @option:radio
source: Color gradients
de: Farbverlauf

# @option:radio
source: Pulsating blob
de: Pulsierender Klecks

# @item screen saver name
source: StarWars
de: Krieg der Sterne

# @info screen saver description
source: Draws a stream of text slowly scrolling into the distance at an angle, over a star field, like at the beginning of the movie of the same name. http://en.wikipedia.org/wiki/Star_Wars_opening_crawl Written by Jamie Zawinski and Claudio Matauoka; 2001.
de: Zeichnet vor einem Sternenhintergrund einen Blocktext, der sich langsam auf einen entfernten Punkt zu bewegt. Sieht aus wie in dem Film „Krieg der Sterne“ (http://en.wikipedia.org/wiki/Star_Wars_opening_crawl). Geschrieben von Jamie Zawinski und Claudio Matauoka; 2001.

# @item:inrange
source: Frame rate Low
de: Bildwiederholrate Niedrig

# @item:inrange
source: Scroll speed Slow
de: Laufgeschwindigkeit Langsam

# @item:inrange
source: Fast
de: Schnell

# @item:inrange
source: Stars speed Slow
de: Sterngeschwindigkeit Langsam

# @option:check
source: Wrap long lines
de: Lange Zeilen umbrechen

# @option:check
source: Texture-mapped font
de: Texturen-abgebildete Schriftart

# @option:check
source: Anti-aliased lines
de: Linien glätten

# @option:check
source: Thick lines
de: Dicke Linien

# @option:check
source: Fade out
de: Ausblenden

# @label:spinbox
source: or, Text columns
de: oder Textspalten

# @item screen saver name
source: StonerView
de: Steinplatten

# @info screen saver description
source: Chains of colorful squares dance around each other in complex spiral patterns. Inspired by David Tristram's `electropaint' screen saver, originally written for SGI computers in the late 1980s or early 1990s. Written by Andrew Plotkin; 2001.
de: Kette von farbenfrohen Quadraten, die umeinander in einer komplexen Spirale tanzen. Inspiriert durch David Tristams Electropaint-Bildschirmschoner, den er in den späten 1980er oder frühen 1990er Jahren für SGI-Computer schrieb. Geschrieben von Andrew Plotkin; 2001.

# @option:check
source: Translucent
de: Durchscheinend

# @item screen saver name
source: Strange
de: Seltsam

# @info screen saver description
source: This draws iterations to strange attractors: it's a colorful, unpredictably-animating swarm of dots that swoops and twists around. http://en.wikipedia.org/wiki/Attractor#Strange_attractor Written by Massimino Pascal; 1997.
de: Zeichnet „Seltsame Attraktoren“ (Chaos-Theorie) in einem farbenfrohen, sich chaotisch bewegenden Feld aus Punkten, die sich hin- und herwinden (http://de.wikipedia.org/wiki/Seltsamer_Attraktor). Geschrieben von Massimino Pascal; 1997.

# @label:slider
source: Number of points
de: Anzahl der Punkte
