Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/kdeartwork/kxsconfig.po
Languages: de

# @option:radio
source: Stellated truncated hexahedron
de: Sternförmiger abgestumpfter Hexaeder

# @option:radio
source: Great triakisoctahedron
de: Großes Triakisoktaeder

# @option:radio
source: Great truncated cuboctahedron
de: Großer Kuboktaederstumpf

# @option:radio
source: Great disdyakisdodecahedron
de: Großer Disdyakisdodekaeder

# @option:radio
source: Great rhombihexahedron
de: Großer Rhombenhexaeder

# @option:radio
source: Great rhombihexacron
de: Großer Rhombenhexaeder

# @option:radio
source: Icosidodecahedron
de: Ikosidodekaeder

# @option:radio
source: Rhombic triacontahedron
de: Rhombentriakontaeder

# @option:radio
source: Truncated icosahedron
de: Ikosaederstumpf

# @option:radio
source: Pentakisdodecahedron
de: Pentakisdodekaeder

# @option:radio
source: Truncated dodecahedron
de: Dodekaederstumpf

# @option:radio
source: Triakisicosahedron
de: Triakisoktaeder

# @option:radio
source: Rhombicosidodecahedron
de: Rhombenikosidodekaeder

# @option:radio
source: Deltoidal hexecontahedron
de: Deltoidalhexakontaeder

# @option:radio
source: Truncated icosidodecahedron
de: Ikosidodekaederstumpf

# @option:radio
source: Disdyakistriacontahedron
de: Disdyakistriakontaeder

# @option:radio
source: Snub dodecahedron
de: Abgeschrägtes Dodekaeder

# @option:radio
source: Pentagonal hexecontahedron
de: Pentagonhexakontaeder

# @option:radio
source: Small ditrigonal icosidodecahedron
de: Kleines ditrigonales Ikosidodekaeder

# @option:radio
source: Small triambic icosahedron
de: Kleines triambisches Ikosaeder

# @option:radio
source: Small icosicosidodecahedron
de: Kleines Ikosikosidodekaeder

# @option:radio
source: Small icosacronic hexecontahedron
de: Kleiner Ikosahexakontaeder

# @option:radio
source: Small snub icosicosidodecahedron
de: Kleiner abgeschnittener Ikosikosidodekaeder

# @option:radio
source: Small hexagonal hexecontahedron
de: Kleiner hexagonaler Hexakontaeder

# @option:radio
source: Small dodecicosidodecahedron
de: Kleiner Dodekikosidodekaeder

# @option:radio
source: Small dodecacronic hexecontahedron
de: Kleiner Dodekahexakontaeder

# @option:radio
source: Small stellated dodecahedron
de: Dodekaederstern

# @option:radio
source: Great dodecahedron
de: Großes Dodekaeder

# @option:radio
source: Great dodecadodecahedron
de: Großes Dodekadodekaeder

# @option:radio
source: Medial rhombic triacontahedron
de: Mittleres Rhombentriakontaeder

# @option:radio
source: Truncated great dodecahedron
de: Großer Dodekaederstumpf

# @option:radio
source: Small stellapentakisdodecahedron
de: Kleiner Sternpentakisdodekaeder

# @option:radio
source: Rhombidodecadodecahedron
de: Rhombendodekadodekaeder

# @option:radio
source: Medial deltoidal hexecontahedron
de: Mittlerer Deltoidalhexakontaeder

# @option:radio
source: Small rhombidodecahedron
de: Kleiner Rhombendodekaeder

# @option:radio
source: Small rhombidodecacron
de: Dualer kleiner Rhombendodekaeder

# @option:radio
source: Snub dodecadodecahedron
de: Abgeschrägter Dodekadodekaeder

# @option:radio
source: Medial pentagonal hexecontahedron
de: Mittlerer Pentagonhexakontaeder

# @option:radio
source: Ditrigonal dodecadodecahedron
de: Ditrigonales Dodekadodekaeder

# @option:radio
source: Medial triambic icosahedron
de: Mittleres triambisches Ikosaeder

# @option:radio
source: Great ditrigonal dodecicosidodecahedron
de: Großer ditrigonaler Dodekikosidodekaeder

# @option:radio
source: Great ditrigonal dodecacronic hexecontahedron
de: Großer ditrigonaler Dodekahexakontaeder

# @option:radio
source: Small ditrigonal dodecicosidodecahedron
de: Kleiner ditrigonaler Dodekikosidodekaeder

# @option:radio
source: Small ditrigonal dodecacronic hexecontahedron
de: Kleiner ditrigonaler Dodekahexakontaeder

# @option:radio
source: Icosidodecadodecahedron
de: Ikosidodekadodekaeder

# @option:radio
source: Medial icosacronic hexecontahedron
de: Medialer Ikosahexakontaeder

# @option:radio
source: Icositruncated dodecadodecahedron
de: Ikosidodekadodekaederstumpf

# @option:radio
source: Tridyakisicosahedron
de: Tridiakisikosaeder

# @option:radio
source: Snub icosidodecadodecahedron
de: Abgeschnittener Ikosidodekadodekaeder

# @option:radio
source: Medial hexagonal hexecontahedron
de: Mittlerer hexagonaler Hexakontaeder

# @option:radio
source: Great ditrigonal icosidodecahedron
de: Großes ditrigonales Ikosidodekaeder

# @option:radio
source: Great triambic icosahedron
de: Großes triambisches Ikosaeder

# @option:radio
source: Great icosicosidodecahedron
de: Großes Ikosikosidodekaeder

# @option:radio
source: Great icosacronic hexecontahedron
de: Großer Ikosahexakontaeder

# @option:radio
source: Small icosihemidodecahedron
de: Kleines Ikosihemidodekaeder

# @option:radio
source: Small icosihemidodecacron
de: Dualer kleiner Ikosihemidodekaeder

# @option:radio
source: Small dodecicosahedron
de: Kleines Dodekaikosaeder

# @option:radio
source: Small dodecicosacron
de: Kleiner Dodekikosaeder

# @option:radio
source: Small dodecahemidodecahedron
de: Kleines Dodekahemidodekaeder

# @option:radio
source: Small dodecahemidodecacron
de: Kleiner Dodekahemidodekaeder

# @option:radio
source: Great stellated dodecahedron
de: Ikosaederstern

# @option:radio
source: Great icosahedron
de: Großes Ikosaeder

# @option:radio
source: Great icosidodecahedron
de: Großes Ikosidodekaeder

# @option:radio
source: Great rhombic triacontahedron
de: Großes Rhombentriakontaeder

# @option:radio
source: Great truncated icosahedron
de: Großer Ikosaederstumpf

# @option:radio
source: Great stellapentakisdodecahedron
de: Großer Sternpentakisdodekaeder

# @option:radio
source: Rhombicosahedron
de: Rhombenikosaeder

# @option:radio
source: Rhombicosacron
de: Dualer Rhombenikosaeder

# @option:radio
source: Great snub icosidodecahedron
de: Großer abgeschnittener Ikosidodekaeder

# @option:radio
source: Great pentagonal hexecontahedron
de: Großer Pentagonhexakontaeder

# @option:radio
source: Small stellated truncated dodecahedron
de: Kleiner sternförmiger Dodekaederstumpf

# @option:radio
source: Great pentakisdodekahedron
de: Großer Pentakisdodekaeder

# @option:radio
source: Truncated dodecadodecahedron
de: Dodekadodekaederstumpf

# @option:radio
source: Medial disdyakistriacontahedron
de: Mittleres Hexakisikosaeder

# @option:radio
source: Inverted snub dodecadodecahedron
de: Invertierter abgeschnittener Dodekadodekaeder

# @option:radio
source: Medial inverted pentagonal hexecontahedron
de: Medialer invertierter Pentahexakontaeder

# @option:radio
source: Great dodecicosidodecahedron
de: Großer Dodekikosidodekaeder

# @option:radio
source: Great dodecacronic hexecontahedron
de: Großer Dodekahexakontaeder

# @option:radio
source: Small dodecahemicosahedron
de: Kleiner Dodekahemikosaeder

# @option:radio
source: Small dodecahemicosacron
de: Kleiner Dodekahemikosaeder

# @option:radio
source: Great dodecicosahedron
de: Großer Dodekaikosaeder

# @option:radio
source: Great dodecicosacron
de: Großer Dodekikosaeder

# @option:radio
source: Great snub dodecicosidodecahedron
de: Großer abgeschnittener Dodekikosidodekaeder

# @option:radio
source: Great hexagonal hexecontahedron
de: Großer hexagonaler Hexakontaeder

# @option:radio
source: Great dodecahemicosahedron
de: Großer Dodekahemikosaeder

# @option:radio
source: Great dodecahemicosacron
de: Großer Dodekahemikosaeder

# @option:radio
source: Great stellated truncated dodecahedron
de: Großer abgeschnittener Ikosaederstern

# @option:radio
source: Great triakisicosahedron
de: Großes Triakisikosaeder

# @option:radio
source: Great rhombicosidodecahedron
de: Großes Rhombenikosidodekaeder

# @option:radio
source: Great deltoidal hexecontahedron
de: Großer Deltoidalhexakontaeder

# @option:radio
source: Great truncated icosidodecahedron
de: Ikosidodekaederstumpf

# @option:radio
source: Great disdyakistriacontahedron
de: Großes Hexakisikosaeder

# @option:radio
source: Great inverted snub icosidodecahedron
de: Großer invertierter abgeschnittener Ikosidodekaeder

# @option:radio
source: Great inverted pentagonal hexecontahedron
de: Großer invertierter Pentagonhexakontaeder

# @option:radio
source: Great dodecahemidodecahedron
de: Großes Dodekahemidodekaeder

# @option:radio
source: Great dodecahemidodecacron
de: Großer Dodekahemidodekaeder

# @option:radio
source: Great icosihemidodecahedron
de: Großes Ikosihemidodekaeder

# @option:radio
source: Great icosihemidodecacron
de: Großer Ikosikosidodekaeder

# @option:radio
source: Small retrosnub icosicosidodecahedron
de: Kleiner Retrosnub-Ikosikosidodekaeder

# @option:radio
source: Small hexagrammic hexecontahedron
de: Kleiner Hexahexakontaeder

# @option:radio
source: Great rhombidodecahedron
de: Großer Rhombendodekaeder

# @option:radio
source: Great rhombidodecacron
de: Großer Rhombendodekaeder

# @option:radio
source: Great retrosnub icosidodecahedron
de: Großer Retrosnub-Ikosidodekaeder

# @option:radio
source: Great pentagrammic hexecontahedron
de: Großer Pentagrammhexakontaeder

# @option:radio
source: Great dirhombicosidodecahedron
de: Großes Dirhombikosidodekaeder

# @option:radio
source: Great dirhombicosidodecacron
de: Großer Dirhombenikosidodekaeder

# @option:radio
source: Utah teapotahedron
de: Utah-Teekanne

# @option:check
source: Show description
de: Beschreibung anzeigen

# @item screen saver name
source: Polyominoes
de: Polyomino

# @info screen saver description
source: Repeatedly attempts to completely fill a rectangle with irregularly-shaped puzzle pieces. http://en.wikipedia.org/wiki/Polyomino Written by Stephen Montgomery-Smith; 2002.
de: Wiederholte Versuche, ein Rechteck mit unregelmäßig geformten Puzzlestücken zu füllen (http://de.wikipedia.org/wiki/Polyomino). Geschrieben von Stephen Montgomery-Smith; 2002.

# @option:check
source: Identical pieces
de: Gleiche Stücke

# @item screen saver name
source: Polytopes
de: Polytope

# @info screen saver description
source: This shows one of the six regular 4D polytopes rotating in 4D. Inspired by H.S.M Coxeter's book "Regular Polytopes", 3rd Edition, Dover Publications, Inc., 1973, and Thomas Banchoff's book "Beyond the Third Dimension: Geometry, Computer Graphics, and Higher Dimensions", Scientific American Library, 1990. http://en.wikipedia.org/wiki/Hypercube http://en.wikipedia.org/wiki/Tesseract http://en.wikipedia.org/wiki/Regular_polytope Written by Carsten Steger; 2003.
de: Dieser Bildschirmschoner zeigt einen der sechs regulären 4D-Polytope rotierend in 4D. Inspiriert von H.S.M Coxeter's book "Regular Polytopes", 3rd Edition, Dover Publications, Inc., 1973, und Thomas Banchoff's book "Beyond the Third Dimension: Geometry, Computer Graphics, and Higher Dimensions", Scientific American Library, 1990. http://de.wikipedia.org/wiki/Hyperwürfel https://de.wikipedia.org/wiki/Polytop_(Geometrie) http://de.wikipedia.org/wiki/Tesserakt Geschrieben 2003 von Carsten Steger

# @info screen saver description
source: This shows one of the six regular 4D polytopes rotating in 4D. Inspired by H.S.M Coxeter's book "Regular Polytopes", 3rd Edition, Dover Publications, Inc., 1973, and Thomas Banchoff's book "Beyond the Third Dimension: Geometry, Computer Graphics, and Higher Dimensions", Scientific American Library, 1990. http://en.wikipedia.org/wiki/Hypercube http://en.wikipedia.org/wiki/Regular_polytope Written by Carsten Steger; 2003.
de: Dieser Bildschirmschoner zeigt einen der sechs regulären 4D-Polytope rotierend in 4D. Inspiriert von H.S.M Coxeter's book "Regular Polytopes", 3rd Edition, Dover Publications, Inc., 1973, und Thomas Banchoff's book "Beyond the Third Dimension: Geometry, Computer Graphics, and Higher Dimensions", Scientific American Library, 1990. http://de.wikipedia.org/wiki/Hyperwürfel https://de.wikipedia.org/wiki/Polytop_(Geometrie) Geschrieben 2003 von Carsten Steger

# @option:radio
source: 5-cell (hyper-tetrahedron)
de: 5-Zellen (Hyper-Tetraeder)

# @option:radio
source: 8-cell (hypercube / tesseract)
de: 8-Zellen (Hyperwürfel / Tesserakt)

# @option:radio
source: 16-cell (hyper-octahedron)
de: 16-Zellen (Hyper-Oktaeder)

# @option:radio
source: 24-cell
de: 24 Zellen

# @option:radio
source: 120-cell
de: 120 Zellen

# @option:radio
source: 600-cell
de: 600 Zellen

# @option:radio
source: Single color
de: Einfarbig

# @option:radio
source: Colors By 4D Depth
de: Farben nach 4D-Tiefe sortiert

# @info screen saver description
source: This simulates the 1971 Pong home video game, as well as various artifacts from displaying it on a color TV set. In clock mode, the score keeps track of the current time. http://en.wikipedia.org/wiki/Pong Written by Jeremy English and Trevor Blackwell; 2003.
de: Simuliert das Videospiel Pong aus dem Jahr 1971, sowie verschiedene Artefakte, die beim Spielen auf einem Fernseher sichtbar sind. Im Uhrzeit-Modus zeigt der Spielstand die aktuelle Uhrzeit an (http://de.wikipedia.org/wiki/Pong). Geschrieben von Jeremy English und Trevor Blackwell; 2003.

# @label:slider
source: Game speed
de: Spielgeschwindigkeit

# @item:inrange Game speed
source: Slow
de: Langsam

# @item:inrange Game speed
source: Fast
de: Schnell

# @label:slider
source: Noise
de: Rauschen

# @item:inrange Noise
source: Crisp
de: Leicht

# @item:inrange Noise
source: Noisy
de: Stark

# @option:check
source: Clock mode
de: Uhrzeit-Modus

# @item screen saver name
source: PopSquares
de: Tanzboden

# @info screen saver description
source: This draws a pop-art-ish looking grid of pulsing colors. Written by Levi Burton; 2003.
de: Zeichnet ein Gitter von pulsierenden Farben im Popart-Stil. Geschrieben von Levi Burton; 2003.

# @label:spinbox
source: Subdivision
de: Unterteilung

# @label:spinbox
source: Number of colors
de: Anzahl der Farben

# @option:radio
source: Light red
de: Helles Rot

# @option:radio
source: Light yellow
de: Helles Gelb

# @option:radio
source: Light green
de: Helles Grün

# @option:radio
source: Light cyan
de: Helles Cyan

# @option:radio
source: Light blue
de: Helles Blau

# @option:radio
source: Light magenta
de: Helles Magenta

# @option:radio
source: Dark red
de: Dunkles Rot

# @option:radio
source: Dark yellow
de: Dunkles Gelb

# @option:radio
source: Dark green
de: Dunkles Grün

# @option:radio
source: Dark cyan
de: Dunkles Cyan

# @option:radio
source: Dark blue
de: Dunkles Blau

# @option:radio
source: Dark magenta
de: Dunkles Magenta

# @option:check
source: Twitch
de: Zucken

# @item screen saver name
source: Providence
de: Fürsorge

# @info screen saver description
source: "A pyramid unfinished. In the zenith an eye in a triangle, surrounded by a glory, proper." http://en.wikipedia.org/wiki/Eye_of_Providence Written by Blair Tennessy; 2004.
de: „Eine unvollständige Pyramide, in der Mitte eine Auge in einem Dreieck, umgeben von einem Strahlenkranz“. http://de.wikipedia.org/wiki/Auge_der_Vorsehung Geschrieben 2004 von Blair Tennessy

# @option:check
source: Draw eye
de: Auge zeichnen

# @info screen saver description
source: Draws some intersecting planes, making use of alpha blending, fog, textures, and mipmaps. Written by David Konerding; 1999.
de: Zeichnet sich überschneidende Ebenen unter Verwendung von Alpha-Überblendung, Nebel, Texturen, Mipmaps. Geschrieben von David Konerding, 1999.

# @label:spinbox
source: Quad count
de: Anzahl Flächen

# @option:check
source: Enable texturing
de: Texturen aktivieren

# @option:check
source: Enable texture mipmaps
de: Texture-Mipmaps aktivieren

# @option:check
source: Enable blending
de: Überblendung aktivieren

# @option:check
source: Anti-alias lines
de: Kanten glätten

# @option:check
source: Enable texture filtering
de: Texturfilterung aktivieren

# @option:check
source: Enable depth buffer
de: Tiefenpuffer aktivieren

# @info screen saver description
source: Exploding fireworks. See also the "Fireworkx", "Eruption", and "XFlame" screen savers. Written by Jamie Zawinski; 1992.
de: Explodierendes Feuerwerk. Siehe auch die Bildschirmschoner „Feuerwerk“, „Eruption“ und „Flamme“. Geschrieben von Jamie Zawinski, 1992.

# @label:slider
source: Particle density
de: Teilchendichte

# @item:inrange Particle density
source: Sparse
de: Dünn

# @item:inrange Particle density
source: Dense
de: Dicht

# @label:slider
source: Launch frequency
de: Starthäufigkeit

# @item:inrange Launch frequency
source: Seldom
de: Selten

# @item:inrange Launch frequency
source: Often
de: Häufig

# @label:slider
source: Explosive yield
de: Explosionsfunken

# @item:inrange Explosive yield
source: Low
de: Niedrig

# @item:inrange Explosive yield
source: High
de: Hoch

# @info screen saver description
source: Bounces a series of line segments around the screen, and uses variations on this basic motion pattern to produce all sorts of different presentations: line segments, filled polygons, and overlapping translucent areas. http://en.wikipedia.org/wiki/Qix Written by Jamie Zawinski; 1992.
de: Lässt eine Reihe von Liniensegmenten am Bildschirm abprallen. Auf dieses einfache Schema werden Variationen angewandt: Liniensegmente, gefüllte Vielecke und überlappende lichtdurchlässige Flächen. (http://de.wikipedia.org/wiki/Qix) Geschrieben von Jamie Zawinski; 1992.

# @option:radio
source: Line segments
de: Liniensegmente

# @option:radio
source: Solid objects
de: Festkörper

# @option:radio
source: Linear motion
de: Lineare Bewegung

# @option:radio
source: Additive colors
de: Additive Farben

# @option:radio
source: Subtractive colors
de: Subtraktive Farben

# @label:spinbox
source: Max size
de: Maximale Größe

# @label:spinbox
source: Poly corners
de: Polygonecken

# @option:check
source: XOR
de: Ausschließendes Oder

# @option:check
source: Gravity
de: Schwerkraft

# @item screen saver name
source: QuasiCrystal
de: Quasi-Kristall

# @info screen saver description
source: A quasicrystal is a structure that is ordered but aperiodic. Two-dimensional quasicrystals can be generated by adding a set of planes where x is the sine of y. Different complex aperiodic plane tilings are produced depending on the period, position, and rotation of the component planes, and whether the rotation of the planes is evenly distributed around the circle (the "symmetry" option, above) or random. See also the "RD-Bomb", "CWaves" and "Penrose" screen savers. http://en.wikipedia.org/wiki/Quasicrystal Written by Jamie Zawinski; 2013.
de: In einem Quasikristall sind die Elemente in einer geordneten, aber aperiodischen Struktur angeordnet. Zweidimensionale Quasikristalle können generiert werden, indem eine Menge von Ebenen hinzugefügt werden, bei denen X der Sinus von Y ist. Verschiedene komplexe aperiodische Kachelmosaiken werden erzeugt, abhängig von von der Periode, Position und Drehung der verbundenen Ebenen. Auch die Verteilung der Drehung der Ebenen um den Kreis beeinflusst das Ergebnis, ob gerade bzw. die Einstellung „symmetrisch“ oben oder zufällig. Siehe auch die Bildschirmschoner „Reaktions-Diffusions-Bombe“, „C-Wellen“ und „Penrose“ http://de.wikipedia.org/wiki/Quasikristall Geschrieben 2013 von Zawinski

# @label:slider
source: Contrast
de: Kontrast

# @item:inrange Contrast
source: Low
de: Niedrig

# @item:inrange Contrast
source: High
de: Hoch

# @option:check
source: Displacement
de: Verschiebung

# @option:check
source: Rotation
de: Drehung

# @option:check
source: Symmetry
de: Symmetrie

# @item screen saver name
source: Queens
de: Damen

# @info screen saver description
source: The N-Queens problem: how to place N queens on an NxN chessboard such that no queen can attack a sister? See also the "Endgame" screen saver. http://en.wikipedia.org/wiki/Eight_queens_puzzle Written by Blair Tennessy; 2002.
de: Das n-Damenproblem: Wie können die n Damen auf einem n×n großen Schachbrett platziert werden, sodass keine Dame die anderen angreifen kann (http://de.wikipedia.org/wiki/Damenproblem)? Beachten Sie auch den Bildschirmschoner „Schach“. Geschrieben von Blair Tennessy; 2002.

# @info screen saver description
source: Solves the N-Queens problem (where N is between 5 and 10 queens). The problem is: how may one place N queens on an NxN chessboard such that no queen can attack a sister? See also the "Endgame" screen saver. http://en.wikipedia.org/wiki/Eight_queens_puzzle Written by Blair Tennessy; 2002.
de: Löst das n-Damenproblem (für n zwischen 5 und 10 Damen). Das Problem ist: Wie können die n Damen auf einem n×n großen Schachbrett platziert werden, sodass keine Dame die anderen angreifen kann (http://de.wikipedia.org/wiki/Damenproblem)? Beachten Sie auch den Bildschirmschoner „Schach“. Geschrieben von Blair Tennessy; 2002.

# @item screen saver name
source: RDbomb
de: Reaktions-Diffusions-Bombe

# @info screen saver description
source: Reaction-diffusion: draws a grid of growing square-like shapes that, once they overtake each other, react in unpredictable ways. Written by Scott Draves; 1997.
de: Reaktion - Diffusion: Zeichnet ein Gitter von wachsenden, quadratischen Formen, die bei Berührung auf nicht vorhersagbare Weise miteinander reagieren. Geschrieben von Scott Draves; 1997.

# @info screen saver description
source: Draws a grid of growing square-like shapes that, once they overtake each other, react in unpredictable ways. "RD" stands for reaction-diffusion. Written by Scott Draves; 1997.
de: Zeichnet ein Gitter von wachsenden, quadratischen Formen, die bei Berührung auf nicht vorhersagbare Weise miteinander reagieren. „RD“ bedeutet Reaktion-Diffusion. Geschrieben von Scott Draves; 1997.

# @label:slider
source: Wander speed
de: Bewegungsgeschwindigkeit

# @item:inrange Wander speed
source: Slow
de: Langsam

# @item:inrange Wander speed
source: Fast
de: Schnell

# @label:slider
source: Fill screen
de: Bildschirm füllen

# @label:slider
source: Epoch
de: Epoche

# @item:inrange Epoch
source: Small
de: Klein

# @item:inrange Epoch
source: Large
de: Groß

# @label:spinbox
source: X tile size
de: Horizontale Kachelgröße

# @label:spinbox
source: Y tile size
de: Vertikale Kachelgröße

# @label:spinbox
source: Reaction
de: Reaktion

# @label:spinbox
source: Seed radius
de: Streu-Radius

# @item screen saver name
source: Ripples
de: Kräuselungen

# @info screen saver description
source: Rippling interference patterns reminiscent of splashing water distort a loaded image. Written by Tom Hammersley; 1999.
de: Kräuselnde Interferenz-Muster wie bei spritzendem Wasser verzerren ein geladenes Bild. Geschrieben von Tom Hammersley; 1999.

# @info screen saver description
source: This draws rippling interference patterns like splashing water, overlayed on the desktop or an image. Written by Tom Hammersley; 1999.
de: Zeichnet kräuselnde Muster auf der Arbeitsfläche oder einem Bild, wie bei spritzendem Wasser. Geschrieben von Tom Hammersley; 1999.

# @label:slider
source: Drippiness
de: Tropfvermögen

# @item:inrange Drippiness
source: Drizzle
de: Nieseln

# @item:inrange Drippiness
source: Storm
de: Sturm

# @label:slider
source: Fluidity
de: Fließvermögen

# @item:inrange Fluidity
source: Small drops
de: Kleine Tropfen

# @item:inrange Fluidity
source: Big drops
de: Große Tropfen

# @option:check
source: Moving splashes
de: Bewegende Tropfen

# @option:check
source: Psychedelic colors
de: Psychedelische Farben

# @option:check
source: Grayscale
de: Graustufen

# @label:spinbox
source: Magic lighting effect
de: Magischer Beleuchtungseffekt

# @item screen saver name
source: Rocks
de: Asteroidenflug

# @info screen saver description
source: This draws an animation of flight through an asteroid field, with changes in rotation and direction. Written by Jamie Zawinski; 1992.
de: Zeichnet einen Flug durch ein Asteroidenfeld mit Änderungen in der Drehung und der Richtung. Geschrieben von Jamie Zawinski; 1992.

# @label:slider
source: Velocity
de: Geschwindigkeit

# @item:inrange Velocity
source: Slow
de: Langsam

# @item:inrange Velocity
source: Fast
de: Schnell

# @option:check
source: Steering
de: Lenkung
