Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/kdeartwork/kxsconfig.po
Languages: de

# @info screen saver description
source: DATAI 2 ADDB 1,2 ROTC 2,-22 XOR 1,2 JRST .-4 As reported by HAKMEM (MIT AI Memo 239, 1972), Jackson Wright wrote the above PDP-1 code in 1962. That code still lives on here, some 46 years later. In "mismunch" mode, it displays a creatively broken misimplementation of the classic munching squares algorithm instead. http://en.wikipedia.org/wiki/HAKMEM http://en.wikipedia.org/wiki/Munching_square Written by Jackson Wright, Tim Showalter, Jamie Zawinski and Steven Hazel; 1997.
de: „DATAI 2 ADDB 1,2 ROTC 2,-22 XOR 1,2 JRST .-4“ sind die Befehle die Jackson Wright 1962 laut HAKMEM in einem PDP-1-Programm geschrieben hat. Die Befehle gibt es mehr als 45 Jahre später noch immer im heutigen Programm, allerdings wurde viel mehr dazu geschrieben. Im Modus „Mismampfen“ wird stattdessen eine absichtlich fehlerhafte Version der ursprünglichen „mampfenden Quadrate“ gezeigt. Siehe auch http://en.wikipedia.org/wiki/HAKMEM http://en.wikipedia.org/wiki/Munching_square . Geschrieben von Jackson Wright, Tim Showalter, Jamie Zawinski und Steven Hazel; 1997.

# @option:radio
source: Munch or mismunch
de: Mampfen oder Mismampfen

# @option:radio
source: Munch only
de: Nur Mampfen

# @option:radio
source: Mismunch only
de: Nur Mismampfen

# @item screen saver name
source: NerveRot
de: Nervös rotierende Schnörkel

# @info screen saver description
source: Draws different shapes composed of nervously vibrating squiggles, as if seen through a camera operated by a monkey on crack. Written by Dan Bornstein; 2000.
de: Zeichnet verschiedene Figuren, die aus nervös vibrierenden Schnörkel bestehen. Sieht aus, als ob man es durch ein Kamera sieht, die von einem Affen unter Drogen bedient wird. Geschrieben von Dan Bornstein; 2000.

# @label:slider
source: Blot count
de: Anzahl Kleckse

# @item:inrange Blot count
source: Few
de: Wenige

# @item:inrange Blot count
source: Many
de: Viele

# @label:slider
source: Colors
de: Farben

# @item:inrange Colors
source: Two
de: Zwei

# @item:inrange Colors
source: Many
de: Viele

# @label:slider
source: Changes
de: Wechsel

# @item:inrange Changes
source: Seldom
de: Selten

# @item:inrange Changes
source: Frequent
de: Häufig

# @label:slider
source: Nervousness
de: Nervosität

# @item:inrange Nervousness
source: Calm
de: Ruhig

# @item:inrange Nervousness
source: Spastic
de: Spastisch

# @label:slider
source: Crunchiness
de: Eckenhäufigkeit

# @item:inrange Crunchiness
source: Low
de: Niedrig

# @item:inrange Crunchiness
source: High
de: Hoch

# @info screen saver description
source: Draws some flowery, rotatey patterns. Written by Bill Torzewski; 2004.
de: Zeichnet einige blumige rotierende Muster. Geschrieben von Bill Torzewski; 2004.

# @info screen saver description
source: Draws some rotatey patterns, using OpenGL. Written by Bill Torzewski; 2004.
de: Zeichnet mit Hilfe von OpenGL, einige sich rotierende Muster. Geschrieben von Bill Torzewski; 2004.

# @item screen saver name
source: NoseGuy
de: Typ mit großer Nase

# @info screen saver description
source: A little man with a big nose wanders around your screen saying things. Written by Dan Heller and Jamie Zawinski; 1992.
de: Eine kleine Figur mit einer großen Nase wandert auf dem Bildschirm herum und sagt dabei verschiedene Sachen. Geschrieben von Dan Heller und Jamie Zawinski; 1992.

# @info screen saver description
source: Simulates a game of Pac-Man on a randomly-created level. http://en.wikipedia.org/wiki/Pac-Man Written by Edwin de Jong; 2004.
de: Simuliert eine Runde Pac-Man auf einem zufällig erstellten Spielfeld (http://de.wikipedia.org/wiki/Pac-Man). Geschrieben von Edwin de Jong; 2004.

# @label:spinbox
source: Player size
de: Spielergröße

# @info screen saver description
source: A demonstration of the even-odd winding rule. http://en.wikipedia.org/wiki/Even-odd_rule http://en.wikipedia.org/wiki/Nonzero-rule Written by Dale Moore; 1995.
de: Eine Demonstration der gerade-ungerade Füllregel, auch bekannt als „alternative Regel“. http://en.wikipedia.org/wiki/Even-odd_rule http://en.wikipedia.org/wiki/Nonzero-rule Geschrieben 1995 von Dale Moore

# @info screen saver description
source: A demonstration of the even-odd winding rule. Written by Dale Moore; 1995.
de: Eine Demonstration der gerade-ungerade Füllregel, auch bekannt als „alternative Regel“. Geschrieben 1995 von Dale Moore

# @info screen saver description
source: This is sort of a combination spirograph/string-art. It generates a large, complex polygon, and renders it by filling using an even/odd winding rule. Written by Dale Moore; 1995.
de: Zeichnet eine Mischung aus Spirograph und Fadenkunst. Generiert ein großes, komplexes Polygon und lässt es durch den X-Server einfärben. Geschrieben von Dale Moore; 1995.

# @item:inrange Lines
source: Few
de: Wenige

# @item:inrange Lines
source: Many
de: Viele

# @item screen saver name
source: Penetrate
de: Raketenabwehr

# @info screen saver description
source: Simulates (something like) the classic arcade game Missile Command. http://en.wikipedia.org/wiki/Missile_Command Written by Adam Miller; 1999.
de: Simuliert das klassische Spielhallenspiel „Missile Command“ (http://de.wikipedia.org/wiki/Missile_Command). Geschrieben von Adam Miller; 1999.

# @label:slider
source: Explosions
de: Explosionen

# @item:inrange Explosions
source: Slow
de: Langsam

# @item:inrange Explosions
source: Fast
de: Schnell

# @label:slider
source: Lasers
de: Laser

# @item:inrange Lasers
source: Slow
de: Langsam

# @item:inrange Lasers
source: Fast
de: Schnell

# @option:radio
source: Start badly, but learn
de: Schlecht starten, aber lernen

# @option:radio
source: Always play well
de: Immer gut spielen

# @info screen saver description
source: Draws quasiperiodic tilings; think of the implications on modern formica technology. In April 1997, Sir Roger Penrose, a British math professor who has worked with Stephen Hawking on such topics as relativity, black holes, and whether time has a beginning, filed a copyright-infringement lawsuit against the Kimberly-Clark Corporation, which Penrose said copied a pattern he created (a pattern demonstrating that "a nonrepeating pattern could exist in nature") for its Kleenex quilted toilet paper. Penrose said he doesn't like litigation but, "When it comes to the population of Great Britain being invited by a multinational to wipe their bottoms on what appears to be the work of a Knight of the Realm, then a last stand must be taken." As reported by News of the Weird #491, 4-Jul-1997. http://en.wikipedia.org/wiki/Penrose_tiling http://en.wikipedia.org/wiki/Tessellation Written by Timo Korvola; 1997.
de: Zeichnet quasiperiodische Kacheln. Im April 1997 reichte Sir Roger Penrose, ein britischer Mathematikprofessor, der mit Stephen Hawking an Themen wie Relativität, schwarze Löcher und den Anbeginn der Zeit gearbeitet hat, eine Urheberrechtsverletzungsklage gegen die Kimberly-Clark-Gesellschaft ein. Penrose behauptete, dass eines seiner Muster (ein Beispiel dafür, dass „ein nicht wiederholendes Muster in der Natur existiert“) für Kleenex-Toilettenpapier kopiert wurde. Penrose sagte, dass er nichts von Rechtsstreiten hält, aber wenn ein Großkonzern Leute dazu einlädt, sich das Hinterteil mit der Arbeit eines Genies abzuwischen, muss man dagegen kämpfen." (News of the Weird, Nr. 491, 4. Juli 1997) (http://de.wikipedia.org/wiki/Penrose-Parkettierung http://de.wikipedia.org/wiki/Parkettierung) Geschrieben von Timo Korvola; 1997.

# @info screen saver description
source: Draws quasiperiodic tilings; think of the implications on modern formica technology. In April 1997, Sir Roger Penrose, a British math professor who has worked with Stephen Hawking on such topics as relativity, black holes, and whether time has a beginning, filed a copyright-infringement lawsuit against the Kimberly-Clark Corporation, which Penrose said copied a pattern he created (a pattern demonstrating that "a nonrepeating pattern could exist in nature") for its Kleenex quilted toilet paper. Penrose said he doesn't like litigation but, "When it comes to the population of Great Britain being invited by a multinational to wipe their bottoms on what appears to be the work of a Knight of the Realm, then a last stand must be taken." As reported by News of the Weird #491, 4-Jul-1997. http://en.wikipedia.org/wiki/Penrose_tiling Written by Timo Korvola; 1997.
de: Zeichnet quasiperiodische Kacheln. Im April 1997 reichte Sir Roger Penrose, ein britischer Mathematikprofessor, der mit Stephen Hawking an Themen wie Relativität, schwarze Löcher und den Anbeginn der Zeit gearbeitet hat, eine Urheberrechtsverletzungsklage gegen die Kimberly-Clark-Gesellschaft ein. Penrose behauptete, dass eines seiner Muster (ein Beispiel dafür, dass „ein nicht wiederholendes Muster in der Natur existiert“) für Kleenex-Toilettenpapier kopiert wurde. Penrose sagte, dass er nichts von Rechtsstreiten hält, aber wenn ein Großkonzern Leute dazu einlädt, sich das Hinterteil mit der Arbeit eines Genies abzuwischen, muss man dagegen kämpfen." (News of the Weird, Nr. 491, 4. Juli 1997) (http://de.wikipedia.org/wiki/Penrose-Parkettierung) Geschrieben von Timo Korvola; 1997.

# @option:check
source: Draw ammann lines
de: Ammann-Linien zeichnen

# @item screen saver name
source: Petri
de: Petrischale

# @info screen saver description
source: This simulates colonies of mold growing in a petri dish. Growing colored circles overlap and leave spiral interference in their wake. Written by Dan Bornstein; 1999.
de: Simuliert Kolonien von Schimmel, die in einer Petrischale wachsen. Wachsende, bunte Kreise überlappen sich und hinterlassen spiralförmige Interferenzen in der Wirbelzone. Geschrieben von Dan Bornstein; 1999.

# @label:slider
source: Colony shape
de: Kolonieform

# @item:inrange Colony shape
source: Square
de: Quadrat

# @item:inrange Colony shape
source: Diamond
de: Diamant

# @label:slider
source: Fertility
de: Fruchtbarkeit

# @item:inrange Fertility
source: Low
de: Niedrig

# @item:inrange Fertility
source: High
de: Hoch

# @label:slider
source: Offspring
de: Nachwuchs

# @item:inrange Offspring
source: Few
de: Wenig

# @item:inrange Offspring
source: Many
de: Viel

# @label:slider
source: Death comes
de: Tot kommt

# @item:inrange Death comes
source: Slowly
de: Langsam

# @item:inrange Death comes
source: Quickly
de: Schnell

# @label:slider
source: Minimum rate of growth
de: Minimale Wachstumsrate

# @item:inrange Minimum rate of growth
source: Slow
de: Langsam

# @item:inrange Minimum rate of growth
source: Fast
de: Schnell

# @label:slider
source: Maximum rate of growth
de: Maximale Wachstumsrate

# @item:inrange Maximum rate of growth
source: Slow
de: Langsam

# @item:inrange Maximum rate of growth
source: Fast
de: Schnell

# @label:slider
source: Minimum rate of death
de: Minimale Todesrate

# @item:inrange Minimum rate of death
source: Slow
de: Langsam

# @item:inrange Minimum rate of death
source: Fast
de: Schnell

# @label:slider
source: Maximum rate of death
de: Maximale Todesrate

# @item:inrange Maximum rate of death
source: Slow
de: Langsam

# @item:inrange Maximum rate of death
source: Fast
de: Schnell

# @label:slider
source: Minimum lifespan
de: Minimale Lebensspanne

# @item:inrange Minimum lifespan
source: Short
de: Kurz

# @item:inrange Minimum lifespan
source: Long
de: Lang

# @label:slider
source: Maximum lifespan
de: Maximale Lebensspanne

# @item:inrange Maximum lifespan
source: Short
de: Kurz

# @item:inrange Maximum lifespan
source: Long
de: Lang

# @label:spinbox
source: Mold varieties
de: Schimmelformen

# @info screen saver description
source: Draws a simulation of an old terminal, with large pixels and long-sustain phosphor. On MacOS and Linux, this program is also a fully-functional VT100 emulator! Run it as an application instead of as a screen saver and you can use it as a terminal. Written by Jamie Zawinski; 1999.
de: Zeichnet eine Simulation von einem alten Terminal mit großen Punkten und nach leuchtendem Phosphor. Auf MacOS und Linux ist dieses Programm auch ein vollwertiges VT100-Terminal. Starten Sie es als Programm statt als Bildschirmschoner und Sie können es als Terminal verwenden. Geschrieben von Jamie Zawinski; 1999.

# @info screen saver description
source: Draws a simulation of an old terminal, with large pixels and long-sustain phosphor. This program is also a fully-functional VT100 emulator! Run it as an application instead of as a screen saver and you can use it as a terminal. Written by Jamie Zawinski; 1999.
de: Zeichnet eine Simulation von einem alten Terminal mit großen Punkten und nach leuchtendem Phosphor. Dieses Programm ist auch ein vollwertiges VT100-Terminal. Starten Sie es als Programm statt als Bildschirmschoner und Sie können es als Terminal verwenden. Geschrieben von Jamie Zawinski; 1999.

# @info screen saver description
source: Draws a simulation of an old terminal, with large pixels and long-sustain phosphor. On X11 systems, This program is also a fully-functional VT100 emulator! Written by Jamie Zawinski; 1999.
de: Zeichnet eine Simulation von einem alten Terminal mit großen Punkten und nach leuchtendem Phosphor. Auf X11-Systemen ist dieses Programm auch ein vollwertiges VT100-Terminal. Geschrieben von Jamie Zawinski; 1999.

# @label:spinbox
source: Font scale
de: Schriftgröße

# @label:slider
source: Fade
de: Verblassen

# @item:inrange Fade
source: Slow
de: Langsam

# @item:inrange Fade
source: Fast
de: Schnell

# @option:radio
source: Amber
de: Bernsteingelb

# @item screen saver name
source: Photopile
de: Fotobetrachter

# @info screen saver description
source: Loads several random images, and displays them as if lying in a random pile. The pile is periodically reshuffled, with new images coming in and old ones being thrown out. Written by Jens Kilian; 2008.
de: Lädt mehrere zufällige Bilder und zeigt sie als zufälligen Stapel an. Der Stapel wird ab und zu neu gemischt, dadurch kommen dann neue Bilder hinzu und alte verschwinden. Geschrieben 2008 von Jens Kilian.

# @label:slider
source: Image size
de: Bildgröße

# @item:inrange Image size
source: Small
de: Klein

# @item:inrange Image size
source: Large
de: Groß

# @label:slider
source: Maximum angle from vertical
de: Maximaler vertikaler Winkel

# @item:inrange Maximum angle from vertical
source: 0 deg
de: 0 Grad

# @item:inrange Maximum angle from vertical
source: 90 deg
de: 90 Grad

# @option:check
source: Simulate instant film
de: Sofortbild simulieren

# @option:check
source: Instant film theme
de: Sofortbild-Design

# @option:check
source: Clip images
de: Bilder zuschneiden

# @option:check
source: Draw drop shadows
de: Schlagschatten anzeigen

# @item:inrange Time until loading a new image
source: Short
de: Kurz

# @item:inrange Time until loading a new image
source: Long
de: Lang

# @item screen saver name
source: Piecewise
de: Überschneidende Kreise

# @info screen saver description
source: This draws a bunch of moving circles which switch from visibility to invisibility at intersection points. Written by Geoffrey Irving; 2003.
de: Zeichnet eine Menge sich bewegender Kreise, die an Kontaktpunkten unsichtbar werden. Geschrieben von Geoffrey Irving; 2003.

# @label:slider
source: Color shift
de: Farbverschiebung

# @item:inrange Color shift
source: Slow
de: Langsam

# @item:inrange Color shift
source: Fast
de: Schnell

# @label:slider
source: Minimum radius
de: Minimaler Radius

# @item:inrange Minimum radius
source: Small
de: Klein

# @item:inrange Minimum radius
source: Large
de: Groß

# @label:slider
source: Maximum radius
de: Maximaler Radius

# @item:inrange Maximum radius
source: Small
de: Klein

# @item:inrange Maximum radius
source: Large
de: Groß

# @item screen saver name
source: Pinion
de: Zahnräder

# @info screen saver description
source: Draws an interconnected set of gears moving across the screen. See also the "Gears" and "MoebiusGears" screen savers. http://en.wikipedia.org/wiki/Involute_gear Written by Jamie Zawinski; 2004.
de: Zeichnet einige sich drehende, ineinander verzahnte Zahnräder, die über den Bildschirm bewegt werden. Sehen Sie sich auch die Bildschirmschoner „Gears“ und „MoebiusGears“ an (http://de.wikipedia.org/wiki/Evolventenverzahnung) (http://de.wikipedia.org/wiki/Planetengetriebe). Geschrieben von Jamie Zawinski; 2004.

# @label:slider
source: Scrolling speed
de: Laufgeschwindigkeit

# @item:inrange Scrolling speed
source: Slow
de: Langsam

# @item:inrange Scrolling speed
source: Fast
de: Schnell

# @label:slider
source: Gear size
de: Zahnradgröße

# @item:inrange Gear size
source: Tiny
de: Sehr klein

# @item:inrange Gear size
source: Huge
de: Riesig

# @label:slider
source: Max RPM
de: Max. Umdrehungen pro Minute

# @item screen saver name
source: Pipes
de: Röhren

# @info screen saver description
source: A growing plumbing system, with bolts and valves. Written by Marcelo Vianna; 1997.
de: Ein wachsendes Röhrensystem mit Bolzen und Ventilen. Geschrieben von Marcelo Vianna; 1997.

# @label:slider
source: Number of pipes
de: Anzahl der Rohre

# @item:inrange Number of pipes
source: One
de: Eins

# @item:inrange Number of pipes
source: A hundred
de: Hundert

# @label:slider
source: Pipe length
de: Rohrlänge

# @item:inrange Pipe length
source: Short
de: Kurz

# @item:inrange Pipe length
source: Long
de: Lang

# @label:slider
source: Gadgetry
de: Geräte

# @item:inrange Gadgetry
source: None
de: Keine

# @item:inrange Gadgetry
source: Lots
de: Viele

# @option:check
source: Fisheye lens
de: Fischaugenlinse

# @option:check
source: Allow tight turns
de: Enge Wendungen zulassen

# @option:radio
source: Curved pipes
de: Gebogene Röhren

# @option:radio
source: Ball joints
de: Bälle in Ecken

# @option:radio
source: Bolted fittings
de: Schraubarmaturen

# @option:radio
source: Random style
de: Zufälliges Stil

# @item screen saver name
source: Polyhedra
de: Polyeder

# @info screen saver description
source: Displays the 75 uniform polyhedra and their duals, plus 5 prisms and antiprisms, and some information about each. http://en.wikipedia.org/wiki/Uniform_polyhedra http://en.wikipedia.org/wiki/Stellation http://en.wikipedia.org/wiki/Dual_polyhedron http://en.wikipedia.org/wiki/Antiprism Written by Dr. Zvi Har'El and Jamie Zawinski; 2004.
de: Zeigt die 75 regelmäßgen Polyeder und deren Duale plus 5 Prismen und Antiprismen und einige Informationen darüber. http://en.wikipedia.org/wiki/Stellation http://en.wikipedia.org/wiki/Dual_polyhedron https://de.wikipedia.org/wiki/Prisma_(Geometrie)#Antiprisma Erstellt von Dr. Zvi Har'El und Jamie Zawinski; 2004.

# @info screen saver description
source: Displays the 75 uniform polyhedra and their duals, plus 5 prisms and antiprisms, and some information about each. http://en.wikipedia.org/wiki/Uniform_polyhedra http://en.wikipedia.org/wiki/Stellation Written by Dr. Zvi Har'El and Jamie Zawinski; 2004.
de: Zeigt die 75 regelmäßgen Polyeder und deren Duale plus 5 Prismen und Antiprismen und einige Informationen darüber. https://de.wikipedia.org/wiki/Polyeder#Regelm.C3.A4.C3.9Fige_Polyeder htttp://en.wikipedia.org/wiki/Stellation. Erstellt von Dr. Zvi Har'El und Jamie Zawinski; 2004.

# @info screen saver description
source: Displays different 3D solids and some information about each. A new solid is chosen every few seconds. There are 75 uniform polyhedra, plus 5 infinite sets of prisms and antiprisms; including their duals brings the total to 160. http://en.wikipedia.org/wiki/Uniform_polyhedra http://en.wikipedia.org/wiki/Stellation Written by Dr. Zvi Har'El and Jamie Zawinski; 2004.
de: Zeigt unterschiedliche 3D-Körper und einige Informationen über jeden von diesen. Ein neuer Körper wird alle paar Sekunden ausgewählt. Es gibt 75 regelmäßige Polyeder und zusätzlich 5 unbeschränkte Sätze bestehend aus Prismen und Antiprismen; bezieht man die Doppelten mit ein, gibt es insgesamt 160 Körper. https://de.wikipedia.org/wiki/Polyeder#Regelm.C3.A4.C3.9Fige_Polyeder Geschrieben von Dr. Zvi Har'El und Jamie Zawinski; 2004.

# @info screen saver description
source: Displays different 3D solids and some information about each. A new solid is chosen every few seconds. There are 75 uniform polyhedra, plus 5 infinite sets of prisms and antiprisms; including their duals brings the total to 160. http://en.wikipedia.org/wiki/Uniform_polyhedra Written by Dr. Zvi Har'El and Jamie Zawinski; 2004.
de: Zeigt unterschiedliche 3D-Körper und einige Informationen über jeden von diesen. Ein neuer Körper wird alle paar Sekunden ausgewählt. Es gibt 75 regelmäßige Polyeder und zusätzlich 5 unbeschränkte Sätze bestehend aus Prismen und Antiprismen; bezieht man die Doppelten mit ein gibt es insgesamt 160 Körper. https://de.wikipedia.org/wiki/Polyeder#Regelm.C3.A4.C3.9Fige_Polyeder Geschrieben von Dr. Zvi Har'El und Jamie Zawinski; 2004.

# @option:radio
source: Display random polyhedron
de: Zufälliges Polyeder anzeigen

# @option:radio
source: Pentagonal prism
de: Pentagonales Prisma

# @option:radio
source: Pentagonal dipyramid
de: Pentagonale Bipyramide

# @option:radio
source: Pentagonal antiprism
de: Pentagonales Antiprisma

# @option:radio
source: Pentagonal deltohedron
de: Pentagonales Deltoeder

# @option:radio
source: Pentagrammic prism
de: Pentagrammisches Prisma

# @option:radio
source: Pentagrammic dipyramid
de: Pentagrammische Bipyramide

# @option:radio
source: Pentagrammic antiprism
de: Pentagrammisches Antiprisma

# @option:radio
source: Pentagrammic deltohedron
de: Pentragrammisches Deltoeder

# @option:radio
source: Pentagrammic crossed antiprism
de: Gekreuztes pentagrammisches Antiprisma

# @option:radio
source: Pentagrammic concave deltohedron
de: Pentagrammisches konkaves Deltoeder

# @option:radio
source: Truncated tetrahedron
de: Tetraederstumpf

# @option:radio
source: Triakistetrahedron
de: Triakistetraeder

# @option:radio
source: Octahemioctahedron
de: Oktahemioktaeder

# @option:radio
source: Octahemioctacron
de: Oktahemioctacron

# @option:radio
source: Tetrahemihexahedron
de: Tetrahemihexaeder

# @option:radio
source: Cuboctahedron
de: Kuboktaeder

# @option:radio
source: Rhombic dodecahedron
de: Rhombendodekaeder

# @option:radio
source: Truncated octahedron
de: Oktaederstumpf

# @option:radio
source: Tetrakishexahedron
de: Tetrakishexaeder

# @option:radio
source: Truncated cube
de: Hexaederstumpf

# @option:radio
source: Triakisoctahedron
de: Triakisoktaeder

# @option:radio
source: Rhombicuboctahedron
de: Rhombenkuboktaeder

# @option:radio
source: Deltoidal icositetrahedron
de: Deltoidalikositetraeder

# @option:radio
source: Truncated cuboctahedron
de: Kuboktaederstumpf

# @option:radio
source: Disdyakisdodecahedron
de: Disdyakisdodekaeder

# @option:radio
source: Snub cube
de: Abgeschrägtes Hexaeder

# @option:radio
source: Pentagonal icositetrahedron
de: Pentagonikositetraeder

# @option:radio
source: Small cubicuboctahedron
de: Kleiner Kubikuboktaeder

# @option:radio
source: Small hexacronic icositetrahedron
de: Kleiner Hexakositetraeder

# @option:radio
source: Great cubicuboctahedron
de: Großer Kubikuboktaeder

# @option:radio
source: Great hexacronic icositetrahedron
de: Großer Hexaikositetraeder

# @option:radio
source: Cubohemioctahedron
de: Kubohemioktaeder

# @option:radio
source: Hexahemioctacron
de: Hexahemioktacron

# @option:radio
source: Cubitruncated cuboctahedron
de: Kubisch abgestumpfter Kuboktaeder

# @option:radio
source: Tetradyakishexahedron
de: Tetradyakishexaeder

# @option:radio
source: Great rhombicuboctahedron
de: Großes Rhombenkuboktaeder

# @option:radio
source: Great deltoidal icositetrahedron
de: Großer Deltoidalikositetraeder

# @option:radio
source: Small rhombihexahedron
de: Kleiner Rhombenhexaeder

# @option:radio
source: Small rhombihexacron
de: Kleiner Rhombenhexaeder
