Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/kdeartwork/kxsconfig.po
Languages: de

# @label:slider
source: Crossfade duration
de: Dauer der Überblendung

# @item:inrange Crossfade duration
source: None
de: Keine

# @item:inrange Crossfade duration
source: 30 seconds
de: 30 Sekunden

# @item screen saver name
source: GLSnake
de: GL-Schlange

# @info screen saver description
source: Draws a simulation of the Rubik's Snake puzzle. See also the "Rubik" and "Cube21" screen savers. http://en.wikipedia.org/wiki/Rubik%27s_Snake Written by Jamie Wilkinson, Andrew Bennetts, and Peter Aylett; 2002.
de: Zeichnet eine Simulation von Rubiks Schlangenpuzzle (http://en.wikipedia.org/wiki/Rubik's_Snake). Siehe auch die Bildschirmschoner „Rubik“ und „Würfel 21“. Geschrieben von Jamie Wilkinson, Andrew Bennetts und Peter Aylett; 2002.

# @item:inrange Duration
source: 30 seconds
de: 30 Sekunden

# @label:slider
source: Packing
de: Steinnähe

# @item:inrange Packing
source: Tight
de: Dicht

# @item:inrange Packing
source: Loose
de: Locker

# @label:slider
source: Angular velocity
de: Winkelgeschwindigkeit

# @item:inrange Angular velocity
source: Slow
de: Langsam

# @item:inrange Angular velocity
source: Fast
de: Schnell

# @label:slider
source: Y angular velocity
de: Geschwindigkeit Y-Achse

# @item:inrange Y angular velocity
source: Slow
de: Langsam

# @item:inrange Y angular velocity
source: Fast
de: Schnell

# @label:slider
source: Z angular velocity
de: Geschwindigkeit Z-Achse

# @item:inrange Z angular velocity
source: Slow
de: Langsam

# @item:inrange Z angular velocity
source: Fast
de: Schnell

# @option:check
source: Show titles
de: Titel anzeigen

# @info screen saver description
source: Displays a few lines of text spinning around in a solid 3D font. The text can use strftime() escape codes to display the current date and time. Written by Jamie Zawinski; 2001.
de: Zeigt einige dreidimensionale Textzeilen, die sich drehen. Als Text kann maskierter Quelltext für strftime() verwendet werden, um das aktuelle Datum und die Zeit anzuzeigen. Geschrieben von 2001 von Jamie Zawinski.

# @option:radio
source: Display system information
de: Systeminformationen anzeigen

# @option:radio
source: Display date and time
de: Datum und Zeit anzeigen

# @option:radio
source: Always face front
de: Immer die Vorderseite anzeigen

# @option:radio
source: Spin all the way around
de: Ganz herum drehen

# @item screen saver name
source: Goop
de: Kleckse

# @info screen saver description
source: This draws set of animating, transparent, amoeba-like blobs. The blobs change shape as they wander around the screen, and they are translucent, so you can see the lower blobs through the higher ones, and when one passes over another, their colors merge. I got the idea for this from a mouse pad I had once, which achieved the same kind of effect in real life by having several layers of plastic with colored oil between them. Written by Jamie Zawinski; 1997.
de: Zeichnet eine Menge bewegender, transparenter, amöbenförmiger Kleckse. Die Kleckse ändern die Form, während sie über den Bildschirm wandern. Da sie durchsichtig sind, kann man die darunterliegenden Kleckse wie durch einen Farbfilter sehen. Die Idee kommt von einer Mausunterlage, die denselben Effekt mit mehreren Plastikschichten und farbigem Öl erzeugt. Geschrieben von Jamie Zawinski, 1997.

# @label:slider
source: Blobs
de: Kleckse

# @item:inrange Blobs
source: Few
de: Wenige

# @item:inrange Blobs
source: Many
de: Viele

# @label:slider
source: Elasticity
de: Elastizität

# @item:inrange Elasticity
source: Low
de: Niedrig

# @item:inrange Elasticity
source: High
de: Hoch

# @label:slider
source: Speed limit
de: Geschwindigkeitsgrenze

# @item:inrange Speed limit
source: Low
de: Niedrig

# @item:inrange Speed limit
source: High
de: Hoch

# @option:radio
source: Transparent blobs
de: Transparente Kleckse

# @option:radio
source: Opaque blobs
de: Undurchsichtige Kleckse

# @option:radio
source: XOR blobs
de: Invertierte Kleckse

# @option:radio
source: Additive colors (transmitted light)
de: Additive Farbe (ausgestrahltes Licht)

# @option:radio
source: Subtractive colors (reflected light)
de: Subtraktive Farben (reflektiertes Licht)

# @item screen saver name
source: Grav
de: Schwerkraft

# @info screen saver description
source: This draws a simple orbital simulation. With trails enabled, it looks kind of like a cloud-chamber photograph. Written by Greg Bowering; 1997.
de: Dieses Programm zeichnet eine einfache Orbitalsimulation. Wenn Sie „Teilchenspuren zeichnen“ aktivieren, sieht es aus wie ein Bild einer Nebelkammer (Teilchenphysik). Geschrieben von Greg Bowering; 1992.

# @label:slider
source: Number of objects
de: Anzahl der Objekte

# @item:inrange Number of objects
source: Few
de: Wenige

# @item:inrange Number of objects
source: Many
de: Viele

# @option:check
source: Orbital decay
de: Orbitaler Zerfall

# @option:check
source: Object trails
de: Teilchenspuren zeichnen

# @info screen saver description
source: Draws random colored, stippled and transparent rectangles. Written by Jamie Zawinski; 1992.
de: Zeichnet zufällig gefärbte, getüpfelte und durchsichtige Rechtecke. Geschrieben von Jamie Zawinski; 1992.

# @option:check
source: Grey
de: Grau

# @item screen saver name
source: Halftone
de: Halbton-Rasterung

# @info screen saver description
source: Draws the gravity force in each point on the screen seen through a halftone dot pattern. The gravity force is calculated from a set of moving mass points. View it from a distance for best effect. http://en.wikipedia.org/wiki/Halftone Written by Peter Jaric; 2002.
de: Zeichnet die Gravitationskraft in jeden Punkt auf dem Bildschirm als ein Halbton-Punktmuster. Die Gravitationskraft wird von einer Menge bewegter Punkte berechnet. Der beste Effekt ergibt sich aus größerer Entfernung. http://de.wikipedia.org/wiki/Halbtonbild Geschrieben von Peter Jaric; 2002.

# @label:slider
source: Gravity points
de: Schwerkraftpunkte

# @item:inrange Gravity points
source: Few
de: Wenige

# @item:inrange Gravity points
source: Many
de: Viele

# @label:slider
source: Dot size
de: Punktgröße

# @item:inrange Dot size
source: Small
de: Klein

# @item:inrange Dot size
source: Big
de: Groß

# @label:slider
source: Dot fill factor
de: Punkt-Füllfaktor

# @item:inrange Dot fill factor
source: Small
de: Klein

# @item:inrange Dot fill factor
source: Large
de: Groß

# @label:slider
source: Minimum speed
de: Minimale Geschwindigkeit

# @item:inrange Minimum speed
source: Low
de: Niedrig

# @item:inrange Minimum speed
source: High
de: Hoch

# @label:slider
source: Maximum speed
de: Maximale Geschwindigkeit

# @item:inrange Maximum speed
source: Low
de: Niedrig

# @item:inrange Maximum speed
source: High
de: Hoch

# @label:slider
source: Minimum mass
de: Minimale Masse

# @item:inrange Minimum mass
source: Small
de: Gering

# @item:inrange Minimum mass
source: Large
de: Groß

# @label:slider
source: Maximum mass
de: Maximale Masse

# @item:inrange Maximum mass
source: Small
de: Gering

# @item:inrange Maximum mass
source: Large
de: Groß

# @item screen saver name
source: Halo
de: Heiligenschein

# @info screen saver description
source: Draws circular interference patterns that hurt to look at. http://en.wikipedia.org/wiki/Moire_pattern Written by Jamie Zawinski; 1993.
de: Zeichnet kreisförmige Interferenz-Muster, deren Anblick schmerzt (http://de.wikipedia.org/wiki/Moiré-Effekt). Geschrieben von Jamie Zawinski; 1993.

# @info screen saver description
source: Draws trippy psychedelic circular patterns that hurt to look at. http://en.wikipedia.org/wiki/Moire_pattern Written by Jamie Zawinski; 1993.
de: Zeichnet psychedelische, kreisförmige Muster, deren Anblick schmerzt (http://de.wikipedia.org/wiki/Moiré-Effekt). Geschrieben von Jamie Zawinski; 1993.

# @label:slider
source: Number of circles
de: Anzahl der Kreise

# @item:inrange Number of circles
source: Few
de: Wenige

# @item:inrange Number of circles
source: Many
de: Viele

# @option:radio
source: Random mode
de: Zufällig

# @option:radio
source: Seuss mode
de: Farben abwechselnd

# @option:radio
source: Ramp mode
de: Anstiegs-Modus

# @option:check
source: Animate circles
de: Kreise bewegen

# @info screen saver description
source: Spirally string-art-ish patterns. Written by Jamie Zawinski; 1992.
de: Zeichnet spiralförmige Fadenkunst. Geschrieben von Jamie Zawinski; 1992.

# @item screen saver name
source: Hexadrop
de: Sechsecktropfen

# @info screen saver description
source: Draws a grid of hexagons or other shapes and drops them out. http://en.wikipedia.org/wiki/Tiling_by_regular_polygons Written by Jamie Zawinski; 2013.
de: Zeichnet ein Gitter aus Sechsecken oder anderen Formen und zerstreut sie. http://de.wikipedia.org/wiki/Parkettierung Geschrieben von Jamie Zawinski; 1993.

# @label:slider
source: Tile size
de: Kachelgröße

# @item:inrange Tile size
source: Small
de: Klein

# @item:inrange Tile size
source: Large
de: Groß

# @option:radio
source: Random shape
de: Zufällige Form

# @option:radio
source: Triangles
de: Dreiecke

# @option:radio
source: Squares
de: Quadrate

# @option:radio
source: Hexagons
de: Sechsecke

# @option:radio
source: Octagons
de: Oktaeder

# @option:radio
source: Random speed
de: Zufällige Geschwindigkeit

# @option:radio
source: Uniform speed
de: Gleichförmige Geschwindigkeit

# @option:radio
source: Non-uniform speed
de: Ungleichförmige Geschwindigkeit

# @option:radio
source: Random sync
de: Zufälliger Abgleich

# @option:radio
source: Synchronized
de: Abgeglichen

# @option:radio
source: Non-synchronized
de: Nicht abgeglichen

# @info screen saver description
source: This draws the recursive Hilbert space-filling curve, in both 2D and 3D variants. It incrementally animates the growth and recursion to the maximum depth, then unwinds it back. The Hilbert path is a single contiguous line that can fill a volume without crossing itself. As a data structure, Hilbert paths are useful because ordering along the curve preserves locality: points that are close together along the curve are also close together in space. The converse is often, but not always, true. The coloration reflects this. http://en.wikipedia.org/wiki/Hilbert_curve Written by Jamie Zawinski; 2011.
de: Zeichnet die rekursive, raumfüllende Hilbert-Kurve, sowohl in 2D als auch in 3D. Sie animiert das schrittweise Wachstum und die Rekursion der maximalen Tiefe, dann windet sie sich zurück. Der Hilbert-Pfad ist eine einfache, ununterbrochene Linie, die den Raum füllen kann, ohne sich selbst zu kreuzen. Als Datenstruktur können Hilbert-Pfade nützlich sein, weil die Anordnung entlang der Kurve erhalten bleibt: Punkte, die entlang der Kurve nah bei einander liegen, tun dies auch im Raum. Die Umkehrung trifft meist, aber nicht immer, ebenfalls zu. Die Farbgebung spiegelt dies wieder. http://de.wikipedia.org/wiki/Hilbert-Kurve Geschrieben von Jamie Zawinski; 2011.

# @info screen saver description
source: This draws the recursive Hilbert space-filling curve, in both 2D and 3D variants. It incrementally animates the growth and recursion to the maximum depth, then unwinds it back. The Hilbert path is a single contiguous line that can fill a volume without crossing itself. As a data structure, Hilbert paths are useful because ordering along the curve preserves locality: points that close together along the curve are also close together in space. The converse is often, but not always, true. The coloration reflects this. http://en.wikipedia.org/wiki/Hilbert_curve Written by Jamie Zawinski; 2011.
de: Zeichnet die rekursive, raumfüllende Hilbert-Kurve, sowohl in 2D als auch in 3D. Sie animiert das schrittweise Wachstum und die Rekursion der maximalen Tiefe, dann windet sie sich zurück. Der Hilbert-Pfad ist eine einfache, ununterbrochene Linie, die den Raum füllen kann, ohne sich selbst zu kreuzen. Als Datenstruktur können Hilbert-Pfade nützlich sein, weil die Anordnung entlang der Kurve erhalten bleibt: Punkte, die entlang der Kurve nah bei einander liegen, tun dies auch im Raum. Die Umkehrung trifft meist, aber nicht immer, ebenfalls zu. Die Farbgebung spiegelt dies wieder. http://de.wikipedia.org/wiki/Hilbert-Kurve Geschrieben von Jamie Zawinski; 2011.

# @option:radio
source: 2D or 3D
de: 2D oder 3D

# @option:radio
source: Open or closed paths
de: Offene oder geschlossene Pfade

# @option:radio
source: Closed
de: Geschlossen

# @option:radio
source: Open
de: Offen

# @item:inrange Frame rate
source: Slow
de: Langsam

# @item:inrange Frame rate
source: Fast
de: Schnell

# @label:slider
source: Recursion levels
de: Rekursionsstufen

# @label:slider
source: Line thickness
de: Liniendicke

# @item:inrange Line thickness
source: Thin
de: Dünn

# @item:inrange Line thickness
source: Thick
de: Dick

# @info screen saver description
source: This draws lacy fractal patterns based on iteration in the imaginary plane, from a 1986 Scientific American article. See also the "Discrete" screen saver. Written by Patrick Naughton; 1992.
de: Zeichnet ein interessantes Fraktalmuster mit Iterationen auf der imaginären Ebene. Basiert auf einem Artikel aus „Scientific American“ (1986). Geschrieben von Patrick Naughton, 1992.

# @item:inrange Duration
source: Small
de: Gering

# @item:inrange Duration
source: Large
de: Groß

# @label:slider
source: Color contrast
de: Farbkontrast

# @item:inrange Color contrast
source: Low
de: Niedrig

# @item:inrange Color contrast
source: High
de: Hoch

# @option:check
source: Sine
de: Sinus

# @option:check
source: Popcorn
de: Popkorn

# @info screen saver description
source: This screen saver was removed from the XScreenSaver distribution as of version 5.10. It has been replaced by the more general "Polytopes" screen saver, which can display this object as well as others. The Polytopes "120-cell" object corresponds to this one. Hyperball is to hypercube as dodecahedron is to cube: this displays a 2D projection of the sequence of 3D objects which are the projections of the 4D analog to the dodecahedron. Technically, it is a "120 cell polytope". http://en.wikipedia.org/wiki/Hypercube http://en.wikipedia.org/wiki/Regular_polytope Written by Joe Keane; 2000.
de: Dieser Bildschirmschoner ist in XScreenSaver ab Version 5.10 nicht mehr enthalten. Er wurde durch den allgemeinen Bildschirmschoner „Polytope“ ersetzt, der dieses und auch andere Objekt anzeigen kann. Das Polytop „120-Zellen“ entspricht diesem Objekt. „Hyperball“ verhält sich zu einem Hyperwürfel wie ein Dodekaeder zu einem Würfel. Dieser Bildschirmschoner zeigt eine zweidimensionale Projektion einer Folge von dreidimensionalen Objekten, die Projektionen des vierdimensionalen Analogons zum Dodekaeder sind. http://de.wikipedia.org/wiki/Polytop_(Geometrie). Geschrieben 2000 von Joe Keane.

# @item:inrange Zoom
source: Near
de: Nah

# @item:inrange Zoom
source: Far
de: Weit

# @item:inrange XW rotation
source: Slow
de: Langsam

# @item:inrange XW rotation
source: Fast
de: Schnell

# @item:inrange XY rotation
source: Slow
de: Langsam

# @item:inrange XY rotation
source: Fast
de: Schnell

# @item:inrange XZ rotation
source: Slow
de: Langsam

# @item:inrange XZ rotation
source: Fast
de: Schnell

# @item:inrange YW rotation
source: Slow
de: Langsam

# @item:inrange YW rotation
source: Fast
de: Schnell

# @item:inrange YZ rotation
source: Slow
de: Langsam

# @item:inrange YZ rotation
source: Fast
de: Schnell

# @item:inrange ZW rotation
source: Slow
de: Langsam

# @item:inrange ZW rotation
source: Fast
de: Schnell

# @item screen saver name
source: HyperCube
de: HyperWürfel

# @info screen saver description
source: This screen saver was removed from the XScreenSaver distribution as of version 5.10. It has been replaced by the more general "Polytopes" screen saver, which can display this object as well as others. This displays 2D projections of the sequence of 3D objects which are the projections of the 4D analog to the cube: as a square is composed of four lines, each touching two others; and a cube is composed of six squares, each touching four others; a hypercube is composed of eight cubes, each touching six others. To make it easier to visualize the rotation, it uses a different color for the edges of each face. Don't think about it too long, or your brain will melt. http://en.wikipedia.org/wiki/Hypercube http://en.wikipedia.org/wiki/Tesseract http://en.wikipedia.org/wiki/Regular_polytope Written by Joe Keane, Fritz Mueller, and Jamie Zawinski; 1992.
de: Dieser Bildschirmschoner ist in XScreenSaver ab Version 5.10 nicht mehr enthalten. Er wurde durch den allgemeinen Bildschirmschoner „Polytope“ ersetzt, der dieses und auch andere Objekt anzeigen kann. Dieser Bildschirmschoner zeichnet eine zweidimensionale Projektion der Folge von dreidimensionalen Objekten, die eine Projektion eines analogen vierdimensionalen Würfels sind. Ein Quadrat besteht aus vier Linien, die die vier anderen Linien berühren. Ein Würfel besteht aus sechs Quadraten, die jeweils vier andere berühren. Ein Hyperwürfel besteht aus acht Würfeln, die jeweils sechs andere berühren. Um die Darstellung der Drehung zu vereinfachen, werden unterschiedliche Farben für die Kanten auf jeder Seite verwendet. http://de.wikipedia.org/wiki/Hyperwürfel http://de.wikipedia.org/wiki/Tesseract http://de.wikipedia.org/wiki/Polytop_(Geometrie). Geschrieben von 1992 von Joe Keane, Fritz Mueller und Jamie Zawinski.

# @info screen saver description
source: This screen saver was removed from the XScreenSaver distribution as of version 5.10. It has been replaced by the more general "Polytopes" screen saver, which can display this object as well as others. This displays 2D projections of the sequence of 3D objects which are the projections of the 4D analog to the cube: as a square is composed of four lines, each touching two others; and a cube is composed of six squares, each touching four others; a hypercube is composed of eight cubes, each touching six others. To make it easier to visualize the rotation, it uses a different color for the edges of each face. Don't think about it too long, or your brain will melt. http://en.wikipedia.org/wiki/Hypercube http://en.wikipedia.org/wiki/Regular_polytope Written by Joe Keane, Fritz Mueller, and Jamie Zawinski; 1992.
de: Dieser Bildschirmschoner ist in XScreenSaver ab Version 5.10 nicht mehr enthalten. Er wurde durch den allgemeinen Bildschirmschoner „Polytope“ ersetzt, der dieses und auch andere Objekt anzeigen kann. Dieser Bildschirmschoner zeichnet eine zweidimensionale Projektion der Folge von dreidimensionalen Objekten, die eine Projektion eines analogen vierdimensionalen Würfels sind. Ein Quadrat besteht aus vier Linien, die die vier anderen Linien berühren. Ein Würfel besteht aus sechs Quadraten, die jeweils vier andere berühren. Ein Hyperwürfel besteht aus acht Würfeln, die jeweils sechs andere berühren. Um die Darstellung der Drehung zu vereinfachen, werden unterschiedliche Farben für die Kanten auf jeder Seite verwendet. http://de.wikipedia.org/wiki/Hyperwürfel http://de.wikipedia.org/wiki/Polytop_(Geometrie). Geschrieben von 1992 von Joe Keane, Fritz Mueller und Jamie Zawinski.

# @item screen saver name
source: Hypertorus
de: Hypertorus (vierdimensional)

# @info screen saver description
source: This shows a rotating Clifford Torus: a torus lying on the "surface" of a 4D hypersphere. Inspired by Thomas Banchoff's book "Beyond the Third Dimension: Geometry, Computer Graphics, and Higher Dimensions", Scientific American Library, 1990. http://en.wikipedia.org/wiki/N-sphere http://en.wikipedia.org/wiki/Clifford_torus http://en.wikipedia.org/wiki/Regular_polytope Written by Carsten Steger; 2003.
de: Zeigt einen rotierenden Clifford-Torus: ein Torus, der auf der „Oberfläche“ einer 4-dimensionalen Hyperspäre liegt. Inspiriert durch das Buch „Beyond the Third Dimension: Geometry, Computer Graphics, and Higher Dimensions“ (Scientific American Library, 1990) von Thomas Banchoff. Siehe auch: http://de.wikipedia.org/wiki/Sphäre_(Mathematik) http://en.wikipedia.org/wiki/Clifford_torus http://en.wikipedia.org/wiki/Regular_polytope . Geschrieben von Carsten Steger; 2003.

# @option:radio
source: Solid
de: Festkörper

# @option:radio
source: Solid object
de: Festes Objekt

# @option:radio
source: Transparent bands
de: Transparente Bänder

# @option:radio
source: 1 transparent spiral
de: 1 transparente Spirale

# @option:radio
source: See-through spirals (1 spiral)
de: Klarsichtspiralen (1 Spirale)

# @option:radio
source: 2 transparent spirals
de: 2 transparente Spiralen

# @option:radio
source: See-through spirals (2 spirals)
de: Klarsichtspiralen (2 Spiralen)

# @option:radio
source: 4 transparent spirals
de: 4 transparente Spiralen

# @option:radio
source: See-through spirals (4 spirals)
de: Klarsichtspiralen (4 Spiralen)

# @option:radio
source: 8 transparent spirals
de: 8 transparente Spiralen

# @option:radio
source: See-through spirals (8 spirals)
de: Klarsichtspiralen (8 Spiralen)

# @option:radio
source: 16 Transparent spirals
de: 16 transparente Spiralen

# @option:radio
source: See-through spirals (16 spirals)
de: Klarsichtspiralen (16 Spiralen)

# @option:radio
source: Two-sided
de: Zweiseitig

# @option:radio
source: Color wheel
de: Farbrad

# @option:radio
source: Perspective 3D
de: Perspektive 3D

# @option:radio
source: Orthographic 3D
de: Orthografisch 3D

# @option:radio
source: Perspective 4D
de: Perspektive 4D

# @option:radio
source: Orthographic 4D
de: Orthografisch 4D

# @label:slider
source: WX rotation speed
de: WX-Drehgeschwindigkeit

# @label:slider
source: WY rotation speed
de: WY-Drehgeschwindigkeit

# @label:slider
source: WZ rotation speed
de: WZ-Drehgeschwindigkeit

# @label:slider
source: XY rotation speed
de: XY-Drehgeschwindigkeit

# @label:slider
source: XZ rotation speed
de: XZ-Drehgeschwindigkeit

# @label:slider
source: YZ rotation speed
de: YZ-Drehgeschwindigkeit

# @item screen saver name
source: Hypnowheel
de: Hypnorad

# @info screen saver description
source: Draws a series of overlapping, translucent spiral patterns. The tightness of their spirals fluctuates in and out. http://en.wikipedia.org/wiki/Moire_pattern Written by Jamie Zawinski; 2008.
de: Zeichnet eine Folge von durchscheinenden Spiralmustern. Die Durchlässigkeit dieser Spiralen schwankt hin und her. (http://de.wikipedia.org/wiki/Moiré-Effekt). Geschrieben 2008 von Jamie Zawinski.

# @option:check
source: Symmetric twisting
de: Symmetrisches Verdrehen

# @label:slider
source: Twistiness
de: Verdrehtheit

# @item:inrange Twistiness
source: Low
de: Gering

# @item:inrange Twistiness
source: High
de: Hoch

# @info screen saver description
source: Clouds of iterated function systems spin and collide. Note that the "Detail" parameter is exponential. Number of points drawn is functions^detail. http://en.wikipedia.org/wiki/Iterated_function_system Written by Chris Le Sueur and Robby Griffin; 1997.
de: Wolken eines iterativen Funktionen-Systems drehen sich und kollidieren. Beachten Sie, dass der „Detail“-Parameter exponential verläuft. Anzahl der gezeichneten Punkte ist Funktionen^Detail. http://de.wikipedia.org/wiki/Iteriertes_Funktionensystem Geschrieben von Chris Le Sueur und Robby Griffin; 1997.

# @info screen saver description
source: This one draws spinning, colliding iterated-function-system images. Note that the "Detail" parameter is exponential. Number of points drawn is functions^detail. http://en.wikipedia.org/wiki/Iterated_function_system Written by Chris Le Sueur and Robby Griffin; 1997.
de: Zeichnet sich drehende, kollidierende Bilder eines Iterativen-Funktionen-Systems. Beachten Sie, dass der „Detail“-Parameter exponential verläuft. Anzahl der gezeichneten Punkte ist Funktionen^Detail. http://de.wikipedia.org/wiki/Iteriertes_Funktionensystem Geschrieben von Chris Le Sueur und Robby Griffin; 1997.

# @label:slider
source: Number of functions
de: Anzahl der Funktionen
