Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/kdeartwork/kxsconfig.po
Languages: de

source: Extra options to pass to the screen saver
de: Besondere Parameter zur Übergabe an den Bildschirmschoner

# @item screen saver name
source: Abstractile
de: Abstraktion

# @info screen saver description
source: Generates mosaic patterns of interlocking tiles. Written by Steve Sundstrom; 2004.
de: Erzeugt Mosaik-Muster aus Teilen, die ineinander passen. Geschrieben von Steve Sundstrom; 2004.

# @label:slider
source: Speed
de: Geschwindigkeit

# @item:inrange Speed
source: Slow
de: Langsam

# @item:inrange Speed
source: Fast
de: Schnell

# @label:slider
source: Linger
de: Andauern

# @item:inrange Linger
source: 0 seconds
de: 0 Sekunden

# @item:inrange Linger
source: 60 seconds
de: 60 Sekunden

# @option:radio
source: Random tile layout
de: Zufällige Teilchen

# @option:radio
source: Flat tiles
de: Flache Teile

# @option:radio
source: Thin tiles
de: Dünne Teile

# @option:radio
source: Outline tiles
de: Umrisse der Teile

# @option:radio
source: Block tiles
de: Blockartige Teile

# @option:radio
source: Neon tiles
de: Neon

# @option:radio
source: Tiled tiles
de: Unterteilte Teile

# @option:check
source: Show frame rate
de: Bildrate anzeigen

# @info screen saver description
source: Wiggling tentacles. Written by Gabriel Finch; 2002.
de: Schlängelnde Fangarme. Geschrieben von Gabriel Finch; 2002.

# @label:slider
source: Arms
de: Arme

# @item:inrange Arms
source: Few
de: Wenige

# @item:inrange Arms
source: Many
de: Viele

# @label:slider
source: Tentacles
de: Tentakel

# @item:inrange Tentacles
source: Few
de: Wenige

# @item:inrange Tentacles
source: Many
de: Viele

# @label:slider
source: Thickness
de: Dicke

# @item:inrange Thickness
source: Thin
de: Dünn

# @item:inrange Thickness
source: Thick
de: Dick

# @label:slider
source: Withdraw freqency
de: Häufigkeit des Neubeginns

# @item:inrange Withdraw freqency
source: Often
de: Häufig

# @item:inrange Withdraw freqency
source: Rarely
de: Selten

# @label:slider
source: Turn speed
de: Animationsgeschwindigkeit

# @item:inrange Turn speed
source: Slow
de: Langsam

# @item:inrange Turn speed
source: Fast
de: Schnell

# @info screen saver description
source: This demonstrates a search algorithm designed for locating a source of odor in turbulent atmosphere. The searcher is able to sense the odor and determine local instantaneous wind direction. The goal is to find the source in the shortest mean time. http://en.wikipedia.org/wiki/Anemotaxis Written by Eugene Balkovsky; 2004.
de: Anemotaxis zeigt ein Verfahren, um eine Geruchsquelle in unruhiger Luft zu finden. Der Sucher kann den Geruch wahrnehmen und die Windrichtung an seinem Standort bestimmen. Das Ziel ist die Geruchsquelle in der kürzesten Durchschnittszeit zu finden, siehe http://en.wikipedia.org/wiki/Anemotaxis und http://de.wikipedia.org/wiki/Taxis. Geschrieben von Eugene Balkovsky; 2004.

# @info screen saver description
source: Anemotaxis demonstrates a search algorithm designed for locating a source of odor in turbulent atmosphere. The searcher is able to sense the odor and determine local instantaneous wind direction. The goal is to find the source in the shortest mean time. http://en.wikipedia.org/wiki/Anemotaxis Written by Eugene Balkovsky; 2004.
de: Anemotaxis zeigt ein Verfahren, um eine Geruchsquelle in unruhiger Luft zu finden. Der Sucher kann den Geruch wahrnehmen und die Windrichtung an seinem Standort bestimmen. Das Ziel ist die Geruchsquelle in der kürzesten Durchschnittszeit zu finden, siehe http://en.wikipedia.org/wiki/Anemotaxis und http://de.wikipedia.org/wiki/Taxis. Geschrieben von Eugene Balkovsky; 2004.

# @label:slider
source: Frame rate
de: Bildwiederholrate

# @item:inrange Frame rate
source: Low
de: Niedrig

# @item:inrange Frame rate
source: High
de: Hoch

# @label:slider
source: Distance
de: Entfernung

# @item:inrange Distance
source: Near
de: Nah

# @item:inrange Distance
source: Far
de: Weit

# @label:slider
source: Sources
de: Quellen

# @item:inrange Sources
source: Few
de: Wenige

# @item:inrange Sources
source: Many
de: Viele

# @label:slider
source: Searchers
de: Sucher

# @item:inrange Searchers
source: Few
de: Wenige

# @item:inrange Searchers
source: Many
de: Viele

# @item screen saver name
source: Ant
de: Ameise

# @info screen saver description
source: This screen saver was removed from the XScreenSaver distribution as of version 4.22. A cellular automaton that is really a two-dimensional Turing machine: as the heads ("ants") walk along the screen, they change pixel values in their path. Then, as they pass over changed pixels, their behavior is influenced. http://en.wikipedia.org/wiki/Langton%27s_ant http://en.wikipedia.org/wiki/Turing_machine Written by David Bagley; 1997.
de: Dieser Bildschirmschoner ist in XScreenSaver ab Version 4.22 nicht mehr enthalten.Ein zellulärer Automat ist eigentlich eine zweidimensionale Turingmaschine. Während die Köpfe („Ameisen“) über den Bildschirm laufen, ändern sie die Pixelfarbe ihres Weges. Wenn sie über bereits gefärbte Pixel kommen, ändert sich ihr Verhalten (http://de.wikipedia.org/wiki/Ameise_(Turingmaschine)).Geschrieben von David Bagley; 1997.

# @label:slider
source: Timeout
de: Wartezeit

# @item:inrange Timeout
source: Small
de: Klein

# @item:inrange Timeout
source: Large
de: Groß

# @option:check
source: Sharp turns
de: Scharfe Wendung

# @option:check
source: Truchet lines
de: Truchet-Muster

# @option:check
source: Draw eyes
de: Augen anzeigen

# @label:slider
source: Number of colors
de: Anzahl der Farben

# @item:inrange Number of colors
source: Three
de: Drei

# @item:inrange Number of colors
source: Many
de: Viele

# @label:spinbox
source: Ants count
de: Anzahl der Ameisen

# @label:spinbox
source: Ant size
de: Größe der Ameisen

# @option:radio
source: Random cell shape
de: Zufällige Zellenform

# @option:radio
source: Three sided cells
de: 3-seitige Zellen

# @option:radio
source: Four sided cells
de: 4-seitige Zellen

# @option:radio
source: Six sided cells
de: 6-seitige Zellen

# @option:radio
source: Nine sided cells
de: 9-seitige Zellen

# @option:radio
source: Twelve sided cells
de: 12-seitige Zellen

# @item screen saver name
source: AntInspect
de: Ameiseninspektion

# @info screen saver description
source: Draws a trio of ants moving their spheres around a circle. Written by Blair Tennessy; 2004.
de: Zeichnet drei Ameisen, die sich in Kugeln auf einem Kreis bewegen. Geschrieben von Blair Tennessy; 2004.

# @option:check
source: Draw shadows
de: Schatten anzeigen

# @item screen saver name
source: AntMaze
de: Ameisenlabyrinth

# @info screen saver description
source: Draws a few views of a few ants walking around in a simple maze. Written by Blair Tennessy; 2005.
de: Zeigt einige dreidimensionale Ansichten von Ameisen, die sich in einem einfachen Irrgarten bewegen. Geschrieben von Blair Tennessy; 2005.

# @item screen saver name
source: AntSpotlight
de: Ameise mit Scheinwerfer

# @info screen saver description
source: Draws an ant (with a headlight) who walks around on top of a loaded image. Written by Blair Tennessy; 2003.
de: Zeichnet eine Ameise mit Scheinwerfer, die auf einem geladenen Bild umher wandert. Geschrieben von Blair Tennessy; 2003.

# @info screen saver description
source: Draws an ant (with a headlight) who walks on top of an image of your desktop or other image. Written by Blair Tennessy; 2003.
de: Zeichnet eine Ameise mit Scheinwerfer, die auf der Arbeitsfläche oder einem anderen Bild umher wandert. Geschrieben von Blair Tennessy; 2003.

# @item screen saver name
source: Apollonian
de: Apollonische Kreise

# @info screen saver description
source: Draws an Apollonian gasket: a fractal packing of circles with smaller circles, demonstrating Descartes's theorem. http://en.wikipedia.org/wiki/Apollonian_gasket http://en.wikipedia.org/wiki/Descartes%27_theorem Written by Allan R. Wilks and David Bagley; 2002.
de: Füllt einen großen Kreis mit kleineren Kreisen und demonstriert Descartes' Kreistheorem. http://de.wikipedia.org/wiki/Satz_von_Descartes. Geschrieben 2002 von Allan R. Wilks und David Bagley.

# @option:check
source: Draw labels
de: Beschriftung zeigen

# @option:check
source: Include alternate geometries
de: Auch Alternative Geometrien benutzen

# @label:slider
source: Depth
de: Tiefe

# @item:inrange Depth
source: Shallow
de: Flach

# @item:inrange Depth
source: Deep
de: Tief

# @item:inrange Number of colors
source: Two
de: Zwei

# @info screen saver description
source: Simulates an original Apple ][ Plus computer in all its 1979 glory. It also reproduces the appearance of display on a color television set of the period. In "Basic Programming Mode", a simulated user types in a BASIC program and runs it. In "Text Mode", it displays the output of a program, or the contents of a file or URL. In "Slideshow Mode", it chooses random images and displays them within the limitations of the Apple ][ display hardware. (Six available colors in hi-res mode!) On MacOS and Linux, this program is also a fully-functional VT100 emulator! Run it as an application instead of as a screen saver and you can use it as a terminal. http://en.wikipedia.org/wiki/Apple_II_series Written by Trevor Blackwell; 2003.
de: Simuliert einen original Apple ][ Plus in all seiner Pracht um 1979. Auch die Bildschirmdarstellung auf einem Farbfernseher wird, so wie es zu der Zeit normal war, reduziert. Im Programmier-Modus wird ein Benutzer simuliert, der ein BASIC-Programm eingibt und es anschließend ausführt. Im Text-Modus wird eine einfache Programmausgabe oder der Inhalt einer Datei/Adresse angezeigt. Im Diaschau-Modus werden Bilder zufällig ausgewählt und mit den üblichen Einschränkungen eines Apple ][ angezeigt (6 mögliche Farben im hochauflösendem Modus). Auf MacOS und Linux ist dieses Programm auch ein vollwertiges VT100-Terminal. Starten Sie es als Programm statt als Bildschirmschoner und Sie können es als Terminal verwenden. (http://de.wikipedia.org/wiki/Apple_II). Geschrieben von Trevor Blackwell; 2003.

# @info screen saver description
source: Simulates an original Apple ][ Plus computer in all its 1979 glory. It also reproduces the appearance of display on a color television set of the period. In "Basic Programming Mode", a simulated user types in a BASIC program and runs it. In "Text Mode", it displays the output of a program, or the contents of a file or URL. In "Slideshow Mode", it chooses random images and displays them within the limitations of the Apple ][ display hardware. (Six available colors in hi-res mode!) This program is also a fully-functional VT100 emulator! Run it as an application instead of as a screen saver and you can use it as a terminal. http://en.wikipedia.org/wiki/Apple_II_series Written by Trevor Blackwell; 2003.
de: Simuliert einen original Apple ][ Plus in all seiner Pracht um 1979. Auch die Bildschirmdarstellung auf einem Farbfernseher wird, so wie es zu der Zeit normal war, reduziert. Im Programmier-Modus wird ein Benutzer simuliert, der ein BASIC-Programm eingibt und es anschließend ausführt. Im Text-Modus wird eine einfache Programmausgabe oder der Inhalt einer Datei/Adresse angezeigt. Im Diaschau-Modus werden Bilder zufällig ausgewählt und mit den üblichen Einschränkungen eines Apple ][ angezeigt (6 mögliche Farben im hochauflösendem Modus). Dieses Programm ist auch ein vollwertiges VT100-Terminal. Starten Sie es als Programm statt als Bildschirmschoner und Sie können es als Terminal verwenden. (http://de.wikipedia.org/wiki/Apple_II). Geschrieben von Trevor Blackwell; 2003.

# @info screen saver description
source: Simulates an original Apple ][ Plus computer in all its 1979 glory. It also reproduces the appearance of display on a color television set of the period. In "Basic Programming Mode", a simulated user types in a BASIC program and runs it. In "Text Mode", it displays the output of a program, or the contents of a file or URL. In "Slideshow Mode", it chooses random images and displays them within the limitations of the Apple ][ display hardware. (Six available colors in hi-res mode!) On X11 systems, This program is also a fully-functional VT100 emulator. http://en.wikipedia.org/wiki/Apple_II_series Written by Trevor Blackwell; 2003.
de: Simuliert einen original Apple ][ Plus in all seiner Pracht um 1979. Auch die Bildschirmdarstellung auf einem Farbfernseher wird, so wie es zu der Zeit normal war, reduziert. Im Programmier-Modus wird ein Benutzer simuliert, der ein BASIC-Programm eingibt und es anschließend ausführt. Im Text-Modus wird eine einfache Programmausgabe oder der Inhalt einer Datei/Adresse angezeigt. Im Diaschau-Modus werden Bilder zufällig ausgewählt und mit den üblichen Einschränkungen eines Apple ][ angezeigt (6 mögliche Farben im hochauflösendem Modus). Auf X11-Systemen ist dieses Programm auch ein vollwertiges VT100-Terminal. (http://de.wikipedia.org/wiki/Apple_II). Geschrieben von Trevor Blackwell; 2003.

# @option:radio
source: Choose display mode randomly
de: Anzeigemodus zufällig wählen

# @option:radio
source: Display scrolling text
de: Lauftext anzeigen

# @option:radio
source: Display images
de: Bilder anzeigen

# @option:radio
source: Run basic programs
de: Einfache Programme ausführen

# @label:slider
source: Duration
de: Dauer

# @item:inrange Duration
source: 10 seconds
de: 10 Sekunden

# @item:inrange Duration
source: 10 minutes
de: 10 Minuten

# @label:slider
source: Color Knob
de: Farbknopf

# @item:inrange Color Knob
source: Low
de: Niedrig

# @item:inrange Color Knob
source: High
de: Hoch

# @label:slider
source: Tint Knob
de: Farbtonknopf

# @item:inrange Tint Knob
source: Low
de: Niedrig

# @item:inrange Tint Knob
source: High
de: Hoch

# @label:slider
source: Brightness Knob
de: Helligkeitsknopf

# @item:inrange Brightness Knob
source: Low
de: Niedrig

# @item:inrange Brightness Knob
source: High
de: Hoch

# @label:slider
source: Contrast Knob
de: Kontrastknopf

# @item:inrange Contrast Knob
source: Low
de: Niedrig

# @item:inrange Contrast Knob
source: High
de: Hoch

# @info screen saver description
source: A 3D animation of a number of sharks, dolphins, and whales. Written by Mark Kilgard; 1998.
de: Eine 3D-Animation mit Haien, Delfinen und Walen. Geschrieben von Mark Kilgard; 1998.

# @label:slider
source: Whale speed
de: Wal-Geschwindigkeit

# @item:inrange Whale speed
source: Slow
de: Langsam

# @item:inrange Whale speed
source: Fast
de: Schnell

# @label:slider
source: Shark proximity
de: Hai-Nähe

# @item:inrange Shark proximity
source: Shy
de: Scheu

# @item:inrange Shark proximity
source: Agressive
de: Aggressiv

# @label:slider
source: Number of sharks
de: Anzahl der Haie

# @item:inrange Number of sharks
source: None
de: Keine

# @option:radio
source: Shimmering water
de: Schimmerndes Wasser

# @option:radio
source: Clear water
de: Klares Wasser

# @option:radio
source: Flat background
de: Einfacher Hintergrund

# @option:radio
source: Gradient background
de: Hintergrund mit Farbverlauf

# @option:check
source: Wireframe
de: Drahtgitter

# @item screen saver name
source: Attraction
de: Anziehung

# @info screen saver description
source: Points attract each other up to a certain distance, and then begin to repel each other. The attraction/repulsion is proportional to the distance between any two particles, similar to the strong and weak nuclear forces. Written by Jamie Zawinski and John Pezaris; 1992.
de: Die Punkte ziehen einander bis zu einer gewissen Distanz an, dann aber stoßen sie einander ab. Die Anziehung bzw. Abstoßung ist proportional zur Entfernung zwischen zwei Teilchen, analog zu den starken und schwachen Kernkräften. Geschrieben von Jamie Zawinski und John Pezaris; 1992.

# @info screen saver description
source: Uses a simple simple motion model to generate many different display modes. The control points attract each other up to a certain distance, and then begin to repel each other. The attraction/repulsion is proportional to the distance between any two particles, similar to the strong and weak nuclear forces. Written by Jamie Zawinski and John Pezaris; 1992.
de: Ähnlich wie Qix wird hier ein einfaches Bewegungsmodell benutzt, um viele verschiedene Darstellungen zu erzeugen. Die Kontrollpunkte ziehen einander bis zu einer gewissen Distanz an, dann aber stoßen sie einander ab. Die Anziehung bzw. Abstoßung ist proportional zur Entfernung zwischen zwei Teilchen, analog zu den starken und schwachen Kernkräften. Geschrieben von Jamie Zawinski und John Pezaris; 1992.

# @option:radio
source: Balls
de: Bälle

# @option:radio
source: Lines
de: Linien

# @option:radio
source: Tails
de: Schweife

# @option:radio
source: Polygons
de: Polygon

# @option:radio
source: Splines
de: Kurven

# @option:radio
source: Filled splines
de: Gefüllte Kurven

# @option:radio
source: Bounce off walls
de: Von Wänden abprallen

# @option:radio
source: Ignore screen edges
de: Bildschirmkanten ignorieren

# @label:spinbox
source: Ball count
de: Anzahl der Bälle

# @label:slider
source: Environmental viscosity
de: Zähflüssigkeit der Umgebung

# @item:inrange Environmental viscosity
source: Low
de: Niedrig

# @item:inrange Environmental viscosity
source: High
de: Hoch

# @label:slider
source: Trail length
de: Schweiflänge

# @item:inrange Trail length
source: Short
de: Kurz

# @item:inrange Trail length
source: Long
de: Lang

# @item:inrange
source: Ball mass
de: Masse der Bälle

# @item:inrange
source: High
de: Hoch

# @label:slider
source: Repulsion threshold
de: Schwellenwert für die Abstoßung

# @item:inrange Repulsion threshold
source: Small
de: Klein

# @item:inrange Repulsion threshold
source: Large
de: Groß

# @option:check
source: Orbital mode
de: Orbitaler Modus

# @item:inrange
source: Outward
de: Auswärts

# @item:inrange
source: Inward
de: Einwärts

# @item screen saver name
source: Atunnel
de: Grauer Tunnel

# @info screen saver description
source: Zooming through a textured tunnel. Written by Eric Lassauge and Roman Podobedov; 2003.
de: Animiert eine Fahrt durch einen texturierten Tunnel. Geschrieben von Eric Lassauge und Roman Podobedov; 2003.

# @info screen saver description
source: Draws an animation of a textured tunnel in GL. Written by Eric Lassauge and Roman Podobedov; 2003.
de: Animiert eine Fahrt durch einen Tunnel unter Verwendung von OpenGL. Geschrieben von Eric Lassauge und Roman Podobedov; 2003.

# @option:check
source: Textured
de: Strukturierte Oberfläche

# @option:check
source: Lighting
de: Beleuchtung

# @item screen saver name
source: Barcode
de: Strichcode

# @info screen saver description
source: Draws a random sequence of colorful barcodes scrolling across your screen. CONSUME! The barcodes follow the UPC-A, UPC-E, EAN-8 or EAN-13 standards. http://en.wikipedia.org/wiki/Universal_Product_Code http://en.wikipedia.org/wiki/European_Article_Number Written by Dan Bornstein; 2003.
de: Zeichnet zufällige farbige Strichcodes auf dem Bildschirm. Die Strichcodes folgen den Standards UPC-A, UPC-E, EAN-8 oder EAN-13. Siehe auch: http://de.wikipedia.org/wiki/Universal_Product_Code und http://de.wikipedia.org/wiki/European_Article_Number. Geschrieben von Dan Bornstein; 2003.

# @option:radio
source: Scrolling barcodes
de: Durchlaufende Strichcodes

# @option:radio
source: Barcode grid
de: Strichcode-Gitter

# @option:radio
source: Barcode clock (AM/PM)
de: Strichcode-Uhr (AM/PM)

# @option:radio
source: Barcode clock (24 hour)
de: Strichcode-Uhr (24 Stunden)

# @info screen saver description
source: Draws a simulation of flying space-combat robots (cleverly disguised as colored circles) doing battle in front of a moving star field. Written by Jonathan Lin; 1999.
de: Zeichnet eine Simulation von fliegenden Raumkampf-Robotern (verdeckt durch bunte Kreise), die in einem bewegten Sternenfeld kämpfen. Geschrieben von Jonathan Lin; 1999.

# @label:spinbox
source: Robots
de: Roboter

# @label:spinbox
source: Lasers
de: Laser

# @label:slider
source: Stars
de: Sterne

# @item:inrange Stars
source: Few
de: Wenige

# @item:inrange Stars
source: Many
de: Viele

# @info screen saver description
source: A motion-blurred ball bounces inside a box whose tiles only become visible upon impact. Written by Jeremy English; 2003.
de: Ein durch Bewegung unscharfer Ball springt in einer Kiste umher, deren Wände beim Auftreffen sichtbar werden. Schrieben 2003 von Jeremy English

# @info screen saver description
source: Shows a ball contained inside of a bounding box. Colored blocks blink in when the ball hits the sides. Written by Jeremy English; 2003.
de: Animiert einen Ball in einer unsichtbaren Kiste. Die Teile der Kiste werden sichtbar, wenn der Ball an ihre Wände stößt. Geschrieben von Jeremy English; 2003.

# @label:slider
source: Box size
de: Größe der Kiste

# @item:inrange Box size
source: Small
de: Klein

# @item:inrange Box size
source: Large
de: Groß

# @option:check
source: Fade
de: Verblassen

# @option:check
source: Motion blur
de: Bewegungsunschärfe

# @option:check
source: Dissolve
de: Auflösen

# @item screen saver name
source: BlitSpin
de: Teilen und Drehen

# @info screen saver description
source: Repeatedly rotates a bitmap by 90 degrees by using logical operations: the bitmap is divided into quadrants, and the quadrants are shifted clockwise. Then the same thing is done again with progressively smaller quadrants, except that all sub-quadrants of a given size are rotated in parallel. As you watch it, the image appears to dissolve into static and then reconstitute itself, but rotated. Written by Jamie Zawinski; 1992.
de: Wiederholt immer wieder die Drehung eines Bildes um 90°: Das Bild wird in Quadranten aufgeteilt und diese Quadranten werden im Uhrzeigersinn gedreht. Dieses Verfahren wird innerhalb eines jeden Quadranten wiederholt. Dabei scheint das Bild im Rauschen zu verschwinden, nur um dann gedreht wieder aufzutauchen. Geschrieben von Jamie Zawinski; 1992.

# @label:slider
source: Fuzzy rotation speed
de: Zufällige Drehgeschwindigkeit

# @item:inrange Fuzzy rotation speed
source: Slow
de: Langsam

# @item:inrange Fuzzy rotation speed
source: Fast
de: Schnell

# @label:slider
source: 90 degree rotation speed
de: 90° Drehgeschwindigkeit

# @item:inrange 90 degree rotation speed
source: Slow
de: Langsam

# @item:inrange 90 degree rotation speed
source: Fast
de: Schnell

# @item screen saver name
source: BlockTube
de: Blocktunnel

# @info screen saver description
source: Draws a swirling, falling tunnel of reflective slabs. They fade from hue to hue. Written by Lars R. Damerow; 2003.
de: Animiert einen Tunnel aus wirbelnden und reflektierenden Platten, die zudem noch ihren Farbton wechseln. Geschrieben von Lars R. Damerow; 2003.

# @label:slider
source: Color hold time
de: Zeit für Farbbeibehaltung

# @item:inrange Color hold time
source: Short
de: Kurz

# @item:inrange Color hold time
source: Long
de: Lang

# @label:slider
source: Color change time
de: Zeit für Farbwechsel

# @item:inrange Color change time
source: Short
de: Kurz

# @item:inrange Color change time
source: Long
de: Lang
