Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/kdeartwork/kxsconfig.po
Languages: de

# @item screen saver name
source: Substrate
de: Kristallsubstrat

# @info screen saver description
source: Crystalline lines grow on a computational substrate. A simple perpendicular growth rule creates intricate city-like structures. Written by J. Tarbell and Mike Kershaw; 2004.
de: Kristalllinien wachsen auf einem rechnerischen Substrat. Eine einfache senkrechte Wachstumsregel erzeugt komplexe Stadt-ähnliche Strukturen. Geschrieben von J. Tarbell und Mike Kershaw; 2004.

# @label:slider
source: Sand grains
de: Sandkörner

# @item:inrange Sand grains
source: Few
de: Wenige

# @item:inrange Sand grains
source: Lots
de: Viele

# @label:slider
source: Circle percentage
de: Kreis-Prozentsatz

# @label:spinbox
source: Initial cracks
de: Anfangsrisse

# @option:check
source: Wireframe only
de: Nur Drahtgitter

# @item screen saver name
source: Superquadrics
de: Superquadrat

# @info screen saver description
source: Morphing 3D shapes. Written by Ed Mackey; 1987, 1997.
de: Sich verformende 3D-Gebilde. Geschrieben von Ed Mackey; 1987, 1997.

# @label:slider
source: Spin speed
de: Drehgeschwindigkeit

# @item:inrange Spin speed
source: Slow
de: Langsam

# @item:inrange Spin speed
source: Fast
de: Schnell

# @item screen saver name
source: Surfaces
de: Flächen

# @info screen saver description
source: This draws a visualization of several interesting parametric surfaces. http://mathworld.wolfram.com/DinisSurface.html http://en.wikipedia.org/wiki/Enneper_surface http://mathworld.wolfram.com/EnnepersMinimalSurface.html http://mathworld.wolfram.com/KuenSurface.html http://en.wikipedia.org/wiki/Moebius_strip http://mathworld.wolfram.com/Seashell.html http://mathworld.wolfram.com/SwallowtailCatastrophe.html http://mathworld.wolfram.com/BohemianDome.html http://en.wikipedia.org/wiki/Whitney_umbrella http://mathworld.wolfram.com/PlueckersConoid.html http://mathworld.wolfram.com/HennebergsMinimalSurface.html http://mathworld.wolfram.com/CatalansSurface.html http://mathworld.wolfram.com/CorkscrewSurface.html Written by Andrey Mirtchovski and Carsten Steger; 2003.
de: Dies zeichnet mehrere interessante parametrische Flächen (http://mathworld.wolfram.com/DinisSurface.html http://en.wikipedia.org/wiki/Enneper_surface http://mathworld.wolfram.com/EnnepersMinimalSurface.html http://mathworld.wolfram.com/KuenSurface.html http://en.wikipedia.org/wiki/Moebius_strip http://mathworld.wolfram.com/Seashell.html http://mathworld.wolfram.com/SwallowtailCatastrophe.html http://mathworld.wolfram.com/BohemianDome.html http://en.wikipedia.org/wiki/Whitney_umbrella http://mathworld.wolfram.com/PlueckersConoid.html http://mathworld.wolfram.com/HennebergsMinimalSurface.html http://mathworld.wolfram.com/CatalansSurface.html http://mathworld.wolfram.com/CorkscrewSurface.html). Geschrieben von Andrey Mirtchovski und Carsten Steger; 2003.

# @option:radio
source: Random Surface
de: Zufällige Fläche

# @option:radio
source: Dini's Surface
de: Dini-Fläche

# @option:radio
source: Enneper's Surface
de: Enneper-Fläche

# @option:radio
source: Kuen Surface
de: Kuen-Fläche

# @option:radio
source: Moebius Strip
de: Möbiusband

# @option:radio
source: Seashell
de: Seemuschel

# @option:radio
source: Swallowtail
de: Schwalbenschwanz

# @option:radio
source: Whitney Umbrella
de: Whitney-Schirm

# @option:radio
source: Pluecker's Conoid
de: Plücker-Konoid

# @option:radio
source: Henneberg's Surface
de: Henneberg-Fläche

# @option:radio
source: Catalan's Surface
de: Catalan-Fläche

# @option:radio
source: Corkscrew Surface
de: Corkscrew-Fläche

# @option:radio
source: Random Display Mode
de: Zufälliger Anzeigemodus

# @option:radio
source: Points
de: Punkte

# @option:radio
source: Line Loops
de: Linienschleifen

# @item screen saver name
source: Swirl
de: Wirbel

# @info screen saver description
source: Flowing, swirly patterns. Written by M. Dobie and R. Taylor; 1997.
de: Fließende Wirbelmuster. Geschrieben 1997 von M. Dobie und R. Taylor.

# @info screen saver description
source: This screen saver was removed from the XScreenSaver distribution as of version 5.08. Draws a working analog clock composed of floating, throbbing bubbles. Written by Bernd Paysan; 1999.
de: Dieser Bildschirmschoner ist in XScreenSaver ab Version 5.08 nicht mehr enthalten.Zeichnet eine Analoguhr aus schwebenden, pochenden Bläschen. Geschrieben von Bernd Paysan; 1999.

# @label:slider
source: Turn side-to-side
de: Änderung des Blickwinkels

# @item:inrange Turn side-to-side
source: 0 deg
de: 0 Grad

# @item:inrange Turn side-to-side
source: 90 deg
de: 90 Grad

# @label:slider
source: Wobbliness
de: Taumelstärke

# @item:inrange Wobbliness
source: Low
de: Niedrig

# @item:inrange Wobbliness
source: High
de: Hoch

# @label:slider
source: Cycle seconds
de: Dauer eines Drehzyklus

# @item:inrange Cycle seconds
source: Low
de: Niedrig

# @item:inrange Cycle seconds
source: High
de: Hoch

# @item:inrange Magnification
source: Smaller
de: Kleiner

# @item:inrange Magnification
source: Bigger
de: Größer

# @option:radio
source: Minute tick marks
de: Zeigermarkierungen für jede Minute

# @option:radio
source: 5 minute tick marks
de: Zeigermarkierungen alle 5 Minuten

# @info screen saver description
source: Solves tangram puzzles. http://en.wikipedia.org/wiki/Tangram Written by Jeremy English; 2005.
de: Löst Tangram-Puzzle (http://de.wikipedia.org/wiki/Tangram). Geschrieben von Jeremy English; 2005.

# @item:inrange Linger
source: Brief
de: Kurz

# @label:slider
source: X rotation
de: X-Drehung

# @item:inrange X rotation
source: Slow
de: Langsam

# @item:inrange X rotation
source: Fast
de: Schnell

# @label:slider
source: Y rotation
de: Y-Drehung

# @item:inrange Y rotation
source: Slow
de: Langsam

# @item:inrange Y rotation
source: Fast
de: Schnell

# @label:slider
source: Z rotation
de: Z-Drehung

# @item:inrange Z rotation
source: Slow
de: Langsam

# @item:inrange Z rotation
source: Fast
de: Schnell

# @item screen saver name
source: Thornbird
de: Dornenvogel

# @info screen saver description
source: Displays a view of the "Bird in a Thornbush" fractal. Written by Tim Auckland; 2002.
de: Zeichnet ein Vogel-in-Dornenbusch-Fraktal. Geschrieben von Tim Auckland; 2002.

# @item screen saver name
source: TimeTunnel
de: Zeittunnel

# @info screen saver description
source: Draws an animation similar to the opening and closing effects on the Dr. Who TV show. Written by Sean P. Brennan; 2005.
de: Zeichnet eine Animation ähnlich der des Vor- und Abspanns in der Fernsehserie Dr. Who. Geschrieben von Sean P. Brennan; 2005.

# @label:slider
source: Start sequence time
de: Startsequenzzeit

# @item:inrange Start sequence time
source: 0 sec
de: 0 Sek.

# @item:inrange Start sequence time
source: 30 sec
de: 30 Sek.

# @label:slider
source: End sequence time
de: Endsequenzzeit

# @item:inrange End sequence time
source: 0 sec
de: 0 Sek.

# @item:inrange End sequence time
source: 30 sec
de: 30 Sek.

# @option:check
source: Draw logo
de: Logo zeichnen

# @option:check
source: Run backward
de: Rückwärts durchlaufen

# @item screen saver name
source: TopBlock
de: Fallende Steine

# @info screen saver description
source: Creates a 3D world with dropping blocks that build up and up. Written by rednuht; 2006.
de: Erzeugt eine 3D-Welt mit fallenden Blöcken, die sich stapeln. Geschrieben von rednuht; 2006.

# @label:slider
source: Drop speed
de: Fallgeschwindigkeit

# @item:inrange Drop speed
source: Slow
de: Langsam

# @item:inrange Drop speed
source: Fast
de: Schnell

# @label:slider
source: Carpet size
de: Bodengröße

# @item:inrange Carpet size
source: Small
de: Klein

# @item:inrange Carpet size
source: Large
de: Groß

# @label:slider
source: Spawn likelyhood
de: Wahrscheinlichkeit der Vermehrung

# @item:inrange Spawn likelyhood
source: Low
de: Gering

# @item:inrange Spawn likelyhood
source: High
de: Hoch

# @label:slider
source: Polygon count
de: Anzahl der Polygone

# @item:inrange Polygon count
source: Low
de: Gering

# @item:inrange Polygon count
source: High
de: Hoch

# @item:inrange Colors
source: Few
de: Wenige

# @option:check
source: Follow
de: Folgen

# @option:check
source: Blob mode
de: Klecks-Modus

# @option:check
source: Tunnel mode
de: Tunnel-Modus

# @option:check
source: Carpet
de: Boden

# @option:check
source: Nipples
de: Noppen

# @item screen saver name
source: Triangle
de: Dreieck

# @info screen saver description
source: Generates random mountain ranges using iterative subdivision of triangles. Written by Tobias Gloth; 1997.
de: Zeichnet ein zufälliges Gebirge mit wiederholter Unterteilung von Dreiecken. Geschrieben von Tobias Gloth; 1997.

# @info screen saver description
source: Draws an animation of the character "Bit" from the film, "Tron". The "yes" state is a tetrahedron; the "no" state is the second stellation of an icosahedron; and the idle state oscillates between a small triambic icosahedron and the compound of an icosahedron and a dodecahedron. http://en.wikipedia.org/wiki/List_of_Tron_characters#Bit http://en.wikipedia.org/wiki/Uniform_polyhedra http://en.wikipedia.org/wiki/Stellation Written by Jamie Zawinski; 2011.
de: Zeichnet eine Animation der Figur „Bit“ aus dem Film „Tron“. Der Status „Ja“ ist ein Tetraeder, der Status „Nein“ erstellt die zweite Variante eines Ikosaeders; und der Status „Untätig“ wechselt zwischen einem kleinen dreieckigen Ikosaeder und der Zusammensetzung eines Ikosaeders mit einem Dodekaeder. http://en.wikipedia.org/wiki/List_of_Tron_characters#Bit http://de.wikipedia.org/wiki/Polyeder Geschrieben von Jamie Zawinski; 2011.

# @info screen saver description
source: This draws line- and arc-based truchet patterns that tile the screen. http://en.wikipedia.org/wiki/Tessellation Written by Adrian Likins; 1998.
de: Zeichnet linien- und kurvenbasierte Truchet-Muster, die den Bildschirm kacheln (http://de.wikipedia.org/wiki/Parkettierung). Geschrieben von Adrian Likins; 1998.

# @item screen saver name
source: Twang
de: Näseln

# @info screen saver description
source: Divides the screen into a grid, and plucks them. Written by Dan Bornstein; 2002.
de: Zerteilt den Bildschirm in ein Gitter und zerpflückt die Teile. Geschrieben von Dan Bornstein; 2002.

# @item:inrange Randomness
source: Slow
de: Langsam

# @item:inrange Randomness
source: Jumpy
de: Kribbelig

# @item:inrange Friction
source: Low
de: Niedrig

# @item:inrange Friction
source: High
de: Hoch

# @label:slider
source: Springiness
de: Elastizität

# @item:inrange Springiness
source: Low
de: Niedrig

# @item:inrange Springiness
source: High
de: Hoch

# @label:slider
source: Transference
de: Gegenseitige Beeinflussung

# @item:inrange Transference
source: Low
de: Niedrig

# @item:inrange Transference
source: High
de: Hoch

# @label:spinbox
source: Border width
de: Randbreite

# @item screen saver name
source: UnknownPleasures
de: Unbekannte Freude

# @info screen saver description
source: PSR B1919+21 (AKA CP 1919) was the first pulsar ever discovered: a spinning neutron star emitting a periodic lighthouse-like beacon. An illustration of the signal received from it was published in Scientific American in 1971, and later in The Cambridge Encyclopedia of Astronomy in 1977, where it was seen by Stephen Morris, the drummer of Joy Division, and was consequently appropriated by Peter Saville for the cover of the band's album "Unknown Pleasures". http://en.wikipedia.org/wiki/Pulsar http://en.wikipedia.org/wiki/PSR_B1919%2B21 http://en.wikipedia.org/wiki/Unknown_Pleasures http://en.wikipedia.org/wiki/Peter_Saville_%28graphic_designer%29 http://en.wikipedia.org/wiki/Joy_Division Written by Jamie Zawinski; 2013.
de: PSR B1919+21 (AKA CP 1919) war der erste entdeckte Pulsar: Ein schnell rotierender Neutronenstern, der wie ein Leuchtturm regelmäßig wiederkehrende Signale abstrahlt. Eine Illustration der empfangenen Signals wurde 1971 in „Scientific American“ und später im Jahr 1977 in „Cambridge Encyclopedia of Astronomy“ veröffentlicht. Dort sah Stephen Morris, der Schlagzeuger der Band „Joy Division“ diese Illustration, die dann von Peter Saville für das Cover des Albums „Unknown Pleasures“ der Band angepasst wurde. http://de.wikipedia.org/wiki/Pulsar http://de.wikipedia.org/wiki/PSR_B1919+21 http://de.wikipedia.org/wiki/Unknown_Pleasures http://de.wikipedia.org/wiki/Peter_Saville http://de.wikipedia.org/wiki/Joy_Division Geschrieben 2013 von Zawinski

# @label:slider
source: Scanlines
de: Scan-Linien

# @item:inrange Scanlines
source: Few
de: Wenige

# @item:inrange Scanlines
source: Many
de: Viele

# @option:check
source: Orthographic Projection
de: Orthographische Projektion

# @item screen saver name
source: Vermiculate
de: Schlängeln

# @info screen saver description
source: Draws squiggly worm-like paths. Written by Tyler Pierce; 2001.
de: Zeichnet verschnörkelte, wurmähnliche Fäden. Geschrieben von Tyler Pierce; 2001.

# @info screen saver description
source: This is a shell script that grabs a frame of video from the system's video input, and then uses some PBM filters (chosen at random) to manipulate and recombine the video frame in various ways (edge detection, subtracting the image from a rotated version of itself, etc.) Then it displays that image for a few seconds, and does it again. This works really well if you just feed broadcast television into it. Written by Jamie Zawinski; 1998.
de: Dieses Programm lädt ein Bild vom Video-Eingang des Computers und filtert es durch zufällig gewählte PBM-Filter (z. B. Kantenerkennung, Rotation). Das fertige Bild wird ein paar Sekunden angezeigt und dann durch das nächste ersetzt. Sieht gut aus, wenn man den Fernseheingang benutzt. Geschrieben von Jamie Zawinski; 1998.

# @item:inrange Duration
source: 2 seconds
de: 2 Sekunden

# @label:chooser
source: Image directory
de: Bilder-Ordner

# @item screen saver name
source: Vines
de: Reben

# @info screen saver description
source: This screen saver was removed from the XScreenSaver distribution as of version 5.08. Generates a continuous sequence of small, curvy geometric patterns. Written by Tracy Camp and David Hansen; 1997.
de: Dieser Bildschirmschoner ist in XScreenSaver ab Version 5.08 nicht mehr enthalten.Zeichnet eine kontinuierliche Sequenz von kleinen, runden Geometriemustern. Geschrieben von Tracy Camp und Davin Hansen; 1997.

# @info screen saver description
source: Draws a randomly-colored Voronoi tessellation, and periodically zooms in and adds new points. The existing points also wander around. There are a set of control points on the plane, each at the center of a colored cell. Every pixel within that cell is closer to that cell's control point than to any other control point. That is what determines the cell's shapes. http://en.wikipedia.org/wiki/Voronoi_diagram http://en.wikipedia.org/wiki/Tessellation Written by Jamie Zawinski; 2007.
de: Zeichnet ein zufällig gefärbtes Voronoi-Mosaik, vergrößert Abschnitte in regelmäßigen Abständen und fügt neue Punkte hinzu. Die existierenden Punkte bewegen sich umher. Es gibt auf der Ebene einige Kontrollpunkte, die sich jeweils im Zentrum einer farbigen Zelle befinden. Jeder Bildpunkt in dieser Zelle ist näher am Kontrollpunkt dieser Zelle als am Kontrollpunkt einer anderen Zelle. Dadurch wird die Form der Zelle bestimmt. http://de.wikipedia.org/wiki/Voronoi-Diagramm http://de.wikipedia.org/wiki/Parkettierung Geschrieben von Jamie Zawinski; 2007.

# @info screen saver description
source: Draws a randomly-colored Voronoi tessellation, and periodically zooms in and adds new points. The existing points also wander around. There are a set of control points on the plane, each at the center of a colored cell. Every pixel within that cell is closer to that cell's control point than to any other control point. That is what determines the cell's shapes. http://en.wikipedia.org/wiki/Voronoi_diagram Written by Jamie Zawinski; 2007.
de: Zeichnet ein zufällig gefärbtes Voronoi-Mosaik, vergrößert Abschnitte in regelmäßigen Abständen und fügt neue Punkte hinzu. Die existierenden Punkte bewegen sich umher. Es gibt auf der Ebene einige Kontrollpunkte, die sich jeweils im Zentrum einer farbigen Zelle befinden. Jeder Bildpunkt in dieser Zelle ist näher am Kontrollpunkt dieser Zelle als am Kontrollpunkt einer anderen Zelle. Dadurch wird die Form der Zelle bestimmt. http://de.wikipedia.org/wiki/Voronoi-Diagramm Geschrieben von Jamie Zawinski; 2007.

# @label:slider
source: Point size
de: Punktgröße

# @item:inrange Point size
source: 50 pixels
de: 50 Pixel

# @label:slider
source: Insertion speed
de: Einfügegeschwindigkeit

# @item:inrange Insertion speed
source: Slow
de: Langsam

# @item:inrange Insertion speed
source: Fast
de: Schnell

# @label:slider
source: Zoom speed
de: Vergrößerungsgeschwindigkeit

# @item:inrange Zoom speed
source: Slow
de: Langsam

# @item:inrange Zoom speed
source: Fast
de: Schnell

# @label:slider
source: Zoom frequency
de: Vergrößerungshäufigkeit

# @item:inrange Zoom frequency
source: 60 seconds
de: 60 Sekunden

# @item screen saver name
source: Wander
de: Umherwandern

# @info screen saver description
source: Draws a colorful random-walk, in various forms. http://en.wikipedia.org/wiki/Random_walk Written by Rick Campbell; 1999.
de: Zeichnet eine farbenfrohe Zufallsbewegung in verschiedenen Formen (http://de.wikipedia.org/wiki/Zufallsbewegung). Geschrieben von Rick Campbell; 1999.

# @option:check
source: Draw spots
de: Flecken zeichnen

# @item screen saver name
source: WebCollage
de: Web-Kollage

# @info screen saver description
source: This is what the Internet looks like. This creates collages out of random images from the World Wide Web. It finds the images by feeding random words into various search engines, and pulling images (or sections of images) out of the pages returned. WARNING: THE INTERNET SOMETIMES CONTAINS PORNOGRAPHY. The Internet being what it is, absolutely anything might show up in the collage including -- quite possibly -- pornography, or even nudity. Please act accordingly. See also http://www.jwz.org/webcollage/ Written by Jamie Zawinski; 1999.
de: So sieht das Internet aus. Dieser stellt Kollagen aus zufällig aus dem World Wide Web bezogenen Bildern. Um Bilder zu suchen, werden zufällige Wörter in verschiedene Suchmaschinen eingegeben und dann Bilder oder Teile von Bildern aus den zurückgegebenen. Achtung: Im Internet gibt es auch Bilder, die Sie vielleicht nicht sehen möchten, wie zum Beispiel Pornographie. Weitere Informationen finden Sie auf http://www.jwz.org/webcollage/. Geschrieben von Jamie Zawinski; 1999.

# @info screen saver description
source: This makes collages out of random images pulled off of the World Wide Web. It finds these images by doing random web searches, and then extracting images from the returned pages. WARNING: THE INTERNET SOMETIMES CONTAINS PORNOGRAPHY. The Internet being what it is, absolutely anything might show up in the collage including -- quite possibly -- pornography, or even nudity. Please act accordingly. See also http://www.jwz.org/webcollage/ Written by Jamie Zawinski; 1999.
de: Diese Programm stellt eine Kollage aus zufällig aus dem WWW bezogenen Grafiken zusammen. Nachdem Webseiten zufällig aufgesucht werden, werden die Bilder daraus extrahiert. ACHTUNG: Im Internet befinden sich auch Dinge, die Sie vielleicht nicht sehen möchten! Weitere Informationen finden Sie auf http://www.jwz.org/webcollage/. Geschrieben von Jamie Zawinski; 1999.

# @label:slider
source: Delay between images
de: Verzögerung zwischen Bildern

# @item:inrange Delay between images
source: None
de: Keine

# @item:inrange Delay between images
source: 30 secs
de: 30 Sek.

# @label:slider
source: Network timeout
de: Zeitüberschreitung im Netzwerk

# @item:inrange Network timeout
source: 2 secs
de: 2 Sek.

# @label:slider
source: Image opacity
de: Deckkraft der Bilder

# @item:inrange Image opacity
source: Opaque
de: Undurchsichtig

# @item screen saver name
source: WhirlWindWarp
de: Wirbelwind

# @info screen saver description
source: Floating stars are acted upon by a mixture of simple 2D force fields. The strength of each force field changes continuously, and it is also switched on and off at random. Written by Paul 'Joey' Clark; 2001.
de: Umlaufende Sterne werden durch eine Mischung von einfachen zweidimensionalen Kraftfeldern bewegt. Die Stärke jedes Kraftfeldes ändert sich ständig bzw. wird an- und ausgeschaltet. Geschrieben von Paul „Joey“ Clark; 2001.

# @info screen saver description
source: Floating stars are acted upon by a mixture of simple 2D forcefields. The strength of each forcefield changes continuously, and it is also switched on and off at random. Written by Paul 'Joey' Clark; 2001.
de: Umlaufende Sterne werden durch eine Mischung von einfachen zweidimensionalen Kraftfeldern bewegt. Die Stärke jedes Kraftfeldes ändert sich ständig bzw. wird an- und ausgeschaltet. Geschrieben von Paul „Joey“ Clark; 2001.

# @label:slider
source: Trail size
de: Länge der Spur

# @item:inrange Trail size
source: Short
de: Kurz

# @item:inrange Trail size
source: Long
de: Lang

# @item screen saver name
source: Whirlygig
de: Bälle auf der Welle

# @info screen saver description
source: This screen saver was removed from the XScreenSaver distribution as of version 5.08. Draws zooming chains of sinusoidal spots. Written by Ashton Trey Belew; 2001.
de: Dieser Bildschirmschoner ist in XScreenSaver ab Version 5.08 nicht mehr enthalten.Zeichnet vergrößernde Ketten von sinusförmigen Punkten. Geschrieben von Ashton Trey Belew; 2001.

# @label:spinbox
source: Whirlies
de: Kreise

# @label:spinbox
source: Lines
de: Linien

# @label:slider
source: X speed
de: X-Geschwindigkeit

# @item:inrange X speed
source: Low
de: Niedrig

# @item:inrange X speed
source: High
de: Hoch

# @label:slider
source: Y speed
de: Y-Geschwindigkeit

# @item:inrange Y speed
source: Low
de: Niedrig

# @item:inrange Y speed
source: High
de: Hoch

# @item:inrange X amplitude
source: Low
de: Niedrig

# @item:inrange X amplitude
source: High
de: Hoch

# @item:inrange Y amplitude
source: Low
de: Niedrig

# @item:inrange Y amplitude
source: High
de: Hoch

# @option:radio
source: X random
de: X-Zufall

# @option:radio
source: X spin
de: Um horizontale Achse drehen

# @option:radio
source: X funky
de: X-Irre

# @option:radio
source: X circle
de: X-Kreis

# @option:radio
source: X fun
de: X-Spaß

# @option:radio
source: X innie
de: X-Bauchnabel

# @option:radio
source: X lissajous
de: X-Oszillogramm

# @option:radio
source: Y random
de: Y-Zufällig

# @option:radio
source: Y spin
de: Um vertikale Achse drehen

# @option:radio
source: Y funky
de: Y-Irre

# @option:radio
source: Y circle
de: Y-Kreis

# @option:radio
source: Y fun
de: Y-Spaß

# @option:radio
source: Y innie
de: Y-Bauchnabel

# @option:radio
source: Y lissajous
de: Y-Oszillogramm

# @option:check
source: Leave a trail
de: Eine Spur hinterlassen

# @option:check
source: Explain modes
de: Erklärungsmodus

# @option:check
source: Wrap the screen
de: Bildschirm einhüllen

# @item screen saver name
source: Worm
de: Wurm

# @info screen saver description
source: This screen saver was removed from the XScreenSaver distribution as of version 5.08. Draws multicolored worms that crawl around the screen. Written by Brad Taylor, Dave Lemke, Boris Putanec, and Henrik Theiling; 1991.
de: Dieser Bildschirmschoner ist in XScreenSaver ab Version 5.08 nicht mehr enthalten.Diese antike xlock-Animation zeichnet regenbogenfarbene Würmer, die über den Bildschirm kriechen. Geschrieben von Brad Taylor, Dave Lemke, Boris Putanec und Henrik Theiling; 1991.

# @item screen saver name
source: Wormhole
de: Wurmloch

# @info screen saver description
source: Flying through a colored wormhole in space. Written by Jon Rafkind; 2004.
de: Durch ein farbenfrohes Wurmloch im Weltraum fliegen. Geschrieben von Jon Rafkind; 2004.
