Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/kdeartwork/kxsconfig.po
Languages: de

# @info screen saver description
source: This bouncing ball is a clone of the first graphics demo for the Amiga 1000, which was written by Dale Luck and RJ Mical during a break at the 1984 Consumer Electronics Show (or so the legend goes.) This looks like the original Amiga demo if you turn off "smoothing" and "lighting" and turn on "scanlines", and is somewhat more modern otherwise. http://en.wikipedia.org/wiki/Amiga#Boing_Ball Written by Jamie Zawinski; 2005.
de: Dieser hüpfende Ball ist ein Klon der ersten Grafik-Demo für den Amiga 1000, die von Dale Luck und RJ Mical 1984 in einer Pause während der Consumer Electronics Show geschrieben wurde (zumindest wird dies erzählt). Das Aussehen gleicht dem Amiga am meisten, wenn Sie die Optionen „Glättung“ und „Beleuchtung“ abschalten, dafür aber „Scan-Linien“ einschalten. Anderenfalls sieht der Ball etwas moderner aus. Siehe auch: http://en.wikipedia.org/wiki/Amiga#Boing_Ball. Geschrieben von Jamie Zawinski; 2005.

# @label:slider
source: Size
de: Größe

# @item:inrange Size
source: Tiny
de: Sehr klein

# @item:inrange Size
source: Huge
de: Riesig

# @label:spinbox
source: Meridians
de: Meridiane

# @label:spinbox
source: Parallels
de: Parallelen

# @option:check
source: Smoothing
de: Glättung

# @option:check
source: Scanlines
de: Scan-Linien

# @info screen saver description
source: This draws what looks like a spinning, deforming balloon with varying-sized spots painted on its invisible surface. Written by Jeremie Petit; 1997.
de: Diese Zeichnung sieht aus wie ein drehender, sich verformender Ballon mit verschieden großen Flecken auf seiner unsichtbaren Oberfläche. Geschrieben von Jeremie Petit; 1997.

# @label:slider
source: Number of spots
de: Anzahl der Flecken

# @item:inrange Number of spots
source: Few
de: Wenige

# @item:inrange Number of spots
source: Many
de: Viele

# @option:check
source: Do Red/Blue 3D separation
de: Trennung des 3D-Bildes nach Rot und Blau

# @item screen saver name
source: BouncingCow
de: Kuh auf Trampolin

# @info screen saver description
source: A Cow. A Trampoline. Together, they fight crime. Written by Jamie Zawinski; 2003.
de: Eine Kuh. Ein Trampolin. Gemeinsam gegen das Unrecht. Geschrieben von Jamie Zawinski; 2003.

# @label:slider
source: Bounce speed
de: Abprall-Geschwindigkeit

# @item:inrange Bounce speed
source: Slow
de: Langsam

# @item:inrange Bounce speed
source: Fast
de: Schnell

# @label:slider
source: Number of cows
de: Anzahl der Kühe

# @item:inrange Number of cows
source: Moo
de: Muh

# @item:inrange Number of cows
source: Herd
de: Herde

# @item screen saver name
source: Boxed
de: Bälle im Käfig

# @info screen saver description
source: Draws a box full of 3D bouncing balls that explode. Written by Sander van Grieken; 2002.
de: Zeichnet einen Rahmen mit dreidimensionalen abprallenden Bällen, die explodieren. Geschrieben von Sander van Grieken; 2002.

# @label:slider
source: Number of balls
de: Anzahl der Bälle

# @item:inrange Number of balls
source: Few
de: Wenige

# @item:inrange Number of balls
source: Lots
de: Viele

# @label:slider
source: Ball size
de: Ballgröße

# @item:inrange Ball size
source: Tiny
de: Sehr klein

# @item:inrange Ball size
source: Huge
de: Riesig

# @label:slider
source: Explosion force
de: Wucht der Explosionen

# @item:inrange Explosion force
source: Popcorn
de: Popkorn

# @item:inrange Explosion force
source: Nuke
de: Bombe

# @label:slider
source: Explosion decay
de: Explosionsverzögerung

# @item:inrange Explosion decay
source: Linger
de: Andauern

# @label:slider
source: Explosion momentum
de: Explosionsmoment

# @item:inrange Explosion momentum
source: None
de: Keins

# @item:inrange Explosion momentum
source: Full
de: Vollständig

# @info screen saver description
source: Packs the screen with growing squares or circles, colored according to a horizontal or vertical gradient, or according to the colors of a loaded image. The objects grow until they touch, then stop. When the screen is full, they shrink away and the process restarts. Written by Jamie Zawinski; 2005.
de: Füllt den Bildschirm mit wachsenden Vierecken oder Kreisen. Deren Farbe ist entweder ein horizontaler oder vertikaler Farbverlauf, oder die Farbe eines geladenen Bildes. Die Objekte wachsen so lange, bis sie einander berühren. Wenn der Bildschirm vollständig gefüllt ist, verkleinern sich die Objekte wieder und das Spektakel beginnt erneut. Geschrieben von Jamie Zawinski; 2005.

# @info screen saver description
source: Packs the screen with growing squares or circles, colored according to a horizontal or vertical gradient, or according to the colors of the desktop or a loaded image file. The objects grow until they touch, then stop. When the screen is full, they shrink away and the process restarts. Written by Jamie Zawinski; 2005.
de: Füllt den Bildschirm mit wachsenden Vierecken oder Kreisen. Deren Farbe ist entweder ein horizontaler oder vertikaler Farbverlauf, oder die Farbe des Bildschirmhintergrundes oder eine geladene Bilddatei. Die Objekte wachsen so lange, bis sie einander berühren. Wenn der Bildschirm vollständig gefüllt ist, verkleinern sich die Objekte wieder und das Spektakel beginnt erneut. Geschrieben von Jamie Zawinski; 2005.

# @label:spinbox
source: Boxes
de: Schachteln

# @label:spinbox
source: Grow by
de: Vergrößern um

# @label:spinbox
source: Spacing
de: Abstand

# @label:spinbox
source: Border
de: Rand

# @option:radio
source: Boxes or circles
de: Schachteln oder Kreise

# @option:radio
source: Boxes only
de: Nur Schachteln

# @option:radio
source: Circles only
de: Nur Kreise

# @option:radio
source: Color gradient
de: Farbverlauf

# @option:radio
source: Grab images
de: Bilder einfangen

# @option:check
source: Peek at underlying images
de: Vorschau der eingefangenen Bilder anzeigen

# @item screen saver name
source: Braid
de: Zopf

# @info screen saver description
source: Draws random color-cycling inter-braided concentric circles. Written by John Neil; 1997.
de: Zeichnet zufällige, die Farben wechselnde, ineinander versponnene konzentrische Kreise. Geschrieben von John Neil; 1997.

# @item:inrange Duration
source: Short
de: Kurz

# @item:inrange Duration
source: Long
de: Lang

# @label:spinbox
source: Number of rings
de: Anzahl der Ringe

# @label:spinbox
source: Line thickness
de: Liniendicke

# @info screen saver description
source: BSOD stands for "Blue Screen of Death". The finest in personal computer emulation, BSOD simulates popular screen savers from a number of less robust operating systems. http://en.wikipedia.org/wiki/Blue_Screen_of_Death http://en.wikipedia.org/wiki/Screen_of_death http://en.wikipedia.org/wiki/Guru_Meditation http://en.wikipedia.org/wiki/Row_of_Bombs http://en.wikipedia.org/wiki/Bomb_%28symbol%29 Written by Jamie Zawinski; 1998.
de: „BSOD“ steht für „Blue Screen of Death“. Dieser moderne PC-Emulator simuliert berühmte Bildschirmschoner von weniger stabilen Betriebssystemen ;) http://de.wikipedia.org/wiki/Blue_Screen_(Fehlermeldung) http://de.wikipedia.org/wiki/Red_Screen_of_Death http://de.wikipedia.org/wiki/Black_Screen_of_Death http://de.wikipedia.org/wiki/Guru_Meditation http://de.wikipedia.org/wiki/Bombe_(Fehlermeldung) Geschrieben 1998 von Jamie Zawinski.

# @info screen saver description
source: BSOD stands for "Blue Screen of Death". The finest in personal computer emulation, BSOD simulates popular screen savers from a number of less robust operating systems. Written by Jamie Zawinski; 1998.
de: „BSOD“ steht für „Blue Screen of Death“. Dieser moderne PC-Emulator simuliert berühmte Bildschirmschoner von weniger stabilen Betriebssystemen ;) Geschrieben 1998 von Jamie Zawinski.

# @item:inrange Duration
source: 5 seconds
de: 5 Sekunden

# @item:inrange Duration
source: 2 minutes
de: 2 Minuten

# @option:check
source: Sad Mac
de: Trauriger Mac

# @option:check
source: Mac bomb
de: Mac-Bombe

# @info screen saver description
source: Draws a stream of rising, undulating 3D bubbles, rising toward the top of the screen, with transparency and specular reflections. Written by Richard Jones; 1998.
de: Zeichnet einen Strom von aufsteigenden, gewellten Blasen, die zum oberen Bildschirmrand aufsteigen. Mit Transparenz und schönen Reflexionen. Geschrieben von Richard Jones; 1998.

# @option:check
source: Transparent bubbles
de: Transparente Blasen

# @label:textbox
source: Bubble color
de: Blasenfarbe

# @item screen saver name
source: Bubbles
de: Blasen

# @info screen saver description
source: This screen saver was removed from the XScreenSaver distribution as of version 5.08. This simulates the kind of bubble formation that happens when water boils: small bubbles appear, and as they get closer to each other, they combine to form larger bubbles, which eventually pop. Written by James Macnicol; 1996.
de: Dieser Bildschirmschoner ist in XScreenSaver ab Version 5.08 nicht mehr enthalten.Simuliert die Art von Blasenformation, die entsteht, wenn Wasser kocht: Kleine Blasen entstehen und wenn sie sich beim Wachsen berühren, verschmelzen sie zu größeren Blasen, die dann zerplatzen. Geschrieben von James Macnicol; 1996.

# @option:check
source: Draw circles instead of bubble images
de: Kreise anstatt Blasenbilder zeichnen

# @option:check
source: Don't hide bubbles when they pop
de: Blasen nicht ausblenden, wenn sie aufplatzen

# @option:check
source: Leave trails
de: Spuren hinterlassen

# @option:radio
source: Bubbles rise
de: Blasen steigen auf

# @option:radio
source: Bubbles float
de: Blasen fließen

# @option:radio
source: Bubbles fall
de: Blasen fallen

# @item screen saver name
source: Bumps
de: Beulen

# @info screen saver description
source: A spotlight roams across an embossed version of a loaded image. Written by Shane Smit; 1999.
de: Der Lichtkegel einer Taschenlampe erhellt eine eingravierte Darstellung eines geladenen Bildes. Geschrieben von Shane Smit; 1999.

# @info screen saver description
source: A spotlight roams across an embossed version of your desktop or other picture. Written by Shane Smit; 1999.
de: Der Lichtkegel einer Taschenlampe erhellt eine eingravierte Darstellung des Bildschirms oder eines wählbaren Bildes. Geschrieben von Shane Smit; 1999.

# @item screen saver name
source: Cage
de: Käfig

# @info screen saver description
source: This draws Escher's "Impossible Cage", a 3d analog of a moebius strip, and rotates it in three dimensions. http://en.wikipedia.org/wiki/Maurits_Cornelis_Escher Written by Marcelo Vianna; 1998.
de: Zeichnet Eschers „Unmöglichen Würfel“, eine dreidimensionale Analogie zum Möbius-Band, und rotiert ihn in drei Dimensionen (http://de.wikipedia.org/wiki/M._C._Escher). Geschrieben von Marcelo Vianna; 1998.

# @item screen saver name
source: Carousel
de: Karussell

# @info screen saver description
source: Loads several random images, and displays them flying in a circular formation. The formation changes speed and direction randomly, and images periodically drop out to be replaced by new ones. Written by Jamie Zawinski; 2005.
de: Lädt mehrere zufällige Bilder und zeigt sie in einer kreisförmigen Anordnung an. Die Geschwindigkeit und Richtung der Anordnung ändert sich zufällig. Außerdem fallen ab und zu einige Bilder aus der Anordnung heraus und werden von neuen ersetzt. Geschrieben von Jamie Zawinski; 2005.

# @label:slider
source: Animation speed
de: Bewegungsgeschwindigkeit

# @item:inrange Animation speed
source: Slow
de: Langsam

# @item:inrange Animation speed
source: Fast
de: Schnell

# @label:slider
source: Time until loading a new image
de: Zeit bis zum Laden eines neuen Bildes

# @item:inrange Time until loading a new image
source: 5 seconds
de: 5 Sekunden

# @label:spinbox
source: Number of images
de: Anzahl der Bilder

# @option:radio
source: Tilt in/out and left/right
de: Rein/raus und links/rechts kippen

# @option:radio
source: Tilt in/out only
de: Nur rein/raus kippen

# @option:radio
source: Tilt left/right only
de: Nur links/rechts kippen

# @option:radio
source: No tilting
de: Nicht kippen

# @option:check
source: Zoom in/out
de: Rein- und rauszoomen

# @option:check
source: Show file names
de: Dateinamen anzeigen

# @item screen saver name
source: CCurve
de: C-Kurve

# @info screen saver description
source: Generates self-similar linear fractals, including the classic "C Curve". http://en.wikipedia.org/wiki/Levy_C_curve Written by Rick Campbell; 1999.
de: Erzeugt selbst ähnliche lineare Fraktale einschließlich der klassischen „C-Kurve“ (http://en.wikipedia.org/wiki/Levy_C_curve). Geschrieben 1999 von Rick Campbell.

# @label:slider
source: Change image every
de: Bild wechseln alle

# @item:inrange Change image every
source: 0 seconds
de: 0 Sekunden

# @item:inrange Change image every
source: 30 seconds
de: 30 Sekunden

# @label:slider
source: Density
de: Dichte

# @item:inrange Density
source: Low
de: Niedrig

# @item:inrange Density
source: High
de: Hoch

# @item screen saver name
source: Celtic
de: Keltisch

# @info screen saver description
source: Repeatedly draws random Celtic cross-stitch patterns. http://en.wikipedia.org/wiki/Celtic_knot http://en.wikipedia.org/wiki/Knots_and_graphs Written by Max Froumentin; 2005.
de: Zeichnet zufällige keltische Kreuzstichmuster. http://en.wikipedia.org/wiki/Celtic_knot http://de.wikipedia.org/wiki/Knotentheorie Geschrieben von Max Froumentin; 2005.

# @info screen saver description
source: Repeatedly draws random Celtic cross-stitch patterns. http://en.wikipedia.org/wiki/Celtic_knot Written by Max Froumentin; 2005.
de: Zeichnet zufällige keltische Kreuzstichmuster (http://en.wikipedia.org/wiki/Celtic_knot). Geschrieben von Max Froumentin; 2005.

# @item:inrange Linger
source: Short
de: Kurz

# @item:inrange Linger
source: Long
de: Lang

# @option:check
source: Draw graph
de: Graphen zeichnen

# @item screen saver name
source: Circuit
de: Schaltkreis

# @info screen saver description
source: Animates a number of 3D electronic components. Written by Ben Buxton; 2001.
de: Animiert eine Reihe von dreidimensionalen elektronischen Komponenten. Geschrieben 2001 von Ben Buxton.

# @label:slider
source: Parts
de: Teile

# @item:inrange Parts
source: One
de: Eins

# @item:inrange Parts
source: Lots
de: Viele

# @label:slider
source: Rotation speed
de: Drehgeschwindigkeit

# @item:inrange Rotation speed
source: Slow
de: Langsam

# @item:inrange Rotation speed
source: Fast
de: Schnell

# @option:check
source: Spin
de: Um eigene Achse drehen

# @option:radio
source: Flat coloring
de: Ohne Beleuchtung

# @option:radio
source: Directional lighting
de: Gerichtete Beleuchtung

# @item screen saver name
source: CloudLife
de: Lebendige Wolken

# @info screen saver description
source: Generates cloud-like formations based on a variant of Conway's Life. The difference is that cells have a maximum age, after which they count as 3 for populating the next generation. This makes long-lived formations explode instead of just sitting there. http://en.wikipedia.org/wiki/Conway%27s_Game_of_Life Written by Don Marti; 2003.
de: Erzeugt Wolken-ähnliche Formationen, die auf einer Variante des „Conway's Life“. basieren Der Unterschied ist, dass Zellen ein maximales Alter haben, nach dem sie als 3 Zellen für die Bevölkerung der nächsten Generation stehen. Dadurch explodieren lange lebende Formationen und brennen nicht völlig regungslos ein Loch in Ihren Bildschirm. http://en.wikipedia.org/wiki/Conway%27s_Game_of_Life. Erstellt von Don Marti; 2003.

# @label:slider
source: Max age
de: Maximales Alter

# @item:inrange Max age
source: Young
de: Jung

# @item:inrange Max age
source: Old
de: Alt

# @label:slider
source: Initial density
de: Anfangsdichte

# @item:inrange Initial density
source: Low
de: Niedrig

# @item:inrange Initial density
source: High
de: Hoch

# @label:slider
source: Cell size
de: Zellgröße

# @item:inrange Cell size
source: Small
de: Klein

# @item:inrange Cell size
source: Large
de: Groß

# @info screen saver description
source: The symptoms most commonly produced by Enrichment Center testing are superstition, perceiving inanimate objects as alive, and hallucinations. The Enrichment Center reminds you that the weighted companion cube will never threaten to stab you and, in fact, cannot speak. In the event that the Weighted Companion Cube does speak, the Enrichment Center urges you to disregard its advice. http://en.wikipedia.org/wiki/Portal_%28video_game%29 Written by Jamie Zawinski; 2011.
de: Die Symptome von Anreicherungstestzentren sind Aberglaube, die Wahrnehmung unbelebter Gegenstände als lebendige und Halluzinationen. Das Anreicherungszentrum erinnert Sie daran, dass die beschwerten Begleiterwürfel Sie niemals mit einem Messer bedrohen würden und tatsächlich nicht sprechen können. In dem Fall, dass der Beschwerte Begleiterwürfel beginnt zu sprechen, empfiehlt das Anreicherungszentrum Ihnen dringend, seinen Anweisungen nicht Folge zu leisten. http://de.wikipedia.org/wiki/Portal_%28Computerspiel%29 Geschrieben von Jamie Zawinski; 2011.

# @label:slider
source: Bounce
de: Abprallen

# @item:inrange Bounce
source: Slow
de: Langsam

# @item:inrange Bounce
source: Fast
de: Schnell

# @label:slider
source: Number of cubes
de: Anzahl der Würfel

# @option:check
source: Wander
de: Umherwandern

# @item screen saver name
source: Compass
de: Kompass

# @info screen saver description
source: This draws a compass, with all elements spinning about randomly, for that "lost and nauseous" feeling. Written by Jamie Zawinski; 1999.
de: Zeichnet einen Kompass, auf dem alle Teile wild rotieren. Erzeugt ein „Vergessen und Verloren“-Gefühl. Geschrieben von Jamie Zawinski; 1999.

# @item screen saver name
source: Coral
de: Koralle

# @info screen saver description
source: Simulates coral growth, albeit somewhat slowly. Written by Frederick Roeber; 1997.
de: Simuliert ein Korallenwachstum, wenn auch etwas langsam. Geschrieben von Frederick Roeber; 1997.

# @item:inrange Linger
source: 1 second
de: 1 Sekunde

# @item:inrange Density
source: Sparse
de: Dünn

# @item:inrange Density
source: Dense
de: Dicht

# @label:slider
source: Seeds
de: Samen

# @item:inrange Seeds
source: Few
de: Wenige

# @item:inrange Seeds
source: Many
de: Viele

# @info screen saver description
source: Flies through height maps, optionally animating the creation and destruction of generated tiles; tiles `grow' into place. Written by Matus Telgarsky; 2005.
de: Fliegt über eine zufällige Gebirgslandschaft, dabei werden optional auch das Erstellen und Entfernen der generierten Teile animiert. Die einzelnen Teile „wachsen“ an Ort und Stelle. Geschrieben von Matus Telgarsky; 2005.

# @label:slider
source: Visibility
de: Sichtbarkeit

# @item:inrange Visibility
source: Mouse hole
de: Mauseloch

# @item:inrange Visibility
source: Eagle nest
de: Adlernest

# @label:slider
source: Subdivisions
de: Unterteilungen

# @item:inrange Subdivisions
source: Few
de: Wenige

# @item:inrange Subdivisions
source: Hurt me
de: Sehr viele

# @option:check
source: Flat shading
de: Flache Schattierungen

# @option:check
source: Water
de: Wasser

# @option:check
source: Confused
de: Verwirrt

# @option:check
source: Immediate
de: Sofort

# @option:radio
source: Random coloration
de: Zufällige Farben

# @option:radio
source: Earthy coloration
de: Erdartige Farben

# @option:radio
source: Icy coloration
de: Eisige Farben

# @option:radio
source: Swampy coloration
de: Sumpfartige Farben

# @option:radio
source: Vomitous coloration
de: Unnatürlich bunte Farben

# @item screen saver name
source: Critical
de: Kritisch

# @info screen saver description
source: This screen saver was removed from the XScreenSaver distribution as of version 5.08. Draws a system of self-organizing lines. It starts out as random squiggles, but after a few iterations, order begins to appear. Written by Martin Pool; 1999.
de: Dieser Bildschirmschoner ist in XScreenSaver ab Version 5.08 nicht mehr enthalten. Zeichnet ein System selbstorganisierender Linien. Startet als zufällige Schnörkel, aber nach ein paar Runden beginnt die Ordnung zu erscheinen. Geschrieben von Martin Pool; 1999.

# @item screen saver name
source: Crystal
de: Kristall

# @info screen saver description
source: Moving polygons, similar to a kaleidoscope. See also the "Kaleidescope" and "GLeidescope" screen savers. http://en.wikipedia.org/wiki/Kaleidoscope Written by Jouk Jansen; 1998.
de: Bewegende Polygone, ähnlich wie ein Kaleidoskop. Beachten Sie auch die Bildschirmschoner „Kaleidoskop“ und „Kaleidoskop (GL)“ (http://de.wikipedia.org/wiki/Kaleidoskop). Geschrieben von Jouk Jansen; 1998.

# @label:spinbox
source: Number of crystals
de: Anzahl der Kristalle

# @label:spinbox
source: Horizontal symmetries
de: Horizontale Symmetrien

# @label:spinbox
source: Vertical symmetries
de: Vertikale Symmetrien

# @option:check
source: Draw grid
de: Gitter anzeigen

# @option:check
source: Draw cell
de: Zellen anzeigen

# @option:check
source: Center on screen
de: Mittig auf dem Bildschirm

# @info screen saver description
source: Animates a Rubik-like puzzle known as Cube 21 or Square-1. The rotations are chosen randomly. See also the "Rubik", "RubikBlocks" and "GLSnake" screen savers. http://en.wikipedia.org/wiki/Square_One_%28puzzle%29 Written by Vasek Potocek; 2005.
de: Animiert ein Puzzle namens „Cube 21“ oder „Back to Square One“, das dem Zauberwürfel ähnelt. Die Drehungen werden zufällig gewählt. Siehe auch die Bildschirmschoner „Rubiks Würfel“, „RubikBlocks“ und „GL-Schlange“. (http://de.wikipedia.org/wiki/Back_to_Square_One) Geschrieben von Vasek Potocek; 2005.

# @label:slider
source: Cube size
de: Würfelgröße

# @item:inrange Cube size
source: Small
de: Klein

# @item:inrange Cube size
source: Large
de: Groß

# @label:slider
source: Rotation
de: Drehung

# @item:inrange Rotation
source: Slow
de: Langsam

# @item:inrange Rotation
source: Fast
de: Schnell

# @option:radio
source: Start as cube
de: Mit Würfel beginnen

# @option:radio
source: Start as random shape
de: Mit zufälligem Quader beginnen

# @option:radio
source: White
de: Weiß

# @option:radio
source: Random color
de: Zufällige Farbe

# @option:radio
source: Silver edition
de: Silber-Ausgabe

# @option:radio
source: Two random colors
de: Zwei zufällige Farben

# @option:radio
source: Classic edition
de: Lehm

# @option:radio
source: Six random colors
de: Sechs zufällige Farben

# @label:slider
source: Spin
de: Um eigene Achse drehen

# @item:inrange Spin
source: Slow
de: Langsam

# @item:inrange Spin
source: Fast
de: Schnell

# @label:slider
source: Wander
de: Umherwandern

# @item:inrange Wander
source: Slow
de: Langsam

# @item:inrange Wander
source: Fast
de: Schnell

# @option:check
source: Outlines
de: Umrisse

# @item screen saver name
source: Cubenetic
de: Würfelnetik

# @info screen saver description
source: Draws a pulsating set of overlapping boxes with ever-chaning blobby patterns undulating across their surfaces. It's sort of a cubist Lavalite. Written by Jamie Zawinski; 2002.
de: Zeichnet eine pulsierende Menge von überlappenden Schachteln mit dauernd wechselnden Mustern, die sich wellenförmig über die Oberfläche ausbreiten. Eine Art kubistische Lavalampe. Geschrieben von Jamie Zawinski; 2002.

# @label:slider
source: Boxes
de: Schachteln

# @item:inrange Boxes
source: Few
de: Wenige

# @item:inrange Boxes
source: Many
de: Viele

# @option:radio
source: Don't rotate
de: Nicht drehen

# @option:radio
source: Rotate around X axis
de: Um die X-Achse drehen

# @option:radio
source: Rotate around Y axis
de: Um die Y-Achse drehen

# @option:radio
source: Rotate around Z axis
de: Um die Z-Achse drehen

# @option:radio
source: Rotate around X and Y axes
de: Um die X- und Y-Achse drehen

# @option:radio
source: Rotate around X and Z axes
de: Um die X- und Z-Achse drehen

# @option:radio
source: Rotate around Y and Z axes
de: Um die Y- und Z-Achse drehen
