Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/kdeartwork/kxsconfig.po
Languages: de

# @option:radio
source: Rotate around all three axes
de: Um alle drei Achsen drehen

# @label:slider
source: Surface pattern speed
de: Geschwindigkeit des Oberflächenmusters

# @item:inrange Surface pattern speed
source: Slow
de: Langsam

# @item:inrange Surface pattern speed
source: Fast
de: Schnell

# @label:slider
source: Surface pattern overlap
de: Überlappung des Oberflächenmusters

# @item:inrange Surface pattern overlap
source: Small
de: Klein

# @item:inrange Surface pattern overlap
source: Large
de: Groß

# @label:slider
source: Surface pattern complexity
de: Komplexität des Oberflächenmusters

# @item:inrange Surface pattern complexity
source: Low
de: Niedrig

# @item:inrange Surface pattern complexity
source: High
de: Hoch

# @item screen saver name
source: CubeStorm
de: Würfelsturm

# @info screen saver description
source: Draws a series of rotating 3D boxes that intersect each other and eventually fill space. Written by Jamie Zawinski; 2003.
de: Zeichnet eine Reihe von rotierenden 3D-Boxen, die sich gegenseitig schneiden und den Bildschirm füllen. Geschrieben von Jamie Zawinski; 2003.

# @label:slider
source: Cubes
de: Würfel

# @item:inrange Cubes
source: Few
de: Wenige

# @item:inrange Cubes
source: Many
de: Viele

# @label:slider
source: Struts
de: Gestänge

# @item:inrange Struts
source: Thin
de: Dünn

# @item:inrange Struts
source: Thick
de: Dick

# @item screen saver name
source: CubicGrid
de: Würfelgitter

# @info screen saver description
source: Draws the view of an observer located inside a rotating 3D lattice of colored points. Written by Vasek Potocek; 2007.
de: Zeichen die Sicht eines Beobachters innerhalb eines sich drehenden dreidimensionalen Gitters aus farbigen Punkten. Geschrieben 2007 von Vasek Potocek.

# @label:slider
source: Dot spacing
de: Abstand der Punkte

# @item:inrange Dot spacing
source: Close
de: Nah

# @item:inrange Dot spacing
source: Far
de: Weit

# @option:check
source: Big dots
de: Große Punkte

# @item screen saver name
source: CWaves
de: C-Wellen

# @info screen saver description
source: This generates a languidly-scrolling vertical field of sinusoidal colors. Written by Jamie Zawinski; 2007.
de: Zeichnet träge rollende vertikale Felder aus sinusförmig verlaufenden Farben. Geschrieben von Jamie Zawinski; 2007.

# @label:slider
source: Complexity
de: Komplexität

# @item:inrange Complexity
source: Low
de: Gering

# @item:inrange Complexity
source: High
de: Hoch

# @label:slider
source: Color transitions
de: Farbübergänge

# @item:inrange Color transitions
source: Rough
de: Grob

# @item:inrange Color transitions
source: Smooth
de: Weich

# @item screen saver name
source: Cynosure
de: Anziehungspunkt

# @info screen saver description
source: Random dropshadowed rectangles pop onto the screen in lockstep. Written by Ozymandias G. Desiderata, Jamie Zawinski, and Stephen Linhart; 1998.
de: Zufällige fallende Schatten von Rechtecken, die im Gleichschritt auf dem Bildschirm auftauchen. Geschrieben 1998 von Ozymandias G. Desiderata, Jamie Zawinski, und Stephen Linhart.

# @item screen saver name
source: DangerBall
de: Gefährlicher Ball

# @info screen saver description
source: Draws a ball that periodically extrudes many random spikes. Ouch! Written by Jamie Zawinski; 2001.
de: Zeichnet einen Ball, der regelmäßig Stacheln ausstößt. Geschrieben von Jamie Zawinski; 2001.

# @label:slider
source: Spike growth
de: Wachstum der Stacheln

# @item:inrange Spike growth
source: Slow
de: Langsam

# @item:inrange Spike growth
source: Fast
de: Schnell

# @label:slider
source: Number of spikes
de: Anzahl der Stacheln

# @item:inrange Number of spikes
source: Few
de: Wenige

# @item:inrange Number of spikes
source: Ouch
de: Sehr viele

# @item screen saver name
source: DecayScreen
de: Bildschirmzerfall

# @info screen saver description
source: This takes an image and makes it melt, toward a randomly chosen point or direction. Warning, if the effect continues after the screen saver is off, seek medical attention. Written by David Wald, Vivek Khera, Jamie Zawinski, and Vince Levey; 1993.
de: Nimmt ein Bild und lässt es zu einem Punkt oder in eine Richtung schmelzen. Warnung: Falls der Effekt selbst nach dem Ausschalten des Bildschirmschoners andauert, sollten Sie einen Arzt aufsuchen. Geschrieben von David Wald, Vivek Khera, Jamie Zawinski und Vince Levey; 1993.

# @info screen saver description
source: This takes an image and makes it melt. You've no doubt seen this effect before, but no screensaver would really be complete without it. It works best if there's something colorful visible. Warning, if the effect continues after the screen saver is off, seek medical attention. Written by David Wald, Vivek Khera, Jamie Zawinski, and Vince Levey; 1993.
de: Nimmt ein Bild und lässt es schmelzen. Sie haben diesen Effekt sicherlich bereits gesehen, jedoch wäre kein Bildschirmschoner ohne diesen Effekt wirklich vollständig. Der Effekt sieht am besten aus, wenn Sie eine bunte Vorlage benutzen. Warnung: Falls der Effekt selbst nach dem Ausschalten des Bildschirmschoners andauert, sollten Sie einen Arzt aufsuchen. Geschrieben von David Wald, Vivek Khera, Jamie Zawinski und Vince Levey; 1993.

# @option:radio
source: Random melt style
de: Zufällige Schmelzart

# @option:radio
source: Shuffle melt
de: Mischendes Schmelzen

# @option:radio
source: Melt up
de: Nach oben schmelzen

# @option:radio
source: Melt down
de: Nach unten schmelzen

# @option:radio
source: Melt left
de: Nach links schmelzen

# @option:radio
source: Melt right
de: Nach rechts schmelzen

# @option:radio
source: Melt up, left
de: Nach oben links schmelzen

# @option:radio
source: Melt up, right
de: Nach oben rechts schmelzen

# @option:radio
source: Melt down, left
de: Nach unten links schmelzen

# @option:radio
source: Melt down, right
de: Nach unten rechts schmelzen

# @option:radio
source: Melt towards center
de: In die Mitte hinein schmelzen

# @option:radio
source: Melt away from center
de: Aus der Mitte heraus schmelzen

# @option:radio
source: Melty melt
de: Schmelzendes Schmelzen

# @option:radio
source: Stretchy melt
de: Auseinanderziehendes Schmelzen

# @option:radio
source: Fuzzy melt
de: Unscharfes Schmelzen

# @item screen saver name
source: Deco
de: Art Deco

# @info screen saver description
source: Subdivides and colors rectangles randomly, for a Mondrian-esque effect. http://en.wikipedia.org/wiki/Piet_Mondrian#Paris_1919.E2.80.931938 Written by Jamie Zawinski and Michael Bayne; 1997.
de: Unterteilt und färbt Rechtecke zufällig wie in einem Mondrian-Effekt. Siehe auch: http://de.wikipedia.org/wiki/Piet_Mondrian#R.C3.BCckkehr_nach_Paris Geschrieben von Jamie Zawinski und Michael Bayne; 1997.

# @info screen saver description
source: Subdivides and colors rectangles randomly. It looks kind of like Brady-Bunch-era rec-room wall paneling. http://en.wikipedia.org/wiki/Piet_Mondrian#Paris_1919.E2.80.931938 Written by Jamie Zawinski and Michael Bayne; 1997.
de: Unterteilt und färbt Rechtecke zufällig. Sieht aus wie eine Wandvertäfelung aus der Zeit von „Drei Mädchen und drei Jungen“. Siehe auch: http://de.wikipedia.org/wiki/Piet_Mondrian#R.C3.BCckkehr_nach_Paris Geschrieben von Jamie Zawinski und Michael Bayne; 1997.

# @item:inrange Duration
source: 1 second
de: 1 Sekunde

# @label:spinbox
source: Minimum width
de: Minimale Breite

# @label:spinbox
source: Minimum height
de: Minimale Höhe

# @label:spinbox
source: Maximum depth
de: Maximale Tiefe

# @option:check
source: Smooth colors
de: Weiche Farben

# @option:check
source: Golden ratio
de: Goldener Schnitt

# @item screen saver name
source: Deluxe
de: Luxuriös

# @info screen saver description
source: Draws a pulsing sequence of transparent stars, circles, and lines. Written by Jamie Zawinski; 1999.
de: Zeichnet eine pulsierende Sequenz von transparenten Sternen, Kreisen und Linien. Geschrieben von Jamie Zawinski; 1999.

# @label:slider
source: Lines
de: Linien

# @item:inrange Lines
source: Thin
de: Dünn

# @item:inrange Lines
source: Thick
de: Dick

# @label:slider
source: Shapes
de: Formen

# @option:check
source: Transparency
de: Transparenz

# @item screen saver name
source: Demon
de: Dämon

# @info screen saver description
source: A cellular automaton that starts with a random field, and organizes it into stripes and spirals. http://en.wikipedia.org/wiki/Maxwell%27s_demon Written by David Bagley; 1999.
de: Ein zellulärer Automat, der mit einem zufälligen Feld startet und es in Streifen und Spiralen organisiert (http://de.wikipedia.org/wiki/Maxwellscher_Dämon). Geschrieben von David Bagley; 1999.

# @label:slider
source: States
de: Zustände

# @label:spinbox
source: Cell size
de: Zellgröße

# @item screen saver name
source: Discrete
de: Diskret

# @info screen saver description
source: Discrete map fractal systems, including variants of Hopalong, Julia, and others. Written by Tim Auckland; 1998.
de: Zeichnet eine diskrete Karte mit fraktalen Systemen, u. a. mit den Varianten Hopalong und Julia. Geschrieben 1998 von Tim Auckland.

# @info screen saver description
source: More "discrete map" systems, including new variants of Hopalong and Julia, and a few others. See also the "Hopalong" and "Julia" screen savers. Written by Tim Auckland; 1998.
de: Zeichnet eine diskrete fraktale Karte, u. a. mit den Varianten Hopalong und Julia. Siehe auch die Bildschirmschoner „Hopalong“ und „Julia“. Geschrieben 1998 von Tim Auckland.

# @item screen saver name
source: Distort
de: Bildstörung

# @info screen saver description
source: Wandering lenses distort the screen image in various ways. Written by Jonas Munsin; 1998.
de: Eine Linse bewegt sich über den Bildschirm und verzerrt das Bild auf verschiedene Arten. Geschrieben 1998 von Jonas Munsin

# @info screen saver description
source: Grabs an image of the screen, and then lets a transparent lens wander around the screen, magnifying whatever is underneath. Written by Jonas Munsin; 1998.
de: Fängt den Bildschirm ein und lässt transparente Linsen darauf wandern, die alles unter sich vergrößern. Geschrieben von Jonas Munsin; 1998.

# @label:slider
source: Lens size
de: Größe der Linsen

# @item:inrange Lens size
source: Small
de: Klein

# @item:inrange Lens size
source: Large
de: Groß

# @label:spinbox
source: Lens count
de: Anzahl der Linsen

# @option:radio
source: Swamp thing
de: Sumpfmonster (Fußstapfen)

# @option:radio
source: Bounce
de: Abprallen

# @option:check
source: Reflect
de: Spiegeln

# @option:check
source: Magnify
de: Vergrößern

# @option:check
source: Black hole
de: Schwarzes Loch

# @option:check
source: Vortex
de: Wirbel

# @info screen saver description
source: DNA Lounge Restaurant -- Bar -- Nightclub -- Cafe -- Est. 1985. 375 Eleventh Street San Francisco, CA 94103 http://www.dnalounge.com/ http://www.dnapizza.com/ Written by Jamie Zawinski; 2001.
de: „DNA Lounge“ Restaurant -- Bar -- Nachtclub -- Cafe -- Eröffnet 1985. 375 Eleventh Street San Francisco, CA 94103 (http://www.dnalounge.com/). Geschrieben von Jamie Zawinski; 2001.

# @label:slider
source: Frame Rate
de: Bildwiederholrate

# @item:inrange Frame Rate
source: Low
de: Niedrig

# @item:inrange Frame Rate
source: High
de: Hoch

# @option:radio
source: DNA Lounge and DNA Pizza logos
de: „DNA Lounge“- und „DNA Pizza“-Logos

# @item screen saver name
source: Drift
de: Gestöber

# @info screen saver description
source: Drifting recursive fractal cosmic flames. Written by Scott Draves; 1997.
de: Rekursiv treibende fraktale kosmische Flammen. Geschrieben von Scott Draves; 1997.

# @item screen saver name
source: Endgame
de: Schach

# @info screen saver description
source: Black slips out of three mating nets, but the fourth one holds him tight! A brilliant composition! See also the "Queens" screen saver. http://en.wikipedia.org/wiki/Chess_endgame Written by Blair Tennessy; 2002.
de: Schwarz entkommt dreimal der Bedrohung durch Schachmatt, wird beim vierten Mal aber geschlagen. Eine brillante Komposition. Siehe auch Bildschirmschoner „Damen“. http://de.wikipedia.org/wiki/Endspiel_(Schach) Geschrieben 2002 von Blair Tennessy

# @option:check
source: Low resolution chess pieces
de: Spielfiguren in niedriger Auflösung

# @item screen saver name
source: Engine
de: Motor

# @info screen saver description
source: Draws a simple model of an engine that floats around the screen. http://en.wikipedia.org/wiki/Internal_combustion_engine#Operation Written by Ben Buxton and Ed Beroset; 2001.
de: Zeichnet ein einfaches Modell eines Motors, das auf dem Bildschirm schwebt (http://de.wikipedia.org/wiki/Verbrennungsmotor). Geschrieben von Ben Buxton und Ed Beroset; 2001.

# @option:radio
source: Random engine
de: Zufälliger Motor

# @option:radio
source: Honda Insight (3 cylinders)
de: Honda Insight (3 Zylinder)

# @option:radio
source: BMW M3 (4 cylinders)
de: BMW M3 (4 Zylinder)

# @option:radio
source: VW Beetle (4 cylinders, flat)
de: VW Beetle (4 Zylinder, flach)

# @option:radio
source: Audi Quattro (5 cylinders)
de: Audi Quattro (5 Zylinder)

# @option:radio
source: BMW M5 (6 cylinders)
de: BMW M5 (6 Zylinder)

# @option:radio
source: Subaru XT (6 cylinders, V)
de: Subaru XT (6 Zylinder, V)

# @option:radio
source: Porsche 911 (6 cylinders, flat)
de: Porsche 911 (6 Zylinder, flach)

# @option:radio
source: Corvette Z06 (8 cylinders, V)
de: Corvette Z06 (8 Zylinder, V)

# @option:radio
source: Dodge Viper (10 cylinders, V)
de: Dodge Viper (10 Zylinder, V)

# @option:radio
source: Jaguar XKE (12 cylinders, V)
de: Jaguar XKE (12 Zylinder, V)

# @option:check
source: Show engine name
de: Namen des Motors anzeigen

# @item screen saver name
source: Epicycle
de: Epizykel

# @info screen saver description
source: This draws the path traced out by a point on the edge of a circle. That circle rotates around a point on the rim of another circle, and so on, several times. These were the basis for the pre-heliocentric model of planetary motion. http://en.wikipedia.org/wiki/Deferent_and_epicycle Written by James Youngman; 1998.
de: Zeichnet den Weg, der durch einen Punkt auf einem Kreis gezeichnet wird. Dieser Kreis selbst rotiert um einen Punkt auf einem anderen Kreis. Setzt sich über mehrere Schritte hinweg weiter. Dieses Modell wurde zur Beschreibung der Planetenbahnen vor dem heliozentrischen Modell benutzt (http://de.wikipedia.org/wiki/Deferent). Geschrieben von James Youngman; 1998.

# @item:inrange Linger
source: 30 seconds
de: 30 Sekunden

# @label:spinbox
source: Harmonics
de: Harmonien

# @info screen saver description
source: Exploding fireworks. See also the "Fireworkx", "XFlame" and "Pyro" screen savers. Written by W.P. van Paassen; 2003.
de: Explodierendes Feuerwerk. Siehe auch die Bildschirmschoner „Feuerwerk“, „Flamme“ und „Pyro“. Geschrieben von W.P. van Paassen, 2003.

# @item:inrange Number of colors
source: Few
de: Wenige

# @label:slider
source: Number of particles
de: Anzahl der Teilchen

# @item:inrange Number of particles
source: Little
de: Wenig

# @item:inrange Number of particles
source: Many
de: Viele

# @label:slider
source: Cooling factor
de: Abkühlen

# @item:inrange Cooling factor
source: Slow
de: Langsam

# @item:inrange Cooling factor
source: Fast
de: Schnell

# @label:slider
source: Heat
de: Hitze

# @item:inrange Heat
source: Pleasant
de: Angenehm

# @label:slider
source: Gravity
de: Schwerkraft

# @item:inrange Gravity
source: Negative
de: Negativ

# @item:inrange Gravity
source: Positive
de: Positiv

# @info screen saver description
source: Simulates two dimensional incompressible inviscid fluid flow. http://en.wikipedia.org/wiki/Euler_equations_%28fluid_dynamics%29 http://en.wikipedia.org/wiki/Inviscid_flow Written by Stephen Montgomery-Smith; 2002.
de: Simuliert zweidimensional die Bewegung einer nicht komprimierbaren, dickflüssigen Flüssigkeit (http://en.wikipedia.org/wiki/Euler_equations_(fluid_dynamics)) (http://en.wikipedia.org/wiki/Inviscid_flow). Geschrieben von Stephen Montgomery-Smith; 2002.

# @label:slider
source: Particles
de: Teilchen

# @item:inrange Particles
source: Few
de: Wenige

# @item:inrange Particles
source: Many
de: Viele

# @item screen saver name
source: Extrusion
de: Spritzgeformtes

# @info screen saver description
source: Draws various rotating extruded shapes that twist around, lengthen, and turn inside out. Written by Linas Vepstas, David Konerding, and Jamie Zawinski; 1999.
de: Zeichnet verschiedene rotierende, gespritzte Formen, die sich drehen, strecken und ihr Inneres nach Außen stülpen. Geschrieben 1999 von Linas Vepstas, David Konerding und Jamie Zawinski

# @option:radio
source: Random object
de: Zufälliges Objekt

# @option:radio
source: Join offset
de: Gemeinsamer Versatz

# @option:radio
source: Screw
de: Schraube

# @option:radio
source: Taper
de: Kegel

# @option:radio
source: Use flat coloring
de: Ohne Beleuchtung

# @option:radio
source: Use lighting
de: Mit Beleuchtung

# @item screen saver name
source: FadePlot
de: Schattenhafte Zeichnung

# @info screen saver description
source: Draws what looks like a waving ribbon following a sinusoidal path. Written by Bas van Gaalen and Charles Vidal; 1997.
de: Sieht aus wie ein schwenkendes Band, das einem sinusförmigen Weg folgt. Geschrieben von Bas van Gaalen und Charles Vidal; 1997.

# @label:slider
source: Cycles
de: Zyklen

# @item:inrange Cycles
source: Small
de: Klein

# @item:inrange Cycles
source: Large
de: Groß

# @item screen saver name
source: Fiberlamp
de: Glasfaser-Lampe

# @info screen saver description
source: Draws a groovy rotating fiber optic lamp. Written by Tim Auckland; 2005.
de: Zeichnet eine sich schick rotierende Glasfaserlampe. Geschrieben von Tim Auckland; 2005.

# @label:slider
source: Fibers
de: Fasern

# @item:inrange Fibers
source: Few
de: Wenige

# @item:inrange Fibers
source: Many
de: Viele

# @label:slider
source: Time between knocks
de: Zeit zwischen Stößen

# @item:inrange Time between knocks
source: Short
de: Kurz

# @item:inrange Time between knocks
source: Long
de: Lang

# @item screen saver name
source: Fireworkx
de: Feuerwerk

# @info screen saver description
source: Exploding fireworks. See also the "Eruption", "XFlame" and "Pyro" screen savers. Written by Rony B Chandran; 2004.
de: Explodierendes Feuerwerk. Siehe auch die Bildschirmschoner „Eruption“, „Flamme“ und „Pyro“. Geschrieben von Rony B Chandran, 2004.

# @label:slider
source: Activity
de: Aktivität

# @item:inrange Activity
source: Dense
de: Dicht

# @item:inrange Activity
source: Sparse
de: Dünn

# @option:check
source: Light flash
de: Lichtblitz

# @option:check
source: Shells upward
de: Granaten nach oben

# @option:check
source: Glowing smoke
de: Glühender Rauch

# @item screen saver name
source: Flag
de: Flagge

# @info screen saver description
source: This screen saver was removed from the XScreenSaver distribution as of version 5.08. This draws a waving colored flag, that undulates its way around the screen. The flag can contain arbitrary text and images. By default, it displays either the current system name and OS type, or a picture of "Bob". Written by Charles Vidal and Jamie Zawinski; 1997.
de: Dieser Bildschirmschoner ist in XScreenSaver ab Version 5.08 nicht mehr enthalten. Zeichnet eine geschwenkte, farbige Flagge, die über den Bildschirm wandert. Die Flagge kann auch aus einem beliebigen Text oder einem Bild bestehen. Als Standard wird der Computername und die Betriebssystembezeichnung oder ein Bild von „Bob“ gezeigt. Geschrieben von Charles Vidal und Jamie Zawinski; 1997.

# @label:textbox
source: Text for flag
de: Text als Flagge

# @item screen saver name
source: Flame
de: Flamme

# @info screen saver description
source: Iterative fractals. Written by Scott Draves; 1993.
de: Iterative Fraktale. Geschrieben 1993 von Scott Draves.

# @item:inrange Linger
source: 10 seconds
de: 10 Sekunden

# @label:slider
source: Number of fractals
de: Anzahl der Fraktale

# @item:inrange Number of fractals
source: Few
de: Wenige

# @item:inrange Number of fractals
source: Many
de: Viele

# @item screen saver name
source: FlipFlop
de: Kacheln umklappen

# @info screen saver description
source: Draws a grid of 3D colored tiles that change positions with each other. Written by Kevin Ogden and Sergio Gutierrez; 2003.
de: Zeichnet ein dreidimensionale Gitter von farbigen Kacheln, die mit anderen die Position tauschen. Geschrieben 2003 von Kevin Ogden und Sergio Gutierrez.

# @item:inrange Spin
source: Stopped
de: Angehalten

# @item:inrange Spin
source: Whirlwind
de: Wirbelwind

# @option:radio
source: Draw Tiles
de: Kacheln zeigen

# @option:radio
source: Draw Sticks
de: Stäbe zeichnen

# @label:spinbox
source: Width
de: Breite

# @label:spinbox
source: Depth
de: Tiefe

# @option:check
source: Load image
de: Bild laden

# @item screen saver name
source: FlipScreen3D
de: Bildschirm drehen (dreidimensional)

# @info screen saver description
source: Spins and deforms an image. Written by Ben Buxton and Jamie Zawinski; 2001.
de: Dreht und verformt ein Bild. Geschrieben von Ben Buxton und Jamie Zawinski; 2001.

# @info screen saver description
source: Grabs an image of the desktop and spins and deforms it in 3D. Written by Ben Buxton and Jamie Zawinski; 2001.
de: Nimmt das Bild des Arbeitsplatzes und dreht und verformt es in 3D. Geschrieben von Ben Buxton und Jamie Zawinski; 2001.

# @info screen saver description
source: Grabs an image of the desktop, turns it into a GL texture map, and spins it around and deforms it in various ways. Written by Ben Buxton and Jamie Zawinski; 2001.
de: Nimmt das Bild des Arbeitsplatzes und wandelt es in eine dreidimensionale Textur um, die gedreht und verformt wird. Geschrieben von Ben Buxton und Jamie Zawinski; 2001.

# @option:check
source: Rotate
de: Drehen

# @info screen saver description
source: Draws successive pages of text. The lines flip in and out in a soothing 3D pattern. Written by Jamie Zawinski; 2005.
de: Zeichnet fortlaufend Textseiten. Die Zeilen werden in einem sanften dreidimensionalen Muster ein- und ausgeblendet. Geschrieben von Jamie Zawinski; 2005.

# @option:radio
source: Random text alignment
de: Zufällige Textausrichtung

# @option:radio
source: Flush left text
de: Text links ausrichten

# @option:radio
source: Centered text
de: Zentrierter Text

# @option:radio
source: Flush right text
de: Text rechts ausrichten

# @label:spinbox
source: Font point size
de: Schriftgröße

# @label:spinbox
source: Text columns
de: Textspalten

# @label:spinbox
source: Text lines
de: Textzeilen

# @item screen saver name
source: Flow
de: Fließen

# @info screen saver description
source: Strange attractors formed of flows in a 3D differential equation phase space. Features the popular attractors described by Lorentz, Roessler, Birkhoff and Duffing, and can discover entirely new attractors by itself. http://en.wikipedia.org/wiki/Attractor#Strange_attractor Written by Tim Auckland; 1998.
de: Seltsame Attraktoren bestehend aus Strömungen in einem 3D-Raum aus Differentialgleichungen. Bietet die berühmten Attraktoren von Lorentz, Roessler, Birkhoff und Duffing dar und erstellt selbst vollkommen neue Attraktoren. http://de.wikipedia.org/wiki/Attraktor Geschrieben von Tim Auckland; 1998.

# @label:slider
source: Count
de: Anzahl

# @item:inrange Count
source: Few
de: Wenige

# @item:inrange Count
source: Many
de: Viele

# @label:slider
source: Length of trails
de: Schweiflängen

# @item:inrange Length of trails
source: Short
de: Kurz

# @item:inrange Length of trails
source: Long
de: Lang

# @option:check
source: Rotating around attractor
de: Rotierender Attraktor

# @option:check
source: Ride in the flow
de: Mit dem Fluss schwimmen

# @option:check
source: Draw bounding box
de: Umfassenden Rahmen zeichnen

# @option:check
source: Periodic attractors
de: Periodischer Attraktor
