Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/kdeartwork/kxsconfig.po
Languages: de

# @option:check
source: Search for new attractors
de: Nach neuen Attraktoren suchen

# @item screen saver name
source: FluidBalls
de: Bälle in Flüssigkeit

# @info screen saver description
source: Models the physics of bouncing balls, or of particles in a gas or fluid, depending on the settings. If "Shake Box" is selected, then every now and then, the box will be rotated, changing which direction is down (in order to keep the settled balls in motion.) Written by Peter Birtles and Jamie Zawinski; 2002.
de: Modelliert die Physik abprallender Bälle oder Teilchen in Gas oder Flüssigkeit (abhängig von den Einstellungen). Wenn „Schachtel schütteln“ aktiviert ist, wird die Schachtel ab und zu gedreht, wodurch sich „unten“ ändert. Dadurch werden ruhige Bälle in Bewegung versetzt. Geschrieben von Peter Birtles und Jamie Zawinski; 2002.

# @item:inrange Number of balls
source: Many
de: Viele

# @item:inrange Ball size
source: Small
de: Klein

# @item:inrange Ball size
source: Large
de: Groß

# @item:inrange Gravity
source: Freefall
de: Freier Fall

# @item:inrange Wind
source: Still
de: Ruhig

# @item:inrange Wind
source: Hurricane
de: Hurrikan

# @label:slider
source: Friction
de: Reibung

# @item:inrange Friction
source: Clay
de: Lehm

# @item:inrange Friction
source: Rubber
de: Gummi

# @option:check
source: Various ball sizes
de: Unterschiedliche Ballgrößen

# @option:check
source: Shake box
de: Schachtel schütteln

# @item screen saver name
source: Flurry
de: Gestöber

# @info screen saver description
source: This X11 port of the OSX screensaver of the same name draws a colourful star(fish)like flurry of particles. Original Mac version: http://homepage.mac.com/calumr Written by Calum Robinson and Tobias Sargeant; 2002.
de: Diese Portierung zu X11 des OSX-Bildschirmschoners mit dem gleichen Namen zeichnet vielfarbige Sterne wie Partikelgestöber. Ursprüngliche Mac-Version: http://homepage.mac.com/calumr. Geschrieben 2002 von Calum Robinson und Tobias Sargeant.

# @option:radio
source: Classic
de: Klassisch

# @option:radio
source: Fire
de: Feuer

# @option:radio
source: Water
de: Wasser

# @option:radio
source: Binary
de: Binär

# @option:radio
source: Psychedelic
de: Psychedelisch

# @option:radio
source: Insane
de: Verrückt

# @option:radio
source: Random
de: Zufällig

# @item screen saver name
source: FlyingToasters
de: Fliegende Toaster

# @info screen saver description
source: A fleet of 3d space-age jet-powered flying toasters (and toast!) Inspired by the ancient Berkeley Systems After Dark flying toasters. http://en.wikipedia.org/wiki/After_Dark_%28software%29#Flying_Toasters Written by Jamie Zawinski and Devon Dossett; 2003.
de: Eine Flotte von raketengetriebenen 3D-Toastern (und Toast!) im Weltraum. Inspiriert von den klassischen fliegenden Toastern aus After Dark von Berkeley Systems. Siehe auch http://de.wikipedia.org/wiki/After_Dark . Geschrieben von Jamie Zawinski und Devon Dossett; 2003.

# @label:slider
source: Air speed
de: Fluggeschwindigkeit

# @item:inrange Air speed
source: Slow
de: Langsam

# @item:inrange Air speed
source: Fast
de: Schnell

# @label:slider
source: Number of toasters
de: Anzahl der Toaster

# @item:inrange Number of toasters
source: None
de: Keine

# @item:inrange Number of toasters
source: Swarm
de: Schwarm

# @label:slider
source: Number of slices
de: Anzahl der Brotscheiben

# @item:inrange Number of slices
source: None
de: Keine

# @item:inrange Number of slices
source: Swarm
de: Schwarm

# @option:check
source: Chrome
de: Chrom

# @item screen saver name
source: FontGlide
de: Gleitende Schriften

# @info screen saver description
source: Puts text on the screen using large characters that glide in from the edges, assemble, then disperse. Alternately, it can simply scroll whole sentences from right to left. Written by Jamie Zawinski; 2003.
de: Schreibt Text mit großen Zeichen auf den Bildschirm, die von den Kanten in die Mitte gleiten, sich versammeln und wieder auseinander streben. Alternativ können ganze Sätze von rechts nach links wandern. Geschrieben 2003 von Jamie Zawinski.

# @label:slider
source: Page linger
de: Anzeigedauer

# @item:inrange Page linger
source: Brief
de: Kurz

# @item:inrange Page linger
source: Long
de: Lang

# @option:radio
source: Pages of text
de: Textseiten

# @option:radio
source: Horizontally scrolling text
de: Horizontalen Lauftext anzeigen

# @option:radio
source: Random display style
de: Zufällige Anzeige

# @label:spinbox
source: Font border thickness
de: Linienstärke des Schriftrandes

# @option:check
source: Vapor trails
de: Kondensstreifen

# @item screen saver name
source: Forest
de: Wald

# @info screen saver description
source: This screen saver was removed from the XScreenSaver distribution as of version 5.08. Fractal trees. Written by Peter Baumung; 1997.
de: Dieser Bildschirmschoner ist in XScreenSaver ab Version 5.08 nicht mehr enthalten. Fraktalbäume. Geschrieben von Peter Baumung; 1997.

# @item screen saver name
source: FuzzyFlakes
de: Verrückte Schneeflocken

# @info screen saver description
source: Falling colored snowflake/flower shapes. http://en.wikipedia.org/wiki/Snowflake Written by Barry Dmytro; 2004.
de: Fallende Objekte in Schneeflocken-/Blumenform. http://en.wikipedia.org/wiki/, geschrieben von Barry Dmytro; 2004.

# @label:slider
source: Layers
de: Ebenen

# @item:inrange Layers
source: Few
de: Wenige

# @item:inrange Layers
source: Many
de: Viele

# @option:check
source: Random colors
de: Zufällige Farben

# @option:radio
source: Red
de: Rot

# @option:radio
source: Pink
de: Rosa

# @option:radio
source: Yellow
de: Gelb

# @option:radio
source: Green
de: Grün

# @option:radio
source: Blue
de: Blau

# @label:slider
source: Border thickness
de: Rahmendicke

# @item:inrange Border thickness
source: Thin
de: Dünn

# @item:inrange Border thickness
source: Thick
de: Dick

# @item:inrange Radius
source: Small
de: Klein

# @item:inrange Radius
source: Large
de: Groß

# @item screen saver name
source: Galaxy
de: Galaxis

# @info screen saver description
source: This draws spinning galaxies, which then collide and scatter their stars to the, uh, four winds or something. Written by Uli Siegmund, Harald Backert, and Hubert Feyrer; 1997.
de: Zeichnet drehende Galaxien, die kollidieren und ihre Sterne im endlosen Weltraum verteilen. Geschrieben von Uli Siegmund, Harald Backert und Hubert Feyrer; 1997.

# @label:spinbox
source: Count
de: Anzahl

# @option:check
source: Rotate viewpoint
de: Standpunkt drehen

# @item screen saver name
source: Gears
de: Zahnräder

# @info screen saver description
source: This draws sets of turning, interlocking gears, rotating in three dimensions. See also the "Pinion" and "MoebiusGears" screen savers. http://en.wikipedia.org/wiki/Involute_gear http://en.wikipedia.org/wiki/Epicyclic_gearing Written by Jamie Zawinski; 2007.
de: Zeichnet einige sich drehende, ineinander verzahnte Zahnräder, die rotiert werden. Sehen Sie sich auch die Bildschirmschoner „Pinion“ und „MoebiusGears“ an (http://de.wikipedia.org/wiki/Evolventenverzahnung) (http://de.wikipedia.org/wiki/Planetengetriebe). Geschrieben von Jamie Zawinski; 2007.

# @label:slider
source: Gear count
de: Anzahl der Zahnräder

# @item screen saver name
source: Geodesic
de: Geodäsie

# @info screen saver description
source: Animates a mesh geodesic sphere of increasing and decreasing complexity. A geodesic sphere is an icosohedron whose equilateral faces are sub-divided into non-equilateral triangles to more closely approximate a sphere. The animation shows the equilateral triangles subdivided into four coplanar equilateral triangles; and then inflated outward, causing the sub-triangles to no longer be equilateral, but to more closely approximate the surface of a sphere. http://en.wikipedia.org/wiki/Geodesic_dome http://en.wikipedia.org/wiki/Buckminster_Fuller Written by Jamie Zawinski; 2013.
de: Animiert ein Netz aus geodätischen Kugeln mit wachsender und verringerter Komplexität. Eine geodätische Kugel ist ein Ikosaeder, dessen gleichseitige Oberflächen in nicht gleichseitige Dreiecke zur besseren Annäherung an die Kugelform unterteilt wurden. Die Animation zeigt die Unterteilung der gleichseitigen Dreiecke in vier in der gleichen Ebene liegende gleichseitige Dreiecke, die dann nach außen gebogen werden. Damit sind die Teil-Dreiecke nicht mehr gleichseitig, passen sich aber besser an die Oberfläche der Kugel an. http://de.wikipedia.org/wiki/Geodätische_Kuppel http://de.wikipedia.org/wiki/Buckminster_Fuller Geschrieben 2013 von Jamie Zawinski

# @option:radio
source: Mesh faces
de: Maschenflächen

# @option:radio
source: Solid faces
de: Durchgehende Flächen

# @option:radio
source: Stellated faces
de: Sternförmige Flächen

# @option:radio
source: Inverse Stellated
de: Umgekehrte sternförmige Flächen

# @option:radio
source: Wireframe
de: Drahtgitter

# @option:radio
source: Random face style
de: Zufälliger Flächenstil

# @item screen saver name
source: GFlux
de: Gewelltes Drahtgitter

# @info screen saver description
source: Draws undulating waves on a rotating grid. Written by Josiah Pease; 2000.
de: Zeichnet wogende Wellen auf einem drehenden Gitter. Geschrieben von Josiah Pease; 2000.

# @info screen saver description
source: Draws a rippling waves on a rotating wireframe grid. Written by Josiah Pease; 2000.
de: Zeichnet kräuselnde Wellen auf einem drehenden Drahtgitter. Geschrieben von Josiah Pease; 2000.

# @label:slider
source: Wave speed
de: Wellengeschwindigkeit

# @item:inrange Wave speed
source: Slow
de: Langsam

# @item:inrange Wave speed
source: Fast
de: Schnell

# @label:slider
source: Mesh density
de: Maschendichte

# @item:inrange Mesh density
source: Sparse
de: Dünn

# @item:inrange Mesh density
source: Dense
de: Dicht

# @label:slider
source: Waves
de: Wellen

# @option:radio
source: Wire mesh
de: Drahtgitter

# @option:radio
source: Flat lighting
de: Einfache Beleuchtung

# @option:radio
source: Checkerboard
de: Schachbrett

# @option:radio
source: Picture
de: Bild

# @item screen saver name
source: GLBlur
de: Radiale Unschärfe

# @info screen saver description
source: Generates flowing field effects from the vapor trails around a moving object. This is done by rendering the scene into a small texture, then repeatedly rendering increasingly-enlarged and increasingly-transparent versions of that texture onto the frame buffer. As such, it's quite GPU-intensive: if you don't have a very good graphics card, it will hurt your machine bad. Written by Jamie Zawinski; 2002.
de: Generiert fließende Feldeffekte von den Kondensstreifen um ein bewegtes Objekt. Dies geschieht dadurch, dass die Szene in kleinen Texturen gerendert wird und dann wiederholt immer größer werdende und immer transparentere Versionen dieser Texturen auf dem Frame-Buffer gerendert werden. Daher ist es sehr Grafikintensiv: Versuchen Sie gar nicht erst es auszuführen, wenn Sie nicht über eine sehr gute Grafikkarte verfügen. Ihre Maschine wird daran zu Grunde gehen. Geschrieben von Jamie Zawinski; 2002.

# @info screen saver description
source: This draws a box and a few line segments, and generates a radial blur outward from it. This creates flowing field effects. This is done by rendering the scene into a small texture, then repeatedly rendering increasingly-enlarged and increasingly-transparent versions of that texture onto the frame buffer. As such, it's quite GPU-intensive: if you don't have a very good graphics card, it will hurt your machine bad. Written by Jamie Zawinski; 2002.
de: Zeichnet einen Kasten und einige Liniensegmente und erzeugt von diesem ausgehend einen strahlenförmigen Klecks. Dieser erzeugt wiederum fließende Feldeffekte. Dies geschieht dadurch, dass die Szene in kleinen Texturen gerendert wird und dann wiederholt immer größer werdende und immer transparentere Versionen dieser Texturen auf dem Frame-Buffer gerendert werden. Daher ist es sehr Grafikintensiv: Versuchen Sie gar nicht erst es auszuführen, wenn Sie nicht über eine sehr gute Grafikkarte verfügen. Ihre Maschine wird daran zu Grunde gehen. Geschrieben von Jamie Zawinski; 2002.

# @label:slider
source: Blur smoothness
de: Glätte verwischen

# @item:inrange Blur smoothness
source: Sparse
de: Dünn

# @item:inrange Blur smoothness
source: Dense
de: Dicht

# @item screen saver name
source: GLCells
de: GL-Zellen

# @info screen saver description
source: Cells growing, dividing and dying on your screen. Microscopic pathos. Written by Matthias Toussaint; 2007.
de: Zellen, die auf Ihrem Bildschirm wachsen, sich teilen und absterben. Mikroskopisches Pathos. Geschrieben von Matthias Toussaint; 2007.

# @info screen saver description
source: Cells growing, dividing and dying on your screen. Written by Matthias Toussaint; 2007.
de: Zellen, die auf Ihrem Bildschirm wachsen, sich teilen und absterben. Geschrieben von Matthias Toussaint; 2007.

# @label:slider
source: Max cells
de: Maximale Anzahl von Zellen

# @item:inrange Max cells
source: Few
de: Wenige

# @item:inrange Max cells
source: Many
de: Viele

# @label:slider
source: Cell radius
de: Zellradius

# @item:inrange Cell radius
source: Small
de: Klein

# @item:inrange Cell radius
source: Huge
de: Riesig

# @option:radio
source: Lowest sphere detail
de: Niedrige Details

# @option:radio
source: Medium sphere detail
de: Mittlere Details

# @option:radio
source: Normal sphere detail
de: Normale Details

# @option:radio
source: More sphere detail
de: Erweiterte Details

# @option:radio
source: Highest sphere detail
de: Höchste Details

# @label:slider
source: Min food
de: Min. Nahrung

# @item:inrange Min food
source: Starve
de: Hungern

# @item:inrange Min food
source: Gorge
de: Vollfressen

# @label:slider
source: Max food
de: Max. Nahrung

# @item:inrange Max food
source: Starve
de: Hungern

# @item:inrange Max food
source: Gorge
de: Vollfressen

# @label:slider
source: Cell division
de: Zellteilung

# @item:inrange Cell division
source: Quick
de: Schnell

# @item:inrange Cell division
source: Slow
de: Langsam

# @label:slider
source: Min distance
de: Minimaler Abstand

# @item:inrange Min distance
source: Small
de: Klein

# @item:inrange Min distance
source: Large
de: Groß

# @option:check
source: Keep dead cells
de: Abgestorbene Zellen behalten

# @item screen saver name
source: Gleidescope
de: Kaleidoskop (GL)

# @info screen saver description
source: A kaleidoscope that operates on a loaded image. http://en.wikipedia.org/wiki/Kaleidoscope Written by Andrew Dean; 2003.
de: Ein Kaleidoskop, das ein geladenes Bild anzeigt. Siehe http://de.wikipedia.org/wiki/Kaleidoskop. Geschrieben 2003 von Andrew Dean.

# @info screen saver description
source: A kaleidoscope that operates on your desktop image, or other pictures. http://en.wikipedia.org/wiki/Kaleidoscope Written by Andrew Dean; 2003.
de: Ein Kaleidoskop, das Ihre Arbeitsfläche oder andere Bilder anzeigt. Siehe http://de.wikipedia.org/wiki/Kaleidoskop. Geschrieben 2003 von Andrew Dean.

# @info screen saver description
source: A kaleidoscope that operates on your desktop image, or on image files loaded from disk. http://en.wikipedia.org/wiki/Kaleidoscope Written by Andrew Dean; 2003.
de: Ein Kaleidoskop, das Ihre Arbeitsfläche oder Bilddateien von der Festplatte anzeigt. Siehe http://de.wikipedia.org/wiki/Kaleidoskop. Geschrieben 1997 von Andrew Dean.

# @label:slider
source: Size of tube
de: Rohrgröße

# @item:inrange Size of tube
source: Small
de: Klein

# @item:inrange Size of tube
source: Large
de: Groß

# @label:slider
source: Image duration
de: Anzeigedauer

# @item:inrange Image duration
source: 10 seconds
de: 10 Sekunden

# @item:inrange Image duration
source: 5 minutes
de: 5 Minuten

# @option:check
source: Move
de: Verschieben

# @item screen saver name
source: GLForestFire
de: Waldfeuer (GL)

# @info screen saver description
source: This screen saver was removed from the XScreenSaver distribution as of version 5.08. Draws an animation of sprinkling fire-like 3D triangles in a landscape filled with trees. Written by Eric Lassauge; 2002.
de: Dieser Bildschirmschoner ist in XScreenSaver ab Version 5.08 nicht mehr enthalten. Zeichnet eine Animation von spritzenden, feuerähnlichen dreidimensionalen Dreiecken in einer Landschaft mit Bäumen. Geschrieben von Eric Lassauge; 2002.

# @item:inrange Count
source: Rain
de: Regen

# @item:inrange Count
source: Huge fire
de: Großes Feuer

# @label:slider
source: Number of trees
de: Anzahl der Bäume

# @item:inrange Number of trees
source: Desert
de: Wüste

# @item:inrange Number of trees
source: Forest
de: Wald

# @option:check
source: Textures
de: Texturen

# @option:check
source: Shadows
de: Schatten

# @option:check
source: Fog
de: Nebel

# @item screen saver name
source: GLHanoi
de: Hanoi (GL)

# @info screen saver description
source: Solves the Towers of Hanoi puzzle. Move N disks from one pole to another, one disk at a time, with no disk ever resting on a disk smaller than itself. http://en.wikipedia.org/wiki/Tower_of_Hanoi Written by Dave Atkinson; 2005.
de: Löst das Knobelspiel „Türme von Hanoi“. Bewege N Scheiben von einem Stapel zu einem anderen Stapel; bewege immer nur eine Scheibe und lege nie eine Scheibe auf eine kleinere Scheibe. (http://de.wikipedia.org/wiki/Türme_von_Hanoi). Geschrieben von Dave Atkinson; 2005.

# @label:slider
source: Number of disks
de: Anzahl der Scheiben

# @label:slider
source: Number of poles
de: Anzahl der Stapel

# @label:slider
source: Speed (of smallest disks)
de: Geschwindigkeit (der kleinsten Scheibe)

# @label:slider
source: Length of disk trails
de: Länge der Scheibenschweife

# @option:check
source: Enable fog
de: Nebel aktivieren

# @option:check
source: Enable lighting
de: Beleuchtung aktivieren

# @item screen saver name
source: GLKnots
de: Knoten (GL)

# @info screen saver description
source: Generates some twisting 3d knot patterns. Spins 'em around. http://en.wikipedia.org/wiki/Knot_theory Written by Jamie Zawinski; 2003.
de: Zeichnet verdrehte dreidimensionale Knotenmuster und wirbelt sie herum. (http://de.wikipedia.org/wiki/Knot_theory). Geschrieben 2003 von Jamie Zawinski.

# @label:slider
source: Resolution
de: Auflösung

# @item:inrange Resolution
source: Segmented
de: Segmentiert

# @item:inrange Resolution
source: Smooth
de: Weich

# @info screen saver description
source: Draws the 3D "digital rain" effect, as seen in the title sequence of "The Matrix". See also "xmatrix" for a 2D rendering of the similar effect that appeared on the computer monitors actually *in* the movie. http://en.wikipedia.org/wiki/Matrix_digital_rain Written by Jamie Zawinski; 2003.
de: Zeichnet einen „digitalen Regeneffekt“ in 3D wie im Filmvorspann von „Matrix“. Beachten Sie auch „XMatrix“, welches den Effekt in 2D nachahmt, so wie er auf den Computerbildschirmen im Film selber zu sehen ist. http://en.wikipedia.org/wiki/Matrix_digital_rain Geschrieben von Jamie Zawinski; 1999.

# @info screen saver description
source: Draws 3D dropping characters similar to what is seen in the title sequence of "The Matrix". See also "xmatrix" for a 2D rendering of the similar effect that appeared on the computer monitors actually *in* the movie. Written by Jamie Zawinski; 2003.
de: Zeichnet tropfende Zeichen in 3D wie im Filmvorspann von „Matrix“. Beachten Sie auch „XMatrix“, welches den Effekt in 2D nachahmt, so wie er auf den Computerbildschirmen im Film selber zu sehen ist. Geschrieben von Jamie Zawinski; 1999.

# @label:slider
source: Glyph density
de: Zeichendichte

# @item:inrange Glyph density
source: Sparse
de: Dünn

# @item:inrange Glyph density
source: Dense
de: Dicht

# @label:slider
source: Glyph speed
de: Zeichengeschwindigkeit

# @item:inrange Glyph speed
source: Slow
de: Langsam

# @item:inrange Glyph speed
source: Fast
de: Schnell

# @option:radio
source: Matrix encoding
de: Matrix-Kodierung

# @option:radio
source: Binary encoding
de: Binäre Kodierung

# @option:radio
source: Hexadecimal encoding
de: Hexadezimale Kodierung

# @option:radio
source: Genetic encoding
de: Genetische Kodierung

# @option:check
source: Waves
de: Wellen

# @option:check
source: Panning
de: Verschieben

# @item screen saver name
source: GLPlanet
de: Planet (GL)

# @info screen saver description
source: Draws the Earth bouncing around in space. If you would like it to display a different planet, the texture maps that come with "ssystem" work well. Written by David Konerding; 1998.
de: Zeichnet die umherziehenden Erde im Weltraum. Möchten Sie einen anderen Planeten anzeigen, können Sie die Texturen von „ssystem“ verwenden. Geschrieben von David Konerding; 1998.

# @info screen saver description
source: Draws a planet bouncing around in space. The built-in image is a map of the earth (extracted from `xearth'), but you can wrap any texture around the sphere, e.g., the planetary textures that come with `ssystem'. Written by David Konerding; 1998.
de: Zeichnet einen umherziehenden Planeten im Weltraum. Als Standard wird das Bild der Erde (von „xearth“) verwendet, aber jedes Bild kann als Textur benutzt werden (z. B. von „ssystem“). Geschrieben von David Konerding; 1998.

# @label:chooser
source: Image file
de: Bilddatei

# @option:check
source: Roll
de: Rollen

# @option:check
source: Stars
de: Sterne

# @item screen saver name
source: GLSchool
de: Schule (GL)

# @info screen saver description
source: Uses Craig Reynolds' classic "Boids" algorithm to simulate a school of fish. http://en.wikipedia.org/wiki/Boids Written by David C. Lambert; 2006.
de: Simuliert einen Schwarm von Fischen mit dem Algorithmus des Programms Boids von Craig Reynolds. http://de.wikipedia.org/wiki/Boids Geschrieben 2006 von David C. Lambert.

# @info screen saver description
source: Uses Craig Reynolds' Boids algorithm to simulate a school of fish. http://en.wikipedia.org/wiki/Boids Written by David C. Lambert; 2006.
de: Simuliert einen Schwarm von Fischen mit dem Algorithmus des Programms Boids von Craig Reynolds. Geschrieben 2006 von David C. Lambert.

# @label:slider
source: Fish count
de: Anzahl der Fische

# @item:inrange Fish count
source: Few
de: Wenige

# @item:inrange Fish count
source: Lots
de: Viele

# @label:slider
source: Avoidance
de: Vermeidung

# @item:inrange Avoidance
source: None
de: Keine

# @item:inrange Avoidance
source: High
de: Hoch

# @label:slider
source: Velocity matching
de: Geschwindigkeitsanpassung

# @item:inrange Velocity matching
source: None
de: Keine

# @item:inrange Velocity matching
source: High
de: Hoch

# @label:slider
source: Centering
de: Zentrierung

# @item:inrange Centering
source: None
de: Keine

# @item:inrange Centering
source: High
de: Hoch

# @label:slider
source: Goal following
de: Zielverfolgung

# @item:inrange Goal following
source: None
de: Keine

# @item:inrange Goal following
source: High
de: Hoch

# @option:check
source: Draw goal
de: Ziel anzeigen

# @item screen saver name
source: GLSlideshow
de: Diaschau (GL)

# @info screen saver description
source: Loads a random sequence of images and smoothly scans and zooms around in each, fading from pan to pan. Written by Jamie Zawinski and Mike Oliphant; 2003.
de: Lädt eine zufällige Folge von Bildern, die fließend eingelesen und ineinander gezoomt werden, mit Überblendung zwischen den Verschiebungen. Geschrieben 2003 von Jamie Zawinski und Mike Oliphant;.

# @item:inrange Time until loading a new image
source: 10 seconds
de: 10 Sekunden

# @item:inrange Time until loading a new image
source: 5 minutes
de: 5 Minuten

# @label:slider
source: Always show at least this much of the image
de: Immer mindestens diesen Anteil des Bildes anzeigen

# @label:slider
source: Pan/zoom duration
de: Dauer der Verschiebung/Vergrößerung

# @item:inrange Pan/zoom duration
source: 1 second
de: 1 Sekunde

# @item:inrange Pan/zoom duration
source: 30 seconds
de: 30 Sekunden
