Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/kdeartwork/kxsconfig.po
Languages: de

# @label:slider
source: Star speed
de: Stern-Geschwindigkeit

# @item:inrange Star speed
source: Slow
de: Langsam

# @item:inrange Star speed
source: Fast
de: Schnell

# @label:slider
source: Stars created
de: Erzeugte Sterne

# @item:inrange Stars created
source: Few
de: Wenige

# @item:inrange Stars created
source: Lots
de: Viele

# @item screen saver name
source: XAnalogTV
de: Analog-TV-Bildstörungen

# @info screen saver description
source: a detailed simulation of an old TV set, including artifacts like snow, bloom, distortion, ghosting, and hash noise. It also simulates the TV warming up. It will cycle through 12 channels, some with images you give it, and some with color bars or nothing but static. Written by Trevor Blackwell; 2003.
de: Eine detailgetreue Simulation einen alten Fernsehers. Dabei werden diverse Bildstörungen eingestreut, darunter Schnee, Verzerrung en,Geisterbilder und statisches Rauschen. Außerdem wird das Aufwärmen des Fernsehers simuliert. Anschließend werden 12 Programme durchgeschaltet. Einige davon zeigen konfigurierbare Bilder, andere farbige Balken oder feste Muster. Geschrieben von Trevor Blackwell; 2003.

# @info screen saver description
source: XAnalogTV shows a detailed simulation of an old TV set showing various test patterns, with various picture artifacts like snow, bloom, distortion, ghosting, and hash noise. It also simulates the TV warming up. It will cycle through 12 channels, some with images you give it, and some with color bars or nothing but static. Written by Trevor Blackwell; 2003.
de: Analog-TV-Bildstörungen simuliert detailgetreu einen alten Fernsehers, der verschiedene Testbilder zeigt. Dabei werden diverse Bildstörungen eingestreut, darunter Schnee, Geisterbilder und statisches Rauschen. Außerdem wird das Aufwärmen des Fernsehers simuliert. Anschließend werden 12 Programme durchgeschaltet. Einige davon zeigen konfigurierbare Bilder, andere farbige Balken oder feste Muster. Geschrieben von Trevor Blackwell; 2003.

# @item screen saver name
source: XFlame
de: Flamme

# @info screen saver description
source: Draws a simulation of pulsing fire. It can also take an arbitrary image and set it on fire too. Written by Carsten Haitzler and many others; 1999.
de: Zeichnet die Simulation eines pulsierenden Feuers. Ein beliebiges Bild kann auch unter Feuer gesetzt werden. Geschrieben von Carsten Haitzler, erweitert von vielen anderen; 1999.

# @option:check
source: Enable blooming
de: Blühen aktivieren

# @item screen saver name
source: XJack
de: Tipper

# @info screen saver description
source: This behaves schizophrenically and makes a lot of typos. Written by Jamie Zawinski; 1997.
de: Verhält sich geisteskrank und macht dabei eine Menge Tippfehler. Geschrieben von Jamie Zawinski; 1997.

# @item screen saver name
source: XLyap
de: Lyap

# @info screen saver description
source: The Lyapunov exponent makes pretty fractal pictures. http://en.wikipedia.org/wiki/Lyapunov_exponent Written by Ron Record; 1997.
de: Der „Lyapunov-Exponent“ erzeugt schönes Fraktalbilder. http://de.wikipedia.org/wiki/Ljapunow-Exponent Geschrieben von Ron Record; 1997.

# @info screen saver description
source: This generates pretty fractal pictures via the Lyapunov exponent. http://en.wikipedia.org/wiki/Lyapunov_exponent Written by Ron Record; 1997.
de: Hier wird ein schönes Fraktalbild mit dem „Lyapunov-Exponenten“ erzeugt (http://de.wikipedia.org/wiki/Ljapunow-Exponent). Geschrieben von Ron Record; 1997.

# @info screen saver description
source: Draws the "digital rain" effect, as seen on the computer monitors in "The Matrix". See also "GLMatrix" for a 3D rendering of the similar effect that appeared in the movie's title sequence. http://en.wikipedia.org/wiki/Matrix_digital_rain Written by Jamie Zawinski; 1999.
de: Zeichnet einen „digitalen Regeneffekt“ wie auf den Computerbildschirmen in „Matrix“. Beachten Sie auch „GLMatrix“, welches dem 3D-Effekt ähnelt, der im Filmvorspann gezeigt wurde. http://en.wikipedia.org/wiki/Matrix_digital_rain Geschrieben von Jamie Zawinski; 1999.

# @info screen saver description
source: Draws dropping characters similar to what is seen on the computer monitors in "The Matrix". See also "GLMatrix" for a 3D rendering of the similar effect that appeared in the movie's title sequence. Written by Jamie Zawinski; 1999.
de: Zeichnet fallende Zeichen ähnlich denen, die auf den Computerbildschirmen in „Matrix“ zu sehen sind. Beachten Sie auch „GLMatrix“, welches dem 3D-Effekt ähnelt, der im Filmvorspann gezeigt wurde. Geschrieben von Jamie Zawinski; 1999.

# @option:radio
source: Small font
de: Kleine Schrift

# @option:radio
source: Large font
de: Große Schrift

# @option:radio
source: Piped ASCII text
de: Übertragener ASCII-Text

# @option:radio
source: Synergistic algorithm
de: Beide Algorithmen

# @option:radio
source: Slider algorithm
de: Schiebealgorithmus

# @option:radio
source: Expansion algorithm
de: Erweiterungsalgorithmus

# @option:check
source: Run trace program
de: Rückverfolgungsprogramm ausführen

# @option:check
source: Knock knock
de: Klopf klopf

# @label:textbox
source: Phone number
de: Telefonnummer

# @item:inrange Density
source: Full
de: Voll

# @item screen saver name
source: XRaySwarm
de: Schwarm am Röntgenschirm

# @info screen saver description
source: Worm-like swarms of particles with vapor trails. Written by Chris Leger; 2000.
de: Wurm-ähnliche Schwärme von Teilchen mit Kondensstreifen. Geschrieben von Chris Leger; 2000.

# @info screen saver description
source: Draws a few swarms of critters flying around the screen, with faded color trails behind them. Written by Chris Leger; 2000.
de: Zeichnet einen Schwarm Kriechtiere, die über den Bildschirm fliegen und verblassende Farbspuren hinterlassen. Geschrieben von Chris Leger; 2000.

# @item screen saver name
source: XSpirograph
de: Spirograph

# @info screen saver description
source: Simulates that pen-in-nested-plastic-gears toy from your childhood. http://en.wikipedia.org/wiki/Spirograph Written by Rohit Singh; 2000.
de: Simuliert das „Stift in ineinandergesetzten Zahnrädern“-Kinderspielzeug (http://de.wikipedia.org/wiki/Spirograph_(Spielzeug)). Geschrieben von Rohit Singh; 2000.

# @label:spinbox
source: Layers
de: Ebenen

# @info screen saver description
source: Fatbits! Zooms in on a part of the screen and then moves around. With the "Lenses" option, the result is like looking through many overlapping lenses rather than just a simple zoom. Written by James Macnicol; 2001.
de: Dicke Bits! Vergrößert einen Teil des Bildschirms und bewegt sich dann umher. Mit der Linsen-Einstellung sieht das Ergebnis aus, als ob man durch viele überlappende Linsen sieht. Geschrieben von James Macnicol; 2001.

# @info screen saver description
source: Zooms in on a part of the screen and then moves around. With the "Lenses" option, the result is like looking through many overlapping lenses rather than just a simple zoom. Written by James Macnicol; 2001.
de: Vergrößert einen Teil des Bildschirms und bewegt sich dann umher. Mit der Linsen-Einstellung sieht das Ergebnis aus, als ob man durch viele überlappende Linsen sieht. Geschrieben von James Macnicol; 2001.

# @label:spinbox
source: X magnification
de: Horizontale Vergrößerung

# @label:spinbox
source: X border width
de: Horizontale Randbreite

# @label:spinbox
source: X lens offset
de: Horizontaler Linsenversatz

# @label:spinbox
source: Y magnification
de: Vertikale Vergrößerung

# @label:spinbox
source: Y border width
de: Vertikale Randbreite

# @label:spinbox
source: Y lens offset
de: Vertikaler Linsenversatz

# @option:check
source: Lenses
de: Linsen

source: Setup %1
de: %1 einrichten

source: KDE X Screen Saver Configuration tool
de: KDE-Programm zur Einrichtung von X-Bildschirmschonern

source: Filename of the screen saver to configure
de: Dateiname des einzurichtenden Bildschirmschoners

source: Optional screen saver name used in messages
de: Optionaler Name des Bildschirmschoners, der in Texten benutzt wird

source: No configuration available for %1
de: Für „%1“ ist keine Einstellung verfügbar.

source: KDE X Screen Saver Launcher
de: Starter für den KDE X-Bildschirmschoner

source: Filename of the screen saver to start
de: Dateiname des zu startenden Bildschirmschoners
