Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdelibs/kconfig_compiler_man-kconfig_compiler.1.po
Languages: de

source: Programming Tool
de: Programmier-Werkzeug

source: KDE configuration compiler
de: KDE-Konfigurationscompiler

source: Description
de: Beschreibung

source: <command>kconfig_compiler</command> generates C++ source code from two files. The first file (.kcfg) contains information about configuration options and the second file (.kcfgc) provides the code generation options.
de: <command>kconfig_compiler</command> generiert C++-Quelltext aus zwei Dateien. Die erste Datei (.kcfg) enthält Informationen über die Einstellungsoptionen und die zweite Datei (,kcfgc) Einstellungen zur Quelltextgenerierung.

source: The generated source code contains a class based on <command>KConfigSkeleton</command> that provides an API to access the applications configuration data.
de: Der generierte Quelltext enthält eine von <command>KConfigSkeleton</command> abgeleitete Klasse mit Programmschnittstellen (API) für den Zugriff auf die Einstellungsdaten der Anwendung.

source: Options
de: Optionen

source: Arguments:
de: Argumente:

source: Input kcfg XML file
de: Eingabedatei (kcfg) im XML-Format

source: Code generation options file
de: Datei mit Einstellungen zur Quelltextgenerierung

source: Options:
de: Optionen

source: -d, --directory &lt;dir&gt;
de: -d, --directory &lt;Ordner&gt;

source: Directory to generate files in [.]
de: Ordner, in dem die Dateien generiert werden [.]

source: Generic options:
de: Allgemeine Optionen:

source: Show help about options
de: Hilfe zu verfügbaren Optionen anzeigen.

source: Show Qt specific options
de: Spezielle Optionen für Qt anzeigen

source: Show KDE specific options
de: Spezielle Optionen für KDE anzeigen

source: Show all options
de: Alle Optionen anzeigen

source: Show author information
de: Zeigt Informationen über den Autor.

source: Show version information
de: Versionsinformation anzeigen

source: Show license information
de: Lizenz-Informationen anzeigen

source: KDE Options:
de: KDE-Optionen

source: --caption &lt;caption&gt;
de: --caption &lt;Titel&gt;

source: Use 'caption' as name in the titlebar
de: Verwendet „Titel“ als Name in der Titelleiste

source: --icon &lt;icon&gt;
de: --icon &lt;Symbol&gt;

source: Use 'icon' as the application icon
de: „Symbol“ für die Anwendung benutzen

source: --miniicon &lt;icon&gt;
de: --miniicon &lt;Symbol&gt;

source: --config &lt;filename&gt;
de: --config &lt;Dateiname&gt;

source: Use alternative configuration file
de: Andere Einrichtungsdatei verwenden

source: Use the DCOP server specified by 'server'
de: Verwendet den unter 'Server' angegebenen DCOP-Server.

source: Disable crash handler to get core dumps
de: Abschalten des Crash-Handlers, damit Fehlerprotokolle (core dumps) erstellt werden.

source: Waits for a WM_NET compatible windowmanager
de: Wartet auf einen Fenstermanager, der WM_NET-kompatibel ist.

source: --style &lt;style&gt;
de: --style &lt;Stil&gt;

source: Sets the application GUI style
de: Legt den Stil der Anwendung fest

source: --geometry &lt;geometry&gt;
de: --geometry &lt;Geometrie&gt;

source: Sets the client geometry of the main widget - see man X for the argument format
de: Legt die Geometrie des Hauptelements im Client-Programm fest. Das Format für die Argumente finden Sie mit „man X“

source: Qt options:
de: Qt-Optionen:

source: --display &lt;displayname&gt;
de: --display &lt;Anzeigename&gt;

source: Use the X-server display 'displayname'
de: Verwendet die X-Server-Anzeige 'Anzeigename'.

source: --session &lt;sessionId&gt;
de: --session &lt; Sitzungs-ID&gt;

source: Restore the application for the given 'sessionId'
de: Wiederherstellung der Anwendung für die angegebene 'Sitzungs-ID'.

source: Causes the application to install a private color map on an 8-bit display
de: Bewirkt, dass die Anwendung auf einem 8-Bit-Display eine eigene Farbtabelle anlegt.

source: --ncols &lt;count&gt;
de: --ncols &lt;Anzahl&gt;

source: Limits the number of colors allocated in the color cube on an 8-bit display, if the application is using the QApplication::ManyColor color specification
de: Beschränkt die Anzahl der Farben auf einem 8-Bit-Display, wenn die Anwendung die Farbspezifikation <methodname>QApplication::ManyColor</methodname> verwendet.

source: Tells Qt to never grab the mouse or the keyboard
de: Verhindert, dass Qt die Maus oder die Tastatur einfängt.

source: Switches to synchronous mode for debugging
de: Wechselt zum Debuggen in den Synchronmodus.

source: --fn, --font &lt;fontname&gt;
de: --fn, --font &lt;Schriftname&gt;

source: Defines the application font
de: Legt die Schriftart für die Anwendung fest.

source: --bg, --background &lt;color&gt;
de: --bg, --background &lt;Farbe&gt;

source: Sets the default background color and an application palette (light and dark shades are calculated)
de: Legt die Standardhintergrundfarbe und eine Farbpalette für die Anwendung fest (helle und dunkle Schattierungen werden berechnet).

source: --fg, --foreground &lt;color&gt;
de: --fg, --foreground &lt;Farbe&gt;

source: Sets the default foreground color
de: Legt die Standardvordergrundfarbe fest.

source: --btn, --button &lt;color&gt;
de: --btn, --button &lt;Farbe&gt;

source: Sets the default button color
de: Legt die Standardfarbe für Knöpfe fest.

source: Sets the application name
de: Legt den Namen der Anwendung fest

source: --title &lt;title&gt;
de: --title &lt;Titel&gt;

source: Sets the application title (caption)
de: Legt den Titel der Anwendung fest (Fenstertitel)

source: Forces the application to use a TrueColor visual on an 8-bit display
de: Erzwingt die Verwendung von Echtfarben auf einer 8-Bit-Anzeige

source: --inputstyle &lt;inputstyle&gt;
de: --inputstyle &lt;Eingabestil&gt;

source: Sets XIM (X Input Method) input style. Possible values are onthespot, overthespot, offthespot, and root
de: Legt den Eingabestil von XIM (X Input Method) fest. Mögliche Werte sind onthespot, overthespot, offthespot und root.

source: Sets XIM server
de: Legt den XIM-Server fest

source: Disable XIM
de: XIM abschalten

source: Mirrors the whole layout of widgets
de: Ordnet sämtliche Bedienelemente spiegelverkehrt an

source: See Also
de: Siehe auch

source: KDE Developer's Corner website
de: KDE-Entwickler-Webseite

source: Bugs
de: Fehler

source: Please use <ulink url="http://bugs.kde.org">bugs.kde.org</ulink> to report bugs, do not mail the authors directly.
de: Bitte verwenden Sie <ulink url="http://bugs.kde.org">bugs.kde.org</ulink> für Fehlerberichte, schicken Sie keine E-Mails direkt an die Autoren.
