Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdelibs/kde4-config_man-kde4-config.1.po
Languages: de

source: &kde; User's Manual
de: &kde;-Benutzerhandbuch

source: Prints &kde; installation paths
de: Gibt die Installationspfade von &kde; aus

source: Description
de: Beschreibung

source: kde4-config is a command line program used to retrieve information about &kde; installation or user paths.
de: kde4-config ist Befehlszeilenprogramm, mit dem Informationen über die &kde;-Installation oder Benutzerpfade abgerufen werden können.

source: Use this program to determine where the various aspects of the &kde; installation reside on your system.
de: Verwenden Sie dieses Programm zur Abfrage der verschiedenen Aspekte der auf Ihrem System vorliegenden &kde;-Installation.

source: Options
de: Optionen

source: expand ${prefix} and ${exec_prefix} in output
de: ${prefix} und ${exec_prefix} bei der Ausgabe expandieren

source: Compiled in prefix for &kde; libraries
de: Einkompiliertes prefix für &kde;-Bibliotheken

source: Compiled in exec_prefix for &kde; libraries
de: Einkompiliertes exec_prefix für &kde;-Bibliotheken

source: Compiled in library path suffix
de: Bei der Kompilierung gesetztes <quote>library path suffix</quote>

source: Prefix in $<envar>HOME</envar> used to write files
de: Präfix für das Schreiben von Dateien in $<envar>HOME</envar>.

source: Compiled in version string for &kde; libraries
de: Einkompilierte Versionszeichenkette für &kde;-Bibliotheken

source: Print a list of all available &kde; resource types
de: Ausgabe der Liste aller verfügbaren &kde;-Ressourcetypen

source: --path <replaceable>type</replaceable>
de: --path <replaceable>Typ</replaceable>

source: Search path for the specified <replaceable>type</replaceable>
de: Suchpfad für den angegebenen <replaceable>Typ</replaceable>

source: --userpath <replaceable>type</replaceable>
de: --userpath <replaceable>Typ</replaceable>

source: User paths for the types: desktop|autostart|trash|document
de: Benutzerpfade für die Typen: desktop|autostart|trash|document

source: --install <replaceable>type</replaceable>
de: --install <replaceable>Typ</replaceable>

source: Prefix to install resource files to
de: Präfix, in dem Ressourcen-Dateien abgelegt werden

source: Examples
de: Beispiele

source: Print the top-level &kde; installation directory:
de: Ausgabe des Basisordners der &kde;-Installation:

source: Print a list of all resource types:
de: Ausgabe einer Liste aller Ressourcentypen:

source: Print the installed wallpaper path:
de: Ausgabe des Pfades des installierten Arbeitsflächenhintergrunds:

source: See Also
de: Siehe auch

source: Bugs
de: Fehler

source: None known.
de: Keine bekannt.
