Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdelibs/kded4_man-kded4.8.po
Languages: de

source: &kde; User's Manual
de: &kde;-Benutzerhandbuch

source: &kde; daemon - triggers Sycoca database updates when needed.
de: &kde;-Dienst: Löst Aktualisierungen der Sycoca-Datenbank aus, wenn erforderlich

source: <command>kded4</command> <arg choice="opt">--help</arg> <arg choice="opt">Generic options</arg> <arg choice="opt">Qt-options</arg> <arg choice="opt">KDE-options</arg> <arg choice="opt">--check</arg>
de: <command>kded4</command> <arg choice="opt">--help</arg> <arg choice="opt">Allgemeine Optionen</arg> <arg choice="opt">Qt-Optionen</arg> <arg choice="opt">KDE-Optionen</arg> <arg choice="opt">--check</arg>

source: Description
de: Beschreibung

source: <command>kded4</command> is responsible for creating the sycoca file, i.e. the binary cache of servicetypes, mimetypes, and services for a particular user.
de: <command>kded4</command> ist verantwortlich für die Anlage und Pflege der sycoca-Datei, also dem binären Zwischenspeicher für Diensttypen, MIME-Typen und Dienste für jeden einzelnen Benutzer.

source: It monitors the directories containing .desktop files. When a file is added/removed, it waits 5 seconds (in case of a series of updates), and then launches <command>kbuildsycoca4</command> to update the sycoca.
de: Es überwacht die Ordner mit .desktop-Dateien. Wenn eine neue Datei hinzugefügt oder eine vorhandene entfernt wird, wartet es 5 Sekunden (falls noch mehr Änderungen vorgenommen werden), und startet anschließend <command>kbuildsycoca4</command> um die Systemdatenbank mit den Einstellungen zu aktualisieren.

source: It checks newly installed update files, i.e. the *.upd files used to update configuration files of users when the configuration file formats changes. <command>kconf_update</command> is launched to do the updates.
de: Es überprüft neu installierte Aktualisierungsdateien, &ie; *upd-Dateien, die verwendet werden, um bei Änderung des Formats von Einrichtungsdateien die Einrichtungsdateien der Benutzer zu aktualisieren. Das Programm <command>kconf_update</command> führt diese Aktualisierungen durch.

source: When the hostname changes, it will make the necessary changes to the KDE environment and X-server to allow continued proper operation, launching <command>kdontchangethehostname</command> to do the changes.
de: Wenn der Rechnername geändert wird, ändert es die notwendigen Einstellungen für die KDE-Arbeitsumgebung und den X-Server, sodass das System auch weiterhin richtig funktioniert. Für diese Änderungen wird das Programm <command>kdontchangethehostname</command> gestartet.

source: Those tasks are also performed always at kded4 start to ensure that the user configuration is up to date.
de: Diese Aufgaben werden auch bei jedem Start von kded4 durchgeführt, damit ist sichergestellt, dass die Benutzereinstellungen immer aktuell sind.

source: It is also responsible for launching the on-demand kded4 modules and init enabled kded4 modules like:
de: Es ist dafür verantwortlich, auf Anforderung kded4-Module zu starten und die Ausführung von aktivierten Modulen zu ermöglichen wie zum Beispiel:

source: Konqueror Browser Preloader
de: Konqueror-Webbrowser-Schnellstarter

source: Reduces Konqueror startup time.
de: Lädt Konqueror im Voraus und verringert so die Ladezeit.

source: Directory Watcher
de: Ordnerüberwachung

source: Monitors directories for changes.
de: Ordner auf Änderungen überwachen.

source: Hardware Detection
de: Hardwareerkennung

source: Provides a user interface for hardware events.
de: Stellt eine Benutzeroberfläche für Hardwareereignisse zur Verfügung.

source: SSL Certificate Policy
de: SSL-Zertifikat-Regel

source: Provides the user configured SSL certificate policy to applications.
de: Stellt den Anwendungen benutzerdefinierte SSL-Zertifikat-Regel zur Verfügung.

source: Network Proxy Configuration
de: Netzwerk-Proxy-Einrichtung

source: Automatic proxy configuration.
de: Sucht nach einem Proxy-Server und richtet ihn ein.

source: Password Caching
de: Passwort-Zwischenspeicherung

source: Temporary password caching, for example: so that a webpage with HTTP authentication doesn't ask for your password for every link and every image in the page. These passwords are forgotten when exiting KDE (unlike <command>KWallet</command>)
de: Zwischenspeicherung von Passwörtern, sodass zum Beispiel eine Webseite mit HTTP-Authentisierung nicht für jede einzelne Verknüpfung oder jedes Bild auf der Seite immer wieder das Passwort abgefragt wird. Diese Passwörter bleiben nur innerhalb einer KDE-Sitzung gültig, im Gegensatz zu Passwörtern, die in <command>KWallet</command> gespeichert werden.

source: Sound Policy
de: Audioregelungen

source: Provides the sound system policy to applications.
de: Stellt den Anwendungen Audiosystemregeln zur Verfügung.

source: Favicons
de: Webseiten-Symbole

source: Stores website icons.
de: Webseitensymbole speichern.

source: Display Management
de: Bildschirmverwaltung

source: Manages displays and video outputs.
de: Bildschirme und Grafikkarten verwalten.

source: Cookie jar
de: Cookie-Behälter

source: Stores network cookies.
de: Netzwerk-Cookies speichern.

source: Network Watcher
de: Netzwerküberwachung

source: Keeps track of the network and updates directory listings of the <application>network:/</application> KIO slave.
de: Überwacht das Netzwerk und aktualisiert Ordnerauflistungen des Protokolls <application>network:/</application>.

source: Subversion Module
de: Subversion-Unterstützung

source: Provides various subversion actions to filemanager and other software.
de: Stellt Dateiverwaltungsprogrammen und anderen Anwendungen verschiedene Aktionen für die Subversion-Quelltextverwaltung zur Verfügung.

source: Network Status
de: Netzwerkstatus

source: Tracks status of network interfaces and provides notifications for applications using the network.
de: Überprüft den Status von Netzwerkschnittstellen und benachrichtigt Programme, die das Netzwerk verwenden.

source: Write Daemon
de: „Write“-Dienst

source: Watches the messages from local users sent with <replaceable>write</replaceable>(1) or <replaceable>wall</replaceable>(1).
de: Überwacht Meldungen lokaler Benutzer, die mit <replaceable>write</replaceable>(1) oder <replaceable>wall</replaceable>(1) gesendet werden.

source: Notification area watcher
de: Überwachung des Benachrichtigungsbereichs

source: Keeps track of applications that want to use the D-Bus based notification area.
de: Überwacht Anwendungen, die über das D-Bus-System den Benachrichtigungsbereich verwenden möchten.

source: KMixD Mixer Service
de: KMixD-Lautstärkeregelungsdienst

source: Systemtray daemon
de: Dienst für den Systemabschnitt der Kontrollleiste

source: Keeps track of applications that want to use the D-Bus based system tray.
de: Überwacht Anwendungen, die über das D-Bus-System den Systemabschnitt der Kontrollleiste verwenden möchten.

source: Keyboard Daemon
de: Tastatur-Dienst

source: Keeps track of keyboard changes (new keyboard, changed layout)
de: Überwacht Tastatur-Änderungen (neue Tastatur, geändertes Tastaturlayout)

source: Remote URL Change Notifier
de: Überwachung für Dateien auf Fremdrechnern

source: Provides change notifications for network folders
de: Benachrichtigt den Anwender über Änderungen an Dateien in Netzwerkordnern.

source: Activity Manager
de: Aktivitätenverwaltung

source: The Nepomuk activities manager backend
de: Das Hintergrundprogramm für den Nepomuk-Aktivitäten-Dienst

source: Display Management change monitor
de: Bildschirmverwaltung (Anzeige ändern)

source: Notifies how the display has been rotated (where available)
de: Benachrichtigt, wenn der Bildschirm gedreht wurde, sofern diese Information verfügbar ist

source: Free Space Notifier
de: Speicherplatzbenachrichtigung

source: Warns when running out of space in your home folder.
de: Gibt eine Warnung aus, wenn der freie Speicherplatz in Ihrem Persönlichen Ordner knapp wird.

source: Removable Device Automounter
de: Automounter für Wechselmedien

source: Automatically mounts devices as needed.
de: Bindet Geräte bei Bedarf automatisch ein.

source: Nepomuk Search Module
de: Nepomuk-Suchmodul

source: Helper module for KIO to ensure automatic updates of Nepomuk search listings.
de: Hilfsmodul für KIO zur automatischen Aktualisierung von Nepomuk Suchergebnis-Listen.

source: Power Management
de: Energieverwaltung

source: Battery, Display and CPU power management and notifications.
de: Akku-, Anzeige- und Prozessorleistungsverwaltung und -benachrichtigung.

source: K Remote Control Daemon
de: Fernsteuerungsdienst für KDE

source: Manages the Remote Control commands received
de: Verwaltet die empfangenen Fernbedienungsbefehle

source: Status Notifier Manager
de: Statusbenachrichtigungs-Verwaltung

source: Manages services that provide status notifier user interfaces.
de: Verwaltet Dienste, die eine Schnittstelle für Status-Informationen bereitstellen.

source: DNS-SD Service Discovery Monitor
de: DNS-SD-Dienst-Überwachung

source: Monitors the network for DNS-SD services.
de: Überwacht das Netzwerk nach DNS-SD-Diensten.

source: Drive Ejector
de: Laufwerksauswurf

source: Automatically unmounts and releases drives when their eject button is pushed.
de: Automatisches Lösen der Laufwerkseinbindung bei Betätigung des Auswurfknopfes.

source: Time zone
de: Zeitzone

source: Provides access to the system's time zones for applications.
de: Ermöglicht Anwendungen den Zugriff auf die Systemzeitzonen.

source: Input Actions
de: Tastenkombinationen

source: Input Actions service performing configured actions on key presses.
de: „Tastenkombinationen“ führt benutzerdefinierte Aktionen auf Tastendruck aus..

source: The init modules can be enabled/disabled using <command>systemsettings</command>, in System Administration > Startup and Shutdown > Service Manager.
de: Diese Startmodule können in den &systemsettings; unter <menuchoice><guimenu>Systemverwaltung</guimenu> <guisubmenu>starten und Beenden</guisubmenu> <guimenuitem>Diensteverwaltung</guimenuitem></menuchoice> ein- und ausgeschaltet werden.

source: Generic Options
de: Allgemeine Optionen

source: Show author information.
de: Zeigt Informationen über den Autor.

source: Show help about options.
de: Hilfe zu verfügbaren Optionen anzeigen.

source: Show all options.
de: Alle Optionen anzeigen

source: Show KDE specific options.
de: Spezielle Optionen für KDE anzeigen.

source: Show Qt specific options.
de: Spezielle Optionen für Qt anzeigen.

source: Show license information.
de: Lizenz-Informationen anzeigen.

source: Show version information
de: Versionsinformation anzeigen

source: Application Options
de: Anwendungsoptionen

source: Check Sycoca database only once.
de: Sycoca-Datenbank nur einmal überprüfen.

source: Usage
de: Benutzung

source: If <command>kded4</command> is called without parameters and is already running, it shows the message:
de: Falls <command>kded4</command> ohne Parameter aufgerufen wird und bereits läuft, erscheint die Meldung:

source: If <command>kded4</command> is called with <command>kded4 --check</command>, then it updates the &kde; sycoca using <command>kbuildsycoca4</command>.
de: Wenn Sie <command>kded4</command> mit dem Befehl <command>kded4 --check</command> aufrufen, wird die &kde;-sycoca-Datenbank mit dem Programm <command>kbuildsycoca4</command> aktualisiert.

source: See Also
de: Siehe auch

source: Bugs
de: Fehler

source: There are probably tons of bugs. Use <ulink url="http://bugs.kde.org">bugs.kde.org</ulink> to report them.
de: Berichten Sie Fehler auf <ulink url="http://bugs.kde.org">bugs.kde.org</ulink>.
