Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdelibs/kioslave_webdav.po
Languages: de

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Marco</firstname><surname>Wegner</surname><affiliation><address><email>mail@marcowegner.de</email></address></affiliation><contrib>Übersetzer</contrib></othercredit>

source: <acronym>WebDAV</acronym> is a <emphasis>D</emphasis>istributed <emphasis>A</emphasis>uthoring and <emphasis>V</emphasis>ersioning protocol for the World Wide Web. It allows for easy management of documents and scripts on a <ulink url="help:/kioslave/webdav.html">http</ulink> server, and has additional features designed to simplify version management amongst multiple authors.
de: <acronym>WebDAV</acronym> ist ein <quote><emphasis>D</emphasis>istributed <emphasis>A</emphasis>uthoring and <emphasis>V</emphasis>ersioning</quote>-Protokoll für das Internet. Mit Hilfe dieses Protokolls kann man Dokumente und Skripte auf einem <ulink url="help:/kioslave/webdav.html">HTTP</ulink>-Server verwalten. Es bietet einige zusätzliche Funktionen, um die Koordinierung von verschiedenen Versionen zwischen mehreren Autoren zu vereinfachen.

source: Usage of this protocol is simple. Type the location you want to view, similar to a <acronym>http</acronym> URL except for the webdav:// protocol name at the start. An example is <userinput>webdav://<replaceable>www.hostname.com/path/</replaceable></userinput>. If you specify a folder name, a list of files and folders will be displayed, and you can manipulate these folders and files just as you would with any other filesystem.
de: Die Verwendung des Protokolls ist einfach. Geben Sie die Adresse ein, die Sie betrachten möchten, ähnlich einer <acronym>HTTP</acronym>-Adresse, außer das Sie für den Protokollnamen webdav:// einsetzen. Ein Beispiel ist <userinput>webdav://<replaceable>www.Rechnername.de/Pfad/</replaceable></userinput>. Wenn Sie einen Ordnernamen eingeben, werden alle Dateien und Unterordner angezeigt und Sie können mit diesen so arbeiten, als befänden sie sich auf Ihrer lokalen Festplatte.

source: WebDAV Features
de: Funktionen von WebDAV

source: Locking
de: Sperren

source: File locking allows users to lock a file, informing others that they are currently working on this file. This way, editing can be done without fear that the changes may be overwritten by another person who is also editing the same document.
de: Es ist möglich, eine Datei zu sperren und damit andere davon in Kenntnis zu setzen, dass man gerade an dieser Datei arbeitet. Auf diese Weise kann man eine Datei verändern, ohne befürchten zu müssen, dass diese Änderungen von einer anderen Person, die gleichzeitig an diesem Dokument arbeitet, überschrieben werden.

source: Source file access
de: Zugriff auf Quelltexte

source: <acronym>WebDAV</acronym> allows access to the script which is called to produce a specific page, so changes can be made to the script itself.
de: Mit <acronym>WebDAV</acronym> kann man auf Skripte zugreifen, die eine bestimmte Internetseite erzeugen. Damit kann man die Skripte selbst verändern.

source: Per-document property support
de: Unterstützung für Dokumenteneigenschaften

source: Arbitrary properties may be set to assist identification of a document, such as the author.
de: Einem Dokument können verschiedene Eigenschaften wie &eg; der Autor zugeordnet werden.

source: To take advantage of these additional capabilities, you will need an application which supports them. No application currently supports them through this kioslave.
de: Um diese zusätzlichen Funktionen zu nutzen, benötigen Sie eine Anwendung, die diese unterstützt. Bisher gibt es keine Anwendung, die diese Funktionen über dieses Ein-/Ausgabemodul unterstützt.

source: <acronym>WebDAVS</acronym> is the <acronym>WebDAV</acronym> protocol encrypted via SSL.
de: WebDAVS verschlüsselt das <acronym>WebDAV</acronym>-Protokoll mit Hilfe von SSL.
