Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdelibs/kioslave_mailto.po
Languages: de

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Marco</firstname><surname>Wegner</surname><affiliation><address><email>mail@marcowegner.de</email></address></affiliation><contrib>Übersetzer</contrib></othercredit>

source: The kioslave mailto is responsible for launching the mail composer of your choice when you open a &URL; in the mailto scheme (<ulink url="http://tools.ietf.org/html/rfc6068">RFC6068</ulink>).
de: Das Ein-/Ausgabemodul „mailto“ startet das von Ihnen eingestellte E-Mail-Editor, wenn Sie eine &URL; mit dem „mailto“-Schema (<ulink url="http://tools.ietf.org/html/rfc6068">RFC6068</ulink>) öffnen.

source: The syntax of a mailto &URL; follows the following pattern:
de: Die Syntax einer „mailto“-&URL; hat folgendes Schema:

source: where recipients form a list of restricted &SMTP; address specifications, and the query part may contain one or more of the following parameters:
de: dabei besteht „recipients“ (Empfänger) aus einer Liste von &SMTP;-Adressen und der „query“-Teil aus einem oder mehreren der folgenden Parameter:

source: &amp;to=recipients
de: &amp;to=Empfänger

source: Specifies additional recipients.
de: Gibt zusätzliche Empfänger an.

source: &amp;cc=recipients
de: &amp;cc=Empfänger

source: Specifies additional recipients of carbon copies.
de: Weitere Empfänger, die eine Kopie der E-Mail erhalten.

source: &amp;bcc=recipients
de: &amp;bcc=Empfänger

source: Specifies additional recipients of blind carbon copies. These recipients will receive the message, but all other recipients will not know about that.
de: Weitere Empfänger, die eine Blindkopie der E-Mail erhalten. Diese Empfänger erhalten ebenfalls die E-Mail, das ist für die anderen Empfänger aber nicht erkennbar.

source: Specifies the text of the message. This text should not be long, as there may be hard limits on how long an &URL; may be.
de: Der Text der E-Mail. Dieser Text sollte nicht zu lang sein, da es Begrenzungen für die Länge der &URL; geben kann.

source: Specifies the subject of the message.
de: Gibt den Betreff der E-Mail an.

source: Example
de: Beispiel

source: mailto:info@kde.org?cc=kde@kde.org&amp;subject=Thank%20you!&amp;body=KDE%20rocks!%20How%20can%20I%20help%3F
de: mailto:info@kde.org?cc=kde@kde.org&amp;subject=Vielen%20Dank!&amp;body=KDE%20ist%20klasse!%20Wie%20kann%20ich%20mitmachen%3F

source: Configuration
de: Einrichtung

source: Choose the application to handle mailto locators in &systemsettings; <menuchoice><guimenu>Workspace Appearance and Behaviour</guimenu><guimenuitem>Default Applications</guimenuitem></menuchoice>.
de: Wählen Sie das Programm zur Verarbeitung von „mailto“-&URL;s in den &systemsettings; auf der Seite <menuchoice><guimenu>Erscheinungsbild und Verhalten der Arbeitsfläche</guimenu><guimenuitem>Standard-Komponenten</guimenuitem></menuchoice>.
