Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdelibs/qtoptions_man-qtoptions.7.po
Languages: de

source: KDE User's Manual
de: KDE-Benutzerhandbuch

source: Common commandline options for all applications based on the Qt toolkit
de: Allgemeine Befehlszeilenparameter für alle Anwendungen, die auf dem Qt-Toolkit basieren.

source: <command><replaceable>Qt application</replaceable></command> <arg choice="opt">Qt Generic Options</arg>
de: <command><replaceable>Qt-Anwendung</replaceable></command> <arg choice="opt">Allgemeine Qt-Optionen</arg>

source: Options
de: Optionen

source: The following options apply to all &Qt; applications:
de: Die folgenden Parameter gelten für alle &Qt;-Anwendungen:

source: Use the X-server display <parameter>displayname</parameter>.
de: Verwende den X-Server-Display <parameter>Displayname</parameter>.

source: <option>--session</option> <parameter>sessionId</parameter>
de: <option>--session</option> <parameter>Sitzungs-ID</parameter>

source: Restore the application for the given <parameter>sessionId</parameter>.
de: Wiederherstellung der Anwendung für die angegebene <parameter>Sitzungs-ID</parameter>.

source: Causes the application to install a private color map on an 8-bit display.
de: Bewirkt, dass die Anwendung auf einem 8-Bit-Display eine eigene Farbtabelle anlegt.

source: <option>--ncols</option> <parameter>count</parameter>
de: <option>--ncols</option> <parameter>Anzahl</parameter>

source: Limits the number of colors allocated in the color cube on an 8-bit display, if the application is using the <methodname>QApplication::ManyColor</methodname> color specification.
de: Beschränkt die Anzahl der Farben auf einem 8-Bit-Display, wenn die Anwendung die Farbspezifikation <methodname>QApplication::ManyColor</methodname> verwendet.

source: Tells &Qt; to never grab the mouse or the keyboard.
de: Bewirkt, dass &Qt; weder Maus noch Tastatur für sich allein beansprucht (grab).

source: Running under a debugger can cause an implicit <option>--nograb</option>, use <option>--dograb</option> to override.
de: In einem Debugger kann es vorkommen, dass implizit der Parameter <option>--nograb</option> gesetzt ist. Verwenden Sie <option>--dograb</option>, um diese Einstellung zu überschreiben.

source: Switches to synchronous mode for debugging.
de: Wechselt zum Debuggen in den Synchronmodus.

source: <option>--fn</option>,<option>--font</option> <parameter>fontname</parameter>
de: <option>--fn</option>,<option>--font</option> <parameter>Schriftname</parameter>

source: Defines the application font.
de: Legt die Schriftart für die Anwendung fest.

source: <option>--bg</option>,<option>--background</option> <parameter>color</parameter>
de: <option>--bg</option>,<option>--background</option> <parameter>Farbe</parameter>

source: Sets the default background color and an application palette (light and dark shades are calculated).
de: Legt die Standardhintergrundfarbe und eine Farbpalette für die Anwendung fest (helle und dunkle Schattierungen werden berechnet).

source: <option>--fg</option>,<option>--foreground</option> <parameter>color</parameter>
de: <option>--fg</option>,<option>--foreground</option> <parameter>Farbe</parameter>

source: Sets the default foreground color
de: Legt die Standardvordergrundfarbe fest.

source: <option>--btn</option>,<option>--button</option> <parameter>color</parameter>
de: <option>--btn</option>,<option>--button</option> <parameter>Farbe</parameter>

source: Sets the default button color.
de: Legt die Standardfarbe für Knöpfe fest.

source: Sets the application name.
de: Legt den Namen der Anwendung fest

source: <option>--title</option> <parameter>title</parameter>
de: <option>--title</option> <parameter>Titel</parameter>

source: Sets the application title (caption).
de: Legt den Titel der Anwendung fest (Fenstertitel)

source: Forces the application to use a <parameter>TrueColor</parameter> visual on an 8-bit display.
de: Erzwingt für die Anwendung eine <parameter>TrueColore</parameter>-Darstellung auf einem 8-Bit-Display.

source: <option>--inputstyle</option> <parameter>inputstyle</parameter>
de: <option>--inputstyle</option> <parameter>Eingabestil</parameter>

source: Sets XIM (X Input Method) input style. Possible values are <parameter>onthespot</parameter>, <parameter>overthespot</parameter>, <parameter>offthespot</parameter> and <parameter>root</parameter>.
de: Legt den XIM (X Input Method) Eingabestil fest. Mögliche Werte sind <parameter>onthespot</parameter>, <parameter>overthespot</parameter>, <parameter>offthespot</parameter> und <parameter>root</parameter>.

source: Set XIM server.
de: Legt den XIM-Server fest.

source: Disable XIM
de: XIM abschalten

source: mirrors the whole layout of widgets
de: Ordnet sämtliche Bedienelemente spiegelverkehrt an

source: applies the Qt stylesheet to the application widgets
de: Wendet die Qt-Stilvorlage auf Anwendungs-Dialoge an.

source: See Also
de: Siehe auch

source: Authors
de: Autoren

source: Man page written by &Lauri.Watts; &Lauri.Watts.mail;
de: Handbuchseite geschrieben von &Lauri.Watts;&Lauri.Watts.mail;
