Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdelibs/sonnet.po
Languages: de

source: Check Spelling Dialog
de: Der Dialog Rechtschreibprüfung

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Frank</firstname><surname>Schütte</surname><affiliation><address><email>f.schuette@t-online.de</email></address></affiliation><contrib>Deutsche Übersetzung</contrib></othercredit>

source: &sonnet; is the spelling checker used by &kde; applications such as &kate;, &kmail;, and &kword;. It is a &GUI; frontend to various free spell checkers. More Information about required spell checkers and dictionaries you find in the documentation of the &systemsettings; module <ulink url="help:kcontrol/spellchecking">Spell Checker</ulink>.
de: &sonnet; ist das Rechtschreibprogramm, das von den &kde;-Programmen wie &kate;, &kmail; und &kword; verwendet wird. Es handelt sich um eine Benutzeroberfläche zu verschiedenen freien Rechtschreibprogrammen. Weitere Informationen zu den unterstützten Rechtschreibprogrammen und Wörterbüchern finden Sie in der Dokumentation zum &systemsettings;-Modul <ulink url="help:kcontrol/spellchecking">Rechtschreibprüfung</ulink>.

source: spelling
de: Rechtschreibung

source: check
de: prüfen

source: checker
de: Prüfer

source: The top line in the dialog displays a possibly misspelled word which was found in your document. &sonnet; attempts to find an appropriate replacement word. One or several may be found.
de: Die erste Zeile des Dialogs zeigt das im Dokument gefundene, vermutlich fehlerhafte Wort. &sonnet; versucht geeignete Worte zur Ersetzung zu finden. Es kann dabei eines oder mehrere gefunden werden.

source: The best guess is shown to the right of <guilabel>Replace with</guilabel>. To accept this replacement, click on <guibutton>Replace</guibutton>.
de: Das wahrscheinlichste Wort wird rechts von <guilabel>Ersetzen durch</guilabel> gezeigt. Zur Bestätigung der Ersetzung klicken Sie auf <guibutton>Ersetzen</guibutton>.

source: You may also select a word from the list of suggestions and then click <guibutton>Replace</guibutton> to replace the misspelled word with the selected word. To add more suggestions from the dictionary to the suggestions list click the <guibutton>Suggest</guibutton> button.
de: Stattdessen können Sie auch ein anderes Wort aus der Liste der Vorschläge auswählen und dann auf <guibutton>Ersetzen</guibutton> klicken. Um weitere Wörter aus dem Wörterbuch in der Vorschlagsliste anzuzeigen, klicken Sie auf den Knopf <guibutton>Vorschläge</guibutton>.

source: To keep your original spelling, click on <guilabel>Ignore</guilabel>.
de: Um die ursprüngliche Schreibweise beizubehalten, klicken Sie auf <guilabel>Ignorieren</guilabel>.

source: To stop the spellchecking -- keeping the changes you've already made -- click on <guibutton>Finished</guibutton>.
de: Um die Rechtschreibprüfung zu beenden -- alle bisherigen Änderungen werden beibehalten -- klicken Sie auf <guibutton>Abgeschlossen</guibutton>.

source: To stop the spellchecking and cancel the changes you've already made, click on <guibutton>Cancel</guibutton>.
de: Um die Rechtschreibprüfung zu beenden und alle bisherigen Änderungen zu verwerfen, klicken Sie auf <guibutton>Abbrechen</guibutton>.

source: Clicking on <guibutton>Replace All</guibutton> will initially perform the same function as clicking on <guibutton>Replace</guibutton>, but will automatically replace the misspelled word with the chosen replacement word, if it appears again (at a later point) in your document.
de: Klicken Sie auf <guibutton>Alle ersetzen</guibutton>, wird die gleiche Funktion ausgeführt wie beim Klicken auf <guibutton>Ersetzen</guibutton>. Es wird aber jedes Vorkommen des fehlerhaften Wortes durch die gewählte Ersetzung im gesamten weiteren Dokument ersetzt.

source: The <guibutton>Ignore All</guibutton> button ignores this and all future occurrences of the misspelled word.
de: Der Knopf <guibutton>Alle ignorieren</guibutton> ignoriert folgerichtig jedes weitere Vorkommen des fehlerhaften Wortes.

source: Clicking on <guibutton>Add to Dictionary</guibutton> will add the misspelled word to your personal dictionary (this is distinct from the original system dictionary, so the additions you make will not be seen by other users).
de: Klicken Sie auf <guibutton>Zum Wörterbuch hinzufügen</guibutton>, wird das fehlerhafte Wort zum persönlichen Wörterbuch (es unterscheidet sich vom Systemwörterbuch, daher sind die hinzugefügten Worte nicht für andere Benutzer sichtbar) hinzugefügt.

source: The drop down box <guilabel>Language</guilabel> at the bottom of this dialog allows you to switch to another dictionary temporarily.
de: Im Auswahlfeld <guilabel>Sprache</guilabel> unten im Dialog können Sie vorübergehend ein anderes Wörterbuch für die Rechtschreibprüfung einstellen.

source: The default configuration options are available in the &systemsettings; module <ulink url="help:kcontrol/spellchecking">Spell Checker</ulink>.
de: Die Standardeinstellungen für die Rechtschreibprüfung finden Sie im &systemsettings;-Modul <ulink url="help:kcontrol/spellchecking">Rechtschreibprüfung</ulink>.
