Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdeedu/artikulate.po
Languages: de

source: When opening a unit for editing, you will see the list of its phrases (see below). One line of this list contains the following information:
de: Wenn eine Einheit zur Bearbeitung geöffnet wird, wird eine Liste der darin enthaltenen Redewendungen wie im folgenden Bildschirmfoto angezeigt. Jede Zeile in dieser Liste enthält die folgenden Informationen:

source: edit button: open this phrase for edit
de: Bearbeitungsknopf: Öffnet diese Redewendung zum Ändern

source: phrase type: icon that denotes the type of this phrase (e.g., word, expression)
de: Art der Redewendung: Ein Symbol, das die Art dieser Redewendung wie zum Beispiel Wort oder Ausdruck kennzeichnet.

source: edit state: a colored block that denotes the edit state of this phrase (red: unknown/no state set; orange: translated state; green: completed state)
de: Bearbeitungsstatus: Ein farbiges Quadrat, das den Bearbeitungsstatus dieser Redewendung kennzeichnet: Rot - unbekannt oder kein Status gesetzt, Orange - übersetzt, Grün - fertiggestellt.

source: the phrase
de: Redewendung

source: exclude button: if course derives from a course skeleton, this button allows excluding the phrase from the unit
de: Knopf zum Ausschluß: Wurde die Übung aus einer Vorlage abgeleitet, können Sie mit diesem Knopf Redewendungen aus der Einheit ausschließen.

source: <screeninfo>Editor View: list of phrases within a unit.</screeninfo>
de: <screeninfo>Editor-Fenster: Liste der Redewendungen in einer Einheit</screeninfo>

source: <para>Editor View: list of phrases within a unit.</para>
de: <para>Editor-Fenster: Liste der Redewendungen in einer Einheit</para>

source: Edit a Phrase
de: Bearbeitung einer Redewendung

source: When opening a phrase for editing, you will see the phrase editor as shown below. This edit interface contains the following elements:
de: Wenn Sie eine Redewendung zur Bearbeitung öffnen, wird das folgende Bildschirmfoto angezeigt. Dieser Dialog enthält die folgenden Elemente:

source: the phrase text as it will be shown in the trainer
de: Text der Redewendung, wie er in der Übung angezeigt wird

source: the original phrase, if using a course skeleton
de: Ursprüngliche Redewendung, wenn Sie eine Übungsvorlage verwenden

source: the edit state of the phrase
de: Bearbeitungsstatus der Redewendung

source: the type/length of the phrase
de: Art und Länge der Redewendung

source: recording buttons for the native speaker recordings
de: Knöpfe zur Steuerung der Aufnahme des Muttersprachlers

source: buttons to denote interesting phonemes of the phrase (currently not used in training mode)
de: Knöpfe zur Kennzeichnung interessanter Phoneme in der Redewendung, die wird zurzeit im Übungsmodus nicht verwendet.

source: You can close the phrase editing interface with <inlinemediaobject><imageobject> <imagedata fileref="editor-apply.png" format="PNG"/></imageobject> </inlinemediaobject> to accept the changes you did, or with <inlinemediaobject><imageobject> <imagedata fileref="editor-cancel.png" format="PNG"/></imageobject> </inlinemediaobject> to discard your changes.
de: Sie können alle Änderungen einer Redewendung mit <inlinemediaobject><imageobject> <imagedata fileref="editor-apply.png" format="PNG"/></imageobject> </inlinemediaobject> übernehmen oder mit <inlinemediaobject><imageobject> <imagedata fileref="editor-cancel.png" format="PNG"/></imageobject> </inlinemediaobject> verwerfen.

source: <screeninfo>Editor View: editing view for a phrase.</screeninfo>
de: <screeninfo>Editor zur Bearbeitung einer Redewendung</screeninfo>

source: <para>Editor View: editing view for a phrase.</para>
de: <para>Editor zur Bearbeitung einer Redewendung</para>

source: Update from Course Prototype
de: Vom Übungsprototypen aktualisieren

source: If the currently edited course derives from a skeleton, then the course can be updated from the latest version of the skeleton by using the button <guilabel>Update from Course Prototype</guilabel> at the top left of the screen. This button is deactivated if the course is not derived from a course skeleton.
de: Wurde die gerade bearbeitete Übung von einer Vorlage abgeleitet, kann die Übung von der letzten Version der Vorlage mit <guilabel>Vom Übungsprototypen aktualisieren</guilabel> oben links im Fenster aktualisiert werden. Dieser Knopf ist deaktiviert, wenn die Übung nicht aus einer Vorlage abgeleitet worden ist.

source: Credits and License
de: Danksagungen und Lizenz

source: Program Copyright:
de: Copyright für das Programm:

source: Documentation Copyright:
de: Copyright der Dokumentation:

source: CREDIT_FOR_TRANSLATORS
de: <para>Übersetzung Burkhard Lück<email>lueck@hube-lueck.de</email></para>

source: How to obtain &artikulate;
de: Bezugsquellen von &artikulate;

source: Compilation and installation
de: Kompilierung und Installation

source: &artikulate; Specific Instructions
de: Spezielle Anleitung zu &artikulate;

source: Further guidelines on how to compile &artikulate; are available in <ulink url="http://techbase.kde.org/Projects/Edu/Artikulate"><citetitle>&artikulate;'s technical documentation</citetitle></ulink> at the &kde; TechBase.
de: Weitere Hinweise zum Kompilieren von &artikulate; finden Sie auf der Seite <ulink url="http://techbase.kde.org/Projects/Edu/Artikulate"><citetitle>Technische Dokumentation zu &artikulate;</citetitle></ulink> in der &kde;-Techbase.
