Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdeedu/artikulate.po
Languages: de

source: The &artikulate; Handbook
de: Das Handbuch zu &artikulate;

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Burkhard</firstname><surname>Lück</surname><affiliation><address><email>lueck@hube-lueck.de</email></address></affiliation><contrib>Übersetzung</contrib></othercredit>

source: The &artikulate; Developers
de: Die &artikulate;-Entwickler

source: &artikulate; is a pronunciation trainer, which helps in improving and perfecting pronunciation skills. Learners train their pronunciation by recording their own voices and comparing them to native speaker recordings. &artikulate; is part of the &kde; Education Project.
de: &artikulate; ist eine Anwendung zum Üben der Aussprache und hilft beim Verbessern und Perfektionieren Ihrer Aussprachefähigkeiten. Zum Üben wird die Aussprache des Benutzers aufgenommen und mit den Aufnahmen von Muttersprachlern verglichen. &artikulate; ist Teil des &kde;-Edu-Projekts.

source: language
de: Sprache

source: course
de: Übung

source: unit
de: Einheit

source: phrase
de: Redewendung

source: learner profile
de: Schülerprofil

source: Introduction
de: Einleitung

source: &artikulate; is a pronunciation trainer that helps improving and perfecting a learner's pronunciation skills for a foreign language. For this, it provides courses with native speaker recordings of the target language for download. The learner download courses for selected language, selects a group of phrases, starts to record her/his own voice when speaking the phrases himself/herself, and compares the results to the native speaker's recordings by listening to both.
de: &artikulate; ist eine Anwendung zum Üben der Aussprache und hilft beim Verbessern und Perfektionieren Ihrer Aussprachefähigkeiten für eine fremde Sprache. Dazu können Übungen mit Aufnahmen von Muttersprachlern aus der Zielsprache heruntergeladen werden. Dann wird eine Gruppe von Redewendungen ausgewählt, die eigene Stimme beim Aussprechen der Redewendungen aufgenommen und mit den Aufnahmen von Muttersprachlern verglichen.

source: The Learning Concept
de: Das Lernkonzept

source: The study concept of this language learning application is as follows. By repeating and comparing own recordings of spoken phrases to the recordings of (a representative set of) native speakers, a learner can <itemizedlist> <listitem><para>identify weaknesses when speaking the foreign language and</para></listitem> <listitem><para>adapt the pronunciation to coincide with the native speaker's pronunciation.</para></listitem> </itemizedlist> For best learning outcome, specifically designed courses for every supported language are necessary. Those courses can concentrate on training special scenarios (like ordering food in a restaurant) but can also focus on learning how to pronounce difficult syllables and words of a particular language correctly.
de: Mit diesem Programm wird folgendes Lernkonzept umgesetzt: Durch Wiederholen und Vergleichen eigener Aufnahmen von gesprochenen Redewendungen mit den Aufnahmen von einer repräsentativen Gruppe von Muttersprachlern, können <itemizedlist> <listitem><para>Schwächen in der Aussprache der fremden Sprache erkannt und</para></listitem> <listitem><para>die Aussprache an die Muttersprachler angepasst werden.</para></listitem> </itemizedlist> Für den besten Lernerfolg sind besonders entwickelte Übungen für jede unterstützte Sprache nötig. Diese Übungen können auf bestimmte Szenarien wie das Bestellen von Essen in einem Restaurant oder auf das Üben der Aussprache von schwierigen Silben und Wörtern einer bestimmten Sprache ausgerichtet sein.

source: First Steps in &artikulate;
de: Erste Schritte mit &artikulate;

source: This chapter explains how to make the first steps in &artikulate;, especially how to create a learner identity, how to select a language and how to get native speaker recordings to start training.
de: Dieses Kapitel erläutert die ersten Schritte in &artikulate;, besonders das Erstellen einer Schüler-Identität, die Auswahl einer Sprache, das Herunterladen der Aufnahmen von Muttersprachlern und das Starten von Übungen.

source: 1. Create a Learner Identity
de: 1. Schüler-Identität erstellen

source: For every learner, there has to be one learner identity that saves the learning progress. This also allows multiple people to use &artikulate; on the same computer, each being able to have his/her private learning goals. To create a learner identity, click on the <guilabel>Create Learner Identity</guilabel> button (if starting &artikulate; for the first time) or otherwise the button with the name of the currently selected learner identity at the top left of the window. In the opening dialog, then select <guilabel>Create New Learner Identity</guilabel>. You can edit your name with the <guilabel>Edit</guilabel> button and set a picture if you like.
de: Für jeden Schüler muss eine eigene Identität erstellt werden, für die der Lernfortschritt gespeichert wird. Dadurch können mehrere Personen &artikulate; auf dem gleichen Rechner benutzen und jeder hat seine eigenen privaten Lernstatistiken. Um eine Identität zu erstellen, klicken Sie auf den Knopf <guilabel>Schüler-Identität erstellen</guilabel>, wenn Sie &artikulate; zum ersten mal starten. Ansonsten wählen Sie oben links im Fenster mit dem Knopf eine Schüler-Identität aus. Ihren Namen können Sie mit dem Knopf <guilabel>Bearbeiten</guilabel> ändern.

source: Create a learner identity.
de: Eine Schüler-Identität erstellen.

source: 2. Select a Language
de: 2. Sprache auswählen

source: Setting the training language(s) of a learner is done in the <guilabel>Favorite Languages</guilabel> tab by activating (clicking at) the languages. The star symbol corresponding to each language will turn colored once it is selected. Close the Learner Identity dialog by selecting your identity with <guilabel>Use Selected Identity</guilabel>. Note that when downloading courses, the course language will automatically be activated for the currently selected learner identity.
de: Die Übungssprache eines Benutzers wird im Bereich <guilabel>Bevorzugte Sprachen</guilabel> durch Klicken auf eine Sprache eingestellt. Das zugehörige Sternsymbols vor der ausgewählten Sprache wird in gelber Farbe angezeigt. Schließen Sie den Dialog Schüler-Identität mit dem Knopf <guilabel>Ausgewählte Identität verwenden</guilabel>. Wenn Sie Übungen herunterladen, wird die Sprache dieser Übung automatisch für die gerade ausgewählte Schüler-Identität aktiviert.

source: Set favorite languages.
de: Bevorzugte Sprachen einstellen.

source: 3. Download a Language Course
de: 3. Sprachübung herunterladen

source: For this tutorial, we assume that we would like to learn Polish and hence that we want to download a course for Polish. You can download courses through <menuchoice><guimenu>File</guimenu> <guimenuitem>Download New Language Course</guimenuitem></menuchoice> or by clicking at the orange star at the top right. A download window will appear, listing the available languages provided by the &kde; Community. You can sort through them using the order by functions at the right. We download the Polish course by clicking on <guilabel>Install</guilabel>.
de: Angenommen Sie möchten Polnisch lernen und möchten daher eine Ausspracheübung für Polnisch herunterladen. Wählen Sie dazu <menuchoice><guimenu>Datei</guimenu><guimenuitem>Neue Sprachübungen herunterladen</guimenuitem></menuchoice> oder klicken Sie auf den orangefarbenen Stern rechts oben. Es wird ein Dialog geöffnet, in dem alle von der &kde;-Gemeinschaft zur Verfügung gestellten Sprachen angezeigt werden. Die Liste können Sie mit den Knöpfen rechts sortieren. Laden Sie die Übung für Polnisch herunter, indem Sie auf <guilabel>Installieren</guilabel> klicken.

source: Download course.
de: Übung herunterladen.

source: 4. Start Training
de: 4. Übung starten

source: Courses consist of multiple training units, each usually grouping a set of phrases according to a scenario. Select one of the training units available at the left panel, and then click on <guilabel>Start Training</guilabel>.
de: Übungen bestehen aus mehreren Einheiten, die jeweils eine Gruppe von Redewendungen für eine Szenario enthalten. Wählen Sie eine der auf der linken Seite aufgelisteten Einheiten und klicken Sie auf <guilabel>Übung starten</guilabel>.

source: Select unit and start training.
de: Einheit wählen und Übung starten.

source: Finish Training / Statistics
de: Übung beenden / Statistik

source: After completing through all the phrases in a training unit, you will see a statistics screen for the completed training. You can see how many tries it took for the various types of phrases. The statistics screen is closed by click on the <guilabel>Finish Training</guilabel> button at the top right.
de: Nach dem Üben aller Redewendungen in einer Einheit wird eine Statistik mit den Ergebnissen angezeigt. Darin können Sie die Anzahl der Versuche für die verschiedenen Arten von Redewendungen sehen. Durch Klicken auf den Knopf <guilabel>Übung beenden</guilabel> rechts oben können Sie die Statistik schließen.

source: Screens
de: Programmfenster

source: The Training Screen
de: Das Übungsfenster

source: The training view is the most important view in &artikulate;. Whenever starting a training, this view is opened and will be presented until the training of the selected training unit is finished or the learner stops the training. In the center of this screen, there are controls for playing a native speaker recording, the text of the corresponding phrase, and controls to record and playback the learner's own voice. When a learner judges to be done with training the pronunciation of the current phrase, by clicking <guilabel>OK</guilabel> the current phrase is marked as done and a next phrase is selected. Otherwise, when clicking on <guilabel>Retry Later</guilabel>, a next phrase is selected but the current phrase will be displayed later again.
de: Das Übungsfenster ist die wichtigste Ansicht in &artikulate;. Immer wenn eine Übung begonnen wird, wird diese Fenster angezeigt und es bleibt solange geöffnet, bis die ausgewählte Übungseinheit beendet ist oder der Benutzer die Übung abbricht. In der Mitte des Fensters gibt es Knöpfe für das Abspielen der Aufnahme der Muttersprachler, der Text der zugehörigen Redewendung und Knöpfe für die Aufnahme und Wiedergabe der eigenen Stimme. Findet der Benutzer, dass er mit dem Lernen der Aussprache der aktuellen Redewendung zufrieden ist, markiert er diese Redewendung mit dem Knopf <guilabel>OK</guilabel> als gelernt und die nächste Redewendung wird ausgewählt. Ansonsten wird die aktuelle Redewendung mit <guilabel>Später erneut versuchen</guilabel> zurückgestellt und die nächste Redewendung ausgewählt.

source: For training the pronunciation of a current phrase, the learner shall first play the native speaker's recording by pressing at the <guilabel>Playback</guilabel> button at the left. The next step is to press on the <guilabel>Record</guilabel> button and read the presented phrase aloud. A further press on the <guilabel>Record</guilabel> button stops the recording and the recording can then be played with the corresponding <guilabel>Playback</guilabel> button. By listening to both recordings, the learner shall judge if the phrase was pronounced correctly or not. If it was pronounced correctly, clicking on <guilabel>OK</guilabel> marks the phrase as learned and proceeds with the next phrase. Otherwise, if not yet satisfied with the recording, the learner either can retry recording by again clicking on <guilabel>Record</guilabel> or schedule the phrase for later training by clicking on <guilabel>Retry Later</guilabel>.
de: Zum Üben der Aussprache der aktuellen Redewendung, soll zuerst die Aufnahme des Muttersprachlers durch Drücken des Knopfes <guilabel>Wiedergabe</guilabel> abgespielt werden. Dann wird der Knopf <guilabel>Aufnahme</guilabel> gedrückt und die angezeigte Redewendung laut vorgelesen. Ein weiterer Druck auf den Knopf <guilabel>Aufnahme</guilabel> beendet die Aufnahme. Nun kann durch Drücken auf den Knopf <guilabel>Wiedergabe</guilabel> die Aufnahme abgespielt werden. Durch das Hören beider Aufnahmen kann der Schüler entscheiden, ob die Redewendung richtig ausgesprochen wurde. Wenn ja, dann wird mit Klicken auf <guilabel>OK</guilabel> die Redewendung als gelernt markiert. Ansonsten kann entweder die Aufnahme wiederholt oder die Redewendung für ein späteres Üben mit <guilabel>Später erneut versuchen</guilabel> zurückgestellt werden.

source: &artikulate;'s units are composed of a list of phrases of different lengths (words, expressions, sentences, and paragraphs). A learner can see the current learning progress at the bottom when looking at <link linkend="screens-training-progressbar">the progress bar</link>. The progress bar also allows switching between phrases.
de: Lerneinheiten in &artikulate; bestehen aus einer Liste von Redewendungen unterschiedlicher Länge, zum Beispiel Wörter, Ausdrücke, Sätze und Absätze. In der <link linkend="screens-training-progressbar">Fortschrittsanzeige</link> unten im Fenster kann der Benutzer den Lernfortschritt verfolgen. Mit Hilfe der Fortschrittsanzeige kann auch zwischen Redewendungen gewechselt werden.

source: At any time, the learner can choose to stop training by clicking at the <guilabel>Finish</guilabel> button.
de: Eine Übung kann jederzeit durch Klicken auf den Knopf <guilabel>Übung beenden</guilabel> oben rechts im Fenster angehalten werden.

source: The Training Screen.
de: Das Übungsfenster.

source: Screenshot of the Training Screen.
de: Bildschirmfoto des Übungsfensters.

source: Sound Controls
de: Lautstärkesteuerung

source: <guilabel>Record</guilabel>: Record your pronunciation through your microphone. Click again to stop recording.
de: <quote>Aufnahme</quote>: Aufnahme Ihrer Aussprache mit dem Mikrofon. Klicken Sie erneut auf diesen Knopf, um die Aufnahme zu beenden.

source: <guilabel>Playback</guilabel>: Play a sound file. If active, click again to stop.
de: <quote>Wiedergabe</quote>: Spielt eine Sounddatei ab. Klicken Sie erneut auf den Knopf, um die Wiedergabe anzuhalten.

source: Learning Controls
de: Lernsteuerung

source: <guilabel>OK</guilabel>: Mark current phrase as learned and continue with next phrase.
de: <quote>OK</quote>: Markiert die aktuelle Redewendung als gelernt und geht weiter zur nächsten Redewendung.

source: <guilabel>Retry Later</guilabel>: Continue with training next phrase, but try this phrase later again.
de: <quote>Später erneut üben</quote>: Setzt die Übung mit der nächsten Redewendung fort, geht aber später wieder zu dieser Redewendung zurück.

source: <guilabel>Stop</guilabel>: Stops the training and proceeds to the statistics view. Current training results are saved to training statistics.
de: <quote>Anhalten</quote>. Beendet die Übung und zeigt die Statistik an. Das aktuelle Ergebnis der Übung wird in den Trainingsstatistiken gespeichert.

source: <title>Progress Bar</title>
de: <title>Fortschrittsanzeige</title>

source: The progress bar displays the learning progress for the current unit. It consists of blocks representing the phrases in the current unit, whereas the color of a block explains the length of the phrase. You can hover over these blocks to see the phrases and click on them to switch the currently trained phrase. Dark elements are already trained, light ones are untrained.
de: Die Fortschrittsanzeige zeigt den Lernfortschritt in der aktuellen Übungseinheit. Die Fortschrittsanzeige besteht aus Blöcken, die die Redewendungen in der aktuellen Einheit darstellen. Die Farbe der Blöcke zeigt die Länge der Redewendungen an. Fahren Sie mit dem Mauszeiger über einen Block, dann werden die Redewendungen angezeigt. Klicken Sie auf einen Block, um die aktuell geübte Redewendung zu wechseln. Redewendungen in Blöcken in dunklen Farben wurden bereits geübt, Redewendungen in Blöcken in hellen Farben noch nicht.

source: <screeninfo>Progress Bar</screeninfo>
de: <screeninfo>Fortschrittsanzeige</screeninfo>

source: The progress bar for the current unit.
de: Die Fortschrittsanzeige für die aktuelle Einheit.

source: On top of the progress bar you can see which type of phrases you are currently learning. The available types are:
de: Über der Fortschrittsanzeige wird die Art der gerade gelernten Redewendung angezeigt. Feldende Arten von Redewendungen sind verfügbar:

source: word: a single word, letter, or number
de: Wort: einzelnes Wort, Buchstabe oder Zahl

source: expression: an expression of several words that does not form a complete sentence
de: Ausdruck: ein Ausdruck bestehend aus mehreren Wörtern, die aber keinen vollständigen Satz bilden

source: sentence: a complete sentence
de: Satz: ein vollständiger Satz

source: paragraph: several sentences (usually 2-3)
de: Absatz: mehrere Sätze, normalerweise 2 bis 3

source: The integrated course editor is an advanced tool for language course contributors that allows the creation and collaborative work on language courses for &artikulate;. On the one hand it allows the creation of language courses and recording of the native speaker sound files. On the hand, it enables work on so called <emphasis>skeletons</emphasis>, which are language course prototypes that allow easy and fast creation of new courses derived from a prototype. The editor only edits files outside of the training course set, i.e., the set of courses downloaded in &artikulate;.
de: Der integrierte Übungseditor erlaubt das Erstellen und gemeinsame Bearbeiten von Sprachübungen für &artikulate;. Einerseits können Sprachübungen erstellt und die Klangdateien von Muttersprachlern aufgenommen werden. Andererseits ist es möglich, sogenannte <emphasis>Vorlagen</emphasis> die Prototypen für Sprachübungen zu erstellen. Mit Hilfe dieser Vorlagen können schnell und einfach neue von einer Vorlage generierte Übungen erstellt werden. Mit dem Editor werden nur eigene Dateien bearbeitet, nicht die die Übungen für &artikulate; heruntergeladenen Dateien.

source: Overview
de: Überblick

source: Editor Notions
de: Editor-Begriffe

source: For the course editor we use a specific set of terms, which is also used for the following descriptions.
de: Beim Übungseditor werden bestimmte Begriffe verwendet, die auch in den folgenden Erläuterungen angewendet werden.

source: Language:
de: Sprache:

source: Languages are only available in &artikulate; if they are given by language specifications.
de: Sprachen sind in &artikulate; nur verfügbar, wenn dafür Sprachdefinitionen angegeben sind.

source: Course:
de: Übung:

source: A course is associated to one language and contains a list of units.
de: Eine Übung ist einer Sprache zugeordnet und enthält eine Liste von Einheiten.

source: Unit:
de: Einheit:

source: A unit consists of phrases that are "somehow" homogeneous. E.g. those can be phrases spoken in a restaurant or phrases spoken at a conversation at the street by a tourist searching for the way.
de: Eine Einheit besteht aus Redewendungen aus einem bestimmten Themenbereich, z. B. aus Redewendungen, die im Restaurant benutzt werden, oder Redewendung aus einer Unterhaltung auf der Straße, in der ein Tourist nach dem Weg fragt.

source: Course Skeletons:
de: Übungsvorlagen:

source: A course skeleton forms the prototype of a course. This is, skeletons help to ease creation of courses in several languages as they state a set of units and phrases (in English) that then can be used as a blueprint to create a course in a new language. Updates of course skeletons can also be imported into courses that are created from a skeleton.
de: Eine Übungsvorlage ist der Prototyp für eine Übung. Mit den Vorlagen ist ein einfach, neue Übungen in mehreren Sprachen zu erstellen, da diese Vorlagen eine Gruppe von Einheiten und Redewendungen in Englisch enthalten, mit denen eine Übung in neuen Sprachen generiert werden kann. Aktualisierungen von Vorlagen können auch in Übungen importiert werden, die von einer Vorlage generiert wurden.

source: Phrases:
de: Redewendungen:

source: Phrases are given by a text string and a recording by a native speaker. We differ phrases by their lengths. The following phrase lengths exists
de: Redewendungen bestehen aus einem Text und und der Aufnahme der Aussprache durch einen Muttersprachler. Redewendungen werden anhand ihre Länge unterschiedlichen. Es gibt folgende Längen von Redewendungen:

source: A course is associated with a specific language, consists of different units and each unit is given by a sequence of phrases in different lengths.
de: Eine Übung ist einer bestimmten Sprache zugeordnet und besteht aus mehreren Einheiten. Jede Einheit wiederum enthält eine Gruppe von Redewendungen in verschiedenen Längen.

source: Set Storage Folder/Course Repository
de: Speicherordner/Übungsarchiv einstellen

source: The editor operates within a separate folder (in the following called <emphasis>repository</emphasis>, as it is recommended to be under some version control system). In that folder, the editor searches for editable courses and skeleton files and also stores new files.
de: Der Editor arbeitet mit einem eigenen Ordner, der im folgenden <emphasis>Archiv</emphasis> genannt wird, da er sich in einem Versionverwaltungssystem befinden sollte. In diesem Ordner sucht der Editor nach Übungen und Vorlagendateien zur Bearbeitung und speichert hier auch neue Dateien.

source: The course repository can be set in the configuration dialog. It can be found at <menuchoice><guimenu>Settings</guimenu> <guimenuitem>Configure &artikulate;</guimenuitem></menuchoice> and the course settings are at the menu option <guilabel>Course Resources</guilabel>.
de: Das Übungsarchiv kann im Einrichtungsdialog festgelegt werden. Öffnen Sie diesen Einrichtungsdialog mit <menuchoice><guimenu>Einstellungen</guimenu> <guimenuitem>&artikulate; einrichten</guimenuitem></menuchoice> und passen Sie den Ordner auf der Seite <guilabel>Übungs-Ressourcen</guilabel> an.

source: <screeninfo>Set course repository for editor.</screeninfo>
de: <screeninfo>Übungsarchiv für den Editor einstellen</screeninfo>

source: <para>Set course repository for editor.</para>
de: <para>Übungsarchiv für den Editor einstellen</para>

source: Edit a Course
de: Bearbeitung einer Übung

source: The editor can be started from the main menu with <menuchoice><guimenu>Mode</guimenu> <guimenuitem>Course Editor mode</guimenuitem></menuchoice>. There you have the options to work on existing skeleton files or to create new courses or edit existing ones. After selecting a language, you can open an existing course to edit it, or otherwise use <guilabel>New Course</guilabel> to create a new course for this language. In either case, you will be presented the list of units of the course, where you can create new units or open existing ones for edit.
de: Der Editor kann im Hauptmenü mit <menuchoice><guimenu>Modus</guimenu> <guimenuitem>Übungseditormodus</guimenuitem></menuchoice> geöffnet werden. Dort haben Sie die Möglichkeiten, mit vorhandenen Vorlagendateien zu arbeiten, neue Übungen zu erstellen oder vorhandene zu bearbeiten. Nach der Auswahl einer Sprache können Sie eine vorhandene Übung zum Bearbeiten öffnen oder mit <guilabel>Neue Übung</guilabel> eine neue Übung für diese Sprache erstellen. In beiden Fällen wird eine Liste mit den Einheiten der Übung angezeigt, in der Sie neue Einheiten erstellen oder vorhandene Einheiten zur Bearbeitung öffnen können.

source: Edit a Unit
de: Bearbeitung einer Einheit
