Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdeedu/blinken.po
Languages: de

source: The &blinken; Handbook
de: Das Handbuch zu &blinken;

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Thomas</firstname><surname>Reitelbach</surname><affiliation><address><email>tr@erdfunkstelle.de</email></address></affiliation><contrib>Übersetzung</contrib></othercredit>

source: &blinken; brings a retro electronic memory game from the 1970's to &kde;.
de: Mit &blinken; holt &kde; ein elektronisches Spiel aus den 70ern zurück in die Gegenwart.

source: game
de: Spiel

source: child
de: Kinder

source: electronic
de: elektronisch

source: Introduction
de: Einleitung

source: &blinken; is based on an electronic game released in 1978, which challenges players to remember sequences of increasing length. On the face of the device, there are 4 different color buttons, each one with their own distinctive sound. These buttons light up randomly, creating the sequence that the player must then recall. If the player is successful in remembering the sequence of lights in the correct order, they advance to the next stage, where an identical sequence with one extra step is presented. If they are incorrect, the game is lost, and the player must start again from the beginning. The goal is to get a high score - each step in the sequence is worth one point, so correct entry of a sequence of 8 lights is worth 8 points on the high score table.
de: Die Idee zu &blinken; gründet auf einem alten elektronischen Spiel aus dem Jahre 1978: der Spieler musste sich immer länger werdende Tasten- bzw. Tonfolgen merken. Auf dem Spielgerät von &blinken; finden Sie 4 verschiedenfarbige Knöpfe und jeder hat seinen eigenen individuellen Ton. Während dem Spiel leuchten diese Knöpfe in zufälliger Reihenfolge, die der Spieler sich merken und wiederholen muss. Wenn der Spieler es schafft, die Sequenz in der richtigen Reihenfolge wiederzugeben, erreicht er die nächste Spielstufe, in der er die gleiche Sequenz plus einer weiteren Taste wiedergeben muss. Wenn die Reihenfolge einmal falsch ist, hat der Spieler verloren und muss von vorne beginnen. Das Ziel des Spiels ist es, möglichst viele Punkte zu erreichen. Jede erfolgreiche Runde bringt einen Punkt, eine erfolgreiche Folge von 8 Knöpfen ergibt also 8 Punkte in der Bestenliste.

source: Using &blinken;
de: Wie man &blinken; benutzt

source: Here is the screen that is presented on startup of &blinken;, showing the general interface to the application. Most of the screen is taken up by the <interface>device</interface>, with the <interface>4 colored buttons</interface>, with the device controls (<interface>score counter</interface>, <guibutton>Start</guibutton> button, &etc;) in the center of the screen. The current status of the application is displayed on the <interface>piece of paper</interface> under the device. In the corners of the application, there are 3 buttons:
de: Hier sehen Sie &blinken; direkt nach dem Programmstart. Der größte Teil wird durch das <interface>Spielgerät</interface> mit den <interface>4 farbigen Knöpfen</interface> eingenommen; die Kontrollen (<interface>Punktezähler</interface> und <guibutton>Start</guibutton>-Knopf) befinden sich in der Mitte. Der aktuelle Spielstatus ist auf dem Stück <interface>Papier links unten</interface> zu sehen. In den verbleibenden Ecken befinden sich drei Knöpfe:

source: <screeninfo>Here is the screen that is presented on startup of &blinken;</screeninfo>
de: <screeninfo>Dies ist die Programmoberfläche nach dem Start von &blinken;.</screeninfo>

source: <phrase>Here is the screen that is presented on startup of &blinken;</phrase>
de: <phrase>Dies ist die Programmoberfläche nach dem Start von &blinken;.</phrase>

source: The <guiicon>Highscores</guiicon> button <action>opens a dialog that displays the <guilabel>Highscores table</guilabel></action> for each of the 3 difficulty levels (the <guilabel>Highscores</guilabel> table can also be accessed by <action>clicking on the <interface>score counter</interface>)</action>:
de: Der Knopf <guiicon>Bestenliste</guiicon> <action>öffnet das Fenster mit der <guilabel>Bestenliste</guilabel></action> für jede der drei Schwierigkeitsstufen. Sie können die Bestenliste auch aufrufen, indem Sie auf den <action><interface>Punktezähler</interface> in der Mitte klicken</action>:

source: <screeninfo><guiicon>Highscores</guiicon> button</screeninfo>
de: <screeninfo>Knopf <guiicon>Bestenliste</guiicon></screeninfo>

source: <phrase><guiicon>Highscores</guiicon> button</phrase>
de: <phrase>Knopf <guiicon>Bestenliste</guiicon></phrase>

source: The <guiicon>Quit</guiicon> button <action>closes the application</action>:
de: Der Knopf <guiicon>Beenden</guiicon> <action>beendet</action> das Spiel:

source: <screeninfo><guiicon>Quit</guiicon> button</screeninfo>
de: <screeninfo><guiicon>Beenden</guiicon>-Knopf</screeninfo>

source: <phrase><guiicon>Quit</guiicon> button</phrase>
de: <phrase><guiicon>Beenden</guiicon>-Knopf</phrase>

source: The <guiicon>Help</guiicon> button is special, in that it <action>reveals 4 sub-buttons</action>. These buttons are shown when the <guiicon>Help</guiicon> button is <action>hovered over</action>, and provide access to the <guilabel>&blinken; Handbook</guilabel> (this document), <guilabel>Show/Hide Settings</guilabel>, and the <guilabel>About &blinken;</guilabel> and <guilabel>About &kde;</guilabel> dialogs:
de: Der <guiicon>Hilfe</guiicon>-Knopf funktioniert auf besondere Weise, denn sobald man den Mauszeiger darüber positioniert werden vier weitere Knöpfe sichtbar. Mit diesen Knöpfen erreichen Sie das <guilabel>Handbuch zu &blinken;</guilabel> (welches Sie gerade lesen), <guilabel>Einstellungen anzeigen/ausblenden</guilabel>, das Fenster <guilabel>Über &blinken;</guilabel> und das Fenster <guilabel>Über &kde;</guilabel>:

source: <screeninfo><guiicon>Help</guiicon> button</screeninfo>
de: <screeninfo><guiicon>Hilfe</guiicon>-Knopf</screeninfo>

source: <phrase><guiicon>Help</guiicon> button</phrase>
de: <phrase><guiicon>Hilfe</guiicon>-Knopf</phrase>

source: To become familiar with the workings of the game, you can interact with the <interface>colored buttons</interface> whilst on the main screen. The buttons will illuminate and produce a tone upon being pressed.
de: Machen Sie sich mit dem Spiel ein wenig vertraut und drücken Sie einfach mal die <interface>farbigen Knöpfe</interface>. Die Knöpfe werden leuchten und einen Ton von sich geben.

source: Starting a Game
de: Ein Spiel starten

source: Once you are familiar with the workings of the application, a game can be started by pressing the <guibutton>Start</guibutton> button in the center of the screen. This <quote>powers on</quote> the device, as shown by the illuminated <interface>score counter</interface>. You can then <action>choose the difficulty level</action> that you want to attempt:
de: Wenn Sie sich mit dem Spiel vertraut gemacht haben, drücken Sie den Knopf <guibutton>Start</guibutton> in der Spielmitte. Dadurch wird das Gerät <quote>eingeschaltet</quote> und der <interface>Punktezähler</interface> in der Mitte leuchtet auf. Nun können Sie die Schwierigkeitsstufe wählen:

source: <screeninfo>Select difficulty level</screeninfo>
de: <screeninfo>Wählen der Schwierigkeitsstufe</screeninfo>

source: <phrase>Select difficulty level</phrase>
de: <phrase>Wählen der Schwierigkeitsstufe</phrase>

source: There are 3 levels in &blinken;:
de: In &blinken; haben Sie drei Stufen zur Auswahl:

source: Level 1 is the easiest level, as it provides the longest time break between each sequence playback.
de: Stufe 1 ist die einfachste Stufe, weil es hier die längsten Spielpausen zwischen den Tonfolgen gibt.

source: Level 2 is the intermediate level. It is identical to the previous level, but has a smaller time break between each sequence playback.
de: Stufe 2 ist die mittelschwere Stufe. Sie ist mit der ersten Stufe identisch, hat aber kürzere Pausen.

source: Level ? is the most difficult level of &blinken;. It takes the timings from Level 2, but each sequence is totally random, rather than following on from the previous sequence, as in the standard game type.
de: Die Stufe ? ist die schwierigste Stufe in &blinken;. Es gelten die Pausenzeiten von Stufe 2, aber jede Tonfolge ist zufällig anstatt immer wieder die vorigen Tonfolgen zu wiederholen.

source: Entering a New Highscore
de: Eingabe einer neuen Höchstpunktzahl

source: If you are lucky enough to get a highscore, it will be entered into the <guilabel>Highscores</guilabel> table. A dialog will ask for a name to associate with your score in the table:
de: Falls Sie das Glück haben, eine Höchstpunktzahl zu erreichen, so werden Sie in die <guilabel>Bestenliste</guilabel> aufgenommen. Ein Fenster wird Sie nach dem Namen fragen, der in der Bestenliste erscheinen soll:

source: <screeninfo>Highscore nickname prompt dialog</screeninfo>
de: <screeninfo>Fenster zum Eingeben des Namens</screeninfo>

source: <phrase>Highscore nickname prompt dialog</phrase>
de: <phrase>Fenster zum Eingeben des Namens</phrase>

source: Only 5 scores are kept for each level, so try not to be disappointed if you don't make it!
de: Für jede Spielstufe merkt sich &blinken; nur die jeweils 5 höchsten Punktzahlen. Seien Sie nicht enttäuscht, falls Sie es nicht in die oberen 5 schaffen ;-)

source: Playing Tips
de: Spiel-Tipps

source: &blinken; is the ultimate memory game, though you need not possess the ultimate memory to be successful. These tips will help you in your pursuit of the best score:
de: &blinken; ist zwar ein Gedächtnistrainer, aber neben einem guten Gedächtnis könnten auch diese Tipps für Sie nützlich sein:

source: If you have PC speakers, turn them on with the sound at a good level so that you can hear the tones alongside seeing the flashing lights.
de: Wenn Sie PC-Lautsprecher haben, so schalten Sie sie ein, damit Sie die Töne der farbigen Knöpfe hören können.

source: Experiment with both the mouse and <link linkend="accessibility">keyboard</link> interaction methods, to see which one suites your memory best.
de: Probieren Sie sowohl die Steuerung mit der Maus als auch mit der <link linkend="accessibility">Tastatur</link> und finden Sie heraus, wie Sie am besten klarkommen.

source: Try remembering the sequence as a list of colors.
de: Versuchen Sie, sich die Sequenzen als eine Liste von Farben zu merken.

source: Try remembering the sequence as positions on the screen.
de: Versuchen Sie, sich die Sequenzen als Positionen auf dem Bildschirm zu merken.

source: Accessibility Options
de: Zugangshilfen

source: To allow &blinken; to be more easily enjoyed by certain users, there are several accessibility options built into &blinken;.
de: &blinken; kann auch von Menschen mit körperlicher Beeinträchtigung gespielt werden. Zu diesem Zweck wurden einige nützliche Zugangshilfen in &blinken; eingebaut.

source: To view and modify the accessibility options of &blinken;, press the &Ctrl; key (whilst a game is not in progress):
de: Um die Einstellungen der Zugangshilfen anzusehen und zu ändern, drücken Sie die &Ctrl;-Taste (nicht während das Spiel läuft):

source: <screeninfo>&blinken; access keys</screeninfo>
de: <screeninfo>Zugangshilfen für &blinken;</screeninfo>

source: <phrase>&blinken; access keys</phrase>
de: <phrase>Zugangshilfen für &blinken;</phrase>

source: To return to the game screen, press the &Ctrl; key again.
de: Um wieder das normale Spielfeld zu sehen, drücken Sie die &Ctrl;-Taste erneut.

source: Alongside use of the mouse, &blinken; also allows the user to operate the game using the keyboard.
de: Neben der Bedienung mit der Maus können Sie auch die Tastatur zum Spielen von &blinken; benutzen.

source: The keys are <keycap>1</keycap>, <keycap>2</keycap>, <keycap>3</keycap>, <keycap>4</keycap> by default.
de: Die voreingestellten Tasten sind <keycap>1</keycap>, <keycap>2</keycap>, <keycap>3</keycap> und <keycap>4</keycap>.

source: To change the mapping of any button, click it using the mouse. It will then be highlighted, waiting for input. Press the desired key on the keyboard to change the currently assigned key.
de: Um die Tastenzuordnung zu ändern, klicken Sie mit der Maus auf einen Knopf. Dadurch wird der Bereich hervorgehoben und wartet auf Ihre Eingabe. Drücken Sie die gewünschte Taste, um die Zuordnung zu ändern.

source: There are other options available in the middle of the window: <interface>Sounds</interface> and <interface>Font</interface>.
de: In der Mitte des Fensters haben Sie noch weitere Einstellmöglichkeiten: <interface>Töne</interface> und <interface>Schriftart</interface>.

source: By unchecking the <interface>Sounds</interface> checkbox, the &blinken; sound effects will be suppressed.
de: Wenn Sie das <interface>Töne</interface>-Ankreuzfeld abwählen, wird &blinken; keine Töne mehr von sich geben.

source: By unchecking the <interface>Font</interface> checkbox, a standard font will be used for status text instead of the default handwriting font.
de: Wenn Sie das Ankreuzfeld <interface>Schriftart</interface> abwählen, wird anstelle der Handschrift-Schriftart eine ganz normale Standardschrift verwendet.

source: Credits and License
de: Danksagungen und Lizenz

source: Program copyright 2005 Albert Astals Cid &Albert.Astals.Cid.mail; and &Danny.Allen; &Danny.Allen.mail;
de: Programm-Copyright 2005 Albert Astals Cid &Albert.Astals.Cid.mail; und &Danny.Allen; &Danny.Allen.mail;

source: Contributors:
de: Mitwirkende:

source: "Steve" font: Steve Jordi <email>steve@sjordi.com</email>
de: <quote>Steve</quote>-Schriftart: Steve Jordi <email>steve@sjordi.com</email>

source: Documentation copyright 2005 &Danny.Allen; &Danny.Allen.mail;
de: Copyright der Dokumentation 2005 &Danny.Allen; &Danny.Allen.mail;

source: CREDIT_FOR_TRANSLATORS
de: <para>Übersetzung Thomas Reitelbach<email>tr@erdfunkstelle.de</email></para>

source: How to obtain &blinken;
de: Wie kann man &blinken; bekommen

source: Compilation and installation
de: Kompilierung und Installation
