Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdeedu/cantor.po
Languages: de

source: Allows to load and run the batch scripts for the current backend.
de: Ermöglicht das Laden und Ausführen der Skripte für das aktuelle Modul.

source: The View Menu
de: Das Menü Ansicht

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>+</keycap></keycombo> </shortcut> <guimenu>View</guimenu> <guimenuitem>Zoom In</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>+</keycap></keycombo></shortcut> <guimenu>Ansicht</guimenu> <guimenuitem>Vergrößern</guimenuitem>

source: <action>Zoom in</action> the current worksheet by 10%.
de: <action>Vergrößert</action> das aktuelle Arbeitsblatt um 10 %.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>-</keycap></keycombo> </shortcut> <guimenu>View</guimenu> <guimenuitem>Zoom Out</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>-</keycap></keycombo> </shortcut> <guimenu>Ansicht</guimenu> <guimenuitem>Verkleinern</guimenuitem>

source: <action>Zoom out</action> the current worksheet by 10%.
de: <action>Verkleinert</action> das aktuelle Arbeitsblatt um 10 %.

source: <guimenu>View</guimenu> <guimenuitem>Show Script Editor</guimenuitem>
de: <guimenu>Ansicht</guimenu> <guimenuitem>Skripteditor anzeigen</guimenuitem>

source: Opens the batch script editor window for the current backend.
de: Öffnet das Skripteditorfenster für das aktuell gewählte Modul.

source: <guimenu>View</guimenu> <guisubmenu>Panels</guisubmenu> <guimenuitem>Help</guimenuitem>
de: <guimenu>Ansicht</guimenu> <guisubmenu>Seitenleisten</guisubmenu><guimenuitem>Hilfe</guimenuitem>

source: <action>Toggles</action> the visibility of the <guilabel>Help</guilabel> tab in the sidebar.
de: <action>Schaltet</action> die Anzeige der Karteikarte <guilabel>Hilfe</guilabel> in der Seitenleiste an oder aus.

source: <guimenu>View</guimenu> <guisubmenu>Panels</guisubmenu> <guimenuitem>Variable Manager</guimenuitem>
de: <guimenu>Ansicht</guimenu> <guisubmenu>Seitenleisten</guisubmenu><guimenuitem>Variablen-Verwaltung</guimenuitem>

source: <action>Toggles</action> the visibility of the <guilabel>Variable Manager</guilabel> tab in the sidebar.
de: <action>Schaltet</action> die Anzeige der Karteikarte <guilabel>Variablen-Verwaltung</guilabel> in der Seitenleiste an oder aus.

source: The Worksheet Menu
de: Das Menü Arbeitsblatt

source: <guimenu>Worksheet</guimenu> <guimenuitem>Evaluate Worksheet</guimenuitem>
de: <guimenu>Arbeitsblatt</guimenu> <guimenuitem>Arbeitsblatt auswerten</guimenuitem>

source: <action>Triggers</action> the evaluation of the whole worksheet.
de: <action>Startet</action> die Auswertung des gesamten Arbeitsblatts.

source: <shortcut> <keycombo action="simul">&Shift;<keycap>Return</keycap></keycombo> </shortcut> <guimenu>Worksheet</guimenu> <guimenuitem>Evaluate Entry</guimenuitem>
de: <shortcut> <keycombo action="simul">&Shift;<keycap>Eingabe</keycap></keycombo> </shortcut> <guimenu>Arbeitsblatt</guimenu> <guimenuitem>Eintrag auswerten</guimenuitem>

source: <action>Triggers</action> the current entry evaluation.
de: <action>Startet</action> die Auswertung des aktuellen Eintrags.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Return</keycap></keycombo> </shortcut> <guimenu>Worksheet</guimenu> <guimenuitem>Insert Command Entry</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Eingabe</keycap></keycombo> </shortcut> <guimenu>Arbeitsblatt</guimenu> <guimenuitem>Befehlseintrag einfügen</guimenuitem>

source: Inserts a new command entry below the current cursor position.
de: Fügt unter der aktuellen Cursor-Position einen neuen Befehlseintrag ein.

source: <guimenu>Worksheet</guimenu> <guimenuitem>Insert Text Entry</guimenuitem>
de: <guimenu>Arbeitsblatt</guimenu> <guimenuitem>Texteintrag einfügen</guimenuitem>

source: Inserts a new text entry below the current cursor position.
de: Fügt unter der aktuellen Cursor-Position einen neuen Texteintrag ein.

source: <guimenu>Worksheet</guimenu> <guimenuitem>Insert Image</guimenuitem>
de: <guimenu>Arbeitsblatt</guimenu> <guimenuitem>Bild einfügen</guimenuitem>

source: <action>Inserts the image template below the current cursor position.</action> You will need to click with &RMB; at the template to configure the image details.
de: <action>Fügt unter der aktuellen Cursor-Position eine Bildvorlage ein</action>. Klicken Sie mit der &RMBn; darauf, um das Bild zu laden und einzustellen.

source: <guimenu>Worksheet</guimenu> <guimenuitem>Insert Page Break</guimenuitem>
de: <guimenu>Arbeitsblatt</guimenu> <guimenuitem>Seitenumbruch einfügen</guimenuitem>

source: Inserts the page break below the current cursor position.
de: Fügt unter der aktuellen Cursor-Position einen Seitenumbruch ein.

source: <shortcut> <keycombo action="simul">&Shift;<keycap>Del</keycap></keycombo> </shortcut> <guimenu>Worksheet</guimenu> <guimenuitem>Remove current Entry</guimenuitem>
de: <shortcut> <keycombo action="simul">&Shift;<keycap>Del</keycap></keycombo> </shortcut> <guimenu>Arbeitsblatt</guimenu> <guimenuitem>Aktuellen Eintrag entfernen</guimenuitem>

source: <action>Removes</action> current entry from the worksheet.
de: <action>Löscht</action> den aktuellen Eintrag aus dem Arbeitsblatt.

source: The Settings Menu
de: Das Menü Einstellungen

source: This menu contains standard &kde; <guimenu>Settings</guimenu> items, as well as the items described in <link linkend="worksheet-settings">Settings section</link>.
de: Dieses Menü enthält die Standardeinträge des &kde;-Menüs <guimenu>Einstellungen</guimenu> und zusätzlich die im Abschnitt <link linkend="worksheet-settings">Einstellungen</link> beschriebenen Einträge.

source: The Help Menu
de: Das Menü Hilfe

source: Developer's Guide to &cantor;
de: Entwicklerhandbuch zu &cantor;

source: &cantor; is easily extendable by plugins. You can write
de: &cantor; kann sehr einfach durch Module erweitert werden. Folgende Arten von Modulen gibt es:

source: Backends:
de: Module:

source: A new backend enables you to use the &cantor; interface with a different program.
de: Mit einem neuen Modul kann die Benutzerschnittstelle von &cantor; mit anderen Programmen benutzt werden.

source: Assistants:
de: Assistenten:

source: Assistants provide dialogs to allow common tasks to be automated (such entering a matrix or running a script.)
de: Assistenten bestehen aus Dialogen, mit denen häufig vorkommende Aufgaben automatisch ausgeführt werden können, zum Beispiel die Eingabe einer Matrix oder das Ausführen eines Skripts.

source: At present, there are no special developer tutorials or API documentation, so if you want to write a plugin you will have to read through the sources. All interface definitions are in the <filename role="directory">lib</filename> directory. For some example implementations, look at the plugins shipped with &cantor;.
de: Zur Zeit gibt es keine spezielle Entwickler- oder Schnittstellendokumentation. Um ein neues Modul zu schreiben, müssen Sie den Quelltext lesen. Alle Definitionen der Schnittstellen finden Sie im Ordner <filename role="directory">lib</filename>, Beispiele der bereits in &cantor; implementierten Module im Ordner <filename role="directory">plugins</filename>.

source: Questions and Answers
de: Fragen und Antworten

source: The Menu Item <guimenuitem>Typeset using LaTeX</guimenuitem> is not available
de: Der Menüeintrag <guimenuitem>Schriftsatz mit Hilfe von LaTeX</guimenuitem> ist nicht vorhanden

source: Not every backend supports every option. Current version supports &latex; output for Maxima, Qalculate! and Sage backends.
de: Diese Funktion wird nicht von allen Modulen unterstützt. In der aktuellen Version wird die &latex;-Ausgabe mit den Modulen Maxima, Qalculate! und Sage unterstützt.

source: I have installed Sage/Maxima, but the appropriate backend does not appear.
de: Ich habe Sage/Maxima installiert, aber das zugehörige Modul wird nicht angezeigt.

source: One possible explanation is that &cantor; did not correctly detect the location. Go to the <menuchoice><guimenu>Settings</guimenu><guimenuitem>Configure &kappname;...</guimenuitem></menuchoice> dialog and change the <guilabel>Path</guilabel> to the appropriate application.
de: Möglicherweise hat &cantor; den Pfad zu diesen Modulen nicht gefunden. Öffnen Sie den Einrichtungsdialog mit <menuchoice><guimenu>Einstellungen</guimenu><guimenuitem>&kappname; einrichten ...</guimenuitem></menuchoice> und stellen Sie dort den Pfad zu den Programmen richtig ein.

source: What a peculiar name - what does it have to do with mathematics?
de: Was hat der eigenartige Name des Programms mit Mathematik zu tun?

source: &cantor; is named after the German mathematician <ulink url="http://en.wikipedia.org/wiki/Georg_Cantor">Georg Cantor</ulink>, the creator of set theory.
de: Das Programm ist nach dem deutschen Mathematiker <ulink url="http://en.wikipedia.org/wiki/Georg_Cantor">Georg Cantor</ulink> benannt, dem Entdecker der Mengenlehre.

source: Credits and License
de: Danksagungen und Lizenz

source: Program copyright 2009-2011 Alexander Rieder <email>alexanderrieder@gmail.com</email>
de: Programm Copyright 2009-2011 Alexander Rieder <email>alexanderrieder@gmail.com</email>

source: Documentation Copyright &copy; 2009-2011 Alexander Rieder <email>alexanderrieder@gmail.com</email>
de: Dokumentation Copyright &copy; 2009-2011 Alexander Rieder <email>alexanderrieder@gmail.com</email>

source: CREDIT_FOR_TRANSLATORS
de: <para>Übersetzung Burkhard Lück<email>lueck@hube-lueck.de</email></para>

source: How to obtain &cantor;
de: Bezugsquellen von &cantor;

source: Requirements
de: Systemanforderungen

source: In order to successfully use &cantor;, you need &kde; 4. If you want support for type-setting to be enabled, you need to install &latex; and LibSpectre. To use the different Backends, the appropriate math package is required.
de: &cantor; läuft nur unter &kde; 4. Möchten Sie den LaTeX-Schriftsatz benutzen, müssen die Programme &latex; und LibSpectre installiert sein. Für die verschiedenen Berechnungsmodule ist jeweils das zugehörige Mathematikpaket erforderlich.

source: Compilation and Installation
de: Kompilieren und Installation

source: Configuration
de: Einstellungen

source: Depending on your system, you may need to adjust the paths to the different applications used by &cantor;.
de: Abhängig von Ihrem System müssen eventuell die Pfade zu den verschiedenen von &cantor; genutzten Programmen angepasst werden.
