Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdeedu/cantor.po
Languages: de

source: The &cantor; Handbook
de: Das Handbuch zu &cantor;

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Burkhard</firstname><surname>Lück</surname><affiliation><address><email>lueck@hube-lueck.de</email></address></affiliation><contrib>Übersetzung</contrib></othercredit>

source: &cantor; is an application, aimed at providing a nice worksheet view to other Free Software Math packages.
de: &cantor; ist ein Programm, das ein Arbeitsblatt als grafische Bedienungsoberfläche für andere freie Mathematikpakete zu Verfügung stellt.

source: mathematics
de: Mathematik

source: math
de: Mathe

source: Introduction
de: Einleitung

source: &cantor; is an application to allow you to you use your favorite mathematical applications from within an elegant &kde;-integrated Worksheet Interface. It provides dialogs to assist with common tasks and allows you to share your worksheets with others.
de: &cantor; ist ein Programm, um Ihre Lieblings-Mathematikpakete in &kde; mit einem Arbeitsblatt als grafische Schnittstelle zu benutzen. Dialoge unterstützen Sie bei häufig vorkommenden Aufgaben und Sie können Arbeitsblätter mit anderen gemeinsam nutzen.

source: Using &cantor;
de: &cantor; benutzen

source: Screenshot:
de: Bildschirmfoto:

source: Here is a screenshot of &cantor;
de: Ein Bildschirmfoto von &cantor;

source: Screenshot
de: Bildschirmfoto

source: &cantor; features
de: Leistungsmerkmale von &cantor;

source: Intuitive worksheet view for evaluating expressions.
de: Intuitive Arbeitsblattansicht zur Berechnung von Ausdrücken.

source: Results of graph plotting shown inside the worksheet.
de: Graphische Ausgaben werden im Arbeitsblatt dargestellt.

source: Easy plugin-based structure to allow different backends to be added.
de: Modulbasierte Struktur, daher können verschiedene Module hinzugefügt werden.

source: GetHotNewStuff integration to allow example worksheets to be downloaded (or uploaded.)
de: Mit der Funktion „Neue Erweiterungen“ können Beispiel-Arbeitsblätter aus dem Internet herunter- oder hochgeladen werden.

source: Mathematical formula typesetting using &latex;.
de: Schriftsatz für mathematische Formeln mit Hilfe von &latex;.

source: Backend-aware syntax highlighting.
de: Syntaxhervorhebung passend zum verwendeten Modul.

source: Plugin-based assistant dialogs to help with common tasks, such as integrating a function, or entering a matrix.
de: Abhängig vom verwendeten Modul gibt es Assistenten als Dialoge für häufig vorkommende Aufgaben wie die Integration einer Funktion oder die Eingabe einer Matrix.

source: The &cantor; backends
de: Die Module von &cantor;

source: &cantor; offers you several choices for the backends you wish to use with it. The choice to make depends on what you want to achieve.
de: In &cantor; stehen mehrere Module zur Auswahl, je nach Aufgabenstellung wählen Sie das am besten geeignete Modul aus.

source: Currently the following backends are available:
de: Zur Zeit sind folgende Module vorhanden:

source: Sage is a free open-source mathematics software system licensed under the GPL. It combines the power of many existing open-source packages, within a common Python-based interface. See <ulink url="http://sagemath.org">http://sagemath.org</ulink> for more information.
de: Sage ist ein unter der GPL lizenziertes freies Mathematik-Software-System.Es kombiniert die Stärken vieler Open-Source-Pakete mit einer gemeinsamen Python-basierten Schnittstelle. Weitere Informationen finden Sie auf der Webseite <ulink url="http://sagemath.org">http://sagemath.org</ulink>.

source: Maxima is a system for the manipulation of symbolic and numeric expressions, including differentiation, integration, Taylor series, Laplace transforms, ordinary differential equations, systems of linear equations, polynomials, sets, lists, vectors, matrices, and tensors. Maxima yields high-precision numeric results by using exact fractions, arbitrary precision integers, and variable precision floating point numbers. Maxima can plot functions and data in two and three dimensions. See <ulink url="http://maxima.sourceforge.net">http://maxima.sourceforge.net</ulink> for more information.
de: Maxima ist ein System für die Manipulation von symbolischen und numerischen Ausdrücken, einschließlich Differenzierung, Integration, Taylorreihe, Laplace-Transformation, gewöhnliche Differentialgleichungen, lineare Gleichungssysteme, Polynome und Mengen, Listen, Vektoren, Matrizen und Tensoren. Durch exakte Brüche sowie Langzahlarithmetik und Gleitkommazahlen mit beliebiger Genauigkeit (arbitrary precision) erzeugt Maxima Ergebnisse mit hoher numerischer Präzision. Maxima kann Funktionen und Daten zwei- und dreidimensional grafisch darstellen. Weitere Informationen finden Sie auf der Webseite <ulink url="http://maxima.sourceforge.net">http://maxima.sourceforge.net</ulink>.

source: R is a language and environment for statistical computing and graphics, similar to the S language and environment. It provides a wide variety of statistical (linear and nonlinear modelling, classical statistical tests, time-series analysis, classification, clustering, ...) and graphical techniques, and is highly extensible. The S language is often the vehicle of choice for research in statistical methodology, and R provides an open-source route to this. See <ulink url="http://www.r-project.org">http://www.r-project.org</ulink> for more information.
de: „R“ ist eine Sprache und eine Umgebung für statistische Berechnungen und Grafiken, ähnlich zur Sprache und Umgebung „S“. Es stellt eine große Auswahl an statistischen (lineare und nicht lineare Modellierung, klassische statistische Tests, Zeitreihenanalyse, Klassifikation, Clustering, ...) und grafischen Techniken bereit und lässt sich stark erweitern. Die Sprache „S“ ist oft das bevorzugte Mittel für Forschungen mit statistischer Methodologie und „R“ stellt die Open-Source-Mittel für die Teilnahme an diesen Aktivitäten bereit. Weitere Informationen finden Sie auf der Webseite <ulink url="http://www.r-project.org">http://www.r-project.org</ulink>.

source: &kalgebra; is a MathML-based graph calculator, that ships with &kde; Education project. See <ulink url="http://edu.kde.org/kalgebra/">http://edu.kde.org/kalgebra/</ulink> for more information.
de: &kalgebra; ist ein grafischen Mathematikprogramm auf der Basis von MathML. Es ist im Projekt &kde;-Lernprogramme enthalten. Weitere Informationen finden Sie auf der Webseite <ulink url="http://edu.kde.org/kalgebra/">http://edu.kde.org/kalgebra/</ulink>.

source: Qalculate! is not your regular software replication of the cheapest available calculator. Qalculate! aims to make full use of the superior interface, power and flexibility of modern computers. The center of attention in Qalculate! is the expression entry. Instead of entering each number in a mathematical expression separately, you can directly write the whole expression and later modify it. The interpretation of expressions is flexible and fault tolerant, and if you nevertheless do something wrong, Qalculate! will tell you so. Not fully solvable expressions are however not errors. Qalculate! will simplify as far as it can and answer with an expression. In addition to numbers and arithmetic operators, an expression may contain any combination of variables, units, and functions. See <ulink url="http://qalculate.sourceforge.net/">http://qalculate.sourceforge.net/</ulink> for more information.
de: Qalculate! ist mehr als nur ein einfacher Rechner und nutzt die Schnittstellen, Rechenleistung und Flexibilität moderner Rechner aus. Der wichtigste Begriff in Qalculate! ist der Ausdruck. Anstatt jede Zahl in mathematischen Ausdrücken einzeln einzugeben, schreiben Sie den gesamten Ausdruck und bearbeiten ihn dann. Die Interpretation der Ausdrücke ist flexibel und fehlertolerant. Bei fehlerhaften Eingaben erhalten Sie Hinweise zur Korrektur. Nicht vollständig lösbare Ausdrücke führen aber nicht zu Fehlern, sondern diese Ausdrücke werden durch Qalculate! soweit wie möglich vereinfacht und als geänderter Ausdruck zurückgegeben. Zusätzlich zu Zahlen und arithmetischen Operatoren darf ein Ausdruck eine beliebige Kombination von Variablen, Einheiten und Funktionen enthalten. Weitere Informationen finden Sie auf <ulink url="http://qalculate.sourceforge.net/">http://qalculate.sourceforge.net/</ulink>.

source: Python is a remarkably powerful dynamic programming language that is used in a wide variety of application domains. There are several Python packages to scientific programming.
de: Python ist eine außergewöhnlich leistungsfähige dynamische Programmiersprache, die in vielen verschiedenen Anwendungsbereichen benutzt wird. Es gibt mehrere Python-Pakete für wissenschaftliche Programmierung.

source: Python is distributed under Python Software Foundation license (GPL compatible). See the <ulink url="http://www.python.org/">official website</ulink> for more information.
de: Python wird unter der „Python Software Foundation“-Lizenz (kompatibel zur GPL) verbreitet. Weitere Informationen dazu finden Sie auf <ulink url="http://www.python.org/">offiziellen Webseite</ulink>.

source: This backend adds an additional item to the &cantor;'s main menu, <guimenu>Package</guimenu>. The only item of this menu is <menuchoice><guimenu>Package</guimenu><guimenuitem>Import Package</guimenuitem></menuchoice>. This item can be used to import Python packages to the worksheet.
de: Diese Modul fügt den zusätzlichen Eintrag <guimenu>Paket</guimenu> zum Hauptmenü von &cantor; hinzu. Benutzen Sie dann <menuchoice><guimenu>Paket</guimenu><guimenuitem>Paket importieren</guimenuitem></menuchoice>, um Python-Pakete in das Arbeitsblatt zu importieren.

source: This backend supports Python 2 only.
de: Diese Modul unterstützt nur Python 2.

source: Scilab is an free software, cross-platform numerical computational package and a high-level, numerically oriented programming language.
de: Scilab ist ein freies Softwarepaket für numerische Berechnungen für verschiedene Betriebssysteme und eine höhere Programmiersprache für numerische Probleme.

source: Scilab is distributed under CeCILL license (GPL compatible). See <ulink url="http://www.scilab.org/">http://www.scilab.org/</ulink> for more information.
de: Scilab wird unter der CeCILL-Lizenz (kompatibel zur GPL) verbreitet. Weitere Informationen dazu finden Sie auf <ulink url="http://www.scilab.org/">http://www.scilab.org/</ulink>.

source: You need Scilab version 5.5 or higher to be installed in your system to make this backend usable.
de: Scilab in Version 5.5 oder neuer muss auf Ihrem System installiert sein, damit Sie mit diesem Modul arbeiten können.

source: &GNU; Octave is a high-level language, primarily intended for numerical computations. It provides a convenient command line interface for solving linear and nonlinear problems numerically, and for performing other numerical experiments using a language that is mostly compatible with <ulink url="http://www.mathworks.com/products/matlab/">MATLAB</ulink>. See <ulink url="http://www.gnu.org/software/octave/">http://www.gnu.org/software/octave/</ulink> for more information.
de: &GNU; Octave ist eine „höhere Programmiersprache“, die hauptsächlich für numerische Berechnungen vorgesehen ist. Sie stellt eine praktische Befehlszeilenoberfläche für das numerische Lösen von linearen und nichtlinearen Problemen und für das Durchführen von anderen numerischen Experimenten bereit. Die Sprache ist dabei weitestgehend kompatibel zu <ulink url="http://www.mathworks.com/products/matlab/">Matlab</ulink>. Weitere Informationen finden Sie unter <ulink url="http://www.gnu.org/software/octave/">http://www.gnu.org/software/octave/</ulink>.

source: Lua is a fast and lightweight scripting language, with a simple procedural syntax. There are several libraries in Lua aimed at math and science.
de: Lua ist eine schnelle und leichtgewichtige Skript-Sprache mit einer einfachen prozeduralen Syntax. Es gibt mehrere Bibliotheken für Mathematik und Wissenschaft in Lua.

source: See <ulink url="http://www.lua.org/">http://www.lua.org/</ulink> for more information.
de: Weitere Informationen dazu finden Sie auf <ulink url="http://www.lua.org/">http://www.lua.org/</ulink>.

source: This backend supports <ulink url="http://luajit.org/">luajit 2</ulink>.
de: Dieses Modul unterstützt <ulink url="http://luajit.org/">luajit 2</ulink>.

source: The &cantor; Workspace
de: Der Arbeitsbereich von &cantor;

source: <screeninfo>Screenshot of the &cantor; Workspace</screeninfo>
de: <screeninfo>Der Arbeitsbereich von &cantor;</screeninfo>

source: <phrase>Screenshot of the &cantor; Workspace</phrase>
de: <phrase>Der Arbeitsbereich von &cantor;</phrase>

source: The Worksheet interface of &cantor; consists of three parts:
de: Der Arbeitsbereich von &cantor; besteht aus drei Teilen:

source: The tab bar, where you can switch through the open worksheets.
de: Der Karteireiterleiste, mit der Sie zwischen den geöffneten Arbeitsblättern wechseln können.

source: A help panel, where help for a specific command is displayed if you enter "? command".
de: Einem Hilfebereich, hier werden Informationen zu den Befehlen angezeigt, wenn Sie „? befehl“ eingeben.

source: A Variable Manager panel where you can see the list of all available variables on the current worksheet. The Help and Variable Manager panels are shown as tabs on a sidebar of a &cantor; window. Variable manager can be used for Maxima (if enabled on <menuchoice><guimenu>Settings</guimenu><guimenuitem>Configure &cantor;...</guimenuitem></menuchoice> <guilabel>Maxima</guilabel> page), &kalgebra;, Octave, Python2, Qalculate, and Scilab backends only.
de: Einer Seitenleiste mit der Variablen-Verwaltung, in der eine Liste aller verfügbaren Variablen auf dem aktuellen Arbeitsblatt angezeigt wird. Die Seitenleiste von &cantor; enthält Karteikarten mit Hilfe und der Variablen-Verwaltung. Die Variablen-Verwaltung kann mit Maxima (wenn auf der Seite <menuchoice><guimenu>Einstellungen</guimenu><guimenuitem>&cantor; einrichten ...</guimenuitem></menuchoice> <guilabel>Maxima</guilabel>aktiviert) und mit &kalgebra;, Octave, Python2, Qalculate und Scilab verwendet werden.

source: The worksheet itself.
de: Dem Arbeitsblatt selbst.

source: The Worksheet
de: Das Arbeitsblatt

source: The worksheet is the basic area for working with &cantor;. Using it, you can enter expressions, allow the backend to perform calculations, and look at the results. The commands the worksheets accept depend on the chosen backend, so you should learn the appropriate backend syntax (the Show Help button takes you there directly). If you know the command, but you need additional information, you can type "? <replaceable>command</replaceable>", and contextual help will appear on the right of the worksheet. If you want to see some example worksheets, you can go to <guimenuitem>Download Example Worksheets</guimenuitem> in the <guimenu>File</guimenu> menu, and download worksheets other users have published.
de: Das Arbeitsblatt ist der wichtigste Bereich für die Arbeit mit &cantor;. Hier geben Sie Ausdrücke ein, lassen sie vom Modul auswerten und hier werden die Ergebnisse angezeigt. Die Befehle, die im Arbeitsblatt benutzt werden können, sind durch das ausgewählte Modul vorgeben. Daher sollten Sie die Syntax des gewählten Moduls lernen. Im Menü „Hilfe“ finden Sie einen Eintrag für das aktuell benutzte Modul, damit können Sie die Dokumentation des Moduls online lesen. Brauchen Sie zu einem bekannten Befehl weitere Hilfe, geben Sie "? <replaceable>befehl</replaceable>" ein, dann wird die Dokumentation zum Befehl rechts im Arbeitsblatt angezeigt. Möchten Sie einige Beispielarbeitsblätter laden, wählen Sie <guimenuitem>Beispielarbeitsblatt herunterladen</guimenuitem> im Menü <guimenu>Datei</guimenu>. Dann können Sie von anderen Benutzern veröffentlichte Arbeitsblätter herunterladen.

source: To control each command entry of the worksheet you can use control buttons shown at the right part of the worksheet when hovering the entry field with a mouse cursor. There are three basic actions for each entry: <guilabel>Evaluate Entry</guilabel> to update the result of calculations for the entry, <guilabel>Drag Entry</guilabel> to move the entry at the other place of the current worksheet and <guilabel>Remove Entry</guilabel> to remove the entry from the current worksheet.
de: Um jeden Befehlseintrag im Arbeitsblatt zu kontrollieren, verwenden Sie die Knöpfe, die rechts im Arbeitsblatt angezeigt werden, wenn der Mauszeiger über einem Eingabefeld steht. Es gibt drei grundlegende Aktionen für jeden Eintrag. Mit <guilabel>Eintrag auswerten</guilabel> wird das Ergebnis der Berechnung dieses Eintrags aktualisiert, mit <guilabel>Eintrag ziehen</guilabel> kann der Eintrag an eine anderen Platz im Arbeitsblatt verschoben werden und mit <guilabel>Eintrag entfernen</guilabel> wird ein Eintrag vom aktuellen Arbeitsblatt gelöscht

source: Font settings and alignment of worksheet entries can be changed using a toolbar above the worksheet.
de: Einstellungen für Schriften und die Ausrichtung von Elementen im Arbeitsblatt können mit den Aktionen in der Werkzeugleiste über dem Arbeitsblatt geändert werden.

source: Settings
de: Einstellungen

source: The <guimenu>Settings</guimenu> menu allows you to change some settings of the appearance of your current worksheet.
de: Im Menü <guimenu>Einstellungen</guimenu> kann das Erscheinungsbild des aktuellen Arbeitsblatts geändert werden.

source: Typesetting using &latex;
de: Schriftsatz mit Hilfe von &latex;

source: This setting changes the way results are presented to you. If enabled, it passes the result through the &latex; system, to produce visually appealing formulas. For example, <quote>3*x^2*sqrt(2)*x+2/3</quote> becomes
de: Diese Einstellung ändert die Anzeige von Ergebnissen. Ist sie aktiviert, werden die Ergebnisse vor der Anzeige vom &latex;-System bearbeitet. Damit wird eine ansprechende Darstellung der Formeln möglich. Aus <quote>3*x^2*sqrt(2)*x+2/3</quote> zum Beispiel wird

source: Syntax Highlighting
de: Syntaxhervorhebung aktivieren

source: Syntax Highlighting increases the readability of code, by highlighting keywords, or matching brackets in different colors.
de: Syntaxhervorhebung verbessert die Lesbarkeit des Quelltextes, indem Schlüsselworte oder zusammengehörige Klammern farblich hervorgehoben werden.

source: Completion
de: Vervollständigung

source: When this is enabled, &cantor; will show you possible completions for the command you are currently typing when you press the Tab-key. If there is only one choice remaining, it will insert the rest of the command for you.
de: Ist dies aktiviert, zeigt &cantor; bei der Eingabe eine Liste aller mit den bisher eingetippten Buchstaben beginnenden Befehle an, wenn die Tabulatortaste gedrückt wird. Gibt es nur noch einen passenden Befehl, wird er vervollständigt.

source: Line Numbers
de: Zeilennummern

source: This setting controls whether the different expressions should have a number in front. This allows you to recall older results - in Maxima, for instance, this is done with the <quote>%O1</quote> command.
de: Mit dieser Einstellung legen Sie fest, ob die Ausdrücke mit einer Zeilennummer gekennzeichnet werden sollen. Damit können vorher bereits eingegebene Ergebnisse wieder aufgerufen werden - in Maxima funktioniert dies zum Beispiel mit dem Befehl <quote>%O1</quote>.

source: Animate Worksheet
de: Arbeitsblatt animieren

source: This setting controls whether the different animations will be used to highlight changes on a worksheet.
de: Ist diese Einstellung aktiv. werden verschiedene Animationen verwendet, um Änderungen auf einem Arbeitsblatt hervorzuheben.

source: Command Reference
de: Befehlsreferenz

source: The main &cantor; window
de: Das Hauptfenster von &cantor;

source: &cantor; has the common &kde; menu items, for more information read the <ulink url="help:/fundamentals/ui.html#menus">Menu</ulink> chapter of the &kde; Fundamentals.
de: &cantor; benutzt die bekannten &kde;-Menüeinträge, weitere Informationen dazu finden Sie im Kapitel <ulink url="help:/fundamentals/ui.html#menus">Menüs</ulink> der &kde;-Grundlagen.

source: Additional or special menu items in &cantor;:
de: Zusätzliche oder besondere Menüeinträge in &cantor;:

source: The File Menu
de: Das Menü Datei

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>New</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl; <keycap>N</keycap></keycombo></shortcut> <guimenu>Datei</guimenu> <guimenuitem>Neu</guimenuitem>

source: Creates a new worksheet with the default backend.
de: Erstellt ein neues Arbeitsblatt mit dem Standardmodul.

source: <guimenu>File</guimenu> <guisubmenu>New</guisubmenu> <guimenuitem><replaceable>Backend</replaceable></guimenuitem>
de: <guimenu>Datei</guimenu> <guisubmenu>Neu</guisubmenu> <guimenuitem><replaceable>Modul</replaceable></guimenuitem>

source: Creates a new worksheet with the chosen backend.
de: Erstellt ein neues Arbeitsblatt mit dem ausgewählten Modul.

source: <guimenu>File</guimenu> <guimenuitem>Download Example Worksheets</guimenuitem>
de: <guimenu>Datei</guimenu> <guimenuitem>Beispielarbeitsblatt herunterladen</guimenuitem>

source: Opens the dialog to download examples uploaded by other &cantor; users with <ulink url="http://userbase.kde.org/Special:MyLanguage/Glossary#Get_Hot_New_Stuff">GetHotNewStuff</ulink>.
de: Öffnet einen Dialog, um Beispiele, die von anderen Benutzer von &cantor; veröffentlicht wurden, mit der Funktion <ulink url="http://userbase.kde.org/Special:MyLanguage/Glossary#Get_Hot_New_Stuff">Neue Erweiterungen</ulink> herunterzuladen.

source: <guimenu>File</guimenu> <guimenuitem>Open Example</guimenuitem>
de: <guimenu>Datei</guimenu> <guimenuitem>Beispieldatei öffnen</guimenuitem>

source: <action>Opens the dialog to choose an example to load.</action> The examples should be downloaded with <menuchoice><guimenu>File</guimenu> <guimenuitem>Download Example Worksheets</guimenuitem></menuchoice> beforehand.
de: <action>Öffnet einen Dialog, um eine Beispiel auszuwählen und zu laden</action>. Die Beispiele können zum Beispiel vorher mit <menuchoice><guimenu>Datei</guimenu> <guimenuitem>Beispielarbeitsblatt herunterladen</guimenuitem></menuchoice> auf der Festplatte gespeichert werden.

source: <guimenu>File</guimenu> <guimenuitem>Save Plain Text</guimenuitem>
de: <guimenu>Datei</guimenu> <guimenuitem>Als einfache Textdatei speichern</guimenuitem>

source: Allows saving the current worksheet as a plain text document.
de: Ermöglicht das Speichern des aktuellen Arbeitsblatts als einfaches Textdokument.

source: <guimenu>File</guimenu> <guimenuitem>Export to LaTeX</guimenuitem>
de: <guimenu>Datei</guimenu> <guimenuitem>LaTeX-Export</guimenuitem>

source: Allows saving the current worksheet as a &latex; document.
de: Ermöglicht das Speichern des aktuellen Arbeitsblatts als &latex;-Dokument.

source: <guimenu>File</guimenu> <guimenuitem>Publish Worksheet</guimenuitem>
de: <guimenu>Datei</guimenu> <guimenuitem>Arbeitsblatt veröffentlichen</guimenuitem>

source: Opens the dialog to publish your current worksheet and make it available to other &cantor; users through <ulink url="http://userbase.kde.org/Special:MyLanguage/Glossary#Get_Hot_New_Stuff">GetHotNewStuff</ulink>.
de: Öffnet einen Dialog, um Ihr aktuelles Arbeitsblatt zu veröffentlichen und anderen Benutzer von &cantor; über die Funktion <ulink url="http://userbase.kde.org/Special:MyLanguage/Glossary#Get_Hot_New_Stuff">„Neue Erweiterungen“ veröffentlichen</ulink> zur Verfügung zu stellen.

source: <guimenu>File</guimenu> <guimenuitem>Run Script</guimenuitem>
de: <guimenu>Datei</guimenu> <guimenuitem>Skript ausführen</guimenuitem>
