Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdeedu/kalzium.po
Languages: de

source: The &kalzium; Handbook
de: Das Handbuch zu &kalzium;

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Thorsten</firstname><surname>Mürell</surname><affiliation><address><email>thorsten@muerell.de</email></address></affiliation><contrib>Deutsche Übersetzung</contrib></othercredit><othercredit role="translator"><firstname>Christoph</firstname><surname>Hamann</surname><affiliation><address><email>chhamann@gmx.de</email></address></affiliation><contrib>Deutsche Übersetzung</contrib></othercredit>

source: &kalzium; is a program which shows you the Periodic Table of Elements. You can use &kalzium; to search for information about the elements or to learn facts about the periodic table.
de: &kalzium; ist ein Programm, das Ihnen das Periodensystem der Elemente (<acronym>PSE</acronym>) zeigt. Sie können &kalzium; benutzen, um nach Informationen über Elemente zu suchen oder um Fakten über das <acronym>PSE</acronym> zu lernen.

source: education
de: Bildung

source: elements
de: Elemente

source: chemistry
de: Chemie

source: Introduction
de: Einführung

source: &kalzium; provides you with all kinds of information about the Periodic Table of the Elements. You can lookup lots of information about the elements and also use visualizations to show them. It is free and licensed under the &GNU; Public License.
de: &kalzium; bietet Ihnen alle Informationen über das <acronym>PSE</acronym> (Periodensystem der Elemente). Sie können viele Informationen über die Elemente nachschlagen und die Elemente auch nach verschiedenen Kriterien farbig hervorheben. &kalzium; ist frei und lizenziert unter der &GNU; Public License.

source: You can visualize the Periodic Table of the Elements by groups, blocks, and families. You can plot data for a range of elements for properties like the boiling point or the atomic mass. You can go back in time and see what elements were known at a given date. You can also calculate the molecular mass of molecules.
de: Sie können im Periodensystem die Elemente nach Gruppen, Blöcken und Familien durch Farben markieren. Für einen Bereich von Elementen können Sie Daten grafisch darstellen (Gewicht, Masse pro Neutron, Ionisationsenergie, zweite Ionisationsenergie, Elektronegativität). Und es gibt eine Zeitleiste, mit der Sie für ein bestimmtes Datum alle damals bekannten Elemente anzeigen lassen können. Auch gibt es einen Rechner, mit dem Sie molekulare Masse von Molekülen berechnen können.

source: &kalzium; quick start guide
de: &kalzium; Kurzanleitung

source: Here is &kalzium; the first time you run it, either by selecting <menuchoice><guimenu>Applications</guimenu> <guisubmenu>Edutainment</guisubmenu><guisubmenu>Science</guisubmenu><guimenuitem>&kalzium;</guimenuitem></menuchoice> from the &kmenu; or with <keycombo action="simul">&Alt;<keycap>F2</keycap></keycombo> and entering <command>kalzium</command> into the field.
de: Hier sehen Sie &kalzium; beim ersten Start, entweder aus dem &kmenu; <menuchoice><guimenu>Programme</guimenu> <guisubmenu>Lernprogramme</guisubmenu><guisubmenu>Wissenschaft</guisubmenu><guimenuitem>&kalzium;</guimenuitem></menuchoice> oder mit <keycombo action="simul">&Alt;<keycap>F2</keycap></keycombo> und der Eingabe <command>kalzium</command>.

source: <screeninfo>&kalzium; main window</screeninfo>
de: <screeninfo>Das Hauptfenster von &kalzium;</screeninfo>

source: <phrase>&kalzium; main window</phrase>
de: <phrase>Das Hauptfenster von &kalzium;</phrase>

source: &kalzium; is divided in an information panel on the left (in red), the table view (in blue) which shows the elements of the periodic table, and a legend panel at the bottom (in green). The standard menubar allows you to choose what you want to display and the status bar reports facts. The table view and the panels can be hidden using the corresponding items in <guimenu>View</guimenu> menu. For example, you can hide the information panel with <menuchoice> <guimenu>View</guimenu> <guimenuitem>Information</guimenuitem> </menuchoice>.
de: Das Hauptfenster von &kalzium; ist unterteilt in eine Seitenleiste links im Hauptfenster (Rot), in das Periodensystem der Elemente auf der rechten Seite (Blau) und die Legende unten (Grün). Das Standardmenü erlaubt Ihnen, die Art der Anzeige des Periodensystems auszuwählen, und die Statuszeile zeigt weitere Informationen an. Sie können die Seitenleiste, die Tabelleninformation und die Legende mit den zugehörigen Einträgen im Menü <guimenu>Ansicht</guimenu> ausblenden. Für die Leiste Informationen wählen Sie dazu im Menü <menuchoice> <guimenu>Ansicht</guimenu> <guimenuitem>Informationen</guimenuitem> </menuchoice>.

source: When you move the mouse cursor on an element of the table, an overview of the current element is displayed in the <guilabel>Overview</guilabel> tab of the information panel.
de: Wenn Sie den Mauszeiger über ein Element im Periodensystem bewegen, wird eine kurze Information über dieses Element in der Seitenleiste „Informationen“ auf der Karteikarte <guilabel>Übersicht</guilabel> angezeigt.

source: You can choose several views for the table: classic periodic table, short periodic table, long periodic table, &etc; It is also possible to change numeration scheme or display the elements per families, per groups, per crystal structure, depending on their acidic behavior, &etc; You can change all that in the <guimenu>View</guimenu> menu.
de: Sie können unterschiedliche Ansichten für das Periodensystem auswählen: Klassisches Periodensystem, Kurzperiodensystem, Langperiodensystem &etc; Das Nummerierungsschema lässt sich ändern und die Elemente lassen sich mit Kennzeichnung von Familie, Gruppe, Kristallstruktur und dem Säureverhalten, &etc; anzeigen. Alles dies können Sie im Menü <guimenu>Ansicht</guimenu> ändern.

source: If you want to know facts about a precise element, click on it in the table and the information dialog will be displayed.
de: Wenn Sie genauere Informationen über ein Element erhalten wollen, klicken Sie im Periodensystem auf das betreffende Element und der ausführliche Informationsdialog wird angezeigt.

source: <screeninfo>Information dialog</screeninfo>
de: <screeninfo>&kalzium;s ausführlicher Informationsdialog</screeninfo>

source: <phrase>Information dialog</phrase>
de: <phrase>&kalzium;s ausführlicher Informationsdialog</phrase>

source: You can plot data using the <menuchoice> <guimenu>Tools</guimenu> <guimenuitem>Plot Data...</guimenuitem> </menuchoice> menu item. You choose what you want to plot on the y-axis and a range of elements to plot that for on the x-axis. The screenshot below shows the atomic mass of the elements 1 to 10.
de: Sie können sich Daten grafisch darstellen lassen, indem Sie <menuchoice><guimenu>Extras</guimenu><guimenuitem>Daten grafisch darstellen ...</guimenuitem></menuchoice> wählen. Für die y-Achse wählen Sie, was Sie grafisch darstellen wollen und für die x-Achse die Anzahl der Elemente, die dargestellt werden sollen. Das Bildschirmfoto unten zeigt die Atommasse der Elemente 1 bis 10 in der grafischen Darstellung.

source: <screeninfo>The Plot Data dialog</screeninfo>
de: <screeninfo>Der Dialog zur grafischen Anzeige</screeninfo>

source: <phrase>The Plot Data dialog</phrase>
de: <phrase>Der Dialog zur grafischen Anzeige</phrase>

source: The Glossary (<menuchoice> <guimenu>Tools</guimenu> <guimenuitem>Glossary...</guimenuitem> </menuchoice>) explains the most important chemical words and shows you pictures of the most common tools along with an explanation.
de: Das Glossar (<menuchoice><guimenu>Extras</guimenu><guimenuitem>Glossar ...</guimenuitem> </menuchoice>) erklärt die wichtigsten chemischen Fachbegriffe und zeigt Bilder der gebräuchlichsten Geräte zusammen mit einer Beschreibung.

source: <screeninfo>The Glossary</screeninfo>
de: <screeninfo>Das Glossar</screeninfo>

source: <phrase>The Glossary</phrase>
de: <phrase>Das Glossar</phrase>

source: Using &kalzium;
de: &kalzium; benutzen

source: Overview of &kalzium; usage
de: Übersicht zur Benutzung von &kalzium;

source: &kalzium; is very easy to use. It is specially designed for students of all ages to use as a small and quick database.
de: Sie sehen, dass &kalzium; einfach zu benutzen ist und nützlich für alle für Studierende aller Altersstufen. Es ähnelt sehr einer schnellen und kleinen Datenbank.

source: Here is a screenshot of &kalzium; in action:
de: Hier ist ein Bildschirmfoto von &kalzium; in Aktion:

source: &kalzium; main screen, immediately after the first start
de: &kalzium; Hauptbildschirm direkt nach dem ersten Start

source: &kalzium; main screen
de: &kalzium; Hauptbildschirm

source: The information dialog
de: Der Informationsdialog

source: The information dialog is accessed by clicking with the &LMB; on any element. This is the place to get information about an element. With the buttons at the bottom of the dialog you can change the element which is displayed without closing the dialog.
de: Sie erreichen den Informationsdialog, wenn sie mit der &LMB; auf ein Element klicken. In diesem Dialog bekommen Sie alle Informationen zum jeweiligen Element. Mit den Knöpfen im unteren Teil des Dialogs können Sie ganz schnell auf das nächste Element wechseln, ohne den Dialog schließen zu müssen.

source: Data Overview
de: Daten-Übersicht

source: The <guilabel>Data Overview</guilabel> page tells you about different facts related to the element.
de: Die Seite <guilabel>Daten-Übersicht</guilabel> gibt Ihnen Informationen über verschiedene Energiedaten des ausgewählten Elements.

source: Depending on the data available in &kalzium; you will see different radii of the element. The covalent radius is the radius of a non charged atom of the element in a molecule. The could for example be the O-H-distance in Water. The atomic radius is the radius of an elemental atom, &eg; not bound to anything. The van der Waals-radius is defined as the distance of two atoms of the same sort in two equal molecules, for example two carbon-atoms in propane. The last possible radius is the ionic radius including its charge.
de: Abhängig von den vorhanden Daten in &kalzium; sehen Sie verschiedene Radien des Elements. Der Kovalenzradius ist der Radius eines nicht geladenen Atoms des Elements in einer Molekülverbindung. Das könnte &eg; der Abstand zwischen O-H in Wasser sein. Der atomare Radius hingegen ist der Radius des Atoms im elementaren Zustand, wenn es &eg; keinerlei Verbindung zu einem anderen Atom hat. Der Van-der-Waals-Radius ist als Abstand zwischen zwei Atomen der gleichen Art in zwei gleichen Molekülen definiert. Zum Beispiel zwei Kohlenstoffatome in Propan. Der letzte mögliche Radius ist der Radius eines ionisierten Atoms, der die Ladung enthält.

source: The mass of an element is the average mass of all isotopes in relation to their percentage.
de: Die Masse eines Elements ist der Durchschnitt der Massen aller Isotope in Relation zu ihrer prozentualen Häufigkeit.

source: <screeninfo>&kalzium; information dialog</screeninfo>
de: <screeninfo>&kalzium;s Informationsdialog</screeninfo>

source: <phrase>&kalzium; information dialog</phrase>
de: <phrase>&kalzium;s Informationsdialog</phrase>

source: Bohr Orbitals
de: Bohrsches Orbitalmodell

source: The <guilabel>Atom Model</guilabel> page displays the atomic shells. Every orbit stands for a atomic shell and every yellow circle represents an electron.
de: Die Seite <guilabel>Atommodell</guilabel> zeigt die Atomschalen an. Jedes Orbital steht für eine Atomschale und jeder gelbe Kugel stellt ein Elektron dar.

source: Isotopes
de: Isotope

source: The <guilabel>Isotopes</guilabel> page presents information about the isotopes of an element.
de: Die Seite <guilabel>Isotope</guilabel> gibt Ihnen Informationen über verschiedene Isotope des ausgewählten Elements.

source: Mass
de: Masse

source: The mass of this isotope.
de: Die Masse dieses Isotops.

source: Neutrons
de: Neutronen

source: The number of neutrons this isotope has.
de: Die Anzahl der Neutronen, die dieses Isotop besitzt.

source: Percentage
de: Prozent

source: The percentage of atoms occurring that are of this isotope type. Also called abundance.
de: Der Prozentsatz an vorkommenden Atomen, die von diesem Isotopentyp sind, wird auch Isotopenhäufigkeit genannt.

source: Half-life period
de: Halbwertszeit

source: Only unstable isotopes have a half-life period. It is defined as the time in which half the isotopes decay.
de: Nur instabile Isotope haben eine Halbwertszeit. Die Halbwertszeit ist als ein Zeitwert definiert, in dem die Hälfte des vorliegenden Isotops zerfallen ist.

source: Energy and Mode of Decay
de: Energie und Zerfallsart

source: Some isotopes are known to emit particle radiation under the process of radioactive decay. Each decay transformation has a typical energy release, which is listed along with the mode of decay.
de: Manche Isotope sind bekannt dafür, dass sie beim radioaktiven Zerfall Teilchenstrahlung aussenden. Jede Umwandlung durch radioaktiven Zerfall weist eine typische Energiemenge auf, die neben der Zerfallsart aufgelistet ist.

source: Spin and Parity
de: Spin und Parität

source: The spin of the nucleus and its parity.
de: Der Spin des Kerns und seine Parität.

source: Magnetic Moment
de: Magnetisches Dipolmoment

source: The magnetic dipole moment of the nucleus. Measured in units of the nuclear magneton.
de: Das magnetische Dipolmoment des Kerns. Wird in Einheiten des nuklearen Magnetons gemessen.

source: Miscellaneous
de: Sonstiges

source: The <guilabel>Miscellaneous</guilabel> page tells you other information about the current element, including when it was discovered and the origin of the name.
de: Die Seite <guilabel>Sonstiges</guilabel> gibt Ihnen weitere Informationen zum aktuellen Element, &eg; das Jahr, in dem es entdeckt wurde und die Herkunft des Namens.

source: Spectrum
de: Spektrum

source: The <guilabel>Spectrum</guilabel> page shows you elements spectrum. You can choose the range of the wavelengths, units and type of the spectrum. The intensity table can be seen at the right bottom part of the page.
de: Auf dieser Seite wird das Spektrum des ausgewählten Elements angezeigt. Der Bereich der angezeigten Wellenlängen und der Typ des Spektrums kann geändert werden. Rechts unten auf der Seite wird die Intensität als Tabelle dargestellt.

source: Extra Information
de: Zusätzliche Information

source: The <guilabel>Extra information</guilabel> page gives you the links to the element pages on Wikipedia, <ulink url="http://education.jlab.org/">Jefferson Lab</ulink>, and <ulink url="http://www.webelements.com/">WebElements</ulink>.
de: Auf der Seite <guilabel>Zusätzliche Informationen</guilabel> finden Sie Verknüpfungen zu Seiten über das Element in der Wikipedia, <ulink url="http://education.jlab.org/">Jefferson Lab</ulink>, und <ulink url="http://www.webelements.com/">WebElements</ulink>.

source: Tables
de: Tabellen

source: The periodic table can be presented in various ways. You can switch the table view from <guimenu>View</guimenu> menu or toolbar drop-down list.
de: Das Periodensystem kann auf mehrere Arten angezeigt werden. Die Anzeige wird im Menü <guimenu>Ansicht</guimenu> oder im Auswahlfeld in der Werkzeugleiste geändert.

source: The following options in the <menuchoice><guimenu>View</guimenu> <guimenuitem>Tables</guimenuitem></menuchoice> menu can be used to change the table shown:
de: Im Menü <menuchoice><guimenu>Ansicht</guimenu> <guimenuitem>Tabellen</guimenuitem></menuchoice> finden Sie folgende Optionen, um die Anzeige der Tabelle einzustellen:

source: Classic Periodic Table
de: Klassisches Periodensystem

source: <action>Display</action> the classic periodic table with all elements.
de: <action>Zeigt</action> das klassische Periodensystem mit allen Elementen an.

source: Short Periodic Table
de: Kurzperiodensystem

source: <action>Display</action> a periodic table without transition elements.
de: <action>Zeigt</action> ein Periodensystem ohne die Übergangselemente an. Zitat aus der deutschen Wikipedia: <quote>Die chemischen Elemente mit den Ordnungszahlen von 21 bis 30, 39 bis 48, 57 bis 80 und 89 bis 112 werden üblicherweise als Übergangselemente bezeichnet. Da diese Elemente alle Metalle sind, wird auch der Ausdruck Übergangsmetalle benutzt. Dieser Name ist in ihrer Position im Periodensystem begründet, da sich dort der Übergang durch die aufeinanderfolgende Zunahme von Elektronen in den d-Atomorbital entlang jeder Periode zeigt. Übergangselemente werden chemisch von der IUPAC als Elemente, die eine unvollständige d-Schale besitzen oder Ionen mit einer unvollständigen d-Schale ausbilden, definiert. </quote>

source: Long Periodic Table
de: Langperiodensystem

source: <action>Display</action> a periodic table with inner transition elements (f-elements) embedded.
de: <action>Zeigt</action> ein Periodensystem mit den Übergangselementen (F-Elemente) an. Zitat aus der deutschen Wikipedia: <quote>Die chemischen Elemente mit den Ordnungszahlen von 21 bis 30, 39 bis 48, 57 bis 80 und 89 bis 112 werden üblicherweise als Übergangselemente bezeichnet. Da diese Elemente alle Metalle sind, wird auch der Ausdruck Übergangsmetalle benutzt. Dieser Name ist in ihrer Position im Periodensystem begründet, da sich dort der Übergang durch die aufeinanderfolgende Zunahme von Elektronen in den d-Atomorbital entlang jeder Periode zeigt. Übergangselemente werden chemisch von der IUPAC als Elemente, die eine unvollständige d-Schale besitzen oder Ionen mit einer unvollständigen d-Schale ausbilden, definiert. </quote>

source: Transition Elements
de: Übergangselemente

source: <action>Display</action> a periodic table only with transition elements.
de: <action>Zeigt</action> ein Periodensystem nur mit den Übergangselementen an.

source: DZ Periodic Table
de: DZ-Periodensystem

source: This item represents the table the DZ <foreignphrase lang="de">Deutscher Zentralausschuss</foreignphrase> "German Central Committee" suggests.
de: Diese Darstellung des Periodensystems entspricht dem Vorschlag des <quote>Deutschen Zentralausschusses</quote> für Chemie.

source: Numeration
de: Nummerierung

source: The numeration is the way of numbering the 18 groups of the periodic table. You can change the numeration to <guilabel>IUPAC</guilabel>, <guilabel>old IUPAC</guilabel> or <guilabel>CAS</guilabel>, or you can switch it off entirely.
de: Die Nummerierung ist eine Möglichkeit, die 18 Gruppen im Periodensystem zu kennzeichnen. Sie können die Nummerierung auf <guilabel>IUPAC</guilabel>, <guilabel>IUPAC (alt)</guilabel> oder <guilabel>CAS</guilabel> einstellen oder sie ganz ausschalten.

source: The following options in the <menuchoice><guimenu>View</guimenu> <guimenuitem>Numeration</guimenuitem></menuchoice> menu can be used to change the numeration shown:
de: Im Menü <menuchoice><guimenu>Ansicht</guimenu> <guimenuitem>Nummerierung</guimenuitem></menuchoice> finden Sie folgende Optionen, um die Nummerierung einzustellen:

source: <guimenuitem>No Numeration</guimenuitem>: if this option is active, no period-numeration will be in effect.
de: <guimenuitem>Keine Nummerierung</guimenuitem>. Wenn diese Option angekreuzt ist, wird keine Hauptgruppennummerierung angezeigt.

source: <guimenuitem>IUPAC</guimenuitem> (default) is the <firstterm>International Union of Pure and Applied Chemistry</firstterm>. This is an organization which defines most of the standards for chemical concerns. The new IUPAC system numbers each column with Arabic numbers from 1 (one) through 18 (eighteen).
de: <guimenuitem>IUPAC</guimenuitem> (Standard): Die <acronym>IUPAC</acronym> ist die <firstterm>International Union of Pure and Applied Chemistry</firstterm> (deutsch etwa: Internationale Vereinigung der reinen und angewandten Chemie). Das ist eine Organisation, die die meisten Standards für Chemiekonzerne festlegt. Das neue UPAC System nummeriert die Spalten mit arabischen Ziffern von 1 (eins) bis 18 (achtzehn).

source: <guimenuitem>CAS</guimenuitem> is the <firstterm>Chemical Abstracts Service</firstterm>. In the CAS system the letters A and B were designated to main group elements (A) and transition elements (B). Though the <acronym>IUPAC</acronym> numeration is the official, the <acronym>CAS</acronym> numeration is what is still used in classrooms and laboratories.
de: <guimenuitem>CAS</guimenuitem>: Der <acronym>CAS</acronym> ist der <firstterm>Chemical Abstracts Service</firstterm>. Im CAS System werden die Buchstaben A und B benutzt, um die Elemente der Hauptgruppe (A) und die Übergangselemente (B) zu kennzeichnen. Obwohl die Benennung der <acronym>IUPAC</acronym> das offizielle System ist, wird die Nummerierung des <acronym>CAS</acronym> immer noch in Schulen und Labors benutzt.

source: The <guimenuitem>Old IUPAC</guimenuitem> system labeled columns with Roman numerals followed by either the letter <quote>A</quote> or <quote>B</quote>. Columns were numbered such that columns one through seven were numbered <quote>IA</quote> through <quote>VIIA</quote>, columns 8 through 10 were labeled <quote>VIIIA</quote>, columns 11 through 17 were numbered <quote>IB</quote> through <quote>VIIB</quote> and column 18 was numbered <quote>VIII</quote>. Because of the confusion the old IUPAC and the CAS system created, the IUPAC adopted their new system.
de: <guimenuitem>IUPAC (alt)</guimenuitem>: Das alte IUPAC System kennzeichnet die Spalten mit römischen Zahlen, gefolgt entweder vom Buchstaben <quote>A</quote> oder <quote>B</quote>. Die Spalten 1 bis 7 werden von <quote>IA</quote> bis <quote>VIIA</quote> nummeriert, die Spalten 8 bis 10 mit <quote>VIIIA</quote>, die Spalten 11 bis 17 mit <quote>IB</quote> bis <quote>VIIB</quote> und Spalte 8 mit <quote>VIII</quote>. Weil das alte IUPAC-und das CAS-System sehr verwirrend waren, hat die IUPAC ihr neues System eingeführt.

source: Color schemes
de: Farbschemata

source: &kalzium; can show you which elements are where with regard to their Periodic <quote>block</quote> and <quote>group</quote>, their behavior with acid and which state of matter (&ie; solid/liquid/vapor) they are in at a given temperature.
de: &kalzium; kann die Position des Elementes gemäß <quote>Block</quote> und <quote>Gruppe</quote> im Periodensystem, das Säureverhalten und den Aggregatzustand (&ie; fest, flüssig, gasförmig) bei einer gegebenen Temperatur anzeigen.

source: Color schemes can be changed in the <menuchoice><guimenu>View</guimenu> <guimenuitem>Scheme</guimenuitem></menuchoice> menu, toolbar drop-down list, or <link linkend="view_tab">View</link> tab of the Sidebar.
de: Die Farbschemata können Sie im Menü <menuchoice><guimenu>Ansicht</guimenu> <guimenuitem>Schema</guimenuitem></menuchoice>, Im Auswahlfeld in der Werkzeugleiste oder auf der Karteikarte <link linkend="view_tab">Anzeige</link> der Seitenleiste ändern.

source: <guimenuitem>Monochrome</guimenuitem>: all the elements have the same color. You can change the default color by choosing <menuchoice><guimenu>Settings</guimenu><guimenuitem>Configure &kalzium;...</guimenuitem> </menuchoice> and going to the <guilabel>Schemes</guilabel> page.
de: <guimenuitem>Schwarzweiß</guimenuitem>: Alle Elemente werden in der gleichen Farbe dargestellt. Die Standardfarbe können Sie im Menü <menuchoice><guimenu>Einstellungen</guimenu><guimenuitem>&kalzium; einrichten ...</guimenuitem> </menuchoice> auf der Seite <guilabel>Schemata</guilabel> ändern.

source: <guimenuitem>Blocks</guimenuitem>: displays a color for each block.
de: <guimenuitem>Blöcke</guimenuitem>: jeder Block wird in einer eigenen Farbe dargestellt.

source: <guimenuitem>Iconic</guimenuitem>: displays icons for each element.
de: <guimenuitem>Symbolisch</guimenuitem>: Jedes Element wird als Symbol dargestellt.
