Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdeedu/kalzium.po
Languages: de

source: <guimenuitem>Family</guimenuitem>: represents each of the nine families with a color.
de: <guimenuitem>Familien</guimenuitem>: Jedes Element der neun Familien werden in einer eigenen Farbe dargestellt.

source: <guimenuitem>Groups</guimenuitem>: displays a color for each group. A group is a vertical column in the periodic table of the elements. There are 18 groups in the standard periodic table. Elements in a group have similar configurations of their valence shell electrons, which gives them similar properties.
de: <guimenuitem>Gruppen</guimenuitem>: Zeigt jede Gruppe in einer anderen Farbe an. Eine Gruppe ist eine senkrechte Spalte im Periodensystem der Elemente. Im Standard-Periodensystem gibt es 18 Gruppen. Elemente einer Gruppe haben ähnliche Konfigurationen ihrer valenten Schalenelektronen, daher weisen sie ähnliche Eigenschaften auf.

source: <title>Gradients</title>
de: <title>Farbverläufe</title>

source: The gradient views displays the elements according to a property you can select below and with a gradient colored scheme. The elements for which the data is not available are displayed in gray.
de: Die Farbverläufe zeigen die Elemente gemäß den Einstellungen an, die Sie unten vornehmen können. Elemente, für die keine Daten vorliegen, werden in grau angezeigt.

source: Gradients can be changed in the <menuchoice><guimenu>View</guimenu> <guimenuitem>Gradients</guimenuitem></menuchoice> menu, toolbar drop-down list, or <link linkend="view_tab">View</link> tab of the Sidebar.
de: Die Farbverläufe können Sie im Menü <menuchoice><guimenu>Ansicht</guimenu> <guimenuitem>Farbverläufe</guimenuitem></menuchoice>, Im Auswahlfeld in der Werkzeugleiste oder auf der Karteikarte <link linkend="view_tab">Anzeige</link> der Seitenleiste ändern.

source: <screeninfo>Gradient for Covalent Radius</screeninfo>
de: <screeninfo>Farbverlauf für den Kovalenzradius</screeninfo>

source: <phrase>Gradient for Covalent Radius</phrase>
de: <phrase>Farbverlauf für den Kovalenzradius</phrase>

source: Implemented are the following gradients
de: Folgende Farbverläufe stehen zur Verfügung:

source: None: Do not use gradients.
de: Keine: Farbverläufe werden in der Anzeige nicht verwendet.

source: <ulink url="http://en.wikipedia.org/wiki/State_of_matter">State of matter</ulink>&nbsp;
de: <ulink url="http://de.wikipedia.org/wiki/Aggregatzustand">Aggregatzustand</ulink>&nbsp;

source: <ulink url="http://en.wikipedia.org/wiki/Covalent_Radius">Covalent Radius</ulink>&nbsp;
de: <ulink url="http://de.wikipedia.org/wiki/Kovalenter_Radius">Kovalenter Radius</ulink>&nbsp;

source: <ulink url="http://en.wikipedia.org/wiki/Van_der_Waals_radius">van der Waals</ulink>: gradient by van der Waals radius
de: <ulink url="http://de.wikipedia.org/wiki/Van-der-Waals-Radius">Van der Waals</ulink>: Farbverlauf nach dem Van-der-Waals-Radius

source: <ulink url="http://en.wikipedia.org/wiki/Atomic_Mass">Atomic Mass</ulink>&nbsp;
de: <ulink url="http://de.wikipedia.org/wiki/Atommasse">Atommasse</ulink>&nbsp;

source: <ulink url="http://en.wikipedia.org/wiki/Boiling_Point">Boiling Point</ulink>&nbsp;
de: <ulink url="http://de.wikipedia.org/wiki/Siedepunkt">Siedepunkt</ulink>&nbsp;

source: <ulink url="http://en.wikipedia.org/wiki/Melting_Point">Melting Point</ulink>&nbsp;
de: <ulink url="http://de.wikipedia.org/wiki/Schmelzpunkt">Schmelzpunkt</ulink>&nbsp;

source: <ulink url="http://en.wikipedia.org/wiki/Electronegativity">Electronegativity (Pauling)</ulink>&nbsp;
de: <ulink url="http://de.wikipedia.org/wiki/Elektronegativität">Elektronegativität (Pauling)</ulink>&nbsp;

source: <ulink url="http://en.wikipedia.org/wiki/Electron_affinity">Electronaffinity</ulink>&nbsp;
de: <ulink url="http://de.wikipedia.org/wiki/Elektroaffinität">Elektroaffinität</ulink>&nbsp;

source: Discovery date
de: Entdeckungsdatum

source: <ulink url="http://en.wikipedia.org/wiki/Ionization_energy">First Ionization</ulink>&nbsp;
de: <ulink url="http://de.wikipedia.org/wiki/Ionisationsenergie">Erste Ionisierungsenergie</ulink>&nbsp;

source: Tools
de: Extras

source: Molecular Editor
de: Moleküleditor

source: The Molecular Editor allows you to view and edit molecules using <ulink url="http://avogadro.openmolecules.net/wiki/Main_Page">Avogadro</ulink> libraries.
de: Im Moleküleditor können Sie mit Hilfe der <ulink url="http://avogadro.openmolecules.net/wiki/Main_Page">Avogadro</ulink>-Bibliotheken Moleküle anzeigen und bearbeiten.

source: Using control panel on the left you can change the view parameters, edit molecule, or measure molecules. There are three tabs on this panel: <guilabel>Display</guilabel>, <guilabel>Edit</guilabel>, and <guilabel>Measure</guilabel>. The buttons along the bottom of the window can be used to <guibutton>Save molecule</guibutton>, <guibutton>Download New Molecules</guibutton>, <guibutton>Load Molecule</guibutton>, and <guibutton>Close</guibutton> the window. The downloaded files will be saved in your <filename class="directory">Documents</filename> folder from where you can load them into the editor.
de: Auf den Karteikarten links im Dialog können Sie die Ansichtsparameter ändern, Moleküle bearbeiten und messen. Es gibt drei Karteikarten: <guilabel>Anzeige</guilabel>, <guilabel>Bearbeiten</guilabel> und <guilabel>Messen</guilabel>. Mit den Knöpfen unten im Dialog können Sie ein <guibutton>Molekül speichern</guibutton>, <guibutton>Neue Moleküle herunterladen</guibutton>, <guibutton>Moleküle laden</guibutton> und den Dialog <guibutton>Schließen</guibutton>. Die heruntergeladenen Dateien werden Ihrem Ordner <filename class="directory">Dokumente</filename> gespeichert, aus dem Sie sie in den Editor laden können.

source: <guilabel>Statistics</guilabel> pane shows name (if available), formula, and weight of the molecule.
de: Im Abschnitt <guilabel>Statistik</guilabel> werden der Name - falls vorhanden, die Formel und die Masse des Moleküls angezeigt.

source: The <guilabel>Display</guilabel> tab can be used to change <guilabel>Quality</guilabel> of the image (<guimenuitem>Low</guimenuitem>, <guimenuitem>Medium</guimenuitem>, or <guimenuitem>High</guimenuitem>, can be useful on low-end system), <guilabel>Style</guilabel> (can be <guimenuitem>Balls and sticks</guimenuitem>, <guimenuitem>Sticks</guimenuitem>, <guimenuitem>Van der Waals</guimenuitem>, or <guimenuitem>Wireframe</guimenuitem>), <guilabel>2nd Style</guilabel> (can be <guimenuitem>None</guimenuitem>, <guimenuitem>Ribbon</guimenuitem>, <guimenuitem>Ring</guimenuitem>, or <guimenuitem>Molecular Orbital</guimenuitem>), and <guilabel>Labels</guilabel> (can be <guimenuitem>None</guimenuitem>, <guimenuitem>Atom Numbers</guimenuitem>, <guimenuitem>Element Names</guimenuitem>, or <guimenuitem>Element Symbols</guimenuitem>).
de: Auf der Karteikarte <guilabel>Anzeige</guilabel> können folgende Einstellungen geändert werden: Die <guilabel>Qualität</guilabel> des Bildes (<guimenuitem>Niedrig</guimenuitem>, <guimenuitem>Mittel</guimenuitem> oder <guimenuitem>Hoch</guimenuitem>), der <guilabel>Stil</guilabel> (<guimenuitem>Kugeln und Stäbe</guimenuitem>, <guimenuitem>Stäbe</guimenuitem>, <guimenuitem>Van der Waals</guimenuitem> oder <guimenuitem>Draht</guimenuitem>), der <guilabel>Zweite Stil</guilabel> (<guimenuitem>Keiner</guimenuitem>, <guimenuitem>Band</guimenuitem>, <guimenuitem>Ring</guimenuitem> oder <guimenuitem>Molekülorbital</guimenuitem>) und die <guilabel>Bezeichner</guilabel> (<guimenuitem>Keine</guimenuitem>, <guimenuitem>Ordnungszahl</guimenuitem>, <guimenuitem>Elementnamen</guimenuitem> oder <guimenuitem>Elementsymbole</guimenuitem>).

source: The <guilabel>Edit</guilabel> tab allows you to edit the molecule. You can add elements by choosing them in the <guilabel>Element</guilabel> drop-down list then clicking with the &LMB; on the view panel on the right. The molecule can be optimized by clicking <guibutton>Optimize</guibutton> button.
de: Die Karteikarte <guilabel>Bearbeiten</guilabel> ermöglicht das Ändern von Molekülen. Fügen Sie Elemente hinzu, indem Sie sie im Auswahlfeld <guilabel>Element</guilabel> wählen und dann mit der &LMBn; ins Ansichtfeld klicken. Zum <guibutton>Optimieren</guibutton> der Moleküle benutzen Sie den gleichnamigen Knopf.

source: The <guilabel>Measure</guilabel> tab can be used to measure distances and angles in the molecule. To make the measurement use the instructions shown on the tab.
de: Auf der Karteikarte <guilabel>Messen</guilabel> können Sie Längen und Winkel eines Moleküls ermitteln. Folgen Sie dazu den Anweisungen auf der Karteikarte.

source: On the right of the <guilabel>Molecular Editor</guilabel> window the molecule will be shown. Use &LMB; to rotate molecule, &RMB; to move it, and &MMB; to zoom.
de: Auf der rechten Seite des Dialogs <guilabel>Moleküleditor</guilabel> wird das Molekül dargestellt. Mit der &LMBn; drehen Sie ein Molekül, mit der &RMBn; verschieben Sie es und mit der &MMBn; können Sie die Ansicht vergrößern und verkleinern.

source: the <quote>Molecular Editor</quote>
de: der <quote>Moleküleditor</quote>

source: Isotope Table
de: Isotopentabelle

source: The <guimenuitem>Isotope Table...</guimenuitem> shows you the isotopes of the elements.
de: Die <guimenuitem>Isotopentabelle ...</guimenuitem> zeigt die Isotope der Elemente.

source: There are different kinds of isotopes, some are stable, some are not. The unstable isotopes can decay as alpha-rays are two different beta-rays. These differences are encoded by using different colors.
de: Es gibt verschiedene Arten von Isotopen, einige sind stabil, andere nicht. Die instabilen Isotope können unter Auftreten von Alphastrahlung oder Betastrahlung zerfallen. Die Unterschiede sind farblich gekennzeichnet.

source: the <quote>Isotope Table</quote> window
de: der Dialog <quote>Isotopentabelle</quote>

source: &kalzium; can display the isotopes of a range of elements
de: &kalzium; kann die Isotope eines Bereichs von Elementen grafisch darstellen.

source: Plot Data
de: Daten grafisch darstellen

source: The <guimenuitem>Plot Data...</guimenuitem> dialog allows you to plot some information about elements. The X-axis represents a range of elements (from one number to a higher number). You set this range using the <guilabel>First Element</guilabel> and <guilabel>Last Element</guilabel> fields on the dialog.
de: Im Dialog <guimenuitem>Daten grafisch darstellen</guimenuitem> können Sie einige Informationen über Elemente als Grafik anzeigen lassen. Auf der X-Achse wird ein Bereich von Elementen als Zahlen angezeigt. Diesen Bereich können Sie mit den Feldern <guilabel>Erstes Element</guilabel> und <guilabel>Letztes Element</guilabel> im Dialog einstellen.

source: the <quote>Plot Data</quote> Dialog
de: der Dialog <quote>Daten grafisch darstellen</quote>

source: &kalzium; can plot some data about a range of elements.
de: &kalzium; kann einige Daten über einen Bereich von Elementen grafisch darstellen.

source: Perform Calculation
de: Berechnungen durchführen

source: The <guilabel>Perform Calculation</guilabel> is the &kalzium; calculator. This calculator contains a variety of calculators for different tasks performing different calculations.
de: &kalzium; verfügt über eine Vielzahl von Rechnern für verschiedene Anwendungen.

source: You can find the following calculators in &kalzium;
de: Es gibt folgende Rechner in &kalzium;:

source: Molecular mass calculator
de: Molekülmassen-Rechner

source: This calculator helps you calculate the molecular masses of different molecules.
de: Mit diesem Rechner können Sie die Massen vieler Moleküle ermitteln.

source: You can specify short form of the molecule names add more such aliases.
de: Sie können Kurzformen von Molekülnamen definieren und weitere Aliase einfügen.

source: the <quote>Molecular mass calculator</quote> dialog
de: der Dialog <quote>Molekülmassen-Rechner</quote>

source: &kalzium; calculates molecular mass of phenol.
de: &kalzium; berechnet die Molekülmasse von Phenol.

source: Concentrations calculator
de: Konzentrations-Rechner

source: You can calculate quantities which include
de: Sie können unter anderem folgende Mengen berechnen:

source: Amount of substance
de: Menge des Stoffes

source: Volume of solvent
de: Menge des Lösungsmittels

source: Concentration of substance
de: Konzentration des Stoffes

source: There are a wide range of units to choose from and different methods to specify quantities.
de: Es gibt einen große Auswahl an Einheiten und verschiedenen Methoden, um Mengen anzugeben.

source: the <quote>Concentrations calculator</quote> dialog
de: der Dialog <quote>Konzentrations-Rechner</quote>

source: &kalzium; calculates solution parameters.
de: &kalzium; berechnet die Parameter einer Lösung.

source: Nuclear calculator
de: Nuklear-Rechner

source: This calculator makes use of the nuclear data available in &kalzium; to predict the expected masses of a material after time.
de: Dieser Rechner verwendet die nuklearen Daten in &kalzium;, um die zu erwartenden Menge eines radioaktiven Stoffes nach einer Zerfallszeit zu bestimmen.

source: the <quote>Nuclear calculator</quote> dialog
de: der Dialog <quote>Nuklear-Rechner</quote>

source: &kalzium; calculates parameters of uranium decay.
de: &kalzium; berechnet die Parameter des Uran-Zerfalls.

source: Gas calculator
de: Gas-Rechner

source: This calculator can calculate the values of Temperature, pressure, volume, amount of gas etc. for various ideal as well as non-ideal gases.
de: Dieser Rechner bestimmt die Temperatur, den Druck, das Volumen, die Gasmenge usw. für verschiedene ideale und reale Gase.

source: the <quote>Gas calculator</quote> dialog
de: der Dialog <quote>Gas-Rechner</quote>

source: &kalzium; calculates gas parameters.
de: &kalzium; berechnet Gas-Parameter.

source: Titration calculator
de: Titrations-Rechner

source: This calculator tries to find out the equivalence point of a pH-meter followed titration best fitting it with an hyperbolic tangent. You can also let it solve an equilibrium system of equations and see how the concentration of a species changes in function of another one.
de: Dieser Rechner bestimmt den Äquivalenzpunkt einer mit dem pH-Meter durchgeführten Titration und die beste Anpassung durch eine hyperbolische Tangente. Sie können mit diesem Rechner auch ein System von Gleichungen lösen und zeigen lassen, wie sich die Konzentration eines Ions als Funktion eines anderen ändert.

source: There are two tabs on the calculator page, namely:
de: Es gibt die zwei folgenden Karteikarten auf der Rechnerseite:

source: Experimental Values
de: Experimentelle Werte

source: You can use this calculator to draw the plot of your experimental data obtained during a titration and find out the volume of equivalence. It's strongly recommended to insert a even number of points, because of the best fit algorithm, sorted by volume (the X axis value).
de: Mit diesem Rechner können Sie einen Graphen Ihrer experimentellen Daten zeichnen, die Sie mit einer Titration ermittelt haben, und das Äquivalenzvolumen ermitteln. Es wird ausdrücklich empfohlen, eine gerade Anzahl von Punkten einzugeben. Damit erhalten Sie den am Besten angepassten Algorithmus, sortiert nach dem Volumen, dem Wert auf der X-Achse.

source: Theoretical Equations
de: Theoretische Gleichungen

source: Here you can fill the table with the equations you have previously obtained for the chemical equilibrium.
de: In diese Tabelle können Sie Gleichungen eingeben, die Sie vorher für das chemische Gleichgewicht erhalten haben.

source: For example, if you have this reaction <emphasis>A + B -> C + D</emphasis> then you will have the equation <emphasis>K=(C*D)/(A*B)</emphasis> so you must write <userinput>K</userinput> in the <guilabel>Parameter</guilabel> column and <userinput>(C*D)/(A*B)</userinput> in the <guilabel>Value</guilabel> column. If you want to assign a known value to a parameter you can simply write the numeric value in the <guilabel>Value</guilabel> field.
de: Haben Sie zum Beispiel diese Reaktion <emphasis>A + B -> C + D</emphasis>, dann lautet die Gleichung <emphasis>K=(C*D)/(A*B)</emphasis>. Daher müssen Sie <userinput>K</userinput> in der Spalte <guilabel>Parameter</guilabel> und <userinput>(C*D)/(A*B)</userinput> in der Spalte <guilabel>Wert</guilabel> eingeben. Möchten Sie einem Parameter einen bekannten Wert zuweisen, dann geben Sie den numerischen Wert direkt in das Feld <guilabel>Wert</guilabel> ein.

source: For example, you can use the system
de: Sie können zum Beispiel folgendes System benutzen:

source: Then you have to write <userinput>D</userinput> as <guilabel>X axis</guilabel> and <userinput>A</userinput> as <guilabel>Y axis</guilabel>: so you will find out how the concentration of A changes as a function of D concentration.
de: Dann tragen Sie <userinput>D</userinput> für die <guilabel>X-Achse</guilabel> und <userinput>A</userinput> für die <guilabel>Y-Achse</guilabel> ein: Dann ermitteln Sie, wie sich die Konzentration von A als Funktion der Konzentration D ändert.

source: Please don't use parenthesis for exponents: <userinput>10^-3</userinput> is correct, while <userinput>10^(-3)</userinput> is wrong.
de: Bitte benutzen Sie für die Exponenten keine Klammern: <userinput>10^-3</userinput> ist korrekt, aber <userinput>10^(-3)</userinput> ist falsch.

source: The results can be visualized by pressing <guibutton>Draw Plot</guibutton> button. The plot shows in red the curve that comes from theoretical equations, in blue the experimental points, and in green the approximated curve for experimental points. You can save the plot as SVG image.
de: Die Ergebnisse können als Grafik dargestellt werden, indem Sie den Knopf <guibutton>Graphen zeichnen</guibutton> drücken. In der Grafik wird die aus den theoretischen Berechnungen ermittelte Kurve rot, die im Experiment ermittelte Kurve blau und in grün die angenäherte Kurve für die experimentellen Werte dargestellt. Diese Grafik kann im SVG-Format gespeichert werden.

source: the <quote>Titration calculator</quote> dialog
de: Der Dialog <quote>Titrations-Rechner</quote>

source: Predefined example of titration results.
de: Vorgegebenes Beispiel einer Titrations-Analyse.

source: Equation Balancer
de: Gleichungslöser

source: The <guimenuitem>Equation Balancer</guimenuitem> enables the user to solve chemical equations. This is an example:
de: Mit dem <guimenuitem>Gleichungslöser</guimenuitem> können Sie chemische Gleichungen lösen. Hier ein Beispiel:

source: The computed equation will be displayed on the top of the window. As you can see in the first example you can also define the value of one or more coefficients. The other coefficients will be adjusted. Furthermore, it is possible to use brackets around elements or electronic charges as shown in the last two examples.
de: Die errechnete Gleichung wird oben im Fenster angezeigt. Wie Sie im ersten Beispiel erkennen können, ist es möglich den Wert für einen oder mehrere Koeffizienten festzulegen. Die anderen Koeffizienten werden entsprechend angepasst. Weiterhin können auch Klammern um Elemente und Elektronenladungen verwendet werden, wie in den letzten beiden Beispielen gezeigt wird.

source: the <quote>Equation Balancer</quote> dialog
de: der Dialog <quote>Gleichungslöser</quote>

source: &kalzium; calculates equation balance.
de: &kalzium; kann chemische Gleichungen automatisch ausgleichen.

source: Risk/Security Phrases
de: Risiko- und Sicherheitssätze

source: The R/S Phrases, also known as Risk and Safety Statements, R/S statements, R/S numbers, and R/S sentences, is a system of hazard codes and phrases for labeling dangerous chemicals and compounds. The R/S phrase of a compound consists of a risk part (R) and a safety part (S), each followed by a combination of numbers. Each number corresponds to a phrase. The phrase corresponding to the letter/number combination has the same meaning in different languages.
de: R- und S-Sätze („Risiko- und Sicherheitssätze“, von engl. risk and safety) sind kodifizierte Warnhinweise zur Charakterisierung der Gefahrenmerkmale von einzelnen Gefahrstoffen (Elementen und chemischen Verbindungen) sowie daraus hergestellten gefährlichen Zubereitungen, welche sich aus der Einstufung dieser Substanzen ergeben. Sie sind zusammen mit den Gefahrenbezeichnungen und den jeweils dazu gehörenden Gefahrensymbolen die wichtigsten Hilfsmittel für die innerhalb der EU vorgeschriebenen Gefahrstoffkennzeichnung. R- und S-Sätze bestehen aus einem Risikoteil (R) und einem Sicherheitsteil (S), beide kombiniert mit einer Zahl. Diese R- und S-Sätze haben in allen Sprachen die gleiche Bedeutung.

source: the <quote>R/S Phrases</quote> window
de: der Dialog <quote>Risiko- und Sicherheitssätze</quote>

source: &kalzium; can display Risk/Security Phrases
de: &kalzium; kann Risiko- und Sicherheitssätze anzeigen

source: Glossary
de: Glossar

source: The Glossary gives you definitions of the most used tools in chemistry as well as some knowledge data. On the left side of the windows you can see the tree of items. On top, there are chemical terms, below that there is a second tree of laboratory-tools.
de: Das Glossar bietet Ihnen Definitionen der häufigsten verwendeten chemischen Geräte sowie weitere wissenswerte Informationen. Auf der linken Seite können Sie einen Baum mit den Einträgen sehen. Oben sind chemische Formeln, darunter ein weiterer Baum mit Laborgeräten zu erkennen.

source: On the top of the widget you can see a searchbar. If you type in the bar the trees will be adjusted immediately. The small button in the right end of the searchbar will clear it.
de: Im oberen Teil des Fensters finden Sie eine Suchleiste. Wenn Sie etwas eingeben, passen sich die Bäume links sofort an. Der kleine Knopf rechts neben der Suchleiste löscht den Inhalt der Leiste.

source: the <quote>Glossary</quote>
de: das <quote>Glossar</quote>

source: The Tables shows you the tables for Greek alphabet which is used to denote some chemical and physical entities, and for Latin prefixes and Roman numbers which correspond to common Arabic numbers.
de: Die Tabelle zeigt das griechische Alphabet, das für die Bezeichnung einiger chemischer und physikalischer Einheiten verwendet wird, und die numerische Präfixe und römische Ziffern für arabische Zahlen.

source: the <quote>Tables</quote> window
de: der Dialog <quote>Tabellen</quote>

source: Sidebar
de: Seitenleiste

source: <title>Overview</title>
de: <title>Übersicht</title>

source: <phrase>Overview</phrase>
de: <phrase>Übersicht</phrase>

source: The <guilabel>Overview</guilabel> tab is the first one and it shows you an overview of the element the mouse is over.
de: Die Karteikarte <guilabel>Übersicht</guilabel> zeigt Ihnen die wichtigsten Informationen des Elements, über dem sich der Mauszeiger befindet.

source: View
de: Anzeigen

source: The <guilabel>View</guilabel> tab is the second in the navigation panel.
de: Die Karteikarte <guilabel>Anzeigen</guilabel> ist die zweite Karteikarte in der Seitenleiste.

source: You are first presented with the following icons and text:
de: Als erstes werden Ihnen folgende Symbole und Text gezeigt:

source: the <quote>State of Matter</quote> Dialog
de: der Dialog <quote>Aggregatzustand</quote>

source: &kalzium; can show you which elements are solid/liquid/vaporous at a given temperature.
de: &kalzium; kann Ihnen anzeigen, welche Elemente bei einer bestimmten Temperatur fest/flüssig/gasförmig sind.
