Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdeedu/kalzium.po
Languages: de

source: The <guilabel>View</guilabel> tab can be used to filter PSE. For example, this feature allows you to explore the elements of the set time period. This is great for getting a feel for how the PSE evolved over time, as more and more elements were discovered. Choose <guimenuitem>Discovery date</guimenuitem> from <guilabel>Gradient</guilabel> list. If you move the slider you will notice that color of some elements disappear if you move it to the left and reappear if you move it to the right. Furthermore the number will change constantly.
de: Mit der Karteikarte <guilabel>Ansehen</guilabel> können Sie die angezeigten Elemente im Periodensystem filtern. Sie können zum Beispiel erkunden, welche Elemente zu einer bestimmten Zeit bekannt waren. Das ist eine großartige Möglichkeit, ein Gefühl für die Entwicklung des Periodensystems der Elemente zu bekommen. Wählen Sie <guimenuitem>Datum der Entdeckung</guimenuitem> aus dem Auswahlfeld <guilabel>Farbverlauf</guilabel>. Wenn Sie den Schieberegler bewegen, werden Sie feststellen, dass die Farbe einiger Elemente verschwindet, wenn Sie ihn nach links bewegen, sie erscheint wieder, wenn Sie ihn zurück nach rechts bewegen. Außerdem verändert sich gleichzeitig die angezeigt Jahreszahl.

source: The number represents the date you are looking at. If you move the slider to &eg; 1856 you will only see the elements which where known in the year 1856.
de: Die Jahreszahl zeigt das eingestellte Jahr an. Wenn Sie den Regler &eg; auf 1856 bewegen, sehen Sie nur die Elemente, die im Jahr 1856 bekannt waren.

source: the <quote>Discovery date</quote> gradient
de: der Farbverlauf <quote>Datum der Entdeckung</quote>

source: The PSE back in time (elements known in 1856)
de: Das Periodensystem in der Vergangenheit (bekannte Elemente im Jahr 1856)

source: Configuring &kalzium;
de: &kalzium; einrichten

source: &kalzium; has many configuration options, which you can access by opening the configuration dialog by selecting <menuchoice> <guimenu>Settings</guimenu> <guimenuitem>Configure &kalzium;...</guimenuitem> </menuchoice> from the menu.
de: &kalzium; hat viele Optionen, die Sie im Dialog zur Einstellung im Menü unter <menuchoice><guimenu>Einstellungen</guimenu> <guimenuitem>&kalzium; einrichten ...</guimenuitem></menuchoice>> erreichen können.

source: Configure &kalzium; Dialog
de: Der Dialog &kalzium; einrichten

source: Schemes
de: Schemata

source: In the <guilabel>Schemes</guilabel> tab, you can change the different colors for each scheme.
de: Auf der Seite <guilabel>Schemata</guilabel> wählen Sie die unterschiedlichen Farben für jedes Schema.

source: <phrase>Gradients</phrase>
de: <phrase>Farbverläufe</phrase>

source: Instead of using a linear gradient to display the given property of an element in the periodic table, &kalzium; can also use a logarithmic gradient.
de: Anstatt einen linearen Farbverlauf für die Anzeige der gegebenen Eigenschaften eines Elements im Periodensystem zu verwenden, kann &kalzium; auch einen logarithmischen Farbverlauf verwenden.

source: In the <guilabel>Gradients</guilabel> tab, you can check the properties you want to have displayed with a logarithmic gradient.
de: Auf der Seite <guilabel>Verläufe</guilabel> können Sie die Eigenschaften der Elemente wählen Sie, die mit einem logarithmischen Farbverlauf dargestellt werden sollen.

source: You can also choose <guilabel>Maximal Value Color</guilabel> and <guilabel>Minimal Value Color</guilabel> for the gradient.
de: Sie können außerdem die <guilabel>Farbe für maximalen Wert</guilabel> und die <guilabel>Farbe für minimalen Wert</guilabel> des Farbverlaufs festlegen.

source: Units
de: Einheiten

source: In the <guilabel>Units</guilabel> tab, you can choose the units for temperature, length and energy. You can select if you prefer electronvolts (eV), kilojoule per mole (kJ/mol) or joule per mole (J/mol) by default. For length set picometers (pm), nanometers (nm) or Ångström (Å) as default. The temperature is in kelvin by default but you can change to Celsius (°C), Fahrenheit (°F) and Réaumur (°Ré).
de: Auf der Seite <guilabel>Einheiten</guilabel> können Sie die Einheiten für Temperatur, Länge und Energie einstellen. Sie können auswählen, ob Sie lieber Elektronenvolt (eV) oder KiloJoule je Mol (kJ/mol) oder Joule je Mol (J/mol) als Einheiten anzeigen lassen. Als Länge können Sie Picometer (pm), Nanometers (nm) oder Ångström (Å) als Voreinstellung auswählen. Die Temperatur ist in der Voreinstellung in Kelvin, Sie können aber auf Celsius (°C), Fahrenheit (°F) und Réaumur (°Ré) einstellen.

source: Calculator
de: Rechner

source: Using the <guilabel>Calculator</guilabel> page, you can configure &kalzium; calculators.
de: Auf der Seite <guilabel>Rechner</guilabel> können Sie Standardeinstellungen für die Rechner in &kalzium; bestimmen.

source: Command Reference
de: Befehlsreferenz

source: Menus and shortcut keys
de: Menüs und Tastenkürzel

source: The File Menu
de: Das Menü Datei

source: <guimenu>File</guimenu> <guimenuitem>Save As...</guimenuitem>
de: <guimenu>Datei</guimenu> <guimenuitem>Speichern unter ...</guimenuitem>

source: <action>Save</action> &kalzium;'s table as image.
de: <action>Speichert</action> das angezeigte Periodensystem als Bild.

source: <guimenu>File</guimenu> <guimenuitem>Export Data...</guimenuitem>
de: <guimenu>Datei</guimenu><guimenuitem>Daten exportieren ...</guimenuitem>

source: <action>Open</action> a dialog where you can select <guilabel>Elements</guilabel> and their <guilabel>Properties</guilabel> to export them to a &HTML;, &XML;, or CSV file.
de: <action>Öffnet</action> einen Dialog, in dem Sie <guilabel>Elemente</guilabel> und deren <guilabel>Eigenschaften</guilabel> für den Export der Daten in eine &HTML;- oder CSV-Datei auswählen können.

source: <guimenu>File</guimenu> <guimenuitem>Convert chemical files...</guimenuitem>
de: <guimenu>Datei</guimenu><guimenuitem>Chemiedaten-Dateien konvertieren ...</guimenuitem>

source: <action>Open</action> a dialog to import and export a wide range of chemical file formats and data types with the <ulink url="http://openbabel.org/wiki/Main_Page">Open Babel library</ulink>.
de: <action>Öffnet</action> einen Dialog, in dem Sie eine große Anzahl von verschiedenen chemischen Dateiformaten und Datentypen mithilfe der Bibliothek <ulink url="http://openbabel.org/wiki/Main_Page">Open Babel</ulink> importieren und exportieren können.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Quit</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo> </shortcut> <guimenu>Datei</guimenu> <guimenuitem>Beenden</guimenuitem>

source: <action>Quits</action> &kalzium;.
de: <action>Beendet</action> &kalzium;.

source: The View Menu
de: Das Menü Ansicht

source: <guimenu>View</guimenu> <guisubmenu>Tables</guisubmenu> <guimenuitem>Classic Periodic Table</guimenuitem>
de: <guimenu>Ansicht</guimenu> <guisubmenu>Tabellen</guisubmenu> <guimenuitem>Klassisches Periodensystem</guimenuitem>

source: <guimenu>View</guimenu> <guisubmenu>Tables</guisubmenu> <guimenuitem>Short Periodic Table</guimenuitem>
de: <guimenu>Ansicht</guimenu> <guisubmenu>Tabellen</guisubmenu> <guimenuitem>Kurzperiodensystem</guimenuitem>

source: <guimenu>View</guimenu> <guisubmenu>Tables</guisubmenu> <guimenuitem>Long Periodic Table</guimenuitem>
de: <guimenu>Ansicht</guimenu> <guisubmenu>Tabellen</guisubmenu> <guimenuitem>Langperiodensystem</guimenuitem>

source: <guimenu>View</guimenu> <guisubmenu>Tables</guisubmenu> <guimenuitem>Transition Elements</guimenuitem>
de: <guimenu>Ansicht</guimenu> <guisubmenu>Tabellen</guisubmenu> <guimenuitem>Übergangselemente</guimenuitem>

source: <guimenu>View</guimenu> <guisubmenu>Tables</guisubmenu> <guimenuitem>DZ Periodic Table</guimenuitem>
de: <guimenu>Ansicht</guimenu> <guisubmenu>Tabellen</guisubmenu> <guimenuitem>DZ-Periodensystem</guimenuitem>

source: <guimenu>View</guimenu> <guisubmenu>Numeration</guisubmenu> <guimenuitem>No Numeration</guimenuitem>
de: <guimenu>Ansicht</guimenu> <guisubmenu>Nummerierung</guisubmenu> <guimenuitem>Keine Nummerierung</guimenuitem>

source: <action>Display</action> no numeration scheme.
de: <action>Zeigt</action> keine Nummerierungsschema.

source: <guimenu>View</guimenu> <guisubmenu>Numeration</guisubmenu> <guimenuitem>IUPAC</guimenuitem>
de: <guimenu>Ansicht</guimenu> <guisubmenu>Nummerierung</guisubmenu> <guimenuitem>IUPAC </guimenuitem>

source: <action>Display</action> the IUPAC numeration.
de: <action>Zeigt</action> die IUPAC-Nummerierung an.

source: <guimenu>View</guimenu> <guisubmenu>Numeration</guisubmenu> <guimenuitem>CAS</guimenuitem>
de: <guimenu>Ansicht</guimenu> <guisubmenu>Nummerierung</guisubmenu> <guimenuitem>CAS</guimenuitem>

source: <action>Display</action> the CAS numeration.
de: <action>Zeigt</action> die CAS-Nummerierung an.

source: <guimenu>View</guimenu> <guisubmenu>Numeration</guisubmenu> <guimenuitem>Old IUPAC</guimenuitem>
de: <guimenu>Ansicht</guimenu> <guisubmenu>Nummerierung</guisubmenu> <guimenuitem>IUPAC (alt)</guimenuitem>

source: <action>Display</action> the Old IUPAC numeration.
de: <action>Zeigt</action> die alte IUPAC-Nummerierung an.

source: <guimenu>View</guimenu> <guisubmenu>Scheme</guisubmenu> <guimenuitem>Monochrome</guimenuitem>
de: <guimenu>Ansicht</guimenu><guisubmenu>Schema</guisubmenu> <guimenuitem>Einfarbig</guimenuitem>

source: <action>Display</action> all elements with one background color.
de: <action>Zeigt</action> alle Elemente in einer Farbe an.

source: <guimenu>View</guimenu> <guisubmenu>Scheme</guisubmenu> <guimenuitem>Blocks</guimenuitem>
de: <guimenu>Ansicht</guimenu><guisubmenu>Schema</guisubmenu> <guimenuitem>Blöcke</guimenuitem>

source: <action>Display</action> the four blocks of elements.
de: <action>Zeigt</action> die vier Blöcke der Elemente an.

source: <guimenu>View</guimenu> <guisubmenu>Scheme</guisubmenu> <guimenuitem>Iconic</guimenuitem>
de: <guimenu>Ansicht</guimenu><guisubmenu>Schema</guisubmenu> <guimenuitem>Symbolisch</guimenuitem>

source: <action>Display</action> icons for each element.
de: <action>Zeigt</action> jedes Element als Symbol an.

source: <guimenu>View</guimenu> <guisubmenu>Scheme</guisubmenu> <guimenuitem>Family</guimenuitem>
de: <guimenu>Ansicht</guimenu> <guisubmenu>Schema</guisubmenu> <guimenuitem>Familien</guimenuitem>

source: <action>Display</action> the families of elements.
de: <action>Zeigt</action> die Familien der Elemente an.

source: <guimenu>View</guimenu> <guisubmenu>Scheme</guisubmenu> <guimenuitem>Groups</guimenuitem>
de: <guimenu>Ansicht</guimenu><guisubmenu>Schema</guisubmenu> <guimenuitem>Gruppen</guimenuitem>

source: <action>Display</action> the groups of elements.
de: <action>Zeigt</action> die Gruppen der Elemente farbig an.

source: <guimenu>View</guimenu> <guisubmenu>Gradients</guisubmenu> <guimenuitem>None</guimenuitem>
de: <guimenu>Ansicht</guimenu> <guisubmenu>Farbverläufe</guisubmenu> <guimenuitem>Keine</guimenuitem>

source: <action>Disable</action> any gradient for the table.
de: <action>Zeigt</action> keine Farbverläufe in der Tabelle an.

source: <guimenu>View</guimenu> <guisubmenu>Gradients</guisubmenu> <guimenuitem>State of matter</guimenuitem>
de: <guimenu>Ansicht</guimenu> <guisubmenu>Farbverläufe</guisubmenu> <guimenuitem>Aggregatzustand</guimenuitem>

source: <action>Display</action> the elements' state of matter.
de: <action>Zeigt</action> den Aggregatzustand der Elemente an.

source: <guimenu>View</guimenu> <guisubmenu>Gradients</guisubmenu> <guimenuitem>Covalent Radius</guimenuitem>
de: <guimenu>Ansicht</guimenu> <guisubmenu>Farbverläufe</guisubmenu> <guimenuitem>Kovalenter Radius</guimenuitem>

source: <action>Display</action> the elements' covalent radius.
de: <action>Zeigt</action> den Kovalenzradius der Elemente an.

source: <guimenu>View</guimenu> <guisubmenu>Gradients</guisubmenu> <guimenuitem>van der Waals</guimenuitem>
de: <guimenu>Ansicht</guimenu> <guisubmenu>Farbverläufe</guisubmenu> <guimenuitem>Van der Waals</guimenuitem>

source: <action>Display</action> the elements' van der Waals radius.
de: <action>Zeigt</action> den Van-der-Waals-Radius der Elemente an.

source: <guimenu>View</guimenu> <guisubmenu>Gradients</guisubmenu> <guimenuitem>Atomic Mass</guimenuitem>
de: <guimenu>Ansicht</guimenu> <guisubmenu>Farbverläufe</guisubmenu> <guimenuitem>Atommasse</guimenuitem>

source: <action>Display</action> the elements' atomic mass.
de: <action>Zeigt</action> die Atommasse der Elemente an.

source: <guimenu>View</guimenu> <guisubmenu>Gradients</guisubmenu> <guimenuitem>Boiling Point</guimenuitem>
de: <guimenu>Ansicht</guimenu> <guisubmenu>Farbverläufe</guisubmenu> <guimenuitem>Siedepunkt</guimenuitem>

source: <action>Display</action> the elements' boiling point.
de: <action>Zeigt</action> den Siedepunkt der Elemente an.

source: <guimenu>View</guimenu> <guisubmenu>Gradients</guisubmenu> <guimenuitem>Melting Point</guimenuitem>
de: <guimenu>Ansicht</guimenu> <guisubmenu>Farbverläufe</guisubmenu> <guimenuitem>Schmelzpunkt</guimenuitem>

source: <action>Display</action> the elements' melting point.
de: <action>Zeigt</action> den Schmelzpunkt der Elemente an.

source: <guimenu>View</guimenu> <guisubmenu>Gradients</guisubmenu> <guimenuitem>Electronegativity (Pauling)</guimenuitem>
de: <guimenu>Ansicht</guimenu> <guisubmenu>Farbverläufe</guisubmenu> <guimenuitem>Elektronegativität (Pauling)</guimenuitem>

source: <action>Display</action> the elements' electronegativity.
de: <action>Zeigt</action> die Elektronen-Negativität der Elemente an.

source: <guimenu>View</guimenu> <guisubmenu>Gradients</guisubmenu> <guimenuitem>Electronaffinity</guimenuitem>
de: <guimenu>Ansicht</guimenu> <guisubmenu>Farbverläufe</guisubmenu> <guimenuitem>Elektronenaffinität</guimenuitem>

source: <action>Display</action> the elements' electron affinity.
de: <action>Zeigt</action> die Elektronenaffinität der Elemente an.

source: <guimenu>View</guimenu> <guisubmenu>Gradients</guisubmenu> <guimenuitem>Discovery date</guimenuitem>
de: <guimenu>Ansicht</guimenu> <guisubmenu>Farbverläufe</guisubmenu> <guimenuitem>Datum der Entdeckung</guimenuitem>

source: <action>Display</action> the discovery date of each element with different background colors for each century.
de: <action>Zeigt</action> das Entdeckungsdatum für jedes Element an, jedes Jahrhundert wird in einer anderen Hintergrundfarbe dargestellt.

source: <guimenu>View</guimenu> <guisubmenu>Gradients</guisubmenu> <guimenuitem>First Ionization</guimenuitem>
de: <guimenu>Ansicht</guimenu> <guisubmenu>Farbverläufe</guisubmenu> <guimenuitem>Erste Ionisation</guimenuitem>

source: <action>Display</action> the elements' energy of first ionization.
de: <action>Zeigt</action> für alle Element die erforderliche Energie für die erste Ionisation an.

source: <guimenu>View</guimenu> <guimenuitem>Legend</guimenuitem>
de: <guimenu>Ansicht</guimenu><guimenuitem>Legende</guimenuitem>

source: <action>Toggle</action> the legend view. Allows you to display the legend for the scheme you are in (Groups, Family, Blocks). The legend is displayed by default but if you hide it, it will stay hidden until you choose to show it. &kalzium; will keep this setting in its configuration file, so that the next time you run it, the setting will be as you left it.
de: Hier schalten Sie die Anzeige der Legende für das gewählte Schema (Gruppen, Familien, Blöcke) ein und aus. In der Voreinstellung wird die Legende angezeigt, aber wenn Sie die Anzeige ausschalten, gilt dies auch für die anderen Schemata, bis Sie die Anzeige wieder einschalten. &kalzium; speichert diese Einstellung beim Programmende, sodass beim nächsten Start des Programms diese Einstellung wiederhergestellt wird.

source: <guimenu>View</guimenu> <guimenuitem>Information</guimenuitem>
de: <guimenu>Ansicht</guimenu><guimenuitem>Informationen</guimenuitem>

source: <action>Toggle</action> the Sidebar.
de: <action>Blendet</action> die Seitenleiste ein bzw. aus.

source: <guimenu>View</guimenu> <guimenuitem>Table Information</guimenuitem>
de: <guimenu>Ansicht</guimenu> <guimenuitem>Tabelleninformation</guimenuitem>

source: <action>Toggle</action> the Table Information view.
de: <action>Schaltet</action> die Anzeige der Tabelleninformation ein und aus.

source: The Tools Menu
de: Das Menü Extras

source: <guimenu>Tools</guimenu> <guimenuitem>Molecular Editor...</guimenuitem>
de: <guimenu>Extras</guimenu><guimenuitem>Moleküleditor ...</guimenuitem>

source: <action>Open</action> the Molecular Editor dialog.
de: <action>Öffnet</action> den Dialog Moleküleditor.

source: <guimenu>Tools</guimenu> <guimenuitem>Isotope Table...</guimenuitem>
de: <guimenu>Extras</guimenu><guimenuitem>Isotopentabelle ...</guimenuitem>

source: <action>Open</action> the Isotope Table window.
de: <action>Öffnet</action> einen Dialog mit der grafischen Darstellung von Isotopen aller Elemente.

source: <guimenu>Tools</guimenu> <guimenuitem>Plot Data...</guimenuitem>
de: <guimenu>Extras</guimenu><guimenuitem>Daten grafisch darstellen ...</guimenuitem>

source: <action>Open</action> the Plot Data dialog.
de: <action>Öffnet</action> einen Dialog zur grafischen Darstellung von Daten.

source: <guimenu>Tools</guimenu> <guimenuitem>Perform Calculation...</guimenuitem>
de: <guimenu>Extras</guimenu><guimenuitem>Berechnungen durchführen ...</guimenuitem>

source: <action>Open</action> the <link linkend="perf_calculation">Perform Calculation dialog</link>.
de: <action>Öffnet</action> den Dialog <link linkend="perf_calculation">Rechner</link>.

source: <guimenu>Tools</guimenu> <guimenuitem>R/S Phrases...</guimenuitem>
de: <guimenu>Extras</guimenu><guimenuitem>R- und S-Sätze ...</guimenuitem>

source: <action>Open</action> the <guilabel>Risk/Security Phrases</guilabel> dialog.
de: <action>Öffnet</action> den Dialog <guilabel>Risiko- und Sicherheitssätze</guilabel>.

source: <guimenu>Tools</guimenu> <guimenuitem>Glossary...</guimenuitem>
de: <guimenu>Extras</guimenu><guimenuitem>Glossar ...</guimenuitem>

source: <action>Open</action> the Glossary.
de: <action>Zeigt</action> das Glossar mit Informationen über Laborgeräte und Fachbegriffe aus der Chemie und Physik.

source: <guimenu>Tools</guimenu> <guimenuitem>Tables...</guimenuitem>
de: <guimenu>Extras</guimenu><guimenuitem>Tabellen ...</guimenuitem>

source: <action>Display</action> a dialog with the <guilabel>Greek alphabet</guilabel> and <guilabel>Numeric Prefixes and Roman Numerals</guilabel>.
de: <action>Zeigt</action> einen Dialog mit dem <guilabel>Griechischen Alphabet</guilabel> und <guilabel>Numerischen Präfixen und römischen Ziffern</guilabel>.

source: The Settings and Help Menu
de: Die Menüs <quote>Einstellungen</quote> und <quote>Hilfe</quote>

source: &kalzium; has the common &kde; <guimenu>Settings</guimenu> and <guimenu>Help</guimenu> menu items, for more information read the sections about the <ulink url="help:/fundamentals/ui.html#menus-settings">Settings Menu</ulink> and <ulink url="help:/fundamentals/ui.html#menus-help">Help Menu</ulink> of the &kde; Fundamentals.
de: &kalzium; benutzt die bekannten &kde;-Menüeinträge <guimenu>Einstellungen</guimenu> und <guimenu>Hilfe</guimenu>. Mehr dazu erfahren Sie in den Abschnitten zu den Menüs <ulink url="help:/fundamentals/ui.html#menus-settings">Einstellungen</ulink> und <ulink url="help:/fundamentals/ui.html#menus-help">Hilfe</ulink> in den &kde;-Grundlagen.

source: Questions and Answers
de: Fragen und Antworten

source: Will I ever have to pay for &kalzium;?
de: Muss ich irgendwann etwas für &kalzium; bezahlen?

source: No, never. But the author always welcomes a nice mail or a DVD as a <quote>Thank You</quote>. &kalzium; is licensed under the <ulink url="http://www.gnu.org/licenses/licenses.html#GPL">GPL</ulink>, so you will never have to pay for this program.
de: Nein, niemals. Aber der Autor freut sich immer über eine nette Mail oder eine DVD als <quote>Dankeschön</quote>. &kalzium; ist unter der <ulink url="http://www.gnu.org/licenses/licenses.html#GPL">GPL</ulink> lizenziert, deshalb müssen Sie nie für das Programm bezahlen.

source: How can I contribute?
de: Wie kann ich helfen?

source: Support me with data.
de: Unterstützen Sie mich mit Daten.

source: In the world of science, the progress is quite fast. If you ever find an incorrect or missing value, please drop me an email.
de: In der Welt der Wissenschaft ist der Fortschritt unglaublich schnell. Wenn Sie einen falschen Wert finden oder einen Wert vermissen, schicken Sie mir eine E-Mail.

source: Find some bugs or give some suggestions
de: Suchen Sie Fehler oder machen Sie Verbesserungsvorschläge

source: If you find any bugs in the program, or have a few suggestions for improvements, please let me know at &Carsten.Niehaus.mail;.
de: Wenn Sie Fehler im Programm finden oder Vorschläge für Verbesserungen haben, lassen Sie es mich wissen unter &Carsten.Niehaus.mail;.

source: Credits and License
de: Danksagungen und Lizenz

source: Program Copyright, 2001-2005 &Carsten.Niehaus; &Carsten.Niehaus.mail;
de: Programm Copyright 2001-2005 Carsten Niehaus &Carsten.Niehaus.mail;

source: Contributors:
de: Mitwirkende:

source: CREDIT_FOR_TRANSLATORS
de: <para>Übersetzung: Thorsten Mürell <email>thorsten@muerell.de</email></para><para>Übersetzung: Christoph Hamann <email>chhamann@gmx.de</email></para>

source: How to obtain &kalzium;
de: Bezugsquellen von &kalzium;

source: Web Presence
de: Web-Präsenz

source: &kalzium; itself can be found on <ulink url="http://edu.kde.org/kalzium">The &kalzium; home page</ulink> and is part of the &kde;-Edu project
de: &kalzium; finden Sie auf der <ulink url="http://edu.kde.org/kalzium">&kalzium;-Webseite</ulink>. &kalzium; ist Teil des &kde;-Edu-Projektes.

source: Compilation and Installation
de: Kompilierung und Installation
