Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdeedu/kbruch.po
Languages: de

source: <title>Exercise Mixed Numbers</title>
de: <title>Übung Gemischter Bruch</title>

source: In this exercise you have to convert a given mixed number into an improper fraction (ratio) and vice versa. You have to enter numerator and denominator for improper fraction or a whole number, numerator and denominator for mixed number.
de: In dieser Übung muss eingemischter Bruch in einen unechten Bruch (Verhältnis) umgewandelt werden und umgekehrt. Sie müssen sowohl den Zähler als auch den Nenner für einen unechten Bruch oder eine ganze Zahl, einen Zähler und einen Nenner für einen unechten Bruch eingeben.

source: <screeninfo>Exercise Mixed Numbers</screeninfo>
de: <screeninfo>Übungen Gemischter Bruch</screeninfo>

source: <phrase>Exercise Mixed Numbers</phrase>
de: <phrase>Übung Gemischter Bruch</phrase>

source: On the left side of the equal sign in the screenshot above you can see a mixed number. This means, that the number is made up of a whole number and a proper fraction. You should enter the equal improper fraction (the numerator part of such fraction is greater or equal to the denominator part).
de: Auf der linken Seite des Gleichheitszeichen im Bildschirmfoto oben steht ein gemischter Bruch. Das bedeutet, dass der Bruch aus einer ganzen Zahl und einem echten Bruch besteht. Sie müssen den unechten Bruch mit dem gleichen Wert eingeben. Bei einem unechten Bruch ist der Zähler größer oder gleich dem Nenner.

source: <title>Exercise Factorization</title>
de: <title>Übung Faktorisieren</title>

source: In this exercise you have to factorize a given number into its prime factors. You have to enter all prime factors of the number.
de: In dieser Übung muss eine gegebene Zahl in ihre Primfaktoren zerlegt werden. Es müssen alle Primfaktoren eingegeben werden.

source: <screeninfo>Exercise Factorization</screeninfo>
de: <screeninfo>Übung Faktorisieren</screeninfo>

source: <phrase>Exercise Factorization</phrase>
de: <phrase>Übung Faktorisieren</phrase>

source: You can enter a factor by clicking on the prime factor buttons. The <quote>x</quote> sign is automatically inserted, when you click the next prime factor button. You can remove the last entered prime factor by clicking on the <guibutton>Backspace</guibutton> button.
de: Ein Faktor wird durch Anklicken des entsprechenden Primfaktorknopfes hinzugefügt. Das Zeichen <quote>x</quote> wird automatisch eingefügt, wenn du den nächsten Primfaktor eingibst. Der zuletzt eingegebene Faktor kann durch Anklicken des Knopfes <guibutton>Löschen</guibutton> wieder entfernt werden.

source: After you have entered all prime factors click on the <guibutton>Check</guibutton> button. &kbruch; will check your input and present the correct result. After this step you will get to the next task by clicking on the <guibutton>Next</guibutton> button.
de: Nachdem du alle Primfaktoren eingegeben hast muss der Knopf <guibutton>Überprüfen</guibutton> gedrückt werden. &kbruch; überprüft nun die Eingabe und zeigt das richtige Ergebnis. Nach diesem Schritt geht es mit dem Anklicken des Knopfes <guibutton>Weiter</guibutton> zur nächsten Aufgabe.

source: In the screenshot at the top of this page you can see a <quote>x</quote> between the prime factors. This is the multiplication sign. The product of all prime factors must be the number you try to factorize.
de: Im Bildschirmfoto am Anfang dieser Seite steht ein <quote>x</quote> zwischen den Primfaktoren. Das ist ein Multiplikationszeichen. Das Produkt aller Primfaktoren muss die zu faktorisierende Zahl ergeben.

source: You have to enter all prime factors even when a prime factor repeats several times. Example: As prime factors of number 18 you have to enter 2, 3 and 3.
de: Es müssen alle Primfaktoren eingegeben werden, selbst wenn sich ein Primfaktor mehrfach wiederholt. Als Primfaktoren für die Zahl 18 müssen zum Beispiel die Zahlen 2, 3 und 3 eingegeben werden.

source: <title>Exercise Percentage</title>
de: <title>Prozentaufgaben</title>

source: In this exercise you have to answer some percentage questions.
de: In dieser Übung müssen Prozentaufgaben gerechnet werden.

source: <screeninfo>Exercise Percentage</screeninfo>
de: <screeninfo>Prozentaufgaben</screeninfo>

source: <phrase>Exercise Percentage</phrase>
de: <phrase>Prozentaufgaben</phrase>

source: After you have entered your answer click on the <guibutton>Check</guibutton> button. &kbruch; will check your input and present the correct result. After this step you will get to the next task by clicking on the <guibutton>Next</guibutton> button.
de: Nachdem du die Antwort eingegeben hast, muss der Knopf <guibutton>Überprüfen</guibutton> gedrückt werden. &kbruch; überprüft nun die Eingabe und zeigt das richtige Ergebnis. Nach diesem Schritt geht es mit dem Anklicken des Knopfes <guibutton>Weiter</guibutton> zur nächsten Aufgabe.

source: Credits and License
de: Danksagungen und Lizenz

source: Program and documentation Copyright, 2001-2011 Sebastian Stein <email>seb.kde@hpfsc.de</email>
de: Copyright für Programm und Dokumentation, 2001-2011 Sebastian Stein <email>seb.kde@hpfsc.de</email>

source: Thank you goes to:
de: Dank geht an:

source: &Anne-Marie.Mahfouf; for managing the &kde; Edu project
de: &Anne-Marie.Mahfouf; für die Betreuung des &kde;-Edu Projektes

source: Klas Kalass for helping design the interface
de: Klas Kalass für die Gestaltung der Oberfläche

source: Eva Brucherseifer for writing <application>KMath</application> (&kbruch;'s &GUI; is based on this work)
de: Eva Brucherseifer für <application>KMath</application> (Die Oberfläche von &kbruch; basiert auf dieser Arbeit)

source: Dominique Devriese for bug fixing
de: Dominique Devriese für Fehlerbeseitigung

source: <ulink url="http://www.net-tex.de/">Stefan Schumacher</ulink> for testing a very early version
de: <ulink url="http://www.net-tex.de/">Stefan Schumacher</ulink> für den Test einer sehr frühen Version

source: <ulink url="http://www.guckes.net/">Sven Guckes</ulink> for testing the text interface (which has been removed)
de: <ulink url="http://www.guckes.net/">Sven Guckes</ulink> für den Test der Textoberfläche (die inzwischen entfernt wurde)

source: &David.Faure; for helping with &kde; <acronym>CVS</acronym> and &kde; Bugzilla
de: &David.Faure; für seine Unterstützung bei &kde;-<acronym>CVS</acronym> und &kde;-Bugzilla

source: &Robert.Gogolok; for helping with &kde; <acronym>CVS</acronym>
de: &Robert.Gogolok; für seine Unterstützung bei &kde; <acronym>CVS</acronym>

source: John Kesson for proof reading the handbook
de: John Kesson für das Korrekturlesen des Handbuchs

source: New interface design and usability improvements for &kde; 4.1:
de: Neues Oberflächendesign und Verbesserung der Benutzbarkeit für &kde; 4.1:

source: CREDIT_FOR_TRANSLATORS
de: <para>Übersetzung Sebastian Stein<email>seb.stein@hpfsc.de</email></para>

source: How to obtain &kbruch;
de: Bezugsquellen von &kbruch;

source: Requirements
de: Anforderungen

source: In order to successfully use &kbruch;, you need &kde; > 4.1 .
de: Um &kbruch; erfolgreich einsetzen zu können, benötigen Sie &kde; > 4.1 .

source: &kbruch; itself can be found on <ulink url="http://edu.kde.org/kbruch/">the &kbruch; home page</ulink> and it is part of the &kde; Edu project
de: &kbruch; finden Sie auf der <ulink url="http://edu.kde.org/kbruch/">&kbruch;-Internetseite</ulink>. &kbruch; ist ein Teil des &kde;-Edu-Projektes.

source: You can find a list of changes in the <acronym>Git</acronym> commit messages.
de: Ein Liste mit Änderungen finden Sie in den <acronym>Git</acronym> Protokollen.

source: Compilation and Installation
de: Kompilierung und Installation
