Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdeedu/kbruch_man-kbruch.1.po
Languages: de

source: KDE User's Manual
de: KDE-Benutzerhandbuch

source: Learn calculating with fractions
de: Rechnen mit Brüchen lernen

source: <command>kbruch</command> <arg choice="opt">KDE Generic Options</arg> <arg choice="opt">Qt Generic Options</arg>
de: <command>kbruch</command> <arg choice="opt">Allgemeine KDE-Optionen</arg> <arg choice="opt">Allgemeine Qt-Optionen</arg>

source: Description
de: Beschreibung

source: &kbruch; is a small program to practice calculating with fractions. Different exercises are provided for this purpose. The program checks user's input and gives feedback.
de: &kbruch; ist ein kleines Programm, um das Rechnen mit Brüchen zu üben. Für diesen Zweck werden verschiedene Übungen angeboten. Das Programm überprüft die Eingaben des Benutzers und gibt entsprechende Rückmeldungen.

source: See Also
de: Siehe auch

source: More detailed user documentation is available from <ulink url="help:/kbruch">help:/kbruch</ulink> (either enter this <acronym>URL</acronym> into &konqueror;, or run <userinput><command>khelpcenter</command> <parameter>help:/kbruch</parameter></userinput>).
de: Weitere ausführliche Dokumentation finden Sie unter <ulink url="help:/kbruch">help:/kbruch</ulink> (geben Sie diese <acronym>URL</acronym> entweder im &konqueror; ein oder starten Sie <userinput><command>khelpcenter</command> <parameter>help:/kbruch</parameter></userinput>).

source: There is also further information available at <ulink url="http://edu.kde.org/kbruch/">the kde-edu website</ulink>
de: Weitere Informationen finden Sie auf der <ulink url="http://edu.kde.org/kbruch/"> &kde; Edutainment Webseite</ulink>.

source: Authors
de: Autoren

source: &kbruch; was written by <personname><firstname>Sebastian</firstname><surname>Stein</surname></personname> <email>seb.kde@hpfsc.de</email>
de: &kbruch; wurde von <personname><firstname>Sebastian</firstname><surname>Stein</surname></personname><email>seb.kde@hpfsc.de</email> geschrieben.
