Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdeedu/kbruch.po
Languages: de

source: The &kbruch; Handbook
de: Das Handbuch zu &kbruch;

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Sebastian</firstname><surname>Stein</surname><affiliation><address><email>seb.kde@hpfsc.de</email></address></affiliation><contrib>Deutsche Übersetzung</contrib></othercredit>

source: &kbruch; is a small program to practice calculating with fractions and percentages. Different exercises are provided for this purpose and you can use the learning mode to practice with fractions. The program checks the user's input and gives feedback.
de: &kbruch; ist ein kleines Programm, um das Rechnen mit Brüchen und Prozenten zu üben. Für diesen Zweck werden verschiedene Übungen angeboten. Außerdem gibt es einen Modus für das Lernen von Brüchen. Das Programm überprüft die Eingaben des Benutzers und gibt entsprechende Rückmeldungen.

source: education
de: Bildung

source: fraction
de: Bruch

source: percentage
de: Prozentsatz

source: mathematics
de: Mathematik

source: denominator
de: Hauptnenner

source: Introduction
de: Einleitung

source: &kbruch; is a small program to practice calculating with fractions and percentages. Six different exercises are offered as well as a learning mode.
de: &kbruch; ist ein kleines Programm, um das Rechnen mit Brüchen und Prozenten zu üben. Es werden sechs verschiedene Übungen angeboten, dazu noch ein Lernmodus für Brüche.

source: Arithmetic - in this exercise you have to solve a given fraction task. You have to enter the numerator and the denominator. This is the main exercise.
de: Arithmetik - in dieser Übung muss eine gegebene Bruchaufgabe gelöst werden. Du musst den ganzzahligen Anteil des Bruchs und Zähler und Nenner eingeben. Dies ist die Hauptübung.

source: Comparison - in this exercise you have to compare the size of 2 given fractions, using the symbols <guibutton>&gt;</guibutton>, <guibutton>&lt;</guibutton> or <guibutton>=</guibutton>.
de: Vergleich - in dieser Übung müssen 2 gegebene Brüche der Größe nach verglichen mithilfe der Symbole <guibutton>&gt;</guibutton>, <guibutton>&lt;</guibutton> oder <guibutton>=</guibutton> werden.

source: Conversion - in this exercise you have to convert a given number into a fraction.
de: Umwandeln - in dieser Übung muss eine gegebene Zahl in einen Bruch umgewandelt werden.

source: Mixed Numbers - in this exercise you have to convert a mixed number into an improper fraction (ratio) and vice versa.
de: Gemischter Bruch - in dieser Übung muss ein gegebener gemischter Bruch in einen unechten Bruch und umgekehrt umgewandelt werden.

source: Factorization - in this exercise you have to factorize a given number into its prime factors.
de: Faktorisieren - in dieser Übung muss eine gegebene Zahl in ihre Primfaktoren zerlegt werden.

source: Percentage - in this exercise you have to calculate percentages.
de: Prozentaufgaben - in dieser Übung müssen Prozente berechnet werden.

source: In each different exercise &kbruch; will generate a task and the user has to solve it. The program checks the input and gives a feedback about it.
de: In jeder Übung erzeugt &kbruch; eine Aufgabe und der Benutzer muss sie lösen. Das Programm überprüft die Eingabe und gibt eine entsprechende Rückmeldung.

source: &kbruch; counts how many tasks were solved at all and how many tasks were solved correctly. The statistics are shown to the user.
de: &kbruch; zählt die Anzahl gelöster Aufgaben und wieviel Aufgaben davon richtig gelöst wurden. Diese Statistik wird dem Benutzer angezeigt.

source: &kbruch; is very compact and focuses on the core idea of a task generator. An online help system provides context-sensitive help for the different situations.
de: &kbruch; ist sehr kompakt und konzentriert sich auf die Idee eines Aufgabenerzeugers. Das Handbuch bietet Hilfe für die verschiedenen Situationen.

source: Using &kbruch;
de: &kbruch; anwenden

source: Choosing the mode: learning or exercises
de: Auswahl des Modus: Lernen oder Übungen

source: When you start &kbruch;, it offers you two modes: <guilabel>Exercise</guilabel> which is the training mode and <guilabel>Learning</guilabel> where you can understand fractions. Clicking one of the pictures will enter the chosen mode. Here is a screenshot of &kbruch;'s mode choices:
de: Beim Start von &kbruch; werden zwei Arbeitsweisen zur Auswahl angeboten: <guilabel>Übungen</guilabel>, um Aufgaben zu lösen und <guilabel>Lernen</guilabel> mit Erklärungen zu Brüchen. Klicke auf eines der Symbole, um einen Modus zu starten. Hier ein Bildschirmfoto der Modusauswahl von &kbruch;:

source: <screeninfo>&kbruch; mode choices</screeninfo>
de: <screeninfo>&kbruch;s Modusauswahl</screeninfo>

source: <phrase>&kbruch; mode choices</phrase>
de: <phrase>&kbruch;s Modusauswahl</phrase>

source: Click one of the picture to choose the mode.
de: Klicke auf ein Symbol, um einen Modus auszuwählen.

source: Main Exercise Screen
de: Das Hauptfenster im Übungsmodus

source: Here is a screenshot of &kbruch;'s main exercise screen:
de: Hier ist ein Bildschirmfoto des Hauptfensters für den Übungsmodus von &kbruch;:

source: &kbruch; main screen, directly after the exercise start
de: &kbruch; Hauptfenster, direkt nach dem Start des Übungsmodus

source: &kbruch; main screen
de: &kbruch; Hauptfenster

source: All exercises take place in this screen. This ensures that &kbruch; is easy to use even for young users! The main screen is separated into 5 parts: <itemizedlist> <listitem><para> the menubar with the 3 menus <guimenu>File</guimenu>, <guimenu>Settings</guimenu> and <guimenu>Help</guimenu> </para></listitem> <listitem><para> the toolbar, where you can switch between the different exercises </para></listitem> <listitem><para> the <guilabel>Options</guilabel> on the left, where you can define the difficulty and various settings for the tasks </para></listitem> <listitem><para> the task part, where you have to enter the result of the given task </para></listitem> <listitem><para> the statistical part, where you can see how many tasks have been solved correctly or attempted </para></listitem> </itemizedlist> At any time, you can go back to Modes using the <guiicon>Back</guiicon> icon in the toolbar.
de: Alle Übungen werden in diesem Fenster ausgeführt. Damit kann &kbruch; auch von Kindern benutzt werden. Das Fenster ist in fünf Bereiche aufgeteilt: <itemizedlist><listitem><para>die Menüleiste mit den drei Menüs <guimenu>Datei</guimenu>, <guimenu>Einstellungen</guimenu> und <guimenu>Hilfe</guimenu></para></listitem><listitem><para>die Werkzeugleiste mit Knöpfen zum Wechseln der Aufgaben</para></listitem><listitem><para>die <guilabel>Optionen</guilabel> auf der linken Seite mit Einstellungen für die verschiedenen Aufgaben </para></listitem><listitem><para>der Aufgabenbereich, in dem die Ergebnisse eingetragen werden müssen</para></listitem><listitem><para>die Statistik, in der die Anzahl der Aufgaben und der richtigen bzw. falschen Lösungen angezeigt wird</para></listitem></itemizedlist>. Mit dem Knopf <guiicon>Zurück</guiicon>in der Werkzeugleiste kannst du jederzeit zur Modusauswahl zurückgehen.

source: You can hide the <guilabel>Options</guilabel> section by dragging it to the left.
de: Die <guilabel>Optionen</guilabel> können durch Ziehen des rechten Trenners zum Hauptfenster ganz nach links ausgeblendet werden.

source: First you have to choose an exercise in the toolbar. Default is <guilabel>Arithmetic</guilabel>. The task part will change according to the chosen task. Some settings in the <guilabel>Options</guilabel> section will be enabled, depending on the task you have chosen.
de: Zuerst muss eine Übung in der Werkzeugleiste ausgewählt werden. Als Standard ist <guilabel>Arithmetik</guilabel> eingestellt. Der Aufgabenteil passt sich der gewählten Übung entsprechend an. Einige Einstellmöglichkeiten im Abschnitt <guilabel>Optionen</guilabel> werden passend zu den ausgewählten Aufgaben aktiviert.

source: You will find an icon to generate a new task in the toolbar as well. This action is also available in the menu <menuchoice><guimenu>File</guimenu><guimenuitem>New</guimenuitem></menuchoice>. This action is always enabled. If you have not solved the currently given task, a new task is generated and the statistics are set back.
de: In der Symbolleiste befindet sich weiterhin ein Symbol, um eine neue Aufgabe zu erstellen. Dieser Befehl ist ebenfalls verfügbar über <menuchoice><guimenu>Datei</guimenu><guimenuitem>Neu</guimenuitem></menuchoice>. Dieser Befehl steht immer zur Verfügung. Wurde die aktuelle Aufgabe noch nicht gelöst, dann wird eine neue Aufgabe erstellt und die Statistik zurückgesetzt.

source: If you terminate &kbruch; the currently chosen exercise will be saved and restored on next startup.
de: Beim Beenden von &kbruch; wird die aktuell gewählte Übung gespeichert und beim nächsten Start wieder aufgerufen.

source: Statistical Part
de: Statistikteil

source: <screeninfo>&kbruch; statistics</screeninfo>
de: <screeninfo>&kbruch;s Statistik</screeninfo>

source: <phrase>&kbruch; statistics</phrase>
de: <phrase>&kbruch;s Statistik</phrase>

source: In this part of the main screen you can see:
de: In diesem Teil des Hauptfensters können Sie ablesen:

source: on the left, how many tasks have been solved
de: links, wieviele Aufgaben bearbeitet wurden

source: on the right, in green, how many tasks have been solved correctly
de: rechts in Grün, wieviele Aufgaben richtig gelöst wurden

source: on the right, in red, how many tasks have been solved incorrectly
de: rechts in Rot, wieviele Aufgaben falsch gelöst wurden

source: on the right, in orange, how many tasks have been skipped
de: rechts in Orange, wieviele Aufgaben übersprungen wurden

source: You can reset the statistics by clicking on the <guimenu>New</guimenu> button in the toolbar or choosing <menuchoice><guimenu>File</guimenu> <guimenuitem>New</guimenuitem></menuchoice> in the menubar.
de: Die Statistik wird durch Klicken auf den Knopf <guimenu>Neu</guimenu> in der Werkzeugleiste oder durch Auswahl von <menuchoice><guimenu>Datei</guimenu> <guimenuitem>Neu</guimenuitem> </menuchoice> in der Menüleiste zurückgesetzt.

source: The statistics will be saved when &kbruch; is closed and restored on next startup.
de: Die Statistik wird beim Beenden von &kbruch; gespeichert und beim nächsten Start wieder geladen.

source: Configuring &kbruch; appearance
de: Das Erscheinungsbild von &kbruch; einrichten

source: In this dialog you can adjust some general settings for the task display. To open this dialog use <menuchoice><guimenu>Settings</guimenu><guimenuitem>Configure &kbruch;</guimenuitem></menuchoice>.
de: In diesem Dialog können einige allgemeine Einstellungen für die Darstellung der Aufgaben gesetzt werden. Dieser Dialog wird über <menuchoice><guimenu>Einstellungen</guimenu><guimenuitem>&kbruch; einrichten ...</guimenuitem></menuchoice> aufgerufen.

source: <screeninfo>&kbruch; settings dialog</screeninfo>
de: <screeninfo>&kbruch;s Einrichtungsdialog</screeninfo>

source: <phrase>&kbruch; settings dialog</phrase>
de: <phrase>&kbruch;s Einrichtungsdialog</phrase>

source: There are two tabs to adjust the setting:
de: Es gibt zwei Seiten zur Anpassung der Einstellungen:

source: <guilabel>Colors</guilabel>: Choose the colors for the different parts of a mathematical expression: numbers, operational sign, fraction bar.
de: <guilabel>Farben</guilabel>: Einstellung der Farben für die verschiedenen Teile eines mathematischen Ausdrucks.: Zahlen, Operationszeichen und Bruchstrich.

source: <guilabel>Fonts</guilabel>: Choose a font for displaying the task.
de: <guilabel>Schriftarten</guilabel>: Einstellung der Schriftarten für die Anzeige der Aufgaben.

source: The settings will be saved on &kbruch;'s termination and restored on the next startup.
de: Die Einstellungen werden beim Beenden von &kbruch; gespeichert und beim nächsten Start geladen.

source: Main learning screen
de: Das Hauptfenster im Lernmodus

source: <screeninfo>&kbruch; learning mode</screeninfo>
de: <screeninfo>&kbruch;s Lernmodus</screeninfo>

source: <phrase>&kbruch; learning mode</phrase>
de: <phrase>&kbruch;s Lernmodus</phrase>

source: Clicking the <guibutton>Hint</guibutton> button toggles the display of the help on the right which explains you how the rings work.
de: Klicken auf den Knopf <guibutton>Tipp</guibutton> in der Werkzeugleiste schaltet die Anzeige der Hilfe rechts ein und aus. In dieser Hilfe wird erklärt, wie die Darstellung der Brüche mit den Ringen funktioniert.

source: Exercises
de: Übungen

source: Exercise Arithmetic
de: Übung Arithmetik

source: In this exercise you have to solve a given task. Therefore you have to enter the integer part of a fraction and the numerator and the denominator. The difficulty of the generated task can be adjusted by using some options on the left.
de: In dieser Übung muss eine gegebene Bruchaufgabe gelöst werden. Dazu muss der ganzzahlige Anteil des Bruchs sowie Zähler und Nenner eingegeben werden. Der Schwierigkeitsgrad der Aufgaben kann mit den Optionen links im Hauptfenster eingestellt werden.

source: Options
de: Optionen

source: There are several parameters which influence the difficulty of the generated tasks:
de: Es gibt mehrere Parameter, die die Schwierigkeit der Aufgaben beeinflussen:

source: Question
de: Frage

source: Mixed number
de: Gemischte Brüche

source: Set if the fractions will appear as mixed numbers or not in the question expression ( mixed number example: 1 4/5 = 9/5 ).
de: Legt fest, ob die Brüche in der Frage als gemischte Brüche oder nicht erscheinen sollen (Beispiel für einen gemischten Bruch: 1 4/5 = 9/5).

source: Number of terms
de: Anzahl der Terme

source: The number of terms (separate fractions) given in each task. From 2 to 5, inclusive.
de: Die Anzahl von Termen in einer gegebenen Aufgabe, von 2 bis einschließlich 5.

source: Maximum denominator
de: Maximaler Hauptnenner

source: The highest number &kbruch; will use as the main denominator in the tasks it sets. From a minimum of 10 to a maximum of 50.
de: Die höchste Zahl für den Hauptnenner, die in &kbruch; für eine Aufgabe benutzt wird. Der Wert liegt zwischen 10 und 50.

source: Answer
de: Antwort

source: Set if the fractions will appear as mixed numbers or not in the answer ( mixed number example: 1 4/5 = 9/5 ).
de: Legt fest, ob die Brüche in der Antwort als gemischte Brüche oder nicht erscheinen sollen (Beispiel für einen gemischten Bruch: 1 4/5 = 9/5).

source: Reduced Form
de: Gekürzte Form

source: Check this to force the use of the reduced form.
de: Mit dieser Einstellung wird die Eingabe der gekürzten Form gefordert.

source: Operations
de: Rechenarten

source: Operations which should be used in the task: <guilabel>Addition</guilabel>, <guilabel>Subtraction</guilabel>, <guilabel>Multiplication</guilabel> or <guilabel>Division</guilabel>. Check all operations you want to use.
de: Rechenarten, die in dieser Aufgabe genutzt werden sollen: <guilabel>Addition</guilabel>, <guilabel>Subtraktion</guilabel>, <guilabel>Multiplikation</guilabel> oder <guilabel>Division</guilabel>. Kreuze alle Rechenarten an, die geübt werden sollen.

source: After you have changed the parameters you have to click on the <guimenu>New</guimenu> button in the toolbar to generate a task which uses the new parameters. You can also call this action from the menubar with <menuchoice><guimenu>Task</guimenu><guimenuitem>New</guimenuitem></menuchoice>. This will reset the statistics. To avoid that, click the <guibutton>Next</guibutton> button to proceed with the changed parameters.
de: Nach Änderung der Parameter klicke auf den Knopf <guimenu>Neu</guimenu> in der Werkzeugleiste. Dadurch wird eine neue Aufgabe unter Verwendung der neuen Parameter erstellt. Dieser Befehl ist auch im Menü <menuchoice><guimenu>Datei</guimenu> <guimenuitem>Neu</guimenuitem> </menuchoice> zu erreichen. Damit wird die Statistik zurückgesetzt. Um das zu vermeiden, klicke auf den Knopf <guibutton>Weiter</guibutton> um die Übung mit den geänderten Parametern fortzusetzen.

source: The chosen parameters will be saved on &kbruch;'s termination and restored on next startup.
de: Die Parametereinstellungen werden beim Beenden von &kbruch; gespeichert und beim nächsten Start wiederhergestellt.

source: Solving Tasks
de: Aufgaben lösen

source: After you have solved a given task, you need to enter the result into the three input boxes. In the left box you enter the integer part of the fraction, in the upper box the numerator and in the lower box the denominator. If the option <guilabel>Mixed number</guilabel> in the <guilabel>Answer</guilabel> section is unchecked, the left box for the integer part of the fraction is hidden. Then you use only the numerator box and the denominator box for your input.
de: Wenn du die Lösung errechnet hast, musst du das Ergebnis in die drei Eingabefelder eintragen, in das linke Feld den ganzzahligen Anteil des Bruchs, in das obere Feld den Zähler und in das untere Feld den Nenner. Wenn <guilabel>Gemischte Brüche</guilabel> im Abschnitt <guilabel>Antwort</guilabel> nicht angekreuzt ist, wird das linke Eingabefeld für den ganzzahligen Anteil des Bruchs ausgeblendet. Dann gibst du nur Zähler und Nenner ein.

source: If the result is negative, you can enter a minus sign in front of the numerator or denominator. If the result is 0, just type a 0 in the numerator input field. If the result has a denominator of 1, you can leave the lower box empty.
de: Falls das Ergebnis negativ ist, kann das entsprechende Minuszeichen entweder mit dem Zähler oder mit dem Nenner eingetragen werden. Falls das Ergebnis 0 ist, reicht es lediglich eine 0 für den Zähler einzutragen. Hat das Ergebnis einen Nenner von 1, kann das untere Eingabefeld leergelassen werden.

source: After you have entered the result you should click the <guibutton>Check</guibutton> button below the input boxes. &kbruch; will check your input and present the correct result on the right below the <guilabel>Incorrect!</guilabel> string:
de: Nachdem das Ergebnis eingegeben wurde, musst du auf den Knopf <guimenu>Überprüfen</guimenu> unter den Eingabefeldern klicken. &kbruch; überprüft die Eingabe und zeigt die richtige lösung rechts unter der Beschriftung <guibutton>Falsch</guibutton> an:

source: <screeninfo>Checked Task</screeninfo>
de: <screeninfo>Überprüfte Aufgabe</screeninfo>

source: <phrase>Checked Task</phrase>
de: <phrase>Überprüfte Aufgabe</phrase>

source: This task was solved incorrectly. The correct value is shown in 2 different forms: normal (reduced) and mixed number.
de: Diese Aufgabe wurde falsch gelöst. Das richtige Ergebnis wird in zwei unterschiedlichen Schreibweisen angezeigt: normal (reduziert) und als gemischter Bruch.

source: If you checked the <guibutton>Reduced form</guibutton> in the Options in the <guilabel>Answers</guilabel> section then you always have to enter the result reduced. &kbruch; will show you a short message like the one in the screenshot below, if you enter the correct result unreduced. The answer will then be counted as incorrect.
de: Wenn in den Optionen im Abschnitt <guilabel>Antwort</guilabel> die <guibutton>Gekürzte Form</guibutton> ausgewählt ist, muss das Ergebnis immer gekürzt eingegeben werden. &kbruch; zeigt einen kurzen Hinweis wie im unten dargestellten Bildschirmfoto, wenn du das richtige Ergebnis ungekürzt eingibst. Die Antwort wird dann als falsch bewertet.

source: <screeninfo>Unreduced Result</screeninfo>
de: <screeninfo>Ungekürztes Ergebnis</screeninfo>

source: <phrase>Unreduced Result</phrase>
de: <phrase>Ungekürztes Ergebnis</phrase>

source: To continue with the next task, click on the <guibutton>Next</guibutton> button. If you want to change the parameters for the next task please do this before clicking on the <guibutton>Next</guibutton> button.
de: Um mit der nächsten Aufgabe fortzufahren, klicke auf den Knopf <guibutton>Weiter</guibutton>. Möchtest du die Parameter für die nächste Aufgabe ändern, muss dies vor dem Klick auf den Knopf <guibutton>Weiter</guibutton> geschehen.

source: <title>Exercise Comparison</title>
de: <title>Übung Vergleich</title>

source: In this exercise you have to compare 2 given fractions. You have to choose the bigger fraction of both by selecting the correct comparison sign.
de: In dieser Übungen müssen 2 gegebene Brüche verglichen werden. Du musst den größeren der beider Brüche wählen, indem du das richtige Vergleichszeichen auswählst.

source: <screeninfo>Exercise Comparison</screeninfo>
de: <screeninfo>Übungen Vergleich</screeninfo>

source: <phrase>Exercise Comparison</phrase>
de: <phrase>Übung Vergleich</phrase>

source: First choose the correct comparison sign. After you have chosen the comparison sign, the result will show on the right. A green square with <guilabel>Correct</guilabel> will tell you that your answer was correct while a red square with <guilabel>Incorrect</guilabel> will indicate that your answer was wrong. You will get to the next task by clicking the <guibutton>Next</guibutton> button.
de: Zuerst muss das richtige Vergleichszeichen gewählt werden. Dann wird die die Eingabe überprüft und das Ergebnis auf der rechten Seite angezeigt. Ein grünes Rechteck mit der Aufschrift <guilabel>Richtig</guilabel> für eine richtige Lösung, ein rotes Rechteck mit der Aufschrift <guilabel>Falsch</guilabel> bei einem Fehler. Drücke den Knopf <guibutton>Weiter</guibutton>, um zur nächsten Aufgabe zu kommen.

source: In this exercise only the option <guilabel>Mixed number</guilabel> is enabled. If checked the fractions will appear as mixed numbers.
de: In dieser Übung kann nur die Einstellung <guilabel>Gemischte Brüche</guilabel> ausgewählt werden, dann werden alle Brüche in gemischter Schreibweise angezeigt.

source: <title>Exercise Conversion</title>
de: <title>Übung Umwandeln</title>

source: In this exercise you have to convert a given number into a fraction. You have to enter numerator and denominator.
de: In dieser Übung muss eine gegebene Zahl in einen Bruch umgewandelt werden. Dazu muss sowohl der Zähler als auch der Nenner eingegeben werden.

source: <screeninfo>Exercise Conversion</screeninfo>
de: <screeninfo>Übung Umwandeln</screeninfo>

source: <phrase>Exercise Conversion</phrase>
de: <phrase>Übung Umwandeln</phrase>

source: On the left side of the equal sign in the screenshot above you can see a recurring decimal. This means, that the fraction shown as a decimal has a repeating part. The repeating part is marked with the small bar above the numbers. Those numbers repeat ad infinitum.
de: Auf der linken Seite des Gleichheitszeichen im Bildschirmfoto oben steht ein periodischer Dezimalbruch. Das bedeutet, dass der Bruch dargestellt als Dezimalzahl einen sich wiederholenden Teil hat. Der sich wiederholende Teil ist mit einer kleinen Linie über den entsprechenden Zahlen gekennzeichnet. Diese Zahlen wiederholen sich unendlich oft.

source: After you have entered the numerator and denominator click on the <guibutton>Check</guibutton> button. &kbruch; will check your input and present the correct result. After this step you will get to the next task by clicking on the <guibutton>Next</guibutton> button.
de: Nach der Eingabe von Zähler und Nenner muss der Knopf <guibutton>Überprüfen</guibutton> gedrückt werden. &kbruch; überprüft nun die Eingabe und zeigt das richtige Ergebnis. Nach diesem Schritt geht es mit dem Anklicken des Knopfes <guibutton>Weiter</guibutton> zur nächsten Aufgabe.

source: Do not forget to enter the result reduced. Unreduced results will be counted as solved not correctly.
de: Das Ergebnis ist gekürzt einzugeben. Ungekürzte Ergebnisse werden als nicht richtig gewertet.

source: In this exercise all options are disabled.
de: In dieser Übung sind alle Einstellungen nicht aktiviert.
