Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdeedu/kgeography.po
Languages: de

source: The &kgeography; Handbook
de: Das Handbuch zu &kgeography;

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Burkhard</firstname><surname>Lück</surname><affiliation><address><email>lueck@hube-lueck.de</email></address></affiliation><contrib>Übersetzung</contrib></othercredit>

source: &kgeography; is a geography learning tool for &kde;. Right now it has seven usage modes:
de: &kgeography; ist ein Erdkunde-Lernprogramm für &kde;. Derzeit gibt es sieben verschiedenen Übungen:

source: Browse the maps clicking in a map division to see its name, capital and flag
de: Landkarte erkunden, indem Sie in der Karte auf ein Land klicken und dessen Name, Hauptstadt und Flagge angezeigt wird

source: The game tells you a map division name and you have to click on it
de: Der Name eines Landes wird gefragt und Sie müssen es auf der Karte anklicken.

source: The game tells you a capital and you have to guess the division it belongs to
de: Ein Land anhand des Namens der Hauptstadt raten

source: The game tells you a division and you have to guess its capital
de: Die Hauptstadt eines Landes raten

source: The game shows you a map division flag and you have to guess its name
de: Ein Land anhand der Flagge erraten

source: The game tells you a map division name and you have to guess its flag
de: Die Flagge eines Landes erraten

source: The game shows an empty map and you have to place divisions on it one by one
de: Länder auf einer leeren Landkarte platzieren

source: geography
de: Geografie

source: maps
de: Karten

source: countries
de: Länder

source: Introduction
de: Einleitung

source: &kgeography; is a geography learning tool for &kde;. It allows you to learn about the political divisions of some countries (divisions, capitals of those divisions and their associated flags if there are some).
de: &kgeography; ist ein Erdkunde-Lernprogramm für &kde;. Damit können Sie die politischen Daten einiger Länder lernen (Länder, ihre Hauptstädte und ihre Flaggen).

source: Quick Start to &kgeography;
de: Kurze Einführung in &kgeography;

source: When you run &kgeography; for the first time, it first asks you to choose a map to start with.
de: Beim ersten Start von &kgeography; müssen Sie eine Karte auswählen.

source: You can filter the map list using <guilabel>Filter Maps</guilabel> text field. Just enter a few first letters of the map name to narrow down the list to a few matches.
de: Sie können das Textfeld <guilabel>Karten filtern</guilabel> benutzen, um für die Liste der Karten einen Filter einzugeben. Geben Sie einige Buchstaben der gesuchten Karte ein, dann wird die erste passende Karte ausgewählt.

source: <screeninfo>Here's a screenshot of &kgeography; at first start</screeninfo>
de: <screeninfo>Bildschirmfoto von &kgeography; beim ersten Start</screeninfo>

source: <phrase>Here's a screenshot of &kgeography; at first start</phrase>
de: <phrase>Bildschirmfoto von &kgeography; beim ersten Start</phrase>

source: Here we choose Canada
de: Hier ist Kanada ausgewählt

source: <screeninfo>Canada is chosen</screeninfo>
de: <screeninfo>Kanada ist ausgewählt</screeninfo>

source: <phrase>Canada is chosen</phrase>
de: <phrase>Kanada ist ausgewählt</phrase>

source: And &kgeography; main window appears with the map of Canada:
de: Die Karte von Kanada wird im Hauptfenster von &kgeography; angezeigt:

source: <screeninfo>&kgeography; main window</screeninfo>
de: <screeninfo>Hauptfenster von &kgeography;</screeninfo>

source: <phrase>&kgeography; main window</phrase>
de: <phrase>Hauptfenster von &kgeography;</phrase>

source: You can then choose what type of learning or testing you want to do by looking at the menu on the left:
de: Nun können Sie im Menü auf der linken Seite des Programmfensters mehrere Übungen auswählen:

source: <screeninfo>&kgeography; menu</screeninfo>
de: <screeninfo>Menü von &kgeography;</screeninfo>

source: <phrase>&kgeography; menu</phrase>
de: <phrase>Menü von &kgeography;</phrase>

source: Explore Map: a &LMB; click on an area of the map will display information about that area, if you click on the small info icon on the popmap, it will open the wikipedia page for that division in the system's default browser:
de: Landkarte erkunden: Klicken Sie mit der &LMBn; in ein Gebiet auf der Karte, dann werden Informationen darüber angezeigt. Klicken Sie auf das Info-Symbol um de Wikipedia-Seite für dieses Gebiet im Standardbrowser ihres Systems zu öffnen.

source: <screeninfo>Browse the map</screeninfo>
de: <screeninfo>Landkarte erkunden</screeninfo>

source: <phrase>Browse the map</phrase>
de: <phrase>Landkarte erkunden</phrase>

source: Location of Provinces or Territories: you are first asked how many questions you want
de: Lage von Provinzen und Territorien: Zuerst müssen Sie die Anzahl der Fragen eingeben

source: <screeninfo>How many questions</screeninfo>
de: <screeninfo>Anzahl der Fragen</screeninfo>

source: <phrase>How many questions</phrase>
de: <phrase>Anzahl der Fragen</phrase>

source: Then you are asked to click on a specific province:
de: Dann wird der Name eines Landes angezeigt, Sie müssen das Land auf der Karte finden und darauf klicken.

source: <screeninfo>Click on a province</screeninfo>
de: <screeninfo>Klicken Sie auf ein Land</screeninfo>

source: <phrase>Click on a province</phrase>
de: <phrase>Klicken Sie auf ein Land</phrase>

source: When you finish all the questions, a result dialog is shown with your correct and uncorrect answers:
de: Wenn Sie alle Fragen beantwortet haben, wird ein Dialog mit allen richtigen und falschen Antworten angezeigt.

source: <screeninfo>Your results</screeninfo>
de: <screeninfo>Ihr Ergebnis</screeninfo>

source: <phrase>Your results</phrase>
de: <phrase>Ihr Ergebnis</phrase>

source: Place Provinces or Territories in the Map: the cursor takes the shape of a province and you have to place it in the map:
de: Platzieren von Provinzen und Territorien auf der Karte: Der Mauszeiger nimmt den Umriss einer Provinz an und diese muss auf der Karte platziert werden:

source: <screeninfo>Place a division in the map</screeninfo>
de: <screeninfo>Platzieren eines Landes auf der Karte</screeninfo>

source: <phrase>Place a division in the map</phrase>
de: <phrase>Platzieren eines Landes auf der Karte</phrase>

source: Provinces or Territories by Capital: you are asked to find the name of a province among a choice of 4 given its capital:
de: Provinzen und Territorien nach deren Hauptstadt raten: Aus vier vorgegebenen Provinzen raten Sie das Land mit der abgefragten Hauptstadt:

source: <screeninfo>Guess a division from its capital</screeninfo>
de: <screeninfo>Raten Sie ein Land nach dessen Hauptstadt</screeninfo>

source: <phrase>Guess a division from its capital</phrase>
de: <phrase>Raten Sie ein Land nach dessen Hauptstadt</phrase>

source: And the results are displayed when the test is finished:
de: Das Ergebnis wird am Ende angezeigt:

source: Capitals of Provinces and Territories: you have a capital and four province names and you must choose the correct one. As before, at the end a result dialog is shown.
de: Hauptstadt einer Provinz oder eines Territoriums raten: Ordnen Sie die angegebene Hauptstadt einer der vier vorgegebenen Provinzen zu. Wie bei den vorherigen Übungen wird am Ende Ihr Ergebnis angezeigt.

source: Provinces or Territories by Flag: a flag is shown and you must find the province it belongs to.
de: Provinz oder Territorium anhand der Flagge erkennen: Eine Flagge wird angezeigt und Sie müssen die zugehörige Provinz erraten.

source: <screeninfo>the flag question</screeninfo>
de: <screeninfo>Die Flaggenfrage</screeninfo>

source: <phrase>the flag question</phrase>
de: <phrase>Die Flaggenfrage</phrase>

source: Flags of Provinces and Territories: a province name is given and you must find the correct flag among four.
de: Flagge einer Provinz oder eines Territoriums erkennen: Zu einer vorgegebenen Provinz müssen Sie die zugehörige Flagge herausfinden.

source: <screeninfo>match the flag with the province</screeninfo>
de: <screeninfo>Flagge einer Provinz erkennen</screeninfo>

source: <phrase>match the flag with the province</phrase>
de: <phrase>Flagge einer Provinz erkennen</phrase>

source: Using &kgeography;
de: Arbeiten mit &kgeography;

source: &kgeography; displays information about some countries and tests you about those information.
de: &kgeography; zeigt Informationen über einige Länder an und überprüft Ihre Kenntnisse.

source: Here's a screenshot of &kgeography;
de: Ein Bildschirmfoto von &kgeography;

source: Screenshot
de: Bildschirmfoto

source: More &kgeography; features
de: Weitere Eigenschaften von &kgeography;

source: Another feature of &kgeography; is the possibility of zoom on a map. <screenshot> <screeninfo>Zoom</screeninfo> <mediaobject> <imageobject> <imagedata fileref="zoom.png" format="PNG"/> </imageobject> <textobject> <phrase>Zoom</phrase> </textobject> </mediaobject> </screenshot> You can click the <guibutton>Zoom</guibutton> button and then draw a rectangle to zoom in a part of the map. While in zoom mode, you can press &RMB; to go back to the original map size (the <guimenuitem>Original Size</guimenuitem> action has the same effect). Use the scroll bars, the arrow keys or the mouse wheel to move around the zoomed map or use the <guimenuitem>Move</guimenuitem> action that will allow you to drag the map using &LMB;. The <guimenuitem>Automatic Zoom</guimenuitem> feature will make the map as big as possible.
de: In &kgeography; können Sie die Anzeige eines Bereichs der Karte vergrößern. <screenshot> <screeninfo>Zoom</screeninfo> <mediaobject> <imageobject> <imagedata fileref="zoom.png" format="PNG"/> </imageobject> <textobject> <phrase>Zoom</phrase> </textobject> </mediaobject> </screenshot> Wählen Sie <guibutton>Größe</guibutton> und zeichnen auf der Karte ein Rechteck des Bereiches, der vergrößert werden soll. Im Vergrößerungsmodus können Sie mit Klicken der &RMB; die Karte wieder in der Originalgröße anzeigen, genauso wie mit dem Menüeintrag <guimenuitem>Originalgröße</guimenuitem>. Benutzen Sie die Bildlaufleisten, das Mausrad oder die Pfeiltasten, um den Kartenausschnitt zu verschieben oder wählen Sie im Menü <guimenuitem>Verschieben</guimenuitem>, um den Ausschnitt mit der &LMBn; zu verschieben. Die Funktion <guimenuitem>Automatische Größenveränderung</guimenuitem> zeigt die Karte so groß wie möglich an.

source: How to make maps
de: Karten erstellen

source: A map in &kgeography; is made by two files, one is the image of the map and the other one is its description.
de: Eine Karte in &kgeography; besteht aus zwei Dateien, dem Kartenbild und der zugehörigen Beschreibung.

source: Helper tool
de: Hilfsmittel

source: You can find <ulink url="https://projects.kde.org/projects/kde/kdeedu/kgeography/repository/revisions/master/changes/tools/gen_map.pl">here</ulink> a tool (made by Yann Verley) which helped him with the map of France. To find out its usage, simply execute it and read the help message. It basically creates the <literal role="extension">.kgm</literal> file from a plain text file and creates a file with the colors it has assigned to each division, so you can fill the map according to them.
de: <ulink url="https://projects.kde.org/projects/kde/kdeedu/kgeography/repository/revisions/master/changes/tools/gen_map.pl">Hier</ulink> finden Sie ein Hilfsprogramm zur Erstellung von Karten, geschrieben von Yann Verley, um die Karte von Frankreich herzustellen. Starten Sie das Programm, um eine Hilfe zu Anwendung zu lesen. Das Programm erzeugt eine <literal role="extension">.kgm</literal>-Datei mit den zugewiesenen Farben für jedes Land aus einer Textdatei zur weiteren Bearbeitung. Dann können Sie in der Kartendatei die Länder mit den angegebenen Farben kolorieren.

source: There is another tool <ulink url="https://projects.kde.org/projects/kde/kdeedu/kgeography/repository/revisions/master/changes/tools/colorchecker.py">colorchecker.py</ulink> written by Albert Astals Cid. You need PyQt4 to run this. Just run this with the .kgm filename as argument (you also need the .png file of the map in the same folder). This will tell you if any pixel on the map has a different color which is not defined in the .kgm (description) file.
de: Albert Astals Cid hat ein weiteres Hilfsprogramm <ulink url="https://projects.kde.org/projects/kde/kdeedu/kgeography/repository/revisions/master/changes/tools/colorchecker.py">colorchecker.py</ulink> geschrieben. Dieses Programm läuft nur mit PyQt4. Starten Sie das Programm mit dem Namen der .kgm-Datei als Argument, die .png-Date der Karte muss sich im gleichen Ordner befinden. Das Skript überprüft, ob die Farben aller Pixel der Karte in der Beschreibungsdatei (.kgm) definiert sind.

source: Please read also the tutorial <ulink url="http://edu.kde.org/kgeography/tutorials/kgeography-addmaps.pdf">How to add maps</ulink> on the &kgeography; website.
de: Bitte lesen Sie ebenfalls die Anleitung <ulink url="http://edu.kde.org/kgeography/tutorials/kgeography-addmaps.pdf">Karten erstellen</ulink> auf der &kgeography;-Webseite.

source: Description file
de: Beschreibungsdatei

source: The description file is needed and its file extension is <literal role="extension">.kgm</literal>. It should begin with <sgmltag class="starttag">!DOCTYPE kgeographyMap</sgmltag>, followed by <sgmltag class="starttag">map</sgmltag> and end with <sgmltag class="endtag">map</sgmltag>.
de: Die Beschreibungsdatei ist zwingend erforderlich und muss die Dateierweiterung <literal role="extension">.kgm</literal> haben. Diese Datei muss mit <sgmltag class="starttag">!DOCTYPE kgeographyMap</sgmltag> beginnen, gefolgt von <sgmltag class="starttag">map</sgmltag> und mit <sgmltag class="endtag">map</sgmltag> enden.

source: Inside of those tags there should be:
de: Innerhalb dieser Marken sind folgende Einträge nötig:

source: <sgmltag class="starttag">mapFile</sgmltag> and <sgmltag class="endtag">mapFile</sgmltag>: the name of the file (without any path) containing the map image, &eg; <quote>europe.png</quote>.
de: <sgmltag class="starttag">mapFile</sgmltag> und <sgmltag class="endtag">mapFile</sgmltag>: Der Name der Datei (ohne Pfad) mit dem Kartenbild, &eg; <quote>europe.png</quote>.

source: <sgmltag class="starttag">name</sgmltag> and <sgmltag class="endtag">name</sgmltag>: the name of map, &eg; <quote>Europe</quote>.
de: <sgmltag class="starttag">name</sgmltag> und <sgmltag class="endtag">name</sgmltag>: der Name der Karte, &eg; <quote>Europa</quote>.

source: <sgmltag class="starttag">divisionsName</sgmltag> and <sgmltag class="endtag">divisionsName</sgmltag>: the general name of divisions in this map, that is, Provinces, States, Countries, etc.
de: <sgmltag class="starttag">divisionsName</sgmltag> und <sgmltag class="endtag">divisionsName</sgmltag>: der allgemeine Name von Einheiten auf der Karte, &ie; von Provinzen, Bundesstaaten, Ländern &etc;

source: A <sgmltag class="starttag">division</sgmltag> and <sgmltag class="endtag">division</sgmltag> for each division in the map.
de: Eine Marke <sgmltag class="starttag">division</sgmltag> und <sgmltag class="endtag">division</sgmltag> für jedes Land in der Karte.

source: Each division has these tags:
de: Jedes Land muss diese Marken enthalten:

source: <sgmltag class="starttag">name</sgmltag> and <sgmltag class="endtag">name</sgmltag>: the name of the division, &eg; <quote>Albania</quote>.
de: <sgmltag class="starttag">name</sgmltag> und <sgmltag class="endtag">name</sgmltag>: Der Name des Landes, &eg; <quote>Albanien</quote>.

source: <sgmltag class="starttag">capital</sgmltag> and <sgmltag class="endtag">capital</sgmltag>: the name of the capital of the division, &eg; <quote>Tirana</quote>.
de: <sgmltag class="starttag">capital</sgmltag> ud <sgmltag class="endtag">capital</sgmltag>: der Name der Hauptstadt des Landes, &eg; <quote>Tirana</quote>.

source: <sgmltag class="starttag">ignore</sgmltag> and <sgmltag class="endtag">ignore</sgmltag>: can be set to <userinput>yes</userinput>, <userinput>allowClickMode</userinput>, <userinput>allowClickFlagMode</userinput> and <userinput>no</userinput>. If this tag is set to <userinput>yes</userinput> then the division will be ignored when asking for divisions in that map. It is then as if this division does not exist in &kgeography; quiz modes. If this tag is set to <userinput>allowClickMode</userinput> then &kgeography; will ask for the division in the <guibutton>Location of ...</guibutton> mode but not in other quiz modes. If this tag is set to <userinput>allowClickFlagMode</userinput> then &kgeography; will ask for the division in the <guibutton>Location of ...</guibutton> mode and in the flag related quizes but not in other quiz modes. Setting this tag to <userinput>no</userinput> means the division will appear in all modes (browse and quizzes). This tag is optional and when there is no <sgmltag class=" starttag">ignore</sgmltag> tag that means as it is set to <userinput>no</userinput>. For example <quote>Algeria</quote> has this tag set to <userinput>yes</userinput> in the <quote>Europe</quote> map which means that <quote>Algeria</quote> will not be part of any quiz in the <quote>Europe</quote> map.
de: <sgmltag class="starttag">ignore</sgmltag> und <sgmltag class="endtag">ignore</sgmltag>: Mögliche Werte sind <userinput>yes</userinput>, <userinput>allowClickMode</userinput>, <userinput>allowClickFlagMode</userinput> und <userinput>no</userinput>. Mit <userinput>yes</userinput> wird dieses Land bei der Abfrage nach Ländern übergangen, als wäre es nicht vorhanden. Mit <userinput>allowClickMode</userinput> fragt &kgeography; nach dem Land nur in der Übung <guibutton>Lage von ...</guibutton>, aber nicht in den anderen Übungen. Ist dieses Tag auf <userinput>allowClickFlagMode</userinput> gesetzt, wird auch bei den Flaggen-Übungen danach gefragt. Setzen Sie diese Marke auf den Wert <userinput>no</userinput>, um damit das Land in alle Übungen (Erkunden und Abfragen) aufgenommen wird. Diese Marke <sgmltag class=" starttag">ignore</sgmltag> darf fehlen, dann wird als Wert <userinput>no</userinput> angenommen. Für <quote>Algerien</quote> zum Beispiel ist der Wert auf <userinput>yes</userinput> in der <quote>Europa</quote>karte gesetzt, damit ist <quote>Algerien</quote> aus allen Fragen zur <quote>Europa</quote>karte ausgeschlossen.

source: <sgmltag class="starttag">flag</sgmltag> and <sgmltag class="endtag">flag</sgmltag>: the file (without any path) containing the flag of the division, &eg; <quote>albania.png</quote>. This tag is optional. Not needed for the divisions whose <sgmltag class="starttag">ignore</sgmltag> tag is set to <userinput>yes</userinput>.
de: <sgmltag class="starttag">flag</sgmltag> und <sgmltag class="endtag">flag</sgmltag>: Die Datei (ohne Dateipfad) mit der Flagge des Landes, &eg; <quote>albania.png</quote>. Diese Marke darf auch fehlen. Sie ist für Länder mit dem Wert<userinput>yes</userinput> für die Marke <sgmltag class="starttag">ignore</sgmltag> nicht erforderlich.

source: <sgmltag class="starttag">color</sgmltag> and <sgmltag class="endtag">color</sgmltag>: the color the division has in the map.
de: <sgmltag class="starttag">color</sgmltag> und <sgmltag class="endtag">color</sgmltag>: Die Farbe der Länder in der Karte.

source: <sgmltag class="starttag">falseCapital</sgmltag> and <sgmltag class="endtag">falseCapital</sgmltag>: There can be any number of falseCapital pairs, they are used to provide a list of false answers to the capital question instead of choosing the false answers amongst the other divisions capitals.
de: <sgmltag class="starttag">falseCapital</sgmltag> and <sgmltag class="endtag">falseCapital</sgmltag>: Es ist eine beliebige Anzahl von falseCapital-Paaren erlaubt. Hierüber kann eine Liste falscher Antworten auf die Hauptstadt-Frage bereitgestellt werden, ohne dass hierzu aus den Hauptstädten anderer Länder gewählt werden muss.

source: The color is defined using three tags:
de: Die Farbe wird durch drei Marken festgelegt:

source: <sgmltag class="starttag">red</sgmltag> and <sgmltag class="endtag">red</sgmltag>: red component of the color. Valid values are between 0 and 255.
de: <sgmltag class="starttag">red</sgmltag> und <sgmltag class="endtag">red</sgmltag>: Rotanteil der Farbe mit gültigen Werten zwischen 0 und 255.

source: <sgmltag class="starttag">green</sgmltag> and <sgmltag class="endtag">green</sgmltag>: green component of the color. Valid values are between 0 and 255.
de: <sgmltag class="starttag">green</sgmltag> und <sgmltag class="endtag">green</sgmltag>: Grünanteil der Farbe mit gültigen Werten zwischen 0 und 255.

source: <sgmltag class="starttag">blue</sgmltag> and <sgmltag class="endtag">blue</sgmltag>: blue component of the color. Valid values are between 0 and 255.
de: <sgmltag class="starttag">blue</sgmltag> und <sgmltag class="endtag">blue</sgmltag>: Blauanteil der Farbe mit gültigen Werten zwischen 0 und 255.

source: It is convenient to create 2 or 3 false divisions like <quote>Water</quote>, <quote>Frontier</quote> and <quote>Coast</quote> and set them with the <sgmltag class="starttag">ignore</sgmltag> tag set to <userinput>yes</userinput>. Don't forget <userinput>not to set</userinput> color for any <quote>Frontier</quote> 0,0,0 in RGB. Please make it something like 1,1,1 so that a border outline comes while placing any division on the map.
de: Es ist sinnvoll, zwei oder drei falsche <quote>Länder</quote> wie <quote>Wasser</quote>, <quote>Grenze</quote> und <quote>Küste</quote> zu erstellen und ihnen mit der Marke <sgmltag class="starttag">ignore</sgmltag> den Wert <userinput>yes</userinput> zu geben. <userinput>Setzen</userinput> Sie die Farbe für alle <quote>Grenzen</quote> auf einen RGB-Wert von z. B. 1,1,1, nicht auf 0,0,0, damit beim der Darstellung Ränder gezeichnet werden.

source: All names (capitals and divisions) must be in English.
de: Schreiben Sie alle Namen von Städten und Ländern auf Englisch.

source: Map file
de: Kartendatei

source: The map file is quite simple but laborious to create. It has to be in <acronym>PNG</acronym> format. You can find some maps to transform at <ulink url="https://www.cia.gov/library/publications/the-world-factbook/docs/refmaps.html">Cia Reference Maps</ulink>. If no map fits your needs you can download the <ulink url="https://www.cia.gov/library/publications/the-world-factbook/reference_maps/pdf/political_world.pdf">political world map</ulink>, take a screenshot of it and work from it. Each division in the map should have one and only one color. To achieve this you can use image processing programs like <application>The Gimp</application> and <application>Kolourpaint</application>.
de: Die Kartendatei ist einfach aufgebaut, aber schwierig zu erstellen. Die Datei muss das <acronym>PNG</acronym> Format haben. Unter <ulink url="https://www.cia.gov/library/publications/the-world-factbook/docs/refmaps.html">Cia-Referenz-Karten</ulink> finden Sie einige Karten für die weitere Bearbeitung. Außerdem können Sie die <ulink url="https://www.cia.gov/library/publications/the-world-factbook/reference_maps/pdf/political_world.pdf">Politische Weltkarte</ulink> herunterladen, ein Bildschirmfoto aufnehmen und damit weiter arbeiten. Jedes Land auf der Karte sollte eine eindeutige Farbe haben. Verwenden Sie dazu Bildbearbeitungsprogramme wie <application>Gimp</application> oder <application>Kolourpaint</application>.

source: Flags
de: Flaggen
