Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdeedu/kgeography.po
Languages: de

source: If you have used the <sgmltag class="starttag">flag</sgmltag> tag you should provide the flag files. They have to be in <acronym>PNG</acronym> format and better if they are 300x200 pixels and you provide a <acronym>SVG</acronym> file for it. To obtain <acronym>SVG</acronym> flags of almost all countries in the world and some other divisions, you can consult the <ulink url="http://sourceforge.net/project/showfiles.php?group_id=4054&amp;package_id=16668&amp;release_id=208770">Sodipodi flags collection</ulink>.
de: Wenn Sie die Marke <sgmltag class="starttag">flag</sgmltag> benutzt haben, sollten Sie auch die erforderlichen Flaggendateien erstellen. Diese Dateien müssen in eine Größe von 300x200 Pixeln im <acronym>PNG</acronym>-Format haben, oder noch besser als <acronym>SVG</acronym>-Datei vorliegen. <acronym>SVG</acronym>-Dateien fast aller Länder der Erde und weiterer Provinzen sollten Sie in der <ulink url="http://sourceforge.net/project/showfiles.php?group_id=4054&amp;package_id=16668&amp;release_id=208770">Sodipodi Flaggensammlung</ulink> suchen.

source: How to test
de: Test der Karten

source: Before sending your map to Albert &Albert.Astals.Cid.mail;, you should test it to see it has no errors. To achieve that, you have to do the following: <itemizedlist> <listitem> <para>Put the map description and map image file in <filename class="directory">$<envar>KDEDIR</envar>/share/apps/kgeography/</filename></para> </listitem> <listitem> <para>Put the flag <acronym>PNG</acronym> files (if any) in <filename class="directory">$<envar>KDEDIR</envar>/share/apps/kgeography/flags/</filename></para> </listitem> </itemizedlist> Once that has been done you should be able of opening your map from inside &kgeography;.
de: Bevor Sie Ihre Karte an Albert &Albert.Astals.Cid.mail; schicken, sollten Sie sie auf Fehler überprüfen, Dazu sind folgende Schritte erforderlich: <itemizedlist> <listitem> <para>Kopieren Sie die Beschreibungsdatei und die Kartendatei in den Ordner <filename class="directory">$<envar>KDEDIR</envar>/share/apps/kgeography/</filename></para> </listitem> <listitem> <para>Kopieren Sie die vorhandene Flaggendateien (<acronym>PNG</acronym>-Dateien) in den Ordner <filename class="directory">$<envar>KDEDIR</envar>/share/apps/kgeography/flags/</filename></para> </listitem> </itemizedlist> Danach können Sie Ihre Karte im Programm &kgeography; öffnen.

source: If you don't know which is your <filename class="directory">$<envar>KDEDIR</envar></filename>, type <userinput><command>kde4-config</command> <option>--prefix</option></userinput> in a shell.
de: Wenn Sie <filename class="directory">$<envar>KDEDIR</envar></filename> Ihrer Installation nicht kennen, geben Sie den Befehl <userinput><command>kde4-config</command> <option>--prefix</option></userinput> auf der Konsole ein.

source: Use the colorchecker.py tool from the helper tools to check if any extra color left on the map which is not defined on the .kgm file.
de: Benutzen Sie das Programm colorchecker.py, um zu überprüfen, ob alle Farben in der Karte auch in der .kmg-Datei definiert sind.

source: Non political maps
de: Nicht politische Karten

source: Is it possible to do non-political maps? Yes, it is!
de: Ist es möglich nichtpolitische Karten zu erstellen? Natürlich!

source: <screeninfo>Example of how to create a non political map</screeninfo>
de: <screeninfo>Beispiel einer nichtpolitischen Karte</screeninfo>

source: <phrase>Example of how to create a non political map</phrase>
de: <phrase>Beispiel einer nichtpolitischen Karte</phrase>

source: Of course, the division concept can be extended to a river or a mountain. During the creation of the map, you should keep in mind that most times the river or mountain will be too small that you should provide an additional clicking area. In this example the river would have the maroon area and color &lt;20,76,34&gt; as its identifier.
de: Sebstverständlich kann das Länderkonzept um geografische Objekte wie Flüsse und Berge erweitert werden. Denken Sie bei der Bearbeitung der Karte daran, dass Flüsse und Berge in der Karte zu klein sind und daher einen zusätzlichen Fläche zum Anklicken brauchen. In diesem Beispiel hat der Fluss eine kastanienbraune Fläche und &lt;20,76,34&gt; als Farbe.

source: Command Reference
de: Befehlsreferenz

source: The main &kgeography; window
de: Das Hauptfenster von &kgeography;

source: The File Menu
de: Das Menü Datei

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>O</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Open Map...</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>O</keycap></keycombo> </shortcut> <guimenu>Datei</guimenu> <guimenuitem>Karte öffnen ...</guimenuitem>

source: Open the choose map dialog. If you type quickly enough the first letters of the map you look for will select the first map that matches.
de: Öffnet den Dialog zur Auswahl einer Karte. Geben Sie schnell die ersten Buchstaben der gesuchten Karte ein, dann wird die erste passende Karte ausgewählt.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Quit</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo> </shortcut> <guimenu>Datei</guimenu> <guimenuitem>Beenden</guimenuitem>

source: <action>Quits</action> &kgeography;
de: <action>Beendet</action> &kgeography;

source: The View Menu
de: Das Menü Ansicht

source: <guimenu>View</guimenu> <guimenuitem>Zoom</guimenuitem>
de: <guimenu>Ansicht</guimenu> <guimenuitem>Größe</guimenuitem>

source: Goes in zoom mode, then draw a rectangle to zoom in a part of the map
de: Wechselt in den Vergrößerungsmodus. Ziehen Sie mit der &LMBn; ein Rechtecht in der Karte, dann wird dieser Ausschnitt vergrößert.

source: <guimenu>View</guimenu> <guimenuitem>Original Size</guimenuitem>
de: <guimenu>Ansicht</guimenu> <guimenuitem>Originalgröße</guimenuitem>

source: <action>Sets</action> the map back to its original size as defined in the map file. A &RMB; click in zoomed mode performs the same action
de: <action>Zeigt</action> die Karte wieder in der ursprünglichen in der Kartendatei definierten Größe an. Mit einem &RMBn; in vergrößerter Anzeige kann dieselbe Aktion ausgeführt werden.

source: <guimenu>View</guimenu> <guimenuitem>Automatic Zoom</guimenuitem>
de: <guimenu>Ansicht</guimenu> <guimenuitem>Automatische Größenveränderung</guimenuitem>

source: <action>Sets</action> the map to automatic zoom using as much space as possible when resizing the &kgeography; window
de: <action>Zeigt</action> die Karte in der größtmöglichen Vergrößerung bei einer Änderung des &kgeography;-Fensters an.

source: <guimenu>View</guimenu> <guimenuitem>Move</guimenuitem>
de: <guimenu>Ansicht</guimenu> <guimenuitem>Verschieben</guimenuitem>

source: <action>Moves</action> the current map. This item is only enabled, if you have zoomed into the map.
de: <action>Verschiebt</action> den Ausschnitt aus der aktuellen Karte. Dieser Eintrag ist nur verfügbar, wenn die Kartenansicht vergrößert wurde.

source: The Settings Menu
de: Das Menü Einstellungen

source: &kgeography; has the common &kde; <guimenu>Settings</guimenu> menu items, for more information read the section about the <ulink url="help:/fundamentals/ui.html#menus-settings">Settings Menu</ulink> of the &kde; Fundamentals.
de: &kgeography; benutzt die bekannten &kde;-Einträge im Menü <guimenu>Einstellungen</guimenu>, weitere Informationen dazu finden Sie im Abschnitt über das Menü <ulink url="help:/fundamentals/ui.html#menus-settings">Einstellungen</ulink> der &kde;-Grundlagen.

source: The Help Menu
de: Das Menü Hilfe

source: &kgeography; has a default &kde; <guimenu>Help</guimenu> menu as described in the <ulink url="help:/fundamentals/ui.html#menus-help">&kde; Fundamentals</ulink> with two additional entries:
de: &kgeography; hat zusätzlich zum bekannten &kde;-<guimenu>Hilfe</guimenu>menü, das in den <ulink url="help:/fundamentals/ui.html#menus-help">&kde;-Grundlagen</ulink>erläutert wird, zwei zusätzliche Einträge:

source: <guimenu>Help</guimenu> <guimenuitem>Disclaimer</guimenuitem>
de: <guimenu>Hilfe</guimenu> <guimenuitem>Haftungsausschluss</guimenuitem>

source: <action>Displays</action> a disclaimer about the accuracy of maps, flags and translations used by &kgeography;.
de: <action>Zeigt</action> eine Erklärung über die Richtigkeit von Karten, Flaggen und Übersetzungen in &kgeography;

source: <guimenu>Help</guimenu> <guimenuitem>Map author</guimenuitem>
de: <guimenu>Hilfe</guimenu> <guimenuitem>Kartenautor</guimenuitem>

source: <action>Displays</action> the name of author who created the current map.
de: <action>Zeigt</action> den Namen des Autors an,der die geöffnete Karte erstellt hat.

source: Configuration
de: Einrichtung

source: Question Alignment
de: Ausrichtung der Fragen

source: Determines the position of the questions in the window, default is <guilabel>Top-left</guilabel>.
de: Bestimmt die Position der Fragen im Fenster, die Voreinstellung ist <guilabel>Oben links</guilabel>.

source: Wait for Validation
de: Auf Überprüfung warten

source: If enabled the user will have to press <guibutton>Accept</guibutton> after choosing an answer.
de: Ist dies aktiviert, müssen Sie den Knopf <guibutton>Akzeptieren</guibutton> nach der Auswahl einer Antwort drücken.

source: Focus follows Mouse
de: Aktivierung bei Mauskontakt

source: If enabled pressing Space will trigger the button under the mouse pointer.
de: Ist diese Einstellung aktiviert, kann mit der Leertaste der Knopf unter dem Mauszeiger gedrückt werden.

source: Map divisions colors
de: Farben der Verwaltungseinheiten in der Karte

source: You can choose if you always want to keep the same colors (default) or if you want to use random colors: with this option random colors are assigned to the divisions in the map. This helps the user to focus and learn the division shapes and not the division colors.
de: Wählen Sie aus, ob wie in der Voreinstellung immer dieselben oder zufällige Farben verwendet werden, dann erhalten die Verwaltungseinheiten in der Karte zufällige Farben. Das hilft Ihnen, die Umrisse der Verwaltungseinheiten und nicht deren Farben zu lernen.

source: Credits and License
de: Danksagungen und Lizenz

source: Program copyright 2004-2008 Albert Astals Cid &Albert.Astals.Cid.mail;
de: Programm Copyright 2004-2008 Albert Astals Cid &Albert.Astals.Cid.mail;

source: Documentation Copyright &copy; 2005 &Anne-Marie.Mahfouf; &Anne-Marie.Mahfouf.mail; 2008 Kushal Das <email>kushaldas@gmail.com</email>
de: Copyright der Dokumentation &copy; 2005 &Anne-Marie.Mahfouf; &Anne-Marie.Mahfouf.mail; 2008 Kushal Das <email>kushaldas@gmail.com</email>

source: CREDIT_FOR_TRANSLATORS
de: <para>Übersetzung Burkhard Lück<email>lueck@hube-lueck.de</email></para>

source: How to obtain &kgeography;
de: Wie Sie &kgeography; erhalten

source: Compilation and Installation
de: Kompilierung und Installation
