Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdeedu/kiten.po
Languages: de

source: The &kiten; Handbook
de: Das Handbuch zu &kiten;

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Thorsten</firstname><surname>Mürell</surname><affiliation><address><email>thorsten@muerell.de</email></address></affiliation><contrib>Deutsche Übersetzung</contrib></othercredit>

source: &kiten; is a Japanese reference/study tool for &kde;.
de: &kiten; ist ein japanisches Referenz- und Studierwerkzeug für &kde;.

source: Japanese
de: Japanisch

source: Language
de: Sprache

source: Introduction
de: Einführung

source: &kiten; is a set of 3 tools with multiple functions. Firstly, it is a convenient English to Japanese and Japanese to English dictionary; secondly, it is a Kanji dictionary, with multiple ways to look up specific characters; thirdly, it is a tool to help you learn Kanji.
de: &kiten; ist eine Gruppe von drei Programmen mit vielen Funktionen. Erstens ist es ein bequemes Englisch nach Japanisch und Japanisch nach Englisch Wörterbuch; Zweitens ist es ein Kanji-Wörterbuch mit vielen Wegen, die einzelnen Buchstaben nachzuschlagen; Drittens ist es ein Werkzeug, Ihnen Kanji beizubringen.

source: Each of these modes is discussed in its own chapter.
de: Jede dieser Betriebsarten wird in ihrem eigenen Kapitel beschrieben.

source: Here's a screenshot of &kiten;
de: Hier ist ein Bildschirmfoto von &kiten;

source: &kiten; screenshot
de: Bildschirmfoto von &kiten;

source: Using the Dictionary
de: Das Wörterbuch benutzen

source: &kiten;'s most basic mode is as a dictionary for looking up both English and Japanese words. You can also add other dictionaries to &kiten;'s list.
de: &kiten;s Basisbetriebsart ist ein Wörterbuch, um englische und japanische Wörter nachzuschlagen. Sie können auch andere Wörterbücher zur Liste hinzufügen.

source: &kiten; uses Jim Breen's Edict and Kanjidic as the default dictionaries. You can find more information at <ulink url="http://www.csse.monash.edu.au/~jwb/edict.html">the Edict web site</ulink> and <ulink url="http://www.csse.monash.edu.au/~jwb/kanjidic.html">the Kanjidic web site</ulink>.
de: &kiten; benutzt Jim Breens Edict und Kanjidic als standardmäßige Wörterbücher. Sie können mehr Informationen auf der <ulink url="http://www.csse.monash.edu.au/~jwb/edict.html">Edict Webseite</ulink> und auf der <ulink url="http://www.csse.monash.edu.au/~jwb/kanjidic.html">Kanjidic Webseite</ulink> finden.

source: Looking Up Words
de: Wörter nachschlagen

source: To look up words in either language, type them in to the text-edit (much like &konqueror;'s location bar) and press either &Enter; or the <guilabel>Search</guilabel> button on the toolbar (again, much like &konqueror;). &kiten; will then look up the word.
de: Um Wörter in den beiden Sprachen nachzuschlagen, geben Sie sie in das Texteingabefeld ein und drücken Sie entweder die <keycap>Eingabetaste</keycap> oder den Knopf <guilabel>Suchen</guilabel> in der Werkzeugleiste. &kiten; wird dann das Wort nachschlagen.

source: You can enter Kanji, Kana and English and get back results from &kiten;. These results of your search will appear in the large results view which takes up the majority of the &kiten; window.
de: Sie können Kanji, Kana und Englisch eingeben und bekommen ein Resultat von &kiten; zurück. Die Resultate der Suche erscheinen in der großen Ergebnisansicht, die den Hauptteil des &kiten;-Fensters einnimmt.

source: searching for an English translation
de: Suche nach einer englischen Übersetzung

source: &kiten; search screenshot
de: Bildschirmfoto der Suche mit &kiten;

source: Filtering
de: Filtern

source: Often times you will want to filter rare words from your search. &kiten; will do this for you if toggle <menuchoice><guimenu>Search</guimenu><guimenuitem>Filter Out Rare</guimenuitem></menuchoice>.
de: Oft wollen Sie seltene Wörter aus der Suche ausfiltern. Aktivieren Sie dies in &kiten; mit <menuchoice><guimenu>Suchen</guimenu><guimenuitem>Seltene ausfiltern</guimenuitem></menuchoice>.

source: Not all dictionary files support filtering rare entries - most dictionaries, excluding the two provided by default in &kiten; do not.
de: Nicht alle Wörterbuchdateien unterstützen seltene Einträge - die meisten, außer den zweien, die von &kiten; bereitgestellt werden, nicht.

source: Screenshot using filtering of rare words
de: Bildschirmfoto mit Filterung seltener Wörter

source: &kiten; filtering search
de: &kiten;-Suche mit Filtern

source: Common/Uncommon words
de: Übliche/Unübliche Wörter

source: Another way to separate information is to filter common and uncommon words, this is useful when you want to focus on the common words and/or have interest on uncommon ones. The only difference between Filter Out Rare and Common/Uncommon options is that here you also get the Rare/Uncommon results.
de: Eine weitere Möglichkeit ist die Filterung nach üblichen oder unüblichen Wörtern. Dies ist nützlich, wenn Sie an üblichen und/oder unüblichen Wörtern interessiert sind. Der einzige Unterschied zwischen den Einstellungen „Seltene ausfiltern“ und „Üblich/Unüblich“, dass Sie mit der zweiten Einstellung auch seltene und unübliche Ergebnisse erhalten.

source: Screenshot for match common/uncommon
de: Bildschirmfoto mit Übereinstimmung üblicher/unüblicher Wörter

source: &kiten; match common/uncommon
de: &kiten; mit Übereinstimmung üblicher/unüblicher Wörter

source: Advanced Searches
de: Erweiterte Suche

source: &kiten; supports more advanced searches than plain normal word searches.
de: &kiten; unterstützt komplexere Suchmethoden als die einfache Wortsuche.

source: Beginning/Ending/Anywhere Searches
de: Suche am Wortanfang/Wortende/Überall

source: Beside a search with <guilabel>Exact Match</guilabel> &kiten; has three additional search modes
de: Zusätzlich zur Suche mit <guilabel>Exakter Übereinstimmung</guilabel> gibt es in &kiten; noch drei weitere Suchmodi:

source: To search for the beginning of a word, instead of pressing the <guilabel>Search</guilabel> button on the toolbar or pressing <keycap>Return</keycap> on the text-entry in the toolbar, choose using the <menuchoice><guimenu>Search</guimenu><guisubmenu>Match Type </guisubmenu><guimenuitem>Match Beginning</guimenuitem></menuchoice>. Similarly, for ending or anywhere searches, choose <menuchoice><guimenu>Search</guimenu> <guisubmenu>Match Type</guisubmenu></menuchoice> <guimenuitem>Match Anywhere</guimenuitem> or <guimenuitem>Match Ending</guimenuitem> to search for your text anywhere in or at the end of a word. These search modes work for searches of both languages.
de: Um nach dem Wortanfang zu suchen, wählen Sie <menuchoice><guimenu>Suchen</guimenu><guisubmenu>Übereinstimmung</guisubmenu><guimenuitem>Am Wortanfang</guimenuitem></menuchoice> anstatt den Knopf <guilabel>Suchen</guilabel> in der Werkzeugleiste oder die <keycap>Eingabetaste</keycap> zu drücken. Gleichermaßen wählen Sie <menuchoice><guimenu>Suchen</guimenu><guisubmenu>Übereinstimmung</guisubmenu></menuchoice> <guimenuitem>Irgendwo im Wort</guimenuitem> oder <guimenuitem>Am Wortende</guimenuitem>, um nach Text irgendwo in einem Wort oder am Wortende zu suchen. Diese Suchmodi arbeiten mit beiden Sprachen.

source: Screenshot for match ending search
de: Bildschirmfoto mit der Suche am Wortende

source: &kiten; match ending search
de: Suche mit &kiten; am Wortende

source: Word type searches
de: Suche nach Wortarten

source: &kappname; supports word type searches such as: verb, noun, adjective, adverb, prefix, suffix, expression or any type. This way you can filter your results more conveniently.
de: &kappname; unterstützt die Suche nach Wortarten wie Verb, Substantiv, Adjektiv, Adverb, Präfix, Endung, Ausdruck oder jede beliebige Art. Damit können Sie die Ergebnisse der Suche zusätzlich filtern.

source: Screenshot for match word type
de: Bildschirmfoto mit der Suche nach Wortart

source: &kiten; match word type
de: &kiten;-Suche nach Wortart

source: Searching in Results
de: In Resultaten suchen

source: &kiten; can also help you refine your searches by allowing you to search for new text in the results generated by a previous search. To do this, just choose <menuchoice><guimenu>Search</guimenu><guimenuitem>Search in Results</guimenuitem></menuchoice> to perform your search. Similarly to beginning/ending/anywhere searches, this works for both languages too.
de: &kiten; kann Ihnen auch dabei helfen, Ihre Suchanfragen zu verfeinern, indem es Ihnen erlaubt, in den Ergebnissen einer vorherigen Suche zu suchen. Um dies zu tun, wählen Sie <menuchoice><guimenu>Suchen</guimenu><guimenuitem> In Resultaten suchen</guimenuitem></menuchoice> für Ihre Suche. Benutzen Sie diese Methode für Suche am Wortanfang/Wortende/Irgendwo, dies funktioniert ebenso für beide Sprachen.

source: Screenshot for search in results
de: Bildschirmfoto der Suche in Resultaten

source: &kiten; search in results
de: Suche mit &kiten; in Resultaten

source: Verb Deinflection
de: Verbdeinflexion

source: &kiten; can deinflect verbs you search for. The "Deinflect" option tries to unconjugate Japanese verbs and shows you a message on top of the results about the type of verb you entered. If you search a lot of Japanese text you might consider using this option until you get used to handling Japanese verb forms.
de: &kiten; kann Verben, nach denen Sie suchen, in die Grundform überführen. Die Option <quote>Deinflekt</quote> versucht, die japanischen Verben in Ihre Grundform zu überführen und zeigt die Art des eingegeben Verbs über den Ergebnissen an. Sie unterstützt nur die gebräuchlichen Verbkonjugationen. Wenn Sie viele japanische Texte suchen, sollten Sie diese Option benutzen, bis Sie mit den japanischen Verformen vertraut sind.

source: Screenshot for verb deinflection
de: Bildschirmfoto der Verbdeinflexion

source: &kiten; verb deinflection search
de: Suche mit &kiten; nach Verbdeinflexion

source: Looking Up Kanji
de: Kanji nachschlagen

source: &kiten; has features that makes finding the one kanji you want easy from over 14,000 in the default dictionary.
de: &kiten; hat Möglichkeiten, die es einfach machen, ein Kanji aus über 14.000 im Standardwörterbuch zu finden.

source: Clicking on any Kanji in the main result view will show details on that particular Kanji. This can sometimes be the fastest way to look up a Kanji.
de: Der Klick auf ein Kanji im Hauptergebnisfenster zeigt Details zu diesem bestimmten Kanji. Das kann manchmal der schnellste Weg des Nachschlagens sein.

source: Kanji searches are also filtered according to whether <menuchoice><guimenu>Search</guimenu><guimenuitem>Filter Out Rare</guimenuitem></menuchoice> is checked.
de: Kanji-Suchen werden auch danach gefiltert, ob <menuchoice><guimenu>Suchen</guimenu><guimenuitem>Seltene ausfiltern</guimenuitem></menuchoice> aktiviert ist.

source: Regular Searching
de: Reguläre Suche

source: You can search with English and Japanese search strings the exact same way you can with the normal dictionary.
de: Sie können nach englischen und japanischen Suchworten suchen, genauso wie mit dem normalen Wörterbuch.

source: Radical Searching
de: Stammformensuche

source: You can use &kiten;'s radical search dialog to search for Kanji with a combination of radicals and a certain stroke count. Choose <menuchoice><guimenu>Search</guimenu><guimenuitem>Radical Selector</guimenuitem></menuchoice> to open the radical search dialog.
de: Sie können &kiten;s Stammformensuchdialog benutzen, um nach Kanjis mit einer Kombination von Stammformen und einer bestimmten Strichanzahl zu suchen. Wählen Sie <menuchoice><guimenu>Suchen</guimenu><guimenuitem>Stammformenauswahl</guimenuitem></menuchoice> um den Stammformensuchdialog zu öffnen.

source: To choose the radicals you want to be in your Kanji, select one them from the buttons at the bottom of the window. To display possible radicals to select from this buttons with a certain number of strokes, choose this number of strokes from the spinboxes just above the buttons. The radicals you choose will appear in the listbox at the top.
de: Um die Stammformen zu suchen, die in Ihrem Kanji vorkommen, wählen Sie sie mit den Knöpfen im unteren Teil des Fensters. Um mögliche Stammformen mit einer bestimmten Anzahl von Strichen anzuzeigen, wählen Sie die Anzahl der Striche aus der Auswahlfeld direkt über den Knöpfen. Die Stammformen die Sie auswählen, wird in der Listenfeld oben angezeigt.

source: To choose how many strokes your Kanji should have, just enter the values into the spin boxes below the results area.
de: In den Drehfeldern unter den Ergebnissen können Sie die Anzahl der Striche für das Kanji eingrenzen.

source: To perform the lookup, press the button that matches the kanji you wanted to look up.
de: Um eine Suche auszuführen, drücken Sie den Knopf mit dem Symbol des gesuchten Kanji.

source: Screenshot for radical selector
de: Bildschirmfoto der Stammformenauswahl

source: &kiten; radical selector
de: Stammformenauswahl mit &kiten;

source: Grade Search
de: Stufensuche

source: To get a list of all Kanji in a certain grade, enter that into the search box as "G:1" (G: is the Kanjidic tag for grade).
de: Um eine Liste aller Kanji eines bestimmten Grades zu erhalten, geben Sie den Grad in das Texteingabefeld in der Werkzeugleiste als <quote>G:1</quote> ein.

source: Screenshot for kanji grade search
de: Bildschirmfoto der Kanji-Stufensuche

source: &kiten; kanji grade search
de: Kanji-Stufensuche in &kiten;

source: Stroke Search
de: Strichsuche

source: To get a list of all Kanji with a certain number of strokes, enter that number in the text-entry in the toolbar as "S:2".
de: Um eine Liste aller Kanji mit einer bestimmten Anzahl von Strichen zu bekommen, geben Sie diese Anzahl in das Texteingabefeld in der Werkzeugleiste als <quote>S:2</quote> ein.

source: Screenshot for kanji strokes search
de: Bildschirmfoto der Kanji-Strichsuche

source: &kiten; kanji strokes search
de: Kanji-Strichsuche in &kiten;

source: Kanji List
de: Liste der Kanji

source: This part of the Kanji Browser lets you visualize a list of kanji filtered by grade and number of strokes. By Clicking on a kanji you can get detailed information about it. Kanji Browser separates the list in Jouyou, Jinmeiyou and non-Jouyou kanji. All this kanji is available thanks to the KANJIDIC dictionary.
de: Dieser Teil des Kanji-Browsers zeigt eine Liste der Kanji gefiltert nach Stufe und Anzahl der Striche. Klicken Sie auf ein Kanji, um ausführliche Informationen darüber zu erhalten. In der Liste werden die Kanji getrennt nach „Jouyou“-, „Jinmeiyou“- und nicht „Jouyou“-Typ dargestellt. Diese Trennung ist mit dem KANJIDIC-Wörterbuch möglich.

source: Screenshot for kanji list
de: Bildschirmfoto der Kanji-Liste

source: &kiten; kanji list
de: Liste der Kanji in &kiten;

source: Kanji Information
de: Informationen zu den Kanji

source: This part shows you detailed information about a kanji such as: kanji stroke order, number of strokes, readings and meanings.
de: Dieses Fenster zeigt ausführliche Informationen über ein Kanji wie Reihenfolge und Anzahl der Striche sowie die Lesart und Bedeutung.

source: Screenshot for kanji information
de: Bildschirmfoto der Kanji-Informationen

source: &kiten; kanji information
de: Kanji-Information in &kiten;

source: Miscellaneous
de: Verschiedenes

source: This chapter describes miscellaneous features that can be used in both modes in &kiten;'s main window.
de: Dieses Kapitel beschreibt verschiedene Funktionen, die in &kiten;s Hauptfenster zu erreichen sind.

source: The History
de: Der Verlauf

source: &kiten; keeps track of all of your queries in the input field. You can see your last results by clicking on the check mark at the right of the input field. To go forward one in the history, choose <menuchoice><guimenu>Go</guimenu><guimenuitem>Forward</guimenuitem></menuchoice>. To go backward one in the history, choose <menuchoice><guimenu>Go</guimenu><guimenuitem>Back</guimenuitem></menuchoice>.
de: &kiten; merkt sich alle Ihre Anfragen im Eingabefeld. Sie können die letzten Ergebnisse sehen, wenn Sie auf das Häkchen rechts im Eingabefeld klicken. Um im Verlauf einen Schritt vorwärts zu gehen, wählen Sie <menuchoice><guimenu>Gehe zu</guimenu><guimenuitem>Nach vorne</guimenuitem></menuchoice>, um einen Schritt zurück zu gehen, wählen Sie <menuchoice><guimenu>Gehe zu</guimenu><guimenuitem>Zurück</guimenuitem></menuchoice>.

source: Fonts
de: Schriftarten

source: You can choose the font that &kiten; uses in its result view. Go to the &kiten; configuration dialog, which can be opened by choosing <menuchoice><guimenu>Settings</guimenu><guimenuitem>Configure Kiten...</guimenuitem></menuchoice>. Select the <guilabel>Font</guilabel> page of the dialog and select the font in the font-chooser.
de: Sie können die Schriftart wählen, die &kiten; in seiner Ergebnisansicht benutzt. Gehen Sie zum Einrichtungsdialog von &kiten;, der über <menuchoice><guimenu>Einstellungen</guimenu><guimenuitem>Kiten einrichten ...</guimenuitem></menuchoice> geöffnet werden kann. Wählen Sie die Seite <guilabel>Schriftart</guilabel> und wählen Sie dort eine Schrift.

source: &Qt; 's font-substitution system makes it so a Japanese font will always be substituted for Japanese characters, even if the font you specify doesn't include them. Thus, you can choose any font in the chooser and everything should still display fine.
de: Das Schriftartensubstitutionssystem von &Qt; macht es einfach, da ein japanisches Zeichen immer in einer Schriftart dargestellt wird, die ein solches Zeichen enthält, auch wenn Ihre Schrift ein solches nicht beinhaltet. Also können Sie jede Schriftart auswählen und alles sollte trotzdem richtig angezeigt werden.

source: Screenshot for font
de: Bildschirmfoto der Seite „Schriftart“

source: &kiten; font
de: &kiten;-Schriftart

source: Credits and License
de: Danksagungen und Lizenz

source: Developers
de: Entwickler

source: &Jason.Katz-Brown; &Jason.Katz-Brown.mail; - Original author.
de: &Jason.Katz-Brown; &Jason.Katz-Brown.mail; - Ursprünglicher Autor.

source: &Neil.Stevens; &Neil.Stevens.mail; - Code simplification, UI suggestions.
de: &Neil.Stevens; &Neil.Stevens.mail; - Code-Vereinfachung, Vorschläge für die Oberfläche.

source: Jim Breen <email>jwb@csse.monash.edu.au</email> - Wrote xjdic, of which &kiten; borrows code, and the xjdic index file generator. Also is main author of edict and kanjidic, which &kiten; essentially require.
de: Jim Breen <email>jwb@csse.monash.edu.au</email> - Schrieb xjdic, dessen Code in &kiten; verwendet wird, und den xjdic Indexdateien-Generator. Außerdem er der Hauptentwickler von edict und kanjidic, die für die Ausführung von &kiten; erforderlich sind.

source: Paul Temple <email>paul.temple@gmx.net</email> - Port to KConfig XT and bug fixing.
de: Paul Temple <email>paul.temple@gmx.net</email> - Portierung nach KConfig XT und Fehlerbeseitigung.

source: David Vignoni <email>david80v@tin.it</email> - SVG icon.
de: David Vignoni <email>david80v@tin.it</email> - SVG-Symbol.

source: Joe Kerian <email>jkerian@gmail.com</email> - KDE4 rewrite.
de: Joe Kerian <email>jkerian@gmail.com</email> - Portierung zu KDE4.

source: Eric Kjeldergaard <email>kjelderg@gmail.com</email> - KDE4 rewrite.
de: Eric Kjeldergaard <email>kjelderg@gmail.com</email> - Portierung zu KDE4.

source: Daniel E. Moctezuma <email>democtezuma@gmail.com</email> - Deinflection system improvements, dictionary updates for EDICT and KANJIDIC, GUI improvements, Kanji Browser, bug fixes, code polishing and simplification.
de: Daniel E. Moctezuma <email>democtezuma@gmail.com</email> - Verbesserungen am Deinflexionssystem, Aktualisierung der Wörterbücher für EDICT und KANJIDIC, Überarbeitung der Benutzeroberfläche, Kanji-Browser, Fehlerkorrekturen, Überarbeitung und Vereinfachung des Quelltextes.

source: Documentation copyright 2002, &Jason.Katz-Brown;
de: Copyright der Dokumentation 2002, &Jason.Katz-Brown;

source: Documentation copyright 2012, Daniel E. Moctezuma
de: Copyright der Dokumentation 2012, Daniel E. Moctezuma

source: CREDIT_FOR_TRANSLATORS
de: <para>Übersetzung: Thorsten Mürell <email>thorsten@muerell.de</email></para>
