Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdeedu/klettres.po
Languages: de

source: The &klettres; Handbook
de: Das Handbuch zu &klettres;

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Thorsten</firstname><surname>Mürell</surname><affiliation><address><email>thorsten@muerell.de</email></address></affiliation><contrib>Übersetzung</contrib></othercredit>

source: &klettres; is an application specially designed to do help the user to learn alphabet in a new language and then to learn to read simple syllables. The user can be a young child aged from two and a half or an adult that wants to learn the basics of a foreign language.
de: &klettres; ist eine Anwendung, die dafür erstellt wurde, dem Benutzer das Lernen des Alphabets in einer neuen Sprache zu erleichtern und dann anschließend das Lesen von einfachen Silben. Der Benutzer kann ein junges Kind von zweieinhalb sein oder ein Erwachsener, der die Grundlage einer fremden Sprache lernen möchte.

source: Twenty five languages are available at the moment: Arabian, Brazilian Portuguese, Czech, Danish, Dutch, British English, US English, Phonics English, French, German, Hebrew, Hungarian, Italian, Kannada, Low Saxon, Malayalam, Norwegian Bokmål, Punjabi, Luganda, Romanized Hindi, Russian, Spanish, Slovak, Telugu and Ukrainian but only English, French and your language if it is among those are installed by default.
de: Fünfundzwanzig Sprachen sind zurzeit verfügbar: Arabisch, Brasilianisches Portugiesisch, Tschechisch, Dänisch, Holländisch, Britisches Englisch, Amerikanisches Englisch, Englisches Phonics, Französisch, Deutsch, Hebräisch, Ungarisch, Italienisch, Kanadisch, Niederdeutsch, Malayam (eine Südindische Sprache), Norwegisch Bokmål, Punjab, Hindi (in lateinischer Umschrift), Russisch, Spanisch, Slowakisch, Telugu und Ukrainisch. Nur Englisch, Französisch und Ihre Sprache, wenn Sie hier aufgeführt ist, werden als Voreinstellung installiert.

source: &klettres; is really easy to use. The language can be changed using the <guimenu>Language</guimenu> menu. The user can also choose the Level from 1 to 4 in a combo box in the toolbar or via the <guimenu>Level</guimenu> menu. <guimenuitem>Themes</guimenuitem> (background and font color) can be changed in a combo box or in the <menuchoice><guimenu>Look</guimenu> <guimenuitem>Themes</guimenuitem></menuchoice> menu. Three themes are available: <guimenuitem>Kid</guimenuitem>, <guimenuitem>Desert</guimenuitem> and <guimenuitem>Savannah</guimenuitem>. Finally, the mode can be changed from kid to grown-up using the <guimenu>Look</guimenu> menu.
de: &klettres; ist leicht zu spielen. Sie können die Sprache im Menü <guimenu>Sprache</guimenu> wählen. Die Spielstufe von 1 bis 4 können Sie im Auswahlfeld in der Werkzeugleiste oder im Menü <guimenu>Spielstufe</guimenu> einstellen. Das <guimenuitem>Design</guimenuitem> (Hintergrund und Schrift) wählen Sie in einem Auswahlfeld oder im Menü <menuchoice><guimenu>Aussehen</guimenu> <guimenuitem>Design</guimenuitem></menuchoice>. Zur Auswahl stehen 3 Designs: <guimenuitem>Kind</guimenuitem>, <guimenuitem>Wüste</guimenuitem> und <guimenuitem>Savanne</guimenuitem>. Im Menü <guimenu>Aussehen</guimenu> können Sie einen Kindmodus oder den Erwachsenenmodus einstellen.

source: sounds
de: Klänge

source: language
de: Sprache

source: keyboard
de: Tastatur

source: Introduction
de: Einleitung

source: &klettres; is a very simple application that helps a child or an adult to learn the alphabet and some simple sounds in his own language or in another language. The program picks up a letter or a syllable in random, this letter/syllable is displayed and the sound is played. The user should then type this letter or syllable. Training is done in the levels where the letter/syllable is not displayed, only the sound is played. The user does not need to know how to use the mouse, the keyboard only is needed.
de: &klettres; ist eine einfaches Programm, das einem Kind oder einem Erwachsenen hilft, das Alphabet und einige einfache Laute in der eigenen oder einer fremden Sprache zu lernen. Das Programm wählt einen zufälligen Buchstaben oder eine Silbe dieser Buchstabe/diese Silbe wird angezeigt und der Laut wird abgespielt. Der Benutzer soll dann diesen Buchstaben oder diese Silbe eingeben. Das Training ist in verschiedene Schwierigkeitsstufen eingeteilt, in einigen Stufen wird der Buchstabe/die Silbe nicht angezeigt und nur der Laut gespielt Der Benutzer muss nicht wissen, wie die Maus bedient wird, die Tastatur reicht völlig aus.

source: There are twenty five languages available at the moment: see the list above. If your &kde; language is among those, then it is taken as default, otherwise French is the default. You can easily get any additional available language by using the <guimenu>File</guimenu> menu and <guimenuitem>Get Alphabet in New Language...</guimenuitem> menu item, provided that your computer is connected to the Internet.
de: Es gibt zurzeit Fünfundzwanzig Sprachen: Arabisch, Brasilianisches Portugiesisch, Tschechisch, Dänisch, Holländisch, Britisches Englisch, Amerikanisches Englisch, Phonics, Französisch, Deutsch, Hebräisch, Ungarisch, Italienisch, Kannadisch, Niederdeutsch, Malayam (eine Südindische Sprache), Norwegisch Bokmål, Punjab, Hindi (in lateinischer Umschrift), Russisch, Spanisch, Slowakisch, Telugu und Ukrainisch. Falls Ihre Sprache darin ist, wird diese als Standard eingestellt, sonst ist Französisch die Voreinstellung. Sie können zusätzliche Sprachen im Menü <guimenu>Datei</guimenu> mit <guimenuitem>Neue Sprache herunterladen ...</guimenuitem> installieren, Ihr Computer muss nur mit dem Internet verbunden sein.

source: Two different modes allow you to adapt &klettres; to your need and have the full usual interface or a stripped interface. For a child, the menubar is no longer visible. We assume that a child will not want to set the language himself. A combo box allows him to choose the different levels. For an older user, the background is not so childish and the menubar is present in the Grown-Up style. Three different themes (<guimenuitem>Kid</guimenuitem>, <guimenuitem>Desert</guimenuitem> and <guimenuitem>Savannah</guimenuitem>) set up a different background with different fonts and colors.
de: Mit zwei verschiedenen Oberflächen können Sie &klettres; an Ihre Bedürfnisse anpassen, entweder mit der üblichen vollständigen oder mit einer vereinfachten Oberfläche . Für ein Kind ist die Menüleiste ausgeblendet und die Auswahl der Sprache nicht möglich. In einem Auswahlfeld kann das Kind zwischen verschiedenen Spielstufen wählen. Für ältere Benutzer ist der Hintergrund nicht so kindisch und die Menüleiste wird angezeigt. Mit drei verschiedenen Designs (<guimenuitem>Kind</guimenuitem>, <guimenuitem>Wüste</guimenuitem> und <guimenuitem>Savanne</guimenuitem>) können Sie unterschiedliche Hintergründe und Schriften einstellen.

source: You do not need the language keyboard layout anymore as you can use the special <guimenuitem>Special Characters</guimenuitem> toolbar to type any special character in each language. In the <guimenu>Settings</guimenu> menu, <guisubmenu>Toolbars Shown</guisubmenu>, select <guimenuitem>Special Characters</guimenuitem> and the toolbar will appear at the bottom of &klettres;. Click on the letter you want and it will be shown in the input field. This toolbar can be dragged anywhere on your screen.
de: Sie brauchen die Tastatureinstellungen nicht mehr zu verändern, da Sie die Werkzeugleiste <guimenuitem>Sonderzeichen</guimenuitem> benutzen können, um Sonderzeichen in jeder Sprache einzugeben. Im Menü <guimenu>Einstellungen</guimenu> wählen Sie <guimenuitem>Angezeigte Werkzeugleisten</guimenuitem> und dann <guimenuitem>Sonderzeichen</guimenuitem>. Die Werkzeugleiste wird am unteren Rand von &klettres; angezeigt. Klicken Sie auf den Buchstaben, den Sie eingeben wollen und er wird im Eingabefeld angezeigt. Diese Werkzeugleiste können Sie auf dem Bildschirm beliebig verschieben.

source: If you prefer having the language keyboard layout, please use &systemsettings;, in the category <guilabel>Hardware</guilabel>, <guimenu>Input Devices</guimenu> on the page <guimenuitem>Keyboard</guimenuitem> in order to set the correct keyboard layout.
de: Falls Sie lieber die Tastaturbelegung ändern möchten, benutzen Sie die &systemsettings; und wählen aus der Kategorie <guilabel>Hardware</guilabel> <guimenu>Eingabegeräte</guimenu> die Seite <guimenuitem>Tastatur</guimenuitem> und stellen hier die gewünschte Tastaturbelegung ein.

source: Using &klettres;
de: &klettres; benutzen

source: &klettres; has 4 levels. Levels 1 and 2 deal with the alphabet and levels 3 and 4 concern syllables. For a very young child (2 1/2 to 4), I would suggest that he/she is sitting on your lap in front of the computer and that you do the game together.
de: &klettres; hat 4 Schwierigkeitsstufen. Die Stufen 1 und 2 behandeln das Alphabet und die Stufen 3 und 4 betreffen die Silben. Bei sehr jungen Kindern (2 1/2 bis 4) würde ich vorschlagen, dass sie auf Ihrem Schoß vor dem Computer sitzen und das Spiel zusammen spielen.

source: Levels 1 and 2
de: Stufen 1 und 2

source: Screenshot of &klettres; Level 1
de: Bildschirmfoto von &klettres; in der 1. Schwierigkeitsstufe

source: &klettres; level1
de: &klettres; Stufe 1

source: Level is Level 1, language is French, theme is Desert and mode is <emphasis>grown-up</emphasis>.
de: Spielstufe 1, Sprache Französisch, Wüsten-Design und der <emphasis>Erwachsenenmodus</emphasis>.

source: If your &kde; language is among the supported languages then this will be the default language the first time you run &klettres;. For other languages, English is the default. &klettres; comes with English, French and your default language if among those listed above and you can get additional languages via <menuchoice><guimenu>File</guimenu> <guimenuitem>Get Alphabet in New Language...</guimenuitem></menuchoice> provided you have an Internet connection.
de: Falls &klettres; in Ihrer Sprache übersetzt ist, wird diese Ihre Standardsprache, wenn Sie das erste Mal &klettres; starten. Für alle anderen Sprache ist Englisch der Standard. &klettres; wird mit Englisch, Französisch und Ihrer eingestellten Sprache installiert, wenn sie in der oben genannten Liste enthalten ist. Sie können zusätzliche Sprachen im Menü mit <guimenu>Datei</guimenu> und <guimenuitem>Neue Sprache herunterladen ...</guimenuitem> installieren, Ihr Computer muss nur mit dem Internet verbunden sein.

source: In level 1, the user sees the letter and hears the sound. He then has to type in the letter in the box. If it is correct, the next letter appears (without having to press &Enter; or whatever). If the user types the wrong letter, he hears the sound again. In this level, the user memorizes the letters, associates them with their sound and recognizes them on the keyboard.
de: In der Stufe 1 sieht der Benutzer einen Buchstaben und hört den Laut dazu. Er muss dann den Buchstaben in das Textfeld eingeben. Wenn das korrekt ausgeführt wurde, erscheint der nächste Buchstabe (ohne dass Sie die &Enter;taste oder etwas andere Tasten drücken müssen). Wenn der Benutzer falschen Buchstaben eingibt, wird der Laut noch einmal abgespielt. In dieser Stufe merkt sich der Benutzer die Buchstaben, verbindet sie mit den Lauten und erkennt sie auf der Tastatur.

source: The user can type in either lower or uppercase letters. The letters are automatically put in uppercase so that a child will match them with the keyboard. He can type only one letter at atime.
de: Der Benutzer kann entweder Klein- oder Großbuchstaben eingeben. Die Buchstaben werden automatisch in Großbuchstaben umgewandelt, sodass ein Kind diese auf der Tastatur wiedererkennt. Sie können nur jeweils einen Buchstaben eingeben.

source: When you type a letter in the input field, there is no need to press &Enter; and the program waits for a short while before testing if the letter is right. This short wait is to leave time to a young child to understand what he/she just typed, especially if this is the wrong letter. You can change this time by using the <guimenu>Settings</guimenu> menu, <guimenuitem>Configure &klettres;...</guimenuitem> and the <guilabel>Timer</guilabel> page which will bring you a dialog where you can set two different times: one for the <guilabel>Kid Mode</guilabel> and one for the <guilabel>Grown-up Mode</guilabel>.
de: Wenn Sie einen Buchstaben in das Eingabefeld eingeben, müssen Sie nicht die &Enter;taste drücken. Das Programm wartet einen Augenblick dann wird geprüft, ob der Buchstabe richtig war. Diese kurze Pause erlaubt es einem kleinen Kind zu verstehen, was es eingegeben hat, vor allem, wenn es der falsche Buchstabe war. Diese Wartezeit können Sie im Menü <guimenu>Einstellungen</guimenu>, <guimenuitem> &klettres; einrichten ...</guimenuitem>. Auf der Seite <guilabel>Zeiten</guilabel> können Sie zwei verschiedene Zeiten einstellen können: einmal für den Kindmodus und einmal für den Erwachsenenmodus.

source: After the first time, the language setting is saved in a configuration file on closing of &klettres; and loaded the next time, with the level you were in.
de: Nach dem ersten Start wird die Spracheinstellung in einer Datei beim Beenden von &klettres; gespeichert und beim nächsten Starten mit der zuletzt gespielten Spielstufe wieder geladen.

source: The mode (kid or grown-up) is saved in the config file and therefore is kept until you change.
de: Das Aussehen wird auch in der Einstellungsdatei gespeichert und wird deswegen beibehalten, bis Sie es ändern.

source: The letters appear in random order. They are not the same consecutively.
de: Die Buchstaben erscheinen in zufälliger Reihenfolge, aber nicht der gleiche Buchstabe hintereinander.

source: Screenshot of &klettres; Level 2
de: Bildschirmfoto von &klettres; in der 2. Schwierigkeitsstufe

source: &klettres; level2
de: &klettres; Stufe 2

source: Here is a screenshot of Level 2 with the <emphasis>kid</emphasis> mode, <emphasis>Kid</emphasis> theme and Danish language.
de: Hier ist ein Bildschirmfoto der Stufe 2 mit dem <quote>Kindmodus</quote>, im Design <emphasis>Kind</emphasis> in dänischer Sprache.

source: Clicking in the <guilabel>Level</guilabel> combo-box and choosing <guilabel>Level 2</guilabel> or using the <guimenu>Level</guimenu> menu brings you to level 2. In that level, the user only hears the sound of the letter and has to type in the letter. If he is wrong, the letter appears to help him.
de: Klicken Sie in das Auswahlfeld <guilabel>Spielstufe</guilabel> oder benutzen Sie das Menü <guilabel>Spielstufe</guilabel>, um die Spielstufe 2 einzustellen. In dieser Schwierigkeitsstufe hört der Benutzer nur den Laut des Buchstabens und muss ihn dann eingeben. Bei einer falschen Eingabe wird der richtige Buchstabe angezeigt, um dem Benutzer eine Hilfestellung zu geben.

source: Levels 3 and 4
de: Stufen 3 und 4

source: Screenshot of &klettres; Level 3
de: Bildschirmfotos von &klettres; Stufe 3

source: &klettres; level3
de: &klettres; Stufe 3

source: Here you can see &klettres; level 3, <emphasis>grown-up</emphasis> mode, <emphasis>Savannah</emphasis> theme and Czech language.
de: Hier sehen Sie &klettres; Stufe 3, <quote>Erwachsenenmodus</quote>, Design <emphasis>Savanne</emphasis> in tschechischer Sprache.

source: In level 3, the user sees the syllable and hears the sound. He then has to type in the letters in the box. If the first letter of the sound is wrong, the user cannot type in the second one. The letter disappears and he has to try again. The number of letters is two or three, it depends of the language.
de: In der Stufe 3 sieht der Benutzer die Silbe und hört den Laut. Er muss dann die Buchstaben in das Textfeld eingeben. Wenn der erste Buchstabe des Lautes falsch ist, können keine weiteren Buchstaben eingegeben werden. Der Buchstabe wird gelöscht und Benutzer hat einen weiteren Versuch. Die Silben haben zwei oder drei Buchstaben, das hängt von der Sprache ab.

source: Screenshot of &klettres; Level 4
de: Bildschirmfoto von &klettres; in der 4. Schwierigkeitsstufe

source: &klettres; level4
de: &klettres; Stufe 4

source: Here you can see &klettres; level 4, <emphasis>kid</emphasis> mode, <emphasis>Desert</emphasis> theme and Slovak language.
de: Hier sehen Sie &klettres; Stufe 4, <quote>Kindmodus</quote>, Design <emphasis>Wüste</emphasis> in Slowakischer Sprache.

source: The sounds appear in random order.
de: Die Laute ertönen in zufälliger Reihenfolge.

source: Clicking in the <guilabel>Level</guilabel> combo-box or using the <guimenu>Level</guimenu> menu in the menubar and choosing <guilabel>Level 4</guilabel> brings you to level 4. In that level, the user only hears the sound of the syllable and has to type in the letters. This level is quite difficult for a young child.
de: Klicken Sie in das Auswahlfeld <guilabel>Spielstufe</guilabel> oder benutzen Sie das Menü <guilabel>Spielstufe</guilabel>, um Spielstufe einzustellen. In dieser Schwierigkeitsstufe hört der Benutzer nur den Laut der Silbe und muss ihn dann eingeben. Diese Stufe ist sehr schwierig für ein kleines Kind.

source: Configuration dialog
de: Einrichtungsdialog

source: The configuration dialog has two pages: one for <guilabel>Font Settings</guilabel> and one for the <guilabel>Timer</guilabel>.
de: Der Dialog enthält die zwei Seiten <guilabel>Schrifteinstellungen</guilabel> und <guilabel>Zeiten</guilabel>.

source: About fonts
de: Über Schriftarten

source: You can easily change the font that displays the letters. In some distribution, the default font used from the system is really ugly. In grown-up mode, in the <guimenu>Settings</guimenu> menu, in <guimenuitem>Configure &klettres;...</guimenuitem> you will find a <guilabel>Font Settings</guilabel> page with a font chooser dialog. The new font will be applied to both the displayed letter/syllable and the user field.
de: Die Schriftart für die Anzeige der Buchstaben ist einstellbar. In einigen Distributionen sieht die Standardschrift nicht so toll aus. Im <quote>Erwachsenenmodus</quote> öffnen Sie im Menü <guimenu>Einstellungen</guimenu> mit <guimenuitem>&klettres; einrichten ...</guimenuitem> die Seite <guilabel>Schrifteinstellungen</guilabel>, auf der Sie eine neue Schrift auswählen können. Diese Schrift wird für die angezeigten Buchstaben/Silben und auch für das Eingabefeld benutzt.

source: Changing font is also nice as some fonts (Helvetica for example) do not display correctly East-European languages as Czech and Slovak. If some letters or syllables are not displayed, please change the font and choose Arial for example.
de: Die Schriftart zu ändern ist auch dann sinnvoll, weil einige Schriftarten (wie zum Beispiel <quote>Helvetica</quote>) die Osteuropäischen Sprachen wie Tschechisch und Slowakisch nicht korrekt anzeigen. Wenn einige Buchstaben oder Silben nicht angezeigt werden, ändern Sie bitte die Schriftart und wählen zum Beispiel <quote>Arial</quote>.

source: You can also choose here the size you like the best. This size will be kept in configuration.
de: Sie können hier auch die gewünschte Schriftgröße wählen. Diese Einstellung wird gespeichert.

source: Screenshot of &klettres; Font Chooser Dialog
de: Bildschirmfoto vom &klettres;-Dialog zur Auswahl der Schrift

source: &klettres; Font Chooser Dialog
de: &klettres;-Dialog zur Auswahl der Schrift

source: Here you can see &klettres; Font Chooser Dialog.
de: Hier sehen Sie den &klettres;-zur Auswahl der Schrift.

source: Timers
de: Zeiten

source: The timers set the time between two letters &ie; the time during which a letter is displayed. The units are tenths of seconds.
de: Hier stellen Sie die Zeit für die Anzeige der Buchstaben in Zehntelsekunden ein.

source: The <guilabel>Timer</guilabel> page in the <menuchoice><guimenu>Settings</guimenu> <guimenuitem>Configure &klettres;...</guimenuitem></menuchoice> dialog has two timers settings: one for the <guilabel>Kid Mode</guilabel> and one for the <guilabel>Grown-up Mode</guilabel>. Defaults are 4 tenths of seconds for <guilabel>Kid Mode</guilabel> and 2 tenths of seconds for <guilabel>Grown-up Mode</guilabel>. Increasing the time leaves you more time to see your errors.
de: Auf der Seite <guilabel>Zeiten</guilabel> des Dialogs <menuchoice><guimenu>Einstellungen</guimenu> <guimenuitem>&klettres; einrichten ...</guimenuitem> </menuchoice> können Sie zwei Zeiten einstellen: für den <guilabel>Kindmodus</guilabel> (Voreinstellung 4 Zehntelsekunden) und für den <guilabel>Erwachsenenmodus</guilabel>. (Voreinstellung 2 Zehntelsekunden). Die Einstellung einer längeren Zeitdauer hilft Ihnen, Fehler zu erkennen.

source: <screeninfo>Screenshot of &klettres; Timers Settings</screeninfo>
de: <screeninfo>Bildschirmfoto von &klettres; mit der Einstellung der Zeiten</screeninfo>

source: <phrase>Screenshot of &klettres; Timers Settings</phrase>
de: <phrase>Bildschirmfoto von &klettres; mit der Einstellung der Zeiten</phrase>

source: Getting a new language
de: Eine neue Sprache hinzufügen

source: You might want to use &klettres; to help you learn a new language. By using <menuchoice><guimenu>File</guimenu> <guimenuitem>Get Alphabet in New Language...</guimenuitem></menuchoice>, you will see a new dialog with the list of available languages (you need to be connected to the Internet to use that feature).
de: Möglicherweise möchten Sie mit &klettres; eine neue Sprache lernen. Mit <menuchoice><guimenu>Datei</guimenu> <guimenuitem>Neue Sprache herunterladen ...</guimenuitem></menuchoice> öffnen Sie einen Dialog, der die Liste der verfügbaren Sprachen anzeigt. (Um diese Funktion benutzen zu können, müssen Sie mit dem Internet verbunden sein.)

source: <screeninfo>Get a New Language Dialog</screeninfo>
de: <screeninfo>Der Dialog <quote>Neue Sprache herunterladen</quote></screeninfo>

source: <phrase>Get a New Language Dialog</phrase>
de: <phrase>Der Dialog <quote>Neue Sprache herunterladen</quote></phrase>

source: Click on the <guilabel>Install</guilabel> button on the right of the language you want to install.
de: Klicken Sie auf den Knopf <guilabel>Installieren</guilabel> rechts neben der gewünschten Sprache.

source: Please note that some files have several MB so it might be slow depending on your connection.
de: Bitte beachten Sie, dass einige Dateien eine Größe von mehreren Megabyte haben, sodass das Herunterladen abhängig von Ihrer Internetverbindung einige Zeit in Anspruch nehmen kann.

source: After the file is downloaded, it is automatically installed and when you close the <guilabel>Get Hot New Stuff</guilabel> dialog you'll see the new language in the <guimenu>Language</guimenu> menu and you can use it immediately.
de: Nachdem die Datei heruntergeladen wurde, wird sie automatisch installiert. Wenn Sie den Dialog schließen, können Sie die neue Sprache im Menü <guilabel>Sprache</guilabel> auswählen und sofort verwenden.

source: When a language is downloaded, you then can see the <guilabel>Install</guilabel> button turning to <guilabel>Uninstall</guilabel>.
de: Wenn eine Sprache heruntergeladen wurde, wechselt der Knopf <guilabel>Installieren</guilabel> zu <guilabel>Deinstallieren</guilabel>.

source: The next screenshot shows Danish installed.
de: Das nächste Bildschirmfoto zeigt die installierte Sprache Dänisch.

source: <screeninfo>Danish is installed</screeninfo>
de: <screeninfo>Dänisch ist installiert</screeninfo>

source: <phrase>Danish is installed</phrase>
de: <phrase>Dänisch ist installiert</phrase>

source: Command Reference
de: Befehlsreferenz

source: The Main &klettres; Window
de: Das Hauptfenster von &klettres;

source: The File Menu
de: Das Menü Datei
