Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdeedu/klettres.po
Languages: de

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>New Sound</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo></shortcut> <guimenu>Datei</guimenu> <guimenuitem>Neuer Laut</guimenuitem>

source: <action>Play</action> a new sound
de: <action>Spielt</action> einen neuen Laut

source: <shortcut> <keycap>F5</keycap> </shortcut> <guimenu>File</guimenu> <guimenuitem>Replay Sound</guimenuitem>
de: <shortcut><keycap>F5</keycap></shortcut> <guimenu>Datei</guimenu> <guimenuitem>Laut wiederholen</guimenuitem>

source: <action>Play</action> the same sound again
de: <action>Spielt</action> den gleichen Laut noch einmal

source: <guimenu>File</guimenu> <guimenuitem>Get Alphabet in New Language...</guimenuitem>
de: <guimenu>Datei</guimenu> <guimenuitem>Neue Sprache herunterladen ...</guimenuitem>

source: <action>Opens</action> the <guilabel>Get Hot New Stuff</guilabel> dialog for &klettres; to download a new language
de: <action>Öffnet</action> den Dialog <quote>Neue Erweiterungen herunterladen</quote> für &klettres;, um eine neue Sprache herunterzuladen.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Quit</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo></shortcut> <guimenu>Datei</guimenu> <guimenuitem>Beenden</guimenuitem>

source: <action>Quits</action> &klettres;
de: <action>Beendet</action> &klettres;

source: The Level Menu
de: Das Menü Spielstufe

source: <guimenu>Level</guimenu> <guimenuitem>Level 1</guimenuitem>
de: <guimenu>Spielstufe</guimenu> <guimenuitem>Stufe 1</guimenuitem>

source: <action>Choose</action> the level 1 (letter displayed and sound)
de: <action>Stellt</action> die Spielstufe 1 ein (Buchstaben werden angezeigt und vorgelesen)

source: <guimenu>Level</guimenu> <guimenuitem>Level 2</guimenuitem>
de: <guimenu>Spielstufe</guimenu> <guimenuitem>Stufe 2</guimenuitem>

source: <action>Choose</action> the level 2 (no letter displayed, sound only)
de: <action>Stellt</action> die Spielstufe 2 ein (Buchstaben werden nicht angezeigt, nur vorgelesen)

source: <guimenu>Level</guimenu> <guimenuitem>Level 3</guimenuitem>
de: <guimenu>Spielstufe</guimenu> <guimenuitem>Stufe 3</guimenuitem>

source: <action>Choose</action> the level 3 (syllable displayed and sound)
de: <action>Stellt</action> die Spielstufe 3 ein (Silben werden angezeigt und vorgelesen)

source: <guimenu>Level</guimenu> <guimenuitem>Level 4</guimenuitem>
de: <guimenu>Spielstufe</guimenu> <guimenuitem>Stufe 4</guimenuitem>

source: <action>Choose</action> the level 4 (no syllable displayed, sound only)
de: <action>Stellt</action> die Spielstufe 4 ein (Silben werden nicht angezeigt, nur vorgelesen)

source: The Language Menu
de: Das Menü Sprache

source: <guimenu>Language</guimenu> <guimenuitem>English</guimenuitem>
de: <guimenu>Sprache</guimenu> <guimenuitem>Englisch</guimenuitem>

source: <action>Choose</action> the English language
de: <action>Wählt</action> die Englische Sprache

source: <guimenu>Language</guimenu> <guimenuitem>French</guimenuitem>
de: <guimenu>Sprache</guimenu> <guimenuitem>Französisch</guimenuitem>

source: <action>Choose</action> the French language
de: <action>Wählt</action> die Französische Sprache

source: The Look Menu
de: Das Menü Aussehen

source: <guimenu>Look</guimenu> <guisubmenu>Themes</guisubmenu> <guimenuitem>Kid</guimenuitem>
de: <guimenu>Aussehen</guimenu> <guisubmenu>Design</guisubmenu> <guimenuitem>Kind</guimenuitem>

source: <action>Switch</action> to the Kid theme
de: <action>Wechselt</action> zum Design <quote>Kind</quote>

source: <guimenu>Look</guimenu> <guisubmenu>Themes</guisubmenu> <guimenuitem>Desert</guimenuitem>
de: <guimenu>Aussehen</guimenu> <guisubmenu>Design</guisubmenu> <guimenuitem>Wüste</guimenuitem>

source: <action>Switch</action> to the Desert theme
de: <action>Wechselt</action> zum Design <quote>Wüste</quote>

source: <guimenu>Look</guimenu> <guisubmenu>Themes</guisubmenu> <guimenuitem>Savannah</guimenuitem>
de: <guimenu>Aussehen</guimenu> <guisubmenu>Design</guisubmenu> <guimenuitem>Savanne</guimenuitem>

source: <action>Switch</action> to the Savannah theme
de: <action>Wechselt</action> zum Design <quote>Savanne</quote>

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>K</keycap></keycombo> </shortcut> <guimenu>Look</guimenu> <guimenuitem>Mode Kid</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>K</keycap></keycombo></shortcut> <guimenu>Aussehen</guimenu> <guimenuitem>Kindmodus</guimenuitem>

source: <action>Toggle</action> the kid mode: no menubar
de: <action>Stellt</action> den Kindmodus ohne Menüleiste ein

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>G</keycap></keycombo> </shortcut> <guimenu>Look</guimenu> <guimenuitem>Mode Grown-up</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>G</keycap></keycombo></shortcut> <guimenu>Aussehen</guimenu> <guimenuitem>Erwachsenenmodus</guimenuitem>

source: <action>Toggle</action> the grown-up mode: normal interface
de: <action>Stellt</action> den Erwachsenenmodus mit der normalen Oberfläche ein

source: Additionally &klettres; has the common &kde; <guimenu>Settings</guimenu> and <guimenu>Help</guimenu> menu items, for more information read the sections about the <ulink url="help:/fundamentals/ui.html#menus-settings">Settings Menu</ulink> and <ulink url="help:/fundamentals/ui.html#menus-help">Help Menu</ulink> of the &kde; Fundamentals.
de: Zusätzlich hat &klettres; die bekannten &kde;-Einträge im Menü <guimenu>Einstellungen</guimenu> und <guimenu>Hilfe</guimenu>, weitere Informationen dazu finden Sie in den Abschnitten über die Menüs <ulink url="help:/fundamentals/ui.html#menus-settings">Einstellungen</ulink> und <ulink url="help:/fundamentals/uihtml#menus-help">Hilfe</ulink> der &kde;-Grundlagen.

source: Adding Sounds to &klettres;
de: Neue Dateien mit Lauten für &klettres;

source: If you would like to add sounds in your own language, it is very easy to do so. Record the alphabet sounds and place them in a folder named 'alpha'. Then record the most current syllables and put them in a folder named 'syllab'.
de: Es ist sehr einfach, Laute für Ihre eigene Sprache hinzuzufügen. Nehmen Sie die Laute Ihres Alphabets auf und speichern Sie sie in einen Ordner namens ‚alpha‘. Nehmen Sie dann die Laute der häufigsten Silben auf und speichern Sie sie in einen Ordner namens ‚syllab‘.

source: Create a text file <filename>sounds.xml</filename>, preferably using &kate; as editor or another editor capable of different encoding. In this file, write all the alphabet sounds and syllable sounds you recorded, like this example for the czech language:
de: Erstellen Sie die Textdatei <filename>sounds.xml</filename> mit &kate; als Editor oder einem anderen Editor, der verschiedene Kodierungen verarbeitet. In diese Datei schreiben Sie alle aufgenommen Buchstaben- und Silbendateien, wie in diesem Beispiel für die tschechische Sprache:

source: Replace "cs" with the two letter code and "Czech" with the name of your language. Write the sound names with the special characters of your language in uppercase in utf8.
de: Ersetzen Sie <quote>cs</quote> mit dem Zwei-Buchstaben-Code und <quote>Czech</quote> mit dem Namen Ihrer Sprache. Schreiben Sie die Namen der Laute auch mit den Sonderzeichen Ihrer Sprache in Großbuchstaben in utf8-Kodierung.

source: Additionally you can tell me about special letters in your language so I can easily generate the special <guimenuitem>Special Characters</guimenuitem> toolbar. Create a text file <filename>cs.txt</filename> (replace "cs" with the two letter code of your language) with each special character of your language in uppercase on one line. And save both text files with <quote>utf8</quote> encoding (upper right dropbox in &kate; allows that)
de: Geben Sie mir auch alle Sonderzeichen für Ihre Sprache an, damit ich dann die Werkzeugleiste für diese <guimenuitem>Sonderzeichen</guimenuitem> erstellen kann. Schreiben Sie alle Sonderzeichen Ihrer Sprache in Großbuchstaben zeilenweise in eine Textdatei namens <filename>cs.txt</filename> (Ersetzen Sie <quote>cs</quote> mit dem Zwei-Buchstaben-Code Ihrer Sprache). Speichern Sie beide Dateien in <quote>utf8</quote>-Kodierung (in &kate; in dem Auswahlfeld oben rechts).

source: The sounds should be in ogg format and long enough for the audio player to play them (between 1.5 and 2 seconds long, please add some silence if they are too short). Then make a tarball of all that and send it to me.
de: Die Laute sollten im ogg- Format vorliegen und lang genug für das Abspielen mit dem Audioabspieler sein (Dauer der Aufnahme etwa 1,5 bis 2 Sekunden). Packen Sie alle Dateien mit tar und schicken Sie sie mir.

source: See the <ulink url="http://edu.kde.org/klettres/add_language.php">&klettres; website</ulink> for more up to date instructions on how to add a new language.
de: Auf der <ulink url="http://edu.kde.org/klettres/add_language.php">&klettres; Internetseite</ulink> finden Sie neuere Informationen, wie Sie eine neue Sprache hinzuzufügen können.

source: Questions and Answers
de: Fragen und Antworten

source: The background picture does not appear.
de: Das Hintergrundbild erscheint nicht.

source: If you build &klettres; yourself, you need to configure with the <option>--prefix</option> option set to your &kde; folder or to add this folder to your path.
de: Wenn Sie &klettres; selbst kompilieren, müssen Sie <quote>configure</quote> die Option <option>--prefix</option> mit dem &kde;-Ordner übergeben oder diesen Ordner zu ihrem Pfad hinzufügen.

source: I do not hear any sounds
de: Ich höre keine Laute

source: Make sure that &phonon; is working on your system. To do so, open &systemsettings; and in the <guilabel>Hardware</guilabel> category click on <guilabel>Multimedia</guilabel>.
de: Vergewissern Sie sich, dass &phonon; auf Ihrem System funktioniert. Dazu öffnen Sie die &systemsettings; und klicken im Abschnitt <guilabel>Hardware</guilabel> auf <guilabel>Multimedia</guilabel>.

source: I do not see some letters on the icons on the special <guimenuitem>Characters</guimenuitem> toolbar. I see rectangles instead for some languages.
de: Ich sehe keine Buchstaben auf einigen Symbolen in der Werkzeugleiste für Sonderzeichen. Stattdessen werden nur Rechtecke in einigen Sprachen angezeigt.

source: &klettres; in Czech and Slovak needs Arial and if you do not have this font installed, please ask your distribution support how to install it.
de: &klettres; braucht für Tschechisch und Slowakisch die Schrift Arial. Haben Sie diese Schrift nicht installiert, suchen Sie sie in Ihrer Distribution.

source: If you have &Windows; on your machine, you can use the TTF fonts from &Windows; (Arial is in those) via &systemsettings; -&gt; <guilabel>System Administration</guilabel> -&gt; <guilabel>Font Installer</guilabel> and add the &Windows; Font folder.
de: Wenn Sie &Windows; auf Ihrem Computer installiert haben, können Sie dessen TTF-Schriften (Arial ist darin enthalten) benutzen, indem Sie in den &systemsettings; -&gt; <guilabel>Systemverwaltung</guilabel> -&gt; <guilabel>Schriftarteninstallation</guilabel> wählen und den Ordner mit den &Windows;-Schriften hinzufügen.

source: The letters on the icons on the <guimenuitem>Special Characters</guimenuitem> toolbar are too small for some languages.
de: Die Buchstaben auf den Symbolen für <guimenuitem>Sonderzeichen</guimenuitem> in der Werkzeugleiste sind in einigen Sprachen zu klein.

source: Why are there only twenty five languages?
de: Warum gibt es nur Fünfundzwanzig Sprachen?

source: In order for me to add a new language, I need the sounds for the alphabet and some basic syllables. Someone speaking natively the new language must record these sounds in ogg format. For levels 3 and 4, the syllables must be chosen by a teacher or someone who knows how children learn: these must be the syllables you have to learn just after the alphabet in order to learn well the basics of this language. Please send me a mail if you are able to do that. See <ulink url="http://edu.kde.org/klettres/add_language.php">the &klettres; website</ulink> for detailed instructions on how to add a new language.
de: Damit ich eine neue Sprache erstellen kann, brauche ich die Laute für das Alphabet und einige grundlegende Silben. Jemand, der eine Sprache als Muttersprache spricht, muss diese Laute im ogg-Format aufnehmen. Für die Stufen 3 und 4 müssen die Silben von einem Lehrer oder von jemandem ausgewählt werden, der sich mit dem Lehren beschäftigt: Es müssen die Laute sein, die man gleich nach dem Alphabet als Grundlage der Sprache lernt.Bitte senden Sie mir eine E-Mail, wenn Sie dazu in der Lage sind. Siehe <ulink url="http://edu.kde.org/klettres/add_language.php">die &klettres;-Internetseite</ulink> für ausführliche Informationen, um eine neue Sprache hinzuzufügen.

source: Credits and License
de: Danksagungen und Lizenz

source: Program copyright 2001-2007 &Anne-Marie.Mahfouf; &Anne-Marie.Mahfouf.mail;
de: Programm Copyright 2001-2007 &Anne-Marie.Mahfouf; &Anne-Marie.Mahfouf.mail;

source: I am very grateful to the following people whose contribution has been greatly valuable:
de: Ich bin folgenden Personen sehr dankbar für Ihre große Hilfe:

source: Brazilian Portuguese sounds: Lindonjohnson Monte (Father) and Michelle Monte 09 years (Son) <email>lindon_johnson@brturbo.com.br</email>
de: Laute für brasilianisches Portugiesisch: Lindonjohnson Monte (Vater) and Michelle Monte, 9 Jahre (Sohn) <email>lindon_johnson@brturbo.com.br</email>

source: Czech sounds: Eva Mikulčíková <email>evmi@seznam.cz</email>
de: Tschechische Laute: Eva Mikulčíková <email>evmi@seznam.cz</email>

source: Danish sounds: Erik Kjaer Pedersen <email>erik@binghamton.edu</email>
de: Dänische Laute: Erik Kjaer Pedersen <email>erik@binghamton.edu</email>

source: Dutch sounds: Geert Stams <email>geert@pa3csg.myweb.nl</email>
de: Holländische Laute: Geert Stams <email>geert@pa3csg.myweb.nl</email>

source: English sounds: Robert Wadley <email>robntina@juno.com</email>
de: Englische Laute: Robert Wadley <email>robntina@juno.com</email>

source: French sounds: Ludovic Grossard <email>grossard@kde.org</email>
de: Französische Laute: Ludovic Grossard <email>grossard@kde.org</email>

source: German sounds: Helmut Kriege <email>h.kriege@freenet.de</email>
de: Deutsche Laute: Helmut Kriege <email>h.kriege@freenet.de</email>

source: Hebrew sounds: Assaf Gorgon <email>assafgordon@gmail.com</email>
de: Hebräische Laute: Assaf Gorgon <email>assafgordon@gmail.com</email>

source: Italian sounds: Pietro Pasotti <email>pietro@itopen.it</email>
de: Italienische Laute: Pietro Pasotti <email>pietro@itopen.it</email>

source: Kannada sounds: Vikram Vincent <email>vincentvikram@gmail.com</email>
de: Kannada Laute: Vikram Vincent <email>vincentvikram@gmail.com</email>

source: Low Saxon sounds: Manfred Wiese and Sönke Dibbern <email>s_dibbern@web.de</email>
de: Niederdeutsche Laute: Manfred Wiese and Sönke Dibbern <email>s_dibbern@web.de</email>

source: Luganda sounds: John Magoye and Cormac Lynch <email>cormaclynch@eircom.net</email>
de: Luganda Laute: John Magoye and Cormac Lynch <email>cormaclynch@eircom.net</email>

source: Romanized Hindi sounds: Vikas Kharat <email>kharat@sancharnet.in</email>
de: Hindi Laute (in lateinischer Umschrift): Vikas Kharat <email>kharat@sancharnet.in</email>

source: Spanish sounds: Ana Belén Caballero and Juan Pedro Paredes <email>neneta @iquis.com</email>
de: Spanische Laute: Ana Belén Caballero und Juan Pedro Paredes <email>neneta @iquis.com</email>

source: Slovak sounds: Silvia Motyčková and Jozef Říha <email>silviamotycka@seznam.cz</email>
de: Slowakische Laute: Silvia Motyčková und Jozef Říha <email>silviamotycka@seznam.cz</email>

source: Telugu sounds: Pavithran Shakamuri <email>pavithran.s@gmail.com</email>
de: Telugu Laute: Pavithran Shakamuri <email>pavithran.s@gmail.com</email>

source: Original icons: &Primoz.Anzur; <email>zerokode@yahoo.com</email>
de: Ursprüngliche Symbole: &Primoz.Anzur; <email>zerokode@yahoo.com</email>

source: Support and coding guidance: &Robert.Gogolok; &Robert.Gogolok.mail;
de: Unterstützung und Hilfe beim Programmieren: &Robert.Gogolok; &Robert.Gogolok.mail;

source: SVG icon: Chris Luetchford <email>chris@os11.com</email>
de: SVG-Symbole: Chris Luetchford <email>chris@os11.com</email>

source: Code for generating special characters icons: Peter Hedlund <email>peter@peterandlinda.com</email>
de: Code für die Anzeige der Symbole für die Sonderzeichen: Peter Hedlund <email>peter@peterandlinda.com</email>

source: Port to KConfig XT, coding help: &Waldo.Bastian; &Waldo.Bastian.mail;
de: Portierung zu KConfig XT, Hilfe beim Programmieren: &Waldo.Bastian; &Waldo.Bastian.mail;

source: Kids and grownup SVG icons, Desert theme: &Danny.Allen; <email>dannya40uk@yahoo.co.uk</email>
de: SVG-Symbole für Kinder und Erwachsene, Wüstendesign: &Danny.Allen; <email>dannya40uk@yahoo.co.uk</email>

source: Timer setting widget: Michael Goettsche <email>michael.goettsche@kdemail.net</email>
de: Symbol für die Einstellung der Zeiten: Michael Goettsche <email>michael.goettsche@kdemail.net</email>

source: Documentation copyright 2001-2006 &Anne-Marie.Mahfouf;&Anne-Marie.Mahfouf.mail;
de: Copyright der Dokumentation 2001-2006 &Anne-Marie.Mahfouf;&Anne-Marie.Mahfouf.mail;

source: CREDIT_FOR_TRANSLATORS
de: <para>Übersetzung: Thorsten Mürell <email>thorsten@muerell.de</email></para>
