Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdeedu/kmplot_introduction.po
Languages: de

source: Introduction
de: Einführung

source: &kmplot; is a mathematical function plotter for the &kde; Desktop. It has a powerful built-in parser. You can plot different functions simultaneously and combine them to build new functions.
de: &kmplot; ist ein mathematischer Funktionsplotter für die &kde;-Arbeitsoberfläche. Er enthält einen leistungsfähigen Funktionsanalysierer. Sie können verschiedene Funktionen gleichzeitig zeichnen lassen und Funktionsausdrücke kombinieren, um neue Funktionen zu erstellen.

source: <screeninfo>Examples</screeninfo>
de: <screeninfo>Beispiele</screeninfo>

source: <phrase>Examples</phrase>
de: <phrase>Beispiele</phrase>

source: &kmplot; supports several different types of plots:
de: In &kmplot; können Sie mit unterschiedlichen Funktionstypen arbeiten:

source: Explicit cartesian plots of the form y = f(x).
de: Explizite kartesische Graphen der Form y = f(x).

source: Parametric plots, where the x and y components are specified as functions of an independent variable.
de: Parametrische Graphen, dabei sind die x- und y-Komponenten als Funktion einer unabhängigen Variablen definiert.

source: Polar plots of the form r = r(&thgr;).
de: Polare Graphen der Form r = r(&thgr;).

source: Implicit plots, where the x and y coordinates are related by an expression.
de: Implizite Graphen, deren Funktionswerte implizit durch eine Gleichung F(x,y) definiert sind.

source: Explicit differential plots.
de: Explizite Differentialgraphen.

source: &kmplot; also provides some numerical and visual features like:
de: &kmplot; bietet zusätzlich numerische und visuelle Eigenschaften wie:

source: Filling and calculating the area between the plot and the first axis
de: Füllung und Berechnung der Fläche zwischen dem Graphen und der ersten Achse

source: Finding maximum and minimum values
de: Berechnung von maximalen und minimalen Werten

source: Changing function parameters dynamically
de: Dynamische Änderung von Funktionsparametern

source: Plotting derivatives and integral functions.
de: Zeichnung von Ableitungen und Integralfunktionen

source: These features help in learning the relationship between mathematical functions and their graphical representation in a coordinate system.
de: Diese Eigenschaften unterstützen das Lernen von Beziehungen zwischen mathematischen Funktionen und deren grafischer Darstellung in Koordinatensystemen
