Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdeedu/kmplot_using.po
Languages: de

source: Using &kmplot;
de: Arbeiten mit &kmplot;

source: &kmplot; deals with several different types of functions, which can be written in function form or as an equation:
de: In &kmplot; können Sie mit unterschiedliche Arten von Funktionen benutzen, dabei können Sie sie als Funktion oder als Ausdruck eingeben.

source: Cartesian plots can either be written as &eg; <quote>y = x^2</quote>, where x has to be used as the variable; or as &eg; <quote>f(a) = a^2</quote>, where the name of the variable is arbitrary.
de: Kartesische Funktionen können Sie entweder als &eg; <quote>y = x^2</quote>, dabei muss x als Name der Variable benutzt werden, oder als &eg; <quote>f(a) = a^2</quote> eingeben, dabei können Sie einen beliebigen Namen für die Variable verwenden.

source: Parametric plots are similar to Cartesian plots. The x and y coordinates can be entered as equations in t, &eg; <quote>x = sin(t)</quote>, <quote>y = cos(t)</quote>, or as functions, &eg; <quote>f_x(s) = sin(s)</quote>, <quote>f_y(s) = cos(s)</quote>.
de: In parametrischen Funktionen werden die x- und y-Koordinaten als Ausdrücke von t, &eg; <quote>x = sin(t)</quote>, <quote>y = cos(t)</quote> oder als Funktionen wie &eg; <quote>f_x(s) = sin(s)</quote>, <quote>f_y(s) = cos(s)</quote> eingegeben.

source: Polar plots are also similar to Cartesian plots. They can be either be entered as an equation in &thgr;, &eg; <quote>r = &thgr;</quote>, or as a function, &eg; <quote>f(x) = x</quote>.
de: Polare Funktionen können entweder als Ausdrücke von &thgr;, &eg; <quote>r = &thgr;</quote> oder als Funktionen wie &eg; <quote>f(x) = x</quote> eingegeben werden.

source: For implicit plots, the name of the function is entered separately from the expression relating the x and y coordinates. If the x and y variables are specified via the function name (by entering &eg;<quote>f(a,b)</quote> as the function name), then these variables will be used. Otherwise, the letters x and y will be used for the variables.
de: Bei impliziten Funktionen kann der Name der Funktion getrennt von dem Ausdruck für die x- und y-Koordinaten eingegeben werden. Wenn die Variablen x und y über den Funktionsnamen festgelegt werden (&eg; mit <quote>f(a,b)</quote> als Name der Funktion), dann werden diese Variablen a und b verwendet. Ansonsten werden die Buchstaben x und y für die Variablen benutzt.

source: Explicit differential plots are differential equations whereby the highest derivative is given in terms of the lower derivatives. Differentiation is denoted by a prime ('). In function form, the equation will look like <quote>f''(x) = f' &minus; f</quote>. In equation form, it will look like <quote>y'' = y' &minus; y</quote>. Note that in both cases, the <quote>(x)</quote> part is not added to the lower order differential terms (so you would enter <quote>f'(x) = &minus;f</quote> and not <quote>f'(x) = &minus;f(x)</quote>).
de: Explizite Differentialfunktionen werden durch Differentialgleichungen beschrieben, in denen die höchste Ableitung als Ausdruck der niedrigeren Ableitungen angegeben wird. Die Ableitung wird durch das Zeichen <keycap>'</keycap> gekennzeichnet. Als Funktionsform lautet die Gleichung zum Beispiel <quote>f''(x) = f' &minus; f</quote>, als Gleichungsform <quote>y'' = y' &minus; y</quote>. In beiden Fällen wird <quote>(x)</quote> nicht in den niedrigeren Ableitungen eingefügt. Die richtige Schreibweise ist also <quote>f'(x) = &minus;f</quote> und nicht <quote>f'(x) = &minus;f(x)</quote>).

source: All the equation entry boxes come with a button on the right. Clicking this invokes the advanced <guilabel>Equation Editor</guilabel> dialog, which provides:
de: Die Eingabefelder der Funktionen haben rechts einen Knopf. Damit öffnen Sie den <guilabel>Gleichungseditor</guilabel>, der folgende Funktionen bietet:

source: A variety of mathematical symbols that can be used in equations, but aren't found on normal keyboards.
de: Eingabe vieler mathematischer Symbole, die nicht auf der normalen Tastatur vorhanden sind, in Funktionsgleichungen.

source: The list of user constants and a button for editing them.
de: Eingabe benutzerdefinierter Konstanten und die Möglichkeit zur Bearbeitung dieser Konstanten.

source: The list of predefined functions. Note that if you have text already selected, it will be used as the function argument when a function is inserted. For example, if <quote>1 + x</quote> is selected in the equation <quote>y = 1 + x</quote>, and the sine function is chosen, then the equation will become <quote> y = sin(1+x)</quote>.
de: Eine Liste vordefinierter Funktionen. Wenn Sie bereits Text markiert haben, wird dieser Text als Argument benutzt, wenn Sie eine Funktion einfügen. Ist zum Beispiel <quote>1 + x</quote> in der Gleichung <quote>y = 1 + x</quote> markiert und Sie wählen die Sinusfunktion, erstellen Sie damit die Gleichung <quote> y = sin(1+x)</quote>.

source: Here is a screenshot of the &kmplot; welcome window
de: Hier ist ein Bildschirmfoto von &kmplot; beim Start

source: Screenshot
de: Bildschirmfoto

source: Function Types
de: Funktionstypen

source: Cartesian Functions
de: Kartesische Funktionen

source: To enter an explicit function (&ie;, a function in the form y=f(x)) into &kmplot;, just enter it in the following form: <screen><userinput><replaceable>f</replaceable>(<replaceable>x</replaceable>) = <replaceable>expression</replaceable></userinput></screen> where:
de: Eine explizite Funktion (&ie; eine Funktion in der Form y=f(x)), können Sie in &kmplot; auf folgende Art eingeben: <screen><userinput><replaceable>f</replaceable>(<replaceable>x</replaceable>)=<replaceable>Ausdruck</replaceable></userinput></screen> Dabei ist:

source: <replaceable>f</replaceable> is the name of the function, and can be any string of letters and numbers.
de: <replaceable>f</replaceable> der Name der Funktion und kann aus jeder Kombination von Buchstaben und Zahlen bestehen.

source: <replaceable>x</replaceable> is the horizontal coordinate, to be used in the expression following the equals sign. It is a dummy variable, so you can use any variable name you like to achieve the same effect.
de: <replaceable>x</replaceable> die waagerechte Koordinate, die im Ausdruck benutzt wird, der nach dem Gleichheitszeichen folgt. Das ist ein Platzhalter, also können Sie jeden beliebigen Namen verwenden, das Ergebnis ist das Gleiche.

source: <replaceable>expression</replaceable> is the expression to be plotted, given in the appropriate syntax for &kmplot;. See <xref linkend="math-syntax"/>.
de: <replaceable>Ausdruck</replaceable> ist der Ausdruck, der gezeichnet werden soll, in der von &kmplot; geforderten Schreibweise. Siehe dazu <xref linkend="math-syntax"/>.

source: Parametric Functions
de: Parametrische Funktionen

source: Parametric functions are those in which the x and y coordinates are defined by separate functions of another variable, often called t. To enter a parametric function in &kmplot;, follow the procedure as for a Cartesian function for each of the x and y functions. As with Cartesian functions, you may use any variable name you wish for the parameter.
de: In parametrischen Funktionen werden die x- und y-Koordinaten über unabhängige Funktionen einer anderen Variable, oft t genannt, definiert. Um eine parametrische Funktion in &kmplot; zu zeichnen, geben Sie die x- und y-Funktion als kartesische Funktionen ein. Auch hier können Sie einen beliebigen Variablennamen für die Parameter verwenden.

source: As an example, suppose you want to draw a circle, which has parametric equations x = sin(t), y = cos(t). After creating a parametric plot, enter the appropriate equations in the x and y boxes, &ie;, <userinput>f_x(t)=sin(t)</userinput> and <userinput>f_y(t)=cos(t)</userinput>.
de: Angenommen, Sie möchten eine Kreis mit dem parametrischen Ausdruck x = sin(t), y = cos(t) zeichnen. Wählen Sie dazu Parametrische Zeichnung und geben Sie die passenden Ausdrücke in das x- und y-Eingabefeld ein, &ie; <userinput>f_x(t)=sin(t)</userinput> and <userinput>f_y(t)=cos(t)</userinput>.

source: You can set some further options for the plot in the function editor:
de: Sie können noch weitere Optionen für die Zeichnung im Funktionen-Editor einstellen:

source: These options control the range of the parameter t for which the function is plotted.
de: Diese Einstellungen geben den Wertebereich des Parameters t an, für den die Funktion gezeichnet wird.

source: Functions in Polar Coordinates
de: Funktionen in Polarkoordinaten

source: Polar coordinates represent a point by its distance from the origin (usually called r), and the angle a line from the origin to the point makes with the horizontal axis (usually represented by &thgr; the Greek letter theta). To enter functions in polar coordinates, click the <guilabel>Create</guilabel> button and select <guilabel>Polar Plot</guilabel> from the list. In the definition box, complete the function definition, including the name of the theta variable you want to use, &eg;, to draw the Archimedes' spiral r = &thgr;, enter: <screen><userinput>r(&thgr;) = &thgr;</userinput></screen> Note that you can use any name for the theta variable, so <quote>r(t) = t</quote> or <quote>f(x) = x</quote> will produce exactly the same output.
de: Polarkoordinaten bestimmen einen Punkt durch den Abstand vom Ursprung (üblicherweise r genannt) und durch den Winkel einer Linie vom Ursprung durch den Punkt zur waagerechten Achse (üblicherweise mit dem griechischen Buchstaben &thgr; bezeichnet). Funktionen in polaren Koordinaten erzeugen Sie, indem Sie auf <guilabel>Erstellen</guilabel> klicken und <guilabel>Polare Zeichnung</guilabel> wählen. Im Eingabefeld geben Sie die Definition der Funktion mit dem Namen der theta-Variablen ein. Um &eg; die Spirale des Archimedes r = &thgr; zu zeichnen, geben Sie ein: <screen><userinput>r(&thgr;) = &thgr;</userinput></screen>. Sie können jeden beliebigen Namen als theta-Variable verwenden, daher ergibt <quote>r(t) = t</quote> oder <quote>f(x) = x</quote> die gleiche Zeichnung.

source: Implicit Functions
de: Implizite Funktionen

source: An implicit expression relates the x and y coordinates as an equality. To create a circle, for example, click the <guilabel>Create</guilabel> button and select <guilabel>Implicit Plot</guilabel> from the list. Then, enter into the equation box (below the function name box) the following:
de: Ein impliziter Ausdruck gibt die Beziehung zwischen x- und y-Koordinaten als Gleichung an. Um zum Beispiel einen Kreis zu zeichnen, klicken Sie auf den Knopf <guilabel>Erstellen</guilabel> und wählen <guilabel>Implizite Zeichnung</guilabel> aus der Liste. Tragen Sie dann im Gleichungsfeld unter dem Funktionsnamen folgendes ein:

source: Differential Functions
de: Differentielle Funktionen

source: &kmplot; can plot explicit differential equations. These are equations of the form y<superscript>(n)</superscript> = F(x,y',y'',...,y<superscript>(n&minus;1)</superscript>), where y<superscript>k</superscript> is the k<superscript>th</superscript> derivative of y(x). &kmplot; can only interpret the derivative order as the number of primes following the function name. To draw a sinusoidal curve, for example, you would use the differential equation <userinput>y'' = &minus; y</userinput> or <userinput>f''(x) = −f</userinput>.
de: &kmplot; kann explizite Differentialgleichungen darstellen. Dies sind Gleichungen in der Form y<superscript>(n)</superscript> = F(x,y',y'',...,y<superscript>(n&minus;1)</superscript>), dabei ist y<superscript>n</superscript> die n-<superscript>te</superscript> Ableitung von y(x). Die Ordnung der Ableitung wird aus der Anzahl der <keycap>'</keycap> nach der Funktionsbezeichnung bestimmt. Um zum Beispiel eine sinusförmige Kurve zu zeichnen, geben Sie als Differentialgleichung <userinput>y'' = &minus; y</userinput> oder <userinput>f''(x) = −f</userinput> ein.

source: However, a differential equation on its own isn't enough to determine a plot. Each curve in the diagram is generated by a combination of the differential equation and the initial conditions. You can edit the initial conditions by clicking on the <guilabel>Initial Conditions</guilabel> tab when a differential equation is selected. The number of columns provided for editing the initial conditions is dependent on the order of the differential equation.
de: Jedoch nur die Differentialgleichung allein ist noch nicht ausreichend für die Erstellung der Zeichnung. Jede Kurve im Diagramm wird durch die Differentialgleichung und die Startbedingung festgelegt. Wenn eine Differentialgleichung ausgewählt ist, können Sie die Startbedingung auf der gleichnamigen Karteikarte eingeben. Die Anzahl der Spalten für die Eingabe der Startbedingungen wird durch die Ordnung der Differentialgleichung bestimmt.

source: Step
de: Schritt

source: The step value in the precision box is used in numerically solving the differential equation (using the Runge Kutta method). Its value is the maximum step size used; a smaller step size may be used if part of the differential plot is zoomed in close enough.
de: Die Schrittweite im Feld Genauigkeit wird zur numerischen Lösung der Differentialgleichung mit der Runge-Kutta-Methode benutzt. Der Wert bestimmt die maximale Schrittweite, bei Vergrößerung der Zeichnung wird mit einer kleineren Schrittweite gerechnet.

source: Combining Functions
de: Funktionskombinationen

source: Functions can be combined to produce new ones. Simply enter the functions after the equals sign in an expression as if the functions were variables. For example, if you have defined functions f(x) and g(x), you can plot the sum of f and g with:
de: Funktionen können zu neuen Funktionen kombiniert werden. Geben Sie einfach die Funktionen nach dem Gleichheitszeichen ein, als ob sie Variable wären. Wenn Sie zum Beispiel die Funktionen f(x) und g(x) definiert haben, können Sie die Summe von f und g zeichnen lassen mit:

source: Changing the appearance of functions
de: Das Aussehen von Funktionen verändern

source: To change the appearance of a function's graph on the main plot window, select the function in the <guilabel>Functions</guilabel> sidebar. You can change the plot's line width, color and many other aspects by clicking on the <guibutton>Color</guibutton> or <guibutton>Advanced...</guibutton> button at the bottom of the section <guilabel>Appearance</guilabel>.
de: Um das Aussehen des Graphen der Funktion im Hauptfenster zu ändern, wählen Sie die Funktion im Bereich <guilabel>Funktionen</guilabel> aus. Klicken auf den Knopf <guibutton>Farbe</guibutton> oder unten in Abschnitt <guilabel>Erscheinungsbild</guilabel> auf <guibutton>Erweitert ...</guibutton>, um die Linienbreite, die Farbe der Linie und weitere Einstellungen zu verändern.

source: If you are editing a Cartesian function, the function editor will have three tabs. In the first one you specify the equation of the function. The <guilabel>Derivatives</guilabel> tab lets you draw the first and second derivative to the function. With the <guilabel>Integral</guilabel> tab you can draw the integral of the function.
de: Wenn Sie eine kartesische Funktion bearbeiten, werden drei Karteikarten angezeigt. Auf der ersten Karte geben Sie den Ausdruck der Funktion ein. Auf der Karte <guilabel>Ableitungen</guilabel> können Sie ankreuzen, ob die erste und zweite Ableitung der Funktion gezeichnet werden soll. Und auf der Karte <guilabel>Integral</guilabel> können Sie auswählen, ob das Integral der Funktion auch gezeichnet werden soll.

source: Popup menu
de: Kontextmenü

source: <screeninfo>Graph right-click popup menu</screeninfo>
de: <screeninfo>Kontextmenü des Graphen</screeninfo>

source: <phrase>Graph right-click popup menu</phrase>
de: <phrase>Kontextmenü des Graphen</phrase>

source: When right-clicking on a plot function or a single-point parametric plot function a popup menu will appear. In the menu there are three items available:
de: Mit einem rechten Mausklick auf eine Zeichnungsfunktion oder eine parametrische Einzelpunkt-Funktion öffnen Sie ein Kontextmenü mit folgenden Einträgen:

source: Edit
de: Bearbeiten

source: Selects the function in the <guilabel>Functions</guilabel> sidebar for editing.
de: Wählt die Funktion zur Bearbeitung im Bereich <guilabel>Funktionen</guilabel> aus.

source: Hide
de: Ausblenden

source: Hides the selected graph. Other plots of the graph's function will still be shown.
de: Blendet den gewählten Graphen aus. Andere Graphen der Funktion werden weiter angezeigt.

source: Remove
de: Entfernen

source: Removes the function. All its graphs will disappear.
de: Entfernt die Funktion und alle ihre Graphen in der Zeichnung.

source: Animate Plot...
de: Zeichnung animieren ...

source: Displays the <guilabel>Parameter Animator</guilabel> dialog.
de: Öffnet den Dialog <guilabel>Parameteranimation</guilabel>.

source: Calculator
de: Rechner

source: Opens the <guilabel>Calculator</guilabel> dialog.
de: Öffnet den Dialog <guilabel>Rechner</guilabel>.

source: Depending on the plot type, there will also be up to four tools available:
de: Für die unterschiedlichen Funktionstypen gibt es noch vier weitere Einträge:

source: Plot Area...
de: Fläche zeichnen ...

source: Select the minimum and maximum horizontal values for the graph in the new dialog that appears. Calculates the integral and draws the area between the graph and the horizontal axis in the selected range in the color of the graph.
de: Wählen Sie die minimalen und maximalen waagerechten Werte für den Graphen. Dann wird das Integral berechnet und die Fläche zwischen dem Graphen und der waagerechten Achse im gewählten Intervall wird in der Farbe des Graphen gezeichnet.

source: Find Minimum...
de: Minimumpunkt suchen ...

source: Find the minimum value of the graph in a specified range. The selected graph will be highlighted in the dialog that appears. Enter the lower and upper boundaries of the region in which you want to search for a minimum.
de: Sucht den minimalen Wert des Graphen im angegebenen Bereich. Der gewählte Graph wird im angezeigten Dialog hervorgehoben. Geben Sie den unteren und oberen Grenzwert für den Bereich der Suche nach dem Minimum ein.

source: Note: You can also tell the plot to visually show the extreme points in the <guilabel>Plot Appearance</guilabel> dialog, accessible in the <guilabel>Functions</guilabel> sidebar by clicking on <guibutton>Advanced...</guibutton>.
de: Hinweis: Im Dialog <guilabel>Erscheinungsbild der Zeichnung</guilabel> können Sie einstellen, dass die Extremwerte eines Graphen markiert werden. Diesen Dialog öffnen Sie mit dem Knopf <guibutton>Erweitert ..</guibutton> in der Seitenleiste <guilabel>Funktionen</guilabel>.

source: Find Maximum...
de: Maximumpunkt suchen ...

source: This is the same as <guimenuitem>Find Minimum...</guimenuitem> above, but finds the maximum value instead of the minimum value.
de: Wie <guimenuitem>Minimumpunkt suchen ...</guimenuitem> weiter oben, aber es wird das Maximum, nicht das Minimum gesucht.
