Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdeedu/kmplot_commands.po
Languages: de

source: Command Reference
de: Befehlsreferenz

source: Menu Items
de: Menüeinträge

source: Apart from the common &kde; menus described in the <ulink url="help:/fundamentals/ui.html#menus">Menu</ulink> chapter of the &kde; Fundamentals documentation &kmplot; has these application specific menu entries:
de: Außer den bekannten &kde;-Menüeinträgen, die im Kapitel <ulink url="help:/fundamentals/ui.html#menus">Menüs</ulink> der &kde;-Grundlagen beschrieben werden, gibt es folgende spezielle Menüeinträge für &kmplot;:

source: The File Menu
de: Das Menü Datei

source: <guimenu>File</guimenu> <guimenuitem>Export...</guimenuitem>
de: <guimenu>Datei</guimenu> <guimenuitem>Exportieren ...</guimenuitem>

source: <action>Exports</action> the plotted graphs to an image file in all formats supported by &kde;.
de: <action>Exportiert</action> den gezeichneten Graphen in eine Bilddatei in allen von &kde; unterstützten Grafikformaten.

source: The Edit Menu
de: Das Menu Bearbeiten

source: <guimenu>Edit</guimenu><guimenuitem>Constants...</guimenuitem>
de: <guimenu>Bearbeiten</guimenu> <guimenuitem>Konstanten ...</guimenuitem>

source: Displays the <guilabel>Constants</guilabel> dialog box. See <xref linkend="constants-config"/>.
de: Öffnet den Dialog <guilabel>Konstanten</guilabel>. Siehe <xref linkend="constants-config"/>.

source: The View Menu
de: Das Menü Ansicht

source: The first three items in the menu are related to zooming.
de: Die ersten drei Einträge in diesem Menü ändern den Zoom-Modus.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>1</keycap></keycombo> </shortcut> <guimenu>View</guimenu> <guimenuitem>Zoom In</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>1</keycap></keycombo> </shortcut> <guimenu>Ansicht</guimenu> <guimenuitem>Vergrößern</guimenuitem>

source: This tool can be operator in two different manners. To zoom in on a point on the graph, click on it. To zoom in on a specific section of the graph, hold and drag the mouse to form a rectangle, which will be the new axes ranges when the mouse button is released.
de: Mit diesem Menüeintrag können Sie die Zeichnung auf zwei Arten vergrößern. Klicken Sie auf einen Punkt in der Zeichnung, um sie mit diesem Punkt als Mittelpunkt zu der vergrößern. Um einen bestimmten Bereich der Zeichnung zu vergrößern, ziehen Sie mit gedrückter Maustaste ein Rechteck für den neuen Bereich der Achsenwerte und lassen Sie dann die Maustaste los.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>2</keycap></keycombo> </shortcut> <guimenu>View</guimenu> <guimenuitem>Zoom Out</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>2</keycap></keycombo> </shortcut> <guimenu>Ansicht</guimenu> <guimenuitem>Verkleinern</guimenuitem>

source: The tool can also be used in two different manners. To zoom out and center on a point, click on that point. To fit the existing view into a rectangle, hold and drag the mouse to form that rectangle.
de: Mit diesem Menüeintrag können Sie die Zeichnung auf zwei Arten verkleinern. Klicken Sie auf einen Punkt in der Zeichnung, um sie mit diesem Punkt als Mittelpunkt zu der verkleinern. Um einen bestimmten Bereich der Zeichnung zu verkleinern, ziehen Sie mit gedrückter Maustaste ein Rechteck für den neuen Bereich der Achsenwerte und lassen Sie dann die Maustaste los.

source: <guimenu>View</guimenu> <guimenuitem>Fit Widget to Trigonometric Functions</guimenuitem>
de: <guimenu>Ansicht</guimenu> <guimenuitem>Fläche an trigonometrische Funktionen anpassen</guimenuitem>

source: The scale will be adapted to trigonometric functions. This works both for radians and degrees.
de: Die Vergrößerung wird an trigonometrische Funktionen angepasst. Dies funktioniert für Bogenmaß und Grad.

source: <guimenu>View</guimenu><guimenuitem>Reset View</guimenuitem>
de: <guimenu>Ansicht</guimenu><guimenuitem>Ansicht zurücksetzen</guimenuitem>

source: Resets the view.
de: Setzt die Ansicht auf die ursprüngliche Vergrößerung zurück.

source: <guimenu>View</guimenu><guimenuitem>Coordinate System...</guimenuitem>
de: <guimenu>Ansicht</guimenu> <guimenuitem>Koordinatensystem ...</guimenuitem>

source: Displays the <guilabel>Coordinate System</guilabel> dialog box. See <xref linkend="coords-config"/>.
de: Öffnet den Dialog <guilabel>Koordinatensystem</guilabel>. Siehe <xref linkend="coords-config"/>.

source: <guimenu>View</guimenu> <guimenuitem>Show Sliders</guimenuitem>
de: <guimenu>Ansicht</guimenu> <guimenuitem>Schieberegler anzeigen</guimenuitem>

source: <action>Toggles</action> the visibility of the slider dialog. In the dialog move a slider to change the parameter of the function plot connected to it.
de: <action>Blendet</action> den Dialog Schieberegler ein oder aus. Verschieben Sie in diesem Dialog einen Regler, um den Parameter der damit verbundenen Funktion zu ändern.

source: Enable this on the Function tab and select one of the sliders to change the parameter value dynamically. The values vary from 0 (left) to 10 (right) by default, but can be changed in the slider dialog.
de: Aktivieren Sie den Schieberegler auf der Karteikarte Funktion und wählen Sie einen Regler für die dynamische Änderung eines Parameterwertes. In der Voreinstellung geht der Wertebereich von 0 (links) bis 10 (rechts), das kann jedoch im Dialog Schieberegler geändert werden.

source: For a small tutorial see <ulink url="http://userbase.kde.org/KmPlot/Using_Sliders">Using Sliders</ulink>.
de: Eine kurze Anleitung finden Sie auf der &kde;-Userbase im Artikel <ulink url="http://userbase.kde.org/KmPlot/Using_Sliders">Schieberegler verwenden</ulink>.

source: The Tools Menu
de: Das Menü Extras

source: This menu contains some tools for the functions that can be useful:
de: Diese Menü enthält einige nützliche Hilfsmittel für die Funktionen:

source: <guimenu>Tools</guimenu> <guimenuitem>Calculator</guimenuitem>
de: <guimenu>Extras</guimenu> <guimenuitem>Rechner</guimenuitem>

source: Opens the <guilabel>Calculator</guilabel> dialog.
de: Öffnet den Dialog <guilabel>Rechner</guilabel>.

source: <guimenu>Tools</guimenu> <guimenuitem>Plot Area...</guimenuitem>
de: <guimenu>Extras</guimenu> <guimenuitem>Fläche zeichnen ...</guimenuitem>

source: Select a graph and the values of the horizontal axis in the new dialog that appears. Calculates the integral and draws the area between the graph and the horizontal axis in the range of the selected values in the color of the graph.
de: Wählen Sie im Dialog einen Graphen und die waagerechten Werte für den Graphen. Dann wird das Integral berechnet und die Fläche zwischen dem Graphen und der waagerechten Achse im gewählten Intervall wird in der Farbe des Graphen gezeichnet.

source: <guimenu>Tools</guimenu> <guimenuitem>Find Minimum...</guimenuitem>
de: <guimenu>Extras</guimenu> <guimenuitem>Minimumpunkt suchen...</guimenuitem>

source: Find the minimum value of the graph in a specified range.
de: Sucht den minimalen Wert des Graphen im vorgegebenen Bereich.

source: <guimenu>Tools</guimenu> <guimenuitem>Find Maximum...</guimenuitem>
de: <guimenu>Extras</guimenu> <guimenuitem>Maximumpunkt suchen ...</guimenuitem>

source: Find the maximum value of the graph in a specified range.
de: Sucht den maximalen Wert des Graphen im vorgegebenen Bereich.

source: The Help Menu
de: Das Menü Hilfe

source: &kmplot; has a standard &kde; <guimenu>Help</guimenu> with one addition:
de: &kmplot; hat die normale &kde;-<guimenu>Hilfe</guimenu> mit einem zusätzlichen Eintrag:

source: <guimenu>Help</guimenu> <guimenuitem>Predefined Math Functions...</guimenuitem>
de: <guimenu>Hilfe</guimenu> <guimenuitem>Vordefinierte mathematische Funktionen</guimenuitem>

source: Opens this handbook with a list of the predefined function names and constants that &kmplot; knows.
de: Öffnet dieses Handbuch mit einer Liste vordefinierter Funktionsnamen und Konstanten, die &kmplot; kennt.
