Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdeedu/kmplot_man-kmplot.1.po
Languages: de

source: &kde; User's Manual
de: &kde;-Benutzerhandbuch

source: mathematical function plotter
de: Plotter für mathematische Funktionen

source: <command>kmplot</command> <group choice="opt"><option>-f, --function <replaceable>argument</replaceable></option></group> <group choice="opt"><option><replaceable>file</replaceable></option></group> <arg choice="opt">&kde; Generic Options</arg> <arg choice="opt">&Qt; Generic Options</arg>
de: <command>kmplot</command> <group choice="opt"><option>-f, --function <replaceable>argument</replaceable></option></group> <group choice="opt"><option><replaceable>Datei</replaceable></option></group> <arg choice="opt">&kde;-Optionen</arg> <arg choice="opt">&Qt;-Optionen</arg>

source: Description
de: Beschreibung

source: &kmplot; is a mathematical function plotter for &kde;. It has a powerful built-in parser. You can plot different functions simultaneously and combine them to build new functions.
de: &kmplot; ist ein mathematischer Funktionsplotter für &kde;. Er enthält einen leistungsfähigen Funktionsanalysierer. Sie können verschiedene Funktionen gleichzeitig zeichnen lassen und Funktionsausdrücke kombinieren, um neue Funktionen zu erstellen.

source: &kmplot; supports parametric functions and functions in polar coordinates. Several grid modes are supported. Plots may be printed with high precision in the correct scale.
de: &kmplot; unterstützt Funktionen mit Parametern und Funktionen in polaren Koordinaten. Verschiedene Arten von Gittern sind möglich. Ausgaben können mit großer Genauigkeit ausgedruckt werden.

source: &kmplot; also provides some numerical and visual features, like filling and calculating the area between the plot and the first axis, finding maximum and minimum values, changing function parameters dynamically and plotting derivatives and integral functions.
de: &kmplot; bietet auch numerische und visuelle Eigenschaften wie Füllung und Berechnung der Fläche zwischen dem Graphen und der ersten Achse, Berechnung von maximalen und minimalen Werten, dynamische Änderung von Funktionsparametern und Zeichnung von Ableitungen und Integralfunktionen.

source: &kmplot; is part of the &kde; edutainment module.
de: &kmplot; ist im Modul &kde;-Edutainment enthalten.

source: Options
de: Optionen

source: Initial function to plot
de: Anfänglich zu zeichnende Funktion

source: file
de: Datei

source: File to open
de: Zu öffnende Datei

source: See Also
de: Siehe auch

source: More detailed user documentation is available from <ulink url="help:/kmplot">help:/kmplot</ulink> (either enter this <acronym>URL</acronym> into &konqueror;, or run <userinput><command>khelpcenter</command> <parameter>help:/kmplot</parameter></userinput>).
de: Weitere ausführliche Dokumentation finden Sie unter <ulink url="help:/kmplot">help:/kmplot</ulink> (geben Sie diese <acronym>URL</acronym> entweder im &konqueror; ein oder starten Sie <userinput><command>khelpcenter</command> <parameter>help:/kmplot</parameter></userinput>).

source: There is also further information available at <ulink url="http://edu.kde.org/kmplot/">the &kde; edutainment website</ulink>.
de: Weitere Informationen finden Sie auf der <ulink url="http://edu.kde.org/kmplot/"> &kde; Edutainment Webseite</ulink>.

source: Authors
de: Autoren

source: &kmplot; was written by <personname><firstname>Klaus-Dieter</firstname><surname>M&ouml;ller</surname></personname> <email>kdmoeller@foni.net</email>, &Matthias.Messmer; &Matthias.Messmer.mail; and <personname><firstname>Fredrik</firstname><surname>Edemar</surname></personname> <email>f_edemar@linux.se</email>
de: &kmplot; wurde von <personname><firstname>Klaus-Dieter</firstname><surname>M&ouml;ller</surname></personname> <email>kdmoeller@foni.net</email>, &Matthias.Messmer; &Matthias.Messmer.mail; und <personname><firstname>Fredrik</firstname><surname>Edemar</surname></personname> <email>f_edemar@linux.se</email> geschrieben
