Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdeedu/kmplot_credits.po
Languages: de

source: Credits and License
de: Danksagungen und Lizenz

source: Program copyright 2000-2002 Klaus-Dieter M&ouml;ller &Klaus-Dieter.Moeller.mail;
de: Programm Copyright 2002-2004: Klaus-Dieter M&ouml;ller &Klaus-Dieter.Moeller.mail;

source: Contributors
de: Mitwirkende

source: Porting &GUI; to &kde; 3 and Translating: &Matthias.Messmer; &Matthias.Messmer.mail;
de: &GUI; nach &kde; 3 portiert und Übersetzung: &Matthias.Messmer; &Matthias.Messmer.mail;

source: Various improvements: Fredrik Edemar <email>f_edemar@linux.se</email>
de: Verschiedene Verbesserungen: Fredrik Edemar <email>f_edemar@linux.se</email>

source: Porting to Qt 4, UI improvements, features: David Saxton <email>david@bluehaze.org</email>
de: Anpassung an Qt 4, Verbesserungen der Oberfläche und der Funktionen: David Saxton <email>david@bluehaze.org</email>

source: Documentation copyright 2000--2002 by Klaus-Dieter M&ouml;ller &Klaus-Dieter.Moeller.mail;.
de: Dokumentation Copyright 2000-2002: Klaus-Dieter M&ouml;ller &Klaus-Dieter.Moeller.mail;.

source: Documentation extended and updated for &kde; 3.2 by &Philip.Rodrigues; &Philip.Rodrigues.mail;.
de: Dokumentation erweitert und für &kde; 3.2 angepasst von &Philip.Rodrigues; &Philip.Rodrigues.mail;.

source: Documentation extended and updated for &kde; 3.3 by &Philip.Rodrigues; &Philip.Rodrigues.mail; and Fredrik Edemar <email>f_edemar@linux.se</email>.
de: Dokumentation erweitert und für &kde; 3.3 angepasst von &Philip.Rodrigues; &Philip.Rodrigues.mail; und Fredrik Edemar <email>f_edemar@linux.se</email>.

source: Documentation extended and updated for &kde; 3.4 by Fredrik Edemar <email>f_edemar@linux.se</email>.
de: Dokumentation erweitert und für &kde; 3.4 angepasst von Fredrik Edemar <email>f_edemar@linux.se</email>.

source: Documentation extended and updated for &kde; 4.0 by David Saxton <email>david@bluehaze.org</email>.
de: Dokumentation erweitert und für &kde; 4.0 angepasst von David Saxton <email>david@bluehaze.org</email>.

source: CREDIT_FOR_TRANSLATORS
de: <para>Übersetzung: Thorsten Mürell <email>thorsten@muerell.de</email></para>
