Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdeedu/kmplot_configuration.po
Languages: de

source: Configuring &kmplot;
de: &kmplot; einrichten

source: To access the &kmplot; configuration dialog, select <menuchoice><guimenu>Settings</guimenu><guimenuitem>Configure &kmplot;...</guimenuitem></menuchoice> The settings for <guimenuitem>Constants...</guimenuitem> can only be changed from the <guimenu>Edit</guimenu> menu and the <guimenuitem>Coordinate System...</guimenuitem> only from the <guimenu>View</guimenu> menu.
de: Um den Dialog zur Einrichtung von &kmplot; zu öffnen, wählen Sie <menuchoice><guimenu>Einstellungen</guimenu> <guimenuitem>&kmplot; einrichten ...</guimenuitem></menuchoice>. Die Einstellungen für die (<guimenuitem>Konstanten ...</guimenuitem> können Sie nur im Menü <guimenu>Bearbeiten</guimenu> ändern und das <guimenuitem>Koordinatensystem...</guimenuitem> nur im Menü <guimenu>Ansicht</guimenu>.

source: General Configuration
de: Allgemeine Einstellungen

source: <screeninfo>Screenshot of the General Settings dialog</screeninfo>
de: <screeninfo>Bildschirmfoto des Einrichtungsdialogs</screeninfo>

source: <phrase>Screenshot of the General Settings dialog</phrase>
de: <phrase>Bildschirmfoto des Einrichtungsdialogs</phrase>

source: Here you can set global settings which automatic will be saved when you exit &kmplot;. you can set angle-mode (radians and degrees), zoom in and zoom out factors, and whether to show advanced plot tracing.
de: Hier können Sie die allgemeinen Einstellungen ändern, die beim Beenden von &kmplot; gespeichert werden. Dazu gehören die Winkeleinheiten (Bogenmaß oder Grad), die Faktoren für Vergrößerung und Verkleinerung und das Zeichnen von Tangente und Normale beim Verfolgen.

source: Diagram Configuration
de: Diagrammeinstellungen

source: <screeninfo>Screenshot of the Diagram Appearance dialog</screeninfo>
de: <screeninfo>Bildschirmfoto des Dialogs Diagrammaussehen</screeninfo>

source: <phrase>Screenshot of the Diagram Appearance dialog</phrase>
de: <phrase>Bildschirmfoto des Dialogs Diagrammaussehen</phrase>

source: You can set the <guilabel>Grid Style</guilabel> to one of four options:
de: Sie können den <guilabel>Stil</guilabel> für das Gitter auf einen der vier möglichen Werten setzen:

source: None
de: Nichts

source: No gridlines are drawn on the plot area
de: Es werden keine Gitterlinien auf der Zeichenfläche dargestellt

source: Lines
de: Linien

source: Straight lines form a grid of squares on the plot area.
de: Gerade Linien bilden ein quadratisches Gitter auf der Zeichenfläche.

source: Crosses
de: Kreuzgitter

source: Crosses are drawn to indicate points where x and y have integer values (&eg;, (1,1), (4,2) &etc;).
de: Kreuze werden gezeichnet, um Punkte anzudeuten, an denen x und y ganzzahlige Werte haben. (&eg; (1,1), (4,2) &etc;).

source: Lines of constant radius and of constant angle are drawn on the plot area.
de: Linien mit konstantem Radius und Winkel werden auf der Zeichenfläche gezeichnet.

source: Other options for the diagram appearance can also be configured:
de: Weitere Einstellungen für das Aussehen des Diagramms:

source: Axis Labels
de: Achsenbeschriftung

source: Sets labels for the horizontal and vertical axes.
de: Legt die Beschriftungen der waagerechten und senkrechten Achsen fest.

source: Axis width:
de: Achsenbreite:

source: Sets the width of the lines representing the axes.
de: Stellt die Breite der Achsenlinien ein.

source: Line width:
de: Linienbreite:

source: Sets the width of the lines used for drawing the grid.
de: Stellt die Breite der Gitterlinien ein.

source: Tic width:
de: Skalenstrichbreite:

source: Sets the width of the lines representing tics on the axes.
de: Stellt die Breite der Linien ein, die die Skalenstriche auf den Achsen darstellen.

source: Tic length:
de: Skalenstrichlänge:

source: Sets the length of the lines representing tics on the axes.
de: Stellt die Länge der Linien ein, die die Skalenstriche auf den Achsen darstellen.

source: Show labels
de: Beschriftungen anzeigen

source: If checked, the names of the axes are shown on the plot and the axes' tics are labeled.
de: Falls dieses Feld gewählt ist, werden die Beschriftung der waagerechten und senkrechten Achsen in der Zeichnung angezeigt und die Skalenstriche werden beschriftet.

source: Show axes
de: Achsen anzeigen

source: If checked, the axes are visible.
de: Falls dieses Feld gewählt ist, werden die Achsen angezeigt.

source: Show arrows
de: Pfeile anzeigen

source: If checked, the axes are displayed with arrows at their ends.
de: Falls dieses Feld gewählt ist, werden die Achsen mit Pfeilen an den Enden gezeichnet.

source: Colors Configuration
de: Farbeneinstellung

source: <screeninfo>Screenshot of the Colors dialog</screeninfo>
de: <screeninfo>Bildschirmfoto des Einrichtungsdialogs für Farben</screeninfo>

source: <phrase>Screenshot of the Colors dialog</phrase>
de: <phrase>Bildschirmfoto des Einrichtungsdialogs für Farben</phrase>

source: In the <guilabel>Coords</guilabel> section of the <guilabel>Colors</guilabel> configuration dialog, you can change the colors of the axes, the grid and the background of the main &kmplot; area.
de: Auf der Karte <guilabel>Farben</guilabel> des Einrichtungsdialogs können Sie im Abschnitt <guilabel>Koordinaten</guilabel> die Farben der Achsen, des Gitters und der Zeichenfläche von &kmplot; verändern.

source: The <guilabel>Default Function Colors</guilabel> control which colors are cycled through when creating new functions.
de: Im Abschnitt <guilabel>Normale Funktionsfarben</guilabel> können Sie die Farben für neue Funktionen anpassen.

source: Fonts Configuration
de: Schrifteneinstellungen

source: <screeninfo>Screenshot of the Fonts dialog</screeninfo>
de: <screeninfo>Bildschirmfoto des Einrichtungsdialogs für die Schriften</screeninfo>

source: <phrase>Screenshot of the Fonts dialog</phrase>
de: <phrase>Bildschirmfoto des Einrichtungsdialogs für die Schriften</phrase>

source: Axis labels
de: Achsenbeschriftung

source: The font used for drawing the axis numbers and x/y labels.
de: Die Schrift für die Ziffern und Bezeichnungen der Achsen.

source: Diagram label
de: Diagrammbeschriftungen

source: The font used for drawing diagram labels (&eg;, those showing the plot name or extreme points).
de: Die Schrift für die Beschriftung des Diagramms (&eg; für den Namen der Zeichnung und der Extrempunkte).

source: Header table
de: Kopfzeile der Tabelle

source: The font used for drawing the header when printing a plot.
de: Die Schrift für die Kopfzeile beim Ausdruck einer Zeichnung.
