Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdeedu/kstars_skycoords.po
Languages: de

source: <title>Celestial Coordinate Systems</title>
de: <title>Himmelskoordinatensysteme</title>

source: <primary>Celestial Coordinate Systems</primary>
de: <primary>Himmelskoordinatensysteme</primary>

source: Overview
de: Überblick

source: A basic requirement for studying the heavens is determining where in the sky things are. To specify sky positions, astronomers have developed several <firstterm>coordinate systems</firstterm>. Each uses a coordinate grid projected on the <link linkend="ai-csphere">Celestial Sphere</link>, in analogy to the <link linkend="ai-geocoords">Geographic coordinate system</link> used on the surface of the Earth. The coordinate systems differ only in their choice of the <firstterm>fundamental plane</firstterm>, which divides the sky into two equal hemispheres along a <link linkend="ai-greatcircle">great circle</link>. (the fundamental plane of the geographic system is the Earth's equator). Each coordinate system is named for its choice of fundamental plane.
de: Eine Grundvoraussetzung für das Studium des Himmels ist, festzulegen, wo die Dinge im Himmel sich befinden. Um Himmelspositionen festzulegen, haben Astronomen verschiedene <firstterm>Koordinatensysteme</firstterm> entwickelt. Jedes benutzt ein Koordinatengitter, das auf die <link linkend="ai-csphere">Himmelssphäre</link> projiziert ist, in Anlehnung an das <link linkend="ai-geocoords">geografische Koordinatensystem</link>, das auf der Erdoberfläche benutzt wird. Die Koordinatensysteme unterscheiden sich nur in der Wahl ihrer <firstterm>Bezugsfläche</firstterm>, die den Himmel in zwei gleiche Halbkugeln entlang eines <link linkend="ai-greatcircle">Großkreises</link> unterteilt. (Die Bezugsfläche des geografischen Koordinatensystems der Erde ist der Äquator). Jedes Koordinatensystem ist nach der ausgewählten Bezugsfläche benannt.

source: The Equatorial Coordinate System
de: Das äquatoriale Koordinatensystem

source: <secondary>Equatorial Coordinates</secondary>
de: <secondary>Äquatoriale Koordinaten</secondary>

source: <seealso>Celestial Equator</seealso> <seealso>Celestial Poles</seealso> <seealso>Geographic Coordinate System</seealso>
de: <seealso>Himmelsäquator</seealso> <seealso>Himmelspole</seealso> <seealso>Geografisches Koordinatensystem</seealso>

source: Right Ascension
de: Rektaszension

source: <see>Equatorial Coordinates</see>
de: <see>Äquatoriale Koordinaten</see>

source: Declination
de: Deklination

source: The <firstterm>Equatorial coordinate system</firstterm> is probably the most widely used celestial coordinate system. It is also the most closely related to the <link linkend="ai-geocoords">Geographic coordinate system</link>, because they use the same fundamental plane, and the same poles. The projection of the Earth's equator onto the celestial sphere is called the <link linkend="ai-cequator">Celestial Equator</link>. Similarly, projecting the geographic Poles onto the celestial sphere defines the North and South <link linkend="ai-cpoles">Celestial Poles</link>.
de: Das <firstterm>äquatoriale Koordinatensystem</firstterm> ist vielleicht das am weitesten benutzte Himmelskoordinatensystem. Es ist auch am meisten mit dem <link linkend="ai-geocoords">geografischen Koordinatensystem</link> verwandt, da sie beide dieselbe Bezugsfläche und dieselben Pole benutzen. Die Projektion des Erdäquators auf die Himmelssphäre wird <link linkend="ai-cequator">Himmelsäquator</link> genannt. Genauso werden die Projektionen der Pole auf die Himmelssphäre <link linkend="ai-cpoles">Himmelspole</link> genannt.

source: However, there is an important difference between the equatorial and geographic coordinate systems: the geographic system is fixed to the Earth; it rotates as the Earth does. The Equatorial system is fixed to the stars<footnote id="fn-precess"><para>actually, the equatorial coordinates are not quite fixed to the stars. See <link linkend="ai-precession">precession</link>. Also, if <link linkend="ai-hourangle">Hour Angle</link> is used in place of Right Ascension, then the Equatorial system is fixed to the Earth, not to the stars.</para></footnote>, so it appears to rotate across the sky with the stars, but of course it is really the Earth rotating under the fixed sky.
de: Jedoch gibt es einen wichtigen Unterschied zwischen dem äquatorialen und geografischen Koordinatensystem: Das geografische System ist in Bezug auf die Erde fest, es rotiert mit der Erde. Das äquatoriale System ist in Bezug auf die Sterne fest<footnote id="fn-precess"><para>Tatsächlich sind die äquatorialen Koordinaten nicht richtig in Bezug auf die Sterne fixiert. Siehe auch <link linkend="ai-precession">Kreiselbewegung</link>. Wenn der <link linkend="ai-hourangle">Stundenwinkel</link> anstatt der Rektaszension benutzt wird, ist das äquatoriale System fest in Bezug auf die Erde und nicht auf die Sterne.</para></footnote>, also scheint es mit den Sternen am Himmel zu rotieren, jedoch dreht sich die Erde nur unter dem stillstehenden Himmel.

source: The <firstterm>latitudinal</firstterm> (latitude-like) angle of the Equatorial system is called <firstterm>Declination</firstterm> (Dec for short). It measures the angle of an object above or below the Celestial Equator. The <firstterm>longitudinal</firstterm> angle is called the <firstterm>Right Ascension</firstterm> (<acronym>RA</acronym> for short). It measures the angle of an object East of the <link linkend="ai-equinox">Vernal Equinox</link>. Unlike longitude, Right Ascension is usually measured in hours instead of degrees, because the apparent rotation of the Equatorial coordinate system is closely related to <link linkend="ai-sidereal">Sidereal Time</link> and <link linkend="ai-hourangle">Hour Angle</link>. Since a full rotation of the sky takes 24 hours to complete, there are (360 degrees / 24 hours) = 15 degrees in one Hour of Right Ascension.
de: Der <firstterm>Breitenwinkel</firstterm> des äquatorialen Systems wird <firstterm>Deklination</firstterm> genannt (kurz Dekl). Er misst den Winkel eines Objektes zum Himmelsäquator. Der <firstterm>Längenwinkel</firstterm> wird <firstterm>Rektaszension</firstterm> genannt (kurz <acronym>Rekt</acronym>). Er misst den Winkel eines Objektes östlich der <link linkend="ai-equinox">Herbst-Tagundnachtgleiche.</link> Im Gegensatz zur Länge wird die Rektaszension normalerweise in Stunden anstelle von Grad gemessen, da die scheinbare Rotation des äquatorialen Koordinatensystems sehr nah mit der <link linkend="ai-sidereal">Sternenzeit</link> und dem <link linkend="ai-hourangle">Stundenwinkel</link> verwandt ist. Da eine volle Umdrehung des Himmels 24 Stunden dauert, entspricht (360 Grad / 24 Stunden = ) 15 Grad einer Stunde der Rektaszension.

source: The equatorial coordinates for deep-sky objects and stars do not vary appreciably over short durations of time, since they are not affected by the <firstterm>diurnal motion</firstterm> (the daily apparent rotation of the sky around the earth. However, note that this takes <link linkend="ai-sidereal">1 sidereal day</link>, as against 1 solar day). They are suitable coordinates for making catalogs of stars and deep-sky objects (note that <firstterm>Galactic Coordinates</firstterm> also work well, but are cumbersome to use from an earth point-of-view). However, there are effects that cause the RA and Dec of objects to vary over time, namely <link linkend="ai-precession">Precession</link> and <firstterm>nutation</firstterm>, and <firstterm>proper motion</firstterm>, the latter being even less important. Equatorial coordinates are thus generally specified with an appropriate <link linkend="ai-epoch">epoch</link>, to account for precession. Popular epochs include J2000.0 (<link linkend="ai-julianday">Julian Year</link> 2000) and B1950.0 (<firstterm>Besselian Year</firstterm> 1950).
de: Die äquatorialen Koordinaten Deep-Sky-Objekten und Sternen ändern sich in kurzen Zeiträumen nur kaum merklich, da sie nicht von der <firstterm>täglichen Bewegung</firstterm> betroffen sind. Dies ist die scheinbare Drehung des Himmels um die Erde. Beachten Sie, dass diese Drehung einen <link linkend="ai-sidereal">Siderischen Tag</link>, im Gegensatz zu einem Sonnentag, dauert. Äquatoriale Koordinaten sind für die Aufstellung von Katalogen für Deep-Sky-Objekte und Sterne gut geeignet. Auch <firstterm>Galaktische Koordinaten</firstterm> sind brauchbar, können von einem Standpunkt auf der Erde nur umständlich verwendet werden. Es gibt jedoch Effekte, die im Lauf der Zeit zu einer Änderung der Rektaszension und Deklination von Objekten führen, wie zum Beispiel <link linkend="ai-precession">Präzession</link>, <firstterm>Nutation</firstterm> und <firstterm>Eigenbewegung</firstterm>. Die Eigenbewegung hat jedoch nur einen geringen Einfluß. Äquatoriale Koordinaten werden daher im allgemeinen zur mit einer passenden <link linkend="ai-epoch">Epoche</link> angegeben, um die Genauigkeit zu verbessern. Die Epochen J2000.0 (<link linkend="ai-julianday">Julianische Jahr</link> 2000) und B1950.0 (<firstterm>Bessel-Jahr</firstterm> 1950) werden häufig verwendet.

source: The Horizontal Coordinate System
de: Das horizontale Koordinatensystem

source: <secondary>Horizontal Coordinates</secondary>
de: <secondary>Horizontale Koordinaten</secondary>

source: <seealso>Horizon</seealso> <seealso>Zenith</seealso>
de: <seealso>Horizont</seealso> <seealso>Zenit</seealso>

source: Azimuth
de: Azimut

source: <see>Horizontal Coordinates</see>
de: <see>Horizontale Koordinaten</see>

source: Altitude
de: Höhe

source: The Horizontal coordinate system uses the observer's local <link linkend="ai-horizon">horizon</link> as the Fundamental Plane. This conveniently divides the sky into the upper hemisphere that you can see, and the lower hemisphere that you can't (because the Earth is in the way). The pole of the upper hemisphere is called the <link linkend="ai-zenith">Zenith</link>. The pole of the lower hemisphere is called the <firstterm>nadir</firstterm>. The angle of an object above or below the horizon is called the <firstterm>Altitude</firstterm> (Alt for short). The angle of an object around the horizon (measured from the North point, toward the East) is called the <firstterm>Azimuth</firstterm>. The Horizontal Coordinate System is sometimes also called the Alt/Az Coordinate System.
de: Das horizontale Koordinatensystem benutzt den lokalen <link linkend="ai-horizon">Horizont</link> des Beobachters als Bezugsfläche. Das teilt den Himmel bequemer weise in die obere Halbkugel, die man sehen kann, und in die untere Halbkugel, die man nicht sehen kann (weil die Erde im Weg ist). Der Pol der oberen Halbkugel wird <link linkend="ai-zenith">Zenit</link> genannt. Der Pol der unteren Halbkugel wird <firstterm>Fußpunkt</firstterm> genannt. Der Winkel eines Objektes über oder unter dem Horizont wird als <firstterm>Höhe</firstterm> bezeichnet. Der Winkel eines Objektes entlang des Horizonts (gemessen vom Nordpunkt in östlicher Richtung) wird <firstterm>Azimut</firstterm> genannt. Das horizontale Koordinatensystem wird manchmal auch <quote>Höhe/Azimut</quote>-Koordinatensystem genannt.

source: The Horizontal Coordinate System is fixed to the Earth, not the Stars. Therefore, the Altitude and Azimuth of an object changes with time, as the object appears to drift across the sky. In addition, because the Horizontal system is defined by your local horizon, the same object viewed from different locations on Earth at the same time will have different values of Altitude and Azimuth.
de: Das horizontale Koordinatensystem ist in Bezug auf die Erde fest, nicht in Bezug auf die Sterne. Deswegen ändern sich die Höhe und der Azimut eines Objektes mit der Zeit, da das Objekt sich zu bewegen scheint. Da das horizontale System zudem noch mittels unserem lokalen Horizont definiert ist, hat dasselbe Objekt von verschiedenen Orten auf der Erde gesehen verschiedene Werte für Höhe und Azimut.

source: Horizontal coordinates are very useful for determining the Rise and Set times of an object in the sky. When an object has Altitude=0 degrees, it is either Rising (if its Azimuth is &lt; 180 degrees) or Setting (if its Azimuth is &gt; 180 degrees).
de: Horizontale Koordinaten sind sehr nützlich, wenn man die Auf- und Untergangszeiten von Objekten im Himmel bestimmten möchte. Wenn ein Objekt eine Höhe von 0 Grad hat, geht es entweder auf (wenn seine Azimut &lt; 180 Grad ist) oder unter (wenn sein Azimut &gt; 180 Grad ist).

source: The Ecliptic Coordinate System
de: Das ekliptische Koordinatensystem

source: Ecliptic Coordinates
de: Ekliptische Koordinaten

source: Ecliptic
de: Ekliptik

source: The Ecliptic coordinate system uses the <link linkend="ai-ecliptic">Ecliptic</link> for its Fundamental Plane. The Ecliptic is the path that the Sun appears to follow across the sky over the course of a year. It is also the projection of the Earth's orbital plane onto the Celestial Sphere. The latitudinal angle is called the <firstterm>Ecliptic Latitude</firstterm>, and the longitudinal angle is called the <firstterm>Ecliptic Longitude</firstterm>. Like Right Ascension in the Equatorial system, the zeropoint of the Ecliptic Longitude is the <link linkend="ai-equinox">Vernal Equinox</link>.
de: Das ekliptische Koordinatensystem benutzt die <link linkend="ai-ecliptic">Ekliptik</link> als Bezugsfläche. Die Ekliptik ist die Strecke, die die Sonne im Laufe eines Jahres am Himmel zu benutzen scheint. Sie ist auch die Projektion der Kreisfläche der Erde auf die Himmelssphäre. Der Breitenwinkel wird <firstterm>ekliptische Breite</firstterm> genannt und der Längenwinkel heißt <firstterm>ekliptische Länge</firstterm>. Wie bei der Rektaszension im äquatorialen System ist der Nullpunkt der ekliptischen Länge die <link linkend="ai-equinox">Herbst-Tagundnachtgleiche</link>.

source: What do you think such a coordinate system would be useful for? If you guessed charting solar system objects, you are right! Each of the planets (except Pluto) orbits the Sun in roughly the same plane, so they always appear to be somewhere near the Ecliptic (&ie;, they always have small ecliptic latitudes).
de: Wofür ist Ihrer Meinung nach ein solches Koordinatensystem geeignet? Wenn Sie an die Kartografierung von Objekten im Sonnensystem denken, liegen Sie richtig! Alle Planeten (außer dem Pluto) umlaufen die Sonne ungefähr auf derselben Ebene, also erscheinen sie alle irgendwo in der Nähe der Ekliptik (d. h. sie haben immer kleine ekliptische Breiten).

source: The Galactic Coordinate System
de: Das galaktische Koordinatensystem

source: Galactic Coordinates
de: Galaktische Koordinaten

source: Milky Way
de: Milchstraße

source: The Galactic coordinate system uses the <firstterm>Milky Way</firstterm> as its Fundamental Plane. The latitudinal angle is called the <firstterm>Galactic Latitude</firstterm>, and the longitudinal angle is called the <firstterm>Galactic Longitude</firstterm>. This coordinate system is useful for studying the Galaxy itself. For example, you might want to know how the density of stars changes as a function of Galactic Latitude, to how much the disk of the Milky Way is flattened.
de: Das galaktische Koordinatensystem benutzt die <firstterm>Milchstraße</firstterm> als Bezugsfläche. Der Breitenwinkel wird <firstterm>galaktische Breite</firstterm> genannt, und der Längenwinkel heißt <firstterm>galaktische Länge</firstterm>. Das Koordinatensystem ist nützlich, wenn Sie die Galaxis selbst studieren wollen. Wenn Sie zum Beispiel wissen wollen, wie sich die Dichte von Sternen in Bezug auf die galaktische Breite als Funktion ändert oder wie sehr die Scheibe der Milchstraße abgeflacht ist.
