Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdeedu/kstars_cosmicdist.po
Languages: de

source: <title>Cosmic Distance Ladder</title>
de: <title>Kosmische Entfernungsleiter</title>

source: <primary>Cosmic Distance Ladder</primary>
de: <primary>Kosmische Entfernungsleiter</primary>

source: The cosmic distance ladder refers to the succession of different methods that astronomers use to measure distances to objects in the sky. Some methods, like <link linkend="ai-parallax">parallax</link>, work well for only nearby objects. Other methods, like using the <firstterm>cosmological redshift</firstterm>, work only for very distance galaxies. Thus, there are several methods, each with its own limited validity, and hence the name.
de: Die kosmische Entfernungsleiter beschreibt die Abfolge der verschiedenen Methoden, die Astronomen zur Messung von Entfernungen der Objekte im Himmel verwenden. Einige Methoden wie die <link linkend="ai-parallax">Parallaxe</link> funktionieren nur für nahe Objekte, andere Methoden wie die <firstterm>Kosmologische Rotverschiebung</firstterm> nur für weit entfernte Galaxien. So werden verschiedene Methoden angewendet, jede für einen bestimmten Gültigkeitsbereich. Daher entstand der Begriff der Himmelsleiter.

source: Direct measurements
de: Direkte Messungen

source: The bottom of the ladder consists of objects whose distances can be directly measured, like the moon (see <ulink url="https://en.wikipedia.org/wiki/Lunar_Laser_Ranging_experiment">Lunar Laser Ranging</ulink>). The same technique, using radio waves, is applied to find distances to planets as well.
de: Die erste Stufe auf dieser Leiter besteht aus Objekten, deren Entfernungen direkt gemessen werden können, wie zum Beispiel der Mond, siehe <ulink url="http://de.wikipedia.org/wiki/LLR">Lunar Laser Ranging</ulink>. Die gleiche Technik wird mit Radiowellen für die Entfernungsmessung von Planeten benutzt.

source: For nearby stars, measuring the <link linkend="ai-parallax">parallax</link> is possible and yields the distance to the star.
de: Für nahe Sterne kann die <link linkend="ai-parallax">Parallaxe</link> gemessen und zur Berechnung der Entfernung zum Stern verwendet werden.

source: Standard candles
de: Standardkerzen

source: "Standard candles" are objects whose intrinsic brightnesses we can know for sure. The apparent <link linkend="ai-magnitude">magnitude</link>, which is easy to measure, tells us how bright an object appears, not how bright it actually is. Distant objects appear less brighter, because their light gets spread out over a larger area.
de: „Standardkerzen“ sind Objekte, deren wahre Helligkeiten genau bekannt sind. Die leicht zu messende scheinbare <link linkend="ai-magnitude">Magnitude</link> gibt an, wie hell ein Objekt erscheint, nicht wie hell es tatsächlich leuchtet. Entfernte Objekte erscheinen weniger hell, da Ihr Licht über einen größeren Bereich verteilt wird.

source: In accordance with the <firstterm>inverse square law</firstterm> for light intensities, the amount of light we receive from an object drops with the distance squared. Thus, we may compute the distance to an object if we know both how bright it actually is (absolute magnitude; 'M') and how bright it appears to us on earth (apparent magnitude; 'm'). We may define the <firstterm>distance modulus</firstterm> as follows:
de: In Einklang mit dem <firstterm>Invers-Quadratischen-Gesetz</firstterm> der Lichtintensität nimmt die Menge des Lichts, das von einem Objekt ausgesendet wird, mit dem Quadrat der Entfernung ab. Daher kann die Entfernung eines Objekts berechnet werden, wenn sowohl die tatsächliche Helligkeit (absolute Magnitude „M“) wie auch die scheinbare Helligkeit (scheinbare Magnitude „m“) hier auf der Erde bekannt sind. Dann kann das <firstterm>Entfernungs-Modul</firstterm> wie folgt definiert werden:

source: Distance Modulus = M - m = 5 log<subscript>10</subscript> d - 5
de: Entfernungs-Modul = M - m = 5 log<subscript>10</subscript> d - 5

source: Here 'd' is the distance measured in <link linkend="ai-parallax">parsecs</link>.
de: Hier ist „d“ die Entfernung gemessen in <link linkend="ai-parallax">Parsec</link>.

source: For these special standard candle objects, we have some other way of knowing their intrinsic brightness, and thereby can calculate their distance.
de: Für diese besonderen „Standardkerzen“-Objekte gibt es andere Möglichkeiten, Ihre tatsächliche Helligkeit zu ermitteln und dadurch deren Entfernung zu berechnen.

source: Common "standard candles" used in astronomy are:
de: In der Astronomie werden häufig folgende „Standardkerzen“ verwendet:

source: Cepheid Variables: A kind of periodic variable star, whose variation period is related to the luminosity
de: Cepheiden: Eine Gruppe von periodischen veränderlichen Sternen, deren periodische Pulsation mit der Leuchtkraft zusammenhängt.

source: RR Lyrae Variables: Another such periodic variable star with a well-known period-luminosity relationship
de: RR-Lyrae-Sterne: Eine weitere Art pulsationsveränderlicher Sterne mit einer bekannten Beziehung zwischen Periode und Leuchtkraft.

source: Type-Ia supernovae: These supernovae have a very well-defined luminosity as a result of the physics that governs them and hence serve as standard-candles
de: Supernovae vom Typ Ia: Diese Supernovae haben eine gut definierte Leuchtkraft als Ergebnis der physikalischen Vorgänge in ihren Inneren und können daher als „Standardkerzen“ benutzt werden.

source: Other methods
de: Andere Methoden

source: There are many other methods. Some of them rely on the physics of stars, such as the relationship between luminosity and color for various types of stars (this is usually represented on a <firstterm>Hertzsprung-Russel Diagram</firstterm>). Some of them work for star clusters, such as the <firstterm>Moving cluster method</firstterm> and the <firstterm>main-sequence fitting method</firstterm>. The <firstterm>Tully-Fisher relation</firstterm> that relates the brightness of a spiral galaxy to its rotation can be used to find the distance modulus, since the rotation of a galaxy is easy to measure using <firstterm>Doppler shift</firstterm>. Distances to distant galaxies may be found by measuring the <firstterm>Cosmological redshift</firstterm>, which is the redshift of light from distance galaxies that results from the expansion of the universe.
de: Es gibt noch viele andere Methoden zur Berechnung der Entfernungen. Einige beruhen auf den physikalischen Vorgängen in Sternen, wie zum Beispiel der Beziehung zwischen Leuchtkraft und Farbe für verschiedene Arten von Sternen. Sie wird üblicherweise in einem <firstterm>Hertzsprung-Russel-Diagramm</firstterm> dargestellt. Für Sternhaufen gibt es Verfahren wie die <firstterm>Bewegungssternhaufenmethode (Sternstromparallaxe)</firstterm> und die <firstterm>Hauptsequenz-Methode mit dem Hertzsprung-Russell-Diagramm</firstterm>. Die <firstterm>Tully-Fisher-Beziehung</firstterm> beschreibt einen Zusammenhang der Rotationsgeschwindigkeit von Spiralgalaxien mit ihrer Leuchtkraft und kann zur Entfernungsberechnung benutzt werden, da die Rotation einer Galaxie mit der <firstterm>Doppler-Verschiebung</firstterm> leicht gemessen werden kann. Der Abstand zu weit entfernten Galaxien kann durch die Messung der <firstterm>kosmischen Rotverschiebung</firstterm> bestimmt werden. Dies ist die Rotverschiebung des Lichts von weit entfernten Galaxien, die auf Grund der Ausdehnung des Universums entsteht.

source: For further information, consult <ulink url="https://en.wikipedia.org/wiki/Cosmic_distance_ladder">Wikipedia on Cosmic Distance Ladder</ulink>
de: Weitere Informationen finden Sie in der englischen Wikipidia im Artikel <ulink url="https://en.wikipedia.org/wiki/Cosmic_distance_ladder">Cosmic Distance Ladder (Kosmische Entfernungsleiter)</ulink>.
