Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdeedu/kstars_obsplanner.po
Languages: de

source: Observation Planner
de: Beobachtungsliste

source: Planner
de: Planung

source: Since &kde; SC 4.4, Prakash Mohan&apos;s GSoC work has been released in &kstars;. &kstars; now has an awesome observation planner to plan your observation sessions. The execute session option allows you to log information about objects as you observe them. Alternately, you may also write a short log in the session planner itself. We wish you a lot of fun planning your observations with &kstars;!
de: Seit &kde; SC 4.4 ist Prakash Mohan&apos;s GSoC-Arbeit in &kstars; eingefügt. &kstars; enthält nun ein Planungsmodul für Ihre Beobachtungssitzungen. Mit der Aktion „Sitzungsplan ausführen“ können Sie Informationen über die Objekte während der Beobachtung notieren. Als Alternative kann auch ein kurzes Protokoll direkt im Sitzungsplaner eingegeben werden. Viel Spaß bei der Planung Ihrer Beobachtungen mit &kstars;.

source: You can even add some pictures to the objects. The image list is a Google image search list. To add image to an object all you need to do is press <guibutton>Find Image</guibutton> button on the right and then find an image that you like. If you do not have an Internet connection you can open an image from your hard drive. Note that images that will be used are going to be cropped to 600x600 pixels.
de: Sie können auch Bilder für Objekte hinzufügen. Die Bilder werden über Google gesucht. Um ein Bild für ein Objekt hinzuzufügen, klicken Sie rechts auf den Knopf <guibutton>Bild suchen</guibutton> und wählen dann die passenden Bilder aus. Sind Sie nicht mit dem Internet verbunden, können Sie ebenso Bilder von Ihrer Festplatte laden. Beachten Sie, dass alle verwendeten Bilder auf eine Größe von 600x600 Pixel verkleinert werden.

source: The first way of doing this is by pressing <keycombo action="simul">&Ctrl;<keycap>2</keycap></keycombo> or <keycombo action="simul">&Ctrl;<keycap>L</keycap></keycombo> to open the Observation List, then press the <guibutton>Add Object</guibutton> button.
de: Benutzen Sie die Kurzbefehle <keycombo action="simul">&Ctrl;<keycap>2</keycap></keycombo> oder <keycombo action="simul">&Ctrl;<keycap>L</keycap></keycombo>, um die Beobachtungsliste zu öffnen und drücken Sie dann den Knopf <guibutton>Objekt hinzufügen</guibutton>.

source: The <guibutton>Save all Images</guibutton> button does a search for the SDSS images and displays the DSS image if the requested RA/Dec is out of the SDSS footprint.
de: Mit dem Knopf <guibutton>Alle Bilder speichern</guibutton> wird die Suche nach SDSS-Bildern gestartet. Es wird ein DSS-Bild angezeigt, wenn der angeforderte Bereich von Rektaszension/Deklination nicht für SDSS-Bilder verfügbar ist.

source: This is an SDSS image of a galaxy
de: Dies ist ein SDSS-Bild einer Galaxie

source: This is an DSS image of the same galaxy
de: Dies ist ein DSS-Bild derselben Galaxie

source: The <guibutton>Delete all Images</guibutton> button does the opposite. It deletes all downloaded images.
de: Mit dem Knopf <guibutton>Alle Bilder löschen</guibutton> werden alle heruntergeladenen Bilder entfernt.

source: The image for the galaxy is now deleted
de: Das Bild der Galaxie ist nun gelöscht

source: You can add more objects by pressing the <guibutton>Add Object</guibutton> button. It has quite accurate method for sorting out items, depending on what options you have given to him. They are: Any, Stars, Solar System, Clusters (Globular and Open), Nebula (Gaseous and Planetary), Galaxies, Comets, Asteroids and Constellations + the name filter.
de: Sie können weitere Objekte zur Beobachtungsliste hinzufügen, indem Sie auf den Knopf <guibutton>Objekt hinzufügen</guibutton> drücken. Im Dialog „Objekt suchen“ können Sie dann Objekte nach Namen oder Typ ausfiltern. Folgende Filter für den Typ können verwendet werden: Alle, Sterne, Sonnensystem, Offene und Kugelsternhaufen, Gasnebel, Planetarische Nebel, Galaxien, Kometen, Asteroiden, Sternbilder und Supernovae.

source: Here you can see the object visibility based on the time and date. The leader line shows the time right now.
de: Hier können Sie die Sichtbarkeit des Objekts abhängig von Uhrzeit und Datum erkennen. Die Führungslinie zeigt die aktuelle Zeit an.

source: And below this you can add notes about observing this object.
de: Darunter können Sie Notizen zur Beobachtung dieser Objekte eintragen.

source: Do note that the Wish List is not the Session Plan. In the Wish List you can add objects that you wish to observer at some point. From there you can add them to the Session Plan.
de: Beachten Sie den Unterschied zwischen Beobachtungsliste und Sitzungsplan. In der Beobachtungsliste können Sie Objekte hinzufügen, die Sie irgendwann beobachten möchten. Aus der Beobachtungsliste können Sie dann Objekte in den Sitzungsplan einfügen.

source: You can see the pop-up window that comes after right-clicking on an object.
de: Durch Klicken mit der &RMBn; auf ein Objekt öffnen Sie ein Kontextmenü für das Objekt.

source: Add objects to Session Plan window
de: Objekte zum Sitzungsplan hinzufügen

source: Here is the second way of adding objects in your Observation Plan and using you Observation Plan. To use this way you just need to press the 4-th icon on the top-left corner of the Observation Planner Wizard (which is highlighted with yellow).
de: Für die zweite Möglichkeit, um Objekte zur Beobachtungsliste hinzuzufügen und die Beobachtungsliste zu benutzen, drücken Sie den Knopf <guibutton>Beobachtungslisten-Assistent</guibutton> oben links im Dialog, der im Bildschirmfoto hervorgehoben ist.

source: Despite looking differently this way is basically the same as the first one. Although that it could be a bit more detailed. Here you can see the same categories of objects.
de: Trotz anderer Ansicht ist der Umgang mit der Beobachtungsliste ähnlich wie bei der ersten Variante, ist aber etwas ausführlicher. Hier werden die gleichen Kategorien von Objekten angezeigt.

source: You can choose where these objects to be on the sky. There are four options available for you: All over the sky (which is the default option), by constellation and in a region (rectangular or circular).
de: Sie können auswählen, wo sich die Objekte im Himmel befinden sollen. Es gibt vier Möglichkeiten: Alle Objekte als Voreinstellung oder Sternbilder und Objekte in einem rechteckigen oder kreisförmigen Bereich.

source: You can choose the date for the observation and the place you are going to observe from.
de: Das Datum und der Standort der Beobachtung kann ebenfalls eingestellt werden.

source: You can choose the treshold of magnitude for the objects to be shown. In astronomy, absolute magnitude (also known as absolute visual magnitude when measured in the standard V photometric band) measures a celestial object&apos;s intrinsic brightness.
de: Auch der Grenzwert der Magnitude (Helligkeit) der angezeigten Objekte kann vorgegeben werden. In der Astronomie ist die absolute Magnitude (auch als absolute sichtbare Magnitude bei der Messung im Standard-V-Photometrischen Bereich bekannt) ein Maß für die scheinbare Helligkeit eines Himmelsobjekts.

source: You can save your observation plan. And it will save it with a <filename class="extension">.obslist</filename> extension.
de: Ihren Beobachtungsplan können Sie als Datei mit der Erweiterung <filename class="extension">.obslist</filename> speichern.

source: You can also access the <guilabel>WUT</guilabel> (What&apos;s up tonight), which could be of a great assistance to you. It can give you ideas what to observe on a date, time and place that you specify using the configuration buttons int the top-right corner of the <guilabel>What&apos;s up tonight</guilabel> window.
de: Sie können außerdem mit dem Knopf <guilabel>Ereignisse</guilabel> den Dialog „Was ist los heute Nacht“ öffnen, der sehr hilfreich sein kann. Damit erhalten Sie Vorschläge, was es an einem von Ihnen angegebenen Datum und Standort an interessanten Beobachtungen gibt, wenn Sie die Knöpfe rechts oben im Dialog <guilabel>Was ist los heute Nacht</guilabel> benutzen.

source: This is how the <guilabel>Execution Session</guilabel> Window look. It can be opened by pressing <keycombo action="simul">&Ctrl;<keycap>2</keycap></keycombo>. In it you can also see some information about the selected object and you are able to add observing notes.
de: Im nächsten Bildschirmfoto sehen Sie den Dialog <guilabel>Sitzung ausführen</guilabel>, den Sie mit dem Kurzbefehl <keycombo action="simul">&Ctrl;<keycap>2</keycap></keycombo> aufrufen. In diesem Dialog finden Sie Informationen über die bereits ausgewählten Objekte und können auch Notizen für eine Beobachtung hinzufügen.

source: First Execute Session window
de: Erste Seite des Dialogs „Sitzung ausführen“

source: By pressing the <guibutton>Next Page</guibutton> button you will access the second page of Session Plan. Here you are able to see information not about your object, but about your equipment.
de: Mit dem Knopf <guibutton>Nächste Seite</guibutton> wechseln Sie zur folgenden Seite des Sitzungsplans. Hier finden Sie Informationen über Ihre Ausrüstung.

source: Second Execute Session window
de: Zweite Seite des Dialogs „Sitzung ausführen“

source: Pressing the <guibutton>Next Target</guibutton> button will cause the Execute Session to open the first window about the next object.
de: Drücken Sie den Knopf <guibutton>Nächstes Ziel</guibutton>, wird wieder die erste Seite für das folgende Objekt in der Beobachtungsliste geöffnet.
