Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdeedu/kstars_commands.po
Languages: de

source: Command Reference
de: Befehlsreferenz

source: Menu Commands
de: Menübefehle

source: Commands
de: Befehle

source: Menu
de: Menü

source: File Menu
de: Menü Datei

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>O</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Open FITS...</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>O</keycap></keycombo> </shortcut> <guimenu>Datei</guimenu> <guimenuitem>FITS öffnen ...</guimenuitem>

source: Open a FITS image in the FITS Viewer tool
de: Öffnet ein FITS-Bild im FITS-Betrachter

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>I</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Save Sky Image...</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>I</keycap></keycombo></shortcut><guimenu>Datei</guimenu> <guimenuitem>Himmelsbild speichern ...</guimenuitem>

source: Create image on disk from current display
de: Erzeugt ein Bild der aktuellen Ansicht auf der Festplatte

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>R</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Run Script...</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>R</keycap></keycombo> </shortcut> <guimenu>Datei</guimenu> <guimenuitem>Skript ausführen ...</guimenuitem>

source: Run the specified &kstars; script
de: Führt das angegebene &kstars;-Skript aus

source: <guimenu>File</guimenu> <guimenuitem>Printing Wizard</guimenuitem>
de: <guimenu>Datei</guimenu> <guimenuitem>Druckassistent ...</guimenuitem>

source: Starts a wizard to configure capturing sky objects images using telescope and printing the results as a good looking printout for further use or catalogization.
de: Startet einen Assistenten um die Aufnahme von Himmelsobjekten mit Teleskopen einzurichten und um die Ergebnisse als gut gestaltete Druckausgabe fur weitere Verwendung oder zur Katalogisierung zu drucken.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>P</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Print...</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>P</keycap></keycombo> </shortcut> <guimenu>Datei</guimenu> <guimenuitem>Drucken ...</guimenuitem>

source: Send the current sky map to the printer (or to a PostScript/PDF file)
de: Sendet die aktuelle Sternenkarte an den Drucker (oder in eine PostScript/PDF-Datei)

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Quit</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo></shortcut><guimenu>Datei</guimenu><guimenuitem>Beenden</guimenuitem>

source: Quit &kstars;
de: Beendet &kstars;

source: Time Menu
de: Menü Zeit

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>E</keycap></keycombo> </shortcut> <guimenu>Time</guimenu> <guimenuitem>Set Time to Now</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>E</keycap></keycombo></shortcut><guimenu>Zeit</guimenu><guimenuitem>Aktuelle Zeit einstellen</guimenuitem>

source: Sync time to system clock
de: Setzt die Zeit auf die Systemzeit des Computers

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>S</keycap></keycombo> </shortcut> <guimenu>Time</guimenu> <guimenuitem>Set Time...</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>S</keycap></keycombo></shortcut><guimenu>Zeit</guimenu> <guimenuitem>Zeit einstellen ...</guimenuitem>

source: Set time and date
de: Zeit und Datum auswählen

source: <shortcut> <keycap>&lt;</keycap> </shortcut> <guimenu>Time</guimenu> <guimenuitem>Advance one step backward in time</guimenuitem>
de: <shortcut> <keycap>&lt;</keycap> </shortcut> <guimenu>Zeit</guimenu> <guimenuitem>Ein Zeitschritt rückwärts</guimenuitem>

source: Advance one step backward in time in the &kstars; simulation of the sky chart. The duration of the time step can be configured after pressing the little <guilabel>&gt;</guilabel> button on the &kstars; toolbar.
de: Geht einen Schritt zurück in der Zeitsimulation in der Himmelskarte. Die Dauer des Zeitschritts kann im Drehfeld in der Werkzeugleiste von &kstars; eingestellt werden.

source: <guimenu>Time</guimenu> <guimenuitem>Stop Clock</guimenuitem>
de: <guimenu>Zeit</guimenu> <guimenuitem>Uhr anhalten</guimenuitem>

source: Toggle whether time passes
de: Schaltet den Zeitablauf ein/aus

source: <shortcut> <keycap>&gt;</keycap> </shortcut> <guimenu>Time</guimenu> <guimenuitem>Advance one step forward in time</guimenuitem>
de: <shortcut> <keycap>&gt;</keycap> </shortcut> <guimenu>Zeit</guimenu> <guimenuitem>Ein Zeitschritt vorwärts</guimenuitem>

source: Advance one step forward in time in the &kstars; simulation of the sky chart. The duration of the time step can be configured after pressing the little <guilabel>&gt;</guilabel> button on the &kstars; toolbar.
de: Geht einen Schritt vorwärts in der Zeitsimulation in der Himmelskarte. Die Dauer des Zeitschritts kann im Drehfeld in der Werkzeugleiste von &kstars; eingestellt werden.

source: Pointing Menu
de: Menü Sichtrichtung

source: <shortcut> <keycap>Z</keycap> </shortcut> <guimenu>Pointing</guimenu> <guimenuitem>Zenith</guimenuitem>
de: <shortcut> <keycap>Z</keycap></shortcut><guimenu>Sichtrichtung</guimenu> <guimenuitem>Zenit</guimenuitem>

source: Center the display at the <link linkend="ai-zenith">Zenith</link> point (straight up)
de: Zentriert die Ansicht auf den <link linkend="ai-zenith">Zenit</link>punkt (direkt über Ihnen)

source: <shortcut> <keycap>N</keycap> </shortcut> <guimenu>Pointing</guimenu> <guimenuitem>North</guimenuitem>
de: <shortcut> <keycap>N</keycap></shortcut><guimenu>Sichtrichtung</guimenu> <guimenuitem>Norden</guimenuitem>

source: Center the display above the North point on the horizon
de: Zentriert sie Ansicht auf den Nordpunkt am Horizont

source: <shortcut> <keycap>E</keycap> </shortcut> <guimenu>Pointing</guimenu> <guimenuitem>East</guimenuitem>
de: <shortcut> <keycap>E</keycap></shortcut><guimenu>Sichtrichtung</guimenu> <guimenuitem>Osten</guimenuitem>

source: Center the display above the East point on the horizon
de: Zentriert die Ansicht auf den Ostpunkt am Horizont

source: <shortcut> <keycap>S</keycap> </shortcut> <guimenu>Pointing</guimenu> <guimenuitem>South</guimenuitem>
de: <shortcut><keycap>S</keycap></shortcut><guimenu>Sichtrichtung</guimenu> <guimenuitem>Süden</guimenuitem>

source: Center the display above the South point on the horizon
de: Zentriert die Ansicht auf den Südpunkt am Horizont

source: <shortcut> <keycap>W</keycap> </shortcut> <guimenu>Pointing</guimenu> <guimenuitem>West</guimenuitem>
de: <shortcut><keycap>W</keycap></shortcut><guimenu>Sichtrichtung</guimenu> <guimenuitem>Westen</guimenuitem>

source: Center the display above the West point on the horizon
de: Zentriert die Ansicht auf den Westpunkt am Horizont

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>M</keycap></keycombo> </shortcut> <guimenu>Pointing</guimenu> <guimenuitem>Set Coordinates Manually...</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>M</keycap></keycombo></shortcut><guimenu>Sichtrichtung</guimenu><guimenuitem>Koordinaten manuell einstellen ...</guimenuitem>

source: Center the display on specific <link linkend="ai-skycoords">sky coordinates</link>
de: Zentriert die Ansicht auf bestimmte <link linkend="ai-skycoords">Himmelskoordinaten</link>

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>F</keycap></keycombo> </shortcut> <guimenu>Pointing</guimenu> <guimenuitem>Find Object</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>F</keycap></keycombo></shortcut><guimenu>Sichtrichtung</guimenu> <guimenuitem>Objekt suchen</guimenuitem>

source: Locate an object by name using the <link linkend="findobjects">Find Object Window</link>
de: Sucht ein Objekt anhand des Namens mit dem Dialog <link linkend="findobjects">Objekt suchen</link>

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>T</keycap></keycombo> </shortcut> <guimenu>Pointing</guimenu> <guimenuitem>Stop Tracking</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>T</keycap></keycombo></shortcut><guimenu>Sichtrichtung</guimenu> <guimenuitem>Verfolgung anhalten</guimenuitem>

source: Toggle tracking on/off. While tracking, the display will remain centered on the current position or object.
de: Schaltet die Verfolgung an/aus. Während der Verfolgung bleibt die Anzeige auf der aktuellen Position oder dem aktuellen Objekt zentriert.

source: View Menu
de: Menü Ansicht

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>+</keycap></keycombo></shortcut> <guimenu>View</guimenu> <guimenuitem>Zoom in</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>+</keycap></keycombo> </shortcut> <guimenu>Ansicht</guimenu> <guimenuitem>Vergrößern</guimenuitem>

source: Zooms view in
de: Vergrößert die Ansicht

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>-</keycap></keycombo></shortcut> <guimenu>View</guimenu> <guimenuitem>Zoom out</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>-</keycap></keycombo> </shortcut> <guimenu>Ansicht</guimenu> <guimenuitem>Verkleinern</guimenuitem>

source: Zooms view out
de: Verkleinert die Ansicht

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Z</keycap></keycombo> </shortcut> <guimenu>View</guimenu> <guimenuitem>Default Zoom</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Z</keycap></keycombo> </shortcut> <guimenu>Ansicht</guimenu> <guimenuitem>Standardvergrößerung</guimenuitem>

source: Restore the default Zoom setting
de: Stellt die normale Vergrößerung her

source: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>Z</keycap></keycombo> </shortcut> <guimenu>View</guimenu> <guimenuitem>Zoom to Angular Size...</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>Z</keycap></keycombo> </shortcut> <guimenu>Ansicht </guimenu> <guimenuitem>Auf Winkelgröße vergrößern ...</guimenuitem>

source: Zoom to specified field-of-view angle
de: Vergrößert auf einen bestimmten Sichtfeldwinkel

source: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>F</keycap></keycombo> </shortcut> <guimenu>View</guimenu> <guimenuitem>Full Screen Mode</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>F</keycap></keycombo> </shortcut> <guimenu>Ansicht</guimenu> <guimenuitem>Vollbildmodus</guimenuitem>

source: Toggle full-screen mode
de: Schaltet den Vollbildmodus ein und aus

source: <shortcut> <keycap>Space</keycap> </shortcut> <guimenu>View</guimenu> <guimenuitem>Switch to star globe view / Switch to horizontal view</guimenuitem>
de: <shortcut> <keycap>Leertaste</keycap> </shortcut> <guimenu>Ansicht</guimenu><guimenuitem>Zu Sternkugelansicht (Äquatoriale Koordinaten) / horizontaler Ansicht (Horizontale Koordinaten) wechseln</guimenuitem>

source: Toggle between the <link linkend="horizontal">Horizontal</link> and <link linkend="equatorial">Equatorial</link> <link linkend="ai-skycoords">Coordinate Systems</link>
de: Schaltet zwischen dem <link linkend="horizontal">horizontalen</link> und dem <link linkend="equatorial">äquatorialen</link> <link linkend="ai-skycoords">Koordinatensystem</link> um

source: <shortcut> <keycap>F5</keycap> </shortcut> <guimenu>View</guimenu> <guisubmenu>Projection</guisubmenu> <guimenuitem>Lambert Azimuthal Equal-area</guimenuitem>
de: <shortcut> <keycap>F5</keycap> </shortcut> <guimenu>Ansicht</guimenu> <guisubmenu>Projektion</guisubmenu> <guimenuitem>Flächentreuer Azimutalbereich</guimenuitem>

source: Switch sky chart view to the <ulink url="https://en.wikipedia.org/wiki/Lambert_azimuthal_equal-area_projection">Lambert azimuthal equal-area</ulink> projection.
de: Wechselt die Ansicht der Himmelskarte zur <ulink url="https://de.wikipedia.org/wiki/Flächentreue_Azimutalprojektion">Flächentreuen Azimutalprojektion</ulink>.

source: <shortcut> <keycap>F6</keycap> </shortcut> <guimenu>View</guimenu> <guisubmenu>Projection</guisubmenu> <guimenuitem>Azimuthal Equidistant</guimenuitem>
de: <shortcut> <keycap>F6</keycap> </shortcut> <guimenu>Ansicht</guimenu> <guisubmenu>Projektion</guisubmenu> <guimenuitem>Mittabstandstreu Azimutal</guimenuitem>

source: Switch sky chart view to the <ulink url="https://en.wikipedia.org/wiki/Azimuthal_equidistant_projection">azimuthal equidistant</ulink> projection.
de: Wechselt die Ansicht der Himmelskarte zur <ulink url="https://de.wikipedia.org/wiki/Flächentreue_Azimutalprojektion">Mittenabstandstreuen Azimutalprojektion</ulink>.

source: <shortcut> <keycap>F7</keycap> </shortcut> <guimenu>View</guimenu> <guisubmenu>Projection</guisubmenu> <guimenuitem>Orthographic</guimenuitem>
de: <shortcut> <keycap>F7</keycap> </shortcut> <guimenu>Sichtrichtung</guimenu> <guisubmenu>Projection</guisubmenu> <guimenuitem>Orthografisch</guimenuitem>

source: Switch sky chart view to the <ulink url="https://en.wikipedia.org/wiki/Orthographic_projection_(cartography)">orthographic</ulink> projection.
de: Wechselt die Ansicht der Himmelskarte zur <ulink url="https://de.wikipedia.org/wiki/Orthografische_Azimutalprojektion"> Orthografischen Azimutalprojektion</ulink>.

source: <shortcut> <keycap>F8</keycap> </shortcut> <guimenu>View</guimenu> <guisubmenu>Projection</guisubmenu> <guimenuitem>Equirectangular</guimenuitem>
de: <shortcut> <keycap>F8</keycap> </shortcut> <guimenu>Ansicht</guimenu> <guisubmenu>Projektion</guisubmenu> <guimenuitem>Quadratische Plattkarte</guimenuitem>

source: Switch sky chart view to the <ulink url="https://en.wikipedia.org/wiki/Equirectangular_projection">equirectangular</ulink> projection.
de: Wechselt die Ansicht der Himmelskarte zur <ulink url="https://de.wikipedia.org/wiki/Plattkarte"> Plattkarte oder Rektangularprojektion</ulink>.

source: <shortcut> <keycap>F9</keycap> </shortcut> <guimenu>View</guimenu> <guisubmenu>Projection</guisubmenu> <guimenuitem>Stereographic</guimenuitem>
de: <shortcut> <keycap>F9</keycap> </shortcut> <guimenu>Ansicht</guimenu> <guisubmenu>Projektion</guisubmenu> <guimenuitem>Stereografisch</guimenuitem>

source: Switch sky chart view to the <ulink url="https://en.wikipedia.org/wiki/Stereographic_projection">stereographic</ulink> projection.
de: Wechselt die Ansicht der Himmelskarte zur <ulink url="https://de.wikipedia.org/wiki/Stereografische_Projektion"> Stereografischen Projektion</ulink>.

source: <shortcut> <keycap>F10</keycap> </shortcut> <guimenu>View</guimenu> <guisubmenu>Projection</guisubmenu> <guimenuitem>Gnomonic</guimenuitem>
de: <shortcut> <keycap>F10</keycap> </shortcut> <guimenu>Ansicht</guimenu> <guisubmenu>Projektion</guisubmenu> <guimenuitem>Gnomonisch</guimenuitem>

source: Switch sky chart view to the <ulink url="https://en.wikipedia.org/wiki/Gnomonic_projection">gnomonic</ulink> projection.
de: Wechselt die Ansicht der Himmelskarte zur <ulink url="https://de.wikipedia.org/wiki/Gnomonische_Projektion"> Gnomonischen Projektion</ulink>.

source: Tools Menu
de: Menü Extras

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>C</keycap></keycombo> </shortcut> <guimenu>Tools</guimenu> <guimenuitem>Calculator...</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>C</keycap></keycombo> </shortcut> <guimenu>Extras</guimenu> <guimenuitem>Rechner ...</guimenuitem>

source: Opens the <link linkend="tool-calculator">AstroCalculator</link> Tool, which provides full access to many of the mathematical functions used by &kstars;.
de: Öffnet das Hilfsmittel <link linkend="tool-calculator">Astrorechner</link>, das vollen Zugriff auf viele der mathematischen Funktionen von &kstars; bietet.

source: <guimenu>Tools</guimenu> <guisubmenu>Devices</guisubmenu> <guimenuitem>Telescope Wizard...</guimenuitem>
de: <guimenu>Extras</guimenu> <guisubmenu>Geräte</guisubmenu> <guimenuitem>Teleskop-Assistent ...</guimenuitem>

source: Opens the <guilabel>Telescope Wizard</guilabel>, which provides a step-by-step guide to help you connect to your telescope and control it with &kstars;.
de: Öffnet den Teleskop-Assistenten, der Ihnen Schritt für Schritt hilft, Ihr Teleskop zu verbinden und von &kstars; aus zu kontrollieren.

source: <guimenu>Tools</guimenu> <guisubmenu>Devices</guisubmenu> <guimenuitem>Device Manager...</guimenuitem>
de: <guimenu>Extras</guimenu> <guisubmenu>Geräte</guisubmenu> <guimenuitem>Gerätemanager ...</guimenuitem>

source: Opens up the device manager, which allows you to start/shutdown device drivers and connect to remote INDI servers.
de: Öffnet den Gerätemanager, mit dem Sie Gerätetreiber starten und stoppen und mit entfernten INDI-Servern verbinden können.

source: <guimenu>Tools</guimenu> <guisubmenu>Devices</guisubmenu> <guimenuitem>INDI Control Panel...</guimenuitem>
de: <guimenu>Extras</guimenu> <guisubmenu>Geräte</guisubmenu> <guimenuitem>INDI-Kontrollfeld ...</guimenuitem>

source: Opens up INDI Control Panel, which allows you to control all the features supported by a device.
de: Öffnet das INDI-Kontrollfeld, das Ihnen erlaubt, alle Funktionen eines Gerätes zu kontrollieren.

source: <guimenu>Tools</guimenu> <guimenuitem>Sky Calendar</guimenuitem>
de: <guimenu>Extras</guimenu> <guimenuitem>Himmelskalender</guimenuitem>

source: Opens the <guilabel>Sky Calendar</guilabel> Tool, which allows you to plan observations of Solar System planets by giving graphical data on sets and rises of these objects.
de: Öffnet den Dialog <guilabel>Himmelskalender</guilabel>, in dem Sie Beobachtungen von Planeten des Sonnensystems planen können, indem Sie Daten dafür eingeben, die grafisch dargestellt werden.

source: <guimenu>Tools</guimenu> <guimenuitem>Moon Phase Calendar</guimenuitem>
de: <guimenu>Extras</guimenu> <guimenuitem>Mondphasenkalender</guimenuitem>

source: Opens the <guilabel>Moon Phase Calendar</guilabel> Tool with graphical representation of Moon phases with convenient calendar to choose the month and year.
de: Öffnet den <guilabel>Mondphasenkalender</guilabel>. Dieser Dialog zeigt die Mondphasen eines Monats, Jahr und Monat können oben im Dialog eingestellt werden.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>A</keycap></keycombo> </shortcut> <guimenu>Tools</guimenu> <guimenuitem>Altitude vs. Time...</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>A</keycap></keycombo> </shortcut> <guimenu>Extras</guimenu> <guimenuitem>Höhe und Zeit ...</guimenuitem>

source: Opens the <link linkend="tool-altvstime">Altitude vs. Time</link> Tool, which can plot curves representing the altitude of any object as a function of time. This is useful for planning observing sessions.
de: Öffnet das Hilfsmittel <link linkend="tool-altvstime">Höhe und Zeit</link>, das Kurven zeichnet, die die Höhe eines Objekts als eine Funktion der Zeit zeigen. Das ist nützlich, um Beobachtungssitzungen zu planen.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>U</keycap></keycombo> </shortcut> <guimenu>Tools</guimenu> <guimenuitem>What's Up Tonight...</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>U</keycap></keycombo> </shortcut> <guimenu>Extras</guimenu> <guimenuitem>Was ist los heute Nacht ...</guimenuitem>

source: Opens the <link linkend="tool-whatsup">What's Up Tonight</link> Tool, which presents a summary of the objects which are observable from your location on a given date.
de: Öffnet das Hilfsmittel <link linkend="tool-whatsup">Was ist los heute Nacht</link>, das eine Zusammenfassung der Objekte anzeigt, die von Ihrem Standort aus an einem angegebenen Datum sichtbar sein werden.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>W</keycap></keycombo> </shortcut> <guimenu>Tools</guimenu> <guimenuitem>What's Interesting...</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>W</keycap></keycombo> </shortcut> <guimenu>Extras</guimenu> <guimenuitem>Was ist interessant ...</guimenuitem>

source: Opens the <guilabel>What's Interesting</guilabel> Tool, which allows you to be informed about the most interesting observations that can be made from your current location using the given equipment.
de: Öffnet das Fenster <guilabel>Was ist interessant</guilabel>. Hier finden Sie Informationen über die interessantesten Beobachtungen, die Sie vom Ihrem Standort mit Ihrer angegebenen Ausrüstung machen können.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>B</keycap></keycombo> </shortcut> <guimenu>Tools</guimenu> <guimenuitem>Script Builder...</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>B</keycap></keycombo> </shortcut> <guimenu>Extras</guimenu> <guimenuitem>Skriptbaukasten ...</guimenuitem>

source: Opens the <link linkend="tool-scriptbuilder">Script Builder</link> Tool, which provides a GUI interface for building &kstars; &DBus; scripts.
de: Öffnet das Hilfsmittel <link linkend="tool-scriptbuilder">Skriptbaukasten</link>, das eine Oberfläche zur Erstellung von &kstars;-&DBus;-Skripts bietet.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Y</keycap></keycombo> </shortcut> <guimenu>Tools</guimenu> <guimenuitem>Solar System...</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Y</keycap></keycombo> </shortcut> <guimenu>Extras</guimenu> <guimenuitem>Sonnensystem ...</guimenuitem>

source: Opens the <link linkend="tool-solarsys">Solar System Viewer</link>, which displays an overhead view of the solar system on the current simulation date.
de: Öffnet den <link linkend="tool-solarsys">Sonnensystembetrachter</link>, der einen Überblick über das Sonnensystem am aktuellen Simulationstag bietet.

source: <guimenu>Tools</guimenu> <guimenuitem>Ekos</guimenuitem>
de: <guimenu>Extras</guimenu> <guimenuitem>Ekos</guimenuitem>

source: Opens the powerful <guilabel>Ekos</guilabel> Tool, which is software guider for your telescope. Alignment capabilities of Ekos are powered by <ulink url="http://astrometry.net/">astrometry.net</ulink> libraries.
de: Öffnet den Dialog für das leistungsfähige Ekos, eine Software-Nachführung für Ihr Teleskop. Die Funktionen zur Ausrichtung werden durch die Bibliotheken von <ulink url="http://astrometry.net/">astrometry.net</ulink> bereit gestellt.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>J</keycap></keycombo> </shortcut> <guimenu>Tools</guimenu> <guimenuitem>Jupiter's Moons...</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>J</keycap></keycombo> </shortcut> <guimenu>Extras</guimenu> <guimenuitem>Jupitermonde ...</guimenuitem>

source: Opens the <link linkend="tool-jmoons">Jupiter Moons Tool</link>, which displays the positions of Jupiter's four brightest moons as a function of time.
de: Öffnet das Hilfsmittel <link linkend="tool-jmoons">Jupitermonde</link>, das die Position von Jupiters vier hellsten Monde als eine Funktion der Zeit anzeigt.

source: <guimenu>Tools</guimenu> <guimenuitem>Flags</guimenuitem>
de: <guimenu>Extras</guimenu> <guimenuitem>Ortsmarken</guimenuitem>

source: Opens the <guilabel>Flag manager</guilabel> Tool, which can be used to assign color labels and icons to the given positions on the sky chart.
de: Öffnet den Dialog <guilabel>Ortsmarkenverwaltung</guilabel>. Hier können Sie die Farbe von Marken und Symbole festlegen und Positionen in der Himmelskarte definieren.

source: Data Menu
de: Menü Daten

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>D</keycap></keycombo> </shortcut> <guimenu>Data</guimenu> <guimenuitem>Download New Data...</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>D</keycap></keycombo> </shortcut> <guimenu>Daten</guimenu> <guimenuitem>Neue Daten herunterladen ...</guimenuitem>
