Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdeedu/kstars_calc-julianday.po
Languages: de

source: <title>Julian Day module</title>
de: <title>Modul <quote>Julianischer Tag</quote></title>

source: Tools
de: Hilfsmittel

source: Astrocalculator
de: Astrorechner

source: <tertiary>Julian Day module</tertiary>
de: <tertiary>Modul <quote>Julianischer Tag</quote></tertiary>

source: The Julian Day calculator module
de: Das Rechnermodul <quote>Julianischer Tag</quote>

source: Julian Day
de: Julianischer Tag

source: This module converts between the calendar <guilabel>Date and time</guilabel>, the <link linkend="ai-julianday">Julian Day</link>, and the <firstterm>Modified Julian Day</firstterm>. The Modified Julian Day is simply equal to the Julian Day - 2,400,000.5.
de: Dieses Modul konvertiert zwischen <guilabel>Datum und Zeit</guilabel> des Kalenders, dem <link linkend="ai-julianday">Julianischen Tag</link> und dem <firstterm>Veränderten Julianischen Tag</firstterm>. Der veränderte Julianische Tag ist einfach gleich dem Julianischen Tag minus 2.400.000,5.

source: To use the module, enter one of the three dates and the corresponding values for the other two date systems will be displayed.
de: Um das Modul zu benutzen, geben Sie eine der drei Daten ein. Die entsprechenden Werte für die beiden anderen Kalendersysteme werden dann berechnet und angezeigt.

source: Exercise:
de: Übung:

source: What calendar date does MJD = 0.0 correspond to?
de: Welchem Kalenderdatum entspricht der Veränderte Julianische Tag = 0,0?
