Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdeedu/kstars_indi.po
Languages: de

source: Astronomical Device Control with <acronym>INDI</acronym>
de: Steuerung astronomischer Geräte mit <acronym>INDI</acronym>

source: INDI Control
de: INDI Kontrollfeld

source: Overview
de: Übersicht

source: &kstars; provides an interface to configure and control astronomical instruments via the <acronym><link linkend="what-is-indi">INDI</link></acronym> protocol.
de: &kstars; bietet eine Schnittstelle, um astronomische Instrumente mit dem <acronym><link linkend="what-is-indi">INDI</link></acronym>-Protokoll einzurichten und zu steuern.

source: The <acronym>INDI</acronym> protocol supports a variety of astronomical instruments such as CCD cameras and focusers. For an up to date list of supported devices, please visit <acronym>INDI</acronym> <ulink url="http://indilib.org/index.php?title=Devices">supported devices page</ulink>.
de: Das <acronym>INDI</acronym>-Protokoll unterstützt eine Vielzahl von astronomischen Instrumenten, wie CCD-Kameras und Fokussierer. Eine aktuelle Liste von unterstützten Geräten finden Sie auf der <acronym>INDI</acronym>-Seite <ulink url="http://indilib.org/index.php?title=Devices"> unterstützte Geräte</ulink>.

source: INDI Setup
de: INDI-Einrichtung

source: Setup
de: Einrichtung

source: &kstars; can control local and remote devices seamlessly via the <link linkend="what-is-indi">INDI</link> server/client architecture. INDI devices may be run in three different modes:
de: &kstars; kann lokale und entfernte Geräte problemlos mit der <link linkend="what-is-indi">INDI</link> Server/Client-Architektur steuern. INDI-Geräte können in drei verschiedenen Modi betrieben werden:

source: Local: The local mode is the most common and is used to control local device (&ie; a device attached to your machine).
de: Lokal: Der lokale Modus wird am häufigsten verwendet und steuert lokale Geräte (d. h. ein Gerät, das direkt an den Rechner angeschlossen ist).

source: Server: The server mode establishes an INDI server for a particular device and waits for connections from remote clients. You cannot operate server devices, you can only start and shut them down.
de: Server: Der Server Modus stellt einen Dienst für ein bestimmtes Gerät bereit und wartet auf Anfragen von entfernten Clients. Sie können auf dem Server Geräte nicht ansteuern, Sie können sie nur starten und anhalten.

source: Client: The client mode is used to connect to remote INDI servers running INDI devices. You can control remote devices seamlessly like local devices.
de: Client: Der Client-Modus verbindet Sie mit entfernten INDI-Servern mit angeschlossenen INDI-Geräten. Entfernte Geräte können Sie genauso einfach steuern wie lokale Geräte.

source: You can run local device, establish INDI servers, and connect to remote clients from the <guimenuitem>Device Manager</guimenuitem> in the <guimenu>Devices</guimenu> menu.
de: Mit dem <guimenuitem>Gerätemanager</guimenuitem> im Menü <guimenu>Geräte</guimenu> können Sie lokale Geräte steuern, INDI-Server bereitstellen und mit entfernten Clients verbinden.

source: Here is a screenshot of the <guilabel>Device Manager</guilabel> window:
de: Hier ist ein Bildschirmfoto des <guilabel>Gerätemanager</guilabel>fensters:

source: Running device drivers
de: Laufende Gerätetreiber

source: Start device drivers
de: Gerätetreiber starten

source: You can run devices by browsing the device tree, selecting a specific device, and then clicking on the <guibutton>Run Service</guibutton> button. You can select the operation mode, either local or server as defined above. The port number is randomly generated between the range from 7624 to 10,000. To specify a port, click on the port column next to the desired driver. &kstars; allows multiple drivers to run under one INDI server, and hence one port. Select multiple drivers then press <guibutton>Run Service</guibutton> button.
de: Sie können Geräte starten, indem Sie den Gerätebaum durchblättern, ein bestimmtes Gerät auswählen und dann auf den Knopf <guibutton>Dienst starten</guibutton> drücken. Sie können auch die Arbeitsweise einstellen, entweder lokal oder als Server wie oben beschrieben. Die Portnummer wird zufällig aus einem Bereich von 7624 bis 10000 generiert. Um einen Port festzulegen, klicken Sie in die Spalte <guilabel>Port</guilabel> in der Zeile mit dem Treiber. In &kstars; können mehrere Treiber an einem INDI-Server und folglich auch an einem Port betrieben werden. Wählen Sie mehrere Treiber aus und drücken dann <guibutton>Dienst starten</guibutton>.

source: To control remove devices, refer to the <link linkend="indi-remote-control">remote device control</link> section.
de: Mehr zur Steuerung von entfernten Geräten finden Sie im Abschnitt <link linkend="indi-remote-control">Steuerung entfernter Geräte</link>.

source: Telescope Setup
de: Teleskopeinrichtung

source: Most telescopes are equipped with <hardware>RS232</hardware> interface for remote control. Connect the RS232 jack in your telescope to your computer's <hardware>Serial/USB</hardware> port. Traditionally, the RS232 connects to the serial port of your computer, but since many new laptops abandoned the serial port in favor of <hardware>USB/FireWire</hardware> ports, you might need to obtain a Serial to USB adaptor to use with new laptops.
de: Die meisten Teleskop sind mit der <hardware>RS232</hardware>-Schnittstelle für die Fernsteuerung ausgerüstet. Verbinden Sie den RS232-Anschluss in Ihrem Teleskop mit dem <hardware>seriellen/USB</hardware>-Anschluss Ihres Rechners. Üblicherweise wird RS232 an die serielle Schnittstelle angeschlossen, da aber viele neuere Laptops eine <hardware>USB/FireWire</hardware>-Schnittstelle als Ersatz für die serielle Schnittstelle haben, brauchen Sie für diese einen Seriell-USB-Adapter.

source: After connecting your telescope to the Serial/USB port, turn your telescope on. It is <emphasis>highly</emphasis> recommended that you download and install the latest firmware for your telescope controller.
de: Nachdem Sie das Teleskop mit Ihrer seriellen bzw. USB-Schnittstelle verbunden haben, schalten Sie Ihr Teleskop an. Es wird <emphasis>dringend</emphasis> empfohlen, dass Sie die neueste Firmware für Ihren Teleskopcontroller herunterladen und installieren.

source: The telescope needs to be aligned before it can be used properly. Align your telescope (one or two stars alignment) as illustrated in your telescope manual.
de: Das Teleskop muss ausgerichtet werden, bevor es benutzt werden kann. Richten Sie Ihr Teleskop aus, wie es im Teleskophandbuch beschrieben ist (ein oder zwei Sterne-Ausrichtung).

source: &kstars; needs to verify time and location settings before connecting to the telescope. This insures proper tracking and synchronization between the telescope and &kstars;. The following steps will enable you to connect to a device that is connected to your computer. To connect and control remote devices, please refer to <link linkend="indi-remote-control">remote device control</link> section.
de: &kstars; muss die Zeit und Ortseinstellungen überprüfen, bevor es sich mit dem Teleskop verbindet. Das stellt saubere Verfolgung und Synchronisation zwischen dem Teleskop und &kstars; sicher. Die folgenden Schritte ermöglichen es Ihnen, sich mit einem an Ihrem Rechner angeschlossenen Teleskop zu verbinden. Um entfernte Geräte zu verwenden, schauen Sie bitte in den Abschnitt <link linkend="indi-remote-control">Steuerung entfernter Geräte</link>.

source: You can use the Telescope Setup Wizard and it will verify all the required information in the process. It can automatically scan ports for attached telescopes. You can run the wizard by selecting <guimenuitem>Telescope Wizard</guimenuitem> from the <guimenu>Devices</guimenu> menu.
de: Sie können den Assistenten für die Teleskop-Einrichtung benutzen und damit alle erforderlichen Angaben überprüfen. Der Assistent kann automatisch alle Ports nach angeschlossenen Teleskopen durchsuchen. Sie können den Assistenten mit <guimenuitem>Teleskop-Assistent</guimenuitem> im Menü <guimenu>Geräte</guimenu> aufrufen.

source: Alternatively, you can connect to a local telescope by performing the following steps:
de: Alternativ können Sie mit den folgenden Schritten eine Verbindung zu einem lokalen Teleskop herstellen:

source: Set your geographical location. Open the <guilabel>Set Geographic Location</guilabel> window by selecting <guimenuitem>Geographic...</guimenuitem> from the <guimenu>Settings</guimenu> menu, or by pressing the <guiicon>Globe</guiicon> icon in the toolbar, or by pressing <keycombo action="simul">&Ctrl;<keycap>G</keycap></keycombo>.
de: Wählen Sie Ihren geografischen Standort. Öffnen Sie den Dialog <guilabel>Standort einstellen</guilabel>, indem Sie <guimenuitem>Standort ...</guimenuitem> aus dem Menü <guimenu>Einstellungen</guimenu> auswählen, klicken Sie auf das Symbol <guiicon>Weltkugel</guiicon> in der Werkzeugleiste oder drücken Sie <keycombo action="simul">&Ctrl;<keycap>G</keycap></keycombo>.

source: Set your local time and date. You can change to any time or date by selecting <guimenuitem>Set Time...</guimenuitem> from the <guimenu>Time</guimenu> menu, or by pressing the <guiicon>time</guiicon> icon in the toolbar. The <guilabel>Set Time</guilabel> window uses a standard &kde; Date Picker widget. If you ever need to reset the clock back to the current time, just select <guimenuitem>Set Time to Now</guimenuitem> from the <guimenu>Time</guimenu> menu.
de: Stellen Sie Ihre lokale Zeit und das Datum ein. Sie können auf jedes Datum eingeben, indem Sie <guimenuitem>Zeit einstellen</guimenuitem> aus dem Menü <guimenu>Zeit</guimenu> wählen oder das Symbol <guiicon>Zeit</guiicon> in der Werkzeugleiste auswählen. Das Fenster <guilabel>Zeit einstellen</guilabel> benutzt ein normales &kde;-Zeitauswahlfeld. Wenn Sie die Uhr auf die aktuelle Zeit setzen wollen, wählen Sie einfache <guimenuitem>Aktuelle Zeit einstellen</guimenuitem> aus dem Menü <guimenu>Zeit</guimenu>.

source: Click on the <guimenu>Devices</guimenu> menu and select the <guimenuitem>Device Manager</guimenuitem>.
de: Klicken Sie auf das Menü <guimenu>Geräte</guimenu> und wählen den <guimenuitem>Gerätemanager</guimenuitem>.

source: Under the <guilabel>Device</guilabel> column, select your telescope model.
de: In der Spalte <guilabel>Gerät</guilabel> wählen Sie Ihr Teleskopmodell.

source: Click on the <guibutton>Run Service</guibutton> button.
de: Klicken Sie auf den Knopf <guilabel>Dienst starten</guilabel>.

source: Click <guibutton>Close</guibutton> to leave the Device Manager Dialog.
de: Klicken Sie auf <guibutton>Schließen</guibutton>, um den Geräteverwaltungsdialog zu verlassen.

source: Frequent Settings
de: Häufige Einstellungen

source: You do not need to set the geographic location and time every time you connect to a telescope. Only adjust the settings as needed.
de: Sie müssen nicht jedesmal den geografischen Standort und die Zeit einstellen, wenn Sie Ihr Teleskop anschließen. Passen Sie nur die erforderlichen Einstellungen an.

source: You are now ready to use the device features, &kstars; conveniently provides two interchangeable GUI interfaces for controlling telescopes:
de: Jetzt können Sie die Funktionen der Geräte benutzen, &kstars; bietet Ihnen zwei unterschiedliche Oberflächen, um Teleskop zu kontrollieren:

source: Controlling your telescope
de: Teleskopkontrolle

source: <guilabel>Sky map Control</guilabel>: For each device you run in the <guilabel>Device Manager</guilabel>, a corresponding entry will show up in popup menu that allows you to control the properties of the device. You can issue commands like <command>Slew, Sync,</command> and <command>Track</command> directly from the sky map.
de: <guilabel>Himmelskartenkontrolle</guilabel>: Für jedes Gerät, das Sie im <guilabel>Gerätemanager</guilabel> starten, erscheint ein Eintrag im Kontextmenü, das Ihnen erlaubt, die Eigenschaften des Gerätes zu steuern. Sie können dann Befehlen wie <command>Slew, Sync</command> (Bewegung, Synchronisation) und <command>Track</command> (Verfolgen) direkt aus der Sternenkarte starten.

source: Here is a screenshot of the popup menu with an active LX200 Classic device:
de: Hier ist ein Bildschirmfoto vom Kontextmenü mit einem aktiven LX200 Classic-Gerät:

source: Controlling devices from sky map
de: Geräte von der Himmelskarte aus kontrollieren

source: <guilabel>INDI Control Panel</guilabel>: The panel offers the user with all the features supported by a device.
de: <guilabel>INDI Kontrollfeld</guilabel>: Hier finden Sie alle Eigenschaften eines Gerätes.

source: The panel is divided into three main sections:
de: Das Feld ist in drei Hauptabschnitte unterteilt:

source: <guilabel>Device tabs</guilabel>: Each additional active device occupies a tab in the INDI panel. Multiple devices can run simultaneously without affecting the operation of other devices.
de: <guilabel>Gerätekarteikarten</guilabel>: Jedes zusätzliche Geräte belegt eine Karteikarte im INDI-Feld. Mehre Geräte können ohne Probleme gleichzeitig betrieben werden.

source: Property views on the <guilabel>Main Control</guilabel> and <guilabel>Options</guilabel> tabs: Properties are the key element in INDI architecture. Each device defines a set of properties to communicate with the client. The current position of the telescope is an example of a property. Semantically similar properties are usually contained in logical blocks or groupings.
de: Ansicht der Eigenschaften auf den Karteikarten<guilabel>Main Control</guilabel> and <guilabel>Options</guilabel> : Eigenschaften sind das Schlüsselelement in der INDI-Architektur. Jedes Geräte bestimmt eine Anzahl von Eigenschaften, um mit dem Client zu kommunizieren. Die aktuelle Position des Teleskops ist &eg; eine solche Eigenschaft. Ähnliche Eigenschaften werden in logischen Blöcken oder Gruppierungen zusammengefasst.

source: <guilabel>Log viewer</guilabel>: Devices report their status and acknowledge commands by sending INDI messages. Each device has its own log view. A device usually sends messages to its device driver only, but a device is permitted to send a generic message when appropriate.
de: <guilabel>Protokollbetrachter</guilabel>: Geräte geben Ihren Status bekannt und bestätigen Befehle, indem Sie INDI-Nachrichten schicken. Jedes Gerät hat seinen eigenen Protokollbetrachter .Ein Gerät sendet die Nachrichten nur an seinen Gerätetreiber, aber es ist zulässig, sofern notwendig, auch allgemeine Nachrichten zu verschicken.

source: INDI Control Panel
de: INDI Kontrollfeld

source: You are not restricted on using one interface over another as they can be both used simultaneously. Actions from the <guilabel>Sky map</guilabel> are automatically reflected in the <guilabel>INDI Control Panel</guilabel> and vice versa.
de: Sie sind nicht gezwungen, sich für eine Bedienungsoberfläche zu entscheiden, da sie beide gleichzeitig benutzt werden können. Aktionen von der <guilabel>Himmelskarte</guilabel> werden automatisch in das <guilabel>INDI-Kontrollfeld</guilabel> übernommen und umgekehrt.

source: To connect to your telescope, you can either select <guimenuitem>Connect</guimenuitem> from your device popup menu or alternatively, you can press <guibutton>Connect</guibutton> under your device tab in the <guilabel>INDI Control Panel</guilabel>.
de: Um nun Ihr Teleskop zu verbinden, wählen Sie entweder <guimenuitem>Verbinden</guimenuitem> aus dem Kontextmenü des Gerätes oder wählen <guibutton>Verbinden</guibutton> aus dem entsprechenden Abschnitt des <guilabel>INDI-Kontrollfeldes</guilabel>.

source: By default, &kstars; will try to connect to the <constant>/dev/ttyS0</constant> port. To change the connection port, select <guilabel>INDI Control Panel</guilabel> from the <guimenu>Devices</guimenu> menu and change the port under your device tab.
de: Standardmäßig versucht &kstars; sich über die Schnittstelle <constant>/dev/ttyS0</constant> zu verbinden. Um den Verbindungsport zu verändern, wählen Sie <guilabel>INDI-Kontrollfeld</guilabel> aus dem Menü <guimenu>Geräte</guimenu> und ändern den Port im entsprechenden Geräteabschnitt.

source: &kstars; automatically updates the telescope's longitude, latitude, and time based on current settings in &kstars;. You can enable/disable these updates from <guimenuitem>Configure INDI</guimenuitem> dialog under the <guimenu>Devices</guimenu> menu.
de: &kstars; aktualisiert automatisch Längengrad, Breitengrad und Zeit des Standortes für das Teleskop basierend auf den aktuellen Einstellungen in &kstars;. Sie können dieses Aktualisieren ein- bzw. ausschalten im <guimenuitem>INDI einrichten ...</guimenuitem>-Dialog im Menü <guimenu>Geräte</guimenu>.

source: If &kstars; communicates successfully with the telescope, it will retrieve the current <abbrev>RA</abbrev> and <abbrev>DEC</abbrev> from the telescope and will display a crosshair on the sky map indicating the telescope position.
de: Falls &kstars; mit dem Teleskop erfolgreich kommunizieren kann, wird es die aktuellen Koordinaten <abbrev>Rekt</abbrev> und <abbrev>Dekl</abbrev> vom Teleskop abfragen und ein Fadenkreuz in der Himmelskarte mit der Position des Teleskops anzeigen.

source: Synchronizing your telescope
de: Ihr Teleskop synchronisieren

source: If you aligned your telescope and the last alignment star was, for example, Vega, then the crosshair should be centered around Vega. If the crosshair was off target, then you can <mousebutton>right</mousebutton>-click Vega from the sky map and select <command>Sync</command> from your telescope menu. This action will instruct the telescope to synchronize its internal coordinates to match those of Vega, and the telescope's crosshair should now be centered around Vega.
de: Falls Sie Ihr Teleskop ausgerichtet haben und der letzte Ausrichtungsstern zum Beispiel die Wega war, dann sollte das Fadenkreuz auf der Wega zentriert sein. Falls es vom Ziel abweichen sollte, können Sie mit der <mousebutton>rechten</mousebutton> Maustaste auf die Wega in der Himmelskarte klicken und <command>Sync</command> (Synchronisieren) aus dem Teleskopmenü wählen. Die Aktion weist das Teleskop an, seine internen Koordinaten auf die von der Wega zu setzen und das Fadenkreuz des Teleskop sollte dann auf der Wega zentriert sein.

source: This is it: your telescope is ready to explore the heavens!
de: Das war's! Ihr Teleskop ist nun bereit, um den Himmel zu erforschen!

source: WARNING
de: WARNUNG

source: Never use the telescope to look at the sun. Looking at the sun might cause irreversible damage to your eyes and your equipment.
de: Benutzen Sie ein Teleskop nie, um direkt in die Sonne zu schauen! Das direkte Betrachten der Sonne kann nicht behebbare Schäden an ihren Augen und an Ihrer Ausrüstung hervorrufen.

source: CCD and Video-Capture Setup
de: Einstellung von CCDs und Video-Aufnahmen

source: CCD Video Control
de: CCD Video Kontrolle

source: You can run CCD and Video Capture devices from the <guimenuitem>Device Manager</guimenuitem> in the <guimenu>Devices</guimenu> menu. Like all INDI devices, some of the device controls will be accessible from the skymap. The device can be controlled fully from the <guimenuitem>INDI Control Panel.</guimenuitem>
de: Sie können CCD- und Videoaufnahme-Geräte im <guimenuitem>Gerätemanager</guimenuitem> im Menü <guimenu>Geräte</guimenu> starten. Wie bei allen INDI-Geräten können Sie einige Einstellungen für die Geräte von der Himmelskarte aus erreichen. Die vollständige Steuerung der Geräte finden Sie im <guimenuitem>INDI Kontrollfeld.</guimenuitem>

source: The standard format for image capture is FITS. Once an image is captured and downloaded, it will be automatically displayed in the &kstars; <link linkend="tool-fitsviewer">FITS Viewer</link>. To capture a sequence of images, use the <guimenuitem>Capture Image Sequence</guimenuitem> tool from the <guimenu>Devices</guimenu> menu. This tool is inactive until you establish a connection to an image device.
de: Das Standardformat für Bildaufnahmen ist FITS. Wenn Sie ein Bild aufgenommen und heruntergeladen haben, wird es im &kstars; <link linkend="tool-fitsviewer">FITS-Betrachter</link> angezeigt. Um eine Folge von Bildern aufzunehmen, wählen Sie <guimenuitem>Bildsequenz aufnehmen ...</guimenuitem> aus dem Menü <guimenu>Geräte</guimenu>. Diesen Menüeintrag können Sie erst dann auswählen, wenn Sie die Verbindung zu einem Aufnahmegerät hergestellt haben.

source: <title>Capture Image Sequence</title>
de: <title>Bildsequenz aufnehmen</title>

source: Capture
de: Aufnahme

source: Image
de: Bild

source: The Capture Image Sequence tool can be used to aquire images from cameras and CCDs in interactive and batch modes. Furthermore, you can select which filter, if any, you want to use for your images. The capture tool remains disabled until you establish a connection to an imaging device.
de: Mit der Bildsequenzaufnahme können Bilder mit Kameras und CCDs interaktiv und als Stapelverarbeitung aufgenommen werden. Außerdem kann der Filter für die Aufnahme ausgewählt werden. Die Bildsequenzaufnahme wird erst dann aktiviert, wenn Sie die Verbindung zu einem Aufnahmegerät hergestellt haben.

source: <screeninfo>Capture Image Sequence</screeninfo>
de: <screeninfo>Bildsequenz aufnehmen</screeninfo>

source: The above screenshot depicts a sample capture session. The tool provides the following options:
de: Das obige Bildschirmfoto zeigt eine Aufnahmesitzung. Folgende Einstellungen sind möglich:

source: Camera/CCD
de: Kamera/CCD

source: <option>Device:</option> The desired imaging device.
de: <option>Gerät:</option> Das gewünschte Bildaufnahmegerät.

source: <option>Prefix:</option> The image prefix which will be prepended to each captured filename.
de: <option>Präfix:</option> Präfix, das den Dateinamen der aufgenommenen Bilder vorangestellt wird.

source: <option>Exposure:</option> The number of seconds to expose each frame.
de: <option>Belichtung:</option> Die Belichtungsdauer in Sekunden für jede Aufnahme.

source: <option>Count:</option> The number of images to aquire.
de: <option>Anzahl:</option> Die Anzahl der Bildaufnahmen.

source: <option>Delay:</option> The delay in seconds between consecutive images.
de: <option>Verzögerung:</option> Die Wartezeit zwischen fortlaufenden Aufnahmen.

source: <option>ISO 8601 time stamp:</option> Append ISO 8601 time stamp to the filename. (e.g. image_01_20050427T09:48:05).
de: <option>ISO-8601 Zeitstempel hinzufügen:</option> Fügt den Zeitpunkt der Aufnahme im Format ISO 8601 an den Dateinamen an. (&eg; image_01_20050427T09:48:05).

source: <option>Device:</option> The desired filter device.
de: <option>Gerät:</option> Den gewünschten Filter.

source: <option>Filter:</option> The desired filter slot. You can assign color values to slot numbers using the <link linkend="indi-configure">INDI</link> page (e.g. Slot #1 = Red, Slot #2 = Blue..etc).
de: <option>Filter:</option> Der gewünschte Filterschlitz. Auf der Seite <link linkend="indi-configure">INDI</link> können Sie den Filterschlitzen Farben zuweisen (&eg; Schlitz Nr 1= Rot, Schlitz Nr 1= Blau &etc;)

source: After you fill in the desired options, you can begin the capture procedure by pressing the <guibutton>Start</guibutton> button. You may cancel at any time using the <guibutton>Stop</guibutton> button. All captured images will be saved to the default FITS directory which can be specified in the <link linkend="indi-configure">INDI</link> page of the settings dialog.
de: Wenn Sie alle Einstellungen ausgewählt haben, starten Sie die Aufnahmesequenz durch Drücken des Knopfes <guibutton>Start</guibutton>. Mit dem Knopf <guibutton>Stop</guibutton> können Sie die Aufnahme jederzeit abbrechen. Alle aufgenommenen Bilder werden im FITS-Standardordner gespeichert, den Sie auf der Seite <link linkend="indi-configure">INDI</link> im Einrichtungsdialog angeben können.
