Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdeedu/kstars_config.po
Languages: de

source: There are three situations when &kstars; must redraw the sky display very rapidly: when a new focus position is selected (and <guilabel>Use animated slewing</guilabel> is checked), when the sky is dragged with the mouse, and when the time step is large. In these situations, the positions of all objects must be recomputed as rapidly as possible, which can put a large load on the <abbrev>CPU</abbrev>. If the <abbrev>CPU</abbrev> cannot keep up with the demand, then the display will seem sluggish or jerky. To mitigate this, &kstars; will hide certain objects during these rapid-redraw situations, as long as the <guilabel>Hide objects while moving</guilabel> checkbox is selected. The timestep threshold above which objects will be hidden is determined by the <guilabel>Also hide if timescale greater than:</guilabel> timestep-spinbox. You can specify the objects that should be hidden in the <guilabel>Configure Hidden Objects</guilabel> group box.
de: Es gibt drei Situationen, in denen &kstars; die Himmelskarte sehr schnell neu zeichnen muss: Wenn eine neue Fokusposition ausgewählt wird (und <guilabel>Animierte Bewegung benutzen</guilabel> ausgewählt ist), wenn der Himmel mit der Maus bewegt wird und wenn die Zeitschritteinheit relativ groß ist. In diesen Situationen müssen alle Objektpositionen schnell neu berechnet werden, was eine hohe Last auf die <abbrev>CPU</abbrev> bedeutet. Wenn die <abbrev>CPU</abbrev> den Anforderungen nicht nachkommen kann, sieht die Anzeige unschön aus. Um das zu umgehen, wird &kstars; bestimmte Objekte in diesen Situationen ausblenden, wenn die Einstellung <guilabel>Objekte während der Bewegung ausblenden</guilabel> ausgewählt ist. Die Zeitschrittgrenze, über der Objekte ausgeblendet werden, wird durch die Einstellbox <guilabel>Auch ausblenden wenn Zeitschritt größer ist als:</guilabel> kontrolliert. Sie können die auszublendenden Objekte über den Abschnitt <guilabel>Auszublendende Objekte</guilabel> bestimmen.

source: Customizing the Display
de: Anpassung der Anzeige

source: There are several ways to modify the display to your liking.
de: Es gibt mehrere Möglichkeiten, die Anzeige nach Ihren Wünschen einzustellen.

source: Selecting
de: Auswahl

source: Select a different color scheme in the <menuchoice><guimenu>Settings</guimenu><guimenuitem>Color Schemes</guimenuitem></menuchoice> menu. There are four predefined color schemes, and you can define your own in the <link linkend="config"><guilabel>Configure &kstars;</guilabel></link> window.
de: Wählen Sie ein anderes Farbschema im Menü <menuchoice><guimenu>Einstellungen</guimenu><guimenuitem>Farbschemata</guimenuitem></menuchoice>. Es gibt vier vordefinierte Schemata und zusätzlich können Sie auch Eigene im Dialog <link linkend="config"><guilabel>&kstars; einrichten</guilabel></link> einstellen.

source: Toolbars
de: Werkzeugleisten

source: Toggle whether the Toolbars are drawn in the <menuchoice><guimenu>Settings</guimenu><guimenuitem>Toolbars Shown</guimenuitem></menuchoice> menu. Like most KDE toolbars, they can also be dragged around and anchored on any window edge, or even detached from the window completely if they are unlocked.
de: Im Menü <menuchoice><guimenu>Einstellungen</guimenu><guimenuitem>Angezeigte Werkzeugleisten</guimenuitem></menuchoice> können Sie die Anzeige der beiden Werkzeugleisten ein- und ausschalten. Wie die meisten KDE-Werkzeugleisten können Sie sie auch zu jeder Seite des Fensters ziehen und dort verankern oder sie sogar losgelöst vom Fenster auf Ihrem Bildschirm anordnen, wenn die Werkzeugleisten nicht gesperrt sind.

source: Info Boxes
de: Infoboxen

source: Shading
de: Ausblenden

source: Toggle whether the Info Boxes are drawn in the <menuchoice><guimenu>Settings</guimenu><guimenuitem>Info Boxes</guimenuitem></menuchoice> menu. In addition, you can manipulate the three Info Boxes with the mouse. Each box has additional lines of data that are hidden by default. You can toggle whether these additional lines are visible by double-clicking a box to <quote>shade</quote> it. Also, you can reposition a box by dragging it with the mouse. When a box hits a window edge, it will <quote>stick</quote> to the edge when the window is resized.
de: Die Anzeige der Infoboxen können Sie im Menü <menuchoice><guimenu>Einstellungen</guimenu><guimenuitem>Infoboxen anzeigen</guimenuitem></menuchoice> ein- und ausschalten. Zusätzlich können Sie die drei Infoboxen mit der Maus bearbeiten. Jede Infobox enthält zusätzliche Zeilen mit Daten, die als Standard ausgeblendet sind. Mit einem Doppelklick in eine Infobox können Sie die Anzeige dieser zusätzlichen Zeilen ein- und ausschalten. Außerdem können Sie eine Infobox auch mit der Maus verschieben. Eine Infobox am Rand des Fensters behält diese Position, wenn die Größe des Fenster geändert wird.

source: Field-of-View Symbols
de: Sichtfeld-Symbole

source: Description
de: Beschreibung

source: Choose an <quote>FOV Symbol</quote> using the <menuchoice><guimenu>Settings</guimenu><guimenuitem>FOV Symbols</guimenuitem></menuchoice> menu. <firstterm>FOV</firstterm> is an acronym for <quote>field-of-view</quote>. An FOV symbol is drawn at the center of the window to indicate where the display is pointing. Different symbols have different angular sizes; you can use a symbol to show what the view through a particular telescope would look like. For example, if you choose the <quote>7x35 Binoculars</quote> FOV symbol, then a circle is drawn on the display that is 9.2 degrees in diameter; this is the field-of-view for 7x35 binoculars.
de: Wählen Sie ein <quote>STF-Symbol</quote> im Menü <menuchoice><guimenu>Einstellungen</guimenu><guimenuitem>STF-Symbol</guimenuitem></menuchoice>. <firstterm>STF</firstterm> ist eine Abkürzung für <quote>Sichtfeld</quote>. Ein STF-Symbol wird in der Mitte des Fensters gezeichnet, um die Blickrichtung anzuzeigen. Die Symbole haben unterschiedliche Sichtfeldwinkel, mit einem Symbol können Sie anzeigen, wie der Blick durch eine bestimmtes Teleskop aussehen würde. Wenn Sie zum Beispiel das STF-Symbol <quote>7x35 Fernglas</quote> wählen, wird in der Ansicht ein Kreis mit einem Durchmesser von 9,2 Grad gezeichnet, dies ist das Sichtfeld eines 7x35 Fernglases.

source: You can define your own FOV symbols (or modify the existing symbols) using the <guimenuitem>Edit FOV Symbols...</guimenuitem> menu item, which launches the FOV Editor:
de: Mit dem Menüeintrag <guimenuitem>STF-Symbole bearbeiten..</guimenuitem> können Sie Ihre eigenen STF-Symbole erstellen (oder vorhandene Symbole ändern) . Damit öffnen Sie den Dialog zur Bearbeitung von STF-Symbolen:

source: Field-of-View Symbols Editor
de: Editor für Sichtfeld-Symbole

source: FOV Symbol Editor
de: STF-Symbol Editor

source: The list of defined FOV symbols is displayed on the left. On the right are buttons for adding a new symbol, editing the highlighted symbol's properties, and removing the highlighted symbol from the list. Note that you can even modify or remove the four predefined symbols (if you remove all symbols, the four defaults will be restored the next time you start &kstars;). Below these three buttons is a graphical preview display showing the highlighted symbol from the list. When the <guibutton>New...</guibutton> or <guibutton>Edit...</guibutton> button is pressed, the <guilabel>New FOV Indicator</guilabel> window is opened:
de: Die Liste der vorhandenen STF-Symbole wird auf der linken Seite angezeigt. Auf der rechten Seite finden Sie Knöpfe, um neue Symbole hinzuzufügen, die Eigenschaften des gewählten Symbol zu bearbeiten oder das gewählten Symbol aus der Liste zu entfernen. Sie können sogar die vier Standard-Symbole bearbeiten oder entfernen (wenn Sie alle Symbole entfernen, werden beim nächsten Start von &kstars; die vier Standard-Symbole wieder hergestellt). Unter diesen drei Knöpfen sehen Sie in eine Voransicht des ausgewählten Symbols aus der Liste. Wenn Sie auf <guibutton>Neu ...</guibutton> oder <guibutton>Bearbeiten ...</guibutton> drücken, wird der Dialog <guilabel>Neues STF-Symbol</guilabel> angezeigt:

source: New Field-of-View Symbol
de: Neues Sichtfeld-Symbol

source: New FOV Symbol
de: Neues STF-Symbol

source: Defining New
de: Neues Symbol erstellen

source: This window lets you modify the four properties that define a FOV symbol: name, size, shape, and color. The angular size for the symbol can either be entered directly in the <guilabel>Field of View</guilabel> edit box, or you can use the Eyepiece/Camera Tabs to calculate the field-of-view angle, given parameters of your telescope/eyepiece or telescope/camera setup. The four available shapes are: Circle, Square, Crosshairs, and Bullseye. Once you have specified all four parameters, press <guibutton>Ok</guibutton>, and the symbol will appear in the list of defined symbols. It will also be available from the <menuchoice><guimenu>Settings</guimenu><guisubmenu>FOV Symbols</guisubmenu></menuchoice> menu.
de: In diesem Dialog können Sie vier Eigenschaften eines STF-Symbols einstellen: Name, Größe, Form und Farbe. Die Winkelgröße des Symbols können Sie entweder direkt im Eingabefeld <guilabel>Sichtfeld</guilabel> eingeben, oder Sie können mit <quote>STF berechnen</quote> den Sichtfeldwinkel aus den Parametern Ihrer Teleskop/Okular- oder Teleskop/Kamera-Einstellungen berechnen. Es gibt folgende vier Formen: Kreis, Quadrat, Fadenkreuz und Zielscheibe. Wenn Sie alle vier Parameter eingestellt haben, drücken Sie auf <guibutton>Ok</guibutton>, und das Symbol wird in die Liste der definierten Symbole aufgenommen. Das neue Symbol finden Sie dann auch unter <guisubmenu>STF-Symbole</guisubmenu> im Menü <guimenu>Einstellungen</guimenu>.
