Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdeedu/kstars_sidereal.po
Languages: de

source: <title>Sidereal Time</title>
de: <title>Sternenzeit</title>

source: <primary>Sidereal Time</primary>
de: <primary>Sternenzeit</primary>

source: Hour Angle
de: Stundenwinkel

source: <firstterm>Sidereal Time</firstterm> literally means <quote>star time</quote>. The time we are used to using in our everyday lives is Solar Time. The fundamental unit of Solar Time is a <firstterm>Day</firstterm>: the time it takes the Sun to travel 360 degrees around the sky, due to the rotation of the Earth. Smaller units of Solar Time are just divisions of a Day:
de: Die Zeit, die wir normalerweise benutzen, ist die Sonnenzeit. Die grundlegende Einheit der Sonnenzeit ist ein <firstterm>Tag</firstterm>: Die Zeit, die die Sonne braucht, um, wegen der Rotation der Erde, 360 Grad um den Himmel zu ziehen. Kleinere Einheiten der Sonnenzeit sind einfach Bruchteile eines Tages.

source: 1/24 Day = 1 Hour
de: 1/24 Tag = 1 Stunde

source: 1/60 Hour = 1 Minute
de: 1/60 Stunde = 1 Minute

source: 1/60 Minute = 1 Second
de: 1/60 Minute = 1 Sekunde

source: However, there is a problem with Solar Time. The Earth does not actually spin around 360 degrees in one Solar Day. The Earth is in orbit around the Sun, and over the course of one day, it moves about one Degree along its orbit (360 degrees/365.25 Days for a full orbit = about one Degree per Day). So, in 24 hours, the direction toward the Sun changes by about a Degree. Therefore, the Earth has to spin 361 degrees to make the Sun look like it has traveled 360 degrees around the Sky.
de: Jedoch gibt es ein Problem mit der Sonnenzeit. Die Erde dreht sich nicht um 360 Grad an einem Sonnentag. Die Erde befindet sich in einem Orbit um die Sonne und bewegt sich an einem Tag ungefähr ein Grad entlang dieses Orbits (360 Grad/365,25 Tage für einen vollen Umlauf = ungefähr ein Grad pro Tag). Also ändert sich in 24 Stunden die Richtung zur Sonne um ungefähr ein Grad. Deshalb muss die Erde sich 361 Grad drehen, damit es wieder so aussieht, also ob die Sonne 360 Grad gewandert sei.

source: In astronomy, we are concerned with how long it takes the Earth to spin with respect to the <quote>fixed</quote> stars, not the Sun. So, we would like a timescale that removes the complication of Earth's orbit around the Sun, and just focuses on how long it takes the Earth to spin 360 degrees with respect to the stars. This rotational period is called a <firstterm>Sidereal Day</firstterm>. On average, it is 4 minutes shorter than a Solar Day, because of the extra 1 degree the Earth spins in a Solar Day. Rather than defining a Sidereal Day to be 23 hours, 56 minutes, we define Sidereal Hours, Minutes and Seconds that are the same fraction of a Day as their Solar counterparts. Therefore, one Solar Second = 1.00278 Sidereal Seconds.
de: In der Astronomie kümmern wir uns darum, wie lange die Erde braucht, um sich in Bezug auf <quote>feste</quote> Sterne, nicht auf die Sonne zu drehen. Also wollten wir eine Zeiteinteilung, die den komplizierten Umlauf der Erde um die Sonne nicht mehr berücksichtigt und einfach beschreibt, wie lange die Erde braucht, um eine 360 Grad-Umdrehung in Bezug auf die Sterne zu vollenden. Diese Umdrehungszeit wird <firstterm>Sternentag</firstterm> genannt. Im Durchschnitt ist er, wegen des zusätzlichen Grades, 4 Minuten kürzer als der Sonnentag. Nun hätten wir den Sonnentag als 23 Stunden und 56 Minuten definieren können, jedoch definieren wir lieber Sonnenstunden, -minuten und -sekunden, die dieselben Bruchteile des Tages sind, wie ihre Gegenstücke der Sonnenzeit. Deswegen ist eine Sonnensekunde 1,00278 Sternensekunden.

source: The Sidereal Time is useful for determining where the stars are at any given time. Sidereal Time divides one full spin of the Earth into 24 Sidereal Hours; similarly, the map of the sky is divided into 24 Hours of <firstterm>Right Ascension</firstterm>. This is no coincidence; Local Sidereal Time (<acronym>LST</acronym>) indicates the Right Ascension on the sky that is currently crossing the <link linkend="ai-meridian">Local Meridian</link>. So, if a star has a Right Ascension of 05h 32m 24s, it will be on your meridian at LST=05:32:24. More generally, the difference between an object's <acronym>RA</acronym> and the Local Sidereal Time tells you how far from the Meridian the object is. For example, the same object at LST=06:32:24 (one Sidereal Hour later), will be one Hour of Right Ascension west of your meridian, which is 15 degrees. This angular distance from the meridian is called the object's <link linkend="ai-hourangle">Hour Angle</link>.
de: Die Sternenzeit ist nützlich, um herauszufinden, wo die Sternen zu einer bestimmten Zeit sein werden. Die Sternenzeit teilt eine volle Umdrehung der Erde in 24 Sternenstunden ein, genau wie die Karte des Himmels in 24 Stunden der <firstterm>Rektaszension</firstterm> eingeteilt ist. Das ist kein Zufall. Die lokale Sternenzeit (<acronym>SZ</acronym>) zeigt die Rektaszension am Himmel an, die gerade den <link linkend="ai-meridian">lokalen Meridian</link> überquert. Wenn ein Stern also die Rektaszension von 05h 32m 24s hat, wird er auf Ihrem Meridian um SZ=05:32:24 sein. Allgemeiner sagt Ihnen die Differenz zwischen der <acronym>Rektaszension</acronym> und der lokalen Sternenzeit, wie weit das Objekt vom Meridian entfernt ist. Zum Beispiel wird sich dasselbe Objekt bei SZ=06:32:24 (eine Sternenstunde später) eine Stunde der Rektaszension westlich Ihres Meridians befinden, was 15 Grad sind. Dieser Winkelabstand wird <link linkend="ai-hourangle">Stundenwinkel</link> des Objekts genannt.

source: The Local Sidereal Time is displayed by &kstars; in the <guilabel>Time Info Box</guilabel>, with the label <quote>ST</quote> (you have to <quote>unshade</quote> the box by double-clicking it in order to see the sidereal time). Note that the changing sidereal seconds are not synchronized with the changing Local Time and Universal Time seconds. In fact, if you watch the clocks for a while, you will notice that the Sidereal seconds really are slightly shorter than the LT and UT seconds.
de: Die lokale Sternenzeit wird von &kstars; im <guilabel>Infofeld</guilabel> mit der Abkürzung <quote>SZ:</quote> angezeigt (Sie müssen die Box mit einem Doppelklick <quote>vergrößern</quote> um die Sternenzeit zu sehen). Beachten Sie, dass die Sternensekunden nicht mit den Sekunden der lokalen Zeit und der Universalzeit synchronisiert sind. Tatsächlich werden Sie, wenn Sie die Anzeige einige Zeit beobachten, bemerken, dass die Sternensekunden ein klein wenig kürzer sind als die Sekunden der Ortszeit und der Universalzeit.

source: Point to the <link linkend="ai-zenith">Zenith</link> (press <keycap>Z</keycap> or select <guimenuitem>Zenith</guimenuitem> from the <guimenu>Location</guimenu> menu). The Zenith is the point on the sky where you are looking <quote>straight up</quote> from the ground, and it is a point on your <link linkend="ai-meridian">Local Meridian</link>. Note the Right Ascension of the Zenith: it is exactly the same as your Local Sidereal Time.
de: Zeigen Sie auf den <link linkend="ai-zenith">Zenit</link> (drücken Sie <keycap>Z</keycap> oder wählen Sie <guimenuitem>Zenit</guimenuitem> aus dem Menü <guimenu>Sichtrichtung</guimenu>). Der Zenit ist der Punkt am Himmel <quote>genau über Ihnen</quote> und er ist ein Punkt auf ihrem <link linkend="ai-meridian">lokalen Meridian</link>. Beachten Sie die Rektaszension des Zenits: Sie stimmt genau mit ihrer lokalen Sternenzeit überein.
