Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdeedu/kstars_darkmatter.po
Languages: de

source: <title>Dark Matter</title>
de: <title>Dunkle Materie</title>

source: <primary>Dark Matter</primary>
de: <primary>Dunkle Materie</primary>

source: Scientists are now quite comfortable with the idea that 90% of the mass in the universe is in a form of matter that cannot be seen.
de: Wissenschaftler sind sich mittlerweile sehr sicher, dass 90 % der Masse des Universums in einer Form vorliegen, die nicht sichtbar ist.

source: Despite comprehensive maps of the nearby universe that cover the spectrum from radio to gamma rays, we are only able to account of 10% of the mass that must be out there. As Bruce H. Margon, an astronomer at the University of Washington, told the New York Times in 2001: <quote>It's a fairly embarrassing situation to admit that we can't find 90 percent of the universe.</quote>
de: Trotz vielfältiger Karten des näheren Universums, die das Spektrum von Radio- bis zu den Gammastrahlen abdecken, können wir nur etwa 10 % der Masse erkennen, die dort draußen sein muss. Bruce H. Margon, ein Astronom an der Universität von Washington, berichtete 2001 in der New York Times: <quote>Es ist ein peinliche Situation, zuzugeben, dass wir 90 Prozent des Universums nicht finden können</quote>.

source: The term given this <quote>missing mass</quote> is <firstterm>Dark Matter</firstterm>, and those two words pretty well sum up everything we know about it at this point. We know there is <quote>Matter</quote>, because we can see the effects of its gravitational influence. However, the matter emits no detectable electromagnetic radiation at all, hence it is <quote>Dark</quote>. There exist several theories to account for the missing mass ranging from exotic subatomic particles, to a population of isolated black holes, to less exotic brown and white dwarfs. The term <quote>missing mass</quote> might be misleading, since the mass itself is not missing, just its light. But what is exactly dark matter and how do we really know it exists, if we cannot see it?
de: Der Name, der dieser <quote>fehlenden Masse</quote> gegeben wurde, ist <firstterm>Dunkle Materie</firstterm> und diese beiden Wörter fassen gutzusammen, was wir darüber wissen. Wir wissen, dass es <quote>Materie</quote> gibt, da wir die Wirkungen ihrer Gravitation sehen können. Jedoch sendet diese Materie messbare keine elektromagnetische Strahlung aus, ist also absolut <quote>dunkel</quote>. Es existieren mehrere Theorien, um das zu erklären, von exotischen subatomaren Partikeln über isolierte schwarze Löcher bis hin zu weniger exotischen braunen und weißen Zwergen. Der Begriff <quote>fehlende Masse</quote> kann missverständlich sein, da die Masse selbst nicht fehlt, nur ihr Licht. Aber was genau ist dunkle Materie und wie wissen wir, dass sie existiert, wenn wir sie nicht sehen können?

source: The story began in 1933 when Astronomer Fritz Zwicky was studying the motions of distant and massive clusters of galaxies, specifically the Coma cluster and the Virgo cluster. Zwicky estimated the mass of each galaxy in the cluster based on their luminosity, and added up all of the galaxy masses to get a total cluster mass. He then made a second, independent estimate of the cluster mass, based on measuring the spread in velocities of the individual galaxies in the cluster. To his suprise, this second <firstterm>dynamical mass</firstterm> estimate was <emphasis>400 times</emphasis> larger than the estimate based on the galaxy light.
de: Die Geschichte begann 1933, als der Astronom Fritz Zwicky die Bewegung von weit entfernten und massiven Galaxiehaufen untersuchte, insbesondere den Coma- und den Virgo-Sternhaufen. Zwicky errechnete die Masse jeder Galaxie im Haufen aufgrund ihrer Leuchtkraft und addierte alle Galaxiemassen zu einer Sternhaufenmasse. Dann machte er eine zweite unabhängige Bestimmung der Haufenmasse, die auf der Messung von Bewegungen der einzelnen Galaxien im Haufen beruht. Zu seiner Überraschung war diese zweite <firstterm>dynamische Masse </firstterm> <emphasis>400 Mal</emphasis> größer als die Masse aus der Lichtmessung.

source: Although the evidence was strong at Zwicky's time, it was not until the 1970s that scientists began to explore this discrepancy comprehensively. It was at this time that the existence of Dark Matter began to be taken seriously. The existence of such matter would not only resolve the mass deficit in galaxy clusters; it would also have far more reaching consequences for the evolution and fate of the universe itself.
de: Obwohl diee zu Zwickys Zeit wichtige Hinweise waren, dauerte es noch bis in die 70er Jahre als Wissenschaftler diesen Unterschied richtig beachteten. Zu dieser Zeit wurde die Existenz von dunkler Materie ernst genommen. Das Vorhandensein solcher Materie würde nicht nur den Massenunterschied in Galaxiehaufen erklären, es würde auch weitreichende Konsequenzen für die Evolution und der Bestimmung des Universums selbst haben.

source: Another phenomenon that suggested the need for dark matter is the rotational curves of <firstterm>Spiral Galaxies</firstterm>. Spiral Galaxies contain a large population of stars that orbit the Galactic center on nearly circular orbits, much like planets orbit a star. Like planetary orbits, stars with larger galactic orbits are expected to have slower orbital speeds (this is just a statement of Kepler's 3rd Law). Actually, Kepler's 3rd Law only applies to stars near the perimeter of a Spiral Galaxy, because it assumes the mass enclosed by the orbit to be constant.
de: Ein weiteres Phänomen zum Beweis der dunklen Materie sind die drehförmigen Kurven von <firstterm>Spiralgalaxien</firstterm>. Spiralgalaxien enthalten eine große Anzahl von Sternen, die das Galaxiezentrum in nahezu kreisförmigen Bahnen umlaufen, ungefähr so wie Planeten ihrem Stern. Wie Planetenbahnen haben Sterne mit größeren galaktischen Bahnen eine langsamere Eigendrehung (das ist einfach eine Aussage des 3. Keplerschen Gesetzes). Tatsächlich bezieht sich Keplers 3. Gesetz nur auf die Sterne nahe des Umfangs einer Spiralgalaxie, da es annimmt, dass die von der Bahn eingeschlossene Masse konstant ist.

source: However, astronomers have made observations of the orbital speeds of stars in the outer parts of a large number of spiral galaxies, and none of them follow Kepler's 3rd Law as expected. Instead of falling off at larger radii, the orbital speeds remain remarkably constant. The implication is that the mass enclosed by larger-radius orbits increases, even for stars that are apparently near the edge of the galaxy. While they are near the edge of the luminous part of the galaxy, the galaxy has a mass profile that apparently continues well beyond the regions occupied by stars.
de: Jedoch haben Astronomen Beobachtungen von Bahngeschwindigkeiten von Sternen in den äußeren Regionen von vielen Spiralgalaxien angestellt und keiner folgte, wie erwartet, dem 3. Keplerschen Gesetz. Stattdessen blieben die Bahngeschwindigkeiten konstant. Die Schlussfolgerung ist, dass die Masse, die von größeren Bahnen eingeschlossen ist, sich vergrößert., sogar bei Sternen, die sich scheinbar am Rand der Galaxie befinden. Während sie sich nahe dem Rand des leuchtenden Part der Galaxie befinden, hat die Galaxie ein Massenprofil, dass auch über die sichtbaren Teile der Galaxie hinweg existiert.

source: Here is another way to think about it: Consider the stars near the perimeter of a spiral galaxy, with typical observed orbital velocities of 200 kilometers per second. If the galaxy consisted of only the matter that we can see, these stars would very quickly fly off from the galaxy, because their orbital speeds are four times larger than the galaxy's escape velocity. Since galaxies are not seen to be spinning apart, there must be mass in the galaxy that we are not accounting for when we add up all the parts we can see.
de: Hier ist noch eine Möglichkeit, darüber zu nachzudenken: Nehmen Sie die Sterne nahe des Umfangs einer Spiralgalaxie, mit einer typischen, beobachteten Bahngeschwindigkeit von 200 Kilometern pro Sekunde. Wenn die Galaxie nur aus der Materie bestehen würde, die wir sehen, würden diese Sterne schnell aus der Galaxie fliegen, da die Bahngeschwindigkeiten vier Mal so groß wiedie Fluchtgeschwindigkeit der Galaxie sind. Da Galaxien nicht auseinanderfliegen, muss eine Masse in der Galaxie vorhanden sein. die wir nicht erfassen, wenn wir alle Teile, die wir sehen können, zusammenaddieren.

source: Several theories have surfaced in literature to account for the missing mass such as <acronym>WIMP</acronym>s (Weakly Interacting Massive Particles), <acronym>MACHO</acronym>s (MAssive Compact Halo Objects), primordial black holes, massive neutrinos, and others; each with their pros and cons. No single theory has yet been accepted by the astronomical community, because we so far lack the means to conclusively test one theory against the other.
de: Verschiedene Theorien sind in der Literatur zu der fehlenden Masse beschrieben wie <acronym>WIMP</acronym>s (Weakly Interacting Massive Particles) (dtsch. etwa: <quote>Schwach interagierende massive Partikel</quote>), <acronym>MACHO</acronym>s (MAssive Compact Halo Objects) (dtsch. etwa: <quote>Massive, kompakte Halo-Objekte</quote>), ursprünglich schwarze Löcher, massive Neutrinos und andere, jede mit Pros und Kontras. Bis jetzt wurde noch keine der Theorien von der astronomischen Gemeinschaft angenommen, da wir leider keine Mittel haben, sie zu überprüfen.

source: You can see the galaxy clusters that Professor Zwicky studied to discover Dark Matter. Use the &kstars; Find Object Window (<keycombo action="simul">&Ctrl;<keycap>F</keycap></keycombo>) to center on <quote>M 87</quote> to find the Virgo Cluster, and on <quote>NGC 4884</quote> to find the Coma Cluster. You may have to zoom in to see the galaxies. Note that the Virgo Cluster appears to be much larger on the sky. In reality, Coma is the larger cluster; it only appears smaller because it is further away.
de: Sie können die Galaxiehaufen sehen, die Professor Zwicky benutzt hat, um die dunkle Materie zu finden. Benutzen Sie das &kstars;-Fenster <quote>Objekt suchen</quote> (<keycombo action="simul"><keycap>&Ctrl;</keycap><keycap>F</keycap></keycombo>) um auf <quote>M 87</quote> zu zentrieren (der Virgo-Sternhaufen) und auf <quote>NGC 4884</quote>, um den Coma-Sternhaufen zu finden. Sie können dann die Ansicht vergrößern, um die Galaxien zu sehen. Beachten Sie, dass der Virgo-Sternhaufen viel größer erscheint, aber in Wirklichkeit viel kleiner als Coma ist. Coma ist nur weiter entfernt.
