Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdeedu/kstars_indi.po
Languages: de

source: Yes. We plan to support major CCD cameras and focusers and extend support for more telescopes. If you would like INDI to support a particular device, please send an email to <email>indi-devel@lists.sourceforge.net</email>
de: Ja. Wir planen wichtige CCD-Kameras und Fokussierer zu unterstützen und die Unterstützung für zusätzliche Teleskope zu erweitern. Falls INDI ein bestimmtes Gerät unterstützen soll, schreiben Sie bitte eine E-Mail an <email>indi-devel@lists.sourceforge.net</email>

source: What operations does &kstars; provide to control the telescope?
de: Welche Befehle gibt es, mit &kstars; ein Teleskop zu steuern?

source: It depends on the particular telescope you're running, but the minimum three operations are <command>Slew</command>, <command>Track</command>, and <command>Sync</command>, which you can issue directly from the sky map. Your telescope must be aligned for those operations to perform correctly. Some telescopes offer you more operations like site management, slew modes, focusing, parking, and more. You can access the telescopes extended features from the INDI Control Panel in the Devices Menu.
de: Das hängt von Ihrem Teleskop ab, es gibt aber mindestens die drei Befehle <command>Slew</command> (Bewegen), <command>Track</command> (Verfolgen) und <command>Sync</command> (Synchronisieren), , die Sie auch direkt von der Himmelskarte eingeben können. Ihr Teleskop muss für diese Befehle richtig ausgerichtet sein. Manche Teleskope bieten noch weitere Befehle wie Sitzungsverwaltung, mehrere Arten der Bewegung, Fokussieren, Parkstellungen und noch mehr. Diese zusätzlichen Befehle des Teleskops erreichen Sie über das INDI-Kontrollfeld im Menü Geräte.

source: Can I use &kstars; to do guiding?
de: Kann ich mit &kstars; automatische Nachführung benutzen?

source: Currently, there are no plans to support guiding in &kstars;. Users may utilize <ulink url="http://code.google.com/p/open-phd-guiding/">OpenPHD Guiding</ulink> as it is compatible with &kstars; and INDI.
de: Zurzeit wird diese Funktion in &kstars; nicht unterstützt. Verwenden Sie dazu <ulink url="http://code.google.com/p/open-phd-guiding/">OpenPHD Guiding</ulink>, das kompatibel mit &kstars; und INDI ist.

source: What's the difference between <command>Slew</command>, <command>Track</command>, and <command>Sync</command> exactly?
de: Was ist der Unterschied zwischen den Befehlen <command>Slew</command>, <command>Track</command>, und <command>Sync</command>?

source: The command <command>Slew</command> orders the telescope to move to a particular target, and once the telescope reaches its target, the telescope keeps tracking that target at a <emphasis>sidereal</emphasis> rate (i.e. the rate at which stars move across the sky). This works well for stars, Messier objects, and about everything outside our solar system. But solar system objects travel differently across the sky and so the telescope must <command>Track</command> the objects as they move.
de: Der Befehl <command>Slew</command> bewegt das Teleskop zu einem bestimmten Ziel. Wenn das Teleskop diese Ziel erreicht hat, verfolgt es das Ziel mit einer <emphasis>siderischen</emphasis> Geschwindigkeit (d. h. mit der Geschwindigkeit, mit der sich Sterne am Himmel bewegen). Dies führt zu guten Ergebnissen für Sterne, Messier-Objekte und alle Objekte außerhalb des Sonnensystems. Objekte innerhalb des Sonnensystems bewegen sich anders am Himmel, daher muss das Teleskop diese Objekte mit <command>Track</command> bei der Bewegung verfolgen.

source: Therefore, you need to issue a track command if you want to track an object with non-sidereal motion. On the other hand, <command>Sync</command> is used to synchronize the telescope's internal coordinates with that of an object you select.
de: Daher müssen Sie für alle Objekte mit nicht-siderischer Bewegung den Befehl Verfolgen benutzen. Hingegen synchronisieren Sie mit dem Befehl <command>Sync</command> die internen Koordinaten des Teleskops mit den Koordinaten des gewählten Objekts.

source: Can I control my telescope remotely?
de: Kann ich ein entferntes Teleskop steuern?

source: Yes. You can start an INDI server on the machine connected to your telescope and the server will listen to requests from &kstars; clients. Once you're connected, you can control your telescope directly from the sky map. This procedure is described in detail in the <link linkend="indi-remote-control">Remote device control</link> section.
de: Sie können einen INDI-Server auf einem Rechner starten, der mit Ihrem Teleskop verbunden ist, und der Server bearbeitet die Anfragen der &kstars;-Programme. Wenn die Verbindung hergestellt ist, können Sie Ihr Teleskop direkt von der Himmelskarte steuern. Diese Verfahren wird ausführlich im Kapitel <link linkend="indi-remote-control">Steuerung entfernter Geräte</link> beschrieben.

source: When I try to <guibutton>Connect</guibutton>, &kstars; reports that the telescope is not connected to the serial/USB port. What can I do?
de: Wenn mich zu <guibutton>verbinden</guibutton> versuche, meldet &kstars;, dass mein Teleskop nicht mit der seriellen/USB-Schnittstelle verbunden ist. Was kann ich tun?

source: This message is triggered when &kstars; cannot communicate with the telescope. Here are few things you can do:
de: Diese Nachricht wird von &kstars; ausgelöst, wenn nicht mit dem Teleskop kommuniziert werden konnte. Hier sind einige Dinge, die Sie tun können:

source: Check that you have both reading and writing permission for the port you are trying to connect to.
de: Überprüfen Sie, ob Sie sowohl Lese- als auch Schreibrecht für den Port haben, mit dem Sie eine Verbindung herstellen wollen.

source: Check the connection cable, make sure it is in good condition and test it with other applications.
de: Prüfen Sie das Verbindungskabel, stellen Sie sicher, dass es in einem guten Zustand ist und testen Sie es mit anderen Anwendungen.

source: Check your telescope power, make sure the power is on and that the telescope is getting enough power.
de: Prüfen Sie die Spannungsversorgung des Teleskops, stellen Sie sicher, dass es eingeschaltet ist und dass das Teleskop ausreichend versorgt ist.

source: Set the correct port in the <guilabel>INDI Control Panel</guilabel> under the <guimenu>Devices</guimenu> menu. The default device is <constant>/dev/ttyS0</constant>
de: Stellen Sie die richtige Schnittstelle im <guilabel>INDI-Kontrollfeld</guilabel> aus dem Menü <guimenu>Geräte</guimenu> ein. Die Standardschnittstelle ist <constant>/dev/ttyS0</constant>

source: Restart &kstars; and retry again.
de: Starten Sie &kstars; neu und versuchen Sie es erneut.

source: &kstars; reports that the telescope is online and ready, but I cannot find the telescope's crosshair, where is it?
de: &kstars; meldet, dass das Teleskop verbunden und bereit ist, aber ich kann das Fadenkreuz nicht finden. Wo ist es?

source: &kstars; retrieves the telescopes RA and DEC coordinates upon connection. If your alignment was performed correctly, then you should see the crosshair around your target in the Sky Map. However, the RA and DEC coordinates provided by the telescope may be incorrect (even below the horizon) and you need to <link linkend="indi-sync">Sync</link> your telescope to your current target. You can use the right-click menu to center and track the telescope crosshair in the sky map.
de: &kstars; erhält die Rekt/Dekl-Koordinaten des Teleskops beim Aufbau der Verbindung. Wenn die Ausrichtung korrekt ausgeführt wurde, sollten Sie das Fadenkreuz in der Nähe des Ziels auf der Himmelskarte sehen. Wenn jedoch die Rekt/Dekl-Koordinaten vom Teleskop falsch sind (vielleicht sogar unter dem Horizont) müssen Sie das Teleskop auf das aktuelle Ziel <link linkend="indi-sync">Synchronisieren</link>. Mit dem Kontextmenü der rechten Maustaste können Sie das Fadenkreuz des Teleskops auf der Himmelskarte zentrieren und verschieben.

source: The telescope is moving erratically or not moving at all. What can I do?
de: Das Teleskop bewegt sich nicht flüssig oder bewegt sich überhaupt nicht. Was kann ich tun?

source: This behavior is mostly due to incorrect settings, please verify the following check list:
de: Dieses Verhalten beruht meistens auf falschen Einstellungen, bitte prüfen Sie folgende Stichwortliste:

source: Is the telescope aligned?
de: Ist das Teleskop ausgerichtet?

source: Is the telescope alignment mode correct? Use <guilabel>INDI Control Panel</guilabel> to check and change these settings (<constant>Alt/Az,Polar, Land</constant>).
de: Ist die Ausrichtungsmethode korrekt? Benutzen Sie das <guilabel>INDI-Kontrollfeld</guilabel> um diese Einstellungen zu überprüfen oder zu verändern (<constant>Alt/Az, Polar, Land</constant>).

source: Are the telescope's time and date settings correct?
de: Ist die Zeit und das Datum des Teleskops korrekt?

source: Are the telescope's longitude and latitude settings correct?
de: Sind die Einstellungen für Längen- und Breitengrad des Teleskop-Standortes korrekt?

source: Is the telescope's UTC offset correct?
de: Ist die UTC-Einstellung des Teleskops korrekt?

source: Are the telescope's RA and DEC axis locked firmly?
de: Sind die Teleskopachsen für Rekt und Dekl ordentlich geschlossen?

source: Is the telescope's N/S switch (when applicable) setup correctly for your hemisphere?
de: Ist die Einstellung des N/S-Schalters des Teleskops für die Erdhalbkugel (falls vorhanden) richtig?

source: Is the cable between the telescope and computer in good condition?
de: Ist das Kabel zwischen dem Teleskop und dem Rechner in Ordnung?

source: If you think all settings are correct but the telescope still moves erratically or not at all, then please send a report to <email>indi-devel@lists.sourceforge.net</email>
de: Wenn Sie denken, dass alle Einstellungen richtig sind, aber Ihr Teleskop sich immer noch unstet bewegt oder überhaupt nicht, senden Sie bitte einen Bericht an <email>indi-devel@lists.sourceforge.net</email>
