Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdeedu/kstars_indi.po
Languages: de

source: If you have more complex capturing requirements and conditions to fulfil, it is recommended to create a script to meet your specific needs using the <link linkend="tool-scriptbuilder">Script Builder</link> tool in the <guimenu>Tools</guimenu> menu.
de: Wenn Sie zusätzliche Anforderungen an die Aufnahmesequenz haben, sollten Sie mit dem <link linkend="tool-scriptbuilder">Skriptbaukasten</link> im Menü <guimenu>Extras</guimenu> ein Skript für Ihre besonderen Anforderungen erstellen.

source: Configure INDI
de: INDI einrichten

source: Configure
de: Einrichtung

source: The INDI page allows you to modify <emphasis>Client side</emphasis> INDI specific options. The window is divided into several main categories: General, Automatic device updates, Display, Update Source, Filter Wheel and Server Port:
de: Auf der Seite <quote>INDI</quote> können Sie die <emphasis>Klient-Seite</emphasis> der Optionen für INDI einrichten. Der Dialog ist in mehrere Bereiche eingeteilt: Allgemein, Automatische Geräteaktualisierung, Anzeige, Quelle aktualisieren, Filterrrad und Server-Port:

source: General
de: Allgemein

source: <option>Default FITS directory:</option> Specify the directory where all captured FITS images will be saved to. If no directory is specified, images will be stored in $HOME.
de: <option>FITS-Standardordner:</option> Geben Sie hier den Ordner an, in dem alle aufgenommenen Bilder gespeichert werden. Wenn Sie keinen Ordner angeben, werden die Bilder im Persönlichen Ordner gespeichert.

source: <option>Telescope port:</option> The default telescope port. When you connect to a local or remote telescope service, &kstars; will automatically fill the telescope's device port with the specified default port.
de: <option>Teleskop-Anschluss:</option>. Der Standardport für das Teleskop. Wenn Sie einem lokales oder entferntes Teleskop anschließen, verbindet &kstars; automatisch die Geräteport des Teleskops mit dem angegebenen Standardport.

source: <option>Video port:</option> The default video port. When you connect to a local or remote video service, &kstars; will automatically fill the webcam's device port with the specified default port.
de: <option>Video-Anschluss:</option> Der Standard-Videoport. Wenn Sie einem lokales oder entferntes Videogerät anschließen, verbindet &kstars; automatisch die Port des Gerätes mit dem angegebenen Standardport.

source: Automatic device updates
de: Automatische Geräteaktualisierung

source: <option>Time:</option> Update the telescope's date and time, if supported, upon connection.
de: <option>Zeit:</option> Stellt Zeit und Datum des Teleskops beim Aufbau der Verbindung ein, wenn dies vom Gerät unterstützt wird.

source: <option>Geographic location:</option> Update the telescope's geographical location information (current longitude and latitude), if supported, upon connection.
de: <option>Geografischer Standort:</option> Stellt den Standort des Teleskops (Längen- und Breitengrad) beim Aufbau der Verbindung ein, wenn dies vom Gerät unterstützt wird.

source: Display
de: Anzeige

source: <option>Device target crosshair:</option> When checked, &kstars; displays the telescope's target crosshair on the sky map. The crosshair is displayed upon a successful connection to the telescope and its location is updated periodically. The telescope's name is displayed next to the crosshair. &kstars; displays one crosshair per each connected telescope. To change the color of the telescope's crosshair, open the <link linkend="viewops">Configure &kstars;</link> window. Select the <guilabel>Colors</guilabel> tab, and then change the color of the <emphasis>Target Indicator</emphasis> item to the desired color.
de: <option>Gerätezielkreuz:</option> Mit dieser Einstellung zeigt &kstars; das Zielkreuz des Teleskops auf der Himmelskarte. Das Zielkreuz wird nur bei erfolgreicher Verbindung mit dem Teleskop angezeigt und nachgeführt. Der Name des Teleskops wird neben dem Zielkreuz angezeigt, aber nur ein Zielkreuz für jedes angeschlossene Teleskop. Um die Farbe des Zielkreuzes zu ändern, öffnen Sie den Dialog <link linkend="viewops">&kstars; einrichten</link>. Ändern Sie die Farbe des <emphasis>Zielindikator</emphasis>s auf der Seite <guilabel>Farben</guilabel>.

source: <option>INDI messages in status bar:</option> When checked, &kstars; displays INDI status messages in the &kstars; status bar.
de: <option>INDI Nachrichten in der Statuszeile:</option> Wenn Sie diese Einstellung auswählen, werden alle INDI-Nachrichten in der Statuszeile angezeigt.

source: <option>Automatic Display of FITS upon capture:</option> When checked, &kstars; will display captured FITS in &kstars; <link linkend="tool-fitsviewer">FITS Viewer</link> tool. If you use the <link linkend="indi-capture">Capture Image Sequence</link> tool, all captured images will be saved to disk regardless of this option.
de: <option>Automatische Anzeige von FITS :</option> Mit dieser Einstellung zeigt &kstars; aufgenommenen Bilder im <link linkend="tool-fitsviewer">FITS-Betrachter</link>. Wenn Sie die <link linkend="indi-capture">Bildsequenzaufnahme</link> verwenden, werden alle Bilder unabhängig von dieser Einstellung gespeichert.

source: Update Source: Synchronize &kstars; according to either the computer or device time and location settings.
de: Quelle aktualisieren: Zeit und Ort entweder zum Rechner oder zum Gerät abgleichen.

source: Filter Wheel: Assign color codes to the filter wheel slots (e.g. Slot #0 Red, Slot #1 Blue..etc). You can assign color codes for up to 10 filter slots (0 to 9). To assign a color code, select a slot number from the drop down combo box, and then type the corresponding color code in the edit field. Repeat the process for all desired slots and then press OK.
de: Filterrad: Weisen Sie den Filterschlitzen Farbwerte zu (&eg; Schlitz Nr. 0 Rot, Schlitz Nr. 1 Blau &etc;). Sie können Farbwerte für bis zu 10 (0 bis9) Filterschlitze eingeben. Wählen Sie dazu eine Filterschlitznummer aus dem Auswahlfeld und tragen Sie den zugehörigen Farbwert ins Eingabefeld ein. Wiederholen Sie diesen Vorgang für alle gewünschten Schlitze und drücken Sie dann den Knopf OK.

source: Server Port: Specify range of ports that INDI Server will bind to when starting new drivers.
de: Server-Port: Bestimmt einen Portbereich, auf denen der INDI-Server lauschen soll, wenn neue Treiber gestartet werden

source: INDI Concepts
de: INDI-Konzepte

source: Telescope Control
de: Teleskopsteuerung

source: Concepts
de: Konzepte

source: The main key concept in INDI is that devices have the ability to describe themselves. This is accomplished by using XML to describe a generic hierarchy that can represent both canonical and non-canonical devices. In INDI, all <emphasis>devices</emphasis> may contain one or more <emphasis>properties</emphasis>. Any <emphasis>property</emphasis> may contain one or more <emphasis>elements</emphasis>. There are four types of INDI properties:
de: Das wichtigste Konzept in INDI ist die Fähigkeit von Geräten, ihre Eigenschaften selbst zu beschreiben. Dies ist möglich durch die Verwendung von XML zur Beschreibung einer allgemeinen Rangordnung von üblichen und besonderen Geräten. In INDi können alle <emphasis>Geräte</emphasis> eine oder mehrere <emphasis>Eigenschaften</emphasis> haben. Jede <emphasis>Eigenschaft</emphasis> kann auch aus mehr als einem <emphasis>Element</emphasis> bestehen.Es gibt vier Arten von INDI-Eigenschaften:

source: Text property.
de: Texteigenschaft.

source: Number property.
de: Zahleigenschaft.

source: Switch property (Represented in GUI by buttons and checkboxes).
de: Schaltereigenschaft (In der Programmoberfläche als Knöpfe und Ankreuzfelder dargestellt).

source: Light property (Represented in GUI by colored LEDs).
de: Lichteigenschaft (In der Programmoberfläche als beleuchtete LEDs dargestellt).

source: For example, all INDI devices share the CONNECTION standard switch <emphasis>property</emphasis>. The CONNECTION property has two elements: CONNECT and DISCONNECT switches. &kstars; parses the generic XML description of properties and builds a GUI representation suitable for direct human interaction.
de: Alle INDI-Geräte haben zum Beispiel gemeinsam den Standardschalter <emphasis>Eigenschaft</emphasis> einer CONNECTION. Diese Eigenschaft hat zwei Elemente: Die Schalter CONNECT und DISCONNECT. &kstars; liest die allgemeine XML-Beschreibung der Eigenschaften und erstellt daraus einen Dialog für die direkte Bearbeitung durch die Benutzer.

source: The INDI control panel offers many device properties not accessible from the sky map. The properties offered differ from one device to another. Nevertheless, all properties share common features that constrains how they are displayed and used:
de: Das INDI-Kontrollfeld bietet viele Geräteeigenschaften, die nicht von der Himmelskarte aus erreichbar sind. Die Eigenschaften unterscheiden sich von Gerät zu Gerät. Nichtsdestotrotz haben alle gemeinsame Funktionen, die standardisiert angezeigt werden und benutzt werden können:

source: Permission: All properties can either be read-only, write-only, or read and write enabled. An example of a read-write property is the telescope's Right Ascension. You can enter a new Right Ascension and the telescope, based on current settings, will either slew or sync to the new input. Furthermore, when the telescope slews, its Right Ascension gets updated and sent back to the client.
de: Berechtigung: Alle Eigenschaften können entweder lesbar, schreibbar oder lesbar und schreibbar sein. Ein Beispiel einer Schreib-Lese-Eigenschaft ist die Rektaszension des Teleskops. Sie können eine neue Rektaszension eingeben und das Teleskop wird sich, basierend auf den aktuellen Einstellungen, auf die neue Eingabe bewegen oder synchronisieren. Daneben wird jedoch auch die Rektaszension aktualisiert, wenn sich das Teleskop bewegt und zum Client gesendet.

source: State: Prefixed to each property is a state indicator (round LED). Each property has a state and an associated color code:
de: Status: Vor jeder Eigenschaft befindet sich ein Statusindikator (runde Leuchtdiode). Jede Eigenschaft hat einen Status und eine dazugehörige Farbe:

source: INDI State color code
de: INDI-Statusfarben

source: State
de: Status

source: Color
de: Farbe

source: Description
de: Beschreibung

source: Idle
de: Leerlauf

source: Gray
de: Grau

source: Device is performing no action with respect to this property
de: Das Gerät vollführt keine Aktion für diese Eigenschaft

source: Green
de: Grün

source: Last operation performed on this property was successful and active
de: Die letzte Operation mit dieser Eigenschaft war erfolgreich und aktiv

source: Busy
de: Beschäftigt

source: Yellow
de: Gelb

source: The property is performing an action
de: Die Eigenschaft vollführt gerade eine Aktion

source: Alert
de: Warnung

source: The property is in critical condition and needs immediate attention
de: Die Eigenschaft ist in einem kritischen Zustand und braucht sofortige Aufmerksamkeit

source: The device driver updates the property state in real-time when necessary. For example, if the telescope is in the process of slewing to a target, then the RA/DEC properties will be signaled as <guilabel>Busy</guilabel>. When the slew process is completed successfully, the properties will be signaled as <guilabel>Ok</guilabel>.
de: Der Gerätetreiber aktualisiert den Eigenschaftenstatus in Echtzeit, sofern notwendig. Wenn das Teleskop zum Beispiel zu einem Ziel bewegt wird, dann werden die Rekt/Dekl-Koordinaten als <guilabel>Beschäftigt</guilabel> angezeigt. Wenn der Prozess erfolgreich beendet wurde, zeigen die Eigenschaften <guilabel>Ok</guilabel>.

source: Context: Numerical properties can accept and process numbers in two formats: decimal and sexagesimal. The sexagesimal format is convenient when expressing time or equatorial/geographical coordinates. You can use any format at your convenience. For example, all the following numbers are equal:
de: Kontext: Numerische Eigenschaften können Zahlen in zwei Formaten akzeptieren: Dezimal und Sexagesimal. Das sexagesimale Format ist bequem, um die Zeit oder äquatoriale/geografische Koordinaten anzugeben. Sie können jedes Format beliebig verwenden. Zum Beispiel sind alle folgenden Zahlen gleich:

source: Time: The standard time for all INDI-related communications is Universal Time UTC specified as YYYY-MM-DDTHH:MM:SS in accord with ISO 8601. &kstars; communicates the correct UTC time with device drivers automatically. You can enable/disable automatic time updates from the <guimenuitem>INDI</guimenuitem> page in the settings dialog.
de: Zeit: Die Standardzeit für alle INDI-bezogenen Kommunikationen ist die Universalzeit UTC, die nach ISO 8601 als YYYY-MM-DDTHH:MM:SS angegeben wird. &kstars; gibt den Geräte automatisch die richtige UTC-Zeit. Sie können die automatischen Zeitaktualisierungen auf der Seite <guimenuitem>INDI</guimenuitem> im Einrichtungsdialog ausschalten.

source: Remote Device Control
de: Steuerung entfernter Geräte

source: Remote Devices
de: Entfernte Geräte

source: &kstars; provides a simple yet powerful layer for remote device control. A detailed description of the layer is described in the INDI <ulink url="http://www.clearskyinstitute.com/INDI/INDI.pdf">white paper</ulink>.
de: &kstars; bietet eine einfache Schnittstelle zur Steuerung entfernter Geräte. Eine ausführliche Beschreibung der Schnittstelle können Sie in diesem <ulink url="http://www.clearskyinstitute.com/INDI/INDI.pdf">Dokument zu INDI</ulink> finden.

source: You need to configure both the server and client machines for remote control:
de: Sie müssen sowohl den Server- als auch den Client-Rechner für die Fernsteuerung einrichten:

source: Server: To prepare a device for remote control, follow the same steps in the <link linkend="indi-kstars-setup">local/server</link> setup. When you start a device service in the <guimenu>Device Manager</guimenu>, a port number is displayed under the <guilabel>Listening port</guilabel> column. In addition to the port number, you also need the hostname or IP address of your server.
de: Server: Um ein Gerät für die Fernsteuerung vorzubereiten, folgen Sie denselben Schritten wie in der <link linkend="indi-kstars-setup">Einrichtung für lokale Geräte</link>. Wenn Sie einen Gerätedienst im <guimenu>Gerätemanager</guimenu> starten, wird eine Portnummer in der Spalte <guilabel>Benutzter Port</guilabel> angezeigt. Zusätzlich zu der Portnummer brauchen Sie noch den Rechnernamen oder die IP-Adresse Ihres Servers.

source: Client: Select the <guimenuitem>Device Manager</guimenuitem> from the <guimenu>Device</guimenu> menu and click on the <guilabel>Client</guilabel> tab. You can add, modify, or delete hosts under the <guilabel>Client</guilabel> tab. Add a host by clicking on the <guibutton>Add</guibutton> button. Enter the hostname/IP address of the server in the <guilabel>Host</guilabel> field, and enter the port number obtained from the <emphasis>server</emphasis> machine in step 1.
de: Client: Wählen Sie den <guimenuitem>Gerätemanager</guimenuitem> aus dem Menü <guimenu>Geräte</guimenu> und klicken auf die Karteikarte <guilabel>Client</guilabel>. Sie können hier Rechner hinzufügen, bearbeiten und löschen. Mit dem Knopf <guibutton>Hinzufügen</guibutton> fügen Sie einen Rechner ein. Geben Sie den Rechnernamen bzw. die IP-Adresse des Servers in das Feld <guilabel>Rechner</guilabel> ein und geben Sie die Portnummer des <emphasis>Server</emphasis> aus Schritt 1 in das Feld darunter ein.

source: After you add a host, right click on the host to <guimenuitem>Connect</guimenuitem> or <guimenuitem>Disconnect</guimenuitem>. If a connection is established, you can control the telescope from the <guilabel>Sky map</guilabel> or <guilabel>INDI Control Panel</guilabel> exactly as described in the <link linkend="indi-kstars-setup">local/server</link> section. It is as easy at that.
de: Nachdem Sie einen Server hinzugefügt haben, klicken Sie mit der rechten Maustaste darauf, um zu <guimenuitem>Verbinden</guimenuitem> oder die <guimenuitem>Verbindung zu trennen</guimenuitem>. Wenn eine Verbindung hergestellt wurde, können Sie das Teleskop von der <guilabel>Himmelskarte</guilabel> oder aus dem <guilabel>INDI-Kontrollfeld</guilabel> steuern, wie es im Abschnitt <link linkend="indi-kstars-setup">Lokal/Server</link> beschrieben ist. Es ist wirklich sehr einfach!

source: Running an INDI server from the command line
de: Einen INDI-Server von der Befehlszeile starten

source: While &kstars; allows you to easily deploy an INDI server; you can launch an INDI server from the command line.
de: Während Sie in &kstars; einfach einen INDI-Server bereitstellen können, lässt sich ein INDI-Server auch von der Befehlszeile aus starten.

source: Since INDI is an independent backend component, you can run an INDI server on a host without &kstars;. INDI can be compiled separately to run on remote hosts. Furthermore, device drivers log messages to <constant>stderr</constant> and that can be helpful in a debugging situation. The syntax for INDI server is as following:
de: Da INDI eine unabhängige Hintergrundkomponente ist, können Sie einen INDI-Server auf einem Rechner ohne &kstars; starten. INDI kann getrennt kompiliert werden, um auf entfernten Rechnern laufen zu können. Weiterhin schreiben die Gerätetreiber Ihre Protokollnachrichten nach <constant>stderr</constant> und das kann für eine Fehlerbehebung hilfreich sein. Die Syntax für den INDI-Server ist wie folgt:

source: $ <command>indiserver</command> [options] [<filename>driver</filename> ...]
de: $ <command>indiserver</command> [optionen] [<filename>treiber</filename> ...]

source: Options:
de: Optionen:

source: -l d : log driver messages to d/YYYY-MM-DD.islog
de: -l d : Treibermeldungen in d/JJJJ-MM-TT.islog protokollieren

source: -m m : kill client if gets more than this many MB behind, default 10
de: -m m : Client beenden, wenn er mehr als diese Anzahl MB hinterherhinkt. Voreinstellung ist 10

source: -p p : alternate IP port, default 7624
de: -p p : anderer IP-Port, Standard ist 7624

source: -v : show key events, no traffic
de: -v : Schlüsselereignisse anzeigen, kein Datenverkehr

source: -vv : -v + key message content
de: -vv : -v + Inhalt von Schlüsselnachrichten

source: -vvv : -vv + complete xml
de: -vvv : -vv + vollständiges xml

source: driver : executable or device@host[:port]
de: driver : Ausführbare Datei oder device@host[:port]

source: For example, if you want to start an INDI server running an LX200 GPS driver and listening to connections on port 8000, you would run the following command:
de: Wenn Sie zum Beispiel einen INDI-Server für einen LX200 GPS-Treiber starten wollen, der auf Verbindungen am Port 8000 wartet, müssen Sie folgenden Befehl ausführen:

source: Secure Remote Operation
de: Sichere entfernte Ausführung

source: Suppose we want to run an indiserver with INDI drivers on a remote host, <constant>remote_host</constant>, and connect them to &kstars; running on the local machine.
de: Nehmen wir an, sie wollen einen INDI-Server und seine Clients auf einem entfernten Rechner namens <constant>entfernter_Rechner</constant> benutzen und sich mit &kstars; verbinden, das auf dem lokalen Rechner läuft.

source: From the local machine log onto the remote host, <constant>remote_host</constant>, by typing:
de: Vom lokalen Rechner melden Sie sich auf dem entfernten Rechner <constant>entfernter_rechner</constant> mit folgendem Befehl an:

source: $ <command>ssh</command> -L <varname>local_port</varname>:<constant>remote_host</constant>:<varname>remote_port</varname>
de: $ <command>ssh</command> -L <varname>lokaler_port</varname>:<constant>entfernter_rechner</constant>: <varname>entfernter_port</varname>

source: This binds the <varname>local_port</varname> on the local machine to the <varname>remote_port</varname> on the <constant>remote_host</constant>. After logging in, run indiserver on the remote host:
de: Mit diesem Befehl verbinden Sie den <varname>local_port</varname> des lokalen Rechners mit dem <varname>remote_port</varname> des entfernten Rechners. Nach der Anmeldung starten Sie den INDI_Server auf dem entfernten Rechner:

source: $ <command>indiserver</command> -p <varname>remote_port</varname> [<filename>driver</filename>...]
de: $ <command>indiserver</command> -p <varname>entfernter_port</varname> [<filename>treiber</filename> ...]

source: Back on the local machine, start &kstars; then open the <guimenuitem>Device Manager</guimenuitem> and add a host under the <guilabel>Client</guilabel> tab. The host should be the local host (usually 127.0.0.1) and the port number should be the <varname>local_port</varname> used in the steps above. <mousebutton>Right</mousebutton>-click on the host and select <guimenuitem>Connect</guimenuitem> from the popup menu. &kstars; will connect to the remote INDI server securely. The host information will be saved for future sessions.
de: Zurück am lokalen Rechner starten Sie &kstars;, öffnen den <guimenuitem>Gerätemanager</guimenuitem> und fügen einen Rechner auf der Karteikarte <guilabel>Client</guilabel> hinzu. Als Rechner sollten Sie den lokalen Rechner (normalerweise 127.0.0.1) und als Portnummer <varname>lokaler_port</varname> aus den vorherigen Abschnitten eintragen. Klicken Sie mit der <mousebutton>rechten</mousebutton> Maustaste auf den Rechner und wählen Sie <guimenuitem>Verbinden</guimenuitem> aus dem Kontextmenü. &kstars; verbindet sich dann mit dem INDI-Server über eine sichere Verbindung. Die Serverinformationen werden für spätere Sitzungen gespeichert.

source: INDI Frequently Asked Questions
de: Häufig gestellte Fragen zu INDI

source: What is INDI?
de: Was ist INDI?

source: <acronym>INDI</acronym> is the <ulink url="http://indi.sourceforge.net"> Instrument-Neutral-Distributed-Interface</ulink> control protocol developed by <author><firstname>Elwood</firstname><surname>C. Downey</surname></author> of <ulink url="http://www.clearskyinstitute.com/">ClearSky Institute</ulink>. &kstars; employs device drivers that are compatible with the INDI protocol. INDI has many advantages including loose coupling between hardware devices and software drivers. Clients that use the device drivers (like &kstars;) are completely unaware of the device capabilities. In run time, &kstars; communicates with the device drivers and builds a completely dynamical GUI based on services provided by the device. Therefore, new device drivers can be written or updated and &kstars; can take full advantage of them without any changes on the client side.
de: <acronym>INDI</acronym> ist das <ulink url="http://indi.sourceforge.net">Instrument-Neutral-Distributed-Interface</ulink> (Deutsch etwa: Instrumentneutrale verteilte Schnittstelle) Kontrollprotokoll entwickelt von <author><firstname>Elwood</firstname> <surname>C. Downey</surname></author> vom <ulink url="http://www.clearskyinstitute.com/">ClearSky-Institut</ulink>. &kstars; enthält Gerätetreiber, die mit dem INDI-Protokoll kompatibel sind. INDI hat viele Vorteile einschließlich der lockeren Verbindung zwischen Hardwaregeräten und Softwaretreibern. Clients, die die Gerätetreiber benutzen (wie &kstars;) haben keine Ahnung von den Fähigkeiten der Geräte. Zur Laufzeit kommuniziert &kstars; mit den Gerätetreibern und erstellt eine komplett dynamische Oberfläche mit den Funktionen, die das Gerät bietet. Deshalb können neue Gerätetreiber geschrieben oder aktualisiert werden und &kstars; kann sie ohne Änderungen auf der Clientseite übernehmen.

source: Do you plan to support more devices?
de: Ist die Unterstützung für weitere Geräte in Planung?
