Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdeedu/kstars_commands.po
Languages: de

source: Open the <guilabel>Get Hot New Stuff</guilabel> dialog to download additional data for &kstars;.
de: Öffnet den Dialog <guilabel>„Neue Erweiterungen“ herunterladen</guilabel>, um zusätzliche Daten für &kstars; zu bekommen.

source: <guimenu>Data</guimenu> <guisubmenu>Updates</guisubmenu>
de: <guimenu>Daten</guimenu><guisubmenu>Aktualisierungen</guisubmenu>

source: This submenu can be used to update various object data, namely asteroid and comet orbit elements as well as recent supernovae data from internet. The data will be downloaded for the current user account only. If you use &kstars; from different account you should download them for every account separately.
de: In diesem Untermenü können Daten von mehrere Objektarten aktualisiert aus dem Internet werden, unter anderem Asteroiden, Bahnelemnte von Kometen und Daten jüngster Supernovae. Die Daten werden nur für den aktuellen Benutzer heruntergeladen. Daher sollten diese Daten für alle Benutzer getrennt für &kstars; heruntergeladen werden.

source: &kstars; tries to download recent supernovae list automatically by default. You can switch the download off using <guilabel>Supernovae</guilabel> page of &kstars; Settings window.
de: &kstars; versucht in der Voreinstellung eine Liste der jüngsten Supernovae automatisch herunterladen. Dies Verhalten können Sie auf der Seite <guilabel>Supernovae</guilabel> im Einrichtungsdialog von &kstars; abschalten.

source: Observation Menu
de: Menü Beobachtung

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>L</keycap></keycombo> </shortcut> <guimenu>Observation</guimenu> <guimenuitem>Observation Planner</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>L</keycap></keycombo> </shortcut> <guimenu>Beobachtung</guimenu> <guimenuitem>Beobachtungsliste ...</guimenuitem>

source: Open the <link linkend="tool-obsplanner">Observation Planner</link> tool
de: Öffnet die <link linkend="tool-obsplanner">Beobachtungsliste</link>

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>2</keycap></keycombo> </shortcut> <guimenu>Observation</guimenu> <guimenuitem>Execute the session Plan</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>2</keycap></keycombo></shortcut><guimenu>Beobachtung</guimenu><guimenuitem>Sitzungsplan ausführen</guimenuitem>

source: Opens <link linkend="tool-obsplanner">session plan wizard</link> or execute the planned session.
de: Öffnet den <link linkend="tool-obsplanner">Assistenten zur Planung von Sitzungen</link> oder führt eine geplante Sitzung aus.

source: Settings Menu
de: Menü Einstellungen

source: <guimenu>Settings</guimenu> <guisubmenu>Info Boxes</guisubmenu> <guimenuitem>Show Info Boxes</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guisubmenu>Infoboxen</guisubmenu> <guimenuitem>Infoboxen anzeigen</guimenuitem>

source: Toggle display of all three Info Boxes
de: Schaltet die Anzeige von allen drei Infoboxen an bzw. aus

source: <guimenu>Settings</guimenu> <guisubmenu>Info Boxes</guisubmenu> <guimenuitem>Show Time Box</guimenuitem>
de: <guimenu>Einstellungen </guimenu> <guisubmenu>Infoboxen</guisubmenu><guimenuitem>Zeitinfo anzeigen</guimenuitem>

source: Toggle display of the Time Info Box
de: Schaltet die Zeitinfobox an/aus

source: <guimenu>Settings</guimenu> <guisubmenu>Info Boxes</guisubmenu> <guimenuitem>Show Focus Box</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guisubmenu>Infoboxen</guisubmenu> <guimenuitem>Fokusinfo anzeigen</guimenuitem>

source: Toggle display of the Focus Info Box
de: Schaltet die Anzeige der Fokusinfobox an/aus

source: <guimenu>Settings</guimenu> <guisubmenu>Info Boxes</guisubmenu> <guimenuitem>Show Location Box</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guisubmenu>Infoboxen</guisubmenu> <guimenuitem>Standortinfo anzeigen</guimenuitem>

source: Toggle display of the Location Info Box
de: Schaltet die Anzeige der Standort-Infobox an/aus

source: <guimenu>Settings</guimenu> <guisubmenu>Toolbars Shown</guisubmenu>
de: <guimenu>Einstellungen</guimenu><guisubmenu>Angezeigte Werkzeugleisten</guisubmenu>

source: Toggle display of the Main and View Toolbar
de: Schaltet die Anzeige der Haupt- und Ansichtswerkzeugleiste an und aus

source: <guimenu>Settings</guimenu> <guisubmenu>Statusbar</guisubmenu> <guimenuitem>Show Statusbar</guimenuitem>
de: <guimenu>Einstellungen</guimenu><guisubmenu>Statusleiste</guisubmenu> <guimenuitem>Statusleiste anzeigen</guimenuitem>

source: Toggle display of the Statusbar
de: Schaltet die Anzeige der Statusleiste an/aus

source: <guimenu>Settings</guimenu> <guisubmenu>Statusbar</guisubmenu> <guimenuitem>Show Az/Alt Field</guimenuitem>
de: <guimenu>Einstellungen</guimenu><guisubmenu>Statusleiste</guisubmenu> <guimenuitem>Feld Az/Hö zeigen</guimenuitem>

source: Toggle display of the mouse cursor's horizontal coordinates in the statusbar
de: Schaltet die Anzeige der horizontalen Koordinaten des Mauszeigers in der Statusleiste ein und aus.

source: <guimenu>Settings</guimenu> <guisubmenu>Statusbar</guisubmenu> <guimenuitem>Show RA/Dec Field</guimenuitem>
de: <guimenu>Einstellungen</guimenu><guisubmenu>Statusleiste</guisubmenu> <guimenuitem>Feld Rekt/Dekl zeigen</guimenuitem>

source: <guimenu>Settings</guimenu> <guisubmenu>Color Schemes</guisubmenu>
de: <guimenu>Einstellungen</guimenu><guisubmenu>Farbschemata</guisubmenu>

source: This submenu contains all of the defined color schemes, including your custom schemes. Select any item to set that color scheme.
de: Dieses Untermenü enthält alle definierten Farbschemata, einschließlich Ihrer eigenen. Wählen Sie einen Eintrag, um dieses Schema zu benutzen.

source: <guimenu>Settings</guimenu> <guisubmenu>FOV Symbols</guisubmenu>
de: <guimenu>Einstellungen</guimenu> <guisubmenu>STF-Symbole</guisubmenu>

source: This submenu lists the available field-of-view (FOV) Symbols. The FOV Symbol is drawn at the center of the display. You may choose from the list of predefined symbols (No symbol, 7x35 Binoculars, One degree, or HST WFPC2), or you may define your own symbols (or modify existing symbols) using the <guimenuitem>Edit FOV Symbols...</guimenuitem> item.
de: Dieses Untermenü listet alle verfügbaren Sichtfeld-Symbole (STF) auf. Das STF-Symbol wird in die Mitte der Anzeige gezeichnet. Sie können aus einer Liste von vordefinierten Symbolen wählen (Kein Symbol, 7x35 Binoculars, Ein Grad oder HST WFPC2) oder Sie können mit dem Eintrag <guimenuitem>STF-Symbole bearbeiten ...</guimenuitem>Ihre eigenen Symbole definieren (oder vorhandene Symbole bearbeiten).

source: <guimenu>Settings</guimenu> <guimenuitem>Switch to OpenGL/QPainter backend</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>Zu OpenGL-Treiber wechseln</guimenuitem>

source: &kstars; has an experimental <ulink url="https://en.wikipedia.org/wiki/OpenGL">OpenGL</ulink> support. The corresponding backend works much faster on machines with hardware acceleration. Switch back to QPainter backend (default) if you experience troubles with OpenGL backend.
de: &kstars;hat eine experimentelle Unterstützung für <ulink url="https://de.wikipedia.org/wiki/OpenGL">OpenGL</ulink>. Das zugehörige Backend funktioniert auf Rechnern mit Hardware-Beschleunigung viel schneller. Haben Sie Probleme mit OpenGL, wechseln Sie zurück zum QPainter-Backend.

source: In the current version, infoboxes do not work correctly when using OpenGL backend. So they will be disabled.
de: In der aktuellen Version funktioniert die Anzeige der Infoboxen mit OpenGL nicht korrekt, daher werden sie abgeschaltet.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>0</keycap></keycombo> </shortcut> <guimenu>Settings</guimenu> <guimenuitem>Define Equipment...</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>=</keycap></keycombo> </shortcut><guimenu>Einstellungen</guimenu><guimenuitem>Ausrüstung definieren ...</guimenuitem>

source: Allows you to define equipment (telescope, eyepiece, lens and filter) characteristics for observation logs.
de: Ermöglicht es Ihnen, Ihre Ausrüstung (Teleskop, Okular, Linsen und Filter) für Beobachtungsprotokolle zu definieren.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>1</keycap></keycombo> </shortcut> <guimenu>Settings</guimenu> <guimenuitem>Add Observer...</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>1</keycap></keycombo> </shortcut><guimenu>Einstellungen</guimenu><guimenuitem>Beobachter hinzufügen ...</guimenuitem>

source: Can be used to add a new observer item for your observation logs.
de: Verwenden Sie dies, um neue Einträge von Beobachtern für Ihre Beobachtungsprotokolle hinzuzufügen.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>G</keycap></keycombo> </shortcut> <guimenu>Settings</guimenu> <guimenuitem>Geographic...</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>G</keycap></keycombo> </shortcut><guimenu>Einstellungen</guimenu><guimenuitem>Standort</guimenuitem>

source: Select a new <link linkend="setgeo">geographic location</link>
de: Wählen Sie einen neuen <link linkend="setgeo">geografischen Standort</link>

source: <guimenu>Settings</guimenu> <guimenuitem>Configure &kstars;...</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>&kstars; einrichten ...</guimenuitem>

source: Modify <link linkend="config">configuration options</link>
de: Verändert die <link linkend="config">Einrichtungsoptionen</link>

source: Additionally &kstars; has the common &kde; <guimenu>Settings</guimenu> and <guimenu>Help</guimenu> menu items, for more information read the sections about the <ulink url="help:/fundamentals/ui.html#menus-settings">Settings Menu</ulink> and <ulink url="help:/fundamentals/ui.html#menus-help">Help Menu</ulink> of the &kde; Fundamentals.
de: Zusätzlich hat &kstars; die bekannten &kde;-Einträge im Menü <guimenu>Einstellungen</guimenu> und <guimenu>Hilfe</guimenu>, weitere Informationen dazu finden Sie in den Abschnitten über die Menüs <ulink url="help:/fundamentals/ui.html#menus-settings">Einstellungen</ulink> und <ulink url="help:/fundamentals/uihtml#menus-help">Hilfe</ulink> der &kde;-Grundlagen.

source: Help Menu
de: Menü Hilfe

source: <title>Popup Menu</title>
de: <title>Kontextmenü</title>

source: <primary>Popup Menu</primary>
de: <primary>Kontextmenü</primary>

source: Description
de: Beschreibung

source: The <mousebutton>right</mousebutton> click popup menu is context-sensitive, meaning its content varies depending on what kind of object you click on. We list all possible popup menu items here, with the relevant object type [in brackets].
de: Das Menü, das Sie durch einen Klick mit der <mousebutton>rechten</mousebutton> Maustaste öffnen, ist kontextsensitiv, das heißt, es sieht unterschiedlich aus, je nachdem, worauf Sie geklickt haben. Es folgt eine Liste aller möglichen Einträge mit dem zugehörigen Objekttyp [in Klammern].

source: [All]
de: [Alle]

source: Identification and type: The top one to three lines are devoted to the name(s) of the object, and its type. For stars, the Spectral Type is also shown here.
de: Name und Typ: Die erste der drei Zeilen dient der Anzeige von Namen und Typ des Objekts. Für Sterne wird hier auch der Spektraltyp angezeigt.

source: Rise, Transit, and Set times for the object on the current simulation date are shown on the next three lines.
de: Die Aufgangs-, Durchgangs- und Untergangszeiten des Objekts in der aktuellen Simulation werden in den nächsten drei Zeilen angezeigt.

source: <guimenuitem>Center &amp; Track</guimenuitem>: Center the display on this location, and engage tracking. Equivalent to double-clicking.
de: <guimenuitem>Zentrieren &amp; Verfolgen</guimenuitem>: Zentriert die Ansicht auf diesem Punkt und schaltetet die Verfolgung ein. Eine Doppelklick mit der linken Maustaste schaltet diese Option ebenfalls ein.

source: <guimenuitem>Angular Distance To...</guimenuitem>: Enter "angular distance mode". In this mode, a dotted line is drawn from the first target object to the current mouse position. When you click with the &RMB; on a second object, this will display the angular distance between the two objects near the second object. You can press the &Esc; key to exit angular distance mode without measuring an angle.
de: <guimenuitem>Winkeldistanz zu ...</guimenuitem>: SchaItet in den Winkeldistanz-Modus. In diesem Modus wird eine gepunktete Linie vom ersten Zielobjekt zur aktuellen Position des Mauszeigers gezeichnet. Wenn Sie mit der &RMBn; auf das zweite Objekt klicken, wird die Winkeldistanz zwischen den beiden Objekten in der Nähe des zweiten Objekts angezeigt. Sie können die &Esc;-Taste drücken, um diesen Modus ohne Messung eines Winkels abzubrechen.

source: <guimenuitem>Details</guimenuitem>: Open the <link linkend="tool-details">Object Details window</link> for this object.
de: <guimenuitem>Details</guimenuitem>: Öffnet ein Fenster mit <link linkend="tool-details">ausführlichen Informationen</link> für dieses Objekt.

source: <guimenuitem>Attach Label</guimenuitem>: Attach a permanent name label to the object. If the object already has a label attached, this item will read <guilabel>Remove Label</guilabel>.
de: <guimenuitem>Marke hinzufügen</guimenuitem>: Fügt dauerhaft eine Marke zum Objekt hinzu. Wenn das Objekt bereits eine Marke hat, lautet dieser Eintrag <guilabel>Marke Entfernen</guilabel>.

source: <guimenuitem>Show ... Image</guimenuitem>: download an image of the object from the internet, and display it in the Image Viewer tool. The "..." text is replaced by a short description of the image's source. An object may have multiple image links available in its popup menu.
de: <guimenuitem>... Bild anzeigen</guimenuitem>: Lädt ein Bild des Objekts aus dem Internet und zeigt es im Bildbetrachter. Der <quote>...</quote> Text wird durch eine abgekürzte Beschreibung der Herkunft des Bildes ersetzt. Ein Objekt kann mehrere Verweise auf Bildquellen in diesem Kontextmenü enthalten.

source: <guimenuitem>... Page</guimenuitem>: Display a webpage about the object in your default web browser. The "..." text is replaced by a short description of the page. An object may have multiple web links available in its popup menu.
de: <guimenuitem>... Seite</guimenuitem>: Öffnet eine Webseite über das Objekt in Ihren Standard-Webbrowser. Der <quote>...</quote> Text wird durch eine kurze Beschreibung der Webseite ersetzt. Ein Objekt kann mehrere Verweise auf Webseiten in diesem Kontextmenü enthalten.

source: Keyboard Commands
de: Tastaturbefehle

source: Keyboard
de: Tastatur

source: Navigation Keys
de: Navigationstasten

source: Navigation Controls
de: Navigationsbefehle

source: Arrow Keys
de: Pfeiltasten

source: Use the arrow keys to pan the display. Holding down the &Shift; key doubles the scrolling speed.
de: Benutzen Sie die Pfeiltasten, um die Anzeige zu verschieben. Halten Sie die Umschalttaste, um die Geschwindigkeit zu verdoppeln.

source: Zoom In/Out
de: Vergrößern/Verkleinern

source: Center Display on a major Solar System body:
de: Zentriert die Ansicht auf einen der großen Himmelskörper im Sonnensystem:

source: 0: Sun
de: 0: Sonne

source: 1: Mercury
de: 1: Merkur

source: 3: Moon
de: 3: Mond

source: 8: Neptune
de: 8: Neptun

source: Center the display at the <link linkend="ai-zenith">Zenith</link> Point (straight up)
de: Zentriert die Ansicht auf den <link linkend="ai-zenith">Zenit</link>punkt (direkt über Ihnen)

source: Toggle tracking mode
de: Schaltet die Verfolgung ein/aus.

source: Advance the simulation clock backwards by one time step
de: Stellt die Simulationsuhr um einen Zeitschritt zurück

source: Advance the simulation clock forwards by one time step
de: Stellt die Simulationsuhr um einen Zeitschritt vor

source: Menu Shortcuts
de: Tastenkürzel für das Menü

source: Keyboard Shortcuts
de: Tastaturkürzel

source: Download extra data
de: Extradaten herunterladen

source: Open a FITS image in the FITS Editor
de: Öffnet ein FITS-Bild im FITS-Editor

source: Export sky image to a file
de: Exportiert das Bild des Himmels in eine Datei

source: Run a &kstars; <link linkend="tool-obsplanner">Observation Planner</link>
de: Öffnet die <link linkend="tool-obsplanner">Beobachtungsliste</link> für &kstars;.

source: Run a &kstars; &DBus; script
de: Startet ein &kstars; &DBus;-Skript

source: Print the current sky map
de: Druckt die aktuelle Sternenkarte.

source: Sync the simulation clock with the current system time
de: Stell die Simulationsuhr auf die aktuelle Zeit des Computers

source: Set the simulation clock to a specified Time and Date
de: Stellt die Simulationsuhr auf ein bestimmtes Datum und Zeit ein.

source: Define equipment (telescope, eyepiece, lens and filter) characteristics for observation logs
de: Definition Ihrer Ausrüstung (Teleskop, Okular, Linsen und Filter) für Beobachtungsprotokolle

source: Add a new observer item for your observation logs
de: Fügt neue Einträge von Beobachtern für Ihre Beobachtungsprotokolle hinzu

source: Space
de: Leertaste

source: Open the &kstars; Handbook
de: Öffnet das Handbuch zu &kstars;

source: Actions for the Selected Object
de: Aktionen für die ausgewählten Objekte

source: Objects in the Sky
de: Objekte im Himmel

source: Keyboard Actions
de: Tastaturbefehle

source: Each of the following keystrokes performs an action on the <firstterm>selected object</firstterm>. The selected object is the last object which was clicked on (identified in the status bar). Alternatively, if you hold down the &Shift; key, then the action is performed on the centered object instead.
de: Jeder der folgenden Tastendrücke führt eine Aktion mit dem <firstterm>gewählten Objekt</firstterm> aus. Das gewählte Objekt ist das Objekt, auf das Sie zuletzt geklickt haben, es wird in der Statusleiste angezeigt. Wenn Sie jedoch die &Shift;taste drücken, wird die Aktion statt dessen mit dem Objekt im Zentrum ausgeführt.

source: Center and Track on the selected object
de: Zentriert und verfolgt das gewählte Objekt

source: Open the Details window for the selected object
de: Öffnet ein Fenster mit Details für das ausgewählte Objekt

source: Toggle a name label for the selected object
de: Schaltet die Anzeige des Textfeldes für das ausgewählte Objekt ein und aus

source: Add the selected object to the observing list
de: Fügt das gewählte Objekt zur Beobachtungsliste hinzu

source: Open the selected object's popup menu
de: Öffnet das Kontextmenü für das ausgewählte Objekt

source: Toggle a trail on the selected object (solar system bodies only)
de: Schaltet die Anzeige der Bahn des gewählten Objekts ein oder aus. (Nur für Himmelskörper im Sonnensystem)

source: Tools Shortcuts
de: Tastenkürzel für Werkzeuge

source: Open the <link linkend="findobjects">Find Object window</link>, for specifying a sky object on which to center
de: Öffnet den Dialog <link linkend="findobjects">Objekte suchen</link>, in dem Sie ein Himmelsobjekt auswählen können, um darauf die Anzeige zu zentrieren

source: Open the <guilabel>Set Coordinates Manually</guilabel> tool, for specifying RA/Dec or Az/Alt coordinates on which to center
de: Öffnet den Dialog <guilabel>Koordinaten manuell einstellen</guilabel> zur Eingabe von Rekt/Dekl oder Az/Hö - Koordinaten für das Zentrum der Ansicht.

source: Start an Angular Distance measurement at the current mouse cursor position. The angular distance between start and end points is displayed at the endpoint.
de: Startet die Messung der Winkeldistanz an der aktuellen Position des Mauszeigers. Die Winkeldistanz wird zwischen Start- und Endpunkt wird am Endpunkt angezeigt.

source: Open the <link linkend="setgeo">Set Geographic Location</link> window
de: Öffnet den Dialog <link linkend="setgeo">Standort einstellen</link>

source: Open the <link linkend="tool-calculator">AstroCalculator</link>
de: Öffnet den <link linkend="tool-calculator">Astrorechner</link>

source: &Ctrl;<keycap>A</keycap>
de: &Ctrl;<keycap>Q</keycap>

source: Open the <link linkend="tool-altvstime">Altitude vs. Time</link> tool
de: Öffnet den Dialog <link linkend="tool-altvstime">Höhe und Zeit</link>

source: Open the <link linkend="tool-whatsup">What's Up Tonight?</link> tool
de: Öffnet das Fenster <link linkend="tool-whatsup">Was ist los heute Nacht?</link>

source: Open the <quote>What's Interesting</quote> tool
de: Öffnet das Fenster <quote>Was ist interessant</quote>

source: Open the <link linkend="tool-scriptbuilder">Script Builder</link> tool
de: Öffnet den <link linkend="tool-scriptbuilder">Skriptbaukasten</link>

source: Open the <link linkend="tool-solarsys">Solar System Viewer</link>
de: Öffnet den <link linkend="tool-solarsys">Sonnensystembetrachter</link>

source: Open the <link linkend="tool-jmoons">Jupiter Moons</link> tool
de: Öffnet die Anzeige der <link linkend="tool-jmoons">Jupiter-Monde</link>

source: Mouse Commands
de: Mausbefehle

source: Mouse
de: Maus

source: Moving the mouse
de: Mausbewegung

source: The sky coordinates (RA/Dec and Az/Alt) of the mouse cursor are updated in the status bar
de: Die Himmels-Koordinaten (Rekt/Dekl, Az/Hö) des Mauszeigers werden in der Statusleiste aktualisiert.

source: "Hovering" the mouse
de: Mauszeiger auf ein Objekt halten

source: A temporary name label is attached to the object nearest to the mouse cursor.
de: Fügt kurzzeitig ein Textfeld mit dem Namen des Objekts ein, das dem Mauszeiger am nächsten ist.

source: Left-clicking
de: Linksklick

source: Identifying
de: Identifizieren

source: The object nearest the mouse click is identified in the status bar.
de: Identifiziert das Objekt, das dem Mauszeiger am nächsten ist, in der Statusleiste.

source: Double-clicking
de: Doppelklick

source: Centering
de: Zentrieren

source: Center and track on the location or object nearest the mouse click. Double-clicking on an Info Box will <quote>shade</quote> it to show/hide extra information.
de: Zentriert die Anzeige und verfolgt die Stelle, auf die geklickt wurde oder das Objekt, das dem Mauszeiger am nächsten ist. Ein Doppelklick auf eine Infobox <quote>verkleinert</quote> bzw. <quote>vergrößert</quote> sie, um zusätzliche Informationen anzuzeigen oder auszublenden.

source: Right-clicking
de: Rechtsklick

source: Invoking Popup Menu for
de: Aufruf des Kontextmenüs für

source: Open the <link linkend="popup-menu">popup menu</link> for the location or object nearest the mouse cursor.
de: Öffnet das <link linkend="popup-menu">Kontextmenü</link> für den Ort oder das Objekt, das dem Mauszeiger am nächsten ist.

source: Scrolling the mouse wheel
de: Drehen des Mausrades

source: Zoom the display in or out. If you do not have a mouse wheel, you can hold the middle mouse button and drag vertically.
de: Vergrößert bzw. verkleinert die Ansicht. Falls Sie kein Mausrad haben, können Sie den mittleren Knopf der Maus drücken und die Maus nach unten oder oben bewegen.

source: Click-and-dragging
de: Klicken und Ziehen

source: Dragging the sky map
de: Bewegen der Himmelskarte

source: Pan the display, following the drag motion.
de: Verschiebt die Anzeige und folgt der Ziehbewegung.

source: &Ctrl;+dragging the sky map
de: &Ctrl;+Bewegung der Himmelskarte

source: Define a rectangle in the map. When the mouse button is released, the display is zoomed in to match the field-of-view to the bounds of the rectangle.
de: Definiert ein Rechteck in der Karte, wenn der Mausknopf losgelassen wird, wird die Ansicht vergrößert, um den Inhalt des Rechtecks anzuzeigen.

source: Dragging an Info Box
de: Ziehen einer Infobox

source: The Info Box is repositioned in the map. Info Boxes will <quote>stick</quote> to window edges, so that they remain on the edge when the window is resized.
de: Die Infobox wird auf der Karte neu platziert. Infoboxen <quote>kleben</quote> an den Fensterrändern, also bleiben sie dort, wenn die Fenstergröße verändert wird.
