Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdeedu/kstars_config.po
Languages: de

source: Configuring &kstars;
de: &kstars; einrichten

source: Setting the Geographic Location
de: Einstellung des Standorts

source: Here is a screenshot of the <guilabel>Set Geographic Location</guilabel> window:
de: Hier ist ein Bildschirmfoto des Dialogs <guilabel>Standort einstellen</guilabel>

source: Changing the Geographic Location
de: Änderung des Standorts

source: Set Location Window
de: Der Dialog <quote>Standort einstellen</quote>

source: There is a list of over 2500 predefined cities available to choose from. You set your location by highlighting a city from this list. Each city is represented in the world map as a small dot, and when a city is highlighted in the list, a red crosshairs appears on its location in the map.
de: Es gibt eine Liste mit mehr als 2500 Standorten zur Auswahl. Sie stellen den Standort ein, in dem Sie eine Stadt aus dieser Liste auswählen. Jede Stadt wird in der Weltkarte als kleiner Punkt dargestellt. Wenn Sie eine Stadt in der Liste auswählen, wird der Standort als rotes Kreuz in der Karte angezeigt.

source: Geographic Location Tool
de: Das Hilfsmittel <quote>Geografischer Standort</quote>

source: Filtering
de: Filtern

source: It is not practical to scroll through the full list of 2500 locations, looking for a specific city. To make searches easier, the list can be filtered by entering text in the boxes below the map. For example, in the screenshot, the text <quote>Ba</quote> appears in the <guilabel>City Filter</guilabel> box, while <quote>M</quote> has been entered in the <guilabel>Province Filter</guilabel> box, and <quote>USA</quote> is in the <guilabel>Country Filter</guilabel> box. Note that all of the cities displayed in the list have city, province, and country names that begin with the entered filter strings, and that the message below the filter boxes indicates that 7 cities are matched by the filters. Also notice that the dots representing these seven cities in the map have been colored white, while the unmatched cities remain gray.
de: Es ist unpraktisch, durch die ganze Liste mit 2500 Orten zu blättern, um eine bestimmte Stadt zu finden. Um die Suche zu erleichtern, können Sie die Liste durch Eingabe von Text in die Felder unter der Karte filtern. Im Bildschirmfoto sehen Sie zum Beispiel den Text <quote>BA</quote> im Feld <guilabel>Stadt</guilabel>, <quote>M</quote> im Feld <guilabel>Provinz</guilabel> und <quote>USA</quote> im Feld <guilabel>Land</guilabel>. Beachten Sie, dass für alle in der Liste angezeigten Städte die ersten Buchstaben von Name, Provinz und Land mit den Zeichen in den Filterfeldern übereinstimmen und darunter angezeigt wird, dass sieben Städte die Filterbedingungen erfüllen. Außerdem werden diese sieben Städte in der Karte als weiße Punkte dargestellt, alle andern Städte aber weiterhin als graue Punkte.

source: The list can also be filtered by location in the map. Clicking anywhere in the world map will show only those cities within two degrees of the clicked location. At this time, you can search by name, or by location, but not both at once. In other words, when you click on the map, the name filters are ignored, and vice versa.
de: Sie können die Liste auch über Orte auf der Karte filtern. Klicken Sie auf irgendeinen Punkt auf der Weltkarte und nur Städte im Umkreis von zwei Grad um diesen Punkt werden angezeigt. Zurzeit können Sie nur nach Namen oder über Orte auf der Karte filtern. Wenn Sie also auf einen Punkt auf der Karte klicken, dann wird der Namensfilter nicht angewandt und umgekehrt.

source: Custom locations
de: Eigene Standorte

source: The <link linkend="ai-geocoords">longitude, latitude</link> and <link linkend="ai-timezones">time zone</link> information for the currently-selected location are displayed in the boxes at the bottom of the window. If you feel that any of these values are inaccurate, you can modify them and press the <guibutton>Add City to List</guibutton> button to record your custom version of the location. You can also define a completely new location by pressing the <guibutton>Clear Fields</guibutton> button, and entering the data for the new location. Note that all fields except the optional <guilabel>State/Province</guilabel> must be filled before the new location can be added to the list. &kstars; will automatically load your custom locations for all future sessions. Please note, at this point, the only way to remove a custom location is to remove the appropriate line from the file <filename>~/.kde/share/apps/kstars/mycities.dat</filename>.
de: Die Angaben zum <link linkend="ai-geocoords">Längengrad, Breitengrad</link> und zur <link linkend="ai-timezones">Zeitzone</link> des aktuell eingestellten Standortes werden am unteren Rand des Fensters angezeigt. Wenn Sie feststellen, dass einige dieser Angaben falsch sind, können Sie sie ändern und dann auf den Knopf <guibutton>Stadt zur Liste hinzufügen</guibutton> drücken, um Ihre Eingabe zu speichern. Sie können außerdem einen völlig neuen Standort eingeben, indem Sie den Knopf <guibutton>Felder löschen</guibutton> drücken und die Daten für den neuen Standort eingeben. Alle Felder außer der freigestellten Angabe von <guilabel>Staat/Provinz</guilabel> müssen ausgefüllt werden, ehe der neue Standort in die Liste aufgenommen werden kann. &kstars; lädt dann automatisch in allen späteren Sitzungen Ihre eigenen Standorte. Beachten Sie, dass Sie zurzeit die selbst eingegebenen Standorte nur löschen können, indem Sie die zugehörige Zeile in der Datei <filename>~/.kde/share/apps/kstars/mycities.dat</filename> löschen.

source: If you add custom locations (or modify existing ones), please send us your <filename>mycities.dat</filename> file so that we can add your locations to the master list.
de: Wenn Sie eigene Standorte eingeben (oder vorhandene bearbeiten), senden Sie uns bitte Ihre Datei <filename>mycities.dat</filename>, damit wir Ihre Standorte in die Hauptliste einfügen können.

source: Setting the Time
de: Einstellung der Zeit

source: Date and Time
de: Datum und Zeit

source: The simulation clock
de: Die Simulationsuhr

source: When &kstars; starts up, the time is set to your computer's system clock, and the &kstars; clock is running to keep up with the real time. If you want to stop the clock, select <guimenuitem>Stop Clock</guimenuitem> from the <guimenu>Time</guimenu> menu, or simply click on the <guiicon>Stop Clock</guiicon> icon in the toolbar. You can make the clock run slower or faster than normal, or even make it run backward, using the time-step spinbox in the toolbar. This spinbox has two sets of up/down buttons. The first one will step through all 83 available time steps, one by one. The second one will skip to the next higher (or lower) unit of time, which allows you to make large timestep changes more quickly.
de: Beim Start von &kstars; wird die Zeit in &kstars; auf die Zeit Ihres Computers gestellt und die Uhr in &kstars; läuft wie in der Wirklichkeit. Wenn Sie die Uhr anhalten wollen, wählen Sie <guimenuitem>Uhr anhalten</guimenuitem> im Menü <guimenu>Zeit</guimenu> oder klicken Sie einfach auf das Symbol <guiicon>Uhr anhalten</guiicon> in der Werkzeugleiste. Mit dem Drehfeld Zeitschritt in der Werkzeugleiste können Sie die Zeit schneller oder langsamer als normal und sogar rückwärts laufen lassen. Dieses Drehfeld hat zwei Gruppen von Knöpfen für Auf/Ab. Die erste durchläuft alle vorhandenen 83 Zeitschritte nacheinander. Die zweite wechselt zur nächsthöheren (oder niedrigeren) Zeiteinheit, damit Sie große Zeitschritte schneller ablaufen lassen können.

source: Setting
de: Einstellung

source: You can set the time and date by selecting <guimenuitem>Set Time...</guimenuitem> from the <guimenu>Time</guimenu> menu, or by pressing the <guiicon>time</guiicon> icon in the toolbar. The <guilabel>Set Time</guilabel> window uses a standard &kde; Date Picker widget, coupled with two spinboxes for setting the hours and minutes. If you want to re-synchronize the simulation clock back to the current CPU time, just select <guimenuitem>Set Time to Now</guimenuitem> from the <guimenu>Time</guimenu> menu.
de: Zeit und Datum können Sie mit <guimenuitem>Zeit einstellen ...</guimenuitem> im Menü <guimenu>Zeit</guimenu> oder mit dem Symbol <guiicon>Zeit</guiicon> in der Werkzeugleiste einstellen. Im Fenster <guilabel>Zeit einstellen</guilabel> finden Sie die &kde;-Standard Datumsauswahl zusammen mit zwei Drehfeldern für die Einstellung von Stunden, Minuten. Wollen Sie die Simulationsuhr wieder auf die Zeit des Computers einstellen, wählen Sie nur <guimenuitem>Aktuelle Zeit einstellen</guimenuitem> aus dem Menü <guimenu>Zeit</guimenu>.

source: Extended range of dates
de: Erweiterter Bereich für Zeitdaten

source: &kstars; can accept very remote dates beyond the usual limits imposed by QDate. Currently, you can set the date between the years -50000 and +50000. We may extend this range even further in future releases. However, please be aware that the accuracy of the simulation becomes more and more degraded as more remote dates are examined. This is especially true for the positions of solar system bodies.
de: &kstars; kann weit entfernte Zeitdaten über die normale durch QDate vorgegebene Grenze hinaus verarbeiten. Zurzeit können Sie Daten im Bereich von -50000 bis +50000 Jahren einstellen. Dieser Bereich wird vielleicht in zukünftigen Versionen erweitert werden.Beachten Sie aber, dass die Genauigkeit der Simulation für weit entfernte Zeiten immer mehr abnimmt. Dies betrifft besonders die Position der Himmelskörper im Sonnensystem.

source: The Configure &kstars; Window
de: Der Dialog &kstars; einrichten

source: Configure &kstars; window
de: Dialog &kstars; einrichten

source: The <guilabel>Configure &kstars;</guilabel> window allows you to modify a wide range of display options. You can access the window with the <guiicon>configure</guiicon> toolbar icon, or by selecting <guimenuitem>Configure &kstars;...</guimenuitem> from the <guimenu>Settings</guimenu> menu. The window is depicted below:
de: Im Dialog <guilabel>&kstars; einrichten</guilabel> können Sie eine große Anzahl von Optionen für die Ansicht einstellen. Diesen Dialog öffnen Sie mit entweder mit dem Symbol <guiicon>Einstellungen</guiicon> in der Werkzeugleiste, oder durch Auswahl von <guimenuitem>&kstars; einrichten ...</guimenuitem> aus dem Menü <guimenu>Einstellungen</guimenu>. Das Fenster ist unten dargestellt:

source: <screeninfo>Configure &kstars; Window</screeninfo>
de: <screeninfo>Dialog &kstars; einrichten</screeninfo>

source: <phrase>Configure &kstars; Window</phrase>
de: <phrase>Dialog &kstars; einrichten</phrase>

source: The <guilabel>Configure &kstars;</guilabel> window is divided into nine pages: <guilabel>Catalogs</guilabel>, <guilabel>Solar System</guilabel>, <guilabel>Satellites</guilabel>, <guilabel>Supernovae</guilabel>, <guilabel>Guides</guilabel>, <guilabel>Colors</guilabel>, <guilabel>INDI</guilabel>, <guilabel>Xplanet</guilabel>, and <guilabel>Advanced</guilabel>.
de: Der Dialog <guilabel>&kstars; einrichten</guilabel> ist in neun Seiten eingeteilt: <guilabel>Kataloge</guilabel>, <guilabel>Sonnensystem</guilabel>, <guilabel>Satelliten</guilabel>, <guilabel>Supernovae</guilabel>, <guilabel>Orientierungshilfen</guilabel>, <guilabel>Farben</guilabel>, <guilabel>INDI</guilabel>, <guilabel>Xplanet</guilabel> und <guilabel>Erweitert</guilabel>.

source: Catalogs page
de: Die Seite <quote>Kataloge</quote>

source: In the <guilabel>Catalogs</guilabel> page, you determine which object catalogs are displayed in the map. The <guilabel>Stars</guilabel> section also allows you to set the <quote>faint <link linkend="ai-magnitude">magnitude</link> limit</quote> for stars, and the <link linkend="ai-magnitude">magnitude</link> limit for displaying the names and/or magnitudes of stars. Below the stars section, the <guilabel>Deep-Sky Objects</guilabel> section controls the display of several non-stellar object catalogs. By default, the list includes the Messier, NGC and IC catalogs. You can add your own custom object catalogs by pressing the <guibutton>Import Catalog</guibutton> or <guilabel>Load Catalog</guilabel> button. For detailed instructions on preparing a catalog data file, see the <filename>README.customize</filename> file that ships with &kstars;.
de: Auf der Seite <guilabel>Kataloge</guilabel> können Sie wählen, welche Objektkataloge in der Karte angezeigt werden. Im Abschnitt <guilabel>Sterne</guilabel> können Sie auch das <quote>untere <link linkend="ai-magnitude">Helligkeit</link>slimit</quote> für Sterne einstellen und ein <link linkend="ai-magnitude">Magnituden</link>limit für die Anzeige der Namen und/oder Magnitude der Sterne. Unter dem Abschnitt <quote>Sterne</quote> befindet sich der Abschnitt <guilabel>Deep-Sky-Objekte</guilabel> mit den Einstellungen für die Anzeige von nichtstellaren Himmelsobjekten. Als Standard enthält die Liste den Messier-, NGC- und IC-Katalog. Sie können Ihre eigenen Objektkataloge hinzufügen, indem Sie den Knopf <guibutton>Katalog importieren ...</guibutton> drücken. Genauere Informationen zu eigenen Katalogdateien finden Sie in der Datei <filename>README.customize</filename>, die mit &kstars; ausgeliefert wird.

source: Solar System page
de: Die Seite <quote>Sonnensystem</quote>

source: In the <guilabel>Solar System</guilabel> page, you can specify whether the Sun, Moon, planets, comets and asteroids are displayed, and whether the major bodies are drawn as colored circles or actual images. You can also toggle whether solar system bodies have name labels attached, and control how many of the comets and asteroids get name labels. There is an option to automatically attach a temporary <quote>orbit trail</quote> whenever a solar system body is tracked, and another to toggle whether the color of the orbit trail fades into the background sky color.
de: Auf der Seite <guilabel>Sonnensystem</guilabel> können Sie angeben, ob die Sonne, der Mond, die Planeten, Kometen und Asteroiden angezeigt werden sollen und ob diese Himmelskörper als farbige Kreise oder mit ihren wirklichen Bildern angezeigt werden sollen. Sie können auch bestimmen, ob die Sonnensystemkörper Bezeichnungen tragen und können kontrollieren, wie viele der Kometen und Asteroiden Namensbezeichnungen tragen. Es gibt eine Einstellung, um automatisch <quote>Umlaufspuren</quote> hinzuzufügen, wenn ein Sonnensystemkörper verfolgt wird und eine andere Einstellung, ob die Planetenfarbe in den Sternenhintergrund verläuft.

source: Guides page
de: Die Seite <quote>Orientierungshilfen</quote>

source: The <guilabel>Guides</guilabel> page lets you toggle whether non-objects are displayed (&ie;, constellation lines, constellation names, the Milky Way contour, the <link linkend="ai-cequator">celestial equator</link>, <link linkend="ai-ecliptic">the ecliptic</link>, <link linkend="ai-horizon">the horizon line</link>, and the opaque ground). You can also choose whether you would like to see Latin constellation names, <acronym>IAU</acronym>-standard three-letter abbreviations, or constellation names using your local language.
de: Auf der Seite <guilabel>Orientierungshilfen</guilabel> können Sie einstellen, was außer den Objekten angezeigt werden soll (&eg; Sternbildlinien, Sternbildnamen, Milchstraßenkonturen, <link linkend="ai-cequator">Himmelsäquator</link>, <link linkend="ai-ecliptic">Ekliptik</link>, <link linkend="ai-horizon">Horizont</link> und undurchsichtiger Boden). Sie können auch auswählen, ob Sie lateinische Sternbildnamen, dreibuchstabige <acronym>IAU</acronym>-Standardabkürzungen oder Namen in ihrer eigenen Sprache sehen wollen.

source: Colors page
de: Die Seite <quote>Farben</quote>

source: Color Schemes
de: Farbschemata

source: Customizing
de: Anpassen

source: The <guilabel>Colors</guilabel> page allows you to set the color scheme, and to define custom color schemes. The tab is split into two panels:
de: Sie können das Farbenschema auf der Seite <guilabel>Farben</guilabel> einstellen. Die Seite ist in zwei Felder aufgeteilt:

source: The left panel shows a list of all display items with adjustable colors. Click on any item to bring up a color selection window to adjust its color. Below the list is the <guilabel>Star Color Mode</guilabel> selection box. By default, &kstars; draws stars with a <link linkend="ai-colorandtemp">realistic color</link> tint according to the spectral type of the star. However, you may also choose to draw the stars as solid white, black or red circles. If you are using the realistic star colors, you can set the saturation level of the star colors with the <guilabel>Star Color Intensity</guilabel> spinbox.
de: Die linke Seite zeigt eine Liste aller Objekte, deren Farben verändert werden kann. Klicken Sie auf einen Eintrag, um einen Dialog zur Farbwahl zu öffnen, in dem Sie die Farbe verändern können. Unter der Liste ist das <guilabel>Sternenfarben</guilabel>-Auswahlfeld. Standardmäßig zeichnet &kstars; die Sterne mit <link linkend="ai-colorandtemp">realistischen Farben</link>, die vom Spektraltyp des Sterns abhängen. Dennoch können Sie auch auswählen, dass die Sterne nur als weiße, schwarze oder rote Kreise angezeigt werden. Wenn Sie die realistischen Sternenfarben benutzen, können Sie die Sättigungsstufe der Sternenfarben im Drehfeld <guilabel>Sternenfarbenintensität</guilabel> einstellen.

source: The right panel lists the defined color schemes. There are four predefined schemes: the <guilabel>Default Colors</guilabel> scheme, <guilabel>Star Chart</guilabel>, which uses black stars on a white background, <guilabel>Night Vision</guilabel>, which uses only shades of red in order to protect dark-adapted vision, and <guilabel>Moonless Night</guilabel>, a more realistic, dark theme. Additionally, you can save the current color settings as a custom scheme by clicking the <guibutton>Save Current Colors</guibutton> button. It will prompt you for a name for the new scheme, and then your scheme will appear in the list in all future &kstars; sessions. To remove a custom scheme, simply highlight it in the list, and press the <guibutton>Remove Color Scheme</guibutton> button.
de: Im rechten Rahmen werden die definierten Farbschemata aufgelistet. Es gibt drei vordefinierte Schemata: Das <guilabel>Standardfarben</guilabel>-Schema, ein <guilabel>Sternenkarte</guilabel>nschema mit schwarzen Sternen auf einem weißen Hintergrund, <guilabel>Nachtsicht</guilabel> nur mit Abstufungen in roter Farbe, um Ihre nachtangepasste Sicht nicht zu stören und <guilabel>Mondlose Nacht</guilabel>, ein realistischeres, dunkles Design.Zusätzlich können Sie die aktuellen Farbeinstellungen als eigene Einstellung speichern, indem Sie auf den Knopf <guibutton>Aktuelle Farben speichern</guibutton> klicken. Sie werden nach einem Namen für das neue Schema gefragt und dann wird ihr Schema in allen weiteren &kstars;-Sitzungen in der Liste auftauchen. Um ein eigenes Schema zu löschen, wählen Sie das Schema aus der Liste und drücken Sie den Knopf <guibutton>Farbschema entfernen</guibutton>.

source: For detailed explanation of the options on the <guilabel>INDI</guilabel> page see the <link linkend="indi-configure">Configure INDI</link> section.
de: Eine ausführliche Erklärung der Einstellungen auf der Seite <guilabel>INDI</guilabel> finden Sie im Abschnitt <link linkend="indi-configure">INDI einrichten</link>.

source: Advanced page
de: Die Seite <quote>Erweitert</quote>

source: The <guilabel>Advanced</guilabel> page provides fine-grained control over the more subtle behaviors of &kstars;.
de: Die Seite <guilabel>Erweitert</guilabel> ermöglicht Ihnen eine genaue Einstellung der Verhaltensweise von &kstars;.

source: Atmospheric Refraction
de: Atmosphärische Lichtbrechung

source: The <guilabel>Correct for atmospheric refraction</guilabel> checkbox controls whether the positions of objects are corrected for the effects of the atmosphere. Because the atmosphere is a spherical shell, light from outer space is <quote>bent</quote> as it passes through the atmosphere to our telescopes or eyes on the Earth's surface. The effect is largest for objects near the horizon, and actually changes the predicted rise or set times of objects by a few minutes. In fact, when you <quote>see</quote> a sunset, the Sun's actual position is already well below the horizon; atmospheric refraction makes it seem as if the Sun is still in the sky. Note that atmospheric refraction is never applied if you are using <guilabel>Equatorial coordinates</guilabel>.
de: Das Ankreuzfeld <guilabel>Atmosphärische Lichtbrechung korrigieren</guilabel> kontrolliert, ob die Positionen der Objekte wegen der Effekte der Lichtbrechung korrigiert werden. Da die Atmosphäre eine kugelförmige Muschel ist, wird das Licht aus dem All <quote>gebrochen</quote>, wenn es durch die Atmosphäre zu unseren Teleskopen oder unseren Augen auf der Erdoberfläche kommt. Der Effekt ist dabei am größten bei Objekten in der Nähe des Horizonts und verändert tatsächlich die vorhergesagten Aufgangs- und Untergangszeiten von Objekten um mehrere Minuten! Wenn Sie einen Sonnenuntergang <quote>sehen</quote>, ist die Position der Sonne tatsächlich schon unter dem Horizont, die atmosphärische Lichtbrechung lässt dabei die Sonne immer noch scheinbar am Himmel sichtbar sein. Beachten Sie, dass die atmosphärische Lichtbrechung nie verwendet wird, wenn Sie <guilabel>Äquatoriale Koordinaten</guilabel> benutzen.

source: Animated Slewing
de: Animierte Bewegung

source: The <guilabel>Use animating slewing</guilabel> checkbox controls how the display changes when a new focus position is selected in the map. By default, you will see the sky drift or <quote>slew</quote> to the new position; if you uncheck this option, then the display will instead <quote>snap</quote> immediately to the new focus position.
de: Die Einstellung <guilabel>Animierte Bewegung benutzen</guilabel> kontrolliert, wie die Anzeige sich verändert, wenn eine neue Position in der Karte ausgewählt wird. Normalerweise sehen Sie den Himmel zu der neuen Position an sich <quote>vorbeidriften</quote>; Falls Sie die Einstellung deaktivieren, wird die Anzeige stattdessen sofort zu neuen Position <quote>springen</quote>.

source: Objects in the Sky
de: Objekte im Himmel

source: Labeling
de: Bezeichnung

source: Automatic
de: Automatisch

source: If the <guilabel>Attach label to centered object</guilabel> checkbox is selected, then a name label will automatically be attached to an object when it is being tracked by the program. The label will be removed when the object is no longer being tracked. Note that you can also manually attach a persistent name label to any object with its <link linkend="popup-menu">popup menu</link>.
de: Falls die Einstellung <guilabel>Marke zum zentrierten Objekt hinzufügen</guilabel> aktiviert ist, wird eine Namensmarke automatisch an das Objekt angefügt, wenn es vom Programm verfolgt wird. Die Bezeichnung wird entfernt, wenn das Objekt nicht länger verfolgt wird. Beachten Sie, dass Sie auch eine dauerhafte Namensmarke im <link linkend="popup-menu">Kontextmenü</link> hinzufügen können.

source: Hiding
de: Ausblenden
