Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdeedu/kstars_magnitude.po
Languages: de

source: <title>Magnitude Scale</title>
de: <title>Magnituden</title>

source: <primary>Magnitude Scale</primary>
de: <primary>Magnituden</primary>

source: <seealso>Flux</seealso> <seealso>Star Colors and Temperatures</seealso>
de: <seealso>Energiefluss</seealso> <seealso>Sternenfarben und Temperaturen</seealso>

source: 2500 years ago, the ancient Greek astronomer Hipparchus classified the brightnesses of visible stars in the sky on a scale from 1 to 6. He called the very brightest stars in the sky <quote>first magnitude</quote>, and the very faintest stars he could see <quote>sixth magnitude</quote>. Amazingly, two and a half millenia later, Hipparchus's classification scheme is still widely used by astronomers, although it has since been modernized and quantified.
de: Vor 2500 Jahre ordnete der antike griechische Astronom Hipparchus die Helligkeit der sichtbaren Sterne im Himmel auf einer Skala von 1 bis 6. Er nannte die hellsten Sterne im Himmel <quote>erste Magnitude</quote> und die blassesten Sterne, die er sehen konnte <quote>sechste Magnitude</quote>. Erstaunlicherweise wird Hipparchus' Einteilung immer noch von Astronomen zweieinhalbtausend Jahre später benutzt, obwohl sie modernisiert und erweitert wurde.

source: The magnitude scale runs backwards to what you might expect: brighter stars have <emphasis>smaller</emphasis> magnitudes than fainter stars).
de: Beachten Sie, dass die Größenskala rückwärts läuft: Hellere Sterne haben <emphasis>kleinere</emphasis> Magnituden (Größenwerte) als mattere Sterne.

source: The modern magnitude scale is a quantitative measurement of the <firstterm>flux</firstterm> of light coming from a star, with a logarithmic scaling:
de: Die moderne Magnitudenskala ist eine mengenmäßige Messung des <firstterm>Energieflusses</firstterm> von Licht aus einem Stern mit einer logarithmischen Skala:

source: If you do not understand the math, this just says that the magnitude of a given star (m) is different from that of some standard star (m<subscript>0</subscript>) by 2.5 times the logarithm of their flux ratio. The 2.5 *log factor means that if the flux ratio is 100, the difference in magnitudes is 5 mag. So, a 6th magnitude star is 100 times fainter than a 1st magnitude star. The reason Hipparchus's simple classification translates to a relatively complex function is that the human eye responds logarithmically to light.
de: Wenn Sie diese Mathematik nicht verstehen, das bedeutet einfach, dass die Magnitude eines gegeben Sterns (m) verschieden von einem Standardstern (m<subscript>0</subscript>) das 2,5-fache des Logarithmus ihres Energieflusses ist. Der Faktor 2,5*log bedeutet, dass bei einem Verhältnis des Energieflusses von 100 der Unterschied in den Magnituden 5 mag beträgt. Also ist ein Stern 6. Magnitude 100 mal blasser als ein Stern der 1. Magnitude. Der Grund, weshalb Hipparchus' einfache Einteilung zu einer relativ komplexen Funktion führt, liegt darin, dass unser Auge auf das Licht logarithmisch reagiert.

source: There are several different magnitude scales in use, each of which serves a different purpose. The most common is the apparent magnitude scale; this is just the measure of how bright stars (and other objects) look to the human eye. The apparent magnitude scale defines the star Vega to have magnitude 0.0, and assigns magnitudes to all other objects using the above equation, and a measure of the flux ratio of each object to Vega.
de: Es werden mehrere verschiedene Magnitudenskalen benutzt, jede für einen anderen Zweck. Die am häufigsten benutzte ist die scheinbare Magnitudenskala, die einfach misst, wie hell Sterne (und andere Objekte) dem menschlichen Auge erscheinen. Die scheinbare Magnitudenskala definiert den Stern Vega mit der Magnitude 0,0 und weist allen anderen Objekten mit der obigen Gleichung einen Wert zu und misst die Energieflussmenge relativ zu Vega.

source: It is difficult to understand stars using just the apparent magnitudes. Imagine two stars in the sky with the same apparent magnitude, so they appear to be equally bright. You cannot know just by looking if the two have the same <emphasis>intrinsic</emphasis> brightness; it is possible that one star is intrinsically brighter, but further away. If we knew the distances to the stars (see the <link linkend="ai-parallax">parallax</link> article), we could account for their distances and assign <firstterm>Absolute magnitudes</firstterm> which would reflect their true, intrinsic brightness. The absolute magnitude is defined as the apparent magnitude the star would have if observed from a distance of 10 parsecs (1 parsec is 3.26 light-years, or 3.1 x 10<superscript>18</superscript> cm). The absolute magnitude (M) can be determined from the apparent magnitude (m) and the distance in parsecs (d) using the formula:
de: Es ist schwer die Sterne nur mit ihrer scheinbaren Magnitude zu verstehen. Stellen Sie sich zwei Sterne im Himmel mit der gleichen scheinbaren Magnitude vor, die also scheinbar gleich hell sind. Sie können vom Hinschauen nicht wissen, ob sie beide dieselben <emphasis>wirkliche</emphasis> Helligkeit haben; Es ist möglich, dass der eine Stern in Wirklichkeit heller ist, aber weiter entfernt. Wenn wir die Entfernung zu den Sternen wüssten (schauen Sie in den Artikel über <link linkend="ai-parallax">Parallaxe</link>), könnten wir ihre Entfernung einbeziehen und ihnen <firstterm>absolute Magnituden</firstterm> zuweisen, die ihre wirklichen Helligkeiten darstellt. Die absolute Magnitude ist definiert als die scheinbare Magnitude, die ein Stern haben würde, wenn er aus einer Entfernung von 10 Parsecs (1 Parsec beträgt 3,26 Lichtjahre oder 3,1 * 10<superscript>18</superscript> cm) betrachtet würde. Die absolute Magnitude (M) kann aus der scheinbaren Magnitude (m) und der Distanz in Parsecs (d) mit dieser Formel berechnet werden:

source: M = m + 5 - 5 * log(d) (note that M=m when d=10).
de: M = m + 5 - 5 * log(d) (Beachten Sie, dass für d=10 M=m ist).

source: The modern magnitude scale is no longer based on the human eye; it is based on photographic plates and photoelectric photometers. With telescopes, we can see objects much fainter than Hipparchus could see with his unaided eyes, so the magnitude scale has been extended beyond 6th magnitude. In fact, the Hubble Space Telescope can image stars nearly as faint as 30th magnitude, which is one <emphasis>trillion</emphasis> times fainter than Vega.
de: Die moderne Magnitudenskala basiert nicht länger auf dem menschlichen Auge, sie basiert auf fotografischen Platten und fotoelektrischen Fotometern. Mit Teleskopen können wir viel blassere Objekte sehen als Hipparchus mit dem bloßen Auge, also wurde die Magnitudenskala über die 6. Magnitude hinaus erweitert. Tatsächlich kann das Hubble Space Telescope Fotos von Sternen machen, die sich in der 30. Magnitude befinden, was ungefähr eine <emphasis>Billion</emphasis> Mal blasser ist als die Vega!

source: A final note: the magnitude is usually measured through a color filter of some kind, and these magnitudes are denoted by a subscript describing the filter (&ie;, m<subscript>V</subscript> is the magnitude through a <quote>visual</quote> filter, which is greenish; m<subscript>B</subscript> is the magnitude through a blue filter; m<subscript>pg</subscript> is the photographic plate magnitude, &etc;).
de: Ein letzter Zusatz: Die Magnitude wird normalerweise durch einen irgendwie gearteten Farbfilter gemessen und diese Werte werden von einem Index begleitet, der angibt, durch welchen Filter gemessen wurde (&eg; m<subscript>V</subscript> ist die Magnitude durch einen <quote>Visual</quote>-Filter (<quote>sichtbar</quote>), der grünlich ist, m<subscript>B</subscript>ist die Magnitude durch einen Blaufilter, m<subscript>pg</subscript> ist die fotografische Plattenmagnitude &etc;)
