Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdeedu/kstars_telescopes.po
Languages: de

source: <title>Telescopes</title>
de: <title>Teleskope</title>

source: <primary>Telescopes</primary>
de: <primary>Teleskope</primary>

source: Invented in Holland at the beginning of the 17th century, telescopes are the tools used by astronomers and astrophysicists for their observations. With the development of modern science, telescopes are nowadays used for observing in all ranges of the electromagnetic spectrum, inside and outside Earth's atmosphere. Telescopes work by collecting light with a large surface aerie called objective that makes the incoming light to converge. The final image will be viewed by using an eyepiece.
de: Das Teleskop wurde zu Beginn des Siebzehnten Jahrhunderts in Holland erfunden und ist ein Arbeitsmittel für Astronomen und Astrophysiker für Ihre Beobachtungen. Durch die Entwicklung der modernen Wissenschaft werden Teleskope heutzutage in allen Bereichen des elektromagnetischen Spektrums innerhalb und außerhalb der Erdatmosphäre eingesetzt. Die Funktionsweise von Teleskopen besteht darin, Licht mit einer großen Oberfläche eines Objektivs zu sammeln und das einfallende Licht zusammenzuführen. Das endgültige Bild wird durch ein Okular betrachtet.

source: Aperture and Focal Ratio
de: Blenden- und Brennweitenverhältnis

source: Telescopes are used in order to collect light from celestial objects and to converge it to a point, named the focal point. They are described by two parameters, <firstterm>aperture</firstterm> and <firstterm>Focal Ratio</firstterm>. The diameter of the light collecting surface is called the <firstterm>aperture</firstterm> of the telescope &ndash; the bigger the aperture, the brighter the image. The ratio of the focal length <firstterm>f</firstterm> to the <firstterm>aperture D</firstterm> of a telescope is defined as the <firstterm>focal ratio</firstterm>. This describes the light gathering power of a telescope. <quote>Fast</quote> telescopes have smaller focal ratios, as they obtain brighter images in a smaller exposure time. As the focal ratio gets bigger, the telescope needs more exposure time in order to obtain a bright image, which is why it is <quote>slower</quote>. The focal ratio is usually denoted as <quote>f/n</quote>, where n is the ratio of the focal length to the aperture.
de: Teleskope werden dazu genutzt, um Licht von Himmelsobjekten zu sammeln und an einem Punkt, dem Brennpunkt, zusammenzuführen. Teleskope sind durch zwei Parameter gekennzeichnet, <firstterm>Blende</firstterm> und <firstterm>Brennweitenverhältnis</firstterm>. Der Durchmesser der Licht einfangenden Fläche wird die <firstterm>Blende</firstterm> des Teleskops genannt &ndash; je größer die Blende desto heller ist das Bild. Das Verhältnis der Brennweite <firstterm>f</firstterm> zur <firstterm>Blende D</firstterm> ist als <firstterm>Brennweitenverhältnis</firstterm> definiert. Dieser Wert beschreibt die Lichtempfindlichkeit eines Teleskops. <quote>Schnelle</quote> Teleskope haben ein kleineres Brennweitenverhältnis, da sie hellere Bilder in einer kürzeren Belichtungszeit aufnehmen. Bei größeren Brennweitenverhältnissen benötigen Teleskope längere Belichtungszeiten, um ein helles Bild aufzunehmen, darum sind sie <quote>langsamer</quote>. Das Brennweitenverhältnis wird normalerweise als <quote>f/n</quote> bezeichnet, dabei ist „n“ das Verhältnis der Brennweite zur Blendenöffnung.

source: Aberrations
de: Aberrationen oder Abbildungsfehler

source: In order to obtain an image, telescopes use lenses or mirrors. Unfortunately, if we use both of them we obtain image distortions known as <firstterm>aberrations</firstterm>. Some aberrations are common for both lenses and mirrors, like <firstterm>astigmatism</firstterm> and <firstterm>curvature of field</firstterm>.
de: Zur Aufnahme von Bilder werden Teleskope mit Linsen und Spiegeln verwendet. Leider gibt es bei beiden Arten von Teleskopen Bildstörungen, die als <firstterm>Aberrationen</firstterm> bezeichnet werden. Einige Aberrationen treten sowohl bei Linsen wie auch bei Spiegeln auf, wie zum Beispiel <firstterm>Astigmatismus</firstterm> und <firstterm>Bildfeldwölbung</firstterm>.

source: <firstterm>Astigmatism</firstterm> appears when different parts of the lens or mirror make the rays of the incoming light to converge in slightly different locations on the focal plane. When corrected for astigmatism, <firstterm>curvature of field</firstterm> may appear on the surface of the lens/ mirror, which makes the light to converge on a curve rather than on a plane.
de: <firstterm>Astigmatismus</firstterm> tritt auf, wenn verschiedene Bereiche einer Linse oder eines Spiegels die Lichtstrahlen auf verschiedene Stellen auf der Brennebene bündeln. Wenn der Astigmatismus korrigiert wird, können <firstterm>Bildfeldwölbungen</firstterm> auf der Oberfläche von Linse oder Spiegel auftreten, die das Licht auf einer gekrümmten Fläche statt einer Ebene zusammenführen.

source: Still, there are also lens specific aberrations and mirror specific aberrations.
de: Außerdem gibt es noch Aberrationen, die entweder nur bei Linsen oder nur bei Spiegeln auftreten.

source: <firstterm>Chromatic aberration</firstterm> is a feature of telescopes that use lenses to converge the light. Mainly, the focal length of a lens is wavelength dependent, which means that the focal point of blue light differs from that of the red light. This results in a blurred image. The effect of chromatic aberration can be diminished by adding correcting lenses into the system. <firstterm>Spherical</firstterm> aberration may also be a problem for lenses, resulting from their shape. Spheroid surfaces will not make the incoming light to converge to a single point, which is why other optical surfaces like paraboloids are preferred. Even by using them we aren't still out of trouble, as coma aberration appears in this case. It results from the dependence of the focal length on the angle between the direction of the incoming ray and the optical axis of the system. Thus, images of points that lie off the optical axis are elongated, rather than being simple points, as it would be normal.
de: <firstterm>Chromatische Aberration</firstterm> tritt bei Teleskopen auf, die das Licht mit Linsen zusammenführen. Die Brennweite einer Linse hängt von der Wellenlänge des Lichts an, so dass blues und rotes Licht verschiedene Brennpunkte haben, das führt zu einem unscharfen Bild. Der Effekt der chromatischen Aberration kann durch Verwendung von Korrekturlinsen im System verringert werden. Ein weiteres Problem bei Linsen ist die <firstterm>Sphärische Aberration</firstterm>,deren Ursache in der Linsenform liegt. Sphärische Oberflächen führen dazu, dass das einfallende Licht nicht an einem einzelnen Punkt gebündelt wird. Daher werden andere optische Oberflächen wie Paraboloide bevorzugt. Aber auch mit paraboloiden Oberflächen treten es noch Abbildungsfehler wie in diesem Fall Asymmetriefehler auf. Die Ursache liegt in der Abhängigkeit der Brennweite vom Winkel zwischen der Richtung des einfallenden Lichts und der optischen Achse des Systems. Daher werden Bilder von Punkten neben den optischen Achse gestreckt und sind keine einfachen Punkte.

source: Magnification
de: Vergrößerung

source: <firstterm>Magnification</firstterm>, the increase in angular size of an object as viewed in a telescope, is described as the ratio of the focal length of the objective to the focal length of the eyepiece. So the greater the focal length of the objective, the greater the magnification. If you want to have a large image then you need a long focal length objective and a short focal length eyepiece.
de: <firstterm>Vergrößerung</firstterm>, die Zunahme der Winkelgröße eines Objekts, das im Teleskop betrachtet wird, wird durch das Verhältnis der Brennweite des Objektivs zur Brennweite des Okulars definiert. Je größer die Brennweite des Objektivs ist, desto mehr wird das Objekt vergrößert. Für ein großes Bild brauchen Sie also ein Objektive mit großer Brennweite und ein Okular mit kurzer Brennweite.

source: As an example, if you have a 500 mm objective and a 25 mm eyepiece the resulting magnification will be 500 / 25, which is 20, or 20X.
de: Wenn Sie zum Beispiel ein Objektive mit 500 mm Brennweite und ein Okular mit 25 mm Brennweite verwenden, beträgt die daraus resultierende Vergrößerung 500 / 25 gleich 20 oder das 20-fache.

source: Field of View
de: Sichtfeld

source: The field of view is the angle covered on the sky by the telescope.<firstterm>The apparent</firstterm> field of view of a telescope is determined only by the eyepiece. It is a specific characteristic of it, usually around 52 degrees. In order to find the <firstterm>true field of view</firstterm> of a telescope, you need to divide the apparent field of view by the magnification. The true field of view is the actual angle covered on the sky by the telescope.
de: Das Sichtfeld ist der Winkelbereich des Himmels, der durch das Teleskop erfasst wird. Das <firstterm>scheinbare Sichtfeld</firstterm> eines Teleskops wird nur durch das Okular bestimmt und beträgt üblicherweise etwa 52 Grad. Um das <firstterm>tatsächliche Sichtfeld</firstterm> eines Teleskops zu ermitteln, muss das scheinbare Sichtfeld durch die Vergrößerung geteilt werden. Das tatsächliche Sichtfeld ist der aktuelle Winkelbereich des Himmels, der durch das Teleskop erfasst wird.

source: &kstars; has a tool to find and display (on the virtual sky) a true field of view called the <guilabel>FOV Indicator</guilabel>. Launch it by heading under the <menuchoice><guimenu>Settings</guimenu> <guisubmenu>FOV Symbols</guisubmenu><guimenuitem>Edit FOV Symbols</guimenuitem></menuchoice>. Clicking <guibutton>New</guibutton> will open a dialog with four different tabs: <guilabel>Eyepiece</guilabel>, <guilabel>Camera</guilabel>, <guilabel>Binocular</guilabel> and <guilabel>Radiotelescope</guilabel>. To compute the field of view, select the tab that applies and enter the specifications of the equipment. Finally, clicking <guibutton>Compute FOV</guibutton> will calculate and display the field of view immediately below. &kstars; can now also display this as a shape of that size on the virtual sky. To do so, enter a name for this particular field of view (such as <userinput>20mm eyepiece</userinput> or <userinput>DSLR with refractor</userinput>) and select a shape and color to be displayed. For <guilabel>Eyepiece</guilabel>, use <guilabel>Circle</guilabel> or <guilabel>Semitransparent circle</guilabel> as the shape since an eyepiece's field is round. For <guilabel>Camera</guilabel>, use <guilabel>Square</guilabel> (which is actually a rectangle) assuming the sensor or film is rectangular or square. When using multiple eyepieces and/or telescopes, it is good to distinguish them with different colors. Click <guibutton>OK</guibutton> to close the dialog. To show the shape on the screen, go back under the <menuchoice><guimenu>Settings</guimenu> <guisubmenu>FOV Symbols</guisubmenu></menuchoice> menus then select the new menu item with the name of whatever it was given. To disable it again, click the menu item again.
de: &kstars; stellt mit dem <guilabel>STF-Symbol</guilabel> ein Hilfsmittel bereit, um das tatsächliche Sichtfeld zu finden und auf dem virtuellen Himmelsbild anzuzeigen. Um diesen Dialog zu öffnen, wählen Sie <menuchoice><guimenu>Einstellungen</guimenu> <guisubmenu>STF-Symbole</guisubmenu><guimenuitem>STF-Symbole bearbeiten</guimenuitem></menuchoice>. Drücken Sie den Knopf <guibutton>Neu</guibutton>, dann wird ein Dialog mit vier Karteikarten angezeigt: <guilabel>Okular</guilabel>, <guilabel>Kamera</guilabel>, <guilabel>Fernglas</guilabel> und <guilabel>Radioteleskop</guilabel>. Um ein Sichtfeld zu berechnen, wählen Sie die gewünschte Karteikarte und geben die technischen Daten der Ausrüstung ein. Klicken Sie dann auf <guibutton>STF berechnen</guibutton> und das Sichtfeld wird berechnet und unter dem Knopf angezeigt. &kstars; kann dann dieses Sichtfeld mit der berechneten Größe auf dem virtuellen Himmelsbild anzeigen. Dazu müssen Sie einen Namen für das berechnete Sichtfeld wie <userinput>20 mm Objektiv</userinput> oder <userinput>DSLR mit Spiegel</userinput> eintragen. Stellen Sie dann Form und Farbe für dieses Sichtfeld ein. Verwenden Sie für ein <guilabel>Okular</guilabel> die Formen <guilabel>Kreis</guilabel> oder <guilabel>Halbtransparenter Kreis</guilabel>, da ein Okular ein rundes Sichtfeld hat ist. Für eine <guilabel>Kamera</guilabel> wählen Sie <guilabel>Quadrat</guilabel>, was tatsächlich ein Rechteck ist, da ein CCD-Sensor oder ein Film eine rechteckige bzw. quadratische Form hat. Wenn Sie mehrere Okulare oder Teleskope benutzen, sollten Sie sie durch verschiedene Farben unterscheidbar machen. Klicken Sie auf <guibutton>OK</guibutton>, um den Dialog zu schließen. Um das Symbol auf dem Bildschirm anzuzeigen, gehen Sie zum Menü <menuchoice><guimenu>Einstellungen</guimenu> <guisubmenu>STF-Symbole</guisubmenu></menuchoice>. Wählen Sie dann den neuen Menüeintrag mit dem von Ihnen vergebenen Namen. Um das Symbol wieder auszuschalten, klicken Sie noch einmal auf den Menüeintrag.

source: Types of Telescopes
de: Teleskoparten

source: As telescopes are used in observations over the entire electromagnetic spectrum, they are classified in Optical Telescopes, Ultraviolet, Gamma Ray, X-Ray, Infrared and Radio Telescopes. Each one of them has its own, well defined role in obtaining a detailed analysis of a celestial object.
de: Teleskope werden für Beobachtungen im gesamten elektromagnetischen Spektrum benutzt und werden in Optische, Ultraviolett-, Gammastrahlen-, Röntgen-, Infrarot- und Radio-Teleskope unterteilt. Jede dieser Teleskoparten wird für spezielle Beobachtungen benutzt, um eine ausführliche Analyse von Himmelskörpern durchzuführen.

source: Optical Telescopes
de: Optische Teleskope

source: Used for observations in the visible field of view, Optical Telescopes are mainly Refractors and Reflectors, the difference between the two of them being the way of collecting light from a star.
de: Optische Teleskope werden für die Beobachtung im sichtbaren Wellenbereich verwendet. Es handelt sich dabei überwiegend um Refraktoren oder Reflektoren bzw Spiegelteleskope. Der Unterschied zwischen Ihnen liegt in der Art, wie das Licht eines Stern gesammelt wird.

source: <firstterm>Refracting Telescopes</firstterm> use two lenses in order to create an image, a primary or <firstterm>objective lens</firstterm>, which collects the incoming light, forming an image in the focal plane and the <firstterm>eyepiece</firstterm>, which is acting as a magnifying glass used for observing the final image. The two lenses are situated at opposite ends of a moving tube and the distance between the two of them can be adjusted in order to obtain the final image.
de: <firstterm>Refraktorteleskope</firstterm> verwenden zwei Linsen, um ein Bild zu erzeugen, eine Primär- oder <firstterm>Objektivlinse</firstterm>, die das einfallende Licht bündelt und ein Bild auf dem Brennpunkt erzeugt und ein <firstterm>Okular</firstterm>, das als Vergrößerungsglas bei der Betrachtung des endgültigen Bilds funktioniert. Die zwei Linsen sind an entgegengesetzten Enden einer verschieblichen Röhre angeordnet. Die Entfernung zwischen beiden Linsen kann verändert werden, um das endgültige Bild zu erhalten.

source: The largest refracting telescope in the world is at the <firstterm>Yerkes Observatory</firstterm> in Williams Bay, Wisconsin. Built in 1897, it has a 1.02-m (40-in) objective and a focal length of 19.36 m.
de: Das größte Refraktorteleskop der Welt befindet sich im <firstterm>Yerkes Observatorium</firstterm> in Williams Bay, Wisconsin. Es wurde 1897 erbaut und hat ein Objektiv mit 1,02-m (40-in) Durchmesser und eine Brennweite von 19,36 m.

source: <firstterm>Reflecting Telescopes</firstterm>, on the other side, use mirrors instead of lenses in order to obtain the final image. By replacing the objective lens with a mirror, we obtain a focal point that lies on the path of the incoming light. An observer situated at this point could see an image, but he would block part of the incoming light. The focal point of the principal mirror is called <firstterm>prime focus</firstterm>, and this is also the name of the first category of reflecting telescopes. Thus, prime focus telescopes use a mirror in order to collect light from a celestial object and by reflection the image of the object may be observed from the prime focus of the telescope. Other types of reflecting telescopes are <firstterm>Newtonian</firstterm>, <firstterm>Cassegrain</firstterm> and <firstterm>Coude</firstterm>.
de: Im Gegensatz dazu verwenden <firstterm>Spiegelteleskope</firstterm> Spiegel anstatt Linsen, um das endgültige Bild zu erzeugen. Wird die Objektivlinse durch einen Spiegel ersetzt, entsteht ein Brennpunkt auf dem Weg des einfallenden Lichts. Ein Beobachter an diesem Punkt würde bereits ein Bild sehen, aber einen Teil des einfallenden Lichts blockieren. Der Brennpunkt des Hauptspiegels wird <firstterm>primärer Brennpunkt</firstterm> genannt. Dies ist auch die Bezeichnung der ersten Kategorie von Spiegelteleskopen. Folglich nutzen Teleskope mit primärem Brennpunkt einen Spiegel, um das einfallende Licht zu bündeln. Durch Spiegel kann das Bild des Objekts im primärem Brennpunkt des Teleskops betrachtet werden. Andere Arten von Spiegelteleskopen sind das <firstterm>Newton</firstterm>-, <firstterm>Cassegrain</firstterm>- und <firstterm>Coudé</firstterm>-Teleskop.

source: <firstterm>The Newtonian</firstterm> one uses an additional flat mirror placed in the vicinity of the prime focus, in the path of the reflected light. This results in moving the focal point to a different location, on one of the sides of the telescope, more accessible for observing. Of course, a mirror placed in the path of the reflected light will also block part of the incoming one, but if the ratio of the surface aeries of the primary mirror to the second one is big enough, the amount of the blocked incoming light is negligible.
de: Das <firstterm>Newton</firstterm>-Teleskop verwendet einen zusätzlichen flachen Ablenkspiegel in der Nähe des primären Brennpunkts im Pfad des reflektierten Lichts. Dies führt zur Verschiebung des Brennpunkts an einen anderen Ort an der Seite des Teleskops, der für die Beobachtung besser zu erreichen ist. Natürlich blockiert ein Spiegel im Pfad des reflektierten Lichts einen Teil des einfallenden Lichts, aber solange das Verhältnis der Oberfläche des primärem Spiegels zum Ablenkspiegel groß genug ist, kann die Menge des blockierten Lichts vernachlässigt werden.

source: <firstterm>The Cassegrain</firstterm> telescope is similar to the Newtonian one but this time the secondary mirror reflects light to the bottom of the telescope. There is a hole at the center of the primary mirror that lets the reflected light to go on its way until it converges to the focal point. The secondary mirror needs to be convex, as it is increasing the focal length of the optical system. The primary mirror of a Cassegrain Telescope is a paraboloid. By replacing it with a hyperboloid we obtain a Ritchey-Chretien telescope. The advantage of using a <firstterm>Ritchey-Chretien</firstterm> telescope is that it removes the coma of the classical reflectors.
de: Das <firstterm>Cassegrain</firstterm>-Teleskop hat einen ähnlichen Aufbau wie das Newton-Teleskop. Hier reflektiert der zweite Spiegel das Licht jedoch zum Primär- oder Hauptspiegel am Ende des Teleskops zurück. Der Primärspiegel hat in der Mitte ein Loch, durch das das reflektierte Licht durchlässt, bis es im Brennpunkt zusammen trifft. Der zweite Spiegel ist konvex geformt, da er die Brennweite des optischen Systems verlängert. Der Primärspiegel eines Cassegrain-Teleskops ist parabolisch geformt. Wird der Primärspiegel durch einen hyperboloiden Spiegel ersetzt, handelt es sich um ein Ritchey-Chrétien-Teleskop. Der Vorteil des <firstterm>Ritchey-Chrétien</firstterm>-Teleskops besteht darin, dass im Gegensatz zu den klassischen Spiegelteleskopen eine komafreie Abbildung ohne Asymmetriefehler erreicht wird.

source: <firstterm>The Coude</firstterm> type consists of more than one mirror that reflects the light to a special room, the Coude room, which is located below the telescope. The advantages of using a Coude telescope are varied, from obtaining a long focal length useful in different fields of astronomy and astrophysics, like spectroscopy to avoiding the usage of a massive instrument. But there are also disadvantages in using a Coude telescope, because the more mirrors are placed in the system, the less amount of light arrives at the detector. This happens because by using Aluminum mirrors, only 80 % of the incident light gets reflected.
de: Das <firstterm>Coudé</firstterm>-Teleskop besteht aus mehreren Spiegeln, die das Licht zum sogenannten Coudéraum reflektieren, der sich unterhalb des Teleskops befindet. Ein Coudé-Teleskop hat den Vorteil einer größeren Brennweite, die es in verschiedenen Bereichen der Astronomie und Astrophysik wie zum Beispiel bei der Spektroskopie vermeidet, ein zu großes Instrument benutzen zu müssen. Es gibt aber auch Nachteile bei einem Coudé-Teleskop, weil bei mehr Spiegeln im System weniger Licht auf den Detektor fällt. Die Ursache liegt darin, dass bei den verwendeten Aluminiumspiegeln nur 80 % des auftreffenden Lichts reflektiert wird.

source: <firstterm>Catadioptrics</firstterm> are types of telescopes that use systems of both lenses and mirrors for making the light to converge. The most popular catadioptric is the <firstterm>Schmidt-Cassegrain</firstterm> telescope. It has the advantage of providing a large angle field of view. In order to minimize coma, it uses a primary spheroidal mirror with a thin correcting lens that removes spherical aberrations. The secondary mirror is placed in the center of the correcting lens, reflecting light through a hole made in the primary mirror. Not as famous as the Schmidt-Cassegrain telescope but common though is the <firstterm>Maksutov</firstterm> telescope that also uses a correcting lens with the primary mirror, this time their surfaces being concentric.
de: Ein <firstterm>Spiegellinsen</firstterm>-Teleskop oder Katadioptrisches System verwendet als optische Elemente sowohl Spiegel als auch Linsen. Das bekannteste Katadioptrisches System ist das <firstterm>Schmidt-Cassegrain</firstterm>-Teleskop, das einen großen Sichtfeldwinkel hat. Um eine komafreie Abbildung ohne Asymmetriefehler zu erreichen, wird ein sphärischer Hauptspiegel mit einer dünnen Korrekturlinse zur Vermeidung sphärischer Abberation verwendet. Der zweite Spiegel liegt im Zentrum der Korrekturlinse und reflektiert das Licht durch eine Öffnung im Hauptspiegel. Weniger bekannt ist das <firstterm>Maksutov</firstterm>-Teleskop, das ebenfalls eine Korrekturlinse im Hauptspiegel verwendet, aber mit konzentrischen Oberflächen.

source: Observations in Other Wavelengths
de: Beobachtungen in anderen Wellenlängen
