Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdeedu/kstars_julianday.po
Languages: de

source: <title>Julian Day</title>
de: <title>Julianischer Tag</title>

source: <primary>Julian Day</primary>
de: <primary>Julianischer Tag</primary>

source: Julian Days are a way of reckoning the current date by a simple count of the number of days that have passed since some remote, arbitrary date. This number of days is called the <firstterm>Julian Day</firstterm>, abbreviated as <abbrev>JD</abbrev>. The starting point, <abbrev>JD=0</abbrev>, is January 1, 4713 BC (or -4712 January 1, since there was no year '0'). Julian Days are very useful because they make it easy to determine the number of days between two events by simply subtracting their Julian Day numbers. Such a calculation is difficult for the standard (Gregorian) calendar, because days are grouped into months, which contain a variable number of days, and there is the added complication of <link linkend="ai-leapyear">Leap Years</link>.
de: Der Julianische Kalender ist ein Verfahren, das aktuelle Datum einfach durch Zählen der Tage seit einem vergangenen, beliebigen Tag zu bestimmen. Diese Anzahl von Tagen wird als <firstterm>Julianischer Tag</firstterm> bezeichnet, abgekürzt mit <abbrev>JD</abbrev>. Der Startpunkt <abbrev>JD=0</abbrev> ist am 1. Januar 4713 v. Chr. (oder 1. Januar -4712, da es kein Jahr Null gab). Julianische Tage sind sehr nützlich, da sie es einfacher machen, die Anzahl von Tagen zwischen zwei Ereignissen zu ermitteln, indem einfach die zwei Julianischen Tagesdaten voneinander subtrahiert werden. Eine solche Berechnung ist schwer mit dem normalen (Gregorianischen) Kalender, da die Tage in Monate gruppiert sind, die eine unterschiedliche Anzahl von Tagen enthalten und eine weitere Schwierigkeit mit dem <link linkend="ai-leapyear">Schaltjahr</link> hinzukommt.

source: Converting from the standard (Gregorian) calendar to Julian Days and vice versa is best left to a special program written to do this, such as the &kstars; <link linkend="tool-calculator">Astrocalculator</link>. However, for those interested, here is a simple example of a Gregorian to Julian day converter:
de: Die Konvertierung vom normalen (Gregorianischen) Kalender in Julianische Tage und umgekehrt wird besser einem speziellen Programm überlassen, das dafür geschrieben wurde, wie dem &kstars;-<link linkend="tool-calculator">Astrorechner</link>. Dennoch ist hier für Interessierte ein einfaches Beispiel einer Umrechnung des Datums vom Gregorianischen in den Julianischen Kalender:

source: <abbrev>JD</abbrev> = <abbrev>D</abbrev> - 32075 + 1461*( <abbrev>Y</abbrev> + 4800 + ( <abbrev>M</abbrev> - 14 ) / 12 ) / 4 + 367*( <abbrev>M</abbrev> - 2 - ( <abbrev>M</abbrev> - 14 ) / 12 * 12 ) / 12 - 3*( ( <abbrev>Y</abbrev> + 4900 + ( <abbrev>M</abbrev> - 14 ) / 12 ) / 100 ) / 4
de: <abbrev>JT</abbrev> = <abbrev>T</abbrev> - 32075 + 1461*( <abbrev>J</abbrev> + 4800 + ( <abbrev>M</abbrev> - 14 ) / 12 ) / 4 + 367*( <abbrev>M</abbrev> - 2 - ( <abbrev>M</abbrev> - 14 ) / 12 * 12 ) / 12 - 3*( ( <abbrev>J</abbrev> + 4900 + ( <abbrev>M</abbrev> - 14 ) / 12 ) / 100 ) / 4

source: where <abbrev>D</abbrev> is the day (1-31), <abbrev>M</abbrev> is the Month (1-12), and <abbrev>Y</abbrev> is the year (1801-2099). Note that this formula only works for dates between 1801 and 2099. More remote dates require a more complicated transformation.
de: wobei <abbrev>T</abbrev> der Tag ist (1-31), <abbrev>M</abbrev> der Monat (1-12) und <abbrev>J</abbrev> das Jahr (1801-2099). Beachten Sie, dass diese Formel nur für Daten zwischen 1801 und 2099 funktioniert. Weiter entfernte Daten erfordern eine komplexere Umwandlung.

source: An example Julian Day is: <abbrev>JD</abbrev> 2440588, which corresponds to 1 Jan, 1970.
de: Ein Beispieldatum für den Julianischen Tag ist <abbrev>JD</abbrev> 2440588, das dem 1. Januar 1970 entspricht.

source: Julian Days can also be used to tell time; the time of day is expressed as a fraction of a full day, with 12:00 noon (not midnight) as the zero point. So, 3:00 pm on 1 Jan 1970 is <abbrev>JD</abbrev> 2440588.125 (since 3:00 pm is 3 hours since noon, and 3/24 = 0.125 day). Note that the Julian Day is always determined from <link linkend="ai-utime">Universal Time</link>, not Local Time.
de: Julianische Tage können auch dazu benutzt werden, die Zeit anzuzeigen, die Zeit des Tages wird als Teil eines vollen Tages angegeben mit 12:00 Mittag (nicht Mitternacht) als Nullpunkt. Also ist 15.00 Uhr am 1. Januar 1970 <abbrev>JD</abbrev> 2440588,125 (da 15.00 Uhr drei Stunden nach Mittag ist und 3/24 = 0,125 Tage). Beachten Sie, dass der Julianische Tag immer von der <link linkend="ai-utime">Universalzeit</link> bestimmt wird, nicht von der lokalen.

source: Astronomers use certain Julian Day values as important reference points, called <link linkend="ai-epoch">Epochs</link>. One widely-used epoch is called J2000; it is the Julian Day for 1 Jan, 2000 at 12:00 noon = <abbrev>JD</abbrev> 2451545.0.
de: Astronomen benutzen bestimmte Julianische Tage als wichtige Referenzpunkte, genannt <link linkend="ai-epoch">Epochen</link>. Eine weitverbreitete Epoche ist J2000, es ist der Julianische Tag für den 1. Januar 2000 um 12.00 Uhr Mittag = <abbrev>JD</abbrev> 2451545,0.

source: Much more information on Julian Days is available on the internet. A good starting point is the <ulink url="http://aa.usno.navy.mil/faq/docs/JD_Formula.html">U.S. Naval Observatory</ulink>. If that site is not available when you read this, try searching for <quote>Julian Day</quote> with your favorite search engine.
de: Weitere Informationen sind im Internet verfügbar. Ein guter Startpunkt ist das <ulink url="http://aa.usno.navy.mil/faq/docs/JD_Formula.html">U.S. Naval Observatory</ulink>. Falls diese Seite nicht verfügbar sein sollte, wenn Sie dies lesen, suchen Sie einfach nach <quote>Julianisches Datum</quote> mit Ihrer Lieblingssuchmaschine.
