Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdeedu/kstars_scriptbuilder.po
Languages: de

source: <title>The Script Builder Tool</title>
de: <title>Der Skriptbaukasten</title>

source: Tools
de: Hilfsmittel

source: Script Builder
de: Skriptbaukasten

source: KDE applications can be controlled externally from another program, from a console prompt, or from a shell script using the Inter-process communication protocol (&DBus;). &kstars; takes advantage of this feature to allow rather complex behaviors to be scripted and played back at any time. This can be used, for example, to create a classroom demo to illustrate an astronomical concept.
de: KDE-Anwendungen können extern von einem anderen Programm von der Befehlszeile aus kontrolliert werden oder von einem Shell-Skript, dass das Inter-Process Communication Protocol (&DBus;) benutzt. &kstars; benutzt diese Funktionen, um wirklich komplexe Verhaltensweisen in Skripte zu integrieren und zu jeder Zeit aufrufen zu können. Das kann dafür genutzt werden, um zum Beispiel eine Demonstration für ein astronomisches Konzept in der Schule zu erstellen.

source: The problem with &DBus; scripts is, writing them is a bit like programming, and can seem a daunting task to those who do not have programming experience. The Script Builder Tool provides a <abbrev>GUI</abbrev> point-and-click interface for constructing &kstars; &DBus; scripts, making it very easy to create complex scripts.
de: Das Problem mit &DBus;-Skripten ist, dass deren Erstellen ein bisschen wie Programmieren ist und dass es ein entmutigende Aufgabe für Menschen sein kann, die damit keine Erfahrung haben. Das Hilfsmittel Skriptbaukasten bietet eine Oberfläche zum klicken und ziehen, um &kstars;-&DBus;-Skripte zu erstellen und macht es dadurch sehr einfach, komplexe Skripte zu erstellen.

source: Introduction to the Script Builder
de: Einführung in den Skriptbaukasten

source: Before explaining how to use the Script Builder, I provide a very brief introduction to all of the <abbrev>GUI</abbrev> components; for more infomation, use the "What's This?" function.
de: Bevor erklärt wird, wie Sie den Skriptbaukasten benutzen, gebe ich hier eine sehr einfache Einführung in alle Oberflächenkomponenten. Für weitere Informationen benutzen Sie die Funktion <quote>Was ist das?</quote>.

source: <screeninfo>The Script Builder Tool</screeninfo>
de: <screeninfo>Das Hilfsmittel <quote>Skriptbaukasten</quote></screeninfo>

source: Script Builder Tool
de: Hilfsmittel <quote>Skriptbaukasten</quote>

source: The Script Builder is shown in the above screenshot. The box on the left is the <firstterm>Current Script box</firstterm>; it shows the list of commands that comprise the current working script. The box on the right is the <firstterm>Function Browser</firstterm>; it displays the list of all available script functions. Below the Function Browser, there is a small panel which will display short documentation about the script function highlighted in the Function Browser. The panel below the Current Script box is the <firstterm>Function Arguments panel</firstterm>; when a function is highlighted in the Current Script box, this panel will contain items for specifying values for any arguments that the highlighted function requires.
de: Der Skriptbaukasten wird im obigen Bildschirmfoto gezeigt. Auf der linken Seite sehen Sie das Feld <firstterm>Aktuelles Skript</firstterm>; mit der Liste der Befehle, die das aktuelle Skript umfasst. Das Feld auf der rechten Seite ist die <firstterm>Funktionsauswahl</firstterm>, sie zeigt eine Liste aller verfügbaren Skriptfunktionen an. Unter der Funktionsauswahl ist ein kleines Feld, das eine kurze Dokumentation über die Skriptfunktion anzeigt, die in der Funktionsauswahl ausgewählt ist. Das Feld unter dem aktuellen Skript ist das <firstterm>Feld für Funktionsargumente</firstterm>, wenn eine Funktion im Feld <quote>Aktuelles Skript</quote> ausgewählt ist, enthält dieses Feld Einträge, um die Argumente der hervorgehobenen Funktion zu bearbeiten.

source: Along the top of the window, there is a row of buttons which operate on the script as a whole. From left to right, they are: <guibutton>New Script</guibutton>, <guibutton>Open Script</guibutton>, <guibutton>Save Script</guibutton>, <guibutton>Save Script As...</guibutton>, and <guibutton>Test Script</guibutton>. The function of these buttons should be obvious, except perhaps the last button. Pressing <guibutton>Test Script</guibutton> will attempt to run the current script in the main &kstars; window. You should move the Script Builder window out of the way before pressing this, so you can see the results.
de: Oben im Fenster ist eine Reihe von Knöpfen, um ein Skript insgesamt zu bearbeiten. Von links nach rechts gibt es: <guibutton>Neues Skript</guibutton>, <guibutton>Skript öffnen</guibutton>, <guibutton>Skript speichern</guibutton>, <guibutton>Skript speichern unter ...</guibutton> und <guibutton>Skript testen</guibutton>, was das aktuelle Skript im &kstars;-Fenster ausführt. Sie sollten das Skriptbaukasten-Fenster zur Seite schieben, bevor Sie diesen Knopf drücken, damit Sie die Ergebnisse sehen können.

source: In the center of the window, there is a column of buttons which operate on individual script functions. From top to bottom, they are: <guibutton>Add Function</guibutton>, <guibutton>Remove Function</guibutton>, <guibutton>Copy Function</guibutton>, <guibutton>Move Up</guibutton>, and <guibutton>Move Down</guibutton>. <guibutton>Add Function</guibutton> adds the currently-highlighted function in the Function Browser to the Current Script box (you can also add a function by double-clicking on it). The rest of the buttons operate on the function highlighted in the Current Script box, either removing it, duplicating it, or changing its position in the current script.
de: In der Mitte des Fenster finden Sie eine Spalte mit Knöpfen, die die einzelnen Skriptfunktionen steuern. Von oben nach unten sind es: <guibutton>Funktion hinzufügen</guibutton>, <guibutton>Funktion entfernen</guibutton>, <guibutton>Funktion kopieren</guibutton>, <guibutton>Nach oben verschieben</guibutton> und <guibutton>Nach unten verschieben</guibutton>. <guibutton>Funktion hinzufügen</guibutton> fügt die aktuell ausgewählte Funktion in der Funktionsauswahl zu dem aktuellen Skript hinzu (Sie können die Funktion auch durch einen Doppelklick hinzufügen). Die übrigen Knöpfe bearbeiten die Funktion, die im aktuellen Skript ausgewählt ist. Sie entfernen sie, duplizieren sie oder ändern ihre Position im Skript.

source: Using the Script Builder
de: Den Skriptbaukasten benutzen

source: In order to illustrate using the Script Builder, we present a small tutorial example where we make a script that tracks the Moon while the clock runs at an accelerated rate.
de: Um die Benutzung des Skriptbaukastens vorzustellen, präsentieren wir ein kleines Beispiel, in dem wir ein Skript erstellen, das den Mond verfolgt, während die Zeit beschleunigt abläuft.

source: If we are going to track the Moon, we will need to point the display at it first. The <firstterm>lookToward</firstterm> function is used to do this. Highlight this function in the Function Browser, and note the documentation displayed in the panel below the Browser. Press the <guibutton>Add Function</guibutton> button to add this function to the Current Script box. The Function Arguments panel will now contain a combobox labeled <quote>dir</quote>, short for direction. This is the direction in which the display should be pointed. The combobox contains only the cardinal compass points, not the Moon or any other objects. You can either enter <quote>Moon</quote> in the box manually, or press the <guibutton>Object</guibutton> button to use the <guilabel>Find Object</guilabel> window to select the Moon from the list of named objects. Note that, as usual, centering on an object automatically engages object-tracking mode, so there is no need to add the <firstterm>setTracking</firstterm> function after lookToward.
de: Wenn wir den Mond verfolgen wollen, wir müssen die Anzeige darauf zentrieren. Die Funktion <firstterm>lookToward</firstterm> wird dazu benutzt. Wählen Sie diese Funktion in der Funktionsauswahl und beachten Sie die Beschreibung im Feld unter der Auswahl. Drücken Sie den Knopf <guibutton>Funktion hinzufügen</guibutton>, um diese Funktion in das Feld <quote>aktuelles Skript</quote> einzufügen. Das Feld für die Funktionsargumente wird nun ein Auswahlfeld namens <quote>Richtung</quote> haben. Das ist die Richtung, in die die Anzeige zeigen soll. Das Auswahlfeld enthält nur kardinale Kompasspunkte, nicht den Mond oder andere Objekte. Sie können entweder <quote>Moon</quote> (engl. für Mond) in das Feld manuell eingeben oder den Knopf <guibutton>Objekt</guibutton> drücken und das Fenster <guilabel>Objekt suchen</guilabel> benutzen, um den Mond aus der Liste der bekannten Objekte auszuwählen. Beachten Sie, dass als Standard bei der Zentrierung automatisch die Objektverfolgung angeschaltet wird, also muss die Funktion <firstterm>setTracking</firstterm> nicht nochmal benutzt werden.

source: Now that we have taken care of pointing at the Moon, we next want to make time pass at an accelerated rate. Use the <firstterm>setClockScale</firstterm> function for this. Add it to the script by double-clicking on it in the Function Browser. The Function Arguments panel contains a timestep spinbox for setting the desired time step for the simulation clock. Change the timestep to 3 hours.
de: Da jetzt die Verfolgung auf den Mond eingestellt ist, soll als nächstes der Zeitablauf beschleunigt werden. Benutzen Sie die Funktion <firstterm>setClockScale</firstterm> dafür. Fügen Sie sie dem Skript durch ein Doppelklick darauf in der Funktionsauswahl hinzu. Das Funktionsargumentefeld enthält ein Einstellfeld für den gewünschten Zeitschritt. Ändern Sie den Zeitschritt in 3 Stunden.

source: OK, we have pointed at the Moon and accelerated the clock. Now we just want the script to wait for several seconds while the display tracks on the Moon. Add the <firstterm>waitFor</firstterm> function to the script, and use the Function Arguments panel to specify that it should wait for 20 seconds before continuing.
de: Nun haben wir die Anzeige auf den Mond gerichtet und die Uhr beschleunigt. Nun möchten wir, dass das Skript einfach eine Weile wartet, während die Anzeige die Spur des Mondes verfolgt. Fügen Sie die Funktion <firstterm>waitFor</firstterm> zum Skript hinzu und benutzen Sie das Feld <quote>Funktionsargumente</quote> um anzugeben, dass es 20 Sekunden warten soll, ehe der nächste Schritt ausgeführt wird.

source: To finish up, let us reset the clock's timestep to the normal value of 1 second. Add another instance of setClockScale, and set its value to 1 sec.
de: Um das Ganze abzuschließen, lassen Sie uns den Zeitschritt auf den normalen Wert von einer Sekunde zurücksetzen. Fügen Sie eine weitere Funktion <quote>setClockScale</quote> hinzu und setzen Sie den Wert auf eine Sekunde.

source: Actually, we are not quite done yet. We should probably make sure that the display is using Equatorial coordinates before the script tracks the Moon with an accelerated time step. Otherwise, if the display is using Horizontal coordinates, it will rotate very quickly through large angles as the Moon rises and sets. This can be very confusing, and is avoided by setting the View Option <firstterm>UseAltAz</firstterm> to <quote>false</quote>. To change any View Option, use the <firstterm>changeViewOption</firstterm> function. Add this function to the script, and examine the Function Arguments panel. There is a combobox which contains the list of all options which can be adjusted by changeViewOption. Since we know we want the UseAltAz option, we could simply select it from the combobox. However, the list is quite long, and there is no explanation of what each item is for. It therefore may be easier to press the <guibutton>Browse Tree</guibutton> button, which will open a window containing a tree view of the available options, organized by topic. In addition, each item has a short explanation of what the option does, and the data type of the option's value. We find UseAltAz under the <guilabel>Skymap options</guilabel> category. Just highlight this item and press <guibutton>OK</guibutton>, and it will be selected in the combobox of the Function Arguments panel. Finally, make its value <quote>false</quote> or <quote>0</quote>.
de: Wir sind noch nicht ganz fertig. Wir sollten vielleicht sicherstellen, das die Ansicht auf äquatoriale Koordinaten geschaltet ist, bevor das Skript dem Mond Folgt. Wenn die Ansicht auf horizontale Koordinaten geschaltet ist, wird sich die Anzeige sehr schnell um große Winkel drehen, wenn der Mond auf- und untergeht. Das kann sehr verwirrend sein und wird vermieden, indem die Ansichtsoption <firstterm>UseAltAz</firstterm> auf <quote>false</quote> gesetzt wird. Um die Ansichtseinstellungen zu verändern, benutzen Sie die Funktion <firstterm>changeViewOption</firstterm>. Fügen Sie diese Funktion Ihrem Skript hinzu und schauen Sie in das Argumentefeld. Hier ist ein Auswahlfeld, das alle Anzeigeeinstellungen enthält, die von <quote>changeViewOption</quote> verändert werden können. Da wir wissen, dass wir die Einstellung <quote>UseAltAz</quote> benutzen, können wir sie einfach auswählen. Jedoch ist die Liste sehr lang und es gibt keine Erklärung für jeden Eintrag. Deshalb ist es vielleicht einfacher, mit dem Knopf <guibutton>Baum durchforsten</guibutton> ein Fenster mit einer Baumliste aller Anzeigeeinstellungen, geordnet nach Themen, zu öffnen. Zusätzlich hat jeder Eintrag eine kurze Erklärung über die Einstellung und den Datentyp des Einstellungswertes. Wir finden UseAltAz in der Kategorie <guilabel>Himmelskarteneinstellungen</guilabel>. Wählen Sie einfach den Eintrag und drücken Sie <guibutton>Ok</guibutton> und er wird im Feld <quote>Funktionsargumente</quote> ausgewählt. Zum Schluss setzen Sie den Wert auf <quote>false</quote> (falsch) oder <quote>0</quote>.

source: One more step: changing UseAltAz at the end of the script does us no good; we need this to be changed before anything else happens. So, make sure this function is highlighted in the Current Script box, and press the <guibutton>Move Up</guibutton> button until it is the first function.
de: Ein weiterer Schritt: Das Ändern von UseAltAz am Ende des Skriptes hat keine Auswirkungen, da UseAltAz geändert werden muss, bevor andere Funktionen aufgerufen werden. Also wählen Sie diese Funktion in der Feld <quote>Aktuelles Skript</quote> und drücken solange den Knopf <guibutton>Nach oben verschieben</guibutton>, bis die Funktion an erster Stelle steht.

source: Now that we have finished the script, we should save it to disk. Press the <guibutton>Save Script</guibutton> button. This will first open a window in which you can provide a name for the script, and fill in your name as the author. Enter <quote>Tracking the Moon</quote> for a name, and your name as the author, and press <guibutton>OK</guibutton>. Next, you will see the standard &kde; Save File dialog. Specify a filename for the script and press <guibutton>OK</guibutton> to save the script. Note that if your filename does not end with <quote>.kstars</quote>, this suffix will be automatically attached. If you are curious, you can examine the script file with any text editor.
de: Nun da wir das erste Skript erstellt haben, sollten wir es speichern. Drücken Sie den Knopf <guibutton>Skript speichern</guibutton>. Das öffnet zuerst ein Fenster, in das Sie den Namen für das Skript und Ihren Namen als Autor eintragen können. Geben Sie <quote>Verfolgung des Mondes</quote> als Namen und Ihren Namen als Autor ein und drücken <guibutton>OK</guibutton>. Als Nächstes sehen Sie einen &kde;-Speichern-Dialog. Geben Sie einen Dateinamen für das Skript an und drücken <guibutton>Ok</guibutton>, um es zu speichern. Wenn Ihr Dateiname nicht mit <quote>.stars</quote> endet, wird diese Erweiterung wird automatisch angefügt. Wenn Sie neugierig sind, können Sie die Skriptdatei mit jedem Texteditor ansehen.

source: Now that we have a completed script, we can run it in a couple of ways. From a console prompt, you can simply execute the script as long as an instance of &kstars; is currently running. Alternatively, you can execute the script from within &kstars; using the <guimenuitem>Run Script</guimenuitem> item in the <guimenu>File</guimenu> menu.
de: Nun haben wir ein komplettes Skript, wir können es auf verschieden Wegen starten. Von einer Befehlszeile können Sie einfach das Skript ausführen, während &kstars; läuft. Alternativ können Sie das Skript aus &kstars; mit dem Eintrag <guimenuitem>Skript ausführen</guimenuitem> aus dem Menü <guimenu>Datei</guimenu> starten.
