Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdeedu/kstars_faq.po
Languages: de

source: Questions and Answers
de: Fragen und Antworten

source: What is the &kstars; Icon?
de: Was ist das &kstars; Symbol?

source: The <guiicon>&kstars; Icon</guiicon> is a sextant, a handheld telescope which was used by navigators on sailing ships back when the stars were important for navigation. By carefully reckoning the positions of the stars, the navigator could get an accurate estimate of the ship's current <link linkend="ai-geocoords">longitude and latitude</link>.
de: Das <guiicon>&kstars;-Symbol</guiicon> ist ein Sextant, ein Handteleskop, das für die Navigation auf Segelschiffen benutzt wurde, als die Sterne noch wichtig für die Navigation waren. Indem er vorsichtig die Positionen der Sterne beobachtete, konnte der Steuermann ziemlich genauen Werte für <link linkend="ai-geocoords">Breiten- und Längengrad</link> der Schiffsposition bekommen.

source: What do the different symbols for deep-sky objects mean?
de: Was bedeuten die verschiedenen Symbole für weit entfernte Objekte?

source: The symbol indicates the object type:
de: Die Symbole zeigen den Objekttyp an:

source: dotted circle: Open Cluster
de: gepunkteter Kreis: Offener Sternhaufen

source: cross-in-circle: Globular Cluster
de: Kreis mit Kreuz: Kugelförmiger Sternhaufen

source: box: Gaseous Nebula
de: Kästchen: Gasnebel

source: diamond: Supernova Remnant
de: Diamant: Überreste einer Supernova

source: circle with outer lines: Planetary Nebula
de: Kreis mit Außenlinien: planetarischer Nebel

source: ellipse: Galaxy
de: Ellipse: Galaxie

source: What do the different colors of Deep-sky objects mean?
de: Was bedeuten die verschiedenen Farben von weit entfernten Objekten?

source: Generally, the different colors indicate to which catalog the object belongs (Messier, NGC or IC). However, some objects have a different color which indicates that there are extra images available in the <link linkend="popup-menu">popup menu</link> (the default <quote>extras</quote> color is red).
de: Im Allgemeinen zeigen die verschiedenen Farben an, zu welchem Katalog das Objekt gehört (Messier, NGC oder IC). Jedoch haben einige Objekte eine andere Farbe (standardmäßig rot). Damit wird anzeigt, dass zusätzliche Bilder im <link linkend="popup-menu">Kontextmenü</link> verfügbar sind.

source: Why are there so many more U.S. cities than in other countries?
de: Warum gibt es mehr Städte aus den USA als aus anderen Staaten?

source: When we started &kstars;, we were unable to find a longitude/latitude database that covered the globe equitably. However, the &kstars; community is rapidly overcoming this problem! We have already received city lists from many users around the world. If you can contribute to this effort, please send us your list of cities and coordinates.
de: Es war uns nicht möglich, eine Datenbank der Längen- und Breitengrade zu finden, die den ganzen Erdball gleichmäßig berücksichtigt. Die Benutzer von &kstars; arbeiten jedoch schon daran. Wir haben schon Listen von vielen Benutzern aus der ganzen Welt erhalten. Wenn Sie dazu beitragen können, schicken Sie uns Ihre Liste der Städte mit den Koordinaten.

source: I have added a custom location to &kstars; that I no longer want. How do I remove it from the program?
de: Ich habe einen eigenen Standort in &kstars; eingefügt, den ich aber nicht mehr brauche. Wie kann ich diesen Eintrag aus dem Programm löschen?

source: You will have to edit the <filename>~/.kde/share/apps/kstars/mycities.dat</filename> file, and remove the location's line from that file.
de: Sie müssen die Datei <filename>~/.kde/share/apps/kstars/mycities.dat</filename> bearbeiten und Zeile mit diesem Standort daraus entfernen.

source: Why can I not display the ground when using Equatorial Coordinates?
de: Warum kann ich den Boden nicht anzeigen, wenn ich das äquatoriale Koordinatensystem benutze?

source: The short answer is, this is a temporary limitation. There is a problem when constructing the filled polygon that represents the ground when in Equatorial mode. However, it does not make too much sense to draw the ground in equatorial coordinates, which is why this fix has been given a low priority.
de: Die kurze Antwort ist, dass das eine vorläufige Beschränkung ist. Es gibt ein Problem mit der Erzeugung des gefüllten Vielecks, das den Boden darstellt, wenn Sie sich im äquatorialen Modus befinden. Allerdings ergibt es keinen Sinn, den Boden im äquatorialen Koordinatensystem anzuzeigen. Darum wurde dieser Aufgabe eine geringe Priorität gegeben.

source: Why do some objects disappear when I am scrolling the display?
de: Warum verschwinden manche Objekte, wenn ich die Anzeige verschiebe?

source: When the display is in motion, &kstars; must recompute the screen coordinates of every object in its database, which involves some pretty heavy trigonometry. When scrolling the display (either with the arrow keys or by dragging with the mouse), the display may become slow and jerky, because the computer is having trouble keeping up. By excluding many of the objects, the computational load is greatly reduced, which allows for smoother scrolling. You can turn off this feature in the <guilabel>Configure &kstars;</guilabel> window, and you can also configure which objects get hidden.
de: Wenn Sie die Zentralposition der Anzeige verschieben, muss &kstars; die Pixelkoordinaten jedes Objektes in seiner Datenbank neu berechnen, was einige wirkliche aufwendige trigonometrische Rechnungen nach sich zieht. Wenn Sie die Anzeige verschieben (entweder mit den Pfeiltasten oder mit der Maus) wird die Anzeige langsam und ruckartig, da der Computer Probleme hat, mitzukommen. Indem er viele Objekte ausschließt, kann die Belastung des Computers verringert werden und das Verschieben wird schnell und flüssig. Sie können dieses Verhalten im Dialog <guilabel>&kstars; einrichten</guilabel> abschalten und auch einstellen, welche Objekte ausgeblendet werden.

source: I do not understand all the terms used in &kstars;. Where can I learn more about the astronomy behind the program?
de: Ich verstehe die ganzen Ausdrücke nicht, die in &kstars; benutzt werden. Wo kann ich mehr über die Astronomie hinter dem Programm lernen?

source: The &kstars; Handbook includes the <link linkend="astroinfo">AstroInfo Project</link>; a series of short, hyperlinked articles about astronomical topics that can be explored and illustrated with &kstars;. AstroInfo is a community effort, like GNUpedia or Everything2. If you'd like to contribute to AstroInfo, please join our mailing list: <email>kstars-devel@kde.org</email>.
de: Das Handbuch zu &kstars; enthält das <link linkend="astroinfo">AstroInfo-Projekt</link>; eine Anzahl von kurzen, verknüpften Artikeln über astronomische Themen, die mit &kstars; entdeckt und ausgeführt werden können. AstroInfo ist ein Gemeinschaftsprojekt, wie GNUpedia oder Everything2. Wenn Sie zu AstroInfo beitragen möchten, bitte treten Sie unserer Mailingliste bei <email>kstars-devel@kde.org</email>.

source: I want &kstars; to start up with a time and date different from my system CPU clock. Is this possible?
de: Ich möchte &kstars; mit einem bestimmten Datum und Zeit abweichend von der Zeit meines Computers starten. Ist das möglich?

source: Yes; to start kstars with a different time/date, use the <quote>--date</quote> argument, followed by a date string like <quote>4 July 1976 12:30:00</quote>
de: Ja, um KStars mit einem bestimmten Fatum und Zeit zu starten, benutzen Sie das Argument <quote>--date</quote>, gefolgt von einer Zeichenkette für das Datum wie <quote>4 July 1976 12:30:00</quote>

source: I want &kstars; to start up with the simulation clock paused. Is this possible?
de: Ich möchte &kstars; mit angehaltener Systemuhr starten. Ist das möglich?

source: Yes; to start kstars with the clock paused, simply add the <quote>--paused</quote> argument to the command line.
de: Ja, um KStars mit angehaltener Systemuhr zu starten, fügen Sie einfach das Argument <quote>--paused</quote> in der Befehlszeile an

source: How accurate/precise is &kstars;?
de: Wie genau ist &kstars;?

source: &kstars; is pretty accurate, but it is not (yet) as precise as it can possibly be. The problem with high-precision calculations is that you start having to deal with a large number of complicating factors. If you are not a professional astronomer, you will probably never have a problem with its accuracy or precision.
de: &kstars; ist schon ziemlich genau, aber es ist (noch) nicht so genau wie es sein könnte. Das Problem mit den hochpräzisen Rechnungen ist, dass man sich mit einer großen Anzahl von komplizierten Faktoren herumschlagen muss. Wenn Sie kein professioneller Astronom sind, werden Sie vielleicht nie ein Problem mit der Genauigkeit haben.

source: Here is a list of some of the complicating factors which limit the program's precision:
de: Hier ist eine Liste einiger Faktoren, die die Genauigkeit des Programms begrenzen:

source: Planet positions are only accurate for dates within 4000 years or so of the current epoch. The planet positions are predicted using a Fourier-like analysis of their orbits, as observed over the past few centuries. We learnt in school that planets follow simple elliptical orbits around the Sun, but this is not strictly true. It would be true only if there was only one planet in the Solar system, and if the Sun and the planet were both point masses. As it is, the planets are constantly tugging on each other, perturbing the orbits slightly, and tidal effects also induce precessional wobbling. In fact, recent analysis suggests that the planets' orbits may not even be stable in the long term (i.e., millions or billions of years). As a rule of thumb, you can expect the position of a planet to be accurate to a few arcseconds between the dates -2000 and 6000.
de: Die Planetenpositionen sind nur für Daten innerhalb 4000 Jahren der aktuellen Epoche genau. Sie werden mit einer Fourier-ähnlichen Analyse Ihrer Bahnen berechnet, wie sie über die letzten Jahrhunderte beobachtet wurden. Wir lernen in der Schule, dass die Planeten einfachen elliptischen Bahnen um die Sonne folgen, aber das stimmt nicht ganz genau. Es wäre richtig, wenn es nur einen Planeten im Sonnensystem gäbe und die Sonne und der Planet beide Punktmassen wären. Die Planeten beeinflussen sich aber ständig gegenseitig und stören die Bahnverläufe ein wenig, zusätzlich erzeugen die Gezeiteneffekte eine Kreiselschwankung. Tatsächlich ergeben neueste Analysen, dass die Planetenbahnen noch nicht mal in einem großen Zeitraum (also in Millionen oder Milliarden Jahren) stabil sind. Als eine Daumenregel können Sie erwarten, dass die Position eines Planeten auf wenige Winkelsekunden zwischen den Jahren -2000 und 6000 genau sind.

source: Pluto is the exception to this; its position is perhaps ten times less precise than the positions of the other planets. Still, for dates near the present epoch, its position can be trusted to about an arcsecond.
de: Pluto ist dabei eine Ausnahme. Seine Position ist vielleicht zehnfach weniger genau als die Positionen der anderen Planeten. Allerdings ist seine Position in Zeiten nahe der aktuellen Epoche bis auf eine Winkelsekunde richtig.

source: The moon's position is the most difficult to predict to high precision. This is because its motion is quite perturbed by the Earth. Also, since it is so nearby, even minute effects that would be undetectable in more distant bodies are easily apparent in the moon.
de: Die Mondposition ist am schwierigsten zu berechnen. Das kommt zum einen durch die Störung der Erde und durch die Nähe des Mondes zur Erde. Sogar kleine Effekte, die bei weiter entfernten Objekten nicht bemerkbar wären, werden beim Mond schnell offenbar.

source: The objects with the worst long-term precision in the program are the comets and asteroids. We use a very simplistic orbital model for the minor planets that does not include third-body perturbations. Therefore, their positions can only be trusted for dates near the present epoch. Even for the present epoch, one can expect positional errors among the minor planets of order 10 arcseconds or more.
de: Die Objekte mit der schlechtesten Genauigkeit im Programm auf lange Zeiträume gesehen sind Kometen und Asteroiden. Wir benutzen ein sehr einfaches Orbitalmodell, das keine Störungen durch dritte Körper einberechnet. Also sind die Positionen nur für Zeitdaten nahe der aktuellen Epoche ausreichend genau. Sogar für die aktuelle Epoche muss man mit Fehlern von 10 Bogensekunden und mehr rechnen.

source: Why do I have to download an improved NGC/IC catalog and Messier object images? Why not just include them as part of the &kstars; distribution?
de: Warum muss ich einen zusätzlichen NGC/IC-Katalog und Messier Objektbilder herunterladen? Warum werden diese Dateien nicht mit KStars geliefert?

source: The author of the downloadable NGC/IC catalog has released it with the restriction that it may not be used commercially. For most &kstars; users, this is not a problem. However, it is technically against the &kstars; license (the <acronym>GPL</acronym>) to restrict usage in this way. We removed the Messier object images from the standard distribution for two reasons: to simply reduce the size of &kstars;, and also because of similar licensing concerns with a couple of the images. The inline images are significantly compressed to a very low quality from their original form, so I doubt there is a real copyright concern, but I did obtain explicit permission from the images' authors to use the few images for which there was any question about it (see <filename>README.images</filename>). Still, just to be absolutely safe, I removed them from the standard distribution, and marked the download archive as being "free for non-commercial use".
de: Der Autor des NGC/IC-Katalogs, der heruntergeladen werden kann, hat diesen Katalog mit der Beschränkung auf eine nicht-kommerziellen Nutzung zur Verfügung gestellt. Für die meisten Benutzer von &kstars; ist das kein Problem. Eine Beschränkung dieser Art widerspricht jedoch in technischer Hinsicht der Lizenz von &kstars; (der <acronym>GPL</acronym>). Die Messier Objektbilder werden aus zwei Gründen nicht mit dem Programm ausgeliefert: Um die Größe des Paketes zu verringern und wegen ähnlicher Lizenzprobleme mit einigen Bildern. Die eingebundenen Bilder sind auf eine sehr schlechte Qualität im Vergleich zu den Originalen komprimiert, sodass es keine Probleme mit dem Copyright geben sollte, aber ich habe die ausdrückliche Erlaubnis des Autors für einige Bilder erhalten, deren Verwendung zweifelhaft war (siehe <filename>README.images</filename>). Um aber absolut sicher zu sein, habe ich die Bilder aus dem Programm entfernt und die Archive, die Sie herunterladen können, mit <quote>Frei für nicht-kommerzielle Nutzung</quote> gekennzeichnet.

source: I am really enjoying the beautiful images I have downloaded through &kstars;! I would like to share them with the world; can I publish a calendar featuring these images (or are there any usage restrictions on the images)?
de: Die schönen Bilder, die ich mit &kstars; heruntergeladen habe, gefallen mir sehr! Ich möchte einige Bilder benutzen und einen Kalender mit diesen Bilder veröffentlichen (oder gibt es irgendwelche Einschränkungen bei der Nutzung dieser Bilder)?

source: It depends on the image, but many of the images restrict against commercial usage. The Image Viewer's statusbar will usually contain information about the image's copyright holder, and what usage restrictions apply. As a rule of thumb: anything published by NASA is in the public domain (including all HST images). For everything else, you can pretty safely assume that the images may not be used commercially without permission. When in doubt, contact the image's copyright holder directly.
de: Das hängt vom Bild ab, aber bei vielen Bildern ist eine kommerzielle Nutzung nicht erlaubt. In der Statusleiste des Bildbetrachters wird normalerweise der Inhaber des Copyrights und die Nutzungbeschränkungen angezeigt. Es gilt folgende Faustregel: Alle von der NASA herrausgegebenen Bilder sind Public Domain (einschließlich aller HST-Bilder). Bei allen anderen Bilder können Sie davon ausgehen, dass eine kommerzielle Nutzung nur mit Einwilligung möglich ist. In Zweifelsfällen fragen Sie den Inhaber des Copyrights.

source: Can I help contribute to future versions of &kstars;?
de: Kann ich bei zukünftigen Versionen von &kstars; irgendwie dazu beitragen?

source: Yes, definitely! Introduce yourself on our mailing list: <email>kstars-devel@kde.org</email>. If you want to help with the coding, download the latest <ulink url="http://techbase.kde.org/Projects/Edu/KStars/Building_KStars">&kstars; Git</ulink> version of the code and dive right in. There are several README files in the distribution that explain some of the code's subsystems. If you need ideas of what to work on, see the TODO file. You can submit patches to kstars-devel, and feel free to post any questions you have about the code there as well.
de: Aber sicher doch! Melden Sie sich mal auf unserer Mailingliste: <email>kstars-devel@kde.org</email>. Wenn Sie beim Programmieren mithelfen wollen, können Sie sich die neueste <ulink url="http://techbase.kde.org/Projects/Edu/KStars/Building_KStars">&kstars; Git</ulink>-Version des Quelltextes herunterladen und studieren. Es gibt einige README-Dateien im Paket, die einige Teile des Quelltextes genauer erklären. Falls Sie Ideen brauchen, an was Sie arbeiten können, schauen Sie in die Datei TODO. Sie können Korrekturen an kstars-devel schicken, und können hier auch Fragen zum Quelltext zu stellen.

source: If you are not into coding, we can still use your help with i18n, docs, AstroInfo articles, &URL; links, bug reports, and feature requests.
de: Wenn Sie nicht so gut im Programmieren sind, können wir Ihre Hilfe immer noch bei der Übersetzung, für die Dokumentation, für AstroInfo- Artikel, Adressen (&URL;s) Verknüpfungen auf Webseiten, Fehlerberichte und für Wünsche gebrauchen.
