Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdeedu/kstars_ai-contents.po
Languages: de

source: AstroInfo: Table of Contents
de: AstroInfo: Inhaltsverzeichnis

source: The Sky and Coordinate Systems
de: Der Himmel und Koordinatensysteme

source: Celestial Coordinate Systems
de: Himmelskoordinatensysteme

source: Celestial Equator
de: Himmelsäquator

source: Celestial Poles
de: Himmelspole

source: Celestial Sphere
de: Himmelssphäre

source: The Ecliptic
de: Die Ekliptik

source: The Equinoxes
de: Die Tagundnachtgleichen

source: Geographic Coordinates
de: Geografische Koordinaten

source: Great Circles
de: Großkreise

source: The Horizon
de: Der Horizont

source: Hour Angle
de: Stundenwinkel

source: Local Meridian
de: Lokaler Meridian

source: Precession
de: Kreiselbewegung

source: The Zenith
de: Der Zenit

source: Time
de: Zeit

source: Epoch
de: Epoche

source: Julian Day
de: Julianischer Tag

source: Leap Years
de: Schaltjahre

source: Sidereal Time
de: Sternenzeit

source: Time Zones
de: Zeitzonen

source: Universal Time
de: Universalzeit

source: Instrumentation
de: Instrumente

source: Telescopes
de: Teleskope

source: Physics
de: Physik

source: Blackbody Radiation
de: Schwarzkörperstrahlung

source: Dark Matter
de: Dunkle Materie

source: Flux
de: Energiefluss

source: Luminosity
de: Leuchtkraft

source: Parallax
de: Parallaxe

source: Retrograde Motion
de: Rückläufige Bewegung

source: Astrophysics
de: Astrophysik

source: Elliptical Galaxies
de: Elliptische Galaxien

source: Spiral Galaxies
de: Spiralgalaxien

source: The Magnitude Scale
de: Die Magnitudenskala

source: Stars: An Introductory FAQ
de: Sterne: Einführende Fragen und Antworten

source: Star Colors and Temperatures
de: Sternenfarben und Temperaturen

source: The Cosmic Distance Ladder
de: Die kosmische Entfernungsleiter
