Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdeedu/kstars_telescopes.po
Languages: de

source: For a detailed analysis of the sky, observations are also carried in other regions of the electromagnetic spectrum. Very popular and efficient are <firstterm>radio telescopes</firstterm>, developed mostly in the last century. A common problem for both radio and optical telescopes is the need for better resolution. We can derive the resolution of a telescope by using Rayleigh criterion, that states the resolving power is equal to the ratio of the incoming wavelength to the diameter of the aperture (times 1.22 for circular apertures). So for a good resolution we need a diameter as big as possible. The biggest radio telescope in the world is the Arecibo telescope from Puerto Rico that uses a huge dish of 305 m diameter. In order to solve the problem for resolutions, astronomers have developed a new technique called interferometry. The basic principal of interferometry is that by observing the same object with two distinct telescopes we can obtain a final image by "connecting" the two initial ones. Nowadays, the most efficient observatory that uses interferometry is the Very Large Array located near Socorro, New Mexico. It uses 27 telescopes placed in a "Y" shape, with 25 m aperture each. There also exists a technique called Very Long Baseline Interferometry (VLBI) that allows astronomers to resolve images over the size of continents. The biggest project of the century in this domain is the building of the Atacama Large Millimeter Array (ALMA), which will be using 66 telescopes placed in the Atacama desert of northern Chile.
de: Für eine genaue Analyse des Himmels werden Beobachtungen auch in anderen Bereichen des elektromagnetischen Spektrums durchgeführt. <firstterm>Radioteleskope</firstterm> sind sehr populär und effizient, sie wurden im letzten Jahrhundert entwickelt. Ein gemeinsames Problem von Radio- und optischen Teleskopen ist die Notwendigkeit einer besseren Auflösung. Die Auflösung eines Teleskops kann aus dem Rayleigh-Kriterium abgeleitet werden. Das Kriterium besagt, dass die Auflösung aus dem Verhältnis der eintreffenden Wellenlänge zum Durchmesser der Blendenöffnung bestimmt wird. Dieses Verhältnis beträgt 1,22 für runde Blendenöffnungen. Für eine gute Auflösung ist also ein möglichst großer Durchmesser nötig. Das größte Radioteleskop der Welt ist das Arecibo-Teleskop in Puerto Rico. Es hat eine riesige Schüssel mit einem Durchmesser von 305 Meter. Um bessere Auflösungen zu erreichen, haben Astronomen eine neue Technik namens Interferometrie entwickelt. Das grundlegende Prinzip der Interferometrie besteht darin, dass durch die Beobachtung des gleichen Objekts mit verschiedenen Teleskopen ein endgültiges Bild durch die Überlagerung der ursprünglichen Einzelbilder einsteht. Heute setzt das „Very Large Array“-Teleskop in der Nähe von Sorocco in Mexiko die Interferometrie am effektivsten ein. Es besteht aus 27 Teleskopen mit jeweils 25 m Blendenöffnung, die in Form eines „Y“ angeordnet sind. Es gibt bereits eine neue Technik, die als „Very Long Baseline Interferometry (VLBI)“ bezeichnet wird. Diese Technik ermöglicht es Astronomen, Bilder mit auf der Größe eines Kontinents angeordneten Teleskopen aufzulösen. Das wichtigste Projekt des Jahrhunderts in diesem Bereich ist der Bau des „Atacama Large Millimeter Array (ALMA)“, das 66 Teleskope in der Atacama-Wüste im Norden Chiles verwenden wird.

source: Space-Based Observations
de: Beobachtungen im Weltraum

source: Because Earth-based observations are affected by extinction due Earth's atmosphere, observations carried out in space are more successful. We mention the <firstterm>Hubble Space Telescope (HST)</firstterm> that has a 2.4, f/24 primary mirror, the smoothest mirror ever constructed. The Hubble Space Telescope is placed on a low-orbit around Earth and because of the lack of atmosphere it can observe very faint objects. Another Space Telescope is the <firstterm>James Webb Space Telescope (JWST)</firstterm> which is planned to be launched in 2018. It will have a 6.5m primary mirror and it will orbit around a gravitation stable point on the Sun-Earth line known as the Second Lagrange Point (L2). Here the gravitational attractions due to both Sun and Earth balances the centrifugal force of an object set in motion around the Sun. This point has the special property that if an object is placed here, it is in equilibrium with respect to the Sun-Earth system. The second Lagrange Point lies on the line connecting Sun and Earth, on the other side of the Earth. So a telescope placed here will receive less thermal radiation, which will improve Infrared Observations.
de: Beobachtungen auf der Erde werden durch die Absorption des Lichts durch die Erdatmosphäre beeinträchtigt, dieser Nachteil kann bei Beobachtungen im Weltraum vermieden werden. Das <firstterm>Hubble-Weltraumteleskop</firstterm> hat einen Hauptspiegel mit 2,4 m Durchmesser und die effektive Brennweite des Systems beträgt 57,6 Meter. Das Hubble-Weltraumteleskop umkreist die Erde auf einer niedrigen Umlaufbahn und ist wegen der nicht vorhanden Atmosphäre für die Beobachtung sehr lichtschwache Objekte geeignet. Ein weiteres Teleskop im Weltraum ist das <firstterm>James Webb Space Telescope (JWST)</firstterm>, das 2018 fertiggestellt sein sein. Es wird einen Hauptspiegel mit 6,5 m Durchmesser haben und wird im Weltraum um den zweiten Langrange-Punkt (L2) auf der Verbindungslinie Sonne-Erde kreisen, an dem sich die Gravitationskräfte zweier benachbarter Himmelskörper und die Zentrifugalkraft der Bewegung gegeneinander aufheben. An diesem Punkt ist ein Objekt im Gleichgewicht zum System Sonne-Erde. Der zweite Langrange-Punkt liegt auf der Verbindungslinie Sonne-Erde auf der erdabgewandten Seite. Ein Teleskop an diesem Punkt erhält weniger Temperaturstrahlung, das verbessert die Beobachtungen im Infrarotbereich.
