Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdeedu/kstars_fitsviewer.po
Languages: de

source: <acronym>FITS</acronym> Viewer Tool
de: <acronym>FITS</acronym>-Betrachter

source: Tools
de: Hilfsmittel

source: FITS Viewer
de: FITS-Betrachter

source: The Flexible Image Transport System (FITS) is the standard format for representing images and data in Astronomy.
de: Das Flexible Image Transport System (FITS) ist das Standardformat für die Darstellung von Bildern und Daten in der Astronomie.

source: The &kstars; FITS Viewer tool is integrated with the <link linkend="indi">INDI</link> framework for seamless display and manipulation of captured FITS images. To open a FITS file, select <guimenuitem>Open FITS...</guimenuitem> from the <guimenu>File</guimenu> menu, or press <keycombo action="simul">&Ctrl;<keycap>O</keycap></keycombo>.
de: Der FITS-Betrachter ist in &kstars; über <link linkend="indi">INDI</link> für die Anzeige und Bearbeitung der aufgenommenen FITS-Bilder innerhalb des Programms eingebunden. Außerdem können Sie die Bilddaten mit dem FITS-Betrachter nachbearbeiten. Um eine FITS-Datei zu öffnen, wählen Sie <guimenuitem>FITS öffnen ...</guimenuitem> aus dem Menü <guimenu>Datei</guimenu> oder drücken Sie <keycombo action="simul">&Ctrl;<keycap>O</keycap></keycombo>.

source: FITS Viewer features:
de: Eigenschaften des FITS-Betrachters:

source: Support for 8, 16, 32, IEEE -32, and IEEE -64 bits formats.
de: Unterstützung für 8, 16, 32, IEEE -32 und IEEE -64 Bitformate

source: Histogram with linear, logarithmic, and square-root scales.
de: Histogramm mit Linearer, Logarithmischer oder Quadratwurzel-Skalierung.

source: Brightness/Contrast controls.
de: Einstellung von Helligkeit/Kontrast.

source: Pan and Zoom.
de: Verschieben und Zoomen.

source: Auto levels.
de: Automatisches Abgleichen.

source: Statistics.
de: Statistik.

source: FITS header query.
de: Abfrage der FITS-Kopfzeilen.

source: Undo/Redo.
de: Rückgängig/Wiederherstellen.

source: The FITS Viewer Tool
de: Der FITS-Betrachter

source: FITS Viewer Tool
de: FITS-Betrachter

source: The above diagram illustrates the FITS Viewer work area and window. The tool provides basic functions for image display. FITS data depth is preserved throughout all processing, open, and save functions. While the tool adhere to the FITS standard, it does not support all possible FITS features:
de: Das Diagramm zeigt den Arbeitsbereich und das Fenster des FITS-Betrachters, der grundlegende Funktionen für die Bildanzeige zur Verfügung stellt. Die FITS-Daten bleiben während der gesamten Bearbeitung, beim Öffnen und beim Speichern erhalten. Der Betrachter hält sich an den FITS-Standard, aber nicht alle FITS-Eigenschaften werden unterstützt:

source: Support for only <emphasis>one</emphasis> image per file.
de: Unterstützt nur <emphasis>ein</emphasis> Bild pro Datei.

source: Support for only 2D data. 1D and 3D data are discarded.
de: Unterstützt nur 2D-Daten. 1D und 3D-Daten werden nicht dargestellt.

source: No support for WCS (World Coordinate System).
de: WCS (World Coordinate System - Welt-Koordinaten-System) wird nicht unterstützt.

source: The following is a brief description of the tool's functional units:
de: Im Folgendes eine kurze Beschreibung der Funktionen dieses Werkzeugs:

source: Histogram: Displays one-channel FITS histogram. The user can rescale the image by optionally defining an upper and lower limit for the cutoff region. The rescaling operation (linear, logarithmic, or square-root) may then be applied to the region enclosed by the upper and lower limits.
de: Histogramm: Zeigt das einkanalige FITS-Histogramm. Sie können das Diagramm durch die Festsetzung von oberer und unterer Grenze für den Ausschnitt neu skalieren. Die Skalierungsoperation (Auto, Linear, Logarithmisch, Quadratwurzel) kann dabei für den eingegrenzten Bereich ausgewählt werden.

source: Statistics: Provides simple statistics for minimum and maximum pixel values and their respective locations. FITS depth, dimension, mean, and standard deviation.
de: Statistik: Zeigt eine einfache Statistik für minimale und maximale Pixelwerte und ihre Verteilung, FITS-Farbtiefe, Bildabmessungen, Mittelwert und Standardabweichung.

source: FITS header: Displays FITS header information.
de: FITS Kopfzeile: Zeigt die Informationen in der Fits Kopfzeile an.
