Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdeedu/kstars_altvstime.po
Languages: de

source: <title>Altitude vs. Time Tool</title>
de: <title>Höhe und Zeit</title>

source: Tools
de: Hilfsmittel

source: <secondary>Altitude vs. Time Tool</secondary>
de: <secondary>Höhe und Zeit</secondary>

source: The Altitude vs. Time Tool
de: Das Hilfsmittel <quote>Höhe und Zeit</quote>

source: Altitude vs. Time Plotter
de: Höhe- und Zeitgraphen

source: This tool plots the altitude of any objects as a function of time, for any date and location on Earth. The top section is a graphical plot of altitude angle on the vertical axis, and time on the horizontal axis. The time is shown both as standard local time along the bottom, and <link linkend="ai-sidereal">sidereal time</link> along the top. The bottom half of the graph is shaded green to indicate that points in this region are below the horizon.
de: Dieses Hilfsmittel zeichnet die Höhe von Objekten als Funktion der Zeit, für jedes Datum und jeden Ort auf der Erde. Der obere Abschnitt ist eine grafische Zeichnung des Höhenwinkels auf der vertikalen Achse und der Zeit auf der horizontalen Achse. Die Zeit ist als die normale Ortszeit unter dem Graph und als <link linkend="ai-sidereal">Sternenzeit</link> darüber angezeigt. Die untere Hälfte des Graphen ist grün schattiert, um damit anzuzeigen, dass die Punkte in diesem Bereich unterhalb des Horizonts liegen.

source: There are a few ways to add curves to the plot. The simplest way to add the curve of an existing object is to simply type its name in the <guilabel>Name</guilabel> input field, and press Enter, or the <guibutton>Plot</guibutton> button. If the text you enter is found in the object database, the object's curve is added to the graph. You can also press the <guibutton>Find Object</guibutton> button to open the <link linkend="findobjects">Find Object Window</link> to select an object from the list of known objects. If you want to add a point that does not exist in the object database, simply enter a name for the point, and then fill in the coordinates in the <guilabel>RA</guilabel> and <guilabel>Dec</guilabel> input fields. Then press the <guibutton>Plot</guibutton> button to add the curve for your custom object to the plot (note that you have to pick a name that does not already exist in the object database for this to work).
de: Es gibt mehrere Möglichkeiten, der Zeichnung Kurven hinzuzufügen. Am einfachsten ist es, den Namen des Objektes in das Eingabefeld <guilabel>Name</guilabel> einzugeben und die Eingabetaste oder den Knopf <guibutton>Zeichnung</guibutton> zu drücken. Wenn der Text, den Sie eingegeben haben, in der Objektdatenbank gefunden wird, wird die Objektkurve zum Graphen hinzugefügt. Sie können auch den Knopf <guibutton>Objekt suchen</guibutton> drücken, um das Fenster <link linkend="findobjects">Objekt suchen</link> aufzurufen, in dem Sie ein Objekt in einer Liste der bekannten Objekt suchen können. Wenn Sie einen Punkt hinzufügen wollen, der nicht in der Objektdatenbank enthalten ist, geben Sie einfach einen Namen für den Punkt ein und geben die Koordinaten in die Felder <guilabel>Rekt</guilabel> und <guilabel>Dekl</guilabel> ein. Dann drücken Sie den Knopf <guibutton>Zeichnung</guibutton>, um die Kurve ihres Objektes der Zeichnung hinzuzufügen (Beachten Sie, dass Sie einen Namen verwenden müssen, der in der Objektdatenbank noch nicht vergeben ist).

source: When you add an object to the plot, its altitude vs. time curve is plotted with a thick white line, and its name is added to the listbox at the lower right. Any objects that were already present are plotted with a thinner red curve. You can choose which object is plotted with the thick white curve by highlighting its name in the listbox.
de: Wenn Sie ein Objekt der Zeichnung hinzufügen, wird seine Höhe-Zeit-Kurve mit einer dicken weißen Linie gezeichnet und der Name wird dem Listenfeld rechts unten hinzugefügt. Alle Objekte, die schon vorhanden sind, werden mit einer dünneren roten Kurve gezeichnet. Sie können wählen, welches Objekt mit der dicken weißen Linie gezeichnet werden soll, indem Sie es im Listenfeld auswählen.

source: These curves show the objects' Altitude (angle above the <link linkend="ai-horizon">horizon</link>) as a function of time. When a curve passes from the lower half to the upper half, the object has risen; when it falls back to the lower half, it has set. For example, in the screenshot, the minor planet <firstterm>Quaoar</firstterm> is setting at around 15:00 local time, and is rising at about 04:00 local time.
de: Diese Kurven zeigen die Höhe der Objekte (Winkel über dem <link linkend="ai-horizon">Horizont</link>) als eine Funktion der Zeit. Wenn eine Kurve von der unteren Hälfte in die obere läuft, geht das Objekt auf, wenn Sie von der oberen Hälfte in die untere fällt, geht es unter. Zum Beispiel geht im Bildschirmfoto der kleine Planet <firstterm>Quaoar</firstterm> um ca. 15:00 Uhr Ortszeit auf und etwa um 04:00 Uhr unter.

source: The Altitude of an object depends on both where you are on Earth, and on the Date. By default, the Tool adopts the Location and Date from the current &kstars; settings. You can change these parameters in the <guilabel>Date &amp; Location</guilabel> Tab. To change the Location, you can press the <guibutton>Choose City...</guibutton> button to open the <link linkend="setgeo">Set Geographic Location</link> Window, or enter Longitude and Latitude values manually in the input fields, and press the <guibutton>Update</guibutton> button. To change the Date, use the spin and combo boxes, then press <guibutton>Update</guibutton>. Note that any curves you had already plotted will be automatically updated when you change the Date and/or Location.
de: Die Höhe eines Objektes hängt davon ab, wo Sie sich auf der Erde befinden und welches Datum aktuell ist. Standardmäßig übernimmt das Hilfsmittel den Standort und die Zeit aus den aktuellen KStars-Einstellungen. Sie können diese Parameter im Abschnitt <guilabel>Datum &amp; Standort</guilabel> ändern. Um den Ort zu verändern, drücken Sie den Knopf <guibutton>Stadt auswählen ...</guibutton> um das Fenster <link linkend="setgeo">Standort einstellen</link> zu öffnen, oder geben Sie die Längen- und Breitengrade manuell in die Eingabefelder ein und drücken den Knopf <guibutton>Aktualisieren</guibutton>. Um das Datum zu verändern, benutzen Sie die Dreh- und Kombinationsfelder und drücken den Knopf <guibutton>Aktualisieren</guibutton>. Beachten Sie, dass alle schon gezeichneten Kurven aktualisiert werden, wenn Sie das Datum oder den Standort ändern.

source: Exercise:
de: Übung:

source: Plot the Sun's Altitude curve. Make sure the geographic location is not near the equator. Change the Date to some time in June, and then again to sometime in January. You can see easily why we have seasons; in the winter, the Sun is above the horizon for less time (the days are shorter), and its altitude is never very high.
de: Zeichnen Sie die Höhenkurve der Sonne. Stellen Sie sicher, dass der geografische Standort nicht in der Nähe des Äquators liegt. Ändern Sie das Datum auf einen Tag im Juni und dann auf irgendeinen Tag im Januar. Sie können nun leicht erkennen, warum es Jahreszeiten gibt. Im Winter ist die Sonne kürzere Zeit über dem Horizont (die Tage sind kürzer) und die Höhe ist nie sehr groß.
