Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdeedu/kstars_quicktour.po
Languages: de

source: A Quick Tour of &kstars;
de: Eine kurze Einführung zu &kstars;

source: This chapter presents a guided tour of &kstars;, introducing many of its important features.
de: Dieses Kapitel bietet Ihnen eine Führung durch &kstars;, in der viele wichtige Funktionen vorgestellt werden.

source: Here is a screenshot of the &kstars; main window:
de: Hier sehen Sie ein Bildschirmfoto von &kstars;-Hauptfenster:

source: Main Window
de: Hauptfenster

source: The above screenshot shows a typical view of the &kstars; program. You can see the sky display centered on Betelgeuse, the brightest star in the constellation Orion. Orion has just risen above the eastern horizon. Stars are displayed with <link linkend="ai-colorandtemp">realistic colors</link> and relative brightnesses. In three corners of the sky display, there are on-screen text labels displaying data on the current time (<quote>LT: 20:16:09 Tuesday 23 November 2010</quote>), the current Geographic Location (<quote>Fremont, California, USA</quote>), and the current object in the center of the display (<quote>Focused on: Betelgeuse (alpha Orionis)</quote>). Above the sky display, there are two toolbars. The main toolbar contains shortcuts for <link linkend="kstars-menus">menu functions</link>, as well as a time-step widget which controls how fast the simulation clock runs. The view toolbar contains buttons that toggle the display of different kinds of objects in the sky. At the bottom of the window, there is a status bar which displays the name of any object you click on, and the <link linkend="ai-skycoords">sky coordinates</link> (both Right Ascension/Declination and Azimuth/Altitude) of the mouse cursor.
de: Im obigen Bildschirmfoto können Sie die Himmelsanzeige sehen, die auf Beteigeuze, den hellsten Stern im Sternbild Orion zentriert ist. Orion ist gerade über dem östlichen Horizont aufgegangen. Die Sterne werden mit <link linkend="ai-colorandtemp">realistischen Farben</link> und relativen Helligkeiten angezeigt. In drei Ecken der Sternenkarte finden Sie die drei Infofenster mit der aktuellen Zeit (<quote>OZ: 20:15:09 Dienstag, 23. November 2010</quote>), dem aktuellen Standort (<quote>Fremont, Kalifornien, USA</quote>) und dem aktuellen Objekt in der Mitte der Anzeige (<quote>Beteigeuze (alpha Orionis)</quote>). Über der Himmelsanzeige sind zwei Werkzeugleisten. Die Hauptwerkzeugleiste enthält Tastenkürzel für <link linkend="kstars-menus">Menübefehle</link>, sowie ein Zeitschrittfeld, um einzustellen, wie schnell die Simulation abläuft. Die Ansichtswerkzeugleiste enthält Knöpfe, um die Anzeige von verschiedenen Objekten in der Karte ein- und auszuschalten. Am unteren Rand des Fensters sehen Sie die Statusleiste, die den Namen jedes Objektes anzeigen, auf das Sie klicken und die <link linkend="ai-skycoords">Himmelskoordinaten</link> (Rektaszension/Deklination und Azimut/Höhe) des Mauszeigers.

source: The Setup Wizard
de: Der Einrichtungsassistent

source: Setup Wizard
de: Einrichtungsassistent

source: The first time you run &kstars;, you will be presented with a Setup Wizard, which allows you to easily set your geographic location and download some extra data files. You can press the <guilabel>OK</guilabel> button at any time to exit the Setup Wizard.
de: Wenn Sie &kstars; zum ersten Mal starten, hilft Ihnen ein Einrichtungsassistent, Ihren geografischen Standort einzustellen und einige Extradaten herunterzuladen. Sie können den Einrichtungsassistenten jederzeit durch Drücken auf den Knopf <guilabel>OK</guilabel> verlassen.

source: The second page of the Setup Wizard allows you to choose the starting geographic location, by selecting from the list of the 2500+ known locations on the right side of the window. The list of locations can be filtered to match the text you enter in the <guilabel>City</guilabel>, <guilabel>Province</guilabel>, and <guilabel>Country</guilabel> edit boxes. If your desired location is not present in the list, you can select a nearby city instead for now. Later on, you can add your precise location manually using the <link linkend="setgeo">Set Geographic Location tool</link>. Once you have selected a starting location, press the <guilabel>Next</guilabel> button.
de: Auf der zweiten Seite des Einrichtungsassistenten können Sie Ihren Standort aus einer Liste von mehr als 2500 bekannten Orten auf der rechten Seite des Fensters auswählen. Diese Liste der Standorte können Sie durch Eingabe in den Textfeldern <guilabel>Stadt</guilabel>, <guilabel>Provinz</guilabel>, und <guilabel>Land</guilabel> filtern. Wenn der gesuchte Standort nicht in der Liste steht, können Sie erstmal eine Stadt in der Nähe auswählen. Später können Sie die genauen Standort von Hand mit dem Hilfsmittel<link linkend="setgeo"> Standort einstellen</link> eingeben. Haben Sie einen Standort ausgewählt, drücken Sie auf den Knopf <guilabel>Weiter</guilabel>.

source: The last page of the Setup Wizard allows you to download extra data that are not included with the standard distribution of &kstars;. Simply press the <guilabel>Download Extra Data</guilabel> button to open the <guilabel>Get New Stuff</guilabel> tool. When you are all done, press the <guilabel>OK</guilabel> button in the Setup Wizard to start exploring &kstars;.
de: Auf der letzten Seite des Einrichtungsassistenten können Sie die zusätzlichen Daten, die nicht mit &kstars; vertrieben werden, herunterladen. Drücken Sie einfach auf den Knopf <guilabel>Extradaten herunterladen</guilabel>, um den Dialog <guilabel>„Neue Erweiterungen“ herunterladen</guilabel> zu öffnen. Wenn Sie fertig sind, drücken Sie im Assistenten den Knopf <guilabel>OK</guilabel> und können &kstars; erforschen.

source: Have a Look Around
de: Schauen Sie sich um!

source: Navigation Controls
de: Navigationsbefehle

source: Basics
de: Grundlegendes

source: Now that we have the time and location set, let us have a look around. You can pan the display using the arrow keys. If you hold down the &Shift; key before panning, the scrolling speed is increased. The display can also be panned by clicking and dragging with the mouse. Note that while the display is scrolling, not all objects are displayed. This is done to cut down on the <acronym>CPU</acronym> load of recomputing object positions, which makes the scrolling smoother (you can configure what gets hidden while scrolling in the <link linkend="config">Configure &kstars;</link> window). There are several ways to change the magnification (or <firstterm>Zoom level</firstterm>) of the display:
de: Nun, da wir die Zeit und den Standort eingestellt haben, schauen wir uns ein bisschen um. Sie können die Ansicht mit den Pfeiltasten bewegen. Wenn Sie die Umschalttaste vor dem Verschieben mit den Pfeiltasten gedrückt halten, wird die Geschwindigkeit der Verschiebung erhöht. Die Ansicht kann auch bewegt werden, indem Sie mit der Maus klicken und ziehen. Beachten Sie, dass während der Bewegung nicht alle Objekte angezeigt werden. Dadurch wird die <acronym>CPU</acronym> entlastet, da sie dann nicht so viele Objekte berechnen muss, was die Bewegung flüssiger macht. (Sie können im Dialog <link linkend="config">&kstars; einrichten</link> einstellen, welche Objekte bei der Bewegung ausgeblendet werden). Es gibt mehrere Möglichkeiten, die Vergrößerung (oder <firstterm>Vergrößerungsstufe</firstterm>) der Anzeige zu verändern:

source: Use the <keycap>+</keycap> and <keycap>-</keycap> keys
de: Mit den Tasten <keycap>+</keycap> und <keycap>-</keycap>

source: Press the Zoom In/Zoom Out buttons in the toolbar
de: Drücken Sie die Knöpfen Verkleinern/Vergrößern in der Werkzeugleiste

source: Select <guimenuitem>Zoom In</guimenuitem>/<guimenuitem>Zoom Out</guimenuitem> from the <guimenu>View</guimenu> menu
de: Wählen Sie <guimenuitem>Vergrößern</guimenuitem> oder <guimenuitem>Verkleinern</guimenuitem> aus dem Menü <guimenu>Ansicht</guimenu>

source: Select <guimenuitem>Zoom to Angular Size...</guimenuitem> from the <guimenu>View</guimenu> menu. This allows you to specify the field-of-view angle for the display, in degrees.
de: Wählen Sie <guimenuitem>Auf Winkelgröße vergrößern ...</guimenuitem> aus dem Menü <guimenu>Ansicht</guimenu>. Das erlaubt Ihnen, das Sichtfeld der Anzeige in Grad einzugeben.

source: Use the scroll wheel on your mouse
de: Mit dem Rad Ihrer Maus

source: Drag the mouse up and down with the &MMB; pressed.
de: Oder mit Mausbewegungen nach unten oder oben bei gedrückter &MMB;.

source: Hold down &Ctrl; while dragging the mouse. This will allow you to define a rectangle in the map. When you release the mouse button, the display will zoom to match the rectangle.
de: Halten Sie &Ctrl; gedrückt, während Sie mit der Maus ziehen. Das erlaubt Ihnen, ein Rechteck in der Karte zu definieren. Wenn Sie die Maustaste loslassen, wird die Anzeige auf das Rechteck vergrößert.

source: Notice that as you zoom in, you can see fainter stars than at lower zoom settings.
de: Beachten Sie, dass Sie bei höherer Vergrößerung lichtschwache Sterne besser sehen können als in der normalen Ansicht.

source: Zoom out until you can see a green curve; this represents your local <link linkend="ai-horizon">horizon</link>. If you have not adjusted the default &kstars; configuration, the display will be solid green below the horizon, representing the solid ground of the Earth. There is also a white curve, which represents the <link linkend="ai-cequator">celestial equator</link>, and a brown curve, which represents the <link linkend="ai-ecliptic">Ecliptic</link>, the path that the Sun appears to follow across the sky over the course of a year. The Sun is always found somewhere along the Ecliptic, and the planets are never far from it.
de: Verkleinern Sie die Ansicht, bis Sie eine grüne Kurve sehen, das ist Ihr lokaler <link linkend="ai-horizon">Horizont</link>. Wenn Sie die &kstars; Einstellungen nicht verändert haben, wird die Bereich unter dem Horizont grün sein, dies stellt den festen Boden der Erde dar. Sie sehen auch eine weiße Kurve für den <link linkend="ai-cequator">Himmelsäquator</link> und eine braune Kurve für die <link linkend="ai-ecliptic">Ekliptik</link>, also die Strecke, der die Sonne im Laufe des Jahres folgt. Deswegen können Sie die Sonne immer irgendwo auf der Ekliptik finden, und die Planeten sind nie weit davon entfernt.

source: <title>Objects in the Sky</title>
de: <title>Objekte im Himmel</title>

source: <primary>Objects in the Sky</primary>
de: <primary>Objekte im Himmel</primary>

source: Overview
de: Überblick

source: &kstars; displays thousands of celestial objects: stars, planets, comets, asteroids, clusters, nebulae and galaxies. You can interact with displayed objects to perform actions on them or obtain more information about them. Clicking on an object will identify it in the status bar, and simply hovering the mouse cursor on an object will label it temporarily in the map. Double-clicking will recenter the display on the object and begin tracking it (so that it will remain centered as time passes). <mousebutton>Right</mousebutton> clicking an object opens the object's popup menu, which provides more options.
de: &kstars; zeigt Tausende von Objekten am Himmel an: Sterne, Planeten, Kometen, Asteroiden, Sternhaufen, Nebel und Galaxien. Sie können für die angezeigten Objekte Aktionen aufrufen oder zusätzliche Informationen darüber erhalten. Klicken Sie auf ein Objekt und es wird in der Statusleiste identifiziert, halten Sie den Mauszeiger auf ein Objekt und es wird kurzzeitig ein Textfeld mit dem Name in der Himmelskarte angezeigt. Ein Doppelklick zentriert die Anzeige auf das Objekt und startet die Verfolgung (damit bleibt das Objekt im Zentrum der Anzeige, wenn die Zeit weiterläuft). Ein <mousebutton>rechter</mousebutton> Mausklick auf ein Objekt öffnet ein Kontextmenü mit zusätzlichen Optionen.

source: The Popup Menu
de: Das Kontextmenü

source: <primary>Popup Menu</primary>
de: <primary>Kontextmenü</primary>

source: Example
de: Beispiel

source: Here is an example of the <mousebutton>right</mousebutton> click popup menu, for the Orion Nebula:
de: Hier ist ein Beispiel eines Kontextmenüs der <mousebutton>rechten</mousebutton> Maustaste für den Orionnebel:

source: <screeninfo>Popup Menu for M 42</screeninfo>
de: <screeninfo>Kontextmenü für M 42</screeninfo>

source: <phrase>Popup Menu for M 42</phrase>
de: <phrase>Kontextmenü für M 42</phrase>

source: The appearance of the popup menu depends somewhat on the kind of object you <mousebutton>right</mousebutton>-click on, but the basic structure is listed below. You can get <link linkend="popup-menu">more detailed information about the popup menu</link>.
de: Das Erscheinungsbild des Kontextmenüs hängt von der Art des Objektes ab, auf das sie mit der <mousebutton>rechten</mousebutton> Maustaste geklickt haben, aber die grundlegende Struktur ist unten dargestellt. Sie können <link linkend="popup-menu">weitere ausführliche Informationen über das Kontextmenü</link> bekommen.

source: The top section contains some lines of information which are not selectable: the object's names ("M 42"; "Orion Nebula"), object type ("gaseous nebula"), and the constellation which contains the object ("Orion"). The next three lines show the object's rise, set, and transit times. If the rise and set times say "circumpolar", it means that the object is always above the horizon for the present location.
de: Der obere Abschnitt enthält einige Zeilen mit Informationen (die nicht auswählbar sind): Die Objektnamen (<quote>M 42</quote>; <quote>Orion-Nebel</quote>), Objekttyp (<quote>Gasnebel</quote>) und die Konstellation, die das Objekt enthält (<quote>Orion</quote>). Die nächsten drei Zeilen zeigen die Aufgangs-, Untergangs- und Durchgangszeiten. Ständig sichtbar für die Aufgangs- und Untergangszeiten bedeutet, dass das Objekt am aktuellen Standort immer über dem Horizont steht.

source: The middle section contains actions which can be performed on the selected object, such as <guimenuitem>Center &amp; Track</guimenuitem>, <guimenuitem>Details...</guimenuitem>, and <guimenuitem>Attach Label</guimenuitem>. See the <link linkend="popup-menu">popup menu description</link> for a full list and description of each action.
de: Der mittlere Abschnitt enthält Aktionen. die mit dem ausgewählten Objekt durchgeführt werden können, wie <guimenuitem>Zentrieren &amp; Verfolgen</guimenuitem>, <guimenuitem>Details ...</guimenuitem> und <guimenuitem>Marke hinzufügen</guimenuitem>. In der <link linkend="popup-menu">Beschreibung des Kontextmenüs</link> finden Sie eine vollständige Liste und Erläuterung für jede Aktion.

source: Internet Links
de: Internetverknüpfungen

source: <seealso>Popup Menu</seealso>
de: <seealso>Kontextmenü</seealso>

source: The bottom section contains links to images and/or informative webpages about the selected object. If you know of an additional &URL; with information or an image of the object, you can add a custom link to the object's popup menu. Use the <guimenuitem>Details</guimenuitem> item in the popup menu to open the <guilabel>Object Details</guilabel> dialog. On the <guilabel>Link</guilabel> tab use the <guimenuitem>Add Link...</guimenuitem> item.
de: Der untere Abschnitt enthält Verknüpfungen zu Bildern und/oder informativen Webseiten über das ausgewählte Objekt. Wenn Sie eine zusätzliche &URL; kennen, die Informationen über das Objekt enthält, können Sie eine eigene Einträge in das Kontextmenü des Objekts einfügen. Benutzen Sie <guimenuitem>Details</guimenuitem> im Kontextmenü. Damit öffnen Sie den Dialog <guilabel>Objektdetails</guilabel>. Auf der Karteikarte <guilabel>Verknüpfungen</guilabel> klicken Sie auf <guibutton>Verknüpfung hinzufügen</guibutton>.

source: Finding Objects
de: Objekte suchen

source: Find Object Tool
de: Hilfsmittel <quote>Objekt suchen</quote>

source: Finding by Name
de: Objekt nach Namen suchen

source: You can search for named objects using the <guilabel>Find Object</guilabel> tool, which can be opened by clicking on the <guiicon>search</guiicon> icon in the toolbar, by selecting <guimenuitem>Find Object...</guimenuitem> from the <guimenu>Pointing</guimenu> menu, or by pressing <keycombo action="simul">&Ctrl;<keycap>F</keycap></keycombo>. The <guilabel>Find Object</guilabel> window is shown below:
de: Sie können nach benannten Objekten mit dem Dialog <guilabel>Objekt suchen</guilabel> suchen, den Sie mit dem Symbol <guiicon>Suchen</guiicon> in der Werkzeugleiste, mit dem Eintrag <guimenuitem>Objekt suchen ...</guimenuitem> im dem Menü <guimenu>Sichtrichtung</guimenu> oder durch Drücken von <keycombo action="simul">&Ctrl;<keycap>F</keycap></keycombo> aufrufen können. Der Dialog <guilabel>Objekt suchen</guilabel> ist unten dargestellt:

source: <screeninfo>Find Object Window</screeninfo>
de: <screeninfo>Fenster <quote>Objekt suchen</quote></screeninfo>

source: <phrase>Find Object Window</phrase>
de: <phrase>Fenster <quote>Objekt suchen</quote></phrase>

source: The window contains a list of all the named objects that &kstars; is aware of. Many of the objects only have a numeric catalog name (for example, NGC 3077), but some objects have a common name as well (for example, Whirlpool Galaxy). You can filter the list by name and by object type. To filter by name, enter a string in the edit box at the top of the window; the list will then only contain names which start with that string. To filter by type, select a type from the combo box at the bottom of the window.
de: Das Fenster enthält eine Liste alle &kstars; bekannten Objekte. Viele der Objekte haben nur einen numerischen Katalognamen (zum Beispiel NGC 3077), aber einige Objekte haben auch einen Namen (zum Beispiel <quote>Whirlpool Galaxie</quote>). Sie können die Liste nach Namen und nach Objekttyp filtern. Um nach dem Namen zu filtern, geben Sie eine Zeichenkette in das Eingabefeld oben im Fenster ein. Die Liste enthält dann nur noch Namen, die mit dieser Zeichenkette beginnen. Um nach dem Typ zu filtern, wählen Sie einen Typ aus dem Auswahlfeld unten im Fenster.

source: To center the display on an object, highlight the desired object in the list, and press <guibutton>Ok</guibutton>. Note that if the object is below the horizon, the program will warn you that you may not see anything except the ground (you can make the ground invisible in the <guilabel>Guides</guilabel> settings page, or by pressing the <guiicon>Ground</guiicon> button in the View toolbar).
de: Um die Ansicht auf ein Objekt zu zentrieren, wählen Sie das Objekt in der Liste und drücken Sie <guibutton>OK</guibutton>. Wenn das Objekt sich unter dem Horizont befindet, wird das Programm sie warnen, dass Sie außer dem Boden nichts sehen werden (Sie können die Sichtbarkeit des Bodens auf der Seite <guilabel>Orientierungshilfen</guilabel> im Einrichtungsdialog ändern oder drücken Sie den Knopf <guiicon>Boden</guiicon> in der Ansichtswerkzeugleiste).

source: Centering and Tracking
de: Zentrierung und Verfolgung

source: Tracking
de: Verfolgung

source: &kstars; will automatically begin tracking on an object whenever one is centered in the display, either by using the <guilabel>Find Object</guilabel> window, by double-clicking on it, or by selecting <guimenuitem>Center &amp; Track</guimenuitem> from its <mousebutton>right</mousebutton>-click popup menu. You can disengage tracking by panning the display, pressing the <guiicon>Stop Tracking</guiicon> icon in the Main toolbar, or selecting <guimenuitem>Stop Tracking</guimenuitem> from the <guimenu>Pointing</guimenu> menu.
de: Die Objektverfolgung wird automatisch eingeschaltet, wenn ein Objekt in der Ansicht zentriert wird, entweder im Dialog <guilabel>Objekt suchen</guilabel>, durch einen Doppelklick auf ein Objekt oder durch die Auswahl von <guimenuitem>Zentrieren &amp; Verfolgen</guimenuitem> aus dem Kontextmenü der <mousebutton>rechten</mousebutton> Maustaste. Sie können die Verfolgung ausschalten, indem Sie die Ansicht verschieben, auf <guiicon>Verfolgung anhalten</guiicon> in der Werkzeugleiste klicken oder <guimenuitem>Verfolgung anhalten</guimenuitem> aus dem Menü <guimenu>Sichtrichtung</guimenu> wählen.

source: Orbit Trails
de: Umlaufbahnspuren

source: Attached to centered object
de: Zum zentrierten Objekt hinzufügen

source: When tracking on a Solar System body, &kstars; will automatically attach an <quote>orbit trail</quote>, showing the path of the body across the sky. You will likely need to change the clock's timestep to a large value (such as <quote>1 day</quote>) to see the trail.
de: Bei der Verfolgung eines Himmelskörper im Sonnensystem zeigt &kstars; automatisch eine <quote>Umlaufbahnspur</quote> an, die den Weg des Objekts am Himmel anzeigt. Um die Spur zu sehen, müssen Sie den Zeitschritt der Uhr auf einen großen Wert (wie <quote>1 Tag</quote>) einstellen.

source: <title>Keyboard Actions</title>
de: <title>Tastatur-Aktionen</title>

source: <secondary>Keyboard Actions</secondary>
de: <secondary>Tastatur-Aktionen</secondary>

source: When you click on an object in the map, it becomes the <firstterm>selected object</firstterm>, and its name is identified in the statusbar. There are a number of quick key commands available which act on the selected object:
de: Wenn Sie auf ein Objekt in der Karte klicken, wird es zum <firstterm>ausgewählten Objekt</firstterm> und der Name wird im der Statuszeile angezeigt. Es gibt eine Reihe von Tastenkürzeln für das ausgewählte Objekt:

source: Center and Track on the selected object
de: Zentriert und verfolgt das gewählte Objekt

source: Show the <link linkend="tool-details">Details window</link> for the selected object
de: Zeigt ein Fenster mit <link linkend="tool-details">ausführlichen Informationen</link> für das gewählte Objekt

source: Toggle a visible name label on the selected object
de: Schaltet die Anzeige des Namens für das ausgewählte Objekt ein und aus

source: Add the selected object to the <link linkend="tool-obsplanner">Observing wish-list</link>
de: Fügt das ausgewählte Objekt zur <link linkend="tool-obsplanner">Beobachtungsliste</link> hinzu

source: Toggle a visible curve on the sky, showing the path of the object across the sky (only applicable to Solar System bodies)
de: Schaltet die Anzeige einer Kurve am Himmel ein oder aus, diese Kurve zeigt die Bahn des Objektes über den Himmel (Nur für Himmelskörper im Sonnensystem)

source: By holding down the &Shift; key, you can perform these actions on the centered object, rather than the selected object.
de: Durch Drücken der &Shift;-Taste können Sie diese Aktionen auf das zentrierte Objekt anstelle des ausgewählten Objekts anwenden.

source: End of the Tour
de: Ende der Einführung

source: This concludes the tour of &kstars;, although we have only scratched the surface of the available features. &kstars; includes many useful <link linkend="tools">astronomy tools</link>, it can directly <link linkend="indi">control your telescope</link>, and it offers a wide variety of <link linkend="config">configuration and customization options</link>. In addition, this Handbook includes the <link linkend="astroinfo">AstroInfo Project</link>, a series of short, interlinked articles explaining some of the celestial and astrophysical concepts behind &kstars;.
de: Hiermit ist die Einführung zu &kstars; beendet, obwohl nur ein kleiner Teil der vorhandenen Fähigkeiten gezeigt wurde. &kstars; enthält viele hilfreiche <link linkend="tools">Astronomische Werkzeuge</link>, es kann Ihr <link linkend="indi">Teleskop steuern</link> und bietet viele Möglichkeiten zur <link linkend="config">Einstellung und Anpassung</link>. Zusätzlich enthält diese Handbuch das <link linkend="astroinfo">Astroinfo-Projekt</link>, eine Folge von kurzen, miteinander verknüpften Artikeln über die Konzepte zu den Himmelkörpern und der Astrophysik, die die Grundlage von &kstars; bilden.
