Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdeedu/ktouch.po
Languages: de

source: A course is an ordered set of lessons. To be efficient for learning touch typing the content of the course should meet a few requirements.
de: Ein Kurs besteht aus Lektionen in einer festgelegten Reihenfolge. Der Inhalt eines Kurses sollte einige Anforderungen erfüllen, damit er effizient für das Erlernen des Schreibmaschinenschreibens ist.

source: Choose a meaningful name for the lesson
de: Wählen Sie einen aussagekräftigen Namen für die Lektion

source: For each level you can specify the new characters/keys in the lesson. It is worth to include the new characters in the lesson title. Click on a name label in the <guilabel>Lessons</guilabel> list and enter some meaningful name.
de: Für jede neue Lektion können Sie neue Zeichen und Tasten festlegen. Sinnvoll ist es, die neu eingeführten Zeichen im Titel der Lektion zu nennen. Klicken Sie auf die Beschriftung in der Liste der <guilabel>Lektionen</guilabel> und geben Sie einen aussagekräftigen Namen ein.

source: Rationale
de: Begründung

source: The text you enter as a lesson title will be shown as lesson information text in the home screen course list. It will be much easier for user to choose the lesson if it has a meaningful title.
de: Der als Lektionstitel eingegebene Text wird als Informationstext zur Lektion in der Kursliste im Startbildschirm angezeigt. Für die Benutzer ist es ist viel einfacher, einen Lektion zu wählen, wenn diese einen aussagekräftigen Namen haben.

source: The first lesson should cover the home keys
de: In der ersten Lektion sollten die Fingertasten geübt werden.

source: Usually a keyboard has two haptic markers for the keys on the second row belonging to the index fingers. These two keys and the three adjacent keys outwards are the home keys. That's <emphasis>asdfjkl;</emphasis> for the US keyboard layout.
de: Normalerweise hat jede Tastatur zwei Erhebungen für die Tasten in der zweiten Reihe für die Zeigefinger. Diese zwei Tasten und die drei angrenzenden Tasten sind die Ausgangs- oder Ruhetasten, auf einer deutschen Tastatur <emphasis>asdfjklö</emphasis>.

source: Those eight keys are the start position of each finger. One must internalize the location of these keys first to successfully learn touch typing.
de: Diese acht Tasten sind die Startposition für jeden Finger. Zuerst müssen Sie die Anordnung dieser Tasten verinnerlichen, um erfolgreich das Schreibmaschineschreiben zu lernen.

source: Introduce two new keys per lesson
de: Fügen Sie in jeder Sitzung zwei neue Tasten hinzu

source: The unlocking order of keys is not fixed, but usually keys are introduced in pairs belonging to the same finger on both hands. Make your way from the home keys to the ones further away. Thus, the forth row should be introduced at last. Prefer keys for important characters of your language, this may require to bend the introduction pattern a bit. For example in French accents are really important, this warrants a lesson early-on focusing on the accent key alone.
de: Für das Hinzufügen von Tasten gibt es keine festen Regeln, aber üblicherweise werden neue Tasten paarweise für den gleichen Finder an beiden Händen eingeführt. Daher sollte die vierte Tastenreihe als letztes hinzugefügt werden. Beginnen Sie mit den wichtigen Tasten für Ihre Sprache und berücksichtigen Sie die beim Einführen neuer Tasten. Zum Beispiel für Französisch sind die Akzente sehr wichtig, dies erfordert Lektionen, in denen bald die Akzenttasten allein hinzugefügt werden.

source: If more keys are introduced the trainee might get overwhelmed by the difficulty of the lesson and loose his motivation. Introduce keys for important keys first to able to form real words earlier.
de: Wenn mehr neue Tasten hinzugefügt werden, ist der Übende möglicherweise durch die Schwierigkeit der Lektion überfordert und verliert seine Motivation. Fügen Sie zuerst die am häufig verwendeten Tasten hinzu, damit richtige Wörter früher in die Lektionen aufgenommen werden können.

source: Extra emphasis on the new keys
de: Legen Sie den Schwerpunkt der Übung auf die neuen Tasten

source: Make sure the characters belonging to the newly introduced keys are the most or at least very frequently used characters in the lesson text.
de: Sorgen Sie dafür, dass die Zeichen für die neu eingeführten Tasten die am meisten oder mindestens sehr häufig im Text der Lektion benutzt werdende.

source: If the trainee passes a lesson he should have mastered the new keys. This is only possible if the lesson contains a significant amount of the new characters.
de: Hat der Schüler eine Lektion erfolgreich abgeschlossen, sollte er die neuen Tasten beherrschen. Das ist nur möglich, wenn die Lektion eine ausreichende Anzahl der neuen Zeichen enthält.

source: Intersperse lessons with new keys with repetition lessons
de: Wechseln Sie zwischen Lektionen mit neuen Tasten und Lektionen mit Wiederholungen ab.

source: Every two to three lessons add a repetition lesson without any new keys. These should have an even character mix covering all already introduced characters.
de: Nach jeder zweiten oder dritten Lektion fügen Sie eine Lektion ohne neue Tasten ein. Diese Lektionen sollten eine gleichmäßige Mischung von bereits geübten Zeichen enthalten.

source: Such lessons help to strengthen the acquired skills and provide a way to check the overall training level. They are also better suited for repeated training to further improve one's general typing skills.
de: Solche Lektionen helfen dabei, die erlernten Fähigkeiten zu verfestigen und ermöglichen die Überprüfung des allgemeinen Lernniveaus. Wiederholungslektionen sind auch besser dazu geeignet, die allgemeinen Fähigkeiten im Maschineschreiben zu verbessern.

source: Dedicated lessons for capitalization
de: Besondere Lektionen für die Groß- und Kleinschreibung

source: There should be several lessons focusing sorely on capitalization. Ideally capitalization is introduced in multiple steps: At first only the left &Shift; key, then the right, then both and followed by one or more repetition lessons.
de: Es sollte mehrere Lektionen nur für das Üben der Groß- und Kleinschreibung im Kurs geben. Am Besten wird Groß- und Kleinschreibung in mehreren Schritten eingeführt: Zuerst nur die linke &Shift;taste, dann die Rechte, dann Beide und abschließend eine oder mehrere Wiederholungslektionen.

source: Mastering capitalization is the most difficult part of learning touch typing. Therefore extra effort must be spend on these lessons.
de: Das Beherrschen der Groß- und Kleinschreibung ist der schwierigste Teil beim Lernen des Maschineschreibens. Daher ist zusätzlicher Aufwand für diese Lektionen nötig.

source: Cover the complete keyboard layout
de: Verwenden Sie die gesamte Tastaturbelegung

source: This includes characters and symbols accessible via other modifiers than &Shift;. Ideally every character, number and symbol which is printed on a real keyboard should be covered.
de: Das umfasst auch Zeichen und Symbole durch andere Sondertasten als die &Shift;taste. Im Idealfall wird jedes Zeichen, Zahl oder Symbol, das es auf einer tatsächlichen Tastatur gibt, in diesen Lektionen geübt,

source: The more complete a course is the more the trainee can learn from it. It also keeps the course interesting for already advanced typists.
de: Je mehr Zeichen ein Kurs umfasst, desto mehr lässt sich damit Lernen. Das macht einen Kurs außerdem auch interessant für Personen mit Erfahrung im Schreibmaschineschreiben,

source: Use <inlinemediaobject> <imageobject> <imagedata fileref="Icon-list-add.png" format="PNG"/> </imageobject> </inlinemediaobject> button to add new lesson to the course, <inlinemediaobject> <imageobject> <imagedata fileref="Icon-list-remove.png" format="PNG"/> </imageobject> </inlinemediaobject> button to remove selected lesson from your course and <inlinemediaobject> <imageobject> <imagedata fileref="Icon-arrow-up.png" format="PNG"/> </imageobject> </inlinemediaobject>/<inlinemediaobject> <imageobject> <imagedata fileref="Icon-arrow-down.png" format="PNG"/> </imageobject> </inlinemediaobject> buttons to rearrange the lessons in the course.
de: Benutzen Sie den Kopf <inlinemediaobject> <imageobject> <imagedata fileref="Icon-list-add.png" format="PNG"/> </imageobject> </inlinemediaobject>, um neue Lektionen zum Kurs hinzuzufügen, den Knopf <inlinemediaobject> <imageobject> <imagedata fileref="Icon-list-remove.png" format="PNG"/> </imageobject> </inlinemediaobject> um ausgewählte Lektionen aus Ihren Kurs zu entfernen und die Knöpfe <inlinemediaobject> <imageobject> <imagedata fileref="Icon-arrow-up.png" format="PNG"/> </imageobject> </inlinemediaobject>/<inlinemediaobject> <imageobject> <imagedata fileref="Icon-arrow-down.png" format="PNG"/> </imageobject> </inlinemediaobject>, um die Reihenfolge der Lektionen in einem Kurs zu ändern.

source: Delete lessons only with caution. Doing so may reset the unlocking progress of the users of the course. If you are planning to revise a course thoroughly it is usually better to use the existing course as a base for a new one.
de: Löschen Sie Lektionen nur nach gründlicher Überlegung, da durch das Löschen der Freigabeprozess der Benutzer dieses Kurses zurückgesetzt werden kann. Plane Sie, einen Kurs grundlegend zu überarbeiten, ist es meistens besser, den vorhandenen Kurs als Vorlage für den neuen Kurs zu verwenden.

source: The content of the lesson can be edited using bottom right edit field. You can copy snippets of the text from your favorite text editor and paste them to this field.
de: Der Inhalt von Lektionen kann im Editor rechts unten bearbeitet werden. Sie können Textausschnitte mit Ihrem Lieblingseditor kopieren und in diese Feld einfügen.

source: Use the <inlinemediaobject> <imageobject> <imagedata fileref="Icon-document-open.png" format="PNG"/> </imageobject> </inlinemediaobject> button to open a generic text file that will be loaded into the lesson text field.
de: Benutzen Sie den Knopf <inlinemediaobject> <imageobject> <imagedata fileref="Icon-document-open.png" format="PNG"/> </imageobject> </inlinemediaobject>, um einfache Textdateien zu öffnen und in das Textfeld der Lektion zu importieren.

source: The <inlinemediaobject> <imageobject> <imagedata fileref="Icon-format-justify-fill.png" format="PNG"/> </imageobject> </inlinemediaobject> button can be used to wrap the lesson text. &i18n-ktouch; editor wraps text such that every line of the lesson does not exceed the recommended 60 characters limit.
de: Mit dem Knopf <inlinemediaobject> <imageobject> <imagedata fileref="Icon-format-justify-fill.png" format="PNG"/> </imageobject> </inlinemediaobject> können Sie den Zeilenumbruch für den Text der Lektion einschalten. Im Editor von &i18n-ktouch; wird dann eine maximale Zeilenlänge von 60 Zeichen verwendet.

source: Let's assume you want to add a new lesson. There are a few guidelines you may want to consider:
de: Für die Erstellung von neuen Lektionen sollten Sie einige Regel beachten:

source: Give lessons a descriptive title
de: Geben Sie den Lektionen einen aussagekräftigen Namen

source: Name the new characters if there are any or otherwise state what the lesson is about.
de: Benennen Sie die neuen Zeichen, sofern vorhanden, oder geben Sie ansonsten an. was die Lektion beinhaltet.

source: Good titles make it easier to find the right course if one wants to train on something specific.
de: Aussagekräftige Titel erleichtern es, den passenden Kurs für Personen zu finden, die nur bestimmte Übungen durchführen möchten.

source: The lesson text should be composed out of real words and sentences
de: Der Text der Lektion sollte aus gültigen Wörtern und Sätzen bestehen.

source: Optimally a lesson forms a comprehensible contiguous text on a freely chosen subject.
de: Optimal besteht eine Lektion aus einem verständlichen zusammenhängenden Text über ein beliebiges Thema.

source: Training with real words and sentences is more effective than with arbitrary random character combinations since that is closer to real typing. And it is more fun.
de: Übungen mit tatsächlich verwendeten Wörtern und Sätzen sind viel effektiver als mit beliebigen zufälligen Zeichenkombinationen, da das mehr dem tatsächlichen Maschineschreiben entspricht. Außerdem macht es mehr Spaß.

source: Avoid non-word character combinations
de: Vermeiden Sie Kombinationen von Nichtwort-Zeichen

source: This may impossible in the very first lessons where only a few characters are available, but as soon as possible only real words should be used. Never use misspelled words.
de: Dies ist wahrscheinlich in den allerersten Lektionen nicht möglich, in denen nur einige wenige Zeichen verfügbar sind, aber sobald als möglich sollten tatsächliche Wörter verwendet werden. Benutzen Sie niemals falsch geschriebene Wörter.

source: Random character combinations are hard to type and are seldom found in day-to-day typing. Misspelled words on the other hand are confusing and have even a negative learning value, since the trainee may memorize the wrong spelling.
de: Zufällige Zeichenkombinationen sind schwierig einzutippen und finden sich selten in üblichen Texten. Falsch geschriebene Wörter hingegen sind verwirrend und haben sogar einen negativen Lerneffekt, weil sich der Benutzer eine falsche Rechtschreibung merken kann.

source: Lesson text should be roughly 600 characters long
de: Eine Lektion sollte einen Text von etwa 600 Wörtern enthalten

source: They may be longer, up to 1200 characters is okay, but shorter lessons should be avoided. This is especially true for repetition lessons.
de: Sie können auch länger sein, bis zu 1200 Zeichen ist noch sinnvoll. Sie sollten aber kürzere Lektionen vermeiden. Dies gilt besonders für Wiederholungslektionen.

source: Keeping within this range ensures that a untrained typist (~120 characters per minute) can finish a lesson in five to ten minutes. Longer lessons get frustrating, shorter ones are ineffective.
de: Bleiben Sie innerhalb dieses Bereichs, so dass ein auch ungeübter Maschinenschreiber (~ 120 Zeichen pro Minute) eine Lektion noch innerhalb von 5 bis 10 Minuten beenden kann. Übungen mit längeren Texten sind frustrierend, Lektionen mit kürzeren Texten nicht effektiv.

source: Quality checks in the lesson text editor
de: Qualitätskontrolle im Editor für Kurstexte

source: <screeninfo>Quality check in the course editing window</screeninfo>
de: <screeninfo>Qualitätskontrolle im Kurseditor</screeninfo>

source: <phrase>Quality check in the course editing window</phrase>
de: <phrase>Qualitätskontrolle im Kurseditor</phrase>

source: Above is a screenshot of the course editor with one of a problematic lesson loaded showing one of the built-in quality-assurance checks: if a lesson contains characters not available in that lesson, because they are not among the configured new characters of this lesson or any previous one, they are highlighted in red. There is also a check for too long lines resulting in a muted color for the characters behind the allowed column.
de: Oben sehen Sie ein Bildschirmfoto des Kurseditors, in dem solch eine problematische Lektion geladen wurde und für die eine der eingebauten Qualitätskontrollen angezeigt wird: Enthält eine Lektion neue Zeichen, die noch nicht in dieser oder einer früheren Lektion eingeführt wurden, werden sie rot hervorgehoben. Es gibt auch einen Test für zu lange Zeilen, dabei werden die Zeichen, die die maximal erlaubte Zeilenlänge überschreiten, in gedeckten Farben angezeigt.

source: On the left side there is a list over all data files &i18n-ktouch; knows about, built-in and user-created alike. If the user selects a built-in resource the editor will degrade to a simple viewer, though. If the user selects a keyboard layout the program will adapt appropriately.
de: Auf der linken Seite sehen Sie eine Liste aller Datendateien von &i18n-ktouch;, sowohl eingebaute als auch benutzerdefinierte Dateien. Wird ein eingebauter Kurs ausgewählt, funktioniert der Editor nur als Betrachter und die Daten können nicht bearbeitet werden. Wählen Sie eine andere Tastaturbelegung, werden die angezeigten Kurse entsprechend angepasst.

source: Creating keyboard layouts
de: Tastaturbelegungen erstellen

source: You can create your own keyboard layouts using built-in &i18n-ktouch; editor. Usually it's best is to start with an existing layout close to the keyboard layout you want to create, and use that as a base for own layout. That way you can avoid a lot of work.
de: Sie können Ihre eigenen Tastaturbelegungen mit dem in &i18n-ktouch; eingebauten Editor erstellen. Normalerweise ist es am besten, mit einer bereits vorhandenen Belegung zu beginnen, die der neu zu erstellenden Belegung ähnelt. Verwenden Sie dies als Grundlage der eigenen Belegung. Damit ersparen Sie sich viel Arbeit.

source: Keyboard layout properties
de: Eigenschaften von Tastaturbelegungen

source: The keyboard layout properties can be chosen using &i18n-ktouch; keyboard layout creation wizard. To invoke this wizard you should press <inlinemediaobject> <imageobject> <imagedata fileref="Icon-document-new.png" format="PNG"/> </imageobject> </inlinemediaobject> button in the toolbar of <guilabel>Course and Keyboard Layout Editor</guilabel> window.
de: Die Eigenschaften von Tastaturbelegungen können im &i18n-ktouch;-Assistenten für das Erstellen von Tastaturbelegungen ausgewählt werden. Um diesen Assistenten zu starten, drücken Sie den Knopf <inlinemediaobject> <imageobject> <imagedata fileref="Icon-document-new.png" format="PNG"/> </imageobject> </inlinemediaobject> in der Werkzeugleiste des Fensters <guilabel>Kurs- und Tastaturbelegungseditor</guilabel>.

source: The first page of creation &i18n-ktouch; wizard allows you to choose the type of the data. Select <guilabel>Keyboard layout</guilabel> and press <guibutton>Next</guibutton>.
de: Auf der ersten Seite des Assistenten können Sie die Art der Daten eingeben. Wählen Sie <guilabel>Tastaturbelegung</guilabel> und drücken Sie auf <guibutton>Weiter</guibutton>.

source: The second page of wizard allows you to choose the title and the name of the layout.
de: Auf der zweiten Seite des Assistenten können Sie den Titel und den Namen der Tastaturbelegung eintragen.

source: <screeninfo>New layout wizard second page</screeninfo>
de: <screeninfo>Zweite Seite des Assistenten für neue Tastaturbelegungen</screeninfo>

source: <phrase>New layout wizard second page</phrase>
de: <phrase>Zweite Seite des Assistenten für neue Tastaturbelegungen</phrase>

source: The layout title is important for the quick-select menu entry in the layout list of <link linkend="ktouch_menu">&i18n-ktouch; configuration menu</link> and for the statistics.
de: Der Titel der Tastaturbelegung wird als Eintrag im Auswahlmenü der Tastaturbelegungsliste des <link linkend="ktouch_menu">&i18n-ktouch;-Einrichtungsmenüs</link> und für die Statistiken verwendet.

source: The layout name will be used as a name of the layout by &i18n-ktouch; internally.
de: Der Name der Tastaturbelegung wird intern von &i18n-ktouch; verwendet.

source: <screeninfo>New layout wizard third page</screeninfo>
de: <screeninfo>Dritte Seite des Assistenten für neue Tastaturbelegungen</screeninfo>

source: <phrase>New layout wizard third page</phrase>
de: <phrase>Dritte Seite des Assistenten für neue Tastaturbelegungen</phrase>

source: Using the third page of wizard you can choose other layout as a template for your layout. Select the course from the list and press <guibutton>Finish</guibutton>.
de: Auf der dritten Seite des Assistenten können Sie eine andere Tastaturbelegung als Vorlage verwenden. Wählen Sie eine Belegung aus der Liste und drücken Sie auf <guibutton>Fertigstellen</guibutton>.

source: <screeninfo>New layout editing window</screeninfo>
de: <screeninfo>Editorfenster für neue Tastaturbelegungen</screeninfo>

source: <phrase>New layout editing window</phrase>
de: <phrase>Editorfenster für neue Tastaturbelegungen</phrase>

source: &i18n-ktouch; will open the editor window prepared to entering your keyboard layout data.
de: &i18n-ktouch; öffnet das Editorfenster für Tastaturbelegungen, jetzt können Sie die Daten für die Belegung eingeben.

source: Adding keys
de: Tasten hinzufügen

source: Use <inlinemediaobject> <imageobject> <imagedata fileref="Icon-list-add.png" format="PNG"/> </imageobject> </inlinemediaobject> <guilabel>Normal Key</guilabel> button to add new normal key or <inlinemediaobject> <imageobject> <imagedata fileref="Icon-list-add.png" format="PNG"/> </imageobject> </inlinemediaobject> <guilabel>Special Key</guilabel> button to add new special key (modifier keys, <keycap>Space</keycap>, &Backspace;, &Tab;, <keycap>Caps Lock</keycap> or &Enter;) to the layout. The <inlinemediaobject> <imageobject> <imagedata fileref="Icon-edit-delete.png" format="PNG"/> </imageobject> </inlinemediaobject><guilabel>Delete</guilabel> button can be used to remove a selected key from your layout. The scale can be changed using the slider at the left part of the editor toolbar.
de: Verwenden Sie den Knopf <inlinemediaobject> <imageobject> <imagedata fileref="Icon-list-add.png" format="PNG"/> </imageobject> </inlinemediaobject> <guilabel>Normale Taste</guilabel>, um eine normale Taste hinzuzufügen oder den Knopf <inlinemediaobject> <imageobject> <imagedata fileref="Icon-list-add.png" format="PNG"/> </imageobject> </inlinemediaobject> <guilabel>Sondertaste</guilabel>, um eine neue Sondertaste (wie zum Beispiel <keycap>Leerzeichen</keycap>, &Backspace;, &Tab;, <keycap>Umschalttaste</keycap> oder &Enter;) zur Tastaturbelegung hinzuzufügen. Der Knopf <inlinemediaobject> <imageobject> <imagedata fileref="Icon-edit-delete.png" format="PNG"/> </imageobject> </inlinemediaobject><guilabel>Löschen</guilabel> kann benutzt werden,um eine ausgewählte Taste aus Ihrer Belegung zu entfernen. Die Vergrößerung kann mit dem Schieberegler oben im Editor eingestellt werden.

source: The properties of individual keys can be edited using the bottom pane of the editor window.
de: Die Eigenschaften einzelner Tasten können im unteren Bereich des Editorfensters geändert werden.

source: Normal keys
de: Normale Tasten

source: It is easy to change the size or properties of a key.
de: Die Größe oder Eigenschaft einer Taste kann leicht geändert werden.

source: Begin by clicking on the key you want to change. This selects the clicked key as the current key.
de: Beginnen Sie damit, auf eine Taste zu klicken, die Sie bearbeiten möchten. Dadurch wird diese Taste zur aktuell ausgewählten Taste.

source: There are now 4 squares on the corners of the key. By dragging these squares, you will be able to drag the key border to a new location. Dragging the whole key allows you to change the key position in the layout.
de: Es werden jetzt vier Quadrate an den Ecken der Taste angezeigt. Durch Ziehen dieser Quadrate können Sie den Tastenrand an eine neue Position ziehen. Durch Ziehen der gesamten Taste wird die Position in der Tastaturbelegung geändert.

source: The numerical characteristics of the key geometry can also be changed using the <guilabel>Geometry</guilabel> section of the pane at the bottom of the editor window.
de: Die numerischen Werte der Tastengeometrie können im Abschnitt <guilabel>Geometrie</guilabel> unten im Editorfenster geändert werden.

source: <screeninfo>Editing an individual key properties</screeninfo>
de: <screeninfo>Bearbeitung der Eigenschaften einer einzelnen Taste</screeninfo>

source: <phrase>Editing an individual key properties</phrase>
de: <phrase>Bearbeitung der Eigenschaften einer einzelnen Taste</phrase>

source: The bottom pane can also be used to choose finger to press the key and switch the haptic marker for the key.
de: Im unteren Bereich können außerdem die Finger für das Drücken der Tasten und der fühlbaren Erhebungen auf Tasten eingestellt werden.

source: Key characters
de: Tastenzeichen
