Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdeedu/ktouch.po
Languages: de

source: <!ENTITY i18n-ktouch "<application>Typewriting Trainer</application>">
de: <!ENTITY i18n-ktouch "<application>Schreibmaschinenkurs</application>">

source: The &i18n-ktouch; Handbook
de: Das Handbuch zu &i18n-ktouch;

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Thorsten</firstname><surname>Mürell</surname><affiliation><address><email>thorsten@muerell.de</email></address></affiliation><contrib>Deutsche Übersetzung</contrib></othercredit>

source: &i18n-ktouch; is a program for learning to touch type. &i18n-ktouch; provides you with text to train on and adjusts to different levels depending on how good you are. It displays which key to press next and the correct finger to use.
de: &i18n-ktouch; ist ein Programm, um das Maschineschreiben zu lernen. Das Programm enthält Texte, um ihre Schnelligkeit zu trainieren und verschiedene Schwierigkeitsstufen. Es kann anzeigen, welche Taste Sie als nächste drücken müssen und welchen Finger Sie dazu benutzen sollen.

source: touchwriting
de: Maschineschreiben

source: touchtyping
de: Maschineschreiben

source: typing
de: Tippen

source: typewriting
de: Abtippen

source: education
de: Bildung

source: touch
de: Anschlag

source: type
de: Tippen

source: Learning touch typing with &i18n-ktouch;
de: Maschineschreiben lernen mit &i18n-ktouch;

source: Introduction
de: Einleitung

source: What is &i18n-ktouch;?
de: Was ist &i18n-ktouch;?

source: &i18n-ktouch; is a program for learning to touch type.
de: &i18n-ktouch; ist ein Programm, mit dem Sie das Maschineschreiben lernen können.

source: &i18n-ktouch; provides you with text to train on and adjusts to different levels depending on how good you are. It shows your keyboard and indicates which key to press next and the correct finger to use.
de: &i18n-ktouch; enthält Übungstexte in verschiedenen Schwierigkeitsstufen. Es kann anzeigen, welche Taste Sie als nächste drücken müssen und welchen Finger Sie dazu benutzen sollen.

source: <screeninfo>The main screen of &i18n-ktouch;</screeninfo>
de: <screeninfo>Hauptfenster von &i18n-ktouch;</screeninfo>

source: <phrase>The main screen of &i18n-ktouch;</phrase>
de: <phrase>Hauptfenster von &i18n-ktouch;</phrase>

source: &i18n-ktouch; is a touch typing tutor aimed mostly at personal use. You learn typing with all fingers, step by step, without having to look down at the keyboard all the time to find the right keys which slows you down a lot.
de: &i18n-ktouch; ist ein Schreibmaschinenkurs für den persönlichen Gebrauch. Sie lernen nacheinander das Tippen mit allen Fingern, ohne dauernd auf die Tastatur herunter zu schauen, um die richtigen Tasten zu finden, was Ihre Tippgeschwindigkeit erheblich vermindert.

source: Features
de: Eigenschaften

source: In its current version, &i18n-ktouch; 2.2 has quite a number of features, such as:
de: In der aktuellen Version (&i18n-ktouch; 2.2) gibt es einige Eigenschaften wie:

source: Ships with dozens different courses in many languages and a comfortable course editor
de: Enthält dutzende verschiedener Kurse in vielen Sprachen und einen gut zu bedienender Kurseditor

source: Support for different keyboard layouts with the ability to use and edit user-defined layouts
de: Verschiedene Tastaturbelegungen und die Möglichkeit, eigene Tastaturen zu erstellen und zu benutzen

source: During your training session &i18n-ktouch; collects comprehensive statistical information to help you or your teacher analyze your progress
de: Umfassende Statistiken über Ihre Lektionen, die es Ihnen (oder Ihrem Lehrer) leicht machen, Ihren Lernerfolg zu überprüfen

source: There are many more features which will be discussed in the appropriate chapters of this manual.
de: Es gibt viele weitere Eigenschaften, sie werden in den entsprechenden Kapiteln dieses Handbuchs erläutert.

source: Getting started
de: Einführung

source: Here's another screenshot of &i18n-ktouch; in action, this time with a German keyboard and training lesson:
de: Hier sehen Sie ein Bildschirmfoto von &i18n-ktouch; mit einer deutschen Tastatur und einer deutschen Übungslektion:

source: <screeninfo>Main screen of &i18n-ktouch;</screeninfo>
de: <screeninfo>Hauptfenster von &i18n-ktouch;</screeninfo>

source: <phrase>Main screen of &i18n-ktouch;</phrase>
de: <phrase>Hauptfenster von &i18n-ktouch;</phrase>

source: Even though learning touch typing with &i18n-ktouch; and using the program should be very simple we will look a bit closer at &i18n-ktouch; in the following sections.
de: Auch wenn das Maschineschreiben lernen mit &i18n-ktouch; und die Bedienung des Programms sehr leicht ist, erhalten Sie in den folgenden Abschnitten weitere Erläuterungen zu &i18n-ktouch;.

source: Creating your first profile
de: Ihr erstes Profil erstellen

source: The first time you start &i18n-ktouch; it will open a special screen helping you to create your first profile. You can choose the name of your profile and the level of your typing skills.
de: Beim ersten Start vom &i18n-ktouch; wird ein besonderes Fenster geöffnet, in dem Sie bei der Erstellung Ihres ersten Profils unterstützt werden. Hier können Sie einen Namen für Ihr Profil und Ihre Fähigkeiten im Schreibmaschineschreiben eintragen.

source: The level you choose determines the general operation of &i18n-ktouch;. In beginner mode lessons are unlocked one by one after you pass them, for advanced typist all lessons are available right from the beginning.
de: Durch das ausgewählte Niveau werden die allgemeinen Einstellungen von &i18n-ktouch; festgelegt. Im Modus für Anfänger werden die Lektionen nacheinander durch erfolgreiches Üben der vorherigen Lektionen freigegeben, für erfahrene Maschinenschreiber sind alle Lektionen von Anfang an verfügbar.

source: Think about your choice, you won't able to change the type of a profile later. But you can always create new profiles to revisit this decision.
de: Wählen Sie sorgsam, da Sie den Typ eines Profils später nicht mehr ändern können. Aber Sie können jederzeit ein neues Profil erstellen, um diese Entscheidung zu überdenken.

source: <screeninfo>Welcome screen of &i18n-ktouch;</screeninfo>
de: <screeninfo>Startbildschirm von &i18n-ktouch;</screeninfo>

source: <phrase>Welcome screen of &i18n-ktouch;</phrase>
de: <phrase>Startbildschirm von &i18n-ktouch;</phrase>

source: After pressing <guibutton>Start Training</guibutton> you will be taken to the home screen. This screen will also be the first screen visible when you run &i18n-ktouch; the next time.
de: Mit dem Drücken auf <guibutton>Übung starten</guibutton> kommen Sie zum Startbildschirm. Dieses Fenster wird beim nächsten Start von &i18n-ktouch; als erstes angezeigt.

source: Picking a lesson
de: Auswahl einer Lektion

source: The home screen of &i18n-ktouch; consists of a toolbar and the course selector. For more information see <xref linkend="training_preparation"/>.
de: Der Startbildschirm von &i18n-ktouch; besteht aus einer Werkzeugleiste und der Kursauswahl. Weitere Informationen finden Sie im Abschnitt <xref linkend="training_preparation"/>.

source: <screeninfo>Home screen of &i18n-ktouch;</screeninfo>
de: <screeninfo>Startbildschirm von &i18n-ktouch;</screeninfo>

source: <phrase>Home screen of &i18n-ktouch;</phrase>
de: <phrase>Startbildschirm von &i18n-ktouch;</phrase>

source: &i18n-ktouch; will show you the first course available for your current keyboard layout.
de: &i18n-ktouch; zeigt den ersten Kurs an, der für die aktuelle Tastaturbelegung verfügbar ist.

source: You can switch between courses or choose <link linkend="custom_lessons">custom lessons</link> using the <inlinemediaobject> <imageobject> <imagedata fileref="Icon-arrow-right.png" format="PNG"/> </imageobject> </inlinemediaobject> and <inlinemediaobject> <imageobject> <imagedata fileref="Icon-arrow-left.png" format="PNG"/> </imageobject> </inlinemediaobject> buttons in the top right part of the window.
de: Sie können zwischen Kursen wechseln oder <link linkend="custom_lessons">benutzerdefinierte Lektion auswählen</link>, indem Sie Knöpfe <inlinemediaobject> <imageobject> <imagedata fileref="Icon-arrow-right.png" format="PNG"/> </imageobject> </inlinemediaobject> und <inlinemediaobject> <imageobject> <imagedata fileref="Icon-arrow-left.png" format="PNG"/> </imageobject> </inlinemediaobject> rechts oben im Fenster benutzen.

source: On some platforms, especially on &Microsoft; &Windows;, automatic keyboard layout detection is not available. In that case you have to click on the <inlinemediaobject> <imageobject> <imagedata fileref="Icon-configure.png" format="PNG"/> </imageobject> </inlinemediaobject> button in the toolbar, select <guisubmenu> Choose Keyboard Layout...</guisubmenu> submenu and choose the name of keyboard layout or some keyboard layout which is similar to yours. If your keyboard is not included, you can define your own keyboard layout yourself, see <xref linkend="create_layouts"/>.
de: Auf einigen Plattformen wie insbesondere unter &Microsoft; &Windows; funktioniert die automatische Erkennung der Tastaturbelegung nicht. Benutzen Sie in diesem Fall den Knopf <inlinemediaobject> <imageobject> <imagedata fileref="Icon-configure.png" format="PNG"/> </imageobject> </inlinemediaobject> in der Werkzeugleiste und wählen im Untermenü <guisubmenu>Tastaturbelegung auswählen ...</guisubmenu> den Namen der Belegung oder eine Belegung ähnlich zu Ihrer Tastatur. Ist Ihre Tastaturbelegung nicht im Untermenü enthalten, können Sie eine eigene Belegung definieren, siehe <xref linkend="create_layouts"/>.

source: Choose your lesson from the list on left of the window. You cannot choose the locked lessons with <inlinemediaobject> <imageobject> <imagedata fileref="Icon-object-locked.png" format="PNG"/> </imageobject> </inlinemediaobject> as they are too difficult for your current skills. Pass lessons to unlock new ones. The preview of the selected lesson will be shown on the right of lessons list.
de: Wählen Sie eine Lektion aus der Liste links im Fenster. Gesperrte Lektionen mit dem Symbol <inlinemediaobject> <imageobject> <imagedata fileref="Icon-object-locked.png" format="PNG"/> </imageobject> </inlinemediaobject> können nicht ausgewählt werden, da sie für Ihre derzeitigen Fähigkeiten noch zu schwierig sind. Üben Sie erfolgreich Lektionen, um neue Lektionen freizugeben. Eine Vorschau der ausgewählten Lektion wird rechts von der Lektionsliste gezeigt.

source: More information about the selected course can be shown and hidden again using <inlinemediaobject> <imageobject> <imagedata fileref="Icon-dialog-information.png" format="PNG"/> </imageobject> </inlinemediaobject> button next to the course title.
de: Weitere Informationen zum ausgewählten Kurs können mit dem Knopf <inlinemediaobject> <imageobject> <imagedata fileref="Icon-dialog-information.png" format="PNG"/> </imageobject> </inlinemediaobject> neben dem Kurstitel ein- und ausgeblendet werden.

source: When you finished with the selection click on <guibutton>Start Training</guibutton> to go to the training &i18n-ktouch; screen.
de: Haben Sie Ihre Wahl getroffen, klicken Sie auf <guibutton>Übung starten</guibutton>, um das Übungsfenster von &i18n-ktouch; zu öffnen.

source: Training
de: Übungen

source: The training window of &i18n-ktouch; shows three main sections:
de: Das Übungsfenster von &i18n-ktouch; besteht aus den folgenden drei Bereichen:

source: Some typing statistics in info boxes at the top
de: Einige statistische Informationen im oberen Bereich

source: The text you need to type
de: Der Text, den Sie eintippen müssen

source: The keyboard visualization
de: Die Abbildung der Tastatur

source: <screeninfo>The training screen of &i18n-ktouch;</screeninfo>
de: <screeninfo>Das Übungsfenster von &i18n-ktouch;</screeninfo>

source: <phrase>The training screen of &i18n-ktouch;</phrase>
de: <phrase>Das Übungsfenster von &i18n-ktouch;</phrase>

source: Visibility of training screen parts can be configured using <link linkend="configuration_dialog">&i18n-ktouch; configuration dialog</link>.
de: Die Anzeige von Tastatur und Statistiken im Übungsfenster kann im <link linkend="configuration_dialog">Einrichtungsdialog von &i18n-ktouch;</link> ein- und ausgeschaltet werden.

source: Place your two index fingers on the two keys on your keyboard with the two little tactile markers near the center of the middle character row. With that done your other fingers will find their intended keys almost automatically. Your thumbs should rest above the space key, the only key you will ever use them for when touch typing. The other fingers should be placed on the three keys adjacent to the marked keys on the center row. Keys for the same finger are grouped together through their color. Try to move your hands as little as possible and always try to return your fingers to their resting positions after you have typed a character.
de: Legen Sie die zwei Zeigefinger über die beiden Tasten mit der Erhebung im Zentrum der mittleren Zeichenreihe. Dann liegen Ihre anderen Finger fast automatisch auf den richtigen Tasten. Ihren Daumen sollten Sie über die Leertaste halten, dies ist die einzige Taste, die Sie mit den Daumen drücken. Die anderen Finger sollten auf den drei Tasten neben den Taste für die Zeigefinger in der mittleren Reihe liegen. Tasten, die mit dem gleichen Fingern gedrückt werden sollen, sind als Gruppe in gleicher Farbe gekennzeichnet. Versuchen Sie Ihre Hände möglichst wenig zu bewegen und führen Sie die Finger nach dem Drücken einer Taste immer wieder in die Ruhestellung zurück.

source: Start typing the text in the middle of the screen. The next key you have to press is always highlighted on the keyboard visualization. While you type you may make mistakes and hit the wrong key. In that case the characters will displayed in red and you have to hit &Backspace; as often as necessary to erase the wrongly typed characters.
de: Beginnen Sie mit dem Tippen des Texts in der Mitte des Programmfenster. Die nächste Taste, die gedrückt werden muss, wird immer auf der Tastaturanzeige hervorgehoben. Während der Eingabe machen Sie vielleicht Fehler und drücken eine falsche Taste. Dann werden die Zeichen in roter Farbe angezeigt und Sie müssen alle falsch eingetippten Zeichen nacheinander mit der Taste &Backspace; löschen.

source: When you have successfully completed a line of text you need to press the <keycap>Return</keycap> to advance to the next line.
de: Wenn Sie eine vollständige Zeile eingetippt haben, müssen Sie die &Enter;taste drücken, um zur nächsten Zeile zu kommen.

source: The key used to advance to the next line can be changed using <link linkend="configuration_dialog">&i18n-ktouch; configuration dialog</link>
de: Die Taste für den Wechsel zur nächsten Zeile kann im Einrichtungsdialog von <link linkend="configuration_dialog">&i18n-ktouch;</link> geändert werden.

source: Review your progress
de: Überprüfen Sie Ihre Fortschritte

source: When you have completed a lesson &i18n-ktouch; will switch to the score screen. It displays your current training and lesson statistics and shows a graphical history of previous training sessions.
de: Haben Sie eine Lektion in &i18n-ktouch; abgeschlossen, wird ein Statistikdialog angezeigt. In diesem Dialog werden Statistiken zu Ihrer aktuellen Übungssitzung und Lektion sowie grafisch der Fortschritt in den vorhergehenden Übungssitzungen dargestellt.

source: <screeninfo>Statistics dialog of &i18n-ktouch;</screeninfo>
de: <screeninfo>Statistikdialog von &i18n-ktouch;</screeninfo>

source: <phrase>Statistics dialog of &i18n-ktouch;</phrase>
de: <phrase>Statistikdialog von &i18n-ktouch;</phrase>

source: In the statistics dialog you can select to show a particular lesson or <guilabel>All Lessons</guilabel>. This is useful to distinguish between overall performance and skill in certain lessons.
de: Im diesem Dialog kann entweder nur die Statistik für eine bestimmte Lektion oder <guilabel>Alle Lektionen</guilabel> angezeigt werden. Das erleichtert es, zwischen der allgemeinen Leistung und Fähigkeiten in bestimmten Lektionen zu unterscheiden.

source: If you feel ready for the next lesson press <guibutton>Next lesson</guibutton> button in the toolbar to continue with the next lesson of the current course or <guibutton>Repeat lesson</guibutton> button to try your skills on the current lesson again. The <guibutton>Next lesson</guibutton> button will be only available if you have passed the lesson.
de: Sind Sie für die nächste Lektion bereit, drücken Sie den Knopf <guibutton>Nächste Lektion</guibutton> in der Werkzeugleiste, um mit der nächsten Lektion des aktuellen Kurses fortzufahren oder verwenden Sie den Knopf <guibutton>Lektion wiederholen</guibutton>, um Ihre Fähigkeiten in der aktuellen Lektion erneut zu überprüfen. Der Knopf <guibutton>Nächste Lektion</guibutton> wird erst dann aktiviert, wenn Sie die Lektion erfolgreich absolviert haben.

source: If you want to switch to some other lesson or course press <guibutton>Return to Home Screen</guibutton>.
de: Möchten Sie zu einer anderen Lektion oder einem anderen Kurs wechseln, drücken Sie den Knopf <guibutton>Zurück zum Startbildschirm</guibutton>.

source: If you do not want to continue the training with &i18n-ktouch; just close the application window.
de: Möchten Sie die Übungen im &i18n-ktouch; nicht weiter fortsetzen, schließen Sie das Programmfenster.

source: Training Preparation
de: Übungsvorbereitung

source: Pretty much everything in the &i18n-ktouch; home screen should be self-explanatory. The top toolbar is meant to be the place where you can view and configure &i18n-ktouch; settings. The course selector can be used to view the information about the courses and switch between them.
de: Fast alles im Startbildschirm von &i18n-ktouch; ist selbsterklärend. In der oberen Werkzeugleiste finden Sie die Aktionen, um die Einstellungen für &i18n-ktouch; anzusehen und einzurichten. Mit der Kursauswahl können Informationen über die Kurse angezeigt und zu anderen Kursen gewechselt werden.

source: &i18n-ktouch; toolbar
de: Werkzeugleiste in &i18n-ktouch;

source: The toolbar of &i18n-ktouch; houses the profile button at the left and the application menu button at the right.
de: Die Werkzeugleiste von &i18n-ktouch; enthält links den Knopf für das Profil und rechts den Knopf für das Anwendungsmenü.

source: Profile management
de: Profilverwaltung

source: The profile button with the name of your profile at the left of home screen toolbar can be used to manage &i18n-ktouch; profiles.
de: Mit dem Profilknopf mit dem Namen des aktuellen Profils links in der Werkzeugleiste des Startbildschirms können die Profile für &i18n-ktouch; verwaltet werden.

source: <screeninfo>Profile management in &i18n-ktouch;</screeninfo>
de: <screeninfo>Profilverwaltung in &i18n-ktouch;</screeninfo>

source: <phrase>Profile management in &i18n-ktouch;</phrase>
de: <phrase>Profilverwaltung in &i18n-ktouch;</phrase>

source: You can review the settings of the existing profiles, delete them or create a new profile using <inlinemediaobject> <imageobject> <imagedata fileref="Icon-list-add.png" format="PNG"/> </imageobject> </inlinemediaobject> button.
de: Mit dem Knopf <inlinemediaobject> <imageobject> <imagedata fileref="Icon-list-add.png" format="PNG"/> </imageobject> </inlinemediaobject> blenden Sie ein Fenster ein, in Sie die Einstellungen des aktuellen Profils überprüfen, Profile löschen oder neue erstellen können.

source: To switch to the review mode press <guibutton>Edit</guibutton>. To select a profile and return to the home screen press <guibutton>Use Selected Profile </guibutton>.
de: Um in diesen Modus zu wechseln, drücken Sie auf <guibutton>Bearbeiten</guibutton>. Um ein Profil auszuwählen und zum Startbildschirm zurückzugehen, drücken Sie auf <guibutton>Ausgewähltes Profile verwenden</guibutton>.

source: <screeninfo>Reviewing profile information</screeninfo>
de: <screeninfo>Profilinformationen überprüfen</screeninfo>

source: <phrase>Reviewing profile information</phrase>
de: <phrase>Profilinformationen überprüfen</phrase>

source: <title>&i18n-ktouch; menu</title>
de: <title>Menü von &i18n-ktouch;</title>

source: &i18n-ktouch; menu can be opened using <inlinemediaobject> <imageobject> <imagedata fileref="Icon-configure.png" format="PNG"/> </imageobject> </inlinemediaobject> button in the toolbar of the home screen.
de: Das Menü von &i18n-ktouch; wird mit dem Knopf <inlinemediaobject> <imageobject> <imagedata fileref="Icon-configure.png" format="PNG"/> </imageobject> </inlinemediaobject> in der Werkzeugleiste des Startbildschirms geöffnet.

source: <screeninfo>&i18n-ktouch; menu</screeninfo>
de: <screeninfo>Menü von &i18n-ktouch;</screeninfo>

source: <phrase>&i18n-ktouch; menu</phrase>
de: <phrase>Menü von &i18n-ktouch;</phrase>

source: You can find a list of the menu items with their short descriptions below.
de: Im Folgenden finden Sie eine Liste der Menüeinträge mit einer kurzen Beschreibung.

source: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>F</keycap></keycombo> </shortcut> <guimenuitem>Full Screen Mode</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>F</keycap></keycombo> </shortcut> <guimenuitem>Vollbildmodus</guimenuitem>

source: <action>Toggle</action> full screen mode of &i18n-ktouch; on and off
de: <action>Schaltet</action> den Vollbildmodus für &i18n-ktouch; ein und aus

source: Course and Keyboard Layout Editor...
de: Kurs- und Tastaturbelegungseditor

source: <action>Open</action> the &i18n-ktouch; <link linkend="extending">editor window</link>
de: <action>Öffnet</action> das <link linkend="extending">Editorfenster</link> von &i18n-ktouch;

source: Configure Typewriting Trainer...
de: Schreibmaschinenkurs einrichten ...

source: <action>Display</action> the &i18n-ktouch; <link linkend="configuration_dialog">configuration dialog</link>
de: <action>Öffnet</action> den Dialog zur <link linkend="configuration_dialog">Einrichtung</link> von &i18n-ktouch;

source: Configure Shortcuts...
de: Kurzbefehle festlegen ...

source: <action>Configure</action> the shortcuts you want to associate with some actions
de: <action>Einstellung</action> der Tastenkürzel für einige Aktionen.

source: Configure keyboard layout...
de: Tastaturbelegung einrichten ...

source: A shortcut to the &systemsettings; module to configure the keyboard settings. Useful to prepare for training on a different keyboard layout.
de: Öffnet das Modul für die Tastatureinrichtung der &systemsettings;. Die Änderung des Tastaturbelegung ist als Vorbereitung für Übungen auf anderen Tastaturbelegungen nötig.

source: On platforms lacking the support for detecting the keyboard layout automatically, especially &Microsoft; &Windows;, this entry is replaced with a submenu to select &i18n-ktouch;'s keyboard layout manually.
de: Auf Plattformen ohne automatische Erkennung der Tastaturbelegung - insbesondere &Microsoft; &Windows; - wird dieser Eintrag durch ein Untermenü ersetzt, um die Tastaturbelegung für &i18n-ktouch; manuell auszuwählen.

source: Configuration dialog
de: Einrichtungsdialog
