Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdeedu/ktouch.po
Languages: de

source: The characters that will be shown on a key can be changed using the <guilabel> Characters</guilabel> section of the editor bottom pane.
de: Die auf einer Taste angezeigten Zeichen können im Abschnitt <guilabel>Zeichen</guilabel> unten im Editor geändert werden.

source: <screeninfo>Editing the character position</screeninfo>
de: <screeninfo>Zeichenposition bearbeiten</screeninfo>

source: <phrase>Editing the character position</phrase>
de: <phrase>Zeichenposition bearbeiten</phrase>

source: You can add a character by pressing <inlinemediaobject> <imageobject> <imagedata fileref="Icon-list-add.png" format="PNG"/> </imageobject> </inlinemediaobject> button. A selected character can be removed by pressing <inlinemediaobject> <imageobject> <imagedata fileref="Icon-list-remove.png" format="PNG"/> </imageobject> </inlinemediaobject> button.
de: Ein Zeichen können Sie mit dem Knopf <inlinemediaobject> <imageobject> <imagedata fileref="Icon-list-add.png" format="PNG"/> </imageobject> </inlinemediaobject> hinzufügen. Mit <inlinemediaobject> <imageobject> <imagedata fileref="Icon-list-remove.png" format="PNG"/> </imageobject> </inlinemediaobject> entfernen Sie ein ausgewähltes Zeichen.

source: You can also select the position of individual characters on the key by double-clicking in the <guilabel>Position</guilabel> column.
de: Sie können außerdem auch die Position einzelner Zeichen auf den Tasten angeben, indem Sie auf die Spalte <guilabel>Position</guilabel> doppelklicken.

source: Modifiers
de: Sondertasten

source: There are several modifier keys that can be defined in &i18n-ktouch;. They can be edited as normal keys but it is helpful to know identifier of modifier key to use them as appropriate. The table of modifier keys identifiers is given below.
de: Es gibt mehrere Sondertasten, die in &i18n-ktouch; definiert werden können. Die können wie normale Tasten bearbeitet werden, aber es ist hilfreich, die Kennungen der Sondertasten zu wissen, um sie richtig zu verwenden. Die Tabelle der Kennungen für Sondertasten wird unten angezeigt.

source: Modifier keys
de: Sondertasten

source: Modifier key
de: Sondertaste

source: Modifier id in &i18n-ktouch;
de: Kennung für Sondertasten in &i18n-ktouch;

source: <literal>left_shift</literal> or <literal>right_shift</literal>
de: <literal>left_shift</literal> oder <literal>right_shift</literal>

source: Custom Lessons
de: Benutzerdefinierte Lektionen

source: The custom lessons feature allows you to extend your training material in an easy way by choosing some arbitrary text.
de: Mit benutzerdefinierten Lektionen können Sie Ihre Übungsdaten erweitern, indem Sie einfach einen beliebigen Text wählen.

source: The custom lessons are gathered in a special course, the <guilabel>Custom Lessons</guilabel> course, always available right next to <link linkend="picking_a_lesson">the normal built-in courses</link>.
de: Benutzerdefinierte Lektionen werden in einem besonderen Kurs für <guilabel>Benutzerdefinierte Lektionen</guilabel> zusammengefasst, der immer rechts neben den <link linkend="picking_a_lesson">normalen eingebauten Kursen</link> verfügbar ist.

source: <screeninfo>Custom lessons course</screeninfo>
de: <screeninfo>Kurs mit benutzerdefinierten Lektionen</screeninfo>

source: <phrase>Custom lessons course</phrase>
de: <phrase>Kurs mit benutzerdefinierten Lektionen</phrase>

source: This special course mostly acts like any other, training and statistics gathering works as usual. Clicking on <guibutton>Create New Custom Lesson</guibutton> or the <guibutton>Edit</guibutton> button (for existing lessons) brings up a stripped-down version of <link linkend="adding_lessons">the normal lesson editor</link>.
de: Dieser besondere Kurs kann wie alle anderen Kurse benutzt werden, Übungsdaten und Statistiken funktionieren wie üblich. Durch Klicken auf <guibutton>Neue benutzerdefinierte Lektion erstellen</guibutton> oder auf <guibutton>Bearbeiten</guibutton> für bestehende Lektionen wird eine vereinfachte Version des <link linkend="adding_lessons">normalen Lektionseditors</link> geöffnet.

source: <screeninfo>Custom lesson editor</screeninfo>
de: <screeninfo>Editor für benutzerdefinierte Lektionen</screeninfo>

source: <phrase>Custom lesson editor</phrase>
de: <phrase>Editor für benutzerdefinierte Lektionen</phrase>

source: Use <inlinemediaobject> <imageobject> <imagedata fileref="Icon-document-open.png" format="PNG"/> </imageobject> </inlinemediaobject> button to open a generic text file that will be loaded into the lesson text field.
de: Benutzen Sie den Knopf <inlinemediaobject> <imageobject> <imagedata fileref="Icon-document-open.png" format="PNG"/> </imageobject> </inlinemediaobject>, um einfache Textdateien zu öffnen und in das Textfeld der Lektion zu laden.

source: The editor will highlight problematic sections of your lesson texts. Characters which can't by typed on your keyboard layout will be shown on a dark red, lines which are considered to be too long use a gray font for the excess characters.
de: Im Editor werden fehlerhafte Abschnitte in Ihrem Lektionstext hervorgehoben. Zeichen, die nicht mit Ihrer Tastaturbelegung eingegeben werden können, werden in dunkelrot angezeigt. In zu langen Zeilen werden die Zeichen, die die empfohlene Zeilenlänge überschreiten, in grau dargestellt.

source: All custom lessons are stored per profile and keyboard layout individually. Use this to manage different sets of lessons depending on the specific training situation.
de: Alle benutzerdefinierten Lektionen werden je Benutzerprofil und Tasturbelegung gespeichert. Daher können Sie verschiedene Lektionen abhängig von der besonderen Situation üben.

source: Sharing your results
de: Freigabe Ihrer Dateien für andere Benutzer

source: It is possible to save your courses and keyboard layouts in separate files outside of the local &i18n-ktouch; database.
de: Ihre Kurse und Tastaturbelegungen können in eigenen Dateien getrennt von der lokalen &i18n-ktouch;-Datenbank gespeichert werden.

source: To export a course or keyboard layout in a separate file choose the corresponding item in the list at the left part of <guilabel>Course and Keyboard Layout Editor</guilabel> window and press <guibutton>Export</guibutton> button in the toolbar.
de: Um einen Kursus oder eine Tastaturbelegung im eine Datei zu exportieren, wählen Sie den entsprechenden Eintrag in der Liste links im Fenster <guilabel>Kurs- und Tastaturbelegungseditor</guilabel> und drücken dann den Knopf <guibutton>Exportieren</guibutton> in der Werkzeugleiste.

source: &i18n-ktouch; will open a standard &kde; save dialog. Description of this dialog in details can be found in the <ulink url="help:/fundamentals/files.html">Opening and Saving Files</ulink> chapter of the &kde; Fundamentals.
de: &i18n-ktouch; öffnet den &kde;-Standarddialog zum Speichern. eine ausführliche Erläuterung zu diesem Dialog finden Sie im Kapitel <ulink url="help:/fundamentals/files.html">Öffnen und Speichern von Dateien</ulink> der &kde;-Grundlagen.

source: You can choose the name and the location of the &XML; file to be saved.
de: Wählen Sie den Namen und Speicherort der &XML;-Datei, die Sie exportieren möchten.

source: If you find it worth to share your files with over users, please send them with some description to <ulink url="mailto:kde-edu@kde.org">kde-edu mailing list</ulink>.
de: Möchten Sie Ihre Dateien für andere Benutzer freigeben, senden Sie sie bitte mit einer Beschreibung an dir <ulink url="mailto:kde-edu@kde.org">KDE-Edu.Mailingliste</ulink>.

source: Your data should be licensed under <ulink url="http://www.gnu.org/licenses/gpl-2.0.html">GNU General Public License, version 2</ulink> to include them into the default &i18n-ktouch; installation.
de: Ihre Daten sollten Sie unter der <ulink url="http://www.gnu.org/licenses/gpl-2.0.html">GNU General Public License, Version 2</ulink> veröffentlichen, damit Sie in der Standardinstallation von &i18n-ktouch; eingeschlossen werden können.

source: To import your data files into &i18n-ktouch; press <guibutton>Import</guibutton> button in the toolbar and choose &XML; file that was earlier exported using &i18n-ktouch;.
de: Um Datendateien in &i18n-ktouch; zu importieren, drücken Sie auf <guibutton>Import</guibutton> in der Werkzeugleiste und wählen dann eine &XML;-Datei, die vorher von &i18n-ktouch; exportiert wurde.

source: Credits and License
de: Danksagungen und Lizenz

source: &i18n-ktouch;, Copyright 1999-2007 by
de: &i18n-ktouch;, Copyright 1999-2007

source: &i18n-ktouch;, Copyright 2011-2012 by Sebastian Gottfried <email>sebastiangottfried@web DOT de</email>.
de: &i18n-ktouch;, Copyright 2011-2012 Sebastian Gottfried <email>sebastiangottfried@web DOT de</email>.

source: Contributors:
de: Mitwirkende:

source: Frank Quotschalla, German keyboard and German training file and translation.
de: Frank Quotschalla, deutsche Tastatur und deutsche Trainingsdatei und Übersetzung.

source: Ernesto Hern&aacute;ndez-Novich, Latin American keyboard
de: Ernesto Hern&aacute;ndez-Novich, lateinamerikanische Tastatur

source: Jo&atilde;o Miguel Neves, Portuguese keyboard
de: Jo&atilde;o Miguel Neves, portugiesische Tastatur

source: Henri Girard, French keyboard
de: Henri Girard, französische Tastatur

source: Special thanks to all the other (here not mentioned) contributors of keyboard and lesson files.
de: Besonderen Dank an alle anderen hier nicht genannten Mitwirkenden für Tastatur- und Lektionsdateien.

source: CREDIT_FOR_TRANSLATORS
de: <para>Übersetzung: Thorsten Mürell <email>thorsten@muerell.de</email></para>

source: How to obtain and install &i18n-ktouch;
de: Woher Sie &i18n-ktouch; bekommen

source: Compilation and Installation
de: Kompilierung und Installation
