Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdeedu/ktouch_man-ktouch.1.po
Languages: de

source: KDE User's Manual
de: KDE-Benutzerhandbuch

source: <firstname>Ben</firstname><surname>Burton</surname> <contrib>KTouch man page.</contrib> <email>bab@debian.org</email>
de: <firstname>Ben</firstname><surname>Burton</surname> <contrib>Benutzerhandbuch für KTouch</contrib> <email>bab@debian.org</email>

source: a typing tutor for KDE
de: Ein Schreibmaschinenkurs für KDE

source: <command>ktouch</command> <group choice="opt"><option>URL</option></group> <arg choice="opt">KDE Generic Options</arg> <arg choice="opt">Qt Generic Options</arg> <arg choice="opt">KTouch Options</arg>
de: <command>ktouch</command> <group choice="opt"><option>URL</option></group> <arg choice="opt">Allgemeine KDE-Optionen</arg> <arg choice="opt">Allgemeine Qt-Optionen</arg> <arg choice="opt">KTouch-Optionen</arg>

source: Description
de: Beschreibung

source: &ktouch; is a program for learning touch typing. It helps you learn to type on a keyboard quickly and correctly. Every finger has it's place on the keyboard with associated keys to press.
de: &ktouch; ist ein Programm, um das Maschineschreiben zu lernen. Sie lernen schnell und richtig auf der Tastatur zu schreiben. Jeder Finger hat einen bestimmten Platz auf der Tastatur und soll die zugehörigen Tasten drücken.

source: &ktouch; helps you learn to touch type by providing you with text to train on, and adjusts to different levels depending on how good you are. It can display which key to press next, and correct finger to use.
de: &ktouch; unterstützt Sie beim Lernen des Maschineschreibens mit Übungstexten in verschiedenen Schwierigkeitsstufen. Das Programm zeigt Ihnen die Taste an, die als Nächste gedrückt werden muss, und auch welchen Finger Sie dafür benutzen sollen.

source: This application is part of the official &kde; edutainment module.
de: Dieses Programm ist im Modul &kde;-Edutainment enthalten.

source: KTouch Options
de: KTouch-Optionen

source: Use a QGLWidget for the viewport.
de: Verwendet ein QGLWidget für das Ansichtsfenster.

source: Launch the course and keyboard layout editor.
de: Startet den Kurs- und Tastaturbelegungseditor.

source: See Also
de: Siehe auch

source: More detailed user documentation is available from <ulink url="help:/ktouch">help:/ktouch</ulink> (either enter this <acronym>URL</acronym> into &konqueror;, or run <userinput><command>khelpcenter</command> <parameter>help:/ktouch</parameter></userinput>).
de: Weitere ausführliche Dokumentation finden Sie unter <ulink url="help:/ktouch">help:/ktouch</ulink> (geben Sie diese <acronym>URL</acronym> entweder im &konqueror; ein oder starten Sie <userinput><command>khelpcenter</command> <parameter>help:/ktouch</parameter></userinput>).

source: There is also further information available at the <ulink url="http://edu.kde.org/ktouch/">&kde; edutainment website</ulink>.
de: Weitere Informationen finden Sie auf der <ulink url="http://edu.kde.org/ktouch/"> &kde; Edutainment Webseite</ulink>.

source: Authors
de: Autoren

source: KTouch was written by <personname><firstname>Haavard</firstname><surname>Froeiland</surname></personname> <email>haavard@users.sourceforge.net</email> and <personname><firstname>Andreas</firstname><surname>Nicolai</surname></personname> <email>Andreas.Nicolai@gmx.net</email>.This manual page based on the one prepared for Debian by <personname> <firstname>Ben</firstname><surname>Burton</surname></personname>
de: KTouch wurde von <personname><firstname>Haavard</firstname><surname>Froeiland</surname></personname> <email>haavard@users.sourceforge.net</email> und <personname><firstname>Andreas</firstname><surname>Nicolai</surname></personname> <email>Andreas.Nicolai@gmx.net</email> geschrieben. Diese Handbuchseite wurde auf der Grundlage des von <personname><firstname>Ben</firstname><surname>Burton</surname></personname> für das Debian-Projekt geschriebenen Handbuchs erstellt.
