Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdeedu/ktouch.po
Languages: de

source: You can customize &i18n-ktouch; quite a bit. The settings apply for all profiles globally. Open the configuration dialog by pressing <inlinemediaobject> <imageobject> <imagedata fileref="Icon-configure.png" format="PNG"/> </imageobject> </inlinemediaobject> button at the right of the top toolbar of the home screen then choosing <guimenuitem>Configure Typewriting Trainer...</guimenuitem>.
de: Für &i18n-ktouch; gibt es ziemlich viele Einstellungsmöglichkeiten, die global auf alle Profile angewendet werden. Drücken Sie den Knopf <inlinemediaobject> <imageobject> <imagedata fileref="Icon-configure.png" format="PNG"/> </imageobject> </inlinemediaobject> rechts in der oberen Werkzeugleiste und wählen Sie dann <guimenuitem>&i18n-ktouch; einrichten ...</guimenuitem>, um den Einstellungsdialog zu öffnen.

source: Training Settings
de: Übungseinstellungen

source: In this dialog you can select the options that control tutor window appearance and how &i18n-ktouch; behaves during training.
de: In diesem Dialog wählen Sie alle Einstellungen für das Erscheinungsbild des Übungsfensters und das Verhalten von &i18n-ktouch; bei den Übungen.

source: <screeninfo>Training options</screeninfo>
de: <screeninfo>Trainingseinstellungen</screeninfo>

source: <phrase>Training options</phrase>
de: <phrase>Trainingseinstellungen</phrase>

source: The <guilabel>Enforce correction of typing errors</guilabel> check box can be used to control whether typing errors have to be corrected.
de: Mit dem Ankreuzfeld <guilabel>Korrektur von Tippfehlern erzwingen</guilabel> können Sie einstellen, dass Tippfehler korrigiert werden müssen.

source: You can control the visibility of statistics and keyboard panes during training using <guilabel>Show keyboard</guilabel> and <guilabel>Show real-time statistics</guilabel> check boxes.
de: Die Anzeige des Statistik- und Tastaturbereichs während der Übungen können Sie mit den Ankreuzfeldern <guilabel>Tastatur anzeigen</guilabel> und <guilabel>Aktuelle Statistik anzeigen</guilabel> ein- und ausschalten.

source: The keystroke to go to the next line of training text can be chosen from two options, <keycap>Return</keycap> or <keycap>Space</keycap>.
de: Als Taste für das Wechseln zur nächsten Zeile im Übungstext kann zwischen der Taste <keycap>Eingabe</keycap> und der <keycap>Leertaste</keycap> gewählt werden.

source: The <guilabel>Lesson unlocking limits</guilabel> can be used to choose settings that control unlocking of higher level lessons. &i18n-ktouch; checks the given limits at the end of each level and decides whether to unlock the next lesson. If the typing speed in characters per minute and correctness are <emphasis>both</emphasis> above or equal to the <guilabel>Lesson unlocking limits</guilabel> &i18n-ktouch; will unlock the next higher level lesson.
de: Mit den Einstellungen im Bereich <guilabel>Grenzwerte zur Freigabe einer Lektion</guilabel> wird das Entsperren der folgenden schwierigeren Lektionen kontrolliert. &i18n-ktouch; überprüft die angegebenen Grenzwerte am Ende jeder Lektion und entscheidet dann über die Freigabe der nächsten Lektion. Liegen die Anschläge pro Minute und die Trefferquote <emphasis>beide</emphasis> über oder gleich dem Grenzwert, wird die nächste schwierigere Lektion freigegeben.

source: Color Settings
de: Farbeinstellungen

source: In this dialog you can tweak the colors used by &i18n-ktouch;.
de: Auf dieser Seite des Dialog können Sie die Farben für &i18n-ktouch; einstellen

source: <screeninfo>Color settings</screeninfo>
de: <screeninfo>Farbeinstellungen</screeninfo>

source: <phrase>Color settings</phrase>
de: <phrase>Farbeinstellungen</phrase>

source: You can select the background color for each finger keys.
de: Die Farbe für den Hintergrund der Tasten kann für jeden Finger eingestellt werden.

source: Course and lesson selection
de: Auswahl von Kursen und Lektionen

source: &i18n-ktouch; automatically detects your keyboard layout and shows only the courses optimized for this layout.
de: &i18n-ktouch; erkennt automatisch Ihre Tastaturbelegung und zeigt nur die für diese Belegung optimierten Kurse an.

source: On some platforms, especially &Windows;, keyboard layout auto-detection is not available. Use the application menu to select your keyboard layout manually.
de: Auf einigen Plattformen wie insbesondere unter &Windows; funktioniert die automatische Erkennung der Tastaturbelegung nicht. Benutzen Sie in diesem Fall das Anwendungsmenü, um manuell eine Tastaturbelegung einzustellen.

source: Switching courses
de: Kurse wechseln

source: Should there are more than one course available for your keyboard layout you can choose your favorite one using <inlinemediaobject> <imageobject> <imagedata fileref="Icon-arrow-left.png" format="PNG"/> </imageobject> </inlinemediaobject> and <inlinemediaobject> <imageobject> <imagedata fileref="Icon-arrow-right.png" format="PNG"/> </imageobject> </inlinemediaobject> buttons to the right of the label with course name. If there is only one course the buttons won't be visible.
de: Gibt es mehr als einen Kurs für Ihre Tastaturbelegung, können Sie mit den Symbolen <inlinemediaobject> <imageobject> <imagedata fileref="Icon-arrow-left.png" format="PNG"/> </imageobject> </inlinemediaobject> und <inlinemediaobject> <imageobject> <imagedata fileref="Icon-arrow-right.png" format="PNG"/> </imageobject> </inlinemediaobject> an der rechten Seite der Zeile mit dem Kursnahmen eine passende Übung auswählen. Gibt es nur einen Kurs, wird dieses Symbol nicht angezeigt.

source: Unlocking lessons
de: Lektionen entsperren

source: If you have chosen <guilabel>I have no or only very little experience in machine typing</guilabel> during <link linkend="creating_profile">initial profile creation</link> you will find that some lessons are locked. These items are marked with <inlinemediaobject> <imageobject> <imagedata fileref="Icon-object-locked.png" format="PNG"/> </imageobject> </inlinemediaobject> icon and cannot be accessed until you pass the previous lessons.
de: Haben Sie <guilabel>Ich habe keine oder wenig Erfahrung mit Schreibmaschinenschreiben</guilabel> am Anfang von <link linkend="creating_profile">Erstellen des Profils</link> gewählt, sehen Sie , dass einige Lektionen gesperrt sind. Diese Lektion sind mit dem Symbol <inlinemediaobject> <imageobject> <imagedata fileref="Icon-object-locked.png" format="PNG"/> </imageobject> </inlinemediaobject> markiert und können erst geöffnet werden, wenn Sie die vorherigen Lektionen erfolgreich geübt haben.

source: The settings to pass lessons can be changed using <link linkend="configuration_dialog">&i18n-ktouch; configuration dialog</link>.
de: Die Einstellungen für den Wechsel zur nächsten Lektion können im Einrichtungsdialog von <link linkend="configuration_dialog">&i18n-ktouch;</link> geändert werden.

source: Training on a different keyboard layout
de: Übungen auf unterschiedlichen Tastaturbelegungen

source: With &i18n-ktouch; it is possible to use any keyboard layout for training. Just press the buttons that are highlighted by the trainer, regardless to the labels on your physical keyboard.
de: In &i18n-ktouch; können Sie jede beliebige Tastaturbelegung für die Übungen benutzen. Drücken Sie dazu auf die Tasten, die in der Übung hervorgehoben sind, unabhängig von der Beschriftung der tatsächlichen Tastatur.

source: Select <menuchoice><guimenu>Configure Keyboard...</guimenu></menuchoice> in the application menu to select a different keyboard layout. After that &i18n-ktouch; will adapt accordingly and present you its courses for this layout.
de: Wählen Sie <menuchoice><guimenu>Tastatur einrichten ...</guimenu></menuchoice> im Anwendungsmenü und stellen Sie eine andere Tastaturbelegung ein. Dann wird &i18n-ktouch; entsprechend angepasst und nur die Kurse für diese Tastaturbelegung angezeigt.

source: On platforms without keyboard layout auto-detection, especially &Microsoft; &Windows;, you have first configure your operating system to use the layout you want to train on and then select the same layout in &i18n-ktouch; via the application menu.
de: Auf einigen Plattformen ohne automatische Erkennung der Tastaturbelegung wie insbesondere unter &Microsoft; &Windows; müssen Sie zuerst Ihr Betriebssystem auf die Tastaturbelegung einstellen, mit der Sie üben möchten. Dann muss in &i18n-ktouch; die gleiche Tastaturbelegung im Anwendungsmenü gewählt werden.

source: Efficient training
de: Effizientes Üben

source: Training techniques
de: Übungstechniken

source: Hereafter, you can find some general advice about techniques for learning touch typing.
de: Hier finden Sie einige allgemeine Empfehlungen zu Methoden zum Erlernen des Maschineschreibens.

source: Steady speed
de: Gleichbleibende Geschwindigkeit

source: To be efficient when learning touch typing it is important not to simply try to type as fast as possible but to keep a steady speed and find a natural rhythm to press the keys.
de: Für das effiziente Lernen des Maschineschreibens ist es wichtig, nicht einfach nur so schnell wie möglich zu tippen, sondern eine gleichmäßige Geschwindigkeit beizubehalten und einen natürlichen Rhythmus für das Drücken der Tasten zu finden.

source: Accuracy is a king
de: Genauigkeit ist wichtig

source: The next important thing is to focus one's attention on accuracy. Only if you mastered the use of the currently unlocked keys, which means you make only very few errors with them still, you will have chance in the following lessons with even more keys to handle. You will notice you become almost automatically master if you make only very little errors and you will save precious time if you don't have to correct that many errors.
de: Als nächstes sollten Sie die Trefferquote beachten. Nur wenn Sie die bisher freigegeben Tasten erfolgreich benutzen und wenige Fehler dabei machen, können Sie die nächste Lektion mit noch mehr Tasten mit Erfolg üben. Sie werden beim Üben feststellen, dass Sie automatisch erfolgreich sind, wenn Sie nur sehr wenige Fehler machen und daher keine kostbare Zeit mit der Verbesserung dieser wenigen Fehler verlieren.

source: That is also the reason why the default accuracy level to unlock the next lesson is at 98% while the speed requirements are pretty moderate with just 180 characters per minute.
de: Das ist auch der Grund, dass zum Freigeben der nächsten Lektion für die Trefferquote ein Wert von 98 % eingestellt ist, während die Anforderung an die Geschwindigkeit mit 180 Zeichen pro Minute sehr moderat sind.

source: Correcting mistakes
de: Fehler korrigieren

source: If you made mistakes it's important to correct them efficiently. Correcting single characters is almost always slower than correcting the whole word. For the latter you have just to press <keycombo>&Ctrl;&Backspace;</keycombo>, and retype the word. The mental overhead for this is very small. For the first you have to first locate the your mistake, delete precisely to the location of the error, determine the missing part of the word re-type it. This requires way more concentration when retyping the whole word.
de: Machen Sie Fehler, dann ist es wichtig, sie effektiv zu verbessern. Die Korrektur einzelner Zeichen ist fast immer langsamer als die Korrektur eines ganzen Worts. Daher sollten Sie die Tasten <keycombo>&Ctrl;&Backspace;</keycombo> drücken und das Wort neu eintippen. Der zusätzliche Aufwand dafür ist sehr gering. Beim Korrigieren einzelner Zeichen müssen sie diese Fehler zuerst ansteuern und dann genau löschen und den fehlenden Teil des Worts dann neu tippen. Dies erfordert viel mehr Konzentration als die erneute Eingabe des ganzen Worts.

source: Pausing the training session
de: Anhalten einer Übungssitzung

source: Automatically
de: Automatisch

source: If you open any dialog or switch to different application while you are in a training session the training is paused and the timer is stopped until you focus &i18n-ktouch; window again and hit any key.
de: Wenn Sie in einer Übung einen beliebigen Dialog öffnen oder zu einer anderen Anwendung wechseln, wird die Übung angehalten und auch die Zeitmessung, bis das Fenster von &i18n-ktouch; wieder aktiviert und eine Taste gedrückt wird.

source: The training session will also be paused if there will be no activity by the user for five seconds.
de: Eine Übungssitzung wird auch dann angehalten, wenn der Benutzer fünf Sekunden keine Tasten mehr drückt.

source: Manually
de: Manuell

source: You can pause the current session manually using <inlinemediaobject> <imageobject> <imagedata fileref="Icon-media-playback-pause.png" format="PNG"/> </imageobject> </inlinemediaobject> button in the toolbar.
de: Mit dem Knopf <inlinemediaobject> <imageobject> <imagedata fileref="Icon-media-playback-pause.png" format="PNG"/> </imageobject> </inlinemediaobject> in der Werkzeugleiste können Sie eine Übungssitzung manuell anhalten.

source: If you click on <inlinemediaobject> <imageobject> <imagedata fileref="Icon-go-home.png" format="PNG"/> </imageobject> </inlinemediaobject> button in the toolbar &i18n-ktouch; will pause the current session and show an overlay menu with some further actions.
de: Wenn Sie auf den Knopf <inlinemediaobject> <imageobject> <imagedata fileref="Icon-go-home.png" format="PNG"/> </imageobject> </inlinemediaobject> in der Werkzeugleiste von &i18n-ktouch; drücken, wird die aktuelle Sitzung angehalten und ein transparentes Menü mit weiteren Aktionen angezeigt.

source: <screeninfo>&i18n-ktouch; menu on pausing</screeninfo>
de: <screeninfo>&i18n-ktouch;-Menü beim Anhalten</screeninfo>

source: <phrase>&i18n-ktouch; menu on pausing</phrase>
de: <phrase>&i18n-ktouch;-Menü beim Anhalten</phrase>

source: Tracking the learning progress
de: Übungsfortschritte verfolgen

source: After completing a lesson, you will not return immediately to the home screen. Instead a special summary and statistics screen is shown.
de: Haben Sie eine Lektion abgeschlossen, wird nicht sofort der Startbildschirm wieder angezeigt, sondern ein allgemeiner Überblick und Statistik der Lektion.

source: Speed and accuracy statistics
de: Statistiken für Geschwindigkeit und Trefferquote

source: <screeninfo>Score screen progress page</screeninfo>
de: <screeninfo>Bewertung des Lernfortschritts</screeninfo>

source: <phrase>Score screen progress page</phrase>
de: <phrase>Bewertung des Lernfortschritts</phrase>

source: Filter per lesson
de: Lektionen filtern

source: With the help of the speed and accuracy statistics page you can review your learning progress and identify your weaknesses.
de: Mit der Statistikseite über die Anschlaggeschwindigkeit und Trefferquote können Sie Ihren Lernprozess überprüfen und Ihre Schwächen erkennen.

source: The statistics data can be filtered by lesson using drop down box next to the <guilabel>Over</guilabel> label. This feature can be useful to control you progress in the current lesson and compare this progress with the progress in other lessons.
de: Die statistischen Daten können mit dem Auswahlfeld neben <guilabel>Über</guilabel> nach Lektionen gefiltert werden. Mit dieser Funktion lässt sich der Lernfortschritt in der aktuellen Lektion überprüfen und mit dem Fortschritt in anderen Lektionen vergleichen.

source: <screeninfo>Statistics range drop down menu</screeninfo>
de: <screeninfo>Auswahlfeld für Statistikbereiche</screeninfo>

source: <phrase>Statistics range drop down menu</phrase>
de: <phrase>Auswahlfeld für Statistikbereiche</phrase>

source: Additional data about the session can be viewed in overlays. If you hover the mouse cursor on a point on the graph &i18n-ktouch; will show the statistics of the corresponding session.
de: Zusätzliche Daten über die Sitzung können in Texteinblendungen angezeigt werden. Wenn Sie den Mauszeiger auf einen Punkt der Grafik führen, wird die Statistik der zugehörigen Lektion angezeigt.

source: <screeninfo>Progress per lesson</screeninfo>
de: <screeninfo>Fortschritt in einer Lektion</screeninfo>

source: <phrase>Progress per lesson</phrase>
de: <phrase>Fortschritt in einer Lektion</phrase>

source: Errors statistics
de: Fehlerstatistiken

source: The score screen can be switched to show errors rate for each key using drop down menu next to the <guilabel>Show</guilabel> label.
de: Die Bewertung kann im Auswahlfeld neben der Beschriftung <guilabel>Anzeige</guilabel> geändert werden, so dass die Fehlerquote jeder Taste zu sehen ist.

source: <screeninfo>Switching the statistics mode</screeninfo>
de: <screeninfo>Statistikmodus wechseln</screeninfo>

source: <phrase>Switching the statistics mode</phrase>
de: <phrase>Statistikmodus wechseln</phrase>

source: In this mode, &i18n-ktouch; shows a bar diagram of errors for each key in the last training session.
de: in diesem Modus zeigt &i18n-ktouch; ein Balkendiagramm der Fehler für jede Taste in der letzten Übungssitzung.

source: <screeninfo>Errors chart by the keys</screeninfo>
de: <screeninfo>Fehlerdiagramm der Tasten</screeninfo>

source: <phrase>Errors chart by the keys</phrase>
de: <phrase>Fehlerdiagramm der Tasten</phrase>

source: You can switch back to the lessons graph using the same drop down menu next to the <guilabel>Show</guilabel> label.
de: Zurück zur Grafik für die Lektion wechseln Sie mit dem gleichen Auswahlfeld neben der Beschriftung <guilabel>Anzeige</guilabel>.

source: If you have passed the lesson you may choose to start training on the next lesson right away by pressing <guibutton>Next lesson</guibutton> in the toolbar. Otherwise you can repeat the current lesson with <guibutton>Repeat lesson</guibutton> or return to the home screen with the remaining button.
de: Haben Sie eine Lektion erfolgreich abgeschlossen, können Sie mit dem Knopf <guibutton>Nächste Lektion</guibutton> in der Werkzeugleiste sofort mit dem Üben der nächsten Lektion weitermachen. Andererseits können Sie die aktuelle Lektion mit dem Knopf <guibutton>Lektion wiederholen</guibutton> nach einmal üben oder mit dem dritten Knopf zum Startbildschirm zurückgehen.

source: Extending &i18n-ktouch;
de: &i18n-ktouch; erweitern

source: Creating courses
de: Kurse erstellen

source: You can easily create your own training course using the built-in &i18n-ktouch; course and keyboard layout editor. Press <inlinemediaobject> <imageobject> <imagedata fileref="Icon-configure.png" format="PNG"/> </imageobject> </inlinemediaobject> button at the right of the home screen toolbar then choose <guimenuitem>Course and Keyboard Layout Editor...</guimenuitem>. You can choose open a course file or create an empty course from scratch or using an existing course as a template.
de: Sie können Ihre eigenen Übungskurse mit dem in &i18n-ktouch; eingebauten Editor erstellen. Drücken Sie den Knopf <inlinemediaobject> <imageobject> <imagedata fileref="Icon-configure.png" format="PNG"/> </imageobject> </inlinemediaobject> rechts in der Werkzeugleiste des Startbildschirms und wählen dann <guilabel>Kurs- und Tastaturbelegungseditor</guilabel>. Sie können entweder eine vorhanden Kurs öffnen, mit einem leeren Kurs von Grund auf neu beginnen oder einen vorhandenen Kurs als Vorlage verwenden.

source: You cannot edit the built-in courses, even if you have the write access to the installation directory.
de: Eingebaute Kurse können nicht verändert werden, auch wenn Sie Schreibzugriff auf den Installationsordner haben.

source: <screeninfo>Course and Keyboard Layout Editor main window</screeninfo>
de: <screeninfo>Hauptfenster des Kurs- und Tastaturbelegungseditors</screeninfo>

source: <phrase>Course and Keyboard Layout Editor main window</phrase>
de: <phrase>Hauptfenster des Kurs- und Tastaturbelegungseditors</phrase>

source: Course properties
de: Kurseigenschaften

source: The course properties can be chosen using &i18n-ktouch; course creation wizard. To invoke this wizard you should press <inlinemediaobject> <imageobject> <imagedata fileref="Icon-document-new.png" format="PNG"/> </imageobject> </inlinemediaobject> button in the toolbar of <guilabel>Course and Keyboard Layout Editor</guilabel> window.
de: Die Eigenschaften eines Kurses können im &i18n-ktouch;-Assistenten für das Erstellen von Kursen ausgewählt werden. Um diesen Assistenten zu starten, drücken Sie den Knopf <inlinemediaobject> <imageobject> <imagedata fileref="Icon-document-new.png" format="PNG"/> </imageobject> </inlinemediaobject> in der Werkzeugleiste des Fensters <guilabel>Kurs- und Tastaturbelegungseditor</guilabel>.

source: The first page of creation &i18n-ktouch; wizard allows you to choose the type of the data. Select <guilabel>Course</guilabel> and press <guibutton>Next</guibutton>.
de: Auf der ersten Seite des Assistenten können Sie die Art der Daten eingeben. Wählen Sie <guilabel>Kurs</guilabel> und drücken Sie auf <guibutton>Weiter</guibutton>.

source: <screeninfo>Choosing the type</screeninfo>
de: <screeninfo>Auswahl des Typs</screeninfo>

source: <phrase>Choosing the type</phrase>
de: <phrase>Auswahl des Typs</phrase>

source: The second page of wizard allows you to choose the title, the keyboard layout and the description of the course.
de: Auf der zweiten Seite des Assistenten geben Sie den Titel, die Tastaturbelegung und die Beschreibung des Kurses ein.

source: <screeninfo>New course wizard second page</screeninfo>
de: <screeninfo>Zweite Seite des Assistenten für neue Kurse</screeninfo>

source: <phrase>New course wizard second page</phrase>
de: <phrase>Zweite Seite des Assistenten für neue Kurse</phrase>

source: The course title is important for the quick-select menu entry in the course list and for the statistics.
de: Der Kurstitel wird als Eintrag im Auswahlmenü der Kursliste und für die Statistiken verwendet.

source: The description should be used to include information about the lesson author and source of lesson data if any. This description can be shown by pressing <inlinemediaobject> <imageobject> <imagedata fileref="Icon-dialog-information.png" format="PNG"/> </imageobject> </inlinemediaobject> button in the home screen of &i18n-ktouch;.
de: In der Beschreibung sollten Informationen über den Autor und die Quelle der Lektionsdaten eingefügt werden. Diese Beschreibung kann mit dem Knopf <inlinemediaobject> <imageobject> <imagedata fileref="Icon-dialog-information.png" format="PNG"/> </imageobject> </inlinemediaobject> im Startbildschirm von &i18n-ktouch; angezeigt werden.

source: When you finished with entering appropriate values press <guibutton>Next</guibutton>.
de: Haben Sie alle erforderlichen Werte eingeben, drücken Sie auf <guibutton>Weiter</guibutton>.

source: <screeninfo>New course wizard third page</screeninfo>
de: <screeninfo>Dritte Seite des Assistenten für neue Kurse</screeninfo>

source: <phrase>New course wizard third page</phrase>
de: <phrase>Dritte Seite des Assistenten für neue Kurse</phrase>

source: Using the third page of wizard you can choose an other course as a template for your course. Select the course from the list and press <guibutton>Finish</guibutton>.
de: Auf der dritten Seite des Assistenten können Sie einen anderen Kurs als Vorlage verwenden. Wählen Sie einen Kurs aus der Liste und drücke Sie auf <guibutton>Fertigstellen</guibutton>.

source: <screeninfo>New course editing window</screeninfo>
de: <screeninfo>Editorfenster für neue Kurse</screeninfo>

source: <phrase>New course editing window</phrase>
de: <phrase>Editorfenster für neue Kurse</phrase>

source: &i18n-ktouch; will open the course editor window prepared to entering your course data.
de: &i18n-ktouch; öffnet das Editorfenster für Kurse, jetzt können Sie die Daten für den Kurs eingeben.

source: Adding lessons
de: Lektionen hinzufügen
