Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdeedu/kturtle.po
Languages: de

source: The &kturtle; Handbook
de: Das Handbuch zu &kturtle;

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Burkhard</firstname><surname>Lück</surname><affiliation><address><email>lueck@hube-lueck.de</email></address></affiliation><contrib>Übersetzung</contrib></othercredit>

source: &kturtle; is an educational programming environment that aims to make learning how to program as easy as possible. To achieve this &kturtle; makes all programming tools available from the user interface. The programming language used is &turtlescript; which allows its commands to be translated.
de: &kturtle; ist eine Programmierumgebung mit dem Ziel, das Programmieren möglichst einfach zu lernen. Um das zu erreichen, sind in &kturtle; alle Programmwerkzeuge in der graphischen Benutzeroberfläche zu erreichen. Als Programmiersprache wird &turtlescript; verwendet, in dieser Sprache können die Befehle übersetzt werden.

source: education
de: Bildung

source: language
de: Sprache

source: native
de: muttersprachlich

source: programming
de: Programmierung

source: turtle
de: Schildkröte

source: Introduction
de: Einleitung

source: &kturtle; is an educational programming environment that uses <link linkend="what-is-turtlelang">&turtlescript;</link>, a programming language loosely based on and inspired by &logo;. The goal of &kturtle; is to make programming as easy and accessible as possible. This makes &kturtle; suitable for teaching kids the basics of math, geometry and... programming. One of the main features of &turtlescript; is the ability to translate the commands into the speaking language of the programmer.
de: &kturtle; ist eine Programmierumgebung für den Unterricht mit <link linkend="what-is-turtlelang">&turtlescript;</link>, einer Programmiersprache auf der Grundlage von &logo;. Das Ziel ist von &kturtle; ist es, die Programmierung möglichst einfach und leicht zugänglich zu machen. Daher ist &kturtle; besonders geeignet, um Kindern die Grundlagen vom Mathematik, Geometrie und Programmierung zu lehren. Die wichtigste Eigenschaft von &turtlescript; ist die Möglichkeit, die Befehle in die Muttersprache des Programmierers zu übersetzen.

source: &kturtle; is named after <quote>the turtle</quote> that plays a central role in the programming environment. The student will usually instruct the turtle, using the &turtlescript; commands, to make a drawing on <link linkend="the-canvas">the canvas</link>.
de: &kturtle; ist nach der <quote>Schildkröte</quote> benannt, die in der Programmierumgebung die Hauptrolle spielt. Der Benutzer programmiert die Schildkröte mit den &turtlescript;-Befehlen, um eine Zeichnung auf der <link linkend="the-canvas">Zeichenfläche</link> zu erstellen.

source: What is &turtlescript;?
de: Was ist &turtlescript;?

source: &turtlescript;, the programming language used in &kturtle;, is inspired by the &logo; family of programming languages. The first version of &logo; was created by Seymour Papert of MIT Artificial Intelligence Laboratory in 1967 as an offshoot of the LISP programming language. From then many versions of &logo; have been released. By 1980 &logo; was gaining momentum, with versions for MSX, Commodore, Atari, Apple II and IBM PC systems. These versions were mainly for educational purposes. The MIT is still maintains <ulink url="http://el.media.mit.edu/logo-foundation/">a website on &logo;</ulink> containing a list of several popular implementation of the language.
de: &turtlescript;, die in &kturtle; benutzte Programmiersprache, ist Konzepten der Programmiersprache &logo; beeinflusst. Die erste Version von &logo; wurde 1967 von Seymour Papert am MIT Artificial Intelligence Laboratory aus der Programmiersprache Lisp entwickelt. Seit dieser Zeit sind viele Versionen von &logo; veröffentlicht worden. Im Jahr 1980 wurde &logo; bekannt durch Versionen für MSX, Commodore, Atari, Apple II und den IBM PC Computer. Diese Versionen waren für den Unterricht gedacht. Am MIT finden Sie immer noch eine Webseite für &logo; unter <ulink url="http://el.media.mit.edu/logo-foundation/">http://el.media.mit.edu/logo-foundation/</ulink> mit einer Liste von mehreren populären Implementationen dieser Sprache.

source: &turtlescript; shares a feature found in many other implementations of &logo;: the ability to translate the commands to suit the native language of the student. This feature makes it easier for students that have no or little understanding of English to get started. Besides this feature &kturtle; has <link linkend="features-of-kturtle">many other features</link> aimed at easing the students initial experience with programming.
de: &turtlescript; hat wie viele Implementierungen der Sprache &logo; eine besondere Eigenschaft: Die Möglichkeit, die Befehle in die Muttersprache der Benutzer zu übersetzen. Diese Eigenschaft erleichtert Benutzern mit geringen oder keinen Englischkenntnissen den Einstieg. Außerdem hat &kturtle; <link linkend="features-of-kturtle">viele weitere Eigenschaften</link>, die das Lernen des Programmierens für die Benutzer erleichtern.

source: Features of &kturtle;
de: Eigenschaften von &kturtle;

source: &kturtle; has some nice features that make starting to program a breeze. See here some of the highlights of &kturtle; feature set:
de: &kturtle; hat einige besondere Eigenschaften, die den Einstieg in die Programmierung sehr einfach machen, hervorzuheben sind:

source: An integrated environment with &turtlescript; interpreter, <link linkend="the-editor">editor</link>, <link linkend="the-canvas">canvas</link> and other tools all in one application (no extra dependencies).
de: Eine integrierte Entwicklungsumgebung mit dem &turtlescript;-Interpreter, einem <link linkend="the-editor">Editor</link>, der <link linkend="the-canvas">Zeichenfläche</link> und weiteren Werkzeugen in einem Programm vereint, ohne zusätzliche Abhängigkeiten.

source: The ability to translate the &turtlescript; commands using the translation framework of &kde;.
de: Die Möglichkeit, die Befehle der Sprache &turtlescript; mit den üblichen Verfahren in &kde; zu übersetzen.

source: &turtlescript; supports user defined functions, recursion and dynamic type switching.
de: &turtlescript; unterstützt benutzerdefinierte Funktionen, Rekursion und dynamische Typzuweisung.

source: The execution can be slowed down, paused or stopped at any time.
de: Die Befehle können Sie jederzeit langsamer ausführen lassen, anhalten oder abbrechen.

source: A powerful <link linkend="the-editor">editor</link> featuring intuitive syntax highlighting, line numbering, error markers, visual execution and more.
de: Ein leistungsfähiger <link linkend="the-editor">Editor</link> mit intuitiver Syntaxhervorhebung, Zeilennummerierung, Fehlermarkierung, visueller Kontrolle der Ausführung und mehr.

source: The <link linkend="the-canvas">canvas</link>, where the turtle draws, can be printed or saved either as an image (PNG) or a drawing (SVG).
de: Die <link linkend="the-canvas">Zeichenfläche</link>, auf der die Schildkröte zeichnet, kann entweder als Rasterbild (PNG) oder als Vektorzeichnung (SVG) gedruckt und gespeichert werden.

source: Context help: help where you need it. Just press <keysym>F2</keysym> (or see <menuchoice><guimenu>Help</guimenu><guimenuitem>Help on: ...</guimenuitem></menuchoice>) to get help on the piece of code currently under your cursor.
de: Kontexthilfe: Drücken Sie <keysym>F2</keysym> oder benutzen Sie <menuchoice><guimenu>Hilfe</guimenu><guimenuitem>Hilfe zu: ...</guimenuitem></menuchoice>, um zu dem aktuellen Quelltext unter dem Cursor eine passende Erläuterung zu erhalten.

source: An error dialog that links the error messages to the mistakes in the program and marks them red.
de: Ein Fehlerdialog, der auf die Fehler im Programm verweist und sie rot markiert.

source: Simplified programming terminology.
de: Einfache Programmiersprache.

source: Integrated example programs to make it easy to get started. These examples are translated using &kde; translation framework.
de: Integrierte Beispielprogramme, die den Einstieg erleichtern. Diese Beispiele werden mit dem üblichen Verfahren in &kde; übersetzt.

source: Credits and License
de: Danksagungen und Lizenz

source: Software copyright 2003-2007 Cies Breijs <email>cies AT kde DOT nl</email>
de: Programm Copyright 2003-2007 Cies Breijs <email>cies AT kde DOT nl</email>

source: Documentation copyright 2004, 2007, 2009
de: Copyright der Dokumentation 2004, 2007, 2009

source: Some proofreading changes by &Philip.Rodrigues; &Philip.Rodrigues.mail;
de: Korrektur gelesen von &Philip.Rodrigues; &Philip.Rodrigues.mail;

source: Updated translation how-to and some proofreading changes by Andrew Coles <email>andrew_coles AT yahoo DOT co DOT uk</email>
de: Überarbeitung der Übersetzerdokumentation und Korrekturen von Andrew Coles <email>andrew_coles AT yahoo DOT co DOT uk</email>

source: CREDIT_FOR_TRANSLATORS
de: <para>Deutsche Übersetzung Burkhard Lück <email>lueck@hube-lueck.de</email></para>

source: How to obtain &kturtle;
de: Wie Sie &kturtle; erhalten

source: Compilation and Installation
de: Kompilierung und Installation

source: Command Index
de: Index der &turtlescript;-Befehle
