Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdeedu/kturtle_using-kturtle.po
Languages: de

source: Using &kturtle;
de: Arbeiten mit &kturtle;

source: Here is a screenshot of &kturtle; in action
de: Dies ist ein Bildschirmfoto von &kturtle; in Aktion

source: &kturtle; Main Window
de: Das Hauptfenster von &kturtle;

source: The main window of &kturtle; has three main parts: <link linkend="the-editor">the editor</link> (1) on the left where you type the &turtlescript; commands, the <link linkend="the-canvas">the canvas</link> (2) on the right where the turtle make your drawing, and the <link linkend="the-inspector">inspector</link> (3) which gives you information when your program executes. Besides these you find <link linkend="the-menubar">the menu bar</link> (5) from where all the actions can be reached, <link linkend="the-toolbar">the toolbar</link> (4) that allows you to quickly select the most used actions, the <guilabel>Console</guilabel>, that you can use to enter a one line command to test it, and <link linkend="the-statusbar">the statusbar</link> (along the bottom of the window) where you will find feedback on the state of &kturtle;.
de: Das Hauptfenster von &kturtle; besteht aus drei Teilen: dem <link linkend="the-editor">Editor</link> (1) auf der linken Seite, wo Sie die &turtlescript;-Befehle eingeben, der <link linkend="the-canvas">Zeichenfläche</link> (2) in der Mitte, auf der die Schildkröte zeichnet, und dem <link linkend="the-inspector">Kontrollfenster</link> (3) mit Informationen über die Variablen während der Programmausführung. Außerdem gibt es die <link linkend="the-menubar">Menüleiste</link> (5), in der Sie alle Befehle erreichen können, die <link linkend="the-toolbar">Werkzeugleiste</link> (4) für den direkten Zugriff auf häufig gebrauchte Befehle, die Konsole, in der Sie einen einzelnen Befehl eingeben und testen können und die <link linkend="the-statusbar">Statusleiste</link>, wo Sie den Zustand von &kturtle; sehen können.

source: The Editor
de: Der Editor

source: In the editor you type the &turtlescript; commands. Most of functions of the editor can be found in the <link linkend="the-file-menu">File</link> and <link linkend="the-edit-menu">Edit</link> menus. The editor can be docked on each border of the main window or it can be detached and placed anywhere on your desktop.
de: Im Editor geben Sie die &turtlescript;-Befehle ein. Die meisten Funktionen finden Sie in den Menüeinträgen <link linkend="the-edit-menu">Bearbeiten</link>. Der Editor kann auf jeder Seite des Hauptfensters oder losgelöst vom Hauptfenster irgendwo auf Ihrer Arbeitsfläche angeordnet werden.

source: You have several ways to get some code in the editor. The easiest way is to use an example: choose <menuchoice><guimenu>File</guimenu><guisubmenu>Examples</guisubmenu></menuchoice> in the <link linkend="the-file-menu">File menu</link> and select an example. The file example you choose will be opened in the <link linkend="the-editor">the editor</link>, you can then use <menuchoice><guimenu>Run</guimenu><guimenuitem>Run</guimenuitem></menuchoice> from the menubar or the <guibutton>Run</guibutton> from the toolbar to run the code if you like.
de: Es gibt mehrere Möglichkeiten, Quelltext im Editor zu erstellen. Am einfachsten ist es, ein Beispiel zu laden: Wählen Sie mit <menuchoice><guimenu>Datei</guimenu><guisubmenu>Beispiele</guisubmenu></menuchoice> im <link linkend="the-file-menu">Menü Datei</link> ein Beispiel aus. Die ausgewählte Datei wird im <link linkend="the-editor">Editor</link> geöffnet, dann können Sie mit <menuchoice><guimenu>Ausführen</guimenu><guimenuitem>Ausführen</guimenuitem></menuchoice> in der Menüleiste oder <guibutton>Ausführen</guibutton> in der Werkzeugleiste das Programm starten.

source: You can open &turtlescript; files by choosing <menuchoice><guimenu>File</guimenu><guimenuitem>Open...</guimenuitem></menuchoice>.
de: Sie können &turtlescript;-Dateien mit <menuchoice><guimenu>Datei</guimenu><guimenuitem>Öffnen ...</guimenuitem> </menuchoice> einfügen.

source: The third way is to directly type your own code in the editor or to copy/paste some code.
de: Als dritte Möglichkeit können Sie den eigenen Quelltext direkt im Editor eingeben oder &ie; aus diesem Handbuch kopieren und einfügen.

source: The Canvas
de: Die Zeichenfläche

source: The canvas is the domain of the turtle, here the turtle draws according to the commands it gets. After getting some code in the <link linkend="the-editor">Editor</link> and executing it, two things can happen: either the code executes fine, and will you most likely see something change on the canvas; or you have made an error in your code in that case the error tab will appear explaining you what mistake you made.
de: Die Zeichenfläche ist der Bereich, wo die Schildkröte die Ausgaben der Befehle zeichnet. Nach der Eingabe des Quelltextes im <link linkend="the-editor">Editor</link> und der Ausführung kann folgendes passieren: Entweder der Quelltext wird fehlerfrei ausgeführt und Sie sehen dann Änderungen auf der Zeichenfläche oder Sie haben einen Fehler im Quelltext und es erscheint ein Fenster, das Ihnen die Art des Fehlers meldet.

source: You can zoom in and out the canvas with your mouse wheel.
de: Mit dem Mausrad können Sie die den Ausschnitt der Zeichenfläche vergrößern oder verkleinern.

source: The Inspector
de: Das Kontrollfenster

source: The inspector informs you about the variables, the learned functions and show the code tree while the program is running.
de: Im Kontrollfenster finden Sie während der Programmausführung Informationen über die Variablen, die gelernten Funktionen und den Quelltextbaum.

source: The inspector can be docked on each border of the main window or it can be detached and placed anywhere on your desktop.
de: Das Kontrollfenster können Sie an jeder Seite des Hauptfenster oder freischwebend auf Ihrem Bildschirm anordnen.

source: The Toolbar
de: Die Werkzeugleiste

source: Here you can quickly reach the most used actions. The Toolbar also contains the <guilabel>Console</guilabel> where you can quickly invoke commands, this might be useful in case you want to test a command without modifying the content of the <link linkend="the-editor">Editor</link>.
de: Hier können Sie schnell die am häufigsten gebrauchten Aktionen erreichen. Die Werkzeugleiste enthält außerdem die das Feld <guilabel>Konsole</guilabel>, mit dem Sie schnell Befehle zum Testen ausführen können, ohne den Text im <link linkend="the-editor">Editor</link> zu verändern.

source: You can configure the toolbar using <menuchoice><guimenu>Settings</guimenu><guimenuitem>Configure Toolbars...</guimenuitem></menuchoice> to better fit your preferences.
de: Die Werkzeugleiste können Sie mit <menuchoice><guimenu>Einstellungen</guimenu><guimenuitem>Werkzeugleisten einrichten ...</guimenuitem></menuchoice> an Ihre Bedürfnisse anpassen.

source: The Menubar
de: Die Menüleiste

source: In the menubar you find all the actions of &kturtle;. They are in the following groups: <guimenu>File</guimenu>, <guimenu>Edit</guimenu>, <guimenu>Canvas</guimenu>, <guimenu>Run</guimenu>, <guimenu>Tools</guimenu>, <guimenu>Settings</guimenu>, and <guimenu>Help</guimenu>. This section describes them all.
de: In der Menüleiste finden Sie alle Befehle für &kturtle; in folgenden Gruppen: <guimenu>Datei</guimenu>, <guimenu>Bearbeiten</guimenu>, <guimenu>Zeichenfläche</guimenu>, <guimenu>Ausführen</guimenu>, <guimenu>Extras</guimenu>, <guimenu>Einstellungen</guimenu> und <guimenu>Hilfe</guimenu>. Dieser Abschnitt beschreibt alle Menüeinträge.

source: The <guimenu>File</guimenu> Menu
de: Das Menü <guimenu>Datei</guimenu>

source: <shortcut> <keycombo>&Ctrl;<keycap>N</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>New</guimenuitem>
de: <shortcut> <keycombo>&Ctrl;<keycap>N</keycap></keycombo> </shortcut> <guimenu>Datei</guimenu> <guimenuitem>Neu</guimenuitem>

source: Creates a new, empty &turtlescript; file.
de: Erstellt eine neue leere &turtlescript;-Datei.

source: <shortcut> <keycombo>&Ctrl;<keycap>O</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Open...</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>O</keycap></keycombo></shortcut><guimenu>Datei</guimenu><guimenuitem>Öffnen ...</guimenuitem>

source: Opens a &turtlescript; file.
de: Öffnet eine &turtlescript;-Datei.

source: <guimenu>File</guimenu> <guisubmenu>Open Recent</guisubmenu>
de: <guimenu>Datei</guimenu> <guisubmenu>Zuletzt geöffnete Dateien</guisubmenu>

source: Opens a &turtlescript; file that has been opened recently.
de: Öffnet eine der zuletzt geöffneten &turtlescript;-Dateien.

source: <guimenu>File</guimenu> <guisubmenu>Examples</guisubmenu>
de: <guimenu>Datei</guimenu> <guisubmenu>Beispiele</guisubmenu>

source: Open example &turtlescript; programs. The examples are in your favorite language that you can choose in <menuchoice><guimenu>Settings</guimenu><guisubmenu>Script Language</guisubmenu></menuchoice>.
de: Öffnet die &turtlescript;-Beispielprogramme. Die Beispiele sind in der Sprache übersetzt, die Sie mit <menuchoice><guimenu>Einstellungen</guimenu><guisubmenu>Skript-Sprache</guisubmenu></menuchoice> ausgewählt haben.

source: <guimenu>File</guimenu> <guimenuitem>Get more examples...</guimenuitem>
de: <guimenu>Datei</guimenu> <guimenuitem>Weitere Beispiele herunterladen ...</guimenuitem>

source: Open the get <guilabel>Hot New Stuff</guilabel> dialog to download additional &turtlescript; files from the Internet.
de: Öffnet den Dialog <guilabel>„Neue Erweiterungen“ herunterladen</guilabel>, um zusätzliche &turtlescript;-Dateien aus dem Internet zu holen.

source: <shortcut> <keycombo>&Ctrl;<keycap>S</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Save</guimenuitem>
de: <shortcut><keycombo>&Ctrl;<keycap> S</keycap></keycombo></shortcut> <guimenu>Datei</guimenu><guimenuitem>Speichern</guimenuitem>

source: Saves the currently opened &turtlescript; file.
de: Speichert die gerade geöffnete &turtlescript;-Datei.

source: <guimenu>File</guimenu> <guimenuitem>Save As...</guimenuitem>
de: <guimenu>Datei</guimenu> <guimenuitem>Speichern unter ...</guimenuitem>

source: Saves the currently opened &turtlescript; file on a specified location.
de: Speichert die gerade geöffnete &turtlescript;-Datei in einem bestimmten Ordner.

source: <guimenu>File</guimenu> <guimenuitem>Export to HTML...</guimenuitem>
de: <guimenu>Datei</guimenu> <guimenuitem>Als HTML exportieren ...</guimenuitem>

source: Exports the current content of the Editor as an HTML file that includes highlighting colors.
de: Exportiert den aktuellen Inhalt des Editors als HTML-Datei mit den farbigen Hervorhebungen.

source: <shortcut> <keycombo>&Ctrl;<keycap>P</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Print...</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>P</keycap></keycombo></shortcut> <guimenu>Datei</guimenu><guimenuitem>Drucken ...</guimenuitem>

source: Prints the current code in the editor.
de: Druckt den aktuellen Quelltext im Editor.

source: <shortcut> <keycombo>&Ctrl;<keycap>Q</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Quit</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo> </shortcut><guimenu>Datei</guimenu><guimenuitem>Beenden</guimenuitem>

source: Quits &kturtle;.
de: Beendet &kturtle;.

source: The <guimenu>Edit</guimenu> Menu
de: Das Menü <guimenu>Bearbeiten</guimenu>

source: <shortcut> <keycombo>&Ctrl;<keycap>Z</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Undo</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>Z</keycap></keycombo></shortcut> <guimenu>Bearbeiten</guimenu> <guimenuitem>Rückgängig</guimenuitem>

source: Undoes the last change to code. &kturtle; has unlimited undos.
de: Macht die letzte Änderung des Quelltextes wieder rückgängig. Die Anzahl dieser Rückgängig-Schritte in &kturtle; ist nicht begrenzt.

source: <shortcut> <keycombo>&Ctrl;&Shift;<keycap>Z</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Redo</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>Z</keycap></keycombo></shortcut> <guimenu>Bearbeiten</guimenu> <guimenuitem>Rückgängig</guimenuitem>

source: Redoes an undone change to the code.
de: Nimmt das letzte Rückgängig wieder zurück.

source: <shortcut> <keycombo>&Ctrl;<keycap>X</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Cut</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>X</keycap></keycombo></shortcut> <guimenu>Bearbeiten</guimenu> <guimenuitem>Ausschneiden</guimenuitem>

source: Cuts the selected text from <link linkend="the-editor">the editor</link> to the clipboard.
de: Schneidet den gewählten Text aus dem <link linkend="the-editor">Editor</link> aus und fügt ihn in die Zwischenablage ein.

source: <shortcut> <keycombo>&Ctrl;<keycap>C</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Copy</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>C</keycap></keycombo> </shortcut> <guimenu>Bearbeiten</guimenu><guimenuitem>Kopieren</guimenuitem>

source: Copies the selected text from <link linkend="the-editor">the editor</link> to the clipboard.
de: Kopiert den gewählten Text aus dem <link linkend="the-editor">Editor</link> in die Zwischenablage.

source: <shortcut> <keycombo>&Ctrl;<keycap>V</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Paste</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>V</keycap></keycombo> </shortcut> <guimenu>Bearbeiten</guimenu><guimenuitem>Einfügen</guimenuitem>

source: Pastes the text from the clipboard to <link linkend="the-editor">the editor</link>.
de: Fügt den Text aus der Zwischenablage in den <link linkend="the-editor">Editor</link> ein.

source: <shortcut> <keycombo>&Ctrl;<keycap>A</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Select All</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>A</keycap></keycombo> </shortcut> <guimenu>Bearbeiten</guimenu><guimenuitem>Alles auswählen</guimenuitem>

source: Selects all the text from <link linkend="the-editor">the editor</link>.
de: Wählt den gesamten Text im <link linkend="the-editor">Editor</link> aus.

source: <shortcut> <keycombo>&Ctrl;<keycap>F</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Find...</guimenuitem>
de: <shortcut> <keycombo>&Ctrl;<keycap>F</keycap></keycombo> </shortcut> <guimenu>Bearbeiten</guimenu> <guimenuitem>Suchen ...</guimenuitem>

source: With this action you can find phrases in the code.
de: Mit diesem Befehl können Sie Textpassagen im Quelltext suchen.

source: <shortcut> <keycombo><keysym>F3</keysym></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Find Next</guimenuitem>
de: <shortcut> <keycombo><keysym>F3</keysym></keycombo> </shortcut> <guimenu>Bearbeiten</guimenu> <guimenuitem>Weitersuchen</guimenuitem>

source: Use this to find the next occurrence of the phrase you searched for.
de: Geht zum nächsten Auftreten des zuletzt gesuchten Textes.

source: <shortcut> <keycombo>&Shift;<keysym>F3</keysym></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Find Previous</guimenuitem>
de: <shortcut> <keycombo>&Shift;<keysym>F3</keysym></keycombo> </shortcut> <guimenu>Bearbeiten</guimenu> <guimenuitem>Frühere suchen</guimenuitem>

source: Use this to find the previous occurrence of the phrase you searched for.
de: Geht zum vorherigen Auftreten des zuletzt gesuchten Textes.

source: <shortcut> <keycombo><keycap>Ins</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Overwrite Mode</guimenuitem>
de: <shortcut><keycombo><keycap>Einf</keycap></keycombo></shortcut> <guimenu>Bearbeiten</guimenu> <guimenuitem>Überschreiben-Modus</guimenuitem>

source: Toggle between the 'insert' and 'overwrite' mode.
de: Schaltet im Editor zwischen Einfügen und Überschreiben um.

source: The <guimenu>Canvas</guimenu> Menu
de: Das Menü <guimenu>Zeichenfläche</guimenu>

source: <guimenu>Canvas</guimenu> <guimenuitem>Export to Image (PNG)...</guimenuitem>
de: <guimenu>Zeichenfläche</guimenu> <guimenuitem>Als Bild (PNG) exportieren ...</guimenuitem>

source: Exports the current content of the <link linkend="the-canvas">Canvas</link> as a raster image of the PNG (Portable Network Graphics) type.
de: Exportiert den aktuellen Inhalt der <link linkend="the-canvas">Zeichenfläche</link> als Rasterbild im Format PNG (Portable Network Graphics).

source: <guimenu>Canvas</guimenu> <guimenuitem>Export to Drawing (SVG)...</guimenuitem>
de: <guimenu>Zeichenfläche</guimenu> <guimenuitem>Als Zeichnung (SVG) exportieren ...</guimenuitem>

source: Exports the current content of the <link linkend="the-canvas">Canvas</link> as a vector drawing of the SVG (Scalable Vector Graphics) type.
de: Exportiert den aktuellen Inhalt der <link linkend="the-canvas">Zeichenfläche</link> als Vektorzeichnung im Format SVG (Scalable Vector Graphics).

source: <guimenu>Canvas</guimenu> <guimenuitem>Print Canvas...</guimenuitem>
de: <guimenu>Zeichenfläche</guimenu> <guimenuitem>Zeichenfläche drucken ...</guimenuitem>

source: Prints the current content of the <link linkend="the-canvas">Canvas</link>.
de: Druckt den aktuellen Inhalt der <link linkend="the-canvas">Zeichenfläche</link>.

source: The <guimenu>Run</guimenu> Menu
de: Das Menü <guimenu>Ausführen</guimenu>

source: <shortcut> <keycombo><keysym>F5</keysym></keycombo> </shortcut> <guimenu>Run</guimenu> <guimenuitem>Run</guimenuitem>
de: <shortcut> <keycombo><keysym>F5</keysym></keycombo> </shortcut> <guimenu>Ausführen</guimenu> <guimenuitem>Ausführen</guimenuitem>

source: Starts the execution of the commands in the editor.
de: Startet die Ausführung der Befehle im Editor.

source: <shortcut> <keycombo><keysym>F6</keysym></keycombo> </shortcut> <guimenu>Run</guimenu> <guimenuitem>Pause</guimenuitem>
de: <shortcut> <keycombo><keysym>F6</keysym></keycombo> </shortcut> <guimenu>Ausführen</guimenu> <guimenuitem>Pause</guimenuitem>

source: Pauses the execution. This action is only enabled when the commands are actually executing.
de: Hält die Ausführung an. Diesen Menüeintrag können Sie nur auswählen, wenn gerade Befehle ausgeführt werden.

source: <shortcut> <keycombo><keysym>F7</keysym></keycombo> </shortcut> <guimenu>Run</guimenu> <guimenuitem>Abort</guimenuitem>
de: <shortcut> <keycombo><keysym>F7</keysym></keycombo> </shortcut> <guimenu>Ausführen</guimenu> <guimenuitem>Abbrechen</guimenuitem>

source: Stops the execution. This action is only enabled when the commands are actually executing.
de: Bricht die Ausführung ab. Diesen Menüeintrag können Sie nur auswählen, wenn gerade Befehle ausgeführt werden.

source: <guimenu>Run</guimenu> <guisubmenu>Run Speed</guisubmenu>
de: <guimenu>Ausführen</guimenu> <guisubmenu>Bewegungs-Geschwindigkeit</guisubmenu>

source: Present a list of possible execution speeds, consisting of: <guimenuitem>Full Speed (no highlighting and inspector)</guimenuitem>, <guimenuitem>Full Speed</guimenuitem>, <guimenuitem>Slow</guimenuitem>, <guimenuitem>Slower</guimenuitem>, <guimenuitem>Slowest</guimenuitem> and <guimenuitem>Step-by-Step</guimenuitem>. When the execution speed is set to <guimenuitem>Full Speed</guimenuitem> (default) we can barely keep up with what is happening. Sometimes this behavior is wanted, but sometimes we want to keep track of the execution. In the latter case you want to set the execution speed to <guimenuitem>Slow</guimenuitem>, <guimenuitem>Slower</guimenuitem> or <guimenuitem>Slowest</guimenuitem>. When one of the slow modes is selected the current position of the executor will be shown in the editor. <guimenuitem>Step-by-Step</guimenuitem> will execute one command at a time.
de: Enthält eine Liste mit unterschiedlichen Ausführungsgeschwindigkeiten: <guimenuitem>Volle Geschwindigkeit</guimenuitem>, <guimenuitem>Volle Geschwindigkeit (keine Hervorhebung und Kontrollfenster)</guimenuitem>, <guimenuitem>Langsam</guimenuitem>, <guimenuitem>Langsamer</guimenuitem>, <guimenuitem>Am Langsamsten</guimenuitem>, <guimenuitem>Schritt-für-Schritt</guimenuitem>. Wenn die Ausführungsgeschwindigkeit auf <guimenuitem>Volle Geschwindigkeit</guimenuitem> (Standard) eingestellt ist, können Sie kaum verfolgen, was passiert. Manchmal ist dieses Verhalten gewollt, aber manchmal möchten Sie die Ausführung verfolgen können. In diesen Fällen setzen Sie die Ausführungsgeschwindigkeit auf <guimenuitem>Langsam</guimenuitem>, <guimenuitem>Langsamer</guimenuitem> oder <guimenuitem>Am Langsamsten</guimenuitem>, dann wird auch die aktuelle Position der Ausführung im Quelltexteditor angezeigt. Mit <guimenuitem>Schritt-für-Schritt</guimenuitem> können Sie die Befehle einzeln ausführen.

source: The <guimenu>Tools</guimenu> Menu
de: Das Menü <guimenu>Extras</guimenu>

source: <guimenu>Tools</guimenu> <guimenuitem>Direction Chooser...</guimenuitem>
de: <guimenu>Extras</guimenu> <guimenuitem>Richtungsauswahl ...</guimenuitem>

source: This action opens the direction chooser dialog.
de: Öffnet den Dialog zur Richtungsauswahl.

source: <guimenu>Tools</guimenu> <guimenuitem>Color Picker...</guimenuitem>
de: <guimenu>Extras</guimenu> <guimenuitem>Farbauswahl ...</guimenuitem>

source: This action opens the color picker dialog.
de: Öffnet den Dialog zur Farbauswahl.

source: The <guimenu>Settings</guimenu> Menu
de: Das Menü <guimenu>Einstellungen</guimenu>

source: <guimenu>Settings</guimenu><guisubmenu>Script Language</guisubmenu>
de: <guimenu>Einstellungen</guimenu> <guisubmenu>Skript-Sprache</guisubmenu>

source: <action>Choose</action> the language for the code.
de: <action>Wählen</action> Sie hier die Sprache für den Quelltext aus.

source: <shortcut> <keycombo>&Ctrl;<keycap>E</keycap></keycombo> </shortcut> <guimenu>Settings</guimenu> <guimenuitem>Show Editor</guimenuitem>
de: <shortcut> <keycombo>&Ctrl;<keycap>E</keycap></keycombo> </shortcut> <guimenu>Einstellungen</guimenu> <guimenuitem>Quelltexteditor anzeigen</guimenuitem>

source: Show or hide the <link linkend="the-editor">Editor</link>.
de: Zeigt den <link linkend="the-editor">Editor</link> an oder blendet ihn aus.

source: <shortcut> <keycombo>&Ctrl;<keycap>I</keycap></keycombo> </shortcut> <guimenu>Settings</guimenu> <guimenuitem>Show Inspector</guimenuitem>
de: <shortcut><keycombo>&Ctrl;<keycap> I</keycap></keycombo></shortcut> <guimenu>Einstellungen</guimenu><guimenuitem>Kontrollfenster anzeigen</guimenuitem>

source: Show or hide <link linkend="the-inspector">the inspector</link>.
de: Zeigt das <link linkend="the-inspector">Kontrollfenster</link> an oder blendet es aus.

source: <guimenu>Settings</guimenu> <guimenuitem>Show Errors</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>Fehler anzeigen</guimenuitem>

source: Show or hide the <guilabel>Error</guilabel> tab with a list of errors resulting from running the code. If this option is enabled, click on <guilabel>Canvas</guilabel> to see the turtle again.
de: Schaltet die Anzeige des <guilabel>Fehler</guilabel>fensters mit einer Liste aller Fehler des aktuellen Quelltextes ein oder aus. Ist das Fehlerfenster eingeblendet, klicken Sie auf <guilabel>Zeichenfläche</guilabel>, um die Schildkröte wieder zu sehen.

source: <shortcut> <keycombo><keysym>F11</keysym></keycombo> </shortcut> <guimenu>Settings</guimenu> <guimenuitem>Show Line Numbers</guimenuitem>
de: <shortcut> <keycombo><keysym>F11</keysym></keycombo> </shortcut> <guimenu>Einstellungen</guimenu> <guimenuitem>Zeilennummern anzeigen</guimenuitem>

source: With this action you can show the line numbers in <link linkend="the-editor">the editor</link>. This can be handy for finding errors.
de: Mir diesem Befehl werden im <link linkend="the-editor">Editor</link> Zeilennummern angezeigt. Das erleichtert die Fehlersuche.
