Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdeedu/kturtle_using-kturtle.po
Languages: de

source: <guimenu>Settings</guimenu><guimenuitem>Show Toolbar</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>Werkzeugleiste anzeigen</guimenuitem>

source: <action>Toggle</action> the Main Toolbar
de: <action>Zeigt</action> die Werkzeugleiste an bzw. blendet sie aus

source: <guimenu>Settings</guimenu><guimenuitem>Show Statusbar</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>Statusleiste anzeigen</guimenuitem>

source: <action>Toggle</action> the Statusbar
de: <action>Zeigt</action> die Statusleiste an bzw. blendet sie aus

source: <guimenu>Settings</guimenu> <guimenuitem>Configure Shortcuts...</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>Kurzbefehle festlegen ...</guimenuitem>

source: Standard &kde; dialog to configure the shortcuts.
de: Öffnet den &kde;-Standarddialog zur Einstellung der Kurzbefehle.

source: <guimenu>Settings</guimenu> <guimenuitem>Configure Toolbars...</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>Werkzeugleisten einrichten ...</guimenuitem>

source: The standard &kde; dialog for configuring the toolbars.
de: Öffnet den &kde;-Standarddialog zur Einrichtung der Symbole in den Werkzeugleisten.

source: The <guimenu>Help</guimenu> Menu
de: Das Menü <guimenu>Hilfe</guimenu>

source: <shortcut> <keycombo><keysym>F2</keysym></keycombo> </shortcut> <guimenu>Help</guimenu> <guimenuitem>Help on: ...</guimenuitem>
de: <shortcut> <keycombo><keysym>F2</keysym></keycombo> </shortcut> <guimenu>Hilfe</guimenu> <guimenuitem>Hilfe zu: ...</guimenuitem>

source: This is a very useful function: it provides help on the code where the cursor in the editor is at. So, &eg;, you have used the <userinput>print</userinput> command in your code, and you want to read and to know what the handbook says on this command. You just move your cursor so it is in the <userinput>print</userinput> command and you press <keysym>F2</keysym>. The handbook will then show all info on the <userinput>print</userinput> command.
de: Dies ist eine sehr hilfreiche Funktion, sie zeigt Hilfe zum Quelltext, in dem der Cursor gerade steht. Wenn Sie &eg; den Befehl <userinput>drucke</userinput> in Ihrem Quelltext benutzen und die Hilfe zu diesem Befehl lesen möchten, bewegen Sie den Cursor in diesen Befehl <userinput>drucke</userinput> und drücken <keysym>F2</keysym>. Das Handbuch zeigt Ihnen dann alle Informationen zum Befehl <userinput>drucke</userinput>.

source: This function can prove to be useful while learning &turtlescript;.
de: Diese Funktion ist in der Lernphase des Programmierens mit &turtlescript; sehr hilfreich.

source: The Statusbar
de: Die Statusleiste

source: On the status bar you get feedback of the state of &kturtle;. On the left side it shows the feedback on the last action. On the right side you find the current location of the cursor (line and column numbers). In the middle of the status bar is indicated the current language used for the commands.
de: In der Statusleiste sehen Sie Informationen über den Zustand von &kturtle;. Auf der linken Seite wird das Ergebnis des letzten Befehls gezeigt. Auf der rechten Seite sehen Sie die aktuelle Position des Cursors (Zeilen- und Spaltennummer). In der Mitte der Statusleiste wird die aktuell eingestellte Sprache für die Befehle angezeigt.
