Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdeedu/kturtle_getting-started.po
Languages: de

source: Getting Started
de: Erste Schritte

source: When you start &kturtle; you will see something like this: <screenshot> <screeninfo>Here is a screenshot of &kturtle; when you start it for the first time</screeninfo> <mediaobject> <imageobject> <imagedata fileref="mainwindow.png" format="PNG"/> </imageobject> <textobject> <phrase>&kturtle; on a fresh start</phrase> </textobject> </mediaobject> </screenshot> In this Getting Started guide we assume that the language of the &turtlescript; commands is English. You can change this language with <menuchoice><guimenu>Settings</guimenu><guisubmenu>Script Language</guisubmenu></menuchoice>. Be aware that the language you set here for &kturtle; is the one you use to type the &turtlescript; commands, not the language used by &kde; on your computer and used to display the &kturtle; interface and menus.
de: Beim ersten Start von &kturtle; sehen Sie folgendes Bild: <screenshot> <screeninfo>Hier ist ein Bildschirmfoto von &kturtle;, wenn Sie es das erste Mal starten</screeninfo><mediaobject><imageobject> <imagedata fileref="mainwindow.png" format="PNG"/> </imageobject> <textobject> <phrase>&kturtle; beim ersten Start</phrase> </textobject> </mediaobject> </screenshot> In diesem Handbuch zur Einführung wird angenommen, dass die Sprache der &turtlescript;-Befehle auf deutsch eingestellt ist. Die Spracheinstellung können Sie unter <menuchoice><guimenu>Einstellungen</guimenu><guisubmenu>Skript-Sprache</guisubmenu></menuchoice> finden. Die hier für &kturtle; eingestellte Sprache wird für die &turtlescript;-Befehle verwendet, das ist nicht die Sprache für &kde; und für die grafische Oberfläche und die Menüs von &kturtle;.

source: First steps with &turtlescript;: meet the Turtle!
de: Erste Schritte mit &turtlescript;: Spielen Sie mit der Schildkröte!

source: You must have noticed the turtle in the middle of the canvas: you are just about to learn how to control it using commands in the editor.
de: Wie Sie sicher bemerkt haben, steht die Schildkröte mitten auf der Zeichenfläche: Sie lernen hier, die Schildkröte mit Befehlen im Editor zu kontrollieren.

source: The Turtle Moves
de: Die Schildkröte bewegt sich

source: Let us start by getting the turtle moving. Our turtle can do 3 types of moves, (1) it can move forwards and backwards, (2) it can turn left and right and (3) it can go (jump) directly to a position on the screen. Try this for example:
de: Beginnen Sie damit, die Schildkröte in Bewegung zu setzen. Unsere Schildkröte kennt drei Arten von Bewegungen. (1) sie kann vorwärts oder rückwärts gehen, (2) sie kann nach links oder rechts drehen und (3) sie kann direkt zu einer Position auf der Zeichenfläche springen. Versuchen Sie zum Beispiel diese Befehle:

source: forward 100 turnleft 90
de: vorwärts 100 linksdrehen 90

source: Type or copy-paste the code to the editor and execute it (using <link linkend="run-execute"><menuchoice><guimenu>Run</guimenu><guimenuitem>Run</guimenuitem></menuchoice></link>) to see the result.
de: Im Editor können Sie Text direkt eingeben oder kopieren und einfügen. Mit <link linkend="run-execute"><menuchoice><guimenu>Ausführen</guimenu><guimenuitem>Ausführen</guimenuitem></menuchoice></link> sehen Sie das Ergebnis.

source: When you typed and executed the commands like above in the editor you might have noticed one or more of the following things:
de: Nach der Eingabe und Ausführung der oben gezeigten Befehle im Editor ist Ihnen vielleicht folgendes aufgefallen:

source: That &mdash; after executing the commands &mdash; the turtle moves up, draws a line, and then turns a quarter turn to the left. This because you have used the <link linkend="forward"><userinput>forward</userinput></link> and the <link linkend="turnleft"><userinput>turnleft</userinput></link> commands.
de: Die Schildkröte bewegt sich &mdash; nach der Ausführung der Befehle &mdash; nach oben, zeichnet eine Linie und macht dann eine Vierteldrehung nach links. Dies haben Sie mit den Befehlen <link linkend="forward"><userinput>vorwärts</userinput></link> und <link linkend="turnleft"><userinput>linksdrehen</userinput></link> erreicht.

source: That the color of the code changed while you where typing it: this feature is called <emphasis>intuitive highlighting</emphasis> &mdash; different types of commands are highlighted differently. This makes reading large blocks of code more easy.
de: Die Farbe des Codes hat sich bei der Eingabe verändert, diese Eigenschaft nennt sich <emphasis>intuitive Hervorhebung</emphasis> &mdash;, verschiedene Arten von Befehlen werden unterschiedlich dargestellt. Dies erleichtert das Lesen von Quelltexten.

source: That the turtle draws a thin black line.
de: Die Schildkröte zeichnet eine dünne schwarze Linie.

source: Maybe you got an error message. This could simply mean two things: you could have made a mistake while copying the commands, or you should still set the correct language for the &turtlescript; commands (you can do that by choosing <menuchoice><guimenu>Settings</guimenu><guisubmenu>Script Language</guisubmenu></menuchoice>).
de: Vielleicht haben Sie auch eine Fehlermeldung bekommen. Das kann zwei Gründe haben, entweder haben Sie die Befehle falsch geschrieben oder Sie müssen noch die richtige Sprache für die &turtlescript;-Befehle einstellen (mit <menuchoice><guimenu>Einstellungen</guimenu><guisubmenu>Skript-Sprache</guisubmenu></menuchoice>).

source: You will likely understand that <userinput>forward 100</userinput> instructed the turtle to move forward leaving a line, and that <userinput>turnleft 90</userinput> instructed the turtle to turn 90 <glossterm linkend="degrees">degrees</glossterm> to the left.
de: Sie sehen wahrscheinlich, das <userinput>vorwärts 100</userinput> die Schildkröte vorwärts bewegt und dabei eine Linie zeichnet, und das <userinput>linksdrehen 90</userinput> die Schildkröte um 90 <glossterm linkend="degrees">Grad</glossterm> nach links dreht.

source: Please see the following links to the reference manual for a complete explanation of the new commands: <link linkend="forward"><userinput>forward</userinput></link>, <link linkend="backward"><userinput>backward</userinput></link>, <link linkend="turnleft"><userinput>turnleft</userinput></link>, and <link linkend="turnright"><userinput>turnright</userinput></link>.
de: In den folgenden Verweisen zum Referenzhandbuch finden Sie ausführliche Erklärungen der neuen Befehle: <link linkend="forward"><userinput>vorwärts</userinput></link>, <link linkend="backward"><userinput>rückwärts</userinput></link>, <link linkend="turnleft"><userinput>linksdrehen</userinput></link> und <link linkend="turnright"><userinput>rechtsdrehen</userinput></link>.

source: More examples
de: Weitere Beispiele

source: The first example was very simple, so let us go on!
de: Das erste Beispiel war sehr einfach, deshalb machen wir weiter!

source: reset canvassize 200,200 canvascolor 0,0,0 pencolor 255,0,0 penwidth 5 go 20,20 direction 135 forward 200 turnleft 135 forward 100 turnleft 135 forward 141 turnleft 135 forward 100 turnleft 45 go 40,100
de: zurücksetzen papiergröße 200,200 papierfarbe 0,0,0 stiftfarbe 255,0,0 stiftbreite 5 gehe 20,20 richtung 135 vorwärts 200 linksdrehen 135 vorwärts 100 linksdrehen 135 vorwärts 141 linksdrehen 135 vorwärts 100 linksdrehen 45 gehe 40, 100

source: Again you can type or copy-paste the code to the editor or open the <filename>arrow</filename> example in the <guimenu>Examples</guimenu> menu and execute it (using <link linkend="run-execute"><menuchoice><guimenu>Run</guimenu><guimenuitem>Run</guimenuitem></menuchoice></link>) to see the result. In the next examples you are expected to know the drill.
de: Auch hier können Sie den Quelltext eingeben oder kopieren und in den Editor einfügen. Oder Sie öffnen die Datei <filename>pfeil</filename> im Menü <guimenu>Beispiele</guimenu> und führen sie aus (mit <link linkend="run-execute"><menuchoice><guimenu>Ausführen</guimenu><guimenuitem>Ausführen</guimenuitem></menuchoice></link>), um das Ergebnis zu sehen. In den folgenden Beispielen werden diese Möglichkeiten zur Eingabe von Quelltext nicht mehr ausdrücklich genannt.

source: You might have noticed that this second example uses a lot more code. You have also seen a couple of new commands. Here a short explanation of all the new commands:
de: Wie Sie vielleicht festgestellt haben, benutzt das zweite Beispiel viel mehr Quelltext. Außerdem enthält es viele neue Befehle, die im folgenden kurz erklärt werden.

source: After a <userinput>reset</userinput> command everything is like is was when you had just started &kturtle;.
de: Mit dem Befehl <userinput>zurücksetzen</userinput> wird alles wieder wie direkt nach dem Start von &kturtle; eingestellt.

source: <userinput>canvassize 200,200</userinput> sets the canvas width and height to 200 <glossterm linkend="pixels">pixels</glossterm>. The width and the height are equal, so the canvas will be a square.
de: <userinput>papiergröße 200,200</userinput> setzt die Breite und Höhe der Zeichenfläche auf 200 <glossterm linkend="pixels">Pixel</glossterm>. Breite und Höhe sind gleich, also ist die Zeichenfläche ein Quadrat.

source: <userinput>canvascolor 0,0,0</userinput> makes the canvas black. <userinput>0,0,0</userinput> is a <glossterm linkend="rgb">RGB-combination</glossterm> where all values are set to <userinput>0</userinput>, which results in black.
de: <userinput>papierfarbe 0,0,0</userinput> färbt die Zeichenfläche schwarz. <userinput>papierfarbe 0,0,0</userinput> ist eine <glossterm linkend="rgb">RGB-Kombination</glossterm>, in der alle Werte auf <userinput>0</userinput> gesetzt sind, das Ergebnis ist schwarz.

source: <userinput>pencolor 255,0,0</userinput> sets the color of the pen to red. <userinput>255,0,0</userinput> is a <glossterm linkend="rgb">RGB-combination</glossterm> where only the red value is set to <userinput>255</userinput> (fully on) while the others (green and blue) are set to <userinput>0</userinput> (fully off). This results in a bright shade of red.
de: <userinput>stiftfarbe 255,0,0</userinput> setzt die Farbe des Zeichenstiftes auf Rot. <userinput>255,0,0</userinput> ist eine <glossterm linkend="rgb">RGB-Kombination</glossterm>, in der nur der Wert für Rot auf <userinput>255</userinput> gesetzt ist, während die anderen (Grün und Blau) den Wert <userinput>0</userinput> (aus) haben. Das Ergebnis ist ein leuchtendes Rot.

source: If you do not understand the color values, be sure to read the glossary on <glossterm linkend="rgb">RGB-combination</glossterm>.
de: Wenn Sie die Farbwerte nicht verstehen, finden Sie dazu weitere Erläuterungen unter dem Begriff <glossterm linkend="rgb">RGB-Kombinationen</glossterm>

source: <userinput>penwidth 5</userinput> sets the width (the size) of the pen to <userinput>5</userinput> <glossterm linkend="pixels">pixels</glossterm>. From now on every line the turtle draw will have a thickness of <userinput>5</userinput>, until we change the <userinput>penwidth</userinput> to something else.
de: <userinput>stiftbreite 5</userinput> setzt die Breite des Zeichenstiftes auf <userinput>5</userinput> <glossterm linkend="pixels">Pixel</glossterm>. Nach diesem Befehl zeichnet die Schildkröte jede Linie mit einer Breite von <userinput>5</userinput>, bis Sie die <userinput>stiftbreite</userinput> auf einen anderen Wert einstellen.

source: <userinput>go 20,20</userinput> commands the turtle to go to a certain place on the canvas. Counted from the upper left corner, this place is 20 <glossterm linkend="pixels">pixels</glossterm> across from the left, and 20 <glossterm linkend="pixels">pixels</glossterm> down from the top of the canvas. Note that using the <userinput>go</userinput> command the turtle will not draw a line.
de: <userinput>gehe 20,20</userinput> bewegt die Schildkröte auf eine bestimmte Stelle auf der Zeichenfläche, die 20 <glossterm linkend="pixels">Pixel</glossterm> vom linken Rand und 20 <glossterm linkend="pixels">Pixel</glossterm> vom oberen Rand der Zeichenfläche entfernt ist. Mit dem Befehl <userinput>gehe</userinput> zeichnet die Schildkröte keine Linie.

source: <userinput>direction 135</userinput> set the turtle's direction. The <userinput>turnleft</userinput> and <userinput>turnright</userinput> commands change the turtle's angle starting from its current direction. The <userinput>direction</userinput> command changes the turtle's angle from zero, and thus is not relative to the turtle previous direction.
de: <userinput>richtung 135</userinput> setzt die Bewegungsrichtung der Schildkröte. Die Befehle <userinput>linksdrehen</userinput> und <userinput>rechtsdrehen</userinput> ändern die Bewegungsrichtung der Schildkröte relativ zur vorhandenen Richtung. Der Befehl <userinput>richtung</userinput> setzt die Bewegungsrichtung unabhängig von der vorhandenen Richtung neu.

source: After the <userinput>direction</userinput> command a lot of <userinput>forward</userinput> and <userinput>turnleft</userinput> commands follow. These command do the actual drawing.
de: Nach dem Befehl <userinput>richtung</userinput> folgen viele <userinput>vorwärts</userinput> und <userinput>linksdrehen</userinput> Befehle. Diese Befehle erzeugen die aktuelle Zeichnung.

source: At last another <userinput>go</userinput> command is used to move the turtle aside.
de: Zum Schluss bewegt der Befehl <userinput>gehe</userinput> die Schildkröte zu Seite.

source: Make sure you follow the links to the reference. The reference explains each command more thoroughly.
de: Lesen Sie die Verknüpfungen zur Befehlsreferenz, in der die einzelnen Befehle ausführlicher erklärt werden.
