Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdeedu/kwordquiz.po
Languages: de

source: The &kwordquiz; Handbook
de: Das Handbuch zu &kwordquiz;

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Burkhard</firstname><surname>Lück</surname><affiliation><address><email>lueck@hube-lueck.de</email></address></affiliation><contrib>Übersetzung</contrib></othercredit>

source: &kwordquiz; is a flashcard and vocabulary learning program for &kde;.
de: &kwordquiz; ist ein Karteikarten- und Vokabel-Lernprogramm für &kde;.

source: flashcard
de: Karteikarte

source: vocabulary
de: Vokabeln

source: language
de: Sprache

source: education
de: Bildung

source: school
de: Schule

source: college
de: Hochschule

source: university
de: Universität

source: Introduction
de: Einleitung

source: &kwordquiz; is a tool that gives you a powerful way to master new vocabularies. It may be a language or any other kind of terminology.
de: &kwordquiz; ist ein leistungsfähiges Werkzeug, um neue Vokabeln zu lernen, entweder eine Sprache oder irgend eine andere Art von Begriffen.

source: Easy to use
de: Einfach zu benutzen

source: With &kwordquiz; you build your own vocabulary documents in a simple and intuitive way. The basic layout is a two-column spreadsheet where you type vocabulary entries in one form that you know and in another form that you want to learn. You change the titles of the columns to reflect what you are practicing.
de: Mit &kwordquiz; können Sie Ihre eigenen Vokabeldokumente auf einfache und intuitive Weise erstellen. Die Basisansicht ist eine Tabelle mit 2 Spalten, Sie geben die bekannten Vokabeleinträge in der einen Spalte und die Einträge, die Sie lernen wollen, in der anderen Spalte ein. Die Überschriften der Spalten passen Sie an Ihre Lernübung an.

source: Practice modes
de: Übungsmodus

source: Before you start a quiz you select how you want to practice. &kwordquiz; offers five different modes to make practicing more efficient. The different modes make it possible to have the quiz go through your vocabulary in sequential or random order in one or both directions.
de: Ehe Sie ein Quiz beginnen, stellen Sie den Modus für Ihre Lernübung ein. In &kwordquiz; gibt es fünf unterschiedliche Modi, um das Lernen effizienter zu machen. Mit den unterschiedlichen Modi können Sie das Vokabular in sortierter oder zufälliger Reihenfolge in einer oder beiden Richtungen bearbeiten.

source: Quiz types
de: Quizarten

source: When you have entered your vocabulary and selected a mode you are ready to start a quiz. Maybe you want to start with a flashcard session, then you can move on to a multiple choice quiz or do the powerful question and answer quiz. You get instant feedback on correct and incorrect answers and you have the option to repeat any errors, further improving your learning efficiency. If you need a little extra help you can use the hint function.
de: Wenn Sie Ihre Vokabeln eingegeben und einen Modus ausgewählt haben, können Sie das Quiz beginnen. Sie beginnen vielleicht mit einer Karteikartensitzung, dann wechseln Sie zur Mehrfachauswahl oder zum Frage &amp; Antwort Quiz. Sie erhalten sofort eine Rückmeldung über falsche und richtige Antworten und können alle falsch beantworteten Fragen wiederholen, um Ihren Lernfortschritt zu verbessern. Wenn Sie zusätzliche Hilfe brauchen, benutzen Sie die Tipp-Funktion.

source: Vocabulary documents
de: Vokabeldokumente

source: &kwordquiz; can open several types of vocabulary data. The default format is .kvtml, a file format shared by several &kde; programs. &kwordquiz; should also open .wql files created by &kwordquiz; for &Windows;, .csv files with comma separated text, <ulink url="http://www.vokabeln.de/v1/download.htm">.voc files</ulink> created by the old version of Vokabeltrainer, <ulink url="http://xdxf.revdanica.com/down/">.xdxf files</ulink>, and .xml.gz files created by the old versions of <ulink url="http://pauker.sourceforge.net">Pauker</ulink>.
de: &kwordquiz; kann verschiedene Arten von Vokabeldateien öffnen. Unterstützt werden .kvtml-Dateien, die auch von anderen &kde;-Programmen benutzt werden. &kwordquiz; kann zusätzlich .wql-Dateien von WordQuiz für &Windows; .csv-Dateien aus Texten mit Komma als Trennzeichen, <ulink url="http://www.vokabeln.de/v1/download.htm">.voc files</ulink> von alten Versionen von Vokabeltrainer, <ulink url="http://xdxf.revdanica.com/down/">.xdxf-Dateien</ulink>, and .xml.gz-Dateien von alten Versionen von <ulink url="http://pauker.sourceforge.net">Pauker</ulink> öffnen.

source: &kwordquiz; can save your vocabulary documents several different formats. The default is the .kvtml format used by other &kde; programs. Another available option is comma separated text .csv.
de: &kwordquiz; kann Ihre Vokabeldateien in verschiedenen Formaten speichern. Standard ist das .kvtml-Format, dass auch von anderen &kde;-Programmen benutzt wird. Eine weitere Möglichkeit ist das .csv-Format aus Texten mit Komma als Trennzeichen.

source: You can have several files open at the same time and easily copy or move entries between files.
de: Sie können mehrere Dateien gleichzeitig öffnen und ganz einfach Einträge zwischen den Dateien verschieben oder kopieren.

source: Command Reference
de: Befehlsreferenz

source: The File Menu
de: Das Menü <quote>Datei</quote>

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>New</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo> </shortcut> <guimenu>Datei</guimenu> <guimenuitem>Neu</guimenuitem>

source: <action>New</action> creates a new blank vocabulary document
de: <action>Neu</action> erzeugt ein neues leeres Vokabeldokument

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>O</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Open...</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>O</keycap></keycombo> </shortcut> <guimenu>Datei</guimenu> <guimenuitem>Öffnen ...</guimenuitem>

source: <action>Open</action> one or more existing vocabulary documents.
de: <action>Öffnet</action> ein oder mehrere vorhandene Vokabeldokumente

source: <guimenu>File</guimenu> <guisubmenu>Open Recent</guisubmenu>
de: <guimenu>Datei</guimenu> <guisubmenu>Zuletzt geöffnete Dateien</guisubmenu>

source: <action>Open</action> a recently used vocabulary document.
de: <action>Öffnet</action> ein zuletzt benutztes Vokabeldokument.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>G</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Download New Vocabularies...</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>G</keycap></keycombo> </shortcut> <guimenu>Datei</guimenu> <guimenuitem>Neue Vokabeln herunterladen ...</guimenuitem>

source: <action>Downloads</action> new vocabularies. Downloaded vocabularies can be found in <filename class="directory">$KDEHOME/share/apps/kvtml</filename> directory. <envar>$KDEHOME</envar> is usually a hidden folder in your Home folder called <filename class="directory">.kde</filename> or <filename class="directory">.kde4</filename>
de: <action>Lädt</action> neue Vokabelsammlungen herunter. Diese Dateien finden Sie im Ordner <filename class="directory">$KDEHOME/share/apps/kvtml</filename>. <envar>$KDEHOME</envar> ist normalerweise ein versteckter Ordner in Ihrem persönlichen Ordner mit dem Namen <filename class="directory">.kde</filename> oder <filename class="directory">.kde4</filename>.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>S</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Save</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>S</keycap></keycombo> </shortcut> <guimenu>Datei</guimenu> <guimenuitem>Speichern</guimenuitem>

source: <action>Save</action> the active vocabulary document to disk.
de: <action>Speichert</action> das aktive Vokabeldokument auf die Festplatte.

source: <guimenu>File</guimenu> <guimenuitem>Save As...</guimenuitem>
de: <guimenu>Datei</guimenu> <guimenuitem>Speichern unter ...</guimenuitem>

source: <action>Save</action> the active vocabulary document with a new name.
de: <action>Speichert</action> das aktive Vokabeldokument unter einem neuen Namen.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>P</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Print...</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>P</keycap></keycombo> </shortcut> <guimenu>Datei</guimenu> <guimenuitem>Drucken ...</guimenuitem>

source: <action>Print</action> the active vocabulary document. &kwordquiz; provides several options for <link linkend="printing">printing</link> your vocabularies.
de: <action>Druckt</action> das aktive Vokabeldokument. &kwordquiz; erlaubt Ihnen, Ihre Vokabeln auf verschiedene Arten zu <link linkend="printing">drucken</link>.

source: <guimenu>File</guimenu> <guimenuitem>Print Preview</guimenuitem>
de: <guimenu>Datei</guimenu> <guimenuitem>Druckvorschau</guimenuitem>

source: <action>Show</action> preview of the active vocabulary document printed by &kwordquiz;.
de: <action>Zeigt</action>eine Druckvorschau des mit &kwordquiz; geöffneten Vokabeldokuments.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>W</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Close</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>W</keycap></keycombo> </shortcut> <guimenu>Datei</guimenu> <guimenuitem>Schließen</guimenuitem>

source: <action>Close</action> the active vocabulary document.
de: <action>Schließt</action> das aktive Vokabeldokument.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Quit</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo> </shortcut> <guimenu>Datei</guimenu> <guimenuitem>Beenden</guimenuitem>

source: <action>Quit</action> &kwordquiz;
de: <action>Beendet</action> &kwordquiz;

source: The Edit Menu
de: Das Menü <quote>Bearbeiten</quote>

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Z</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Undo</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Z</keycap></keycombo> </shortcut> <guimenu>Bearbeiten</guimenu> <guimenuitem>Rückgängig</guimenuitem>

source: <action>Undo</action> the last command. The name of this item will change to reflect what will be undone.
de: Macht den letzten Befehl <action>rückgängig</action>. Der Name dieses Eintrags ändert sich, um anzuzeigen, was rückgängig gemacht werden kann.

source: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>Z</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Redo</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;&Shift;<keycap>Z</keycap></keycombo></shortcut> <guimenu>Bearbeiten</guimenu><guimenuitem>Wiederherstellen</guimenuitem>

source: <action>Redo</action> the last command. The name of this item will change to reflect what will be redone.
de: <action>Wiederholt</action> die letzte zurückgenommene Aktion. Der Name dieses Eintrags ändert sich, um anzuzeigen, was wieder ausgeführt werden kann.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>X</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Cut</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>X</keycap></keycombo> </shortcut> <guimenu>Bearbeiten</guimenu> <guimenuitem>Ausschneiden</guimenuitem>

source: <action>Cut</action> the current selection and place it on the clipboard.
de: <action>Schneidet</action> die aktuelle Auswahl aus und fügt sie in die Zwischenablage ein.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>C</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Copy</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>C</keycap></keycombo> </shortcut> <guimenu>Bearbeiten</guimenu> <guimenuitem>Kopieren</guimenuitem>

source: <action>Copy</action> the current selection and place it on the clipboard.
de: <action>Kopiert</action> die aktuelle Auswahl in die Zwischenablage.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>V</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Paste</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>V</keycap></keycombo> </shortcut> <guimenu>Bearbeiten</guimenu> <guimenuitem>Einfügen</guimenuitem>

source: <action>Paste</action> the content of the clipboard to the current selection. If only one cell is selected &kwordquiz; will activate smart pasting and calculate the space required for pasting and add rows if necessary.
de: <action>Fügt</action> den Inhalt der Zwischenablage in die aktuelle Auswahl ein. Wenn nur eine Zelle ausgewählt ist, berechnet &kwordquiz; den nötigen Platz für das Einfügen und fügt Zeilen ein, falls erforderlich.

source: <shortcut> <keycap>Del</keycap> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Clear</guimenuitem>
de: <shortcut> <keycap>Entf</keycap> </shortcut> <guimenu>Bearbeiten</guimenu> <guimenuitem>Löschen</guimenuitem>

source: <action>Clear</action> the current selection.
de: <action>Löscht</action> den Inhalt der ausgewählten Zellen.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>I</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Insert Row</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>I</keycap></keycombo> </shortcut> <guimenu>Bearbeiten</guimenu> <guimenuitem>Zeile einfügen</guimenuitem>

source: <action>Insert</action> a new row at the current selection. If the selection extends over more than one row, an equal number of rows will be inserted.
de: <action>Fügt</action> eine neue Zeile an der aktuellen Auswahl ein. Wenn die Auswahl mehrere Zeilen umfasst, wird auch eine entsprechende Anzahl von Zeilen eingefügt.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>K</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Delete Row</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>K</keycap></keycombo> </shortcut> <guimenu>Bearbeiten</guimenu> <guimenuitem>Zeile löschen</guimenuitem>

source: <action>Delete</action> the selected row. If the selection extends over more than one row, all selected rows will be deleted.
de: <action>Löscht</action> die ausgewählten Zeilen. Wenn die Auswahl mehr als eine Zeile umfasst, werden alle gewählten Zeilen gelöscht.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>M</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Mark as Blank</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>M</keycap></keycombo> </shortcut> <guimenu>Bearbeiten</guimenu> <guimenuitem>Als Lücke markieren</guimenuitem>

source: <action>Mark as Blank</action> marks selected text (or the word where the caret is) as a blank for a <link linkend="fill-in-the-blank">'Fill-in-the-blank'</link> quiz, &ie; it's enclosed in brackets. Only available if <link linkend="dlg-config-editor">Fill-in-the-blank</link> is enabled.
de: <action>Als Lücke markieren</action> kennzeichnet den gewählten Text (oder das Wort unter dem Cursor) als Lücke für ein <link linkend="fill-in-the-blank">''Lücken füllen'</link> Quiz, schließt sie also in Klammern ein. Steht nur zur Auswahl, wenn <link linkend="dlg-config-editor">Lücken füllen</link> angekreuzt ist.

source: <guimenu>Edit</guimenu> <guimenuitem>Unmark Blanks</guimenuitem>
de: <guimenu>Bearbeiten</guimenu> <guimenuitem>Lücke entfernen</guimenuitem>

source: <action>Unmark Blanks</action> clears previously assigned blanks, &ie; brackets are removed. Only available if <link linkend="dlg-config-editor">Fill-in-the-blank</link> is enabled.
de: <action>Lücke entfernen</action> löscht die vorher zugewiesenen Lücken, &ie; die Klammern werden entfernt. Steht nur zur Auswahl, wenn <link linkend="dlg-config-editor">Lücken füllen</link> angekreuzt ist.

source: The Vocabulary Menu
de: Das Menü <quote>Vokabeln</quote>

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>L</keycap></keycombo> </shortcut> <guimenu>Vocabulary</guimenu> <guimenuitem>Column Settings...</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>L</keycap></keycombo> </shortcut> <guimenu>Vokabeln</guimenu> <guimenuitem>Spalteneinstellungen ...</guimenuitem>

source: <action>Define</action> the titles, the keyboard layouts, and the widths of the two columns in the vocabulary. Displays a <link linkend="dlg-languages">dialog</link>.
de: <action>Bestimmt</action> die Überschriften, die Tastaturbelegung und die Breite der zwei Spalten im Vokabular und öffnet dazu einen <link linkend="dlg-languages">Dialog</link>.

source: <guimenu>Vocabulary</guimenu> <guimenuitem>Font...</guimenuitem>
de: <guimenu>Vokabeln</guimenu> <guimenuitem>Schriftart ...</guimenuitem>

source: <action>Change</action> the font used to display the vocabulary.
de: <action>Einrichten</action> der Schrift für die Anzeige des Vokabulars.

source: <guimenu>Vocabulary</guimenu> <guimenuitem>Link Image...</guimenuitem>
de: <guimenu>Vokabeln</guimenu> <guimenuitem>Bild verknüpfen ...</guimenuitem>

source: <action>Specify</action> the image that should be linked with the current entry.
de: <action>Wählt</action> das Bild aus, dass mit dem aktuellen Eintrag verknüpft werden soll.

source: <guimenu>Vocabulary</guimenu> <guimenuitem>Link Sound...</guimenuitem>
de: <guimenu>Vokabeln</guimenu> <guimenuitem>Ton verknüpfen ...</guimenuitem>

source: <action>Specify</action> the sound that should be linked with the current entry.
de: <action>Wählt</action> eine Klangdatei aus, die mit dem aktuellen Eintrag verknüpft werden soll.

source: <guimenu>Vocabulary</guimenu> <guimenuitem>Adjust Row Heights</guimenuitem>
de: <guimenu>Vokabeln</guimenu> <guimenuitem>Zeilenhöhen anpassen</guimenuitem>

source: <action>Adjust</action> the height of the rows to fit the content.
de: <action>Passt</action> die Höhe der Zeilen so an, das alle Einträge vollständig angezeigt werden.

source: <guimenu>Vocabulary</guimenu> <guimenuitem>Shuffle</guimenuitem>
de: <guimenu>Vokabeln</guimenu> <guimenuitem>Mischen</guimenuitem>

source: <action>Shuffle</action> the vocabulary entries in a random order. The order of the entries in the actual vocabulary document is not changed.
de: <action>Mischt</action> die Vokabeleinträge in eine zufällige Reihenfolge. Die Reihenfolge der Einträge im aktuell geöffneten Vokabeldokument wird nicht verändert.

source: The Mode Menu
de: Das Menü <quote>Modus</quote>

source: The menu provides five different modes for the quiz.
de: Das Menü bietet fünf verschiedene Arten für das Quiz an.

source: Note that the menu names will change to reflect the column titles of the currently active vocabulary document. The mode must be selected before a quiz is started. The selected mode will apply to Flashcard, Multiple Choice and Question &amp; Answer.
de: Beachten Sie, das die Menünamen an die Spaltentitel des gerade bearbeiteten Vokabeldokuments angepasst werden. Der Modus muss vor dem Start des Quiz ausgewählt werden und wird auf Karteikarten, Mehrfachauswahl und Frage &amp; Antwort angewendet.

source: <guimenu>Mode</guimenu> <guimenuitem>Column 1 -&gt; Column 2 In Order</guimenuitem>
de: <guimenu>Modus</guimenu> <guimenuitem>Spalte 1 -&gt; Spalte 2 in Reihenfolge</guimenuitem>

source: During the quiz you will be given the entries of Column 1 and asked to provide the corresponding Column 2 entries. This will be done in the order the entries appear in the vocabulary document.
de: Im Quiz werden die Einträge in Spalte 1 angezeigt und Sie sollen die dazu passenden Begriffe in Spalte 2 eintragen. Die Einträge werden in der gleichen Reihenfolge wie im Vokabeldokument angezeigt.

source: <guimenu>Mode</guimenu> <guimenuitem>Column 2 -&gt; Column 1 In Order</guimenuitem>
de: <guimenu>Modus</guimenu> <guimenuitem>Spalte 2 -&gt; Spalte 1 in Reihenfolge</guimenuitem>

source: During the quiz you will be given the entries of Column 2 and asked to provide the corresponding Column 1 entries. This will be done in the order the entries appear in the vocabulary document.
de: Im Quiz werden die Einträge in Spalte 2 angezeigt und Sie sollen die dazu passenden Begriffe in Spalte 1 eintragen. Die Einträge werden in der gleichen Reihenfolge wie im Vokabeldokument angezeigt.

source: <guimenu>Mode</guimenu> <guimenuitem>Column 1 -&gt; Column 2 Randomly</guimenuitem>
de: <guimenu>Modus</guimenu> <guimenuitem>Spalte 1 -&gt; Spalte 2 Zufällig</guimenuitem>

source: During the quiz you will be given the entries of Column 1 and asked to provide the corresponding Column 2 entries. This will be done in a random order, but each entry will be asked once.
de: Im Quiz werden die Einträge in Spalte 1 angezeigt und Sie sollen die dazu passenden Begriffe in Spalte 2 eintragen. Die Einträge werden in zufälliger Reihenfolge angezeigt, aber jeder Eintrag nur einmal.

source: <guimenu>Mode</guimenu> <guimenuitem>Column 2 -&gt; Column 1 Randomly</guimenuitem>
de: <guimenu>Modus</guimenu> <guimenuitem>Spalte 2 -&gt; Spalte 1 Zufällig</guimenuitem>

source: During the quiz you will be given the entries of Column 2 and asked to provide the corresponding Column 1 entries. This will be done in random order, but each entry will be asked once.
de: Im Quiz werden die Einträge in Spalte 2 angezeigt und Sie sollen die dazu passenden Begriffe in Spalte 1 eintragen. Die Einträge werden in zufälliger Reihenfolge angezeigt, aber jeder Eintrag nur einmal.

source: <guimenu>Mode</guimenu> <guimenuitem>Column 1 &lt;-&gt; Column 2 Randomly</guimenuitem>
de: <guimenu>Modus</guimenu> <guimenuitem>Spalte 1 &lt;-&gt; Spalte 2 Zufällig</guimenuitem>

source: During the quiz you will be given an entry of either Column 1 or Column 2 and asked to provide the corresponding entry in the other column. This will be done in a random order for both column and entry. Each possible combination will be asked once.
de: Im Quiz werden manchmal die Einträge in Spalte 1 oder 2 angezeigt und Sie sollen die dazu passenden Begriffe in der anderen Spalte eintragen. Die Reihenfolge der Spalten und Einträge ist zufällig. Jede mögliche Kombination wird nur einmal abgefragt.

source: The Quiz Menu
de: Das Menü <quote>Quiz</quote>

source: <shortcut> <keycombo action="simul"><keycap>Return</keycap></keycombo> </shortcut> <guimenu>Quiz</guimenu> <guimenuitem>Check</guimenuitem>
de: <shortcut> <keycombo action="simul"><keycap>Eingabe</keycap></keycombo> </shortcut> <guimenu>Quiz</guimenu> <guimenuitem>Überprüfen</guimenuitem>

source: <action>Check</action> if your answer is correct
de: <action>Überprüft</action>, ob Ihre Antwort richtig ist

source: <shortcut> <keycombo action="simul"><keycap>K</keycap></keycombo> </shortcut> <guimenu>Quiz</guimenu> <guimenuitem>I Know</guimenuitem>
de: <shortcut> <keycombo action="simul"><keycap>K</keycap></keycombo> </shortcut> <guimenu>Quiz</guimenu> <guimenuitem>Ich weiß es</guimenuitem>

source: <action>Count</action> as correct during a flashcard session.
de: <action>Zählt</action> diese Karte als richtige Antwort und zeigt die nächste Karte in einer Karteikartensitzung.

source: <shortcut> <keycombo action="simul"><keycap>D</keycap></keycombo> </shortcut> <guimenu>Quiz</guimenu> <guimenuitem>I Do Not Know</guimenuitem>
de: <shortcut> <keycombo action="simul"><keycap>D</keycap></keycombo> </shortcut> <guimenu>Quiz</guimenu> <guimenuitem>Ich weiß es nicht</guimenuitem>
