Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdeedu/kwordquiz.po
Languages: de

source: <action>Count</action> as error during a flashcard session. You can later repeat these cards by selecting <menuchoice><guimenu>Quiz</guimenu><guimenuitem>Repeat Errors</guimenuitem></menuchoice>.
de: <action>Zählt</action> diese Karte als falsche Antwort und zeigt die nächste Karte in einer Karteikartensitzung. Sie können diese Karten später wieder bearbeiten mit <menuchoice><guimenu>Quiz</guimenu><guimenuitem>Fehler wiederholen</guimenuitem></menuchoice>.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>H</keycap></keycombo> </shortcut> <guimenu>Quiz</guimenu> <guimenuitem>Hint</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>H</keycap></keycombo> </shortcut> <guimenu>Quiz</guimenu> <guimenuitem>Tipp</guimenuitem>

source: <action>Get</action> the next correct letter during a Question &amp; Answer session.
de: <action>Zeigt</action> den nächsten richtigen Buchstaben in einer Frage &amp; Antwort-Sitzung

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>B</keycap></keycombo> </shortcut> <guimenu>Quiz</guimenu> <guimenuitem>Play Audio</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>B</keycap></keycombo> </shortcut> <guimenu>Quiz</guimenu> <guimenuitem>Ton abspielen</guimenuitem>

source: <action>Play</action> sound that was linked to the entry with <menuchoice><guimenu>Vocabulary</guimenu> <guimenuitem>Link Sound</guimenuitem></menuchoice>.
de: <action>Spielt</action> eine Klangdatei ab, die dem aktuellen Eintrag durch <menuchoice><guimenu>Vokabeln</guimenu> <guimenuitem>Ton verknüpfen</guimenuitem></menuchoice> im Editormodus zugewiesen wurde.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>R</keycap></keycombo> </shortcut> <guimenu>Quiz</guimenu> <guimenuitem>Restart</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>R</keycap></keycombo> </shortcut> <guimenu>Quiz</guimenu> <guimenuitem>Neu starten</guimenuitem>

source: <action>Restart</action> the quiz session from the beginning. Will reset the scores.
de: <action>Startet</action> das Quiz neu von Anfang an und setzt die Punktwertung zurück.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>E</keycap></keycombo> </shortcut> <guimenu>Quiz</guimenu> <guimenuitem>Repeat Errors</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>E</keycap></keycombo> </shortcut> <guimenu>Quiz</guimenu> <guimenuitem>Fehler wiederholen</guimenuitem>

source: <action>Repeat</action> any questions you answered incorrectly. Becomes available once you have answered all questions once.
de: <action>Wiederholt</action> jede Frage , die Sie falsch beantwortet haben. Kann erst dann ausgewählt werden, wenn Sie alle Fragen einmal beantwortet haben.

source: <guimenu>Quiz</guimenu> <guimenuitem>Export Errors As...</guimenuitem>
de: <guimenu>Quiz</guimenu> <guimenuitem>Fehler exportieren als ...</guimenuitem>

source: <action>Export</action> any questions you answered incorrectly as a new vocabulary document. Becomes available once you have answered all questions once.
de: <action>Exportiert</action> alle Fragen, die Sie falsch beantwortet haben, in ein neues Vokabeldokument. Kann erst dann ausgewählt werden, wenn Sie alle Fragen einmal beantwortet haben.

source: The Settings Menu
de: Das Menü <quote>Einstellungen</quote>

source: <guimenu>Settings</guimenu> <guimenuitem>Show Search</guimenuitem>
de: <guimenu>Einstellungen</guimenu><guimenuitem>Suche anzeigen</guimenuitem>

source: <action>Toggle</action> display of the search bar.
de: <action>Schaltet</action> die Anzeige der Suchleiste an bzw. aus.

source: <guimenu>Settings</guimenu> <guisubmenu>Toolbars</guisubmenu> <guimenuitem>Main Toolbar</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guisubmenu>Werkzeugleisten</guisubmenu> <guimenuitem>Haupt-Werkzeugleiste</guimenuitem>

source: <action>Toggle</action> the Main Toolbar
de: <action>Schaltet</action> die Anzeige der Haupt-Werkzeugleiste ein oder aus

source: <guimenu>Settings</guimenu> <guisubmenu>Toolbars</guisubmenu> <guimenuitem>Quiz</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>Werkzeugleisten</guimenuitem> <guimenuitem>Quiz</guimenuitem>

source: <action>Toggle</action> the Quiz Toolbar
de: <action>Schaltet</action> die Anzeige der Quiz-Werkzeugleiste ein oder aus

source: <guimenu>Settings</guimenu> <guisubmenu>Toolbars</guisubmenu> <guimenuitem>Special Characters</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>Werkzeugleisten</guimenuitem> <guimenuitem>Sonderzeichen</guimenuitem>

source: <action>Toggle</action> the Special Characters Toolbar
de: <action>Schaltet</action> die Anzeige der ‚Sonderzeichen‘-Werkzeugleiste ein oder aus

source: <guimenu>Settings</guimenu> <guimenuitem>Show Statusbar</guimenuitem>
de: <guimenu>Einstellungen</guimenu><guimenuitem>Statusleiste anzeigen</guimenuitem>

source: <action>Toggle</action> the Statusbar
de: <action>Schaltet</action> die Anzeige der Statusleiste an bzw. aus

source: <guimenu>Settings</guimenu> <guimenuitem>Configure Shortcuts...</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>Kurzbefehle festlegen ...</guimenuitem>

source: <action>Configure</action> the keyboard keys you use to access the different actions.
de: <action>Einrichten</action> von Tastenkombinationen für den Aufruf unterschiedlicher Aktionen.

source: <guimenu>Settings</guimenu> <guimenuitem>Configure Toolbars...</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>Werkzeugleisten einrichten ...</guimenuitem>

source: <action>Configure</action> the items you want to put in the toolbar
de: <action>Einrichten</action> der Einträge für Werkzeugleisten.

source: <guimenu>Settings</guimenu> <guimenuitem>Configure Notifications...</guimenuitem>
de: <guimenu>Einstellungen</guimenu><guimenuitem>Benachrichtigungen festlegen ...</guimenuitem>

source: <action>Configure</action> notifications for certain events in &kwordquiz;
de: <action>Einrichten</action> Benachrichtigungen für bestimmte Ereignisse in &kwordquiz;

source: <guimenu>Settings</guimenu> <guimenuitem>Configure &kwordquiz;...</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>&kwordquiz; einrichten ...</guimenuitem>

source: <action>Configure</action> preferences for the vocabulary editor and the quizzes. Displays a <link linkend="dlg-config-editor">dialog</link>.
de: <action>Einrichten</action> der Voreinstellungen für den Vokabeleditor und die Quizsitzungen. Öffnet einen <link linkend="dlg-config-editor">Dialog</link>.

source: The Help Menu
de: Das Menü <quote>Hilfe</quote>

source: <title>The Main Window</title>
de: <title>Das Hauptfenster</title>

source: The main window has a navigation panel on the left side from which the main components of the program can be activated.
de: Im Hauptfenster gibt es links eine Seitenleiste, in der Sie die wichtigsten Funktionen des Programms starten können.

source: The <link linkend="editor">editor</link> can be activated by pressing <menuchoice><shortcut><keycombo action="simul"><keycap>F6</keycap></keycombo></shortcut><interface></interface></menuchoice>.
de: Den <link linkend="editor">Editor </link> starten Sie mit <menuchoice><shortcut><keycombo action="simul"><keycap>F6</keycap></keycombo></shortcut><interface></interface></menuchoice>.

source: A <link linkend="flashcard">flashcard</link> session can be started by pressing <menuchoice><shortcut><keycombo action="simul"><keycap>F7</keycap></keycombo></shortcut><interface></interface></menuchoice>.
de: Eine <link linkend="flashcard">Karteikarten</link>-Sitzung können Sie mit <menuchoice><shortcut><keycombo action="simul"><keycap>F7</keycap></keycombo></shortcut><interface></interface></menuchoice> starten.

source: A <link linkend="multiple">multiple choice</link> session can be started by pressing <menuchoice><shortcut><keycombo action="simul"><keycap>F8</keycap></keycombo></shortcut><interface></interface></menuchoice>.
de: Eine <link linkend="multiple">Mehrfachauswahl</link>-Sitzung können Sie mit <menuchoice><shortcut><keycombo action="simul"><keycap>F8</keycap></keycombo></shortcut><interface></interface></menuchoice> starten.

source: A <link linkend="question-and-answer">question and answer</link> session can be started by pressing <menuchoice><shortcut><keycombo action="simul"><keycap>F9</keycap></keycombo></shortcut><interface></interface></menuchoice>.
de: Eine <link linkend="question-and-answer">Frage und Antwort</link>-Sitzung können Sie mit <menuchoice><shortcut><keycombo action="simul"><keycap>F9</keycap></keycombo></shortcut><interface></interface></menuchoice> starten.

source: <screeninfo>The Main Window</screeninfo>
de: <screeninfo>Das Hauptfenster</screeninfo>

source: <phrase>The Main Window</phrase>
de: <phrase>Das Hauptfenster</phrase>

source: <title>The Vocabulary Editor</title>
de: <title>Der Vokabeleditor</title>

source: The vocabulary document area has the appearance of a spreadsheet-like grid. The grid consists of cells organized in two columns and a number of rows. Each column and row has a header. The column headers are used to specify the titles of the vocabulary document. They can be set by selecting <menuchoice><guimenu>Vocabulary</guimenu><guimenuitem>Column Settings...</guimenuitem></menuchoice>. The row headers number the rows consecutively.
de: Das Vokabeldokument wird als Gitter wie in einer Tabellenkalkulation dargestellt. Die Zellen im Gitter sind zweispaltig angeordnet. Jede Spalte und Zeile hat einen Titel. Die Spaltenköpfe zeigen die Titel des Vokabeldokuments an. Mit <menuchoice><guimenu>Vokabeln</guimenu><guimenuitem>Spalteneinstellungen ...</guimenuitem></menuchoice> kann die Beschriftung der Spaltentitel geändert werden. Die Zeilentitel werden fortlaufend durchnummeriert.

source: The column headers can also be used to sort the vocabulary. Simply click on the header of the column you want to sort by.
de: Die Spaltentitel können Sie außerden dazu benutzen, um das Vokabular zu sortieren. Klicken Sie dazu auf den Titel der Spalte, in der die Einträge sortiert werden sollen.

source: You can click in a cell of the grid to make it the active cell. You can select several cells for copying or other editing by dragging over them with the left mouse button down. To select entire rows click in the header.
de: Sie können in eine Zelle des Gitters klicken und sie dadurch aktivieren. Durch Ziehen über mehrere Zellen mit gedrückter linker Maustaste wählen Sie diese Zellen für Kopieren oder eine andere Bearbeitung aus. Um eine ganze Zeile zu markieren, klicken Sie auf den Kopf der Zeile.

source: <screeninfo>The Vocabulary Editor</screeninfo>
de: <screeninfo>Der Vokabeleditor</screeninfo>

source: <phrase>The Vocabulary Editor</phrase>
de: <phrase>Der Vokabeleditor</phrase>

source: In the document you build a vocabulary of pair-wise entries in the two columns. You can enter text into the active cell simply by starting to type. The cell will now be in edit mode and you can select all or part of the text. You can also edit a cell by double-clicking it or pressing F2 and make changes directly in the cell.
de: Im Dokument erstellen Sie ein Vokabular aus paarweisen Einträgen in zwei Spalten. Text geben Sie in die aktive Zelle ein, indem Sie einfach tippen. Die Zelle ist jetzt im Bearbeitungsmodus und Sie können den Text ganz oder teilweise markieren. Durch Doppelklick mit der Maus in die Zelle oder F2 bearbeiten Sie den Text direkt in der Zelle.

source: When you have finished typing one entry, press the return key and the next cell will automatically become active. Hence, it's easy to quickly type several entries. You can customize this behavior by selecting <menuchoice><guimenu>Settings</guimenu><guimenuitem>Configure &kwordquiz;...</guimenuitem></menuchoice>. When you reach the bottom row of the grid, a new row will be added as you press return, so you can just continue to type. When a new window is created it has 20 rows, but there is really no limit to the number of rows you can have in a document.
de: Wenn Sie mit der Bearbeitung oder Eingabe fertig sind, drücken Sie die Eingabetaste und die nächste Zelle wird aktiviert. So können Sie einfach mehrere Einträge eingeben. Dieses Verhalten können Sie mit <menuchoice><guimenu>Einstellungen</guimenu><guimenuitem>&kwordquiz; einrichten ...</guimenuitem></menuchoice> verändern. Wenn Sie in der letzten Zeile des Gitters die Eingabetaste drücken, wird eine neue Zeile angefügt und Sie können einfach weiterschreiben. Ein neues Fenster hat 20 Zeilen, diese Anzahl ist in einem Dokument jedoch nicht begrenzt.

source: <title>Flashcard Session</title>
de: <title>Karteikarten-Sitzung</title>

source: Select Flashcard from the navigation panel to start a flashcard session on the entries of the active vocabulary document. The mode selected in the <guimenu>Mode</guimenu> menu will be used. If you change mode during a session, the session will be restarted.
de: Mit Klicken auf Karteikarten in der Seitenleiste starten Sie eine Karteikartensitzung mit den Einträgen des geöffneten Vokabeldokuments im dem Modus, der im Menü <guimenu>Modus</guimenu> eingestellt ist. Wenn Sie den Modus während einer Sitzung ändern, wird sie neu gestartet.

source: If you are working with long expressions the window can be resized to make more space available. The font size will also influence how much will fit in the different parts of the window. By selecting <menuchoice><guimenu>Settings</guimenu><guimenuitem>Configure &kwordquiz;...</guimenuitem></menuchoice> you can configure the appearance of the flashcards.
de: Wenn Sie mit langen Ausdrücken arbeiten, können Sie das Fenster vergrößern, um mehr Platz zu erhalten. Auch die Schriftgröße beeinflusst den Platz in den einzelnen Teilen des Fensters. Mit <menuchoice><guimenu>Einstellungen</guimenu><guimenuitem>&kwordquiz; einrichten ...</guimenuitem></menuchoice> können die Schrift für die Karteikarten einstellen.

source: <screeninfo>Flashcard Session</screeninfo>
de: <screeninfo>Karteikarten-Sitzung</screeninfo>

source: <phrase>Flashcard Session</phrase>
de: <phrase>Karteikarten-Sitzung</phrase>

source: Initially the front of the card is displayed. Use <menuchoice><guimenu>Quiz</guimenu><guimenuitem>Check</guimenuitem></menuchoice> to see the other side.
de: Zu Beginn wird die Vorderseite der Karte angezeigt. Mit <menuchoice><guimenu>Quiz</guimenu><guimenuitem>Überprüfen</guimenuitem></menuchoice> blättern Sie die Karte um.

source: To move on to the next card either select <menuchoice><guimenu>Quiz</guimenu><guimenuitem>I Know</guimenuitem></menuchoice> to count the card as correct or <guimenu>Quiz</guimenu><guimenuitem>I Don't Know</guimenuitem> to count the card as incorrect.
de: Um die nächste Karte zu sehen, wählen Sie entweder <menuchoice><guimenu>Quiz</guimenu><guimenuitem>Ich weiß es</guimenuitem></menuchoice>, um die aktuelle Karte als richtige Antwort zu zählen, oder <guimenu>Quiz</guimenu><guimenuitem>Ich weiß es nicht</guimenuitem>, das zählt die aktuelle Karte als falsch.

source: Select <menuchoice><guimenu>Quiz</guimenu><guimenuitem>Repeat Errors</guimenuitem></menuchoice> to repeat the cards you have counted as incorrect.
de: Wählen Sie <menuchoice><guimenu>Quiz</guimenu><guimenuitem>Fehler wiederholen</guimenuitem></menuchoice>, um die falsch beantworteten Karten wieder zu bearbeiten.

source: Select <menuchoice><guimenu>Quiz</guimenu><guimenuitem>Restart</guimenuitem></menuchoice> to start the session from the beginning again. If you are using a random mode the cards will be reshuffled.
de: Wählen Sie <menuchoice><guimenu>Quiz</guimenu><guimenuitem>Neu starten</guimenuitem></menuchoice>, um die Sitzung nochmal vom Anfang zu wiederholen. Im Zufallsmodus werden dann die Karten neu gemischt.

source: The score sections at the bottom of the screen shows the number of cards, the number of cards you have seen, the number of cards counted as correct, and the number counted as incorrect.
de: Im Punktwertung am unteren Bildschirmrand wird die Anzahl aller Karten, die Anzahl der bearbeiten Karten und die Anzahl der richtig und falsch beantworteten Karten angezeigt .

source: All items on the <guimenu>Quiz</guimenu> menu are available on the Quiz toolbar that is displayed on the right by default.
de: Alle Einträge des Menü <guimenu>Quiz</guimenu> sind in der Quiz-Werkzeugleiste zu erreichen, die in der Standardeinstellung rechts angezeigt wird.

source: <title>Multiple Choice Session</title>
de: <title>Mehrfachauswahl-Sitzung</title>

source: Select Multiple Choice from the navigation panel to start a multiple choice quiz on the entries in the active vocabulary document. The mode selected in the <guimenu>Mode</guimenu> menu will be used. If you change mode during a session, the session will be restarted.
de: Mit Klicken auf Mehrfachauswahl in der Seitenleiste starten ein Mehrfachauswahl-Quiz mit dem aktiven Vokabeldokument im dem Modus, der im Menü <guimenu>Modus</guimenu> ausgewählt ist. Wenn Sie den Modus während einer Sitzung ändern, wird die Sitzung neu gestartet.

source: If you are working with long expressions the window can be resized to make more room. The font size (selected for the editor) will also influence how much will fit in the different parts of the window.
de: Wenn Sie mit langen Ausdrücken arbeiten, können Sie das Fenster vergrößern, um mehr Platz zu erhalten. Auch die Schriftgröße für den Editor beeinflusst den Platz in den einzelnen Teilen des Fensters.

source: In the example below the user gave an incorrect answer to the previous question. He/she is now about to answer the next question.
de: Im folgenden Beispiel war die Antwort auf die vorherige Frage falsch und jetzt wird die nächste Frage bearbeitet.

source: <screeninfo>Multiple Choice Session</screeninfo>
de: <screeninfo>Mehrfachauswahl-Sitzung</screeninfo>

source: <phrase>Multiple Choice Session</phrase>
de: <phrase>Mehrfachauswahl-Sitzung</phrase>

source: Your choices are shown on the top left. Select the one you think is correct. Use <menuchoice><guimenu>Quiz</guimenu><guimenuitem>Check</guimenuitem></menuchoice> to see if the answer is correct. If you have activated the automatic mode in <menuchoice><guimenu>Settings</guimenu><guimenuitem>Configure &kwordquiz;...</guimenuitem></menuchoice> your selection is checked immediately.
de: Wählen Sie aus den oben links angezeigten möglichen Antworten diejenige aus, die Sie für richtig halten. Mit <menuchoice><guimenu>Quiz</guimenu><guimenuitem>Überprüfen</guimenuitem></menuchoice> sehen Sie, ob Ihre Antwort richtig ist. Wenn sie automatisch in <menuchoice><guimenu>Einstellungen</guimenu><guimenuitem>&kwordquiz; einrichten ...</guimenuitem></menuchoice> gewählt haben, wird die Eingabe sofort geprüft.

source: The previous question is shown below the current. The answer you gave is also displayed. If you answered incorrectly the correct answer is shown.
de: Die vorherige Frage wird unter der aktuellen Frage angezeigt, ebenso Ihre Antwort. Bei einer falschen Antwort wird auch die richtige gezeigt.

source: Select <menuchoice><guimenu>Quiz</guimenu><guimenuitem>Repeat Errors</guimenuitem></menuchoice> to repeat the questions you answered incorrectly.
de: Wählen Sie <menuchoice><guimenu>Quiz</guimenu><guimenuitem>Fehler wiederholen</guimenuitem></menuchoice>, um die falsch beantworteten Karten wieder zu bearbeiten.

source: Select <menuchoice><guimenu>Quiz</guimenu><guimenuitem>Restart</guimenuitem></menuchoice> to start the session from the beginning again. If you are using a random mode the questions will be reshuffled.
de: Wählen Sie <menuchoice><guimenu>Quiz</guimenu><guimenuitem>Neu starten</guimenuitem></menuchoice>, um die Sitzung nochmal vom Anfang wiederholen. Im Zufallsmodus werden dann die Karten neu gemischt.

source: The score sections at the bottom of the screen shows the number of questions, the number of questions you have answered, the number of correct answers, and the number of incorrect answers.
de: Im Punktbereich am unteren Bildschirmrand wird die Anzahl aller Karten, die Anzahl der bearbeiten Karten und die Anzahl der richtig und falsch beantworteten Karten angezeigt .

source: <title>Question &amp; Answer Session</title>
de: <title>Frage &amp; Antwort-Sitzung</title>

source: Select Question &amp; Answer from the navigation panel to start a question &amp; answer session on the entries in the active vocabulary. The mode selected in the <guimenu>Mode</guimenu> menu will be used. If you change mode during a session, the session will be restarted.
de: Mit Klicken auf Frage &amp; Antwort in der Seitenleiste starten Sie eine Frage &amp; Antwort-Sitzung mit den Einträgen des geöffneten Vokabeldokuments im dem Modus, der im Menü <guimenu>Modus</guimenu> ausgewählt ist. Wenn Sie den Modus während einer Sitzung ändern, wird die Sitzung neu gestartet.

source: In the example below the user gave a correct answer to the previous question (to see how incorrect answers are handled, see the <link linkend="multiple">Multiple Choice</link> chapter). He/she is now about to answer the next question.
de: Im folgenden Beispiel war die Antwort auf die vorherige Frage richtig (wie falsche Antworten behandelt werden, finden Sie im Abschnitt <link linkend="multiple">Mehrfachauswahl</link>). Sie können jetzt die nächste Frage bearbeiten.

source: <screeninfo>Question &amp; Answer Session</screeninfo>
de: <screeninfo>Frage &amp; Antwort-Sitzung</screeninfo>

source: <phrase>Question &amp; Answer Session</phrase>
de: <phrase>Frage &amp; Antwort-Sitzung</phrase>

source: Your question is shown on the top left. Type your answer in the edit field. Use <menuchoice><guimenu>Quiz</guimenu><guimenuitem>Check</guimenuitem></menuchoice> or &Enter; to see if the answer is correct.
de: Die Frage wird oben links angezeigt. Geben Sie Ihre Antwort im Eingabefeld ein. Mit <menuchoice><guimenu>Quiz</guimenu><guimenuitem>Überprüfen</guimenuitem></menuchoice> oder &Enter; sehen Sie, ob Ihre Antwort richtig ist.

source: Select <menuchoice><guimenu>Quiz</guimenu><guimenuitem>Hint</guimenuitem></menuchoice> to get the next correct letter of the answer. In <menuchoice><guimenu>Settings</guimenu><guimenuitem>Configure &kwordquiz;...</guimenuitem></menuchoice> you can select that questions where you use the hint function are always counted as incorrect.
de: Wählen Sie <menuchoice><guimenu>Quiz</guimenu><guimenuitem>Tipp</guimenuitem></menuchoice> um den nächsten richtigen Buchstaben der Antwort zu sehen. In <menuchoice><guimenu>Einstellungen</guimenu><guimenuitem>&kwordquiz; einrichten ...</guimenuitem></menuchoice> können Sie einstellen, dass Fragen, bei denen Sie den Tipp benutzt haben, immer als falsch gezählt werden.

source: Fill-in-the-blank
de: Lückenfüllen

source: 'Fill-in-the-blank' is a powerful way to practice in &kwordquiz;. It is a special kind of question and answer quiz that needs to be described in more detail. In order to use this feature you must turn it on in the <link linkend="dlg-config-editor">configuration dialog</link>.
de: ‚Lückenfüllen‘ ist eine leistungsfähige Übung in &kwordquiz;. Es ist eine besondere Art des Frage &amp; Antwort Quiz und wird jetzt im einzelnen beschrieben. Um diese Übung zu benutzen, müssen Sie ‚Lückenfüllen‘ im <link linkend="dlg-config-editor">Dialog Eigenschaften</link> einstellen.

source: Consider the following table. It could be a vocabulary in &kwordquiz;:
de: Betrachten Sie die folgende Tabelle, ein Vokabular in &kwordquiz;:

source: English
de: Englisch

source: German
de: Deutsch

source: The important thing to note is the placement of the brackets. They tell &kwordquiz; how the quiz should be performed.
de: Beachten Sie die Anordnung der Klammern. Damit geben Sie &kwordquiz; an, wie das Quiz durchgeführt wird.
