Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdeedu/kwordquiz.po
Languages: de

source: In 1. there are no brackets. Assuming English is the question and German the answer you have to give the entire expression 'Wir besitzen einen Computer' for a correct answer.
de: In 1. gibt es keine Klammern. Angenommen die Fragen sind in englisch und die Antworten in deutsch, dann müssen Sie den ganzen Satz ‚Wir besitzen einen Computer‘ für eine richtige Antwort eingeben.

source: In 2. &kwordquiz; would display the question but also 'Wir ........ einen Computer'. For a correct answer it is sufficient to write 'besitzen'.
de: In 2. zeigt &kwordquiz; die gleiche Frage, aber dann ‚Wir ........ einen Computer‘. Für eine richtige Antwort reicht es, ‚besitzen‘ einzugeben.

source: 3. shows that a blank can consist of more than one word. The correct answer is 'besitzen einen'.
de: Nr. 3. zeigt, das Lücken auch aus mehreren Worten bestehen können. Die richtige Antwort ist ‚besitzen einen‘.

source: In 4. there are two separate blanks. To specify that in the answer you have to write 'besitzen; Computer', i.e separate the blanks with a semicolon in order to get a correct answer.
de: In 4. gibt es zwei getrennte Lücken. In der Antwort müssen Sie dann ‚besitzen; Computer‘, schreiben, also mit einem Semikolon zwischen den Lücken, um eine richtige Antwort zu geben.

source: Marked blanks are only of relevance if they appear in the answer. Otherwise the brackets are ignored. Furthermore, brackets have no effect in multiple choice quizzes. To simplify the creation of 'Fill-in-the-blank' vocabularies there are menu commands to mark and unmark blanks. Of course you can also just type the brackets. &kwordquiz; checks the syntax. If the text appears in red there is something wrong with the brackets and a quiz cannot be started.
de: Markierte Lücken haben nur in der Antwort eine Bedeutung. Sonst werden die Klammern ignoriert. Außerdem haben Klammern in Mehrfachauswahlsitzungen keine Auswirkungen. Um Vokabeldokumente mit ‚Lücken füllen‘ möglichst einfach zu erstellen, gibt es Befehle im Menü zum Erstellen und Löschen von Lücken. Natürlich können Sie die Klammern auch direkt eingeben. &kwordquiz; überprüft die Syntax. Wenn der Text rot dargestellt wird, sind Fehler in der Klammersetzung und das Quiz kann nicht gestartet werden.

source: The 'Fill-in-the-blank' features can be turned on and off in the Configuration dialog. Turning them off will make it possible to use fonts that map other characters to the positions of the brackets. It will also speed up performance slightly.
de: Die Funktionen zum ‚Lückentext‘ können im Einstellungsdialog ein- und ausgeschaltet werden. Ist ‚Lückentext aktivieren‘ ausgeschaltet, können auch Schriften benutzt werden, bei denen im Zeichensatz andere Zeichen an der Position der Klammern stehen. Auch wird dann die Arbeitsgeschwindigkeit ein wenig größer.

source: Printing
de: Drucken

source: &kwordquiz; provides the ability to print vocabulary documents in several different ways. When selecting <menuchoice><guimenu>File</guimenu><guimenuitem>Print...</guimenuitem></menuchoice> you are presented with the standard &kde; print dialog. In order to get access to the special &kwordquiz; features you need to click on the <guibutton>Options&gt;&gt;</guibutton> to see the <guilabel>Vocabulary Options</guilabel> tab. On this tab you can select to print the document as a vocabulary list (&ie; as displayed in the editor), a vocabulary exam, or as flashcards.
de: Mit &kwordquiz; können Sie Vokabeldokumente auf unterschiedliche Arten drucken. Mit <menuchoice><guimenu>Datei</guimenu><guimenuitem>Drucken ...</guimenuitem></menuchoice> erscheint der Standard-&kde;-Druckdialog. Um die besonderen Eigenschaften von &kwordquiz; auswählen zu können, müssen Sie auf <guibutton>Optionen &gt;&gt;</guibutton> klicken, um die Karteikarte <guilabel>Vokabeleinstellungen</guilabel> zu sehen. Hier können Sie einstellen, ob das Dokument als Vokabelliste (&ie; wie in der Editoranzeige), als Vokabelprüfung oder als Karteikarten gedruckt wird.

source: <screeninfo>Vocabulary Printing Options</screeninfo>
de: <screeninfo>Vokabeldruckoptionen</screeninfo>

source: <phrase>Vocabulary Printing Options</phrase>
de: <phrase>Vokabeldruckoptionen</phrase>

source: Vocabulary list
de: Vokabelliste

source: The vocabulary will be printed as displayed in the editor. This includes font, row heights, and column widths. Make sure that the columns are narrow enough to fit on the page.
de: Die Vokabeln werden wie in der Editoransicht gedruckt, einschließlich Schrift, Zeilenhöhe und Spaltenbreite. Überprüfen Sie, ob die Spalten schmal genug eingestellt sind, damit beide auf eine Seitenbreite passen.

source: <screeninfo>Print Vocabulary List</screeninfo>
de: <screeninfo>Vokabelliste drucken</screeninfo>

source: <phrase>Print Vocabulary List</phrase>
de: <phrase>Vokabelliste drucken</phrase>

source: Vocabulary exam
de: Vokabelprüfung

source: The vocabulary will be printed as displayed in the editor, except that the right column will be left empty and a third column for scoring is added. Settings used include font, row heights, and column widths. Make sure that the columns are narrow enough to fit on the page.
de: Die Vokabeln werden wie in der Editoransicht gedruckt, einschließlich Schrift, Zeilenhöhe und Spaltenbreite. Die rechte Spalte bleibt aber leer und eine dritte Spalte für die Bewertung wird hinzugefügt, Überprüfen Sie, ob die Spalten schmal genug eingestellt sind, damit sie auf eine Seitenbreite passen.

source: <screeninfo>Print Vocabulary Exam</screeninfo>
de: <screeninfo>Vokabelprüfung drucken</screeninfo>

source: <phrase>Print Vocabulary Exam</phrase>
de: <phrase>Vokabelprüfung drucken</phrase>

source: Flashcards
de: Karteikarten

source: Two 3" x 5" cards per page. The cards will always be printed in landscape.
de: Zwei Karten werden immer nebeneinander auf einer Seite im Querformat gedruckt.

source: <screeninfo>Print Flashcards</screeninfo>
de: <screeninfo>Karteikarten drucken</screeninfo>

source: <phrase>Print Flashcards</phrase>
de: <phrase>Karteikarten drucken</phrase>

source: The Tutor Mode
de: Der Tutormodus

source: &kwordquiz; can be started in the Tutor mode. In this mode application pops up words in the chosen vocabulary randomly at certain time intervals. To start &kwordquiz; in the Tutor mode press <keycombo>&Alt;<keycap>F2</keycap></keycombo> and enter <userinput><command>kwordquiz</command> <option>-g tutor <replaceable>vocabulary_file.kvtml</replaceable></option></userinput>. The part with <replaceable>vocabulary_file.kvtml</replaceable> can be omitted.
de: &kwordquiz; kann im Tutormodus gestartet werden. In diesem Modus erscheinen Karteikarten aus der gewählten Vokabeldatei in bestimmten Zeitintervallen. Um &kwordquiz; in diesem Modus zu starten, drücken Sie <keycombo>&Alt;<keycap>F2</keycap></keycombo> und geben dann <userinput><command>kwordquiz</command> <option>-g tutor <replaceable>vokabel_datei.kvtml</replaceable></option></userinput> ein. Die Angabe einer <replaceable>vokabel_datei.kvtml</replaceable> ist nicht erforderlich.

source: <screeninfo>Welcome message of the Tutor mode</screeninfo>
de: <screeninfo>Startbildschirm des Tutormodus</screeninfo>

source: <phrase>Welcome message of the Tutor mode</phrase>
de: <phrase>Startbildschirm des Tutormodus</phrase>

source: After pressing <guibutton>OK</guibutton> button, &kwordquiz; continues to work in background. You can control &kwordquiz; using tray icon <inlinemediaobject> <imageobject> <imagedata fileref="kwordquiz-icon.png" format="PNG"/> </imageobject> </inlinemediaobject> menu (it can be opened with &RMB; click on the icon).
de: Nach dem Drücken von <guibutton>OK</guibutton> läuft &kwordquiz; im Hintergrund weiter. Sie können &kwordquiz; mit dem Kontextmenü des Symbols <inlinemediaobject> <imageobject> <imagedata fileref="kwordquiz-icon.png" format="PNG"/> </imageobject> </inlinemediaobject> in der Kontrollleiste kontrollieren. Das Kontextmenü öffnen Sie mit Klicken der &RMBn; auf das Symbol.

source: There are four items in this menu:
de: Es gibt vier Einträge in diesem Menü:

source: Start Exercise
de: Übung starten

source: <action>Start</action> the Tutor exercise.
de: <action>Startet</action> die Tutorübung.

source: Open...
de: Öffnen ...

source: <action>Open</action> an existing vocabulary document.
de: <action>Öffnet</action> ein vorhandenes Vokabeldokument.

source: Configure &kwordquiz; Tutor...
de: &kwordquiz;-Tutor einrichten ...

source: <action>Open</action> the Tutor configuration dialog.
de: <action>Öffnet</action> den Einrichtungsdialog für den Tutormodus.

source: <screeninfo>The Tutor Settings page</screeninfo>
de: <screeninfo>Die Einstellungsseite für den Tutormodus</screeninfo>

source: <phrase>The Tutor Settings page</phrase>
de: <phrase>Die Einstellungsseite für den Tutormodus</phrase>

source: Using the <guilabel>Tutor Settings</guilabel> page you can configure time intervals between the flashcards changes, flashcard appearance, and choose the option to <guilabel>Start exercise as soon as the user opens vocabulary file</guilabel>.
de: Auf der Seite <guilabel>Tutor-Einstellungen</guilabel> können Sie die Zeitintervalle zwischen dem Wechseln von Karteikarten und das Erscheinungsbild der Karten ändern und die Option <guilabel>Übung beginnen, sobald die Vokabeldatei geöffnet wird</guilabel> aktivieren.

source: In the current version, you can choose between <guilabel>Native</guilabel> and <guilabel>Minimalistic</guilabel> flashcard appearances.
de: In der aktuellen Version können Sie zwischen <guilabel>Nativem</guilabel> and <guilabel>Minimalistischem</guilabel> Erscheinungsbild der Karteikarten wählen.

source: <screeninfo>The Native flashcard appearance</screeninfo>
de: <screeninfo>Das native Erscheinungsbild der Karteikarten</screeninfo>

source: <phrase>The Native flashcard appearance</phrase>
de: <phrase>Das native Erscheinungsbild der Karteikarten</phrase>

source: Use Native appearance for the fancy vocabularies with images.
de: Verwenden Sie das native Erscheinungsbild für ausgefallenen Vokabelsammlungen mit Bildern.

source: <screeninfo>The Minimalistic flashcard appearance</screeninfo>
de: <screeninfo>Das minimalistische Erscheinungsbild der Karteikarten</screeninfo>

source: <phrase>The Minimalistic flashcard appearance</phrase>
de: <phrase>Das minimalistische Erscheinungsbild der Karteikarten</phrase>

source: Use Minimalistic appearance for the simple vocabularies.
de: Verwenden Sie das minimalistische Erscheinungsbild für einfache Vokabelsammlungen.

source: <screeninfo>The Shortcuts Settings page</screeninfo>
de: <screeninfo>Die Seite Einstellungen der Kurzbefehle</screeninfo>

source: <phrase>The Shortcuts Settings page</phrase>
de: <phrase>Die Seite Einstellungen der Kurzbefehle</phrase>

source: Using the <guilabel>Shortcuts Settings</guilabel> page you can configure shortcuts for the Tutor actions. The defaults are <keycombo>&Ctrl;&Alt;<keycap>J</keycap></keycombo> for the closing and <keycombo>&Ctrl;&Alt;<keycap>H</keycap></keycombo> for the flipping of the flashcard.
de: Auf der Seite <guilabel>Kurzbefehle</guilabel> können Sie Tastenkombinationen für Tutoraktionen einrichten. Als Voreinstellung sind <keycombo>&Ctrl;&Alt;<keycap>J</keycap></keycombo> für das Schließen und <keycombo>&Ctrl;&Alt;<keycap>H</keycap></keycombo> für das Umdrehen einer Karteikarte eingestellt.

source: Quit
de: Beenden

source: <action>Quit</action> &kwordquiz;.
de: <action>Beendet</action> &kwordquiz;

source: Dialogs
de: Dialoge

source: <title>General Settings</title>
de: <title>Allgemeine Einstellungen</title>

source: <screeninfo>General Settings</screeninfo>
de: <screeninfo>Allgemeine Einstellungen</screeninfo>

source: <phrase>General Settings</phrase>
de: <phrase>Allgemeine Einstellungen</phrase>

source: You can select what type of session a newly opened vocabulary should start in. Going directly to a quiz can prevent you from seeing any entries in advance.
de: Auf dieser Seite können Sie einstellen, mit welcher Funktion neu geladene Vokabeldokumente gestartet werden. Falls Sie hier &eg; Karteikartenquiz einstellen, werden die Vokabeln gar nicht erst angezeigt und sofort mit dem Quiz begonnen.

source: Select <guibutton>Defaults</guibutton> to restore all settings to predefined defaults. Select <guibutton>Apply</guibutton> to make your changes without closing the dialog. Select <guibutton>OK</guibutton> to make your changes and close the dialog. Select <guibutton>Cancel</guibutton> to close the dialog without making any changes.
de: Mit <guibutton>Voreinstellungen</guibutton> setzen Sie alles wieder auf die vordefinierten Standardwerte. Wählen Sie <guibutton>Anwenden</guibutton> für Änderungen, ohne den Dialog zu schließen. <guibutton>OK</guibutton> übernimmt die Änderungen und schließt den Dialog. <guibutton>Abbrechen</guibutton> schließt den Dialog, ohne Änderungen zu übernehmen.

source: <title>Editor Settings</title>
de: <title>Einstellungen zur Texteingabe</title>

source: <screeninfo>Editor Settings</screeninfo>
de: <screeninfo>Einstellungen zur Texteingabe</screeninfo>

source: <phrase>Editor Settings</phrase>
de: <phrase>Einstellungen zur Texteingabe</phrase>

source: You can configure the behavior of the &Enter; key when working in the editor.
de: Sie können das Verhalten der &Enter;taste für das Arbeiten im Editor einstellen.

source: You can also select if the functions for <link linkend="fill-in-the-blank">Fill-in-the-blank</link> should be activated. Turning them off will speed up performance a little.
de: Wählen Sie, ob die Funktion <link linkend="fill-in-the-blank">Lücken füllen </link> eingeschaltet werden soll. Abschalten erhöht die Arbeitsgeschwindigkeit ein wenig.

source: <title>Quiz Settings</title>
de: <title>Quizeinstellungen</title>

source: <screeninfo>Quiz Settings</screeninfo>
de: <screeninfo>Quizeinstellungen</screeninfo>

source: <phrase>Quiz Settings</phrase>
de: <phrase>Quizeinstellungen</phrase>

source: For flashcard sessions you can select if the cards should be flipped automatically, and if they should be counted as correct or incorrect. Enter a time delay in seconds for the automatic flipping.
de: Für eine Karteikartensitzung können Sie einstellen, ob die Karten automatisch umgedreht werden, und ob sie dann als richtig oder falsch gezählt werden sollen. Geben Sie eine Zeit in Sekunden für das automatische Umdrehen an.

source: For multiple choice sessions you can select if your choice should be checked immediately or if you have to select <menuchoice><guimenu>Quiz</guimenu><guimenuitem>Check</guimenuitem></menuchoice> first.
de: Für Mehrfachauswahlsitzungen können Sie wählen, ob Ihre Auswahl sofort überprüft wird, oder ob Sie erst <menuchoice><guimenu>Quiz</guimenu><guimenuitem>Überprüfen</guimenuitem></menuchoice> wählen müssen.

source: For question &amp; answer sessions you can select if questions where you use <menuchoice><guimenu>Quiz</guimenu><guimenuitem>Hint</guimenuitem></menuchoice> should be counted as incorrect.
de: Für Frage &amp; Antwort-Sitzungen können Sie einstellen, ob Fragen, bei denen Sie <menuchoice><guimenu>Quiz</guimenu><guimenuitem>Tipp</guimenuitem></menuchoice> gewählt haben, als falsch gezählt werden sollen.

source: For all sessions you can select if the scores should be displayed as percent instead of absolute numbers.
de: Für alle Sitzungen können Sie angeben, ob die Ergebnisse als Prozentzahl oder als absolute Zahlen angezeigt werden sollen.

source: <title>Flashcard Appearance Settings</title>
de: <title>Erscheinungsbild zum Erscheinungsbild von Karteikarten</title>

source: <screeninfo>Flashcard Appearance Settings</screeninfo>
de: <screeninfo>Erscheinungsbild zum Erscheinungsbild von Karteikarten</screeninfo>

source: <phrase>Flashcard Appearance Settings</phrase>
de: <phrase>Erscheinungsbild zum Erscheinungsbild von Karteikarten</phrase>

source: For flashcard sessions you can select the <guilabel>Font:</guilabel> and the colors of text, card and frames. Click the <guibutton>Flip</guibutton> to switch between the <guilabel>Front</guilabel> and the <guilabel>Back</guilabel> of the cards.
de: Für Karteikartensitzungen können Sie die <guilabel>Schriftart:</guilabel> und die Textfarbe, Kartenfarbe und Rahmenfarbe auswählen. Klicken Sie auf <guibutton>Umdrehen</guibutton>, um zwischen der <guilabel>Vorderseite</guilabel> und der <guilabel>Rückseite</guilabel> der Karten zu wechseln.

source: <title>Special Characters Settings</title>
de: <title>Einstellungen für Sonderzeichen</title>

source: <screeninfo>Special Characters Settings</screeninfo>
de: <screeninfo>Einstellungen für Sonderzeichen</screeninfo>

source: <phrase>Special Characters Settings</phrase>
de: <phrase>Einstellungen für Sonderzeichen</phrase>

source: Nine configurable actions are available for insertion of special characters into the vocabulary. Select one of the actions in the list and then click the <guibutton>Character...</guibutton> button to <link linkend="dlg-special-characters">select</link> a character for that action. A larger preview of the current character is displayed.
de: Neun einstellbare Aktionen ermöglichen die Eingabe von Sonderzeichen in das Vokabular. Wählen Sie eine Aktion aus der Liste und klicken dann auf den Knopf <guibutton>Zeichen ...</guibutton>, um ein Zeichen für diese Aktion <link linkend="dlg-special-characters">auszuwählen</link>. Eine vergrößerte Vorschau des gewählten Zeichens wird angezeigt.

source: Changing the keyboard shortcut associated with each action can be done by selecting <menuchoice><guimenu>Settings</guimenu><guimenuitem>Configure Shortcuts...</guimenuitem></menuchoice>.
de: Die Kurzbefehle für jede Aktion können Sie mit <menuchoice><guimenu>Einstellungen</guimenu><guimenuitem>Kurzbefehle festlegen ...</guimenuitem></menuchoice> bestimmen.

source: <title>Column Settings</title>
de: <title>Spalteneinstellungen</title>

source: You can open this dialog from the menubar with <menuchoice><guimenu>Vocabulary</guimenu><guimenuitem>Column Settings...</guimenuitem></menuchoice>
de: Diesen Dialog öffnen Sie in der Menüleiste mit <menuchoice><guimenu>Vokabeln</guimenu><guimenuitem>Spalteneinstellungen ...</guimenuitem></menuchoice>

source: <screeninfo>Column Settings</screeninfo>
de: <screeninfo>Spalteneinstellungen</screeninfo>

source: <phrase>Column Settings</phrase>
de: <phrase>Spalteneinstellungen</phrase>

source: Use this dialog to define the column titles, keyboard layouts and widths of the vocabulary. Select <guibutton>OK</guibutton> to make your changes or <guibutton>Cancel</guibutton> to discard any changes.
de: In diesem Dialog geben Sie die Spaltentitel, die Tastaturbelegung und die Breite für das Vokabular ein. Wählen Sie <guibutton>OK</guibutton>, um Ihre Änderungen zu übernehmen oder <guibutton>Abbrechen</guibutton>, um sie zu verwerfen.

source: <title>Special Characters</title>
de: <title>Sonderzeichen</title>

source: Click the <guibutton>Character...</guibutton> button on the <guilabel>Special Characters</guilabel> page in &kwordquiz; settings dialog to open this window.
de: Klicken Sie auf den Knopf <guibutton>Zeichen ...</guibutton> auf der Seite <guilabel>Sonderzeichen</guilabel> des Einrichtungsdialogs von &kwordquiz;, um diese Fenster zu öffnen.

source: <screeninfo>Special Characters</screeninfo>
de: <screeninfo>Sonderzeichen</screeninfo>

source: <phrase>Special Characters</phrase>
de: <phrase>Sonderzeichen</phrase>

source: Use this dialog to select any special character you want to associate with the current special character <link linkend="dlg-config-characters">action</link>.
de: Mit diesem Dialog wählen Sie das Sonderzeichen, das Sie mit einem <link linkend="dlg-config-characters">Kurzbefehl</link> verbinden wollen.

source: Questions and Answers
de: Fragen und Antworten

source: Credits and License
de: Danksagungen und Lizenz

source: Program copyright 2003-2008 Peter B. Hedlund <email>peter.hedlund@kdemail.net</email>
de: Programm Copyright 2003-2008 Peter B. Hedlund <email>peter.hedlund@kdemail.net</email>

source: Documentation copyright 2003-2008 Peter B. Hedlund <email>peter.hedlund@kdemail.net</email>
de: Copyright der Dokumentation 2003-2008 Peter B. Hedlund <email>peter.hedlund@kdemail.net</email>

source: CREDIT_FOR_TRANSLATORS
de: <para>Übersetzung Burkhard Lück<email>lueck@hube-lueck.de</email></para>

source: How to obtain &kwordquiz;
de: Wie Sie &kwordquiz; erhalten

source: Compilation and installation
de: Kompilierung und Installation
