Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdeedu/marble.po
Languages: de

source: The &marble; Handbook
de: Das Handbuch zu &marble;

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Stephan</firstname><surname>Johach</surname><affiliation><address><email>hunsum@gmx.de</email></address></affiliation><contrib>Deutsche Übersetzung</contrib></othercredit>

source: &marble; is a geographical atlas and a virtual globe which lets you quickly explore places on our home planet. You can use &marble; to look up addresses, to easily create maps, measure distances and to retrieve detail information about locations that you have just heard about in the news or on the Internet. The user interface is clean, simple and easy to use.
de: &marble; ist ein geografischer Atlas und ein virtueller Globus, mit dem Sie ganz leicht Orte auf Ihrem Planeten erkunden können. Sie können &marble; dazu benutzen einen Adressen zu finden, auf einfache Art Karten zu erstellen, Entfernungen zu messen und Informationen über bestimmte Orte abzufragen, über die Sie gerade etwas in den Nachrichten gehört oder im Internet gelesen haben. Die Benutzeroberfläche ist klar, einfach und leicht zu bedienen.

source: education
de: Bildung

source: earth
de: Erde

source: globe
de: Globus

source: geography
de: Geografie

source: Introduction
de: Einleitung

source: Welcome to &marble;, a small interactive globe and geographical atlas that puts the world at your fingertips. Just like a real atlas or a conventional globe &marble; allows you to freely move across its map and lookup places. Furthermore &marble; allows you to zoom in and have many different views on the surface of the Earth. In its default configuration &marble; offers 11 different views: <guilabel>Atlas</guilabel>, <guilabel>OpenStreetMap</guilabel>, <guilabel>Satellite View</guilabel>, <guilabel>Earth at Night</guilabel>, <guilabel>Historical Map 1689</guilabel>, <guilabel>Moon</guilabel>, <guilabel>Plain Map</guilabel>, <guilabel>Precipitation (December)</guilabel>, <guilabel>Precipitation (July)</guilabel>, <guilabel>Temperature (December)</guilabel> and <guilabel>Temperature (July)</guilabel>.
de: Willkommen zu &marble;, einem kleinen interaktiven Globus und geografischen Atlas, der immer zur Hand ist. Wie bei einem richtiger Atlas oder Globus können Sie sich mit &marble; beliebig auf der Karte bewegen und nach Orten suchen. Darüber hinaus können Sie mit &marble; Ausschnitte vergrößern und die Erdoberfläche über viele verschiedene Ansichten betrachten. In der Voreinstellung bietet &marble; 11 verschiedene Ansichten: <guilabel>Atlas</guilabel>, <guilabel>OpenStreetMap</guilabel>, <guilabel>Satellitenansicht</guilabel>, <guilabel>Die Erde bei Nacht</guilabel>, <guilabel>Historische Karte 1689</guilabel>, <guilabel>Mond</guilabel>, <guilabel>Einfache Karte</guilabel>, <guilabel>Niederschlag (Dezember)</guilabel>, <guilabel>Niederschlag (Juli)</guilabel>, <guilabel>Temperatur (Dezember)</guilabel> und <guilabel>Temperatur (Juli)</guilabel>.

source: &marble; comes with a small database of more than 12,000 locations (cities, mountains, volcanoes) which can be searched for and which are integrated with Wikipedia. Additionally you can measure distances using &marble; between multiple measure points which can be set freely.
de: &marble; verfügt über eine kleine Datenbank von mehr als 12000 Orten (Städte, Berge, Vulkane) nach denen gesucht werden kann und die mit der Wikipedia verknüpft sind. Darüber hinaus können Sie mit &marble; Entfernungen zwischen mehreren frei platzierbaren Punkten messen.

source: &marble; is free software and licensed under the &GNU; Lesser General Public License.
de: &marble; ist freie Software und unter der &GNU; Lesser Public License lizensiert.

source: &marble; quick start guide: Navigation
de: &marble; Schnelleinstieg: Navigation

source: Here is &marble; the first time you run it, either with <menuchoice><guimenu>Applications</guimenu><guisubmenu>Education</guisubmenu><guimenuitem>Marble (Desktop Globe)</guimenuitem></menuchoice> from the &kmenu; or with <keycombo action="simul">&Alt;<keycap>F2</keycap></keycombo> and entering <command>marble</command> into the field.
de: Hier sehen Sie &marble;, nachdem Sie es zum ersten Mal gestartet haben, entweder aus dem &kmenu; mit <menuchoice><guimenu>Programme</guimenu><guisubmenu>Lernprogramme</guisubmenu><guisubmenu>Verschiedenes</guisubmenu><guimenuitem>Marble (Schreibtischglobus)</guimenuitem></menuchoice> oder mit <keycombo action="simul">&Alt;<keycap>F2</keycap></keycombo> und Eingabe von <command>marble</command> in das Textfeld.

source: <screeninfo>&marble; main window</screeninfo>
de: <screeninfo>Das Hauptfenster von &marble;</screeninfo>

source: <phrase>&marble; main window</phrase>
de: <phrase>Das Hauptfenster von &marble;</phrase>

source: On the right you can see a topographical map of our beautiful home planet. To allow for better orientation the map offers a scale bar in the lower left corner as well as a windrose on the top right. To navigate and to control the view you can use the tools on the <guilabel>Navigation</guilabel> info box at the right: Press the arrow buttons to rotate the globe. The <guilabel>Up</guilabel> and <guilabel>Down</guilabel> arrow buttons will tilt the earth axis back and forth. The <guilabel>Left</guilabel> and <guilabel>Right</guilabel> arrow buttons will make the earth spin around its physical axis.
de: Rechts sehen Sie eine topologische Karte unseres schönen Heimatplaneten. Zur besseren Orientierung bietet die Karte in der linken unteren Ecke einen Maßstab und rechts oben eine Windrose. Zum Navigieren und Steuern der Ansicht können Sie die Werkzeuge rechts auf dem Werkzeugkarte <guilabel>Navigation</guilabel> verwenden. Drücken Sie die Pfeiltasten, um den Globus zu rotieren. Die Pfeil-Knöpfe <guilabel>Nach oben</guilabel> und <guilabel>Nach unten</guilabel> kippen die Erdachse vor und zurück. Die Pfeil-Knöpfe <guilabel>Links</guilabel> und <guilabel>Rechts</guilabel> drehen die Erde um ihre physikalische Achse.

source: You can accomplish the same behavior by pressing the &LMB; somewhere on the globe and by moving the mouse while keeping the &LMB; pressed. Using this drag and drop style navigation will allow you to adjust the viewing angle much easier and more precisely. The cursor keys on your keyboard offer another alternative way to quickly change directions.
de: Dasselbe Verhalten erreichen Sie durch Drücken der &LMBn; wenn sich der Mauszeiger über dem Globus befindet und Bewegen der Maus bei gedrückter &LMBr;. Mit dieser Navigation durch <quote>Ziehen und Ablegen</quote> können Sie den Blickwinkel wesentlich einfacher und genauer justieren. Die Pfeiltasten auf der Tastatur sind eine weitere Alternative zur schnellen Änderung der Richtungen.

source: Zoom in and out by moving the vertical slider up and down. If your mouse has got a mouse wheel you can use that one instead - or you just hold the &LMB; and the &RMB; down both at once while moving the mouse up and down. Changing the zoom level step by step can be done via the <guilabel>Zoom In</guilabel> and <guilabel>Zoom Out</guilabel> buttons which are placed above and below the zoom slider (or using the <keycap>+</keycap> and <keycap>-</keycap> keys on your keyboard).
de: Mit dem senkrechten Schieberegler können Sie die Vergrößerung steuern. Wenn Ihre Maus über ein Mausrad verfügt, können Sie stattdessen auch dieses benutzen, oder bewegen Sie die Maus bei gleichzeitig gedrückter &LMBr; und &RMBr; auf und ab. Das schrittweise Ändern der Vergrößerung kann über die Knöpfe <guilabel>Vergrößern</guilabel> und <guilabel>Verkleinern</guilabel>, die sich oberhalb bzw. unterhalb des Schiebereglers befinden, durchgeführt werden. Alternativ können Sie auch die Tasten <keycap>+</keycap> und <keycap>-</keycap> verwenden.

source: Depending on the map's resolution zooming in will provide you with more detail. Smaller cities will appear and using the topographic map you might notice that coastlines are provided as vector graphics.
de: Abhängig von der Auflösung der Karte werden beim Vergrößern mehr Details angezeigt. Kleinere Städte erscheinen und bei der topografischen Karte wird Ihnen auffallen, dass die Küstenlinien als Vektorgrafiken bereitgestellt werden.

source: In case you should get lost you can always reset the viewing angle and zoom level back to the point where we started off: Just hit the <guilabel>Home</guilabel> button (or the <keycap>Home</keycap> button on your keyboard). To set the home location to the current position (center of the map) click on <guimenuitem>Set Home Location</guimenuitem> in the <guimenu>Bookmarks</guimenu> menu.
de: Falls Sie mal die Orientierung verlieren, können Sie den Blickwinkel und die Vergrößerungsstufe wieder auf die Anfangswerte zurücksetzen: Klicken Sie einfach auf das <guiicon>Haus</guiicon>-Symbol oder drücken Sie die Taste <keycap>Pos 1</keycap> auf Ihrer Tastatur. Um die aktuelle Position (Mitte der Karte) zur Startposition zu machen,wählen Sie <guilabel>Heimatort setzen</guilabel> im Menü <guimenu>Lesezeichen</guimenu>.

source: A click onto the status bar using the &RMB; offers a menu which lets you customize the appearance of the status bar. You can show the position, altitude, the current tile level and a progress indicator that displays the status of the map data download.
de: Klicken auf die Statusleiste mit der &RMBn; öffnet ein Menü, in dem das Aussehen der Statusleiste eingestellt werden kann. Die Position, Höhe, die aktuelle Kachel-Vergrößerungsstufe und eine Fortschrittsanzeige beim Herunterladen von Kartendaten kann angezeigt werden.

source: Choosing different map views for &marble;
de: Das Auswählen verschiedener Kartenansichten für &marble;

source: &marble; comes with 11 different views: <guilabel>Atlas</guilabel>, <guilabel>OpenStreetMap</guilabel>, <guilabel>Satellite View</guilabel>, <guilabel>Earth at Night</guilabel>, <guilabel>Historical Map 1689</guilabel>, <guilabel>Moon</guilabel>, <guilabel>Plain Map</guilabel>, <guilabel>Precipitation (December)</guilabel>, <guilabel>Precipitation (July)</guilabel>, <guilabel>Temperature (December)</guilabel> and <guilabel>Temperature (July)</guilabel>. You can choose among these by pressing the <guilabel>Map View</guilabel> tab on the bottom of &marble;'s toolbox:
de: &marble; verfügt über 11 unterschiedliche Ansichten: <guilabel>Atlas</guilabel>, <guilabel>OpenStreetMap</guilabel>, <guilabel>Satellitenansicht</guilabel>, <guilabel>Die Erde bei Nacht</guilabel>, <guilabel>Historische Karte 1689</guilabel>, <guilabel>Mond</guilabel>, <guilabel>Einfache Karte</guilabel>, <guilabel>Niederschlag (Dezember)</guilabel>, <guilabel>Niederschlag (Juli)</guilabel>, <guilabel>Temperatur (Dezember)</guilabel> und <guilabel>Temperatur (Juli)</guilabel>. Sie können zwischen diesen Ansichten umschalten, indem Sie den Reiter <guilabel>Kartenansicht</guilabel> bei den Werkzeugen von &marble; anklicken.

source: &marble; map views
de: &marble; Kartenansichten

source: &marble; Map Views
de: &marble; Kartenansichten

source: <guilabel>Atlas</guilabel>: A classic topographic map. It uses vector lines ( "MicroWorldDataBase II" ) to mark coastlines, country borders &etc; and bitmap graphics ( "SRTM30" ) to create the height relief.
de: <guilabel>Atlas</guilabel>: Eine klassische topografische Karte. Sie verwendet Vektorlinien ( <quote>MicroWorldDataBase II</quote> ) zur Markierung der Küstenlinien, Ländergrenzen &etc; und Bitmap-Grafiken (<quote>SRTM30</quote>) zur Darstellung der Höhenlinien.

source: <guilabel>OpenStreetMap</guilabel>: A global roadmap created by the OpenStreetMap (OSM) project. OSM is an open community which creates free editable maps. The OSM data was rendered using Mapnik.
de: <guilabel>OpenStreetMap</guilabel>: Eine globale Straßenkarte des Projektes OpenStreetMap (OSM). Bei OSM handelt es sich um eine offene Gemeinschaftsarbeit, die freies editierbares Kartenmaterial erstellt. Die OSM-Daten wurden mit Hilfe von Mapnik in grafische Karten umgewandelt.

source: <guilabel>Satellite View</guilabel>: Earth as seen from Space. The map is based on NASA's beautiful <ulink url="http://earthobservatory.nasa.gov/Features/BlueMarble/">Blue &marble; Next Generation</ulink> pictures. Credits: NASA’s Earth Observatory
de: <guilabel>Satellitenansicht</guilabel>: Die Erde vom Weltraum aus gesehen. Diese Karte basiert auf den wunderschönen <ulink url="http://earthobservatory.nasa.gov/Features/BlueMarble/">Blue Marble Next Generation</ulink> Bildern der NASA. Dank an: Erdobservatorium der NASA

source: <guilabel>Earth at Night</guilabel>: This image of Earth’s city lights was created with data from the Defense Meteorological Satellite Program (DMSP) Operational Linescan System (OLS).
de: <guilabel>Die Erde bei Nacht</guilabel>: Dieses Bild der Stadtlichter der Erde wurde aus den Daten des Defense Meteorological Satellite Program (DMSP) Operational Linescan System (OLS) erstellt.

source: <guilabel>Historical Map 1689</guilabel>: A historical world map from the year 1689 created by G. van Schagen in Amsterdam.
de: <guilabel>Historische Weltkarte</guilabel>: Eine historische Karte aus dem Jahr 1689, erstellt durch G. van Schagen in Amsterdam.

source: <guilabel>Moon</guilabel>: A map of the moon. The map is based on data from the Clementine Moon mission (UVVIS Basemap Mosaic). Credits: NASA/SDIO, Courtesy USGS Astrogeology Research Program.
de: <guilabel>Mond</guilabel>: Die Karte basiert auf Daten der Mondmission ‚Clementine‘ (Basiskartenmosaik UVVIS). Dank an: NASA/SDIO, mit freundlicher Genehmigung vom USGS Astrogeologischen Forschungsprogramm.

source: <guilabel>Plain Map</guilabel>: A plain map. It uses vector lines to mark coastlines and country borders &etc;
de: <guilabel>Einfache Karte</guilabel>: Eine klassische topografische Karte. Sie verwendet Vektorlinien zur Markierung der Küstenlinien, Ländergrenzen &etc;

source: <guilabel>Precipitation (December)</guilabel>: A map which shows the average precipitation in December.
de: <guilabel>Niederschlag (Dezember)</guilabel>: Eine Karte, die den durchschnittlichen Niederschlag im Dezember anzeigt.

source: <guilabel>Precipitation (July)</guilabel>: A map which shows the average precipitation (rain/snow/hail/etc) in July.
de: <guilabel>Niederschlag (Juli)</guilabel>: Eine Karte, die den durchschnittlichen Niederschlag (Regen/Schnee/Hagel/usw.) im Juli anzeigt.

source: <guilabel>Temperature (December)</guilabel>: A map which shows the average temperature in December.
de: <guilabel>Temperatur (Dezember)</guilabel>: Eine Karte, die die durchschnittliche Temperatur im Dezember anzeigt.

source: <guilabel>Temperature (July)</guilabel>: A map which shows the average temperature in July.
de: <guilabel>Temperatur (Juli)</guilabel>: Eine Karte, die die durchschnittliche Temperatur im Juli anzeigt.

source: Searching places using &marble;
de: Orte suchen mit &marble;

source: &marble; comes with a small database of more than 12,000 cities ( from <ulink url="http://www.worldgazetteer.com"></ulink> ) and a few mountains and volcanoes. You can find a location by entering its name into the search line on the top of the toolbox (&marble; always uses the native name in Latin letters). As you start typing, suggestions below the search line will appear like this:
de: &marble; verfügt über eine kleine Datenbank von mehr als 12000 Städten (von <ulink url="http://www.worldgazetteer.com"></ulink>) und einiger Berge und Vulkane. Sie können einen Ort durch Eingabe des Namens in das Suchfeld im Werkzeugbereich finden. &marble; verwendet immer den Originalnamen in lateinischer Schrift. Wenn Sie die ersten Zeichen eingegeben haben, werden Vorschläge unter dem Suchfeld wie im folgenden Bildschirmfoto angezeigt:

source: &marble; searching places
de: Ortssuche von &marble;

source: &marble; Searching Places
de: Ortssuche in &marble;

source: As you hit <keycap>Return</keycap>, &marble; runners will also query both online and offline searches to return you even more useful data.
de: Wenn Sie die Taste &Enter; drücken, werden Module zur Online- und Offline-Suche gestartet, um möglichst viele nützliche Daten zu finden.

source: The following online search runners are available:
de: Die folgenden Module für eine Onlinesuche sind verfügbar:

source: Nominatim: An online search and reverse geocoding service, using data from <ulink url="http://www.openstreetmap.org"></ulink>
de: Nominatim: Ein Dienst zur Onlinesuche und umgekehrter Geolokalisierung. Es werden die Daten von <ulink url="http://www.openstreetmap.org"></ulink> verwendet

source: HostIP: A reverse geocoding based on IP address, using data from <ulink url="http://www.hostip.info"></ulink>
de: HostIP: Ein Dienst zur umgekehrten Geolokalisierung auf der Basis von IP-Adressen. Es werden die Daten von <ulink url="http://www.hostip.info"></ulink> verwendet

source: The following offline search runners are also available, depending on extra software and data you have installed:
de: Außerdem sind auch, abhängig von zusätzlich installierter Software und Daten, die folgenden Module für eine Offlinesuche sind verfügbar:

source: Local Database: All placemarks in all open documents will be searched for. This includes your Bookmarks of course.
de: Lokale Datenbank: Alle Ortsmarken in allen geöffneten Dokumenten werden durchsucht. Natürlich werden auch Ihre Lesezeichen in die Suche eingeschlossen.

source: Monav: An offline search service using the data from Monav offline routing information, based on OSM data
de: Monav: Ein Offline-Suchdienst, der Daten vom Offline-Routenplaner Monav verwendet, die auf OSM-Daten basieren

source: Gosmore: An offline reverse geocoding service using data from gosmore setup
de: Gosmore: Ein Offline Dienst für umgekehrte Geolokalisierung, der Daten aus der Gosmore-Einrichtung benutzt

source: Once you have found your search on the map you can click on its label or its symbol using the &LMB;. After clicking the name of the location on the map a data sheet will appear, like this:
de: Wenn Sie einen Ort auf der Karte gefunden haben, können Sie mit der &LMBn; auf dessen Beschriftung oder Symbol klicken. Daraufhin erscheint ein ein Fenster mit einem Datenblatt wie diesem:

source: <screeninfo>&marble; Data Sheet</screeninfo>
de: <screeninfo>Datenblatt von &marble;</screeninfo>

source: <phrase>&marble; Data Sheet</phrase>
de: <phrase>Datenblatt von &marble;</phrase>

source: On the first tab of the dialog some very basic data is provided, like the name, coordinates and flag of the country the place belongs to. In addition, population numbers for cities get shown, as well as the elevation for mountains. If your computer is connected to the Internet and if you're online, &marble; will try to connect to the popular Internet encyclopedia <quote>Wikipedia</quote>. If a matching Wikipedia article is available &marble; will display it on the data sheet.
de: Auf der ersten Karteikarte des Dialogs werden nur grundlegende Daten angezeigt wie Koordinaten und der Name des Landes, zu dem der Ort gehört, sowie dessen Landesflagge. Dazu kommt bei Städten die Bevölkerungszahl und bei Bergen die Höhenangabe. Wenn Ihr Rechner mit dem Internet verbunden ist, versucht &marble; eine Verbindung mit der beliebten Internet-Enzyklopädie <quote>Wikipedia</quote> herzustellen. Findet sich ein passender Wikipedia-Artikel, zeigt &marble; diesen auf dem Datenblatt an.

source: The additional data sources can be enabled using <menuchoice><guimenu>View</guimenu><guisubmenu>Online services</guisubmenu></menuchoice> submenu. For example, you should mark <guimenuitem>Wikipedia</guimenuitem> menu item to see Wikipedia articles.
de: Die zusätzlichen Datenquellen können im Untermenü <menuchoice><guimenu>Ansicht</guimenu><guisubmenu>Online-Dienste</guisubmenu></menuchoice> aktiviert werden.

source: Find your way with &marble;
de: Routenplanung mit &marble;

source: Besides searching for places, &marble; can display possible routes between two or more of them. Do you want to plan a bicycle tour in the nearby wood? Need driving instructions to get to an address in a foreign city? Click on the <guilabel>Routing</guilabel> tab on the top of &marble;'s toolbox to start planning your trip.
de: Zusätzlich zur Suche nach Orten kann &marble; auch mögliche Routen zwischen zwei oder mehr Orten anzeigen. Möchten Sie mit dem Fahrrad in den nahe gelegenen Wald fahren? Brauchen Sie Anweisungen, um eine Adresse in einer fremden Stadt zu finden? Klicken Sie auf die Karteikarte <guilabel>Routenplaner</guilabel> oben in &marble;s Navigationsleiste und beginnen Sie mit der Planung der Route für Ihren Ausflug.

source: Creating a new Route
de: Eine neue Route erstellen

source: In the <guilabel>Routing</guilabel> tab you'll see two green buttons <guilabel>A</guilabel> and <guilabel>B</guilabel>. Enter the start address in the input field next to the <guilabel>A</guilabel> button, the route start input field. Press &Enter; or click on the <guilabel>Search</guilabel> button to find matching placemarks. A small progress animation will shorten your waiting time while the search is running. Using the search term <quote>Weavers Lane, London</quote>, the result will look similar to the screenshot below:
de: Auf der Karteikarte <guilabel>Routenplaner</guilabel> gibt es zwei grüne Knöpfe <guilabel>A</guilabel> und <guilabel>B</guilabel>. Geben Sie die Startadresse in das Eingabefeld neben dem Knopf <guilabel>A</guilabel> ein. Drücken Sie die &Enter;taste oder klicken Sie auf <guilabel>Suchen</guilabel>, um passende Orte in der Karte zu finden. Während der Suche wird eine animierte Fortschrittsanzeige eingeblendet. Mit dem Suchbegriff <quote>Weavers Lane, London</quote> wird als Ergebnis das folgende Bildschirmfoto angezeigt:

source: &marble; address search
de: Adressensuche in &marble;

source: &marble; Searching Addresses
de: Adressensuche in &marble;

source: Matching placemarks line up in the list below the input fields. They are also shown in the map. The first result is automatically selected as the route start. In the map, this position is indicated using the same <guilabel>A</guilabel> icon as the button next to the route start input field. If the first result is not your desired route start, click on any other result to make that the new start position. You can either click on it in the result list or on its icon in the map to achieve that. The currently chosen route start is always indicated using the <guilabel>A</guilabel> icon.
de: Passende Orte werden in einer Liste unter dem Eingabefeld angezeigt und auch auf der Karte markiert. Der erste Eintrag der Liste ist automatisch als Startpunkt der Route ausgewählt. Auf der Karte wird dieser Ort mit dem gleichen Symbol <guilabel>A</guilabel> wie neben dem Eingabefeld gekennzeichnet. Ist der erste Eintrag in der Liste nicht Ihr gewünschter Startpunkt, wählen Sie durch klicken mit der &LMBn; einen anderen Eintrag als neuen Routenstart aus. Dazu können Sie entweder auf den Eintrag in der Liste oder das Symbol auf der Karte klicken. Der aktuell ausgewählte Startpunkt der Route wird immer durch das Symbol <guilabel>A</guilabel> gekennzeichnet.

source: With the route start at hand, let's move on to enter the destination of our trip. The procedure is the same: Enter the destination address in the input field next to the <guilabel>B</guilabel> button, press &Enter; and select the desired item among the result list.
de: Ist der Startpunkt der Fahrt bestimmt, geht es mit der Eingabe des Zielortes weiter. Dazu geben Sie wie beim Start die Zieladresse in das Eingabefeld neben dem Knopf <guilabel>B</guilabel> ein, drücken die &Enter;taste und wählen den Zielort aus der angezeigten Liste.
