Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdeedu/marble.po
Languages: de

source: Places often have different names in different languages. The label on the map can show the name in the user's language. Alternatively it can display the name in the official language and glyphs of that place.
de: Viele Orte haben in verschiedenen Sprachen verschiedene Namen. Die Textmarke in der Karte kann die Namen in der Sprache des Benutzers oder alternativ in der offiziellen Sprache des Ortes anzeigen.

source: Default map font
de: Standardschriftart in der Karte

source: The default font that gets used on the map.
de: Die Standardschriftart, die in der Karte verwendet wird.

source: Navigation Configuration
de: Einrichtung der Navigation

source: <screeninfo>The Navigation configuration dialog</screeninfo>
de: <screeninfo>Einrichtungsdialog für Navigation</screeninfo>

source: <phrase>The Navigation configuration dialog</phrase>
de: <phrase>Einrichtungsdialog für Navigation</phrase>

source: Drag location
de: Orte ziehen

source: While dragging the mouse there are two standard behaviors when dealing with a virtual globe: The location below mouse pointer will follow the cursor exactly: As a result &eg; the north pole will not stay at the top which can lead to confusion. By default &marble; makes sure that north is always up which results in a dragging behavior where the location below the mouse pointer slightly "detaches" from the cursor.
de: Wenn Sie mit der Maus ziehen, gibt es zwei Standard-Aktionen, die sich auf die virtuelle Weltkugel beziehen: Der Ort unter der Maus folgt der Mausbewegung ganz genau: Dies führt allerdings auch dazu, dass der Nordpol nicht unbedingt oben bleibt, was zu Verwirrungen führen kann. In der Voreinstellung sorgt &marble; allerdings dafür, dass der Globus genordet bleibt. Dadurch folgt die Karte dem Mauszeiger nicht exakt, sondern „entkoppelt“ sich, um die Nordausrichtung beizubehalten.

source: Inertial Globe Rotation
de: Träge Drehung des Globus

source: By default &marble; will use kinetic spinning while dragging the map. You can turn this behavior off using this check box.
de: Als Standard wird kinetisches Drehen beim Ziehen der Karte benutzt. Dieses Verhalten können Sie mit diesem Ankreuzfeld abschalten.

source: Animate voyage to the target
de: Reise zum Ziel animieren

source: When searching for a location &marble; can either move instantly to the new location or it can show a travel animation from the previous place to the new place.
de: Bei der Suche nach einem Ort kann &marble; entweder direkt zu diesem Ort springen oder Sie können sich eine Reiseanimation vom ersten zum zweiten Ort anzeigen lassen.

source: On Startup
de: Beim Start

source: By default &marble; will display the home location immediately after the application has started. As an alternative it can also show the last position that was active when the user left the application.
de: Voreingestellt zeigt &marble; beim Start den Heimatort an. Alternativ kann es auch die Position anzeigen, an der der Benutzer die Anwendung zuletzt beendet hat.

source: External Editor
de: Externer Editor

source: Here, you can define the default editor for the maps or choose <guilabel>Always ask</guilabel> if &marble; should ask you to choose before starting the external editor.
de: Hier können Sie den Standardeditor für Karten einstellen oder <guilabel>Immer nachfragen</guilabel> wählen, wenn Sie vor dem Start eines externen Editors gefragt werden möchten.

source: Cache &amp; Proxy Configuration
de: Einrichtung von Zwischenspeicher &amp; Proxy

source: <screeninfo>The Cache &amp; Proxy configuration dialog</screeninfo>
de: <screeninfo>Einrichtungsdialog für Zwischenspeicher &amp; Proxy</screeninfo>

source: <phrase>The Cache &amp; Proxy configuration dialog</phrase>
de: <phrase>Einrichtungsdialog für Zwischenspeicher &amp; Proxy</phrase>

source: Cache
de: Zwischenspeicher

source: There are two caches being used for &marble;: The physical memory which is needed to keep map data in the computer's memory. Increasing the value will make the application more responsive. The hard disc memory cache is used by download contents from the Internet (&eg; Wikipedia data or map data). Decrease this value if you want to save space on the hard disc and if high usage of the Internet is not an issue.
de: &marble; verwendet zwei Zwischenspeicher: Den physikalischen Speicher, um die Kartendaten im Speicher des Rechners vorzuhalten. Wenn Sie diesen Speicher vergrößern, wird die Anwendung flüssiger reagieren. Dann gibt es noch den Festplattenspeicher, welcher zum Herunterladen von Inhalten aus dem Internet Verwendung findet (&eg; Wikipedia-Daten oder Kartenmaterial). Verkleinern Sie diesen Speicher, wenn Sie Platz auf der Festplatte sparen möchten und das Herunterladen von Daten aus dem Internet nur eine untergeordnete Rolle spielt.

source: Proxy settings for your local intranet. Please leave empty if there is no proxy.
de: Proxy-Einstellungen für Ihr lokales Intranet. Wenn Sie keinen Proxy haben, lassen Sie das Feld leer.

source: Date &amp; Time Configuration
de: Einrichtung von Datum &amp; Zeit

source: <screeninfo>The Date &amp; Time configuration dialog</screeninfo>
de: <screeninfo>Einrichtungsdialog für Datum &amp; Zeit</screeninfo>

source: <phrase>The Date &amp; Time configuration dialog</phrase>
de: <phrase>Einrichtungsdialog für Datum &amp; Zeit</phrase>

source: Time Zone
de: Zeitzone

source: Here, you can choose a time zone for &marble;: <ulink url="http://en.wikipedia.org/wiki/Coordinated_Universal_Time">UTC</ulink>, system time zone or choose custom time zone. The chosen option changes the map view only if the map can show the light conditions on the surface.
de: Hier können Sie eine Zeitzone für &marble; einstellen: <ulink url="http://de.wikipedia.org/wiki/UTC">UTC</ulink>, Zeitzone des Systems oder eine benutzerdefinierte Zeitzone. Die ausgewählte Einstellung ändert die Kartenansicht nur dann, wenn die Beleuchtungsbedingungen auf der Oberfläche angezeigt werden können.

source: When &marble; starts
de: Beim Start von &marble;

source: Here, you can choose the date and time which will be used on &marble; start: system time or the last session time.
de: Hier können Sie das beim Starten von &marble; verwendete Datum und die Zeit einstellen: Systemzeit oder die Zeit der letzten Sitzung.

source: Synchronization Configuration
de: Einrichtung des Abgleichs

source: &marble; can upload route and bookmark data to <ulink url="https://en.wikipedia.org/wiki/OwnCloud">ownCloud</ulink> server and synchronize them between &marble; instances installed on different devices.
de: Mit &marble; können Sie Routen- und Lesezeichendaten zu einem <ulink url="https://en.wikipedia.org/wiki/OwnCloud">ownCloud</ulink>-Server hochladen und sie zwischen Instanzen von &marble; abgleichen, die auf verschiedenen Geräten installiert sind.

source: <screeninfo>The Synchronization configuration dialog</screeninfo>
de: <screeninfo>Einrichtungsdialog für Abgleich</screeninfo>

source: <phrase>The Synchronization configuration dialog</phrase>
de: <phrase>Einrichtungsdialog für Abgleich</phrase>

source: Enable synchronization
de: Abgleich aktivieren

source: The synchronization can be enabled or disabled using this item. When the synchronization is enabled you can choose whether to synchronize route and bookmark data using the corresponding check boxes or click on <guibutton>Sync now</guibutton> to initiate synchronization immediately.
de: Das Abgleichen kann mit diesem Eintrag ein- oder ausgeschaltet werden. Ist der Abgleich eingeschaltet, dann können Sie mit den Ankreuzfeldern auswählen, ob Routen- und Lesezeichendaten abgeglichen werden sollen oder auf <guibutton>Jetzt abgleichen</guibutton> klicken, um den Vorgang sofort zu starten.

source: Credentials
de: Anmeldungsdaten

source: Here, you can enter your ownClowd credentials. More information on ownClowd configuration can be found on the <ulink url="https://owncloud.com/">ownClowd official website</ulink>.
de: Hier geben Sie die Anmeldedaten für ownClowd. Weitere Informationen zur Einrichtung finden Sie auf der <ulink url="https://owncloud.com/">offiziellen ownClowd-Webseite</ulink>.

source: Routing Configuration
de: Einrichtungsdialog „Routenplaner“

source: <screeninfo>The Routing configuration dialog</screeninfo>
de: <screeninfo>Einrichtungsdialog „Routenplaner“</screeninfo>

source: <phrase>The Routing configuration dialog</phrase>
de: <phrase>Einrichtungsdialog für Routenplanung</phrase>

source: <guilabel>Add</guilabel>
de: <guilabel>Hinzufügen</guilabel>

source: Opens a window where you can add a new routing profile.
de: Öffnet einen Dialog, in dem neue Routenprofile hinzugefügt werden können.

source: Configure
de: Einrichten

source: Opens a window where the currently selected routing profile can be configured.
de: Öffnet einen Dialog, in dem das aktuell ausgewählte Routenprofil eingerichtet werden kann.

source: Remove
de: Entfernen

source: Deletes the selected routing profile.
de: Löscht das ausgewählte Routenprofil.

source: Move Up
de: Nach oben

source: The selected routing profile is moved up one step. It will appear before the one that was previously on top of it.
de: Das ausgewählte Routenprofil wird eine Zeile nach oben geschoben und tauscht den Platz mit dem vorher dort vorhandenen Profil.

source: Move Down
de: Nach unten

source: The selected routing profile is moved down one step. It will appear after the one that was previously below of it.
de: Das ausgewählte Routenprofil wird eine Zeile nach unten geschoben und tauscht den Platz mit dem vorher dort vorhandenen Profil.

source: Plugins Configuration
de: Einrichtung der Module

source: The <guilabel>Plugin Configuration</guilabel> widget is the place to activate (or deactivate) Info Boxes, Online Services and other plugins that affect the look of &marble;. Active plugins appear in the <guilabel>View</guilabel> menu where you can toggle their visibility.
de: Auf der Seite <guilabel>Module</guilabel> des Einrichtungsdialogs können Informationskästen, Online-Dienste und andere Module aus- und abgewählt werden. Alle aktivierten Module werden im Menü <guilabel>Ansicht</guilabel> angezeigt, hier können Sie die aktivierten Module dann ein- oder ausblenden.

source: <screeninfo>The Plugins configuration dialog</screeninfo>
de: <screeninfo>Einrichtungsdialog der Module</screeninfo>

source: <phrase>The Plugins configuration dialog</phrase>
de: <phrase>Einrichtungsdialog der Module</phrase>

source: Each plugin can be activated and deactivated using the check box on the left. Some plugins provide further configuration options which are accessible by clicking on the tool icon on the right.
de: Jedes Modul kann mit den Ankreuzfeldern links neben den Namen des Moduls aktiviert oder deaktiviert werden. Für einige Module gibt es weitere Einstellungsmöglichkeiten, die Sie durch Klicken auf das Werkzeugsymbol auf der rechten Seite erreichen.

source: Amateur Radio Aprs Plugin
de: Amateur-Radio-Modul Aprs

source: Retrieves data from the Automatic Packet Reporting System via the Internet, a file or a serial device. The position and status of data senders is displayed in the map and updated in real-time.
de: Lädt Daten vom „Automatic Packet Reporting System“ über das Internet, von einer Datei oder der seriellen Schnittstelle. Die Position und der Status der Datensender werden in Echtzeit aktualisiert.

source: Annotation
de: Anmerkung

source: Allows you to add annotations on the maps.
de: Ermöglicht das Einfügen von Anmerkungen auf den Karten.

source: Atmosphere
de: Atmosphäre

source: Displays atmosphere effects.
de: Zeigt Effekte der Atmosphäre.

source: Compass
de: Kompass

source: Shows a compass in the map
de: Zeigt einen Kompass in der Karte an.

source: Coordinate Grid
de: Koordinatensystem

source: Displays a coordinate grid (you can choose the colors of the grid lines).
de: Zeigt ein Koordinatengitter an, die Farbe der Gitterlinien kann eingestellt werden.

source: Crosshairs
de: Fadenkreuz

source: Enable this to display a small crosshair in the center of the map.
de: Aktivieren Sie diese Einstellung, um ein kleines Kreuz in der Mitte der Karte anzuzeigen.

source: Download Progress Indicator
de: Download-Fortschrittsanzeige

source: A pie chart on top of the map that shows the progress of ongoing downloads.
de: Eine Tortengrafik auf der Karte, die den Fortschritt beim Herunterladen von Daten anzeigt.

source: Earthquakes
de: Erdbeben

source: Displays the earthquake markers on the map.
de: Zeigt Markierungen für Erdbeben auf der Karte.

source: Eclipses
de: Finsternisse

source: Displays the data about Solar and Moon eclipses.
de: Zeigt die Daten von Sonnen- und Mond-Finsternissen.

source: Elevation Profile
de: Höhenprofil

source: Displays the elevation profile overlay for <link linkend="routing">the routes on the map</link>.
de: Zeigt das Höhenprofil für <link linkend="routing">Routen in der Karte</link>.

source: Elevation Profile Marker
de: Höhenprofil-Markierung

source: Marks the current elevation of the elevation profile on the map.
de: Markiert die aktuelle Höhe des Höhenprofils auf der Karte.

source: Displays a float item that provides <ulink url="http://en.wikipedia.org/wiki/Global_Positioning_System">GPS</ulink> information.
de: Zeigt ist ein freischwebendes Objekt, das <ulink url="http://de.wikipedia.org/wiki/GPS">GPS</ulink>-Informationen bereitstellt.

source: License
de: Lizenz

source: Displays a float item that provides copyright information.
de: Zeigt ist ein freischwebendes Objekt für die Anzeige von Copyright-Informationen .

source: Measure Tool
de: Messwerkzeug

source: The plugin to <link linkend="measure-distances">measure distances between two or more points</link>.
de: Das Modul, um den <link linkend="measure-distances">Abstand zwischen zwei oder mehr Punkten zu messen</link>.

source: Displaying of the distance and the bearing between the points can be configured after pressing the tool icon. It is enough to check the corresponding item to make &marble; show the labels or uncheck the item to hide the labels.
de: Die Anzeige von Entfernung und Position zwischen Messpunkten kann eingestellt werden, wenn Sie auf das Werkzeugsymbol drücken. Dann können Sie die Beschriftung der Abschnitte ein- oder ausschalten.

source: Displays the mouse control to zoom and move as float item on the map.
de: Zeigt ein Navigationselement zur Vergrößerung und Verschiebung der Karte mit der Maus als freischwebendes halb durchsichtiges Fenster auf der Karte an.

source: Displays the <ulink url="http://en.wikipedia.org/wiki/Geocaching">geocaching</ulink> markers on the map.
de: Zeigt die Markierungen für <ulink url="http://de.wikipedia.org/wiki/Geocaching">geocaching</ulink> auf der Karte.

source: OpenDesktop Items
de: OpenDesktop-Einträge

source: Shows <ulink url="http://opendesktop.org/">OpenDesktop</ulink> users' avatars and some extra information about them on the map.
de: Zeigt die Avatare und einige weitere Informationen über <ulink url="http://opendesktop.org/">OpenDesktop</ulink>-Benutzer auf der Karte an.

source: Overview Map
de: Übersichtskarte

source: This is a float item that provides an overview map.
de: Dies ist ein freischwebendes Objekt, das eine Übersichtskarte bereitstellt.

source: Photos
de: Fotos

source: Automatically downloads images from around the world in preference to their popularity.
de: Lädt automatisch Bilder aus aller Welt anhand ihres Beliebtheitsgrades herunter.

source: Places
de: Orte

source: Displays trending <ulink url="https://foursquare.com/">Foursquare</ulink> places.
de: Zeigt tolle Orte mithilfe von <ulink url="https://foursquare.com/">Foursquare</ulink>.

source: Position Marker
de: Positionsmarkierung

source: Draws a marker at the current <ulink url="http://en.wikipedia.org/wiki/Global_Positioning_System">GPS</ulink> position.
de: Zeichnet eine Markierung an die aktuelle <ulink url="http://de.wikipedia.org/wiki/GPS">GPS</ulink>-Position.

source: Postal Codes
de: Postleitzahlen

source: Shows <ulink url="http://en.wikipedia.org/wiki/Postal_code">postal codes</ulink> of the area on the map.
de: Zeigt <ulink url="http://en.wikipedia.org/wiki/Postal_code">Postleitzahl</ulink> für den Bereich auf der Karte an.

source: Routing
de: Routenplaner

source: Displays the <link linkend="routing">routing information</link> and navigation controls.
de: Zeigt <link linkend="routing">Routenplanerinformationen</link> und Navigationselemente.

source: Satellites
de: Satelliten

source: Displays the Earth and other planets natural and artificial satellites and their orbits.
de: Zeigt natürliche und künstliche Satelliten der Erde und anderer Planeten mit den Orbitalbahnen.

source: Scale Bar
de: Maßstab

source: This is a float item that provides a map scale.
de: Dies ist ein freischwebendes Objekt, das einen Maßstab bereitstellt.

source: Speedometer
de: Geschwindigkeitsmesser

source: Displays the current cruising speed. Needs some <ulink url="http://en.wikipedia.org/wiki/Global_Positioning_System">GPS</ulink> data.
de: Zeigt die aktuelle Reisegeschwindigkeit. Dafür werden <ulink url="http://de.wikipedia.org/wiki/GPS">GPS</ulink>-Daten benötigt.

source: Stars
de: Sterne

source: A plugin that shows the Starry Sky.
de: Ein Modul, das die Sterne am Himmel anzeigt.

source: <guilabel>Sun</guilabel>
de: <guilabel>Sonne</guilabel>

source: A plugin that shows the Sun.
de: Ein Modul, das die Sonne anzeigt.

source: Weather
de: Wetter

source: Downloads current weather information of cities and displays them in the map.
de: Lädt aktuelle Informationen über das Wetter in Städten und zeigt sie auf der Karte an.

source: Wikipedia Articles
de: Wikipedia-Artikel

source: Automatically downloads Wikipedia articles and shows them on the right position on the map.
de: Lädt automatisch Wikipedia-Artikel und zeigt sie an der richtigen Position in der Karte an.

source: Questions and Answers
de: Fragen und Antworten

source: I cannot see my house on the map / Why should I use &marble; if there is Google Earth already?
de: Ich kann auf der Karte mein Haus nicht erkennen. Warum sollte ich &marble; benutzen, wenn es doch schon Google Earth gibt?

source: &marble; aims to be a lightweight fast educational geographical browser that easily runs on any platform that is supported by &Qt;. While higher resolution maps would be nice to have they aren't necessary for every user and every use case (just like you don't use a full blown text processor each time you just need a simple editor). Also notice &marble; is free software and is based on data that can be freely redistributed in the same way that applies to Free Software.
de: &marble; ist als schlanker und schneller Geografie-Browser für Ausbildungszwecke gedacht, der auf allen von &Qt; unterstützten Plattformen läuft. Auch wenn höher aufgelöste Karten schön wären, sind sie nicht für jeden Benutzer und jeden Anwendungsfall nötig (genausowenig wie sie jedesmal eine ausgewachsene Textverarbeitung benutzen, wenn ein einfacher Editor ausreicht). Beachten Sie außerdem, dass &marble; eine freie Software ist und mit Daten arbeitet, die genauso frei verteilt werden können wie freie Software.

source: Why is &marble; so fast although I don't have hardware acceleration enabled? / Why doesn't &marble; run smoothly on my expensive 3D graphics card?
de: Warum ist &marble; so schnell obwohl ich keine Hardware-Beschleunigung aktiviert habe? Warum läuft &marble; auf meiner teuren 3D-Grafikkarten nicht schneller?

source: Despite depicting the earth as a globe &marble; doesn't make use of any 3D hardware acceleration. This has the advantage of running at a decent speed on any platform and hardware supported by &Qt;. However it has the disadvantage that it doesn't run as smoothly as it could if it used hardware accelerated OpenGL. &marble; just uses plain 2D graphics and therefore requires a graphics adapter that is fast at drawing 2D graphics. We plan to add an optional OpenGL backend in the future.
de: Obwohl die Erde als Globus darstellt wird, macht &marble; keinen Gebrauch von 3D-Hardware-Beschleunigung. Das hat den Vorteil, dass es grundsätzlich auf jeder von &Qt; unterstützten Plattform und Hardware mit halbwegs ordentlicher Geschwindigkeit läuft. Das hat allerdings den Nachteil, dass es nicht so flüssig läuft wie es der Fall wäre, wenn es hardwarebeschleunigtes OpenGL benutzen würde. &marble; verwendet einfache 2D-Grafiken und benötigt darum eine Grafikkarte, die 2D-Grafiken flüssig und schnell verarbeiten kann. Wir planen zukünftig ein optionales OpenGL-Backend.

source: Will I ever have to pay for &marble;?
de: Werde ich jemals für &marble; bezahlen müssen?

source: No, never. But the authors always welcome feedback. &marble; is licensed under the <ulink url="http://www.gnu.org/licenses/licenses.html#LGPL">LGPL</ulink>, so you will never have to pay for this program.
de: Nein, nie. Aber die Autoren freuen sich über Rückmeldungen. &marble; ist unter der <ulink url="http://www.gnu.org/licenses/licenses.html#LGPL">LGPL</ulink> lizensiert, darum werden Sie niemals für dieses Programm zahlen müssen.

source: How can I contribute?
de: Wie kann ich selbst dazu beitragen?

source: &marble; is not only an application but also a Free Software project. As such it's easy to join: just contact us via the marble-devel mailing list (marble-devel@kde.org).
de: &marble; ist nicht nur ein Programm, sondern auch ein freies Software-Projekt. Als solches können Sie sich uns leicht anschließen. Nehmen Sie einfach über die marble-devel-Mailingliste (marble-devel@kde.org) Kontakt mit uns auf.

source: Credits and License
de: Danksagungen und Lizenz

source: Program Copyright, 2005-2007 &Torsten.Rahn; &Torsten.Rahn.mail;
de: Copyright des Programms, 2005-2007 &Torsten.Rahn; &Torsten.Rahn.mail;

source: Contributors:
de: Mitwirkende:

source: CREDIT_FOR_TRANSLATORS
de: <para>Übersetzung Stephan Johach<email>hunsum@gmx.de</email></para>

source: How to obtain &marble;
de: Wie bekomme ich &marble;

source: Requirements
de: Voraussetzungen

source: &marble; itself can be found on the <ulink url="http://marble.kde.org">&marble; website</ulink> and is part of the &kde;-Edu project
de: &marble; selbst finden Sie auf der <ulink url="http://marble.kde.org">&marble;-Webseite</ulink>. &marble; gehört zum &kde;-Edu-Projekt.

source: You can find a list of changes in the file <filename>ChangeLog</filename> in the distribution of &marble;.
de: Eine Liste der Änderungen finden Sie in der Datei <filename>ChangeLog</filename>, die zusammen mit &marble; verbreitet wird.

source: Compilation and Installation
de: Kompilierung und Installation

source: &marble; can be compiled as a &Qt; 4-only version as well as featuring &kde; 4 support. To compile &marble; with &Qt; 4-only support check out &marble; from &kde; Git into ~/marble and just do: <command>cmake -DQTONLY=ON ~/marble</command> and <command>sudo make install</command>. To compile &marble; with &kde; support check instructions on how to compile &kde; applications at <ulink url="http://techbase.kde.org/">&kde;'s TechBase</ulink>.
de: &marble; kann sowohl als reine &Qt; 4 Version sowie mit &kde; 4 Unterstützung kompiliert werden. Um &marble; als reines &Qt; 4 Programm zu kompilieren, holen Sie &marble; aus dem &kde;-Git-Archiv nach ~/marble und führen folgende Befehl aus: <command>cmake -DQTONLY=ON ~/marble</command> und <command>sudo make install</command> Um &marble; mit &kde;-Unterstützung zu kompilieren, lesen Sie die Anweisungen zur Kompilierung von &kde; Programmen in der <ulink url="http://techbase.kde.org/">TechBase</ulink> von &kde;.
