Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdeedu/marble.po
Languages: de

source: To accomplish this for a certain region, make that region visible in the screen by zooming and moving the Globe. Now open the <guilabel>Download Region...</guilabel> dialog in the <guilabel>File</guilabel> menu. Keep the <guilabel>Visible region</guilabel> option selected to download those tiles that correspond to the map region visible in the screen. Next, select the tile level range (zoom range) you wish to download. The first field corresponds to the smallest, the second field corresponds to the largest tile level that will be downloaded. Tile levels in between will be downloaded as well. &marble; shows how many tiles (images) need to be downloaded and updates this number whenever you change the region or tile level range.
de: Um diese Aufgabe für eine bestimmte Region durchzuführen, verändern Sie den Kartenausschnitt und die Vergrößerung durch Drehen des Globus. Nun öffnen Sie den Dialog <guilabel>Region herunterladen</guilabel> im Menü <guilabel>Datei</guilabel>. Aktivieren Sie die Einstellung <guilabel>Sichtbare Region</guilabel>, dann werden nur die zugehörigen Kacheln für Teil der Karte geladen, der auf dem Bildschirm sichtbar ist. Als nächstes wählen Sie den Kachelstufenbereich (Vergrößerungsbereich), den verwenden möchten. Der Wert im ersten Feld entspricht der kleinsten und der Wert im rechten Feld der größten Kachelstufe, die zusammen mit allen Stufen dazwischen geladen wird. &marble; zeigt an, wieviele Kacheln (Bilder) zu laden sind und aktualisiert diese Zahl immer, wenn die Region oder Kachelstufe geändert wird.

source: &marble; Download Region dialog
de: &marble;s Dialog „Region herunterladen“

source: &marble;'s Download Region dialog
de: &marble;s Dialog „Region herunterladen“

source: The tile level corresponding to the current zoom level is shown in the status bar on the bottom. Please note that you may have to configure &marble; to show that information: Click with the &RMB; on the status bar and select <guilabel>Show Tile Zoom Level</guilabel>.
de: Die Kachelstufe zur aktuell benutzten Vergrößerung wird unten in der Statusleiste angezeigt. Diese Anzeige muss aktiviert werden. Klicken Sie dazu mit der &RMBn; in die Statusleiste und wählen dann im Kontextmenü <guilabel>Vergrößerungsstufe anzeigen</guilabel>.

source: Select <guilabel>OK</guilabel> to trigger the map region download. The progress bar of &marble; will show the download progress (if activated).
de: Wählen Sie <guilabel>OK</guilabel> um das Herunterladen der Kartenregion zu starten. Der zeitliche Ablauf dieser Aktion wird in &marble; durch eine animierte Fortschrittsanzeige dargestellt, falls dies aktiviert ist.

source: In case you do know the coordinates of the map region to download, you can enter them by clicking on the <guilabel>Specify region</guilabel> option. The map region visible in the screen will be ignored in that case.
de: Sind Ihnen die Koordinaten der Region bekannt, deren Karte Sie herunterladen möchten, klicken Sie auf <guilabel>Region angeben</guilabel> und tragen sie dann direkt ein. Der auf dem Bildschirm sichtbare Kartenbereich wird dann ignoriert.

source: You can keep using &marble; while the <guilabel>Download Region</guilabel> dialog is open. This is useful to queue several downloads for different regions or different tile ranges. Just select <guilabel>Apply</guilabel> instead of <guilabel>OK</guilabel> to trigger the map region download.
de: Sie können &marble; weiter benutzen, wenn der Dialog <guilabel>Region herunterladen</guilabel> geöffnet ist. Diese Funktion können dazu benutzen, um Karten für verschiedene Regionen und in verschiedenen Kachelstufen herunterzuladen. Drücken Sie dazu auf <guilabel>Anwenden</guilabel> anstatt <guilabel>OK</guilabel>, um das Herunterladen der Kartendaten zu starten.

source: Command Reference
de: Befehlsreferenz

source: Menus and shortcut keys
de: Menüs und Kurzbefehle

source: The File Menu
de: Das Menü Datei

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>O</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Open...</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>O</keycap></keycombo> </shortcut> <guimenu>Datei</guimenu> <guimenuitem>Öffnen ...</guimenuitem>

source: <action>Opens</action> a map file.
de: <action>Öffnet</action> eine Karte.

source: <guimenu>File</guimenu> <guimenuitem>Open Recent</guimenuitem>
de: <guimenu>Datei</guimenu> <guimenuitem>Zuletzt geöffnete Dateien</guimenuitem>

source: This is a shortcut to open recently opened maps. Clicking on this item opens a list to the side of the menu with several of the most recently opened files. Clicking on a specific file will open it in &marble; - if the file still resides at the same location.
de: Dies ist eine Aktion, um zuletzt benutzte Karten zu öffnen. Dieser Menüpunkt öffnet eine Liste mit einigen zuletzt geöffneten Dateien. Klicken auf eine der Dateien, wird diese in &marble; geladen - wenn diese Datei noch am selben Ort gespeichert ist.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Download Maps...</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo> </shortcut> <guimenu>Datei</guimenu> <guimenuitem>Karten herunterladen ...</guimenuitem>

source: <action>Displays</action> the <guilabel>Get Hot New Stuff!</guilabel> dialog to download additional maps for &marble;, among others maps for Mars and Venus.
de: <action>Öffnet</action> den Dialog <guilabel>Neue Erweiterungen herunterladen</guilabel>, in dem Sie weitere Karten für &marble; herunterladen können, darunter auch Karten für den Mars und die Venus.

source: <guimenu>File</guimenu> <guimenuitem>Create a New Map...</guimenuitem>
de: <guimenu>Datei</guimenu> <guimenuitem>Neue Karte erstellen ...</guimenuitem>

source: <action>Displays</action> the <guilabel>&marble; Map Theme Creation Wizard</guilabel> dialog to create a new map using Web Map Service data, your own image file or Open Street Map indexed tiles.
de: <action>Zeigt</action> den <guilabel>&marble;-Assistent zur Erstellung neuer Kartendesigns</guilabel>. In diesem Assistenten können neue Karten mit Daten von „Web Map Service“, eigenen Bilddateien oder mit indizierten Kacheln (Open Street Map) erstellt werden.

source: <guimenu>File</guimenu> <guimenuitem>Download Region...</guimenuitem>
de: <guimenu>Datei</guimenu><guimenuitem>Region herunterladen ...</guimenuitem>

source: <action>Displays</action> the <guilabel>Download Region</guilabel> dialog to download map data in different zoom levels for offline usage. See <link linkend="download-region">Download Map Regions</link> for details.
de: <action>Zeigt</action> den Dialog <guilabel>Region herunterladen</guilabel> an, in dem Sie Kartendaten in verschiedenen Massstäben herunterladen können, um sie auch ohne Internetverbindung zu nutzen. Weitere Informationen finden Sie im Abschnitt <link linkend="download-region">Kartenregionen herunterladen</link>.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>S</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Export Map...</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>S</keycap></keycombo> </shortcut> <guimenu>Datei</guimenu> <guimenuitem>Karte exportieren ...</guimenuitem>

source: <action>Exports</action> a screenshot of &marble;'s map to an image file.
de: <action>Exportiert</action> ein Bildschirmfoto der Karte von &marble; in eine Bilddatei.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>P</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Print...</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>P</keycap></keycombo> </shortcut> <guimenu>Datei</guimenu> <guimenuitem>Drucken ...</guimenuitem>

source: <action>Prints</action> a screenshot of &marble;'s map.
de: <action>Druckt</action> ein Bildschirmfoto der Karte von &marble;.

source: <guimenu>File</guimenu> <guimenuitem>Print Preview</guimenuitem>
de: <guimenu>Datei</guimenu> <guimenuitem>Druckvorschau</guimenuitem>

source: Opens a window that shows a preview of the printed map.
de: Öffner ein Fenster mit der Vorschau der zu druckenden Karte.

source: <guimenu>File</guimenu> <guimenuitem>Work Offline</guimenuitem>
de: <guimenu>Datei</guimenu><guimenuitem>Offline arbeiten</guimenuitem>

source: If this option is selected &marble; will no longer download map data from the Internet. The search feature gets restricted to the local database. New routes cannot be retrieved.
de: Ist diese Einstellung aktiv, werden keine Kartendaten aus dem Internet heruntergeladen. Die Suche ist nur in den lokalen Daten möglich. Neue Routen können nicht berechnet werden.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Quit</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo> </shortcut> <guimenu>Datei</guimenu> <guimenuitem>Beenden</guimenuitem>

source: <action>Quits</action> &marble;
de: <action>Beendet</action> &marble;

source: The Edit Menu
de: Das Menü Bearbeiten

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>C</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Copy Map</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>C</keycap></keycombo> </shortcut> <guimenu>Bearbeiten</guimenu> <guimenuitem>Karte kopieren</guimenuitem>

source: <action>Copies</action> a screenshot of &marble;'s map to the global clipboard.
de: <action>Kopiert</action> ein Bildschirmfoto der Karte von &marble; in die globale Zwischenablage.

source: <guimenu>Edit</guimenu> <guimenuitem>Copy Coordinates</guimenuitem>
de: <guimenu>Bearbeiten</guimenu><guimenuitem>Koordinaten kopieren</guimenuitem>

source: <action>Copies</action> the current coordinates to the global clipboard.
de: <action>Kopiert</action> die aktuellen Koordinaten in die globale Zwischenablage.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>E</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Edit Map</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>E</keycap></keycombo> </shortcut> <guimenu>Bearbeiten</guimenu> <guimenuitem>Karte bearbeiten</guimenuitem>

source: <action>Allows</action> you to open the current map in the external map editor. The current version supports <application>Potlatch</application> (in a web browser), <application>Merkaartor</application> and <application>JOSM</application> map editors.
de: <action>Ermöglicht</action> das Öffnen der aktuellen Karten im externen Karteneditor. Zur Zeit werden <application>Potlatch</application> (im Webbrowser), <application>Merkaartor</application>- und <application>JOSM</application>-Karteneditoren unterstützt.

source: The View Menu
de: Das Menü Ansicht

source: <guimenu>View</guimenu> <guimenuitem>Current Location</guimenuitem>
de: <guimenu>Ansicht</guimenu><guimenuitem>Aktueller Standort</guimenuitem>

source: <action>Toggle</action> the display of the location page in the left panel. If a GPS device is connected with your computer, &marble; displays longitude and latitude of your current location.
de: <action>Schaltet</action> die Ansicht der Karteikarte <guilabel>Aktueller Standort</guilabel> in der Seitenleiste ein oder aus. Wenn ein GPS-Gerät mit dem Rechner verbunden ist, kann Breiten- und Längengrad der aktuellen Standorts hier angezeigt werden.

source: <guimenu>View</guimenu> <guimenuitem>Crosshairs</guimenuitem>
de: <guimenu>Ansicht</guimenu><guimenuitem>Fadenkreuz</guimenuitem>

source: <action>Toggle</action> the display of a simple crosshair in the center of the map.
de: <action>Blendet</action> die Anzeige der eines kleinen Fadenkreuzes in der Mitte der Karte ein oder aus.

source: <shortcut> <keycap>F5</keycap> </shortcut> <guimenu>View</guimenu> <guimenuitem>Redisplay</guimenuitem>
de: <shortcut><keycap>F5</keycap></shortcut><guimenu>Ansicht</guimenu> <guimenuitem>Anzeige auffrischen</guimenuitem>

source: The currently visible part of the map is downloaded again and refreshed on the screen.
de: Der aktuell sichtbare Teil der Karte wird erneut heruntergeladen und die Anzeige wird aktualisiert.

source: <guimenu>View</guimenu> <guisubmenu>Info Boxes</guisubmenu>
de: <guimenu>Ansicht</guimenu><guisubmenu>Informationskästen</guisubmenu>

source: In this submenu you can to lock the position of the infoboxes and show or hide the plugins you have enabled in the <link linkend="configplugins">Plugins</link> page of &marble;s configuration dialog.
de: In diesem Untermenü können Sie die Anzeige der Informationskästen ein- und ausschalten, die Sie auf der Seite <link linkend="configplugins">Module</link> des Einrichtungsdialogs von &marble; ausgewählt haben.

source: <guimenu>View</guimenu> <guimenuitem>Online Services</guimenuitem>
de: <guimenu>Ansicht</guimenu><guimenuitem>Online-Dienste</guimenuitem>

source: The <guimenuitem>Wikipedia</guimenuitem> plugin displays georeferenced Wikipedia articles as an icon on the map. A click onto the icon launches a browser window that displays the referenced site. The data is provided through a webservice via GeoNames.org. Likewise a <guimenuitem>Photos</guimenuitem> plugin currently provides photos via the FlickR photo sharing site
de: Das Modul <guimenuitem>Wikipedia</guimenuitem> zeigt Symbole für Orte mit Wikipedia-Artikeln auf der Karte an. Klicken auf diese Symbole öffnet ein Browserfenster mit Informationen über diesen Ort. Die geografischen Daten werden durch den Webdienst GeoNames.org zu Verfügung gestellt. Gleichermaßen ermöglicht es das Modul <guimenuitem>Fotos</guimenuitem>, Bilder über die Webseite FlickR anzuzeigen.

source: <guimenu>View</guimenu> <guimenuitem>Clouds</guimenuitem>
de: <guimenu>Ansicht</guimenu><guimenuitem>Wolken</guimenuitem>

source: <action>Show</action> real-time cloud cover. A real-time cloud map that gets updated every 3 hours. It uses GOES, METEOSAT, and GMS satellite imagery downloaded from the Geostationary Satellite Imagery page at Dundee University. Credits: Hari Nair, Xplanet Project
de: <action>Zeigt</action> die Bewölkung in Echtzeit. Die Wolkenkarte wird alle 3 Stunden aktualisiert. Sie verwendet GOES, METEOSAT und GMS-Satellitenbilder, die von der ‚Geostationary Satellite Imagery‘-Webseite der Dundee-Universität heruntergeladen werden. Danksagungen gehen an Hari Nair, das Xplanet-Projekt.

source: <guimenu>View</guimenu> <guimenuitem>Atmosphere</guimenuitem>
de: <guimenu>Ansicht</guimenu><guimenuitem>Atmosphäre</guimenuitem>

source: <action>Show</action> the diffuse reflection of the atmosphere around the Earth.
de: <action>Zeigt</action> die diffuse Reflexion der Erd-Atmosphäre.

source: <guimenu>View</guimenu> <guimenuitem>Stars</guimenuitem>
de: <guimenu>Ansicht</guimenu><guimenuitem>Sterne</guimenuitem>

source: <action>Show</action> the star map as seen from the Solar System.
de: <action>Schaltet</action> die Sternkarte in der Ansicht vom Sonnensystem.

source: <guimenu>View</guimenu> <guimenuitem>Sun Control...</guimenuitem>
de: <guimenu>Ansicht</guimenu><guimenuitem>Sonneneinstellung ...</guimenuitem>

source: <action>Displays</action> the <guilabel>Sun Control</guilabel> where you can set the <guilabel>Sun Shading</guilabel> and center the map on subsolar point position.
de: <action>Öffnet</action> den Dialog <guilabel>Sonnenregulierung</guilabel>, in dem den <guilabel>Sonnenschatten</guilabel> einstellen und die Karte zur Sonnenposition zentrieren können.

source: <guimenu>View</guimenu> <guimenuitem>Time Control...</guimenuitem>
de: <guimenu>Ansicht</guimenu><guimenuitem>Zeiteinstellung ...</guimenuitem>

source: <action>Displays</action> the <guilabel>Time Control</guilabel> dialog where you can set date and time and the simulation time speed.
de: <action>Öffnet</action> den Dialog <guilabel>Zeiteinstellung</guilabel>, in dem Sie Datum, Zeit, die Geschwindigkeit der Simulation ändern können.

source: <guimenu>View</guimenu> <guisubmenu>Eclipses in <replaceable>year</replaceable></guisubmenu>
de: <guimenu>Ansicht</guimenu><guisubmenu>Finsternisse in <replaceable>Jahr</replaceable></guisubmenu>

source: <action>Displays</action> the list of the eclipses for the year chosen using <menuchoice><guimenu>View</guimenu><guimenuitem>Browse Eclipses...</guimenuitem></menuchoice> menu item.
de: <action>Zeigt</action> die Finsternisse für das ausgewählte Jahr mit dem Menüeintrag <menuchoice><guimenu>Ansicht</guimenu><guimenuitem>Finsternisse durchsehen...</guimenuitem></menuchoice>.

source: This menu item will be shown only when <link linkend="eclipsesplugin">Eclipses</link> plugin is enabled
de: Dieser Menüeintrag wird nur angezeigt, wenn das Modul <link linkend="eclipsesplugin">Finsternisse</link> aktiviert ist.

source: <guimenu>View</guimenu> <guimenuitem>Browse Eclipses...</guimenuitem>
de: <guimenu>Ansicht</guimenu><guimenuitem>Finsternisse durchsehen ...</guimenuitem>

source: <action>Displays</action> the <guilabel>Eclipse Browser</guilabel> dialog where you can set the year to show eclipses for, open plugin settings dialog, view data on eclipse start, end, type and magnitude. Choose some eclipse item from the list and click on <guibutton>Go To Selected Eclipse</guibutton> to view the location of the eclipse on the globe.
de: <action>Öffnet</action> den Dialog <guilabel>Finsternis-Browser</guilabel>, in dem Sie ein Jahr für die Anzeige von Finsternissen auswählen, den Einrichtungsdialog für dieses Modul öffnen können und in dem Start, Ende, Typ und Magnitude der Finsternisse angezeigt wird. Wählen Sie eine Finsternis aus der Liste aus, klicken Sie auf <guibutton>Zur ausgewählten Finsternis gehen</guibutton> und das Ereignis wird auf dem Globus angezeigt.

source: The Settings Menu
de: Das Menü Einstellungen

source: <guimenu>Settings</guimenu> <guimenuitem>Show Toolbar</guimenuitem>
de: <guimenu>Einstellungen</guimenu><guimenuitem>Werkzeugleiste anzeigen</guimenuitem>

source: <action>Toggle</action> the display of the toolbar.
de: <action>Schaltet</action> die Anzeige der Werkzeugleiste ein und aus.

source: <guimenu>Settings</guimenu> <guimenuitem>Show Statusbar</guimenuitem>
de: <guimenu>Einstellungen</guimenu><guimenuitem>Statusleiste anzeigen</guimenuitem>

source: <action>Toggle</action> the display of the status bar.
de: <action>Blendet</action> die Karteikarte Aktueller Standort ein bzw. aus.

source: <guimenu>Settings</guimenu> <guisubmenu>Panels</guisubmenu>
de: <guimenu>Einstellungen</guimenu><guisubmenu>Seitenleisten</guisubmenu>

source: <action>Toggle</action> the display of the &marble; panels.
de: <action>Schaltet</action> die Anzeige der Seitenleisten ein und aus.

source: You can make &marble; hide all panels or show them by selecting the <menuchoice> <guimenu>Settings</guimenu> <guisubmenu>Panels</guisubmenu> <guimenuitem>Hide All Panels/Show All Panels</guimenuitem> </menuchoice> menu item or pressing <keycap>F9</keycap> key on your keyboard.
de: Sie können die Anzeige der Seitenleisten mit <menuchoice> <guimenu>Einstellungen</guimenu> <guisubmenu>Seitenleisten</guisubmenu> <guimenuitem>Alle Seitenleisten ausblenden/Alle Seitenleisten anzeigen</guimenuitem> </menuchoice> im Menü oder mit dem Kurzbefehl <keycap>F9</keycap> ein- und ausschalten.

source: <guimenu>Settings</guimenu> <guisubmenu>View Size</guisubmenu>
de: <guimenu>Einstellungen</guimenu><guisubmenu>Ansichtsgröße</guisubmenu>

source: <action>Switches between various sizes of &marble; map area.</action> You can choose one of the sizes that are suitable for capturing frames for screencast or keep &marble; map area resizable (<guimenuitem>Default (resizable)</guimenuitem> menu item).
de: <action>Wechselt zwischen den verschiedenen Größen der Kartenanzeige von &marble;</action>. Hier können Sie eine feste Größe passen für eine Bildschirmaufnahme einstellen oder eine veränderliche Anzeige mit dem Menüeintrag <guimenuitem>Standard (Größenveränderlich)</guimenuitem> für &marble; auswählen.

source: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>F</keycap></keycombo> </shortcut> <guimenu>Settings</guimenu> <guimenuitem>Full Screen Mode</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>F</keycap></keycombo> </shortcut> <guimenu>Einstellungen</guimenu> <guimenuitem>Vollbildmodus</guimenuitem>

source: <action>Switches between normal view and full screen view.</action> In full screen view, the titlebar is hidden and the actual application window is resized to the entire screen.
de: <action>Wechselt zwischen der normalen Ansicht und dem Vollbildmodus.</action> Im Vollbildmodus wird die Titelleiste ausgeblendet und das Programmfenster auf den gesamten Bildschirm vergrößert.

source: <guimenu>Settings</guimenu> <guimenuitem>Configure &marble; Desktop Globe...</guimenuitem>
de: <guimenu>Einstellungen</guimenu><guimenuitem>&marble;-Schreibtischglobus einrichten ...</guimenuitem>

source: <action>Display</action> the <link linkend="configure">&marble; configuration</link> dialog.
de: <action>Öffnet</action> den <link linkend="configure">Einrichtungsdialog</link> für &marble;.

source: The Help Menu
de: Das Menü Hilfe

source: Configuring &marble;
de: Einrichtung von &marble;

source: View Configuration
de: Einrichtung der Ansicht

source: <screeninfo>The View configuration dialog</screeninfo>
de: <screeninfo>Einrichtungsdialog Ansicht</screeninfo>

source: <phrase>The View configuration dialog</phrase>
de: <phrase>Einrichtungsdialog Ansicht</phrase>

source: Distance
de: Entfernung:

source: The unit that gets used to measure altitude, lengths and distances (&eg; km, mi, ft).
de: Die Einheit, die zum Messen von Höhe, Länge und Entfernungen verwendet wird (&eg; km, mi, ft).

source: Angle
de: Winkel

source: Specifies the notation of angles in coordinates: By default the Degree-Minute-Second notation (&eg; 54°30'00" ) gets used. As an alternative you can choose decimal degrees (&eg; 54.5°).
de: Legt fest, wie Winkel in Koordinaten angegeben werden: Voreingestellt ist Grad-Minute-Sekunde (&eg; 54°30'00"). Alternativ können auch dezimale Gradzahlen verwendet werden (&eg; 54,5°).

source: Still image
de: Unbewegtes Bild

source: Specifies the map quality that gets displayed while there is no user input. Usually this allows for high map quality as speed is no concern.
de: Legt die Qualität der Karte fest, wenn der Benutzer keine Eingaben tätigt. Dies erlaubt eine hohe Qualität, da die Geschwindigkeit keine Rolle spielt.

source: During animations
de: Während der Animation

source: Specifies the map quality that gets displayed during map animations (&eg; while dragging the globe). Especially on slow machines it is advisable to set this option to <guilabel>Low Quality</guilabel> as this will give better speed.
de: Legt die Qualität der Karte während der Animation fest (&eg; beim Ziehen des Globus). Besonders auf langsamen Rechnern ist es ratsam, diese auf <guilabel>Niedrige Qualität</guilabel> zu stellen, da so eine höhere Geschwindigkeit erreicht wird.

source: Graphics system
de: Grafiksystem

source: Specifies the graphics system - <guilabel>Native X11</guilabel> or <guilabel>Raster (Software rendering)</guilabel> - that &Qt; uses to draw the map. Changing this setting might be a good idea if there are performance issues with the system's graphics drivers.
de: Bestimmt das Grafik-System <guilabel>Native (X11)</guilabel> oder <guilabel>Raster (Software-Renderer)</guilabel>, mit dem &Qt; die Karte zeichnet. Diese Einstellung sollte geändert werden, wenn mit Ihrem Grafiktreiber Performance-Probleme auftreten.

source: Place names
de: Namen der Orte:
