Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdeedu/marble.po
Languages: de

source: Did you notice that the <guilabel>Search</guilabel> button is now gone and replaced by a <guilabel>Get Directions</guilabel> button? &marble; is signalizing that all information needed to calculate a route has been entered correctly. Click on the <guilabel>Get Directions</guilabel> button to retrieve a suitable route now. If your destination search term is <quote>Sun Walk, London</quote>, the result will resemble this screenshot:
de: Jetzt wird der Knopf <guilabel>Suchen</guilabel> durch <guilabel>Richtungsanweisungen abrufen</guilabel> ersetzt. &marble; zeigt damit an, dass alle Informationen für die Berechnung der Route vollständig eingegeben wurden. Klicken Sie nun auf <guilabel>Richtungsanweisungen abrufen</guilabel>, damit eine passende Route angezeigt wird. Mit dem Ziel <quote>Sun Walk, London</quote> wird als Ergebnis das folgende Bildschirmfoto angezeigt:

source: &marble; route result
de: Ergebnisse des Routenplaners in &marble;

source: &marble; Displaying a Route
de: Routenanzeige in &marble;

source: If the start (or destination) position is already visible on the screen, you may find it more convenient to select it directly in the map. To do that, click on the <guilabel>A</guilabel> (or <guilabel>B</guilabel>) button next to the input field. Select <guilabel>From Map</guilabel> in the upcoming menu. Once clicked, the map input mode is activated: The next click on a position in the map will become the start (or end) of your trip. The mouse cursor turns into a cross to ease an accurate selection. The selected position will be included in the route and marked in the map. To abort the selection, either click on the button again or press &Esc;.
de: Ist der Start oder das Ziel bereits auf dem Bildschirm sichtbar, finden Sie es vielleicht praktischer, die Punkte direkt auf der Karte zu markieren. Dazu klicken Sie auf das Symbol <guilabel>A</guilabel> oder <guilabel>B</guilabel> neben den Eingabefeldern. Wählen Sie dann <guilabel>Von Karte ...</guilabel> aus dem Menü. Dann wird auf der Karte der Eingabemodus aktiviert. Der nächste Mausklick auf einen Punkt der Karte wird Start oder Ziel der Route. Das Mauszeigersymbol wechselt zum Kreuz, um eine genaue Auswahl zu erleichtern. Die gewählte Position wird in die Route eingefügt und auf der Karte markiert. Um die Auswahl abzubrechen, klicken Sie erneut auf diesen Knopf oder drücken die &Esc;-Taste.

source: An alternative selection of the route start and destination is provided via the context menu of the map: Click with the &RMB; on the desired location and select <guilabel>Directions from here</guilabel> or <guilabel>Directions to here</guilabel>, respectively.
de: Eine andere Auswahlmöglichkeit für den Start und das Ziel einer Route finden Sie im Kontextmenü der Karte: Klicken Sie mit der &RMBn; aus den gewünschten Ort und wählen Sie <guilabel>Route von hier</guilabel> beziehungsweise <guilabel>Route hierher</guilabel>.

source: Route Profiles
de: Routenprofile

source: Which route to choose depends on the type of vehicle you plan to use (if any). You can tell &marble; about this and other preferences using route profiles. Each profile contains the settings for a certain routing scenario. On the first start, &marble; creates four common profiles for you: <guilabel>Car (fastest)</guilabel>, <guilabel>Car (shortest)</guilabel>, <guilabel>Bike</guilabel>, and <guilabel>Pedestrian</guilabel>.
de: Welche Route Ihnen vorgeschlagen wird, hängt von der ausgewählten Fahrzeugart ab. &marble; benutzt Routenprofile für bestimmte Fahrzeugarten und weitere Einstellungen. Jedes Profil enthält die Einstellungen für ein bestimmte Art von Routen. Beim ersten Start legt &marble; vier übliche Profile für Sie an: <guilabel>Auto (schnellste)</guilabel>, <guilabel>Auto (kürzeste)</guilabel>, <guilabel>Fahrrad</guilabel> und <guilabel>Fußgänger</guilabel>.

source: The examples in the previous sections used the <guilabel>Car (fastest)</guilabel> profile. Let's revisit the last route with a different profile: Select the <guilabel>Pedestrian</guilabel> option in the <guilabel>Profile</guilabel> combo box. The route now looks like this:
de: Im Beispiel im vorherigen Abschnitt wurde das Profil <guilabel>Auto (schnellste)</guilabel> verwendet. Probieren Sie für die letzte Route ein anderes Profil: Wählen Sie die Einstellung <guilabel>Fußgänger</guilabel> aus dem Kombinationsfeld <guilabel>Profil</guilabel>. Die Route ändert sich dann wie im folgenden Bildschirmfoto:

source: &marble; pedestrian routing
de: Eine Route für Fußgänger in &marble;

source: &marble; Pedestrian routing
de: Eine Route für Fußgänger in &marble;

source: The proposed route has become shorter because footways are now also included when calculating the best route.
de: Die vorgeschlagene Route wird jetzt kürzer, da auch Fußwege bei der Berechnung der günstigsten Route berücksichtigt werden.

source: If you want to tweak one of the default profiles further, select it in the <guilabel>Profile</guilabel> combo box and click on the <guilabel>Configure</guilabel> link. A new window opens.
de: Wenn Sie eines der Standard-Routenprofile weiter bearbeiten möchten, wählen Sie es im Kombinationsfeld <guilabel>Profil</guilabel> aus und klicken auf <guilabel>Einrichten</guilabel>. Damit öffnen Sie einen neuen Dialog.

source: &marble; route profile configuration
de: Einrichtung von Routenprofilen in &marble;

source: &marble; Route Profile configuration
de: Einrichtung von Routenprofilen in &marble;

source: The left side lets you configure which routing backends are queried for routes. Eight or more backends are supported by &marble;, some working online and the other ones working offline. Online routing requires an Internet connection to query a route. Offline routing works without an Internet connection, but requires you to download and install offline routing maps in advance. The supported routing backends are
de: Auf der linken Seite können Sie einstellen, welche Routenplaner-Backends abgefragt werden. Acht oder mehr Backends werden durch &marble; unterstützt, einige Online und die anderen Offline. Für die Online-Routenplaner brauchen Sie eine Internetverbindung zur Routenabfrage. Die Offline-Routenplaner können Sie auch ohne Internetverbindung verwenden, Sie müssen aber vorher Karten für die Routenplanung herunterladen und installieren. Folgende Backends stehen zur Auswahl:

source: CycleStreets: Bicycle routing for the United Kingdom using cyclestreets.net
de: CycleStreets: Fahrrad-Routenplaner für das Vereinigtes Königreich mit cyclestreets.net

source: Gosmore: An offline router that also serves as the backend for the Yours online router
de: Gosmore: Ein Offline-Routenplaner, der auch als Backend für den Yours-Online-Routenplaner verwendet wird

source: MapQuest: An online router which provides advanced turn-by-turn instructions
de: MapQuest: Ein Online-Routenplaner mit erweiterten Fahranweisungen

source: An AppKey is required for MapQuest routing to work. You can register the AppKey <ulink url="http://developer.mapquest.com/web/products/open">here</ulink>.
de: Ein Anwendungs-Schlüssel ist für die Routenfunktion von MapQuest erforderlich. Sie können <ulink url="http://developer.mapquest.com/web/products/open">hier</ulink> einen Schlüssel registrieren lassen.

source: Monav: An offline router that is very fast even when calculating very large routes
de: Monav: Ein Offline-Routenplaner, der bei der Berechnung langer Routen sehr schnell ist

source: OSRM: An online router that is very fast even when calculating very large routes
de: OSRM: Ein Online-Routenplaner, der auch bei der Berechnung langer Routen sehr schnell ist

source: OpenRouteService: An online router that also generates driving instructions, limited to Europe
de: OpenRouteService: Ein Online-Routenplaner, der auch Fahranweisungen generiert, aber nur für Europa

source: Routino: An offline router with a very flexible configuration
de: Routino: Ein Offline-Routenplaner mit einer sehr flexiblen Konfiguration

source: Yours: An online router that operates world-wide, but lacks driving instructions
de: Yours: Ein Online-Routenplaner für die ganze Welt, es fehlen aber Fahranweisungen

source: Once you select and enable a routing backend on the left to include it in routing queries, you can modify its settings on the right side. The settings are specific to each backend.
de: Wenn Sie ein Backend für Routenplanung auf der linken Seite ausgewählt und für die Abfrage von Routen aktiviert haben, können Sie rechts die Einstellungen dafür ändern. Für jedes Backend gibt es eigene Einstellungen.

source: Besides configuring the four default profiles, you can add new profiles and remove existing ones in the &marble; settings in the <guilabel>Routing</guilabel> page.
de: Zusätzlich zur Einstellung der vier Standardprofile können Sie im Einstellungsdialog für &marble; auf der Seite <guilabel>Routenplaner</guilabel> auch neue Profile hinzufügen und vorhandene Profile löschen.

source: Adjusting Routes
de: Routen anpassen

source: &marble; let's you modify several aspects of the route for fine-tuning: Change route options, insert via points, move or remove existing points. The modification of route options has been discussed in the previous section already; we'll concentrate on point management now.
de: In &marble; können Sie mehrere Aspekte der Route zur genauen Anpassung an Ihre Wünsche ändern, Vorgaben für Routen einstellen, Zwischenpunkte einfügen und vorhandenen Punkte verschieben oder entfernen. Die Einstellung von Vorgaben für Routen wurde im letzten Abschnitt erklärt, jetzt ist der Umgang mit einzelnen Punkten der Route dran.

source: Inserting via points is done by drag-and-drop in the map. Every time you move the mouse pointer above any part of the route (except above existing trip points), a green flag icon appears to indicate that it is possible to insert a via point. To start the insert operation, click with the &LMB;. Move the mouse pointer to the desired new position while keeping the &LMB; pressed. Blue lines from the neighboring via points to the new position will appear:
de: Zwischenpunkte werden mit Ziehen und Ablegen in der Karte eingefügt. Wenn Sie den Mauszeiger über einen beliebigen Teil der Route führen, erscheint ein grünes Flaggensymbol, um anzuzeigen, dass ein Zwischenpunkt eingefügt werden kann. Dies funktioniert nicht für die Berechnungspunkte der Route. Klicken Sie mit der &LMBn; um das Einfügen zu starten. Verschieben Sie den Zeiger mit gedrückter Maustaste an die neue Position. Dann werden blaue Linien von den benachbarten Routenpunkten zum neu eingefügten Punkt gezeichnet:

source: &marble; route adding via points
de: &marble; - Zwischenpunkte hinzufügen

source: &marble; Inserting a via point
de: &marble; - Zwischenpunkt einfügen

source: The new via point will be inserted between the existing neighbor via points once you release the &LMB;. At the same time the existing route is painted dotted to indicate that it contains outdated information. In the background, a new route is prepared which will replace the outdated one automatically.
de: Der neue Punkt wird zwischen den bereits vorhandenen benachbarten Routenpunkten eingefügt, wenn Sie die &LMB; loslassen. Dann wird die alte Route gestrichelt dargestellt, damit wird sie als veraltet gekennzeichnet. Im Hintergrund wird eine neue Route berechnet und ersetzt dann die alte Route.

source: It is also possible to add via points before the start or after the end of the route. To do that, follow the instructions above for inserting a new via point, but press &Ctrl; while moving the mouse. One blue line from the start or the end of the route appears. Its origin indicates where the new via point will be appended.
de: Ein neuer Punkt einer Route kann auch vor dem Start- oder nach dem Endpunkt hinzugefügt werden. Das funktioniert wie das Einfügen von Zwischenpunkten, Sie müssen dabei aber die Taste &Ctrl; beim Verschieben des Mauszeigers drücken. Eine blaue Linie vom Start- oder Endpunkt dann gezeichnet. Der Ursprung dieser Linie zeigt an, wo der neue Routenpunkt angefügt wird.

source: Existing via points can be moved freely across the map. Move the mouse pointer above a via point and drag it to its new location. Once released, the route will be updated automatically.
de: Vorhandene Zwischenpunkte können beliebig auf der Karte verschoben werden. Klicken Sie mit der &LMBn; auf einen Zwischenpunkt und ziehen Sie ihn an die neue Position. Wenn Sie die Maustaste loslassen, wird die Route automatisch aktualisiert.

source: To exclude via points from the route, remove them. This can be done using either the <guilabel>Remove</guilabel> button next to the via point input field or by clicking with the &RMB; on the via point in the map. In the context menu, choose <guilabel>Remove this destination</guilabel>. To start an entirely new route, remove all via points.
de: Um Zwischenpunkte von der Route zu entfernen, klicken Sie entweder auf den Knopf <guilabel>Entfernen</guilabel> rechts neben dem Eingabefeld für diesen Punkt oder klicken Sie mit der &RMBn; auf einen Zwischenpunkt in der Karte. Wählen Sie dann im Kontextmenü <guilabel>Diese Ziel entfernen</guilabel>. Um eine ganz neue Route zu planen, entfernen Sie alle Punkte.

source: Loading, Saving and Exporting Routes
de: Routen laden, speichern und exportieren

source: You can save routes in <acronym>kml</acronym> (Keyhole Markup Language) format and load them again at a later point - on the same computer or a different device running &marble;, or share them with your friends or other applications which are able to read kml files (like Google Earth). To save a route to a .kml file, click on the <guilabel>Save</guilabel> icon on the bottom of the routing tab. The upcoming save dialog allows you to choose a file name to save the route to. Similarly loading a route is initiated with the <guilabel>Open</guilabel> icon on the bottom of the routing tab. Select the .kml route file to open in the upcoming open dialog and &marble; loads the route from it.
de: Sie können Routen im Format <acronym>kml</acronym> (Keyhole Markup Language) speichern und sie später wieder laden - auf denselben Rechner oder ein anderes Gerät, auf dem &marble; läuft. Oder geben Sie diese Routen weiter, die dann in allen Anwendungen benutzt werden können, die Dateien im Format <acronym>kml</acronym> wie Google Earth lesen können. Um eine Route als <acronym>kml</acronym>-Datei zu speichern, klicken Sie auf das Symbol <guilabel>Speichern</guilabel> unten auf der Karteikarte Routenplaner. Das Laden einer Route starten Sie durch Klicken auf das Symbol <guilabel>Öffnen</guilabel> unten auf dieser Karteikarte. Wählen Sie dann dir <acronym>kml</acronym>-Routendatei im Dateidialog und laden Sie damit wieder in &marble;

source: Routes planned in &marble; can be used in other applications or navigation devices which support <acronym>gpx</acronym> (GPS eXchange Format) or equivalent formats. If your navigation device does not support <acronym>gpx</acronym> directly, you can use a conversion utility like gpsbabel to convert a <acronym>gpx</acronym> file exported by &marble; to a suitable format. The export of a route in &marble; is initiated from the routing context menu in the map. Click with the &RMB; on any point of the route in the map. In the context menu that appears, choose <guilabel>Export route...</guilabel>:
de: Routen, die mit &marble; geplant wurden, können in anderen Programmen und Navigationsgeräten verwendet werden, die das Format <acronym>gpx</acronym> (GPS eXchange Format) oder gleichwertige Formate unterstützen. Kann Ihr Navigationsgerät das Format <acronym>gpx</acronym> nicht einlesen, benutzen Sie Programme wie gpsbabel, um eine von &marble; exportierte <acronym>gpx</acronym>-Datei in ein passendes Format umzuwandeln.Zum Export einer Route in &marble; benutzen Sie das Kontextmenü der Karte. Klicken Sie mit der &RMBn; auf einen beliebten Punkt der Route und wählen Sie dann <guilabel>Route exportieren ...</guilabel>.

source: &marble; route export
de: Routenexport in &marble;

source: &marble; Exporting a Route
de: Export einer Route in &marble;

source: Enter the desired filename in the upcoming save dialog. The filename extension should be <filename class="extension">gpx</filename> to store in <acronym>gpx</acronym> format or <filename class="extension">kml</filename> to store in <acronym>kml</acronym> (Keyhole Markup Language) format. Note that the internal format of &marble; is <acronym>kml</acronym>; in doubt save routes as <acronym>kml</acronym> and only use <acronym>gpx</acronym> to share routes with other applications that are not capable of reading <acronym>kml</acronym> files.
de: Geben Sie den gewünschten Dateinamen im Dateidialog ein. Als Dateierweiterung sollten Sie <filename class="extension">gpx</filename> zur Speicherung im Format <acronym>gpx</acronym> oder <filename class="extension">kml</filename> zur Speicherung im Format <acronym>kml</acronym> (Keyhole Markup Language) verwenden. Beachten Sie, dass &marble; intern das Format <acronym>kml</acronym> benutzt. Daher wählen Sie im Zweifelsfall diese Format für den Export. Das Format <acronym>gpx</acronym> sollten Sie nur verwenden, um Routen für Anwendungen zu exportieren, die das Format <acronym>kml</acronym> nicht lesen können.

source: Measuring distances with &marble;
de: Entfernungsmessung mit &marble;

source: As mentioned already &marble; always displays a dynamic scale bar on the lower left to estimate distances on the map. Together with the windrose in the top right corner these overlays are provided for better orientation. But there's more: &marble; allows you to measure distances between two or more points on earth. To do so click the respective points in correct order on the globe using the &RMB;. On each click a popup menu will appear which allows you to add a measure point (<guilabel>Add Measure Point</guilabel>) or to remove all measure points altogether (<guilabel>Remove Measure Points</guilabel>):
de: Wie bereits erwähnt zeigt &marble; links unten immer einen dynamischen Größenmaßstab an, um Entfernungen auf der Karte abschätzen zu können. Zusammen mit der Windrose in der rechten oberen Ecke dienen diese Einblendungen der besseren Orientierung. Aber das ist nicht alles: Mit &marble; können Sie Entfernungen zwischen zwei oder mehr Punkten auf der Erde messen. Dazu klicken Sie mit der &RMBn; in der richtigen Reihenfolge auf die entsprechenden Punkt. Bei jedem Mausklick erscheint ein Aufklappmenü, mit dem Sie einen Messpunkt hinzufügen (<guilabel>Messpunkt hinzufügen</guilabel>) oder alle Messpunkt löschen können (<guilabel>Messpunkte entfernen</guilabel>).

source: &marble; measuring
de: &marble; Messungen

source: &marble; measuring distances
de: Entfernungsmessung mit &marble;

source: Once you have added at least two measure points, the total distance will be displayed in the top left corner of the map. &marble; will assume a spherical earth for all measurements which should be accurate enough for most cases.
de: Sobald mindestens zwei Messpunkte vorliegen, wird die Gesamtentfernung in der linken oberen Ecke der Karte angezeigt. &marble; nimmt bei allen Berechnungen eine Kugelgestalt der Erde an, was für die meisten Fälle eine ausreichende Genauigkeit bieten sollte.

source: Displaying of distances and bearings for the measured segments can be configured using <link linkend="measure-tool-config">Measure Tool configuration dialog</link>.
de: Die Anzeige der Entfernung und Position für die gemessenen Abschnitte kann im Einrichtungsdialog für das <link linkend="measure-tool-config">Messwerkzeug</link> eingestellt werden.

source: Download Map Regions
de: Kartenregionen herunterladen

source: Pre-installed with a set of maps, &marble; is ready to use. When you zoom in at places, more detailed parts of the current map theme are downloaded in the background. This works excellent whenever an Internet connection is available. What to do, however, when traveling to a foreign city where no constant Internet connection is available to download maps? Plan ahead and download those map regions you are going to use.
de: &marble; hat einen vorinstallierten Satz von Karten und kann sofort benutzt werden. Wenn Sie einen Kartenausschnitt vergrößern, werden weitere Teile der aktuellen Karte mit höherer Auflösung im Hintergrund heruntergeladen. Dies funktioniert mit einer Internetverbindung ausgezeichnet. Was aber, wenn Sie in eine andere Stadt reisen möchten, wo es keine Internetverbindung zum Herunterladen von Karten gibt? Dann müssen Sie die Karten für diese Region vorher herunterladen.

source: To understand what needs to be downloaded to display certain parts of the map offline, let's briefly look into the concept of tiles which &marble; uses internally. A tile is an image which corresponds to a certain part of the map. Tiles are arranged by &marble; next to each other to form the map image that is displayed to you. Depending on the selected projection mode, tiles are arranged to form a rectangle (Flat Map Projection, left) or a sphere (Globe Projection, right):
de: Um verstehen zu können, was zur Anzeige bestimmter Bereiche einer Karte ohne Internetverbindung heruntergeladen werden muss, folgt hier ein kurzer Überblick über das Kachel-Konzept, das &marble; intern benutzt. Eine Kachel ist ein Bild für einen bestimmten Ausschnitt der Karte. Kacheln werden in &marble; aneinander gelegt, um das Kartenbild zur Anzeige zu erstellen. Abhängig von der ausgewählten Projektionsart werden Karten in einem Rechteck für die flache Karte links und auf einer Kugel für die Globus-Projektion rechts.

source: &marble; projections
de: &marble; Projektionen

source: Tiles at Level 1 in Flat Map (left) and Globe Projection (right)
de: Kacheln in Stufe 1 in der flachen Karte (links) und der Globus-Projektion (rechts)

source: Zooming in at this view, more details need to be displayed. The tiles shown in the two screenshots above are too coarse then; &marble; automatically recognizes this and changes to the next tile level where images provide more details. This keeps going: The more you zoom in, the higher the tile level. The following sketch illustrates the different number of tiles (colored) corresponding to the same map region at different tile levels:
de: Bei der Vergrößerung dieser Ansicht müssen mehr Einzelheiten angezeigt werden. Die in den beiden vorigen Bildschirmfotos verwendeten Kacheln haben dafür keine ausreichende Auflösung. &marble; erkennt das automatisch und wechselt zur nächsten Kachelstufe, in der die Bilder mehr Einzelheiten enthalten. Dieser Ablauf wiederholt sich immer wieder: je mehr Sie die Ansicht vergrößern, desto größer wird die Kachelstufe. Die folgende Skizze zeigt farbig die unterschiedliche Anzahl von Kacheln für dieselbe Kartenregion in verschiedenen Kachelstufen.

source: &marble; tile levels
de: Kachelstufen in &marble;

source: Different Tile Levels in &marble;
de: Verschiedene Kachelstufen in &marble;

source: When downloading a map region for offline usage, you need to download all tiles in the desired region for all tile levels you plan to use. Because of the connection between tile levels and zoom levels, you can think of it as downloading all tiles in the zoom levels you plan to use.
de: Möchten Sie Karten herunterladen, um sie ohne Internetverbindung zu benutzen, benötigen Sie alle Kacheln für die gewünschte Region in allen zu verwendenden Kachelstufen. Da Kachel- und Vergrößerungsstufen von einander abhängen, müssen Sie alle Kacheln in den Vergrößerungsstufen, die Sie benutzen möchten, herunterladen.
