Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdeedu/pairseditor.po
Languages: de

source: The Pairs Editor Handbook
de: Das Handbuch zu Pairs-Editor

source: <firstname>This documentation was converted from the KDE UserBase <ulink url="http://userbase.kde.org/Pairs/Editor">Pairs/Editor</ulink> page.</firstname> <surname></surname>
de: <firstname>Dieses Handbuch wurde aus der <ulink url=" http://userbase.kde.org/Pairs/Editor">Pairs/Editor</ulink>-Webseite der &kde;-Userbase erstellt.</firstname> <surname></surname>

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Burkhard</firstname><surname>Lück</surname><affiliation><address><email>lueck@hube-lueck.de</email></address></affiliation><contrib>Übersetzung</contrib></othercredit>

source: <application>Pairs</application> editor is a part of <application>Pairs</application> Project. It can be used to make and edit themes for <application>Pairs</application>.
de: <application>Pairs</application>-Editor ist Bestandteil des Projekts <application>Pairs</application>. Mit dieser Anwendung können Designs für <application>Pairs</application> erstellt und bearbeitet werden.

source: Education
de: Lernprogramme

source: Sound
de: Klang

source: Image
de: Bild

source: theme
de: Design

source: Main Toolbar
de: Haupt-Werkzeugleiste

source: It consists of 5 buttons which can be resized or whose text can be altered.
de: In der Werkzeugleiste gibt es fünf Knöpfe, deren Größe und Text geändert werden kann.

source: <title>New</title>
de: <title>Neu</title>

source: The button can be used to create a new theme.
de: Mit diesem Knopf wird ein neues Design erstellt.

source: Open
de: Öffnen

source: This button can be used to open an existing theme.
de: Mit diesem Knopf kann eine vorhandenes Design geöffnet werden.

source: Save/Save as
de: Speichern / Speichern unter

source: These two buttons are used to save the created theme.
de: Mit diesen beiden Knöpfen wird ein erstelltes oder geändertes Design gespeichert.

source: <title>Try</title>
de: <title>Ausprobieren</title>

source: <guilabel>Try</guilabel> button is used for trying the theme that is created. It will launch <application>Pairs</application> with the new theme.
de: Dieser Knopf kann dazu verwendet werden, das bearbeitete Design auszuprobieren. Das Programm <application>Pairs</application> wird mit dem geöffneten Design gestartet.

source: Creating a new theme
de: Erstellung eines neuen Designs

source: Creating a new theme is quite easy and can be done using the following steps:
de: Ein neues Design zu erstellen ist recht einfach und erfordert folgende Schritte:

source: Assign a Title, Description, Author, Date and version to the theme
de: Eingabe von Titel, Beschreibung, Autor, Datum und Version für das Design.

source: The <guilabel>Main Type</guilabel> describes the type of a theme. For example, <guilabel>Image</guilabel> type is used if the theme is for pairing the images.
de: Der <guilabel>Haupttyp</guilabel> beschreibt die Art des Designs. Der Typ <guilabel>Bild</guilabel> zum Beispiel wird für ein Design aus Bilderpaaren verwendet.

source: Include a back image. This image will be used in <application>Pairs</application> as the image that would be displayed on the back of the cards.
de: Fügen Sie ein Bild für die Rückseite hinzu. Dieses Bild wird in <application>Pairs</application> auf der Rückseite der Karten angezeigt.

source: Add elements to the theme by pressing <inlinemediaobject> <imageobject> <imagedata fileref="Icon-list-add.png" format="PNG"/> </imageobject> </inlinemediaobject> and add images, words or sound to the elements. Elements are used for defining relation between two images, words or sounds. For example: Adding two images in one element will make those a pair. In case of sounds, Two sounds are added in an element to make them a pair. And two words can also be added to make them a pair. Adding a sound and an image together in an element will make them a pair too.
de: Mit <inlinemediaobject> <imageobject> <imagedata fileref="Icon-list-add.png" format="PNG"/> </imageobject> </inlinemediaobject> werden Elemente zum Design hinzugefügt. Diesen Elementen weisen Sie dann Bilder, Wörter oder Klänge zu. Elemente definieren die Beziehung zwischen zwei Bildern, Wörtern oder Klängen. Fügen Sie zum Beispiel zwei Bilder zu einem Element hinzu, wird daraus ein Paar. Das gilt ebenso für zwei Klänge oder zwei Wörter und sogar für einen Klang und ein Bild.

source: Include <guilabel>Found Sound</guilabel>. Found sound is a sound that is played when the element is correctly matched in <application>Pairs</application>. There should be only one found sound for one element.
de: Fügen Sie einen <guilabel>Treffer-Klang</guilabel> hinzu. Dieser Klang wird abgespielt, wenn passende Paare in <application>Pairs</application> aufgedeckt werden. Für jedes Element gibt es nur einen Klang für diese Aktion.

source: Add more Elements. Adding elements increases the number of pairs in the game which can be useful when more number of outcomes are needed.
de: Fügen Sie weitere Elemente hinzu. Damit wird die Anzahl der Paare im Spiel vergrößert und das Spiel interessanter und schwieriger.

source: After doing the mentioned steps, save your theme and hit the <guilabel>Try</guilabel> button. It will launch <application>Pairs</application> with your theme.
de: Nach diesen Schritten speichern Sie Ihr Design und drücken auf den Knopf <guilabel>Ausprobieren</guilabel>. Dann wird <application>Pairs</application> mit Ihrem geöffneten Design gestartet.

source: Credits and License
de: Danksagungen und Lizenz

source: Documentation Copyright see the UserBase <ulink url="http://userbase.kde.org/index.php?title=Pairs/Editor&amp;action=history">Pairs/Editor page history</ulink>
de: Copyright der Dokumentation: siehe <ulink url="http://userbase.kde.org/index.php?title=Pairs/Editor&amp;action=history">Versionsgeschichte der Pairs/Editor-Seite</ulink>

source: CREDIT_FOR_TRANSLATORS
de: <para>Übersetzung Burkhard Lück<email>lueck@hube-lueck.de</email></para>
