Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdeedu/rocs_apiRootedTreestructure.po
Languages: de

source: Scripting API for Rooted Tree Backend
de: Skript-API für das Backend „Wurzelbaum“

source: Rooted Tree Data Structure
de: Datenstruktur „Wurzelbaum“

source: The data structure properties dialog allows access to configure settings specific to the Graph backend. There, by checking the <guilabel>Show all pointers</guilabel> property, all pointers between the tree nodes are shown. If unchecked, multiple pointers between same nodes are collapsed to one.
de: Im Dialog <guilabel>Eigenschaften der Datenstruktur</guilabel> finden Sie die die Einstellungen für ein bestimmtes Graphen-Backend. Kreuzen Sie in diesem Dialog <guilabel>Alle Zeiger anzeigen</guilabel> an, dann werden alle Zeiger zwischen den Baumknoten angezeigt. Ist diese Einstellung nicht aktiv, werden mehrere Zeiger zwischen denselben Knoten zusammengefasst.

source: The Rooted Tree Structure
de: Die Struktur „Wurzelbaum“

source: Given a data structure object of type "Rooted Tree", the following properties can be read or written:
de: Für jedes Datenstrukturobjekt vom Typ „Wurzelbaum“ können folgende Eigenschaften geschrieben oder gelesen werden:

source: ShowAllPointers // set to true if show all edges, set to false if multiple edges shall be compressed
de: ShowAllPointers // wenn wahr, werden alle Kanten angezeigt. Setzen Sie dies auf falsch, wenn mehrfache Kanten zusammengefasst werden sollen

source: Given a data structure object of type "Rooted Tree", you can call the following member functions:
de: Mit einem Datenstrukturobjekt vom Typ „Wurzelbaum“ können Sie folgende Member-Funktionen aufrufen:

source: node add_data(string name); // add a node to tree with given name void set_root_node(node root); // set root as root node of the tree node root_node(); // return root node of the tree
de: node add_data(string name); // fügt einen Knoten mit dem angegebenen Namen zum Baum hinzu void set_root_node(node root); // setzt root als Wurzel des Baums node root_node(); // gibt den Wurzelknoten des Baums zurück

source: Rooted Tree Nodes
de: Knoten von Wurzelbäumen

source: Given a node object of type "Rooted Tree", the following properties can be read or written:
de: Für ein Knotenobjekt vom Typ „Wurzelbaum“ können folgende Eigenschaften geschrieben oder gelesen werden:

source: int numberOfChilds // set the number of (allowed) children for this node node left_child // read only: node that is the left child node right_child // read only: node that is the right child node node_parent // read only: node that is the parent
de: int numberOfChilds // setzt die Anzahl der zulässigen Unterknoten für diesen Knoten node left_child // nur lesbar: gibt den linken Unterknoten zurück node right_child // nur lesbar: gibt den rechten Unterknoten zurück node node_parent // nur lesbar: gibt den übergeordneten Knoten zurück

source: Given a node object of type "Rooted Tree", you can call the following member functions:
de: Mit einem Knotenobjekt vom Typ „Wurzelbaum“ können Sie folgende Member-Funktionen aufrufen:

source: node add_left_child(node child); // add left child node add_right_child(node child); // add right child node add_child(node child, int i); // add a child as the i-th child of the node node add_node_parent(node child); // add parent (only successful if no parent set, yet) node left_child(); // return right child node right_child(); // return left child node child_at(int i); // return the i-th child of the node node node_parent(); // return the node's parent
de: node add_left_child(node child); // linken Unterknoten hinzufügen node add_right_child(node child); // rechten Unterknoten hinzufügen node add_child(node child, int i); // Unterknoten als n-ten Unterknoten zum Knoten hinzufügen node add_node_parent(node child); // Übergeordneten Knoten hinzufügen (nur möglich, wenn noch nicht vorhanden) node left_child(); // rechten Unterknoten zurückgeben node right_child(); // linken Unterknoten zurückgeben node child_at(int i); // n-ten Unterknoten des Knotens zurückgeben node node_parent(); // Übergeordneten Knoten zurückgeben

source: Rooted Tree Edges
de: Kanten von Wurzelbäumen

source: Given edges of a data structure of type "Rooted Tree", only the properties of the base data structure are available.
de: Für Kanten einer Datenstruktur vom Typ „Wurzelbaum“ sind nur die Eigenschaften der Basis-Datenstruktur verfügbar.
