Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdeedu/rocs_apiDatastructure.po
Languages: de

source: Scripting API for every Data Structure
de: Skript-API für jede Datenstruktur

source: Abstract Data Structure Object
de: Abstraktes Datenstruktur-Objekt

source: The abstract data structure defines a set of data elements and possible connections between them, this is the prototype for every other data structure. Data structures are identified by their names. Assuming you created a data structure with name <literal>testgraph</literal>, then you can access the data structure simply by writing this identifier. For example, to get an array with all data elements in the given data structure, you can write <literal>testgraph.list_nodes();</literal> in the script.
de: Die abstrakte Datenstruktur definiert eine Menge von Datenelementen und mögliche Verbindungen zwischen Ihnen. Dies ist der Prototyp aller weiteren Datenstrukturen. Datenstrukturen werden über ihren Namen identifiziert. Haben Sie eine Datenstruktur mit dem Namen <literal>testgraph</literal> erstellt, dann können Sie über diesen Namen auf die Datenstruktur zugreifen. Um zum Beispiel ein Feld mit allen Datenelementen einer Struktur zu erhalten, verwenden Sie <literal>testgraph.list_nodes();</literal> im Skript.

source: Properties
de: Eigenschaften

source: The unique name of this data structure.
de: Der eindeutige Name dieser Datenstruktur.

source: Abstract Data
de: Abstraktes Datenelement

source: An abstract data element is a unit of information that belongs to an abstract data structure and possibly is connected to other data elements by pointers.
de: Ein abstraktes Datenelement ist eine Einheit von Informationen, die zu einer abstrakten Datenstruktur gehören, und kann mit anderen Datenelementen durch Zeiger verbunden sein.

source: The size of this data element.
de: Die Größe dieses Datenelements.

source: The x-coordinate of this data element.
de: Die X-Koordinate dieses Datenelements.

source: The y-coordinate of this data element.
de: Die y-Koordinate dieses Datenelements.

source: The unique identifier of this data element.
de: Der eindeutige Bezeichner für dieses Datenelement.

source: The color of this data element stated as hexadecimal value.
de: Die Farbe dieses Datenelements als Hexadezimalwert.

source: Abstract Pointer
de: Abstrakter Zeiger

source: A pointer connects two data elements and can itself hold information by its properties.
de: Ein Zeiger verbindet zwei Datenelemente und kann Informationen über seine Eigenschaften enthalten.

source: The width of the connection.
de: Die Breite der Verbindung.

source: If true, the connection is directed. Otherwise is connection is undirected.
de: Falls wahr, ist die Verbindung gerichtet, andernfalls ist sie ungerichtet.

source: Start of the connection.
de: Der Start der Verbindung.

source: End of the connection
de: Das Ende der Verbindung

source: ID of the connection type.
de: Kennung des Verbindungstyps.

source: Methods
de: Methoden

source: Remove this connection.
de: Entfernt diese Verbindung.

source: Add a new property to the connection.
de: Fügt der Verbindung eine neue Eigenschaft hinzu.

source: Remove an existing property from the connection.
de: Entfernt eine bestehende Eigenschaft der Verbindung.
