Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdeedu/rocs_chapterImportExport.po
Languages: de

source: Import and Export
de: Import und Export

source: Exchange &rocs; Projects
de: &rocs;-Projekte austauschen

source: &rocs; projects can be imported and exported as archived <literal>.tar.gz</literal> files. These archives can be used to exchange projects. Import and Export can be done with <menuchoice><guimenu>Graph Document</guimenu> <guimenuitem>Import Graph</guimenuitem></menuchoice> and <menuchoice><guimenu>Graph Document</guimenu> <guimenuitem>Export Graph as</guimenuitem></menuchoice>, respectively.
de: &rocs;-Projekte können als Archivdateien im Format <literal>.tar.gz</literal> importiert und exportiert werden. Diese Archive können zum Austausch von Projekten benutzt werden. Der Import und Export erfolgt mit <menuchoice><guimenu>Graphendokument</guimenu> <guimenuitem>Graphen importieren</guimenuitem></menuchoice> beziehungsweise <menuchoice><guimenu>Graphendokument</guimenu> <guimenuitem>Graphen exportieren unter ...</guimenuitem></menuchoice>

source: Import and Export of Graph Documents
de: Import und Export von Graphendokumenten

source: &rocs; currently supports import and export of the following file formats:
de: &rocs; unterstützt zurzeit den Import und Export folgender Dateiformate:

source: DOT files, also known as Graphviz files
de: DOT-Dateien, auch als Graphviz-Dateien bekannt.

source: GML files
de: GML-Dateien

source: Trivial Graph Format files
de: „Trivial Graph“-Dateien

source: Keyhole Markup Language Format
de: Keyhole-Markup-Sprachformat

source: Trivial Graph File Format
de: „Trivial Graph“-Dateiformat

source: The <emphasis>Trivial Graph Format</emphasis> (TGF) is a simple text-based file format for describing graphs. A TGF file consists of a list of node definitions, that map the node IDs to labels, followed by a list of the edges. In this format it is only possible to have one label per node and one value per edge. &rocs; interprets imported graphs as undirected graphs. Exported graphs will contain two edges per connection if connections are bidirectional.
de: Das <emphasis>„Trivial Graph“-Format</emphasis> (TGF) ist ein einfaches textbasiertes Dateiformat zur Beschreibung von Graphen. Eine TGF-Datei besteht aus einer Liste von Knotendefinitionen mit der Zuordnung von Kennungen zu Beschriftungen, gefolgt von einer Liste von Kanten. In diesem Format kann es nur eine Beschriftung für einen Knoten und einen Wert für eine Kante geben. &rocs; interpretiert importierte Graphen als ungerichtet. Exportierte Graphen enthalten zwei Kanten für jede zweiseitige Verbindung.

source: Format Specification
de: Beschreibung des Formats

source: The file starts with a list of nodes (one node per line), followed by a line with the only character "#", followed by a list of edges (one edge per line).
de: Die Datei beginnt mit einer Liste der Knoten, jeder Knoten auf einer einzelnen Zeile. Dann folgt eine Zeile nur mit dem Zeichen „#“, gefolgt von einer Liste von Kanten in einer eigenen Zeile.

source: A node consists of an integer (identifier), followed by a space, followed by an arbitrary string.
de: Ein Knoten wird durch eine ganze Zahl als Kennung, dann ein Leerzeichen und ein beliebiger Text beschrieben.

source: An edge consists of two integers (identifiers) separated by a space, followed by a space, followed by an arbitrary string. It is assumed that the directed edge points from the first identifier to the second identifier.
de: Die Beschreibung einer Kante besteht aus zwei ganzen Zahlen (Kennungen von Knoten), durch Leerzeichen getrennt, dann folgt nach einem Leerzeichen ein beliebiger Text. Es wird angenommen, dass die gerichtete Kante von der ersten zur zweiten Kennung zeigt.

source: Example
de: Beispiel

source: DOT Language / Graphviz Graph File Format
de: DOT-Sprache / Graphviz.Graphendateiformat

source: The DOT language is a plain text graph description language that allows both,a good human readable representation of graphs as well as an efficient processing by graph layout programs. DOT is the default file format for the Graphviz graph visualization suite, but is also widely used by other graph tools. The usual file endings for DOT are <emphasis>.gv</emphasis> and <emphasis>.dot</emphasis>.
de: „DOT“ ist eine Beschreibungssprache für Graphen, die ein einfaches Textformat verwendet. Damit ist die Darstellung von Graphen für den Benutzer gut lesbar und sie kann effizient durch Anzeigeprogramme für Graphen verarbeitet werden. „DOT“ ist das Standardformat für das Visualisierungsprogramm Graphviz, wird aber auch häufig von anderen Graphenprogrammen verwendet. „DOT“-Dateien haben üblicherweise die Erweiterung <emphasis>.gv</emphasis> und <emphasis>.dot</emphasis>.

source: Unsupported Features
de: Nicht unterstützte Fähigkeiten

source: &rocs; can parse every graph file that contains a graph specified according to the DOT language specification<footnote><para>http://www.graphviz.org/content/dot-language</para></footnote>. The support of language features is complete, despite of the following exceptions:
de: &rocs; kann jede Graphendatei einlesen und verarbeiten, die in der Sprache „DOT“<footnote><para>http://www.graphviz.org/content/dot-language</para></footnote> spezifizierte Graphen enthält. Die Funktionen der Sprache werden vollständig mit folgenden AUsnahmen unterstützt:

source: subgraph: Due to the lack of a subgraph concept in &rocs;, subgraphs are only imported as a set of date elements and connections. Especially, connections to or from subgraphs are not imported.
de: Untergraph: Wegen des fehlenden Konzepts für Untergraphen in &rocs; werden Untergraphen nur als Menge von Datenelementen und Verbindungen importiert. Besonders Verbindungen zu oder von Untergraphen werden nicht importiert.

source: &HTML; and &XML; attributes: Attributes (like labels) that contain &HTML; or &XML; syntax are read unchanged. Especially, not adjustment of fonts and styles are read from those attributes.
de: &HTML; und &XML; Attribute: Attribute wie Beschriftungen mit &HTML;- oder &XML;-Syntax werden unverändert eingelesen. Insbesondere werden keine Anpassungen für Schriften und Stile aus diesen Attributen eingelesen.
