Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdeedu/step_tutorials.po
Languages: de

source: Getting familiar with &step;: the tutorials
de: Einführung zu &step;: Die Anleitungen

source: The <menuchoice><guimenu>File</guimenu><guimenuitem>Open Tutorial...</guimenuitem></menuchoice> menu action brings you a file dialog where you can load &step; built-in tutorials. There are five tutorials and you will progressively learn how to interact with each of &step; element. The best is to start with the first tutorial by clicking on the file <filename>tutorial1.step</filename>. This will display Tutorial 1 in &step;.
de: Mit dem Menüeintrag <menuchoice><guimenu>Datei</guimenu><guimenuitem>Anleitung öffnen ...</guimenuitem></menuchoice> wird ein Dialog angezeigt, in dem Sie die mit &step; mitgelieferten Anleitungen öffnen können. Es gibt fünf Anleitungen mit denen Sie Schritt für Schritt lernen, mit allen Elementen in &step; umzugehen. Starten Sie mit der ersten Anleitung, klicken Sie dazu auf die Datei <filename>tutorial1.step</filename>. Diese Anleitung wird jetzt in &step; geöffnet.

source: If you do not see the tutorial properly you can try to zoom in to display it better.
de: Wird eine Anleitung nicht richtig angezeigt, drücken Sie auf <guibutton>Vergrößern</guibutton> in der Werkzeugleiste.

source: The <guilabel>World</guilabel> panel on the right lists all the objects you have on your scene. By clicking on an object here, the <guilabel>Properties</guilabel> panel below displays this object properties. You can change the properties here by clicking on the one you want to modify.
de: Das Fenster <guilabel>Welt</guilabel> zeigt eine Liste aller Objekte in Ihrem Experiment. Wenn Sie in dieser Liste auf ein Objekt klicken, werden seine <guilabel>Eigenschaften</guilabel> im Fenster darunter angezeigt. Klicken Sie auf einen der Werte, um ihn zu ändern.

source: Each tutorial consists in some text presenting the new elements and explaining their properties. Then you are asked to change some properties of the elements in order to achieve a new result of the experiment.
de: Jede Anleitung besteht aus Texten, die die neuen Elemente vorstellen und ihre Eigenschaften erklären. Ändern Sie jetzt einige Eigenschaften der Objekte, um zu sehen, wie sich dies auf Ihr Experiment auswirkt.

source: Tutorial 1: bodies and springs
de: Anleitung 1: Körper und Federn

source: This tutorial presents you bodies and springs and how to start your first simulation.
de: Diese Anleitung stellt Körper und Federn vor und zeigt, wie eine Simulation gestartet wird.

source: A physical body or body for short is an object which can be described by the theories of classical mechanics, or quantum mechanics, and experimented upon with physical instruments. This includes the determination of position, and in some cases the orientation in space, as well as means to change these, by exerting forces.
de: In der Physik ist ein Körper ein Objekt, das mit den Theorien der klassischen Mechanik oder der Quantenmechanik beschrieben werden kann und das im Experiment mit Instrumenten untersucht werden kann. Dazu gehören die Bestimmung der Position und in einigen Fällen auch der Orientierung im Raum wie auch die Möglichkeit zur Änderung dieser Werte durch einwirkende Kräfte.

source: A spring is a flexible elastic object used to store mechanical energy.
de: Eine Feder ist ein elastischer verformbarer Körper, der mechanische Energie speichert.

source: <screeninfo>Tutorial 1 experiment</screeninfo>
de: <screeninfo>Experiment 1</screeninfo>

source: <phrase>Tutorial 1 experiment</phrase>
de: <phrase>Experiment 1</phrase>

source: The physical experiment in this tutorial represents two disks linked by a spring. Disks have an initial velocity in a tangential direction (the little blue arrow) and an acceleration (the red arrow) and springs have a stiffness and the length can be changed. Running the experiment you can see the disks being pulled and pushed by the spring. The tutorial invites you to modify the spring stiffness and also to try to change the system experiment.
de: Das Experiment in dieser Anleitung zeigt zwei Scheiben, die durch eine Feder verbunden sind. Die Scheiben haben eine Anfangsgeschwindigkeit (ein kleiner blauer Pfeil) und eine Beschleunigung (roter Pfeil). Federn haben eine Steifigkeit und eine Länge, die verändert werden kann. Wenn sie die Simulation starten, sehen Sie, wie die Scheiben durch die Feder zusammengezogen und abgestoßen werden. Verändern Sie in diesem Experiment die Eigenschaften der Objekte wie zum Beispiel die Steifigkeit der Feder und beobachten Sie die Änderungen im Versuchsablauf.

source: At the end of this tutorial you should be more familiar with &step; interface and you should also be able to easily change bodies properties.
de: Am Ende dieser Anleitung sollten Sie mit der Bedienungsoberfläche von &step; vertraut und in der Lage sein, die Eigenschaften von Objekten zu ändern.

source: Tutorial 2: controllers and graphs
de: Anleitung 2: Schieberegler und Diagramme

source: You will learn more about controllers and graphs in this tutorial.
de: In dieser Anleitung lernen Sie Schieberegler und Diagramme kennen.

source: A controller is a device which allows you to graphically modify a property of a body or a spring. In the tutorial, the controller allows you to change the stiffness of the spring "spring1". By moving the slider to the right or using the W key you can increase spring1 stiffness value and by moving the slider to the left or using the Q key you can decrease it. Right-clicking on the controller brings you several context actions and the <guilabel>Configure Controller...</guilabel> dialog allows you to change each property of the controller.
de: Ein Schieberegler ist ein Gerät, um die Eigenschaften von Körpern oder Federn grafisch zu verändern. In dieser Anleitung können Sie die Steifigkeit der „Feder1“ mit einem Schieberegler beeinflussen. Durch Verschieben des Reglers nach rechts oder mit der Kurzwahltaste „W“ erhöhen Sie den Wert der Steifigkeit, durch Verschieben des Reglers nach links oder mit der Kurzwahltaste „Q“ verringern Sie ihn. Klicken mit der &RMBn; auf den Schieberegler zeigt ein Kontextmenü mit diesen Aktionen an, außerdem können Sie durch Auswahl von <guilabel>Schieberegler einrichten ...</guilabel> einen Dialog zur Änderung aller Eigenschaften dieses Reglers öffnen.

source: <screeninfo>Tutorial 2 experiment</screeninfo>
de: <screeninfo>Experiment 2</screeninfo>

source: <phrase>Tutorial 2 experiment</phrase>
de: <phrase>Experiment 2</phrase>

source: Graphs allow you to graphically visualize the relationship between two variables. The example in the tutorial prints the evolution of the position of particle1 while time advances in world1. With a right click on a graph you can clear or delete the graph as well as edit the configuration dialog and change here all the properties for this graph.
de: In Diagrammen können Sie die Beziehung zwischen zwei Variablen grafisch darstellen. Im Experiment in dieser Anleitung wird die Position von Teilchen1 während des Ablaufs des Experiments in der Welt1 dargestellt. Klicken Sie mit der &RMBn; auf das Diagramm, dann können sie es entfernen, in den Anfangszustand zurücksetzen und auch einen Einrichtungsdialog öffnen, um darin alle Eigenschaften dieses Diagramms zu bearbeiten.

source: At the end of this tutorial you are able to use controllers to act on your bodies properties and graphs to monitor specific properties in your experiment.
de: Am Ende dieser Anleitung sollten Sie in der Lage sein, mit Schiebereglern die Eigenschaften von Objekten zu verändern und mit Diagrammen bestimmte Eigenschaften im Experiment grafisch darzustellen.

source: Tutorial 3: rigid bodies and tracers
de: Anleitung 3: Starre Körper und Spuren

source: Tutorial 3 presents you rigid bodies and tracers.
de: Anleitung 3 bietet eine Einführung zu starren Körpern und Spuren ihrer Bewegung.

source: A rigid body is an idealization of a solid body of finite size in which deformation is neglected. In other words, the distance between any two given points of a rigid body remains constant in time regardless of external forces exerted on it.
de: Ein starrer Körper ist das idealisierte Modell eines Festkörpers mit endlicher Größe, der nicht verformt werden kann. D. h. der Abstand zwischen zwei bestimmten Punkten des Körpers bleibt im Experiment immer unverändert, unabhängig von den einwirkenden äußeren Kräften.

source: A tracer is a tool which shows the trajectory of a given point on a rigid body.
de: Eine Spur zeigt die Bahn der Bewegung eines Punktes auf einem starren Körper an.

source: <screeninfo>Disk properties</screeninfo>
de: <screeninfo>Eigenschaften der Scheibe</screeninfo>

source: <phrase>Disk properties</phrase>
de: <phrase>Eigenschaften der Scheibe</phrase>

source: When a rigid body (here a disk) is selected you see three grey handlers on it. Using them by clicking on them and moving them, you can change the velocity, the angle and the angular velocity of the body.
de: Wenn Sie einen starren Körper wie die Scheibe ausgewählt haben, werden drei graue Quadrate darauf angezeigt. Klicken Sie darauf und ziehen dann den Mauszeiger, so können Sie die Geschwindigkeit, den Winkel und die Winkelgeschwindigkeit des Körpers grafisch ändern.

source: <screeninfo>Tutorial 3: 2 tracers</screeninfo>
de: <screeninfo>Experiment 3: Zwei Spuren</screeninfo>

source: <phrase>Tutorial 3: 2 tracers</phrase>
de: <phrase>Experiment 3: Zwei Spuren</phrase>

source: The experiment in Tutorial 3 shows a disk and a box linked by a spring. A tracer (the blue one) is already on the box. You can add a second one: select <guilabel>Tracer</guilabel> in the <guilabel>Palette</guilabel> panel then click on the box on the point where you want the tracer to be. In the <guilabel>Properties</guilabel> panel, click on the <guilabel>color</guilabel> line and on the right of this line you can click on the blue square and a color palette appears: you can choose a new color for the tracer. The screenshot above shows two tracers after the simulation is run for a few seconds.
de: Das Experiment in Anleitung 3 besteht aus einer Scheibe und einem Rechteck, die durch eine Feder verbunden sind. Auf dem Rechteck befindet sich eine Spur. das ist der blaue Kreis. Fügen sie einen weiteren hinzu: Wählen Sie dazu das Objekt <guilabel>Spur</guilabel> in der <guilabel>Palette</guilabel> und klicken Sie dann auf einen Punkt auf dem Rechteck, dessen Bewegung verfolgt werden soll. Im Fenster <guilabel>Eigenschaften</guilabel> wählen Sie dann die Zeile <guilabel>Farbe</guilabel> aus. Dann können Sie rechts auf das blaue Quadrat klicken und damit einen Dialog zur Auswahl einer Farbe öffnen. Das Bildschirmfoto oben zeigt den Verlauf der zwei Spuren, nachdem die Simulation einige Sekunden ausgeführt wurde.

source: Tutorial 4: motors and forces
de: Anleitung 4: Motoren und Kräfte

source: You have two sorts of motors available in &step;: linear motors and circular motors. A linear motor applies a constant force to a given point on a body while a circular motor applies a constant angular momentum to a body.
de: Es gibt zwei Arten von Motoren in &step;: Linearmotoren und Drehmotoren. Linearmotoren wenden eine konstante Kraft auf einen bestimmten Punkt eines Körpers an, Drehmotoren ein konstantes Drehmoment auf einen Körper.

source: Three different forces can be added to bodies: the weight force, the gravitation force and the Coulomb force. By default all forces are turned off in &step;. Coulomb force is a force which existed intrinsically between two charges.
de: Drei verschieden Kräfte können auf einen Körper einwirken: die Gewichtskraft, die Gravitationskraft und die Coulomb-Kraft. In der Voreinstellung haben alle Kräfte in &step; den Wert Null. Die Coulomb-Kraft beschreibt die Kraft zwischen zwei kugelsymmetrisch verteilten elektrischen Ladungen.

source: <screeninfo>Tutorial 4: Motors</screeninfo>
de: <screeninfo>Experiment 4: Motoren</screeninfo>

source: <phrase>Tutorial 4: Motors</phrase>
de: <phrase>Experiment 4: Motoren</phrase>

source: In the experiment you have a disk and a box linked by a spring. A flat box at the bottom will make a boundary. The disk and the box both have a linear motor applied to them. Two controllers allow you to change the force value of each motor. Start the simulation and play with the controllers. Then stop the simulation and add a weight force in the world (forces are global and apply to the whole world). Restart the simulation and analyze the difference.
de: Dieses Experiment besteht aus einer Scheibe und einem Rechteck, die mit einer Feder verbunden sind. Das schmale Rechteck unten begrenzt den Versuchsaufbau. An der Scheibe und dem Rechteck sind jeweils ein Linearmotor angebracht. Mit den beiden Schiebereglern können Sie die Kräfte dieser Motoren verändern. Starten Sie die Simulation und ändern Sie die Kräfte der Motoren mit den Schiebereglern. Fügen Sie jetzt noch eine Gewichtskraft in diese Welt ein. Gewichtskräfte sind immer global und wirken auf alle Objekte im Experiment. Starten Sie die Simulation neu und beobachten Sie, wie sich jetzt der Ablauf des Experiments verändert.

source: You can also remove the linear motor on the box and add a circular motor instead. Click on <guilabel>CircularMotor</guilabel> in the <guilabel>Palette</guilabel> panel and then click on the box. The circular motor is applied to the box. You then need to set the torque value by clicking and moving the grey handler of the motor.
de: Ersetzen Sie den Linearmotor am Rechteck durch einen Drehmotor. Klicken Sie dazu in der <guilabel>Palette</guilabel> auf <guilabel>Drehmotor</guilabel> und dann auf einen Punkt auf dem Rechteck. Geben Sie für das Moment einem Wert ein, indem Sie mit dem linken Mauszeiger am grauen Quadrat des Motors ziehen.

source: <screeninfo>Circular motor</screeninfo>
de: <screeninfo>Drehmotor</screeninfo>

source: <phrase>Circular motor</phrase>
de: <phrase>Drehmotor</phrase>

source: This tutorial introduced you with motors and forces and you should now be able to add those to bodies.
de: Diese Anleitung zeigte die Anwendung von Motoren und Kräften, Sie sollten jetzt in der Lage sein, diese Objekte im Experiment zu benutzen.

source: Tutorial 5: joints
de: Anleitung 5: Verbindungen

source: Joints are objects that attaches bodies to each other or to the background. You have a the following joints in &step;: anchors, pins and sticks. An anchor is a joint that fixes position of the body. The body cannot move when it has an anchor. A pin is a joint that fixes one point of the body, the body can still move around the pin. A stick is a joint that fixes the distance between two points on two bodies.
de: Verbindungen sind Objekte, die Körper aneinander oder an den Hintergrund anschließen. Es gibt folgende Verbindungen in &step;: Anker, Stift und Stab. Ein Anker fixiert die Position eines Körpers, sodass der Körper nicht bewegt werden kann. Ein Stift fixiert die Position eines Punktes auf dem Körper, der Körper kann sich noch um diesen Punkt drehen. Ein Stab ist eine Verbindung, die den Abstand zwischen zwei Körpern fixiert.

source: <screeninfo>Tutorial 5: double pendulum</screeninfo>
de: <screeninfo>Experiment 5: Doppelpendel</screeninfo>

source: <phrase>Tutorial 5: double pendulum</phrase>
de: <phrase>Experiment 5: Doppelpendel</phrase>

source: Tutorial 5 describes a double pendulum.
de: Anleitung 5 beschreibt einen Versuch mit einem Doppelpendel.

source: Add a <guilabel>Particle</guilabel> to the scene then join this particle to Particle2 with a stick. Click on Stick on the <guilabel>Palette</guilabel> panel. You then need to select the first object attached to the stick (particle2) with the left mouse button then drag the mouse to the second object (particle3) and release the mouse button on particle3. You now have a triple pendulum!
de: Fügen Sie ein <guilabel>Teilchen</guilabel> zum Versuch hinzu und verbinden Sie es mit Teilchen2 durch einen Stab. Klicken Sie dazu in der <guilabel>Palette</guilabel> auf das Objekt <guilabel>Stab</guilabel>. Nun müssen Sie mit der &LMBn; das erste Objekt auswählen, das mit dem Stab verbunden wird - Teilchen2. Ziehen Sie den Mauszeiger bei gedrückter &LMBr; zum zweiten Objekt, dem Teilchen3, und lassen Sie die &LMB; dort los. Damit haben Sie ein Dreifachpendel erstellt.
