Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdeedu/step_examples.po
Languages: de

source: &step; examples
de: Beispiele für &step;

source: &step; package contains several instructive examples to help you understand the principles of the application work. To open an example from the default set choose <menuchoice><guimenu>File</guimenu> <guisubmenu>Examples</guisubmenu> <guimenuitem>Open Example...</guimenuitem></menuchoice> from the main window menu.
de: &step; enthält mehrere lehrreiche Beispiele, die Ihnen helfen, die Arbeitsweise des Programms zu verstehen. Um eines der als Standard installierten Beispiele zu laden, wählen Sie <menuchoice><guimenu>Datei</guimenu><guisubmenu>Beispiele</guisubmenu><guimenuitem>Beispiele öffnen ...</guimenuitem></menuchoice> aus dem Menü des Hauptfensters.

source: You can share your own examples with <menuchoice><guimenu>File</guimenu> <guisubmenu>Examples</guisubmenu> <guimenuitem>Share Current Experiment...</guimenuitem></menuchoice> or download examples shared by other users with <menuchoice><guimenu>File</guimenu> <guisubmenu>Examples</guisubmenu> <guimenuitem>Download New Experiments...</guimenuitem></menuchoice>. Downloaded examples can be opened using <menuchoice><guimenu>File</guimenu> <guisubmenu>Examples</guisubmenu> <guimenuitem>Open Downloaded Example...</guimenuitem></menuchoice> menu item.
de: Sie können Ihre eigenen Versuchsbeispiele mit <menuchoice><guimenu>Datei</guimenu> <guisubmenu>Beispiele</guisubmenu> <guimenuitem>Aktuelles Experiment bereitstellen ...</guimenuitem></menuchoice> für andere Benutzer hochladen oder Experimente anderer Benutzer mit <menuchoice><guimenu>Datei</guimenu> <guisubmenu>Beispiele</guisubmenu> <guimenuitem>Neue Experimente herunterladen ...</guimenuitem></menuchoice> ausprobieren.

source: You can find the descriptions of the default example files below.
de: Im Folgenden finden Sie eine kurze Beschreibung der mitgelieferten Beispiele:

source: Plots trajectory of the rigid disk interacting with 40 particles that randomly drifting in a box. This example simulates <ulink url="http://en.wikipedia.org/wiki/Brownian_motion">Brownian motion</ulink> of ideal gas particles.
de: Zeichnet die Bewegungsbahn einer starren Scheibe auf, die durch Zusammenstöße mit sich zufällig bewegenden Teilchen in einem Kasten erzeugt wird. In diesem Beispiel wird die <ulink url="http://de.wikipedia.org/wiki/Brownsche_Bewegung">Brownsche Bewegung</ulink> von idealen Gasteilchen simuliert.

source: This example simulates <ulink url="http://en.wikipedia.org/wiki/Double_pendulum">double pendulum motion</ulink> using 2 massive particles and two sticks.
de: Diese Beispiel zeigt die Simulation der Bewegung eines <ulink url="http://de.wikipedia.org/wiki/Doppelpendel">Doppelpendels</ulink> aus zwei Teilchen, die durch zwei Stäbe verbunden sind.

source: This example is a simple demonstration of the famous <ulink url="http://en.wikipedia.org/wiki/Newton%27s_cradle">Newton's cradle</ulink>. It is done in &step; using sticks, 8 discs and a box. The six balls in the middle are not moving because they just transfer momentum and energy, not a motion.
de: Dieses Beispiele ist eine einfache Demonstration des bekannten <ulink url="http://de.wikipedia.org/wiki/Newtonpendel">Newton- oder Kugelstoßpendels</ulink>. Dafür werden in &step; 8 Scheiben mit je einem Stab und einem Rechteck benutzt. Die sechs Scheiben in der Mitte bewegen sich nicht, da Sie nur den Impuls und Energie weitergeben, aber keine Bewegung.

source: first.step: First example
de: first.step: Erstes Beispiel

source: This example has two parts. The first part contains two particles connected by a spring and the second part contains two charged particles.
de: Dieses Beispiel besteht aus zwei Teilen. Der erste Teil enthält zwei Teilchen, die durch eine Feder verbunden sind. Der zweite Teil enthält zwei Ladungsteilchen.

source: Two particles connected by a spring
de: Zwei durch eine Feder verbundene Teilchen

source: In this example two particles are added to the scene and spring is connected between them. The properties of both the particles such as velocity, momentum, position &etc; has been set in the properties browser. The properties of the spring such as stiffness, restLength, damping &etc; also has been set in the properties browser.
de: In diesem Beispiel werden zwei Teilchen eingefügt und durch eine Feder verbunden. Die Eigenschaften beider Teilchen wie zum Beispiel Geschwindigkeit, Impuls, Position &etc; wie auch die Steifigkeit, Ruhelänge, Dämpfung der Feder wurde im Eigenschaften-Fenster eingestellt.

source: Explanation of the simulation:
de: Erläuterung der Simulation:

source: This is good example of a simple harmonic motion. Here the acceleration of the one particle is set in direction of positive x-axis and the acceleration of the other particle is set along negative x-axis. As a result both the particles pulls the spring in opposite directions, where as spring tries to bring the two particles back to their original positions. Thus the system executes simple harmonic motion. The simulation of the particles and spring under these conditions can be seen on the scene.
de: Dies ist ein schönes Beispiel einer einfachen harmonischen Bewegung. Hier wird für die beide Teilchen eine entgegengesetzte Beschleunigung entlang der X-Achse eingegeben. Daher ziehen die beiden Teilchen die Feder in entgegengesetzte Richtungen und die Feder versucht, die Teilchen wider in ihre ursprüngliche Lage zurückzubringen. Daher führt das System eine einfache harmonische Bewegung aus. Die Simulation der Bewegung der Teilchen und der Feder wirc im Versuchsfeld dargestellt.

source: Two charged particles
de: Zwei Ladungsteilchen

source: Velocity of the each charged particle is set in some direction so, the charged particles moves in respective direction of their velocity but each particle has been given a equal and opposite charge so the particles try to attract each other. As a result the simulation of the charged particles under these conditions can be seen on the scene.
de: Die Geschwindigkeit jedes Ladungsteilchens ist so eingestellt, dass die Ladungsteilchen sich in entgegengesetzter Richtung bewegen. Da jedes Teilchen eine gleichgroße, aber entgegengesetzte Ladung hat, versuchen sie sich anzuziehen. Das Ergebnis der geladenen Teilchen unter diesen Bedingungen wird im Versuchsfenster angezeigt.

source: This example is a correct demonstration of the <ulink url="http://en.wikipedia.org/wiki/Newton%27s_cradle">Newton's cradle</ulink>. As the system is imperfect two disks in the middle get visual movement with time.
de: Dieses Beispiele ist eine korrekte Demonstration des bekannten <ulink url="http://de.wikipedia.org/wiki/Newtonpendel">Newton- oder Kugelstoßpendels</ulink>. Da es kein perfektes System ist, bewegen sich die mittleren Scheiben nach einiger Zeit.

source: This example simulates ideal gas pressure caused by <ulink url="http://en.wikipedia.org/wiki/Brownian_motion">Brownian motion</ulink>.
de: In diesem Beispiel wird eine Simulation des Gasdrucks vorgeführt, der durch die <ulink url="http://de.wikipedia.org/wiki/Brownsche_Bewegung">Brownsche Bewegung</ulink> verursacht wird.

source: Plots velocity vs. position graph for particle1 in the system of two particles connected with a spring.
de: Grafische Darstellung der Geschwindigkeit und Position des ersten Teilchens in einem System aus zwei durch eine Feder verbundene Teilchen.

source: This example simulates monoatomic liquid.
de: Dieses Beispiel ist die Simulation einer einatomigen Flüssigkeit.

source: This example simulates <ulink url="http://en.wikipedia.org/wiki/Lissajous_curve">Lissajous curve</ulink> using two-particle model. The parameters on the model can be changed using the controller at the center of the world.
de: In diesem Beispiel werden <ulink url="http://de.wikipedia.org/wiki/Lissajous-Figuren">Lissajous-Figuren</ulink> mit einem Versuch aus zwei Teilchen simuliert. Lissajous-Figuren sind Kurvengraphen, die durch Überlagerung harmonischer Schwingungen entstehen. Die Parameter dieses Experiments können mit dem Schieberegler für die Steifigkeit der ersten Feder in der Mitte des Versuchsfelds geändert werden.

source: Simulates triangular rigid body under the loading of the three linear motors.
de: Simulation eines starren dreieckigen Körpers unter Lasteinwirkungen von drei Linearmotoren.

source: Simulates interaction of the linear motor with a rigid rectangular body on a spring.
de: Simulation des Einflusses einer Kraft aus einem Linearmotor auf einen starren rechteckigen Körper, der durch eine Feder gehalten wird.

source: Example with LaTeX formula (<ulink url="http://en.wikipedia.org/wiki/Divergence_theorem">divergence theorem</ulink>) and embedded image.
de: Beispiel mit dem <ulink url="http://de.wikipedia.org/wiki/Gaußscher_Integralsatz">Gaußschen Integralsatz oder Divergenzsatz</ulink> als LaTeX-Formel und einem eingebetteten Bild.

source: This example simulates resonance in the system with angular motor.
de: In diesem Beispiel werden Resonanzen in einem System mit Drehmotor simuliert.

source: This example simulates interaction of two rigid bodies with a soft body between them.
de: In diesem Beispiel wird die Kollision von zwei starren Körpern mit einem elastischer Körper dazwischen simuliert.

source: This example simulates the motion of Solar system major bodies (Sun and the planets).
de: Eine Simulation der Bewegung der Planeten unseres Sonnensystems.

source: This example simulates the motion of the planar system of five particles connected with four springs.
de: In diesem Beispiel sehen Sie die Simulation der Bewegung eines ebenen Systems aus 5 Teilchen, die durch 4 Federn verbunden sind.

source: The graph on the scene shows oscillations of the green particle. When you start simulation the wave starts to travel from the red particle. The blue particle will reflect the wave and it will travel in reverse direction until the red particle reflects in again. After some time the wave will vanish because springs have damping.
de: Im Diagramm werden die Schwingungen des grünen Teilchens dargestellt. Wird die Simulation gestartet, beginnt die Wellenbewegung beim roten Teilchen. Das blaue Teilchen reflektiert die Welle in entgegengesetzter Richtung zurück zum roten Teilchen, das die Welle wiederum reflektiert. Nach einiger Zeit kommt die Wellenbewegung zum Stillstand, da Federn eine Dämpfung haben.
