Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdeedu/step.po
Languages: de

source: The &step; Handbook
de: Das Handbuch zu &step;

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Burkhard</firstname><surname>Lück</surname><affiliation><address><email>lueck@hube-lueck.de</email></address></affiliation><contrib>Übersetzung</contrib></othercredit>

source: &step; is an interactive physical simulator. It allows you to explore the physical world through simulations. It works like this: you place some bodies on the scene, add some forces such as gravity or springs, then click <guibutton>Simulate</guibutton> and &step; shows you how your scene will evolve according to the laws of physics. You can change every property of the bodies/forces in your experiment (even during simulation) and see how this will change evolution of the experiment. With &step; you cannot only learn but feel how physics works!
de: &step; ist ein interaktiver Physiksimulator, mit dem Sie die Welt der Physik durch Simulationen erforschen können. Dazu platzieren Sie einige Körper im Versuchsfenster und fügen Kräfte wie die Gravitation oder Federn hinzu. Klicken Sie dann auf den Knopf <guibutton>Simulation starten</guibutton> und beobachten Sie, wie sich Ihr Experiment nach den Gesetzen der Physik verändert. Jede Eigenschaft von Körpern oder Kräften lässt sich sogar in der laufenden Simulation ändern. Mit &step; können Sie erfahren, wie die Physik in der Welt funktioniert.

source: physics
de: Physik

source: forces
de: Kräfte

source: Introduction
de: Einführung

source: &step; is an interactive physical simulator.
de: &step; ist ein interaktiver Physiksimulator.

source: &step; features:
de: Funktionen von &step;:

source: Classical mechanical simulation in two dimensions
de: Simulation klassischer Mechanik in zwei Dimensionen

source: Particles, springs with damping, gravitational and coulomb forces
de: Teilchen, Federn mit Dämpfung, Gravitations- und Coulombkräften

source: Rigid bodies
de: Starre Körper

source: Collision detection (currently only discrete) and handling
de: Kollisionserkennung (zurzeit nur diskret) und -bearbeitung

source: Soft (deformable) bodies simulated as user-editable particles-springs system, sound waves
de: Elastische verformbare Körper als editierbare Systeme aus Teilchen und Federn, Schallwellen

source: Molecular dynamics (currently using Lennard-Jones potential): gas and liquid, condensation and evaporation, calculation of macroscopic quantities and their variances
de: Molekulare Dynamik mithilfe des Lennard-Jones-Potentials: Gase und Flüssigkeiten, Kondensation und Verdunstung, Berechnung der makroskopischen Werte und ihrer Abweichungen

source: Units conversion and expression calculation: you can enter something like "(2 days + 3 hours) * 80 km/h" and it will be accepted as distance value (requires libqalculate)
de: Umwandlung von Einheiten und Berechnung von Ausdrücken: Sie können zum Beispiel „(2 days + 3 hours) * 80 km/h“ eingeben, daraus wird der Wert der Entfernung berechnet. Dazu ist die Bibliothek libqalculate erforderlich.

source: Errors calculation and propagation: you can enter values like "1.3 ± 0.2" for any property and errors for all dependent properties will be calculated using statistical formulas
de: Fehlerberechnung und -weiterleitung: Sie können Werte wie „1,3± 0,2“ für jede beliebige Eigenschaft eingeben. Dann werden die sich daraus ergebenden Fehler für alle abhängigen Eigenschaften mit statistischen Formeln berechnet.

source: Solver error estimation: errors introduced by the solver is calculated and added to user-entered errors
de: Abschätzung der Fehler der Gleichungslösungssysteme: Die daraus entstehenden Fehler werden berechnet und zu den vom Benutzer eingegeben Fehlern addiert

source: Several different solvers: up to 8th order, explicit and implicit, with or without adaptive timestep (most of the solvers require GSL library)
de: Mehrere verschiedene Gleichungslösungssysteme: bis zur achten Ordnung, explizit und implizit, mit oder ohne angepassten Zeitschritten. Die meisten Gleichungslösungssysteme benötigen die GSL-Bibliothek.

source: Controller tool to easily control properties during simulation (even with custom keyboard shortcuts)
de: Werkzeuge zur Kontrolle der Objekteigenschaften während der Simulation, auch mit benutzerdefinierten Kurzbefehlen.

source: Tools to visualize results: graph, meter, tracer
de: Grafische Darstellung der Ergebnisse durch Diagramme, Messwertanzeigen und Spuren von Bewegungen

source: Context information for all objects, integrated wikipedia browser
de: Kontextinformationen für alle Objekte, eingebauter Wikipedia-Browser

source: Collection of example experiments, more can be downloaded with KNewStuff2
de: Sammlung von Beispielexperimenten, weitere Experimente können zusätzlich heruntergeladen werden

source: Integrated tutorials
de: Integrierte Anleitungen

source: Using &step;
de: Arbeiten mit &step;

source: &step; simulates a physical world. The main part of &step; (1) is the world scene in the center of &step; main window where you first place physical objects and where you see the simulation. On the left of this scene a palette (2) let you choose your physical objects. You can freely move this palette anywhere on your desktop by dragging the title bar. On the right of the scene you can see the current world description (3), its properties (4), some help to explain some words (5) and the history of the current world (6). Each of those panels can be placed elsewhere on your screen by dragging the title bar.
de: &step; simuliert eine physikalische Welt. Der wichtigste Teil von &step; ist das Versuchsfeld (1) in der Mitte des Hauptfensters von &step;. Hier platzieren Sie zuerst physikalische Objekte und können dann den Ablauf der Simulation beobachten. Links befindet sich die Palette (2) mit einer Reihe von physikalischen Objekten. Rechts sehen Sie eine Beschreibung der Welt (3), die Eigenschaften (4) der Objekte, Hilfe (5) zu den Objekten und den Verlauf (6) des Experiments. Jedes dieser Elemente können Sie durch Ziehen mit dem Mauszeiger an der Titelleiste beliebig anordnen.

source: Here's a screenshot of &step; when you start it for the first time
de: Hier sehen Sie ein Bildschirmfoto von &step;, wenn Sie es zum ersten Mal starten

source: Step Main Window
de: Hauptfenster von &step;

source: To help you get started, &step; integrates a series of tutorials which easily teach you how to build an experiment. Please see step by step to start with the first tutorial.
de: Als Einstiegshilfe bietet &step; eine Reihe von Anleitungen, mit denen Sie den Aufbau eines Versuchs erlernen. Weitere Informationen finden Sie im Kapitel Anleitungen.

source: Credits and License
de: Danksagungen und Lizenz

source: Program copyright 2007 &Vladimir.Kuznetsov; &Vladimir.Kuznetsov.mail;
de: Programm Copyright 2007 &Vladimir.Kuznetsov; &Vladimir.Kuznetsov.mail;

source: Contributors:
de: Mitwirkende:

source: Author: &Vladimir.Kuznetsov; &Vladimir.Kuznetsov.mail;
de: Autor: &Vladimir.Kuznetsov; &Vladimir.Kuznetsov.mail;

source: Contributor: &Carsten.Niehaus; &Carsten.Niehaus.mail;
de: Beiträge von: &Carsten.Niehaus; &Carsten.Niehaus.mail;

source: Documentation copyright 2007 &Anne-Marie.Mahfouf; &Anne-Marie.Mahfouf.mail;
de: Dokumentation Copyright 2007 &Anne-Marie.Mahfouf; &Anne-Marie.Mahfouf.mail;

source: CREDIT_FOR_TRANSLATORS
de: <para>Übersetzung Burkhard Lück <email>lueck@hube-lueck.de</email></para>

source: How to obtain &step;
de: Bezugsquellen von &step;

source: Compilation and Installation
de: Kompilierung und Installation
