Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdegames/granatier.po
Languages: de

source: &granatier; Handbook
de: Das Handbuch zu &granatier;

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Johannes</firstname><surname>Obermayr</surname><affiliation><address><email>johannesobermayr@gmx.de</email></address></affiliation><contrib>Übersetzung</contrib></othercredit>

source: This documentation describes the game of &granatier; version 1.2.0
de: Diese Dokumentation beschreibt die Version 1.2.0 des Spiels &granatier;

source: kdegames
de: KDE-Spiele

source: game
de: Spiel

source: multiplayer
de: Mehrspieler

source: Introduction
de: Einleitung

source: Gametype:
de: Spielart:

source: Number of possible players:
de: Anzahl der Spieler:

source: Multiplayer
de: Mehrere

source: &granatier; is a clone of the classic <trademark><application>Bomberman</application></trademark> game, inspired by the work of the <application>Clanbomber</application> clone.
de: &granatier; ist eine erweiterte Kopie des klassischen Spiels <trademark><application>Bomberman</application></trademark> und ist von der Arbeit an dessen <emphasis><application>Clanbomber</application></emphasis>-Kopie inspiriert.

source: The object of the game is to run through an arena, using bombs to clear out blocks and eliminate your opponents. Several bonuses and handicaps are hidden underneath the blocks &ndash; these can either help or hinder your progress.
de: Die Spieler müssen sich auf dem Spielfeld bewegen und Bomben zum Entfernen der Hindernisse und Töten der Gegner legen. Einige <emphasis>Boni</emphasis> und <emphasis>Hemmer</emphasis> sind unter den <emphasis>Hindernissen</emphasis> versteckt und können sich dabei als hilfreich bzw. nachteilig erweisen.

source: <screeninfo>A &granatier; screenshot</screeninfo>
de: <screeninfo>Ein Bildschirmfoto von &granatier;</screeninfo>

source: <phrase>A &granatier; screenshot</phrase>
de: <phrase>Ein Bildschirmfoto von &granatier;</phrase>

source: How to play
de: Spielanleitung

source: Objective:
de: Spielziel:

source: Eliminate all Opponents.
de: Das Spielziel besteht im Töten aller Gegner.

source: Each player is provided with five keys that they use to move their character and lay bombs. For example, the default keys for Player 1 are the Up, Down, Left and Right arrow keys to move respectively in those directions, and the &Enter; key to lay a bomb. Please refer to the <link linkend="config_player">Player Configuration</link> Section to find shortcut keys for other players, as well as how to configure them.
de: Jeder Spieler benötigt fünf Tasten für die Steuerung der Spielfigur und das Legen der Bomben. Die Standardtasten für <emphasis>Spieler 1</emphasis> sind beispielsweise zur Steuerung die Pfeiltasten <keycap>Hoch</keycap>, <keycap>Runter</keycap>, <keycap>Links</keycap> und <keycap>Rechts</keycap> sowie die <keycap>Eingabe</keycap>taste zum Legen der Bomben. Im Abschnitt <link linkend="config_player">Spieler</link> sind weitere Informationen zu den Tastenkürzeln der anderen Spieler sowie deren Änderung enthalten.

source: The purpose of laying bombs, aside from attacking other opponents, is to destroy the many blocks scattered throughout the arena in order to clear a path or uncover hidden bonuses. Among the many bonuses that can be uncovered are those that make you move faster or increase your bomb blast range; the more bonuses of this type you collect, the easier it is to eliminate your opponents and win the round. But be warned that just as many handicaps exist that can turn the tide against you, including those that slow you down or invert your moving keys.
de: Mit dem Legen der Bomben werden - abgesehen vom Angreifen der Gegner - die vielen Hindernisse auf dem Spielfeld entfernt und dadurch der Weg freigemacht bzw. <emphasis>Boni</emphasis> oder <emphasis>Hemmer</emphasis> freigelegt. Zu den vielen freizulegenden <emphasis>Boni</emphasis> gehören unter anderem solche, mit denen die Reichweite der Bombe oder auch die Geschwindigkeit des Spielers erhöht werden. Je mehr <emphasis>Boni</emphasis> eingesammelt werden, desto leichter wird das Töten der Gegner und somit das Gewinnen der Runde. Es ist jedoch Vorsicht geboten: Es gibt auch <emphasis>Hemmer</emphasis>, die sich nachteilig auswirken, indem sie die Geschwindigkeit herabsetzen oder die Funktion der Richtungstasten umkehren.

source: For each won round, the player is awarded a point. The first player to win a predefined number of points (the default is 3), wins the game!
de: Für jede gewonnene Runde erhält der Gewinner einen Punkt. Der Spieler, der als erstes die eingestellte Punktzahl (Standard: 3) erreicht, gewinnt das Spiel.

source: Game Rules, Strategies and Tips
de: Spielregeln, Spielstrategien und Tipps

source: The Items
de: Gegenstände

source: The Arena
de: Spielfeld

source: The players are in an arena which consists of:
de: Die Spieler befinden sich auf einem Spielfeld, das aus folgenden Objekten besteht:

source: Arena Wall
de: Wand

source: The Wall &ndash; this defines the outline of the arena map and cannot be destroyed.
de: Die <emphasis>Wand</emphasis> begrenzt das Spielfeld und kann nicht zerstört werden.

source: Arena Ground
de: Boden

source: The Ground &ndash; this can be walked on safely.
de: Auf dem <emphasis>Boden</emphasis> bewegen sich die Spieler.

source: Arena Ice
de: Eis

source: The Ice &ndash; this will make the ground slippery. The speed increases on the ice and it is not possible to completly stop moving.
de: Das <emphasis>Eis</emphasis> macht den Boden rutschig. Die Geschwindigkeit des Spielers erhöht sich und das vollständige Stehen bleiben ist nicht möglich.

source: Arena Block
de: Hindernis

source: The Block &ndash; this can be destroyed with a bomb, and may contain a bonus (or a handicap).
de: Die <emphasis>Hindernisse</emphasis> können mit Bomben zerstört werden und ein paar von Ihnen enthalten <emphasis>Boni</emphasis> oder <emphasis>Hemmer</emphasis>.

source: Arena Bomb Mortar
de: Mörser

source: The Bomb Mortar &ndash; this will throw bombs that are placed on it to random places.
de: Auf dem <emphasis>Mörser</emphasis> gelegte Bomben werden an eine zufällige Stelle auf dem Spielfeld <emphasis>teleportiert</emphasis>.

source: Arena Arrow Right
de: Pfeile

source: The Arrows &ndash; this will move the bombs that are placed on it to the direction they point.
de: Die <emphasis>Pfeile</emphasis> bewegen die darauf gelegten Bomben in die jeweils zeigende Richtung (bis sie an einer Wand oder einem Hindernis anstoßen).

source: If there is none of the above items, there is a hole at the ground and moving into it will result in falling into the deep and die. The same applies also if there is no wall at the edge of the arena and the player moves outside of the arena.
de: Falls keines der oben genannten Objekte vorhanden ist, befindet sich ein <emphasis>Loch</emphasis> im Boden. Sobald sich der Spieler in ein solches bewegt, fällt er in die Tiefe und stirbt. Selbiges geschieht, wenn das Spielfeld nicht durch eine Wand begrenzt wird und sich der Spieler vom Spielfeld bewegt.

source: The Bonuses
de: Boni

source: Bonuses are helpful for reaching the game goal and effects exists permanent - even after a handicap disappears. Currently there are following bonuses:
de: <emphasis>Boni</emphasis> sind für das Erreichen des Spielziels hilfreich. Sie existieren dauernd - sogar nachdem die Wirkung der <emphasis>Hemmer</emphasis> verschwindet. Derzeit sind folgende <emphasis>Boni</emphasis> verfügbar:

source: Bonus Speed
de: Geschwindigkeit

source: Speed &ndash; increases your speed slightly.
de: Durch den <emphasis>Geschwindigkeits</emphasis>bonus kann sich der Spieler ein bisschen schneller bewegen.

source: Bonus Bomb
de: Bombe

source: Bomb &ndash; adds an extra bomb to your arsenal, allowing you to lay more than one bomb at a time.
de: Durch den <emphasis>Bomben</emphasis>bonus können mehrere Bomben gleichzeitig gelegt werden.

source: Bonus Power
de: Schlagkraft

source: Power &ndash; increases the power of your bombs, extending their bomb blast range.
de: Der <emphasis>Schlagkraft</emphasis>bonus erhöht die Reichweite der Bombe.

source: Bonus Shield
de: Schild

source: Shield &ndash; makes invincible for one bomb blast.
de: Das <emphasis>Schild</emphasis> schützt vor der Wirkung der Bombenexplosion.

source: Bonus Throw
de: Werfen

source: Throw &ndash; adds the ability to throw bombs. Just press the key for laying bombs while a bomb is below you.
de: Mit dem <emphasis>Treten</emphasis>bonus können die Bomben auch geworfen werden. Dazu muss lediglich die Taste für das Legen der Bombe gedrückt werden, sobald sich die Spielfigur über einer Bombe befindet.

source: Bonus Kick
de: Treten

source: Kick &ndash; adds the ability to move bombs. Just run against an bomb and the bomb will move.
de: Mit dem <emphasis>Treten</emphasis>bonus können die Bomben bewegt werden. Hierzu wird lediglich die Bombe berührt und sie bewegt sich in die entsprechende Richtung.

source: The Handicaps
de: Hemmer

source: Handicaps are the opposite of bonuses and hinder the player. The good thing is that effects get lost after some time (other than bonuses) and the player can play in is usual behavior (including bonuses) again. Currently there are following handicaps:
de: <emphasis>Hemmer</emphasis> sind das genaue Gegenteil der <emphasis>Boni</emphasis> und behindern den Spieler. Die gute Sache ist, dass deren Auswirkungen nach einiger Zeit wieder verschwinden (anders als bei <emphasis>Boni</emphasis>) und der Spieler in seinem gewohnten Verhalten (einschl. <emphasis>Boni</emphasis>) weiterspielen kann. Derzeit sind folgende <emphasis>Hemmer</emphasis> verfügbar:

source: Handicap Slow
de: Bremse

source: Slow &ndash; makes you move very slowly.
de: Durch die <emphasis>Bremse</emphasis> kann sich der Spieler nur noch langsam fortbewegen.

source: Handicap Hyperactive
de: Hyperaktivität

source: Hyperactive &ndash; makes you move a little TOO fast.
de: Der <emphasis>hyperaktive</emphasis> Spieler bewegt sich sehr schnell und ist dadurch nur schwer steuerbar ...

source: Handicap Mirror
de: Spiegel

source: Mirror &ndash; inverts your moving keys, so that up becomes down and left becomes right.
de: Durch den <emphasis>Spiegel</emphasis> bewegt sich der Spieler immer in die andere Richtung (hoch -> runter, links -> rechts, bzw. umgekehrt).

source: Handicap Scatty
de: Schusseligkeit

source: Scatty &ndash; forces you to continuously lay bombs without control.
de: Der <emphasis>Schussel</emphasis> legt ständig Bomben.

source: Handicap Restrain
de: Handschellen

source: Restrain &ndash; prevents you to lay bombs.
de: Durch die <emphasis>Handschellen</emphasis> können keine Bomben gelegt werden.

source: The ambivalent Items
de: Doppelwirkende Gegenstände

source: This type of bonuses are neither good nor bad, it mostly depends on the environment. Currently there are following neutral bonuses:
de: Die Gegenstände sind weder gut noch schlecht. Vielmehr hängt deren Wirkung von der Umgebung ab. Derzeit sind folgende <emphasis>neutrale</emphasis> Gegenstände verfügbar:

source: Bonus Neutral Pandora
de: Kiste der Pandora

source: Pandora &ndash; this contains either a bonus or a handicap.
de: Die <emphasis>Kiste der Pandora</emphasis> ist eine Überraschung und beinhaltet entweder einen <emphasis>Bonus</emphasis> oder <emphasis>Hemmer</emphasis>.

source: Bonus Neutral Resurrect
de: Wiederbelebung

source: Resurrect &ndash; this will resurrect any dead player.
de: Die <emphasis>Wiederbelebung</emphasis> erweckt einen getöteten Spieler zu neuem Leben.

source: Game Configuration
de: Spieleinstellungen

source: To open the Configuration Dialogue, select <menuchoice><guimenu>Settings</guimenu><guimenuitem>Configure &granatier;...</guimenuitem></menuchoice>
de: Der Dialog für die Spieleinstellungen kann über das Menü <menuchoice><guimenu>Einstellungen</guimenu><guimenuitem>&granatier; einrichten ...</guimenuitem></menuchoice> aufgerufen werden.

source: General
de: Allgemein

source: You can change the points which are needed to win the game and the time for a round. After the time is over, the sudden death mode will start.
de: Die zum Gewinnen benötigte Punktzahl sowie die Spielzeit für eine Runde können verändert werden. Nachdem die Zeit abgelaufen ist, wird die <emphasis>Todesfalle</emphasis> aktiviert.

source: Additionally you can adjust the initial speed, bomb range and bomb armory.
de: Zusätzlich können die Geschwindigkeit, Bombenreichweite und Bombenausstattung zum Spielbeginn festgelegt werden.

source: <screeninfo>A &granatier; Config screenshot</screeninfo>
de: <screeninfo>Einrichtungsdialog von &granatier;</screeninfo>

source: <phrase>A &granatier; Config screenshot</phrase>
de: <phrase>Einrichtungsdialog von &granatier;</phrase>

source: Theme
de: Design

source: To select the Theme you want to play, go to the Theme section. The Theme is loaded by clicking on <guibutton>OK</guibutton> or <guibutton>Apply</guibutton>. The current game will be ended and a new one started. You can click on the <guibutton>Defaults</guibutton> button to restore the default Theme.
de: Das Design wird im Abschnitt <guilabel>Design</guilabel> ausgewählt und durch einen Klick auf <guibutton>OK</guibutton> oder <guibutton>Anwenden</guibutton> geladen. Dadurch wird das aktuelle Spiel beendet und ein neues startet. Mittels Klick auf <guibutton>Voreinstellungen</guibutton> wird das Standarddesign wiederhergestellt.

source: Arena
de: Spielfeld

source: To select the Arena you want to play, go to the Arena section. The Arena is loaded by clicking on <guibutton>OK</guibutton> or <guibutton>Apply</guibutton>. The current game will be ended and a new one started. You can click on the <guibutton>Defaults</guibutton> button to restore the default Arena.
de: Das Spielfeld wird im Abschnitt <guilabel>Spielfeld</guilabel> ausgewählt und durch einen Klick auf <guibutton>OK</guibutton> oder <guibutton>Anwenden</guibutton> geladen. Dadurch wird das aktuelle Spiel beendet und ein neues startet. Mittels Klick auf <guibutton>Voreinstellungen</guibutton> wird das Standardspielfeld wiederhergestellt.

source: If you have self-made <application>Clanbomber</application> arenas, you can import them by clicking on <guibutton>Import Clanbomber Arenas</guibutton>. &granatier; is looking in <filename class="directory">~/.clanbomber/maps</filename> for the arenas. The default <application>Clanbomber</application> arenas are already shipped with &granatier;.
de: Falls <application>Clanbomber</application> auf dem System installiert ist, können dessen Spielfelder mittels <guibutton>Spielfelder von Clanbomber importieren</guibutton> importiert und verwendet werden. &granatier; sucht im Ordner <filename>~/.clanbomber/maps</filename> nach verfügbaren Spielfeldern. Die standardmäßigen Spielfelder von <application>Clanbomber</application> werden bereits mit &granatier; ausgeliefert.

source: If you select <guibutton>Random Mode</guibutton>, a random arena will be used for each new round. If there are arenas you don't want to play, you can uncheck them.
de: Durch Auswahl von <guibutton>Zufallsmodus</guibutton> wird für jede Runde ein zufälliges Spielfeld gewählt. Möchten Sie einige Spielfelder nicht benutzen, wählen Sie sie in der Liste ab.

source: Player
de: Spieler

source: To select the Player you want to play, go to the Player section and select the Players with the checkboxes. The Shortcuts can be changed by clicking on the button for the action you want to change and then pressing the key you want to use. The changes are loaded by clicking on <guibutton>OK</guibutton> or <guibutton>Apply</guibutton>. The current game will be ended and a new one started. You can click on the <guibutton>Defaults</guibutton> button to restore the default Shortcuts.
de: Im Abschnitt <guilabel>Spieler</guilabel> können die gewünschten Spieler ausgewählt werden (Farbe und Anzahl). Die Steuerungstasten können geändert werden, indem auf die gewünschte Aktion geklickt und danach die entsprechende Taste gedrückt wird. Durch einen Klick auf <guibutton>OK</guibutton> oder <guibutton>Anwenden</guibutton> werden die Änderungen übernommen. Dadurch wird das aktuelle Spiel beendet und ein neues startet. Mittels Klick auf <guibutton>Voreinstellungen</guibutton> werden die standardmäßigen Steuerungstasten wiederhergestellt.

source: Create a custom Arena
de: Spielfeld erstellen

source: An Arena in &granatier; consists of two files, the <filename>myarena.desktop</filename> and the <filename>myarena.xml</filename>.
de: Die Spielfelder von &granatier; bestehen aus den zwei Dateien <filename>meinSpielfeld.desktop</filename> und <filename>meinSpielfeld.xml</filename>.

source: The .desktop file contains the metadata like the arena name or the author of the arena and consists of the following entries. <programlisting> [Arena] Name=My Arena Description=This is my first Arena Type=XML FileName=myarena.xml Author=Joe User AuthorEmail=joe.user@foo.org </programlisting> You can choose whatever name you want, but FileName must be the name of the .xml file.
de: Die <filename>.desktop</filename>-Datei enthält die Metadaten (z. B. Name und Autor des Spielfelds) und besteht aus den folgenden Einträgen:<programlisting> [Arena] Name=Mein Spielfeld Description=Mein erstes Spielfeld. Type=XML FileName=MeinSpielfeld.xml Autor:Ich AuthorEmail=ich@ich.de</programlisting>Es können jegliche Namen gewählt werden. Lediglich <userinput>FileName</userinput> muss der Name der <filename>.xml</filename>-Datei sein.

source: The .xml file contains the actual arena map. <programlisting> &lt;?xml version="1.0"?&gt; &lt;Arena arenaFileVersion="1" rowCount="13" colCount="17"&gt; &lt;Row&gt; ==== ==== &lt;/Row&gt; &lt;Row&gt; ===+++++++=== &lt;/Row&gt; &lt;Row&gt; =+++++_+++++= &lt;/Row&gt; &lt;Row&gt; ==+++=_p_=+++== &lt;/Row&gt; &lt;Row&gt;==++===_-_===++==&lt;/Row&gt; &lt;Row&gt;=+++=++_-_++=+++=&lt;/Row&gt; &lt;Row&gt; +++++-- --+++++ &lt;/Row&gt; &lt;Row&gt;=+++=++_-_++=+++=&lt;/Row&gt; &lt;Row&gt;==++===_-_===++==&lt;/Row&gt; &lt;Row&gt; ==+++=_p_=+++== &lt;/Row&gt; &lt;Row&gt; =+++++_+++++= &lt;/Row&gt; &lt;Row&gt; ===+++++++=== &lt;/Row&gt; &lt;Row&gt; ==== ==== &lt;/Row&gt; &lt;/Arena&gt; </programlisting> There is no limit for rowCount and colCount, so you can choose the size of the arena by yourself. The following symbols are used for the arena map.
de: Die <filename>.xml</filename>-Datei beschreibt den Aufbau des Spielfelds.<programlisting> &lt;?xml version="1.0"?&gt; &lt;Arena arenaFileVersion="1" rowCount="13" colCount="17"&gt; &lt;Row&gt; ==== ==== &lt;/Row&gt; &lt;Row&gt; ===+++++++=== &lt;/Row&gt; &lt;Row&gt; =+++++_+++++= &lt;/Row&gt; &lt;Row&gt; ==+++=_p_=+++== &lt;/Row&gt; &lt;Row&gt;==++===_-_===++==&lt;/Row&gt; &lt;Row&gt;=+++=++_-_++=+++=&lt;/Row&gt; &lt;Row&gt; +++++-- --+++++ &lt;/Row&gt; &lt;Row&gt;=+++=++_-_++=+++=&lt;/Row&gt; &lt;Row&gt;==++===_-_===++==&lt;/Row&gt; &lt;Row&gt; ==+++=_p_=+++== &lt;/Row&gt; &lt;Row&gt; =+++++_+++++= &lt;/Row&gt; &lt;Row&gt; ===+++++++=== &lt;/Row&gt; &lt;Row&gt; ==== ==== &lt;/Row&gt; &lt;/Arena&gt; </programlisting>Für <userinput>rowCount</userinput> (= Anzahl der Zeilen) und <userinput>colCount</userinput> (= Anzahl der Spalten) gibt es keine Höchstwerte. Somit kann die Größe des Spielfelds beliebig gewählt werden. Die nachstehenden Zeichen können Verwendung finden:

source: '=' a wall item ' ' a hole item '_' a ground item '+' a block item 'x' will randomly create a block or a ground item '-' an ice item 'o' a mortar item 'u' an arrow up 'r' an arrow right 'd' an arrow down 'l' an arrow left 'p' a player position
de: „<keycap>=</keycap>“ Wand „<keycap> </keycap>“ Loch „<keycap>_</keycap>“ Boden „<keycap>+</keycap>“ Hindernis „<keycap>x</keycap>“ Boden oder Hindernis (zufällig) „<keycap>-</keycap>“ Eis „<keycap>o</keycap>“ Mörser „<keycap>u</keycap>“ Pfeil hoch „<keycap>r</keycap>“ Pfeil rechts „<keycap>d</keycap>“ Pfeil runter „<keycap>l</keycap>“ Pfeil links „<keycap>p</keycap>“ Position eines Spielers

source: Credits and License
de: Danksagungen und Lizenz

source: Program copyright 2009 Mathias Kraus <email>k.hias@gmx.de</email>
de: Programm © 2009 Mathias Kraus <email>k.hias@gmx.de</email>

source: Graphics copyright 2009 Mathias Kraus <email>k.hias@gmx.de</email>
de: Grafiken © 2009 Mathias Kraus <email>k.hias@gmx.de</email>

source: Graphics copyright 2009 Arturo Silva <email>jasilva28@gmail.com</email>
de: Grafiken © Arturo Silva <email>jasilva28@gmail.com</email>

source: Documentation copyright 2009 Mathias Kraus <email>k.hias@gmx.de</email>
de: Dokumentation © 2009 Mathias Kraus <email>k.hias@gmx.de</email>

source: CREDIT_FOR_TRANSLATORS
de: <para>Übersetzung: Johannes Obermayr <email>johannesobermayr@gmx.de</email></para>
