Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdegames/kajongg.po
Languages: de

source: <action>Score Table</action> <screenshot> <screeninfo>Score Table</screeninfo> <mediaobject> <imageobject> <imagedata fileref="scoretable.png" format="PNG"/> </imageobject> <textobject> <phrase>Screenshot</phrase> </textobject> </mediaobject> </screenshot> Show the score table. Round/Hand are the current round (East, South, West, North) followed by a count of the hands played in that round. The winner has a green background for her values. The Payments show how much the player paid to or received from all other players with this hand. The Balance shows the current balance for all players. The Chart shows the development of the balance values. The hints give you more details: They show all rules that have been applied to this hand. Just move the mouse over the value you are interested in.
de: <action>Punktetabelle</action> <screenshot> <screeninfo>Punktetabelle</screeninfo> <mediaobject> <imageobject> <imagedata fileref="scoretable.png" format="PNG"/> </imageobject> <textobject> <phrase>Bildschirmfoto</phrase> </textobject> </mediaobject> </screenshot> Zeigt die Punktetabelle. Runde/Hand sind die aktuelle Runde (Osten, Süden, Westen, Norden) gefolgt von einem Zähler für die Hände, die in dieser Runde gespielt wurden. Der Gewinner hat einen grünen Hintergrund für seine Werte. Die Zahlungen zeigen, wieviel der Spieler insgesamt in dieser Hand von anderen Spielern erhielt oder an sie zahlte. Das Total zeigt das aktuelle Total für alle Spieler. Das Diagramm zeigt, wie sich die Totale entwickeln. Die Tipps zeigen mehr Details: Alle Regeln, die für die Berechnung einer Hand verwendet wurden. Bewegen Sie einfach die Maus über den Wert, der Sie interessiert.

source: The lower part shows the used ruleset. Between the score table and the used ruleset you can find a splitter letting you change the relative sizes of both parts.
de: Der untere Teil zeigt die verwendeten Regeln. Zwischen der Punktetabelle und den Regeln finden Sie eine "Verschiebeleiste", mit der Sie die beiden Teile größer oder kleiner machen können.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>E</keycap></keycombo></shortcut> <guimenu>View</guimenu> <guimenuitem>Explain Scores</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>E</keycap></keycombo></shortcut> <guimenu>Ansicht</guimenu> <guimenuitem>Wertung erklären</guimenuitem>

source: Explain Scores
de: Wertung erklären

source: <screeninfo>Score Table</screeninfo>
de: <screeninfo>Punktetabelle</screeninfo>

source: <phrase>Score Table</phrase>
de: <phrase>Punktetabelle</phrase>

source: Explains how the score for the current hand was computed.
de: Erklärt, wie die Punktezahlen für das aktuelle Spiel berechnet wurden.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>H</keycap></keycombo></shortcut> <guimenu>View</guimenu> <guimenuitem>Chat</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>H</keycap></keycombo></shortcut> <guimenu>Ansicht</guimenu> <guimenuitem>Chatten</guimenuitem>

source: <screeninfo>Chat Window</screeninfo>
de: <screeninfo>Chatfenster</screeninfo>

source: <phrase>Chat Window</phrase>
de: <phrase>Chatfenster</phrase>

source: Lets you chat with the other players.
de: Ermöglicht den Chat mit anderen Spielern.

source: <guimenu>Settings</guimenu> <guimenuitem>Players</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>Spieler</guimenuitem>

source: Add, modify and delete players.
de: Spieler hinzufügen, löschen und deren Namen ändern.

source: The passwords in this table are those used by default when logging onto a game server. Changing the password you initially chose for a game server is not yet really helpful because there is no way yet for you to also change your password on the game server. You would have to ask the administrator of the game server to do that for you directly in the data base.
de: Die Passwörter in dieser Tabelle werden beim Anmelden auf einem Spielserver standardmäßig verwendet. Es ist nicht sinnvoll, das ursprünglich gewählte Passwort für einen Server zu verändern, weil es noch keine Möglichkeit gibt, das auch auf dem Server zu ändern. Sie müssten dazu den Administrator des Spielservers bitten, das neue Passwort direkt in der Datenbank zu ändern.

source: <guimenu>Settings</guimenu> <guimenuitem>Rulesets</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>Regelsätze</guimenuitem>

source: Customize rulesets.
de: Anpassen der Regelsätze.

source: Use the Ruleset Editor to customize rulesets. For details see <link linkend="ruleset-options">here</link>.
de: <action>Öffnet den Dialog zum Bearbeiten von Regelsätzen</action>. Erläuterungen dazu finden Sie <link linkend="configuration">hier</link>.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>G</keycap></keycombo></shortcut> <guimenu>Settings</guimenu> <guimenuitem>Change Visual Angle</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>G</keycap></keycombo></shortcut> <guimenu>Einstellungen</guimenu> <guimenuitem>Blickrichtung ändern</guimenuitem>

source: Changes the viewing angle of the tiles counterclockwise.
de: Ändert die Blickrichtung auf die Ziegel gegen den Uhrzeigersinn.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>D</keycap></keycombo></shortcut> <guimenu>Settings</guimenu> <guimenuitem>Demo Mode</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>D</keycap></keycombo></shortcut> <guimenu>Einstellungen</guimenu> <guimenuitem>Demomodus</guimenuitem>

source: Enables or disables the Demo Mode. See <link linkend="play">here</link> for details.
de: Schaltet den Demomodus ein und aus. Siehe <link linkend="play">hier</link> für Einzelheiten.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>F</keycap></keycombo></shortcut> <guimenu>Settings</guimenu> <guimenuitem>Full Screen Mode</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>F</keycap></keycombo></shortcut> <guimenu>Einstellungen</guimenu> <guimenuitem>Vollbildmodus</guimenuitem>

source: Switches between full screen mode and normal mode.
de: Wechselt zwischen Vollbildmodus und normalem Fenstermodus

source: Additionally &kajongg; has the common &kde; <guimenu>Settings</guimenu> and <guimenu>Help</guimenu> menu items, for more information read the sections about the <ulink url="help:/fundamentals/ui.html#menus-settings">Settings Menu</ulink> and <ulink url="help:/fundamentals/ui.html#menus-help">Help Menu</ulink> of the &kde; Fundamentals.
de: Zusätzlich hat&kajongg; die bekannten &kde;-Einträge im Menü <guimenu>Einstellungen</guimenu> und <guimenu>Hilfe</guimenu>, weitere Informationen dazu finden Sie in den Abschnitten über die Menüs <ulink url="help:/fundamentals/ui.html#menus-settings">Einstellungen</ulink> und <ulink url="help:/fundamentals/uihtml#menus-help">Hilfe</ulink> der &kde;-Grundlagen.

source: Game Configuration
de: Spieleinstellungen

source: <screeninfo>Configure Dialog</screeninfo>
de: <screeninfo>Einrichtungsdialog</screeninfo>

source: <phrase>Configure Dialog</phrase>
de: <phrase>Einrichtungsdialog</phrase>

source: The menu entry <menuchoice><guimenu>Settings</guimenu><guimenuitem>Configure &kajongg;...</guimenuitem></menuchoice> opens the <guilabel>Configure - &kajongg;</guilabel> dialog.
de: <menuchoice><guimenu>Einstellungen</guimenu><guimenuitem>&kajongg; einrichten ...</guimenuitem></menuchoice> öffnet den Einrichtungsdialog für &kajongg;.

source: If you press the <guibutton>Cancel</guibutton> button here, all of your configuration changes will be reverted, including everything you did with the ruleset editor.
de: Wenn Sie hier den Knopf <guibutton>Abbrechen</guibutton> drücken, werden alle Ihre Änderungen verworfen, auch alle, die Sie mit dem Regel - Editor gemacht haben.

source: You can also select the different tabs with the keyboard: <keycombo action="simul">&Ctrl;<keycap>1</keycap></keycombo> selects the first tab <guilabel>Play</guilabel> options, <keycombo action="simul">&Ctrl;<keycap>2</keycap></keycombo> selects the second tab, and so on.
de: Sie können die verschiedenen Seiten auch mit der Tastatur auswählen: <keycombo action="simul">&Ctrl;<keycap>1</keycap></keycombo> wählt die erste Seite <guilabel>Spielen</guilabel>, <keycombo action="simul">&Ctrl;<keycap>2</keycap></keycombo> wählt die zweite Seite, und so weiter.

source: Play options
de: Spielen

source: Show tile shadows
de: Ziegel-Schatten anzeigen

source: This shows tiles with borders and shadows. Also there is some space between tile rows, and the wall tiles are shown such that you can see that the wall is two or three tiles high. So if you disable this option, you have a simpler display with slightly larger tiles. This may be helpful for small screens.
de: Zeigt Ziegel mit Rändern und Schatten. Es wird auch zwischen den Ziegelreihen ein Abstand eingehalten, und die Mauerziegel werden so gezeigt, dass man sehen kann, wie viele übereinander liegen. Wenn Sie diese Option ausschalten, bekommen Sie einen einfacheren Bildaufbau mit leicht größeren Ziegeln. Das kann für kleine Bildschirme hilfreich sein.

source: Rearrange undisclosed tiles to melds
de: Verdeckte Ziegel zu Figuren anordnen

source: This groups melds in the hand. Sometimes the grouping might not be like you want it, so you might prefer to have no grouping at all, just like in a real world game.
de: Dies gruppiert die verdeckten Ziegel automatisch zu Figuren. Manchmal wird die Gruppierung nicht Ihren Vorstellungen entsprechen, darum ziehen Sie es vielleicht vor, keine Gruppierung zu haben, wie in einem wirklichen Spiel ohne Rechner.

source: Show only possible actions
de: Nur mögliche Aktionen anzeigen

source: When playing, show only possible actions like "No claim" or "Pung".
de: Beim Spielen nur mögliche Aktionen wie "Kein Ruf" oder "Pung" anzeigen

source: Propose what to do
de: Vorschläge machen

source: Whenever you have a choice of actions like claiming a tile or not or like choosing which tile to discard, &kajongg; can help you by making a proposal.
de: Immer, wenn Sie die Wahl zwischen verschiedenen Aktion haben wie zum Beispiel einen Ziegel zu rufen oder das zu unterlassen oder bei mehreren Ziegeln einen zum Ablegen auszuwählen,, kann &kajongg; Sie mit Vorschlägen unterstützten.

source: Use sounds if available
de: Klänge verwenden (falls verfügbar)

source: This lets you hear discards and claims. If other players recorded sound files with their own voice, you can hear them.
de: Dann hören Sie, was die Spieler ablegen und rufen. Dazu müssen die anderen Spieler auch ihre eigene Stimme aufgezeichnet haben.

source: Let others hear my voice
de: Mitspieler meine Stimme hören lassen

source: If you recorded sound files with your voice this option will let the other players hear your discards and claims with your voice.
de: Wenn Sie Tondateien mit Ihrer Stimme aufgezeichnet haben, können Sie sie hiermit den anderen Spielern schicken.

source: Animation speed
de: Animationsgeschwindigkeit

source: Define how fast the tiles should move around. If you move the slider to the rightmost position, tile movement is not animated: the tiles will simply change place.
de: Definiert, wie schnell sich die Ziegel bewegen sollen. Wenn Sie den Regler bis zum rechten Anschlag bewegen, ist die Bewegung der Ziegel gar nicht animiert: Sie ändern einfach ihre Position.

source: Sound
de: Stimmen

source: Playing gives you a much nicer experience if you hear players claim tiles and announce discards. It also makes playing easier because you can concentrate on your own tiles, you do not have to watch what others discard.
de: Spielen macht viel mehr Spaß, wenn Sie die Ansage oder das Ablegen von Ziegeln andere Spieler hören können. Es erleichtert außerdem auch das Spiel, da Sie sich auf Ihre eigenen Ziegel konzentrieren können und nicht beobachten müssen, was andere Spieler ablegen.

source: &kajongg; comes with voices for different players. It automatically assigns voices to players. For every language there should be four voices, preferably two male and two female. &kajongg; tries to use voices in the same language &kajongg; runs in. If it finds no voices in that language, &kajongg; will fallback to other languages, using the same fallback languages you defined for &kajongg; (see <menuchoice><guimenu>Help</guimenu><guimenuitem>Switch Application Language</guimenuitem></menuchoice>). If no voice files exist yet for your language, you are invited to record and contribute them to &kajongg;.
de: &kajongg; enthält Stimmen für verschiedene Spieler. Stimmen werden den Spielern automatisch zugewiesen. Für jede Sprache sollte es vier Stimmen geben, vorzugsweise zwei weibliche und zwei männliche Stimmen. &kajongg; sucht zuerst nach Stimmen in der Sprache, in der das Programm ausgeführt wird. Sind für diese Sprache keine Stimmen vorhanden, wird auf andere Sprachen ausgewichen. Dabei werden die für &kajongg; mit <menuchoice><guimenu>Hilfe</guimenu><guimenuitem>Sprache der Anwendung umschalten</guimenuitem></menuchoice> festgelegten Ausweichsprachen verwendet. Gibt es für Ihre Sprache noch keine Stimmdateien, sollten Sie sie aufnehmen und zu &kajongg; beisteuern.

source: This is how you can generate voices yourself. There is a separate folder for every voice. There are two groups of voices with different places in the file system:
de: Nun folgt eine Anleitung zur Aufnahme eigener Stimmen. Jede Stimme wird in einem eigenen Ordner gespeichert. Es gibt zwei Gruppen von Stimmen mit unterschiedlichen Speicherorten:

source: Predefined voices for every language. They live in a folder like <filename class="directory">/usr/share/kde4/apps/kajongg/voices/LANG</filename> where LANG is the code for your language. The voice directories directly under <filename class="directory">.../kajongg/voices/</filename> are the US-english versions. Predefined voices are randomly assigned to players. Those voices have names like <literal>"male1 male2 female1 female2"</literal> but those names do not matter, the user will never see them. Also, it makes no sense to define more than four predefined voices per language.
de: Vorgegebene Stimmen für jede Sprache werden in einem Ordner wie <filename class="directory">/usr/share/kde4/apps/kajongg/voices/LANG</filename> gespeichert, dabei ist LANG der Code für Ihre Sprache, In den Ordner direkt unter <filename class="directory">.../kajongg/voices/</filename> befinden sich die Stimmen in amerikanischem Englisch. Vorgegebene Stimmen werden den Spielern zufällig zugewiesen. Diese Stimmen haben Namen wie <literal>male1 male2 female1 female2</literal>, aber diese Namen sind unwichtig und Benutzer werden sie nie sehen. Außerdem sind nicht mehr als die vier vorgegebenen Stimmen je Sprache nötig.

source: User voices can be defined for a specific user. If &kajongg; makes use of such a voice, it can automatically be transferred to other players over the internet. Those voices live in a folder like <filename class="directory">~/.kde/share/apps/kajongg/voices/</filename>. So if your login name is joe, this might be <filename class="directory">/home/joe/.kde/share/apps/kajongg/voices/joe/</filename>. The folder <filename class="directory">voices/</filename> might not yet exist - if so, create it.
de: Für jeden Benutzer können eigene Stimmen definiert werden. Werden diese Stimmen von &kajongg; benutzt, können Sie automatisch zu anderen Spielern im Internet übertragen werden. Diese Stimmen werden in einem Ordner wie <filename class="directory">~/.kde/share/apps/kajongg/voices/</filename>. Ist Ihr Anmeldungsname zum Beispiel hans, dann ist dieser Ordner <filename class="directory">/home/hans/.kde/share/apps/kajongg/voices/hans/</filename>. Falls der Ordner <filename class="directory">voices/</filename> noch nicht existiert, erstellen Sie ihn.

source: Now that you know where to place your new voice, generate a new folder for it.
de: Nun wissen Sie, wo Ihre neuen Stimmen gespeichert werden, erstellen Sie also einen neuen Ordner dafür.

source: In that subfolder, you can place the sound files. They have to be encoded with the <ulink url="http://xiph.org/vorbis/">Ogg Vorbis</ulink> audio compressor, the file names need to have the extension <filename class="extension">.ogg</filename>. A single file has a name like <filename>s3.ogg</filename> - this is Stone 3. You should define such files for all tiles and for all claims and announcements. But if a sound file is missing, nothing bad happens - you just will not hear that sound. Fallback to other voices or languages only works for entire voices, not for single sound files.
de: In diesem Unterordner speichern Sie die Stimmendateien, Diese Dateien müssen in der Audio-Komprimierung <ulink url="http://xiph.org/vorbis/">Ogg Vorbis</ulink> mit der Dateierweiterung <filename class="extension">.ogg</filename> kodiert sein. Jede Datei hat einen Namen wie zum Beispiel <filename>s3.ogg</filename> für Kreis 3. Für alle Ziegel, Rufe oder Ansagen sollte eine Datei erstellt werden. Wenn eine Datei fehlt, werden Sie für eine Aktion keine Stimme hören. Ausweichen auf andere Stimmen oder Sprachen funktioniert nur für eine gesamte Stimme, nicht für einzelne fehlende Stimmdateien.

source: After having defined all sound files for a predefined voice, please make sure that the &kajongg; process has write permission in the new voice folder. Start &kajongg; and test the voice. After everything is OK, you can revoke write permission (and you should do so for predefined voices). &kajongg; will automatically generate a file named <filename>md5sum</filename> containing a checksum over all sound files. Whenever you change, add or delete a sound file for a voice, &kajongg; will try to rewrite that file.
de: Nachdem alle Dateien für eine vorgegebene Stimme erstellt sind, überprüfen Sie, ob &kajongg; Schreibrechte für den neuen Stimmenordner hat. Starten Sie &kajongg; und testen Sie die Stimmen. Ist alles in Ordnung, können Sie &kajongg; die Schreibberechtigung für den Stimmenordner wieder entziehen, das wird für vorgegebene Stimmen empfohlen. &kajongg; erstellt automatisch eine Datei mit dem Namen <filename>md5sum</filename> mit einer Prüfsumme über alle Stimmdateien, dafür ist eine Schreibberechtigung erforderlich. Immer, wenn eine Stimmdatei geändert, hinzugefügt oder gelöscht wird, versucht &kajongg; eine neue Prüfsummendatei zu erstellen.

source: Please make the length of the sound short but speak clearly - this game can be played very fast when you get used to it. It is easier if you first write down a list with everything that should be spoken. Do not read it as a sequence of items, try to pronounce each item as if it were the only one and as you would when playing. Leave room between the items. Reading this needs a little practicing.
de: Halten Sie bitte die Länge kurz, sprechen Sie aber deutlich - dieses Spiel kann mit ein bisschen Übung sehr schnell gespielt werden. Am einfachsten ist es, wenn Sie zuerst eine Liste mit allem aufschreiben, das gesprochen werden soll. Lesen Sie das nicht wie eine Liste, sondern sprechen Sie jeden Begriff so aus, wie wenn er für sich stände, und wie Sie das während des Spiels tun würden. Lassen Sie Platz zwischen den einzelnen Einträgen. Das gut zu lesen erfordert ein bisschen Übung.

source: This is just one possibility to create the sound files:
de: Dies ist eine von vielen Möglichkeiten, die Audiodateien zu erzeugen:

source: Record a sound file with the program <command>qarecord</command>, save it in the <literal>WAV</literal> format. In this single sound file, speak all of the sounds.
de: Nehmen Sie mit dem Programm <command>qarecord</command> eine Stimmdatei auf, speichern Sie sie im <literal>WAV</literal> Format. Sprechen Sie alles in diese eine Datei.

source: Edit that file with the sound editor <command>audacity</command>. In that editor, use the mouse to mark a range of the sound waves. The editor will play that part. Repeat until you have the correct part selected. This may be easier if you <menuchoice><guimenu>View</guimenu><guimenuitem>Zoom In</guimenuitem></menuchoice>. Use the menu command <menuchoice><guimenu>File</guimenu><guimenuitem>Export Selection</guimenuitem></menuchoice> and save in the ogg format. Under <guilabel>Options</guilabel>, choose low quality - this is sufficient and even wanted because this reduces the time to transfer the sounds to the other players.
de: Editieren Sie diese Datei mit dem Toneditor <command>audacity</command>. In diesem Editor benutzen Sie die Maus, um eine Bereich der Tonwellen zu markieren. Der Editor wird diesen Teil abspielen. Wiederholen Sie das, bis Sie einen korrekten Teil markiert haben. Das geht einfacher, wenn Sie die Tonwellen vergrößern mit <menuchoice><guimenu>Ansicht</guimenu><guimenuitem>Einzoomen - Vergrößern</guimenuitem></menuchoice>. Wählen Sie den Menü-Befehl <menuchoice><guimenu>Datei</guimenu><guimenuitem>Auswahl exportieren</guimenuitem></menuchoice> und speichern Sie diesen Teil im ogg - Format. Unter <guilabel>Optionen</guilabel> wählen Sie eine niedrige Qualität, die ist ausreichend und auch besser, weil das die Übertragungszeit zu den anderen Spielern reduziert.

source: The following are the names of the files that you should generate. Always append <filename>.ogg</filename> to them:
de: Dies sind die Namen der Dateien, die Sie anlegen sollten. Verwenden Sie immer die Erweiterung <filename class="extension">.ogg</filename>:

source: Sound file names
de: Tondateinamen

source: Stone 1 to Stone 9
de: Kreis 1 bis Kreis 9

source: Bamboo 1 to Bamboo 9
de: Bambus 1 bis Bambus 9

source: Character 1 to Character 9
de: Zahl 1 bis Zahl 9

source: The winds East, South, West, North
de: Die Winde Ost, Süd, West, Nord

source: The dragons blue/white, red, green
de: Die Drachen blau/weiß, rot, grün

source: The major claims
de: Die wichtigsten Rufe

source: Original Call and its violation
de: Ruf zu Beginn und seine Verletzung

source: A player lets off a cannon (dangerous game)
de: Ein Spieler spielt gefährliches Spiel

source: A player declares he has no choice but to play dangerous game
de: Ein Spieler sagt, dass er keine andere Wahl hat, als gefährliches Spiel zu spielen.

source: Tiles options
de: Ziegel

source: <screeninfo>Tileset selector</screeninfo>
de: <screeninfo>Ziegelsatz wählen</screeninfo>

source: <phrase>Tileset selector</phrase>
de: <phrase>Ziegelsatz wählen</phrase>

source: Use the <guilabel>Tiles</guilabel> selector to select graphics for the tiles.
de: Aus der <guilabel>Ziegel</guilabel>-Liste können Sie verschiedene Sätze von Spielsteinen wählen.

source: Background options
de: Hintergründe

source: <screeninfo>Background selector</screeninfo>
de: <screeninfo>Auswahl des Hintergrundes</screeninfo>

source: <phrase>Background selector</phrase>
de: <phrase>Auswahl des Hintergrundes</phrase>

source: Use the <guilabel>Background</guilabel> selector to select a background graphic for the game.
de: Aus der <guilabel>Hintergrund</guilabel>-Liste können Sie verschiedene Hintergrundbilder wählen.

source: Some backgrounds like the Chinese Landscape need some time to load. If you feel that the program should start faster or that resizing the main window takes too long, you might try some other background.
de: Einige Hintergründe, zum Beispiel die Chinesische Landschaft, benötigen mehr Zeit für die Anzeige. Wenn Sie möchten, dass das Programm schneller startet, oder wenn das Ändern der Größe des Programmfensters zu langsam ist, wählen Sie bitte einen einfacheren Hintergrund.

source: <title>Ruleset Editor</title>
de: <title>Regel-Editor</title>

source: <screeninfo>Ruleset Editor</screeninfo>
de: <screeninfo>Regel-Editor</screeninfo>

source: <phrase>Ruleset Editor</phrase>
de: <phrase>Regel-Editor</phrase>
