Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdegames/kajongg.po
Languages: de

source: The easiest way is to use the game server at <ulink url="http://www.kde.org/applications/games/kajongg/">kajongg.org</ulink>. &kajongg; will show this one in the list of possible game servers. Please note that for now <ulink url="http://www.kde.org/applications/games/kajongg/">kajongg.org</ulink> only offers a game server but no web page or any other services.
de: Am einfachsten ist es, den Spielserver auf <ulink url="http://www.kde.org/applications/games/kajongg/">kajongg.org</ulink> zu benutzen. &kajongg; zeigt diesen Server in der Liste der vorhandenen Spielserver. Beachten Sie bitte, dass auf <ulink url="http://www.kde.org/applications/games/kajongg/">kajongg.org</ulink> zurzeit nur ein Spielserver läuft, keine Webseite oder andere Dienste.

source: If you do not have an account on the game server with the name you entered, you will be asked if you want to open an account. If you say yes, you will get a new dialog where you can enter the wanted password twice. Your account will be created automatically.
de: Wenn Sie auf dem Spielserver kein Benutzerkonto mit dem eingegeben Namen haben, werden Sie gefragt, ob Sie eines anlegen wollen. Wenn Sie Ja sagen, wird ein neuer Dialog erscheinen, in dem Sie das gewünschte Passwort zweimal eingeben können. Ihr Benutzerkonto wird dann automatisch angelegt.

source: After a successful login onto the game server, you will get a list of tables with available seats on that game server. Join a table or allocate a new table. If you allocate a new table, wait until more seats are taken by other players. You can start the game on a table you allocated at any time, the seats not taken will be filled by robot players.
de: Nachdem Sie sich erfolgreich am Spielserver angemeldet haben, bekommen Sie eine Liste von Tischen mit freien Plätzen. Setzen Sie sich an einen Tisch oder legen Sie einen neuen an. Wenn Sie einen neuen Tisch anlegen, warten Sie, bis genug weitere Spieler sich drangesetzt haben. Sie können das Spiel jederzeit starten, die nicht besetzten Plätze werden automatisch von Rechnerspielern eingenommen.

source: The table list also shows the name of the ruleset played on that table. The ruleset and its name are sent to the game server by the player initiating the table. If you have an identical ruleset, the table shows your name for the ruleset - this might be helpful if the table initiator speaks another language and named the ruleset differently. Also, if the name of your local ruleset is displayed, it is displayed in black. If however you have no identical ruleset, the name appears in red, and you can use the button <guibutton>Compare</guibutton> to compare it with your own rulesets.
de: Die Tischliste zeigt auch den Namen des Regelsatzes, der für den Tisch gilt. Dieser wird von dem Spieler, der den Tisch anlegt, an den Spielserver geschickt. Wenn Sie einen identischen Regelsatz haben, wird Ihr Name für diesen Regelsatz angezeigt - das kann nützlich sein, wenn der Spieler, der den Tisch anlegte, eine andere Sprache spricht und den Regelsatz anders nennt. Wenn Ihr lokaler Name angezeigt wird, erscheint er schwarz. Wenn Sie aber keinen identischen Regelsatz haben, erscheint der Name rot, und Sie können ihn mit dem Knopf <guibutton>Vergleichen</guibutton> mit Ihren eigenen Regelsätzen vergleichen.

source: If you do not use <ulink url="http://www.kde.org/applications/games/kajongg/">kajongg.org</ulink> or any other existing game server, you can start your own &kajongg; game server in two different ways:
de: Wenn Sie <ulink url="http://www.kde.org/applications/games/kajongg/">kajongg.org</ulink> oder einen anderen vorhandenen Spielserver nicht verwenden, können Sie Ihren eigenen &kajongg;-Spielserver auf zwei Arten starten:

source: connect to the server "localhost". This is your own computer. If you do this and no game server is running, it will be started automatically. And when you stop playing, the server will be stopped too.
de: Mit dem Server "localhost" verbinden. Dies ist Ihr eigener Rechner. Wenn Sie das tun und noch kein Spielserver läuft, wird er automatisch gestartet. Und wenn Sie zu spielen aufhören, wird er auch beendet.

source: manually start a server on any computer you want. All you need to do is go to a command line and start the program <literal>kajonggserver</literal>. Entering <literal>kajonggserver --help</literal> will show you all available options like changing the default port. This server will run until you kill it.
de: Starten Sie manuell einen Spielserver auf irgendeinem Rechner. Alles, was Sie tun müssen, ist auf der Befehlszeile das Programm <literal>kajonggserver</literal> zu starten. <literal>kajonggserver --help</literal> wird Ihnen alle Optionen zeigen, zum Beispiel wie man den Port auf einen anderen Wert als 8149 setzt. Dieser Server wird laufen, bis Sie ihn mit "kill" beenden.

source: In both cases you need to tell the other players how they can reach your game server. They need the &URL; or simply an IP address and the port your server is listening on. This might be something like <literal>mypc.dyndns.org:8409</literal> where <literal>8409</literal> is the port. Of course you need to configure your firewall such that the remote player can reach that port. The communication will be encrypted.
de: In beiden Fällen müssen Sie den anderen Spielern mitteilen, wie sie Ihren Spielserver erreichen können. Sie benötigen die &URL; oder einfach eine IP-Adresse und den Port, auf dem Ihr Spielserver lauscht. Das könnte z.B. etwas wie <literal>mypc.dyndns.org:8149</literal> sein, wobei <literal>8149</literal> der Port ist. Natürlich müssen Sie Ihre Firewall so konfigurieren, dass der Port vom Spielserver für die anderen Spieler erreichbar ist. Die Kommunikation läuft verschlüsselt.

source: The server computes its default port from its version number. If &kajongg; has version 4.9.5, port 8409 will be used: 8000 plus first version digit * 100 plus middle version digit. If the player enters no port for the wanted game server, the client computes the port in the same way. So if a computer runs several game servers with different program versions, you should normally reach the correct game server automatically. Anyway the game server and the client will make sure that their versions are compatible and warn you otherwise.
de: Der Server berechnet seinen Standardport aus der Versionsnummer. Wenn &kajongg; zum Beispiel die Version 4.9.5 hat, wird Port 8409 benutzt: 8000 +plus erste Ziffer der Version * 100 plus mittlere Ziffer der Version. Wenn der Spieler keinen Port für den gewünschten Server angibt, berechnet sein Rechner den Portnummer auf die gleiche Art. Wenn also auf einem Rechner mehrere Spielserver mit verschiedenen Programmversionen laufen, sollte normalerweise die Verbindung zum richtigen Spielserver automatisch hergestellt werden. Auf jeden Fall ist dadurch sichergestellt, das die Versionen auf dem Spielserver und dem Rechner übereinstimmen, falls nicht, erhalten Sie einen Warnhinweis.

source: If you encounter possible bugs, you might want to use the option <literal>--debug=traffic</literal>. This will show you, on the console where the game server has been started, what messages are flowing between the game server and the clients.
de: Wenn Sie eventuelle Fehler finden, wollen Sie vielleicht die Option <literal>--debug=traffic</literal> verwenden. Damit sehen Sie auf der Konsole, auf der Sie den Server gestartet haben, was für Meldungen zwischen dem Server und den Spieler-Rechnern ausgetauscht werden.

source: Caveats
de: Vorsicht!

source: If you want to make sure nobody can cheat none of the human players should have access to the computer the game server is running on. Of course you can never avoid that two players help each other because you cannot know what they really are doing. Two players might even be one and the same person.
de: Wenn Sie sicherstellen wollen, dass niemand betrügen kann, sollte kein Mitspieler Zugriff auf den Spielserver haben. Natürlich kann man nie vermeiden, dass zwei Spieler einander helfen, weil man ja nicht wissen kann, was sie wirklich tun. Zwei Spieler könnten sogar ein und dieselbe Person sein.

source: Game rules
de: Spielregeln

source: Worldwide, many different game variants exist. Currently, &kajongg; supports two variants of Classical Chinese, one as played in Germany and one as played in Great Britain.
de: Weltweit gibt es viele verschiedene Varianten. Zurzeit unterstützt &kajongg; zwei Varianten des klassischen Chinesische Mah Jongg, eine Variante der Spielweise in Deutschland und eine andere Variante, die in Großbritannien gespielt wird.

source: This description does not go into details and as such matches both variants.
de: Diese Beschreibung ist nicht sehr ausführlich und trifft daher auf beide Varianten zu.

source: However most of the basic rules are the same in most variants.
de: Aber die meisten der grundlegenden Regeln sind in den meisten Varianten dieselben.

source: Since the program &kajongg; knows how to play, this description only contains things that might not be obvious.
de: Da das Programm &kajongg; die Spielregeln beherrscht, beschreiben wir hier nur, was nicht offensichtlich ist.

source: If you want to learn Mah Jong in more detail, please consult the <link linkend="bibliography">bibliography</link>.
de: Wenn Sie Mah Jongg genauer kennen lernen möchten, finden Sie in der <link linkend="bibliography">Bibliographie</link> geeignete Lektüre.

source: The aim of the game
de: Das Ziel des Spiels

source: Each player tries to collect tiles such that she has a winning hand. On achieving this, she calls "Mah Jong". In a winning hand, the tiles are normally grouped into five melds: Four melds with three or four tiles each and a fifth meld consisting of two equal tiles. A normal meld has three or four identical tiles (called Pung and Kong respectively) or three successive tiles like Bamboo 3, Bamboo 4, Bamboo 5 (called Chow).
de: Jeder Spieler versucht, Ziegel so zu sammeln, dass er eine Gewinnerhand bekommt. Wenn das erreicht ist, ruft er "Mah Jongg". In einer Gewinnerhand sind die Ziegel normalerweise in fünf Figuren angeordnet: Vier Figuren mit je drei oder vier Ziegeln und eine fünfte Figur, die aus zwei identischen Ziegeln besteht. Eine normale Figur hat drei oder vier identische Ziegel (Pong oder Kan) oder drei aufeinanderfolgende Ziegel wie Bambus 3, Bambus 4, Bambus 5 (Chi).

source: The course of the game
de: Der Spielverlauf

source: Initially, the player with the East wind (as indicated on the wall) has one more tile than the other players. East begins by discarding an unwanted tile.
de: Am Anfang hat der Spieler mit dem Ostwind (sichtbar auf der Mauer) einen Ziegel mehr als die anderen. Osten beginnt, indem er einen ungewünschten Ziegel ablegt.

source: Whenever a tile has been discarded, other players can claim it by saying what they can complete with that tile (Chow, Pung, Kong, Mah Jong). Only the next player can claim a Chow - the other claims are possible for all players. A meld completed by a claim will be exposed - made visible to all players.
de: Wenn ein Ziegel abgelegt wurde, können andere Spieler ihn rufen, indem sie sagen, was sie damit komplettieren können (Chi, Pong, Kan, Mah Jongg). Nur der nächste Spieler darf Chi rufen - die anderen Rufe sind für alle Spieler erlaubt. Eine Figur, die durch einen gerufenen Ziegel komplettiert wird, wird aufgedeckt - sie wird für alle Spieler sichtbar.

source: If nobody claims the discarded tile, the next player, South (and then West and North) gets a tile from the wall and discards an unwanted tile.
de: Wenn niemand den abgelegten Ziegel ruft, bekommt der nächste Spieler, Süden (und dann Westen und Norden) einen Ziegel von der Mauer und legt einen unpassenden Ziegel ab.

source: There are several rules about when a Pung can be extended to a Kong (by claiming the forth tile or by getting it from the wall) - these rules are not explained here. But &kajongg; of course knows them and makes sure they are respected. If a Kong is declared, the player automatically gets a replacement tile from the wall - otherwise it would not be possible to build the five melds as mentioned above.
de: Es gibt verschiedene Regeln, wann man einen Pong zu einem Kan erweitern kann (indem man ruft oder den vierten Stein von der Mauer bekommt) - diese Regeln erklären wir hier nicht. Aber &kajongg; kennt sie natürlich und stellt sicher, dass sie eingehalten werden. Wenn ein Kan deklariert wird, bekommt der Spieler automatisch einen Ersatzziegel von der Mauer - sonst wäre es ihm nicht möglich, die 5 Figuren für eine Gewinnerhand zu erzeugen.

source: Year, Round and Hand
de: Jahr, Runde und Spiel

source: When a player claims Mah Jong or we end up in a draw, a hand is completed. Now, except for draws, the winds rotate among the players. This is repeated until every player once had every wind. This entire unit is called a round. An entire game, also called year, consists of four such rounds: East wind round, South wind round, West wind round, North wind round. The wind of a round is also called prevailing wind, it can result in higher scores.
de: Wenn ein Spieler Mah Jongg sagt oder niemand gewinnen kann, ist ein Spiel zu Ende. Nun drehen die Winde, sie wandern zum nächsten Spieler, es sei denn Osten oder niemand gewinnt. Das wiederholt sich, bis jeder Spieler einmal jeden Wind hatte. Damit ist eine Runde beendet. Eine ganze Partie (ein Jahr) besteht aus vier solchen Runden: Ostwindrunde, Südwindrunde usw. Der Wind der Runde, der Rundenwind, wird auch der vorherrschende Wind genannt. Ziegel dieses Windes können höhere Punktzahlen erzeugen.

source: So a full game (a year) consists of at least 16 hands. Since the winds do not rotate for draws or when the East player says Mah Jong, a higher number of hands is normally needed for a full game.
de: Eine volle Partie (ein Jahr) besteht aus mindestens 16 Händen. Da die Winde sich nicht drehen, wenn unentschieden gespielt wird oder Osten gewinnt, sind es meistens deutlich mehr Hände.

source: Bonus tiles
de: Bonusziegel

source: A game can contain eight bonus tiles (unless the rules exclude them). They are exposed separately on the right side of the player region as they are never used for building melds. They do however generate bonus points.
de: Das Spiel kann acht Bonusziegel enthalten (wenn der Regelsatz sie nicht ausschließt). Sie werden sofort rechts aufgedeckt, da sie nie für Figuren(Chi, Pong, Kan) verwendet werden können. Sie generieren aber Bonuspunkte.

source: If a player gets a bonus tile, she will automatically also get a replacement tile from the wall.
de: Wenn ein Spieler einen Bonusziegel bekommt, wird ihm automatisch ein Ersatzziegel von der Mauer zugeteilt.

source: Scoring
de: Bewertung

source: At the end of a hand, the score for each player is computed. First, basis points are counted like 2 points for a simple exposed pung or 20 points for winning. Next, another set of rules is applied - those rules can double the points like one double for a meld of dragons. When the score for each hand is known, differences are paid between players - while the winner gets its full score paid from all other players. East always gets and pays twice her score.
de: Am Ende jedes Spiels werden die Punkte für jeden Spieler berechnet. Zuerst werden die Basispunkte gezählt wie z.B. zwei Punkte für einen einfachen offenen Pong oder 20 Punkte für den Gewinner. Danach wird eine weitere Gruppe von Regeln angewandt - diese können die Punktzahl verdoppeln. Zum Beispiel für einen Pong von Drachen. Nachdem die Punktzahl für jeden Spieler berechnet ist, zahlen diese die Differenzen untereinander aus. Nur der Gewinner bekommt seine volle Punktzahl von allen Verlierern. Osten bekommt und bezahlt immer alles doppelt.

source: Of course &kajongg; knows about all applicable rules but a good player knows what combinations get what score so she can optimize. While learning it is recommended to activate the window <guimenuitem>Explain Scores</guimenuitem>.
de: Natürlich kennt &kajongg; alle Bewertungsregeln, aber ein guter Spieler weiß, welche Kombinationen wieviel wert sind, um den Wert optimieren zu können. Während der Lernphase wird empfohlen, das Fenster <guimenuitem>Wertung erklären</guimenuitem> zu aktivieren.

source: The exact scoring rules often vary - in &kajongg; you are free to change them with the <link linkend="ruleset-options">the ruleset editor</link>.
de: Die exakten Bewertungsregeln variieren oft - in &kajongg; können Sie sie beliebig ändern, mit dem <link linkend="ruleset-options">Regel-Editor</link>.

source: The ruleset editor also shows you all available rules and their meaning. Place the mouse over them and for the more exotic rules help text will appear.
de: Der Regel-Editor zeigt auch alle verfügbaren Regeln und ihre Bedeutung. Platzieren Sie die Maus über einer Regel. Bei den komplizierteren wird ein Hilfetext erscheinen.

source: How to play with &kajongg;
de: Wie man mit &kajongg; spielt

source: You will be prompted for what you want to do. This is a little dialog which appears either on the right or at the bottom depending on the size of the window. If you make it broader than high, the dialog appears on the right. Sometimes the dialog will have a timeout - when it is over, the first possible answer is automatically selected for you. This timeout is configurable in the Ruleset Editor, under <guilabel>Options</guilabel>, <guilabel>Claim Timeout</guilabel>. All players should have the same timeout, that is why this is part of the ruleset.
de: Sie werden einen Dialog sehen, in denen Sie angeben können, was Sie tun wollen. Dieser Dialog erscheint entweder rechts oder unten, abhängig von der Größe des Fensters. Wenn Sie es breiter als hoch machen, erscheint er rechts. Manchmal wird der Dialog eine Bedenkzeit anbieten - wenn sie vorbei ist, wird automatisch die erste mögliche Antwort für Sie ausgewählt. Diese Bedenkzeit ist im Regel-Editor definierbar, unter <guilabel>Optionen</guilabel>, <guilabel>Bedenkzeit</guilabel>. Alle Spieler sollten dieselbe Bedenkzeit haben, darum ist sie Teil des Regelsatzes.

source: If you need to select a tile from your hand, you can move between tiles using the right and left arrow keys or the letters h and l on your keyboard. Of course you can use the mouse too.
de: Wenn Sie einen Ziegel aus Ihrer Hand auswählen wollen, können Sie sich mit den Pfeilen rechts und links respektive den Tasten h und l bewegen. Natürlich können Sie auch die Maus benutzen.

source: You can discard a tile by using the keyboard the same way as for all actions. Alternatively, you can use the mouse and move the tile from your hand into the discard area (the interior of the walls). The placement of the tile in the discard area will still be done by the computer - because the placement should be the same for players.
de: Man kann einen Ziegel ablegen, indem man wie üblich mit den Pfeiltasten draufgeht und ihn auswählt. Alternativ geht das aber auch mit der Maus: Einfach den Ziegel ins Spielfeld ziehen. Die Platzierung im Spielfeld ist aber trotzdem zufällig und nicht dort, wo man ihn hinzieht. Weil die Platzierung für alle Spieler dieselbe sein soll, wird sie immer vom Rechner vorgenommen.

source: Often, the dialogs will offer choices which are not really applicable like calling Pung when you do not have the needed tiles. This is intended - just like in a real game. But you can configure impossible choices away: Disable <guilabel>Show only possible actions</guilabel> on the <guilabel>Play</guilabel> page of the settings dialog.
de: Oft wird der Dialog Auswahlmöglichkeiten anbieten, die gar nicht anwendbar sind, z.B. Pong, wenn Sie die nötigen Ziegel gar nicht haben. Das ist Absicht - wie in einem echten Spiel. Sie können dies Verhalten ändern, indem Sie im Einrichtungsdialog auf der Seite <guilabel>Spielen</guilabel> <guilabel>Nur mögliche Aktionen anzeigen</guilabel> deaktivieren.

source: Discarded tiles are placed randomly between the walls. Some game variants define where the tiles should be placed, this is not yet configurable however. When it becomes configurable, it will be part of the ruleset.
de: Abgelegte Ziegel werden zufällig zwischen den Mauern platziert. Manche Spielvarianten definieren, wo die Ziegel abgelegt werden sollen, das ist aber noch nicht definierbar. Wenn man das dann definieren kann, wird es Teil des Regelsatzes.

source: Interface Overview
de: Die Benutzeroberfläche

source: Menu Items
de: Menüeinträge

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>C</keycap></keycombo></shortcut> <guimenu>Game</guimenu> <guimenuitem>Score Manual Game</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>C</keycap></keycombo></shortcut> <guimenu>Partie</guimenu> <guimenuitem>Manuelle Partie bewerten</guimenuitem>

source: Only score a manually played game.
de: Bewertet eine manuell gespielte Partie.

source: You can load an old game or start a new game. By default only pending (i.e. unfinished) games are shown in the selection list. You can optionally show all games including finished games. Here you can also delete games.
de: Sie können eine alte Partie laden oder eine neue starten. Normalerweise werden nur unbeendete Partien angezeigt, optional können Sie alle sehen. Hier können Sie auch Partien löschen.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo></shortcut> <guimenu>Game</guimenu> <guimenuitem>Play</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo></shortcut> <guimenu>Partie</guimenu> <guimenuitem>Spielen</guimenuitem>

source: Play with others (people and computers)
de: Spiele mit anderen (Personen oder Rechner)

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>W</keycap></keycombo></shortcut> <guimenu>Game</guimenu> <guimenuitem>Abort Game</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>W</keycap></keycombo></shortcut> <guimenu>Partie</guimenu> <guimenuitem>Partie abbrechen</guimenuitem>

source: Abort the current game. If it was a manual game with scoring only, you can resume it later. If you played using &kajongg;, the game is not yet resumable.
de: Aktuelle Partie abbrechen. Wenn das eine Bewertung einer manuellen Partie ist, können Sie sie später fortsetzen. Wenn Sie mit Freunden oder gegen den Rechner spielen, ist eine spätere Wiederaufnahme noch nicht möglich.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo></shortcut> <guimenu>Game</guimenu> <guimenuitem>Quit &kajongg;</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo></shortcut> <guimenu>Partie</guimenu> <guimenuitem>&kajongg; beenden</guimenuitem>

source: <action>Quits</action> &kajongg;.
de: <action>Beendet</action> &kajongg;.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>S</keycap></keycombo></shortcut> <guimenu>View</guimenu> <guimenuitem>Show Scoring Editor</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>S</keycap></keycombo></shortcut> <guimenu>Ansicht</guimenu> <guimenuitem>Bewertungsdialog zeigen</guimenuitem>

source: <action>Scoring Dialog</action>: Show or hide the scoring dialog. This dialog is explained <link linkend="enterhand">here</link>.
de: <action>Bewertung</action> Den Bewertungsdialog zeigen oder verbergen. Dieser Dialog wird <link linkend="enterhand">hier</link> erklärt.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>T</keycap></keycombo></shortcut> <guimenu>View</guimenu> <guimenuitem>Score Table</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>T</keycap></keycombo></shortcut> <guimenu>Ansicht</guimenu> <guimenuitem>Punktetabelle</guimenuitem>
