Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdegames/kajongg.po
Languages: de

source: The &kajongg; Handbook
de: Das Handbuch zu &kajongg;

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Wolfgang</firstname><surname>Rohdewald</surname><affiliation><address><email>wolfgang@rohdewald.de</email></address></affiliation><contrib>Übersetzung</contrib></othercredit>

source: This documentation describes the game of &kajongg; version &kappversion;
de: Dieses Handbuch beschreibt das Spiel &kajongg; in der Version &kappversion;.

source: game
de: Spiel

source: board
de: Brettspiel

source: arcade
de: Arkade

source: tile game
de: Spiel mit Steinen

source: tiles
de: Steine

source: four players
de: vier Spieler

source: Introduction
de: Einführung

source: Gametype:
de: Spieltyp:

source: Board, Arcade
de: Brettspiel, Arkade

source: Number of possible players:
de: Anzahl der Spieler:

source: Four
de: vier

source: &kajongg; is a board game created after the famous oriental game of Mah Jong (from Chinese <foreignphrase lang="zh">麻將</foreignphrase>). It is played by four players. Worldwide many different rulesets are in use. Right now &kajongg; supports the Classical Chinese rules as played in Germany, eventually other main rulesets will follow. It is possible to customize or add new rulesets. Please do so and send them to the program author for integration!
de: &kajongg; ist ein Brettspiel: Das berühmte fernöstliche Spiel Mahjongg (chinesisch<foreignphrase lang="zh">麻將</foreignphrase>). Es wird zu viert gespielt. Weltweit gibt es viele verschiedene Spielvarianten. Zurzeit unterstützt &kajongg; die klassischen Chinesischen Regeln, wie sie in Deutschland gespielt werden; weitere werden folgen. Man kann die Regeln beliebig ändern und auch neue Regelsätze definieren. Bitte tun Sie das und senden Sie sie dem Programm-Autor zur Integration!

source: &kajongg; can be used in two different ways: Scoring a manual game where you play as always without the help of a computer and use &kajongg; for the computation of scores and for bookkeeping. Or you can use &kajongg; to play against any combination of other human players or computer players.
de: &kajongg; kann auf zwei Arten verwendet werden: Erstens ein manuelles Spiel bewerten, wo Sie wie immer spielen und &kajongg; für die Berechnung der Punkte und für die Abrechnung verwenden. Zweitens mit &kajongg; spielen: gegen eine beliebige Kombination von anderen Personen und Rechnerspielern.

source: The Screen Layout
de: Der Bildschirmaufbau

source: A screenshot of &kajongg;
de: Bildschirmphoto von &kajongg;

source: Screenshot
de: Bildschirmfoto

source: A quick explanation of the parts of the game screen.
de: Eine kurze Beschreibung aller Teile des Spielfeldes:

source: Toolbar
de: Werkzeugleiste

source: The Toolbar is located beneath the menubar and contains buttons for the most often used actions. The content of the Toolbar can be edited. You can also make it invisible, giving more room to the Board.
de: Die Werkzeugleiste ist unterhalb der Menüleiste und enthält Knöpfe für die wichtigsten Befehle. Den Inhalt der Werkzeugleiste können Sie ändern. Sie können sie auch ausblenden, um mehr Platz für das Spielfeld zu haben.

source: Depending on the size of your screen you may want to make the toolbar invisible or to move it to the left side of the window. You can do that by right-clicking with the mouse on the toolbar.
de: Je nach Bildschirmgröße kann es sinnvoll sein, die Werkzeugleiste unsichtbar zu machen oder sie an den linken Rand des Fensters zu verschieben. Das können Sie tun, indem Sie mit der rechten Maustaste auf die Werkzeugleiste drücken.

source: Board
de: Spielfeld

source: The Board is the largest section of the window. You see the four walls with a length of 18 tiles (the exact number depends on the rules like using bonus tiles or not). The names of the players are written on the walls, together with the current value of the hand (as far as known) and their wind tiles. The prevailing wind has a coloured background, east in the screenshot above.
de: Das Spielbrett ist der größte Bereich des Fensters. Sie sehen 4 Mauern mit einer Länge von 18 Ziegeln (wird später konfigurierbar). Die Namen der Spieler stehen auf den Mauern, zusammen mit ihren Winden. Der vorherrschende Wind hat einen gefärbten Hintergrund, im obigen Beispiel Osten.

source: When <link linkend="play">playing</link>, the interior of the walls holds the tiles discarded by the players. They are randomly placed. The last discarded tile has a blue focus frame.
de: Beim <link linkend="play">Spielen</link> sehen Sie im Hof (zwischen den Mauern) die von den Spielern abgelegten Ziegel. Sie werden dort zufällig platziert. Der zuletzt abgelegte Ziegel hat einen blauen Rahmen.

source: When <link linkend="scoreGame">scoring manual games</link>, the interior of the walls has a selection of all available tiles, the central selector. You can assign them to the players using the mouse or the keyboard.
de: Wenn Sie ein Spiel <link linkend="scoreGame">bewerten</link>, sehen Sie innerhalb der Wände eine Auswahl aller Ziegel: Den zentralen Auswahlbereich. Sie können Ziegel den Spieler mit der Maus oder der Tastatur zuordnen.

source: Player Region
de: Spielerbereich

source: Every player has a screen range for her tiles. The upper row contains exposed tiles, the lower row concealed tiles. When <link linkend="scoreGame">scoring manual games</link>, concealed tiles are shown with a shadow over the entire tile. Bonus tiles go to the right end.
de: Jeder Spieler hat einen Bereich für seine Ziegel. Die obere Reihe enthält aufgedeckte Ziegel, die untere verdeckte. Beim <link linkend="scoreGame">manuellen Bewerten einer Partie</link> werden verdeckte Ziegel mit einem Schatten über dem ganzen Ziegel gezeigt. Im Beispiel hat Klaus einen verdeckten Pong Kreis 9. Bonusziegel stehen ganz rechts.

source: The dialog presents choices the player has. Most often it has a timeout with a progress bar showing the remaining time.
de: Der Dialog zeigt die Möglichkeiten, die der Spieler hat. Meistens hat er einen Time-Out mit einem Fortschrittsbalken, der die noch verbleibende Zeit anzeigt.

source: Status bar
de: Statusleiste

source: The Status bar is located at the bottom of the screen and contains the current totals for the players.
de: Die Statusleiste ist ganz unten im Fenster und zeigt die aktuellen Punktestände aller Spieler.

source: Scoring a Manual Game
de: Manuelle Partie bewerten

source: In this mode, &kajongg; is only used to do the scoring. You play as usual with real people on a real table and at the end of a game you can tell &kajongg; the tiles a player has in her hand and everything else &kajongg; needs to know for calculating the scores - which is what the program will do. Alternatively you can calculate the hand scores manually and enter them. &kajongg; will then make the payments amongst the players and write the results into a data base. It is possible to suspend a game, start another game with other players and resume old games. All rules will be saved together with the games, so different games can be played with different rules.
de: In diesem Modus übernimmt &kajongg; nur das Bewerten einer Partie. Sie spielen wie immer, und am Ende jedes Spiels sagen Sie &kajongg;, welcher Spieler was hat, und alles andere, was &kajongg; braucht, um seine Hand zu bewerten. Alternativ können Sie die Werte auch selber berechnen und eingeben - meistens ist das am bequemsten. &kajongg; rechnet dann zwischen den Spielern ab und schreibt alles in eine Datenbank. Man kann eine Partie unterbrechen, eine andere mit anderen Spielern und anderen Regeln starten und alte Partien wiederaufnehmen. Alle Regeln werden zusammen mit den Partien gespeichert, dadurch kann man jede Partie mit anderen Regeln spielen.

source: From the menu, select <guimenu>Game</guimenu> / <guimenuitem>Score Manual Game</guimenuitem> or press <keycombo action="simul">&Ctrl;<keycap>C</keycap></keycombo>.
de: Wählen Sie im Menü <guimenu>Partie</guimenu> / <guimenuitem>Manuelle Partie bewerten</guimenuitem> oder drücken Sie <keycombo action="simul">&Ctrl;<keycap>C</keycap></keycombo>.

source: Now you can either select an existing unfinished game or start a new game. If you start a new game, you will be asked for the players and the ruleset. &kajongg; will propose the same values used for the previous game. If there was no previous game, it will propose the first four defined players. Please note that you cannot change the ruleset or any of its rules after this selection. You can do that beforehand in <link linkend="ruleset-options">the ruleset editor</link>.
de: Nun können Sie entweder eine existierende, unbeendete Partie wählen oder eine neue starten. Wenn Sie eine neue Partie starten, werden Sie nach den Spielern und dem Regelsatz gefragt. &kajongg; wird dieselben Werte wie die des zuletzt gespielten Partie. Wenn es keine vorherige gibt, werden die ersten vier definierten Spieler vorgeschlagen. Beachten Sie bitte, dass Sie die Regeln für diese Partie nach Auswahl des Regelsatzes nicht mehr ändern können. Sie können das vorher tun, mit dem <link linkend="ruleset-options">Regel - Editor</link>.

source: Now you get a new window titled "Enter the hand results". Read <link linkend="enterhand-tiles">Have &kajongg; compute the score</link> for a detailed description.
de: Nun bekommen Sie ein neues Fenster "Bewertung für dieses Spiel". Lesen Sie <link linkend="enterhand-tiles">&kajongg; den Wert berechnen lassen</link> für eine genaue Beschreibung.

source: After saving hand results, continue with the next hand.
de: Nachdem Sie die Spielresultate gespeichert haben, geht es weiter mit dem nächsten Spiel.

source: Entering hand results
de: Spiel bewerten

source: Scores
de: Punkte

source: This is the window for entering hand results. It automatically shows itself when &kajongg; thinks you might need it. You can always show or hide it by pressing <keycombo action="simul">&Ctrl;<keycap>S</keycap></keycombo> or by selecting the corresponding menu entry.
de: In diesem Fenster können Sie Spielresultate erfassen. Es zeigt sich von selber, wenn &kajongg; denkt, dass Sie es benötigen. Sie können es jederzeit zeigen oder ausblenden, indem Sie <keycombo action="simul">&Ctrl;<keycap>S</keycap></keycombo> eingeben oder den entsprechenden Menü-Befehl auswählen.

source: As always the prevailing wind has its background colored.
de: Wie immer hat der vorherrschende Wind einen farbigen Hintergrund.

source: Here you can manually enter scores for all players. Alternatively you can exactly define which tiles a player had in her hand. If you choose to do that, the corresponding field for the manual score value will be grayed out. &kajongg; will automatically compute the score.
de: Hier können Sie manuell Punkte für alle Spieler erfassen. Stattdessen können Sie aber auch eingeben, welche Ziegel ein Spieler hat. Wenn Sie das tun, wird das Feld für die Punktezahl deaktiviert - es enthält aber nach wie vor die von &kajongg; automatisch berechneten Punkte.

source: After having entered all relevant data for a hand, press the button <guibutton>Save Hand</guibutton>. The hand values will be entered in the data base, and they are also shown in the score table. You might be prompted to change the seating positions of the players but you can choose not to change seats. The proposed changes are currently not customizable - if a ruleset needs something different, we will change that.
de: Nachdem Sie alle relevanten Daten zu einem Spiel erfasst haben, drücken Sie den Knopf <guibutton>Spiel speichern</guibutton>. Die Spielwerte werden dann in der Datenbank eingetragen, und auch in der Punkte-Tabelle angezeigt. Eventuell werden Sie aufgefordert, Plätze zu tauschen, das können Sie aber ablehnen. Die vorgeschlagenen Wechsel sind derzeit nicht konfigurierbar - wenn ein Regelsatz etwas anderes benötigt, werden wir das ändern.

source: If the player might have won, the check box in the column "Winner" will be enabled - click this for the winner.
de: Wenn der Spieler gewonnen haben könnte, wird die Box in der Kolonne "Gewinner" aktiv sein - setzen Sie dort einen Haken für den Gewinner.

source: The status bar will now show the updated balances for the players, and you can continue with the next hand.
de: Die Statusleiste zeigt dann die aktualisierten Totale der Spieler, und Sie können mit dem nächsten Spiel fortfahren.

source: Enter the score manually
de: Die Punktzahl manuell eingeben

source: A good player will probably prefer to compute her score himself. In that case you can directly enter it. This is only possible when no tiles are selected for this player.
de: Ein guter Spieler wird es wahrscheinlich vorziehen, seine Punkte selber zu berechnen. In diesem Fall können Sie sie direkt eingeben. Das ist nur dann möglich, wenn diesem Spieler keine Ziegel zugeordnet sind.

source: If you enter a manual score, it must already contain everything except penalties, you will have no optional rules to choose from. There is one exception: "Dangerous Game". This does not influence any scores, it is no offense either. It only means the payment between players is different: The offender pays all for all to the winner. The other two players do not exchange payments. This is currently not customizable.
de: Wenn Sie manuell eine Punktzahl eingeben, muss sie schon alles enthalten, Sie können keine Regeln manuell wählen. Nur die Strafen erfassen Sie bitte getrennt. Es gibt eine Ausnahme: Gefährliches Spiel. Das beeinflusst die Punktezahl nicht, und es ist auch keine Strafe, da es nur die Zahlungen zwischen den Spielern beeinflusst: Der Verursacher zahlt alles für alle an den Gewinner. Die anderen beiden Spieler rechnen nicht miteinander ab. Das ist derzeit nicht über den Regeleditor änderbar.

source: Have &kajongg; compute the score
de: &kajongg; den Wert berechnen lassen

source: If you explicitly tell &kajongg; what tiles a player holds, entering scores will be grayed out for that player in this window. While associating tiles with a player you will see how her score will grow - but as soon as you add the 14th tile the score goes to zero. That might surprise you but unless you declare this as the winner hand, it is recognized as a long hand which always has zero points. This behaviour is defined by the Classical Chinese ruleset, it might be different if you change the rules or use a different ruleset.
de: Wenn Sie &kajongg; explizit sagen, was für Ziegel ein Spieler hat, wird das Feld zur Punkteeingabe für diesen Spieler grau sein (keine Eingabe möglich). Während Sie einem Spieler Ziegel zuordnen, können Sie sehen, wie seine Punktezahl steigt - aber beim 14ten Ziegel auf 0 fällt. Das mag Sie überraschen, aber wenn das nicht der Gewinner ist, sind 14 Ziegel eine lange Hand und ergeben immer 0 Punkte. Das ist durch den Regelsatz Klassisch Chinesisch definiert, andere Regelsätze könnten sich auch anders verhalten.

source: You can associate tiles and melds with a player using either the mouse or the keyboard or both. With the mouse simply move tiles by dragging/dropping them to the player region. When dropping the tile, you will be asked what you want to move: Single, Pair, Pung, Kong, Claimed Kong or Chow. The upper row is for exposed tiles, the lower row for concealed tiles. The bonus tiles will appear to the far right. You can also move tiles and melds between rows, between players and back to the central selector.
de: Sie können Ziegel und Figuren den Spielern wahlweise mit der Maus oder mit der Tastatur zuordnen. Mit der Maus ziehen Sie die Ziegel einfach an den gewünschten Ort - je nach dem, was Sie von wo nach wo verschieben, werden Sie dann gefragt, was Sie verschieben wollen, z.B. Einzelziegel oder Pong. Zur Erinnerung - im Spielerbereich ist die obere Zeile für offene Figuren, die untere für verdeckte. Sie können auch von Spieler zu Spieler und zurück ins Zentrum verschieben.

source: If you prefer using the keyboard, you can use &Tab; to move between the central selector and the player regions. The keys <keycap>eswnESWN</keycap> move a tile to the players East, South, West and North. The keys <keycap>xX</keycap> move it back to the central selector. <keycap>ESWN</keycap> moves to the concealed row, <keycap>eswn</keycap> moves to the exposed row. You can move the cursor between tiles or melds using the arrow keys, the currently selected tile or meld has a blue frame. Since the key arrows are far away from letters on the keyboard, you can also use the letters <keycap>hjkl</keycap> or <keycap>HJKL</keycap> for moving the cursor. <keycap>hH</keycap> move left, <keycap>jJ</keycap> move down, <keycap>kK</keycap> move up, <keycap>lL</keycap> move right. This is how the unix editor "vi" does it. The &kde; browser konqueror and even this help program also support those keys in the same way. Those keys may differ if you use a language other than English but it is currently not possible to configure them.
de: Wenn Sie die Tastatur bevorzugen, benutzen Sie &Tab;, um Ihre Position zwischen dem zentralen Auswahlbereich und den Spielerbereichen zu ändern. Die Tasten<keycap>eswnESWN</keycap> verschieben einen Ziegel zu den Spielern Ost, Süd, West, Nord. Die Tasten <keycap>xX</keycap> verschieben ihn zurück zum zentralen Auswahlbereich. <keycap>ESWN</keycap> verschiebt in die untere Reihe für verdeckte Ziegel, <keycap>eswn</keycap> verschiebt in die obere Reihe für aufgedeckte Ziegel. Sie können Ihre Position von Ziegel zu Ziegel verschieben, indem Sie die Pfeiltasten verwenden. Der aktuelle Ziegel hat einen blauen Rahmen. Da die Pfeiltasten weit weg von den Buchstabentasten sind, können Sie auch die Tasten <keycap>hjkl</keycap> or <keycap>HJKL</keycap> benutzen, um Ihre Position zu ändern: <keycap>hH</keycap> nach links, <keycap>jJ</keycap> nach unten, <keycap>kK</keycap> nach oben, <keycap>lL</keycap> nach rechts. So ist es auch im Unix-Editor "vi", im &kde;-Browser Konqueror und sogar in diesem Hilfeprogramm.

source: The options "Last Tile" and "Last Meld" are needed by some rules like "last tile completes pair". They can only be used for the winner hand.
de: Die Optionen "Letzter Ziegel" und "Letzte Figur" werden von manchen Regeln gebraucht, z.B. "letzter Ziegel komplettiert Paar". Sie können nur für die Gewinner-Hand verwendet werden.

source: In the right part of the window you can manually apply some rules. What rules appear in this list depends on the current ruleset and on the tiles. In the example of the above screen shot, the losing players might have an option "dangerous game" - again depending on the ruleset and on their tiles. It is the aim of the developers to keep this list of manually selectable rules as short as possible. Optimally &kajongg; should always be able to automatically determine whether a rule applies, but sometimes &kajongg; does not have enough information or knowledge to decide.
de: Im rechten Teil des Fensters können Sie manuell Regeln anwenden. Welche Regeln dort zur Auswahl stehen, hängt vom aktuellen Regelsatz und den vorhandenen Ziegeln ab. Im Beispiel oben im Bild könnten die Verlierer eine Option "gefährliches Spiel" haben - auch das abhängig vom Regelsatz und den Ziegeln. Das Ziel der Entwickler ist, diese Liste so kurz wie möglich zu halten. &kajongg; soll möglichst alles automatisch bestimmen. Aber manchmal hat es nicht genug Information oder Wissen, um das selbst entscheiden zu können.

source: Penalties
de: Strafen

source: In the <link linkend="enterhand">window for entering hand results</link>, the <guibutton>Penalties</guibutton> button will bring up this window where you can enter penalties. This can be done at any point in time independent of the normal scoring mechanism.
de: Im Fenster <link linkend="enterhand">Bewertung für diese Hand</link> zeigt Ihnen der Knopf <guibutton>Strafen</guibutton> dieses Fenster, in dem Sie Strafen erfassen können. Das können Sie jederzeit tun, unabhängig vom normalen Bewertungssystem.

source: The <guilabel>Offense</guilabel> selection shows all offenses that might be applicable to the hands the players hold. Choose among them.
de: Die Auswahl <guilabel>Vergehen</guilabel> zeigt alle Vergehen, die für die aktuelle Hand möglich sind. Wählen Sie.

source: Now you can adapt the <guilabel>Total Penalty</guilabel>. This is the total sum that is moved from payers to payees. It will be evenly split between them.
de: Nun können Sie die <guilabel>Totalstrafe</guilabel> anpassen. Dies ist das Total, das von Schuldnern zu Empfängern verschoben wird. Es wird gleichmäßig zwischen den betroffenen Spielern aufgeteilt.

source: Depending on the type of offense, the number of payers and payees varies. The right number of players is displayed. If you select a player, &kajongg; ensures that this player only occurs once by adapting the other players.
de: Je nach Art des Vergehens variiert die Anzahl Schuldner und Empfänger. Die korrekte Anzahl von Spielern wird angezeigt. Wenn Sie einen Spieler auswählen, sorgt &kajongg; dafür, dass dieser Spieler nur einmal vorkommt, indem es die anderen Spieler anpasst.

source: Playing
de: Spielen

source: At any time, you can enable or disable the Demo Mode. In Demo Mode, the computer will play for you. If no game is currently played, a new game will be started with the last used ruleset.
de: Sie können den Demomodus jederzeit ein- und ausschalten. Im Demomodus wird der Rechner für Sie spielen. Wenn gerade keine Partie läuft, wird automatisch eine gestartet, und zwar mit dem zuletzt verwendeten Regelsatz.

source: Play against the computer
de: Spiele gegen den Rechner

source: First you will get a login dialog. Enter the game server you want to connect to and your user name. If you choose the special entry "Local Game", you only need to enter your name (or accept the proposed name) and the wanted ruleset. This will immediately start a local game where you play against 3 robot players. However if suspended games exist, they will be displayed in a list. You can then select the game you want to continue with or start a new game.
de: Zuerst bekommen Sie einen Anmeldungs-Dialog. Wählen Sie den Spielserver, mit dem Sie sich verbinden möchten, und Ihren Benutzernamen. Wenn Sie den speziellen Eintrag "Lokale Partie" wählen, müssen Sie nur Ihren Benutzernamen eingeben (oder den vorgeschlagenen akzeptieren), und den gewünschten Regelsatz. Dann wird sofort eine lokale Partie gestartet, in der Sie gegen drei Rechnerspieler spielen. Wenn allerdings unterbrochene Partien existieren, werden diese in einer Liste angezeigt. Sie können dann eine davon wählen, um sie weiterzuspielen, oder eine neue Partie beginnen.

source: Play with friends
de: Mit Freunden spielen

source: If you want to play against other real people, you need a game server to which all players, including yourself, need to connect. Do that by selecting any other host or by manually entering a new host name and by specifying your password for that host. The last used password will be proposed.
de: Wenn Sie mit Freunden spielen möchten, benötigen Sie einen Spielserver, mit dem sich alle Spieler, auch Sie, verbinden müssen. Tun Sie das, indem Sie den richtigen Spielserver auswählen oder einen neuen manuell eingeben, und indem Sie dann Ihr Passwort für diesen Spielserver eingeben. Das zuletzt verwendete Passwort wird vorgeschlagen.
