Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdegames/kajongg.po
Languages: de

source: Use the Ruleset Editor to customize rulesets. Predefined rulesets are shown in an italic font, customized rulesets have a normal font. Predefined rulesets cannot be changed by the user in any way, however an update of &kajongg; might. Customized rulesets will never be affected by an update.
de: Mit dem Regel-Editor können Sie die Regeln beliebig verändern. Vordefinierte Regelsätze werden kursiv angezeigt, angepasste Regelsätze erscheinen in normaler Schrift. Vordefinierte Regelsätze können Sie nicht ändern, aber eine Aktualisierung von &kajongg; könnte das tun. Angepasste Regelsätze werden durch eine Aktualisierung niemals verändert.

source: When starting a new game, you will be able to select a ruleset for that game. All rulesets defined in the ruleset editor can be used. The ruleset is saved together with the game, so you can always change rulesets here - your changes will only affect future games.
de: Wenn Sie eine neue Partie beginnen, können Sie den gewünschten Regelsatz für diese Partie auswählen. Alle Regelsätze, die im Regel-Editor erscheinen, können dort ausgewählt werden. Der Regelsatz wird zusammen mit der Partie gespeichert. Darum können Sie hier immer alle Regelsätze beliebig verändern - Ihre Änderungen können nur zukünftige Partien beeinflussen.

source: Rule, Points, x2, Limits
de: Regeln, Punkte, x2, Limits

source: Simply double click on whatever you want to change. If all values are cleared, this rule will have no influence on the game. Rules cannot be deleted.
de: Machen Sie einen Doppelklick auf den Wert, den Sie ändern möchten. Sind alle Werte gelöscht, hat diese Regel keinen Einfluss mehr auf das Spiel. Regeln können nicht gelöscht werden.

source: Copy and Remove
de: Kopieren und Löschen

source: You can copy and remove entire rulesets.
de: Sie können ganze Regelsätze kopieren und auch löschen.

source: Again this can even be done if existing games use this ruleset since every game has its own ruleset copy. You can view rulesets for old games: <link linkend="game-menu-scoreGame">Load</link> the old game and <link linkend="view-explain-scores">show its score table</link>.
de: Das geht sogar dann, wenn existierende Partien diese Regelsätze verwenden, da jede Partie ihre eigene Kopie vom verwendeten Regelsatz hat. Sie können sich die verwendeten Regeln für alte Partien ansehen: <link linkend="game-menu-scoreGame">Laden</link> der alten Partie und <link linkend="view-explain-scores">Anzeigen ihrer Punktetabelle</link>.

source: Compare
de: Vergleichen

source: <screeninfo>Ruleset Comparator</screeninfo>
de: <screeninfo>Regel-Vergleich</screeninfo>

source: <phrase>Ruleset Comparator</phrase>
de: <phrase>Regel-Vergleich</phrase>

source: You can select this command when an entire ruleset is selected. It lets you compare the selected ruleset against any other ruleset.
de: Sie können diesen Befehl verwenden, wenn ein ganzer Regelsatz markiert ist. Damit können Sie den markierten Regelsatz mit anderen vergleichen.

source: Default Keybindings
de: Standard-Tastenkürzel

source: The menu entry <menuchoice><guimenu>Settings</guimenu><guimenuitem>Configure ...</guimenuitem></menuchoice> allows you to change the default keyboard bindings.
de: Mit <menuchoice><guimenu>Einstellungen</guimenu><guimenuitem>Kurzbefehle festlegen ...</guimenuitem></menuchoice> können Sie die voreingestellten Tastenkürzel ändern.

source: The default shortcuts are as follows:
de: Die folgenden Tastenkürzel sind voreingestellt:

source: Displays this handbook.
de: Zeigt dieses Handbuch.

source: Score a manual game.
de: Eine manuelle Partie bewerten

source: Play a game with friends or computer players.
de: Spiele mit Freunden oder Rechnerspielern.

source: Abort the current game.
de: Aktuelle Partie abbrechen.

source: Quit the program.
de: Das Programm verlassen

source: Show the score table.
de: Zeigt die Punkte-Tabelle an.

source: Show a chat window.
de: Im Chatfenster anzeigen.

source: Change the viewing angle.
de: Änderung der Blickrichtung

source: Enables or disables the Demo Mode.
de: Schaltet den Demomodus ein und aus.

source: What's this? Help
de: <quote>Was ist das?</quote>-Hilfe

source: Full Screen Mode
de: Vollbildmodus

source: Known problems
de: Bekannte Probleme

source: It is not yet possible for the player herself to open an account on the game server.
de: Der Spieler kann für sich selber noch kein Benutzerkonto auf dem Spielserver anlegen.

source: In playing mode, penalties are not yet possible.
de: Im Spielmodus sind noch keine Strafen möglich.

source: The computer players are still rather stupid.
de: Die Rechnerspieler sind noch ziemlich dumm.

source: Possible future features
de: Mögliche Erweiterungen

source: Add more rulesets. This should optionally be done by people using those rulesets regularly.
de: Mehr Regelsätze definieren. Am besten wäre es, wenn das Leute tun würden, die diese Regelsätze regelmäßig verwenden.

source: Frequently asked questions
de: Häufig gestellte Fragen

source: I want to change the way this game looks. Can I?
de: Kann ich das Erscheinungsbild des Spiels ändern?

source: Yes. To change the way &kajongg; looks use the menubar to open the <link linkend="configuration">configuration utility</link>.
de: Ja. Um das Design für &kappname; zu ändern, verwenden Sie die Menüleiste, um den <link linkend="configuration">Einrichtungsdialog</link> zu öffnen.

source: Can I use the keyboard to assign tiles to players?
de: Kann ich mit der Tastatur Ziegel den Spielern zuordnen?

source: Yes. See <link linkend="enterhand-tiles">Have &kajongg; compute the score</link>
de: Ja. Siehe <link linkend="enterhand-tiles">Manuelle Bewertung</link>

source: Credits and License
de: Mitwirkende und Lizenz

source: &kajongg; for &kde;
de: &kajongg; für &kde;

source: Program Copyright &copy; 2009, 2010, 2011, 2012 <personname><firstname>Wolfgang</firstname><surname>Rohdewald</surname></personname> <email>wolfgang@rohdewald.de</email>
de: Programm Copyright &copy; 2009, 2010, 2011, 2012 <personname><firstname>Wolfgang</firstname><surname>Rohdewald</surname></personname> <email>wolfgang@rohdewald.de</email>

source: Documentation Copyright &copy; 2009, 2010, 2011, 2012 <personname><firstname>Wolfgang</firstname><surname>Rohdewald</surname></personname> <email>wolfgang@rohdewald.de</email>
de: Dokumentation Copyright &copy; 2009, 2010, 2011, 2012 <personname><firstname>Wolfgang</firstname><surname>Rohdewald</surname></personname> <email>wolfgang@rohdewald.de</email>

source: CREDIT_FOR_TRANSLATORS
de: <para>Übersetzung Wolfgang Rohdewald <email>wolfgang@rohdewald.de</email></para>

source: Bibliography
de: Literaturverzeichnis

source: Das Chinesische Mah-Jongg-Spiel by Uwe Martens 2005, Books on Demand GmbH, Norderstedt. This book is an excellent German reference containing everything you want to know about the rules used in Germany and many other aspects of the game.
de: Das Chinesische Mah-Jongg-Spiel by Uwe Martens 2005, Books on Demand GmbH, Norderstedt. Dieses Buch ist eine sehr gute deutsche Referenz. Sie erfahren alles über die in Deutschland benutzten Regeln und über viele andere Aspekte des Spiels.

source: The Complete Book of Mah-Jongg by A. D. Millington, 1977 (with several paperback editions up to 2003), Weidenfeld &amp; Nicolson, London. This is the ultimate reference for Classical Chinese Mah Jong as played in the Western world. It can give you valuable hints about game strategies.
de: The Complete Book of Mah-Jongg by A. D. Millington, 1977 (mit verschiedenen Taschenbuchausgaben bis 2003), Weidenfeld &amp; Nicolson, London. Dies ist die maßgebliche Referenz zum Klassischen Chinesischen Mah Jongg, wie es in der westlichen Welt gespielt wird. Es enthält viele wertvolle Tipps über Spielstrategien.

source: Mah-Jong by Gwyn Headley and Yvonne Seeley, 3rd edition, 2008, A &amp; C Black Publishers Ltd., London. This book is a very easy to use reference, concentrating on the rules as used in Great Britain, defined by the BMJA (The British Mah Jong Association).
de: Mah-Jong von Gwyn Headley and Yvonne Seeley, 3. Ausgabe, 2008, A &amp; C Black Publishers Ltd., London. Dies ist eine einfach zu benutzende Referenz, die sich auf die in England üblichen Regeln konzentriert, wie sie vom BMJA (The British Mah Jong Association) definiert wurden.

source: Use the .deb package from <ulink url="http://www.kde-apps.org/content/show.php/kajongg?content=103206"></ulink>. If it does not work for you, you can download kajongg-x-y.tar.gz from the same address and then do:
de: Benutzen Sie das .deb Paket von <ulink url="http://www.kde-apps.org/content/show.php/kajongg?content=103206"></ulink>. Wenn es für Sie nicht funktioniert, laden Sie kajongg-x-y.tar.gz von derselben Adresse und dann:

source: In both cases you will manually have to make sure that some other required packages are installed. The debian package does not yet contain these requirements. &kajongg; needs: (corresponding debian packages in parentheses)
de: In beiden Fällen müssen Sie manuell sicherstellen, dass andere benötigte Softwarepakete installiert sind. Das Debian-Paket kajongg enthält diese Abhängigkeiten bisher nicht. &kajongg; benötigt: (entsprechende Debian-Paketnamen in Klammern)

source: the KDE4 games library (libkdegames5)
de: die KDE4 Spielebibliothek (libkdegames5)

source: Python 2.6 or higher (python)
de: Python 2.6 oder höher (python)

source: QT4.4 or higher (libqt4-core, libqt4-gui, libqt4-svg, libqt4-sql, libqt4-sql-sqlite)
de: Qt4.4 oder höher (libqt4-core, libqt4-gui, libqt4-svg, libqt4-sql, libqt4-sql-sqlite)

source: the python bindings for QT4 (python-qt4, python-qt4-sql)
de: die Python-Anbindung für Qt4 (python-qt4, python-qt4-sql)

source: the python bindings for KDE4 (python-kde4)
de: die Python-Anbindung für KDE 4 (python-kde4)

source: the python twisted library (python-twisted-core)
de: Die Python twisted Bibliothek (python-twisted-core)
