Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdegames/kapman.po
Languages: de

source: The &kapman; Handbook
de: Das Handbuch zu &kapman;

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Johannes</firstname><surname>Obermayr</surname><affiliation><address><email>johannesobermayr@gmx.de</email></address></affiliation><contrib>Übersetzung</contrib></othercredit>

source: &kapman; is a clone of the well known game <application>Pac-Man</application>.
de: &kapman; ist eine Kopie des sehr bekannten Spiels <application>Pac-Man</application>.

source: one player
de: ein Spieler

source: ghost
de: Geist

source: pill
de: Pille

source: energizer
de: Appetitanreger

source: Introduction
de: Einführung

source: Gametype:
de: Spielart:

source: Number of possible players:
de: Anzahl der Spieler:

source: <para>One</para>
de: <para>Einer</para>

source: &kapman; is a clone of the well known game <application>Pac-Man</application>. You must go through the levels escaping ghosts in a maze. You lose a life when a ghost eats you, but you can eat the ghosts for a few seconds when eating an energizer. You win points when eating pills, energizers, and bonus, and you win one life for each 10,000 points. When you have eaten all the pills and energizers of a level, you go to the next level, and the player and ghost speeds increase. The game ends when you have lost all your lives.
de: &kapman; ist eine Kopie des sehr bekannten Spiels <application>Pac-Man</application>. In den unterschiedlichen Ebenen muss man in einem Labyrinth den Geistern entkommen. Ein Leben verliert man, wenn man von einem Geist gefressen wird. Jedoch können die Geister nach dem Fressen eines <firstterm>Appetitanregers</firstterm> auch für einige Sekunden gefressen werden. Durch das Fressen der <firstterm>Pillen</firstterm>, <firstterm>Appetitanreger</firstterm> und <firstterm>Zusatzkost</firstterm> werden die Punkte gesammelt. Für je 10.000 Punkte erhält man ein zusätzliches Leben. Wenn alle <firstterm>Pillen</firstterm> und <firstterm>Appetitanreger</firstterm> in der jeweiligen Ebene gefressen wurden, steigt man in die nächste Ebene auf, in der die Geschwindigkeit der Figur und Geister steigt. Das Spiel endet, wenn alle Leben verbraucht sind.

source: <screeninfo>A &kapman; screenshot</screeninfo>
de: <screeninfo>Ein Bildschirmfoto von &kapman;</screeninfo>

source: <phrase>A &kapman; screenshot</phrase>
de: <phrase>Ein Bildschirmfoto von &kapman;</phrase>

source: How to Play
de: Spielanleitung

source: Objective:
de: Spielziel:

source: Go through the levels by eating all pills and energizers.
de: Durch die Ebenen bewegen und dabei alle <firstterm>Pillen</firstterm> und <firstterm>Appetitanreger</firstterm> fressen.

source: &kapman; will load level one once you start the game. To start the game, press an arrow key. You move straight ahead without pressing any key. To turn, press an arrow key. You should not turn at the last moment, but anticipate and you will turn as soon as possible. To eat a pill, an energizer, a bonus, or even a ghost, you must get in touch with it. When all the pills and energizers have been eaten, you move to the next level.
de: Sobald das Spiel gestartet ist, lädt &kapman; die erste Ebene. Um ein Spiel zu starten, muss eine Pfeiltaste gedrückt werden. Danach bewegt sich die Spielfigur solange in diese Richtung fort, bis mittels einer anderen Pfeiltaste die Richtung gewechselt wird. Die Betätigung der Pfeiltaste sollte nicht erst im letzten Moment geschehen, sondern vielmehr etwas davor, damit der Richtungswechsel bei der nächsten Gelegenheit durchgeführt wird. Um die <firstterm>Pillen</firstterm>, <firstterm>Appetitanreger</firstterm> oder <firstterm>Geister</firstterm> zu fressen, muss die Figur mit ihnen in Berührung kommen. Wenn alle <firstterm>Pillen</firstterm> und <firstterm>Appetitanreger</firstterm> gefressen wurden, steigt man in die nächste Ebene auf.

source: Game Rules, Strategies and Tips
de: Spielregeln, Strategien und Tipps

source: Rules
de: Spielregeln

source: To move to the next level, you must eat every pill and energizer in the maze.
de: Um in die nächste Ebene zu gelangen, müssen alle <firstterm>Pillen</firstterm> und <firstterm>Appetitanreger</firstterm> im Labyrinth gefressen werden.

source: A bonus appears when you have eaten 1/3 and 2/3 of the pills and energizers. It disappears after a few seconds (10 seconds at the first level, but it decreases as the level increases) if you have not eaten it.
de: Eine Zusatzkost erscheint, nachdem 1/3 bzw. 2/3 der <firstterm>Pillen</firstterm> und <firstterm>Appetitanreger</firstterm> gefressen wurden. Diese verschwinden wieder, wenn sie nach ein paar Sekunden nicht gefressen wurden (nach 10 Sekunden in der ersten Ebene - schneller mit zunehmender Ebene).

source: As the level increases, both your speed and the ghosts speed increase. However, the ghosts will be more and more faster than you.
de: Mit dem Aufstieg in eine höhere Ebene erhöht sich die Geschwindigkeit der Spielfigur und der Geister. Hierbei ist zu beachten, dass die Geister schneller werden als die Spielfigur.

source: If you get in touch with a ghost, you lose a life, and the current level restarts (but the eaten pills and energizer do not reappear).
de: Bei Berührung mit einem Geist verliert man ein Leben und die aktuelle Ebene beginnt von Neuem (bereits gefressene <firstterm>Pillen</firstterm> und <firstterm>Appetitanreger</firstterm> erscheinen jedoch nicht wieder).

source: If you are in the line of sight of a ghost (that is to say : no wall between the ghost, and both of you go to the same direction), the ghost will hunt you. Otherwise, the ghosts have a random moving.
de: Befindet sich ein Geist hinter der Spielfigur und bewegt sich dieser in dieselbe Richtung - ohne dass hierbei eine Wand zwischen beiden ist - wird der Geist die Spielfigur jagen. Ansonsten bewegen sich die Geister in zufälligen Richtungen fort.

source: When you eat an energizer, the ghosts slow down and you can eat them. If you eat a ghost, it goes back to its home and its normal behaviour. After a few seconds (10 seconds at the first level, but it decreases as the level increases), the ghosts that have not been eaten go back to their normal behaviour.
de: Nachdem ein <firstterm>Appetitanreger</firstterm> gefressen wurde, werden die Geister langsamer und können von der Spielfigur gefressen werden. Nachdem ein Geist gefressen wurde, erscheint er wieder in der Mitte des Spielfelds und bewegt sich in seiner ursprünglichen Weise fort. Nach ein paar Sekunden (10 in der ersten Ebene - immer weniger mit steigender Ebene) werden die nicht gefressenen Geister in ihr ursprüngliches Verhalten zurückgesetzt.

source: You win points when eating an item:
de: Durch das Fressen der Gegenstände erhält man Punkte:

source: Item values
de: Punkte für Gegenstände

source: Pill
de: Pillen

source: 10 points
de: 10 Punkte

source: Energizer
de: Appetitanreger

source: 20 points
de: 20 Punkte

source: Bonus
de: Zusatzkost

source: Current level * 100 points
de: Aktuelle Ebene * 100 Punkte

source: Ghost
de: Geist

source: It depends on the number of ghosts you have eaten since the last energizer was eaten:
de: Die Punkte sind abhängig davon, wie viele Geister seit dem Fressen des <firstterm>Appetitanregers</firstterm> gefressen wurden:

source: 1st ghost: 100 points
de: 1. Geist: 100 Punkte

source: 2nd ghost: 200 points
de: 2. Geist: 200 Punkte

source: 3rd ghost: 400 points
de: 3. Geist: 400 Punkte

source: 4th ghost: 800 points
de: 4. Geist: 800 Punkte

source: You get a life more every 10,000 points you win.
de: Je 10.000 Punkte erhält man ein weiteres Leben.

source: Strategies and Tips
de: Strategien und Tipps

source: To eat an item, you must get it touch with its center, not only a few pixels. So be sure you have really eaten what you wanted, before turning back.
de: Um einen Gegenstand zu fressen, muss man mit seinem Kern in Berührung kommen (ein paar Pixel reichen nicht aus). Es sollte daher sicher gestellt werden, dass der gewünschte Gegenstand auch tatsächlich gefressen wurde, bevor ein Richtungswechsel durchgeführt wird.

source: At first levels, the bonus does not make a lot of points and ghosts are not very fast, so you should concentrate on eating the most ghosts that you can.
de: In den unteren Ebenen können mit der <firstterm>Zusatzkost</firstterm> nicht viele Punkte gesammelt werden. Da sich hier die Geister nicht besonders schnell bewegen, sollte sich vielmehr auf diese konzentriert werden.

source: After about ten levels, the ghosts are faster and the bonus makes more points, so you should try to eat the bonus when possible. Do not hesitate to eat an energizer when you can see the bonus, to not be disturbed by the ghosts.
de: Nach ungefähr zehn Ebenen bewegen sich die Geister schneller und die <firstterm>Zusatzkost</firstterm> ist ergiebiger. Daher sollte ab jetzt versucht werden, zunächst die <firstterm>Zusatzkost</firstterm> zu fressen. Ein <firstterm>Appetitanreger</firstterm> kann hierbei helfen, damit man nicht von den Geistern gestört wird.

source: In the same way, you should try to eat an energizer before going to the dangerous places (like near the ghost home).
de: Gleichermaßen sollte zunächst ein <firstterm>Appetitanreger</firstterm> gefressen werden, bevor man sich an unsichere Stellen begibt (z. B. in die Nähe der <firstterm>Geisterkammer</firstterm>).

source: When the ghosts are too fast, you should avoid to eat them if you are near their home. They could go back faster than you think.
de: Werden die Geister zu schnell, sollte vom Fressen der Geister in der nähe der <firstterm>Geisterkammer</firstterm> Abstand genommen werden, da sie schneller zurück kommen, als man denkt ...

source: Do not hesitate to stay in the same place for a few seconds, waiting for the ghosts to go far away from the place you need to go.
de: Manchmal sollte ein paar Sekunden an einer Stelle verweilt werden, damit die noch zu besuchenden Bereiche sicher erreicht werden können.

source: You can find cheatcodes from the source code. But be careful: if you make a new high score but have cheated, your high score will not be registered.
de: Möglichkeiten zum <firstterm>Mogeln</firstterm> können im Quelltext gefunden werden. Es sollte jedoch Vorsicht walten: Beim <firstterm>Mogeln</firstterm> erfolgt kein Eintrag in die Bestenliste.

source: Last but not least: Have fun !
de: Zu guter Letzt: Spaß haben!

source: Interface Overview
de: Programmübersicht

source: Menu Items
de: Menüeinträge

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo></shortcut> <guimenu>Game</guimenu><guimenuitem>New</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo></shortcut><guimenu>Spiel</guimenu><guimenuitem>Neu</guimenuitem>

source: Starts a new game.
de: Hiermit wird ein neues Spiel gestartet.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>H</keycap></keycombo></shortcut> <guimenu>Game</guimenu><guimenuitem>Show High Scores</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>H</keycap></keycombo></shortcut><guimenu>Spiel</guimenu><guimenuitem>Bestenliste anzeigen</guimenuitem>

source: Brings up the high scores dialog.
de: Hiermit wird die Bestenliste angezeigt.

source: <guimenu>Game</guimenu><guimenuitem>Change Level</guimenuitem>
de: <guimenu>Spiel</guimenu><guimenuitem>Ebene wechseln</guimenuitem>

source: Brings up the level selection dialog. Be careful: changing the current level will make the game consider you as a cheater, so you will not able to register in the high scores table.
de: Hiermit wird der Dialog zur Auswahl der Ebene geöffnet. Es ist Vorsicht geboten: Beim Wechsel der aktuellen Ebene wird das Spiel als gemogelt bezeichnet und es kann kein Eintrag in der Bestenliste erfolgen.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo></shortcut> <guimenu>Game</guimenu><guimenuitem>Quit</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo></shortcut> <guimenu>Spiel</guimenu><guimenuitem>Beenden</guimenuitem>

source: <action>Quits</action> &kapman;.
de: Hiermit wird &kapman; beendet.

source: <guimenu>Settings</guimenu><guimenuitem>Play Sounds</guimenuitem>
de: <guimenu>Einstellungen</guimenu><guimenuitem>Klänge wiedergeben</guimenuitem>

source: Plays the sounds or mutes.
de: Hiermit wird eingestellt, ob die Klänge wiedergegeben werden.

source: <guimenu>Settings</guimenu><guisubmenu>Difficulty</guisubmenu>
de: <guimenu>Einstellungen</guimenu><guisubmenu>Schwierigkeitsgrad</guisubmenu>

source: Adjusts the game difficulty to <guimenuitem>Easy</guimenuitem>, <guimenuitem>Medium</guimenuitem> or <guimenuitem>Hard</guimenuitem>.
de: Stellt den Schwierigkeitsgrad des Spiels auf <guimenuitem>Einfach</guimenuitem>, <guimenuitem>Mittel</guimenuitem> oder <guimenuitem>Schwierig</guimenuitem>

source: Additionally &kapman; has the common &kde; <guimenu>Settings</guimenu> and <guimenu>Help</guimenu> menu items, for more information read the sections about the <ulink url="help:/fundamentals/ui.html#menus-settings">Settings Menu</ulink> and <ulink url="help:/fundamentals/ui.html#menus-help">Help Menu</ulink> of the &kde; Fundamentals.
de: Zusätzlich hat &kapman; die bekannten &kde;-Einträge im Menü <guimenu>Einstellungen</guimenu> und <guimenu>Hilfe</guimenu>, weitere Informationen dazu finden Sie in den Abschnitten über die Menüs <ulink url="help:/fundamentals/ui.html#menus-settings">Einstellungen</ulink> und <ulink url="help:/fundamentals/uihtml#menus-help">Hilfe</ulink> der &kde;-Grundlagen.

source: Default Keybindings
de: Standardmäßige Tastaturbelegung

source: <action>Turn up</action> - <keysym>Up Arrow</keysym>
de: <action>Nach oben</action> - <keysym>Pfeiltaste hoch</keysym>

source: <action>Turn down</action> - <keysym>Down Arrow</keysym>
de: <action>Nach unten</action> - <keysym>Pfeiltaste runter</keysym>

source: <action>Turn right</action> - <keysym>Right Arrow</keysym>
de: <action>Nach rechts</action> - <keysym>Pfeiltaste rechts</keysym>

source: <action>Turn left</action> - <keysym>Left Arrow</keysym>
de: <action>Nach links</action> - <keysym>Pfeiltaste links</keysym>

source: <action>Pause</action> - <keycap>P</keycap> or &Esc;
de: <action>Pause</action> - <keycap>P</keycap> oder &Esc;

source: Questions and Answers
de: Häufig gestellte Fragen

source: I want to change the way this game looks. Can I?
de: Kann das Aussehen des Spiels verändert werden?

source: You can select the &kapman; theme in the <menuchoice><guimenu>Settings</guimenu><guimenuitem>Configure Kapman...</guimenuitem></menuchoice> dialog. See the <link linkend="configuration">Game Configuration</link> chapter for more details.
de: Das Design von &kapman; kann im Dialog <menuchoice><guimenu>Einstellungen</guimenu><guimenuitem>&kapman; einrichten ...</guimenuitem></menuchoice> ausgewählt werden. Weitere Informationen hierzu können dem Abschnitt <link linkend="configuration">Spieleinstellungen</link> entnommen werden.

source: Can I skip a level?
de: Können Ebenen übersprungen werden?

source: There are two ways to change the current level. In both cases, you will be considered as a cheater and you will not be able to register to the high scores. The first way is using a cheatcode. I let you find it. The other way is selecting the level you want from the <menuchoice><guimenu>Game</guimenu><guimenuitem>Change Level</guimenuitem></menuchoice> dialog. See the <link linkend="menu">Menubar</link> section for more details.
de: Für den Wechsel der aktuellen Ebene gibt es zwei Möglichkeiten. In beiden Fällen wird man als <firstterm>Mogler</firstterm> bezeichnet und erhält keinen Eintrag in der Bestenliste. Die erste Möglichkeit ist die Eingabe eines - im Quellkode selbst zu findenden - Cheatkodes. Des Weiteren kann die gewünschte Ebene auch im Dialog <menuchoice><guimenu>Spiel</guimenu><guimenuitem>Ebene wechseln</guimenuitem></menuchoice> gewählt werden. Weitere Informationen hierzu können dem Abschnitt <link linkend="menu">Das Menü</link> entnommen werden.

source: Can I change default keyboard shortcuts?
de: Können die voreingestellten Tastaturkürzel verändert werden?

source: It is not possible for now. But will be a new feature in a future version of &kapman;. See the <link linkend="keybindings">Default Keybindings</link> section for more details.
de: Die Tastaturkürzel können derzeit noch nicht verändert werden, jedoch erfolgt die Integration in einer künftigen Version von &kapman;. Weitere Informationen zur akuellen Tastenbelegung können dem Abschnitt <link linkend="keybindings">Standardmäßige Tastaturbelegung</link> entnommen werden.

source: I have to quit the game now, but I am not finished yet. Can I save my progress?
de: Das Spiel muss unterbrochen werden - Kann es gespeichert werden?

source: You can not, and it is deliberate. We think that the game would be too easy if you could save the game and reload it as you lose your lives.
de: Nein. Diese Funktion wurde absichtlich weggelassen, da das Spiel zu einfach sein würde, wenn es gespeichert und nach dem Verlust der Leben wieder geladen werden könnte.

source: How can I get more lives?
de: Wie gibt es mehr Leben?

source: There are two ways to get lives. The first one is using a cheatcode. I let you find it. The other way is winning points. Every 10,000 points, you get a life more. See the <link linkend="rules">Rules</link> section for more details.
de: Es gibt zwei Möglichkeiten um an zusätzliche Leben zu kommen. Entweder durch <firstterm>Mogeln</firstterm> (selbst herausfinden) oder durch gesammelte Punkte (je 10.000 Punkte ein weiteres Leben). Weitere Informationen hierzu können dem Abschnitt <link linkend="rules">Regeln</link> entnommen werden.

source: Game Configuration
de: Spieleinstellungen

source: You can select the theme you want to play &kapman;. To do that, select <menuchoice><guimenu>Settings</guimenu><guimenuitem>Configure Kapman...</guimenuitem></menuchoice>. The &kapman; configuration dialog (see below) appears and you can then select the theme. It is immediately changed on validating your choice, no need to restart the game. You can click on the <guibutton>Defaults</guibutton> button to restore the default theme.
de: Im Dialog <menuchoice><guimenu>Einstellungen</guimenu><guimenuitem>&kapman; einrichten ...</guimenuitem></menuchoice> kann das gewünschte Design gewählt werden. Nach dem Drücken auf <guibutton>Anwenden</guibutton> oder <guibutton>OK</guibutton> wird die getroffene Auswahl augenblicklich übernommen (es ist kein Neustart des Spiels erforderlich). Mit <guibutton>Voreinstellungen</guibutton> wird das standardmäßige Design wiederhergestellt.

source: <screeninfo>The &kapman; configuration dialog</screeninfo>
de: <screeninfo>Der Einstellungsdialog von &kapman;</screeninfo>

source: <phrase>The &kapman; configuration dialog</phrase>
de: <phrase>Der Einstellungsdialog von &kapman;</phrase>

source: Credits and License
de: Danksagungen und Lizenz

source: Program copyright 2008 Thomas Gallinari <email>tg8187@yahoo.fr</email>
de: Programm © 2008 Thomas Gallinari <email>tg8187@yahoo.fr</email>

source: Program copyright 2008 Pierre-Benoit Besse <email>besse.pb@gmail.com</email>
de: Programm © 2008 Pierre-Benoit Besse <email>besse.pb@gmail.com</email>

source: Program copyright 2008 Alexandre Galinier <email>blluetroy@hotmail.com</email>
de: Programm © 2008 Alexandre Galinier <email>blluetroy@hotmail.com</email>

source: Program copyright 2008 Nathalie Liesse <email>nathalie.liesse@gmail.com</email>
de: Programm © 2008 Nathalie Liesse <email>nathalie.liesse@gmail.com</email>

source: Graphics copyright 2008 Thomas Gallinari <email>tg8187@yahoo.fr</email>
de: Grafiken © 2008 Thomas Gallinari <email>tg8187@yahoo.fr</email>

source: Documentation copyright 2008 Thomas Gallinari <email>tg8187@yahoo.fr</email>
de: Dokumentation © 2008 Thomas Gallinari <email>tg8187@yahoo.fr</email>

source: CREDIT_FOR_TRANSLATORS
de: <para>Übersetzung: Johannes Obermayr <email>johannesobermayr@gmx.de</email></para>

source: Installation
de: Installieren

source: Compilation and Installation
de: Kompilieren und Installieren
