Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdegames/katomic.po
Languages: de

source: The &kappname; Handbook
de: Das Handbuch zu &kappname;

source: Reviewer
de: Korrektur

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Maren</firstname><surname>Pakura</surname><affiliation><address><email>maren@kde.org</email></address></affiliation><contrib>Deutsche Übersetzung</contrib></othercredit><othercredit role="translator"><firstname>Matthias</firstname><surname>Kiefer</surname><affiliation><address><email>kiefer@kde.org</email></address></affiliation><contrib>Deutsche Übersetzung</contrib></othercredit>

source: This documentation describes the game of &katomic; version &kappversion;
de: Dieses Handbuch beschreibt das Spiel &katomic; in der Version &kappversion;

source: game
de: Spiel

source: logic
de: Logik

source: atoms
de: Atome

source: socoban
de: Sokoban

source: one player
de: ein Spieler

source: chemical elements
de: chemische Elemente

source: reassemble the molecule
de: Moleküle zusammensetzen

source: Introduction
de: Einführung

source: Gametype:
de: Spieltyp:

source: Logic, Arcade
de: Logik, Arcade

source: Number of possible players:
de: Anzahl der Spieler:

source: <para>One</para>
de: <para>Einer</para>

source: &katomic; is a fun and educational game built around molecular geometry. It employs a simplistic two-dimensional look at the elements which comprise a molecule. A molecule is disassembled into its separate atoms and scattered around the playing field. The player must reassemble the molecule in order to complete the current level and move up to the next one.
de: &katomic; ist sowohl ein unterhaltsames als auch lehrreiches Spiel über molekulare Strukturen. Es verwendet eine vereinfachte zweidimensionale Ansicht der zum Molekül gehörenden Elemente. Ein Molekül ist in seine verschiedenen Atome aufgeteilt und auf dem Spielfeld verstreut. Um die aktuelle Ebene abzuschließen und zur nächsten zu gelangen, muss der Spieler die Moleküle wieder zusammensetzen.

source: How to Play
de: Spielanleitung

source: Objective:
de: Ziel des Spiels:

source: Reassemble molecules from compound atoms by sliding them around.
de: Bauen Sie die Moleküle wieder zusammen, indem Sie die Atome durch Umherschieben verbinden.

source: &katomic; will load level one once you start the game and you can begin playing right away. To see how the molecule you are supposed to make looks like, take a look at the upper right corner. To play, click on an atom. You will see green arrows pointing in the directions where atom can move. To move the atom, click on the desired arrow. When an atom starts moving, it will not stop until it hits another atom or a wall, so make sure you think before you do your next move. You can assemble your molecule wherever you like on the game board, but some places are easier to access than others. When the molecule is assembled, you can move to the next level.
de: &katomic; wird die erste Ebene laden, wenn Sie das Spiel starten und Sie können umgehend beginnen. In der rechten oberen Ecke sehen Sie die richtige Zusammensetzung der Moleküle, die Sie bauen sollen. Um zu spielen, klicken Sie auf ein Atom. Sie werden dann grüne Pfeile sehen, die in die Richtungen deuten, in die das Atom bewegt werden kann. Um das Atom zu bewegen, klicken Sie auf den gewünschten Pfeil. Ein Atom hört erst auf, sich zu bewegen, wenn es auf ein anderes Atom oder eine Wand trifft; überlegen Sie sich ihre nächsten Züge also gut. Sie können Ihr Molekül an jedem Ort des Spielfeldes zusammenbauen, aber manche Orte sind einfacher zu erreichen als andere. Wenn ein Molekül zusammengebaut wurde, erreichen Sie die nächste Ebene.

source: Game Rules, Strategies and Tips
de: Spielregeln, Spielstrategien und Tipps

source: Game Rules
de: Spielregeln

source: Game pieces can only move in one direction at a time.
de: Spielsteine können bei jedem Zug nur in eine Richtung bewegt werden.

source: Once an atom begins moving it will not stop until it meets either a wall or another piece.
de: Sobald ein Atom sich bewegt, stoppt es erst, wenn es an eine Wand oder ein anderes Atom stößt.

source: The only way to progress to the next game level is to complete a current one. Once a player completes a certain level the game automatically switches to the next one, thus 'uncovering it'.
de: Um zur nächsten Ebene zu gelangen, müssen Sie zuerst die aktuelle abschließen. Sobald ein Spieler eine bestimmte Ebene abschließt, wird die nächste automatisch freigegeben und geöffnet.

source: A player can only switch between the levels which have been uncovered.
de: Ein Spieler kann nur zwischen bereits freigegebenen Ebenen wechseln.

source: The game progress is automatically saved every time an adjacent level is reached, and will be reloaded the next time application is started.
de: Der Spielverlauf wird bei Erreichen einer anschließenden Ebene automatisch gesichert und beim nächsten Spielstart wieder geladen.

source: Strategies and Tips
de: Spielstrategien und Tipps

source: Always review the complete molecule using the reference screen before making any moves.
de: Überprüfen Sie vor jedem Spielzug das fertige Molekül über das Vorschaubild.

source: Next, study the play field and plan your moves. Remember, once a piece is moved it may not be possible to return it into the starting position.
de: Prüfen Sie als nächstes das Spielfeld und planen Sie Ihre Züge. Bedenken Sie, dass es nicht immer möglich ist, ein einmal bewegtes Atom in die Startposition zurück zu bringen.

source: Think through your every move and try to visualize the trajectory piece will follow once a directional arrow is clicked.
de: Überlegen Sie sich jeden Zug und versuchen Sie, sich den Verlauf vorzustellen, den das Atom nimmt, wenn Sie auf einen der Richtungspfeile klicken.

source: When using the keyboard to move pieces make sure that the desired piece is selected. If a wrong atom is marked as selected, use the &Tab; key to switch between the pieces until you reach a desired one.
de: Wenn Sie die Tastatur zum Bewegen der Atome verwenden, stellen Sie vorher sicher, dass das richtige Atom ausgewählt ist. Sie können die &Tab;-Taste benutzen, um die Auswahl der Atome zu wechseln.

source: Interface Overview
de: Die Benutzeroberfläche

source: Menu Items
de: Menüeinträge

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>O</keycap></keycombo> </shortcut> <guimenu>Game</guimenu> <guimenuitem>Load...</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>O</keycap></keycombo> </shortcut> <guimenu>Spiel</guimenu> <guimenuitem>Laden ...</guimenuitem>

source: Loads a previously saved game.
de: Lädt ein vorher gespeichertes Spiel.

source: <shortcut><keycap>F5</keycap></shortcut> <guimenu>Game</guimenu> <guimenuitem>Restart Game</guimenuitem>
de: <shortcut><keycap>F5</keycap></shortcut> <guimenu>Spiel</guimenu> <guimenuitem>Spiel neu starten</guimenuitem>

source: This will restart the current level.
de: Startet die aktuelle Ebene neu.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>S</keycap></keycombo> </shortcut> <guimenu>Game</guimenu> <guimenuitem>Save</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>S</keycap></keycombo> </shortcut> <guimenu>Spiel</guimenu> <guimenuitem>Speichern</guimenuitem>

source: Saves the current state of the game to the disk.
de: Speichert den aktuellen Spielstand auf die Festplatte.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>P</keycap></keycombo> </shortcut> <guimenu>Game</guimenu> <guimenuitem>Previous Level</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>P</keycap></keycombo> </shortcut> <guimenu>Spiel</guimenu> <guimenuitem>Vorherige Ebene</guimenuitem>

source: Change to the previous game level
de: Wechselt zur vorherigen Ebene

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo> </shortcut> <guimenu>Game</guimenu> <guimenuitem>Next Level</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo> </shortcut> <guimenu>Spiel</guimenu> <guimenuitem>Nächste Ebene</guimenuitem>

source: Change to the next game level
de: Wechselt zur nächsten Ebene

source: <guimenu>Game</guimenu> <guimenuitem>Choose level set ...</guimenuitem>
de: <guimenu>Spiel</guimenu> <guimenuitem>Spielpaket auswählen ...</guimenuitem>

source: This will show all available level sets and allows you to download additional sets uploaded by other users from the internet.
de: Zeigt alle verfügbaren Spielpakete und ermöglicht es, zusätzliche Pakete herunterzuladen, die von anderen Benutzern im Internet zur Verfügung gestellt werden.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo> </shortcut> <guimenu>Game</guimenu> <guimenuitem>Quit</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo> </shortcut> <guimenu>Spiel</guimenu> <guimenuitem>Beenden</guimenuitem>

source: Selecting this item will end your current game, and exit &katomic;.
de: Das Spiel wird beendet und &katomic; verlassen.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Z</keycap> </keycombo> </shortcut> <guimenu>Move</guimenu> <guimenuitem>Undo</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>Z</keycap></keycombo> </shortcut> <guimenu>Zug</guimenu> <guimenuitem>Zurücknehmen</guimenuitem>

source: Undo the last move you made.
de: Nimmt den zuletzt ausgeführten Zug wieder zurück.

source: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>Z</keycap></keycombo> </shortcut> <guimenu>Move</guimenu> <guimenuitem>Redo</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;&Shift;<keycap>Z</keycap></keycombo> </shortcut> <guimenu>Zug</guimenu> <guimenuitem>Wiederherstellen</guimenuitem>

source: If you have previously undone a move, you can redo it here.
de: Wenn Sie vorher einen Zug zurückgenommen haben, können Sie den Zug hiermit wiederherstellen.

source: <guimenu>Move</guimenu> <guimenuitem>Undo All</guimenuitem>
de: <guimenu>Zug</guimenu> <guimenuitem>Alles zurücknehmen</guimenuitem>

source: <action>Undo</action> all moves you made.
de: <action>Nimmt</action> alle ausgeführten Züge wieder zurück.

source: <guimenu>Move</guimenu> <guimenuitem>Redo All</guimenuitem>
de: <guimenu>Zug</guimenu> <guimenuitem>Alles wiederherstellen</guimenuitem>

source: <action>Redo</action> all undone moves.
de: <action>Stellt</action> alle zurückgenommenen Züge wieder her.

source: <guimenu>Settings</guimenu><guisubmenu>Animation Speed </guisubmenu>
de: <guimenu>Einstellungen</guimenu><guisubmenu>Animationsgeschwindigkeit</guisubmenu>

source: Set the animation speed to <guimenuitem>Slow</guimenuitem>, <guimenuitem>Normal</guimenuitem> or <guimenuitem>Fast</guimenuitem>.
de: Stellen Sie hier die Animationsgeschwindigkeit auf <guimenuitem>Langsam</guimenuitem>, <guimenuitem>Normal</guimenuitem> oder <guimenuitem>Schnell</guimenuitem> ein.

source: Additionally &katomic; has the common &kde; <guimenu>Settings</guimenu> and <guimenu>Help</guimenu> menu items, for more information read the sections about the <ulink url="help:/fundamentals/ui.html#menus-settings">Settings Menu</ulink> and <ulink url="help:/fundamentals/ui.html#menus-help">Help Menu</ulink> of the &kde; Fundamentals.
de: Zusätzlich hat &katomic; die bekannten &kde;-Einträge im Menü <guimenu>Einstellungen</guimenu> und <guimenu>Hilfe</guimenu>, weitere Informationen dazu finden Sie in den Abschnitten über die Menüs <ulink url="help:/fundamentals/ui.html#menus-settings">Einstellungen</ulink> und <ulink url="help:/fundamentals/uihtml#menus-help">Hilfe</ulink> der &kde;-Grundlagen.

source: Default Keybindings
de: Standard-Tastenkürzel

source: Default shortcuts are:
de: Folgende Tastenkürzel sind als Standard eingestellt:

source: Shortcuts
de: Kurzbefehle

source: Load
de: Laden

source: Restart Game
de: Spiel neu starten

source: Save
de: Speichern

source: Previous Level
de: Vorige Ebene

source: Next Level
de: Nächste Ebene

source: Quit
de: Beenden

source: Undo
de: Zurücknehmen

source: Redo
de: Wiederherstellen

source: Atom Down
de: Atom abwärts

source: Down Arrow
de: Pfeil runter

source: Atom Left
de: Atom nach links

source: Left Arrow
de: Pfeil links

source: Atom Right
de: Atom nach rechts

source: Right Arrow
de: Pfeil rechts

source: Atom Up
de: Atom aufwärts

source: Up Arrow
de: Pfeil hoch

source: Next Atom
de: Nächstes Atom

source: Previous Atom
de: Vorheriges Atom

source: Help
de: Hilfe

source: What's this?
de: Was ist das?

source: Frequently asked questions
de: Häufig gestellte Fragen

source: How do I know what the molecule looks like?
de: Woher weiß ich, wie das Molekül aussehen muss?

source: You can view the molecule on the reference screen located in the top right corner of the game screen.
de: Sie sehen das fertige Molekül im Vorschaubild in der rechten oberen Ecke des Fensters.

source: How do I move a game piece (atom)?
de: Wie bewege ich ein Atom?

source: To move a game piece (atom) use your mouse cursor to click on it. At this time the available directional icon will become visible. Click on the corresponding directional icon to make a game piece move into the desired direction. Alternatively, you can use your keyboard to move the pieces. Use the &Tab; key to switch between the items, and the cursor keys to move them once selected.
de: Klicken Sie mit Ihrem Mauszeiger auf einen Spielstein (Atom) , um ihn zu bewegen. Die möglichen Richtungen werden durch Pfeile sichtbar. Klicken Sie auf einen Pfeil, um das Atom in die gewünschte Richtung zu bewegen. Alternativ können Sie die Tastatur verwenden. Verwenden Sie die &Tab;-Taste, um zwischen den Spielsteinen zu wechseln und die Pfeiltasten, um den ausgewählten Spielstein zu verschieben.

source: Can I use the keyboard to control the pieces (atoms)?
de: Kann ich die Atome mit der Tastatur bewegen?

source: Yes. Use &Tab; key to switch between the items, and he cursor keys to move them once selected.
de: Ja. Verwenden Sie die &Tab;-Taste, um zwischen den Atomen zu wechseln, und die Pfeiltasten, um das ausgewählte Atom zu bewegen.

source: When I move a piece (atom) it goes right past the place where I want it. How do I make it stop there?
de: Wenn ich ein Atom verschiebe, bewegt es sich an der gewünschten Stelle vorbei. Wie kann ich es dazu bringen, dort anzuhalten?

source: You don't. Once an atom begins moving, it will not stop until it meets either a wall or another piece.
de: Das ist nicht möglich. Ein Atom hört erst auf, sich in eine Richtung zu bewegen, wenn es auf eine Wand oder ein anderes Atom trifft.

source: I cannot beat the level. Is there a hint system, or a solver?
de: Ich kann die Ebene nicht bewältigen. Gibt es ein Hinweis-System oder eine automatische Lösung?

source: No. Unfortunately at this time &katomic; does not feature a hint system. So the only way to finish a level is to solve it on your own.
de: Nein. Unglücklicherweise stellt &katomic; zurzeit kein Hinweis-System zur Verfügung. Der einzige Weg, eine Ebene zu beenden, besteht darin, sie zu bewältigen.

source: Credits and License
de: Danksagungen und Lizenz

source: <application>Atomic Entertainment</application> Copyright 1999 &Stephan.Kulow; &Stephan.Kulow.mail; and Cristian Tibirna &Cristian.Tibirna.mail;.
de: <application>Atomic Entertainment</application> Copyright 1999 &Stephan.Kulow; &Stephan.Kulow.mail; und Cristian Tibirna &Cristian.Tibirna.mail;.

source: Atomic Copyright Andreas Wuest <email>Andreas Wuest@gmx.de</email>.
de: Copyright für Atomic: Andreas Wuest <email>AndreasWuest@gmx.de</email>

source: Documentation Copyright 2000 &Dirk.Doerflinger; <email>ddoerflinger@gmx.net</email>
de: Copyright 2000 für die Dokumentation: &Dirk.Doerflinger; <email>ddoerflinger@gmx.net</email>

source: Proofreading by Michael McBride &Mike.McBride.mail;
de: Korrektur gelesen von Michael McBride &Mike.McBride.mail;

source: CREDIT_FOR_TRANSLATORS
de: <para>Deutsche Übersetzung von Matthias Kiefer <email>kiefer@kde.org</email> und Maren Pakura <email>maren@kde.org</email></para>

source: Compilation and Installation
de: Kompilierung und Installation
