Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdegames/kblackbox.po
Languages: de

source: The &kblackbox; Handbook
de: Das Handbuch zu &kblackbox;

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Maren</firstname><surname>Pakura</surname><affiliation><address><email>maren@kde.org</email></address></affiliation><contrib>Deutsche Übersetzung</contrib></othercredit>

source: This documentation describes the game of &kblackbox; version &kappversion;
de: Dieses Handbuch beschreibt das Spiel &kblackbox; in der Version &kappversion;

source: game
de: Spiel

source: puzzle
de: Rätsel

source: board
de: Brettspiel

source: balls
de: Bälle

source: beams
de: strahlen

source: one player
de: ein Spieler

source: hidden balls
de: versteckte Bälle

source: find
de: finden

source: search
de: suchen

source: Introduction
de: Einführung

source: Gametype:
de: Spieltyp:

source: Puzzle, Board
de: Rätsel, Brettspiel

source: Number of possible players:
de: Anzahl der Spieler:

source: <para>One</para>
de: <para>Einer</para>

source: &kblackbox; is a nice logical game, inspired by the <application>emacs</application> blackbox game. A major part of this help file is based on the original <application>emacs</application> help.
de: &kblackbox; ist ein Logik-Spiel, angeregt durch das <application>Emacs</application>-Spiel Blackbox. Ein Großteil des Handbuchs basiert auf der ursprünglichen <application>Emacs</application>-Hilfe.

source: &kblackbox; is a game of hide and seek played on a grid of boxes. The computer has hidden several balls within this box. By shooting beams into the box and observing where they emerge it is possible to deduce the positions of the hidden balls.
de: &kblackbox; ist ein Versteckspiel, das auf einem Spielfeld gespielt wird, auf dem Schachteln in Reihen und Spalten angeordnet sind. Der Gegner (in diesem Fall der Zufallsgenerator) hat Kugeln in diesen Schachteln versteckt. Um die Kugeln zu entdecken, müssen Sie Laserstrahlen in die Schachteln schießen und den Verlauf der Strahlen beobachten.

source: The fewer beams you use and the quicker you are to find the balls, the better (the lower) your score.
de: Je weniger Laserstrahlen Sie dafür benötigen, um so besser (geringer) ist Ihre Punktzahl.

source: How to Play
de: Spielanleitung

source: Objective:
de: Ziel des Spiels:

source: Use laser beams to deduce the placement of the balls inside the black box.
de: Finden Sie die verstecken Bälle im Spielfeld, indem Sie Laserstrahlen abfeuern.

source: Use lasers and place balls and markers on the game board to deduce the position of the hidden balls inside the black box.
de: Benutzen Sie die Laser und setzen Sie Bälle und Markierungen auf dem Spielfeld, um die Position der versteckten Bälle im Spiel zu finden.

source: The game starts as soon as you use the first laser. Before that, the time is not running and no point will be count for the score.
de: Das Spiel beginnt, sobald Sie den ersten Laser benutzen. Vorher werden weder die Zeit noch Punkte gezählt.

source: The cursor can be moved around the box with the standard cursor movement keys or the mouse. Switching of lasers or marking of black boxes is done with the &LMB;, or by pressing the <keycap>Return</keycap> or &Enter; key.
de: Der Mauszeiger kann in der Box mit den Pfeiltasten oder der Maus bewegt werden. Die Laser können mit der &LMBn; oder der &Enter;-Taste eingeschaltet werden; ebenso können die Kugeln markiert werden.

source: You can also drag and drop the balls and the markers with the mouse.
de: Mit der Maus können Sie ebenfalls Bälle verschieben und Markierungen setzen.

source: You can mark the fields where you think a ball cannot be, too. Just press the &RMB;. It often helps you to find an area where a ball could possibly be. To clear any marks, press the same key or mouse button again.
de: Sie können auch die Felder markieren, in denen Sie keine Kugel vermuten. Drücken Sie einfach die &RMB;. Das hilft Ihnen oft ein Gebiet zu finden, in dem möglicherweise eine Kugel liegt. Um beliebige Markierungen zu löschen, drücken Sie noch einmal die gleiche Taste.

source: When you think the configuration of balls you have placed is correct, press the <guibutton>Done!</guibutton> button. You will be informed whether you are correct or not, and be given your score.
de: Wenn Sie glauben, dass die Anordnung der Bälle korrekt ist, klicken Sie auf <guibutton>Fertig!</guibutton>. Sie werden informiert, ob Sie richtig lagen und erhalten Ihre Punkte.

source: If you placed any balls incorrectly, the right solution will be displayed.
de: Wenn Sie Bälle falsch platziert hatten, wird die richtige Lösung angezeigt.

source: The score increases with the time (1 point per second) and with the use of lasers: 3 points if the laser beam hits a ball or exits at the entry point and 9 points if it exists at another entry point. If you make a mistake, the score is set at the end of the game to 999, which is the maximum score.
de: Die Punktzahl steigt mit der Zeit (1 Punkt pro Sekunde) und Benutzung der Laser. Sie erhalten 3 Punkte, wenn der Laserstrahl einen Ball trifft oder am Eingangspunkt wieder austritt, und 9 Punkte, wenn er an einem anderen Eingangspunkt austritt. Wenn Sie einen Fehler machen, wird der Punktestand am Ende des Spiels auf 999 gesetzt. Das ist der höchstmögliche Punktestand.

source: Game Rules, Strategies and Tips
de: Spielregeln, Spielstrategien und Tipps

source: Game Rules
de: Spielregeln

source: You have to find balls hidden in the black box. Your means are limited - you can just fire lasers which are around the box. There are three possible outcomes for each beam you send into the box:
de: Sie müssen alle im Spielfeld versteckten Kugeln finden. Ihre Mittel sind begrenzt - Sie können nur die Laser um die Box herum abfeuern. Es gibt drei mögliche Ergebnisse für jeden Laserstrahl, den Sie in die Blackbox schicken:

source: Detour
de: Ablenkung

source: The beam is deflected and emerges somewhere other than where you sent it in. On the playfield, detours are denoted by matching pairs of numbers - one where the beam went in, and the other where it came out.
de: Der Strahl wird abgelenkt und tritt an einer anderen Stelle aus, als er reingeschickt wurde. Die Ablenkung wird auf dem Spielfeld durch zusammengehörige Zahlenpaare angezeigt - eine am Eintrittspunkt des Strahls, die andere am Austrittspunkt.

source: Reflection
de: Reflexion

source: The beam is reflected and emerges in the same place it was sent in. On the playfield, reflections are denoted by a special sign.
de: Der Laserstrahl wird gespiegelt und tritt an der gleichen Stelle aus an der er eingetreten ist. Im Spielfeld werden Reflexionen durch ein entsprechendes Symbol gekennzeichnet.

source: <term>Hit</term>
de: <term>Treffer</term>

source: The beam strikes a ball and is absorbed. It does not emerge from the box. On the playfield, hits are denoted by a special sign.
de: Der Laserstrahl trifft die Kugel direkt und wird absorbiert. Er tritt nicht aus der Blackbox aus. Auf dem Spielfeld wird ein Treffer durch entsprechendes Symbol gekennzeichnet.

source: The rules for how balls deflect beams are simple and are best shown by example.
de: Die Regeln für die Ablenkung der Laserstrahlen an den Kugeln lässt sich am besten am Beispiel erklären.

source: As a beam approaches a ball it is deflected ninety degrees. Beams can be deflected multiple times. In the diagrams below, the dashes represent empty box locations and the letter <guilabel>O</guilabel> represents a ball. The entrance and exit points of each beam are marked with numbers as described under <link linkend="detour">Detour</link> above. Note that the entrance and exit points are always interchangeable. <guilabel>*</guilabel> denotes the path taken by the beam.
de: Wenn ein Laserstrahl eine Kugel erreicht, wird er um 90 Grad abgelenkt. Strahlen können beliebig oft abgelenkt werden. Im folgenden Diagramm stellen die Trennstriche leere Felder dar, der Buchstabe <guilabel>O</guilabel> steht für eine Kugel. Der Ein- und Austrittspunkt eines jeden Laserstrahls ist durch Nummern gekennzeichnet, wie unter <link linkend="detour">Ablenkung</link> beschrieben. Beachten Sie, dass Ein- und Austrittspunkt eines Laserstrahls immer austauschbar sind. <guilabel>*</guilabel> zeigt den Weg an, den der Strahl geht.

source: Note carefully the relative positions of the ball and the ninety degree deflection it causes.
de: Beachten Sie die relative Position der Kugel und die 90-Grad-Ablenkung, die sie verursacht.

source: As mentioned above, a reflection occurs when a beam emerges from the same point it was sent in. This can happen in several ways:
de: Wie bereits erwähnt, tritt eine Reflexion genau dann auf, wenn der Laserstrahl dort austritt, wo er eingetreten ist. Das kann auf verschiedene Weise geschehen:

source: In the first example, the beam is deflected downwards by the upper ball, then left by the lower ball, and finally retraces its path to its point of origin. The second example is similar. The third example is a bit anomalous but can be rationalized by realizing the beam never gets a chance to get into the box. Alternatively, the beam can be thought of as being deflected downwards and immediately emerging from the box.
de: Im ersten Beispiel wurde der Laserstrahl von der oberen Kugel nach unten abgelenkt, dann nach links durch die untere Kugel und nimmt so den ursprünglichen Weg wieder auf. Das zweite Beispiel ist ähnlich. Das dritte Beispiel ist ein wenig ungewöhnlich, aber es kann verstanden werden, wenn Sie erkennen, dass der Laserstrahl nie die Gelegenheit hat in die Blackbox zu gelangen. Anderenfalls könnte der Laserstrahl auch in die Blackbox eintreten und sofort wieder austreten, da er nach unten abgelenkt wurde.

source: A hit occurs when a beam runs straight into a ball:
de: Sie haben getroffen, wenn ein Laserstrahl direkt auf eine Kugel stößt:

source: Be sure to compare the second example of a hit with the first example of a reflection.
de: Vergleichen Sie das zweite Beispiel des Treffers mit dem ersten Beispiel der Reflexion.

source: Interface Overview
de: Die Benutzeroberfläche

source: Game Board Description
de: Spielfeldbeschreibung

source: <screeninfo>&kblackbox; Game Board</screeninfo>
de: <screeninfo>&kblackbox; Spielfeld</screeninfo>

source: <phrase>&kblackbox; Game Board</phrase>
de: <phrase>&kblackbox; Spielfeld</phrase>

source: The following types of field are found on the game board:
de: Es gibt die folgenden Bereiche auf dem Spielfeld:

source: The big black box in the middle
de: Der schwarze Kasten in der Mitte

source: Here you must mark the positions you think a ball is in.
de: Sie müssen die Felder markieren, in denen Sie Kugeln vermuten.

source: Lasers around the box
de: Die Laser um den Kasten

source: The lasers are shooting beams of light when switched on. Then, they disappear and are replaced by an information about the interactions of the laser beam with the balls in the black box.
de: Eingeschaltete Laser schießen Lichtstrahlen, nach deren Verschwinden Informationen zu dem Wechselspiel von Laserstrahl und Bällen in der Blackbox erscheinen.

source: Balls
de: Bälle

source: <quote>There must be one there!</quote> you think. These mark where you suspect a ball is placed in the black box.
de: <quote>Da liegt eine!</quote> - denken Sie. Diese Marke zeigt an, wo Sie eine Kugel in der Blackbox vermuten.

source: At the end of the game, the right and wrong positions of the balls are also marked with "balls".
de: Bei Spielende werden die richtigen und falschen Positionen der Bälle auch als <quote>Bälle</quote> markiert.

source: Markers for "free position"
de: Markierungen für „freie Position“

source: You can use them to mark some positions where you are sure there is no ball.
de: Auf den Positionen, auf denen Sie keine Bälle vermuten, können Sie diese Markierung verwenden.

source: Menu Items
de: Menüeinträge

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo> </shortcut> <guimenu>Game</guimenu> <guimenuitem>New</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo> </shortcut> <guimenu>Spiel</guimenu> <guimenuitem>Neu</guimenuitem>

source: Starts a new game (and abandons the current, if any.)
de: Startet ein neues Spiel (und beendet ein bereits laufendes Spiel).

source: <shortcut><keycap>P</keycap></shortcut> <guimenu>Game</guimenu> <guimenuitem>Pause</guimenuitem>
de: <shortcut> <keycap>P</keycap></shortcut> <guimenu>Spiel</guimenu> <guimenuitem>Pause</guimenuitem>

source: Pause or continue the current game.
de: Hält ein laufendes Spiel an oder startet es wieder.

source: Note that the interaction results are hidden in a paused game.
de: Beachten Sie, dass die Ergebnisse von Wechselwirkungen bei einem pausierten Spiel versteckt werden.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>H</keycap></keycombo> </shortcut> <guimenu>Game</guimenu> <guimenuitem>Show High Scores</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>H</keycap></keycombo> </shortcut> <guimenu>Spiel</guimenu> <guimenuitem>Bestenliste anzeigen</guimenuitem>

source: Show the high score tables.
de: Zeigt den Dialog mit der Bestenliste.

source: <guimenu>Game</guimenu> <guimenuitem>Start Tutorial</guimenuitem>
de: <guimenu>Spiel</guimenu> <guimenuitem>Einführung beginnen</guimenuitem>

source: Start the tutorial of the game. This is a user friendly way to learn the game rules.
de: Startet ein Einführungsspiel. Dies ist der beste Weg, die Spielregeln zu lernen.

source: <guimenu>Game</guimenu> <guimenuitem>New Sandbox Game</guimenuitem>
de: <guimenu>Spiel</guimenu> <guimenuitem>Neues Sandkasten-Spiel</guimenuitem>

source: In this mode, the solution is displayed at the start of the game. This is useful to understand the game principles.
de: In diesem Modus wird die Lösung zu Beginn des Spiels angezeigt, um das Verständnis des Spielprinzips zu erleichtern.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo> </shortcut> <guimenu>Game</guimenu> <guimenuitem>Quit</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo> </shortcut> <guimenu>Spiel</guimenu> <guimenuitem>Beenden</guimenuitem>

source: This closes the window and quits &kblackbox;.
de: Schließt das Fenster und beendet &kblackbox;.

source: <guimenu>Move</guimenu> <guimenuitem>Solve</guimenuitem>
de: <guimenu>Zug</guimenu> <guimenuitem>Lösen</guimenuitem>

source: Use it to give up a game. It shows you the solution: the right positions of the balls.
de: Sie geben damit das Spiel auf. Die Lösung - die richtige Position der Bälle - wird dann angezeigt.

source: <guimenu>Move</guimenu> <guimenuitem>Done!</guimenuitem>
de: <guimenu>Zug</guimenu> <guimenuitem>Fertig!</guimenuitem>

source: When you placed all the balls, choose "Done!" to terminate the current game, to compute the final score and to display the real positions of the balls.
de: Wenn Sie alle Bälle gesetzt haben, drücken Sie <quote>Fertig!</quote> um das aktuelle Spiel zu beenden, den erreichten Punktestand zu errechnen und die richtigen Positionen der Bälle anzuzeigen.

source: <guimenu>Settings</guimenu><guisubmenu>Difficulty</guisubmenu>
de: <guimenu>Einstellungen</guimenu> <guisubmenu>Schwierigkeit</guisubmenu>

source: Select the game difficulty. Harder games have more balls and bigger black box than easier games. You can also play with a custom difficulty level that you can set up in the setting dialog of &kblackbox;.
de: Wählt die Schwierigkeitsstufe des Spiels aus. Schwierigere Spiele enthalten mehr Bälle und eine größere Blackbox. Im Einstellungs-Menü von &kblackbox; können Sie die Schwierigkeitsstufe auch individuell anpassen.

source: Note: games with 4 balls or less can always be solved with certainty! That is not the case for games with 5 balls or more.
de: Beachten Sie: Spiele mit 4 oder weniger Bällen sind mit Sicherheit lösbar, im Gegensatz zu Spielen mit 5 oder mehr Bällen.

source: Additionally &kblackbox; has the common &kde; <guimenu>Settings</guimenu> and <guimenu>Help</guimenu> menu items, for more information read the sections about the <ulink url="help:/fundamentals/ui.html#menus-settings">Settings Menu</ulink> and <ulink url="help:/fundamentals/ui.html#menus-help">Help Menu</ulink> of the &kde; Fundamentals.
de: Zusätzlich hat &kblackbox; die bekannten &kde;-Einträge im Menü <guimenu>Einstellungen</guimenu> und <guimenu>Hilfe</guimenu>, weitere Informationen dazu finden Sie in den Abschnitten über die Menüs <ulink url="help:/fundamentals/ui.html#menus-settings">Einstellungen</ulink> und <ulink url="help:/fundamentals/uihtml#menus-help">Hilfe</ulink> der &kde;-Grundlagen.

source: Frequently asked questions
de: Häufig gestellte Fragen

source: Can I use the keyboard to play this game?
de: Kann ich mit der Tastatur spielen?

source: Yes. You can use the directional keys to control the cursor, &Enter; to place and remove balls, and <keycap>Spacebar</keycap> to place 'empty' marks.
de: Ja. Mit den Pfeiltasten können Sie den Cursor steuern, mit der &Enter;-Taste Bälle hinzufügen oder entfernen, und mit der <keycap>Leertaste</keycap> können Sie leere Felder markieren.

source: I have to quit the game now, but I am not finished yet. Can I save my progress?
de: Ich muss das Spiel unterbrechen, kann ich den aktuellen Spielstand speichern?

source: &kblackbox; has no save feature at the moment.
de: Nein, in &kblackbox; kann der aktuelle Spielstand zurzeit noch nicht gespeichert werden.

source: Credits and License
de: Danksagungen und Lizenz

source: Program copyright 1999-2000 &Robert.Cimrman; &Robert.Cimrman.mail; and 2007 &Nicolas.Roffet; &Nicolas.Roffet.mail;
de: Programm Copyright 1999-2000 &Robert.Cimrman; &Robert.Cimrman.mail; und 2007 &Nicolas.Roffet; &Nicolas.Roffet.mail;

source: Documentation copyright by &Robert.Cimrman;. Updated and converted to Docbook for &kde; 2.0 by &Lauri.Watts; &Lauri.Watts.mail;. Reviewed by &Philip.Rodrigues; &Philip.Rodrigues.mail;
de: Diese Dokumentation wurde von &Robert.Cimrman; geschrieben. &Lauri.Watts; &Lauri.Watts.mail; hat sie aktualisiert und für &kde; 2.0 in Docbock konvertiert. Überarbeitet von &Philip.Rodrigues; &Philip.Rodrigues.mail;

source: CREDIT_FOR_TRANSLATORS
de: <para>Deutsche Übersetzung von Maren Pakura<email>maren@kde.org</email></para>

source: Compilation and Installation
de: Kompilierung und Installation
