Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdegames/kbounce.po
Languages: de

source: The &kbounce; Handbook
de: Das Handbuch zu &kbounce;

source: Reviewer
de: Korrektur

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Maren</firstname><surname>Pakura</surname><affiliation><address><email>maren@kde.org</email></address></affiliation><contrib>Deutsche Übersetzung</contrib></othercredit>

source: This documentation describes the game of &kbounce; version &kappversion;
de: Dieses Handbuch beschreibt das Spiel &kbounce; in der Version &kappversion;

source: game
de: Spiel

source: puzzle
de: Rätsel

source: balls
de: Bälle

source: Introduction
de: Einführung

source: Gametype:
de: Spieltyp:

source: Puzzle, Arcade
de: Rätsel, Arcade

source: Number of possible players:
de: Anzahl der Spieler:

source: <para>One</para>
de: <para>Einer</para>

source: &kbounce; is a single player arcade game with the elements of puzzle.
de: &kbounce; ist ein Arcade- und Rätselspiel für einen Spieler.

source: It is played on a field, surrounded by walls, with two or more balls that move about in the field bouncing off of walls. The player can build new walls, decreasing the size of the active field.
de: &kbounce; wird auf einem von Wänden umgebenen Feld gespielt. Sie spielen mit zwei oder mehr Bällen, die an den Wänden abprallen. Sie können neue Wände bauen und damit die Größe des aktiven Spielfeldes einschränken.

source: The goal of the game is to fill at least 75&percnt; of the field and advance to the next level.
de: Ziel des Spiels ist es, mindestens 75 &percnt; des Spielfeldes auszufüllen und damit zur nächsten Ebene zu kommen.

source: How To Play
de: Spielregeln

source: The player is presented a rectangular tiled field surrounded by walls. Two or more balls move about in the field and bounce off of the walls. The object of the game is to limit the size of room for the balls.
de: Das Spielfeld besteht aus einem rechteckigen Gitter umgeben von Wänden. Zwei oder mehr Bälle fliegen durch das Feld und prallen von den Wänden ab. Ziel des Spiels ist es, den freien Raum für die Bälle zu begrenzen.

source: The size of the active area of the field is decreased by making new walls that enclose areas without balls in them. To complete a level, the player must decrease the size of the active field by at least 75&percnt; within the time allowed.
de: Die Größe des aktiven Bereiches wird durch das Ziehen neuer Wände verringert, sofern die so abgegrenzten Bereiche keine Bälle enthalten. Eine Ebene ist beendet, wenn es dem Spieler gelingt, die aktive Fläche in der zur Verfügung stehenden Zeit um mindestens 75&nbsp;% zu verringern.

source: New walls are built by clicking the &LMB; in an active area of the field, at which point two walls will begin to grow in opposite directions from the square the mouse was clicked in. Only one wall in each direction may be growing on the screen at any given time.
de: Neue Wände werden erzeugt, indem Sie mit der &LMBn; in den aktiven Bereich des Feldes klickt. Von dieser Stelle beginnen zwei Wände sich in entgegengesetzte Richtungen auszudehnen. Lediglich zwei Wände können sich zur gleichen Zeit ausdehnen.

source: When the mouse is on the field, the cursor is shown as a pair of arrows pointing in opposite directions, either horizontally or vertically. The arrows point in the direction the walls will grow when the &LMB; is clicked. This direction can be changed by clicking the &RMB;.
de: Wenn sich die Maus über dem Feld befindet, wechselt der Mauszeiger zu zwei entgegengesetzten Pfeilen, entweder horizontal oder vertikal. Die Pfeile zeigen die Richtungen an, in die sich die Wände ausdehnen, wenn Sie mit der &LMBn; klicken. Diese Richtung können Sie durch Klicken mit der &RMBn; ändern.

source: A new wall has a <quote>head</quote> which moves away from the point where the mouse was clicked. A wall is not permanent until this <quote>head</quote> runs into another wall. If a ball collides with any part of the wall except the head, before the head has run into another wall, the new wall will disappear completely and one life will be lost. If a ball collides with the head in the direction of the wall's growth, the wall will stop growing there, and become permanent, with no loss of life. If a ball collides with the head from any other side, the ball will bounce off and the wall will continue to grow normally.
de: Eine neue Wand hat einen <quote>Kopf</quote>, der sich immer weiter vom Startpunkt der Wand entfernt. Eine Wand ist erst dann dauerhaft, wenn der <quote>Kopf</quote> der Wand an einer anderen Wand angekommen ist. Falls vorher ein Ball mit dieser Wand kollidiert, verschwindet die Wand und ein Leben ist verloren. Wenn ein Ball den Kopf der Wand frontal trifft, dehnt sich die Wand nicht weiter aus und bleibt so, ohne Verlust eines Lebens, bestehen. Wenn ein Ball den Kopf aus irgend einer anderen Richtung trifft, prallt er ab und die Wand dehnt sich normal weiter aus.

source: Game Rules, Strategies and Tips
de: Spielregeln, Spielstrategien und Tipps

source: Game Rules
de: Spielregeln

source: The game starts with level 1 in which two balls move around in the field. The player has two lives and 90 seconds to successfully complete the level.
de: Das Spiel startet in der ersten Ebene mit zwei Bällen im Spielfeld. Der Spieler hat zwei Leben und 90 Sekunden Zeit, um die Ebene erfolgreich abzuschließen.

source: In n-th level there are n + 1 balls. The player is given n + 1 lives. They have 30 * ( n + 2 ) seconds to complete it.
de: In der n-ten Ebene gibt es n + 1 Bälle. Der Spieler hat n + 1 Leben und 30 * ( n + 2 ) Sekunden Zeit.

source: When a ball collides with a growing wall the player looses one life. An exception is the collision with wall's <quote>head</quote> when no life is lost.
de: Wenn ein Ball mit einer wachsenden Mauer zusammenstösst, verliert der Spieler ein Leben. Eine Ausnahme bildet der Zusammenstoß mit dem <quote>Kopf</quote> der Wand, dies kostet kein Leben.

source: The goal of each level is to cover at least 75&percnt; of the field with wall.
de: Ziel des Spiels ist es, in jeder Ebene mindestens 75 &percnt; des Spielfeldes zu besetzen.

source: The loss of all lives and exceeding the time allowed result in the end of the game.
de: Mit dem Verlust aller Leben und dem Ablauf der Spielzeit ist das Spiel beendet.

source: If a player completes a level he receives 15 points for each life left, and a bonus depending on the number of balls and the number of tiles filled above 75&percnt;. They also advance to the next level.
de: Wird eine Ebene erfolgreich abgeschlossen, erhält der Spieler 15 Punkte für jedes verbliebene Leben und einen Bonus, der aus der Anzahl der Bälle und der Anzahl der ausgefüllten Felder über 75 &percnt; berechnet wird. Das Spiel geht dann in der nächsten Ebene weiter.

source: Strategies and Tips
de: Spielstrategien und Tipps

source: Many players find the game becomes quite difficult by only the third or fourth level, given the number of balls on the field at once.
de: Für die meisten Spieler wird das Spiel auf der dritten oder vierten Ebene aufgrund der vielen Bälle bereits sehr schwer.

source: The trick playing &kbounce; successfully is to build <quote>corridors</quote>. To build a corridor, start a pair of walls growing close to another wall, and time it so that one of the walls will be hit by a ball and one of the walls will not, and thus become permanent.
de: Um &kbounce; erfolgreich zu spielen, sollten Sie <quote>Korridore</quote> bilden. Um einen Korridor zu bilden, lassen Sie eine Wand in der Nähe einer anderen Wand beginnen und sorgen dafür, dass nur eine der Wände von einem Ball getroffen und die andere somit dauerhaft wird.

source: <screeninfo>Building a corridor</screeninfo>
de: <screeninfo>Einen Korridor bilden</screeninfo>

source: <phrase>Building a corridor</phrase>
de: <phrase>Einen Korridor bilden</phrase>

source: This will leave a narrow corridor only a few squares high on the field, surrounded on three sides by walls. Wait for the balls to bounce into the open end of the corridor, and close the corridor behind the ball with a new wall. Although you will most likely lose a life for each corridor created, you can trap several balls in a single corridor.
de: So entsteht ein lediglich einige Quadrate hoher, schmaler Korridor auf dem Spielfeld, der an drei Seiten von Wänden umgeben ist. Sobald alle Bälle in den Korridor gesprungen sind, schließen Sie die offene Seite des Korridors mit einer neuen Wand. Obwohl Sie bei jedem Korridor mit dem Verlust eines Lebens rechnen müssen, können Sie mehrere Bälle in einem einzigen Korridor einfangen.

source: <screeninfo>Capturing balls in a corridor</screeninfo>
de: <screeninfo>Bälle in einem Korridor einfangen</screeninfo>

source: <phrase>Capturing balls in a corridor</phrase>
de: <phrase>Bälle in einem Korridor einfangen</phrase>

source: A final tip &mdash; take your time! There is plenty of time, as shown in the <guilabel>Time</guilabel> display at the bottom of the screen. Rushing will just get you in trouble!
de: Ein letzter Tipp &mdash; Nehmen Sie sich Zeit. Wie Sie auf der Anzeige <guilabel>Zeit</guilabel> unten rechts sehen können, haben Sie viel Zeit. Unnötige Eile bringt Sie hier in Schwierigkeiten.

source: Interface Overview
de: Die Benutzeroberfläche

source: The Tool Bar
de: Die Werkzeugleiste

source: Toolbar
de: Werkzeugleiste

source: The toolbar provides buttons for the commonly used functions.
de: Die Werkzeugleiste ermöglicht einen schellen Zugriff auf die am häufigsten gebrauchten Funktionen.

source: Toolbar Buttons
de: Die Knöpfe in der Werkzeugleiste

source: Button
de: Knopf

source: Menu Equivalent
de: Menüeintrag

source: Action
de: Aktion

source: New Game Button
de: Knopf <quote>Neues Spiel</quote>

source: <guiicon>New</guiicon>
de: <guiicon>Neu</guiicon>

source: <guimenu>Game</guimenu> <guimenuitem>New</guimenuitem>
de: <guimenu>Spiel</guimenu> <guimenuitem>Neu</guimenuitem>

source: Starts a new game. If a game is currently played clears the field and sets the level to 1.
de: Startet ein neues Spiel. Im laufenden Spiel wird das Feld gelöscht und die Ebene auf 1 gesetzt.

source: Pause Button
de: Knopf Pause

source: <guimenu>Game</guimenu> <guimenuitem>Pause</guimenuitem>
de: <guimenu>Spiel</guimenu> <guimenuitem>Pause</guimenuitem>

source: Pauses or resumes the current game.
de: Hält das Spiel an oder setzt es fort.

source: The Menu Items
de: Die Menüeinträge

source: The <guimenu>Game</guimenu> Menu
de: Das Menü <guimenu>Spiel</guimenu>

source: <guimenu>Game</guimenu> Menu
de: Das Menü <guimenu>Spiel</guimenu>

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo> </shortcut> <guimenu>Game</guimenu> <guimenuitem>New</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo> </shortcut> <guimenu>Spiel</guimenu> <guimenuitem>Neu</guimenuitem>

source: Starts a new game.
de: Startet ein neues Spiel.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>End</keycap> </keycombo> </shortcut> <guimenu>Game</guimenu> <guimenuitem>End Game</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Ende</keycap> </keycombo> </shortcut> <guimenu>Spiel</guimenu> <guimenuitem>Spiel beenden</guimenuitem>

source: Ends the current game.
de: Beendet das aktuelle Spiel.

source: <shortcut> <keycap>P</keycap></shortcut> <guimenu>Game</guimenu> <guimenuitem>Pause</guimenuitem>
de: <shortcut> <keycap>P</keycap></shortcut> <guimenu>Spiel</guimenu> <guimenuitem>Pause</guimenuitem>

source: Pauses or resumes the game.
de: Hält das Spiel an oder setzt es fort.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>H</keycap></keycombo> </shortcut> <guimenu>Game</guimenu> <guimenuitem>Show High Scores</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>H</keycap></keycombo> </shortcut> <guimenu>Spiel</guimenu> <guimenuitem>Bestenliste anzeigen</guimenuitem>

source: Opens a dialog that displays different high score tables.
de: Öffnet einen Dialog mit der Anzeige der verschiedenen Bestenlisten.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo> </shortcut> <guimenu>Game</guimenu> <guimenuitem>Quit</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo> </shortcut> <guimenu>Spiel</guimenu> <guimenuitem>Beenden</guimenuitem>

source: <action>Quit</action> and close &kbounce;. If a game is currently played, it's status is lost.
de: <action>Beendet</action>das aktuelle Spiel und schließt &kbounce;. Der Spielstand eines laufenden Spiels wird nicht gespeichert.

source: The <guimenu>Settings</guimenu> Menu
de: Das Menü <guimenu>Einstellungen</guimenu>

source: Settings Menu
de: Das Menü Einstellungen

source: <guimenu>Settings</guimenu> <guimenuitem>Play Sounds</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>Geräusche abspielen</guimenuitem>

source: If checked, &kbounce; game sounds are played.
de: Falls markiert, werden die Geräusche zum Spiel &kbounce; abgespielt.

source: <guimenu>Settings</guimenu> <guisubmenu>Difficulty</guisubmenu>
de: <guimenu>Einstellungen</guimenu> <guisubmenu>Schwierigkeitsgrad</guisubmenu>

source: Select a game difficulty. On higher difficulty levels the walls are build slower while balls move faster. That makes it harder to fence an area in the board.
de: Wählen Sie einen Schwierigkeitsgrad für das Spiel. Bei größeren Schwierigkeitsgrad werden die Wände langsamer erzeugt, aber die Bälle bewegen sich schneller. Damit ist es schwieriger, einen Bereich auf dem Spielfeld einzugrenzen.

source: Additionally &kbounce; has the common &kde; <guimenu>Settings</guimenu> and <guimenu>Help</guimenu> menu items, for more information read the sections about the <ulink url="help:/fundamentals/ui.html#menus-settings">Settings Menu</ulink> and <ulink url="help:/fundamentals/ui.html#menus-help">Help Menu</ulink> of the &kde; Fundamentals.
de: Zusätzlich hat &kbounce; die bekannten &kde;-Einträge im Menü <guimenu>Einstellungen</guimenu> und <guimenu>Hilfe</guimenu>, weitere Informationen dazu finden Sie in den Abschnitten über die Menüs <ulink url="help:/fundamentals/ui.html#menus-settings">Einstellungen</ulink> und <ulink url="help:/fundamentals/uihtml#menus-help">Hilfe</ulink> der &kde;-Grundlagen.

source: Frequently asked questions
de: Häufig gestellte Fragen

source: I want to change the way this game looks. Can I?
de: Kann ich das Erscheinungsbild des Spiels ändern?

source: Yes. To change &kbounce; visual theme you can use <menuchoice><guimenu>Settings</guimenu><guimenuitem>Configure &kbounce;...</guimenuitem></menuchoice> option on the menubar.
de: Ja, um das Design für &kbounce; zu ändern, wählen Sie <menuchoice><guimenu>Einstellungen</guimenu><guimenuitem>&kbounce; einrichten ...</guimenuitem></menuchoice> in der Menüleiste.

source: I have made a mistake. Can I undo?
de: Ich habe einen Fehler gemacht. Kann ich einen Spielzug zurücknehmen?

source: &kbounce; does not have an <quote>Undo</quote> feature.
de: Nein, in &kbounce; können Sie keinen Zug zurücknehmen.

source: Can I use the keyboard to play this game?
de: Kann ich mit der Tastatur spielen?

source: No. &kbounce; cannot be played using keyboard.
de: Nein, &kbounce; kann nicht mit der Tastatur gespielt werden.

source: I have to quit the game now, but I am not finished yet. Can I save my progress?
de: Ich muss das Spiel unterbrechen, kann ich den aktuellen Spielstand speichern?

source: &kbounce; does not have a <quote>Save</quote> feature at the moment.
de: Nein, in &kbounce; kann der aktuelle Spielstand nicht gespeichert werden.

source: Game Configuration
de: Einstellungen für das Spiel

source: The &kbounce; configuration dialog allows you to select visual themes for &kbounce;.
de: Im Einrichtungsdialog von &kbounce; können Sie ein anderes Design für das Spiel auswählen.

source: To select a new theme simply choose the theme from the selection list. Each item in the list shows a small preview left to the theme name. A selection is immediately applied.
de: Um ein Design einzustellen, wählen Sie es aus der Auswahlliste. Für jeden Eintrag in der Liste wird eine kleine Vorschau links vom Namen des Designs angezeigt. Eine Auswahl wird sofort angewendet,

source: Once you are satisfied with the theme you have selected you can click the <guibutton>OK</guibutton> button, located at the bottom part of this dialog.
de: Um Ihre Auswahl zu übernehmen, klicken Sie auf den Knopf auf <guibutton>OK</guibutton>.

source: Credits and License
de: Danksagungen und Lizenz

source: Stefan Schimanski <email>schimmi@kde.org</email> - Original Author
de: Stefan Schimanski <email>schimmi@kde.org</email> - Ursprünglicher Autor

source: Sandro Sigala <email>ssigala@globalnet.it</email> - Highscore
de: Sandro Sigala <email>ssigala@globalnet.it</email> - Bestenliste

source: Benjamin Meyer <email>ben+kbounce@meyerhome.net</email> - Contributions
de: Benjamin Meyer <email>ben+kbounce@meyerhome.net</email> - Mitarbeit

source: Tomasz Boczkowski <email>tboczkowski@onet.pl</email> - Port to KDE4 and KGameCavas
de: Tomasz Boczkowski <email>tboczkowski@onet.pl</email> - Portierung nach KDE4 und KGameCavas

source: Documentation copyright 2002, &Aaron.J.Seigo; &Aaron.J.Seigo.mail;
de: Copyright der Dokumentation 2002 &Aaron.J.Seigo; &Aaron.J.Seigo.mail;

source: Documentation copyright 2007, Tomasz Boczkowski <email>tboczkowski@onet.pl</email>
de: Copyright der Dokumentation 2007, Tomasz Boczkowski <email>tboczkowski@onet.pl</email>

source: This handbook is dedicated to Dennis E. Powell.
de: Dieses Handbuch ist Dennis E. Powell gewidmet.

source: CREDIT_FOR_TRANSLATORS
de: <para>Deutsche Übersetzung von Maren Pakura <email>maren@kde.org</email></para>
