Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdegames/kbreakout.po
Languages: de

source: The &kbreakout; Handbook
de: Das Handbuch zu &kbreakout;

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"> <firstname>Ingo</firstname><surname>Malchow</surname> <affiliation><address><email>ingomalchow@googlemail.com</email></address></affiliation> <contrib>Deutsche Übersetzung</contrib> </othercredit>

source: &kappname;, a Breakout-like game.
de: &kappname;, ein Breakout-ähnliches Spiel.

source: game
de: Spiel

source: brick
de: Stein

source: bricks
de: Steine

source: Introduction
de: Einführung

source: &kappname; is a Breakout-like game.
de: &kappname; ist ein Breakout-ähnliches Spiel.

source: The object of the game is to destroy as many bricks as possible without losing the ball.
de: Das Ziel des Spieles ist es, so viele Steine wie möglich zu zerstören, ohne den Ball zu verlieren.

source: How to Play
de: Spielanleitung

source: The player is presented with a game field containing a number of bricks. A ball travels across the screen, bouncing off the top and side walls. When a brick is hit, the ball bounces away and the brick is destroyed. The player loses a life when the ball touches the bottom of the field. To prevent this from happening, the player has to use a movable bar to bounce the ball upward, situated at the bottom of the window. The purpose of the game is to progress through the levels destroying all bricks present in each, and trying to get a highscore.
de: Dem Spieler wird ein Spielfeld mit einer Anzahl an Steinen präsentiert. Ein Ball wandert über den Bildschirm, springt dabei aber von der oberen und den seitlichen Wänden ab. Wenn ein Stein getroffen wird, springt der Ball ab und der Stein ist zerstört. Der Spieler verliert ein Leben, wenn der Ball das untere Ende des Feldes berührt. Um das zu verhindern, muss der Spieler den Ball mithilfe einer beweglichen Leiste am unteren Rand zurückspringen lassen. Das Ziel des Spieles ist es, die Ebenen zu durchlaufen, indem alle Steine darin zerstört werden, und dabei noch einen hohen Punktestand zu erreichen.

source: Some bricks have a special behavior, or may let a gift fall down when hit. The gifts can be caught with the bar, their behavior can be either positive or negative. For further information on the different types of bricks and gifts see the next chapter.
de: Einige Steine haben ein spezielles Verhalten, oder es fällt ein Geschenk von ihnen herunter, sobald sie getroffen werden. Die Geschenke können mit der Leiste aufgefangen werden; ihr Verhalten kann entweder positiv oder negativ sein. Für weitere Informationen zu den verschiedenen Steinen und Geschenken lesen Sie das nächste Kapitel.

source: To fire the ball press the spacebar, to move the bar use the mouse or the arrow keys. The ball will bounce in the direction of the side of the bar it bounced on hit, the more it bounces near the left end of the bar the more it will bounce toward the left, the same applies for the right side; if it bounces in the middle of the bar it will bounce straight toward the top.
de: Um den Ball abzufeuern, drücken Sie die Leertaste; um die Leiste zu bewegen, benutzen Sie die Maus oder die Pfeiltasten. Der Ball springt in die Richtung der Seite der Leiste ab, an der sie getroffen wurde, und je mehr die Leiste auf der linken Seite getroffen wurde, desto mehr springt der Ball in Richtung links ab, das gleiche gilt für die rechte Seite; falls der Ball aber die Mitte der Leiste trifft, so springt er gerade nach oben ab.

source: Game Rules, Strategies and Tips
de: Spielregeln, Spielstrategien und Tipps

source: Rules
de: Spielregeln

source: Passing a level awards 300 points to the player. A level is passed when all breakable and visible bricks are destroyed, or alternatively if the next level gift is caught. In the latter case an additional score for each remaining brick is awarded.
de: Eine Spielebene zu vollenden bedeutet 300 Punkte für den Spieler. Eine Spielebene ist bestanden, wenn alle zerstörbaren oder sichtbaren Steine zerstört sind, oder aber falls das <quote>Nächste Spielebene</quote>-Geschenk gefangen wurde. Im letzten Fall werden zusätzliche Punkte für jeden übriggebliebenen Stein vergeben.

source: A score is awarded for every brick destroyed, the smaller the interval between one hit and the following the higher this score.
de: Es werden Punkte für jeden zerstörten Stein vergeben. Je kürzer die Zeit zwischen zwei verschiedenen Treffern, desto höher sind die Punkte.

source: This gifts hidden in a given level are fixed, their position however is random.
de: Diese Geschenke, versteckt in den einzelnen Spielebenen, sind fixiert;ihre Position aber ist zufällig.

source: 30 points are awarded for every gift caught.
de: 30 Punkte werden für jedes gefangene Geschenk vergeben.

source: The player loses a life when the ball touches the bottom of the field and there are no other balls left in the game, or when he catches a lose life gift. When losing a life 1000 points are detracted from his score.
de: Der Spieler verliert ein Leben, sobald der Ball das untere Ende des Feldes berührt und keine weiteren Bälle im Spiel sind, oder wenn er das <quote>Verliere ein Leben</quote>-Geschenk fängt. Beim Verlieren eines Lebens werden 1000 Punkte vom Punktestand abgezogen.

source: Additional lives can be gained by catching the add life gift.
de: Zusätzliche Leben können durch Fangen des <quote>Schenke Leben</quote>-Geschenkes erreicht werden.

source: The game ends when the player loses the ball while not having any additional lives left, or when all levels have been won.
de: Das Spiel endet, wenn der Spieler den Ball verliert und keine zusätzlichen Leben mehr hat oder wenn alle Spielebenen bestanden wurden.

source: Brick Types
de: Steinarten

source: Pictures for the bricks below are for the default theme of &kbreakout;.
de: Die Symbole für die folgenden Steine stammen aus dem Standarddesign von &kbreakout;.

source: Plain Brick
de: Gewöhnlicher Stein

source: Plain Bricks
de: Gewöhnlicher Stein

source: Simple bricks, while their appearance may vary they all behave the same way, they get destroyed when hit by the ball and may contain a gift.
de: Einfache Steine verhalten sich alle gleich, obwohl ihr Äußeres variieren kann.Sie werden bei einem Treffer mit dem Ball zerstört und können ein Geschenk enthalten.

source: <phrase>Unbreakable Brick</phrase>
de: <phrase>Unzerstörbarer Stein</phrase>

source: <term>Unbreakable Brick</term>
de: <term>Unzerstörbarer Stein</term>

source: Never gets destroyed unless hit by a burning or unstoppable ball, or an exploding brick next to it gets hit. These bricks do not need to be destroyed to win the level.
de: Wird niemals zerstört, außer durch einen brennenden oder nicht-aufhaltbaren Ball, oder aber durch einen explodierenden Stein direkt daneben. Diese Steine müssen nicht zerstört werden, um die Spielebene zu gewinnen.

source: <phrase>Breakable Brick</phrase>
de: <phrase><quote>Zerstörbarer Stein</quote>-Geschenk</phrase>

source: <term>Breakable Brick</term>
de: <term><quote>Zerstörbarer Stein</quote>-Geschenk</term>

source: Unbreakable bricks can be turned into breakable bricks using <link linkend="gift-magic-wand">Magic Wand gift</link>.
de: Mit dem <link linkend="gift-magic-wand"><quote>Zauberstab</quote>-Geschenk</link> können unzerstörbare Steine in zerstörbare Steine verwandelt werden.

source: <phrase>Hidden Brick</phrase>
de: <phrase>Versteckter Stein</phrase>

source: <term>Hidden Brick</term>
de: <term>Versteckter Stein</term>

source: This brick is not initially shown to the player. When hit for the fist time it becomes visible, and becomes a plain brick. If hit by a burning ball, or an exploding brick next to it gets hit it gets destroyed as soon as it appears. As long as it remains hidden it does not need to be destroyed to get to the next level.
de: Dieser Stein wird dem Spieler zunächst nicht gezeigt. Wenn er das erste Mal getroffen wird, wird er sichtbar und zu einem gewöhnlichen Stein. Falls er durch einen brennenden Ball oder einen explodierenden Stein daneben getroffen wird, wird er zerstört, sobald er erscheint. Solange dieser Stein unsichtbar ist, ist es nicht nötig, ihn zu zerstören, um die Spielebene zu bestehen.

source: <phrase>Multiple Brick</phrase>
de: <phrase>Mehrfach-Stein</phrase>

source: <term>Multiple Brick</term>
de: <term>Mehrfach-Stein</term>

source: Needs to be hit three times before getting destroyed, unless hit by a burning or unstoppable ball, or an exploding brick next to it gets destroyed.
de: Muss dreimal getroffen werden, bevor er zerstört wird - außer er wird durch einen brennenden Stein oder einen explodierenden Stein unmittelbar daneben getroffen.

source: <phrase>Exploding Brick</phrase>
de: <phrase>Explodierender Stein</phrase>

source: <term>Exploding Brick</term>
de: <term>Explodierender Stein</term>

source: When this brick gets hit also the bricks to the top, bottom, left and right of it will get destroyed, regardless of their type.
de: Wenn dieser Stein getroffen wird, werden außerdem auch die Steine über, unter, links und rechts von ihm zerstört, egal, von welchem Typ sie sind.

source: Gifts
de: Geschenke

source: Pictures for the gifts below are for the default theme of &kbreakout;.
de: Die Symbole für die folgenden Geschenke stammen aus dem Standarddesign von &kbreakout;.

source: Gift 1000 Points
de: <quote>100 Punkte</quote>-Geschenk

source: Score Gifts
de: <quote>Punkte</quote>-Geschenke

source: If caught they award the player the number of points written on the gift.
de: Wenn es gefangen wird, schenkt es dem Spieler die Anzahl Punkte, die darauf geschrieben sind.

source: <phrase>Add Life Gift</phrase>
de: <phrase><quote>Schenke Leben</quote>-Geschenk</phrase>

source: <term>Add Life Gift</term>
de: <term><quote>Schenke Leben</quote>-Geschenk</term>

source: Gives the player an additional life.
de: Gibt dem Spieler ein zusätzliches Leben.

source: <phrase>Lose Life Gift</phrase>
de: <phrase><quote>Verliere Leben</quote>-Geschenk</phrase>

source: <term>Lose Life Gift</term>
de: <term><quote>Verliere Leben</quote>-Geschenk</term>

source: Makes the player lose all balls and resets the bar.
de: Veranlasst, dass der Spieler alle Bälle verliert und die Leiste zurückgesetzt wird.

source: <phrase>Enlarge Bar Gift</phrase>
de: <phrase><quote>Vergrößere Leiste</quote>-Geschenk</phrase>

source: <term>Enlarge Bar Gift</term>
de: <term><quote>Vergrößere Leiste</quote>-Geschenk</term>

source: Enlarges the bar.
de: Vergrößert die Leiste.

source: <phrase>Shrink Bar Gift</phrase>
de: <phrase><quote>Verkleinere Leiste</quote>-Geschenk</phrase>

source: <term>Shrink Bar Gift</term>
de: <term><quote>Verkleinere Leiste</quote>-Geschenk</term>

source: Shrinks the bar.
de: Verkleinert die Leiste.

source: <phrase>Split Balls Gift</phrase>
de: <phrase><quote>Teile Bälle</quote>-Geschenk</phrase>

source: <term>Split Balls Gift</term>
de: <term><quote>Teile Bälle</quote>-Geschenk</term>

source: Doubles the balls.
de: Verdoppelt die Anzahl der Bälle.

source: <phrase>Add Balls Gift</phrase>
de: <phrase><quote>Füge Ball hinzu</quote>-Geschenk</phrase>

source: <term>Add Balls Gift</term>
de: <term><quote>Füge Ball hinzu</quote>-Geschenk</term>

source: Gives the player an extra ball attached to the bar, which can be fired whenever the player wants.
de: Verleiht dem Spieler einen Extra-Ball direkt auf der Leiste, der abgeschossen werden kann, wann immer der Spieler möchte.

source: <phrase>Sticky Bar Gift</phrase>
de: <phrase><quote>Klebrige Leiste</quote>-Geschenk</phrase>

source: <term>Sticky Bar Gift</term>
de: <term><quote>Klebrige Leiste</quote>-Geschenk</term>

source: After catching this gift, every time a ball touches the bar it remains attached to it, allowing the player to fire again.
de: Nachdem dieses Geschenk gefangen wird, verbleibt der Ball, sobald er die Leiste trifft, auf dieser, und erlaubt dem Spieler, ihn erneut abzuschießen.

source: <phrase>More Exploding Bricks Gift</phrase>
de: <phrase><quote>Mehr explodierende Steine</quote>-Geschenk</phrase>

source: <term>More Exploding Bricks Gift</term>
de: <term><quote>Mehr explodierende Steine</quote>-Geschenk</term>

source: Makes all bricks to the top, bottom, right, and left of exploding bricks exploding bricks themselves. This also applies to hidden and unbreakable bricks.
de: Macht aus allen Steinen oberhalb, unterhalb, links und rechts von explodierenden Steinen selbst explodierende Steine. Das betrifft auch unsichtbare und unzerstörbare Steine.

source: <phrase>Burning Ball Gift</phrase>
de: <phrase><quote>Brennender Ball</quote>-Geschenk</phrase>

source: <term>Burning Ball Gift</term>
de: <term><quote>Brennender Ball</quote>-Geschenk</term>

source: Transforms all the balls in burning balls. When a burning ball hits a brick also the bricks to the top, bottom, left and right of it get destroyed. A burning ball destroys all types of bricks regardless of their types.
de: Transformiert alle Bälle in brennende Bälle. Wenn ein brennender Ball einen Stein trifft, werden auch die Steine oberhalb, unterhalb, links und rechts von dem getroffenen Stein zerstört. Ein brennender Ball zerstört alle Steine unabhängig von ihrem Typ.

source: <phrase>Unstoppable Ball Gift</phrase>
de: <phrase><quote>Nicht aufhaltbarer Ball</quote>-Geschenk</phrase>

source: <term>Unstoppable Ball Gift</term>
de: <term><quote>Nicht aufhaltbarer Ball</quote>-Geschenk</term>

source: Transforms all the balls into unstoppable balls. An unstoppable ball destroys all bricks it encounters on it's path, regardless of their type, and never bouncing against them.
de: Macht aus allen Bällen nicht-aufhaltbare Bälle. Ein nicht-aufhaltbarer Ball zerstört alle Steine auf seiner Bahn - egal welchen Typs - und wird auch nicht von ihnen zurückgeworfen.

source: <phrase>Magic Eye Gift</phrase>
de: <phrase><quote>Magisches Auge</quote>-Geschenk</phrase>

source: <term>Magic Eye Gift</term>
de: <term><quote>Magisches Auge</quote>-Geschenk</term>

source: Shows all hidden bricks.
de: Zeigt alle versteckten Steine.

source: <phrase>Magic Wand Gift</phrase>
de: <phrase><quote>Zauberstab</quote>-Geschenk</phrase>

source: <term id="gift-magic-wand">Magic Wand Gift</term>
de: <term id="gift-magic-wand"><quote>Zauberstab</quote>-Geschenk</term>

source: Transforms all multiple and unbreakable bricks into simple bricks.
de: Macht aus allen Mehrfach- und unzerstörbaren Steinen einfache Steine.

source: <phrase>Increase Speed Gift</phrase>
de: <phrase><quote>Geschwindigkeit erhöhen</quote>-Geschenk</phrase>

source: <term>Increase Speed Gift</term>
de: <term><quote>Geschwindigkeit erhöhen</quote>-Geschenk</term>

source: Increases the speed of the ball by 30% of the current speed.
de: Erhöht die aktuelle Geschwindigkeit des Balls um 30 %.

source: <phrase>Decrease Speed Gift</phrase>
de: <phrase><quote>Geschwindigkeit verringern</quote>-Geschenk</phrase>

source: <term>Decrease Speed Gift</term>
de: <term><quote>Geschwindigkeit verringern</quote>-Geschenk</term>

source: Decreases the speed of the ball dividing the current speed by 1.3.
de: Verringert die aktuelle Geschwindigkeit um 30 %.

source: <phrase>Next Level Gift</phrase>
de: <phrase><quote>Nächste Ebene</quote>-Geschenk</phrase>

source: <term>Next Level Gift</term>
de: <term><quote>Nächste Ebene</quote>-Geschenk</term>

source: Opens the next level of the game immediately.
de: Öffnet sofort die nächste Ebene des Spiels.

source: Strategies and Tips
de: Spielstrategien und Tipps

source: If possible, it is usually a good idea to send the ball above the bricks, doing so you will have a smaller chance of losing the ball. Sometimes you need to first make a small hole in the layer of brick to accomplish this. The smaller the hole, the smaller the chance the balls comes back down.
de: Falls möglich, ist es normalerweise eine gute Idee, den Ball über die Steine zu schicken; das verringert die Chance eines Ballverlustes. Es kann manchmal sein, dass Sie dafür erst ein kleines Loch in die Steinebene machen müssen. Je kleiner das Loch, desto kleiner ist die Chance, dass der Ball wieder runterkommt.

source: When catching the add ball gift it is wise to not fire it right away but to keep in instead, in case the other balls are lost. It is also advisable to not catch a sticky bar gift in such a case, as doing so would force you to fire all balls.
de: Wenn sie das <quote>Füge Ball hinzu</quote>-Geschenk gefangen haben, ist es ratsam, diesen nicht sofort wieder abzuschießen, sondern ihn erst zu behalten, falls der andere Ball verloren geht. Außerdem ist es nicht ratsam in einem solchen Fall, das <quote>Klebrige Leiste</quote>-Geschenk zu fangen, da es Sie dazu bringen würde, alle Bälle gleichzeitig abfeuern zu müssen.

source: When receiving a next level gift you may not want to catch it if you know that there are add life gifts in the level.
de: Wenn das <quote>Nächste Spielebene</quote>-Geschenk erscheint, ist es nicht ratsam, dieses zu fangen, wenn Sie wissen, dass in der aktuellen Spielebene noch <quote>Schenke Leben</quote>-Geschenke sind.

source: In levels where there are a lot of hidden bricks there may be a way to win the level without having to destroy most of them.
de: In Spielebenen mit vielen unsichtbaren Steinen ist möglich, die Spielebene zu bestehen, ohne die meisten von ihnen zu zerstören.

source: Interface Overview
de: Die Benutzeroberfläche

source: Menu Items
de: Menüeinträge

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo> </shortcut> <guimenu>Game</guimenu> <guimenuitem>New</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo> </shortcut> <guimenu>Spiel</guimenu> <guimenuitem>Neu</guimenuitem>

source: Starts a new game.
de: Startet ein neues Spiel.

source: <shortcut> <keycap>&Esc;</keycap> </shortcut> <guimenu>Game</guimenu> <guimenuitem>Pause</guimenuitem>
de: <shortcut> <keycap>&Esc;</keycap> </shortcut> <guimenu>Spiel</guimenu> <guimenuitem>Pause</guimenuitem>

source: Pause and resume the current game.
de: Hält das aktuelle Spiel an oder setzt es fort.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>H</keycap></keycombo> </shortcut> <guimenu>Game</guimenu> <guimenuitem>Show High Scores</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>H</keycap></keycombo> </shortcut> <guimenu>Spiel</guimenu> <guimenuitem>Bestenliste anzeigen</guimenuitem>

source: Shows a dialog containing the High Scores.
de: Zeigt einen Dialog mit der Bestenliste.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo> </shortcut> <guimenu>Game</guimenu> <guimenuitem>Quit</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo> </shortcut> <guimenu>Spiel</guimenu> <guimenuitem>Beenden</guimenuitem>

source: Quits the program.
de: Beendet das Programm.

source: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>F</keycap></keycombo> </shortcut> <guimenu>Settings</guimenu> <guimenuitem>Full Screen Mode</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;&Shift;<keycap>F</keycap></keycombo> </shortcut> <guimenu>Einstellungen</guimenu><guimenuitem>Vollbildmodus</guimenuitem>

source: Play the &kbreakout; game in full screen mode. Leaving this mode is only possible using the shortcut.
de: &kbreakout; im Vollbildmodus spielen. Dieser Modus kann nur mit dem Kurzbefehl verlassen werden.

source: Additionally &kbreakout; has the common &kde; <guimenu>Settings</guimenu> and <guimenu>Help</guimenu> menu items, for more information read the sections about the <ulink url="help:/fundamentals/ui.html#menus-settings">Settings Menu</ulink> and <ulink url="help:/fundamentals/ui.html#menus-help">Help Menu</ulink> of the &kde; Fundamentals.
de: Zusätzlich hat &kbreakout; die bekannten &kde;-Einträge im Menü <guimenu>Einstellungen</guimenu> und <guimenu>Hilfe</guimenu>, weitere Informationen dazu finden Sie in den Abschnitten über die Menüs <ulink url="help:/fundamentals/ui.html#menus-settings">Einstellungen</ulink> und <ulink url="help:/fundamentals/uihtml#menus-help">Hilfe</ulink> der &kde;-Grundlagen.

source: Shortcuts
de: Kurzbefehle

source: The default shortcuts are:
de: Folgende Tastenkürzel sind als Standard eingestellt:

source: Fire
de: Feuer

source: Space
de: Leertaste

source: Pause/Resume
de: Pause/Weiterspielen

source: Start a new game
de: Ein neues Spiel starten

source: Show High Scores
de: Bestenliste anzeigen

source: Quit
de: Beenden

source: Full Screen Mode
de: Vollbildmodus

source: Help
de: Hilfe

source: What's this?
de: Was ist das?

source: Credits and License
de: Danksagungen und Lizenz

source: Program copyright 2008 by Fela Winkelmolen <email>fela.kde@gmail.com</email>
de: Programm Copyright 2008 Fela Winkelmolen <email>fela.kde@gmail.com</email>

source: Documentation copyright 2008 by Fela Winkelmolen <email>fela.kde@gmail.com</email>
de: Dokumentation Copyright 2008 Fela Winkelmolen <email>fela.kde@gmail.com</email>

source: CREDIT_FOR_TRANSLATORS
de: <para>Übersetzung Ingo Malchow <email>ingomalchow@googlemail.com</email></para>

source: How to obtain &kappname;
de: Bezugsquellen von &kappname;

source: Compilation and Installation
de: Kompilierung und Installation
