Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdegames/kfourinline.po
Languages: de

source: The KFourInLine Handbook
de: Das Handbuch zu „Vier gewinnt“

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Maren</firstname><surname>Pakura</surname><affiliation><address><email>maren@kde.org</email></address></affiliation><contrib>Deutsche Übersetzung</contrib></othercredit>

source: &kfourinline; is a four-in-a-row game for &kde;.
de: Vier Gewinnt ist ein Strategiespiel für &kde;.

source: game
de: Spiel

source: board
de: Brettspiel

source: board game
de: Brettspiel

source: four wins
de: Vier gewinnt

source: four
de: vier

source: four in a row
de: Vier in einer Reihe

source: four in line
de: Vier gewinnt

source: kfourinline
de: Vier gewinnt

source: connect four
de: Vier verbinden

source: connect 4
de: 4 verbinden

source: Introduction
de: Einführung

source: Game type: Strategy, Board
de: Spieltyp: Strategie, Brettspiel

source: &kfourinline; is a board game for two players based on the <trademark>Connect-Four</trademark> game.
de: &kfourinline; ist ein auf <quote>Vier gewinnt</quote> basierendes Brettspiel für zwei Spieler.

source: The players try to build up a row of four pieces using different strategies. Pieces are placed on a board. The game can also be played against a computer.
de: Die Spieler versuchen mithilfe verschiedener Strategien auf einem Brett eine Reihe von vier Spielsteinen zu legen. Das Spiel kann auch gegen den Rechner gespielt werden.

source: How to Play
de: Spielanleitung

source: When &kfourinline; loads, you can select the difficulty or start a two player game. If you like, you can also pick your color and select which color starts the game.
de: Beim Start von &kfourinline; werden der Schwierigkeitsgrad und die Anzahl der Spieler gewählt. Sie können auch Ihre Spielfarbe festlegen und wählen welche Farbe beginnt.

source: Each player is represented by a color (for example yellow or white for player one and red for player two). The goal of the game is to get four connected pieces of your color into any row, column or diagonal. The players move in turns. Each turn the player can place one of his or her pieces into any of the seven columns where each piece will fall to the lowest possible free place &ie; it will fall down until it reaches the ground level or another piece.
de: Jeder Spieler wird durch eine Farbe repräsentiert (zum Beispiel gelb oder weiß für den ersten Spieler und rot für den zweiten). Es wird abwechselnd gespielt. Ziel des Spiels ist, vier Steine in einer Reihe zu haben. Diese Reihe kann senkrecht, waagerecht oder diagonal sein. Sie erreichen dies, indem Sie die Steine nacheinander in die sieben mögliche Spalten stecken. Die Steine fallen auf den tiefstmöglichen freien Platz &ie; entweder bis zum Boden oder auf einen anderen Stein.

source: After one player's move is done the second player can make his or her input. This is repeated until the game is over, which is when one of the players has four pieces in a row, column or diagonal or no more moves are possible because the board is filled.
de: Nachdem ein Spieler seinen Zug getätigt hat, ist der zweite Spieler an der Reihe. Das wird nun wiederholt, bis das Spiel vorüber ist. Das Spiel ist beendet, wenn ein Spieler vier Steine senkrecht, waagerecht oder diagonal in einer Reihe hat oder kein weiterer Zug mehr möglich ist, da das Spielfeld voll ist.

source: A player who first manages to get four pieces in a row, column or diagonal wins the game. If no more moves can be made but no player has won, the game ends drawn.
de: Der Spieler, der es zuerst schafft, vier Spielsteine senkrecht, waagerecht oder diagonal anzuordnen, gewinnt. Wenn keine Züge mehr getätigt werden können, bevor ein Spieler gewonnen hat, endet das Spiel unentschieden.

source: Game rules, strategies and tips
de: Spielregeln, Spielstrategien und Tipps

source: The board is separated into several regions.
de: Das Spielfeld ist in mehrere Bereiche eingeteilt.

source: The <firstterm>game board</firstterm> is constructed out of 7x6 fields which will be filled from bottom to top. The fields are marked with pieces in the color of the player who made the move to this position. On top of each column a colored arrow shows were the last piece had been put.
de: Das <firstterm>Spielfeld</firstterm> besteht aus 7x6 Feldern, die von unten her aufgefüllt werden. Die Felder werden mit Steinen in der Farbe des Spielers besetzt, der den Zug auf der jeweiligen Position ausführte. Oben in jeder Spalte erscheint ein farbiger Pfeil, der anzeigt, wo der letzte Spielstein gesetzt wurde.

source: The <firstterm>status display</firstterm> shows which player is controlled by which input device. A local player can input moves using keyboard or mouse, a remote player is shown as network input and finally the computer can control the input for a player. The status display further shows the player's names and the level of the computer opponent. Additionally the number of won, drawn, lost and ended games is noted for both players. Which player is next to move is indicated by one of the player's names being highlighted.
de: Die <firstterm>Statusanzeige</firstterm> gibt an, welcher Spieler von welchem Eingabegerät gesteuert wird. Ein lokaler Spieler kann Züge über Tastatur oder Maus eingeben, ein Netzwerk-Spieler wird als Netzwerk-Eingabe angezeigt, und auch der Rechner kann die Eingabe eines Spielers steuern. Die Statusanzeige informiert zudem über die Spielernamen, den Schwierigkeitsgrad des Computergegners und die gewonnenen, unentschiedenen, verlorenen und beendeten Spiele beider Spieler. Welcher Spieler am Zug ist, wird durch Hervorheben des Namens verdeutlicht.

source: The <firstterm>statusbar</firstterm> at the bottom of the screen displays the status of the game and which player is next to play.
de: Die <firstterm>Statusleiste</firstterm> am unteren Ende des Bildschirms zeigt den Status des Spiels und welcher Spieler am Zug ist.

source: Remote Connections
de: Netzwerkspiele

source: It is possible to play the game over a network connection with another computer. One of the computers will act as game server. This one can determine who should play which color. You can configure the network options in the menu <menuchoice><guimenu>Settings</guimenu><guimenuitem>Network Configuration...</guimenuitem></menuchoice>. In the menu <menuchoice><guimenu>Game</guimenu><guimenuitem>Network Chat...</guimenuitem></menuchoice>. you find a chat dialog box which allows you to speak with your friend.
de: Sie können über eine Netzwerkverbindung mit einem anderen Computer spielen. Einer der Computer agiert dabei als Server. Dieser kann festlegen, wer mit welcher Farbe spielt. Die Netzwerkeinstellungen können Sie im Menü <menuchoice><guimenu>Einstellungen</guimenu> <guimenuitem>Netzwerk einrichten ...</guimenuitem> </menuchoice> verändern. Mit <menuchoice><guimenu>Spiel</guimenu><guimenuitem>Netzwerk-Chat ...</guimenuitem></menuchoice> öffnen Sie ein Dialogfenster, in dem Sie sich mit den anderen Spielern unterhalten können.

source: When a network connection is built you will be asked to enter a remote host and a port. The port can usually just be left untouched, but if you know what you are doing replace it by another number, which has to be the same in both player games of course. The hostname should be the name of the remote host to which you are connecting. Only the client in the connection has to supply a hostname. It is often wise that the player behind a firewall chooses to be client as the firewall might not allow incoming connections.
de: Wenn eine Netzwerkverbindung aufgebaut wird, werden Sie nach dem entfernten Rechner und der Portnummer gefragt. Die Portnummer brauchen Sie nicht zu ändern - aber wenn Sie wissen was Sie tun, können Sie sie durch eine andere ersetzen, die natürlich in beiden Spielen gleich sein muss. Der Rechnername sollte der Name des anderen Rechners sein, mit dem Sie die Verbindung aufbauen wollen. Nur einer der beiden Spieler muss den Rechnernamen angeben, dem anderen steht es frei. Befindet sich einer der Rechner hinter einer Firewall, sollte dieser möglichst als Klient agieren, da die Firewall eventuell Verbindungsanfragen blockiert.

source: Interface Overview
de: Die Benutzeroberfläche

source: Menu Items
de: Menüeinträge

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo> </shortcut> <guimenu>Game</guimenu> <guimenuitem>New</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo> </shortcut> <guimenu>Spiel</guimenu> <guimenuitem>Neu</guimenuitem>

source: Starts a new game. In a network game this option is only available for the network server. The network client will be automatically started by the server.
de: Startet ein neues Spiel. In einem Netzwerkspiel kann dies nur der Netzwerk-Server. Der Netzwerk-Klient wird automatisch vom Server gestartet.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>O</keycap></keycombo> </shortcut> <guimenu>Game</guimenu> <guimenuitem>Load...</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>O</keycap></keycombo> </shortcut> <guimenu>Spiel</guimenu> <guimenuitem>Laden ...</guimenuitem>

source: Loads a saved game.
de: Lädt ein gespeichertes Spiel.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>S</keycap></keycombo> </shortcut> <guimenu>Game</guimenu> <guimenuitem>Save</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>S</keycap></keycombo> </shortcut> <guimenu>Spiel</guimenu> <guimenuitem>Speichern</guimenuitem>

source: Saves the current game.
de: Speichert das aktuelle Spiel.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>End</keycap></keycombo> </shortcut> <guimenu>Game</guimenu> <guimenuitem>End Game</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Ende</keycap> </keycombo> </shortcut> <guimenu>Spiel</guimenu> <guimenuitem>Spiel beenden</guimenuitem>

source: Ends a running game.
de: Beendet ein Spiel.

source: <guimenu>Game</guimenu> <guimenuitem>Network Chat...</guimenuitem>
de: <guimenu>Spiel</guimenu> <guimenuitem>Netzwerk-Chat ...</guimenuitem>

source: Pops up a chat widget which allows you to send messages to the other party.
de: In einem Netzwerkspiel können Sie hiermit Nachrichten an den anderen Spieler schicken.

source: <guimenu>Game</guimenu> <guimenuitem>Show Statistics</guimenuitem>
de: <guimenu>Spiel</guimenu> <guimenuitem>Statistik anzeigen</guimenuitem>

source: Shows a dialog containing information about the overall game statistics, that is games won, lost or drawn by both players. The dialog also allows to clear this all time statistics.
de: Zeigt einen Dialog mit Informationen zu den allgemeinen Spielstatistiken an: die gewonnenen, verlorenen oder unentschiedenen Spiele beider Spieler. Diese Statistiken können gelöscht werden.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo> </shortcut> <guimenu>Game</guimenu> <guimenuitem>Quit</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo> </shortcut> <guimenu>Spiel</guimenu> <guimenuitem>Beenden</guimenuitem>

source: Quits the program.
de: Beendet das Programm.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Z</keycap></keycombo> </shortcut> <guimenu>Move</guimenu> <guimenuitem>Undo</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Z</keycap></keycombo> </shortcut> <guimenu>Zug</guimenu> <guimenuitem>Zurücknehmen</guimenuitem>

source: Undo the last move. If the previous player is played by the computer two moves are taken back so that it is the player's turn again.
de: Macht den letzten Zug rückgängig. Wenn der vorherige Zug vom Computer ausgeführt wurde, werden zwei Züge rückgängig gemacht, sodass Sie wieder an der Reihe sind.

source: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>Z</keycap></keycombo> </shortcut> <guimenu>Move</guimenu> <guimenuitem>Redo</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>Z</keycap></keycombo> </shortcut> <guimenu>Zug</guimenu> <guimenuitem>Wiederherstellen</guimenuitem>

source: Replay a move which had been undone. If one of the players is played by the computer two moves are redone so that it is the player's turn again.
de: Führt einen zurückgenommenen Zug wieder aus. Wenn Sie gegen den Computer spielen, werden zwei Züge wiederhergestellt, sodass Sie wieder an der Reihe sind.

source: <shortcut> <keycap>H</keycap> </shortcut> <guimenu>Move</guimenu> <guimenuitem>Hint</guimenuitem>
de: <shortcut> <keycap>H</keycap> </shortcut> <guimenu>Zug</guimenu> <guimenuitem>Tipp</guimenuitem>

source: The computer will calculate the best possible move for you and mark it with a sign on the game board. How good the move actually is depends on the level of the computer.
de: Der Computer wird für Sie den bestmöglichen Zug berechnen und ihn auf dem Spielfeld markieren. Wie gut dieser ist, hängt von der Spielstärke ab, mit der der Computer spielt.

source: <guimenu>Settings</guimenu> <guisubmenu>Theme</guisubmenu>
de: <guimenu>Einstellungen</guimenu><guisubmenu>Design</guisubmenu>

source: Choose a graphical theme for the game. Which themes are available depends on the current installation.
de: Wählen Sie ein Design für das Spiel. Die verfügbaren Designs sind von Ihrer aktuellen Installation abhängig.

source: <guimenu>Settings</guimenu> <guimenuitem>Network Configuration...</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>Netzwerk einrichten ...</guimenuitem>

source: Pops up a dialog for the network configuration. You can choose to be server or client. If you are server you can also choose what color the remote player should take over. If a network game is running you can also disconnect it in this menu.
de: Zeigt einen Dialog zur Netzwerkeinrichtung an. Sie können als Server oder als Klient agieren. Falls Sie als Server agieren, können Sie festlegen, in welcher Farbe der gegnerische Spieler spielt. Falls ein Netzwerkspiel läuft, können Sie in diesem Menü die Verbindung unterbrechen.

source: Additionally &kappname; has the common &kde; <guimenu>Settings</guimenu> and <guimenu>Help</guimenu> menu items, for more information read the sections about the <ulink url="help:/fundamentals/ui.html#menus-settings">Settings Menu</ulink> and <ulink url="help:/fundamentals/ui.html#menus-help">Help Menu</ulink> of the &kde; Fundamentals.
de: Zusätzlich hat &kappname; die bekannten &kde;-Einträge im Menü <guimenu>Einstellungen</guimenu> und <guimenu>Hilfe</guimenu>, weitere Informationen dazu finden Sie in den Abschnitten über die Menüs <ulink url="help:/fundamentals/ui.html#menus-settings">Einstellungen</ulink> und <ulink url="help:/fundamentals/uihtml#menus-help">Hilfe</ulink> der &kde;-Grundlagen.

source: Game Configuration
de: Einstellungen für das Spiel

source: &kfourinline; can be configured using the configuration dialog with <menuchoice><guimenu>Settings</guimenu><guimenuitem>Configure &kfourinline;...</guimenuitem></menuchoice>
de: Die Einstellungen für &kfourinline; können Sie im Einrichtungsdialog ändern, den Sie mit <menuchoice><guimenu>Einstellungen</guimenu> <guimenuitem>Vier gewinnt einrichten ...</guimenuitem></menuchoice> öffnen.

source: <guilabel>Starting Player Color</guilabel>: Determine which player color (<guilabel>Red</guilabel> or <guilabel>Black</guilabel>) has the first move in the next game.
de: <guilabel>Farbe des Spielers der anfängt</guilabel>: Bestimmen Sie, welche Farbe (<guilabel>Rot</guilabel> oder <guilabel>Schwarz</guilabel>) im nächsten Spiel den ersten Zug ausführt.

source: <guilabel>Player Names</guilabel>: Change the names of the players.
de: <guilabel>Spielernamen</guilabel>: Bearbeiten Sie die Namen der Spieler.

source: <guilabel>Black Plays With</guilabel>: Choose who should play for player 1. It can be either <guilabel>Mouse</guilabel> or <guilabel>Keyboard</guilabel>, &ie; a local player using the mouse or keyboard as input device or <guilabel>Computer</guilabel>, &ie; the computer plays for this player.
de: <guilabel>Schwarz spielt mit</guilabel>: Wählen Sie, welcher Spieler als Spieler 1 spielt. Das kann entweder <guilabel>Maus</guilabel> oder <guilabel>Tastatur</guilabel> sein, &ie; ein lokaler Spieler, der Maus oder Tastatur als Eingabegerät verwendet, oder der <guilabel>Computer</guilabel>, &ie; der Computer spielt für diesen Spieler.

source: <guilabel>Red Plays With</guilabel>: Same as <guilabel>Black Plays With</guilabel> but for player 2 (red).
de: <guilabel>Rot spielt mit</guilabel>: Das gleiche wie <guilabel>Schwarz spielt mit</guilabel>, aber für den zweiten Spieler (rot).

source: <guilabel>Computer Difficulty</guilabel>: Select the level of the computer player.
de: <guilabel>Schwierigkeitsgrad des Computergegners</guilabel>: Bestimmt das Können des Computergegners.

source: <guilabel>Use AI learning</guilabel>: The computer AI can learn from mistakes made in one game.
de: <guilabel>Dazulernenden Computergegner verwenden</guilabel>: Die künstliche Intelligenz des Computers kann von den Fehlern lernen, die in einem Spiel gemacht wurden.

source: Frequently asked questions
de: Häufig gestellte Fragen

source: Can I change the look of the game?
de: Kann ich das Erscheinungsbild des Spiels ändern?

source: You can change the color of the pieces by opening the <guimenu>Settings</guimenu> menu and select <guisubmenu>Theme</guisubmenu>.
de: Sie können die Farben der Spielsteine ändern, indem Sie im Menü <guimenu>Einstellungen</guimenu> den Unterpunkt <guisubmenu>Design</guisubmenu> auswählen.

source: Can I use the keyboard to play the game?
de: Kann ich mit der Tastatur spielen?

source: You cannot use the keyboard to control the pieces.
de: Nein, die Spielsteine können nicht mit der Tastatur gesetzt werden.

source: I have lost control of who is in the lead, can I find it out?
de: Ich habe die Übersicht darüber verloren, welcher Spieler führt. Wie kann ich es herausfinden?

source: Yes, you can see statistics by opening the <guimenu>Game</guimenu> menu and selecting <guimenuitem>Show Statistics</guimenuitem>.
de: Sie können die Statistik im <guimenu>Spiel</guimenu>-Menü unter <guimenuitem>Statistik anzeigen</guimenuitem> einsehen.

source: Credits and License
de: Danksagungen und Lizenz

source: Program copyright 1995-2007 &Martin.Heni; &Martin.Heni.mail; and Benjamin Meyer.
de: Programm Copyright 1995-2007 &Martin.Heni; &Martin.Heni.mail; und Benjamin Meyer.

source: Graphics copyright 2007 Eugene Trounev <email>eugene.trounev@gmail.com</email> and Johann Ollivier Lapeyre.
de: Grafik Copyright 2007 Eugene Trounev <email>eugene.trounev@gmail.com</email> und Johann Ollivier Lapeyre.

source: Documentation copyright 2007 &Martin.Heni; &Martin.Heni.mail; and Benjamin Meyer.
de: Dokumentation Copyright 2007 &Martin.Heni; &Martin.Heni.mail; und Benjamin Meyer.

source: CREDIT_FOR_TRANSLATORS
de: <para>Deutsche Übersetzung von Maren Pakura <email>maren@kde.org</email></para>

source: How to obtain &kfourinline;
de: Woher Sie Vier gewinnt erhalten

source: Compilation and Installation
de: Kompilierung und Installation
