Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdegames/kgoldrunner.po
Languages: de

source: If you are creating a level, you use the Level Selection Dialog to assign it to a game and level number. You use the same dialog if you have been editing a level, but the default is to save it where it came from. You can change the game and level, to get a <quote>Save as...</quote> effect. If you have been editing a System level you must save it as a copy in one of your own games.
de: Falls eine neue Ebene erstellt wurde, ist das Auswahlfenster zur Einordnung und Nummernzuweisung in einem Spiel vonnöten. Das gleiche Fenster dient auch dazu, eine veränderte Ebene an eine neue Position zu speichern. Dabei kann sowohl die Ebenennummer als auch der Spielname geändert werden. Der Effekt ist der gleiche wie bei anderen Programmen der Menüeintrag „Speichern unter ...“. Falls eine systemweite Ebene geändert wurde, muss sie in einem eigenen Spiel gespeichert werden.

source: Adding a Level Name and Hint
de: Einen Ebenennamen und einen Tipp hinzufügen

source: On the Save version of the Level Selection Dialog box is a button marked <guibutton>Edit Level Name &amp; Hint</guibutton>. You can use this to put the finishing touches on your level by adding a name and hint. Both are optional, but they are essential for tutorial levels and it is usual to provide them with very difficult levels, such as in Championship games (see the <quote>Vengeance of Peter W</quote> game). Of course you can also use the <guiicon>Edit Name/Hint</guiicon> icon, at any time, to add or edit a name and hint.
de: Im Speichermodus der „Ebenenauswahl“ ist der zusätzlich der Knopf <guibutton>Name &amp; Tipp für Ebene bearbeiten</guibutton> vorhanden. Hier kann für die Ebene ein Name und ein Tipp hinzugefügt werden. In Einführungsebenen und bei sehr schwierigen Ebenen wie in Wettkämpfen ist es üblich, beides hinzuzufügen (siehe „Die Rache des Peter W.“). Dazu kann natürlich auch jederzeit das Symbol <guiicon>Name/Tipp bearbeiten</guiicon> verwendet werden.

source: Testing a Level
de: Eine Ebene testen

source: After saving an edited level, you can test it by using <guimenuitem>New Game</guimenuitem> in the <guimenu>Game</guimenu> menu or the equivalent keyboard shortcut. By default the game and level number are remembered and you can get straight into the level with just a few clicks. If you then want to edit some more, the same is true when you use <guimenuitem>Edit Level</guimenuitem> again. It is essential to test every level you compose, to make sure that it is possible to complete it and that it is not too easy.
de: Nach dem Speichern kann eine Ebene getestet werden, indem <menuchoice><guimenu>Spiel</guimenu><guimenuitem>Neues Spiel ...</guimenuitem></menuchoice> ausgewählt oder der zugehörige Kurzbefehl verwendet wird. Die zuletzt bearbeitete Ebene ist vorgewählt. Falls danach daran eine Weiterarbeit stattfinden soll, gilt das eben Gesagte auch für <guimenuitem>Ebene bearbeiten ...</guimenuitem>. Wichtig ist es, jede erstellte Ebene zu testen, damit sie auch abgeschlossen werden kann und dabei nicht zu einfach ist.

source: Reorganizing Games and Levels
de: Spiele und Ebenen umordnen

source: Moving a Level
de: Verschieben einer Ebene

source: You can use <guimenuitem>Move Level</guimenuitem> on the <guimenu>Editor</guimenu> menu to re-order or re-number the levels in a game or to move a level from one game to another. <guimenuitem>Move Level</guimenuitem> is a two-part operation. You must first load a level by selecting it for editing or play, then when you use <guimenuitem>Move Level</guimenuitem>, the Level Selection Dialog box appears and you can select the new level number and game (as required).
de: Der Menüeintrag <menuchoice><guimenu>Editor</guimenu><guimenuitem>Ebene verschieben ...</guimenuitem></menuchoice> dient zum Umordnen der Ebenen innerhalb eines Spiels bzw. dem Verschieben einer Ebene von einem Spiel in ein anderes. Zunächst muss die Ebene zum Bearbeiten oder Spielen ausgewählt und dann <guimenuitem>Ebene verschieben ...</guimenuitem> im Menü ausgewählt werden. Es erscheint das Auswahlfenster, in dem das Ziel der Verschiebung markiert wird.

source: Moves leave no gaps in the sequence of level numbers in a game. For example, if you move level 10 of game A to level 3 of game B, levels 11 and above in game A are re-numbered down by one (to close the gap) and levels 3 and above in game B are re-numbered up by one (to make room for the newcomer).
de: Bei Verschiebungen entstehen keine Lücken in den Ebenennummern eines Spiels. Falls beispielsweise Ebene 10 aus Spiel A in Ebene 3 des Spiels B verschoben wird, werden die Ebenen ab 11 aufwärts neu nummeriert (um die Lücke zu schließen) und die Ebenen von 3 aufwärts des Spiels B werden um eine Nummer erhöht (um Platz für die neue Ebenen zu schaffen).

source: Deleting a Level
de: Eine Ebene löschen

source: You can use <guimenuitem>Delete Level</guimenuitem> on the <guimenu>Editor</guimenu> menu to remove an unwanted level. The other levels are re-numbered so as to close the gap in the sequence.
de: Der Menüpunkt <menuchoice><guimenu>Editor</guimenu><guimenuitem>Ebene löschen ...</guimenuitem></menuchoice> ist zum Löschen einer unerwünschten Ebene. Die anderen Ebenen werden dabei automatisch neu nummeriert, um die Lücke zu schließen.

source: Tips, Tricks and Hints
de: Tipps, Tricks und Hinweise

source: Overview
de: Überblick

source: This chapter presents some general tips and hints for playing &kgoldrunner;, as opposed to the specific hints you will find on the levels in tutorial and championship games (see <link linkend="move-menu"><menuchoice> <guimenu>Move</guimenu><guimenuitem>Hint</guimenuitem></menuchoice></link>). The hints are grouped as follows:
de: In diesem Kapitel werden einige allgemeine Hinweise zum Spielen von &kgoldrunner; gegeben. Weitergehende spezielle Hinweise zu den Ebenen können den Einführungs- und Wettbewerbsspielen entnommen werden (siehe auch <link linkend="move-menu"><menuchoice><guimenu>Zug</guimenu><guimenuitem>Tipp</guimenuitem></menuchoice></link>). Die Hinweise sind folgendermaßen geordnet:

source: <link linkend="hints-dealing-with-enemies">Dealing with Enemies</link>
de: <link linkend="hints-dealing-with-enemies">Umgang mit Feinden</link>

source: <link linkend="hints-digging-puzzles">Digging Puzzles</link>
de: <link linkend="hints-digging-puzzles">Graben</link>

source: <link linkend="hints-tricks-with-gold">Tricks with Gold</link>
de: <link linkend="hints-tricks-with-gold">Tricks mit Gold</link>

source: <link linkend="hints-solving-difficult-levels">Solving Difficult Levels</link>
de: <link linkend="hints-solving-difficult-levels">Schwierige Ebenen meistern</link>

source: <title>Dealing with Enemies</title>
de: <title>Umgang mit Feinden</title>

source: You can always trap a single oncoming enemy in one hole, get his gold and run on over him without killing him. It is often a good idea to dig behind you and delay him further, but that might kill him. In some levels it is not a good idea to kill enemies.
de: Ein einzelner Feind kann immer in einem Loch eingesperrt und durch Laufen über seinen Kopf ggf. sein Gold mitgenommen werden, ohne ihn zu töten. Häufig ist es außerdem sinnvoll, hinter dem Helden ein weiteres Loch zu graben, um den Feind aufzuhalten. Das kann ihn aber auch töten. In einigen Ebenen ist das Töten von Feinden nachteilig.

source: You can usually trap two oncoming enemies in two holes, get their gold and run on over them, but this is dangerous if the enemies are separated by two or three spaces. Sometimes two holes kill one of the enemies and the other escapes and sometimes both escape. In &kgoldrunner; rules it is easier to trap two enemies and run over them, because they stay in the holes for longer.
de: Zwei Feinde können meistens in zwei benachbarten Löchern gefangen und durch Laufen über ihren Köpfen das Gold mitgenommen werden. Bei einem Abstand von zwei oder drei Plätzen kann das aber gefährlich werden, da zwei Löcher manchmal einen der Feinde töten, während der andere entkommen kann. Von Zeit zu Zeit entkommen sogar beide. Beim Spiel nach „&kgoldrunner;“-Regeln ist es einfacher, zwei Feinde zu fangen und über sie hinwegzulaufen, weil sie länger in den Löchern stecken bleiben.

source: It is nearly always impossible to trap three oncoming enemies and run on over them. You will have to kill them, dig and drop through the floor or simply run away.
de: Es ist fast immer unmöglich mehr als zwei Feinde gleichzeitig einzusperren und über deren Köpfe zu laufen. Sie müssen getötet, ein Loch zum „Hindurchlaufen“ unter ihnen gegraben oder einfach weggelaufen werden.

source: Try to get all the enemies running together in one group. That way you will not get surrounded and you can do such fun things as collect gold while they run along behind you.
de: Es sollte versucht werden, die Feinde in einer Gruppe zusammenzuhalten. Auf diese Weise wird vermieden, eingekreist zu werden und das Gold kann Gold eingesammelt werden, während der Held verfolgt wird.

source: Sometimes you can kill an enemy with two holes, but it often takes three to nine holes to kill one to five enemies.
de: Manchmal kann ein Feind mit zwei Löchern getötet werden, aber häufig sind drei bis neun Löcher notwendig, um einen von fünf Feinden zu töten.

source: It is possible to kill an enemy with one hole if he is far enough away when you dig it.
de: Es ist möglich, einen Feind mit nur einem Loch zu töten, wenn er beim Graben des Lochs weit genug entfernt ist.

source: In the <quote>Traditional</quote> game, you can trap an enemy permanently in a pit of brick or concrete. Stand near the edge of the pit on the opposite side to the enemy. As he approaches the pit, move down one square (to the level of the floor of the pit) and the enemy will usually run into the pit.
de: Im „herkömmlichen“ Spiel kann ein Feind dauerhaft in einer Grube aus Stein oder Beton festgehalten werden. Hierzu muss der Held auf der dem Feind gegenüberliegenden Seite der Grube sein und ein Rechteck nach unten bewegt werden, wenn sich der Feind nähert. Dadurch wird er meistens in die Falle gehen.

source: In some levels in the <quote>Traditional</quote> game, you can force an enemy to climb a ladder ahead of you if you stand somewhere above the bottom of the ladder.
de: In einigen „herkömmlichen“ Ebenen kann ein Feind dazu gebracht werden, vor dem Helden eine Leiter hinaufzuklettern, indem der Held irgendwo oberhalb des unteren Endes der Leiter steht.

source: In the <quote>&kgoldrunner;</quote> game, you can trap an enemy in a pit by getting him to fall from above you, then running sideways and digging out before he reaches you.
de: Im „&kgoldrunner;“-Spiel kann ein Feind in einer Baugrube eingefangen werden, indem er dazu gebracht wird, von oben auf den Helden herabzustürzen, dann zur Seite gelaufen und schnell genug eine Grube gegraben wird.

source: In the <quote>&kgoldrunner;</quote> game, enemies cannot run through dug bricks, so you can sometimes use them as a barrier or hiding place.
de: Im „&kgoldrunner;“-Spiel können Feinde nicht durch Steinmauern laufen, sodass diese manchmal als Barriere oder Versteck verwendet werden können.

source: <title>Digging Puzzles</title>
de: <title>Graben</title>

source: To dig through more than one layer of bricks, start by digging as many bricks as there are layers, jump in, dig one brick less and so on.
de: Um sich durch mehrere Steinschichten zu graben, muss oben mit einem Loch der Breite der Schichtenanzahl begonnen, dann hineingesprungen und ein Loch mit einer um Eins verringerten Breite gegraben werden (usw.).

source: If you dig next to a ladder or a succession of bars, you can dig down through any number of layers and up to five or six bricks horizontally. Just return to the ladder or bars after digging each layer, then move down one square, run out and dig the next layer.
de: Falls neben einer Leiter oder einer Folge von Balken gegraben wird, kann durch beliebig viele Ebenen und fünf bis sechs Steine horizontal gegraben werden. Nach jeder gegrabenen Ebene wird zur Leiter oder zum Balken zurückgekehrt, ein Rechteck nach unten geklettert und die nächste Ebene gegraben.

source: If a digging puzzle looks impossible, consider that there might be some false bricks in it. Maybe the bottom layer is false or maybe you can stand in a false brick and dig next to it.
de: Falls ein Grabungsspiel unmöglich erscheint, sollte daran bedacht werden, dass einige Steine falsch sein könnten. Vielleicht ist die untere Ebene falsch oder es wird in einem falschen Stein gestanden und daneben kann gegraben werden.

source: Think about the order in which you will collect the gold. If you pick the right order, the digging might be easier.
de: Die Reihenfolge des Goldeinsammelns sollte wohl bedacht sein. Die richtige Reihenfolge erleichtert häufig den Grabungsprozess.

source: Some levels require you to dig away a brick wall, run in, collect some gold and run out again before the bricks close up and trap you.
de: In einigen Ebenen ist es notwendig, ein Loch in eine Steinmauer zu graben, hineinzulaufen und einiges Gold einzusammeln, bevor die Mauer sich wieder schließt.

source: It is possible to dig while falling through empty space, if you can get the timing right. You do not need to have an enemy to ride upon. This is a bug which has become a <quote>feature</quote> and is used extensively in the <quote>State of Terror</quote>, <quote>Count</quote> and <quote>Curse of the Mummy</quote> games.
de: Mit dem richtigen Zeitgefühl kann während des Fallens ein Loch gegraben werden. Dabei muss nicht auf einem Feind „geritten“ werden. Dies war ursprünglich ein Fehler, der zu einer Funktion wurde, die besonders in den Spielen „Terrorstaat“, „Zähler“ und „Fluch der Mumie“ häufig Verwendung findet.

source: <title>Tricks with Gold</title>
de: <title>Tricks mit Gold</title>

source: If you cannot get to a piece of gold, think about getting an enemy to go there and get it. Even think about using an enemy's head as a bridge to get across a pit or precipice.
de: Falls ein Goldstück nicht erreicht werden kann, ist es manchmal möglich, einen Feind zum Sammeln zu bewegen und ihm das Gold hinterher wieder abzunehmen.

source: In some levels there is a nugget that must be collected last of all, because you will need the hidden ladders to get away from that position.
de: In einige Ebenen gibt es ein bestimmtes Goldstück, das unbedingt als letztes eingesammelt werden muss, weil die versteckte Leiter benötigt wird, um diese Position wieder verlassen zu können.

source: In some situations an enemy can be killed without giving up the gold he is carrying. The gold becomes a <quote>lost nugget</quote>. You score no points for making an enemy lose a nugget, but at least you can finish the level.
de: Manchmal kann ein Feind getötet werden, bevor er sein Gold wieder abgegeben hat. Damit ist das Gold „verloren“. Es gibt zwar keine Punkte für dieses Gold, aber die Ebene kann dennoch beendet werden.

source: If there is nowhere to dig, keep the enemies running over concrete and the tops of ladders and so make them release their gold at random.
de: Falls es keine Stelle zum Graben gibt, müssen die Feinde immer wieder über Beton oder Leitern „geschickt“ werden, damit sie zufällig ihr Gold fallen lassen.

source: <title>Solving Difficult Levels</title>
de: <title>Schwierige Ebenen</title>

source: Try changing the speed settings to Beginner or even lower.
de: Die Spielgeschwindigkeit sollte auf <guimenuitem>Anfängergeschwindigkeit</guimenuitem> oder noch weiter herab gesetzt werden.

source: Use the Editor feature to <quote>peek</quote> at where the false bricks and hidden ladders are.
de: Der Editor sollte zum „Aufspüren“ von falschen Steinen und versteckten Leitern verwendet werden.

source: Use the Editor feature to save the level in one of your own games, then you can edit it so that you do not always have to start at the beginning when you die. This allows you to develop the solution in easier stages.
de: Der Editor sollte verwendet werden, um die Ebenen in einem eigenen Spiel zu speichern. Die Ebene sollte dann abgeändert werden, dass nicht immer von Anfang an begonnen werden muss. Damit kann die Lösung in Etappen erarbeitet werden.

source: In digging puzzles, look for false bricks you can fall into and thus have one less brick to dig. Or consider using an enemy to go ahead of you, so that you can stand on his head and dig.
de: Bei Grabungsebenen sollte nach falschen Steinen gesucht werden, in die man fallen kann, um eine Steinschicht weniger „bearbeiten“ zu müssen. Oder ein Feind geht voran, sodass man auf seinem Kopf stehend graben kann.

source: Look for a theme or trick in the level, such as riding down on an enemy's head, trapping all the enemies in a pit, luring the enemies to a corner where they will stay and not chase you, luring the enemies into pits you must cross to get to some gold, getting the enemies to fetch gold for you or finding spots where you can stand and make an enemy move to where you want him.
de: Nach einem Muster oder einem Trick sollte gesucht werden, wie beispielsweise auf einem Feind „reiten“, alle Feinde in einer Grube fangen, die Feinde in eine Ecke des Spielfelds locken, in der sie bleiben, die Feinde in eine Grube locken, die überquert werden muss, um Gold einzusammeln, die Feinde zum Gold sammeln verwenden oder Standplätze finden und die Feinde dorthin locken, wo sie nützlich sind.

source: Use <menuchoice><guimenu>Move</guimenu> <guimenuitem>Show A Solution...</guimenuitem></menuchoice> to check if there is a recorded solution to the level. This will show you some ways to handle difficulties in the level, but not necessarily the best ways. There are often many ways to win a level and each time you play it there are small differences in timing, etc. So you probably will not be able to copy the recorded solution exactly.
de: Mit <menuchoice><guimenu>Zug</guimenu><guimenuitem>Eine Lösung wiedergeben ...</guimenuitem></menuchoice> sollte versucht werden, ob bereits eine aufgenommene Lösungsmöglichkeit für die Ebene vorliegt. Dies zeigt Möglichkeiten, wie Schwierigkeiten innerhalb der Ebene überwunden werden können (ist aber nicht immer die beste Möglichkeit). Meist gibt es mehrere Lösungsmöglichkeiten und bei jedem Spielen sind kleine Unterschiede (z. B. zeitliche). Damit können die gezeigten Lösungsmöglichkeiten nicht immer genau nachgespielt werden.

source: Use <menuchoice><guimenu>Move</guimenu> <guimenuitem>Instant Replay</guimenuitem></menuchoice> or <menuchoice><guimenu>Move</guimenu> <guimenuitem>Replay Last Level</guimenuitem></menuchoice> to replay a level to a point just before you had trouble, then interrupt the replay and try some other approach.
de: Mit <menuchoice><guimenu>Zug</guimenu><guimenuitem>Sofortige Wiedergabe</guimenuitem></menuchoice> oder <menuchoice><guimenu>Zug</guimenu><guimenuitem>Letzte Ebene wiedergeben</guimenuitem></menuchoice> kann eine Ebene an einem Punkt fortgesetzt werden, zu dem noch keine Schwierigkeiten bestanden und ein anderer Versuch begonnen werden.

source: Credits and License
de: Danksagungen und Lizenz

source: &kgoldrunner; copyright 2003 Ian Wadham and Marco Krüger.
de: &kgoldrunner; Copyright 2003 Ian Wadham und Marco Krüger.

source: &kgoldrunner; is inspired by an early computer game called <trademark>Lode Runner</trademark> which was written in the USA by <trademark class="copyright">Doug Smith</trademark> and first released in 1983 by <trademark class="copyright">Broderbund Software</trademark>. It appeared originally on the Apple II and Commodore 64 computers, which was where the Wadham family and Marco Krüger became hooked. It was a major best-seller in its day and is one of the all-time great computer games.
de: &kgoldrunner; ist einem frühen Computerspiel namens <trademark>Lode Runner</trademark> nachempfunden, das in den USA von <trademark class="copyright">Doug Smith</trademark> programmiert und zuerst 1983 von <trademark class="copyright">Broderbund Software</trademark> veröffentlicht worden ist. Es war ein Spiel für Apple-II- und Commodore-64-Computer. Dort wurde es von der Familie Wadham und Marco Krüger entdeckt. Es war damals ein großer Hit und ist immer noch eines der zeitlosen Computerspiele.

source: You can find out more about <trademark>Lode Runner</trademark> and the various versions that have come out since 1983, on the website <ulink url="http://entropymine.com/jason/lr">Jason's Lode Runner Archive</ulink> (http://entropymine.com/jason/lr/). That site also has the story of the game's original development, in the file <ulink url="http://entropymine.com/jason/lr/misc/ldhist.html"> misc/ldhist.html</ulink>. Wikipedia also has a very good article on <trademark>Lode Runner</trademark>, with interesting links to other sites.
de: Mehr über <trademark>Lode Runner</trademark> und dessen vielfältige Varianten seit 1983 kann der Internetseite <ulink url="http://entropymine.com/jason/lr">Jason's Lode-Runner-Archiv</ulink> (http://entropymine.com/jason/lr/) entnommen werden. In der Datei <ulink url="http://entropymine.com/jason/lr/misc/ldhist.html">misc/ldhist.html</ulink> wird außerdem die Geschichte der Originalentwicklung aufgeführt. In der Wikipedia gibt es auch einen ausgezeichneten Artikel zu <trademark>Lode Runner</trademark> mit weiteren Verknüpfungen zu anderen Seiten.

source: &kgoldrunner; is an attempt to preserve the spirit of the original classic game on a platform that will be portable and will last more than a few years. It is available as free software in source code form. Copies of the original game are unobtainable now and the machines it ran on are going into museums.
de: In &kgoldrunner; soll der Geist des ursprünglichen Spiels auf einer portablen Plattform eingefangen werden und so mehr als ein paar Jahre überdauern. Der Quelltext ist frei verfügbar. Die Originalversion ist nicht mehr verfügbar und die passenden Rechner befinden sich inzwischen in Museen.

source: Marco Krüger developed &kgoldrunner; as far as v0.3, out of nostalgia for the original Commodore 64 game. Ian Wadham added several features and levels and created the current version. Ian's elder son Peter composed the 100 levels in the <quote>Initiation</quote> game and the 20 tricky levels in <quote>Vengeance of Peter W</quote>. The other levels were composed by Ian, Peter, Marco Krüger and friends and Ian's other children, Simon and Genevieve.
de: Marco Krüger entwickelte &kgoldrunner; aus nostalgischen Gründen bis zur Version 0.3 (er kannte das Originalspiel für den Commodore 64). Ian Wadham fügte einige Funktionen und Ebenen hinzu und entwickelt die aktuelle Version. Peter, der ältere Sohn von Ian, erstellte die 100 Ebenen der „Einführung“ und die 20 trickreichen Ebenen von „Die Rache des Peter W.“. Die anderen Ebenen stammen von Ian und Peter Wadham, Marco Krüger und Freunden sowie Ians anderen Kindern, Simon und Genevieve.

source: Stuart Popejoy of New York contributed the <quote>State of Terror</quote> game, in 2007, the first Championship game to use &kgoldrunner; rules and one of the most difficult games ever.
de: Stuart Popejoy aus New York erstellte 2007 das Spiel „Terrorstaat“, das erste Wettbewerbsspiel nach den „&kgoldrunner;“-Regeln und zudem eines der schwierigsten Spiele.

source: Steve Mann of Waterloo in Canada contributed the <quote>Count</quote> game in 2008 and the <quote>Curse of the Mummy</quote> game in 2008. Both use Traditional rules and both have interesting themes running through them, as well as being quite difficult.
de: Steve Mann aus Waterloo (Kanada) trug mit den Spielen „Zähler“ und „Fluch der Mumie“ im Jahr 2008 bei. Beide verwenden die traditionellen Regeln, bieten interessante Designs beim Spielen und sind ein wenig schwieriger.
