Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdegames/kgoldrunner.po
Languages: de

source: Shows the level selection dialog box, where you choose a game to be edited, then shows the game information in a dialog box where you can edit the name, rules and description, but not the file name prefix, in case you have saved some levels. That is because the prefix is used in level-file names internally.
de: Zeigt das Ebenenauswahlfenster an, in dem ein Spiel zur Bearbeitung ausgewählt werden kann. Die zugehörigen Informationen werden in einem Fenster angezeigt und der Name, die Regeln sowie die Beschreibung können geändert werden. Der Präfix kann nicht geändert werden, da er in den Dateinamen der Ebenendateien verwendet wird.

source: The Settings Menu
de: Das Menü Einstellungen

source: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>F</keycap></keycombo> </shortcut> <guimenu>Settings</guimenu> <guimenuitem>Full Screen Mode</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;&Shift;<keycap>F</keycap></keycombo> </shortcut> <guimenu>Einstellungen</guimenu><guimenuitem>Vollbildmodus</guimenuitem>

source: <action>Toggles the Full Screen mode</action> on and off.
de: Schaltet den Vollbildmodus ein bzw. aus.

source: <guimenu>Settings</guimenu><guisubmenu>Change Theme</guisubmenu>
de: <guimenu>Einstellungen</guimenu><guimenuitem>Design ändern</guimenuitem>

source: This submenu offers you a choice of background themes or <quote>worlds</quote> in which to play. You can change the theme at any time, even as the game is playing. For those who are artistically inclined, it is possible to compose new themes, including graphics or sound or both and add them to &kgoldrunner;. Just contact the author for details.
de: Dieses Untermenü ermöglicht die Auswahl eines Hintergrund-Designs oder der „Welten“, in denen gespielt werden kann. Das Design kann jederzeit geändert werden (sogar während dem Spielen). Für künstlerisch Bewanderte besteht auch die Möglichkeit, Designs mit Grafiken und Klängen selber zu erstellen und zu &kgoldrunner; hinzuzufügen. Für weitere Informationen sollte der Autor kontaktiert werden.

source: Black on White
de: Schwarz auf Weiß

source: This theme is stripped down to its barest graphical units and painted in black and white only. It is intended to help players who may be visually impaired. The author would appreciate email responses on how effective it is and what improvements in visibility could be made.
de: Dieses Design entbehrt jeglicher grafischer Elemente und ist ausschließlich schwarz-weiß. Dies soll Spielern entgegen kommen, die im Sehvermögen beeinträchtigt sind. Der Autor begrüßt E-Mails mit Rückmeldungen zur Effektivität und Verbesserungsvorschlägen.

source: The Treasure of Egypt
de: Schatz von Ägypten

source: Matt Goldrunner finds himself in an Ancient Egyptian temple, being pursued by mummies who are determined to protect their ancestral jewels at all costs.
de: Matt Goldrunner befindet sich in einem altertümlichen ägyptischen Tempel und wird von Mumien gejagt, die um jeden Preis die Juwelen ihrer Vorfahren beschützen.

source: &kgoldrunner; Default
de: Standard für &kgoldrunner;

source: Gives you the default &kgoldrunner; theme, with red bricks and gray concrete.
de: Die übliche &kgoldrunner;-Landschaft mit roten Ziegeln und grauem Beton.

source: Geek City
de: Computer-Stadt

source: Our hero is trapped inside a computer. Will he escape when he finally reaches the last level?
de: Der Held ist in einem Computer gefangen. Kann er mit dem Erreichen der letzten Ebene entkommen?

source: Nostalgia
de: Nostalgie (rot)

source: Recalls the days of the original Apple II and Commodore 64 game, as it was when you plugged your machine into your TV set &mdash; otherwise you had a monochrome monitor. For those who do not remember such heroic days, this is not an exact reproduction, but it gives you a general idea. For example the hero was all white back then, but today he is blue.
de: Erinnert an die Tage der originalen Apple-II- und Commodore-64-Spiele, als die Rechner noch an den Fernseher angeschlossen werden mussten - anderenfalls stand nur ein monochromer Monitor zur Verfügung. Für diejenigen, die sich an diese heroischen Zeiten nicht erinnern: das Design ist keine exakte Reproduktion, gibt aber eine gute Ahnung. Beispielsweise war der Held damals schwarz-weiß gehalten, während er heute blau ist.

source: Nostalgia Blues
de: Nostalgie (blau)

source: Recalls the Apple II game, where the bricks and concrete were a nice blue color, the hero was white, the enemies had white pants and orange (flesh-tint) tops and the gold was white boxes with orange panels. The whole effect was fuzzier (a sort of hardware anti-aliasing), which made the bricks look almost three-dimensional &mdash; difficult to recreate on today's pin-sharp monitors.
de: Erinnert an das Apple-II-Spiel, in dem die Steine und der Beton eine schöne blaue Farbe hatten. Der Held war weiß und die Feinde hatten weiße Hosen und orangene Oberteile, das Gold bestand aus weißen Kästen mit orangenen Rändern. Das ganze Bild war wesentlich unschärfer (eine Art Hardware-Anti-Aliasing), was dem Bild einen gewissen 3D-Effekt verlieh - auf heutigen gestochen scharfen Monitoren nicht nachzubilden.

source: <guimenu>Settings</guimenu><guimenuitem>Play Sounds</guimenuitem>
de: <guimenu>Einstellungen</guimenu><guimenuitem>Klänge wiedergeben</guimenuitem>

source: Toggles the sounds on and off.
de: Schaltet die Klänge des Spiels ein bzw. aus.

source: <guimenu>Settings</guimenu><guimenuitem>Play Footstep Sounds</guimenuitem>
de: <guimenu>Einstellungen</guimenu><guimenuitem>Fußschritte als Klang wiedergeben</guimenuitem>

source: Toggles the sounds of footsteps on and off.
de: Schaltet die Klänge für Fußschritte im Spiel ein bzw. aus.

source: <guimenu>Settings</guimenu><guimenuitem>Demo At Start</guimenuitem>
de: <guimenu>Einstellungen</guimenu><guimenuitem>Demomodus zu Beginn</guimenuitem>

source: Toggles the startup demo on and off (see <link linkend="how-to-play">Starting the Game</link>).
de: Schaltet den Demomodus beim Aufruf von &kgoldrunner; ein bzw. aus (siehe <link linkend="how-to-play">Spielstart</link>)

source: <guimenu>Settings</guimenu><guimenuitem>Mouse Controls Hero</guimenuitem>
de: <guimenu>Einstellungen</guimenu><guimenuitem>Maussteuerung</guimenuitem>

source: Sets mouse control of the hero (see <link linkend="mouse-control">Moving Around</link>).
de: Der Held wird nur mit der Maus gesteuert (siehe <link linkend="mouse-control">Bewegungen</link>).

source: <guimenu>Settings</guimenu><guimenuitem>Keyboard Controls Hero</guimenuitem>
de: <guimenu>Einstellungen</guimenu><guimenuitem>Tastatursteuerung</guimenuitem>

source: Sets keyboard control of the hero (see <link linkend="keyboard-control">Keyboard Control</link>).
de: Der Held wird nur mit der Tastatur gesteuert (siehe auch <link linkend="keyboard-control">Tastatursteuerung</link>).

source: <guimenu>Settings</guimenu><guimenuitem>Hybrid Control (Laptop)</guimenuitem>
de: <guimenu>Einstellungen</guimenu><guimenuitem>Gemischte Steuerung (Laptop)</guimenuitem>

source: Sets hybrid control of the hero, for laptops, where the touchpad or other pointer device is used to guide the hero and the dig keys, on the keyboard, are used for digging left and right.
de: Der Held wird mit einer Mischung aus Maus und Tastatur gesteuert (für Laptops). Dabei wird das Touchpad zur Steuerung des Helden und die Tasten für das Graben verwendet.

source: <guimenu>Settings</guimenu><guimenuitem>Click Key To Move</guimenuitem>
de: <guimenu>Einstellungen</guimenu><guimenuitem>Fortwährende Bewegung</guimenuitem>

source: In keyboard mode, click a direction-key to start moving and keep on going until you click another key.
de: Im Tastaturmodus muss eine Richtungstaste zum fortwährenden Bewegen nur einmalig betätigt werden und das Anhalten geschieht durch Drücken einer anderen Taste.

source: <guimenu>Settings</guimenu><guimenuitem>Hold Key To Move</guimenuitem>
de: <guimenu>Einstellungen</guimenu><guimenuitem>Richtungstaste halten</guimenuitem>

source: In keyboard mode, hold down a direction-key to move and release it to stop.
de: Im Tastaturmodus muss eine Richtungstaste zum Bewegen gedrückt gehalten und diese zum Anhalten wieder gelöst werden.

source: <guimenu>Settings</guimenu><guimenuitem>Normal Speed</guimenuitem>
de: <guimenu>Einstellungen</guimenu><guimenuitem>Normalgeschwindigkeit</guimenuitem>

source: Sets normal game speed (10 units).
de: Verwendet die normale Spielgeschwindigkeit (10 Einheiten).

source: <guimenu>Settings</guimenu><guimenuitem>Beginner Speed</guimenuitem>
de: <guimenu>Einstellungen</guimenu><guimenuitem>Anfängergeschwindigkeit</guimenuitem>

source: Sets beginner game speed (5 units, half of normal speed).
de: Verwendet die Anfängergeschwindigkeit (5 Einheiten, also halbe Geschwindigkeit).

source: <guimenu>Settings</guimenu><guimenuitem>Champion Speed</guimenuitem>
de: <guimenu>Einstellungen</guimenu><guimenuitem>Profigeschwindigkeit</guimenuitem>

source: Sets champion game speed (15 units, 1.5 times normal speed).
de: Verwendet die Profigeschwindigkeit (15 Einheiten, also 1,5-fache Geschwindigkeit).

source: <shortcut><keycap>+</keycap></shortcut> <guimenu>Settings</guimenu><guimenuitem>Increase Speed</guimenuitem>
de: <shortcut><keycap>+</keycap></shortcut> <guimenu>Einstellungen</guimenu><guimenuitem>Geschwindigkeit erhöhen</guimenuitem>

source: Increases the game speed by one unit, up to a maximum of 20 units (twice normal speed). You can use the <keycap>+</keycap> key as a shortcut.
de: Erhöht die Geschwindigkeit um eine Einheit pro Tastendruck bis zu einem Maximalwert von 20 Einheiten (doppelte Geschwindigkeit). Als Kurzbefehl kann auch die Taste <keycap>+</keycap> verwendet werden.

source: <shortcut><keycap>-</keycap></shortcut> <guimenu>Settings</guimenu><guimenuitem>Decrease Speed</guimenuitem>
de: <shortcut><keycap>-</keycap></shortcut> <guimenu>Einstellungen</guimenu><guimenuitem>Geschwindigkeit verringern</guimenuitem>

source: Decreases the game speed by one unit, down to a minimum of 2 units (a fifth of normal speed). You can use the <keycap>-</keycap> key as a shortcut.
de: Verringert die Geschwindigkeit um eine Einheit. Das Minimum liegt bei 2 Einheiten (ein Fünftel der Normalgeschwindigkeit). Als Kurzbefehl kann auch die Taste <keycap>-</keycap> verwendet werden.

source: <guimenu>Settings</guimenu><guimenuitem>Configure Shortcuts...</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>Kurzbefehle festlegen ...</guimenuitem>

source: In the &kde; desktop this item allows you to change the keyboard assignments (&eg; for keyboard control of the hero) or to assign your own shortcut keys for menu items.
de: Dieser in der &kde;-Version enthaltene Eintrag ermöglicht die Änderung der Tastenzuordnungen (also &eg; der Tasten zur Steuerung des Helden) oder die Erstellung neuer Kurzbefehle für Menüeinträge.

source: The Help Menu
de: Das Menü Hilfe

source: Contains the following standard &kde; Help Menu items:
de: Folgende Standardeinträge des &kde;-Hilfemenüs sind enthalten:

source: The Game Editor
de: Der Spiel-Editor

source: Getting Started with the Editor
de: Einführung zum Editor

source: Creating a Game
de: Erstellen eines Spiels

source: Before you create or edit a &kgoldrunner; level, you must create a game in which to save it. Use <guimenuitem>Create Game</guimenuitem> on the <guimenu>Editor</guimenu> menu. If you forget, you will be reminded.
de: Bevor eine Ebene von &kgoldrunner; verändert oder erstellt werden kann, muss ein Spiel erstellt werden, um darin die Ebenen zu speichern. Hierzu wird <menuchoice><guimenu>Editor</guimenu><guimenuitem>Spiel erstellen ...</guimenuitem></menuchoice> verwendet. Ggf. wird man auch daran erinnert.

source: The most important decisions to make when creating a game are to choose the rules you are going to follow (<quote>Traditional</quote> or <quote>&kgoldrunner;</quote>, see <link linkend="choice-of-rules">Choice of Rules</link>) and to choose a unique 1-5 character file name prefix for your game and levels. You also need a name and description for your game, but those can easily be changed later.
de: Die wichtigsten Entscheidungen beim Erstellen eines Spiels sind die Auswahl der Regeln („herkömmlich“ oder „&kgoldrunner;“, siehe <link linkend="choice-of-rules">Auswahl der Spielregeln</link>) und das Bestimmen eines Präfixes mit maximal 5 Buchstaben für das Spiel und die Ebenen. Der Name und die Beschreibung für das Spiel können auch später noch verändert werden.

source: The prefix is used internally by &kgoldrunner; to identify level files, high score files and saved games. You can use your initials as a prefix provided they are not the same as a &kgoldrunner; prefix. So far, the prefixes <quote>level</quote>, <quote>plws</quote>, <quote>wad</quote>, <quote>plwv</quote>, <quote>sot</quote>, <quote>cnt</quote>, <quote>CM</quote>, <quote>tute</quote> and <quote>tutea</quote> have been used.
de: Da das Präfix von &kgoldrunner; intern zur Identifikation der Ebenendateien, Bestenlisten und für gespeicherte Spiele verwendet wird, kann dieses Präfix nicht mehr nachträglich geändert werden. So können &eg; die Initialen als Präfix verwendet werden, solange diese nicht zufällig mit einem &kgoldrunner;-Präfix übereinstimmen. Die systemweite Spiele belegen bisher die Präfixe <userinput>level</userinput>, <userinput>plws</userinput>, <userinput>wad</userinput>, <userinput>plwv</userinput>, <userinput>sot</userinput>, <userinput>cnt</userinput>, <userinput>CM</userinput>, <userinput>tute</userinput> und <userinput>tutea</userinput>.

source: The four-letter <quote>tute</quote> prefix is reserved for tutorial games, which show the hint on each level as you play it. If you compose your own Tutorial game you could use the prefix <quote>tutex</quote>, to make it run as a tutorial but not get its files confused with those of the basic Tutorial or Advanced Tutorial (prefixes <quote>tute</quote> and <quote>tutea</quote>).
de: Das vierbuchstabige Präfix <userinput>tute</userinput> wird für das Einführungsspiel verwendet, das in jeder Ebene Tipps zum Spielen anzeigt. Falls ein weiteres Einführungsspiel erstellt werden soll, kann hierfür <userinput>tutex</userinput> als Präfix verwenden. So kann es als Einführung ausgeführt werden, ohne dass die Dateien mit der Einführung und der Einführung für Fortgeschrittene (die Präfixe <userinput>tute</userinput> bzw. <userinput>tutea</userinput>) vermischt werden.

source: Creating a Level
de: Eine Ebene erstellen

source: When you have a game set up, use <guimenuitem>Create Level</guimenuitem> on the <guimenu>Editor</guimenu> menu to start creating a level. It provides you with a blank playing area of 28x20 squares, with the hero at the top left. You can put the hero somewhere else if you prefer and you do not have to use the whole 28x20 area. Lots of interesting levels use smaller areas.
de: Nach der Erstellung eines Spiels kann über <menuchoice><guimenu>Editor</guimenu><guimenuitem>Ebene erstellen</guimenuitem></menuchoice> eine neue Ebene erstellt werden. Zunächst besteht die Ebene aus einem Hintergrund im Format 28x20 Rechtecke mit dem Helden oben links. Seine Startposition kann an eine beliebige Stelle verlegt werden. Außerdem kann die Spielfeldgröße verringert werden.

source: The minimum requirement for a level to be playable is to have a hero who is standing on something at the top of the playing area, but that is a trivial case. More realistically, you could have a maze to solve and some visible ladders leading to the top of the playing area, but no gold. You do not have to have enemies, gold, bars, hidden ladders or even bricks. There are many challenging levels that have no enemies or no bricks, however most levels have at least one gold, some enemies and some hidden ladders that appear when the last gold is collected.
de: Die Mindestanforderung an eine Ebene ist ein Held, der sich zu Beginn normalerweise im oberen Bereich des Spielfeldes befindet. Realistischer wird es, wenn zusätzlich ein zu lösendes Labyrinth mit ein paar sichtbaren Leitern vorliegt. Das Vorhandensein von Gegnern, Gold, Stangen, versteckten Leitern, Stangen und Ziegeln ist nicht zwingend erforderlich. Es gibt viele herausfordernde Ebenen, in denen es keine Gegner oder Ziegel gibt, jedoch sind in den meisten Ebenen mindestens ein Gold, ein paar Gegner und einige versteckte Leitern (erscheinen erst nachdem das letzte Goldstück eingesammelt wurde) vorhanden.

source: Editing and Testing
de: Bearbeiten und Testen

source: Editing a Level
de: Bearbeiten einer Ebene

source: Use <guimenuitem>Edit Level</guimenuitem> on the <guimenu>Editor</guimenu> menu to start editing an existing level or use <guimenuitem>Create Level</guimenuitem> to start editing a new level.
de: Mit <menuchoice><guimenu>Editor</guimenu><guimenuitem>Ebene bearbeiten ...</guimenuitem></menuchoice> (vorhandene Ebene) oder <menuchoice><guimenu>Editor</guimenu><guimenuitem>Ebene erstellen</guimenuitem></menuchoice> (neue Ebene) kann die Bearbeitung einer Ebene begonnen werden.

source: If you choose a System level, you are warned that you will have to save it in one of your own games. Otherwise, the default is to save the level back where it came from, but you can vary that.
de: Falls eine systemweite Ebene bearbeitet wird, erscheint eine Warnung, dass diese Ebene unter einem anderen Namen gespeichert werden muss. Ansonsten wird die Ebene unter ihrem bisherigen Namen gespeichert.

source: Painting Objects in a Level
de: Eine Ebene mit Objekten füllen

source: The picture below shows the edit toolbar, which appears when you first choose <guimenuitem>Create Level</guimenuitem> or <guimenuitem>Edit Level</guimenuitem> from the <guimenu>Editor</guimenu> menu and so change from Play to Edit mode. It disappears when you go back to Play mode. Note also that, in Edit mode, false bricks and hidden ladders are made visible in the playing area.
de: Das Bild unten zeigt die Editorwerkzeugleiste. Diese erscheint bei Auswahl von <menuchoice><guimenu>Editor</guimenu><guimenuitem>Ebene erstellen</guimenuitem></menuchoice> oder <menuchoice><guimenu>Editor</guimenu><guimenuitem>Ebene bearbeiten ...</guimenuitem></menuchoice>, denn dadurch wird vom Spiel- in den Bearbeitungsmodus gewechselt. Bei Rückkehr in den Spielmodus wird die Werkzeugleiste ausgeblendet. Im Bearbeitungsmodus werden falsche Steine und versteckte Leitern im Spielfeld angezeigt.

source: The three icons on the left of the edit toolbar have the same actions as the menu options <guimenuitem>Create Level</guimenuitem>, <guimenuitem>Edit Level</guimenuitem> and <guimenuitem>Save Edits</guimenuitem>. The other eleven icons are for editing and painting objects in your level.
de: Die drei Symbole links in der Werkzeugleiste stehen für die gleichen Aktionen wie die Menübefehle <guimenuitem>Ebene erstellen</guimenuitem>, <guimenuitem>Ebene bearbeiten ...</guimenuitem> und <guimenuitem>Änderungen speichern ...</guimenuitem>. Die anderen elf Symbole dienen zum Zeichnen von Objekten und deren Bearbeitung.

source: From left to right the other eleven icons are <guiicon>Name/Hint </guiicon> (light bulb), <guiicon>Erase</guiicon> (background), <guiicon>Hero</guiicon>, <guiicon>Enemy</guiicon>, <guiicon>Brick</guiicon> (can dig), <guiicon>Concrete</guiicon> (cannot dig), <guiicon>Trap</guiicon> (also known as a false brick or fall-through brick), <guiicon>Ladder</guiicon>, <guiicon>H Ladder</guiicon> (hidden ladder), <guiicon>Bar</guiicon> (or pole) and <guiicon>Gold</guiicon>. The graphics for these icons, except for the light bulb, are copied from whatever &kgoldrunner; theme you are using.
de: Von links nach rechts bedeuten die Symbole <guiicon>Name/Tipp</guiicon> (Lampe), <guiicon>Löschen</guiicon> (Hintergrund), <guiicon>Held</guiicon>, <guiicon>Gegner</guiicon>, <guiicon>Ziegel</guiicon> (lässt sich durchgraben), <guiicon>Beton</guiicon> (lässt sich nicht durchgraben),<guiicon>Falle</guiicon> (zum Durchfallen), <guiicon>Leiter</guiicon>, <guiicon>H-Leiter</guiicon> (versteckte Leiter), <guiicon>Stange</guiicon> und <guiicon>Goldbarren</guiicon>. Die Grafiken (ausgenommen der Lampe) werden aus dem verwendeten &kgoldrunner;-Design verwendet.

source: <screeninfo>Editing a level</screeninfo>
de: <screeninfo>Eine Ebene bearbeiten</screeninfo>

source: <phrase>Editing a level</phrase>
de: <phrase>Eine Ebene bearbeiten</phrase>

source: The <guiicon>Name/Hint</guiicon> icon pops up a dialog in which you can create or edit your level's name and hint. Both are optional, but they are essential for tutorial levels and it is usual to provide them with very difficult levels, such as in Championship games (see the <quote>Vengeance of Peter W</quote> game).
de: <guiicon>Name/Tipp</guiicon> zeigt ein Fenster an, in dem der Namen der Ebene und ein Tipp eingegeben werden kann. Beide sind optional, aber wichtig für Einführungsebenen. Bei sehr schwierigen Ebenen wie für Wettkämpfe ist es üblich, Tipps hinzuzufügen (siehe auch „Die Rache des Peter W.“).

source: When you click on one of the other 10 icons, the mouse becomes a <quote>brush</quote> that paints that icon. Initially the brush is set to <quote>brick</quote>.
de: Wenn auf eines der weiteren 10 Symbole geklickt wird, verwandelt sich der Mauszeiger in einen „Pinsel“, der das entsprechende Symbol zeichnet. Anfangs zeichnet der Pinsel „Stein“.

source: You paint either by pointing and clicking the &LMB;, to place a single object in a square, or by holding the &LMB; down and dragging the mouse, to fill a line or area, such as a long ladder, a large block of bricks or a concrete floor. Painting stops wherever you release the mouse button. If you make a mistake, you can use the &RMB; to erase it, or you can select the <guiicon>Erase</guiicon> icon and draw with that.
de: Die einzelnen Objekte werden durch einen Klick mit der linken Maustaste „gezeichnet“. Bleibt die linke Maustaste gedrückt, können Linien oder größere Bereiche „gezeichnet“ werden und dient u. a. zum „Zeichnen“ einer langen Leiter, eines Mauerstücks oder eines Betonboden. Sobald die Maustaste losgelassen wird, wird das Zeichnen beendet. Fehlerhafte Objekte können mit einem Klick der rechten Maustaste oder das Symbol <guiicon>Löschen</guiicon> gelöscht werden.

source: The hero icon works differently, because there can be only one hero. When you paint the hero, he moves from his previous position to wherever you release the mouse button.
de: Das Heldensymbol funktioniert etwas anders, da es nur eine Position des Helden geben kann. Daher wird beim Klicken der Held an die neue Position verschoben.

source: Saving Your Work
de: Das Sichern der Arbeitsergebnisse

source: When you have finished painting, save your work using the <guiicon>disk</guiicon> icon or <guimenuitem>Save Edits</guimenuitem> in the <guimenu>Editor</guimenu> menu or <guimenuitem>Save Edits</guimenuitem> in the <guimenu>Game</guimenu> menu. You must always save into your own games, never into the System games.
de: Nach Fertigstellung wird die Arbeit durch Klicken auf das <guiicon>Disketten</guiicon>-Symbol bzw. über das Menü durch Auswahl von <menuchoice><guimenu>Editor</guimenu><guimenuitem>Änderungen speichern ...</guimenuitem></menuchoice> oder <menuchoice><guimenu>Spiel</guimenu><guimenuitem>Änderungen speichern ...</guimenuitem></menuchoice> gespeichert. Es können nur eigene Spiele gespeichert werden (keine systemweiten).
