Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdegames/kgoldrunner.po
Languages: de

source: You can dodge an oncoming enemy by digging a hole, waiting for him to fall in and then running quickly over his head. At the same time you can collect any gold he was carrying. Usually you can dig two holes to capture and run over two enemies who are close together, but this rarely works if the enemies are separated or there are more than two of them.
de: Ein Feind wird „ausgetrickst“, indem ein Loch gegraben und über den Kopf des hineingefallenen Feindes hinweg gelaufen wird. Gleichzeitig wird ihm dabei alles von ihm getragene Gold abgenommen. Wenn die Feinde dicht genug beieinander sind, können bis zu zwei Feinde in zwei Löchern gleichzeitig gefangen werden. Das funktioniert in der Regel nicht, wenn der Abstand der Feinde zu groß oder die Anzahl größer als zwei ist.

source: You can kill enemies by digging enough holes in their path. It usually takes two or more holes to kill one enemy and up to eight or more holes to kill four or five. When enemies die, they reappear immediately, either where they started the level or near the top of the playing area, depending on whether the game follows <quote>&kgoldrunner;</quote> or <quote>Traditional</quote> rules and settings (see <link linkend="choice-of-rules">Choice of Rules</link>).
de: Die Feinde können auch durch genügend Löcher auf ihrem Weg getötet werden. Normalerweise werden zwei oder mehr Löcher für das Töten eines Feindes und bis zu acht oder mehr Löcher für vier bis fünf Feinde benötigt. Die getöteten Feinde erscheinen sofort wieder (entweder an ihrem Startplatz oder oben im Spielfeld). Das hängt davon ab, ob in den Einstellungen die „&kgoldrunner;“-Regeln oder „herkömmlichen“ Regeln gewählt wurden (siehe auch <link linkend="choice-of-rules">Auswahl der Spielregeln</link>).

source: Finally, in many levels the gold is not immediately accessible and you must dig to get to it. Some of these digging puzzles are quite complex and you must work out a digging sequence then perform it in limited time before you can complete the level.
de: In vielen Ebenen ist das Gold nicht auf Anhieb erreichbar und es muss ein Zugang gegraben werden. Einige dieser Grabungsebenen sind sehr komplex und die Grabungen müssen in einem limitierten Zeitraum durchgeführt werden, um die Ebene abschließen zu können.

source: The Rules of Digging
de: Regeln beim Graben

source: You click the <mousebutton>Left</mousebutton> or <mousebutton>Right</mousebutton> mouse button, to dig a hole to the left or right, or use the <keycap>Z</keycap>, <keycap>C</keycap>, <keycap>U</keycap> or <keycap>O</keycap> keys. Only bricks can be dug, not anything else. The hole will appear in the floor on one side or the other (&ie; below and to the left or right of the hero). You can be running, standing or falling when you dig. There must be an empty space or hole above the brick (&ie; no digging under a ladder, bar, gold, brick, concrete, false brick or enemy).
de: Die linke oder rechte Maustaste wird gedrückt, um ein Loch links oder rechts vom Helden zu graben (oder auch die Tasten <keycap>Z</keycap>, <keycap>C</keycap>, <keycap>U</keycap> oder <keycap>O</keycap>). Gegraben werden kann nur in Stein. Das Loch erscheint auf einer Seite des Helden (also links oder rechts unterhalb des Helden). Es kann im Laufen, beim Stehen oder beim Fallen gegraben werden. Über dem Stein muss ein freier Raum sein (also ist das Graben unter einer Leiter, einem Balken, einem Goldklumpen, Stein, Beton, falschem Stein oder einem Feind nicht möglich).

source: The hero can move in any direction through dug holes, including falling right through a hole to escape an enemy. After a short time, dug holes close up, so you must use them quickly. Plan your digging in advance. There is no time to stop and think while you dig.
de: Der Held kann sich in beliebiger Richtung durch ein Loch bewegen, also auch hindurchfallen, um einem Feind zu entkommen. Nach kurzer Zeit füllt sich das Loch wieder, also muss man es zügig verwenden. Das Graben sollte vorher geplant worden sein, da für das Planen zwischendurch zu wenig Zeit zur Verfügung steht.

source: Enemies are always captured if they fall into a dug hole and will always climb UP to get out of it. Their time in the hole is less than the time the hole stays open, so to kill enemies you usually have to dig several holes in quick succession. Enemies always give up gold as they fall into a hole, so you can quickly run onto the enemy's head and grab the gold before he climbs out.
de: Feinde sind in Löchern zunächst immer gefangen und klettern immer aufwärts, um zu entkommen. Ihre Verweilzeit im Loch ist kürzer als die „Lebensdauer“ eines Loches, daher benötigt man in der Regel mehrere Versuche, um einen Feind zu töten. Feinde lassen in einem Loch ihr Gold fallen, daher kann der Held schnell über deren Kopf laufen, um den Goldklumpen einzusammeln.

source: Enemies will never fall down through a hole from above, but depending on the game rules and <guimenu>Settings</guimenu> (see <link linkend="choice-of-rules">Choice of Rules</link>), they can run horizontally into a dug hole and not be captured and can fall from there or run into another hole or run out of the hole. Several levels that follow <quote>Traditional</quote> rules depend on an enemy being able to run through a hole. Some levels that follow <quote>&kgoldrunner;</quote> rules depend on an enemy NOT being able to run through a hole.
de: Feinde fallen nie von oben durch ein gegrabenes Loch, können aber abhängig von den <guimenu>Einstellungen</guimenu> für die <link linkend="choice-of-rules">Auswahl der Spielregeln</link> eventuell horizontal in ein gegrabenes Loch laufen und nicht gefangen werden, sondern von dort in ein weiteres Loch fallen oder aus dem Loch herauslaufen. In einigen Ebenen, die den herkömmlichen Regeln folgen, ist es notwendig, dass die Feinde durch ein Loch laufen können. In einigen Ebenen, die den „&kgoldrunner;“-Regeln folgen, ist es notwendig, dass Feinde genau dies NICHT können.

source: Winning and Losing the Game
de: Das Spiel gewinnen oder verlieren

source: You win by completing the last level in the game. You lose when your last life is gone. Either way, if you have achieved one of the ten highest scores for that game, you can record your achievement in the <quote>&kgoldrunner; Hall of Fame</quote>.
de: Ein Spiel ist gewonnen, wenn die letzte Ebene abgeschlossen ist. Ein Spiel ist verloren, wenn der Held sein letztes Leben verloren hat. Falls eine der zehn höchsten Punktzahlen für dieses Spiel erreicht wurde, ist die Aufnahme in der <guimenuitem>Bestenliste</guimenuitem> von &kgoldrunner; vorgesehen.

source: Recordings, Replays and Solutions
de: Aufnahmen, Wiedergaben und Lösungen

source: All levels in games are recorded as you play, so you can replay any level you have previously played. Also, some levels have recorded solutions, which may help you work out how to win them. Just use the <guimenu>Move</guimenu> menu and items <guimenuitem>Show A Solution</guimenuitem>, <guimenuitem>Instant Replay</guimenuitem>, <guimenuitem>Replay Last Level</guimenuitem> and <guimenuitem>Replay Any Level</guimenuitem>. The solutions and replays can be interrupted at any time by clicking with the mouse on the playing area, pressing the spacebar or selecting a menu item or shortcut (such as <menuchoice><guimenu>Game</guimenu> <guimenuitem>New Game...</guimenuitem></menuchoice>).
de: Alle Ebenen werden sofort aufgenommen und können deshalb sofort nach dem Spielen wiedergegeben werden. Manche Ebenen besitzen aufgenommene Lösungsmöglichkeiten, die dabei helfen sollen, die Ebene erfolgreich abzuschließen. Hierzu stehen im Menü <guimenu>Zug</guimenu> die Schaltflächen <guimenuitem>Eine Lösung wiedergeben</guimenuitem>, <guimenuitem>Sofortige Wiedergabe</guimenuitem>, <guimenuitem>Letzte Ebene wiedergeben</guimenuitem> und <guimenuitem>Beliebige Ebene wiedergeben</guimenuitem> zur Verfügung. Die Lösungen und Wiedergaben können jederzeit unterbrochen werden, indem mit der Maus auf das Spielfeld geklickt, die <keycap>Leertaste</keycap> gedrückt oder das Menü bzw. Tastenkürzel (z. B. <menuchoice><guimenu>Spiel</guimenu><guimenuitem>Neues Spiel ...</guimenuitem></menuchoice>) verwendet wird.

source: <guimenuitem>Instant Replay</guimenuitem> and <guimenuitem>Replay Last Level</guimenuitem> let you continue playing after an interruption. So if things are not going well, you can use <guimenuitem>Instant Replay</guimenuitem>, interrupt the replay at some point and then try another approach. Or if the hero died already, you can use <guimenuitem>Replay Last Level</guimenuitem> in the same way. These features can help you build up a solution to a difficult level in stages, but using them will invalidate any high score you might be working on.
de: Bei <guimenuitem>Sofortige Wiedergabe</guimenuitem> und <guimenuitem>Letzte Ebene wiedergeben</guimenuitem> kann das Spiel nach der Unterbrechung fortgesetzt werden. Sollte das Spiel nicht erfolgsversprechend verlaufen sein, kann <guimenuitem>Sofortige Wiedergabe</guimenuitem> verwendet, die Wiedergabe an einem bestimmten Punkt unterbrochen und eine andere Lösungsmethode versucht werden. Ist der Held bereits getötet worden, kann <guimenuitem>Letzte Ebene wiedergeben</guimenuitem> auf die gleiche Weise verwendet werden. Dies ermöglicht den stufenweisen Aufbau einer <emphasis>Lösung</emphasis> für eine schwierige Ebene (jedoch kann kein Eintrag in die Bestenliste mehr erfolgen).

source: Scoring
de: Punktevergabe

source: Start with 5 lives.
de: Das Spiel beginnt mit fünf Leben.

source: Lose a life and repeat a level when the hero dies
de: Ein Leben wird verloren und die Ebene muss wiederholt werden, wenn der Held stirbt.

source: Gain a life when you complete a level
de: Für den erfolgreichen Abschluss einer Ebene gibt es ein Leben dazu.

source: 75 points for trapping an enemy
de: 75 Punkte gibt es für einen gefangenen Feind.

source: 75 points for killing an enemy
de: 75 Punkte gibt es für einen getöteten Feind.

source: 250 points for collecting gold
de: 250 Punkte gibt es für eingesammeltes Gold.

source: 1500 points for completing a level
de: 1500 Punkte gibt es für eine abgeschlossene Ebene.

source: Choice of Rules
de: Auswahl der Spielregeln

source: Most of the rules of &kgoldrunner; are covered in the section <link linkend="how-to-play">How to Play</link>, however there are two major rule settings that affect the style of play: known as <quote>Traditional</quote> and <quote>&kgoldrunner;</quote>. It is important to know which settings are in force when you are playing a game. &kgoldrunner; automatically chooses the correct settings for a game when you play one of its levels and the rules for each game are shown in the <link linkend="level-selection-dialog">Level Selection</link> dialog box.
de: Die meisten Regeln für &kgoldrunner; werden im Abschnitt <link linkend="how-to-play">Spielregeln</link> erläutert. Es gibt darüber hinaus zwei wichtige Regeleinstellungen, die den Spielstil beeinflussen: die Varianten heißen <quote>herkömmliche</quote> und <quote>&kgoldrunner;</quote>-Regeln. Es ist wichtig zu wissen, welche der beiden Varianten aktiv ist. &kgoldrunner; wählt automatisch die entsprechende Einstellung des Spiels sobald eine Ebene davon gespielt wird und die jeweiligen Regeln sind im Fenster <link linkend="level-selection-dialog">Ebenenauswahl</link> ersichtlich.

source: The main difference between <quote>Traditional</quote> and <quote>&kgoldrunner;</quote> settings is the method by which the enemies choose a path to the hero.
de: Der Hauptunterschied zwischen „herkömmlichen“ und „&kgoldrunner;“-Regeln besteht in den Bewegungen der Feinde.

source: In the <quote>Traditional</quote> search method, enemies look for vertical paths (ladders and falls) and they try to stay higher than the hero or at the same height. They go below him only as a last resort. The enemies make no attempt to chase the hero in the horizontal direction until they are at the same height and can find a horizontal path. This leads to situations where you can <quote>control</quote> enemies who are far away from you and make them work for you or at least keep out of your hair.
de: Bei der „herkömmlichen“ Suchmethode passen die Feinde auf vertikale Wege (Leitern und Abgründe) auf und versuchen oberhalb oder auf einer höheren Ebene als der Held zu bleiben. Unterhalb des Helden begeben sie sich nur ausnahmsweise. Erst wenn sie sich auf gleicher Höhe wie der Held befinden und es einen horizontalen Verbindungsweg gibt, jagen sie den Helden. Daher kann der Held durch geschickte Bewegungen die Bewegungen der Feinde „steuern“ und sie sich zumindest vom Leibe halten.

source: The <quote>&kgoldrunner;</quote> method searches alternately for horizontal and vertical paths, which tends to keep the enemies over your side of the playing area and at about the same height (&ie; they are more aggressive and not so easy to manipulate). That leads to a more action-packed game, but with less opportunity for strategy and puzzle-solving. However the <quote>State of Terror</quote> game, added in 2007, uses <quote>&kgoldrunner;</quote> rules and has plenty of puzzles to solve while you are on the run. That is why it is such a difficult game.
de: Die „&kgoldrunner;“-Methode verwendet alternativ horizontale und vertikale Wege, daher befinden sich die Feinde meistens im gleichen Bereich des Spielfelds wie der Held und auf der gleichen Ebene (sie sind also aggressiver und nicht so leicht zu manipulieren). Damit ist das Spiel aktionsgeladener, aber die Strategie und das Rätsellösen kommen etwas zu kurz. Das 2007 hinzugefügte Spiel „Terrorstaat“ richtet sich nach „&kgoldrunner;“-Regeln und beinhaltet viele möglichst schnell zu lösende Rätsel. Darum ist es so ein schwieriges Spiel.

source: The other differences are listed below:
de: Weitere Unterschiede der beiden Varianten:

source: In <quote>&kgoldrunner;</quote> play, the hero and enemies move at fixed speeds in every level and bricks always take the same time to close. In <quote>Traditional</quote> play, the game speed depends on the number of enemies in a level. The more enemies, the slower they run. The hero also becomes slower, but not so noticeably.
de: Im „&kgoldrunner;“-Spiel bewegen sich die Feinde und der Held in jeder Ebene immer gleich schnell und gegrabene Löcher bleiben die gleiche Zeitspanne offen. Beim „herkömmlichen“ Spiel hängt die Geschwindigkeit der Feinde von ihrer Anzahl ab. Je mehr Feinde, desto langsamer deren Bewegungen. Auch der Held bewegt sich (kaum merklich) langsamer.

source: In <quote>Traditional</quote> play, enemies always collect gold nuggets when they run into them. In <quote>&kgoldrunner;</quote> play, it is a random choice. The enemies drop nuggets after a random time in both types of play.
de: Im „herkömmlichen“ Spiel sammeln die Feinde jeden Goldklumpen ein, in den sie „rennen“. Im „&kgoldrunner;“-Spiel wird das Sammeln vom Zufall gesteuert. Das Ablegen des Goldes wird in beiden Varianten vom Zufall bestimmt.

source: Enemies can run horizontally through holes in <quote>Traditional</quote> play but not in <quote>&kgoldrunner;</quote> play. The trick in several <quote>Traditional</quote> levels depends on releasing an enemy from behind a brick wall. When you dig away the bricks, he runs out through the hole. In some <quote>&kgoldrunner;</quote> levels, on the other hand, you must hide inside or behind a dug brick to escape an enemy.
de: Feinde können sich nur im „herkömmlichen“ Spiel horizontal durch Löcher bewegen. In mehreren Ebenen des „herkömmlichen“ Spiels basiert der entscheidende Trick darauf. Man lässt einen Feind frei, indem man an geeigneter Stelle die Steine entfernt. In einigen der „&kgoldrunner;“-Ebenen muss man sich jedoch in oder hinter gegrabenen Löchern verstecken, um einem Feind zu entkommen.

source: When enemies die in <quote>&kgoldrunner;</quote> play, they go back to where they started the level. In <quote>Traditional</quote> play, they reappear at a random place near the top of the playing area. This makes a big difference, especially in levels where you have to get enemies to fetch nuggets down for you, but also because the enemies keep falling down onto you as fast as you can kill them.
de: Im „&kgoldrunner;“-Spiel erscheint ein gestorbener Feind an der Stelle, an der er sich beim Spielstart befand. Im „herkömmlichen“ Spiel erscheint er an einer beliebigen Stelle oben im Spielfeld wieder. Das ist ein großer Unterschied in Spielen, in denen man darauf angewiesen ist, dass Feinde bestimmte Goldklumpen einsammeln, aber auch in solchen, in denen die Feinde schneller auf den Helden herunterfallen als er sie töten kann.

source: The Level Selection Dialog
de: Ebenenauswahl

source: Using the Level Selection Dialog Box
de: Ebenenauswahl verwenden

source: <screeninfo>The Level Selection dialog</screeninfo>
de: <screeninfo>Die Ebenenauswahl</screeninfo>

source: <phrase>The Level Selection dialog</phrase>
de: <phrase>Die Ebenenauswahl</phrase>

source: This box appears when you select the <guimenuitem>New Game</guimenuitem> action and also when you select items from the <guimenu>Editor</guimenu> menu or replays from the <guimenu>Move</guimenu> menu. You use it to choose a game and a level to play, replay, edit, save, move, re-number or delete. The main button at the bottom is the <guibutton>OK</guibutton> button. Its label changes according to what you are doing: in this case choosing a game and level to play.
de: Dieses Fenster erscheint nach Auswahl von <guimenuitem>Neues Spiel</guimenuitem> oder von Einträgen im Menü <guimenu>Editor</guimenu>. Hier kann ein Spiel zum Spielen, Bearbeiten, Speichern, Verschieben oder Entfernen ausgewählt werden. Der Hauptknopf ist <guibutton>OK</guibutton>. Seine Beschriftung hängt vom gewählten Menüeintrag ab. Im abgebildeten Fall wird eine Ebene eines Spiels zur Bearbeitung gewählt.

source: Selecting a Game
de: Ein Spiel auswählen

source: There are several <quote>System</quote> games that come with the &kgoldrunner; release and you can add your own games by using the editor. All these games appear in the list at the top of the dialog box, grouped by level of difficulty. The tutorial games appear last in the list and the games of normal skill appear first. To select one of the games, just click on its name.
de: Mehrere „systemweite“ Spiele werden bereits bei &kgoldrunner; mitgeliefert und weitere eigene Spiele können mit dem Editor erstellt und einfügt werden. Alle Spiele in dieser Liste werden in der Reihenfolge des Schwierigkeitsgrades angezeigt. Spiele mit einfachem Schwierigkeitsgrad stehen oben in der Liste und das Einführungsspiel als Letztes. Das jeweilige Spiel wird durch einen Klick auf dessen Namen ausgewählt

source: The list shows what rule settings apply to each game (see <link linkend="choice-of-rules">Choice of Rules</link>) and how many levels there are. When you select a game, a box lower down the screen shows you further information about that game.
de: Die Liste zeigt an, welche Regeln angewandt werden (siehe auch <link linkend="choice-of-rules">Auswahl der Spielregeln</link>) und wie viele Ebenen es gibt. Bei Auswahl eines Spiels werden zusätzliche Informationen zum Spiel in einem Kasten weiter unten angezeigt.

source: Selecting a Level
de: Auswahl einer Ebene

source: You can choose to start a game at any level, but it is best to start at level 1 and work up, especially if you are going for a high score. In general, the higher numbered levels are more difficult.
de: Ein Spiel kann in einer beliebigen Ebene gestartet werden; es wird jedoch empfohlen, mit der Ebene 1 zu beginnen und sich hoch zu arbeiten - besonders, wenn eine hohe Punktzahl erreicht werden soll. Generell sind höhere Ebenen schwieriger.

source: When you start the level selection dialog, the default level will be something reasonable, such as the last level you played or edited. You can select another level by using the spinbox arrows, by typing the level number into the spinbox or by moving the slider. The arrows at the ends of the slider increase or decrease the number by one. Also you can drag the slider with the left mouse button held down and change the level number rapidly. Or you can change the level number in steps of 10 by clicking in the space above or below the slider handle.
de: Beim Aufruf des Fensters zur Ebenenauswahl wird eine bereits gespielte oder bearbeitete Ebene als Voreinstellung angezeigt. Eine Ebene wird durch Verschieben des Schiebereglers oder durch Eintippen der gewünschten Nummer gewählt. Die Pfeile am Ende erhöhen bzw. verringern die Nummer um eins. Die Zahl kann schnell geändert werden, indem der Schieberegler mit gedrückter Maustaste bewegt wird. Durch Klicken ober- oder unterhalb des Einstellhebels wird die Nummer jeweils um zehn geändert.

source: As the level number changes, a preview of the level appears in the small preview window and the level's name (if it has one) also appears.
de: Beim Ändern der Nummer erscheint eine Vorschau der Ebene im Vorschaufenster und ebenfalls der Name der Ebene (falls vorhanden).

source: Completing your Selection
de: Vervollständigen der Auswahl

source: When you have chosen a game and level, just click the main button at the bottom and proceed with your edit, play or replay.
de: Nach der Auswahl eines Spiels und einer Ebene muss lediglich auf den Hauptknopf im unteren Teil des Fensters geklickt werden, um mit der Bearbeitung, dem Spielen oder der Wiedergabe zu beginnen.

source: Until you do that, nothing changes, so you can always click <guibutton>Cancel</guibutton> and go back to what you were doing earlier. Note that the game action is frozen while the dialog box is active, so you can continue playing where you left off if you choose <guibutton>Cancel</guibutton>.
de: Bis dahin wird nichts geändert, so kann jederzeit durch <guibutton>Abbrechen</guibutton> wieder zum vorherigen Zustand zurückgekehrt werden. Solange der Dialog angezeigt wird, ist das laufende Spiel unterbrochen, sodass nach <guibutton>Abbrechen</guibutton> dort weitergemacht werden kann, wo aufgehört wurde.

source: Saving Changes
de: Änderungen speichern

source: If you select an action on the <guimenu>Game</guimenu>, <guimenu>Editor</guimenu> or <guimenu>Move</guimenu> menu and you were previously editing and had not saved your changes, you will get a message asking you to save, abandon or continue your work. Neither the new action nor its dialog will begin until you have made a decision about your previous work.
de: Falls eine Aktion aus dem Menü <guimenu>Spiel</guimenu>, <guimenu>Editor</guimenu> oder <guimenu>Zug</guimenu> gewählt wurde und eine Ebene mit ungespeicherten Änderungen vorliegt, erscheint ein Fenster mit den Wahlmöglichkeiten <guibutton>Speichern</guibutton>, <guibutton>Abbrechen</guibutton> und <guibutton>Weiterarbeiten</guibutton>. Weder die neue Aktion noch das zugehörige Fenster werden gestartet, bis eine Entscheidung über die bisherige Arbeit getroffen wurde.

source: Playing or Editing <quote>Any</quote> Level
de: Eine <emphasis>beliebige</emphasis> Ebene spielen oder bearbeiten
