Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdegames/kgoldrunner.po
Languages: de

source: Peter Wadham composed the sound effects in 2008 and Luciano Montanaro incorporated the sounds into the KGoldrunner program.
de: Peter Wadham erstellte die Klangeffekte im Jahr 2008 und Luciano Montanaro hat sie in &kgoldrunner; eingepflegt.

source: Special thanks are due to Mauricio Piacentini and Dmitry Suzdalev, who converted &kgoldrunner; to &Qt; 4 and &kde; 4, and to the many graphics artists who contributed to the new SVG graphics and themes in the &kde; 4 version: especially Mauricio Piacentini for the <quote>Default</quote> theme and the new runners, Johann Ollivier Lapeyre for the ladders and bars, Eugene Trounev for the <quote>Geek City</quote> and <quote>Treasure of Egypt</quote> themes and, last but not least, Luciano Montanaro for the two <quote>Nostalgia</quote> themes, the <quote>Black on White</quote> accessibility theme, improvements to the runners, multiple backgrounds and several other ideas.
de: Ein besonderer Dank gilt Mauricio Piacentini und Dimitry Suzdalev, die &kgoldrunner; auf &Qt;4 und &kde;4 portiert haben sowie den vielen Grafikdesignern, die zu den neuen SVG-Grafiken und Designs der &kde;4-Version beigetragen haben; besonders Mauricio Piacentini für das Design „Standard“ und den neuen Helden, Johann Ollivier Lapeyre für die Leitern und Stangen, Eugene Trounev für das Design „Computer-Stadt“ und „Schatz von Ägypten“ und zuletzt Luciano Montanaro für die Designs „Nostalgie“ (rot und blau) und „Schwarz auf Weiß“, Verbesserungen des Helden, verschiedene Hintergründe und weitere Ideen.

source: CREDIT_FOR_TRANSLATORS
de: <para>Übersetzung: Frank Schütte <email>F.Schuette@t-online.de</email></para><para>Überarbeitung der Übersetzung: Johannes Obermayr <email>johannesobermayr@gmx.de</email></para>

source: Installation
de: Installieren

source: How to Obtain &kgoldrunner;
de: Erwerb von &kgoldrunner;

source: Compilation and Installation
de: Kompilieren und Installieren

source: Porting &kgoldrunner; to Other Platforms
de: &kgoldrunner; auf andere Plattformen portieren

source: &kgoldrunner; is written in C++, using &Linux; and the free-software version of the portable &Qt; object and &GUI; library. The current version can be compiled and run with &kde; 4 and &Qt; 4.
de: &kgoldrunner; wurde unter &Linux; mit der freien Version der &Qt;-Objekt- und -&GUI;-Bibliothek in C++ entwickelt. Die aktuelle Version kann mit &kde;4 und &Qt;4 kompiliert werden.

source: &kgoldrunner; depends on the &kde; libraries (kdelibs and kdegames), which have been ported to other platforms, and it is possible to obtain Open Source editions of &Qt; 4 for other platforms, so in principle it should be possible to compile, build and run &kgoldrunner; on platforms other than &Linux;.
de: &kgoldrunner; benötigt die &kde;-Bibliotheken (kdelibs und kdegames), die auf andere Plattformen portiert wurden. Es gibt ebenfalls eine Open-Source-Version von &Qt;4 für andere Plattformen, sodass es grundsätzlich möglich ist, &kgoldrunner; auf anderen Plattformen als &Linux; zu kompilieren und zu spielen.
