Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdegames/kgoldrunner.po
Languages: de

source: The &kgoldrunner; Handbook
de: Das Handbuch zu &kgoldrunner;

source: iandw.au at gmail com
de: iandw.au@gmail.com

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Frank</firstname><surname>Schütte</surname><affiliation><address><email>F.Schuette@t-online.de</email></address></affiliation><contrib>Übersetzung</contrib></othercredit><othercredit role="translator"><firstname>Johannes</firstname><surname>Obermayr</surname><affiliation><address><email>johannesobermayr@gmx.de</email></address></affiliation><contrib>Überarbeitung der Übersetzung</contrib></othercredit>

source: &kgoldrunner;, a game of action and puzzle solving. Run through the maze, dodge your enemies, collect all the gold and climb up to the next level.
de: &kgoldrunner; ist ein Action- und Rätselspiel. Es wird durch ein Labyrinth gelaufen, die Gegner ausgetrickst, Goldstücke eingesammelt und in die nächste Ebene geklettert.

source: Playing &kgoldrunner;
de: &kgoldrunner; spielen

source: Introduction
de: Einführung

source: Game type: Arcade, Strategy
de: Spielart: Arcade-Spiel, Strategiespiel

source: Number of players: One
de: Anzahl der Spieler: Einer

source: &kgoldrunner; is an action game where the hero runs through a maze and dodges enemies. You must guide the hero with the mouse or keyboard and collect all the gold nuggets, then you can climb up into the next level. Your enemies are also after the gold. Worse still, they are after you! They will kill you if they catch you!
de: &kgoldrunner; ist ein Action-Spiel, in dem der Held durch ein Labyrinth läuft und seine Feinde austrickst. Der Held wird mit der Maus oder Tastatur geführt, alle Goldklumpen müssen eingesammelt werden und schließlich wird zur nächsten Ebene geklettert. Die Feinde sind hinter dem Gold und dem Helden her. Wenn sie ihn fangen, wird er von ihnen getötet.

source: The problem is you have no weapon to kill <emphasis>them</emphasis>. All you can do is run away, dig holes in the floor to trap them or lure them into some area where they cannot hurt you. After a short time a trapped enemy climbs out of his hole, but if it closes before that, he will die and reappear somewhere else.
de: Der Held hat keine Waffen, um <emphasis>sie</emphasis> zu töten. Er kann lediglich weglaufen, Fallgruben in den Boden graben oder sie in Sackgassen locken. Nach einiger Zeit klettert ein gefangener Feind aus einem Loch heraus. Schließt es sich vorher, so stirbt er und erscheint an einer beliebigen Stelle erneut.

source: If you have never played before, try the <quote>Tutorial</quote> game, which teaches you the rules and basic skills. Then try the <quote>Initiation</quote> game. Experts might enjoy the <quote>Challenge</quote>, <quote>Vengeance of Peter W</quote>, <quote>Count</quote> or <quote>Curse of the Mummy</quote> games, but the <quote>Initiation</quote> game has 100 levels and some are very difficult. It is a good game for achieving a High Score.
de: Falls das Spiel zum ersten Mal gespielt wird, sollte ein Blick in die „Einführung“ geworfen werden. Sie enthält die Regeln und grundlegenden Techniken. Das Spiel „Spielaufnahme“ sollte dann versucht werden. Für Experten ist die „Herausforderung“ und „Die Rache des Peter W.“ interessant, aber auch die „Spielaufnahme“ verfügt bereits über 100 Ebenen, von denen einige sehr schwierig sind und sich für einen Eintrag in der Bestenliste gut eignet.

source: All those games use Traditional rules, which are similar to those used on early home-computers, such as the Apple II or Commodore 64. The <quote>&kgoldrunner;</quote> and <quote>State of Terror</quote> games use &kgoldrunner; rules, in which the enemies run faster and have a more aggressive search strategy than in Traditional rules. See <link linkend="choice-of-rules">Choice of Rules</link> for details.
de: Diese Spiele befolgen herkömmliche Regeln, ähnlich denen der ersten Heim-Computer wie dem Apple II oder Commodore 64. Die Spiele „&kgoldrunner;“ und „Terrorstaat“ richten sich nach den &kgoldrunner;-Regeln. Das heißt, die Feinde laufen schneller und verhalten sich aggressiver. Weitere Informationen hierzu können dem Abschnitt <link linkend="choice-of-rules">Wahl der Regeln</link> entnommen werden.

source: As you move to more advanced levels, you will find that &kgoldrunner; combines action, strategy, tactics and puzzle solving &mdash; all in one game. Good luck!
de: Bei höheren Ebenen kombiniert &kgoldrunner; immer mehr Aspekte von Action, Strategie, Taktik und Rätsel - alles in einem Spiel. Viel Glück.

source: A Typical Game
de: Ein typisches Spiel

source: Below is a typical game in progress. The hero is at level 4 in the Advanced Tutorial game. The window's lower part shows how many lives he has left and how many points he has scored. It also shows that there is a hint available for this level (as there always is in tutorial games) and that the action is stopped (while taking this snapshot), but can be continued by pressing <keycap>P</keycap> or &Esc;.
de: Unten wird ein typisches Spiel gezeigt. Der Held befindet sich in Ebene 4 der Einführung für Fortgeschrittene. Die Statusleiste zeigt die verbliebenen Leben sowie die erreichte Punktzahl. Sie zeigt weiterhin, dass in dieser Ebene ein Tipp verfügbar ist (wie bei jedem der Einführungsspiele) und dass das Spiel unterbrochen ist (für die Erstellung des Bildschirmfotos). Es kann durch Betätigen von <keycap>P</keycap> oder <keycap>Esc</keycap> fortgesetzt werden.

source: The hero started at the top left, dug a hole and dropped into a line of false bricks and gold where you can now see him falling. The enemy above him will fall into the hole, then climb out and be trapped up there till the end of the level. He could cause the hero some problems then, because that is where the hidden ladders appear when all the gold is gone. The hero has to use them to get to the next level.
de: Der Held hat links oben begonnen, grub dann ein Loch und fiel in eine Reihe falscher Steine und Gold (sein Fallen ist sogar noch zu sehen). Der Feind links oben wird in das Loch fallen, herausklettern und dann bis zum Ende der Ebene gefangen sein. Das könnte dem Helden ein Problem bereiten, da sich die versteckte Leiter zur nächsten Ebene dort befindet.

source: <screeninfo>&kgoldrunner; typical game</screeninfo>
de: <screeninfo>Typisches &kgoldrunner;-Spiel</screeninfo>

source: <phrase>&kgoldrunner; typical game</phrase>
de: <phrase>Typisches &kgoldrunner;-Spiel</phrase>

source: The enemy on the right is falling and carrying some gold. The third enemy is about to come down a ladder to chase the hero, who will have to dodge both enemies when he reaches the floor. This level also shows diggable bricks and undiggable concrete and has lots of traps (false bricks), which look just like ordinary bricks.
de: Der Feind rechts fällt gerade und trägt Gold. Der dritte Feind klettert gerade eine Leiter herunter, um den Helden zu verfolgen. Wenn der Held den Boden erreicht, muss er diese beiden Feinde austricksen. Diese Ebene enthält sowohl Steine als auch undurchdringlichen Beton sowie viele Fallen (falsche Steine), die wie normale Steine aussehen.

source: How To Play
de: Spielregeln

source: Starting the Game
de: Spielstart

source: &kgoldrunner; begins by showing you a recorded demonstration of play. You can terminate this by clicking on the playing area with the mouse, pressing the spacebar or selecting a menu item or shortcut (such as <menuchoice> <guimenu>Game</guimenu><guimenuitem>New Game...</guimenuitem></menuchoice>). You can skip this demonstration in future by using menu item <menuchoice> <guimenu>Settings</guimenu><guimenuitem>Demo At Start</guimenuitem> </menuchoice>. You can also see it again at any time by using menu item <menuchoice><guimenu>Move</guimenu><guimenuitem>Demo</guimenuitem></menuchoice>.
de: Beim Aufruf von &kgoldrunner; wird ein aufgenommenes Spiel beispielhaft vorgeführt. Das Beispiel kann mittels einem Mausklick im Spielfeld, Drücken der <keycap>Leertaste</keycap>, Auswahl im Menü oder dem entsprechenden Tastenkürzel beendet werden (genauso wie über das Menü <menuchoice><guimenu>Spiel</guimenu><guimenuitem>Neues Spiel ...</guimenuitem></menuchoice>). Das Beispiel kann über das Menü <menuchoice><guimenu>Einstellungen</guimenu><guimenuitem>Demomodus zu Beginn</guimenuitem></menuchoice> abgeschaltet werden. Ebenso kann es auch während des Spiels über das Menü <menuchoice><guimenu>Zug</guimenu><guimenuitem>Demomodus</guimenuitem></menuchoice> wiedergegeben werden.

source: If you skipped the demo or used the mouse or spacebar to end it, a quick-start popup dialog box shows you the names, number and a preview of the last game and level you loaded or, if you have not played before, the same information for Tutorial level 1.
de: Sobald der Demomodus abgebrochen bzw. die Maus oder <keycap>Leertaste</keycap> zum Beenden verwendet wurde, erscheint ein Fenster mit dem Namen, der Nummer und einer Vorschau des zuletzt geladenen Spiels mit Ebene bzw. beim erstmaligen Spielen selbige Daten für die erste Ebene der „Einführung“.

source: Click on the <guibutton>PLAY</guibutton> button to begin playing immediately. Otherwise you can click on the <guibutton>Quit</guibutton> button, the <guibutton>New Game</guibutton> button or the <guibutton>Use Menu</guibutton> button. The first will close &kgoldrunner;, if you do not wish to play, the second will show you a <link linkend="level-selection-dialog">Level Selection</link> dialog, where you can choose a different game and level and the last will terminate the dialog, leaving you free to use the &kgoldrunner; menus.
de: Durch Drücken auf den <guibutton>Spielen</guibutton>-Knopf wird sofort ein Spiel begonnen (oder es wird auf <guibutton>Beenden</guibutton> und danach auf <guibutton>Neues Spiel</guibutton> oder <guibutton>Menü verwenden</guibutton> gedrückt). Die erste Auswahl beendet &kgoldrunner; wieder, die zweite zeigt ein Fenster zur <link linkend="level-selection-dialog">Ebenenauswahl</link>, in dem ein Spiel und eine Ebene ausgewählt werden können und der letzte Knopf schließt das Fenster, sodass ggf. das &kgoldrunner;-Menü verwendet werden kann.

source: If you have chosen to play a game and level, it will then appear and the pointer will be over the hero. In a tutorial game, an explanatory message appears before each level begins. You start play by moving the pointer, clicking the mouse or pressing any key that can control the hero (&eg; <keycap>Space</keycap>), but avoid using <keycap>Q</keycap>, <keycap>S</keycap>, <keycap>P</keycap> or &Esc; at this stage. You start each level in the same way.
de: Wenn ein Spiel und eine Ebene ausgewählt wurde, wird dieses angezeigt und der Mauszeiger befindet sich anfangs über dem Helden. In einem „Einführungsspiel“ erscheint zuerst eine erklärende Nachricht. Das Spiel beginnt mit der ersten Mausbewegung oder einem Tastendruck (z. B. <keycap>Leertaste</keycap>). Die Tasten <keycap>Q</keycap>, <keycap>S</keycap>, <keycap>P</keycap> und <keycap>Esc</keycap> sollten an dieser Stelle nicht verwendet werden. Jede Ebene wird auf die gleiche Art gestartet.

source: You have five lives at the start and gain a bonus life for each level completed.
de: Der Held verfügt zunächst über fünf Leben. Für jede abgeschlossene Ebene kommt ein Leben dazu.

source: Moving Around
de: Bewegung

source: By default you control the hero with the mouse, but you can also control him with the keyboard (<link linkend="keyboard-control">see below</link>) or, on a laptop, by using a mix of the keyboard for digging and the touchpad or other pointer device to guide the hero.
de: Standardmäßig wird der Held mit der Maus gesteuert. Er kann jedoch auch mit der <link linkend="keyboard-control">Tastatur</link> oder auf einem Laptop mit einer Mischung aus der Tastatur (fürs Graben) und dem Touchpad (zur Steuerung) gesteuert werden.

source: The hero moves towards wherever you place the pointer. He cannot move as fast as you can move the pointer, but he will try hard to catch up. If the pointer is above or below his level, he will always go up or down when there is a ladder available or a place to fall into. Otherwise he will move horizontally until he is below the pointer, above it or right at it. You can make him follow simple paths (like &mdash; | L or U), but be careful not to get too many twists and turns ahead of him.
de: Der Held bewegt sich immer zur Position des Mauszeigers hin. Er bewegt sich meist nicht so schnell wie der Mauszeiger, aber er versucht immer ihn zu „fangen“ (mit gleichbleibender Geschwindigkeit). Wenn sich der Mauszeiger ober- oder unterhalb von ihm befindet, wird er die nächste Leiter verwenden oder in das nächste Loch fallen. Anderenfalls bewegt er sich horizontal bis er unter, über oder rechts vom Mauszeiger ist. Er kann dabei nur einfache Richtungsangaben befolgen und der Mauszeiger sollte daher nicht zu weit vorauseilen.

source: You can move left or right over bricks, concrete, ladders or bars and up or down over ladders. If you are on an empty square or a gold nugget and there is no brick, concrete, ladder or bar to hold you up, gravity takes over and you fall. You can also fall by moving down from a bar or the bottom of a ladder, so keep the pointer up there if you want to hold on.
de: Der Held kann sich nach rechts oder links über Stein, Beton, Leitern oder Stangen sowie abwärts und aufwärts über Leitern bewegen. Befindet sich der Held über einem leeren Feld ohne Stein, Beton, Leiter oder Balken, so folgt er den Regeln der Schwerkraft und fällt. Der Held fällt außerdem von einem Balken oder unten von einer Leiter, falls sich der Mauszeiger weiter unten befindet.

source: Keyboard Control
de: Tastatursteuerung

source: If you prefer, you can use the keyboard to control the hero. The default keys are the arrow keys and <keycap>I</keycap>, <keycap>J</keycap>, <keycap>K</keycap> and <keycap>L</keycap> (in honor of the original Apple II game), with the keys <keycap>Z</keycap> and <keycap>C</keycap> or <keycap>U</keycap> and <keycap>O</keycap> for digging. You can play one-handed by using <keycap>U</keycap>, <keycap>I</keycap>, <keycap>O</keycap>, <keycap>J</keycap>, <keycap>K</keycap>, <keycap>L</keycap> and <keycap>Space</keycap> (on a <quote>QWERTY</quote> keyboard) or two-handed by using the arrow keys, <keycap>Space</keycap>, <keycap>Z</keycap> and <keycap>C</keycap>. You can also choose other keys, on the <guimenu>Settings</guimenu> menu, using the <guimenuitem>Configure Shortcuts</guimenuitem> item.
de: Bei Bedarf kann der Held über die Tastatur gesteuert werden. Dazu sind standardmäßig die Pfeiltasten sowie <keycap>I</keycap>, <keycap>J</keycap>, <keycap>K</keycap> und <keycap>L</keycap> (zu Ehren des ursprünglichen Apple-II-Spiels) vorgesehen. Zum Graben werden <keycap>Z</keycap> und <keycap>C</keycap> oder <keycap>U</keycap> und <keycap>O</keycap> verwendet. Damit kann man entweder einhändig mit <keycap>U</keycap>, <keycap>I</keycap>, <keycap>O</keycap>, <keycap>J</keycap>, <keycap>K</keycap>, <keycap>L</keycap> und <keycap>Leertaste</keycap> spielen (auf einer <keycap>QWERTY</keycap>-Tastatur) oder zweihändig mit den Pfeiltasten, <keycap>Leertaste</keycap>, <keycap>Z</keycap> und <keycap>C</keycap>. Über das Menü <menuchoice><guimenu>Einstellungen</guimenu><guimenuitem>Kurzbefehle festlegen ...</guimenuitem></menuchoice> können auch andere Tasten ausgewählt werden.

source: You enter keyboard mode by pressing one of the keys that can control the hero or by selecting <guimenuitem>Keyboard Controls Hero</guimenuitem> on the <guimenu>Settings</guimenu> menu.
de: Die Tastatursteuerung wird mittels Druck auf eine der für &kgoldrunner; festgelegten Tasten oder über das Menü <menuchoice><guimenu>Einstellungen</guimenu><guimenuitem>Tastatursteuerung</guimenuitem></menuchoice> aktiviert.

source: The movement keys (<keycap>I</keycap>, <keycap>J</keycap>, <keycap>K</keycap>, <keycap>L</keycap> or arrows) start the hero moving up, down, left or right. He continues moving in that direction, if he can, until you press another movement key or <keycap>Space</keycap> to stop. In mouse or laptop mode, he stops automatically when he gets to the pointer.
de: Die Bewegungstasten (<keycap>I</keycap>, <keycap>J</keycap>, <keycap>K</keycap>, <keycap>L</keycap> oder die Pfeiltasten) lassen den Helden mit einer Bewegung nach oben, unten, links oder rechts beginnen. Er bewegt sich in die einmal eingeschlagene Richtung bis eine andere Richtungstaste oder die <keycap>Leertaste</keycap> zum Anhalten betätigt wird. Bei der Maussteuerung oder gemischten Steuerung (Laptop) stoppt er automatisch, wenn er den Mauszeiger erreicht hat.

source: A word of warning: using the keyboard is much harder, in the long run, than using the mouse. Think of the mouse as a joystick.
de: Hinweis: Die Tastatursteuerung ist auf längere Sicht erheblich schwieriger. An die Ähnlichkeit zwischen Maus und Joystick sollte hierbei gedacht werden.

source: Taking a Break
de: Spielunterbrechung

source: You can stop the game at any time by pressing a Pause key (the default is either <keycap>P</keycap> or &Esc;). You can resume by pressing the Pause key again. There is also a <guimenuitem>Pause</guimenuitem> option in the <guimenu>Game</guimenu> menu, but the problem is to get the pointer up there without moving the hero and getting into trouble.
de: Das Spiel kann jederzeit mit der Pausetaste (Standard: <keycap>P</keycap> oder <keycap>Esc</keycap>) unterbrochen werden. Bei der nächsten Betätigung einer Pausetaste wird das unterbrochene Spiel fortgesetzt. Es gibt auch einen Menüpunkt (<menuchoice><guimenu>Spiel</guimenu><guimenuitem>Pause</guimenuitem></menuchoice>). Es ist allerdings schwierig, diesen Menüpunkt mit der Maus auszuwählen, ohne den Helden in Schwierigkeiten zu bringen.

source: When you want to use the &kgoldrunner; menu or do some work in another window, always press a Pause key and stop the game. Otherwise the hero will go on following the pointer and might get into trouble.
de: Vor der Verwendung des Menüs von &kgoldrunner; oder einem Fensterwechsel sollte immer eine Pausentaste gedrückt und somit das Spiel unterbrochen werden. Anderenfalls folgt der Held dem Mauszeiger und gerät möglicherweise in Schwierigkeiten.

source: Winning a Level
de: Eine Ebene gewinnen

source: The object of the game is to collect all the gold, by moving or falling onto it. When there is none left, you must move to the top of the playing area to get to the next level. Often, as you collect the last piece of gold, hidden ladders will appear and you can use them to climb to the top. Sometimes there are no hidden ladders. Also, very rarely, the hidden ladders could be a decoy that leads the wrong way. If the level has no gold, there will be no hidden ladders and you just have to work out how to get to the top of the playing area.
de: Ziel des Spiels ist, alle Goldklumpen durch Hineinlaufen oder -fallen einzusammeln. Wenn der letzte Klumpen eingesammelt ist, muss der Held zum oberen Ende des Spielfeldes gelangen. Häufig erscheint nach dem letzten Klumpen Gold eine versteckte Leiter, die der Held hinaufklettern verwenden kann. Manchmal sind keine versteckten Leitern vorhanden oder stellen einen „Köder“ dar, um den Helden auf die falsche Fährte zu locken (aber nur sehr selten). Bei einer Ebene ohne Gold gibt es auch keine versteckten Leitern und es muss ein Weg gefunden werden, um ganz nach oben zu gelangen.

source: Beware of False Bricks
de: Vorsicht vor falschen Steinen

source: False bricks, otherwise known as fall-through bricks or traps, are the other hidden feature of the game. They look just like ordinary bricks, but if you run over one you fall. This can be bad if there is an enemy or a pit down there, or good if there is some gold.
de: Falsche Steine, auch Fallgruben genannt, sind die zweite Form versteckter Objekte. Sie sehen wie normale Steine aus, der Held fällt aber beim Betreten hindurch. Das kann nachteilig sein, falls sich darunter ein Feind befindet, aber auch vorteilhaft, falls sich Gold darunter befindet.

source: Enemies
de: Feinde

source: Enemies move in very much the same way as the hero. The main difference is when they fall into a hole the hero has dug (see <link linkend="importance-of-digging">The Importance of Digging</link> below).
de: Die Feinde bewegen sich ähnlich wie der Held. Der Hauptunterschied wird erkennbar, wenn ein Feind in ein vom Helden gegrabenes Loch fällt (siehe <link linkend="importance-of-digging">Regeln beim Graben</link> weiter unten).

source: They will pick up gold either always or at random, depending on the game settings, and will drop gold at random on brick, concrete or the top of a ladder. If an enemy is carrying the last piece of gold, you must get it away from him before you can finish the level.
de: Die Feinde sammeln zufällig Gold auf und lassen es irgendwo, abhängig von den Spieleinstellungen, wieder fallen. Das kann auf Stein, Beton oder oben auf einer Leiter sein. Wenn ein Feind das letzte Goldstück hat, muss der Held es ihm wegnehmen, bevor er die Ebene beenden kann.

source: If an enemy touches you, you die and must start the level again, provided you have some lives left. However, it is possible to walk or stand on an enemy's head and you can ride an enemy down when he is falling. Some advanced levels require such a move.
de: Falls ein Feind den Helden berührt, stirbt der Held und muss die Ebene neu beginnen, falls er noch ein Leben übrig hat. Es ist allerdings möglich, auf dem Kopf eines Feindes zu stehen, darüber hinweg zu laufen oder auf einem fallenden Feind zu „reiten“. Das ist in einigen fortgeschrittenen Ebenen notwendig.

source: Losing a Level
de: Eine Ebene verlieren

source: As explained above, you can lose a level and a life by touching an enemy. You can also lose by getting caught in a dug brick when it closes. Otherwise you can commit suicide by pressing key <keycap>Q</keycap> or using the menu item <menuchoice><guimenu>Game</guimenu><guimenuitem>Kill Hero</guimenuitem></menuchoice>. Why would you want to do that? Well, sometimes you can get trapped in a place from which you cannot escape. You will stay imprisoned for ever unless you commit suicide!
de: Durch die Berührung eines Feindes kann eine Ebene und ein Leben verloren werden. Außerdem besteht die Möglichkeit einem gegrabenen Loch eingesperrt zu werden, wenn es sich schließt. Mit der Taste <keycap>Q</keycap> oder dem Menüpunkt <menuchoice><guimenu>Spiel</guimenu> <guimenuitem>Held töten</guimenuitem></menuchoice> begeht der Held Selbstmord. Wozu sollte das dienlich sein? Manchmal ist der Held in einem Bereich eingeschlossen, den er nicht verlassen kann und bleibt für immer gefangen oder tötet sich selbst.

source: The Importance of Digging
de: Das Wichtige beim Graben

source: Digging is one of the most powerful tactics you have. To dig a hole in a brick to the left or right, just click the <mousebutton>Left</mousebutton> or <mousebutton>Right</mousebutton> mouse button, or use one of the digging keys (defaults <keycap>Z</keycap>, <keycap>C</keycap>, <keycap>U</keycap>, <keycap>O</keycap>.)
de: Eine der wichtigsten Spieltaktiken besteht im geschickten Graben von Löchern. Um ein Loch links oder rechts neben dem Helden zu graben, muss lediglich die linke oder rechte Maustaste oder alternativ eine der Grabungstasten (Standard: <keycap>Z</keycap>, <keycap>C</keycap>, <keycap>U</keycap>, <keycap>O</keycap>) betätigt werden.
