Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdegames/kgoldrunner.po
Languages: de

source: Note that the menus and dialog allow you to select and play or edit <quote>any</quote> level. If you start a game after level 1, that is OK, you will just not get such a high score. Dedicated players often prefer to play high-numbered levels for fun, rather than go for a high score, or they might like to <quote>train</quote> on higher levels before attempting a high score.
de: Zum Spielen oder Bearbeiten einer <emphasis>beliebigen</emphasis> Ebene gibt es einen eigenen Menüpunkt. Falls Sie ein Spiel nicht von Ebene 1 an starten, können Sie das tun, erhalten aber natürlich keine so große Gesamtpunktzahl. Viele Spieler spielen aber einzelne Ebenen aus Spaß, ohne Interesse an einer hohen Gesamtpunktzahl. Andere möchten vielleicht einige schwerere Ebenen <quote>trainieren</quote>, bevor sie eine hohe Punktzahl zu erreichen versuchen.

source: If you select a System level for editing, that is OK too, but you must save it in one of your own games: not back in the System game. For example you might want to modify a very difficult level so that you do not go back to the start of the level every time you die.
de: Falls ein systemweites Spiel zur Bearbeitung ausgewählt wurde, ist das Speichern nur zu einem eigenen Spiel möglich (und nicht zu einem systemweiten). Beispielsweise kann eine schwierige Ebene so geändert werden, dass beim Tod des Helden nicht wieder am Anfang der Ebene begonnen werden muss.

source: To see what this means, try the <quote>Challenge</quote> game, level 16, <quote>The Three Musketeers</quote>. That level has about ten difficult puzzles in it. When you have solved puzzle 1, you do not want to keep repeating it while you work on puzzle 2. The secret is to make an editable copy, then keep updating it and changing the hero's starting point, until you have solved all the puzzles. Then you can go back and attempt the real thing, from start to finish.
de: Zur Verdeutlichung hierzu dient die 16. Ebene („Die drei Musketiere“) aus dem Spiel „Herausforderung“. Diese Ebene hat ungefähr zehn schwierige Teile. Nachdem der erste Teil gelöst wurde, ist es nicht erwünscht diesen zu wiederholen, sobald man den zweiten Teil löst. Hierzu wird eine bearbeitbare Kopie erzeugt, diese aktualisiert und der Startpunkt des Helden bis zur vollständigen Lösung geändert. Danach kann die vollständige Lösung der Ebene versucht werden.

source: The Menu Reference
de: Die Menü-Referenz

source: Overview of Menus
de: Überblick über die Menüs

source: Game
de: Spiel

source: This menu contains options affecting game play, such as starting and finishing games, saving games, loading saved games and showing high scores (if available). The <guimenu>Game</guimenu> Menu also contains the <guimenuitem>Quit</guimenuitem> option, or you can quit by clicking the <guiicon>X</guiicon> at the top right of the &kgoldrunner; window.
de: Dieses Menü enthält alle Optionen für das Spiel, wie Starten und Beenden von Spielen, Speichern von Spielen, Laden zuvor gespeicherter Spiele, Anzeige der Bestenlisten (falls vorhanden). Das Menü <guimenu>Spiel</guimenu> enthält außerdem den Menüpunkt <guimenuitem>Beenden</guimenuitem>. Das Spiel kann auch durch Klicken auf das Symbol <guiicon>X</guiicon> rechts oben im &kgoldrunner;-Fenster beendet werden.

source: Move
de: Zug

source: This menu contains an option to get a hint (if there is one). Championship and Tutorial games have hints on every level. Other games rarely have hints. It also contains options to replay recordings of play, as when running demonstrations, showing examples of solutions and replaying your own efforts.
de: Dieses Menü beinhaltet die Möglichkeit zum Erhalten von Tipps (sofern welche verfügbar sind). Wettbewerbs- und Einführungsspiele enthalten in jeder Ebene Tipps. Bei anderen Spielen ist das selten der Fall. Ebenso besteht die Möglichkeit Aufnahmen von Spielen, Lösungsbeispiele und eigene Spiele wiederzugeben,

source: This menu has everything you need to create your own games and levels and maintain them, including features to help you re-order levels or move them between games or to delete them when no longer needed. When you reorganize your levels, the level numbers in your game remain consecutive (no gaps) and the levels are automatically renumbered.
de: In diesem Menü befinden sich alle Punkte, die zur Erstellung eigener Spiele und Ebenen notwendig sind. Außerdem können hier die eigenen Spiele verwaltet werden (und auch Ebenen verschoben und gelöscht werden). Beim Umsortieren der Ebenen werden die Nummern automatisch angepasst.

source: When you are using the Game Editor a graphical toolbar with tool tip text appears under the menu bar. See the <link linkend="game-editor">Game Editor</link> for more details of how to create and edit &kgoldrunner; levels.
de: Im Spieleditor erscheint automatisch eine grafische Werkzeugleiste mit Kurzinfos unter der Menüleiste. Weitere Informationen hierzu können dem Abschnitt <link linkend="game-editor">Spieleditor</link> entnommen werden.

source: Settings
de: Einstellungen

source: This menu has several groups of &kgoldrunner; settings, including the choice of mouse, keyboard or hybrid (laptop) control and the choices of themes and game-speed. The current selections are checked. The settings are automatically selected when you start playing, but you can use this menu to vary them if you wish.
de: In diesem Menü gibt es mehrere Einstellungen für &kgoldrunner;. Beispielsweise zu nennen sind die Wahl der Steuerung des Helden über Maus, Tastatur oder gemischte Steuerung (Laptop) und die Auswahl von Designs und der Spielgeschwindigkeit. Die aktuelle Auswahl erkennt man an den Markierungen neben den Menüeinträgen. Es wird bei Spielbeginn eine Vorauswahl getroffen, die aber beliebig verändert werden kann.

source: There is also an option to re-assign keyboard shortcuts and hero-control keys.
de: Ebenso können die Tastenkürzel und Steuerungstasten verändert werden.

source: Help
de: Hilfe

source: The <guimenu>Help</guimenu> menu contains access to the &kgoldrunner; Handbook (this document), <guimenuitem>About &kgoldrunner;</guimenuitem> and <guimenuitem>About &kde;</guimenuitem>.
de: Im Menü <guimenu>Hilfe</guimenu> sind das <guimenuitem>Handbuch zu &kgoldrunner;</guimenuitem> (dieses Dokument), sowie die Menüeinträge <guimenuitem>Über &kgoldrunner;</guimenuitem> und <guimenuitem>Über &kde;</guimenuitem> enthalten.

source: There is also an option to report a Bug or Wishlist item.
de: Es gibt außerdem einen Menüeintrag, um über Fehler und Wünsche zu berichten.

source: If you would like to make a suggestion or you have some new levels to contribute, the current author's email address is in the <guimenuitem>About &kgoldrunner;</guimenuitem> menu item.
de: Vorschläge oder neue Ebenen zu &kgoldrunner; sollten an die E-Mail-Adresse des Programmautors (siehe <guimenuitem>Über &kgoldrunner;</guimenuitem>) berichtet werden.

source: The Game Menu
de: Das Menü Spiel

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo></shortcut> <guimenu>Game</guimenu><guimenuitem>New Game...</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo></shortcut> <guimenu>Spiel</guimenu><guimenuitem>Neues Spiel ...</guimenuitem>

source: Shows the level selection dialog box (see <link linkend="level-selection-dialog-box"> Using the Level Selection Dialog Box</link>), where you choose a game and a level within that game. At first it is easiest to start at level 1, because the levels are arranged approximately in order of difficulty. Also it is best to start there if you are going for a high score.
de: Zeigt den Dialog zur Auswahl einer Ebene (<link linkend="level-selection-dialog-box">Ebenenauswahl verwenden</link>), in dem ein Spiel und seine Ebene ausgewählt werden kann. Zuerst ist es am einfachsten, mit der ersten Ebene zu starten, da die Ebenen aufsteigend nach ihrem Schwierigkeitsgrad angeordnet sind. Bei der „Jagd“ nach einer möglichst hohen Punktzahl sollte immer dort begonnen werden.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>O</keycap></keycombo></shortcut> <guimenu>Game</guimenu><guimenuitem>Load Saved Game...</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>O</keycap></keycombo></shortcut> <guimenu>Spiel</guimenu><guimenuitem>Spiel laden ...</guimenuitem>

source: Brings up a table of previously saved games, sorted with the latest first. Each line lists the game, level, number of lives, score, day of week, date and time. If you select a line and click the <guibutton>OK</guibutton> button, that game starts at the beginning of that level, with the lives and score you saved.
de: Es erscheint ein Fenster mit einer Tabelle der zuvor gespeicherten Spiele (beginnend mit dem letzten). Zu jedem Spiel wird die aktuelle Ebene, die Anzahl der verbliebenen Leben, die Punktzahl, Tag der Woche, Datum und Zeit angezeigt. Eines dieser Spiele wird durch Klicken auf das Spiel und Betätigen von <guibutton>OK</guibutton> mit den angezeigten Daten gestartet.

source: <shortcut><keycap>Y</keycap></shortcut> <guimenu>Game</guimenu><guimenuitem>Play Next Level</guimenuitem>
de: <shortcut> <keycap>Y</keycap> </shortcut> <guimenu>Zug</guimenu> <guimenuitem>Nächste Ebene spielen</guimenuitem>

source: Loads the next level in the current game, ready to play and without any further dialog. You can use this to browse quickly through the levels of a game.
de: Die nächste Ebene des aktuellen Spiels wird geladen (sofort spielbar - ohne weitere Fenster). Es ist auch zum schnellen Durchsehen der Ebenen eines Spiels dienlich.

source: <shortcut><keycap>S</keycap></shortcut> <guimenu>Game</guimenu><guimenuitem>Save Game...</guimenuitem>
de: <shortcut><keycap>S</keycap></shortcut> <guimenu>Spiel</guimenu> <guimenuitem>Spiel speichern ...</guimenuitem>

source: Saves the current game, level, lives and score. The option will only save the position and score as at the start of the current level. You can save when you are mid-way through a level, but &kgoldrunner; will still save the position (and score) as it was at the start of the level. You will receive a warning message about that. Before using this option, you should press a Pause key (<keycap>P</keycap> or &Esc;), to freeze the game as you move the mouse, but it is much easier to use the <keycap>S</keycap> key as a short-cut.
de: Speichert den aktuellen Spielzustand mit Ebene, Leben und Punktzahl. Es wird immer die Punktzahl und Position zu Beginn einer Ebene gespeichert, auch wenn sich der Held zum Zeitpunkt des Speicherns bereits mitten in einer Ebene befindet. Das wird auch in einer Warnmeldung so mitgeteilt. Vor dem Speichern sollte zunächst das Spiel unterbrochen werden (<keycap>P</keycap> oder &Esc;), damit die Mausbewegung das Spiel nicht mehr beeinflusst. Die Verwendung des Tastenkürzels <keycap>S</keycap> ist noch einfacher.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>S</keycap></keycombo></shortcut> <guimenu>Game</guimenu><guimenuitem>Save Edits...</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>S</keycap></keycombo></shortcut> <guimenu>Spiel</guimenu> <guimenuitem>Änderungen speichern ...</guimenuitem>

source: This option is enabled only if you have been using the Game Editor. It brings up the level selection dialog box and lets you choose a level number and game in which to save your work. Its action is exactly the same as the <guimenuitem>Save Edits</guimenuitem> option on the <guimenu>Editor</guimenu> menu and the <guiicon>disk</guiicon> icon on the Editor toolbar.
de: Dieser Menüpunkt ist erst verfügbar, wenn der Spieleditor verwendet wurde. Es erscheint das Auswahlfenster, in dem festgelegt werden kann, in welchem Spiel und in welcher Ebene die Arbeit gespeichert werden soll. Die gleiche Aktion ist auch unter dem Punkt <guimenuitem>Änderungen speichern ...</guimenuitem> im Menü <guimenu>Editor</guimenu> oder über das <guiicon>Disketten</guiicon>-Symbol in der Editor-Werkzeugleiste verfügbar.

source: <shortcut><keycap>P or &Esc;</keycap></shortcut> <guimenu>Game</guimenu><guimenuitem>Pause</guimenuitem>
de: <shortcut><keycap>P oder &Esc;</keycap></shortcut> <guimenu>Spiel</guimenu> <guimenuitem>Pause</guimenuitem>

source: Stops or restarts the game action.
de: Zur Unterbrechung oder zum Fortsetzen eines Spiels.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>H</keycap></keycombo></shortcut> <guimenu>Game</guimenu><guimenuitem>Show High Scores</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>H</keycap></keycombo> </shortcut> <guimenu>Spiel</guimenu> <guimenuitem>Bestenliste anzeigen</guimenuitem>

source: Shows a table of up to ten high scores for the currently selected game. Each line shows the player's rank and name, the level reached, the score achieved, the day of the week and the date.
de: Zeigt eine Tabelle mit bis zu zehn der besten Spielergebnisse für das aktuelle Spiel. Jede Zeile zeigt den Spielernamen, die erreichte Ebene, die erreichte Punktzahl, sowie den Wochentag und das Datum.

source: <shortcut><keycap>Q</keycap></shortcut> <guimenu>Game</guimenu><guimenuitem>Kill Hero</guimenuitem>
de: <shortcut><keycap>Q</keycap></shortcut> <guimenu>Spiel</guimenu><guimenuitem>Held töten</guimenuitem>

source: Kills the hero when he is in a position from which he cannot escape.
de: Ermöglicht das Töten des Helden, wenn er sich in einer ausweglosen Situation befindet.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo></shortcut> <guimenu>Game</guimenu><guimenuitem>Quit</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo> </shortcut> <guimenu>Spiel</guimenu> <guimenuitem>Beenden</guimenuitem>

source: Terminates &kgoldrunner; immediately. If a game is in progress, it disappears forever (unless you have just saved it) and there is no check for a high score. If you were editing a level, you are given an opportunity to save your work.
de: Beendet das Spiel &kgoldrunner; sofort. Falls ein Spiel läuft, ist es für immer verloren (falls es nicht vorher gespeichert worden ist) und die Punktzahl wird nicht in die Bestenliste eingetragen. Falls die Ebene verändert wurde, wird hier nochmals die Möglichkeit zum Speichern der Änderungen gegeben.

source: The Move Menu
de: Das Menü Zug

source: All the demo and replay moves will replay previously recorded levels. All can be interrupted and stopped by clicking on the playing area with the mouse, pressing the spacebar or selecting a menu item or shortcut (such as <menuchoice><guimenu>Game</guimenu> <guimenuitem>New Game...</guimenuitem></menuchoice>).
de: Alle Beispiele und Wiedergaben zeigen zuvor aufgenommene Ebenen. Sie können durch Klicken mit der Maus auf die Spielfläche, Drücken der <keycap>Leertaste</keycap>, Verwendung des Menüs oder Tastenkürzels (z. B. <menuchoice><guimenu>Spiel</guimenu><guimenuitem>Neues Spiel</guimenuitem></menuchoice>) unterbrochen oder beendet werden.

source: <shortcut><keycap>H</keycap></shortcut> <guimenu>Move</guimenu><guimenuitem>Hint</guimenuitem>
de: <shortcut> <keycap>H</keycap> </shortcut> <guimenu>Zug</guimenu> <guimenuitem>Tipp</guimenuitem>

source: Shows a popup hint, if there is one for the level being played. By convention, Championship and Tutorial games have hints on every level. Other games rarely have hints. The lower part of the &kgoldrunner; window shows whether a hint is available or not.
de: Zeigt ein Fenster mit einem Hinweis (falls für die Ebene vorhanden). Wettbewerbs- und Einführungs-Spiele haben einen Tipp für jede Ebene. Bei anderen Spielen ist das selten der Fall. In der Statusleiste wird angezeigt, ob ein Tipp verfügbar ist.

source: <shortcut><keycap>D</keycap></shortcut> <guimenu>Move</guimenu><guimenuitem>Demo</guimenuitem>
de: <shortcut> <keycap>D</keycap> </shortcut> <guimenu>Zug</guimenu> <guimenuitem>Demomodus</guimenuitem>

source: Plays a demonstration of play in a few recorded levels. These are the same as in the startup demo.
de: Startet ein paar aufgenommenen Spiele im Demomodus. Diese Beispiele werden auch bei Aufruf von &kgoldrunner; gezeigt.

source: <guimenu>Move</guimenu><guimenuitem>Show A Solution...</guimenuitem>
de: <guimenu>Zug</guimenu><guimenuitem>Eine Lösung wiedergeben ...</guimenuitem>

source: Replays a recorded solution of a level, if there is a solution on file in the released game-data.
de: Zeigt die aufgenommene Lösung einer Ebene (sofern in den Spieldaten vorhanden).

source: <shortcut><keycap>R</keycap></shortcut> <guimenu>Move</guimenu><guimenuitem>Instant Replay</guimenuitem>
de: <shortcut> <keycap>R</keycap> </shortcut> <guimenu>Zug</guimenu> <guimenuitem>Sofortige Wiedergabe</guimenuitem>

source: Stops play in the current level and replays the recorded version from the beginning. If you interrupt the replay, you can continue playing from that point and try another approach. You can use this feature to build up a winning sequence of moves in stages, but that will invalidate any high score you might be working on.
de: Stoppt das Spielen der aktuellen Ebene und startet die Wiedergabe ab Beginn. Wird die Wiedergabe unterbrochen, so kann das Spiel fortgesetzt und eine andere Lösungsmethode probiert werden. Dies ermöglicht den stufenweisen Aufbau einer <emphasis>Siegesserie</emphasis> (jedoch kann kein Eintrag in die Bestenliste mehr erfolgen).

source: <shortcut><keycap>A</keycap></shortcut> <guimenu>Move</guimenu><guimenuitem>Replay Last Level</guimenuitem>
de: <shortcut> <keycap>A</keycap> </shortcut> <guimenu>Zug</guimenu> <guimenuitem>Letzte Ebene wiedergeben</guimenuitem>

source: Replays the recorded version of the last level you played, from the beginning (&eg; if you lost the level). If you interrupt the replay, you can continue playing from that point and try another approach. You can use this feature to build up a winning sequence of moves in stages, but that will invalidate any high score you might be working on.
de: Startet die Wiedergabe der Aufnahme der zuletzt gespielten Ebene (z. B. wenn der Held getötet wurde). Wird die Wiedergabe unterbrochen, so kann das Spiel fortgesetzt und eine andere Lösungsmethode probiert werden. Dies ermöglicht den stufenweisen Aufbau einer <emphasis>Siegesserie</emphasis> (jedoch kann kein Eintrag in die Bestenliste mehr erfolgen).

source: <guimenu>Move</guimenu><guimenuitem>Replay Any Level</guimenuitem>
de: <guimenu>Zug</guimenu><guimenuitem>Beliebige Ebene wiedergeben</guimenuitem>

source: Replays the recorded version of any level you have previously played.
de: Startet die Wiedergabe der Aufnahme einer beliebigen bereits gespielten Ebene.

source: The Editor Menu
de: Das Menü Editor

source: <guimenu>Editor</guimenu><guimenuitem>Create Level</guimenuitem>
de: <guimenu>Editor</guimenu><guimenuitem>Ebene erstellen</guimenuitem>

source: Shows the Editor toolbar and a blank playing area on which you can draw a new level. When done, use <guimenuitem>Save Edits</guimenuitem> to assign the new level to a game and level number.
de: Zeigt die Editor-Werkzeugleiste sowie ein leeres Spielfeld zum Zeichnen einer neuen Ebene an. Ein abschließendes <guimenuitem>Änderungen speichern ...</guimenuitem> dient zum Zuordnen der Ebene zu einem Spiel und Vergabe einer Nummer für die Ebene.

source: <guimenu>Editor</guimenu><guimenuitem>Edit Level...</guimenuitem>
de: <guimenu>Editor</guimenu><guimenuitem>Ebene bearbeiten ...</guimenuitem>

source: Shows the level selection dialog box, where you choose a game and level to edit. You can choose a System game and level, but you get a warning that you can only save the edited level in one of your own games.
de: Zeigt das Fenster zur Auswahl eines Spiels sowie einer bestimmten Ebene zur Bearbeitung. Es kann auch eines der systemweite Spiele ausgewählt werden, jedoch können die Ergebnisse nur in einem eigenen Spiel gespeichert werden.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>S</keycap></keycombo></shortcut> <guimenu>Editor</guimenu><guimenuitem>Save Edits...</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>S</keycap></keycombo></shortcut> <guimenu>Editor</guimenu><guimenuitem>Änderungen speichern ...</guimenuitem>

source: Shows the level selection dialog box with appropriate default settings for saving a new or edited level. You can change the game and level number and achieve a <quote>Save As...</quote> effect. This dialog box has a special button, <guibutton>Edit Level Name and Hint</guibutton>, which shows a dialog box where you can add an optional name and hint to your level.
de: Öffnet das Auswahlfenster für die Ebenen mit den geeigneten Werten als Voreinstellung. Das Spiel und die Nummer für die Ebene können geändert und der Effekt eines „Speichern unter ...“ erzielt werden. Mit dem Knopf <guibutton>Name &amp; Tipp für Ebene bearbeiten</guibutton>, öffnet sich ein weiteres Fenster zur Bearbeitung von Namen und Tipp.

source: <guimenu>Editor</guimenu><guimenuitem>Move Level...</guimenuitem>
de: <guimenu>Editor</guimenu><guimenuitem>Ebene verschieben ...</guimenuitem>

source: This is a two-part operation. Before using <guimenuitem>Move Level</guimenuitem>, you must load a level to be moved by selecting it for play or edit. The <guimenuitem>Move Level</guimenuitem> option then shows the level selection dialog box, where you choose a new place for the loaded level. You can change both the game and the level number, to move a level to another game, or you can just change the level number to re-order levels within a game. You cannot move a System level.
de: Diese Operation besteht aus zwei Teilen. Zunächst muss die zu verschiebende Ebene geladen werden. Dann wird der Menüeintrag <guimenuitem>Ebene verschieben ...</guimenuitem> verwendet. Es erscheint das Auswahlfenster, in dem eine neue Position für die geladene Ebene bestimmt wird. Dabei dürfen sowohl die Nummer für die Ebene als auch das Spiel geändert werden. Eine systemweite Ebene kann nicht geändert werden.

source: <guimenu>Editor</guimenu><guimenuitem>Delete Level...</guimenuitem>
de: <guimenu>Editor</guimenu><guimenuitem>Ebene löschen ...</guimenuitem>

source: Shows the level selection dialog box, where you choose a level to delete. You cannot delete a System level.
de: Zeigt das Auswahlfenster, in dem eine Ebene zum Löschen ausgewählt werden kann. Es kann keine systemweite Ebene gelöscht werden.

source: <guimenu>Editor</guimenu><guimenuitem>Create Game...</guimenuitem>
de: <guimenu>Editor</guimenu><guimenuitem>Spiel erstellen ...</guimenuitem>

source: You need to use this option before you start creating your own &kgoldrunner; levels. It shows a dialog box where you can enter the name of a new game, a 1-5 character prefix for level-file names, the default rules for your game (<quote>&kgoldrunner;</quote> or <quote>Traditional</quote>) and an optional description or comment about the game.
de: Dieser Eintrag muss zuerst ausgewählt werden, bevor eigene Ebenen für &kgoldrunner; erstellt werden können. Im angezeigten Fenster kann ein Spielnamen mit 1-5 Buchstaben Länge als Präfix für die Ebenennamen festgelegt werden. Weiterhin können die Standardregeln („&kgoldrunner;“ oder „Herkömmlich“) festgelegt und eine Beschreibung sowie einen Kommentar zum Spiel eintragen werden.

source: <guimenu>Editor</guimenu><guimenuitem>Edit Game Info...</guimenuitem>
de: <guimenu>Editor</guimenu><guimenuitem>Spielinfo bearbeiten ...</guimenuitem>
