Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdegames/kigo.po
Languages: de

source: Program copyright 2009 Sascha Peilicke <email>sasch.pe@gmx.de</email>
de: Programm © 2009 Sascha Peilicke <email>sasch.pe@gmx.de</email>

source: Documentation Copyright &copy; 2009 Sascha Peilicke <email>sasch.pe@gmx.de</email>
de: Dokumentation © 2009 Sascha Peilicke <email>sasch.pe@gmx.de</email>

source: Documentation editing and Docbook conversion by Yuri Chornoivan <email>yurchor@ukr.net</email>
de: Aufbereitung des Handbuchs: Yuri Chornoivan <email>yurchor@ukr.net</email>

source: Default theme designed by Arturo Silva <email>jasilva28@gmail.com</email>
de: Standarddesign: Arturo Silva <email>jasilva28@gmail.com</email>

source: CREDIT_FOR_TRANSLATORS
de: <para>Übersetzung: Johannes Obermayr <email>johannesobermayr@gmx.de</email></para>

source: Installation
de: Installieren

source: How to obtain &kigo;
de: Bezug von &kigo;

source: Compilation and Installation
de: Kompilieren und Installieren
