Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdegames/kigo.po
Languages: de

source: The &kigo; Handbook
de: Das Handbuch zu &kigo;

source: <firstname></firstname> <surname>Sascha Peilicke</surname>
de: <firstname>Sascha</firstname><surname>Peilicke</surname>

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Johannes</firstname><surname>Obermayr</surname><affiliation><address><email>johannesobermayr@gmx.de</email></address></affiliation><contrib>Übersetzung</contrib></othercredit>

source: &kigo; is an open-source implementation of the popular Go game (also known as Weiqi).
de: &kigo; ist eine quelloffene Umsetzung des sehr bekannten Brettspiels <emphasis>Go</emphasis> bzw. <emphasis>Weigi</emphasis> für KDE.

source: kdegames
de: KDE-Spiele

source: game
de: Spiel

source: logic
de: Logik

source: board
de: Brettspiel

source: one player
de: Einzelspieler

source: two players
de: Zwei Spieler

source: Introduction
de: Einleitung

source: Gametype:
de: Spielart:

source: Logic, Board
de: Logikspiel, Brettspiel

source: Number of possible players:
de: Anzahl der Spieler:

source: <para>Two</para>
de: <para>Zwei</para>

source: Go is a strategic board game for two players. It is also known as igo (Japanese), weiqi or wei ch'i (Chinese) or baduk (Korean). Go is noted for being rich in strategic complexity despite its simple rules.
de: <emphasis>Go</emphasis> ist ein strategisches Brettspiel für zwei Spieler und wird auch als <emphasis>igo</emphasis> (japanisch), <emphasis>weigi</emphasis>, <emphasis>wei ch'i</emphasis> (chinesisch) oder <emphasis>baduk</emphasis> (koreanisch) bezeichnet. Es wird trotz seiner einfachen Regeln als reichhaltig in der strategischen Komplexität bezeichnet.

source: The game is played by two players who alternately place black and white stones (playing pieces, now usually made of glass or plastic) on the vacant intersections of a grid of 19×19 lines (9x9 or 13x13 lines for easier flavors).
de: Die beiden Spieler legen abwechselnd die schwarzen bzw. weißen Steine (heutzutage aus Glas oder Kunststoff) auf den freien Schnittpunkten eines Rasters mit 19 x 19 Linien (9 x 9 oder 13 x 13 bei den einfacheren Arten).

source: How to Play
de: Spielanleitung

source: Objective:
de: Spielziel:

source: The object of the game is to control a larger portion of the board than the opponent. A stone or a group of stones is captured and removed if it has no empty adjacent intersections, the result of being completely surrounded by stones of the opposing color.
de: Das Spielziel besteht darin, dass der Spieler einen größeren Teil des Spielfelds als der Gegner kontrolliert. Ein Stein bzw. eine Gruppe von Steinen wird erobert und entfernt, sobald sich keine freie Schnittpunkte mehr darum befinden, d. h., dass vollständig von gegnerischen Steinen eingeschlossen ist.

source: Starting a Game
de: Spiel starten

source: When you have started &kappname; you have two options to play the wonderful game of Go. You can either start a new game or continue an old one.
de: Beim Aufruf von &kigo; kann ein neues <emphasis>Go</emphasis>-Spiel begonnen oder ein bereits begonnenes fortgesetzt werden.

source: Setup a new game
de: Neues Spiel einrichten

source: When you have started &kappname; you should see a screen similar to the one shown in screenshot below. There you can set up both the white and the black player’s name and the board size. You can decide if one or both players should be computers. If you decide to play against a computer you can also set its strength. If you want to start the game you can either select <guimenuitem>Start Game</guimenuitem> from the <guimenu>Game</guimenu> menu, click on <guibutton>Start Game</guibutton> in the <quote>Game setup</quote> dock widget or by simply pressing the key <keycap>S</keycap>.
de: Beim Start von &kigo; sollte ein Fenster angezeigt werden, das dem unten angezeigtem Bildschirmfoto ähnlich ist. In diesem können die Namen des weißen und schwarzen Spielers sowie die Spielfeldgröße festgelegt werden. Des Weiteren kann festgelegt werden, ob es sich bei den Spielern um menschliche oder Computerspieler handelt. Bei den Computerspielern kann zudem deren Spielstärke gewählt werden. Das Spiel kann anschließend über das Menü <menuchoice><guimenu>Spiel</guimenu><guimenuitem>Spiel starten</guimenuitem></menuchoice>, den Knopf <guibutton>Spiel starten</guibutton> im <emphasis>Einrichtungsfenster</emphasis> oder durch Drücken der Taste <keycap>S</keycap> gestartet werden.

source: New game screen
de: Einrichtungsfenster für ein neues Spiel

source: New Game Screen.
de: Einrichtungsfenster für ein neues Spiel.

source: Setup a loaded game
de: Geladenes Spiel einrichten

source: If you decide to continue a previously unﬁnished game you can simply choose the <guimenuitem>Load...</guimenuitem> option in the <guimenu>Game</guimenu> menu (the menu is shown in the screenshot above). A ﬁle chooser should now pop up, use it to select and load the desired savegame ﬁle.
de: Ein gespeichertes, bereits begonnenes Spiel kann über das Menü <menuchoice><guimenu>Spiel</guimenu><guimenuitem>Laden ...</guimenuitem></menuchoice> geladen und fortgesetzt werden (siehe oberes Bildschirmfoto). Ein Dialog zur Dateiauswahl sollte nun erscheinen, sodass die Datei des gewünschten Spiels gewählt und geladen werden kann.

source: Now you should see a screen similar to the one shown on the screenshot below. If you do not want to continue with the last move made, you can revert as many moves as you like. You should see the board changing as you change the current move number. The setup screen also presents a lot of additional information about the saved game.
de: Nun sollte ein Fenster angezeigt werden, das dem unten angezeigtem Bildschirmfoto ähnlich ist. Es können alle bereits gespielten Spielzüge zurückgenommen werden, sodass das Spiel in jedem bisherigen Status fortgesetzt werden kann. Das angezeigte Spielfeld verändert sich mit jeder Änderung der Nummer des Spielzuges. Das Fenster gibt zudem weitere Informationen zum gespeicherten Spiel.

source: Just press <guibutton>Start Game</guibutton> to continue.
de: Durch Drücken von <guibutton>Spiel starten</guibutton> wird das Spiel im ausgewählten Status fortgesetzt.

source: Loaded game screen
de: Einrichtungsfenster für ein geladenes Spiel

source: Loaded Game Screen.
de: Einrichtungsfenster für ein geladenes Spiel.

source: There is also the option to download history Go games or saved games uploaded by other users from the internet. Just click the <guimenuitem>Get More Games...</guimenuitem> in the <guimenu>Game</guimenu> menu. You should then see a dialog which allows you to choose which content to download.
de: Zusätzlich können historische <emphasis>Go</emphasis>- oder hochgeladene gespeicherte Spiele anderer Benutzer über das Menü <menuchoice><guimenu>Spiel</guimenu><guimenuitem>Spielpakete herunterladen ...</guimenuitem></menuchoice> vom Internet heruntergeladen werden. Es wird ein Dialog zum Auswählen und Herunterladen der gewünschten Inhalte aufgerufen.

source: Get new games
de: Fenster zum Herunterladen von Spielpaketen

source: Get New Games Screen.
de: Fenster zum Herunterladen von Spielpaketen

source: Playing a game
de: Spielablauf

source: Now you are ready to play your ﬁrst round of Go. If you are not familiar with the rules, we recommend reading the corresponding <ulink url="http://en.wikipedia.org/wiki/Go_game">Wikipedia article</ulink> or take <ulink url=" http://playgo.to/interactive/">The Interactive Way To Go</ulink> from Hiroki Mori.
de: Das erste <emphasis>Go</emphasis>-Spiel kann nun gestartet werden. Sollten die Regeln nicht bekannt sein, können sie im <ulink url="http://de.wikipedia.org/wiki/Go_(Spiel)">Wikipedia-Artikel</ulink> oder auf <ulink url="http://www.dgob.de/index.htm?einfuehrung/goregeln1.htm">www.dgob.de</ulink> nachgelesen werden.

source: Making a move is simple, just click on one of the intersections on the Go board. You should see a little black point which shows you where your stone would land if you click.
de: Ein Spielzug ist durch einen Mausklick auf die Schnittpunkte des <emphasis>Go</emphasis>-Spielbretts auf einfachste Art und Weise möglich. Hierzu wird zunächst ein kleiner schwarzer Punkt angezeigt, um zu verdeutlichen, wo der Stein nach dem Mausklick platziert wird.

source: The current player can be determined by the cursor, which changes to a black or a white stone depending on which player is next.
de: Der aktuelle Spieler kann durch den Mauszeiger bestimmt werden. Hierzu nimmt er eine schwarze oder weiße Farbe an - je nachdem welcher Spieler am Zug ist.

source: You can also check the game information which shows also the previous move and some statistics. A complete move history is also available. If you want to remember in which order the stones on the board where placed, just click the <guibutton>Show move numbers</guibutton> button. If you think that you can’t gain anything by placing another stone, just click <guibutton>Pass Move</guibutton> and let your opponent take his turn. If both players pass, the game can be ﬁnished. Note that ending a Go game is always a cooperative step!
de: Es können auch die Informationen zum letzten Spielzug und anderen Statistiken angezeigt werden. Ein vollständiger Verlauf aller Spielzüge ist ebenfalls vorhanden. Bei welchem Spielzug der jeweilige Stein gelegt worden ist, kann über <guibutton>Spielzug-Nummern anzeigen</guibutton> angezeigt werden. Sollte das Legen eines neuen Steins nicht weitere positive Auswirkungen haben, so kann der Spielzug mittels <guibutton>Aussetzen</guibutton> übersprungen werden. Wenn beide Spieler <emphasis>aussetzen</emphasis>, kann das Spiel beendet werden. Hierbei ist zu beachten, dass es sich beim Beenden eines <emphasis>Go</emphasis>-Spiels immer um einen kooperativen Schritt handelt.

source: Playing a fresh game
de: Ein neues Spiel starten

source: Playing a Fresh Game.
de: Ein neues Spiel starten.

source: Note that you can save the current game at any time. Do this by entering the <guimenu>Game</guimenu> menu and choose the <guimenuitem>Save</guimenuitem> item.
de: Beachtet werden sollte, dass das Spiel zu jeder Zeit mit dem aktuellen Status über das Menü <menuchoice><guimenu>Spiel</guimenu><guimenuitem>Speichern</guimenuitem></menuchoice> gespeichert werden kann.

source: <title>Getting a hint</title>
de: <title>Einen Tipp einholen</title>

source: Sometimes it is diﬃcult to decide which move to make. If you want the computer to give you a little hint, just press the <guibutton>Hint</guibutton> button shown in the screenshot below. Now some transparent stones with a number on top should appear. These are actually your recommendations with a score. The score determines how good that move is. Feel free to click on any of the recommended moves or any other free ﬁeld to make set your next stone.
de: Manchmal fällt die Entscheidung für den nächsten Spielzug etwas schwerer. Der im unteren Bildschirmfoto gezeigte Knopf <guibutton>Tipp</guibutton> veranlasst den Computer Spielzüge vorzuschlagen. Es sollten nun ein paar durchsichtige Steine mit darüberstehenden Nummern erscheinen. Die Nummern dieser Vorschläge bestimmen die Güte des Spielzugs. Es kann nun einer dieser vorgeschlagenen oder ein eigener Spielzug vollzogen werden.

source: <screeninfo>Getting a hint</screeninfo>
de: <screeninfo>Einen Vorschlag eines Spielzugs einholen</screeninfo>

source: Getting a Hint.
de: Einen Vorschlag eines Spielzugs einholen.

source: Strategies and Tips
de: Spielstrategien und Tipps

source: Go is more about surrounding territory (empty space) than capturing your opponent's pieces.
de: In <emphasis>Go</emphasis> geht es mehr um das Umschließen von (leeren) Gebieten als das Erobern der Steine der Gegner.

source: Territory is easiest to surround near the corners (on two sides) then near the edges (on three sides) and lastly in the center.
de: Die Gebiete können am einfachsten an den Ecken (zwei Seiten), den Seiten (drei Seiten) und schließlich im Inneren des Spielfelds umschlossen werden.

source: At the start of the game, space your pieces out. Only fill in your fence-lines when your opponent starts to intrude
de: Zu Beginn sollten die Stücke über das gesamte Spielbrett verteilt und mit dem Bau der Zaunlinien erst nach Umschließungsversuchen des Gegners begonnen werden.

source: Do not play unsupported stones right next to your opponent's stones when attacking. They will tend to get swallowed and GnuGo is very good at that. It is often better to attack indirectly.
de: Beim Angriff sollten ungesicherte Steine direkt neben den Steinen des Gegners nicht gespielt werden. In der Regel werden diese von <emphasis>GnuGo</emphasis> geschluckt. Der indirekte Angriff ist deshalb oftmals besser.

source: To avoid capture, a group of stones must have two <quote>eyes</quote> or be able to make them if attacked. <quote>Eyes</quote> are disconnected spaces. Think of a doughnut with two holes. Your opponent can surround the outside, but cannot fill both holes at once.
de: Zur Vermeidung von Verlusten durch Eroberungen muss eine Gruppe von Steinen zwei <emphasis>Augen</emphasis> besitzen oder bei einem Angriff erhalten. <emphasis>Augen</emphasis> sind getrennte Leerräume. Ein Pfannkuchen mit zwei Löchern dient hierzu zur Verdeutlichung. Der Gegner kann das Äußere umschließen, jedoch die beiden inneren Löcher nicht mit einem Spielzug füllen.

source: On the 19x19 board there are typically several territories being created, attacked or defended. You have to fight several battles simultaneously. The strategy involves evaluating the strengths and weaknesses in various areas and allocating your moves between them. Is it better to attack there or defend here?
de: Auf dem Spielbrett mit einer Kantenlänge von 19 x 19 werden typischerweise zwei Gebiete zum verteidigen bzw. angreifen geschaffen. Es werden mehrere Kämpfe gleichzeitig geführt. Die Strategie besteht in der Bewertung der Stärken und Schwächen in den verschiedenen Gebieten und der Zuteilung der Spielzüge zwischen ihnen. Ist hier der Angriff oder die Verteidigung besser?

source: As the board fills up and the end-game approaches, it becomes important to play closer up, nibbling at your opponent's fences or reinforcing your own. Small mistakes and omissions can become very costly.
de: Beim Auffüllen des Spielbretts zu Spielende ist eine möglichst enge Spielweise, <emphasis>Ansägen</emphasis> der gegnerischen oder Verstärkung der eigenen Zäune geboten. Kleine Fehler und Versäumnisse können teuer zu stehen sein.

source: Interface Overview
de: Benutzeroberfläche

source: The &kappname; Menues
de: Menü

source: &kappname; has a default &kde; game menues, except for the following items:
de: &kigo; verwendet das Standardmenü von &kde; sowie ergänzend die nachstehenden:

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>G</keycap></keycombo></shortcut> <guimenu>Game</guimenu> <guimenuitem>Get More Games...</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl; <keycap>G</keycap></keycombo></shortcut><guimenu>Spiel</guimenu><guimenuitem>Spielpakete herunterladen ...</guimenuitem>

source: Opens standard &kde; KNewStuff dialog to load other users' saved games.
de: Öffnet den &kde;-Standarddialog „Neue Erweiterungen herunterladen“, damit gespeicherte Spiele anderer Benutzer heruntergeladen werden können.

source: <shortcut><keycap>S</keycap></shortcut> <guimenu>Game</guimenu> <guimenuitem>Start Game</guimenuitem>
de: <shortcut><keycap>S</keycap></shortcut><guimenu>Spiel</guimenu><guimenuitem>Spiel starten</guimenuitem>

source: <action>Starts</action> the new or the loaded game.
de: Startet das neue bzw. gewählte Spiel.

source: <shortcut><keycap>F</keycap></shortcut> <guimenu>Game</guimenu> <guimenuitem>Finish Game</guimenuitem>
de: <shortcut><keycap>F</keycap></shortcut><guimenu>Spiel</guimenu><guimenuitem>Spiel beenden</guimenuitem>

source: <action>Finishes</action> the current game. Remember that ending a Go game is always a cooperative step.
de: Beendet das aktuelle Spiel. Hierbei ist zu beachten, dass es sich beim Beenden eines <emphasis>Go</emphasis>-Spiels immer um einen kooperativen Schritt handelt.

source: <shortcut><keycap>P</keycap></shortcut> <guimenu>Move</guimenu> <guimenuitem>Pass Move</guimenuitem>
de: <shortcut><keycap>P</keycap></shortcut><guimenu>Zug</guimenu><guimenuitem>Aussetzen</guimenuitem>

source: Allows you to <action>pass</action> a move.
de: Der Spielzug wird ausgesetzt und der andere Spieler ist am Zug.

source: <shortcut><keycap>H</keycap></shortcut> <guimenu>Move</guimenu> <guimenuitem>Hint</guimenuitem>
de: <shortcut><keycap>H</keycap></shortcut><guimenu>Zug</guimenu><guimenuitem>Tipp</guimenuitem>

source: <action>Gives a Hint</action> by showing the transparent stones with the score on them.
de: <emphasis>Tipps</emphasis> für den nächsten Spielzug werden angezeigt. Dies geschieht durch Einblenden durchsichtiger Steine mit Bewertung.

source: <shortcut><keycap>N</keycap></shortcut> <guimenu>Move</guimenu> <guimenuitem>Show Move Numbers</guimenuitem>
de: <shortcut><keycap>N</keycap></shortcut><guimenu>Zug</guimenu><guimenuitem>Spielzug-Nummern anzeigen</guimenuitem>

source: <action>Toggles</action> move numbers visibility.
de: Zeigt die Spielzug-Nummern an bzw. blendet sie aus.

source: <guimenu>Settings</guimenu> <guisubmenu>Dockers</guisubmenu> <guimenuitem>Moves</guimenuitem>
de: <guimenu>Einstellungen</guimenu><guisubmenu>Anzeigen</guisubmenu><guimenuitem>Spielzüge</guimenuitem>

source: Shows or hides the Moves sidebar.
de: Zeigt die Anzeige für die Spielzüge an bzw. blendet sie aus.

source: <guimenu>Settings</guimenu> <guimenuitem>Configure &kappname;...</guimenuitem>
de: <guimenu>Einstellungen</guimenu><guimenuitem>&kappname; einrichten ...</guimenuitem>

source: <action>Opens a dialog to configure &kappname;.</action> See <link linkend="configuration">Game Configuration</link> section for details.
de: Öffnet den Dialog zum Einrichten von &kappname;. Weitere Informationen hierzu können dem Abschnitt <link linkend="configuration">Spieleinstellungen</link> entnommen werden.

source: Additionally &kappname; has the common &kde; <guimenu>Settings</guimenu> and <guimenu>Help</guimenu> menu items, for more information read the sections about the <ulink url="help:/fundamentals/ui.html#menus-settings">Settings Menu</ulink> and <ulink url="help:/fundamentals/ui.html#menus-help">Help Menu</ulink> of the &kde; Fundamentals.
de: Zusätzlich hat &kappname; die bekannten &kde;-Einträge im Menü <guimenu>Einstellungen</guimenu> und <guimenu>Hilfe</guimenu>, weitere Informationen dazu finden Sie in den Abschnitten über die Menüs <ulink url="help:/fundamentals/ui.html#menus-settings">Einstellungen</ulink> und <ulink url="help:/fundamentals/uihtml#menus-help">Hilfe</ulink> der &kde;-Grundlagen.

source: Shortcuts
de: Kurzbefehle

source: The default shortcuts are:
de: Folgende Tastenkürzel sind als Standard voreingestellt:

source: Finish the current game
de: Das aktuelle Spiel abbrechen

source: Get new games uploaded by other users
de: Von anderen Benutzern zur Verfügung gestellte Spiele herunterladen

source: Help
de: Hilfe

source: Load saved game
de: Ein gespeichertes Spiel laden

source: Pass a move
de: Einen Spielzug aussetzen

source: Quit
de: Beenden

source: Redo a move that was undone
de: Den zuletzt zurückgenommenen Spielzug wiederherstellen

source: Save the current game
de: Das aktuelle Spiel speichern

source: Start a new game
de: Ein neues Spiel starten

source: Start new or loaded game
de: Ein neues oder geladenes Spiel starten

source: Toggle move numbers visibility
de: Anzeigen bzw. Ausblenden der Spielzug-Nummern

source: Undo your last move
de: Den letzten Spielzug zurücknehmen

source: What's this?
de: <emphasis>Was ist das?</emphasis>-Hilfe

source: Game Configuration
de: Spieleinstellungen

source: If you want to change how &kappname; is conﬁgured you can do that by navigating to the <guimenu>Settings</guimenu> menu and clicking on the <guimenuitem>Conﬁgure &kappname;...</guimenuitem> action.
de: Die Einstellungen von &kigo; können über das Menü <menuchoice><guimenu>Einstellungen</guimenu><guimenuitem>&kigo; einrichten ...</guimenuitem></menuchoice> geändert werden.

source: You should now see the conﬁguration dialog as shown in the screenshot below. You can reach it also by pressing the key combination <keycombo>&Alt;<keycap>S</keycap></keycombo> followed by <keycombo>&Alt;<keycap>C</keycap></keycombo>.
de: Der unten gezeigte Einrichtungsdialog sollte nun angezeigt werden. Dieser kann auch durch das Tastenkürzel <keycombo>&Alt;<keycap>E</keycap></keycombo> mit anschließendem <keycombo>&Alt;<keycap>R</keycap></keycombo> aufgerufen werden.

source: &kappname; is extremely ﬂexible and can be customized as much as you like. You are able to change positions and size of all dock widgets next to the central play area. You can also customize the toolbar if you want to have diﬀerent actions accessible there. To do this just click on the <guimenu>Settings</guimenu> menu and choose <guimenuitem>Configure toolbars...</guimenuitem>. The same is possible for all shortcuts in the game. If you want to have the maximum space available for the game ﬁeld you can even hide the toolbar and most dock widgets in the <guimenu>Settings</guimenu> menu.
de: &kigo; kann nahezu grenzenlos an die eigenen Vorstellungen angepasst werden. So können beispielsweise die Positionen und Größen aller <emphasis>Anzeigen</emphasis> um das Spielfeld, die Werkzeugleisten über das Menü <menuchoice><guimenu>Einstellungen</guimenu><guimenuitem>Werkzeugleisten einrichten ...</guimenuitem></menuchoice> oder auch die Tastenkürzel geändert werden. Um ein möglichst großes Spielfeld zu erhalten, können die <guimenuitem>Werkzeugleisten</guimenuitem> und <guimenuitem>Anzeigen</guimenuitem> über das Menü <guimenu>Einstellungen</guimenu> ausgeblendet werden.

source: General Configuration
de: Allgemeine Einstellungen

source: The most important aspect here is the Go engine backend conﬁguration. &kappname; needs a valid backend to function properly. As you can see in the screenshot below, it used GnuGo by default. The little light next to the engine command shines green if everything works ﬁne. If this is not the case or if you want to use a diﬀerent Go backend, you should install a diﬀerent Go engine which can speak the GnuGo Text Procotol (GTP) and set its command and parameters accordingly. Details about this step should be found in the corresponding Go engine documentation.
de: Hier werden hauptsächlich die Einstellungen zum <emphasis>Go</emphasis>-Modul vorgenommen. &kigo; benötigt ein gültiges <emphasis>Go</emphasis>-Modul zur <emphasis>richtigen</emphasis> Funktionsweise. Im nachfolgend gezeigten Bildschirmfoto wird das voreingestellte <emphasis>GnuGo</emphasis> verwendet. Die kleine Anzeige rechts daneben erscheint in grüner Farbe sobald das Modul richtig eingestellt ist. Ist dies nicht der Fall bzw. soll ein anderes <emphasis>Go</emphasis>-Modul mit Unterstützung des <emphasis>GnuGo-Text-Protokolls</emphasis> (GTP) verwendet werden, so können die Parameter entsprechend angepasst werden. Nähere Einzelheiten sollten die Dokumentationen der entsprechenden <emphasis>Go</emphasis>-Module liefern.

source: General conﬁguration
de: Fenster der allgemeinen Einstellungen

source: General Conﬁguration.
de: Fenster der allgemeinen Einstellungen.

source: <title>Theme Configuration</title>
de: <title>Designeinstellungen</title>

source: This page will allow you to change the theme &kappname; uses.
de: Diese Seite ermöglicht das Wechseln des zu verwendenden Designs von &kappname;.

source: Configure &kappname; - Themes
de: &kigo;-Designs einrichten

source: <phrase>Theme Configuration</phrase>
de: <phrase>Designeinstellungen</phrase>

source: Credits and License
de: Mitwirkende und Lizenz
