Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdegames/kiriki.po
Languages: de

source: The &kiriki; Handbook
de: Das Handbuch zu &kiriki;

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Burkhard</firstname><surname>Lück</surname><affiliation><address><email>lueck@hube-lueck.de</email></address></affiliation><contrib>Übersetzung</contrib></othercredit>

source: This documentation describes the game of &kiriki; version &kappversion;
de: Dieses Handbuch beschreibt das Spiel &kiriki; in der Version &kappversion;

source: kdegames
de: KDE-Spiele

source: game
de: Spiel

source: dice
de: Würfel

source: dice game
de: Würfelspiel

source: playing dice
de: würfeln

source: six players
de: sechs Spieler

source: Introduction
de: Einführung

source: Gametype:
de: Spieltyp:

source: Dice, Arcade
de: Würfelspiel, Arcade

source: Number of possible players:
de: Anzahl der Spieler:

source: <para>Six</para>
de: <para>Sechs</para>

source: &kiriki; is an addictive and fun dice game for &kde;, designed to be played by as many as six players. Participants have to collect points by rolling five dice for up to three times per single turn. Each roll generates a specific combination of numbers which the player is free to either accept or decline. However, each specific combination of numbers can be accepted only once. After thirteen turns the game ends and the scores are compared. The player with the largest amount of points wins the game.
de: &kiriki; ist ein ansteckendes und lustiges Würfelspiel für &kde; für bis zu sechs Spieler. Teilnehmer sammeln Punkte, indem sie pro Zug bis zu dreimal mit fünf Würfeln würfeln. Jeder Wurf ergibt eine Würfelkombination, die der Spieler akzeptieren oder verwerfen kann. Jede Kombination kann jedoch nur einmal auf die Punkte angewandt werden. Nach dreizehn Runden endet das Spiel und die Punkte werden verglichen. Der Spieler mit den meisten Punkten gewinnt das Spiel.

source: How to Play
de: Spielanleitung

source: Objective:
de: Ziel des Spiels:

source: Earn more score points than either of the opponents.
de: Erreichen Sie mehr Punkte als Ihre Gegner.

source: Once &kiriki; starts, it right away gives out the first combination for the player one. If you are the player one, then it is now your turn, otherwise you will have to wait until all other players make their moves.
de: Beim Start zeigt &kiriki; sofort die erste Kombination für den ersten Spieler an. Wenn Sie der erste Spieler sind, sind Sie nun an der Reihe. Ansonsten warten Sie, bis die anderen Spieler ihre Züge getätigt haben.

source: Note:
de: Hinweis:

source: By default, unless the game settings have been changed, and in single player mode, the first player is controlled by human (you), while all other five players are controlled by Artificial Intelligence.
de: Sofern die Voreinstellung nicht geändert wurde, ist der erste Spieler ein menschlicher Spieler (Sie), während die anderen fünf Spieler von der KI des Spiels, also vom Computer, gesteuert werden.

source: Once it is your turn, the first thing you should do is examine the current roll. Each of the five dice on the left hand side of the game screen has a specific value. Check the sequence to see if these values form any of the score patterns.
de: Sobald Sie an der Reihe sind, müssen Sie den ersten Wurf begutachten. Jeder der Würfel auf der linken Seite hat einen bestimmten Wert. Überprüfen Sie die Reihe, um zu sehen, ob die Werte auf eines der Punktemuster passen.

source: The detailed description of the score patterns can be found in the <link linkend="rules_and_tips">‘Game Rules, Strategies and Tips’</link> section of this handbook.
de: Eine ausführliche Beschreibung der Punktemuster finden Sie im Abschnitt <link linkend="rules_and_tips">Spielregeln, Spielstrategien und Tipps</link> in diesem Handbuch.

source: Keep in mind that the combination can match more than one score pattern. In this case you will have to determine which score pattern will result in greater points for you.
de: Beachten Sie, dass die Kombination auf mehr als ein Muster passen kann. In dem Fall müssen Sie bestimmen, welches der Muster Ihnen mehr Punkte einbringt.

source: In case the current sequence matches no score pattern, or matches a score pattern you have already used up, you have two more rolls to fix the situation. To use your second (third) roll select the dice you are not satisfied with by clicking on them with your mouse and click the <guibutton>Roll</guibutton> button located right under the dice. This will cause the dice in question to reroll, thus changing their values.
de: Fall der aktuelle Wurf keinem Muster entspricht, oder das passende Muster bereits von Ihnen verwendet wurde, haben Sie zwei weitere Würfe, um das zu ändern. Für den zweiten bzw. dritten Wurf wählen Sie jeweils die Würfel, mit denen Sie nicht zufrieden sind, indem Sie darauf klicken und dann auf <guilabel>Würfeln</guilabel> unterhalb der Würfel. Die gewählten Würfel werden erneut gewürfelt und verändern dadurch ihre Werte.

source: After you have done the third reroll you must choose the score pattern which fits the dice sequence on hand. If none of the score patterns fit the sequence - you can either use <guilabel>Chance</guilabel> score pattern, or just select any score pattern on your scoreboard.
de: Nach dem dritten Wurf müssen Sie das Punktemuster wählen, das am ehesten zu Ihrem Wurf passt. Passt keines der Muster, können Sie entweder <guilabel>Chance</guilabel> wählen, oder auf ein beliebiges anderes Muster klicken.

source: If you select a score pattern that does not fit current dice sequence, the score pattern you select will become void and of zero value.
de: Wenn Sie ein Punktemuster wählen, das nicht zu Ihrem aktuellen Wurf passt, wird es ungültig und ohne Wertigkeit.

source: As soon as you choose the score pattern its value updates to reflect the dice sequence you currently have.
de: Sobald Sie ein Punktemuster auswählen, ändern sich dessen Werte entsprechend Ihrer aktuellen Würfelstellung.

source: The detailed description of the score pattern values can be found in the <link linkend="rules_and_tips">‘Game Rules, Strategies and Tips’</link> section of this handbook.
de: Eine ausführliche Beschreibung der Werte der Punktemuster finden Sie im Abschnitt <link linkend="rules_and_tips">Spielregeln, Spielstrategien und Tipps</link> in diesem Handbuch.

source: Right after that your turn ends and the next participant’s turn begins. This sequence repeats some thirteen times and then the game ends, the scores are calculated and the high scores are awarded.
de: Ihr Zug endet direkt danach und der nächste Spieler ist an der Reihe. Das wiederholt sich dreizehn Mal, dann werden die Punkte zusammengezählt und die Höchstpunktzahl ausgezeichnet.

source: Game Rules, Strategies and Tips
de: Spielregeln, Spielstrategien und Tipps

source: Game Rules
de: Spielregeln

source: &kiriki; score board is divided into fourteen different lines. Each line holds a single score pattern and the players' score earned for a roll matching the pattern. The score pattern of each line is calculated as follows:
de: Die Punktetafel in &kiriki; ist in vierzehn Zeilen unterteilt. Jede Zeile enthält ein Punktemuster und die Punkte, die der Spieler für das Erreichen dieses Musters erhalten hat. Das Punktemuster jeder Zeile wird wie folgt berechnet:

source: <guilabel>1s</guilabel>: Sum of all dice valued ‘1’.
de: <guilabel>1er</guilabel>: Summe aller Einser.

source: Example:
de: Beispiel:

source: Dice on display: '14112'. The sum is: '3'='1'+'1'+'1'. Dice on display: '51111'. The sum is: '4'='1'+'1'+'1'+'1'.
de: Würfel zeigen: '14112'. Ergebnis: '3'='1'+'1'+'1'. Würfel zeigen: '51111'. Ergebnis: '4'='1'+'1'+'1'+'1'.

source: <guilabel>2s</guilabel>: Sum of all dice valued ‘2’.
de: <guilabel>2er</guilabel>: Summe aller Zweier.

source: Dice on display: '22422'. The sum is: '8'='2'+'2'+'2'+'2'. Dice on display: '42322'. The sum is: '6'='2'+'2'+'2'.
de: Würfel zeigen: '22422'. Ergebnis: '8'='2'+'2'+'2'+'2'. Würfel zeigen: '42322'. Ergebnis: '6'='2'+'2'+'2'.

source: <guilabel>3s</guilabel>: Sum of all dice valued ‘3’.
de: <guilabel>3er</guilabel>: Summe aller Dreier.

source: Dice on display: '34132'. The sum is: '6'='3'+'3'. Dice on display: '33333'. The sum is: '15'='3'+'3'+'3'+'3'+'3'.
de: Würfel zeigen: '34132'. Ergebnis: '6'='3'+'3'. Würfel zeigen: '33333'. Ergebnis: '15'='3'+'3'+'3'+'3'+'3'.

source: <guilabel>4s</guilabel>: Sum of all dice valued ‘4’.
de: <guilabel>4er</guilabel>: Summe aller Vierer.

source: Dice on display: '14142'. The sum is: '8'='4'+'4'. Dice on display: '41414'. The sum is: '12'='4'+'4'+'4'.
de: Würfel zeigen: '14142'. Ergebnis: '8'='4'+'4'. Würfel zeigen: '41414'. Ergebnis: '12'='4'+'4'+'4'.

source: <guilabel>5s</guilabel>: Sum of all dice valued ‘5’.
de: <guilabel>5er</guilabel>: Summe aller Fünfer.

source: Dice on display: '15155'. The sum is: '15'='5'+'5'+'5'. Dice on display: '51555'. The sum is: '20'='5'+'5'+'5'+'5'.
de: Würfel zeigen: '15155'. Ergebnis: '15'='5'+'5'+'5'. Würfel zeigen: '51555'. Ergebnis: '20'='5'+'5'+'5'+'5'.

source: <guilabel>6s</guilabel>: Sum of all dice valued ‘6’.
de: <guilabel>6er</guilabel>: Summe aller Sechser.

source: Dice on display: '66616'. The sum is: '24'='6'+'6'+'6'+'6'. Dice on display: '61616'. The sum is: '18'='6'+'6'+'6'.
de: Würfel zeigen: '66616'. Ergebnis: '24'='6'+'6'+'6'+'6'. Würfel zeigen: '61616'. Ergebnis: '18'='6'+'6'+'6'.

source: <guilabel>Bonus if > 62</guilabel>: Player is awarded an additional 35 points if the summarized value of all the field above is greater than 62 points.
de: <guilabel>Bonus wenn > 62</guilabel>: Der Spieler bekommt 35 Punkte extra, wenn die oberen Felder zusammengezählt mehr als 62 Punkte ergeben.

source: <guilabel>Upper Total</guilabel>: It is not a playable field, but only a summary of all the fields above.
de: <guilabel>Gesamt oben</guilabel>: Dies ist kein Spielfeld; hier werden nur die oberen Felder zusammengezählt.

source: <guilabel>3 of a Kind</guilabel>: Summarized value of dice when three of the dice are bearing the same value.
de: <guilabel>Dreierpasch</guilabel>: Summe aller Würfel, wenn drei Würfel den gleichen Wert zeigen.

source: Dice on display: '14121'. The sum is: '9'='1'+'1'+'1'+'4'+'2'. Dice on display: '55151'. The sum is: '17'='5'+'5'+'5'+'1'+'1'.
de: Würfel zeigen: '14121'. Ergebnis: '9'='1'+'1'+'1'+'4'+'2'. Würfel zeigen: '55151'. Ergebnis: '17'='5'+'5'+'5'+'1'+'1'.

source: <guilabel>4 of a Kind</guilabel>: Summarized value of dice when four of the dice are bearing the same value.
de: <guilabel>Viererpasch</guilabel>: Summe aller Würfel, wenn vier Würfel den gleichen Wert zeigen.

source: Dice on display: '41444'. The sum is: '17'='4'+'4'+'4'+'4'+'1'. Dice on display: '22522'. The sum is: '13'='2'+'2'+'2'+'2'+'5'.
de: Würfel zeigen: '41444'. Ergebnis: '17'='4'+'4'+'4'+'4'+'1'. Würfel zeigen: '22522'. Ergebnis: '13'='2'+'2'+'2'+'2'+'5'.

source: <guilabel>Full House</guilabel>: 25 points are awarded to the player if the round results in three dice of a kind and a pair.
de: <guilabel>Full House</guilabel>: Der Spieler bekommt 25 Punkte, wenn in der Runde drei gleiche Würfel und ein Paar erspielt wurden.

source: Dice on display: '11212'. Dice on display: '53353'.
de: >Würfel zeigen: '11212'. Würfel zeigen: '53353'.

source: <guilabel>Small Straight</guilabel>: 30 points are awarded to the player if the round results in four dice of sequential value.
de: <guilabel>Kleine Straße</guilabel>: Der Spieler bekommt 30 Punkte, wenn in der Runde vier Würfel in einer Reihe erspielt wurden.

source: Dice on display: '14312'. The sequence is: '1','2','3','4'. Dice on display: '51643'. The sequence is: '3','4','5','6'.
de: >Würfel zeigen: '14312'. Die Reihe lautet: '1','2','3','4'. Würfel zeigen: '51643'. Die Reihe lautet: '3','4','5','6'.

source: <guilabel>Large Straight</guilabel>: 40 points are awarded to the player if the round results in five dice of sequential value.
de: <guilabel>Große Straße</guilabel>: Der Spieler bekommt 40 Punkte, wenn in der Runde fünf Würfel in einer Reihe erspielt wurden.

source: Dice on display: '34152'. The sequence is: '1','2','3','4','5'. Dice on display: '53264'. The sequence is: '2','3','4','5','6'.
de: Würfel zeigen: '34152'. Die Reihe lautet: '1','2','3','4','5'. Würfel zeigen: '53264'. Die Reihe lautet: '2','3','4','5','6'.

source: <guilabel>&kiriki;</guilabel>: 50 points are awarded to the player if the round results in five dice of the same value. You can score as many &kiriki; as you get, for each one after the first you get an additional turn at the end of the game.
de: <guilabel>&kiriki;</guilabel>: Der Spieler bekommt 50 ""Punkte, wenn er die Runde mit fünf gleichen Würfeln beendet. Es können ""unendlich viele &kiriki; gepunktet werden und für jeden weiteren (nach dem ""ersten) darf zum Ende des Spiels nochmals gewürfelt werden.

source: Dice on display: '11111'. Dice on display: '33333'.
de: Würfel zeigen: '11111'. Würfel zeigen: '33333'.

source: <guilabel>Chance</guilabel>: Summarized value of all the dice currently on display.
de: <guilabel>Chance</guilabel>: Summe aller Werte, die die Würfel zeigen.

source: Dice on display: '51143'. The sum is: '14'='5'+'1'+'1'+'4'+'3'. Dice on display: '21526'. The sum is: '16'='2'+'1'+'5'+'2'+'6'.
de: Würfel zeigen: '51143'. Ergebnis: '14'='5'+'1'+'1'+'4'+'3'. Würfel zeigen: '21526'. Ergebnis: '16'='2'+'1'+'5'+'2'+'6'.

source: <guilabel>Lower Total</guilabel>: It is not a playable field, but only a summary of all the fields starting from '3 of a Kind' and lower.
de: <guilabel>Gesamt unten</guilabel>: Dies ist kein Spielfeld; hier werden nur die Felder ab <quote>Dreierpasch</quote> zusammengezählt.

source: <guilabel>Grand Total</guilabel>: It is not a playable field, but only a sum of 'Upper Total' and 'Lower Total' fields.
de: <guilabel>Ergebnis</guilabel>: Dies ist kein Spielfeld; hier werden nur <quote>Gesamt oben</quote> und <quote>Gesamt unten</quote> zusammengezählt.

source: Other rules and constrains:
de: Weitere Regeln und Bedingungen:

source: The entire game round is split into 13 turns.
de: Eine volle Spielrunde besteht aus 13 Zügen.

source: Each player can do one to three rolls of dice per turn.
de: Jeder Spieler darf in jedem Zug dreimal würfeln.

source: After the first roll is done, a player can perform additional rolls for up to two times (three rolls at all per turn).
de: Nach dem ersten Würfeln kann ein Spieler noch zweimal würfeln, insgesamt dreimal je Zug.

source: The Player is not obligated to perform additional rolls if the first roll brings satisfactory results.
de: Der Spieler ist nicht verpflichtet, noch einmal zu würfeln, wenn nach dem ersten Würfeln bereits ein erwünschtes Ergebnis vorliegt.

source: Each additional roll may either involve all the dice, or only the selected ones.
de: Wird weiter gewürfelt, kann der Spieler dies entweder mit allen oder nur mit einigen ausgewählten Würfeln tun.

source: A Player can select the dice to be recast by clicking on them with the mouse.
de: Ein Spieler kann die Würfel, die er verwerfen möchte auswählen, indem er auf sie klickt.

source: Once the dice have been recast their previous value is lost and only the new value is valid.
de: Wenn Würfel verworfen werden, ist ihr ursprünglicher Wert verloren und es zählt der neue Wert.

source: The result of the roll is considered satisfactory if the values of the dice on display can be put into one of the score patterns discussed above.
de: Das Ergebnis des Würfelns ist zufriedenstellend, wenn die Werte der Würfel auf eines der Punktemuster passen, die weiter oben erklärt wurden.

source: Each individual score pattern can only be used once per game per player. Therefore, once the score pattern has been used by one player it can no longer be used by that same player. However, another player can still use it, unless he has used this same pattern up already.
de: Jedes Punktemuster kann pro Spiel und Spieler nur einmal verwendet werden. Wurde ein Muster von einem Spieler einmal verwendet, kann er es in dem Spiel nicht noch einmal verwenden. Andere Spieler können das Muster jedoch noch verwenden, solange sie es nicht bereits aufgebraucht haben.

source: Interface Overview
de: Die Benutzeroberfläche

source: Menu Items
de: Menüeinträge

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo></shortcut> <guimenu>Game</guimenu> <guimenuitem>New</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo></shortcut> <guimenu>Spiel</guimenu> <guimenuitem>Neu</guimenuitem>

source: Starts a new game.
de: Startet ein neues Spiel.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>H</keycap></keycombo></shortcut> <guimenu>Game</guimenu> <guimenuitem>Show High Scores</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>H</keycap></keycombo> </shortcut> <guimenu>Spiel</guimenu> <guimenuitem>Bestenliste anzeigen</guimenuitem>

source: <action>Shows the high score list.</action> When your current game score exceeds one the top ten scores listed, you are prompted to add your name.
de: <action>Zeigt die Bestenliste an.</action> Wenn Ihre Punktzahl höher als die in der Bestenliste geführten Einträge ist, werden Sie aufgefordert, Ihren Namen einzugeben.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>P</keycap></keycombo></shortcut> <guimenu>Game</guimenu> <guimenuitem>Print...</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>P</keycap></keycombo></shortcut> <guimenu>Spiel</guimenu> <guimenuitem>Drucken ...</guimenuitem>

source: Prints current score board.
de: Druckt die aktuelle Punktetafel.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo></shortcut> <guimenu>Game</guimenu> <guimenuitem>Quit</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo> </shortcut> <guimenu>Spiel</guimenu> <guimenuitem>Beenden</guimenuitem>

source: <action>Quits</action> &kiriki;.
de: <action>Beendet</action> &kiriki;.

source: <shortcut><keycap>H</keycap></shortcut> <guimenu>Move</guimenu> <guimenuitem>Hint</guimenuitem>
de: <shortcut><keycap>H</keycap></shortcut> <guimenu>Zug</guimenu> <guimenuitem>Tipp</guimenuitem>

source: Give a hint by highlighting one or more dices to roll or a row on the score board. Using this feature the score will not be considered as a high score.
de: Gibt einen Tipp, indem ein oder mehrere Würfel für den nächsten Zug oder eine Zeile auf der Punktetafel hervorgehoben werden. Benutzen Sie diese Funktion, wird das Spielergebnis nicht in die Bestenliste eingetragen.

source: <shortcut><keycap>D</keycap></shortcut> <guimenu>Move</guimenu> <guimenuitem>Demo</guimenuitem>
de: <shortcut> <keycap>D</keycap> </shortcut> <guimenu>Zug</guimenu> <guimenuitem>Demomodus</guimenuitem>

source: Play a demo game. To stop the demo mode start a new game.
de: Zeigt ein Demospiel. Um den Demomodus zu beenden, müssen Sie ein neues Spiel starten.

source: Additionally &kappname; has the common &kde; <guimenu>Settings</guimenu> and <guimenu>Help</guimenu> menu items, for more information read the sections about the <ulink url="help:/fundamentals/ui.html#menus-settings">Settings Menu</ulink> and <ulink url="help:/fundamentals/ui.html#menus-help">Help Menu</ulink> of the &kde; Fundamentals.
de: Zusätzlich hat &kappname; die bekannten &kde;-Einträge im Menü <guimenu>Einstellungen</guimenu> und <guimenu>Hilfe</guimenu>, weitere Informationen dazu finden Sie in den Abschnitten über die Menüs <ulink url="help:/fundamentals/ui.html#menus-settings">Einstellungen</ulink> und <ulink url="help:/fundamentals/uihtml#menus-help">Hilfe</ulink> der &kde;-Grundlagen.

source: Frequently asked questions
de: Häufig gestellte Fragen

source: I want to change the way this game looks. Can I?
de: Kann ich das Erscheinungsbild des Spiels ändern?

source: No. &kiriki; does not currently feature any themes.
de: Nein. Derzeit kann das Erscheinungsbild nicht geändert werden.

source: I have made a mistake. Can I undo?
de: Ich habe einen Fehler gemacht. Kann ich einen Spielzug zurücknehmen?

source: No. &kiriki; has no <quote>Undo</quote> option.
de: Nein, in &kiriki; können Sie keine Spielzüge zurücknehmen.

source: Can I use the keyboard to play the game?
de: Kann ich mit der Tastatur spielen?

source: No. The game of &kiriki; cannot be played using keyboard.
de: Nein, &kiriki; kann nicht mit der Tastatur gespielt werden.

source: I cannot figure out what to do here! Are there hints?
de: Ich komme im Spiel nicht weiter, gibt es Tipps?

source: To learn about the game play rules and tactics please read the <link linkend="rules_and_tips">Game Rules, Strategies and Tips</link> section of this handbook.
de: Um etwas über die Spielregeln und Strategien zu erfahren, lesen Sie bitte den Abschnitt <link linkend="rules_and_tips">Spielregeln, Spielstrategien und Tipps</link> in diesem Handbuch.

source: I have to quit the game now, but I am not finished yet. Can I save my progress?
de: Ich muss das Spiel unterbrechen, kann ich den aktuellen Spielstand speichern?

source: No. There is no <quote>Save</quote> feature in &kiriki;.
de: Nein, in &kiriki; können Sie den aktuellen Spielstand nicht speichern.

source: The AI is too fast! I cannot see what it is doing!
de: Die KI des Spiels ist viel zu schnell. Ich sehe nicht, was sie tut.

source: To change Artificial Intelligence's speed of action please use the game configuration dialog discussed in the <link linkend="configuration">Game Configuration</link> section of this handbook.
de: Um die Geschwindigkeit der KI des Spiels zu ändern, benutzen Sie den Einrichtungsdialog, der im Abschnitt <link linkend="configuration">Einstellungen für das Spiel</link> in diesem Handbuch beschrieben wird.

source: Game Configuration
de: Einstellungen für das Spiel

source: The &kiriki; configuration dialog lets you configure the number of participants, manage their identities, and their response times.
de: Mit dem Einrichtungsdialog von &kiriki; können Sie die Anzahl der Spieler, deren Identität und Antwortzeiten einstellen.

source: You can change the response times for Artificial Intelligence driven players only.
de: Die Antwortzeit kann nur für Computergegner (KI) eingestellt werden.

source: <guilabel>Number of players:</guilabel> this field defines the number of players for &kiriki;. The values allowed here range between two and six.
de: <guilabel>Spieleranzahl:</guilabel> Dieses Feld gibt die Anzahl der Spieler in &kiriki; an. Es sind Werte zwischen zwei und sechs möglich.

source: The number of players cannot be less than two.
de: Es wird mit mindestens zwei Spielern gespielt.

source: <guilabel>1.</guilabel>-<guilabel>6.</guilabel> Numbered fields are the identities of the participating players. You can change their names as well as specify whether they will be human controlled, or driven by the Artificial Intelligence. To define who controls the player use a check box located on the right hand side, right next to the name entry box.
de: Die mit <guilabel>1.</guilabel>-<guilabel>6.</guilabel> bezeichneten Felder sind die Identitäten der Spieler. Sie können hier die Namen einstellen und auch, ob sie von menschlichen Gegnern oder von der KI des Spiels gesteuert werden. Um einzustellen, wie die Spieler gesteuert werden, benutzen Sie das Ankreuzfeld rechts neben dem Namen.

source: The first player must always be human controlled.
de: Der erste Spieler muss immer ein menschlicher Spieler sein.

source: Changes to number of participants and their identities will be applied on the next game.
de: Änderungen der Anzahl und Identität von Spielern werden erst beim nächsten Spiel wirksam.
