Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdegames/kiriki.po
Languages: de

source: <guilabel>Delay between computers move (msec):</guilabel> lets you specify the delay between Artificial Intelligence's turns. The value of this field is zero by default, meaning that the Artificial Intelligence reacts instantaneously.
de: <guilabel>Verzögerung zwischen Zügen des Rechners (ms):</guilabel> gibt an, wie lange die KI des Spiels wartet, bis sie einen Zug ausführt. Voreingestellt ist hier null, was bedeutet, dass die KI ihre Züge sofort ausführt.

source: The maximum value for this field is 999 milliseconds.
de: Der Wert für diese Verzögerung kann höchstens 999 Millisekunden betragen.

source: Use <guilabel>Font Size</guilabel> and <guilabel>Row Height</guilabel> to adjust the score board to your liking.
de: Verwenden Sie <guilabel>Schriftgröße</guilabel> und <guilabel>Zeilenhöhe</guilabel>, um die Punktetafel an Ihre Wünsche anzupassen.

source: If you want to play immediately at &kiriki; startup disable the default option <guilabel>Show demonstration game at startup</guilabel>.
de: Möchten Sie beim Start von &kiriki; sofort mit einem Spiel beginnen, deaktivieren Sie die Standardeinstellung <guilabel>Demospiel beim Programmstart anzeigen</guilabel>.

source: Credits and License
de: Danksagungen und Lizenz

source: Program copyright 2005-2007 &Albert.Astals.Cid; &Albert.Astals.Cid.mail;
de: Programm Copyright 2005-2007 &Albert.Astals.Cid; &Albert.Astals.Cid.mail;

source: Documentation copyright 2005 &Albert.Astals.Cid; &Albert.Astals.Cid.mail;
de: Dokumentation Copyright 2005 &Albert.Astals.Cid; &Albert.Astals.Cid.mail;

source: Documentation copyright 2007 Eugene Trounev <email>eugene.trounev@gmail.com</email>
de: Dokumentation Copyright 2007 Eugene Trounev <email>eugene.trounev@gmail.com</email>

source: CREDIT_FOR_TRANSLATORS
de: <para>Übersetzung Burkhard Lück <email>lueck@hube-lueck.de</email></para><para>Übersetzung Frederik Schwarzer <email>schwarzer@kde.org</email></para>

source: Compilation and Installation
de: Kompilierung und Installation
