Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdegames/kjumpingcube.po
Languages: de

source: Use the <link linkend="configuration">Game Configuration</link> dialog again. Down at the bottom are two check boxes. Check one to pause the game between moves. Check the other to pause between steps of cascade moves that spread out over the board, especially near the end of the game. Back in the game, you can now use the big toolbar button (whenever it goes green), to trigger off each move or proceed step by step within a move, at whatever pace you choose.
de: Öffnen Sie wieder den <link linkend="configuration">Einrichtungsdialog</link>. Darin finden Sie unten zwei Ankreuzfelder. Kreuzen Sie links unten an, dass vor jedem Zug des Computers eine Pause eingelegt wird. Aktivieren Sie dann rechts unten die Einstellung, dass bei Kaskadenzügen, die sich besonders gegen Ende eines Spiels über das ganze Feld ausbreiten, nach jedem Schritt ebenfalls angehalten wird. Zurück im Spiel können Sie jetzt den großen Knopf in der Werkzeugleiste immer dann benutzen, wenn er grüne wird, um jeden Zug schrittweise ausführen zu lassen.

source: What does the big button in the toolbar do?
de: Welche Funktion hat der große Knopf in der Werkzeugleiste?

source: This button is used to stop something the computer is doing (red color), start or continue a computer action when you are ready (green color) or prompt you to do something, such as make a move (blue color, button disabled). For a full description see <link linkend="stop_start_button">The Stop/Start Button</link>.
de: Dieser Knopf wird benutzt, um den Computerspieler anzuhalten (rote Farbe), eine Aktion des Computers zu starten oder fortzusetzen, wenn Sie bereits sind (grüne Farbe) oder es wird eine Aufforderung wie zum Beispiel zur Ausführung des nächsten Zugs (blaue Farbe, der Knopf ist deaktiviert) angezeigt. Eine vollständige Beschreibung finden Sie im Abschnitt <link linkend="stop_start_button">Der Knopf zum Anhalten/Fortsetzen</link>.

source: Can I use the keyboard to play the game?
de: Kann ich mit der Tastatur spielen?

source: No. &kjumpingcube; cannot be played using the keyboard.
de: Nein, &kjumpingcube; kann nicht mit der Tastatur gespielt werden.

source: Where are the high scores?
de: Wo finde ich die Bestenliste?

source: &kjumpingcube; does not have such a feature.
de: In &kjumpingcube; gibt es keine Bestenliste.

source: Game Configuration
de: Einstellungen für das Spiel

source: To open the configuration dialog use the menubar option: <menuchoice><guimenu>Settings</guimenu><guimenuitem>Configure &kjumpingcube;...</guimenuitem></menuchoice> On Apple Mac OS X use option: <menuchoice><guimenu>&kjumpingcube;</guimenu><guimenuitem>Preferences</guimenuitem></menuchoice>. Or you can use the Settings button in the toolbar.
de: Um den Einrichtungsdialog zu öffnen, wählen Sie <menuchoice><guimenu>Einstellungen</guimenu> <guimenuitem>&kjumpingcube; einrichten ...</guimenuitem></menuchoice> in der Menüleiste. Auf Apple Mac OS X benutzen Sie die Option: <menuchoice><guimenu>&kjumpingcube;</guimenu><guimenuitem>Einstellungen</guimenuitem></menuchoice>. Oder Sie benutzen den Knopf <guibutton>Einstellungen</guibutton> in der Werkzeugleiste.

source: <screeninfo>&kjumpingcube; Settings</screeninfo>
de: <screeninfo>&kjumpingcube;-Einstellungen</screeninfo>

source: <phrase>&kjumpingcube; Settings</phrase>
de: <phrase>&kjumpingcube;-Einstellungen</phrase>

source: The Cascade Move Display and Cascade Move Time panels control the optional animation display when a cube reaches its maximum and spills over into neighboring cubes, possibly starting an extended cascade of moves. It is easiest at first to use the <quote>Scatter dots</quote> animation and a long move time. That is the best way to follow the progress of cascade moves. The two Pause check boxes let you step through animations and computer moves at your own pace.
de: In den letzten Bereichen zum Kaskadenzug kann die optionale Anzeige einer Animation eingestellt werden, die angezeigt wird, wenn ein Würfel die maximale Punktzahl erreicht, die Punkte auf angrenzende Würfel verschiebt und damit manchmal eine Kaskade von Verschiebungen auslöst. Am einfachsten ist es, zuerst die Animation <quote>Punkte streuen</quote> und eine lange Verschiebungszeit einzustellen. Das erleichtert es, den Fortschritt der Kaskade zu verfolgen. Mit den beiden Ankreuzfeldern zum Pausieren können Sie Animationen und Computerzüge schrittweise in Ihren eigenen Tempo verfolgen.

source: The Computer Player 1 and 2 panels control the style and level of each computer player's play and whether that player should actually play or just provide hints to human player 1 or 2.
de: In den Bereichen Computerspieler 1 und 2 kann die Art und Spielstärke für jeden Computerspieler eingestellt sowie gewählt werden, ob dieser Spieler tatsächlich spielt oder die menschlichen Spieler 1 oder 2 mit Tipps unterstützt.

source: Details of Settings
de: Einstellungsmöglichkeiten

source: Playing now
de: Spielt jetzt

source: Sets Computer Player 1 or 2 to be actively playing or just assisting a human player with hints. Normally you would set the computer to play one player and you would play the other, but you can have two human players or two computer players and just watch. Player 1 always starts first.
de: Legt fest, ob die Computerspieler 1 oder 2 aktiv spielen oder eine menschlichen Spieler mit Tipps unterstützten. Normalerweise spielen Sie gegen einen Computerspieler. Sie können aber auch menschliche Spieler oder zwei Computerspieler gegeneinander spielen lassen und das Spiel beobachten. Spieler 1 beginnt immer das Spiel.

source: Style of Play
de: Art des Spiels

source: Sets Computer Player 1 or 2 to play as Kepler or Newton. Kepler chooses moves by the same method as earlier versions of &kjumpingcube;. Newton uses a different method.
de: Lässt die Computerspieler als Kepler- oder Newton-AI spielen. Die Kepler-AI wählt Züge mit der gleichen Methode wie frühere Versionen von &kjumpingcube;. Die Newton-AI verwendet eine andere Methode.

source: Computer Skill
de: Spielstärke des Rechners

source: <action>Lets you choose a computer player's playing skill from a slider.</action> This decides how clever the computer opponent will be.
de: <action>Hier können Sie die Spielstärke des Computers mit einem Schieberegler wählen.</action> Die Spielstärke gibt an, wie stark der Computergegner ist.

source: You can choose any of five levels, ranging from <guilabel>Beginner</guilabel>, through <guilabel>Average</guilabel> to <guilabel>Expert</guilabel>.
de: Sie können zwischen fünf Spielstärken wählen, von <guilabel>Anfänger</guilabel> über <guilabel>Durchschnittlich</guilabel> bis <guilabel>Experte</guilabel>.

source: Board Size
de: Spielfeldgröße

source: Lets you choose the size of the play area.
de: Hier können Sie die Größe des Spielfeldes einstellen.

source: Use the slider to select a value between <guilabel>3x3</guilabel> cubes and <guilabel>15x15</guilabel> cubes. The range 5x5 to 9x9 is the most convenient. Below 5x5 it is very hard to beat the computer. Above 9x9 games can become rather long.
de: Mit Hilfe des Schiebereglers kann eine Feldgröße zwischen <guilabel>3x3</guilabel> und <guilabel>15x15</guilabel> Würfeln eingestellt werden. Der Bereich von 5x5 bis 9x9 ist am bequemsten zu spielen. Unter 5x5 ist es sehr schwer, den Computer zu schlagen. Mit mehr als 9x9 Würfeln dauern die Spiele sehr lange.

source: Players' Colors
de: Farben der Spieler

source: Choose a color for each player and for the neutral cubes.
de: Wählen Sie für jeden Spieler und die neutralen Würfel eine Spielfarbe

source: Cascade Move Display
de: Anzeige des Kaskadenzugs

source: Choose an animation style for when a cube reaches its maximum and expands into neighboring cubes, possibly starting a cascade of such moves and covering a large area of the board.
de: Wählen Sie hier eine Animationsart aus, die verwendet wird, wenn ein Würfel seine maximale Punktzahl erreicht und Punkte auf benachbarte Würfel verteilt. Damit wird möglicherweise eine Kasḱade solcher Züge ausgelöst, die sich über einen großen Teil des Spielbrett verbreiten.

source: Use the radio buttons to select from <quote>None (no pauses)</quote>, where the whole move is displayed instantaneously; <quote>Darken and pause</quote>, where each overloaded cube darkens until it is time for it to expand; <quote>Blink rapidly</quote>, where each overloaded cube darkens at first and then blinks rapidly when it is time for it to expand and <quote>Scatter dots</quote>, where each overloaded cube darkens at first and then fires dots into neighboring cubes when it is time for it to expand.
de: Mit den Auswahlköpfen können Sie folgende Animationen für Würfel wählen, die die maximale Punktzahl erreichen: <quote>Keine (keine Pause)</quote>, damit wird der ganze Zug sofort durchgeführt, <quote>Verdunklung und Pause</quote>, damit wird jeder überladene Würfel abgedunkelt, <quote>Schnelles Blinken</quote>. damit wird jeder überladene Würfel zuerst abgedunkelt und fängt dann an zu Blinken und <quote>Punkte streuen</quote>, damit wird jeder überladene Würfel zuerst abgedunkelt und streut dann Punkte in angrenzende Würfel.

source: Cascade Move Time
de: Zeit des Kaskadenzugs

source: Use the slider to select from a range of times (Short to Long) to be spent on animations. The times depend a little on the type of animation, but can range from 0.15 seconds to 1.5 seconds for each stage of a cascade move.
de: Benutzen Sie den Schieberegler, um aus einem Bereich für die Zeit von Kurz bis Lang auszuwählen, wie lange Animationen dauern. Die Zeit hängt zum Teil vom Animationstyp ab und liegt in einem Bereich von 0,15 bis 1,5 Sekunden für jeden Schritt eines Kaskadenzugs.

source: Pause before each computer move
de: Vor jedem Zug des Computers pausieren

source: If this check box is selected, computer players will pause before they start a move, until you click to resume. This is to help you follow the action, especially if you are a new player or studying a computer versus computer game.
de: Ist diese Einstellung aktiviert, werden Computerspieler vor jedem Zug anhalten, bis Sie zum weiter spielen klicken. Dies erleichtern es, solche Aktionen zu verfolgen, insbesondere wenn das Spiel für Sie neu ist oder Sie ein Spiel Computer gegen Computer beobachten möchten.

source: Pause before each cascade step
de: Vor jedem Kaskadenschritt pausieren

source: If this check box is selected, the animation of cascade moves will pause between steps, until you click to resume. This is to help you observe such a move as it spreads out over the board.
de: Ist diese Einstellung aktiviert, wird die Animation von Kaskadenzügen nach jeden Schritt anhalten, bis Sie zum weiter spielen klicken. Dies erleichtert es, solche Züge bei der Ausbreitung über das Spielfeld zu beobachten.

source: Credits and License
de: Danksagungen und Lizenz

source: &kjumpingcube; is Copyright 2012, 2013 Ian Wadham and Copyright 1998, 1999 &Matthias.Kiefer; &Matthias.Kiefer.mail;
de: &kjumpingcube; Copyright 2012, 2013 Ian Wadham und Copyright 2012, 2013 Ian Wadham and Copyright 1998, 1999 &Matthias.Kiefer; &Matthias.Kiefer.mail;

source: &kjumpingcube; was inspired by a game that came out for the Commodore 64 and other early home computers. Unfortunately the original author's name is unknown.
de: &kjumpingcube; wurde von einem Spiel angeregt, das es vor längerer Zeit für den Commodore 64 und wohl auch für andere Heimcomputer gab. Leider ist der Name des damaligen Autors nicht bekannt.

source: In 2007, Ian Wadham took over maintenance of &kjumpingcube; for &kde; 4 and Eugene Trounev painted the first SVG theme.
de: Seit 2007 ist Ian Wadham der Betreuer von &kjumpingcube; für &kde; und Eugene Trounev entwarf das erste SVG-Design.

source: In 2012 and 2013, Ian developed versions 2.0 and 2.1 of &kjumpingcube;, adding the animation styles, allowing board sizes down to 3x3 or up to 15x15 and writing completely new artificial intelligence modules that offer more of a challenge to a human player. These versions calculate moves faster, add multi-level undo/redo (previously only one move), add a choice of two AI opponents and provide options for beginning players to step through animations and computer moves.
de: Im Jahr 2012 und 2013 entwickelte Ian Wadham die Versionen 2.0 und 2.1 von &kjumpingcube;, fügte Animationstypen hinzu, ermöglichte die Verringerung des Spielfelds auf 3x3 Felder und die Vergrößerung auf 15x15 Felder und schrieb ein vollständig neues KI-Modul, das mehr Herausforderungen für menschliche Spieler bietet. Die neuen Versionen berechnen Züge erheblich schneller, erlauben mehrfaches Zurücknehmen und Wiederherstellen eines Zugs (vorher nur einmal möglich) und bieten Optionen für Anfänger, um Animationen und Computerzüge schrittweise auszuführen.

source: Documentation Copyright 2012, 2013 Ian Wadham and Copyright 1999 &Matthias.Kiefer; &Matthias.Kiefer.mail;
de: Copyright der Dokumentation 2012, 2013 Ian Wadham und 1999 &Matthias.Kiefer; &Matthias.Kiefer.mail;

source: Documentation updated for &kde; 2 and 3 by &Lauri.Watts; &Lauri.Watts.mail;
de: Dokumentation für &kde; 2 und 3 von &Lauri.Watts; &Lauri.Watts.mail; überarbeitet.

source: CREDIT_FOR_TRANSLATORS
de: <para>Deutsche Übersetzung von Maren Pakura <email>maren@kde.org</email></para>

source: Compilation and Installation
de: Kompilierung und Installation
