Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdegames/kjumpingcube.po
Languages: de

source: The &kjumpingcube; Handbook
de: Das Handbuch zu &kjumpingcube;

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Maren</firstname><surname>Pakura</surname><affiliation><address><email>maren@kde.org</email></address></affiliation><contrib>Deutsche Übersetzung</contrib></othercredit>

source: This documentation describes the game of &kjumpingcube; version &kappversion;
de: Dieses Handbuch beschreibt das Spiel &kjumpingcube; in der Version &kappversion;

source: game
de: Spiel

source: strategy
de: Strategie

source: dice
de: Würfel

source: dice game
de: Würfelspiel

source: playing dice
de: würfeln

source: two players
de: zwei Spieler

source: cube
de: Würfel

source: jump
de: Sprung

source: jumping cube
de: springender Würfel

source: Introduction
de: Einführung

source: Gametype:
de: Spieltyp:

source: Strategy, Dice
de: Strategiespiel, Würfelspiel

source: Number of possible players:
de: Anzahl der Spieler:

source: <para>Two</para>
de: <para>Zwei</para>

source: &kjumpingcube; is a simple tactical game. You can play it against the computer or a friend - or you can set up a game between two computer players and just watch.
de: &kjumpingcube; ist ein einfaches Taktikspiel, das Sie gegen einen Freund oder den Rechner spielen können. Außerdem können Sie zwei Computerspieler gegeneinander spielen lassen und das Spiel einfach nur beobachten.

source: That can be a good idea if you have not played &kjumpingcube; before. See <link linkend="faq">Frequently asked questions</link>, <quote>How do I get started in this game?</quote>.
de: Das ist sinnvoll, wenn Sie &kjumpingcube; vorher noch nicht gespielt haben. Siehe auch <quote>Wie erlerne ich dieses Spiel?</quote> im Kapitel <link linkend="faq">Häufig gestellte Fragen</link>.

source: The playing area is a box of cubes containing points. When the game starts each cube has one point, no owner and a neutral color. If you click on a neutral cube it becomes yours, changes to your color and increases by one point. Your objective is to capture all the cubes, but now it is your opponent's turn.
de: Der Spielbereich besteht aus Würfeln mit Punkten. Beim Spielbeginn hat jeder Würfel einen Punkt, keinen Besitzer und eine neutrale Farbe. Durch Klicken auf einen neutralen Würfel werden Sie dessen Besitzer, ändern den Würfel zu Ihrer Farbe und erhöhen die Anzahl der Punkte um 1. Ihr Ziel ist es, alle Würfel zu besitzen, aber jetzt ist Ihr Gegner am Zug.

source: Players move and add points by clicking on neutral cubes or their own cubes.
de: Spieler ziehen und erhalten Punkte, indem Sie auf neutrale oder eigene Würfel klicken.

source: The only way to capture your opponent's cubes is to increase a cube's value until it reaches a maximum and expands into neighboring cubes. Then those cubes become yours, even if they belonged to your opponent before.
de: Die einzige Möglichkeit zur Übernahme der Würfel des Gegners besteht darin, den Wert eines Würfels bis zum Maximum zu erhöhen und Punkte auf benachbarte Würfel zu verteilen. Dann übernehmen Sie diese Würfel, auch wenn Sie vorher Ihrem Gegner gehörten.

source: Sometimes a neighbor will also reach a maximum value and expand and a cascade of moves will spread across the board. Large numbers of cubes can suddenly change hands and this is where &kjumpingcube; becomes interesting and challenging.
de: Manchmal erreicht ein angrenzender Würfel ebenfalls das Maximum, verteilt Punkte auf benachbarte Würfel und eine Kaskade von Zügen verbreitet sich über das Spielfeld. Viele Würfel können plötzlich den Besitzer wechseln, dadurch wir &kjumpingcube; interessant und aufregend.

source: How to Play
de: Spielanleitung

source: Objective:
de: Ziel des Spiels:

source: Take over all the cubes on the game board.
de: Besetzen Sie alle Würfel auf dem Spielfeld.

source: &kjumpingcube; loads directly into game mode, so you can start playing right away. If Player 1 is a computer player, you must click to get started.
de: Nach dem Start von &kjumpingcube; können Sie direkt mit dem Spiel beginnen. Wenn Spieler 1 vom Rechner gespielt wird, müssen Sie klicken, um das Spiel zu starten.

source: If you have not played &kjumpingcube; before, try watching a game or two where the computer plays against itself. See <link linkend="faq">Frequently asked questions</link>, <quote>How do I get started in this game?</quote>.
de: Wenn Sie &kjumpingcube; noch nicht gespielt haben, sollten Sie zuerst einige Spiele Computer gegen Computer beobachten. Siehe auch <quote>Wie erlerne ich dieses Spiel?</quote> im Kapitel <link linkend="faq">Häufig gestellte Fragen</link>.

source: You move by clicking on a neutral cube or one you already own. If you click on a neutral cube, you gain ownership over it and the cube’s color changes to your playing color. Each time you click on a cube, the value of the cube increases by one. If the cube's value reaches a maximum, some of its points move to the cube’s immediate neighbors (the points <quote>jump</quote> around). If a neighboring cube happens to be owned by the other player, it is captured, together with all of its points, and changes to your playing color.
de: Sie ziehen durch Klicken auf einen unbesetzten oder bereits von Ihnen gewonnenen Würfel. Wenn Sie auf einen unbesetzten Würfel klicken, geht er in Ihren Besitz über und wechselt zu Ihrer Spielfarbe. Jedesmal, wenn Sie auf einen Würfel klicken, steigt die Punktzahl des Würfel um eins. Wenn diese ein Maximum überschreitet, werden die Punkte auf die angrenzenden Würfel übertragen (die Punkte <quote>springen</quote> herum). Wenn ein angrenzender Würfel dem Gegner gehört, wird er mit all seinen Punkten übernommen und ändert die Farbe zu Ihrer.

source: Example:
de: Beispiel:

source: If a cube in the centre reaches five points, four of its points go to its four neighbors leaving the source cube with one point. It is possible to start a cascade of automatic moves if any of the neighbors cubes also reaches a maximum.
de: Wenn ein Würfel im Zentrum fünf Punkte erreicht, gehen vier der Punkte auf die benachbarten vier Würfeln über, ein Punkt bleibt im Würfel. Wenn die benachbarten Würfel dadurch ebenfalls ein Maximum erreichen, kann es zu einer Folge automatischer Züge kommen.

source: Note:
de: Hinweis:

source: Large parts of the playing area can change hands very rapidly. You can use animation settings to help you follow what is happening then. See the <link linkend="configuration">Game Configuration</link> section for more details.
de: Die Besitzer von großen Teiles des Spielbereich können sehr schnell wechseln. Verwenden Sie die Animationseinstellungen, die in diesen Fällen helfen, die Übersicht zu behalten. Weitere Informationen finden Sie Im Kapitel <link linkend="configuration">Einstellungen für das Spiel</link>.

source: The winner is the player who ends up owning all the cubes on the board.
de: Gewinner ist der Spieler, dem am Ende alle Felder auf dem Spielfeld gehören.

source: Game Rules, Strategies and Tips
de: Spielregeln, Spielstrategien und Tipps

source: Rules
de: Spielregeln

source: A move consists of clicking on a cube that does not belong to your opponent.
de: Ein Zug besteht aus einem Klick auf einen Würfel, der nicht Ihrem Gegner gehört.

source: The move increases the points in the cube by one.
de: Ein Zug erhöht die Punktzahl des Würfels um eins.

source: At the start of the game, each cube has one point, is painted in a neutral color and has no owner.
de: Zu Beginn des Spiels hat jeder Würfel einen Punkt, eine neutrale Farbe und keinen Besitzer.

source: Each player has a color to mark the ownership of cubes.
de: Die Würfel jedes Spielers werden in seiner eigenen Farbe angezeigt.

source: By clicking a cube that has no owner, the player becomes the owner of that cube and it changes its color to the player's color. Simultaneously the cube’s value is increased by one.
de: Indem Sie auf einen unbesetzten Würfel klicken, geht er in Ihren Besitz über und ändert die Farbe zu Ihrer Spielfarbe. Gleichzeitig steigt die Punktzahl des Würfels um eins.

source: If a cube has more points than it has neighbors, one point jumps to each of the neighbors.
de: Wenn ein Würfel mehr Punkte als benachbarte Würfel hat, springt ein Punkt auf jeden angrenzenden Würfel über.

source: During such a move, all the neighboring cubes become owned by the player who moved and so do all of their points, even if the neighbors were neutral or owned by the other player.
de: Bei einem solchen Zug gehen alle benachbarten Würfel mit all ihren Punkten in den Besitz des ziehenden Spielers über, auch wenn die Würfel unbesetzt waren oder dem Gegner gehörten.

source: Neighbors are the cubes located above, below, at left or at right, but not diagonally. Corner cubes have two neighbors, edge cubes have three and center cubes have four.
de: Nachbarn sind die Würfel oberhalb, unterhalb, rechts oder links eines Würfels, aber nicht die diagonal angeordneten. Eckwürfel haben nur zwei Nachbarn, Seitenwürfel drei, und zentrale Würfel haben vier Nachbarn.

source: If a move leaves a neighbor with a maximum number of points, the move continues automatically to the neighbor's neighbors and so on, in a cascade. A large number of cubes can change ownership during such a move.
de: Wenn ein Nachbar durch einen Zug ein Maximum an Punkten erhält, setzt sich der Zug automatisch kaskadenartig auch auf die Nachbarn der Nachbarn und so weiter fort. Eine große Anzahl an Würfeln kann während eines solchen Zuges den Besitzer wechseln.

source: The winner is the player who ends up owning all the cubes.
de: Gewinner ist der Spieler, dem am Ende alle Würfel gehören.

source: You can use settings to select board size, computer players, move animations and players' colors. Each computer player can have its own style and skill level. If not playing, it can provide hints to the corresponding human player. You can also pit one computer player against another and watch the outcome. See the <link linkend="configuration">Game Configuration</link> section for more details.
de: Im Einrichtungsdialog können Sie die Größe des Spielfelds, Computerspieler, Animationen der Züge und Farben für die Spieler auswählen. Jeder Computerspieler kann auf seine eigene Art spielen und eine bestimmte Spielstärke haben. Sie können auch zwei Computer gegeneinander spielen lassen und den Ablauf verfolgen. Im Abschnitt <link linkend="configuration">Spieleinstellungen</link> finden Sie weitere Informationen.

source: Strategies and Tips
de: Spielstrategien und Tipps

source: It may help to set up a computer v. computer game and select the check boxes in the settings dialog that let you step through moves and animations at your own pace. See <link linkend="faq">Frequently asked questions</link>, <quote>How do I get started in this game?</quote> and <quote>That was too fast for me, how can I slow it down?</quote>.
de: Es ist hilfreich, ein Spiel Computer gegen Computer einzustellen und im Einrichtungsdialog die Ankreuzfelder für die schrittweise Ausführung von Zügen und Animationen zu aktivieren. Siehe auch <quote>Wie erlerne ich dieses Spiel?</quote> und <quote>Das war zu schnell für mich, kann das auch langsamer gezeigt werden?</quote> im Kapitel <link linkend="faq">Häufig gestellte Fragen</link>.

source: If you have a cube which is right next to an opponent's cube, try to stay ahead by increasing before your opponent does.
de: Haben Sie einen Würfel direkt neben dem Würfel des Gegners, versuchen Sie durch Erhöhung der Punkte immer mehr Punkte auf Ihrem Würfel als der Gegner zu haben.

source: If such a cube's points are less than or equal to the opponent's, try to avoid increasing: you cannot win that arms race.
de: Hat einer Ihrer Würfel neben dem Würfel eines Gegners weniger oder gleich viele Punkte, vermeiden Sie die Erhöhung der Punktzahl: Sie können dieses Wettrüsten nicht gewinnen.

source: Look for opportunities to increase and capture, but beware of your opponent being able to reply by starting a cascade.
de: Suchen Sie nach Möglichkeiten, die Punktzahl Ihres Würfels zu erhöhen und andere Würfel zu übernehmen, vermeiden Sie aber, dass der Gegner durch den Start einer Kaskade antworten kann.

source: Try to get control of the corner cubes first, then the edge cubes. You need fewer moves to make them reach a maximum and expand.
de: Besetzen Sie zuerst die Eckfelder, dann die Randfelder. Für diese Felder brauchen Sie weniger Züge, um die maximale Punktzahl zu erreichen und um Punkte auf benachbarte Würfel zu verteilen.

source: Try not to play too close to your opponent, especially during the opening moves. Drop back a cube or two or pick a cube on the diagonal from your opponent.
de: Versuchen Sie, nicht zu nah an Ihrem Gegner zu spielen, vor allem nicht während der Anfangs-Züge. Lassen Sie ein oder zwei Würfel Abstand oder wählen Sie einen zu Ihrem Gegner diagonal liegenden Würfel.

source: Keep an eye out for long chains of cubes that are almost at their maximum. If they are yours, you must guard them against cascading moves. If they are your opponent's, they can become ripe for capture by a cascading move, just as soon as they are close enough to your territory.
de: Behalten Sie lange Ketten von Würfeln mit nahezu maximaler Punktzahl im Auge. Wenn es Ihre sind, müssen Sie sie vor Kaskaden beschützen. Wenn sie Ihrem Gegner gehören, können Sie sie, sobald die Würfel nah genug an Ihr Territorium grenzen, in Ihre eigenen Kaskaden einbeziehen.

source: Interface Overview
de: Die Benutzeroberfläche

source: The Toolbar
de: Die Werkzeugleiste

source: The Stop/Start Button
de: Der Knopf zum Anhalten/Fortsetzen

source: This large button appears at the top left of the toolbar and is used to provide control over animations and computer moves, especially if the computer has the first move, is playing against itself or is taking too long to move. The button can also be used for stepping through a game or a move, to let beginning players view each step at their own pace. Check boxes in the settings dialog turn the step mode on or off (see the <link linkend="configuration">Game Configuration</link> section for more details).
de: Dieser große Knopf wird oben links in der Werkzeugleiste angezeigt. Damit können Animationen und Computerzüge gesteuert werden, insbesondere wenn der Computer den ersten Zug hat, Computer gegen einander spielen oder ein Zug zu lange dauert. Mit diesem Knopf können Sie ein Spiel oder einen Zug auch schrittweise ausführen, damit Anfänger jeden Schritt genau verfolgen können. Im Einrichtungsdialog können Sie diese Funktion ein- oder ausschalten. Im Kapitel <link linkend="configuration">Spieleinstellungen</link> finden Sie weitere Informationen.

source: The button has three states:
de: Der Knopf hat drei Zustände:

source: <term>Red</term>
de: <term>Rot</term>

source: It is possible to stop or interrupt a computer calculation, an animation or a computer v. computer game.
de: Eine Computerberechnung, eine Animation oder ein Spiel Computer gegen Computer kann angehalten oder abgebrochen werden.

source: Green
de: Grün

source: It is possible to start or continue a computer move, an animation or a computer v. computer game.
de: Ein Computerzug, eine Animation oder ein Spiel Computer gegen Computer kann angehalten oder fortgesetzt werden.

source: Blue
de: Blau

source: The button is disabled and a human action is expected, such as making the next move.
de: Der Knopf ist deaktiviert und eine Aktion des menschlichen Spieler ist erforderlich, wie zum Beispiel den nächsten Spielzug auszuführen.

source: In each case, the button contains some text to indicate what action can be done or is expected, such as <guibutton>Stop animation</guibutton> or <guibutton>Your turn</guibutton>.
de: In jedem Zustand wird auch Text auf dem Knopf angezeigt, der eine mögliche oder erwartete Aktion angibt, wie zum Beispiel <guibutton>Animation anhalten</guibutton> oder <guibutton>Ihr Zug</guibutton>.

source: If you stop the calculation of a computer move, the computer will pick the best move it has so far. If you interrupt an animation (&eg; a cascade that is taking too long), the move will proceed to its conclusion immediately.
de: Wenn Sie die Berechnung eines Computerzugs abbrechen, wird der beste bis dahin ermittelte Zug ausgeführt. Wenn Sie eine Animation wie zum Beispiel eine zu lang dauernde Kaskade unterbrechen, wird sofort das Ende des Zuges angezeigt.

source: Standard Toolbar Buttons
de: Standardknöpfe in der Werkzeugleiste

source: Settings
de: Einstellungen

source: A shortcut to enter the settings dialog and change playing conditions. See the <link linkend="configuration">Game Configuration</link> section for more details.
de: Öffnet einen Dialog zur Einrichtung des Spiels. Weitere Informationen finden Sie im Kapitel <link linkend="configuration">Einstellungen für das Spiel</link>.

source: <guiicon>New</guiicon>
de: <guiicon>Neu</guiicon>

source: Start a new game.
de: Startet ein neues Spiel.

source: Load
de: Laden

source: Load a previously saved game.
de: Lädt ein zuvor gespeichertes Spiel.

source: Save
de: Speichern

source: Save the current game.
de: Speichert das aktuelle Spiel.

source: Hint
de: Tipp

source: Get a hint as to the best move to make next. The hint is calculated by computer player 1 or 2, depending on whether you are human player 1 or 2. See the <link linkend="configuration">Game Configuration</link> section for more details.
de: Gibt einen Tipp für den besten nächsten Zug, Der Tipp wird durch Computerspieler 1 oder 2 berechnet, abhängig davon, ob Sie der menschliche Spieler 1 oder 2 sind. Weitere Informationen finden Sie Im Kapitel <link linkend="configuration">Einstellungen für das Spiel</link>.

source: Undo
de: Zurücknehmen

source: <action>Undo a previous move, repeatedly if required. </action> Note: It is possible to undo the closing moves of a completed game and investigate alternative endings.
de: <action>Nimmt einen vorher ausgeführten Zug zurück, das kann auch mehrfach ausgeführt werden.</action> Es ist auch möglich, die letzten Züge eines beendeten Spiels wieder zurückzunehmen und alternative Endzüge zu untersuchen.

source: Redo
de: Wiederherstellen

source: Redo a move that was undone, repeatedly if required.
de: Hiermit wird der zuletzt zurückgenommene Zug wiederhergestellt, das ist auch mehrmals möglich.

source: Menu Items
de: Menüeinträge

source: The Game Menu
de: Das Menü Spiel

source: <shortcut><keycombo action="simul"> &Ctrl;<keycap>N</keycap></keycombo></shortcut> <guimenu>Game</guimenu><guimenuitem>New</guimenuitem>
de: <shortcut><keycombo action="simul"> &Ctrl;<keycap>N</keycap></keycombo></shortcut> <guimenu>Spiel</guimenu><guimenuitem>Neu</guimenuitem>

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>O</keycap></keycombo></shortcut> <guimenu>Game</guimenu><guimenuitem>Load...</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>O</keycap></keycombo> </shortcut> <guimenu>Spiel</guimenu> <guimenuitem>Laden ...</guimenuitem>

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>S</keycap></keycombo></shortcut> <guimenu>Game</guimenu><guimenuitem>Save</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>S</keycap></keycombo> </shortcut> <guimenu>Spiel</guimenu> <guimenuitem>Speichern</guimenuitem>

source: <guimenu>Game</guimenu><guimenuitem>Save As...</guimenuitem>
de: <guimenu>Spiel</guimenu><guimenuitem>Speichern unter ...</guimenuitem>

source: Save the current game with a different name.
de: Speichert das aktuelle Spiel unter einem anderen Namen.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo></shortcut> <guimenu>Game</guimenu><guimenuitem>Quit</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo> </shortcut> <guimenu>Spiel</guimenu> <guimenuitem>Beenden</guimenuitem>

source: <action>Quit</action> &kjumpingcube;.
de: <action>Beendet</action> &kjumpingcube;.

source: The Move Menu
de: Das Menü Zug

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Z</keycap></keycombo></shortcut> <guimenu>Move</guimenu><guimenuitem>Undo</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>Z</keycap> </keycombo></shortcut> <guimenu>Zug</guimenu><guimenuitem>Zurücknehmen</guimenuitem>

source: <shortcut><keycombo action="simul">&Ctrl;&Shift;<keycap>Z</keycap></keycombo></shortcut> <guimenu>Move</guimenu><guimenuitem>Redo</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;&Shift;<keycap>Z</keycap></keycombo></shortcut> <guimenu>Zug</guimenu><guimenuitem>Wiederherstellen</guimenuitem>

source: <shortcut><keycap>H</keycap></shortcut> <guimenu>Move</guimenu><guimenuitem>Hint</guimenuitem>
de: <shortcut> <keycap>H</keycap> </shortcut> <guimenu>Zug</guimenu> <guimenuitem>Tipp</guimenuitem>

source: Other Menus
de: Weitere Menüs

source: Additionally &kjumpingcube; has the common &kde; <guimenu>Settings</guimenu> and <guimenu>Help</guimenu> menu items, for more information read the sections about the <ulink url="help:/fundamentals/ui.html#menus-settings">Settings Menu</ulink> and <ulink url="help:/fundamentals/ui.html#menus-help">Help Menu</ulink> of the &kde; Fundamentals.
de: Zusätzlich hat &kjumpingcube; die bekannten &kde;-Einträge im Menü <guimenu>Einstellungen</guimenu> und <guimenu>Hilfe</guimenu>, weitere Informationen dazu finden Sie in den Abschnitten über die Menüs <ulink url="help:/fundamentals/ui.html#menus-settings">Einstellungen</ulink> und <ulink url="help:/fundamentals/uihtml#menus-help">Hilfe</ulink> der &kde;-Grundlagen.

source: Frequently asked questions
de: Häufig gestellte Fragen

source: I want to change the way this game looks. Can I?
de: Kann ich das Erscheinungsbild des Spiels ändern?

source: Currently you can only change the player's colors, but not the game theme. To change the player's colors use the <link linkend="configuration">Game Configuration</link> dialog.
de: In dieser Version können Sie nur die Farben für die Spieler im Dialog <link linkend="configuration">Einstellungen für das Spiel</link> ändern, aber nicht das Design des Spiels.

source: How do I get started in this game?
de: Wie erlerne ich dieses Spiel?

source: The moves of &kjumpingcube; can be hard to follow at first. One way to learn is to watch games where the computer plays against itself. Use the <link linkend="configuration">Game Configuration</link> dialog to set it up. Check both <guilabel>Playing now</guilabel> boxes, choose a board size in the range 3x3 to 5x5, set the animation to <guilabel>Scatter dots</guilabel> and the move-time to <guilabel>Long</guilabel>, then click <guibutton>OK</guibutton>. Now click the big green button in the toolbar to start the game.
de: Es ist anfangs schwierig, die Spielzüge in &kjumpingcube; zu verfolgen. Eine Möglichkeit zum Kennenlernen von &kjumpingcube; besteht darin, den Computer gegen sich selbst spielen zu lassen. Benutzen Sie dazu die Optionen im Dialog <link linkend="configuration">Spieleinstellungen</link>. Kreuzen Sie die Felder <guilabel>Spielt jetzt</guilabel> an, wählen Sie eine Spielfeldgröße im Bereich von 3x3 bis 5x5, wählen Sie <guilabel>Punkte streuen</guilabel> für die Anzeige des Kaskadenzugs, setzen Sie die Kaskadenzeit auf <guilabel>Lang</guilabel> und klicken Sie auf <guibutton>OK</guibutton>. Klicken Sie dann auf den großen grünen Knopf in der Werkzeugleiste, um das Spiel zu starten.

source: That was too fast for me, how can I slow it down?
de: Das war zu schnell für mich, kann das auch langsamer gezeigt werden?
