Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdegames/klickety.po
Languages: de

source: The &klickety; Handbook
de: Das Handbuch zu &klickety;

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Johannes</firstname><surname>Obermayr</surname><affiliation><address><email>johannesobermayr@gmx.de</email></address></affiliation><contrib>Übersetzung</contrib></othercredit>

source: &klickety; is a strategy game for &kde;, an adaption of the <application>Clickomania</application> game.
de: &klickety; ist eine angepasste Version des <application>Clickomania</application>-Strategiespiels für &kde;.

source: game
de: Spiel

source: board
de: Brettspiel

source: logic
de: Logik

source: strategy
de: Strategie

source: one player
de: Einzelspieler

source: Introduction
de: Einleitung

source: Gametype:
de: Spielart:

source: Board
de: Brettspiel

source: Number of possible players:
de: Anzahl der Spieler:

source: <para>One</para>
de: <para>Einer</para>

source: &klickety; is an adaptation of the Clickomania game. The rules are similar to those of the Same game: your goal is to clear the board by clicking on groups to destroy them. The overall aim is to get the lowest score possible. It will provide entertainment for all abilities, but a challenge in logical thought if you want to get a really low score.
de: &klickety; ist eine angepasste Version des Spiels <emphasis>Clickomania</emphasis> für &kde;. Die Spielregeln sind mit denen des Spiels <emphasis>Same</emphasis> vergleichbar: Das Spielfeld muss durch Anklicken von gruppierten Stücken geleert werden. Das grundsätzliche Ziel besteht im Erreichen einer möglichst niedrigen Punktzahl. Es bietet Unterhaltung für alle Fähigkeiten und eine Herausforderung hinsichtlich des logischen Denkvermögens sofern eine möglichst niedrige Punktzahl erreicht werden soll.

source: How to Play
de: Spielanleitung

source: Objective:
de: Spielziel:

source: Clear the game board of all the colored blocks in the least possible time.
de: Das Spielfeld von allen Stücken in möglichst kurzer Zeit zu befreien.

source: When you start the program you will get a screen that looks something like the screenshot in the previous section. The idea of the game is to remove blocks, which you do by clicking on them.
de: Sobald &klickety; aufgerufen wurde, wird ein Fenster angezeigt, das dem Bildschirmfoto im nächsten Abschnitt ähnlich ist. Die Idee des Spiels ist das Entfernen der Stücke vom Spielfeld indem auf diese geklickt wird.

source: However, you can only remove a block if it is adjacent to one or more other blocks of the same color on one or more of its sides. Diagonal connections do not count. You get a random board every time you start a new game.
de: Jedoch können jeweils nur zwei oder mehr zusammenhängende Stücke derselben Farbe entfernt werden, wobei diagonale Verbindungen nicht berücksichtigt werden. Bei jedem Start eines neuen Spiels wird ein zufälliges Spielfeld gewählt.

source: If you click on a block which is connected as described, it will disappear. Any adjacent blocks of the same color will also disappear, along with all of the same color adjacent to <emphasis>them</emphasis>, and so on. Any blocks above them drop down to fill the gaps left by the disappeared pieces. If you clear an entire column, all the columns to the right move across to fill the gap.
de: Wenn Sie auf einen Block klicken, der, wie beschrieben, andere gleichfarbige Blöcke als Nachbarn hat, verschwindet er. Genauso verschwinden die direkt benachbarten gleichfarbigen Blöcke und ebenso neben <emphasis>diesen</emphasis> gelegene gleichfarbige Blöcke und so weiter. Alle Blöcke oberhalb der entfernten Blöcke rutschen nach unten in die entstandenen Lücken. Wenn Sie eine ganze Spalte entfernt haben, werden alle vorhandenen Spalten von rechts in diese Lücke geschoben.

source: The game ends when there are no blocks adjacent to other blocks of the same colour.
de: Das Spiel ist beendet sobald keine zusammenhängende Stücke derselben Farbe mehr verfügbar sind.

source: The Game Screen
de: Programmfenster

source: A screenshot of &klickety;
de: Ein Bildschirmfoto von &klickety;.

source: Screenshot
de: Bildschirmfoto

source: A quick explanation of the parts of the game screen.
de: Eine kurze Beschreibung aller Teile des Programmfensters.

source: Game Screen
de: Spielfeld

source: The Game screen is in the center of the screen and is the largest section of the window.
de: Das Spielfeld in der Mitte belegt den größten Teil des Programmfensters.

source: Statusbar
de: Statusleiste

source: The Status bar is located at the bottom of the screen. It displays how many pieces are left currently and the game timer, which keeps track of the elapsed time from the start of the game until the game is finished.
de: Die Statusleiste befindet sich im unteren Teil des Programmfensters. Es zeigt die aktuell verbleibenden Stücke und die Spielzeit vom Beginn bis zum Ende des jeweiligen Spiels an.

source: The KSame Mode
de: KSame-Modus

source: &klickety; provides a &ksame; scoring mode.
de: &klickety; stellt auch das Punktemodell von <emphasis>&ksame;</emphasis> zur Verfügung.

source: The score is calculated as follows:
de: Die Punkte werden dabei wie folgt berechnet:

source: Subtract 2 from the number of marbles erased, and square the result.
de: Zunächst ist die Anzahl der Stücke des zusammenhängenden Blocks um zwei zu vermindern und dieses Ergebnis zu Quadrieren (<emphasis>[Stückanzahl - 2]²</emphasis>).

source: As an example, if you erase 7 balls, then you get 25 points (7 minus 2 = 5. 5 squared is 25 points).If you erase 8 balls, then you get 36 points (8 minus 2 = 6. 6 squared is 36 points.
de: Beispielsweise werden beim Entfernen von 7 Stücken 25 Punkte erreicht (<emphasis>[7-2]² = 5² = 25</emphasis>). Beim Entfernen von 8 Stücken ergeben sich folglich 36 Punkte (<emphasis>[8-2]² = 6² =36</emphasis>).

source: Get as many of the same pieces as you can, and then erase them in one click. That way you will get a higher score. The game is over when there are no pieces that can be erased.
de: Versuchen Sie, soviele zusammenhängende Kugeln wie möglich zu erhalten und sie mit einem Klick zu entfernen. Auf diese Weise erhalten Sie eine höhere Punktzahl. Das Spiel ist beendet, wenn Sie keine Kugeln mehr entfernen können.

source: The score will then be decreased according to the number of remaining pieces. If you erase all pieces 1,000 bonus points will be added to the final score.
de: Die Punktzahl wird um die Anzahl der übrig gebliebenen Kugeln verringert. Wenn Sie alle Kugeln entfernen, werden 1000 Punkte zu Ihrer Endpunktzahl addiert.

source: A screenshot of &klickety; in KSame mode
de: Bildschirmfoto von &klickety; im KSame-Modus

source: Interface Overview
de: Die Benutzeroberfläche

source: Default Keybindings
de: Standard-Tastenkürzel

source: Default shortcuts are:
de: Folgende Kurzbefehle sind als Standard eingestellt:

source: Shortcuts
de: Kurzbefehle

source: <entry>New</entry>
de: <entry>Neu</entry>

source: Load
de: Laden

source: Restart Game
de: Spiel neu starten

source: Save
de: Speichern

source: Show High Scores
de: Bestenliste anzeigen

source: Quit
de: Beenden

source: Undo
de: Rückgängig

source: Redo
de: Wiederherstellen

source: Help
de: Hilfe

source: What's this?
de: <quote>Was ist das?</quote>-Hilfe

source: Menu Items
de: Menüeinträge

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo></shortcut> <guimenu>Game</guimenu> <guimenuitem>New</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo></shortcut><guimenu>Spiel</guimenu> <guimenuitem>Neu</guimenuitem>

source: Starts a new game.
de: Startet ein neues Spiel.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>O</keycap></keycombo></shortcut> <guimenu>Game</guimenu> <guimenuitem>Load...</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>O</keycap></keycombo></shortcut><guimenu>Spiel</guimenu> <guimenuitem>Laden ...</guimenuitem>

source: Loads a previously saved game.
de: Lädt ein vorher gespeichertes Spiel.

source: <shortcut><keycap>F5</keycap></shortcut> <guimenu>Game</guimenu> <guimenuitem>Restart Game</guimenuitem>
de: <shortcut><keycap>F5</keycap></shortcut><guimenu>Spiel</guimenu><guimenuitem>Spiel neu starten</guimenuitem>

source: This will restart the current game.
de: Startet das aktuelle Spiel erneut.

source: <guimenu>Game</guimenu> <guimenuitem>New Numbered Game...</guimenuitem>
de: <guimenu>Spiel</guimenu><guimenuitem>Neue Spielnummer ...</guimenuitem>

source: Starts a specifically numbered game.
de: Startet ein Spiel mit einer bestimmten Nummer.

source: <screeninfo>Start a Numbered Game Dialog</screeninfo>
de: <screeninfo>Spiel mit bestimmter Nummer starten</screeninfo>

source: <phrase>Start a Numbered Game Dialog</phrase>
de: <phrase>Spiel mit bestimmter Nummer starten</phrase>

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>S</keycap></keycombo></shortcut> <guimenu>Game</guimenu> <guimenuitem>Save</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>S</keycap></keycombo></shortcut><guimenu>Spiel</guimenu> <guimenuitem>Speichern</guimenuitem>

source: Saves the current state of the game to the disk.
de: Speichert den aktuellen Spielstand auf die Festplatte.

source: <shortcut><keycap>P</keycap></shortcut> <guimenu>Game</guimenu> <guimenuitem>Pause</guimenuitem>
de: <shortcut><keycap>P</keycap> </shortcut><guimenu>Spiel</guimenu><guimenuitem>Pause</guimenuitem>

source: Pauses or resumes the game. While the game is paused, all tiles are hidden.
de: Hält das Spiel an bzw. setzt es fort. Wenn das Spiel angehalten ist, werden alle Spielsteine ausgeblendet.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>H</keycap></keycombo></shortcut> <guimenu>Game</guimenu> <guimenuitem>Show High Scores</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>H</keycap></keycombo></shortcut><guimenu>Spiel</guimenu><guimenuitem>Bestenliste anzeigen</guimenuitem>

source: Shows the high score list.
de: Zeigt die Bestenliste an.

source: <screeninfo>Show High scores</screeninfo>
de: <screeninfo>Bestenliste anzeigen</screeninfo>

source: <phrase>Show High scores</phrase>
de: <phrase>Bestenliste anzeigen</phrase>

source: When your game scores exceed the top ten scores listed, you are prompted to enter your name.
de: Sobald die Punktzahl im Bereich der zehn besten liegt, erfolgt die Aufforderung zur Eingabe des Namens.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo></shortcut> <guimenu>Game</guimenu> <guimenuitem>Quit</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo></shortcut><guimenu>Spiel</guimenu><guimenuitem>Beenden</guimenuitem>

source: Selecting this item will end your current game, and exit &klickety;.
de: Durch Auswahl dieser Funktion werden das aktuelle Spiel und &klickety; beendet.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>Z</keycap></keycombo></shortcut> <guimenu>Move</guimenu> <guimenuitem>Undo</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>Z</keycap></keycombo></shortcut><guimenu>Zug</guimenu><guimenuitem>Zurücknehmen</guimenuitem>

source: Undo the last move you made.
de: Nimmt den zuletzt ausgeführten Spielzug zurück.

source: <shortcut><keycombo action="simul">&Ctrl;&Shift;<keycap>Z</keycap></keycombo></shortcut> <guimenu>Move</guimenu> <guimenuitem>Redo</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;&Shift;<keycap>Z</keycap></keycombo></shortcut><guimenu>Zug</guimenu><guimenuitem>Wiederherstellen</guimenuitem>

source: If you have previously undone a move, you can redo it here.
de: Stellt einen vorher zurückgenommenen Spielzug wieder her.

source: <guimenu>Move</guimenu> <guimenuitem>Undo All</guimenuitem>
de: <guimenu>Zug</guimenu><guimenuitem>Alles zurücknehmen</guimenuitem>

source: <action>Undo</action> all moves you made.
de: <action>Nimmt</action> alle ausgeführten Züge zurück.

source: <guimenu>Move</guimenu> <guimenuitem>Redo All</guimenuitem>
de: <guimenu>Zug</guimenu><guimenuitem>Alles wiederherstellen</guimenuitem>

source: <action>Redo</action> all undone moves.
de: <action>Stellt</action> alle zurückgenommenen Züge wieder her.

source: <guimenu>Settings</guimenu> <guisubmenu>Difficulty</guisubmenu>
de: <guimenu>Einstellungen</guimenu> <guisubmenu>Schwierigkeitsgrad</guisubmenu>

source: Lets you set the difficulty level from a sub-menu.
de: Hier können Sie den Schwierigkeitsgrad aus einem Untermenü wählen.

source: There are four levels of difficulty:
de: Es gibt vier Schwierigkeitsgrade:

source: <guimenuitem>Very easy</guimenuitem>: 16 rows, 10 columns, 3 types of pieces.
de: <guimenuitem>Sehr einfach</guimenuitem>: 16 Zeilen, 10 Spalten, 3 Arten von Steinen.

source: <guimenuitem>Easy</guimenuitem>: 16 rows, 10 columns, 4 types of pieces.
de: <guimenuitem>Einfach</guimenuitem>: 16 Zeilen, 10 Spalten, 4 Arten von Steinen.

source: <guimenuitem>Medium</guimenuitem>: 16 rows, 10 columns, 5 types of pieces.
de: <guimenuitem>Mittel</guimenuitem>: 16 Zeilen, 10 Spalten, 5 Arten von Steinen.

source: <guimenuitem>Hard</guimenuitem>: 16 rows, 10 columns, 6 types of pieces.
de: <guimenuitem>Schwierig</guimenuitem>: 16 Zeilen, 10 Spalten, 6 Arten von Steinen.

source: There is also a <guimenuitem>Custom</guimenuitem> level settings.
de: Es gibt ausserdem Einstellungen für <guimenuitem>Benutzerdefinierte</guimenuitem> Schwierigkeitsgrade.

source: If you select <guimenuitem>Custom</guimenuitem>, then the settings you have configured in the <guimenuitem>Configure &klickety;</guimenuitem> dialog will be used.
de: Falls Sie <guimenuitem>Benutzerdefiniert</guimenuitem> auswählen, werden die im Dialog <guimenuitem>&klickety; einrichten</guimenuitem> eingestellten Werte verwendet.

source: Additionally &kappname; has the common &kde; <guimenu>Settings</guimenu> and <guimenu>Help</guimenu> menu items, for more information read the sections about the <ulink url="help:/fundamentals/ui.html#menus-settings">Settings Menu</ulink> and <ulink url="help:/fundamentals/ui.html#menus-help">Help Menu</ulink> of the &kde; Fundamentals.
de: Zusätzlich hat &kappname; die bekannten &kde;-Einträge im Menü <guimenu>Einstellungen</guimenu> und <guimenu>Hilfe</guimenu>, weitere Informationen dazu finden Sie in den Abschnitten über die Menüs <ulink url="help:/fundamentals/ui.html#menus-settings">Einstellungen</ulink> und <ulink url="help:/fundamentals/uihtml#menus-help">Hilfe</ulink> der &kde;-Grundlagen.

source: Frequently asked questions
de: Häufig gestellte Fragen

source: I want to change the way this game looks. Can I?
de: Kann ich das Erscheinungsbild des Spiels ändern?

source: Yes. To change the way &klickety; looks use the menubar to open the <link linkend="configuration">configuration utility</link>.
de: Ja. Um das Design für &klickety; zu ändern, verwenden Sie das Menü, um den <link linkend="configuration">Einrichtungsdialog</link> zu öffnen.

source: Can I use the keyboard to play the game?
de: Kann ich mit der Tastatur spielen?

source: No. This game does not feature a keyboard play mode yet.
de: Nein, dieses Spiel kann nicht mit der Tastatur gespielt werden.

source: How to start the game in KSame mode?
de: Wie starte ich ein Spiel im KSame-Modus?

source: You can launch &klickety; with command <userinput>klickety --KSameMode</userinput> or &ksame; menu entry in K menu.
de: Starten Sie &klickety; mit dem Befehl <userinput>klickety --KSameMode</userinput> in einer Konsole oder wählen Sie den Menüeintrag &ksame; aus dem K-Menü.

source: Game Configuration
de: Spieleinstellungen

source: <menuchoice><guimenu>Settings</guimenu><guimenuitem>Configure &klickety;...</guimenuitem></menuchoice> opens the <guilabel>Configure - &klickety;</guilabel> dialog.
de: <menuchoice><guimenu>Einstellungen</guimenu><guimenuitem>&klickety; einrichten ...</guimenuitem></menuchoice> öffnet den Einrichtungsdialog für &klickety;.

source: <title>General options</title>
de: <title>Allgemeine Einstellungen</title>

source: Show bound lines
de: Umrisse der zusammengehörenden Teile anzeigen

source: This option will show bound lines between pieces with different color.
de: Mit dieser Einstellung werden Umrisse der zusammengehörenden Teile in verschiedenen Farben angezeigt.

source: Enable animation
de: Animationen aktivieren

source: This option will enable the falling and merging animation when pieces are removed.
de: Mit dieser Einstellung wird das Fallen und Zusammenfügen von Steinen animiert, wenn Steine entfernt werden.

source: Enable highlight
de: Hervorheben aktivieren

source: This option will enable highlighting on pieces hovered if they can be removed.
de: Mit dieser Einstellung werden Steine hervorgehoben, wenn Sie den Mauszeiger darüber führen und sie entfernt werden können.

source: <screeninfo>General options</screeninfo>
de: <screeninfo>Allgemeine Einstellungen</screeninfo>

source: <phrase>General options</phrase>
de: <phrase>Allgemeine Einstellungen</phrase>

source: <title>Theme options</title>
de: <title>Designeinstellungen</title>

source: <guilabel>Theme</guilabel> selector
de: Auswahl von <guilabel>Design</guilabel>s

source: Use the <guilabel>Theme</guilabel> selector to set a theme for the game.
de: Verwenden Sie die <guilabel>Design</guilabel>auswahl, um ein anderes Design für das Spiel einzustellen.

source: <screeninfo>Theme options</screeninfo>
de: <screeninfo>Designeinstellungen</screeninfo>

source: <phrase>Theme options</phrase>
de: <phrase>Designeinstellungen</phrase>

source: <title>Background options</title>
de: <title>Einstellungen für den Hintergrund</title>

source: You can choose a background graphic for the game. There are three kinds of background type you can use.
de: Als Hintergrundgrafik für das Spiel können drei verschiedene Atren ausgewählt werden:

source: Theme
de: Design

source: Use the background shipped with the current theme.
de: Verwendet den Hintergrund des aktuell ausgewählten Designs.

source: Color
de: Farbe

source: Use a custom solid color for the background.
de: Verwendet einen einfarbigen Hintergrund.

source: Image
de: Bild

source: Use an image for the background graphic.
de: Verwendet ein Bild für als Hintergrundgrafik.

source: <screeninfo>Background options</screeninfo>
de: <screeninfo>Einstellungen für den Hintergrund</screeninfo>

source: <phrase>Background options</phrase>
de: <phrase>Einstellungen für den Hintergrund</phrase>

source: Custom Game options
de: Benutzerdefinierte Spieleinstellungen

source: You can set the <guilabel>Height</guilabel> and <guilabel>Width</guilabel> of the board and the <guilabel>Color count</guilabel> used in your custom level.
de: Hier kann die <guilabel>Höhe</guilabel> und <guilabel>Breite</guilabel> des Spielfelds sowie die <guilabel>Anzahl an Farben</guilabel> des benutzerdefinierten Spiels eingestellt werden.

source: <screeninfo>Custom game options</screeninfo>
de: <screeninfo>Benutzerdefinierte Spieleinstellungen</screeninfo>

source: <phrase>Custom game options</phrase>
de: <phrase>Benutzerdefinierte Spieleinstellungen</phrase>

source: Credits and License
de: Danksagungen und Lizenz

source: Program Copyright &copy; 1995, Eirik Eng
de: Copyright für das Programm &copy; 1995, Eirik Eng

source: Program Copyright &copy; 1996&ndash;2004, &Nicolas.Hadacek; &Nicolas.Hadacek.mail;
de: Copyright für das Programm &copy; 1996&ndash;2004, &Nicolas.Hadacek; &Nicolas.Hadacek.mail;

source: Program Copyright &copy; 2010, Ni Hui <email>shuizhuyuanluo@126.com</email>
de: Programm Copyright &copy; 2010, Ni Hui <email>shuizhuyuanluo@126.com</email>

source: Documentation Copyright &copy; 2005, Thomas Davey
de: Copyright für die Dokumentation &copy; 2005, Thomas Davey

source: Documentation Copyright &copy; 2010, Ni Hui <email>shuizhuyuanluo@126.com</email>
de: Dokumentation Copyright &copy; 2010, Ni Hui <email>shuizhuyuanluo@126.com</email>

source: CREDIT_FOR_TRANSLATORS
de: <para>Übersetzung: Johannes Obermayr <email>johannesobermayr@gmx.de</email></para>

source: Installation
de: Installieren

source: Compilation and Installation
de: Kompilieren und Installieren
