Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdegames/klines.po
Languages: de

source: The &kolorlines; Handbook
de: Das Handbuch zu &kolorlines;

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Maren</firstname><surname>Pakura</surname><affiliation><address><email>maren@kde.org</email></address></affiliation><contrib>Deutsche Übersetzung</contrib></othercredit>

source: This documentation describes the game of &kolorlines; version &kappversion;
de: Dieses Handbuch beschreibt das Spiel &kolorlines; in der Version &kappversion;

source: kdegames
de: KDE-Spiele

source: game
de: Spiel

source: colors
de: Farben

source: color lines
de: bunte Linien

source: color
de: Farbe

source: one player
de: ein Spieler

source: Introduction
de: Einführung

source: Gametype:
de: Spieltyp:

source: Number of possible players:
de: Anzahl der Spieler:

source: <para>One</para>
de: <para>Einer</para>

source: &kolorlines; is a simple but highly addictive, one player game for &kde;. &kolorlines; has been inspired by well known game of <application>Color Lines</application>, written for <application>DOS</application>, by Olga Demina, Igor Ivkin and Gennady Denisov back in 1992.
de: &kolorlines; ist ein einfaches, aber süchtigmachendes Spiel für einen Spieler. Es wurde angeregt durch das bekannte Spiel <application>Color Lines</application>, das von Olga Demina, Igor Ivkin und Gennady Denisov 1992 für <application>DOS</application> geschrieben wurde.

source: The goal of &kolorlines; is quite plain. The player has to move the colored balls around the game board, gathering them into the lines of the same color by five. Once the line is complete it is removed from the board, therefore freeing precious space. In the same time the new balls keep arriving by three after each move, filling up the game board.
de: Das Ziel von &kolorlines; ist recht einfach. Der Spieler muss die farbigen Bälle auf dem Spielfeld bewegen, um Linien von fünf gleichfarbigen Bällen zu bilden. Diese verschwinden dann vom Spielfeld und geben kostbaren Platz frei, der gleichzeitig nach jedem Zug von drei neu erscheinenden Bällen ausgefüllt wird.

source: &kolorlines; cannot be won, and is played against the high score exclusively. The game ends once the whole game board is filled up with balls.
de: In &kolorlines; kann nicht gewonnen werden - es wird nur um einen Platz in der Bestenliste gespielt. Das Spiel endet, sobald auf dem Spielfeld kein Platz mehr ist.

source: How to Play
de: Spielanleitung

source: Objective:
de: Ziel des Spiels:

source: Move the colored balls around the game board, gathering them into the lines of the same color by five.
de: Bewegen Sie die Bälle auf dem Spielfeld umher und bilden Sie Linien mit fünf gleichfarbigen Bällen.

source: When &kolorlines; starts you are presented with the game board split into 81 squares (the game board is 9x9 squares), and right away three new colored balls appear on the board. Use your mouse to move the balls from cell to cell to group them into the lines of the same color. However, after each of your moves the computer drops three more marbles onto the board. To avoid filling up the board you should gather the balls into lines of 5 or more balls. When such a line is complete, the balls are removed from the field and your score grows.
de: Beim Start von &kolorlines; erscheint ein in 81 Quadrate unterteiltes Spielfeld (9x9 Quadrate) und darauf drei farbige Bälle. Mit Ihrer Maus können Sie die Bälle von Zelle zu Zelle bewegen, um Sie in gleichfarbigen Linien anzuordnen. Nach jedem Ihrer Züge lässt der Computer drei weitere Bälle zufällig auf dem Spielfeld erscheinen. Um ein Auffüllen des Spielfeldes zu vermeiden, müssen Sie Linien mit mindestens fünf gleichfarbigen Bällen bilden, da diese verschwinden und somit wieder Platz frei wird und sich ihr Punktestand erhöht.

source: Note:
de: Hinweis:

source: The new balls will not be added to the field after a line removal. Instead you will be rewarded with yet another move before a new triplet of balls is added.
de: Wenn eine komplette Linie verschwindet, erscheinen keine neuen Bälle. Stattdessen dürfen Sie noch einen weiteren Zug tätigen. Erst danach erscheinen drei neue Bälle.

source: The increase in score depends solely on the amount of the erased balls.
de: Die Punktzahl steigt mit der Anzahl vom Spielfeld entfernter Bälle.

source: If you are playing with <guimenuitem>Show Next</guimenuitem> feature enabled the increase in score is less than if <guimenuitem>Show Next</guimenuitem> feature is disabled.
de: Wenn Sie die Einstellung <guimenuitem>Nächste Kugeln anzeigen</guimenuitem> eingeschaltet haben, erhalten Sie eine geringere Punktzahl, als wenn sie deaktiviert ist.

source: &kolorlines; cannot be won, and is played against the high score exclusively. The game ends once the whole game board becomes filled up with balls.
de: In &kolorlines; kann nicht gewonnen werden - es wird nur um einen Platz in der Bestenliste gespielt. Das Spiel endet, sobald alle Quadrate des Spielfeldes mit Bällen gefüllt sind.

source: Game Rules, Strategies and Tips
de: Spielregeln, Spielstrategien und Tipps

source: Game Rules
de: Spielregeln

source: After each player’s move the game will add three more balls to the board.
de: Nach jedem Zug des Spielers werden drei weitere farbige Bälle auf dem Spielfeld platziert.

source: To free up the space on the board player has to group the balls of the same color into an uninterrupted horizontal, vertical, or diagonal line by five or more.
de: Um auf dem Spielfeld Platz zu schaffen, muss der Spieler fünf oder mehr gleichfarbige Bälle in horizontalen, vertikalen oder diagonalen Linien anordnen.

source: To initiate the move simply click on the source ball to select it, then click on the destination square to complete the move.
de: Um einen Zug zu tätigen, klicken Sie zuerst auf einen Ball und anschließend auf das Quadrat, zu dem der Ball sich bewegen soll.

source: A ball can only be moved into the squares that are vacant and not occupied by any other ball.
de: Ein Ball kann nur in leere Quadrate verschoben werden.

source: In the same time the square in question must be freely accessible.
de: Gleichzeitig muss das ausgewählte Quadrat frei zugänglich sein.

source: The square is freely accessible when there are no other balls blocking the path to it.
de: Ein Quadrat ist frei zugänglich, wenn keine anderen Bälle den Weg dorthin blockieren.

source: The path is considered blocked if any part of it is currently being occupied by a ball.
de: Ein Pfad gilt als blockiert, wenn ein beliebiger Teil von ihm von einem Ball besetzt ist.

source: In &kolorlines; the path is automatically calculated by the game. If there is no possible (open) route to the destination cell, a friendly notification will be displayed.
de: &kolorlines; berechnet den Pfad automatisch. Wenn es keinen möglichen Weg gibt, wird Ihnen das angezeigt.

source: In order to successfully transfer a ball to a desired cell where the path is blocked to, player has to clear the path first.
de: Um einen Ball erfolgreich zu einer blockierten Zelle zu befördern, muss der Spieler den Pfad zunächst freiräumen.

source: To clear the path the player simply has to move all the blocking balls out of the way, therefore freeing the route.
de: Um einen Pfad freizuräumen, muss der Spieler einfach alle blockierenden Bälle aus dem Weg räumen.

source: The scores are awarded for each line of balls removed off the game board.
de: Die Punktzahl errechnet sich aus den vom Spielfeld entfernten Linien.

source: Strategies and Tips
de: Spielstrategien und Tipps

source: Keep a close look on the bar showing the next three marbles to be dropped onto the field (unless <guimenuitem>Show Next</guimenuitem> feature is disabled). More often then not you will appreciate the information if provides.
de: Achten Sie auf die Leiste, die Ihnen die folgenden drei Bälle anzeigt (außer die Einstellung <guimenuitem>Nächsten Ball anzeigen</guimenuitem> ist ausgeschaltet). Diese Information kann Ihnen häufig nützlich sein.

source: Try to keep at least a half of the game board cleared. Letting the balls to pile up will almost certainly lead to a loss.
de: Versuchen Sie, zumindest die Hälfte des Spielfeldes frei zu halten. Wenn die Bälle sich aufstauen, wird das fast immer zu einer Niederlage führen.

source: To make your game easier always keep more than one line of the same balls ready for clearing. This can be achieved by building the consecutive lines of the same balls everywhere possible, instead of concentrating on one line at a time.
de: Um das Spielen zu erleichtern, halten Sie immer mehr als nur eine Linie zum Vervollständigen bereit. Dies kann erreicht werden, indem Sie überall, wo es möglich ist, gleichfarbige Bälle sammeln, anstatt sich nur auf eine Linie zu konzentrieren.

source: Try to keep more than three almost completed lines existing on the game board at all times. Almost completed means that they are four same balls in length, and only one ball remains until their completion.
de: Versuchen Sie immer, mehr als drei fast vollständige Linien auf dem Spielfeld bereit zu halten. Mit <quote>fast vollständig</quote> sind Linien von vier gleichfarbigen Bällen gemeint, denen nur noch ein Ball zum Vervollständigen fehlt.

source: Example:
de: Beispiel:

source: If you have an almost completed line and the pathway to it suddenly becomes blocked with another ball, don’t just move that ball. Try to find a sequence of the balls of the same kind that you can continue with the moved ball. If such sequence exists and is accessible – then move the blocking ball there.
de: Wenn Sie eine Linie fast vervollständigt haben und der Pfad dahin plötzlich von einem anderen Ball blockiert wird, bewegen Sie diesen nicht einfach weg. Suchen Sie stattdessen eine Abfolge von Bällen der gleichen Farbe, die Sie mit dem blockierenden Ball weiterführen könnten. Wenn eine solche Abfolge existiert und erreichbar ist, bewegen Sie den Ball dorthin.

source: Interface Overview
de: Die Benutzeroberfläche

source: The Main &kolorlines; Window
de: Das Hauptfenster von &kolorlines;

source: A screenshot of &kolorlines;
de: Bildschirmfoto von &kolorlines;

source: Screenshot
de: Bildschirmfoto

source: On the very top of the game window there are located the menubar and the toolbar. In the center of the screen there is a large square area filled with marbles called - the game board. On the right hand side there located a bar showing the next three marbles to be dropped onto the field (unless <guimenuitem>Show Next</guimenuitem> feature is disabled). Underneath the field there is the status bar.
de: Am oberen Ende des Spielfensters befinden sich die Menü- und Statusleiste. In der Mitte des Bildes befindet sich das aus einem großen Quadrat bestehende, mit Bällen angefüllte Spielfeld. Rechts davon ist eine Leiste, die die nächsten drei auf dem Spielfeld erscheinenden Bällen anzeigt (außer die Einstellung <guimenuitem>Nächsten Ball anzeigen</guimenuitem> ist ausgeschaltet). Unterhalb des Feldes befindet sich die Statusleiste.

source: Menu Items
de: Menüeinträge

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo></shortcut> <guimenu>Game</guimenu> <guimenuitem>New</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo></shortcut> <guimenu>Spiel</guimenu> <guimenuitem>Neu</guimenuitem>

source: Starts a new game
de: Startet ein neues Spiel.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>H</keycap></keycombo></shortcut> <guimenu>Game</guimenu> <guimenuitem>Show High Scores</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>H</keycap></keycombo> </shortcut> <guimenu>Spiel</guimenu> <guimenuitem>Bestenliste anzeigen</guimenuitem>

source: Displays the high score table
de: Zeigt die Bestenliste an.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo></shortcut> <guimenu>Game</guimenu> <guimenuitem>Quit</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo> </shortcut> <guimenu>Spiel</guimenu> <guimenuitem>Beenden</guimenuitem>

source: <action>Quits</action> &kolorlines;
de: <action>Beendet</action> &kolorlines;.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>Z</keycap></keycombo></shortcut> <guimenu>Move</guimenu> <guimenuitem>Undo</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Z</keycap></keycombo> </shortcut> <guimenu>Zug</guimenu> <guimenuitem>Zurücknehmen</guimenuitem>

source: This will undo the last move.
de: Macht den letzten Schritt rückgängig.

source: <guimenu>Move</guimenu><guimenuitem>End Turn</guimenuitem>
de: <guimenu>Zug</guimenu><guimenuitem>Zug beenden</guimenuitem>

source: Skip your move, immediately play the next marbles without you moving any.
de: Überspringt Ihren Zug und spielt sofort die nächsten Kugeln, ohne Sie ziehen zu lassen.

source: <shortcut><keycap>Left</keycap></shortcut> <guimenu>Navigation</guimenu> <guimenuitem>Move Left</guimenuitem>
de: <shortcut><keycap>Pfeil links</keycap></shortcut> <guimenu>Navigation</guimenu> <guimenuitem>Links</guimenuitem>

source: This action will move the selection cursor to the left.
de: Diese Aktion verschiebt das Auswahlrechteck nach links.

source: <shortcut><keycap>Right</keycap></shortcut> <guimenu>Navigation</guimenu> <guimenuitem>Move Right</guimenuitem>
de: <shortcut><keycap>Pfeil rechts</keycap></shortcut> <guimenu>Navigation</guimenu> <guimenuitem>Rechts</guimenuitem>

source: This action will move the selection cursor to the right.
de: Diese Aktion verschiebt das Auswahlrechteck nach rechts.

source: <shortcut><keycap>Up</keycap></shortcut> <guimenu>Navigation</guimenu> <guimenuitem>Move Up</guimenuitem>
de: <shortcut><keycap>Pfeil hoch</keycap></shortcut> <guimenu>Navigation</guimenu> <guimenuitem>Hoch</guimenuitem>

source: This action will move the selection cursor up.
de: Diese Aktion verschiebt das Auswahlrechteck nach oben.

source: <shortcut><keycap>Down</keycap></shortcut> <guimenu>Navigation</guimenu> <guimenuitem>Move Down</guimenuitem>
de: <shortcut><keycap>Pfeil runter</keycap></shortcut> <guimenu>Navigation</guimenu> <guimenuitem>Runter</guimenuitem>

source: This action will move the selection cursor down.
de: Diese Aktion verschiebt das Auswahlrechteck nach unten.

source: <shortcut><keycap>Space</keycap></shortcut> <guimenu>Navigation</guimenu> <guimenuitem>Select</guimenuitem>
de: <shortcut><keycap>Leertaste</keycap></shortcut> <guimenu>Navigation</guimenu> <guimenuitem>Auswahl</guimenuitem>

source: This action will select the item currently under the cursor.
de: Diese Aktion wählt die Kugel im Auswahlrechteck für den nächsten Zug.

source: <guimenu>Settings</guimenu> <guimenuitem>Show Next</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>Nächste Kugeln anzeigen</guimenuitem>

source: Toggles the information on next marbles.
de: Blendet die Vorschau für die nächsten Kugeln ein bzw. aus.

source: Additionally &kolorlines; has the common &kde; <guimenu>Settings</guimenu> and <guimenu>Help</guimenu> menu items, for more information read the sections about the <ulink url="help:/fundamentals/ui.html#menus-settings">Settings Menu</ulink> and <ulink url="help:/fundamentals/ui.html#menus-help">Help Menu</ulink> of the &kde; Fundamentals.
de: Zusätzlich hat &kolorlines; die bekannten &kde;-Einträge im Menü <guimenu>Einstellungen</guimenu> und <guimenu>Hilfe</guimenu>, weitere Informationen dazu finden Sie in den Abschnitten über die Menüs <ulink url="help:/fundamentals/ui.html#menus-settings">Einstellungen</ulink> und <ulink url="help:/fundamentals/uihtml#menus-help">Hilfe</ulink> der &kde;-Grundlagen.

source: Frequently asked questions
de: Häufig gestellte Fragen

source: I want to change the way this game looks. Can I?
de: Kann ich das Erscheinungsbild des Spiels ändern?

source: Yes. To change &kolorlines; visual theme you can use <menuchoice><guimenu>Settings</guimenu><guimenuitem>Configure &kolorlines;...</guimenuitem></menuchoice> option on the menubar.
de: Ja, um das Design für &kolorlines; zu ändern, wählen Sie <menuchoice><guimenu>Einstellungen</guimenu><guimenuitem>&kolorlines; einrichten ...</guimenuitem></menuchoice> in der Menüleiste.

source: I don't want to make any moves right now. Can I skip a turn?
de: Ich möchte in dieser Runde nicht ziehen, kann ich einmal aussetzen?

source: Yes. To skip a turn you can use a <link linkend="menu-move-endturn">keyboard shortcut</link>, or a <link linkend="menu-move-endturn">menubar</link> option.
de: Um eine Runde auszusetzen, benutzen Sie ein <link linkend="menu-move-endturn">Tastenkürzel</link> oder diesen <link linkend="menu-move-endturn">Menüeintrag</link>.

source: Can I use the keyboard to play the game?
de: Kann ich mit der Tastatur spielen?

source: Yes. You can use the cursor keys and the <keycap>Space</keycap> key to select and set the balls.
de: Ja. Mit den Pfeiltasten und der <keycap>Leertaste</keycap> können die Bälle ausgewählt und gesetzt werden.

source: I cannot figure out what to do here! Are there hints?
de: Ich komme im Spiel nicht weiter, gibt es Tipps?

source: No. &kolorlines; does not have a <quote>Hint</quote> feature.
de: Nein, in &kolorlines; gibt es keine Tipps.

source: I have to quit the game now, but I am not finished yet. Can I save my progress?
de: Ich muss das Spiel unterbrechen, kann ich den aktuellen Spielstand speichern?

source: &kolorlines; does not have a <quote>Save</quote> feature at the moment.
de: Nein, in &kolorlines; kann der aktuelle Spielstand nicht gespeichert werden.

source: Game Configuration
de: Einstellungen für das Spiel

source: &kolorlines; configuration dialog allows you to select &kolorlines; visual themes.
de: Im Einrichtungsdialog von &kolorlines; können Sie das Design des Spiels ändern.

source: To select a new theme simply choose the theme from the selection list. Each item in the list shows a small preview left to the theme name. A selection is immediately applied.
de: Um ein Design einzustellen, wählen Sie es aus der Auswahlliste. Für jeden Eintrag in der Liste wird eine kleine Vorschau links vom Namen des Designs angezeigt. Eine Auswahl wird sofort angewendet,

source: Once you are satisfied with the theme you have selected you can click the <guibutton>Close</guibutton>, located at the bottom part of this dialog.
de: Um Ihre Auswahl zu übernehmen, klicken Sie auf den Knopf <guibutton>Schließen</guibutton> im unteren Bereich dieses Dialogs.

source: Credits and License
de: Danksagungen und Lizenz

source: Program copyright 2000 &Roman.Merzlyakov; &Roman.Merzlyakov.mail;
de: Programm-Copyright 2000 &Roman.Merzlyakov; &Roman.Merzlyakov.mail;

source: Contributors:
de: Beiträge von:

source: &Roman.Razilov; &Roman.Razilov.mail; Redesign, Graphik, animation, partial re-write. Special thanks to my wife Larissa Juschkin for testing and discussions.
de: Von &Roman.Razilov; &Roman.Razilov.mail; stammen die Neugestaltung, die Grafik, die Animation des Spiels. Besonderer Dank geht an meine Frau Larissa Juschkin fürs Diskutieren und Testen.

source: Documentation copyright 2001 &Roman.Razilov; &Roman.Razilov.mail;
de: Copyright für die Dokumentation 2001 &Roman.Razilov; &Roman.Razilov.mail;

source: CREDIT_FOR_TRANSLATORS
de: <para>Deutsche Übersetzung von Maren Pakura <email>maren@kde.org</email></para>

source: Compilation and Installation
de: Kompilierung und Installation
