Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdegames/kmines.po
Languages: de

source: The &kmines; Handbook
de: Das Handbuch zu &kmines;

source: Developer
de: Entwickler

source: Reviewer
de: Korrektur

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Maren</firstname><surname>Pakura</surname><affiliation><address><email>maren@kde.org</email></address></affiliation><contrib>Deutsche Übersetzung</contrib></othercredit>

source: &kmines; is the &kde; version of the classic minesweeper game.
de: &kmines; ist Umsetzung des klassischen Minesweeper-Spiels für &kde;..

source: game
de: Spiel

source: Introduction
de: Einführung

source: Gametype:
de: Spieltyp:

source: Strategy, Board
de: Strategiespiel, Brettspiel

source: Number of possible players:
de: Anzahl der Spieler:

source: <para>One</para>
de: <para>Einer</para>

source: &kmines; is the classic Minesweeper game. The idea is to uncover all the squares without blowing up any mines. When a mine is blown up, the game is over. Numbers indicate how many mines there are nearby.
de: &kmines; ist das klassische Minesweeper-Spiel. Ziel ist es, alle leeren Felder aufzudecken, ohne dass eine Mine explodiert. Das Spiel ist beendet, wenn eine Mine explodiert. Die Zahlen zeigen die Anzahl der Minen in den angrenzenden Felder an.

source: How to Play
de: Spielanleitung

source: Objective:
de: Ziel des Spiels:

source: Locate all the mines hidden on the minefield.
de: Finden Sie alle versteckten Minen auf dem Spielfeld.

source: To play &kmines;, you need to use the mouse and its three buttons to uncover or to flag the squares (with two-buttoned mice, clicking the &MMB; is generally achieved by simultaneously pressing the &LMB; and the &RMB; buttons).
de: Sie müssen zum Spielen von &kmines; eine Maus mit drei Tasten benutzen, um Felder aufzudecken oder zu markieren. (Bei Mäusen mit zwei Tasten können Sie die &MMB; mit einem gleichzeitigen Klick der &LMBn; und &RMBn; simulieren). Hier sind die Details beschrieben:

source: Clicking the &LMB; on your mouse will uncover a square. If there is a mine there, it will detonate, and the game will be over. If there is not a mine under the square, the square is cleared and if there aren't other mines nearby, the square will disappear including any nearby squares without mines. If there are mines nearby, a number will appear showing how many neighboring squares contain mines. For each square (excluding edge and corner squares), there are eight neighboring squares.
de: Klicken Sie mit der &LMBn;, um ein Feld aufzudecken. Ist darin eine Mine, so explodiert sie und das Spiel ist beendet. Ein Feld ohne Mine wird aufgedeckt, zusammen mit allen angrenzenden Feldern ohne Mine. Befinden sich in angrenzenden Feldern Minen, wird die Anzahl der benachbarten Felder mit Minen angezeigt. Jedes Feld, ausgenommen Eck- und Randfelder, hat 8 angrenzende Felder.

source: &LMB; clicking a flagged square is safe and does nothing.
de: Ein Klick mit der &LMBn; auf ein Feld mit Fahne ist sicher und es geschieht nichts.

source: The &RMB; will mark a square as containing a mine (by placing a red flag on it). Clicking the button twice will set it as being uncertain (by placing a question mark on it). The uncertain tag can be useful when you are puzzled about the positions of mines. The &MMB; will clear the surrounding squares if the right number of squares is already flagged. It is very useful since it is much quicker than uncovering all individual squares. Make sure your flags are correctly placed, if not, you might detonate a mine.
de: Die &RMB; markiert ein Feld mit einer rote Fahne als Mine, ein weiterer Klick mit einem Fragezeichen als unsicher. Das Fragezeichen kann nützlich sein, wenn Sie sich über die Positionen der Minen nicht sicher sind.Die &MMB; versucht, die acht umgebenden Felder aufzudecken, wenn dort bereits die richtige Anzahl von Feldern als Minenfeld markiert sind. Dies ist sehr nützlich, da es viel schneller geht, als alle Felder einzeln aufzudecken.Wenn aber ihre Fahnen nicht richtig stehen, so explodiert eine Mine.

source: Game Rules, Strategies and Tips
de: Spielregeln, Spielstrategien und Tipps

source: Rules
de: Spielregeln

source: All the mines have to be cleared before a player can win a game.
de: Der Spieler muss die Lage aller Minen finden, um das Spiel zu gewinnen.

source: The player cannot know the exact location of the mines before the game is over.
de: Erst am Ende des Spiels kennt der Spieler die Lage aller Felder mit Minen.

source: If a mine is detonated, the game is over.
de: Wenn eine Mine explodiert, ist das Spiel beendet.

source: Numbers will indicate nearby mines.
de: Die Zahlen zeigen die Anzahl den Minen in angrenzenden Feldern.

source: Strategies and Tips
de: Spielstrategien und Tipps

source: Use the numbers to find out where nearby mines are.
de: Benutzen Sie die angezeigten Zahlen, um angrenzende Felder mit Minen zu finden.

source: Place flags where you suspect there are mines. Note that even though the indicated number of mines goes down when you place a flag, there might not be a mine under the flag.
de: Markieren Sie Felder, in denen Sie Minen vermuten. Auch wenn sich dadurch die angezeigte Zahl für die gefundenen Minen ändert, kann Ihre Annahme trotzdem falsch sein.

source: Think before you click, a wrong click could detonate a mine.
de: Überlegen Sie vor jedem Klick, bei einem Fehler kann eine Mine explodieren und Sie haben das Spiel verloren.

source: When you suspect that a square contains a mine, work around the square to uncover any numbers which might help.
de: Wenn Sie in einem Feld eine Mine vermuten, bearbeiten Sie die umgebenden Felder, um durch die dadurch angezeigten Zahlen Gewissheit zu erhalten.

source: Try to clear the board as quickly as possible, the less time you spend, the higher your score will be.
de: Versuchen Sie, alle Minen so schnell wie möglich zu finden, je kürzer die Zeit, desto besser ist Ihre Punktwertung.

source: Commands/Keyboard Shortcuts
de: Befehle und Tastenkürzel

source: The following sections briefly describes some menubar options.
de: Im nächsten Abschnitt werden einige Menüeinträge kurz beschrieben.

source: Menu Items
de: Menüeinträge

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo> </shortcut> <guimenu>Game</guimenu> <guimenuitem>New</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo> </shortcut> <guimenu>Spiel</guimenu> <guimenuitem>Neu</guimenuitem>

source: Starts a new game.
de: Startet ein neues Spiel.

source: <shortcut><keycap>P</keycap></shortcut> <guimenu>Game</guimenu> <guimenuitem>Pause</guimenuitem>
de: <shortcut> <keycap>P</keycap> </shortcut> <guimenu>Spiel</guimenu> <guimenuitem>Pause</guimenuitem>

source: Pauses the game time. Click on the menu item again to make the game resume. Note that the board disappears when the game is paused as it would be unfair if you could search for good moves without the time pressure.
de: Hält die Spielzeit an. Klicken Sie erneut auf den Menüpunkt, um das Spiel fortzusetzen. Beachten Sie, dass das Spielfeld während der Pause verschwindet, da Sie sich sonst unfairerweise ohne Zeitdruck gute Züge überlegen könnten.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>H</keycap></keycombo> </shortcut> <guimenu>Game</guimenu> <guimenuitem>Show High Scores</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>H</keycap></keycombo> </shortcut> <guimenu>Spiel</guimenu> <guimenuitem>Bestenliste anzeigen</guimenuitem>

source: This shows you the high score (the shortest time) for each difficulty level.
de: Zeigt die Bestenliste (die kürzeste Zeit) für jeden Schwierigkeitsgrad an.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo> </shortcut> <guimenu>Game</guimenu> <guimenuitem>Quit</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo> </shortcut> <guimenu>Spiel</guimenu> <guimenuitem>Beenden</guimenuitem>

source: <action>Quits</action> &kmines;
de: <action>Beendet</action> &kmines;.

source: <guimenu>Settings</guimenu> <guisubmenu>Difficulty</guisubmenu>
de: <guimenu>Einstellungen</guimenu> <guisubmenu>Schwierigkeitsgrad</guisubmenu>

source: Lets you set the difficulty level from a sub-menu.
de: Hier können Sie den Schwierigkeitsgrad aus einem Untermenü wählen.

source: There are three default levels of difficulty: <guimenuitem>Easy</guimenuitem> (9x9 squares, 10 mines), <guimenuitem>Medium</guimenuitem> (16x16 squares, 40 mines), and <guimenuitem>Hard</guimenuitem> (30x16 squares, 99 mines). There is also a <guimenuitem>Custom</guimenuitem> level settings.
de: Es gibt drei Standard-Ebenen <guimenuitem>Einfach</guimenuitem> (9x9 Felder, 10 Minen), <guimenuitem>Mittel</guimenuitem> (16x16 Felder, 40 Minen) und <guimenuitem>Schwierig</guimenuitem> (30x16 Felder, 99 Minen). Es gibt auch die Möglichkeit unter <guimenuitem>Benutzerdefiniert</guimenuitem> eine individuelle Feldgröße zu wählen.

source: If you select <guimenuitem>Custom</guimenuitem>, then the settings you have configured in the <guimenuitem>Configure &kmines;</guimenuitem> dialog will be used.
de: Falls Sie <guimenuitem>Benutzerdefiniert</guimenuitem> auswählen, werden die im Dialog <guimenuitem>&kmines; einrichten</guimenuitem> eingestellten Werte verwendet.

source: Additionally &kmines; has the common &kde; <guimenu>Settings</guimenu> and <guimenu>Help</guimenu> menu items, for more information read the sections about the <ulink url="help:/fundamentals/ui.html#menus-settings">Settings Menu</ulink> and <ulink url="help:/fundamentals/ui.html#menus-help">Help Menu</ulink> of the &kde; Fundamentals.
de: Zusätzlich hat &kmines; die bekannten &kde;-Einträge im Menü <guimenu>Einstellungen</guimenu> und <guimenu>Hilfe</guimenu>, weitere Informationen dazu finden Sie in den Abschnitten über die Menüs <ulink url="help:/fundamentals/ui.html#menus-settings">Einstellungen</ulink> und <ulink url="help:/fundamentals/uihtml#menus-help">Hilfe</ulink> der &kde;-Grundlagen.

source: Default Keyboard Shortcuts
de: Standard-Tastenkürzel

source: The following table shows you the default keyboard shortcuts.
de: Die folgende Tabelle zeigt die Standard-Tastenkürzel.

source: Keyboard Shortcuts
de: Tastenkürzel

source: Key Combo
de: Tastenkombination

source: Action
de: Aktion

source: New Game
de: Neues Spiel

source: Quit &kmines;
de: Beendet &kmines;

source: &kmines; Handbook
de: Handbuch zu &kmines;

source: What's This Help
de: <quote>Was ist das?</quote>-Hilfe

source: Show High Scores
de: Bestenliste anzeigen

source: These shortcuts can be changed by selecting <menuchoice> <guimenu>Settings</guimenu> <guimenuitem>Configure Shortcuts...</guimenuitem> </menuchoice> from the menubar.
de: Diese Tastenbelegungen können Sie im Menü <menuchoice> <guimenu>Einstellungen</guimenu> <guimenuitem>Kurzbefehle festlegen ...</guimenuitem> </menuchoice> ändern.

source: Frequently Asked Questions
de: Häufig gestellte Fragen

source: Can I change the way the game looks?
de: Kann ich das Erscheinungsbild des Spiels ändern?

source: Yes, click on the <guimenu>Settings</guimenu> menu and select <guimenuitem>Configure &kmines;...</guimenuitem>.
de: Ja, wählen Sie im Menü <guimenu>Einstellungen</guimenu> <guimenuitem>&kmines; einrichten ...</guimenuitem>.

source: Is there a way to add more mines and squares?
de: Kann ich auch mit mehr Minen auf einem größeren Feld spielen?

source: Yes, the easiest way is to use the drop down box in the lower right corner.
de: Ja, wählen Sie im Auswahlfeld unten rechts eine andere Ebene.

source: Game Settings
de: Spieleinstellungen

source: The game settings can be configured by selecting <menuchoice><guimenu>Settings</guimenu> <guimenuitem>Configure &kmines;...</guimenuitem></menuchoice> from the menubar. A dialog will appear.
de: Um die Einstellungen für das Spiel zu ändern, öffnen Sie mit <menuchoice><guimenu>Einstellungen</guimenu> <guimenuitem>&kmines; einrichten ...</guimenuitem> </menuchoice> einen Dialog.

source: On the second page, you can set the theme. Select a theme from the list. Each item in the list shows a small preview left to the theme name. A selection is immediately applied.
de: Auf der zweiten Seite können Sie ein Design einstellen. Wählen Sie ein Design aus der Liste. Für jeden Eintrag in der Liste wird eine kleine Vorschau links vom Namen des Designs angezeigt. Eine Auswahl wird sofort angewendet,

source: On the third page, you can set the height and width of the board and the number of mines in your custom level.
de: auf der dritten Seite stellen Sie Höhe und Breite des Spielfeldes sowie die Anzahl der Minen für ein benutzerdefiniertes Spiel ein.

source: Credits and License
de: Danksagungen und Lizenz

source: Authors
de: Autoren

source: Documentation copyright 2000 &Nicolas.Hadacek; &Nicolas.Hadacek.mail;
de: Copyright für die Dokumentation 2000 &Nicolas.Hadacek; &Nicolas.Hadacek.mail;

source: Documentation updated for &kde; 2.0 by &Mike.McBride; &Mike.McBride.mail;
de: Dokumentation für &kde; 2.0 von &Mike.McBride; &Mike.McBride.mail; überarbeitet

source: Some changes for &kde; 3.2 by &Philip.Rodrigues; &Philip.Rodrigues.mail;
de: Bearbeitung für &kde; 3.2 von &Philip.Rodrigues; &Philip.Rodrigues.mail;.

source: CREDIT_FOR_TRANSLATORS
de: <para>Deutsche Übersetzung von Maren Pakura <email>maren@kde.org</email></para>

source: How to obtain &kmines;
de: Woher Sie &kmines; erhalten?

source: Compilation and Installation
de: Kompilierung und Installation
