Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdegames/knavalbattle.po
Languages: de

source: The &kappname; Handbook
de: Das Handbuch zu &kappname;

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Maren</firstname><surname>Pakura</surname><affiliation><address><email>maren@kde.org</email></address></affiliation><contrib>Deutsche Übersetzung</contrib></othercredit>

source: &kappname; is a network-enabled implementation of the famous ship sinking game for &kde;.
de: &kappname; ist eine netzwerkfähige Umsetzung des bekannten Spiels <quote>Schiffe versenken</quote> für &kde;.

source: game
de: Spiel

source: battleship
de: Schiffe versenken

source: battle
de: Schlacht

source: naval
de: Marine

source: Introduction
de: Einführung

source: Gametype:
de: Spieltyp:

source: Strategy, Board
de: Strategiespiel, Brettspiel

source: Number of possible players:
de: Anzahl der Spieler:

source: <para>Two</para>
de: <para>Zwei</para>

source: &kappname; is a ship sinking game for &kde;. Ships are placed on a board which represents the sea. Players try to hit each others ships in turns without knowing where they are placed. The first player to destroy all ships wins the game.
de: &kappname; ist ein <quote>Schiffe versenken</quote>-Spiel für &kde;. Alle Schiffe werden auf dem Spielfeld - dem Meer - angeordnet. Die Spieler versuchen die gegnerischen Schiffe, deren Lage auf dem Spielfeld Sie nicht kennen, abwechselnd mit Schüssen zu treffen. Sieger ist, wer als erster alle Schiffe des Gegners versenkt hat.

source: How to Play
de: Spielanleitung

source: Objective:
de: Ziel des Spiels:

source: Sink all of the opponent’s ships before the opponent sink all the ships of your own.
de: Versenken Sie alle Schiffe Ihres Gegners, ehe er Ihre Schiffe versenkt.

source: If you want to play &kappname;, you will need two players, either play against the computer or in a network against another player. To play against your computer, first select the difficulty level on the right of the status bar, and then select <guibutton>Single Player</guibutton> on the welcome screen, or directly on the <menuchoice><guimenu>Game</guimenu></menuchoice> menu.
de: &kappname; wird zu zweit gespielt, entweder gegen den Rechner oder im Netzwerk gegen einen anderen Spieler. Spielen Sie gegen den Rechner, wählen Sie zuerst eine Ebene rechts in der Statusleiste, dann <guibutton>Einzelspieler</guibutton> im Startdialog oder im Menü <menuchoice><guimenu>Spiel</guimenu></menuchoice>.

source: To start a network game, one player has to host the game by selecting <guilabel>Host Network Game</guilabel> on the welcome screen, or choosing <menuchoice><guimenu>Game</guimenu> <guimenuitem>Host Game...</guimenuitem></menuchoice>. A dialog box opens which asks for a <guilabel>Nickname:</guilabel> and <guilabel>Port:</guilabel>. Normally, &kappname; will suggest your full name, but you can enter any string you want. The predefined port should be ok. However, if you encounter problems, you can choose any other free port above 1024.
de: Um im Netzwerk zu spielen, muss ein Spieler das Spiel ausrichten, indem er <guibutton>Netzwerkspiel ausrichten</guibutton> im Startdialog oder im Menü <menuchoice><guimenu>Spiel</guimenu><guimenuitem>Netzwerkspiel ausrichten ...</guimenuitem></menuchoice> wählt. Es öffnet sich ein Dialog, um <guilabel>Spitzname:</guilabel> und <guilabel>Port:</guilabel> einzugeben. Normalerweise wird &kappname; Ihren vollen Anmeldenamen vorschlagen, Sie können aber jeden beliebigen Namen eintragen. Mit dem vorgegeben Port sollte das Netzwerkspiel funktionieren. Treten jedoch Probleme auf, können Sie jeden anderen freien Port größer als 1024 wählen.

source: You need to tell the other player in case you use a port other than the default as both players need to use the same port in order to be able to establish a connection.
de: Beachten Sie, dass alle Mitspieler den gleichen Port einstellen müssen, wenn Sie einen anderen als den vordefinierten Port benutzen.

source: The other player has to choose <guilabel>Connect to Network Game</guilabel>, or click <menuchoice><guimenu>Game</guimenu> <guimenuitem>Connect to Game...</guimenuitem></menuchoice>. Again, a <guilabel>Nickname:</guilabel> is suggested, but you can choose any name you like. In the field <guilabel>Hostname:</guilabel> you have to enter the host name of the server (the machine of the player that initiated the game).
de: Der andere Spieler muss auf <guilabel>Mit Netzwerkspiel verbinden</guilabel> klicken oder in der Menüleiste <menuchoice><guimenu>Spiel</guimenu><guimenuitem>Mit Netzwerkspiel verbinden ...</guimenuitem></menuchoice> wählen. Wieder wird ein <guilabel>Spitzname:</guilabel> vorgeschlagen, den Sie jedoch beliebig ändern können. Im Feld <guilabel>Rechnername:</guilabel> tragen Sie den Namen des Rechners ein, auf dem das Netzwerkspiel gestartet wurde.

source: When you are done, you can start the game. Simply follow the instructions in the statusbar. It will issue hints and suggest what to do next. When you now look at the screen, you will find two grid fields, the so-called <quote>battle areas</quote>. The left area belongs to you. This is where you place your ships and where you can follow the military actions of your enemy. The right area is where your enemy's fleet is located. When it's your turn to fire, you need to click on a certain sector (a field of the battle area) where you suppose the ships to be located.
de: Wenn Sie das erledigt haben, können Sie ein Spiel starten. Folgen Sie den Anweisungen in der Statusleiste. Dort werden Hinweise gegeben und Vorschläge gemacht, was als Nächstes zu tun ist. Wenn Sie nun auf den Bildschirm schauen, sehen Sie zwei gerasterte Spielfelder, die so genannten <quote>Spielflächen</quote>. Die linke Seite gehört Ihnen. Hier können Sie Ihre Schiffe platzieren und sehen die Kampfmaßnahmen Ihres Feindes. Im rechten Feld liegt die Flotte Ihres Gegners. Wenn Sie mit dem Schießen an der Reihe sind, klicken Sie auf einen Sektor (ein Feld auf der Spielfläche), wo Sie ein gegnerisches Schiff vermuten.

source: First, you need to place your ships. The game initiator starts. When he/she is done, player two sets his/her ships.
de: Als Erstes müssen Sie Ihre Schiffe platzieren. Der Initiator des Spiels beginnt. Wenn er fertig ist, kann der zweite Spieler seine Schiffe platzieren.

source: Ship placement is very easy: simply click on the field where you want to place your ships. You have four ships to place: the first one will have a length of one square, the next will be two squares long &etc; Click on the field where you want to start the placement. By default, ships will be placed horizontally; to rotate them 90 degrees, click the &RMB; before the placement.
de: Das Aufstellen der Schiffe ist sehr leicht. Klicken Sie auf das Feld, in das Sie Ihr Schiff stellen möchten. Sie müssen 4 Schiffe setzen. Das erste Schiff hat eine Länge von einem Feld, das nächste ist zwei Felder lang &etc; Klicken Sie auf das Feld, in dem der Bug des Schiffes liegen soll. Als Standard werden alle Schiffe horizontal ausgerichtet, klicken Sie die &RMB; vor dem Platzieren, um sie vertikal auszurichten.

source: When a ship is hit, fire will break out on it. To sink it, hit all the squares it occupies. A sunk ship will appear faded.
de: Wird ein Schiff getroffen, bricht ein Feuer aus. Um es zu versenken, müssen alle belegten Felder getroffen werden. Ein versenktes Schiff erscheint durchsichtig.

source: Now you can use the &LMB; to fire on the battle area of your enemy. The status bar indicates who is about to shoot.
de: Nun können Sie blind mit der &LMBn; auf das gegnerische Spielfeld feuern. Die Statusleiste zeigt an, wer mit dem Schießen an der Reihe ist.

source: You can restart the game by choosing <menuchoice><guimenu>Game</guimenu> <guimenuitem>Restart Game</guimenuitem></menuchoice>, or by pressing <keycap>F5</keycap>.
de: Mit <menuchoice><guimenu>Spiel</guimenu> <guimenuitem>Spiel neu starten ...</guimenuitem></menuchoice> oder mit der Taste <keycap>F5</keycap> können Sie ein Spiel wieder starten.

source: The first player to destroy all their opponents ships wins the game.
de: Der erste Spieler, der alle gegnerischen Schiffe zerstört hat, gewinnt das Spiel.

source: Game Rules, Strategies and Tips
de: Spielregeln, Spielstrategien und Tipps

source: Rules
de: Spielregeln

source: A player can only fire one shot per turn.
de: Die Spieler feuern abwechselnd einen Schuss ab.

source: Players must place all their ships.
de: Alle Schiffe müssen auf das Spielfeld gesetzt werden.

source: Ships cannot be moved once placed.
de: Schiffe können nicht verschoben werden, wenn Sie gesetzt wurden.

source: A ship is sunk when all the squares it occupies are hit.
de: Ein Schiff sinkt, wenn alle Felder, die es belegt, getroffen wurden.

source: Strategies and Tips
de: Spielstrategien und Tipps

source: Never place ships next to one another.
de: Platzieren Sie Schiffe nicht direkt nebeneinander.

source: Once you hit a ship, try shooting around the place you hit.
de: Haben Sie ein Schiff getroffen, schießen Sie auf alle Felder drumherum.

source: Try to place ships away from the edges of the board.
de: Platzieren Sie Schiffe nicht in den Eckbereichen des Spielfeldes.

source: Small ships are harder to hit, make sure you place them where they are hard to find.
de: Kleine Schiffe sind schwer zu treffen, verstecken Sie sie gut auf dem Spielfeld.

source: Think before you shoot. Hits on water gives less points.
de: Überlegen Sie, bevor Sie schießen. Für Fehlschüsse ins Wasser erhalten Sie keine Punkte.

source: The Menus
de: Die Menüs

source: Menu Items
de: Menüeinträge

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo> </shortcut> <guimenu>Game</guimenu> <guimenuitem>New</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo> </shortcut> <guimenu>Spiel</guimenu> <guimenuitem>Neu</guimenuitem>

source: Exit the current game and reload the welcome screen.
de: Beendet das laufende Spiel und zeigt wieder den Startdialog an.

source: <shortcut><keycap>F5</keycap></shortcut> <guimenu>Game</guimenu> <guimenuitem>Restart Game</guimenuitem>
de: <shortcut><keycap>F5</keycap></shortcut> <guimenu>Spiel</guimenu> <guimenuitem>Spiel neu starten</guimenuitem>

source: Restart the game.
de: Startet das Spiel wieder neu.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>H</keycap></keycombo></shortcut> <guimenu>Game</guimenu> <guimenuitem>Show High Scores</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>H</keycap></keycombo> </shortcut> <guimenu>Spiel</guimenu> <guimenuitem>Bestenliste anzeigen</guimenuitem>

source: Show the highest scores so far.
de: Zeigt die Bestenliste der bisherigen Spiele.

source: <guimenu>Game</guimenu> <guimenuitem>Single Player</guimenuitem>
de: <guimenu>Spiel</guimenu> <guimenuitem>Einzelspieler</guimenuitem>

source: Start a game with your computer as the opponent.
de: Startet ein Spiel, in dem der Computer Ihr Gegner ist.

source: <guimenu>Game</guimenu> <guimenuitem>Host Game...</guimenuitem>
de: <guimenu>Spiel</guimenu> <guimenuitem>Netzwerkspiel leiten ..</guimenuitem>

source: Start the server so another player can connect to you.
de: Startet den Server, sodass ein anderer Spieler sich mit Ihrem Rechner verbinden kann.

source: <guimenu>Game</guimenu> <guimenuitem>Connect to Game...</guimenuitem>
de: <guimenu>Spiel</guimenu> <guimenuitem>Mit Netzwerkspiel verbinden ...</guimenuitem>

source: Connect to a server to start a game.
de: Verbindet mit einem Server, um ein neues Netzwerkspiel zu starten.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo> </shortcut> <guimenu>Game</guimenu> <guimenuitem>Quit</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo> </shortcut> <guimenu>Spiel</guimenu> <guimenuitem>Beenden</guimenuitem>

source: <action>Exit</action> &kappname;
de: <action>Beendet</action> &kappname;

source: <guimenu>Settings</guimenu> <guimenuitem>Change Nickname...</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>Spitzname ändern ...</guimenuitem>

source: Change the default nickname.
de: Geben Sie hier den neuen Spitznamen ein.

source: <guimenu>Settings</guimenu> <guimenuitem>Play Sounds</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>Klänge wiedergeben</guimenuitem>

source: <action>Toggle whether sounds (played when shooting) should be played.</action> The default is on.
de: Falls markiert, <action>werden die Klänge zum Spiel abgespielt.</action> In der Voreinstellung sind die Klänge eingeschaltet.

source: <guimenu>Settings</guimenu> <guimenuitem>Adjacent Ships</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>Angrenzende Schiffe</guimenuitem>

source: <action>Toggle whether the ships can be put on a desk without one empty space between them.</action> The default is on. This setting should be defined on a host when <link linkend="howtoplay">playing &kappname; via network</link>.
de: <action>Legt fest, ob Schiffe auf dem Spielfeld ohne leere Felder dazwischen angeordnet werden können.</action> Als Voreinstellung ist dies abgeschaltet. Diese Einstellung sollte auf einem Server eingestellt werden, wenn <link linkend="howtoplay">&kappname; über ein Netzwerk gespielt wird</link>.

source: <guimenu>Settings</guimenu> <guimenuitem>Show End-of-Game Message</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>Nachricht am Spielende anzeigen</guimenuitem>

source: If you won the game and have a new highscore, the highscore dialog will be shown. Otherwise the result is displayed in the statusbar or, if this option is enabled, additionally in a dialog.
de: Wenn Sie ein Spiel gewonnen haben und dabei eine neues bestes Spielergebnis erzielt haben, wird der Dialog <guilabel>Bestenliste</guilabel> geöffnet. Ansonsten wird das Ergebnis in der Statusleiste oder, wenn diese Einstellung aktiviert ist, zusätzlich in einem Dialog angezeigt.

source: <guimenu>Settings</guimenu> <guimenuitem>Show Left Grid</guimenuitem> <guimenu>Settings</guimenu> <guimenuitem>Show Right Grid</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>Linkes Gitter anzeigen</guimenuitem> <guimenu>Einstellungen</guimenu> <guimenuitem>Rechtes Gitter anzeigen</guimenuitem>

source: Using the grids makes it easier to place a shot with the mouse pointer.
de: Mit dem Gitter ist es leichter, einen Schuß mit der Mauszeiger zu platzieren.

source: <guimenu>Settings</guimenu> <guisubmenu>Difficulty</guisubmenu>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>Schwierigkeitsgrad</guimenuitem>

source: The game difficulty setting (<guimenuitem>Easy</guimenuitem>, <guimenuitem>Medium</guimenuitem>, <guimenuitem>Hard</guimenuitem>) has effect only in single player games against the computer. In higher levels the AI uses a smarter strategy for shooting and placing ships.
de: Die Einstellungen für den Schwierigkeitsgrad des Spiels (<guimenuitem>Leicht</guimenuitem>, <guimenuitem>Mittel</guimenuitem>, <guimenuitem>Schwierig</guimenuitem>) wirkt sich nur in Spielen gegen den Rechner aus. In höheren Schwierigkeitsgraden benutzt die KI eine bessere Strategie für das Schießen und die Anordnung der Schiffe.

source: Additionally &kappname; has the common &kde; <guimenu>Settings</guimenu> and <guimenu>Help</guimenu> menu items, for more information read the sections about the <ulink url="help:/fundamentals/ui.html#menus-settings">Settings Menu</ulink> and <ulink url="help:/fundamentals/ui.html#menus-help">Help Menu</ulink> of the &kde; Fundamentals.
de: Zusätzlich hat &kappname; die bekannten &kde;-Einträge im Menü <guimenu>Einstellungen</guimenu> und <guimenu>Hilfe</guimenu>, weitere Informationen dazu finden Sie in den Abschnitten über die Menüs <ulink url="help:/fundamentals/ui.html#menus-settings">Einstellungen</ulink> und <ulink url="help:/fundamentals/uihtml#menus-help">Hilfe</ulink> der &kde;-Grundlagen.

source: Frequently Asked Questions
de: Häufig gestellte Fragen

source: I'm not sure where to shoot, can I get a hint?
de: Ich weiß nicht, wohin ich schießen soll, gibt es Tipps?

source: No, there is no hint system in &kappname;.
de: Nein, in &kappname; gibt es keine Tipps.

source: How can I rotate a ship?
de: Wie kann ich ein Schiff drehen?

source: Move the ship where you want to place it, then press the &RMB;
de: Setzen Sie das Schiff auf das Spielfeld und drücken Sie dann die &RMB;.

source: Can I change how the game looks?
de: Kann ich das Erscheinungsbild des Spiels ändern?

source: No, the theme is not changeable.
de: Nein, das Design kann nicht geändert werden.

source: Credits and License
de: Danksagungen und Lizenz

source: Authors
de: Autoren

source: Contributors
de: Beiträge von:

source: Documentation updated for &kde; 3.4 by <personname><firstname>Brian</firstname><surname>Beck</surname></personname> <email>brian.beck@mchsi.com</email>
de: Dokumentation für &kde; 3.4 überarbeitet von <personname><firstname>Brian</firstname><surname>Beck</surname></personname> <email>brian.beck@mchsi.com</email>

source: Documentation updated for &kde; 4 by <personname><firstname>Elisa</firstname><surname>Tonello</surname></personname> <email>elisa.tonello@gmail.com</email>
de: Dokumentation für &kde; 4 überarbeitet von <personname><firstname>Elisa</firstname><surname>Tonello</surname></personname> <email>elisa.tonello@gmail.com</email>

source: CREDIT_FOR_TRANSLATORS
de: <para>Deutsche Übersetzung von Maren Pakura <email>maren@kde.org</email></para>

source: Compilation and Installation
de: Kompilierung und Installation
