Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdegames/kolf.po
Languages: de

source: The &kolf; Handbook
de: Das Handbuch zu &kolf;

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Maren</firstname><surname>Pakura</surname><affiliation><address><email>maren@kde.org</email></address></affiliation><contrib>Deutsche Übersetzung</contrib></othercredit>

source: This documentation describes the game of &kappname; version &kappversion;
de: Dieses Handbuch beschreibt das Spiel &kappname; in der Version &kappversion;

source: game
de: Spiel

source: miniature
de: Miniatur

source: ten players
de: Zehn Spieler

source: Introduction
de: Einführung

source: Gametype:
de: Spieltyp:

source: Number of possible players:
de: Anzahl der Spieler:

source: <para>Ten</para>
de: <para>Zehn</para>

source: &kappname; is a miniature golf game with 2d top-down view. Courses are dynamic, and up to 10 people can play at once in competition.
de: &kappname; ist ein Minigolfspiel aus einer 2D-Vogelperspektive. Die Golfplätze sind dynamisch und bis zu zehn Spieler können an einem Wettbewerb teilnehmen.

source: &kappname; comes with a tutorial course. <link linkend="howto">Playing this course</link> is the easiest way to get started.
de: Es gibt einen Übungsplatz in &kappname;. Mit diesem <link linkend="howto">Übungsplatz</link> sollten Sie beginnen.

source: How to Play
de: Spielanleitung

source: Objective:
de: Ziel des Spiels:

source: Put the ball into the hole with the least possible hits.
de: Den Ball mit möglichst wenig Schlägen in das Loch spielen.

source: &kappname;'s game-play is simple. It is the easiest to learn how to play hands-on, and thus a tutorial course is included to guide you through the basics. This chapter will guide you through this tutorial. To start the tutorial, choose <menuchoice><guimenu>Help</guimenu><guimenuitem>Tutorial</guimenuitem></menuchoice>.
de: Die Spielregeln für &kappname; sind einfach. Am schnellsten lernen Sie am praktischen Beispiel, daher ist ein Übungsplatz enthalten, der in die Grundlagen einführt. Ein Spiel auf dem Übungsplatz wird mit <menuchoice><guimenu>Hilfe</guimenu> <guimenuitem>Einführung</guimenuitem></menuchoice> gestartet.

source: Hitting the Ball
de: Den Ball schlagen

source: To aim the ball, either line up the mouse behind the ball so the putter aims in the direction you want to hit it or press one of the <keycap>Left Arrow</keycap> (counterclockwise) or <keycap>Right Arrow</keycap> (clockwise) keys, to rotate the putter.
de: Um zu zielen, platzieren Sie entweder den Mauszeiger hinter den Ball oder betätigen die Taste <keycap>Pfeil links</keycap> (entgegen dem Uhrzeigersinn) oder <keycap>Pfeil rechts</keycap> (im Uhrzeigersinn), um die Zielrichtung zu ändern.

source: To rotate the putter more quickly with the keyboard, hold down &Shift; while pressing or holding the arrow keys. To rotate more slowly, hold down &Ctrl;.
de: Damit die Zielrichtung sich schneller ändert, halten Sie die &Shift;-Taste gedrückt. Langsamer wird die Drehung durch Drücken der &Ctrl;-Taste.

source: To hit the ball, press and hold either the &LMB; or <keycap>Down Arrow</keycap> key. The longer you hold down the key or button, the more strength the putt will have. It will take practice to get a good feel for speed.
de: Der Ball wird geschlagen durch Betätigen der &LMBn; oder der Taste <keycap>Pfeil runter</keycap>. Je länger die Taste gehalten wird, umso mehr Kraft hat der Schlag. Das richtige Gefühl erfordert einige Übung.

source: To stop the putt while you are still holding moving the putter back in your stroke, press &Esc;.
de: Um den Schlag abzubrechen, solange man die Taste hält, betätigen Sie die Taste &Esc;.

source: Hit the ball into the hole to move on to the next.
de: Der Ball muss in das Loch gespielt werden.

source: Slopes
de: Hänge

source: Slopes are slanted areas of the course that the golf ball rolls down in an expected manner. The light of the golf course is from the upper-left, so the brightest slopes will push the ball towards the upper-left corner of the hole. Choose <menuchoice><guimenu>Hole</guimenu><guimenuitem>Show Info</guimenuitem></menuchoice> to see an arrow that points in the direction the slope will roll the ball.
de: Hänge sind geneigte Bereiche des Platzes, auf denen der Golfball hinunterrollt. Das Licht scheint von oben links auf den Golfplatz, also rollt der Ball auf den hellsten Hängen in Richtung oben links. Wählen Sie <menuchoice><guimenu>Bahn</guimenu> <guimenuitem>Informationen anzeigen</guimenuitem></menuchoice>, um einen Pfeil anzeigen zu lassen, der die Richtung der Neigung angibt.

source: On this tutorial hole, hit the ball onto the upward-pointing slope and let it roll into the cup to move onto the next hole.
de: Schlagen Sie den Ball bei dieser Einführungsbahn den Hang hoch und lassen Sie ihn abwärts in das Loch rollen.

source: Directions
de: Richtungen

source: On the next hole, experiment with the other kinds of slopes. There are elliptical, vertical, horizontal, and diagonal slopes in &kappname;. Hit the ball into the hole.
de: Experimentieren Sie bei der nächsten Bahn mit weiteren Hängen. Es gibt elliptische, vertikale, horizontale und diagonale Hänge in &kappname;. Schlagen Sie den Ball in das Loch.

source: Steepness
de: Steilheit

source: The next tutorial hole has two slopes of differing steepness. If you choose <menuchoice><guimenu>Hole</guimenu><guimenuitem>Show Info</guimenuitem></menuchoice>, the steepness of the slope will appear as a number from 1-8, where 8 is steepest and 1 is shallowest. Hit the ball into the hole and continue to the next hole.
de: Bei der nächsten Einführungsbahn gibt es zwei Hänge mit unterschiedlicher Neigung. Falls Sie <menuchoice><guimenu>Bahn</guimenu> <guimenuitem>Informationen anzeigen</guimenuitem></menuchoice> wählen, erscheint die Neigung als eine Zahl von 1-8, wobei 8 der größten und 1 der geringsten Neigung entspricht. Schlagen Sie den Ball in das Loch und gehen Sie weiter zur nächsten Bahn.

source: Walls
de: Mauern

source: Balls bounce of walls as one would expect them to, with a little bit of dampening. Deflect the ball off the walls and into the cup to advance to the next hole.
de: Bälle prallen von Wänden ab, werden dabei aber etwas langsamer. Schlagen Sie den Ball in das Loch und gehen Sie zur nächsten Bahn.

source: Puddles and Sand
de: Pfützen und Sand

source: Puddles
de: Pfütze

source: Puddles are blue. When your ball rolls into a puddle, a penalty stroke is added to your score and you must then choose where you want to take your next shot from: either next to the puddle or from the same place as where you just took the last shot.
de: Pfützen sind blau. Wenn der Ball in eine Pfütze rollt, wird ein Strafschlag zur Punktzahl addiert. Sie müssen sich dann entscheiden, ob Sie den letzten Schlag wiederholen oder ob Sie den Ball neben der Pfütze platzieren und von dort weiter schlagen.

source: Sand is yellow. Balls roll through sand very slowly.
de: Sand ist gelb. Bälle werden im Sand stark abgebremst.

source: Hit the ball around the puddles and through the sand into the hole to continue to the next tutorial hole.
de: Schlagen Sie den Ball um die Pfütze herum und durch den Sand in das Loch und gehen Sie zur nächsten Bahn der Einführung.

source: Windmills
de: Windmühlen

source: Windmills are compound objects with brown border walls and a moving arm on one side. Half-walls create the opening to the windmill, which the black arm swings across. It takes practice to be able to time the stroke of the ball to pass through the opening. Hit the ball through the windmill into the hole to continue.
de: Windmühlen sind zusammengesetzte Objekte mit braunen Wänden und einem beweglichen Arm an einer Seite des Objekts. Die Öffnung zur Windmühle besteht aus Halbwänden mit einem schwingenden, schwarzen Arm. Diese Hindernisse erfordern einige Übung. Schlagen Sie den Ball durch die Windmühle ins Loch, um weiter zur nächsten Bahn zu kommen.

source: Black Holes
de: Schwarze Löcher

source: When you hit your ball into a black hole, it is transported to the exit and ejected at the angle of the exit at a speed directly relational to the speed your ball was going. Choose <menuchoice><guimenu>Hole</guimenu><guimenuitem>Show Info</guimenuitem></menuchoice> to see which Black Hole goes to which exit and which direction the ball will come out of the exit. The rim around Black Holes are the same color as their corresponding exits. Hit the ball into the black hole, which will then eject the ball into the cup so you can go to the next hole.
de: Wenn Sie den Ball in ein Schwarzes Loch schlagen, wird er zum Ausgang dieses Lochs transportiert und es dort wieder unter dem gleichen Winkel verlassen. Wählen Sie <menuchoice><guimenu>Bahn</guimenu> <guimenuitem>Informationen anzeigen</guimenuitem></menuchoice>, um die Verbindungen zwischen den Schwarzen Löchern und den Ausgängen anzeigen zu lassen. Der farbige Rand eines Schwarzen Lochs zeigt ebenfalls an, zu welchem Ausgang es gehört. Schlagen Sie den Ball in das Schwarze Loch, das ihn in das Loch befördert, und gehen Sie zur nächsten Bahn.

source: Floaters
de: Flöße

source: Floaters are moving platforms that carry a ball that lands on it. Floaters' speeds vary. This one is a pretty slow floater, but you still must time your shot so you can go over the wall and into the cup.
de: Flöße sind bewegliche Plattformen, die gelandete Bälle tragen können. Die Geschwindigkeit von Flößen variiert. Dieses Floß ist recht langsam, dennoch müssen Sie den Schlag zur richtigen Zeit ausführen, um über die Mauer in das Loch zu treffen.

source: Bridges
de: Brücken

source: Bridges are simple - they just lift the ball above the things below them, like slopes, sand, and puddles. They can have brown walls on their perimeter.
de: Brücken sind einfach - sie transportieren den Ball über die unterhalb liegenden Hindernisse wie Hänge, Sand und Pfützen. Sie können am Rand braune Wände haben.

source: Game Rules, Strategies and Tips
de: Spielregeln, Spielstrategien und Tipps

source: Here's in-depth description of &kappname;'s basic features.
de: Es folgt eine ausführliche Beschreibung der grundlegenden Funktionen von &kappname;.

source: Starting a Game
de: Ein Spiel starten

source: To start a game, choose <menuchoice><guimenu>Game</guimenu><guimenuitem>New</guimenuitem></menuchoice>. This opens a dialog where you can configure your new game.
de: Ein Spiel wird durch <menuchoice><guimenu>Spiel</guimenu> <guimenuitem>Neu</guimenuitem></menuchoice> gestartet. Ein Dialog erscheint, der die Einrichtung des neuen Spiels erlaubt.

source: <guilabel>Players</guilabel> Page
de: Seite <guilabel>Spieler</guilabel>

source: To add a player to your game, click the <guibutton>New Player</guibutton> button.
de: Um einen Spieler zum Wettbewerb hinzuzufügen, klicken Sie auf den Knopf <guibutton>Neuer Spieler</guibutton>.

source: To change the name of the players, change the text in the text boxes.
de: Zum Ändern der Spielernamen ist lediglich der Text in den Eingabefeldern zu ändern.

source: To remove a player, click the <guibutton>Remove</guibutton> button next to the player's name.
de: Ein Spieler wird durch Klicken auf <guibutton>Entfernen</guibutton> neben dem Spielernamen entfernt.

source: <guilabel>Course</guilabel> Page
de: Seite <guilabel>Platzauswahl</guilabel>

source: To choose the course that you want to play, click its entry in the list box on the left of this page. &kappname; comes with many built-in courses that you can play.
de: Um einen Golfplatz zu wählen, klicken Sie auf dessen Eintrag in der Liste links auf dieser Seite. In &kappname; sind bereits viele Plätze enthalten.

source: To add a course that you have downloaded or made, click on the <guibutton>Add...</guibutton> button on the bottom of this page, and choose the course file in the file dialog.
de: Sie können einen eigenen oder heruntergeladenen Platz durch Klicken auf <guibutton>Hinzufügen ...</guibutton> unten auf der Seite hinzufügen.

source: <guilabel>Options</guilabel> Page
de: Seite <guilabel>Spiel-Einstellungen</guilabel>

source: On this page you can choose whether or not this game will be played in <guilabel>Strict mode</guilabel>. In strict mode, there is no undo, moving holes, or editing of the course. This mode is generally for competition. Only in strict mode are high scores kept.
de: Auf dieser Seite können Sie auswählen, ob Sie das Spiel im <guilabel>Strengen Modus</guilabel> spielen wollen. In diesem Modus dürfen keine Aktionen rückgängig gemacht, keine Löcher übergangen und nicht die Position des Balls verändert werden. Dieser Modus ist für Wettbewerbe geeignet. Nur in diesem Modus wird die Bestenliste geführt.

source: Saved Games
de: Gespeicherte Spiele

source: &kappname; can keep a history of your rounds that are still in progress and save them to disk so you can load them and play them later. Saved games include the current hole, names and colors of all players in game, and the scores of the players.
de: &kappname; kann nicht abgeschlossene Runden zwischenspeichern. Sie können diese wieder aufrufen und später weiterspielen. Es werden die aktuelle Bahn, die Namen und Farben der Spieler sowie die Spielstände abgespeichert.

source: Saving Your Game
de: Ein Spiel speichern

source: To save your game while still playing, choose <menuchoice><guimenu>Game</guimenu><guimenuitem>Save Game</guimenuitem> </menuchoice>. If you have not saved a game on this game before, you will be prompted for the file to save to.
de: Um ein Spiel zu speichern, wählen Sie im Menü <menuchoice><guimenu>Spiel</guimenu> <guimenuitem>Spiel speichern</guimenuitem></menuchoice>. Falls dieses Spiel noch nicht gespeichert wurde, werden Sie nach dem gewünschten Dateinamen gefragt.

source: Loading Your Game
de: Ein Spiel laden

source: To load the game that you saved, choose <menuchoice><guimenu>Game</guimenu><guimenuitem>Load...</guimenuitem> </menuchoice>. You can then choose the saved game to open.
de: Um ein gespeichertes Spiel zu laden, wählen Sie <menuchoice><guimenu>Spiel</guimenu> <guimenuitem>Laden ...</guimenuitem></menuchoice> aus dem Menü. Sie können dann in einem Dialog ein gespeichertes Spiel auswählen.

source: Practicing
de: Üben

source: There are a few features that make practicing your golf easier. These features are not enabled during strict mode.
de: Einige Funktionen erleichtern das Üben, sind aber im <quote>strengen Modus</quote> nicht verfügbar.

source: Undo
de: Zurücknehmen

source: To undo a bad shot, choose <menuchoice><guimenu>Hole</guimenu><guimenuitem>Undo Shot</guimenuitem></menuchoice>.
de: Sie können einen Schlag mit <menuchoice><guimenu>Bahn</guimenu> <guimenuitem>Schlag zurücknehmen</guimenuitem></menuchoice> rückgängig machen.

source: Switching Holes
de: Bahn wechseln

source: The <guimenu>Go</guimenu> menu contains many menu items for switching to different holes that are quite self explanatory. See the <link linkend="go-menu"><guimenu>Go</guimenu> menu reference</link>.
de: Das Menü <guimenu>Gehe zu</guimenu> enthält einige Einträge zum Wechseln zwischen den Bahnen. Siehe auch die Menüreferenz zu <link linkend="go-menu"><guimenu>Gehe zu</guimenu></link>.

source: Putting Options
de: Einstellungen zum Schlag

source: &kappname; has a few ways to putt. The basic putting method is <link linkend="hitting">described above</link>.
de: Es gibt in &kappname; mehrere Schlagvarianten. Die grundlegenden Schlagvarianten sind <link linkend="hitting">weiter oben</link> beschrieben.

source: The mouse is enabled by default. This means that whenever the mouse is moved, the putter aligns to the line between the mouse and ball.
de: Die Maus ist standardmäßig aktiviert. Damit folgt die Zielrichtung des Schlages jeder Bewegung der Maus.

source: If you prefer to only use the keyboard and arrow keys, you can disable mouse putting by unchecking <menuchoice><guimenu>Settings</guimenu><guimenuitem>Enable Mouse for Moving Putter</guimenuitem></menuchoice>.
de: Falls Sie die alleinige Benutzung der Tastatur bevorzugen, können sie die Maus deaktivieren, indem Sie die Markierung von <menuchoice><guimenu>Einstellungen</guimenu> <guimenuitem>Maus aktivieren zum Bewegen des Putters</guimenuitem></menuchoice> entfernen.

source: Advanced Putting
de: Erweiterte Schläge

source: Advanced putting can be enabled by checking <menuchoice><guimenu>Settings</guimenu><guimenuitem>Enable Advanced Putting</guimenuitem></menuchoice>. This putting mode is slightly more challenging than the regular click-and-hold mode, and can be used with either the mouse or keyboard.
de: Erweiterte Schläge werden durch Markieren von <menuchoice><guimenu>Einstellungen</guimenu> <guimenuitem>Fortgeschrittenes Einlochen aktivieren</guimenuitem></menuchoice> eingeschaltet. Dieser Schlagmodus ist komplizierter als der Standardmodus, kann aber ebenfalls mit Maus oder Tastatur ausgeführt werden.

source: To putt in this mode:
de: Um in diesem Modus zu schlagen:

source: Click or press the <keycap>Down Arrow</keycap> key once to begin the swing. The putting indicator will appear, and the strength gauge will start filling up with a color, which changes as the gauge fills up.
de: Klicken Sie mit der &LMBn; oder betätigen Sie die Taste <keycap>Pfeil runter</keycap> einmal, um auszuholen. Der Schlaganzeiger erscheint und die Schlagstärkeanzeige füllt sich mit einer Farbe, die sich im Laufe der Füllung ändert.

source: Click or press the <keycap>Down Arrow</keycap> key when the strength gauge has filled up the amount that you want. The farther around the circle the strength gauge has filled up, the stronger the putt will be. It takes practice to be able to get the correct strength on putts.
de: Klicken Sie mit der &LMBn; oder betätigen Sie <keycap>Pfeil runter</keycap> ein zweites Mal, wenn die gewünschte Stärke erreicht ist. Je weiter die Schlagstärkeanzeige gefüllt ist, desto stärker fällt der Schlag aus. Es erfordert einige Übung, die korrekte Schlagstärke zu wählen.

source: After this, the color in the putting indicator will start to wind down back to where it started.
de: Schließlich geht die Farbe des Schlagstärkeanzeigers wieder auf den Anfangswert zurück.

source: Click or press the <keycap>Down Arrow</keycap> key again when the strength-indicator is as close as possible to the center line of the putting indicator.
de: Klicken Sie mit der &LMBn; oder betätigen Sie <keycap>Pfeil runter</keycap> wieder, wenn der Stärkeanzeiger so dicht wie möglich an der Mittellinie des Schlaganzeigers ist.

source: The closer the final click (or key press) is, the more true the putt is to the original line.
de: Je dichter der letzte Klick (oder Tastendruck) an der Mittellinie ist, desto genauer folgt der Schlag der ursprünglichen Linie.

source: Interface Overview
de: Die Benutzeroberfläche

source: The Game Menu
de: Das Menü Spiel

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo> </shortcut> <guimenu>Game</guimenu> <guimenuitem>New</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo> </shortcut> <guimenu>Spiel</guimenu> <guimenuitem>Neu</guimenuitem>

source: Start a new game
de: Startet ein neues Spiel.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>O</keycap></keycombo> </shortcut> <guimenu>Game</guimenu> <guimenuitem>Load...</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>O</keycap></keycombo> </shortcut> <guimenu>Spiel</guimenu> <guimenuitem>Laden ...</guimenuitem>

source: Load a previously saved game.
de: Lädt ein vorher gespeichertes Spiel.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>S</keycap></keycombo> </shortcut> <guimenu>Game</guimenu> <guimenuitem>Save Course</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>S</keycap></keycombo></shortcut><guimenu>Spiel</guimenu><guimenuitem>Platz speichern</guimenuitem>

source: Save the current course using its current file name.
de: Speichert den aktuellen Platz unter seinem aktuellen Dateinamen.

source: <guimenu>Game</guimenu><guimenuitem>Save Course As...</guimenuitem>
de: <guimenu>Spiel</guimenu><guimenuitem>Platz speichern als ...</guimenuitem>

source: Open a file dialog allowing you to <action>save the current course using a new file name.</action>
de: Öffnet einen Dateidialog um den <action>Platz unter einem neuen Namen zu speichern.</action>

source: <guimenu>Game</guimenu><guimenuitem>Save Game</guimenuitem>
de: <guimenu>Spiel</guimenu><guimenuitem>Spiel speichern</guimenuitem>

source: <action>Save the current game</action> with the last saved game filename, or under a filename you specify if you have not saved the game yet.
de: <action>Speichert das aktuelle Spiel</action> unter dem aktuellen Dateinamen oder unter einem noch festzulegenden Namen, falls das Spiel bisher nicht gespeichert wurde.

source: <guimenu>Game</guimenu> <guimenuitem>Save Game As...</guimenuitem>
de: <guimenu>Spiel</guimenu><guimenuitem>Spiel speichern als ...</guimenuitem>

source: Open a file dialog allowing you to <action>save the current game with a filename of your choice.</action>
de: Öffnet einen Dateidialog, der erlaubt, das <action>aktuelle Spiel in einer Datei zu speichern.</action>

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>End</keycap> </keycombo></shortcut> <guimenu>Game</guimenu> <guimenuitem>End Game</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Ende</keycap> </keycombo> </shortcut> <guimenu>Spiel</guimenu> <guimenuitem>Spiel beenden</guimenuitem>

source: <action>End the current game, without closing</action> &kappname;
de: <action>Beendet das aktuelle Spiel</action>, ohne &kappname; zu beenden.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>H</keycap></keycombo> </shortcut> <guimenu>Game</guimenu> <guimenuitem>Show High Scores</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>H</keycap></keycombo> </shortcut> <guimenu>Spiel</guimenu> <guimenuitem>Bestenliste anzeigen</guimenuitem>

source: Display the high score table.
de: Zeigt die Bestenliste an.

source: <guimenu>Game</guimenu><guimenuitem>About Course</guimenuitem>
de: <guimenu>Spiel</guimenu><guimenuitem>Über den Platz</guimenuitem>

source: Show name, author, and number of holes of the course.
de: Zeigt Name, Autor und Anzahl der Bahnen des Platzes.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo> </shortcut> <guimenu>Game</guimenu><guimenuitem>Quit</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo> </shortcut> <guimenu>Spiel</guimenu> <guimenuitem>Beenden</guimenuitem>

source: <action>Quit</action> &kappname;
de: <action>Beendet</action> &kappname;.

source: The Hole Menu
de: Das Menü Bahn

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>E</keycap> </keycombo></shortcut> <guimenu>Hole</guimenu> <guimenuitem>Edit</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>E</keycap></keycombo></shortcut> <guimenu>Bahn</guimenu><guimenuitem>Bearbeiten</guimenuitem>

source: <action>Switch to editing mode</action> to edit the current hole.
de: <action>Schaltet in den Bearbeitungsmodus</action>, um die aktuelle Bahn zu bearbeiten.

source: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>N</keycap></keycombo> </shortcut> <guimenu>Hole</guimenu> <guimenuitem>New</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;&Shift;<keycap>N</keycap></keycombo></shortcut><guimenu>Bahn</guimenu><guimenuitem>Neu</guimenuitem>

source: <action>Create a new hole.</action> (Only while editing.)
de: <action>Erzeugt eine neue Bahn.</action> (im Bearbeitungsmodus)
