Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdegames/kolf.po
Languages: de

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Del</keycap> </keycombo></shortcut> <guimenu>Hole</guimenu> <guimenuitem>Clear</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>Entf</keycap></keycombo></shortcut><guimenu>Bahn</guimenu> <guimenuitem>Löschen</guimenuitem>

source: <action>Remove all objects from the current hole.</action> (Only while editing.)
de: <action>Entfernt alle Objekte der aktuellen Bahn.</action> (im Bearbeitungsmodus)

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>R</keycap></keycombo></shortcut> <guimenu>Hole</guimenu> <guimenuitem>Reset</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>R</keycap></keycombo></shortcut><guimenu>Bahn</guimenu><guimenuitem>Zurücksetzen</guimenuitem>

source: <action>Reset the current hole to its starting position</action>, so that you can start over.
de: <action>Setzt die Bahn in die Ausgangsposition zurück</action>, damit Sie neu beginnen können.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>I</keycap></keycombo> </shortcut> <guimenu>Hole</guimenu> <guimenuitem>Show Info</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>I</keycap></keycombo></shortcut><guimenu>Bahn</guimenu><guimenuitem>Informationen anzeigen</guimenuitem>

source: Show information about objects on the current hole.
de: Zeigt Informationen über die Objekte der aktuellen Bahn an.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Z</keycap></keycombo> </shortcut> <guimenu>Hole</guimenu> <guimenuitem>Undo Shot</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>Z</keycap></keycombo></shortcut> <guimenu>Bahn</guimenu><guimenuitem>Schlag zurücknehmen</guimenuitem>

source: Undo the last shot you made.
de: Macht den letzten Schlag rückgängig.

source: The Go Menu
de: Das Menü Gehe zu

source: <guimenu>Go</guimenu> <guisubmenu>Switch to Hole</guisubmenu>
de: <guimenu>Gehe zu</guimenu><guisubmenu>Zu Bahn wechseln</guisubmenu>

source: <action>Go directly to another hole within the course.</action> A list of the hole numbers allows you to choose which hole you wish to go to.
de: <action>Geht direkt zu einer anderen Bahn des Platzes.</action> Eine Liste der Bahnnummern erlaubt die direkte Auswahl der gewünschten Bahn.

source: <shortcut><keycombo action="simul"> &Alt;<keycap>Right</keycap></keycombo></shortcut> <guimenu>Go</guimenu> <guimenuitem>Next Hole</guimenuitem>
de: <shortcut><keycombo action="simul">&Alt;<keycap>Pfeil rechts</keycap></keycombo></shortcut><guimenu>Gehe zu</guimenu><guimenuitem>Nächste Bahn</guimenuitem>

source: Go to the next hole.
de: Geht zu der nächsten Bahn.

source: <shortcut><keycombo action="simul"> &Alt;<keycap>Left</keycap></keycombo></shortcut> <guimenu>Go</guimenu> <guimenuitem>Previous Hole</guimenuitem>
de: <shortcut><keycombo action="simul">&Alt;<keycap>Pfeil links</keycap></keycombo></shortcut><guimenu>Gehe zu</guimenu><guimenuitem> Vorherige Bahn</guimenuitem>

source: Go to the previous hole.
de: Geht zu der vorherigen Bahn.

source: <shortcut><keycombo action="simul"> &Ctrl;<keycap>Home</keycap></keycombo></shortcut> <guimenu>Go</guimenu> <guimenuitem>First Hole</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>Pos1</keycap></keycombo></shortcut><guimenu>Gehe zu</guimenu><guimenuitem>Erste Bahn</guimenuitem>

source: Go to the first hole in the course.
de: Geht zur ersten Bahn des Platzes.

source: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>End</keycap> </keycombo> </shortcut> <guimenu>Go</guimenu> <guimenuitem>Last Hole</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;&Shift;<keycap>Ende</keycap></keycombo></shortcut><guimenu>Gehe zu</guimenu><guimenuitem>Letzte Bahn</guimenuitem>

source: Go to the last hole in the course.
de: Geht zur letzten Bahn des Platzes.

source: <guimenu>Go</guimenu> <guimenuitem>Random Hole</guimenuitem>
de: <guimenu>Gehe zu</guimenu><guimenuitem>Zufällige Bahn</guimenuitem>

source: Go to a random hole from the current course.
de: Geht zu einer zufällig ausgewählten Bahn des Platzes.

source: The Settings Menu
de: Das Menü Einstellungen

source: <guimenu>Settings</guimenu> <guimenuitem>Show Toolbar</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>Werkzeugleiste anzeigen</guimenuitem>

source: Toggle on and off the main toolbar.
de: Blendet die Hauptwerkzeugleiste ein bzw. aus.

source: <guimenu>Settings</guimenu> <guimenuitem>Show Statusbar</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>Statusleiste anzeigen</guimenuitem>

source: Toggle on and off the statusbar.
de: Blendet die Statusleiste ein bzw. aus.

source: <guimenu>Settings</guimenu> <guimenuitem>Enable Mouse for Moving Putter</guimenuitem>
de: <guimenu>Einstellungen</guimenu><guimenuitem>Maus aktivieren zum Bewegen des Putters</guimenuitem>

source: Allow the use of the mouse to move the putter.
de: Erlaubt die Nutzung der Maus zum Bewegen des Putters.

source: <guimenu>Settings</guimenu> <guimenuitem>Enable Advanced Putting</guimenuitem>
de: <guimenu>Einstellungen</guimenu><guimenuitem>Fortgeschrittenes Einlochen aktivieren</guimenuitem>

source: <action>Enable the advanced putting mode</action>, as described in <link linkend="advanced-putting">its own section</link>.
de: <action>Aktiviert den erweiterten Schlagmodus</action>, so wie es in <link linkend="advanced-putting">in diesem Abschnitt</link> beschrieben wird.

source: <guimenu>Settings</guimenu> <guimenuitem>Show Putter Guideline</guimenuitem>
de: <guimenu>Einstellungen</guimenu><guimenuitem>Hilfslinie für Putter anzeigen</guimenuitem>

source: Toggle on and off the putter guideline.
de: Blendet die Hilfslinie für den Putter ein bzw. aus.

source: <guimenu>Settings</guimenu> <guimenuitem>Play Sounds</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>Klänge wiedergeben</guimenuitem>

source: Toggle on and off the sound effects.
de: Schaltet die Klänge ein bzw. aus.

source: <guimenu>Settings</guimenu> <guimenuitem>Enable All Dialog Boxes</guimenuitem>
de: <guimenu>Einstellungen</guimenu><guimenuitem>Alle Dialogfelder aktivieren</guimenuitem>

source: <action>Re-enable any dialog boxes that you disabled by clicking on <guilabel>Do not show this message again</guilabel> or similar</action>.
de: <action>Aktiviert alle Dialogfenster wieder, die durch Klicken auf <guilabel>Diese Nachfrage nicht mehr anzeigen</guilabel> deaktiviert wurden.</action>

source: <guimenu>Settings</guimenu> <guimenuitem>Configure Shortcuts...</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>Kurzbefehle festlegen ...</guimenuitem>

source: Customize the keyboard shortcuts.
de: Öffnet den &kde;-Standarddialog zum Einstellen der Tastenkürzel für &kolf;.

source: <guimenu>Settings</guimenu> <guimenuitem>Configure Toolbars...</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>Werkzeugleisten einrichten ...</guimenuitem>

source: <action>Open a dialog where you can configure the toolbars</action> for &kappname;.
de: <action>Öffnet einen Dialog</action> zum Einrichten der Werkzeugleisten für &kappname;.

source: The Help Menu
de: Das Menü Hilfe

source: &kappname; has a default &kde; <guimenu>Help</guimenu> menu as described below, with one addition:
de: &kappname; enthält die Standard-&kde;-<guimenu>Hilfe</guimenu> mit einem zusätzlichen Eintrag:

source: <guimenu>Help</guimenu> <guimenuitem>Tutorial</guimenuitem>
de: <guimenu>Hilfe</guimenu><guimenuitem>Einführung</guimenuitem>

source: Start the tutorial course of &kappname;.
de: Startet ein Spiel auf dem Übungsplatz von &kappname;.

source: The default &kde; <guimenu>Help</guimenu> entries are:
de: Die Standardeinträge der &kde;-<guimenu>Hilfe</guimenu> sind:

source: Frequently asked questions
de: Häufig gestellte Fragen

source: I want to change the way this game looks. Can I?
de: Kann ich das Erscheinungsbild des Spiels ändern?

source: No. At this moment &kappname; features only one theme.
de: Nein, zurzeit hat &kappname; nur ein Design.

source: Can I use the keyboard to play the game?
de: Kann ich mit der Tastatur spielen?

source: Yes. Use the directional keys to control the putter.
de: Ja, mit den Pfeiltasten können Sie einen Schlag ausführen.

source: I cannot figure out what to do here! Are there hints?
de: Ich komme im Spiel nicht weiter, gibt es Tipps?

source: No. &kappname; does not have a hint feature.
de: Nein, in &kappname; gibt es keine Tipps.

source: I want to design my own golf course. Can I?
de: Wie kann ich meinen eigenen Golfplatz entwerfen?

source: Yes, you can. To enter the edit mode use <menuchoice><shortcut><keycombo action="simul">&Ctrl;<keycap>E</keycap></keycombo></shortcut><guimenu>Hole</guimenu><guimenuitem>Edit</guimenuitem></menuchoice> on the menubar. Click <link linkend="creating">here</link> for more details.
de: Wechseln Sie mit <menuchoice><shortcut><keycombo action="simul">&Ctrl;<keycap>E</keycap></keycombo></shortcut> <guimenu>Bahn</guimenu><guimenuitem>Bearbeiten</guimenuitem></menuchoice> in der Menüleiste in den Bearbeitungsmodus. Weitere Informationen finde Sie <link linkend="creating">hier</link>.

source: Course Editor
de: Golfplatz-Editor

source: &kappname; comes with a versatile editor for its course file format. Courses can have any number of holes, and there is no limiting the creativity of the course designer.
de: &kappname; beinhaltet einen umfangreichen Editor für das Platz-Dateiformat. Sie können eigene Golfplätze mit einer beliebigen Anzahl an Bahnen und unbegrenzten Variationen entwickeln.

source: Creating a New Course
de: Erstellen eines neuen Golfplatzes

source: To create a new course, choose <menuchoice><guimenu>Game</guimenu><guimenuitem>New</guimenuitem></menuchoice>. Go to the <guilabel>Course</guilabel> page of the dialog, and choose the <guilabel>Create New</guilabel> course. Make sure that, under the <guilabel>Options</guilabel> page of the dialog, <guilabel>Strict mode</guilabel> is unchecked.
de: Wählen Sie aus dem Menü <menuchoice><guimenu>Spiel</guimenu> <guimenuitem>Neu</guimenuitem></menuchoice>, um einen neuen Golfplatz zu entwerfen. Gehen Sie auf die Seite <guilabel>Platzauswahl</guilabel> des Dialogs und wählen Sie <guilabel>Hinzufügen ...</guilabel>. Auf der Seite <guilabel>Spiel-Einstellungen</guilabel> darf <guilabel>Strenger Modus</guilabel> nicht markiert sein.

source: To play this new course later, click the <guibutton>Add...</guibutton> button to add the course to your list of courses.
de: Um den Platz später zu spielen, müssen Sie auf <guibutton>Hinzufügen ...</guibutton> klicken und den Platz der Liste der Golfplätze hinzufügen.

source: Adding Holes
de: Bahn hinzufügen

source: Switch to the edit mode using <menuchoice><guimenu>Hole</guimenu><guimenuitem>Edit</guimenuitem></menuchoice>. Choose <menuchoice><guimenu>Hole</guimenu><guimenuitem>New</guimenuitem></menuchoice> to add a new hole at the end of the course.
de: Mittels <menuchoice><guimenu>Bahn</guimenu><guimenuitem>Bearbeiten</guimenuitem></menuchoice> kann in den Bearbeitungsmodus gewechselt werden. Eine neue Bahn wird mittels <menuchoice><guimenu>Bahn</guimenu><guimenuitem>Neu</guimenuitem></menuchoice> am Ende des Platzes hinzugefügt.

source: You can restore a hole to a blank state, similar to when it was first created, by choosing <menuchoice><guimenu>Hole</guimenu><guimenuitem>Clear</guimenuitem></menuchoice>.
de: Durch Auswahl von <menuchoice><guimenu>Bahn</guimenu> <guimenuitem>Löschen</guimenuitem></menuchoice> können Sie eine Bahn wieder in den leeren Anfangszustand versetzen.

source: Two items will appear on new holes: a cup, and a white ball. The white ball marks where players' balls start the hole.
de: Bei neuen Bahnen erscheint zunächst ein Loch und ein weißer Ball. Der weiße Ball markiert die Startposition.

source: Editing Basics
de: Grundlagen der Bearbeitung

source: The basic building block of &kappname; courses is the <quote>object</quote>. Holes are made up of a bunch of objects. Objects can be moved to any location, and the different kinds of objects each have different properties you can set.
de: Die Bestandteile eines Golfplatzes bei &kappname; sind <quote>Objekte</quote>. Jede Bahn besteht aus einer Anzahl von Objekten. Objekte können an jeder Stelle platziert werden und jede Objektart hat spezifische Eigenschaften.

source: To start editing a hole, toggle the <menuchoice><guimenu>Hole</guimenu><guimenuitem>Edit</guimenuitem></menuchoice> menu item, or press the pencil icon on the toolbar. To leave editing mode, uncheck this menu item (or the toolbar icon).
de: Um eine Bahn zu bearbeiten, schaltet man über <menuchoice><guimenu>Bahn</guimenu> <guimenuitem>Bearbeiten</guimenuitem></menuchoice> oder das Bleistiftsymbol in der Werkzeugleiste in den Bearbeitungsmodus. Der Modus wird durch erneuten Aufruf des Menüpunktes (oder betätigen des Symbols) wieder verlassen.

source: Adding Objects
de: Objekte hinzufügen

source: To add a new object to the course, choose its name in the list box labeled <guilabel>Add object:</guilabel>. The object will appear in the center of the course.
de: Um zum Golfplatz ein neues Objekt hinzuzufügen, wählen Sie dessen Namen in der Liste <guilabel>Objekt hinzufügen:</guilabel>. Das gewählte Objekt erscheint in der Mitte des Platzes.

source: Bridges and signs will cover up new objects if they were already in the center of the hole.
de: Falls sich Brücken oder Zeichen in der Mitte befinden, überdecken diese andere Objekte.

source: Moving and Resizing Objects
de: Verschieben von Objekten und deren Größe ändern

source: Move your mouse cursor over the object that you want to move, and the mouse cursor will change to a hand cursor. Then click and drag the object to where you want it.
de: Bewegen Sie den Mauszeiger auf das Objekt, das Sie bewegen wollen, ändert sich der Mauszeiger zu einer Hand. Klicken Sie mit der &LMBn; und ziehen Sie das Objekt an die gewünschte Position.

source: Puddles, sand, floaters, bridges, and signs can be resized by dragging the small circle at their lower-right corner.
de: Pfützen, Sand, Flöße, Brücken und Schilder können durch Ziehen des kleinen Kreises unten rechts in der Größe verändert werden.

source: Walls can be moved by clicking and dragging their endpoints, or you can move the whole wall by clicking and dragging on the middle part of the wall as normal.
de: Wände können durch Klicken auf die Endpunkte in Länge und Richtung verändert werden werden. Die gesamte Wand wird durch Klicken im mittleren Teil der Wand verschoben.

source: Objects' Settings
de: Einstellungen der Objekte

source: Objects' properties can be changed in the area at the lower-right corner of the &kappname; window. To edit an object, move your mouse cursor over it until the cursor changes to the hand cursor. Then click. Various controls for that object will appear in the lower-right corner of the &kappname; window.
de: Die Objekteigenschaften können im Bereich rechts unten im &kappname;-Fenster geändert werden. Klicken Sie auf das Objekt, dessen Eigenschaften Sie ändern möchten. Daraufhin erscheinen verschiedene Einstellmöglichkeiten in der unteren rechten Ecke des &kappname;-Fensters.

source: General Hole Settings
de: Allgemeine Einstellungen der Bahn

source: To edit general hole settings, click an area of the hole that is not covered by an object. When this is possible, the cursor will be the normal pointer cursor.
de: Die allgemeinen Einstellungen der Bahn erhalten Sie, wenn Sie auf eine freie Stelle des Rasens klicken. Freie Stellen erkennen Sie an der normalen Form des Mauszeigers.

source: Course name:
de: Name des Golfplatzes:

source: This is the name that is shown in the new game dialog and in the <guimenuitem>About Course</guimenuitem> dialog.
de: Dieser Name wird im Dialog eines neuen Spiels und im Dialog <guimenuitem>Über den Platz</guimenuitem> angezeigt.

source: Course author:
de: Autor des Platzes:

source: This is the author name that is shown in the <guimenuitem>About Course</guimenuitem> dialog.
de: Dieser Name wird im Dialog <guimenuitem>Über den Platz</guimenuitem> angezeigt.

source: The par of the hole.
de: Das Par der Bahn.

source: The maximum number of strokes a player can take on the hole.
de: Die maximale Anzahl von Schlägen, die ein Spieler für eine Bahn benötigen darf.

source: Show border walls
de: Wände am Spielfeldrand anzeigen

source: Whether or not to show walls around the border of the hole.
de: Ob Wände am Rand um die Bahn angezeigt werden oder nicht.

source: Type
de: Typ

source: Choose the type of the slope - <guilabel>Vertical</guilabel>, <guilabel>Horizontal</guilabel>, <guilabel>Diagonal</guilabel>, <guilabel>Opposite Diagonal</guilabel>, <guilabel>Circular</guilabel>. Diagonal and opposite diagonal slopes are triangles, while circular slopes are circles. Vertical and horizontal slopes are rectangles of course.
de: Wählen Sie den Hangtyp - <guilabel>Senkrecht</guilabel>, <guilabel>Waagerecht</guilabel>, <guilabel>Diagonal</guilabel>, <guilabel>Entgegengesetzt diagonal</guilabel> oder <guilabel>Kreisförmig</guilabel>. Diagonale und entgegengesetzt diagonale Hänge sind Dreiecke, kreisförmige Hänge sind Kreise. Senkrechte und waagerechte Hänge sind rechteckig.

source: Reverse direction
de: umgekehrte Richtung

source: Whether or not to reverse the slant of the slope. For example, consider an elliptical slope (a circular slope). When it is not reversed, it pushes balls outward like a mound. When it is reversed, it sucks balls inward like a hole.
de: Ob die Neigung umgekehrt werden soll. Ein kreisförmiger Hang &eg; wirkt wie ein Hügel. Wenn seine Richtung umgekehrt wird, wirkt er wie eine Mulde.

source: Grade:
de: Neigung:

source: Choose the grade (steepness) of the slope by moving the slider so the grade moves towards 0 or 8, where 8 is steepest and 0 is flat. Steeper slopes push the ball more.
de: Wählen Sie die Neigung (Steilheit) des Hanges durch verschieben des Schiebereglers. Die Neigung wird zwischen 0 und 8 bewegt, wobei 8 die stärkste Neigung und 0 flach ist. Durch starke Neigung wird die Geschwindigkeit des Balls stärker verändert.

source: Unmovable
de: unbeweglich

source: Whether or not this can be moved by other objects, like floaters.
de: Ob das Objekt durch andere Objekte wie Flöße bewegt werden kann.

source: If a floater overlaps with this object at any point on this path, and the slope is large and thus won't move the floater, you <emphasis>must</emphasis> make the slope <guilabel>Unmovable</guilabel>, or &kappname; will suffer poor performance!
de: Falls ein Floß sich mit diesem Objekt an irgendeiner Stelle seines Weges überlappt, <emphasis>muss</emphasis> das Objekt als <guilabel>Unbeweglich</guilabel> gekennzeichnet werden, da sonst &kappname; sehr langsam wird.

source: Puddles and Sand have the same configuration options as each other.
de: Pfützen und Sand haben die gleichen Einstellmöglichkeiten.

source: Enable show/hide
de: Blinkmodus aktivieren

source: Checking this enables the flashing of this puddle or sand.
de: Markieren Sie dieses Feld, damit die Pfütze oder Sandgrube blinkt.

source: The more towards <guilabel>Fast</guilabel> the slider is, the faster the puddle or sand flashes.
de: Je mehr der Schieberegler Richtung <guilabel>Schnell</guilabel> verschoben wird, desto höher ist die Blinkgeschwindigkeit.

source: Bridges, Windmills, Floaters, and Signs
de: Brücken, Windmühlen, Flöße und Schilder

source: Bridges, windmills, floaters, and signs all have similar settings for configuring on which sides there are border walls. To show the wall on a side, check the check box for that side.
de: Brücken, Windmühlen, Flöße und Schilder haben ähnliche Einstellungen dafür, auf welcher Seite sich Wände befinden. Um eine Wand anzuzeigen, wählen Sie das entsprechende Ankreuzfeld aus.

source: There are also some more specific options for windmills, floaters, and signs.
de: Es gibt einige besondere Einstellungen für Windmühlen, Flösse und Schilder.

source: Windmill on bottom
de: Windmühle unten

source: Whether or not the black windmill arm is on bottom or top - the default is that it is on the bottom. The two half-walls will always be with the arm. Note that you cannot enable a border wall on the side that the arm is.
de: Ob der schwarze Windmühlenarm oben oder unten ist - standardmäßig befindet er sich unten. Die zwei Halbwände befinden sich immer dort, wo der Arm ist. Beachten Sie, dass Sie auf der Armseite keine Wand aktivieren können.

source: Speed
de: Geschwindigkeit

source: The more towards <guilabel>Fast</guilabel> the slider is, the faster the black windmill arm moves.
de: Je mehr der Schieberegler in Richtung <guilabel>Schnell</guilabel> bewegt wird, desto schneller bewegt sich der Windmühlenarm.

source: The path the floater moves along is shown by the wall it's connected to.
de: Der Weg des Floßes führt entlang der angrenzenden Wand.

source: Moving speed
de: Bewegungsgeschwindigkeit

source: The more towards <guilabel>Fast</guilabel> the slider is, the faster the floater moves. If the slider is all the way at the <guilabel>Slow</guilabel> end, the floater will stop.
de: Je mehr der Schieberegler Richtung <guilabel>Schnell</guilabel> geschoben wird, desto schneller bewegt sich das Floß. Falls der Schieberegler sich bei der Marke <guilabel>Langsam</guilabel> befindet, hält das Floß an.

source: Signs
de: Zeichen

source: Sign HTML:
de: Text (im HTML-Format)

source: You can enter any valid &HTML; here. For example, entering <userinput>Hit it &lt;i&gt;softly&lt;/i&gt; towards the slope!</userinput> will create the text <quote>Hit it <emphasis>softly</emphasis> towards the slope!</quote>.
de: Hier können beliebige (gültige) &HTML;-Texte eintragen werden. Beispielsweise ergibt <userinput>Schlagen Sie &lt;i&gt;vorsichtig&lt;/i&gt; in Richtung des Hanges!</userinput> den Text <quote>Schlagen Sie <emphasis>vorsichtig</emphasis> in Richtung des Hanges!</quote>

source: Credits and License
de: Danksagungen und Lizenz

source: Developers
de: Entwickler

source: Documentation copyright 2002, &Jason.Katz-Brown;
de: Copyright der Dokumentation 2002, &Jason.Katz-Brown;

source: CREDIT_FOR_TRANSLATORS
de: <para>Deutsche Übersetzung von Maren Pakura <email>maren@kde.org</email></para>

source: Compilation and Installation
de: Kompilierung und Installation
