Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdegames/kollision.po
Languages: de

source: The &kappname; Handbook
de: Das Handbuch zu &kappname;

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Linda-Maria</firstname><surname>Wirthmann</surname><affiliation><address><email>dont.breathe.today@googlemail.de</email></address></affiliation><contrib>Übersetzung</contrib></othercredit><othercredit role="translator"><firstname>Johannes </firstname><surname>Obermayr</surname><affiliation><address><email>johannesobermayr@gmx.de</email></address></affiliation><contrib>Übersetzung</contrib></othercredit>

source: This documentation describes the game of &kappname; version &kappversion;
de: Dieses Handbuch beschreibt das Spiel &kappname; in der Version &kappversion;.

source: kdegames
de: KDE-Spiele

source: game
de: Spiel

source: one player
de: ein Spieler

source: Introduction
de: Einführung

source: Gametype:
de: Spieltyp:

source: Number of possible players:
de: Anzahl der Spieler:

source: <para>One</para>
de: <para>Einer</para>

source: A simple ball dodging game
de: Ein einfaches Springball-Spiel

source: How to play
de: Spielanleitung

source: Objective:
de: Ziel des Spiels:

source: Let the blue ball move in the field without touching the red balls.
de: Bewegen Sie den blauen Ball im Feld umher, ohne die roten Bälle zu berühren.

source: Click on the empty field to start a game: a blue ball immediately replaces your mouse cursor, and a number of red balls start to fade into the field.
de: Klicken Sie auf das leere Spielfeld, um ein Spiel zu starten. Ihr Mauszeiger wird durch einen blauen Ball ersetzt und mehrere rote Bälle erscheinen langsam im Feld.

source: When the red balls finish materializing, they move at a random speed in a random direction, and you have to promptly dodge them moving the blue ball inside the field with your mouse. After some time, other red balls will appear, fading in as before and then starting to move. Be prepared to avoid them, too.
de: Sobald die roten Bälle vollständig erschienen sind, bewegen sie sich mit zufälliger Geschwindigkeit in zufällige Richtungen. Sie müssen ihnen ausweichen, indem Sie den blauen Ball mit ihrem Mauszeiger im Feld umherbewegen. Nach einiger Zeit erscheinen weitere rote Bälle, die sich genau wie die vorigen verhalten. Auch ihnen müssen Sie ausweichen.

source: You can choose the game difficulty level on the right of the status bar. The higher the difficulty level, the faster red balls move, and the more balls will appear on the play field.
de: Sie können den Schwierigkeitsgrad rechts in der Statusleiste auswählen. Je höher der Schwierigkeitsgrad, umso schneller und zahlreicher werden die Bälle.

source: <title>Game Rules, Strategies and Tips</title>
de: <title>Spielregeln, Spielstrategien und Tipps</title>

source: <para>Game Rules, Strategies and Tips</para>
de: <para>Spielregeln, Spielstrategien und Tipps</para>

source: Game Rules
de: Spielregeln

source: Red balls move with constant speed on the game field bouncing off walls until colliding with another ball, which causes the speed and direction of both balls to change.
de: Die roten Bälle bewegen sich mit gleichbleibender Geschwindigkeit durch das Spielfeld und prallen von den Wänden ab. Beim Zusammenstoss zweier Bälle ändert sich deren Geschwindigkeit und Richtung.

source: The blue ball can be freely moved inside the field with the mouse.
de: Der blaue Ball kann mit der Maus frei innerhalb des Feldes bewegt werden.

source: The blue ball cannot escape the field. If the cursor is moved out, the ball stays on the edge, until the cursor returns.
de: Der blaue Ball kann das Spielfeld nicht verlassen. Solange sich der Mauszeiger außerhalb des Feldes befindet, verharrt der Ball am Spielfeldrand.

source: The score is directly proportional to the time the game has lasted.
de: Die Punktzahl ist identisch mit der Spielzeit.

source: Pausing the game subtracts a (cumulative) 5 seconds penalty from the total time.
de: Das Spiel anzuhalten zieht 5 Sekunden (und steigend) von der Gesamtzeit ab.

source: Strategies and Tips
de: Spielstrategien und Tipps

source: Move the blue ball gently and slowly. Swinging across the field will make collisions with other balls more likely.
de: Bewegen Sie den blauen Ball vorsichtig und langsam. Ihn durch das Spielfeld zu schleudern macht Kollisionen mit anderen Bällen wahrscheinlicher.

source: Moving the cursor out of the field can be used as an elegant trick to come out of a screwed situation. Use it wisely.
de: Den Mauszeiger aus dem Spielfeld heraus zu bewegen kann ein eleganter Trick sein, um sich aus ausweglosen Situationen zu befreien. Verwenden Sie ihn mit Bedacht.

source: Do not pause the game unless absolutely necessary.
de: Halten Sie das Spiel nicht an, sofern es nicht absolut notwendig ist.

source: Interface Overview
de: Die Benutzeroberfläche

source: Menu Items
de: Menüeinträge

source: <guimenu>Game</guimenu> <guimenuitem>End game</guimenuitem>
de: <guimenu>Spiel</guimenu> <guimenuitem>Spiel beenden</guimenuitem>

source: End a game and return to the welcome screen.
de: Beendet ein Spiel und zeigt den Willkommens-Bildschirm an.

source: <shortcut> <keycap>P</keycap></shortcut> <guimenu>Game</guimenu> <guimenuitem>Pause</guimenuitem>
de: <shortcut> <keycap>P</keycap> </shortcut> <guimenu>Spiel</guimenu> <guimenuitem>Pause</guimenuitem>

source: Pauses or resumes the game.
de: Hält das Spiel an bzw. setzt es fort.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>H</keycap></keycombo> </shortcut> <guimenu>Game</guimenu> <guimenuitem>Show High Scores</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>H</keycap></keycombo> </shortcut> <guimenu>Spiel</guimenu> <guimenuitem>Bestenliste anzeigen</guimenuitem>

source: This will show the best scores for the current level.
de: Zeigt die Bestenliste für die gegenwärtige Ebene.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo> </shortcut> <guimenu>Game</guimenu> <guimenuitem>Quit</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo> </shortcut> <guimenu>Spiel</guimenu> <guimenuitem>Beenden</guimenuitem>

source: Selecting this item will end your current game, and exit &kappname;.
de: Diese Auswahl beendet das laufende Spiel und &kappname;.

source: <guimenu>Settings</guimenu> <guimenuitem>Play Sounds</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>Klänge wiedergeben</guimenuitem>

source: <action>Toggle whether sound effects should be played.</action> The default is off.
de: <action>Legt fest, ob Klänge abgespielt werden sollen.</action> Per Voreinstellung sind die Klänge ausgeschaltet.

source: <guimenu>Settings</guimenu> <guisubmenu>Difficulty</guisubmenu>
de: <guimenu>Einstellungen</guimenu> <guisubmenu>Schwierigkeitsgrad</guisubmenu>

source: Allows you to select a difficulty <guilabel>Easy</guilabel>, <guilabel>Medium</guilabel>, <guilabel>Hard</guilabel> for the game.
de: Ermöglicht die Einstellung des Schwierigkeitsgrads <guilabel>Einfach</guilabel>, <guilabel>Mittel</guilabel>, <guilabel>Schwierig</guilabel> für das Spiel.

source: Additionally &kappname; has the common &kde; <guimenu>Settings</guimenu> and <guimenu>Help</guimenu> menu items, for more information read the sections about the <ulink url="help:/fundamentals/ui.html#menus-settings">Settings Menu</ulink> and <ulink url="help:/fundamentals/ui.html#menus-help">Help Menu</ulink> of the &kde; Fundamentals.
de: Zusätzlich hat &kappname; die bekannten &kde;-Einträge im Menü <guimenu>Einstellungen</guimenu> und <guimenu>Hilfe</guimenu>, weitere Informationen dazu finden Sie in den Abschnitten über die Menüs <ulink url="help:/fundamentals/ui.html#menus-settings">Einstellungen</ulink> und <ulink url="help:/fundamentals/uihtml#menus-help">Hilfe</ulink> der &kde;-Grundlagen.

source: Frequently asked questions
de: Häufig gestellte Fragen

source: I want to change the way this game looks. Can I?
de: Kann ich das Erscheinungsbild des Spiels ändern?

source: <para>No.</para>
de: <para>Nein.</para>

source: Can I use the keyboard to play the game?
de: Kann ich mit der Tastatur spielen?

source: No. &kappname; can only be played with a mouse.
de: Nein. &kappname; kann nur mit der Maus gespielt werden.

source: I cannot figure out what to do here! Are there hints?
de: Ich komme im Spiel nicht weiter, gibt es Tipps?

source: &kappname; does not have a <quote>Hint</quote> feature.
de: Nein. In &kappname; gibt es keine Tipps.

source: I have to quit the game now, but I am not finished yet. Can I save my progress?
de: Ich muss das Spiel unterbrechen, kann ich den aktuellen Spielstand speichern?

source: You cannot save games in &kappname;.
de: Sie können in &kappname; keine Spiele speichern.

source: Credits and License
de: Danksagungen und Lizenz

source: Documentation copyright 2008 Paolo Capriotti <email>p.capriotti@gmail.com</email>
de: Dokumentation Copyright 2008 Paolo Capriotti <email>p.capriotti@gmail.com</email>

source: CREDIT_FOR_TRANSLATORS
de: <para>Linda-Maria Wirthmann<email>dont.breathe.today@googlemail.de</email></para> <para>Johannes Obermayr<email>johannesobermayr@gmx.de</email></para>

source: Compilation and Installation
de: Kompilierung und Installation
