Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdegames/konquest.po
Languages: de

source: The &konquest; Handbook
de: Das Handbuch zu &konquest;

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Maren</firstname><surname>Pakura</surname><affiliation><address><email>maren@kde.org</email></address></affiliation><contrib>Deutsche Übersetzung</contrib></othercredit>

source: Developer
de: Entwickler

source: Reviewer
de: Korrektur

source: &konquest; is a game of galactic conquest for &kde;
de: &konquest; ist ein galaktisches Eroberungsspiel für &kde;

source: Introduction
de: Einführung

source: Game type:
de: Spieltyp:

source: Strategy, Board
de: Strategiespiel, Brettspiel

source: Number of players:
de: Anzahl Spieler:

source: Multiplayer
de: Mehrspieler-Spiel

source: Main window of &konquest;
de: Hauptfenster von &konquest;

source: Main window of &konquest;.
de: Hauptfenster von &konquest;

source: &konquest; is the &kde; version of Gnu-Lactic. Players conquer other planets by sending ships to them. The goal is to build an interstellar empire and ultimately conqueror all other player's planets. &konquest; can be played against other people or a computer.
de: &konquest; ist die &kde;-Version von Gnu-Lactic. Spieler schicken Schiffe zu anderen Planeten, um sie zu erobern. Ziel des Spiels ist es, ein galaktisches Imperium zu beherrschen und alle Planeten der Gegner zu erobern. &konquest; kann gegen andere Spieler oder gegen den Rechner gespielt werden.

source: How to Play
de: Spielanleitung

source: When you start &konquest;, press <guibutton>New</guibutton> to start a new game. You will see a dialog in which you need to enter various information to setup your game. Listed below are the following parameters for the new game:
de: Drücken Sie beim Start von &konquest; <guibutton>Neu</guibutton>, um ein neues Spiel zu starten. Es erscheint ein Dialog, in dem Sie die folgenden Einstellungen für das neue Spiel ändern können:

source: Players
de: Spieler

source: Amount of players with <guibutton>Add</guibutton> or <guibutton>Remove</guibutton> players
de: Die Anzahl der Spieler kann mit den Knöpfen <guibutton>Hinzufügen</guibutton> und <guibutton>Entfernen</guibutton> geändert werden.

source: Names of players
de: Namen der Spieler. Durch Doppelklicken auf einen Namen können Sie ihn ändern.

source: Type of players (Computer versus Human)
de: Art der Spieler (Computer oder Mensch)

source: Difficulty of computer players (Low/Normal/Hard)
de: Spielstärke von Computerspielern (leicht, normal, schwer). Durch Doppelklicken auf einen Eintrag können Sie den Typ ändern.

source: To change the name of the player, double-click in the <guilabel>Name</guilabel> column and edit it. To change the type of the player, open the drop-down list by double-clicking in the <guilabel>Type</guilabel> column. It is also possible to select the type of the new players using the drop-down list of the <guibutton>Add</guibutton> button.
de: Um den Namen der Spieler zu ändern, doppelklicken Sie auf einen Eintrag in der Spalte <guilabel>Name</guilabel> und bearbeiten Sie ihn dann. Um den Typ der Spieler zu ändern, doppelklicken Sie auf einen Eintrag in der Spalte <guilabel>Typ</guilabel> und wählen Sie den Typ im Auswahlfeld. Den Typ eines neuen Spielers können Sie auch im Auswahlfeld des Knopfs <guibutton>Hinzufügen</guibutton> auswählen.

source: There are two types of the human players in &konquest;, namely <guimenuitem>Human (Player)</guimenuitem> and <guimenuitem>Human (Spectator)</guimenuitem>. The latter option allows watching the game without taking part in it.
de: Es gibt zwei Arten von menschlichen Spielern in &konquest;, nämlich <guimenuitem>Mensch (Spieler)</guimenuitem> und <guimenuitem>Mensch (Zuschauer)</guimenuitem>. Mit der letzten Einstellung können Sie ein Spiel beobachten ohne mit zuspielen.

source: The type of AI player can be chosen from <guimenuitem>Default (Weak)</guimenuitem> (a player that is neither aggressive in attacks nor in defense), <guimenuitem>Default (Offensive)</guimenuitem> (an aggressive attacking player) and <guimenuitem>Default (Defensive)</guimenuitem> (a player with defensive strategy).
de: Als Typ des KI-Spielers kann zwischen <guimenuitem>Standard (Schwach)</guimenuitem> (der Spieler ist weder aggressiv im Angriff noch in der Verteidigung), <guimenuitem>Standard (Offensiv)</guimenuitem> (ein aggressiv angreifender Spieler) und <guimenuitem>Standard (Defensiv)</guimenuitem> (ein Spieler mit einer defensiven Strategie) gewählt werden.

source: Besides these classic AI players, <guimenuitem>Becai (Balanced)</guimenuitem> is a balanced player taking most of <xref linkend="strattips"/> into account.
de: Neben diesen klassischen KI-Spielern gibt es noch <guimenuitem>Becai (Ausgewogen)</guimenuitem>. Dieser ausgewogene KI-Spieler berücksichtigt viele <xref linkend="strattips"/>.

source: Keep in mind that the actual difficulty of any opponent depends on your very own strategy. If you play aggressively yourself, an aggressive AI player might be easier to defeat than a defensive player, and vice versa.
de: Bedenken Sie, dass der tatsächliche Schwierigkeitsgrad jedes Gegners auch von Ihrer eigenen Strategie abhängt. Wenn Sie selbst aggressiv spielen, ist für Sie wahrscheinlich ein aggressiver KI-Spieler einfacher zu schlagen als ein defensiver KI-Spieler und umgekehrt.

source: <para>Map</para>
de: <para>Karte</para>

source: Number of Neutral planets
de: Anzahl der neutralen Planeten

source: Width and height of the map in tile units
de: Breite und Höhe der Karte in Kacheleinheiten

source: Changing the Owner, Kill Percentage, and Production level of a particular planet
de: Einstellung von Eigentümer, Tötungsrate und Produktion für einzelne Planeten. Klicken Sie mit der &LMBn; auf einen Planeten in der Karte, um ihn auszuwählen.

source: Change the distribution of planets. Press <guibutton>Randomize</guibutton> to make it random.
de: Ändern Sie die Anordnung der Planeten und drücken Sie dazu auf <guibutton>Zufällig</guibutton>.

source: You can select the planet using the map thumbnail in the middle of <guilabel>Map</guilabel> pane. Just click on the planet with the &LMB;, then change the desired options.
de: Sie können einen Planeten in der Vorschau in der Mitte des Bereichs <guilabel>Karte</guilabel> auswählen, Klicken Sie mit der &LMBn; auf einen Planeten und ändern Sie dann dessen Einstellungen.

source: Options
de: Einstellungen

source: Whether or not you can see information about opponents' planets.
de: Stellen Sie ein, ob Sie Informationen über die Planeten des Gegners angezeigt bekommen.

source: Whether or not cumulative production is enabled or not.
de: Aktivieren Sie die gesamte Produktion.

source: If production is enabled immediately after capture.
de: Wählen Sie, ob die Produktion sofort nach der Eroberung beginnt.

source: Allowing amount of ships and other stats to be displayed for neutral planets
de: Schalten Sie die Anzeige der Schiffe und weiterer Statistiken für neutrale Planeten ein oder aus.

source: Set the production level for neutral planets
de: Legen Sie die Produktion für neutrale Planeten fest.

source: When you are done changing these settings (optional), click <guibutton>OK</guibutton> to start the game.
de: Haben Sie alles nach Ihren Wünschen eingestellt, drücken Sie auf click <guibutton>OK</guibutton>, um das Spiel zu starten.

source: New game dialog of &konquest;
de: Der Dialog „Neues Spiel beginnen“ von &konquest;

source: New game dialog of &konquest;.
de: Der Dialog „Neues Spiel beginnen“ von &konquest;

source: Once the game starts, you will be presented with the game board. Blank squares are empty space. At first, each player owns one planet. The planet's background is the player color. If you move your mouse over a planet, you can see additional information. Without the <guilabel>Blind Map</guilabel> option enabled when selecting a game, you can see any information about all planet if you hover over it with mouse. If you had selected the <guilabel>Blind Map</guilabel> option when starting a new game, you will only see the planet's name on planets which have been conquered by opponents.The information can include:
de: Wenn das Spiel startet, sehen Sie das Spielfeld. Leere Felder stellen leeren Weltraum dar. Zu Beginn besitzt jeder Spieler einen Planeten. Die Hintergrundfarbe des Planeten ist die Farbe des Spielers. Um weitere Informationen zu einem Planeten zu erhalten, bewegen Sie den Mauszeiger über ihn. Ist <guilabel>Karte ausblenden</guilabel> aktiv wird nur der Name des Planeten angezeigt, ansonsten alle folgenden Informationen über den Planeten:

source: Planet name
de: Name des Planeten

source: Owner
de: Eigentümer

source: Ships
de: Schiffe

source: Ships Due
de: Dauerauftrag

source: Production
de: Produktion

source: Kill percent
de: Tötungsrate

source: Playing &konquest;
de: &konquest; spielen

source: Playing &konquest;.
de: &konquest; spielen

source: The <guilabel>Planet name</guilabel> is how the planet is referred to in the game. Planets are named alphabetically with uppercase letters. <guilabel>Owner</guilabel> is who owns the planet. If the planet is conquered by another player, this will change. <guilabel>Ships</guilabel> is the current number of ships on the planet. <guilabel>Ships due</guilabel> will only appear if you have selected a standing order for that planet, otherwise it is not there. <guilabel>Production</guilabel> is the number of ships the planet will produce each turn. The production varies from planet to planet, but always remains the same. <guilabel>Kill percent</guilabel> is a measure of the effectiveness of the ships produced at that planet. Attack fleets take the kill percentage of their planet of departure, and defense fleets use the kill percentage of the planet they are defending. You can get easily see the planet name, the owner and the current number of ships on a planet in the square in which the planet lies. The owner is represented by the background color of the planet, the name is in the upper left corner and the number of ships is in the lower right corner.
de: <guilabel>Name des Planeten</guilabel> bezeichnet den Planeten während des Spiels. Planeten werden alphabetisch und in Großbuchstaben benannt. <guilabel>Eigentümer</guilabel> besitzt den Planeten. Wird ein Planet von einem anderen Spieler erobert, ändert sich der Eigentümer des Planeten. <guilabel>Schiffe</guilabel> zeigt die aktuelle Anzahl Schiffe auf dem Planeten. <guilabel>Dauerauftrag</guilabel> wird nur angezeigt, wenn die Einstellung für den Planeten ausgewählt wurde.<guilabel>Produktion</guilabel> ist die Anzahl Schiffe, die der Planet pro Runde produziert. Jeder Planet produziert verschieden viele Schiffe, diese aber konstant. <guilabel>Tötungsrate</guilabel> bezeichnet die Effektivität der auf diesem Planeten produzierten Schiffe. Angriffsflotten übernehmen die Tötungsrate ihres Abflug-Planeten; Verteidigungsflotten die des Planeten, den sie verteidigen. Namen, Eigentümer und Anzahl der stationierten Schiffe sehen Sie in dem Feld, in dem der Planet liegt. Die Hintergrundfarbe des Planeten steht für den Eigentümer, der Name des Planeten steht oben links und die Anzahl der Schiffe unten rechts.

source: To send ships from a planet to another, select the planet you want to send ships from, enter the number of ships in the green box in the upper right corner and press &Enter;. Repeat this procedure until you have sent out all the ships you want. If you wish to send a constant amount of ships from one planet to another every turn, enter that number and check the <guilabel>Standing Order</guilabel> box, and press &Enter;. The ships due to the standing order will be sent at the end of the turn. When you are done, press <guibutton>End Turn</guibutton>. When all players have played one turn, dialog boxes will appear and give you the latest news. The game will proceed like this until one of the players owns the entire galaxy.
de: Um Schiffe von einem Planeten zu einem anderen zu schicken, klicken Sie auf den Startplaneten und auf den Zielplaneten, geben Sie oben rechts die Anzahl Schiffe ein, die Sie versenden möchten und drücken Sie die &Enter;taste. Wiederholen Sie das, bis Sie alle gewünschten Schiffe versendet haben. Möchten Sie in jeder Spielrunde eine konstante Anzahl an Schiffen von einem Planeten zum anderen schicken, aktivieren Sie das Ankreuzfeld <guilabel>Dauerauftrag</guilabel> und drücken die Taste &Enter;. Diese Schiffe werden am Ende der Spielrunde versendet.Wenn Sie fertig sind, drücken Sie <guibutton>Runde beenden</guibutton>. Wenn alle Spieler ihre Runde beendet haben, erscheinen Dialoge mit den aktuellen Ereignissen. Das Spielt wird so fortgesetzt, bis ein Spieler die gesamte Galaxis erobert hat.

source: A keyboard shortcut for <guimenuitem>End Turn</guimenuitem> action can be configured using the <menuchoice> <guimenu>Settings</guimenu> <guimenuitem>Configure Shortcuts...</guimenuitem> </menuchoice> menu item.
de: Ein Kurzbefehl für die Aktion <guimenuitem>Zug beenden</guimenuitem> kann im Menü mit <menuchoice><guimenu>Einstellungen</guimenu> <guimenuitem>Kurzbefehle festlegen ...</guimenuitem></menuchoice> eingerichtet werden.

source: For more information read the section about <ulink url="help:/fundamentals/config.html#shortcuts">Using and Customizing Shortcuts</ulink> of the &kde; Fundamentals.
de: Weitere Informationen dazu finden Sie im Abschnitt <ulink url="help:/fundamentals/config.html#shortcuts">Kurzbefehle benutzen und anpassen</ulink> der &kde;-Grundlagen.

source: Game Rules, Strategies and Tips
de: Spielregeln, Spielstrategien und Tipps

source: Rules
de: Spielregeln

source: Ships cannot be stopped once they leave a planet.
de: Schiffe können unterwegs nicht gestoppt werden, nachdem sie einen Planeten verlassen haben.

source: Ships cannot attack other ships in midair.
de: Schiffe können im Flug keine gegnerischen Schiffe angreifen.

source: Ships can be stored at planets for later use.
de: Schiffe können zum späteren Abruf auf Planeten vorgehalten werden.

source: A planet cannot be given away.
de: Ein Plant kann nicht abgegeben werden.

source: A player can skip a turn by pressing <guibutton>End Turn</guibutton> without launching any ships.
de: Ein Spieler kann eine Runde aussetzen, indem er <guibutton>Runde beenden</guibutton> drückt, ohne Schiffe zu versenden.

source: Strategies and Tips
de: Spielstrategien und Tipps

source: The game is all about ship production. Try to get as many planets as possible as fast as you can in order to build more ships than any of your opponents.
de: In diesem Spiel geht es um die Produktion von Schiffen, Versuchen Sie möglichst viele Planeten so schnell wie möglich zu erobern, damit Sie in der Lage sind, mehr Schiffe als Ihre Gegner zu produzieren.

source: Do not attack a planet with less than 10 ships, unless you can conquer it.
de: Greifen Sie einen Planeten mit mindestens 10 Schiffen an, um ihn zu erobern.

source: Attack neutral planets before other players' planets.
de: Greifen Sie zuerst neutrale Planeten, dann die Planeten des Gegners an.

source: Split your ship storages across several planets.
de: Verteilen Sie Ihre Schiffe auf mehrere Planeten.

source: Plan your attacks in advance.
de: Planen Sie Ihre Angriffe im Voraus.

source: Use the ruler to find out the distance between planets.
de: Benutzen Sie den Entfernungsmesser, um die Entfernung zwischen Planeten zu ermitteln.

source: Use the information window to get information on planets before an attack.
de: Benutzen Sie das Informationsfenster, um vor einem Angriff Informationen über Planeten zu sammeln.

source: If this information is available to you, it is preferable to attack a planet with a low kill ratio from a planet with a high one.
de: Kennen Sie die Tötungsrate von Planeten, sollten Sie besser einen Planeten mit einer niedrigen Tötungsrate angreifen.

source: Menus
de: Menüs

source: Menu Items
de: Menüeinträge

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo> </shortcut> <guimenu>Game</guimenu> <guimenuitem>New</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo> </shortcut> <guimenu>Spiel</guimenu> <guimenuitem>Neu</guimenuitem>

source: Starts a new game.
de: Startet ein neues Spiel.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>End</keycap></keycombo> </shortcut> <guimenu>Game</guimenu> <guimenuitem>End Game</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Ende</keycap> </keycombo> </shortcut> <guimenu>Spiel</guimenu> <guimenuitem>Spiel beenden</guimenuitem>

source: <action>End the current game, without closing</action> &konquest;
de: <action>Beendet das laufende Spiel</action>, aber nicht &konquest;

source: <guimenu>Game</guimenu> <guimenuitem>Measure Distance</guimenuitem>
de: <guimenu>Spiel</guimenu> <guimenuitem>Entfernung messen</guimenuitem>

source: Click with the &LMB; on two planets to see their distance.
de: Klicken Sie mit der &LMBn; auf zwei Planeten, um ihre Entfernung zu messen.

source: <guimenu>Game</guimenu> <guimenuitem>Fleet Overview</guimenuitem>
de: <guimenu>Spiel</guimenu> <guimenuitem>Flottenübersicht</guimenuitem>

source: <action>Opens</action> a window to display detailed information for all fleets
de: <action>Öffnet</action> ein Fenster mit ausführlichen Informationen über alle Flotten.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo> </shortcut> <guimenu>Game</guimenu> <guimenuitem>Quit</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo> </shortcut> <guimenu>Spiel</guimenu> <guimenuitem>Beenden</guimenuitem>

source: Quits the game.
de: Beendet das Spiel.

source: <guimenu>Move</guimenu> <guimenuitem>End Turn</guimenuitem>
de: <guimenu>Zug</guimenu> <guimenuitem>Zug beenden</guimenuitem>

source: Allows you to <action>end turn</action> from the main menu.
de: Ermöglicht es, mit der Aktion im Hauptmenü einen <action>Zug zu beenden</action>.

source: <guimenu>View</guimenu> <guimenuitem>Show Messages</guimenuitem>
de: <guimenu>Spiel</guimenu> <guimenuitem>Nachrichten anzeigen</guimenuitem>

source: <action>Show or hide</action> the messages panel.
de: <action>Blendet</action> das Nachrichtenfenster ein oder aus.

source: <guimenu>View</guimenu> <guimenuitem>Show Standings</guimenuitem>
de: <guimenu>Ansicht</guimenu> <guimenuitem>Stand anzeigen</guimenuitem>

source: <action>Show or hide</action> the current player standings table.
de: <action>Blendet</action> das Fenster mit dem aktuellen Spielstand ein oder aus.

source: Additionally &konquest; has the common &kde; <guimenu>Settings</guimenu> and <guimenu>Help</guimenu> menu items, for more information read the sections about the <ulink url="help:/fundamentals/ui.html#menus-settings">Settings Menu</ulink> and <ulink url="help:/fundamentals/ui.html#menus-help">Help Menu</ulink> of the &kde; Fundamentals.
de: Zusätzlich hat &konquest; die bekannten &kde;-Einträge im Menü <guimenu>Einstellungen</guimenu> und <guimenu>Hilfe</guimenu>, weitere Informationen dazu finden Sie in den Abschnitten über die Menüs <ulink url="help:/fundamentals/ui.html#menus-settings">Einstellungen</ulink> und <ulink url="help:/fundamentals/uihtml#menus-help">Hilfe</ulink> der &kde;-Grundlagen.

source: Frequently Asked Questions
de: Häufig gestellte Fragen

source: Can I redirect ships once they have left a planet?
de: Kann ich die Schiffe umleiten, wenn Sie einen Planeten verlassen haben?

source: No, once ships leave a planet, they cannot be stopped or redirected.
de: Nein, Schiff können während des Fluges weder umgeleitet noch gestoppt werden.

source: Do the different colors and shapes of planets mean anything?
de: Haben die unterschiedlichen Farben und Darstellungen der Planeten eine Bedeutung?

source: No, they are random.
de: Nein, das ist Zufall.

source: How can I know where my ships are?
de: Wie sehe ich, wo sich meine Schiffe befinden?

source: Click <guibutton>Show Standings</guibutton>. It will give you information about fleets currently in flight.
de: Klicken Sie auf <guibutton>Stand anzeigen</guibutton>. Damit öffnen Sie einen Dialog mit Informationen über Ihre Flotte.

source: I have lost all my planets, but I am still in the game, why?
de: Warum geht das Spiel noch weiter, obwohl ich habe alle meine Planeten verloren haben?

source: You have not lost the game until you have lost all your ships.
de: Sie haben das Spiel erst dann verloren, wenn Sie keine Schiffe mehr haben.

source: I am running out of turns, what can I do?
de: Mir gehen die Züge aus, was kann ich tun?

source: You can continue playing. When you are at the last turn, you will be prompted to add more.
de: Sie können weiterspielen. Wenn Sie Ihren letzten Zug spielen, werden Sie gefragt, ob Sie weitere Züge hinzufügen möchten.

source: Can I store ships on a planet for later use?
de: Kann ich Schiffe zur späteren Verwendung auf einem Planeten vorhalten?

source: Yes, you should however store them on multiple planets to be able to send them to nearby planets.
de: Ja. Sie sollten sie jedoch auf mehreren Planeten vorhalten um sie besser zu Planeten in deren Nähe schicken zu können.

source: Is it possible to change the theme?
de: Kann ich das Erscheinungsbild des Spiels ändern?

source: No, that is not possible at the moment.
de: Nein, das ist in dieser Version des Spiels nicht möglich.

source: Credits and License
de: Danksagungen und Lizenz

source: &GNU;-Lactic Conquest Project, &kde; version by &Russ.Steffen;, &Russ.Steffen.mail;.
de: &GNU;-Lactic Conquest Projekt, &kde;-Version von &Russ.Steffen;, &Russ.Steffen.mail;.

source: Copyright &copy; 1998 by the &GNU;-Lactic Conquest Project
de: Copyright &copy; 1998 &GNU;-Lactic Conquest Projekt

source: Documentation copyright 2000 Nicholas Robbins &Nicholas.Robbins.mail;
de: Copyright der Dokumentation 2000 Nicholas Robbins &Nicholas.Robbins.mail;

source: Documentation copyright 2012 Viktor Chynarov
de: Copyright der Dokumentation 2012 Viktor Chynarov

source: CREDIT_FOR_TRANSLATORS
de: <para>Deutsche Übersetzung von Maren Pakura <email>maren@kde.org</email></para>

source: How to obtain &konquest;
de: Woher Sie &konquest; erhalten?

source: Compilation and Installation
de: Kompilierung und Installation
