Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdegames/kpat.po
Languages: de

source: Besides the <quote>Hint</quote> feature there also is a useful <quote>Demo</quote> mode, where the built-in artificial intelligence will play the game for you. You can try to watch and learn. However, if you have any questions it is better to read the <link linkend="howto">How to Play</link> and <link linkend="rules_and_tips">Game Rules, Strategies and Tips</link> sections of this handbook.
de: Außer den Tipps gibt es noch einen <quote>Demomodus</quote>, in dem der Computer spielt und die Spielweise dadurch verdeutlicht. Weitere Fragen sollten die Kapitel <link linkend="howto">Spielanleitung</link> und <link linkend="rules_and_tips">Spielregeln, Spielstrategien und Tipps</link> in diesem Handbuch klären.

source: Credits and License
de: Danksagungen und Lizenz

source: Freecell Solver by Shlomi Fish <email>shlomif@vipe.technion.ac.il</email>
de: Freecell-Löser von Shlomi Fish <email>shlomif@vipe.technion.ac.il</email>

source: Documentation Copyright &copy; 2000 &Paul-Olav.Tvete;
de: Dokumentation Copyright &copy; 2000 &Paul-Olav.Tvete;

source: Documentation updated for &kde; 2.0 by &Mike.McBride; &Mike.McBride.mail;
de: Dokumentation für &kde; 2.0 von &Mike.McBride; &Mike.McBride.mail; überarbeitet

source: Documentation rewritten for &kpatience; 2.0 (&kde; 2.1) by &Maren.Pakura; &Maren.Pakura.mail;
de: Dokumentation für &kpatience; 2.0 (&kde; 2.1) neu geschrieben von &Maren.Pakura; &Maren.Pakura.mail;

source: Documentation proofread and update for &kpatience; &kappversion; by &Richard.Hawthorne; &Richard.Hawthorne.mail;
de: Dokumentation für &kpatience; &kappversion; von &Richard.Hawthorne; &Richard.Hawthorne.mail; überarbeitet

source: CREDIT_FOR_TRANSLATORS
de: <para>Übersetzung: Stephan Kulow<email>coolo@kde.org</email></para><para>Überarbeitung der Übersetzung: Johannes Obermayr<email>johannesobermayr@gmx.de</email></para>

source: Installation
de: Installieren

source: Compilation and Installation
de: Kompilieren und Installieren
