Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdegames/kpat_man-kpat.6.po
Languages: de

source: KDE User's Manual
de: &kde;-Benutzerhandbuch

source: A highly addictive &kde; card game.
de: Ein süchtig machendes &kde;-Kartenspiel.

source: <command>kpat</command> <arg choice="opt" rep="repeat">Qt-option</arg> <arg choice="opt" rep="repeat">KDE-option</arg> <group choice="opt"><option>--solvegame</option> <replaceable> file</replaceable></group> <group choice="opt"><option>--solve</option> <replaceable> num</replaceable></group> <group choice="opt"><option>--start</option> <replaceable> num</replaceable></group> <group choice="opt"><option>--end</option> <replaceable> num</replaceable></group> <group choice="opt"><option>--gametype</option> <replaceable> game</replaceable></group>
de: <command>kpat</command> <arg choice="opt" rep="repeat">Qt-Option</arg> <arg choice="opt" rep="repeat">KDE-Option</arg> <group choice="opt"><option>--solvegame</option> <replaceable> datei</replaceable></group> <group choice="opt"><option>--solve</option> <replaceable> num</replaceable></group> <group choice="opt"><option>--start</option> <replaceable> num</replaceable></group> <group choice="opt"><option>--end</option> <replaceable> num</replaceable></group> <group choice="opt"><option>--gametype</option> <replaceable> spiel</replaceable></group>

source: DESCRIPTION
de: Beschreibung

source: &kpatience; is a compendium of several well known patience card games, ranging from the well known Klondike and Freecell, to lesser known games such as Grandfather's Clock and Mod3. In all there are 12 variations for you to while away time.
de: &kpatience; besteht aus einer Zusammenstellung von 12 verschiedenen Patiencen, unter anderem die bekannten Klondike und Freecell sowie die weniger bekannten Großvaters Uhr und Mod3.

source: OPTIONS
de: Optionen

source: This program follows the usual GNU command line syntax, with long options starting with two dashes (`--'). A summary of the options supported by <command>kpat</command> is included below.
de: Das Programm folgt den GNU-Konventionen für Befehlszeilenoptionen, lange Optionen beginnen dabei mit zwei Bindestrichen (`--'). Eine Zusammenstellung der von <command>kpat</command> unterstützten Optionen befindet sich weiter unten.

source: Generic Options
de: Allgemeine Optionen

source: Show author information
de: Zeigt Informationen über den Autor

source: Show help about options
de: Zeigt eine Hilfe zu den Optionen

source: Show Qt specific options
de: Spezielle Optionen für Qt anzeigen

source: Show &kde; specific options
de: Zeigt die &kde;-spezifischen Optionen

source: Show all options
de: Alle Optionen anzeigen

source: Show license information
de: Zeigt Lizenzinformationen

source: Show version information and exit.
de: Zeigt Versionsinformationen an und beendet sich danach wieder.

source: Qt Options
de: Qt-Optionen

source: --display <replaceable>displayname</replaceable>
de: --display <replaceable>Anzeigename</replaceable>

source: Use the X-server display <emphasis>displayname</emphasis>.
de: Verwendet die X-Server-Anzeige <emphasis>Anzeigename</emphasis>.

source: --session <replaceable>sessionId</replaceable>
de: --session <replaceable>Sitzungs-Id</replaceable>

source: Restore the application for the given <replaceable>sessionId</replaceable>.
de: Stellt den Zustand der Anwendung für die genannte <replaceable>Sitzungs-Id</replaceable> wieder her.

source: Causes the application to install a private color map on an 8-bit display.
de: Veranlasst die Anwendung ein eigenes Farbschema auf einer 8-Bit-Anzeige darzustellen.

source: --ncols <replaceable>count</replaceable>
de: --ncols <replaceable>Anzahl</replaceable>

source: Limits the number of colors allocated in the color cube on a 8-bit display, if the application is using the <methodname>QApplication::ManyColor</methodname> color specification.
de: Begrenzt die Anzahl der erzeugten Farben des Farbwürfels bei einer 8-Bit-Anzeige, falls die Anwendung die Farbspezifikation <methodname>QApplication::ManyColor</methodname> verwendet.

source: tells Qt to never grab the mouse or the keyboard.
de: verhindert, dass Qt die Maus oder die Tastatur einfängt.

source: running under a debugger can cause an implicit <option>-nograb</option>, use <option>-dograb</option> to override.
de: Der Einsatz eines Debugger kann implizit die Option <option>-nograb</option> aktivieren, die Option <option>-dograb</option> dient zur Übersteuerung.

source: switches to synchronous mode for debugging.
de: Schaltet zum Debuggen in den synchronen Modus um.

source: <option>--fn</option>, <option>--font <replaceable>fontname</replaceable></option>
de: <option>--fn</option>, <option>--font <replaceable>Zeichensatz</replaceable></option>

source: defines the application font.
de: Legt den Anwendungszeichensatz fest.

source: <option>--bg</option>, <option>--background <replaceable>color</replaceable></option>
de: <option>--bg</option>, <option>--background <replaceable>Farbe</replaceable></option>

source: sets the default background color and an application palette (light and dark shades are calculated).
de: Legt die Standard-Hintergrundfarbe und die Farbpalette (helle und dunkle Schatten werden berechnet) fest.

source: <option>--fg</option>,<option>--foreground <replaceable>color</replaceable></option>
de: <option>--fg</option>,<option>--foreground <replaceable>Farbe</replaceable></option>

source: sets the default foreground color.
de: Legt die Standardvordergrundfarbe fest.

source: <option>--btn</option>, <option>--button <replaceable>color</replaceable></option>
de: <option>--btn</option>, <option>--button <replaceable>Farbe</replaceable></option>

source: sets the default button color.
de: Legt die Standard-Knopf-Farbe fest.

source: sets the application name.
de: Legt den Namen der Anwendung fest.

source: --title <replaceable>title</replaceable>
de: --title <replaceable>Titel</replaceable>

source: sets the application title (caption).
de: Legt den Titel der Anwendung fest (Fenstertitel).

source: forces the application to use a TrueColor visual on an 8-bit display.
de: Schaltet die Anwendung auf einer 8-Bit-Anzeige um auf eine TrueColor-Anzeige.

source: sets XIM (X Input Method) input style. Possible values are onthespot, overthespot, offthespot and root.
de: Legt den XIM (X Input Method) fest. Mögliche Werte sind onthespot, overthespot, offthespot und root.

source: set XIM server.
de: Legt den XIM-Server fest.

source: disable XIM.
de: XIM deaktivieren.

source: mirrors the whole layout of widgets.
de: Ordnet sämtliche Bedienelemente spiegelverkehrt an.

source: applies the Qt stylesheet to the application widgets.
de: Wendet die Qt-Stilvorlage auf Anwendungs-Dialoge an.

source: use a different graphics system instead of the default one, options are <quote>raster</quote> and <quote>opengl</quote> (experimental).
de: Verwendet ein anderes Grafiksystem anstelle der Voreinstellung. Zur Verfügung stehen „raster“ und „opengl“ (experimentell)..

source: KDE Options
de: KDE-Optionen

source: --caption <replaceable>caption</replaceable>
de: --caption <replaceable>Überschrift</replaceable>

source: Use <emphasis>caption</emphasis> as name in the titlebar.
de: Verwendet <emphasis>Überschrift</emphasis> als Name in der Titelleiste.

source: --icon <replaceable>icon</replaceable>
de: --icon <replaceable>Symbol</replaceable>

source: Use <emphasis>icon</emphasis> as the application icon.
de: Verwendet <emphasis>Symbol</emphasis> als Anwendungssymbol.

source: Use alternative configuration file.
de: Andere Einrichtungsdatei verwenden.

source: Disable crash handler, to get core dumps.
de: Absturzprogramm deaktivieren, zur Erzeugung von <quote>core dumps</quote>.

source: Waits for a WM_NET compatible windowmanager.
de: Wartet auf einen WM_NET-kompatiblen Fenstermanager.

source: --style <replaceable>style</replaceable>
de: --style <replaceable>Stil</replaceable>

source: sets the application &GUI; style.
de: Legt den &GUI;-Stil der Anwendung fest.

source: --geometry <replaceable>geometry</replaceable>
de: --geometry <replaceable>Größe</replaceable>

source: sets the client geometry of the main widget - see the manual page <ulink url="man:/X">man:/X</ulink> for the argument format (usually WidthxHeight+XPos+YPos).
de: Legt die Geometrie des Hauptelements im Client-Programm fest. Das Format für die Argumente finden Sie mit <ulink url="man:/X">man X</ulink> (normalerweise BreitexHöhe+XPos+YPos).

source: Options
de: Optionen

source: <option>--solvegame</option> <replaceable> file</replaceable>
de: <option>--solvegame</option> <replaceable> datei</replaceable>

source: Try to find a solution to the given savegame
de: Lösung für das angegebene gespeicherte Spiel suchen

source: Dealer to solve (debug)
de: Zu lösende Spielart (Debug)

source: Game range start (default 0:INT_MAX)
de: Anfang des Spielbereichs (Standard 0:INT_MAX)

source: Game range end (default start:start if start given)
de: Ende des Spielbereichs (Standard 0:INT_MAX)

source: <option>--gametype</option> <replaceable> game</replaceable>
de: <option>--gametype</option> <replaceable> spiel</replaceable>

source: Skip the selection screen and load a particular game type. Valid values are: acesup, fortyeight, freecell, golf, grandfather, grandfathersclock, gypsy, klondike, mod3, simplesimon, spider, yukon
de: Überspringt den Auswahlbildschirm und startet die gewünschte Spielart direkt. Folgende Spielarten sind verfügbar: acesup, fortyeight, freecell, golf, grandfather, grandfathersclock, gypsy, klondike, mod3, simplesimon, spider, yukon.

source: Arguments
de: Argumente

source: File to load
de: Zu ladende Datei

source: SEE ALSO
de: Siehe auch

source: &kpatience; is documented in detail in <emphasis>The &kpatience; Handbook</emphasis> (<filename>$<envar>KDEDIR</envar>/share/doc/HTML/en/kpat/index.html</filename> or enter <userinput>help:/kpat/index.html</userinput> in &konqueror;).
de: &kpatience; wird detailliert beschrieben im <emphasis>Handbuch zu &kpatience;</emphasis> (unter <filename>$<envar>KDEDIR</envar>/share/doc/HTML/de/kpat/index.html</filename> oder durch Eingabe von <userinput>help:/kpat/index.html</userinput> in &konqueror;).

source: AUTHOR
de: Autor

source: &kpatience; is by:
de: &kpatience; stammt von:
