Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdegames/kpat.po
Languages: de

source: The &kappname; Handbook
de: Das Handbuch zu &kappname;

source: Reviewer
de: Korrektur

source: Developer
de: Entwickler

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Stephan</firstname><surname>Kulow</surname><affiliation><address><email>coolo@kde.org</email></address></affiliation><contrib>Übersetzer</contrib></othercredit>

source: This documentation describes the game of &kappname; version &kappversion;
de: Dieses Handbuch beschreibt das Spiel &kappname; in der Version &kappversion;

source: game
de: Spiel

source: KPatience
de: Patience

source: card
de: Karte

source: card game
de: Kartenspiel

source: playing cards
de: Karten spielen

source: one player
de: Einzelspieler

source: solitaire
de: Solitär

source: Introduction
de: Einführung

source: Gametype:
de: Spielart:

source: Card
de: Karte

source: Number of possible players:
de: Anzahl der Spieler:

source: <para>One</para>
de: <para>Einer</para>

source: To play patience you need, as the name suggests, patience. For simple games, where the way the game goes depends only upon how the cards fall, your patience might be the only thing you need.
de: Eine Patience zu spielen erfordert, wie der Name schon sagt, Geduld. Für einfache Spiele, in denen der Spielverlauf nur davon abhängig ist, wie die Karten fallen, ist das auch ausreichend.

source: There are also patience games where you must plan your strategy and think ahead in order to win.
de: Es gibt auch Patiencen, in denen zusätzlich strategisches Planen und Vorausdenken für das Gewinnen notwendig sind.

source: A theme common to all the games is the player must put the cards in a special order &mdash; moving, turning and reordering them.
de: In allen Spielen müssen die Karten durch Auslegen und Ordnen nach einem jeweils festgelegten Schema in eine bestimmte Reihenfolge gebracht werden.

source: How to Play
de: Spielanleitung

source: Objective:
de: Spielziel:

source: Rearrange the cards by suit in as few moves as possible.
de: Die Karten mit möglichst wenigen Zügen nach Farben ordnen.

source: As &kappname; offers you a multiplicity of different solitaire games, there is no straightforward how-to which could fit all of them. Therefore, it is essential that you read each individual subsection of Game Rules, Strategies and Tips section before you start playing a version you are not familiar with.
de: Da &kappname; eine Vielzahl verschiedener Solitär-Spiele anbietet, gibt es keine allgemeingültige Anleitung, die für alle zutrifft. Bei unbekannten Spielarten sollten daher zunächst alle Unterkapitel mit den Spielregeln, -strategien und -tipps gelesen werden.

source: Essentially there are two types of solitaire games – the ones that let you arrange the cards by same color and the ones that let you arrange the cards by alternating color. You can easily determine which game you are trying out using trial-and-error method. Once you know which one you are dealing with the rest is easy; keep arranging and rearranging the cards and collecting the matching ones.
de: Grundsätzlich gibt es zwei Arten Solitärspiele - die bei denen die Karten nach Farben sortiert werden und die bei denen die Farben abwechselnd angeordnet werden müssen. Die Spielart kann durch Ausprobieren leicht herausgefunden werden. Danach müssen die Karten nur noch durch mehrmaliges Umsortieren entsprechend zusammengeführt werden.

source: From the beginning, however, pay attention to your card stacks. Do not rush to move individual cards around. See if it might be more useful elsewhere.
de: Bereits zu Beginn sollte mit den Kartenstapeln Vorsicht walten. Bevor Karten bewegt werden, sollte überlegt werden, ob diese an anderer Stelle vielleicht sinnvoller untergebracht währen.

source: For additional help you can also take quick peeks onto the statusbar. Each of the games has a built in solver which informs you whether the game you are currently playing can be completed or not. If you see that solver could not complete the current game, chances are you will not be able to do so as well. At this point you can either restart the current game, or start a completely new game.
de: Eine weiterer kleiner Hinweis ist, die Statusleiste im Auge zu behalten. Die meisten Spiele haben einen integrierten <emphasis>Löser</emphasis>, der darüber informiert, ob das aktuelle Spiel vollendet werden kann. Zeigt dieser an, dass das Spiel nicht mehr gewonnen werden kann, ist die Lösung unwahrscheinlich. An dieser Stelle kann das aktuelle Spiel neu gestartet oder ein völlig neues Spiel begonnen werden.

source: Note:
de: Hinweis:

source: Playing solitaire games helps you to greatly improve your attention span and enhance the ability to concentrate.
de: Das Spielen von Solitär verbessert die Konzentrationsfähigkeit.

source: Game Rules, Strategies and Tips
de: Spielregeln, Spielstrategien und Tipps

source: General Rules
de: Spielregeln

source: suits
de: Farben

source: A card game contains one or more card decks of 52 cards each. Each deck contains the four suits:
de: Ein Kartenspiel enthält ein oder mehrere Kartenpäckchen mit je 52 Karten. Jedes Kartenpäckchen enthält die vier Farben:

source: Clubs
de: Kreuz

source: Spades
de: Pik

source: Hearts
de: Herz

source: Diamonds
de: Karo

source: Each of these suits contains the following card types: ace, two, three, four, five, six, seven, eight, nine, ten, jack, queen, and king.
de: Jede dieser Farben enthält wiederum die folgenden Werte: Ass, Zwei, Drei, Vier, Fünf, Sechs, Sieben, Acht, Neun, Zehn, Bube, Dame und König.

source: family
de: Familie

source: This complete order of cards is called a family. There are real families and alternating ones. The real families are all of one suit (&eg; Hearts). In the alternating families the card color changes from one to another, between a black color (Clubs and Spades) and a red color (Hearts and Diamonds).
de: Diese komplette Liste von Karten nennt man eine Familie. Es gibt echte Familien und unechte Familien. Die echten Familien sind alle von einer Farbe (z. B. Herz), während in unechten Familien die Farbe zwischen schwarz (Kreuz und Pik) und rot (Herz und Karo) abwechselt.

source: If the family is not complete it is called a sequence.
de: Wenn eine Familie nicht komplett ist, nennt man sie Folge.

source: The game field of &kpatience;
de: Das Spielfeld von &kpatience;

source: There are a number of features found in typical patience games. These are described below.
de: Es gibt einige typische Elemente in einer Patience. Diese sollen im Folgenden vorgestellt werden.

source: At the beginning of each game all cards are mixed in the deck. In some games not all cards are dealt out. The remaining cards are put down on the talon (also called the stock). You can find this quite easily, since in most games it is the only pile in which all cards are face down.
de: Am Anfang eines jeden Spiels werden die Kartenpäckchen gemischt. In einigen Spielen werden nicht alle Karten ausgeteilt und es verbleiben ein paar im <emphasis>Talon</emphasis> (auch <emphasis>Päckchen</emphasis> genannt). Diesen erkennt man in den einzelnen Spielarten meist recht einfach daran, dass er der einzige Stapel ist, der die Rückseite zeigt.

source: 2. Waste Pile
de: 2. Hilfsstapel

source: waste pile
de: Hilfsstapel

source: Many games use a waste pile to hold cards taken from the talon. Typically clicking on the talon will cause the topmost card to be flipped face up and placed on the waste pile, at which point the card enters play.
de: Viele Spielarten verwenden einen Hilfsstapel zur Ablage der Karten, die vom Talon genommen wurden. Typischerweise wird durch Mausklick auf den Talon die oberste Karte mit dem Gesicht nach oben gedreht und auf dem Hilfsstapel gelegt, wodurch die Karte am Spiel teilnimmt.

source: 3. Foundation
de: 3. Ablagestapel

source: foundation
de: Ablagestapel

source: The foundation piles are where you want your cards to end up. Typically, the game is one only once all cards have been moved to the foundation piles in the correct order. The number of foundation piles and the ordering required varies from game to game.
de: Auf den Ablagestapeln werden die Karten endgelagert. Typischerweise ist das Spiel gewonnen sobald alle Karte in der richtigen Reihenfolge auf den Ablagestapeln gelegt sind. Die Anzahl der Ablagestapel sowie die Reihenfolge sind verschieden und bestimmen sich nach der Spielart.

source: Most games start with the foundation piles empty. Choosing the <guimenuitem>Drop</guimenuitem> action from the menu or toolbar will cause &kpatience; to scan through all the piles move as many cards to the foundation piles as it can. If you have the <guimenuitem>Enabled Autodrop</guimenuitem> setting activated, &kpatience; will attempt to perform a drop whenever possible.
de: Die meisten Spiele beginnen mit leeren Ablagestapeln. Durch das Aktivieren von <menuchoice><guimenu>Zug</guimenu><guimenuitem>Ablegen</guimenuitem></menuchoice> oder <guimenuitem>Ablegen</guimenuitem> in der Werkzeugleiste durchsucht &kpatience; alle Stapel und versucht möglichst viele Karten auf den Ablagestapeln abzulegen. Falls <menuchoice><guimenu>Einstellungen</guimenu><guimenuitem>Automatisches Ablegen aktivieren</guimenuitem></menuchoice> aktiviert ist, legt &kpatience; die ablegbaren Karten ständig ab.

source: 4. Playing Piles
de: 4. Spielstapel

source: playing piles
de: Spielstapel

source: These piles are those where the actual reordering happens. The rules for these piles vary a lot between games. Some show all cards on them, some do not. Some allow only one card to be removed, some allow every card to be removed, &etc;
de: Diese Stapel sind der Ort, an dem das eigentliche Neuordnen stattfindet. Die Regeln für diese Stapel sind von Spiel zu Spiel sehr verschieden. Einige zeigen alle Karten auf den <emphasis>Spielstapeln</emphasis>, bei anderen sind manche Karten verdeckt. Einige Spiele erlauben nur, einzelne Karten zu verschieben, bei anderen kann jede Karte verschoben werden &etc;

source: Rules for Individual Games
de: Regeln der einzelnen Spiele

source: Klondike is the most famous patience &mdash; most likely because it comes with a well-known operating system. It is played with one deck.
de: Klondike ist die bekannteste Patience &mdash; wahrscheinlich weil ein sehr bekanntes Betriebssystem diese Patience als Standard mitliefert. Klondike wird mit einem einzelnen Kartenpäckchen gespielt.

source: The goal in Klondike is to put all cards, as real families, ascending on the foundation. This gets easier once all cards are lying face up in the playing piles.
de: Ziel des Spiels ist es, alle Karten als echte Familien aufsteigend auf den Ablagestapeln anzuordnen. Dies gelingt problemlos, sobald alle Karten mit der Vorderseite nach oben im Spielfeld liegen.

source: The sequences on the playing piles have to be put there in descending order. The cards should alternate in colors (red and black). You can move whole sequences or parts of it, if the first card fits on another pile.
de: Die Folgen müssen absteigend angeordnet werden, dabei müssen sich immer schwarze und rote Karten abwechseln. Es können ganze oder Teile von Folgen verschoben werden, wenn die erste Karte auf eine andere Ablage passt.

source: On a free pile you can put a king of any color, or a sequence starting with a king.
de: Auf eine freie Ablage kann jeder beliebige König oder auch jede mit einem König beginnende Folge gelegt werden.

source: When you click on the talon, one card from it will be moved to the waste pile. You can move it to the playing piles or the foundation from there. If the talon is empty, you can move the complete waste pile to the talon by clicking on the empty talon.
de: Mit einem Klick auf den Talon wird eine Karte auf den Hilfsstapel gelegt, von wo aus sie auf die Spielstapel oder die Ablagestapel verschoben werden kann. Ist der Talon leer, wird mit einem weiteren Klick der Hilfsstapel zu einem neuen Talon.

source: You can look through the cards on the talon as much as you like.
de: Die Karten im Talon können beliebig oft durchgeblättert werden.

source: <title>Grandfather</title>
de: <title>Großvater</title>

source: <primary>Grandfather</primary>
de: <primary>Großvater</primary>

source: This game was introduced to &Paul-Olav.Tvete;, the original developer of &kpatience;, by his grandfather; it is named after this. No other patience games are known to implement this patience game variant.
de: Erfinder dieser Spielart ist der Großvater von &Paul-Olav.Tvete;, dem ursprünglichen Entwickler von &kpatience;. Daher erhielt diese Patience ihren Namen. Es sind keine anderen Patience-Pakete bekannt, die dieses Spiel anbieten.

source: In Grandfather, one deck is dealt to seven playing piles. Some cards on each pile are face down on the initial deal.
de: Bei Großvater wird ein Kartenpäckchen auf sieben Spielstapel ausgeteilt. Die Karten der Spielstapel sind nur zum Teil aufgedeckt.

source: The goal is to put all cards as real families ascending on the foundation piles.
de: Ziel ist es, alle Karten als echte Familien aufsteigend auf den Ablagestapeln anzuordnen.

source: You can move every card on every pile if it fits on another card, to build a real sequence of descending order. For example, you can move the five of spades on top of the six of spades, no matter how many cards on are on top of the five of spades. Just the six of spades has to be on top of its pile.
de: Jede Karte kann auf jeden Spielstapel gelegt werden, wenn sich dadurch echte fallende Spielfolgen bilden. So kann &eg; die Pik-Fünf auf eine oben liegende Pik-Sechs gelegt werden, unabhängig davon, wieviele Karten auf der Pik-Fünf liegen.

source: On a free pile you can place a king (again no matter how many cards are on top of it).
de: Auf eine freie Ablage kann ein König gelegt werden (wiederum egal, wieviele Karten auf diesem König liegen).

source: If there are no more possible moves, you can redeal the cards. A redeal consists of picking up the cards from the playing piles (pile by pile, left to right) and redealing them in the starting pattern (zigzagging rows of face down cards forming a peak and then left to right rows of face up cards on top). Note that the cards are <emphasis>not</emphasis> shuffled and that cards on the foundation piles are left untouched. You may redeal no more than twice in a single game.
de: Sobald keine Spielzüge mehr möglich sind, können die Karten erneut gegeben werden. Beim <emphasis>Neu Geben</emphasis> werden die Karten von den Spielstapeln genommen (Stapel für Stapel von links nach rechts) und diese nach dem Anfangsmuster erneut gelegt (eine Spitze bildende Zick-Zack-Reihen bei den verdeckten Karten und von links nach rechts Reihen mit aufgedeckten Karten). Anmerkung: Die Karten werden <emphasis>nicht</emphasis> gemischt und die Karten auf den Ablagestapeln werden nicht angerührt. Das <emphasis>Neu Geben</emphasis> ist nur zweimal in einem Spiel möglich.

source: Even though the rules are simple and allow many moves, the game is still hard to win. Despite this, or because of it, this game remains a joy to play.
de: Auch wenn die Regeln einfach sind und es eine Menge möglicher Züge gibt, geht das Spiel doch recht selten auf. Trotzdem macht es Spaß zu spielen (vielleicht auch gerade deshalb).

source: <title>Aces Up</title>
de: <title>Asse hoch</title>

source: <primary>Aces Up</primary>
de: <primary>Asse hoch</primary>

source: This patience has simple rules, yet is hard to win. It is played with one deck. The goal is to put all cards besides aces onto the foundation. There should be an ace left on every playing pile afterwards.
de: Diese Patience hat einfache Regeln, ist aber schwer zu gewinnen. Sie wird mit einem Kartenpäckchen gespielt. Ziel ist es, alle Karten außer den Assen auf die Ablagestapel zu legen, wobei am Schluss auf jedem Spielstapel ein Ass liegen muss.

source: Each top card that is of the same suit (&eg; spades) and has a lower value than another top card (&eg; six of spades and four of spades) can be put on the foundation by clicking on it.
de: Jede obere Karte, die von geringerem Wert als eine andere obere Karte und von derselben Farbe (&eg; Pik) ist, kann per Klick auf die Ablagestapel gelegt werden.

source: If you cannot move any more cards to the foundation, you can get a new card for each playing pile by clicking on the talon.
de: Können keine weiteren Karten auf die Ablagestapel gelegt werden, wird mit einem Klick auf den Talon auf jeden Spielstapel eine neue Karte gelegt.

source: On a free pile you can move every other card on top of a pile. You should use these moves to free piles. That way, new cards can be moved to the foundation.
de: Bei einem freien Stapel kann jede Karte als Basis verwendet werden. Diese Spielzüge sollten zum Abbau bestehender Stapel dienen. Mit dieser Vorgehensweise können neue Karten auf die Ablagestapel gelegt werden.

source: The auto drop feature is disabled in this patience game.
de: Das automatische Ablegen von Karten ist bei dieser Patience nicht verfügbar.

source: Freecell is played with one card deck. You have four free cells in the top left corner. In addition there are four foundation piles, and eight playing piles below.
de: Freecell wird mit einem Kartenpäckchen gespielt. Das Spielfeld besteht aus vier freien Zellen (links oben), den vier Ablagestapeln (rechts oben) und den acht Spielstapeln.

source: The goal of the game is to have all cards as real families ascending on the foundation. You can achieve this often if you know how to play: Freecell is solvable at a rate of 99.9% approximately &mdash; of the first 32,000 deals there is only one unsolvable (11,982 if you want to know).
de: Ziel ist es, alle Karten als echte Familien aufsteigend auf den Ablagestapeln anzuordnen. Dies gelingt sehr oft, da Freecell zu ca. 99,9 % lösbar ist (von den ersten 32000 Spielen ist nur die Nummer 11982 unlösbar).

source: In the playing piles you have to build descending sequences, where red and black cards alternate. You can put any card in a free cell.
de: In den Spielstapeln müssen die Spielfolgen fallend, mit roten und schwarzen Karten im Wechsel, angeordnet werden. In eine freie Zelle kann nur eine einzige Karte gelegt werden.

source: You can only move one card that lays on top of a pile or a free cell. Sequences can only be moved if you have enough free space (either free cells or free playing piles) to place the cards.
de: Bei einem Spielzug darf immer nur eine oben liegende Karte verschoben werden. Sequenzen oder Teile von Sequenzen können nur verschoben werden, wenn genügend freie Zellen und/oder freie Spielstapel vorhanden sind. Dabei kann jede beliebige Karte auf eine freie Position gelegt werden.

source: The maximum amount of cards you can move is calculated by:
de: Die maximale Anzahl der verschiebbaren Karten berechnet sich wie folgt:

source: (#{free cells} + 1) * 2<superscript>#{free piles}</superscript>
de: (#{freie Zellen} + 1) * 2<superscript>#{freie Spielstapel}</superscript>

source: To solve this game it is recommended to grab the cards out of the playing sequences in the same order they have to be put into the foundation (first the aces, then the twos, &etc;)
de: Zur Lösung dieses Spiels sollten die Karten in derjenigen Reihenfolge <emphasis>freigelegt</emphasis> werden, in der sie auf die Ablagestapel gelegt werden können. (zuerst die Asse, dann die Zweier, &etc;)

source: You should try to keep as many free cells and/or playing piles empty, so you can build sequences as long as possible.
de: Dabei sollten so viele freie Zellen und/oder Ablagen frei gehalten werden, dass möglichst lange Folgen gebaut und verschoben werden können.

source: Mod3 is played with two card decks. The goal is to put all cards on the top three rows. In those you have to build sequences of the same color. In the first row you have to create the sequence 2-5-8-J, in the second row the sequence 3-6-9-Q, and in the third row the sequence 4-7-10-K. The suit of the cards must be the same in each sequence, so you can only put a five of hearts on top of a two of hearts.
de: Mod3 wird mit zwei Kartenpäckchen ohne Asse gespielt. Ziel ist es, alle Karten in den drei oberen Reihen anzuordnen. In der ersten Reihe sollen echte Abfolgen der Form 2-5-8-B, in der zweiten Reihe der Form 3-6-9-D und in der dritten Reihe der Form 4-7-10-K angeordnet werden. Hier ist die Farbe der Karte wichtig, so kann beispielsweise auf eine Herz-Zwei nur eine Herz-Fünf gelegt werden.

source: The fourth row is both your waste pile and playing pile. On an empty slot you can put any card from the first three rows, or one from the top of the fourth row.
de: Die vierte Reihe ist gleichzeitig Hilfs- und Spielstapel. Auf einen leeren Spielstapel kann eine beliebige Karte aus den oberen drei Reihen oder die oberste Karte der vierten Reihe gelegt werden.

source: You can put aces on the aces piles, on top of the talon. They are in the game so you have a starting point for creating free slots.
de: Asse können auf den Ass-Stapel oberhalb des Talon gelegt werden. Dadurch können Plätze frei gemacht werden.

source: If you cannot move any more cards, you can get new cards on the fourth row by clicking on the talon.
de: Können keine weiteren Karten verschoben werden, ergeben sich neue Möglichkeiten durch einen Klick auf den Talon. Dadurch wird auf jeden Spielstapel eine neue Karte gelegt.

source: <title>Gypsy</title>
de: <title>Zigeuner</title>

source: <primary>Gypsy</primary>
de: <primary>Zigeuner</primary>

source: Gypsy is played with two card decks. The aim is to put all cards in real families ascending on the foundation.
de: Zigeuner wird mit zwei Kartenpäckchen gespielt. Ziel des Spiels ist es, alle Karten als echte Familien aufsteigend auf den Ablagestapeln anzuordnen.

source: The playing piles have to be descending, while red and black cards have to alternate. You can only move sequences or single cards. On a free slot you can put any card or sequence.
de: Die Spielfolgen müssen fallend angeordnet werden, wobei sich immer schwarze und rote Karten abwechseln. Es können nur Sequenzen oder einzelne Karten verschoben werden. Auf einen freien Spielstapel kann jede beliebige Karte oder Sequenz gelegt werden.

source: If you cannot move any more cards, you can click on the talon to get new cards on each playing pile.
de: Können keine weiteren Karten verschoben werden, ergeben sich neue Möglichkeiten durch einen Klick auf den Talon. Dadurch wird auf jeden Spielstapel eine neue Karte gelegt.

source: In using the <guibutton>Undo</guibutton> feature you can ease the game quite a lot, as you have to take many decisions and some of them might turn out to be wrong after you clicked the talon.
de: Das häufige Verwenden der Funktion <guibutton>Zurücknehmen</guibutton> ermöglicht ein leichteres Gewinnen des Spiels. Dadurch können die Auswirkungen einer Entscheidung zunächst beobachtet und möglicherweise eine andere Entscheidungen getroffen werden.

source: <title>Forty &amp; Eight</title>
de: <title>Vierzig &amp; Acht</title>

source: <primary>Forty &amp; Eight</primary>
de: <primary>Vierzig &amp; Acht</primary>

source: Forty &amp; Eight is played with two card decks. The goal is to put all cards as real families on the foundation.
de: Vierzig &amp; Acht wird mit zwei Kartenpäckchen gespielt. Ziel des Spiels ist es, alle Karten als echte Familien aufsteigend auf den Ablagestapeln anzuordnen.

source: The playing piles have to be descending. Colors are important. You can only put a five of hearts on a six of hearts, for example.
de: Die Spielstapel müssen fallend angeordnet werden, wobei nur Herz auf Herz, Pik auf Pik, usw. gelegt werden darf.
