Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdegames/kpat.po
Languages: de

source: You can only move one card on top of a pile. You can put any card in a free slot.
de: Es kann nur eine oben liegende Karte pro Spielzug bewegt werden. Auf einer freien Ablage lässt sich jede beliebige Karte ablegen.

source: By clicking on the talon you can put a card on the waste pile; from there you can put it on a playing pile or the foundation (&kpatience; will do this for you). If the talon is empty you can put all cards on the waste pile back on the talon. This works only once: after the second time the talon empties, the game is over.
de: Mit einem Klick auf den Talon wird eine Karte auf den Hilfsstapel gelegt, von wo aus sie auf die Spiel- oder Ablagestapel verschoben werden kann (letzteres übernimmt &kpatience;). Ist der Talon leer, wird mit einem weiteren Klick der Hilfsstapel zu einem neuen Talon. Jedoch kann der Talon nur zweimal durchgesehen werden.

source: This patience is difficult to solve. With some experience you can solve many of the deals, especially if you use the <guibutton>Undo</guibutton> feature from time to time to correct your decisions, and the decisions &kpatience; makes in putting cards on the foundation.
de: Diese Patience ist nicht einfach zu lösen, aber mit ein wenig Erfahrung wird das Gewinnen vieler Spiele möglich. Dabei bietet sich vor allem das häufigere Verwenden der <guibutton>Zurücknehmen</guibutton>-Funktion an, um Entscheidungen im Spielverlauf zu berichtigen. Dies gilt auch für den Fall, dass &kpatience; eine Karte automatisch auf einen Ablagestapel legt.

source: <title>Simple Simon</title>
de: <title>Einfach Simon</title>

source: <primary>Simple Simon</primary>
de: <primary>Einfach Simon</primary>

source: Simple Simon is played with one card deck. The goal is to put all cards as real families on the foundation.
de: Einfach Simon wird mit einem Kartenpäckchen gespielt. Ziel des Spiels ist es, alle Karten als echte Familien aufsteigend auf den Ablagestapeln anzuordnen.

source: In the playing piles you can build sequences. In general you don't have to care about the suits of the cards, but sequences can only be moved if they are part of a real sequence. For example, you can move the six of spades if the five of <emphasis>spades</emphasis> is on top of it, but may not move it if the five of <emphasis>clubs</emphasis> is on top of it.
de: Auf den Ablagestapeln können echte und unechte, fallende Sequenzen gebildet werden. Mehrere Karten lassen sich nur dann bewegen, wenn sie Mitglied einer echten Familie sind. So kann beispielsweise die Pik-Sechs verschoben werden, wenn die <emphasis>Pik</emphasis>-Fünf auf ihr liegt, aber nicht, wenn es die <emphasis>Herz</emphasis>-Fünf ist.

source: The cards can only be moved to the foundation if all 13 cards of one family lay on top of each other in the playing piles.
de: Die Karten werden nur auf die Ablagestapel gelegt, wenn alle 13 Karten einer Farbe im Spielfeld als echte fallende Familie angeordnet wurden.

source: Suggestion
de: Hinweis

source: You should try as soon as possible to move the cards to the correct piles, to create free piles to place cards on temporarily, since you can put any card on those.
de: Es empfiehlt sich möglichst früh Karten auf die richtigen Spielstapel zu verschieben, um freie Spielstapel zu schaffen. Auf einen freien Spielstapel kann jede Karte oder Sequenz gelegt werden.

source: With enough free room you can build families on free slots independently of the color. If you have all cards in such families you can sort them by color, so they can be moved to the foundation.
de: Mit ausreichend Platz kann begonnen werden, fallende Familien auf einen freien Spielstapel zu legen. Sind alle Karten so angeordnet, können sie anschließend der Farbe nach sortiert werden.

source: Yukon is played with one card deck. The goal is to put all cards as real families ascending on the foundation.
de: Yukon wird mit einem Kartenpäckchen gespielt. Ziel des Spiels ist es, alle Karten als echte Familien aufsteigend auf den Ablagestapeln anzuordnen.

source: The sequences on the playing piles have to be descending with alternating red and black cards. You can move every face up card no matter how many cards are on top of it. So you can put a five of hearts on a six of spades if that one is on top of its pile.
de: Die Spielfolgen müssen fallend angeordnet werden, wobei sich immer schwarze und rote Karten abwechseln. Jede aufgedeckte Karte kann bewegt werden. So kann beispielsweise die Herz-Fünf auf eine oben liegende Pik-Sechs gelegt werden, unabhängig davon, wieviele Karten unter der Pik-Sechs liegen.

source: In a free slot you can put a king of any color (again, no matter how many cards are on top of it).
de: Auf einen freien Spielstapel kann ein König jeder beliebigen Farbe gelegt werden (auf diesem können beliebig viele Karten liegen).

source: Grandfather's Clock
de: Großvaters Uhr

source: Grandfathers Clock
de: Großvaters Uhr

source: Grandfather's clock is a simple patience game. With some experience you should be able to solve most deals. It is played with one card deck. The aim is to put the cards as real ascending sequences on the foundation.
de: Großvaters Uhr ist eine einfache Patience und mit ein bisschen Erfahrung sollte fast jedes Spiel lösbar sein. Diese Patience wird mit einem Kartenpäckchen gespielt. Ziel des Spiels ist es, alle Karten als echte Familien aufsteigend auf den Ablagestapeln anzuordnen.

source: The foundation is on the right-hand side and consists of 12 piles that form the shape of a clock. The nine is at 12 o'clock, the queen is at 3 o'clock, the three is at 6 o'clock and the six is at 9 o'clock.
de: Die zwölf Ablagestapel befinden sich auf der rechten Seite und bilden die Form einer Uhr. Dabei befinden sich die Neun auf 12 Uhr, die Dame auf 3 Uhr, die Drei auf 6 Uhr und die Sechs auf 9 Uhr.

source: There are 8 playing piles beside the clock and on each are 5 cards. On the playing piles you can build descending sequences. The color of the cards is not important. You can only move one card at a time.
de: Die acht Spielstapel bestehen aus je fünf Karten. Auf diesen können die Karten als fallende Sequenzen angeordnet werden, wobei die Farbe unberücksichtigt bleibt. Bei jedem Spielzug kann nur eine Karte bewegt werden.

source: Golf is played with one card deck. The goal of Golf is to move all the cards on the tableau to the foundation.
de: Golf wird mit einem Kartenpäckchen gespielt. Ziel des Spiels ist es, alle Karten als echte Familien aufsteigend auf den Ablagestapeln anzuordnen.

source: The layout of golf solitaire is straightforward. At the beginning of the game you will see the tableau. On it are seven columns each containing five cards. The talon and the foundation are below.
de: Der Aufbau des Spielfeldes von Golf-Solitär ist ziemlich geradlinig. Am Anfang des Spiels ist das Spielfeld und darauf sieben Spalten mit je fünf Karten sichtbar. Darunter befinden sich der Talon und die Ablagestapel.

source: Playing golf solitaire is simple, but requires strategy to win. The cards at the base of each column on the tableau are available for play. Available cards are built upon the top foundation card in ascending or descending sequence regardless of suit. If there are no moves available a card may be dealt from the talon to the foundation. The game is over when all the cards in the talon have been dealt and there are no more possible moves.
de: Golf-Solitär ist einfach zu spielen, erfordert aber eine Strategie, um zu gewinnen. Die Karten oben auf jedem Kartenstapel des Spielfeldes können gespielt werden. Die erreichbaren Karten werden auf der obersten Karte der Ablagestapel in auf- oder absteigender Reihenfolge abgelegt, wobei die Farbe unberücksichtigt bleibt. Sind keine Spielzüge mehr möglich, kann eine Karte vom Talon auf die Ablagestapel gelegt werden. Das Spiel ist beendet, wenn alle Karten vom Talon gespielt wurden und keine anderen Spielzüge mehr möglich sind.

source: Spider is played with two card decks. The cards are dealt out into 10 playing piles, 4 of 6 cards and 6 of 5 cards each. This leaves 50 cards that can be dealt out 10 at a time, one on each playing pile.
de: Spider wird mit zwei Kartenpäckchen gespielt. Zu Beginn werden 10 Spielstapel gebildet, 4 mit 6 Karten und 6 mit 5 Karten. Bei jedem Klicken auf den Talon werden von den restlichen 50 Karten jeweils 10 Karten gleichzeitig auf die zehn Spielstapel verteilt.

source: In the playing piles, a card can be placed on another card of any suit and of one higher value. A sequence of descending cards of the same suit may be moved from one playing pile to another.
de: Auf den Spielstapeln darf eine Karte auf eine andere Karte beliebiger Farbe gelegt werden, deren Wert um eins höher ist. Eine Folge absteigender Karten der gleichen Farbe darf in einem Zug von einem Spielstapel auf einen anderen verschoben werden.

source: The goal of spider is to put all cards as real families descending from Kings anywhere in the playing piles. When such a family is built in a playing pile, it is removed to the lower-left corner of the window.
de: Das Ziel von Spider ist, alle Karten entsprechend ihrer Familie absteigend vom König aus irgendwo in den Spielstapeln zu platzieren. Eine vollständige Familie wird von den Spielstapeln entfernt und links unten im Fenster abgelegt.

source: The different levels determine how many suits are dealt - Easy uses 1 suit, Medium uses 2 suits, and Hard uses all 4 suits. The game is fairly easy to win at Easy level, and very difficult to win at Hard level.
de: Die verschiedenen Spielstufen unterscheiden sich in der Anzahl der ausgeteilten Farben. Leicht verwendet eine Farbe, mittel zwei und schwer verwendet alle vier Farben. In der leichten Stufe ist das Spiel einfach zu gewinnen, in der schweren Spielstufe sehr schwierig.

source: Interface Overview
de: Benutzeroberfläche

source: The Game Menu
de: Das Menü Spiel

source: <shortcut><keycombo action="simul">&Ctrl;&Shift;<keycap>N</keycap></keycombo></shortcut> <guimenu>Game</guimenu> <guimenuitem>New Game...</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;&Shift;<keycap>N</keycap></keycombo></shortcut><guimenu>Spiel</guimenu><guimenuitem>Neues Spiel ...</guimenuitem>

source: <action>Return to the game selection screen.</action> This action abandons the deal in progress.
de: <action>Rückkehr zur Spielauswahl.</action> Mit dieser Aktion wird das laufende Spiel verworfen.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo></shortcut> <guimenu>Game</guimenu> <guimenuitem>New Deal</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo></shortcut><guimenu>Spiel</guimenu><guimenuitem>Neue Karten</guimenuitem>

source: <action>Start a new deal of the same game type.</action> This action abandons the deal in progress.
de: <action>Eine neue Partie des selben Spiels wird gestartet.</action> Mit dieser Aktion wird das laufende Spiel verworfen.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>D</keycap></keycombo></shortcut> <guimenu>Game</guimenu> <guimenuitem>New Numbered Deal...</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>D</keycap></keycombo></shortcut><guimenu>Spiel</guimenu><guimenuitem>Neue Spielnummer ...</guimenuitem>

source: <action>Start a new deal by specifying the game type and deal number.</action> This action abandons the deal in progress.
de: <action>Eine neue Partie mit einer bestimmten Spielnummer und Spielart wird gestartet.</action> Mit dieser Aktion wird das laufende Spiel verworfen.

source: &kpatience; gives each deal a unique indentifying number (which it uses internally to randomize the deck during the initial deal). This feature allows you to replay a deal of interest or to attempt a particularly difficult deal recommended by a friend. Especially dedicated players may wish to "beat" &kpatience; by playing all 2147483647 deals consecutively for each of the game types.
de: &kpatience; vergibt an jede Partie eine einzigartige Identifikationsnummer (und verwendet diese intern zur zufälligen Auswahl der Karten). Dadurch kann jede interessante Partie nochmals gewählt und gespielt werden. Besonders ehrgeizige Spieler möchten möglicherweise alle 2.147.483.647 Partien in alle Spielarten spielen und dabei &kpatience; <emphasis>schlagen.</emphasis>

source: Note that for Freecell, &kpatience;'s deal numbers match those described in <ulink url="http://www.solitairelaboratory.com/fcfaq.html">the Freecell FAQ</ulink>.
de: Zu beachten ist, dass alle Nummern der Freecell-Partien in &kpatience; mit denen der <ulink url="http://www.solitairelaboratory.com/fcfaq.html">Häufig gestellten Fragen</ulink> von Freecell übereinstimmen.

source: <shortcut><keycap>F5</keycap></shortcut> <guimenu>Game</guimenu> <guimenuitem>Restart Deal</guimenuitem>
de: <shortcut><keycap>F5</keycap></shortcut><guimenu>Spiel</guimenu><guimenuitem>Spiel neu starten</guimenuitem>

source: Return the current game to its initially dealt condition.
de: Das aktuelle Spiel wird in den Anfangszustand zurückgesetzt.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>O</keycap></keycombo></shortcut> <guimenu>Game</guimenu> <guimenuitem>Load...</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>O</keycap></keycombo></shortcut><guimenu>Spiel</guimenu><guimenuitem>Laden ...</guimenuitem>

source: <action>Load a saved game.</action> This action abandons the deal in progress.
de: <action>Ein gespeichertes Spiel wird geladen.</action> Mit dieser Aktion wird das laufende Spiel verworfen.

source: <guimenu>Game</guimenu> <guisubmenu>Load Recent</guisubmenu> <guimenuitem>List of recently accessed files.</guimenuitem>
de: <guimenu>Spiel</guimenu><guisubmenu>Zuletzt geöffnete Spiele</guisubmenu><guimenuitem>Liste der zuletzt geöffneten Spiele</guimenuitem>

source: <action>List recently accessed save files in order of last use.</action> Selecting a game will load it. This action abandons the deal in progress.
de: <action>Die zuletzt gespielten und gespeicherten Spiele in der Reihenfolge der letzten Verwendung werden angezeigt.</action> Durch Auswahl eines Eintrags wird das entsprechende Spiel geladen. Mit dieser Aktion wird das laufende Spiel verworfen.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>S</keycap></keycombo></shortcut> <guimenu>Game</guimenu> <guimenuitem>Save As...</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>S</keycap></keycombo></shortcut><guimenu>Spiel</guimenu><guimenuitem>Speichern unter ...</guimenuitem>

source: Save the current game to disk.
de: Das aktuelle Spiel wird nach Angabe eines Dateinamens auf der Festplatte gespeichert.

source: <guimenu>Game</guimenu> <guimenuitem>Statistics</guimenuitem>
de: <guimenu>Spiel</guimenu><guimenuitem>Statistik</guimenuitem>

source: Display various statistics about your performance broken down by game type.
de: Die Statistiken zu den verschiedenen Spielarten werden angezeigt.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo></shortcut> <guimenu>Game</guimenu> <guimenuitem>Quit</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo></shortcut><guimenu>Spiel</guimenu><guimenuitem>Beenden</guimenuitem>

source: <action>Quit</action> &kappname;.
de: &kappname; wird <action>beendet</action>.

source: The Move Menu
de: Das Menü Zug

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>Z</keycap></keycombo></shortcut> <guimenu>Move</guimenu> <guimenuitem>Undo</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>Z</keycap></keycombo></shortcut><guimenu>Zug</guimenu><guimenuitem>Zurücknehmen</guimenuitem>

source: <action>Undo</action> your last move.
de: Der letzte Spielzug wird <action>zurückgenommen</action>.

source: <shortcut><keycombo action="simul">&Ctrl;&Shift;<keycap>Z</keycap></keycombo></shortcut> <guimenu>Move</guimenu> <guimenuitem>Redo</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;&Shift;<keycap>Z</keycap></keycombo></shortcut><guimenu>Zug</guimenu><guimenuitem>Wiederherstellen</guimenuitem>

source: <action>Redo</action> the move that was just undone by <guimenuitem>Undo</guimenuitem>.
de: Der zurückgenommene Spielzug wird <action>wiederhergestellt</action>.

source: <shortcut><keycap>H</keycap></shortcut> <guimenu>Move</guimenu> <guimenuitem>Hint</guimenuitem>
de: <shortcut><keycap>H</keycap></shortcut><guimenu>Zug</guimenu><guimenuitem>Tipp</guimenuitem>

source: Provide some hints as to possible moves, should the player become stuck. Cards that can be legally moved to another pile are temporarily highlighted.
de: Tipps zu möglichen Spielzüge werden gegeben (sofern der Spieler nicht mehr weiter weiß). Dabei werden vorübergehend Karten angezeigt, die gespielt werden können.

source: <shortcut><keycap>D</keycap></shortcut> <guimenu>Move</guimenu> <guimenuitem>Demo</guimenuitem>
de: <shortcut><keycap>D</keycap></shortcut><guimenu>Zug</guimenu><guimenuitem>Demomodus</guimenuitem>

source: <action>Start the demo mode.</action> While in demo mode, &kpatience; attempts to solve the deal for you. Activate this action a second time to exit demo mode.
de: <action>Der Demomodus wird gestartet.</action> Im Demomodus versucht &kpatience; eine Partie und verdeutlicht damit den Spielablauf. Eine nochmalige Auswahl des Demomodus beendet diesen wieder.

source: <shortcut><keycap>Space</keycap></shortcut> <guimenu>Move</guimenu> <guimenuitem>Draw</guimenuitem>
de: <shortcut><keycap>Leertaste</keycap></shortcut><guimenu>Zug</guimenu><guimenuitem>Ziehen</guimenuitem>

source: <action>Flip one of more cards from the talon and move them to the waste pile.</action> This action is available in only certain games.
de: <action>Eine Karte wird vom Talon genommen und auf den Hilfsstapel gelegt.</action> Diese Aktion ist nur in bestimmten Spielarten verfügbar.

source: <shortcut><keycap>Return</keycap></shortcut> <guimenu>Move</guimenu> <guimenuitem>Deal Row</guimenuitem>
de: <shortcut><keycap>Eingabe</keycap></shortcut><guimenu>Zug</guimenu><guimenuitem>Reihe geben</guimenuitem>

source: <action>Flip several cards from the talon and place one on each playing pile.</action> This action is available in only certain games.
de: <action>Mehrere Karten werden vom Talon genommen und jeweils eine auf jeden Spielstapel gelegt.</action> diese Aktion ist nur in bestimmten Spielarten verfügbar.

source: <shortcut><keycap>R</keycap></shortcut> <guimenu>Move</guimenu> <guimenuitem>Redeal</guimenuitem>
de: <shortcut><keycap>R</keycap></shortcut><guimenu>Zug</guimenu><guimenuitem>Neu geben</guimenuitem>

source: <action>Collect all the card left in play and redeal them without shuffling.</action> This action is available in only certain games.
de: <action>Alle Karten auf den Spielstapeln werden eingesammelt, gemischt und neu ausgegeben.</action> Diese Aktion ist nur in bestimmten Spielarten verfügbar.

source: The Settings Menu
de: Das Menü Einstellungen

source: <guimenu>Settings</guimenu> <guisubmenu>"Game Type" Options</guisubmenu> <guimenuitem>List of game type specific options.</guimenuitem>
de: <guimenu>Einstellungen</guimenu><guisubmenu>„Spielart“-Einstellungen</guisubmenu><guimenuitem>Spezifische Einstellungsmöglichkeiten</guimenuitem>

source: <action>List options specific to the current game type.</action> This menu is available in only certain games (Klondike and Spider).
de: <action>Die spezifischen Einstellungsmöglichkeiten für die aktuelle Spielart werden angezeigt.</action> Dieses Menü ist nur in den Spielarten Klondike und Spider verfügbar.

source: <shortcut><keycap>F10</keycap></shortcut> <guimenu>Settings</guimenu> <guimenuitem>Change Appearance...</guimenuitem>
de: <shortcut><keycap>F10</keycap></shortcut><guimenu>Einstellungen</guimenu><guimenuitem>Erscheinungsbild ändern ...</guimenuitem>

source: Open a dialog to change the card deck and game theme used.
de: Ein Dialog zum Ändern des verwendeten Blatt- und Spieldesigns wird geöffnet.

source: <guimenu>Settings</guimenu> <guimenuitem>Enable Autodrop</guimenuitem>
de: <guimenu>Einstellungen</guimenu><guimenuitem>Automatisches Ablegen aktivieren</guimenuitem>

source: Enable automatically moving cards to the foundation piles when possible.
de: Ist diese Einstellung aktiviert, werden die Karten automatisch auf den Ablagestapel verschoben (soweit möglich).

source: <guimenu>Settings</guimenu> <guimenuitem>Enable Solver</guimenuitem>
de: <guimenu>Einstellungen</guimenu><guimenuitem>Löser aktivieren</guimenuitem>

source: <action>Enable the automatic solving engine.</action> When enabled, the solver will constantly try to determine whether the current game state is winnable. You may wish to disable the solver to conserve processor or battery usage.
de: <action>Das automatische Löser-Modul wird aktiviert.</action> Ist diese Einstellung aktiviert, versucht der Löser ständig herauszufinden, ob das Spiel beim aktuellen Spielstand gewonnen werden kann. Zum Schonen des Prozessors oder der Batterie sollte der Löser deaktiviert werden.

source: <guimenu>Settings</guimenu> <guimenuitem>Remember State on Exit</guimenuitem>
de: <guimenu>Einstellungen</guimenu><guimenuitem>Spielstand beim Beenden merken</guimenuitem>

source: <action>Enable automatic saving of the game state when &kpatience; is shut down.</action> If enabled, &kpatience; will load the previous game state automatically the next time it is started.
de: <action>Das automatische Speichern des Spielstandes beim Beenden von &kpatience; wird aktiviert.</action> Ist diese Einstellung aktiviert, lädt &kpatience; den letzten Spielstand beim nächsten Aufruf automatisch.

source: <guimenu>Settings</guimenu> <guimenuitem>Show Toolbar</guimenuitem>
de: <guimenu>Einstellungen</guimenu><guimenuitem>Werkzeugleiste anzeigen</guimenuitem>

source: Show or hide the toolbar.
de: Die Werkzeugleiste wird angezeigt oder ausgeblendet.

source: <guimenu>Settings</guimenu> <guimenuitem>Show Statusbar</guimenuitem>
de: <guimenu>Einstellungen</guimenu><guimenuitem>Statusleiste anzeigen</guimenuitem>

source: Show or hide the statusbar.
de: Die Statusleiste wird angezeigt oder ausgeblendet.

source: The Help Menu
de: Das Menü Hilfe

source: Frequently asked questions
de: Häufig gestellte Fragen

source: I want to change the way this game looks. Can I?
de: Kann das Erscheinungsbild des Spiels geändert werden?

source: You can change the faces and backs of the playing cards and the game theme. To do so please use <menuchoice> <shortcut><keycap>F10</keycap></shortcut> <guimenu>Settings</guimenu> <guimenuitem>Change Appearance...</guimenuitem> </menuchoice> on the menubar.
de: Die Vorder- und Rückseite des Kartenblatts sowie das Design können geändert werden. Dazu wird in der Menüleiste <menuchoice> <shortcut><keycap>F10</keycap></shortcut><guimenu>Einstellungen</guimenu><guimenuitem>Erscheinungsbild ändern ...</guimenuitem></menuchoice> ausgewählt.

source: Can I use the keyboard to play the game?
de: Kann mit der Tastatur gespielt werden?

source: No, &kappname; features no keyboard only play. However, most menu options do have keyboard shortcuts.
de: Nein, &kappname; kann nicht ausschließlich mit der Tastatur gespielt werden. Jedoch haben die meisten Menüeinträge entsprechende Tastenkürzel.

source: Even with hints I still have no clue how to play. Help!
de: Die Tipps tragen nicht zur Lösung des Spiels bei. Gibt es noch weitere Hilfen?
