Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdegames/ksirk_ksirkskineditor.po
Languages: de

source: The &kappname; Handbook
de: Das Handbuch zu <application>KsirK-Design-Editor</application>

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Johannes</firstname><surname>Obermayr</surname><affiliation><address><email>johannesobermayr@gmx.de</email></address></affiliation><contrib>Übersetzung</contrib></othercredit>

source: &ksirk; is a computerized version of a well known strategy game. It is fully skinable. This manual explains how to create new skins from scratch, using a file browser, a SVG image editor and &kappname;.
de: &ksirk; ist eine computergestützte Version eines sehr bekannten Strategiespiels und kann vollständig neue Designs erhalten. Dieses Handbuch beschreibt die Erstellung neuer Designs von Grund auf (unter Verwendung eines Dateimanagers, <filename>.svg</filename>-Bearbeitungsprogramms und <application>KsirK-Design-Editor</application>).

source: kdegames
de: KDE-Spiele

source: game
de: Spiel

source: strategy
de: Strategie

source: Risk
de: Risiko

source: free
de: Frei

source: skin
de: Design

source: Introduction
de: Einführung

source: Here's a screenshot of &kappname;
de: Bildschirmfoto von <application>KsirK-Design-Editor</application>

source: Screenshot
de: Bildschirmfoto

source: There is three main steps to create a new skin: creating the folders hierarchy; creating the graphics, all pooled inside a SVG file; and then placing sprites and naming things using &kappname;.
de: Es sind drei Schritte für die Erstellung eines neuen Designs notwendig: Erstellen der Ordnerstruktur, Erstellung der Grafiken (zusammengefasst in einer <filename>.svg</filename>-Datei) und schließlich das Platzieren der Animationen und Benennen der Elemente mit <application>KsirK-Design-Editor</application>.

source: Creating a &ksirk; skin
de: Neues &ksirk;-Design erstellen

source: &ksirk; is fully skinable. For who have graphic capabilities, creating a new skin is as simple as copying an existing one, editing or changing the graphics and updating the data in a .desktop configuration file, which is done using the &kappname;. A last step is to edit the file describing what to install.
de: Für &ksirk; können komplett neue Designs erstellt werden. Für künstlerisch Veranlagte ist das Erstellen neuer Designs so einfach wie das Kopieren, Bearbeiten oder Austauschen bestehender Grafiken und das Aktualisieren der Daten in der <filename>.desktop</filename>-Einrichtungsdatei, wozu <application>KsirK-Design-Editor</application> dient. Ein letzter Schritt ist das Bearbeiten der Installationsdatei.

source: All examples (text and images) are taken from the default skin of &ksirk;
de: Alle Beispiele (Text und Bilder) sind vom Standard-Design von &ksirk;.

source: Structure of folders and files
de: Struktur der Ordner und Dateien

source: Data/ : Data used by the program to handle the images of the skin.
de: Data/: Daten zur Einbindung der Bilder des Designs.

source: CMakeLists.txt : Describes what to install.
de: <filename>CMakeLists.txt</filename>: Beschreibung der Installationsabläufe.

source: onu.desktop : Main file for the description of the skin. See its description below.
de: <filename>world.desktop</filename>: Die Beschreibung des Designs. Der Aufbau wird später geschildert.

source: Images/ : The images of the skin (map, sprites, etc.)
de: Images/: Die Bilder des Designs (Karte, Animationen, ...)

source: pool.svg : the map and all the sprites used in this skin.
de: <filename>pool.svg</filename>: Die Karte und Animationen des Designs.

source: map-mask.png : the image allowing the program to find which country the mouse is over during the game (see below).
de: <filename>map-mask.png</filename>: Dieses Bild ermöglicht es dem Programm während es Spiels das richtige Land zu finden, wenn sich der Mauszeiger darüber befindet (Erklärung erfolgt später).

source: *.png : the other images here are buttons images.
de: <filename>*.png</filename>: Diese Bilder sind für die Knöpfe.

source: CMakeLists.txt/ : Describes what to install.
de: <filename>CMakeLists.txt/</filename>: Beschreibung der Installationsabläufe.

source: Sounds/ : sound files for the skin.
de: Sounds/: Die Klänge des Designs.

source: The Data folder
de: Data/

source: This folder contains only one file, world.desktop. This file is a description of the content of the skin. It is used to describe the organization of the world and how to display it. You don't have to fill it manualy as it will be handled by the &kappname;. But, for the sake of completeness, we will now describe its structure.
de: Dieser Ordner enthält nur eine Datei (<filename>world.desktop</filename>). Sie ist eine Beschreibung für den Inhalt des Designs und wird zur Beschreibung des Aufbaus und der Anzeige der Welt verwendet. Sie muss nicht eigenhändisch aufgebaut werden, sondern wird von <application>KsirK-Design-Editor</application> automatisch erstellt. Für die Vollständigkeit wird der folgende Strukturaufbau vorgestellt:

source: An onu group contains a number of country entries, a number of nationality entries and lastly a number of continent entries. Then various groups contain the description of the different sprites, the description of the different countries, continents, nationalities and goals.
de: Unter [onu] sind die grundsätzlichen Einträge für die Länder, Nationen und Kontinente definiert. Die verschiedenen anderen Gruppen enthalten die Beschreibung der Animationen, Länder, Kontinente, Nationen und Spielziele.

source: The following sections describe the content of each group.
de: Die folgenden Abschnitte beschreiben den Inhalt jeder Gruppe.

source: The onu group
de: [onu]

source: The onu group entries
de: Aufbau von [onu]

source: Entry name
de: Eintrag

source: Signification
de: Bedeutung

source: The width of the skin's map
de: Die Breite der Karte (in px).

source: The height of the skin's map
de: Die Höhe der Karte (in px).

source: The path of the skin relative to the application data path (e.g. skins/default)
de: Der Pfad zum Design - relativ zum Programm - (z. B. skins/default).

source: The number of countries (42 in the default skin). There should be the same number of country groups below
de: Die Anzahl der Länder (42 im standardmäßigen Design). Es müssen alle Länder definiert werden.

source: The number of nationalities (6 in the default skin). There should be the same number of nationality groups below
de: Die Anzahl der Nationen (6 im standardmäßigen Design). Es müssen alle Nationen definiert werden.

source: The number of continents (6 in the default skin). There should be the same number of continent groups below
de: Die Anzahl der Kontinente (6 im standardmäßigen Design). Es müssen gleich viele continent-Gruppen erstellt werden.

source: The path and name of the pool file relative to the skin path (e.g. Images/pool.svg)
de: Der Pfad und Name der zusammengefassten Datei - relativ zum Design (z. B. Images/pool.svg).

source: The path and name of the map mask file relative to the skin path (e.g. Images/map-mask.png)
de: Der Pfad und Name der Datei map-mask - relativ zum Design (z B. Images/map-mask.png).

source: The version of the skin file format (2.0)
de: Die Version der Design-Datei (2.0)

source: The display name of the skin
de: Der angezeigte Name für das Design.

source: The long description of the skin
de: Die ausführliche Beschreibung des Designs.

source: The height difference between flags and cannons sprites
de: Der Höhenunterschied zwischen den Animationen der Flaggen und Kanonen.

source: The number of pixels between the left most pixel of the flag and the right most pixel of the simple cannon (when not firing nor exploding)
de: Die Anzahl der Pixel zwischen den letzten linken Pixel der Flagge und den letzten rechten Pixel der einfachen Kanone (weder schießend noch explodierend).

source: The sprites description groups
de: Animationen

source: Each type of sprite (flag, infantry, cavalry, cannon, firing cannon and exploding cannon) is defined by a group. Only some sprites have a width entry. This entry is used for relative positioning during animations: the cannons, firing or exploding should not "move" around the country's flag during fight.
de: Jede Animation (Flagge, Infanterist, Kallavarist, Kanone, Schuss und Explosion) wird durch eine eigene Gruppe ([flag], [infantry], [cavalry], [cannon], [firing] und [exploding]) definiert. Die Option „width“ wird zur relativen Positionierung während der Animation genutzt. D. h., dass sich die Kanonen, Schüsse und Explosionen während des Kampfes nicht um die Flagge des Landes „bewegen“.

source: Sprite description group entries
de: Aufbau der Animationsbeschreibungen

source: Entry
de: Eintrag

source: The reference width of the flag sprite frames
de: Die Bezugsbreite für die Bilder der Flaggenanimation.

source: The reference height of the flag sprite frames
de: Die Bezugshöhe der Bilder für die Flaggenanimation.

source: The number of frames of the sprite
de: Die Anzahl der Bilder für die Animation.

source: The number of versions of the flag sprites
de: Die Anzahl der Darstellungen für die Flaggenanimation.

source: The countries description groups
de: Länder

source: Each country listed in the onu group, countries entry has its own group whose label is the country name. The table below lists the entries of these groups.
de: Jedes in [onu] aufgeführte Land ist eigens definiert ([Land]). Die Tabelle zeigt die entsprechenden Einträge.

source: Country entries
de: Definition der Länder

source: The integer unique identification number of the country, must start at zero (0)
de: Die einzigartige Identifikationsnummer (Ganzzahl) für das Land (beginnend mit 0)

source: The displayed name of the country
de: Der angezeigte Ländername.

source: Each type of sprite (flag, infantry, etc.) in the country is displayed at a certain position defined by this entry made of two integers separated by a comma
de: Jede Animation (Flagge, Infanterist, usw.) wird an einer bestimmten Stelle des Landes angezeigt. Diese wird durch zwei Ganzzahlen definiert (getrennt durch Komma).

source: The list of the ids of the neighbors of the current country
de: Die benachbarten Länder (Identifikationsnummern oder [Land] mit Komma getrennt).

source: The nationalities description groups
de: Nationen

source: Each nationality listed in the onu group, nationalities entry has its own group whose label is the nationality name. The table below lists the entries of these groups.
de: Jede in [onu] aufgeführte Nation ist eigens definiert ([Nation]). Die Tabelle zeigt die entsprechenden Einträge.

source: Nationality entries
de: Definition der Nationen

source: The name of the nationality (e.g. Japan)
de: Der Name der Nation (z. B. Japan)

source: The name that will be proposed to the player choosing this nationality
de: Der voreingestellte Name des Staatschefs.

source: The name of the country's flag sprite element in the onu SVG file
de: Der Name der Flaggenanimation für das jeweilige Land in der Datei <filename>pool.svg</filename>.

source: The continents description groups
de: Kontinente

source: Each continent listed in the onu group, continents entry has its own group whose label is the continent name. The table below lists the entries of these groups.
de: Jeder in [onu] aufgeführter Kontinent ist eigens definiert ([Kontinent]). Die Tabelle zeigt die entsprechenden Einträge.

source: Continent entries
de: Definition der Kontinente

source: The name of the continent (e.g. Africa)
de: Der Name des Kontinents (z. B. Afrika)

source: The integer unique identification number of the continent
de: Die einzigartige Identifikationsnummer (Ganzzahl) für den Kontinent (beginnend mit 1)

source: The number of armies obtained at the end of the turn by the player owning all the countries of the continent
de: Die Anzahl der Zusatzeinheiten am Rundenende für das Eigentum an allen Ländern des Kontinents.

source: continent-countries
de: continents-countries

source: The list of the ids of the countries inside the current continent
de: Die Länder des Kontinents (Identifikationsnummern oder [Land] mit Komma getrennt).

source: The goals description groups
de: Spielziele

source: Each goal listed in the onu group, goals entry has its own group whose label is the goal name. The table below lists the entries of these groups.
de: Jedes in [onu] aufgeführte Spielziel ist eigens definiert ([Ziel]). Die Tabelle zeigt die entsprechenden Einträge.

source: Goal entries
de: Definition der Spielziele

source: The type of goal. Can be continents, countries or player
de: Die Art des Spielziels. Es kann sich hierbei um Kontinente, Länder oder Spieler handeln (continents, countries oder player).

source: set the minimal number of armies the player will have to put on each country
de: Die minimale Anzahl an Einheiten, die sich auf jedem Land befinden muss.

source: set the number of countries the player must possess
de: Die Anzahl der Länder, die erobert werden müssen.

source: For a player goal type, if the target player is killed by another one, this sets the number of countries the player will have to conquer instead
de: Für Spieler-Ziele: Sollte der genannte Spieler von einem anderen vernichtet werden, muss der Spieler mit diesem Spielziel stattdessen so viele Länder erobern.

source: A full text description of the goal with appropriate placeholders (needs more doc here)
de: Die Beschreibung des Spielziels mit Platzhaltern in einem ganzen Satz (weitere Ausführungen folgen).

source: The list of continents ids the player will have to conquer
de: Für Kontinent-Ziele: Die zu erobernden Kontinente ([Identifikationsnummer] oder [Land] mit Komma getrennt).

source: The Images folder
de: Images/

source: This folder contains the buttons specific to &ksirk; and the pool SVG file that contains the map and all sprites.
de: Dieser Ordner enthält die spezifischen Knöpfe für &ksirk; und die zusammengefasste <filename>.svg</filename>-Datei mit der Karte und den Animationen.

source: The pool.svg file
de: <filename>pool.svg</filename>

source: This SVG file contains the map and all the sprites of the game. Each element is named such that the game can select and render separately each of them.
de: Diese <filename>.svg</filename>-Datei enthält die Karte und alle Animationen des Spiels. Jedes Element ist eigens bezeichnet, damit die Animationen richtig ausgewählt und wiedergegeben werden können.

source: In the default skin, the sprites are flags, infantry, cavalry and cannon. Infantry represents one army, five for cavalry and ten for cannons. Cannons are also used to display fighting armies. That's why there is three kinds of cannon sprites: normal static or moving cannon, firing one and exploding one.
de: Im Standard-Design bilden die Flaggen, Infanteristen, Kavallerie und Kanone die Animationen. Der Infanterist repräsentiert eine Einheit (Kavallerie fünf und Kanonen zehn Einheiten). Die Kanonen werden ebenfalls zur Anzeige der kämpfenden Einheiten verwendet. Das ist der Grund, dass für die Kanonen drei Animationen existieren (stehende oder bewegende, schießende und explodierende).

source: Each sprite image is the concatenation of the various views of the object and for each view, its frames. Views are organized vertically and frames horizontally. Where to cut the image in individual frames is found by dividing the height of the image by the number of views and the width by the number of frames. These data are found in the onu.desktop file.
de: Jedes Animationsbild ist die Zusammenfassung der unterschiedlichen Ansichten des Objekts und für jede Ansicht die der Einzelbilder. Die Ansichten sind vertikal und die Einzelbider horizontal angeordnet. An welchen Stellen das Gesamtbild die individuellen Einzelbilder enthält, wird durch Division der Bildhöhe durch die Anzahl der Ansichten und die Bildbreite durch die Anzahl der Einzelbilder ermittelt. Diese Daten werden in der <filename>world.desktop</filename>-Datei festgelegt.

source: An example of a sprite image: cannon.png
de: Beispiel für ein Animationsbild: <filename>cannon.png</filename>

source: For armies sprites, there is three different views, from top to bottom:
de: Für die Animation der Einheiten gibt es drei verschiedene Ansichten (von oben nach unten):

source: looking right
de: nach rechts

source: looking left and
de: nach links

source: facer
de: zum Betrachter

source: For flags, there is only one view. All sprites backgrounds should be set to transparent.
de: Für die Flaggen gibt es nur eine Ansicht. Der Hintergrund für die Animationen muss transparent sein.

source: An example of a flag sprite image: italy.png
de: Beispiel für ein Animationsbild einer Flagge: <filename>italy.png</filename>

source: The elements of the pool
de: Die Elemente der Zusammenfassung

source: Element name
de: Name des Elements

source: Sample Image
de: Beispielbild

source: Map of the skins's world. Countries can have arbitrary shapes, but should be grouped in eye-recognizable continents, by location only or by color
de: Die Karte für das Design. Die Länder können beliebige Formen aufweisen, sollten aber durch den Standort oder die Farbe für das Auge erkennbare Kontinente ergeben.

source: The flag of the Italy nation. There is one such entry for each nation
de: Die Flagge der italienischen Nation. Für jede Nation gibt es ein solches Bild.

source: Icon representing one army
de: Das Bild für eine Einheit.

source: Icon representing five armies
de: Das Bild für fünf Einheiten.

source: Icon representing ten armies
de: Das Bild für zehn Einheiten.

source: Icon representing armies during a fight
de: Das Bild für kämpfende Einheiten.

source: Icon representing armies when losing a fight
de: Das Bild für verlorene Einheiten.

source: The shape of the Alaska country. This is used to highligth the country. There is one such shape for each country. Its color is not used. As such, the color is free.
de: Dies ist die Form von Alaska. Sie wird zum Hervorheben des Landes verwendet. Für jedes Land gibt es eine solche Form, bei der keine Farben verwendet werden (damit ist die Farbauswahl egal).

source: The red dices used to show battles results
de: Der rote Würfel für die Anzeige des Würfelergebnisses.

source: The blue dices used to show battles results
de: Der blaue Würfel für die Anzeige des Würfelergebnisses.

source: This mark is added to fighting sprites to show the number of armies they represent, here 1. There is also a mark2 and a mark3 elements.
de: Dieses Bild wird zur Anzeige der Anzahl der kämpfenden Einheiten verwendet (hier: 1). Es werden auch die Elemente „mark2“ und „mark3“ benötigt.

source: The map-mask.png file
de: <filename>map-mask.png</filename>

source: This is a png file representing also the map of the skins's world, but with coded colors that allows one to identify uniquely each country. Countries must have at least the same shapes as the corresponding countries on the map.png file so that users can click anywhere in a viewable country and select the good one. Countries, like little islands as Indonesia in the default map can be greater than the equivalent in the map.png file to facilitate the selection of the country.
de: Es handelt sich hierbei um eine <filename>.png</filename>-Datei, die ebenfalls die Karte des Designs darstellt. Jedoch wird hierbei die Identifizierung des einzelnen Landes mit festgelegten Farben ermöglicht. Die Länder müssen mindestens die Größe der selbigen in der Datei <filename>map.png</filename> vorweisen, damit die Auswahl des Landes durch einen Klick irgendwo innerhalb des Landes erfolgen kann. Um die Auswahl von kleineren Ländern zu vereinfachen, kann es größer sein als in der Datei <filename>map.png</filename> (z. B. Indonesien im standardmäßigen Design).

source: A sample map-mask
de: Beispiel einer <filename>map-mask.png</filename>

source: The blue component (in RGB model) of a country's color identifies the country: index 0 is country 0 in the onu.xml file, index 1 is country 1, &etc; White (0xFFFFFF in RGB) identifies the absence of country (sees or, why not, no man's lands).
de: Der Blauanteil (im RGB-Farbspektrum) gibt das jeweilige Land an (0x000000 = Land[0], 0x000001 = Land[1] &etc; in der Datei <filename>world.desktop</filename>). Mit Weiß (0xFFFFFF) werden die übrigen Flächen definiert.

source: The buttons images
de: Die Knopfbilder

source: The filenames are hard-coded in the code, so they should not be modified. The table below shows all the buttons that should be provided.
de: Die Dateinamen sind fest im Quellkode verankert und sollten daher nicht verändert werden. Die folgende Tabelle zeigt alle verwendeten Knöpfe.

source: The buttons of the &GUI;
de: Die Knöpfe der &GUI;

source: Image
de: Symbol

source: Filename
de: Dateiname

source: newNetGame.png
de: <filename>newNetGame.png</filename>

source: Tries to join a network game
de: Teilnahme an einem Netzwerkspiel.

source: recycling.png
de: <filename>recycling.png</filename>

source: After all players have put their armies, it is possible to modify the distributions (named recycling). This button asks to do such a redistribution
de: Nachdem alle Spieler ihre Einheiten verteilt haben, kann die Verteilung nochmals verändert werden (Umverteilung). Dieser Knopf ist für die entsprechende Abfrage.

source: recyclingFinished.png
de: <filename>recyclingFinished.png</filename>

source: Chooses not to redistribute. All clients windows must have this button clicked to really end the distribution
de: Die Umverteilung wird nicht gewählt. Der Knopf muss von allen Spielern gedrückt worden sein, damit die Verteilung abgeschlossen ist.

source: Ends the current player's turn and switch to the next one or to the next turn if the current player was the last one
de: Der Zug des aktuellen Spielers endet und der nächste Spieler ist am Zug oder die nächste Runde beginnt, wenn der aktuelle Spieler der letzte ist.

source: attackOne.png
de: <filename>attackOne.png</filename>

source: Chooses to start an attack with one army
de: Das Land wird mit einer Einheit angegriffen.

source: attackTwo.png
de: <filename>attackTwo.png</filename>

source: Chooses to start an attack with two armies
de: Das Land wird mit zwei Einheiten angegriffen.

source: attackThree.png
de: <filename>attackThree.png</filename>

source: Chooses to start an attack with three armies
de: Das Land wird mit drei Einheiten angegriffen.

source: defendOne.png
de: <filename>defendOne.png</filename>

source: Chooses to defend an attacked country with one army
de: Das angegriffene Land wird mit einer Einheit verteidigt.

source: defendTwo.png
de: <filename>defendTwo.png</filename>

source: Chooses to defend an attacked country with two armies
de: Das angegriffene Land wird mit zwei Einheiten verteidigt.

source: moveArmies.png
de: <filename>moveArmies.png</filename>

source: Chooses to start the moving of armies between two countries (last action in the turn)
de: Einheiten werden in ein benachbartes Land verlegt (letzte Aktion eines Spielzugs).

source: The Sounds folder
de: Sounds/

source: This folder contains three sound files:
de: Dieser Ordner enthält drei Audio-Dateien:

source: roll.wav played when armies are moving
de: <filename>roll.wav</filename> wird bei Bewegung der Einheiten,

source: cannon.wav played when firing and
de: <filename>cannon.wav</filename> wird beim Schusswechsel und

source: crash.wav played when a cannon explodes
de: <filename>crash.wav</filename> wird beim Schuss einer Kanone abgespielt

source: Using the &kappname;
de: <application>KsirK-Design-Editor</application> verwenden
