Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdegames/ksirk.po
Languages: de

source: The &ksirk; Handbook
de: Das Handbuch zu &ksirk;

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Johannes</firstname><surname>Obermayr</surname><affiliation><address><email>johannesobermayr@gmx.de</email></address></affiliation><contrib>Übersetzung</contrib></othercredit>

source: &ksirk; is a computerized version of a well known strategy game. Commercial and other Free Software versions exist but I (Gaël de Chalendar) created this game initially as a C++ learning exercise and so, I developed it up to this point (see README for details).
de: &ksirk; ist eine computergestützte Version des sehr bekannten Strategiespiels Risiko. Es sind zwar andere kostenpflichtige sowie freie Software-Versionen verfügbar, jedoch startete Gaël de Chalendar mit der Programmierung als eine Lernübung für C++ und entwickelt es bis heute. Weitere Informationen hierzu können der <filename>README</filename>-Datei entnommen werden.

source: In the current version, &ksirk; is a multi-player network-enabled game with an AI. (see TODO for details)
de: In der aktuellen Version ist &ksirk; ein Spiel für mehrere Spieler mit Netzwerkunterstützung und einer grafischen Benutzeroberfläche. Die weitere Planung kann der <filename>TODO</filename>-Datei entnommen werden.

source: This documentation gives the major information you need to start playing. Please read the tooltips and the status bar messages to complete your information. A chapter explains how to create new skins for &ksirk;
de: Diese Dokumentation zeigt die grundlegenden Informationen für den Spielstart. Die Kurzinfos und die Meldungen in der Statusleiste geben Ihnen weitere Informationen. Ein Abschnitt erklärt, wie neue Designs für &ksirk; erstellt werden können.

source: The goal of the game is simply to conquer the World... It is done by attacking your neighbors with your armies. Peaceful, isn't it :-)
de: Das Spielziel ist - einfach gesagt - die Weltherrschaft zu erlangen ... Dies geschieht durch das Angreifen der Gegner in den Nachbarländern mit den eigenen Einheiten. Friedlich ist es keineswegs :-)

source: kdegames
de: KDE-Spiele

source: game
de: Spiel

source: strategy
de: Strategie

source: Risk
de: Risiko

source: free
de: Frei

source: Network
de: Netzwerk

source: <keyword>AI</keyword>
de: <keyword>KI</keyword>

source: Introduction
de: Einführung

source: Here's a screenshot of &ksirk;
de: Bildschirmfoto von &ksirk;

source: Screenshot
de: Bildschirmfoto

source: This documentation gives only the major information you need to start playing. Please read the tooltips and the status bar messages to complete your information.
de: Diese Dokumentation zeigt nur die grundlegenden Informationen für den Spielstart. Die Kurzinfos und die Meldungen in der Statusleiste geben Ihnen weitere Informationen.

source: The goal of the game is simply to conquer the World... It is done by attacking your neighbors with your armies. Peaceful, isn't it ? :-)
de: Das Spielziel ist - einfach gesagt - die Weltherrschaft zu erlangen ... Dies wird erreicht, indem die Gegner in den Nachbarländern mit den Einheiten angegriffen werden. Friedlich - oder etwa nicht? :-=)

source: Using &ksirk;
de: &ksirk; verwenden

source: Playing &ksirk;
de: &ksirk; spielen

source: Preliminary note : the map can be scrolled by three methods:
de: Grundsätzlicher Hinweis: Die Karte kann auf drei Arten verschoben werden:

source: You can put your mouse near a border of the window and the map will scroll in that direction
de: mit Bewegung der Maus zu den Seiten des Fenstern in dieser Richtung,

source: You can use your mouse wheel: with no modifier, it will scroll vertically; when pressing the &Alt; key, it will scroll horizontally
de: mit dem Mausrad vertikal, mit dem Mausrad und gedrückter &Alt;-Taste horizontal oder

source: You can use the keyboard arrows
de: mit den Pfeiltasten.

source: Starting a game
de: Ein Spiel starten

source: When &ksirk; starts, you are presented with a main menu.
de: Beim Start von &ksirk; wird das Hauptmenü angezeigt.

source: The main menu of &ksirk;
de: Das Hauptmenü von &ksirk;

source: Main menu
de: Hauptmenü

source: New Local Game
de: Neues lokales Spiel

source: Starts a new game
de: Startet ein neues Spiel.

source: Play &ksirk; over Jabber Network
de: Netzwerkspiel (Jabber)

source: Play &ksirk; over <ulink url="http://en.wikipedia.org/wiki/Extensible_Messaging_and_Presence_Protocol">Jabber</ulink>. You need to register Jabber account first.
de: Ein &ksirk;-Spiel über das<ulink url="http://de.wikipedia.org/wiki/Extensible_Messaging_and_Presence_Protocol">Jabber</ulink>-Protokoll. Zuerst müssen Sie ein Jabber-Konto einrichten.

source: New Standard TCP/IP Network Game
de: Netzwerkspiel erstellen (TCP/IP)

source: Start a new game using <ulink url="http://en.wikipedia.org/wiki/Internet_protocol_suite">Internet protocol suite</ulink>.
de: Beginnt ein neues Spiel und benutzt dazu das <ulink url="http://de.wikipedia.org/wiki/Internet_Protocol">Internet-Protokoll</ulink>.

source: Join Standard TCP/IP Network Game
de: Netzwerkspiel beitreten (TCP/IP)

source: Join to the created by other user game using <ulink url="http://en.wikipedia.org/wiki/Internet_protocol_suite">Internet protocol suite</ulink>.
de: Mitspielen bei einem von anderen Benutzern erstellten Spiel, dass das <ulink url="http://de.wikipedia.org/wiki/Internet_Protocol">Internet-Protokoll</ulink>verwendet.

source: Load
de: Laden

source: Use this to load a previously saved game
de: Hiermit kann ein gespeichertes Spiel geladen werden.

source: <guimenu>Quit</guimenu>
de: <guimenu>Beenden</guimenu>

source: Maybe you finally don't want to play?
de: Beendet &ksirk;.

source: If you hit <guibutton>New Local Game</guibutton> you will be presented with the <guilabel>New game properties</guilabel> dialog where you will be able to choose the number of players, the skin (or theme) to use, the game type (conquer the goal or have a specific goal) and finally if this game will be played with online players or if it is purely local. New skins can be downloaded using <guibutton>Download New Skins</guibutton> button.
de: Bei der Auswahl von <guibutton>Neues lokales Spiel</guibutton> werden die Einstellungen für das neue Spiel zur Eingabe der Anzahl der Spieler, des Designs, der Art des Spielziels (Weltherrschaft oder individuelle Ziele) und ob ein Netzwerkspiel gestartet werden soll, abgefragt.

source: <screeninfo>The New Game dialog</screeninfo>
de: <screeninfo>Neues Spiel</screeninfo>

source: <phrase>The New Game dialog</phrase>
de: <phrase>Neues Spiel</phrase>

source: To start a TCP/IP network game, choose the <guilabel>New Standard TCP/IP Network Game</guilabel> option on introduction screen. After clicking this button you will be able to choose the network parameters: number of local players and TCP port on which waiting for connections.
de: Um ein Netzwerkspiel über TCP/IP zu starten, wählen Sie <guilabel>Netzwerkspiel erstellen (TCP/IP)l</guilabel> im Hauptbildschirm aus. Nach dem Drücken diese Knopfes können die Netzwerkeinstellungen für die Anzahl der lokalen Netzwerkspieler und den TCP-Port vorgenommen werden.

source: <screeninfo>Network game parameters dialog</screeninfo>
de: <screeninfo>Netzwerkeinstellungen</screeninfo>

source: <phrase>Network game parameters dialog</phrase>
de: <phrase>Netzwerkeinstellungen</phrase>

source: Then, network players will be able to connect by choosing <guilabel>Join Standard TCP/IP Network Game</guilabel> on the introduction screen and by indicating the IP or hostname of the host and the port number you just set.
de: Netzwerkspieler können dann dem Spiel beitreten, indem Sie <guilabel>Netzwerkspiel beitreten (TCP/IP)</guilabel> im Hauptbildschirm wählen und im folgenden Dialog die IP-Adresse oder Hostnamen und die Portnummer angegeben haben.

source: <screeninfo>Joining network game dialog</screeninfo>
de: <screeninfo>Netzwerkspiel beitreten</screeninfo>

source: <phrase>Joining network game dialog</phrase>
de: <phrase>Netzwerkspiel beitreten</phrase>

source: Each connection is indicated by a new row in the <guilabel>Players</guilabel> table below the map thumbnail.
de: Jede Verbindung wird durch eine neue Zeile in der in der <guilabel>Spieler</guilabel>tabelle unter der Kartenvorschau angezeigt.

source: <screeninfo>New player row</screeninfo>
de: <screeninfo>Neue Spielerzeile</screeninfo>

source: <phrase>New player row</phrase>
de: <phrase>Neue Spielerzeile</phrase>

source: Let's suppose you keep all the default settings and hit <guibutton>Next</guibutton>. You will then setup two players, one after one. For each one, you'll choose a name, a nationality and, if you want, setup a password such that nobody else than you can reuse this player when reloading this saved game. Lastly, you will here specify if this player is played by the computer or by a human being.
de: Sollten die standardmäßigen Einstellungen beibehalten und <guibutton>Weiter</guibutton> gedrückt werden, müssen die Einstellungen für zwei Spieler vorgenommen werden (einer nach dem anderen). Für jeden Spieler muss ein Name und eine Staatsangehörigkeit (Nation) angegeben werden und - wenn gewünscht - ein Passwort, damit niemand anderes das Spiel fortführen kann (soweit es gespeichert wurde). Zuletzt kann entschieden werden, ob es sich um einen Computerspieler oder menschlichen Spieler handelt.

source: <screeninfo>The Player Setup dialog</screeninfo>
de: <screeninfo>Spieler-Einstellungen</screeninfo>

source: <phrase>The Player Setup dialog</phrase>
de: <phrase>Spieler-Einstellungen</phrase>

source: Then, after clicking <guibutton>Start</guibutton>, if you choose to play with goal, the goal of each local player is displayed, preceded by a warning such that other players looking at the same computer can discreetly turn away while the goal is being viewed.
de: Drücken Sie dann den Knopf <guibutton>Start</guibutton>,. Bei Auswahl der individuellen Spielziele werden diese nun für jeden Spieler einzeln angezeigt. Vor Anzeige des Spielziels für den betroffenen Spieler erscheint ein Hinweis, sich zu vergewissern, dass kein anderer Spieler sein Spielziel sehen kann.

source: <screeninfo>The Goal Display warning message</screeninfo>
de: <screeninfo>Vorwarnung zur Anzeige des Spielziels</screeninfo>

source: <phrase>The Goal Display warning message</phrase>
de: <phrase>Warnung für Spielziel-Anzeige</phrase>

source: <screeninfo>The Goal Display dialog</screeninfo>
de: <screeninfo>Anzeige des Spielziels</screeninfo>

source: <phrase>The Goal Display dialog</phrase>
de: <phrase>Spielziel-Anzeige</phrase>

source: Distribution
de: Verteilen

source: At the beginning of the game, countries are distributed to all the players. Each country contains one army (represented by an infantryman) at the start. Each player has some armies to distribute to his countries at their turn (indicated by the presence of their name and their flag in the status bar). Note that five armies are represented by a cavalryman and 10 by a cannon.
de: Am Anfang des Spiels werden die Länder auf alle Spieler verteilt und auf jedem Land befindet sich eine Einheit (Infanterist). Vor Beginn der ersten Runde hat jeder Spieler ein paar Einheiten auf seine Ländern zu verteilen. Hierbei ist zu beachten, dass fünf Einheiten durch eine Kavallerie und zehn durch eine Kanone dargestellt werden.

source: To put an army on one of your countries, click on it with the left mouse button. To remove an army, click with the right button. Note, as a general rule, that you will never be able to remove more armies than the number you placed.
de: Um eine Einheit einem eigenen Land zuzuteilen, ist ein Klick mit der linken Maustaste auf das betreffende Land erforderlich. Ein Klick mit der rechten Maustaste entfernt eine Einheit. Es können jedoch nicht mehr Einheiten entfernt werden als aktuell zugeteilt wurden.

source: <screeninfo>Placing armies</screeninfo>
de: <screeninfo>Einheiten verteilen</screeninfo>

source: <phrase>Placing armies</phrase>
de: <phrase>Einheiten stationieren</phrase>

source: When a player has distributed all there armies, the next player is automatically selected to do the same task. When all players have finished to distributing their armies, there is two possibilities that can be selected by two buttons showed in the right panel:
de: Wenn ein Spieler seine Einheiten verteilt hat, ist automatisch der nächste Spieler mit dem Verteilen an der Reihe. Wenn alle Spieler ihre Einheiten verteilt haben, kann zwischen zwei Möglichkeiten (Knöpfe in der rechten Leiste) entschieden werden:

source: Redistribution
de: Umverteilung

source: Recycle
de: Umverteilen

source: One player wants to change some of his choices. The first player can then remove an army he just put in a country with the right mouse button and put it in another one with the left mouse button. When he finishes, he gives control to next player with the <guibutton>Valid</guibutton> button. When all players have finished their redistribution, the two buttons are displayed again.
de: Ein Spieler hat sich dazu entschieden, die Verteilung seiner Einheiten zu verändern. Der erste Spieler kann jetzt eine Einheit, die er bereits einem anderen Land zugeteilt hat, mit der rechten Maustaste wieder abziehen und sie einem neuen Land mit der linken Maustaste zuteilen. Wenn er fertig ist, gibt er die Möglichkeit der Umverteilung mit Betätigung von <guibutton>Fertig</guibutton> an den nächsten Spieler ab. Wenn alle Spieler die Umverteilung abgeschlossen haben, werden die beiden Knöpfe erneut angezeigt.

source: End of redistribution
de: Umverteilung beenden

source: Done
de: Fertig

source: The redistribution is finished and the game can continue.
de: Die Umverteilung ist abgeschlossen und das Spiel kann fortgesetzt werden.

source: Fight
de: Kampf

source: After the redistribution, a turn starts. Each player plays at his turn. He has the choice to:
de: Nach dem Umverteilen beginnt eine Runde. Dabei spielt jeder Spieler, wenn er an der Reihe ist und hat dabei folgende Möglichkeiten:

source: Next player
de: Zug beenden

source: Next Player
de: Zug beenden

source: The turn of the current player finishes and it's the turn of the next one.
de: Der Zug des aktuellen Spielers ist beendet und der nächste Spieler ist am Zug.

source: Attack 1
de: Angriff mit einer Einheit

source: &nbsp;<inlinemediaobject> <imageobject> <imagedata fileref="attackTwo.png" format="PNG"/> </imageobject> <textobject> <phrase>Attack 2</phrase> </textobject> </inlinemediaobject> &nbsp;<inlinemediaobject> <imageobject> <imagedata fileref="attackThree.png" format="PNG"/> </imageobject> <textobject> <phrase>Attack 3</phrase> </textobject> </inlinemediaobject><guibutton>Attack with one, two or three armies</guibutton> &nbsp;<inlinemediaobject> <imageobject> <imagedata fileref="autoattack.png" format="PNG"/> </imageobject> <textobject> <phrase>Auto attack</phrase> </textobject> </inlinemediaobject> <guibutton>Auto attack</guibutton>
de: &nbsp;<inlinemediaobject> <imageobject> <imagedata fileref="attackTwo.png" format="PNG"/> </imageobject> <textobject> <phrase>Angriff mit zwei Einheiten</phrase> </textobject> </inlinemediaobject> &nbsp;<inlinemediaobject> <imageobject> <imagedata fileref="attackThree.png" format="PNG"/> </imageobject> <textobject> <phrase>Angriff mit drei Einheiten</phrase> </textobject> </inlinemediaobject><guibutton>Angriff mit einer, zwei oder drei Einheit(en)</guibutton> &nbsp;<inlinemediaobject> <imageobject> <imagedata fileref="autoattack.png" format="PNG"/> </imageobject> <textobject> <phrase>Automatischer Angriff</phrase> </textobject> </inlinemediaobject> <guibutton>Automatischer Angriff</guibutton>

source: To attack, drag with the mouse from the attacking country and drop to the attacked one. You will then be presented with a contextual menu showing the above entries. <screenshot> <screeninfo>Attack menu</screeninfo> <mediaobject> <imageobject> <imagedata fileref="attackmenu.png" format="PNG"/> </imageobject> <textobject> <phrase>Attack menu</phrase> </textobject> </mediaobject> </screenshot> For a country X to attack a country Y with x armies, 2 conditions must be fulfilled:
de: Um anzugreifen, wird mit der Maus das angreifende auf das anzugreifende Land gezogen. Es wird ein Kontextmenü mit folgenden Einträgen angezeigt:<screenshot><screeninfo>Angriffsmenü</screeninfo><mediaobject><imageobject><imagedata fileref="attackmenu.png" format="PNG"/></imageobject><textobject><phrase>Angriffsmenü</phrase></textobject></mediaobject></screenshot>Zum Angriff des Landes X vom Land Y mit Z Einheiten müssen zwei Bedingungen erfüllt sein:

source: the two countries must be neighbors;
de: Die beiden Länder müssen benachbart und

source: country X must have at least x+1 armies before the attack.
de: auf dem angreifenden Land müssen mehr als Z + 1 Einheiten stationiert sein.

source: If the attack is valid, a dialog is displayed if necessary for the defender to choose if he wants to defend with one or two armies or let the computer decide.
de: Bei einem gültigen Angriff erscheint beim Verteidigenden ein Dialog bei dem zwischen der Verteidigung mit einer oder zwei Einheiten bzw. der Entscheidung dafür durch den Computer gewählt werden kann.

source: When the defenders choice is done, the fight will occur and be completed. This will described below.
de: Nachdem die Wahl der Verteidung getroffen ist, wird der Kampf vollzogen. Dies wird nachstehend beschrieben.

source: <screeninfo>Defense dialog</screeninfo>
de: <screeninfo>Verteidigung</screeninfo>

source: <phrase>Defense dialog</phrase>
de: <phrase>Verteidigung</phrase>

source: Move armies
de: Einheiten verlegen

source: Move Armies from one country to another
de: Einheiten verlegen

source: This is the last action of a player's turn. It gives the possibility to move some armies from one of his country to another, neighboring the first one. To choose the two countries, please drag and drop like you use during an attack. When both countries are selected, a slider is displayed on which you can choose how many armies there will be on each country afterwards.
de: Es handelt sich hierbei um die letzte Aktion in einem Spielzug. Hierdurch wird ermöglicht, Einheiten in ein benachbartes Land zu verlegen. Hierzu muss - wie bei einem Angriff - das abgebende auf das empfangende Land gezogen werden. Wenn beide Länder gewählt sind, erscheint ein Dialog, in dem ausgewählt werden kann, wie viele Einheiten in den beiden Ländern nach dem Verlegen noch stationiert sind.

source: Solution of the fight
de: Kampfergebnis

source: For each army in the fight there is a corresponding die cast. The player who rolls a higher number on the dice, whether being from the attacker or defender, wins and the one to roll a smaller number on the dice loses armies according to the number of dice thrown.
de: Für jede am Kampf beteiligte Einheit gibt es ein entsprechendes Kampfergebnis. Hierzu werden die Würfel - vom höchsten Ergebnis aus - nacheinander verglichen: Der Spieler mit der höheren Zahl - egal ob Angreifer oder Verteidigender - gewinnt und der Spieler mit der niedrigeren Zahl verliert Einheiten. Sollte Gleichstand herrschen, ist der Angriff der entsprechenden Einheit abgewehrt und der Angreifer verliert seine Einheit.

source: <screeninfo>Attack result displayed</screeninfo>
de: <screeninfo>Kampfergebnis</screeninfo>

source: <phrase>Attack result displayed</phrase>
de: <phrase>Anzeige des Angriffsergebnisses</phrase>

source: If the number of armies in the defender country reaches 0, the ownership of this country changes to the attacker: his flag is set up and one of his attacking armies is installed in his new country. The "Move armies" slider is displayed as for the moves of the end of the turn.
de: Wenn die Anzahl der Einheiten im verteidigenden Land auf Null zurück geht, wechselt das Eigentum am Land zum Angreifer über. Nun wird seine Flagge angezeigt und eine seiner angreifenden Einheiten marschiert in das eroberte Land ein. Der Dialog für das Einmarschieren wird angezeigt - wie für das Verlegen am Ende einer Runde.

source: <screeninfo>Invasion slider</screeninfo>
de: <screeninfo>Einmarschieren</screeninfo>

source: <phrase>Invasion slider</phrase>
de: <phrase>Einmarschieren</phrase>

source: End of the turn
de: Ende der Spielrunde

source: To finish your current turn, if you don't want to move armies, you can hit the <guibutton>Next Player</guibutton> button in the toolbar.
de: Mit dem Drücken auf <guibutton>Zug beenden</guibutton> in der Werkzeugleiste wird der aktuelle Zug ohne Verlegen von Einheiten abgeschlossen.

source: When everybody has played, the turn is finished. Some armies are distributed to the players, in function of the countries they own: 1 for each group of three countries, with a minimum of 3. There is also a bonus for players that own a complete continent, different for each one. The values of the bonuses for the default skin are:
de: Nachdem jeder Spieler seinen Zug abgeschlossen hat, ist die Runde beendet. Jeder Spieler erhält nun neue Einheiten, die er stationieren muss. Die Anzahl dieser Einheiten richtet sich nach den Ländern, die der jeweilige Spieler besitzt. Eine Einheit erhält man für je drei Länder, mindestens jedoch drei Einheiten. Eine unterschiedliche Anzahl von Zusatzeinheiten erhält man für das Eigentum an einem Kontinent. Im Standarddesign sieht die Verteilung wie folgt aus:

source: Bonus due to the continents
de: Zusatzeinheiten für das Eigentum an kompletten Kontinenten

source: Continent
de: Kontinent

source: Bonus
de: Zusatzeinheiten

source: North America
de: Nordamerika

source: South America
de: Südamerika

source: Europe
de: Europa

source: Africa
de: Afrika

source: Asia
de: Asien

source: Pacific Area
de: Pazifik

source: When a player has finished distributing his armies, he clicks the <guibutton>Valid</guibutton> button to allow the next player to distribute his bonus armies. As for the initial distribution, when all player have placed their armies, they can start a new redistribution cycle or start a new turn...
de: Nachdem ein Spieler seine Einheiten verteilt hat, drückt er auf <guibutton>Fertig</guibutton>, damit der nächste Spieler seine Zusatzeinheiten verteilen kann. Genauso wie beim eigentlichen Verteilen, kann wieder eine Umverteilung stattfinden oder die neue Runde beginnen ...

source: Command Reference
de: Befehle

source: The main &ksirk; window
de: Der Hauptbildschirm von &ksirk;

source: The buttons
de: Die Knöpfe

source: Quit Game
de: Beenden

source: <guibutton>Quit</guibutton>
de: <guibutton>Beenden</guibutton>

source: Causes the program to quit.
de: Das Programm wird beendet.

source: <phrase>New Game</phrase>
de: <phrase>Neues Spiel</phrase>

source: <guibutton>New Game</guibutton>
de: <guibutton>Neues Spiel</guibutton>

source: Starts a new game. It will cause the displaying of a dialog asking the number of players. After that, each player will be asked its name with another dialog.
de: Ein neues Spiel wird gestartet. Es werden die Anzahl und danach die Namen der Spieler abgefragt.

source: Developer's Guide to &ksirk;
de: Entwicklerhandbuch zu &ksirk;

source: Please refer to <ulink url="http://api.kde.org/">http://api.kde.org/</ulink> for the documentation of the API. It was quite complete but is currently a little bit outdated. There are no comments in the <filename>.cpp</filename> implementation files.
de: Die Dokumentation für die API (Programmierschnittstelle) finden Sie auf <ulink url="http://api.kde.org/">http://api.kde.org/</ulink>. Sie war einst durchaus vollständig, ist jedoch ein bisschen vernachlässigt worden. In den <filename>.cpp</filename>-Implementierungsdateien sind keine Kommentare enthalten.
