Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdegames/ksirk_ksirkskineditor.po
Languages: de

source: After creating the graphics in the right folder and SVG file, you just have to create countries, players, etc. and associate them with the right SVG element in the pool. This can be done with the &kappname;. Note that each part of this application is auto-described by tooltips and contextual help usualy reachable through the Ctrl+F1 shortcut.
de: Nachdem die Grafiken und die <filename>.svg</filename>-Datei im richtigen Ordner erstellt wurden, müssen die Länder, Spieler, usw. erstellt und mit dem richtigen Element in der <filename>.svg</filename>-Datei verknüpft werden. Dies kann mit <application>KsirK-Design-Editor</application> geschehen. Zu Beachten ist, dass alle Teile dieses Programms durch Kurzinfos und Kontexthilfe automatisch beschrieben werden (Tastenkürzel: <keycap>Strg + F1</keycap>).

source: Command Reference
de: Befehle

source: The main &kappname; window
de: Der Hauptbildschirm von <application>KsirK-Design-Editor</application>

source: The buttons
de: Die Knöpfe

source: <phrase>Load</phrase>
de: <phrase>Laden</phrase>

source: <guibutton>Load</guibutton>
de: <guibutton>Laden</guibutton>

source: Causes the program to load an existing skin.
de: Das Programm lädt ein bestehendes Design.

source: <phrase>Save</phrase>
de: <phrase>Speichern</phrase>

source: <guibutton>Save</guibutton>
de: <guibutton>Speichern</guibutton>

source: Saves the currently edited skin
de: Speichert das in Bearbeitung befindliche Design.

source: Developer's Guide to &kappname;
de: Entwicklerhandbuch zu <application>KsirK-Design-Editor</application>

source: Please refer to <ulink url="http://api.kde.org/">http://api.kde.org/</ulink> for the documentation of the API.
de: Die Dokumentation für die API (Programmierschnittstelle) ist auf <ulink url="http://api.kde.org/">http://api.kde.org/</ulink> verfügbar.

source: Questions and Answers
de: Fragen und Antworten

source: Credits and License
de: Danksagungen und Lizenz

source: &kappname;
de: <application>KsirK-Design-Editor</application>

source: Program copyright 2009 Gael de Chalendar <email>kleag@free.fr</email>
de: Programm © 2009 Gael de Chalendar <email>kleag@free.fr</email>

source: Documentation copyright 2009 Gael de Chalendar <email>kleag@free.fr</email>
de: Dokumentation © 2009 Gael de Chalendar <email>kleag@free.fr</email>

source: CREDIT_FOR_TRANSLATORS
de: <para>Übersetzung: Johannes Obermayr <email>johannesobermayr@gmx.de</email></para>

source: How to obtain &kappname;
de: Erwerb von <application>KsirK-Design-Editor</application>

source: Compilation and Installation
de: Kompilieren und Installieren
