Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdegames/ksirk.po
Languages: de

source: Note that I originally developed this game under &Windows; with Borland C++ and WinG. I ported it to &Java; before converting back to C++ and &kde;. At the beginning I used French or a mix of French and English to name the identifiers (classnames, methods, members, &etc;). I also used French for the comments. When I decided to distribute this game, I decided to convert all to english... but I am clearly not a native English speaker: please suggest or make and submit corrections, to the code comments or to this documentation
de: Es ist zu beachten, dass das Spiel ursprünglich mit Borland C++ und WinG unter &Windows; entwickelt wurde. Später wurde der Quellkode zu &Java; und schließlich für &kde; wieder zurück zu C++ konvertiert. Zu Beginn wurden französische und französisch-englische Bezeichnungen für die Klassen, Methoden, usw. verwendet. Die Kommentare waren ebenfalls in französisch verfasst. Später wurde alles ins Englische übersetzt. Der Programmierer ist kein Muttersprachler im Englischen und es wird daher darum gebeten, Sprachfehler in der grafischen Oberfläche und Dokumentation an ihn zu melden (in den englischen Versionen).

source: Creating new skins
de: Neue Designs erstellen

source: &ksirk; comes with a skin editor, named ksirkskineditor(!), that allows to edit all skin data, as soon as graphics (map, sprites, &etc;) are available in a SVG file. Please see the ksirkskineditor manual for further details.
de: &ksirk; enthält einen Design-Editor (ksirkskineditor) zur Bearbeitung aller Daten des Designs und der Grafiken (Karte, Animationen, &etc;), die in einer <filename>.svg</filename>-Datei vorliegen. Weitere Informationen hierzu können dem Handbuch zu &ksirk;-Design-Editor entnommen werden.

source: Questions and Answers
de: Fragen und Antworten

source: Credits and License
de: Danksagungen und Lizenz

source: Program copyright 2002-2012 Gael de Chalendar <email>kleag@free.fr</email>
de: Programm © 2002-2012 Gael de Chalendar <email>kleag@free.fr</email>

source: Program copyright 2013 Nemanja Hirsl <email>nemhirsl@gmail.com</email>
de: Program © 2013 Nemanja Hirsl <email>nemhirsl@gmail.com</email>

source: Contributors: Robin Doer, Albert Astals Cid, Michal Golunski (Polish translation).
de: Beitragende: Robin Doer, Albert Astals Cid, Michal Golunski (polnische Übersetzung).

source: Documentation copyright 2002-2008 Gael de Chalendar <email>kleag@free.fr</email>
de: Dokumentation © 2002-2008 Gael de Chalendar <email>kleag@free.fr</email>

source: CREDIT_FOR_TRANSLATORS
de: <para>Übersetzung: Johannes Obermayr <email>johannesobermayr@gmx.de</email></para>

source: How to obtain &ksirk;
de: Erwerb von &ksirk;

source: Compilation and Installation
de: Kompilieren und Installieren

source: Configuration
de: Einrichten

source: The settings menu entry opens a dialog that allows you to&nbsp;:
de: Der Menüeintrag <menuchoice><guimenu>Einstellungen</guimenu><guimenuitem>&ksirk; einrichten ...</guimenuitem></menuchoice> öffnet ein Fenster für

source: <screeninfo>Preferences dialog</screeninfo>
de: <screeninfo>Einstellungen</screeninfo>

source: <phrase>Preferences dialog</phrase>
de: <phrase>Einstellungen</phrase>

source: enable or disable the sounds&nbsp;;
de: das Aktivieren bzw. Deaktivieren der Klänge,

source: set the speed of the sprites (from slow to immediate)&nbsp;;
de: das Einstellen der Geschwindigkeit für die Animationen (langsam bis augenblicklich),

source: enable or disable the contextual helps displayed in popups&nbsp;;
de: das Aktivieren bzw. Deaktivieren der Kontexthilfe und

source: show or hide the number of armies on each country. The following snapshot shows the map when the number of armies are displayed.
de: die Anzeige bzw. das Ausblenden der Anzahl der Einheiten in den Ländern. Das folgende Bildschirmfoto zeigt die Karte mit angezeigter Anzahl der Einheiten.

source: <screeninfo>Display of the number of armies</screeninfo>
de: <screeninfo>Anzahl der Einheiten</screeninfo>

source: <phrase>Display of the number of armies</phrase>
de: <phrase>Anzahl der Einheiten anzeigen</phrase>
