Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdegames/kspaceduel.po
Languages: de

source: The strength of the sun. The higher the value, the quicker ships will be recharged.
de: Je höher die Sonnenenergie, desto mehr Energie bekommen die Schiffe.

source: Gravity
de: Schwerkraft

source: The strength of the gravitational pull of the sun.
de: Anziehungskraft der Sonne.

source: <guilabel>Position X</guilabel> and <guilabel>Position Y</guilabel>
de: <guilabel>Position X:</guilabel> und <guilabel>Position Y:</guilabel>

source: The ships position at the beginning of a new round. The ships start at opposite sides of the sun.
de: Die Positionen der Schiffe zu Beginn einer neuen Runde. Die Schiffe starten auf entgegengesetzten Seiten der Sonne.

source: <guilabel>Velocity X</guilabel> and <guilabel>Velocity Y</guilabel>
de: <guilabel>Geschwindigkeit X:</guilabel> und <guilabel>Geschwindigkeit Y:</guilabel>

source: Velocity at the beginning of a new round.
de: Geschwindigkeit der Schiffe zu Beginn einer neuen Runde.

source: <guilabel>Powerups</guilabel>
de: <guilabel>Bonusgegenstände</guilabel>

source: Appearance time
de: Erscheinungsdauer:

source: Maximal time between the appearance of two powerups.
de: Maximale Zeit zwischen dem Erscheinen zweier Bonusgegenstände.

source: Maximal life time of a powerup.
de: Maximale Lebensdauer eines Bonusgegenstandes.

source: Energy amount
de: Energiemenge:

source: Amount of energy a player gets from an energy powerup.
de: Menge an Energie, die ein Spieler von einem Energie-Bonusgegenstand bekommt.

source: Shield amount
de: Schildmenge:

source: Amount of hit points a player gets from a shield powerup.
de: Menge an Trefferpunkten, die ein Spieler von einem Schild-Bonusgegenstand bekommt.

source: Credits and License
de: Danksagungen und Lizenz

source: Program copyright 1999-2000 &Andreas.Zehender; <email>az@azweb.de</email>
de: Programm Copyright 1999-2000 &Andreas.Zehender; <email>az@azweb.de</email>

source: Documentation copyright 2000 &Andreas.Zehender; <email>az@azweb.de</email>
de: Dokumentation Copyright 2000 &Andreas.Zehender; <email>az@azweb.de</email>

source: Documentation updated for &kde; &kappversion; &Mike.McBride; &Mike.McBride.mail;
de: Dokumentation für &kde; &kappversion; von &Mike.McBride; &Mike.McBride.mail; überarbeitet

source: CREDIT_FOR_TRANSLATORS
de: <para>Übersetzung: Maren Pakura <email>maren@kde.org</email></para>

source: Compilation and Installation
de: Kompilierung und Installation
