Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdegames/kspaceduel.po
Languages: de

source: The &kappname; Handbook
de: Das Handbuch zu &kappname;

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Maren</firstname><surname>Pakura</surname><affiliation><address><email>maren@kde.org</email></address></affiliation><contrib>Deutsche Übersetzung</contrib></othercredit>

source: This documentation describes the game of &kappname; version &kappversion;
de: Dieses Handbuch beschreibt das Spiel &kappname; in der Version &kappversion;

source: kdegames
de: KDE-Spiele

source: game
de: Spiel

source: space
de: Leertaste

source: <keyword>war</keyword>
de: <keyword>Krieg</keyword>

source: two players
de: zwei Spieler

source: satellite
de: Satellit

source: starwars
de: Krieg der Sterne

source: wars
de: Krieg

source: Introduction
de: Einführung

source: Gametype:
de: Spieltyp:

source: Number of possible players:
de: Anzahl der Spieler:

source: <para>Two</para>
de: <para>Zwei</para>

source: The idea behind &kappname; is simple, but addictive. Each of two possible players controls a satellite spaceship orbiting the sun. As the game progresses players have to eliminate opponent's spacecraft. As soon as the opponent's satellite is destroyed, the remaining player wins the round.
de: &kappname; ist ein einfaches, aber süchtig machendes Spiel. Jeder der maximal zwei Spieler steuert ein Satellitenraumschiff auf einer Umlaufbahn um die Sonne. Im Spiel müssen die Spieler das gegnerische Raumschiff zerstören, um die Runde zu gewinnen.

source: How to Play
de: Spielanleitung

source: Objective:
de: Ziel des Spiels:

source: Destroy the opponent's satellite, while keeping the own one in tact.
de: Zerstören Sie das Schiff Ihres Gegners, ehe er Ihr Schiff zerstört.

source: &kappname; loads directly into the game mode; however, the action does not start until either player makes the first move.
de: Nach dem Start von &kappname; können Sie sofort beginnen, Ihre ersten Aktion startet ein Spiel.

source: Note:
de: Hinweis:

source: If the opponent's satellite is controlled by the built in artificial intelligence, game action does not start until the human player makes the first move.
de: Wenn das gegnerische Raumschiff durch den Computer gesteuert wird, beginnt das Spiel mit der ersten Aktion des menschlichen Spielers.

source: In &kappname; you control the ship's rotation, acceleration, and weaponry. Your satellite is constantly drawn towards the sun by gravity. You have to adjust the rotation and acceleration of your ship to make it stay on course.
de: In &kappname; steuern Sie die Drehung, Beschleunigung und Bewaffnung Ihres Schiffes. Ihr Satellit wird ständig durch die Anziehungskraft zur Sonne gezogen. Darum müssen sie die Drehung und Beschleunigung Ihres Schiffes so steuern, dass es auf der Umlaufbahn bleibt.

source: Approaching the sun too close causes the satellite to explode.
de: Kommen Sie der Sonne zu nahe, explodiert das Schiff.

source: In the same time you have to monitor the opponent's movement and use your weapons consisting of bullets and mines, to destroy the enemy spacecraft.
de: Gleichzeitig müssen Sie Ihren Gegner beobachten und Ihre Geschosse und Minen abfeuern, um das Raumschiff des Gegners zu zerstören.

source: Your own weapons are as harmful to your satellite as they are to the enemy one.
de: Ihre eigenen Waffen können sowohl Ihr Schiff als auch das Schiff Ihres Gegners beschädigen.

source: Game Rules, Strategies and Tips
de: Spielregeln, Spielstrategien und Tipps

source: &kappname; Game Screen Overview.
de: Spielfeld von &kappname;.

source: <screeninfo>&kappname; game screen</screeninfo>
de: <screeninfo>Hauptfenster von &kappname;</screeninfo>

source: <phrase>&kappname; game screen</phrase>
de: <phrase>Hauptfenster von &kappname;</phrase>

source: The top of the playing area is occupied by the menubar and toolbar.
de: Über dem Spielfeld befindet sich die Menü- und die Werkzeugleiste.

source: The central part of the &kappname; screen is the playing area.
de: In der Mitte des Hauptfensters von &kspaceduel; befindet sich das Spielfeld.

source: On the left and on the right sides of the playing area there are the Red Player's and the Blue Player's information screens.
de: Rechts und links davon befinden sich die Anzeigefelder für den roten und blauen Spieler.

source: The top box on the information screen represents the <quote>Hit Points</quote> of the spacecraft.
de: Im obersten Bereich des Anzeigefelds stehen die <quote>Trefferpunkte</quote> des Schiffes.

source: The middle box on the information screen represents the battery power.
de: Im mittleren Bereich des Anzeigefelds wird die Energie des Schiffes angezeigt.

source: The bottom box on the information screen shows player's number of wins.
de: Im unteren Bereich des Anzeigefelds wird für jeden Spieler die Anzahl der Siege angezeigt.

source: The bottom of the playing area is the status bar.
de: Unter dem Spielfeld befindet sich die Statusleiste.

source: Default Shortcuts
de: Standard-Tastenkürzel

source: The following table contains the default shortcuts for &kappname;.
de: Die folgende Tabelle zeigt die Standard-Tastenbelegung für &kappname;.

source: Action
de: Aktion

source: <entry>Red Player</entry>
de: <entry>Roter Spieler</entry>

source: <entry>Blue Player</entry>
de: <entry>Blauer Spieler</entry>

source: Rotate Left
de: Nach links drehen

source: Left Arrow
de: Pfeil links

source: Rotate Right
de: Nach rechts drehen

source: Right Arrow
de: Pfeil rechts

source: Accelerate
de: Beschleunigen

source: Up Arrow
de: Pfeil hoch

source: Shot
de: Schießen

source: Down Arrow
de: Pfeil runter

source: Mines
de: Mine legen

source: Insert
de: Einfügen

source: To change these keys, please refer to the <link linkend="options-keys">Game Configuration</link> section.
de: Weitere Informationen, um diese Tastenkürzel einzurichten, finden Sie im Abschnitt <link linkend="options-keys">Tasten für Spieler</link>.

source: Rules
de: Spielregeln

source: About Energy Points.
de: Über die Energiemenge.

source: Each player controls one ship.
de: Jeder Spieler steuert ein Schiff.

source: The ships can rotate, accelerate, shoot and set mines.
de: Die Schiffe können sich drehen, beschleunigen, schießen und Minen legen.

source: Each ship has a limited amount of energy required for rotation, acceleration, shooting and setting mines.
de: Jedes Schiff besitzt eine begrenzte Menge an Energie, die für das Drehen, die Beschleunigung, das Schießen und für das Legen von Minen benötigt wird.

source: Each ship has a limited amount of energy.
de: Jedes Schiff hat nur eine begrenzte Menge an Energie.

source: Ships absorb solar energy required for the ship's operation. The amount of energy the ship gets depends on the distance from and the direction to the sun.
de: Schiffe nehmen die für ihre Operationen erforderliche Energie von der Sonne auf. Die aufgenommene Energiemenge hängt von der Entfernung und Ausrichtung zur Sonne ab.

source: A ship gets more energy near the sun and less energy near the border. It gets the full amount of energy if the sun shines directly on the solar panels and less or even no energy if the sun shines at an angle to the panels or at the other side of the panels.
de: Energie bekommen die Raumschiffe durch die Sonne über ihre Solarzellen wieder, abhängig vom Abstand zur Sonne und von der Richtung des Raumschiffes zur Sonne. Ist das Raumschiff in der Nähe der Sonne, bekommt es mehr Energie als an weit entfernten Punkten. Scheint die Sonne direkt auf die Solarzellen, bekommt es die volle Energie, Scheint die Sonne schräg oder seitlich auf die Solarzellen, bekommt es weniger oder gar keine Energie.

source: About Bullets and Mines.
de: Über Geschosse und Minen.

source: Bullets fly around the sun just like a ship does.
de: Die Geschosse kreisen wie die Schiffe um die Sonne.

source: Mines have an amount of energy to stay at the same position. When the energy is spent, the mines collide with the sun and disintegrate.
de: Minen haben eine begrenzte Menge Energie, um ihre Position zu halten. Ist die Energie verbraucht, stürzen sie in die Sonne und zerfallen.

source: The closer to the sun the mine is set, the more energy it needs to stay in place.
de: Je geringer der Abstand der Mine zur Sonne ist, desto mehr Energie braucht sie, um ihre Position zu halten.

source: Mines can be destroyed with bullets.
de: Minen können durch Geschosse zerstört werden.

source: By default each ship has 5 bullets and 3 mines.
de: Jedes Schiff hat 5 Geschosse und 3 Minen.

source: About Hit Points
de: Über Trefferpunkte

source: Collision with own bullets, or enemy bullets or mines decreases the hit points.
de: Kollisionen mit eigenen oder fremden Geschossen oder Minen verringern die Anzahl der Trefferpunkte.

source: If two ships collide then the weaker ship is destroyed and the hit points of the stronger ship are decreased by the amount of the hit points the weaker ship had.
de: Stoßen zwei Raumschiffe zusammen, explodiert das schwächere Schiff, dem stärkeren werden die Trefferpunkte des schwächeren plus einem gewissen Unfallschaden abgezogen.

source: If the satellite's amount of hit points goes to zero then satellite explodes.
de: Ein Satellit ohne Trefferpunkte explodiert.

source: If a satellite collides with the sun it is destroyed regardless of the amount of hit points remaining.
de: Stürzt ein Satellit in die Sonne, wird er zerstört, unabhängig von der Anzahl seiner Trefferpunkte.

source: <title>Powerups</title>
de: <title>Bonusgegenstände</title>

source: From time to time powerups appear on the play field.
de: Von Zeit zu Zeit erscheinen Bonusgegenstände auf dem Bildschirm.

source: There are four different powerups:
de: Es gibt vier verschiedene Bonusgegenstände:

source: The maximum number of mines is increased.
de: Die maximale Anzahl von Minen wird erhöht.

source: <term>Bullet</term>
de: <term>Geschosse</term>

source: The maximum number of bullets is increased.
de: Die maximale Anzahl von Geschossen wird erhöht.

source: Energy (yellow sphere)
de: Energie (gelbe Kugel)

source: Player's energy increases.
de: Der Spieler erhält zusätzliche Energie.

source: Shield (blue sphere)
de: Schild (blaue Kugel)

source: Player's hit points increase.
de: Der Spieler bekommt zusätzliche Trefferpunkte.

source: Menu Items
de: Menüeinträge

source: <shortcut><keycombo action="simul"> &Ctrl;<keycap>N</keycap></keycombo></shortcut> <guimenu>Game</guimenu><guimenuitem>New</guimenuitem>
de: <shortcut><keycombo action="simul"> &Ctrl;<keycap>N</keycap></keycombo></shortcut> <guimenu>Spiel</guimenu><guimenuitem>Neu</guimenuitem>

source: Starts a new game of &kappname;.
de: Startet ein neues Spiel &kappname;.

source: <shortcut><keycombo action="simul"> &Ctrl;<keycap>R</keycap></keycombo></shortcut> <guimenu>Game</guimenu><guimenuitem>New Round</guimenuitem>
de: <shortcut><keycombo action="simul"> &Ctrl;<keycap>R</keycap></keycombo></shortcut> <guimenu>Spiel</guimenu><guimenuitem>Neue Runde</guimenuitem>

source: Starts a new round, at the current level.
de: Startet eine neue Runde im aktuellen Schwierigkeitsgrad.

source: <shortcut><keycombo action="simul"><keycap>P</keycap></keycombo></shortcut> <guimenu>Game</guimenu><guimenuitem>Pause</guimenuitem>
de: <shortcut><keycombo action="simul"> <keycap>P</keycap></keycombo></shortcut> <guimenu>Spiel</guimenu><guimenuitem>Pause</guimenuitem>

source: Pauses and unpauses the game.
de: Hält das Spiel an oder setzt es fort.

source: <shortcut> <keycombo action="simul">&Ctrl; <keycap>Q</keycap></keycombo></shortcut> <guimenu>Game</guimenu><guimenuitem>Quit</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo></shortcut> <guimenu>Spiel</guimenu><guimenuitem>Beenden</guimenuitem>

source: <action>Quits</action> &kappname;
de: <action>Beendet</action> &kappname;

source: <guimenu>Settings</guimenu> <guimenuitem>Configure &kappname;...</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>&kappname; einrichten ...</guimenuitem>

source: Opens a configuration dialog which lets you define many settings of the game, refer to the chapter <link linkend="configuration">Game Options</link> for further information.
de: Öffnet einen Einrichtungsdialog, in dem viele Einstellungen für das Spiel vorgenommen werden können. Weitere Informationen finden Sie im Kapitel <link linkend="configuration">Spieleinstellungen</link>.

source: Additionally &kspaceduel; has the common &kde; <guimenu>Settings</guimenu> and <guimenu>Help</guimenu> menu items, for more information read the sections about the <ulink url="help:/fundamentals/ui.html#menus-settings">Settings Menu</ulink> and <ulink url="help:/fundamentals/ui.html#menus-help">Help Menu</ulink> of the &kde; Fundamentals.
de: Zusätzlich hat &kspaceduel; die bekannten &kde;-Einträge im Menü <guimenu>Einstellungen</guimenu> und <guimenu>Hilfe</guimenu>, weitere Informationen dazu finden Sie in den Abschnitten über die Menüs <ulink url="help:/fundamentals/ui.html#menus-settings">Einstellungen</ulink> und <ulink url="help:/fundamentals/uihtml#menus-help">Hilfe</ulink> der &kde;-Grundlagen.

source: Frequently asked questions
de: Häufig gestellte Fragen

source: I want to change the way this game looks. Can I?
de: Kann ich das Erscheinungsbild des Spiels ändern?

source: No. At this moment &kappname; features only one theme.
de: Nein, zurzeit hat &kappname; nur ein Design.

source: I have made a mistake. Can I undo?
de: Ich habe einen Fehler gemacht. Kann ich einen Spielzug zurücknehmen?

source: No. &kappname; does not have an <quote>Undo</quote> feature.
de: Nein, in &kappname; können Sie keine Spielzüge zurücknehmen.

source: I cannot figure out what to do here! Are there hints?
de: Ich komme im Spiel nicht weiter, gibt es Tipps?

source: No. &kappname; does not have a <quote>Hint</quote> feature. However, if you carefully read through the <link linkend="rules_and_tips">Game Rules, Strategies and Tips</link> section you shouldn't have this problem.
de: Nein, in &kappname; gibt es keine Tipps. Im Kapitel <link linkend="rules_and_tips">Spielregeln, Spielstrategien und Tipps</link> finden Sie jedoch viele Hinweise zum Spiel.

source: I have to quit the game now, but I am not finished yet. Can I save my progress?
de: Ich muss das Spiel unterbrechen, kann ich den aktuellen Spielstand speichern?

source: No. &kappname; does not have a <quote>Save</quote> feature.
de: Nein, in &kappname; kann der aktuelle Spielstand nicht gespeichert werden.

source: Game Configuration
de: Einstellungen für das Spiel

source: Game Keys
de: Tasten für die Spielsteuerung

source: &kappname; has a default set of keys to control the game. For a list of default keys see the section entitled <link linkend="keys">Default Shortcuts</link>.
de: &kappname; hat Standardtasten für die Spielsteuerung. Eine genaue Liste finden Sie unter <link linkend="keys">Standard-Tastenbelegungen</link>.

source: Keys can be configured by selecting <menuchoice> <guimenu>Settings</guimenu><guimenuitem>Configure Shortcuts...</guimenuitem> </menuchoice> from the menubar.
de: Zur Änderung dieser Standardtasten wählen Sie <menuchoice> <guimenu>Einstellungen</guimenu><guimenuitem>Kurzbefehle festlegen ...</guimenuitem> </menuchoice> in der Menüleiste.

source: This will bring up a dialog box which lets you configure all hotkeys, including the keys used for steering the space ships, for firing bullets, and for laying mines.
de: Dann wird ein Dialog angezeigt, in dem Sie alle Tastaturkurzbefehle einschließlich der Tasten zur Steuerung des Raumschiffs, zum Abfeuern von Geschossen und zum Legen von Minen festlegen kann.

source: You can see that each player (Red and Blue), has 5 keystrokes corresponding to Rotate Left, Rotate Right, Accelerate, Shot, and Mines.
de: Jeder Spieler hat 5 Tasten zum Drehen nach links und rechts, Beschleunigen, Schießen und Minenlegen.

source: When you are finished configuring your keys, you should click on <guibutton>OK</guibutton> to apply your changes.
de: Nachdem Sie alle Einstellungen angepasst haben, klicken sie auf <guibutton>OK</guibutton>, um die Änderungen zu bestätigen.

source: If you want to restore the default keys, simply click on the <guibutton>Default</guibutton> button once. To make these changes permanent, press <guibutton>OK</guibutton>.
de: Um die Standardeinstellungen wiederherzustellen, klicken Sie auf <guibutton>Voreinstellungen</guibutton>, dann auf <guibutton>OK</guibutton>, um zu speichern.

source: If you want to abandon the changes you made, and return to your previously selected keys, simply click <guibutton>Cancel</guibutton>, and your changes will be lost.
de: Wenn Sie die Änderungen rückgängig machen wollen, klicken Sie auf <guibutton>Abbrechen</guibutton>, um ihre Änderungen zu verwerfen.

source: All game settings of &kappname; are configurable.
de: Alle Parameter von &kappname; sind einstellbar.

source: If you want to change the game settings, simply select <menuchoice><guimenu>Settings</guimenu><guimenuitem>Configure &kappname;...</guimenuitem></menuchoice> from the menubar.
de: Die Parameter des Spiels sind unter dem Menüpunkt <menuchoice> <guimenu>Einstellungen</guimenu><guimenuitem>&kappname; einrichten ...</guimenuitem> </menuchoice> einstellbar.

source: This will bring up a dialog box with two pages, labelled <guilabel>General</guilabel> and <guilabel>Game</guilabel>. The first page is rather simple, the second one has seven tabs across the top.
de: Der Dialog enthält zwei Seiten; <guilabel>Allgemein</guilabel> und <guilabel>Spiel</guilabel>. Die erste Seite enthält nur einige Funktionen. Auf der zweiten Seite sehen Sie oben sieben Karteireiter.

source: Settings are collected in different configurations. You can choose from several pre-defined configurations.
de: Die Einstellungen sind in verschiedenen Konfigurationen zusammengefasst. Sie können aus einigen vordefinierten Konfigurationen auswählen.

source: If you choose the <guilabel>Custom</guilabel> configuration, you can define all settings for yourself.
de: Wenn Sie die Konfiguration <guilabel>Benutzerdefiniert</guilabel> wählen, können Sie alle Parameter selbst verändern.

source: If you have not selected <guilabel>Custom</guilabel>, you will not be able to make any changes to these options.
de: Wenn Sie nicht die Konfiguration <guilabel>Benutzerdefiniert</guilabel> gewählt haben, können Sie keine dieser Optionen verändern.

source: If you have found an interesting configuration, mail it to the author of the game. It can be implemented in a future version (send the part [Game] in the file <filename>~/.kde/share/config/kspaceduelrc</filename>).
de: Haben Sie eine interessante Konfiguration gefunden, können Sie diese an den Autor des Spiels senden. Diese kann dann zu zukünftigen Versionen des Spiels hinzugefügt werden (Senden Sie den Abschnitt [Game] in der Datei <quote><filename>~/.kde/share/config/kspaceduelrc</filename></quote>).

source: When you are finished altering the options, you should click on <guibutton>OK</guibutton> to apply your changes.
de: Nachdem Sie alle Einstellungen angepasst haben, klicken sie auf <guibutton>OK</guibutton>, um die Änderungen zu bestätigen.

source: If you want to restore the default, simply click on the <guibutton>Default</guibutton> button once. To make these changes permanent, press <guibutton>OK</guibutton>.
de: Um die Standardeinstellungen wiederherzustellen, klicken sie auf <guibutton>Voreinstellungen</guibutton>. Drücken Sie auf <guibutton>OK</guibutton>, um die Änderungen zu übernehmen und den Dialog gleichzeitig zu schließen.

source: If you want to abandon the changes you made, and return to your previous options, simply click <guibutton>Cancel</guibutton>, and your changes will be lost.
de: Wenn Sie die Änderungen rückgängig machen wollen, klicken Sie auf <guibutton>Abbrechen</guibutton>, um ihre Änderungen zu verwerfen.

source: The settings are:
de: Die Einstellungen sind im Einzelnen:

source: General
de: Allgemein

source: Hit Points
de: Trefferpunkte

source: These two sliders allow you to define the hitpoints for each of the two players; you might want to decrease the hitpoints for a player to give that player a handycap.
de: Mit den beiden Schiebereglern können Sie Trefferpunkte für jeden der beiden Spieler definieren, um &eg; die Punkte eines Spielers zu verringern, um ihm ein Handicap zu geben.

source: Refresh time
de: Bildaufbauzeit:

source: Time between two screen refreshes in milliseconds. All other settings are independent of the refresh time.
de: Dauer eines Bildaufbaus in ms. Alle Spielparameter sind unabhängig von der Bildaufbauzeit.

source: <guilabel>Red Player</guilabel>
de: <guilabel>Roter Spieler</guilabel>

source: Here you can define whether the red player gets controlled by the AI, and also choose the skill level of the AI for this player. Just experiment with the different skill level to find one which fits you.
de: Hier können Sie für den über KI gesteuerten roten Spieler festlegen, mit welchem Können er zu Werke geht. Experimentieren Sie mit verschiedenen Einstellungen, um die passende zu finden.

source: <guilabel>Blue Player</guilabel>
de: <guilabel>Blauer Spieler</guilabel>

source: This works the same as the options for the <guilabel>Red Player</guilabel> described above.
de: Diese Einstellungen entsprechen denen des <guilabel>Roten Spielers</guilabel>.

source: Game
de: Spiel

source: Game speed
de: Spielgeschwindigkeit:

source: Controls the speed of the whole game.
de: Regelt die Geschwindigkeit des gesamten Spiels.

source: <guilabel>Bullet</guilabel>
de: <guilabel>Geschoss</guilabel>

source: Shot speed
de: Schussgeschwindigkeit:

source: The speed of bullets
de: Abschussgeschwindigkeit der Geschosse

source: Energy need
de: Energieverbrauch:

source: The amount of energy needed for one shot.
de: Benötigte Energie für einen Schuss.

source: Max number
de: Maximale Anzahl:

source: The maximum number of bullets a player can have on the screen.
de: Maximale Anzahl der Geschosse je Spieler auf dem Bildschirm.

source: Damage
de: Schaden:

source: The number of hit points damage done when a bullet hits a ship.
de: Schadenspunkte beim Treffer durch Geschosse.

source: Life time
de: Lebensdauer:

source: The maximum life time of a bullet.
de: Maximale Lebensdauer eines Geschosses.

source: Reload time
de: Ladezeit:

source: The time a ship needs to reload a bullet.
de: Zeit die ein Schiff zum Nachladen eines Geschosses benötigt.

source: Mine fuel
de: Minentreibstoff:

source: The amount of fuel on a mine.
de: Energievorrat der Mine.

source: The amount of energy needed for laying a mine.
de: Benötigte Energie für das Legen einer Mine.

source: Activate time
de: Aktivierungszeit:

source: The time a mine is inactive.
de: Zeit bis eine Mine aktiv wird.

source: The number of hit points of damage done when a ship hits a mine.
de: Schaden beim Treffer.

source: Maximum number of mines a player can have on the screen.
de: Maximale Anzahl Minen je Spieler auf dem Bildschirm.

source: The time a ship needs to reload a mine.
de: Zeit die ein Schiff zum Nachladen einer Mine benötigt.

source: Ship
de: Schiff

source: Acceleration
de: Beschleunigung:

source: Acceleration of the ships
de: Beschleunigung der Schiffe.

source: The energy needed to accelerate a ship.
de: Energieverbrauch beim Beschleunigen.

source: Rotation speed
de: Drehgeschwindigkeit:

source: The speed at which a ship rotates.
de: Geschwindigkeit mit der Schiffe sich drehen.

source: The energy needed to rotate a ship.
de: Energieverbrauch beim Drehen.

source: Crash damage
de: Schaden bei Zusammenstoß:

source: The number of hit points damage done when two ships collide.
de: Schaden beim Zusammenstoß beider Schiffe.

source: <guilabel>Sun</guilabel>
de: <guilabel>Sonne</guilabel>

source: Sun energy
de: Sonnenenergie:
