Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdegames/ksquares.po
Languages: de

source: The &ksquares; Handbook
de: Das Handbuch zu &ksquares;

source: Reviewer
de: Korrektur

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Burkhard</firstname><surname>Lück</surname><affiliation><address><email>lueck@hube-lueck.de</email></address></affiliation><contrib>Übersetzung</contrib></othercredit>

source: This documentation describes the game of &ksquares; version &kappversion;
de: Dieses Handbuch beschreibt das Spiel &ksquares; in der Version &kappversion;

source: game
de: Spiel

source: board
de: Brettspiel

source: Dots and Boxes
de: Punkte und Kästchen

source: Boxes
de: Kästchen

source: Squares
de: Quadrate

source: four players
de: vier Spieler

source: Paddocks
de: Karree

source: Square-it
de: quadratisch

source: Dots and Dashes
de: Punkte und Striche

source: Dot Game
de: Punktspiel

source: Introduction
de: Einführung

source: Gametype:
de: Spieltyp:

source: Board
de: Brettspiel

source: Number of possible players:
de: Anzahl der Spieler:

source: Four
de: vier

source: &ksquares; is a fun and exciting game for &kde; desktop environment. &ksquares; is modeled after the well known pen and paper based game of Dots and Boxes.
de: &ksquares; ist ein lustiges und aufregendes Spiel für &kde;. Es ist an das bekannte <quote>Papier und Stift</quote>-Spiel Käsekästchen angelehnt.

source: The idea behind &ksquares; is to construct squares by interconnecting the dots on the grid. Up to four players can play this game together, taking turns. The trick is – regardless of who has constructed most of the square, it is the player who completes the square that gets the point for it.
de: Die Idee hinter &ksquares; ist, durch Verbinden der Punkte in dem Raster Quadrate zu erzeugen. Bis zu vier Spieler können an einem Spiel teilnehmen.Der Spieler, der ein Quadrat vollendet, bekommt die Punkte; egal, wer die meisten Striche für ein Quadrat gezeichnet hat.

source: To win the game round player has to collect the most points by covering the most area with the squares of player's own color.
de: Um das Spiel zu gewinnen, muss der Spieler die meisten Punkte sammeln, indem er den größten Teil des Spielfeldes mit seiner eigenen Farbe ausfüllt.

source: How to Play
de: Spielanleitung

source: Objective:
de: Ziel des Spiels:

source: Complete more squares than any of your opponents.
de: Malen Sie mehr Kästchen als Ihr Gegner.

source: At the start of the game, the game board is empty. There is simply a grid of dots showing where lines can be drawn.
de: Nach dem Start des Programms ist das Spielfeld leer. Es wird nur ein Gitter aus Punkten angezeigt, in dem Sie Linien zeichnen können.

source: Note:
de: Hinweis:

source: Depending on the game difficulty chosen, the game field may already contain lines at the beginning of the game round.
de: Abhängig vom Schwierigkeitsgrad kann das Spielfeld bereits zu Beginn einige Linien enthalten.

source: Each player takes it in turns to draw a line between two adjacent dots on the board. By hovering the mouse over the game board, a yellow indicator line will show you where your line will be placed when you click. Once you have decided where you want to draw your line, click - and the line will be drawn. If by drawing a line, you completed a square then this square now belongs to you and earns you a point. Each time you complete a square, you must draw another line. If your line did not complete a square then the next player(s) take their turn. The game will continue until every square on the board is owned by one of the players.
de: Jeder Spieler muss der Reihe nach einen Strich zwischen zwei benachbarten Punkten zeichnen. Wenn Sie mit dem Mauszeiger über das Spielfeld fahren, wird eine gelbe Linie angezeigt, wo bei einem Mausklick Ihre Linie gesetzt würde. Entscheiden Sie, wo Sie Ihre Linie zeichnen möchten und klicken Sie mit der &LMBn;. Wenn Sie mit Ihrer Linie ein Quadrat vollendet haben, gehört dieses Quadrat nun Ihnen und Sie bekommen einen Punkt. Nach Vollendung eines Quadrats sind Sie erneut am Zug. Vollendet Ihre Linie kein Quadrat, ist der nächste Spieler an der Reihe. Das Spiel wird fortgesetzt, bis jedes Quadrat auf dem Spielfeld einem der Spieler gehört.

source: To start a new game with custom settings (number of players, player names, board size) click on the <guibutton>New</guibutton> toolbar button or go to <menuchoice><shortcut><keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo></shortcut><guimenu>Game</guimenu><guimenuitem>New</guimenuitem></menuchoice>. To start a new game with the same settings as the current game, click on <guibutton>Restart Game</guibutton> on the toolbar.
de: Um ein Spiel mit geänderten Einstellungen (Anzahl und Namen der Spieler,Größe des Spielfelds) zu starten, klicken Sie auf <guibutton>Neu</guibutton> in der Werkzeugleiste oder wählen Sie im Menü <menuchoice><shortcut><keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo></shortcut><guimenu>Spiel</guimenu><guimenuitem>Neu</guimenuitem></menuchoice>. Um noch einmal mit den gleichen Einstellungen zu spielen, klicken Sie in der Werkzeugleiste auf <guibutton>Spiel neu starten</guibutton>.

source: Game Rules, Strategies and Tips
de: Spielregeln, Spielstrategien und Tipps

source: Game Rules
de: Spielregeln

source: There is very little to be said when it come to the rules, as the game concept in itself is rather a simple one. Nevertheless, here are the game regulations you, as a player will defiantly face while playing &ksquares;:
de: Zu den Regeln gibt es nicht viel zu sagen, da das Spielkonzept selbst sehr einfach ist. Trotzdem erhalten Sie hier einen kurzen Überblick über die Spielregeln von &ksquares;, an die Sie sich halten müssen:

source: You may only connect the dots on the grid if they are not previously connected by you, your opponent, or the computer.
de: Sie können Punkte nur dann verbinden, wenn sie noch nicht von Ihnen oder einem der anderen Spieler verbunden wurden.

source: To gain the points you have to connect the dots to form a square.
de: Um Punkte zu erhalten, müssen Sie die Punkte so verbinden, dass sie Quadrate bilden.

source: The square can be no larger than the four adjacent dots on the grid allow for.
de: Ein Quadrat kann nicht größer sein als die viel benachbarten Punkte auf dem Raster es zulassen.

source: Once a square is complete the player who draws the last line of that square is granted the right of possession over it. The square then is colored and the player is given a point.
de: Ist ein Quadrat vollendet, geht dieses in den Besitz des Spielers über, der den letzten Strich gesetzt hat. Das Quadrat ist nun farbig und der Spieler erhält einen Punkt.

source: The player who completes the square is given an extra turn which the player cannot forfeit.
de: Der Spieler erhält bei Vollendung eines Quadrats einen zusätzlichen Zug, den er nicht überspringen kann.

source: Strategies and Tips
de: Spielstrategien und Tipps

source: Try not to play at random. Such game practice will most certainly result in loss.
de: Setzen Sie Ihre Striche nicht einfach zufällig. So verlieren Sie sehr wahrscheinlich das Spiel.

source: Construct long chains of lines over the gameboard. Once one such chain is complete start to build another one going parallel to the first.
de: Errichten Sie lange Linienketten über das Spielfeld. Malen Sie weitere Linien parallel zu diesen.

source: Try not to build contraptions where only one line remains undone. Your opponent will almost certainly take an advantage of it.
de: Vermeiden Sie, Striche an Feldern zu setzen, an denen danach nur noch ein Strich fehlt. Ihr Gegner wird davon profitieren.

source: If you are to let the opponent get a square or more, try to select the combination resulting in the least damage.
de: Wenn Sie Ihrem Gegner einige Felder überlassen müssen, versuchen Sie diese so zu wählen, dass am wenigsten Schaden entsteht.

source: Try to push your opponent into the situation where he/she(it) will have no choice but to let you get the square.
de: Versuchen Sie Ihren Gegner in die Situation zu bringen, dass er keine Wahl hat, als Ihnen Felder zu überlassen.

source: If you are to get a chance to start completing a whole chain of squares, remember that by leaving two squares at the end of such chain incomplete you are pushing your opponent into completing them, thus giving you the opportunity to continue onto yet another chain. Such a situation is called the double-cross.
de: Wenn Sie die Chance haben, eine ganze Reihe von Feldern zu vollenden, können Sie am Ende einer solchen Reihe zwei Felder unvollständig belassen und so Ihren Gegner dazu verleiten, diese zu vollenden. Sie können dann an einer anderen Kette weiter arbeiten. Dieser Spielzug heißt Doppelkreuz.

source: Menu Items
de: Menüeinträge

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo> </shortcut> <guimenu>Game</guimenu> <guimenuitem>New</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo> </shortcut> <guimenu>Spiel</guimenu> <guimenuitem>Neu</guimenuitem>

source: Start a new game
de: Startet ein neues Spiel.

source: <shortcut><keycap>F5</keycap></shortcut> <guimenu>Game</guimenu><guimenuitem>Restart Game</guimenuitem>
de: <shortcut><keycap>F5</keycap></shortcut> <guimenu>Spiel</guimenu> <guimenuitem>Spiel neu starten</guimenuitem>

source: Starts a new game with the same settings as the current game.
de: Startet ein neues Spiel mit den aktuellen Einstellungen.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>H</keycap></keycombo> </shortcut> <guimenu>Game</guimenu> <guimenuitem>Show High Scores</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>H</keycap></keycombo> </shortcut> <guimenu>Spiel</guimenu> <guimenuitem>Bestenliste anzeigen</guimenuitem>

source: <action>Displays</action> the high score table
de: <action>Zeigt</action> die Bestenliste an.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo> </shortcut> <guimenu>Game</guimenu> <guimenuitem>Quit</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo> </shortcut> <guimenu>Spiel</guimenu> <guimenuitem>Beenden</guimenuitem>

source: <action>Quits</action> &ksquares;
de: <action>Beendet</action> &ksquares;.

source: <guimenu>Settings</guimenu> <guimenuitem>Configure &ksquares;...</guimenuitem>
de: <guimenu>Einstellungen</guimenu><guimenuitem>&ksquares; einrichten ...</guimenuitem>

source: <action>Opens a dialog to configure &ksquares;.</action> See <link linkend="configuration">Game Configuration</link> section for details.
de: <action>Öffnet einen Dialog zur Einrichtung von &ksquares;.</action> Weitere Einzelheiten finde Sie unter <link linkend="configuration">Spieleinstellungen</link>.

source: Additionally &ksquares; has the common &kde; <guimenu>Settings</guimenu> and <guimenu>Help</guimenu> menu items, for more information read the sections about the <ulink url="help:/fundamentals/ui.html#menus-settings">Settings Menu</ulink> and <ulink url="help:/fundamentals/ui.html#menus-help">Help Menu</ulink> of the &kde; Fundamentals.
de: Zusätzlich hat &ksquares; die bekannten &kde;-Einträge im Menü <guimenu>Einstellungen</guimenu> und <guimenu>Hilfe</guimenu>, weitere Informationen dazu finden Sie in den Abschnitten über die Menüs <ulink url="help:/fundamentals/ui.html#menus-settings">Einstellungen</ulink> und <ulink url="help:/fundamentals/uihtml#menus-help">Hilfe</ulink> der &kde;-Grundlagen.

source: Frequently asked questions
de: Häufig gestellte Fragen

source: I want to change the way this game looks. Can I?
de: Kann ich das Erscheinungsbild des Spiels ändern?

source: Currently the only thing you can change about the game look is the color of the lines. To do so use <menuchoice><guimenu>Settings</guimenu><guimenuitem>Configure &ksquares;...</guimenuitem></menuchoice> on the menubar. See <link linkend="configuration">Game Configuration</link> section for details.
de: In dieser Version des Spiels können Sie nur die Farbe der Linien ändern. Wählen Sie dazu in der Menüleiste <menuchoice><guimenu>Einstellungen</guimenu><guimenuitem>&ksquares; einrichten ...</guimenuitem></menuchoice>. Weitere Einzelheiten finden Sie im Kapitel <link linkend="configuration">Spieleinstellungen</link>.

source: I have made a mistake. Can I undo?
de: Ich habe einen Fehler gemacht. Kann ich einen Spielzug zurücknehmen?

source: No. &ksquares; doesn't currently have an <quote>Undo</quote> feature.
de: Nein, in &ksquares; können Sie keine Spielzüge zurücknehmen.

source: Can I use the keyboard to play the game?
de: Kann ich mit der Tastatur spielen?

source: No. &ksquares; cannot be played using keyboard.
de: Nein, &ksquares; kann nicht mit der Tastatur gespielt werden.

source: I cannot figure out what to do here! Are there hints?
de: Ich komme im Spiel nicht weiter, gibt es Tipps?

source: No. There is no <quote>Hint</quote> feature implemented yet.
de: Nein, in diesem Spiel gibt es noch keine Tipps.

source: I have to quit the game now, but I am not finished yet. Can I save my progress?
de: Ich muss das Spiel unterbrechen, kann ich den aktuellen Spielstand speichern?

source: &ksquares; does not have a saving feature.
de: Nein, in &ksquares; kann der aktuelle Spielstand nicht gespeichert werden.

source: Game Configuration
de: Einstellungen für das Spiel

source: New Game Dialog
de: Dialog Neues Spiel

source: The <guilabel>New Game</guilabel> dialog consistes of the following groupboxes:
de: Im Dialog <guilabel>Neues Spiel</guilabel> finden Sie folgende Einstellungen:

source: Players
de: Spieler

source: Here you can change the number of participating players, as well as determine who will be played by human and who by the artificial intelligence. Use the <guilabel>Number of players</guilabel> selection box to specify the number of participants. Then type a name for each participant and use the check box to specify the player type.
de: Stellen Sie hier die Anzahl der Teilnehmer ein. Wählen Sie auch, ob der Spieler von einem menschlichen Gegner oder dem Computer gespielt wird. Im Auswahlfeld <guilabel>Anzahl der Spieler</guilabel> stellen Sie die Zahl der Teilnehmer ein. Geben Sie für jeden Teilnehmer einen Namen ein und wählen Sie mit dem Ankreuzfeld den Spieler-Typ.

source: Game Board
de: Spielfeld

source: Here you can regulate the size of the game board. Use the <guilabel>Width</guilabel> and <guilabel>Height</guilabel> selection boxes to change the width and height of the game board.
de: Hier stellen Sie die Größe des Spielfeldes ein. Verwenden Sie die Auswahlfelder <guilabel>Breite</guilabel> und <guilabel>Höhe</guilabel> um die Breite und die Höhe zu verändern.

source: Game Settings
de: Spieleinstellungen

source: This part of the configuration dialog regulates the difficulty of the game. If you leave the <guilabel>Quick start</guilabel> check box unchecked - the game will begin with the empty grid. Otherwise the game will start with the game board partially filled.
de: Dieser Teil des Einrichtungsdialogs steuert den Schwierigkeitsgrad des Spiels. Wenn Sie das Ankreuzfeld <guilabel>Schnellstart</guilabel> deaktiviert lassen, beginnt das Spiel mit einem leeren Raster. Aktivieren Sie sie, um mit einem teilweise gefüllten Raster zu beginnen.

source: Configuration Dialog
de: Einrichtungsdialog

source: The <guilabel>Configure - &ksquares;</guilabel> dialog consists of the following tabs:
de: Der Dialog <guilabel>Einrichten - &ksquares;</guilabel> enthält folgende Unterfenster:

source: Display
de: Anzeige

source: Here you can change the &ksquares; color settings.
de: Hier können Sie die Farben für &ksquares; einstellen.

source: Computer Player
de: Computerspieler

source: Use this tab to regulate the game difficulty.
de: Wählen Sie hier die Spielstärke des Gegners.

source: Credits and License
de: Danksagungen und Lizenz

source: Program copyright 2006 Matt Williams <email>matt@milliams.com</email>
de: Programm Copyright 2006 Matt Williams <email>matt@milliams.com</email>

source: Documentation Copyright &copy; 2006 Matt Williams <email>matt@milliams.com</email>
de: Dokumentation Copyright &copy; 2006 Matt Williams <email>matt@milliams.com</email>

source: CREDIT_FOR_TRANSLATORS
de: <para>Übersetzung Burkhard Lück<email>lueck@hube-lueck.de</email></para>

source: Compilation and Installation
de: Kompilierung und Installation
