Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdegames/ksudoku.po
Languages: de

source: The &kappname; Handbook
de: Das Handbuch zu &kappname;

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Burkhard</firstname><surname>Lück</surname><affiliation><address><email>lueck@hube-lueck.de</email></address></affiliation><contrib>Übersetzung</contrib></othercredit><othercredit role="translator"><firstname>Johannes</firstname><surname>Obermayr</surname><affiliation><address><email>johannesobermayr@gmx.de</email></address></affiliation><contrib>Überarbeitung der Übersetzung</contrib></othercredit>

source: This documentation describes the game of &kappname;, a logic-based symbol placement puzzle.
de: Dieses Handbuch beschreibt &kappname;, ein Logikspiel, bei dem Symbole (Zahlen) in einer bestimmten Reihenfolge angeordnet werden müssen.

source: kdegames
de: KDE-Spiele

source: game
de: Spiel

source: logic
de: Logik

source: board
de: Brettspiel

source: one player
de: Ein Spieler

source: puzzle
de: Rätsel

source: Introduction
de: Einführung

source: Gametype:
de: Spieltyp:

source: Logic, Board
de: Logikspiel, Brettspiel

source: Number of possible players:
de: Anzahl der Spieler:

source: <para>One</para>
de: <para>Einer</para>

source: &kappname; is a logic-based symbol placement puzzle.
de: &kappname; ist ein Logikspiel, bei dem Symbole (Zahlen) in einer bestimmten Reihenfolge angeordnet werden müssen.

source: The player has to fill a grid with symbols so that each column, row and block on the game board contains only one instance of each symbol. In &kappname; the symbols are usually the numbers 1 to 9, but may be the letters A to P or A to Y in larger puzzles. Puzzles start with the board partially filled and it is your job to fill in the rest.
de: Der Spieler muss ein Gitter mit Symbolen füllen, so dass jedes Symbol in jeder Reihe, jeder Spalte und jedem Block nur einmal vorkommt. In &kappname; werden normalerweise die Zahlen 1 bis 9 als Symbole benutzt, in größeren Sudokus aber auch A bis P oder A bis Y. Ein Spiel beginnt mit einem teilweise ausgefüllten Spielfeld, Ihre Aufgabe ist es die noch freien Felder auszufüllen.

source: When you start a game, you can choose from several Sudoku types and sizes. You can then have &kappname; generate a puzzle for you to solve or you can start with an empty board and enter in a puzzle from another source, such as a newspaper, then get &kappname; to check it and maybe solve it.
de: Wenn Sie ein Spiel starten, können Sie aus mehreren Arten und Größen von Sudokus auswählen. Sie können sich von &kappname; ein Spiel generieren lassen oder mit einem leeren Spielfeld starten und ein Sudoku aus einer anderen Quelle wie zum Beispiel einer Zeitung eingeben. Lassen Sie Ihre Eingabe dann von &kappname; überprüfen und lösen Sie das Sudoku.

source: There are many variations of Sudoku in existence and &kappname; provides a good selection of them. The most common variant has a 9x9 square grid and uses Arabic numerals 1 to 9 as symbols. The grid has 9 rows and 9 columns and is divided into 9 blocks of 3x3 squares. The problem is – each symbol can only be used once per row, column or block.
de: Es gibt viele verschiedene Spielweisen von Sudoku und &kappname; bietet eine große Auswahl davon. Die meist gespielte Variante des Spiels ist ein quadratisches Gitter mit 9 x 9 Zellen und arabischen Zahlen als Symbole. Das Gitter hat 9 Zeilen und 9 Spalten und ist zusätzlich Blöcke mit Quadraten von 3 x 3 Zellen unterteilt. Das Problem hierbei ist, dass jedes Symbol in jeder Zeile, Spalte und jedem Block nur einmal vorkommen darf.

source: It takes time and concentration to complete a game. However, solving Sudoku puzzles helps to increase overall brain activity and therefore is highly recommended.
de: Die Lösung eines Spiels nimmt Zeit und Konzentration in Anspruch. Jedoch hilft das Lösen der Sudoku-Rätsel die allgemeine Gehirnaktivität zu steigern und ist daher sehr empfehlenswert.

source: How to Play
de: Spielanleitung

source: Objective:
de: Spielziel:

source: Fill the grid so that each column, row and block contains only one instance of each symbol.
de: Die Gitter sind so zu füllen, dass in jeder Spalte, Zeile und jedem Block des Spielfelds ein Symbol nur einmal vorkommt.

source: When the game starts you are prompted to choose which game type and board size you are interested in. You can enter in a puzzle from another source or have &kappname; generate a puzzle. The generator has several difficulty settings and some symmetry settings, which affect the pattern in which the puzzle is generated. Your game experience will depend on which of all these options you choose.
de: Wenn das Spiel beginnt, können Sie die Art und Größe des Sudokus auswählen. Sie können ein Sudoku aus einer anderen Quelle eingeben oder sich durch &kappname; ein Spiel generieren lassen. Der Generator hat Einstellungen für mehrere Schwierigkeitsgrade und einige Symmetrien, die das generierte Sudoku festlegen. Ihr Spielspaß wird durch alle diese Einstellungen beeinflusst.

source: When the puzzle board appears, take a look at the left hand side. There is a selection list which contains all the symbols available in the current game. The set of symbols depends on the size of game you choose. Games may have 4, 9, 16 or 25 symbols. The first two sets use the numbers 1 to 4 or 1 to 9: the others use the letters A to P or A to Y.
de: Beim Spielbeginn sehen Sie auf der linken Seite eine Auswahlliste aller für das aktuell verfügbare Spiel. Diese Liste der Symbole hängt ab von der Größe des ausgewählten Spiels. Spiele können 4, 9, 16 oder 25 Symbole enthalten. Die zwei zuerst genannten Spiele benutzen die Symbole von 1 bis 4 oder 1 bis 9 und die anderen die Buchstaben A bis P oder A bis Y.

source: First, note the boundaries in the game board. The thick lines outline the blocks. Each of these blocks has to be completed using the symbols available and each symbol must be used once and only once within the block. The same is true of the rows and columns in the board.
de: Zuerst sind die Grenzen des Spielfeldes zu beachten. Die dicken schwarzen Linien kennzeichnen die Blöcke. Jeder dieser Blöcke muss mit allen verfügbaren Symbolen so gefüllt werden, dass jedes Symbol nur einmal darin vorkommt. Das gleiche gilt für alle Zeilen und Spalten des Spielfelds.

source: Now you can start entering symbols into the vacant squares on the board. To do that, select the symbol you wish to enter from the selection list on the left, then use the mouse to click on a vacant square in the board. Alternatively, you can hover with the mouse over a vacant square or use the cursor keys to move around, then use the keyboard to enter a symbol.
de: Nun können die freien Zellen des Spielfeldes mit den Symbolen gefüllt werden. Dazu wählen Sie das gewünschte Symbol in der Auswahlliste auf der linken Seite und klicken dann auf die gewünschte freie Zelle im Spielfeld mit der linken Maustaste. Zusätzlich können Sie auch den Mauszeiger auf eine freie Zelle führen oder die Cursor-Tasten zur Bewegung benutzen und das Symbol dann auf der Tastatur eingeben.

source: In Roxdoku (three-dimensional) puzzles, always use the mouse to set a small cube to a value and use a <emphasis>double</emphasis> click. When you rotate the large cube, by clicking and dragging with the mouse, it is easier to see what values are on the small cubes in the background if you click <emphasis>between</emphasis> the small cubes, not on them.
de: Benutzen Sie im dreidimensionalen Roxdoku immer einen <emphasis>Doppel</emphasis>klick mit der &LMBn;, um einem kleinen Würfeln einen Wert zuzuweisen. Wenn Sie den großen Würfel durch Klicken und Ziehen mit der &LMBn; drehen, ist es einfacher zu erkennen, welche Werte die kleinen Würfel im Hintergrund haben, wenn Sie <emphasis>zwischen</emphasis> die kleinen Würfel und nicht darauf klicken.

source: It is useful sometimes to enter markers or notes, which are tiny symbols within a square. These have no influence on the solution, but they can help you keep track of ideas you have had, especially when there is a choice between two alternatives and you do not yet have enough information to decide between them. To enter a marker or note, click with the right mouse button or hold down the &Shift; key when using the keyboard.
de: Manchmal ist es sinnvoll Marker oder Notizen, die kleine Symbole in der Zelle sind, zu benutzen. Sie haben keinen Einfluss auf die Lösung, aber sie helfen Ihnen Ihre Ideen festzuhalten, besonders wenn Sie die Wahl zwischen zwei Lösungswegen haben, aber nicht genug Informationen um zwischen ihnen zu entscheiden. Um einen Marker oder Notiz einzugeben, klicken Sie mit der rechten Maustaste oder halten Sie die &Shift;-Taste gedrückt, wenn Sie die Tastatursteuerung nutzen.

source: To clear symbols from a square, hover over the square with the mouse and hit <keycap>Delete</keycap> or <keycap>Backspace</keycap> on the keyboard or click with the &RMB; on the square.
de: Um ein Symbol aus einer Zelle zu löschen, bewegen Sie den Mauszeiger darauf und drücken dann die Tasten <keycap>Entf</keycap> oder &Backspace; oder drücken Sie die &RMB; auf einem Symbol.

source: Notice that the squares change color while you hover the mouse over them. This is to help you keep up with the rules of &kappname;. Use the vertical and horizontal lines to check if the symbol you are about to enter into a vacant spot is already in use anywhere in the vertical or horizontal line that square is a part of. The coloring also highlights the block which, if you remember, must also contain only one instance of each symbol. If you do not need the highlighting, you can use the <menuchoice><guimenu>Settings</guimenu> <guimenuitem>Configure &kappname;...</guimenuitem></menuchoice> menu item to turn it off.
de: Es ist zu beachten, dass - zur Hilfestellung mit den Regeln von &kappname; - die Zellen die Farbe ändern, sobald sich der Mauszeiger über ihnen befindet. In den aufleuchtenden horizontalen und vertikalen Linien sollte geprüft werden, ob das gewählte Symbol bereits darin vorkommen. Der Block leuchtet ebenfalls auf, damit auch dieser überprüft werden kann (auch hier darf das Symbol nur einmal vorkommen). Möchten Sie die Hervorhebung nicht benutzen, schalten Sie sie im Einrichtungsdialog ab, den Sie mit dem Menüeintrag <menuchoice><guimenu>Einstellungen</guimenu> <guimenuitem>&kappname; einrichten ...</guimenuitem></menuchoice> öffnen.

source: Keep entering symbols in accordance with the rules until the whole game field is filled up. At this point &kappname; will check if all the entries are valid and will either correct you or accept your solution.
de: Die Regeln müssen bis zur Eingabe des letzten Symbols eingehalten werden. Erst wenn alle Felder gefüllt sind, wird die Richtigkeit von &kappname; überprüft. Ist die Lösung falsch, erscheint ein Hinweis.

source: Game Rules, Strategies and Tips
de: Spielregeln, Spielstrategien und Tipps

source: General Game Rules
de: Spielregeln

source: The rules of &kappname; are quite simple.
de: Die Spielregeln für &kappname; sind sehr einfach.

source: Depending on the size of the game board, the type of puzzle and the difficulty level chosen an individual &kappname; puzzle may take from a few minutes to a few hours to solve.
de: Abhängig von der Größe des Spielfelds, der Art des Spiels und dem Schwierigkeitsgrad kann die Lösung des individuellen &kappname;-Rätsels von wenigen Minuten bis zu mehreren Stunden dauern.

source: Each square may hold one and only one symbol.
de: Jede Zelle darf nur ein Symbol enthalten.

source: Each horizontal row (as defined by the game board) can contain each symbol exactly once.
de: In jeder waagerechten Zeile des Spielfeldes darf ein Symbol nur einmal vorkommen.

source: Each vertical column (as defined by the game board) can contain each symbol exactly once.
de: In jeder senkrechten Spalte des Spielfeldes darf ein Symbol nur einmal vorkommen.

source: Each block (as defined by the game board) can contain each symbol exactly once
de: In jedem Block des Spielfeldes darf ein Symbol nur einmal vorkommen.

source: Note:
de: Hinweis:

source: The set of symbols depends on the size of game you choose.
de: Die Symbolsätze sind von der gewählten Größe des Spiels abhängig.

source: Knowledge of mathematics or language is not required to solve &kappname; puzzles.
de: Mathematische oder sprachliche Kenntnisse sind für die Lösung der &kappname;-Rätsel nicht erforderlich.

source: The symbols already on the game board when the puzzle starts cannot be changed.
de: Symbole, die sich beim Start eines Spiels bereits auf dem Spielfeld befinden, können nicht geändert werden.

source: You can only modify the symbols you have previously entered.
de: Es können nur die eigenen Symbole geändert werden.

source: Puzzles generated by &kappname; have one solution only.
de: Alle Spiele in &kappname; haben immer nur eine Lösung.

source: Puzzles you enter in might have no solution or more than one solution, but if they are from a published source this probably means you have made a data-entry error.
de: Sudokus, die Sie selbst eingegeben haben, können keine oder mehrere Lösungen haben. Haben Sie das Sudoku aus einer öffentlichen Quelle abgeschrieben, dann haben Sie vermutlich bei der Eingabe der Daten Fehler gemacht.

source: &kappname; Variations
de: Variationen von &kappname;

source: The Standard 9x9 Sudoku puzzle has 9 rows, 9 columns and 9 square blocks of size 3x3.
de: Das Standard-Sudoku 9x9 hat 9 Zeilen, 9 Spalten und 9 quadratische Blöcke aus 3x3 Zellen.

source: Other sizes of Standard Sudoku are 4x4 (very easy), 16x16 and 25x25 (not so easy).
de: Andere Standard-Sudokus haben die Größe 4x4 (sehr leicht), 16x16 und 25x25 (ziemlich schwer).

source: The Jigsaw variation is the same as Standard Sudoku except that some blocks are not square.
de: Die Stichsägen-Variante gleicht dem Standard-Sudoku, einige Blöcke sind aber nicht quadratisch.

source: The XSudoku variation is exactly the same as Standard Sudoku with an additional requirement: the two main diagonals must also each contain the symbols 1 to 9 once and once only. &kappname; highlights the diagonals to make this easier to see.
de: Die Variante XSudoku entspricht genau dem Standard-Sudoku mit einer zusätzlichen Bedingung: Die zwei Hauptdiagonalen dürfen die Symbole 1 bis 9 nur genau einmal enthalten. In &kappname; werden diese Diagonalen hervorgehoben, damit sie besser zu sehen sind.

source: The Roxdoku variations are based on cubes in three dimensions, but are easier than they sound. There are no rows or columns. A 3x3x3 Roxdoku puzzle has 27 small cubes arranged into a larger 3x3x3 cube. This contains nine slices, each containing 3x3 small cubes, and these are the square blocks that must be filled with the numbers 1 to 9. A 4x4x4 Roxdoku has twelve 4x4 slices and a 5x5x5 Roxdoku has fifteen 5x5 slices.
de: Die Roxdoku-Varianten basieren auf dreidimensionalen Würfeln. aber ihre Lösung ist einfacher als erwartet. Es gibt keine Zeilen und Spalten. Ein 3x3x3-Roxdoku besteht aus 27 kleinen Würfeln, die in eine größeren 3x3x3 Würfel angeordnet sind. Diese besteht aus 9 Scheiben, jede mit 3x3 Würfeln. Das sind die quadratischen Würfel, die mit den Symbolen 1 bis 9 gefüllt werden müssen. Ein 4x4x4-Roxdoku besteht aus 4x4 Scheiben und ein 5x5x5-Roxdoku aus 5x5 Scheiben.

source: The Samurai Sudoku consists of five Standard Sudoku puzzles of 9x9 squares each, overlapping at the corners by four 3x3 blocks. Each of the five puzzles has 9 rows and 9 columns to solve, but there are only 41 blocks to solve, rather than 45, because of the overlap.
de: Das Samurai-Sudoku besteht aus fünf Standard-Sudokus mit jeweils 9x9 Zellen. Sie überlappen an einer Ecke mit 3x3 Blöcken. Jedes der fünf Sudokus besteht aus 9 Zeilen und 9 Spalten. Wegen der Überlappung müssen aber nur 41 statt 45 Blöcke gelöst werden

source: The Tiny Samurai Sudoku consists of five 4x4 puzzles, overlapping at the corners by four squares. Each of the five puzzles has 4 rows, 4 columns and 4 blocks to solve.
de: Das kleine Samurai-Sudoku besteht aus fünf 4x4 Sudokus, die sich an den Ecken überlappen. Jedes der fünf Sudokus hat 4 Zeilen, Spalten und Blöcke, die gelöst werden müssen.

source: Strategies and Tips
de: Spielstrategien und Tipps

source: Take your time and do not rush. &kappname; is not a quick game.
de: Für die Lösung der Rätsel sollte sich <emphasis>Zeit genommen</emphasis> und nicht <emphasis>in Hektik verfallen</emphasis> werden. &kappname; ist kein <emphasis>schnelles</emphasis> Spiel.

source: Pay attention to the row, column, and block colorings. They are there to help you.
de: Auf die Einfärbungen der Zeile, Spalte und der Blöcke sollte geachtet werden. Sie bieten eine Hilfestellung bei der Lösung des Rätsels.

source: Make sure that no duplicate symbol exists already in the row, column or block where you are entering a symbol.
de: Es ist sicherzustellen, dass sich keine doppelten Symbole in der Zeile, Spalte und dem Block befinden, in dem das Symbol eingetragen werden soll.

source: If in doubt, try to foresee if a square you are entering a symbol into may be needed by some other symbol, which otherwise cannot go anywhere else due to the row, column and block rules.
de: Falls Zweifel bestehen, sollte danach gesehen werden, ob nicht ein anderes Symbol in die entsprechende Zelle eingetragen werden muss, damit keine Regelverletzungen in der Zeile, Spalte und dem Block vorliegen.

source: Use the Internet to search for general hints and strategies for solving Sudoku puzzles.
de: Benutzen Sie das Internet zur Suche nach allgemeinen Tipps und Strategien zur Lösung vom Sudoku-Rätseln

source: Use marker moves when you spot a square or squares that have just a few alternatives but you cannot decide between them immediately. Markers will save you time and memory effort later, when more squares have been filled in. See <link linkend="howto"> How to Play</link> for details of how to use markers.
de: Benutzen Sie Markierungen, wenn es bei einer oder mehreren Zellen nur wenige Möglichkeiten gibt, Sie sich aber noch nicht sofort für einen mögliches Symbol entscheiden können. Markierungen ersparen Ihnen Zeit und Sie müssen sich die möglichen Symbole für diese Zellen nicht merken, wenn später mehr Zellen ausgefüllt sind. Im Abschnitt <link linkend="howto">Spielanleitung</link> finden Sie Informationen zur Verwendung von Markierungen.

source: If you are having trouble, try to retrace your steps and see exactly where you have made an error. You can use the <menuchoice><guimenu>Move</guimenu> <guimenuitem>Undo</guimenuitem></menuchoice> and <menuchoice><guimenu>Move</guimenu> <guimenuitem>Redo</guimenuitem></menuchoice> menu items, repeatedly if necessary, and there is a setting in <menuchoice><guimenu>Settings</guimenu> <guimenuitem>Configure &kappname;...</guimenuitem></menuchoice> that highlights errors.
de: Kommen Sie nicht weiter, dann versuchen Sie Ihre Spielzüge zurückzunehmen, um genau festzustellen, wo Sie einen Fehler gemacht haben. Dazu können Sie die Menüeinträge <menuchoice><guimenu>Zug</guimenu> <guimenuitem>Zurücknehmen</guimenuitem></menuchoice> und <menuchoice><guimenu>Zug</guimenu> <guimenuitem>Wiederherstellen</guimenuitem></menuchoice>. Diese Aktionen können Sie auch mehrmals durchführen. Außerdem gibt es ein Einstellung im Einrichtungsdialog, um Fehler hervorzuheben.

source: Even though &kappname; provides a 'Hint' option for you, try not to use it often. Remember, solving the puzzle all by yourself enhances your brain activity, while using the 'Hint' feature too often is cheating.
de: Auch wenn &kappname; eine <emphasis>Tipp-Funktion</emphasis> bietet, sollte diese nicht zu oft verwendet werden. Die eigenständige Lösung des Rätsels fördert die Gehirnaktivität, während die regelmäßige Verwendung der <emphasis>Tipp-Funktion</emphasis> eine Art des <emphasis>Mogelns</emphasis> darstellt.

source: If you have too much trouble solving a certain puzzle and simply must use the 'Hint' feature, then maybe you should try decreasing the difficulty level, or try a simpler, more basic puzzle.
de: Bei zu großen Problemen bei der Lösung des Rätsels und öfteren Verwendung der <emphasis>Tipp-Funktion</emphasis> sollte die Herabsetzung des Schwierigkeitsgrades bzw. ein einfacheres Rätsel versucht werden.

source: Some puzzle layouts feature very specific game board shapes. It is a good idea to have the highlighting option enabled even if you consider yourself an experienced player.
de: Manche Rätsel haben einen sehr spezifischen Spielbrettaufbau. Es bietet sich daher an, die <emphasis>Hervorhebungs</emphasis>-Funktion aktiviert zu haben (auch wenn man sich selbst für einen erfahrenen Spieler hält).

source: Interface Overview
de: Die Benutzeroberfläche

source: The Welcome Screen
de: Der Startbildschirm

source: The Welcome Screen is the first thing you see when you start &kappname; or use the toolbar or menu to request a new game. It has a list of all the puzzle types and sizes and you can click on one of them to make a selection.
de: Als erstes sehen Sie den Startbildschirm, wenn Sie &kappname; starten oder über das Menü oder die Werkzeugleiste ein neues Spiel beginnen. Auf dem Startbildschirm sehen Sie eine Liste aller angebotenen Sudoku-Varianten. Klicken Sie auf einen Eintrag, um ihn auszuwählen.

source: If you click the button marked <guilabel>Enter In A Puzzle</guilabel>, an empty board of the selected type and size appears. Here you can use the mouse or keyboard to enter in a puzzle from another source, such as a newspaper. When you have finished, use the <guilabel>Check</guilabel> action, on toolbar or menu, to check the puzzle. It should have just one solution. If so, you can start solving the puzzle or perhaps get &kappname; to solve it. If there is no solution or more than one solution, it probably means you have made a data-entry error somewhere.
de: Wenn Sie auf den Kopf <guilabel>Rätsel eingeben</guilabel> drücken, wird ein leeres Spielfeld der ausgewählten Art und Größe angezeigt. Nun können Sie mit der Maus oder der Tatstatur ein Rätsel aus einer anderen Quelle wie zum Beispiel einer Zeitung eingeben. Haben Sie alles eingetragen, benutzen Sie die Aktion <guilabel>Prüfen</guilabel> im Menü oder der Werkzeugleiste, damit &kappname; die Eingaben auf mögliche Lösungen überprüft. Das Rätsel sollte nur eine mögliche Lösung haben, damit Sie mit dem Spiel beginnen können oder es durch &kappname; lösen lassen. Gibt es keine oder mehrere Lösungen, dann haben Sie möglicherweise Fehler bei der Eingabe der Daten gemacht.

source: If you click the button marked <guilabel>Generate A Puzzle</guilabel>, &kappname; will display a board with some squares already filled in. It is up to you to fill in the rest.
de: Klicken Sie den Knopf <guilabel>Rätsel ausfüllen</guilabel>, dann zeigt &kappname; ein Spielfeld mit einigen bereits besetzten Zellen. Es ist Ihre Aufgabe, die restlichen Zellen auszufüllen.

source: Before you generate a puzzle, check that the settings of the <guilabel>Difficulty</guilabel> and <guilabel>Symmetry</guilabel> buttons are to your liking. You can change them during a game, but then they will have no effect until the next puzzle is generated.
de: Ehe Sie ein Rätsel generieren, sollten Sie überprüfen, dass die Einstellungen für den <guilabel>Schwierigkeitsgrad</guilabel> und die <guilabel>Symmetrie</guilabel> richtig sind. Sie können diese Einstellungen während eines Spiels ändern, sie werden aber erst beim Generieren des nächsten Rätsels angewendet.
