Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdegames/ksudoku.po
Languages: de

source: If you cannot see the <guilabel>Difficulty</guilabel> and <guilabel>Symmetry</guilabel> buttons, use the <menuchoice><guimenu>Settings</guimenu> <guimenuitem>Show Statusbar</guimenuitem></menuchoice> menu item to make sure that the statusbar is visible.
de: Werden die Auswahlfelder für <guilabel>Schwierigkeitsgrad</guilabel> und <guilabel>Symmetrie</guilabel> nicht angezeigt, benutzen Sie den Menüeintrag <menuchoice><guimenu>Einstellungen</guimenu> <guimenuitem>Statusleiste anzeigen</guimenuitem></menuchoice>, um sie einzublenden.

source: The <guilabel>Difficulty</guilabel> button provides six levels of difficulty, from <guimenuitem>Very Easy</guimenuitem> up to <guimenuitem>Hard</guimenuitem>, <guimenuitem>Diabolical</guimenuitem> and <guimenuitem>Unlimited</guimenuitem>. The easier levels may take a few minutes to solve on a 9x9 board. The <guimenuitem>Hard</guimenuitem> and <guimenuitem>Diabolical</guimenuitem> levels may take an hour or so and are intended to be equivalent to difficult grades appearing in newspapers. Samurai puzzles and 16x16 or 25x25 sizes of puzzles will take longer to solve, simply because there are more rows, columns and blocks and more squares to fill in.
de: Als <guilabel>Schwierigkeitsgrad</guilabel> sind sechs Spielstufen vorhanden, von <guimenuitem>Sehr einfach</guimenuitem> bis zu <guimenuitem>Schwierig</guimenuitem>, <guimenuitem>Teuflisch</guimenuitem> und <guimenuitem>Unbegrenzt</guimenuitem>. Bei den einfachen Schwierigkeitsgraden brauchen Sie wahrscheinlich nur wenige Minuten, um ein 9x9 Sudoku zu lösen. Mit den Schwierigkeitsgraden <guimenuitem>Schwierig</guimenuitem> und <guimenuitem>Teuflisch</guimenuitem> kann es bis zu einer Stunde dauern, bis Sie das Sudoku gelöst haben. Diese Schwierigkeitsgrade entsprechen den Stufen, die in Zeitungen als schwierig veröffentlicht werden. Samurai-Sudokus und die Größen 16x16 oder 25x25 benötigen mehr Zeit zur Lösung, weil sie mehr Zeilen, Spalten, Blöcke und mehr Felder zum Ausfüllen haben.

source: The Diabolical level typically requires one or more guesses, with backtracking if you guess wrong. Lower levels can usually be solved by logic alone. The Unlimited level has no limits on the number of guesses required, how soon the first guess is needed or how complex the logic might be. It is provided for the interest of expert players, but tends to generate uninteresting 'inhuman' puzzles and is not recommended for general use.
de: Der teuflische Schwierigkeitsgrad erfordert ein oder auch mehrere Lösungsversuche und Sie müssen Spielzüge zurücknehmen, falls sie falsch geraten haben. Leichtere Schwierigkeitsgrade können normalerweise nur durch Logik gelöst werden. Beim unbegrenzten Schwierigkeitsgrad gibt es keine Begrenzung der nötigen Lösungsversuche und wie früh das erste mal geraten werden muss oder wie komplex die zur Lösung nötige Logik sein kann. Dieser Schwierigkeitsgrad ist für erfahrene Spieler gedacht, kann aber zu nicht interessanten „unmenschlichen“ Spielen führen und sollte normalerweise vermieden werden.

source: The <guilabel>Symmetry</guilabel> button provides seven types of symmetry, including <guimenuitem>No Symmetry</guimenuitem>. This controls the layout and appearance of the squares that are filled in at the start of a puzzle and has mainly aesthetic effect, except that puzzles with no symmetry tend to be slightly harder than those with high symmetry and it is less likely that &kappname; can generate a puzzle with high difficulty and high symmetry combined.
de: Die Einstellung <guilabel>Symmetrie</guilabel> erlaubt die Auswahl mehrerer Symmetrien einschließlich <guimenuitem>Keine Symmetrie</guimenuitem>. Diese Einstellung beeinflusst die Anordnung und das Erscheinungsbild der beim Start des Spiels ausgefüllten Zellen. Diese Einstellung gibt es hauptsächlich aus ästhetischen Gründe, mit der Ausnahme dass Rätsel, ohne Symmetrie anscheinend schwerer zu lösen sind als Rätsel mit großer Symmetrie. Es ist weniger wahrscheinlich, dass &kappname; ein Rätsel mit der Kombination von hohem Schwierigkeitsgrad und großer Symmetrie erstellen kann.

source: The Game Menu
de: Das Menü Spiel

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo></shortcut> <guimenu>Game</guimenu> <guimenuitem>New</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo></shortcut><guimenu>Spiel</guimenu><guimenuitem>Neu</guimenuitem>

source: Starts a new game.
de: Hiermit wird ein neues Spiel gestartet.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>O</keycap></keycombo></shortcut> <guimenu>Game</guimenu> <guimenuitem>Load...</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>O</keycap></keycombo></shortcut><guimenu>Spiel</guimenu><guimenuitem>Laden ...</guimenuitem>

source: Loads a saved game.
de: Hiermit kann ein gespeichertes Spiel geladen werden.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>S</keycap></keycombo></shortcut> <guimenu>Game</guimenu> <guimenuitem>Save</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>S</keycap></keycombo></shortcut><guimenu>Spiel</guimenu><guimenuitem>Speichern</guimenuitem>

source: <action>Saves</action> the current game as a default save file.
de: Hiermit wird das aktuelle Spiel als eine standardmäßige Datei gespeichert.

source: <guimenu>Game</guimenu> <guimenuitem>Save As...</guimenuitem>
de: <guimenu>Spiel</guimenu><guimenuitem>Speichern unter ...</guimenuitem>

source: <action>Saves</action> the current game as a file of your choice.
de: Hiermit wird das aktuelle Spiel unter einem anderen Namen gespeichert.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>P</keycap></keycombo></shortcut> <guimenu>Game</guimenu> <guimenuitem>Print...</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>P</keycap></keycombo></shortcut> <guimenu>Spiel</guimenu> <guimenuitem>Drucken ...</guimenuitem>

source: <action>Prints</action> the current state of a two-dimensional game on a printer of your choice. The block outlines and original puzzle values are printed in black. Other cells, filled-in values and solution values are printed in gray. There is an option to print just one puzzle or more than one puzzle per page. See <link linkend="configuration">Game Configuration</link>.
de: <action>Druckt</action> den aktuellen Status eines zweidimensionalen Spiels auf einem Drucker aus. Die Umrisse der Felder und die vorgegebenen Werte werden schwarz gedruckt, ausgefüllte Werte und Lösungswerte dagegen grau. Sie können in den <link linkend="configuration">Spieleinstellungen</link> vorgeben, ob nur ein Rätsel oder mehrere auf eine Seite gedruckt werden sollen.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo></shortcut> <guimenu>Game</guimenu> <guimenuitem>Quit</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo></shortcut><guimenu>Spiel</guimenu><guimenuitem>Beenden</guimenuitem>

source: <action>Quits</action> &kappname;.
de: Hiermit wird &kappname; beendet.

source: The Move Menu
de: Das Menü Zug

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>Z</keycap></keycombo></shortcut> <guimenu>Move</guimenu> <guimenuitem>Undo</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>Z</keycap></keycombo></shortcut><guimenu>Zug</guimenu><guimenuitem>Zurücknehmen</guimenuitem>

source: <action>Undo</action> your last move, repeatedly if required.
de: Hiermit wird der letzte Zug zurückgenommen (mehrmals möglich).

source: <shortcut><keycombo action="simul">&Ctrl;&Shift;<keycap>Z</keycap></keycombo></shortcut> <guimenu>Move</guimenu> <guimenuitem>Redo</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;&Shift;<keycap>Z</keycap></keycombo></shortcut><guimenu>Zug</guimenu><guimenuitem>Wiederherstellen</guimenuitem>

source: <action>Redo</action> a move that was undone, repeatedly if required.
de: Hiermit wird der zuletzt zurückgenommene Zug wiederhergestellt (mehrmals möglich).

source: <shortcut><keycap>H</keycap></shortcut> <guimenu>Move</guimenu> <guimenuitem>Hint</guimenuitem>
de: <shortcut><keycap>H</keycap> </shortcut><guimenu>Zug</guimenu><guimenuitem>Tipp</guimenuitem>

source: <action>Give a Hint</action> by filling in a vacant square.
de: <action>Gibt einen Tipp</action>, in dem ein Symbol in einer freien Zelle des Gitters eingetragen wird.

source: <guimenu>Move</guimenu> <guimenuitem>Solve</guimenuitem>
de: <guimenu>Zug</guimenu><guimenuitem>Lösen</guimenuitem>

source: <action>Instantly solve</action> the puzzle.
de: Hiermit wird das Rätsel sofort gelöst.

source: <guimenu>Move</guimenu> <guimenuitem>Check</guimenuitem>
de: <guimenu>Zug</guimenu><guimenuitem>Prüfen</guimenuitem>

source: <action>Check</action> an entered puzzle for validity. If it has only one solution, it becomes available for play. If it has no solution or more than one solution, there has probably been an error in the data-entry.
de: <action>Überprüft</action> ein eingegebenes Sudoku auf Gültigkeit. Gibt es nur eine Lösung, dann kann es gespielt werden. Bei keiner oder mehreren Lösungen sind wahrscheinlich die Daten falsch eingeben worden.

source: The Settings Menu
de: Das Menü Einstellungen

source: <guimenu>Settings</guimenu> <guimenuitem>Configure &kappname;...</guimenuitem>
de: <guimenu>Einstellungen</guimenu><guimenuitem>&kappname; einrichten ...</guimenuitem>

source: <action>Open a dialog to configure &kappname;.</action> See <link linkend="configuration">Game Configuration</link> section for details.
de: Hiermit wird der Dialog zum Einrichten von &kappname; geöffnet. Weitere Informationen hierzu könnend dem Abschnitt <link linkend="configuration">Spieleinstellungen</link> entnommen werden.

source: Additionally &ksudoku; has the common &kde; <guimenu>Settings</guimenu> and <guimenu>Help</guimenu> menu items, for more information read the sections about the <ulink url="help:/fundamentals/ui.html#menus-settings">Settings Menu</ulink> and <ulink url="help:/fundamentals/ui.html#menus-help">Help Menu</ulink> of the &kde; Fundamentals.
de: Zusätzlich hat &ksudoku; die bekannten &kde;-Einträge im Menü <guimenu>Einstellungen</guimenu> und <guimenu>Hilfe</guimenu>, weitere Informationen dazu finden Sie in den Abschnitten über die Menüs <ulink url="help:/fundamentals/ui.html#menus-settings">Einstellungen</ulink> und <ulink url="help:/fundamentals/uihtml#menus-help">Hilfe</ulink> der &kde;-Grundlagen.

source: Frequently asked questions
de: Häufig gestellte Fragen

source: I want to change the way this game looks. Can I?
de: Kann das Erscheinungsbild des Spiels geändert werden?

source: Sudoku games are traditionally played using a square grid. Themes do not make much sense here, but you can select some color schemes and backgrounds. To do so use <menuchoice><guimenu>Settings</guimenu><guimenuitem>Configure &kappname;...</guimenuitem></menuchoice> on the menubar.
de: Die Sudoko-Spiele werden traditionell in quadratischen Gittern gespielt und Designs würden keinen Unterschied darstellen. Jedoch können unterschiedliche Farbschemata und Hintergründe über das Menü <menuchoice><guimenu>Einstellungen</guimenu><guimenuitem>&kappname; einrichten ...</guimenuitem></menuchoice> gewählt werden.

source: Can I use the keyboard to play this game?
de: Kann ich mit der Tastatur spielen?

source: Yes. In &kappname; keyboard play is always enabled. Please use the cursor keys to move the selection, numeric or alphabetic characters to enter the symbols and the &Shift; key to apply markers.
de: Ja. Die Tastatursteuerung ist in &kappname; immer aktiv. Die einzelnen Zellen können mit den Pfeiltasten gewählt, die Symbole mit den Nummern- oder Buchstabentasten eingetragen und Markierungen mit der &Shift;taste gesetzt werden.

source: Where are the high scores?
de: Wo befindet sich die Bestenliste?

source: &kappname; does not have this feature.
de: In &kappname; gibt es keine Bestenliste.

source: Game Configuration
de: Spieleinstellungen

source: Game Options
de: Spieleinstellungen

source: When printing, try to fit more than one puzzle on a page
de: Mehr als ein Rätsel je Seite drucken, wenn möglich

source: Toggle the option to print more than one puzzle per page whenever they will fit.
de: Ist diese Einstellung aktiv, werden mehrere Rätsel auf einer Seite gedruckt, wenn diese auf eine Seite passen.

source: If this option is checked, puzzles will be printed when no more will fit on a page or when &kappname; terminates. Otherwise a puzzle is printed immediately.
de: Das Rätsel wird gedruckt, wenn eine Seite voll ist oder wenn &kappname; beendet wird. Ist diese Einstellung abgeschaltet, wird das Rätsel sofort gedruckt.

source: Three-dimensional puzzles cannot be printed.
de: Leider können dreidimensionale Rätsel nicht gedruckt werden.

source: Show Highlights in 2-D puzzles
de: Hervorhebungen bei 2D-Rätseln anzeigen

source: Toggle the &kappname; highlight option for two-dimensional puzzles.
de: Hiermit wird die Hervorhebung der Reihen, Spalten und des Rechtecks bei zweidimensionalen Rätseln aktiviert.

source: Show Errors
de: Fehler anzeigen

source: Toggle the option to highlight errors.
de: Hiermit wird die Hervorhebung von Fehlern aktiviert.

source: Show Highlights in 3-D puzzles
de: Hervorhebungen bei 3D-Rätseln anzeigen

source: Toggle the &kappname; highlight option for three-dimensional puzzles.
de: Hiermit wird die Hervorhebung der Reihen, Spalten und des Rechtecks bei dreidimensionalen Rätseln aktiviert.

source: Settings for 3-D Puzzles Only
de: Einstellungen für 3D-Rätsel

source: These five settings adjust the highlighting and visibility of cells in three-dimensional puzzles. The idea is to make it easier to see relationships between cells, especially if they are behind other cells.
de: Mit diesen fünf Einstellungen wird die Hervorhebung und Anzeige von Zellen in dreidimensionalen Rätseln angepasst. Damit können Beziehungen zwischen den Zellen besser sichtbar gemacht werden, besonders bei Zellen, die von anderen Zellen verdeckt werden.

source: Having the highlighting options enabled is recommended even for the most experienced players, as it helps you see the actual game board constraints.
de: Sogar für erfahrene Spieler ist es unbedingt empfehlenswert, die Einstellung zur Hervorhebeung zu nutzen, da sie das Erkennen bereits gesetzter Symbole erleichtert.

source: Credits and License
de: Danksagungen und Lizenz

source: Copyright 2006-2007 Mick Kappenburg <email>ksudoku@kappenburg.net</email>, Johannes Bergmeier <email>johannes.bergmeier@gmx.net</email>
de: © 2006-2007 Mick Kappenburg <email>ksudoku@kappenburg.net</email>, Johannes Bergmeier <email>johannes.bergmeier@gmx.net</email>

source: New solver and generator algorithms 2011 David Bau, <ulink url="http://davidbau.com/archives/2006/09/04/sudoku_generator.html"> see website.</ulink>
de: Neue Algorithmen zur Lösung und Generierung 2011 David Bau, siehe die Webseite <ulink url="http://davidbau.com/archives/2006/09/04/sudoku_generator.html">Sudoku Generator</ulink>.

source: Documentation copyright 2005 Francesco Rossi <email>redsh@email.it</email>
de: Dokumentation © 2005 Francesco Rossi <email>redsh@email.it</email>

source: Documentation copyright 2007 Mick Kappenburg <email>ksudoku@kappenburg.net</email>, Eugene Trounev <email>eugene.trounev@gmail.com</email>
de: Dokumentation © 2007 Mick Kappenburg <email>ksudoku@kappenburg.net</email>, Eugene Trounev <email>eugene.trounev@gmail.com</email>

source: Documentation copyright 2011 Ian Wadham <email>iandw.au@gmail.com</email>
de: Dokumentation © 2011 Ian Wadham <email>iandw.au@gmail.com</email>

source: CREDIT_FOR_TRANSLATORS
de: <para>Übersetzung: Burkhard Lück<email>lueck@hube-lueck.de</email></para><para>Überarbeitung der Übersetzung: Johannes Obermayr<email>johannesobermayr@gmx.de</email></para>

source: Compilation and Installation
de: Kompilierung und Installation
