Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdegames/ktron.po
Languages: de

source: The &kappname; Handbook
de: Das Handbuch zu &kappname;

source: Reviewer
de: Korrektur

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Maren</firstname><surname>Pakura</surname><affiliation><address><email>maren@kde.org</email></address></affiliation><contrib>Deutsche Übersetzung</contrib></othercredit><othercredit role="translator"><firstname>Johannes</firstname><surname>Obermayr</surname><affiliation><address><email>johannesobermayr@gmx.de</email></address></affiliation><contrib>Überarbeitung der Übersetzung</contrib></othercredit>

source: &kappname; is a simple snake duel game for &kde;, which you can play alone or against a friend.
de: &kappname; ist eine einfache Kopie des Spiels „Schlangenduell“ für &kde; und kann alleine oder gegen einen Freund gespielt werden.

source: kdegames
de: KDE-Spiele

source: game
de: Spiel

source: duel
de: duell

source: Introduction
de: Einleitung

source: &kappname; is a simple snake duel game for the <ulink url="http://www.kde.org">K Desktop Environment</ulink>. You can play &kappname; against the computer or a friend. The aim of the game is to live longer than your opponent. To do that, avoid running into a wall, your own tail and that of your opponent.
de: &kappname; ist eine einfache Kopie des Spiels „Schlangenduell“ für die <ulink url="http://www.kde.org">K-Arbeitsflächenumgebung</ulink>. &kappname; kann gegen den Computer oder einen Freund gespielt werden. Das Ziel ist länger zu leben als der Gegner. Dazu darf man weder in eine Mauer noch in den eigenen oder gegnerischen „Körper“ rennen.

source: &ksnake; is a simple Snake-like game for the <ulink url="http://www.kde.org">K Desktop Environment</ulink>. The aim of &ksnake; is to survive as long as possible and eat as many fruits as you can.
de: &ksnake; ist ein einfaches „Snake“-Spiel für die <ulink url="http://www.kde.org">K-Arbeitsflächenumgebung</ulink>. Das Ziel von &ksnake; ist so lange wie möglich zu überleben und dabei möglichst viele „Früchte“ zu „fressen“.

source: You can switch between these games using the game type selector in the configuration dialog.
de: Zwischen den beiden Spielen kann mittels Auswahl der Spielart im Einrichtungsmenü gewechselt werden.

source: Playing &kappname;
de: &kappname; spielen

source: Rules
de: Spielregeln

source: Once a round is started, the players do not stop moving forward (unless the game is paused). All you have to do is avoid crashing by changing your players direction. Additionally you can try to hinder your opponent. For this it is possible to increase the velocity by pressing your accelerator key.
de: Wenn eine Spielrunde gestartet wurde, hören die Spieler nicht mehr auf, sich vorwärts zu bewegen (bis das Spiel unterbrochen wird). Alles was jetzt zu tun ist, ist einen Unfall zu vermeiden, indem die Bewegungsrichtung geändert wird. Zusätzlich kann versucht werden, den Gegner zu behindern. Dazu gibt es noch die Möglichkeit, die Geschwindigkeit - durch Drücken der Beschleunigungstaste - zu erhöhen.

source: A round starts when all human players press a direction key. The initial moving direction is then in this direction.
de: Die Spielrunde startet, wenn alle Spieler eine Ihrer Richtungstasten gedrückt haben. Die „Würmer“ bewegen sich dann anfangs in diese Richtung.

source: If you want to interrupt playing, select <guimenuitem>Pause</guimenuitem> from the <guimenu>Game</guimenu> menu or hit the keyboard shortcut (see section <link linkend="keys">Default Shortcuts</link>). Additionally the game is paused when the game loses the keyboard focus, &eg; when switching to an other window.
de: Das Spiel kann mittels <guimenuitem>Pause</guimenuitem> aus dem Menü <guimenu>Spiel</guimenu> oder Verwenden des entsprechenden Tastenkürzels (siehe Kapitel <link linkend="keys">Tastenbelegung</link>) unterbrochen werden. Außerdem wird das Spiel unterbrochen, wenn das Spiel den Tastaturfokus verliert (z. B. durch Wechsel zu einem anderen Fenster).

source: To continue the game, select the menu item <guimenuitem>Pause</guimenuitem> again, or the keyboard shortcut. The game will also continue if the human players press one of their direction keys. But be careful, your player switches to this direction immediately.
de: Fortgesetzt wird das Spiel mittels <guimenuitem>Pause</guimenuitem> aus dem Menü <guimenu>Spiel</guimenu> oder Verwenden des entsprechenden Tastenkürzels. Weiterhin wird das Spiel durch Drücken der Richtungstaste durch die menschlichen Spieler fortgesetzt. Hier sollte Vorsicht walten, denn die „Würmer“ bewegen sich sofort in diese Richtung weiter.

source: A game consists of several rounds, and ends if a player has at least nine points, and additionally two more points than the opponent. The current score is always displayed in the status bar.
de: Ein Spiel besteht aus mehreren Runden und endet, wenn ein Spieler mindestens neun Punkte und zusätzlich zwei Punkte mehr als der Gegner hat. Der aktuelle Punktestand wird ständig in der Statusleiste angezeigt.

source: You can change the difficulty level of the game using the game menu item or the select box on the status bar. The difficulty influences the speed of the game and the computer player.
de: Der Schwierigkeitsgrad des Spiels kann entweder über das Menü <guimenu>Einstellungen</guimenu> oder die Auswahlliste in der Statusleiste geändert werden und beeinflusst die Spielgeschwindigkeit und den Computerspieler.

source: The Computer Player
de: Der Computerspieler

source: You can play against a computer. The difficulty level of the game influences the intelligence of the computer player.
de: Es kann gegen den Computer gespielt werden. Der Schwierigkeitsgrad beeinflusst die Intelligenz des Computerspielers.

source: At low levels the computer doesn't care about the opponent and just moves around. At higher skill levels the computer tries to hinder the opponent when he comes near.
de: In den niedrigen Schwierigkeitsgraden beachtet der Computerspieler seinen Gegner (menschlicher Spieler) nicht und bewegt sich nur umher. In den oberen Schwierigkeitsgraden versucht der Computerspieler den Gegner zu behindern, wenn sie sich nähern.

source: Using the Keyboard
de: Tastatursteuerung

source: Each player has five keys. Four keys for changing the direction and one to accelerate.
de: Jeder Spieler benötigt fünf Tasten. Vier Tasten zum Ändern der Richtung und eine zum Beschleunigen.

source: The direction keys do not have to be held down. Simply press them once to change the direction of your player.
de: Die Richtungstasten müssen nicht gedrückt gehalten werden. Ein einmaliges Drücken reicht aus, damit der „Wurm“ seine Richtung entsprechend ändert.

source: Acceleration only occurs while the acceleration key remains depressed. When you release the acceleration key, velocity returns to normal.
de: Das Beschleunigen funktioniert nur, solange die Beschleunigungstaste gedrückt wird. Wenn sie losgelassen wird, verringert sich die Geschwindigkeit wieder auf normal.

source: You can alter the keys using the shortcuts option in the <ulink url="help:/fundamentals/shortcuts.html"><guimenu>Settings</guimenu> menu</ulink>.
de: Die Tastenbelegung kann über das Menü <ulink url="help:/fundamentals/shortcuts.html"><guimenu>Einstellungen</guimenu></ulink> geändert werden.

source: Playing &ksnake;
de: &ksnake; spielen

source: Once the game is started, the player does not stop moving forward (unless the game is paused). All you have to do is avoid crashing by changing your direction. A game starts when you press a direction key. The initial moving direction is then in this direction.
de: Wenn eine Spielrunde gestartet wurde, hört der Spieler nicht mehr auf, sich vorwärts zu bewegen (bis das Spiel unterbrochen wird). Alles was jetzt zu tun ist, ist einen Unfall zu vermeiden, indem die Bewegungsrichtung geändert wird. Das Spiel beginnt, sobald eine Richtungstaste gedrückt wurde. Der „Wurm“ bewegt sich dann anfangs in diese Richtung.

source: If you want to pause playing, select <guimenu>Pause</guimenu> from the <guimenuitem>Game</guimenuitem> menu or hit the keyboard shortcut (see section <link linkend="keys">Default Shortcuts</link>). Additionally the game is paused when the game loses the keyboard focus, &eg; when switching to an other window.
de: Das Spiel kann mittels <guimenuitem>Pause</guimenuitem> aus dem Menü <guimenu>Spiel</guimenu> oder Verwenden des entsprechenden Tastenkürzels (siehe Kapitel <link linkend="keys">Tastenbelegung</link>) unterbrochen werden. Außerdem wird das Spiel unterbrochen, wenn das Spiel den Tastaturfokus verliert (z. B. durch Wechsel zu einem anderen Fenster).

source: To continue the game, select the menu item <guimenuitem>Pause</guimenuitem> or hit the keyboard shortcut again. The game will also continue if you press one of the direction keys. But be careful, your player switches to this direction immediately.
de: Fortgesetzt wird das Spiel mittels <guimenuitem>Pause</guimenuitem> aus dem Menü <guimenu>Spiel</guimenu> oder Verwenden des entsprechenden Tastenkürzels. Weiterhin wird das Spiel durch Drücken einer Richtungstaste fortgesetzt. Hier sollte Vorsicht walten, denn der „Wurm“ bewegt sich sofort in diese Richtung weiter.

source: In the game there will always be a piece of fruit on the map. If you collect it your score will increase with 5 points. The current score is always displayed in the status bar.
de: Während des Spiels wird sich immer eine „Frucht“ auf der Karte befinden. Beim Einsammeln dieser erhöht sich der Punktestand um 5 Punkte. Der aktuelle Punktestand wird in der Statusleiste angezeigt.

source: When you are moving through the map there will appear obstacles. Hitting them will also result in a crash. However, every time an obstacle appears and you survive you'll be rewarded 2 points
de: Beim Bewegen durch die Karte erscheinen Hindernisse. Eine Berührung mit ihnen endet in einem Unfall. Sollte bei Erscheinen eines Hindernisses kein Unfall verursacht werden, gibt es jedes Mal zwei Belohnungspunkte.

source: You can change the difficulty level of the game using the game menu item or the select box on the status bar. The difficulty influences the speed of the game.
de: Der Schwierigkeitsgrad des Spiels kann entweder über das Menü <guimenu>Einstellungen</guimenu> oder die Auswahlliste in der Statusleiste geändert werden und beeinflusst die Spielgeschwindigkeit.

source: Using the keyboard
de: Tastatursteuerung

source: Each player has four keys. These are used for changing the direction. The direction keys do not have to be held down. Simply press them once to change the direction of your player.
de: Jeder Spieler hat vier Tasten für die Richtungsänderung. Hierzu muss die jeweilige Taste nur einmal kurz gedrückt werden und der Spieler ändert unverzüglich seine Richtung.

source: Interface Overview
de: Die Benutzeroberfläche

source: Menu Items
de: Menüeinträge

source: The following list briefly describes each menubar option.
de: Der folgende Abschnitt beschreibt kurz die Einstellungen in der Menüleiste.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo> </shortcut> <guimenu>Game</guimenu> <guimenuitem>New</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo> </shortcut> <guimenu>Spiel</guimenu> <guimenuitem>Neu</guimenuitem>

source: Starts a new game.
de: Startet ein neues Spiel.

source: <shortcut> <keycap>P</keycap> </shortcut> <guimenu>Game</guimenu> <guimenuitem>Pause</guimenuitem>
de: <shortcut> <keycap>P</keycap> </shortcut> <guimenu>Spiel</guimenu> <guimenuitem>Pause</guimenuitem>

source: Toggles whether the game is paused.
de: Unterbricht das Spiel bzw. setzt ein unterbrochenes Spiel fort.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>H</keycap></keycombo> </shortcut> <guimenu>Game</guimenu> <guimenuitem>Show High Scores</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>H</keycap></keycombo> </shortcut> <guimenu>Spiel</guimenu> <guimenuitem>Bestenliste anzeigen</guimenuitem>

source: Displays the high score dialog (for &ksnake;).
de: Zeigt die Bestenliste (für &ksnake;).

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo> </shortcut> <guimenu>Game</guimenu> <guimenuitem>Quit</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo> </shortcut> <guimenu>Spiel</guimenu> <guimenuitem>Beenden</guimenuitem>

source: Quits.
de: Beendet das Spiel.

source: <guimenu>Settings</guimenu> <guimenuitem>Difficulty</guimenuitem>
de: <guimenu>Einstellungen</guimenu><guimenuitem>Schwierigkeitsgrad</guimenuitem>

source: Lets you alter the difficulty level of the game.
de: Dient zur Einstellung des Schwierigkeitsgrads des Spiels.

source: <guimenu>Settings</guimenu> <guimenuitem>Configure &kappname;...</guimenuitem>
de: <guimenu>Einstellungen</guimenu><guimenuitem>&kappname; einrichten ...</guimenuitem>

source: Opens a <link linkend="configuration">comprehensive dialog</link> to configure various options.
de: Öffnet einen <link linkend="configuration">umfangreichen Dialog</link> zum Festlegen verschiedener Einstellungen.

source: Additionally &ksnake; has the common &kde; <guimenu>Settings</guimenu> and <guimenu>Help</guimenu> menu items, for more information read the sections about the <ulink url="help:/fundamentals/ui.html#menus-settings">Settings Menu</ulink> and <ulink url="help:/fundamentals/ui.html#menus-help">Help Menu</ulink> of the &kde; Fundamentals.
de: Zusätzlich hat &ksnake; die bekannten &kde;-Einträge im Menü <guimenu>Einstellungen</guimenu> und <guimenu>Hilfe</guimenu>, weitere Informationen dazu finden Sie in den Abschnitten über die Menüs <ulink url="help:/fundamentals/ui.html#menus-settings">Einstellungen</ulink> und <ulink url="help:/fundamentals/uihtml#menus-help">Hilfe</ulink> der &kde;-Grundlagen.

source: Default Shortcuts
de: Tastenbelegung

source: The following tables show you the default shortcuts.
de: Die folgenden Tabellen zeigen die voreingestellte Tastenbelegung.

source: Player 1 Shortcuts
de: Tastenkürzel für den (rechten) Spieler

source: Key Combo
de: Tastenkombination

source: Action
de: Aktion

source: Up Arrow
de: Pfeil hoch

source: <entry>Up</entry>
de: <entry>Hoch</entry>

source: Down Arrow
de: Pfeil runter

source: Down
de: Runter

source: Right Arrow
de: Pfeil rechts

source: Right
de: Rechts

source: Left Arrow
de: Pfeil links

source: Left
de: Links

source: Accelerate
de: Beschleunigung

source: Player 2 Shortcuts
de: Tastenkürzel für den linken Spieler

source: General Shortcuts
de: Allgemeine Tastenkürzel

source: Pause/Resume Game
de: Das Spiel unterbrechen oder fortsetzen.

source: High Scores
de: Die Bestenliste aufrufen.

source: New Game
de: Ein neues Spiel starten.

source: Quit &kappname;
de: &kappname; beenden

source: Help Contents
de: Das Handbuch zu &ktron;.

source: What's This Help
de: Die „Was ist das?“-Hilfe.

source: These shortcuts <ulink url="help:/fundamentals/shortcuts.html">can be changed</ulink> by selecting <menuchoice> <guimenu>Settings</guimenu> <guimenuitem>Configure Shortcuts...</guimenuitem> </menuchoice> from the menubar.
de: Alle Tastenkürzel können über das Menü <menuchoice><guimenu>Einstellungen</guimenu><guimenuitem>Kurzbefehle festlegen ...</guimenuitem> </menuchoice> <ulink url="help:/fundamentals/shortcuts.html">geändert</ulink> werden.

source: The Configuration Dialog
de: Der Einrichtungsdialog

source: Selecting the <guimenuitem>Configure &kappname;...</guimenuitem> option in the <guimenu>Settings</guimenu> menu will open a further dialog which lets you tweak &kappname;'s behavior.
de: Die Auswahl von <guimenuitem>&kappname; einrichten ...</guimenuitem> im Menü <guimenu>Einstellungen</guimenu> öffnet ein Fenster, in dem das Verhalten von &kappname; eingestellt werden kann.

source: This dialog is divided into two pages.
de: Der Dialog unterteilt sich in zwei Seiten.

source: <title>General Configuration</title>
de: <title>Allgemeine Einstellungen</title>

source: Configure &kappname; - General
de: &kappname; einrichten - Allgemein

source: <phrase>General Configuration</phrase>
de: <phrase>Allgemeine Einstellungen</phrase>

source: Game type
de: Spielart

source: This will let you change the game type. There are three options:
de: Hiermit kann die Spielart in eine der folgenden geändert werden:

source: &kappname;: Player vs Player
de: &kappname;: Mensch gegen Mensch

source: a &kappname; game between two human players
de: Ein &kappname;-Spiel zwischen zwei Menschen.

source: &kappname;: Player vs Computer
de: &kappname;: Mensch gegen Computer

source: a &kappname; game between a human player and the computer
de: Ein &kappname;-Spiel zwischen einen Menschen und den Computer.

source: &ksnake;: Single player
de: &ksnake;: Einzelspieler

source: a single player &ksnake; game
de: Ein Einzelspieler &ksnake;-Spiel.

source: Disable acceleration
de: Beschleunigen verhindern

source: Checking this box will disable the acceleration feature - pressing the acceleration key will have no effect, both vehicles will always travel with constant velocity.
de: Ist diese Einstellung markiert, kann im Spiel nicht beschleunigt werden. Eine Betätigung der Beschleunigungstaste hat keine Auswirkungen, beide Spieler bewegen sich immer mit der gleichen Geschwindigkeit.

source: Player Names
de: Spielernamen

source: Specify custom names to use for the players to override the use of default ones.
de: Hier können eigene Namen eintragen und damit die Standardnamen überschrieben werden.

source: The default name for player one is the name of the current logged in user.
de: Der Standardname für den (rechten) Spieler ist der des aktuell angemeldeten Benutzers.

source: <title>Theme Configuration</title>
de: <title>Designeinstellungen</title>

source: Configure &kappname; - Theme
de: &kappname; einrichten - Design

source: <phrase>Theme Configuration</phrase>
de: <phrase>Designeinstellungen></phrase>

source: This page will allow you to change the theme &kappname; uses.
de: Diese Seite ermöglicht das Wechseln des zu verwendenden Designs von &kappname;.

source: Credits and License
de: Danksagungen und Lizenz

source: Program Copyright 1998-2000 &Matthias.Kiefer; &Matthias.Kiefer.mail;
de: Programm Copyright 1998-2000 &Matthias.Kiefer; &Matthias.Kiefer.mail;

source: Program Copyright 2008-2009 &Stas.Verberkt; &Stas.Verberkt.mail;
de: Programm Copyright 2008-2009 &Stas.Verberkt; &Stas.Verberkt.mail;

source: Parts of the code are from xtron-1.1 by Rhett D. Jacobs <email>rhett@hotel.canberra.edu.au&gt;</email>
de: Teile des Quelltextes sind von <command>xtron-1.1</command> von Rhett D. Jacobs <email>rhett@hotel.canberra.edu.au&gt;</email>

source: Documentation Copyright 1999 &Matthias.Kiefer; &Matthias.Kiefer.mail;
de: Dokumentation Copyright 1999 &Matthias.Kiefer; &Matthias.Kiefer.mail;

source: Documentation updated for &kde; 2.0 by &Fabian.Dal.Santo; &Fabian.DalSanto.mail;
de: Dokumentation für &kde; 2.0 von &Fabian.Dal.Santo; &Fabian.DalSanto.mail; überarbeitet.

source: CREDIT_FOR_TRANSLATORS
de: <para>Übersetzung: Maren Pakura <email>maren@kde.org</email></para><para>Überarbeitung der Übersetzung: Johannes Obermayr <email>johannesobermayr@gmx.de</email></para>

source: How to obtain &kappname;
de: Erwerb von &kappname;

source: Requirements
de: Voraussetzungen

source: In order to successfully compile &kappname;, you need &kde; 4. All required libraries as well as &kappname; itself can be found on &kde-ftp;.
de: Für das erfolgreiche Kompilieren wird &kde;4 benötigt. Alle Bibliotheken wie auch &kappname; selbst erhalten befinden sich auf &kde-ftp;.

source: Compilation and Installation
de: Kompilieren und Installieren
