Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdegames/ktuberling.po
Languages: de

source: The &ktuberling; Handbook
de: Das Handbuch zu &ktuberling;

source: Reviewer
de: Korrektur

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Maren</firstname><surname>Pakura</surname><affiliation><address><email>maren@kde.org</email></address></affiliation><contrib>Deutsche Übersetzung</contrib></othercredit>

source: &ktuberling; is a game intended for small children.
de: &ktuberling; ist ein Spiel für kleine Kinder.

source: game
de: Spiel

source: <keyword>toy</keyword>
de: <keyword>Kinderspiel</keyword>

source: constructor
de: gestalten

source: doll
de: Puppe

source: decorating
de: verzieren

source: children
de: Kinder

source: tuberling
de: Kartoffelknülch

source: potato
de: Kartoffel

source: train station
de: Eisenbahnstation

source: one player
de: ein Spieler

source: Introduction
de: Einführung

source: Gametype: Toy
de: Spieltyp: Kinderspiel

source: Number of possible players: One
de: Anzahl der Spieler: Einer

source: &ktuberling; a simple constructor game suitable for children and adults alike. The idea of the game is based around a once popular doll making concept. A potato was decorated with various small artifacts to make it look more like a tiny person. &ktuberling; however, goes much further in terms of content and adds a surprising variety of different themes.
de: &ktuberling; ist ein einfaches Verkleidungsspiel für Kinder und jung gebliebene Erwachsene. Die Idee des Spiels stammt aus den bekannten Anziehspiel für Puppen. Eine Kartoffel wird mit verschiedenen kleinen Dingen verkleidet, damit sie einer Person ähnlich sieht. In &ktuberling; gibt es jedoch viel mehr Spielmöglichkeiten mit unterschiedlichen Designs.

source: How to Play
de: Spielanleitung

source: &ktuberling; is a game intended for small children. Of course, it may be suitable for adults who have remained young at heart.
de: &ktuberling; ist ein Spiel für kleine Kinder. Aber es ist auch für Erwachsene geeignet, die jung geblieben sind.

source: It is a <quote>potato editor</quote>. That means that you can drag and drop eyes, mouths, mustache, and other parts of face and goodies onto a potato-like guy. Similarly, you have other playgrounds with different themes.
de: Es ist ein <quote>Kartoffel-Editor</quote>. Das bedeutet, Sie können Augen, Münder, Schnurrbärte und andere Teile des Gesichts und Extras in den Kartoffel-Mann ziehen und dort ablegen (drag and drop). Außerdem gibt es noch andere Designs als Spielplätze.

source: There is no winner for the game. The only purpose is to make the funniest faces you can.
de: In diesem Spiel gibt es keinen Gewinner. Der einzige Sinn des Spiels besteht darin, das lustigste Gesicht zu machen, das möglich ist.

source: &ktuberling; can also <quote>speak</quote>. It will spell out the name of the objects you drag and drop. It will <quote>speak</quote> in a language that you can choose. You can even use it to learn a bit of vocabulary in foreign languages.
de: &ktuberling; kann auch <quote>sprechen</quote>. Das Programm <quote>spricht</quote> die Namen der Objekte, die Sie ziehen und fallenlassen. Die Sprache können Sie im Menü einstellen. Sie können also beim Spielen einige Vokabeln lernen.

source: Rules and Tips
de: Spielregeln und Tipps

source: Mouse Operation
de: Maus-Funktionen

source: There are two areas in the main window:
de: Es gibt zwei Bereiche im Hauptfenster:

source: <quote>Playground</quote> area.
de: das <quote>Spielfeld</quote>.

source: <quote>Objects</quote> area, where you select objects to place on your playground.
de: das <quote>Objekt</quote>-Feld. Hier können Sie die Objekte auswählen, die Sie auf dem Spielfeld platzieren möchten.

source: Note:
de: Hinweis:

source: An actual look of the application screen may change depending on a <quote>playground</quote> selected.
de: Das Erscheinungsbild des Programms hängt vom ausgewählten <emphasis>Spielfeld</emphasis> ab.

source: Main Window of &ktuberling;
de: Das &ktuberling;-Hauptfenster:

source: Main Window
de: Hauptfenster

source: Placing an Object
de: Platzieren eines Objekts

source: To drag an object, move the mouse pointer to the <quote>objects</quote> area and click on it. Then move it to the <quote>playground</quote> area and click again.
de: Um ein Objekt zu verschieben, bewegen Sie die Maus in das <quote>Objekte</quote>-Feld auf der rechten Seite. Klicken Sie mit der &LMBn; auf ein Objekt. Schieben Sie es dann in das <quote>Spielfeld</quote> und klicken Sie wieder, um es abzulegen.

source: Size of the objects may change while dragging. Some of the oversized objects have been scaled down to feet into the “objects” area.
de: Die Größe eines Objekts kann sich beim Ziehen ändern, Einige große Objekte werden im Objektfeld verkleinert angezeigt.

source: Moving an Object
de: Verschieben eines Objekts

source: Once dropped in the <quote>playground</quote> area, an object can be moved. Just click on the object to select it, move it to the new place and click again to drop it. When you drop it, it goes on top of other objects that were partially hiding it. This trick is useful for getting the glasses and eyes placed correctly.
de: Wenn Sie ein Objekt im <quote>Spielfeld</quote> abgelegt haben, können Sie es dort bewegen. Klicken Sie einfach auf das Objekt, um es auszuwählen, ziehen Sie es an den neuen Platz und klicken Sie nochmal, um es loszulassen. Es wird jetzt auf anderen Objekten abgelegt, falls es vorher teilweise verdeckt war. Dieser Trick ist hilfreich, um Augen und Brille richtig zu platzieren.

source: Removing an Object
de: Entfernen eines Objekts

source: To remove an object that has been dropped in the <quote>playground</quote> area, drag it back from the <quote>playground</quote> area to the <quote>objects</quote> area.
de: Um ein Objekt zu entfernen, das sich im <quote>Spielfeld</quote> befindet, ziehen Sie es einfach in das <quote>Objekt</quote>-Feld zurück.

source: Interface Overview
de: Die Benutzeroberfläche

source: The Tool Bar
de: Die Werkzeugleiste

source: Toolbar
de: Werkzeugleiste

source: The toolbar provides buttons for the commonly used functions.
de: Die Werkzeugleiste ermöglicht einen schellen Zugriff auf die am häufigsten gebrauchten Funktionen.

source: Toolbar Buttons
de: Die Knöpfe in der Werkzeugleiste

source: Button
de: Knopf

source: Menu Equivalent
de: Menüeintrag

source: Action
de: Aktion

source: New Game Button
de: Knopf <quote>Neues Spiel</quote>

source: <guiicon>New</guiicon>
de: <guiicon>Neu</guiicon>

source: <guimenu>Game</guimenu> <guimenuitem>New</guimenuitem>
de: <guimenu>Spiel</guimenu> <guimenuitem>Neu</guimenuitem>

source: Resets the <quote>playground</quote> area. This cleans all parts of the playground so a new decoration may be created.
de: Löscht alles vom <quote>Spielfeld</quote>, sodass eine neue Dekoration geschaffen werden kann.

source: Load Button
de: Knopf <quote>Laden</quote>

source: Load
de: Laden

source: <guimenu>Game</guimenu> <guimenuitem>Load...</guimenuitem>
de: <guimenu>Spiel</guimenu> <guimenuitem>Laden ...</guimenuitem>

source: Opens an existing tuberling file from the disk.
de: Lädt eine vorhandene Kartoffelknülch-Datei von der Festplatte.

source: Save Button
de: Knopf <quote>Speichern</quote>

source: Save
de: Speichern

source: <guimenu>Game</guimenu> <guimenuitem>Save</guimenuitem>
de: <guimenu>Spiel</guimenu> <guimenuitem>Speichern</guimenuitem>

source: Saves your creation to your home folder, or to some other folder on your disk. The tuberling is saved to a small file where only the position of objects are saved.
de: Speichert Ihre Kreation in Ihrem persönlichen Ordner, oder, wenn Sie es wünschen, in einem anderen Ordner auf der Festplatte. Der Kartoffelknülch wird in einer kleinen Datei gespeichert, in der nur die Positionen der Objekte gepeichert werden.

source: Print Button
de: Knopf <quote>Drucken</quote>

source: Print
de: Drucken

source: <guimenu>Game</guimenu> <guimenuitem>Print...</guimenuitem>
de: <guimenu>Spiel</guimenu> <guimenuitem>Drucken ...</guimenuitem>

source: Prints your picture.
de: Druckt Ihr Bild.

source: Undo Button
de: Knopf <quote>Rückgängig</quote>

source: Undo
de: Rückgängig

source: <guimenu>Edit</guimenu> <guimenuitem>Undo</guimenuitem>
de: <guimenu>Bearbeiten</guimenu><guimenuitem>Rückgängig</guimenuitem>

source: Undoes last operation.
de: Macht den letzten Vorgang rückgänig.

source: Redo Button
de: Knopf <quote>Wiederherstellen</quote>

source: Redo
de: Wiederherstellen

source: <guimenu>Edit</guimenu> <guimenuitem>Redo</guimenuitem>
de: <guimenu>Bearbeiten</guimenu><guimenuitem>Wiederherstellen</guimenuitem>

source: Re-does last operation.
de: Stellt den letzten Vorgang wieder her.

source: The Menu Items
de: Die Menüeinträge

source: The <guimenu>Game</guimenu> Menu
de: Das Menü <guimenu>Spiel</guimenu>

source: <guimenu>Game</guimenu> Menu
de: Das Menü <guimenu>Spiel</guimenu>

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo> </shortcut> <guimenu>Game</guimenu> <guimenuitem>New</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo> </shortcut> <guimenu>Spiel</guimenu> <guimenuitem>Neu</guimenuitem>

source: <action>Clears</action> the <quote>playground</quote> area
de: <action>Löscht</action> das <quote>Spielfeld</quote>.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>O</keycap></keycombo> </shortcut> <guimenu>Game</guimenu> <guimenuitem>Load...</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>O</keycap></keycombo> </shortcut> <guimenu>Spiel</guimenu> <guimenuitem>Laden ...</guimenuitem>

source: <action>Opens an existing tuberling file</action> from your disk.
de: <action>Lädt eine existierende Kartoffelknülch-Datei</action> vom Laufwerk.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>S</keycap></keycombo> </shortcut> <guimenu>Game</guimenu> <guimenuitem>Save</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>S</keycap></keycombo> </shortcut> <guimenu>Spiel</guimenu> <guimenuitem>Speichern</guimenuitem>

source: <action>Saves</action> your creation. The tuberling is saved to a small file where only the position of objects are saved.
de: <action>Speichert</action> Ihre Kreation. Der Kartoffelknülch wird in einer kleinen Datei gespeichert, wo nur die Position der Objekte gepeichert wird.

source: <guimenu>Game</guimenu> <guimenuitem>Save as Picture...</guimenuitem>
de: <guimenu>Spiel</guimenu><guimenuitem>Als Bild speichern ...</guimenuitem>

source: <action>Creates a graphics file</action> containing a picture of your tuberling.
de: <action>Erzeugt eine Grafikdatei</action>, die ein Bild von Ihrem Kartoffelknülch enthält.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>P</keycap></keycombo> </shortcut> <guimenu>Game</guimenu> <guimenuitem>Print...</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>P</keycap></keycombo> </shortcut> <guimenu>Spiel</guimenu> <guimenuitem>Drucken ...</guimenuitem>

source: <action>Prints</action> your tuberling picture.
de: <action>Druckt</action> Ihr Kartoffelknülch-Bild.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo> </shortcut> <guimenu>Game</guimenu> <guimenuitem>Quit</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo> </shortcut> <guimenu>Spiel</guimenu> <guimenuitem>Beenden</guimenuitem>

source: <action>Quit</action> &ktuberling;.
de: <action>Beendet</action> &ktuberling;.

source: The <guimenu>Edit</guimenu> Menu
de: Das Menü <guimenu>Bearbeiten</guimenu>

source: Edit Menu
de: Menü Bearbeiten

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Z</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Undo</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Z</keycap></keycombo> </shortcut> <guimenu>Bearbeiten</guimenu> <guimenuitem>Rückgängig</guimenuitem>

source: <action>Undo</action> the last <quote>object</quote> placement.
de: Macht die letzte <quote>Objekt</quote>-Platzierung rückgängig.

source: <shortcut> <keycombo action="simul">&Ctrl;&Shift; <keycap>Z</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Redo</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>Z</keycap></keycombo> </shortcut> <guimenu>Bearbeiten</guimenu> <guimenuitem>Wiederherstellen</guimenuitem>

source: <action>Re-does</action> the last <quote>object</quote> placement. This menu option is active only if you have previously used <guilabel>Undo</guilabel>.
de: Stellt die letzte <quote>Objekt</quote>-Platzierung wieder her. Diese Menü-Option ist erst dann aktiviert, wenn Sie vorher <guilabel>Rückgängig</guilabel> benutzt haben.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>C</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Copy</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>C</keycap></keycombo> </shortcut> <guimenu>Bearbeiten</guimenu> <guimenuitem>Kopieren</guimenuitem>

source: <action>Copy</action> the <quote>playground</quote> area to the clipboard.
de: <action>Kopiert</action> das <quote>Spielfeld</quote> in die Zwischenablage.

source: The <guimenu>Playground</guimenu> Menu
de: Das Menü <guimenu>Spielfeld</guimenu>

source: <guimenu>Playground</guimenu> <guimenuitem>Lock Aspect Ratio</guimenuitem>
de: <guimenu>Spielfeld</guimenu><guimenuitem>Seitenverhältnis beibehalten</guimenuitem>

source: This option preserves the playground aspect ratio when resizing the &ktuberling; window. When the playground aspect ratio does not match the one of the window the background is filled with the one specified in the theme.
de: Mit dieser Einstellung wird das Seitenverhältnis des Spielfeldes beim Ändern der Fenstergröße von &ktuberling; beibehalten. Wenn das Seitenverhältnis des Spielfeldes mit dem des Fensters nicht übereinstimmt, so wird die <emphasis>Freifläche</emphasis> des Fensters mit dem festgelegten Hintergrund gefüllt.

source: <guimenu>Playground</guimenu> <guimenuitem><replaceable>Playground Name</replaceable></guimenuitem>
de: <guimenu>Spielfeld</guimenu> <guimenuitem><replaceable>Name des Spielfeldes</replaceable></guimenuitem>

source: <action>Switches to the playground</action>.
de: <action>Wechselt zu diesem Spielfeld</action>.

source: It will contain the playgrounds installed in your system.
de: Hier sind alle Spielfelder enthalten, die auf Ihrem System installiert sind.

source: &ktuberling; remembers the last chosen playground the next time it starts up.
de: &ktuberling; merkt sich das zuletzt benutzte Spielfeld für den nächsten Programmstart.

source: The <guimenu>Speech</guimenu> Menu
de: Das Menü <guimenu>Sprache</guimenu>

source: <guimenu>Speech</guimenu> <guimenuitem>No Sound</guimenuitem>
de: <guimenu>Sprache</guimenu><guimenuitem>Keine Sprachausgabe</guimenuitem>

source: <action>Toggles sound off</action>.
de: <action>Schaltet</action> die Sprachausgabe ab.

source: <guimenu>Speech</guimenu> <guimenuitem><replaceable>Language Name</replaceable></guimenuitem>
de: <guimenu>Sprache</guimenu><guimenuitem><replaceable>Name der Sprache</replaceable></guimenuitem>

source: <action>Toggles sound on and speaks the selected language</action>.
de: <action>Schaltet</action> das Vorlesen der Objekte in der gewählten Sprache ein.

source: &ktuberling; remembers of this option the next time it starts up.
de: &ktuberling; merkt sich die Einstellung für den nächsten Programmstart.

source: The <guimenu>Settings</guimenu> Menu
de: Das Menü <guimenu>Einstellungen</guimenu>

source: Settings Menu
de: Menü Einstellungen

source: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>F</keycap></keycombo> </shortcut> <guimenu>Settings</guimenu> <guimenuitem>Full Screen Mode</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>F</keycap></keycombo> </shortcut> <guimenu>Einstellungen</guimenu> <guimenuitem>Vollbildmodus</guimenuitem>

source: <action>Toggles the Full Screen mode</action> on and off.
de: <action>Schaltet den Vollbildmodus</action> ein oder aus.

source: Additionally &ktuberling; has the common &kde; <guimenu>Settings</guimenu> and <guimenu>Help</guimenu> menu items, for more information read the sections about the <ulink url="help:/fundamentals/ui.html#menus-settings">Settings Menu</ulink> and <ulink url="help:/fundamentals/ui.html#menus-help">Help Menu</ulink> of the &kde; Fundamentals.
de: Zusätzlich hat &ktuberling; die bekannten &kde;-Einträge im Menü <guimenu>Einstellungen</guimenu> und <guimenu>Hilfe</guimenu>, weitere Informationen dazu finden Sie in den Abschnitten über die Menüs <ulink url="help:/fundamentals/ui.html#menus-settings">Einstellungen</ulink> und <ulink url="help:/fundamentals/uihtml#menus-help">Hilfe</ulink> der &kde;-Grundlagen.

source: Frequently Asked Questions
de: Häufig gestellte Fragen

source: I want to change the way this game looks. Can I?
de: Kann ich das Erscheinungsbild des Spiels ändern?

source: Yes you can. Refer to <link linkend="theme_change">this</link> section of 'Interface Overview' for details.
de: Ja, wählen Sie im Menü <link linkend="theme_change"><guimenu>Spielfeld</guimenu></link> ein neues Design aus.

source: Can I use the keyboard to play this game?
de: Kann ich mit der Tastatur spielen?

source: No. This game cannot be played using keyboard.
de: Nein, dieses Spiel kann nicht mit der Tastatur gespielt werden.

source: I have made a great picture and I want to share it with my friends. Can I save it as an image?
de: Ich habe ein tolles Bild gemalt und möchte es meinen Freunden zeigen. Kann ich das Bild speichern?

source: Yes. To save the current session as an image refer to <link linkend="game-save-as-picture">this</link> section of 'Interface Overview' for details.
de: Ja, um ein Bild zu speichern, wählen Sie <link linkend="game-save-as-picture"> <menuchoice><guimenu>Spiel</guimenu><guimenuitem>Als Bild speichern ...</guimenuitem> </menuchoice></link> in der Menüleiste.

source: Credits and License
de: Danksagungen und Lizenz

source: Alex Fiestas <email>alex@eyeos.org</email> - current Maintainer
de: Alex Fiestas <email>alex@eyeos.org</email> - aktueller Betreuer

source: John Calhoun - Original idea, original pictures and English sounds
de: Von John Calhoun stammt die urprüngliche Idee, die Bilder und die englischen Klänge.

source: &Eric.Bischoff; &Eric.Bischoff.mail; - &kde; Programming
de: &Eric.Bischoff; &Eric.Bischoff.mail; - &kde;-Programmierung.

source: Fran&ccedil;ois-Xavier Duranceau <email>duranceau@free.fr</email> - Tests, advice and help
de: Fran&ccedil;ois-Xavier Duranceau <email>duranceau@free.fr</email> hat getestet, Hinweise und Hilfe gegeben.

source: Peter Silva <email>peter.silva@videotron.ca</email> - Proofreading of the documentation
de: Peter Silva <email>peter.silva@videotron.ca</email> hat dieses Dokument Korrektur gelesen.

source: Paul Ahlquist &Paul.E.Ahlquist.Jr.mail; - Bettering of documentation
de: Paul Ahlquist &Paul.E.Ahlquist.Jr.mail; - Bearbeitung der Dokumentation

source: CREDIT_FOR_TRANSLATORS
de: <para>Übersetzung: Maren Pakura <email>maren@kde.org</email></para><para>Überarbeitung der Übersetzung: Johannes Obermayr <email>johannesobermayr@gmx.de</email></para>
