Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdegames/ktuberling_technical-reference.po
Languages: de

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Johannes</firstname><surname>Obermayr</surname><affiliation><address><email>johannesobermayr@gmx.de</email></address></affiliation><contrib>Übersetzung</contrib></othercredit>

source: technical reference
de: Technische Referenz

source: Technical References
de: Technische Referenz

source: &ktuberling; offers a gentle and rewarding introduction to &kde; customization and programming. The application can be extended. For example, without any coding, new playgrounds can be added by changing the graphics files. By adding appropriate sound files, translators can change the sounds to their native tongue!
de: &ktuberling; bietet eine sanfte und lohnende Einführung in die Anpassung und Programmierung von &kde;. &ktuberling; kann beliebig erweitert werden. So können beispielsweise neue Spielfelder ohne Programmieren durch Ändern der Grafikdateien hinzugefügt werden. Durch Hinzufügen geeigneter Audiodateien können Übersetzer die Klänge in ihre Muttersprache ändern.

source: If you extend or add to the game please consider sending your additions to the maintainer <ulink url="mailto:alex@eyeos.org">Alex Fiestas</ulink> for inclusion in future releases.
de: Sollten Erweiterungen oder Ergänzungen zum Spiel vorgenommen werden, wird um deren Übersendung an den derzeitigen Betreuer <ulink url="mailto:alex@eyeos.org">Alex Fiestas</ulink> zur Berücksichtung in künftigen Versionen gebeten.

source: For Artists
de: Grafiker

source: To create a new &ktuberling; playground you have to:
de: Zum Erstellen eines neuen <emphasis>Spielfeldes</emphasis> für &ktuberling; sind folgende Maßnahmen notwendig:

source: Draw the playground in a SVG file, there you have to:
de: Zeichnen eines <emphasis>Spielfeldes</emphasis> in einer <filename>*.svg</filename>-Datei unter Beachtung, dass

source: Name the place where items can dragged "background".
de: der Ort, an den die Objekte gezogen werden, den Namen „background“ erhält.

source: Name each of the draggable items with an unique name.
de: jedes <emphasis>ziehbare</emphasis> Objekt einen einzigartigen Namen erhält.

source: Create a .theme file, it has to follow this schema:
de: Erstellen einer <filename>*.theme</filename>-Datei mit folgendem Schema:

source: &lt;playground gameboard="<replaceable>yourSVGFile</replaceable>" name="<replaceable>theDesktopFile</replaceable>"&gt; &lt;object name="<replaceable>itemName</replaceable>" sound="<replaceable>soundName</replaceable>" scale="<replaceable>someValue</replaceable>" /&gt; ... ... ... &lt;/playground&gt;
de: &lt;playground gameboard="<replaceable>svg-Datei</replaceable>" name="<replaceable>desktop-Datei</replaceable>"&gt; &lt;object name="<replaceable>Objektname</replaceable>" sound="<replaceable>Klangname</replaceable>"scale="<replaceable>beliebigerWert</replaceable>" /&gt; ... ... ... &lt;/playground&gt;

source: <replaceable>yourSVGFile</replaceable> is the name of the svg file that has the drawing.
de: <replaceable>svg-Datei</replaceable> ist der Name für die <filename>svg</filename>-Datei mit den Objekten.

source: <replaceable>theDesktopFile</replaceable> is the name of the desktop file that has the name of the theme.
de: <replaceable>desktop-Datei</replaceable> ist der Name der <filename>desktop</filename>-Datei, die den Namen des Designs beinhaltet.

source: For each object you need a &lt;object&gt; entry. <replaceable>itemName</replaceable> is the unique name you used on the SVG file, <replaceable>soundName</replaceable> is the sound name that will be played when dragging it, see sound themes howto for more information.
de: Für jedes Objekt ist ein &lt;object&gt;-Eintrag erforderlich. <replaceable>Objektname</replaceable> ist der einzigartige Name innerhalb der <filename>svg</filename>-Datei und <replaceable>Klangname</replaceable> ist der Name des beim Ziehen des Objektes wiedergegebenen Klanges.

source: scale is optional and <replaceable>someValue</replaceable> is the scale factor that will be used when drawing this object outside the warehouse, if not specified is 1.
de: <emphasis>scale</emphasis> ist ein zusätzlicher Wert. <replaceable>beliebigerWert</replaceable> wird dabei als Wert für die Vergrößerung des Objektes verwendet, sobald es aus dem Depot „geholt“ wird. Bei unterbliebener Festlegung wird als Wert <keycap>1</keycap> verwendet.

source: Create a .desktop file, it has to follow this schema
de: Erstellen einer <filename>*.desktop</filename>-Datei nach folgendem Schema:

source: [KTuberlingTheme] Name=<replaceable>themeName</replaceable>
de: [KTuberlingTheme] Name=<replaceable>Designname</replaceable>

source: <replaceable>themeName</replaceable> is the name that identifies the theme, will be shown in the Playground menu.
de: <replaceable>Designname</replaceable> ist der identifizierende Name des Designs und wird im Menü <guimenu>Spielfeld</guimenu> angezeigt.

source: If you are adding the theme to &ktuberling; repository, add .svg .theme .desktop files to FILES section of the CMakeLists.txt in the pics/ directory
de: Beim Hochladen des Designs zum <emphasis>Git</emphasis>-Quelltextarchiv von &kde; müssen die <filename>*.svg</filename>-, <filename>*.theme</filename>- und <filename>*.desktop</filename>-Datei im Abschnitt <emphasis>FILES</emphasis> der Datei <filename>CMakeLists.txt</filename> des Ordners <filename>pics/</filename> eingetragen werden.

source: If you want to install it for yourself, place .svg .theme .desktop files in `kde4-config --prefix`/share/apps/ktuberling/pics
de: Zur Verwendung auf dem lokalen System müssen die <filename>*.svg</filename>-, <filename>*.theme</filename>- und <filename>*.desktop</filename>-Datei im Ordner <filename>`kde4-config --prefix`/share/apps/ktuberling/pics</filename> vorhanden sein.

source: For Translators
de: Übersetzer

source: Besides the usual <literal role="extension">.po</literal> files mechanism for translating program labels and prompts, the sounds can be localized too.
de: Neben dem üblichen Übersetzen der <filename>.po</filename>-Dateien für die grafische Oberfläche können für &ktuberling; auch die Klänge lokalisiert werden.

source: To create a new &ktuberling; sound theme you have to:
de: Zum Erstellen eines neuen Klangdesigns für &ktuberling; sind folgende Maßnahmen notwendig:

source: Record the sounds in OGG Vorbis rc3 file format.
de: Die Klänge im Format <emphasis>OGG Vorbis rc3</emphasis> speichern.

source: Create a <replaceable>yourLanguageTwoLetterCode</replaceable>.soundtheme file, it has to follow this schema:
de: Erstellen einer <filename><replaceable>de</replaceable>.soundtheme</filename>-Datei mit folgendem Schema:

source: &lt;language code="<replaceable>yourLanguageTwoLetterCode</replaceable>"&gt; &lt;sound name="<replaceable>soundName</replaceable>" file="<replaceable>relativePath</replaceable>" /&gt; ... ... ... &lt;/language&gt;
de: &lt;language code="<replaceable>de</replaceable>"&gt; &lt;sound name="<replaceable>Klangname</replaceable>" file="<replaceable>relativerPfad</replaceable>" /&gt; ... ... ... &lt;/language&gt;

source: <replaceable>yourLanguageTwoLetterCode</replaceable> is your language two letter code, for example gl for Galician.
de: <replaceable>de</replaceable> wird hier und im Folgenden nur beispielhaft für Deutsch verwendet. Für andere Sprachen muss stattdessen das jeweilige Sprachenkürzel eingesetzt werden.

source: For each sound a &lt;sound&gt; entry. <replaceable>soundName</replaceable> should match with the soundName specified in the playground theme (see themes HOWTO). <replaceable>relativePath</replaceable> should be the relative path you are going to install the file with this sound to, typically it will be someUniquePath/soundName.format (someUniquePath can be your language two letter code for example).
de: Für jeden Klang ist ein &lt;sound&gt;-Eintrag erforderlich. <replaceable>Klangname</replaceable> sollte mit dem Klangnamen im <emphasis>Spielfeld</emphasis>-Design übereinstimmen. <replaceable>relativerPfad</replaceable> ist der relative Pfad zur Klangdatei und typischerweise <filename><replaceable>einzigartigerPfad</replaceable>/Klangname.format</filename> wobei <replaceable>einzgartigerPfad</replaceable> beispielsweise <replaceable>de</replaceable> sein kann.

source: If you are adding the sound theme to &ktuberling; in your language folder:
de: Beim Hochladen des lokalisierten Klangdesigns in Ihren Sprachenordner müssen

source: Add the sound files and the .soundtheme files to the data/kdegames/ktuberling directory of your language translations.
de: die Klang- und <filename>*.soundtheme</filename>-Dateien im Ordner <filename>l10n-kde4/<replaceable>de</replaceable>/data/kdegames/ktuberling</filename> vorliegen.

source: On that very same dir you need a CMakeLists.txt describing how to install the files, typically it will be.
de: im selben Ordner die Datei <filename>CMakeLists.txt</filename> mit der Beschreibung für die Installation nach folgendem Muster vorliegen:

source: FILE(GLOB datafiles *.ogg) install( FILES ${datafiles} DESTINATION ${DATA_INSTALL_DIR}/ktuberling/sounds/<replaceable>yourLanguageTwoLetterCode</replaceable> ) install( FILES <replaceable>yourLanguageTwoLetterCode</replaceable>.soundtheme DESTINATION ${DATA_INSTALL_DIR}/ktuberling/sounds/ )
de: FILE(GLOB datafiles *.ogg) install( FILES ${datafiles} DESTINATION ${DATA_INSTALL_DIR}/ktuberling/sounds/<replaceable>de</replaceable> ) install( FILES <replaceable>de</replaceable>.soundtheme DESTINATION ${DATA_INSTALL_DIR}/ktuberling/sounds/ )

source: If you want to install it for yourself:
de: Zur Verwendung auf dem lokalen System müssen

source: Place <replaceable>yourLanguageTwoLetterCode</replaceable>.soundtheme file in `kde4-config --prefix`/share/apps/ktuberling/sounds
de: die <filename><replaceable>de</replaceable>.soundtheme</filename>-Datei im Ordner <filename>`kde4-config --prefix`/share/apps/ktuberling/sounds</filename> vorhanden sein

source: Place yourSoundFiles in `kde4-config --prefix`/share/apps/ktuberling/sounds/someUniquePath
de: die lokalisierten Klangdateien im Ordner <filename>`kde4-config --prefix`/share/apps/ktuberling/sounds/<replaceable>einzigartigerOrdner</replaceable></filename> vorhanden sein.

source: Information on how to work with the translation mechanisms in &kde; is available in <ulink url="http://l10n.kde.org/docs/translation-howto/index.html">The &kde; Translation HOWTO</ulink>.
de: Informationen zur Arbeit mit dem Übersetzungssystem von &kde; sind in der <ulink url="http://l10n.kde.org/docs/translation-howto/index.html">&kde;-Übersetzungsanleitung</ulink> verfügbar.

source: For Programmers
de: Entwickler

source: &ktuberling; isn't really difficult to extend for programmers.
de: Die Erweiterung von &ktuberling; durch Entwickler ist nicht wirklich schwierig.

source: C++ classes
de: C++-Klassen

source: Top-level window and basic program management
de: Sichtbares Fenster und grundlegende Programmverwaltung

source: Description of one of the game levels
de: Beschreibung einer Spielfeldebene

source: Description of one of the graphical <quote>objects</quote> to be drawn
de: Beschreibung eines darzustellenden grafischen <emphasis>Objekts</emphasis>

source: Description of one of the languages and its sounds
de: Beschreibung einer Sprache und deren Klänge

source: One of the user's manipulation in the undo/redo stack
de: Eine der Veränderungen des Benutzers im „Rückgängig/Wiederherstellen“-Stapel
