Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdegames/kubrick.po
Languages: de

source: <guimenu>Settings</guimenu><guimenuitem>Configure Toolbars...</guimenuitem>
de: <guimenu>Einstellungen</guimenu><guimenuitem>Werkzeugleisten einrichten ...</guimenuitem>

source: <action>Open a dialog where you can configure the toolbar actions</action> for &kubrick;.
de: <action>Öffnet den &kde;-Standarddialog zur Einrichtung der Werkzeugleisten</action> für &kubrick;.

source: <guimenu>Settings</guimenu><guimenuitem>&kubrick; Game Settings</guimenuitem>
de: <guimenu>Einstellungen</guimenu><guimenuitem>&kubrick; einrichten ...</guimenuitem>

source: Open a game settings dialog. See <link linkend="configuration">Game Configuration</link> section for more details.
de: Hiermit wird ein Dialog für die Spieleinstellungen geöffnet. Eine nähere Beschreibung hierzu ist im Abschnitt <link linkend="configuration">Spieleinstellungen</link> enthalten.

source: Additionally &kubrick; has the common &kde; <guimenu>Settings</guimenu> and <guimenu>Help</guimenu> menu items, for more information read the sections about the <ulink url="help:/fundamentals/ui.html#menus-settings">Settings Menu</ulink> and <ulink url="help:/fundamentals/ui.html#menus-help">Help Menu</ulink> of the &kde; Fundamentals.
de: Zusätzlich hat &kubrick; die bekannten &kde;-Einträge im Menü <guimenu>Einstellungen</guimenu> und <guimenu>Hilfe</guimenu>, weitere Informationen dazu finden Sie in den Abschnitten über die Menüs <ulink url="help:/fundamentals/ui.html#menus-settings">Einstellungen</ulink> und <ulink url="help:/fundamentals/uihtml#menus-help">Hilfe</ulink> der &kde;-Grundlagen.

source: Frequently Asked Questions
de: Häufig gestellte Fragen

source: How do I pause the game?
de: Wie halte ich ein Spiel an?

source: &kubrick; does not have a <quote>Pause</quote> feature, because none is required. If a demo is running, just click anywhere to stop it.
de: &kubrick; kann nicht pausiert werden, da es nicht notwendig ist. Solange ein Beispielwürfel angezeigt wird, muss nur irgendwo geklickt werden, damit die Animation beendet wird.

source: Can I change the way this game looks?
de: Kann ich das Erscheinungsbild des Spiels ändern?

source: Currently you can change the view, using the <guimenu>View </guimenu> menu, the amount and speed of animation and the bevel on the edges of the cubies, using the <guimenu>Settings</guimenu> menu.
de: Derzeit können die Ansicht mittels dem Menü <guimenu>Ansicht</guimenu> und die Animation der Drehungen sowie die Abrundung der Kanten der <quote>Würfelchen</quote> mittels dem Menü <guimenu>Einstellungen</guimenu> geändert werden.

source: I have made a mistake. Can I undo?
de: Ich habe einen Fehler gemacht. Kann ich einen Spielzug zurücknehmen?

source: Yes. This is one of the strengths of &kubrick; as compared to a real puzzle. You can undo and redo moves to any level, or undo all moves and start again. To undo and redo moves, use the <guimenu>Move</guimenu> menu or the corresponding keyboard shortcuts and toolbar buttons.
de: Ja. Dies ist eine der Stärken von &kubrick; gegenüber dem realen Würfel. Es können alle Drehungen zurückgenommen und auch wiederhergestellt oder auch mit dem Würfel von neuem begonnen werden. Hierfür stehen das Menü <guimenu>Zug</guimenu>, die entsprechenden Tastaturkürzel und die Knöpfe in der Werkzeugleiste zur Verfügung.

source: Can I use the keyboard to play this game?
de: Kann ich mit der Tastatur spielen?

source: Yes. &kubrick; has keyboard moves based on the X, Y and Z axes and others based on Singmaster notation, which uses one-letter abbreviations for Front, Back, Left, Right, Up and Down faces of the cube.
de: Ja. &kubrick; bietet die Möglichkeit den Würfel an der X-, Y- und Z-Achse mit der Tastatur oder mittels Singmasters Beschreibung, welche einen Buchstaben für Links, Rechts, Vor, Zurück, Oben und Unten verwendet, zu drehen.

source: I cannot figure out what to do here! Are there hints?
de: Gibt es Tipps für die Lösung des Würfels?

source: No. However, the 3x3x3 <trademark>Rubik's Cube</trademark> has been extensively analysed and you can find solution methods on the Internet and in menu item <menuchoice><guimenu>Demos</guimenu><guisubmenu>Solution Moves</guisubmenu> </menuchoice> (<quote>Info</quote> item and demonstrations of moves).
de: Nein. Der klassische <trademark>Rubik Würfel</trademark> mit einer Kantenlänge von 3×3×3 ist gründlich untersucht worden. Hinweise zu Lösungsmethoden finden Sie im Internet und im Menü <menuchoice><guimenu>Demomodus</guimenu><guisubmenu>Lösungsversuche</guisubmenu></menuchoice> sowohl als allgemeine Information wie auch als spezielle Anweisungen für bestimmte Spielzüge.

source: I have to quit the game now. Can I save my position?
de: Das Spiel muss unterbrochen werden. Kann der aktuelle Spielstand gespeichert werden?

source: Yes. In fact your position is saved automatically when you quit, just as when you put a real cube back on the shelf. You can also save a particular position by using menu item <menuchoice><guimenu>Game</guimenu> <guimenuitem>Save Puzzle...</guimenuitem></menuchoice> and the corresponding shortcut keys and toolbar button.
de: Ja. Beim Verlassen von &kubrick; wird der aktuelle Spielstand automatisch gespeichert - so wie der reale Würfel zurückgelassen wird. Der Würfel kann aber auch jederzeit mittels <menuchoice><guimenu>Spiel</guimenu><guimenuitem>Würfel speichern ...</guimenuitem></menuchoice>, dem entsprechenden Tastaturkürzel oder dem Knopf in der Werkzeugleiste gespeichert werden.

source: How do I restore the game I saved?
de: Wie kann ein gespeichertes Spiel geladen werden?

source: Your automatically saved game is restored automatically when you start &kubrick;. To load other saved games, use <menuchoice><guimenu>Game </guimenu><guimenuitem>Load Saved Puzzle...</guimenuitem></menuchoice> and the corresponding shortcut keys and toolbar button.
de: Der automatisch gespeicherte Würfel wird mit dem Start von &kubrick; geladen. Die manuell gespeicherten Würfel können mittels <menuchoice><guimenu>Spiel</guimenu><guimenuitem>Würfel laden ...</guimenuitem></menuchoice>, dem entsprechenden Tastaturkürzel oder dem Knopf in der Werkzeugleiste geladen werden.

source: Where are the high scores?
de: Wo befindet sich die Bestenliste?

source: &kubrick; does not have such a feature.
de: In &kubrick; gibt es keine Bestenliste.

source: Game Configuration
de: Spieleinstellungen

source: To open a configuration (settings) dialog use one of the menubar items: <menuchoice><guimenu>Settings</guimenu><guimenuitem>&kubrick; Game Settings...</guimenuitem></menuchoice> or <menuchoice><guimenu>Game</guimenu> <guisubmenu>Choose Puzzle Type</guisubmenu></menuchoice>, sub-menu <guimenuitem>Make Your Own...</guimenuitem> Only the latter dialog has the options to change the cube dimensions and shuffling difficulty. Below is a list of the options available.
de: Die Einstellungsdialoge können wie folgt aufgerufen werden: <menuchoice><guimenu>Einstellungen</guimenu><guimenuitem>&kubrick; einrichten ...</guimenuitem></menuchoice> oder <menuchoice><guimenu>Spiel</guimenu><guimenuitem>Würfelart wählen</guimenuitem><guimenuitem>Eigener Würfel ...</guimenuitem></menuchoice>. Die Würfelgröße und Schwierigkeit kann jedoch nur mittels letzteren mit folgenden Möglichkeiten eingestellt werden:

source: Watch shuffling in progress?
de: Verdrehen animieren

source: <action>Provides an animated view of the cube when it is being shuffled by the &kubrick; program.</action> You can select the speed of animation.
de: Hiermit wird die animierte Überwachung des Verdrehens - durch &kubrick; - mit einer einstellbaren Geschwindigkeit ermöglicht.

source: Watch your moves in progress?
de: Eigene Drehungen animieren

source: Provides an animated view of your own moves at a speed you can select.
de: Hiermit wird die animierte Überwachung der eigenen Drehnungen mit einer einstellbaren Geschwindigkeit ermöglicht.

source: Speed of moves:
de: Dreh-Geschwindigkeit:

source: <action>Sets the speed at which animations go. </action> The range is 1 to 15 degrees of turn per animation frame.
de: <action>Hiermit wird die Geschwindigkeit der Animation für das Verdrehen und Drehen eingestellt.</action> Es sind abgestufte Werte von 1 bis 15 je animiertes Bild möglich.

source: % of bevel on edges of cubies:
de: Abrundung der Würfelkanten (in %):

source: <action>Sets the percentage of bevelled edge on each cubie, relative to the size of the colored stickers.</action> It affects the overall shape of each cubie. The range is from 4% to 30%.
de: Hiermit wird die Abrundung der Würfelkanten der einzelnen <quote>Würfelchen</quote> - relativ zur farbigen Fläche - eingestellt. Sie wirkt sich auf alle Kanten aller <quote>Würfelchen</quote> aus. Es sind prozentuale Werte zwischen 4 und 30 möglich.

source: Cube dimensions:
de: Würfelgröße:

source: <action>Sets the three dimensions of the cube, brick or mat in cubies per side.</action> Dimensions can range from 2x2x1 up to 6x6x6: the larger the dimensions, the harder the puzzle. Only one of the dimensions can be 1, otherwise the puzzle becomes too easy.
de: Hiermit werden die drei Kantenlängen des Würfels in <quote>Würfelchen</quote> pro Kante eingestellt. Es sind Kantenlängen von 2×2×1 bis 6×6×6 möglich. Es ist zu beachten, dass je größer die Kantenlängen, desto schwieriger wird die Lösung des Würfels. Weiterhin kann nur einmal die Kantenlänge von 1 gewählt werden, da sonst die Lösung des Würfels zu einfach wäre.

source: Moves per shuffle (difficulty):
de: Anzahl der Verdrehungen (Schwierigkeitsgrad):

source: <action>Sets the number of moves the &kubrick; program will use to shuffle the cube.</action> The number can range from 0 to 50: the more moves, the harder the puzzle. 2, 3 or 4 shuffling moves make for relatively easy puzzles, especially if the shuffling moves can be watched.
de: <action>Hiermit wird eingestellt, wie oft der Würfel von &kubrick; verdreht werden soll.</action> Es sind Werte zwischen 0 und 50 möglich. Es ist zu beachten, dass je höher der Wert, desto schwieriger wird die Lösung des Würfels. Zwei, drei oder vier Verdrehungen machen die Lösung des Würfels ziemlich einfach - besonders bei animierten Verdrehen.

source: Selecting zero moves can be useful if you wish to experiment with different sequences of moves and what they do to the cube, such as when you are searching for pretty patterns or new solving moves.
de: Keine Verdrehungen können hilfreich sein, falls mit eigenen Verdrehungen experimentiert werden soll, damit die Auswirkungen auf den Würfel nachvollzogen werden können (z. B. bei der Suche von <quote>schönen Würfeln</quote> oder neuen Lösungswegen).

source: Credits and License
de: Danksagungen und Lizenz

source: &kubrick; is Copyright 2008 Ian Wadham <email>ianw@netspace.net.au</email>
de: &kubrick; © 2008 Ian Wadham <email>ianw@netspace.net.au</email>

source: &kubrick; was inspired by Professor Erno Rubik's famous <trademark>Rubik's Cube </trademark> puzzle.
de: &kubrick; basiert auf Professor Erno Rubiks berühmten <trademark>Rubiks Würfel</trademark>.

source: The programming is original work in C++ but owes several good ideas to the Rubik XScreensaver, a C program by Marcelo Vianna, and GNUbik, a C program by John M. Darrington.
de: &kubrick; ist in C++ programmiert, verdankt jedoch einige gute Ideen dem in C programmierten Bildschirmschoner <quote>Rubik XScreensaver</quote> von Marcelo Vianna und dem ebenfalls in C programmierten Programm <quote>GNUbik</quote> von John M. Darrington.

source: Documentation Copyright 2008 Ian Wadham <email>ianw@netspace.net.au</email>
de: Dokumentation © 2008 Ian Wadham <email>ianw@netspace.net.au</email>

source: CREDIT_FOR_TRANSLATORS
de: <para>Übersetzung: Johannes Obermayr <email>johannesobermayr@gmx.de</email></para>

source: Compilation and Installation
de: Kompilieren und Installieren

source: &kubrick; uses OpenGL 3-D graphics and requires the GL and GLU libraries. These are available with most &Linux; distributions and are often installed by default.
de: &kubrick; verwendet OpenGL-beschleunigte 3D-Grafiken und benötigt dafür die GL- und GLU-Bibliotheken. Diese werden bei den meisten Distributionen von &Linux; mitgeliefert und sind meist standardmäßig installiert.
