Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdegames/kubrick.po
Languages: de

source: The &kubrick; Handbook
de: Das Handbuch zu &kubrick;

source: iandw.au at gmail com
de: iandw.au@gmail.com

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Johannes</firstname><surname>Obermayr</surname><affiliation><address><email>johannesobermayr@gmx.de</email></address></affiliation><contrib>Übersetzung</contrib></othercredit>

source: &kubrick; is a game based on the <trademark>Rubik's Cube</trademark> puzzle. The cube sizes range from 2x2x2 up to 6x6x6, or you can play with irregular <quote>bricks</quote> such as 5x3x2 or <quote>mats</quote> such as 6x4x1 or 2x2x1. The game has a selection of puzzles at several levels of difficulty, as well as demos of pretty patterns and solution moves, or you can make up your own puzzles ...
de: &kubrick; basiert auf <trademark>Rubiks Würfel</trademark>. Es sind <quote>Würfel</quote> mit einer Kantenlänge von 2×2×2 bis 6×6×6, <quote>Quader</quote> (z. B. 5×3×2) oder <quote>Matten</quote> (z. B. 6×4×1 oder 2×2×1) wählbar. Das Spiel bietet eine Auswahl verschieden-verdrehter Würfel bei unterschiedlichen Schwierigkeitsgraden und Demos von schönen Würfel und Lösungsversuche. Es können auch eigene Würfel erstellt werden ...

source: game
de: Spiel

source: one player
de: ein Spieler

source: Cube
de: Würfel

source: Rubik's Cube
de: Rubiks Würfel

source: Introduction
de: Einführung

source: Gametype:
de: Spielart:

source: Logic
de: Logik

source: Number of possible players:
de: Anzahl der Spieler:

source: <para>One</para>
de: <para>Einer</para>

source: &kubrick; is based on the famous <trademark>Rubik's Cube</trademark> puzzle, invented by Professor Erno Rubik in Hungary in the 1970s. His original puzzle was a cube that appeared to consist of 27 smaller colored cubes, called <quote>cubies</quote>, arranged in a 3x3x3 stack. When you turned the faces of the cube, the colors of the cubies became shuffled and the challenge was to unshuffle them, so that each face of the cube contained a single color.
de: &kubrick; basiert auf dem berühmten <trademark>Rubiks Würfel</trademark>, der in den 70er Jahren von Professor Erno Rubik in Ungarn erfunden wurde. Seine ursprüngliche Form ist ein Würfel, der aus 27 kleineren farbigen Würfeln (sog. <quote>Würfelchen</quote>) mit drei Würfeln an jeder Kante zusammengesetzt ist. Das Ziel ist, den verdrehten Würfel durch geschicktes Drehen der einzelnen Ebenen wieder in einen Zustand zu versetzen, in dem alle Seiten jeweils nur eine einzige Farbe aufweisen.

source: In &kubrick; the cube sizes range from 2x2x2 (easy) up to 6x6x6 (very hard), or you can play with irregular <quote>bricks</quote> such as 5x3x2 and <quote>mats</quote> (one cubie thick) such as 6x4x1. The game has a selection of puzzles at several levels of difficulty, as well as some demonstrations of pretty patterns and solution moves. It is also possible to make up your own puzzles.
de: Die Würfelgrößen in &kubrick; reichen von einer Kantenlänge von 2×2×2 (einfach) bis zu 6×6×6 (sehr schwer). Es können auch <quote>Quader</quote> (z. B. 5×3×2) und <quote>Matten</quote>, bei denen eine Kantenlänge aus nur einem <quote>Würfelchen</quote> besteht (z. B. 6×4×1), erstellt werden. Das Spiel bietet eine Auswahl vorgefertigter Würfel mit unterschiedlichen Schwierigkeitsgraden, Würfel mit interessanten Mustern und Demos für Lösungsversuche. Es können aber auch eigene Würfel erstellt werden.

source: How to Play
de: Spielanleitung

source: Objective:
de: Spielziel:

source: Return all the pieces of the cube to their starting positions after the computer has made several shuffling moves.
de: Alle Teile des Würfels sollen wieder in ihre ursprüngliche Position gebracht werden, nachdem der Würfel vom Computer etliche Male verdreht wurde.

source: &kubrick; starts with an animated demonstration that randomly chooses cubes of various dimensions, shuffles them and solves them. If you have never seen a <trademark>Rubik's Cube</trademark> before, the demonstration will give you a general idea of how to play. Just click anywhere with the mouse to stop the demonstration and start playing. You will then see a new puzzle or the puzzle you were last working on, exactly as it was when you left it.
de: Beim Start von &kubrick; wird im Demomodus ein Würfel mit zufälligen Kantenlängen wiedergegeben. Hierbei wird der Würfel zunächst verdreht und dann wieder gelöst. Sollte <trademark>Rubiks Würfel</trademark> noch unbekannt sein, ist der Demomodus ein guter Anfang, um zu sehen, wie er funktioniert. Durch einen Mausklick im animierten Fenster wird der Demomodus beendet und ein Spiel beginnt. Es wird - soweit vorhanden - der zuletzt gespielte Würfel - wie er verlassen wurde - oder ein neuer Würfel angezeigt.

source: &kubrick; has a choice of three views, showing one, two or three cubes, all of which are the same cube viewed from different angles. Use the <guimenu>View</guimenu> menu or toolbar buttons to switch between views.
de: Bei &kubrick; können eine, zwei oder drei Ansichten gewählt werden. Es wird immer derselbe Würfel aus unterschiedlichen Betrachtungswinkeln angezeigt. Die Ansicht kann im Menü <guimenu>Ansicht</guimenu> oder mit den Knöpfen in der Werkzeugleiste gewechselt werden.

source: Use <menuchoice><guimenu>Game</guimenu><guisubmenu>Choose Puzzle Type </guisubmenu></menuchoice> to choose the size of cube and degree of difficulty for the type of puzzle you wish to try. Then use <menuchoice><guimenu>Game </guimenu><guimenuitem>New Puzzle</guimenuitem></menuchoice> each time you wish to re-shuffle the cube and start a new puzzle of that type.
de: <literallayout>Unter <menuchoice><guimenu>Spiel</guimenu><guisubmenu>Würfelart wählen</guisubmenu></menuchoice> kann die Würfelgröße und der Schwierigkeitsgrad eingestellt werden. Mit <menuchoice><guimenu>Spiel</guimenu><guimenuitem>Neues Spiel</guimenuitem></menuchoice> wird der Würfel neu verdreht und ein neues Spiel mit diesen Einstellungen gestartet.</literallayout>

source: Making Moves
de: Würfel drehen

source: You can use either the mouse or the keyboard to move the cube.
de: Der Würfel kann mit der Maus oder der Tastatur gedreht werden.

source: Use the left mouse-button or keyboard to rotate single slices of the cube around any axis, as when solving a puzzle. Square slices (e.g. 4x4 cubies) rotate by 90 degrees at a time. Rectangular slices (e.g. 5x3 cubies) rotate by 180 degrees.
de: Mit der linken Maustaste oder der Tastatur können die einzelnen Scheiben des Würfels um jede Achse gedreht werden. Quadratische Scheiben (z. B. bei 4×4×?) drehen sich dabei um 90 Grad. Rechteckige Scheiben (z. B. 5×4×?) drehen sich dabei um 180 Grad.

source: Use the right mouse-button to rotate the whole cube around any axis. Or use the <keycap>C</keycap> key, within a keyboard sequence. Such moves do not lead to a solution of the puzzle, but you might use them to examine the current position more closely or to get the cube into position for a sequence of solution moves, such as untwisting two corners.
de: Mit der rechten Maustaste oder der Taste <keycap>C</keycap> wird der gesamte Würfel gedreht. Diese Drehungen führen nicht zur Lösung des Würfels. Es kann jedoch dadurch geprüft werden, ob die zuletzt durchgeführte Drehung der Lösung des Würfels dient.

source: All moves, however they are made, are displayed progressively in the toolbar using the widely-recognized Singmaster Notation. See the section <link linkend="singmaster-moves">Singmaster Moves</link> for more details.
de: Alle durchgeführten Drehungen werden mittels Singmasters Beschreibung schrittweise in der Werkzeugleiste angezeigt. Diese werden im Abschnitt <link linkend="singmaster-moves">Singmaster-Drehungen</link> näher erläutert.

source: Using the Mouse to Move
de: Mit der Maus drehen

source: To move using the mouse, click the left or right mouse button on any colored sticker on any cubie in the view, hold the button down, drag and let go.
de: Zum Drehen mit der Maus müssen Sie mit gedrückter linker oder rechter Maustaste an einer beliebigen Fläche eines farbigen <quote>Würfelchens</quote> ziehen und dann die Taste loslassen.

source: When using the left button, the sticker and a whole slice of the cube will move in the direction you indicated. The slice tilts slightly to help you see what will happen when you let go. If you are not happy with that, just move the mouse back to where you started.
de: Bei Verwendung der linken Maustaste wird das <quote>Würfelchen</quote> und die ganze Scheibe des Würfels in die entsprechende Richtung gedreht. Die Scheibe kippt leicht, damit gesehen werden kann, was genau passiert, wenn die Maustaste losgelassen wird. Sollte eine Aktion nicht gewünscht werden, muss die Maus nur zum Ausgangspunkt zurückgebracht und die Maustaste losgelassen werden.

source: If you are using the right button, the mouse pointer sticks to the cube and the whole cube rotates with it until you release the button.
de: Bei Verwendung der rechten Maustaste wird der gesamte Würfel gedreht, bis die Maustaste wieder losgelassen wird.

source: Using the Keyboard to Move
de: Mit der Tastatur drehen

source: There are two styles of keyboard moves: XYZ moves, described here, and Singmaster moves, which are described in the section <link linkend="singmaster-moves">Singmaster Moves</link>.
de: Spielzüge können mit der Tastatur als XYZ-Drehungen (hier beschrieben) oder als <link linkend="singmaster-moves">Singmaster-Drehungen</link> ausgeführt werden.

source: To move the cube with XYZ, first use key <keycap>X</keycap>, <keycap>Y</keycap> or <keycap>Z</keycap> to select an axis. On the screen, the X axis runs from left to right, the Y axis from bottom to top and the Z axis towards you from behind the screen. Now, to move the whole cube use key <keycap>C</keycap> or to move a slice use keys <keycap>1</keycap> to <keycap>6</keycap> (to select a slice number).
de: Um den Würfel mittels XYZ zu drehen, muss zuerst die Achse mittels <keycap>X</keycap>, <keycap>Y</keycap> oder <keycap>Z</keycap> ausgewählt werden. Auf dem Bildschirm verläuft die X-Achse von links nach rechts, die Y-Achse von unten nach oben und die Z-Achse von hinten nach vorne. Der komplette Würfel wird mit <keycap>C</keycap> und die einzelnen Scheiben mit <keycap>1</keycap> bis <keycap>6</keycap> gedreht.

source: Finally use the left-arrow key for anti-clockwise rotation and right-arrow for clockwise. The slice that is going to move (numbered 1 to 6) will blink, until you hit an arrow key.
de: Schließlich ist die Pfeiltaste links für die Drehung gegen den Uhrzeigersinn und die Pfeiltaste rechts im Uhrzeigersinn. Die zu drehende Scheibe (1 bis 6) blinkt bis zur Betätigung einer Pfeiltaste.

source: You can make further moves by using one, two or three of the above keys. For example, to move the same slice again, just hit an arrow key.
de: Weitere Drehungen können durch Verwendung von einer, zwei oder drei der oben genannten Tasten durchgeführt werden. Soll zum Beispiel die gleiche Scheibe nochmals gedreht werden, ist nur die Betätigung einer Pfeiltaste notwendig.

source: If you have used the right mouse button to rotate the cube, the meanings of X, Y and Z may have changed, so the cube is automatically realigned, using the <menuchoice><guimenu>Move</guimenu> <guimenuitem>Realign Cube</guimenuitem></menuchoice> action, before the keyboard move you have requested can be executed.
de: Sollte der Würfel mit der rechten Maustaste gedreht worden sein und sich dadurch die Bedeutungen der X-, Y- und Z-Achsen geändert haben, muss der Würfel mit <menuchoice><guimenu>Zug</guimenu><guimenuitem>Würfel neu ausrichten</guimenuitem></menuchoice> wieder entlang der X-, Y- und Z-Achsen ausgerichtet und diese auch neu festgelegt werden, bevor die Drehung mittels Tastatur ausgeführt werden kann.

source: Singmaster Moves
de: Singmaster-Drehungen

source: Professor David Singmaster, an English mathematician, was one of the first to investigate <trademark>Rubik's Cube</trademark> and its relationship to the branch of mathematics known as Group Theory. In his book, <quote>Notes on Rubik's 'Magic Cube'</quote>, Fifth Edition, published in 1980, he sets out a way of describing sequences of cube moves briefly. Mathematicians call this a <quote>notation</quote> and Singmaster's Notation is now widely used internationally in books and on websites when discussing problems and solutions in <trademark>Rubik's Cube</trademark> puzzles. For example, see the Wikipedia article and its links on the subject of <trademark>Rubik's Cube</trademark>.
de: Der englische Mathematiker Professor David Singmaster war einer der ersten Forscher an <trademark>Rubiks Würfel</trademark> und seinen Beziehungen zur mathematischen Gruppentheorie. In seinem Buch<footnote><para>Singmaster, Notes on Rubik's 'Magic Cube', Fifth Edition, 1980</para></footnote> definiert er eine Kurzbeschreibung für die einzelnen Würfeldrehungen. Mathematiker bezeichnen es als <quote>Wegweiser</quote>, welcher heutzutage in weit verbreiteten internationalen Büchern und Webseiten zur Problemerörterung und -lösung von <trademark>Rubiks Würfel</trademark> verwendet wird.<footnote><para>siehe Wikipedia-Artikel und den Verknüpfungen zu <trademark>Rubiks Würfel</trademark></para></footnote>

source: The &kubrick; program uses a modified form of Singmaster Notation to display all moves, by whatever method they are made, using an area of the toolbar. It also allows moves to be entered from the keyboard in Singmaster Notation. The notation has been modified for use on larger cubes, bricks and mats than the original size 3 cube and to allow convenient entry from the keyboard, without clashing with &kubrick; shortcuts or other actions.
de: &kubrick; verwendet eine modifizierte Form von Singmasters Beschreibung, damit alle Drehungen - egal auf welche Weise sie durchgeführt wurden - in der Werkzeugleiste angezeigt werden können. Außerdem können die Drehungen mittels Singmasters Beschreibung mit der Tastatur durchgeführt werden. Die Beschreibung wurde für Drehungen größerer Würfel, Quader und Matten mittels der Tastatur modifiziert, damit eine bequeme Eingabe ohne Konflikte zu bestehenden Tastaturkürzeln ermöglicht wird.

source: Briefly, Singmaster imagines that you are looking at the cube from slightly above and to the right of it, exactly as in the standard Front View of &kubrick;. You can see three faces at the top, front and right of the cube and these Singmaster has called (in English) <quote>Up</quote>, <quote>Front</quote> and <quote>Right</quote>, or <quote>U</quote>, <quote>F</quote> and <quote>R</quote> for short. The three faces you cannot see, which are on the Back View in &kubrick;, are at the bottom, back and left of the cube and Singmaster calls these (in English) <quote>Down</quote>, <quote>Back</quote> and <quote>Left</quote>, or <quote>D</quote>, <quote>B</quote> and <quote>L</quote> for short. Singmaster uses U and D for the top and bottom faces because B is reserved for the back face.
de: Singmaster nimmt an, dass man von rechts-oben auf den Würfel blickt (wie in der standardmäßigen Ansicht von &kubrick;). Man sieht drei Seiten des Würfels (Oben, Vorne und Rechts). Singmaster nennt die Seiten bei den englischen Bezeichnungen <quote>Up</quote>, <quote>Front</quote> und <quote>Right</quote> (kurz: <quote>U</quote>, <quote>F</quote> und <quote>R</quote>). Die unsichtbaren Seiten (Unterseite, Rückseite und linke Seite) benennt er mit den englischen Bezeichnungen <quote>Down</quote>, <quote>Back</quote> und <quote>Left</quote> (kurz: <quote>D</quote>, <quote>B</quote> and <quote>L</quote>). Singmaster verwendet <quote>U</quote> und <quote>D</quote> für die Ober- und Unterseite, weil <quote>B</quote> bereits für die Rückseite verwendet wird.

source: This is all summarised in the table below: now to the moves. A single letter or keystroke from UFRDBL represents a clockwise move of that face through a right angle (90 degrees) for a square face or through 180 degrees for a rectangular face (as on a brick or mat). Here is where it gets tricky.
de: Alle Möglichkeiten sind in der unteren Tabelle zusammengefasst. Nun aber zu den Dreh-Möglichkeiten. Ein <quote>einfacher</quote> Buchstabe aus <quote>UFRDBL</quote> führt eine Drehung im Uhrzeigersinn aus (90° bei quadratischen bzw. 180° bei quaderförmigen Scheiben). Dies bedarf noch einer Erklärung:

source: <quote>Clockwise</quote> means clockwise when you are looking directly at that face. That is easy enough with the UFR faces you can see, but the faces you cannot see appear to move anti-clockwise when you use DBL moves. That is because you are looking at them from behind. On &kubrick;'s Back View, the DBL moves will be seen to go clockwise, as expected. Rather than trying to imagine yourself looking at the back of the cube when making DBL moves, it might be easier to think of them going anti-clockwise in the normal Front View.
de: <quote>Im Uhrzeigersinn</quote> bedeutet, die Drehung im Uhrzeigersinn, wenn man direkt auf die entsprechende Seite sieht. Mit den sichtbaren Seiten sollte dies keine große Schwierigkeit darstellen. Jedoch bei den unsichtbaren Seiten wird bei der vermeintlichen Drehung im Uhrzeigersinn eine sichtbare Drehung gegen den Uhrzeigersinn durchgeführt, da man ja eigentlich von hinten (unten bzw. links) auf den Würfel sieht (in der Rückansicht wird die Drehung im Uhrzeigersinn angezeigt).

source: Singmaster Notation (Modified)
de: Singmasters Beschreibung (modifiziert)

source: <segtitle>Key</segtitle>
de: <segtitle>Taste</segtitle>

source: Meaning
de: Bedeutung

source: <seg>R</seg>
de: <seg><keycap>R</keycap></seg>

source: Right face. In English, R is for <quote>Right</quote>.
de: Rechte Seite (<keycap>R</keycap> für <quote>Right</quote>).

source: <seg>L</seg>
de: <seg><keycap>L</keycap></seg>

source: Left face. In English, L is for <quote>Left</quote>.
de: Linke Seite (<keycap>L</keycap> für <quote>Left</quote>).

source: <seg>U</seg>
de: <seg><keycap>U</keycap></seg>

source: Up or top face. In English, U is for <quote>Up</quote>.
de: Oben oder Oberseite (<keycap>U</keycap> für <quote>Up</quote>).

source: <seg>D</seg>
de: <seg><keycap>D</keycap></seg>

source: Down or bottom face. In English, D is for <quote>Down</quote>.
de: Unten oder Unterseite (<keycap>D</keycap> für <quote>Down</quote>).

source: <seg>F</seg>
de: <seg><keycap>F</keycap></seg>

source: Front face. In English, F is for <quote>Front</quote>.
de: Vorderseite (<keycap>F</keycap> für <quote>Front</quote>).

source: <seg>B</seg>
de: <seg><keycap>B</keycap></seg>

source: Back face. In English, B is for <quote>Back</quote>.
de: Rückseite (<keycap>B</keycap> für <quote>Back</quote>).

source: <seg>'</seg>
de: <seg><keycap>'</keycap></seg>

source: Suffix for a reverse or anti-clockwise move. R' is the reverse of R.
de: Nachgestelltes Kennzeichen für eine Rückwärts-Drehung (<keycap>R'</keycap> ist die Rückwärts-Drehung von <keycap>R</keycap>).

source: <seg>2</seg>
de: <seg><keycap>2</keycap></seg>

source: Suffix for double move. R2 rotates R twice.
de: Nachgestelltes Kennzeichen für eine doppelte Drehung (<keycap>R2</keycap> führt die <keycap>R</keycap>-Drehung zweimal aus).

source: <seg>+</seg>
de: <seg><keycap>+</keycap></seg>

source: Suffix for two-face move. R+ is RL' in another form.
de: Nachgestelltes Kennzeichen für eine Zwei-Seiten-Drehung. (<keycap>R+</keycap> bedeutet <keycap>RL'</keycap>).

source: <seg>-</seg>
de: <seg><keycap>-</keycap></seg>

source: Suffix for anti-two-face move. R- is RL in another form.
de: Nachgestelltes Kennzeichen für eine Zwei-Seiten-Rückwärts-Drehung (<keycap>R-</keycap> bedeutet <keycap>RL</keycap>).

source: <seg>.</seg>
de: <seg><keycap>.</keycap></seg>

source: Prefix for inner-slice move. <quote>.R</quote> is one step in from the R face.
de: Vorangestelltes Kennzeichen für das Drehen der inneren Scheibe (<keycap>.R</keycap> ist die nächste Scheibe von <keycap>R</keycap>).

source: <seg>C</seg>
de: <seg><keycap>C</keycap></seg>

source: Prefix for whole-cube move. In English, C is for <quote>Cube</quote>.
de: Vorangestelltes Kennzeichen für das Drehen des ganzen Würfels (<keycap>C</keycap> für <quote>Cube</quote>).

source: Singmaster uses a letter followed by an apostrophe to represent an anti-clockwise or reverse move of a face. Mathematicians would say F' as <quote>F prime</quote> or <quote>F dash</quote> and it indicates an anti-clockwise move of the front face.
de: Singmaster verwendet nach einem Buchstaben ein Apostroph (<keycap>'</keycap>) um die Rückwärts-Drehung zu beschreiben. Mathematiker bezeichnen <keycap>F'</keycap> als <quote>F - Strich</quote>.

source: &kubrick; cannot tell if you are going to type an apostrophe, another letter or some other symbol after a letter, so it will not make a clockwise move of a face immediately after you type the letter. You can force &kubrick; to move by hitting the Return or Enter key. You can also use the space bar and it will leave a space in the display of moves, allowing you to separate groups of moves for readability.
de: &kubrick; weiß nicht, ob nach dem Buchstaben ein Apostroph für die Rückwärts-Drehung folgen soll und führt daher die Drehung im Uhrzeigersinn erst nach Betätigung der Eingabetaste (Enter) oder Leertaste - mit dem Vorteil, dass die Drehungen mit einem Leerzeichen getrennt werden und somit besser lesbar sind - aus.

source: On cubes, bricks or mats of size 3 or more, you might wish to move an inner slice, rather than a face. To do this, type one or more periods or dots before the face letter. For example, ..F moves the slice that is two layers behind the front face and ..B would move the slice two layers in front of the back face, assuming there are 5 or 6 layers that can move. The reverse of those moves would be ..F' and ..B'.
de: Bei Würfeln mit mehr als 3 <quote>Würfelchen</quote> je Kante soll oftmals auch eine der inneren Scheiben gedreht werden. Um dies zu erreichen, müssen ein oder mehrere Punkte vor dem Dreh-Befehl stehen. Zum Beispiel dreht <keycap>..F</keycap> die zweite Scheibe nach der Vorderseite und <keycap>..B</keycap> die zweite Scheibe vor der Rückseite (Kantenlänge von 5 oder 6). Die Rückwärts-Drehungen dazu wären <keycap>..F'</keycap> und <keycap>..B'</keycap>.

source: Finally, the C prefix moves the whole cube in the same way as a face. For example, CF moves the cube clockwise along with the front face and CF' moves it anti-clockwise.
de: Das vorangestellte Kennzeichen <keycap>C</keycap> dreht den gesamten Würfel in die entsprechende Richtung. Zum Beispiel dreht <keycap>CF</keycap> den Würfel im Uhrzeigersinn entlang der Vorderseite und <keycap>CF'</keycap> entsprechend gegen den Uhrzeigersinn.

source: If you have previously rotated the cube by hand, using the right mouse button, and you then make a Singmaster or other keyboard move, the cube will be realigned automatically to standard UFR view and some C moves will be generated and displayed. This ensures that you and &kubrick; have the same idea of top, front and right. Similar moves are generated when you use the <menuchoice><guimenu>Move</guimenu><guimenuitem>Realign Cube </guimenuitem></menuchoice> menu item or the Home icon on the toolbar.
de: Sollte der ganze Würfel bereits mittels der rechten Maustaste gedreht worden sein und nun eine Singmaster- bzw. XYZ-Drehung mit der Tastatur vorgenommen werden, stellt &kubrick; automatisch die UFR-Ansicht wieder her und zeigt einige C-Drehungen an. Dies stellt sicher, dass der Spieler und &kubrick; die gleichen Vorstellungen von Oben, Vorne und Rechts haben. Ähnliche Drehungen werden durchgeführt, wenn im Menü <menuchoice><guimenu>Zug</guimenu><guimenuitem>Würfel neu ausrichten</guimenuitem></menuchoice> oder das Haus-Symbol in der Werkzeugleiste verwendet werden.
