Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdegames/kubrick.po
Languages: de

source: Game Rules, Strategies and Tips
de: Spielregeln, Spielstrategien und Tipps

source: Rules
de: Spielregeln

source: There are no rules in &kubrick; other than having to move one slice at a time until all the cubies and their stickers are back in their original positions. No other rules are necessary, because the way the cube is built makes it almost impossible to perform any other moves.
de: &kubrick; hat nur eine Regel - die Scheiben entsprechend zu drehen, bis alle <quote>Würfelchen</quote> die Farben an ihren ursprünglichen Stellen wieder haben. Es sind keine weiteren Regeln notwendig, da bereits der Aufbau des Würfels andere Drehungen unmöglich macht.

source: In the original 3x3x3 <trademark>Rubik's Cube</trademark>, the inside of the cube contained an ingenious mechanism that made it possible to turn groups of 9 cubies (3x3) called <quote>slices</quote>, all at once as a group. To make any other moves you had to physically break the cube or take it apart and re-assemble it. The equivalent in &kubrick; would be to change the source program.
de: Der ursprüngliche 3×3×3 <trademark>Rubiks Würfel</trademark> enthält imInneren ein ausgeklügeltes System, das es ermöglicht, Gruppen von 9 <quote>Würfelchen</quote> (= <quote>Scheibe</quote>) auf einmal zu drehen. Um hierbei irgendwelche anderen Drehungen vornehmen zu können, müsste der Würfel auseinandergenommen und in anderer Weise wieder zusammengebaut werden. Entsprechend müsste hierzu in &kubrick; der Quelltext geändert werden.

source: The Complexity of the Puzzle
de: Die Schwierigkeiten mit dem Würfel

source: The outside faces of the cubies have stickers of 6 different colors, one for each of the 6 faces of the main cube. As you rotate the slices, the stickers become shuffled and the faces of the main cube become a jumble of colors. It looks like a simple puzzle, but as you move further away from the starting position, you begin to realise, as one writer put it, that you are like a small child who has let go of a helium balloon only to see it move more and more beyond reach or hope of return.
de: Die Außenseiten der <quote>Würfelchen</quote> besitzen - wie der <quote>große</quote> Würfel - sechs verschiedene Farben. Beim Drehen der Scheiben werden die einzelnen Farben verdreht und die Außenseiten des großen Würfels erhalten verschiedene Farben. Zunächst sieht es sehr einfach aus, beginnt aber mit weiterführendem Verdrehen schnell in die Art umzuschlagen, wie wenn ein kleines Kind einen mit Helium gefüllten Luftballon loslässt, um zu sehen, wie hoch er noch fliegen kann und dabei hofft, dass er wieder zurück kommt (Aussage eines Autors).

source: Mathematicians calculate that a 3x3x3 cube can be shuffled into 43,252,003,274,489,856,000 different patterns, yet they conjecture that all positions can be solved in 20 moves or less. The method that can do that (as yet undiscovered) is called God's Algorithm. Practical methods can take more than 100 moves. As there are 12 face-move possibilities at each step, the chances of solving the cube by trial and error are rather remote. Some cubes have 9-part pictures on the faces and that makes them even more complex, because you then have to get the orientations of the stickers correct as well as the positions.
de: Mathematiker berechneten, dass ein Würfel mit einer Kantenlänge von 3×3×3 zu 43.252.003.274.489.856.000 (ca. 43,25 Trillionen) neuen Würfeln verdreht werden kann. Jedoch vermuten sie, dass jede Verdrehung in zwanzig oder weniger Schritten gelöst werden kann. Diese - noch unerforschte - Methode wird Gott-Algorithmus genannt. In der Praxis werden oftmals mehr als hundert Drehungen dafür benötigt. Durch die zwölf möglichen Drehungen bei jedem Zug ist eine Lösungsfindung durch bloßes Ausprobieren eher ausgeschlossen. Manche Würfel besitzen keine zusammengehörigen Flächen und werden dadurch noch komplexer, weil sowohl die Ausrichtung als auch die Position der <quote>Würfelchen</quote> beachtet werden muss.

source: Strategies and Tips
de: Spielstrategien und Tipps

source: &kubrick; shuffles the cube by a pre-selected number of random moves when setting a puzzle. The difficulty depends on how many cubies there are in your cube, how many shuffling moves there are and whether you can view the shuffling moves as they happen.
de: Der Würfel wird von &kubrick; mit einer voreingestellten Anzahl verdreht. Der Schwierigkeitsgrad hängt von der Anzahl der <quote>Würfelchen</quote> innerhalb des Würfels und Verdrehungen sowie der Betrachtung des Verdrehens ab.

source: One kind of puzzle has a small number of shuffling moves (3, 4 or 5) and the idea is to solve the cube in that number of moves (or less). This is fun, challenging and quite quick to play.
de: Bei einer Spielart wird der Würfel nur ein paar mal verdreht (drei-, vier- oder fünfmal). Das Ziel ist den Würfel mit - höchstens - dieser Anzahl an Zügen wieder zu lösen. Das ist lustig, herausfordernd und sehr schnell zu spielen.

source: Then there is the traditional puzzle, with 10 to 20 or more shuffling moves. The 3x3x3 cube has been very well explored and written about, but other sizes are not so well known and understood.
de: Dann gibt es noch die traditionelle Methode mit zehn bis zwanzig oder mehr Verdrehungen. Der Würfel mit einer Kantenlänge von 3×3×3 ist - im Gegensatz zu den anderen Würfeln - sehr gut erforscht und beschrieben.

source: &kubrick; also has bricks and mats you can play with. Some of them are easier to solve than cubes and could be fun for children too.
de: &kubrick; bietet ebenfalls Quader und Matten zum Spielen. Einige von diesen sind einfacher zu lösen und sollten auch Kindern Spaß machen.

source: Another game you can try is to find pretty patterns for sizes other than 3x3x3.
de: Eine andere Spielart ist das Finden von Würfeln mit interessanten Mustern für andere Kantenlängen als 3×3×3.

source: &kubrick; can be used as a <quote>laboratory</quote> for studying cubes and finding sequences of solution moves, since all moves can be undone or redone to any degree, either instantaneously or at a selectable speed of animation.
de: &kubrick; kann als <quote>Versuchslabor</quote> für das Erforschen und Finden von Lösungen der Würfel verwendet werden, da alle Drehungen zurückgenommen oder wiederhergestellt werden können und zwar sofort oder mit einer einstellbaren Geschwindigkeit für die Animation.

source: It is also possible to save and restore a partly solved cube at any time and the current state of the cube is automatically saved and restored when you quit and restart &kubrick;.
de: Es ist ebenfalls möglich, den zum Teil gelösten Würfel jederzeit zu speichern und wieder zu laden. Beim Beenden wird der Würfel automatisch gespeichert und beim nächsten Start von &kubrick; wiederhergestellt.

source: On a cube with an odd number of cubies per face, the stickers at the centres of the six faces maintain their positions relative to each other, regardless of how you move. You can use those centres as anchors or guide posts for your moves.
de: Bei einem Würfel mit einer ungeraden Anzahl von <quote>Würfelchen</quote> bleiben die Farben der zentralen Würfel jeder Seite - relativ zu den anderen - erhalten (egal wie gedreht wird). Diese zentralen Stellen können als Grundlage oder Ratgeber für die weiteren Drehungen dienen.

source: The <guimenu>Settings</guimenu> menu has options to turn animations on or off and to vary the speed of animations. These can be useful when trying to follow a sequence of moves and understand what is happening.
de: Das Menü <guimenu>Einstellungen</guimenu> bietet die Möglichkeit die Animation des Drehens und Verdrehens sowie die Geschwindigkeit dafür einzustellen. Dies kann nützlich sein, wenn man versucht, eine bestimmte Abfolge von Drehungen zu verfolgen und die Auswirkungen davon zu verstehen.

source: If you are in real trouble, &kubrick; has a <quote>solve</quote> action which appears to show God's Algorithm in animated form then reshuffles the cube. Actually the computer cheats. It remembers the shuffling moves and then just undoes and redoes them.
de: Wenn die Lösung des Würfels als unmöglich erscheint, bietet &kubrick; eine Funktion für das Lösen des Würfels an. Es scheint, als würde &kubrick; hierbei den Gott-Algorithmus in grafischer Darstellung anwenden. Jedoch erinnert sich &kubrick; nur an die bereits ausgeführten Drehungen und Verdrehungen und macht diese rückgängig.

source: Another source of ideas is the <menuchoice><guimenu>Demos</guimenu> <guisubmenu>Solution Moves</guisubmenu></menuchoice> menu item. One systematic way to solve a cube is to solve the bottom layer first, then the edge cubies in the middle layer and finally the top layer. The demos show sequences of moves on the 3x3x3 cube that will rearrange a few cubies at a time, without messing up parts of the cube you have already solved. One of the demos plays a complete solution of an example cube, using these methods, but it requires over 100 moves.
de: Eine weitere Quelle für Ideen ist das Menü <menuchoice><guimenu>Demomodus</guimenu><guisubmenu>Lösungsversuche</guisubmenu></menuchoice>. Ein systematischer Weg ist zuerst die Bearbeitung der untersten Ebene, dann der Randwürfel in der mittleren Ebene und zum Schluss der obersten Ebene. Die Beispiele zeigen für den Würfel mit der Kantenlänge 3×3×3 Lösungsmethoden für die Verschiebung einiger <quote>Würfelchen</quote> ohne die bereits angeordneten anderen <quote>Würfelchen</quote> wieder in Unordnung zu bringen. Ein Beispiel zeigt in mehr als 100 Zügen die komplette Lösung für einen Würfel mit diesen Methoden.

source: Interface Overview
de: Die Benutzeroberfläche

source: Menu Items
de: Menüeinträge

source: <menuchoice> <shortcut><keycap>N</keycap></shortcut> <guimenu>Game</guimenu><guimenuitem>New Puzzle</guimenuitem> </menuchoice> <menuchoice> <shortcut><keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo> </shortcut><guimenu></guimenu> </menuchoice>
de: <menuchoice><shortcut><keycap>N</keycap></shortcut><guimenu>Spiel</guimenu><guimenuitem>Neues Spiel</guimenuitem></menuchoice><menuchoice><shortcut><keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo></shortcut><guimenu></guimenu></menuchoice>

source: Generate a new puzzle of the type currently selected.
de: Hiermit wird ein neuer Würfel mit den aktuellen Einstellungen generiert.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>O</keycap></keycombo> </shortcut> <guimenu>Game</guimenu><guimenuitem>Load Puzzle...</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>O</keycap></keycombo></shortcut><guimenu>Spiel</guimenu><guimenuitem>Würfel laden ...</guimenuitem>

source: Load a previously saved puzzle, with all of its dimensions, settings, current state of the cube and history of moves, using a file selection dialog box to locate the required file.
de: Hiermit wird ein bereits gespeicherter Würfel samt seinen Kantenlängen, Einstellungen, Bearbeitungsstand und Verlauf seiner Drehungen geladen. Es wird hierzu ein Dialog für die Auswahl der Datei aufgerufen.

source: <shortcut><keycombo action="simul">&Shift;<keycap>U</keycap></keycombo> </shortcut> <guimenu>Game</guimenu><guimenuitem>Restart Puzzle</guimenuitem>
de: <shortcut><keycombo action="simul">&Shift;<keycap>U</keycap></keycombo></shortcut><guimenu>Spiel</guimenu><guimenuitem>Würfel neu starten ...</guimenuitem>

source: Undo all previous moves and start again.
de: Hiermit werden alle bereits erfolgten Drehungen zurückgenommen, um mit der Lösung von neuem zu beginnen.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>S</keycap></keycombo> </shortcut> <guimenu>Game</guimenu><guimenuitem>Save Puzzle...</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>S</keycap></keycombo></shortcut><guimenu>Spiel</guimenu><guimenuitem>Würfel speichern ...</guimenuitem>

source: Save the current puzzle, with all of its dimensions, settings, current state of the cube and history of moves, using a file selection dialog box to name a new file if the puzzle has not previously been saved and loaded.
de: Hiermit wird der aktuelle Würfel samt seinen Kantenlängen, Einstellungen, Bearbeitungsstand und Verlauf seiner Drehungen gespeichert. Wurde der Würfel noch nicht gespeichert, wird hierzu ein Dialog für die Auswahl der Datei aufgerufen.

source: <guimenu>Game</guimenu><guimenuitem>Save Puzzle As...</guimenuitem>
de: <guimenu>Spiel</guimenu><guimenuitem>Würfel speichern unter ...</guimenuitem>

source: Save the current puzzle under a new file name, with all of its dimensions, settings, current state of the cube and history of moves, using a file selection dialog box.
de: Hiermit wird der aktuelle Würfel samt seinen Kantenlängen, Einstellungen, Bearbeitungsstand und Verlauf seiner Drehungen in einer neuen Datei gespeichert. Hierzu wird ein Dialog für die Auswahl der Datei aufgerufen.

source: <guimenu>Game</guimenu><guisubmenu>Choose Puzzle Type</guisubmenu>
de: <guimenu>Spiel</guimenu><guisubmenu>Würfelart wählen</guisubmenu>

source: Choose a type of puzzle to play from a series of sub-menus graded by difficulty, based on cube dimensions and number of shuffling moves, or use sub-menu item Make your own... to create your own puzzle, using a dialog box.
de: Hiermit kann die Art des Würfels - getrennt nach Schwierigkeitsstufen, Würfelgrößen und Anzahl der Verdrehungen - ausgewählt werden. Mit dem Untermenü <guimenu>Eigener Würfel ...</guimenu> kann ein Würfel - im erscheinenden Dialog - nach der eigenen Vorstellung erstellt werden.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo> </shortcut> <guimenu>Game</guimenu><guimenuitem>Quit</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo></shortcut><guimenu>Spiel</guimenu><guimenuitem>Beenden</guimenuitem>

source: <action>Quit</action> &kubrick;, automatically saving the current puzzle's dimensions, settings, state of the cube and history of moves.
de: Hiermit wird &kubrick; <action>beendet</action>. Der aktuelle Würfel wird samt seinen Kantenlängen, Einstellungen, Bearbeitungsstand und Verlauf seiner Drehungen - programmintern - gespeichert.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>Z</keycap></keycombo> </shortcut> <guimenu>Move</guimenu><guimenuitem>Undo</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>Z</keycap></keycombo></shortcut><guimenu>Zug</guimenu><guimenuitem>Zurücknehmen</guimenuitem>

source: Undo a previous move (repeatedly if required).
de: Hiermit wird eine Drehung zurückgenommen (mehrmals möglich).

source: <shortcut><keycombo action="simul">&Ctrl;&Shift;<keycap>Z</keycap></keycombo> </shortcut> <guimenu>Move</guimenu><guimenuitem>Redo</guimenuitem>
de: <shortcut><keycombo action="simul">&Shift;<keycap>Z</keycap></keycombo></shortcut><guimenu>Zug</guimenu><guimenuitem>Wiederherstellen</guimenuitem>

source: Redo a previously undone move (repeatedly if required).
de: Hiermit wird eine zurückgenommene Drehung wiederhergestellt (mehrmals möglich).

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>D</keycap></keycombo> </shortcut> <guimenu>Move</guimenu><guimenuitem>Main Demo</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>D</keycap></keycombo></shortcut><guimenu>Demomodus</guimenu><guimenuitem>Demomodus</guimenuitem>

source: Start/Stop demo of random puzzle solving on the start page of &kubrick;.
de: Hiermit wird der Demomodus gestartet bzw. angehalten. Es wird ein zufällig gewählter Würfel verdreht und wieder gelöst. Nachdem der Würfel wieder gelöst ist, beginnt das Verdrehen und Lösen mit einem wiederum zufällig gewählten Würfel.

source: <shortcut><keycap>S</keycap></shortcut> <guimenu>Move</guimenu><guimenuitem>Solve</guimenuitem>
de: <shortcut><keycap>S</keycap></shortcut><guimenu>Zug</guimenu><guimenuitem>Lösen</guimenuitem>

source: Solve the cube. This shows all your moves being undone, then all the shuffling moves being undone and then the shuffling moves being re-done, leaving you set up to have another go at the puzzle.
de: Hiermit wird der Würfel gelöst. Zuerst werden alle Drehungen rückgängig gemacht, dann werden alle Verdrehungen rückgängig gemacht und schließlich werden alle Verdrehungen wiederhergestellt, damit ein neuer Lösungsversuch starten kann ...

source: <shortcut> <keycombo action="simul">&Shift;<keycap>U</keycap></keycombo> </shortcut> <guimenu>Move</guimenu><guimenuitem>Restart Puzzle</guimenuitem>
de: <shortcut><keycombo action="simul">&Shift;<keycap>U</keycap></keycombo></shortcut><guimenu>Zug</guimenu><guimenuitem>Würfel neu starten ...</guimenuitem>

source: <shortcut> <keycombo action="simul">&Shift;<keycap>R</keycap></keycombo> </shortcut> <guimenu>Move</guimenu><guimenuitem>Redo All</guimenuitem>
de: <shortcut><keycombo action="simul">&Shift;<keycap>R</keycap></keycombo></shortcut><guimenu>Zug</guimenu><guimenuitem>Alles wiederherstellen</guimenuitem>

source: Redo all previously undone moves.
de: Hiermit werden alle zurückgenommenen Drehungen wiederhergestellt.

source: <shortcut><keycap>Home</keycap></shortcut> <guimenu>Move</guimenu><guimenuitem>Realign Cube</guimenuitem>
de: <shortcut><keycap>Pos1</keycap></shortcut><guimenu>Zug</guimenu><guimenuitem>Würfel neu ausrichten</guimenuitem>

source: Adjust the orientation of a rotated cube by the minimum amount needed to make the rotations a combination of 90 degree moves, thus setting the axes parallel to the XYZ axes. In addition, some whole-cube 90 degree moves are inserted in your list of moves to achieve the desired effect.
de: Um den Würfel wieder entlang der X-, Y- und Z-Achsen auszurichten sind einige 90°-Drehungen notwendig. Zusätzlich werden hierfür einige Drehungen des gesamten Würfels (C-Drehungen) durchgeführt und in der Singmaster-Beschreibung angezeigt.

source: This is to standardise the view's perspective so that the top, front and right sides are visible together and keyboard moves become properly meaningful. The inserted moves can be undone and redone, exactly as if you had made them directly yourself.
de: Dies ist notwendig, damit die standardmäßige Ansicht (Oben, Vorne und Hinten) wiederhergestellt wird und die Drehungen mittels Tastatur aussagekräftig werden. Die hierzu durchgeführten Drehungen können - genauso wie die eigenen - zurückgenommen und wiederhergestellt werden.

source: For example, if you have used the right mouse-button to turn the cube upside-down, the top or Up (U) face is now what used to be the bottom or Down (D) face and what used to be the Y axis is pointing downwards. In this situation, <menuchoice><guimenu>Move</guimenu> <guimenuitem>Realign Cube</guimenuitem></menuchoice> will redefine the faces and axes so that the new top face is known as Up (U) and the Y axis is again the one that points upwards.
de: Sollte zum Beispiel der Würfel mit der rechten Maustaste so gedreht worden sein, dass die Ober- und Unterseite nun vertauscht sind und die Y-Achse nunmehr nach unten zeigt, können über das Menü <menuchoice><guimenu>Zug</guimenu><guimenuitem>Würfel neu ausrichten</guimenuitem></menuchoice> die Achsen neu definiert werden (ursprüngliche Unterseite ist nun Oberseite).

source: <guimenu>View</guimenu><guimenuitem>1 Cube</guimenuitem>
de: <guimenu>Ansicht</guimenu><guimenuitem>Ein Würfel</guimenuitem>

source: Show a view of the front of the cube.
de: Zeigt eine Ansicht des Würfels (Vorderansicht).

source: <guimenu>View</guimenu><guimenuitem>2 Cubes</guimenuitem>
de: <guimenu>Ansicht</guimenu><guimenuitem>Zwei Würfel</guimenuitem>

source: Show views of the front and back of the cube. Slice moves and rotations can be performed on either picture and the other will move simultaneously.
de: Zeigt zwei Ansichten des Würfels (Vorder- und Rückseite). Drehungen können bei beiden Ansichten durchgeführt werden und werden in der anderen automatisch angezeigt (auch die Rotation des gesamten Würfels).

source: <guimenu>View</guimenu><guimenuitem>3 Cubes</guimenuitem>
de: <guimenu>Ansicht</guimenu><guimenuitem>Drei Würfel</guimenuitem>

source: Show a large view of the front of the cube and two smaller views of the front and back. Slice moves can be performed on any of the pictures and the others will move simultaneously, but only the large one can be rotated.
de: Zeigt drei Ansichten des Würfels (einen großen von vorne und zwei kleinere von vorne und hinten). Drehungen können in allen Ansichten durchgeführt werden und werden in den anderen automatisch angezeigt. Die Rotation des Würfels ist jedoch nur in der großen Ansicht möglich.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>D</keycap></keycombo> </shortcut> <guimenu>Demos</guimenu><guimenuitem>Main Demo</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>D</keycap></keycombo></shortcut><guimenu>Demomodus</guimenu><guimenuitem>Demomodus</guimenuitem>

source: Run the Main Demo, in which a cube changes shape, shuffles and solves itself as it rotates at random.
de: Hiermit wird der Demomodus gestartet. Hierbei wird ein zufällig gewählter Würfel verdreht und wieder gelöst. Nachdem der Würfel wieder gelöst ist, beginnt das Verdrehen und Lösen mit einem wiederum zufällig gewählten Würfel.

source: <guimenu>Demos</guimenu><guisubmenu>Pretty Patterns</guisubmenu>
de: <guimenu>Demomodus</guimenu><guisubmenu>Schöne Würfel</guisubmenu>

source: Show a sub-menu in which pretty patterns on the 3x3x3 cube can be selected and the moves to create them are demonstrated. There is also an Info item that tells you a little more about such patterns.
de: Hiermit wird ein Untermenü mit <quote>schönen</quote> Würfeln mit einer Kantenlänge von 3×3×3 angezeigt. Diese können ausgewählt werden und die Lösungswege (Verdrehungen) für diese Muster werden demonstriert. Zudem gibt es eine Information für weiterführende Hinweise.

source: <guimenu>Demos</guimenu><guisubmenu>Solution Moves</guisubmenu>
de: <guimenu>Demomodus</guimenu><guisubmenu>Lösungsversuche</guisubmenu>

source: Show a sub-menu in which sequences of moves used to solve the 3x3x3 cube can be selected and the sequences are demonstrated. There is also an Info item that tells you a little more about such solution moves.
de: Hiermit wird ein Untermenü mit Lösungshinweisen für den Würfel mit einer Kantenlänge von 3×3×3 angezeigt. Diese können ausgewählt werden und das Programm zeigt die entsprechenden Drehungen. Zudem gibt es eine Information für weiterführende Hinweise.

source: <shortcut><keycap>W</keycap></shortcut> <guimenu>Settings</guimenu><guimenuitem>Watch Shuffling</guimenuitem>
de: <shortcut><keycap>W</keycap></shortcut><guimenu>Einstellungen</guimenu><guimenuitem>Verdrehen animieren</guimenuitem>

source: Show animations of shuffling moves as they occur. This is an aid for beginners, but might be a form of cheating for experienced players.
de: Hiermit wird das Verdrehen des Würfels animiert. Es ist eine Hilfestellung für Anfänger, kann jedoch eine Form des <quote>Cheatens</quote> bei Erfahrenen darstellen.

source: <shortcut><keycap>O</keycap></shortcut> <guimenu>Settings</guimenu><guimenuitem>Watch Your Own Moves</guimenuitem>
de: <shortcut><keycap>O</keycap></shortcut><guimenu>Einstellungen</guimenu><guimenuitem>Eigene Drehungen animieren</guimenuitem>

source: Show animations of your own moves as they occur. This is an aid for beginners, because it slows down the animations. Experienced players can turn this option off and moves are then animated at high speed, taking about a tenth of a second to turn 90 degrees.
de: Hiermit werden die eigenen Drehungen am Würfel animiert. Es ist eine Hilfestellung für Anfänger, da es die Animation langsamer ablaufen lässt. Erfahrene können diese Einstellung ausschalten, damit die Animation der Drehungen in höchster Geschwindigkeit durchgeführt wird (90°-Drehung in weniger als 1/10-Sekunde).
