Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdegames/lskat.po
Languages: de

source: The Lieutenant Skat Handbook
de: Das Handbuch zu Offiziersskat

source: Reviewer
de: Korrektur

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Maren</firstname><surname>Pakura</surname><affiliation><address><email>maren@kde.org</email></address></affiliation><contrib>Deutsche Übersetzung</contrib></othercredit>

source: This documentation describes the game of &kappname; version &kappversion;
de: Dieses Handbuch beschreibt das Spiel &kappname; in der Version &kappversion;

source: game
de: Spiel

source: playing cards
de: Karten spielen

source: card game
de: Kartenspiel

source: card
de: Karte

source: lieutenant
de: Offiziersskat

source: two players
de: zwei Spieler

source: Introduction
de: Einführung

source: Gametype:
de: Spielart:

source: Card, Arcade
de: Kartenspiel, Arcade

source: Number of possible players:
de: Anzahl der Spieler:

source: <para>Two</para>
de: <para>Zwei</para>

source: Lieutenant Skat (from German <foreignphrase lang="de">Offiziersskat</foreignphrase>) is a fun and engaging card game for two players, where the second player is either live opponent, or built in artificial intelligence.
de: Offiziersskat ist ein Kartenspiel für zwei Spieler, bei dem der zweite Spieler entweder ein menschlicher Gegner sein kann, oder durch die eingebaute KI gestellt wird.

source: The game is played using a single deck of cards. Cards are shuffled and distributed amongst the players in such a way that half of them are face down and half of them are open. Each participant plays one of the open cards per turn. As soon as all the cards are played the round ends and points are calculated and awarded.
de: Das Spiel wird mit einem Stapel von Spielkarten gespielt. Die Karten sind gemischt und an die Spieler so verteilt, dass die eine Hälfte verdeckt liegt und die andere Hälfte offen. Jeder Teilnehmer spielt eine der offenen Karten per Zug. Sobald alle Karten ausgespielt sind, endet die Runde und die Punkte werden zusammengezählt.

source: How to Play
de: Spielanleitung

source: Objective:
de: Spielziel:

source: Score more than 60 points in a single game.
de: Erzielen von mehr als 60 Punkte in einem Spiel.

source: Once dealing is finished each player ends up with 16 cards each. Cards are displayed in two horizontal rows - four cards per row. Half of the cards are face down and half are face up. As a player you can see the cards of your opponent as well as your own. You can make a move then by clicking on any of your cards which are currently face up. The opponent has to reply by choosing a corresponding card form his/her own stack. <note><title>Note</title><para>If your opponent is artificial intelligence, its cards will be chosen automatically.</para></note> Once the exchange is finished values of the played cards are evaluated and either you or your opponent is awarded points. The game is complete in 16 rounds (when all of your and your opponent's cards have been played). After the game ends your score is being compared to that of your opponent and the player with the higher score wins the round.
de: Jeder Spieler bekommt 16 Karten. Diese werden in zwei waagerechten Reihen angeordnet - vier Karten pro Reihe. Die ersten acht Karten liegen mit dem Blatt nach unten, darauf liegen weitere acht mit dem Blatt nach oben. Als Spieler sieht man neben den eigenen Karten auch die des Gegners. Ein Zug wird getätigt, indem auf eine der eigenen offengelegten Karten geklickt wird. Der Gegner muss mit einer entsprechenden Karte von seinem Stapel antworten. <note><title>Anmerkung:</title><para>Wenn gegen den Computer gespielt wird, wird dessen Zug automatisch ausgeführt.</para></note> Ist der Austausch abgeschlossen, werden die Werte der Karten berechnet und einer der Spieler bekommt Punkte. Das Spiel ist nach 16 Runden abgeschlossen (wenn alle Karten gespielt wurden). Nach dem Spiel werden die Punkte der beiden Spieler verglichen und der Spieler mit den meisten Punkten gewinnt die Runde.

source: Game Rules, Strategies and Tips
de: Spielregeln, Spielstrategien und Tipps

source: Game Screen
de: Spielfeld

source: &lskat; default game screen.
de: Standardspielfeld von &lskat;

source: &lskat; default game reference screen.
de: Standardspielfeld von &lskat;

source: Active player indicator
de: Anzeige des aktiven Spielers

source: Card stacks for player one and player two
de: Kartenstapel für Spieler 1 und Spieler 2

source: Stack of won cards (if any)
de: Gewonnene Karten

source: Gameplay area
de: Spielfeld

source: Score board with player's name, points in the current game, the overall score of the player, and the amount of wins per game
de: Punktetafel mit Spielernamen, Punkten im aktuellen Spiel, Gesamtpunktzahl des Spielers und Anzahl der gewonnenen Runden pro Spiel.

source: Player's controller (Human/PC)
de: Spielersteuerung (Mensch/PC)

source: The 'trump' in the current game
de: Die Trumpffarbe im aktuellen Spiel

source: Rules
de: Spielregeln

source: Every player owns 16 cards. 8 of them are face down 8 of them are face up.
de: Jeder Spieler besitzt 16 Karten. 8 davon sind offen und 8 weitere verdeckt.

source: A face down card can only be opened after a face up card covering it has been played.
de: Eine verdeckte Karte wird erst dann umgedreht, wenn die darauf liegende Karte ausgespielt wurde.

source: Each game has a randomly chosen 'trump' card [8].
de: Für jedes Spiel wird zufällig eine Trumpffarbe ausgewählt [8].

source: All four Jacks are counted as trumps and do not belong to their suits.
de: Alle vier Buben sind immer Trumpfkarten und gehören nicht mehr zu ihrer Farbe.

source: If a color (&eg; heart) is selected as 'trump' all seven hearts as well as all four Jacks count as trumps, making 11 trump cards.
de: Wenn &eg; die Farbe Herz Trumpf ist, gelten alle Herzkarten wie auch die vier Buben als Trumpf. Insgesamt sind also 11 Trumpfkarten im Spiel.

source: Jacks beat each other in order (greatest to least): Club->Spade->Heart->Diamond.
de: Die Reihenfolge der Buben (von oben): Kreuz, Pik, Herz, Karo.

source: The sequence of cards for a trump color: Jack of clubs, Jack of spades, Jack of hearts, Jack of diamonds, Ace, Ten, King, Queen, Nine, Eight, Seven.
de: Die Reihenfolge der Karten der Trumpffarbe: Kreuzbube, Pikbube, Herzbube, Karobube, Ass, Zehn, König, Dame, Neun, Acht, Sieben.

source: The sequence of cards for a non-trump color: Ace, Ten, King, Queen, Nine, Eight, Seven.
de: Die Reihenfolge der Karten einer Fehlfarbe: Ass, Zehn, König, Dame, Neun, Acht, Sieben.

source: The values of the cards (highest to lowest):
de: Die Punktewerte der Karten (von oben nach unten):

source: Card
de: Karte

source: Value
de: Wert

source: <entry>Ace</entry>
de: <entry>Ass</entry>

source: <entry>Ten</entry>
de: <entry>Zehn</entry>

source: King
de: König

source: Queen
de: Dame

source: Jack
de: Bube

source: Nine
de: Neun

source: Eight
de: Acht

source: Seven
de: Sieben

source: A special 'trump' game is called the Grand. In this game no suit is trump and only the four Jacks count as trump. This game type is indicated by the symbol of a Jack's head [8] on the score board [6].
de: Ein besonderes Trumpfspiel ist der Grand. In diesem Spiel gibt es keine Trumpffarbe, nur die vier Buben sind Trümpfe. Im Spiel wird dies durch das Symbol eines Buben [8] auf dem Spielfeld [6] angezeigt.

source: If player starts the round he has a choice of cards to play with, either a card from a suite or a 'trump' card.
de: Wenn ein Spieler eine Runde beginnt, kann er wählen, welche Karte er ausspielt, entweder eine Fehlfarbe oder eine Trumpfkarte.

source: Only the face up cards from the player's own stack can be used to play the round.
de: Nur die offenliegenden Karten auf dem eigenen Stapel können ausgespielt werden.

source: Player who wins the round starts the next one.
de: Der Spieler, der den Stich gewonnen hat, darf die nächste Karte ausspielen.

source: The player who wins the round adds values of the cards played in that round to his/her score.
de: Der Spieler, der die Runde gewinnt, bekommt die Punkte der gespielten Karten gutgeschrieben.

source: Player with more than 60 points wins the game.
de: Der Spieler mit mehr als 60 Punkten hat gewonnen.

source: If both players finish with 60 points each the game ends in a draw.
de: Haben beide Spieler 60 Punkte, endet das Spiel unentschieden.

source: For each game a certain amount of victory points is awarded and added to the overall score.
de: In jedem Spiel werden Siegerpunkte vergeben und zur Gesamtpunktzahl des Spielers addiert.

source: Points
de: Punkte

source: Score
de: Wertung

source: 61 to 90
de: 61 bis 90

source: 91 to 119
de: 91 bis 119

source: Strategies and Tips
de: Spielstrategien und Tipps

source: When the game starts, the starting player should play any of the face up cards from own stack. If the second player currently has face up cards that are of the same suit as the card played, he has to reply with one of those cards. If, however, the second player does not have a card of the same suit, he can play with any other card including a 'trump' card.
de: Wenn das Spiel beginnt, spielt der erste Spieler eine der aufgedeckten Karten von seinem Stapel. Hat der zweite Spieler aufgedeckte Karten der gleichen Farbe, muss er mit einer dieser Karten antworten. Ist keine Karte gleicher Farbe aufgedeckt, kann er eine beliebige Karte ausspielen, auch eine Trumpfkarte, ausspielen.

source: If there is at least one 'trump' card, the highest 'trump' wins both cards.
de: Ist mindestens eine Trumpfkarte ausgespielt, dann gewinnt der Spieler mit dem höchsten Trumpf beide Karten.

source: If there is no 'trump' card, the highest card of the suit played by the starting player wins both cards.
de: Ist keine Trumpfkarte ausgespielt, dann gewinnt der Spieler, der die höchste Karte der vom ersten Spieler ausgespielten Farbe hat, beide Karten.

source: If the replying player has no card of the requested suit and no 'trump' card, he has to play any card and the starting player wins both cards.
de: Hat der zweite Spieler keine Karte der ausgespielten Farbe oder keine Trumpfkarte, muss er eine beliebige Karte spielen und der erste Spieler gewinnt beide Karten.

source: The player who wins the round leads the next one.
de: Der Spieler, der den Stich gewonnen hat, darf die nächste Karte ausspielen.

source: Frequently asked questions
de: Häufig gestellte Fragen

source: Can I play with a different deck of cards?
de: Kann ich mit verschiedenen Kartenblättern spielen?

source: Yes. Refer to <link linkend="deck_change">this</link> section of 'Interface Overview' for details.
de: Ja, wählen Sie <link linkend="deck_change"><menuchoice><guimenu>Einstellungen</guimenu><guimenuitem>Blatt aussuchen ...</guimenuitem> </menuchoice></link> in der Menüleiste.

source: I have made a mistake. Can I undo?
de: Ich habe einen Fehler gemacht. Kann ich einen Spielzug zurücknehmen?

source: No. This game does not have an <quote>Undo</quote> feature.
de: Nein, in diesem Spiel können Sie keinen Zug zurücknehmen.

source: Can I use the keyboard to play this game?
de: Kann ich mit der Tastatur spielen?

source: No. This game cannot be played using keyboard.
de: Nein, dieses Spiel kann nicht mit der Tastatur gespielt werden.

source: I cannot figure out what to do here! Are there hints?
de: Ich komme im Spiel nicht weiter, gibt es Tipps?

source: No. This game does not have a <quote>Hint</quote> feature.
de: Nein, in diesem Spiel gibt es keine Tipps.

source: I have to quit the game now, but I am not finished yet. Can I save my progress?
de: Ich muss das Spiel unterbrechen, kann ich den aktuellen Spielstand speichern?

source: No. This game does not have a <quote>Save State</quote> feature.
de: Nein, in diesem Spiel kann der aktuelle Spielstand nicht gespeichert werden.

source: Can I change players' names?
de: Kann ich die Namen der Spieler ändern?

source: Yes. To change the names displayed on the right hand side of the game screen refer to <link linkend="name_change">this</link> section of 'Interface Overview' for details.
de: Ja, um die Namen der Spieler zu ändern, wählen Sie <link linkend="name_change"><menuchoice><guimenu>Einstellungen</guimenu> <guimenuitem>Spielernamen ändern ...</guimenuitem></menuchoice></link> in der Menüleiste.

source: Interface Overview
de: Die Benutzeroberfläche

source: The Game Menu
de: Das Menü Spiel

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap><anchor id="new_game"/>N</keycap></keycombo> </shortcut> <guimenu>Game</guimenu> <guimenuitem>New</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap><anchor id="new_game"/>N</keycap> </keycombo> </shortcut> <guimenu>Spiel</guimenu> <guimenuitem>Neu</guimenuitem>

source: Starts a new game.
de: Startet ein neues Spiel.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>End</keycap></keycombo> </shortcut> <guimenu>Game</guimenu> <guimenuitem>End Game</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Ende</keycap> </keycombo> </shortcut> <guimenu>Spiel</guimenu> <guimenuitem>Spiel beenden</guimenuitem>

source: Ends a running game.
de: Beendet ein Spiel.

source: <guimenu>Game</guimenu> <guimenuitem>Clear Statistics</guimenuitem>
de: <guimenu>Spiel</guimenu> <guimenuitem>Statistik zurücksetzen</guimenuitem>

source: <action>Clears the all time game memory.</action> This statistic is saved when the game ended and shows the overall score and the amount of played and won games per player. This is cleared with this menu option.
de: <action>Löscht die Spielstatistik.</action> Diese wird beim Programmende gespeichert und zeigt die Gesamtwertung, die Anzahl der gespielten und gewonnenen Spiele.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo> </shortcut> <guimenu>Game</guimenu> <guimenuitem>Quit</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo> </shortcut> <guimenu>Spiel</guimenu> <guimenuitem>Beenden</guimenuitem>

source: Quits the program.
de: Beendet das Programm.

source: The Settings Menu
de: Das Menü Einstellungen

source: <guimenu>Settings</guimenu> <guisubmenu>Starting Player</guisubmenu>
de: <guimenu>Einstellungen</guimenu><guisubmenu>Startspieler</guisubmenu>

source: Selects whether player 1 (top) or player two (bottom) begins the next game.
de: Bestimmt, ob Spieler 1 (oben) oder Spieler 2 (unten) das nächste Spiel beginnen soll.

source: <guimenu>Settings</guimenu> <guisubmenu>Player 1 Played By</guisubmenu>
de: <guimenu>Einstellungen</guimenu><guisubmenu>Spieler 1 gespielt von</guisubmenu>

source: Chooses who should play for player 1 (top). The player can be either controlled by the local player with the mouse or the computer will control it.
de: Hier wählen Sie, wer Spieler 1 (oben) spielt. Der Spieler kann entweder von einem lokalen Spieler mit der Maus oder durch den Computer gesteuert werden.

source: <guimenu>Settings</guimenu> <guisubmenu>Player 2 Played By</guisubmenu>
de: <guimenu>Einstellungen</guimenu><guisubmenu>Spieler 2 gespielt von</guisubmenu>

source: Chooses who should play for player 2 (bottom). The player can be either controlled by the local player with the mouse or the computer will control it.
de: Hier wählen Sie, wer Spieler 2 (unten) spielt. Der Spieler kann entweder von einem lokalen Spieler mit der Maus oder durch den Computer gesteuert werden.

source: <guimenu>Settings</guimenu> <guisubmenu>Theme</guisubmenu>
de: <guimenu>Einstellungen</guimenu><guisubmenu>Design</guisubmenu>

source: Chooses a visual theme. This changes the appearance of the game but not of the cards. Card decks are selected with their own menu option.
de: Auswahl eines Designs für das Spielfeld. Damit wird nur das Aussehen des Spielfeldes festgelegt. Für die Auswahl von Designs der Kartenblätter gibt es einen eigenen Menüeintrag.

source: <shortcut> <keycap>F10</keycap> </shortcut> <guimenu>Settings</guimenu> <guimenuitem>Select Card Deck...</guimenuitem>
de: <shortcut> <keycap>F10</keycap></shortcut> <guimenu>Einstellungen</guimenu> <guimenuitem>Blatt aussuchen ...</guimenuitem>

source: <action> Choose the face and back of the carddeck used for playing.</action> You can select these in a preview dialog showing all carddecks installed for &kde;.
de: <action>Wählt die Vorder- und Rückseite der Karten aus.</action>Sie können diese in einem Fenster aussuchen, in dem alle Vorder -und Rückseiten für Karten in &kde; dargestellt sind.

source: Some carddecks or cardsets are marked as scalable graphics (SVG) in the dialog. Choosing them will display better quality of the graphics when the game is scaled or enlarged. Fixed size graphics will loose quality when resized different than their original size.
de: Einige Kartenblätter in diesem Dialog sind als skalierbare Grafiken (SVG) gekennzeichnet. Diese können in besserer Qualität dargestellt werden, wenn das Spielfeld in der Größe verändert wird. Die anderen Kartenblätter werden in schlechterer Qualität dargestellt, wenn sie nicht in ihrer Originalgröße angezeigt werden.

source: <guimenu>Settings</guimenu> <guimenuitem>Change Player Names...</guimenuitem>
de: <guimenu>Einstellungen</guimenu><guimenuitem>Spielernamen ändern ...</guimenuitem>

source: Change the names of the players.
de: Hier können Sie die Namen der Spieler ändern.

source: Additionally &lskat; has the common &kde; <guimenu>Settings</guimenu> and <guimenu>Help</guimenu> menu items, for more information read the sections about the <ulink url="help:/fundamentals/ui.html#menus-settings">Settings Menu</ulink> and <ulink url="help:/fundamentals/ui.html#menus-help">Help Menu</ulink> of the &kde; Fundamentals.
de: Zusätzlich hat &lskat; die bekannten &kde;-Einträge im Menü <guimenu>Einstellungen</guimenu> und <guimenu>Hilfe</guimenu>, weitere Informationen dazu finden Sie in den Abschnitten über die Menüs <ulink url="help:/fundamentals/ui.html#menus-settings">Einstellungen</ulink> und <ulink url="help:/fundamentals/uihtml#menus-help">Hilfe</ulink> der &kde;-Grundlagen.

source: Credits and License
de: Danksagungen und Lizenz

source: &lskat;
de: Offiziersskat

source: Program copyright 2000-2007 &Martin.Heni; <email>kde@heni-online.de</email>
de: Programm Copyright 2000-2007 &Martin.Heni; <email>martin@heni-online.de</email>

source: Graphics copyright 2007 Eugene Trounev <email>eugene.trounev@gmail.com</email>
de: Grafik Copyright 2007 Eugene Trounev <email>eugene.trounev@gmail.com</email>

source: Documentation copyright 2000-2007 &Martin.Heni; <email>kde@heni-online.de</email>
de: Dokumentation Copyright 2000-2007 &Martin.Heni; <email>martin@heni-online.de</email>

source: Documentation converted to &kde; 2.0 by &Mike.McBride; &Mike.McBride.mail;
de: Dokumentation für &kde; 2.0 überarbeitet von &Mike.McBride; &Mike.McBride.mail;

source: CREDIT_FOR_TRANSLATORS
de: <para>Deutsche Übersetzung von Maren Pakura <email>maren@kde.org</email></para>

source: Compilation and Installation
de: Kompilierung und Installation
