Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/kdeadmin/kuser.po
Languages: de

source: LDAP Group container
de: LDAP-Gruppen-Container

source: This specifies where to store groups' entries relative to the LDAP base DN.
de: Hier wird festgelegt, wo die Gruppeneinträge relativ zur LDAP-Basis-DN abgelegt werden.

source: LDAP Group filter
de: LDAP-Gruppenfilter

source: This specifies the filter used for group entries.
de: Legt fest, welcher Filter für Gruppeneinträge verwendet wird.

source: LDAP User RDN prefix
de: LDAP-Benutzer-RDN-Präfix

source: This specifies what prefix will used for user entries.
de: Legt fest, welches Präfix für Benutzereinträge verwendet wird.

source: Check this if the user's full name should be stored in the cn (Canonical Name) attribute.
de: Markieren Sie diese Einstellung, wenn der vollständige Name des Benutzers im Attribut cn (Canonical Name) gespeichert werden soll.

source: Update the gecos field
de: Aktualisieren des Feldes gecos

source: Check this if the gecos attribute should be updated.
de: Markieren Sie diese Einstellung, wenn das Attribut gecos aktualisiert werden soll.

source: Manage LDAP shadowAccount objectclass
de: LDAP-Objektklasse shadowAccount verwalten

source: Check this if the shadowAccount object should be used in the users' entries. It allows to enforce password change/expiration policies.
de: Markieren Sie diese Einstellung, wenn das Objekt shadowAccount der Benutzereinträge verwendet werden soll. Hiermit können Regeln für Passwortänderung und -ablauf vorgegeben werden.

source: LDAP Structural objectclass
de: Strukturelle LDAP-Objektklasse

source: This option allows to specify the structural objectclass used with users' entries. If you want to use these entries not just for authentication, but for an address book, too, then choose inetOrgPerson.
de: Mit dieser Einstellung kann die strukturelle Objektklasse festgelegt werden, die bei Benutzereinträgen verwendet wird. Wenn Sie diese Einträge nicht nur zur Authentifizierung, sondern auch für ein Adressbuch benutzen möchten, sollten Sie hier inetOrgPerson wählen.

source: LDAP Group RDN prefix
de: LDAP-Gruppen-RDN-Präfix

source: This specifies what prefix will used for group entries.
de: Legt fest, welcher Präfix für Gruppeneinträge verwendet wird.

source: LDAP Password hash method
de: Hash-Verfahren für LDAP-Passwörter

source: This specifies the password hashing method. The most secure is SSHA.
de: Legt das Hash-Verfahren für Passwörter fest. Das sicherste Verfahren ist SSHA.

source: Enable samba account management
de: Samba-Zugangsverwaltung

source: Check this if you want to use the user/group entries in a Samba domain. KUser will create sambaSamAccount objectclass for each entry which is usable with the ldapsam passdb backend with Samba version greater than 3.0.
de: Markieren Sie diese Einstellung, wenn Sie die Benutzer- und Gruppeneinträge in einer Samba-Domäne verwenden möchten. KUser erstellt eine sambaSamAccount-Objektklasse für jeden Eintrag, die vom „ldapsam passdb“-Backend verwendet werden kann, das in Samba ab der Version 3.0 enthalten ist.

source: Samba domain name
de: Samba-Domänen-Name

source: This specifies the samba domain name.
de: Hier wird der Name der Samba-Domäne festgelegt.

source: Samba domain SID
de: Samba-Domänen-SID

source: This specifies the domain Security IDentifier. It is unique in a single domain. You can query the value of the domain SID with 'net getlocalsid domain_name'.
de: Hiermit wird der Domain Security IDentifier festgelegt. Innerhalb einer Domäne ist dieser eindeutig. Sie können den Wert der Domänen-SID über „net getlocalsid domain_name“ abfragen.

source: Algorithmic RID base
de: Algorithmische RID-Basis

source: This value is an offset for the algorithmic mapping from uids and gids to rids. The default (and minimum) value is 1000, it must be even, and the LDAP database and smb.conf must store the same values.
de: Dieser Wert stellt einen Offset für die algorithmische Abbildung von uids und gids auf rids dar. Die Voreinstellung (und das Minimum) ist der Wert 1000. Der Wert muss eine gerade Zahl sein, und die LDAP-Datenbank und smb.conf müssen dieselben Werte speichern.

source: Samba login script
de: Samba-Anmeldeskript

source: This specifies a name of a login script (in the `Netlogon` share) which will be executed as the user logs in to a Windows machine.
de: Hier wird der Name des Anmeldeskripts (in der Netlogon-Freigabe) festgelegt, das ausgeführt wird, wenn sich der Benutzer auf einem Windows-Rechner anmeldet.

source: Samba home drive
de: Persönliches Laufwerk (Samba)

source: Specifies a drive letter where the user's home directory will automatically mapped when he/she logs into a Windows machine.
de: Legt einen Laufwerksbuchstaben fest, auf den der Persönliche Ordner des Benutzers bei der Anmeldung an einen Windows-Rechner automatisch abgebildet wird.

source: Samba profile path template
de: Vorlage

source: This specifies the location of the roaming profile of the user. The '%U' macro will be replaced with the actual user name.
de: Hier wird der Speicherort des mobilen Profils des Benutzers festgelegt. Der Platzhalter %U wird durch den tatsächlichen Namen des Benutzers ersetzt.

source: Samba home path template
de: Vorlage für Persönlichen Ordner (Samba)

source: This specifies the location of the home directory of the user. This field is meaningful only for Windows machines. The '%U' macro will be replaced with the actual user name.
de: Hier wird der Ort des Persönlichen Ordners für den Benutzer festgelegt. Dieses Feld hat nur für Windows-Rechner eine Bedeutung. Das Makro %U wird durch den Benutzernamen ersetzt.

source: Store the LanManager hashed password in the sambaLMPassword attribute. Check this if you have older clients (Win9x series and before) on your network.
de: Speichert den Hashwert des LanManager-Passworts im Attribut sambaLMPassword. Versuchen Sie dies, wenn Sie ältere Clients (Win9x und älter) in Ihrem Netzwerk haben.

source: &File
de: &Datei

source: &User
de: &Benutzer

source: &Group
de: &Gruppe

source: &Settings
de: &Einstellungen
