Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/kdeadmin/kuser.po
Languages: de

# NAME OF TRANSLATORS
source: Your names
de: Volker Dose,Andreas Kunadt,Christian Dávid,Arndt Braun

# EMAIL OF TRANSLATORS
source: Your emails
de: vpdose@cpmgut.toppoint.de,kunsen@web.de,christian-david@web.de,arndtbraun@googlemail.com

source: New Account Options
de: Einstellungen für neue Benutzer

source: Create home folder
de: Persönlichen Ordner erstellen

source: Copy skeleton
de: Vorlagen kopieren

source: User with UID %1 already exists.
de: Ein Benutzer mit der Benutzer-ID %1 existiert bereits.

source: User with RID %1 already exists.
de: Ein Benutzer mit RID %1 existiert bereits.

source: Folder %1 already exists. %2 may become owner and permissions may change. Do you really want to use %3?
de: Der Ordner %1 existiert bereits! Der Benutzer %2 könnte Eigentümer werden, wodurch sich die Berechtigungen evtl. ändern. Möchten Sie wirklich %3 benutzen?

source: %1 is not a folder.
de: %1 ist kein Ordner.

source: stat() failed on %1.
de: Der Aufruf der Systemfunktion stat() auf %1 ist fehlgeschlagen.

source: Mailbox %1 already exists (uid=%2).
de: Das Postfach %1 existiert bereits (Benutzer-ID=%2)

source: %1 exists but is not a regular file.
de: %1 existiert bereits, ist aber keine reguläre Datei.

source: <Empty>
de: <Leer>

source: Connection
de: Anbindung

source: Password Policy
de: Passwort-Regelung

source: day
de: Tag

source: General
de: Allgemein

source: General Settings
de: Allgemeine Einstellungen

source: Files
de: Dateien

source: File Source Settings
de: Dateiquellen-Einstellungen

source: Settings
de: Einstellungen

source: LDAP Source Settings
de: LDAP-Quelleinstellungen

source: Delete User
de: Benutzer löschen

source: <p>Deleting user <b>%1</b><br />Also perform the following actions:</p>
de: <p>Benutzer <b>%1</b> wird aus dem System entfernt.<br /> Weiterhin werden folgende Aktionen ausgeführt:</p>

source: Delete &home folder: %1
de: Löschen des &Persönlichen Ordners: %1

source: Delete &mailbox: %1
de: &Postfach %1 löschen

source: Group Properties
de: Eigenschaften der Gruppe

source: Domain Admins
de: Domänen-Verwalter

source: Admins
de: Verwalter

source: Domain Users
de: Domänen-Benutzer

source: Users
de: Benutzer

source: Domain Guests
de: Domänen-Gäste

source: Guests
de: Gäste

source: Group number:
de: Gruppennummer:

source: Group rid:
de: Gruppen-RID:

source: Group name:
de: Gruppenname:

source: Description:
de: Beschreibung:

source: Display name:
de: Angezeigter Name:

source: Type:
de: Typ:

source: Domain
de: Domäne

source: Local
de: Lokal

source: Builtin
de: Eingebaut

source: Domain SID:
de: Domänen-SID:

source: Disable Samba group information
de: Samba-Gruppeninformation deaktivieren

source: Users in Group
de: Mitglieder der Gruppe

source: Add
de: Hinzufügen

source: Remove
de: Entfernen

source: Users NOT in Group
de: Keine Mitglieder der Gruppe

source: You need to type a group name.
de: Sie müssen einen Gruppennamen eingeben.

source: Group with name %1 already exists.
de: Eine Gruppe mit dem Namen %1 existiert bereits.

source: Group with SID %1 already exists.
de: Eine Gruppe mit der SID %1 existiert bereits.

source: Group with gid %1 already exists.
de: Eine Gruppe mit der GID %1 existiert bereits.

source: Do not change
de: Nicht ändern

source: days
de: Tage

source: Never
de: Nie

source: User Info
de: Benutzerinformation

source: User login:
de: Benutzeranmeldung:

source: &User ID:
de: Benutzer-&ID:

source: Set &Password...
de: Passwort &setzen ...

source: Full &name:
de: Vollständiger &Name:

source: Surname:
de: Nachname:

source: Email address:
de: E-Mail-A&dresse:

source: &Login shell:
de: &Anmelde-Shell:

source: &Home folder:
de: &Persönlicher Ordner:

source: &Office:
de: &Büro:

source: Offi&ce Phone:
de: Telefon Bü&ro:

source: Ho&me Phone:
de: Telefon &privat:

source: Login class:
de: Anmelde-Klasse:

source: &Office #1:
de: Büro &1:

source: O&ffice #2:
de: Büro &2:

source: &Address:
de: A&dresse:

source: Account &disabled
de: &Zugang deaktiviert

source: Disable &POSIX account information
de: &POSIX-Zugangsinformation deaktivieren

source: Password Management
de: Passwortverwaltung

source: Last password change:
de: Letzte Passwort-Änderung:

source: POSIX parameters:
de: POSIX-Parameter:

source: Time before password may &not be changed after last password change:
de: Der Zeitraum, in dem das Passwort nach einem Wechsel nicht geändert werden darf:

source: Time when password &expires after last password change:
de: Der Zeitraum, in dem das Passwort geändert werden muss, damit es nicht abläuft:

source: Time before password expires to &issue an expire warning:
de: Die Zeit, bevor vor dem Verfall eines Passwortes gewarnt wird:

source: Time when account will be &disabled after expiration of password:
de: Zeit, nach der ein Zugang deaktiviert wird, wenn das Passwort abgelaufen ist:

source: &Account will expire on:
de: Zu&gang läuft ab am:

source: Login script:
de: Anmeldeskript:

source: Profile path:
de: Profil-Pfad:

source: Home drive:
de: Persönliches Laufwerk:

source: Home path:
de: Pfad für Persönlichen Ordner:

source: User workstations:
de: Benutzerrechner:

source: Domain name:
de: Domänen-Name:

source: Disable &Samba account information
de: Samba-&Zugangsinformation deaktivieren

source: Groups
de: Gruppen

source: Primary group:
de: Primäre Gruppe:

source: Set as Primary
de: Als primär setzen

source: User Properties
de: Benutzereigenschaften

source: User Properties - %1 Selected Users
de: Benutzereigenschaften – %1 ausgewählte Benutzer

source: Do Not Change
de: Nicht ändern

source: You need to specify an UID.
de: Sie müssen eine UID eingeben.

source: You must specify a home directory.
de: Sie müssen einen Persönlichen Ordner angeben.

source: You must fill the surname field.
de: Sie müssen das Feld „Nachname“ ausfüllen.

source: You need to specify a samba RID.
de: Sie müssen eine Samba-RID angeben.

source: User with UID %1 already exists
de: Ein Benutzer mit UID %1 existiert bereits

source: User with RID %1 already exists
de: Ein Benutzer mit RID %1 existiert bereits

source: <p>The shell %1 is not yet listed in the file %2. In order to use this shell you must add it to this file first.<br />Do you want to add it now?</p>
de: <p>Die Shell %1 ist nicht in der Datei %2 aufgeführt. Um diese Shell benutzen zu können, müssen Sie zunächst einen solchen Eintrag hinzufügen.<br />Möchten Sie dies nun durchführen?</p>

source: Unlisted Shell
de: Shell nicht aufgeführt

source: &Add Shell
de: Shell hin&zufügen

source: Do &Not Add
de: &Nicht hinzufügen

source: User/group database locations
de: Quelle der Benutzer/Gruppen-Datenbank:

source: MD5 shadow passwords
de: „MD5-shadow“-Passwörter

source: Shadow group file:
de: Datei für „shadow“-Gruppen:

source: Shadow password file:
de: Datei für „shadow“-Passwörter:

source: Group file:
de: Gruppendatei:

source: Password file:
de: Passwortdatei:

source: Source of user/group database:
de: Quelle der Benutzer/Gruppen-Datenbank:

source: First normal GID:
de: Erste normale GID:

source: Home path template:
de: Vorlage für Persönlichen Ordner:

source: First normal UID:
de: Erste normale UID:

source: Copy skeleton to home folder
de: Vorlage in den Persönlichen Ordner kopieren

source: User private groups
de: Private Gruppe für Benutzer

source: Default group:
de: Standardgruppe:

source: Groups file name not set, please check 'Settings/Files'
de: Der Gruppendateiname wurde nicht angegeben. Bitte überprüfen Sie den Punkt Einstellungen/Dateien

source: stat() call on file %1 failed: %2 Check KUser settings.
de: Der Aufruf von stat() für die Datei %1 ist fehlgeschlagen: %2 Bitte überprüfen Sie die Einstellungen von KUser.

source: Error opening %1 for reading.
de: Fehler beim Öffnen von %1 zum Lesen.

source: Error opening %1 for writing.
de: Fehler beim Öffnen von %1 zum Schreiben.

source: Loading Groups From LDAP
de: Gruppen von LDAP laden

source: LDAP Operation
de: LDAP-Betrieb

source: Group Name
de: Gruppenname

source: Domain SID
de: Domänen-SID

source: Type
de: Typ

source: Display Name
de: Angezeigter Name

source: Description
de: Beschreibung

source: Unknown
de: Unbekannt

source: Manage Samba user accounts/groups
de: Samba-Benutzerzugänge/-gruppen verwalten

source: Default login script:
de: Voreingestelltes Anmeldeskript:

source: Profile path template:
de: Pfad für Profilvorlagen:

source: Store LanManager hashed password
de: LanManager Passwort-Hashwert speichern

source: &Query Server
de: &Serverabfrage

source: Domain SID (you can obtain with 'net getlocalsid domain_name'):
de: Domain-SID (diese erhalten Sie mit „net getlocalsid domain_name“):

source: Algorithmic RID base:
de: Algorithmische RID-Basis:

source: gidNumber
de: GID

source: Plain Text
de: Einfacher Text

source: User base:
de: Benutzerbasis:

source: Group filter:
de: Gruppenfilter:

source: Structural objectclass:
de: Strukturelle Objektklasse:

source: User filter:
de: Benutzerfilter:

source: account
de: Zugang

source: Group RDN prefix:
de: Gruppen-RDN-Präfix:

source: uidNumber
de: UID-Nummer

source: Group base:
de: Gruppenbasis:

source: User RDN prefix:
de: Benutzer-RDN-Präfix:

source: Password hash:
de: Passwort-Hash:

source: Manage shadowAccount objectclass
de: Objektklasse shadowAccount verwalten

source: Store the user's full name in the cn attribute
de: Speichern des vollständigen Benutzernamens im Attribut cn

source: Update the gecos attribute
de: Aktualisieren des Attributs gecos

source: KDE User Editor
de: KDE-Benutzerverwaltung

source: (c) 1997-2000, Denis Perchine (c) 2004, Szombathelyi György
de: © 1997–2000, Denis Perchine © 2004, Szombathelyi György

source: kuser author
de: Entwickler von KUser

source: KDE User Manager
de: KDE-Benutzerverwaltung

source: You have selected %1 users. Do you really want to change the password for all the selected users?
de: Sie haben %1 Benutzer gewählt. Soll das Passwort für alle ausgewählten Benutzer geändert werden?

source: Change
de: Ändern

source: You have run out of uid space.
de: Es gibt keine freien Benutzer-IDs mehr.

source: Please type the name of the new user:
de: Bitte geben Sie den Namen des neuen Benutzers ein:

source: User with name %1 already exists.
de: Ein Benutzer mit dem Namen %1 existiert bereits.

source: You are using private groups. Do you want to delete the user's private group '%1'?
de: Sie verwenden private Gruppen. Möchten Sie die private Gruppe „%1“ des Benutzers löschen?

source: Do Not Delete
de: Nicht löschen

source: You have run out of gid space.
de: Es gibt keine freien Gruppen-IDs mehr.

source: The group '%1' is the primary group of one or more users (such as '%2'); it cannot be deleted.
de: Die Gruppe „%1“ ist die primäre Gruppe eines oder mehrerer Benutzer (z. B. „%2“); sie kann nicht gelöscht werden.

source: Do you really want to delete the group '%1'?
de: Möchten Sie die Gruppe „%1“ wirklich löschen?

source: Do you really want to delete the %1 selected groups?
de: Möchten Sie die %1 ausgewählten Gruppen löschen?

source: Reading configuration
de: Einlesen der Einstellungen

source: Ready
de: Fertig

source: &Add...
de: &Hinzufügen ...

source: &Edit...
de: &Bearbeiten ...

source: &Delete...
de: &Löschen ...

source: &Set Password...
de: &Passwort setzen ...

source: &Reload...
de: E&rneut laden ...

source: &Select Connection...
de: Anbindung &wählen ...

source: Show System Users/Groups
de: Systembenutzer/-Gruppen anzeigen

source: Can not create backup file for %1
de: Die Sicherungskopie von Datei %1 lässt sich nicht erstellen

source: Error creating symlink %1. Error: %2
de: Die symbolische Verknüpfung %1 kann nicht erstellt werden. Fehler: %2

source: Cannot change owner of folder %1. Error: %2
de: Der Eigentümer des Ordners %1 lässt sich nicht ändern. Fehler: %2

source: Cannot change permissions on folder %1. Error: %2
de: Die Zugriffsrechte des Ordners %1 lassen sich nicht ändern. Fehler: %2

source: Cannot change owner of file %1. Error: %2
de: Der Eigentümer der Datei %1 lässt sich nicht ändern. Fehler: %2

source: Cannot change permissions on file %1. Error: %2
de: Die Zugriffsrechte der Datei %1 lassen sich nicht ändern. Fehler: %2

source: File %1 does not exist.
de: Die Datei %1 existiert nicht.

source: Cannot open file %1 for reading.
de: Die Datei %1 lässt sich nicht zum Lesen öffnen.

source: Cannot open file %1 for writing.
de: Die Datei %1 lässt sich nicht zum Schreiben öffnen.

source: Time before password expires to issue an expire warning:
de: Warnung vor Ablaufen des Passworts:

source: Time when password expires after last password change:
de: Zeit nach letzter Änderung des Passworts:

source: Time when account will be disabled after expiration of password:
de: Zugang wird deaktiviert nach Ablauf des Passworts:

source: Time before password may not be changed after last password change:
de: Minimaler Abstand zwischen Passwortänderungen:

source: Account will expire on:
de: Zugang läuft ab am:

source: Enter Password
de: Passwort eingeben

source: Password:
de: Passwort:

source: Verify:
de: Überprüfen:

source: Passwords are not identical. Try again.
de: Die Passwörter sind nicht identisch. Versuchen Sie es noch einmal.

source: Connection Selection
de: Anbindung auswählen

source: &New...
de: &Neu ...

source: &Edit
de: &Bearbeiten

source: &Delete
de: &Löschen

source: Defined connections:
de: Vorhandene Anbindungen:

source: Please type the name of the new connection:
de: Geben Sie den Namen der neuen Anbindung ein:

source: A connection with this name already exists.
de: Eine Anbindung mit diesem Namen existiert bereits.

source: Do you really want to delete the connection '%1'?
de: Möchten Sie die Anbindung „%1“ wirklich löschen?

source: Delete Connection
de: Anbindung löschen

source: Cannot create home folder for %1: it is null or empty.
de: Der Persönliche Ordner für %1 lässt sich nicht erstellen, da er nicht angegeben wurde.

source: Cannot create home folder %1. Error: %2
de: Der Persönliche Ordner %1 lässt sich nicht erstellen. Fehler: %2

source: Cannot change owner of home folder %1. Error: %2
de: Der Eigentümer des Persönlichen Ordners %1 lässt sich nicht ändern. Fehler: %2

source: Cannot change permissions on home folder %1. Error: %2
de: Die Zugriffsrechte des Persönlichen Ordners %1 lassen sich nicht ändern. Fehler: %2

source: Folder %1 already exists. Will make %2 owner and change permissions. Do you want to continue?
de: Der Ordner %1 existiert bereits! Die Zugriffsrechte werden verändert und %2 wird Eigentümer. Möchten Sie fortfahren?

source: Cannot change owner of %1 folder. Error: %2
de: Der Eigentümer des Ordners %1 lässt sich nicht ändern. Fehler: %2

source: Folder %1 left 'as is'. Verify ownership and permissions for user %2 who may not be able to log in.
de: Der Ordner %1 wurde nicht verändert. Überprüfen Sie Eigentümerschaft und Zugriffsrechte des Benutzers %2, er wird sich eventuell nicht am System anmelden können!

source: %1 exists and is not a folder. User %2 will not be able to log in.
de: %1 existiert bereits, ist jedoch kein Ordner. Der Benutzer %2 wird sich nicht am System anmelden können.

source: Cannot create %1 folder. Error: %2
de: Der Ordner %1 lässt sich nicht erstellen Fehler: %2

source: stat call on %1 failed. Error: %2
de: Der Eigentümer der Datei %1 lässt sich nicht ändern Fehler: %2

source: Cannot create %1: %2
de: %1 kann nicht erzeugt werden: %2

source: Cannot change owner on mailbox: %1 Error: %2
de: Der Eigentümer des Postfachs %1 lässt sich nicht ändern Fehler: %2

source: Cannot change permissions on mailbox: %1 Error: %2
de: Die Zugriffsrechte des Postfachs %1 lassen sich nicht ändern Fehler: %2

source: Folder %1 does not exist, cannot copy skeleton for %2.
de: Der Ordner %1 existiert nicht, Vorlagen für %2 können nicht kopiert werden.

source: Folder %1 does not exist, cannot copy skeleton.
de: Der Ordner %1 existiert nicht, Vorlagen können nicht kopiert werden.

source: Cannot remove home folder %1. Error: %2
de: Der Persönliche Ordner %1 lässt sich nicht löschen. Fehler: %2

source: Removal of home folder %1 failed (uid = %2, gid = %3).
de: Das Löschen des Persönlichen Ordners %1 ist fehlgeschlagen. (UID = %2, GID = %3)

source: stat call on file %1 failed. Error: %2
de: Der Aufruf von stat() für die Datei %1 ist fehlgeschlagen. Fehler: %2

source: Cannot remove crontab %1. Error: %2
de: Crontab %1 lässt sich nicht löschen Fehler: %2

source: Cannot remove mailbox %1. Error: %2
de: Das Postfach %1 lässt sich nicht löschen Fehler: %2

source: KUser sources were not configured. Set 'Password file' in Settings/Files
de: KUser wurde nicht richtig eingerichtet. Bitte geben Sie die Passwortdatei unter Einstellungen/Dateien an.

source: Stat call on file %1 failed: %2 Check KUser settings.
de: Der Aufruf von stat() für die Datei %1 ist fehlgeschlagen: %2 Bitte überprüfen Sie die Einstellungen von KUser.

source: Error opening %1 for reading.
de: Fehler beim Öffnen von %1 zum Lesen.

source: No /etc/passwd entry for %1. Entry will be removed at the next `Save'-operation.
de: Kein Eintrag in /etc/passwd für %1. Der Eintrag wird beim nächsten Speichern gelöscht.

source: Unable to build password database.
de: Erstellen der Passwortdatenbank nicht möglich.

source: Loading Users From LDAP
de: Benutzer von LDAP laden

source: User Login
de: Benutzername

source: Full Name
de: Vollständiger Name

source: Home Directory
de: Persönlicher Ordner

source: Login Shell
de: Anmelde-Shell

source: Samba Login Script
de: Samba-Anmeldeskript

source: Samba Profile Path
de: Samba-Profil-Pfad

source: Samba Home Drive
de: Persönliches Laufwerk (Samba)

source: Samba Home Path
de: Pfad zum Persönlichen Laufwerk (Samba)

source: Default connection
de: Standardverbindung

source: Show system users
de: Systembenutzer anzeigen

source: The source of the user and group database
de: Die Quelle der Benutzer- und Gruppendatenbank

source: This option allows you to select where the user/group data stored. Currently three storage backends are supported. <BR><B>Files</B> stores user/group data in traditional /etc/passwd and /etc/group flat files. <BR><B>LDAP</B> stores data in a directory server using the posixAccount and posixGroup object classes; this backend allows the management of Samba users/groups via the sambaSamAccount object class.<BR><B>System</B> provides a read-only access to all users and groups which your installation knows about.
de: Mit dieser Einstellung kann festgelegt werden wie die Benutzer- und Gruppendaten gespeichert werden. Derzeit werden drei Verfahren unterstützt:<br><b>Dateien</b> speichert die Benutzer- und Gruppendaten traditionell in den Textdateien /etc/passwd und /etc/group.<br><b>LDAP</b> speichert die Benutzer- und Gruppendaten mit den Gruppenklassen posixAccount und posixGroup in einem Verzeichnisdienst. Diese Methode ermöglicht die Verwaltung von Samba-Benutzergruppen über die Objektklasse sambaSamAccount.<br><b>System</b> bietet schreibgeschützten Zugriff auf alle Benutzer und Gruppen, die auf Ihrem System bekannt sind.

source: This option allows you to select the shell which will be the default for new users.
de: Diese Einstellung erlaubt die Auswahl der Shell, die als Standard bei neuen Benutzern verwendet wird.

source: Home path template
de: Vorlage für Persönlichen Ordner

source: This option specifies the UNIX home path template for new users. The '%U' macro will replaced with the actual user name.
de: Diese Einstellung legt die Vorlage für den Persönlichen Ordner unter UNIX fest. Das Makro %U wird durch den Benutzernamen ersetzt.

source: First UID
de: Erste UID

source: This options specifies the first user ID where searching for an available UID starts.
de: Diese Einstellung legt die erste Benutzer-ID fest, ab der nach verfügbaren UIDs gesucht wird.

source: First GID
de: Erste GID

source: This options specifies the first group ID where searching for an available GID starts.
de: Diese Einstellung legt die erste Gruppen-ID fest, ab der nach verfügbaren GIDs gesucht wird.

source: If this option is checked then a home directory will created for the new user.
de: Ist diese Einstellung aktiviert, wird für den neuen Benutzer ein Persönlicher Ordner angelegt.

source: If this option is checked then the contents of the skeleton folder will copied to the new user's home directory
de: Ist diese Einstellung aktiviert, wird der Inhalt des Ordners „skeleton“ in den Persönlichen Ordner des neuen Benutzers kopiert.

source: If this option is enabled, new user creation will create a private group named as the user, and the primary group of the user will assigned to this private group.
de: Ist diese Einstellung aktiviert, wird beim Anlegen eines neuen Benutzers eine private Gruppe angelegt, die den Namen des Benutzers trägt. Die primäre Gruppe des Benutzers wird dieser privaten Gruppe zugeordnet.

source: Default primary group
de: Voreingestellte primäre Gruppe

source: This is the default primary group which will be assigned to a newly created user.
de: Dies ist die voreingestellte primäre Gruppe, der ein neu angelegter Benutzer zugeordnet wird.

source: This setting is for specifying a date when user accounts will expire.
de: Diese Einstellung legt das Datum fest, an dem der Benutzerzugang abläuft.

source: Check this if you want to user accounts never expire.
de: Markieren Sie diese Einstellung, wenn der Benutzerzugang nie abläuft.

source: Password file
de: Passwortdatei

source: This specifies the users database file (usually /etc/passwd).
de: Hier wird die Datei mit den Benutzerdaten angegeben (gewöhnlich /etc/passwd).

source: Group file
de: Gruppendatei

source: This specifies the groups database file (usually /etc/group).
de: Hier wird die Datei mit den Gruppendaten angegeben (gewöhnlich /etc/group).

source: MD5 Shadow passwords
de: „MD5-shadow“-Passwörter

source: Check this if you want the passwords in the shadow file MD5 hashed. Leave this unchecked if DES encryption should be used.
de: Aktivieren Sie diese Einstellung, wenn die Passwörter in der Shadow-Datei mit dem MD5-Verfahren verschlüsselt werden sollen. Anderenfalls werden sie mit dem DES-Verfahren verschlüsselt.

source: Shadow password file
de: Shadow-Passwortdatei

source: Specifies the shadow password file (usually /etc/shadow). Leave this empty if your system does not use a shadow password file.
de: Gibt die Shadow-Datei für die Passwörter an (gewöhnlich /etc/shadow). Tragen Sie hier nichts ein, wenn Ihr System keine Shadow-Passwörter unterstützt.

source: Group shadow file
de: Shadow-Gruppendatei

source: Specifies the shadow group file (usually /etc/gshadow). Leave this empty if your system does not use a shadow group file.
de: Gibt die Shadow-Datei für die Gruppen an (gewöhnlich /etc/gshadow). Tragen Sie hier nichts ein, wenn Ihr System keine Shadow-Datei für Gruppen unterstützt.

source: LDAP User
de: LDAP-Benutzer

source: LDAP Password
de: LDAP-Passwort

source: LDAP Bind DN
de: LDAP-Bindungs-DN

source: LDAP Size limit
de: LDAP-Größenbeschränkung

source: LDAP Time limit
de: LDAP-Zeitlimit

source: LDAP Base DN
de: LDAP-Basis-DN

source: LDAP no encryption
de: LDAP ohne Verschlüsselung

source: LDAP Anonymous
de: LDAP Anonyme Anmeldung

source: LDAP Simple auth
de: LDAP Einfache Anmeldung

source: LDAP SASL auth
de: LDAP-SASL-Anmeldung

source: LDAP SASL mechanism
de: LDAP-SASL-Mechanismus

source: LDAP User container
de: LDAP-Benutzer-Container

source: This specifies where to store users' entries relative to the LDAP base DN.
de: Hier wird festgelegt, wo die Benutzereinträge relativ zur LDAP-Basis-DN abgelegt werden.

source: LDAP User filter
de: LDAP-Benutzerfilter

source: This specifies the filter used for user entries.
de: Legt fest, welcher Filter für Benutzereinträge verwendet wird.
