Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/extragear-network/desktop_extragear-network_ktp-text-ui.po
Languages: de

# Name
source: Chat Window Appearance
de: Erscheinungsbild des Chat-Fensters

# Comment
source: Choose a Style for your Chat Window and customize it
de: Wählen Sie einen Stil für Ihr Chat-Fenster und passen Sie ihn an

# Name
source: Chat Tab Behavior
de: Verhalten von Chat-Unterfenstern

# Name
source: Plugins
de: Module

# Comment
source: How to deal with extra information obtained from messages
de: Verarbeitung zusätzlicher Information von Nachrichten

# Comment
source: Encrypt chat sessions with Off-The-Record encryption
de: Chatsitzung mit Off-The-Record-Verschlüsselung sichern

# Comment
source: When receiving a link to a bug on bugzilla show additional information such as the title and status
de: Wenn eine Verknüpfung zu einen Fehler in Bugzilla (KDE-Fehlerverfolgungssystem) eintrifft, werden zusätzliche Informationen wie Titel und Status angezeigt.

# Comment
source: Show emoticons (smiley faces) inside the chat
de: Emoticons im Chat anzeigen

# Name
source: Text Formatting
de: Textformatierung

# Comment
source: Use /, _, * and - to make text italic, underlined, bold or strikeout respectively
de: Mit „/“, „_“, “*“ und „-“ wird Text geneigt, unterstrichen, fett oder durchgestrichen dargestellt

# Name
source: Highlight
de: Hervorhebung

# Comment
source: If any incoming messages contain your nickname, it will highlight them in red
de: Wenn eine eingehende Nachricht Ihren Spitznamen enthält, wird sie rot hervorgehoben

# Name
source: Image Preview
de: Bildvorschau

# Comment
source: Embed a thumbnail of any image URL sent in a chat
de: Vorschaubild jeder in einen Chat gesendeten Bildadresse einbetten

# Comment
source: If incoming messages contain LaTeX between $$, it will render it directly into the chat.
de: Wenn eine eingehende Nachricht LaTeX eingeschlossenen in $$ enthält, wird sie direkt im Chat-Fenster gerendert.

# Comment
source: If a message is an OTR message, it will not be shown
de: Wenn eine Nachricht vom Typ OTR ist, wird sie nicht angezeigt

# Name
source: Web Shortcuts
de: Web-Kürzel

# Comment
source: Expand a KDE-shortened URI into a URL (i.e. typing wp:KDE will translate to http://en.wikipedia.org/wiki/KDE)
de: Erweitert eine KDE-Web-Kürzel URI zu einer Adresse (URL) (d. h. die Eingabe „wp:KDE“ wird zu „http://de.wikipedia.org/wiki/KDE“ erweitert.

# Name
source: Text To Speech
de: Sprachausgabe

# Comment
source: Read out incoming messages using text-to-speech service
de: Eingehende Nachrichten mit dem Sprachausgabedienst vorlesen

# Name
source: Short URLs
de: Kurz-URLs

# Comment
source: Shows the actual URL to which a shortened URL is redirecting to
de: Zeigt die tatsächliche Adresse (URL), auf die eine gekürzte URL umgeleitet wird

# Name
source: YouTube Preview
de: YouTube-Vorschau

# Comment
source: If any messages contains a link to a YouTube video, it will embed a preview in the chat
de: Wenn eine Nachricht eine Verknüpfung zu einem YouTube-Video enthält, wird das Video als Vorschau im Chat-Fenster angezeigt

# Comment
source: Telepathy Text-Ui Message Filter
de: Nachrichtenfilter für Telepathy-Text-Oberfläche

# Name
source: LogViewer Behavior
de: Verhalten des Protokollbetrachters

# Name
source: KDE IM Log Viewer
de: Instant-Messenger-Protokollbetrachter

# GenericName
source: KDE Instant Messenger Log Viewer
de: KDE-Betrachter für Instant-Messenger-Protokolle

# Comment
source: Displays your KDE Instant Messenger logs
de: Zeigt Ihre Instant-Messenger-Protokolle an
