Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/extragear-network/desktop_extragear-network_smb4k.po
Languages: de

# Comment
source: Advanced Network Neighborhood Browser
de: Erweiterter Browser für die Netzwerkumgebung

# Name
source: Notification
de: Benachrichtigung

# Comment
source: The user is notified about an action
de: Den Benutzer über eine Aktion benachrichtigen

# Name
source: Warning
de: Warnung

# Comment
source: A warning is shown to the user
de: Dem Benutzer eine Warnung anzeigen

# Name
source: Error
de: Fehler

# Comment
source: An error message is shown to the user
de: Dem Benutzer eine Fehlermeldung anzeigen

# Name
source: Mount action
de: Aktion zum Einbinden

# Description
source: Mounts a share
de: Bindet eine Freigabe ein

# Name
source: Unmount action
de: Aktion zum Lösen einer Einbindung

# Description
source: Unmounts a share
de: Löst die Einbindung einer Freigabe

# Name
source: Network Neighborhood
de: Netzwerkumgebung

# Comment
source: Network neighborhood browser based on Smb4K
de: Erweiterter Browser für die Netzwerkumgebung auf der Basis von Smb4K

# GenericName
source: Advanced Network Neighborhood Browser
de: Erweiterter Browser für die Netzwerkumgebung
