Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/extragear-network/desktop_extragear-network_ktorrent.po
Languages: de

# GenericName
source: BitTorrent Client
de: BitTorrent-Programm

# Comment
source: A BitTorrent program for KDE
de: Ein BitTorrent-Programm für die KDE-Arbeitsumgebung

# Name
source: Torrent stopped by error
de: Torrent aufgrund eines Fehlers angehalten

# Name
source: Torrent has finished downloading
de: Download eines Torrents abgeschlossen

# Name
source: Maximum share ratio reached
de: Maximales Verteilungsverhältnis erreicht

# Name
source: Maximum seed time reached
de: Maximale Uploadzeit erreicht

# Name
source: Disk space is running low
de: Nur noch wenig Speicherplatz verfügbar

# Name
source: Corrupted data has been found
de: Fehlerhafte Daten gefunden

# Name
source: Torrent cannot be enqueued
de: Torrent kann nicht in die Warteschlange eingereiht werden

# Name
source: Torrent cannot be started
de: Torrent kann nicht gestartet werden

# Name
source: Torrent cannot be loaded silently
de: Torrent kann nicht ohne Nachfrage geladen werden

# Name
source: DHT is not enabled
de: VHT ist nicht aktiviert

# Name
source: Event generated by plugin
de: Ereignis von Modul erzeugt

# Name
source: Magnet link download started
de: Download der Magnet-Verknüpfung wurde gestartet

# Name
source: KTorrent Plugin
de: KTorrent-Modul

# Comment
source: Plasma widget to keep track of a single torrent
de: Plasmoid zum Überwachen eines einzelnen Torrents

# Comment
source: KTorrent data engine, for getting information from KTorrent
de: KTorrent-Datenmodul zum Abrufen von Informationen von KTorrent

# Name
source: Scheduler
de: Bandbreitenplaner

# Comment
source: Schedule upload and download limits over a period of a week
de: Upload- und Downloadbegrenzungen über den Zeitraum von einer Woche planen

# Name
source: Download Order
de: Download-Reihenfolge

# Comment
source: Specify the download order of a multi-file torrent
de: Download-Reihenfolge bei Torrents, die aus mehreren Dateien bestehen, festlegen

# Name
source: Information Widget
de: Informationen

# Comment
source: Displays general information about a torrent in several tabs
de: Anzeige von allgemeinen Informationen über einen Torrent in mehreren Unterfenstern

# Comment
source: Filter IP addresses through a blocklist
de: IP-Adressen mit einer Blockliste filtern

# Name
source: Log Viewer
de: Protokollbetrachter

# Comment
source: Displays the logging output
de: Zeigt die Protokollausgaben

# Comment
source: Generates magnet links
de: Erzeugt Magnet-Verknüpfungen

# Comment
source: Phonon-based media player
de: Phonon-basierter Mediaplayer für KTorrent

# Name
source: Scan Folder
de: Ordner durchsuchen

# Comment
source: Scan folders for torrent files and load them
de: Ordner nach Torrent-Dateien durchsuchen und diese laden

# Name
source: Scripting
de: Skripte

# Comment
source: Enables Kross scripting support
de: Aktiviert die Unterstützung für Kross-Skripte

# Name
source: Automatic Remove
de: Automatisch entfernen

# Comment
source: Script to automatically remove torrents when they finish downloading or seeding
de: Skript zum automatischen Entfernen von Torrents, wenn sie vollständig hoch- oder heruntergeladen sind

# Name
source: Automatic Resume
de: Automatisch fortsetzen

# Comment
source: Script to automatically resume after some time, when the suspended state is enabled
de: Skript zum automatischen Fortsetzen von ausgesetzten Torrents nach Ablauf einer festgelegten Zeit

# Name
source: E-Mail Notifications
de: E-Mail-Benachrichtigungen

# Comment
source: Script to notify you of events via e-mail
de: Skript zur Benachrichtigung über Ereignisse per E-Mail

# Name
source: Tracker Grouping
de: Tracker-Gruppierung

# Comment
source: Script to create automatic groups based upon tracker URLs
de: Skript zum automatischen Gruppieren anhand der Tracker-Adressen

# Name
source: Search
de: Suche

# Comment
source: Search for torrents
de: Nach Torrents suchen

# Name
source: Shutdown
de: Herunterfahren

# Comment
source: Allows you to shutdown your computer when torrents finish
de: Ermöglicht es, den Rechner herunterzufahren, wenn die Torrents abgeschlossen wurden

# Name
source: Statistics
de: Statistik

# Comment
source: Shows statistics about torrents in several graphs
de: Zeigt Statistiken über Torrents in mehreren Diagrammen

# Name
source: Syndication
de: Syndizierung

# Comment
source: Syndication plugin for KTorrent, supporting RSS and Atom feeds
de: Syndizierungsmodul für KTorrent mit Unterstützung für RSS- und Atom-Nachrichtenquellen

# Comment
source: Forward ports using UPnP
de: Port-Weiterleitung unter Verwendung von UPnP

# Name
source: Web Interface
de: Web-Oberfläche

# Comment
source: Allows control of KTorrent via a web interface
de: Ermöglicht die Kontrolle von KTorrent über eine Web-Oberfläche

# Comment
source: Discover peers on the local network using the Zeroconf protocol
de: Gegenstellen im lokalen Netzwerk unter Verwendung des Zeroconf-Protokolls auffinden
