Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/extragear-network/desktop_extragear-network_ktp-accounts-kcm.po
Languages: de

# Comment
source: Custom account configuration user interface for accounts using the Butterfly connection manager.
de: Eigene Benutzeroberfläche zum Einrichten von Zugängen, die die Butterfly-Verbindungsverwaltung verwenden.

# Comment
source: Custom account configuration user interface for accounts using the Gabble connection manager.
de: Eigene Benutzeroberfläche zum Einrichten von Zugängen, die die Gabble-Verbindungsverwaltung verwenden.

# Name
source: Gabble Account Configuration User Interface
de: Benutzeroberfläche zur Einrichtung von Gabble-Zugängen

# Comment
source: Custom account configuration user interface for accounts using the Haze connection manager.
de: Eigene Benutzeroberfläche zum Einrichten von Zugängen, die die Haze-Verbindungsverwaltung verwenden.

# Name
source: Haze Account Configuration User Interface
de: Benutzeroberfläche zur Einrichtung von Haze-Zugängen

# Comment
source: Custom account configuration user interface for accounts using the Idle connection manager.
de: Eigene Benutzeroberfläche zum Einrichten von Zugängen, die die Idle-Verbindungsverwaltung verwenden.

# Comment
source: Custom account configuration user interface for accounts using the Morse connection manager.
de: Eigene Benutzeroberfläche zum Einrichten von Zugängen, die die Morse-Verbindungsverwaltung verwenden.

# Comment
source: Custom account configuration user interface for accounts using the Pintxo connection manager.
de: Eigene Benutzeroberfläche zum Einrichten von Zugängen, die die Pintxo-Verbindungsverwaltung verwenden.

# Name
source: Pintxo Account Configuration User Interface
de: Benutzeroberfläche zur Einrichtung von Pintxo-Zugängen

# Comment
source: Custom account configuration user interface for accounts using the Rakia/SofiaSIP connection manager.
de: Eigene Benutzeroberfläche zum Einrichten von Zugängen, die die Rakia/SofiaSIP-Verbindungsverwaltung verwenden.

# Name
source: Rakia/SofiaSIP Account Configuration User Interface
de: Benutzeroberfläche zur Einrichtung von Rakia/SofiaSIP-Zugängen

# Comment
source: Custom account configuration user interface for accounts using the Salut connection manager.
de: Eigene Benutzeroberfläche zum Einrichten von Zugängen, die die Salut-Verbindungsverwaltung verwenden.

# Name
source: Salut Account Configuration User Interface
de: Benutzeroberfläche zur Einrichtung von Salut-Zugängen

# Comment
source: Custom account configuration user interface for accounts using the sipe connection manager.
de: Eigene Benutzeroberfläche zum Einrichten von Zugängen, die die Sipe-Verbindungsverwaltung verwenden.

# Name
source: Sipe Account Configuration User Interface
de: Benutzeroberfläche zur Einrichtung von Sipe-Zugängen

# Comment
source: Custom account configuration user interface for Gadu-Gadu accounts using the Sunshine connection manager.
de: Eigene Benutzeroberfläche zum Einrichten von Gadu-Gadu-Zugängen, die die Sunshine-Verbindungsverwaltung verwenden.

# Name
source: Gadu-Gadu Account Configuration User Interface
de: Benutzeroberfläche zur Einrichtung von Gadu-Gadu-Zugängen

# Name
source: Accounts
de: Zugänge

# Comment
source: Add, edit and remove your instant messaging and VoIP accounts.
de: Hinzufügen, Bearbeiten und Entfernen Ihrer Instant-Messaging- und VoIP-Zugänge.

# Comment
source: Telepathy Accounts KCM Module Account User Interface Plugins
de: KCM-Modul für Telepathy-Zugänge

# Name
source: Instant Messaging and VoIP
de: Instant Messaging und VoIP
