Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/extragear-network/desktop_extragear-network_konversation.po
Languages: de

# Name
source: Big Bullets
de: Große Kugeln

# Comment
source: "Big Bullets" by Dario Abatianni
de: „Große Kugeln“ von Dario Abatianni

# Name
source: Christmas Theme
de: Weihnachtsdesign

# Comment
source: "Christmas Theme" by Kenichiro Takahashi
de: „Weihnachtsdesign“ von Kenichiro Takahashi

# Name
source: Classic Theme
de: Klassisches Design

# Comment
source: "LED" by Dario Abatianni
de: „LED“ von Dario Abatianni

# Name
source: Default Theme
de: Standard-Design

# Comment
source: "Oxygen" by Nuno Pinheiro
de: „Oxygen“ von Nuno Pinheiro

# Name
source: KDE 3 Default Theme
de: Standard-Design aus KDE 3

# Comment
source: "Simplistic" by Shintaro Matsuoka
de: „Standard“ von Shintaro Matsuoka

# Name
source: Smiling Theme
de: Smiley-Design

# Comment
source: "Smiling" stolen from Kopete by John Tapsell
de: „Smiley“ geklaut bei Kopete von John Tapsell

# Name
source: Square Theme
de: Rechteck-Design

# Comment
source: "SQUARE" by Kenichiro Takahashi
de: „Rechteck“ von Kenichiro Takahashi

# GenericName
source: IRC Client
de: IRC-Programm

# Name
source: New message
de: Neue Nachricht

# Comment
source: New message arrived in a channel
de: Neue Nachricht in einem Kanal

# Name
source: Nick written
de: Spitzname erwähnt

# Comment
source: Someone wrote your nick in a message
de: Jemand hat Ihren Spitznamen in einer Nachricht erwähnt

# Name
source: Highlight triggered
de: Hervorhebung ausgelöst

# Comment
source: Someone triggered a highlight
de: Jemand hat eine Hervorhebung ausgelöst

# Name
source: Private message
de: Private Nachricht

# Comment
source: You received a private message
de: Sie haben eine private Nachricht erhalten

# Name
source: Nick changed
de: Spitzname geändert

# Comment
source: Someone changed their nick
de: Jemand hat seinen Spitznamen geändert

# Name
source: Incoming file
de: Datei angeboten

# Comment
source: Someone wants to transmit a file to you over DCC
de: Jemand bietet Ihnen eine Datei zum DCC-Download an

# Name
source: DCC transfer error
de: DCC-Übertragungsfehler

# Comment
source: An error occurred in a DCC transfer
de: Bei der DCC-Übertragung ist ein Fehler aufgetreten

# Name
source: DCC transfer complete
de: DCC-Übertragung abgeschlossen

# Comment
source: A DCC transfer successfully completed
de: Eine DCC-Übertragung wurde erfolgreich abgeschlossen

# Name
source: Nick joined channel
de: Benutzer betritt Kanal

# Comment
source: New nick joined a channel
de: Jemand betritt einen Kanal

# Name
source: Nick left channel
de: Benutzer verlässt Kanal

# Comment
source: A nick left a channel
de: Jemand verlässt einen Kanal

# Name
source: Mode change
de: Moduswechsel

# Comment
source: A user or channel mode was changed
de: Ein Benutzer- oder Kanal-Modus wurde geändert

# Name
source: Nick online
de: Spitzname ist online

# Comment
source: A user on your watched nicks list has come online
de: Ein Benutzer aus Ihrer „Beobachten“-Liste ist online

# Name
source: Query
de: Gespräch (Query)

# Comment
source: Someone started a conversation (query) with you
de: Jemand hat ein Gespräch (Query) mit Ihnen begonnen

# Comment
source: Someone kicked you out of a channel
de: Jemand hat Sie aus einem Kanal geworfen

# Name
source: Connection failure
de: Verbindungsfehler

# Comment
source: Failed to connect to server
de: Fehler beim Verbinden zum Server

# Name
source: You joined a channel
de: Sie haben einen Kanal betreten

# Comment
source: You joined a channel
de: Sie haben einen Kanal betreten

# Comment
source: Someone started a DCC chat with you
de: Jemand hat einen DCC-Chat mit Ihnen begonnen
