Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/extragear-network/smb4k.po
Languages: de

source: The search returned no results.
de: Die Suche hat keine Übereinstimmungen ergeben.

source: Item
de: Eintrag

source: File System
de: Dateisystem

source: Owner
de: Eigentümer

source: Free
de: Frei

source: Used
de: Belegt

source: Total
de: Gesamt

source: Usage
de: Verwendung

source: U&nmount All
de: Alle Ei&nbindungen lösen

source: S&ynchronize
de: A&bgleichen

source: Open With
de: Öffnen mit

source: Open with Konso&le
de: Mit Konso&le öffnen

source: Open with F&ile Manager
de: Mit Date&iverwaltung öffnen

source: The shares view KPart of Smb4K
de: Der Freigabenansicht-KPart von Smb4K

source: Mounting share %1...
de: Freigabe %1 wird eingebunden ...

source: Unmounting share %1...
de: Einbindung von Freigabe %1 wird gelöst ...

source: &Shares
de: F&reigaben

source: &File
de: &Datei

source: Sh&ares
de: Freig&aben

source: &Bookmarks
de: &Lesezeichen

source: &Settings
de: &Einstellungen

source: Network Toolbar
de: Netzwerk-Werkzeugleiste

source: Search Toolbar
de: Such-Werkzeugleiste

source: Shares Toolbar
de: Freigaben-Werkzeugleiste

source: Alternative Main Toolbar
de: Alternative Haupt-Werkzeugleiste

source: Main Toolbar
de: Haupt-Werkzeugleiste

source: &Edit Bookmarks
de: L&esezeichen bearbeiten

source: Mount All Bookmarks
de: Alle Lesezeichen einbinden

source: Dock Widgets
de: Andockfenster

source: Shares View
de: Freigabenansicht

source: Icon View
de: Symbolansicht

source: List View
de: Listenansicht

source: The network browser could not be created.
de: Der Netzwerkbrowser kann nicht erstellt werden.

source: Network Search
de: Netzwerksuche

source: The search dialog could not be created.
de: Der Suchdialog kann nicht erstellt werden.

source: The shares view could not be created.
de: Die Freigabenansicht kann nicht erstellt werden.

source: <p>Closing the main window will keep Smb4K running in the system tray. Use 'Quit' from the 'File' menu to quit the application.</p>
de: <p>Wenn Sie das Hauptfenster schließen, wird Smb4K im Systemabschnitt der Kontrollleiste weiterlaufen. Benutzen Sie „Beenden“ im Menü „Datei“, um die Anwendung vollständig zu beenden.</p>

source: Docking
de: Andocken

source: There are currently no shares mounted.
de: Zurzeit sind keine Freigaben eingebunden.

source: There is currently %1 share mounted.
de: Zurzeit ist %1 Freigabe eingebunden.

source: The wallet is in use.
de: Der Passwortspeicher wird benutzt.

source: The wallet is not in use.
de: Der Passwortspeicher wird nicht benutzt.

source: The password dialog mode is used and logins are remembered.
de: Der Passwortdialog-Modus wird benutzt und die Anmeldungen werden gespeichert.

source: The password dialog mode is used and logins are not remembered.
de: Der Passwortdialog-Modus wird benutzt und die Anmeldungen werden nicht gespeichert.

source: Waking up remote hosts...
de: Entfernte Rechner aufwecken ...

source: Waking up host %1...
de: Rechner %1 wird aufgeweckt ...

source: %1 has been mounted successfully.
de: %1 ist erfolgreich eingebunden worden.

source: %1 has been unmounted successfully.
de: Die Einbindung von %1 ist erfolgreich gelöst worden.

source: Mounting %1 failed.
de: Das Einbinden von %1 ist fehlgeschlagen.

source: Unmounting %1 failed.
de: Das Lösen der Einbindung von %1 ist fehlgeschlagen.

source: Sending file to printer %1...
de: Datei wird zum Drucker %1 gesendet ...

source: Synchronizing %1
de: %1 wird abgeglichen ...

source: Retrieving preview from %1...
de: Vorschau für %1 wird erzeugt ...

source: Unmount
de: Einbindung lösen

source: Add Bookmark
de: Lesezeichen hinzufügen

source: Open with Konsole
de: Mit Konsole öffnen

source: Open with File Manager
de: Mit Dateiverwaltung öffnen

source: Advanced Network Neighborhood Browser
de: Erweiterter Browser für die Netzwerkumgebung

source: yes
de: ja

source: no
de: nein

source: %1 free of %2 (%3 used)
de: %1 von %2 frei (%3 belegt)

source: Host
de: Rechner

source: Operating system
de: Betriebssystem

source: Share (%1)
de: Freigabe (%1)

source: Mounted
de: Eingebunden

source: Mountpoint
de: Mount-Punkt

source: File system
de: Dateisystem

source: Size
de: Größe
