Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/extragear-network/smb4k.po
Languages: de

source: %1 is not a version 1.0 file.
de: Die Datei %1 hat nicht die Version 1.0.

source: Specify User
de: Benutzer angeben

source: Clear List
de: Liste löschen

source: Please specify a username.
de: Bitte geben Sie einen Benutzernamen an.

source: User:
de: Benutzer:

source: <qt><p>The share <b>%1</b> is mounted to <br><b>%2</b> and owned by user <b>%3</b>.</p><p>Do you really want to unmount it?</p></qt>
de: <qt><p>Die Freigabe <b>%1</b> ist unter <br><b>%2</b> eingebunden und gehört dem Benutzer <b>%3</b>.</p>Möchten Sie die Einbindung wirklich lösen?</p></qt>

source: Foreign Share
de: Fremde Freigabe

source: Remounting shares. Please wait.
de: Freigaben werden erneut eingebunden. Bitte warten.

source: Unmounting shares. Please wait.
de: Einbindung von Freigaben wird gelöst. Bitte warten.

source: Mount Share
de: Freigabe einbinden

source: Enter the location (UNC address) and optionally the IP address and workgroup to mount a share.
de: Geben Sie den Ort (UNC-Adresse) sowie wahlweise die IP-Addresse und Arbeitsgruppe ein, um eine Freigabe einzubinden.

source: The Uniform Naming Convention (UNC) address describes the location of the share. It has the following syntax: //[USER@]HOST/SHARE. The username is optional.
de: Die „Uniform Naming Convention“-Adresse (UNC-Adresse) beschreibt den Ort der Freigabe. Es hat die folgende Syntax: //[NUTZER@]RECHNER/FREIGABE. Der Benutzername ist optional.

source: The Internet Protocol (IP) address identifies the host in the network and indicates where it is. It has two valid formats, the one known as IP version 4 (e.g. 192.168.2.11) and the version 6 format (e.g. 2001:0db8:85a3:08d3:1319:8a2e:0370:7334).
de: Die „Internet Protocol“-Adresse (IP-Adresse) identifiziert einen Rechner im Netzwerk und gibt Aufschluss darüber, wo er sich befindet. Sie hat zwei gültige Formate: IP-Version 4 (z. B. 192.168.2.11) und IP-Version 6 (z. B. 2001:0db8:85a3:08d3:1319:8a2e:0370:7334).

source: Workgroup:
de: Arbeitsgruppe:

source: The workgroup or domain identifies the peer-to-peer computer network the host is located in.
de: Die Arbeitsgruppe oder Domäne identifiziert das Peer-to-Peer-Netzwerk, in dem sich der Rechner befindet.

source: Add this share to the bookmarks
de: Diese Freigabe zu den Lesezeichen hinzufügen

source: If you tick this checkbox, the share will be bookmarked and you can access it e.g. through the "Bookmarks" menu entry in the main window.
de: Wenn Sie dieses Ankreuzfeld auswählen, wird die Freigabe zu den Lesezeichen hinzugefügt und Sie können auf den Eintrag dann z. B. über den Menüeintrag „Freigaben“ im Hauptfenster zugreifen.

source: <p>The share <b>%1</b> has been mounted to <b>%2</b>.</p>
de: <p>Die Freigabe <b>%1</b> ist unter <b>%2</b> eingebunden worden.</p>

source: Open
de: Offen

source: <p>The share <b>%1</b> has been unmounted from <b>%2</b>.</p>
de: <p>Die Einbindung der Freigabe <b>%1</b> ist von <b>%2</b> gelöst worden.</p>

source: <p>%1 share out of %2 has been mounted.</p>
de: <p>%1 von %2 Freigaben ist eingebunden worden.</p>

source: <p>All shares have been mounted.</p>
de: <p>Alle Freigaben sind eingebunden worden.</p>

source: <p>%1 share out of %2 has been unmounted.</p>
de: <p>Die Einbindung von %1 von %2 Freigaben ist gelöst worden.</p>

source: <p>All shares have been unmounted.</p>
de: <p>Die Einbindungen aller Freigaben sind gelöst worden.</p>

source: <p>Opening the wallet <b>%1</b> failed.</p>
de: <p>Das Öffnen des Passwortspeichers <b>%1</b> ist fehlgeschlagen.</p>

source: <p>The logins stored in the wallet could not be accessed. There is either no wallet available or it could not be opened.</p>
de: <p>Auf die in dem Passwortspeicher gespeicherten Anmeldungen kann nicht zugegriffen werden. Es ist entweder kein Passwortspeicher vorhanden, oder er kann nicht geöffnet werden.</p>

source: <p>The mimetype <b>%1</b> is not supported for printing. Please convert the file to PDF or Postscript and try again.</p>
de: <p>Der Mimetype <b>%1</b> wird beim Drucken nicht unterstützt. Bitte konvertieren Sie die Datei in PDF oder PostScript und versuchen Sie es erneut.</p>

source: <p>The bookmark for share <b>%1</b> already exists and will be skipped.
de: <p>Das Lesezeichen für die Freigabe <b>%1</b> existiert bereits und wird übergangen.</p>

source: <p>The label <b>%1</b> of the bookmark for the share <b>%2</b> is already being used and will automatically be renamed.</p>
de: <p>Die Beschreibung <b>%1</b> des Lesezeichens für die Freigabe <b>%2</b> wird bereits benutzt und wird automatisch umbenannt.</p>

source: The entry of the custom master browser is empty. Smb4K is going to try to query the current master browser of your workgroup or domain instead.
de: Der Eintrag des benutzerdefinierten Masterbrowsers ist leer. Smb4K wird versuchen, den derzeit aktiven Masterbrowser Ihrer Arbeitsgruppe oder Domäne abzufragen.

source: <p>Retrieving the list of available domains failed:</p><p><tt>%1</tt></p>
de: <p>Das Abfragen der Liste verfügbarer Domänen ist fehlgeschlagen:</p><p><tt>%1</tt></p>

source: <p>Retrieving the list of available domains failed.</p>
de: <p>Das Abfragen der Liste verfügbarer Domänen ist fehlgeschlagen.</p>

source: <p>Scanning the defined broadcast area(s) failed:</p><p><tt>%1</tt></p>
de: <p>Das Durchsuchen der definierten Broadcast-Bereiche ist fehlgeschlagen:</p><p><tt>%1</tt></p>

source: <p>Scanning the defined broadcast area(s) failed.</p>
de: <p>Das Durchsuchen der definierten Broadcast-Bereiche ist fehlgeschlagen.</p>

source: <p>Retrieving the list of servers belonging to domain <b>%1</b> failed.</p><p><tt>%2</tt></p>
de: <p>Das Abfragen der Liste von Servern, die zur Domäne <b>%1</b> gehören, ist fehlgeschlagen:</p><p><tt>%2</tt></p>

source: <p>Retrieving the list of servers belonging to domain <b>%1</b> failed.</p>
de: <p>Das Abfragen der Liste von Servern, die zur Domäne <b>%1</b> gehören, ist fehlgeschlagen.</p>

source: <p>Retrieving the list of shares from <b>%1</b> failed:</p><p><tt>%2</tt></p>
de: <p>Das Abfragen der Freigabenliste von <b>%1</b> ist fehlgeschlagen:</p><p><tt>%2</tt></p>

source: <p>Retrieving the list of shares from <b>%1</b> failed.</p>
de: <p>Das Abfragen der Freigabenliste von <b>%1</b> ist fehlgeschlagen.</p>

source: <p>Retrieving the preview of <b>%1</b> failed:</p><p><tt>%2</tt></p>
de: <p>Das Abfragen der Vorschau für <b>%1</b> ist fehlgeschlagen:</p><p><tt>%2</tt></p>

source: <p>Retrieving the preview of <b>%1</b> failed.</p>
de: <p>Das Abfragen der Vorschau für <b>%1</b> ist fehlgeschlagen.</p>

source: <p>Mounting the share <b>%1</b> failed:</p><p><tt>%2</tt></p>
de: <p>Das Einbinden der Freigabe <b>%1</b> ist fehlgeschlagen:</p><p><tt>%2</tt></p>

source: <p>Mounting the share <b>%1</b> failed.</p>
de: <p>Das Einbinden der Freigabe <b>%1</b> ist fehlgeschlagen.</p>

source: <p>Unmounting the share <b>%1</b> from <b>%2</b> failed:</p><p><tt>%3</tt></p>
de: <p>Das Lösen der Einbindung der Freigabe <b>%1</b> von <b>%2</b> ist fehlgeschlagen:</p><p><tt>%3</tt></p>

source: <p>Unmounting the share <b>%1</b> from <b>%2</b> failed.</p>
de: <p>Das Lösen der Einbindung der Freigabe <b>%1</b> von <b>%2</b> ist fehlgeschlagen.</p>

source: <p>You are not allowed to unmount the share <b>%1</b> from <b>%2</b>. It is owned by the user <b>%3</b>.</p>
de: <p>Sie dürfen die Einbindung der Freigabe <b>%1</b> nicht von <b>%2</b> lösen. Sie gehört dem Benutzer <b>%3</b>.</p>

source: <p>Printing on printer <b>%1</b> failed:</p><p><tt>%2</tt></p>
de: <p>Das Drucken auf dem Drucker <b>%1</b> ist fehlgeschlagen:</p><p><tt>%2</tt></p>

source: <p>Printing on printer <b>%1</b> failed.</p>
de: <p>Das Drucken auf dem Drucker <b>%1</b> ist fehlgeschlagen.</p>

source: <p>Synchronizing <b>%1</b> with <b>%2</b> failed:</p><p><tt>%3</tt></p>
de: <p>Das Abgleichen von <b>%1</b> mit <b>%2</b> ist fehlgeschlagen:</p><p><tt>%3</tt></p>

source: <p>Synchronizing <b>%1</b> with <b>%2</b> failed.</p>
de: <p>Das Abgleichen von <b>%1</b> mit <b>%2</b> ist fehlgeschlagen.</p>

source: <p>Searching the network neighborhood for the search item <b>%1</b> failed:</p><p><tt>%2</tt></p>
de: <p>Das Durchsuchen der Netzwerkumgebung nach dem Suchbegriff <b>%1</b> ist fehlgeschlagen:</p><p><tt>%2</tt></p>

source: <p>Searching the network neighborhood for the search item <b>%1</b> failed.</p>
de: <p>Das Durchsuchen der Netzwerkumgebung nach dem Suchbegriff <b>%1</b> ist fehlgeschlagen.</p>

source: <p>The command <b>%1</b> could not be found. Please check your installation.</p>
de: <p>Der Befehl<b>%1</b> wurde nicht gefunden. Bitte überprüfen Sie Ihre Installation.</p>

source: <p>The share <b>%1</b> is a printer and cannot be bookmarked.</p>
de: <p>Die Freigabe <b>%1</b> ist ein Drucker und kann nicht mit einem Lesezeichen versehen werden.</p>

source: <p>The file <b>%1</b> could not be found.</p>
de: <p>Die Datei <b>%1</b> kann nicht gefunden werden.</p>

source: <p>Opening the file <b>%1</b> failed:</p><p><tt>%2</tt></p>
de: <p>Das Öffnen der Datei <b>%1</b> ist fehlgeschlagen:</p><p><tt>%2</tt></p>

source: <p>Opening the file <b>%1</b> failed.</p>
de: <p>Das Öffnen der Datei <b>%1</b> ist fehlgeschlagen.</p>

source: <p>Reading from file <b>%1</b> failed:</p><p><tt>%2</tt></p>
de: <p>Das Lesen der Datei <b>%1</b> ist fehlgeschlagen:</p><p><tt>%2</tt></p>

source: <p>Reading from file <b>%1</b> failed.</p>
de: <p>Das Lesen der Datei <b>%1</b> ist fehlgeschlagen.</p>

source: <p>The following directory could not be created:</p><p><tt>%1</tt></p>
de: <p>Der folgende Ordner kann nicht erzeugt werden:</p><p><tt>%1</tt></p>

source: <p>The process failed to start (error code: <tt>%1</tt>).</p>
de: <p>Der Prozess kann nicht gestartet werden (Fehlercode: <tt>%1</tt>).</p>

source: <p>The process crashed (error code: <tt>%1</tt>).</p>
de: <p>Der Prozess ist abgestürzt (Fehlercode: <tt>%1</tt>).</p>

source: <p>The process timed out (error code: <tt>%1</tt>).</p>
de: <p>Der Prozess hat eine Zeitüberschreitung ausgelöst (Fehlercode: <tt>%1</tt>).</p>

source: <p>Could not write to the process (error code: <tt>%1</tt>).</p>
de: <p>Daten können nicht zum Prozess gesendet werden (Fehlercode: <tt>%1</tt>).</p>

source: <p>Could not read from the process (error code: <tt>%1</tt>).</p>
de: <p>Prozessdaten können nicht empfangen werden (Fehlercode: <tt>%1</tt>).</p>

source: <p>The process reported an unknown error.</p>
de: <p>Der Prozess hat einen unbekannten Fehler zurückgegeben.</p>

source: <p>The system call <b>%1</b> failed:</p><p><tt>%2</tt></p>
de: <p>Der Systemaufruf <b>%1</b> ist fehlgeschlagen:</p><p><tt>%2</tt></p>

source: <p>Executing an action with root privileges failed (error code:<tt>%1</tt>).</p>
de: <p>Das Ausführen einer Aktion mit Administratorrechten ist fehlgeschlagen (Fehlercode: <tt>%1</tt>).</p>

source: <p>Executing an action with root privileges failed.</p>
de: <p>Das Ausführen einer Aktion mit Administratorrechten ist fehlgeschlagen.</p>

source: <p>The URL that was passed is invalid.</p>
de: <p>Die übergebene URL ist ungültig.</p>

source: <p>There are no broadcast areas defined.</p>
de: <p>Es sind keine Broadcast-Bereiche definiert.</p>

source: Preview
de: Vorschau

source: The preview is displayed here.
de: Die Vorschau wird hier angezeigt.

source: Reload
de: Erneut laden

source: Abort
de: Abbrechen

source: Back
de: Zurück

source: Forward
de: Vorwärts

source: Up
de: Hoch

source: The current UNC address is shown here. You can also choose one of the previously visited locations from the drop-down menu that will then be displayed in the view above.
de: Die derzeitige UNC-Adresse wird hier angezeigt. Sie können außerdem eine der bereits besuchten Ordner aus dem Aufklappmenü auswählen und in der obigen Ansicht darstellen lassen.

source: Print File
de: Datei drucken

source: Options
de: Optionen

source: Printer
de: Drucker

source: unknown
de: unbekannt

source: File
de: Datei

source: File:
de: Datei:

source: This is the file you want to print on the remote printer. Currently only a few mimetypes are supported such as PDF, Postscript, plain text, and images. If the file's mimetype is not supported, you need to convert it.
de: Dies ist die Datei, die Sie auf dem entfernten Drucker drucken möchten. Zurzeit werden nur ein paar Mimetypen unterstützt, wie beispielsweise PDF, PostScript, normaler Text und Bilder. Falls der Mimetype der Datei nicht unterstützt wird, müssen Sie sie konvertieren.

source: Copies:
de: Kopien:

source: This is the number of copies you want to print.
de: Dies ist die Anzahl von Kopien, die Sie drucken möchten.

source: Disk
de: Laufwerk

source: Synchronizing
de: Abgleichen

source: Source
de: Quellordner

source: Destination
de: Zielordner

source: Synchronization
de: Abgleich

source: Synchronize
de: Abgleichen

source: Synchronize the destination with the source
de: Den Zielordner mit dem Quellordner abgleichen

source: Swap Paths
de: Pfade vertauschen

source: Swap source and destination
de: Quell- und Zielordner vertauschen

source: Please provide the source and destination directory for the synchronization.
de: Bitte geben Sie den Quell- und Zielordner für den Abgleich an.

source: Source:
de: Quellordner:

source: This is the source directory. The data that it contains is to be written to the destination directory.
de: Dies ist der Quellordner. Die in ihm enthaltenen Daten werden in den Zielordner geschrieben.

source: Destination:
de: Zielordner:

source: This is the destination directory. It will be updated with the data from the source directory.
de: Dies ist der Zielordner. Er wird mit Daten aus dem Quellordner aktualisiert.

source: <qt>Please enter a username and a password for the host <b>%1</b>.</qt>
de: <qt>Bitte geben Sie einen Benutzernamen und ein Passwort für den Rechner <b>%1</b> ein.</qt>

source: <qt>Please enter a username and a password for the share <b>%1</b>.</qt>
de: <qt>Bitte geben Sie einen Benutzernamen und ein Passwort für die Freigabe <b>%1</b> ein.</qt>

source: The mount process crashed.
de: Der Prozess zum Einbinden der Freigabe ist abgestürzt.

source: The mount process could not be started.
de: Der Prozess zum Einbinden der Freigabe kann nicht gestartet werden.

source: The mountpoint is invalid.
de: Der Mount-Punkt ist ungültig.

source: The unmount process crashed.
de: Der Prozess zum Lösen der Einbindung ist abgestürzt.

source: The unmount process could not be started.
de: Der Prozess zum Lösen der Einbindung kann nicht gestartet werden.

source: Edit
de: Bearbeiten

source: Rescan
de: Erneut einlesen

source: Mount Dialog
de: Dialog zum Einbinden

source: Network Neighborhood
de: Netzwerkumgebung

source: Mounted Shares
de: Eingebundene Freigaben

source: Bookmarks
de: Lesezeichen

source: <font size="-1">on %1</font>
de: <font size="-1">auf %1</font>

source: Unmount All
de: Alle Einbindungen lösen

source: Network
de: Netzwerk

source: Type
de: Typ

source: IP Address
de: IP-Adresse

source: Comment
de: Kommentar

source: Scan Netwo&rk
de: Netzwe&rk durchsuchen

source: &Abort
de: &Abbrechen

source: &Open Mount Dialog
de: Dial&og zum Einbinden öffnen

source: Au&thentication
de: Au&thentifizierung

source: &Custom Options
de: B&enutzerdefinierte Einstellungen

source: Add &Bookmark
de: &Lesezeichen hinzufügen

source: Pre&view
de: &Vorschau

source: &Print File
de: Datei &drucken

source: &Mount
de: Ein&binden

source: &Unmount
de: Einbind&ung lösen

source: The network browser KPart of Smb4K
de: Der Netzwerkbrowser-KPart von Smb4K

source: \u00A9 2007-2014, Alexander Reinholdt
de: © 2007–2014, Alexander Reinholdt

source: Scan Compute&r
de: &Rechner durchsuchen

source: Scan Wo&rkgroup
de: A&rbeitsgruppe durchsuchen

source: Looking for workgroups and domains...
de: Es wird nach Arbeitsgruppen und Domänen gesucht ...

source: Looking for hosts in domain %1...
de: Es wird nach nach Rechnern in der Domäne %1 gesucht ...

source: Looking for shares provided by host %1...
de: Es wird nach Freigaben auf dem Rechner %1 gesucht ...

source: Looking for more information about host %1...
de: Es wird nach mehr Informationen über den Rechner %1 gesucht ...

source: Waking up remote servers...
de: Entfernte Rechner werden aufgeweckt...

source: Done.
de: Fertig.

source: &Network
de: &Netzwerk

source: Password Storage
de: Passwortspeicherung

source: Default Login
de: Standardanmeldung

source: General Settings
de: Allgemeine Einstellungen

source: Load
de: Laden

source: Load the entries stored in the wallet.
de: Im Passwortspeicher abgelegte Einträge laden.

source: The login information that was stored by Smb4K will be loaded from the wallet. If you chose to not use the wallet, pressing this button will have no effect.
de: Die Anmeldeinformationen, die durch Smb4K abgelegt wurden, werden aus dem Passwortspeicher geladen. Falls Sie den Passwortspeicher nicht nutzen, wird das Drücken dieses Knopfs keinen Effekt haben.

source: Save
de: Speichern

source: Save the entries to the wallet.
de: Einträge im Passwortspeicher speichern.

source: All modifications you applied are saved to the wallet.
de: Alle angewendeten Änderungen werden im Passwortspeicher gespeichert.

source: Show details
de: Details anzeigen

source: Show the details of the selected entry.
de: Einzelheiten des ausgewählten Eintrags anzeigen.

source: Marking this check box will show the details of the selected login information below.
de: Das Markieren dieses Ankreuzfeldes zeigt unten die Einzelheiten zu der ausgewählten Anmeldeinformation.

source: Undo
de: Zurücksetzen

source: Wallet Entries
de: Einträge des Passwortspeichers

source: Entry
de: Eintrag

source: Workgroup
de: Arbeitsgruppe

source: Login
de: Anmeldename

source: Password
de: Passwort

source: User Interface
de: Benutzeroberfläche

source: Shares
de: Freigaben

source: Authentication
de: Authentifizierung

source: Laptop Support
de: Laptop-Unterstützung

source: The custom master browser that is to be queried has not been filled in. Please enter it now.
de: Der abzufragende benutzerdefinierte Masterbrowser ist nicht eingetragen worden. Bitte tun Sie dies jetzt.

source: The broadcast areas that are to be scanned have not been filled in. Please enter them now.
de: Die Broadcast-Bereiche, die durchsucht werden sollen, sind nicht eingetragen worden. Bitte tun Sie dies jetzt.

source: The mount prefix has not been filled in. Please enter it now.
de: Der Basisordner für das Einbinden ist nicht eingetragen worden. Bitte tun Sie dies jetzt.

source: The file mask has not been filled in. Please enter it now.
de: Die Dateimaske ist nicht eingetragen worden. Bitte tun Sie dies jetzt.

source: The directory mask has not been filled in. Please enter it now.
de: Die Ordnermaske ist nicht eingetragen worden. Bitte tun Sie dies jetzt.

source: The synchronization prefix has not been filled in. Please enter it now.
de: Der Basisordner für den Abgleich ist nicht eingetragen worden. Bitte tun Sie dies jetzt.

source: The directory where partially transferred files should be stored has not been filled in. Please enter it now.
de: Der Ordner, in dem teilweise übertragene Dateien abgelegt werden sollen, ist nicht eingetragen worden. Bitte tun Sie dies jetzt.

source: The exclude pattern for synchronization has not been filled in. Please enter it now.
de: Das Ausschlussmuster für den Abgleich ist nicht eingetragen worden. Bitte tun Sie dies jetzt.

source: The file from which the exclude pattern for synchronization are to be read has not been filled in. Please enter it now.
de: Die Datei, aus der das Ausschlussmuster für den Abgleich gelesen werden soll, ist nicht eingetragen worden. Bitte tun Sie dies jetzt.

source: The include pattern for synchronization has not been filled in. Please enter it now.
de: Das Einschlussmuster für den Abgleich ist nicht eingetragen worden. Bitte tun Sie die jetzt.

source: The file from which the include pattern for synchronization are to be read has not been filled in. Please enter it now.
de: Die Datei, aus der das Einschlussmuster für den Abgleich gelesen werden soll, ist nicht eingetragen worden. Bitte tun Sie dies jetzt.

source: The backup suffix for synchronization has not been filled in. Please enter it now.
de: Das Suffix für den Abgleich ist nicht eingetragen worden. Bitte tun Sie dies jetzt.

source: The backup directory for synchronization has not been filled in. Please enter it now.
de: Der Ordner für Sicherungskopien während des Abgleichs ist nicht eingetragen worden. Bitte tun Sie dies jetzt.

source: Enter the default login information.
de: Tragen Sie die Standardanmeldung ein.

source: Remount this share
de: Diese Freigabe erneut einbinden

source: MAC address:
de: MAC-Adresse:

source: <qt>Smb4K only detects changes in state of your hardware. If you are performing a software suspend or the like, you should unmount the shares manually.</qt>
de: <qt>Smb4K registriert nur Statusänderungen Ihrer Hardware. Falls Sie einen Software-Suspend oder ähnliches durchführen, sollten Sie die Einbindungen der Freigaben von Hand lösen.</qt>

source: Browse List
de: Browseliste

source: Periodic Scanning
de: Periodisches Durchsuchen

source: <qt>Define the hosts that should be woken up via the custom options dialog.</qt>
de: <qt>Legen Sie die Rechner, die aufgeweckt werden sollen, im Dialog für benutzerdefinierte Einstellungen fest.</qt>

source: Default Destination
de: Standardzielordner

source: Links
de: Verknüpfungen

source: File Permissions, etc.
de: Zugriffsrechte usw.

source: Copying
de: Kopieren

source: File Deletion
de: Löschen von Dateien

source: Restrictions
de: Beschränkungen

source: File Transfer
de: Dateiübertragung

source: File Deletion && Transfer
de: Löschen && Übertragen von Dateien

source: Filter Rules
de: Filterregeln

source: Special filter rules:
de: Spezielle Filterregeln:

source: Filtering
de: Filterung

source: Backup
de: Sicherungskopien

source: Checksums
de: Prüfsummen

source: Advanced Settings
de: Erweiterte Einstellungen

source: General Options
de: Allgemeine Einstellungen

source: Remote Ports
de: Entfernte Ports

source: Security
de: Sicherheit

source: Common Options
de: Übliche Einstellungen

source: Choose a different user
de: Einen anderen Benutzer auswählen

source: Choose a different group
de: Eine andere Gruppe auswählen

source: Advanced Options
de: Erweiterte Einstellungen

source: Mounting
de: Einbinden

source: Utility Programs
de: Dienstprogramme

source: <qt>Due to security concerns, the cruid option cannot be defined here and will now be removed.</qt>
de: <qt>Aus Sicherheitsgründen kann die Option „cruid“ hier nicht definiert werden und wird jetzt entfernt.</qt>

source: Directories
de: Ordner

source: Mounting && Unmounting
de: Einbinden && Einbindungen lösen

source: Checks
de: Überprüfungen

source: Notifications
de: Benachrichtigungen

source: Behavior
de: Verhalten

source: Remote Shares
de: Entfernte Freigaben

source: Columns
de: Spalten

source: Tooltips
de: Kurzinfos

source: View
de: Ansicht

source: Settings for the list view:
de: Einstellungen für die Listenansicht:

source: Hidden Files && Directories
de: Versteckte Dateien && Ordner

source: Preview Dialog
de: Vorschaudialog

source: The advanced network neighborhood browser for KDE.
de: Der erweiterte Browser für die Netzwerkumgebung unter KDE.

source: \u00A9 2003-2014 Alexander Reinholdt
de: © 2003–2014, Alexander Reinholdt

source: Developer
de: Entwickler

source: Search item:
de: Suchbegriff:

source: Enter the search string here.
de: Geben Sie hier den Suchbegriff ein.

source: &Search
de: &Suchen

source: &Clear
de: &Leeren

source: Search Results
de: Suchergebnisse

source: The network search KPart of Smb4K
de: Der Netzwerksuche-KPart von Smb4K

source: Searching for "%1"...
de: Es wird nach „%1“ gesucht ...

source: Search
de: Suchen
