Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/extragear-network/smb4k.po
Languages: de

source: This is the character set that is used by the client side (i.e. your side) either to convert local path names to and from Unicode (CIFS, Linux) or for codepage to charset translations (SMBFS, FreeBSD). If you keep the default setting, Smb4K will try to automatically determine the charset by looking up the "unix charset" option in the smb.conf.
de: Dies ist der Zeichensatz, der von der Klientenseite (also Ihrer Seite) benutzt wird, um entweder die lokalen Pfadnamen in oder aus Unicode umzuwandeln (CIFS, Linux) oder die Codepage des Servers in den lokalen Zeichensatz zu übersetzen (SMBFS, FreeBSD). Behalten Sie die Voreinstellung bei, dann versucht Smb4K, den Zeichensatz automatisch durch Auswertung der Einstellung „unix charset“ in der Datei smb.conf festzustellen.

source: default
de: Standard

source: This is the codepage that is used by the server. The setting is only available with the SMBFS file system. If you keep the default setting, Smb4K will try to automatically determine the codepage by looking up the "dos charset" option in the smb.conf file.
de: Dies ist die Codepage, die vom Server benutzt wird. Die Einstellung ist nur bei Verwendung des SMBFS-Dateisystems verfügbar. Wenn Sie die Standardeinstellung beibehalten, dann versucht Smb4K, die Codepage automatisch durch die Auswertung der Einstellung „dos charset“ in der Datei smb.conf festzustellen.

source: User ID:
de: Benutzerkennung:

source: This is the user ID (a number) that the files and directories of the mounted share will have. If you are using the CIFS file system and the remote server supports the CIFS Unix Extensions, this setting will be ignored.
de: Dies ist die Benutzerkennung (eine Zahl), die die Dateien und Ordner der eingebundenen Freigabe haben werden. Falls Sie das CIFS-Dateisystem benutzen und der entfernte Server die „CIFS Unix Extensions“ unterstützt, dann wird diese Einstellung ignoriert.

source: Group ID:
de: Gruppenkennung:

source: This is the group ID (a number) that the files and directories of the mounted share will have. If you are using the CIFS file system and the remote server supports the CIFS Unix Extensions, this setting will be ignored.
de: Dies ist die Gruppenkennung (eine Zahl), die die Dateien und Ordner der eingebundenen Freigabe haben werden. Falls Sie das CIFS-Dateisystem benutzen und der entfernte Server die „CIFS Unix Extensions“ unterstützt, dann wird diese Einstellung ignoriert.

source: File mask:
de: Dateimaske:

source: This is the mask that will be used for creating files. It must be defined in octal. In case the CIFS file system is used, this setting only takes effect if the server does not support the CIFS Unix Extensions.
de: Dies ist die Maske, die bei der Erzeugung von Dateien verwendet wird. Sie muss als oktale Zahl angegeben werden. Im Fall, dass das CIFS-Dateisystem benutzt wird, hat diese Einstellung nur Auswirkungen, wenn der Server die „CIFS Unix Extensions“ nicht unterstützt.

source: Directory mask:
de: Ordnermaske:

source: This is the mask that will be used for creating directories. It must be defined in octal. In case the CIFS file system is used, this setting only takes effect if the server does not support the CIFS Unix Extensions.
de: Dies ist die Maske, die bei der Erzeugung von Ordnern verwendet wird. Sie muss als oktale Zahl angegeben werden. Im Fall, dass das CIFS-Dateisystem benutzt wird, hat diese Einstellung nur Auswirkungen, wenn der Server die „CIFS Unix Extensions“ nicht unterstützt.

source: Write access:
de: Schreibzugriff:

source: Here you can choose if the shares should be mounted in read-write or read-only mode.
de: Hier können Sie auswählen, ob die Freigaben mit Lese- und Schreibzugriff oder nur Lesezugriff eingebunden werden sollen.

source: read-write
de: beschreibbar

source: read-only
de: schreibgeschützt

source: Do permission checks
de: Zugriffsrechte überprüfen

source: The client side (i.e. your side) will check if you have the right UID/GID to manipulate a file or directory. You might want to switch this feature off if the server(s) support the CIFS Unix Extensions and you are not allowed to access the files and directories. This setting does not affect the normal ACL check.
de: Die Klientenseite (d. h. Ihre Seite) überprüft, ob Sie die richtige Benutzer- und Gruppenkennung (UID/GID) besitzen, um eine Datei oder einen Ordner zu bearbeiten. Eventuell sollten Sie diese Funktion deaktivieren, wenn der Server die „CIFS Unix Extensions“ unterstützt und Sie keinen Zugriff auf die Dateien und Ordner erhalten. Diese Einstellung berührt die normalen ACL-Überprüfungen nicht.

source: Attempt to set UID and GID
de: Versuchen UID und GID zu setzen

source: In case the server supports the CIFS Unix Extensions, the client side (i.e. your side) attempts to set the effective UID and GID of the current process on newly created files, directories and devices. If this feature is turned off, the default UID and GID defined for the share will be used. It is recommended that you read the manual page of mount.cifs before you change this setting.
de: Im Fall, dass der Server die „CIFS Unix Extensions“ unterstützt, versucht die Klientenseite (d. h. Ihre Seite) die effektive Benutzer- und Gruppenkennung (UID und GID) des laufenden Prozesses auf die neu erstellten Dateien, Ordner und Gerätedateien anzuwenden. Wenn diese Funktion deaktiviert ist, dann werden die standardmäßig für die Freigabe definierte UID und GID verwendet. Es wird empfohlen, dass Sie die Hilfeseite (manpage) für „mount.cifs“ lesen, bevor Sie diese Einstellung ändern.

source: Use server inode numbers
de: Inode-Nummern des Servers verwenden

source: Use inode numbers (unique persistent file identifiers) returned by the server instead of automatically generating temporary inode numbers on the client side.
de: Die Inode-Nummern (eindeutige, beständige Dateikennungen), die vom Server gemeldet werden verwenden, anstatt automatisch temporäre Inode-Nummern auf der Klientenseite zu generieren.

source: Do not cache inode data
de: Keine Inode-Daten zwischenspeichern

source: Directly read from and write to files opened on the share. In some cases this can provide better performance than the default behavior which caches reads and writes.
de: Direkt auf die auf der Freigabe geöffneten Dateien zugreifen. In einigen Fällen kann dies zu einem besseren Durchsatz führen als das standardmäßige Verhalten, bei dem die Lese- und Schreibzugriffe zwischengespeichert werden.

source: Translate reserved characters
de: Reservierte Zeichen übersetzen

source: Translate six of the seven reserved characters (including the colon, question mark, pipe, asterisk, greater than and less than characters but not the backslash) to remap range (above 0xF000). This allows you to open files that were created with such characters. This has no effect if the server does not support Unicode.
de: Sechs der sieben reservierten Buchstaben übersetzen (den Punkt, das Fragezeichen, die Pipe, das Sternchen, das Größer- und das Kleinerzeichen, aber nicht den Backslash) in den Remap-Bereich (oberhalb von 0xF000). Dadurch können Sie Dateien öffnen, die mit diesen Buchstaben erstellt wurden. Diese Einstellung hat keine Auswirkungen, wenn der Server kein Unicode unterstützt.

source: Do not use locking
de: Keine Sperrung (locking) verwenden

source: Do not use locking. Do not start lockd.
de: Keine Sperrung (locking) verwenden. „lockd“ nicht starten.

source: Additional options:
de: Zusätzliche Optionen:

source: Here you can enter advanced options for the CIFS file system in a comma-separated list (refer to the manual page of mount.cifs to learn more). The list will be added AS IS to the "-o" argument of mount.cifs. Please do not enter options that have already been defined in the configuration dialog.
de: Hier können Sie erweiterte Optionen für das CIFS-Dateisystem in einer durch Kommata getrennten Liste angeben (lesen Sie die Hilfeseite (manpage) von „mount.cifs“, um mehr zu erfahren). Die Liste wird OHNE ÄNDERUNGEN an das Argument „-o“ von „mount.cifs“ angehängt. Bitte geben Sie keine Optionen an, die bereits im Konfigurationsdialog angegeben worden sind.

source: Protocol hint:
de: Protokollhinweis:

source: Here you can choose the protocol that will be used by the net command for the communication with remote servers if appropriate. In most cases the automatic detection will work fine and you should not need to change the default setting. However, if you experience problems, use the RPC protocol for newer operating systems (Windows NT4 and above) and the RAP protocol for older ones (Windows 98/NT3 and below). Functions that need the ADS protocol (for Active Directory environments) have not been implemented yet, so you can ignore that one for now.
de: Hier können Sie das Protokoll wählen, das durch den Befehl „net“ für die Kommunikation mit entfernten Rechnern benutzt wird, falls dies angebracht ist. In den meisten Fällen arbeitet die automatische Erkennung einwandfrei und Sie brauchen die Standardeinstellung nicht zu ändern. Sollten Sie allerdings Probleme feststellen, benutzen Sie das RPC-Protokoll für neuere Betriebssysteme (Windows NT4 und später) und das RAP-Protokoll für ältere (Windows 98/NT3 und davor). Funktionen, die das ADS-Protokoll benötigen (Active-Directory-Umgebungen), sind bisher nicht implementiert worden. Sie können es deshalb im Moment und bis auf Weiteres ignorieren.

source: Automatic detection
de: Automatische Erkennung

source: RPC: Modern operating systems
de: RPC: Moderne Betriebssysteme

source: RAP: Older operating systems
de: RAP: Ältere Betriebssysteme

source: ADS: Active Directory environment (LDAP/Kerberos)
de: ADS: Active-Directory-Umgebung (LDAP/Kerberos)

source: Name resolve order:
de: Auflösungsreihenfolge:

source: This option is used to determine what naming services and in what order are used to resolve host names and IP addresses. It takes a space-separated list of up to four different name resolution options. Those are: lmhost, host, wins, bcast. See the manual page of smbclient for further information.
de: Diese Einstellung wird verwendet, um die Dienste und ihre Reihenfolge zu bestimmen, die zur Auflösung der Rechnernamen und IP-Adressen benutzt werden sollen. Es kann eine Liste von bis zu vier, durch Kommata getrennte Dienste angegeben werden. Folgende stehen zur Verfügung: „lmhost“, „host“, „wins“, „bcast“. Lesen Sie die Handbuchseite (manpage) für „smbclient“ für weitere Informationen.

source: Buffer size:
de: Puffergröße:

source: This option changes the transmit/send buffer size when getting or putting a file from/to the server. The default is 65520 bytes. Setting this value smaller has been observed to speed up file transfers to and from Windows 9x servers.
de: Diese Einstellung ändert die Übermittlungs-/Sendepuffergröße, die für die Dateiübertragung vom oder zum Server benutzt wird. Der Standardwert ist 65520 Bytes. Die Verkleinerung dieses Werts hat sich als hilfreich herausgestellt, um die Übertragung zu und von Windows 9x zu beschleunigen.

source: Broadcast address:
de: Broadcast-Adresse:

source: Queries performed with nmblookup will be send to the given broadcast address. Without this option the default behavior is to send the queries to the broadcast address of the network interface that was either auto-detected or defined in the "interfaces" parameter of the smb.conf file.
de: Mit „nmblookup“ durchgeführte Abfragen werden an die gegebene Broadcast-Adresse gesendet. Ohne diese Einstellung werden die Abfragen standardmäßig entweder an die automatisch erkannte oder an die durch den „interfaces“-Parameter in der Datei „smb.conf“ definierte Broadcast-Adresse gesendet.

source: Try and bind to UDP port 137 to send and receive UDP datagrams
de: UDP-Port 137 zum Austausch von UDP-Datagrammen verwenden

source: Try and bind to UDP port 137 to send and receive UDP datagrams. The reason for this option is a bug in Windows 95 where it ignores the source port of the requesting packet and only replies to UDP port 137. Unfortunately, on most Unix systems super user privileges are needed to bind to this port. Please read the manual page of nmblookup for more information.
de: Den UDP-Port 137 zum Senden und Empfangen von UDP-Datagrammen verwenden, falls dies möglich ist. Der Grund für diese Einstellung ist ein Fehler in Windows 95, durch den der Quellport eines anfragenden Pakets ignoriert wird und Antworten nur auf UDP-Port 137 gegeben werden. Auf den meisten Unix-Systemen sind Systemverwalterrechte erforderlich, um diesen Port zu benutzen. Bitte lesen Sie die Hilfeseite (manpage) für „nmblookup“ für mehr Informationen.

source: Send requests as broadcasts
de: Broadcast-Anfragen senden

source: Let smbtree query the network nodes by sending requests as broadcasts instead of querying the local master browser.
de: „smbtree“ dazu veranlassen, die Netzwerkknoten durch Senden von Boadcast-Anfragen abzufragen, anstatt den lokalen Masterbrowser abzufragen.

source: Security mode:
de: Sicherheitsmodus:

source: Security mode for mount.cifs. To be able to use this mode, the CIFS kernel module 1.40 or later is required.
de: Sicherheitsmodus für mount.cifs. Um diesen Modus nutzen zu können, wird das CIFS-Kernelmodul 1.40 oder höher benötigt.

source: Connect as a null user (no name)
de: Verbindung als Null-Benutzer (ohne Namen) herstellen

source: Kerberos 5 authentication
de: Kerberos 5-Authentifizierung

source: Kerberos 5 authentication and packet signing
de: Kerberos 5-Authentifizierung und Paketsignierung

source: NTLM protocol
de: NTLM-Protokoll

source: NTLM protocol and packet signing
de: NTLM-Protokoll und Paketsignierung

source: NTLMv2 protocol
de: NTLMv2-Protokoll

source: NTLMv2 protocol and packet signing
de: NTLMv2-Protokoll und Paketsignierung

source: NTLMSSP protocol
de: NTLMSSP-Protokoll

source: NTLMSSP protocol and packet signing
de: NTLMSSP-Protokoll und Paketsignierung

source: Synchronization prefix:
de: Basisordner für den Abgleich:

source: Under this prefix the destination directory for the synchronization will be created. However, if you want to store the data of a particular share elsewhere, you will be able to choose a different path before the actual synchronization begins.
de: Unter diesem Basisordner wird der Zielordner für den Abgleich erzeugt. Wenn Sie allerdings die Daten einer bestimmten Freigabe woanders speichern möchten, dann können Sie vor Beginn des tatsächlichen Abgleichs einen anderen Ordner wählen.

source: Archive mode
de: Archivierungsmodus

source: Use archive mode (-a, --archive). This is a short form of -rlptgoD.
de: Den Archivierungsmodus (-a, --archive) verwenden. Dies ist eine Kurzform für -rlptgoD.

source: Recurse into subdirectories
de: In Ordner hinabsteigen

source: Recurse into directories (-r, --recursive).
de: In Ordner hinabsteigen (-r, --recursive).

source: Update files
de: Dateien aktualisieren

source: Update files in the destination directory that are older than in the source directory (-u, --update).
de: Dateien im Zielordner aktualisieren, die älter sind als im Quellordner (-u, --update).

source: Update files in place
de: Dateien vor Ort aktualisieren

source: Update destination files in-place (--inplace). By default, rsync first creates a new copy of a file and moves it into place after its transfer finished. If you enable this feature, no copy will be created but the destination file will immediately be overwritten instead. An exception to this is if you combine this option with --backup.
de: Zieldateien am Platz (--inplace) aktualisieren. Standardmäßig erzeugt rsync zunächst eine neue Kopie einer Datei und verschiebt sie erst nach der vollständigen Übertragung an ihren Platz. Wenn Sie diese Funktion einschalten, dann wird keine Kopie erstellt, sondern die Zieldatei wird stattdessen sofort überschrieben. Eine Ausnahme hierzu bildet die Kombination mit „--backup“.

source: Use relative path names
de: Relative Pfadnamen verwenden

source: Use relative paths (-R, --relative). This means that the full path names specified on the command line are sent to the server rather than just the last parts of the file names.
de: Relative Pfadnamen verwenden (-R, --relative). Das bedeutet, dass die in der Befehlszeile angegeben Pfadnamen in voller Länge an den Server übermittelt werden. Anderenfalls wird jeweils nur der hintere Teil weitergegeben.

source: Do not send implied directories
de: Keine eingeschlossenen Ordner senden

source: Do not send implied directories with --relative (--no-implied-dirs). This means that the corresponding path elements on the destination system are left unchanged if they exist, and any missing implied directories are created with default attributes. This even allows these implied path elements to have big differences, such as being a symlink to a directory on one side of the transfer, and a real directory on the other side.
de: Keine eingeschlossenen Ordner senden bei der Verwendung von „--relative“ (--no-implied-dirs). Das bedeutet, dass die entsprechenden Pfadelemente auf dem Zielsystem nicht geändert werden, wenn sie existieren, und alle fehlenden eingeschlossenen Ordner mit Standardattributen erzeugt werden. Das lässt sogar große Unterschiede der eingeschlossenen Pfadelemente zu, zum Beispiel, dass ein Ordner auf der einen Seite eine symbolische Verknüpfung und auf der anderen Seite ein regulärer Eintrag ist.

source: Transfer directories without recursing
de: Ordner nicht rekursiv übertragen

source: Transfer directories without recursing (-d, --dirs). This means that all top-level subdirectories are transferred but without their contents.
de: Ordner nicht rekursiv übertragen (-d, --dirs). Das bedeutet, dass alle Ordner auf höchster Ebene zwar übertragen werden, aber ohne ihren Inhalt.

source: Compress data during transfer
de: Daten bei Übertragung komprimieren

source: Compress data during transfer (-z, --compress). This significantly reduces the amount of data that is being transferred. You may want to use this option, if you have a slow connection.
de: Die Daten während der Übertragung komprimieren (-z, --compress). Dies verringert deutlich die Menge an Daten, die übertragen werden müssen. Sie sollten diese Option eventuell benutzen, wenn Sie eine langsame Verbindung haben.

source: Preserve symlinks
de: Symbolische Verknüpfungen beibehalten

source: Copy symlinks as symlinks (-l, --links).
de: Symbolische Verknüpfungen als symbolische Verknüpfungen kopieren (-l, --links).

source: Transform symlinks
de: Symbolische Verknüpfungen umwandeln

source: Transform symlinks into the items they are pointing to (-L, --copy-links).
de: Symbolische Verknüpfungen in die Elemente umwandeln, auf die sie zeigen (-L, --copy-links).

source: Only transform unsafe symlinks
de: Nur unsichere symbolische Verknüpfungen umwandeln

source: Transform unsafe symlinks into the items they are pointing to (--copy-unsafe-links). This means that only those symlinks are transformed that point to items that are outside the copied tree. Absolute symlinks are treated the same way. This option has no additional effect if --copy-links has also been specified.
de: Unsichere symbolische Verknüpfungen in die Einträge umwandeln, auf die sie zeigen (--copy-unsafe-links). Das bedeutet, dass nur die symbolischen Verknüpfungen umgewandelt werden, die aus dem zu kopierenden Ordnerbaum hinauszeigen. Symbolische Verknüpfungen mit einer vollständigen Pfadangabe werden genauso behandelt. Diese Option hat keinen zusätzlichen Effekt, wenn „--copy-links“ ebenfalls angegeben worden ist.

source: Ignore unsafe symlinks
de: Unsichere symbolische Verknüpfungen ignorieren

source: Ignore symlinks that point outside the copied tree (--safe-links). All absolute symlinks are also ignored. If you use this option in conjunction with --relative you might get unexpected results.
de: Symbolische Verknüpfungen ignorieren, die aus dem zu übertragenden Ordnerbaum herauszeigen (--safe-links). Alle symbolischen Verknüpfungen mit einer vollständigen Pfadangabe werden ebenfalls ignoriert. Falls Sie diese Option in Verbindung mit „--relative“ nutzen, können eventuell unerwartete Ergebnisse auftreten.

source: Preserve hard links
de: Harte Verknüpfungen beibehalten

source: Preserve hard links (-H, --hard-links). This options causes rsync to preserve the hard links that are found during the transfer. Without it, hard links are treated as though they were separate files.
de: Harte Verknüpfungen beibehalten (-H, --hard-links). Diese Option veranlasst „rsync“ dazu, harte Verknüpfungen beizubehalten, die während der Übertragung gefunden werden. Ohne diese Option werden harte Verknüpfungen so behandelt, als ob sie separate Dateien wären.

source: Keep directory symlinks
de: Symbolische Verknüpfungen zu Ordnern beibehalten

source: Treat symlinked directories on the receiving side as though they were real ones (-K, --keep-dirlinks). This only works if the symlink matches a real directory from the sending side. Without this option, the receiver's symlink will be deleted and replaced with a real directory.
de: Symbolisch verknüpfte Ordner auf der empfangenden Seite behandeln, als ob sie reale Ordner wären (-K, --keep-dirlinks). Das funktioniert nur, wenn die symbolische Verknüpfung einem realen Ordner auf der sendenden Seite entspricht. Ohne diese Option wird die symbolische Verknüpfung auf der empfangenden Seite gelöscht und mit einem realen Ordner ersetzt.

source: Preserve permissions
de: Zugriffsrechte beibehalten

source: Preserve permissions (-p, --perms). The permissions of the destination file will be same as the source file. For what happens if this option is switched off, please read rsync's manual page.
de: Zugriffsrechte beibehalten (-p, --perms). Die Zieldatei wird mit denselben Zugriffsrechten erzeugt, wie sie die Quelldatei besitzt. Um zu erfahren, was passiert, wenn Sie diese Option ausschalten, lesen Sie bitte die Hilfeseite (manpage) für „rsync“.

source: Preserve group
de: Gruppe beibehalten

source: Preserve the group (-g, --group). The group of the destination file will be set to the same value as the source file.
de: Die Gruppe beibehalten (-g, --group). Die Gruppe der Zieldatei wird auf denselben Wert gesetzt, wie ihn die Quelldatei besitzt.

source: Preserve owner
de: Eigentümer beibehalten

source: Preserve the owner (-o, --owner). The owner of the destination file will be set to the same value as the source file, but only if the receiving rsync is run as the super user. Without this option, the owner is set to the invoking user on the receiving side.
de: Den Eigentümer beibehalten (-o, --owner). Der Besitzer der Zieldatei wird auf denselben Wert gesetzt, wie ihn die Quelldatei besitzt, jedoch nur dann, wenn „rsync“ auf der Empfängerseite als Administrator ausgeführt wird. Ohne diese Option wird der Benutzer auf der empfangenden Seite der Besitzer.

source: Preserve device and special files
de: Blockgeräte und spezielle Dateien beibehalten

source: Preserve device and special files (-D, --devices --specials). This option causes rsync to transfer character and block devices as well as special files such as named sockets and fifos. It works only partially if rsync is not run as super user and the --super option is not specified.
de: Blockgeräte und spezielle Dateien beibehalten (-D, --devices --specials). Diese Option verursacht, dass „rsync“ Blockgeräte und spezielle Dateien, wie zum Beispiel „fifos“ oder „named sockets“, ebenfalls überträgt. Das funktioniert nur teilweise, wenn „rsync“ nicht als Systemverwalter ausgeführt wird und „--super“ nicht angegeben worden ist.

source: Preserve times
de: Zeiten beibehalten
