Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/extragear-network/smb4k.po
Languages: de

source: Preserve times (-t, --times). The modification times are transferred along with the files. For what happens if this option is switched off, please read rsync's manual page.
de: Die Zeiten beibehalten (-t, --times). Die Änderungszeiten werden zusammen mit den Dateien übertragen. Um zu erfahren, was passiert, wenn diese Option ausgeschaltet wird, lesen Sie bitte die Hilfeseite (manpage) für „rsync“.

source: Omit directories when preserving times
de: Ordner beim Beibehalten der Zeiten überspringen

source: Omit directories when preserving times (-O, --omit-dir-times). This means that directories are omitted when modification times are being preserved. Thus, this feature only works in conjunction with --times.
de: Ordner beim Beibehalten der Zeiten überspringen (-O, --omit-dir-times). Das bedeutet, dass Ordner übersprungen werden, wenn die Änderungszeiten beibehalten werden sollen. Daher funktioniert diese Funktion nur zusammen mit „--times“.

source: Remove synchronized source files
de: Abgeglichene Quelldateien entfernen

source: Remove all synchronized source files (--remove-source-files). This tells rsync to remove from the sending side the non-directory items that are a part of the transfer and have been successfully duplicated on the receiving side.
de: Alle abgeglichenen Quelldateien entfernen (--remove-source-files). Dies veranlasst „rsync“ dazu, alle Einträge, die Teil der Übertragung und keine Ordner sind, von der sendenden Seite zu entfernen, sobald sie auf der empfangenden Seite erfolgreich dupliziert wurden.

source: Delete extraneous files
de: Fremde Dateien löschen

source: Delete extraneous files from destination (--delete). This tells rsync to delete all files from the receiving side that are not present on the sending side, but only for the directories that are being synchronized.
de: Fremde Dateien auf der Zielseite löschen (--delete). Hierdurch wird „rsync“ dazu gebracht, alle Dateien auf der empfangenden Seite zu löschen, die nicht auch auf der Quellseite vorhanden sind. Dies gilt allerdings nur für die Ordner, die tatsächlich aktualisiert werden.

source: Delete files before transfer
de: Dateien vor der Übertragung löschen

source: Delete files on the receiving side before the transfer starts (--delete-before). This is the default behavior if --delete or --delete-excluded is specified without one of the --delete-WHEN options.
de: Die Dateien auf der empfangenden Seite löschen, bevor die Übertragung startet (--delete-before). Dies ist das Standardverhalten, wenn „--delete“ oder „--delete-excluded“ ohne eine der „--delete-WANN“-Optionen angegeben wurde.

source: Delete files after transfer
de: Dateien nach der Übertragung löschen

source: Delete files on the receiving side after the transfer has completed (--delete-after, --del).
de: Die Dateien auf der empfangenden Seite löschen, nachdem die Übertragung beendet ist (--delete-after, --del).

source: Delete files during transfer
de: Dateien während der Übertragung löschen

source: Delete files on the receiving side during the transfer (--delete-during). This method is faster than --delete-before or --delete-after, but it is only supported with rsync 2.6.4 or later.
de: Die Dateien auf der empfangenden Seite während der Übertragung löschen (--delete-during). Diese Methode ist schneller als „--delete-before“ oder „--delete-after“, wird aber erst ab „rsync“ 2.6.4 unterstützt.

source: Also delete excluded files
de: Auch ausgeschlossene Dateien löschen

source: Also delete excluded files from destination directory (--delete-excluded). In addition to deleting the files on the receiving side that are not on the sending side, this tells rsync to also delete any files on the receiving side that are excluded. Refer to rsync's manual page for further information.
de: Auch ausgeschlossene Dateien aus dem Zielordner löschen (--delete-excluded). Zusätzlich zum Löschen der auf der empfangenden, aber nicht auf der sendenden Seite vorhandenen Dateien, veranlasst dies „rsync“ dazu, alle Dateien auf der empfangenden Seite zu löschen, die ausgeschlossen wurden. Lesen Sie die Hilfeseite (manpage) für „rsync“ für mehr Informationen.

source: Delete even if I/O errors occur
de: Selbst bei Ein-/Ausgabefehlern löschen

source: Delete even if I/O errors occur (--ignore-errors). This option has to be specified in conjunction with --delete to take effect.
de: Selbst dann löschen, wenn Ein-/Ausgabefehler auftreten (--ignore-errors). Diese Option muss zusammen mit „--delete“ angegeben werden, um wirksam zu sein.

source: Force deletion of non-void directories
de: Löschen nicht leerer Ordner erzwingen

source: Force deletion of directories even if they are not empty (--force). This option tells rsync to delete a non-empty directory when it is to be replaced by a non-directory. This is only relevant if deletions are not active.
de: Das Löschen von Ordnern selbst dann erzwingen, wenn sie nicht leer sind (--force). Diese Option veranlasst „rsync“ dazu, einen nicht leeren Ordner zu löschen, wenn er durch einen Eintrag ersetzt werden soll, der kein Ordner ist. Dies ist jedoch nur relevant, wenn keine anderweitigen Löschungen aktiviert wurden.

source: Do not delete more than this many files:
de: Nicht mehr Dateien löschen als:

source: Only delete as many files as defined here (--max-delete=NUM). This tells rsync not to delete more than NUM files or directories (NUM must be non-zero). This is useful when mirroring very large trees to prevent disasters.
de: Nur so viele Dateien löschen, wie hier angegeben sind (--max-delete=ZAHL). Dies veranlasst „rsync“ dazu, nicht mehr als ZAHL Dateien und Ordner zu löschen (ZAHL darf nicht Null sein). Dies ist nützlich, wenn man sehr große Ordnerbäume spiegelt und ein Desaster verhindern will.

source: Value for DeleteMaximum config entry
de: Der Wert für den Konfigurationseintrag DeleteMaximum

source: Do not transfer any file smaller than:
de: Keine Datei übertragen kleiner als:

source: This option causes rsync to not transfer any file that is smaller than the specified size (--min-size=SIZE).
de: Diese Option veranlasst „rsync“, keine Datei zu übertragen, die kleiner als die angegebene Größe ist (--min-size=GRÖSSE).

source: Value for MinimalTransferSize config entry
de: Der Wert für den Konfigurationseintrag MinimalTransferSize

source: Do not transfer any file larger than:
de: Keine Datei übertragen größer als:

source: This option causes rsync to not transfer any file that is larger than the specified size (--max-size=SIZE).
de: Diese Option veranlasst „rsync“, keine Datei zu übertragen, die größer als die angegebene Größe ist (--max-size=GRÖSSE).

source: Value for MaximalTransferSize config entry
de: Der Wert für den Konfigurationseintrag MamximalTransferSize

source: Keep partially transferred files
de: Teilweise übertragene Dateien aufbewahren

source: Keep partially transferred files (--partial). The default behavior is that any partially transferred file is deleted if the transfer is interrupted.
de: Teilweise übertragene Dateien aufbewahren (--partial). Das Standardverhalten ist, dass alle Dateien, die nur teilweise übertragen wurden, bei der Unterbrechung der Übertragung gelöscht werden.

source: Put partially transferred files into:
de: Teilweise übertragene Dateien ablegen in:

source: Put a partially transferred file into this directory (--partial-dir=DIR). This is a better way than the --partial option to keep partial files, because the partially transferred file is kept in a different directory and the destination file is not overwritten.
de: Eine teilweise übertragene Datei in diesem Ordner ablegen (--partial-dir=DIR). Dies ist eine bessere Möglichkeit nur teilweise übertragene Datei aufzubewahren, als die Option --partial, weil die teilweise übertragenen Dateien in einem getrennten Ordner aufbewahrt und die Zieldateien nicht überschrieben werden.

source: The data for the UsePartialDirectory option
de: Die Eingabe für die Option UsePartialDirectory

source: Auto-ignore files in the same way CVS does
de: Dateien automatisch ignorieren genauso wie CVS

source: Auto-ignore files in the same way CVS does (-C, --cvs-exclude). This is a useful shorthand for excluding a broad range of files that you often do not want to transfer between systems. This option uses the same algorithm that CVS uses to determine if a file should be ignored.
de: Dateien auf dieselbe Weise automatisch ignorieren, wie es CVS tut (-C, --cvs-exclude). Dies ist eine nützliche Kurzschreibweise für das Ausschließen einer großen Anzahl von Dateien, die Sie oft gar nicht mitübertragen lassen möchten. Diese Option benutzt den gleichen Algorithmus wie CVS, um zu bestimmen, ob eine Datei ignoriert werden soll.

source: Exclude files matching this pattern:
de: Dateien aufgrund dieses Musters ausschließen:

source: Exclude files that match a certain pattern (--exclude=PATTERN). This is a special filter rule. For further information on filter rules see rsync's manual page.
de: Dateien ausschließen, die einem bestimmten Muster entsprechen (--exclude=MUSTER). Dies ist eine spezielle Filterregel. Für weitere Informationen zu Filterregeln lesen Sie die Hilfeseite (manpage) für „rsync“.

source: Pattern that is used for file exclusion
de: Muster, das für den Ausschluss von Dateien benutzt wird

source: Read exclude patterns from:
de: Ausschlussmuster lesen aus:

source: Read exclude patterns from a file (--exclude-from=FILE). This option is similar to the --exclude=PATTERN option except that the exclude patterns are read from a file. This is a special filter rule. For further information on filter rules see rsync's manual page.
de: Die Ausschlussmuster aus einer Datei lesen (--exclude-from=DATEI). Diese Option ist ähnlich zu „--exclude=MUSTER“, außer dass die Ausschlussmuster von einer Datei gelesen werden. Dies ist eine spezielle Filterregel. Für weitere Informationen zu Filterregeln lesen Sie die Hilfeseite (manpage) für „rsync“.

source: The file from which the exclude patterns are read
de: Die Datei, aus der die Ausschlussmuster gelesen werden

source: Do not exclude files matching this pattern:
de: Dateien aufgrund dieses Musters berücksichtigen:

source: Do not exclude files matching a certain pattern (--include=PATTERN). This is a special filter rule. For further information on filter rules see rsync's manual page.
de: Solche Dateien nicht ausschließen, die ein bestimmtes Muster erfüllen (--include=MUSTER). Dies ist eine spezielle Filterregel. Für weitere Informationen zu Filterregeln lesen Sie die Hilfeseite (manpage) für „rsync“.

source: Pattern that is used for file inclusion
de: Das Muster, das zum Dateieinschluss genutzt wird

source: Read include patterns from:
de: Einschlussmuster lesen aus:

source: Read include patterns from a file (--include-from=FILE). This option is similar to the --include=PATTERN option except that the include patterns are read from a file. This is a special filter rule. For further information on filter rules see rsync's manual page.
de: Das Einschlussmuster aus einer Datei lesen (--include-from=DATEI). Diese Option ist ähnlich zu „--include=MUSTER“, außer dass die Einschlussmuster von einer Datei gelesen werden. Dies ist eine spezielle Filterregel. Für weitere Informationen zu Filterregeln lesen Sie die Hilfeseite (manpage) für „rsync“.

source: The file from which the include patterns are read
de: Die Datei, von der die Einschlussmuster gelesen werden

source: Custom filter rules:
de: Benutzerdefinierte Filterregeln:

source: Add custom file-filtering rules (-f, --filter=RULE). This option allows you to add rules to selectively exclude certain files from the list of files to be transferred. These rules will be added to the rsync command as they are. Thus, each rule has to start with the --filter=... argument.
de: Benutzerdefinierte Datei-Filterregeln hinzufügen (-f, --filter=REGEL). Diese Option erlaubt es Ihnen, Filterregeln hinzuzufügen, die wahlweise gewisse Dateien von der Liste zu übertragender Dateien ausschließen. Diese Regeln werden dem „rsync“-Befehl ohne Änderungen hinzugefügt, weshalb jede einzelne mit dem Argument „--filter=...“ beginnen muss.

source: Use --filter='dir-merge /.rsync-filter' filter rule
de: Die Filterregel --filter='dir-merge /.rsync-filter' verwenden

source: This filter rule tells rsync to look for per-directory .rsync-filter files that have been sprinkled through the hierarchy and use their rules to filter the files in the transfer. It has no effect, if you also choose to use the --filter='exclude .rsync-filter' rule.
de: Diese Filterregel veranlasst „rsync“ dazu, in jedem Ordner der zu übertragenden Hierarchie nach einer „.rsync-filter“-Datei zu suchen und ihre Filterregeln für die Übertragung zu benutzen, wenn sie vorhanden ist. Diese Filterregel hat keine Auswirkungen, falls Sie ebenfalls die Filterregel --filter='exclude .rsync-filter' auswählen.

source: Use --filter='exclude .rsync-filter' filter rule
de: Die Filterregel --filter='exclude .rsync-filter' verwenden

source: This rule filters out the .rsync-filter files from the transfer. These files normally contain filter rules that can be activated by choosing the --filter='dir-merge /.rsync-filter' rule and deselecting this one.
de: Diese Regel filtert die „.rsync“-Filter-Dateien aus der Übertragung heraus. Diese Dateien enthalten normalerweise Filterregeln, die durch die Wahl der --filter='dir-merge /.rsync-filter' und das Ausschalten dieser Regel aktiviert werden können.

source: Handle sparse files efficiently
de: Zerstreute Dateien effizient handhaben

source: Handle sparse files efficiently (-S, --sparse) so that they take up less space on the destination. This option conflicts with --inplace. For further information read rsync's manual page.
de: Zerstreut gespeicherte Dateien effizient handhaben (-S, --sparse), sodass sie weniger Platz auf der Zielseite verbrauchen. Diese kann nicht zusammen mit „--inplace“ verwendet werden. Für weitere Informationen lesen Sie die Hilfeseite (manpage) für „rsync“.

source: Copy files whole (no rsync algorithm)
de: Dateien im Ganzen kopieren (kein „rsync“-Algorithmus)

source: Copy files whole (-W, --whole-file). With this option the incremental rsync algorithm is not used and the whole file is sent as-is instead.
de: Dateien im Ganzen kopieren (-W, --whole-file). Mit dieser Option wird der inkrementelle Algorithmus von rsync nicht genutzt und die gesamte Datei wird stattdessen als Ganzes übertragen.

source: Do not cross file system boundaries
de: Keine Dateisystemgrenzen überschreiten

source: Do not cross file system boundaries (-x, --one-file-system). This tells rsync to avoid crossing a filesystem boundary when recursing. For further information on this option, read the manual page.
de: Keine Dateisystemgrenzen überschreiten (-x, --one-file-system). Dies veranlasst „rsync“ dazu, bei der rekursiven Übertragung keine Dateisystemgrenzen zu überschreiten. Für weitere Informationen zu dieser Option lesen Sie die Hilfeseite (manpage) für „rsync“.

source: Only update files that already exist
de: Nur bereits existierende Dateien aktualisieren

source: Skip creating new files on the receiving side (--existing). This tells rsync to skip creating files (including directories) that do not exist yet on the destination. If this option is combined with the --ignore-existing option, no files will be updated (which can be useful if all you want to do is to delete extraneous files).
de: Das Erzeugen neuer Dateien auf der empfangenden Seite überspringen (--existing). Dies veranlasst „rsync“ dazu, keine Dateien (und Ordner) zu erzeugen, die auf der Zielseite noch nicht existieren. Wird diese Option mit der Option „--ignore-existing“ kombiniert, dann werden gar keine Dateien aktualisiert (was sinnvoll sein kann, falls sie nur fremde Dateien löschen möchten).

source: Ignore files that already exist
de: Bereits existierende Dateien ignorieren

source: Skip updating files that already exist on the receiving side (--ignore-existing). Existing directories are not ignored.
de: Die Aktualisierung von Dateien überspringen, die bereits auf der empfangenden Seite existieren (--ignore-existing). Vorhandene Ordner werden nicht ignoriert.

source: Delay updates until the end of transfer
de: Aktualisierungen bis zum Übertragungsende verzögern

source: Delay updates until the end of the transfer (--delay-updates). This option puts the temporary file from each updated file into a holding directory until the end of the transfer, at which time all the files are renamed and copied into place in rapid succession.
de: Aktualisierungen bis zum Ende der Übertragung verzögern (--delay-updates). Diese Option verursacht, dass die aktualisierten Dateien bis zum Ende der Übertragung temporär in einem gesonderten Ordner abgelegt und danach umbenannt und an ihren Platz verschoben werden.

source: Make backups
de: Sicherungskopien erstellen

source: Make backups (-b, --backup). With this option, preexisting destination files are renamed as each file is transferred or deleted. You can control where the backup file goes and what (if any) suffix gets appended using the --backup-dir=DIR and --suffix=SUFFIX options.
de: Sicherungskopien erstellen (-b, --backup). Mit dieser Option werden Sicherungskopien von bereits existierenden Zieldateien angelegt, bevor sie aktualisiert oder gelöscht werden. Sie können mit Hilfe der Optionen „--backup-dir=DIR“ und „--suffix=SUFFIX“ kontrollieren, wohin die Sicherungskopien abgelegt werden und welche Suffixe ihnen angehängt werden.

source: Backup suffix:
de: Suffix für Sicherungskopien:

source: Use this suffix for backups (--suffix=SUFFIX).
de: Dieses Suffix für die Sicherungskopien verwenden (--suffix=SUFFIX).

source: Backup suffix
de: Suffix für Sicherungskopien

source: Backup directory:
de: Ordner für Sicherungskopien:

source: Store backups in this directory (--backup-dir=DIR).
de: Sicherungskopien in diesem Ordner speichern (--backup-dir=DIR).

source: Backup directory
de: Ordner für Sicherungskopien

source: Force fixed checksum block size:
de: Feste Prüfsummen-Blockgröße erzwingen:

source: Force a fixed checksum block-size (-B, --block-size=SIZE). This forces the block size used in the rsync algorithm to a fixed value.
de: Eine feststehende Prüfsummen-Blockgröße erzwingen (-B, --block-size=GRÖSSE). Dies erzwingt die Verwendung einer feststehenden Blockgröße im „rsync“-Algorithmus.

source: The block size
de: Die Blockgröße

source: Set block/file checksum seed:
de: Anfangswert für Block-/Dateiprüfsummen setzen:

source: Set block/file checksum seed (--checksum-seed=NUM). Set the MD4 checksum seed to this integer. This 4 byte checksum seed is included in each block and file MD4 checksum calculation. By default the checksum seed is generated by the server and defaults to the current time.
de: Den Anfangswert für Block-/Dateiprüfsummen setzen (--checksum-seed=ZAHL). Den Anfangswert für eine MD4-Prüfsumme auf diese ganze Zahl setzen. Dieser 4 Byte große Anfangswert wird für jede Berechnung von MD4-Block- oder Dateiprüfsummen verwendet. Standardmäßig wird der Anfangswert vom Server generiert und besteht aus der momentanen Zeit.

source: The checksum seed
de: Der Anfangswert für Prüfsummen

source: Skip files based on checksum
de: Dateien aufgrund von Prüfsummen überspringen

source: Skip files based on a checksum and not based on modification time and size (-c, --checksum). For further information on how this feature works read rsync's manual page.
de: Dateien aufgrund der Prüfsumme überspringen und nicht aufgrund der Änderungszeit und -größe (-c, --checksum). Für weitere Informationen, wie diese Funktion arbeitet, lesen Sie die Hilfeseite (manpage) für „rsync“.

source: Unmount all shares when the sleep button is pressed
de: Die Einbindungen aller Freigaben lösen, wenn der Tiefschlaf-Knopf gedrückt wird

source: Unmount all mounted shares after the hardware sleep button is pressed. The shares will automatically be remounted after the computer wakes up again.
de: Die Einbindungen aller Freigaben lösen, wenn der Hardware-Tiefschlaf-Knopf gedrückt wird. Die Freigaben werden automatisch wieder eingebunden, nachdem der Rechner aufgewacht ist.

source: Unmount all shares when the lid is closed
de: Die Einbindungen aller Freigaben lösen, wenn der Deckel geschlossen wird

source: Unmount all mounted shares after the lid of the laptop is closed. The shares will automatically be remounted after the computer wakes up again.
de: Die Einbindungen aller Freigaben lösen, wenn der Deckel des Laptops geschlossen wird. Die Freigaben werden automatisch wieder eingebunden, nachdem der Rechner aufgewacht ist.

source: Unmount all shares when the power button is pressed
de: Die Einbindungen aller Freigaben lösen, wenn der Ausschalt-Knopf gedrückt wird

source: Unmount all mounted shares after the hardware power button is pressed. The shares will automatically be remounted after the computer wakes up again.
de: Die Einbindungen aller Freigaben lösen, wenn der Ausschalt-Knopf gedrückt wird. Die Freigaben werden automatisch wieder eingebunden, nachdem der Rechner aufgewacht ist.

source: Unmount all shares when the network is disconnected
de: Die Einbindungen aller Freigaben lösen, wenn das Netzwerk nicht erreichbar ist

source: Unmount all mounted shares when the user disconnects from the network or the connection is lost due to a different reason. Using this option in combination with sleep and/or hibernation might lead to unwanted side effects. In this case you should unmount the shares manually before you suspend the computer.
de: Die Einbindungen aller Freigaben lösen, wenn der Benutzer sich vom Netzwerk abmeldet oder die Verbindung aus einem anderen Grund verloren geht. Falls Sie diese Funktion benutzen, während Sie Ihren Rechner in den Ruhezustand und/oder Tiefschlaf versetzen, kann es zu ungewollten Nebeneffekten kommen. In diesem Fall sollten Sie die Einbindungen der Freigaben von Hand lösen, bevor Sie den Rechner in den Schlafzustand schicken.

source: The format of %1 is not supported.
de: %1 besitzt eine nicht unterstützte Formatversion.

source: Add Bookmarks
de: Lesezeichen hinzufügen

source: All listed shares will be bookmarked. To edit the label or group, click the respective bookmark entry.
de: Alle aufgeführten Freigaben werden als Lesezeichen abgespeichert. Um die Beschreibung oder die Gruppe zu bearbeiten, klicken Sie auf den entsprechenden Lesezeicheneintrag.

source: Label:
de: Beschreibung:

source: Group:
de: Gruppe:

source: Edit Bookmarks
de: Lesezeichen bearbeiten

source: Add Group
de: Gruppe hinzufügen

source: Remove
de: Entfernen

source: Clear Bookmarks
de: Lesezeichen löschen

source: Login:
de: Anmeldename:

source: IP Address:
de: IP-Adresse:

source: Group name:
de: Gruppenname:

source: Custom Options
de: Benutzerdefinierte Einstellungen

source: <p>Define custom options for host <b>%1</b> and all the shares it provides.</p>
de: <p>Benutzerdefinierte Optionen für den Rechner <b>%1</b> und all seine Freigaben festlegen.</p>

source: <p>Define custom options for share <b>%1</b> at host <b>%2</b>.</p>
de: <p>Benutzerdefinierte Optionen für die Freigabe <b>%1</b> auf dem Rechner <b>%2</b> festlegen.</p>

source: General
de: Allgemein

source: UNC Address:
de: UNC-Adresse:

source: Filesystem Port:
de: Dateisystem-Port:

source: Write Access:
de: Schreibzugriff:

source: Security Mode:
de: Sicherheitsmodus:

source: Protocol Hint:
de: Protokollhinweis:

source: MAC Address:
de: MAC-Adresse:

source: Send magic package before scanning the network neighborhood
de: „Magisches“ Datenpaket vor dem Durchsuchen der Netzwerkumgebung senden

source: Send magic package before mounting a share
de: „Magisches“ Datenpaket vor dem Einbinden einer Freigabe senden
