Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/extragear-network/smb4k.po
Languages: de

# NAME OF TRANSLATORS
source: Your names
de: Alexander Reinholdt

# EMAIL OF TRANSLATORS
source: Your emails
de: alexander.reinholdt@kdemail.net

source: Show custom bookmark label if available
de: Benutzerdefinierte Lesezeichenbeschreibung anzeigen, falls vorhanden

source: Do not show the name of the share that is represented by the bookmark but the custom label that was defined in the bookmark editor.
de: Nicht den Namen der Freigabe anzeigen, die durch das Lesezeichen repräsentiert wird, sondern die benutzerdefinierte Beschreibung, die im Lesezeicheneditor definiert wurde.

source: Start docked
de: Angedockt starten

source: Start the application docked to the system tray, i.e. only the system tray widget is shown and the main window is hidden. You can bring the main window up by clicking on the system tray widget or by choosing "Restore" from its popup menu.
de: Die Anwendung wird angedockt an den Systemabschnitt gestartet, das heißt, nur das Fenster im Systemabschnitt wird angezeigt und das Hauptfenster bleibt geschlossen. Sie können das Hauptfenster anzeigen lassen, indem Sie auf das Fenster im Systemabschnitt klicken oder „Wiederherstellen“ aus seinem Aufklappmenü verwenden.

source: Show notifications
de: Benachrichtigungen anzeigen

source: Notify the user about actions that were performed, e.g. the mounting or unmounting of a share. If you do not want to be disturbed too often, you might want to switch this option off. Warnings and error messages are not affected by this option.
de: Den Benutzer über durchgeführte Aktionen benachrichtigen, z. B. das Einbinden oder Lösen der Einbindung einer Freigabe. Falls Sie nicht zu häufig gestört werden möchten, dann sollten Sie diese Option ausschalten. Warnungen und Fehlermeldungen sind nicht von dieser Option betroffen.

source: Show mounted shares in an icon view
de: Eingebundenen Freigaben in einer Symbolansicht anzeigen

source: The mounted shares will be displayed in an icon view.
de: Die eingebundenen Freigaben werden in einer Symbolansicht angezeigt.

source: Show mounted shares in a list view
de: Eingebundenen Freigaben in einer Listenansicht anzeigen

source: The mounted shares will be displayed in a list view.
de: Die eingebundenen Freigaben werden in einer Listenansicht angezeigt.

source: Show printer shares
de: Drucker-Freigaben anzeigen

source: Printer shares will be displayed in the network browser.
de: Druckerfreigaben werden im Netzwerkbrowser angezeigt.

source: Show hidden shares
de: Versteckte Freigaben anzeigen

source: Hidden shares will be displayed in the network browser. Hidden shares are ending with a $ sign, e.g. Musik$ or IPC$.
de: Versteckte Freigaben werden im Netzwerkbrowser angezeigt. Versteckte Freigaben enden mit einem $-Zeichen (z. B. Musik$ oder IPC$).

source: Show hidden IPC$ shares
de: Versteckte IPC$-Freigaben anzeigen

source: Hidden IPC$ shares will be displayed in the network browser.
de: Versteckte IPC$-Freigaben werden im Netzwerkbrowser angezeigt.

source: Show hidden ADMIN$ shares
de: Versteckte ADMIN$-Freigaben anzeigen

source: Hidden ADMIN$ shares will be displayed in the network browser.
de: Versteckte ADMIN$-Freigaben werden im Netzwerkbrowser angezeigt.

source: Show the type of the share
de: Typ der Freigabe anzeigen

source: The type of a share will be displayed in a separate column in the network browser. It can either be Disk, Print or IPC.
de: Der Typ einer Freigabe wird in einer separaten Spalte im Netzwerkbrowser angezeigt. Er kann entweder „Disk“, „Print“ oder „IPC“ sein.

source: Show the IP address of the server
de: IP-Adresse des Servers anzeigen

source: The IP address of the server will be displayed in a separate column in the network browser.
de: Die IP-Adresse des Servers wird in einer separaten Spalte im Netzwerkbrowser angezeigt.

source: Show the comment
de: Kommentar anzeigen

source: The comment describing the server or share will be displayed in a separate column in the network browser.
de: Der Kommentar, der den Server oder die Freigabe beschreibt, wird in einer separaten Spalte im Netzwerkbrowser angezeigt.

source: Show a tooltip with information about the network item
de: Kurzinfo mit Informationen über den Netzwerkeintrag anzeigen

source: The tooltip shows various information about the current network item.
de: Die Kurzinfo zeigt verschiedene Informationen über den derzeitigen Netzwerkeintrag an.

source: Automatically expand domains and hosts
de: Domänen und Rechner automatisch öffnen

source: Automatically expand domain and host items when a list of associated network items (domain members or shares) is added or updated. Please note that a domain or host item will always be expanded when you execute it.
de: Domänen- und Rechnereinträge automatisch öffnen, wenn einen Liste zugehöriger Netzwerkeinträge (Rechner oder Freigaben) hinzugefügt oder aktualisiert werden. Bitte beachten Sie, dass ein Domänen- oder Rechnereintrag grundsätzlich geöffnet wird, wenn man ihn ausführt.

source: Show the mount point instead of the share name
de: Mount-Punkt anstelle des Freigabenamens anzeigen

source: A share is normally displayed with its name in the shares view. Choosing this feature will cause the exchange of the share name by the mount point.
de: Eine Freigabe wird normalerweise mit ihrem Namen in der Freigabenanzeige dargestellt. Die Wahl dieser Einstellung veranlasst den Austausch des Namens der Freigabe durch den Mount-Punkt.

source: Show all shares that are mounted on the system
de: Alle Freigaben anzeigen, die auf dem System eingebunden sind

source: You will not only see the shares that were mounted and are owned by you, but also all other mounts using the SMBFS and CIFS file system that are present on the system.
de: Sie werden nicht nur die Freigaben sehen, die von Ihnen eingebunden wurden und Ihnen gehören, sondern auch alle anderen, die das SMBFS- oder CIFS-Dateisystem haben und auf Ihrem System eingebunden sind.

source: Show a tooltip with information about the share
de: Kurzinfo mit Informationen über die Freigabe anzeigen

source: The tooltip shows various information about the current share.
de: Die Kurzinfo zeigt verschiedene Informationen über die derzeitige Freigabe an.

source: Show the owner and group
de: Eigentümer und Gruppe anzeigen

source: Show the UID and GID that own all files on the mounted file system.
de: Die UID und GID anzeigen, die alle Dateien auf dem eingebundenen Dateisystem besitzen.

source: Show the login name
de: Benutzernamen anzeigen

source: Show the login name that was used to authenticate to the server. The column will only contain an entry if the share was mounted with the CIFS file system.
de: Den Benutzernamen anzeigen, der für die Authentifizierung gegenüber dem Server benutzt wurde. Diese Spalte besitzt nur einen Eintrag, wenn die Freigabe mit dem CIFS-Dateisystem eingebunden wurde.

source: Show the file system
de: Dateisystem anzeigen

source: Show the file system that was used for mounting the share.
de: Das Dateisystem anzeigen, das für das Einbinden der Freigabe benutzt wurde.

source: Show the free disk space
de: Freien Speicherplatz anzeigen

source: Show the free disk space that is left on the share.
de: Den auf der Freigabe freien Speicherplatz anzeigen.

source: Show the used disk space
de: Verwendeten Speicherplatz anzeigen

source: Show the disk space that is already used on the share.
de: Den auf der Freigabe bereits verwendeten Speicherplatz anzeigen.

source: Show the total disk space
de: Gesamten Speicherplatz anzeigen

source: Show the total disk space of the share.
de: Den gesamten Speicherplatz der Freigabe anzeigen.

source: Show the disk usage
de: Speicherverwendung anzeigen

source: Show the space that is used on the share (as a percentage.)
de: Den auf der Freigabe verwendeten Speicherplatz anzeigen (in Prozent).

source: Preview hidden files and directories
de: Vorschau von versteckten Dateien und Ordnern anzeigen

source: Display hidden files and directories in the preview dialog. The hidden files and directories are those whose names begin with a period. They are usually needed for very specific purposes (storing the configuration information for an application, etc.). Since they are not of any importance for your regular work, you normally do not need to enable this feature.
de: Versteckte Dateien und Ordner im Vorschaudialog anzeigen. Die Namen von versteckten Dateien oder Ordnern beginnen mit einem Punkt und werden meistens für spezielle Aufgaben benötigt (Speichern der Einstellungen einer Anwendung usw.). Da sie von keiner Bedeutung für Ihre alltägliche Arbeit sind, brauchen sie diese Einstellung normalerweise nicht einzuschalten.

source: Scan the network neighborhood for available workgroups and domains
de: Netzwerkumgebung nach Arbeitsgruppen und Domänen durchsuchen

source: This is the default method to retrieve the initial browse list. It discovers all workgroups and domains by looking for all known master browsers on your network neighborhood.
de: Dies ist die Standardmethode, um die anfängliche Browseliste zu erstellen. Sie entdeckt alle Arbeitsgruppen und Domänen durch die Suche nach allen bekannten Masterbrowsern in Ihrer Netzwerkumgebung.

source: Query the current workgroup master browser
de: Derzeitigen Masterbrowser der Arbeitsgruppe abfragen

source: This method queries the current master browser of your workgroup or domain to retrieve the initial browse list.
de: Diese Methode fragt den derzeitigen Masterbrowser Ihrer Arbeitsgruppe oder Domäne ab, um die anfängliche Browseliste zu erstellen.

source: Query this custom master browser:
de: Diesen Masterbrowser abfragen:

source: This method queries a custom master browser to retrieve the initial browse list.
de: Diese Methode fragt den benutzerdefinierten Masterbrowser ab, um die anfängliche Browseliste zu erstellen.

source: A custom master browser that is to be queried
de: Ein abzufragender benutzerdefinierter Masterbrowser

source: Enter the name or IP address of a master browser here that should be queried to compile the initial browse list.
de: Tragen Sie den Namen oder die IP-Adresse des Masterbrowsers hier ein, der abgefragt werden soll, um die anfängliche Browseliste zusammenzustellen.

source: Scan these broadcast areas:
de: Diese Broadcast-Bereiche durchsuchen:

source: This method will scan the given broadcast areas and look for all registered hosts.
de: Diese Methode durchsucht die angegebenen Broadcast-Bereiche nach registrierten Rechnern.

source: A custom list of broadcast addresses
de: Eine benutzerdefinierte Liste von Broadcast-Adressen

source: Enter a comma-separated list of broadcast addresses here (e.g. 192.168.0.255, 192.168.1.255). It is used to scan for all known hosts in the respective broadcast areas.
de: Tragen Sie eine durch Kommata getrennte Liste von Broadcast-Adressen (z. B. 192.168.0.255, 192.168.1.255) hier ein. Sie wird genutzt, um nach bekannten Rechnern in den entsprechenden Broadcast-Bereichen zu suchen.

source: The master browsers require authentication to return the browse list
de: Die Masterbrowser benötigen Authentifizierung, um die Browseliste bekannt zugeben

source: The master browsers in your network neighborhood require a login to return the browse list. This setting is rarely needed and might even cause a master browser to return an empty browse list. It will not have any effect when you let Smb4K scan broadcast areas.
de: Die Masterbrowser in Ihrer Netzwerkumgebung verlangen nach einer Anmeldung, um die Browseliste bekannt zugeben. Diese Einstellung wird nur selten benötigt und kann sogar einen Masterbrowser dazu veranlassen, dass er eine leere Browseliste zurückgibt. Sie hat keine Auswirkungen, wenn Sie Smb4K Broadcast-Bereiche durchsuchen lassen.

source: Scan the network neighborhood periodically
de: Netzwerkumgebung periodisch durchsuchen

source: Scan the network neighborhood periodically for all available workgroups, hosts and shares.
de: Die Netzwerkumgebung periodisch nach allen verfügbaren Arbeitsgruppen, Rechnern und Freigaben durchsuchen.

source: Interval between scans:
de: Intervall zwischen Abfragen:

source: This is the time in minutes that elapses until Smb4K rescans the network neighborhood for new workgroups, hosts and shares.
de: Dies ist die Zeit in Minuten, die vergeht, bis Smb4K erneut die Netzwerkumgebung nach neuen Arbeitsgruppen, Rechnern und Freigaben durchsucht.

source: Enable Wake-On-LAN features
de: Wake-On-LAN-Eigenschaften aktivieren

source: Wake-on-LAN (WOL) is an ethernet computer networking standard that allows a computer to be turned on or woken up by a network message. Smb4K uses a magic package send via a UDP socket to wake up remote servers. If you want to take advantage of the Wake-On-LAN feature, you need to enable this option.
de: Wake-On-LAN (WOL) ist ein Standard, der das Anschalten oder Aufwecken eines Rechners durch ein über das Netzwerk gesendetes Datenpaket erlaubt. Smb4K nutzt ein über einen UDP-Socket verschicktes „magisches“ Datenpaket, um entfernte Rechner aufzuwecken. Falls Sie von der Wake-On-LAN-Eigenschaft Gebrauch machen wollen, müssen Sie diese Option einschalten.

source: Waiting time:
de: Wartezeit:

source: This is the waiting time in seconds between the sending of the magic Wake-On-LAN packages and the scanning of the network neighborhood or the mounting of a share.
de: Dies ist die Wartezeit in Sekunden, die zwischen dem Senden der „magischen“ Datenpakete und dem Durchsuchen der Netzwerkumgebung oder dem Einbinden von Freigaben vergeht.

source: Mount prefix:
de: Basisordner für das Einbinden:

source: This is the prefix where Smb4K will create the mount points and mount the remote shares.
de: Dies ist der Basisordner, in dem Smb4K die Mount-Punkt anlegt und die entfernten Freigaben einbindet.

source: Force generated subdirectories to be lower case
de: Kleinschreibung für die erstellten Unterordner erzwingen

source: All names of the subdirectories created by Smb4K below the mount prefix will be lowercase.
de: Alle Namen der durch Smb4K unterhalb des Basisordners erzeugten Ordner werden kleingeschrieben.

source: Unmount all personal shares on exit
de: Die Einbindungen aller persönlichen Freigaben beim Beenden lösen

source: Unmount all shares that belong to you when the program exits. Shares that are owned by other users are ignored.
de: Die Einbindungen aller Freigaben, die Ihnen gehören, beim Beenden des Programms lösen. Die Freigaben, die von anderen Benutzern eingebunden wurden, werden dabei ignoriert.

source: Remount recently used shares on program start
de: Vormals benutzte Freigaben beim Programmstart einbinden

source: Remount all your shares that were mounted when you exited the program. If a remount fails, Smb4K will retry the next time it is started. Shares that were mounted by other users are ignored.
de: Alle Freigaben werden wieder eingebunden, die beim Beenden des Programms durch Sie eingebunden waren. Sollte das Einbinden einer Freigabe fehlschlagen, wird Smb4K es beim darauffolgenden Mal erneut versuchen. Freigaben, die von einem anderen Benutzer eingebunden wurden, werden hierbei ignoriert.

source: Number of remount attempts:
de: Anzahl der Einbindeversuche:

source: Set the number of attempts that are made to remount shares before Smb4K gives up.
de: Die Anzahl der Einbindeversuche einstellen, die unternommen werden bevor Smb4K aufgibt.

source: Interval between remount attempts:
de: Intervall zwischen Einbindeversuchen:

source: Set the time that elapses between attempts to remount shares.
de: Die Zeit einstellen, die zwischen den Einbindeversuchen vergeht.

source: Allow the unmounting of shares that are owned by other users
de: Das Lösen der Einbindungen von Freigaben erlauben, die zu anderen Benutzern gehören

source: Allow the unmounting of shares that were mounted by other users. Please think before you enable this option.
de: Das Lösen der Einbindungen von Freigaben erlauben, die von anderen Benutzern eingebunden wurden. Bitte überlegen Sie zunächst, bevor Sie diese Einstellung aktivieren.

source: Force the unmounting of inaccessible shares
de: Das Lösen der Einbindungen von unzugänglichen Freigaben erzwingen

source: Force the unmounting of inaccessible shares (Linux only). In case a share is inaccessible, a lazy unmount is performed. Before the actual unmount is performed, a warning dialog is shown asking to approve the unmount.
de: Das Lösen der Einbindungen von unzugänglichen Freigaben erzwingen (nur Linux). Falls eine Freigabe unzugänglich ist, wird ein „lazy unmount“ durchgeführt. Bevor das tatsächliche Trennen stattfindet, wird ein Warndialog mit der Bitte angezeigt, das Lösen der Einbindung zu bestätigen.

source: Interval between checks:
de: Intervall zwischen Überprüfungen:

source: This is the time in milliseconds that elapses until Smb4K checks again for new mounts and unmounts. The lower limit is 500 ms, the upper one 300000 ms. Please note that the smaller the interval gets the higher is your system load.
de: Dies ist die Zeit in Millisekunden, die vergeht, bis Smb4K erneut überprüft, ob Freigaben eingebunden oder deren Einbindungen gelöst wurden. Die untere Grenze sind 500 ms und die obere 300000 ms. Bitte beachten Sie, dass die Systemauslastung bei kleinen Intervallen ansteigt.

source: Save logins in a wallet
de: Anmeldungen in einem Passwortspeicher speichern

source: Use a wallet to store the login. The username and password are stored encrypted on your hard drive. If this setting is disabled, the login is not stored permanently but only temporarily.
de: Einen Passwortspeicher verwenden, um die Anmeldedaten zu speichern. Der Benutzername und das Passwort werden verschlüsselt auf Ihrer Festplatte abgelegt. Falls diese Einstellung ausgeschaltet ist, werden die Anmeldedaten nicht permanent sondern nur temporär gespeichert.

source: Remember logins during program run
de: Anmeldungen für die Zeit des Programmlaufs speichern

source: If you decide to store your logins temporarily, Smb4K will remember them only until the program exits. If you disable this setting, you will have to provide the login every time it is needed.
de: Wenn Sie sich dazu entschließen, die Anmeldenamen und Passwörter temporär zu speichern, werden sie nur bis zum Programmende vorrätig gehalten. Falls Sie diese Einstellung ausschalten, müssen Sie jedes Mal die Anmeldedaten neu eingeben, wenn sie benötigt werden.

source: Use a default login
de: Standardanmeldung verwenden

source: Enable the usage of a default login. The provided data is used by default to authenticate to a remote server. This is very useful e.g. if you are working in an Active Directory environment or an NT domain.
de: Die Verwendung einer Standardanmeldung aktivieren. Die angegebenen Daten werden standardmäßig zur Anmeldung an einem entfernten Server benutzt. Dies ist besonders nützlich, wenn Sie z. B. in einer Active-Directory-Umgebung oder einer NT-Domäne arbeiten.

source: This is the NetBIOS name of this computer that is used by Smb4K. By default, it is either the NetBIOS name that is defined in the smb.conf file or the host name.
de: Dies ist der von Smb4K benutzte NetBIOS-Name dieses Rechners. Standardmäßig ist dies entweder der NetBIOS-Name, der in der Datei smb.conf definiert ist, oder der Rechnername.

source: Domain:
de: Domäne:

source: This is the workgroup or domain this computer is or should be in. By default, it is the workgroup that is defined in the smb.conf file.
de: Dies ist die Arbeitsgruppe oder Domäne, der dieser Rechner angehört oder angehören soll. Standardmäßig ist dies die Arbeitsgruppe, die in der Datei smb.conf definiert ist.

source: Socket options:
de: Socket-Einstellungen:

source: These are the TCP socket options that are used by nmblookup and smbclient. Socket options are controls on the networking layer of the operating systems which allow the connection to be tuned. See the manual page of smb.conf for more information.
de: Dieses sind die TCP-Socket-Einstellungen, die von „nmblookup“ und „smbclient“ verwendet werden. Die Socket-Einstellungen dienen der Steuerung der Netzwerkschicht des Betriebssystems und können benutzt werden, um die Verbindung abzugleichen. Lesen Sie die Hilfeseite (manpage) für „smb.conf“, um mehr zu erfahren.

source: NetBIOS scope:
de: NetBIOS-Bereich:

source: This sets the NetBIOS scope that nmblookup and smbclient will operate under. It should not be set unless every machine on your network neighborhood sets this value.
de: Dies bestimmt den NetBIOS-Bereich, in dem „nmblookup“ und „smbclient“ arbeiten werden. Dies sollte nicht benutzt werden, es sei denn, alle Maschinen in der Netzwerkumgebung benutzen diesen Wert.

source: This is the port that is used for connecting to remote servers with the client programs net, smbclient and smbtree. The default value is 139 (NetBIOS). This setting is not used for mounting.
de: Dies ist der Port, der von den Klientenprogrammen „net“, „smbclient“ und „smbtree“ für die Verbindung mit entfernten Servern benutzt wird. Der Standardwert ist 139 (NetBIOS). Diese Einstellung wird nicht für das Einbinden von Freigaben benutzt.

source: File system port:
de: Dateisystem-Port:

source: This is the port that is exclusively used to mount shares from remote servers. The default value is 445 (CIFS file system).
de: Dies ist der Port, der exklusiv zum Einbinden von entfernten Freigaben benutzt wird. Der Standardwert ist 445 (CIFS-Dateisystem).

source: Try to authenticate with Kerberos
de: Anmeldung mit Kerberos versuchen

source: Try to authenticate with Kerberos. This is only useful in an Active Directory environment. The setting affects the smbclient and smbtree command.
de: Eine Anmeldung mit Kerberos versuchen. Dies ist nur in einer Active-Directory-Umgebung sinnvoll. Diese Einstellung beeinflusst die Programme „smbclient“ und „smbtree“.

source: Authenticate with local machine account
de: Anmeldung mit lokalem Maschinenkonto

source: Make queries to the remote server using the machine account of the local server. The setting affects the net, smbclient, and smbtree command.
de: Das lokale Maschinenkonto wird für die Anfragen an den entfernten Server benutzt. Diese Einstellung beeinflusst die Programme „net“, „smbclient“ und „smbtree“.

source: Use Winbind ccache for authentication
de: Winbind ccache für Authentifizierung verwenden

source: Use the Winbind ccache for authentication. This setting affects smbclient and smbtree command.
de: Den Winbind ccache für die Authentifizierung benutzen. Diese Einstellung beeinflusst die Programme „smbclient“ und „smbtree“.

source: Signing state:
de: Signierstatus:

source: Set the signing state. This setting affects the smbclient and smbtree command.
de: Den Signierstatus einstellen. Diese Einstellung beeinflusst die Programme „smbclient“ und „smbtree“.

source: None
de: Keiner

source: On
de: An

source: Off
de: Aus

source: Required
de: Benötigt

source: Encrypt SMB transport
de: SMB-Transport verschlüsseln

source: Encrypt the SMB transport (Unix extended servers only). This setting affects the smbclient and smbtree command.
de: Den SMB-Transport verschlüsseln (nur Server mit Unix-Erweiterungen). Diese Einstellung beeinflusst die Programme „smbclient“ und „smbtree“.

source: Client character set:
de: Zeichensatz der Klientenseite:
