Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/kdenetwork/desktop_kdenetwork_kopete.po
Languages: de

# Name
source: Tutorial Plugin
de: Anleitungsmodul

# Comment
source: Demonstration plugin for teaching Kopete development
de: Anleitungsmodul zum Einfinden in die Kopete-Entwicklung

# Name
source: Tutorial
de: Anleitung

# Comment
source: Turns normal people into Super Kopete Developer
de: Macht Normalsterbliche zu Super-Kopete-Entwicklern ;-)

# Name
source: Kopete Chat Window
de: Chat-Fenster von Kopete

# Comment
source: The default Kopete chat window
de: Das übliche Chat-Fenster für Kopete

# Name
source: Kopete Email Window
de: E-Mail-Fenster von Kopete

# Comment
source: The Kopete email window
de: Das E-Mail-Fenster für Kopete

# Name
source: Accounts
de: Zugänge

# Comment
source: Manage Your Accounts and Identities
de: Hier können Sie Ihre Zugänge und Identitäten verwalten

# Name
source: Contact List
de: Kontaktliste

# Comment
source: Configure Contact List Look and Feel
de: Erscheinungsbild der Kontaktliste einrichten

# Comment
source: Configure Video Devices
de: Videogeräte einrichten

# Name
source: Behavior
de: Verhalten

# Comment
source: Personalize Kopete's Behavior
de: Anpassung von Kopete an Ihre persönlichen Vorstellungen

# Name
source: Chat Window
de: Chat-Fenster

# Comment
source: Configure Chat Window Look and Feel
de: Erscheinungsbild des Chat-Fensters einrichten

# Name
source: Plugins
de: Module

# Comment
source: Select and Configure Plugins
de: Module auswählen und einrichten

# Comment
source: Manage Your Statuses
de: Statuseinstellungen verwalten

# Name
source: Group
de: Gruppe

# Comment
source: The group where the contact resides
de: Die Gruppe, zu der der Kontakt gehört

# Name
source: Contact
de: Kontakt

# Comment
source: The specified contact
de: Der angegebene Kontakt

# Name
source: Class
de: Klasse

# Comment
source: The message class
de: Die Nachrichtenklasse

# Name
source: Incoming Message
de: Eingehende Nachricht

# Comment
source: An incoming message has been received
de: Es ist eine eingehende Nachricht empfangen worden

# Name
source: Incoming Message in Active Chat
de: Eingehende Nachricht in aktivem Chat

# Comment
source: An incoming message in the active chat window has been received
de: Es ist eine eingehende Nachricht im aktiven Chat-Fenster empfangen worden

# Name
source: Outgoing Message
de: Ausgehende Nachricht

# Comment
source: An outgoing message has been sent
de: Es ist eine ausgehende Nachricht gesendet worden

# Name
source: Contact Gone Online
de: Kontakt ist online

# Comment
source: A contact has come online
de: Ein Kontakt ist nun online

# Comment
source: A contact has gone offline
de: Ein Kontakt ist nun offline

# Name
source: Status Change
de: Statusänderung

# Comment
source: A contact's online status has changed
de: Der Online-Status eines Kontakt hat sich geändert

# Name
source: Highlight
de: Hervorgehoben

# Comment
source: A highlighted message has been received
de: Es ist eine hervorgehobene Nachricht eingegangen

# Name
source: Low Priority Messages
de: Nachrichten mit niedriger Priorität

# Comment
source: A message marked with a low priority has been received
de: Es ist eine Nachricht mit niedriger Priorität eingegangen

# Comment
source: New email has arrived in your Yahoo inbox
de: Es befindet sich eine neue Nachricht im Yahoo-Eingangsordner

# Comment
source: New email has arrived in your MSN inbox
de: Es befindet sich eine neue Nachricht MSN-Eingangsordner

# Name
source: ICQ Authorization
de: ICQ-Autorisierung

# Comment
source: An ICQ user has authorized/declined your authorization request
de: Ein ICQ-Benutzer hat Ihre Autorisierungsanfrage angenommen/abgelehnt

# Name
source: IRC Event
de: IRC-Ereignis

# Comment
source: An IRC event has occurred
de: Es ist ein IRC-Ereignis aufgetreten

# Name
source: Connection Error
de: Verbindungsfehler

# Comment
source: An error on connection has occurred
de: Es ist ein Verbindungsfehler aufgetreten

# Name
source: Connection Lost
de: Verbindung abgebrochen

# Comment
source: The connection have been lost
de: Die Verbindung ist abgebrochen

# Name
source: Cannot Connect
de: Verbindung nicht möglich

# Comment
source: Kopete cannot connect to the service
de: Kopete kann zu diesem Dienst keine Verbindung herstellen

# Name
source: Network Problems
de: Netzwerkprobleme

# Comment
source: The network is experiencing problems
de: Das Netzwerk scheint derzeit gestört zu sein

# Name
source: Server Internal Error
de: Interner Serverfehler

# Comment
source: An internal service error has occurred
de: Ein interner Dienstfehler ist aufgetreten

# Name
source: Buzz/Nudge
de: Anstoß/Brummen

# Comment
source: A contact has sent you a buzz/nudge.
de: Ein Benutzer macht auf sich aufmerksam.

# Name
source: Message Dropped
de: Nachricht verworfen

# Comment
source: A message was filtered by the Privacy Plugin
de: Das Privatsphäre-Modul hat eine Nachricht gefiltert

# Name
source: ICQ Reading status
de: ICQ-Status wird gelesen

# Comment
source: An ICQ user is reading your status message
de: Ein ICQ-Benutzer liest gerade Ihre Statusmeldung

# Name
source: Service Message
de: Dienstmitteilung

# Comment
source: A service message has been received (e.g. authorization request)
de: Eine Dienstmitteilung wurde empfangen (z. B. Autorisierungsanfrage)

# Name
source: Gadu-Gadu contacts list
de: Gadu-Gadu-Kontaktliste

# Comment
source: Contact list has been received/exported/deleted
de: Die Kontaktliste ist empfangen/exportiert/gelöscht worden

# Name
source: Typing message
de: Nachricht wird geschrieben

# Comment
source: A user is typing a message
de: Ein Benutzer schreibt eine Nachricht

# Name
source: Incoming File Transfer
de: Eingehende Dateiübertragung

# Comment
source: An incoming file transfer request has been received
de: Eine Anfrage für eine eingehende Dateiübertragung wurde gestellt

# Comment
source: Kopete Plugin
de: Kopete-Modul

# Comment
source: Kopete Protocol Plugin
de: Kopete-Protokoll-Modul

# Comment
source: A Kopete UI Plugin
de: Ein Kopete-Benutzeroberflächenmodul

# Name
source: Bookmarks
de: Lesezeichen

# Comment
source: Automatically bookmark links in incoming messages
de: Verknüpfungen in eingehenden Nachrichten automatisch als Lesezeichen ablegen

# Comment
source: Adds custom aliases for commands
de: Fügt benutzerdefinierte Aliase für Befehle hinzu

# Name
source: Auto Replace
de: Automatische Ersetzung

# Comment
source: Autoreplaces some text you can choose
de: Ersetzt wählbare Texte automatisch

# Comment
source: Auto replaces some text you can choose
de: Ersetzt wählbare Texte automatisch

# Name
source: Contact Notes
de: Kontakt-Notizen

# Comment
source: Add personal notes on your contacts
de: Ermöglicht das Hinzufügen persönlicher Notizen zu Kontakten

# Name
source: Cryptography
de: Kryptografie

# Comment
source: Encrypts and signs messages using OpenPGP
de: Verschlüsselt und signiert Nachrichten mit OpenPGP

# Comment
source: Highlights text based on filters
de: Texthervorhebung mit Hilfe von Filtern

# Comment
source: Highlight messages
de: Hervorhebung von Nachrichten

# Name
source: History2
de: Verlauf2

# Comment
source: History Plugin
de: Verlaufsmodul

# Comment
source: Log all messages to keep track of your conversations
de: Protokolliert Ihre Gespräche und Nachrichten

# Name
source: History
de: Verlauf

# Comment
source: Render Latex formulas in the chatwindow
de: Ermöglicht LaTeX-Formeln in einem Chat-Fenster

# Name
source: Now Listening
de: Im Hintergrund läuft

# Comment
source: Tells your buddies what you're listening to
de: Teilt Ihren Freunden mit, welche Musik Sie gerade hören

# Comment
source: Encrypt chat sessions with Off-The-Record encryption
de: Chatsitzung mit Off-The-Record-Verschlüsselung sichern

# Name
source: Pipes
de: Umleitungen

# Comment
source: Pipe messages through an external program or script
de: Mitteilungen durch ein externes Programm/Skript leiten

# Name
source: Privacy
de: Privatsphäre

# Comment
source: Privacy Plugin
de: Privatsphäre-Modul

# Comment
source: Filters incoming messages
de: Filtert eingehende Nachrichten

# Name
source: Statistics
de: Statistik

# Comment
source: Gather some meaningful statistics
de: Einige aussagekräftige Statistiken sammeln

# Name
source: Text Effect
de: Texteffekte

# Comment
source: Adds special effects to your text
de: Verschönert Ihre Nachrichtentexte mit Spezial-Effekten

# Comment
source: Add nice effects to your messages
de: Verschönert Ihre Nachrichten mit netten Effekten

# Name
source: Translator
de: Übersetzer

# Comment
source: Translates messages from your native language to another language
de: Übersetzt Nachrichten von der eigenen in eine fremde Sprache

# Comment
source: Chat with foreign buddies in your native language
de: Chatten mit fremdsprachigen Freunden in der eigenen Muttersprache

# Name
source: URLPicPreview Plugin Configuration
de: Einrichtung des URLPicPreview-Moduls

# Comment
source: URLPicPreview Plugin
de: URLPicPreview-Moduls

# Name
source: Preview of Pictures in Chats
de: Bildervorschauen in Chats

# Comment
source: Displays a preview of pictures in chats
de: Zeigt eine Vorschau für Bilder in Chats an

# Comment
source: Show the status of (parts of) your contact list on a webpage
de: Zeigt den Status Ihrer Kontaktliste (oder Teilen davon) auf einer Internetseite an

# Name
source: Web Presence
de: Web-Präsenz

# Comment
source: Serverless Link Local XMPP Messaging
de: Link-Local-XMPP-Messaging ohne Server

# Comment
source: Gadu-Gadu: the Polish IM service
de: Gadu-Gadu – der polnische IM-Dienst

# Comment
source: Novell GroupWise Messenger
de: Novell-GroupWise-Nachrichtendienst

# Description
source: A KIO slave for Jabber Service Discovery
de: Ein-/Ausgabemodul zum Auffinden von Jabber-Diensten

# Comment
source: Communicate at the same time with Meanwhile
de: Kommunizieren Sie gleichzeitig mit Meanwhile

# Comment
source: An Instant Messenger
de: Ein Instant Messenger

# Comment
source: Seek and Chat with ICQ
de: Suchen und Chatten mit ICQ

# Comment
source: A popular Chinese IM system
de: Ein beliebtes chinesisches IM-System

# Comment
source: Skype protocol plugin (a wrapper)
de: Modul für das Skype-Protokoll (Wrapper)

# Comment
source: Send SMS messages to mobile phones
de: SMS-Nachrichten an Mobiltelefone senden

# Name
source: Testbed
de: Testbett

# Comment
source: Kopete test protocol
de: Kopete-Testprotokoll

# Comment
source: Sends Windows WinPopup messages
de: Sendet Nachrichten des Typs Windows-WinPopup

# Comment
source: Windows Live Messenger plugin
de: Modul für Windows-Live-Messenger

# Comment
source: Yahoo! Messenger IM and video chat
de: Yahoo! Messenger IM und Video-Chat
