Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/kdepimlibs/desktop_kdepimlibs.po
Languages: de

# Name
source: KAddressbook Instant Messaging Protocol
de: Instant-Messaging-Protokoll im KDE-Adressbuch

# Comment
source: AIM Protocol
de: AIM-Protokoll

# Comment
source: Gadu-Gadu Protocol
de: Gadu-Gadu-Protokoll

# Comment
source: Novell GroupWise Messenger
de: Novell-GroupWise-Nachrichtendienst

# Comment
source: ICQ Protocol
de: ICQ-Protokoll

# Comment
source: Jabber Protocol
de: Jabber-Protokoll

# Comment
source: Meanwhile Protocol
de: Meanwhile-Protokoll

# Comment
source: MSN Messenger
de: MSN-Nachrichtendienst

# Comment
source: Skype Internet Telephony
de: Skype-Internettelefonie

# Comment
source: SMS Protocol
de: SMS-Protokoll

# Comment
source: Yahoo Protocol
de: Yahoo-Protokoll

# Name
source: Contact Actions
de: Kontakt-Aktionen

# Comment
source: Configure the Contact Actions
de: Kontakt-Aktionen einrichten

# Name
source: SocialFeedItem Serializer
de: SocialFeedItem-Serialisierung

# Comment
source: An Akonadi serializer plugin for SocialFeedItem
de: Akonadi-Modul zur Serialisierung für SocialFeedItem

# Comment
source: An agent for debugging purpose
de: Agent für die Fehlersuche

# Name
source: Akonadi Test Search Plugin
de: Akonadi-Testsuchmodul

# Name
source: Binary
de: Binär

# Name
source: Contacts
de: Kontakte

# Name
source: Folder
de: Ordner

# Comment
source: Provides access to contacts, each stored in a single file, in a given folder. Supports standard vCard file and other formats depending on availability of plugins.
de: Ermöglicht Zugriff auf Kontakte, die in einzelnen Dateien in einem vorgegebenen Ordner gespeichert sind. Unterstützt Standard-vCard-Dateien und andere Formate abhängig von den verfügbaren Modulen.

# Name
source: File
de: Datei

# Comment
source: Provides access to contacts stored in a single local file. Supports standard vCard files and other formats depending on available plugins.
de: Ermöglicht Zugriff auf Kontakte, die in einer einzigen Datei lokal gespeichert sind. Unterstützt Standard-vCard-Dateien und andere Formate abhängig von den verfügbaren Modulen.

# Comment
source: Provides access to contacts stored on a LDAP directory server
de: Ermöglicht Zugriff auf Kontakte, die auf einem LDAP-Server gespeichert sind.

# Name
source: Network
de: Netzwerk

# Comment
source: Provides access to contacts in remote files using KDE's network framework KIO. Supports standard vCard files and other formats depending on available plugins.
de: Ermöglicht Zugriff auf Kontakte in entfernten Dateien durch das KIO-Netzwerksystem von KDE. Unterstützt Standard-vCard-Dateien und andere Formate abhängig von den verfügbaren Modulen.

# Name
source: Calendar
de: Kalender

# Name
source: Calendar in Local Directory
de: Kalender in lokalem Ordner

# Comment
source: Provides access to calendar items, each stored in a single file, in a given directory
de: Ermöglicht Zugriff auf Kalender, die jeweils in einzelnen Dateien in einem vorgegebenen Ordner gespeichert sind

# Description
source: An ioslave for the Sieve mail filtering protocol
de: Ein Ein-/Ausgabemodul für das Mailfilter-Protokoll Sieve

# Name
source: Kontact Plugin
de: Kontact-Modul

# Name
source: KDE Resources
de: KDE-Ressourcen

# Comment
source: Configure KDE Resources
de: KDE-Ressourcen einrichten

# Name
source: KResources Manager
de: Ressourcenverwaltung

# Comment
source: KResources Manager
de: Ressourcenverwaltung

# Name
source: KResources Plugin
de: KRessourcen-Modul

# Comment
source: KResources Framework Plugin
de: Modul für KRessourcen-Grundgerüst

# Name
source: Mail Transport
de: Versandart
