Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/kdepimlibs/kio_pop3.po
Languages: de

source: The server said: "%1"
de: Servermeldung: „%1“

source: The server terminated the connection.
de: Der Server hat die Verbindung abgebrochen.

source: Invalid response from server: "%1"
de: Ungültige Antwort vom Server: „%1“

source: Could not send to server.
de: Übermittlung an Server nicht möglich.

source: No authentication details supplied.
de: Keine Details für die Anmeldung angegeben.

source: Login via APOP failed. The server %1 may not support APOP, although it claims to support it, or the password may be wrong. %2
de: Die Anmeldung mit APOP ist fehlgeschlagen. Möglicherweise unterstützt der Server %1 dieses Protokoll nicht (obwohl er eine gegenteilige Information ausgibt), oder Sie haben ein falsches Passwort eingegeben. %2

source: An error occurred during authentication: %1
de: Bei der Authentifizierung ist ein Fehler aufgetreten: %1

source: Login via SASL (%1) failed. The server may not support %2, or the password may be wrong. %3
de: Die Anmeldung mit SASL (%1) ist fehlgeschlagen. Möglicherweise unterstützt der Server %2 nicht oder Sie haben ein falsches Passwort eingegeben. %3

source: Your POP3 server (%1) does not support SASL. Choose a different authentication method.
de: Ihr POP3-Server (%1) unterstützt kein SASL. Wählen Sie eine andere Methode zur Authentifizierung.

source: Could not login to %1.
de: Anmeldung bei %1 nicht möglich.

source: Could not login to %1. The password may be wrong. %2
de: Anmeldung bei %1 nicht möglich. Vielleicht ist das Passwort nicht korrekt. %2

source: The server terminated the connection immediately.
de: Der Server hat die Verbindung sofort abgebrochen.

source: Server does not respond properly: %1
de: Server antwortet nicht korrekt: %1

source: Your POP3 server (%1) does not support APOP. Choose a different authentication method.
de: Ihr POP3-Server (%1) unterstützt kein APOP. Wählen Sie eine andere Methode für die Authentifizierung.

source: Your POP3 server claims to support TLS but negotiation was unsuccessful. You can disable TLS in the POP account settings dialog.
de: Der POP3-Server signalisiert Unterstützung für TLS, aber eine entsprechende Verbindungsaufnahme ist fehlgeschlagen. Sie können TLS im Einrichtungsdialog für Eingangspostfächer abschalten.

source: Your POP3 server (%1) does not support TLS. Disable TLS, if you want to connect without encryption.
de: Der POP3-Server (%1) unterstützt kein TLS. Deaktivieren Sie TLS, wenn Sie eine Verbindung ohne Verschlüsselung aufnehmen möchten.

source: Username and password for your POP3 account:
de: Benutzername und Passwort für Ihren POP3-Zugang:

source: Unexpected response from POP3 server.
de: Unerwartete Reaktion vom POP3-Server

source: Error during communication with the POP3 server while trying to list mail: %1
de: Fehler bei der Kommunikation mit dem POP3-Server beim Anzeigen der E-Mails: %1

source: Error during communication with the POP3 server while trying to download mail: %1
de: Fehler bei der Kommunikation mit dem POP3-Server beim Herunterladen von der E-Mails: %1

source: The POP3 command 'STAT' failed
de: Der POP3-Befehl „STAT“ ist fehlgeschlagen.

source: Invalid POP3 response, should have at least one space.
de: Ungültige POP3-Antwort; sie muss mindestens ein Leerzeichen enthalten.

source: Invalid POP3 STAT response.
de: Ungültige POP3-STAT-Antwort.
