Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/kdepimlibs/kio_imap4.po
Languages: de

source: Message from %1 while processing '%2': %3
de: Nachricht von %1 während der Verarbeitung von „%2“: %3

source: Message from %1: %2
de: Nachricht von %1: %2

source: The following folder will be created on the server: %1 What do you want to store in this folder?
de: Der folgende Ordner wird auf dem Server angelegt: %1. Was möchten Sie in diesem Ordner speichern?

source: Create Folder
de: Ordner erstellen

source: &Messages
de: &Nachrichten

source: &Subfolders
de: &Unterordner

source: Unsubscribe of folder %1 failed. The server returned: %2
de: Kündigen des Abonnements von Ordner %1 ist fehlgeschlagen. Die Serverantwort lautet: %2

source: Subscribe of folder %1 failed. The server returned: %2
de: Abonnement von Ordner %1 ist fehlgeschlagen. Die Serverantwort lautet: %2

source: Changing the flags of message %1 failed with %2.
de: Ändern der Markierung für %1 fehlgeschlagen mit %2.

source: Silent Changing the flags of message %1 failed with %2.
de: Stillschweigendes Ändern der Markierung für %1 fehlgeschlagen mit %2.

source: Changing the flags of message %1 failed.
de: Ändern der Markierung für %1 fehlgeschlagen.

source: Setting the Access Control List on folder %1 for user %2 failed. The server returned: %3
de: Das Einrichten der Zugriffskontrollliste in Ordner %1 für Benutzer %2 ist fehlgeschlagen. Die Serverantwort lautet: %3

source: Deleting the Access Control List on folder %1 for user %2 failed. The server returned: %3
de: Das Löschen der Zugriffskontrollliste in Ordner %1 für Benutzer %2 ist fehlgeschlagen. Die Serverantwort lautet: %3

source: Retrieving the Access Control List on folder %1 failed. The server returned: %2
de: Das Abholen der Zugriffskontrollliste in Ordner %1 ist fehlgeschlagen. Die Serverantwort lautet: %2

source: Searching of folder %1 failed. The server returned: %2
de: Durchsuchen von Ordner %1 ist fehlgeschlagen. Die Serverantwort lautet: %2

source: Custom command %1:%2 failed. The server returned: %3
de: Benutzerdefinierter Befehl %1:%2 ist fehlgeschlagen. Die Serverantwort lautet: %3

source: Setting the annotation %1 on folder %2 failed. The server returned: %3
de: Das Speichern der Anmerkung %1 in Ordner %2 ist fehlgeschlagen. Die Serverantwort lautet: %3

source: Retrieving the annotation %1 on folder %2 failed. The server returned: %3
de: Das Abholen der Anmerkung %1 in Ordner %2 ist fehlgeschlagen. Die Serverantwort lautet: %3

source: Retrieving the quota root information on folder %1 failed. The server returned: %2
de: Das Abholen der Kontingent-Informationen für Ordner %1 ist fehlgeschlagen. Die Serverantwort lautet: %2

source: Unable to close mailbox.
de: Schließen des Postfachs nicht möglich.

source: Unable to get information about folder %1. The server replied: %2
de: Abholen von Informationen für Ordner %1 nicht möglich. Die Serverantwort lautet: %2

source: The server %1 supports neither IMAP4 nor IMAP4rev1. It identified itself with: %2
de: Der Server %1 unterstützt weder IMAP4 noch IMAP4rev1. Die von ihm ausgegebene Kennung lautet: %2

source: The server does not support TLS. Disable this security feature to connect unencrypted.
de: Der Server unterstützt kein TLS. Deaktivieren Sie diese Sicherheitsfunktion, falls Sie stattdessen eine unverschlüsselte Verbindung aufbauen möchten.

source: Starting TLS failed.
de: TLS-Start ist fehlgeschlagen.

source: The authentication method %1 is not supported by the server.
de: Die Authentifizierungsmethode %1 wird vom Server nicht unterstützt.

source: Username and password for your IMAP account:
de: Benutzername und Passwort für Ihren IMAP-Zugang:

source: Unable to login. Probably the password is wrong. The server %1 replied: %2
de: Anmeldung nicht möglich. Wahrscheinlich ist das Passwort falsch. Antwort des Servers %1: %2

source: Unable to authenticate via %1. The server %2 replied: %3
de: Authentifizierung mit %1 nicht möglich. Antwort des Servers %2: %3

source: Unable to open folder %1. The server replied: %2
de: Öffnen von Ordner %1 nicht möglich. Die Serverantwort lautet: %2
