Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/kdepimlibs/kio_nntp.po
Languages: de

source: Selecting group %1...
de: Gruppe %1 wird ausgewählt ...

source: Downloading article...
de: Artikel wird heruntergeladen ...

source: Invalid special command %1
de: Ungültiger Spezialbefehl %1

source: Sending article...
de: Artikel wird gesendet ...

source: Downloading group list...
de: Gruppenliste wird heruntergeladen ...

source: Looking for new groups...
de: Neue Gruppen werden gesucht ...

source: Downloading group descriptions...
de: Gruppenbeschreibungen werden heruntergeladen ...

source: Could not extract message serial numbers from server response: %1
de: Das Auslesen der Nachrichten-Seriennummern aus der Antwort des Servers ist nicht möglich: %1

source: Downloading new headers...
de: Neue Vorspanndaten werden heruntergeladen ...

source: Could not extract first message id from server response: %1
de: Das Auslesen der ersten Nachrichtenkennung aus der Antwort des Servers ist nicht möglich: %1

source: Could not extract message id from server response: %1
de: Das Auslesen der Nachrichtenkennung aus der Antwort des Servers ist nicht möglich: %1

source: Connecting to server...
de: Verbindung zum Server wird hergestellt ...

source: This server does not support TLS
de: Dieser Server unterstützt kein TLS

source: TLS negotiation failed
de: TLS-Aushandlung fehlgeschlagen

source: The server %1 could not handle your request. Please try again now, or later if the problem persists.
de: Der Server %1 kann Ihre Anfrage nicht bearbeiten. Bitte versuchen Sie es erneut. Falls das Problem bestehen bleibt, versuchen Sie es später noch einmal.

source: You need to authenticate to access the requested resource.
de: Sie müssen sich authentifizieren, um auf die angefragte Ressource zugreifen zu können.

source: The supplied login and/or password are incorrect.
de: Der Benutzername und/oder das Passwort sind falsch.

source: Unexpected server response to %1 command: %2
de: Unerwartete Serverantwort auf %1-Befehl: %2
