Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/kdepimlibs/kio_smtp.po
Languages: de

source: The server rejected both EHLO and HELO commands as unknown or unimplemented. Please contact the server's system administrator.
de: Der Server hat die Befehle EHLO und HELO als unbekannt oder nicht unterstützt zurückgewiesen. Bitte nehmen Sie Kontakt zum Systemverwalter des Servers auf.

source: Unexpected server response to %1 command. %2
de: Unerwartete Server-Antwort auf Befehl %1. %2

source: Your SMTP server does not support TLS. Disable TLS, if you want to connect without encryption.
de: Ihr SMTP-Server unterstützt das TLS-Protokoll nicht. Deaktivieren Sie TLS in den Systemeinstellungen, falls Sie eine unverschlüsselte Verbindung aufbauen möchten (Persönliche Einstellungen -> Verschlüsselung).

source: Your SMTP server claims to support TLS, but negotiation was unsuccessful. You can disable TLS in the SMTP account settings dialog.
de: Der SMTP-Server unterstützt angeblich das TLS-Protokoll, aber ein entsprechender Verbindungsversuch ist fehlgeschlagen. Sie können die Verwendung von TLS im Einrichtungsdialog für Postausgangsserver abschalten.

source: Connection Failed
de: Verbindung fehlgeschlagen

source: An error occurred during authentication: %1
de: Bei der Authentifizierung ist ein Fehler aufgetreten: %1

source: No authentication details supplied.
de: Keine Authentifizierungsdetails bereitgestellt.

source: Choose a different authentication method.
de: Bitte wählen Sie eine andere Authentifizierungsmethode.

source: Your SMTP server does not support %1.
de: Ihr SMTP-Server unterstützt %1 nicht.

source: Your SMTP server does not support (unspecified method).
de: Ihr SMTP-Server unterstützt (nicht spezifizierte Methode) nicht.

source: Your SMTP server does not support authentication. %1
de: Ihr SMTP-Server unterstützt keine Authentifizierung. %1

source: Authentication failed. Most likely the password is wrong. %1
de: Authentifizierung fehlgeschlagen. Wahrscheinlich ist das Passwort nicht korrekt. %1

source: Could not read data from application.
de: Daten des anderen Programms nicht lesbar.

source: The message content was not accepted. %1
de: Der Inhalt der Nachricht wurde nicht akzeptiert. %1

source: The server responded: %1
de: Meldung des Servers: %1

source: The server responded: "%1"
de: Meldung des Servers: %1

source: This is a temporary failure. You may try again later.
de: Das ist ein vorübergehendes Problem. Bitte versuchen Sie es später erneut.

source: The application sent an invalid request.
de: Das Programm sendet eine ungültige Anforderung.

source: The sender address is missing.
de: Die Absenderadresse fehlt.

source: SMTPProtocol::smtp_open failed (%1)
de: SMTPProtocol::smtp_open fehlgeschlagen (%1)

source: Your server (%1) does not support sending of 8-bit messages. Please use base64 or quoted-printable encoding.
de: Ihr Server (%1) unterstützt keinen Versand von 8-Bit-kodierten Nachrichten. Bitte verwenden Sie base64 oder quoted-printable als Kodierung.

source: Writing to socket failed.
de: Schreiben auf den Socket ist fehlgeschlagen.

source: Invalid SMTP response (%1) received.
de: Ungültige SMTP-Antwort empfangen (%1).

source: The server (%1) did not accept the connection. %2
de: Der Server (%1) lehnt die Verbindungsaufnahme ab. %2

source: Username and password for your SMTP account:
de: Benutzername und Passwort für Ihren SMTP-Zugang:

source: The server did not accept a blank sender address. %1
de: Server akzeptiert keine leere Absenderadresse: %1

source: The server did not accept the sender address "%1". %2
de: Der Server akzeptiert die Absenderadresse %1 nicht. %2

source: Message sending failed since the following recipients were rejected by the server: %1
de: Mailversand fehlgeschlagen, da die folgende Empfängeradresse vom Server abgelehnt wurde: %1

source: The attempt to start sending the message content failed. %1
de: Senden der Nachricht fehlgeschlagen. %1

source: Unhandled error condition. Please send a bug report.
de: Nicht behebbare Fehlersituation. Bitte senden Sie uns einen Fehlerbericht.
