Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/kdepimlibs/libkpimutils.po
Languages: de

source: The email address you entered is not valid because it contains more than one @. You will not create valid messages if you do not change your address.
de: Die von Ihnen eingegebene E-Mail-Adresse ist ungültig, da sie mehr als ein @ enthält. Wenn Sie Ihre Adresse nicht ändern, erzeugen Sie fehlerhafte E-Mails.

source: The email address you entered is not valid because it does not contain a @. You will not create valid messages if you do not change your address.
de: Die von Ihnen eingegebene E-Mail-Adresse ist ungültig, da sie kein „@“ enthält. Wenn Sie Ihre Adresse nicht ändern, erzeugen Sie fehlerhafte E-Mails.

source: You have to enter something in the email address field.
de: Das Adressfeld der E-Mail darf nicht leer sein.

source: The email address you entered is not valid because it does not contain a local part.
de: Die von Ihnen eingegebene E-Mail-Adresse ist ungültig, da sie keinen lokalen Teil enthält.

source: The email address you entered is not valid because it does not contain a domain part.
de: Die von Ihnen eingegebene E-Mail-Adresse ist ungültig, da sie keinen Domain-Teil enthält.

source: The email address you entered is not valid because it contains unclosed comments/brackets.
de: Die von Ihnen eingegebene E-Mail-Adresse ist ungültig, da sie nicht abgeschlossene Kommentare/Klammern enthält.

source: The email address you entered is valid.
de: Die von Ihnen eingegebene E-Mail-Adresse ist gültig.

source: The email address you entered is not valid because it contains an unclosed angle bracket.
de: Die von Ihnen eingegebene E-Mail-Adresse ist ungültig, da sie eine nicht abgeschlossene spitze Klammer enthält.

source: The email address you entered is not valid because it contains too many closing angle brackets.
de: Die von Ihnen eingegebene E-Mail-Adresse ist ungültig, da sie zu viele schließende spitze Klammern enthält.

source: The email address you have entered is not valid because it contains an unexpected comma.
de: Die von Ihnen eingegebene E-Mail-Adresse ist ungültig, da sie ein unerwartetes Komma enthält.

source: The email address you entered is not valid because it ended unexpectedly. This probably means you have used an escaping type character like a '\' as the last character in your email address.
de: Die von Ihnen eingegebene E-Mail-Adresse ist ungültig, da sie unerwartet endet. Das rührt möglicherweise daher, dass Sie am Ende der E-Mail-Adresse ein gesondert behandeltes Zeichen wie \ benutzt haben.

source: The email address you entered is not valid because it contains quoted text which does not end.
de: Die von Ihnen eingegebene E-Mail-Adresse ist ungültig, da sie geklammerten Text enthält, dessen Ende nicht gefunden werden kann.

source: The email address you entered is not valid because it does not seem to contain an actual email address, i.e. something of the form joe@example.org.
de: Die von Ihnen eingegebene E-Mail-Adresse ist ungültig, da es sich um keine echte E-Mail-Adresse in der Form wie z. B. joe@example.org zu handeln scheint.

source: The email address you entered is not valid because it contains an illegal character.
de: Die von Ihnen eingegebene E-Mail-Adresse ist ungültig, da sie ein ungültiges Zeichen enthält.

source: The email address you have entered is not valid because it contains an invalid display name.
de: Die von Ihnen eingegebene E-Mail-Adresse ist ungültig, da sie einen ungültigen Klartextnamen enthält.

source: The email address you entered is not valid because it does not contain a '.'. You will not create valid messages if you do not change your address.
de: Die von Ihnen eingegebene E-Mail-Adresse ist ungültig, da sie keinen „.“ enthält. Wenn Sie Ihre Adresse nicht ändern, erzeugen Sie fehlerhafte E-Mails.

source: Unknown problem with email address
de: Nicht näher bestimmbarer Fehler in der E-Mail-Adresse

source: File I/O Error
de: Datei Ein-/Ausgabefehler

source: The specified file does not exist: %1
de: Die angegebene Datei existiert nicht: %1

source: This is a folder and not a file: %1
de: Dies ist ein Ordner, keine Datei: %1

source: You do not have read permissions to the file: %1
de: Sie haben keine Leseberechtigung für diese Datei: %1

source: Could not read file: %1
de: Die Datei kann nicht gelesen werden: %1

source: Could not open file: %1
de: Die Datei kann nicht geöffnet werden: %1

source: Error while reading file: %1
de: Fehler beim Lesen der Datei: %1

source: Could only read 1 byte of %2.
de: Es ist nur 1 von %2 Bytes gelesen worden.

source: File %1 exists. Do you want to replace it?
de: Die Datei %1 existiert bereits. Möchten Sie die bestehende Datei überschreiben?

source: Save to File
de: In eine Datei speichern

source: &Replace
de: &Ersetzen

source: Failed to make a backup copy of %1. Continue anyway?
de: Das Erstellen einer Sicherungskopie von %1 ist fehlgeschlagen. Trotzdem fortfahren?

source: Could not write to file: %1
de: In die Datei kann nicht geschrieben werden: %1

source: Could not open file for writing: %1
de: Die Datei kann nicht zum Schreiben geöffnet werden: %1

source: Error while writing file: %1
de: Fehler beim Schreiben in die Datei: %1

source: Could only write 1 byte of %2.
de: Es ist nur 1 von %2 Bytes geschrieben worden.

source: %1 does not exist
de: %1 existiert nicht

source: %1 is not accessible and that is unchangeable.
de: Auf %1 ist kein Zugriff möglich und kann auch nicht ermöglicht werden.

source: %1 is not readable and that is unchangeable.
de: Auf %1 ist kein Lesezugriff möglich und kann auch nicht ermöglicht werden.

source: %1 is not writable and that is unchangeable.
de: Auf %1 ist kein Schreibzugriff möglich und kann auch nicht ermöglicht werden.

source: Folder %1 is inaccessible.
de: Auf den Ordner %1 ist kein Zugriff möglich.

source: Some files or folders do not have the necessary permissions, please correct them manually.
de: Einige Dateien oder Ordner besitzen nicht die nötigen Berechtigungen, bitte korrigieren Sie dies von Hand.

source: Permissions Check
de: Berechtigungsprüfung
