Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/kdepimlibs/libkresources.po
Languages: de

# NAME OF TRANSLATORS
source: Your names
de: Stephan Johach

# EMAIL OF TRANSLATORS
source: Your emails
de: hunsum@gmx.de

# @title:window
source: Resource Configuration
de: Ressourcen-Einrichtung

# @title:group
source: General Settings
de: Allgemeine Einstellungen

# @option:check if resource is read-only
source: Read-only
de: Nur lesen

# @title:group
source: %1 Resource Settings
de: Ressourcen-Einstellungen zu „%1“

# @info
source: Please enter a resource name.
de: Bitte geben Sie einen Namen für die Ressource ein.

# yes, a standard resource
source: Yes
de: Ja

source: Resource Configuration
de: Ressourcen-Einrichtung

source: Resources
de: Ressourcen

# @title:column resource type
source: Type
de: Typ

source: &Add...
de: &Hinzufügen ...

source: &Remove
de: &Entfernen

source: &Edit...
de: &Bearbeiten ...

source: &Use as Standard
de: &Als Standard verwenden

source: There is no standard resource. Please select one.
de: Es gibt keine Standard-Ressource. Bitte wählen Sie eine aus.

source: Please select type of the new resource:
de: Bitte wählen Sie den Typ der neuen Ressource:

source: Unable to create resource of type '%1'.
de: Es kann keine Ressource vom Typ „%1“ angelegt werden.

source: You cannot remove your standard resource. Please select a new standard resource first.
de: Sie können die Standard-Ressource nicht entfernen. Wählen Sie zunächst eine andere Ressource als Standard aus.

source: You cannot use a read-only resource as standard.
de: Sie können keine Nur-Lesen-Ressource als Standard verwenden.

source: You cannot use an inactive resource as standard.
de: Sie können keine inaktive Ressource als Standard verwenden.

source: You cannot deactivate the standard resource. Choose another standard resource first.
de: Sie können die Standard-Ressource nicht inaktiv setzen. Wählen Sie zuerst eine andere Ressource als Standard.

source: There is no valid standard resource. Please select one which is neither read-only nor inactive.
de: Es gibt keine gültige Standard-Ressource. Bitte wählen Sie eine aktive Ressource, die mehr als Nur-Lese-Zugriff erlaubt.

source: KDE Resources configuration module
de: Einstellungsmodul für KDE-Ressourcen

source: (c) 2003 Tobias Koenig
de: © 2003 Tobias Koenig

source: resource
de: Ressource

source: Resource Selection
de: Ressourcen-Auswahl

source: There is no resource available.
de: Es ist keine Ressource verfügbar.
