Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdeutils/ark.po
Languages: de

source: The &ark; Handbook
de: Das Handbuch zu &ark;

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Gregor</firstname><surname>Zumstein</surname><affiliation><address><email>zumstein@ssd.ethz.ch</email></address></affiliation><contrib>Übersetzung von</contrib></othercredit>

source: &ark; is an archive manager for &kde;.
de: &ark; ist eine Archiv-Verwaltung für &kde;.

source: archive
de: archiv

source: compression
de: komprimierung

source: Introduction
de: Einleitung

source: &ark; is a program for viewing, extracting, creating and modifying archives. &ark; can handle various archive formats such as <command>tar</command>, <command>gzip</command>, <command>bzip2</command>, <command>zip</command>, <command>rar</command>, <command>7zip</command>, <command>xz</command>, <command>rpm</command>, <command>cab</command> and <command>deb</command> (support for certain archive formats depend on the appropriate command-line programs being installed).
de: &ark; ist ein Programm, um den Inhalt von Archiven anzuzeigen, Archive zu erzeugen und zu ändern und Dateien daraus zu entpacken. Das Programm kann mit verschiedensten Formaten wie <command>tar</command>, <command>gzip</command>, <command>bzip2</command>, <command>zip</command>, <command>rar</command>, <command>7z</command>, <command>xz</command>, <command>rpm</command>, <command>cab</command> und <command>deb</command> umgehen, sofern die entsprechenden Befehlszeilenprogramme installiert sind.

source: <screeninfo>&ark;'s main window</screeninfo>
de: <screeninfo>&ark; Hauptfenster</screeninfo>

source: <phrase>&ark;'s main window</phrase>
de: <phrase>&ark; Hauptfenster</phrase>

source: Using &ark;
de: &ark; benutzen

source: Opening Archives
de: Archive öffnen

source: To open an archive in &ark;, choose <guimenuitem>Open...</guimenuitem> (<keycombo action="simul">&Ctrl;<keycap>O</keycap></keycombo>) from the <guimenu>File</guimenu> menu. You can also open archive files by dragging and dropping from &konqueror; or &dolphin;. Archive files should be associated with &ark;, so you can also <mousebutton>right</mousebutton> click a file in &konqueror; or &dolphin; and select <guimenuitem>Open with &ark;</guimenuitem> to open it or select an extract action for this file.
de: Um ein Archiv in &ark; zu öffnen, wählen Sie <guimenuitem>Öffnen ...</guimenuitem> im Menü <guimenu>Datei</guimenu> (<keycombo action="simul">&Ctrl;<keycap>O</keycap></keycombo>). Sie können Archivdateien auch öffnen, indem Sie sie aus dem Dateimanager &konqueror; oder &dolphin; herüberziehen. Normalerweise sind Archivdateien &ark; zugeordnet, sodass Sie einfach mit der <mousebutton>rechten Maustaste</mousebutton> auf eine Datei klicken und dann den Eintrag <guimenuitem>Öffnen mit &ark;</guimenuitem> oder eine andere Aktion zum Entpacken auswählen können.

source: If you have enabled the information panel in the <guimenu>Settings</guimenu> menu additional information about the selected folders or files in the archive is displayed.
de: Wenn Sie die Informationsleiste im Menü <guimenu>Einstellungen</guimenu> eingeschaltet haben, werden zusätzliche Informationen über die ausgewählten Ordner oder Dateien im Archiv angezeigt.

source: Working with Files
de: Arbeiten mit Dateien

source: Once an archive has been opened, you can perform various operations on the files inside the archive. By selecting a file and using the <guimenu>Action</guimenu> menu, you can choose what you want to do:
de: Wenn ein Archiv einmal geöffnet ist, können Sie auf die enthaltenen Dateien verschiedene Funktionen anwenden. Wählen Sie eine Datei und benutzen das Menü <guimenu>Aktion</guimenu>. Folgende Funktionen stehen Ihnen dann zur Auswahl:

source: <guimenuitem>Add File...</guimenuitem> will add files from your disk to the archive.
de: <guimenuitem>Dateien hinzufügen ...</guimenuitem> fügt Dateien von der Festplatte zum Archiv hinzu.

source: <guimenuitem>Add Folder...</guimenuitem> will add folders from your disk to the archive.
de: <guimenuitem>Ordner hinzufügen ...</guimenuitem> fügt Ordner von der Festplatte zum Archiv hinzu.

source: <guimenuitem>Delete</guimenuitem> (<keycap>Del</keycap>) will remove the currently selected file(s) from the archive.
de: <guimenuitem>Löschen</guimenuitem> (<keycap>Entfernen</keycap>) entfernt die ausgewählte(n) Datei(en) aus dem Archiv.

source: <guimenuitem>Extract...</guimenuitem> (<keycombo action="simul">&Ctrl;<keycap>E</keycap></keycombo>) opens a submenu with previously accessed folders, and you can select to quick extract into any of them.
de: <guimenuitem>Entpacken ...</guimenuitem> (<keycombo action="simul">&Ctrl;<keycap>E</keycap></keycombo>) zeigt ein Untermenü mit Ordnern, in die bereits vorher Dateien entpackt wurden, und es kann einer dieser Ordner als Ziel ausgewählt werden.

source: <guimenuitem>Preview</guimenuitem> will open the file in the associated viewer for that file type.
de: <guimenuitem>Vorschau</guimenuitem> zeigt die Datei im standardmäßig zugewiesenen Anzeigeprogramm für diesen Dateityp.

source: Extracting Archives and Removing Files
de: Archive entpacken und Dateien entfernen

source: Once an archive has been opened in &ark;, it can be extracted. To quick extract files from an archive, you can select <guisubmenu>Extract</guisubmenu> from the <guimenu>Action</guimenu> menu. This opens a submenu with previously accessed folders, and you can select to quick extract into any of them. Clicking on the check mark at the right side of the <guibutton>Extract</guibutton> button in the toolbar performes the same action.
de: Ein in &ark; geöffnetes Archiv kann entpackt werden. Um Dateien auf direkten Weg aus einem Archiv auszupacken, müssen Sie <guisubmenu>Entpacken</guisubmenu> im Menü <guimenu>Aktion</guimenu> wählen. Dann wird ein Untermenü mit Ordnern angezeigt, in die bereits vorher Dateien entpackt wurden, und es kann einer dieser Ordner als Ziel ausgewählt werden. Die gleiche Aktion kann durch Klicken auf das Häkchen rechts vom Knopf <guibutton>Entpacken</guibutton> in der Werkzeugleiste ausgeführt werden.

source: To open the <guilabel>Extract</guilabel> dialog click the <guibutton>Extract</guibutton> button in the toolbar or use the shortcut <keycombo action="simul">&Ctrl; <keycap>E</keycap></keycombo>. This dialog allows you to select where you will extract files to. The default location is the folder the archive is in.
de: Um den Dialog <guilabel>Entpacken</guilabel> zu öffnen, klicken Sie auf den Knopf <guibutton>Entpacken</guibutton> in der Werkzeugleiste oder verwenden Sie den Kurzbefehl <keycombo action="simul">&Ctrl; <keycap>E</keycap></keycombo>. In diesem Dialog kann ausgewählt werden, wohin die Dateien ausgepackt werden. Als Speicherort wird der Ordner vorgegeben, aus dem das Archiv geladen wurde.

source: You can specify to extract the files into a subfolder. The default name of this subfolder is the first part of the archive name, but you can edit it to your needs. If you want to preserve paths when extracting, select this option. You may also choose to open the destination folder in &konqueror; or &dolphin; or close &ark; once the extraction is complete.
de: Es kann ein Unterordner zum Entpacken eingegeben werden. Als Voreinstellung wird der erste Teil des Archivnamens eingetragen, dieser Name kann dann im Eingabefeld geändert werden. Außerdem kann eingestellt werden, ob die Pfade beim Entpacken beibehalten werden und ob der Zielordner nach dem Entpacken im Dateiverwaltungsprogramm geöffnet und &ark; geschlossen wird, wenn das Entpacken beendet ist.

source: If a file in the archive list is highlighted, you can also select which files to extract:
de: Wenn eine oder mehrere Dateien im Archiv markiert sind, können Sie auswählen, welche Dateien entpackt werden sollen:

source: <guimenuitem>Selected files only</guimenuitem> extracts only the files which have been selected.
de: <guimenuitem>Nur ausgewählte Dateien</guimenuitem> entpackt nur die ausgewählten Dateien.

source: <guimenuitem>All files</guimenuitem> extracts the entire contents of the archive.
de: <guimenuitem>Alle Dateien</guimenuitem> entpackt den Inhalt des ganzen Archivs.

source: To extract a single file from an archive, click on the filename and drag it to the target folder
de: Um eine einzelne Datei aus einem Archiv zu entpacken, klicken Sie auf den Dateinamen und ziehen Sie die Datei in den Zielordner.

source: Extracting files from an archive does not change the archive and its contents. Use <menuchoice><guimenu>Action</guimenu><guimenuitem>Delete</guimenuitem></menuchoice> (<keysym>Del</keysym>) for this task.
de: Das Entpacken von Dateien aus einem Archiv lässt das Archiv und seinen Inhalt unverändert. Benutzen Sie <menuchoice><guimenu>Aktion</guimenu><guimenuitem>Löschen</guimenuitem></menuchoice> (<keysym>Entf</keysym>), um Dateien aus Archiven zu entfernen.

source: Creating Archives and Adding Files
de: Erzeugen von Archiven und Hinzufügen von Dateien

source: To create a new archive in &ark;, choose <guimenuitem>New</guimenuitem> from the <guimenu>File</guimenu> menu.
de: Um mit &ark; ein neues Archiv zu erzeugen, wählen Sie <guimenu>Datei</guimenu>-><guimenuitem>Neu</guimenuitem>.

source: You can then type the name of the archive, with the appropriate extension (<literal role="extension">tar.gz</literal>, <literal role="extension">zip</literal>, <literal role="extension">bz2</literal> &etc;) or select a supported format in the <guilabel>Filter</guilabel> combo box and check the <guilabel>Automatically select filename extension</guilabel> option. To add files to the archive, choose <guimenuitem>Add File...</guimenuitem> from the <guimenu>Action</guimenu> menu. If you want to add an entire folder to an archive, choose <guimenuitem>Add Folder...</guimenuitem> from the <guimenu>Action</guimenu> menu.
de: Hier geben Sie den Dateinamen an, sowie die Erweiterung für das gewünschte Archivformat (<literal role="extension">tar.gz</literal>, <literal role="extension">zip</literal>, <literal role="extension">bz2</literal> &etc;). Alternativ wählen Sie im Kombinationsfeld <guilabel>Filter</guilabel> ein unterstütztes Archivformat aus und kreuzen <guilabel>Dateierweiterung automatisch auswählen</guilabel> an. Um einem Archiv einzelne Dateien hinzuzufügen, wählen Sie <guimenu>Aktion</guimenu>-><guimenuitem>Dateien hinzufügen ...</guimenuitem>. Möchten Sie gleich ganze Ordner hinzufügen, wählen Sie <guimenu>Aktion</guimenu>-><guimenuitem>Ordner hinzufügen ...</guimenuitem>.

source: An alternative way to add files to the archive is to drag one or more files from &konqueror;, &dolphin; or the desktop into the main &ark; window, and it will be added to the current archive.
de: Um zu einem Archiv weitere Dateien hinzuzufügen, können Sie diese auch aus einem &konqueror;- oder &dolphin;-Fenster bzw. von der Arbeitsfläche auf das Hauptfenster von &ark; herüberziehen.

source: Using &ark; in the Filemanager
de: &ark; im Dateimanager benutzen

source: Clicking with the &RMB; on an archive in a filemanager like &dolphin; or &konqueror; displays a context menu with an item <guimenuitem>Open with Ark</guimenuitem>. The menu has these additional items to extract an archive using &ark;:
de: Klicken Sie mit der &RMBn; im einem Dateimanager wie &dolphin; oder &konqueror; auf ein Archiv, wird ein Kontextmenü mit einem Eintrag <guimenuitem>Mit Ark öffnen</guimenuitem> angezeigt. Dieses Kontextmenü hat noch zusätzliche Aktionen zum Entpacken eines Archivs mit &ark;:

source: <guimenuitem>Extract Archive Here, Autodetect Subfolder</guimenuitem> creates a subfolder in the folder with the archive and extracts the folders and files into it.
de: <guimenuitem>Archiv hierher auspacken, Unterordner selbständig ermitteln</guimenuitem> erzeugt im Ordner, in dem sich das Archiv befindet, einen Unterordner und entpackt die Ordner und Dateien aus dem Archiv dorthin.

source: <guimenuitem>Extract Archive To...</guimenuitem> works like in &ark;.
de: <guimenuitem>Archiv auspacken nach ...</guimenuitem> funktioniert wie in &ark;.

source: <guimenuitem>Extract Archive Here</guimenuitem> extracts the content of the archive into same folder.
de: <guimenuitem>Hierher entpacken</guimenuitem> entpackt den Inhalt des Archivs in denselben Ordner.

source: &dolphin;'s or &konqueror;'s context menu for a selection displays these actions in the <guimenu>Compress</guimenu> submenu:
de: Das Kontextmenü von &dolphin; oder &konqueror; für eine Auswahl von Dateien oder Ordnern enthält folgende Aktionen im Untermenü <guimenu>Komprimieren</guimenu>:

source: <guimenuitem>Here</guimenuitem> creates a Tar archive (gzip-compressed) in the current folder with the extension <filename class="extension">.tar.gz</filename>.
de: <guimenuitem>Hier</guimenuitem> erzeugt ein Tar-Archiv (mit gzip komprimiert) im aktuellen Ordner mit der Dateierweiterung <filename class="extension">.tar.gz</filename>.

source: <guimenuitem>As ZIP Archive</guimenuitem>, <guimenuitem>As RAR Archive</guimenuitem> or <guimenuitem>As ZIP/TAR Archive</guimenuitem> creates these archive types in the current folder.
de: <guimenuitem>Als ZIP-Archiv</guimenuitem>, <guimenuitem>Als RAR-Archiv</guimenuitem> oder <guimenuitem>Als ZIP/TAR-Archiv</guimenuitem> erstellt diese Archive im aktuellen Ordner.

source: <guimenuitem>Compress To...</guimenuitem> opens a dialog where you can select folder, name and archive type.
de: <guimenuitem>Komprimieren nach ...</guimenuitem> öffnet einen Dialog, in dem Sie den Ordner, den Namen und den Archivtyp einstellen können.

source: Advanced Batch Mode
de: Erweiterter Stapelverarbeitungsmodus

source: &ark; has an advanced batch mode to manage archives without launching a &GUI; interface. This mode allows you to extract or create archives and add files to them.
de: &ark; kann auch ohne grafische Benutzeroberfläche im erweiterten Stapelverarbeitungsmodus Archive verwalten. In diesem Modus können Sie Archive entpacken oder erstellen und Dateien zu einem Archiv hinzufügen.

source: The batch mode is documented in <ulink url="man:/ark">&ark;'s man page</ulink>.
de: Informationen zur Stapelverarbeitung finden Sie im <ulink url="man:/ark">Unix Handbuch zu &ark;</ulink>.

source: Credits and License
de: Danksagungen und Lizenz

source: &ark; is Copyright &copy; 1997-2008, The Various &ark; Developers
de: &ark; &copy; Copyright 1997-2008, die verschiedenen &ark;-Entwickler

source: Authors:
de: Beiträge von:

source: Corel Corporation (author: Emily Ezust) <email>emilye@corel.com</email>
de: Corel Corporation (Entwicklerin: Emily Ezust) <email>emilye@corel.com</email>

source: Corel Corporation (author: Michael Jarrett) <email>michaelj@corel.com</email>
de: Corel Corporation (Entwickler Michael Jarrett) <email>michaelj@corel.com</email>

source: Documentation Copyright &copy; 2000 &Matt.Johnston; &Matt.Johnston.mail;
de: Copyright &copy; für die Dokumentation 2000 &Matt.Johnston; &Matt.Johnston.mail;

source: Documentation updated for &kde; 3.3 by Henrique Pinto <email>henrique.pinto@kdemail.net</email>.
de: Die Dokumentation wurde für &kde; 3.3 von Henrique Pinto <email>henrique.pinto@kdemail.net</email> aktualisiert.

source: CREDIT_FOR_TRANSLATORS
de: <para>Übersetzung Gregor Zumstein <email>zumstein@ssd.ethz.ch</email></para>

source: How to obtain &ark;
de: Woher Sie &ark; erhalten

source: Requirements
de: Voraussetzungen

source: In order to successfully use &ark;, you need &kde; 4. &GNU; <command>tar</command> and a recent <command>gzip</command> are also needed if you want &ark; to handle tar archives. To handle other file formats, you need the appropriate command line programs, such as <command>bzip2</command>, <command>zip</command>, <command>unzip</command>, <command>ar</command>, <command>rar</command>, <command>7zip</command>, <command>xz</command>, <command>rpm</command>, <command>cab</command> and <command>deb</command>.
de: Um &ark; benutzen zu können, benötigen Sie &kde; 4. &GNU; <command>tar</command> und ein aktuelles <command>gzip</command> werden benötigt, um mit tar-Archiven umzugehen. Um andere Archivformate zu nutzen, benötigen Sie die entsprechenden Befehlszeilenprogramme wie <command>bzip2</command>, <command>zip</command>, <command>unzip</command>, <command>ar</command>, <command>rar</command>, <command>7z</command>, <command>xz</command>, <command>rpm</command>, <command>cab</command> und <command>deb</command>.

source: Compilation and Installation
de: Kompilierung und Installation
