Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdeutils/ark_man-ark.1.po
Languages: de

source: &kde; User's Manual
de: &kde;-Benutzerhandbuch

source: Initial version of &ark; man page.
de: Ursprüngliche Version der &ark;-Handbuchseite

source: Update &ark; man page.
de: Aktualisierung der &ark;-Handbuchseite

source: &kde; archiving tool
de: &kde;-Archivprogramm

source: <command>ark</command> <group choice="opt"><option>-b</option></group> <group choice="opt"><option>-a</option></group> <group choice="opt"><option>-e</option></group> <group choice="opt"><option>-c</option></group> <group choice="opt"><option>-f</option> <replaceable> suffix</replaceable></group> <group choice="opt"><option>-p</option></group> <group choice="opt"><option>-t</option> <replaceable> file</replaceable></group> <group choice="opt"><option>-d</option></group> <group choice="opt"><option>-o</option> <replaceable> directory</replaceable></group> <arg choice="opt">&kde; Generic Options</arg> <arg choice="opt">&Qt; Generic Options</arg>
de: <command>ark</command> <group choice="opt"><option>-b</option></group> <group choice="opt"><option>-a</option></group> <group choice="opt"><option>-e</option></group> <group choice="opt"><option>-c</option></group> <group choice="opt"><option>-f</option> <replaceable> erweiterung</replaceable></group> <group choice="opt"><option>-p</option></group> <group choice="opt"><option>-t</option> <replaceable> datei</replaceable></group> <group choice="opt"><option>-d</option></group> <group choice="opt"><option>-o</option> <replaceable> ordner</replaceable></group> <arg choice="opt">Allgemeine &kde;-Optionen</arg> <arg choice="opt">Allgemeine &Qt;-Option</arg>

source: Description
de: Beschreibung

source: &ark; is a program for managing various compressed file formats within &kde;. Archives can be viewed, extracted, created and modified with &ark;. The program can handle various formats such as <application>tar</application>, <application>gzip</application>, <application>bzip2</application>, <application>zip</application>, <application>rar</application> (when the appropriate libraries or command-line programs are installed).
de: &ark; ist ein Programm zur Verwaltung verschiedener komprimierter Archivformate in &kde;. Mit &ark; können Archive angezeigt, ausgepackt, erzeugt und bearbeitet werden. Das Programm beherrscht verschiedene Format wie <application>tar</application>, <application>gzip</application>, <application>bzip2</application>, <application>zip</application> und <application>rar</application>. Hierzu müssen die entsprechenden Befehlszeilenprogramme installiert sein.

source: Operation modes
de: Arbeitsmodi

source: &ark; can be used either as a stand-alone &GUI; program as well as a command-line program in order to perform some specific tasks.
de: &ark; kann sowohl als eigenständiges Programm mit grafischer Benutzeroberfläche wie auch als Befehlszeilenprogramm für bestimmte Aufgaben eingesetzt werden.

source: If invoked without the -b (--batch) or -c (--add) options, &ark; is started as a normal &GUI; program.
de: Wird &ark; ohne die Optionen -b (--batch) or -c (--add) aufgerufen, started es mit der grafischen Benutzeroberfläche.

source: When the -b (--batch) option is used, &ark; can be used to extract the contents of one or more files directly from the command-line, without launching its &GUI;.
de: Mit der Option -b (--batch) kann &ark; verwendet werden, um den Inhalt von einer oder mehrerer Dateien direkt von der Befehlszeile aus zu extrahieren, ohne dazu die grafische Benutzeroberfläche zu starten.

source: When the -c (--add) option is used, &ark; prompts for files that should be added to a new archive or to an existing archive.
de: Wird die Option -c (--add) benutzt, fragt &ark; nach den Dateien, die zum neuen Archiv oder zu einem vorhandenen Archiv hinzugefügt werden sollen.

source: Options
de: Aufrufparameter

source: Show a dialog for specifying the options for a batch or add operation.
de: Zeigt einen Dialog für die Angabe von Einstellungen für eine Stapelverarbeitung oder das Hinzufügen an.

source: -o, --destination <replaceable>directory</replaceable>
de: -o, --destination <replaceable>ordner</replaceable>

source: Default the extraction directory to <replaceable>directory</replaceable>. If not passed, the current path is used.
de: Zielordner für das Entpacken nach <replaceable>ordner</replaceable>. Ohne diese Option wird der aktuelle Ordner verwendet.

source: Options for adding files
de: Einstellungen für das Hinzufügen von Dateien

source: Query the user for an archive filename and add specified files to it. Quit when finished.
de: Fragt den Benutzer nach einem Archivnamen und fügt die angegebenen Dateien hinzu. &ark; wird beendet, wenn die Aktion abgeschlossen ist.

source: -t, --add-to <replaceable>filename</replaceable>
de: -t, --add-to <replaceable>dateiname</replaceable>

source: Add the specified files to <replaceable>filename</replaceable>. Create archive if it does not exist. Quit when finished.
de: Die angegebenen Dateien zu <replaceable>dateiname</replaceable> hinzufügen. Erzeugt ein neues Archiv, falls noch keines mit diesem Namen existiert. &ark; wird beendet, wenn die Aktion abgeschlossen ist.

source: Change the current directory to the first entry and add all other entries relative to this one.
de: Aktuellen Ordner gemäß erstem Eintrag ändern und alle anderen Einträge relativ dazu hinzufügen.

source: -f, --autofilename <replaceable>suffix</replaceable>
de: -f, --autofilename <replaceable>erweiterung</replaceable>

source: Automatically choose a filename, with the selected <replaceable>suffix</replaceable> (for example rar, tar.gz, zip or any other supported types).
de: Automatisch einen Dateinamen mit der angegeben Datei<replaceable>erweiterung</replaceable> (&eg; rar, tar.gz, zip oder ein andere unterstützter Typ) wählen.

source: Options for batch extraction
de: Einstellungen für das Entpacken mittels Stapelverarbeitung

source: Use the batch interface instead of the usual dialog. This option is implied if more than one url is specified.
de: Die Stapelverarbeitungsschnittstelle anstelle des normalen Dialogs verwenden. Diese Einstellung wird angenommen, wenn mehr als eine Adresse angegeben wird.

source: The destination argument will be set to the path of the first file supplied.
de: Das Ziel wird auf den Pfad der ersten angegebenen Datei gesetzt.

source: Archive contents will be read, and if detected to not be a single folder archive, a subfolder by the name of the archive will be created.
de: Der Archivinhalt wird gelesen. Falls es sich um ein Archiv mit mehr als einem Ordner handelt, wird ein Unterordner mit dem Namen des Archivs erstellt.

source: Examples
de: Beispiele

source: Will extract <replaceable>archive.tar.bz2</replaceable> into the current directory without showing any &GUI;.
de: Entpackt das Archiv <replaceable>archive.tar.bz2</replaceable> in den aktuellen Ordner, ohne die grafische Benutzeroberfläche zu starten.

source: Will first show an extraction options dialog and then extract both <replaceable>archive.tar.bz2</replaceable> and <replaceable>archive2.zip</replaceable> into the directory chosen in the dialog.
de: Zuerst wird ein Dialog mit Optionen zum Entpacken angezeigt, dann werden beide Archive <replaceable>archive.tar.bz2</replaceable> und <replaceable>archive2.zip</replaceable> in den Ordner entpackt, der im Dialog ausgewählt wurde.

source: <command>ark</command> <option>--add-to</option> <replaceable>my-archive.zip</replaceable> <replaceable>photo1.jpg</replaceable> <replaceable>text.txt</replaceable>
de: <command>ark</command> <option>--add-to</option> <replaceable>mein-archiv.zip</replaceable> <replaceable>photo1.jpg</replaceable> <replaceable>text.txt</replaceable>

source: Will create <replaceable>my-archive.zip</replaceable> if does not exist and then add <replaceable>photo1.jpg</replaceable> and <replaceable>text.txt</replaceable> to it.
de: Erstellt <replaceable>mein-archiv.zip</replaceable>, sofern dieses Archiv noch nicht existiert und fügt dann <replaceable>photo1.jpg</replaceable> und <replaceable>text.txt</replaceable> hinzu.

source: Authors
de: Autoren

source: &ark; is currently maintained by &Harald.Hvaal; &Harald.Hvaal.mail; and &Raphael.Kubo.da.Costa; &Raphael.Kubo.da.Costa.mail;.
de: &Harald.Hvaal; &Harald.Hvaal.mail; und &Raphael.Kubo.da.Costa; &Raphael.Kubo.da.Costa.mail; sind zurzeit die Betreuer von &ark;.

source: This man page was first written by &Lauri.Watts; &Lauri.Watts.mail; in 2005 for &kde; 3.4, and was later updated in 2009 by &Raphael.Kubo.da.Costa; &Raphael.Kubo.da.Costa.mail;.
de: Diese Handbuchseite wurde von &Lauri.Watts;&Lauri.Watts.mail; für &kde; 3.4 geschrieben und wurde 2009 durch &Raphael.Kubo.da.Costa; &Raphael.Kubo.da.Costa.mail;. überarbeitet.
