Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdeutils/filelight.po
Languages: de

source: The &filelight; Handbook
de: Das Handbuch zu &filelight;

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Felix</firstname><surname>Schweighofer</surname><affiliation><address><email>felix.schweighofer@googlemail.com</email></address></affiliation><contrib>Übersetzung</contrib></othercredit>

source: &filelight; creates an interactive map of concentric segmented-rings that helps visualize disk usage on your computer.
de: &filelight; zeigt Diagramme aus konzentrischen Ringen an, die die Belegung von Speichermedien auf ihrem Rechner darstellen.

source: disk usage
de: Festplattenbelegung

source: Introduction
de: Einführung

source: &filelight; 1.20 Screenshot
de: Bildschirmfoto &filelight; 1.20

source: Screenshot
de: Bildschirmfoto

source: &filelight; allows you to quickly understand exactly where your diskspace is being used by graphically representing your file system as a set of concentric segmented-rings. You can use it to locate hotspots of disk usage and then manipulate those areas using &konqueror;.
de: &filelight; ermöglicht Ihnen einen schnellen Überblick über den Speicherbedarf der Dateien und Ordner auf Ihrem Rechner, indem es das Dateisystem mit konzentrischen Ringsegmenten abbildet. Damit können Sie Dateien und Ordner mit hohem Speicherbedarf ausfindig machen, um diese anschließend beispielsweise mit &konqueror; zu bearbeiten.

source: Configuring &filelight;
de: &filelight; einrichten

source: The &filelight; settings dialog has two tabs for configuring the &filelight; options. The two tabs are <guilabel>Scanning</guilabel> and <guilabel>Appearance</guilabel>. Below is a description of the settings tabs. The &filelight; settings dialog can be found by clicking <menuchoice><guimenu>Settings</guimenu><guimenuitem>Configure Filelight</guimenuitem></menuchoice>.
de: Der Einrichtungsdialog von &filelight; besteht aus zwei Karteikarten, <guilabel>Einlesen</guilabel> und <guilabel>Erscheinungsbild</guilabel>, auf denen Sie Einstellungen vornehmen können. Im Folgenden werden diese Karteikarten erläutert. Zum Öffnen des Einrichtungsdialogs klicken Sie auf den Eintrag <menuchoice><guimenu>Einstellungen</guimenu><guimenuitem>&filelight; einrichten ...</guimenuitem></menuchoice>.

source: Scanning
de: Einlesen

source: Scanning Screenshot
de: Bildschirmfoto der Karteikarte „Einlesen“

source: The scanning tab allows you to configure how &filelight; scans folders. The <guilabel> Do not scan these folders</guilabel> is used to exclude certain folders from your scan. This option is very useful for skipping folders that you may not have permissions to read, or folders that are part of a virtual filesystem, such as /proc. To add a folder to the list, click the <guibutton>Add...</guibutton> button, this will start a dialog where you can choose the folder of your choice from a tree view. To remove a folder simply select the folder of your choice and click the <guibutton>Remove</guibutton> button.
de: Auf der Karteikarte „Einlesen“ können Sie Optionen zum Einlesen von Ordnern in &filelight; festlegen. In der Liste der <guilabel>Ausgeschlossenen Ordner</guilabel> können Sie einstellen, welche Ordner beim Einlesen ignoriert werden. Dies ist nützlich, um Ordner zu überspringen, auf die Sie keinen Lesezugriff haben oder die zu einem virtuellen Dateisystem, wie z. B. /proc gehören. Verwenden Sie die Knöpfe <guibutton>Hinzufügen ...</guibutton> bzw. <guibutton>Entfernen</guibutton> um Ordner mithilfe eines Dateiauswahldialogs zur Liste hinzuzufügen oder ausgewählte Ordner aus ihr zu entfernen.

source: Using <guilabel>Scan across filesystem boundaries</guilabel> allows scans to enter folders that are part of other filesystems. For example, when unchecked, this will usually prevent the contents of <filename class="directory">/mnt</filename> from being scanned if you scan starting from the root folder <filename class="directory">/</filename>. A scan of remote filesystems, &eg; NFS or Samba mounts, can generate high network traffic. To prevent scanning them check <guilabel>Exclude remote filesystems</guilabel>. The next option <guilabel>Exclude removable media</guilabel> prevents &filelight; from scanning removable media (&eg; &CD-ROM;s).
de: Die Option <guilabel>Über Dateisystemgrenzen hinaus einlesen</guilabel> ermöglicht das Einlesen von Ordnern, die zu anderen Dateisystemen gehören. Beispielsweise wird im Normalfall der Inhalt des Ordners <filename class="directory">/mnt</filename> nicht eingelesen, wenn &filelight; den Basisordner <filename class="directory">/</filename> einliest. Das Einlesen entfernter Dateisysteme über NFS oder Samba kann eine hohe Netzwerkauslastung verursachen. Um das Einlesen solcher Dateisysteme zu verhindern, aktivieren Sie das Ankreuzfeld <guilabel>Netzwerk-Dateisysteme ausschließen</guilabel>. Die Option <guilabel>Wechselmedien ausschließen</guilabel> verhindert das Einlesen von Wechselmedien wie z. B. &CD-ROM;s.

source: Appearance
de: Erscheinungsbild

source: Appearance Screenshot
de: Bildschirmfoto „Erscheinungsbild“

source: The <guilabel>Appearance</guilabel> tab allows you to configure the way &filelight; looks.
de: Auf der Karteikarte <guilabel>Erscheinungsbild</guilabel> können Sie das Aussehen von &filelight; anpassen.

source: The <guilabel>Color scheme</guilabel> section is used to choose a color scheme for &filelight;. The color schemes are <guilabel>Rainbow</guilabel>, <guilabel>System Colors</guilabel>, and <guilabel>High Contrast</guilabel>. There is also a <guilabel>Contrast</guilabel> slider to adjust the contrast of the ring segments for easier viewing.
de: Im Bereich <guilabel>Farbschema</guilabel> können Sie ein Farbschema für &filelight; festlegen. Sie können zwischen <guilabel>Regenbogen</guilabel>, <guilabel>Systemfarben</guilabel> und <guilabel>Hoher Kontrast</guilabel> wählen. Mit dem Schieberegler <guilabel>Kontrast</guilabel> können Sie den Kontrast der Ringsegmente anpassen, um die Unterscheidung der Farben zu erleichtern.

source: The <guilabel>Use anti-aliasing</guilabel> check box is used to enable the use of anti-aliasing in the &filelight; view. Selected, this option makes the ring segments have a much cleaner look.
de: Aktivieren Sie das Ankreuzfeld <guilabel>Kantenglättung</guilabel>, um die Kantenglättung für &filelight; zu aktivieren. Dadurch werden die Ringsegmente in Diagrammen deutlich klarer dargestellt.

source: The <guilabel>Vary label font sizes</guilabel> check box is useful when you have files or folders with long names. This option will change the size of the font to allow it to fit in the view better. When this option is enabled a <guilabel>Minimum font size</guilabel> spinbox becomes available for choosing the smallest size font to scale to.
de: Falls Sie Dateien oder Ordner mit langen Namen besitzen, kann die Option <guilabel>Angepasste Schriftgröße für Beschriftungen</guilabel> nützlich sein. Ist diese aktiviert, wird die Schriftgröße an den Platz angepasst, der für die Anzeige zur Verfügung steht. Im Auswahlfeld <guilabel>Minimale Schriftgröße</guilabel> können Sie festlegen, wie groß die Beschriftungen mindestens angezeigt werden.

source: The <guilabel>Show small files</guilabel> option is disabled by default as small files tend to clutter the &filelight; view. Enable this option if you would like to have your small files included in the &filelight; view. These files are merged all into a single <quote>multi-segment</quote>.
de: Die Option <guilabel>Kleine Dateien anzeigen</guilabel> ist standardmäßig deaktiviert, da die Anzeige durch kleine Dateien leicht unübersichtlich wird. Aktivieren Sie das Ankreuzfeld, um im Diagramm ein <quote>gemeinsames Ringsegment</quote> für alle kleinen Dateien anzuzeigen.

source: Using &filelight;
de: &filelight; benutzen

source: Starting &filelight;
de: &filelight; starten

source: &filelight; can be started from the K-Menu, or from the command-line
de: &filelight; kann aus dem K-Menü oder von der Befehlszeile gestartet werden

source: From the K-Menu
de: Aus dem K-Menü

source: Open the &kde; program menu by clicking on the <guiicon>big K</guiicon> icon on your panel. This will raise the <guimenu>program menu</guimenu>. Move your cursor up the menu to the <guimenu>Utilities</guimenu> menu item. Choose <guimenuitem>&filelight;</guimenuitem>.
de: Öffnen Sie den &kde;-<guimenu>Anwendungsstarter</guimenu> indem Sie auf das <guiicon>große K</guiicon> in der Kontrollleiste klicken. Klicken Sie im Menü <guimenu>Dienstprogramme</guimenu> auf den Eintrag <guimenuitem>&filelight;</guimenuitem>.

source: From the Command Line
de: Von der Befehlszeile

source: You can start &filelight; by typing its name on the command line. If you give it a folder name, as in the example below, it will scan that folder.
de: Sie können &filelight; auch starten, indem Sie den Programmnamen in einer Befehlszeile eingeben. Wenn Sie, wie im folgenden Beispiel, einen Ordnernamen als Argument eingeben, wird der entsprechende Ordner eingelesen.

source: Scanning folders
de: Ordner einlesen

source: Scanning a folder shows it's contents as a filemap. To scan a folder, use the scan menu, or type a &URL; straight into the location bar.
de: Beim Einlesen eines Ordners wird sein Inhalt als Diagramm dargestellt. Um einen Ordner einzulesen, verwenden Sie das Menü <guilabel>Einlesen</guilabel> oder geben Sie einen Pfad (&URL;) direkt in die Adressleiste ein.

source: Exploring Filemaps
de: Verwendung von Ordner-Diagrammen

source: Once a scan has completed you will be presented with a filemap that represents the folder you scanned. The filemap is a series of segmented-rings that expand from the center. Brightly colored segments are folders, gray segments are files. Segments are sized in proportion to their filesize. Segments can be nested, so for example, <filename class="directory">/home/mxcl</filename> will be one level outwards and within the bounds of the segment representing <filename class="directory">/home</filename>. Segments are labeled and hovering the mouse over segments will give you more details of that segment and its child segments.
de: Nach dem Einlesen eines Ordners wird ein Diagramm angezeigt, das den Inhalt des Ordners darstellt. Das Diagramm besteht aus unterteilten Ringen, die sich von der Mitte nach außen ausbreiten. Ordner werden farbig dargestellt, Dateien grau. Die Größe der Ringsegmente ergibt sich aus der Größe der entsprechenden Dateien. Die Segmente können verschachtelt sein. Beispielsweise wird <filename class="directory">/home/mxcl</filename> eine Ebene weiter außen angezeigt als <filename class="directory">/home</filename> und einen Winkel einnehmen, der höchstens so groß ist wie der des Ringsegments für <filename class="directory">/home</filename>, da <filename class="directory">/home/mxcl</filename> ein Unterordner von <filename class="directory">/home</filename> ist und damit nicht größer als <filename class="directory">/home</filename> sein kann. Die Segmente sind beschriftet und beim Überfahren mit der Maus werden detailliertere Informationen angezeigt.

source: Filemap Screenshot
de: Bildschirmfoto eines Ordner-Diagramms

source: You can open folders with your default file manager or &konsole; using the context menu for that segment. A &MMB; click opens files by mimetype, &eg; images with <application>Gwenview</application>. You can right click a segment to get a context menu for the scanned folder with actions to copy the folder path to the clipboard or delete the folder or file. Left clicking segments will re-center the map on that segment.
de: Sie können Ordner mit der Standardanwendung zur Dateiverwaltung oder &konsole; öffnen, indem Sie den entsprechenden Eintrag im Kontextmenü des Ringsegments anklicken. Ein Klick mit der &MMBn; öffnet Dateien mit einer Anwendung, die dem entsprechenden Mime-Typ zugeordnet ist, z. B. Bilder mit <application>Gwenview</application>. Klicken Sie mit der &RMBn; auf ein Segment, um ein Kontextmenü zu öffnen. Dort finden Sie Einträge zum Kopieren des Pfades in die Zwischenablage sowie zum Löschen des Ordners bzw. der Datei. Klicken Sie mit der &LMBn; auf ein Ringsegment, um die Ansicht darauf zu zentrieren.

source: Menu and Command Reference
de: Menü- und Befehlsreferenz

source: The Scan Menu
de: Das Menü Einlesen

source: <guimenu>Scan</guimenu> <guimenuitem>Scan folder..</guimenuitem>
de: <guimenu>Einlesen</guimenu> <guimenuitem>Ordner einlesen</guimenuitem>

source: Offers a folder selection dialog so you can choose a folder to scan.
de: Öffnet einen Dialog, in dem Sie einen Ordner zum Einlesen auswählen können.

source: <shortcut> <keycombo action="simul">&Ctrl;<keysym>Home</keysym></keycombo> </shortcut> <guimenu>Scan</guimenu> <guimenuitem>Scan Home folder</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keysym>Pos1</keysym></keycombo> </shortcut> <guimenu>Einlesen</guimenu> <guimenuitem>Persönlichen Ordner einlesen</guimenuitem>

source: Starts a scan of the user's home folder.
de: Liest Ihren Persönlichen Ordner ein.

source: <guimenu>Scan</guimenu> <guimenuitem>Scan Root folder</guimenuitem>
de: <guimenu>Einlesen</guimenu> <guimenuitem>Basisordner einlesen</guimenuitem>

source: Starts a scan of the root folder.
de: Liest den Basisordner ein.

source: <shortcut> <keycap>F5</keycap> </shortcut> <guimenu>Scan</guimenu> <guimenuitem>Rescan</guimenuitem>
de: <shortcut> <keycap>F5</keycap> </shortcut> <guimenu>Einlesen</guimenu> <guimenuitem>Erneut einlesen</guimenuitem>

source: Starts a new scan of the current working folder, this is useful when changes have been made to the filesystem.
de: Liest den aktuellen Ordner neu ein. Dies ist sinnvoll, wenn Änderungen im Dateisystem vorgenommen wurden, wie z. B. das Löschen von Dateien.

source: <shortcut> &Esc; </shortcut> <guimenu>Scan</guimenu> <guimenuitem>Stop</guimenuitem>
de: <shortcut> &Esc; </shortcut> <guimenu>Einlesen</guimenu> <guimenuitem>Anhalten</guimenuitem>

source: Stops the current scan.
de: Bricht das Einlesen ab.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo> </shortcut> <guimenu>Scan</guimenu> <guimenuitem>Quit</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo> </shortcut> <guimenu>Einlesen</guimenu> <guimenuitem>Beenden</guimenuitem>

source: Quits &filelight;.
de: Beendet &filelight;.

source: The View Menu
de: Das Menü <quote>Ansicht</quote>

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>+</keycap></keycombo> </shortcut> <guimenu>View</guimenu> <guimenuitem>Zoom In</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>+</keycap></keycombo></shortcut> <guimenu>Ansicht</guimenu> <guimenuitem>Vergrößern</guimenuitem>

source: Increase the view of the filemap.
de: Vergrößert die Ansicht.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>-</keycap></keycombo> </shortcut> <guimenu>View</guimenu> <guimenuitem>Zoom Out</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>-</keycap></keycombo> </shortcut> <guimenu>Ansicht</guimenu> <guimenuitem>Verkleinern</guimenuitem>

source: Decrease the view of the filemap.
de: Verkleinert die Ansicht.

source: The Go Menu
de: Das Menü <quote>Gehe zu</quote>

source: <shortcut> <keycombo action="simul">&Alt;<keycap>Up</keycap></keycombo> </shortcut> <guimenu>Go</guimenu> <guimenuitem>Up</guimenuitem>
de: <shortcut> <keycombo action="simul">&Alt;<keycap>Pfeil hoch</keycap></keycombo> </shortcut> <guimenu>Gehe zu</guimenu> <guimenuitem>Nach oben</guimenuitem>

source: Moves you up one step in the filesystem to the parent folder.
de: Öffnet den Ordner, der dem aktuellen übergeordnet ist.

source: <guimenu>Go</guimenu> <guimenuitem>Back</guimenuitem>
de: <guimenu>Gehe zu</guimenu> <guimenuitem>Zurück</guimenuitem>

source: Moves you one step back in your browsing history of the filesystem.
de: Geht einen Schritt im Verlauf zurück.

source: <guimenu>Go</guimenu> <guimenuitem>Forward</guimenuitem>
de: <guimenu>Gehe zu</guimenu> <guimenuitem>Weiter</guimenuitem>

source: Moves you one step forward in your browsing history of the filesystem.
de: Geht einen Schritt im Verlauf vor.

source: Additionally &filelight; has the common &kde; <guimenu>Settings</guimenu> and <guimenu>Help</guimenu> menu items, for more information read the sections about the <ulink url="help:/fundamentals/ui.html#menus-settings">Settings Menu</ulink> and <ulink url="help:/fundamentals/ui.html#menus-help">Help Menu</ulink> of the &kde; Fundamentals.
de: Zusätzlich hat &filelight; die bekannten &kde;-Einträge im Menü <guimenu>Einstellungen</guimenu> und <guimenu>Hilfe</guimenu>, weitere Informationen dazu finden Sie in den Abschnitten über die Menüs <ulink url="help:/fundamentals/ui.html#menus-settings">Einstellungen</ulink> und <ulink url="help:/fundamentals/uihtml#menus-help">Hilfe</ulink> der &kde;-Grundlagen.

source: Credits and License
de: Danksagungen und Lizenz

source: Program copyright 2006 Max B. Howell <email>max.howell@methylblue.com</email>
de: Programm Copyright 2006 Max B. Howell <email>max.howell@methylblue.com</email>

source: Program copyright 2008-2013 Martin Sandsmark <email>martin.sandsmark@kde.org</email>
de: Copyright des Programms 2008-2013 Martin Sandsmark <email>martin.sandsmark@kde.org</email>

source: Documentation
de: Dokumentation

source: Documentation copyright 2003 Max B. Howell <email>max.howell@methylblue.com</email>
de: Dokumentation Copyright 2003 Max B. Howell <email>max.howell@methylblue.com</email>

source: Documentation copyright 2009 Martin Sandsmark <email>martin.sandsmark@kde.org</email>
de: Copyright der Dokumentation 2009 Martin Sandsmark <email>martin.sandsmark@kde.org</email>

source: CREDIT_FOR_TRANSLATORS
de: <para>Übersetzung Felix Schweighofer <email>felix.schweighofer@googlemail.com</email></para>

source: How to obtain &filelight;
de: Woher Sie &filelight; erhalten

source: Compilation and Installation
de: Kompilierung und Installation
