Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdeutils/kcalc.po
Languages: de

source: The &kcalc; Handbook
de: Das Handbuch zu &kcalc;

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Gregor</firstname><surname>Zumstein</surname><contrib>Deutsche Übersetzung</contrib><affiliation><address><email>zumstein@ssd.ethz.ch</email></address></affiliation></othercredit>

source: &kcalc; is a calculator for &kde;. In the simple mode it can be used for basic arithmetic operations, but provides advanced modes for scientific, statistical and numeral system calculations.
de: &kcalc; ist ein Taschenrechner für &kde;. Im einfachen Modus kann das Programm für grundlegende arithmetische Operationen benutzt werden, aber es gibt zusätzlich noch erweitere Modi für wissenschaftliche, statistische und numerische Berechnungen.

source: calculator
de: Taschenrechner

source: Introduction
de: Einleitung

source: &kcalc; offers many more mathematical functions than meet the eye on a first glance. Please study the section on keyboard accelerators and modes in this handbook to learn more about the many functions available.
de: &kcalc; bietet viel mehr mathematische Funktionen, als auf den ersten Blick sichtbar sind. Bitte lesen Sie den Abschnitt über Tastenkürzel und -modi in diesem Handbuch, um mehr über die vielen verfügbaren Funktionen zu lernen.

source: In addition to the usual functionality offered by most scientific calculators, &kcalc; offers a number of features, which I think are worthwhile pointing out:
de: Über die Funktionalität von üblichen Taschenrechnern hinaus bietet &kcalc; eine Anzahl zusätzlicher Eigenschaften, die es Wert sind, genannt zu werden:

source: &kcalc; provides trigonometric functions, logic operations, and it is able to do statistical calculations.
de: &kcalc; beherrscht trigonometrische Funktionen, logische Operationen und kann statistische Berechnungen durchführen.

source: &kcalc; allows you to cut and paste numbers from/into its display.
de: &kcalc; erlaubt das Ausschneiden und Einfügen von Zahlen in der Anzeige.

source: &kcalc; features a <firstterm>results-stack</firstterm> which lets you conveniently recall previous results.
de: &kcalc; besitzt einen <firstterm>Ergebnis-Stack</firstterm>, mit dem Sie bequem frühere Resultate abrufen können.

source: You can configure &kcalc;'s display colors and font.
de: Sie können die Farbe und den Zeichensatz in der Anzeige von &kcalc; einstellen.

source: You can configure &kcalc;'s precision, the number of displayed digits and the number of digits after the period in the settings dialog.
de: Sie können die Genauigkeit von &kcalc; und die Anzahl der angezeigten Stellen und die Nachkommastellen im Einrichtungsdialog festlegen.

source: &kcalc; offers a great number of useful <link linkend="key-accels"> key-bindings</link>, which make using &kcalc; without using a pointing device easy.
de: &kcalc; bietet eine große Zahl nützlicher <link linkend="key-accels">Tastenbelegungen</link>, welche das Arbeiten mit &kcalc; ohne Maus vereinfachen.

source: Hint: pressing (and holding) the &Ctrl;-key, displays on every button,the corresponding key-binding.
de: Tipp: Wird die &Ctrl;-Taste gedrückt gehalten, so wird auf jeder virtuellen Taste die echte Tastaturbelegung angezeigt.

source: &kcalc; uses <ulink url="https://en.wikipedia.org/wiki/Calculator_input_methods#Infix_notation">Infix notation</ulink> which enforces correct order of operations as taught in school; contrary to <ulink url="https://en.wikipedia.org/wiki/Calculator_input_methods#Immediate_execution">Immediate execution</ulink> used by many simple calculators.
de: &kcalc; verwendet als <ulink url="https://de.wikipedia.org/wiki/Taschenrechner#Eingabelogik">Eingabelogik</ulink> die Algebraische Notation, bei der die Rangfolge der Operatoren berücksichtigt wird, im Gegensatz zur Sequentielle Eingabe mit sofortiger Ausführung wie bei vielen einfachen Rechnern.

source: Have fun with &kcalc;!
de: Viel Spaß mit &kcalc;!

source: Usage
de: Arbeiten mit &kcalc;

source: General Usage
de: Allgemeine Anwendung

source: General usage is straight forward and similar to the way most simple scientific calculators operate, but take note of the following special &kcalc; features:
de: Die normale Verwendung von &kcalc; ist einfach und ähnlich wie die der meisten einfachen wissenschaftlichen Taschenrechner. Beachten Sie aber die folgenden zusätzlichen Möglichkeiten in &kcalc;:

source: Result Stack
de: Ergebnis-Stack

source: Each time you &LMB; click on the <guibutton>=</guibutton> button or press your keyboard's &Enter; or <keysym>=</keysym> keys, the display result is written to &kcalc;'s result stack. You can navigate through the result stack with your keyboard's <keycombo action="simul">&Ctrl;<keycap>Z</keycap></keycombo> and <keycombo action="simul">&Ctrl; &Shift;<keycap>Z</keycap></keycombo> keys.
de: Jedesmal wenn Sie mit der &LMBn; auf den Knopf <guibutton>=</guibutton> klicken oder die &Enter;- oder <keysym>=</keysym>-Taste drücken, wird das Ergebnis auf &kcalc;s Ergebnis-Stack gelegt. Sie können diesen durch Drücken von der <keycombo action="simul">&Ctrl;<keycap>Z</keycap></keycombo> und <keycombo action="simul">&Ctrl; &Shift;<keycap>Z</keycap></keycombo> durchsuchen.

source: Percent Function
de: Prozentfunktion

source: The percent function works somewhat differently to that on most calculators. However, once understood, its enhanced functionality proves quite useful. See the section about the <link linkend="percent">percent</link> function for further details.
de: Die Prozentfunktion arbeitet ein wenig anders, als die der meisten anderen Rechner. Wenn Sie sie aber einmal verstanden haben, erweist sich die erweiterte Funktionalität als nützlich. Details finden Sie im Abschnitt <link linkend="percent">Prozente</link>.

source: Cut and Paste
de: Ausschneiden und Einfügen

source: Pressing <keycombo action="simul">&Ctrl;<keycap>C</keycap></keycombo> will place the displayed number on to the clipboard.
de: Wenn Sie <keycombo action="simul">&Ctrl;<keycap>C</keycap></keycombo> drücken, wird der angezeigte Wert in die Zwischenablage kopiert.

source: Pressing <keycombo action="simul">&Ctrl;<keycap>V</keycap></keycombo> will paste the clipboard content into the display if the content of the clipboard is a valid floating point number.
de: Das Drücken von <keycombo action="simul">&Ctrl;<keycap>V</keycap></keycombo> fügt den Inhalt der Zwischenablage in die Anzeige ein, sofern es sich um eine gültige Gleitkommazahl handelt.

source: It is still possible to copy/paste by clicking on &kcalc;'s display, but this may disappear in future versions.
de: Es ist immer noch möglich durch Klicken auf die Anzeige von &kcalc; zu kopieren und einzufügen, es kann aber sein, dass dies in zukünftigen Versionen nicht mehr unterstützt wird.

source: Advanced functions
de: Fortgeschrittene Funktionen

source: When you start &kcalc; for the first time, the calculator will only display buttons for basic arithmetic computations.
de: Wird &kcalc; zum ersten Mal gestartet, werden nur die grundlegenden arithmetischen Funktionen angeboten.

source: Under the menu entry <guimenu>Settings</guimenu> it is possible to select a mode for &kcalc;: it is possible to choose <link linkend="simple-mode">Simple</link> or <link linkend="science-mode">Science</link> or <link linkend="statistical-mode">Statistic</link> or <link linkend="numeral-system-mode">Numeral System</link> mode. Please note, that these modes will slightly change as &kcalc; evolves.
de: Im Menü <guimenu>Einstellungen</guimenu> können Sie einen Modus für &kcalc; auswählen: Es gibt einen <link linkend="simple-mode">einfachen, einen </link> or <link linkend="science-mode">wissenschaftlichen</link>, einen <link linkend="statistical-mode">statistischen</link> und einen <link linkend="numeral-system-mode">logischen</link> Modus.

source: Button Layout
de: Tastenanordnung

source: To give easy access to all the functions in advanced modes in &kcalc;, many keys have a second layout. Click on <guibutton>&Shift;</guibutton> or press the shortcut <keycombo action="simul">&Ctrl;<keycap>2</keycap></keycombo> to make the second layout of the buttons visible.
de: Um alle Funktionen in &kcalc; schnell zu erreichen, haben viele Tasten in den erweiterten Modi eine zweite Belegung. Klicken Sie auf <guibutton>Shift</guibutton> oder drücken Sie die Tastenkombination <keycombo action="simul">&Ctrl;<keycap>2</keycap></keycombo>, um diese zweite Tastenbelegung anzuzeigen.

source: Simple Mode
de: Einfacher Modus

source: This mode contains only those buttons and functions, which are essential necessary for basic calculations.
de: In diesem Modus werden nur die wichtigsten Tasten und Funktionen für einfache Berechnungen angezeigt.

source: If you just want to sum up all items on an invoice this mode may be your choice.
de: Dies ist ein geeigneter Modus, wenn Sie nur alle Beträge auf einer Rechnung addieren möchten.

source: Science Mode
de: Wissenschaftlicher Modus

source: In this mode the left column of buttons is allocated to trigonometric functions:
de: In diesem Modus sind die Tasten auf der linken Seite mit den trigonometrischen Funktionen belegt:

source: Buttons
de: Tasten

source: Function
de: Funktion

source: Enter Hyperbolic sub mode. Hyp Sin for example is the hyperbolic sine: sinh
de: Schaltet in den hyperbolischen Modus um. Zum Beispiel ist Hyp Sin der hyperbolische Sinus: sinh

source: Compute the sine
de: Berechnet den Sinus

source: &Shift; <guibutton>Sin</guibutton> or <guibutton>Asin</guibutton>
de: &Shift; <guibutton>Sin</guibutton> oder <guibutton>Asin</guibutton>

source: Compute the inverse sine
de: Berechnet den Arcussinus

source: Compute the cosine
de: Berechnet den Cosinus

source: &Shift; <guibutton>Cos</guibutton> or <guibutton>Acos</guibutton>
de: &Shift; <guibutton>Cos</guibutton> oder <guibutton>Acos</guibutton>

source: Compute the inverse cosine
de: Berechnet den Arcuscosinus

source: Compute the tangent
de: Berechnet den Tangens

source: &Shift; <guibutton>Tan</guibutton> or <guibutton>Atan</guibutton>
de: &Shift; <guibutton>Tan</guibutton> oder <guibutton>Atan</guibutton>

source: Compute the inverse tangent
de: Berechnet den Arcustangens

source: Compute the Log base 10
de: Berechnet den Zehnerlogarithmus

source: &Shift; <guibutton>Log</guibutton> or 10<superscript>x</superscript>
de: &Shift; <guibutton>Log</guibutton> oder 10<superscript>x</superscript>

source: Compute 10 to the power of x
de: Berechnet die Zehnerpotenz

source: Compute the natural logarithm. That is the log to base e
de: Berechnet den natürlichen Logarithmus, also den Logarithmus zur Basis e

source: &Shift; <guibutton>Ln</guibutton> or e<superscript>x</superscript>
de: &Shift; <guibutton>Ln</guibutton> oder e<superscript>x</superscript>

source: Compute e (the base of the natural logarithm) to the power of x
de: Berechnet e (Basis des natürlichen Logarithmus) hoch x

source: The second column has buttons for algebraic functions:
de: Die zweite Spalte hat Knöpfe für folgende algebraische Funktionen:

source: Compute the remainder in Euclidean division
de: Berechnet den Rest der Division

source: <guibutton>&Shift;</guibutton> <guibutton>Mod</guibutton> or <guibutton>IntDiv</guibutton>
de: <guibutton>&Shift;</guibutton> <guibutton>Mod</guibutton> oder <guibutton>IntDiv</guibutton>

source: Integer division (integer part of the quotient)
de: Ganzzahlige Division (Teil des Quotienten als ganze Zahl)

source: Compute the reciprocal for a number
de: Berechnet den reziproken Wert oder Kehrwert einer Zahl

source: <guibutton>&Shift;</guibutton> <guibutton>1/x</guibutton> or <guibutton>nCm</guibutton>
de: <guibutton>&Shift;</guibutton> <guibutton>1/x</guibutton> oder <guibutton>nTm</guibutton>

source: Compute the number of distinct second-operand-element subsets of it that can be formed for any set containing first operand elements (binomial coefficient)
de: Berechnet den Binomialkoeffizienten

source: Compute the product of all positive integers less than or equal to the current integer operand (factorial)
de: Berechnet die Fakultät (Produkt aller positiven ganzen natürlichen Zahlen bis zum Operanden)

source: Compute the square of x
de: Berechnet das Quadrat von x

source: <guibutton>&Shift;</guibutton> <guibutton>x²</guibutton> or <guibutton>√x</guibutton>
de: <guibutton>&Shift;</guibutton> <guibutton>x²</guibutton> oder <guibutton>√x</guibutton>

source: Compute the square root of x
de: Berechnet die Quadratwurzel von x

source: x power y
de: x hoch y

source: &Shift; x<superscript>y</superscript> or x<superscript>1/y</superscript>
de: &Shift; x<superscript>y</superscript> oder x<superscript>1/y</superscript>

source: x power 1/y
de: x hoch 1/y

source: Computes the third (cubic) power of x
de: Berechnet die dritte (kubische) Potenz von x

source: <guibutton>&Shift;</guibutton> <guibutton>x³</guibutton> or <guibutton>∛x</guibutton>
de: <guibutton>&Shift;</guibutton> <guibutton>x³</guibutton> oder <guibutton>∛x</guibutton>

source: Computes the third (cubic) root of x
de: Berechnet die dritte (kubische) Wurzel von x

source: Computes the product of the first operand and decimal exponent of the second operand
de: Berechnet das Produkt aus dem ersten Operanden und der Zehnerpotenz des zweiten Operanden.

source: Statistical Mode
de: Statistik-Modus

source: In this mode the left column of buttons is allocated to statistical functions:
de: Im Statistik-Modus sind die Tasten auf der linken Seite mit statistischen Funktionen belegt:

source: Most of the functionality in this mode is centered around the <guibutton>Dat</guibutton> button. To create a data list of numbers, enter a number into the calculator and press <guibutton>Dat</guibutton>. A sequentially increasing number is shown on the display indicating which position in the Data <quote>list</quote> the number occupies. A traditional calculator only stores three values for statistical functions: The number of discrete items in a list, the sum of the data items entered and the sum of the square of all data items in the list. &kcalc; differs by actually storing each discrete value, allowing you to calculate the median value of the data.
de: Die Funktionsweise in diesem Modus ist auf die Taste <guibutton>Dat</guibutton> ausgerichtet. Um eine Datenliste mit Zahlen zu erstellen, geben Sie eine Zahl ein und drücken die Taste <guibutton>Dat</guibutton>. Eine fortlaufend ansteigende Zahl zur Kennzeichnung der Position in der Daten-<quote>Liste</quote> wird angezeigt. Ein üblicher Taschenrechner speichert nur drei Werte für statistische Funktionen: Die Anzahl der einzelnen Einträge in der Liste, die Summe der eingegebenen Werte und die Summer der Quadrate der Listeneinträge. &kcalc; dagegen speichert jeden einzelnen Wert, damit Sie den Median der Daten berechnen können.

source: Recall the number of data items entered
de: Zeigt die Anzahl der eingegebenen Werte an

source: <guibutton>&Shift;</guibutton> <guibutton>N</guibutton> or <guibutton>&Sgr;x</guibutton>
de: <guibutton>&Shift;</guibutton> <guibutton>N</guibutton> oder <guibutton>&Sgr;x</guibutton>

source: Display the sum of all data items entered
de: Zeigt die Summe aller eingegebenen Werte an

source: Display the mean of the data items entered
de: Zeigt das arithmetische Mittel aller eingegebenen Werte an

source: <guibutton>&Shift;</guibutton> <guibutton>Mea</guibutton> or <guibutton>&Sgr;x²</guibutton>
de: <guibutton>&Shift;</guibutton> <guibutton>Mea</guibutton> oder <guibutton>&Sgr;x²</guibutton>

source: Display the sum of the square of all data items entered
de: Zeigt die Summe der Quadrate aller eingegebenen Werte an

source: Display the standard deviation (n)
de: Zeigt die Standardabweichung der Gesamtheit an (n)

source: <guibutton>&Shift;</guibutton> &sgr;<subscript>N</subscript> or &sgr;<subscript>N-1</subscript>
de: <guibutton>&Shift;</guibutton> &sgr;<subscript>N</subscript> oder &sgr;<subscript>N-1</subscript>

source: Display the population standard deviation (n-1)
de: Zeigt die Stichprobenstandardabweichung an (n-1)

source: Display the median
de: Zeigt den Median (Zentralwert) an

source: Enter a data item
de: Eingabe eines Wertes

source: <guibutton>&Shift;</guibutton> <guibutton>Dat</guibutton> or <guibutton>CDat</guibutton>
de: <guibutton>&Shift;</guibutton> <guibutton>Dat</guibutton> oder <guibutton>CDat</guibutton>

source: Clear last data item entered
de: Löscht den zuletzt eingegebenen Wert

source: Clear the store of all data item entered
de: Löscht den gesamten Statistikspeicher

source: The next two columns hold the buttons with trigonometric and algebraic functions described in the <link linkend="science-mode">Science</link> mode section.
de: Die nächste beiden Spalten enthalten die Knöpfe mit trigonometrischen und algebraischen Funktionen wie im Abschnitt <link linkend="science-mode">Wissenschaftlicher Modus</link> beschrieben.

source: Numeral System Mode
de: Logik-Modus

source: This mode contains buttons and functions to calculate in binary, hexadecimal, octal and decimal.
de: In diesem Modus werden Tasten und Funktionen für Berechnungen in den Zahlensystemen Binär, Hexadezimal, Oktal und Dezimal angezeigt.

source: You select the numeral system with the radio buttons on the right. To insert a hexadecimal number for example, just do the following: Select <guilabel>Hex</guilabel> from the radio buttons. Then enter a number and note, that you can use the letters <guibutton>A</guibutton> to <guibutton>F</guibutton> for numbers larger than 9. If you would like to see this number in binary, just select <guilabel>Bin</guilabel> from the radio buttons.
de: Das Zahlensystem wird mit den Auswahlknöpfen rechts im Fenster eingestellt. Eine hexadezimale Zahl geben Sie zum Beispiel auf folgende Weise ein: Wählen Sie den Auswahlknopf <guilabel>Hex</guilabel> und geben dann eine Zahl ein. Dabei können Sie alle Zahlen und die Buchstaben <keycap>A</keycap> bis <keycap>F</keycap> für hexadezimale Zahlen größer 9 benutzen, Möchten Sie diese Zahl im Binärformat sehen, klicken Sie den auf Auswahlknopf <guilabel>Bin</guilabel>

source: Binary, octal and hexadecimal numbers can be displayed as groups of digits separated by whitespaces. Such grouping can improve readability of numbers. For example, hexadecimal number <emphasis>AF1C42</emphasis> can be displayed as <emphasis>AF 1C 42</emphasis> with separation every second digit. Grouping can be turned off or tweaked. Select <menuchoice><guimenu>Settings</guimenu><guimenuitem>Configure &kcalc;...</guimenuitem></menuchoice> to bring up the configuration dialog and change the setting on <guilabel>General</guilabel> page as appropriate.
de: Binäre, oktale und hexadezimale Zahlen können als Zifferngruppen mit Leerzeichen als Trennzeichen dargestellt werden. Diese Gruppierung verbessert die Lesbarkeit der Zahlen. Zum Beispiel kann die hexadezimale Zahl <emphasis>AF1C42</emphasis> als <emphasis>AF 1C 42</emphasis> mit Trennung zwischen je zwei Zeichen angezeigt werden. Die Gruppierung kann abgeschaltet und eingerichtet werden. Wählen Sie <menuchoice><guimenu>Einstellungen</guimenu><guimenuitem>&kcalc; einrichten ...</guimenuitem></menuchoice>, um den Einrichtungsdialog zu öffnen und die Einstellungen auf der Seite <guilabel>Allgemein</guilabel> anzupassen.

source: You may want to select <guimenu>Show Bit Edit</guimenu> from the <guimenu>Settings</guimenu> menu to see selected bits.
de: Aktivieren Sie im Menü <guimenu>Einstellungen</guimenu> <guimenu>Bitbearbeitung zeigen</guimenu>, dann werden die ausgewählten Bits angezeigt.

source: There are logic operators available in this mode. These operators are:
de: Dieser Modus enthält logische folgende Operatoren:

source: Two numbers are logically anded
de: Zwei Zahlen werden durch ein logisches UND verknüpft

source: Two numbers are logically ored
de: Zwei Zahlen werden durch ein logisches ODER verknüpft

source: Two numbers are logically exclusive ored
de: Zwei Zahlen werden durch ein logisches exklusives ODER verknüpft

source: Left shift the value
de: Bit-Verschiebung des Werts nach links

source: Right shift the value
de: Bit-Verschiebung des Werts nach rechts

source: Perform a 1's complement
de: Berechnet das Einerkomplement (alle Bits werden invertiert)

source: The second column holds the buttons with algebraic functions described in the <link linkend="science-mode">Science</link> mode section.
de: Die zweite Spalte enthält die Knöpfe mit algebraischen Funktionen wie im Abschnitt <link linkend="science-mode">Wissenschaftlicher Modus</link> beschrieben.

source: The third column with the buttons <guibutton>A</guibutton> to <guibutton>F</guibutton> is enabled only in <guilabel>Hex</guilabel> mode.
de: Die dritte Spalte mit den Knöpfen <guibutton>A</guibutton> bis <guibutton>F</guibutton> wird nur im <guilabel>Hexl</guilabel>-Modus angezeigt.

source: Memory Operations
de: Speicherbefehle

source: &kcalc; supports the memory operations given by standard calculators plus six slots to hold constants.
de: &kcalc; unterstützt die üblichen Speicherbefehle von Standardrechnern und zusätzlich 6 Register für Konstanten.

source: Standard Memory Operations
de: Standard-Speicherbefehle

source: &kcalc; can remember results of operations for you, and re-use them in later calculations. You can access these functions via several buttons labeled <guibutton>MR</guibutton>, <guibutton>MS</guibutton>, <guibutton>M+</guibutton> and <guibutton>MC</guibutton>.
de: &kcalc; kann das Ergebnis von Berechnungen zur späteren Wiederverwendung speichern. Diese Funktionen erreichen Sie über mehrere Tasten (<guibutton>MR</guibutton>, <guibutton>MS</guibutton>, <guibutton>M+</guibutton> und <guibutton>MC</guibutton>).

source: The <guibutton>MS</guibutton> button stores the currently displayed result in memory.
de: <guibutton>MS</guibutton> speichert den aktuellen angezeigten Wert.

source: The <guibutton>M+</guibutton> button adds the current result to the one in memory. So, if you had stored a 20, and the current result is a 5, your memory would contain 25 when you press it. If the memory is empty, it acts like <guibutton>MS</guibutton> and simply stores the result.
de: <guibutton>M+</guibutton> addiert das aktuelle Ergebnis zum Wert im Speicher. Wenn sie also den Wert 20 gespeichert haben und das aktuelle Ergebnis 5 beträgt, enthält der Speicher nach diesem Tastendruck den Wert 25. Wenn der Speicher leer ist, funktioniert diese Taste wie <guibutton>MS</guibutton> und speichert nur das Ergebnis.

source: The <guibutton>MR</guibutton> button gets the value stored in memory and puts it in the display.
de: <guibutton>MR</guibutton> holt den Wert aus dem Speicher und zeigt ihn an.

source: The <guibutton>MC</guibutton> button clears the memory.
de: Die Taste <guibutton>MC</guibutton> löscht den Speicher.

source: If a value is stored in memory a <guilabel>M</guilabel> will appear in the status bar, next to the calculator mode indicator
de: Enthält der Speicher einen Wert, erscheint ein <guilabel>M</guilabel> in der Statusleiste neben der Anzeige des Berechnungsmodus.

source: Constants
de: Konstanten

source: The six constants buttons <guibutton>C1</guibutton> to <guibutton>C6</guibutton> will only be visible after activating the item <guilabel>Constants Buttons</guilabel> in the menu <guimenu>Settings</guimenu> of the menu bar. They are available in <guilabel>Science mode</guilabel> and <guilabel>Statistics mode</guilabel>
de: Die sechs Tasten für Konstanten <guibutton>K1</guibutton> bis <guibutton>K6</guibutton> werden nur dann angezeigt, wenn Sie sie mit <guilabel>Konstantentasten</guilabel> im Menü <guimenu>Einstellungen</guimenu> in der Menüleiste einschalten. Diese Tasten für Konstanten können nur im <guilabel>wissenschaftlichen</guilabel> und <guilabel>statistischen</guilabel> Modus aktiviert werden.
