Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdeutils/kcalc.po
Languages: de

source: To see the value stored in each constant hover the button with the mouse pointer.
de: Um den gespeicherten Wert jeder Konstante anzuzeigen, bewegen Sie den Mauszeiger über die Konstantentasten.

source: To store the number shown in the &kcalc; display in one of the six constants, first press <guibutton>&Shift;</guibutton> followed by the desired button key <guibutton>C1</guibutton> up to <guibutton>C6</guibutton>.
de: Um die Zahl in der Anzeige von &kcalc; in einer der sechs Konstanten zu speichern, drücken Sie zuerst auf <guibutton>Shift</guibutton> und dann auf den gewünschten Speicherplatz <guibutton>K1</guibutton> bis <guibutton>K6</guibutton>.

source: To use the value stored in any of the constants in a calculation, just press the desired button (<guibutton>C1</guibutton> to <guibutton>C6</guibutton>), and the corresponding number will appear in the display.
de: Um den in einer Konstanten gespeicherten Wert in einer Berechnung zu benutzen, drücken Sie die gewünschte Taste (<guibutton>K1</guibutton> bis <guibutton>K6</guibutton>) und der Wert wird in die Anzeige eingefügt.

source: It is possible to change the label of the constants button to make it easier to remember which button holds which constant. Click with the right mouse button on one of the buttons <guibutton>C1</guibutton> to <guibutton> C6</guibutton>. A popup menu appears, in which you select <guilabel> Set Name</guilabel>.
de: Sie können die Beschriftung der Konstantentasten ändern, um dadurch den darin enthaltenen Wert anzuzeigen. Klicken Sie dazu mit der rechten Maustaste auf eine der Tasten <guibutton>K1</guibutton> bis <guibutton>K6</guibutton>. Damit öffnen Sie ein Kontextmenü, in dem Sie <guilabel>Namen angeben</guilabel> auswählen.

source: There are many (mostly physical) predefined constants, which can be put on any of the six buttons <guibutton>C1</guibutton> - <guibutton>C6</guibutton> by selecting the desired constant in the popup menu that appears after right clicking on one of the constant buttons and selecting <guilabel>Choose from List</guilabel>. Though the predefined constants can also be accessed via the <guimenu>Constants</guimenu> in the menu bar, storing it on a constants button is very handy, if the number is used frequently.
de: Es gibt viele vordefinierte Konstanten (meistens aus der Physik), die Sie als Beschriftung der sechs Tasten <guibutton>K1</guibutton> bis <guibutton>K6</guibutton> verwenden können. Klicken Sie dazu mit der rechten Maustaste auf einen der Konstantentasten und wählen Sie eine Konstante mit <guilabel>Aus Liste wählen</guilabel>. Obwohl Sie die vordefinierten Konstanten auch im Menü mit <guimenu>Konstanten</guimenu> einfügen können, ist die Belegung einer Konstantentaste sehr praktisch, wenn Sie einen Wert mehrfach verwenden wollen.

source: Single Key Accelerators
de: Bedeutung der Tasten und Knöpfe

source: To simplify entering calculations from the keyboard &kcalc; has single key accelerators for most functions. For example entering <userinput>7R</userinput> or <userinput>7r</userinput> will calculate the reciprocal of 7 (1/7).
de: Um die Eingabe für die Berechnungen zu vereinfachen, benutzt &kcalc; einzelne Tasten auf der Tastatur für die meisten Funktionen. Zum Beispiel führt die Eingabe von <userinput>7R</userinput> oder <userinput>7r</userinput> zur Berechnung des Reziproken von 7 (also 1/7).

source: During a computation, you can always press &Ctrl; to make each button display its key-binding.
de: Während einer Berechnung können Sie immer &Ctrl; drücken, um die Tastaturbelegung zu sehen.

source: <entry>Key</entry>
de: <entry>Taste</entry>

source: Notes
de: Bemerkung

source: Hyperbolic as in Hyp Sin, the sinh
de: Hyperbolisch wie in Hyp Sin, der sinh

source: log base e
de: Logarithmus zur Basis e

source: log base 10
de: Logarithmus zur Basis 10

source: Second function for this button. &eg; if you want arcsin type <userinput>Ctrl-2 s </userinput>
de: Die zweite Funktion dieser Taste. Wenn Sie &eg; den Arcussinus von x berechnen wollen, tippen Sie <userinput>Shift-2 + s</userinput>

source: Change sign
de: Das Vorzeichen wechseln

source: Factorial
de: Fakultät

source: Left shift
de: Bit-Verschiebung nach links

source: Right shift.
de: Bit-Verschiebung nach rechts.

source: Logical AND
de: Logisches UND

source: <keysym>x</keysym> or <keysym>*</keysym>
de: <keysym>x</keysym> oder <keysym>*</keysym>

source: Multiply
de: Multiplikation

source: Divide
de: Division

source: Enter data item in statistical mode
de: Dateneingabe im Statistik-Modus

source: Logical OR. Note: <guibutton>&Shift;</guibutton> <guibutton>OR</guibutton> is XOR
de: Logisches ODER. <guibutton>Shift</guibutton> <guibutton>OR</guibutton> ist XOR

source: Reciprocal
de: Berechnet den reziproken Wert

source: Return
de: Eingabe

source: Delete last number
de: Löscht die letzte Zahl

source: PgUp
de: Bild auf

source: Clear
de: Löschen

source: PgDown
de: Bild ab

source: Clear all
de: Alles löschen

source: <keycap>Del</keycap>
de: <keycap>Entf</keycap>

source: remainder of dividing
de: Rest der Division

source: &Alt;+<keycap>1</keycap> to &Alt;+<keycap>6</keycap>
de: &Alt;+<keycap>1</keycap> bis &Alt;+<keycap>6</keycap>

source: <guibutton>C1</guibutton>
de: <guibutton>K1</guibutton>

source: use the value stored in C1 to C6
de: benutzt den Wert aus Speicher K1 bis K6

source: Comments on Specific Functions
de: Bemerkungen zu einzelnen Funktionen

source: Mod and IntDiv
de: Mod und IntDiv

source: <guibutton>Mod</guibutton> gives the remainder of dividing the displayed number by the next input number.
de: <guibutton>Mod</guibutton> berechnet den Rest der Division der angezeigten Zahl durch die nächste eingegebene Zahl.

source: <userinput>22 Mod 8 = </userinput> will give the result <emphasis>6</emphasis>
de: <userinput>22 Mod 8 = </userinput> ergibt das Resulat <emphasis>6</emphasis>

source: <userinput>22.345 Mod 8 = </userinput> will give the result <emphasis>6.345</emphasis>
de: <userinput>22,345 Mod 8 = </userinput> ergibt das Resultat <emphasis>6,345</emphasis>

source: <guibutton>&Shift;</guibutton> <guibutton>IntDiv</guibutton> does integer division of the displayed number by the next input number.
de: <guibutton>Shift</guibutton> <guibutton>IntDiv</guibutton> führt eine Ganzzahldivision der angezeigten Zahl durch die nächste eingegebene Zahl durch.

source: <userinput>22 Shift IntDiv 8 = </userinput> will give the result <emphasis>2</emphasis>
de: <userinput>22 Shift IntDiv 8 = </userinput> ergibt das Resultat <emphasis>2</emphasis>

source: <userinput>22.345 Shift IntDiv 8 = </userinput> also gives <emphasis>2</emphasis>
de: <userinput>22,345 Shift IntDiv 8 = </userinput> ergibt ebenfalls das Resultat <emphasis>2</emphasis>

source: &percnt;
de: Prozente

source: Used instead of the <guibutton>=</guibutton> key, <guibutton>%</guibutton> interprets the final operation carried out in the current calculation as follows:
de: Anstelle des <guibutton>=</guibutton> können Sie <guibutton>%</guibutton> verwenden, um ein Resultat zu erhalten. Die Berechnungen werden dann wie folgt durchgeführt:

source: If the final operator is + or - the second argument is interpreted as percentage of the first operand.
de: Wenn die letzte Operation die Addition oder Subtraktion ist, dann wird das Ergebnis in Prozenten des zweiten Operanden ausgegeben.

source: If the final operator is * divide the result of the multiplication by 100.
de: Wenn die letzte Operation die Multiplikation ist, wird das Resultat der Multiplikation durch 100 geteilt.

source: If the final operator is / give the left operand as a percentage of the right operand.
de: Wenn die letzte Operation die Division oder Restbildung ist, dann wird der Prozentsatz des linken Operanden auf Basis des rechten Operanden ausgegeben.

source: In all other cases the &percnt; key gives identical results to the = key.
de: In allen anderen Fällen hat die &percnt;-Taste die gleiche Wirkung wie die =-Taste.

source: Examples:
de: Beispiele:

source: <userinput>150 + 50 %</userinput> gives <emphasis>225</emphasis> (150 plus 50 percent of this amount)
de: <userinput>150 + 50 %</userinput> ergibt <emphasis>225</emphasis> (150 plus 50 Prozent von diesem Betrag)

source: <userinput>42 * 3 %</userinput> gives <emphasis>1.26</emphasis> (42 * 3 / 100)
de: <userinput>42 * 3 %</userinput> ergibt <emphasis>1.26</emphasis> (42 * 3 / 100)

source: <userinput>45 / 55 %</userinput> gives <emphasis>81.81...</emphasis> (45 is 81.81.. percent of 55)
de: <userinput>45 / 55 %</userinput> ergibt <emphasis>81.81...</emphasis> (45 ist 81.81.. Prozent von 55)

source: Lsh and Rsh
de: Lsh und Rsh

source: <guibutton>Lsh</guibutton> left shifts the integer part of the displayed value (multiplies it by 2) n times, where n is the next input number, and gives an integer result (base is set to <guibutton>Bin</guibutton>):
de: <guibutton>Lsh</guibutton> schiebt den ganzzahligen Anteil des angezeigten Wertes um n Stellen nach links (entspricht einer Multiplikation mit 2^n). n ist dabei die nächste eingegebene Zahl. Das Resultat ist immer ganzzahlig mit der Basis <guibutton>Bin</guibutton>:

source: <userinput>10 Lsh 3 =</userinput> gives <emphasis>80</emphasis> (10 multiplied by 2 three times).
de: <userinput>10 Lsh 3 =</userinput> ergibt <emphasis>80</emphasis> (10 multipliziert mit 2^3 ).

source: <userinput>10.345 Lsh 3 =</userinput> also gives <emphasis>80</emphasis>.
de: <userinput>10.345 Lsh 3 =</userinput> ergibt ebenfalls <emphasis>80</emphasis>.

source: <guibutton>Rsh</guibutton> right shifts the value (performs an integer divide by 2) n times.
de: <guibutton>Rsh</guibutton> schiebt den ganzzahligen Anteil des angezeigten Wertes um n Stellen nach rechts (entspricht einer Division durch 2^n). Das Resultat ist immer ganzzahlig:

source: <userinput>16 Rsh 2 =</userinput> gives <emphasis>4</emphasis> (16 divided by 2 twice).
de: <userinput>16 Rsh 2 =</userinput> ergibt <emphasis>4</emphasis> (16 geteilt durch 2^2).

source: <userinput>16.999 Rsh 2 =</userinput> also gives <emphasis>4</emphasis>.
de: <userinput>16.999 Rsh 2 =</userinput> ergibt ebenfalls <emphasis>4</emphasis>.

source: Cmp, And, Or and Xor
de: Cmp, And, Or und Xor

source: The <guibutton>Cmp</guibutton>, <guibutton>And</guibutton> and <guibutton>Or</guibutton> functions perform bitwise logical operations and therefore appear more meaningful if the base is set to <guilabel>Hex</guilabel>, <guilabel>Oct</guilabel> or <guilabel>Bin</guilabel> rather than <guilabel>Dec</guilabel>. In the following examples base is set to <guilabel>Bin</guilabel>.
de: Die <guibutton>Cmp</guibutton>, <guibutton>And</guibutton> und <guibutton>Or</guibutton> Funktionen führen bitweise logische Operationen durch. Diese Funktionen machen daher insbesondere Sinn, wenn die Basis auf <guilabel>Hex</guilabel>, <guilabel>Oct</guilabel> oder <guilabel>Bin</guilabel> gesetzt ist. In den folgenden Beispielen ist die Basis auf <guilabel>Bin</guilabel> gesetzt.

source: <guibutton>Cmp</guibutton> performs a 1's complement (inverts the bits).
de: <guibutton>Cmp</guibutton> berechnet das Einerkomplement (invertiert die Bits).

source: <userinput>101 Cmp</userinput> gives <emphasis>111...111010</emphasis>
de: <userinput>101 Cmp</userinput> ergibt <emphasis>111...111010</emphasis>

source: <guibutton>AND</guibutton> does a logical AND.
de: <guibutton>AND</guibutton> führt ein logisches UND durch.

source: <userinput>101 AND 110 =</userinput> gives <emphasis>100</emphasis>
de: <userinput>101 AND 110 =</userinput> ergibt <emphasis>100</emphasis>

source: <guibutton>OR</guibutton> does the logical OR.
de: <guibutton>OR</guibutton> führt ein logisches ODER durch.

source: <userinput>101 OR 110 =</userinput> gives <emphasis>111</emphasis>
de: <userinput>101 OR 110 =</userinput> ergibt <emphasis>111</emphasis>

source: <guibutton>XOR</guibutton> performs the logical XOR (exclusive OR) operation.
de: <guibutton>XOR</guibutton> führt ein logisches XOR (exklusives ODER) durch.

source: <userinput>101 XOR 110 =</userinput> gives <emphasis>11</emphasis>
de: <userinput>101 XOR 110 =</userinput> ergibt <emphasis>11</emphasis>

source: Questions and Answers
de: Fragen und Antworten

source: How do I get e, the Euler number?
de: Wie erhalte ich die Eulersche Zahl e?

source: Type <userinput>1 Shift Ln</userinput>.
de: Drücken Sie <userinput>1 Shift Ln</userinput>.

source: How do I get two fixed digits after the period?
de: Wie erhalte ich genau zwei Nachkommastellen?

source: Select <menuchoice><guimenu>Settings</guimenu><guimenuitem> Configure &kcalc;...</guimenuitem></menuchoice> on the menubar, this will bring up the configuration dialog. Check <guilabel>Set decimal precision</guilabel> and adjust the spin control so that it shows a 2.
de: Wählen Sie <menuchoice><guimenu>Einstellungen</guimenu><guimenuitem>&kcalc; einrichten ...</guimenuitem></menuchoice> in der Menüleiste. Damit öffnen Sie den Einrichtungsdialog, in dem Sie <guilabel>Genauigkeit für Dezimal setzen</guilabel> ankreuzen können und mit dem Drehfeld die Anzahl Nachkommastellen auf 2 einstellen können.

source: What about Precision?
de: Wie ist das mit der Genauigkeit?

source: The main factor determining the precision of &kcalc; is whether your libc and libmath supports the C data type <type>long double</type>. If this is the case, &kcalc; will detect this at compile time and use it as its fundamental data type to represent numbers.
de: Entscheidend für die Genauigkeit von &kcalc; ist die Unterstützung des C-Datentyps <type>long double</type> durch die Bibliotheken libc und libmath. Ist diese Unterstützung vorhanden, erkennt &kcalc; dies bei der Übersetzung und verwendet diesen Datentyp.

source: Adjust the <guilabel>Precision</guilabel> in &kcalc;'s <guibutton>Configure</guibutton> dialog so that the above computations work correctly. I recommend a precision of 14 if the fundamental data type for your copy of &kcalc; is <type>long double</type>, otherwise 8 or 10.
de: Stellen Sie die <guilabel>Genauigkeit</guilabel> im Einrichtungsdialog von &kcalc; so ein, dass die oben genannten Berechnungen richtig gelöst werden. Wenn der Datentyp <type>long double</type> ist, so empfiehlt sich eine Genauigkeit von 14, sonst von 8 bis 10 Stellen.

source: Higher precision doesn't necessarily lead to better results. Play with the precision and you will see what I mean.
de: Eine höhere Genauigkeit führt nicht zwingend zu besseren Resultaten. Spielen Sie ein wenig mit der Genauigkeit, um zu verstehen, was gemeint ist.

source: Credits and License
de: Danksagungen und Lizenz

source: &kcalc; Program Copyright &copy;:
de: &kcalc; Copyright für das Programm &copy;:

source: The &kde; Team 2000-2008
de: Das &kde;-Team 2000-2008

source: &kcalc; was inspired by <personname><firstname>Martin</firstname> <surname>Bartlett</surname></personname>'s <application>xfrmcalc</application>, whose stack engine is still part of &kcalc;.
de: &kcalc; wurde von <personname><firstname>Martin</firstname> <surname>Bartletts</surname></personname> <application>xfrmcalc</application> angeregt, dessen Stack-Implementierung immer noch von &kcalc; verwendet wird.

source: Documentation Copyright &copy; 2001,2002,2005, 2006,2010:
de: Copyright für die Dokumentation &copy; 2001, 2002, 2005, 2006,2010:

source: CREDIT_FOR_TRANSLATORS
de: <para>Übersetzung Gregor Zumstein <email>zumstein@ssd.ethz.ch</email></para>

source: &kcalc; is part of the kdeutils package within the &kde; project and will normally be provided as part of a &kde; installation. For more details about &kde; visit <ulink url="http://www.kde.org">http://www.kde.org</ulink>.
de: &kcalc; ist Teil des kdeutils-Pakets, eines Teils des &kde;-Projektes und wird normalerweise als Teil von &kde; installiert. Weitere Informationen über &kde; finden sich unter <ulink url="http://www.kde.org">http://www.kde.org</ulink>.

source: Compilation and Installation
de: Kompilierung und Installation
