Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdeutils/kcalc_commands.po
Languages: de

source: Command Reference
de: Befehlsreferenz

source: Menu Items
de: Menüeinträge

source: A brief overview of some special menu items in &kcalc;:
de: Ein kurzer Überblick über die speziellen Menüeinträge für &kcalc;:

source: <guimenu>Constants</guimenu> <guimenuitem>Mathematics</guimenuitem>
de: <guimenu>Konstanten</guimenu> <guimenuitem>Mathematik</guimenuitem>

source: Display Pi, Euler Number or Golden Ratio.
de: Enthält Pi, Eulersche Zahl und Goldener Schnitt.

source: <guimenu>Constants</guimenu> <guimenuitem>Electromagnetism</guimenuitem>
de: <guimenu>Konstanten</guimenu><guimenuitem>Elektromagnetismus</guimenuitem>

source: Display Light Speed, Elementary Charge, Impedance of Vacuum, Permeability of Vacuum or Permittivity of Vacuum.
de: Enhält Lichtgeschwindigkeit, Elementarladung, Wellenimpedanz des Vakuums, Magnetische Feldkonstante und Dielektrizitätskonstante des Vakuums.

source: <guimenu>Constants</guimenu> <guimenuitem>Atomic &amp; Nuclear</guimenuitem>
de: <guimenu>Konstanten</guimenu><guimenuitem>Atomkerne und Elementarteilchen</guimenuitem>

source: Display Planck's Constant, Elementary Charge or Fine-Structure Constant.
de: Enhält Plancksche Konstante, Elementarladung und Feinstrukturkonstante.

source: <guimenu>Constants</guimenu> <guimenuitem>Thermodynamics</guimenuitem>
de: <guimenu>Konstanten</guimenu><guimenuitem>Thermodynamik</guimenuitem>

source: Display Boltzmann Constant, Atomic Mass Unit, Molar Gas Constant, Stefan-Boltzmann Constant or Avogadro's Number.
de: Enthält Boltzmann-Konstante, Atomare Masseneinheit, Molare Gaskonstante, Stefan-Boltzmann-Konstante und die Avogadrozahl.

source: <guimenu>Constants</guimenu> <guimenuitem>Gravitation</guimenuitem>
de: <guimenu>Konstanten</guimenu><guimenuitem>Gravitation</guimenuitem>

source: Display Constant of Gravitation or Earth Acceleration.
de: Enthält Gravitationskonstante und Erdbeschleunigung.

source: <guimenu>Settings</guimenu> <guimenuitem>Simple Mode</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>Einfach</guimenuitem>

source: Displays the simple math buttons.
de: Zeigt die Tasten für einfache mathematische Operationen an.

source: <guimenu>Settings</guimenu> <guimenuitem>Science Mode</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>Wissenschaftlich</guimenuitem>

source: Displays trigonometric and science buttons.
de: Zeigt die Tasten für trigonometrische und wissenschaftliche Operationen an.

source: <guimenu>Settings</guimenu> <guimenuitem>Statistic Mode</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>Statistisch</guimenuitem>

source: Displays <link linkend="statistical-mode">statistic buttons.</link>
de: Zeigt die <link linkend="statistical-mode">Tasten für Statistik an.</link>

source: <guimenu>Settings</guimenu> <guimenuitem>Numeral System Mode</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>Logik</guimenuitem>

source: Displays <link linkend="and-or-xor">logic buttons</link> and allows changing the numeral system.
de: Zeigt die <link linkend="and-or-xor">Tasten für logische Operationen</link> an und ermöglicht das Ändern des Zahlensystems.

source: <guimenu>Settings</guimenu> <guimenuitem>Constants Buttons</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>Konstantentasten</guimenuitem>

source: Display constants buttons. They are available in <link linkend="science-mode">science mode</link> and <link linkend="statistical-mode">statistic mode</link>.
de: Zeigt im <link linkend="science-mode">wissenschaftlichen</link> und <link linkend="statistical-mode">statistischen</link> Modus die Konstantentasten K1 bis K6 an,

source: <guimenu>Settings</guimenu> <guimenuitem>Show Bit Edit</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>Bitbearbeitung zeigen</guimenuitem>

source: Displays a bit edit field. Click on a bit to toggle it. Only available in <link linkend="numeral-system-mode">numeral system mode</link>.
de: Zeigt ein Bitbearbeitungsfeld an, klicken Sie auf ein Bit, um dessen Wert ein- oder ausschalten.>. Dieses Bitbearbeitungsfeld kann nur im logischen Modus aktiviert werden.

source: Additionally &kcalc; has the common &kde; <guimenu>File</guimenu>, <guimenu>Edit</guimenu>, <guimenu>Settings</guimenu> and <guimenu>Help</guimenu> menu items, for more information read the sections about the <ulink url="help:/fundamentals/ui.html#menus">Menus</ulink> in the &kde; Fundamentals.
de: Zusätzlich benutzt &kcalc; die bekannten &kde;-Menüs <guimenu>Datei</guimenu>, <guimenu>Bearbeiten</guimenu>, <guimenu>Einstellungen</guimenu> und <guimenu>Hilfe</guimenu> , weitere Informationen dazu finden Sie im Abschnitt über die <ulink url="help:/fundamentals/uihtml#menus">Menüs</ulink> in den &kde;-Grundlagen.
