Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdeutils/kcontrol_kremotecontrol.po
Languages: de

source: KDE Remote Control Configuration
de: Einstellungen für Fernbedienungen unter &kde;

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Gregor</firstname><surname>Zumstein</surname><affiliation><address><email>gz@orchester-bremgarten.ch</email></address></affiliation><contrib>Deutsche Übersetzung</contrib></othercredit>

source: &kremotecontrol; configuration: The infrastructure for the &kde;'s Remote Control functionality.
de: &kremotecontrol;-Einstellungen: Die Infrastruktur für die &kde;-Fernbedienungsfunktionalität.

source: Remote Control
de: Fernbedienung

source: Introduction
de: Einführung

source: This module allows you to configure your remote controls. You can assign actions that are executed on button presses. Actions can start applications, control them or execute system commands, such as powering off your computer.
de: In diesem Modul können Sie Ihre Fernbedienungen einrichten und ihnen Aktionen zuweisen, die beim Drücken eines Knopfes ausgeführt werden. Aktionen können Programme starten, sie steuern oder Systembefehle wie das Herunterfahren des Rechners ausführen.

source: Requirements
de: Voraussetzungen

source: To use &kremotecontrol; you must have set up a compatible backend for remote controls on your computer. Currently there is only a backend for LIRC available. If LIRC is properly set up, the &kremotecontrol; icon in the system tray will light up red <inlinemediaobject> <imageobject> <imagedata fileref="irkick.png" format="PNG"/> </imageobject> </inlinemediaobject>. If not, it will be gray and crossed out <inlinemediaobject> <imageobject> <imagedata fileref="irkickoff.png" format="PNG"/> </imageobject> </inlinemediaobject>.
de: Um &kremotecontrol; benutzen zu können, müssen Sie ein kompatibles Dienstprogramm für Fernbedienungen auf Ihren Rechner installieren. Zur Zeit gibt es nur ein Dienstprogramm für LIRC. Wenn LIRC richtig eingerichtet ist, wird das Symbol für &kremotecontrol; im Systemabschnitt der Kontrollleiste hellrot angezeigt <inlinemediaobject> <imageobject> <imagedata fileref="irkick.png" format="PNG"/> </imageobject> </inlinemediaobject>. Sonst ist das Symbol grau mit einem Kreuz <inlinemediaobject> <imageobject> <imagedata fileref="irkickoff.png" format="PNG"/> </imageobject> </inlinemediaobject>.

source: For more information about LIRC, visit their website at http://www.lirc.org.
de: Weitere Informationen zu LIRC finden Sie auf der Homepage http://www.lirc.org.

source: Usage
de: Benutzung

source: The configuration module consists of two lists. The list on the left shows the available remote controls and their modes. The list on the right displays all configured actions for the current selected remote and mode.
de: Dieses Einstellungsmodul besteht aus zwei Listen. Die linke Liste zeigt alle vorhandenen Fernsteuerungen und deren Modi an. In der rechten Liste werden alle eingerichteten Aktionen für die aktuell ausgewählte Fernsteuerung und den Modus aufgeführt.

source: KRemoteControl configuration
de: Einrichtung von KRemoteControl

source: Lists of remotes and configured modes and actions
de: Liste der Fernbedienungen und der eingerichteten Modi und Aktionen.

source: Remote Controls and Modes
de: Fernbedienungen und Modi

source: Each remote control can have a number of different modes. Having multiple modes allows buttons to execute different actions in different situations. Think of it as a TV/Video/Satellite/DVD multi-purpose remote control. Instead of using different remote controls for different applications, you can change the behavior of one remote control to adapt to an application by creating different modes and switching them as needed. Actions defined directly to the remote control are always available, no matter in what mode the remote currently is. Actions defined in a mode are only executed if the remote is currently set to that mode. Each remote control can be only in one mode at a time. It may also be in no mode at all meaning that only always available actions are executed on button presses. You can also define a default mode, which is the mode automatically assigned on startup.
de: Jede Fernbedienung hat eine Anzahl unterschiedlicher Modi. Unterschiedliche Modi erlauben es, einer Taste je nach Anwendungsbereich unterschiedliche Funktionen zuzuweisen. Auf diese Weise können Fernbedienungen viele verschiedene Geräte mit nur einigen wenigen Knöpfen steuern. Ein Beispiel hierfür sind die Vielzweck-Fernbedienungen für TV/Video/DVD und weiteres. Diese haben wenige Tasten, welche je nach zu bedienendem Gerät unterschiedliche Funktionen besitzen. Direkt für die Fernbedienung definierte Aktionen sind immer verfügbar, unabhängig vom aktuellen Modus der Fernbedienung. Aktionen, die für einen Modus definiert wurden, werden auch nur dann ausgeführt, wenn sich die Fernbedienung in diesem Modus befindet. Für eine Fernbedienung kann gleichzeitig nur ein Modus oder auch kein Modus aktiviert sein. Ist kein Modus aktiviert, werden nur die direkt definierten und immer verfügbaren Aktionen beim Drücken eines Knopfes ausgeführt. Außerdem kann ein Standardmodus angegeben werden, der der Fernbedienung automatisch beim Start zugewiesen wird.

source: You can add modes to a remote control by selecting the remote and using the <guibutton>+</guibutton> button besides to the list. When creating a mode you need to supply a name for it. Optionally you can assign a button that is used to activate the mode and an icon that is used for notifications for this mode. You can delete modes by selecting them and using the <guibutton>-</guibutton> button.
de: Modi können für eine Fernbedienung hinzugefügt werden, indem Sie sie auswählen und dann auf den Knopf <guibutton>+</guibutton> rechts neben der Liste klicken. Ein neu erstellter Modus muss als ersten einen Namen erhalten. Wahlweise können Sie dem Modus eine Taste zur Aktivierung und ein Symbol zuweisen, das in Benachrichtigungen zu diesem Modus benutzt wird. Um einen Modus zu löschen, wählen sie ihn aus und drücken den Knopf <guibutton>-</guibutton>.

source: Add mode
de: Modus hinzufügen

source: Adding a new mode
de: Einen neuen Modus hinzufügen

source: By default, if there are multiple modes with the same assigned button, the button is used to cycle through those modes. This way you can group your modes. For example you could assign a button named <quote>Music</quote> to cycle through modes for &amarok; and &juk; while a button named <quote>Video</quote> could cycle through modes for &dragon; or KMplayer. If you rather would like to have a button for cycling though all modes and a second one to reverse-cycling through the modes, you can set this behavior in a remotes preferences by selecting a remote and pressing the edit button.
de: Gibt es mehrere Modi mit der gleichen zugewiesenen Taste, wird diese Taste in der Voreinstellung zum Moduswechsel benutzt. Damit können Sie Ihre Modi gruppieren. Sie können zum Beispiel eine Taste <quote>Musik</quote> für das Wechseln der Modi in &amarok; und &juk; benutzen oder eine Taste <quote>Video</quote> auf die gleiche Art für &dragon; oder KMplayer. Möchten Sie mit einer Taste durch alle Modi vorwärts und mit einer weiteren Taste durch alle Modi rückwärts wechseln, wählen Sie eine Fernsteuerung aus. Drücken Sie den Knopf „Bearbeiten“ und stellen Sie dies Verhalten im Einrichtungsdialog ein.

source: EditRemote
de: Fernbedienung bearbeiten

source: Editing a remote
de: Eine Fernbedienung bearbeiten

source: Actions
de: Aktionen

source: After selecting a remote or a mode, you can add actions to it using the <guibutton>+</guibutton> button on the right. There are two different ways how actions can be created. By using a template or by browsing the D-Bus session bus manually.
de: Wenn Sie eine Fernbedienung oder einen Modus ausgewählt haben, können Sie Ihnen mit dem Knopf <guibutton>+</guibutton> auf der rechten Seite Aktionen hinzufügen. Aktionen können auf zwei unterschiedliche Arten erstellt werden, entweder unter Verwendung einer Vorlage oder manuell mit Durchsehen der D-Bus-Sitzung.

source: AddAction
de: Aktion hinzufügen

source: Adding an action
de: Eine Aktion hinzufügen

source: Creating actions using templates is easier but limited. You can find templates for the most common applications such as &amarok; or the &kde; program launcher and system commands for shutting down your computer. Those templates are collected in profiles that group them into similar task. For example there is a Profile called <quote>Power management</quote> that contains templates for shutting down or suspending your computer.
de: Aktionen mithilfe von Vorlagen zu erstellen, ist einfach, die Einstellungsmöglichkeiten für diese Aktionen sind aber begrenzt. Vorlagen für häufig benutzte Anwendungen wie &amarok; oder den &kde;-Programmstarter und Systembefehle für das Herunterfahren des Rechners werden mit installiert. Diese Vorlagen sind in Profilen für ähnlichen Aufgaben zusammengefasst. Es gibt zum Beispiel ein Profil <quote>Power management</quote> mit Vorlagen um den Rechner in den Ruhezustand oder Tiefschlaf zu versetzen oder herunterzufahren.

source: AddProfileAction
de: Profil hinzufügen

source: Adding an action using a template
de: Aktion mit Hilfe einer Vorlage hinzufügen

source: Creating actions by browsing the D-Bus lists all currently running applications. You can browse through them and their functions. This requires a basic understanding of how D-Bus works, but you can use more applications and functions than those in the template list.
de: Durchsuchen Sie den D-Bus um Aktionen zu erstellen, dann werden alle laufenden Programme angezeigt und Sie können alle Funktionen dieser Programme durchsehen. Dazu sind aber Grundkenntnisse zum D-Bus erforderlich, es lassen sich damit dann mehr Programme und Funktionen als in der Vorlagenliste benutzen.

source: AddDBusAction
de: D-Bus-Aktion hinzufügen

source: Adding an action using D-Bus
de: Eine D-Bus-Aktion hinzufügen

source: When adding an action you can tweak a few more options. The first one of them defines if the actions is executed repeatedly when the button on the remote control is being held down. This is a useful behavior for actions like increasing or decreasing volume but may be undesired for actions like toggling play/pause on a media player. The second one defines if the target application should be started if it is not running yet when the button is pressed. For example it would not make sense for actions that should close an application to launch it. The third and last option for actions is to define which instance of an application should receive the action if there are more then on instances running. If you have selected an application that cannot be run multiple times this option is disabled.
de: Für D-Bus-Aktionen gibt es einige zusätzliche Optionen. Als erstes muss definiert werden, ob Aktionen wiederholt ausgeführt wird, wenn Sie eine Taste auf der Fernbedienung länger drücken. Diesen Verhalten ist zum Beispiel sinnvoll, um die Lautstärke zu erhöhen oder zu verringern. Für Aktionen wie Wiedergabe/Pause bei der Medienwiedergabe ist es nicht geeignet. Weiterhin muss festgelegt werden, ob das Programm automatisch beim Drücken der Taste gestartet werden soll, wenn es noch nicht läuft. Das automatische Starten sollte zum Beispiel nicht für eine Aktion gewählt werden, die eine Anwendung beendet. Als dritte und letzte Option für Aktionen ist anzugeben, welche Instanz einer Anwendung die Aktion ausführen soll, falls die Anwendung mehrfach gestartet werden kann. Diese Option ist für Anwendung deaktiviert, die nur einmal laufen können.

source: AddActionOptions
de: Einstellungen für Aktionen

source: Options for actions
de: Einstellungen für Aktionen

source: Actions may also be automatically populated using the wizard button. This means that &kremotecontrol; can attempt to match buttons to functions for you. The autopopulate dialog shows all available templates collections with a flag. Depending on the color of the flag your remote control is fully, partially or not supported by that profile. Green means all contained templates can be matched to your remote control, yellow means some of the contained actions match and red means none of the templates can be matched to buttons of your remote control. This doesn't mean that you cannot use those templates. You just have to configure them one by one, setting the desired button by yourself.
de: Mithilfe des Assistenten lassen sich Aktionen auch automatisch erzeugen. Dabei versucht &kremotecontrol; automatisch Aktionen für Tasten zu finden. Im Dialog „Automatisch ausfüllen“ werden alle vorhandenen Vorlagen mit einer Markierung gekennzeichnet. An der Farbe dieser Markierung erkennen Sie, ob Ihre Fernbedienung vollständig (Grün). teilweise (Gelb) oder gar nicht (Rot) unterstützt wird. Bei einem grünen Symbol passen alle enthaltenen Vorlagen zu Ihrer Fernbedienung, ein gelbes Symbol zeigt an, dass nur ein Teil der enthaltenen Aktionen unterstützt wird. Passt keine der Vorlagen zu Ihrer Fernbedienung, sehen Sie eine rote Markierung. Auch bei einer roten Markierung können diese Vorlegen benutzt werden, Sie müssen aber alle gewünschten Tasten manuell einrichten.

source: AutoPopulate
de: Automatisch ausfüllen

source: Automatically generate actions using templates
de: Aktionen automatisch mit Vorlagen erstellen

source: <emphasis role="strong">Note:</emphasis> If your remote control isn't compatible to any profile you might haven't configured LIRC using namespaces.
de: <emphasis role="strong">Hinweis:</emphasis> Wenn Ihre Fernbedienung mit keinem Profil kompatibel ist, haben Sie LIRC vermutlich nicht für die Verwendung von Namensräumen eingerichtet.

source: Advanced Information
de: Zusätzliche Informationen

source: This chapter will discuss some information which might be interesting for more advanced users or developers. You will learn how to create your own profiles.
de: In diesem Kapitel werden zusätzliche Information vorgestellt, die für einen erfahrenen Benutzer oder Entwickler von Interesse sind. In diesem Kapitel finden Sie eine Anweisung, um benutzerdefinierte Profile zu erstellen.

source: Creating a Profile
de: Ein Profil erstellen

source: Nearly all &DBus; capable applications can be used with &kremotecontrol; without any further actions. However, to provide user friendly configuration and let the application appear in the autopopulate dialog you might want to create a profile for it.
de: Fast alle Programme mit einer &DBus;-Schnittstelle können durch &kremotecontrol; ohne zusätzliche Aktionen benutzt werden. Um aber eine grafische Benutzerschnittstelle für die Einrichtung bereitzustellen und das Programm im Dialog <guilabel>Automatisch ausfüllen</guilabel> anzuzeigen, sollten Sie ein Profil dafür erstellen.

source: A profile tells &kremotecontrol; (and the user!) what the various &DBus; calls do. Essentially this is a kind of documentation for &DBus; calls. You don't have to include all &DBus; calls - just the ones that you feel end-users would benefit the most (usually <quote>interface adjusting</quote> calls rather the <quote>information gathering</quote> calls).
de: Ein Profil gibt &kremotecontrol; und dem Benutzer die Funktion der verschiedenen &DBus;-Aufrufe an, Im Grunde ist das eine Art von Dokumentation der &DBus;-Aufrufe. Es müssen nicht alle &DBus;-Aufrufe aufgeführt sein, nur die Wichtigsten für den Endbenutzer. Dazu gehören eher die Aufrufe um die <quote>Schnittstelle einzurichten</quote> als die Aufrufe zu Abfrage von <quote>Informationen</quote>.

source: Profile HowTo
de: Anleitung zur Erstellung von Profilen

source: Make sure the application you want to create the profile for, provides functions on the &DBus; session bus. You can check this by trying to add actions for that application using the manual method in &kremotecontrol;. <quote>qdbusviewer</quote>, an application which is shipped with your Qt4 installation is also a very good tool to find out about &DBus; capabilities of applications.
de: Überprüfen Sie, ob das Programm für das Sie ein Profil erstellen möchten, Funktionen über einen &DBus;-Sitzungsbus anbietet. Dazu versuchen Sie, in &kremotecontrol; manuell eine Aktion für dieses Programm hinzuzufügen. Auch mit dem Programm <quote>qdbusviewer</quote>, das zusammen mit Qt4 installiert wird, können Sie Informationen über die &DBus;-Schnittstelle eines Programms finden.

source: Step by step
de: Ausführliche Anleitung

source: Once you have found the appropriate &DBus; functions you need to describe them in a <filename>appname.profile.xml</filename> document. Here is a quick guide how to create such files:
de: Wenn Sie die passenden &DBus;-Funktionen gefunden haben, müssen diese in der Datei <filename>appname.profile.xml</filename> beschrieben werden. Im folgenden Abschnitt finden Sie eine kurze Einführung zur Erstellung dieser Dateien:

source: First create a new file containing the content below. The tag <quote>name</quote> defines a short descriptive name of the profile. Add a description of the profile in the <quote>description</quote> tag. Also add your name into the <quote>author</quote> tag and a version number in the <quote>version</quote> tag. The version number is important for upgrading your profile. &kremotecontrol; will use the one with the highest number if multiple versions of your profile are found on the system.
de: Erstellen Sie zuerst eine Datei mit den weiter unten angezeigten Inhalt. In <quote>name</quote> geben Sie einen kurzen Namen des Profils ein, der dessen Funktion beschreibt, in <quote>description</quote> eine Beschreibung dieses Profils. Tragen Sie Ihren Namen in <quote>author</quote> und eine Versionsnummer in <quote>version</quote> ein. Die Versionsnummer ist für die Aktualisierung des Profils wichtig, wenn &kremotecontrol; mehrere Versionen eines Profils auf Ihrem Rechner findet, wird das Profil mit der größten Versionsnummer benutzt.

source: &lt;xml version="1.0" encoding="UTF-8"?> &lt;profile xmlns="urn:org-kde-kremotecontrol" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="urn:org-kde-kremotecontrol file:profile.xsd"&gt; &lt;name&gt;My Profile&lt;/name&gt; &lt;version&gt;0.1&lt;/version&gt; &lt;author&gt;Me&lt;/author&gt; &lt;description&gt;Some descriptive information about what the profile does&lt;/description&gt; &lt;action&gt; &lt;-- This tag will be explained in the next step--&gt; &lt;action&gt; &lt;/profile&gt;
de: &lt;xml version="1.0" encoding="UTF-8"?> &lt;profile xmlns="urn:org-kde-kremotecontrol" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="urn:org-kde-kremotecontrol file:profile.xsd"&gt; &lt;name&gt;Mein Profil&lt;/name&gt; &lt;version&gt;0.1&lt;/version&gt; &lt;author&gt;Ich&lt;/author&gt; &lt;description&gt;Beschreibung der Funktionen des Profils&lt;/description&gt; &lt;action&gt; &lt;-- Dies wird im nächsten Schritt erklärt --&gt; &lt;action&gt; &lt;/profile&gt;

source: After you have created the profile skeleton it's time to add some action templates.
de: In diesen Profilentwurf müssen nun einige Aktionen eingefügt werden.

source: &lt;?xml version="1.0" encoding="UTF-8"?> &lt;profile xmlns="urn:org-kde-kremotecontrol" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="urn:org-kde-kremotecontrol file:profile.xsd"&gt; &lt;name&gt;My Profile&lt;/name&gt; &lt;version&gt;0.1&lt;/version&gt; &lt;author&gt;Me&lt;/author&gt; &lt;description&gt;Some descriptive information about what the profile does&lt;/description&gt; &lt;action id="someUniquId" repeat="true|false" button="someButton"&gt; &lt;name&gt;My Action&lt;/name&gt; &lt;description&gt;What this action does&lt;/description&gt; &lt;prototype&gt; &lt;-- This tag will be explained in the next step--&gt; &lt;prototype&gt; &lt;ifmulti&gt;ifMultiOption&lt;/ifmulti&gt; &lt;/action&gt; &lt;/profile&gt;
de: &lt;xml version="1.0" encoding="UTF-8"?> &lt;profile xmlns="urn:org-kde-kremotecontrol" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="urn:org-kde-kremotecontrol file:profile.xsd"&gt; &lt;name&gt;Mein Profil&lt;/name&gt; &lt;version&gt;0.1&lt;/version&gt; &lt;author&gt;Ich&lt;/author&gt; &lt;description&gt;Beschreibung der Funktionen des Profils&lt;/description&gt; &lt;action id="someUniquId" repeat="true|false" button="eineTaste"&gt; &lt;name&gt;Meine Aktion&lt;/name&gt; &lt;description&gt;Beschreibung der Funktion dieser Aktion&lt;/description&gt; &lt;prototype&gt; &lt;-- Dies wird im nächsten Schritt erklärt --&gt; &lt;prototype&gt; &lt;ifmulti&gt;ifMultiOption&lt;/ifmulti&gt; &lt;action&gt; &lt;/profile&gt;

source: First define a unique identifier. This will be used by &kremotecontrol; to match existing actions to the template, for example for reading the description. This id must be unique through the whole profile. The <quote>button</quote> attribute is used for the autopopulate function. Look at the <quote>profile.xsd</quote> schema file for a complete list of available button names. The <quote>repeat</quote> attribute tells whether the action should be executed multiple times if the button on the remote is being held pressed. If the application should be started if not running on incoming button presses set <quote>autostart</quote> to <quote>true</quote>. The attributes <quote>button</quote>, <quote>repeat</quote> and <quote>autostart</quote> are optional. If <quote>repeat</quote> and <quote>autostart</quote> are not defined, they will default to <quote>false</quote>.
de: Geben Sie als erstes einen eindeutigen Bezeichner an. Diese ID wird in &kremotecontrol; dazu benutzt, um vorhandene Aktionen einer Vorlage zuzuordnen, wenn zum Beispiel die Beschreibung eingelesen wird. Diese ID muss innerhalb eines Profils eindeutig sein. Das Attribut <quote>button</quote> wird für das automatische Ausfüllen verwendet. In der Schemadatei <quote>profile.xsd</quote> finden Sie eine vollständige Liste aller möglichen Tastennamen. Das Attribut <quote>repeat</quote> legt fest, ob eine Aktion mehrfach ausgeführt wird, wenn eine Tasten längere Zeit gedrückt wird. Um eine Anwendung, die noch nicht läuft, auf Tastendruck automatisch zu starten, setzen Sie den Wert für <quote>autostart</quote> auf <quote>true</quote>. Die Attribute <quote>button</quote>, <quote>repeat</quote> und <quote>autostart</quote> dürfen auch weggelassen werden. Sind <quote>repeat</quote> und <quote>autostart</quote> nicht definiert, wird als Voreinstellung <quote>false</quote> benutzt.
