Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdeutils/kcontrol_blockdevices.po
Languages: de

source: <title>Block Devices</title>
de: <title>Blockorientierte Geräte</title>

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Frank</firstname><surname>Schütte</surname><affiliation><address><email>F.Schuette@t-online.de</email></address></affiliation><contrib>Deutsche Übersetzung</contrib></othercredit>

source: KControl
de: Kontrollzentrum

source: <keyword>Block Devices</keyword>
de: <keyword>blockorientiert</keyword> <keyword>Gerät</keyword>

source: Disk space
de: Speicherplatz

source: The module window displays the available file devices and some information about each device. It also allows you to control mount points, and mount/unmount devices.
de: Das Modulfenster zeigt eine Liste der vorhandenen Dateigeräte und einige Informationen über jedes dieser Geräte. Sie können Mount-Punkte einstellen und Geräte einbinden (mounten / unmounten).

source: Normally, the following pieces of information are shown in this tab:
de: Standardmäßig werden folgende Informationen auf dieser Seite angezeigt:

source: an icon depicting the type of storage
de: ein Symbol für die Geräteart

source: device name
de: Name des Geräts

source: file system type
de: Art des Dateisystems

source: total size
de: Größe

source: mount point
de: Mount-Punkt

source: free disk space
de: Frei (freier Speicherplatz)

source: the percentage of space used as a number and as a graph.
de: Belegter Speicher prozentual und als Graph.

source: <mousebutton>Left</mousebutton> clicking on the header of a particular column sorts the devices according to that variable. A second <mousebutton>left</mousebutton> click sorts in the opposite order.
de: Durch <mousebutton>Links</mousebutton>-Klicken auf einen der Spaltenköpfe sortieren Sie die betreffende Tabellenspalte aufsteigend. Durch einen weiteren Links-Klick kehren Sie die Sortierreihenfolge um.

source: <mousebutton>Right</mousebutton> clicking on a row pops up a menu. If that device is not currently mounted, the <guimenuitem>Mount Device</guimenuitem> option is available. If the device is mounted, it can be unmounted by choosing <guimenuitem>Unmount Device</guimenuitem>. Selecting <guimenuitem>Open in File Manager</guimenuitem> opens a new window with a graphical view of the files on that device.
de: Durch <mousebutton>Rechts</mousebutton>-Klick in eine Zeile öffnen Sie ein Menü. Falls das Gerät nicht eingebunden (gemountet) ist, ist der Menüeintrag <guimenuitem>Gerät einbinden</guimenuitem> wählbar. Falls das Gerät bereits eingebunden ist, können Sie den Eintrag <guimenuitem>Geräte-Einbindung lösen</guimenuitem> auswählen. Durch den Eintrag <guimenuitem>In Dateimanager öffnen</guimenuitem> können Sie ein neues Fenster mit einer Liste der Dateien dieses Gerätes öffnen.

source: The appropriate mount and unmount commands, and how the file manager is opened from the context menu, can be configured from the &kdiskfree; application.
de: Der geeignete Befehl zum Einbinden und Lösen sowie die Art, wie der Dateimanager aus dem Kontextmenü geöffnet wird, kann von der Anwendung &kdiskfree; aus konfiguriert werden.

source: Section Author
de: Mitwirkende

source: This section is modified from the <application>kdf</application> documentation which was authored by &Jonathan.Singer; &Jonathan.Singer.mail;
de: Dieser Abschnitt wurde auf der Grundlage der Dokumentation zu <application>kdf</application> von &Jonathan.Singer; &Jonathan.Singer.mail; geschrieben.

source: Modified for &kde; 2.0 by &Mike.McBride; &Mike.McBride.mail;
de: Angepasst für &kde; von &Mike.McBride; &Mike.McBride.mail;

source: CREDIT_FOR_TRANSLATORS
de: <para>Deutsche Übersetzung von Frank Schütte <email>F.Schuette@t-online.de</email></para>
