Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdeutils/kcontrol_kremotecontrol.po
Languages: de

source: Add a short name to the <quote>name</quote> tag and a description using the <quote>description</quote> tag. The <quote>ifmulti</quote> property specifies what &kremotecontrol; should do if there are multiple instances running when a button is pressed. You can use the following values for this property: <quote>sendtotop</quote> (send call to the instance on top of the window stack), <quote>sendtobottom</quote> (send call to the instance on bottom of the window stack), <quote>sendtoall</quote> (send to all instances), <quote>dontsend</quote> (don't send the action to any instance) and <quote>unique</quote> (This application does not allow multiple instances). If this tag is not defined &kremotecontrol; assumes that the applications cannot be run multiple times, defaulting this tag to <quote>unique</quote>.
de: Geben Sie einen kurzen Namen für <quote>name</quote> und eine Beschreibung für <quote>description</quote> ein. Die Eigenschaft <quote>ifmulti</quote> legt fest, wie sich &kremotecontrol; bei einem Tastendruck verhält, wenn es mehrere laufenden Instanzen einer Anwendung gibt. Für diese Eigenschaft sind folgende Werte erlaubt: <quote>sendtotop</quote> - die Aktion wird an die oberste Anwendung im dem Fensterstapel weitergegeben, <quote>sendtobottom</quote> - die Aktion wird an die unterste Anwendung im dem Fensterstapel weitergegeben, <quote>sendtoall</quote> -an alle Instanzen, <quote>dontsend</quote> - die Aktion wird nicht an alle Instanzen weitergereicht und <quote>unique</quote> - für diese Anwendung ist nur eine Instanz möglich. Ist dieser Wert nicht definiert, geht &kremotecontrol; davon aus, dass die Anwendung nur einmal ausgeführt werden kann und benutzt die Voreinstellung <quote>unique</quote>.

source: Next define the &DBus; function which should be executed in the <quote>prototype</quote> tag:
de: Als nächstes wird die auszuführende &DBus;-Funktion in <quote>prototype</quote> definiert:

source: &lt;?xml version="1.0" encoding="UTF-8"?> &lt;profile xmlns="urn:org-kde-kremotecontrol" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="urn:org-kde-kremotecontrol file:profile.xsd"&gt; &lt;name&gt;My Profile&lt;/name&gt; &lt;version&gt;0.1&lt;/version&gt; &lt;author&gt;Me&lt;/author&gt; &lt;description&gt;Some descriptive information about what the profile does&lt;/description&gt; &lt;action id="someUniquId" repeat="true|false" button="someButton"&gt; &lt;name&gt;My Action&lt;/name&gt; &lt;description&gt;What this action does&lt;/description&gt; &lt;prototype&gt; &lt;serviceName&gt;org.example.application&lt;/serviceName&gt; &lt;node&gt;Some/Node&lt;/node&gt; &lt;function&gt;function&lt;/function&gt; &lt;/prototype&gt; &lt;ifmulti&gt;ifMultiOption&lt;/ifmulti&gt; &lt;/action&gt; &lt;/profile&gt;
de: &lt;xml version="1.0" encoding="UTF-8"?> &lt;profile xmlns="urn:org-kde-kremotecontrol" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="urn:org-kde-kremotecontrol file:profile.xsd"&gt; &lt;name&gt;Mein Profil&lt;/name&gt; &lt;version&gt;0.1&lt;/version&gt; &lt;author&gt;Ich&lt;/author&gt; &lt;description&gt;Beschreibung der Funktionen des Profils&lt;/description&gt; &lt;action id="someUniquId" repeat="true|false" button="eineTaste"&gt; &lt;name&gt;Meine Aktion&lt;/name&gt; &lt;description&gt;Beschreibung der Funktion dieser Aktion&lt;/description&gt; &lt;prototype&gt; &lt;serviceName&gt;org.example.application&lt;/serviceName&gt; &lt;node&gt;Some/Node&lt;/node&gt; &lt;function&gt;function&lt;/function&gt; &lt;prototype&gt; &lt;ifmulti&gt;ifMultiOption&lt;/ifmulti&gt; &lt;action&gt; &lt;/profile&gt;

source: <quote>servicename</quote> holds the &DBus; service name for the application, &eg; <quote>org.kde.plasma-desktop</quote>. <quote>node</quote> holds the respective &DBus; node such as <quote>App</quote>. Add the function name without return value and arguments using the <quote>function</quote> tag. For example <quote>toggleDashboard</quote>.
de: <quote>servicename</quote> enthält den Namen des &DBus;-Dienstes für die Anwendung, &eg; <quote>org.kde.plasma-desktop</quote>. In <quote>node</quote> ist der zugehörige &DBus;-Knoten wie <quote>App</quote> einzutragen. Geben Sie den Funktionsnamen ohne Rückgabewert und Argumente in <quote>function</quote> an, zum Beispiel <quote>toggleDashboard</quote>.

source: If the function has arguments you need to describe each one of those, providing a description for the user, a type and optionally a default value. A list of supported types is can be found in the <quote>profile.xsd</quote> schema file. The <quote>comment</quote> tag should contain a nice user friendly description of what the argument is used for. You should also declare a default value for each argument between the <quote>default</quote> tags. Note that templates containing a button need to supply a default value for all arguments or the autopopulate function will produce broken functions.
de: Erfordert eine Funktion zusätzliche Argumente, muss für jedes Argument der Typ, eine Beschreibung für den Benutzer und optional ein Standardwert angegeben werden. Eine Liste der möglichen Argumenttypen finden Sie in der Schemadatei <quote>profile.xsd</quote>. In <quote>comment</quote> sollte eine benutzerfreundliche Beschreibung der Funktion des Arguments enthalten sein. In <quote>default</quote> sollten Sie einen Standardwert vorgeben. In Vorlagen für eine Taste müssen alle Argumente Standardwerte haben, sonst führt die Verwendung von <quote>Automatisch ausfüllen</quote> zu nicht korrekt arbeitenden Funktionen.

source: &lt;?xml version="1.0" encoding="UTF-8"?> &lt;profile xmlns="urn:org-kde-kremotecontrol" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="urn:org-kde-kremotecontrol file:profile.xsd"&gt; &lt;name&gt;My Profile&lt;/name&gt; &lt;version&gt;0.1&lt;/version&gt; &lt;author&gt;Me&lt;/author&gt; &lt;description&gt;Some descriptive information about what the profile does&lt;/description&gt; &lt;action id="someUniquId" repeat="true|false" button="someButton"&gt; &lt;name&gt;My Action&lt;/name&gt; &lt;description&gt;What this action does&lt;/description&gt; &lt;prototype&gt; &lt;serviceName&gt;org.example.application&lt;/serviceName&gt; &lt;node&gt;SomeNode&lt;/node&gt; &lt;function&gt;function&lt;/function&gt; &lt;arguments&gt; &lt;argument type="QString"&gt; &lt;comment&gt;Additional comment&lt;/comment&gt; &lt;default&gt;someValue&lt;/default&gt; &lt;/argument&gt; &lt;/arguments&gt; &lt;/prototype&gt; &lt;ifmulti&gt;ifMultiOption&lt;/ifmulti&gt; &lt;/action&gt; &lt;/profile&gt;
de: &lt;xml version="1.0" encoding="UTF-8"?> &lt;profile xmlns="urn:org-kde-kremotecontrol" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="urn:org-kde-kremotecontrol file:profile.xsd"&gt; &lt;name&gt;Mein Profil&lt;/name&gt; &lt;version&gt;0.1&lt;/version&gt; &lt;author&gt;Ich&lt;/author&gt; &lt;description&gt;Beschreibung der Funktionen des Profils&lt;/description&gt; &lt;action id="someUniquId" repeat="true|false" button="eineTaste"&gt; &lt;name&gt;Meine Aktion&lt;/name&gt; &lt;description&gt;Beschreibung der Funktion dieser Aktion&lt;/description&gt; &lt;prototype&gt; &lt;serviceName&gt;org.example.application&lt;/serviceName&gt; &lt;node&gt;Some/Node&lt;/node&gt; &lt;function&gt;function&lt;/function&gt; &lt;arguments&gt; &lt;argument type="QString"&gt; &lt;comment&gt;Zusätzlicher Kommentar&lt;/comment&gt; &lt;default&gt;einWert&lt;/default&gt; &lt;/argument&gt; &lt;/arguments&gt; &lt;prototype&gt; &lt;ifmulti&gt;ifMultiOption&lt;/ifmulti&gt; &lt;action&gt; &lt;/profile&gt;

source: To test and use the profile you need to copy it into <filename>$(kde_datadir)/profiles</filename> and restart &kremotecontrol;.
de: Um das Profil zu benutzen und zu testen, müssen Sie es in den Ordner <filename>$(kde_datadir)/profiles</filename> kopieren und &kremotecontrol; neu starten.

source: If you would like to contribute the profile to the &kde; SC please send it to the kdeutils team at <email>kde-utils-devel@kde.org</email>.
de: Möchten Sie Profile zur &kde; SC beisteuern, senden Sie sie bitte unter der Adresse <email>kde-utils-devel@kde.org</email> an das KDE-Utils-Team .
