Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdeutils/kdf.po
Languages: de

source: The &kdiskfree; Handbook
de: Das Handbuch zu &kdiskfree;

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Gregor</firstname><surname>Zumstein</surname><affiliation><address><email>zumstein@ssd.ethz.ch</email></address></affiliation><contrib>Übersetzung von</contrib></othercredit>

source: &kdiskfree; displays available file devices, along with information about them.
de: &kdiskfree; zeigt Informationen über die verfügbaren Plattenbereiche (Partitionen).

source: disks
de: Festplatte

source: devices
de: Geräte

source: Introduction
de: Einleitung

source: &kdiskfree; displays the available file devices (hard drive partitions, floppy and &CD; drives, USB sticks &etc;) along with information on their capacity, free space, type and mount point. It also allows you to mount and unmount drives and view them in a file manager.
de: &kdiskfree; zeigt die verfügbaren Plattenbereiche an (Partitionen auf Festplatten, Disketten, &CD;-Laufwerke, USB-Sticks &etc;). Zu jedem Bereich wird die Gesamtgröße, der freie Bereich, das Dateisystem und der Ort der Einbindung ins Dateisystem (Mount-Punkt) angezeigt. Mit &kdiskfree; können auch (sofern die Berechtigung vorhanden ist) Laufwerke eingebunden/gelöst und der Dateimanager mit der Anzeige für dieses Laufwerk geöffnet werden.

source: &kdiskfree; is similar to the &kinfocenter; Partitions module, but takes up less screen space. It is useful if you want to keep a &kdiskfree; window available at all times.
de: &kdiskfree; hat Ähnlichkeiten mit dem Modul „Partitionen“ aus dem &kinfocenter; braucht aber weniger Platz auf dem Bildschirm und ist deshalb nützlich, wenn immer ein &kdiskfree;-Fenster geöffnet sein soll.

source: Using &kdiskfree;
de: Wie benutze ich &kdiskfree;

source: Starting &kdiskfree;
de: Starten von &kdiskfree;

source: Type <userinput><command>kdf</command></userinput> at a command prompt or select <guimenuitem>Disk Free</guimenuitem> from the <guisubmenu>System</guisubmenu> group in the application launcher. The standard &Qt; and &kde; command options are available, and can be listed by entering <userinput><command>kdf</command> <option>--help</option></userinput> at the command prompt.
de: Um das Programm zu starten, geben Sie <userinput><command>kdf</command></userinput> auf der Befehlszeile ein oder wählen <guimenuitem>KDiskFree</guimenuitem> aus der Gruppe <guisubmenu>System</guisubmenu> im Anwendungsstarter. Die Standard &Qt;- und &kde;-Befehlszeilenparameter sind verfügbar und können mit dem Befehl <userinput><command>kdf<option>--help</option></command></userinput> angezeigt werden.

source: The Main window
de: Das Hauptfenster

source: The main &kdiskfree; window displays the available file devices.
de: Das Hauptfenster von &kdiskfree; zeigt die verfügbaren Partitionen an.

source: Normally, the following pieces of information are included:
de: Standardmäßig werden die folgenden Informationen angezeigt:

source: <screeninfo>&kdiskfree; Screen</screeninfo>
de: <screeninfo>&kdiskfree; Anzeige </screeninfo>

source: <phrase>&kdiskfree; Screen</phrase>
de: <phrase>&kdiskfree; Anzeige</phrase>

source: an icon depicting the type of storage
de: Ein Symbol, das den Gerätetyp angibt

source: device name
de: Der Gerätename

source: filesystem type
de: Der Dateisystemtyp

source: total size
de: Die Gesamtgröße

source: mount point
de: Der Mount-Punkt

source: free disk space
de: Der freie Speicher

source: the percentage of space used as a number and as a graph.
de: Die Belegung der Partition in Prozent und als Auslastungsdiagramm.

source: <mousebutton>Left</mousebutton> clicking on the header of a particular column sorts the devices according to that variable. A second <mousebutton>left</mousebutton> click sorts in the opposite order.
de: Ein <mousebutton>Druck mit der linken Maustaste</mousebutton> auf die Beschreibung einer Spalte sortiert die Anzeige nach diesem Kriterium. Ein weiterer Druck kehrt die Sortierrichtung um.

source: Clicking with the &RMB; on a row pops up a menu. If that device is not currently mounted, the <guimenuitem>Mount Device</guimenuitem> option is available. If the device is mounted, it can be unmounted by choosing <guimenuitem>Unmount Device</guimenuitem>. Selecting <guimenuitem>Open in File Manager</guimenuitem> opens a new window with a graphical view of the files on that device.
de: Klicken Sie mit der &RMBn; auf eine Zeile, um ein Menü zu öffnen. Wenn die Partition noch nicht eingebunden ist, steht die Aktion <guimenuitem>Gerät einbinden</guimenuitem> zu Verfügung. Wenn eine Partition bereits eingebunden ist, so kann hier <guimenuitem>Geräte-Einbindung lösen</guimenuitem> gewählt werden. Der Menüpunkt <guimenuitem>In Dateimanager öffnen</guimenuitem> öffnet ein neues Fenster, in dem die Dateien auf dieser Partition angezeigt werden. Welcher Dateimanager geöffnet werden soll, kann im Dialog <guimenuitem>KDiskFree einrichten</guimenuitem> bestimmt werden.

source: Menu Bar and Configuration
de: Menüleiste und Einstellungen

source: The File Menu
de: Das Menü Datei

source: <guimenu>File</guimenu> <guimenuitem>Update</guimenuitem>
de: <guimenu>Datei</guimenu> <guimenuitem>Aktualisieren</guimenuitem>

source: Immediately updates the display to reflect the current status
de: Zeigt sofort den aktuellen Zustand der Partitionen an.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Quit</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo> </shortcut> <guimenu>Datei</guimenu> <guimenuitem>Beenden</guimenuitem>

source: <action>Closes</action> &kdiskfree;
de: <action>Schließt</action> das &kdiskfree;-Fenster.

source: Additionally &kdiskfree; has some common &kde; <guimenu>Settings</guimenu> and <guimenu>Help</guimenu> menu items, for more information read the sections about the <ulink url="help:/fundamentals/ui.html#menus-settings">Settings Menu</ulink> and <ulink url="help:/fundamentals/ui.html#menus-help">Help Menu</ulink> of the &kde; Fundamentals.
de: Zusätzlich hat &kdiskfree; die bekannten &kde;-Einträge im Menü <guimenu>Einstellungen</guimenu> und <guimenu>Hilfe</guimenu>, weitere Informationen dazu finden Sie in den Abschnitten über die Menüs <ulink url="help:/fundamentals/ui.html#menus-settings">Einstellungen</ulink> und <ulink url="help:/fundamentals/uihtml#menus-help">Hilfe</ulink> der &kde;-Grundlagen.

source: The Settings Dialog
de: Der Einrichtungsdialog

source: <screeninfo>Configure &kdiskfree; Screen</screeninfo>
de: <screeninfo>&kdiskfree;-Einrichtungsdialog</screeninfo>

source: <phrase>Configure &kdiskfree; Screen</phrase>
de: <phrase>&kdiskfree;-Einrichtungsdialog</phrase>

source: This dialog has two tabbed windows, <guilabel>General Settings</guilabel> and <guilabel>Mount Commands</guilabel>
de: Dieser Dialog besteht aus zwei Teilen, <guilabel>Allgemeine Einstellungen</guilabel> und <guilabel>Befehle zum Einbinden</guilabel>:

source: General Settings
de: Allgemeine Einstellungen

source: Click on the word <guilabel>visible</guilabel> or <guilabel>hidden</guilabel> to turn display of an data field on or off.
de: Um eine Information anzuzeigen bzw. auszublenden, klicken Sie auf <guilabel>angezeigt</guilabel> oder <guilabel>ausgeblendet</guilabel>.

source: Change the update frequency by editing the value. The value in the box is the interval (in seconds) between updates of the &kdiskfree; display to reflect the current status.
de: Die <guilabel>Aktualisierungsfrequenz</guilabel> wird durch Eingabe eines Wertes geändert. Dieser Wert gibt an, nach wie vielen Sekunden eine Aktualisierung der Anzeige in &kdiskfree; durchgeführt wird.

source: The <guilabel>File Manager</guilabel> setting controls the command executed when the <guimenuitem>Open Filemanager</guimenuitem> popup menu item is selected.
de: Im Eingabefeld <guilabel>Dateimanager</guilabel> können Sie einem ein Befehl eingeben, der dann ausgeführt wird, wenn im Kontextmenü <guimenuitem>In Dateimanager öffnen</guimenuitem> gewählt wird.

source: There are also two check boxes. One controls if a file manager window will be automatically opened when a device is mounted. The other causes an alert window to pop up if a disk gets critically full.
de: In einem ersten Ankreuzfeld kann angegeben werden, ob der Dateimanager automatisch beim Einbinden einer Partition geöffnet werden soll. Im zweiten kann eingestellt werden, dass sich ein Warnfenster öffnet, wenn der freie Speicher eine kritische Größe unterschreitet.

source: Mount Commands
de: Befehle zum Einbinden

source: Allows the user to specify the mount and unmount commands for a given device, as well as the icon used to represent it. More information on these commands can be found on the man page for <application>mount</application> (type <userinput><command>man</command> <option>mount</option></userinput> at the command prompt).
de: Hier werden die Befehle zum Einbinden und Lösen für jede einzelne Partition und das Symbol für den Partitionstyp festgelegt. Informationen über diese Befehle finden sich in der Handbuchseite zu mount (<command>man <option>mount</option></command> auf der Befehlszeile oder in der Adressleiste in &konqueror; eingeben).

source: Credits and License
de: Danksagungen und Lizenz

source: Program Copyright &copy; 1998-2000 &Michael.Kropfberger; &Michael.Kropfberger.mail;
de: Copyright des Programms &copy; 1998-2000 &Michael.Kropfberger; &Michael.Kropfberger.mail;.

source: Documentation Copyright &copy; 2000 &Jonathan.Singer; &Jonathan.Singer.mail;
de: Copyright für die Dokumentation &copy; 2000 &Jonathan.Singer; &Jonathan.Singer.mail;.

source: CREDIT_FOR_TRANSLATORS
de: <para>Übersetzung Gregor Zumstein <email>zumstein@ssd.ethz.ch</email></para>
