Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdeutils/kfloppy.po
Languages: de

source: Be careful when entering the device name. &kfloppy; will pass the device name as is to the external programs. Especially it does not check (and the external programs do not check either) if the device is a <hardware>floppy drive</hardware> device. If you give your any of your main disk partitions as device, it will be accepted. (If the partition is mounted or if you cannot write on this device, you will probably get an error message nevertheless, avoiding the worst.)
de: Seien Sie vorsichtig bei der Eingabe des Gerätenamens. &kfloppy; übergibt diesen Gerätenamen genau so an die externen Programme. Insbesondere erfolgt keine Überprüfung (auch nicht durch die externen Programme), ob es sich um ein <hardware>Diskettenlaufwerk</hardware> handelt. Geben Sie hier eine ihrer Festplattenpartitionen an, wird auch diese akzeptiert. (Ist die Partition eingebunden oder schreibgeschützt, erhalten sie allerdings wahrscheinlich eine Fehlermeldung, und das Schlimmste wird verhindert.)

source: Even if you can specify a floppy device like <filename>/dev/fd0u2880</filename>, &kfloppy; will refuse to make a <guilabel>Full Format</guilabel> on it.
de: Selbst wenn Sie ein Gerät für ein Diskettenlaufwerk wie <filename>/dev/fd0u2880</filename> angeben können, verweigert &kfloppy; das Ausführen der Funktion <guilabel>Vollständige Formatierung</guilabel> darauf.

source: On &Linux;, you can select any file system that you want. On &BSD;, only UFS is currently supported (and not tested at time of writing this documentation).
de: Unter &Linux; können Sie jedes gewünschte Dateisystem wählen, unter &BSD; wird derzeit nur UFS unterstützt (wobei diese Funktion zum Zeitpunkt der Erstellung dieser Dokumentation nicht getestet ist).

source: When you are ready to format, click on the <guibutton>Format</guibutton> button as usual. You will get a message box asking you to verify the device name.
de: Wenn Sie zum Formatieren bereit sind, drücken Sie wie sonst auf den Knopf <guibutton>Formatieren</guibutton>. Es erscheint dann ein Fenster, in dem der Gerätename bestätigt werden muss.

source: This is the last chance to check the device name before formating. After it, it is too late.
de: Das ist die letzte Gelegenheit zur Überprüfung des angegebenen Gerätenamens vor dem Formatieren. Danach ist es zu spät.
