Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdeutils/kfloppy.po
Languages: de

source: The &kfloppy; Formatter Handbook
de: Das Handbuch zu &kfloppy;

source: Developer
de: Entwickler

source: Developer (User Interface re-design)
de: Entwickler (Überarbeitung der Benutzeroberfläche)

source: Developer (Add &BSD; support)
de: Entwickler (Hinzufügen der Unterstützung für &BSD;)

source: Reviewer
de: Korrektur

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Gregor</firstname><surname>Zumstein</surname><contrib>Übersetzung von</contrib><affiliation><address><email>zumstein@ssd.ethz.ch</email></address></affiliation></othercredit>

source: &kfloppy; Formatter is a utility that provides a straightforward graphical means to format 3.5" and 5.25" floppy disks.
de: &kfloppy;, ist ein einfaches Programm, zum Formatieren von 3.5<quote>- und 5.25</quote>-Disketten.

source: floppy
de: diskette

source: format
de: formatieren

source: Introduction
de: Einleitung

source: &kfloppy; depends on external programs and therefore currently works <emphasis>only</emphasis> with &Linux; and &BSD;. Depending if you are using &kfloppy; on &Linux; or on &BSD;, &kfloppy; has slightly different features.
de: &kfloppy; verwendet externe Programme und arbeitet darum derzeit <emphasis>nur</emphasis> mit &Linux; und &BSD;. Abhängig davon, ob Sie &kfloppy; unter &Linux; oder &BSD; verwenden, bietet es leicht unterschiedliche Funktionalitäten.

source: Make sure that your floppy disk is <emphasis>not</emphasis> mounted. &kfloppy; cannot format a mounted floppy disk.
de: Vergewissern Sie sich, dass die Diskette <emphasis>nicht</emphasis> eingebunden (gemountet) ist. &kfloppy; kann keine eingebundenen Disketten formatieren.

source: Using &kfloppy;
de: Arbeiten mit &kfloppy;

source: Starting &kfloppy; opens a single window by which the user may choose appropriate settings and control the formatting process. These options and controls are detailed below.
de: Beim Start von &kfloppy; ist ein einzelnes Fenster geöffnet, in dem die gewünschten Einstellungen vorgenommen und der Formatiervorgang überprüft werden können. Die zur Verfügung stehenden Einstellungen werden im Folgenden vorgestellt.

source: Control Settings
de: Steuerungseinstellungen

source: The settings are chosen by means of three drop down boxes located at the top left center of &kfloppy;.
de: Die Steuerungseinstellungen werden mit Hilfe von drei Auswahlfeldern vorgenommen. Diese befinden sich in der linken oberen Ecke des &kfloppy;-Fensters.

source: Floppy Drive
de: Diskettenlaufwerk

source: Clicking on the top drop down box, which is labeled <guilabel>Floppy drive:</guilabel>, offers the user the following two choices:
de: Ein Klick auf das oberste Auswahlfeld mit dem Namen <guilabel>Diskettenlaufwerk</guilabel>, erlaubt die Auswahl aus zwei Möglichkeiten:

source: Primary
de: Primär

source: Secondary
de: Sekundär

source: Clicking on the second drop down box from the top, which is labeled <guilabel>Size:</guilabel>, offers the user the following four choices:
de: Ein Klick auf das mittlere Auswahlfeld mit dem Namen <guilabel>Größe</guilabel>, erlaubt die Auswahl aus vier Möglichkeiten:

source: The &Linux; version of &kfloppy; has also a choice of size named:
de: Die &Linux;-Version von &kfloppy; bietet darüberhinaus eine weitere Größe an:

source: Auto-Detect
de: Automatisch erkennen

source: The 800KB disk format used by <hardware>&Mac; floppy drives</hardware> cannot be supported on <hardware>PC floppy drives</hardware> since they are not capable of formatting disks in that fashion.
de: Das 800 KByte Diskettenformat, das von alten <hardware>&Mac;-Diskettenlaufwerken</hardware> benutzt wird, kann nicht eingestellt werden, da die PC-Diskettenlaufwerke dieses Format nicht unterstützen.

source: File Systems
de: Dateisysteme

source: The third drop down box, labeled File System, offers the user the following choices, if they are applicable:
de: Das dritte Auswahlfeld mit dem Namen <guimenuitem>Dateisystem</guimenuitem> erlaubt ,sofern vorhanden, die Auswahl aus den folgenden Möglichkeiten:

source: This selection will have &kfloppy; place the MS-DOS/&Windows; type of file system on the diskette. The user will most likely want to choose this system if she or he will be using the diskette with those operating systems as they do not recognize other system types. (This is supported for &Linux; and &BSD;.)
de: Mit dieser Einstellung formatiert &kfloppy; die Diskette mit dem MSDOS/&Windows; Dateisystem (FAT) formatieren. Wenn Dateien mit diesen beiden Systemen ausgetauscht werden müssen, ist dies die einzig sinnvolle Einstellung, da diese Systeme keine anderen Formate lesen können. (Unterstützt unter &Linux; und &BSD;.)

source: This selection will have &kfloppy; place the type of file system on the diskette which is most commonly used with &Linux;, however seldomly on floppy disks. (This is supported for &Linux; and &BSD;.)
de: Mit dieser Einstellung formatiert &kfloppy; die Diskette mit dem unter &Linux; gebräuchlichen Dateisystem, das aber nur selten für Disketten benutzt wird. (Unterstützt unter &Linux; und &BSD;.)

source: This selection will have &kfloppy; place the type of file system on the diskette which is most commonly used with <trademark class="registered">FreeBSD</trademark>. The user will likely want to choose this system if he or she will only be using the floppy disk with <trademark class="registered">FreeBSD</trademark>. (This is supported for &BSD; only.)
de: Mit dieser Einstellung formatiert &kfloppy; die Diskette mit dem unter <trademark class="registered">FreeBSD</trademark> gebräuchlichen Dateisystem. Eine Formatierung mit diesem Dateisystem ist sinnvoll, wenn Daten nur mit <trademark class="registered">FreeBSD</trademark>-Systemen ausgetauscht werden sollen. (Unterstützt nur unter &BSD;.)

source: This selection will have &kfloppy; place the type of file system on the diskette which often used on floppy disks used with &Linux;, (This is supported for &Linux; only.)
de: Mit dieser Einstellung formatiert &kfloppy; die Diskette mit dem unter &Linux; gebräuchlichen Dateisystem. Eine Formatierung mit diesem Dateisystem macht Sinn, wenn Daten nur mit anderen &Linux;-Rechnern ausgetauscht werden sollen.

source: Formatting Options
de: Formatierungseinstellungen

source: Within the outline of a box in the left center of &kfloppy; the user may find a set of five formatting options. The top two are a pair of radio buttons.
de: Im Kästchen links in der Mitte des &kfloppy;-Fensters finden sich fünf Einstellungen zur Formatierung. Die drei oberen sind Auswahlknöpfe.

source: This term (radio buttons) indicates a set of options among which only one can be selected - in the same way that only one preset channel selection may be set on a car radio.
de: Auswahlknöpfe stellen eine Möglichkeit dar, genau einen Eintrag aus einer Liste zu wählen, ähnlich wie die Senderwahltasten bei einem Autoradio.

source: The bottom two options are for labeling the diskette. All are explained below:
de: Die beiden untersten Einstellungen dienen dem Bezeichnen der Diskette. Sie sind im Folgenden erläutert:

source: Formatting Method
de: Formatieren

source: &kfloppy; can format a disk in the following two ways:
de: &kfloppy; kann eine Diskette auf zwei Arten formatieren:

source: Quick Format
de: Schnellformatierung

source: This simply puts the new file system on the disk.
de: Hierdurch wird nur das neue Dateisystem auf die Diskette geschrieben.

source: All data on the disk will be lost, even if the data itself will not erased.
de: Alle Daten auf der Diskette gehen verloren, auch wenn die Daten selbst nicht gelöscht werden.

source: Zero out and quick format
de: Ausnullen und Schnellformatierung

source: This format first puts zeros on the disk and then creates the new file system.
de: Diese Methode schreibt Nullbytes auf die Diskette und erstellt dann das neue Dateisystem.

source: All data on the disk will be erased.
de: Alle Daten auf der Diskette werden gelöscht.

source: Full Format
de: Vollständige Formatierung

source: A full format reallocates the tracks and sectors, puts the selected file system on the disk, and then verifies the format, blocking out any bad sectors it finds.
de: Eine vollständige Formatierung erzeugt zuerst alle Spuren und Sektoren neu, schreibt dann das Dateisystem auf die Diskette und verifiziert die Formatierung. Defekte Sektoren werden ermittelt und als solche gekennzeichnet.

source: Verify Integrity
de: Integrität prüfen

source: This tells &kfloppy; to check that the formatting was correctly written to the floppy. This allows bad sectors to be identified.
de: Das Ankreuzfeld <guilabel>Integrität prüfen</guilabel> bewirkt, dass &kfloppy; überprüft, ob die Formatierung korrekt durchgeführt wurde. Hierdurch können defekte Sektoren erkannt werden.

source: If bad sectors a found during the verify phase of a Full Format, the formatting is aborted and the file system is not written!
de: Werden defekte Sektoren bei der Prüfung durch die Vollständige Formatierung gefunden, wird die Formatierung abgebrochen und das Dateisystem nicht auf die Diskette geschrieben.

source: Volume Label
de: Datenträgerbezeichnung

source: The bottom two features allow the user to add (or change) a label to the diskette. If the <guilabel>Volume label:</guilabel> check box is selected then the user can enter a name (label) for the diskette that is to be formatted in the text box located immediately below. When the diskette is subsequently formatted the label will be written to the diskette.
de: Die untersten beiden Eingabemöglichkeiten erlauben, eine Datenträgerbezeichnung hinzuzufügen oder zu ändern. Ist das Ankreuzfeld <guilabel>Datenträgerbezeichnung:</guilabel> markiert, kann eine Datenträgerbezeichnung angegeben werden. Diese wird nach dem Formatieren als Name (Datenträgerbezeichnung) auf die Diskette geschrieben.

source: Due to a limitation of the DOS file system, a label can only be at most 11 characters long. For simplification, &kfloppy; assumes that this limit is true for all file systems.
de: Bedingt durch eine Einschränkung des DOS-Dateisystems kann eine Datenträgerbezeichnung maximal 11 Zeichen haben. &kfloppy; nimmt der Einfachheit halber an, dass diese Einschränkung für alle Dateisysteme gilt.

source: The file system &Minix; cannot have any volume label. In this case, &kfloppy; will ignore the volume label.
de: Das Dateisystem &Minix; unterstützt keine Datenträgerbezeichnung. In diesem Fall ignoriert &kfloppy; die Datenträgerbezeichnung.

source: The Buttons
de: Die Knöpfe

source: There are three buttons located vertically along the right side of &kfloppy;.
de: Auf der rechten Seite des &kfloppy;-Fenster befinden sich drei Knöpfe.

source: Format
de: Formatieren

source: This button initiates the formatting process. Once the user is sure that all the settings are correct he or she may begin the process by clicking on this button. There will be a change in the two long rectangular boxes that span the bottom of &kfloppy;.
de: Mit diesem Knopf wird der Formatierungsvorgang gestartet. Während des Formatierungsprozesses ändert sich auch die Darstellung in den beiden rechteckigen Bereichen, die im unteren Bereich von &kfloppy; angezeigt werden.

source: The upper box is a status indicator that gives information about the process underway, especially the error encountered during the processing.
de: Der obere Bereich ist eine Statusanzeige mit Informationen über den Fortschritt der Formatierung und zeigt insbesondere auch aufgetretene Fehler an.

source: The lower box is a progress bar. This displays both graphically and numerically the progress of first the formatting and then the verification. Before starting it appears to be empty - showing only the figure 0% in the center. As each process takes place the progress is tracked graphically as the box fills from left to right. At the same time the number in the center will increase reflecting the precise percentage of the process that has been completed.
de: Während der Formatierung wird der Fortschritt im untersten Teil des &kfloppy;-Fensters angezeigt. Es werden ein Fortschrittsbalken und der Fortschritt des Vorgangs in Prozent angezeigt. Vor Beginn des Vorgangs erscheint dieser Bereich leer und zeigt in der Mitte den Wert 0% an. Bei jedem Vorgang wird der Fortschritt grafisch durch den Füllgrad des Bereichs angezeigt. Gleichzeitig ändert sich die Prozentangabe in der Mitte entsprechend.

source: As &kfloppy; uses external programs to format the floppy disk, it has to rely on these programs to give the right information for being able to display the progress bar. Unfortunately, this is not the case. Especially, the programs writing the file systems do not return enough data, so that the progress bar will remain at 0%.
de: Da &kfloppy; zum Formatieren der Disketten externe Programme verwendet, ist es darauf angewiesen, dass es von diesen korrekte Informationen über den Fortschritt des laufenden Vorgangs erhält. Unglücklicherweise funktioniert das nicht. Insbesondere die Programme, die das Dateisystem schreiben, liefern nicht genügend Informationen zurück, sodass der Fortschrittsbalken bei 0% stehen bleibt.

source: &kfloppy; does <emphasis>not</emphasis> unmount the floppy by itself, as this could mean that the user may overwrite a floppy disk with important data on it.
de: &kfloppy; löst die Einbindung einer Diskette <emphasis>nicht</emphasis> selbst. Hierdurch könnten versehentlich wichtige Daten überschrieben werden.

source: Help
de: Hilfe

source: This invokes a popup menu with actions to open this handbook, report a bug, switch the application language and display author and version of &kfloppy; and &kde;.
de: Damit wird ein Aufklappmenü angezeigt, das Aktionen wie das Öffnen dieses Handbuchs, das Erstellen eines Fehlerberichts, den Wechsel der Sprache für diese Anwendung und die Anzeige von Autor und Version von &kfloppy; und &kde; enthält.

source: Quit
de: Beenden

source: Clicking on this button will close &kfloppy;.
de: Ein Klick auf diesen Knopf beendet &kfloppy;.

source: Command line options
de: Befehlszeilenparameter

source: Though &kfloppy; may most often be started from the &kde; program menu, or a desktop icon, it can also be opened at the command line prompt of a terminal window. There are a few options that are available when doing this. They are:
de: &kfloppy; wird zwar meistens aus dem &kde;-Programmmenü oder von der Arbeitsfläche aus gestartet. Es ist jedoch auch möglich, es direkt von der Befehlszeile aufzurufen. Folgende Parameter stehen dabei zur Verfügung:

source: This lists the most basic options available at the command line.
de: Zeigt die wichtigsten Befehlszeilenparameter an.

source: This lists the options available for changing the way &kfloppy; interacts with &Qt;.
de: Parameter speziell für das Zusammenspiel mit &Qt;

source: This lists the options available for changing the way &kfloppy; interacts with &kde;.
de: Parameter speziell für das Zusammenspiel mit &kde;.

source: This lists all of the command line options.
de: Zeigt alle verfügbaren Parameter an.

source: Lists &kfloppy;'s author in the terminal window
de: Gibt den Autor von &kfloppy; im Terminalfenster aus.

source: Lists version information for &Qt;, &kde;, and &kfloppy;. Also available through <command>kfloppy <option>-V</option></command>
de: Zeigt die Versionen von &Qt;, &kde; und &kfloppy; an. Dieser Parameter kann mit <command>kfloppy <option>-V</option></command> abgekürzt werden.

source: Credits and License
de: Danksagungen und Lizenz

source: &kfloppy; Formatter Program Copyright 1997 - 2000 &Bernd.Johannes.Wuebben; <email>wuebben@math.cornell.edu</email>
de: &kfloppy;, das Diskettenformatierprogramm: Copyright 1997-2000 &Bernd.Johannes.Wuebben; <email>wuebben@math.cornell.edu</email>

source: &kfloppy; Formatter Program Copyright 2002 Adriaan de Groot <email>groot@kde.org</email>
de: &kfloppy;, das Diskettenformatierungsprogramm, Copyright 2002 Adriaan de Groot <email>groot@kde.org</email>

source: &kfloppy; Formatter Program Copyright 2004, 2005 &Nicolas.Goutte; &Nicolas.Goutte.mail;
de: &kfloppy;, das Diskettenformatierungsprogramm Copyright 2004, 2005 &Nicolas.Goutte; &Nicolas.Goutte.mail;

source: Documentation Copyright 2000 by &Thad.McGinnis; &Thad.McGinnis.mail;.
de: Copyright für die Dokumentation 2000 &Thad.McGinnis; &Thad.McGinnis.mail;.

source: This version of the &kfloppy; Handbook is based on the original by &David.Rugge; <email>davidrugge@mindspring.com</email>
de: Diese Version des Handbuchs zu &kfloppy; basiert auf der ursprünglichen Version von &David.Rugge; <email>davidrugge@mindspring.com</email>

source: CREDIT_FOR_TRANSLATORS
de: <para>Übersetzung Gregor Zumstein <email>zumstein@ssd.ethz.ch</email></para>

source: Needed External Programs
de: Benötigte externe Programme

source: As already written earlier in this handbook, &kfloppy; works with the help of external programs to do the different formatting tasks.
de: Wie bereits in diesem Handbuch erwähnt arbeitet &kfloppy; mit externen Programmen, um die verschiedenen Formatierungsvorgänge durchzuführen.

source: If one of the programs is missing, &kfloppy; tries to work nevertheless. However the corresponding option will not be available.
de: Fehlt eines dieser Programme können Sie &kfloppy; trotzdem benutzen, allerdings steht dann die entsprechende Funktionalität nicht zur Verfügung.

source: This program is needed for low-level formatting, on &Linux; and on &BSD;. If it is missing, <guilabel>Full format</guilabel> will be disabled.
de: Dieses Programm wird zur Low-Level-Formatierung unter &Linux; und &BSD; benötigt. Fehlt dieses Programm, steht die Funktion <guilabel>Vollständige Formatierung</guilabel> nicht zur Verfügung.

source: This program is needed for zeroing-out, on &Linux; and on &BSD;. If it is missing, <guilabel>Zero out and quick format</guilabel> will be disabled.
de: Dieses Programm wird zum Ausnullen unter &Linux; und &BSD; benötigt. Fehlt dieses Programm, steht die Funktion <guilabel>Ausnullen und Schnellformatierung</guilabel> nicht zur Verfügung.

source: This program is needed for DOS formatting, on &Linux;.
de: Diese Programm wird zur Formatierung im DOS-Format unter &Linux; benötigt.

source: This program is needed for DOS formatting, on &BSD;.
de: Diese Programm wird zur Formatierung im DOS-Format unter &BSD; benötigt.

source: This program is needed for UFS formatting, on &BSD;.
de: Dieses Programm wird zum Formatieren im UFS-Format unter &BSD; benötigt.

source: This program is needed for ext2 formatting, on &Linux; and on &BSD;.
de: Dieses Programm wird zur Formatierung im ext2-Format unter &Linux; und &BSD; benötigt.

source: This program is needed for &Minix; formatting, on &Linux;.
de: Dieses Programm wird zur Formatierung im &Minix;-Format unter &Linux; benötigt.

source: User-Given Devices
de: Benutzerdefinierte Geräte

source: "User Given Devices" is the work title of a still experimental feature of &kfloppy;. It allows the user to give a device name and to use it nearly as if it was a <hardware>floppy drive</hardware>.
de: <quote>Benutzerdefinierte Geräte</quote> ist der Arbeitstitel einer noch im Experimentierstadium befindlichen Funktion von &kfloppy;. Der Benutzer kann hiermit einen Gerätenamen übergeben und dieses dann fast wie ein <hardware>Diskettenlaufwerk</hardware> verwenden.

source: This feature is mainly intended as a work-around for users having <hardware>USB floppy drives</hardware> of any kind (including <trademark>ZIP</trademark> disk drives) or any other non-legacy <hardware>floppy drives</hardware>.
de: Diese Funktion dient hauptsächlich als Zwischenlösung für Benutzer, die <hardware>USB-Diskettenlaufwerke</hardware> jeglicher Art (einschließlich <trademark>ZIP</trademark>-Laufwerke) oder andere ungewöhnliche <hardware>Diskettenlaufwerke</hardware> haben.

source: Unfortunately at the time of writing this documentation, the feature is not very user friendly, as it does not offer any help to the user on how a device is called and &kfloppy; does not even remember the device name from call to call. (This is partially a security, as the device of the <hardware>floppy drive</hardware> might change between reboots.)
de: Unglücklicherweise ist diese Funktion zum Zeitpunkt der Erstellung dieser Dokumentation nicht besonders benutzerfreundlich, da es keinerlei Hilfestellung bei der Benennung eines Gerätes gibt und &kfloppy; diesen zwischen zwei Aufrufen auch wieder vergisst. (Dies geschieht teilweise aus Sicherheitsgründen, da sich der Gerätename des <hardware>Diskettenlaufwerks</hardware> nach einem Neustart des Systems ändern kann.)

source: As this feature was developed under &Linux;, the &BSD; version of &kfloppy; offers less choices than &kfloppy; under &Linux;.
de: Da diese Funktion unter &Linux; entwickelt wurde, bietet die &BSD;-Version von &kfloppy; weniger Möglichkeiten als &kfloppy; unter &Linux;.

source: Using It
de: Verwendung

source: Using "User Given Devices" is quite simple, you just need to enter a device name, for example <replaceable>/dev/sdz4</replaceable> in the <guilabel>Floppy drive:</guilabel> combobox instead of selecting Primary or Secondary.
de: Die Verwendung <quote>benutzerdefinierter Geräte</quote> ist relativ einfach. Sie müssen dazu anstelle der vorgegebenen Einträge den Gerätenamen, beispielsweise <replaceable>/dev/sdz4</replaceable> in das Kombinationsfeld <guilabel>Diskettenlaufwerk</guilabel> eingeben.

source: You need to enter the <filename class="directory">/dev/</filename> part of the device for two reasons:
de: Sie müssen den <filename class="directory">/dev/</filename>-Teil des Gerätenamens aus zwei Gründen mit angeben:

source: It is how &kfloppy; recognizes the "User Given Devices" mode.
de: &kfloppy; erkennt hieran ein <quote>benutzerdefiniertes Gerät</quote>.

source: It is a security, to avoid that the user writes anything in the combobox that is by change a device name.
de: Aus Sicherheitsgründen soll verhindert werden, dass der Benutzer irgendetwas in das Kombinationsfeld einträgt, das zufällig ein Gerätename ist.

source: Unfortunately, using any device instead of a floppy device has a few consequences. The major one is that <guilabel>Full Format</guilabel> cannot be selected anymore. Doing so will result in a error message box when trying to start the format. However you can use <guilabel>Zero out and quick format</guilabel> instead. It will not format the device, just zeroing it out, but in practice it is nearly the same; especially all data on the device will be erased.
de: Unglücklicherweise hat die Verwendung eines Gerätes anstelle eines Diskettenlaufwerks einige Konsequenzen. Die bedeutendste ist, dass die Auswahlmöglichkeit <guilabel>Vollständige Formatierung</guilabel> nicht mehr zur Verfügung steht. Jeder Versuch bringt eine Fehlermeldung, wenn die Formatierung gestartet wird. Sie können aber stattdessen die Einstellung <guilabel>Ausnullen und Schnellformatierung</guilabel> verwenden. Dabei wird zwar nicht das Gerät formatiert, aber sämtliche Daten werden mit Nullbytes überschrieben und gelöscht, was beinah das Selbe ist.
