Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdeutils/ktimer.po
Languages: de

source: The &ktimer; Handbook
de: Das Handbuch zu &ktimer;

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Gregor</firstname><surname>Zumstein</surname><affiliation><address><email>zumstein@ssd.ethz.ch</email></address></affiliation><contrib>Deutsche Übersetzung</contrib></othercredit>

source: &ktimer; is an application for the &kde; environment that lets you start an application after a certain amount of time has passed.
de: &ktimer; ist eine Anwendung für &kde; mit der andere Anwendungen nach dem Ablauf eines definierten Zeitintervalls gestartet werden können.

source: Introduction
de: Einführung

source: &ktimer; allows you to enter several tasks and to set a timer for each of them. When the timer reaches zero, the task is executed. The timers for each task can be started, stopped, changed, or looped.
de: &ktimer; erlaubt das Erfassen von mehreren Aufgaben mit je eigenem Countdown. Erreicht der Zähler Null, so wird die Aufgabe ausgeführt. Jeder einzelne Countdown kann individuell gestartet, angehalten, geändert oder repetiert werden.

source: Using &ktimer;
de: Verwendung von &ktimer;

source: Here's a screenshot of &ktimer; when you start it for the first time
de: Dies ist ein Bildschirmfoto von &ktimer; beim ersten Start

source: &ktimer; main window
de: Hauptfenster von &ktimer;

source: To start, first add a task by selecting <guibutton>New</guibutton>. Then type the command you wish to execute into the <guilabel>Command line:</guilabel> box. You can then adjust the settings, or start the timer countdown. When the time is up, the command will be run.
de: Fügen Sie mit <guibutton>Neu</guibutton> eine neue Aufgabe hinzu. Geben Sie dann den auszuführenden Befehl im Feld <guilabel>Befehlszeile</guilabel> ein. Nun können Sie die Einstellungen anpassen oder den Countdown starten. Wenn die Zeit abgelaufen ist, wird der Befehl ausgeführt.

source: Here's a screenshot of &ktimer; after you have told it to run &konqueror;.
de: So sieht &ktimer; aus, wenn das Programm &konqueror; gestartet werden soll.

source: add a task
de: Aufgabe hinzufügen

source: Let's use &konqueror; as an example. By default, it will start in 100 seconds once the timer countdown is started.
de: Als Beispiel wird soll der &konqueror; gestartet werden. In der Voreinstellung dauert es 100 Sekunden bis zum Start.

source: Here it is counting down: in 56 seconds &konqueror; will be run.
de: Der Countdown läuft: In 56 Sekunden startet &konqueror;.

source: 56 seconds to go
de: Noch 56 Sekunden

source: Now let's start the task. Here it has been running for a bit and is partway through the countdown. In 56 seconds, &konqueror; will be started.
de: Jetzt kann der Countdown gestartet werden. In diesem Beispiel ist bereits einige Zeit vergangen, in 56 Sekunden wird &konqueror; gestartet.

source: See that sliding bar? You can use it to quickly increase or decrease the amount of time on a task.
de: Mit dem Schieberegler können Sie schnell den Zeitraum für den Start einer Aufgabe verändern.

source: Let's add a second task.
de: Hinzufügen einer zweiten Aufgabe

source: start another &konqueror;, you can never have too many!
de: Start eines zweiten &konqueror;.

source: Now two &konqueror;s are scheduled to be run. The top one will be run in 20 seconds, and the bottom one is currently stopped. You can add more commands. While you can never have too many &konqueror;s, you probably want to use other executables. Your own shell script, perhaps.
de: Nun soll &konqueror; zweimal gestartet werden. Der erste &konqueror; in der ersten Zeile wird in 20 Sekunden gestartet, für den zweiten darunter wurde der Countdown angehalten. Sie können weitere ausführbare Programme wie zum Beispiel eigene Skripte hinzufügen.

source: Settings
de: Einstellungen

source: <guibutton>New</guibutton>
de: <guibutton>Neu</guibutton>

source: Adds a new task.
de: Fügt eine neue Aufgabe hinzu.

source: Remove
de: Entfernen

source: Removes the current task.
de: Entfernt die ausgewählte Aufgabe.

source: Help
de: Hilfe

source: Opens the Handbook.
de: Öffnet das Handbuch zu &ktimer;

source: Credits and License
de: Mitwirkende und Lizenz

source: Program Copyright 2001 &Stefan.Schimanski; &Stefan.Schimanski.email;
de: Copyright für das Programm (c) 2001 &Stefan.Schimanski; &Stefan.Schimanski.email;

source: Documentation Copyright 2008 &A.L.Spehr; &A.L.Spehr.email;
de: Copyright für die Dokumentation (c) 2008 &A.L.Spehr; &A.L.Spehr.email;

source: CREDIT_FOR_TRANSLATORS
de: <para>Übersetzung Gregor Zumstein<email>zumstein@ssd.ethz.ch</email></para>

source: How to obtain &ktimer;
de: Woher können Sie &ktimer; beziehen

source: Compilation and installation
de: Kompilierung und Installation
