Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdeutils/kwalletmanager.po
Languages: de

source: The first list shows all applications currently connected to the selected wallet. Use the button at the right side of each entry to disconnect the application.
de: Die erste Liste zeigt alle Anwendungen, die gerade mit dem ausgewählten Passwortspeicher verbunden sind. Benutzen Sie den Knopf rechts neben jedem Eintrag, um die Verbindung der Anwendung zu trennen.

source: In the second list all applications are displayed which are authorized to access the wallet. Use the button right of each entry in the list to revoke the access.
de: In der zweiten Liste werden alle Anwendungen angezeigt, deren Zugriff auf den Passwortspeicher autorisiert ist. Benutzen Sie den Knopf rechts neben jedem Eintrag in der Liste, um die Autorisierung zurückzuziehen.

source: Configuring &kwallet;
de: &kwallet; einrichten

source: Wallet Preferences
de: Einstellungen für den Passwortspeicher

source: &kwallet; contains a small configuration panel with several options that allow you to tune &kwallet; to your personal preferences. The default settings for &kwallet; are sufficient for most users.
de: &kwallet; besitzt einen Dialog mit diversen Einstellungen, der Ihnen die Anpassung von &kwallet; an Ihre Bedürfnisse erlaubt. Die Standardeinstellungen sollten allerdings für die meisten Benutzer genügen.

source: Check the box to enable or disable the &kde; wallet subsystem entirely. If this box is unchecked, then &kwallet; is entirely disabled and none of the other options here have any effect, nor will &kwallet; record any information, or offer to fill in forms for you.
de: Markieren Sie das Ankreuzfeld, um das Passwortspeicher-Subsystem von &kde; zu aktivieren. Ist dieses Feld nicht markiert, ist &kwallet; komplett deaktiviert und die anderen Einstellungen sind wirkungslos. &kwallet; speichert dann auch keine Informationen und bietet keine Hilfe beim Ausfüllen von Formularen an.

source: Close Wallet
de: Passwortspeicher schließen

source: Close when unused for:
de: Bei Nichtgebrauch schließen nach:

source: Close the current wallet after a period of inactivity. If you check this option, set the period in the box, default is 10 minutes. When a wallet is closed, the password is needed to access it again.
de: Schließt den Passwortspeicher nach einem Zeitraum ohne Aktivitäten. Ist diese Einstellung markiert, können Sie den gewünschten Zeitraum im Drehfeld einstellen; Die Voreinstellung ist 10 Minuten. Wird ein Passwortspeicher geschlossen, benötigen Sie für einen erneuten Zugriff das Passwort.

source: Close when screensaver starts
de: Schließen, wenn der Bildschirmschoner aktiv wird

source: Close the wallet as soon as the screen saver starts. When a wallet is closed, the password is needed to access it again.
de: Schließt den Passwortspeicher, sobald der Bildschirmschoner aktiv wird. Wird ein Passwortspeicher geschlossen, benötigen Sie für einen erneuten Zugriff das Passwort.

source: Close when last application stops using it
de: Schließen, sobald keine Anwendung mehr darauf zugreift

source: Close the wallet as soon as applications that use it have stopped. Note that your wallets will only be closed when all the applications that use it have stopped. When a wallet is closed, the password is needed to access it again.
de: Schließt den Passwortspeicher, sobald keine Anwendung mehr darauf zugreift. Beachten Sie, dass der Passwortspeicher erst dann geschlossen wird, wenn alle Anwendungen, die darauf zugreifen die Verbindung gelöst haben. Wird ein Passwortspeicher geschlossen, benötigen Sie für einen erneuten Zugriff das Passwort.

source: Automatic Wallet Selection
de: Automatische Wahl des Passwortspeichers

source: Select wallet to use as default:
de: Standardpasswortspeicher:

source: Select which wallet you want to use as default wallet.
de: Wählen Sie den Passwortspeicher, der als Standard verwendet werden soll.

source: Different wallet for local passwords:
de: Anderen Passwortspeicher für lokale Passwörter:

source: If checked, choose a different wallet for local passwords.
de: Ist diese Einstellung markiert, wird für lokale Passwörter ein anderer Passwortspeicher verwendet.

source: Wallet Manager
de: Passwortverwaltung

source: Show manager in system tray
de: Passwortverwaltung im Systembereich anzeigen

source: Enable the wallet manager to have its icon in the system tray.
de: Aktiviert die Anzeige eines Symbols für die Passwortverwaltung im Systemabschnitt der Kontrollleiste.

source: Hide System tray icon when last wallet closes
de: Kontrollleistensymbol ausblenden, wenn der letzte Passwortspeicher geschlossen ist

source: When there is no wallet in use anymore, remove the wallet icon from the system tray.
de: Ist kein Passwortspeicher mehr in Benutzung, wird das Symbol aus dem Systemabschnitt entfernt.

source: Finally, there is a button labeled <guibutton>Launch Wallet Manager</guibutton>, which does precisely that.
de: Zuletzt gibt es auch noch den Knopf <guibutton>Passwortverwaltung starten</guibutton>, um diesen Dienst zu aktivieren.

source: This button is only visible if &kwalletmanager; is not running
de: Dieser Knopf wird nur dann angezeigt, wenn &kwalletmanager; nicht ausgeführt wird.

source: Access Control
de: Zugriffsüberwachung

source: There is only one option on this page:
de: Auf dieser Seite gibt es nur eine Einstellung:

source: Prompt when an application accesses a wallet
de: Nachfragen, wenn eine Anwendung auf einen Passwortspeicher zugreifen will.

source: Signal you when an application gains access to a wallet.
de: Nachfragen, wenn eine Anwendung auf einen geöffneten Passwortspeicher zugreifen will..

source: Next there is a tree style view of the access controls for your wallets.
de: Darunter befindet sich eine Baumansicht mit den Zugriffsdaten und Regeln für den Passwortspeicher.

source: Click with the &LMB; on the <guiicon>&gt;</guiicon> symbol beside a wallet name to expand the tree. You will see the name of each application that has asked for access to the wallet, and the policy you set for it. You cannot edit policies here, or add them, but it is possible to delete an entry by &RMB; clicking on it and choosing <guimenuitem>Delete</guimenuitem> from the context menu that appears, or by simply selecting it and pressing the <keysym>Del</keysym> key.
de: Klicken Sie mit der &LMBn; auf das kleine <guiicon>&gt;</guiicon>-Symbol neben den Namen eines Passwortspeichers, um den Baum zu öffnen. Sie sehen dann den Namen jeder Anwendung, die Zugriff auf den Passwortspeicher hat und die Richtlinien, die sie dafür festgelegt haben. Sie können keine Richtlinien ändern oder hinzufügen, einzig löschen können Sie einen Eintrag, wenn Sie mit der &RMBn; das Kontextmenü öffnen und darin <guimenuitem>Löschen</guimenuitem> wählen oder die Taste <keycap>Entf</keycap> drücken.

source: An application that has been allowed access to a wallet is granted access to all passwords stored inside.
de: Ein Programm, das den Passwortspeicher öffnen darf, kann auch alle darin enthaltenen Passwörter lesen.

source: If you erroneously configured an application not to use the &kde; &kwalletmanager; delete the policy for this application here.
de: Wenn Sie versehentlich eine Anwendung so eingerichtet haben, &kde;-&kwalletmanager; nicht zu benutzen, löschen Sie die Regelung für diese Anwendung hier.

source: On the next start of this application you can define a new policy for access to the wallet.
de: Beim nächsten Start dieser Anwendung können Sie dann eine neue Regelung für den Zugriff auf den Passwortspeicher festlegen.

source: <screeninfo>Access request to open a wallet</screeninfo>
de: <screeninfo>Die Öffnung eines Passwortspeichers wird angefordert</screeninfo>

source: <phrase>Access request to open a wallet</phrase>
de: <phrase>Die Öffnung des Passwortspeichers wird angefordert</phrase>

source: An application requesting access to a wallet
de: Anforderung einer Anwendung zum Zugriff auf einen Passwortspeicher.

source: Advanced Features
de: Weitergehende Funktionen

source: Wallets can be dragged from the &kwalletmanager; window. This allows you to drag the wallet to a file browser window, where you can choose to copy, move, or link the wallet, as desired.
de: Ein Passwortspeicher kann aus dem &kwalletmanager;-Fenster auf ein Dateiverwaltungs-Fenster gezogen werden, um dort eine Kopie oder eine Verknüpfung anzulegen oder sie dorthin zu verschieben.

source: You might use this to save a wallet to portable media, such as a USB keychain, so that you can take your passwords with you to work or on a vacation, and still have easy access to important sites.
de: Verwenden Sie diese Möglichkeit, wenn Sie einen Passwortspeicher auf ein Wechselmedium wie einen USB-Stick kopieren wollen. So haben Sie Ihre Passwörter immer dabei, zu Hause, bei der Arbeit oder in den Ferien.

source: Future versions will have built-in functions for easy export or copying of data to portable devices.
de: Zukünftige Versionen werden Funktionen zum einfachen Exportieren oder Kopieren der Daten auf Wechselmedien anbieten.

source: Information on the internal structure of &kwallet; and some useful links to the code where you can find the answers on questions about the structure of the passwords records and the ciphers applied to keep passwords confident can be found on <ulink url="http://techbase.kde.org/Projects/Utils/kwallet">&kwallet; TechBase page</ulink>.
de: Informationen über die interne Struktur von &kwallet; und einige nützliche Verknüpfungen zum Quelltext, in denen Sie Antworten auf Fragen über die Struktur der Passwort-Datensätze und die Verschlüsselung der Passworte finden Sie auf der <ulink url="http://techbase.kde.org/Projects/Utils/kwallet">&kwallet;-TechBase-Seite</ulink>.

source: Credits and License
de: Danksagungen und Lizenz

source: Documentation &copy; &Lauri.Watts; and &George.Staikos;
de: Dokumentation &copy; &Lauri.Watts; und &George.Staikos;

source: CREDIT_FOR_TRANSLATORS
de: <para>Übersetzung Gregor Zumstein <email>gz@orchester-bremgarten.ch</email></para>
