Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdeutils/kwalletmanager.po
Languages: de

source: The &kwallet; Handbook
de: Das Handbuch zu &kwallet;

source: Developer
de: Entwickler

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Gregor</firstname><surname>Zumstein</surname><affiliation><address><email>gz@orchester-bremgarten.ch</email></address></affiliation><contrib>Deutsche Übersetzung</contrib></othercredit>

source: The wallet subsystem provides a convenient and secure way to manage all your passwords.
de: Das Passwortspeicher-Subsystem erlaubt die bequeme und gleichzeitig sichere Aufbewahrung Ihrer Passwörter.

source: passwords
de: Passwörter

source: forms
de: Formulare

source: Introduction
de: Einleitung

source: Computer users have a very large amount of data to manage, some of which is sensitive. In particular, you will typically have many passwords to manage. Remembering them is difficult and writing them down on paper or in a text file is insecure.
de: Computernutzer müssen eine riesige Datenmenge verwalten, ein Teil davon ist sicherheitsrelevant. Insbesondere müssen sie viele Zugangsdaten und Passwörter verwalten. Sich diese alle zu merken ist schwierig, sie auf Papier oder in einer Textdatei aufzuschreiben ist unsicher.

source: &kwallet; provides a secure way to store passwords and other secret information, allowing the user to remember only a single password instead of numerous different passwords and credentials.
de: &kwallet; bietet eine sichere Möglichkeit, Passwörter und andere persönliche Informationen zu speichern. Damit muss sich der Benutzer nur noch ein einzelnes Passwort anstatt zahlloser verschiedener Passwörter und Anmeldedaten merken.

source: Create a Wallet
de: Einen Passwortspeicher erstellen

source: There are three ways to create a new wallet:
de: Es gibt drei Möglichkeiten, einen neuen Passwortspeicher zu erstellen:

source: Use the menu item <menuchoice><guimenu>File</guimenu><guimenuitem>New Wallet</guimenuitem></menuchoice> in the &kwalletmanager;
de: Verwenden Sie den Menüeintrag <menuchoice><guimenu>Datei</guimenu><guimenuitem>Neuen Passwortspeicher</guimenuitem></menuchoice> im &kwalletmanager;

source: Use the <guibutton>New</guibutton> button in the &systemsettings; module <guilabel>KDE Wallet</guilabel>
de: Verwenden Sie den Knopf <guibutton>Neu</guibutton> im &systemsettings;-Modul <guilabel>Passwortverwaltung</guilabel>

source: On the first attempt to store login information in a wallet when you did not create a wallet so far, see section <link linkend="kwallet-using">Using &kwallet;</link>.
de: Beim ersten Versuch, Anmeldeinformationen zu speichern, ohne dass schon eine Passwortspeicher erstellt wurde, siehe den Abschnitt <link linkend="kwallet-using">&kwallet; benutzen</link>.

source: &kwallet; offers two different ways to store your data:
de: &kwallet; bietet zwei unterschiedliche Methoden, Ihre Daten zu speichern:

source: <screeninfo>Select encryption</screeninfo>
de: <screeninfo>Verschlüsselung auswählen</screeninfo>

source: <phrase>Select encryption</phrase>
de: <phrase>Verschlüsselung auswählen</phrase>

source: Blowfish encryption
de: Blowfish-Verschlüsselung

source: &kwallet; saves this sensitive data for you in a strongly encrypted file, accessible by all applications, and protected with a master password that you define.
de: &kwallet; speichert genau diese sicherheitsrelevanten Daten in einer mit starker Kryptografie verschlüsselten Datei, auf die alle Anwendungen zugreifen können. Die Daten werden durch ein von Ihnen festgelegtes Hauptpasswort geschützt.

source: <screeninfo>Create a blowfish encrypted wallet</screeninfo>
de: <screeninfo>Einen Passwortspeicher mit Blowfish-Verschlüsselung erstellen</screeninfo>

source: <phrase>Create a blowfish encrypted wallet</phrase>
de: <phrase>Einen Passwortspeicher mit Blowfish-Verschlüsselung erstellen</phrase>

source: The data is encrypted with the <ulink url="http://www.schneier.com/blowfish.html">Blowfish symmetric block cipher algorithm</ulink>, the algorithm key is derived from the <ulink url="http://www.ietf.org/rfc/rfc3174.txt">SHA-1 hash</ulink> of the password, with a key length of 156 bits (20 bytes). The data into the wallet file is also hashed with SHA-1 and checked before the data is deciphered and accessible by the applications.
de: Die Daten werden mit dem <ulink url="http://www.schneier.com/blowfish.html">symmetrischen Blockverschlüsselungsalgorithmus Blowfish</ulink> verschlüsselt. Der Schlüsselalgorithmus wird aus dem <ulink url="http://www.ietf.org/rfc/rfc3174.txt">SHA-1-Hashwert</ulink> des Passworts berechnet, mit einer Schlüssellänge von 156 Bit (20 Byte). Aus den Daten in der &kwallet;-Datei werden zusätzlich Hashwerte mit SHA-1 berechnet und vor der Entschlüsselung und dem Zugriff von Programmen überprüft

source: GPG encryption
de: GPG-Verschlüsselung

source: GnuPG offers some very strong encryption algorithms and uses passphrase protected long keys.
de: GnuPG verwendet einige sehr starke Verschlüsselungsalgorithmen und verwendet lange Schlüssel, die mit einem Kennsatz geschützt sind.

source: <screeninfo>No GPG key found</screeninfo>
de: <screeninfo>Kein GPG-Schlüssel gefunden</screeninfo>

source: <phrase>No GPG key found</phrase>
de: <phrase>Kein GPG-Schlüssel gefunden</phrase>

source: The screenshots above show the case where an encryption capable GPG key was not found on the system. Please use applications like &kgpg; or &kleopatra; to create a key an try again.
de: Das obere Bildschirmfoto zeigt die Situation, wenn kein GPG-Schlüssel gefunden im System wurde. Benutzen Sie in diesem Fall Anwendungen wie &kgpg; oder &kleopatra; zur Erzeugung eines Schlüssels und versuchen Sie es erneut.

source: If a GPG key was found you will get the next dialog where you can select a key to use for your new wallet.
de: Wurde ein GPG-Schlüssel gefunden, dann können Sie im nächsten Dialog einen Schlüssel für Ihren neuen Passwortspeicher auswählen.

source: <screeninfo>Select an encryption key</screeninfo>
de: <screeninfo>Auswahl eines Schlüssels</screeninfo>

source: <phrase>Select an encryption key</phrase>
de: <phrase>Auswahl eines Schlüssels</phrase>

source: &kwallet; will now use GPG when storing wallets and when opening them. The passphrase dialog only shows once. Even if the wallet is closed after initial open, subsequent opening will occur silently during the same &kde; session.
de: &kwallet; verwendet dann GPG beim Speichern und Öffnen eines Passwortspeichers. Der Kennsatz-Dialog erscheint nur einmal. Sogar wenn der Passwortspeicher nach dem anfänglichen Öffnen geschlossen wird, erfolgt das nachfolgende Öffnen ohne erneute Abfrage des Kennsatzes während derselben &kde;-Sitzung.

source: The same &kde; session can handle simultaneously both file formats. &kwallet; will transparently detect the file format and load the correct backend to handle it.
de: In einer &kde;-Sitzung können beide Dateiformate gleichzeitig benutzt werden. &kwallet; erkennt automatisch des Dateiformat und lädt das zugehörige Backend zur Verarbeitung.

source: To use your sensitive data from your classic wallet with the new backend follow these steps:
de: Um Ihre sensiblen Daten aus einem klassischen Passwortspeicher mit dem neuen Backend zu benutzen, folgen Sie diesen Anweisungen:

source: Create a new GPG based wallet
de: Erstellen Sie einen neuen Passwortspeicher mit GPG-Verschlüsselung

source: Launch &kwalletmanager; and select your old wallet then choose <menuchoice><guimenu>File</guimenu> <guimenuitem>Export as XML</guimenuitem></menuchoice> to create an &XML; file with your sensitive data.
de: Starten Sie &kwalletmanager;, öffnen Sie Ihren alten Passwortspeicher und wählen dann <menuchoice><guimenu>Datei</guimenu> <guimenuitem>Als XML exportieren</guimenuitem></menuchoice>, um eine &XML;-Datei mit dem Inhalt des Passwortspeichers zu erzeugen.

source: Select the new GPG based wallet then choose <menuchoice><guimenu>File</guimenu> <guimenuitem>Import XML</guimenuitem></menuchoice> and select the file you just saved.
de: Öffnen Sie den neuen Passwortspeicher und wählen Sie dann mit <menuchoice><guimenu>Datei</guimenu> <guimenuitem>XML importieren</guimenuitem></menuchoice> die vorher gespeicherte Datei.

source: Encrypt the &XML; file to keep a backup.
de: Verschlüsseln Sie die &XML;-Datei, um eine Sicherung zu behalten

source: <menuchoice><guimenu>File</guimenu><guimenuitem>Import Wallet</guimenuitem></menuchoice> but in that case you have to select the <filename class="extension">.kwl</filename> file corresponding to your old wallet, located in <filename class="directory">$<envar>KDEHOME</envar>/.kde/share/apps/kwallet</filename>.
de: Alternative können Sie <menuchoice><guimenu>Datei</guimenu><guimenuitem>Passwortspeicher importieren</guimenuitem></menuchoice> benutzen, aber dann müssen sie die <filename class="extension">.kwl</filename>-Datei zu Ihrem alten Passwortspeicher auswählen, die sich in <filename class="directory">$<envar>KDEHOME</envar>/.kde/share/apps/kwallet</filename> befindet.

source: Go to &systemsettings; <menuchoice><guimenu>Account Details</guimenu> <guimenuitem>KDE Wallet</guimenuitem></menuchoice> and select the newly created GPG based wallet from the <guilabel>Select wallet to use as default</guilabel> combobox.
de: Gehen Sie in den &systemsettings; zur Seite <menuchoice><guimenu>Benutzerkontodetails</guimenu> <guimenuitem>Passwortverwaltung</guimenuitem></menuchoice> und wählen Sie den neu erstellte GPG-basierten Passwortspeicher im Kombinationsfeld <guilabel>Standardpasswortspeicher</guilabel>.

source: &kwallet; supports multiple wallets, so for the most secure operation, you should use one wallet for local passwords, and another for network passwords and form data. You can configure this behavior in the &kwallet; &systemsettings; module, however the default setting is to store everything in one wallet.
de: Für sehr sicherheitsrelevante Aktionen sollten Sie einen Passwortspeicher für Passwörter im lokalen System und einen für Netzwerk-/Internet-Passwörter sowie Formulardaten benutzen. Standardmäßig werden allerdings alle Passwörter in einer einzigen Datei gehalten. Die detaillierten Einstellungen hierzu können Sie im &systemsettings;-Modul von &kwallet; vornehmen.

source: A wallet is by default closed, which means that you must supply a password to open it. Once the wallet is opened, the contents can be accessed.
de: Ein Passwortspeicher ist per Voreinstellung geschlossen, das heißt, sie müssen ein Passwort angeben, um ihn zu öffnen. Sobald der Passwortspeicher geöffnet ist, kann auf den Inhalt zugegriffen werden.

source: Using &kwallet;
de: &kwallet; benutzen

source: If you visit &eg; the &kde; bugtracker and enter the login data for the first time, a dialog pops up offering to store the password in an encrypted wallet:
de: Wenn Sie &eg; zur Webseite des &kde;-Fehlerverfolgungssystems gehen und das erste Mal die Anmeldedaten eingegeben haben, wird ein Dialog angezeigt, in dem die Speicherung des Passwortes in einem Passwortspeicher angeboten wird:

source: <screeninfo>Request to save login information</screeninfo>
de: <screeninfo>Anfrage zur Speicherung der Anmeldeinformationen</screeninfo>

source: <phrase>Request to save login information</phrase>
de: <phrase>Anfrage zur Speicherung der Anmeldeinformationen</phrase>

source: If you want to store this information, select <guibutton>Store</guibutton> to proceed. In case you did not create a wallet so far, the next dialog asks for the encryption backend and creates a wallet named kdewallet.
de: Möchten Sie diese Informationen speichern, dann drücken Sie den Knopf <guibutton>Speichern</guibutton>. Haben Sie bis dahin noch keinen Passwortspeicher erstellt, wird im nächsten Dialog nach der Verschlüsselungs-Methode gefragt und dann ein Passwortspeicher namens kdewallet erstellt.

source: Next time you visit the same website again, the application requests to open the wallet. Enter the wallet password and click the <guibutton>Open</guibutton> button.
de: Wenn Sie dieselbe Webseite das nächste Mal besuchen, fordert das Programm die Öffnung des Passwortspeichers an. Geben Sie das Passwort für den Passwortspeicher ein und drücken Sie den Knopf <guibutton>Öffnen</guibutton>.

source: <screeninfo>Request to open a wallet</screeninfo>
de: <screeninfo>Die Öffnung des Passwortspeichers wird angefordert</screeninfo>

source: <phrase>Request to open a wallet</phrase>
de: <phrase>Die Öffnung des Passwortspeichers wird angefordert</phrase>

source: This connects the application to the wallet, enables it to read the login data from the wallet and to restore the login information for this website. Once an application is connected to the wallet, it can automatically restore any login information stored in the wallet.
de: Damit erhält das Programm Zugriff auf den Passwortspeicher, kann die Anmeldedaten darin lesen und sie in die Anmeldungsfelder dieser Webseite eintragen. Hat ein Programm erst einmal Zugriff auf den Passwortspeicher, kann es automatisch alle Anmeldeinformationen darin bei den zugehörigen Webseiten für Sie eintragen.

source: &kwalletmanager; serves a number of functions. Firstly it allows you to see if any wallets are open, which wallets those are, and which applications are using each wallet. You can disconnect an application's access to a wallet from within the &kwalletmanager;.
de: &kwalletmanager; erfüllt eine Reihe von Aufgaben. Zuerst erlaubt Ihnen &kwalletmanager; zu sehen, ob und welche Passwortspeicher offen sind und welche Anwendungen darauf zugreifen. Sie können den Zugriff einer Anwendung auf einen Passwortspeicher im &kwalletmanager; unterbinden.

source: You may also manage the wallets installed on the system, creating and deleting wallets and manipulating their contents (changing keys, ...).
de: Auch lassen sich hier die installierten Passwortspeicher verwalten und deren Inhalt ändern. Ebenso lassen sich neue Passwortspeicher hinzufügen oder bestehende Passwortspeicher löschen sowie deren Inhalt (Schlüssel ändern) bearbeiten.

source: The &kwalletmanager; application is launched with <menuchoice> <guimenu>Applications</guimenu><guisubmenu>System</guisubmenu> <guimenuitem>Wallet Management Tool</guimenuitem></menuchoice> from the application launcher. Alternatively start &krunner; with shortcut <keycombo action="simul">&Alt;<keycap>F2</keycap></keycombo> and enter <command>kwalletmanager</command>.
de: Das Programm &kwalletmanager; wird mit <menuchoice> <guimenu>Programme</guimenu><guisubmenu>System</guisubmenu> <guimenuitem>&kwalletmanager; (Passwortverwaltung)</guimenuitem></menuchoice> aus dem Anwendungs-Starter aufgerufen. Alternativ starten Sie &krunner; mit dem Kurzbefehl <keycombo action="simul">&Alt;<keycap>F2</keycap></keycombo> und geben dann den Befehl <command>kwalletmanager</command> ein.

source: A system tray icon indicates that a wallet is open: <mediaobject> <imageobject> <imagedata fileref="oxygen48-status-wallet-open.png"/> </imageobject> </mediaobject> When all wallets are closed, the icon will reflect this by showing a closed wallet:
de: Ein Symbol in der Kontrollleiste zeigt an, dass ein Passwortspeicher geöffnet ist: <mediaobject><imageobject><imagedata fileref="oxygen48-status-wallet-open.png"/></imageobject></mediaobject>Sind alle Passwortspeicher geschlossen, so erscheint das Symbol einer geschlossenen Brieftasche.

source: Click once on the system tray wallet icon to display the &kwalletmanager; window.
de: Klicken Sie auf das Brieftaschensymbol im Systemabschnitt der Kontrollleiste, um das &kwalletmanager;-Fenster zu öffnen.

source: <screeninfo>Main window with one wallet</screeninfo>
de: <screeninfo>Hauptfenster mit einem Passwortspeicher</screeninfo>

source: <phrase>Main window with one wallet</phrase>
de: <phrase>Hauptfenster mit einem Passwortspeicher</phrase>

source: <para>Main window with one wallet</para>
de: <para>Hauptfenster mit einem Passwortspeicher</para>

source: The Wallet Window
de: Das Fenster zum Passwortspeicher

source: If you have more than one wallet all available wallets are shown as icons on the left. The Icons reflect the current wallet status, either open or closed.
de: Wenn Sie mehr als ein Passwortspeicher haben, werden alle verfügbaren Passwortspeicher links als Symbole angezeigt. Jeder Eintrag zeigt über ein Symbol, ob der Passwortspeicher geöffnet oder geschlossen ist.

source: Clicking on a wallet in the &kwalletmanager; window will display that wallet's status and the contents of an opened wallet. A wallet may contain any number of folders, which allow storing of password information. By default a wallet will contain folders named Form Data and Passwords.
de: Ein Klick auf einen Passwortspeicher im Fenster von &kwalletmanager; zeigt den Status und den Inhalt eines geöffneten Passwortspeicher. Ein Passwortspeicher kann beliebig viele Ordner enthalten, in denen Passwortdaten abgelegt werden können. Jeder Passwortspeicher enthält bereits die Ordner <quote>Form Data</quote> und <quote>Passwords</quote>.

source: <screeninfo>Main window with two wallets</screeninfo>
de: <screeninfo>Hauptfenster mit zwei Passwortspeichern</screeninfo>

source: <phrase>Main window with two wallets</phrase>
de: <phrase>Hauptfenster mit zwei Passwortspeichern</phrase>

source: <para>Main window with two wallets</para>
de: <para>Hauptfenster mit zwei Passwortspeichern</para>

source: Use <guibutton>Open</guibutton> to display the content of a closed wallet. You will be requested to enter the master password.
de: Benutzen Sie den Knöpf <guibutton>Öffnen</guibutton>, um den Inhalt eines geschlossenen Passwortspeichers anzuzeigen. Dazu müssen Sie das Hauptpasswort für den Passwortspeicher eingeben.

source: Contents tab
de: Karteikarte Inhalte

source: The <guilabel>Contents</guilabel> tab has three sections:
de: Auf der Karteikarte <guilabel>Inhalte</guilabel> gibt es drei Abschnitte:

source: A search line to filter the items of the current wallet
de: Eine Suchleiste zur Filterung der Einträge im Passwortspeicher

source: The tree view of the folders contained in the wallet. Click the <guiicon>&gt;</guiicon> / <guiicon>v</guiicon> icons to expand or collapse the tree view.
de: Die im Passwortspeicher enthaltenen Ordner als Baumansicht. Klicken Sie auf die Symbole <guiicon>&gt;</guiicon> / <guiicon>v</guiicon>, um die Baumansicht ein- oder auszuklappen.

source: The contents of the selected folder entry at the right side. By default the password and value are hidden. To display and edit them enable <guilabel>Show values</guilabel> or click the <guilabel>Show Contents</guilabel> button.
de: Den Inhalt des ausgewählten Ordnereintrags auf der rechten Seite. Als Standard sind Passwort und Wert ausgeblendet. Um sie anzuzeigen und zu bearbeiten, aktivieren Sie <guilabel>Werte anzeigen</guilabel> oder klicken Sie auf <guilabel>Inhalt anzeigen</guilabel>.

source: Folders may be added or deleted via the context menu, and selecting a folder will update the folder entry list and the summary display. Selecting a folder entry will update the entry contents pane, and allow you to edit that entry.
de: Ordner können mit dem Kontextmenü hinzugefügt oder gelöscht werden. Wird ein Ordner ausgewählt, so werden die Ordnereinträge und die Übersicht aktualisiert. Wird ein Ordnereintrag ausgewählt, so wird der Inhaltsbereich aktualisiert und die Einträge können geändert werden.

source: Entries may also be created, renamed or deleted via the context menu for the folder contents.
de: Einträge können auch über das Kontextmenü für die Ordnereinträge hinzugefügt, umbenannt oder gelöscht werden.

source: All folders and entries may be dragged and dropped into other wallets or folders respectively. This allows a user to easily package up a new wallet for transfer to another environment. For instance, a new wallet could be created and copied onto a removable flash memory device. Important passwords could be transferred there, so you have them available in other locations.
de: Alle Ordner und Einträge können auf andere Passwortspeicher respektive Ordner gezogen werden. Dies erlaubt es, einfach einen neuen Passwortspeicher anzulegen, die in einer anderen Umgebung verwendet werden kann. So kann zum Beispiel ein neuer Passwortspeicher angelegt und auf einen Wechselspeicher kopiert werden. So können wichtige Passwörter dorthin verschoben werden, sodass Sie sie überall zur Verfügung haben.

source: Import and Export
de: Importieren und Exportieren

source: If you want to transfer your secrets to another device or computer use the actions in the <guimenu>File</guimenu> menu. With <guimenuitem>Save As</guimenuitem> wallets can be exported into an encrypted <filename class="extension">.kwl</filename> file. Importing the <filename class="extension">.kwl</filename> file you have to provide the master password of the wallet.
de: Wenn Sie Ihre Passwörter auf ein anderes Gerät oder einen anderen Rechner übertragen möchten, benutzen Sie die Aktionen im Menü <guimenu>Datei</guimenu>. Mit <guimenuitem>Speichern unter</guimenuitem> können Passwortspeicher in eine verschlüsselte <filename class="extension">.kwl</filename>-Datei exportiert werden. Beim Importieren einer <filename class="extension">.kwl</filename>-Datei müssen Sie das Hauptpasswort des Passwortspeichers eingeben.

source: Alternatively a <filename class="extension">.xml</filename> file can be used for transferring a wallet. Keep in mind that all secrets are stored as plain text in this file.
de: Als Alternative können Sie das Format <filename class="extension">.xml</filename> zum Übertragen des Inhalts eines Passwortspeicher verwenden. Bedenken Sie, dass alle Passwörter als lesbarer Text in diesem Format gespeichert werden.

source: Adding Entries Manually
de: Einträge manuell hinzufügen

source: Open the context menu with the &RMB; click on <guilabel>Maps</guilabel> or <guilabel>Passwords</guilabel> in the <guilabel>Folder</guilabel> tree view. Select <guimenuitem>New</guimenuitem> and choose a name for the new entry.
de: Öffnet Sie das Kontextmenü mit der &RMB; auf <guilabel>Paare</guilabel> in der <guilabel>Ordner</guilabel>-Baumansicht. Wählen Sie <guilabel>Neu</guilabel> und geben dann einen Namen für den neuen Eintrag ein.

source: In the folder contents pane select <guilabel>New Entry</guilabel> from the context menu of <quote>Form Data</quote> or <quote>Passwords</quote>. For passwords click the <guilabel>Show Contents</guilabel> button, enter the new password. For Maps you have to add a <guilabel>Key</guilabel> and a <guilabel>Value</guilabel>. Click the <guilabel>Save</guilabel> button to store the new entries in the encrypted wallet file.
de: Auf der Karteikarte Inhalte wählen Sie <guilabel>Neuer Ordner</guilabel> aus dem Kontextmenü der Einträge <quote>Form Data</quote> oder <quote>Passwords</quote>. Für Passwörter klicken Sie dann auf <guilabel>Inhalte anzeigen</guilabel> und geben das Passwort ein. Für Paare müssen Sie einen <guilabel>Schlüssel</guilabel> und einen <guilabel>Wert</guilabel> angeben. Klicken Sie auf den Knopf <guilabel>Speichern</guilabel>, um die neuen Einträge verschlüsselt in den Passwortspeicher einzufügen.

source: <title>Applications tab</title>
de: <title>Karteikarte Anwendungen</title>

source: <screeninfo>Applications tab</screeninfo>
de: <screeninfo>Karteikarte Anwendungen</screeninfo>

source: <phrase>Applications tab</phrase>
de: <phrase>Karteikarte Anwendungen</phrase>

source: <para>Applications tab</para>
de: <para>Karteikarte Anwendungen</para>
