Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/kdeedu/kanagram-active.po
Languages: de

source: This is an info banner with icon
de: Dies ist eine Informationstafel mit einem Symbol

source: Play Game
de: Spiel starten

source: Resume Game
de: Spiel fortsetzen

source: Settings
de: Einstellungen

source: About
de: Über

source: <b>Anagram resolve time</b>: Maximum allowed time for resolving the anagram
de: <b>Zeit für das Lösen des Anagramms</b>: Maximal erlaubte Zeit für die Auflösung des Anagramms

source: <b>Hint show duration:</b> The duration for showing the hint for the current anagram
de: <b>Tipp-Anzeigedauer:</b> Die Dauer der Anzeige des Tipps für das aktuelle Anagramm

source: <b>Sounds:</b> Turn all the sounds on or off inside the game
de: <b>Klänge:</b> Schaltet alle Klänge im Spiels ein bzw. aus

source: Select a language
de: Wählen Sie eine Sprache

source: Kanagram Settings
de: Kanagram-Einstellungen

source: Hint show duration in seconds
de: Tipp-Anzeigedauer in Sekunden

source: Anagram resolve time in seconds
de: Zeit für das Lösen des Anagramms in Sekunden

source: Sounds
de: Klänge

source: Language
de: Sprache

source: Kanagram Active for Tablets
de: Kanagram Active für Tablets

source: use a QGLWidget for the viewport
de: Verwendet ein QGLWidget für das Ansichtsfenster
