Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/kdeedu/pairseditor.po
Languages: de

# NAME OF TRANSLATORS
source: Your names
de: Burkhard Lück

# EMAIL OF TRANSLATORS
source: Your emails
de: lueck@hube-lueck.de

source: No features present on element %1
de: Es sind keine Funktionen für Element %1 vorhanden

source: No features type on child from element %1
de: Für den Eintrag des Elements %1 ist kein Funktionstyp eingestellt

source: No language set on child from element %1
de: Für den Eintrag des Elements %1 ist keine Sprache eingestellt

source: No file or word set on child from element %1
de: Für den Eintrag des Elements %1 ist keine Sprache eingestellt

source: Pairs Themes Editor
de: Pairs-Designeditor

source: Copyright (c) 2012 the Pairs developers
de: Copyright (c) 2012 die Pairs-Entwickler

source: Maintainer
de: Betreuer

source: Feature development
de: Entwicklung von Funktionen

source: Layout development
de: Layout-Entwicklung

source: Application icon development
de: Entwicklung der Anwendungssymbole

source: Theme to open
de: Zu öffnendes Design

source: Try
de: Ausprobieren

source: Save changes to the document?
de: Änderungen am Dokument speichern?

source: File not saved
de: Datei nicht gespeichert

source: Pairs Themes
de: Pairs-Designs

source: Save Pairs theme
de: Pairs-Design speichern

source: Open Pairs theme
de: Pairs-Design öffnen

source: New Image
de: Neues Bild

source: New Logic Relation
de: Neue Logikbeziehung

source: New Sound
de: Neuer Klang

source: New Word
de: Neues Wort

source: New Found Sound
de: Neuer Treffer-Klang

source: The Title is missing
de: Der Titel fehlt

source: The Author is missing
de: Der Autor fehlt

source: The Version is missing
de: Die Version fehlt

source: The Description is missing
de: Die Beschreibung fehlt

source: The Back Image is missing
de: Das Bild der Rückseite fehlt

source: Logic image file
de: Logik-Bilddatei

source: Language of the logic image
de: Sprache des Logik-Bilds

source: Image file
de: Bilddatei

source: Language of the image
de: Sprache des Bilds

source: Found sound file
de: Datei für Treffer-Klang

source: Language of the found sound file
de: Sprache der Datei für Treffer-Klang

source: Sound file
de: Klangdatei

source: Language of the sound file
de: Sprache der Klangdatei

source: Language of the word
de: Sprache des Worts

source: Word
de: Wort

source: Title:
de: Titel:

source: The title of the theme
de: Der Titel des Designs

source: Description:
de: Beschreibung:

source: Description to the theme
de: Beschreibung für das Design

source: Description of the theme
de: Beschreibung für das Design

source: Author:
de: Autor:

source: Author (your) name
de: Name des Autors (Ihr Name)

source: Theme version
de: Design-Version

source: Date:
de: Datum:

source: Today's date
de: Heutiges Datum

source: Main Type:
de: Haupttyp:

source: The main game of the theme
de: Das Hauptspiel des Designs

source: image
de: Bild

source: relation
de: Beziehung

source: sound
de: Klang

source: word
de: Wort

source: Back Image:
de: Bild der Rückseite:

source: The back image component
de: Die Bildrückseiten-Komponente

source: Add a new element
de: Ein neues Element hinzufügen

source: Remove an element
de: Ein Element entfernen

source: Add Feature
de: Funktion hinzufügen

source: Image:
de: Bild:

source: Play the sound file
de: Die Klangdatei abspielen

source: any
de: Beliebig

source: Language:
de: Sprache:

source: Word:
de: Wort:

source: Main Toolbar
de: Haupt-Werkzeugleiste
