Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/kdeedu/rocscore.po
Languages: de

# NAME OF TRANSLATORS
source: Your names
de: Frederik Schwarzer, Torbjörn Klatt

# EMAIL OF TRANSLATORS
source: Your emails
de: schwarzer@kde.org, torbjoern.k@googlemail.com

source: Could not set data type for node %1: data type does not exist.
de: Der Datentyp für Knoten %1 kann nicht eingestellt werden, da dieser Typ nicht existiert.

# Scripting API Description
source: An abstract data element is a unit of information that belongs to an abstract data structure and possibly is connected to other data elements by pointers.
de: Ein abstraktes Datenelement ist eine Einheit von Informationen, die zu einer abstrakten Datenstruktur gehören, und kann mit anderen Datenelementen durch Zeiger verbunden sein.

# Scripting API Description
source: The unique identifier of this data element.
de: Der eindeutige Bezeichner für dieses Datenelement.

# Scripting API Description
source: The x-coordinate of this data element.
de: Die X-Koordinate dieses Datenelements.

# Scripting API Description
source: The y-coordinate of this data element.
de: Die y-Koordinate dieses Datenelements.

# Scripting API Description
source: The size of this data element.
de: Die Größe dieses Datenelements.

# Scripting API Description
source: The color of this data element stated as hexadecimal value.
de: Die Farbe dieses Datenelements als Hexadezimalwerts.

# Scripting API Description
source: An abstract data structure defines a set of data elements and possible connections between them.
de: Eine abstrakte Datenstruktur definiert eine Menge von Datenelementen und mögliche Verbindungen zwischen Ihnen.

# Scripting API Description
source: The unique name of this data structure.
de: Der eindeutige Name dieser Datenstruktur.

# Scripting API Description
source: An Edge is the connection of two GraphNodes. Edges can be directed or undirected, depending on their type.
de: Eine Kante ist eine Verbindung zwischen zwei Knoten eines Graphen. Kanten können abhängig vom Typ gerichtet oder ungerichtet sein.

source: The method "%1" is deprecated, please use "%2" instead.
de: Die Methode „%1“ ist veraltet, bitte benutzen Sie statt dessen „%2“.

# Scripting API Description
source: A node is the data element of a graph.
de: Ein Knoten ist ein Datenelement eines Graphen.

# Scripting API Description
source: Return list all nodes connected to this node. This method respects if edges are directed.
de: Gibt eine Liste aller Knoten zurück, die mit diesem Knoten verbunden sind. Dabei wird berücksichtigt, ob Kanten gerichtet sind.

# Scripting API Description
source: Return a list of all edges (incoming and outgoing) of this node.
de: Gibt eine Liste aller Kanten (eingehend und ausgehend) dieses Knotens zurück.

# Scripting API Description
source: Return a list of all edges (incoming and outgoing) of this node of a specified type.
de: Gibt eine Liste aller Kanten (eingehend und ausgehend) des angegebenen Typs dieses Knotens zurück.

# Scripting API Description
source: Return a list of incoming edges of this node.
de: Gibt eine Liste aller eingehenden Kanten dieses Knotens zurück.

# Scripting API Description
source: Return a list of all incoming edges of this node of a specified type.
de: Gibt eine Liste von eingehenden Kanten des angegebenen Typs zu diesem Knoten zurück.

# Scripting API Description
source: Return a list of all outgoing edges of this node.
de: Gibt eine Liste aller ausgehenden Kanten dieses Knotens zurück.

# Scripting API Description
source: Return a list of all outgoing edges of this node of a specified type.
de: Gibt eine Liste von ausgehenden Kanten des angegebenen Typs von diesem Knoten zurück.

# Scripting API Description
source: Return a list of all edges of this node to the specified node.
de: Gibt eine Liste aller Kanten des angegebenen Typs dieses Knotens zurück.

# @title Displayed plugin name
source: Graph Structure
de: Graphenstruktur

source: Size
de: Größe

source: Graph Type:
de: Graphentyp:

# @label:inlistbox graph for which several edges between same nodes may exist
source: Multigraph
de: Mehrfachgraph

source: Cannot create edge: nodes are not defined.
de: Kante kann nicht erstellt werden: Knoten sind nicht definiert.

source: Cannot create edge: pointer type %1 not defined
de: Kante kann nicht erstellt werden: Zeigertyp %1 ist nicht definiert

source: The global method "%1" is deprecated, please use "%2" instead.
de: Die globale Methode „%1“ ist veraltet, bitte benutzen Sie statt dessen „%2“.

source: This action will probably remove some edges. Do you want to continue?
de: Diese Aktion wird vermutlich einige Kanten entfernen. Möchten Sie fortfahren?

source: Could not add back-edge (%1->%2) to undirected graph.
de: Die rückwärts gerichtete Kante (%1->%2) kann nicht zu einem unidirektionalen Graphen hinzugefügt werden.

source: Could not add existing edge (%1->%2): this graph is no multigraph.
de: Die vorhandene Kante (%1->%2) kann nicht hinzugefügt werden: Dieser Graph ist kein Multigraph.

# Scripting API Description
source: A graph objects holds the information of a data structure of type "Graph".
de: Ein Graphenobjekt enthält Informationen über eine Datenstruktur vom Typ „Graph“.

# Scripting API Description
source: Return list all nodes in the graph.
de: Gibt eine Liste aller Knoten des Graphen zurück.

# Scripting API Description
source: Return list all nodes in the graph of specified type.
de: Gibt eine Liste aller Knoten des Graphen vom angegebenen Typ zurück.

# Scripting API Description
source: Return list all edges in the graph.
de: Gibt eine Liste aller Kanten des Graphen zurück.

# Scripting API Description
source: Return list all edges in the graph of specified type.
de: Gibt eine Liste aller Kanten des Graphen vom angegebenen Typ zurück.

# Scripting API Description
source: Create a new node of the specified type and return the created node. If the type is not registered, no node is created.
de: Erstellt einen neuen Knoten vom angegebenen Typ und gibt den erzeugten Knoten zurück. Ist der Typ nicht registriert, wird kein Knoten erzeugt.

# Scripting API Description
source: Create a new node of default type and return the created node.
de: Erstellt einen neuen Knoten vom Standardtyp und gibt den erzeugten Knoten zurück.

# Scripting API Description
source: Create an edge from node "from" to node "to" of the specified type and return the created edge. If the type is not registered, no edge is created.
de: Erstellt einen Kante vom Knoten „from“ zum Knoten „to“ vom angegebenen Typ und gibt die erzeugte Kante zurück. Ist der Typ nicht registriert, wird keine Kante erzeugt.

# Scripting API Description
source: Create an edge from node "from" to node "to" of default type and return the created edge.
de: Erstellt einen Kante vom Knoten „from“ zum Knoten „to“ als Standardtyp und gibt die erzeugte Kante zurück.

# Scripting API Description
source: Returns an array of shortest path lengths from this node to every other node in the graph.
de: Gibt ein Feld mit den kürzesten Pfadlängen von diesem Knoten zu jedem anderen Knoten im Graphen zurück.

# Scripting API Description
source: A node is the data element of a linked list.
de: Ein Knoten ist das Datenelement einer verketteten Liste.

# Scripting API Description
source: Set pointer of this list node to the target node.
de: Setzt den Zeiger dieses Listenknotens auf den Zielknoten.

# @title Displayed plugin name
source: Linked List Structure
de: „Verkettete Liste“-Struktur

source: Front value
de: Frontwert

source: Data '%1' has more than one out pointer.
de: Datensatz „%1“ hat mehr als einen ausgehenden Zeiger.

source: Cannot convert document '%1'
de: Das Dokument „%1“ kann nicht umgewandelt werden.

# Scripting API Description
source: A list objects holds the information of a data structure of type "Linked List".
de: Ein Listenobjekt enthält Informationen über eine Datenstruktur vom Typ „verkettete Liste“.

# Scripting API Description
source: Return head node of the list.
de: Gibt den ersten Knoten der Liste zurück.

# Scripting API Description
source: Set the head of the list.
de: Setzt den ersten Knoten der Liste.

# @title Displayed plugin name
source: RootedTree Structure
de: Wurzelbaum-Struktur

# @option:check
source: Show all pointers
de: Alle Zeiger anzeigen

source: There are cycles at node %1. Data will be lost by conversion.
de: Der Knoten %1 hat Zirkelbezüge. Die Daten werden beim Konvertieren entfernt.

# document that contains graphs or data structures as a visual representation
source: Document
de: Dokument

# Scripting API Description
source: The Console object allows you to print messages of different importance to a log.
de: Mit dem Objekt „Console“ können Meldungen unterschiedlicher Wichtigkeit ausgegeben werden.

# Scripting API Description
source: Console is not a constructor. All properties and methods of Console can be called by using Console as an object, without creating it.
de: „Console“ ist kein Konstruktor. Alle Eigenschaften und Methoden des Objekts „Console“ aufgerufen werden, indem „Console“ als Objekt verwendet wird, ohne es zu konstruieren.

# Scripting API Description
source: Console.log("This is a program message."); // print a program message Console.debug("A debug message."); // print a debug message
de: Console.log("Dies ist eine Programmmeldung."); // gibt eine normale Meldung aus Console.debug("Eine Debug-Meldung."); // gibt eine Fehlermeldung aus

# Scripting API Description
source: Print the given message of normal severity.
de: Gibt eine normale Meldung aus.

# Scripting API Description
source: Print the given debug message.
de: Gibt die angegebene Debug-Meldung aus.

# Scripting API Description
source: Print the given error message of high severity.
de: Gibt eine wichtige Fehlermeldung aus.

source: Group
de: Gruppe

source: Cannot open file %1.
de: Die Datei „%1“ kann nicht geöffnet werden.

source: Invalid include directive: %1. Cannot find file in directive.
de: Ungültige Einfügeanweisung: %1. Datei kann in der Anweisung nicht gefunden werden.

# @title Displayed plugin name
source: Graphviz Graph File Backend
de: Backend für Graphviz-Graphendateien

source: Read and write Graphviz graph files.
de: Graphviz-Graphendateien lesen und schreiben

source: Could not open file "%1" in read mode: %2
de: Die Datei „%1“ lässt sich nicht im Lesemodus öffnen: %2

source: Could not parse file "%1".
de: Die Datei „%1“ lässt sich nicht einlesen.

source: No active graph in this document.
de: Dieses Dokument enthält keinen aktiven Graphen.

source: Cannot open file %1 to write document. Error: %2
de: Die Datei %1 kann zum Schreiben des Dokuments nicht geöffnet werden. Fehler: %2

# @title Displayed plugin name
source: GML File Backend
de: Backend für GML-Dateien

source: Read and write Graph Markup Language (GML) files.
de: Dateien im Format „Graph Markup Language“ (GML) lesen und schreiben.

source: *.gml|Graph Markup Language Format
de: *.gml|Graph-Markup-Sprachformat

# @title Displayed plugin name
source: KML File Backend
de: Backend für KML-Dateien

source: Read and write Keyhole Markup Language (KML) files.
de: Keyhole-Markup-Sprachdateien (KML) lesen und schreiben.

source: *.kml|Keyhole Markup Language Format
de: *.kml|Keyhole-Markup-Sprachformat

source: Cannot open file %1: %2
de: Die Datei %1 lässt sich nicht öffnen: %2

# @title Displayed plugin name
source: TGF File Backend
de: Backend für TGF-Dateien

source: Read and write Trivial Graph Format (TGF) files.
de: Dateien im Format „Trivial Graph“ (TGF) lesen und schreiben.

source: Could not parse file. Identifier "%1" is used more than once.
de: Datei kann nicht eingelesen werden. Die Kennung „%1“ wird mehrfach benutzt.

source: Could not parse file. Edge from "%1" to "%2" uses undefined nodes.
de: Die Datei kann nicht eingelesen werden. Die Kante von „%1“ zu „%2“ verwendet nicht definierte Knoten.

source: Could not open file "%1" in write mode: %2
de: Die Datei „%1“ lässt sich nicht im Schreibmodus öffnen: %2

source: No data structure specified for output in this document.
de: Für die Ausgabe in dieses Dokument ist keine Datenstruktur angegeben.

# @title Displayed plugin name
source: PGF/TikZ Export File Backend
de: Backend für PGF/TikZ-Exportdateien

source: Export graph documents in PGF/TikZ format.
de: Exportiert Graphendokumente im Format PGF/TikZ.

source: *.pgf|TikZ (PGF) Format
de: *.pgf|TikZ-Format (PGF)

# @title Displayed plugin name
source: Rocs Graph File Backend
de: Backend für Rocs-Graphendateien

source: Read and write Rocs Graph Files
de: Rocs-Graphendateien lesen und schreiben

source: *.graph|Rocs Graph File Format
de: *.graph|Rocs-Graphendatei-Format

source: Could not write data, aborting. Error: %1.
de: Daten können nicht geschrieben werden, der Vorgang wird abgebrochen: Fehler %1

source: Could not set pointer type: pointer type does not exist.
de: Der Zeigertyp kann nicht eingestellt werden, da dieser Typ nicht existiert.

# Scripting API Description
source: A pointer connects two data elements and can itself hold information by its properties.
de: Ein Zeiger verbindet zwei Datenelemente und kann Informationen über seine Eigenschaften enthalten.

# Scripting API Description
source: Start of the connection.
de: Start der Verbindung.

# Scripting API Description
source: End of the connection
de: Ende der Verbindung

# Scripting API Description
source: If true, the connection is directed. Otherwise is connection is undirected.
de: Falls wahr, ist die Verbindung gerichtet, andernfalls ist sie ungerichtet.

# Scripting API Description
source: ID of the connection type.
de: Kennung des Verbindungstyps.

# Scripting API Description
source: The width of the connection.
de: Breite der Verbindung.

# Scripting API Description
source: Remove this connection.
de: Diese Verbindung entfernen.

# Scripting API Description
source: Add a new property to the connection.
de: Der Verbindung eine neue Eigenschaft hinzufügen.

# Scripting API Description
source: Remove an existing property from the connection.
de: Eine bestehende Eigenschaft der Verbindung entfernen.

source: Connection
de: Verbindung

source: Rocs Console script
de: Rocs-Konsolenskript

source: Script Error: %1
de: Skriptfehler: %1

# @info status message after successful script execution
source: <i>Execution Finished</i>
de: <i>Ausführung beendet</i>

source: Script error in included file %1
de: Skript-Fehler in Include-Datei %1
