Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/extragear-network/konversation.po
Languages: de

source: Sends a private message to the user with &i18n-nickname; <userinput><replaceable>nick</replaceable></userinput> or to all users in <userinput><replaceable>channel</replaceable></userinput>. Unlike <userinput><command>/query</command></userinput>, does not open a new tab. If <userinput><replaceable>message</replaceable></userinput> begins with <userinput><command>/me </command></userinput>, the message is formatted in the same manner as a <userinput><command>/me</command></userinput> command.
de: Sendet eine private <userinput><replaceable>Nachricht</replaceable></userinput> an den Benutzer <userinput><replaceable>Spitzname</replaceable></userinput> oder alle Benutzer in einem <userinput><replaceable>Kanal</replaceable></userinput>. Es wird kein neues Unterfenster geöffnet. Falls die <userinput><replaceable>Nachricht</replaceable></userinput> mit <userinput><command>/me</command></userinput> beginnt, wird die Nachricht so formatiert, wie direkt mit dem Befehl <userinput><command>/me</command></userinput> gesendete Nachrichten.

source: Examples
de: Beispiele

source: /msg Eisfuchs I need some help with the msg command
de: /msg Eisfuchs Ich brauche Hilfe mit dem msg-Befehl

source: /msg #konversation New version of Konvi is online!
de: /msg #konversation Eine neue Version von Konvi ist fertig!

source: /msg Eisfuchs /me is compiling the Handbook right now.
de: /msg Eisfuchs /me kompiliert gerade das Handbuch

source: <userinput><command>/smsg </command><replaceable>nick|channel</replaceable></userinput> <userinput><replaceable>message</replaceable></userinput>
de: <userinput><command>/smsg</command> <replaceable>Spitzname|Kanal</replaceable></userinput> <userinput><replaceable>Nachricht</replaceable></userinput>

source: Same as <userinput><command>/msg</command></userinput> except the message is not displayed on your screen. This is useful for preventing passwords and other sensitive information from remaining exposed on your screen or being logged.
de: Wie <userinput><command>/msg</command></userinput>, die Nachricht wird jedoch auf Ihrem Bildschirm nicht angezeigt. Dies kann nützlich sein, um zu verhindern, dass Passwörter oder andere vertrauliche Informationen auf Ihrem Bildschirm sichtbar sind oder protokolliert werden.

source: <userinput><command>/amsg </command><replaceable>nick|channel</replaceable></userinput> <userinput><replaceable>message</replaceable></userinput>
de: <userinput><command>/amsg</command> <replaceable>Spitzname|Kanal</replaceable></userinput> <userinput><replaceable>Nachricht</replaceable></userinput>

source: Like the <userinput><command>/msg</command></userinput> command above except that the message is sent to all the channels and queries you have open on all the servers you have connected in &konversation;.
de: Wie <userinput><command>/msg</command></userinput>, die Nachricht wird jedoch an alle geöffneten Kanäle und Queries gesendet.

source: <command>/op </command> <replaceable>nick</replaceable>
de: <command>/op</command> <replaceable>Spitzname</replaceable>

source: When entered into a channel tab, attempts to give <userinput><replaceable>nick</replaceable></userinput> operator privilege for the channel. May not work if you lack sufficient privilege in the channel (you must be a channel operator yourself). You may enter more than one &i18n-nickname; separated by spaces.
de: Dem Benutzer <userinput><replaceable>Spitzname</replaceable></userinput> Operator-Rechte für den Kanal geben. Dieser Befehl muss in einem Kanal ausgeführt werden und funktioniert nur, wenn Sie selbst Operator des Kanals sind. Sie können mehrere &i18n-Nickname;n getrennt durch Leerzeichen angeben.

source: <command>/deop </command><replaceable>nick</replaceable>
de: <command>/deop</command> <replaceable>Spitzname</replaceable>

source: When entered into a channel tab, takes away channel operator privilege from <userinput><replaceable>nick</replaceable></userinput>. You may enter more than one &i18n-nickname; separated by spaces.
de: Dem Benutzer <userinput><replaceable>Spitzname</replaceable></userinput> Operator-Rechte für den Kanal entziehen. Dieser Befehl muss in einem Kanal ausgeführt werden und funktioniert nur, wenn Sie selbst Operator des Kanals sind. Sie können mehrere &i18n-Nickname;n getrennt durch Leerzeichen angeben.

source: <command>/oper </command><replaceable>[nick]</replaceable>
de: <command>/oper</command> <replaceable>[Spitzname]</replaceable>

source: Grants the user with &i18n-nickname; <userinput><replaceable>nick</replaceable></userinput> &irc;-Op (Administrator) privilege. This only works if the &i18n-nickname; is listed in the server's O: line. &irc;-Ops have the privilege to <userinput><command>/kill</command></userinput> &i18n-nickname;s, <userinput><command>/connect</command></userinput> servers to the &irc; network, and more. If <userinput><replaceable>nick</replaceable></userinput> is not entered, attempts to grant yourself &irc;-Op privilege. You will be prompted for your &irc;-Op user name and password in either case.
de: Erteilt dem Benutzer mit dem gegebenen &i18n-Nickname;n &irc;-Op- (Administrator-) Rechte. Dies ist nur möglich, wenn der &i18n-Nickname; in der 0:-Zeile des Servers aufgeführt ist. &irc;-Ops haben u.a. das Recht, <userinput><command>/kill</command></userinput>-Befehle auszuführen und Server mit dem Befehl <userinput><command>/connect</command></userinput> mit dem &irc;-Netzwerk zu verbinden. Falls Sie keinen <userinput><replaceable>Spitznamen</replaceable></userinput> angeben, wird versucht, Ihnen selbst &irc;-Op-Rechte zu erteilen. In beiden Fällen werden Sie zur Eingabe Ihres &irc;-Op-Benutzernamens und -Passworts aufgefordert.

source: <command>/voice </command> <replaceable>nick</replaceable>
de: <command>/voice</command> <replaceable>Spitzname</replaceable>

source: In certain channels (with +m flag), users cannot send messages unless they have voice privilege. This command attempts to give <userinput><replaceable>nick</replaceable></userinput> voice privilege. You must have channel operator privilege to execute this command. This command is mostly used when you are an operator for a moderated channel.
de: In manchen Kanälen (mit Modus +m) können Benutzer nur Nachrichten senden, wenn Sie die Erlaubnis zu Schreiben haben. Dieser Befehl gibt dem Benutzer <userinput><replaceable>Spitzname</replaceable></userinput> die Erlaubnis zu Schreiben. Sie müssen zum Ausführen dieses Befehls Operator des Kanals sein. Dieser Befehl wird normalerweise von Operatoren in moderierten Kanälen verwendet.

source: <command>/unvoice </command> <replaceable>nick</replaceable>
de: <command>/unvoice</command> <replaceable>Spitzname</replaceable>

source: Takes away voice privilege from <userinput><replaceable>nick</replaceable></userinput> in the channel.
de: Dem Benutzer <userinput><replaceable>Spitzname</replaceable></userinput> die Erlaubnis zu Schreiben nehmen.

source: <command>/topic </command><replaceable>[channel]</replaceable> <replaceable>[message]</replaceable>
de: <command>/topic</command> <replaceable>[Kanal]</replaceable> <replaceable>[Nachricht]</replaceable>

source: Attempts to set the topic of <userinput><replaceable>channel</replaceable></userinput> to <userinput><replaceable>message</replaceable></userinput>. When entered in a channel tab, <userinput><replaceable>channel</replaceable></userinput> may be omitted and defaults to the channel active in the tab. If <userinput><replaceable>message</replaceable></userinput> is omitted, displays the current topic of the channel. Changing a channel topic may fail if you lack sufficient privilege.
de: Das Thema des <userinput><replaceable>Kanals</replaceable></userinput> in <userinput><replaceable>Nachricht</replaceable></userinput> ändern. Wenn dieser Befehl in einem Kanal ausgeführt wird, kann <userinput><replaceable>Kanal</replaceable></userinput> weggelassen werden, wenn der aktuelle Kanal gemeint ist. Falls <userinput><replaceable>Nachricht</replaceable></userinput> nicht angegeben wird, so wird das aktuelle Thema des Kanals angezeigt. Sie benötigen entsprechende Rechte, um das Kanalthema zu ändern.

source: <command>/away </command> <replaceable>reason</replaceable>
de: <command>/away</command> <replaceable>Grund</replaceable>

source: If anyone tries to send you a private message or invite you to a channel, they will be told that you are away from your workstation for <userinput><replaceable>reason</replaceable></userinput>. To change your state back to normal, enter <userinput><command>/away</command></userinput> without a <userinput><replaceable>reason</replaceable></userinput>.
de: Den Status auf abwesend setzen. Wenn andere Benutzer versuchen, Ihnen Nachrichten zu senden, so wird diesen mitgeteilt, dass Sie aus einem bestimmten <userinput><replaceable>Grund</replaceable></userinput> abwesend sind. Verwenden Sie den Befehl <userinput><command>/away</command></userinput> ohne Angabe eines Grundes, um den Status zurückzusetzen.

source: <command>/aaway </command><replaceable>reason</replaceable>
de: <command>/aaway</command> <replaceable>Grund</replaceable>

source: Like the <userinput><command>/away</command></userinput> command above except that the command is sent to all the servers you have connected in &konversation;.
de: Wie <userinput><command>/away</command></userinput> (siehe oben), der Befehl wird jedoch für alle Server ausgeführt, mit denen Sie verbunden sind.

source: <command>/invite </command><replaceable>nick</replaceable> <replaceable>[channel]</replaceable>
de: <command>/invite</command> <replaceable>Spitzname</replaceable> <replaceable>[Kanal]</replaceable>

source: Invites the user with &i18n-nickname; <userinput><replaceable>nick</replaceable></userinput> to join <userinput><replaceable>channel</replaceable></userinput>. This command is especially useful if the channel is invite-only. When entered in a channel tab, <userinput><replaceable>channel</replaceable></userinput> may be omitted.
de: Lädt den Benutzer <userinput><replaceable>Spitzname</replaceable></userinput> ein, einen <userinput><replaceable>Kanal</replaceable></userinput> zu betreten. Dies ist besonders nützlich, wenn ein Kanal nur auf Einladung betreten werden kann. Wenn Sie den Befehl in einem Kanal ausführen, können Sie <userinput><replaceable>Kanal</replaceable></userinput> weglassen.

source: <command>/exec </command><replaceable>script</replaceable> <replaceable>[parameters]</replaceable>
de: <command>/exec</command> <replaceable>Skript</replaceable> <replaceable>[Parameter]</replaceable>

source: Executes the &konversation;-compatible shell script named <userinput><replaceable>script</replaceable></userinput>, passing it <userinput><replaceable>parameters</replaceable></userinput>. See <link linkend="scripting">Scripting</link> for more information on using and writing scripts.
de: Führt ein &konversation;-kompatibles Shell-<userinput><replaceable>Skript</replaceable></userinput> mit den gegebenen <userinput><replaceable>Parametern</replaceable></userinput> aus. Weitere Informationen dazu finden Sie im Abschnitt <link linkend="scripting">Skriptunterstützung</link>.

source: Examples:
de: Beispiele:

source: Sends your system's &kde; and &Qt; version numbers to the channel.
de: Sendet die Versionsnummern Ihrer &kde;- und &Qt;-Versionen an den Kanal.

source: Sends your &Linux; version string (the output of <quote>uname -a</quote>) to the channel.
de: Sendet die Version Ihres &Linux;-Systems an den Kanal (die Ausgabe von <quote>uname -a</quote>).

source: <command>/notify </command><replaceable>[nick]</replaceable>
de: <command>/notify</command> <replaceable>[Spitzname]</replaceable>

source: Adds or removes <userinput><replaceable>nick</replaceable></userinput> from your <link linkend="nicksonline">Watched Nicks Online</link> list. If the &i18n-nickname; is already in the list, it is removed. If it is not in the list, it is added. If <userinput><replaceable>nick</replaceable></userinput> is omitted, displays the current list of watched &i18n-nickname;s.
de: Fügt den <userinput><replaceable>Spitznamen</replaceable></userinput> zu Ihrer <link linkend="nicksonline">Beobachtungsliste</link> hinzu, oder entfernt ihn daraus. Falls der &i18n-Nickname; auf der Liste ist, wird er entfernt, anderenfalls hinzugefügt. Falls Sie keinen <userinput><replaceable>Spitznamen</replaceable></userinput> angeben, wird die aktuelle Beobachtungsliste ausgegeben.

source: <command>/kick </command><replaceable>nick</replaceable> <replaceable>reason</replaceable>
de: <command>/kick </command><replaceable>Spitzname</replaceable> <replaceable>Grund</replaceable>

source: When entered in a channel tab, attempts to kick the user with &i18n-nickname; <userinput><replaceable>nick</replaceable></userinput> from the channel with <userinput><replaceable>reason</replaceable></userinput>. If <userinput><replaceable>reason</replaceable></userinput> is not entered, defaults to the reason in the <link linkend="identity">Settings</link>. This command may only be used in a channel tab.
de: Versucht, den Benutzer mit dem gegebenen <userinput><replaceable>Spitznamen</replaceable></userinput> aus dem gegebenen <userinput><replaceable>Grund</replaceable></userinput> aus dem Kanal zu werfen. Falls kein <userinput><replaceable>Grund</replaceable></userinput> angegeben wird, wird der in den <link linkend="identity">Einstellungen</link> festgelegte Grund verwendet. Dieser Befehl kann nur in Kanälen ausgeführt werden.

source: <command>/ban </command> [<command>-host</command>|<command>-domain</command>| <command>-userhost</command>|<command>-userdomain</command>] <replaceable>[channel]</replaceable> <replaceable>user</replaceable>|<replaceable>mask</replaceable>
de: <command>/ban </command> [<command>-host</command>|<command>-domain</command>| <command>-userhost</command>|<command>-userdomain</command>] <replaceable>[Kanal]</replaceable> <replaceable>Benutzer</replaceable>|<replaceable>Maske</replaceable>

source: Attempts to ban the <userinput><replaceable>user</replaceable></userinput> or <userinput><replaceable>mask</replaceable></userinput> from <userinput><replaceable>channel</replaceable></userinput>. When entered in a channel tab, <userinput><replaceable>channel</replaceable></userinput> may be omitted. For more information on hosts, domains, and masks, see the documents at <ulink url="http://www.irchelp.org/">irchelp.org</ulink>. To get the current ban list for a channel, enter <userinput><command>/mode </command><replaceable>channel</replaceable> <command>b</command></userinput>.
de: Versucht, den gegebenen <userinput><replaceable>Benutzer</replaceable></userinput> oder eine <userinput><replaceable>Maske</replaceable></userinput> aus dem gegebenen <userinput><replaceable>Kanal</replaceable></userinput> auszuschließen. Falls der Befehl in einem Kanal ausgeführt wird, muss kein <userinput><replaceable>Kanal</replaceable></userinput> angegeben werden. Weitere Informationen über Hosts, Domains und Masken finden Sie auf <ulink url="http://www.irchelp.org/">irchelp.org</ulink>. Die aktuelle Ausschlussliste für einen Kanal erhalten Sie mit dem Befehl <userinput><command>/mode</command> <replaceable>Kanal</replaceable> <command>b</command></userinput>.

source: <command>/unban </command> <replaceable>[channel]</replaceable> <replaceable>pattern</replaceable>
de: <command>/unban</command> <replaceable>[Kanal]</replaceable> <replaceable>Ausdruck</replaceable>

source: Reverts a previous banning from a channel. When entered in a channel tab, <userinput><replaceable>channel</replaceable></userinput> may be omitted.
de: Macht einen vorherigen Ausschluss aus einem Kanal rückgängig. Falls der Befehl in einem Kanal ausgeführt wird, muss kein <userinput><replaceable>Kanal</replaceable></userinput> angegeben werden.

source: <command>/ignore </command> [<command>-all</command>] <replaceable>nick</replaceable>
de: <command>/ignore</command> [<command>-all</command>] <replaceable>Spitzname</replaceable>

source: Adds <userinput><replaceable>nick</replaceable></userinput> to your Ignore list. You may specify more than one &i18n-nickname; separated by spaces. Channel messages from users on your Ignore list are not displayed. In addition, if you enter <userinput><command>-all</command></userinput>, all message types (queries, notices, &CTCP;, DCC, and Exceptions) from the user are ignored as well as channel messages.
de: Fügt den Benutzer <userinput><replaceable>Spitzname</replaceable></userinput> zu Ihrer Ignorierliste hinzu. Sie können mehrere &i18n-Nickname;n durch Leerzeichen getrennt angeben. Falls Sie den Parameter <userinput><command>-all</command></userinput> verwenden, werden sämtliche Nachrichten (auch Queries, &CTCP;, DCC und Fehler) von diesem Benutzer ignoriert.

source: Sends <userinput><replaceable>cmd</replaceable></userinput> to the server.
de: Sendet <userinput><replaceable>cmd</replaceable></userinput> an den Server.

source: <command>/say </command> <replaceable>msg</replaceable>
de: <command>/say</command> <replaceable>Nachricht</replaceable>

source: When entered in a channel tab, sends <userinput><replaceable>msg</replaceable></userinput> to the channel. This is the same as entering <userinput><replaceable>msg</replaceable></userinput> in the channel <interface>Input Line</interface>. Useful for sending &irc; commands when you don't want to execute the command. Two command characters (//) in a row does the same thing as <userinput><command>/say</command></userinput>. Also used by <link linkend="scripting">scripts</link> to send messages.
de: Sendet die <userinput><replaceable>Nachricht</replaceable></userinput> an den Kanal. Dies entspricht der Eingabe der <userinput><replaceable>Nachricht</replaceable></userinput> in der <interface>Eingabezeile</interface>. Dieser Befehl kann verwendet werden, um &irc;-Befehle als Text zu senden, ohne sie auszuführen. Zwei Befehlszeichen (//) bewirken dasselbe. Der Befehl <userinput><command>/say</command></userinput> wird auch von <link linkend="scripting">Skripten</link> zum Senden von Nachrichten verwendet.

source: Places the server log in raw mode (<command>open</command>) or stops raw mode (<command>close</command>). If neither <command>open</command> or <command>close</command> is entered, defaults to <command>open</command>. In raw mode, the log displays every message received from the server in native &irc; format.
de: Öffnet (<command>open</command>) oder schließt (<command>close</command>) das Rohdatenprotokoll. Falls Sie keinen Parameter angeben, wird <command>open</command> verwendet. Im Rohdatenprotokoll werden Nachrichten direkt im ursprünglichen &irc;-Format angezeigt.

source: Opens a new tab running a &kde; &konsole;.
de: Öffnet eine &kde;-&konsole; in einem neuen Unterfenster.

source: <command>/server </command> <replaceable>[url]</replaceable> <replaceable>[pwd]</replaceable>
de: <command>/server</command> <replaceable>[url]</replaceable> <replaceable>[Passwort]</replaceable>

source: Connects to the server at address <userinput><replaceable>url</replaceable></userinput>. If <userinput><replaceable>url</replaceable></userinput> is omitted, connects to the server associated with the tab where you enter the command. This is useful for re-connecting to a server when disconnected. If the server requires a password in order to connect to it, enter it for <userinput><replaceable>pwd</replaceable></userinput>. If the server requires a port number other than the default (6667), enter the <userinput><replaceable>url</replaceable></userinput> like this: <replaceable>irc.kde.org:6665</replaceable>.
de: Stellt eine Verbindung zum Server mit der Adresse <userinput><replaceable>url</replaceable></userinput> her. Wenn keine <userinput><replaceable>url</replaceable></userinput> angegeben wird, wird eine Verbindung zum Server des aktuellen Unterfensters hergestellt. Dies kann beispielsweise zum erneuten Verbinden genutzt werden, wenn die Verbindung abgebrochen wurde. Falls die Verbindung ein <userinput><replaceable>Passwort</replaceable></userinput> benötigt, geben Sie dieses an. Falls der Server eine andere Port-Nummer verwendet, als 6667 (Standard), geben Sie die <userinput><replaceable>url</replaceable></userinput> folgendermaßen an: <replaceable>irc.kde.org:6665</replaceable>

source: <command>/dcc </command> <command>SEND </command><replaceable>nick</replaceable> <replaceable>[filename]</replaceable>
de: <command>/dcc</command> <command>SEND</command> <replaceable>Spitzname</replaceable> <replaceable>[Datei]</replaceable>

source: Sends <userinput><replaceable>filename</replaceable></userinput> to the user with &i18n-nickname; <userinput><replaceable>nick</replaceable></userinput>. If <userinput><replaceable>filename</replaceable></userinput> is omitted, a dialog appears for you to select a file.
de: Sendet die <userinput><replaceable>Datei</replaceable></userinput> an den Benutzer <userinput><replaceable>Spitzname</replaceable></userinput>. Falls Sie keine <userinput><replaceable>Datei</replaceable></userinput> angeben, wird ein Dateiauswahldialog geöffnet.

source: Opens the <guilabel>DCC Status</guilabel> tab.
de: Öffnet das Unterfenster <guilabel>DCC-Status</guilabel>.

source: <command>/ctcp </command><replaceable>nick|channel</replaceable> <command>ping</command>
de: <command>/ctcp</command> <replaceable>Spitzname|Kanal</replaceable> <command>ping</command>

source: Sends a PING message to <userinput><replaceable>nick</replaceable></userinput> or <userinput><replaceable>channel</replaceable></userinput>. This is useful for determining if someone you are talking with has a high network lag, or (when sent to a channel) if your system has a high lag.
de: Sendet eine PING-Anforderung an den Benutzer <userinput><replaceable>Spitzname</replaceable></userinput> oder den <userinput><replaceable>Kanal</replaceable></userinput>. Dadurch können Sie feststellen, wie groß die Zeitverzögerung beim Senden an den anderen Benutzer bzw. an Sie (wenn ein Kanal angegeben wird) ist.

source: <command>/ctcp </command><replaceable>nick|channel</replaceable> <replaceable>msg</replaceable>
de: <command>/ctcp</command> <replaceable>Spitzname|Kanal</replaceable> <replaceable>Nachricht</replaceable>

source: Sends a message to <userinput><replaceable>nick</replaceable></userinput> or all users in <userinput><replaceable>channel</replaceable></userinput>. This is similar to the <userinput><command>/msg</command></userinput> command above, except that the message is sent using the &CTCP; protocol. The response on the other end depends on the &irc; client program the user is running. For example, when conversing with another &konversation; user, <userinput><replaceable>/ctcp Eisfuchs TIME</replaceable></userinput> will return the system time on Eisfuch's computer. <userinput><replaceable>/ctcp Eisfuchs VERSION</replaceable></userinput> will return the &konversation; version number from Eisfuch's computer.
de: Sendet eine <userinput><replaceable>Nachricht</replaceable></userinput> an den Benutzer <userinput><replaceable>Spitzname</replaceable></userinput> oder an alle Benutzer in einem <userinput><replaceable>Kanal</replaceable></userinput>. Dies entspricht dem Befehl <userinput><command>/msg</command></userinput> (siehe oben), die Nachricht wird jedoch über das &CTCP;-Protokoll versendet. Die Antwort des Empfängers hängt von dessen &irc;-Programm ab. Führen Sie beispielsweise den Befehl <userinput><replaceable>/ctcp Eisfuchs TIME</replaceable></userinput> aus, so wird die auf dem Rechner von Eisfuchs eingestellte Uhrzeit an Sie gesendet (falls dieser Benutzer &konversation; verwendet). Der Befehl <userinput><replaceable>/ctcp Eisfuchs VERSION</replaceable></userinput> liefert die &konversation;-Versionsnummer von Eisfuchs.
