Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/extragear-network/konversation.po
Languages: de

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>M</keycap></keycombo> </shortcut> <guimenu>Settings</guimenu> <guimenuitem>Show Menubar</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>M</keycap></keycombo></shortcut> <guimenu>Einstellungen</guimenu> <guimenuitem>Menüleiste anzeigen</guimenuitem>

source: Hides the main menu. Hit <keycombo action="simul">&Ctrl;<keycap>M</keycap></keycombo> to display it again.
de: Blendet die Menüleiste aus. Drücken Sie <keycombo action="simul">&Ctrl;<keycap>M</keycap></keycombo>, um sie wieder einzublenden.

source: <guimenu>Settings</guimenu> <guimenuitem>Show Toolbar</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>Werkzeugleiste anzeigen</guimenuitem>

source: Shows or hides the toolbar.
de: Blendet die Werkzeugleiste aus oder ein.

source: <guimenu>Settings</guimenu> <guimenuitem>Show Statusbar</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>Statusleiste anzeigen</guimenuitem>

source: Shows or hides the status bar at the bottom of the main screen.
de: Blendet die Statusleiste am unteren Rand des Hauptfensters ein oder aus.

source: <shortcut><keycap>F8</keycap></shortcut> <guimenu>Settings</guimenu> <guimenuitem>Identities...</guimenuitem>
de: <shortcut><keycap>F8</keycap></shortcut> <guimenu>Einstellungen</guimenu> <guimenuitem>Identitäten ...</guimenuitem>

source: Displays the <link linkend="identity">Identities</link> screen for setting your identification information.
de: Öffnet den Dialog <link linkend="identity">Identitäten</link> zur Einrichtung Ihrer Identität.

source: <guimenu>Settings</guimenu> <guimenuitem>Configure Shortcuts</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>Kurzbefehle festlegen ...</guimenuitem>

source: Allows you to change keyboard shortcuts for &konversation;.
de: Öffnet einen Dialog zum Ändern der Kurzbefehle für &konversation;.

source: <guimenu>Settings</guimenu> <guimenuitem>Configure Toolbars</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>Werkzeugleisten einrichten ...</guimenuitem>

source: Allows you to add or remove buttons from the &konversation; toolbar.
de: Öffnet einen Dialog, in dem Sie Knöpfe zur Werkzeugleiste von &konversation; hinzufügen oder aus ihr entfernen können.

source: <guimenu>Settings</guimenu> <guimenuitem>Configure Notifications</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>Benachrichtigungen festlegen ...</guimenuitem>

source: Displays the <link linkend="cfg-notifications">Notifications Settings</link> screen.
de: Öffnet den Dialog <link linkend="cfg-notifications">Benachrichtigungen festlegen</link>.

source: <guimenu>Settings</guimenu> <guimenuitem>Configure &konversation;</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>&konversation; einrichten ...</guimenuitem>

source: Displays the <guilabel>Configure</guilabel> screen.
de: Öffnet den Einrichtungsdialog.

source: The Window Menu
de: Das Menü Fenster

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>,</keycap></keycombo> </shortcut> <guimenu>Window</guimenu> <guimenuitem>Previous Tab</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>,</keycap></keycombo> </shortcut> <guimenu>Fenster</guimenu> <guimenuitem>Voriges Unterfenster</guimenuitem>

source: Displays the screen corresponding to the previous tab.
de: Zeigt das vorige Unterfenster an.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>.</keycap></keycombo> </shortcut> <guimenu>Window</guimenu> <guimenuitem>Next Tab</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>.</keycap></keycombo> </shortcut> <guimenu>Fenster</guimenu> <guimenuitem>Nächstes Unterfenster</guimenuitem>

source: Displays the screen corresponding to the next tab.
de: Zeigt das nächste Unterfenster an.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>W</keycap></keycombo> </shortcut> <guimenu>Window</guimenu> <guimenuitem>Close Tab</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>W</keycap></keycombo> </shortcut> <guimenu>Fenster</guimenu> <guimenuitem>Unterfenster schließen</guimenuitem>

source: Closes the current screen. If closing a channel, leaves the channel. If closing a <interface>Server Messages</interface> tab, closes all open channels on that server and disconnects from the server.
de: Schließt das aktuelle Unterfenster. Falls es sich dabei um einen Kanal handelt, so wird dieser verlassen. Handelt es sich um ein Unterfenster mit <interface>Servermeldungen</interface>, so werden alle auf dem entsprechenden Server betretenen Kanäle verlassen und die Verbindung zum Server getrennt.

source: <shortcut> <keycap>F11</keycap> </shortcut> <guimenu>Window</guimenu> <guimenuitem>Close All Open Queries</guimenuitem>
de: <shortcut> <keycap>F11</keycap> </shortcut> <guimenu>Fenster</guimenu> <guimenuitem>Alle offenen Queries schließen</guimenuitem>

source: Closes all <link linkend="query">Private conversations (queries)</link>.
de: Schließt alle <link linkend="query">Privaten Unterhaltungen (Queries)</link>.

source: <shortcut> <keycap>F4</keycap> </shortcut> <guimenu>Window</guimenu> <guimenuitem>Watched Nicks Online</guimenuitem>
de: <shortcut> <keycap>F4</keycap> </shortcut> <guimenu>Fenster</guimenu> <guimenuitem>Beobachtete Benutzer online</guimenuitem>

source: Displays the <guilabel>Watched Nicks Online</guilabel> screen. See <link linkend="nicksonline">Monitoring who is online</link>.
de: Öffnet das Unterfenster <guilabel>Beobachtete Benutzer online</guilabel>. Mehr Informationen dazu finden Sie im Abschnitt <link linkend="nicksonline">Beobachtung von Benutzern</link>.

source: <shortcut> <keycap>F6</keycap> </shortcut> <guimenu>Window</guimenu> <guimenuitem>&url; Catcher</guimenuitem>
de: <shortcut> <keycap>F6</keycap> </shortcut> <guimenu>Fenster</guimenu> <guimenuitem>&url;-Fänger</guimenuitem>

source: Displays the <link linkend="urlcatcher">&url; Catcher</link> screen.
de: Öffnet das Unterfenster <link linkend="urlcatcher">&url;-Fänger</link>.

source: <shortcut> <keycap>F9</keycap> </shortcut> <guimenu>Window</guimenu> <guimenuitem>DCC Status</guimenuitem>
de: <shortcut> <keycap>F9</keycap> </shortcut> <guimenu>Fenster</guimenu> <guimenuitem>DCC-Status</guimenuitem>

source: Displays the <link linkend="dcc">DCC Status</link> tab with information about file transfers.
de: Öffnet das Unterfenster <link linkend="dcc">DCC-Status</link> mit Informationen über Dateiübertragungen.

source: <guimenu>Window</guimenu> <guimenuitem>New Konsole</guimenuitem>
de: <guimenu>Fenster</guimenu> <guimenuitem>Neue Konsole</guimenuitem>

source: Displays a terminal screen. You may open as many <guilabel>Konsole</guilabel> tabs as you like.
de: Öffnet ein Terminal-Unterfenster. Sie können beliebig viele <guilabel>Konsolen</guilabel> öffnen.

source: <shortcut> <keycap>F5</keycap> </shortcut> <guimenu>Window</guimenu> <guimenuitem>Channel List for</guimenuitem>
de: <shortcut> <keycap>F5</keycap> </shortcut> <guimenu>Fenster</guimenu> <guimenuitem>Kanalliste für [Netzwerk]</guimenuitem>

source: Displays a <link linkend="list-channels">list of channels</link> available on the server.
de: Zeigt eine <link linkend="list-channels">Liste der Kanäle</link>, die auf dem aktuellen Server verfügbar sind.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>O</keycap></keycombo> </shortcut> <guimenu>Window</guimenu> <guimenuitem>Open Logfile for</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>O</keycap></keycombo> </shortcut> <guimenu>Fenster</guimenu> <guimenuitem>Protokolldatei für [Kanal] öffnen</guimenuitem>

source: Displays a screen with the log of messages from the current tab. Only works for <interface>Channel</interface>, <interface>Server Messages</interface>, and <interface>Query</interface> tabs. Logging must be enabled in <menuchoice> <guisubmenu>Settings</guisubmenu> <guisubmenu>Configure Konversation</guisubmenu> <guisubmenu>Behavior</guisubmenu> <guisubmenu>Logging</guisubmenu> </menuchoice> on the main menu.
de: Öffnet ein Unterfenster mit dem Protokoll für das aktuelle Unterfenster. Dies ist nur bei <interface>Kanälen</interface>, <interface>Servermeldungen</interface> und <interface>Queries</interface> möglich. Die Protokollierung muss unter <menuchoice><guisubmenu>Einstellungen</guisubmenu> <guisubmenu>&konversation; einrichten</guisubmenu> <guisubmenu>Verhalten</guisubmenu> <guisubmenu>Protokollierung</guisubmenu></menuchoice> in der Menüleiste aktiviert sein.

source: The Help Menu
de: Das Menü Hilfe

source: Questions and Answers
de: Fragen und Antworten

source: When I start &konversation;, I'd like to connect to a server without joining any channels. How do I do that?
de: Wenn ich &konversation; starte, möchte ich eine Verbindung zu einem Server herstellen, ohne einen Kanal zu betreten. Wie geht das?

source: In the <link linkend="serverlist-addnetwork">Edit Server</link> screen, leave the <guilabel>Channels</guilabel> frame empty.
de: Lassen Sie im Dialog <link linkend="serverlist-addnetwork">Netzwerk bearbeiten</link> das Feld <guilabel>Kanäle automatisch betreten</guilabel> leer.

source: &konversation; won't connect to any servers. What is wrong?
de: &konversation; stellt keine Verbindung zu einem Server her. Woran liegt das?

source: There are several things that could be wrong.
de: Es gibt viele mögliche Ursachen für dieses Problem.

source: Make sure that you have entered the correct <guilabel>Server name</guilabel> and the correct <guilabel>Port</guilabel> in the <link linkend="serverlist-addserver">Add Server</link> screen.
de: Stellen Sie sicher, dass Sie im Dialog <link linkend="serverlist-addserver">Server hinzufügen</link> den korrekten <guilabel>Server</guilabel> und <guilabel>Port</guilabel> angegeben haben.

source: Check the output in the <link linkend="channel-screen-tour">Server Messages</link> screen for any error messages. Did the server reject the connection because of a bad password? Did the server reject the connection because it requires <acronym>IDENTD</acronym> and your computer did not respond to the <acronym>IDENT</acronym> request? Did you check the SSL protocol box but the server does not support SSL?
de: Überprüfen Sie die <link linkend="channel-screen-tour">Server-Meldungen</link> auf Fehlermeldungen. Es ist möglich, dass der Server die Verbindung aufgrund eines falschen Passworts verweigert hat, oder weil er <acronym>IDENTD</acronym> benötigt und Ihr Rechner nicht auf die <acronym>IDENT</acronym>-Anforderung geantwortet hat. Haben Sie die SSL-Verschlüsselung aktiviert, obwohl der Server das SSL-Protokoll nicht unterstützt?

source: If you are behind a firewall, make sure the correct ports are enabled. &konversation; needs the following ports enabled:
de: Falls Sie eine Firewall verwenden, stellen Sie sicher, dass folgende von &konversation; benötigte Ports aktiviert sind:

source: Outgoing TCP 6667 (or the port of the server you connect to)
de: Ausgehend TCP 6667 (Oder der Port des Servers mit dem Sie verbinden)

source: Incoming TCP 113 (if the server requires IDENTD)
de: Eingehend TCP 113 (Falls der Server IDENTD benötigt)

source: For more information on &irc; connection problems, see <ulink url="http://www.irchelp.org/irchelp/networks/connectprob.html">irchelp.org</ulink>.
de: Mehr Informationen zu Problemen mit &irc; finden Sie auf <ulink url="http://www.irchelp.org/irchelp/networks/connectprob.html">irchelp.org</ulink>.

source: When I go to <menuchoice> <guimenu>Window</guimenu> <guisubmenu>Channel List</guisubmenu> </menuchoice>, I cannot select it. Why is that?
de: Ich kann den Eintrag <menuchoice><guisubmenu>Fenster</guisubmenu> <guisubmenu>Kanalliste</guisubmenu></menuchoice> in der Menüleiste nicht anklicken. Wieso?

source: The <menuchoice> <guimenu>Window</guimenu> <guisubmenu>Channel List</guisubmenu> </menuchoice> menu entry will be grayed-out if a non-channel tab, &eg; <guilabel>Watched Nicks Online</guilabel>, is currently being viewed. To make it selectable again go back to a channel tab or the server tab.
de: Der Eintrag <menuchoice><guisubmenu>Fenster</guisubmenu> <guisubmenu>Kanalliste></guisubmenu> </menuchoice> wird ausgegraut, wenn das aktuelle Unterfenster kein Kanal ist, &eg; <guilabel>Beobachtete Benutzer online</guilabel>. Um den Eintrag verwenden zu können, öffnen Sie einen Kanal oder ein Unterfenster mit Servermeldungen.

source: How do I have &konversation; automatically mark me as away after a period of inactivity?
de: Wie kann ich festlegen, dass ich automatisch als abwesend markiert werde, wenn ich eine bestimmte Zeit lang inaktiv bin?

source: Auto-away messages are configured on a per-identity basis. To enable auto-away select <menuchoice><guimenu>Settings</guimenu><guimenuitem>Identities</guimenuitem></menuchoice>. Choose the identity for which you want to enable auto-away from the drop down list at the top of the dialog and go to the <guilabel>Away</guilabel> tab. Check the <guilabel>Automatic Away</guilabel> option.
de: Die automatische Abwesenheit wird für jede Identität getrennt konfiguriert. Um sie zu aktivieren, klicken Sie auf den Eintrag <menuchoice><guimenu>Einstellungen</guimenu> <guimenuitem>Identitäten</guimenuitem></menuchoice> in der Menüleiste. Wählen Sie die gewünschte Identität im entsprechenden Auswahlfeld aus und öffnen Sie das Unterfenster <guilabel>Abwesend</guilabel>. Aktivieren Sie hier das Ankreuzfeld <guilabel>Automatische Abwesenheit</guilabel>.

source: How to avoid the <guilabel>Auto Replace</guilabel> feature of the <interface>Input Line</interface>?
de: Wie kann ich die <guilabel>Automatische Ersetzung</guilabel> der <interface>Eingabezeile</interface> deaktivieren?

source: Use <keycombo action="simul">&Ctrl;&Enter;</keycombo> instead of just &Enter; to avoid parsing and automatically replacing the text in the <interface>Input Line</interface> according to the options in the settings dialog page <menuchoice><guimenu>Behavior</guimenu> <guimenuitem>Auto Replace</guimenuitem></menuchoice>.
de: Verwenden Sie die Tastenkombination <keycombo action="simul">&Ctrl;&Enter;</keycombo> anstelle der &Enter;-Taste, um die automatische Ersetzung gemäß den Einstellungen im Abschnitt <menuchoice><guimenu>Verhalten</guimenu> <guimenuitem>Automatische Ersetzung</guimenuitem></menuchoice> im Einrichtungsdialog zu verhindern.

source: Credits and License
de: Danksagungen und Lizenz

source: Program copyright 2002-2005 by the &konversation; team.
de: Programm Copyright 2002-2005 &konversation;-Team.

source: Contributors:
de: Beiträge von:

source: Thanks to:
de: Vielen Dank für die Mithilfe:

source: Documentation Copyright &copy; 2003-2005 Gary R. Cramblitt <email>garycramblitt@comcast.net</email>
de: Dokumentation Copyright &copy; 2003-2005 Gary R. Cramblitt <email>garycramblitt@comcast.net</email>

source: CREDIT_FOR_TRANSLATORS
de: <para>Übersetzung Felix Schweighofer <email>felix.schweighofer@googlemail.com</email></para>

source: How to obtain &konversation;
de: Bezugsquellen von &konversation;

source: The latest versions of &konversation;, including source code and build instructions can be obtained from the <ulink url="&konviwebsite;">&konviwebsite; website</ulink>.
de: Die neuesten Versionen von &konversation; inklusive Quellcode und Kompilierungsanweisungen können Sie von <ulink url="&konviwebsite;">&konviwebsite;</ulink> herunterladen.

source: Requirements
de: Voraussetzungen

source: In order to successfully use &konversation;, you need &kde; 4 and a network connection. If you will be running &konversation; from behind a firewall, see <link linkend="faq">Questions and Answers</link>. If you wish to use SSL protocol, you may need OpenSSL.
de: Um &konversation; verwenden zu können, benötigen Sie &kde; 4 und eine Netzwerkverbindung. Falls Sie eine Firewall verwenden, beachten Sie die Informationen im Abschnitt <link linkend="faq">Fragen und Antworten</link>. Falls Sie das SSL-Protokoll verwenden möchten, benötigen Sie OpenSSL.
