Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/extragear-network/konversation.po
Languages: de

source: A private conversation is one that only you and one other person can see. Private conversations are called "queries" in &konversation;. To initiate a private conversation, type <userinput><command>/query </command><replaceable>nick</replaceable></userinput> in any input line, where <replaceable>nick</replaceable> is the &i18n-nickname; of the person you want to talk with. You can also click with the &RMB; on the person's &i18n-nickname; in the <interface>Nick Panel</interface> and choose <menuchoice> <guisubmenu>Open Query</guisubmenu> </menuchoice>. <action>A new tab will be created.</action> Announce yourself by sending a message.
de: Private Unterhaltungen sind nur für Sie und einen weiteren Benutzer sichtbar. Im &irc; werden sie „Query“ genannt. Um einen Query zu öffnen, geben Sie den Befehl <userinput><command>/query</command> <replaceable>Spitzname</replaceable></userinput> in die <interface>Eingabezeile</interface> ein und bestätigen Sie mit der &Enter;taste. <replaceable>Spitzname</replaceable> ist der &i18n-Nickname; des Benutzers, mit dem Sie sich unterhalten möchten. Sie können auch mit der &RMBn; auf den &i18n-Nickname;n des Benutzers in der <interface>Benutzerliste</interface> klicken und mit der &LMBn; auf den Eintrag <menuchoice><guisubmenu>Query öffnen</guisubmenu></menuchoice> im Kontextmenü klicken. <action>Daraufhin wird ein neues Unterfenster geöffnet</action>. Nun können Sie private Nachrichten senden.

source: Queries are just like channels, except that only you and the other person can participate in the channel.
de: Queries verhalten sich wie Kanäle. Der einzige Unterschied ist, dass nur Sie und jeweils ein weiterer Benutzer den Query benutzen können.

source: To leave the query, just close the tab. Note however, that if the other person sends you another message in the query, the tab will open again.
de: Zum Verlassen eines Queries schließen Sie das entsprechende Unterfenster. Falls Ihnen der andere Benutzer des Queries danach eine weitere Nachricht sendet, wird das Unterfenster allerdings wieder geöffnet.

source: To leave all queries, choose <menuchoice> <guisubmenu>Window</guisubmenu> <guisubmenu>Close All Open Queries</guisubmenu> </menuchoice> on the main menu, or press <keycap>F11</keycap> key.
de: Um alle Queries zu verlassen, klicken Sie auf den Eintrag <menuchoice><guisubmenu>Fenster</guisubmenu> <guisubmenu>Alle offenen Queries schließen</guisubmenu></menuchoice> in der Menüleiste oder drücken Sie <keycap>F11</keycap>.

source: When someone else initiates a query with you, &konversation; creates a new tab with their &i18n-nickname;. If you don't wish to talk with the person, close the tab.
de: Wenn ein anderer Benutzer einen Query mit Ihnen beginnt, wird ein neues Unterfenster geöffnet, das mit dem &i18n-Nickname;n des jeweiligen Benutzers beschriftet ist. Wenn Sie keine private Unterhaltung mit diesem Benutzer führen möchten, schließen Sie das Unterfenster.

source: Setting notifications
de: Einrichtung von Benachrichtigungen

source: <guilabel>Notifications</guilabel> are actions that &konversation; will perform whenever an event occurs. Suppose you have &konversation; running, but minimized or hidden behind other application windows on your desktop. If someone wants to communicate with you, or your buddy joins a channel, you'd like to be alerted. Notifications will accomplish this.
de: <guilabel>Benachrichtigungen</guilabel> sind Aktionen, die von &konversation; ausgeführt werden, wenn bestimmte Ereignisse auftreten. Dies kann beispielsweise dann nützlich sein, wenn Sie &konversation; geöffnet haben, aber das Fenster minimiert oder hinter anderen Fenstern unsichtbar ist. Falls Sie in solchen Fällen darauf hingewiesen werden möchten, dass z. B. jemand sich mit Ihnen unterhalten möchte oder ein Freund von Ihnen den Kanal betritt, können Sie dafür Benachrichtigungen einrichten.

source: To configure notifications, choose <menuchoice> <guisubmenu>Settings</guisubmenu> <guisubmenu>Configure Notifications</guisubmenu> </menuchoice> on the main menu. <action>The <guilabel>Notification Settings</guilabel> screen will appear.</action>
de: Zur Einrichtung von Benachrichtigungen klicken Sie auf den Eintrag <menuchoice><guisubmenu>Einstellungen</guisubmenu> <guisubmenu>Benachrichtigungen festlegen ...</guisubmenu></menuchoice> in der Menüleiste. <action>Der Dialog <guilabel>Benachrichtigungen festlegen</guilabel> wird geöffnet.</action>

source: The Notification Settings screen.
de: Der Dialog „Benachrichtigungen festlegen“

source: The Notification Settings screen
de: Der Dialog „Benachrichtigungen festlegen“

source: Click here to select an event.
de: Klicken Sie hier, um ein Ereignis auszuwählen.

source: Check the types of notifications you'd like to happen when the event occurs. (<guilabel>Mark taskbar entry</guilabel> causes the entry in the taskbar to flash when the event occurs.)
de: Wählen Sie hier die Arten der Benachrichtigung aus, die ausgeführt werden sollen, wenn das Ereignis auftritt. <guilabel>Eintrag in Fensterleiste hervorheben</guilabel> bewirkt, dass der Eintrag für &konversation; in der Fensterleiste blinkt, wenn das Ereignis auftritt.

source: Repeat by selecting another event and checking the notifications desired. When you've configured all the desired notifications, click the <guibutton>OK</guibutton> button.
de: Wiederholen Sie diese Schritte für alle Ereignisse, bei deren Auftreten Sie benachrichtigt werden möchten. Drücken Sie danach den Knopf <guibutton>OK</guibutton>.

source: Once you've set up your notifications, you can enable or disable all notifications using <menuchoice> <guisubmenu>Window</guisubmenu> <guisubmenu>Enable Notifications</guisubmenu> </menuchoice> on the main menu.
de: Sie können alle Benachrichtigungen aktivieren oder deaktivieren, indem Sie das Ankreuzfeld <menuchoice><guisubmenu>Fenster</guisubmenu> <guisubmenu>Benachrichtigungen aktivieren</guisubmenu></menuchoice> umschalten.

source: You can also alert yourself when someone mentions your &i18n-nickname; in a message using &konversation;'s <link linkend="highlighting">highlighting feature</link>.
de: Um benachrichtigt zu werden, wenn Ihr &i18n-Nickname; in einer Nachricht erwähnt wird, benutzen Sie die <link linkend="highlighting">Hervorhebungs-Funktion</link> von &konversation;.

source: Monitoring who is online
de: Beobachtung von Benutzern

source: &konversation; will keep you informed when your buddies are connected to the &irc; network or not.
de: Diese Funktion von &konversation; liefert Ihnen Informationen darüber, ob bestimmte andere Benutzer (z. B. Ihre Freunde) mit dem &irc;-Netzwerk verbunden sind.

source: You can associate online &i18n-nickname;s with contact entries in your address book. When you do this, the &i18n-nickname; and &irc; network where the &i18n-nickname; is online are entered into the contact in the address book. The &irc; network is recorded because &i18n-nickname;s are unique across a single &irc; network. The &i18n-nickname; in two different &irc; networks is not necessarily the same person, but the same &i18n-nickname; on two different servers within the same &irc; network generally is the same person.
de: Sie können &i18n-Nickname;n mit Kontakten in Ihrem Adressbuch verknüpfen. Dabei werden jeweils der &i18n-Nickname; und das &irc;-Netzwerk, in dem er benutzt wird, in das Adressbuch eingetragen. Das &irc;-Netzwerk wird gespeichert, weil &i18n-Nickname;n innerhalb eines Netzwerks nur jeweils ein Mal vorkommen. Derselbe &i18n-Nickname; muss in verschiedenen Netzwerken nicht unbedingt von derselben Person verwendet werden, aber derselbe &i18n-Nickname; auf verschiedenen Servern innerhalb eines &irc;-Netzwerks wird im Allgemeinen von nur einer Person verwendet.

source: This is why it is important to use the same <guilabel>Network</guilabel> for all servers in the same &irc; network, when <link linkend="serverlist"> defining networks, servers, and auto join channels</link>.
de: Aus diesem Grund ist es wichtig, dass Sie bei der <link linkend="serverlist">Konfiguration von neuen Netzwerken, Servern und Kanälen zum automatischen Betreten</link> alle Server, die zu einem &irc;-Netzwerk gehören, unter demselben <guilabel>Netzwerk</guilabel> eintragen.

source: You can also define &i18n-nickname;s you want watched that are not in your address book. In this case also, each &i18n-nickname; has an associated &irc; network. See below.
de: Sie können auch &i18n-Nickname;n zur Beobachtungsliste hinzufügen, die nicht in Ihrem Adressbuch eingetragen sind. Auch in diesem Fall wird jedem &i18n-Nickname;n das entsprechende &irc;-Netzwerk zugeordnet.

source: To activate the &i18n-nickname; watching feature, choose <menuchoice> <guisubmenu>Window</guisubmenu> <guisubmenu>Watched Nicks Online</guisubmenu> </menuchoice> on the main menu. <action>The <guilabel>Watched Nicks Online</guilabel> screen will appear.</action>
de: Um die Beobachtung von &i18n-Nickname;n zu aktivieren, klicken Sie auf den Eintrag <menuchoice><guisubmenu>Fenster</guisubmenu> <guisubmenu>Beobachtete Benutzer online</guisubmenu></menuchoice> in der Menüleiste. <action>Das Unterfenster <guilabel>Beobachtete Benutzer online</guilabel> wird geöffnet.</action>

source: Watched Nicks Online.
de: Beobachtete Benutzer online

source: Watched Nicks Online
de: Beobachtete Benutzer online

source: The &i18n-nickname;s in your watch list and also the &i18n-nickname;s associated with entries in your address book are listed here. They are listed under their associated &irc; network. If no &i18n-nickname;s are listed, either you haven't specified any &i18n-nickname;s to watch, or you need to activate the &i18n-nickname; watching feature (see below). Expand each online &i18n-nickname; to see a list of channels the &i18n-nickname; has joined. The icons next to each channel are the same as the icons that appear in the <interface>Nick Panel</interface> in the <link linkend="channel-screen-tour">channel</link> screens.
de: Hier werden die &i18n-Nickname;n aus Ihrer Beobachtungsliste sowie die mit Einträgen in Ihrem Adressbuch verknüpften &i18n-Nickname;n angezeigt, gruppiert unter dem jeweiligen Netzwerk. Falls keine &i18n-Nickname;n angezeigt werden, haben Sie entweder keine &i18n-Nickname;n zur Beobachtungsliste hinzugefügt, oder die Beobachtungs-Funktion ist noch nicht aktiviert. Klappen Sie Einträge auf, um zu sehen, in welchen Kanälen sich die &i18n-Nickname;n befinden. Neben den Kanälen werden die Symbole angezeigt, die auch in der <interface>Benutzerliste</interface> in <link linkend="channel-screen-tour">Kanal-Unterfenstern</link> verwendet werden.

source: The information known about the &i18n-nickname; is displayed here. When the <guilabel>Watched Nicks Online</guilabel> screen is first displayed, this information is sparse. Every 20 seconds, one <userinput><command>WHOIS</command></userinput> command is automatically sent to the server to request information for &i18n-nickname;s that do not have any information. This continues until all &i18n-nickname;s have information.
de: Hier werden die Informationen angezeigt, die über den jeweiligen &i18n-Nickname;n bekannt sind. Nach dem Öffnen des Unterfensters <guilabel>Beobachtete Benutzer online</guilabel> sind nur wenige Informationen vorhanden. Alle 20 Sekunden wird eine <userinput><command>WHOIS</command></userinput>-Abfrage gesendet, um Informationen über die &i18n-Nickname;n anzufordern, über die bisher keine Informationen vorliegen. Dies wird solange wiederholt, bis Informationen über alle angezeigten &i18n-Nickname;n vorhanden sind.

source: Use these buttons to associate a &i18n-nickname; with a contact in your address book, remove an association, or open the address book to edit the contact information. See the <ulink url="help:kaddressbook">&kaddressbook; Handbook</ulink> for additional instructions on using the &kde; address book.
de: Diese Knöpfe dienen zur Verknüpfung von &i18n-Nickname;n mit Kontakten aus Ihrem Adressbuch, zur Aufhebung von Verknüpfungen und zum Öffnen des Adressbuchs zur Bearbeitung des jeweiligen Kontakts. Weitere Informationen zur Verwendung von &kaddressbook; finden Sie im <ulink url="help:kaddressbook">Handbuch zu &kaddressbook;</ulink>.

source: To add a single &i18n-nickname; to watch, open the context menu in the <guilabel>Nick List</guilabel> by clicking with the &RMB; on a &i18n-nickname; and select <guilabel>Add to Watched Nicks</guilabel>. If you want to add several &i18n-nickname;s choose <menuchoice> <guisubmenu>Settings</guisubmenu> <guisubmenu>Configure Konversation</guisubmenu> </menuchoice> from the main menu, expand <guilabel>Notifications</guilabel> and click on <guilabel>Watched Nicknames</guilabel>. The <guilabel>Watched Nicknames</guilabel> screen appears.
de: Um einen einzelnen &i18n-Nickname;n zur Beobachtungsliste hinzuzufügen, klicken Sie mit der &RMBn; auf den jeweiligen &i18n-Nickname;n in der <guilabel>Benutzerliste</guilabel> und klicken Sie auf den Eintrag <guilabel>Zu beobachteten Benutzern hinzufügen</guilabel> im Kontextmenü. Um mehrere &i18n-Nickname;n hinzufügen, klicken Sie auf den Eintrag <menuchoice><guisubmenu>Einstellungen</guisubmenu> <guisubmenu> &konversation; einrichten ...</guisubmenu></menuchoice> in der Menüleiste, klappen Sie den Bereich <guilabel>Benachrichtigungen</guilabel> auf und klicken Sie auf <guilabel>Beobachtete Spitznamen</guilabel>. <action>Der Einrichtungsdialog für <guilabel>Beobachtete Spitznamen</guilabel> wird geöffnet.</action>

source: <screeninfo>Watched Nicknames</screeninfo>
de: <screeninfo>Beobachtete Spitznamen</screeninfo>

source: <phrase>Watched Nicknames</phrase>
de: <phrase>Beobachtete Spitznamen</phrase>

source: Check this box to activate the &i18n-nickname; watcher feature.
de: Kreuzen Sie dieses Feld an, um das Beobachten von &i18n-Nickname;n zu aktivieren.

source: If you want the <guilabel>Watched Nicks Online</guilabel> screen to automatically display when you open &konversation;, check this box.
de: Aktivieren Sie dieses Ankreuzfeld, wenn das Unterfenster <guilabel>Beobachtete Benutzer online</guilabel> beim Start von &konversation; automatisch angezeigt werden soll.

source: The &i18n-nickname;s of the users you want to monitor are listed here. Each &i18n-nickname; has an associated &irc; network.
de: Hier werden die &i18n-Nickname;n der beobachteten Benutzer angezeigt. Jedem &i18n-Nickname;n ist das jeweilige &irc;-Netzwerk zugeordnet.

source: Click these buttons to <guibutton>Add</guibutton> or <guibutton>Remove</guibutton> &i18n-nickname;s from the list.
de: Benutzen Sie diese Knöpfe zum <guibutton>Hinzufügen</guibutton> oder <guibutton>Entfernen</guibutton> eines &i18n-Nickname;ns von der Liste.

source: The <guilabel>Watched Nicks Online</guilabel> feature works by periodically polling the server. This box sets how often that occurs. Avoid numbers less than 20 seconds because it places excessive load on the server.
de: Die Funktion <guilabel>Beobachtete Benutzer online</guilabel> basiert auf regelmäßigem Abrufen von Informationen vom Server. Dieses Auswahlfeld legt das Aktualisierungsintervall fest. Vermeiden Sie Werte unter 20 Sekunden, da dadurch unnötig große Server-Lasten verursacht werden.

source: In the <guilabel>Watched Nicks Online</guilabel> screen above, you may double click on any &i18n-nickname; and this command will be sent to the server. <userinput><command>%u</command></userinput> will be replaced with the &i18n-nickname;. The <userinput><command>%n</command></userinput> is required at the end of the command.
de: Dieser &irc;-Befehl wird ausgeführt, wenn Sie im Unterfenster <guilabel>Beobachtete Benutzer online</guilabel> auf einen &i18n-Nickname;n doppelklicken. <userinput><command>%u</command></userinput> wird dabei durch den jeweiligen &i18n-Nickname;n ersetzt. Der Befehl muss mit <userinput><command>%n</command></userinput> abgeschlossen werden.

source: Click the <guibutton>OK</guibutton> button when you have finished adding or removing &i18n-nickname;s.
de: Bestätigen Sie Ihre Änderungen, indem Sie auf <guibutton>OK</guibutton> oder <guibutton>Anwenden</guibutton> klicken, wenn Sie die gewünschten Einstellungen vorgenommen haben.

source: <emphasis>Note: </emphasis>Whenever you display the <guilabel>Watched Nicks Online</guilabel> screen, it may take a while before any &i18n-nickname;s are displayed until &konversation; has polled the server. Normally, you leave the <guilabel>Watched Nicks Online</guilabel> screen running.
de: <emphasis>Hinweis:</emphasis> Nach dem Öffnen des Unterfensters <guilabel>Beobachtete Benutzer online</guilabel> kann es eine Zeit lang dauern, bis &konversation; die nötigen Abfragen durchgeführt hat und die &i18n-Nickname;n angezeigt werden. Das Unterfenster wird daher normalerweise nicht geschlossen, sondern im Hintergrund weiterlaufen gelassen.

source: &konversation; also displays a message in all the <link linkend="channel-screen-tour">channels</link> whenever a user in your <guilabel>Watched Nicknames</guilabel> list connects or disconnects from the server. The message looks like this:
de: &konversation; zeigt in allen <link linkend="channel-screen-tour">Kanälen</link> eine nur für Sie sichtbare Meldung an, wenn ein Benutzer aus Ihrer <guilabel>Beobachtungsliste</guilabel> eine Verbindung zum &irc;-Netzwerk herstellt oder trennt. Die Meldung sieht folgendermaßen aus:

source: [17:52] [Notify] psn is online (irc.kde.org).
de: [17:52] [Notify] psn ist online (irc.kde.org).

source: Message highlighting
de: Hervorhebung von Nachrichten

source: You can control how messages are displayed in channel and query screens.
de: Sie können die Darstellung der Nachrichten in Kanal- und Query-Unterfenstern ändern.

source: To activate the highlighting feature, choose <menuchoice> <guisubmenu>Settings</guisubmenu> <guisubmenu>Configure &konversation;</guisubmenu> </menuchoice> on the main menu. <action>The <guilabel>Configure</guilabel> screen will appear.</action>
de: Zum Aktivieren der Hervorhebung von Nachrichten klicken Sie auf den Eintrag <menuchoice><guisubmenu>Einstellungen</guisubmenu> <guisubmenu>&konversation; einrichten ...</guisubmenu></menuchoice> in der Menüleiste. <action>Der <guilabel>Einrichtungsdialog</guilabel> wird geöffnet.</action>

source: The Highlighting screen.
de: Der Abschnitt „Hervorhebung“ im Einrichtungsdialog

source: The Highlighting screen
de: Der Abschnitt „Hervorhebung“ im Einrichtungsdialog

source: Click here to select the <guilabel>Highlight</guilabel> screen.
de: Klicken Sie hier, um den Abschnitt <guilabel>Hervorhebung</guilabel> zu öffnen.

source: Click here to add a new item to the <guilabel>Highlight list</guilabel>. When an item in the list is selected, you may edit it in the panel below.
de: Klicken Sie hier, um eine Hervorhebungsregel hinzuzufügen oder zu löschen. Wenn Sie einen Eintrag in der Liste auswählen, können Sie diesen unten bearbeiten.

source: Enter a string pattern here. Any message received that matches this pattern, anywhere in the message, will activate the highlighting for the message.
de: Geben Sie hier ein Muster ein. Jede Nachricht, die dieses Muster enthält, wird hervorgehoben.

source: If the pattern is found in a message, the entire message will be displayed in the color you select here.
de: Wenn eine Nachricht das Muster enthält, wird die gesamte Nachricht in der hier ausgewählten Farbe dargestellt.

source: If you wish, &konversation; will play a sound when the pattern is matched. Click the button to choose an audio file to be played. Click the test button to hear the sound.
de: &konversation; kann zusätzlich einen Klang abspielen, wenn eine Nachricht das Muster enthält. Wählen Sie hier die Audio-Datei aus, die abgespielt werden soll. Drücken Sie den Test-Knopf, um den Klang testweise abzuspielen.

source: If you'd like for &konversation; to automatically send a reply message when the pattern is matched, enter the message here. Use this feature with caution, as you may annoy &irc; users with too much chatter if not careful. You can also enter &irc; or &konversation; commands here.
de: Wenn Sie möchten, dass &konversation; automatisch eine Antwort sendet, wenn eine Nachricht das Muster enthält, geben Sie diese hier ein. Sie können auch &irc;- oder &konversation;-Befehle eingeben. Bedenken Sie, dass automatisch gesendete Antworten von anderen Benutzern oft als störend empfunden werden.

source: If you have configured sounds for any of your highlights, you can disable all of them by unchecking this box.
de: Falls Sie für irgendeine Hervorhebungsregel Klänge eingerichtet haben, können Sie alle Klänge deaktivieren, indem Sie dieses Ankreuzfeld deaktivieren.

source: If you check this box, whenever someone mentions your &i18n-nickname; in a message, the message will be displayed in the color you choose at the right.
de: Wenn dieses Ankreuzfeld aktiviert ist, werden alle Nachrichten, die Ihren &i18n-Nickname;n enthalten, in der rechts ausgewählten Farbe dargestellt.

source: Normally, highlighting does not apply to messages you type. If you wish to highlight the messages you type, check this box and choose a color at the right.
de: Standardmäßig werden von Ihnen gesendete Nachrichten nicht hervorgehoben. Wenn Sie alle Nachrichten hervorheben möchten, die Sie selbst gesendet haben, aktivieren Sie dieses Ankreuzfeld und wählen Sie rechts eine Farbe zur Hervorhebung aus.

source: Configuring On Screen Display (&osd;)
de: Einrichtung der OnScreen-Anzeige (&osd;)

source: <acronym>On Screen Display</acronym> (&osd;) is a unique feature of &konversation;. With &osd; turned on, channel messages will appear on your desktop screen, even if &konversation; is minimized. Here's an example of &osd; in action. The message in the upper lefthand part of the screen is from &konversation;, which is running minimized in the system tray.
de: Die <acronym>OnScreen-Anzeige</acronym> (&osd;) von &konversation; dient dazu, Nachrichten auf dem Desktop anzuzeigen, auch wenn das Programm &konversation; minimiert ist. Das folgende Bildschirmfoto zeigt die OnScreen-Anzeige einer Nachricht.

source: <screeninfo>Example of On Screen Display</screeninfo>
de: <screeninfo>Beispiel für die OnScreen-Anzeige</screeninfo>

source: <phrase>Example of On Screen Display</phrase>
de: <phrase>Beispiel für die OnScreen-Anzeige</phrase>

source: To activate &osd;, choose <menuchoice> <guisubmenu>Settings</guisubmenu> <guisubmenu>Configure &konversation;</guisubmenu> </menuchoice> on the main menu. <action>The <guilabel>Configure</guilabel> screen will appear.</action>
de: Um die OnScreen-Anzeige zu aktivieren, klicken Sie auf den Eintrag <menuchoice><guisubmenu>Einstellungen</guisubmenu> <guisubmenu>&konversation; einrichten ...</guisubmenu></menuchoice> in der Menüleiste. <action>Der <guilabel>Einrichtungsdialog</guilabel> wird geöffnet.</action>

source: The On Screen Display screen.
de: Der Abschnitt „OnScreen-Anzeige“ im Einrichtungsdialog

source: The On Screen Display screen
de: Der Abschnitt „OnScreen-Anzeige“ im Einrichtungsdialog

source: Click here to expand the <guilabel>Notification</guilabel> item.
de: Klicken Sie hier, um den Bereich <guilabel>Benachrichtigungen</guilabel> aufzuklappen.

source: Click here to select the <guilabel>On Screen Display</guilabel> screen.
de: Klicken Sie hier, um den Abschnitt <guilabel>OnScreen-Anzeige</guilabel> zu öffnen.

source: Check this box to activate &osd;.
de: Kreuzen Sie dieses Feld an, um die OnScreen-Anzeige zu aktivieren.
