Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/extragear-network/konversation.po
Languages: de

source: You may join additional servers and channels. Each server and each channel gets a separate tab here. To display a list of available channels, see <link linkend="list-channels">Listing available channels</link>. To join a channel, type: <userinput><command>/join</command> <replaceable>#channelname</replaceable></userinput> in the Input Line. (The <userinput>#</userinput> is required.) To leave a channel, just type <userinput><command>/part</command></userinput>. Tabs also appear here if you open a <link linkend="list-channels">Channel List</link>, participate in a <link linkend="query">private conversation (query)</link>, open the <link linkend="urlcatcher">&URL; Catcher</link>, or open one or more <guilabel>Konsole</guilabel>s. To switch the display to a different screen, click the corresponding tab, or use the mouse wheel to cycle through the tabs.
de: Sie können mehrere Kanäle, auch auf mehreren Servern, betreten. Jeder Server und Kanal wird in einem eigenen Unterfenster angezeigt. Informationen zum Anzeigen einer Liste der verfügbaren Kanäle finden Sie im Abschnitt <link linkend="list-channels">Auflisten der verfügbaren Kanäle</link>. Um einen Kanal zu betreten, geben Sie den Befehl <userinput><command>/join</command> <replaceable>#Kanalname</replaceable></userinput> in der Eingabezeile ein (Das Zeichen <userinput>#</userinput> ist notwendig.).Um einen Kanal zu verlassen, geben Sie den Befehl <userinput><command>/part</command></userinput> ein. Auch für <link linkend="list-channels">Kanallisten</link>, <link linkend="query">private Unterhaltungen (Queries)</link>, den <link linkend="urlcatcher">&URL;-Fänger</link> und <guilabel>Konsolen</guilabel> werden Unterfenster geöffnet.Um einen anderes Unterfenster anzuzeigen, klicken Sie auf das entsprechende Unterfenster oder drehen Sie das Mausrad, um durch die Unterfenster zu schalten.

source: To set other options for tabs, choose <menuchoice> <guisubmenu>Settings</guisubmenu> <guisubmenu>Configure Konversation</guisubmenu> </menuchoice> from the main menu, expand <guilabel>Interface</guilabel>, click on <guilabel>Tabs</guilabel> or expand <guilabel>Notifications</guilabel> and click on <guilabel>Tabs</guilabel>.
de: Um weitere Einstellungen für Unterfenster vorzunehmen, klicken Sie auf den Eintrag <menuchoice><guisubmenu>Einstellungen</guisubmenu> <guisubmenu>&konversation; einrichten ...</guisubmenu></menuchoice> in der Menüleiste, klappen Sie den Bereich <guilabel>Oberfläche</guilabel> oder <guilabel>Benachrichtigungen</guilabel> auf und klicken Sie auf <guilabel>Unterfenster</guilabel>.

source: These &led;s will blink when there is something you haven't seen in that tab. The &led; will blink slower when the only unseen messages are <command>join</command>, <command>part</command>, <command>quit</command>, or &i18n-nickname; changes. They blink faster if there are unseen regular messages. The colors are as follows:
de: Diese &led;s blinken, wenn in einem Unterfenster etwas angezeigt wird, was Sie noch nicht gesehen haben. Sie blinken langsamer, wenn die einzigen ungelesenen Nachrichten <command>join</command>, <command>part</command>, <command>quit</command> oder &i18n-Nickname;-Änderungen sind. Bei ungelesenen normalen Nachrichten blinken Sie schneller. Die Farben bedeuten folgendes:

source: <para>Channel</para>
de: <para>Kanal</para>

source: <interface>Server Messages</interface>, <link linkend="list-channels">Channel List</link>, or <link linkend="urlcatcher">&URL; catcher</link>.
de: <interface>Server-Meldungen</interface>, <link linkend="list-channels">Kanallisten</link> oder <link linkend="urlcatcher">&URL;-Fänger</link>.

source: <guilabel>Konsole</guilabel> or <link linkend="dcc">DCC Status</link>.
de: <guilabel>Konsole</guilabel> oder <link linkend="dcc">DCC-Status</link>

source: <link linkend="query">Private Message (Query)</link>.
de: <link linkend="query">Private Nachricht (Query)</link>

source: Click here to close the current tab. Closing a <interface>Channel</interface> tab will leave the channel. Closing a <interface>Server Messages</interface> tab will leave all channels you've joined, close all open queries at that server and disconnect from the server.
de: Klicken Sie hier, um das ausgewählte Unterfenster zu schließen. Beim Schließen eines <interface>Kanal</interface>-Unterfensters wird der Kanal verlassen. Beim Schließen eines Unterfensters mit <interface>Server-Meldungen</interface> werden alle Kanäle auf dem entsprechenden Server verlassen, alle geöffneten Queries auf dem Server beendet und die Verbindung zum Server getrennt.

source: Click this button to change your own &i18n-nickname;. It appears only when the current tab is a channel. To hide this button, choose <menuchoice> <guisubmenu>Settings</guisubmenu> <guisubmenu>Configure Konversation</guisubmenu> </menuchoice> from the main menu, expand <guilabel>Interface</guilabel>, click on <guilabel>Chat Window</guilabel>, and uncheck <guilabel>Show box to change own nickname</guilabel> box.
de: Benutzen Sie dieses Auswahlfeld, um Ihren &i18n-Nickname;n zu ändern. Es wird nur angezeigt, wenn das ausgewählte Unterfenster ein Kanal ist. Um das Feld auszublenden, klicken Sie auf den Eintrag <menuchoice><guisubmenu>Einstellungen</guisubmenu> <guisubmenu>&konversation; einrichten ...</guisubmenu></menuchoice> in der Menüleiste, klappen Sie den Abschnitt <guilabel>Oberfläche</guilabel> auf, klicken Sie auf <guilabel>Chatfenster</guilabel> und deaktivieren Sie das Ankreuzfeld <guilabel>Feld zum Ändern des eigenen &i18n-Nickname;ns anzeigen</guilabel>.

source: The channel topic is displayed here. Hover the mouse over the topic to see long topics. You can change the topic by clicking the button to the left of the topic. To hide channel topics, choose <menuchoice> <guisubmenu>Settings</guisubmenu> <guisubmenu>Configure Konversation</guisubmenu> </menuchoice> from the main menu, expand <guilabel>Interface</guilabel>, click on <guilabel>Chat Window</guilabel>, and uncheck the <guilabel>Show channel topic</guilabel> box.
de: Hier wird das Kanalthema angezeigt. Fahren Sie mit der Maus über das Thema, um lange Themen vollständig zu sehen. Sie können das Thema ändern, indem Sie den Knopf links davon drücken. Um Kanalthemen auszublenden, klicken Sie auf den Eintrag <menuchoice><guisubmenu>Einstellungen</guisubmenu> <guisubmenu>&konversation; einrichten ...</guisubmenu></menuchoice> in der Menüleiste, klappen Sie den Abschnitt <guilabel>Oberfläche</guilabel> auf, klicken Sie auf <guilabel>Chatfenster</guilabel> und deaktivieren Sie das Ankreuzfeld <guilabel>Kanalthema anzeigen</guilabel>.

source: These buttons display the current state of channel modes. A button is down if that mode is on. If you have the correct privileges, you can also change channel modes by clicking on these buttons, or click the button to the left of the topic. To hide channel mode buttons, choose <menuchoice> <guisubmenu>Settings</guisubmenu> <guisubmenu>Configure Konversation</guisubmenu> </menuchoice> from the main menu, expand <guilabel>Interface</guilabel>, click on <guilabel>Chat Window</guilabel>, and uncheck the <guilabel>Show channel mode buttons</guilabel> box.
de: Diese Knöpfe zeigen die aktuellen Kanalmodi an. Ist ein Knopf gedrückt, ist der entsprechende Modus aktiviert. Falls Sie die nötigen Rechte besitzen, können Sie die Kanalmodi ändern, indem Sie diese Knöpfe oder den Knopf links neben dem Kanalthema drücken. Um die Knöpfe für Kanalmodi auszublenden, klicken Sie auf den Eintrag <menuchoice><guisubmenu>Einstellungen</guisubmenu> <guisubmenu>&konversation; einrichten ...</guisubmenu></menuchoice> in der Menüleiste, klappen Sie den Abschnitt <guilabel>Oberfläche</guilabel> auf, klicken Sie auf <guilabel>Chatfenster</guilabel> und deaktivieren Sie das Ankreuzfeld <guilabel>Schalter für Kanalmodi anzeigen</guilabel>.

source: This is called the <interface>Nick Panel</interface>. It is displayed whenever the current tab is a channel. It lists the &i18n-nickname;s of all the users who have joined the channel, including yourself. Hover the mouse pointer over a &i18n-nickname; to display additional information about the user. You may change how the icons are displayed next to each &i18n-nickname; by changing the &i18n-nickname; icon theme. See <link linkend="nickthemes">Configuring &i18n-nickname; themes</link> for more information. The <guilabel>Default Theme</guilabel>, as shown in the screen above, uses the following icons:
de: Dies ist die <interface>Benutzerliste</interface>. Sie wird angezeigt, wenn das ausgewählte Unterfenster ein Kanal ist und zeigt die &i18n-Nickname;n aller Benutzer des Kanals an (auch Ihren). Fahren Sie mit der Maus über einen &i18n-Nickname;n, um zusätzliche Informationen über den Benutzer zu erhalten. Sie können die Symbole, die neben den &i18n-Nickname;n angezeigt werden, ändern. Weitere Informationen dazu finden Sie im Abschnitt <link linkend="nickthemes">Design der Benutzerliste</link>. Standardmäßig werden folgende Symbole verwendet:

source: normal user
de: Normaler Benutzer

source: voiced user. User may talk in a moderated channel.
de: Benutzer mit Erlaubnis zu schreiben (Darf in einem moderierten Kanal Nachrichten senden.)

source: channel halfop
de: Benutzer mit HalfOp-Status

source: channel operator
de: Operator des Kanals

source: channel owner
de: Kanalbesitzer

source: channel admin
de: Kanal-Administrator

source: In addition, if a user is away, a small clock will be drawn in the corner of the icon.
de: Zusätzlich wird bei abwesenden Benutzern eine kleine Uhr in einer Ecke des Symbols angezeigt.

source: Click with the &RMB; on any &i18n-nickname; to display a context menu of operations you can perform with that &i18n-nickname;. For example, you can <link linkend="dcc">send a file</link> to the &i18n-nickname;. This is also the place where you can <link linkend="linkaddressbook">associate a &i18n-nickname; to a contact in your address book.</link>
de: Klicken Sie mit der &RMBn; auf einen &i18n-Nickname;n, um ein Kontextmenü mit Operationen zu öffnen, die Sie mit dem ausgewählten &i18n-nickname;n durchführen können. Sie können ihm beispielsweise eine <link linkend="dcc">Datei senden</link>, oder ihn einem <link linkend="linkaddressbook">Kontakt aus Ihrem Adressbuch zuordnen</link>.

source: To hide the <interface>Nick Panel</interface>, choose <menuchoice> <guisubmenu>Settings</guisubmenu> <guisubmenu>Show Nicklist</guisubmenu> </menuchoice> from the main menu.
de: Um die <interface>Benutzerliste</interface> auszublenden, klicken Sie auf den Eintrag <menuchoice><guisubmenu>Einstellungen</guisubmenu> <guisubmenu>Benutzerliste anzeigen</guisubmenu></menuchoice> in der Menüleiste.

source: These are called the <interface>Quick Buttons</interface>. By default, they are not shown. To display them, see <link linkend="quick-buttons">Configuring Quick Buttons</link>. You can customize their definitions to whatever commands you wish.
de: Dies sind die <interface>Schnellschalter</interface>. Standardmäßig sind sie ausgeblendet. Um sie anzuzeigen, lesen Sie bitte den Abschnitt <link linkend="quick-buttons">Einrichtung von Schnellschaltern</link>. Sie können die Knöpfe für beliebige Befehle einrichten.

source: You can control how messages are displayed in the message scroll of channel and query tabs. For example, you can change the color of messages, play a sound when a message containing a string is received, or automatically reply to messages. See <link linkend="highlighting"> Message highlighting</link> for more information.
de: Sie können die Darstellung der Nachrichten in den Textfeldern von Kanal- und Query-Unterfenstern anpassen. Beispielsweise können Sie die Farbe von Nachrichten ändern und Benachrichtigungen bei Nachrichten mit bestimmtem Inhalt oder automatische Antworten einrichten. Weitere Informationen dazu finden Sie im Abschnitt <link linkend="highlighting">Hervorhebung von Nachrichten</link>.

source: Channel names sometimes begin with <userinput>&amp;</userinput>, <userinput>&plus;</userinput>, or <userinput>!</userinput>. The first character of a channel name determines the type of channel (RFC 2811) as follows: <itemizedlist> <listitem><para> <userinput>#</userinput> - Regular channels. </para></listitem> <listitem><para> <userinput>!</userinput> - Regular channels. </para></listitem> <listitem><para> <userinput>&amp;</userinput> - Local. Channels that can only be joined from the server hosting the channel. All other channels can be joined from any server in the network. </para></listitem> <listitem><para> <userinput>&plus;</userinput> - Channels that do not support channel modes. This means that all the modes are unset, with the exception of the 't' channel flag which is set. </para></listitem> </itemizedlist> Channel names are up to 50 characters long and may contain any characters except for space, comma, and Ctrl-G (^G or ASCII 7).
de: Kanalnamen beginnen in einigen Fällen mit <userinput>&amp;</userinput>, <userinput>&plus;</userinput> oder <userinput>!</userinput>. Das erste Zeichen eines Kanalnamens legt nach dem Standard RFC 2811 die Art des Kanals folgendermaßen fest: <itemizedlist><listitem><para><userinput>#</userinput> – Normale Kanäle</para></listitem> <listitem><para><userinput>!</userinput> – Normale Kanäle</para></listitem> <listitem><para><userinput>&amp;</userinput> – Lokale Kanäle: Kanäle, die nur von dem Server aus betreten werden können, der sie verarbeitet. Alle anderen Kanäle können von einem beliebigen Server innerhalb des &irc;-Netzwerks aus betreten werden.</para></listitem> <listitem><para><userinput>&plus;</userinput> – Kanäle, die keine Kanalmodi unterstützen. Das bedeutet, dass alle Kanalmodi deaktiviert sind, mit Ausnahme des Modus ‚t‘, der aktiviert ist.</para></listitem> </itemizedlist> Kanalnamen sind bis zu 50 Zeichen lang und können beliebige Zeichen außer Leerzeichen, Komma und Strg+G (^G oder ASCII 7) beinhalten.

source: Quick Connect
de: Schnell verbinden

source: Sometimes you want to connect to a server without going through the trouble of creating a new server in the <link linkend="serverlist">Server List</link>.
de: Es kann vorkommen, dass Sie eine Verbindung zu einem Server herstellen möchten, ohne erst einen neuen Eintrag in der <link linkend="serverlist">Serverliste</link> anlegen zu müssen.

source: Choose <menuchoice> <guisubmenu>File</guisubmenu> <guisubmenu>Quick Connect</guisubmenu> </menuchoice> on the main menu. <action>The <guilabel>Quick Connect</guilabel> screen will appear.</action>
de: Klicken Sie dazu auf den Eintrag <menuchoice><guisubmenu>Datei</guisubmenu> <guisubmenu>Schnell verbinden ...</guisubmenu></menuchoice> in der Menüleiste. <action>Der Dialog <guilabel>Schnell verbinden</guilabel> wird geöffnet.</action>

source: The Quick Connect screen.
de: Der Dialog „Schnell verbinden“

source: The Quick Connect screen
de: Der Dialog „Schnell verbinden“

source: Enter the server address in the <guilabel>Server host</guilabel> box, your desired &i18n-nickname; in the <guilabel>Nick</guilabel> box, and click the <guibutton>Connect</guibutton> button. When &konversation; has connected to the server, enter command <userinput><command>/join</command> <replaceable>#channelname</replaceable></userinput> to join a channel.
de: Geben Sie in das Feld <guilabel>Servername</guilabel> die Adresse des Servers ein und Ihren &i18n-nickname;n in das Feld <guilabel>Spitzname</guilabel>. Drücken Sie danach den Knopf <guibutton>Verbinden</guibutton>. Sobald die Verbindung hergestellt ist, können Sie mit dem Befehl <userinput><command>/join</command> <replaceable>#Kanalname</replaceable></userinput> einen Kanal betreten.

source: Frequently-used &irc; commands
de: Häufig verwendete &irc;-Befehle

source: The following is a short list of frequently-used &irc; commands. See <ulink url="http://www.faqs.org/rfcs/rfc2812.html">RFC 2812</ulink> for a complete list of all commands, or visit <ulink url="http://www.irchelp.org/">irchelp.org</ulink>. For a list of commands treated specially by &konversation;, see <link linkend="konvi-cmds">&konversation; commands</link>.
de: Dies ist eine Liste mit häufig benutzten &irc;-Befehlen. Eine vollständige Liste finden Sie in der <ulink url="http://www.faqs.org/rfcs/rfc2812.html">Referenz zu RFC 2812</ulink> oder unter <ulink url="http://www.irchelp.org/">irchelp.org</ulink>. Eine Liste der von &konversation; besonders behandelten Befehle finden Sie im Abschnitt <link linkend="konvi-cmds">&konversation;-Befehle</link>.

source: Lists commands available on the current server. Not supported by all servers.
de: Listet die auf dem aktuellen Server verfügbaren Befehle auf. Dieser Befehl wird nicht von allen Servern unterstützt.

source: Provides help for <userinput><replaceable>cmd</replaceable></userinput>. Not supported by all servers.
de: Ruft die Hilfe zum Befehl <userinput><replaceable>cmd</replaceable></userinput> ab. Dieser Befehl wird nicht von allen Servern unterstützt.

source: /join <replaceable>#channel</replaceable>
de: <command>/join</command> <replaceable>#Kanal</replaceable>

source: Joins <userinput><replaceable>#channel</replaceable></userinput>. If the channel does not already exist, it is created and you are the channel operator.
de: Der Kanal <userinput><replaceable>#Kanal</replaceable></userinput> wird betreten. Falls der Kanal noch nicht existiert, wird er erstellt und Sie sind Operator des neuen Kanals.

source: Leaves the current channel and closes the <interface>channel</interface> tab.
de: Den aktuellen Kanal verlassen und das entsprechende <interface>Kanal</interface>-Unterfenster schließen.

source: <command>/part </command> <replaceable>#channel</replaceable>
de: <command>/part</command> <replaceable>#Kanal</replaceable>

source: Leaves <userinput><replaceable>#channel</replaceable></userinput> and closes the corresponding <interface>channel</interface> tab. Synonym for <userinput><command>/leave</command></userinput>
de: Den Kanal <userinput><replaceable>#Kanal</replaceable></userinput> verlassen und das entsprechende <interface>Kanal</interface>-Unterfenster schließen. Dieser Befehl ist ein Synonym für <userinput><command>/leave</command></userinput>.

source: <command>/me </command><replaceable>msg</replaceable>
de: <command>/me</command> <replaceable>Nachricht</replaceable>

source: Sends <userinput><replaceable>msg</replaceable></userinput> to the channel preceded by your &i18n-nickname;. For example, if your &i18n-nickname; were <userinput><replaceable>Tux</replaceable></userinput>, typing <userinput><replaceable>/me brews a cup a tea.</replaceable></userinput> displays the message <interface>Tux brews a cup of tea.</interface> Unless they've filtered against these types of messages, all users see it. This kind of message is typically used to convey non-verbal information, such as your current emotional state, or what you are physically doing. If you are leaving your workstation for a short time, use the <userinput><command>/away</command></userinput> command instead.
de: Ihren &i18n-Nickname;n gefolgt von der <userinput><replaceable>Nachricht</replaceable></userinput> an den Kanal senden. Wenn beispielsweise Ihr &i18n-Nickname; <userinput><replaceable>Tux</replaceable></userinput> ist und Sie <userinput><replaceable>/me kocht eine Tasse Tee</replaceable></userinput> eingeben, dann wird die Nachricht <replaceable>Tux kocht eine Tasse Tee</replaceable> gesendet. Alle Benutzer des Kanals erhalten diese Nachricht, sofern sie keine Filter gegen derartige Nachrichten eingerichtet haben. Solche Nachrichten werden üblicherweise verwendet, um non-verbale Informationen zu übermitteln, wie z. B. Gefühle oder Tätigkeiten (was Sie gerade tun). Um anderen Benutzern mitzuteilen, dass Sie vorübergehend abwesend sind, sollten Sie stattdessen den Befehl <userinput><command>/away</command></userinput> verwenden.

source: <command>/away </command> <replaceable>msg</replaceable>
de: <command>/away</command> <replaceable>Nachricht</replaceable>

source: If anyone tries to send you a private message or invite you to a channel, they will be told that you are away from your workstation with <userinput><replaceable>msg</replaceable></userinput>.
de: Bewirkt, dass jeder, der Ihnen eine private Nachricht oder Einladung in einen Kanal sendet, durch die <userinput><replaceable>Abwesenheitsnachricht</replaceable></userinput> auf Ihre Abwesenheit hingewiesen wird.

source: Cancels an <userinput><command>/away </command> <replaceable>msg</replaceable></userinput> command.
de: Hebt den vorherigen Befehl <userinput><command>/away</command> <replaceable>Abwesenheitsnachricht</replaceable></userinput> auf.

source: <command>/query </command><replaceable>nick</replaceable>
de: <command>/query</command> <replaceable>Spitzname</replaceable>

source: Creates a new tab with the user's <userinput><replaceable>nick</replaceable></userinput> for private conversation, commonly known on &irc; as a <link linkend="query">Query</link>. Everything written here is only visible to you and your query partner.
de: Öffnet ein neues Unterfenster für eine private Unterhaltung (allgemein als <link linkend="query">Query</link> bekannt) mit dem Benutzer <userinput><replaceable>Spitzname</replaceable></userinput>. Alle darin gesendeten Nachrichten sind nur für Sie und Ihren Query-Partner sichtbar.

source: <command>/msg </command><replaceable>nick</replaceable> <replaceable>msg</replaceable>
de: <command>/msg</command> <replaceable>Spitzname</replaceable> <replaceable>Nachricht</replaceable>

source: Sends <userinput><replaceable>msg</replaceable></userinput> to the user with &i18n-nickname; <userinput><replaceable>nick</replaceable></userinput>. Only <userinput><replaceable>nick</replaceable></userinput> sees the message. Use <userinput><command>/query</command></userinput> for longer conversations.
de: Sendet eine <userinput><replaceable>Nachricht</replaceable></userinput> an den Benutzer <userinput><replaceable>Spitzname</replaceable></userinput>. Nur dieser Benutzer erhält die Nachricht. Verwenden Sie für längere Unterhaltungen den Befehl <userinput><command>/query</command></userinput>.

source: <command>/invite </command><replaceable>nick</replaceable>
de: <command>/invite</command> <replaceable>Spitzname</replaceable>

source: Invites the user with &i18n-nickname; <userinput><replaceable>nick</replaceable></userinput> to join a channel. This command is especially useful if the channel is invite-only.
de: Lädt den Benutzer <userinput><replaceable>Spitzname</replaceable></userinput> ein, einen Kanal zu betreten. Dieser Befehl ist insbesondere dann nützlich, wenn ein Kanal nur nach einer Einladung betreten werden kann.

source: Private conversations (queries)
de: Private Unterhaltungen (Queries)
