Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/extragear-network/konversation.po
Languages: de

source: In any <link linkend="channel-screen-tour">channel</link>, users sometimes post the &URL;s of interesting websites or other resources on the web. You can double-click any such &URL; and &konversation; will launch the application associated with the &URL;. The application launched depends upon the &MIME; type of the &URL;. For example, a &URL; beginning with <interface>http:</interface> will activate your default &kde; web browser and display the web page. (You can also specify the <link linkend="webbrowser">web browser</link> to use.) If the &URL; scrolls off the screen, you might have trouble finding it again. &konversation; can keep a convenient list of all &URL;s for you. To activate this feature, choose <menuchoice> <guisubmenu>Window</guisubmenu> <guisubmenu>&url; Catcher</guisubmenu> </menuchoice> on the main menu. <action>A new tab called <guilabel>&url; Catcher</guilabel> is created.</action>
de: In <link linkend="channel-screen-tour">Kanälen</link> können Nachrichten versendet werden, die &URL;s von Webseiten oder anderen Ressourcen im Internet enthalten. Wenn Sie eine &URL; mit der &LMBn; anklicken, wird diese mit dem Programm geöffnet, das der Art der &URL; zugeordnet ist. Diese Zuordnung hängt vom &MIME;-Typ der &URL; ab. &URL;s, die mit <interface>http:</interface> beginnen, werden beispielsweise in Ihrem Standard-Webbrowser geöffnet (Sie können auch einen anderen <link linkend="webbrowser">Webbrowser</link> einstellen). Da Nachrichten oft nach einiger Zeit durch neuere Nachrichten aus dem Textfeld verdrängt werden, kann es schwierig sein, &URL;s wiederzufinden. &konversation; kann daher eine Liste mit allen &URL;s anzeigen, die in Nachrichten vorkommen. Klicken Sie dazu auf den Eintrag <menuchoice><guisubmenu>Fenster</guisubmenu> <guisubmenu>&URL;-Fänger</guisubmenu></menuchoice> in der Menüleiste. <action>Das Unterfenster <guilabel>&URL;-Fänger</guilabel> wird geöffnet.</action>

source: <screeninfo>The &url; Catcher tab.</screeninfo>
de: <screeninfo>Das Unterfenster „&URL;-Fänger“</screeninfo>

source: <phrase>The &url; Catcher tab.</phrase>
de: <phrase>Das Unterfenster „&URL;-Fänger“</phrase>

source: This is the list of &URL;s seen since you started &konversation;. The <guilabel>From</guilabel> column is the &i18n-nickname; of the person who posted the &URL; or the name of the channel or server, where the &URL; was posted. (&URL;s appearing in join and leave messages are not listed.) Click on a &URL; to select it.
de: Dies ist die Liste aller &URL;s, die seit dem Start von &konversation; in Nachrichten gefunden worden sind. In der Spalte <guilabel>Von</guilabel> wird jeweils der &i18n-Nickname; des Benutzers angezeigt, der die Nachricht mit der &URL; gesendet hat, oder der Name des Kanals oder Servers, von dem die &URL; gesendet wurde. &URL;s aus Meldungen über das Betreten oder Verlassen von Kanälen werden nicht angezeigt. Klicken Sie auf eine &URL;, um sie auszuwählen.

source: Click here to activate the application associated with the selected &URL;. The application launched depends upon the &MIME; type of the &URL;. For example, a &URL; beginning with <interface>http:</interface> will activate your default web browser and display the web page. For web pages, you can also specify the <link linkend="webbrowser">web browser</link> to use.
de: Klicken Sie hier, um die ausgewählte &URL; in dem Programm zu öffnen, das der Art der &URL; zugeordnet ist. Diese Zuordnung hängt vom &MIME;-Typ der &URL; ab. &URL;s, die mit <interface>http:</interface> beginnen, werden beispielsweise in Ihrem Standard-Webbrowser geöffnet (Sie können auch einen anderen <link linkend="webbrowser">Webbrowser</link> einstellen).

source: Click here to copy the selected &URL; to the &kde; clipboard.
de: Klicken Sie hier, um die ausgewählte &URL; in die Zwischenablage zu kopieren.

source: Click here to delete the selected &URL; from the list.
de: Klicken Sie hier, um die ausgewählte &URL; aus der Liste zu löschen.

source: Click here to save the list of &URL;s to a file.
de: Klicken Sie hier, um die Liste in einer Datei zu speichern.

source: Click here to clear the list.
de: Klicken Sie hier, um die Liste zu leeren.

source: Setting your preferred web browser
de: Einstellen eines Webbrowsers

source: When you click on a highlighted &URL; anywhere in &konversation;, it will launch the default &kde; application associated with the &MIME; type of the &URL;. For example, when clicking on a &URL; beginning with <interface>http</interface>, &konqueror; is launched to display the web page. You can specify an application different from the <guilabel>Default Applications</guilabel> module of the &kde; &systemsettings;. For example, you can use <application>Firefox</application> instead.
de: Wenn Sie in &konversation; eine hervorgehobene &URL; mit der &LMBn; anklicken, wird die Standardanwendung gestartet, die dem &MIME;-Typ der &URL; zugeordnet ist. Klicken Sie beispielsweise auf eine &URL;, die mit <interface>http</interface> beginnt, so wird Ihr Standard-Webbrowser gestartet, um die entsprechende Webseite anzuzeigen. Sie können im Modul <guilabel>Standard-Komponenten</guilabel> in den &kde;-&systemsettings; auch einen vom &kde;-Standard abweichenden Webbrowser einstellen, wie z. B. <application>Firefox</application>.

source: To choose a different web browser from &konversation; app, choose <menuchoice> <guisubmenu>Settings</guisubmenu> <guisubmenu>Configure &konversation;</guisubmenu> </menuchoice> on the main menu. <action>The <guilabel>Configure</guilabel> screen will appear.</action>
de: Um einen anderen Webbrowser von &konversation; aus einzustellen, klicken Sie auf den Eintrag <menuchoice><guisubmenu>Einstellungen</guisubmenu> <guisubmenu>&konversation; einrichten ...</guisubmenu></menuchoice> in der Menüleiste. <action>Der <guilabel>Einrichtungsdialog</guilabel> wird geöffnet.</action>

source: <screeninfo>The General screen</screeninfo>
de: <screeninfo>Der Abschnitt „Allgemein“ im Einrichtungsdialog</screeninfo>

source: <phrase>The General screen</phrase>
de: <phrase>Der Abschnitt „Allgemein“ im Einrichtungsdialog</phrase>

source: Click here to display the <guilabel>General</guilabel> screen.
de: Klicken Sie hier, um den Abschnitt <guilabel>Allgemein</guilabel> zu öffnen.

source: Click here to specify that you want to use a custom web browser.
de: Aktivieren Sie dieses Ankreuzfeld, um festzulegen, dass ein benutzerdefinierter Webbrowser verwendet werden soll.

source: Enter the command to launch your desired web browser. When you click on a &URL; <userinput><replaceable>%u</replaceable></userinput> will be replaced with the &URL;.
de: Geben Sie hier den Befehl zum Starten des gewünschten Webbrowsers ein. <userinput><replaceable>%u</replaceable></userinput> wird durch die &URL; ersetzt, wenn Sie eine &URL; anklicken.

source: <emphasis>Note: </emphasis>The web browser setting does not apply to <interface>mailto:</interface> &URL;s. <interface>mailto:</interface> &URL;s always launch the default &kde; mailer.
de: <emphasis>Hinweis:</emphasis> Diese Einstellung gilt nicht für &URL;s, die mit <interface>mailto:</interface> beginnen. Wenn Sie eine solche &URL; anklicken, wird das Standard-E-Mail-Programm gestartet.

source: Click <guibutton>Apply</guibutton> to save your changes. You must reconnect to each server and channel for the changes to take effect. The easiest way to do this is to quit and restart &konversation;.
de: Drücken Sie den Knopf <guibutton>Anwenden</guibutton> oder <guibutton>OK</guibutton>, um die Änderungen zu übernehmen. Sie müssen die Verbindung zu sämtlichen Servern und Kanälen neu herstellen, damit die Änderungen wirksam werden. Starten Sie dazu &konversation; neu.

source: Marking Channel and Query Logs
de: Markierungen in Kanälen und Queries

source: You can insert a marker into <link linkend="channel-screen-tour">channel</link> and <link linkend="query">query</link> screens to help you quickly locate information. To do this, choose <menuchoice> <guisubmenu>Insert</guisubmenu> <guisubmenu>Marker Line</guisubmenu> </menuchoice> on the main menu, or press <keycombo action="simul">&Ctrl;<keycap>R</keycap></keycombo>. <action>A line will appear at the bottom of the text on the screen. The line will scroll with the rest of the text in the screen.</action>
de: Sie können in <link linkend="channel-screen-tour">Kanälen</link> und <link linkend="query">Queries</link> Markierungslinien einfügen, die Ihnen die spätere Suche nach Informationen erleichtern. Klicken Sie dazu auf den Eintrag <menuchoice><guisubmenu>Einfügen</guisubmenu> <guisubmenu>Markierungslinie</guisubmenu></menuchoice> in der Menüleiste, oder verwenden Sie die Tastenkombination <keycombo action="simul">&Ctrl;<keycap>R</keycap></keycombo>. <action>Eine horizontale Linie wird unter dem Text angezeigt. Die Linie wird automatisch verschoben, wenn sich der Text bewegt.</action>

source: To make the <interface>Maker Line</interface> be inserted in all channels and queries at once, choose <menuchoice> <guisubmenu>Settings</guisubmenu> <guisubmenu>Configure Konversation</guisubmenu> </menuchoice> from the main menu, expand <guilabel>Behavior</guilabel>, click on <guilabel>Chat Window</guilabel>, and check the <guilabel>Show manually inserted lines in all chat windows</guilabel> box.
de: Wenn Markierungslinien in allen Kanälen und Queries gleichzeitig eingefügt werden sollen, klicken Sie auf den Eintrag <menuchoice><guisubmenu>Einstellungen</guisubmenu> <guisubmenu>&konversation; einrichten ...</guisubmenu></menuchoice> in der Menüleiste, klappen Sie den Abschnitt <guilabel>Verhalten</guilabel> auf, klicken Sie auf <guilabel>Chatfenster</guilabel> und aktivieren Sie das Ankreuzfeld <guilabel>Markierungslinien in allen Kanälen/Queries anzeigen</guilabel>.

source: To make &konversation; automatically insert a <interface>Marker Line</interface> whenever you do an <userinput><command>/away</command> <replaceable>msg</replaceable></userinput> command, see <link linkend="identity-away">Setting your identity</link>.
de: &konversation; kann automatisch eine Markierungslinie einfügen, sobald Sie den Befehl <userinput><command>/away</command> <replaceable>msg</replaceable></userinput> ausführen. Mehr Informationen dazu finden Sie im Abschnitt <link linkend="identity-away">Einstellen Ihrer Identität</link>.

source: Logging
de: Protokollierung

source: If logging is enabled, &konversation; keeps a log of each <interface>Server</interface>, <link linkend="channel-screen-tour">Channel</link>, and <link linkend="query">Private conversation (query)</link> session. Each session is stored in a log file on disk. When you open the same session again, &konversation; appends to the log.
de: Bei aktivierter Protokollierung legt &konversation; automatisch Protokolle für alle <interface>Server</interface>, <link linkend="channel-screen-tour">Kanäle</link> und <link linkend="query">Queries</link> an. Diese Sitzungen werden jeweils in einer Datei auf der Festplatte gespeichert. Wenn Sie dieselbe Sitzung erneut öffnen, wird im entsprechenden Unterfenster zunächst das Protokoll angezeigt, neue Nachrichten werden daran angehängt.

source: Whenever you open a session again, approximately the last 1024 characters of the previous session are read from the tail of the log and shown on the screen.
de: Wenn Sie eine Sitzung erneut öffnen, werden ungefähr die letzten 1024 Zeichen aus dem Protokoll gelesen und im Chatfenster angezeigt.

source: As your session continues, messages scroll off the top of the display. You can scroll backwards to view these messages. Eventually, in order to conserve memory, the oldest messages are discarded from the scroll. This is called the <guilabel>Scrollback limit</guilabel>. Messages that disappear from the display because of the <guilabel>Scrollback limit</guilabel> are still available in the log file, if logging is enabled.
de: Im Verlauf einer Sitzung verschwinden meist ältere Nachrichten oben aus dem Chatfenster. Sie können zurückblättern, um diese Nachrichten anzuzeigen. Jedoch werden, um Speicher zu sparen, die ältesten Nachrichten aus dem durch blättern anzeigbaren Bereich entfernt. Dies ist das <guilabel>Rücklauflimit</guilabel>. Nachrichten, die aufgrund des <guilabel>Rücklauflimits</guilabel> nicht mehr angezeigt werden, sind in der Protokolldatei verfügbar, sofern die Protokollierung aktiviert ist.

source: To view the logfile for a session, click the tab for the session to make it the current session and choose <menuchoice> <guisubmenu>Window</guisubmenu> <guisubmenu>Open Logfile</guisubmenu> </menuchoice> from the main menu. <action>A new tab appears</action> displaying the log file.
de: Um das Protokoll für eine Sitzung anzuzeigen, wählen Sie das jeweilige Unterfenster aus und klicken Sie auf den Eintrag <menuchoice><guisubmenu>Fenster</guisubmenu> <guisubmenu>Protokolldatei für #Sitzung öffnen</guisubmenu></menuchoice> in der Menüleiste. <action>Ein neues Unterfenster zur Anzeige der Protokolldatei wird geöffnet.</action>

source: <screeninfo>Logfile</screeninfo>
de: <screeninfo>Protokolldatei</screeninfo>

source: <phrase>Logfile</phrase>
de: <phrase>Protokolldatei</phrase>

source: The messages in the log file are displayed here. The oldest messages are at the top and the most recent are at the bottom.
de: Hier werden die Nachrichten angezeigt, die in der Protokolldatei gespeichert sind. Die ältesten Nachrichten finden Sie oben, die neuesten unten.

source: Click this button to save the log file to another file.
de: Drücken Sie diesen Knopf, um das Protokoll in einer Datei zu speichern.

source: Click to refresh the log file display. While you are viewing a log file, newer messages in the corresponding session are <emphasis>not</emphasis> automatically added to the log file display. Use this button to view the most recent messages.
de: Drücken Sie diesen Knopf, um die Anzeige zu aktualisieren. Während eine Protokolldatei angezeigt wird, werden neue Nachrichten in der entsprechenden Sitzung <emphasis>nicht</emphasis> automatisch im Protokoll angezeigt. Verwenden Sie diesen Knopf, um auch die neuesten Nachrichten anzuzeigen.

source: Click to erase the log file display and the log file on disk.
de: Klicken Sie hier, um die Protokolldatei sowie die Anzeige zu leeren.

source: Use this box to set the maximum size of the scroll. This setting does take effect only for newly opened log tabs. The last changed value of the scroll size will be used on &konversation;'s next start. Each log file may have a separate setting.
de: Stellen Sie hier das Rücklauflimit für die Protokolldatei ein. Diese Einstellung wird erst beim nächsten Start von &konversation; wirksam und kann für jede Protokolldatei separat gesetzt werden.

source: The <guilabel>Scrollback limit</guilabel> can be changed by choosing <menuchoice> <guisubmenu>Settings</guisubmenu> <guisubmenu>Configure &konversation;</guisubmenu> </menuchoice> on the main menu, then expand <guilabel>Behavior</guilabel> and click on <guilabel>Chat Window</guilabel>. The <guilabel>Scrollback limit</guilabel> box appears on this screen. If you set it to <guilabel>Unlimited</guilabel> (&ie; zero), messages are not discarded from the scroll.
de: Um das <guilabel>Rücklauflimit</guilabel> zu ändern, klicken Sie auf den Eintrag <menuchoice><guisubmenu>Einstellungen</guisubmenu> <guisubmenu>&konversation; einrichten ...</guisubmenu></menuchoice> in der Menüleiste, klappen Sie den Abschnitt <guilabel>Verhalten</guilabel> auf und klicken Sie auf <guilabel>Chatfenster</guilabel>. Stellen Sie nun im Feld <guilabel>Rücklauflimit</guilabel> die gewünschte Anzahl von Zeilen ein. Wenn Sie den Wert <guilabel>Unbegrenzt</guilabel> (&ie; Null) einstellen, werden alle Nachrichten angezeigt.

source: You can enable or disable logging and set other logging options, by choosing <menuchoice> <guisubmenu>Settings</guisubmenu> <guisubmenu>Configure &konversation;</guisubmenu> </menuchoice> on the main menu, then expand <guilabel>Behavior</guilabel> and click on <guilabel>Logging</guilabel>.
de: Zum Aktivieren und Deaktivieren sowie für weitere Einstellungen zur Protokollierung, klicken Sie auf den Eintrag <menuchoice><guisubmenu>Einstellungen</guisubmenu> <guisubmenu>&konversation; einrichten ...</guisubmenu></menuchoice> in der Menüleiste, klappen Sie den Abschnitt <guilabel>Verhalten</guilabel> auf und klicken Sie auf <guilabel>Protokollierung</guilabel>.

source: &konversation; commands
de: &konversation;-Befehle

source: The following commands are interpreted by &konversation; and may differ from standard &irc; commands. Items inside square brackets are optional. Items separated by bar (|) are alternate forms of the command. Commands not listed here are sent to the server as entered.
de: Die folgenden Befehle werden von &konversation; verarbeitet und können von den &irc;-Befehlen abweichen. Elemente in eckigen Klammern ([]) sind optional. Durch „|“ getrennte Elemente sind Alternativen. Befehle, die hier nicht aufgeführt sind, werden direkt an den Server gesendet.

source: <command>/me</command> <replaceable>msg</replaceable>
de: <command>/me</command> <replaceable>Nachricht</replaceable>

source: <command>/ame</command> <replaceable>msg</replaceable>
de: <command>/ame</command> <replaceable>Nachricht</replaceable>

source: Like the <userinput><command>/me</command></userinput> command above except that the message is sent to all the channels and queries you have open on all the servers you have connected in &konversation;.
de: Wie der Befehl <userinput><command>/me</command></userinput> (siehe oben), die Nachricht wird jedoch an alle Kanäle und Queries auf allen Servern gesendet, mit denen Sie verbunden sind.

source: <command>/join</command> <replaceable>channel</replaceable> <replaceable>[pwd]</replaceable>
de: <command>/join</command> <replaceable>Kanal</replaceable> <replaceable>[Passwort]</replaceable>

source: Joins <userinput><replaceable>channel</replaceable></userinput>. If the server permits it, and if the channel does not already exist, it is created and you are the channel operator. If the channel requires a password in order to join, specify as <userinput><replaceable>pwd</replaceable></userinput>. Most channel names begin with <userinput><replaceable>#</replaceable></userinput>.
de: Den Kanal <userinput><replaceable>Kanal</replaceable></userinput> betreten. Falls der Kanal noch nicht existiert, so wird er erstellt und Sie sind der Operator des Kanals, sofern der Server dies zulässt. Falls ein Passwort nötig ist, um den Kanal zu betreten, geben Sie dieses an. Die meisten Kanalnamen beginnen mit <userinput><replaceable>#</replaceable></userinput>.

source: <command>/j</command> <replaceable>channel</replaceable> <replaceable>[pwd]</replaceable>
de: <command>/j</command> <replaceable>Kanal</replaceable> <replaceable>[pwd]</replaceable>

source: Same as <userinput><command>/join</command></userinput> above.
de: Entspricht dem Befehl <userinput><command>/join</command></userinput> (siehe oben).

source: <command>/part</command> <replaceable>[channel]</replaceable> <replaceable>[reason]</replaceable>
de: <command>/part</command> <replaceable>[Kanal]</replaceable> <replaceable>[Grund]</replaceable>

source: Leaves <userinput><replaceable>channel</replaceable></userinput> with <userinput><replaceable>reason</replaceable></userinput> and closes the corresponding <interface>channel</interface> tab. Within a &konversation; channel or query tab, you can just enter <userinput><command>/part</command></userinput> which closes that channel or query with your default reason as given in the <link linkend="identity">Settings</link>.
de: Den <userinput><replaceable>Kanal</replaceable></userinput> mit der Begründung <userinput><replaceable>Grund</replaceable></userinput> verlassen und das entsprechende <interface>Kanal</interface>-Unterfenster schließen. In einem Kanal oder Query können Sie den Befehl <userinput><command>/part</command></userinput> ohne Angabe eines Kanals verwenden, um diesen Kanal oder Query zu verlassen. Dabei wird die Standardbegründung verwendet, die Sie in den <link linkend="identity">Einstellungen</link> ändern können.

source: <command>/leave</command> <replaceable>[channel]</replaceable> <replaceable>[reason]</replaceable>
de: <command>/leave</command> <replaceable>[Kanal]</replaceable> <replaceable>[Grund]</replaceable>

source: Same as <userinput><command>/part</command></userinput> above.
de: Entspricht dem Befehl <userinput><command>/part</command></userinput> (siehe oben).

source: When entered in any channel, query, or DCC tab, disconnects from the corresponding server and closes all channel, query, or DCC tabs open on that server.
de: Trennt die Verbindung zum jeweiligen Server, wenn Sie den Befehl in einem Kanal-, Query- oder DCC-Unterfenster eingeben. Alle Unterfenster für Kanäle, Queries oder Dateiübertragungen auf diesem Server werden geschlossen.

source: <command>/notice</command> <replaceable>nick|channel</replaceable> <replaceable>msg</replaceable>
de: <command>/notice</command> <replaceable>Spitzname|Kanal</replaceable> <replaceable>Nachricht</replaceable>

source: Sends <userinput><replaceable>msg</replaceable></userinput> to the user with &i18n-nickname; <userinput><replaceable>nick</replaceable></userinput> or to everyone in <userinput><replaceable>channel</replaceable></userinput>. The following is an example of what appears to you in the channel tab
de: Sendet die <userinput><replaceable>Nachricht</replaceable></userinput> an den Benutzer <userinput><replaceable>Spitzname</replaceable></userinput> oder den <userinput><replaceable>Kanal</replaceable></userinput>. Folgendes Beispiel zeigt, was in Ihrem Chatfenster angezeigt wird:

source: [17:14] [Notice] Sending notice "I think I understand" to #konversation
de: [17:14] [Notice] Nachricht „Hallo“ wird an #konversation gesendet

source: And this is what the recipients see
de: Der Empfänger sieht folgendes:

source: [17:15] [Notice] -Eisfuchs- I think I understand
de: [17:14] [Notice] -Eisfuchs- Hallo

source: Creates a new tab with the user's <userinput><replaceable>nick</replaceable></userinput> for private conversation, commonly known on &irc; as a <link linkend="query">Query</link>. Everything written here is only visible to you and your query partner. You may enter more than one &i18n-nickname; separated by spaces and a query tab will be opened for each &i18n-nickname;. Each such query tab will be private between you and the query partner.
de: Öffnet ein neues Unterfenster mit dem <userinput><replaceable>Spitznamen</replaceable></userinput> als Titel für eine private Unterhaltung (im &irc; als <link linkend="query">Query</link> bezeichnet). Alle hier gesendeten Nachrichten sind nur für Sie und Ihren Query-Partner sichtbar. Sie können mehrere &i18n-Nickname;n durch Leerzeichen getrennt angeben, um Queries mit jedem dieser Benutzer zu öffnen.

source: <userinput><command>/msg </command><replaceable>nick|channel</replaceable></userinput> <userinput><replaceable>message</replaceable></userinput>
de: <userinput><command>/msg</command><replaceable>Spitzname|Kanal</replaceable></userinput> <userinput><replaceable>Nachricht</replaceable></userinput>
