Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/extragear-network/konversation.po
Languages: de

source: When you connect, many servers query your computer for an IDENT response. If you computer is not running an IDENT server, this response is sent by &konversation;. No spaces are allowed. Your first name is suggested.
de: Bei der Verbindungsherstellung fordern viele Server eine IDENT-Antwort an. Falls auf Ihrem Rechner kein IDENT-Server läuft, wird diese Antwort von &konversation; gesendet. Leerzeichen sind hier nicht erlaubt. Sie können z. B. Ihren Vornamen angeben.

source: Whenever you leave a channel, this message is sent to the channel.
de: Immer wenn Sie einen Kanal verlassen, wird diese Nachricht gesendet.

source: Whenever you are kicked from a channel (usually by an &irc; operator), this message is sent to the channel.
de: Immer wenn Sie aus einem Kanal geworfen werden (normalerweise von einem &irc;-Operator), wird diese Nachricht gesendet.

source: Click to apply your changes. In order for all the changes to take effect, you must disconnect from the server and re-connect. The easiest way to do that is to quit &konversation; and restart.
de: Klicken Sie hier, um die Änderungen anzuwenden. Damit alle Änderungen wirksam werden, müssen Sie die Verbindung zum Server beenden und eine neue Verbindung herstellen. Starten Sie dazu &konversation; neu.

source: Defining new networks, servers and auto join channels
de: Konfiguration von neuen Netzwerken, Servern und Kanälen zum automatischen Betreten

source: The <guilabel>Server List</guilabel> screen appears when you open the &konversation; program. It also appears when you choose <menuchoice> <guisubmenu>File</guisubmenu> <guisubmenu>Server List</guisubmenu> </menuchoice> on the main menu. <action>The <guilabel>Server List</guilabel></action> screen lists your existing defined &irc; <guilabel>Network</guilabel>s, listed by group. An &irc; network is a collection of cooperating servers. When you connect to any server in a network, you have access to all the channels of the network. Examples of &irc; networks are <userinput><replaceable>Freenode</replaceable></userinput> and <userinput><replaceable>Undernet</replaceable></userinput>.
de: Der Dialog <guilabel>Serverliste</guilabel> erscheint beim Start von &konversation; oder wenn Sie auf den Eintrag <menuchoice><guisubmenu>Datei</guisubmenu> <guisubmenu>Serverliste ...</guisubmenu></menuchoice> in der Menüleiste klicken. <action>Der Dialog <guilabel>Serverliste</guilabel> zeigt die konfigurierten &irc;-<guilabel>Netzwerke</guilabel> an.</action> Ein &irc;-Netzwerk ist ein Verbund von Servern. Wenn Sie eine Verbindung zu einem Server eines Netzwerks haben, haben Sie Zugriff auf alle Kanäle des Netzwerks. Beispiele für &irc;-Netzwerke sind <userinput><replaceable>Freenode</replaceable></userinput> und <userinput><replaceable>Undernet</replaceable></userinput>.

source: Your existing defined <guilabel>Network</guilabel>s are listed here along with the <guilabel>Identity</guilabel> used to connect to the network, and the <guilabel>Channels</guilabel> automatically joined when connected. If you have specified a group for your networks, networks are listed indented under the group. Click on a network to select it.
de: Hier sind die konfigurierten <guilabel>Netzwerke</guilabel> aufgelistet, jeweils mit der zur Verbindung verwendeten <guilabel>Identität</guilabel> und den <guilabel>Kanälen</guilabel>, die automatisch betreten werden, wenn eine Verbindung besteht. Klicken Sie auf ein Netzwerk, um es auszuwählen.

source: Use these buttons to <guibutton>Add</guibutton> a new network, <guibutton>Edit</guibutton> a highlighted network, or <guibutton>Delete</guibutton> a highlighted network.
de: Benutzen Sie diese Knöpfe zum <guibutton>Hinzufügen</guibutton> eines neuen Netzwerks, zum <guibutton>Bearbeiten</guibutton> oder <guibutton>Löschen</guibutton> der ausgewählten Netzwerke.

source: Click this button to connect to the highlighted <guilabel>Network</guilabel> and close the <guilabel>Server List</guilabel> screen. You may highlight more than one network if you wish, which will connect to all the highlighted networks.
de: Klicken Sie diesen Knopf, um eine Verbindung zum ausgewählten <guilabel>Netzwerk</guilabel> herzustellen und den Dialog <guilabel>Serverliste</guilabel> zu schließen. Wenn Sie mehrere Netzwerke auswählen, werden Verbindungen zu allen ausgewählten Netzwerken hergestellt.

source: Clicking this button does not discard the changes you have made. It merely means you do not wish to connect to any networks at this time.
de: Dieser Knopf dient nicht zum Verwerfen von Änderungen, die Sie vorgenommen haben. Benutzen Sie ihn, um den Dialog <guilabel>Serverliste</guilabel> zu schließen, wenn Sie keine Verbindung zu einem Netzwerk herstellen möchten.

source: When you click the <guibutton>New</guibutton> button, the <guilabel>New Network</guilabel> screen appears.
de: Wenn Sie den Knopf <guibutton>Neu ...</guibutton> drücken, wird der Dialog <guilabel>Neues Netzwerk</guilabel> geöffnet.

source: <screeninfo>New Network</screeninfo>
de: <screeninfo>Neues Netzwerk</screeninfo>

source: <phrase>New Network</phrase>
de: <phrase>Neues Netzwerk</phrase>

source: Enter the <guilabel>Network name</guilabel> here. You may create as many entries in the <guilabel>Server List</guilabel> screen with the same <guilabel>Network</guilabel> as you like.
de: Geben Sie hier den <guilabel>Netzwerknamen</guilabel> ein. Sie können beliebig viele Einträge im Dialog <guilabel>Serverliste</guilabel> für dasselbe <guilabel>Netzwerk</guilabel> anlegen.

source: Choose an existing <guilabel>Identity</guilabel> or click the <guibutton>Edit</guibutton> button to add a new Identity or edit an existing one. The <guilabel>Identity</guilabel> will identify you and determine your &i18n-nickname; when you connect to the network.
de: Wählen Sie eine bereits eingerichtete <guilabel>Identität</guilabel> aus oder drücken Sie den Knopf <guibutton>Bearbeiten ...</guibutton> um eine neue Identität hinzuzufügen oder eine bereits eingerichtete zu bearbeiten. Durch die <guilabel>Identität</guilabel> wird Ihr &i18n-Nickname; festgelegt, unter dem Sie im Netzwerk bekannt sind.

source: Optional. This command will be sent to the server after connecting. Example: <userinput>/msg NickServ IDENTIFY <replaceable>konvirocks</replaceable></userinput>. This example is for the freenode network, which requires users to register their &i18n-nickname; with a password and login when connecting. <userinput><replaceable>konvirocks</replaceable></userinput> is the password for the &i18n-nickname; given in <guilabel>Identity</guilabel>. You may enter more than one command by separating them with semicolons.
de: Optional. Dieser Befehl wird nach der Verbindungsherstellung ausgeführt, z. B.: <userinput>/msg NickServ IDENTIFY <replaceable>konvirocks</replaceable></userinput>. Dieses Beispiel gilt für das Netzwerk „Freenode“, in dem Benutzer Ihren &i18n-nickname;n mit einem Passwort registrieren müssen, das beim Herstellen der Verbindung abgefragt wird. <userinput><replaceable>konvirocks</replaceable></userinput> ist das Passwort für den &i18n-Nickname;n, der für die <guilabel>Identität</guilabel> festgelegt ist. Sie können mehrere Befehle angeben, die durch Semikola getrennt sind.

source: Check here if you want &konversation; to automatically connect to this network whenever you open &konversation;.
de: Aktivieren Sie dieses Ankreuzfeld, wenn &konversation; bei jedem Start eine Verbindung zu diesem Netzwerk herstellen soll.

source: This is a list of &irc; <guilabel>Servers</guilabel> in the network. When connecting to the network, &konversation; will attempt to connect to the top server first. If this fails, it will attempt the second server. If this fails, it will attempt the third, and so on. At least one server must be specified. Click a server to highlight it.
de: Dies ist eine Liste von &irc;-<guilabel>Servern</guilabel> in dem Netzwerk. &konversation; wird zuerst versuchen, zum obersten Server in der Liste eine Verbindung herzustellen, falls dies fehlschlägt, zum nächsten usw. Sie müssen mindestens einen Server angeben. Klicken Sie auf einen Server, um ihn auszuwählen.

source: Use these buttons to <guibutton>Add</guibutton> a server, <guibutton>Edit</guibutton> a highlighted server, or <guibutton>Delete</guibutton> a highlighted server. You can also adjust the order of the server list and therefore the order of connection attempts.
de: Benutzen Sie diese Knöpfe zum <guibutton>Hinzufügen</guibutton>, <guibutton>Bearbeiten</guibutton> oder <guibutton>Löschen</guibutton> von Servern. Sie können außerdem die Reihenfolge festlegen, in der &konversation; versucht, eine Verbindung zum jeweiligen Server herzustellen.

source: Optional. This is a list of the channels that will be automatically joined once &konversation; has connected to a server. You may leave this blank if you wish to not automatically join any channels.
de: Optional. Dies ist eine Liste von Kanälen, die automatisch betreten werden, sobald eine Verbindung zum entsprechenden Netzwerk hergestellt ist. Lassen Sie dieses Feld leer, wenn keine Kanäle automatisch betreten werden sollen.

source: Use these buttons to <guibutton>Add</guibutton> a channel, <guibutton>Edit</guibutton> a highlighted channel, or <guibutton>Delete</guibutton> a highlighted channel. You may also change the order the channels are joined.
de: Benutzen Sie diese Knöpfe zum <guibutton>Hinzufügen</guibutton>, <guibutton>Bearbeiten</guibutton> und <guibutton>Löschen</guibutton> von Kanälen. Sie können außerdem die Reihenfolge festlegen, in der die Kanäle betreten werden.

source: Avoid mixing servers on different &irc; networks under the same <guilabel>Network</guilabel>. Avoid entering the same server under two different <guilabel>Network</guilabel>s. Otherwise, &konversation; <link linkend="linkaddressbook">integration with your address book</link> and <link linkend="nicksonline">monitoring of online &i18n-nickname;s</link> will not function correctly.
de: Geben Sie für ein <guilabel>Netzwerk</guilabel> nicht mehrere Server aus verschiedenen &irc;-Netzwerken an. Geben Sie nicht denselben Server für verschiedene <guilabel>Netzwerke</guilabel> an. Dies führt dazu, dass die <link linkend="linkaddressbook">Integration Ihres Adressbuchs</link> und die <link linkend="nicksonline">Beobachtung von &i18n-Nickname;n</link> nicht korrekt funktionieren.

source: When you click the <guibutton>Add</guibutton> button in the <guilabel>Servers</guilabel> frame, the <guilabel>Add Server</guilabel> screen appears.
de: Wenn Sie den Knopf <guibutton>Hinzufügen ...</guibutton> im Abschnitt <guilabel>Server</guilabel> drücken, wird der Dialog <guilabel>Server hinzufügen</guilabel> geöffnet.

source: <screeninfo>Add Server</screeninfo>
de: <screeninfo>Server hinzufügen</screeninfo>

source: <phrase>Add Server</phrase>
de: <phrase>Server hinzufügen</phrase>

source: The name or IP number of the server. irchelp.org maintains a <ulink url="http://www.irchelp.org/irchelp/networks/">list</ulink> of servers.
de: Der Name oder die IP-Adresse des Servers. Auf der Webseite irchelp.org finden Sie eine <ulink url="http://www.irchelp.org/irchelp/networks/">Liste</ulink> mit &irc;-Servern.

source: Enter the port number required to connect to the server. For most servers, this should be <userinput>6667</userinput>.
de: Geben Sie hier den Port des Servers an, mit dem verbunden werden soll. Im Normalfall ist dies Port <userinput>6667</userinput>.

source: If the server requires a password in order to connect, enter it here, otherwise leave blank.
de: Falls der Server zur Verbindungsherstellung ein Passwort benötigt, geben Sie dieses hier ein, anderenfalls lassen Sie dieses Feld leer.

source: Check if you want to use Secure Socket Layer (SSL) protocol to communicate with the server. This protects the privacy of your communications between your computer and the &irc; server. The server must support SSL protocol for this to work. In most cases, if the server does not support SSL, the connection will fail.
de: Aktivieren Sie dieses Ankreuzfeld, falls Sie das Secure-Socket-Layer-Protokoll (SSL) zur Kommunikation mit dem Server verwenden möchten. Dadurch wird die Übertragung von Daten zwischen Ihrem Rechner und dem &irc;-Server geschützt. Der Server muss das SSL-Protokoll unterstützen, damit dies möglich ist. Normalerweise kann keine Verbindung hergestellt werden, wenn der Server kein SSL unterstützt und dieses Ankreuzfeld aktiviert ist.

source: When you click the <guibutton>Add</guibutton> button in the <guilabel>Auto Join Channels</guilabel> frame, the <guilabel>Add Channel</guilabel> screen appears.
de: Wenn Sie den Knopf <guibutton>Hinzufügen ...</guibutton> im Abschnitt <guilabel>Kanäle automatisch betreten</guilabel> drücken, wird der Dialog <guilabel>Kanal hinzufügen</guilabel> geöffnet.

source: <screeninfo>Add Channel</screeninfo>
de: <screeninfo>Kanal hinzufügen</screeninfo>

source: <phrase>Add Channel</phrase>
de: <phrase>Kanal hinzufügen</phrase>

source: Enter a channel name. Do not forget leading <userinput><replaceable>#</replaceable></userinput>. If the channel requires a password in order to join, enter it, otherwise leave blank.
de: Geben Sie den Namen des Kanals ein. Vergessen Sie dabei nicht das <userinput><replaceable>#</replaceable></userinput> am Anfang des Namens. Falls der Kanal passwortgeschützt ist, geben Sie das Passwort ein, anderenfalls lassen Sie das dafür vorgesehene Feld leer.

source: Listing available channels
de: Auflisten der verfügbaren Kanäle

source: To display a list of available channels, choose <menuchoice> <guisubmenu>Window</guisubmenu> <guisubmenu>Channel List</guisubmenu> </menuchoice> on the main menu. <action>After a warning screen, a new tab is created called the <guilabel>Channel List</guilabel>.</action>
de: Um eine Liste der verfügbaren Kanäle anzuzeigen, klicken Sie auf den Eintrag <menuchoice><guisubmenu>Fenster</guisubmenu> <guisubmenu>Kanalliste für [Name des Netzwerks]</guisubmenu></menuchoice> in der Menüleiste. <action>Nach einer Warnung wird ein neues Unterfenster <guilabel>Kanalliste</guilabel> geöffnet.</action>

source: <screeninfo>The Channel List tab.</screeninfo>
de: <screeninfo>Das Unterfenster „Kanalliste“</screeninfo>

source: <phrase>The Channel List tab.</phrase>
de: <phrase>Das Unterfenster „Kanalliste“</phrase>

source: Enter a filter string here.
de: Geben Sie hier Text ein, nach dem die Liste gefiltert werden soll. Legen Sie mit den entsprechenden Ankreuzfeldern fest, ob der Filter auf die Namen oder die Themen der Kanäle (bzw. beides) angewendet werden soll.

source: You can limit the channel list to those channels with a minimum or maximum number of users here. Choosing <guilabel>No Limit</guilabel> disables the respective criteria.
de: Sie können die Kanalliste auf Kanäle mit einer minimalen und/oder maximalen Anzahl von Benutzern beschränken. Durch die Eingabe von 0 wird das entsprechende Kriterium deaktiviert.

source: Click here to retrieve the list of channels from the server and apply the filter.
de: Klicken Sie hier, um die Kanalliste vom Server abzurufen und den Filter anzuwenden.

source: The filtered list of channels is displayed here. Notice that if you don't use regular expressions, &konversation; lists any channel whose name contains the filter string you entered. The channel name does not have to start with the string you entered.
de: Hier wird die gefilterte Kanalliste angezeigt. Falls Sie keine regulären Ausdrücke als Filter verwenden, werden alle Kanäle angezeigt, deren Namen bzw. Themen den von Ihnen eingegebenen Text enthalten. Die Namen und/oder Themen müssen dazu nicht unbedingt mit dem Filtertext beginnen.

source: Select a channel you want to join by clicking on it. Right click on the channel to get a list of all web addresses mentioned in the channel's topic.
de: Wählen Sie einen Kanal, den Sie betreten möchten, aus, indem Sie ihn anklicken. Klicken Sie mit der &RMBn; auf einen Kanal, um eine Liste aller Internet-Adressen zu erhalten, die im Thema des Kanals erwähnt werden.

source: Click here to join the channel. A new tab is created for the channel.
de: Klicken Sie hier, um den ausgewählten Kanal zu betreten. Für den Kanal wird ein neues Unterfenster geöffnet.

source: Sometimes there are "secret" channels on servers. Such channels are not listed in the <guilabel>Channel List</guilabel>. You can still join these channels if you know their name. In any <interface>Input Line</interface>, type: <userinput><command>/join</command> <replaceable>#channelname</replaceable></userinput>. (The <userinput>#</userinput> is required.) A new tab is created for the channel. If you join a channel and the Nick Panel lists only your &i18n-nickname;, it means that the channel did not exist before. The server created the channel and you are the operator. In this case, you probably want to close the channel by typing: <userinput><command>/part</command></userinput>.
de: In manchen Fällen gibt es „geheime“ Kanäle. Diese sind nicht in der <guilabel>Kanalliste</guilabel> vorhanden. Sie können solche Kanäle dennoch betreten, sofern Sie ihren Namen kennen. Geben Sie dazu in der <interface>Eingabezeile</interface> den Befehl <userinput><command>/join</command> <replaceable>#Kanalname</replaceable></userinput> ein (Das <userinput>#</userinput> ist notwendig). Für den Kanal wird ein neues Unterfenster geöffnet. Falls die Benutzerliste nach dem Betreten eines Kanals nur Ihren &i18n-Nickname;n enthält, bedeutet das, dass der Kanal noch nicht existierte, also gerade vom Server erstellt wurde. In diesem Fall sind Sie der Operator des Kanals. Zum Schließen des Kanals geben Sie den Befehl <userinput><command>/part</command></userinput> ein.

source: A tour of the main screen
de: Das Hauptfenster von &konversation;

source: Let's learn more about the <interface>Main</interface> screen. The screen is shown below with a channel tab selected.
de: Im Folgenden werden Details zum <interface>Hauptfenster</interface> von &konversation; erklärt. Unten sehen Sie ein Bildschirmfoto des Hauptfensters.

source: The Main screen.
de: Das Hauptfenster

source: The Main screen
de: Das Hauptfenster

source: This is called the <interface>Input Line</interface>. It appears only when the current tab is a channel. To send a message to everyone in the channel, type the message here and press &Enter;. Your message, as well as everyone else's messages appear in the channel scroll above. Each message is preceded by the time and user's &i18n-nickname;.
de: Dies ist die <interface>Eingabezeile</interface>. Um eine Nachricht an alle Benutzer des Kanals zu senden, geben Sie sie hier ein und drücken Sie die &Enter;taste. Ihre Nachricht sowie die Nachrichten der anderen Benutzer werden im Textfeld über der Eingabezeile angezeigt. Vor jeder Nachricht stehen die Zeit, zu der sie gesendet wurde und der &i18n-Nickname; des Senders.

source: You can also paste text from the clipboard. If the pasted text has more than one line (newlines), a dialog box appears. Edit the text as desired and click <guibutton>OK</guibutton>.
de: Sie können auch Text aus der Zwischenablage einfügen. Falls der eingefügte Text länger als eine Zeile ist, wird ein Dialog geöffnet, in dem Sie den Text bearbeiten können. Drücken Sie danach den Knopf <guibutton>OK</guibutton>.

source: If the pasted text is longer than 256 characters, or it contains more than one line, a warning message appears advising you that large postings can cause connection resets and flooding. You can still proceed with the input, but doing so is a bad idea, as flooding will annoy other users in the channel, or you may be disconnected from the server. It is better to send the message in shorter chunks.
de: Falls der eingefügte Text länger als 256 Zeichen oder eine Zeile ist, erscheint eine Warnung, die darauf hinweist, dass lange Nachrichten zu Verbindungsabbrüchen oder Flood-Kills führen können. Sie können zwar mit der Eingabe fortfahren, es ist jedoch besser, die Nachricht in kleineren Teilen zu senden.

source: A convention used in many channels is to precede messages directed at one user with their &i18n-nickname;. &konversation; provides a convenient &i18n-nickname; completion feature. Start typing the user's &i18n-nickname;, then press &Tab;. &konversation; will complete the rest of the user's &i18n-nickname; followed by a colon. To customize the completion feature, choose <menuchoice> <guisubmenu>Settings</guisubmenu> <guisubmenu>Configure Konversation</guisubmenu> </menuchoice> from the main menu, expand <guilabel>Behavior</guilabel>, click on <guilabel>General</guilabel>, and select a <guilabel>Completion mode</guilabel>.
de: In vielen Kanälen ist es üblich, Nachrichten, die nur an einen Benutzer gerichtet sind, dessen &i18n-Nickname;n voranzustellen. &konversation; kann &i18n-Nickname;n automatisch vervollständigen. Geben Sie dazu den Anfang eines &i18n-Nickname;ns ein und drücken Sie &Tab;. &konversation; wird den &i18n-Nickname;n vervollständigen und einen Doppelpunkt sowie ein Leerzeichen hinzufügen. Um die Vervollständigungsfunktion anzupassen, klicken Sie auf den Eintrag <menuchoice><guisubmenu>Einstellungen</guisubmenu> <guisubmenu>&konversation; einrichten ...</guisubmenu></menuchoice> in der Menüleiste, klappen Sie den Abschnitt <guilabel>Verhalten</guilabel> auf und klicken Sie auf <guilabel>Allgemein</guilabel>. Wählen Sie nun den gewünschten <guilabel>Vervollständigungsmodus</guilabel> im entsprechenden Auswahlfeld.

source: You can also enter an &irc; command here by first typing <userinput><command>/</command></userinput> followed by a valid &irc; command. See <link linkend="irc-cmds">Frequently-used &irc; commands</link>. On some servers, you can type <userinput><command>/help</command></userinput> for a list of available commands, or type <userinput><command>/help </command><replaceable>command</replaceable></userinput> for help on a specific command.
de: Sie können in der Eingabezeile auch &irc;-Befehle ausführen, indem Sie <userinput><command>/</command></userinput> gefolgt von einem gültigen &irc;-Befehl eingeben und mit der &Enter;taste bestätigen (siehe <link linkend="irc-cmds">Häufig benutzte &irc;-Befehle</link>). Auf einigen Servern können Sie den Befehl <userinput><command>/help</command></userinput> verwenden, um eine Liste der verfügbaren Befehle anzufordern oder <userinput><command>/help</command> <replaceable>Befehl</replaceable></userinput>, um Hilfe zu einem bestimmten Befehl zu erhalten.
