Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/extragear-network/konversation.po
Languages: de

source: <!ENTITY i18n-nickname "<acronym>nickname</acronym>">
de: <!ENTITY i18n-nickname "<acronym>Spitzname</acronym>">

source: <!ENTITY i18n-Nickname "<acronym>Nickname</acronym>">
de: <!ENTITY i18n-Nickname "<acronym>Spitzname</acronym>">

source: The &konversation; Handbook
de: Das Handbuch zu &konversation;

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Felix</firstname><surname>Schweighofer</surname><contrib>Übersetzung</contrib><affiliation><address><email>felix.schweighofer@googlemail.com</email></address></affiliation></othercredit>

source: &konversation; is a user-friendly &irc; client built on the &kde; platform.
de: &konversation; ist ein benutzerfreundliches &irc;-Programm für KDE.

source: communications
de: Kommunikation

source: Introduction
de: Einführung

source: &konversation; is an &irc; client built on the &kde; platform. It offers the following features:
de: &konversation; ist ein &irc;-Programm für &kde; 4 oder höher. Es bietet folgende Funktionen:

source: SSL support.
de: SSL-Unterstützung.

source: User-friendly tabbed interface.
de: Benutzerfreundliche Oberfläche mit Unterfenstern.

source: Customizable Quick Buttons for often-used commands.
de: Frei konfigurierbare Schnellschalter für häufig benutzte Befehle.

source: Automatic reconnect and rejoin.
de: Automatisches Neuverbinden und Betreten von Kanälen.

source: DCC send and receive.
de: Senden und Empfangen über DCC.

source: &i18n-Nickname; watch list.
de: &i18n-Nickname;n-Beobachtungsliste.

source: Visual and auditory notifications for a wide variety of events, such as messages containing your &i18n-nickname;, or &i18n-nickname;s on your watch list going online or offline.
de: Visuelle und Audio-Benachrichtigungen bei vielen verschiedenen Ereignissen, wie Nachrichten, die Ihren &i18n-nickname;n enthalten oder wenn &i18n-nickname;n, die auf Ihrer Beobachtungsliste stehen, online oder offline gehen.

source: Customizable highlighting of messages by &i18n-nickname; or regular expression pattern.
de: Konfigurierbare Hervorhebung von Nachrichten nach &i18n-Nickname;n oder mit regulären Ausdrücken.

source: &i18n-Nickname; completion.
de: &i18n-Nickname;n-Vervollständigung.

source: Capture and save all &URL;s appearing in messages.
de: Erfassen und Speichern aller &URL;s in Nachrichten.

source: On-screen display of messages, even when minimized.
de: OnScreen-Anzeige von Nachrichten auch im minimierten Zustand.

source: &i18n-Nickname; ignore list.
de: &i18n-Nickname;n-Ignorierliste.

source: Automatic logging and log management.
de: Automatische Protokollierung und Protokollverwaltung.

source: Marking of lines in logs.
de: Markierung von Zeilen in Protokollen.

source: Scripting.
de: Skriptunterstützung.

source: Integration with &kaddressbook;.
de: Integration von &kaddressbook;.

source: The &konversation; website is <ulink url="&konviwebsite;">&konviwebsite;</ulink>. Further information like a FAQ and tips and tricks you find in the <ulink url="http://konversation.kde.org/wiki/Main_Page">&konversation; Wiki</ulink>.
de: Die Webseite von &konversation; finden Sie unter <ulink url="&konviwebsite;">&konviwebsite;</ulink>. Weitere Informationen, wie häufig gestellte Fragen sowie Tipps und Tricks erhalten Sie im <ulink url="http://konversation.kde.org/wiki/Main_Page">Wiki zu &konversation;</ulink>.

source: Developers for &konversation; can often be contacted via &irc; at <ulink url="irc://chat.freenode.net/konversation">irc.freenode.net channel #konversation</ulink>.
de: Die Entwickler von &konversation; sind oft via &irc; im <ulink url="irc://chat.freenode.net/konversation">Kanal #konversation auf irc.freenode.net</ulink> erreichbar.

source: Using &konversation;
de: Benutzung von &konversation;

source: If you haven't used &irc; before...
de: Falls Sie bisher kein &irc; verwendet haben ...

source: Simply put, &irc; is a chat protocol, defined by official Internet standards, and capable of stealing many hours of your life. To use &irc;, you must connect to a server, and then join a channel (equivalent to a chat room) or just engage in private conversations.
de: Einfach ausgedrückt ist &irc; ein Chat-Protokoll, das durch offizielle Internetstandards definiert ist. Um &irc; zu benutzen, müssen Sie eine Verbindung zu einem Server herstellen und dann einen Kanal betreten (entspricht einem Chatroom) oder private Verbindungen herstellen.

source: To connect to a server and channel, open &konversation;. The <guilabel>Server List</guilabel> screen appears.
de: Um eine Verbindung zu einem Server herzustellen, starten Sie &konversation;. Der Dialog <guilabel>Serverliste</guilabel> erscheint.

source: <screeninfo>Server List</screeninfo>
de: <screeninfo>Serverliste</screeninfo>

source: <phrase>Server List</phrase>
de: <phrase>Serverliste</phrase>

source: The list of configured &irc; <guilabel>Networks</guilabel> are listed here. An &irc; network is a collection of cooperating servers. You need only connect to one of the servers in the network to be connected to the entire &irc; network. Once connected, &konversation; will automatically join the <guilabel>Channels</guilabel> shown. When &konversation; is started for the first time, the <userinput><replaceable>Freenode</replaceable></userinput> network and <userinput><replaceable>#kde</replaceable></userinput> channel are already entered for you. Click on a network to select it.
de: Die konfigurierten &irc;-<guilabel>Netzwerke</guilabel> sind hier aufgelistet. Ein &irc;-Netzwerk ist ein Verbund mehrerer Server. Sie müssen nur zu einem der Server eines Netzwerks eine Verbindung herstellen, um mit dem gesamten &irc;-Netzwerk verbunden zu sein. Sobald eine Verbindung vorhanden ist, werden automatisch die aufgelisteten <guilabel>Kanäle</guilabel> betreten. Beim ersten Start von &konversation; sind das Netzwerk <userinput><replaceable>Freenode</replaceable></userinput> und der Kanal <userinput><replaceable>#kde</replaceable></userinput> bereits vorkonfiguriert. Klicken Sie auf ein Netzwerk, um es auszuwählen.

source: Click here to define a new <guilabel>Network</guilabel>, including the server to connect to, and the <guilabel>Channels</guilabel> to automatically join once connected. See <link linkend="serverlist">Defining new networks, servers, and auto join channels</link> for more information.
de: Klicken Sie hier, um ein neues <guilabel>Netzwerk</guilabel>, den Server mit dem verbunden werden soll sowie die Kanäle, die automatisch betreten werden sollen, zu konfigurieren. Weitere Informationen dazu finden Sie im Abschnitt <link linkend="serverlist">Konfiguration von neuen Netzwerken, Servern und Kanälen zum automatischen Betreten</link>.

source: Click here to connect to the selected &irc; network and channel.
de: Klicken Sie hier, um eine Verbindung zum ausgewählten &irc;-Netzwerk und Kanal herzustellen.

source: When you click the <guibutton>Connect</guibutton> button the first time you open &konversation;, you may see the following message, telling you that your default <guilabel>identity</guilabel> is not set up correctly.
de: Wenn Sie den Knopf <guibutton>Verbinden</guibutton> beim ersten Start von &konversation; drücken, wird eventuell eine Meldung angezeigt, die darauf hinweist, dass Ihre Standard-<guilabel>Identität</guilabel> nicht korrekt eingerichtet ist.

source: <screeninfo>Check Identities</screeninfo>
de: <screeninfo>Identitäten überprüfen</screeninfo>

source: <phrase>Check Identities</phrase>
de: <phrase>Identitäten überprüfen</phrase>

source: The first time you open &konversation; it obtains information about the current user from the operating system and fills in defaults for the Identity. If the operating system user information is not complete, for example, no Full Name is defined, you may see the message above. To correct this problem, click <guibutton>Edit Identity...</guibutton> and see <link linkend="identity">Setting your identity</link> for more information.
de: Beim ersten Start von &konversation; werden Standardeinstellungen für die Identität aus Informationen des &OS;s über Ihr Benutzerkonto eingetragen. Falls diese Informationen nicht vollständig sind, wie z. B. wenn kein vollständiger Name angegeben ist, wird die oben dargestellte Meldung angezeigt. Um das Problem zu beheben, drücken Sie den Knopf <guibutton>Identität ändern ...</guibutton> und fahren Sie fort, wie im Abschnitt <link linkend="identity">Einstellen Ihrer Identität</link> beschrieben.

source: The <interface>Main</interface> screen will be displayed showing the messages sent by the server to the client. (If &konversation; will not connect to the server, see <link linkend="faq">Questions and Answers</link>.) When the server messages have finished scrolling past, &konversation; will join the channel or channels chosen.
de: Im <interface>Haupt</interface>-Fenster werden nun die vom Server gesendeten Meldungen angezeigt. Falls &konversation; keine Verbindung zum Server herstellt, lesen Sie bitte den Abschnitt <link linkend="faq">Fragen und Antworten</link>. Sobald die Meldungen des Servers vollständig sind, werden die ausgewählten Kanäle automatisch betreten.

source: Channel.
de: Kanal

source: <phrase>Channel</phrase>
de: <phrase>Kanal</phrase>

source: This is called the <interface>Input Line</interface>. To send a message to everyone in the channel, type the message here and press &Enter;. Your message, as well as everyone else's messages appear in the channel scroll above. Each message is preceded by the time and user's &i18n-nickname;.
de: Dies ist die <interface>Eingabezeile</interface>. Um eine Nachricht an alle Benutzer des Kanals zu senden, geben Sie sie hier ein und drücken Sie die &Enter;taste. Ihre Nachricht sowie die Nachrichten der anderen Benutzer werden im Textfeld über der Eingabezeile angezeigt. Vor jeder Nachricht stehen die Zeit, zu der sie gesendet wurde und der &i18n-Nickname; des Senders.

source: You may join additional servers and channels. Each server, channel, channel list, and other screen gets a separate tab here. To display a list of available channels, see <link linkend="list-channels">Listing available channels</link>. To join a channel, type: <userinput><command>/join</command> <replaceable>#channelname</replaceable></userinput> in the Input Line. (The <userinput>#</userinput> is required.) You may also type <userinput><command>/j</command></userinput> as a shorthand to <userinput><command>/join</command></userinput>. To leave a channel, just type <userinput><command>/part</command></userinput>. To switch the display to a different server or channel, click the corresponding tab.
de: Sie können mehrere Kanäle, auch auf mehreren Servern, gleichzeitig benutzen. Die Server, Kanäle, Kanallisten usw. werden jeweils in einem eigenen Unterfenster angezeigt. Informationen zum Anzeigen einer Liste der verfügbaren Kanäle finden Sie im Abschnitt <link linkend="list-channels">Auflisten der verfügbaren Kanäle</link>. Um einen Kanal zu betreten, geben Sie den Befehl <userinput><command>/join</command> <replaceable>#Kanalname</replaceable></userinput> in der Eingabezeile ein (Das Zeichen <userinput>#</userinput> ist notwendig.). Sie können auch <userinput><command>/j</command></userinput> als Abkürzung für <userinput><command>/join</command></userinput> eingeben. Um einen Kanal zu verlassen, geben Sie den Befehl <userinput><command>/part</command></userinput> ein. Um einen anderen Server oder Kanal anzuzeigen, klicken Sie auf das entsprechende Unterfenster.

source: This is called the <interface>Nick Panel</interface>. It lists the &i18n-nickname;s of all the users who have joined the channel, including yourself.
de: Dies ist die <interface>Benutzerliste</interface>. Sie zeigt die &i18n-Nickname;n aller Personen an, die den Kanal betreten haben (auch Ihren).

source: That's the basics, for more detailed information, read on...
de: Dies waren die Grundlagen. Im Folgenden werden Details erklärt ...

source: Setting your identity
de: Einstellen Ihrer Identität

source: Before you start using &konversation; regularly, you should set how you will be identified on the network.
de: Bevor Sie mit der regelmäßigen Benutzung von &konversation; beginnen, sollten Sie einstellen, wie Sie im Netzwerk bezeichnet werden möchten.

source: Click <menuchoice> <guisubmenu>Settings</guisubmenu> <guisubmenu>Identities</guisubmenu> </menuchoice> on the main menu. <action>The <guilabel>Identities</guilabel> screen will appear. You can also display the <guilabel>Identities</guilabel> screen by clicking the <guibutton>Edit</guibutton> button on the <guilabel>Edit Network</guilabel> or <guilabel>New Network</guilabel> screen.</action>
de: Klicken Sie dazu in der Menüleiste auf den Eintrag <menuchoice><guisubmenu>Einstellungen</guisubmenu> <guisubmenu>Identitäten ...</guisubmenu></menuchoice>. <action>Der Dialog <guilabel>Identitäten</guilabel> wird geöffnet. Sie können diesen Dialog auch anzeigen, indem Sie im Dialog <guilabel>Neues Netzwerk</guilabel> oder im Dialog <guilabel>Netzwerk bearbeiten</guilabel> den Knopf <guibutton>Bearbeiten</guibutton> drücken.</action>

source: <screeninfo>Identities (General tab)</screeninfo>
de: <screeninfo>Identitäten (Karteikarte „Allgemein“)</screeninfo>

source: <phrase>Identities (General tab)</phrase>
de: <phrase>Identitäten (Karteikarte „Allgemein“)</phrase>

source: Click here to select an <guilabel>Identity</guilabel> to edit.
de: Klicken Sie hier, um eine <guilabel>Identität</guilabel> zur Bearbeitung auszuwählen.

source: Use these buttons to <guibutton>Add</guibutton>, <guibutton>Duplicate</guibutton>, <guibutton>Rename</guibutton>, or <guibutton>Remove</guibutton> an <guilabel>Identity</guilabel>.
de: Benutzen Sie diese Knöpfe zum <guibutton>Hinzufügen</guibutton>, <guibutton>Duplizieren</guibutton>, <guibutton>Umbenennen</guibutton> oder <guibutton>Entfernen</guibutton> einer Identität.

source: Enter your real name here. &irc; is not intended to keep you hidden from your friends or enemies. Keep this in mind if you are tempted to behave maliciously. A fake "real name" can be a good way to mask your gender from all the nerds out there, but the PC you use can always be traced so you will never be truly anonymous.
de: Geben Sie hier Ihren echten Namen an. &irc; ist nicht dazu konzipiert, Sie vor anderen Personen zu verstecken. Ein gefälschter „Realname“ ist zwar eine gute Methode, um beispielsweise Ihr Geschlecht vor anderen Benutzern zu verbergen, der PC, den Sie verwenden, kann jedoch immer zurückverfolgt werden. Sie sind also nie vollständig anonym.

source: Use these buttons to <guibutton>Add</guibutton> or <guibutton>Remove</guibutton> a &i18n-nickname;.
de: Benutzen Sie diese Knöpfe zum <guibutton>Hinzufügen</guibutton> oder <guibutton>Entfernen</guibutton> eines &i18n-Nickname;ns.

source: This is your list of &i18n-nickname;s. A &i18n-nickname; is the name that other users will know you by. You may use any name you desire. The first character must be a letter. Other characters may be letters, numbers, or the special characters <literal>-[]\`_^{}|</literal>.
de: Dies ist die Liste Ihrer &i18n-Nickname;n. Ein &i18n-Nickname; ist der Name, unter dem Sie anderen Benutzern angezeigt werden. Sie können dazu jeden beliebigen Namen verwenden, das erste Zeichen muss allerdings ein Buchstabe sein. Die restlichen Zeichen können Buchstaben, Zahlen, oder die Sonderzeichen <literal>-[]\`_^{}|</literal> sein.

source: Since &i18n-nickname;s must be unique across an entire &irc; network, your desired name may be rejected by the server because someone else is already using that &i18n-nickname;. Enter alternate &i18n-nickname;s for yourself. If your first choice is rejected by the server, &konversation; will try the alternate &i18n-nickname;s.
de: Da innerhalb eines &irc;-Netzwerks jeder &i18n-Nickname; nur einmal vorkommen darf, ist es möglich, dass der von Ihnen gewünschte Name vom Server nicht akzeptiert wird, weil er von einem anderen Benutzer bereits verwendet wird. Geben Sie daher alternative &i18n-Nickname;n ein. Wenn der erste &i18n-Nickname; nicht angenommen wird, versucht &konversation; automatisch, einen der alternativen &i18n-Nickname;n zu verwenden.

source: According to RFC 2812, the maximum &i18n-nickname; length is 9, but this is actually determined by the server. To determine the maximum for a server, connect to the server. In the <interface>Server Messages</interface> tab, look for a <computeroutput>[Support]</computeroutput> message. For example:
de: Nach dem Standard RFC 2812 beträgt die maximale Länge für &i18n-Nickname;n 9 Zeichen, dies wird aber von den Servern unterschiedlich gehandhabt. Um die maximal erlaubte Länge für einen bestimmten Server festzustellen, stellen Sie eine Verbindung zu diesem Server her. Suchen Sie im entsprechenden Unterfenster mit den <interface>Server-Meldungen</interface> nach einer <computeroutput>[Support]</computeroutput>-Meldung. Diese sieht z. B. so aus:

source: The <computeroutput>NICKLEN</computeroutput> parameter specifies the maximum &i18n-nickname; length.
de: Der Parameter <computeroutput>NICKLEN</computeroutput> zeigt die maximal erlaubte Länge für &i18n-Nickname;n an.

source: Use these buttons to change the order of the &i18n-nickname;s. The top &i18n-nickname; is tried first, then the next &i18n-nickname;, and so on.
de: Benutzen Sie diese Knöpfe, um die Reihenfolge der &i18n-Nickname;n zu ändern. &konversation; versucht zuerst, den obersten &i18n-Nickname;n zu benutzen, dann den darunter usw.

source: If you have registered your &i18n-nickname; with the &irc; network, enter the service and password to authenticate your &i18n-nickname;. When &konversation; connects, it will automatically send <userinput><command>/msg</command> <replaceable>service</replaceable> <command>IDENTIFY</command> <replaceable>password</replaceable></userinput> to the server. If you don't know what this is, leave these boxes blank.
de: Falls Sie Ihren &i18n-Nickname;n im &irc;-Netzwerk registriert haben, geben Sie den Dienst und das Passwort zur Anmeldung an. &konversation; wird dann bei der Verbindungsherstellung den Befehl <userinput><command>/msg</command> <replaceable>Dienst</replaceable> <command>IDENTIFY</command> <replaceable>Passwort</replaceable></userinput> ausführen. Falls Sie nicht wissen, was damit gemeint ist, lassen Sie diese Felder einfach leer.

source: Click the <guilabel>Away</guilabel> tab.
de: Klicken Sie auf die Karteikarte <guilabel>Abwesend</guilabel>.

source: <screeninfo>Identities (Away tab)</screeninfo>
de: <screeninfo>Identitäten (Karteikarte „Abwesend“)</screeninfo>

source: <phrase>Identities (Away tab)</phrase>
de: <phrase>Identitäten (Karteikarte „Abwesend“)</phrase>

source: Enter a &i18n-nickname; that indicates you are away. Whenever you perform an <userinput><command>/away </command><replaceable>msg</replaceable></userinput> command in any channel joined with this <guilabel>Identity</guilabel>, &konversation; will automatically change your &i18n-nickname; to the <guilabel>Away nickname</guilabel>. Other users will be able to tell you are away from your computer. Whenever you perform an <userinput><command>/away</command></userinput> command in any channel in which you are away, &konversation; will automatically change your &i18n-nickname; back to the original. If you do not wish to automatically change your &i18n-nickname; when going away, leave blank.
de: Geben Sie hier einen &i18n-Nickname;n an, der anderen Benutzern anzeigt, dass Sie abwesend sind. Immer wenn Sie den Befehl <userinput><command>/away</command></userinput> in einem Kanal ausführen, den Sie mit der jeweiligen Identität betreten haben, ändert &konversation; Ihren &i18n-Nickname;n automatisch zum <guilabel>Spitznamen bei Abwesenheit</guilabel>. Andere Benutzer können daran erkennen, dass Sie nicht an Ihrem Rechner anwesend sind. Wenn Sie den Befehl <userinput><command>/away</command></userinput> in einem Kanal ausführen, in dem Sie abwesend sind, setzt &konversation; Ihren &i18n-Nickname;n automatisch wieder zurück.

source: If you check this box, whenever you perform an <userinput><command>/away</command></userinput> command, a horizontal line will appear in the channel, marking the point where you went away. Other &irc; users do not see this horizontal line.
de: Wenn Sie dieses Ankreuzfeld aktivieren, wird eine horizontale Linie im Kanal angezeigt, die den Punkt markiert, ab dem Sie abwesend sind, sobald Sie den Befehl <userinput><command>/away</command></userinput> ausführen. Die anderen Benutzer sehen diese Linie nicht.

source: If you check this box, &konversation; will automatically send the <guilabel>Away message</guilabel> to all channels joined with this <guilabel>Identity</guilabel>. <userinput><replaceable>%s</replaceable></userinput> is replaced with <userinput><replaceable>msg</replaceable></userinput>. Whenever you perform an <userinput><command>/away</command></userinput> command, the <guilabel>Return message</guilabel> will be displayed in all channels joined with this <guilabel>Identity</guilabel>.
de: Wenn Sie dieses Ankreuzfeld aktivieren, sendet &konversation; automatisch eine <guilabel>Abwesenheitsnachricht</guilabel> an alle Kanäle, die Sie mit der entsprechenden <guilabel>Identität</guilabel> betreten haben, sobald Sie abwesend sind. <userinput><replaceable>%s</replaceable></userinput> wird durch <userinput><replaceable>msg</replaceable></userinput> ersetzt. Wenn Sie wieder anwesend sind, wird eine <guilabel>Rückkehrnachricht</guilabel> gesendet.

source: Away messages are often considered annoying by other users. Use this option carefully, with consideration for your fellow &irc; users.
de: Abwesenheitsnachrichten werden von anderen Benutzern oft als störend empfunden. Verwenden Sie diese Optionen daher umsichtig und denken Sie an die anderen &irc;-Benutzer.

source: Click the <guilabel>Advanced</guilabel> tab.
de: Klicken Sie auf die Karteikarte <guilabel>Erweitert</guilabel>.

source: <screeninfo>Identities (Advanced tab)</screeninfo>
de: <screeninfo>Identitäten (Karteikarte „Erweitert“)</screeninfo>

source: <phrase>Identities (Advanced tab)</phrase>
de: <phrase>Identitäten (Karteikarte „Erweitert“)</phrase>

source: You can enter a command here that will be executed before connecting to the server. If this identity is used for more than one server, the command will be executed for each server.
de: Hier können Sie einen Befehl eingeben, der ausgeführt wird, bevor &konversation; eine Verbindung zum Server herstellt. Falls die Identität für mehrere Server verwendet wird, wird der Befehl für jeden Server ausgeführt.

source: This setting affects how characters you type are encoded for sending to the server. It also affects how messages are displayed. When you first open &konversation;, it automatically retrieves this setting from the operating system. If you seem to be having trouble seeing other user's messages correctly, try changing this setting.
de: Diese Einstellung legt fest, wie die Zeichen, die Sie eingeben, zum Senden an den Server kodiert werden. Dies beeinflusst auch die Darstellung von Nachrichten. Beim ersten Start von &konversation; wird diese Einstellung automatisch anhand von Informationen des Betriebssystems vorgenommen. Falls dadurch Nachrichten von anderen Benutzern nicht korrekt angezeigt werden, ändern Sie diese Einstellung.
