Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/extragear-network/konversation.po
Languages: de

source: Scripting
de: Skriptunterstützung

source: &konversation; comes with some handy scripts you can run from the program. To run a script, in a channel, query, DCC, or server tab, type a command of the form
de: &konversation; liefert einige Skripte mit, die Sie aus dem Programm heraus ausführen können. Geben Sie dazu einen Befehl in folgender Form ein:

source: <command>/exec </command> <replaceable>script</replaceable> [<replaceable>parameters</replaceable>]
de: <command>/exec</command> <replaceable>Skript</replaceable> [<replaceable>Parameter</replaceable>]

source: which executes the script named <userinput><replaceable>script</replaceable></userinput> passing it (optional) <userinput><replaceable>parameters</replaceable></userinput>.
de: Dadurch wird das <userinput><replaceable>Skript</replaceable></userinput> ausgeführt, optional mit den gegebenen <userinput><replaceable>Parametern</replaceable></userinput>.

source: For example, type the following command in a channel tab
de: Geben Sie beispielsweise folgenden Befehl in einem Kanal ein

source: to send your &kde; and &Qt; version numbers to the channel.
de: um Ihre &kde;- und &Qt;-Versionsnummern an den Kanal zu senden.

source: executes the <userinput><replaceable>cmd</replaceable></userinput> script, passing it <userinput><replaceable>uname -a</replaceable></userinput>. This sends your &Linux; version string to the channel.
de: führt das Skript <userinput><replaceable>cmd</replaceable></userinput> mit dem Parameter <userinput><replaceable>uname -a</replaceable></userinput> aus. Damit werden Informationen Ihres &Linux;-&OS;s (Ausgabe von „uname -a“) an den Kanal gesendet.

source: To learn more about the scripts installed with &konversation; please see the <link linkend="scripts_ref">Script Reference Guide</link>
de: Weitere Informationen über die mit &konversation; mitgelieferten Skripte finden Sie im Abschnitt <link linkend="scripts_ref">Skript-Referenz</link>.

source: To get a list of all available scripts, type the following command in a &konsole; screen.
de: Um eine Liste der verfügbaren Skripte zu erhalten, geben Sie folgenden Befehl in einer &konsole; ein:

source: You can write your own scripts. Scripts are shell scripts and can be written in any shell language, such as bash, perl, or python. When &konversation; runs a script, the first two parameters sent to the script are:
de: Sie können Ihre eigenen Skripte für &konversation; schreiben. Dazu können Skriptsprachen wie Bash, Perl oder Python verwendet werden. Die ersten zwei Parameter, die von &konversation; an ein Skript übergeben werden, sind:

source: The address of the server.
de: Die Adresse des Servers

source: The channel name.
de: Der Name des Kanals

source: Here is a sample shell script (cmd).
de: Hier sehen Sie das Shell-Skript „cmd“:

source: #!/bin/sh # Executes a command and prints the output into Konversation. SERVER=$1; TARGET=$2; shift;shift; $@ | while read line; do qdbus org.kde.konversation /irc say $SERVER "$TARGET" "$@: $line"; done
de: #!/bin/sh # Führt einen Befehl aus und sendet die Ausgabe an Konversation. SERVER=$1; TARGET=$2; shift;shift; $@ | while read line; do qdbus org.kde.konversation /irc say $SERVER "$TARGET" "$@: $line"; done

source: Notice that the script uses qdbus to communicate with &konversation;. The <computeroutput>say</computeroutput> command causes the output to be sent to the channel as a normal message. To display something in the tab without sending it to other users, use <computeroutput>info</computeroutput> instead. Look at the existing script files for more examples of writing scripts.
de: Zur Kommunikation zwischen Skript und &konversation; wird „qdbus“ verwendet. Der Befehl <computeroutput>say</computeroutput> bewirkt, dass die Ausgabe als normale Nachricht an den Kanal gesendet wird. Um Informationen anzuzeigen, ohne sie an andere Benutzer zu senden, verwenden Sie den Befehl <computeroutput>info</computeroutput>. Verwenden Sie die vorhandenen Skripte als weitere Beispiele.

source: To be able to run a script you have written, you must install it by copying it to <filename class="directory">`kde4-config --install data`konversation/scripts</filename> or to <filename class="directory">`kde4-config --localprefix`share/apps/konversation/scripts</filename>. You must also give the file execute privilege, for example <userinput><replaceable>chmod a+x myscript</replaceable></userinput>.
de: Um ein eigenes Skript in &konversation; verwenden zu können, müssen Sie es entweder nach <filename class="directory">`kde4-config --install data`konversation/scripts</filename> oder nach <filename class="directory">`kde4-config --localprefix`share/apps/konversation/scripts</filename> kopieren oder verschieben. Außerdem müssen Sie die Datei als ausführbar markieren, beispielsweise mit dem Befehl <userinput>chmod a+x <replaceable>Skriptdatei</replaceable></userinput>.

source: Script Reference Guide
de: Skript-Referenz

source: &konversation; comes with several scripts installed by default, please refer to this guide to learn how to use them.
de: Mit &konversation; werden standardmäßig einige Skripte mitgeliefert. Deren Benutzung wird im Folgenden erklärt.

source: <command>/exec </command> <replaceable>bug</replaceable> [<replaceable>Bug Number|Search String</replaceable>]
de: <command>/exec</command> <replaceable>bug</replaceable> [<replaceable>Fehlernummer|Suchmuster</replaceable>]

source: This script is used to open your browser to search for the given string or bug number on <ulink url="https://bugs.kde.org/">&kde;'s Bugzilla</ulink>.
de: Öffnet Ihren Browser, um auf <ulink url="https://bugs.kde.org/">bugs.kde.org</ulink> nach dem Fehlerbericht mit der gegebenen Nummer oder Beschreibung zu suchen.

source: Example: To open your browser to search for bug 123456
de: Beispiel: Öffnen des Browsers und Suche nach Fehlerbericht 123456

source: Sample action: The default browser in your &kde; &systemsettings; should open to <replaceable>http://bugs.kde.org/show_bug.cgi?id=123456</replaceable>
de: <action>Ihr in den &kde;-&systemsettings; fetsgelegter Standardbrowser wird geöffnet, um die Webseite <replaceable>http://bugs.kde.org/show_bug.cgi?id=123456</replaceable> anzuzeigen</action>

source: <command>/exec </command> <replaceable>cmd</replaceable> [<replaceable>command line arguments</replaceable>]
de: <command>/exec</command> <replaceable>cmd</replaceable> [<replaceable>Befehl [Argumente]</replaceable>]

source: This script is used to have the output of the command line arguments to be written to your current channel.
de: Dieses Skript kann verwendet werden, um die Ausgabe von Befehlen (ausgeführt mit gegebenen Argumenten) an den Kanal zu senden.

source: Example: To show everyone in your current channel what version of &konversation; you have installed.
de: Beispiel: Um den anderen Benutzern in Ihrem aktuellen Kanal mitzuteilen, welche Version von &konversation; Sie installiert haben:

source: Sample output: <replaceable>Konversation: 1.2</replaceable>
de: Ausgabe: <replaceable>Konversation: 1.2</replaceable>

source: WARNING! The output of the entire command is posted to everyone in the current channel tab! Please use with care.
de: <emphasis>Hinweis:</emphasis> Die gesamte Ausgabe des Befehls wird an alle Benutzer im aktuellen Kanal gesendet. Bedenken Sie dies, bevor Sie dieses Skript verwenden.

source: This script when run will output a Random Fortune.
de: Dieses Skript gibt ein zufällig gewähltes Zitat aus.

source: Example: To output a random fortune to your current channel tab.
de: Beispiel: Um ein zufällig gewähltes Zitat an den aktuellen Kanal zu senden:

source: Sample output: <replaceable>Random Fortune: Never make any mistaeks. -- Anonymous, in a mail discussion about to a kernel bug report</replaceable>
de: Beispiel-Ausgabe: <replaceable>Random Fortune: Never make any mistaeks. -- Anonymous, in a mail discussion about to a kernel bug report</replaceable>

source: <command>/exec </command> <replaceable>gauge</replaceable> [<replaceable>percentage</replaceable>]
de: <command>/exec</command> <replaceable>gauge</replaceable> [<replaceable>Prozentsatz</replaceable>]

source: This script shows a simple text based progress bar for the given percentage.
de: Dieses Skript gibt einen einfachen, textbasierten Statusbalken für den gegebenen Prozentsatz aus.

source: Example: To output a progress bar with 50% completion to the current channel tab.
de: Beispiel: Um einen Statusbalken für 50% an den aktuellen Kanal zu senden:

source: Sample output: <replaceable>Beer load [ | ] 50%</replaceable>
de: Ausgabe: <replaceable>Beer load [ | ] 50%</replaceable>

source: This script is used to output the result of the command "kde4-config --version"
de: Dieses Skript führt den Befehl „kde4-config --version“ aus.

source: Example: To output your current kdeversion.
de: Beispiel: Um Ihre aktuelle &kde;-Version auszugeben:

source: Sample output: <replaceable>Qt: 4.5.1 KDE: 4.2.85 (KDE 4.2.85 (KDE 4.3 Beta1)) kde4-config: 1.0</replaceable>
de: Ausgabe: <replaceable>Qt: 4.5.1 KDE: 4.2.85 (KDE 4.2.85 (KDE 4.3 Beta1)) kde4-config: 1.0</replaceable>

source: <command>/exec </command> <replaceable>mail</replaceable> [<replaceable>KMail Email Folder</replaceable>]
de: <command>/exec</command> <replaceable>mail</replaceable> [<replaceable>Ordner in KMail</replaceable>]

source: This script is used to show the current unread mail and total mail count in KMail.
de: Dieses Skript gibt die Anzahl der ungelesenen sowie die Gesamtanzahl der E-Mails im gegebenen Ordner in KMail aus.

source: Example: To output the current unread mail count in your inbox folder.
de: Beispiel: Zum Ausgeben der Anzahl von ungelesenen E-Mails in Ihrem Posteingang:

source: <command>/exec </command> <replaceable>mail inbox</replaceable>
de: <command>/exec</command> <replaceable>mail Posteingang</replaceable>

source: Sample output: <replaceable>Email folder inbox has 30 unread messages, out of 800</replaceable>
de: Beispiel-Ausgabe: <replaceable>Email folder Posteingang has 30 unread messages, out of 800</replaceable>

source: <command>/exec </command> <replaceable>media</replaceable> [<replaceable>audio|video|{player}</replaceable>]
de: <command>/exec </command> <replaceable>media</replaceable> [<replaceable>audio|video|{Programm}</replaceable>]

source: This is a Now Playing script for various media players. It also features a method to show Now Playing information for only audio players, or only video players via the optional command arguments <replaceable>audio</replaceable> and <replaceable>video</replaceable>. Additionally, it's possible to specify the media player you wish to query.
de: Dieses Skript gibt Informationen über den gerade laufenden Musiktitel oder Film aus. Es unterstützt verschiedene Medienspieler. Mit den optionalen Parametern <replaceable>audio</replaceable> bzw. <replaceable>video</replaceable> können Sie festlegen, ob Informationen über momentan laufende Musik oder über Filme ausgegeben werden sollen. Außerdem können Sie das Programm angeben, von dem die Informationen abgefragt werden sollen.

source: The following media players are supported: Amarok (audio), JuK (audio), Noatun (audio, video), Kaffeine (video, audio), KMPlayer (video, audio), KPlayer (video, audio), KsCD (audio), kdetv (video), Yammi (audio), Audacious (audio), MPD (audio).
de: Folgende Medienspieler werden unterstützt: Amarok (Audio), JuK (Audio), Noatun (Audio, Video), Kaffeine (Video, Audio), KMPlayer (Video, Audio), KPlayer (Video, Audio), KsCD (Audio), kdetv (Video), Yammi (Audio), Audacious (Audio), MPD (Audio).

source: Example: To output your currently playing song in Amarok.
de: Beispiel: Zum Ausgeben des momentan in Amarok laufenden Musiktitels:

source: Sample output: <replaceable>* user is listening to You Give Love A Bad Name by Bon Jovi on Slippery When Wet [Amarok]</replaceable>
de: Beispiel-Ausgabe: <replaceable>* Spitzname is listening to You Give Love A Bad Name by Bon Jovi on Slippery When Wet [Amarok]</replaceable>

source: <command>/exec </command> <replaceable>sayclip</replaceable> [<replaceable>Optional Delay</replaceable>]
de: <command>/exec </command> <replaceable>sayclip</replaceable> [<replaceable>Verzögerung</replaceable>]

source: This script outputs the contents of klipper to the current channel tab with a delay to provide flood protection.
de: Dieses Skript sendet den Inhalt von Klipper an den aktuellen Kanal. Um Floods zu vermeiden, wird dazu optional die gegebene Verzögerung verwendet.

source: Example: To output the contents of klipper with a 1 second delay.
de: Beispiel: Zum Ausgeben des Inhalts von Klipper mit einer Sekunde Verzögerung:

source: Sample output: <replaceable>Konversation sure is awesome!</replaceable>
de: Beispiel-Ausgabe: <replaceable>&konversation; ist toll!</replaceable>

source: This script outputs some detailed information about your system by combining the outputs of several commands and formatting them appropriately.
de: Dieses Skript gibt detaillierte Informationen über Ihr System aus. Diese werden aus der Ausgabe mehrerer Befehle zusammengesetzt und entsprechend formatiert.

source: Example: To output some information about your system to the current channel tab.
de: Beispiel: Zum Senden von Systeminformationen an den aktuellen Kanal:

source: Sample output: <replaceable>Sysinfo for 'user-desktop': Linux 2.6.28-12-generic running KDE 4.2.85 (KDE 4.2.85 (KDE 4.3 Beta1)), CPU: Intel(R) Core 2 Quad CPU Q9450 @ 2.66GHz at 2666 MHz (5333 bogomips), HD: 370/445GB, RAM: 1965/2012MB, 232 proc's, 98.15d up</replaceable>
de: Beispiel-Ausgabe: <replaceable>Sysinfo for 'user-desktop': Linux 2.6.28-12-generic running KDE 4.2.85 (KDE 4.2.85 (KDE 4.3 Beta1)), CPU: Intel(R) Core 2 Quad CPU Q9450 @ 2.66GHz at 2666 MHz (5333 bogomips), HD: 370/445GB, RAM: 1965/2012MB, 232 proc's, 98.15d up</replaceable>

source: <command>/exec </command> <replaceable>tinyurl</replaceable> [<replaceable>Link Address</replaceable>]
de: <command>/exec </command> <replaceable>tinyurl</replaceable> [<replaceable>Verknüpfungs-Adresse</replaceable>]

source: This script uses Tinyurl's api to turn the given link into a tinyurl that is then sent to the current channel tab.
de: Dieses Skript verwendet die API von Tinyurl, um die gegebene Verknüpfungs-Adresse zu verkürzen und an den aktuellen Kanal zu senden.

source: Example: To give someone a short link to http://konversation.kde.org
de: Beispiel: Um eine kürzere Verknüpfung auf http://konversation.kde.org zu senden:

source: Sample output: <replaceable>http://tinyurl.com/n3pdum</replaceable>
de: Beispiel-Ausgabe: <replaceable>http://tinyurl.com/n3pdum</replaceable>

source: This script outputs the result of the command "uptime" and formats it appropriately.
de: Dieses Skript sendet die Ausgabe des Befehls „uptime“ und formatiert sie geeignet.

source: Example: To show off your rock solid 98 day uptime.
de: Beispiel: Wenn Ihr Rechner seit 98 Tagen läuft:

source: Sample output: <replaceable>Uptime: 98 days, 15 hours and 2 minutes</replaceable>
de: Beispiel-Ausgabe: <replaceable>Uptime: 98 days, 15 hours and 2 minutes</replaceable>

source: All these scripts have predefined command aliases. In &konversation;'s settings dialog select <menuchoice><guimenu>Behavior</guimenu> <guimenuitem>Command Aliases</guimenuitem></menuchoice> to view, add, remove or edit command aliases.
de: Für diese Skripte sind standardmäßig Befehlsaliase definiert. Zum Hinzufügen, Entfernen oder Ändern von Befehlsaliasen klicken Sie auf den Eintrag <menuchoice><guimenu>Verhalten</guimenu><guimenuitem>Befehlsaliase</guimenuitem></menuchoice>.

source: Command Reference
de: Befehlsreferenz

source: The main &konversation; window
de: Das Hauptfenster von &konversation;

source: The File Menu
de: Das Menü Datei

source: <shortcut> <keycap>F2</keycap> </shortcut> <guimenu>File</guimenu> <guimenuitem>Server List</guimenuitem>
de: <shortcut> <keycap>F2</keycap> </shortcut> <guimenu>Datei</guimenu> <guimenuitem>Serverliste ...</guimenuitem>

source: Displays the <link linkend="irc-basics">list of servers and channels</link>.
de: Zeigt die <link linkend="irc-basics">Serverliste</link> an.

source: <shortcut> <keycap>F7</keycap> </shortcut> <guimenu>File</guimenu> <guimenuitem>Quick Connect</guimenuitem>
de: <shortcut> <keycap>F7</keycap> </shortcut> <guimenu>Datei</guimenu> <guimenuitem>Schnell verbinden ...</guimenuitem>

source: Displays the <link linkend="quickconnect">Quick Connect</link> screen for connecting to a server.
de: Zeigt den Dialog <link linkend="quickconnect">Schnell verbinden</link> zum Herstellen einer Verbindung zu einem Server an.

source: <guimenu>File</guimenu> <guimenuitem>Reconnect</guimenuitem>
de: <guimenu>Datei</guimenu> <guimenuitem>Erneut verbinden</guimenuitem>

source: Reconnects to all servers that were disconnected by a network error or other problem.
de: Verbindet erneut mit allen Servern, deren Verbindung aufgrund von Netzwerkfehlern oder anderen Problemen getrennt wurde.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>J</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Join Channel</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>J</keycap></keycombo> </shortcut> <guimenu>Datei</guimenu> <guimenuitem>Kanal betreten ...</guimenuitem>

source: Displays a dialog for you to enter the name of a channel to join. Does the same thing as entering <command>/join <userinput>#channelname</userinput></command> in a channel or server tab.
de: Öffnet einen Dialog, in dem Sie einen Kanal eingeben können, der daraufhin betreten wird. Dies entspricht dem Befehl <command>/join <userinput>#Kanalname</userinput></command> in einem Kanal- oder Server-Unterfenster.

source: <shortcut> <keycombo action="simul">&Ctrl; &Shift;<keycap>A</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Global Away</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl; &Shift;<keycap>A</keycap></keycombo> </shortcut> <guimenu>Datei</guimenu> <guimenuitem>Globale Abwesenheit</guimenuitem>

source: Changes your &i18n-nickname; status to away in all channels.
de: Setzt Ihren Status in allen Kanälen auf abwesend.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Quit</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo> </shortcut> <guimenu>Datei</guimenu> <guimenuitem>Beenden</guimenuitem>

source: <action>Quits</action> &konversation;.
de: <action>Beendet &konversation;</action>.

source: The Edit Menu
de: Das Menü Bearbeiten

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>F</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Find Text...</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>F</keycap></keycombo> </shortcut> <guimenu>Bearbeiten</guimenu> <guimenuitem>Text suchen ...</guimenuitem>

source: Searches for text strings in the current screen.
de: Sucht im aktuellen Unterfenster nach Text.

source: <shortcut> <keycap>F3</keycap> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Find Next</guimenuitem>
de: <shortcut> <keycap>F3</keycap> </shortcut> <guimenu>Bearbeiten</guimenu> <guimenuitem>Weitersuchen</guimenuitem>

source: Searches again for text strings in the current screen using the previous search string.
de: Sucht im aktuellen Unterfenster erneut nach dem vorherigen Suchbegriff.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>L</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Clear Window</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>L</keycap></keycombo> </shortcut> <guimenu>Bearbeiten</guimenu> <guimenuitem>Fenster leeren</guimenuitem>

source: Clears the current screen.
de: Leert das aktuelle Unterfenster

source: <shortcut> <keycombo action="simul">&Ctrl; &Shift;<keycap>L</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Clear All Windows</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl; &Shift;<keycap>L</keycap></keycombo> </shortcut> <guimenu>Bearbeiten</guimenu> <guimenuitem>Alle Fenster leeren</guimenuitem>

source: Clears all screens.
de: Leert alle Unterfenster

source: The Insert Menu
de: Das Menü Einfügen

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>K</keycap></keycombo> </shortcut> <guimenu>Insert</guimenu> <guimenuitem>&irc; Color...</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>K</keycap></keycombo> </shortcut> <guimenu>Einfügen</guimenu> <guimenuitem>&irc;-Farbe ...</guimenuitem>

source: See <link linkend="color-msgs">Sending colorful messages</link>.
de: Siehe <link linkend="color-msgs">Versenden farbiger Nachrichten</link>

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>R</keycap></keycombo> </shortcut> <guimenu>Insert</guimenu> <guimenuitem>Marker Line</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>R</keycap></keycombo> </shortcut> <guimenu>Einfügen</guimenu> <guimenuitem>Markierungslinie</guimenuitem>

source: See <link linkend="rememberlines">Marking Channel and Query Logs</link>.
de: Siehe <link linkend="rememberlines">Markierungen in Protokollen</link>

source: <shortcut> <keycombo action="simul">&Alt; &Shift;<keycap>C</keycap></keycombo> </shortcut> <guimenu>Insert</guimenu> <guimenuitem>Special Character...</guimenuitem>
de: <shortcut> <keycombo action="simul">&Alt; &Shift;<keycap>C</keycap></keycombo> </shortcut> <guimenu>Einfügen</guimenu> <guimenuitem>Sonderzeichen ...</guimenuitem>

source: Used to enter special characters, such as foreign characters.
de: Ermöglicht die Eingabe von Sonderzeichen, wie z. B. fremdsprachigen Zeichen.

source: The Bookmarks Menu
de: Das Menü Lesezeichen

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>B</keycap></keycombo> </shortcut> <guimenu>Bookmarks</guimenu> <guimenuitem>Add Bookmark</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>B</keycap></keycombo> </shortcut> <guimenu>Lesezeichen</guimenu> <guimenuitem>Lesezeichen hinzufügen</guimenuitem>

source: Bookmarks current network &amp; channel.
de: Fügt ein Lesezeichen für das aktuelle Netzwerk und den Kanal hinzu.

source: <guimenu>Bookmarks</guimenu> <guimenuitem>Bookmark Tabs as Folder...</guimenuitem>
de: <guimenu>Lesezeichen</guimenu> <guimenuitem>Unterfenster als Lesezeichenordner ...</guimenuitem>

source: <action>Adds</action> all channels to a new menu item at the end of the bookmarks menu.
de: <action>Fügt alle geöffneten Kanäle in einem neuen Ordner zum Lesezeichenmenü hinzu.</action>

source: <guimenu>Bookmarks</guimenu> <guimenuitem>New Bookmark Folder...</guimenuitem>
de: <guimenu>Lesezeichen</guimenu> <guimenuitem>Neuer Lesezeichenordner ...</guimenuitem>

source: Creates a new bookmark folder.
de: Erstellt einen neuen Lesezeichenordner.

source: <guimenu>Bookmarks</guimenu> <guimenuitem>Edit Bookmarks...</guimenuitem>
de: <guimenu>Lesezeichen</guimenu> <guimenuitem>Lesezeichen bearbeiten ...</guimenuitem>

source: Opens bookmark editor.
de: Öffnet den Lesezeichen-Editor.

source: The Settings Menu
de: Das Menü Einstellungen

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>H</keycap></keycombo> </shortcut> <guimenu>Settings</guimenu> <guimenuitem>Show Nicklist</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>H</keycap></keycombo> </shortcut> <guimenu>Einstellungen</guimenu> <guimenuitem>Benutzerliste anzeigen</guimenuitem>

source: Hides (or displays) the panel of &i18n-nickname;s in channel tabs.
de: Zeigt die Benutzerliste in Kanälen an oder blendet sie aus.
