Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/extragear-network/konversation.po
Languages: de

source: Click this button to choose a font for &osd;. (<emphasis>Note: </emphasis> Not all fonts work. Luxi Sans 22 and Impact 22 are known to work.)
de: Drücken Sie diesen Knopf, um eine Schriftart für die OnScreen-Anzeige auszuwählen. (<emphasis>Hinweis:</emphasis> Nicht alle Schriftarten können verwendet werden. „Luxi Sans 22“ und „Impact 22“ funktionieren.)

source: Check the boxes here to select the types of messages you'd like to appear on screen.
de: Wählen Sie hier aus, bei welchen Arten von Nachrichten die OnScreen-Anzeige verwendet werden soll.

source: Drag the <interface>&osd; Preview</interface> to your desired position, then click the <guibutton>Apply</guibutton> button.
de: Ziehen Sie die <guilabel>OSD-Vorschau</guilabel> an die gewünschte Position und drücken Sie den Knopf <guibutton>Anwenden</guibutton>.

source: Sending colorful messages
de: Senden farbiger Nachrichten

source: You can add color to the messages you send in any channel. In the <interface>Input Line</interface> of any channel, start typing your message. Click the <inlinemediaobject> <imageobject> <imagedata fileref="format-text-color.png" format="PNG"/> </imageobject> <textobject> <phrase>Insert &irc; Color Button</phrase> </textobject> </inlinemediaobject> <guibutton>&irc; Color</guibutton> button or choose <menuchoice> <guisubmenu>Insert</guisubmenu> <guisubmenu>&irc; Color</guisubmenu> </menuchoice> on the main menu. <action>The <guilabel>&irc; Color Chooser</guilabel> screen will appear.</action>
de: Sie können farbige Nachrichten versenden. Geben Sie dazu eine Nachricht in der <interface>Eingabezeile</interface> ein. Setzen Sie nun den Cursor vor den Teil der Nachricht, der farbig gesendet werden soll und drücken Sie den Knopf <inlinemediaobject> <imageobject> <imagedata fileref="format-text-color.png" format="PNG"/> </imageobject> <textobject> <phrase>&irc;-Farbe einfügen</phrase> </textobject> </inlinemediaobject> <guibutton>&irc;-Farbe</guibutton> oder klicken Sie auf den Eintrag <menuchoice><guisubmenu>Einfügen</guisubmenu> <guisubmenu>&irc;-Farbe ...</guisubmenu></menuchoice> in der Menüleiste. <action>Der <guilabel>&irc;-Farbwähler</guilabel> wird geöffnet.</action>

source: The &irc; Color Chooser screen.
de: Der &irc;-Farbwähler

source: The &irc; Color Chooser screen
de: Der &irc;-Farbwähler

source: Choose a color and click <guibutton>OK</guibutton>. Continue typing your message in the <interface>Input Line</interface>. To change the color again, click the <guibutton>&irc; Color</guibutton> button. Choose a different color and click <guibutton>OK</guibutton>.
de: Wählen Sie eine Farbe aus und drücken Sie den Knopf <guibutton>OK</guibutton>. Wiederholen Sie diese Schritte, um weitere Teile der Nachricht farbig zu gestalten.

source: Configuring &i18n-nickname; themes
de: Design der Benutzerliste

source: You can change the icons displayed next to &i18n-nickname;s in the <interface>Nick Panel</interface> of channel tabs. To change the &i18n-nickname; theme, choose <menuchoice> <guisubmenu>Settings</guisubmenu> <guisubmenu>Configure Konversation</guisubmenu> </menuchoice> on the main menu. <action>The <guilabel>Configure</guilabel> screen will appear.</action> Click <guilabel>Interface</guilabel> to expand it, then click <guilabel>Nicklist Themes</guilabel> to display the <guilabel>Nicklist Themes</guilabel> screen.
de: Zum Ändern der Symbole, die neben den &i18n-Nickname;n in der <interface>Benutzerliste</interface> angezeigt werden, klicken Sie auf den Eintrag <menuchoice><guisubmenu>Einstellungen</guisubmenu> <guisubmenu>&konversation; einrichten ...</guisubmenu></menuchoice> in der Menüleiste. <action>Der <guilabel>Einrichtungsdialog</guilabel> wird geöffnet.</action> Klappen Sie den Abschnitt <guilabel>Oberfläche</guilabel> auf und klicken Sie auf <guilabel>Design der Benutzerliste</guilabel>.

source: The Themes screen.
de: Der Abschnitt „Design der Benutzerliste“ im Einrichtungsdialog

source: The Themes screen
de: Der Abschnitt „Design der Benutzerliste“ im Einrichtungsdialog

source: Click here to select the <guilabel>Nicklist Themes</guilabel> screen.
de: Klicken Sie hier, um den Abschnitt <guilabel>Design der Benutzerliste</guilabel> zu öffnen.

source: Select a theme.
de: Wählen Sie hier ein Design aus.

source: Sample icons are displayed here in the chosen theme.
de: Hier wird eine Vorschau für das ausgewählte Design angezeigt.

source: If you have downloaded a nick theme from elsewhere, click to install it.
de: Klicken Sie hier, um ein Design aus einer Datei zu installieren.

source: Configuring Quick Buttons
de: Einrichtung von Schnellschaltern

source: You can enable a feature to display <interface>Quick Buttons</interface> on the <link linkend="channel-screen-tour">Main</link> screen, eight <interface>Quick Buttons</interface> appear. To display the Quick Buttons, choose <menuchoice> <guisubmenu>Settings</guisubmenu> <guisubmenu>Configure Konversation</guisubmenu> </menuchoice> on the main menu. <action>The <guilabel>Configure</guilabel> screen will appear.</action> Click <guilabel>Interface</guilabel> to expand it, then click <guilabel>Chat Window</guilabel>. Check the <guilabel>Show quick buttons</guilabel> box and click <guibutton>OK</guibutton>.
de: Im <link linkend="channel-screen-tour">Hauptfenster</link> können mehrere <interface>Schnellschalter</interface> angezeigt werden. Um diese zu aktivieren, klicken Sie auf den Eintrag <menuchoice><guisubmenu>Einstellungen</guisubmenu> <guisubmenu>&konversation; einrichten ...</guisubmenu></menuchoice> in der Menüleiste. <action>Der <guilabel>Einrichtungsdialog</guilabel> wird geöffnet</action>. Klappen Sie den Abschnitt <guilabel>Oberfläche</guilabel> auf und klicken Sie auf <guilabel>Chatfenster</guilabel>. Aktivieren Sie das Ankreuzfeld <guilabel>Schnellschalter anzeigen</guilabel> und speichern Sie Ihre Änderungen, indem Sie den Knopf <guibutton>Anwenden</guibutton> oder <guibutton>OK</guibutton> drücken.

source: The buttons may be customized to your liking for performing often-used &irc; commands. To customize the <interface>Quick Buttons</interface>, choose <menuchoice> <guisubmenu>Settings</guisubmenu> <guisubmenu>Configure Konversation</guisubmenu> </menuchoice> on the main menu. <action>The <guilabel>Configure</guilabel> screen will appear.</action> Click <guilabel>Interface</guilabel> to expand it, then click <guilabel>Quick Buttons</guilabel> to display the <guilabel>Quick Buttons</guilabel> screen.
de: Den Schnellschaltern können beliebige &irc;-Befehle zugewiesen werden. Zur Einrichtung der <interface>Schnellschalter</interface> klicken Sie auf den Eintrag <menuchoice><guisubmenu>Einstellungen</guisubmenu> <guisubmenu>&konversation; einrichten ...</guisubmenu></menuchoice> in der Menüleiste. <action>Der <guilabel>Einrichtungsdialog</guilabel> wird geöffnet.</action> Klappen Sie den Abschnitt <guilabel>Oberfläche</guilabel> auf und klicken Sie auf <guilabel>Schnellschalter</guilabel>.

source: <screeninfo>The Quick Buttons screen</screeninfo>
de: <screeninfo>Der Abschnitt „Schnellschalter“ im Einrichtungsdialog</screeninfo>

source: <phrase>The Quick Buttons screen</phrase>
de: <phrase>Der Abschnitt „Schnellschalter“ im Einrichtungsdialog</phrase>

source: There are 8 default <interface>Quick Button</interface>s. Click on an entry to change it or use the buttons at the right side of the list to add or remove <interface>Quick Button</interface>s. The <guilabel>Button Name</guilabel> column is the name that will appear on the button in the <link linkend="channel-screen-tour">Main</link> screen. Keep the names short. The <guilabel>Button Action</guilabel> column is the action that will be performed when you click the <interface>Quick Button</interface>. Tips for creating actions are given on the screen.
de: Standardmäßig sind 8 <interface>Schnellschalter</interface> eingerichtet. Klicken Sie auf Einträge, um Sie zu bearbeiten. In der Spalte <guilabel>Schaltername</guilabel> werden die Beschriftungen der <interface>Schnellschalter</interface> angezeigt, die im <link linkend="channel-screen-tour">Hauptfenster</link> zu sehen sind. Weisen Sie den <interface>Schnellschaltern</interface> daher, wenn möglich, kurze Namen zu. In der Spalte <guilabel>Schalteraktion</guilabel> werden die Befehle angezeigt, die in die <interface>Eingabezeile</interface> eingefügt werden, wenn der jeweilige <interface>Schnellschalter</interface> gedrückt wird. Befehle, die mit <userinput><replaceable>%n</replaceable></userinput> enden, werden direkt ausgeführt. Unterhalb der Liste werden einige Platzhalter erklärt, die in den Befehlen verwendet werden können. Drücken Sie die entsprechenden Knöpfe zum <guibutton>Hinzufügen</guibutton> und <guibutton>Entfernen</guibutton> von <interface>Schnellschaltern</interface>.

source: Click <guibutton>OK</guibutton> to complete the changes.
de: Speichern Sie Ihre Änderungen mit <guibutton>Anwenden</guibutton> oder <guibutton>OK</guibutton>.

source: Example:
de: Beispiel:

source: <guilabel>Button Name</guilabel>: <userinput><replaceable>Msg</replaceable></userinput>
de: <guilabel>Schaltername</guilabel>: <userinput><replaceable>Msg</replaceable></userinput>

source: <guilabel>Button Action</guilabel>: <userinput><replaceable>Msg %u </replaceable></userinput> (there is a space after <userinput><replaceable>%u</replaceable></userinput>)
de: <guilabel>Schalteraktion</guilabel>: <userinput><replaceable>/msg %u </replaceable></userinput> (nach <userinput><replaceable>%u</replaceable></userinput> folgt ein Leerzeichen)

source: To use this button in the <link linkend="channel-screen-tour">Main</link> screen, click on a &i18n-nickname; in the <interface>Nick Panel</interface>, then click the button. <computeroutput>/MSG </computeroutput> will appear in the <interface>Input Line</interface> followed by the chosen &i18n-nickname;. Type a message you want to send to that person and press &Enter;. The message will be sent to the user. Only that user will see the message.
de: Klicken Sie nun im <link linkend="channel-screen-tour">Hauptfenster</link> auf einen &i18n-Nickname;n in der <interface>Benutzerliste</interface> und anschließend auf diesen Schnellschalter, so wird in der <interface>Eingabezeile</interface> der Befehl <computeroutput>/msg</computeroutput> gefolgt von dem ausgewählten &i18n-Nickname;n angezeigt. Nun können Sie eine Nachricht eingeben, die nur an den ausgewählten Benutzer gesendet wird (siehe <link linkend="irc-cmds">Häufig verwendete &irc;-Befehle</link>).

source: Sending and receiving files
de: Senden und empfangen von Dateien

source: You may send files via &irc; to other users online, or they may send you files.
de: Über &irc; können Dateien versandt werden.

source: WARNING: Never open a file someone sends you unless they are a trusted source. It could be a virus.
de: ACHTUNG: Öffnen Sie niemals eine Datei, die Ihnen gesendet wurde, wenn Sie dem Absender nicht vertrauen. Die Datei könnte Schadprogramme enthalten.

source: To send a file to someone in a channel, click with the &RMB; on the &i18n-nickname; of the person in the <interface>Nick Panel</interface> of the <link linkend="channel-screen-tour">Main</link> screen. Choose <menuchoice> <guisubmenu>Send File</guisubmenu> </menuchoice> <action>. A dialog appears for you to choose a file to send.</action> Next, a new <guilabel>DCC Status</guilabel> tab appears.
de: Um einem anderen Benutzer eine Datei zu senden, klicken Sie mit der &RMBn; auf den jeweiligen &i18n-Nickname;n in der <interface>Benutzerliste</interface>. Klicken Sie im Kontextmenü auf <menuchoice><guisubmenu>Datei senden ...</guisubmenu></menuchoice>. <action>Ein Dateiauswahldialog wird geöffnet.</action> Nach der Auswahl einer Datei wird das Unterfenster <guilabel>DCC-Status</guilabel> geöffnet.

source: <screeninfo>DCC Status tab</screeninfo>
de: <screeninfo>Das Unterfenster „DCC-Status“</screeninfo>

source: <phrase>DCC Status tab</phrase>
de: <phrase>Das Unterfenster „DCC-Status“</phrase>

source: The &i18n-nickname; of the recipient and file name appear here.
de: Hier werden der Dateiname sowie der &i18n-Nickname; des Empfängers angezeigt.

source: The <guilabel>Status</guilabel> column indicates the status of the file send or receive as follows:
de: In der Spalte <guilabel>Status</guilabel> wird der Status der Dateiübertragungen wie folgt angezeigt:

source: Preparing
de: In Vorbereitung

source: A receiving transfer is checking for resumable files or a sending transfer is acquiring the data to send.
de: Es wird geprüft, ob Dateiübertragungen an Sie fortgesetzt werden können, oder es werden die Daten vorbereitet, die Sie senden möchten.

source: Connecting
de: Verbindung wird hergestellt

source: &konversation; is trying to establish a connection with the other end.
de: Es wird versucht, eine Verbindung zum Empfänger herzustellen.

source: Sending
de: Wird gesendet

source: &konversation; is sending the file to the other end.
de: Die Datei wird übertragen.

source: Receiving
de: Wird empfangen

source: &konversation; is receiving the file from the other end.
de: Die Datei wird empfangen.

source: Done
de: Abgeschlossen

source: The file has been successfully transferred.
de: Die Dateiübertragung ist abgeschlossen.

source: Pending
de: Anhängig

source: The transfer is waiting for the partner to accept or reject it.
de: Es wird darauf gewartet, dass der Empfänger die Übertragung annimmt oder zurückweist.

source: Aborted
de: Abgebrochen

source: Either you clicked the <guibutton>Abort</guibutton> button, or the other person aborted the transfer.
de: Die Übertragung wurde entweder von Ihnen oder dem anderen Benutzer abgebrochen.

source: Failed
de: Fehlgeschlagen

source: An error occurred and the transfer was not successful.
de: Die Dateiübertragung ist fehlgeschlagen.

source: Queued
de: In der Warteschlange

source: Transfer is waiting for you to accept or reject it.
de: Es wird darauf gewartet, dass Sie die Dateiübertragung annehmen oder zurückweisen.

source: Resuming
de: Fortsetzen

source: When a transfer begins but the file already exists on the user's system, the user will be prompted <interface>File already exists. Resume transfer?</interface> This status indicates the user resumed the transfer.
de: Wenn eine Dateiübertragung beginnt, obwohl die jeweilige Datei bereits vorhanden ist, wird der Benutzer darauf hingewiesen und muss die Fortsetzung der Übertragung bestätigen. Dieser Status bedeutet, dass der Benutzer die Dateiübertragung fortgesetzt hat.

source: When someone wants to send you a file, the <guilabel>DCC Status</guilabel> tab will be created (if not already created). Click the <guilabel>DCC Status</guilabel> tab to display it. Click the file to select it, then click this button to accept the file and the transfer will begin. <emphasis>Note: </emphasis>You may configure &konversation; to automatically accept sends from other people by choosing <menuchoice> <guisubmenu>Settings</guisubmenu> <guisubmenu>Configure Konversation</guisubmenu> </menuchoice> on the main menu. Click <guilabel>Behavior</guilabel> to expand it, then click <guilabel>DCC</guilabel> to display the <guilabel>DCC</guilabel> screen.
de: Wenn jemand versucht, Ihnen eine Datei zu senden, wird das Unterfenster <guilabel>DCC-Status</guilabel> automatisch geöffnet. Klicken Sie die Datei an, um sie auszuwählen. Drücken Sie danach diesen Knopf, um die Übertragung anzunehmen und zu starten. <emphasis>Hinweis:</emphasis> Sie können einstellen, dass Dateiübertragungen automatisch angenommen werden sollen. Klicken Sie dazu auf den Eintrag <menuchoice><guisubmenu>Einstellungen</guisubmenu> <guisubmenu>&konversation; einrichten</guisubmenu></menuchoice> in der Menüleiste. <action>Der <guilabel>Einrichtungsdialog</guilabel> wird geöffnet.</action> Klappen Sie den Abschnitt <guilabel>Verhalten</guilabel> auf, klicken Sie auf <guilabel>DCC</guilabel> und aktivieren Sie das Ankreuzfeld <guilabel>DCC-Empfang automatisch annehmen</guilabel>.

source: If you have trouble sending or receiving files, your firewall or router may be blocking DCC ports. See <link linkend="faq">Questions and Answers</link>.
de: Falls beim Senden oder Empfangen von Dateien Probleme auftreten, überprüfen Sie, ob Ihre Firewall oder Ihr Router die für DCC benötigten Ports blockiert. Weitere Informationen dazu finden Sie im Abschnitt <link linkend="faq">Fragen und Antworten</link>.

source: Integrating with &kaddressbook;
de: Integration von &kaddressbook;

source: You can associate any &i18n-nickname; with a contact in &kaddressbook;. Once you've done this, &konversation; will display the contact real name in parenthesis after the &i18n-nickname; in the <interface>Nick Panel</interface>.
de: Sie können &i18n-Nickname;n mit Kontakten in &kaddressbook; verknüpfen. Danach wird neben verknüpften &i18n-Nickname;n in der <interface>Benutzerliste</interface> in Klammern der Name des entsprechenden Kontakts angezeigt.

source: To associate a &i18n-nickname; with a contact in &kaddressbook;, click with the &RMB; on the &i18n-nickname; of the person in the <interface>Nick Panel</interface> of the <link linkend="channel-screen-tour">Main</link> screen. Choose <menuchoice> <guisubmenu>Whois</guisubmenu> </menuchoice> to <action>display information to help you determine the user's real name</action>. Next, click with the &RMB; on the &i18n-nickname; of the person again and choose <menuchoice> <guisubmenu>Address Book Associations</guisubmenu> </menuchoice>. <action>A submenu appears.</action> If the &i18n-nickname; is not already associated with a contact, choose <menuchoice> <guisubmenu>Create New Contact</guisubmenu> </menuchoice>. <action>The <guilabel>Edit Contact</guilabel> screen appears.</action>
de: Um einen &i18n-Nickname;n mit einem Kontakt in &kaddressbook; zu verknüpfen, klicken Sie mit der &RMBn; auf den jeweiligen &i18n-Nickname;n in der <interface>Benutzerliste</interface> im <link linkend="channel-screen-tour">Hauptfenster</link>. Klicken Sie im Kontextmenü auf <menuchoice><guisubmenu>Whois</guisubmenu></menuchoice>, um <action>Informationen wie den echten Namen des Benutzers anzuzeigen</action>. Klicken Sie erneut mit der &RMBn; auf den &i18n-Nickname;n und wählen Sie im Kontextmenü den Eintrag <menuchoice><guisubmenu>Adressbuchzuordnungen</guisubmenu></menuchoice>. <action>Ein Untermenü wird geöffnet.</action> Falls der &i18n-Nickname; noch nicht mit einem Kontakt verknüpft ist, klicken Sie auf <menuchoice><guisubmenu>Neuen Kontakt erstellen ...</guisubmenu></menuchoice>. <action>Der Dialog <guilabel>Neuer Kontakt</guilabel> wird geöffnet.</action>.

source: <screeninfo>The Edit Contact screen.</screeninfo>
de: <screeninfo>Der Dialog „Kontakt bearbeiten“</screeninfo>

source: <phrase>The Edit Contact screen.</phrase>
de: <phrase>Der Dialog „Kontakt bearbeiten“</phrase>

source: The &i18n-nickname; is automatically filled in here. If you know the person's real name, replace the &i18n-nickname; with the real name.
de: Hier wird automatisch der &i18n-Nickname; des Benutzers eingetragen. Falls Sie den realen Namen kennen, tragen Sie diesen anstelle des &i18n-Nickname;ns ein.

source: Notice that the &i18n-nickname; does <emphasis>not</emphasis> appear here. Instead, ..
de: Der &i18n-Nickname; wird hier <emphasis>nicht</emphasis> angezeigt.

source: Click here. The <guilabel>Edit Instant Messaging Addresses</guilabel> window appears.
de: Klicken Sie hier, um den Dialog <guilabel>Instant-Messaging-Adresse bearbeiten</guilabel>zu öffnen.

source: <screeninfo>The IM Addresses Window.</screeninfo>
de: <screeninfo>Der Dialog „Instant-Messaging-Adresse bearbeiten“</screeninfo>

source: <phrase>The IM Addresses Window.</phrase>
de: <phrase>Der Dialog „Instant-Messaging-Adresse bearbeiten“</phrase>

source: See the <ulink url="help:kaddressbook">&kaddressbook; Handbook</ulink> for additional instructions on using the &kde; address book.
de: Weitere Informationen zur Verwendung des &kde;-Adressbuchs finden Sie im <ulink url="help:kaddressbook">Handbuch zu &kaddressbook;</ulink>.

source: Fill in any additional information about the &i18n-nickname; you know and click <guilabel>OK</guilabel>. The real name of the person will appear inside parenthesis next to the &i18n-nickname; in the <guilabel>Nick Panel</guilabel> of &konversation;. The real name also appears when the mouse hovers over the &i18n-nickname;.
de: Tragen Sie die übrigen Ihnen bekannten Informationen über den Benutzer ein und klicken Sie auf <guilabel>OK</guilabel>. Der reale Name des Benutzers wird in der Benutzerliste von &konversation; in Klammern neben dem entsprechenden &i18n-Nickname;n angezeigt sowie beim Überfahren desselben mit der Maus.

source: Once a &i18n-nickname; has been associated with a contact in &kaddressbook;, you can click with the &RMB; on the &i18n-nickname; of the person in the <interface>Nick Panel</interface> and edit the associated contact, associate the &i18n-nickname; with a different contact, or delete the association.
de: Nachdem Sie einen &i18n-Nickname;n mit einem Kontakt in &kaddressbook; verknüpft haben, können Sie den Kontakt bearbeiten, die Verknüpfung löschen, oder den &i18n-Nickname;n mit einem anderen Kontakt verknüpfen. Verwenden Sie die entsprechenden Einträge im Kontextmenü, das Sie durch einen Klick mit der &RMBn; auf den &i18n-Nickname;n in der <interface>Benutzerliste</interface> erreichen.

source: If you have associated a &i18n-nickname; with a contact, and the user changes their &i18n-nickname; while you are running &konversation;, it will automatically associate the new &i18n-nickname; with the contact, keeping the original association as well.
de: Wenn Sie einen &i18n-Nickname;n mit einem Kontakt verknüpft haben und der entsprechende Benutzer seinen &i18n-Nickname;n ändert, während Sie &konversation; geöffnet haben, so wird der neue &i18n-Nickname; automatisch mit dem Kontakt verknüpft; Die alte Verknüpfung bleibt dabei erhalten.

source: If you associate an &irc; &i18n-nickname; with a contact in <ulink url="help:kopete">&kopete;</ulink>, the association will also appear in &konversation;, and vice versa.
de: Wenn Sie einen &irc;-&i18n-Nickname;n in <ulink url="help:kopete">&kopete;</ulink> mit einem Kontakt verknüpfen, wird die Verknüpfung auch in &konversation; verwendet (und andersherum).

source: Note: It is possible to highlight more than one &i18n-nickname; in the <interface>Nick Panel</interface>, click with the mouse &RMB;, and perform multiple associations.
de: Hinweis: Sie können mehrere &i18n-Nickname;n in der <interface>Benutzerliste</interface> auswählen und nach einem Klick mit der &RMBn; mehrere Verknüpfungen gleichzeitig erstellen.

source: Capturing &URL;s from messages
de: Erfassung von &URL;s in Nachrichten
