Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/extragear-network/smb4k.po
Languages: de

source: This tells <ulink url="man:/rsync"><citerefentry><refentrytitle>rsync</refentrytitle><manvolnum>1</manvolnum></citerefentry></ulink> to avoid crossing a file system boundary when recursing. This does not limit the user's ability to specify items to copy from multiple file systems, just <ulink url="man:/rsync"><citerefentry><refentrytitle>rsync</refentrytitle><manvolnum>1</manvolnum></citerefentry></ulink>'s recursion through the hierarchy of each folder that the user specified, and also the analogous recursion on the receiving side during deletion. Also keep in mind that <ulink url="man:/rsync"><citerefentry><refentrytitle>rsync</refentrytitle><manvolnum>1</manvolnum></citerefentry></ulink> treats a "bind" mount to the same device as being on the same file system.
de: Damit vermeidet <ulink url="man:/rsync"><citerefentry><refentrytitle>rsync</refentrytitle><manvolnum>1</manvolnum></citerefentry></ulink> das Überschreitung von Dateisystemgrenzen bei der Rekursion. Dies beschränkt den Benutzer nicht dabei ein, Einträge aus mehreren Dateisystem zum Kopieren anzugeben. Nur die Rekursion von <ulink url="man:/rsync"><citerefentry><refentrytitle>rsync</refentrytitle><manvolnum>1</manvolnum></citerefentry></ulink> durch Hierarchie der von Benutzer angegebenen Ordner und auch die entsprechende Rekursion auf der Empfängerseite beim Löschen ist davon betroffen. Beachten Sie auch, dass <ulink url="man:/rsync"><citerefentry><refentrytitle>rsync</refentrytitle><manvolnum>1</manvolnum></citerefentry></ulink> einen eingebundenen Ordnerbaum als das gleiche Dateisystem behandelt.

source: Only update files that already exist
de: Nur bereits existierende Dateien aktualisieren

source: This tells <ulink url="man:/rsync"><citerefentry><refentrytitle>rsync</refentrytitle><manvolnum>1</manvolnum></citerefentry></ulink> to skip updating files that do not exist yet on the destination. If this option is combined with the <option>--ignore-existing</option> option, no files will be updated (which can be useful if all you want to do is to delete missing files).
de: Dies veranlasst <ulink url="man:/rsync"><citerefentry><refentrytitle>rsync</refentrytitle><manvolnum>1</manvolnum></citerefentry></ulink> dazu, keine Dateien (und Ordner) zu erzeugen, die auf der Zielseite noch nicht existieren. Wird diese Option mit der Option <option>--ignore-existing</option> kombiniert, dann werden gar keine Dateien aktualisiert (was sinnvoll sein kann, falls sie nur fremde Dateien löschen möchten).

source: Ignore files that already exist
de: Bereits existierende Dateien ignorieren

source: This tells <ulink url="man:/rsync"><citerefentry><refentrytitle>rsync</refentrytitle><manvolnum>1</manvolnum></citerefentry></ulink> to skip updating files that already exist on the destination. See also <option>--ignore-non-existing</option>.
de: Mit dieser Einstellung überspringt <ulink url="man:/rsync"><citerefentry><refentrytitle>rsync</refentrytitle><manvolnum>1</manvolnum></citerefentry></ulink> die Aktualisierung von Dateien, die bereits auf der Empfangs-Seite existieren. Siehe auch <option>--ignore-non-existing</option>.

source: Delay updates until the end of transfer
de: Aktualisierungen bis zum Übertragungsende verzögern

source: This option puts the temporary file from each updated file into a holding folder until the end of the transfer, at which time all the files are renamed into place in rapid succession.
de: Ist diese Einstellung aktiv, dann werden die aktualisierten Dateien bis zum Ende der Übertragung temporär in einem gesonderten Ordner abgelegt und danach umbenannt und an ihren Platz verschoben.

source: It is strongly recommended that you read the <ulink url="man:/rsync">manual page</ulink> before using this option.
de: Es wird dringen empfohlen, die <ulink url="man:/rsync">Handbuchseite</ulink> zu lesen, ehe Sie diese Einstellung aktivieren.

source: Backup
de: Sicherungskopien

source: Make backups
de: Sicherungskopien erstellen

source: With this option, preexisting destination files are renamed as each file is transferred or deleted. You can control where the backup file goes and what (if any) suffix gets appended using the <option>--backup-dir</option> and <option>--suffix</option> options.
de: Mit dieser Option werden bereits vorhandene Zieldateien beim Übertragen oder Löschen jeder Datei umbenannt. Das Ziel für die Sicherungsdateien und die angehängte Erweiterung können Sie mit den Optionen <option>--backup-dir</option> und <option>--suffix</option> steuern.

source: Note that if you don't specify <option>--backup-dir</option>, (1) the <option>--omit-dir-times</option> option will be implied, and (2) if <option>--delete</option> is also in effect (without <option>--delete-excluded</option>), <ulink url="man:/rsync"><citerefentry><refentrytitle>rsync</refentrytitle><manvolnum>1</manvolnum></citerefentry></ulink> will add a "protect" filter-rule for the backup suffix to the end of all your existing excludes (&eg; <option>-f "P *~"</option>). This will prevent previously backed-up files from being deleted. Note that if you are supplying your own filter rules, you may need to manually insert your own exclude/protect rule somewhere higher up in the list so that it has a high enough priority to be effective (&eg;, if your rules specify a trailing inclusion/exclusion of '*', the auto-added rule would never be reached).
de: Wenn Sie die Option <option>--backup-dir</option> nicht angeben, dann wird (1) die Option <option>--omit-dir-times</option> eingeschlossenen und (2) die Option <option>--delete</option> gleichfalls ohne <option>--delete-excluded</option> angewendet. Dann fügt <ulink url="man:/rsync"><citerefentry><refentrytitle>rsync</refentrytitle><manvolnum>1</manvolnum></citerefentry></ulink> eine Filterregel zum „Schutz“ für die Sicherungserweiterung am Ende aller Ausschlußregeln &eg; <option>-f "P *~"</option> anfügen. Dies verhindert, dass früher gesicherte Dateien gelöscht werden. Wenn Sie Ihre eigenen Filterregeln angeben, sollten Sie eigenen Regeln zum Ausschluß/Schutz irgendwo vorher in der Liste angeben, damit sie eine ausreichen große Priorität haben, um wirksam zu sein. Wenn Sie &eg; Ihre Regeln den Einschluß/Ausschluß von angehängten "*" festlegen, wird die automatisch hinzugefügte Regel nie wirksam.

source: Backup suffix
de: Suffix für Sicherungskopien

source: This option allows you to override the default backup suffix used with the <option>--backup</option> option. The default suffix is a <emphasis>~</emphasis> if no <option>--backup-dir</option> was specified, otherwise it is an empty string.
de: Mit dieser Einstellung kann die Standarderweiterung für Sicherungen für die Option <option>--backup</option> eingestellt werden. Als Voreinstellung wird <emphasis>~</emphasis> benutzt, wenn keine Option <option>--backup-dir</option> angegeben wurde. Ansonsten ist dies eine leere Zeichenkette.

source: This option is only available if you ticked the <guilabel>Make backups</guilabel> option above.
de: Diese Einstellung ist nur dann verfügbar, wenn <guilabel>Sicherungskopien erstellen</guilabel> aktiviert ist.

source: Default: not selected; SUFFIX: ~
de: Voreinstellung: nicht aktiviert, SUFFIX: ~

source: Backup directory
de: Ordner für Sicherungskopien

source: In combination with the <option>--backup</option> option, this tells rsync to store all backups in the specified folder. This is very useful for incremental backups. You can additionally specify a backup suffix using the <option>--suffix</option> option (otherwise the files backed up in the specified folder will keep their original filenames).
de: In Kombination mit der Option <option>--backup</option> gibt dies rsync vor, alle Sicherungen in dem angegebenen Ordner zu speichern. Die ist sehr nützlich für inkrementelle Sicherungen. Sie können zusätzlich eine Erweiterung mit der Option <option>--suffix</option> angeben. Sonst behalten die gesicherten Dateien im angegebenen Ordner den ursprünglichen Dateinamen.

source: Default: not selected; DIR: <envar>$HOME</envar>
de: Voreinstellung: nicht aktiviert, DIR: <envar>$HOME</envar>

source: Checksums
de: Prüfsummen

source: Force fixed checksum block size
de: Feste Prüfsummen-Blockgröße erzwingen

source: This forces the block size used in the rsync algorithm to a fixed value. It is normally selected based on the size of each file being updated. See the <ulink url="http://rsync.samba.org/tech_report/">technical report</ulink> for details.
de: Mit dieser Einstellung wird für die vom RSync-Algorithmus verwendete Blockgröße ein fester Wert verwendet. Normalerweise wird für die Blockgröße ein variabler Wert benutzt, der von der Größe jeder aktualisierten Datei abhängt. Weitere Details finden Sie im <ulink url="http://rsync.samba.org/tech_report/">Technischen Bericht</ulink>.

source: Default: not selected; SIZE: 0
de: Voreinstellung: nicht aktiviert, SIZE: 0

source: Set block/file checksum seed
de: Anfangswert für Block-/Dateiprüfsummen setzen

source: Set the MD4 checksum seed to the integer NUM. This 4 byte checksum seed is included in each block and file MD4 checksum calculation. By default the checksum seed is generated by the server and defaults to the current time(). This option is used to set a specific checksum seed, which is useful for applications that want repeatable block and file checksums, or in the case where the user wants a more random checksum seed. Note that setting NUM to 0 causes rsync to use the default of time() for checksum seed.
de: Legt den Seed für die MD4-Prüfsumme auf den ganzzahligen Wert NUM fest. Dieser 4-Byte-Seed für die Prüfsumme wird in jeden Block und in die MD$-Prüfsumme der Dateien eingeschlossen. In der Voreinstellung wird der Seed für die Prüfsumme auf dem Server als Standard aus der aktuellen Zeit generiert. Diese Einstellung kann benutzt werden, um einen speziellen Seed für die Prüfsumme festzulegen. Das ist sinnvoll für Anwendungen, die wiederholbare Prüfsummen für Blöcke und Dateien benötigen, oder wenn ein Benutzer mehr zufällige Seeds für Prüfsummen benötigt. Mit einem Wert von NUM=0 verwendet rsync den Standard von date() für den Seed der Prüfsummen.

source: Skip files based on checksum
de: Dateien aufgrund von Prüfsummen überspringen

source: This forces the sender to checksum every regular file using a 128-bit MD4 checksum. It does this during the initial file system scan as it builds the list of all available files. The receiver then checksums its version of each file (if it exists and it has the same size as its sender-side counterpart) in order to decide which files need to be updated: files with either a changed size or a changed checksum are selected for transfer. Since this whole-file checksumming of all files on both sides of the connection occurs in addition to the automatic checksum verifications that occur during a file's transfer, this option can be quite slow.
de: Dies erzwingt beim Sender, für jede normale Datei MDA-Prüfsummen mit 128-Bit zu bilden. Dies erfolgt zu Anfang beim Einlesen des Dateisystems, wenn eine Liste aller vorhandenen Dateien gebildet wird. Beim Empfänger wird dann ebenfalls eine Prüfsumme für jede Datei gebildet, die dort vorhanden ist und die gleiche Größe wie auf der Senderseite hat. Damit kann festgestellt werden, welche Dateien aktualisiert werden müssen: Dateien, die entweder eine andere Größe oder eine geänderte Prüfsumme haben, werden zur Übertragung ausgewählt. Da die Ermittlung der Prüfsummen alle Dateien auf beiden Seiten der Verbindung zusätzlich zur automatischen Verifizierung mit Prüfsummen bei der Dateiübertragung erfolgt, kann diese Option den Vorgang verlangsamen.

source: Laptop Support
de: Laptop-Unterstützung

source: The settings on this page influence the way &smb4k; behaves when used on a laptop. Primarily, they make sure that the application runs smoothly even after a suspension/hibernation and during or after a network disconnection. But you can also define the behavior when the laptop is powered off without prior log-off.
de: Die Einstellungen auf dieser Seite beeinflussen das Verhalten von &smb4k; auf einem Laptop. Hauptsächlich soll sichergestellt werden, das das Programm sogar problemlos nach dem Ruhezustand oder Tiefschlaf und während oder nach einer Trennung der Netzwerkverbindung wieder läuft. Sie können aber auch das Verhalten festlegen, wenn der Laptop ohne vorherige Abmeldung ausgeschaltet wird.

source: Please note that &smb4k; is only able to detect changes in state of the hardware through the <ulink url="http://solid.kde.org">Solid</ulink> hardware device framework. So, it might be necessary that you unmount all shares manually if you initiate a software suspend/hibernation. Have also a look at the options defined on the <link linkend="configuration_shares">Shares</link> configuration page under <link linkend="configuration_shares_mounting">Mounting &amp; Unmounting</link>.
de: Bitte beachten Sie, dass &smb4k; Änderungen am Status der Hardware nur über <ulink url="http://solid.kde.org">Solid</ulink>-Komponente für Hardwaregeräte erkennen kann. Deshalb ist es unter Umständen nötig, dass Sie alle eingebundenen Freigaben manuell lösen, wenn Sie den Rechner durch Software in den Ruhezustand versetzen und dann wieder hochfahren. Lesen Sie dazu auch die Einstellungen, die auf der Einrichtungsseite <link linkend="configuration_shares">Freigaben</link> im Abschnitt <link linkend="configuration_shares_mounting">Einbinden &amp; Einbindungen lösen</link> definiert sind.

source: Screenshot of the "Laptop Support" configuration page
de: Bildschirmfoto der Einrichtungsseite „Laptop-Unterstützung“

source: The "Laptop Support" configuration page
de: Die Einrichtungsseite „Laptop-Unterstützung“

source: Unmount all shares when the sleep button is pressed
de: Die Einbindungen aller Freigaben lösen, wenn der Tiefschlaf-Knopf gedrückt wird

source: All shares owned by you are unmounted when the sleep button is pressed and your laptop is about to suspend or hibernate. After the operating system woke up again, the shares are remounted.
de: Die Einbindung aller eigenen Freigaben wird gelöst, wenn der Tiefschlaf-Knopf gedrückt wird und Ihr Laptop in den Ruhezustand oder Tiefschlaf geht. Wird das Betriebssystem wieder aktiviert, werden alle Freigaben wieder eingebunden.

source: Unmount all shares when the lid is closed
de: Die Einbindungen aller Freigaben lösen, wenn der Deckel geschlossen wird

source: All shares owned by you are unmounted when the lid is closed and your laptop is about to suspend or hibernate. After the operating system woke up again, the shares are remounted.
de: Die Einbindung aller eigenen Freigaben wird gelöst, wenn der Deckel geschlossen wird und Ihr Laptop in den Ruhezustand oder Tiefschlaf geht. Wird das Betriebssystem wieder aktiviert, werden alle Freigaben wieder eingebunden.

source: Unmount all shares when the power button is pressed
de: Die Einbindungen aller Freigaben lösen, wenn der Ausschalt-Knopf gedrückt wird

source: All shares owned by you are unmounted when the power button is pressed and your laptop is about to power off. On the next program run, the shares are remounted.
de: Die Einbindung aller eigenen Freigaben wird gelöst, wenn der Ausschalt-Knopf gedrückt wird oder Ihr Laptop ausgeschaltet wird. Beim nächsten Programmstart werden alle Freigaben wieder eingebunden.

source: Unmount all shares when the network is disconnected
de: Die Einbindungen aller Freigaben lösen, wenn das Netzwerk nicht erreichbar ist

source: All shares owned by you are unmounted when the network gets disconnected. After the connection was established again, the shares are remounted.
de: Die Einbindung aller eigenen Freigaben wird gelöst, wenn die Verbindung zum Netzwerk unterbrochen wird. Wird die Verbindung wieder hergestellt, werden alle Freigaben wieder eingebunden.

source: Custom Options
de: Benutzerdefinierte Einstellungen

source: All servers and shares for which you defined custom options are listed here.
de: Alle Server und Freigaben mit benutzerdefinierten Einstellungen werden hier aufgeführt.

source: Screenshot of the "Custom Options" configuration tab
de: Bildschirmfoto der Einrichtungsseite „Benutzerdefinierte Einstellungen“

source: The "Custom Options" configuration tab
de: Die Einrichtungsseite „Benutzerdefinierte Einstellungen“

source: The options defined for a network item can be edited by either double clicking an entry in the list view or by choosing the <guimenuitem>Edit</guimenuitem> item from the popup menu (right click on the selected item). The custom options are then being loaded and can be edited. To remove an entry, right click it and choose the <guimenuitem>Remove</guimenuitem> item from the popup menu. All network items may be removed at once by choosing the <guimenuitem>Clear List</guimenuitem> item. Changes can be reset by choosing the <guimenuitem>Undo</guimenuitem> item from the popup menu.
de: Die für einen Netzwerkeintrag definierten Einstellungen können bearbeitet werden, indem Sie auf einen Eintrag in der Listenansicht doppelklicken oder <guimenuitem>Bearbeiten</guimenuitem> aus dem Kontextmenü des Eintrags auswählen. Die benutzerdefinierten Einstellungen werden dann geladen und können geändert werden. Un einen Eintrag zu löschen, wählen Sie im Kontextmenü <guimenuitem>Entfernen</guimenuitem>. Alle Netzwerkeinträge können auf einmal mit <guimenuitem>Liste löschen</guimenuitem> entfernt werden. Änderungen können verworfen werden, indem Sie <guimenuitem>Zurücknehmen</guimenuitem> im Kontextmenü wählen.

source: The custom options are accessible through the editor widgets on the right. In the <guilabel>General</guilabel> section the UNC address of the network item and its editable IP address are shown. Also, you can define whether the share should be remounted. Below, the custom options are arranged in two tabs:
de: Die benutzerdefinierten Einstellungen finden Sie rechts im Bearbeitungsfenster. Im Abschnitt <guilabel>Allgemein</guilabel> werden die UNC-Adresse des Netzwehreintrags und die editierbare IP-Adressen angezeigt. Hier können Sie auch festlegen, ob die Freigabe erneut eingebunden werden soll. Die weiteren benutzerdefinierten Einstellungen sind in zwei Karteikarten aufgeteilt:

source: You can edit various Samba settings here. Which ones are available depends on the operating system you are using. For more information, have a look at the description of the <link linkend="configuration_samba">Samba</link> configuration page.
de: Sie können verschiedene Einstellungen für Samba hier ändern. Die verfügbaren Einstellungen hängen von Ihrem verwendeten Betriebssystem ab. Weitere Informationen finden Sie in der Beschreibung zur Einrichtungsseite von <link linkend="configuration_samba">Samba</link>.

source: Here you can edit the options that you previously defined through the <link linkend="network_neighborhood_browser_custom">Custom Options</link> dialog.
de: Hier können Sie die Einstellungen bearbeiten, die Sie vorher im Dialog <link linkend="network_neighborhood_browser_custom">Benutzerdefinierte Einstellungen</link> eingerichtet haben.

source: Command Reference
de: Befehlsreferenz

source: Menu Items
de: Menüeinträge

source: The File Menu
de: Das Menü Datei

source: <shortcut> <keycombo action="simul"> &Ctrl; <keycap>Q</keycap> </keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Quit</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo> </shortcut> <guimenu>Datei</guimenu> <guimenuitem>Beenden</guimenuitem>

source: Quit &smb4k;.
de: Beendet &smb4k;

source: The Network Menu
de: Das Menü Netzwerk

source: <shortcut> <keycap>F5</keycap> </shortcut> <guimenu>Network</guimenu> <guimenuitem>Scan Network|Workgroup|Computer</guimenuitem>
de: <shortcut> <keycap>F5</keycap> </shortcut> <guimenuitem>Netzwerk|Arbeitsgruppe|Rechner durchsuchen</guimenuitem>

source: (Re-)scan the network neighborhood, a workgroup, or a computer.
de: Durchsucht die Netzwerkumgebung, eine Arbeitsgruppe oder einen Rechner erneut.

source: <shortcut> <keycombo action="simul"> &Ctrl; <keycap>A</keycap> </keycombo> </shortcut> <guimenu>Network</guimenu> <guimenuitem>Abort</guimenuitem>
de: <shortcut> <keycombo action="simul"> &Ctrl; <keycap>A</keycap> </keycombo> </shortcut> <guimenu>Netzwerk</guimenu> <guimenuitem>Abbrechen</guimenuitem>

source: Abort the scanning for new workgroups/domains, servers or shares.
de: Bricht die Suche nach neuen Arbeitsgruppen, Domänen, Servern oder Freigaben ab.

source: <shortcut> <keycombo action="simul"> &Ctrl; <keycap>O</keycap> </keycombo> </shortcut> <guimenu>Network</guimenu> <guimenuitem>Open Mount Dialog</guimenuitem>
de: <shortcut> <keycombo action="simul"> &Ctrl; <keycap>M</keycap> </keycombo> </shortcut> <guimenu>Netzwerk</guimenu> <guimenuitem>Dialog zum Einbinden öffnen</guimenuitem>

source: Open the dialog to "manually" mount a remote share.
de: Öffnet einen Dialog, in dem Sie eine entfernte Freigabe manuell einbinden können.

source: <shortcut> <keycombo action="simul"> &Ctrl; <keycap>T</keycap> </keycombo> </shortcut> <guimenu>Network</guimenu> <guimenuitem>Authentication</guimenuitem>
de: <shortcut> <keycombo action="simul"> &Ctrl; <keycap>T</keycap> </keycombo> </shortcut> <guimenu>Netzwerk</guimenu> <guimenuitem>Authentifizierung</guimenuitem>

source: Open the authentication dialog where you can enter login information.
de: Öffnet den Dialog zur Authentifizierung, in dem Sie Ihre Anmeldedaten eingeben können.

source: <shortcut> <keycombo action="simul"> &Ctrl; <keycap>C</keycap> </keycombo> </shortcut> <guimenu>Network</guimenu> <guimenuitem>Custom Options</guimenuitem>
de: <shortcut> <keycombo action="simul"> &Ctrl; <keycap>C</keycap> </keycombo> </shortcut> <guimenu>Netzwerk</guimenu> <guimenuitem>Benutzerdefinierte Einstellungen</guimenuitem>

source: Open a dialog where you can define custom options for a server or share.
de: Öffnet einen Dialog, in dem Sie benutzerdefinierte Einstellungen für einen Server oder eine Freigabe eingeben können.

source: <shortcut> <keycombo action="simul"> &Ctrl; <keycap>V</keycap> </keycombo> </shortcut> <guimenu>Network</guimenu> <guimenuitem>Preview</guimenuitem>
de: <shortcut> <keycombo action="simul"> &Ctrl; <keycap>V</keycap> </keycombo> </shortcut> <guimenu>Netzwerk</guimenu> <guimenuitem>Vorschau</guimenuitem>

source: Open the preview dialog that contains a preview of the contents of the selected share.
de: Öffnet einen Dialog, in dem eine Vorschau des Inhalts der ausgewählten Freigabe angezeigt wird.

source: <shortcut> <keycombo action="simul"> &Ctrl; <keycap>P</keycap> </keycombo> </shortcut> <guimenu>Network</guimenu> <guimenuitem>Print File</guimenuitem>
de: <shortcut> <keycombo action="simul"> &Ctrl; <keycap>P</keycap> </keycombo> </shortcut> <guimenu>Netzwerk</guimenu> <guimenuitem>Datei drucken</guimenuitem>

source: Open the print dialog.
de: Öffnet den Druckdialog.

source: <shortcut> <keycombo action="simul"> &Ctrl; <keycap>M</keycap> </keycombo> </shortcut> <guimenu>Network</guimenu> <guimenuitem>Mount</guimenuitem>
de: <shortcut> <keycombo action="simul"> &Ctrl; <keycap>M</keycap> </keycombo> </shortcut> <guimenu>Netzwerk</guimenu> <guimenuitem>Einbinden</guimenuitem>

source: Mount the selected remote share.
de: Bindet die ausgewählte entfernte Freigabe ein.

source: The Search Menu
de: Das Menü Suchen

source: <shortcut> <keycombo action="simul"> &Ctrl; <keycap>S</keycap> </keycombo> </shortcut> <guimenu>Search</guimenu> <guimenuitem>Search</guimenuitem>
de: <shortcut> <keycombo action="simul"> &Ctrl; <keycap>S</keycap> </keycombo> </shortcut> <guimenu>Suchen</guimenu> <guimenuitem>Suchen</guimenuitem>

source: Search the network for the entered search string.
de: Durchsucht das Netzwerk nach dem eingegebenen Suchbegriff.
