Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/extragear-network/smb4k.po
Languages: de

source: Open the <link linkend="mainwindow_network_mounting">dialog</link> for mounting shares "manually". This feature may be needed if &smb4k; cannot find a server from which you want to mount a certain shared resource.
de: Öffnet den <link linkend="mainwindow_network_mounting">Dialog</link> zur manuellen Einbindung von Freigaben. Diese Funktion ist nötig, wenn &smb4k; keinen Server finden kann, von dem Sie eine bestimmte Freigabe nicht einbinden können.

source: <shortcut><keycombo action="simul">&Ctrl; <keycap>T</keycap></keycombo></shortcut> <guimenuitem>Authentication</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>T</keycap> </keycombo> </shortcut> <guimenuitem>Authentifizierung</guimenuitem>

source: Open the <link linkend="mainwindow_network_authentication">authentication dialog</link>. You can provide the login and password for the selected server or share. If a workgroup or no item is selected, this action is disabled.
de: Öffnet den <link linkend="mainwindow_network_authentication">Authentifizierung-Dialog</link>. Sie können Anmeldedaten und Passwort für Server oder Freigaben eingeben. Ist eine Arbeitsgruppe oder kein Eintrag ausgewählt, ist diese Aktion nicht aktiviert.

source: <shortcut><keycombo action="simul">&Ctrl; <keycap>C</keycap></keycombo></shortcut> <guimenuitem>Custom Options</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>C</keycap> </keycombo> </shortcut> <guimenuitem>Benutzerdefinierte Einstellungen</guimenuitem>

source: Open the <link linkend="network_neighborhood_browser_custom">Custom Options</link> dialog. You can set several custom options for the selected server or share. If no a workgroup or not item is selected, this menu entry is disabled.
de: Öffnet den Dialog <link linkend="network_neighborhood_browser_custom">Benutzerdefinierte Einstellungen</link>. Für den ausgewählten Server oder die Freigabe können Sie mehrere benutzerdefinierte Einstellungen festlegen. Ist keine Arbeitsgruppe oder kein Eintrag ausgewählt, ist dieser Menüeintrag nicht aktiviert.

source: <shortcut><keycombo action="simul">&Ctrl; <keycap>V</keycap></keycombo></shortcut> <guimenuitem>Preview</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>V</keycap> </keycombo> </shortcut> <guimenuitem>Vorschau</guimenuitem>

source: <link linkend="mainwindow_network_preview">Preview</link> the contents of the selected remote share. This action is only enabled if a share is selected. Printer shares cannot be previewed.
de: <link linkend="mainwindow_network_preview">Vorschau</link> des Inhalts der ausgewählten entfernten Freigabe. Diese Aktion ist nur dann verfügbar, wenn eine Freigabe ausgewählt ist. Für Druckerfreigaben gibt es keine Vorschau.

source: <shortcut><keycombo action="simul">&Ctrl; <keycap>P</keycap></keycombo></shortcut> <guimenuitem>Print File</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>P</keycap> </keycombo> </shortcut> <guimenuitem>Datei drucken</guimenuitem>

source: <link linkend="mainwindow_network_printing">Print</link> a file on a remote printer. This action is only available if a printer share is selected.
de: <link linkend="mainwindow_network_printing">Druckt</link> eine Datei auf einem entfernten Drucker. Diese Aktion ist nur verfügbar, wenn eine Druckerfreigabe ausgewählt ist.

source: <shortcut><keycombo action="simul">&Ctrl; <keycap>M</keycap></keycombo></shortcut> <guimenuitem>Mount</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>M</keycap> </keycombo> </shortcut> <guimenuitem>Einbinden</guimenuitem>

source: Mount the selected remote share. By default and if you clicked anything different than a share with type "Disk" or "IPC", this action is disabled.
de: Bindet die ausgewählte entfernte Freigabe ein. In der Voreinstellung und wenn Sie auf irgendetwas anderes als auf eine Freigabe vom Typ "Disk" oder "IPC" geklickt haben, ist diese Aktion nicht aktiviert.

source: Although you can interact with the network neighborhood using the keyboard shortcuts mentioned above, in most cases it is more convenient to use the mouse. By right clicking you can open a popup menu. It contains all actions that are available in the network neighborhood browser. Depending on the position where you clicked (on a network item or on the viewport), some of them may be disabled. The figure below shows the popup menu opened on a remote share.
de: Auch wenn Sie die Netzwerkumgebung mit den Kurzbefehlen auf der Tastatur verwalten können, ist es in den meisten Fällen bequemer, die Maus zu benutzen. Durch Klicken mit der &RMBn; können Sie ein Kontextmenü öffnen. Es enthält alle verfügbaren Aktionen für die Netzwerkumgebung. Abhängig von der Position, auf die Sie geklickt haben (auf einen Netzwerkeintrag oder eine Ansicht), können einige Aktionen deaktiviert sein. Das folgende Bildschirmfoto zeigt das Kontextmenü einer entfernten Freigabe.

source: Screenshot of the popup menu of the network browser
de: Bildschirmfoto des Kontextmenü vom Netzwerkbrowser

source: The popup menu of the network browser
de: Das Kontextmenü des Netzwerkbrowsers

source: The title of the popup menu is set to the name of the network item or displays <guilabel>Network</guilabel> if you clicked on the viewport.
de: Der Titel des Kontextmenüs zeigt den Namen des Netzwerkeintrags oder <guilabel>Netzwerk</guilabel>, wenn Sie auf die Ansicht geklickt haben.

source: Tooltips
de: Kurzinfos

source: For each network item a tooltip is provided that contains various information like the name of the workgroup and master browser, the name and IP address of the host, the name of the share, &etc; If a tooltip is requested for a server, it is queried for additional information about the operating system and the server (&eg; Samba).
de: Für jeden Netzwerkeintag wird eine Kurzinfo angezeigt, die verschiedene Informationen wie den Namen der Arbeitsgruppe und den Master-Browser, den Namen und die IP-Adresse des Rechners, den Namen der Freigabe &etc; Wenn eine Kurzinfo für einen Server angefordert wird, wird es nach Informationen über das Betriebssystem und den Server, &eg; Samba, gefragt.

source: The tooltips can be disabled in the <link linkend="configuration_user_interface_network_tooltips">configuration dialog</link>.
de: Die Anzeige der Kurzinfos kann im <link linkend="configuration_user_interface_network_tooltips">Einrichtungsdialog</link> abgeschaltet werden.

source: Mounting a Share
de: Einbinden einer Freigabe

source: There are three options available to mount a remote share:
de: Es gibt drei verfügbare Optionen, um eine entfernte Freigabe einzubinden:

source: Execute the icon representing the remote share in the network neighborhood browser. (Depending on your &kde; settings, this is done by either single or double clicking the icon.)
de: Klicken Sie auf das Symbol für die entfernten Freigaben in der Ansicht der Netzwerkumgebung. Abhängig von Ihren &kde;-Einstellungen müssen Sie entweder einmal oder doppelt klicken.

source: Select the remote share and click the <guimenuitem>Mount</guimenuitem> menu entry. Alternatively, you can press the <keycombo action="simul">&Ctrl; <keycap>M</keycap></keycombo> keyboard shortcut.
de: Wählen Sie die entfernte Freigabe und dann den Menüeintrag <guimenuitem>Einbinden</guimenuitem>. Alternativ können Sie den Kurzbefehl <keycombo action="simul">&Ctrl; <keycap>M</keycap></keycombo> benutzen.

source: If &smb4k; was not able to find the server where the share is located, you can press the <menuchoice><shortcut><keycombo action="simul">&Ctrl; <keycap>O</keycap></keycombo></shortcut><guimenuitem>Open Mount Dialog</guimenuitem></menuchoice> menu entry and a mount dialog will be opened:
de: Konnte &smb4k; den Server mit der Freigabe nicht finden, verwenden Sie den Menüeintrag <menuchoice><shortcut> <keycombo action="simul"> &Ctrl; <keycap>O</keycap> </keycombo> </shortcut> <guimenuitem>Dialog zum Einbinden öffnen</guimenuitem></menuchoice>, um die Freigabe in einem Dialog zu suchen und einzubinden.

source: Screenshot of the "Mount Share" dialog
de: Bildschirmfoto des Dialogs „Freigabe einbinden“

source: The "Mount Share" dialog
de: Der Dialog „Freigabe einbinden“

source: Here you can enter the location of the share either as <ulink url="http://en.wikipedia.org/wiki/Uniform_Naming_Convention#Uniform_Naming_Convention">Uniform Naming Convention (UNC)</ulink> address in the form <screen>//[USER@]SERVER/SHARE</screen> or <screen>\\[USER@]SERVER\SHARE</screen> or as URL in the form <screen>[smb:]//[user@]server:port/share</screen> The <guibutton>OK</guibutton> button will be enabled and you can press it to mount the share. However, it is advisable to enter the IP address and the workgroup of the server, too. If you want to add the share to the bookmarks at the same time, tick the <guibutton>Add this share to the bookmarks</guibutton> check box.
de: Hier können Sie den Ort der Freigabe entweder als <ulink url="http://en.wikipedia.org/wiki/Uniform_Naming_Convention#Uniform_Naming_Convention">Uniform Naming Convention (UNC)</ulink>-Adresse in der Form <screen>//[USER@]SERVER/SHARE</screen> oder <screen>\\[USER@]SERVER\SHARE</screen> bzw. als URL in der Form <screen>[smb:]//[user@]server:port/share</screen> eingeben. Dann wird der Knopf <guibutton>OK</guibutton> aktiviert und Sie können ihn drücken, um die Freigabe einzubinden. Es wird jedoch empfohlen, die IP-Adresse und die Arbeitsgruppe des Servers auch einzutragen. Möchten Sie die Freigabe gleichzeitig zu den Lesezeichen hinzufügen, kreuzen Sie <guibutton>Diese Freigabe zu den Lesezeichen hinzufügen</guibutton> an.

source: Often a share is password protected. In this case, an <link linkend="mainwindow_network_authentication">authentication dialog</link> will appear and you have to enter the correct user name (if not already provided) and password. &smb4k; will proceed mounting the share unless a wrong user name or password was supplied. In that case, the authentication dialog will reappear. If the mount process was successful, the user will be shown a notification and the share will appear in the <link linkend="mounted_shares_view">mounted shares view</link>. If mounting fails, a notification with the error message that was returned by <ulink url="man:/mount.cifs"><citerefentry><refentrytitle>mount.cifs</refentrytitle><manvolnum>8</manvolnum></citerefentry></ulink> (&Linux;) or <ulink url="man:/mount_smbfs"><citerefentry><refentrytitle>mount_smbfs</refentrytitle><manvolnum>8</manvolnum></citerefentry></ulink> (FreeBSD) will be shown.
de: Häufig ist eine Freigabe passwortgeschützt. In diesem Fall erscheint ein <link linkend="mainwindow_network_authentication">Authentifizierungsdialog</link> und Sie müssen den richtigen Benutzernamen, wenn nicht bereits angegeben, und das Passwort eingeben. &smb4k; bindet die Freigabe ein, wenn kein falscher Benutzername oder Passwort angegeben wurde. In diesem Fall wird der Authentifizierungsdialog wieder angezeigt. Wurde die Freigabe erfolgreich eingebunden, wird eine Benachrichtigung angezeigt und die Freigabe in der <link linkend="mounted_shares_view">Anzeige der eingebundenen Freigaben</link> erscheinen. Schlägt die Einbindung fehl, wird eine Benachrichtigung mit der von <ulink url="man:/mount.cifs"><citerefentry><refentrytitle>mount.cifs</refentrytitle><manvolnum>8</manvolnum></citerefentry></ulink> (&Linux;) oder <ulink url="man:/mount_smbfs"><citerefentry><refentrytitle>mount_smbfs</refentrytitle><manvolnum>8</manvolnum></citerefentry></ulink> (FreeBSD) zurückgegebenen Fehlermeldung angezeigt.

source: You can switch off the (purely informatory) mount notifications in the <link linkend="configuration_user_interface_general_notifications">configuration dialog</link>.
de: Die Anzeige der Benachrichtigungen über das Einbinden kann im <link linkend="configuration_user_interface_general_notifications">Einrichtungsdialog</link> abgeschaltet werden.

source: With a standard installation of &smb4k;, <emphasis>FreeBSD</emphasis> users might experience problems when they try to mount a share. This is due to misplaced DBUS and/or PolKit-1 config files. The section <link linkend="freebsd_remarks_installation">Remarks for FreeBSD Users : DBUS and PolKit-1</link> explains how to fix these issues.
de: Mit einer Standardinstallation von &smb4k; haben Benutzer von <emphasis>FreeBSD</emphasis> möglicherweise Probleme, wenn sie versuchen, eine Freigabe einzubinden. Der Grund dafür liegt an Einrichtungsdateien für D-Bus und/oder PolKit-1, die am falschen Ort abgelegt sind. Im Abschnitt <link linkend="freebsd_remarks_installation">Hinweise für FreeBSD-Benutzer</link> wird erklärt, wie das behoben werden kann.

source: Printing Files on Remote Printers
de: Drucken von Dateien auf entfernten Druckern

source: To print a file on a remote printer, open the print dialog by clicking the printer icon or choosing the <menuchoice><shortcut><keycombo action="simul">&Ctrl; <keycap>P</keycap></keycombo></shortcut><guimenuitem>Print File</guimenuitem></menuchoice> menu item.
de: Um eine Datei auf einem entfernten Drucker zu drucken, öffnen Sie den Druckdialog durch Klicken auf das Druckersymbol oder wählen den Menüeintrag <menuchoice><shortcut><keycombo action="simul">&Ctrl; <keycap>P</keycap></keycombo></shortcut><guimenuitem>Datei drucken</guimenuitem></menuchoice>.

source: Screenshot of the print dialog
de: Bildschirmfoto des Druckdialogs

source: The print dialog
de: Der Druckdialog

source: In the <guilabel>Printer</guilabel> section various information about the printer is shown. Under <guilabel>File</guilabel> you have to provide the name of the file you want to print. The number of copies can be defined under <guibutton>Options >></guibutton>. Press <guibutton>Print...</guibutton> to start the print process.
de: Im Abschnitt <guilabel>Drucker</guilabel> werden verschiedene Informationen über den Drucker angezeigt. Im Feld <guilabel>Datei</guilabel> müssen Sie den Namen der Datei angeben, die Sie drucken möchten. Die Anzahl der Kopien kann eingetragen werden, wenn Sie auf den Knopf <guibutton>Optionen >></guibutton> drücken. Drücken Sie den Knopf <guibutton>Drucken ...</guibutton>, um den Prozess zu starten.

source: &smb4k; currently supports PDF, Postscript, image, and text files. If you try to print a file with an unsupported mimetype, a notification with an error message will appear telling you the mimetype is not supported. In this case you have to convert the file manually to Postscript or PDF and try again.
de: &smb4k; unterstützt zurzeit PDF-, PostScript-, Bild- und Textdateien. Möchten Sie eine Datei mit einem nicht unterstützten MIME-Typ drucken, wird eine Benachrichtigung mit der Warnung angezeigt, dass dieser MIME-Typ nicht unterstützt wird.In diesem Fall müssen Sie die Datei von Hand in PDF oder PostScript umwandeln und es erneut versuchen.

source: Previewing Shares
de: Vorschau von Freigaben

source: &smb4k; provides the ability to preview remote shares. If you click the <menuchoice><shortcut><keycombo action="simul">&Ctrl; <keycap>V</keycap></keycombo></shortcut><guimenuitem>Preview</guimenuitem></menuchoice> menu entry, the contents of the selected remote share will be opened in a preview dialog.
de: &smb4k; kann eine Vorschau von entfernten Freigaben anzeigen. Klicken Sie auf <menuchoice><shortcut><keycombo action="simul">&Ctrl; <keycap>V</keycap></keycombo></shortcut><guimenuitem>Vorschau</guimenuitem></menuchoice>, dann wird der Inhalt der ausgewählten entfernten Freigabe in einem Vorschaudialog geöffnet.

source: Screenshot of the preview dialog
de: Bildschirmfoto des Vorschaudialogs

source: The preview dialog
de: Der Vorschaudialog

source: The preview dialog acts like a simple file manager. You can navigate through the contents of the remote share by clicking the folder icons in the list view and the <guibutton>Up</guibutton>, <guibutton>Back</guibutton>, and <guibutton>Forward</guibutton> button. The current location is displayed in the combo box on the right hand side. The <guibutton>Reload</guibutton> button reloads the contents of the current folder.
de: Der Vorschaudialog funktioniert wie eine einfache Dateiverwaltung, Sie können durch den Inhalt einer entfernten Freigabe navigieren, indem Sie auf die Ordnersymbole in der Listenansicht klicken oder auf die Knöpfe <guibutton>Hoch</guibutton>, <guibutton>Zurück</guibutton> und <guibutton>Vorwärts</guibutton>.

source: By default, the preview dialog only shows folders and files that are not hidden. You can change this behavior in the <link linkend="configuration_user_interface_preview_hidden">configuration dialog</link>. File transfers or the like are not possible.
de: In der Voreinstellung werden im Vorschaudialog nur Dateien und Ordner angezeigt, die nicht versteckt sind. Diese Verhalten können Sie im <link linkend="configuration_user_interface_preview_hidden">Einrichtungsdialog</link> ändern. Dateiübertragungen oder ähnliches sind hier nicht möglich.

source: Providing Authentication Information
de: Eingabe von Authentifizierungsdaten

source: Many servers or remote shares are password protected. In that case, a password dialog appears asking you for the user name and password. The same happens, if you click the <menuchoice><shortcut><keycombo action="simul">&Ctrl; <keycap>T</keycap></keycombo></shortcut><guimenuitem>Authentication</guimenuitem></menuchoice> menu entry.
de: Viele Server und entfernte Freigaben sind durch ein Passwort geschützt. In diesem Fall erscheint ein Dialog, in dem der Benutzername und das Passwort abgefragt wird. Der gleiche Dialog wird angezeigt, wenn Sie <menuchoice><shortcut><keycombo action="simul">&Ctrl; <keycap>T</keycap></keycombo></shortcut><guimenuitem>Authentifizierung</guimenuitem></menuchoice> auswählen.

source: Screenshot of the authentication dialog
de: Bildschirmfoto des Authentifizierungsdialogs

source: The authentication dialog
de: Der Authentifizierungsdialog

source: If a user name has already been provided, it will be shown in the respective field. If it is wrong or no user name was provided, you have to enter one. The password, however, may be left blank. Clicking the <guibutton>OK</guibutton> button will commit the data. Depending on your choice in the <link linkend="configuration_authentication">configuration dialog</link>, the user name and password will be stored permanently in a digital wallet, temporarily until &smb4k; exits or not all. In the latter case you will have to provide them <emphasis>every time</emphasis> they are needed.
de: Wurde bereits ein Benutzername angegeben, wird er im entsprechenden Feld angezeigt. Ist der Name falsch oder Fehler er, müssen Sie ihn eingeben. Das Passwortfeld kann jedoch leer bleiben. Klicken Sie auf den Knopf <guibutton>OK</guibutton>, dann werden die Daten übermittelt. Abhängig von Ihrer Auswahl im <link linkend="configuration_authentication">Einrichtungsdialog</link> werden Benutzername und Passwort dauerhaft in einem digitalen Passsportspeicher abgelegt, zeitweise in &smb4k; bis zum Beenden oder gar nicht. Im letzten Fall müssen Sie diese Daten <emphasis>jedes mal</emphasis>wieder eingeben, wenn Sie gebraucht werden.

source: Defining Custom Options
de: Benutzerdefinierte Einstellungen festlegen

source: If you need to define special options for a single server or share that are different from the global ones that are set in the configuration dialog, you can do this with the <guilabel>Custom Options</guilabel> dialog. It is opened by clicking the <menuchoice><shortcut><keycombo action="simul">&Ctrl; <keycap>C</keycap></keycombo></shortcut><guimenuitem>Custom Options</guimenuitem></menuchoice> menu entry.
de: Brauchen Sie besondere Optionen für einen einzelnen Server oder Freigabe, die von den globalen Optionen im Einrichtungsdialog abweichen, sollten Sie den Dialog <guilabel>Benutzerdefinierte Einstellungen</guilabel> verwenden. Diesen Dialog öffnen Sie mit dem Menüeintrag <menuchoice><shortcut><keycombo action="simul">&Ctrl; <keycap>C</keycap></keycombo></shortcut><guimenuitem>Benutzerdefinierte Einstellungen</guimenuitem></menuchoice>.

source: Screenshot of the custom options dialog for a share
de: Bildschirmfoto des Dialogs „Benutzerdefinierte Einstellungen“ für eine Freigabe

source: The custom options dialog
de: Der Dialog „Benutzerdefinierte Einstellungen“

source: You can define custom Samba options here and set up the Wake-On-LAN feature. For the latter, you need to have Wake-On-LAN enabled in the <link linkend="configuration_network_wake_on_lan">configuration dialog</link>.
de: Sie können hier eigene Einstellungen für Samba definieren und die Funktion Wake-On-LAN einrichten. Dazu müssen Sie Wake-On-LAN im <link linkend="configuration_network_wake_on_lan">Einrichtungsdialog</link> aktivieren.

source: The <guibutton>Default</guibutton> button is enabled if the entries in the dialog deviate from the settings you defined in the configuration dialog. By clicking it, you can reset the entries in the dialog to these default ones. The <guibutton>OK</guibutton> button is enabled if you changed the settings in the dialog. Clicking it will commit the custom settings and close the dialog.
de: Der Knopf <guibutton>Voreinstellungen</guibutton> wird aktiviert, wenn die Einstellungen im Dialog von den im Einrichtungsdialog definierten abweichen. Dann können Sie durch Klicken auf diesen Knopf alle Werte wieder auf die Voreinstellung zurücksetzen. Der Knopf <guibutton>OK</guibutton> wird aktiviert, wenn Sie Einstellungen im Dialog geändert haben. Klicken Sie darauf, um die Einstellungen zu übernehmen und den Dialog zu schließen.

source: Under FreeBSD, the dialog contains less entries than if you run a different operating system, because several of the options are not supported.
de: Unter FreeBSD enthält dieser Dialog weniger Einträge als unter anderen Betriebssystemen, weil mehrere Optionen nicht unterstützt werden.

source: Depending on your selection, the settings in the custom options dialog either apply to all shares of a server or to a single one. You can define the SMB port, the file system port (&Linux; only), the write access, the user ID, the group ID and if Kerberos should be used for authentication. For detailed information on the individual settings, please see <link linkend="configuration_samba">here</link>.
de: Abhängig von Ihrer Auswahl werden die benutzerdefinierten Einstellungen im Dialog entweder auf alle oder nur eine einzelne Freigabe eines Servers angewendet. Sie können den SMB-Port, den Dateisystem-Port (nur für &Linux;), den Schreibzugriff, Benutzer- und Gruppenkennung eingeben und einstellen, ob Kerberos für die Authentifizierung benutzt wird. Weitere Informationen über die einzelnen Einstellungen finden Sie <link linkend="configuration_samba">hier</link>.

source: To make the Wake-On-LAN feature work, you need to provide the MAC address of the server you selected. Currently, &smb4k; has no way to determine the MAC address, so you need to find it out on your own. Afterwards, you can define if &smb4k; should send a magic Wake-On-LAN package to the selected host before the network neighborhood is scanned and/or one of its shares is mounted.
de: Damit die Funktion Wake-On-LAN funktioniert, müssen Sie die MAC-Adresse des ausgewählten Servers angeben. Zurzeit kann &smb4k; die MAC-Adresse nicht selbst ermitteln, daher müssen Sie sie selbst feststellen. Danach können Sie festlegen, ob &smb4k; ein magisches Wake-On-LAN-Paket an den ausgewählten Rechner sendet, ehe die Netzwerkumgebung durchsucht wird und/oder eine der zugehörigen Freigaben eingebunden wird.

source: Adding Bookmarks
de: Lesezeichen hinzufügen
