Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/extragear-network/smb4k.po
Languages: de

source: The &smb4k; Handbook
de: Das Handbuch zu &smb4k;

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Burkhard</firstname><surname>Lück</surname><affiliation><address><email>lueck@hube-lueck.de</email></address></affiliation><contrib>Übersetzung</contrib></othercredit>

source: &smb4k; is an advanced network neighborhood browser and a front end to the programs of the Samba software suite.
de: &smb4k; ist ein erweiterter Browser für die Netzwerkumgebung und eine Bedienungsoberfläche für die Samba-Softwareprogramme.

source: Introduction
de: Einleitung

source: This handbook describes &smb4k; 1.1.x and to some extent earlier versions.
de: Dieses Handbuch beschreibt &smb4k; in der Version 1.1.x und teilweise auch frühere Versionen.

source: &smb4k; is an advanced network neighborhood browser and a front end to the programs of the <ulink url="http://www.samba.org">Samba software suite</ulink>. It provides many handy features that ease your life in a mostly &Windows;-dominated network environment:
de: &smb4k; ist ein erweiterter Browser für die Netzwerkumgebung und eine Bedienungsoberfläche für die <ulink url="http://www.samba.org">Samba-Softwaresammlung</ulink>. Es bietet viele praktische Funktionen, die den Umgang mit einer &Windows;-dominierten Netzwerkumgebung erleichtern.

source: Scanning for (active) workgroups, hosts, and shares
de: Suche nach (aktiven) Arbeitsgruppen, Rechnern und Freigaben

source: Support of the CIFS (&Linux;) and SMBFS (FreeBSD) file system
de: Unterstützung für CIFS-Dateisysteme unter &Linux; und SMBFS-Dateisysteme unter FreeBSD

source: Mounting and unmounting of shares
de: Einbinden und Lösen von Freigaben

source: Access to the files of a mounted share using a file manager or terminal
de: Zugriff auf die Dateien einer eingebundenen Freigabe mit einem Dateiverwaltungsprogramm oder einem Terminal

source: Auto-detection of external mounts and unmounts
de: Automatische Erkennung externer Medien, die eingebunden oder ausgehängt werden

source: Remounting of previously used shares on program start
de: Erneute Einbindung von vorher benutzten Freigaben beim Start des Programms

source: Miscellaneous infos about remote network items and mounted shares
de: Verschiedene Informationen über Netzwerke auf anderen Rechnern und eingebundene Freigaben

source: Network search
de: Netzwerksuche

source: WINS server support
de: Unterstützung für WINS-Server

source: Preview of the contents of a share
de: Vorschau des Inhalts einer Freigabe

source: Several methods to look up the initial list of workgroups and domains
de: Mehrere Methoden zur Suche nach der anfänglichen Liste von Arbeitsgruppen und Domänen

source: Default login
de: Standardanmeldung

source: Special handling of homes shares
de: Besondere Behandlung freigegebener persönlicher Ordner

source: Ability to bookmark favorite shares
de: Lesezeichen für bevorzugte Freigaben

source: <para>System tray widget</para>
de: <para>Symbol im Systemabschnitt der Kontrollleiste</para>

source: Support of advanced Samba options
de: Unterstützung der erweiterten Samba-Einstellungen

source: Support of printer shares
de: Unterstützung für Drucker-Freigaben

source: KWallet support
de: Unterstützung für KWallet

source: Synchronization of a remote share with a local copy and vice versa
de: Abgleich einer entfernten Freigabe mit einer lokalen Kopie und umgekehrt

source: Ability to define custom options for individual servers and shares
de: Fähigkeit zur Definition von benutzerdefinierten Einstellungen für einzelne Server und Freigaben.

source: Laptop support through the Solid hardware device framework
de: Laptop-Unterstützung durch das Solid-Framework für Hardware-Geräte

source: Wake-On-LAN capabilities
de: „Wake-On-LAN“-Fähigkeiten

source: &plasmoid; for desktop integration
de: &plasmoid; für die Integration in die Arbeitsfläche

source: If you encounter problems while using &smb4k;, please visit our <ulink url="https://sourceforge.net/p/smb4k/wiki/Home/">wiki</ulink> first. If you cannot find your problem described there, please post a help request to our <ulink url="https://sourceforge.net/p/smb4k/discussion/help/">Help</ulink> forum. In case you find a bug, please report it to our <ulink url="https://sourceforge.net/p/smb4k/tickets/">bug tracker</ulink>.
de: Haben Sie Probleme bei der Anwendung von &smb4k;, besuchen Sie bitte zuerst unser <ulink url="https://sourceforge.net/p/smb4k/wiki/Home/">Wiki</ulink>. Finden Sie hier keine Lösung für Ihr Problem, schicken Sie eine Bitte um Hilfe an das Forum <ulink url="https://sourceforge.net/p/smb4k/discussion/help/">Hilfe</ulink>. Finden Sie einen Fehler, berichten Sie ihn bitte in unserem <ulink url="https://sourceforge.net/p/smb4k/tickets/">Fehlerverfolgungssystem</ulink>.

source: For discussions about &smb4k;-related topics there is the <ulink url="https://sourceforge.net/p/smb4k/discussion/general/">General Discussion</ulink> forum and we invite every user to participate.
de: Für Diskussionen über Themen zu &smb4k; gibt es das Forum <ulink url="https://sourceforge.net/p/smb4k/discussion/general/">Allgemeine Diskussion</ulink> und wir laden alle Personen ein, dort teilzunehmen.

source: Using &smb4k;
de: &smb4k; verwenden

source: Running &smb4k;
de: Starten von &smb4k;

source: After the installation, you can run &smb4k; either from the K menu or from the command prompt by typing
de: Nach der Installation können Sie &smb4k; entweder aus dem K-Menü starten oder durch Eingabe des folgenden Befehls in einer Konsole oder KRunner:

source: &smb4k; does not take any arguments, except those that are known to all &kde; programs.
de: &smb4k; übernimmt außer den Optionen für alle &kde;-Programme keine speziellen Befehlszeilenoptionen.

source: &smb4k; also comes with a plasmoid for better desktop integration. It can be added as widget to the desktop or the panel.
de: &smb4k; enthält auch ein Plasmoid für eine bessere Integration in die Arbeitsfläche. Es kann zur Arbeitsfläche oder zur Kontrollleiste hinzugefügt werden.

source: If your system is missing some of the programs &smb4k; needs to operate properly, it notifies the user:
de: Fehlen auf Ihren System einige Programme, die &smb4k; für die Ausführung braucht, wird der Benutzer darüber benachrichtigt.

source: Screenshot of the missing program notification
de: Bildschirmfoto der Benachrichtigung über fehlende Programme

source: The missing program notification
de: Die Benachrichtigung über fehlende Programme

source: In this case, please install the listed programs or, if they are already present, add their location to the <envar>PATH</envar> environment variable in your shell's configuration file (for the <ulink url="man:/bash"><citerefentry><refentrytitle>bash</refentrytitle><manvolnum>1</manvolnum></citerefentry></ulink> shell it is the <filename>~/.bashrc</filename> file).
de: In diesem Fall installieren Sie bitte die aufgelisteten Programme oder fügen Sie ihren Speicherort zur Umgebungsvariable <envar>PATH</envar> in der Einrichtungsdatei für Ihre Shell hinzu, wenn sie bereits installiert sind. Für die <ulink url="man:/bash"><citerefentry><refentrytitle>bash</refentrytitle><manvolnum>1</manvolnum></citerefentry></ulink>-Shell ist die Datei <filename>~/.bashrc</filename>

source: In addition, it is recommended that you configure Samba before using &smb4k;. The <ulink url="man:/swat"><citerefentry><refentrytitle>swat</refentrytitle><manvolnum>8</manvolnum></citerefentry></ulink> utility can be used for this purpose. It is part of the Samba software suite and provides an easy-to-use web interface. See its manual page for documentation.
de: Zusätzlich wird empfohlen, Samba einzurichten ehe Sie &smb4k; benutzen. Das Dienstprogramm <ulink url="man:/swat"><citerefentry><refentrytitle>swat</refentrytitle><manvolnum>8</manvolnum></citerefentry></ulink> kann dazu verwendet werden. Es ist Teil der Samba-Softwaresammlung und stellt eine einfach zu benutzende Web-Schnittstelle zur Verfügung. Lesen Sie die Handbuchseite, um weitere Informationen zu finden.

source: The Main Window
de: Das Hauptfenster

source: On the first start-up, the main window of &smb4k; looks similar to the one shown below. The network neighborhood browser (<guilabel>Network Neighborhood</guilabel>), the network search widget (<guilabel>Network Search</guilabel>) and the mounted shares view (<guilabel>Mounted Shares</guilabel>) are arranged in a tab widget. Above them the menubar and toolbar(s) are located. Below them you find the status bar.
de: Beim ersten Start sieht das Hauptfenster von &smb4k; wie im folgenden Bildschirmfoto aus. Der Browser für die Netzwerkumgebung (<guilabel>Netzwerkumgebung</guilabel>), die Netzwerksuche (<guilabel>Netzwerksuche</guilabel>) und die Ansicht der eingebundenen Freigaben (<guilabel>Eingebundene Freigaben</guilabel>) sind als Karteikarten angeordnet. Darüber finden Sie die Menüleiste und die Werkzeugleiste, darunter die Statusleiste.

source: Screenshot of the main window
de: Bildschirmfoto des Hauptfensters

source: The main window
de: Das Hauptfenster

source: Since version 1.1.0, &smb4k; comes with a compact unified toolbar as the default, but the user can still choose to use multiple toolbars. If you wish to use the classical way, four toolbars are defined, for each widget one: the main toolbar, the toolbars for the <guilabel>Network Neighborhood</guilabel> widget, the <guilabel>Shares View</guilabel> widget and the <guilabel>Network Search</guilabel> widget. The unified toolbar contains some of the main actions, like <guimenuitem>Configure &smb4k;</guimenuitem> and <guimenuitem>Quit</guimenuitem>. It also dynamically loads the actions of the dock widget that currently has got the focus. For additional information and some important warnings, please have a look at the sections discussing the <link linkend="network_neighborhood_browser">network neighborhood browser</link>, <link linkend="network_search_dialog">search dialog</link>, and <link linkend="mounted_shares_view">mounted shares view</link>.
de: Seit Version 1.10 hat &smb4k; eine kompakte einheitliche Werkzeugleiste als Standard, aber Sie können noch immer mehrere Werkzeugleisten auswählen. Möchten Sie eine klassische Anordnung verwenden, dann sind dafür vier Werkzeugleisten definiert, für jedes Fenster eine: Die Haupt-Werkzeugleiste und die Werkzeugleisten für die Unterfenster <guilabel>Netzwerkumgebung</guilabel>, <guilabel>Netzwerksuche</guilabel> und <guilabel>Eingebundene Freigaben</guilabel>. Die einheitliche Werkzeugleiste enthält einige der wichtigen Aktionen wie <guimenuitem>&smb4k; einrichten</guimenuitem> und <guimenuitem>Beenden</guimenuitem>. Diese Leiste lädt dynamisch die Aktionen des zugehörigen Unterfensters, wenn es aktiviert wird. Zusätzliche Informationen und einige wichtige Hinweise finden Sie in den Abschnitten über den <link linkend="network_neighborhood_browser">Browser für die Netzwerkumgebung</link>, die <link linkend="network_search_dialog">Netzwerksuche</link> und die <link linkend="mounted_shares_view">Ansicht der eingebundenen Freigaben</link>.

source: The status bar gives some information about the current status of &smb4k;. If the application is processing a user request (&eg; mounting a share), a descriptive message is displayed in the leftmost section and a progress bar is shown with a busy indicator. The two icons on the right hand side indicate if there are shares mounted (remote folder icon) and the status of the authentication system (wallet or key icon).
de: In der Statusleiste werden Informationen über den aktuellen Status von &smb4k; angezeigt. Bearbeitet das Programm eine Benutzeranfrage wie &eg; das Einbinden einer Freigabe, wird eine Nachricht im linken Abschnitt und eine Fortschrittsanzeige mit einer Animation gezeigt. Die beiden Symbole rechts zeigen an, ob Freigaben eingebunden sind (Symbol entfernter Ordner) und den Status des Authentifizierungssystems (Symbol für Passwortspeicher oder Schlüssel).

source: If the dock widgets are arranged as tabs, the user gets additional visual feedback. Each time a share is mounted or unmounted, the <guilabel>Mounted Shares</guilabel> tab is highlighted for a few seconds.
de: Sind die Fenster als Unterfenster angeordnet, erhält der Benutzt zusätzlich eine visuelle Meldung. Jedes mal wenn eine Freigabe eingebunden oder gelöst wird, wird der Karteireiter <guilabel>Eingebundene Freigaben</guilabel> für einige Sekunden hervorgehoben.

source: The main window is highly configurable. You can hide or show all tabbed widgets (<menuchoice><guimenu>Settings</guimenu><guimenuitem>Dock Widgets</guimenuitem></menuchoice>). They can also be dragged around with the mouse and docked to different areas in the main window. You can even detach them from the main window. The status bar and the toolbars can be hidden/shown by toggling the menu entry <menuchoice><guimenu>Settings</guimenu><guimenuitem>Show Statusbar</guimenuitem></menuchoice> and the ones under <menuchoice><guimenu>Settings</guimenu><guimenuitem>Toolbars Shown</guimenuitem></menuchoice>, respectively.
de: Das Hauptfenster kann in großem Umfang angepasst werden. Sie können alle Unterfenster mit <menuchoice><guimenu>Einstellungen</guimenu><guimenuitem>Andockfenster</guimenuitem></menuchoice> ein- oder ausblenden. Sie können außerdem auch mit der Maus herumgezogen und in verschiedenen Bereichen des Hauptfensters angeordnet werden. Sie können sie sogar aus dem Hauptfenster lösen. Die Statusleiste und die Werkzeugleisten können mit dem Menüeintrag <menuchoice><guimenu>Einstellungen</guimenu><guimenuitem>Statusleiste anzeigen</guimenuitem></menuchoice> und den Einträgen unter <menuchoice><guimenu>Einstellungen</guimenu><guimenuitem>Angezeigte Werkzeugleisten</guimenuitem></menuchoice> ein- und ausgeblendet werden.

source: The Network Neighborhood Browser
de: Der Browser für die Netzwerkumgebung

source: The interaction with the network neighborhood is done with the <guilabel>Network Neighborhood</guilabel> browser. It contains all network items &#8212; &ie; workgroups, servers, and shares &#8212; &smb4k; was able to find. They are organized in a network tree, and you can navigate through it by either clicking the [+] next to the item name or by executing the item itself.
de: Die Interaktion mit dem Netzwerk findet in dem Unterfenster <guilabel>Netzwerkumgebung</guilabel> statt. Es enthält alle Netzwerkeinträge &#8212; &ie; Arbeitsgruppen, Server und Freigaben &#8212;, die &smb4k; finden konnte. Die Einträge werden in einer Baumansicht angeordnet und Sie darin navigieren, indem Sie auf das [+] neben dem Namen des Eintrags oder durch die Ausführung des Eintrags selbst.

source: In the network tree, the master browser of each workgroup or domain is highlighted by blue font color. Mounted shares are marked with the respective folder icon.
de: In der Baumstruktur des Netzwerks ist der Master-Browser jeder Arbeitsgruppe oder Domain in blauer Farbe hervorgehoben. Eingebundene Freigaben sind durch das entsprechende Ordnersymbol gekennzeichnet.

source: Screenshot of the network neighborhood browser
de: Bildschirmfoto des Browsers für die Netzwerkumgebung

source: The network neighborhood browser
de: Der Browser für die Netzwerkumgebung

source: Browsing
de: Netzwerk durchsuchen

source: &smb4k; automatically scans the network neighborhood for active workgroups and domains on start-up and presents them in the network neighborhood browser. Opening a workgroup item shows the servers belonging to it. If you want to access the shares of one of the servers, you have to open the desired server.
de: &smb4k; durchsucht beim Start automatisch die Netzwerkumgebung nach aktiven Arbeitsgruppen und Domains und zeigt Sie in der Karteikarte Netzwerkumgebung an. Beim Öffnen eines Arbeitsgruppeneintrags werden zu zugehörigen Server angezeigt. Möchten Sie auf die Freigaben auf einem der Server zugreifen, müssen Sie den gewünschter Server öffnen.

source: There are two scan modes available. The traditional one, where initially only workgroups and domains are looked up and scans are only made when necessary &#8212; &ie; when you execute a network item &#8212;, and one, where the network is scanned periodically for <emphasis>all</emphasis> available network items including servers and shares. While the former one is the default, the latter one can be enabled in the <link linkend="configuration_network_periodic_scanning">configuration dialog</link>.
de: Es gibt zwei Möglichkeiten zum Durchsuchen. Die traditionelle Methode, bei der zu Anfang nur nach Arbeitsgruppen und Domänen gesucht und das nur wenn nötig &#8212; &ie; wenn Sie einen Netzwerkeintrag aufrufen &#8212; und eine andere Methode, bei der das Netzwerk periodisch nach <emphasis>allen</emphasis> verfügbaren Netzwerkeinträgen einschließlich Servern und Freigaben durchsucht wird. Die erste Methode ist die Standardeinstellung, die andere kann im <link linkend="configuration_network_periodic_scanning">Einrichtungsdialog</link> aktiviert werden.

source: There are <link linkend="configuration_network_browselist">four methods</link> to retrieve the browse list: The default one is to scan the network neighborhood for all available master browsers. The second and third method directly query a master browser to get the browse list. The difference is that the former is a dynamic one, where the current master browser of your workgroup or domain is looked up and used, and the latter is a static one, where a fixed name or IP address is used. It is recommended that you choose the dynamic method. However, there might be circumstances that make it necessary to use a static name or IP address. The last method searches for all registered IP addresses within a given broadcast area. This might come in handy on poorly performing network neighborhoods.
de: Es gibt <link linkend="configuration_network_browselist">vier Methoden</link>, um die Browseliste zu holen: Der Standard ist das Durchsuchen der Netzwerkumgebung nach allen verfügbaren Masterbrowsern. Die zweite und dritte Methode fragen direkt einen Masterbrowser nach der Browseliste. Die zweite Methode ist dynamisch, dabei wird der aktuelle Masterbrowser Ihrer Arbeitsgruppe oder Domäne durchsucht und benutzt. Die zweite Methode ist statisch, dabei wird eine festgelegter Name oder IP-Adresse verwendet. Es wird empfohlen, die dynamische Methode zu verwenden. Manchmal gibt es Umstände, die die statische Methode erfordern. Die letzte Methode sucht nach allen registrierten IP-Adressen in einem vorgegebenen Broadcast-Bereich. Die ist nützlich bei Netzwerkumgebungen mit geringem Netzwerkdurchsatz.

source: There is also the possibility to wake up sleeping servers prior to scanning the network neighborhood (Wake-On-LAN). If this feature is enabled, &smb4k; sends a magic package to each server that is to be woken up and waits the defined time until it starts the lookup of the workgroups and domains. The Wake-On-LAN setting can be turned on in the <link linkend="configuration_network_wake_on_lan">configuration dialog</link>. The servers that should to be woken up can be defined in the <link linkend="network_neighborhood_browser_custom">Custom Options</link> dialog.
de: Es gibt auch die Möglichkeit, einen ausgeschalteten Server vor dem Durchsuchen der Netzwerkumgebung zu starten (Wake-On-LAN). Ist diese Funktion aktiviert, sendet &smb4k; ein magisches Paket an jeden Server, der gestartet werden soll, und wartet die definierte Zeit, bevor die Suchen nach Arbeitsgruppen und Domänen gestartet wird. Wake-On-LAN kann im <link linkend="configuration_network_wake_on_lan">Einrichtungsdialog</link> aktiviert werden. Die Server, die über diese Funktion gestartet werden sollen, können im Dialog <link linkend="network_neighborhood_browser_custom">benutzerdefinierte Einstellungen</link> festgelegt werden.

source: Under normal circumstances you should not have any trouble browsing the network neighborhood. In case you experience problems, please read our <ulink url="https://sourceforge.net/p/smb4k/wiki/Home/">wiki</ulink> first before thinking about <ulink url="https://sourceforge.net/p/smb4k/tickets/">reporting a bug</ulink>. It lists some common problems and their solutions.
de: Unter normalen Umständen sollten Sie keine Probleme beim Durchsuchen der Netzwerkumgebung haben. Bei Problemen lesen Sie zuerst unser <ulink url="https://sourceforge.net/p/smb4k/wiki/Home/">Wiki</ulink>, ehe Sie einen <ulink url="https://sourceforge.net/p/smb4k/tickets/">Fehler berichten</ulink>. Im Wiki finden Sie einige häufige Probleme und deren Lösungen.

source: Actions and Popup Menu
de: Aktions- und Kontextmenü

source: For the network neighborhood browser several actions are defined. They are present in the menubar under <guimenu>Network</guimenu>, in the toolbar and the popup menu. The following ones are available:
de: Für die Karteikarte Netzwerkumgebung sind mehrere Aktionen definiert. Sie befinden sich im Menü unter dem Eintrag <guimenu>Netzwerk</guimenu>, in der Werkzeugleiste und dem Kontextmenü. Die folgenden Einträge sind vorhanden:

source: <shortcut><keycap>F5</keycap></shortcut> <guimenuitem>Scan Network|Workgroup|Computer</guimenuitem>
de: <shortcut> <keycap>F5</keycap> </shortcut> <guimenuitem>Netzwerk|Arbeitsgruppe|Rechner durchsuchen</guimenuitem>

source: Scan the whole network neighborhood, the highlighted workgroup/domain or computer for new entries. This action is visible by default and will be replaced by the <guimenuitem>Abort</guimenuitem> action if a network scan is running.
de: Durchsucht die gesamte Netzwerkumgebung, die hervorgehobene Arbeitsgruppe/Domain oder die Rechner nach neuen Einträgen. Diese Aktion wird als Voreinstellung angezeigt und werden durch die Aktion <guimenuitem>Abbrechen</guimenuitem> ersetzt, wenn eine Durchsuchung des Netzwerks läuft.

source: The old keyboard shortcut <keycombo action="simul">&Ctrl; <keycap>R</keycap></keycombo> is still available as an alternative.
de: Als Alternative ist der frühere Kurzbefehl <keycombo action="simul">&Ctrl; <keycap>R</keycap></keycombo> immer noch verfügbar.

source: <shortcut><keycombo action="simul">&Ctrl; <keycap>A</keycap></keycombo></shortcut> <guimenuitem>Abort</guimenuitem>
de: <shortcut> <keycombo action="simul"> &Ctrl; <keycap>A</keycap> </keycombo> </shortcut> <guimenuitem>Abbrechen</guimenuitem>

source: Abort any running process of the network neighborhood browser. This action is invisible by default and will only be visible instead of the <guimenuitem>Scan Network|Workgroup|Computer</guimenuitem> action if a network scan is running.
de: Bricht jeden laufenden Prozess der Netzwerkumgebung ab. Diese Aktion wird in der Voreinstellung ausgeblendet und wird nur angezeigt, wenn eine Aktion wie <guimenuitem>Netzwerk|Arbeitsgruppe|Rechner durchsuchen</guimenuitem> ausgeführt wird.

source: Add Bookmark
de: Lesezeichen hinzufügen

source: Add a bookmark to the currently selected remote share. This action is disabled if no share is selected.
de: Fügt ein Lesezeichen für die aktuell ausgewählte entfernte Freigabe hinzu. Diese Aktion ist dann aktiviert, wenn eine Freigabe ausgewählt ist.

source: Read the <link linkend="mainwindow_add_bookmarks">Adding Bookmarks</link> section for more details.
de: Weitere Informationen dazu finden Sie im Abschnitt <link linkend="mainwindow_add_bookmarks">Lesezeichen hinzufügen</link>.

source: <shortcut><keycombo action="simul">&Ctrl; <keycap>O</keycap></keycombo></shortcut> <guimenuitem>Open Mount Dialog</guimenuitem>
de: <shortcut> <keycombo action="simul"> &Ctrl; <keycap>O</keycap> </keycombo> </shortcut> <guimenuitem>Dialog zum Einbinden öffnen</guimenuitem>
