Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/extragear-network/smb4k.po
Languages: de

source: A tooltip will be shown if you move the mouse pointer over an item in the shares view. It contains information about the underlying item such as the share name, UNC address, mount point, owner and group, login (CIFS file system, &Linux; only), disk usage, &etc;
de: Eine Kurzinfo wird angezeigt, wenn Sie den Mauszeiger auf einen Eintrag in der Freigaben bewegen. Die enthält Informationen über den Eintrag wie zum Beispiel den Namen der Freigabe, die UNC-Adresse, Mount-Punkt, Eigentümer und Gruppe bei CIFS-Dateien nur unter &Linux;, Speicherbelegung &etc;

source: Preview Dialog
de: Vorschaudialog

source: Hidden Files &amp; Directories
de: Versteckte Dateien &amp; Ordner

source: Preview hidden files and directories
de: Vorschau von versteckten Dateien und Ordnern anzeigen

source: Show all files and directories including the hidden ones when opening a share's contents in the preview dialog. By default, this feature is deselected.
de: Zeigt alle Dateien und Ordner einschließlich der versteckten Einträge beim Öffnen des Inhalts einer Freigabe im Vorschaudialog. In der Voreinstellung ist dies nicht eingeschaltet.

source: Network
de: Netzwerk

source: The options in the <guilabel>Network</guilabel> configuration tab can be used to change the lookup method for the browse list, to make &smb4k; send authentication information when querying the workgroup master browsers, and to enable periodic scanning as well as the Wake-On-LAN features. If you want to adjust the behavior of Samba programs, see the <link linkend="configuration_samba">Samba</link> section.
de: Die Einstellungen auf der Seite <guilabel>Netzwerk</guilabel> können benutzt werden, um die Methoden zum Durchsuchen der Browseliste zu ändern, &smb4k; Authentifizierungsdaten bei der Abfrage der Masterbrowser der Arbeitsgruppe zu senden und das periodische Durchsuchen wie auch die Funktionen Wake-On-LAN einzustellen. Möchten Sie das Verhalten von Samba-Programmen anpassen, siehe den Abschnitt <link linkend="configuration_samba">Samba</link>

source: Screenshot of the "Network" configuration tab
de: Bildschirmfoto der Einrichtungsseite „Netzwerk“

source: The "Network" configuration tab
de: Die Einrichtungsseite „Netzwerk“

source: Browse List
de: Browseliste

source: Scan the network neighborhood for available workgroups and domains
de: Netzwerkumgebung nach Arbeitsgruppen und Domänen durchsuchen

source: &smb4k; will search for all available master browsers on the network by using <ulink url="man:/nmblookup"><citerefentry><refentrytitle>nmblookup</refentrytitle><manvolnum>1</manvolnum></citerefentry></ulink>. This is the default method and it is very reliable in finding all workgroups and domains of your network neighborhood. However, it suffers a few shortcomings like poor unicode support (&eg; umlauts might be replaced by dots).
de: &smb4k; sucht nach allen verfügbaren Masterbrowsern im Netzwerk mit dem Programm <ulink url="man:/nmblookup"><citerefentry><refentrytitle>nmblookup</refentrytitle><manvolnum>1</manvolnum></citerefentry></ulink>. Dies ist das Standardverfahren und sehr verlässlich beim Suchen aller Arbeitsgruppen und Domänen ind Ihrer Netzwerkumgebung. Es gibt dabei jedoch einige Einschränkungen wie eine begrenzte Unterstützung für Unicode, &eg; können Umlaute durch Punkte ersetzt werden.

source: Query the current workgroup master browser
de: Derzeitigen Masterbrowser der Arbeitsgruppe abfragen

source: The current master browser of your workgroup or domain is looked up and queried for the browse list. If some of the workgroup names of your network neighborhood contain umlauts or other special characters, you might want to try this method, since unicode is supported. However, sometimes outdated workgroup master browsers might be returned.
de: Der aktuelle Masterbrowser der Arbeitsgruppe oder Domäne wird gesucht und die Browseliste abgefragt. Enthalten die Namen von Arbeitsgruppen in Ihrer Netzwerkumgebung Umlaute oder Sonderzeichen, sollten Sie diese Methode versuchen, da dabei Unicode unterstützt wird. Manchmal werden jedoch veraltete Masterbrowser zurückgegeben.

source: Query this custom master browser
de: Diesen Masterbrowser abfragen

source: The master browser entered in the text box will be queried to retrieve the browse list. It can be specified by using either its NetBIOS name or its IP address. This option might be of use if you have an uncommonly configured network neighborhood.
de: Der im Textfeld eingegebene Masterbrowser wird abgefragt, um die Browseliste zu holen. Der Masterbrowser kann entweder durch seinen NetBIOS-Namen oder seine IP-Adresse bestimmt werden. Diese Einstellung kann nützlich sein, wenn Sie eine ungewöhnlich eingerichtete Netzwerkumgebung haben.

source: Scan these broadcast areas
de: Diese Broadcast-Bereiche durchsuchen

source: &smb4k; will scan for and return all IP addresses that are registered within the given broadcast area(s). Please note that this is not a "real" IP address scan, because that would take ages. The broadcast areas have to be given in a comma-separated list and in the form x.y.z.255: <screen>192.168.1.255, 192.168.2.255, 10.0.0.255</screen> The IP address/mask pair (192.168.1.1/24) does not work.
de: &smb4k; sucht und gibt alle IP-Adressen zurück, die im angegebenen Broadcast-Bereich registriert sind. Beachten Sie, dass das kein "richtiges" Suchen nach IP-Adressen ist, da das viel zu lange dauert. Die Broadcast-Bereich müssen in einer Liste durch Komma getrennt in der Form x.y.z.255 angegeben werden: <screen>192.168.1.255, 192.168.2.255, 10.0.0.255</screen> IP-Adressmasken wie 192.168.1.1/24 können nicht verwendet werden.

source: Authentication
de: Authentifizierung

source: The master browsers require authentication to return the browse list
de: Die Masterbrowser benötigen Authentifizierung, um die Browseliste bekanntzugeben

source: If the workgroup master browsers require authentication to return the browse list, you need to check this button. This may be the case for example with some NAS devices. This setting is rarely needed and might even cause a master browser to return an empty browse list. It will not have any effect when you let &smb4k; scan broadcast areas.
de: Wenn die Masterbrowser der Arbeitsgruppe einen Authentifizierung benötigen, um die Browseliste zurückzugeben, müssen Sie dies ankreuzen. Dies kann zum Beispiel für einige NAS-Geräte erforderlich sein. Diese Einstellung wird selten gebraucht und kann sogar dazu führen, dass der Masterbrowser eine leere Browseliste zurück gibt. Diese Einstellung ist wirkungslos, wenn &smb4k; Broadcast-Bereiche durchsucht.

source: Periodic Scanning
de: Periodisches Durchsuchen

source: Scan the network neighborhood periodically
de: Netzwerkumgebung periodisch durchsuchen

source: If you want to enable periodic scanning of the network neighborhood, you need to check this button. With this method, all available network items are looked up, &ie; workgroups and domains, servers and shares.
de: Möchten Sie das periodische Durchsuchen der Netzwerkumgebung aktivieren, müssen Sie diese Einstellung ankreuzen. Dann wird nach allen verfügbaren Netzwerkeinträgen gesucht, &ie; Arbeitsgruppen und Domänen, Servern und Freigaben.

source: Interval between scans
de: Intervall zwischen Abfragen

source: If periodic scanning is enabled, this is the time in minutes that elapses until a new scan is triggered.
de: Ist das periodische Durchsuchen eingeschaltet, gibt dieser Wert die Wartezeit an, bis eine erneute Abfrage gestartet wird.

source: Default: 5 min
de: Voreinstellung: 5 Minuten

source: To be able to use the Wake-On_LAN capability of &smb4k;, you have to enable the setting in this section. The hosts that should to be woken up have to be defined through the <link linkend="configuration_custom_options">custom options dialog</link>.
de: Um die Wake-On_LAN-Fähigkeiten von &smb4k; zu benutzen, müssen Sie die Einstellungen in diesem Abschnitt aktivieren. Die Rechner, die aufgeweckt werden sollen, müssen im <link linkend="configuration_custom_options">benutzerdefinierten Einrichtungsdialog</link> definiert werden.

source: Enable Wake-On-LAN features
de: Wake-On-LAN-Eigenschaften aktivieren

source: Enable Wake-on-LAN (WOL) features. Wake-On-LAN is an ethernet computer networking standard that allows a computer to be turned on or woken up by a network message. Smb4K uses a magic package send via a UDP socket to wake up remote servers. If you want to take advantage of the Wake-On-LAN feature, you need to enable this option.
de: Aktiviert Wake-On-LAN (WOL). Wake-On-LAN ist ein Standard, der das Anschalten oder Aufwecken eines Rechners durch ein über das Netzwerk gesendetes Datenpaket erlaubt. Smb4K nutzt ein über einen UDP-Socket verschicktes „magisches“ Datenpaket, um entfernte Rechner aufzuwecken. Falls Sie von der Wake-On-LAN-Eigenschaft Gebrauch machen wollen, müssen Sie diese Option einschalten.

source: Waiting time
de: Wartezeit

source: This is the waiting time in seconds between the sending of the magic Wake-On-LAN packages and the scanning of the network neighborhood or the mounting of a share.
de: Dies ist die Wartezeit in Sekunden, die zwischen dem Senden der „magischen“ Wake-On-LAN-Datenpakete und dem Durchsuchen der Netzwerkumgebung oder dem Einbinden von Freigaben vergeht.

source: Default: 5 s
de: Voreinstellung: 5 Sekunden

source: Shares
de: Freigaben

source: These options determine where &smb4k; will mount the remote shares and how it behaves on start-up and exit regarding mounted or recently used shares. If you want to configure the mount options, please see the <link linkend="configuration_samba">Samba</link> section.
de: Diese Einstellungen bestimmen, wo &smb4k; die entfernten Freigaben einbindet wie es sich Beim Starten und Beenden bezüglich eingebundener oder zuletzt benutzter Freigaben verhält. Möchten Sie die Einstellungen zum Einbinden einrichten, lesen Sie bitte den Abschnitt <link linkend="configuration_samba">Samba</link>.

source: Screenshot of the "Shares" configuration tab
de: Bildschirmfoto der Einrichtungsseite „Freigaben“

source: The "Shares" configuration tab
de: Die Einrichtungsseite „Freigaben“

source: Directories
de: Ordner

source: Mount prefix
de: Basisordner für das Einbinden

source: This is the base folder (mount prefix) where &smb4k; will mount the remote shares. It can be changed by using the &URL; requester (Click the button with the folder icon.) or by directly entering the new path into the text box. Path variables like <envar>$HOME</envar> are recognized.
de: Dies ist der Basisordner (Mount-Punkt), unter der &smb4k; die entfernten Freigaben einbindet. Dieser Ordner kann durch Klicken auf das Ordnersymbol oder durch direkte Eingabe des neuen Pfads in das Eingabefeld geändert werden. Pfadvariablen wie <envar>$HOME</envar> werden erkannt.

source: Default: <filename class="directory">$HOME/smb4k/</filename>
de: Voreinstellung: <filename class="directory">$HOME/smb4k/</filename>

source: Force generated subdirectories to be lower case
de: Kleinschreibung für die erstellten Unterordner erzwingen

source: All subdirectories that are created by &smb4k; below the mount prefix will be lower case.
de: Alle von &smb4k; unterhalb des Mount-Punkts erstellten Unterordner werden klein geschrieben,

source: Mounting &amp; Unmounting
de: Einbinden &amp; Einbindungen lösen

source: Remount recently used shares on program start
de: Vormals benutzte Freigaben beim Programmstart einbinden

source: All shares that were mounted at the time &smb4k; was shut down will be remounted on program restart. This option affects only the shares that were mounted by you.
de: Alle Freigaben, die beim Beenden von &smb4k; eingebunden waren, werden beim neuen Start des Programms wieder eingebunden. Diese Einstellung betrifft nur die von Ihnen eingebundenen Freigaben.

source: Number of remount attempts
de: Anzahl der Einbindeversuche

source: Set the number of attempts that are made to remount shares before Smb4K gives up.
de: Die Anzahl der Einbindeversuche einstellen, die unternommen werden, bevor Smb4K aufgibt.

source: Default: 1
de: Voreinstellung: 1

source: Interval between remount attempts
de: Intervall zwischen Einbindeversuchen

source: Set the time that elapses between attempts to remount shares.
de: Stellt die Zeit ein, die zwischen den Einbindeversuchen vergeht.

source: Unmount all personal shares on exit
de: Die Einbindungen aller persönlichen Freigaben beim Beenden lösen

source: All mounted shares that are owned by you will be unmounted on program exit.
de: Alle eigenen eingebundenen Freigaben werden beim Programmende gelöst.

source: Force the unmounting of inaccessible shares
de: Das Lösen der Einbindungen von nicht erreichbaren Freigaben erzwingen

source: Force the unmounting of inaccessible shares (&Linux; only). In case a share is inaccessible, a lazy unmount is performed. Before the actual unmount is performed, a warning dialog is shown asking to approve the unmount.
de: Das Lösen der Einbindungen von nicht erreichbaren Freigaben erzwingen (nur &Linux;). Falls eine Freigabe unzugänglich ist, wird ein „lazy unmount“ durchgeführt. Bevor das tatsächliche Trennen stattfindet, wird ein Warndialog mit der Bitte angezeigt, das Lösen der Einbindung zu bestätigen.

source: Allow the unmounting of shares that are owned by other users
de: Das Lösen der Einbindungen von Freigaben erlauben, die zu anderen Benutzern gehören

source: This option will allow you to unmount shares that were mounted by other users.
de: Diese Einstellung erlaubt das Lösen von Freigaben, die von anderen Benutzern eingebunden wurden.

source: USE WITH EXTREME CAUTION!
de: Bitte mit besonderer Sorgfalt verwenden.

source: Checks
de: Überprüfungen

source: Interval between checks
de: Intervall zwischen Überprüfungen

source: &smb4k; periodically checks for newly mounted and inaccessable shares with an interval that can be defined here. Under normal circumstances, you do not need to change it. But if the server you connected to suffers from high load, you should increase the interval to ease it's situation. The effect on your system's load is generally rather small unless you set the interval below 1000 ms (not recommended).
de: &smb4k; überprüft die Netzwerkumgebung in dem hier angegeben Zeitabstand periodisch auf neue eingebundene und nicht erreichbare Freigaben. Unter normalen Umständen muss diese Einstellung nicht geändert werden. Hat jedoch der Server, mit dem Sie verbunden sind, eine hohe Last, sollten Sie dieses Intervall vergrößern. Die Auswirkungen auf die Systemlast ist im allgemeinen eher gering, wenn nicht nicht ein Intervall unter 1000 ms einstellen, was aber nicht zu empfehlen ist.

source: Default: 2500 ms
de: Voreinstellung: 2500 Millisekunden

source: Here you can change the settings affecting the authentication.
de: Hier können Sie die Einstellungen für die Authentifizierung ändern.

source: Screenshot of the "Authentication" configuration tab
de: Bildschirmfoto der Einrichtungsseite „Authentifizierung“

source: The "Authentication" configuration tab
de: Die Einrichtungsseite „Authentifizierung“

source: Password Storage
de: Passwortspeicherung

source: Save logins in a wallet
de: Anmeldungen in einem Passwortspeicher speichern

source: The login names and passwords are stored in a subfolder named <filename role="directory">Smb4K</filename> of the current network wallet (default: "kdewallet"). The advantage of this method is, that the authentication data is stored permanently and encrypted on your hard drive. You only have to provide it once and the next time it is needed, &smb4k; will read it from the wallet. If you uncheck this option, the authentication data will either be stored temporarily or not at all (see below).
de: Die Anmeldenamen und die Passwörter werden in einem Unterordner mit dem Namen <filename role="directory">Smb4K</filename> im aktuellen Passwortspeicher (Standard "kdewallet") abgelegt. Der Vorteil dieser Methode besteht darin, dass die Anmeldungsdaten dauerhaft und verschlüsselt auf Ihrer Festplatte gespeichert werden. Diese Daten müssen Sie nur einmal eingeben werden und beim nächsten Mal liest &smb4k; die Daten aus den Passwortspeicher. Wenn Sie diese Einstellung abschalten, werden die Anmeldungsdaten entweder temporär oder gar nicht gespeichert, siehe weiter unten.

source: Remember logins during program run
de: Anmeldungen für die Zeit des Programmlaufs speichern

source: If you do not want &smb4k; to store the authentication data in a wallet, you can decide whether it should be stored temporarily or not. If you uncheck this check box, &smb4k; will immediately forget the authentication data you provided and you will have to enter it everytime it is needed. This option has no effect if you chose to store the passwords in a wallet (see above).
de: Möchten Sie nicht, dass &smb4k; die Authentifizierungsdaten in einem Passwortspeicher ablegt, können Sie entscheiden, ob die Daten temporär oder nicht gespeichert werden. Deaktivieren Sie dieses Ankreuzfeld, dann vergisst &smb4k; sofort alle eingegebenen Anmeldungsdaten und Sie müssen sie immer wieder eingeben, wenn sie benötigt werden. Diese Option hat keinen Effekt, wenn Sie die Anmeldungsdaten in einem Passwortspeicher ablegen.

source: Default Login
de: Standardanmeldung

source: Use a default login
de: Standardanmeldung verwenden

source: The default login is used by default to authenticate to a server. If you enable this feature, a password dialog pops up, where you can provide the default login information.
de: Die Standardanmeldung wird in der Voreinstellung für die Authentifizierung beim Server verwendet. Wenn Sie diese Funktion aktivieren, erscheint ein Passwortdialog, in dem Sie die Standardinformationen zur Anmeldung eingeben können.

source: Screenshot of the default login input dialog
de: Bildschirmfoto des Eingabedialogs für die Standardanmeldung

source: The default login input dialog
de: Der Eingabedialog für die Standardanmeldung

source: You have to fill in at least the user name. Empty passwords are supported.
de: Sie müssen mindestens den Benutzernamen eingeben, Leere Passwörter sind zulässig.

source: Wallet Entries
de: Einträge des Passwortspeichers

source: The <guilabel>Wallet Entries</guilabel> tab contains an editor with that you can modify or remove existing wallet entries.
de: Die Karteikarte <guilabel>Einträge des Passwortspeichers</guilabel> enthält einen Editor, mit dem Sie vorhandene Einträge im Passwortspeicher ändern oder entfernen können.

source: Screenshot of the wallet entries editor
de: Bildschirmfoto des Editors für den Passwortspeicher

source: The wallet entries editor
de: Der Editor für den Passwortspeicher

source: Before you can edit the wallet entries, you have to load them from the wallet by pressing the <guibutton>Load</guibutton> button. The list of entries appears then on the left. An entry can be edited by selecting it and checking the <guibutton>Show details</guibutton> button. The details are then shown on the right and can be modified.
de: Ehe Sie die Einträge im Passwortspeicher bearbeiten können, müssen Sie sie laden, indem Sie den Knopf <guibutton>Laden</guibutton> drücken. Dann wird die Liste der Einträge auf der linken Seite angezeigt. Ein Eintrag kann bearbeitet werden, indem Sie ihn auswählen und den Knopf <guibutton>Details anzeigen</guibutton> drücken. Dann werden die Details auf der rechten Seite angezeigt und können bearbeitet werden.

source: An entry can be removed by right clicking it and choosing the <guimenuitem>Remove</guimenuitem> item from the popup menu. All wallet entries may be removed at once by choosing the <guimenuitem>Clear List</guimenuitem> item.
de: Ein Eintrag kann entfernt werden, indem Sie mit der &RMBn; darauf klicken und dann im Kontextmenü <guimenuitem>Entfernen</guimenuitem> auswählen. Alle Einträge in der Passwortspeicherliste können auf einmal mit der Auswahl von <guimenuitem>Liste löschen</guimenuitem> im Kontextmenü entfernt werden.

source: Changes can be reset by choosing the <guimenuitem>Undo</guimenuitem> item from the popup menu either in the wallet entries list widget or in the details widget.
de: Änderungen können verworfen werden, wenn Sie <guimenuitem>Zurücknehmen</guimenuitem> aus dem Kontextmenü entweder in der Liste der Einträge des Passwortspeichers oder in der ausführlichen Ansicht wählen.

source: After you finished editing, the changes have to be committed to the wallet by pressing <guibutton>Save</guibutton>.
de: Haben Sie die Bearbeitung beendet, können die Änderungen durch Klicken auf den Knopf <guibutton>Speichern</guibutton> in den Passwortspeicher übernommen werden.

source: Here you can directly influence the command line arguments that are passed to the Samba programs and also manage the custom settings you defined for single shares. Please note, that the settings will have no effect outside &smb4k; and that no changes will be applied to the <filename>smb.conf</filename> configuration file. For further information, please refer to the manual pages of the Samba software suite.
de: Hier können Sie direkt die Befehlszeilenargumente beeinflussen, die an die Samba-Programme übergeben werden und auch benutzerdefinierte Einstellungen verwalten, die Sie für einzelne Freigaben definiert haben. Beachten Sie, dass diese Einstellungen außerhalb von &smb4k; keinen Effekt haben und dass keine Änderungen an der Einrichtungsdatei <filename>smb.conf</filename> vorgenommen werden. Weitere Informationen finden Sie in den Handbuchseiten der Samba-Softwaresammlung.

source: Screenshot of the "Samba" configuration page
de: Bildschirmfoto der Einrichtungsseite „Samba“

source: The "Samba" configuration page
de: Die Einrichtungsseite „Samba“

source: General Options
de: Allgemeine Einstellungen

source: Set the NetBIOS name of your computer. The text box should already be filled with the information found in the <filename>smb.conf</filename> configuration file or with the hostname of your computer. Under normal circumstances there is no need to change anything here.
de: Gibt den NetBIOS-Namen Ihres Rechner an. Das Textfeld wird mit dem Wert aus der Einrichtungsdatei <filename>smbconf</filename> oder dem Namen des Rechners vorbesetzt. Unter normalen Bedingungen muss hier nichts geändert werden.

source: Default: NetBIOS name defined in <filename>smb.conf</filename> or the hostname
de: Voreinstellung: NetBIOS-Name, der in <filename>smb.conf</filename> definiert ist oder der Rechnername

source: Domain
de: Domäne

source: Set the name of the domain/workgroup your computer is in. The text box should already be filled with the information found in the <filename>smb.conf</filename> configuration file. Under normal circumstances there is no need to change anything here.
de: Gibt den Name der Domäne/Arbeitsgruppe an, in der sich Ihr Rechner befindet. Das Textfeld wird mit dem Wert aus der Einrichtungsdatei <filename>smb.conf</filename> vorbesetzt. Unter normalen Bedingungen muss hier nichts geändert werden.

source: Default: domain name defined in <filename>smb.conf</filename>
de: Voreinstellung: Domänen-Name, der in <filename>smb.conf</filename> definiert ist

source: Socket options
de: Socket-Einstellungen

source: Set the TCP socket options. Please refer to the <ulink url="man:/smb.conf"><citerefentry><refentrytitle>smb.conf</refentrytitle><manvolnum>5</manvolnum></citerefentry></ulink> manual page to learn more.
de: Legt TCP-Socket-Einstellungen fest. Auf der Handbuchseite <ulink url="man:/smb.conf"><citerefentry><refentrytitle>smb.conf</refentrytitle><manvolnum>5</manvolnum></citerefentry></ulink> finden Sie weitere Informationen zu Socket-Einstellungen.
