Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/extragear-network/smb4k.po
Languages: de

source: This option causes <ulink url="man:/rsync"><citerefentry><refentrytitle>rsync</refentrytitle><manvolnum>1</manvolnum></citerefentry></ulink> to set the owner of the destination file to be the same as the source file. By default, the preservation is done by name, but may fall back to using the ID number in some circumstances (see the <option>--numeric-ids</option> option for a full discussion). This option has no effect if the receiving <ulink url="man:/rsync"><citerefentry><refentrytitle>rsync</refentrytitle><manvolnum>1</manvolnum></citerefentry></ulink> is not run as the super user and <option>--super</option> is not specified.
de: Mit dieser Einstellung setzt <ulink url="man:/rsync"><citerefentry><refentrytitle>rsync</refentrytitle><manvolnum>1</manvolnum></citerefentry></ulink> den Eigentümer der Zieldatei auf den Eigentümer der Quelldatei. In der Voreinstellung erfolgt dies über den Namen, verwendet aber unter bestimmten Umständen als Alternative die Kennung. Lesen Sie dazu die Informationen über die Option <option>--numeric-ids</option>. Diese Einstellung ist unwirksam, wenn <ulink url="man:/rsync"><citerefentry><refentrytitle>rsync</refentrytitle><manvolnum>1</manvolnum></citerefentry></ulink> auf der Empfängerseite nicht als Systemverwalter ausgeführt wird und die Option <option>--super</option> nicht angegeben wurde.

source: Preserve device and special files
de: Blockgeräte und spezielle Dateien beibehalten

source: This option causes <ulink url="man:/rsync"><citerefentry><refentrytitle>rsync</refentrytitle><manvolnum>1</manvolnum></citerefentry></ulink> to transfer character and block device files as well as special files (such as named sockets and fifos) to the remote system. This option has no effect if the receiving side is not run as the super user and <option>--super</option> is not specified.
de: Mit dieser Einstellung überträgt <ulink url="man:/rsync"><citerefentry><refentrytitle>rsync</refentrytitle><manvolnum>1</manvolnum></citerefentry></ulink> Blockgeräte und spezielle Dateien, wie zum Beispiel „fifos“ oder „named sockets“, ebenfalls. Diese Einstellung ist wirkungslos, wenn die Empfangsseite nicht als Systemverwalter ausgeführt wird und <option>--super</option> nicht angegeben ist.

source: Preserve times
de: Zeiten beibehalten

source: This tells <ulink url="man:/rsync"><citerefentry><refentrytitle>rsync</refentrytitle><manvolnum>1</manvolnum></citerefentry></ulink> to transfer modification times along with the files and update them on the remote system.
de: Mit dieser Option überträgt <ulink url="man:/rsync"><citerefentry><refentrytitle>rsync</refentrytitle><manvolnum>1</manvolnum></citerefentry></ulink> Änderungszeiten zusammen mit den Dateien und aktualisiert sie auf dem entfernten System.

source: Omit directories when preserving times
de: Ordner beim Beibehalten der Zeiten überspringen

source: This tells <ulink url="man:/rsync"><citerefentry><refentrytitle>rsync</refentrytitle><manvolnum>1</manvolnum></citerefentry></ulink> to omit directories when it is preserving modification times (see <option>--times</option>).
de: Mit dieser Einstellung überspringt <ulink url="man:/rsync"><citerefentry><refentrytitle>rsync</refentrytitle><manvolnum>1</manvolnum></citerefentry></ulink> Ordner beim Beibehalten der Zeiten, siehe auch <option>--times</option>.

source: File Deletion &amp; Transfer
de: Löschen &amp; Übertragen von Dateien

source: File Deletion
de: Löschen von Dateien

source: Remove synchronized source files
de: Abgeglichene Quelldateien entfernen

source: This tells <ulink url="man:/rsync"><citerefentry><refentrytitle>rsync</refentrytitle><manvolnum>1</manvolnum></citerefentry></ulink> to remove from the sending side the files (meaning non-directories) that are a part of the transfer and have been successfully duplicated on the receiving side.
de: Dies veranlasst <ulink url="man:/rsync"><citerefentry><refentrytitle>rsync</refentrytitle><manvolnum>1</manvolnum></citerefentry></ulink> dazu, alle Einträge, die Teil der Übertragung und keine Ordner sind, von der sendenden Seite zu entfernen, sobald sie auf der empfangenden Seite erfolgreich dupliziert wurden.

source: Delete extraneous files
de: Fremde Dateien löschen

source: This tells <ulink url="man:/rsync"><citerefentry><refentrytitle>rsync</refentrytitle><manvolnum>1</manvolnum></citerefentry></ulink> to delete extraneous files from the receiving side (ones that aren't on the sending side), but only for the directories that are being synchronized. You must have asked <ulink url="man:/rsync"><citerefentry><refentrytitle>rsync</refentrytitle><manvolnum>1</manvolnum></citerefentry></ulink> to send the whole folder (&eg; "<filename class="directory">dir</filename>" or "<filename class="directory">dir/</filename>") without using a wildcard for the folders contents (&eg; "<filename class="directory">dir/*</filename>") since the wildcard is expanded by the shell and <ulink url="man:/rsync"><citerefentry><refentrytitle>rsync</refentrytitle><manvolnum>1</manvolnum></citerefentry></ulink> thus gets a request to transfer individual files, not the files' parent folder. Files that are excluded from transfer are also excluded from being deleted unless you use the <option>-- delete-excluded</option> option or mark the rules as only matching on the sending side.
de: Mit dieser Option löscht <ulink url="man:/rsync"><citerefentry><refentrytitle>rsync</refentrytitle><manvolnum>1</manvolnum></citerefentry></ulink> überflüssige Dateien auf der Empfängerseite, d. h. Dateien, die auf der Senderseite nicht vorhanden sind. aber nur für die Ordner, die abgeglichen werden. Sie müssen <ulink url="man:/rsync"><citerefentry><refentrytitle>rsync</refentrytitle><manvolnum>1</manvolnum></citerefentry></ulink> angegeben haben, den gesamten Ordner zu senden, &eg; "<filename class="directory">dir</filename>" oder "<filename class="directory">dir/</filename>" ohne dabei Platzhalter für die Ordnerinhalte wie &eg; "<filename class="directory">dir/*</filename>" zu verwenden, da Platzhalter durch die Shell erweitert werden und <ulink url="man:/rsync"><citerefentry><refentrytitle>rsync</refentrytitle><manvolnum>1</manvolnum></citerefentry></ulink> so eine Anforderung zur Übertragung einzelner Dateien und nicht der Ordner mit diesen Dateien darin erhält. Von der Übertragung ausgeschlossene Dateien werden auch beim Löschen ausgeschlossen, es sei denn Sie verwenden die Option <option>-- delete-excluded</option> oder markieren die Regel nur für Übereinstimmungen auf der Senderseite.

source: Delete files before transfer
de: Dateien vor der Übertragung löschen

source: Request that the file deletions on the receiving side be done before the transfer starts. This is the default if <option>--delete</option> or <option>--delete-excluded</option> is specified without one of the <option>--delete-WHEN</option> options.
de: Fordert das Löschen von Dateien auf der Senderseite ehe die Übertragung beginnt. Dies ist die Standardeinstellung, wenn <option>--delete</option> oder <option>--delete-excluded</option> ohne eine der Optionen <option>--delete-WHEN</option> benutzt werden.

source: Delete files after transfer
de: Dateien nach der Übertragung löschen

source: Request that the file deletions on the receiving side be done after the transfer has completed.
de: Ist diese Einstellung aktiv, werden Dateien auf der empfangenden Seite erst gelöscht, nachdem die Übertragung beendet ist.

source: Delete files during transfer
de: Dateien während der Übertragung löschen

source: Request that the file deletions on the receiving side be done incrementally as the transfer happens. This is a faster method than choosing the before- or after-transfer algorithm, but it is only supported beginning with <ulink url="man:/rsync"><citerefentry><refentrytitle>rsync</refentrytitle><manvolnum>1</manvolnum></citerefentry></ulink> version 2.6.4.
de: Mit dieser Einstellung werden Dateien auf der Empfängerseite inkrementell während der Übertragung gelöscht. Diese Methode ist schneller als mit den Algorithmen zum vorher oder nachher löschen, wird aber erst seit der Version 2.6.4 von <ulink url="man:/rsync"><citerefentry><refentrytitle>rsync</refentrytitle><manvolnum>1</manvolnum></citerefentry></ulink> unterstützt.

source: Also delete excluded files
de: Auch ausgeschlossene Dateien löschen

source: In addition to deleting the files on the receiving side that are not on the sending side, this tells <ulink url="man:/rsync"><citerefentry><refentrytitle>rsync</refentrytitle><manvolnum>1</manvolnum></citerefentry></ulink> to also delete any files on the receiving side that are excluded (see <option>--exclude</option>).
de: Zusätzlich zum Löschen der auf der empfangenden, aber nicht auf der sendenden Seite vorhandenen Dateien, veranlasst dies <ulink url="man:/rsync"><citerefentry><refentrytitle>rsync</refentrytitle><manvolnum>1</manvolnum></citerefentry></ulink> dazu, alle Dateien auf der empfangenden Seite zu löschen, die ausgeschlossen wurden. Siehe auch <option>--exclude</option>.

source: Delete even if I/O errors occur
de: Selbst bei Ein-/Ausgabefehlern löschen

source: Tells <option>--delete</option> to go ahead and delete files even when there are I/O errors.
de: Ignoriert mit <option>--delete</option> sogar Ein-/Ausgabefehler und setzt die Ausführung fort.

source: Force deletion of non-void directories
de: Löschen nicht leerer Ordner erzwingen

source: This option tells <ulink url="man:/rsync"><citerefentry><refentrytitle>rsync</refentrytitle><manvolnum>1</manvolnum></citerefentry></ulink> to delete a non-empty folder when it is to be replaced by a non-folder. This is only relevant if deletions are not active (see <option>--delete</option>).
de: Diese Option veranlasst <ulink url="man:/rsync"><citerefentry><refentrytitle>rsync</refentrytitle><manvolnum>1</manvolnum></citerefentry></ulink> dazu, einen nicht leeren Ordner zu löschen, wenn er durch einen Eintrag ersetzt werden soll, der kein Ordner ist. Dies ist jedoch nur relevant, wenn keine anderweitigen Löschungen aktiviert wurden (see <option>--delete</option>).

source: Restrictions
de: Beschränkungen

source: Do not delete more than this many files
de: Nicht mehr Dateien löschen als

source: This tells <ulink url="man:/rsync"><citerefentry><refentrytitle>rsync</refentrytitle><manvolnum>1</manvolnum></citerefentry></ulink> not to delete more than NUM files or directories (NUM must be non-zero). This is useful when mirroring very large trees to prevent disasters.
de: Dies veranlasst <ulink url="man:/rsync"><citerefentry><refentrytitle>rsync</refentrytitle><manvolnum>1</manvolnum></citerefentry></ulink> dazu, nicht mehr als ZAHL Dateien und Ordner zu löschen (ZAHL darf nicht Null sein). Dies ist nützlich, wenn man sehr große Ordnerbäume spiegelt und ein Desaster verhindern will.

source: Default: not selected; NUM: 0
de: Voreinstellung: nicht aktiviert, NUM 0

source: File Transfer
de: Dateiübertragung

source: Do not transfer any file smaller than
de: Keine Datei übertragen kleiner als

source: This tells <ulink url="man:/rsync"><citerefentry><refentrytitle>rsync</refentrytitle><manvolnum>1</manvolnum></citerefentry></ulink> to avoid transferring any file that is smaller than the specified SIZE, which can help in not transferring small, junk files.
de: Mit dieser Einstellung wird verhindert, dass <ulink url="man:/rsync"><citerefentry><refentrytitle>rsync</refentrytitle><manvolnum>1</manvolnum></citerefentry></ulink> jede Datei kleiner als die angegebene Größe überträgt, das ist sinnvoll bei der Übertragung kleiner unerwünschter Dateien.

source: Default: not selected; NUM: 0 kB
de: Voreinstellung: nicht aktiviert, NUM 0 kB

source: Do not transfer any file larger than
de: Keine Datei übertragen größer als

source: This tells <ulink url="man:/rsync"><citerefentry><refentrytitle>rsync</refentrytitle><manvolnum>1</manvolnum></citerefentry></ulink> to avoid transferring any file that is larger than the specified SIZE.
de: Mit dieser Einstellung wird verhindert, dass <ulink url="man:/rsync"><citerefentry><refentrytitle>rsync</refentrytitle><manvolnum>1</manvolnum></citerefentry></ulink> jede Datei größer als der angegebene Wert überträgt.

source: Keep partially transferred files
de: Teilweise übertragene Dateien aufbewahren

source: By default, <ulink url="man:/rsync"><citerefentry><refentrytitle>rsync</refentrytitle><manvolnum>1</manvolnum></citerefentry></ulink> will delete any partially transferred file if the transfer is interrupted. In some circumstances it is more desirable to keep partially transferred files. Using the <option>--partial</option> option tells <ulink url="man:/rsync"><citerefentry><refentrytitle>rsync</refentrytitle><manvolnum>1</manvolnum></citerefentry></ulink> to keep the partial file which should make a subsequent transfer of the rest of the file much faster.
de: Als Voreinstellung löscht <ulink url="man:/rsync"><citerefentry><refentrytitle>rsync</refentrytitle><manvolnum>1</manvolnum></citerefentry></ulink> alle nur teilweise übertragenen Datei, wenn die Übertragung unterbrochen wird. Manchmal ist es erwünscht, auch teilweise übertragene Dateien zu behalten. Mit der Option <option>--partial</option> behält <ulink url="man:/rsync"><citerefentry><refentrytitle>rsync</refentrytitle><manvolnum>1</manvolnum></citerefentry></ulink> teilweise übertragene Dateien, damit wird die fortgesetzte Übertragung der restlichen Datei schneller.

source: Put partially transferred files into
de: Teilweise übertragene Dateien ablegen in

source: A better way to keep partial files than the <option>--partial</option> option is to specify a folder DIR that will be used to hold the partial data (instead of writing it out to the destination file). On the next transfer, <ulink url="man:/rsync"><citerefentry><refentrytitle>rsync</refentrytitle><manvolnum>1</manvolnum></citerefentry></ulink> will use a file found in this folder as data to speed up the resumption of the transfer and then delete it after it has served its purpose. Before you tick this option, you should read the <ulink url="man:/rsync">manual page</ulink>.
de: Eine bessere Möglichkeit zum Beibehalten von teilweise übertragenen Dateien als die Option <option>--partial</option> ist es, einen bestimmten Ordner anzugeben, in dem die teilweise übertragenen Daten gespeichert werden, anstatt sie in die Zieldatei zu schreiben. Bei der nächsten Übertragung verwendet <ulink url="man:/rsync"><citerefentry><refentrytitle>rsync</refentrytitle><manvolnum>1</manvolnum></citerefentry></ulink> eine in diesem Ordner gefundene Datei, um die Wiederaufnahme der Übertragung zu beschleunigen und dann danach diese Datei zu löschen, da sie ihren Zweck erfüllt hat. Ehe Sie diese Option ankreuzen, sollten Sie diese <ulink url="man:/rsync">Handbuchseite</ulink> lesen.

source: Default: not selected; DIR: <filename class="directory">$HOME</filename>
de: Voreinstellung: nicht aktiviert, DIR: <filename class="directory">$HOME</filename>

source: Filtering
de: Filterung

source: Auto-ignore files in the same way CVS does
de: Dateien automatisch ignorieren genauso wie CVS

source: This is a useful shorthand for excluding a broad range of files that you often don't want to transfer between systems. It uses the same algorithm that CVS uses to determine if a file should be ignored.
de: Dies ist eine nützliche Kurzschreibweise für das Ausschließen einer großen Anzahl von Dateien, die Sie oft gar nicht mitübertragen lassen möchten. Diese Option benutzt den gleichen Algorithmus wie CVS, um zu bestimmen, ob eine Datei ignoriert werden soll.

source: Exclude files matching this pattern
de: Dateien aufgrund dieses Musters ausschließen

source: This option is a simplified form of the <option>--filter</option> option that defaults to an exclude rule and does not allow the full rule-parsing syntax of normal filter rules.
de: Dies ist eine einfache Form der <option>--filter</option>-Option, die als Standard zu einer Ausschlußregel gehört. Mit dieser Form kann die vollständige Syntax von normalen Filterregeln nicht verwendet werden.

source: Default: not selected; PATTERN: empty
de: Voreinstellung: nicht aktiviert, PATTERN: leer

source: Read exclude patterns from
de: Ausschlussmuster lesen aus

source: This option is related to the <option>--exclude</option> option, but it specifies a FILE that contains exclude patterns (one per line). Blank lines in the file and lines starting with ';' or '#' are ignored. You have to choose an existing file to make this option work.
de: Dies gehört zur Option <option>--exclude</option>, gibt aber ein „FILE“ an, das ein Ausschlußmuster je Zeile enthält. Leere Zeilen in der Datei und Zeilen, die mit den Zeichen „:“ oder „#“ beginnen, werden ignoriert. Für diese Option müssen Sie eine vorhandene Datei auswählen.

source: Default: not selected; FILE: <filename>$HOME/exclude.txt</filename>
de: Voreinstellung: nicht aktiviert, FILE: <filename>$HOME/exclude.txt</filename>

source: Do not exclude files matching this pattern
de: Dateien aufgrund dieses Musters berücksichtigen

source: This option is a simplified form of the <option>--filter</option> option that defaults to an include rule and does not allow the full rule-parsing syntax of normal filter rules.
de: Dies ist eine einfache Form der <option>--filter</option>-Option, die als Standard zu einer Einschlußregel gehört. Mit dieser Form kann die vollständige Syntax von normalen Filterregeln nicht verwendet werden.

source: Read include patterns from
de: Einschlussmuster lesen aus

source: This option is related to the <option>--include</option> option, but it specifies a FILE that contains include patterns (one per line). Blank lines in the file and lines starting with ';' or '#' are ignored. You have to choose an existing file to make this option work.
de: Dies gehört zur Option <option>--include</option>, gibt aber ein „FILE“ an, das ein Einschlußmuster je Zeile enthält. Leere Zeilen in der Datei und Zeilen, die mit den Zeichen „:“ oder „#“ beginnen, werden ignoriert. Für diese Option müssen Sie eine vorhandene Datei auswählen.

source: Default: not selected; FILE: <filename>$HOME/include.txt</filename>
de: Voreinstellung: nicht aktiviert, FILE: <filename>$HOME/include.txt</filename>

source: Filter Rules
de: Filterregeln

source: Custom filter rules
de: Benutzerdefinierte Filterregeln

source: You can define one or more filter rules here. Each rule has to be prefixed with the <option>--filter=</option> or <option>-f</option> option string, because the contents of the text box will be passed to the <ulink url="man:/rsync"><citerefentry><refentrytitle>rsync</refentrytitle><manvolnum>1</manvolnum></citerefentry></ulink> command AS IS.
de: Sie können einen oder mehrere Filter hier definieren. Jeder Regelausdruck muss das Präfix <option>--filter=</option> oder <option>-f</option> vorangestellt werden, da der Inhalt des Textfelds unverändert an den Befehl <ulink url="man:/rsync"><citerefentry><refentrytitle>rsync</refentrytitle><manvolnum>1</manvolnum></citerefentry></ulink> übergeben wird.

source: This option allows you to add rules to selectively exclude certain files from the list of files to be transferred. This is most useful in combination with a recursive transfer.
de: Mit dieser Option können Sie Regeln hinzufügen, um bestimmte ausgewählte Dateien aus der Liste der zu übertragenden Dateien auszuschließen. Das is am sinnvollsten in Kombination mit einer rekursiven Übertragung.

source: You may use as many <option>--filter</option> options as you like to build up the list of files to exclude.
de: Sie können beliebig viele Optionen <option>--filter</option> verwenden, um eine Liste aller auszuschließenden Dateien zusammenzustellen.

source: See the FILTER RULES section of the <ulink url="man:/rsync">manual page</ulink> for detailed information on this option.
de: Ausführliche Informationen zu dieser Einstellung finden Sie im Abschnitt „FILTER RULES“ in der <ulink url="man:/rsync">Handbuchseite</ulink>.

source: Use --filter='dir-merge /.rsync-filter' filter rule
de: Die Filterregel --filter='dir-merge /.rsync-filter' verwenden

source: This option tells <ulink url="man:/rsync"><citerefentry><refentrytitle>rsync</refentrytitle><manvolnum>1</manvolnum></citerefentry></ulink> to look for per-folder <filename>.rsync-filter</filename> files that have been sprinkled through the hierarchy and use their rules to filter the files in the transfer.
de: Diese Einstellung veranlasst <ulink url="man:/rsync"><citerefentry><refentrytitle>rsync</refentrytitle><manvolnum>1</manvolnum></citerefentry></ulink> dazu, in jedem Ordner der zu übertragenden Hierarchie nach einer <filename>rsync-filter</filename>-Datei zu suchen und ihre Filterregeln für die Übertragung zu benutzen, wenn sie vorhanden ist.

source: See the FILTER RULES section of the <ulink url="man:/rsync">manual page</ulink> for detailed information on how this option works.
de: Ausführliche Informationen zur Funktionsweise dieser Einstellung finden Sie im Abschnitt „FILTER RULES“ in der <ulink url="man:/rsync">Handbuchseite</ulink>.

source: Use --filter='exclude .rsync-filter' filter rule
de: Die Filterregel --filter='exclude .rsync-filter' verwenden

source: This option filters out the <filename>.rsync-filter</filename> files themselves from the transfer.
de: Diese Regel filtert die „.rsync“-Filter-Dateien aus der Übertragung heraus.

source: Advanced Settings
de: Erweiterte Einstellungen

source: Handle sparse files efficiently
de: Zerstreute Dateien effizient handhaben

source: Try to handle sparse files efficiently so they take up less space on the destination. Conflicts with <option>--inplace</option> because it's not possible to overwrite data in a sparse fashion.
de: Es wird versucht, verstreute Dateien effizient zu verarbeiten, so dass sie weniger Platz auf dem Zielsystem benötigen. Dies steht im Konflikt mit der Option <option>--inplace</option>, da es nicht möglich ist, verstreute Daten zu überschreiben.

source: Do not use this option when the destination is a &Solaris; "tmpfs" file system. It doesn't seem to handle seeks over null regions correctly and ends up corrupting the files.
de: Benutzen Sie diese Einstellung nicht, wenn das Ziel ein &Solaris;-„tmpfs“-Dateisystem ist. Dieses System verarbeitet Zugriffe über Null-Bereiche anscheinend nicht korrekt, das kann zu defekten Dateien führen.

source: Copy files whole (no rsync algorithm)
de: Dateien im Ganzen kopieren (kein „rsync“-Algorithmus)

source: With this option the incremental <ulink url="man:/rsync"><citerefentry><refentrytitle>rsync</refentrytitle><manvolnum>1</manvolnum></citerefentry></ulink> algorithm is not used and the whole file is sent as-is instead. The transfer may be faster if this option is used when the bandwidth between the source and destination machines is higher than the bandwidth to disk (especially when the "disk" is actually a networked file system). This is the default when both the source and destination are specified as local paths.
de: Mit dieser Einstellung wird der inkrementelle Algorithmus von <ulink url="man:/rsync"><citerefentry><refentrytitle>rsync</refentrytitle><manvolnum>1</manvolnum></citerefentry></ulink> und statt dessen die vollständige Datei übertragen. Die Übertragung kann mit dieser Einstellung schneller sein, wenn die Bandbreite zwischen Quelle und Ziel größer ist als die Bandbreite zur Festplatte, besonders wenn die „Festplatte“ tatsächlich ein Netzwerkdateisystem ist. Dies ist die Standardeinstellung, wenn sowohl Quelle als auch Ziel als lokale Pfade angeben wurden.

source: Do not cross file system boundaries
de: Keine Dateisystemgrenzen überschreiten
