Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/extragear-network/smb4k.po
Languages: de

source: Default: socket options defined in <filename>smb.conf</filename>
de: Voreinstellung: Socket-Einstellungen, die in <filename>smb.conf</filename> definiert sind

source: NetBIOS scope
de: NetBIOS-Bereich

source: Set the NetBIOS scope. It is recommended that you read the <ulink url="man:/smb.conf"><citerefentry><refentrytitle>smb.conf</refentrytitle><manvolnum>5</manvolnum></citerefentry></ulink> manual page before entering anything here.
de: Legt den NetBIOS-Bereich fest. Es wird empfohlen, die Handbuchseite <ulink url="man:/smb.conf"><citerefentry><refentrytitle>smb.conf</refentrytitle><manvolnum>5</manvolnum></citerefentry></ulink> zu lesen, ehe Sie diese Einstellung aktivieren.

source: Default: NetBIOS scope defined in <filename>smb.conf</filename>
de: Voreinstellung: NetBIOS-Bereich, der in <filename>smb.conf</filename> definiert ist

source: Remote Ports
de: Entfernte Ports

source: Sets the remote SMB port number that is used by <ulink url="man:/net"><citerefentry><refentrytitle>net</refentrytitle><manvolnum>8</manvolnum></citerefentry></ulink> and <ulink url="man:/smbclient"><citerefentry><refentrytitle>smbclient</refentrytitle><manvolnum>1</manvolnum></citerefentry></ulink> to communicate with a remote host. Under FreeBSD, this is also the port that is used for mounting.
de: Legt die SMB-Port-Nummer fest, die von <ulink url="man:/net"><citerefentry><refentrytitle>net</refentrytitle><manvolnum>8</manvolnum></citerefentry></ulink> und <ulink url="man:/smbclient"><citerefentry><refentrytitle>smbclient</refentrytitle><manvolnum>1</manvolnum></citerefentry></ulink> zur Kommunikation mit dem entfernten Rechner. Unter FreeBSD ist die auch der Port für das Einbinden.

source: Unless you are using a firewall or have a customized network setup, you do not need to change anything here.
de: Hier muss nichts geändert werden, es sei denn Sie benutzen eine Firewall oder eine benutzerdefinierte Netzwerkeinstellung.

source: Default: 139
de: Voreinstellung: 139

source: File system port
de: Dateisystem-Port

source: Sets the file system port number that is used by <ulink url="man:/mount.cifs"><citerefentry><refentrytitle>mount.cifs</refentrytitle><manvolnum>8</manvolnum></citerefentry></ulink> when mounting a remote share. The default port number (445) should work for all modern operating systems. If you experience problems, try setting the port number to 139. If the problems only occur with a few hosts, it is recommended not to set the port number here globally, but to use the <link linkend="network_neighborhood_browser_custom">Custom Options</link> dialog to define the port number individually for the problematic hosts.
de: Legt die Portnummer des Dateisystems fest, die von <ulink url="man:/mount.cifs"><citerefentry><refentrytitle>mount.cifs</refentrytitle><manvolnum>8</manvolnum></citerefentry></ulink> beim Einbinden einer entfernten Freigabe verwendet wird. Die Standard-Portnummer 445 sollte auf allen modernen Betriebssystemen funktionieren. Bei Problemen versuchen Sie es mit der Portnummer 139. Sollten diese Probleme nur mit einigen Rechner auftreten, sollten Sie die Portnummer nicht hier global ändern, sondern den Dialog <link linkend="network_neighborhood_browser_custom">Benutzerdefinierte Einstellungen</link> verwenden, um die Portnummer für einzelne Rechner festzulegen.

source: This option is only available under &Linux;. Under FreeBSD, the port for mounting shares is set with <guibutton>SMB port</guibutton>.
de: Diese Einstellung ist nur unter &Linux; vorhanden. Unter FreeBSD wird der Port für das Einbinden von Freigaben mit dem <guibutton>SMB-Port</guibutton> eingestellt.

source: Default: 445
de: Voreinstellung: 445

source: Try to authenticate with Kerberos
de: Anmeldung mit Kerberos versuchen

source: Use Kerberos for authentication in an Active Directory environment.
de: Benutzt Kerberos zur Authentifizierung in einer Active-Directory-Umgebung.

source: Authenticate with local machine account
de: Anmeldung mit lokalem Maschinenkonto

source: Make queries to the remote server using the machine account of the local server.
de: Das lokale Maschinenkonto wird für die Anfragen an den entfernten Server benutzt.

source: Use Winbind ccache for authentication
de: Winbind ccache für Authentifizierung verwenden

source: Try to use the credentials cached by Winbind.
de: Die von Winbind zwischengespeicherten Zugangsdaten werden verwendet.

source: Security
de: Sicherheit

source: Signing state
de: Signierstatus

source: Set the client signing state. This setting is used by <ulink url="man:/smbclient"><citerefentry><refentrytitle>smbclient</refentrytitle><manvolnum>1</manvolnum></citerefentry></ulink> and <ulink url="man:/smbtree"><citerefentry><refentrytitle>smbtree</refentrytitle><manvolnum>1</manvolnum></citerefentry></ulink>.
de: Diese Einstellung bestimmt den Signierstatus. Die Einstellung wird von <ulink url="man:/smbclient"><citerefentry><refentrytitle>smbclient</refentrytitle><manvolnum>1</manvolnum></citerefentry></ulink> und <ulink url="man:/smbtree"><citerefentry><refentrytitle>smbtree</refentrytitle><manvolnum>1</manvolnum></citerefentry></ulink> verwendet.

source: The following options are available:
de: Die folgenden Optionen können ausgewählt werden:

source: None
de: Keiner

source: Do not set the client signing state.
de: Setzt keinen Signierstatus für den Klient.

source: <guibutton>On</guibutton>
de: <guibutton>An</guibutton>

source: Set the client signing state to <emphasis>on</emphasis>.
de: Setzt den Signierstatus des Klients auf <emphasis>An</emphasis>.

source: <guibutton>Off</guibutton>
de: <guibutton>Aus</guibutton>

source: Set the client signing state to <emphasis>off</emphasis>.
de: Setzt den Signierstatus des Klients auf <emphasis>Aus</emphasis>.

source: Required
de: Benötigt

source: Set the client signing state to <emphasis>required</emphasis>.
de: Setzt den Signierstatus des Klients auf <emphasis>Benötigt</emphasis>.

source: Default: None
de: Voreinstellung: Keiner

source: Encrypt SMB transport
de: SMB-Transport verschlüsseln

source: This option requires the remote server to support the &UNIX; extensions. Request that the connection be encrypted. This is new for Samba 3.2 and will only work with Samba 3.2 or above servers. Fails the connection if encryption cannot be negotiated.
de: Für diese Option ist die Unterstützung von &UNIX;-Erweiterungen auf dem entfernten Server erforderlich und die Verbindung muss verschlüsselt werden. Dies ist neu in Samba 3.2 und funktioniert nur mit Server mit Samba 3.2 oder neuer. Die Verbindung schlägt fehl, wenn keine Verschlüsselung ausgehandelt werden kann.

source: Common Options
de: Übliche Einstellungen

source: User ID
de: Benutzerkennung

source: Sets the owner of the files and directories on the file system. By default, your UID is used. To change the UID, press the search button and choose one from the drop down menu.
de: Legt die Eigentümer von Dateien und Ordner auf dem Dateisystem fest. In der Voreinstellung wird Ihre UID verwendet. Um die UID zu ändern, wählen Sie eine UID aus dem Auswahlfeld.

source: Default: your UID
de: Voreinstellung: Ihre UID

source: Group ID
de: Gruppenkennung

source: Sets the group that owns the files and directories on the file system. By default, your GID is used. To change the GID, press the search button and choose one from the drop down menu.
de: Legt die Gruppen von Dateien und Ordner auf dem Dateisystem fest. In der Voreinstellung wird Ihre GID verwendet. Um die GID zu ändern, wählen Sie eine GID aus dem Auswahlfeld.

source: Default: your GID
de: Voreinstellung: Ihre GID

source: File mask
de: Dateimaske

source: Sets the permissions that are applied to files. The value is given in octal and has to have 4 digits. To learn more about the file mask (fmask), you should read the <ulink url="man:/mount"><citerefentry><refentrytitle>mount</refentrytitle><manvolnum>8</manvolnum></citerefentry></ulink> and <ulink url="man:/umask"><citerefentry><refentrytitle>umask</refentrytitle><manvolnum>2</manvolnum></citerefentry></ulink> manual pages.
de: Legt die Berechtigung für Dateien fest. Dieser Wert wird oktal angegeben und muss aus vier Zeichen bestehen. Weitere Informationen über die Dateimaske (fmask) finden Sie auf den Handbuchseiten <ulink url="man:/mount"><citerefentry><refentrytitle>mount</refentrytitle><manvolnum>8</manvolnum></citerefentry></ulink> and <ulink url="man:/umask"><citerefentry><refentrytitle>umask</refentrytitle><manvolnum>2</manvolnum></citerefentry></ulink>.

source: Default: 0755
de: Voreinstellung: 0755

source: Directory mask
de: Ordnermaske

source: Sets the permissions that are applied to directories. The value is given in octal and has to have 4 digits. To learn more about the folder mask (dmask), you should read the <ulink url="man:/mount"><citerefentry><refentrytitle>mount</refentrytitle><manvolnum>8</manvolnum></citerefentry></ulink> and <ulink url="man:/umask"><citerefentry><refentrytitle>umask</refentrytitle><manvolnum>2</manvolnum></citerefentry></ulink> manual pages.
de: Legt die Berechtigung für Ordner fest. Dieser Wert wird oktal angegeben und muss aus vier Zeichen bestehen. Weitere Informationen über die Ordnermaske (dmask) finden Sie auf den Handbuchseiten <ulink url="man:/mount"><citerefentry><refentrytitle>mount</refentrytitle><manvolnum>8</manvolnum></citerefentry></ulink> and <ulink url="man:/umask"><citerefentry><refentrytitle>umask</refentrytitle><manvolnum>2</manvolnum></citerefentry></ulink>.

source: Write access
de: Schreibzugriff

source: Here you can determine if the shares should be mounted <emphasis>read-write</emphasis> or <emphasis>read-only</emphasis> by default. This option is independent of the file mask and the folder mask settings above.
de: Hier können Sie festlegen, ob Freigaben als Standard <emphasis>beschreibbar</emphasis> oder <emphasis>schreibgeschützt</emphasis> eingebunden werden. Diese Einstellung ist unabhängig von den oben angegeben Masken für Dateien oder Ordner.

source: Default: read-write
de: Voreinstellung: beschreibbar

source: Client character set
de: Zeichensatz der Klientenseite

source: Sets the character set used by the client side (&ie; your computer).
de: Legt den Zeichensatz fest, der auf der Klientenseite, &ie; Ihrem Rechner, verwendet wird.

source: Default: default
de: Voreinstellung: Standard

source: Sets the codepage the remote server uses.
de: Legt die vom entfernten Server benutzte Codepage fest.

source: This option is only available under FreeBSD.
de: Diese Einstellung ist nur unter FreeBSD vorhanden.

source: Advanced Options
de: Erweiterte Einstellungen

source: (This widget is not available under FreeBSD.)
de: Dieser Abschnitt unter FreeBSD nicht vorhanden.

source: Most of the options you can define here require &Linux; kernel 2.6.15 or later to work.
de: Für die meisten Einstellungen in diesem Abschnitt ist ein &Linux;-Kernel 2.6.15 oder neuer erforderlich.

source: Do permission checks
de: Zugriffsrechte überprüfen

source: The client side checks if you have the correct UID and GID to manipulate files and directories on the share. This is in addition to the normal ACL check on the target machine done by the server software. You might want to switch this feature off, if the server(s) support the CIFS Unix extensions and you are, hence, not allowed to access the share.
de: Die Klientenseite überprüft, ob Sie die richtige UID und GID zur Manipulation der Dateien und Ordner auf dieser Freigabe haben. Dies erfolgt zusätzlich zur normalen ACL-Überprüfung durch die Server-Software auf dem Ziel-Rechner. Sie können diese Funktion abschalten, der der Server die CIFS-Unix-Erweiterungen unterstützt und Sie daher auf die Freigabe nicht zugreifen können.

source: Attempt to set UID and GID
de: Versuchen UID und GID zu setzen

source: If the CIFS Unix extensions are negotiated with the server the client side will attempt to set the effective UID and GID of the local process on newly created files, directories, and devices. If this feature is turned off, the default UID and GID defined for the share will be used. It is recommended that you read the manual page of <ulink url="man:/mount.cifs"><citerefentry><refentrytitle>mount.cifs</refentrytitle><manvolnum>8</manvolnum></citerefentry></ulink> before you change this setting.
de: Wenn die CIFS-Unix-Erweiterungen mit dem Server ausgehandelt werden, versucht der Klient die effektive UID und GID des lokalen Prozesses für neu erstellte Dateien, Ordner und Geräte zu setzen. Ist diese Funktion abgeschaltet, werden die als Voreinstellung für die Freigabe definierten UID und GID verwendet. Bitte lesen Sie die Handbuchseite von <ulink url="man:/mount.cifs"><citerefentry><refentrytitle>mount.cifs</refentrytitle><manvolnum>8</manvolnum></citerefentry></ulink>, bevor Sie diese Einstellung ändern.

source: Use server inode numbers
de: Inode-Nummern des Servers verwenden

source: Use inode numbers (unique persistent file identifiers) returned by the server instead of automatically generating temporary inode numbers on the client side. This parameter has no effect if the server does not support returning inode numbers or similar. It is recommended that you read the manual page of <ulink url="man:/mount.cifs"><citerefentry><refentrytitle>mount.cifs</refentrytitle><manvolnum>8</manvolnum></citerefentry></ulink> before you change this setting.
de: Verwendet Inode-Nummern (eindeutige dauerhafte Dateikennungen), die vom Server statt automatisch generierter temporärer Inode-Nummern auf dem Server. Diese Option hat eine Auswirkungen, wenn der Server die Rückgabe von Inode-Nummern nicht unterstützt, Sie sollten die Handbuchseite von <ulink url="man:/mount.cifs"><citerefentry><refentrytitle>mount.cifs</refentrytitle><manvolnum>8</manvolnum></citerefentry></ulink> lesen, bevor Sie diese Einstellung ändern.

source: Do not cache inode data
de: Keine Inode-Daten zwischenspeichern

source: Do not do inode data caching on files opened on the share. In some cases this can provide better performance than the default behavior which caches reads and writes.
de: Inode-Daten für geöffnete Dateien auf Freigaben werden nicht zwischengespeichert. In einigen Fällen kann dies zu einem besseren Durchsatz führen als das standardmäßige Verhalten, bei dem die Lese- und Schreibzugriffe zwischengespeichert werden.

source: Translate reserved characters
de: Reservierte Zeichen übersetzen

source: Translate six of the seven reserved characters (not backslash, but including the colon, question mark, pipe, asterisk, greater than and less than characters) to the remap range (above 0xF000), which also allows the client side to recognize files created with such characters by &Windows;’s POSIX emulation. This can also be useful when mounting to most versions of Samba. This has no effect if the server does not support Unicode.
de: Übersetzt sechs der sieben reservierten Zeichen, nicht den umgekehrten Schrägstrich, aber den Doppelpunkt, das Fragezeichen, den senkrechten Strich oder das Pipe-Symbol und die Zeichen kleiner als und größer als in den Umordnungsbereich oberhalb 0xF000, damit auf der Klientenseite auch Dateien mit solchen Zeichen von der POSIX-Emulation von &Windows; erkannt werden. Dies kann auch beim Einbinden zu den meisten Samba-Versionen nützlich sein. Dies ist wirkungslos, wenn der Server kein Unicode unterstützt.

source: Do not use locking
de: Keine Sperrung (locking) verwenden

source: Do not use locking. Do not start lockd.
de: Keine Sperrung (locking) verwenden. „lockd“ nicht starten.

source: Security mode
de: Sicherheitsmodus

source: Security mode. To be able to use this option, the CIFS kernel module 1.40 or later is needed.
de: Um diese Einstellung nutzen zu können, wird das CIFS-Kernelmodul 1.40 oder höher benötigt.

source: The allowed values are:
de: Folgende Werte sind erlaubt:

source: Connect as a null user (no name)
de: Verbindung als Null-Benutzer (ohne Namen) herstellen

source: The <option>sec=none</option> command line argument is used. This causes <ulink url="man:/mount.cifs"><citerefentry><refentrytitle>mount.cifs</refentrytitle><manvolnum>8</manvolnum></citerefentry></ulink> to attempt to connect as a null user (no name).
de: Der Befehlszeilenparameter <option>sec=none</option> wird verwendet. Damit versucht <ulink url="man:/mount.cifs"><citerefentry><refentrytitle>mount.cifs</refentrytitle><manvolnum>8</manvolnum></citerefentry></ulink> eine Verbindung als Null-Benutzer ohne Namen herzustellen.

source: Kerberos 5 authentication
de: Kerberos 5-Authentifizierung

source: The <option>sec=krb5</option> command line argument is used. This causes <ulink url="man:/mount.cifs"><citerefentry><refentrytitle>mount.cifs</refentrytitle><manvolnum>8</manvolnum></citerefentry></ulink> to use Kerberos version 5 authentication.
de: Der Befehlszeilenparameter <option>sec=krb5</option> wird verwendet. Damit benutzt <ulink url="man:/mount.cifs"><citerefentry><refentrytitle>mount.cifs</refentrytitle><manvolnum>8</manvolnum></citerefentry></ulink> die Authentifizierung mit Kerberos Version 5.

source: Kerberos 5 authentication and packet signing
de: Kerberos 5-Authentifizierung und Paketsignierung

source: The <option>sec=krb5i</option> command line argument is used. This causes <ulink url="man:/mount.cifs"><citerefentry><refentrytitle>mount.cifs</refentrytitle><manvolnum>8</manvolnum></citerefentry></ulink> to use Kerberos version 5 authentication and force packet signing.
de: Der Befehlszeilenparameter <option>sec=krb5i</option> wird verwendet. Damit benutzt <ulink url="man:/mount.cifs"><citerefentry><refentrytitle>mount.cifs</refentrytitle><manvolnum>8</manvolnum></citerefentry></ulink> die Authentifizierung mit Kerberos Version 5 und erzwingt die Signierung von Paketen.

source: NTLM protocol
de: NTLM-Protokoll

source: The <option>sec=ntlm</option> command line argument is used. This causes <ulink url="man:/mount.cifs"><citerefentry><refentrytitle>mount.cifs</refentrytitle><manvolnum>8</manvolnum></citerefentry></ulink> to use NTLM password hashing. Up to &Linux; kernel version 3.8 this is the default setting.
de: Der Befehlszeilenparameter <option>sec=ntlm</option> wird verwendet. Damit benutzt <ulink url="man:/mount.cifs"><citerefentry><refentrytitle>mount.cifs</refentrytitle><manvolnum>8</manvolnum></citerefentry></ulink> NTLM-Passwort-Hashing. Dies ist die Standardeinstellung bis zum &Linux;-Kernel Version 3.8.

source: NTLM protocol and packet signing
de: NTLM-Protokoll und Paketsignierung

source: The <option>sec=ntlmi</option> command line argument is used. This causes <ulink url="man:/mount.cifs"><citerefentry><refentrytitle>mount.cifs</refentrytitle><manvolnum>8</manvolnum></citerefentry></ulink> to use NTLM password hashing and force packet signing.
de: Der Befehlszeilenparameter <option>sec=ntlmi</option> wird verwendet. Damit benutzt <ulink url="man:/mount.cifs"><citerefentry><refentrytitle>mount.cifs</refentrytitle><manvolnum>8</manvolnum></citerefentry></ulink> NTLM-Passwort-Hashing und erzwingt die Signierung von Paketen.

source: NTLMv2 protocol
de: NTLMv2-Protokoll

source: The <option>sec=ntlmv2</option> command line argument is used. This causes <ulink url="man:/mount.cifs"><citerefentry><refentrytitle>mount.cifs</refentrytitle><manvolnum>8</manvolnum></citerefentry></ulink> to use NTLMv2 password hashing.
de: Der Befehlszeilenparameter <option>sec=ntlmv2</option> wird verwendet. Damit benutzt <ulink url="man:/mount.cifs"><citerefentry><refentrytitle>mount.cifs</refentrytitle><manvolnum>8</manvolnum></citerefentry></ulink> NTLMv2-Passwort-Hashing.

source: NTLMv2 protocol and packet signing
de: NTLMv2-Protokoll und Paketsignierung

source: The <option>sec=ntlmv2i</option> command line argument is used. This causes <ulink url="man:/mount.cifs"><citerefentry><refentrytitle>mount.cifs</refentrytitle><manvolnum>8</manvolnum></citerefentry></ulink> to use NTLMv2 password hashing and force packet signing.
de: Der Befehlszeilenparameter <option>sec=ntlmv2i</option> wird verwendet. Damit benutzt <ulink url="man:/mount.cifs"><citerefentry><refentrytitle>mount.cifs</refentrytitle><manvolnum>8</manvolnum></citerefentry></ulink> NTLMv2-Passwort-Hashing und erzwingt die Signierung von Paketen.

source: NTLMSSP protocol
de: NTLMSSP-Protokoll

source: The <option>sec=ntlmssp</option> command line argument is used. This causes <ulink url="man:/mount.cifs"><citerefentry><refentrytitle>mount.cifs</refentrytitle><manvolnum>8</manvolnum></citerefentry></ulink> to use NTLMv2 password hashing encapsulated in a Raw NTLMSSP message. Since &Linux; kernel version 3.8 this is the default setting.
de: Der Befehlszeilenparameter <option>sec=ntlmssp</option> wird verwendet. Damit benutzt <ulink url="man:/mount.cifs"><citerefentry><refentrytitle>mount.cifs</refentrytitle><manvolnum>8</manvolnum></citerefentry></ulink> NTLMv2-Passwort-Hashing verkapselt in einer NTLMSSP-Rohnachricht. Dies ist die Standardeinstellung seit zum &Linux;-Kernel Version 3.8.

source: NTLMSSP protocol and packet signing
de: NTLMSSP-Protokoll und Paketsignierung

source: The <option>sec=ntlmssp</option> command line argument is used. This causes <ulink url="man:/mount.cifs"><citerefentry><refentrytitle>mount.cifs</refentrytitle><manvolnum>8</manvolnum></citerefentry></ulink> to use NTLMv2 password hashing encapsulated in a Raw NTLMSSP message and force packet signing.
de: Der Befehlszeilenparameter <option>sec=ntlmssp</option> wird verwendet. Damit benutzt <ulink url="man:/mount.cifs"><citerefentry><refentrytitle>mount.cifs</refentrytitle><manvolnum>8</manvolnum></citerefentry></ulink> NTLMv2-Passwort-Hashing verkapselt in einer NTLMSSP-Rohnachricht und erzwingt die Signierung von Paketen.

source: Default: <guilabel>NTLMSSP protocol</guilabel>
de: Standard: <guilabel>NTLMSSP-Protokoll</guilabel>

source: Additional options
de: Zusätzliche Optionen

source: Define additional options for use with <ulink url="man:/mount.cifs"><citerefentry><refentrytitle>mount.cifs</refentrytitle><manvolnum>8</manvolnum></citerefentry></ulink>. They have to be provided in a comma-separated list and should not include any options that were already defined in the configuration dialog because this could lead to unwanted side effects. The list is appended AS IS to the command line arguments. To find out about the arguments that can be used read the manual page of <ulink url="man:/mount.cifs"><citerefentry><refentrytitle>mount.cifs</refentrytitle><manvolnum>8</manvolnum></citerefentry></ulink>.
de: Hier können zusätzliche Optionen für den Befehl <ulink url="man:/mount.cifs"><citerefentry><refentrytitle>mount.cifs</refentrytitle><manvolnum>8</manvolnum></citerefentry></ulink> eingetragen werden. Mehrere Optionen müssen durch Komma getrennt werden und sollten keine bereits im Einrichtungsdialog festgelegten Werte enthalten, da dies zu unerwünschten Seiteneffekten führen kann. Die Liste dieser Optionen wird unverändert als Befehlszeilenargument übergeben. Alle Argumente, die hier verwendet werden können, finden Sie in der Handbuchseite zu <ulink url="man:/mount.cifs"><citerefentry><refentrytitle>mount.cifs</refentrytitle><manvolnum>8</manvolnum></citerefentry></ulink>.

source: Default: empty
de: Voreinstellung: Leer

source: Utility Programs
de: Dienstprogramme

source: Protocol hint
de: Protokollhinweis
