Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/extragear-network/smb4k.po
Languages: de

source: Synchronize the mounted share with a local copy or vice versa. For further information read <link linkend="mounted_shares_view_menu">here</link> and <link linkend="mainwindow_shares_synchronization">here</link>.
de: Gleicht die eingebundene Freigabe mit einer lokalen Kopie und umgekehrt ab. Weitere Informationen dazu finden Sie <link linkend="mounted_shares_view_menu">hier</link> und <link linkend="mainwindow_shares_synchronization">hier</link>.

source: Open with &konsole;
de: Mit &konsole; öffnen

source: Open the base folder of the share in &konsole;.
de: Öffnet den Basisordner der Freigabe in &konsole;.

source: Open with File Manager
de: Mit Dateiverwaltung öffnen

source: Open the contents of the share in the default file manager (&eg; &dolphin;).
de: Öffnet den Inhalt der Freigabe im Standard-Dateiverwaltungsprogramm (&eg; &dolphin;).

source: The <guimenuitem>Bookmarks</guimenuitem> menu contains all your bookmarks organized according to the structure you gave them (see also <link linkend="mainwindow_add_bookmarks">here</link> and <link linkend="mainwindow_bookmarks_editor">here</link>)
de: Das Menü <guimenuitem>Lesezeichen</guimenuitem> enthält alle Ihre Lesezeichen, in der von Ihnen angegebenen Struktur. Weitere Informationen finden Sie <link linkend="mainwindow_add_bookmarks">hier</link> und <link linkend="mainwindow_bookmarks_editor">hier</link>.

source: Screenshot 2 of the popup menu of the system tray icon
de: Bildschirmfoto 2 des Kontextmenüs des Symbols im Systemabschnitt der Kontrollleiste

source: System tray icon's popup menu 2
de: Kontextmenü 2 des Symbols im Systemabschnitt der Kontrollleiste

source: Its layout is as described <link linkend="mainwindow_bookmarks_menu">here</link> except that the <guimenuitem>Add Bookmark</guimenuitem> menu item is not present.
de: Das Layout ist wie <link linkend="mainwindow_bookmarks_menu">hier</link> beschrieben, außer dass der Menüeintrag <guimenuitem>Lesezeichen hinzufügen</guimenuitem> nicht vorhanden ist.

source: The other menu entries are:
de: Folgende weitere Menüeinträge sind vorhanden:

source: Open Mount Dialog
de: Dialog zum Einbinden öffnen

source: Open the <link linkend="mainwindow_network_mounting">dialog</link> for "manual" mounts.
de: Öffnet einen <link linkend="mainwindow_network_mounting">Dialog</link>, um Freigaben manuell einzubinden.

source: Configure &smb4k;...
de: &smb4k; einrichten ...

source: Open the configuration dialog. See <link linkend="configuration">here</link> for a full list of available settings.
de: Öffnet den Einrichtungsdialog. In diesem <link linkend="configuration">Abschnitt</link> finden Sie eine Liste aller vorhandenen Einstellungen.

source: Minimize | Restore
de: Minimieren | Wiederherstellen

source: Hide (minimize) or show (restore) the main window. Which text is shown depends on the state of the main window.
de: Minimiert das Hauptfenster oder zeigt es wieder an. Der angezeigte Text hängt vom Zustand des Hauptfensters ab.

source: <shortcut> <keycombo action="simul"> &Ctrl; <keycap>Q</keycap> </keycombo> </shortcut> <guimenuitem>Quit</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo> </shortcut> <guimenuitem>Beenden</guimenuitem>

source: Quit the application.
de: Beendet das Programm.

source: The &plasmoid;
de: Das &plasmoid;

source: &smb4k; comes with a plasmoid that can be added as a widget to the desktop or the panel. It consists of three views that are arranged as tabs: <guilabel>Network Neighborhood</guilabel>, <guilabel>Mounted Shares</guilabel>, and <guilabel>Bookmarks</guilabel>.
de: Für &smb4k; gibt es ein Plasmoid, das als Miniprogramm auf der Arbeitsfläche oder in der Kontrollleiste abgelegt werde kann. Es enthält drei Ansichten als Karteikarten: <guilabel>Netzwerkumgebung</guilabel>, <guilabel>Eingebundene Freigaben</guilabel> und <guilabel>Lesezeichen</guilabel>.

source: Screenshot of the plasmoid on the desktop
de: Bildschirmfoto des Plasmoids auf der Arbeitsfläche

source: Screenshot of the plasmoid
de: Bildschirmfoto des Plasmoids

source: Network Neighborhood Tab
de: Karteikarte Netzwerkumgebung

source: In the <guilabel>Network Neighborhood</guilabel> tab the network items are arranged in a list view:
de: Auf der Karteikarte <guilabel>Netzwerkumgebung</guilabel> sind die Einträge im Netzwerk in einer Listenansicht angeordnet:

source: Screenshot of the plasmoid's network neighborhood tab
de: Bildschirmfoto der Karteikarte Netzwerkumgebung des &plasmoid;s

source: Bookmarks tab of the plasmoid
de: Karteikarte Lesezeichen des Plasmoids

source: By clicking an entry you either enter the level below (&eg; clicking a workgroup or domain item will show a list of all hosts belonging to it), mount the selected share or invoke the print dialog. To go one level up again, you need to click the <guibutton>Up</guibutton> button in the toolbar.
de: Durch Klicken auf einen Eintrag gehen Sie zur Ebene darunter, &eg; erhalten Sie durch Klicken auf eine Arbeitsgruppe oder Domäne eine Liste aller darin enthaltenen Rechner, binden die ausgewählte Freigabe ein oder öffnen den Druckdialog. Durch Klicken auf den Knopf <guibutton>Nach oben</guibutton> in der Werkzeugleiste gehen Sie wieder eine Ebene aufwärts.

source: For hosts and shares, to the right of the name of the network item some action buttons are arranged. For hosts, there is one button with that you can open the <link linkend="network_neighborhood_browser_custom">Custom Options</link> dialog. For shares, there is an additional button with that you can <link linkend="mainwindow_add_bookmarks">add the share to the bookmarks</link>. The action buttons are transparent by default and change to opaque when you move your mouse over them. By left clicking you initiate the respective action.
de: Bei Rechnern und Freigaben finden Sie rechts neben dem Namen des Netzwerkeintrags einige Aktionen. Bei Rechnern gibt es einen Knopf, mit dem Sie den Dialog <link linkend="network_neighborhood_browser_custom">Benutzerdefinierte Einstellungen</link> öffnen können. Bei Freigaben gibt es einen zusätzlichen Knopf, mit dem Sie die Freigabe zu den <link linkend="mainwindow_add_bookmarks">Lesezeichen</link> hinzufügen können. Die Knöpfe für diese Aktionen werden als Standard durchsichtig dargestellt und erscheinen erst dann undurchsichtig, wenn Sie den Mauszeiger darüber halten. Durch Klicken mit der &LMBn; wird die zugehörige Aktion ausgelöst.

source: Besides the already mentioned <guibutton>Up</guibutton> button, the toolbar contains three more entries: <guibutton>Rescan</guibutton>, <guibutton>Abort</guibutton> and <guibutton>Mount Dialog</guibutton>. With them you can do a rescan, abort any running action or open the <link linkend="mainwindow_network_mounting">dialog for "manual" mounts</link>.
de: Außer dem bereits genannten Knopf <guibutton>Nach oben</guibutton> enthält die Werkzeugleiste drei weitere Einträge: <guibutton>Erneut einlesen</guibutton>, <guibutton>Abbrechen</guibutton> und <guibutton>Dialog zum Einbinden</guibutton>. Mit ihnen können Sie die Freigaben neu einlesen, jede laufende Aktion abbrechen oder den <link linkend="mainwindow_network_mounting">Dialog zum manuellen Einbinden</link> öffnen.

source: Mounted Shares Tab
de: Karteikarte Eingebundene Freigaben

source: In the <guilabel>Mounted Shares</guilabel> tab all mounted shares are listed:
de: Auf der Karteikarte <guilabel>Eingebundene Freigaben</guilabel> werden alle eingebundenen Freigaben aufgelistet.

source: Screenshot of the plasmoid's mounted shares tab
de: Bildschirmfoto der Karteikarte Eingebundene Freigaben des Plasmoids

source: Right to the name of the share and its host, two action buttons are arranged. The first one is for <link linkend="mainwindow_add_bookmarks">adding a bookmark</link> and the second for unmounting the shares. The action buttons are transparent by default and change to opaque when you move your mouse over them. By left clicking you initiate the respective action.
de: Rechts neben dem Namen der Freigabe und des Rechners sind zwei Knöpfe angeordnet. Der erste kann benutzt werden, um <link linkend="mainwindow_add_bookmarks">Lesezeichen hinzuzufügen</link> und der zweite zum Lösen der Einbindungen von Freigaben. Die Knöpfe werden in der Voreinstellung durchsichtig angezeigt und werden durchsichtig, wenn Sie den Mauszeiger darüber bewegen. Durch Klicken mit der &LMBn; könne Sie die entsprechende Aktion starten.

source: The toolbar only contains the <guibutton>Unmount All</guibutton> with that you can unmount all shares at once.
de: Die Werkzeugleiste enthält den Knopf <guibutton>Alle Einbindungen lösen</guibutton>, mit dem Sie alle eingebunden Freigaben auf einmal lösen können.

source: Bookmarks Tab
de: Karteikarte Lesezeichen

source: In the <guilabel>Bookmarks</guilabel> tab the bookmark groups and bookmarks are listed:
de: Auf der Karteikarte <guilabel>Lesezeichen</guilabel> werden die Lesezeichengruppen und die Lesezeichen selbst aufgelistet:

source: Screenshot of the plasmoid's bookmarks tab
de: Bildschirmfoto der Karteikarte Lesezeichen des Plasmoids

source: Bookmarked shares can be mounted by left clicking the respective bookmark. Bookmark groups can be entered the same way.
de: Freigaben als Lesezeichen können durch Klicken mit der &LMBn; darauf eingebunden werden. Gruppen von Lesezeichen können auf die gleiche Art eingegeben werden.

source: To edit or remove the bookmarks, you can press the <guibutton>Edit</guibutton> action button in the toolbar to open the <link linkend="mainwindow_bookmarks_editor">Bookmark Editor</link>. To get back to the toplevel the <guibutton>Back</guibutton> button is used.
de: Um Lesezeichen zu bearbeiten oder zu entfernen, drücken Sie den Knopf <guibutton>Bearbeiten</guibutton> in der Werkzeugleiste und öffnen damit den <link linkend="mainwindow_bookmarks_editor">Lesezeichen-Editor</link>. Benutzen Sie den Knopf <guibutton>Zurück</guibutton>, um wieder zur obersten Ebene zurückzugehen.

source: Remarks for FreeBSD Users
de: Hinweis für FreeBSD-Benutzer

source: DBUS and PolKit-1
de: D-Bus und PolKit-1

source: &smb4k; makes use of the &kde; authorization API (KAuth) to enable mounting of remote shares. KAuth uses DBUS and PolKit-1 (or PolicyKit) for privilege escalation, so it is necessary that &smb4k; is set up properly. When installing &smb4k; under FreeBSD, it might be necessary to manually adjust some things to achieve this (With version 1.0.10 of package <application>kdehier4</application> this seems to be fixed!):
de: &smb4k; benutzt die &kde;-Authentifizierungs-Schnittstelle KAuth, um das Einbinden von entfernten Freigaben zu ermöglichen. KAuth verwendet D-Bus und PolKit-1 (oder PolicyKit) zur Ausweitung von Privilegien, daher muss &smb4k; richtig eingerichtet werden. Bei der Installation von &smb4k; unter FreeBSD müssen möglicherweise einige Einstellungen angepasst werden, um dies zu erreichen. Mit der Version 1.0.10 des Pakets <application>kdehier4</application> ist dieser Fehler anscheinend behoben.

source: Check that the file <filename>de.berlios.smb4k.mounthelper.policy</filename> exists in the directory <filename class="directory">/usr/local/share/polkit-1/actions/</filename>. If it is not present, you need to link (or copy) it to that location:
de: Überprüfen Sie, ob die Datei <filename>de.berlios.smb4k.mounthelper.policy</filename> im Ordner <filename class="directory">/usr/local/share/polkit-1/actions/</filename> existiert. Ist die Datei nicht vorhanden, müssen Sie eine Verknüpfung anlegen oder sie dahin kopieren.

source: The installation most likely put the DBUS files into the wrong location, so you have to link (or copy) them to the right one:
de: Wahrscheinlich wurden die D-Bus-Dateien am falschen Ort gespeichert, daher müssen Sie sie Verknüpfungen zu den richtigen Orten anlegen oder die Dateien kopieren.

source: Mounting
de: Einbinden

source: Under FreeBSD, the SMB protocol is implemented in a different way than with other *NIX operating systems, and, thus, mounting of remote shares works differently. The major difference is the way the logon information is passed during the mount process. While under &Linux; and other operating systems that use Samba's <ulink url="man:/mount.cifs"><citerefentry><refentrytitle>mount.cifs</refentrytitle><manvolnum>8</manvolnum></citerefentry></ulink> program you may specify the user name and password within the command options or by setting the <envar>USER</envar> and <envar>PASSWD</envar> environment variables, under FreeBSD, all logon information is stored in the credentials file <filename>~/.nsmbrc</filename>. If the logon information is not available there, you will not be able to mount a password protected share.
de: Unter FreeBSD ist das SMB-Protokoll auf eine andere Art definiert als in anderen *NIX-Betriebssystemen, daher funktioniert das Einbinden von Freigaben anders. Der wichtigste Unterschied besteht darin, wie die Anmeldungsdaten während der Einbindung übergeben werden. Während Sie unter &Linux; und anderen Betriebssystemen, die das Samba-Programm <ulink url="man:/mount.cifs"><citerefentry><refentrytitle>mount.cifs</refentrytitle><manvolnum>8</manvolnum></citerefentry></ulink> verwenden, den Benutzernamen und das Passwort als Befehlszeilenargumente oder durch die Umgebungsvariablen <envar>USER</envar> und <envar>PASSWD</envar> angeben können. werden unter FreeBSD alle Anmeldungsinformationen in der Datei <filename>~/.nsmbrc</filename> gespeichert. Ist diese Datei nicht vorhanden, können Sie keine passwortgeschützte Freigabe einbinden.

source: &smb4k; writes new logon information to the credentials file on the fly, so that it can be used immediately. If you use a WINS server, this one and a few more global things will be considered, too. However, the information &smb4k; writes to <filename>~/.nsmbrc</filename> is limited: Only the name of the remote share, its workgroup, the login name (user name) and the encrypted password are provided. If you experience problems due to missing entries, you need to add them manually.
de: &smb4k; schreibt die neuen Anmeldungsinformationen direkt bei der Eingabe in diese Datei, die dann sofort benutzt werden kann. Verwenden Sie einen WINS-Server, kann dieser und einige weitere globale Daten auch mit eingebunden werden. &smb4k; schreibt jedoch nur begrenzte Informationen in die Datei <filename>~/.nsmbrc</filename>: Nur den Namen der entfernten Freigabe, dessen Arbeitsgruppe, den Anmeldungsdaten oder Benutzernamen und das verschlüsselte Passwort. Treten bei Ihnen Probleme wegen fehlender Einträge auf, müssen Sie sie von Hand hinzufügen.

source: Configuring &smb4k;
de: &smb4k; einrichten

source: This section describes the settings that are available to configure &smb4k;. To open the configuration dialog, you have to click the <link linkend="mainwindow_overview"><guimenuitem>Configure &smb4k;...</guimenuitem></link> menu item.
de: In diesem Abschnitt werden alle Einstellungen für &smb4k; beschrieben. Um den Einrichtungsdialog zu öffnen, wählen Sie <link linkend="mainwindow_overview"><guimenuitem>&smb4k; einrichten ...</guimenuitem></link> aus dem Menü.

source: User Interface
de: Benutzeroberfläche

source: With the options located here you can change the appearance and behavior of several dialogs and widgets. Please note that if you want to change the appearance of the main window you will find additional options under <guimenu>Settings</guimenu> in the <link linkend="mainwindow_overview">menubar</link>.
de: Mit den Einstellungen auf dieser Seite können Sie das Erscheinungsbild und das Verhalten von verschiedenen Dialogen und Fenstern ändern. Möchten Sie das Erscheinungsbild des Hauptfenster ändern, finden Sie zusätzliche Einstellungen in der <link linkend="mainwindow_overview">Menüleiste</link> im Eintrag <guimenu>Einstellungen</guimenu>.

source: Screenshot of the "User Interface" configuration tab
de: Bildschirmfoto der Einrichtungsseite „Benutzeroberfläche“

source: The "Appearance" configuration tab
de: Die Einrichtungsseite „Benutzeroberfläche“

source: General Settings
de: Allgemeine Einstellungen

source: Notifications
de: Benachrichtigungen

source: Show notifications
de: Benachrichtigungen anzeigen

source: The user is notified about actions that were performed, &ie; the mounting or unmounting of a share. If you do not want to be disturbed too often, you might want to switch this option off. Warnings and error messages are not affected by this option.
de: Der Benutzer wird über durchgeführte Aktionen benachrichtigt, &ie; das Einbinden oder Lösen der Einbindung einer Freigabe. Falls Sie nicht zu häufig gestört werden wollen, dann sollten Sie diese Option ausschalten. Warnungen und Fehlermeldungen sind nicht von dieser Option betroffen.

source: Default: selected
de: Voreinstellung: aktiviert

source: Bookmarks
de: Lesezeichen

source: Show custom bookmark label if available
de: Benutzerdefinierte Lesezeichenbeschreibung anzeigen, falls vorhanden

source: The custom description (label) of the bookmark is shown. It can be defined in the <link linkend="mainwindow_bookmarks_editor">bookmark editor</link>.
de: Die benutzerdefinierte Beschreibung von Lesezeichen wird angezeigt. Diese Beschreibung kann im <link linkend="mainwindow_bookmarks_editor">Lesezeichen-Editor</link> eingegeben werden.

source: Network Neighborhood
de: Netzwerkumgebung

source: Behavior
de: Verhalten

source: Automatically expand domains and hosts
de: Domänen und Rechner automatisch öffnen

source: Automatically expand domain and host items when a list of associated network items (domain members or shares) is added or updated. Please note that a domain or host item will always be expanded when you execute it.
de: Domänen- und Rechnereinträge automatisch öffnen, wenn einen Liste zugehöriger Netzwerkeinträge (Rechner oder Freigaben) hinzugefügt oder aktualisiert werden. Bitte beachten Sie, dass ein Domänen- oder Rechnereintrag grundsätzlich geöffnet wird, wenn man ihn ausführt.

source: Remote Shares
de: Entfernte Freigaben

source: Show printer shares
de: Drucker-Freigaben anzeigen

source: Printer shares are shown.
de: Freigegebene Drucker werden angezeigt.

source: Show hidden shares
de: Versteckte Freigaben anzeigen

source: All hidden shares except those of type ADMIN$ and IPC$ are shown in the network browser.
de: Alle versteckten Freigaben außer ADMIN$- und IPC$-Freigaben werden im Netzwerkbrowser angezeigt.

source: Show hidden IPC$ shares
de: Versteckte IPC$-Freigaben anzeigen

source: Hidden IPC$ shares are shown. This option can only be chosen if you also ticked the <guibutton>Show hidden shares</guibutton> check box.
de: Versteckte $-Freigaben werden anzeigt. Diese Einstellung kann nur dann aktiviert werden, wenn auch das Ankreuzfeld <guibutton>Versteckte Freigaben anzeigen</guibutton> markiert ist.

source: Default: not selected
de: Voreinstellung: nicht aktiviert

source: Show hidden ADMIN$ shares
de: Versteckte ADMIN$-Freigaben anzeigen

source: Hidden ADMIN$ shares are shown. This option can only be chosen if you also ticked the <guibutton>Show hidden shares</guibutton> check box.
de: Versteckte ADMIN$-Freigaben werden anzeigt. Diese Einstellung kann nur dann aktiviert werden, wenn auch das Ankreuzfeld <guibutton>Versteckte Freigaben anzeigen</guibutton> markiert ist.

source: Columns
de: Spalten

source: Show the type of the share
de: Typ der Freigabe anzeigen

source: The type of the shares is shown (i. e. Disk, Printer, or IPC).
de: Der Typ der Freigaben wird angezeigt, zum Beispiel Festplatte, Drucker, oder IPC.

source: Show the IP address of the server
de: IP-Adresse des Servers anzeigen

source: The IP address of the remote servers is shown.
de: Die IP-Adresse des entfernten Servers wird angezeigt.

source: Show the comment
de: Kommentar anzeigen

source: The comment of a remote server or share is shown.
de: Die Kommentar zu einem entfernten Server wird angezeigt.

source: Show a tooltip with information about the network item
de: Kurzinfo mit Informationen über den Netzwerkeintrag anzeigen

source: A tooltip will be shown when you move the mouse pointer over an item in the network neighborhood browser. It contains information about the network item such as the workgroup or domain name, host name, comment, type, &etc;
de: Eine Kurzinfo wird angezeigt, wenn Sie den Mauszeiger auf einen Eintrag in Browser der Netzwerkumgebung bewegen. Dies enthält Informationen über den Netzwerkeintrag wie den Namen der Arbeitsgruppe oder Domäne, den Rechnernamen, Kommentare, Typ &etc;

source: Mounted Shares
de: Eingebundene Freigaben

source: View
de: Ansicht

source: Show mounted shares in an icon view
de: Eingebundenen Freigaben in einer Symbolansicht anzeigen

source: An icon view will be used to show the mounted shares.
de: Die eingebundenen Freigaben werden in einer Symbolansicht angezeigt.

source: Show mounted shares in a list view
de: Eingebundenen Freigaben in einer Listenansicht anzeigen

source: A list view will be used to show the mounted shares.
de: Die eingebundenen Freigaben werden in einer Listenansicht angezeigt.

source: The following settings are specifically defined for the list view:
de: Es gibt folgende Einstellungen speziell für die Listenansicht:

source: Show the owner and group
de: Eigentümer und Gruppe anzeigen

source: Show the UID and GID that owns the share in the list view.
de: Die UID und GID der Eigentümer der Freigabe werden in der Listenansicht angezeigt.

source: Show the login name
de: Benutzernamen anzeigen

source: Show the login name that was used for mounting. An entry will only be shown if the share was mounted with the CIFS file system. The column will be empty otherwise.
de: Zeigt den Benutzernamen an, mit dem die Freigabe eingebunden wurde. Es werden nur Einträge angezeigt, wenn die Freigabe mit dem CIFS-Dateisystem eingebunden wurde. Ansonsten ist diese Spalte leer.

source: Show the file system
de: Dateisystem anzeigen

source: Show the file system that is used by the share.
de: Das verwendete Dateisystem der Freigabe wird angezeigt.

source: Show the free disk space
de: Freien Speicherplatz anzeigen

source: Show the free disk space that is available on the share.
de: Der verfügbare freie Speicherplatz der Freigabe wird angezeigt.

source: Show the used disk space
de: Verwendeten Speicherplatz anzeigen

source: Show the disk space that is in use on the share.
de: Der belegte Speicherplatz der Freigabe wird angezeigt.

source: Show the total disk space
de: Gesamten Speicherplatz anzeigen

source: Show the total disk space that the share offers.
de: Der gesamte Speicherplatz der Freigabe wird anzeigt.

source: Show the disk usage
de: Speicherverwendung anzeigen

source: Show the disk usage in percent.
de: Die Belegung des Speicherplatzes wird als Prozentwert angezeigt.

source: Show the mount point instead of the share name
de: Mount-Punkt anstelle des Freigabenamens anzeigen

source: The mount point is shown instead of the share name.
de: Der Mount-Punkt wird anstatt des Freigabenamens angezeigt.

source: Show all shares that are mounted on the system
de: Alle Freigaben anzeigen, die auf dem System eingebunden sind

source: <emphasis>All</emphasis> mounts that are using either the CIFS (&Linux;) or SMBFS (FreeBSD) file system are shown. By default, only the shares owned by you are displayed.
de: Zeigt <emphasis>alle</emphasis> eingebunden Freigaben an, die entweder das Dateisystem CIFS (&Linux;) oder SMBFS (FreeBSD) verwenden. In der Voreinstellung werden nur Ihre eigenen Freigaben angezeigt.

source: Show a tooltip with information about the share
de: Kurzinfo mit Informationen über die Freigabe anzeigen
