Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/extragear-network/smb4k.po
Languages: de

source: With these settings you can give &smb4k; a hint, which protocol should be used with the <ulink url="man:/net"><citerefentry><refentrytitle>net</refentrytitle><manvolnum>8</manvolnum></citerefentry></ulink> command. Since for some actions not all protocols are available, your choice might be ignored for certain tasks.
de: Mit dieser Option können Sie &smb4k; einen Hinweis geben, welches Protokoll für den Befehl <ulink url="man:/net"><citerefentry><refentrytitle>net</refentrytitle><manvolnum>8</manvolnum></citerefentry></ulink> verwendet werden soll. Da einige Aktionen nicht für alle Protokolle verfügbar sind, kann Ihre Auswahl bei bestimmten Aufgaben ignoriert werden.

source: If only a few and not all servers need tweaking, you should consider to use the <link linkend="network_neighborhood_browser_custom">Custom Options</link> dialog to set the protocol hint and leave this option untouched.
de: Wenn dies nur für einige und nicht alle Server angepasst werden muss, sollten Sie den Protokollhinweis im <link linkend="network_neighborhood_browser_custom">Einrichtungsdialog</link> festlegen und diese Option hier unverändert lassen.

source: Automatic detection
de: Automatische Erkennung

source: The protocol will be determined automatically by the <ulink url="man:/net"><citerefentry><refentrytitle>net</refentrytitle><manvolnum>8</manvolnum></citerefentry></ulink> command on run time. This is the default and in most cases you do not need to change it. However, sometimes connection problems occur because the <ulink url="man:/net"><citerefentry><refentrytitle>net</refentrytitle><manvolnum>8</manvolnum></citerefentry></ulink> program has problems negotiating the right protocol. In almost all cases this can be fixed by setting the protocol hint to the RPC protocol.
de: Das Protokoll wird automatisch durch das Programm <ulink url="man:/net"><citerefentry><refentrytitle>net</refentrytitle><manvolnum>8</manvolnum></citerefentry></ulink> zur Laufzeit bestimmt. Dies ist die Voreinstellung und muss in den meisten Fällen nicht geändert werden. Manchmal treten jedoch Verbindungsprobleme auf, weil <ulink url="man:/net"><citerefentry><refentrytitle>net</refentrytitle><manvolnum>8</manvolnum></citerefentry></ulink> nicht das richtige Protokoll aushandelt. Dieser Fehler kann in fast allen Fällen korrigiert werden, indem Sie für den Protokollhinweis das RPC-Protokoll festlegen.

source: RPC: Modern operating systems
de: RPC: Moderne Betriebssysteme

source: The RPC protocol is used by the modern &Windows; variants (2000/XP/2003) and by Samba.
de: Das RPC-Protokoll wird von modernen &Windows;-Versionen (2000/XP/2003) und von Samba benutzt.

source: RAP: Older operating systems
de: RAP: Ältere Betriebssysteme

source: The RAP protocol is used by older &Windows; systems (95/98/Me). Its disadvantage is, that it does not support long share names. However, &smb4k; uses it as fallback.
de: Das RAP-Protokoll wird von älteren &Windows;-Systemen (95/98/Me) verwendet. Dieses Protokoll erlaubt keine langen Namen für Freigaben. Es wird jedoch von &smb4k; als Ausweichlösung verwendet.

source: ADS: Active Directory environment (LDAP/Kerberos)
de: ADS: Active-Directory-Umgebung (LDAP/Kerberos)

source: &smb4k; will try to use the ADS protocol if appropriate. Please note, that no command has been implemented yet that uses the ADS protocol, so this setting will have no effect for now.
de: &smb4k; versucht möglichst das ADS-Protokoll zu benutzten. Beachten Sie, dass dieser Befehl noch nicht implementiert wurde, so dass diese Einstellung zurzeit keine Auswirkungen hat.

source: Default: Automatic detection
de: Voreinstellung: Automatische Erkennung

source: Broadcast address
de: Broadcast-Adresse

source: Send a query to the given broadcast address. Without this option the default behavior of nmblookup is to send the query to the broadcast address of the network interfaces as either auto-detected or defined in the <screen>interfaces = ...</screen> parameter of the <filename>smb.conf</filename> file.
de: Sendet eine Abfrage an die angegebene Broadcast-Adresse. Ohne diese Option wird als Standardverhalten von nmblookup Abfragen an die Broadcast-Adresse der Netzwerkschnittstelle gesendet, die automatisch erkannt oder mit dem Parameter <screen>interfaces = ...</screen> in der Datei <filename>smb.conf</filename> festgelegt wurde.

source: Default: options defined in <filename>smb.conf</filename>
de: Voreinstellung: Optionen, die in <filename>smb.conf</filename> definiert sind

source: Try and bind to UDP port 137 to send and receive UDP datagrams
de: UDP-Port 137 zum Austausch von UDP-Datagrammen verwenden

source: The reason for this option is a bug in Windows 95 where it ignores the source port of the requesting packet and only replies to UDP port 137. Under normal circumstances, you do not need to tick this check box. If you experience problems while scanning the network and you want to enable this option, read the manual page of <ulink url="man:/nmblookup"><citerefentry><refentrytitle>nmblookup</refentrytitle><manvolnum>1</manvolnum></citerefentry></ulink> before.
de: Der Grund für diese Option ist ein Fehler in Windows 95, das den Quellport bei einer Paketanfrage ignoriert und nur auf dem UDP-Port 137 antwortet. Unter normalen Umständen muss diese Option nicht benutzt werden. Haben Sie aber Probleme beim Durchsuchen des Netzwerks und möchten Sie daher diese Option aktivieren, lesen Sie bitte die Handbuchseite von <ulink url="man:/nmblookup"><citerefentry><refentrytitle>nmblookup</refentrytitle><manvolnum>1</manvolnum></citerefentry></ulink>.

source: Name resolve order
de: Auflösungsreihenfolge

source: Determine what naming services and in what order are used to resolve host names to IP addresses. The option takes a space-separated string of different name resolution options. The options are: "lmhost", "host", "wins" and "bcast". For further information see the manual page of <ulink url="man:/smbclient"><citerefentry><refentrytitle>smbclient</refentrytitle><manvolnum>1</manvolnum></citerefentry></ulink>.
de: Diese Einstellung wird verwendet, um die Dienste und ihre Reihenfolge zu bestimmen, die zur Auflösung der Rechnernamen und IP-Adressen benutzt werden sollen. Es kann eine Liste von bis zu vier, durch Kommata getrennte Dienste angegeben werden. Folgende Optionen stehen zur Verfügung: „lmhost“, „host“, „wins“, „bcast“. Lesen Sie die Handbuchseite (manpage) von <ulink url="man:/smbclient"><citerefentry><refentrytitle>smbclient</refentrytitle><manvolnum>1</manvolnum></citerefentry></ulink> für weitere Informationen.

source: Buffer size
de: Puffergröße

source: Change the transmit/send buffer size when getting or putting a file from/to a remote server.
de: Diese Einstellung ändert die Übermittlungs-/Sendepuffergröße, die für die Dateiübertragung vom oder zum Server benutzt wird.

source: Default: 65520 Bytes
de: Voreinstellung: 65520 Byte

source: Send requests as broadcasts
de: Broadcast-Anfragen senden

source: Query network nodes by sending requests as broadcasts instead of querying the local master browser.
de: Netzwerkknoten werden durch Senden von Broadcast-Anfragen abgefragt, anstatt den lokalen Masterbrowser abzufragen.

source: This configuration page contains options that influence the behavior of the <ulink url="man:/rsync"><citerefentry><refentrytitle>rsync</refentrytitle><manvolnum>1</manvolnum></citerefentry></ulink> command that is used to synchronize remote shares with local copies and vice versa. It is only available, if <ulink url="man:/rsync"><citerefentry><refentrytitle>rsync</refentrytitle><manvolnum>1</manvolnum></citerefentry></ulink> is installed on your system. It is recommend, that you read the <ulink url="man:/rsync">manual page</ulink> before you use the synchronization feature the first time. However, safe settings are pre-defined. You will do no harm, if you start right away.
de: Diese Einrichtungsseite enthält Einstellungen für das Verhalten des Befehls <ulink url="man:/rsync"><citerefentry><refentrytitle>rsync</refentrytitle><manvolnum>1</manvolnum></citerefentry></ulink>, der für das Abgleichen von entfernten Freigaben mit lokalen Kopien und umgekehrt. Diese Seite ist nur verfügbar, wenn <ulink url="man:/rsync"><citerefentry><refentrytitle>rsync</refentrytitle><manvolnum>1</manvolnum></citerefentry></ulink> auf Ihrem System installiert ist. Es wird empfohlen, dass Sie die <ulink url="man:/rsync">Handbuchseite</ulink> lesen, ehe Sie das Abgleichen zum ersten mal benutzen. Es sind jedoch sichere Einstellungen vordefiniert, daher können Sie auch problemlos direkt starten.

source: Screenshot of the "Synchronization" configuration page
de: Bildschirmfoto der Einrichtungsseite „Abgleich“

source: The "Synchronization" configuration page
de: Die Einrichtungsseite „Abgleich“

source: Copying
de: Kopieren

source: Default Destination
de: Standardzielordner

source: Synchronization prefix
de: Basisordner für den Abgleich

source: This is the base folder below which &smb4k; stores the transferred data using <ulink url="man:/rsync"><citerefentry><refentrytitle>rsync</refentrytitle><manvolnum>1</manvolnum></citerefentry></ulink>. It can be changed by using the &URL; requester (Click the button with the folder icon.) or by directly entering the new path into the text box. Path variables like $HOME are recognized.
de: Dies ist der Basisordner, unter dem &smb4k; die übertragenden Daten mit Hilfe von <ulink url="man:/rsync"><citerefentry><refentrytitle>rsync</refentrytitle><manvolnum>1</manvolnum></citerefentry></ulink> speichert. Dieser Ordner kann durch Klicken auf das Ordnersymbol oder durch direkte Eingabe des neuen Pfads in das Eingabefeld geändert werden. Pfadvariablen wie $HOME werden erkannt.

source: For each share you synchronize, a new subdirectory below this prefix will be generated. If you want to synchronize the contents of a share to a different folder, you can define it in the <link linkend="mainwindow_shares_synchronization">synchronization dialog</link>.
de: Für jede Freigabe die Sie abgleichen, wird in diesem Basisordner ein eigener Ordner. Möchten Sie den Inhalt einer Freigabe mit einem anderen Ordner abgleichen, können Sie dies im <link linkend="mainwindow_shares_synchronization">Abgleichdialog</link> einstellen.

source: Default: <filename class="directory">$HOME/smb4k_sync/</filename>
de: Voreinstellung: <filename class="directory">$HOME/smb4k_sync/</filename>

source: General
de: Allgemein

source: Archive mode
de: Archivierungsmodus

source: Option: <option>-a</option>/<option>--archive</option>, same as <option>-rlptgoD</option> (no <option>-H</option>)
de: Option: <option>-a</option>/<option>--archive</option>, wie <option>-rlptgoD</option> (keine <option>-H</option>)

source: Switch the archive mode on. This is a quick way of saying you want recursion and want to preserve almost everything. Note that <option>-a</option> does not preserve hardlinks, because finding multiply-linked files is expensive. You must separately specify <option>-H</option>.
de: Schalter den Archivmodus ein. Die ist ein abgekürzte Option, wenn Sie rekursiv abgleichen und dabei fast alles behalten möchten. Beachten Sie, dass mit der Option <option>-a</option> keine harten Verknüpfungen erhalten bleiben, da die Suche bei mehrfach verknüpften Dateien zeitaufwendig ist, Dazu müssen Sie die Option <option>-H</option> getrennt angeben.

source: Recurse into subdirectories
de: In Ordner hinabsteigen

source: Recurse into subdirectories.
de: In Ordner hinabsteigen.

source: Update files
de: Dateien aktualisieren

source: This forces <ulink url="man:/rsync"><citerefentry><refentrytitle>rsync</refentrytitle><manvolnum>1</manvolnum></citerefentry></ulink> to skip any files that exist on the destination and have a modification time that is newer than the one of the source file. (If an existing destination file has a modification time equal to the source file's, it will be updated if the sizes are different.)
de: Mit dieser Einstellung überspringt <ulink url="man:/rsync"><citerefentry><refentrytitle>rsync</refentrytitle><manvolnum>1</manvolnum></citerefentry></ulink> jede Datei, die auf dem Ziel vorhanden ist und eine neuer Änderungszeit als die Quelldatei hat. Sind die Änderungszeiten der Datei in Quelle und Ziel gleich, wird die Datei aktualisiert, wenn die Größe verschieden ist.

source: Update files in place
de: Dateien am Platz aktualisieren

source: This causes <ulink url="man:/rsync"><citerefentry><refentrytitle>rsync</refentrytitle><manvolnum>1</manvolnum></citerefentry></ulink> not to create a new copy of the file and then move it into place. Instead <ulink url="man:/rsync"><citerefentry><refentrytitle>rsync</refentrytitle><manvolnum>1</manvolnum></citerefentry></ulink> will overwrite the existing file, meaning that the rsync algorithm cannot accomplish the full amount of network reduction it might be able to otherwise. One exception to this is if you combine the option with <option>--backup</option>, since <ulink url="man:/rsync"><citerefentry><refentrytitle>rsync</refentrytitle><manvolnum>1</manvolnum></citerefentry></ulink> is smart enough to use the backup file as the basis file for the transfer.
de: Mit dieser Option erstellt <ulink url="man:/rsync"><citerefentry><refentrytitle>rsync</refentrytitle><manvolnum>1</manvolnum></citerefentry></ulink> nicht zuerst eine neue Kopie der Datei und verschiebt sie dann an den richtigen Ort. Stattdessen überschreibt <ulink url="man:/rsync"><citerefentry><refentrytitle>rsync</refentrytitle><manvolnum>1</manvolnum></citerefentry></ulink> die vorhandene Datei. Daher kann der rsync-Algorithmus die Verringerung des Netzwerkverkehrs wie sonst erreichen. Die Ausnahme ist, wenn Sie diese Option mit <option>--backup</option> kombinieren, da <ulink url="man:/rsync"><citerefentry><refentrytitle>rsync</refentrytitle><manvolnum>1</manvolnum></citerefentry></ulink> dann die Sicherungsdateien als Basisdatei für die Übertragung verwendet.

source: For further information you ought to read the <ulink url="man:/rsync">manual page</ulink>.
de: Für weitere Informationen sollten Sie die <ulink url="man:/rsync">Handbuchseite von rsync</ulink> lesen.

source: Use relative path names
de: Relative Pfadnamen verwenden

source: Use relative path names. This means that the full path names specified on the command line are sent to the server rather than just the last parts of the file names.
de: Relative Pfadnamen verwenden. Das bedeutet, dass die in der Befehlszeile angegeben Pfadnamen in voller Länge an den Server übermittelt werden. Anderenfalls wird jeweils nur der hintere Teil weitergegeben.

source: Do not send implied directories
de: Keine eingeschlossenen Ordner senden

source: This option affects the default behavior of the <option>--relative</option> option. When it is specified, the attributes of the implied directories from the source names are not included in the transfer. This means that the corresponding path elements on the destination system are left unchanged if they exist, and any missing implied directories are created with default attributes. This even allows these implied path elements to have big differences, such as being a symlink to a folder on one side of the transfer, and a real folder on the other side.
de: Diese Option betrifft das Standardverhalten von <option>--relative</option>. Ist sie angegeben, sind die Attribute der eingeschlossenen Ordner der Quellnamen nicht in der Übertragung enthalten. D. h, dass die entsprechenden Pfadelemente auf der Zielseite unverändert bleiben, wenn sie existieren, und dass alle fehlenden eingeschlossenen Ordner mit den Standardattributen erstellt werden. Dadurch können eingeschlossene Pfadelemente seht unterschiedlich sein, wie zum Beispiel eine symbolische Verknüpfung zu einem Ordner auf der einen und ein tatsächlich vorhandener Ordner auf der anderen Seite der Übertragung.

source: Transfer directories without recursing
de: Ordner nicht rekursiv übertragen

source: Tell the sending side to include any directories that are encountered. Unlike <option>--recursive</option>, a folders contents is not copied unless the folder name specified is "." or ends with a trailing slash (&eg; ".", "dir/.", "dir/", &etc;). Without this option or the <option>--recursive</option> option, <ulink url="man:/rsync"><citerefentry><refentrytitle>rsync</refentrytitle><manvolnum>1</manvolnum></citerefentry></ulink> will skip all directories it encounters (and output a message to that effect for each one). If you specify both <option>--dirs</option> and <option>--recursive</option>, <option>--recursive</option> takes precedence.
de: Mit dieser Einstellung werden alle gefundenen Ordner eingeschlossen. Im Unterschied zur Option <option>--recursive</option> wird der Inhalt eines Ordners nicht kopiert, wenn der Ordnername nicht als "." angegeben ist oder mit einem angefügten Schrägstrich endet, &eg; ".", "dir/.", "dir/", &etc; Ohne diese oder die Option <option>--recursive</option> überspringt <ulink url="man:/rsync"><citerefentry><refentrytitle>rsync</refentrytitle><manvolnum>1</manvolnum></citerefentry></ulink> alle angetroffenen Ordner und gibt darüber eine Nachricht aus. Sind beide Optionen <option>--dirs</option> und <option>--recursive</option> angegeben, hat sie Option <option>--recursive</option> Vorrang

source: Compress data during transfer
de: Daten bei Übertragung komprimieren

source: Compress file data during the transfer.
de: Die Daten werden bei der Übertragung komprimiert. Dies verringert deutlich die Menge an Daten, die übertragen werden müssen. Sie sollten diese Option eventuell benutzen, wenn Sie eine langsame Verbindung haben.

source: Links
de: Verknüpfungen

source: Preserve symlinks
de: Symbolische Verknüpfungen beibehalten

source: Copy symlinks as symlinks.
de: Kopiert symbolische Verknüpfungen als symbolische Verknüpfungen.

source: Transform symlinks
de: Symbolische Verknüpfungen umwandeln

source: When symlinks are encountered, the item that they point to is copied, rather than the symlink.
de: Wenn symbolische Verknüpfungen verarbeitet werden, wird das Ziel der Verknüpfung kopiert und nicht die symbolische Verknüpfung selbst.

source: Only transform unsafe symlinks
de: Nur unsichere symbolische Verknüpfungen umwandeln

source: Only transform "unsafe" symlinks. This means if a symlink is encountered that is pointing outside the copied tree, the referenced item is transferred rather than the symlink itself.
de: Wandelt nur unsichere symbolische Verknüpfungen um. D. h. wenn eine Verknüpfung aus dem kopierten Dateibaum herauszeigt, wird der referenzierte Eintrag und nicht die symbolische Verknüpfung selbst übertragen.

source: Ignore unsafe symlinks
de: Unsichere symbolische Verknüpfungen ignorieren

source: This tells <ulink url="man:/rsync"><citerefentry><refentrytitle>rsync</refentrytitle><manvolnum>1</manvolnum></citerefentry></ulink> to ignore any symbolic links which point outside the copied tree. All absolute symlinks are also ignored. Using this option in conjunction with <option>--relative</option> may give unexpected results.
de: Mit dieser Einstellung ignoriert <ulink url="man:/rsync"><citerefentry><refentrytitle>rsync</refentrytitle><manvolnum>1</manvolnum></citerefentry></ulink> alle symbolischen Verknüpfungen, die aus dem zu übertragenden Verzeichnisbaum herauszeigen. Alle symbolischen Verknüpfungen mit einer vollständigen Pfadangabe werden ebenfalls ignoriert. Falls Sie diese Option in Verbindung mit <option>--relative</option> nutzen, können eventuell unerwartete Ergebnisse auftreten.

source: Preserve hard links
de: Harte Verknüpfungen beibehalten

source: This tells <ulink url="man:/rsync"><citerefentry><refentrytitle>rsync</refentrytitle><manvolnum>1</manvolnum></citerefentry></ulink> to look for hard-linked files in the transfer and link together the corresponding files on the receiving side. Without this option, hard-linked files in the transfer are treated as though they were separate files.
de: Mit dieser Option sucht <ulink url="man:/rsync"><citerefentry><refentrytitle>rsync</refentrytitle><manvolnum>1</manvolnum></citerefentry></ulink> nach Dateien mit harten Verknüpfungen in der Übertragung und verknüpft die entsprechenden Dateien auf der Empfängerseite. Ohne diese Option werden Dateien mit harten Verknüpfungen in der Übertragung als getrennte Dateien behandelt.

source: Note that <ulink url="man:/rsync"><citerefentry><refentrytitle>rsync</refentrytitle><manvolnum>1</manvolnum></citerefentry></ulink> can only detect hard links if both parts of the link are in the list of files being sent.
de: Beachten Sie, dass <ulink url="man:/rsync"><citerefentry><refentrytitle>rsync</refentrytitle><manvolnum>1</manvolnum></citerefentry></ulink> Harte Verknüpfungen nur dann erkennen kann, wenn beide Bestandteile der Verknüpfung in der Liste der gesendeten Dateien enthalten sind.

source: Keep directory symlinks
de: Symbolische Verknüpfungen zu Ordnern beibehalten

source: This option causes the receiving side to treat a symlink to a directory as though it were a real directory, but only if it matches a real directory from the sender. Without this option, the receiver's symlink would be deleted and replaced with a real directory.
de: Mit dieser Option werden symbolische Verknüpfungen zu einem Ordner auf der Empfängerseite als tatsächliche Ordner behandelt, aber nur, wenn einem realen Ordner auf der Senderseite entspricht. Ohne diese Option werden symbolische Verknüpfungen beim Empfänger gelöscht und mit einem wirklichen Ordner ersetzt.

source: File Permissions, &etc;
de: Zugriffsrechte, etc.

source: Preserve permissions
de: Zugriffsrechte beibehalten

source: This option causes the receiving side to set the destination permissions to be the same as the source permissions.
de: Mit dieser Option werden auf der Empfängerseite die gleichen Berechtigungen wie auf der Senderseite verwendet.

source: Preserve group
de: Gruppe beibehalten

source: This option causes <ulink url="man:/rsync"><citerefentry><refentrytitle>rsync</refentrytitle><manvolnum>1</manvolnum></citerefentry></ulink> to set the group of the destination file to be the same as the on of the source file. If the receiving program is not running as the super-user (or with the <option>--no-super</option> option), only groups that the receiver is a member of will be preserved.
de: Mit dieser Option setzt <ulink url="man:/rsync"><citerefentry><refentrytitle>rsync</refentrytitle><manvolnum>1</manvolnum></citerefentry></ulink> die Zieldateien auf die gleiche Gruppe wie die Quelldateien. Wird das Programm auf der Empfängerseite nicht als Systemverwalter oder mit der <option>--no-super</option> ausgeführt, bleiben nur die Gruppen erhalten, in denen der Empfänger Mitglied ist.

source: Preserve owner
de: Eigentümer beibehalten
