Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/extragear-network/smb4k.po
Languages: de

source: Screenshot of the warning dialog that is shown when a foreign share is to be unmounted
de: Bildschirmfoto des Warndialogs, wenn die Einbindung einer fremden Freigabe gelöst werden soll

source: The warning dialog that is shown when unmounting foreign shares
de: Der Warndialog, der angezeigt wird, wenn die Einbindung einer fremden Freigabe gelöst werden soll

source: If you click the <guibutton>Yes</guibutton> button, the share will definitely be unmounted. So, please think twice before you decide to unmount shares that are owned by other users!
de: Wenn Sie auf den Knopf <guibutton>Ja</guibutton> klicken, wird die Einbindung der Freigabe definitiv gelöst. Beachten Sie dies, wenn Sie Freigaben anderer Benutzer lösen.

source: Inaccessible shares are unmounted with a "normal" unmount by default. If this should fail, you can <link linkend="configuration_shares">configure</link> &smb4k; so as to perform a <ulink url="man:/umount">lazy unmount</ulink> on inaccessible shares (&Linux; only).
de: Die Einbindung nicht erreichbarer Freigaben wird wie bei „normalen” Freigaben gelöst. Wenn dies fehlschlägt, können Sie &smb4k; unter &Linux; so <link linkend="configuration_shares">einrichten</link>, dass ein <ulink url="man:/umount">lazy unmount</ulink> ausgeführt wird.

source: All shares can be unmounted at once by clicking the <menuchoice><shortcut><keycombo action="simul">&Ctrl; <keycap>N</keycap></keycombo></shortcut><guimenuitem>Unmount All</guimenuitem></menuchoice> action. Depending on your settings, this will also unmount foreign and inaccessible shares.
de: Die Einbindung aller Freigaben kann sofort mit der Aktion <menuchoice><shortcut><keycombo action="simul">&Ctrl; <keycap>N</keycap></keycombo></shortcut><guimenuitem>Alle Einbindungen lösen</guimenuitem></menuchoice> gelöst werden. Abhängig von Ihren Einstellungen werden damit auch entfernte und nicht erreichbare Freigaben gelöst.

source: After a successful unmount process, the user is notified. You can switch off this kind of purely informatory notifications in the <link linkend="configuration_user_interface_general_notifications">configuration dialog</link>. If unmounting fails, a notification with the returned error message will be shown.
de: Nach dem erfolgreichen Lösen einer Einbindung erhält der Benutzer eine Benachrichtigung.Die Anzeige dieser nur informativen Benachrichtigungen über das Einbinden kann im <link linkend="configuration_user_interface_general_notifications">Einrichtungsdialog</link> abgeschaltet werden. Bei einem Fehler wird auf jeden Fall eine Benachrichtigung mit der zurückgegebenen Fehlermeldung angezeigt.

source: Synchronization
de: Abgleichen

source: The <menuchoice><shortcut><keycombo action="simul">&Ctrl;<keycap>Y</keycap></keycombo></shortcut><guimenuitem>Synchronize</guimenuitem></menuchoice> menu item opens the synchronization dialog. It offers you the mount point of the share as source and a path below the <link linkend="configuration_sync_copying_defdest">synchronization prefix</link> as destination. To update the data on the share, you can swap the destination with the source by clicking the <guibutton>Swap Paths</guibutton> button.
de: Mit dem Menüeintrag <menuchoice><shortcut><keycombo action="simul">&Ctrl;<keycap>Y</keycap></keycombo></shortcut><guimenuitem>Abgleichen</guimenuitem></menuchoice> öffnen Sie einen Dialog. Darin ist der Mount-Punkt der Freigabe als Quelle und darunter ein Pfad des <link linkend="configuration_sync_copying_defdest">Basisordner für den Abgleich</link> als Ziel eingetragen. Um Daten auf der Freigabe zu aktualisieren, können Sie auf den Knopf <guibutton>Pfade vertauschen</guibutton> drücken und damit Quelle und Ziel austauschen.

source: Screenshot of the synchronization input dialog
de: Bildschirmfoto des Eingabedialogs für den Abgleich

source: &URL; requester for sync'ing
de: &URL;-Anforderung für den Abgleich

source: Clicking the <guibutton>Synchronize</guibutton> button starts the synchronization. By left clicking on the <guibutton>Notifications</guibutton> button in the system tray, a progress dialog can be opened that shows some details about the transfer.
de: Klicken Sie auf <guibutton>Abgleichen</guibutton>, um den Vorgang zu starten. Klicken Sie auf das Symbol <guibutton>Benachrichtigungen</guibutton> im Systemabschnitt der Kontrollleiste, dann wird ein Fortschrittsdialog mit Informationen zur Übertragung geöffnet.

source: Screenshot of the synchronization progress dialog
de: Bildschirmfoto des Fortschrittsdialogs beim Abgleichen

source: Progress dialog
de: Fortschrittsdialog

source: In the default, collapsed version it displays the source and destination of the file that is currently transferred, the transfer rate and the overall progress. More information like the number of transferred files and a graphical representation of the transfer rate can be seen by clicking the <guibutton>More</guibutton> button on the left below to the progress bar.
de: In der kompakten Standardansicht werden Quelle und Ziel der gerade übertragenen Datei, die Übertragungsrate und der gesamte Fortschritt angezeigt. Weitere Informationen wie die Zahl der übertragenen Dateien und eine grafische Darstellung der Übertragungsrate sehen Sie, wenn Sie auf den Knopf <guibutton>Mehr</guibutton> links unten im Fortschrittsdialog klicken.

source: The synchronization can be paused or canceled at any time by pressing the pause or stop button to the right of the progress bar.
de: Der Abgleich kann jederzeit mit den entsprechenden Knöpfen rechts in der Fortschrittsanzeige angehalten oder abgebrochen werden.

source: The total number of files that is shown in the progress dialog corresponds to the number of files present on the share and not necessarily to the total number of files that will actually be transferred.
de: Die gesamte Anzahl der Dateien, die im Fortschrittsdialog erscheint, entspricht der gesamten Anzahl der vorhandenen Dateien auf der Freigabe und nicht zwingend der gesamten Anzahl aller Dateien, die tatsächlich übertragen werden.

source: The progress is calculated from the number of transferred files devided by the total number of files present on the share. Their size is not considered. That means that one very large file adds to the progress as much as a very small one does. Also, due to the way <application>rsync</application> displays the transfer progress, the progress bar is only updated after the transfer of the file.
de: Der Fortschritt wird aus der Anzahl der bereits übertragenen Dateien geteilt durch die gesamte Anzahl der vorhandenen Dateien auf der Freigabe berechnet. Die Größe der Dateien wird dabei nicht berücksichtigt, daher trägt eine riesig große Datei genau soviel zur Berechnung des Fortschritts bei wie eine sehr kleine Datei. Außerdem wird die Fortschrittsanzeige wegen der Funktionsweise <application>rsync</application> nur nach der Übertragung einer Datei aktualisiert.

source: Opening a Share
de: Öffnen einer Freigabe

source: &smb4k; provides two possibilities to open a mounted share:
de: &smb4k; bietet zwei Möglichkeiten, eine eingebundene Freigabe zu öffnen:

source: Open a share with &konsole;
de: Öffnen einer Freigabe mit &konsole;

source: You can open the mounted share in &konsole; by selecting the <menuchoice><shortcut><keycombo action="simul">&Ctrl;<keycap>L</keycap></keycombo></shortcut><guimenuitem>Open with Konsole</guimenuitem></menuchoice> action. This is useful if you need to run shell scripts on the share or similar.
de: Sie können die eingebundene Freigabe in &konsole; öffnen, indem Sie die Aktion <menuchoice><shortcut><keycombo action="simul">&Ctrl;<keycap>L</keycap></keycombo></shortcut><guimenuitem>Mit Konsole öffnen</guimenuitem></menuchoice> wählen. Dies ist nützlich um zum Beispiel Shell-Skripte auf Freigaben auszuführen.

source: Open a share with the default file manager
de: Öffnen einer Freigabe im Standard-Dateiverwaltungsprogramm

source: You can open the share in the default file manager (&eg; &dolphin;) by clicking the share icon or selecting the <menuchoice><shortcut><keycombo action="simul">&Ctrl;<keycap>I</keycap></keycombo></shortcut><guimenuitem>Open with File Manager</guimenuitem></menuchoice> action.
de: Sie können die Freigabe im Standard-Dateiverwaltungsprogramm (&eg; &dolphin;) öffnen, indem Sie auf das Freigabesymbol klicken oder die Aktion <menuchoice><shortcut><keycombo action="simul">&Ctrl;<keycap>I</keycap></keycombo></shortcut><guimenuitem>Mit Dateiverwaltung öffnen</guimenuitem></menuchoice> wählen.

source: If a share is marked as inaccessible, it cannot be opened.
de: Ist eine Freigabe als nicht erreichbar markiert, dann kann sie nicht geöffnet werden.

source: Handling Bookmarks
de: Lesezeichen verwalten

source: You can add bookmarks to your favorite shares from within the <link linkend="network_neighborhood_browser">network neighborhood browser</link>, the <link linkend="mounted_shares_view">shares view</link> and the <link linkend="plasmoid">plasmoid</link>. In the dock widgets of the main window, this is done by selecting one or multiple shares and clicking the <menuchoice><guimenuitem>Add Bookmark</guimenuitem></menuchoice> action. In the plasmoid, you click the respective bookmark action next to the item's name. A dialog will then pop up where you can add a label and/or assign a group to the bookmark.
de: Sie können Lesezeichen für Ihre bevorzugten Freigaben in der <link linkend="network_neighborhood_browser">Netzwerkumgebung</link>, der <link linkend="mounted_shares_view">Freigabenansicht</link> und im <link linkend="plasmoid">Plasmoid</link> anlegen. In den Unterfenstern des Hauptfensters wählen Sie dazu eine oder mehrere Freigaben aus und klicken auf die Aktion <menuchoice><guimenuitem>Lesezeichen hinzufügen</guimenuitem></menuchoice>. Im Plasmoid klicken Sie auf die entsprechende Lesezeichenaktion neben dem Namen des Eintrags. Dann wird ein Dialog geöffnet, in dem Sie eine Beschreibung hinzufügen oder das Lesezeichen einer Gruppe zuweisen.

source: Screenshot of the bookmarks addition dialog
de: Bildschirmfoto des Dialog „Lesezeichen hinzufügen“

source: Bookmarks addition dialog
de: Dialog „Lesezeichen hinzufügen“

source: Especially adding a group may help you to organize the bookmarks. In the bookmark menu, all bookmarks belonging to one group will be arranged in a submenu with the group entry as parent (see <link linkend="mainwindow_bookmarks_menu">below</link>).
de: Besonders durch Hinzufügen von Gruppen können Sie Ihre Lesezeichen besser organisieren. Im Lesezeichenmenü werden alle Lesezeichen in einer Gruppe als Untermenü angezeigt, siehe auch weiter <link linkend="mainwindow_bookmarks_menu">unten</link>.

source: The label can be any text describing the share. In case you define a label, it will be displayed in the bookmarks menu instead of the UNC by default. If you want to change this behavior, you can do so in the <link linkend="configuration_user_interface_general_bookmarks">configuration dialog</link>.
de: Als Beschriftung kann ein beliebiger Text zur Beschreibung der Freigabe benutzt werden. Diese Beschriftung wird anstelle des UNC wie in der Voreinstellung im Lesezeichenmenü angezeigt. Dieses Verhalten können Sie im <link linkend="configuration_user_interface_general_bookmarks">Einrichtungsdialog</link> ändern.

source: Accessing and Managing Bookmarks
de: Zugriff und Verwaltung von Lesezeichen

source: In the main window, the bookmarks can be accessed and managed through the <guilabel>Bookmarks</guilabel> menu:
de: Im Hauptfenster ist der Zugriff und die Bearbeitung von Lesezeichen im Menü <guilabel>Lesezeichen</guilabel> möglich.

source: Screenshot of the bookmark popup menu
de: Bildschirmfoto des Lesezeichen-Kontextmenüs

source: Bookmark popup menu
de: Lesezeichen-Kontextmenü

source: In the menu there are two static items available:
de: Im Menü sind zwei statische Einträge vorhanden:

source: Edit Bookmarks
de: Lesezeichen bearbeiten

source: Open the <link linkend="mainwindow_bookmarks_editor">bookmark editor</link>. This action is disabled if there are no bookmarks.
de: Öffnet den <link linkend="mainwindow_bookmarks_editor">Lesezeichen-Editor</link>. Diese Aktion ist deaktiviert, wenn keine Lesezeichen gesetzt sind.

source: <shortcut><keycombo action="simul">&Ctrl; <keycap>B</keycap></keycombo></shortcut> <guimenuitem>Add Bookmark</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>B</keycap></keycombo> </shortcut> <guimenuitem>Lesezeichen hinzufügen</guimenuitem>

source: Add a bookmark. A share has to be selected to enable this action.
de: Fügt ein Lesezeichen hinzu. Diese Aktion ist dann aktiviert, wenn eine Freigabe ausgewählt ist.

source: In case you have not defined any groups, there is a third item:
de: Wenn Sie noch keine Gruppen definiert haben, gibt es einen dritten Eintrag:

source: Mount All Bookmarks
de: Alle Lesezeichen einbinden

source: Mount all top-level bookmarks at once. It is disabled if all bookmarked shares are mounted.
de: Bindet all Lesezeichen der obersten Ebene auf einmal ein. Dies ist deaktiviert, wenn bereits alle Freigaben mit Lesezeichen eingebunden sind.

source: All other entries are either group submenus or shares that do not belong to a group. All entries are listed alphabetically and the bookmarks may either appear with their UNC address or descriptive label. By clicking a bookmark, the respective share is mounted. If a bookmarked share is mounted on the system, the bookmark entry is disabled.
de: Alle anderen Einträge sind entweder Untermenügruppen oder Freigaben, die nicht zu einer Gruppe gehören. Alle Einträge werden in alphabetischer Reihenfolge angezeigt und die Lesezeichen können entweder mit der UNC-Adresse oder als Beschreibung angezeigt werden. Durch Klicken auf ein Lesezeichen wird die zugehörige Freigabe eingebunden. Ist eine Freigabe mit einem Lesezeichen auf dem System eingebunden, ist der Lesezeicheneintrag deaktiviert.

source: For each group there is a submenu. It contains all bookmarks belonging to the group and a <guimenuitem>Mount All Bookmarks</guimenuitem> menu item. The latter one can be used to mount all bookmarks in that submenu at once.
de: Für jede Gruppe gibt es ein Untermenü. Es enthält alle Lesezeichen der Gruppe und einen Menüeintrag <guimenuitem>Alle Lesezeichen einbinden</guimenuitem>. Die letzte Aktion kann dazu verwendet werden, um alle Lesezeichen in dem Untermenü auf einmal einzubinden.

source: The plasmoid provides a <link linkend="plasmoid_bookmarks"><guilabel>Bookmarks</guilabel> tab</link> where all bookmarks are arranged in a similar way as in the bookmark menu. The bookmark groups and the bookmarks are listed in the view. Bookmarked shares can be mounted by clicking the respective entry. In the tool bar two actions are present: <guimenuitem>Back</guimenuitem> and <guimenuitem>Edit</guimenuitem>. By clicking <guimenuitem>Back</guimenuitem> you can get back to the top level if you entered a group folder. The <guimenuitem>Edit</guimenuitem> action will open the <link linkend="mainwindow_bookmarks_editor">bookmark editor</link>.
de: Im Plasmoid gibt es eine Karteikarte <link linkend="plasmoid_bookmarks">Lesezeichen</link>, in der alle Lesezeichen ähnlich wie im Lesezeichenmenü angeordnet sind. Die Lesezeichengruppen und Lesezeichen erscheinen in einer Liste in der Ansicht. Freigaben mit Lesezeichen können durch Klicken auf den entsprechenden Eintrag eingebunden werden. In der Werkzeugleiste sind zwei Aktionen vorhanden: <guimenuitem>Zurück</guimenuitem> und <guimenuitem>Bearbeiten</guimenuitem>. Durch Klicken auf <guimenuitem>Zurück</guimenuitem> gehen Sie eine Ebene hoch, wenn Sie einen Gruppenordner betreten haben. Die Aktion <guimenuitem>Bearbeiten</guimenuitem> öffnen Sie die <link linkend="mainwindow_bookmarks_editor">Lesezeichen-Editor</link>.

source: Editing Bookmarks
de: Lesezeichen bearbeiten

source: The bookmarks may be edited or removed via the bookmark editor. It can be opened by clicking the <guimenuitem>Edit Bookmarks</guimenuitem> action in the main window or the <guimenuitem>Edit</guimenuitem> action in the <guilabel>Bookmarks</guilabel> tab of the plasmoid.
de: Die Lesezeichen können im Lesezeichen-Editor bearbeitet oder entfernt werden. Um den Editor zu öffnen, klicken Sie auf die Aktion <guimenuitem>Lesezeichen bearbeiten</guimenuitem> im Hauptfenster oder auf die Aktion <guimenuitem>Bearbeiten</guimenuitem> in der Karteikarte <guilabel>Lesezeichen</guilabel> des Plasmoids.

source: Screenshot of the bookmark editor
de: Bildschirmfoto des Lesezeichen-Editors

source: Bookmark editor
de: Lesezeichen-Editor

source: In the tree view the bookmarks are arranged according to the groups they belong to. Bookmarks without groups are located at the top level. To rearrange bookmarks, the tree view offers drag and drop capabilities, so that you can move bookmarks around using the mouse.
de: In der Baumansicht werden die Lesezeichen in den entsprechenden Gruppen angeordnet. Lesezeichen ohne Gruppe werden in der obersten Ebene angezeigt, Um Lesezeichen neu anzuordnen, können Sie Einträge in der Baumansicht ziehen und ablegen, so können Sie Lesezeichen mit der Maus verschieben.

source: If you want to edit a bookmark, you can do so by selecting it. The stored label, login, IP address and group name appear in the input widgets and become editable. In most cases, you do not need to touch the IP address and the login, because &smb4k; stored the correct values at the time you bookmarked the share. However, if the server got a different IP address (&eg; because DHCP is used on your local network) or your login changed, these entries should be adjusted. With the label you can give each bookmark a custom description. It will be used <emphasis>instead</emphasis> of the UNC address in the case this feature is enabled in the <link linkend="configuration_user_interface_general_bookmarks">configuration dialog</link>. The group entry, finally, helps you to organize your bookmarks. Especially if you use &eg; your notebook at home and at work, it might be a good idea to create two groups "Home" and "Work" and save the bookmarks accordingly.
de: Möchten Sie ein Lesezeichen bearbeiten, wählen Sie es zuerst aus. Die gespeicherte Bezeichnung, Anmeldung, IP-Adresse und der Gruppenname erscheinen im Eingabedialog und können bearbeitet werden. In den meisten Fällen können Sie die IP-Adresse und die Anmeldung unverändert lassen, da &smb4k; die richtigen Datei beim Anlegen des Lesezeichens für die Freigabe gespeichert hat. Wenn der Server jedoch eine andere IP-Adresse erhalten hat, &eg; weil DHCP in Ihrem lokalen Netzwerk benutzt wird, oder wenn Ihre Anmeldedaten geändert wurden, müssen Sie diese Werte anpassen. Mit der Bezeichnung können Sie jeder Freigabe einen aussagekräftigen Namen geben. Dieser wird dann <emphasis>anstatt</emphasis> der UNC-Adresse verwendet, wenn diese Funktion im <link linkend="configuration_user_interface_general_bookmarks">Einrichtungsdialog</link> aktiviert wurde. Mit den Gruppeneinträgen können Sie Ihre Lesezeichen besser organisieren. Wenn Sie Ihr Notebook &eg; zu Hause und auf der Arbeit benutzen, können Sie die beiden Gruppen „Zuhause“ und „Arbeit“ erstellen und die Lesezeichen entsprechend speichern.

source: The tree view also offers a popup menu containing the following three actions. They can be used to add groups or remove groups and/or bookmarks.
de: In der Baumansicht gibt es auch ein Kontextmenü mit Aktionen zum Hinzufügen oder Entfernen von Gruppen oder Lesezeichen.

source: Screenshot of the popup menu of the bookmark editor
de: Bildschirmfoto des Kontextmenüs des Lesezeichen-Editors

source: Popup menu of the bookmark editor
de: Kontextmenü des Lesezeichen-Editors

source: Add Group
de: Gruppe hinzufügen

source: Add a bookmark group. After you created a group, you can move bookmarks to it.
de: Fügt eine Lesezeichengruppe hinzu. Wenn Sie eine Gruppe erstellt haben, können Lesezeichen in die Gruppe verschoben werden.

source: Remove
de: Entfernen

source: Remove a selected bookmark. This action is disabled if no bookmark is selected.
de: Entfernt ein ausgewähltes Lesezeichen. Diese Aktion ist deaktiviert, wenn kein Lesezeichen ausgewählt ist.

source: Clear Bookmarks
de: Lesezeichen löschen

source: Remove all bookmarks from the tree view including all groups.
de: Entfernt alle Lesezeichen und alle Gruppen von der Baumansicht.

source: After you finished editing, the changes can be committed by clicking the <guibutton>OK</guibutton> button.
de: Haben Sie die Bearbeitung beendet, können die Änderungen durch Klicken auf den Knopf <guibutton>OK</guibutton> übernommen werden.

source: The System Tray Widget
de: Das Symbol im Systemabschnitt der Kontrollleiste

source: Location and Usage
de: Position und Benutzung

source: When &smb4k; is started, an icon appears in your system tray.
de: Wenn &smb4k; gestartet ist, wird im Systemabschnitt der Kontrollleiste ein Symbol angezeigt.

source: Screenshot of the system tray widget
de: Bildschirmfoto des Symbols im Systemabschnitt der Kontrollleiste

source: <phrase>System tray widget</phrase>
de: <phrase>Symbol im Systemabschnitt der Kontrollleiste</phrase>

source: By left clicking the icon, you can minimize or restore the main window. A right click brings up a popup menu that contains several menu items allowing you to work with the mounted shares, manage or mount your bookmarks and to configure &smb4k; without the need to open the main window.
de: Durch Klicken mit der &LMBn; können Sie das Hauptfenster minimieren und wiederherstellen. Klicken mit der &RMBn; öffnet ein Kontextmenü mit mehreren Aktionen für eingebundene Freigaben, zur Verwaltung und Einbindung von Lesezeichen und zur Einrichtung von &smb4k;, ohne dass Hauptfenster wiederherzustellen.

source: Menus and Menu Items
de: Menüs und Menüeinträge

source: The <guimenuitem>Mounted Shares</guimenuitem> menu lists all mounted shares and some actions that can be performed on them.
de: Das Menü <guimenuitem>Eingebundene Freigaben</guimenuitem> enthält alle eingebundenen Freigaben und Aktionen, die damit ausgeführt werden können.

source: Screenshot 1 of the popup menu of the system tray icon
de: Bildschirmfoto des Kontextmenüs des Symbols im Systemabschnitt der Kontrollleiste

source: System tray icon's popup menu 1
de: Kontextmenü des Symbols im Systemabschnitt der Kontrollleiste

source: Unmount All
de: Alle Einbindungen lösen

source: Unmount all shares at once. Depending on your <link linkend="configuration_shares_mounting">settings</link>, &smb4k; attempts to unmount either only those shares that are owned by you or all that are listed.
de: Löst die Einbindung aller Freigaben auf einmal. Abhängig von Ihren <link linkend="configuration_shares_mounting">Einstellungen</link> versuch &smb4k; nur Ihre eigenen oder alle angezeigten Freigaben zu lösen.

source: For each mounted share you can open a submenu that contains the following entries. For further information read <link linkend="mounted_shares_view_menu">here</link>.
de: Für jede eingebundene Freigabe kann ein Untermenü mit den folgenden Einträgen geöffnet werden. Weitere Informationen dazu finden Sie <link linkend="mounted_shares_view_menu">hier</link>.

source: Unmount
de: Einbindung lösen

source: Unmount the share.
de: Löst die Einbindung der Freigabe.

source: <para>Add the selected share to the bookmarks.</para>
de: <para>Fügt die ausgewählte Freigabe zu den Lesezeichen hinzu.</para>

source: Synchronize
de: Abgleichen
