Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/extragear-network/smb4k.po
Languages: de

source: <shortcut> <keycombo action="simul"> &Ctrl; <keycap>A</keycap> </keycombo> </shortcut> <guimenu>Search</guimenu> <guimenuitem>Abort</guimenuitem>
de: <shortcut> <keycombo action="simul"> &Ctrl; <keycap>A</keycap> </keycombo> </shortcut> <guimenu>Suchen</guimenu> <guimenuitem>Abbrechen</guimenuitem>

source: Abort the network search.
de: Bricht die Netzwerksuche ab.

source: <guimenu>Search</guimenu> <guimenuitem>Clear</guimenuitem>
de: <guimenu>Suchen</guimenu> <guimenuitem>Leeren</guimenuitem>

source: Clear the network search widget, &ie; the combo box, the history and the list view.
de: Löscht alle Felder im Unterfenster „Netzwerksuche“, &ie; das Kombinationsfeld, den Verlauf und die Listenansicht.

source: <shortcut> <keycombo action="simul"> &Ctrl; <keycap>D</keycap> </keycombo> </shortcut> <guimenu>Search</guimenu> <guimenuitem>Mount</guimenuitem>
de: <shortcut> <keycombo action="simul"> &Ctrl; <keycap>D</keycap> </keycombo> </shortcut> <guimenu>Suchen</guimenu> <guimenuitem>Einbinden</guimenuitem>

source: Mount the selected share.
de: Bindet die ausgewählte Freigabe ein.

source: The Shares Menu
de: Das Menü Freigaben

source: <shortcut> <keycombo action="simul"> &Ctrl; <keycap>U</keycap> </keycombo> </shortcut> <guimenu>Shares</guimenu> <guimenuitem>Unmount</guimenuitem>
de: <shortcut> <keycombo action="simul"> &Ctrl; <keycap>U</keycap> </keycombo> </shortcut> <guimenu>Freigaben</guimenu> <guimenuitem>Einbindung lösen</guimenuitem>

source: Unmount the selected share.
de: Löst die Einbindung der ausgewählten Freigabe.

source: <shortcut> <keycombo action="simul"> &Ctrl; <keycap>N</keycap> </keycombo> </shortcut> <guimenu>Shares</guimenu> <guimenuitem>Unmount All</guimenuitem>
de: <shortcut> <keycombo action="simul"> &Ctrl; <keycap>N</keycap> </keycombo> </shortcut> <guimenu>Freigaben</guimenu> <guimenuitem>Alle Einbindungen lösen</guimenuitem>

source: Unmount all of the mounted shares at once. In the default configuration this is restricted to the user's shares, but this can be altered in the <link linkend="configuration_shares_mounting">configuration dialog</link>. For further information read the <link linkend="mainwindow_shares_unmounting">Unmounting Shares</link> section.
de: Löst sofort alle eingebundenen Freigaben. In der Voreinstellung ist das nur für eigene Freigaben möglich. Im <link linkend="configuration_shares_mounting">Einrichtungsdialog</link> kann das geändert werden. Weitere Informationen dazu finden Sie im Abschnitt <link linkend="mainwindow_shares_unmounting">Freigaben lösen</link>.

source: <shortcut> <keycombo action="simul"> &Ctrl; <keycap>Y</keycap> </keycombo> </shortcut> <guimenu>Shares</guimenu> <guimenuitem>Synchronize</guimenuitem>
de: <shortcut> <keycombo action="simul"> &Ctrl; <keycap>Y</keycap> </keycombo> </shortcut> <guimenu>Freigaben</guimenu> <guimenuitem>Abgleichen</guimenuitem>

source: Initiate a synchronization.
de: Startet einen Abgleich.

source: <shortcut> <keycombo action="simul"> &Ctrl; <keycap>L</keycap> </keycombo> </shortcut> <guimenu>Shares</guimenu> <guimenuitem>Open with Konsole</guimenuitem>
de: <shortcut> <keycombo action="simul"> &Ctrl; <keycap>L</keycap> </keycombo> </shortcut> <guimenu>Freigaben</guimenu> <guimenuitem>Mit Konsole öffnen</guimenuitem>

source: Open the base folder of the selected share in &konsole;.
de: Öffnet den Basisordner der ausgewählten Freigabe in &konsole;.

source: <shortcut> <keycombo action="simul"> &Ctrl; <keycap>I</keycap> </keycombo> </shortcut> <guimenu>Shares</guimenu> <guimenuitem>Open with File Manager</guimenuitem>
de: <shortcut> <keycombo action="simul"> &Ctrl; <keycap>I</keycap> </keycombo> </shortcut> <guimenu>Freigaben</guimenu> <guimenuitem>Mit Dateiverwaltung öffnen</guimenuitem>

source: Open the contents of the selected share in the default file manager (&eg; &dolphin;).
de: Öffnet den Inhalt der ausgewählten Freigabe im Standard-Dateiverwaltungsprogramm (&eg; &dolphin;).

source: The Bookmarks Menu
de: Das Menü Lesezeichen

source: <guimenu>Bookmarks</guimenu> <guimenuitem>Edit Bookmarks</guimenuitem>
de: <guimenu>Lesezeichen</guimenu> <guimenuitem>Lesezeichen bearbeiten</guimenuitem>

source: Open the bookmark editor.
de: Öffnet den Lesezeichen-Editor.

source: <shortcut> <keycombo action="simul"> &Ctrl; <keycap>B</keycap> </keycombo> </shortcut> <guimenu>Bookmarks</guimenu> <guimenuitem>Add Bookmark</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>B</keycap></keycombo> </shortcut> <guimenu>Lesezeichen</guimenu> <guimenuitem>Lesezeichen hinzufügen</guimenuitem>

source: <action>Add the selected share to the bookmarks.</action>
de: <action>Fügt die ausgewählte Freigabe zu den Lesezeichen hinzu.</action>

source: The Settings Menu
de: Das Menü Einstellungen

source: <guimenu>Settings</guimenu> <guimenuitem>Toolbars Shown</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guisubmenu>Angezeigte Werkzeugleisten</guisubmenu>

source: In this submenu you can enable or disable the toolbars.
de: In diesem Untermenü können Sie die Anzeige der Werkzeugleisten ein- und ausschalten.

source: <guimenu>Settings</guimenu> <guimenuitem>Show Statusbar</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>Statusleiste anzeigen</guimenuitem>

source: Hide or show the status bar.
de: Schaltet die Anzeige der Statusleiste ein- und aus.

source: <guimenu>Settings</guimenu> <guimenuitem>Dock Widgets</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>Andockfenster</guimenuitem>

source: Hide or show the dock widgets in the main window.
de: Schaltet die Anzeige der Andockfenster im Hauptfenster ein- und aus.

source: <guimenu>Settings</guimenu> <guimenuitem>Shares View</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>Freigabenansicht</guimenuitem>

source: Select between the shares icon and list view.
de: Ermöglicht die Auswahl von Symbol- oder Listenansicht der Freigaben.

source: <guimenu>Settings</guimenu> <guimenuitem>Configure &smb4k;...</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>&smb4k; einrichten ...</guimenuitem>

source: Open the configuration dialog.
de: Öffnet den Einrichtungsdialog.

source: The Help Menu
de: Das Menü Hilfe

source: Additionally &smb4k; has the common &kde; <guimenu>Help</guimenu> menu items, for more information read the section about the <ulink url="help:/fundamentals/ui.html#menus-help">Help Menu</ulink> of the &kde; Fundamentals.
de: Zusätzlich hat &smb4k; die bekannten &kde;-Einträge im Menü <guimenu>Hilfe</guimenu>, weitere Informationen dazu finden Sie im Abschnitt über das Menü <ulink url="help:/fundamentals/uihtml#menus-help">Hilfe</ulink> der &kde;-Grundlagen.

source: Reporting Bugs
de: Berichten von Fehlern

source: Before filing a bug report, please read our <ulink url="https://sourceforge.net/p/smb4k/wiki/Home/">wiki</ulink>. Many common problems are already covered there. Also, try the <ulink url="https://sourceforge.net/projects/smb4k/files/">latest version</ulink> of &smb4k;. Maybe your problem has already been fixed.
de: Bitte lesen Sie unser <ulink url="https://sourceforge.net/p/smb4k/wiki/Home/">Wiki</ulink>, bevor Sie einen Fehler berichten. Für viele häufig vorkommende Probleme finden Sie dort bereits Lösungen. Probieren Sie außerdem die <ulink url="https://sourceforge.net/projects/smb4k/files/">neuste Version</ulink> von &smb4k;aus, möglicherweise ist Ihr Fehler darin bereits behoben.

source: Follow these directions for your bug report:
de: Folgen Sie diesen Anweisungen für Ihren Fehlerbericht:

source: Describe <emphasis>in detail</emphasis> what you did to receive the problem you are reporting.
de: Beschreiben Sie <emphasis>genau</emphasis>, was Sie taten, als der Fehler auftrat.

source: Provide the version of &smb4k; and &kde;.
de: Nennen Sie die Version von &smb4k; und &kde;.

source: Mention your operating system (&Linux;, FreeBSD, &etc;) and the distribution that is running on your computer.
de: Nennen Sie Ihr Betriebssystem (&Linux;, FreeBSD, &etc;) und die verwendete Distribution auf Ihrem Rechner.

source: Include the full error message if an error dialog was displayed.
de: Fügen Sie die vollständigen Text der Fehlermeldung hinzu, wenn ein Fehlerdialog angezeigt wurde.

source: Add additional data, &ie; attach the backtrace if you experienced a crash, send a screen shot if you are reporting a &GUI; related problem, &etc;
de: Fügen Sie zusätzliche Daten an, &ie; eine Fehlerrückverfolgung bei einem Absturz, ein Bildschirmfoto wenn Sie Fehler zu einem Problem mit der &GUI; berichten &etc;

source: The recommended method to report a bug is to go to our <ulink url="https://sourceforge.net/p/smb4k/tickets/">bug tracking system</ulink> and fill out the form. But you can also use the dialog that opens when you click the <menuchoice><guimenu>Help</guimenu><guimenuitem>Report Bug...</guimenuitem></menuchoice> menu item.
de: Die empfohlene Methode zum Berichten von Fehlern ist es, zum <ulink url="https://sourceforge.net/p/smb4k/tickets/">Fehlerverfolgungssystem</ulink> zu gehen und das Formular auszufüllen. Sie können aber auch den Dialog verwenden, der mit dem Menüeintrag <menuchoice><guimenu>Hilfe</guimenu><guimenuitem>Probleme oder Wünsche berichten ...</guimenuitem></menuchoice> geöffnet wird.

source: Credits and License
de: Mitwirkende und Lizenz

source: CREDIT_FOR_TRANSLATORS
de: <para>Übersetzung Burkhard Lück<email>lueck@hube-lueck.de</email></para>

source: Developers
de: Entwickler

source: Translations
de: Übersetzungen

source: Translations were contributed by the &kde; translators.
de: Die Übersetzungen wurden durch das &kde;-Übersetzungsteam erstellt.

source: Special Thanks
de: Besonderen Dank an

source: The &smb4k; team would like to thank everyone who contributed by sending patches. Also, a big "Thank you!" goes to Rashid N. Achilov <email>shelton@sentry.granch.ru</email>, who convinced us to port &smb4k; to FreeBSD and helped us a great deal to achieve this goal.
de: Das &smb4k;-Team möchte allen danken, die durch das Einsenden von Fehlerkorrekturen geholfen haben. Außerdem geht ein großes Dankeschön an Rashid N. Achilov <email>shelton@sentry.granch.ru</email>, der uns überzeugte, &smb4k; auf FreeBSD zu portieren und uns viel dabei geholfen hat, das Ziel zu erreichen.

source: How to obtain &smb4k;
de: Bezugsquellen von &smb4k;

source: The latest stable release is available at <ulink url="http://sourceforge.net/projects/smb4k/files/">http://sourceforge.net/projects/smb4k/files/</ulink>.
de: Die neueste stabile Version des Programms finden Sie auf <ulink url="http://sourceforge.net/projects/smb4k/files/">http://sourceforge.net/projects/smb4k/files/</ulink>.

source: Requirements
de: Systemanforderungen

source: &smb4k; officially supports &Linux; (>= 2.2.x) and FreeBSD (>= 4.10). It might also run on other Unix systems.
de: &smb4k; unterstützt offiziell &Linux; (>= 2.2.x) und FreeBSD (>= 4.10). Möglicherweise läuft es auch auf anderen Unix-Systemen

source: If you want to compile &smb4k; from source, you need to have the kdelibs (including header files) and kdebase-runtime modules of the &kde; SC 4.4 or later installed. Additionally, &Qt; version 4.7 or later is required.
de: Möchten Sie &smb4k; aus dem Quelltext kompilieren, müssen Sie die Module kdelibs (einschließlich der Header-Dateien) und kdebase-runtime der &kde; SC Version 4.4 oder neuer installiert haben. Außerdem ist &Qt; in der Version 4.7 oder neuer erforderlich.

source: In order to use &smb4k; successfully, you have to install the Samba software suite (3.x, 3.4 or later recommended), &GNU; grep, &GNU; awk or similar, &GNU; sed and the &GNU; findutils. If you are using &Linux;, you also need support of the <filename class="directory">/proc</filename> file system compiled into your kernel.
de: Um &smb4k; erfolgreich einsetzen zu können, müssen Sie die Samba-Softwaresammlung, empfohlen in Version 3.x, 3.4 oder neuer). &GNU; grep, &GNU; awk oder ähnlich. &GNU; sed und the &GNU; findutils installieren. Benutzen Sie &Linux;, muss der Kernel mit Unterstützung für das <filename class="directory">/proc</filename>-Dateisystem kompiliert sein.

source: To enable full functionality, you should also install rsync.
de: Um alle Funktionen benutzen zu können, sollten Sie außerdem noch rsync installieren.

source: &smb4k; uses about 20 MB of memory to run, but this may vary depending on your platform and configuration.
de: &smb4k; benötigt zur Laufzeit etwa 20 MB Arbeitsspeicher. Diese Anforderungen können allerdings abhängig von der Plattform und Konfiguration variieren.

source: Links to all required libraries and programs as well as &smb4k; itself can be found on <ulink url="http://smb4k.sourceforge.net">the &smb4k; home page</ulink>.
de: Verknüpfungen zu allen erforderlichen Bibliotheken wie auch zu &smb4k; selbst finden Sie auf der <ulink url="http://smb4k.sourceforge.net">&smb4k;-Projektseite</ulink>.

source: The list of changes can be found in the <filename>ChangeLog</filename> file.
de: Ein Liste von Änderungen finden Sie in der Datei <filename>ChangeLog</filename>.

source: Compilation and Installation
de: Kompilierung und Installation

source: This section describes the configuration, compilation and installation of &smb4k;.
de: In diesem Abschnitt wird die Konfiguration, die Kompilierung und Installation von &smb4k; beschrieben.

source: Unpack the downloaded source tarball: <screen><prompt>$</prompt> <userinput><command>tar</command> -xvfj smb4k-x.x.x.tar.bz2</userinput></screen> (Replace x.x.x with the version number)
de: Entpacken Sie das heruntergeladene Quelltextarchiv: <screen><prompt>$</prompt> <userinput><command>tar</command> -xvfj smb4k-x.x.x.tar.bz2</userinput></screen> Ersetzen Sie dabei x.x.x durch die Versionsnummer.

source: Create a build directory: <screen><prompt>$</prompt> <userinput><command>cd</command> smb4k-x.x.x</userinput> <prompt>$</prompt> <userinput><command>mkdir</command> build</userinput> </screen> (The build directory can have any name you want.)
de: Erzeugen Sie einen Erstellungsordner: <screen><prompt>$</prompt> <userinput><command>cd</command> smb4k-x.x.x</userinput> <prompt>$</prompt> <userinput><command>mkdir</command> build</userinput> </screen> Der Ordner kann einen beliebigen Namen haben.

source: Change into the build directory:
de: Wechseln Sie in den Erstellungsordner:

source: Configure the source code with at least the following command: <screen><prompt>$</prompt> <userinput><command>cmake</command> -DCMAKE_INSTALL_PREFIX=`<command>kde4-config</command> --prefix` -DCMAKE_BUILD_TYPE=Release ..</userinput></screen> If you also want to install &smb4k;'s core header files, add the <option>-DINSTALL_HEADER_FILES=true</option> to the command line. Several more options can be added. Read the <ulink url="http://www.cmake.org/HTML/Documentation.html">cmake documentation</ulink> for more information.
de: Konfigurieren Sie den Quelltext mindestens mit dem folgenden Befehl:<screen><prompt>$</prompt> <userinput><command>cmake</command> -DCMAKE_INSTALL_PREFIX=`<command>kde4-config</command> --prefix` -DCMAKE_BUILD_TYPE=Release ..</userinput></screen> Möchten Sie auch die Header-Dateien von &smb4k; installieren, fügen Sie die Option <option>-DINSTALL_HEADER_FILES=true</option> zur Befehlszeile hinzu. Es können noch weitere Optionen verwendet werden. In der Dokumentation zu <ulink url="http://www.cmake.org/HTML/Documentation.html">CMake</ulink> finden Sie weitere Informationen.

source: Compile the source code:
de: Kompilieren des Quelltextes:

source: Install the application. Run <screen><prompt>$</prompt> <userinput><command>sudo</command> <command>make</command> install</userinput></screen> in the <filename class="directory">build</filename> directory. If you want to be able to remove &smb4k; with your package manager, install the <application>checkinstall</application> package and run <screen><prompt>$</prompt> <userinput><command>sudo</command> <command>checkinstall</command></userinput></screen> instead.
de: Installieren Sie dass Programm. Führen Sie <screen><prompt>$</prompt> <userinput><command>sudo</command> <command>make</command> install</userinput></screen> im Ordner <filename class="directory">build</filename> aus. Möchten sie &smb4k; mit Ihrer Paketverwaltung wieder entfernen können, installieren Sie das Paket <application>checkinstall</application> und führen statt dessen <screen><prompt>$</prompt> <userinput><command>sudo</command> <command>checkinstall</command></userinput></screen> aus.

source: Debugging the Source Code
de: Fehlersuche im Quelltext

source: If you experience crashes or similar and want to debug the source code yourself, compile it with debugging symbols. The procedure is similar to the one described in the <link linkend="appendix_compilation">Compilation and Installation</link> section except that you need to modify the cmake command slightly:
de: Gibt es bei Ihnen Abstürze oder Fehlfunktionen um möchten Sie den Quelltext selbst auf Fehler untersuchen, kompilieren Sie den Quelltext mit Debug-Symbolen. Das Verfahren ist ähnlich wie im Abschnitt <link linkend="appendix_compilation">Kompilierung und Installation</link> beschrieben, außer dass Sie den CMake-Befehl geringfügig ändern müssen:

source: Now compile and install the program as stated <link linkend="appendix_compilation">before</link>. If you do not want to install but only debug the newly compiled program, you may execute &smb4k; from within the source code directory. Change into the <filename role="directory">smb4k</filename> subdirectory and run:
de: Kompilieren und installieren Sie dann das Programm wie <link linkend="appendix_compilation">vorher</link> beschrieben. Möchten Sie das Programm nicht installieren, sondern nur Fehler suchen, können Sie &smb4k; aus dem Quelltext-Ordner starten. Wechseln Sie in den Unterordner <filename role="directory">smb4k</filename> und geben Sie ein:

source: If you found the cause for a bug, please let us know. A backtrace or a patch will be much appreciated.
de: Haben Sie die Ursache für einen Fehler gefunden, dann teilen Sie und das bitte mit. Wir freuen uns über eine Rückverfolgung oder einen Patch.
