Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/extragear-network/smb4k.po
Languages: de

source: A bookmark is added by selecting a remote share (only these can be bookmarked) and pressing the <keycombo action="simul">&Ctrl; <keycap>B</keycap></keycombo> keyboard shortcut or selecting the <guimenuitem>Add Bookmark</guimenuitem> menu item. The bookmark will then be accessible through the <guimenu>Bookmarks</guimenu> menu. See the section <link linkend="mainwindow_bookmarks">Handling Bookmarks</link> for more details.
de: Ein Lesezeichen kann zu einer entfernten Freigabe (nur entfernte Freigaben können ein Lesezeichen erhalten), indem Sie sie auswählen und dann den Kurzbefehl <keycombo action="simul">&Ctrl; <keycap>B</keycap></keycombo> drücken oder den Menüeintrag <guimenuitem>Lesezeichen hinzufügen</guimenuitem> auswählen. Das Lesezeichen wird dann in das Menü <guimenu>Lesezeichen</guimenu> eingefügt. Im Abschnitt <link linkend="mainwindow_bookmarks">Lesezeichen verwalten</link> finden Sie weitere Informationen.

source: The bookmarks can be used to mount remote shares.
de: Die Lesezeichen können verwendet werden, um entfernte Freigaben einzubinden.

source: The Network Search Dialog
de: Der Dialog Netzwerksuche

source: The <guilabel>Network Search</guilabel> dialog consists of the combo box where you can enter the search item and a list view where the search results are shown.
de: Der Dialog <guilabel>Netzwerksuche</guilabel> besteht aus einem Kombinationsfeld für die Eingabe eines Suchbegriffs und einer Listenansicht, in der die Ergebnisse gezeigt werden.

source: Screenshot of the network search dialog
de: Bildschirmfoto des Netzwerksuchdialogs

source: The network search dialog
de: Der Dialog Netzwerksuche

source: Searching
de: Suchen

source: &smb4k; searches the network neighborhood for shares that match or contain the search string. To start a search, enter the term and either press the &Enter; key or click the <menuchoice><shortcut><keycombo action="simul">&Ctrl;<keycap>S</keycap></keycombo></shortcut><guimenuitem>Search</guimenuitem></menuchoice> action next to the input box. All network shares that match the search criterion are listed in the list view. If they are already mounted on the system, they are marked accordingly. If the search fails, an error message is displayed. Starting a new search will clear the list view. If you need to abort a search, click the <menuchoice><shortcut><keycombo action="simul">&Ctrl;<keycap>A</keycap></keycombo></shortcut><guimenuitem>Abort</guimenuitem></menuchoice> action next to the <guimenuitem>Search</guimenuitem> action.
de: &smb4k; sucht in der Netzwerkumgebung nach Freigaben, deren Name mit dem Suchbegriff übereinstimmt oder den Suchbegriff enthält. Um die Suche zu starten, geben Sie einen Begriff ein und drücken die &Enter;taste oder klicken auf den Knopf <menuchoice><shortcut><keycombo action="simul">&Ctrl;<keycap>S</keycap></keycombo></shortcut><guimenuitem>Suchen</guimenuitem></menuchoice> neben dem Eingabefeld. Alle Freigaben im Netzwerk, auf die der Suchbegriff passt, werden dann in der ANsicht als Liste angezeigt. Sind Freigaben bereits eingebunden, werden Sie entsprechend markiert. Erbit die Suche kein Ergebnis, wird eine Fehlermeldung angezeigt. Durch den Start einer neuen Suche wird die Liste geleert. Möchten Sie eine Suche abbgrechen, klicken Sie auf den Knopf <menuchoice><shortcut><keycombo action="simul">&Ctrl;<keycap>A</keycap></keycombo></shortcut><guimenuitem>Abbrechen</guimenuitem></menuchoice> neben <guimenuitem>Suchen</guimenuitem>.

source: For the network search also several actions are defined. They are present in the menu bar under <guimenu>Search</guimenu>, the tool bar, in the widget itself and in its popup menu. The following ones are available:
de: Für die Netzwerksuche sind mehrere Aktionen definiert. Sie finden Sie in der Menüleiste unter <guimenu>Suchen</guimenu>, in der Werkzeugleiste und im Kontextmenü. Folgende Aktionen sind vorhanden:

source: <shortcut><keycombo action="simul">&Ctrl; <keycap>S</keycap></keycombo></shortcut> <guimenuitem>Search</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl; <keycap>S</keycap></keycombo></shortcut> <guimenuitem>Suchen</guimenuitem>

source: Search for the item that was entered in the search dialog. This action is visible by default and will be replaced by the <guimenuitem>Abort</guimenuitem> action if a network search is running.
de: Sucht nach einem Eintrag, der im Dialog eingegeben wurde. Diese Aktion wird in der Voreinstellung angezeigt und wird durch Aktion <guimenuitem>Abbruch</guimenuitem> ersetzt, wenn eine Suche im Netzwerk ausgeführt wird.

source: Abort the network search. This action is invisible by default and will only be visible instead of the <guimenuitem>Search</guimenuitem> action if a network search is running.
de: Bricht die Netzwerksuche ab. Diese Aktion wird in der Voreinstellung ausgeblendet und wird nur statt der Aktion <guimenuitem>Suchen</guimenuitem> angezeigt, wenn eine Netzwerksuche durchgeführt wird.

source: Clear
de: Leeren

source: Clear the whole network search dialog. This action does not only clear the list view, but also the search item history in the combo box.
de: Löscht alles im gesamten Netzwerksuchdialog. Mit dieser Aktion wird nicht nur die Listenansicht, sondern auch der Verlauf der Suche im Kombinationsfeld gelöscht.

source: Mount a remote share from within the search dialog. Alternatively, you can double click the network share in the list view.
de: Bindet eine entfernte Freigabe vom Suchdialog aus ein. Alternativ können Sie auf die Netzwerkfreigabe in der Listenansicht doppelklicken.

source: The popup menu contains two of the four actions. The <menuchoice><shortcut><keycombo action="simul">&Ctrl;<keycap>S</keycap></keycombo></shortcut><guimenuitem>Search</guimenuitem></menuchoice> and <menuchoice><shortcut><keycombo action="simul">&Ctrl; <keycap>A</keycap></keycombo></shortcut><guimenuitem>Abort</guimenuitem></menuchoice> dual action is located next to the search input box (as well as in the menu bar and tool bar).
de: Das Kontextmenü enthält zwei der vier Aktionen. Die beiden anderen Aktionen <menuchoice><shortcut><keycombo action="simul">&Ctrl;<keycap>S</keycap></keycombo></shortcut><guimenuitem>Suchen</guimenuitem></menuchoice> and <menuchoice><shortcut><keycombo action="simul">&Ctrl; <keycap>A</keycap></keycombo></shortcut><guimenuitem>Abbrechen</guimenuitem></menuchoice> finden Sie rechts neben dem Suchfeld und auch im Menü und der Werkzeugleiste.

source: Screenshot of the network search's popup menu
de: Bildschirmfoto des Kontextmenüs im Netzwerksuchdialog

source: The network search's popup menu
de: Das Kontextmenü im Netzwerksuchdialog

source: A discovered share can directly be mounted by either double clicking it or by selecting it and choosing the <menuchoice><shortcut><keycombo action="simul">&Ctrl; <keycap>D</keycap></keycombo></shortcut><guimenuitem>Mount</guimenuitem></menuchoice> action from the popup menu. Due to a shortcoming of the utility program that does the actual search (the <ulink url="man:/smbtree"><citerefentry><refentrytitle>smbtree</refentrytitle><manvolnum>1</manvolnum></citerefentry></ulink> command), &smb4k; cannot discriminate between printer and normal shares. Mounting a printer share will fail and an error notification will be shown.
de: Eine erkannte Freigabe kann durch Doppelklicken auf den Eintrag direkt eingebunden werden. Alternativ wählen Sie eine Freigabe aus und benutzen die Aktion <menuchoice><shortcut><keycombo action="simul">&Ctrl; <keycap>D</keycap></keycombo></shortcut><guimenuitem>Einbinden</guimenuitem></menuchoice> aus dem Kontextmenü. Wegen eines Fehlers im Dienstprogramm <ulink url="man:/smbtree"><citerefentry><refentrytitle>smbtree</refentrytitle><manvolnum>1</manvolnum></citerefentry></ulink>, das die Suche ausführt, kann &smb4k; nicht zwischen Druckern und normalen Freigaben unterscheiden. Das Einbinden einer Druckerfreigabe schlägt fehl und es wird eine Fehlermeldung angezeigt.

source: When mounting a homes share, you are asked to provide the user name and a share with that name is mounted. The homes share itself will, thus, not be labeled as mounted afterwards.
de: Bei der Einbindung von persönlichen Freigaben werden Sie nach dem Benutzernamen und dem Namen der einzubindenden Freigabe. Die persönlichen Freigabe selbst wird danach nicht als eingebunden gekennzeichnet.

source: The Mounted Shares View
de: Die Ansicht der eingebundenen Freigaben

source: In the shares view, you can interact with the mounted shares on your system.
de: In der Ansicht der Freigaben können Sie die eingebundenen Freigaben auf Ihrem System verwalten.

source: Different Views
de: Unterschiedliche Ansichten

source: &smb4k; comes with two alternative views: an icon and a list view. They are both shown below.
de: &smb4k; kann eingebundene Freigaben als Symbol- und alternativ als Listenansicht zeigen. Beide Ansichten werden weiter unten gezeigt.

source: The icon view:
de: Die Symbolansicht:

source: Screenshot of the shares icon view
de: Bildschirmfoto der Symbolansicht einer Freigabe

source: The shares icon view
de: Die Symbolansicht einer Freigabe

source: The list view:
de: Die Listenansicht:

source: Screenshot of the shares list view
de: Bildschirmfoto der Listenansicht einer Freigabe

source: The shares list view
de: Die Listenansicht einer Freigabe

source: The default view is the traditional icon view where the shares are displayed as icons along with their name or mount point. In the list view all shares are displayed with their name or mount point, the file system and the disk usage. More information can be included by adjusting the <link linkend="configuration_user_interface_shares_view">settings</link>.
de: Der Standard ist die traditionelle Symbolansicht, in der die Freigaben als Symbol zusammen mit ihrem Namen und Mount-Punkt angezeigt werden. In der Listenansicht werden alle Freigaben mit ihrem Namen oder Mount-Punkt, dem Dateisystem und der Speicherbelegung angezeigt. Weitere Informationen können durch Anpassung der <link linkend="configuration_user_interface_shares_view">Einstellungen</link> angezeigt werden.

source: You can switch between the two views by either selecting an entry from the <link linkend="mainwindow_overview"><guibutton>Shares View</guibutton></link> menu or by changing the settings in the <link linkend="configuration_user_interface_shares_view">configuration dialog</link>.
de: Sie können zwischen den beiden Ansichten wechseln, indem Sie einen Eintrag aus dem Menü <link linkend="mainwindow_overview"><guibutton>Freigabenansicht</guibutton></link> wählen oder dies im <link linkend="configuration_user_interface_shares_view">Einrichtungsdialog</link> ändern.

source: By default, you will only see your own mounts in the shares view. However, you can tell &smb4k; to show all mounts by altering the <link linkend="configuration_user_interface_shares_mounted_shares">respective settings</link>.
de: In der Voreinstellung sehen Sie nur Ihre eigenen eingebundenen Freigaben in der Ansicht. Dies können Sie jedoch ändern und alle Freigaben anzeigen lassen, indem Sie die <link linkend="configuration_user_interface_shares_mounted_shares">entsprechende Einstellung</link> ändern.

source: For the shares view several actions are defined. They are present in the menu bar under <guimenu>Shares</guimenu>, the tool bar and in its popup menu. The following ones are available:
de: Für die Freigabenansicht sind mehrere Aktionen definiert. Sie finden Sie in der Menüleiste unter <guimenu>Freigaben</guimenu>, in der Werkzeugleiste und im Kontextmenü. Folgende Aktionen sind vorhanden:

source: <shortcut><keycombo action="simul">&Ctrl; <keycap>U</keycap></keycombo></shortcut> <guimenuitem>Unmount</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>U</keycap> </keycombo> </shortcut> <guimenuitem>Einbindung lösen</guimenuitem>

source: Unmount one or multiple selected shares. The ability to unmount shares is by default restricted to the ones that are owned by you. However, you can change this behavior by changing the <link linkend="configuration_shares_mounting">settings</link> in the configuration dialog. If no share is selected in the shares view, this button is disabled.
de: Löst die Einbindung einer oder mehrere Freigaben. Die Möglichkeit zum Lösen von Einbindungen ist auf eigene Freigaben beschränkt. Dieses Verhalten kann jedoch im <link linkend="configuration_shares_mounting">Einrichtungsdialog</link> geändert werden. Ist keine Freigabe ausgewählt, ist dieser Knopf deaktiviert.

source: &smb4k; also provides the ability to force the unmounting of shares (&Linux; only). This might be useful with inaccessible shares that cannot be unmounted the normal way. To enable this feature, you need to modify the <link linkend="configuration_shares_mounting">settings</link> in the configuration dialog.
de: &smb4k; bietet auch die Möglichkeit, das Lösen der Einbindung von Freigaben nur unter &Linux; zu erzwingen. Dies ist nützlich bei nicht erreichbaren Freigaben, die nicht auf die normale Art gelöst werden können. Um dies zu aktivieren, müssen Sie die Einstellungen im <link linkend="configuration_shares_mounting">Einrichtungsdialog</link> ändern.

source: Read the <link linkend="mainwindow_shares_unmounting">Unmounting Shares</link> section for more details.
de: Weitere Informationen dazu finden Sie im Abschnitt <link linkend="mainwindow_shares_unmounting">Lösen von Freigaben</link>.

source: <shortcut><keycombo action="simul">&Ctrl; <keycap>N</keycap></keycombo></shortcut> <guimenuitem>Unmount All</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>N</keycap> </keycombo> </shortcut> <guimenuitem>Alle Einbindungen lösen</guimenuitem>

source: Unmount all shares at once. The restrictions noted above also apply here. If you do not have any shares mounted, this button is disabled.
de: Löst die Einbindung aller Freigaben auf einmal. Die oben genannten Einschränkung treffen auch hier zu. Sind keine Freigaben eingebunden, ist dieser Knopf deaktiviert.

source: Add a bookmark to the currently selected mounted share. This action is disabled if no share is selected.
de: Fügt ein Lesezeichen für die aktuell ausgewählte eingebundene Freigabe hinzu. Diese Aktion ist dann aktiviert, wenn eine Freigabe ausgewählt ist.

source: <shortcut><keycombo action="simul">&Ctrl; <keycap>Y</keycap></keycombo></shortcut> <guimenuitem>Synchronize</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Y</keycap> </keycombo> </shortcut> <guimenuitem>Abgleichen</guimenuitem>

source: Start the <link linkend="mainwindow_shares_synchronization">synchronization</link> of a share with a local copy or vice versa. This menu entry is only enabled if you installed the program <ulink url="man:/rsync"><citerefentry><refentrytitle>rsync</refentrytitle><manvolnum>1</manvolnum></citerefentry></ulink>.
de: Startet den <link linkend="mainwindow_shares_synchronization">Abgleich</link> einer entfernten Freigabe mit einer lokalen Kopie und umgekehrt. Dieser Menüeintrag ist nur dann erreichbar, wenn das Programm <ulink url="man:/rsync"><citerefentry><refentrytitle>rsync</refentrytitle><manvolnum>1</manvolnum></citerefentry></ulink> installiert ist.

source: <shortcut><keycombo action="simul">&Ctrl; <keycap>L</keycap></keycombo></shortcut> <guimenuitem>Open with Konsole</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>L</keycap> </keycombo> </shortcut> <guimenuitem>Mit Konsole öffnen</guimenuitem>

source: Open the base folder of a share in &konsole;. This menu item is useful if you need to run shell scripts, &etc;
de: Öffnet den Basisordner einer Freigabe in &konsole;. Dieser Menüeintrag kann benutzt werden, um Shell-Skripte &etc; auszuführen.

source: <shortcut><keycombo action="simul">&Ctrl; <keycap>I</keycap></keycombo></shortcut> <guimenuitem>Open with File Manager</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>I</keycap> </keycombo> </shortcut> <guimenuitem>Mit Dateiverwaltung öffnen</guimenuitem>

source: Open the contents of a share in the default file manager.
de: Öffnet den Inhalt einer Freigabe im Standard-Dateiverwaltungsprogramm.

source: The popup menu includes all actions that can be performed on a mounted share:
de: Das Kontextmenü enthält all Aktionen, die für die eingebundene Freigabe ausgeführt werden können.

source: Screenshot of the popup menu of the shares view
de: Bildschirmfoto des Kontextmenüs einer Freigabenansicht

source: The popup menu of the shares view
de: Das Kontextmenü einer Freigabenansicht

source: It can be opened by clicking the right mouse button.
de: Das Kontextmenü wird mit der rechten Maustaste geöffnet.

source: The tooltips provide information about the share name, the mount point, the user and group, the login, the file system, the disk usage, and the free disk space. If the share is <link linkend="mounted_shares_view_inaccessible_shares">inaccessible</link>, these values are marked as unknown.
de: Die Kurzinfos zeigen Informationen mit dem Name der Freigabe, dem Mount-Punkt, Benutzer und Gruppe, das Dateisystem, die Speicherbelegung und den freien Speicher.Ist die Freigabe <link linkend="mounted_shares_view_inaccessible_shares">nicht erreichbar</link> werden, sind diese Werte als unbekannt markiert.

source: Tooltips are enabled by default. You can deactivate them in the <link linkend="configuration_user_interface_shares_tooltips">configuration dialog</link>.
de: Kurzinfos werden in der Voreinstellung angezeigt. Die Anzeige der Kurzinfos kann im <link linkend="configuration_user_interface_shares_tooltips">Einrichtungsdialog</link> abgeschaltet werden

source: Inaccessible Shares
de: Nicht erreichbare Freigaben

source: &smb4k; periodically checks all mounted shares if they are still accessible. If an inaccessible share is encountered, it will be marked with a <link linkend="mounted_shares_view_icons">modified icon</link> and you will not be able to open or synchronize it anymore. Unmounting and adding a bookmark is still possible.
de: &smb4k; überprüft periodisch alle eingebundenen Freigaben, ob sie noch erreichbar sind. Wird eine nicht erreichbare Freigabe gefunden, wird Sie mit einem <link linkend="mounted_shares_view_icons">geänderten Symbol</link> markiert. Dann können Sie diese Freigabe nicht mehr öffnen oder abgleichen. Das Lösen der Einbindung oder das Anlegen eines Lesezeichen ist immer noch möglich.

source: The program might freeze for a short period of time due to an inaccessible share. It will recover afterwards.
de: Das Programm kann kurzfristig einfrieren, wenn eine Freigabe nicht erreichbar ist. Die Ausführung wird dann jedoch fortgesetzt.

source: Icons
de: Symbole

source: The shares views know three different icons that may be presented to the user:
de: In der Freigabenansicht werden die drei folgenden Symbole zur Statusinformation verwendet:

source: Screenshot of three different icons
de: Bildschirmfoto der drei verschiedenen Symbole

source: Three different icons
de: Die drei verschiedenen Symbole

source: The icon on the left hand side indicates that this share is not accessible. &smb4k; won't allow you to open it or to do synchronization with it. You will only be able to unmount or add a bookmark to it.
de: Das Symbol auf der linken Seite zeigt an, dass die Freigabe nicht erreichbar ist. Dann können Sie sie in &smb4k; nicht öffnen oder einen Abgleich durchführen. Sie können die Einbindung der Freigabe nur lösen oder ein Lesezeichen dafür anlegen.

source: The central icon indicates that the share is online, accessible, and owned by you. You may perform all available actions on it.
de: Das mittlere Symbol zeigt an, dass eine Freigabe Online ist, darauf zugegriffen werden kann und Sie der Eigentümer sind. Sie können alle verfügbaren Aktionen damit ausführen.

source: All shares marked with a red flag like the one on the right hand side are owned by another user. They are only shown if you adjusted the <link linkend="configuration_user_interface_shares_mounted_shares">settings</link> to display them. In the default configuration, you are not allowed to unmount these shares, but you can <link linkend="configuration_shares_mounting">change this behavior</link>, too.
de: Alle Freigaben, die wie rechts mit einer roten Fahne markiert sind, gehören anderen Benutzern. Sie werden nur dann angezeigt, wenn Sie dies in den <link linkend="configuration_user_interface_shares_mounted_shares">Einstellungen</link> aktiviert haben. In der Voreinstellung können Sie die Einbindung dieser Freigaben nicht lösen, aber diese <link linkend="configuration_shares_mounting">Verhalten</link> können Sie auch ändern.

source: Drag-and-Drop
de: Ziehen und Ablegen (Drag and Drop)

source: &smb4k; supports drag-and-drop in the shares views:
de: &smb4k; unterstützt Ziehen und Ablegen in Freigabenansichten:

source: You can drag a share icon from within the shares view onto the desktop or into another application (&eg; &dolphin;) and drop it there. You will then maybe get a popup menu asking you if you want to copy, link or move the contents of the share. When choosing the appropriate operation please remember that under most circumstances moving and linking the share might not be a good idea. The popup menu can be avoided if you hold down the &Ctrl; key while you are dragging and dropping the share.
de: Sie können das Symbol einer Freigabe in der Freigabenansicht auf die Arbeitsfläche oder in eine andere Anwendung wie &eg; &dolphin; ziehen und dort ablegen. Dann wird ein Kontextmenü mit Aktionen zum Kopieren, Verschieben und Verknüpfen des Inhalts der Freigabe geöffnet. Das Verschieben und Verknüpfen ist oft nicht sinnvoll. Daher wird mit gedrückter &Ctrl;-Taste kein Kontextmenü angezeigt und der Inhalt kopiert.

source: Files and directories can be transferred to a mounted share by dragging them over its icon in the view and drop them there. By default the data will be moved to the share. To copy it, hold down the &Ctrl; key while you are dragging and dropping it. The transfer will only be successful if the share was mounted with read and write permissions.
de: Dateien und Ordner können zu einer eingebundenen Freigabe übertragen werden, indem Sie sie auf dessen Symbol ziehen und dort ablegen. In der Voreinstellung werden die Daten verschoben. Um Sie zu kopieren, halten Sie bei dieser Aktion die &Ctrl; gedrückt. Die Übertragung kann nur erfolgreich durchgeführt werden, wenn die Freigabe mit den Berechtigungen zum Lesen und Schreiben eingebunden wurden.

source: Unmounting Shares
de: Lösen von Freigaben

source: One or multiple selected shares may be unmounted by either clicking the <menuchoice><shortcut><keycombo action="simul">&Ctrl; <keycap>U</keycap></keycombo></shortcut><guimenuitem>Unmount</guimenuitem></menuchoice> action or by pressing its keyboard shortcut. By default, the ability to unmount a share is restricted to the ones that are owned by you. This behavior can be altered in the <link linkend="configuration_shares">configuration dialog</link>. If you enabled the unmounting of shares that are owned by other users, you will be presented with a warning dialog prior to the actual unmount:
de: Eine oder mehrere ausgewählte Freigaben können mit der Aktion <menuchoice><shortcut><keycombo action="simul">&Ctrl; <keycap>U</keycap></keycombo></shortcut><guimenuitem>Einbindung lösen</guimenuitem></menuchoice> gelöst werden. In der Voreinstellung können Sie nur eigenen Freigaben lösen. Dieses Verhalten kann im <link linkend="configuration_shares">Einrichtungsdialog</link> geändert werden. Wenn Sie die Einbindung einer fremden Freigabe lösen, wird folgender Warndialog angezeigt:
