Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/calligra/calligra.po
Languages: de

source: A General Introduction
de: Eine allgemeine Einführung

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Maren</firstname><surname>Pakura</surname><affiliation><address><email>maren@kde.org</email></address></affiliation><contrib>Deutsche Übersetzung</contrib></othercredit> <othercredit role="translator"><firstname>Marco</firstname><surname>Wegner</surname><affiliation><address><email>mail@marcowegner.de</email></address></affiliation><contrib>Deutsche Übersetzung</contrib></othercredit><othercredit role="translator"><firstname>Hans-Frieder</firstname><surname>Hirsch</surname><affiliation><address><email>f.hirsch@t-online.de</email></address></affiliation><contrib>Deutsche Übersetzung</contrib></othercredit>

source: &calligra; is a graphic art and office suite by &kde;.
de: &calligra; ist eine Sammlung von Grafik- und Büroprogrammen von &kde;

source: Introduction
de: Einführung

source: &calligra; components
de: &calligra;-Komponenten

source: Please check <ulink url="http://docs.kde.org/development/en/calligra/calligra/index.html">http://docs.kde.org</ulink> for updated versions of this document.
de: Aktualisierte Versionen dieses Dokuments finden Sie unter <ulink url="http://docs.kde.org/development/en/calligra/calligra/index.html">http://docs.kde.org</ulink>.

source: &calligra; is a graphic art and office suite by &kde;. &calligra; consists of the following components:
de: &calligra; ist eine Sammlung von Grafik- und Büroprogrammen von &kde;. &calligra; besteht zurzeit aus den folgenden Programmen:

source: &words; (a frames-based wordprocessor)
de: &words; (Rahmenbasiertes Textverarbeitungsprogramm)

source: &sheets; (a spreadsheet application)
de: &sheets; (Tabellen-Kalkulationsprogramm)

source: &stage; (screen and slide presentations)
de: &stage; (Bildschirm- und Folienpräsentationen)

source: &flow; (a flowchart application)
de: &flow; (Flussdiagramme)

source: &karbon; (a vector drawing application)
de: Karbon (Vektorgrafik)

source: &krita; (a pixel based drawing application)
de: &krita; (Pixelgrafik)

source: &kexi; (an integrated environment for managing data)
de: &kexi; (Datenbankprogramm)

source: &plan; (a project management application)
de: &plan; (Programm zur Projektplanung und -verwaltung)

source: Because these components use Flake technology, &calligra; components are designed to work very well with each other. Many &calligra; component can be embedded in another &calligra; document. For instance, you can insert a spreadsheet which you created in &sheets; directly into a &words; document. In this way, complex, compound documents can be created using &calligra;.
de: Die einzelnen Programme benutzen die Flake-Technologie und wurden mit dem Ziel entwickelt, zusammen in Dokumenten benutzt zu werden. Jede &calligra;-Komponente kann in ein beliebiges &calligra;-Dokument eingebettet werden. Sie können z. B. eine in &sheets; erstellte Tabelle direkt in ein &words;-Dokument einfügen. Damit ist es möglich, mit den &calligra;-Programmen komplexe zusammengesetzte Dokumente zu erstellen.

source: A plugin mechanism makes it easy to extend the functionality of &calligra;. You will find many plugins in some of the components and can learn how to write plugins yourself.
de: Durch das Einbinden von Modulen können Sie die Fähigkeiten von &calligra; erweitern. Sie finden viele Module in den einzelnen Programmen und können sehr leicht lernen, eigene Module zu entwickeln.

source: This manual only covers the general features of &calligra;, those that are common to most or all components in the suite. For detailed information about the different components, have a look at the respective manual.
de: In diesem Dokument werden nur die allgemeinen Eigenschaften von &calligra; für alle Teilprogramme erläutert. Weitere Informationen zu den einzelnen Programmen finden Sie in den jeweiligen Handbüchern.

source: Overview of &calligra; features
de: Überblick der Eigenschaften von &calligra;

source: &calligra; provides a framework that all components build on. Through this framework high integration is achieved. It is possible to develop your own component that integrates as well.
de: &calligra; enthält die Grundlage für alle Anwendungen. Dadurch sind alle Anwendungen gut eingebunden. Ihre eigenen Programme können Sie ebenfalls so gut integrieren.

source: Lightweight
de: Geringe Anforderung an Computerleistung

source: Despite offering so many components, &calligra; is lightweight, fast and has a rather low memory footprint. This is also achieved because &calligra; builds on &kde;, a powerful application development framework.
de: Obwohl &calligra; so viele Programme enthält, stellt es nur geringe Anforderungen an die Rechnerleistung, ist schnell und benötigt wenig Arbeitsspeicher. Dies ist auch deshalb möglich, weil &calligra; auf &kde; aufbaut, das die Grundlage für leistungsfähige Programme bereitstellt.

source: A goal of &calligra; is also to not overload the user interface with features that are hardly needed. This results in a lean and mean user interface that lets you do your work efficiently.
de: Ein Ziel von &calligra; ist es auch, die Benutzeroberfläche nicht mit selten gebrauchten Funktionen zu überladen. Das führt zu einer gut überschaubaren Benutzerschnittstelle, die ein effektives Arbeiten ermöglicht.

source: Being lightweight can at times also mean that that very particular special functionality you need is not there. In this case you can always add the functionality yourself by extending &calligra;. Extra features can always be made available through additional plugins or scripts, thus keeping &calligra; itself lightweight.
de: Geringe Anforderungen bedeutet manchmal auch, das selten benötigte Fähigkeiten nicht vorhanden sind. In diesem Fall können Sie erforderlichen Fähigkeiten durch Erweiterung von &calligra; selbst hinzufügen. Diese Fähigkeiten können jederzeit durch zusätzliche Module oder Skripte eingefügt werden, damit &calligra; in der Grundversion keine hohen Anforderungen an den Computer stellt und leicht zu bedienen bleibt.

source: Completeness
de: Umfassend

source: &calligra; offers a wide range of components, covering most of the home and business office needs. Additional features can always be implemented through scripts, plugins or even whole components based on the &calligra; framework.
de: &calligra; enthält Programme für einen großen Anwendungsbereich und deckt damit die meisten Anforderungen von Privat- und Geschäftsleuten ab. Zusätzliche Fähigkeiten können jederzeit durch Skripte, Module und sogar ganze Anwendungen auf der Basis von &calligra; eingefügt werden.

source: It is a major importance for any office suite to adhere to established standards. Especially on the file format level to allow seamless document exchange with other office suites. This also avoids vendor lock-in, which is especially important for companies and also for individuals.
de: Es ist für einen Sammlung von Büroprogrammen sehr wichtig, sich an weit verbreitete Standards zu halten. Das gilt besonders für die Dateiformate, damit Dokumente problemlos mit anderen Büroprogrammen bearbeitet werden können. Damit verringert sich die Abhängigkeit von Softwareherstellern, besonders wichtig für Firmen und auch für Privatleute.

source: For this reason &calligra; has adapted the OASIS OpenDocument format as native file format.
de: Aus diesem Grund benutzt &calligra; das OASIS-OpenDocument-Format als Standardformat.

source: &kde; Features
de: Fähigkeiten von &kde;

source: Since &calligra; builds on &kde; all the features you would expect from a &kde; application are also available in &calligra;. This includes &DBus;, KParts, Flake, Desktop Integration, Configurability and so on. All this makes the look and feel of &calligra; very familiar and really integrates &calligra; into the desktop environment, thus allowing seamless workflows.
de: Da &calligra; auf der Grundlage von &kde; entwickelt wurde, sind alle Eigenschaften eines &kde;-Programms auch in &calligra; vorhanden, also &DBus;, KParts, Flake, Einbindung in die Arbeitsumgebung und viele Möglichkeiten zur Einstellung von Eigenschaften. Damit passt sich &calligra; gut in die &kde;-Arbeitsumgebung ein und erleichtert die Arbeitsabläufe.

source: Configuring &calligra; and Your System
de: Die Einrichtung von &calligra; für Ihr System

source: While &calligra; should work quite nice out of the box, there may well be some things to optimize to get the best out of &calligra;. This chapter shows you what you might want to do to achieve the best results with your new office suite and make it suite your needs. &calligra; is highly configurable, even down to detailed toolbar and menu layout.
de: Obwohl mit &calligra; in den Standardeinstellungen bereits gut gearbeitet werden kann, gibt es noch die Möglichkeit, mehr aus &calligra; herauszuholen. Dieses Kapitel zeigt Ihnen, wie Sie noch besser mit Ihrem neuen Büro-Programmpaket arbeiten und es an Ihre Erfordernisse anpassen können. In &calligra; können Sie viele Einstellungen ändern, bis hin zu eigenen Werkzeugleisten und Menüs.

source: Customizing the &calligra; &GUI;
de: Die Oberfläche (&GUI;) von &calligra; anpassen

source: While &calligra; comes out of the box with a &GUI; (graphical user interface) that should suit most people's needs, there are good reasons why you may want to change the way the programs look.
de: Obwohl die Oberfläche (&GUI;) von &calligra; in der Standardeinstellung sinnvoll vorkonfiguriert ist, gibt es Möglichkeiten, das Erscheinungsbild der Programme an die eigenen Vorstellungen anzupassen.

source: My mother, for example, is a bit afraid of buttons and menu entries she doesn't understand. To tailor &calligra; to her needs, I reduced the &GUI; to a bare minimum of functionality. As she only needs to write letters and use certain templates, there is no need for much more functionality than saving, loading, printing, &etc;
de: Um z. B. die Funktionen, die durch Knöpfe und Menüeinträge sichtbar sind, auf ein Minimum zu reduzieren, können Sie das &GUI; von &calligra; entsprechend anpassen. Falls Sie z. B. nur einfache Briefe schreiben möchten, benötigen Sie nicht viel mehr Funktionen als speichern, laden, drucken &etc;

source: Thanks to the <quote>action</quote> concept of &Qt; and &kde;, you can freely customize &calligra; menubars and tool bars. Unfortunately, at the moment, there are no easy-to-use dialogs to do this. &calligra; stores its &GUI; configuration in &XML; files and you'll have to edit those. Hopefully, this situation will change in the future; for now, you'll need some basic knowledge of how an &XML; document works (or &HTML;, which is a subset of &XML;).
de: Mit Hilfe des <quote>Aktionen</quote>-Konzeptes von &Qt; und &kde; kann man die Menüleiste und die Werkzeugleisten von &calligra; beliebig verändern. Leider gibt es dazu bisher keine einfach anzuwendenden Dialoge. Die &GUI; -Konfiguration von &calligra; ist in &XML;-Dateien gespeichert. Diese müssen verändert werden. Dafür benötigen Sie bis auf Weiteres noch Grundkenntnisse darüber wie &XML; Dateien (oder &HTML;, da &HTML; eine Untermenge von &XML; ist) funktionieren.

source: Normally, each &calligra; application has at least two of those &XML; files: one describing the &GUI; of the shell (basically, that's what you see if there is no document open) and one describing the &GUI; of the respective part (that's what you see normally). For example, for &words;, these two &XML; files are named <filename>calligra_shell.rc</filename> and <filename>words.rc</filename>.
de: Für jedes &calligra;;-Programm gibt es zwei &XML;-Dateien: Eine beschreibt das &GUI;, des Programmrahmens (shell) (das Aussehen des Programms ohne geöffnetes Dokument) und eine weitere, die das &GUI; der Komponente beschreibt (dieses sieht man normalerweise). Für &words; befinden sich diese zwei &XML;-Dateien unter <filename>calligra_shell.rc</filename> und <filename>words.rc</filename>.

source: Here's a simple example of such an rc-file.
de: Hier sehen Sie ein Beispiel für eine einfache rc-Datei.

source: An example of a simple rc-file
de: Beispiel einer einfachen rc-Datei

source: How to get more information
de: Wie Sie mehr Information erhalten

source: Other &calligra; manuals
de: Andere &calligra;-Handbücher

source: For detailed information on the different &calligra; applications, please consult their respective manuals.
de: Genaue Informationen für jedes &calligra;-Programm sind im zugehörigen Hilfe-Dokument zu finden.

source: Links
de: Verknüpfungen

source: The following links should be useful if you're looking for more information about &kde; or &calligra;.
de: Die folgenden Links sind nützlich, wenn Sie weitere Informationen über &kde; und &calligra; suchen.

source: <ulink url="http://calligra.org">The &calligra; homepage</ulink>. Here you can find information on how to get and install &calligra;, news about &calligra; development, screenshots &etc;
de: Die Internetseite von <ulink url="http://calligra.org">&calligra;</ulink>. Dort finden Sie Informationen wie Sie &calligra; bekommen und installieren können, Neues zur Entwicklung von &calligra; Bildschirmfotos &etc;

source: <ulink url="http://www.kde.org">The &kde; Homepage</ulink>. &kde; is the most advanced and absolutely free desktop environment for unix-like operating systems. &calligra; makes use of the &kde; libraries.
de: <ulink url="http://www.kde.org">Die &kde;-Seite</ulink>. &kde; ist die fortgeschrittenste und absolut freie Arbeitsplatzumgebung für Unix-ähnliche Betriebssysteme. &calligra; verwendet die &kde;-Bibliotheken.

source: <ulink url="http://qt-project.org/">&Qt; page</ulink>. The creators of the C++-toolkit &Qt;. &kde; and &calligra; make use of &Qt;.
de: <ulink url="http://qt-project.org/">&Qt;-Internetseite</ulink>. Die Entwickler der C++-Bibliothek &Qt;. &kde; und &calligra; verwenden &Qt;.

source: Programming &calligra;
de: Programmierung von &calligra;

source: If you want to do &calligra; development, the following resources might be of interest:
de: Falls Sie sich an der weiteren Entwicklung von &calligra; beteiligen möchten, könnten die folgenden Informationen Ihr Interesse finden:

source: At <ulink url="http://techbase.kde.org/Development">http://techbase.kde.org/Development</ulink> you'll find many documents about programming with &Qt; and &kde;. You can find the online version of the complete &kde; library documentation on <ulink url="http://api.kde.org/">KDE API Reference</ulink>
de: Viele Dokumente zur Programmierung mit &Qt; und &kde; finden Sie unter <ulink url="http://techbase.kde.org/Development">http://techbase.kde.org/Development</ulink>. Die Online-Version der vollständigen Dokumentation zur &kde;-Bibliothek finden Sie auf der Seite <ulink url="http://api.kde.org/">KDE API Reference</ulink>.

source: The first step for contributing code is to follow <ulink url="http://community.kde.org/Calligra/Building/Building_Calligra">those instructions</ulink> to get the source code and build it.
de: Als ersten Schritt zur Mitarbeit an der Entwicklung lesen Sie bitte diese <ulink url="http://community.kde.org/Calligra/Building/Building_Calligra">Anleitung</ulink>, um den Quelltext herunterzuladen und ui installieren.

source: Copyright and Licensing
de: Copyright und Lizenz

source: &calligra; is the result of the joint effort of many developers. Each source file of &calligra; is copyrighted by the people who wrote this particular file and their names can be found at the start of each source file with the license that applies to that source file.
de: &calligra; ist das Ergebnis gemeinsamer Anstrengungen vieler Entwickler. Jede Quelldatei ist urheberrechtlich geschützt für die Menschen, die diese besondere Datei geschrieben haben. Ihre Namen finden sich am Anfang jeder Quelldatei, zusammen mit der Lizenz unter der die Datei veröffentlicht wurde.

source: This manual is copyright by &Jost.Schenck;. It can be distributed freely, as long as this copyright notice is included. You may change it as long as you send me the changes or commit them to &kde; <acronym>Git</acronym>. I'll not be liable for anything resulting from the use of this manual.
de: Dieses Dokument steht unter dem Copyright von &Jost.Schenck;. Solange dieses Copyright enthalten ist, darf es frei weitergegeben werden. Änderungen dürfen vorgenommen werden, wenn diese an den Autor geschickt oder in das &kde;-<acronym>Git</acronym> aufgenommen werden. Ich bin nicht für irgendwelche Auswirkungen der Benutzung dieses Dokuments verantwortlich.

source: The other &calligra; manuals are copyrighted by their respective authors.
de: Die anderen &calligra;-Dokumentationen stehen unter dem Copyright der jeweiligen Autoren.

source: CREDIT_FOR_TRANSLATORS
de: <para>Übersetzung Burkhard Lück<email>lueck@hube-lueck.de</email></para>
