Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/calligra/sheets_basics.po
Languages: de

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Hans-Frieder</firstname><surname>Hirsch</surname><affiliation><address><email>f.hirsch@t-online.de</email></address></affiliation><contrib>Deutsche Übersetzung</contrib></othercredit> <othercredit role="translator"><firstname>Johannes</firstname><surname>Schwall</surname><affiliation><address><email>johannes.schwall@gmail.com</email></address></affiliation><contrib>Deutsche Übersetzung</contrib></othercredit>

source: &sheets; Basics
de: &sheets;-Grundlagen

source: Like the rest of &kde;, &sheets; is highly configurable, which can cause problems for readers trying to compare the text in a document such as this with what they see on the version of &sheets; running on their desktop. To cut down on some of the possibilities for confusion, it is suggested that when you first start to use &sheets; you set the default options in all pages of the &sheets; configuration dialog (obtained by selecting <menuchoice><guimenu>Settings</guimenu><guimenuitem>Configure Sheets...</guimenuitem></menuchoice>).
de: Wie alle anderen &kde;-Programme kann &sheets; in großem Umfang auf die individuellen Bedürfnisse der Benutzer eingestellt werden. Das kann problematisch sein, wenn Sie den Text in diesem Dokument mit &sheets; auf Ihrem Bildschirm vergleichen. Um die mögliche Verwirrung zu verringern, ist es empfehlenswert, dass Sie beim ersten Start von &sheets; auf allen Seiten des &sheets;-Einstellungsdialogs die Voreinstellungen auswählen. Den Einstellungsdialog öffnen Sie mit <menuchoice><guimenu>Einstellungen</guimenu><guimenuitem>&sheets; einrichten ...</guimenuitem></menuchoice>

source: Spreadsheets for Beginners
de: Tabellenkalkulation für Anfänger

source: This section attempts to explain by example what a spreadsheet program such as &sheets; actually does, and why it is such a useful tool in any situation where you have to deal with numbers. If you have already used a spreadsheet program you may wish to skip to the next section.
de: Dieser Abschnitt versucht beispielhaft zu erklären, was ein Tabellenkalkulationsprogramm wie &sheets; tatsächlich tut und warum es in jeder Situation, in der Sie mit Zahlen umgehen müssen, ein so nützliches Werkzeug ist. Wenn Sie schon ein Tabellenkalkulationsprogramm benutzt haben können Sie im nächsten Abschnitt weiterlesen.

source: The first thing to do is to start up &sheets;. You can do this by <mousebutton>left</mousebutton> clicking on a &sheets; icon if there is one on your desktop or panel, or you can select <menuchoice><guimenu>Office</guimenu><guimenuitem>&sheets;</guimenuitem> </menuchoice> from the &kmenu;.
de: Zuerst müssen Sie &sheets; starten, indem Sie mit der <mousebutton>linken</mousebutton> Maustaste auf das &sheets;-Symbol auf Ihrem Arbeitsfläche oder in der Kontrollleiste klicken. Sie können aber auch im &kmenu; <menuchoice><guimenu>Büroprogramme</guimenu> <guimenuitem>&sheets;</guimenuitem> </menuchoice> auswählen.

source: &sheets; at first run
de: &sheets; beim ersten Start

source: When it has started you will be given the choice of opening a recent document, creating a new document from a template (with templates categories) or opening an existing document . Select the <guilabel>General</guilabel> category on the left and choose the <guilabel>Blank Worksheet</guilabel> template. Then click the <guibutton>Use This Template</guibutton> button.
de: Wenn &sheets; gestartet ist,haben Sie die Möglichkeit, ein kürzlich bearbeitetes Dokument zu öffnen, ein neues Dokument aus einer Vorlage zu erstellen oder ein vorhandenes Dokument zu öffnen. Klicken Sie auf die Kategorie <guilabel>Allgemein</guilabel> auf der linken Seite des Dialogs und wählen Sie die Vorlage <guilabel>Leeres Arbeitsblatt</guilabel>. Klicken Sie dann auf den Knopf <guibutton>Diese Vorlage verwenden</guibutton>.

source: Looking at &sheets; once it has started up, you will see a sheet of empty rectangular cells arranged in numbered rows and lettered columns. This is where you enter data or formula, text or charts.
de: Nach den Start von &sheets; sehen Sie eine Tabelle mit leeren rechteckigen Zellen, angeordnet in nummerierten Zeilen und mit Buchstaben benannten Spalten. Hier können Sie Daten, Formeln, Text oder Diagramme eingeben.

source: Screenshot starting1
de: Bildschirmfoto Starten1

source: Now, enter the text and values shown in the first 5 rows of the above screenshot into the same cells of your spreadsheet. Ignore what is in row 7 for the moment. To enter anything into a cell first select the cell by <mousebutton>left</mousebutton> clicking inside it, then type whatever you want, then press &Enter; or use the arrow keys to move the selection point to another cell.
de: Geben Sie jetzt den Text und die Werte, die in den ersten fünf Zeilen des Bildschirmfotos oben zu sehen sind, in dieselben Zellen in Ihrer Kalkulationstabelle ein. Ignorieren Sie im Moment das, was in Zeile 7 steht. Um in eine Zelle irgend etwas einzutragen, wählen Sie zunächst eine Zelle aus, indem Sie mit der <mousebutton>linken</mousebutton> Maustaste in die Zelle klicken. Dann geben Sie in die Zelle beliebige Werte oder Texte ein. Danach drücken Sie die Taste &Enter; oder wählen Sie mit den Pfeiltasten eine andere Zelle aus.

source: What we have entered so far could be a simple budget for the next two months, listing how much we think we will be spending for Food, Shelter, Clothing and any Other expenditure. Now select cell B7 (column B, row 7), type in <userinput>=B2+B3+B4+B5</userinput> and press &Enter;. Because it begins with a <keycap>=</keycap> symbol &sheets; sees this as a formula, something it has to calculate, in this case by adding together the values in the 4 cells B2 to B5, and what is shown in the cell B7 is the result of that calculation.
de: Was bis jetzt eingetragen ist könnte ein kleiner Haushaltsplan für die nächsten zwei Monate sein, der auflistet wieviel Sie für Nahrungsmittel, Miete, Kleidung und irgendwelche andere Ausgaben ausgeben wollen. Wählen Sie jetzt die Zelle B7 (Spalte B, Zeile 7) aus und tippen Sie <userinput>=B2+B3+B4+B5</userinput> ein. Danach bestätigen Sie die Eingabe mit der Taste &Enter;. Weil die Eingabe mit dem Symbol <keycap>=</keycap>-beginn, erkennt &sheets; diese als eine Formel, die berechnet werden soll, in diesem Fall durch Addition der Werte in den 4 Zellen B2 bis B5. Was in der Zelle B7 zu sehen ist, ist das Ergebnis dieser Berechnung.

source: You could enter a similar formula into cell C7, except that in this case it would have to be <userinput>=C2+C3+C4+C5</userinput>, but there is an easier way which is to Copy cell B7 and Paste it into C7. &sheets; will automatically adjust the cell references from B.. to C.. when the Paste is done.
de: Sie könnten die gleiche Formel auch in die Zelle C7 eingeben. Allerdings müssten Sie dann <userinput>=C2+C3+C4+C5</userinput> eintippen. Es gibt aber einen einfacheren Weg: Kopieren Sie die Zelle B7 und fügen sie in C7 ein. &sheets; wird dann die Zellverweise automatisch von B nach C umstellen, wenn das Einfügen beendet ist.

source: At this point you may think that &sheets; is doing no more than you could manage with pencil, paper and a calculator, and you could be right, but remember that this is a very small example of a spreadsheet, doing simple calculations on only a few numbers. For any reasonably amount of values or data using a spreadsheet to do the calculations is much quicker and more accurate than doing them manually.
de: An dieser Stelle könnten Sie denken, dass &sheets; nicht mehr als Sie mit Bleistift, Papier und Taschenrechner kann und damit haben Sie Recht. Denken Sie aber daran, dass das ein Beispiel einer sehr kleinen Kalkulationstabelle ist, in der nur wenige Zahlen berechnet werden. Jede große Wertetabelle kann aber mit einem Tabellenkalkulationsprogramm viel schneller und genauer berechnet werden als von Hand.

source: Also, a spreadsheet lets you play the <quote>What if?</quote> game. Because each formula is automatically recalculated whenever any of the values it refers to are changed, you can quickly see what happens if you alter any of them. Using our example you can see the effect of reducing the amount spent on food in December by just entering a new value into cell C2. If you had a spreadsheet that modelled the greenhouse effect accurately you could perhaps see the effect of a 50 percent reduction in the amount of methane released into the atmosphere.
de: Mit einer Tabellenkalkulation können Sie auch das <quote>Was wäre wenn?</quote>-Spiel spielen. Denn jede Formel wird automatisch neu berechnet, wenn irgendeiner der Werte, auf die sie sich bezieht, verändert wird. Sie können sofort sehen was geschieht, wenn Sie einen der Werte verändern. In unserem Beispiel können Sie sehen welche Auswirkung es hat, wenn Sie die Ausgaben für Nahrungsmittel im Dezember verringern indem Sie einen neuen Wert in Zelle C2 eingeben. Hätten Sie eine Tabellenkalkulation, die den Treibhauseffekt genau abbildet, könnten Sie etwa die Auswirkung sehen, die eine Verringerung der Menge des in die Atmosphäre eingebrachten Methan um 50 % hätte.

source: Selecting Cells
de: Zellen auswählen

source: You can select a single cell or a rectangular area of cells in the spreadsheet. The selected cell(s) are displayed with a thick black border.
de: Sie können eine einzelne Zelle oder einen rechteckigen Zellenbereich in der Tabelle auswählen. Die ausgewählten Zellen werden mit einem dicken schwarzen Rand angezeigt.

source: You can select a single cell in one of the following ways
de: Eine einzelne Zelle können Sie folgendermaßen auswählen:

source: <mousebutton>left</mousebutton> click on it
de: Klicken Sie mit der <mousebutton>linken</mousebutton> Maustaste auf die Zelle

source: enter the cell reference (for example <userinput>B5</userinput>) into the cell reference box at the left end of the <guilabel>Cell Editor</guilabel> tool options and press &Enter;
de: Geben Sie die Adresse der Zelle (zum Beispiel <userinput>B5</userinput>) in das Adressfeld oben links im Zelleneditor ein und drücken Sie die Taste &Enter;.

source: use the <menuchoice><guimenu>Go</guimenu><guimenuitem>Goto Cell...</guimenuitem></menuchoice> menu option
de: Wählen Sie die Zelle mit <menuchoice><guimenu>Gehe zu</guimenu> <guimenuitem>Gehe zu Zelle ...</guimenuitem></menuchoice>

source: You can also steer your way around with the <keysym>arrow</keysym> keys. Pressing the &Enter; key will move the current selection one position up, down, left or right depending on the setting in the <guilabel>Interface</guilabel> page of &sheets;'s <link linkend="configinterface">configuration dialog box</link>.
de: Sie können den Cursor auch mit den <keysym>Pfeiltasten</keysym> verschieben. Die Taste &Enter; bewegt die aktuelle Auswahl einer Zelle nach unten, nach oben, nach links oder nach rechts, abhängig von der Einstellung auf der Seite <guilabel>Oberfläche</guilabel> im <link linkend="configinterface">Einrichtungsdialog von &sheets;</link>.

source: If you hold the <keycombo action="simul">&Shift;</keycombo> key down while using the <keysym>arrow</keysym> keys the selection will move to the start or end of the block of occupied cells.
de: Wenn Sie die <keycombo action="simul">&Shift;</keycombo>-taste gedrückt halten und die <keysym>Pfeiltasten</keysym> drücken, bewegt sich die Auswahlmarkierung an den Anfang oder das Ende des Blocks der belegten Zellen.

source: To select an area of contiguous cells drag the mouse cursor across the desired area with the <mousebutton>left</mousebutton> button held down, or enter the references of the top left and bottom right cells separated by a colon into the <guilabel>Cell Editor</guilabel> cell reference box (for example <userinput>B7:C14</userinput>) and press &Enter;, or enter these cell references in a similar format into the dialog box brought up by <menuchoice><guimenu> Go</guimenu><guimenuitem>Goto Cell...</guimenuitem></menuchoice>.
de: Um einen zusammenhängenden Bereich von Zellen auszuwählen, ziehen Sie entweder mit gedrückter <mousebutton>linker</mousebutton> Maustaste den Mauszeiger über den gewünschten Bereich oder geben Sie die Adresse der Zelle links oben und der Zelle rechts unten, getrennt durch einen Doppelpunkt, in das Adressfeld oben links im Zelleneditor ein (Beispiel: <userinput>B7:C14</userinput>) und drücken Sie die Taste &Enter;. Sie können die Zelladressen auch im gleichen Format in das Dialogfenster eingeben, das Sie <menuchoice><guimenu>Gehe zu</guimenu> <guimenuitem>Gehe zu Zelle ...</guimenuitem></menuchoice> öffnen.

source: You can also select an area of cells by selecting the cell in one corner of the wanted area then holding the <keycombo action="simul">&Shift; </keycombo> key down while using the <mousebutton>left</mousebutton> mouse button to select the cell in the opposite corner.
de: Sie können einen Bereich von Zellen auch auswählen, indem Sie eine Zelle in einer Ecke des gewünschten Bereichs auswählen und dann die <keycombo action="simul"> &Shift;</keycombo>taste gedrückt halten, wenn Sie mit der <mousebutton>linken</mousebutton> Maustaste in die Zelle in der gegenüberliegenden Ecke klicken.

source: To select non-contiguous cells, click on the first cell you want to select then hold the <keycombo action="simul">&Ctrl;</keycombo> key and select the other cells.
de: Um nicht zusammenhängende Zellen auszuwählen, klicken Sie in der erste Zelle, drücken dann die <keycombo action="simul">&Ctrl;</keycombo>-Taste und wählen die anderen Zellen aus.

source: To select a complete row or column of cells <mousebutton>left </mousebutton> click on the row number at the left of the worksheet or on the column letters at the top. To select adjacent rows or columns drag the mouse pointer over the appropriate row numbers or column letters with the <mousebutton>left</mousebutton> button held down.
de: Eine ganze Zeile oder Spalte von Zellen wählen Sie aus, indem Sie mit der <mousebutton>linken</mousebutton> Maustaste auf die Zahl links von der Zeile oder auf den Buchstaben über der Spalte klicken. Um angrenzende Zeilen oder Spalten auszuwählen ziehen Sie den Mauszeiger mit gedrückter <mousebutton>linker</mousebutton> Maustaste über die entsprechenden Zeilenzahlen oder Spaltenbuchstaben.

source: To select non-contiguous rows or columns of cells, click on the first row number or column letter then hold the <keycombo action="simul">&Ctrl;</keycombo> key and select the other rows or columns of cells.
de: Um nicht zusammenhängende Zeilen oder Spalten auszuwählen, klicken Sie in Nummer der ersten Zeile oder auf den Buchstaben der ersten Spalte, drücken dann die <keycombo action="simul">&Ctrl;</keycombo>-Taste und wählen die anderen Zeilen oder Spalten aus aus.

source: Entering Data
de: Dateneingabe

source: Entering data into a cell can be as simple as selecting the cell, typing your data, then pressing &Enter; or moving the selection to another cell with one of the <keysym>arrow</keysym> keys. Depending on how you enter the data, &sheets; will interpret it as a number, date, time or text:
de: Das Eingeben von Daten in eine Zelle ist recht einfach. Wählen Sie die Zelle aus, geben Sie die Daten ein und drücken Sie Taste &Enter; oder bewegen Sie den Cursor (die Auswahlmarkierung) mit einer der <keysym>Pfeiltasten</keysym> in eine andere Zelle. Abhängig davon, wie Sie die Daten eingeben, erkennt &sheets; sie als Zahl, Datum, Zeit oder Text:

source: Numbers are entered in the obvious way; <userinput>123</userinput>, <userinput> -123</userinput>, <userinput>456.7</userinput> or in scientific notation <userinput>-1.2E-5</userinput>.
de: Zahlen werden normalerweise so eingetragen: <userinput>123</userinput>, <userinput>-123</userinput>, <userinput>456,7</userinput> oder in wissenschaftlicher Darstellung so: <userinput>-1.2E-5</userinput>.

source: Dates should be entered in your <quote>System</quote> format, as defined in the &systemsettings; in <menuchoice><guimenu>Locale</guimenu> <guisubmenu> Country/Region &amp; Language</guisubmenu><guimenuitem>Date &amp; Time</guimenuitem> </menuchoice> tab. If, for example, you are using the DD/MM/YYYY form you should enter <userinput>30/03/2012</userinput> for 30th March 2012. Leading zeroes can be omitted from the day and month fields and only the last one or two digits of the year need to be entered if the date is in the current century, for example <userinput>9/1/9</userinput> for 9th January 2009.
de: Daten sollten im <quote>System</quote>-Format eingegeben werden, wie Sie es in den &systemsettings; in <menuchoice><guimenu>Regionales</guimenu> <guisubmenu> Land/Region &amp; Sprache</guisubmenu><guimenuitem>Datum &amp; Zeit</guimenuitem> </menuchoice> eingestellt haben. Wenn Sie beispielsweise das TT.MM.JJJJ-Format verwenden, sollten Sie <userinput>30.03.2012</userinput> für den 30. März 2012 eingeben. Führende Nullen können Sie bei der Eingabe der Tages- und Monatszahlen weglassen und für die Jahreszahl nur die letzte oder die zwei letzten Zahlen eingeben, wenn es ein Jahr im aktuellen Jahrhundert ist. Beispiel: <userinput>9.1.9 </userinput> für den 9. Januar 2009.

source: Times should also be entered using the <quote>System</quote> format. For example if you are using a 12 hour clock then enter times in HH:MIN am|pm or HH:MIN:SS am|pm format such as <userinput>9:42 am</userinput> or <userinput> 10:30:52 pm</userinput>.
de: Uhrzeiten sollten ebenfalls im <quote>System</quote>-Format eingegeben werden. Wenn Sie eine 12-Stunden-Uhr benutzen, geben Sie Zeiten im Format HH:MIN am|pm oder HH:MIN:SS am|pm ein, wie z. B. <userinput>9:42 am</userinput> oder <userinput>10:30:52 pm</userinput>. <userinput>am</userinput> bedeutet dann vormittags, und <userinput>pm</userinput> nachmittags.

source: &sheets; defines any input data as <quote>text</quote> if it cannot recognize the data as being a number, date or time.
de: &sheets; behandelt jede Dateneingabe als <quote>Text</quote> wenn es die Eingabe nicht als Zahl, Datum oder Zeit erkennt.

source: By default, &sheets; right justifies numbers, dates and times within a cell and left justifies anything else. This can be a useful guide to whether you have entered a date or time in the correct format. But remember that how items are displayed can be changed by altering the <link linkend="formatdata">cell format</link>.
de: Als Standard richtet &sheets; Zahlen, Daten und Zeiten innerhalb einer Zelle rechtsbündig und alles andere linksbündig aus. Das kann ein nützlicher Hinweis darauf sein, ob Sie ein Datum oder eine Zeit im korrekten Format eingegeben haben. Aber bedenken Sie, das das Aussehen der Eingaben durch Ändern des <link linkend="formatdata">Zellen-Formats</link> geändert werden kann.

source: The main text entry box in the <guilabel>Cell Editor</guilabel> tool options provides an easy way of editing the contents of a selected cell. Press &Enter; or <mousebutton>left</mousebutton> click on the green tick mark when you are happy with what you have entered, or click on the red cross to cancel your edits.
de: Das große Texteingabefeld des <guilabel>Zelleneditors</guilabel> in den Werkzeugoptionen stellt eine einfache Möglichkeit zum Eingeben und Ändern des Inhalts einer ausgewählten Zelle dar. Wenn Sie mit ihrer Eingabe zufrieden sind, drücken Sie &Enter; oder klicken Sie mit der &LMBn; auf die grüne Häkchenmarkierung, oder klicken Sie auf das rote Stoppsymbol, um Ihre Änderungen zu verwerfen.

source: Generic Cell Format
de: Allgemeines Zellenformat

source: &sheets; uses the <quote>Generic</quote> cell format as default. As long as this format is used, &sheets; autodetects the actual data type depending on the current cell data. For example if you enter some text into a cell and later enter a number into the same cell, &sheets; automatically interprets the new data as a number. If you want to define the type of data yourself, you can explicitly set it in the <link linkend="formatdata">cell format</link>. You can change the format back to <quote>Generic</quote> at any time.
de: &sheets; verwendet als Standard das Zellenformat <quote>Allgemein</quote>. Für Zellen in diesem Format bestimmt &sheets; automatisch den Datentyp aus dem Zelleninhalt. Wenn Sie zum Beispiel Text in eine Zelle eingeben und später eine Zahl in dieselbe Zelle, betrachtet &sheets; die neuen Daten automatisch als Zahl. Wenn Sie den Datentyp einer Zelle direkt festlegen wollen, stellen Sie das Format im Dialog <link linkend="formatdata">Zellenformat</link> ein. Sie können ein Zellenformat jederzeit wieder auf <quote>Allgemein</quote> zurückstellen.

source: Copy, Cut and Paste
de: Kopieren, Ausschneiden und Einfügen

source: At first glance, &sheets;'s <guimenuitem>Cut</guimenuitem>, <guimenuitem>Copy</guimenuitem> and <guimenuitem>Paste</guimenuitem> appear to be similar to these functions in other &kde; applications. Having selected a cell or cells, you can choose <guimenuitem>Copy</guimenuitem> or <guimenuitem>Cut</guimenuitem> from the <guimenu>Edit</guimenu> menu or from the drop down menu you get by holding the <mousebutton>right</mousebutton> mouse button down on a selected cell. You can also use the shortcuts <keycombo action="simul">&Ctrl;<keycap>C</keycap> </keycombo> or <keycombo action="simul">&Ctrl;<keycap>X</keycap> </keycombo>, then move the selection to the target cell and choose <guimenuitem>Paste</guimenuitem> or press <keycombo action="simul"> &Ctrl;<keycap>V</keycap></keycombo>. However there are some subtleties associated with these functions in &sheets; and these are discussed below.
de: Auf den ersten Blick scheinen &sheets;s <guimenuitem>Ausschneiden</guimenuitem>, <guimenuitem>Kopieren</guimenuitem> und <guimenuitem>Einfügen</guimenuitem> jenen Funktionen in anderen &kde;-Anwendungen ähnlich zu sein. Wenn Sie eine Zelle oder Zellen ausgewählt haben, können Sie <guimenuitem>Kopieren</guimenuitem> oder <guimenuitem>Ausschneiden</guimenuitem> im Menü <guimenu>Bearbeiten</guimenu> oder im Auswahlmenü, das Sie bekommen, wenn Sie mit der <mousebutton>rechten</mousebutton> Maustaste auf eine ausgewählte Zelle klicken, auswählen. Sie können auch die Tastenkürzel<keycombo action="simul">&Ctrl;<keycap>C</keycap></keycombo> oder <keycombo action="simul">&Ctrl;<keycap>X</keycap></keycombo> verwenden. Danach bewegen Sie die Auswahl zu der gewünschten Zelle und wählen <guimenuitem> Einfügen</guimenuitem> oder <keycombo action="simul">&Ctrl;<keycap>V</keycap></keycombo>. Es gibt in &sheets; jedoch einige mit diesen Funktionen verknüpfte Feinheiten, die weiter unten erläutert werden.

source: If a cell contains a formula then the formula itself is copied rather than the displayed result, and if the formula contains a reference to another cell, then that reference is changed by the <guimenuitem>Cut</guimenuitem> or <guimenuitem>Copy</guimenuitem> and <guimenuitem>Paste</guimenuitem> operation to point to the cell that is in the same relative position as in the original cell. For example if cell A2 contains the formula <userinput> =B3</userinput> and is copied to C4, cell C4 will contain <userinput>=D5 </userinput>.
de: Wenn eine Zelle eine Formel enthält, dann wird die Formel anstatt des angezeigten Wertes kopiert. Wenn die Formel einen Verweis auf eine andere Zelle enthält, dann wird dieser Verweis durch <guimenuitem>Ausschneiden</guimenuitem> oder <guimenuitem>Kopieren</guimenuitem> und <guimenuitem>Einfügen</guimenuitem> so geändert, dass er auf die Zelle zeigt, die in der gleichen relativen Position zur Einfügezelle steht, wie die Zelle, auf die in der ausgeschnittenen oder kopierten Zelle verwiesen wird. Wenn z. B. Zelle A2 die Formel <userinput>=B3</userinput> enthält und nach C4 kopiert wird, enthält Zelle C4 <userinput>=D5</userinput>.
