Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/calligra/sheets_commands.po
Languages: de

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Hans-Frieder</firstname><surname>Hirsch</surname><affiliation><address><email>f.hirsch@t-online.de</email></address></affiliation><contrib>Deutsche Übersetzung</contrib></othercredit> <othercredit role="translator"><firstname>Johannes</firstname><surname>Schwall</surname><affiliation><address><email>johannes.schwall@gmail.com</email></address></affiliation><contrib>Deutsche Übersetzung</contrib></othercredit>

source: Command Reference
de: Befehlsreferenz

source: The File Menu
de: Das Menü Datei

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>New</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo> </shortcut> <guimenu>Datei</guimenu> <guimenuitem>Neu</guimenuitem>

source: Create a new document.
de: Erstellt ein neues Dokument.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>O</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Open...</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>O</keycap></keycombo> </shortcut> <guimenu>Datei</guimenu> <guimenuitem>Öffnen ...</guimenuitem>

source: Open an existing document.
de: Öffnet ein vorhandenes Dokument.

source: <guimenu>File</guimenu> <guisubmenu>Open Recent</guisubmenu>
de: <guimenu>Datei</guimenu> <guisubmenu>Zuletzt geöffnete Dateien</guisubmenu>

source: <action>Open an existing document</action> by selecting it from a combo box of recently used files.
de: <action>Öffnet ein vorhandenes Dokument</action>, das Sie aus einer Liste kürzlich bearbeiteten Dokumenten auswählen.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>S</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Save</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>S</keycap></keycombo> </shortcut> <guimenu>Datei</guimenu> <guimenuitem>Speichern</guimenuitem>

source: Save the document.
de: Speichert das Dokument.

source: <guimenu>File</guimenu> <guimenuitem>Save As...</guimenuitem>
de: <guimenu>Datei</guimenu> <guimenuitem>Speichern unter ...</guimenuitem>

source: Save and change the current document to a new name or format. If you want to keep the name and format of the document use <guimenuitem>Export...</guimenuitem>
de: Speichert das aktuelle Dokument unter einem neuen Namen und in einem anderen Format. Möchten Sie mit dem aktuellen Dokument weiterarbeiten und dabei den Namen und das Format beibehalten, benutzen Sie den Menüeintrag <guimenuitem>Exportieren ...</guimenuitem>.

source: <guimenu>File</guimenu> <guimenuitem>Reload</guimenuitem>
de: <guimenu>Datei</guimenu> <guimenuitem>Erneut laden</guimenuitem>

source: Reloads the document.
de: Lädt das Dokument erneut.

source: <guimenu>File</guimenu> <guimenuitem>Import...</guimenuitem>
de: <guimenu>Datei</guimenu> <guimenuitem>Importieren ...</guimenuitem>

source: Import other documents.
de: Importiert andere Dokumente.

source: Tables of data are often held in text files with the values in a line being separated by a comma, space, tab or other character, for example <emphasis>123, 456, 789, abcd, efgh</emphasis>. Such files are commonly called <quote><acronym>CSV</acronym></quote> (Comma Separated Values) files, even though the separating character may not be a comma.
de: Tabellen mit Daten werden häufig in Textdateien gespeichert. Die Werte stehen dann in diesen Dateien durch Komma, Leerzeichen, Tabulator oder andere Buchstaben getrennt in einer Zeile, z. B. <emphasis>123, 456, 789, abcd, efgh</emphasis>. Solche Dateien werden gewöhnlich <quote><acronym>CSV</acronym></quote>-Dateien (Comma Separated Values, durch Komma getrennte Werte) genannt, obwohl das trennende Zeichen möglicherweise kein Komma ist.

source: If you ask &sheets; to open a text file it assumes that the file is in <acronym>CSV</acronym> format and launches a dialog box that allows you to specify the delimiter (separating character) used by the file, and shows how the data items will be placed into different spreadsheet cells.
de: Wenn Sie mit &sheets; eine Textdatei öffnen, wird angenommen, dass die Datei im <acronym>CSV</acronym>-Format ist. Ein Dialog wird angezeigt, in dem Sie den Begrenzer (trennendes Zeichen) angeben können, der in der Datei benutzt wird. Es wird auch angezeigt, wie die Daten auf verschiedene Tabellenzellen verteilt werden.

source: Other options in this dialog box let you define the <guilabel>Format</guilabel> of the spreadsheet cells, whether text quote characters should be removed, and whether the first line(s) of the file should be ignored.
de: Mit anderen Optionen in diesem Dialog können Sie das <guilabel>Format</guilabel> der Tabellenzellen festlegen, ob Anführungsstriche entfernt werden sollen, und ob die erste Zeile der Datei ignoriert werden sollte.

source: <guimenu>File</guimenu> <guimenuitem>Export...</guimenuitem>
de: <guimenu>Datei</guimenu> <guimenuitem>Exportieren ...</guimenuitem>

source: <action>Save a document to any supported format.</action> The document does not become the exported file.
de: <action>Speichert ein Dokument in eines der unterstützten Dateiformate.</action> Das Dokument bleibt unverändert und wird nicht zur exportierten Datei.

source: <guimenu>File</guimenu> <guimenuitem>Mail...</guimenuitem>
de: <guimenu>Datei</guimenu> <guimenuitem>Versenden ...</guimenuitem>

source: Send the file as an email attachment.
de: Versenden Sie die Datei als E-Mail-Anhang.

source: <guimenu>File</guimenu> <guimenuitem>Create Template From Document...</guimenuitem>
de: <guimenu>Datei</guimenu> <guimenuitem>Vorlage aus Dokument erstellen ...</guimenuitem>

source: Create a &sheets; <link linkend="templates">template</link> based on this document.
de: Erzeugt eine &sheets;-<link linkend="templates">Vorlage</link> aus diesem Dokument.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>P</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Print...</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>P</keycap></keycombo></shortcut> <guimenu>Datei </guimenu> <guimenuitem>Drucken ...</guimenuitem>

source: Print the document.
de: Druckt das Dokument.

source: <guimenu>File</guimenu> <guimenuitem>Print Preview...</guimenuitem>
de: <guimenu>Datei</guimenu> <guimenuitem>Druckvorschau ...</guimenuitem>

source: View the document as it will be printed.
de: Zeigt eine Druckvorschau des Dokuments an.

source: <guimenu>File</guimenu> <guimenuitem>Document Information</guimenuitem>
de: <guimenu>Datei</guimenu> <guimenuitem>Dokument-Informationen</guimenuitem>

source: View or enter information about the document and author.
de: Lassen Sie sich Informationen zum Dokument und zum Autor anzeigen oder ändern Sie diese.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>W</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Close</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>W</keycap></keycombo></shortcut> <guimenu>Datei</guimenu> <guimenuitem>Schließen</guimenuitem>

source: Close the current document but leave &sheets; running.
de: Schließt das gegenwärtige Dokument, beendet &sheets; aber nicht.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Quit</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo></shortcut> <guimenu>Datei</guimenu> <guimenuitem>Beenden</guimenuitem>

source: <action>Quit</action> &sheets;.
de: <action>Beendet</action> &sheets;.

source: The Edit Menu
de: Das Menü Bearbeiten

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Z</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Undo</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>Z</keycap></keycombo></shortcut> <guimenu>Bearbeiten</guimenu><guimenuitem>Rückgängig</guimenuitem>

source: Undo the last action.
de: Macht die letzte Aktion rückgängig.

source: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>Z</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Redo</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;&Shift;<keycap>Z</keycap></keycombo></shortcut> <guimenu>Bearbeiten</guimenu><guimenuitem>Wiederherstellen</guimenuitem>

source: Redo the last undone action.
de: Stellt die letzte rückgängig gemachte Aktion wieder her.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>X</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Cut</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>X</keycap></keycombo></shortcut> <guimenu>Bearbeiten</guimenu><guimenuitem>Ausschneiden</guimenuitem>

source: <action>Put selected item(s) into the clipboard and remove them from the original location.</action> If you then do a <guimenuitem>Paste</guimenuitem> the item(s) will be inserted at the new location.
de: <action>Verschiebt die ausgewählten Zellinhalte in die Zwischenablage und entfernt sie aus den ursprünglichen Zellen.</action> Wenn Sie danach <guimenuitem>Einfügen</guimenuitem> wählen, werden die Inhalte in gewählte Zellen wieder eingefügt.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>C</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Copy</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>C</keycap></keycombo> </shortcut> <guimenu>Bearbeiten</guimenu><guimenuitem>Kopieren</guimenuitem>

source: Copy selected item(s) to the clipboard.
de: Kopiert die ausgewählten Zellen in die Zwischenablage.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>V</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Paste</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>V</keycap></keycombo></shortcut> <guimenu>Bearbeiten</guimenu><guimenuitem>Einfügen</guimenuitem>

source: Paste item(s) from the clipboard to the selected cell(s).
de: Fügt Daten (z. B. Zelleninhalte) aus der Zwischenablage in die ausgewählten Zellen ein.

source: <guimenu>Edit</guimenu> <guimenuitem>Special Paste...</guimenuitem>
de: <guimenu>Bearbeiten</guimenu> <guimenuitem>Einfügen spezial ...</guimenuitem>

source: <action>Special forms of Paste. </action> See the sections <link linkend="specialpaste">Other Paste Modes</link> and <link linkend="sumspecialpaste">Arithmetic using Special Paste</link> for more details.
de: <action>Spezielle Formen der Einfügen-Funktion.</action> In den Abschnitten <link linkend="specialpaste">Andere Einfügungsarten</link> und <link linkend="sumspecialpaste">Berechnungen mit Einfügen spezial</link> finden Sie dazu weitere Einzelheiten.

source: <guimenu>Edit</guimenu> <guimenuitem>Paste with Insertion</guimenuitem>
de: <guimenu>Bearbeiten</guimenu> <guimenuitem>Einfügen und Zellen verschieben</guimenuitem>

source: Move content of the paste area either to the right or down and paste item(s) from the clipboard to the selected cell(s).
de: Verschiebt die Zellinhalte im Einfügebereich nach rechts oder nach unten und fügt Elemente der Zwischenablage in die ausgewählte(n) Zelle(n) ein.

source: <guimenu>Edit</guimenu> <guisubmenu>Fill</guisubmenu>
de: <guimenu>Bearbeiten</guimenu><guisubmenu>Füllen</guisubmenu>

source: <action>Fills up the selected area with the values from the first item-set.</action> All four directions are supported. Note that the term "item-set" describes the first set of values seen in the fill direction. If the fill direction is Left then the first item-set is the last column of the selection.
de: <action>Füllt den ausgewählten Bereich mit den Werten des ersten Element-Satzes.</action> Alle vier Richtungen werden unterstützt. Beachten Sie, dass der Begriff <quote>Element-Satz</quote> den ersten Satz von Werten meint, den Sie in der Füllrichtung sehen. Wenn die Füllrichtung Links ist, dann ist der erste Element-Satz die letzte Spalte der Auswahl.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>F</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Find...</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>F</keycap></keycombo></shortcut> <guimenu>Bearbeiten</guimenu> <guimenuitem>Suchen ...</guimenuitem>

source: Find cell containing given text.
de: Sucht die Zellen, die den angegebenen Text enthalten.

source: <shortcut> <keysym>F3</keysym> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Find Next</guimenuitem>
de: <shortcut><keysym>F3</keysym></shortcut> <guimenu>Bearbeiten</guimenu><guimenuitem>Weitersuchen</guimenuitem>

source: Find the next cell containing given text.
de: Sucht die nächste Zelle die den gesuchten Text enthält.

source: <shortcut> <keycombo action="simul">&Shift;<keycap>F3</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Find Previous</guimenuitem>
de: <shortcut><keycombo action="simul">&Shift;<keycap>F3</keycap></keycombo></shortcut> <guimenu>Bearbeiten</guimenu><guimenuitem>Frühere suchen</guimenuitem>

source: Find the previous cell containing given text.
de: Sucht die vorhergehenden Zellen, die den gesuchten Text enthalten.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>R</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Replace...</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>R</keycap></keycombo></shortcut> <guimenu>Bearbeiten</guimenu> <guimenuitem>Ersetzen ...</guimenuitem>

source: Find and replace given text in cell(s).
de: Suchen und ersetzen Sie gegebenen Text in Zellen.

source: <guimenu>Edit</guimenu> <guisubmenu>Clear</guisubmenu>
de: <guimenu>Bearbeiten</guimenu><guisubmenu>Leeren</guisubmenu>

source: Clear <guimenuitem>All</guimenuitem> or <guimenuitem>Contents</guimenuitem>, <guimenuitem>Comment</guimenuitem>, <guimenuitem>Conditional Styles</guimenuitem>, <guimenuitem>Link</guimenuitem> or <guimenuitem>Validity</guimenuitem> from selected cell(s).
de: Löscht <guimenuitem>Alle</guimenuitem> oder nur <guimenuitem>Inhalt</guimenuitem>, <guimenuitem>Kommentar</guimenuitem>, <guimenuitem>Bedingte Stile</guimenuitem>, <guimenuitem>Gültigkeit</guimenuitem>, <guimenuitem>Verknüpfungen</guimenuitem> oder <guimenuitem>Gültigkeit</guimenuitem> in den ausgewählten Zellen.

source: <guimenu>Edit</guimenu> <guimenuitem>Delete</guimenuitem>
de: <guimenu>Bearbeiten</guimenu><guimenuitem>Löschen</guimenuitem>

source: Delete <guimenuitem>Cells</guimenuitem>, <guimenuitem>Columns</guimenuitem>, <guimenuitem>Rows</guimenuitem> or <guimenuitem>Sheet</guimenuitem>.
de: Löscht <guimenuitem>Zellen</guimenuitem>, <guimenuitem>Spalten</guimenuitem>, <guimenuitem>Zeilen</guimenuitem> oder eine <guimenuitem>Tabelle</guimenuitem>.

source: <shortcut> <keycap>F2</keycap> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Modify Cell</guimenuitem>
de: <shortcut> <keycap>F2</keycap> </shortcut> <guimenu>Bearbeiten</guimenu> <guimenuitem>Zellen Bearbeiten</guimenuitem>

source: To modify selected cell in-situ.
de: Bearbeiten Sie die ausgewählte Zelle in der Tabelle.

source: The View Menu
de: Das Menü Ansicht

source: <guimenu>View</guimenu> <guimenuitem>New View</guimenuitem>
de: <guimenu>Ansicht</guimenu> <guimenuitem>Neue Ansicht</guimenuitem>

source: Open a new instance of &sheets; with the same document.
de: Öffnet ein neues &sheets;-Fenster mit dem gleichen Dokument.

source: <guimenu>View</guimenu> <guimenuitem>Page Borders</guimenuitem>
de: <guimenu>Ansicht</guimenu> <guimenuitem>Seitenumrandungen</guimenuitem>

source: Toggle marking of printed page borders in the sheet with red lines.
de: Schaltet die Anzeige der Seitenränder der Druckseiten durch rote Linien in der Tabelle ein oder aus.

source: <guimenu>View</guimenu> <guisubmenu>Zoom</guisubmenu>
de: <guimenu>Ansicht</guimenu><guisubmenu>Zoom</guisubmenu>

source: Increase or decrease the magnification used to display the spreadsheet. Range from 33% to 500%.
de: Vergrößern oder Verkleinern Sie die Darstellung der Tabelle auf dem Bildschirm im Bereich von 33 % bis 500 %.

source: The Go Menu
de: Das Menü Gehe zu

source: In this menu you find actions to navigate between the sheets of the currently opened spreadsheet and the <guimenuitem>Goto Cell</guimenuitem> action to jump to a single cell or to select a range of cells.
de: In diesem Menü finden Sie Aktionen zur Navigation zwischen den Zellen des geöffneten Dokuments und können mit <guimenuitem>Gehe zu</guimenuitem> direkt zu einer Zelle gehen oder einen Bereich von Zellen auswählen.

source: The Insert Menu
de: Das Menü Einfügen

source: <guimenu>Insert</guimenu> <guisubmenu>Comment</guisubmenu>
de: <guimenu>Einfügen</guimenu><guisubmenu>Kommentar</guisubmenu>

source: Add or modify a comment.
de: Fügt Sie einen Kommentar zu den ausgewählten Zelle hinzu, löscht oder ändert ihn.

source: <guimenu>Insert</guimenu> <guimenuitem>Function...</guimenuitem>
de: <guimenu>Einfügen</guimenu> <guimenuitem>Funktion ...</guimenuitem>

source: <action>Insert a mathematical function.</action> See the section <link linkend="formulas">Formulae</link> for more details.
de: <action>Fügt eine mathematische Funktion ein.</action> Im Abschnitt <link linkend="formulas">Formeln</link> finden Sie dazu ausführliche Informationen.

source: <guimenu>Insert</guimenu> <guimenuitem>Series...</guimenuitem>
de: <guimenu>Einfügen</guimenu> <guimenuitem>Reihe ...</guimenuitem>

source: <action>Insert a series.</action> See the section <link linkend="series">Series</link> for more details.
de: <action>Fügt eine Reihe ein.</action> Im Abschnitt <link linkend="series">Reihen</link> finden Sie dazu ausführliche Informationen.

source: <guimenu>Insert</guimenu> <guimenuitem>Link...</guimenuitem>
de: <guimenu>Einfügen</guimenu> <guimenuitem>Verknüpfung ...</guimenuitem>

source: <action>Insert a link into the selected cell.</action> See the section <link linkend="hyper">Link Cells</link> for more details.
de: <action>Fügt eine Verknüpfung in die ausgewählte Zelle ein.</action> Im Abschnitt <link linkend="hyper">Verknüpfungen in Zellen</link> finden Sie dazu ausführliche Informationen.

source: <guimenu>Insert</guimenu> <guimenuitem>Special Character...</guimenuitem>
de: <guimenu>Einfügen</guimenu> <guimenuitem>Sonderzeichen ...</guimenuitem>

source: Insert a special character into the selected cell.
de: Fügt ein Sonderzeichen in die ausgewählte Zelle ein.

source: <guimenu>Insert</guimenu> <guisubmenu>External Data</guisubmenu>
de: <guimenu>Einfügen</guimenu> <guisubmenu>Externe Daten</guisubmenu>

source: <action>Insert data <guilabel>From Database...</guilabel>, <guilabel>From Text File...</guilabel> or <guilabel>From Clipboard...</guilabel>.</action> See the section <link linkend="insertdata">Inserting External Data</link> for more details.
de: <action>Fügen Sie Daten <guilabel>Aus Datenbank ...</guilabel>, <guilabel>Aus Textdatei ...</guilabel> oder <guilabel>Aus Zwischenablage ...</guilabel> ein.</action> Im Abschnitt <link linkend="insertdata">Externe Daten einfügen</link> finden Sie dazu ausführliche Informationen.

source: The Format Menu
de: Das Menü Format

source: <shortcut> <keycombo action="simul">&Alt;&Ctrl;<keycap>F</keycap></keycombo> </shortcut> <guimenu>Format</guimenu> <guimenuitem>Cell Format...</guimenuitem>
de: <shortcut><keycombo action="simul">&Alt;&Ctrl;<keycap>F</keycap></keycombo></shortcut> <guimenu>Format</guimenu> <guimenuitem>Zellenformat ...</guimenuitem>

source: <action>Format selected cell(s).</action> See the <link linkend="formatspread">Spreadsheet Formatting</link> section for more details.
de: <action>Formatiert ausgewählte Zellen.</action> Im Abschnitt <link linkend="formatspread">Tabellenformatierung</link> finden Sie dazu ausführliche Informationen.

source: <guimenu>Format</guimenu> <guimenuitem>Style Manager</guimenuitem>
de: <guimenu>Format</guimenu> <guimenuitem>Stilverwaltung</guimenuitem>

source: Create, Modify or delete cell format styles.
de: Zellenstile erstellen, ändern oder löschen.

source: <guimenu>Format</guimenu> <guisubmenu>Style</guisubmenu>
de: <guimenu>Format</guimenu><guisubmenu>Stil</guisubmenu>

source: <action>Apply a style to selected cell(s).</action> To manage styles use <menuchoice> <guimenu>Format</guimenu><guimenuitem>Style Manager...</guimenuitem> </menuchoice>
de: <action>Wendet einen Stil auf ausgewählte Zellen an.</action> Um Stile zu verwalten, verwenden Sie <menuchoice> <guimenu>Format</guimenu><guimenuitem>Stilverwaltung</guimenuitem></menuchoice>

source: <guimenu>Format</guimenu> <guimenuitem>Create Style From Cell...</guimenuitem>
de: <guimenu>Format</guimenu> <guimenuitem>Erstelle einen Stil basierend auf dieser Zelle ...</guimenuitem>

source: <action>Create a new style from the format of the selected cell.</action> To manage styles use <menuchoice> <guimenu>Format</guimenu><guimenuitem>Style Manager...</guimenuitem> </menuchoice>
de: <action>Erstellt einen neuen Stil aus dem Format der ausgewählten Zelle.</action>Um Stile zu verwalten, verwenden Sie <menuchoice><guimenu>Format</guimenu> <guimenuitem>Stilverwaltung</guimenuitem></menuchoice>

source: <guimenu>Format</guimenu> <guimenuitem>AutoFormat...</guimenuitem>
de: <guimenu>Format</guimenu> <guimenuitem>Automatische Formatierung ...</guimenuitem>

source: Autoformat the selected cells: a dialog let you choose betwen two proposed formats.
de: Automatische Formatierung der ausgewählten Zellen. Wählen Sie einen Tabellenstil aus einem Dialog mit Vorschlägen.

source: <guimenu>Format</guimenu> <guimenuitem>Merge Cells</guimenuitem>
de: <guimenu>Format</guimenu><guimenuitem>Zellen verbinden</guimenuitem>

source: Merge selected cells.
de: Verschmilzt die ausgewählten Zellen zu einer großen Zelle.

source: <guimenu>Format</guimenu> <guimenuitem>Dissociate Cells</guimenuitem>
de: <guimenu>Format</guimenu><guimenuitem>Zellen trennen</guimenuitem>

source: Dissociate (split apart) previously merged cells.
de: Trennt die ausgewählten verschmolzenen Zellen wieder in die entsprechenden ursprünglichen Zellen auf.

source: <guimenu>Format</guimenu> <guimenuitem>Adjust Row &amp; Column</guimenuitem>
de: <guimenu>Format</guimenu> <guimenuitem>Zeile und Spalte anpassen</guimenuitem>

source: Set row and column sizes to show selected cell(s) properly.
de: Stellt Sie die Zeilen- und Spaltengrößen so ein, dass die Inhalte der Zelle(n) vollständig angezeigt werden.

source: <guimenu>Format</guimenu> <guisubmenu>Row</guisubmenu>
de: <guimenu>Format</guimenu><guisubmenu>Zeile</guisubmenu>

source: Resize, equalize, hide or show row(s).
de: Bestimmen Sie die Höhe der Zeile neu, gleichen Sie sie aus, blenden Sie sie aus oder zeigen Sie sie wieder an.

source: <guimenu>Format</guimenu> <guisubmenu>Column</guisubmenu>
de: <guimenu>Format</guimenu><guisubmenu>Spalte</guisubmenu>

source: Resize, equalize, hide or show column(s).
de: Bestimmen Sie die Breite der Spalte neu, gleichen Sie sie aus, blenden Sie sie aus oder zeigen Sie sie wieder an.

source: <guimenu>Format</guimenu> <guisubmenu>Sheet</guisubmenu>
de: <guimenu>Format</guimenu><guisubmenu>Tabelle</guisubmenu>

source: Hide, show worksheet or configure advanced sheet properties.
de: Eine Tabelle ausblenden, anzeigen oder erweiterte Tabelleneigenschaften einstellen.

source: <guimenu>Format</guimenu> <guimenuitem>Page Layout...</guimenuitem>
de: <guimenu>Format</guimenu> <guimenuitem>Seitenlayout ...</guimenuitem>

source: Format printed page layout.
de: Formatieren Sie das Seitenlayout der zu druckenden Seiten.

source: <guimenu>Format</guimenu> <guisubmenu>Print Range</guisubmenu>
de: <guimenu>Format</guimenu><guisubmenu>Druckbereich</guisubmenu>

source: Define or reset the print range.
de: Legen Sie den zu druckenden Bereich fest oder setzen Sie diesen Bereich wieder zurück.

source: The Data Menu
de: Das Menü Daten
