Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/calligra/sheets_advanced.po
Languages: de

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Hans-Frieder</firstname><surname>Hirsch</surname><affiliation><address><email>f.hirsch@t-online.de</email></address></affiliation><contrib>Deutsche Übersetzung</contrib></othercredit> <othercredit role="translator"><firstname>Johannes</firstname><surname>Schwall</surname><affiliation><address><email>johannes.schwall@gmail.com</email></address></affiliation><contrib>Deutsche Übersetzung</contrib></othercredit>

source: Advanced &sheets;
de: &sheets; für Fortgeschrittene

source: Series
de: Reihen

source: When constructing a spreadsheet you often need to include a series of values, such as 10, 11, 12..., in a row or column. There are several ways you can do this in &sheets;.
de: Wenn Sie eine Tabelle erstellen, müssen Sie häufig eine Reihe von Werten, wie z.B. 10, 11, 12, ... in einer Zeile oder in einer Spalte eingeben. Es gibt verschiedene Möglichkeiten, wie Sie dies in &sheets; tun können.

source: For a simple short series such as 5, 6, 7, 8... the <quote>Drag and Copy </quote> method is the simplest. Enter the starting value into the starting cell and the next value of the series into an adjacent cell. Then select both cells and move the mouse pointer so that it is over the small square at the bottom right corner; the cursor will change to a diagonal double headed arrow. Then hold the <mousebutton>left</mousebutton> mouse button down while you drag the cells down or across as needed.
de: Für eine einfache kurze Reihe wie 5, 6, 7, 8, ... ist die <quote>Ziehen und Kopieren</quote>-Methode die einfachste Möglichkeit. Tragen Sie den Anfangswert in die Startzelle und den folgenden Wert der Reihe in eine angrenzende Zelle ein. Dann wählen Sie beide Zellen aus und verschieben Sie den Mauszeiger so, dass er über dem kleinen Quadrat an der unteren rechten Ecke des markierten Bereiches steht. Der Cursor wird zu einem diagonalen Pfeil mit zwei Spitzen. Halten Sie dann die &LMB; gedrückt, während Sie die Zellen nach unten oder nach rechts ziehen.

source: The step size is calculated as the difference between the two starting values that you have entered. For example if you enter <userinput>4</userinput> into cell A1 and <userinput>3.5</userinput> into A2 then select both cells and Drag and Copy them down, the step size will be the value in A2 minus the value in A1, -0.5 in this case so you will get the series 4, 3.5, 3, 2.5, 2...
de: Die Schrittgröße wird als die Differenz zwischen den zwei Anfangswerten errechnet, die Sie eingetragen haben. Beispiel: Wenn Sie <userinput>4</userinput> in Zelle A1 eingeben und <userinput>3,5</userinput> in A2, dann beide Zellen auswählen und sie nach unten ziehen und kopieren, ist die Schrittgröße der Wert in A2 minus des Wertes in A1, in diesem Fall also -0,5. Damit erhalten Sie die Reihe 4, 3,5, 3, 2,5, 2, ...

source: The <quote>Drag and Copy</quote> method will even cope with series where the step value is not a constant value but is itself a series. So that if you start with 1, 3, 4, 6 Drag and Copy will extend it to 1, 3, 4, 6, 7, 9, 10, 12..., the step value in this example being the series 2, 1, 2, 1...
de: Die <quote>Ziehen und Kopieren</quote>-Methode wird sogar mit Reihen fertig, in der der Schrittwert nicht ein konstanter Wert, sondern selbst eine Reihe ist. Wenn Sie also mit 1, 3, 4, 6 beginnen, wird die <emphasis>Ziehen und Kopieren</emphasis> Methode die Zahlen zur folgenden Reihe ergänzen: 1, 3, 4, 6, 7, 9, 10, 12, ... Der Schrittwert in diesem Beispiel ist die folgende Reihe: 2, 1, 2, 1, ...

source: &sheets; also recognizes some special <quote>series</quote> such as the days of the week. Try entering <userinput>Friday</userinput> into a cell (note the capitalization) then Drag and Copy it down. To see what special series are available, and perhaps create your own, select <menuchoice><guimenu>Tools</guimenu> <guimenuitem>Custom Lists...</guimenuitem></menuchoice>
de: &sheets; kennt auch einige besondere <quote>Reihen</quote>, zum Beispiel die Wochentage. Geben Sie <userinput>Freitag</userinput> in eine Zelle ein (achten Sie auf den großen Anfangsbuchstaben) und Ziehen und Kopieren Sie dann nach unten. Wählen Sie <menuchoice><guimenu>Extras</guimenu><guimenuitem>Benutzerdefinierte Listen ...</guimenuitem></menuchoice> um zu sehen, welche besonderen Reihen verfügbar sind, und welche Sie vielleicht selbst erstellen wollen.

source: If you select a cell and choose <guimenuitem>Series...</guimenuitem> from the <guimenu>Insert</guimenu> menu you will see the <guilabel>Series</guilabel> dialog box. This is useful for creating series that are too long to be conveniently constructed using the Drag and Copy method, or for creating geometric series such as 1, 1.5, 2.25, 3.375... where the step value, 1.5 in this case, is used as a multiplier.
de: Wenn Sie eine Zelle auswählen und <guimenuitem>Reihe ...</guimenuitem> aus dem Menü <guimenu>Einfügen</guimenu> wählen, sehen Sie den Dialog <guilabel>Reihe</guilabel>. Dieses ist nützlich für das Erzeugen von Reihen, die zu lang sind, um mit der Ziehen-und-Kopieren-Methode erstellt zu werden, oder für das Erzeugen geometrischer Reihen wie 1, 1,5, 2,25, 3,375, ..., wo der Schrittwert, 1,5 in diesem Fall, als Multiplikator verwendet wird.

source: If the type of series that you want is too complicated for any of the previous methods, consider using a formula and Drag and Copying that. For example to create a series with the values 2, 4, 16, 256... enter <userinput>2</userinput> into A1, <userinput>=A1*A1</userinput> into A2, and Drag and Copy cell A2 down.
de: Wenn die gewünschte Art der Reihe für die vorhergehenden Methoden zu schwierig ist, verwenden Sie eine Formel und ziehen und kopieren Sie diese. Z. B., um eine Reihe mit den Werten 2, 4, 16, 256, ... zu erzeugen, geben Sie <userinput>2</userinput> in A1 und <userinput>= A1*A1</userinput> in A2 ein und ziehen und kopieren die Zelle A2 nach unten.

source: Formulae
de: Formeln

source: Built in Functions
de: Vorhandene Funktionen

source: &sheets; has a huge range of built in mathematical and other <link linkend="functions">functions</link> that can be used in a formula cell. They can be seen and accessed by selecting a cell then choosing <guimenuitem>Function...</guimenuitem> from the <guimenu>Insert</guimenu> menu. This brings up the <guilabel>Function</guilabel> dialog box.
de: In &sheets; gibt es eine Vielzahl von mathematischen und anderen <link linkend="functions">Funktionen</link>, die Sie als Formel in einer Zelle verwenden können. Eine Formel wird angezeigt oder eingegeben, indem Sie eine Zelle wählen, und dann <guimenuitem>Funktion ...</guimenuitem> aus dem Menü <guimenu>Einfügen</guimenu> wählen. Damit öffnen Sie den Dialog <guilabel>Funktion</guilabel>.

source: Select the function you want to use from the listbox at the left of the dialog box. The <guilabel>Help</guilabel> tab page will then display a description, the return type, Syntax, Parameters, and Examples for this function. In addition this page provides often links to Related Functions. Then press the button with the down arrow key symbol on it to paste it into the text edit box at the bottom of the dialog.
de: Wählen Sie aus der Liste links im Dialogfeld die Funktion, die Sie verwenden möchten. Auf der Seite <guilabel>Hilfe</guilabel> werden dann eine Beschreibung, der Rückgabetyp, Syntax, Parameter und Beispiele für diese Funktion angezeigt. Zusätzlich finden Sie häufig auch Verweise auf ähnliche Funktionen.Klicken Sie auf den Knopf Pfeil runter, um eine Funktion in das Textfeld unten im Dialog einzufügen.

source: The <guilabel>Parameters</guilabel> tab page will then be displayed to let you enter the parameter(s) for the function you have just chosen. If you want to enter an actual value for a parameter, just type it into the appropriate text box in the <guilabel>Parameters</guilabel> page. To enter a cell reference rather than a value, <mousebutton>left</mousebutton> click on the appropriate text box in the <guilabel>Parameters</guilabel> page; then <mousebutton>left</mousebutton> click on the target cell in the spreadsheet.
de: Jetzt wird die Seite <guilabel>Parameter</guilabel> angezeigt. Hier können Sie die Werte für die gewählte Funktion eingeben. Wenn Sie einen normalen Zahlen- oder Textwert für einen Parameter eintragen möchten, geben Sie ihn in das passende Textfeld auf der Seite <guilabel>Parameter</guilabel>ein. Um einen Verweis auf eine Zelle anstatt eines Wertes einzutragen, klicken Sie mit der <mousebutton>linken</mousebutton> Maustaste auf das entsprechende Textfeld auf der Seite <guilabel>Parameter</guilabel> und klicken Sie dann auf die Zielzelle in der Tabelle.

source: Instead of using the <guilabel>Parameters</guilabel> page, cell references such as <userinput>B6</userinput> can be entered by typing them directly into the edit box at the bottom of the <guilabel>Function</guilabel> dialog. If a function has more than one parameter separate them with a semi-colon (<keysym>;</keysym>).
de: Anstatt die Seite <guilabel>Parameter</guilabel> zu verwenden, können Sie Zellenverweise wie <userinput>B6</userinput> auch direkt in das Textfeld unten im Dialog <guilabel>Funktion</guilabel> eintragen. Wenn ein Ausdruck mehrere Parameter hat, werden diese Parameter jeweils mit einem Semikolon (<keysym>;</keysym>) getrennt.

source: Pressing the <guibutton>OK</guibutton> button will insert the function into the current cell and close the <guilabel>Function</guilabel> dialog.
de: Drücken Sie auf <guibutton>OK</guibutton>, um die Funktion in die aktuelle Zelle einzufügen und den Dialog <guilabel>Funktion</guilabel> zu schließen.

source: You can of course do without the <guilabel>Function</guilabel> dialog and simply type the complete expression into the main text entry box in the <guilabel>Cell Editor</guilabel> tool options. Function names are not case sensitive. Do not forget that all expressions must start with an <keysym>=</keysym> symbol.
de: Sie können natürlich auch ohne den Dialog <guilabel>Funktion</guilabel> die ganze Formel direkt in das Hauptbearbeitungsfeld im <guilabel>Zelleneditor</guilabel> der Werkzeugoptionen eingeben. Groß- oder Kleinschreibung spielt für Funktionsnamen keine Rolle. Denken Sie daran, dass alle Formeln mit dem Symbol <keysym>=</keysym> beginnen müssen.

source: Logical Comparisons
de: Logische Vergleiche

source: Logical functions such as IF(), AND(), OR() take parameters which have the logical (boolean) values True or False. This type of value can be produced by other logical functions such as ISEVEN() or by the comparison of values in spreadsheet cells using the comparison expressions given in the following table.
de: Logische Funktionen wie IF(), AND() und OR() haben Parameter, die die logischen (booleschen) Werte <quote>Wahr</quote>oder <quote>Falsch</quote>annehmen können. Diese Art von Werten kann durch andere logische Funktionen wie ISEVEN() oder durch den Vergleich von Werten in Tabellenzellen mit den Vergleichsausdrücken produziert werden, die in der folgenden Tabelle aufgeführt werden.

source: Expression
de: Ausdruck

source: Description
de: Beschreibung

source: Example
de: Beispiel

source: Is equal to
de: ist gleich

source: <userinput>A2==B3</userinput> is True if the value in A2 is equal to the value in B3
de: <userinput>A2==B3</userinput> ist Wahr, wenn der Wert in A2 gleich dem Wert in B3 ist

source: Is not equal to
de: ist nicht gleich

source: <userinput>A2!=B3</userinput> is True if the value in A2 is not equal to the value in B3
de: <userinput>A2!=B3</userinput> ist Wahr, wenn der Wert in A2 nicht gleich dem Wert in B3 ist

source: Same as <userinput>A2!=B3</userinput>
de: Ist das gleiche wie <userinput>A2!=B3</userinput>

source: Is less than
de: ist kleiner als

source: <userinput>A2&lt;B3</userinput> is True if the value in A2 is less than the value in B3
de: <userinput>A2&lt;B3</userinput> ist Wahr, wenn der Wert in A2 kleiner als der Wert in B3 ist

source: Is less than or equal to
de: ist kleiner oder gleich

source: <userinput>A2&lt;=B3</userinput> is True if the value in A2 is less than or equal to the value in B3
de: <userinput>A2&lt;=B3</userinput> ist Wahr, wenn der Wert in A2 kleiner oder gleich dem Wert in B3 ist

source: Is greater than
de: ist größer als

source: <userinput>A2&gt;B3</userinput> is True if the value in A2 is greater than the value in B3
de: <userinput>A2&gt;B3</userinput> ist Wahr, wenn der Wert in A2 größer als der Wert in B3 ist

source: Is greater than or equal to
de: ist größer oder gleich

source: <userinput>A2&gt;=B3</userinput> is True if the value A2 is greater than or equal to the value in B3
de: <userinput>A2&gt;=B3</userinput> ist Wahr, wenn der Wert in A2 größer oder gleich dem Wert in B3 ist

source: Thus if you enter <userinput>=IF(B3&gt;B1;"BIGGER";"")</userinput> into a cell it will display BIGGER if the value in B3 is greater than that in B1, otherwise the cell will show nothing.
de: Wenn Sie also <userinput>=IF(B3&gt;B1;"GRÖSSER";"")</userinput> in eine Zelle eingeben, zeigt die Zelle GRÖSSER an, wenn der Wert in B3 größer als der in B1 ist, anderenfalls zeigt sie nichts an.

source: Absolute Cell References
de: Absolute Zellenverweise

source: If a formula contains a cell reference that reference will normally be changed when the cell is copied to another part of the worksheet. To prevent this behavior put a <keysym>$</keysym> symbol before the column letter, row number or both.
de: Wenn eine Formel einen Zellverweis enthält, wird dieser Verweis normalerweise geändert, wenn die Zelle in eine andere Zelle in der Tabelle kopiert wird. Um dieses Verhalten zu verhindern, setzt man ein <keysym>$</keysym>-Symbol vor den Buchstaben der Spaltennummer, der Zeilennummer oder vor beide.

source: If A1 contains the formula <userinput>=D5</userinput> then on copying the cell to B2 it will become <userinput>=E6</userinput> (the normal behavior).
de: Wenn A1 die Formel <userinput>=D5</userinput> enthält, wird der Inhalt der Zelle beim Kopieren nach B2 in <userinput>=E6</userinput> geändert (das normale Verhalten).

source: If A1 contains the formula <userinput>=$D5</userinput> then on copying the cell to B2 it will become <userinput>=D6</userinput> (column letter not changed).
de: Wenn A1 die Formel <userinput>=$D5</userinput> enthält, wird der Inhalt der Zelle beim Kopieren nach B2 in <userinput>=D6</userinput> geändert (der Spaltenbuchstabe wurde nicht geändert).

source: If A1 contains the formula <userinput>=D$5</userinput> then on copying the cell to B2 it will become <userinput>=E5</userinput> (row number not changed).
de: Wenn A1 die Formel <userinput>=D$5</userinput> enthält, wird der Inhalt der Zelle beim Kopieren nach B2 in <userinput>=E5</userinput> geändert (die Zeilennummer wurde nicht geändert).

source: If A1 contains the formula <userinput>=$D$5</userinput> then on copying the cell to B2 it will remain as <userinput>=D5</userinput> (neither the column letter nor the row number are changed).
de: Wenn A1 die Formel <userinput>=$D$5</userinput> enthält, wird der Inhalt der Zelle beim Kopieren nach B2 nicht verändert, der Inhalt ist weiterhin <userinput>=D5</userinput> (weder der Spaltenbuchstabe noch die Zeilennummer wurden geändert).

source: When you are entering or editing a cell reference in a formula the shortcut key <keysym>F4</keysym> can be used to step through these four possibilities.
de: Wenn Sie einen Zellenverweis in einer Formel eingeben oder ändern, können Sie mit der Funktionstaste <keysym>F4</keysym> durch diese vier Möglichkeiten schalten. Durch wiederholtes Drücken von <keysym>F4</keysym> wird also aus dem Zellenverweis D5 $D$5, $D5, D$5 und dann wieder D5.

source: <link linkend="namedareas">Named cells</link> can be used in a similar way to include a unchanging cell reference in a formula.
de: <link linkend="namedareas">Benannte Zellenbereiche</link> können in einer ähnlichen Weise benutzt werden, um feste Zellenverweise in eine Formel einzugeben.

source: Arithmetic using Special Paste
de: Berechnungen mit <quote>Einfügen Spezial</quote>

source: Sometimes you may want to add a single value to a number of cells, or subtract a value from them, or multiply or divide them all by a single value. The <guimenuitem>Special Paste...</guimenuitem> option lets you do this quickly and easily.
de: Vielleicht wollen Sie manchmal einen einzelnen Wert zu einer Anzahl von Zellen addieren oder von ihnen subtrahieren, oder Zellen mit einem Wert multiplizieren oder sie alle durch einen einzelnen Wert teilen. Die Funktion <guimenuitem>Einfügen spezial ...</guimenuitem> lässt Sie das schnell und einfach tun.

source: First, enter the modifier value into any spare cell on your spreadsheet and <guimenuitem>Copy</guimenuitem> it. Then select the area of cells you want to change, choose <guimenuitem>Special Paste...</guimenuitem> from the <guimenu>Edit</guimenu> or the context menu and select <guilabel>Addition</guilabel>, <guilabel>Subtraction</guilabel>, <guilabel>Multiplication</guilabel> or <guilabel>Division</guilabel> from the <guilabel>Operation</guilabel> section of the dialog box.
de: Zuerst tragen Sie den Wert, mit dem Sie eine Berechnung auf dem Zellenbereich durchführen wollen, in eine freie Zelle in ihrer Tabelle ein und <guimenuitem>kopieren</guimenuitem> ihn. Wählen Sie dann den Bereich der Zellen aus, die Sie ändern wollen und wählen Sie <guimenuitem>Einfügen spezial ...</guimenuitem> aus dem Menü <guimenu>Bearbeiten</guimenu> oder aus dem Kontextmenü der <mousebutton>rechten</mousebutton> Maustaste. Wählen Sie dann im Dialogfenster einen der Einträge <guilabel>Addition</guilabel>, <guilabel>Subtraktion</guilabel>, <guilabel>Multiplikation</guilabel> oder <guilabel>Division</guilabel> aus dem <guilabel>Operation</guilabel>-Abschnitt aus.

source: You can also apply different modifier values to different rows or columns of the target area by copying an area containing the wanted modifiers before selecting the target area and doing <guimenuitem>Special Paste...</guimenuitem> For example, if you enter <userinput>5</userinput> into cell A1, <userinput>10</userinput> into B1, select both cells and do a <guimenuitem> Copy</guimenuitem> then <guimenuitem>Special Paste...</guimenuitem> <guilabel> Addition</guilabel> into cells A10 to D15, 5 will be added to A10:A15 and C10:C15, and 10 to B10:B15 and D10:D15.
de: Sie können auch unterschiedliche Modifikationswerte auf unterschiedliche Zeilen oder Spalten des Zielbereichs anwenden, indem Sie einen Bereich, der die gewünschten Modifikationsfaktoren enthält, kopieren, bevor Sie den Zielbereich auswählen und <guimenuitem>Einfügen spezial ...</guimenuitem> ausführen. Z. B. wenn Sie <userinput>5</userinput> in Zelle A1 und <userinput>10</userinput> in B1 eingeben, beide Zellen auswählen und <guimenuitem>kopieren</guimenuitem>, danach die Zellen A10 bis D15 markieren und im Dialog<guimenuitem>Einfügen spezial ...</guimenuitem> <guilabel>Addition</guilabel> wählen, wird 5 zu den Zellen A10:A15 und 10C:C15 sowie 10 zu den Zellen B10:B15 und D10:D15 hinzugefügt.

source: Note that a modifier value can be a formula as well as a simple numeric value. If it is a formula then &sheets; will adjust the cell references as for a normal <guimenuitem>Paste</guimenuitem> operation.
de: Beachten Sie, dass ein Modifikationswert eine Formel sowie ein einfacher numerischer Wert sein kann. Wenn es eine Formel ist, dann passt &sheets; die Zellenverweise genau wie beim normalen <guimenuitem>Einfügen</guimenuitem> an.

source: Array Formulas
de: Feldformeln

source: &sheets; allows you to use formulas whose result is a matrix or a range of values. Normally, only the first value is displayed in a cell. If you would like to display the entire matrix, simply use <keycombo>&Ctrl;&Alt;&Enter;</keycombo> when editing a formula, and it will be converted into an array formula, occupying neighboring cells as needed.
de: &sheets; erlaubt die Benutzung von Formeln, deren Ergebnis eine Matrix oder ein Bereich von Werten ist. Normalerweise wird nur der erste Wert in einer Zelle angezeigt. Wenn Sie die gesamte Matrix dargestellt werden soll, benutzen Sie den Kurzbefehl <keycombo>&Ctrl;&Alt;&Enter;</keycombo> bei der Bearbeitung einer Formel. Dann wird die Formel in eine Feldformel umgewandelt und die benachbarten Zellen werden, soweit erforderlich, belegt.

source: Cells that are a part of an array formula are locked for editing.
de: Zellen, die Teil einer Feldformel sind, sind für die Bearbeitung gesperrt.

source: Goal Seeking
de: Zielwertsuche

source: &sheets; can be used to solve algebraic expressions such as <emphasis> x + x^2 = 4</emphasis> or <emphasis>For what value of x does x + x squared equal 4 ?</emphasis>
de: &sheets; kann verwendet werden, um algebraische Ausdrücke wie <emphasis>x + x^2 = 4</emphasis> oder die Frage <emphasis>Für welchen Wert von x ist die Formel x plus x zum Quadrat gleich 4 ?</emphasis> zu lösen.

source: For this example you could enter <userinput>=A2+A2*A2</userinput> into A1 then either try different values in A2 until the result in A1 is as close as you wish to <emphasis>4</emphasis> or, preferably, use &sheets;'s <guimenuitem>Goal Seek...</guimenuitem> feature which automatically adjusts the value in one cell to try to make the value in another cell as close as possible to a target value.
de: Für dieses Beispiel könnten Sie <userinput>=A2+A2*A2</userinput> in A1 eingeben und dann entweder unterschiedliche Werte in A2 eingeben, bis das Resultat in A1 so nahe an <emphasis>4</emphasis> ist, wie Sie es wünschen, oder Sie nutzen vorzugsweise &sheets;s <guimenuitem>Zielwertsuche ...</guimenuitem>, die automatisch den Wert in einer Zelle verändert, um zu versuchen, den Wert in einer anderen Zelle so nahe wie möglich an seinen Zielwert anzunähern.

source: It is invoked by selecting <guimenuitem>Goal Seek...</guimenuitem> from the <guimenu>Data</guimenu> menu. This brings up a dialog box in which you should enter the reference of the target value cell (<userinput>A1</userinput> in this case) into the <guilabel>Set cell:</guilabel> box, the target value itself (<userinput>4</userinput>) into the <guilabel>To value:</guilabel> box and the reference of the cell that is to be changed (<userinput>A2</userinput>) into the <guilabel>By changing cell:</guilabel> box. Note that you need to have entered some initial value into the cell that is to be changed before starting <guimenuitem>Goal Seek</guimenuitem>.
de: Die Zielwertsuche starten Sie mit <guimenuitem>Zielwertsuche ...</guimenuitem> im Menü <guimenu>Daten</guimenu>.Damit öffnen Sie einen Dialog, in dem Sie die Adresse der Zielwertzelle (<userinput>A1</userinput> in diesem Fall) in das Feld <guilabel>Setze Zelle:</guilabel> eintragen. Den Zielwert selbst (<userinput>4</userinput>) tragen Sie dann in das Feld <guilabel>Auf Wert:</guilabel>ein und die Adresse der zu verändernden Zelle (<userinput>A2</userinput>) in das Feld <guilabel>Durch Änderung von Zelle;</guilabel>.Beachten Sie, dass Sie einen Ausgangswert in die Zelle eingetragen haben müssen, die angepasst werden soll, bevor Sie die <guimenuitem>Zielwertsuche</guimenuitem> starten.

source: Pressing the <guibutton>OK</guibutton> button will start the calculation. When it finishes and if it has found a solution press the <guibutton>OK</guibutton> button to accept the result or <guibutton>Cancel</guibutton> to keep the original value.
de: Wenn Sie den Knopf <guibutton>OK</guibutton> drücken, wird die Berechnung gestartet. Wenn sie beendet ist und einen Zielwert gefunden hat, drücken Sie den Knopf <guibutton>OK</guibutton>, um das Ergebnis zu übernehmen. Oder drücken Sie auf <guibutton>Abbrechen</guibutton>, um den ursprünglichen Wert zu behalten.

source: Pivot Tables
de: Pivot-Tabellen
