Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/calligra/sheets_format.po
Languages: de

source: If this box is checked the cell reference shown at the left end of the Formula Bar will be displayed in LC mode (i.e. L2C3) rather than in its normal form B3. This does not seem to be of much use at the moment.
de: Ist diese Einstellung aktiviert, wird der Zellenverweis am linken Ende der Formelleiste im LC-Modus (z. B. L2C3) und nicht in seiner normalen Form angezeigt. Diese Einstellung wird selten verwendet.

source: Convert first letter to uppercase
de: Ersten Buchstaben groß schreiben

source: Check this box and the first letter of any text you type in will automatically be converted to uppercase.
de: Ist diese Einstellung aktiviert, wird der erste Buchstabe jedes Textes automatisch groß geschrieben.

source: Show grid
de: Gitter anzeigen

source: If checked the grid (the cell limits) will be shown. This is default. If you uncheck it, the grid will be hidden.
de: Ist diese Einstellung aktiviert, wird das Gitter (die Ränder der Zellen) angezeigt. Dies ist die Standardeinstellung. Um das Gitter auszublenden, deaktivieren Sie diese Einstellung.

source: Show page borders
de: Seitenränder anzeigen

source: If you check this option, the page borders will be drawn on your current sheet. Per default the page borders are not displayed. It is useful to see the page borders if you want to print your sheet.
de: Ist diese Einstellung aktiviert, werden die Seitenränder in Ihrer aktuellen Tabelle angezeigt. Standardmäßig sind sie ausgeblendet. Das Anzeigen der Seitenränder ist nützlich, wenn Sie Ihre Tabelle drucken wollen.

source: Show formula
de: Formel anzeigen

source: If this box is checked &sheets; will display the actual formulae in cells rather than the results.
de: Ist diese Einstellung aktiviert, werden Formeln anstelle der Ergebnisse in den Zellen angezeigt.

source: Show formula indicator
de: Formelmarkierung anzeigen

source: If this box is checked &sheets; will display a small blue triangle at the bottom left corner of cells containing formulae. This is useful if you want to protect cells with formulae.
de: Ist diese Einstellung aktiviert, werden Zellen mit einer Formel mit einem kleinen blauen Dreieck in der linken oberen Ecke markiert. Dies hilft Ihnen, Zellen mit Formeln zu schützen.

source: Show comment indicator
de: Kommentarmarkierung anzeigen

source: If this box is checked cells containing comments will be marked by a small red triangle at the top right corner.
de: Ist diese Einstellung aktiviert, werden Zellen mit einem Kommentar mit einem kleinen roten Dreieck in der rechten oberen Ecke markiert.
