Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/calligra/sheets_advanced.po
Languages: de

source: In the <guilabel>Criteria</guilabel> page select what type of data is to be considered valid from the <guilabel>Allow:</guilabel> combo box list then define the valid range of values by choosing one of the options in the <guilabel>Data:</guilabel> combo box and entering suitable value(s) into one or both of the edit box(es).
de: Auf der Seite <guilabel>Kriterien</guilabel>wählen Sie im Auswahlfeld <guilabel>Zulassen:</guilabel> den Datentyp aus, der als gültig betrachtet werden soll. Dann wählen Sie den gültigen Wertebereich im Auswahlfeld <guilabel>Daten:</guilabel> und geben passende Werte in eine oder beide der Bearbeitungsfelder ein.

source: When you have done this change to the <guilabel>Error Alert</guilabel> tab. Here you can choose the type of message box (<guimenuitem>Stop</guimenuitem>, <guimenuitem>Warning</guimenuitem> or <guimenuitem>Information</guimenuitem>) that will appear when an invalid value is entered, and define the message box title and message text.
de: Wenn Sie damit fertig sind, wechseln Sie zur Karteikarte <guilabel>Fehlerbenachrichtigung</guilabel>. Hier können Sie die Art der Fehlerbenachrichtigung (<guimenuitem>Anhalten</guimenuitem>, <guimenuitem>Warnung</guimenuitem> oder <guimenuitem>Information</guimenuitem>) wählen, die erscheint, wenn ein unzulässiger Wert eingegeben wurde, und Sie können hier den Titel des Benachrichtigungsfensters und den Text der Benachrichtigung festlegen.

source: Note that this feature only checks data that you enter into the cell, for a way of checking the results from formulae cells see the <link linkend="formatdata">Conditional Cell Attributes</link> section of this Handbook.
de: Beachten Sie, dass diese Funktion nur Daten überprüft, die Sie in die Zelle eingeben. Eine Möglichkeit zur Überprüfung der Werte von Formelzellen finden Sie im Abschnitt <link linkend="formatdata">bedingte Zellenattribute</link> in diesem Handbuch.

source: Protection
de: Schutz

source: Document Protection
de: Ein Dokument schützen

source: Protecting the document means that without the password a user cannot add or delete sheets. Document protection does not protect cells.
de: Schutz des Dokuments bedeutet, das ein Benutzer keine Tabellen einfügen oder löschen kann. Die Zellen in einem geschützten Dokument sind nicht geschützt.

source: Select <menuchoice><guimenu>Tools</guimenu><guimenuitem>Protect Document...</guimenuitem></menuchoice> A dialog appears asking you for a password. The <guilabel>Password:</guilabel> strength meter indicates if your password is secure enough. The longer the indicator is, the more secure your password.
de: Wählen Sie <menuchoice><guimenu>Extras</guimenu><guimenuitem>Dokument schützen ...</guimenuitem></menuchoice>. Damit öffnen Sie einen Dialog zur Eingabe des Passwortes. Der <guilabel>Passwortstärkeanzeiger</guilabel> zeigt Ihnen, ob Ihr Passwort sicher genug ist. Je länger der angezeigte Balken, desto sicherer ist das Passwort.

source: The Protect Document dialog
de: Der Dialog Dokument schützen

source: That password will then be required to unprotect the document.
de: Diese Passwort brauchen Sie, um den Schutz des Dokuments wieder aufzuheben.

source: The Unprotect Document dialog
de: Der Dialog Dokumentschutz aufheben

source: When a document is protected, you may not:
de: Wenn ein Dokument geschützt ist, können Sie nicht:

source: Rename a sheet
de: Eine Tabelle umbenennen

source: Insert a sheet
de: Eine Tabelle einfügen

source: Remove a sheet
de: Eine Tabelle löschen

source: Hide a sheet
de: Eine Tabelle ausblenden

source: Show a sheet
de: Eine Tabelle einblenden

source: See the sheet properties
de: Die Eigenschaften der Tabelle anzeigen

source: Merge or dissociate cells
de: Zellen verbinden oder trennen

source: Sheet protection
de: Tabellen schützen

source: Protecting a sheet means protecting the contents of all protected cells and objects on a sheet. Individual cells or a selection of cells can be unprotected within a protected sheet, see <link linkend="cell-protection">next section</link>.
de: Der Schutz einer Tabelle schaltet den Schutz für den Inhalt aller geschützten Zellen und Objekte ein. Einzelne Zellen oder Zellenbereiche in einer geschützten Tabelle können trotzdem ungeschützt sein, siehe das <link linkend="cell-protection">nächste Kapitel</link>.

source: To protect a sheet, select <menuchoice><guimenu>Tools</guimenu><guimenuitem>Protect Sheet...</guimenuitem></menuchoice>. A dialog appears asking you for a password. The <guilabel>Password</guilabel> strength meter indicates if your password is secure enough. The longer the indicator is, the more secure will be your password.
de: Um eine Tabelle zu schützen, wählen Sie <menuchoice><guimenu>Extras</guimenu><guimenuitem> Tabelle schützen ...</guimenuitem></menuchoice>. Damit öffnen Sie einen Dialog zur Eingabe des Passwortes. Der <guilabel>Passwortstärkeanzeiger</guilabel> zeigt Ihnen, ob Ihr Passwort sicher genug ist. Je länger der angezeigte Balken, desto sicherer ist das Passwort.

source: That password will then be required to unprotect the sheet.
de: Diese Passwort brauchen Sie, um den Schutz der Tabelle wieder aufzuheben.

source: When a sheet is protected, you may not:
de: Wenn eine Tabelle geschützt ist, können Sie nicht:

source: Insert any object or chart
de: Ein Objekt oder Diagramm einfügen

source: Format any cell
de: Eine Zelle formatieren

source: Insert a row or a column
de: Eine Zeile oder Spalte einfügen

source: Edit and change cell content
de: Den Inhalt einer Zelle bearbeiten und ändern

source: Change any content in the sheet
de: Den Inhalt einer Tabelle ändern

source: Protecting a sheet is especially useful for preventing accidental erasure of formulae.
de: Der Schutz einer Tabelle ist besonders sinnvoll, um das unbeabsichtigte Löschen von Formeln zu verhindern.

source: Cell or selected cells protection
de: Schutz von Zellen und Zellenbereichen

source: Cell protection is active for all cells by default and is effective when you enable sheet protection. So if you keep the default and if you protect the sheet, all cells will be protected.
de: Zellenschutz ist in der Voreinstellung für alle Zellen eingeschaltet und wird dann wirksam, wenn Sie die Tabelle schützen. Wenn Sie die Voreinstellung nicht ändern und die Tabelle schützen, sind alle Zellen geschützt.

source: If you want only certain cells to be protected, this default protection must be turned off for all other cells. For example you might want most cells to accept user input so you will uncheck <guilabel>Protected</guilabel> for those and choose to keep protected cells that should stay unchanged (such as titles). So you need 3 steps in order to protect only some cells: unprotect all the cells, select the cells to protect and protect them and then protect the whole sheet.
de: Wollen Sie nur bestimmte Zellen schützen, muss der als Standard eingestellte Schutz für alle anderen Zellen ausgeschaltet werden. Wollen Sie den Benutzern zum Beispiel die Eingabe in die meisten Zellen erlauben, müssen Sie die Eigenschaft <guilabel>Geschützt</guilabel> für diese Zellen ausschalten und für die übrigen Zellen, die nicht geändert werden sollen, den Zellenschutz einschalten. Das erfordert drei Schritte: Schutz für alle Zellen aufheben, die zu schützenden Zellen auswählen und dafür den Schutz aktivieren und dann die gesamte Tabelle schützen.

source: To unprotect all the cells:
de: Um den Schutz für alle Zellen aufzuheben:

source: Select the entire spreadsheet with the mouse.
de: Wählen Sie die gesamte Tabelle mit dem Mauszeiger.

source: In the menubar, select <menuchoice><guimenu>Format</guimenu><guimenuitem>Cell Format...</guimenuitem></menuchoice>.
de: Wählen Sie in der Menüleiste <menuchoice><guimenu>Format</guimenu> <guimenuitem>Zellenformat ...</guimenuitem></menuchoice>.

source: In the dialog that appears, go to the <guilabel>Cell Protection</guilabel> tab.
de: Öffnen Sie dann im Dialog die Seite <guilabel>Zellenschutz</guilabel>.

source: Check <guilabel>Hide all</guilabel> and uncheck <guilabel>Protected</guilabel> to remove the protection on all cells. The cells are now all unprotected.
de: Wählen Sie <guilabel>Alles ausblenden</guilabel> und wählen Sie <guilabel>Geschützt</guilabel> ab, um den Schutz aller Zellen zu entfernen. Alle Zellen sind jetzt nicht mehr geschützt.

source: To protect a range of selected cells or a selection of non-contiguous cells:
de: Um einen Zellenbereich oder einen Bereich nicht-zusammenhängender Zellen zu schützen:

source: Highlight the range of cells that are to be protected or use the <keycombo action="simul">&Ctrl;</keycombo> key to select non-contiguous cells.
de: Wählen einen Bereich von Zellen, die geschützt werden sollen, oder benutzen Sie die Taste <keycombo action="simul">&Ctrl;</keycombo>, um nicht-zusammenhängende Zellen auszuwählen.

source: When all of the desired cells are selected, go to the <menuchoice><guimenu>Format</guimenu><guimenuitem>Cell Format...</guimenuitem></menuchoice> menu.
de: Wenn Sie alle gewünschten Zellen ausgewählt haben, wählen Sie <menuchoice> <guimenu>Format</guimenu> <guimenuitem>Zellenformat ...</guimenuitem></menuchoice>.

source: Click on the box next to <guilabel>Protected</guilabel> then click on <guibutton>OK</guibutton>.
de: Klicken Sie auf der Seite <guilabel>Zellenschutz</guilabel> auf <guilabel>Geschützt</guilabel> und dann auf <guibutton>OK</guibutton>.

source: Once the cells are marked for protection, the protection option must be enabled at the sheet level, that means you must protect the entire sheet for the cell to be effectively protected:
de: Wenn der Schutz für alle gewünschten Zellen ausgewählt ist, muss die gesamte Tabelle geschützt werden, damit die gewählten Zellen tatsächlich geschützt sind:

source: Select <menuchoice><guimenu>Tools</guimenu><guimenuitem>Protect Sheet...</guimenuitem></menuchoice>.
de: Wählen Sie <menuchoice><guimenu>Extras</guimenu> <guimenuitem>Tabelle schützen ...</guimenuitem></menuchoice>.

source: In the dialog that appears, provide a safe password, then confirm it by typing it again. Click on <guibutton>OK</guibutton>.
de: Im Dialog geben Sie ein sicheres Passwort ein und bestätigen Sie es durch eine zweite Eingabe. Dann Klicken Sie auf <guibutton>OK</guibutton>.

source: Protected cells in a protected sheet cannot be edited without unprotecting the whole sheet, and any sheet changes are disabled. For example, no one can insert rows or columns, change column width, or create embedded charts.
de: Geschützte Zellen in einer geschützten Tabellen können nicht ohne Aufhebung des Schutzes für die gesamte Tabelle bearbeitet werden, außerdem sind keine Änderungen in der Tabelle möglich. Sie können zum Beispiel keine Zeilen oder Spalten einfügen, die Breite von Spalten ändern oder eingebettete Diagramme erstellen.

source: Hide cell formula
de: Zellenformeln ausblenden

source: You might want to hide your formulae so other people cannot see them. By default, every cell is protected and not hidden. But it is important to remember that these attributes have no effect unless the sheet itself is protected.
de: Sie können Ihre Formeln ausblenden, sodass Sie von anderen nicht gelesen werden können. In der Standardeinstellung ist jede Zelle geschützt, wird aber nicht ausgeblendet. Denken Sie aber daran, das diese Einstellungen wirkungslos sind, solange die Tabelle selbst nicht geschützt ist.

source: A default cell with a formula
de: Eine Standardzelle mit einer Formel

source: To hide cell formulae, select the appropriate cell or range of cells or non-contiguous cells with <keycombo action="simul">&Ctrl;</keycombo> and then choose the <menuchoice><guimenu>Format</guimenu><guimenuitem>Cell Format...</guimenuitem></menuchoice> menu. In the Cell format dialog, click the <guilabel>Cell Protection</guilabel> tab and select <guilabel>Hide formula</guilabel>. After you protect the sheet, the results of the formulae will be visible, but the formulae will not.
de: Um Formeln in Zellen auszublenden, wählen Sie die gewünschte Zelle oder nicht-zusammenhängende Zellen mit <keycombo action="simul">&Ctrl;</keycombo> und dann im Menü <menuchoice><guimenu>Format</guimenu><guimenuitem> Zellenformat ...</guimenuitem></menuchoice>. Gehen Sie im Dialog Zellenformat zur Seite <guilabel>Formel Ausblenden</guilabel>. Wenn Sie dann die Tabelle schützen, wird das Ergebnis der Berechnung angezeigt, nicht aber die Formel selbst.

source: You have now to protect the sheet: choose <menuchoice><guimenu>Tools</guimenu><guimenuitem>Protect Sheet...</guimenuitem></menuchoice> to display the <guilabel>Protect Sheet</guilabel> dialog box. Enter a safe password twice to prevent others from unprotecting the sheet.
de: Jetzt müssen Sie noch die Tabelle schützen: Wählen Sie <menuchoice> <guimenu>Extras</guimenu> <guimenuitem>Tabelle schützen ...</guimenuitem> </menuchoice>, um den Dialog <guilabel>Tabellenschutz</guilabel> anzuzeigen. Geben Sie hier ein sicheres Passwort zweimal ein, um zu verhindern, das andere den Schutz der Tabelle aufheben können.

source: When <guilabel>Hide formula</guilabel> is enabled and <guilabel>Protected</guilabel> is disabled, the formula is hidden after protecting the sheet but the cell content can be changed.
de: Wenn Sie <guilabel>Formel Ausblenden</guilabel> aktiviert haben, <guilabel>Geschützt</guilabel> aber nicht, wird die Formel nach Schutz der Tabelle ausgeblendet, aber Sie können den Inhalt der Zelle ändern.

source: <guilabel>Hide formula</guilabel> is enabled but the cell is not protected and the sheet is protected
de: <guilabel>Formel Ausblenden</guilabel> ist aktiviert, aber die Zelle ist nicht geschützt, und die Tabelle ist geschützt

source: When <guilabel>Hide formula</guilabel> and <guilabel>Protected</guilabel> are enabled, the formula is hidden after protecting the sheet and the cell content cannot be changed.
de: Wenn Sie <guilabel>Formel Ausblenden</guilabel> und <guilabel>Geschützt</guilabel> aktiviert haben, wird die Formel nach Schutz der Tabelle ausgeblendet und Sie können den Inhalt der Zelle nicht ändern.

source: <guilabel>Hide formula</guilabel> and <guilabel>Protected</guilabel> are enabled in <guilabel>Cell Protection</guilabel> and the sheet is protected
de: <guilabel>Formel Ausblenden</guilabel> und <guilabel>Geschützt</guilabel> sind auf der Seite <guilabel>Zellenschutz</guilabel> aktiviert und die Tabelle ist geschützt

source: Keep in mind that it is very easy to break the password for a protected sheet so if you are looking for real security, this is not the best solution.
de: Denken Sie daran, das es sehr leicht ist, das Passwort für eine geschützte Tabelle zu knacken, für wirkliche Sicherheit brauchen Sie ein besseres Konzept.

source: Hide all in the cell
de: Formel und Ergebnis ausblenden

source: You can hide both the formula and the content of the cell by choosing <guilabel>Hide all</guilabel> in the Cell Protection tab in the <menuchoice><guimenu>Format</guimenu><guimenuitem>Cell Format...</guimenuitem></menuchoice> menu. In the screenshot below, the cell itself is not protected (<guilabel>Protected</guilabel> is unchecked) thus the cell content can be changed.
de: Sie können sowohl die Formel als auch den Inhalt einer Zelle ausblenden, indem Sie <guilabel>Alles ausblenden</guilabel> auf der Seite Zellenschutz des Dialogs auswählen, den Sie mit <menuchoice> <guimenu>Format</guimenu> <guimenuitem>Zellenformat ...</guimenuitem></menuchoice> öffnen. Im Bildschirmfoto unten ist die Zelle selbst nicht geschützt (<guilabel>Geschützt</guilabel> ist nicht aktiviert), daher können Sie den Inhalt der Zelle ändern.

source: <guilabel>Hide all</guilabel> only is enabled (no cell protection) and the sheet is protected
de: Nur <guilabel>Alles ausblenden</guilabel> ist aktiviert (kein Zellenschutz) und die Tabelle ist geschützt

source: Here the cell itself is protected so it cannot be overwritten.
de: Dann ist die Zelle selbst geschützt und kann nicht überschreiben werden.

source: <guilabel>Hide all</guilabel> and <guilabel>Protected</guilabel> are enabled in Cell Protection and the sheet is protected
de: <guilabel>Alles ausblenden</guilabel> und <guilabel>Geschützt</guilabel> sind aktiviert und auch die Tabelle ist geschützt

source: Other Features
de: Andere Funktionen

source: Named Cells and Areas
de: Benannte Zellen und Zellenbereiche

source: You can give a name such as <userinput>foo</userinput> to a cell or to any area of a sheet by selecting the cell or area then selecting <guimenuitem> Area Name...</guimenuitem> from the <mousebutton>right</mousebutton> mouse button menu. This will bring up the <guilabel>Area Name</guilabel> dialog box where you can enter any name you wish.
de: Sie können einer Zelle oder irgendeinem Bereich eines Blattes einen Namen wie <userinput>Toller Name</userinput> geben, indem Sie die Zelle oder den Bereich auswählen und dann <guimenuitem>Bereichsname ...</guimenuitem> im Kontextmenü der <mousebutton>rechten</mousebutton> Maustaste wählen. Das öffnen Sie den Dialog <guilabel>Bereichsname</guilabel>, in dem Sie einen beliebigen Namen eintragen können.

source: You can also name a cell or area by selecting it then typing the name into the small text box at the left end of the Formula toolbar, overwriting the cell reference that normally appears here.
de: Sie können eine Zelle oder einen Bereich auch benennen, indem Sie erst einen Bereich auswählen und dann den gewünschten Namen in das Adressfeld links neben dem Formeleingabefeld eingeben und damit die Zellenadresse überschreiben, die normalerweise dort steht.

source: If you enter a name that has already been used into this text box &sheets;'s selection will change to show the named cell(s).
de: Wenn Sie hier einen Namen eingeben, der bereits verwendet wird, ändert sich &sheets;s Auswahlmarkierung so, dass die entsprechenden Zellen markiert und angezeigt werden.

source: The <menuchoice><guimenu>Data</guimenu><guimenuitem>Named Areas...</guimenuitem> </menuchoice> option will give you a list of existing names and let you change &sheets;'s focus to any of them or let you remove a name.
de: <menuchoice><guimenu>Daten</guimenu> <guimenuitem>Benannte Bereiche</guimenuitem></menuchoice> zeigt Ihnen eine Liste der vorhandenen Namen. Sie können den Cursor in &sheets; dann zu einem der benannten Bereiche bewegen oder Bereichsnamen bearbeiten und entfernen.

source: Named cells are particularly useful in formulae as an alternative to <link linkend="absolute"> absolute cell references</link> as the names can be used in place of normal cell references and do not change when the cell containing the formula is copied. When a name is used in this way it should be enclosed in single quotation marks.
de: Benannte Zellen sind in Formeln besonders nützlich als eine Alternative zu <link linkend="absolute">absoluten Zellenverweisen</link>, da die Namen anstatt der normalen Zellenverweise verwendet werden können und nicht geändert werden, wenn die Zelle, die die Formel enthält, kopiert wird. Wenn ein Name auf diese Art verwendet wird, sollte er in einfachen Anführungszeichen eingeschlossen werden.

source: For example, if cell A1 has been given the name <userinput>fred </userinput> then you can enter a formula such as <userinput>='fred' + 2 </userinput> into another cell which would always give the result of adding 2 to the value in A1 no matter where the formula cell was copied to.
de: Z. B. wenn Sie Zelle A1 den Namen <userinput>Fred</userinput> gegeben haben, dann können Sie eine Formel wie <userinput>= 'Fred' + 2</userinput> in eine andere Zelle eingeben, die immer das Resultat des Hinzufügens von 2 zu dem Wert in A1 ergibt, egal wohin die Formelzelle kopiert wird.

source: Note that cell and area names are treated as being in lowercase.
de: Beachten Sie dass Zellen- und Bereichsnamen so behandelt werden als seien sie in Kleinbuchstaben geschrieben.

source: Cell Comments
de: Zellenkommentare

source: A cell can contain a text comment that can be viewed when working on the spreadsheet but which is not printed and not normally seen.
de: Eine Zelle kann einen Textkommentar enthalten, der beim Arbeiten mit der Tabelle angesehen werden kann, der aber nicht gedruckt und normalerweise nicht angezeigt wird.

source: To add a comment select the cell and choose <guimenuitem>Comment...</guimenuitem> from the <mousebutton>right</mousebutton> mouse button menu or from the <guimenu>Insert</guimenu> menu and type your comment into the resulting <guilabel>Cell Comment</guilabel> dialog box.
de: Um einen Kommentar einzugeben, wählen Sie die Zelle aus und wählen Sie <guimenuitem>Kommentar ...</guimenuitem> aus dem Kontextmenü der <mousebutton>rechten</mousebutton> Maustaste oder aus dem Menü <guimenu>Einfügen</guimenu> und geben Sie Ihren Kommentar im Dialog <guilabel>Zellenkommentar</guilabel> ein.

source: To see the comment hover the mouse pointer over the cell. The comment will appear as if it were a Tooltip.
de: Um sich den Kommentar anzeigen zu lassen, bewegen Sie den Mauszeiger über die Zelle. Die Kommentar erscheint dann genau wie eine Kurzinfo.

source: If you check the <guilabel>Show comment indicator</guilabel> box of the <guilabel>Sheet Properties</guilabel> dialog, those cells containing comments will be highlighted by a small red triangle in the top right corner.
de: Wenn Sie <guilabel>Kommentarmarkierung anzeigen</guilabel> im Dialog <guilabel>Tabellen-Eigenschaften</guilabel> auswählen, werden alle Zellen, die einen Kommentar enthalten, durch ein kleines rotes Dreieck in der rechten oberen Ecke gekennzeichnet.

source: To open this dialog, click with the <mousebutton>right</mousebutton> mouse button onto the sheet tab at the bottom of the main window and select <guimenuitem>Sheet Properties</guimenuitem> from the popup menu. Or select it from the <menuchoice><guimenu>Format</guimenu><guisubmenu>Sheet</guisubmenu></menuchoice> menu.
de: Um diesen Dialog zu öffnen, klicken Sie mit der <mousebutton>rechten</mousebutton> Maustaste auf den Karteikartenreiter der Tabelle unten im Hauptfenster und wählen <guimenuitem>Tabellen-Eigenschaften</guimenuitem> aus dem Kontextmenü. Oder wählen Sie diesen Eintrag aus dem Menü <menuchoice><guimenu>Format</guimenu> <guisubmenu>Tabelle</guisubmenu></menuchoice>.

source: To remove a comment from a cell, select <guimenuitem>Remove Comment</guimenuitem> from the <mousebutton>right</mousebutton> mouse button menu or choose <menuchoice><guimenu>Edit</guimenu><guisubmenu>Clear</guisubmenu> <guimenuitem>Comment</guimenuitem></menuchoice>.
de: Um einen Kommentar aus einer Zelle zu entfernen, wählen Sie <guimenuitem>Kommentar entfernen</guimenuitem> im Kontextmenü der <mousebutton>rechten</mousebutton> Maustaste oder wählen Sie <menuchoice><guimenu>Bearbeiten</guimenu><guisubmenu>Löschen</guisubmenu><guimenuitem>Kommentar</guimenuitem></menuchoice>.
