Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/calligra/sheets_commands.po
Languages: de

source: <guimenu>Data</guimenu> <guimenuitem>Sort...</guimenuitem>
de: <guimenu>Daten</guimenu><guimenuitem>Sortieren ...</guimenuitem>

source: <action>Sort data in selected cells.</action> See the section <link linkend="sort">Sorting Data</link> for more details.
de: <action>Sortiert die Daten in ausgewählten Zellen.</action> Im Abschnitt <link linkend="sort">Daten sortieren</link> finden Sie dazu ausführliche Informationen.

source: <guimenu>Data</guimenu> <guimenuitem>Text to Columns...</guimenuitem>
de: <guimenu>Daten</guimenu><guimenuitem>Text auf Spalten aufteilen ...</guimenuitem>

source: This option attempts to interpret text in the selected cell(s) as <acronym>CSV</acronym> data, placing each item into a different cell in the row.
de: Diese Option versucht Text in den ausgewählten Zellen als <acronym>CSV</acronym>-Daten zu interpretieren und platziert jedes Element in einer anderen Zelle der Zeile.

source: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>G</keycap></keycombo> </shortcut> <guimenu>Data</guimenu> <guimenuitem>Named Areas...</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>G</keycap></keycombo> </shortcut> <guimenu>Daten</guimenu> <guimenuitem>Benannte Bereiche ...</guimenuitem>

source: <action>Open</action> the <guilabel>Named Areas</guilabel> dialog to select, add, edit and remove named areas. See the section <link linkend="namedareas">Named Cells and Areas</link> for further details.
de: <action>Öffnet</action> den Dialog <guilabel>Benannte Bereiche</guilabel>, um diese hinzuzufügen, zu bearbeiten oder zu löschen. Im Abschnitt <link linkend="namedareas"> Benannte Zellen und Zellenbereiche</link> finden Sie dazu weitere Informationen.

source: <guimenu>Data</guimenu> <guimenuitem>Consolidate...</guimenuitem>
de: <guimenu>Daten</guimenu><guimenuitem>Zusammenfassen ...</guimenuitem>

source: <action>Consolidate data.</action> See the section <link linkend="consolidate">Consolidating Data</link> for more details.
de: <action>Fasst Daten zusammen.</action> Im Abschnitt <link linkend="consolidate">Daten zusammenfassen</link> finden Sie dazu ausführliche Informationen.

source: <guimenu>Data</guimenu> <guimenuitem>Subtotals...</guimenuitem>
de: <guimenu>Daten</guimenu> <guimenuitem>Zwischensummen ...</guimenuitem>

source: Create different kinds of subtotals to a database.
de: Erstellt verschiedene Arten von Teilsummen in einer Datenbank.

source: <guimenu>Data</guimenu> <guimenuitem>Validity...</guimenuitem>
de: <guimenu>Daten</guimenu> <guimenuitem>Gültigkeit ...</guimenuitem>

source: <action>Set or modify the error checking criteria and error alert message for selected cell(s).</action> See <link linkend="validcheck"> Validity Checking</link> for more details.
de: <action>Stellen Sie die Fehlerprüfungskriterien und Fehlermeldungen für ausgewählte Zellen ein oder ändern Sie diese.</action> Im Abschnitt <link linkend="validcheck">Gültigkeitsprüfung</link> finden Sie dazu weitere Einzelheiten.

source: <guimenu>Data</guimenu> <guimenuitem>Goal Seek...</guimenuitem>
de: <guimenu>Daten</guimenu><guimenuitem>Zielwertsuche ...</guimenuitem>

source: <action>Open the Goal Seek dialog box</action>. See <link linkend="goalseek">Goal Seeking</link> for details.
de: <action>Öffnet den Dialog Zielwertsuche</action>. Im Abschnitt <link linkend="goalseek">Zielwertsuche</link> finden Sie dazu ausführliche Informationen.

source: <guimenu>Data</guimenu> <guimenuitem>Pivot...</guimenuitem>
de: <guimenu>Daten</guimenu><guimenuitem>Pivot ...</guimenuitem>

source: <action>Open the Pivot Table configuration dialog</action>. See <link linkend="pivottable">Pivot Table</link> for details.
de: <action>Öffnet den Einrichtungsdialog Pivot-Tabelle</action>. Im Abschnitt <link linkend="goalseek">Pivot-Tabelle</link> finden Sie dazu ausführliche Informationen.

source: The Tools Menu
de: Das Menü Extras

source: <guimenu>Tools</guimenu> <guimenuitem>Spelling...</guimenuitem>
de: <guimenu>Extras</guimenu><guimenuitem>Rechtschreibung ...</guimenuitem>

source: Check spelling of words in the worksheet.
de: Überprüft die Rechtschreibung von Wörtern in der Tabelle.

source: <guimenu>Tools</guimenu> <guimenuitem>Custom Lists...</guimenuitem>
de: <guimenu>Extras</guimenu><guimenuitem>Benutzerdefinierte Listen ...</guimenuitem>

source: View or amend the special series of words recognized by &sheets;. These list can be used to insert special <link linkend="series">series</link> into the worksheet.
de: In &sheets;definierte Wortreihen werden angezeigt und können im Dialog geändert werden. Diese Wortlisten können dann als <link linkend="series">Serien</link> in das Dokument eingefügt werden.

source: <guimenu>Tools</guimenu> <guimenuitem>Protect Sheet...</guimenuitem>
de: <guimenu>Extras</guimenu> <guimenuitem>Tabelle schützen ...</guimenuitem>

source: Protect the sheet with a password. A dialog pops up prompting you for a password. Unchecking this option will prompt you for the password in order to unprotect the sheet. Protecting a sheet means protecting all cells in the sheet. In a protected sheet, the cells cannot be reformatted or overwritten.
de: Schützt die Tabelle mit einem Password. Dieses Password geben Sie in einem Dialog ein. Deaktivieren Sie diese Eigenschaft, müssen Sie wieder das Passwort eingeben, um den Schutz der Tabelle aufzuheben. In einer geschützten Tabelle sind alle darin enthaltenen Zellen geschützt. In einer geschützten Tabelle können Sie Zellen weder neu formatieren noch überschreiben.

source: <guimenu>Tools</guimenu> <guimenuitem>Protect Document...</guimenuitem>
de: <guimenu>Extras</guimenu> <guimenuitem>Dokument schützen ...</guimenuitem>

source: Protect the whole document with a password. A dialog pops up prompting you for a password. Unchecking this option will prompt you for the password in order to unprotect the document. In a protected document you cannot rename or remove a sheet. Document protection does not mean that each individual sheet is protected.
de: Schützt das gesamte Dokument mit einem Password. Dieses Password geben Sie in einem Dialog ein. Deaktivieren Sie diese Eigenschaft, müssen Sie wieder das Passwort eingeben, um den Schutz für das Dokument aufzuheben. Tabellen in einem geschützten Dokument können Sie weder umbenennen noch verschieben. In einem geschützten Dokument sind die einzelnen Tabellen jedoch nicht geschützt.

source: <shortcut> <keycombo action="simul">&Shift;<keysym>F9</keysym></keycombo> </shortcut> <guimenu>Tools</guimenu> <guimenuitem>Recalculate Sheet</guimenuitem>
de: <shortcut><keycombo action="simul">&Shift;<keysym>F9</keysym></keycombo></shortcut> <guimenu>Extras</guimenu> <guimenuitem>Tabelle neu berechnen</guimenuitem>

source: Recalculate formulae in the current sheet.
de: Berechnet alle Formeln in der aktuellen Tabelle neu.

source: <shortcut> <keysym>F9</keysym> </shortcut> <guimenu>Tools</guimenu> <guimenuitem>Recalculate Document</guimenuitem>
de: <shortcut><keysym>F9</keysym></shortcut><guimenu>Extras</guimenu> <guimenuitem>Dokument neu berechnen</guimenuitem>

source: Recalculate all sheets.
de: Berechnet alle Tabellen im Dokument neu.

source: <guimenu>Tools</guimenu> <guimenuitem>Execute Script File...</guimenuitem>
de: <guimenu>Extras</guimenu> <guimenuitem>Skriptdatei ausführen ...</guimenuitem>

source: Execute the chosen external script in &sheets;. &sheets; supports scripting in JavaScript, Python and Ruby. Default examples of the scripts can be found in the <menuchoice><guimenu>Tools</guimenu><guisubmenu>Scripts</guisubmenu></menuchoice> submenu.
de: Führt das ausgewählte externe Skript in &sheets; aus. &sheets; unterstützt Skripte in den Programmiersprachen JavaScript, Python und Ruby. Standardbeispiele von Skripten finden Sie im Untermenü <menuchoice><guimenu>Extras</guimenu><guisubmenu>Skripte</guisubmenu></menuchoice>.

source: <guimenu>Tools</guimenu> <guisubmenu>Scripts</guisubmenu>
de: <guimenu>Extras</guimenu> <guisubmenu>Skripte</guisubmenu>

source: Here you can execute the script to export or import data in various formats, save your &sheets; log into file, use <ulink url="https://live.gnome.org/Orca">Orca speech</ulink> for accessibility, debug Python and Ruby scripts or add functions to display stock or weather condition values. You can even use some <ulink url="http://www.r-project.org/">R functions</ulink> (<ulink url="http://rpy.sourceforge.net/rpy.html">RPy module</ulink> should be installed).
de: Mit diesen Menüeinträgen können Sie Skripte zum Import oder Export von Daten in verschiedenen Formaten ausführen, Ihre Tabellen speichern, in Protokolldateien schreiben, <ulink url="https://live.gnome.org/Orca">Orca -Sprachausgabe</ulink> für Zugangshilfen, Python- und Ruyby-Skripte auf Fehler untersuchen oder Funktionen hinzufügen, um Aktienwerte oder Wetterbedingungen. Sie können außerdem auch einige <ulink url="http://www.r-project.org/">R-Funktionen</ulink> verwenden, wenn <ulink url="http://rpy.sourceforge.net/rpy.html">RPy-Module</ulink> installiert sind.

source: <guimenu>Tools</guimenu> <guimenuitem>Script Manager...</guimenuitem>
de: <guimenu>Extras</guimenu> <guimenuitem>Skriptverwaltung ...</guimenuitem>

source: <action>Opens</action> the <guilabel>Scripts Manager</guilabel> dialog to execute, load, unload, install, uninstall and get more scripts.
de: <action>Öffnet </action> den Dialog <guilabel>Skriptverwaltung</guilabel>, in dem Sie Skripte ausführen, laden, entladen, installieren, deinstallieren und weitere Skripte herunterladen können.

source: <guimenu>Tools</guimenu> <guimenuitem>Function Optimizer...</guimenuitem>
de: <guimenu>Extras</guimenu> <guimenuitem>Funktionsoptimierung ...</guimenuitem>

source: <action>Opens</action> the <guilabel>Function Optimizer</guilabel> dialog where you can choose an objective function cell, optimization target (<guilabel>Maximize</guilabel>, <guilabel>Minimize</guilabel> or enter the <guilabel>Value</guilabel>) and a set of decision parameter cells.
de: <action>Öffnet</action> den Dialog <guilabel>Funktionsoptimierung</guilabel>, in dem Sie eine Zelle und <guilabel>Maximieren</guilabel> oder <guilabel>Minimieren</guilabel> als Optimierungsziel auswählen oder den <guilabel>Wert</guilabel> und Parameter für eine Gruppe von Zellen auswählen können.

source: The Settings Menu
de: Das Menü Einstellungen

source: <guimenu>Settings</guimenu> <guisubmenu>Toolbars Shown</guisubmenu>
de: <guimenu>Einstellungen</guimenu> <guisubmenu>Angezeigte Werkzeugleisten</guisubmenu>

source: Show or hide the toolbars: <guilabel>File</guilabel>, <guilabel>Edit</guilabel>, <guilabel>Navigation</guilabel>, <guilabel>Font</guilabel>, <guilabel>Format</guilabel> and <guilabel>Color/Border</guilabel>.
de: Zeigt die Werkzeugleisten <guilabel>Datei</guilabel>, <guilabel>Bearbeiten</guilabel>, <guilabel>Navigation</guilabel>, <guilabel>Schriftart</guilabel>, <guilabel>Format</guilabel> und <guilabel>Farbe/Umrandung</guilabel> an oder blendet sie aus.

source: <guimenu>Settings</guimenu> <guimenuitem>Status Bar</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>Statusleiste</guimenuitem>

source: <action>Show or hide the Status Bar.</action> The Status Bar shows additional information for selected items and instant calculations of the selected cells.
de: <action>Zeigt die Statusleiste an oder blendet sie aus.</action> Die Statusleiste zeigt zusätzliche Informationen zu ausgewählten Elementen und aktuellen Berechnungen der ausgewählten Zellen an.

source: <guimenu>Settings</guimenu> <guimenuitem>Tab Bar</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>Tabellenleiste</guimenuitem>

source: <action>Show or hide the Tab Bar.</action> All Sheets of the current Document can be accessed through the Tab Bar.
de: <action>Zeigt die Tabellenleiste an oder blendet sie aus.</action> Alle Tabellen des aktuellen Dokuments können Sie über die Tabellenleiste erreichen.

source: <guimenu>Settings</guimenu> <guimenuitem>Configure Shortcuts...</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>Kurzbefehle festlegen ...</guimenuitem>

source: <action>Configure the keyboard shortcuts used by &sheets;. </action> See the section on <link linkend="configshort">configuring shortcuts </link> for more details.
de: <action>Legen Sie die Tastaturkurzbefehle fest, die von &sheets; verwendet werden.</action> Im Abschnitt <link linkend="configshort">Kurzbefehle</link> finden Sie dazu ausführliche Informationen.

source: <guimenu>Settings</guimenu> <guimenuitem>Configure Toolbars...</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>Werkzeugleisten einrichten ...</guimenuitem>

source: <action>Configure the toolbars.</action> The section on <link linkend="configtoolbars">configuring toolbars</link> has more information.
de: <action>Richten Sie hier die Werkzeugleisten von &sheets; ein.</action> Im Abschnitt <link linkend="configtoolbars">Werkzeugleisten einrichten</link> finden Sie dazu weitere Informationen.

source: <guimenu>Settings</guimenu> <guimenuitem>Themes</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>Designs</guimenuitem>

source: <action>Choose the color theme for &sheets; window.</action> You can choose one of the predefined color schemes or select <guimenuitem>Configuration...</guimenuitem> to open <ulink url="help:/kcontrol/colors">&systemsettings; color selection module</ulink>.
de: <action>Auswahl des Farbdesigns für das &sheets;-Fenster.</action> Sie können eines der vordefinierten Farbschemata auswählen oder mit <guimenuitem>Einrichtung ...</guimenuitem> das <ulink url="help:/kcontrol/colors">Modul Farben der &systemsettings;</ulink> öffnen.

source: <guimenu>Settings</guimenu> <guimenuitem>Active Author Profile</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>Aktives Autorprofil</guimenuitem>

source: <action>Configure the author profile for the current document.</action> You can choose one of the profiles defined using <link linkend="configauthor">&sheets; configuration window</link>, <guimenuitem>Default Author Profile</guimenuitem> as defined by &systemsettings; data or blank <guimenuitem>Anonymous</guimenuitem> profile which can ensure your privacy.
de: <action>Stellt das Autorprofil für das aktuelle Dokument ein.</action> Hier kann eines der im <link linkend="configauthor">Einrichtungsdialog von &sheets;</link> definiertes Profil, <guimenuitem>Standard-Autorprofil</guimenuitem> definiert in den &systemsettings; oder das leere Profil <guimenuitem>Anonym</guimenuitem> zum Schutz der Privatsphäre ausgewählt werden.

source: <guimenu>Settings</guimenu> <guimenuitem>Configure Notifications...</guimenuitem>
de: <guimenu>Einstellungen</guimenu><guimenuitem>Benachrichtigungen festlegen ...</guimenuitem>

source: <action>Configure &sheets; notification system.</action> There are no actions that you can be notified in the current version of &sheets;.
de: <action>Richtet das Benachrichtigungssystem für &sheets; ein.</action> In der aktuellen Version von &sheets; gib es noch keine Aktionen, für die Benachrichtigungen eingestellt werden können.

source: <guimenu>Settings</guimenu> <guimenuitem>Configure &sheets;...</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>&sheets; einrichten ...</guimenuitem>

source: <action>General &sheets; configuration.</action> See the section on <link linkend="configdialog">&sheets; configuration</link> for more details.
de: <action>Allgemeine Einstellungen für &sheets;.</action> Im Abschnitt <link linkend="configdialog">Einrichtungsdialog von &sheets;</link> finden Sie dazu weitere Einzelheiten.

source: The Help Menu
de: Das Menü Hilfe

source: The Right Mouse Button Menu
de: Das Kontextmenü der rechten Maustaste

source: This section describes the items in the pop up menu obtained by <mousebutton>right</mousebutton> clicking on a selected cell or cells, row(s) or column(s).
de: Dieser Abschnitt beschreibt die Einträge in dem Menü, das durch Klicken mit der <mousebutton>rechten</mousebutton> Maustaste auf ausgewählten Zellen, Zeilen oder Spalten geöffnet wird.

source: <shortcut> <keycombo action="simul">&Ctrl;&Alt;<keycap>F</keycap></keycombo> </shortcut> <guimenuitem>Cell Format...</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;&Alt;<keycap>F</keycap></keycombo></shortcut> <guimenuitem>Zellenformat ...</guimenuitem>

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>X</keycap></keycombo> </shortcut> <guimenuitem>Cut</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>X</keycap></keycombo></shortcut> <guimenuitem>Ausschneiden</guimenuitem>

source: <action>Put selected item(s) into the clipboard.</action> If you then do a <guilabel>Paste</guilabel> the item(s) will be moved from the original location to the new one.
de: <action>Verschiebt die ausgewählten Zellen in die Zwischenablage.</action>Wenn Sie danach <guimenuitem>Einfügen</guimenuitem> wählen, werden die Zellen an der neuen Cursor-Position wieder eingefügt.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>C</keycap></keycombo> </shortcut> <guimenuitem>Copy</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>C</keycap></keycombo></shortcut> <guimenuitem>Kopieren</guimenuitem>

source: Copy selected item(s) into the clipboard.
de: Kopiert die ausgewählten Zellen in die Zwischenablage.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>V</keycap></keycombo> </shortcut> <guimenuitem>Paste</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>V</keycap></keycombo></shortcut> <guimenuitem>Einfügen</guimenuitem>

source: Paste item(s) from the clipboard to the selected cells.
de: Fügt Daten aus der Zwischenablage in die ausgewählten Zellen ein.

source: Special Paste...
de: Einfügen spezial ...

source: Paste with Insertion
de: Einfügen und Zellen verschieben

source: Paste from the clipboard to the selected cell(s), moving the previous cell(s) to make room.
de: Fügt Daten aus der Zwischenablage in die ausgewählten Zellen ein, wobei die Zellen im ausgewählten Bereich vorher nach rechts oder nach unten verschoben werden, um Platz für die neuen Daten zu machen.

source: <guimenuitem>All</guimenuitem>
de: <guimenuitem>Alle</guimenuitem>

source: Delete contents of selected cell(s).
de: Löscht den Inhalt der ausgewählten Zellen.

source: Adjust Row &amp; Column
de: Zeile und Spalte anpassen

source: Change size of row and column to display selected cell(s) completely.
de: Stellt die Zeilen- und Spaltengrößen so ein, dass die Zelleninhalte alle komplett angezeigt werden.

source: Default
de: Standard

source: Set default formats for selected cell(s).
de: Stellt das Standardformat für die ausgewählten Zellen ein.

source: Area Name...
de: Bereichsname ...

source: <action>Name selected area.</action> See the section <link linkend="namedareas">Named Areas</link> for more details.
de: <action>Benennen Sie den ausgewählten Bereich.</action> Im Abschnitt <link linkend="namedareas">Benannte Zellenbereiche</link> finden Sie dazu ausführliche Informationen.

source: Resize Row...
de: Zeilenhöhe ändern ...

source: Change height of selected row.
de: Ändert die Höhe der ausgewählten Zeile.

source: Adjust Row
de: Zeile anpassen

source: Change height of selected row to display cell(s) completely.
de: Ändert die Höhe der ausgewählten Zeile, um Zelleninhalte vollständig anzuzeigen.

source: Resize Column...
de: Spaltenbreite ändern ...

source: Change width of selected column.
de: Ändert die Breite der ausgewählten Spalte.

source: Adjust Column
de: Spalte anpassen

source: Change width of selected column to display cell(s) completely.
de: Ändert die Breite der ausgewählten Spalte, um Zelleninhalte vollständig anzuzeigen.

source: Insert Cells...
de: Zellen einfügen ...

source: Insert new cell(s) at selected location, moving existing cell(s) to make room.
de: Fügt neue Zellen an der ausgewählten Position ein, wobei die vorhandenen Zellen verschoben werden, um Platz für die neuen Zellen zu schaffen.

source: Delete Cells...
de: Zellen löschen ...

source: Remove selected cell(s), moving other cell(s) to occupy the space left by the removed cell(s).
de: Löscht die ausgewählten Zellen und verschiebt andere Zellen in den ausgewählten Bereich, um den Raum, der durch die entfernten Zellen belegt war, wieder zu füllen.

source: Insert Rows
de: Zellen einfügen

source: Insert new row(s) above selected row(s).
de: Fügen Sie neue Zeilen über den aktuell ausgewählten Zeilen ein.

source: Delete Rows
de: Zeilen löschen

source: Delete selected row(s).
de: Löscht die ausgewählten Zeilen.

source: Hide Rows
de: Zeilen ausblenden

source: Hides selected row(s).
de: Blendet die gewählten Zeilen aus.

source: Show Rows
de: Zeilen anzeigen

source: Shows selected row(s). In order to show hidden rows you need to select a range of rows that includes the hidden rows.
de: Zeigt die ausgewählte(n) Zeile(n) an. Um eine ausgeblendete Zeile anzuzeigen, müssen Sie mehrere Zeilen auswählen, die die ausgeblendete Zeile umfassen.

source: Insert Columns
de: Spalten einfügen

source: Insert new column(s) at left of selected column(s).
de: Fügen Sie neue Spalten links von den ausgewählten Spalten ein.

source: Delete Columns
de: Spalten löschen

source: Delete selected column(s).
de: Löscht die ausgewählten Spalten.

source: Hide Columns
de: Spalten ausblenden

source: Hides selected column(s).
de: Blendet die gewählten Spalten aus.

source: Show Columns
de: Spalten anzeigen

source: Shows selected column(s). In order to show hidden columns you need to select a range of columns that includes the hidden columns.
de: Zeigt die ausgewählte(n) Spalte(n) an. Um eine ausgeblendete Spalte anzuzeigen, müssen Sie mehrere Spalten auswählen, die die ausgeblendete Spalte umfassen.

source: Comment...
de: Kommentar ...

source: Add or modify a comment to the selected cell.
de: Fügen Sie einen Kommentar zur ausgewählten Zelle hinzu oder ändern Sie ihn.

source: Selection List...
de: Auswahlliste ...

source: Lets you select and paste text from any cell of the current selection of cells into the selected cell.
de: Ermöglicht das Auswählen und Einfügen von Text aus einer anderen Zelle der aktuellen Spalte in die aktuell ausgewählte Zelle.

source: Other Shortcuts
de: Andere Tasten-Kurzbefehle

source: This section describes those &sheets; shortcut keys used for operations that do not appear in any of the menus.
de: Dieser Abschnitt beschreibt die &sheets;-Tastatur-Kurzbefehle, die für Aktionen verwendet werden, die in keinem Menü vorkommen.

source: Toggle the display of the dockers.
de: Blendet die andockbaren Dialoge ein und aus.

source: &Ctrl;<keysym>Arrow keys</keysym>
de: &Ctrl;<keysym>Pfeiltasten </keysym>

source: If the selected cell is occupied then move the cell cursor to the start or end of the occupied block in the current row or column. If the selected cell is not occupied then move the cell cursor to the start or end of the block of unoccupied cells in the current row or column.
de: Wenn die ausgewählte Zelle belegt ist, wird der Cursor auf den Anfang oder das Ende des belegten Blockes in der aktuellen Zeile oder Spalte bewegt. Wenn die ausgewählte Zelle nicht belegt ist, wird der Cursor auf den Anfang oder das Ende des nicht belegten Blockes in der aktuellen Zeile oder Spalte bewegt.

source: &Ctrl;&Shift;<keysym>Arrow keys</keysym>
de: &Ctrl;&Shift;<keysym>Pfeiltasten</keysym>
