Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/calligra/sheets_commands.po
Languages: de

source: If the selected cell is occupied then select all occupied cells to the start or end of that block of occupied cells in the current row or column. If the selected cell is not occupied then select all unoccupied cells to the start or end of that block of unoccupied cells in the current row or column.
de: Wenn die ausgewählte Zelle belegt ist, werden alle Zellen bis zum Anfang oder Ende des belegten Blockes in der aktuellen Zeile oder Spalte ausgewählt. Wenn die ausgewählte Zelle nicht belegt ist, werden alle Zellen bis zum Anfang oder Ende des nicht belegten Blockes in der aktuellen Zeile oder Spalte ausgewählt.

source: Page Down
de: Bild ab

source: Move the cell cursor 10 cells down.
de: Bewegt den Cursor um 10 Zellen nach unten.

source: Page Up
de: Bild auf

source: Move the cell cursor 10 cells up.
de: Bewegt den Cursor um 10 Zellen nach oben.

source: &Ctrl;<keysym>Page Down</keysym>
de: &Ctrl;<keysym>Bild ab</keysym>

source: Move to the next sheet.
de: Zeigt die nächste Tabelle an.

source: &Ctrl;<keysym>Page Up</keysym>
de: &Ctrl;<keysym>Bild auf</keysym>

source: Move to the previous sheet.
de: Zeigt die vorhergehende Tabelle an.

source: <action>Change cell reference</action> between normal and <link linkend="absolute">absolute reference</link> types.
de: <action>Ändert einen Zellenverweis</action> zwischen normalen und <link linkend="absolute">absoluten Verweisarten</link>.
