Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/calligra/sheets_basics.po
Languages: de

source: This may seem to be a rather strange way of doing a copy, but 99 percent of the time it is exactly what is wanted (if it is not then see the section about <link linkend="absolute">absolute cell references</link>). For example in the simple shopping list shown below, cell D2 should contain <userinput>=B2 * C2</userinput>, D3 should be <userinput>=B3 * C3</userinput>, D4 should be <userinput>=B4 * C4</userinput> and so on. Instead of having to enter a different formula in each cell, you can just enter the first formula into D2 and then copy it into the cells below, letting &sheets; adjust the cell references to suit.
de: Das kann als eine ziemlich merkwürdige Art des Kopierens erscheinen, aber in 99 Prozent der Fälle ist es genau das, was gewünscht wird (wenn Sie es in einem Fall nicht wünschen, dann lesen den Abschnitt über <link linkend="absolute">absolute Zellenverweise</link>. Z. B. in der einfachen Einkaufsliste, die unten gezeigt wird, soll Zelle D2 <userinput>=B2*C2</userinput> enthalten, D3 soll <userinput>=B3*C3</userinput> enthalten, D4 soll <userinput>=B4*C4</userinput> enthalten und so weiter. Anstatt dass Sie eine andere Formel in jede Zelle eintragen müssen, müssen Sie nur die erste Formel in D2 eintragen und sie in die Zellen weiter unten kopieren und lassen &sheets; die Zellenverweise automatisch anpassen.

source: Screenshot copy1
de: Bildschirmfoto Kopieren1

source: Copying and Pasting Cell Areas
de: Kopieren und Einfügen von Zellenbereichen

source: In the above example D2 can be copied into all three cells D3 to D5 at once by just copying D2 then selecting the complete cell area D3:D5 before doing the paste.
de: Im oben genannten Beispiel kann D2 auf einmal in alle drei Zellen D3 bis D5 kopiert werden. Kopieren Sie dazu einmalig D2 und wählen dann den kompletten Zellenbereich D3:D5 aus, in den Sie dann den Inhalt von D2 einfügen.

source: A rectangular area of cells can be cut or copied in one operation by selecting the area before doing the cut or copy. Then select the top left corner cell of the area you want to paste into before doing the paste.
de: Ein rechteckiger Bereich von Zellen kann in einem Schritt ausgeschnitten oder kopiert werden, indem man den Bereich auswählt, bevor man ihn ausschneidet oder kopiert. Wählen Sie dann die obere linke Eckzelle des Bereichs aus, in den eingefügt werden soll, bevor Sie den Bereich einfügen.

source: If you cut or copy a rectangular area of cells, say B2:C3, and paste it into a larger area such as A10:D13 the original pattern of cells will be repeated to fill the target area.
de: Wenn Sie einen rechteckigen Bereich von Zellen ausschneiden oder kopieren, z. B. B2:C3 und Sie ihn in einen größeren Bereich, wie z. B. A10:D13 einfügen, wird der ursprüngliche Block von Zellen regelmäßig wiederholt, um den Zielbereich zu füllen.

source: &sheets; also provides a <quote>Drag and Copy</quote> method for copying cells down into other cells immediately below or to the right of the original cell(s). To use this method select the cell(s) to be copied then position the mouse pointer over the small black square at the bottom right corner of the selected cell(s) so the cursor changes to a double headed arrow. Then hold the <mousebutton>left</mousebutton> mouse button down while you drag the selected cell(s) as far as you wish. Note that cell references in formulae are incremented according to the relative position change. Absolute references are not changed.
de: Im &sheets; können Sie auch den Inhalt von Zellen mit <quote>Ziehen und Kopieren</quote>in andere Zellen unmittelbar unterhalb oder rechts von der Ausgangszelle kopieren. Dazu wählen Sie die zu kopierenden Zellen aus und bewegen den Mauszeiger über das kleine schwarzen Quadrat an der unteren rechten Ecke der Ausgangszellen. Der Mauszeiger wird dann als einem Pfeil mit zwei Spitzen dargestellt. Halten Sie dann die <mousebutton>linke</mousebutton> Maustaste gedrückt, während Sie den ausgewählten Bereich durch Ziehen mit der Maus wie gewünscht vergrößern. Zellverweise in Formeln werden dabei an die geänderte Position angepasst, nur absolute Verweise bleiben erhalten.

source: Other Paste Modes
de: Andere Einfügungsarten

source: A cell may contain text, a value, or a formula, and may also contain special font, border or background <link linkend="formatspread">formatting information</link>. &sheets; has special versions of Paste that let you handle these items in different ways.
de: Eine Zelle kann Text, einen Wert oder eine Formel enthalten und kann auch eine besondere Schriftart-, Rand- oder Hintergrund-<link linkend="formatspread">Formatierungsinformation</link> enthalten. &sheets; verfügt über spezielle Versionen der Funktion „Einfügen“, mit denen Sie diese Formatierungen in unterschiedlicher Weise handhaben können.

source: <menuchoice><guimenu>Edit</guimenu><guimenuitem>Special Paste...</guimenuitem></menuchoice>brings up the <guilabel> Special Paste</guilabel> dialog box. By selecting the appropriate item from the left part of this dialog you can choose to paste <guilabel>Everything</guilabel>, just <guilabel>Text</guilabel>, the cell <guilabel>Format</guilabel>, any <guilabel>Comment</guilabel> in the cell(s) or <guilabel>Everything without border</guilabel>. The items in the right part of this dialog box allow you to do simple <link linkend="sumspecialpaste">arithmetic on an area of cells</link>.
de: Wenn Sie <menuchoice><guimenu>Bearbeiten</guimenu><guimenuitem>Einfügen spezial ...</guimenuitem></menuchoice> auswählen,wird der Dialog <guilabel>Einfügen spezial</guilabel>geöffnet. Wenn Sie im linken Teil des Dialogs den gewünschten Eintrag auswählen, können Sie <guilabel>Text</guilabel>, das <guilabel>Format</guilabel> der Zellen, einen<guilabel>Kommentar</guilabel> in der/den Zelle(n) oder<guilabel>Alles ohne Umrandung</guilabel> auswählen. Mit den Einträgen im rechten Teil des Dialogs können Sie <link linkend="sumspecialpaste">Rechenoperationen auf einen Zellbereich</link> anwenden.

source: <guimenuitem>Paste with Insertion...</guimenuitem> inserts the copied cell(s) into the sheet by moving the cells that would otherwise be overwritten a suitable number of rows of columns down or to the right. It can also be used to insert complete copied row(s) or column(s) into the worksheet.
de: <guimenuitem>Einfügen mit Zusätzen ...</guimenuitem> setzt die kopierte(n) Zelle(n) in das Blatt ein, indem die Zellen nach rechts oder unten verschoben werden, die sonst überschrieben werden würden. Sie kann auch verwendet werden, um komplette kopierte Zeilen oder Spalten in die Tabelle einzufügen.

source: Insert and Delete
de: Einfügen und löschen

source: Use the <keysym>Del</keysym> key or <menuchoice><guimenu>Edit</guimenu> <guisubmenu>Clear</guisubmenu><guimenuitem>Contents</guimenuitem> </menuchoice> to remove the text, value or formula from selected cell(s), row(s) or column(s) without affecting anything else.
de: Verwenden Sie die Taste <keysym>Entf</keysym> oder <menuchoice><guimenu>Bearbeiten</guimenu><guisubmenu>Leeren</guisubmenu><guimenuitem>Inhalt</guimenuitem></menuchoice>, um den Text, den Wert oder die Formel in den ausgewählten Zellen, Zeile(n) oder Spalte(n) zu entfernen, ohne etwas anderes, wie z. B. Formatierungen, zu beeinflussen.

source: To delete everything in the selected cell(s), row(s) or column(s), including comments and special formatting, choose the <guimenuitem>All</guimenuitem> option from the <menuchoice><guimenu>Edit</guimenu><guisubmenu>Clear</guisubmenu></menuchoice> menu or from the pop up menu you get when you <mousebutton>right</mousebutton> click on a selection.
de: Um alles in den ausgewählten Zellen, Zeilen oder Spalten, einschließlich der Kommentare und speziellen Formatierung, zu löschen, wählen Sie <guimenuitem>Alle</guimenuitem> aus dem Menü <menuchoice><guimenu>Bearbeiten</guimenu><guimenuitem>Leeren</guimenuitem></menuchoice> oder aus dem Kontextmenü, das Sie durch Klicken mit der &LMBn; auf eine Zelle oder ausgewählten Bereich öffnen.

source: To remove selected row(s) or column(s) completely, use the <guimenuitem>Delete Rows</guimenuitem> or <guimenuitem>Delete Columns</guimenuitem> options from the <mousebutton>right</mousebutton> mouse button pop up menu.
de: Um markierte Zeilen oder Spalten komplett aus der Tabelle zu entfernen, benutzen Sie <guimenuitem>Zeilen löschen</guimenuitem> oder <guimenuitem>Spalten löschen</guimenuitem> aus dem Kontextmenü der<mousebutton>rechten</mousebutton> Maustaste.

source: If you select a cell or cells and choose <guimenuitem>Remove Cells... </guimenuitem> from the <mousebutton>right</mousebutton> mouse button pop up menu, you can then choose whether other cells in the worksheet will be moved up or to the left to fill in the space left by the cell(s) you have chosen to remove.
de: Wenn Sie eine oder mehrere Zellen auswählen und <guimenuitem>Zellen entfernen ...</guimenuitem> aus dem Kontextmenü der <mousebutton>rechten</mousebutton> Maustasten wählen, können Sie eingeben, ob andere Zellen von unten in der Tabelle nach oben oder von rechts nach links verschoben werden, um den Bereich der gelöschten Zellen auszufüllen.

source: If you want to insert new, blank, row(s) or column(s) into the sheet, select row(s) or column(s) where you wish the new row(s) or column(s) to be placed and choose the <guimenuitem>Insert Rows</guimenuitem>, <guimenuitem>Insert Columns</guimenuitem> option from the <mousebutton> right</mousebutton> mouse button pop up menu.
de: Wenn Sie neue leere Zeilen oder Spalten in die Tabelle einfügen wollen, markieren Sie die Spalte oder Zeile, in der die neuen Zeilen oder Spalten eingefügt werden sollen und wählen Sie <guimenuitem>Zeilen einfügen</guimenuitem> oder <guimenuitem>Spalten einfügen</guimenuitem> aus dem Kontextmenü der <mousebutton>rechten</mousebutton> Maustaste.

source: You can insert new cells into the worksheet by selecting the area where you want them to appear then choosing the <guimenuitem> Insert Cells...</guimenuitem> option from the <mousebutton>right</mousebutton> mouse button pop up menu. You will then be asked whether the existing cell(s) in the selected area should be moved down or to the right to make room for the new ones.
de: Sie können neue Zellen in die Tabelle einfügen, indem Sie einen Bereich dafür auswählen. Dann wählen Sie <guimenuitem>Zellen einfügen ...</guimenuitem> aus dem Kontextmenü der <mousebutton>rechten</mousebutton> Maustaste. Geben Sie dann ein, ob die vorhandenen Zellen im ausgewählten Bereich nach rechts oder unten zum Einfügen der neuen Zellen verschoben werden sollen.

source: Simple Sums
de: Einfache Summen

source: If the first character in a cell is an equals sign (<keycap>=</keycap>) &sheets; will take the cell contents to be a formula which is to be calculated. The result of the calculation will be displayed in the cell rather than the formula itself. For example, enter <userinput>=2+3</userinput> into a cell and it should display <emphasis>5</emphasis>.
de: Wenn der erste Buchstabe in einer Zelle ein Gleichheitszeichen (<keycap>=</keycap>) ist, erkennt &sheets; den Zelleninhalt als eine Formel, die berechnet werden soll. Das Resultat der Berechnung wird in der Zelle anstatt der Formel selbst angezeigt. Z. B. tragen Sie <userinput>=2+3</userinput> in eine Zelle ein, sollte sie <emphasis>5</emphasis> anzeigen.

source: More usefully, a formula can contain references to other cells, so that <userinput>=B4+A3</userinput> will calculate the sum of the values in cells B4 and A3, and this calculation will be updated whenever cells B4 or A3 are changed.
de: Eine Formel kann auch Verweise auf andere Zellen enthalten, so kann mit <userinput>=B4+A3</userinput> die Summe der Werte in den Zellen B4 und A3 berechnet werden. Diese Berechnung wird immer aktualisiert, wenn eine der Zellen B4 oder A3 geändert wird.

source: As well as addition, a formula can make use of the <keycap>-</keycap> symbol for subtraction, <keycap>*</keycap> for multiplication, and <keycap> /</keycap> to perform division. The round bracket symbols <keycap>(</keycap> and <keycap>)</keycap> can also be used as in normal algebra, so you could enter more complex formulae such as <userinput>=((B10 + C3) *5 - F11) / 2 </userinput>.
de: Genauso wie <keycap>+</keycap> für Addition kann eine Formel die Zeichen <keycap>-</keycap> für Subtraktion, <keycap>*</keycap> für Multiplikation und <keycap>/</keycap> für Division enthalten. Auch die runden Klammern <keycap>(</keycap> und <keycap>)</keycap> können genau wie in der Mathematik verwendet werden. Sie können also auch kompliziertere Formeln wie <userinput>=((B10+C3)*5-F11)/2</userinput> eingeben.

source: Cells containing a formula will be marked with a small blue triangle at the bottom left corner if the <guilabel>Show formula indicator</guilabel> check box in the <menuchoice><guimenu>Format</guimenu> <guisubmenu>Sheet</guisubmenu><guisubmenu>Sheet Properties</guisubmenu> </menuchoice> dialog is checked.
de: Zellen, die eine Formel enthalten, werden mit einem blauen Dreieck in der linken unteren Ecke markiert, wenn die Einstellung <guilabel>Formelmarkierung anzeigen</guilabel> im Dialog <menuchoice><guimenu>Format</guimenu> <guisubmenu>Tabelle</guisubmenu> <guisubmenu>Tabellen-Eigenschaften</guisubmenu> </menuchoice> eingeschaltet ist.

source: &sheets; also includes a large number of built-in functions for applications such as statistical, trigonometrical and financial calculations. Their use will be examined in more depth in a <link linkend="formulas"> later section</link> of this manual, but if you are interested at this stage choose <guimenuitem>Function...</guimenuitem> from the <guimenu>Insert</guimenu> menu and take a look through the <guilabel>Function</guilabel> dialog box that will be displayed.
de: &sheets; enthält auch viele eingebaute Funktionen wie statistische, trigonometrische und finanzielle Berechnungen. Ihre Anwendung wird genauer in einem späteren <link linkend="formulas">Abschnitt</link> dieses Handbuches beschrieben. Um eine einen ersten Eindruck zu erhalten, wählen Sie <guimenuitem>Funktion ...</guimenuitem> aus dem Menü <guimenu>Einfügen</guimenu> und im Dialog <guilabel>Funktion</guilabel> werden dann alle vorhandenen Funktionen angezeigt.

source: For the time being, however, the <userinput>SUM</userinput> function may be of interest as it calculates the sum of all values in a specified area of cells. For example <userinput>=SUM(B4:C10)</userinput> calculates the sum of all values in the cell area B4 to C10.
de: Häufig gebraucht wird die Funktion <userinput>SUM</userinput>. Sie berechnet die Summe aller Werte in einem angegebenen Bereich von Zellen. Zum Beispiel berechnet <userinput>=SUM(B4:C10)</userinput> die Summe aller Werte im Zellenbereich B4 bis C10.

source: If &sheets; displays <keycap>#VALUE!</keycap> when you have entered your formula this usually means that it cannot understand what you have entered, but if the row of symbols ends with a small red arrow this just means that the cell is not wide enough to display the complete result, in which case you should either make the cell(s) wider or change their <link linkend="formatdata">format</link> so that the result does fit properly.
de: Wenn &sheets; mehrere <keycap>#VALUE!</keycap>-Symbolen anzeigt, wenn Sie eine Formel eingegeben haben, bedeutet das meistens, dass &sheets; Ihre Eingabe nicht versteht. Wenn die Zeichen aber mit einem kleinen roten Pfeil enden, ist die Zelle nicht breit genug, um das gesamte Ergebnis anzuzeigen. In diesem Fall sollten Sie die Zellen verbreitern oder ihr <link linkend="formatdata">Format</link> ändern, damit das Ergebnis in die Zellen passt.

source: Recalculation
de: Neuberechnung

source: If the <guilabel>Automatic recalculation</guilabel> box in the <menuchoice><guimenu>Format</guimenu> <guisubmenu>Sheet</guisubmenu><guisubmenu>Sheet Properties</guisubmenu> </menuchoice> dialog box is checked, &sheets; will recalculate the values of cells whenever anything that affects them is changed in the sheet.
de: Wenn <guilabel>Automatische Neuberechnung</guilabel> im Dialog <menuchoice><guimenu>Format</guimenu> <guisubmenu>Tabelle</guisubmenu> <guisubmenu>Tabelleneigenschaften</guisubmenu> </menuchoice> ausgewählt ist, berechnet &sheets; die Werte der Zellen neu, wenn irgend ein Wert geändert wird, der in diese Berechnung eingeht.

source: When <guilabel>Automatic recalculation</guilabel> is not checked for the current sheet, you can instruct &sheets; to perform a recalculation at any time by using the <guimenuitem>Recalculate Sheet</guimenuitem> or <guimenuitem> Recalculate Document</guimenuitem> option in the <guimenu>Tools</guimenu> menu or their shortcuts <keycombo action="simul">&Shift;<keysym>F9</keysym> </keycombo> or <keysym>F9</keysym>.
de: Wenn <guilabel>Automatische Neuberechnung</guilabel> nicht für das aktuelle Dokument eingeschaltet ist, können eine jederzeit Neuberechnung durchführen, indem Sie <guimenuitem>Tabelle neu berechnen</guimenuitem> oder <guimenuitem>Dokument neu berechnen</guimenuitem> aus dem Menü <guimenu>Extras</guimenu>wählen oder die entsprechenden Kurzbefehle <keycombo action="simul">&Shift;<keysym>F9</keysym> </keycombo> oder <keysym>F9</keysym> benutzen.

source: Sorting Data
de: Daten sortieren

source: In the simple example shown below, the data consist of the names and countries of a number of mountains together with their height above sea level. &sheets; can sort data such as this in different ways.
de: In dem unten gezeigten Beispiel bestehen die Daten aus den Namen von Bergen, den Ländern in denen sie stehen, und der Höhe über der Meeresspiegel. &sheets; kann diese Daten auf verschiedene Weise sortieren.

source: Screenshot of sorted data
de: Bildschirmfoto der sortierten Daten

source: We may want the data sorted so that the names are in alphabetical order. To do this select the area containing the data (A2:C7 in this case) and choose <guimenuitem>Sort...</guimenuitem> from the <guimenu>Data</guimenu> menu. This opens the <guilabel>Sort</guilabel> dialog box.
de: Um Daten alphabetisch zu sortieren, wählen Sie die Zellen mit den Daten aus (in diesem Beispiel A2:C7) und wählen Sie <guimenuitem>Sortieren ...</guimenuitem> im Menü <guimenu>Daten</guimenu>. Damit öffnen Sie den Dialog <guilabel>Sortieren</guilabel>.

source: Sorting is done alphanumerically, and the default is case sensitive, numbers coming before uppercase letters which come before lowercase letters, so that cells containing the entries <userinput>Cat</userinput>, <userinput>bar</userinput>, <userinput>77</userinput> and <userinput>Bat</userinput> would be sorted into the following order: <emphasis>77 Bat Cat bar</emphasis>.
de: Die Sortierung erfolgt alphanumerisch und berücksichtigt in der Voreinstellung Groß- und Kleinschreibung. Zahlen kommen vor Großbuchstaben und diese vor Kleinbuchstaben, sodass Zellen mit den Einträgen <userinput>Cat</userinput>, <userinput>bar</userinput>, <userinput>77</userinput> und <userinput>Bat</userinput> in der folgenden Reihenfolge sortiert werden:<emphasis>77 Bat Cat bar</emphasis>.

source: In the <guilabel>Direction</guilabel> area of this dialog box select to sort in rows or columns. If you check the <guilabel>First row contains column headers</guilabel> or <guilabel>First column contains row headers</guilabel> box data in the first row or column will not be included in the sort operation.
de: Im Bereich <guilabel>Richtung</guilabel> diese Dialogs geben Sie an ob nach Zeilen oder Spalten sortiert werden soll. Aktivieren Sie <guilabel>Erste Zeile enthält Spaltenüberschriften</guilabel> oder <guilabel>Erste Spalte enthält Zeilenüberschriften</guilabel>, dann werden die Daten in der ersten Zeile oder Spalte bei der Sortierung nicht berücksichtigt.

source: The rows or columns are sorted in the specified order, which can be changed using the <guibutton>Move Up</guibutton> and <guibutton>Move Down</guibutton> buttons. Using the example in the above screenshot, choosing column B as the first key and column C as the second would sort the data by country and, for each country, by height.
de: Die Zeilen oder Spalten werden in der angegeben Reihenfolge sortiert. Die kann mit den Knöpfen <guibutton>Nach oben</guibutton> und <guibutton>Nach unten</guibutton> geändert werden. Mit dem Beispiel aus dem oben gezeigten Bildschirmfoto werden bei einer Sortierung zuerst nach Spalte B und dann nach Spalte C die Daten nach Ländern und dann für jedes Land nach Höhe sortiert.

source: Uncheck the option <guilabel>Case Sensitive</guilabel> to get a sort not depending on capitalization and switch the sort order between <guilabel>Ascending</guilabel> and <guilabel>Descending</guilabel> by clicking on the cells in the column <guilabel>Sort Order</guilabel>.
de: Schalten Sie die Einstellung <guilabel>Groß-/Kleinschreibung beachten</guilabel> ab, um die Schreibung beim Sortieren nicht zu berücksichtigen. Sie konnen die zwischen aufsteigender und absteigender Sortierung wechseln, indem Sie auf die Zellen in der Spalte <guilabel>Sortier-Reihenfolge</guilabel> klicken.

source: The <guilabel>Details >></guilabel> extension of the dialog allows you to sort using the order of items in a custom list such as January, February... instead of alphanumerically. The cell format is moved with the cell content, if you select <guilabel>Copy cell formatting (Borders, Colors, Text Style)</guilabel>.
de: Auf der Erweiterung <guilabel>Details >></guilabel> des Dialogs können Sie einstellen, ob statt alphanumerisch nach den Einträgen in einer benutzerdefinierten Liste sortiert werden soll wie beispielsweise Januar, Februar ... Die Formatierungen der Zellen werden zusammen mit dem Inhalt der Zellen bei der Sortierung verschoben, wenn Sie die Einstellung <guilabel>Zellenformatierung verschieben (Umrandungen, Format, Textstil)</guilabel> aktivieren.

source: The Status bar Summary Calculator
de: Das Ergebnisfeld in der Statusleiste

source: The left hand end of the Status bar by default shows a summary of the values in the selected cell(s). According to the setting of the <guilabel>Function shown in status bar</guilabel> combo box in the <guilabel>Interface</guilabel> page of &sheets;'s configuration dialog the summary can be:
de: Auf der linken Seite der Statuszeile wird das Ergebnis einer Berechnung mit den Werten in den ausgewählten Zellen angezeigt. Je nach Einstellung von <guilabel>In der Statusleiste gezeigte Funktion</guilabel> im Auswahlfeld der Seite <guilabel>Oberfläche</guilabel> im Einrichtungsdialog von &sheets; wird als Ergebnis der Berechnung folgendes angezeigt:

source: None
de: Keine

source: No summary calculation is performed.
de: Es wird keine Berechnung durchgeführt.

source: Average
de: Durchschnitt

source: The value displayed is the average of the values in the selected cells.
de: Der Durchschnitt der Werte in den ausgewählten Zellen wird angezeigt.

source: Count
de: Anzahl

source: The value displayed is the number of cells containing numeric values.
de: Die Anzahl der Zellen mit numerischen Werten wird angezeigt.

source: The value displayed is the number of non empty cells.
de: Die Anzahl der nicht leeren Zellen wird angezeigt.

source: <guilabel>Max</guilabel>
de: <guilabel>Maximum</guilabel>

source: The value displayed is the maximum of the values in the selected cells.
de: Das Maximum der Werte in den ausgewählten Zellen wird angezeigt.

source: <guilabel>Min</guilabel>
de: <guilabel>Minimum</guilabel>

source: The value displayed is the minimum of the values in the selected cells.
de: Das Minimum der Werte in den ausgewählten Zellen wird angezeigt.

source: <guilabel>Sum</guilabel>
de: <guilabel>Summe</guilabel>
