Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/calligra/sheets_basics.po
Languages: de

source: The value displayed is the sum of the values in the selected cells.
de: Die Summe der Werte in den ausgewählten Zellen wird angezeigt.

source: The method of calculation can also be changed by <mousebutton>right </mousebutton> clicking on the summary calculation result area of the Status bar and choosing an item from the pop up menu.
de: Die Berechnungsmethode können Sie ändern, indem Sie mit der <mousebutton>rechten</mousebutton> Maustaste auf das Ergebnisfeld in der Statusleiste klicken und einen Eintrag aus dem Kontextmenü auswählen.

source: Saving your Work
de: Speichern der Arbeit

source: &sheets; saves the complete document, which may include more than one worksheet, as a single document file.
de: &sheets; speichert das gesamte Dokument, das mehr als eine Tabelle enthalten kann, in einer einzigen Datei.

source: If you have created a new document, or want to save an existing one under a different name, use <menuchoice><guimenu>File</guimenu><guimenuitem> Save As...</guimenuitem></menuchoice>. This will bring up &kde;'s common <guilabel>Save Document As</guilabel> dialog box. Choose the folder where you want to save the document and enter a suitable file name into the <guilabel>Name</guilabel> text box. &sheets; documents are normally automatically saved with a <filename>.ods</filename> extension, you do not need to add this to the filename but do make sure that the <guilabel>Filter</guilabel> selection is set to <guilabel>OpenDocument SpreadSheet</guilabel>.
de: Wenn Sie eine neues Dokument erstellt haben oder ein Dokument unter einem anderem Namen speichern wollen, verwenden Sie <menuchoice><guimenu>Datei</guimenu><guimenuitem>Speichern unter ...</guimenuitem></menuchoice>. Damit öffnen Sie den &kde;-Standarddialog <guilabel>Dokument speichern unter</guilabel>. Wählen Sie einen Ordner für das Dokument aus und geben Sie einen aussagekräftigen Namen in das Textfeld <guilabel>Name</guilabel> ein. &sheets;-Dokumente werden normalerweise automatisch mit der Dateinamenerweiterung <filename>.ods</filename> gespeichert. Deshalb müssen Sie die Erweiterung nicht zum Dateinamen hinzufügen. Vergewissern Sie sich aber, das im Feld <guilabel>Filter:</guilabel> <guilabel>ODS-Tabelle</guilabel> eingestellt ist.

source: To save your document without changing its name, just use <menuchoice> <guimenu>File</guimenu><guimenuitem>Save</guimenuitem></menuchoice>.
de: Um Ihr Dokument unter dem gleichen Namen erneut zu speichern, wählen Sie <menuchoice><guimenu>Datei</guimenu><guimenuitem>Speichern</guimenuitem></menuchoice>.

source: You can also save a &sheets; document in a foreign format selecting the format from the <guilabel>Filter:</guilabel> combo box.
de: Sie können ein &sheets;-Dokument auch in einem anderen (fremden) Format speichern, indem das gewünschte Format im Auswahlfeld <guilabel>Filter</guilabel> einstellen.

source: When you save a modified version of an existing document &sheets; will keep the previous version as a backup file, adding a <literal>~</literal> to the end of the filename.
de: Wenn Sie eine geänderte Version eines bereits vorhandenen Dokuments speichern, speichert &sheets; die vorige Version als Sicherungs-(Backup-)Datei und fügt ein <literal>~</literal> am Ende des Dateinamens hinzu.

source: &sheets; can provide some protection against losing your work because of a computer crash or because you have closed &sheets; without saving the current document. It does this by automatically saving the latest version of the document you are working on every few minutes using a modified file name. The autosaved version is normally removed when you next save your document, so that it will only exist if it is more up to date than the version that was saved manually. When you open a document &sheets; checks to see if an autosaved version exists, and if it finds one it will offer to open that instead.
de: &sheets; bietet einen begrenzten Schutz gegen den Verlust Ihrer Arbeit durch einen Rechnerabsturz, oder weil Sie &sheets; beendet haben, ohne das aktuelle Dokument zu speichern. Die wird dadurch erreicht, dass die aktuelle Version, an der Sie arbeiten, automatisch in einem einstellbaren Zeitabstand unter einem anderen Dateinamen gesichert wird. Diese automatisch gesicherte Version wird gelöscht, wenn Sie Ihr Dokument speichern. Daher ist die automatisch gesicherte Version nur dann vorhanden, wenn sie aktueller als die von Ihnen gespeicherte Version ist. Wenn Sie ein Dokument öffnen, überprüft &sheets;, ob eine automatisch gesicherte Version vorhanden ist. Dann haben Sie die Möglichkeit, diese automatisch gesicherte Version statt der älteren Version zu öffnen.

source: Autosaved documents are saved with a file name of the form <filename>.yourfilename.autosave</filename> (note the leading period), so that <filename>spread1.ods</filename> would be autosaved as <filename>.spread1.ods.autosave</filename>. The autosave feature is user configurable in the <link linkend="configopensave">settings dialog</link>.
de: Automatisch gesicherte Dokumente werden mit einem Dateinamen in der Formn<filename>.IhrDateiname.autosave</filename> gespeichert (beachten Sie den Punkt am Beginn des Dateinamens), zum Beispiel die Datei <filename>spread1.ods</filename>wird automatisch als <filename>.spread1.ods.autosave</filename>gespeichert. Die Einstellungen für <emphasis>Automatische Sicherung</emphasis> finden Sie im <link linkend ="configinterface"><guilabel>Einrichtungsdialog</guilabel></link>.

source: Templates
de: Vorlagen

source: If you are going to be creating a lot of similar documents you can save yourself time and trouble by first creating a template and then using that as the basis for the individual documents.
de: Wenn Sie eine Menge ähnlicher Dokumente verwenden. sollten Sie zuerst eine Vorlage erstellen und diese dann als Grundlage für die einzelnen Dokumente verwenden.

source: To do this first create a document containing the common elements, then save it as a template by choosing <menuchoice><guimenu>File</guimenu> <guimenuitem>Create Template From Document</guimenuitem></menuchoice>. Doing this opens the <guilabel>Create Template</guilabel> dialog box. Enter a name for your new template into the <guilabel>Name:</guilabel> text box and press <guibutton>OK</guibutton>. The next time you start a new document by choosing <menuchoice><guimenu>File</guimenu> <guimenuitem>New</guimenuitem></menuchoice> or when you next start &sheets; the startup dialog window will give you the option of creating the new document from your template.
de: Dazu erstellen Sie zuerst ein Dokument mit den gemeinsamen Elementen, dann speichern Sie die Vorlage mit <menuchoice><guimenu>Datei</guimenu> <guimenuitem>Vorlage aus Dokument erstellen ...</guimenuitem></menuchoice>. Damit öffnen Sie den Dialog <guilabel>Vorlage erstellen</guilabel>. Tragen Sie hier einen Namen für Ihre neue Vorlage in das Textfeld <guilabel>Name:</guilabel> ein und drücken Sie auf <guibutton>OK</guibutton>. Wenn Sie das nächste Mal &sheets; starten oder mit <menuchoice><guimenu>Datei</guimenu> <guimenuitem>Neu</guimenuitem></menuchoice> mit einen neuen Dokument beginnen, können Sie im Startdialog Ihre Vorlage für das neue Dokument benutzen.

source: The <guilabel>Create Template</guilabel> dialog box also lets you choose a different picture to be displayed above the template name in the startup dialog window, and lets you save your templates under different group names, which will appear as different pages in the dialog.
de: Im Dialog <guilabel>Vorlage erstellen</guilabel> können Sie auch ein anderes Bild wählen, das zusätzlich zum Namen der Vorlage im Startdialog angezeigt wird. Sie können ihre Vorlagen unter verschiedenen Gruppennamen abspeichern, die als verschiedene Seiten im Startdialog angezeigt werden.

source: Templates are stored as <literal role="extension">.kst</literal> files under <filename>~/.kde/share/apps/tables/templates/</filename>.
de: Vorlagen werden als <literal role="extension">.kst</literal> Dateien unter <filename>~/.kde/share/apps/tables/templates/</filename> gespeichert.

source: Printing a Spreadsheet
de: Drucken einer Tabelle

source: Printing a spreadsheet is basically done by selecting <menuchoice> <guimenu>File</guimenu><guimenuitem>Print...</guimenuitem></menuchoice> which brings up &kde;'s common <guilabel>Print</guilabel> dialog box where you can choose, among other options, the printer to be used, the number of copies and whether all or only selected pages are to be printed.
de: Um eine Tabelle zu drucken, wählen Sie im Menü <menuchoice><guimenu>Datei</guimenu> <guimenuitem>Drucken ...</guimenuitem></menuchoice>. Damit öffnen den Standarddialog <guilabel>Drucken</guilabel> von &kde;. Hier können Sie unter anderem den Drucker und die Anzahl der Kopien sowie die zu druckenden Seiten eingeben.

source: By default &sheets; will print all items in the current worksheet, but you can restrict this by first selecting the area that you want to be printed then choosing <guimenuitem>Define Print Range</guimenuitem> from the <menuchoice><guimenu>Format</guimenu><guisubmenu>Print Range</guisubmenu> </menuchoice> sub menu.
de: In der Standardeinstellung druckt &sheets; alle Daten in der aktuellen Tabelle, aber Sie können den zu druckenden Bereich ändern, indem Sie ihn zuerst markieren und dann <guimenuitem>Druckbereich festlegen</guimenuitem> aus dem Menü <menuchoice><guimenu>Format</guimenu><guisubmenu>Druckbereich</guisubmenu> </menuchoice> wählen.

source: &sheets; will print as many pages as are necessary to include all items in the current worksheet. You can quickly see how a worksheet will be split into separate pages for printing by checking the <menuchoice> <guimenu>View</guimenu> <guimenuitem>Page Borders</guimenuitem></menuchoice> box. The boundaries of each printed page will then be marked by colored lines in the worksheet.
de: &sheets; druckt alle erforderlichen Seiten für die gesamten Daten der aktuellen Tabelle. Sie können sofort erkennen, wie eine Tabelle in unterschiedliche Seiten für den Druck aufgeteilt wird, indem Sie die Einstellung <menuchoice><guimenu>Ansicht</guimenu> <guimenuitem>Seitenumrandungen</guimenuitem></menuchoice> aktivieren. Die Ränder jeder Seite im Druckbild werden dann durch rote Linien in der Tabelle gekennzeichnet.

source: For a more detailed view of what is to be sent to the printer, including anything you have asked to be included in the page headers and footers (see below), choose <menuchoice><guimenu>File</guimenu><guimenuitem>Print Preview...</guimenuitem></menuchoice>.
de: Für eine Vorschau der Druckansicht mit Kopf- und Fußzeilen (siehe unten), wählen Sie <menuchoice><guimenu>Datei</guimenu> <guimenuitem> Druckvorschau ...</guimenuitem></menuchoice>.

source: To improve the appearance of the printed output , you can change the fonts, colors, borders and sizes of the cells in the worksheet, see the <link linkend="formatspread">Spreadsheet Formatting</link> section for more details about how to do this.
de: Um das Aussehen der Druckdaten zu verbessern, können Sie die Schriftarten, Farben, Ränder und Größen der Zellen in der Tabelle ändern, lesen Sie dazu den Abschnitt <link linkend="formatspread">Tabellen-Formatierung</link>.

source: You can also use the <guilabel>Page Layout</guilabel> dialog box, invoked by selecting <menuchoice><guimenu>Format</guimenu><guimenuitem>Page Layout...</guimenuitem></menuchoice>, to change the orientation of the printed pages, the paper size (this should be suitable for your printer) and the size of the page borders.
de: Sie können auch den Dialog <guilabel>Seitenlayout</guilabel> benutzen, indem Sie <menuchoice><guimenu>Format</guimenu> <guimenuitem>Seitenlayout ...</guimenuitem></menuchoice> auswählen. Hier können Sie die Ausrichtung der gedruckten Seite, die Papiergröße (diese sollte zu Ihrem Drucker passen) und die Größe der Seitenränder einstellen.

source: The <guilabel>Sheet</guilabel> provides more options. The <guilabel>Print settings</guilabel> section lets you select whether or not to print the grid, comment indicators and formula indicators, objects and charts. The <guilabel>Repetitions on each page</guilabel> section allows you to repeat selected column(s) or row(s) on each printed page. In the section <guilabel>Scaling</guilabel> you can set a scalefactor or the page limits for the print.
de: Auf der Karteikarte <guilabel>Tabelle</guilabel> finden Sie noch weitere Einstellungen. Im Bereich <guilabel>Druckeinstellungen</guilabel> können Sie festlegen, ob Gitterlinien, Kommentar- und Formelmarkierungen, Objekte und Diagramme gedruckt werden sollen. Außerdem können Sie im Abschnitt <guilabel>Wiederholungen auf jeder Seite</guilabel> Zeilen und Spalten auswählen, die auf jeder Seite gedruckt werden. Im Abschnitt <guilabel>Skalierung</guilabel> setzen Sie einen Vergrößerungsfaktor oder geben Seitenbegrenzungen für den Druck an.
