Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/calligra/sheets_format.po
Languages: de

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Hans-Frieder</firstname><surname>Hirsch</surname><affiliation><address><email>f.hirsch@t-online.de</email></address></affiliation><contrib>Deutsche Übersetzung</contrib></othercredit><othercredit role="translator"><firstname>Johannes</firstname><surname>Schwall</surname><affiliation><address><email>johannes.schwall@gmail.com</email></address></affiliation><contrib>Deutsche Übersetzung</contrib></othercredit>

source: Spreadsheet Formatting
de: Tabellenformatierung

source: Cell Format
de: Zellenformat

source: To change the format and appearance of selected cell(s), row(s) or column(s) use the <guimenuitem>Cell Format...</guimenuitem> option from the <guimenu>Format</guimenu> menu or from the <mousebutton>right</mousebutton> mouse button popup menu.
de: Um Format und Erscheinungsbild ausgewählter Zellen, Zeilen oder Spalten zu ändern, verwenden Sie die Option <guimenuitem>Zellenformat ...</guimenuitem>aus dem Menü <guimenu>Format</guimenu> oder aus dem Kontextmenü, das Sie mit der <mousebutton>rechten</mousebutton> Maustaste öffnen.

source: Right mouse button context menu.
de: Kontextmenü der rechten Maustaste.

source: This will bring up the <guilabel>Cell Format</guilabel> dialog box which has several tabbed pages:
de: Damit öffnen Sie den Dialog <guilabel>Zellenformat</guilabel> mit folgenden Seiten:

source: Data Formats and Representation
de: Datenformate und Darstellungen

source: <guilabel>Data Format</guilabel> page.
de: Die Seite <guilabel>Datenformat</guilabel>.

source: The <guilabel>Data Format</guilabel> page of the <guilabel>Cell Format</guilabel> dialog box lets you control how the values of cells are displayed.
de: Auf der Seite <guilabel>Datenformat</guilabel> des Dialogs <guilabel>Zellenformat</guilabel> können Sie einstellen, wie die Werte in den Zellen angezeigt werden.

source: The top part of this page lets you select the format to be used when displaying numeric values, dates or times. A <guilabel>Preview</guilabel> pane allows you to see the effect of the new format.
de: Im oberen Teil dieser Seite können Sie das Format auswählen, das verwendet wird, um numerische Werte, Daten oder Zeiten anzuzeigen. Eine <guilabel>Vorschau</guilabel> zeigt Ihnen, wie das neue Format dargestellt wird.

source: You can set the same data format for a row or a column by selecting the row or column and calling the <guilabel>Cell Format</guilabel> dialog with the &RMB;.
de: Für eine Zeile oder Spalte können Sie das gleiche Datenformat einstellen, wenn Sie die Zeile oder Spalte auswählen und mit der &RMBn; den Dialog <guilabel>Zellenformat</guilabel> öffnen.

source: You can increase the precision decimal for any number in <guilabel>Generic</guilabel>, <guilabel>Number</guilabel>, <guilabel>Percent</guilabel>, <guilabel>Money</guilabel> or <guilabel>Scientific</guilabel> formats using the <guiicon>Increase precision</guiicon> icon in the <guilabel>Format</guilabel> toolbar:
de: Die Zahl der Nachkommastellen können Sie für Zahlen im Format <guilabel>Allgemein</guilabel>, <guilabel>Zahl</guilabel>, <guilabel>Prozent</guilabel>, <guilabel>Währung</guilabel> oder <guilabel>Wissenschaftlich</guilabel> mit dem Symbol <guiicon>Mehr Dezimalstellen</guiicon> in der Werkzeugleiste <guilabel>Format</guilabel> vergrößern:

source: You can decrease the precision decimal for any number in <guilabel>Generic</guilabel>, <guilabel>Number</guilabel>, <guilabel>Percent</guilabel>, <guilabel>Money</guilabel> or <guilabel>Scientific</guilabel> formats using the <guiicon>Decrease precision</guiicon> icon in the <guilabel>Format</guilabel> toolbar:
de: Die Zahl der Nachkommastellen können Sie für Zahlen im Format <guilabel>Allgemein</guilabel>, <guilabel>Zahl</guilabel>, <guilabel>Prozent</guilabel>, <guilabel>Währung</guilabel> oder <guilabel>Wissenschaftlich</guilabel> mit dem Symbol <guiicon>Weniger Dezimalstellen</guiicon> in der Werkzeugleiste <guilabel>Format</guilabel> verringern:

source: Generic
de: Allgemein

source: This is the default format and &sheets; autodetects the actual data type depending on the current cell data. By default, &sheets; right justifies numbers, dates and times within a cell and left justifies anything else.
de: Dies ist das Standardformat. &sheets; erkennt automatisch den aktuellen Datentyp aus den Zellendaten. Als Standard zeigt &sheets; Zahlen, Daten und Zeiten rechtsbündig und alles andere linksbündig innerhalb der Zellen an.

source: If the <guilabel>Generic</guilabel> format does not suit you, you can change to a specific format among the choices below.
de: Wenn das Format <guilabel>Allgemein</guilabel> nicht zutreffend ist, wählen Sie eines der hier aufgeführten Formate:

source: Number
de: Zahl

source: The number notation uses the notation you globally choose in &systemsettings; in <menuchoice><guimenu>Locale</guimenu><guisubmenu>Country/Region &amp; Language</guisubmenu><guimenuitem>Numbers</guimenuitem></menuchoice>. Numbers are right justified by default.
de: Zahlen werden mit den Einstellungen in den &systemsettings; in <menuchoice><guimenu>Regionales</guimenu><guisubmenu>Land/Region &amp; Sprache</guisubmenu> <guimenuitem>Zahlen</guimenuitem></menuchoice> dargestellt. Zahlen werden in der Voreinstellung rechtsbündig angezeigt.

source: Percent
de: Prozent

source: When you have a number in the current cell and you switch the cell format from <guilabel>Generic</guilabel> to <guilabel>Percent</guilabel>, the current cell number will be multiplied by 100.
de: Enthält die aktuelle Zelle eine Zahl und Sie ändern das Zellenformat von <guilabel>Allgemein</guilabel> zu <guilabel>Prozent</guilabel>, wird die Zahl in der Zelle mit 100 multipliziert.

source: For example if you enter 2 and set the cell format to <guilabel>Percent</guilabel>, the number will then be 200 %. Switching back to <guilabel>Generic</guilabel> cell format will bring it back to 2.
de: Wenn Sie zum Beispiel ein 2 eingeben und dann als Zellenformat <guilabel>Prozent</guilabel> einstellen, ändert sich der Wert in der Zelle zu 200 %. Setzen Sie die Formatierung wieder auf <guilabel>Allgemein</guilabel> zurück, wird der Wert wieder auf 2 zurückgesetzt.

source: You can also use the <guiicon>Percent</guiicon> icon in the <guilabel>Format</guilabel> Toolbar:
de: Zusätzlich können Sie das Symbol <guiicon>Prozent</guiicon> in der Werkzeugleiste <guilabel>Format</guilabel> benutzen.

source: Money
de: Währung

source: The <guilabel>Money</guilabel> format converts your number into money notation using the settings globally fixed in &systemsettings; in <menuchoice><guimenu>Locale</guimenu><guisubmenu>Country/Region &amp; Language</guisubmenu><guimenuitem>Money</guimenuitem></menuchoice>. The currency symbol will be displayed and the precision will be the one set in &systemsettings;.
de: Mit dem Format <guilabel>Währung</guilabel> wird Ihre Eingabe als Währung mit den Einstellungen aus den &systemsettings; in <menuchoice><guimenu>Regionales</guimenu><guisubmenu>Land/Region &amp; Sprache</guisubmenu> <guimenuitem>Währung</guimenuitem></menuchoice> mit dem Währungssymbol und der ausgewählten Anzahl der Dezimalstellen dargestellt.

source: You can also use the <guiicon>Money Format</guiicon> icon in the <guilabel>Format</guilabel> toolbar to set the cell formatting to look like your current currency:
de: Zusätzlich können Sie das Symbol <guiicon>Währungsformat</guiicon> in der Werkzeugleiste <guilabel>Format</guilabel> benutzen, um als Zellenformat die aktuelle Währung einzustellen.

source: Scientific
de: Wissenschaftlich

source: The <guilabel>Scientific</guilabel> format changes your number using the scientific notation. For example, 0.0012 will be changed to 1.2E-03. Going back using <guilabel>Generic</guilabel> cell format will display 0.0012 again. The <guilabel>Generic</guilabel> cell data format does not keep scientific notation so if you want this notation, you have to specify it using this menu item.
de: Das Format <guilabel>Wissenschaftlich</guilabel> stellt Ihre Zahlen in wissenschaftlicher Schreibweise dar. Die Eingabe von 0,0012 wird zum Beispiel als 1,2E-03 angezeigt. Wechseln Sie wieder zurück zum Format <guilabel>Allgemein</guilabel>, wird wieder 0,0012 angezeigt. Um Werte in Zellen in wissenschaftlicher Schreibweise darzustellen, müssen Sie diese Einstellung auswählen, da das Format <guilabel>Allgemein</guilabel> eine Eingabe in wissenschaftlicher Schreibweise nicht automatisch so anzeigt.

source: Fraction
de: Bruch

source: The <guilabel>Fraction</guilabel> format changes your number into a fraction. For example, 0.1 can be changed to 1/8, 2/16, 1/10, &etc; You define the type of fraction by choosing it in the field on the right. If the exact fraction is not possible in the fraction mode you choose, the nearest closest match is chosen. For example: when we have 1.5 as number, we choose <guilabel>Fraction</guilabel> and <guilabel>Sixteenths 1/16</guilabel> the text displayed into cell is "1 8/16" which is an exact fraction. If you have 1.4 as number in your cell and you choose <guilabel>Fraction</guilabel> and <guilabel>Sixteenths 1/16</guilabel> then the cell will display "1 6/16" which is the nearest closest Sixteenth fraction.
de: Das Format <guilabel>Bruch</guilabel> zeigt die eingegebene Zahl als Bruch an. Zum Beispiel 0,1 kann als 1/8, 2/16, 1/10 &etc; dargestellt werden. Wählen Sie den Nenner des Bruchs im Auswahlfeld auf der rechten Seite des Dialogs. Kann die Zahl nicht als Bruch mit dem gewählten Nenner dargestellt werden, wird die beste Näherung angezeigt. Die Zahl 1,5 zum Beispiel wird mit dem Nenner <guilabel>Sechzehntel 1/16</guilabel> wird als richtig als <quote>1 8/16</quote> angezeigt. Eine Zelle mit der Zahl 1,4 und dem Format <guilabel>Bruch</guilabel> mit dem Nenner <guilabel>Sechzehntel 1/16</guilabel> wird als <quote>1 6/16</quote>, der besten Näherung, dargestellt.

source: Date
de: Datum

source: To enter a date, you should enter it in one of the formats set in &systemsettings; in <menuchoice><guimenu>Locale</guimenu> <guisubmenu>Country/Region &amp; Language</guisubmenu><guimenuitem>Date &amp; Time</guimenuitem></menuchoice>. There are two formats set here: the date format and the short date format.
de: Ein Datum müssen Sie in den Formaten, die in den &systemsettings; in <menuchoice><guimenu>Regionales</guimenu><guisubmenu>Land/Region &amp; Sprache</guisubmenu> <guimenuitem>Datum &amp; Zeit</guimenuitem></menuchoice> eingestellt sind, eingeben. Hier gibt es das Langformat und das Kurzformat für Datum.

source: A random natural number NN will be transformed in the date from 30st December 1899 (which is 0) with the number of days NN added. For example if you have a cell with 100 and you choose <guilabel>Date</guilabel> format, "1900-04-09" will be displayed in the cell which is 100 days after 30st December 1899. This starting date is two days early as it was a bug in Lotus 123 and then it stayed that way in Excel in order to keep compatibility. Few people will need to calculate from 1st January 1900 anyway and adding 9 days to 1st November 2000 for example will give you 10th November 2000 so all normal calculations on dates are correct.
de: Eine beliebige natürliche Zahl N wird in das Datum 30. Dezember 1899 (Beginn der Zählung) plus N Tage übersetzt. Wenn zum Beispiel 100 als Zahl in einer Zelle eingeben ist und Sie das Format <guilabel>Datum</guilabel> einstellen, wird <quote>9.4.1900</quote> in der Zelle angezeigt, das sind 100 Tage nach dem 30. Dezember 1899. Das Startdatum liegt zwei Tage vor dem ersten Tag des Jahrhunderts (ein Fehler in Lotus 123, der auch in Excel übernommen wurde, um kompatibel zu bleiben). Dieser Fehler spielt aber bei den üblichen Berechnung von Daten keine Rolle, wenn Sie zum Beispiel 10 Tage zum 1. November 2000 addieren, erhalten Sie das richtige Ergebnis 10. November 2000.

source: When a cell is in the <guilabel>Date</guilabel> format, you can drag this cell down as you do with numbers and the next cells will also get dates, each date being increased by one day.
de: Eine Zelle mit dem Format <guilabel>Datum</guilabel> können Sie wie Zellen mit Zahlen nach unten ziehen und die folgenden Zellen werden auch als Datum mit aufsteigenden Tagesdaten ausgefüllt.

source: Time
de: Zeit

source: This formats your cell content as a time. To enter a time, you should enter it in the <guilabel>Time format</guilabel> set in &systemsettings; in <menuchoice><guimenu>Locale</guimenu> <guisubmenu>Country/Region &amp; Language</guisubmenu><guimenuitem>Date &amp; Time</guimenuitem></menuchoice>. In the <guilabel>Cell Format</guilabel> dialog box you can set how the time should be displayed by choosing one of the available time format options. The default format is the system format set in &systemsettings;. When the number in the cell does not make sense as a time, &sheets; will display 00:00 in the global format you have in &systemsettings;.
de: Diese Format zeigt den Inhalt der Zelle als Zeit an. Zeiten müssen Sie im <guilabel>Zeitformat</guilabel>, das in den &systemsettings; in <menuchoice><guimenu>Regionales</guimenu><guisubmenu>Land/Region &amp; Sprache</guisubmenu> <guimenuitem>Datum &amp; Zeit</guimenuitem></menuchoice> eingestellt ist, eingeben. Im Dialog <guilabel>Zellenformat</guilabel> können Sie die Darstellung von Zeiten aus einer Liste mit vorgegebenen Formaten wählen. Als Standard wird das Format aus dem &systemsettings; verwendet. Wenn der Wert einer Zelle nicht sinnvoll als Zeitformat dargestellt werden kann, wird 00:00 im allgemeinen Format aus den &systemsettings; angezeigt.

source: Date and Time
de: Datum und Zeit

source: This formats your cell content as date and time. To enter a date and a time, you should enter it in the <guilabel>Time format</guilabel> set in &systemsettings; in <menuchoice><guimenu>Locale</guimenu> <guisubmenu>Country/Region &amp; Language</guisubmenu><guimenuitem>Date &amp; Time</guimenuitem></menuchoice>. In the <guilabel>Cell Format</guilabel> dialog box you can set how the date and time should be displayed by choosing one of the available date and time format options. The default format is the system format set in &systemsettings;. When the number in the cell does not make sense as a date and time, &sheets; will display 00:00 in the global format you have in &systemsettings;.
de: Diese Format zeigt den Inhalt der Zelle als Datum und Zeit an. Datum und Zeit müssen Sie im <guilabel>Zeitformat</guilabel>, das in den &systemsettings; in <menuchoice><guimenu>Regionales</guimenu><guisubmenu>Land/Region &amp; Sprache</guisubmenu> <guimenuitem>Datum &amp; Zeit</guimenuitem></menuchoice> eingestellt ist, eingeben. Im Dialog <guilabel>Zellenformat</guilabel> können Sie die Darstellung von Datum und Zeit aus einer Liste mit vorgegebenen Formaten wählen. Als Standard wird das Format aus dem &systemsettings; verwendet. Wenn der Wert einer Zelle nicht sinnvoll als Datum und Zeit dargestellt werden kann, wird 00:00 im allgemeinen Format aus den &systemsettings; angezeigt.

source: This formats your cell content as text. This can be useful if you want a number treated as text instead as a number, for example for a ZIP code. Setting a number as text format will left justify it. When numbers are formatted as text, they cannot be used in calculations or formulas. It also change the way the cell is justified.
de: Diese Einstellung formatiert den Zelleninhalt als Text. Das kann nützlich sein, wenn eine Zahl als Text und nicht als Zahl behandelt werden soll, beispielsweise Postleitzahlen. Eine als Text formatierte Zahl wird linksbündig ausgerichtet. Wenn Zahlen als Text formatiert werden, können sie nicht in Berechnungen oder Formeln verwendet werden. Außerdem ändert sich dadurch die Ausrichtung innerhalb der Zellen.

source: Custom
de: Benutzerdefiniert

source: Does not work yet. To be enabled in the next release.
de: Zurzeit noch nicht verfügbar, erst in der nächsten Version.

source: The lower part of the <guilabel>Data Format</guilabel> page lets you add a <guilabel>Prefix:</guilabel> such as a $ symbol at the start of each item or a <guilabel>Postfix:</guilabel> such as $HK to the end. You can also control how many digits are displayed after the decimal point for numeric values, whether positive values are displayed with a leading + sign and whether negative values are shown in red.
de: Im unteren Teil der Seite <guilabel>Datenformat</guilabel>können Sie ein <guilabel>Präfix</guilabel> wie ein $-Symbol am Anfang jeder Zelle oder ein <guilabel>Postfix</guilabel> wie $HK am Ende hinzufügen. Sie können auch einstellen, wieviele Stellen nach dem Dezimalkomma für numerische Werte angezeigt werden, und ob positive Werte mit einem führenden +-Zeichen angezeigt werden und ob negative Werte in Rot angezeigt werden sollen.

source: Fonts and Text Settings
de: Schriften und Texteinstellungen

source: Font page.
de: Die Seite Schriftart.

source: The <guilabel>Font</guilabel> page lets you select the font family, <guilabel>Style:</guilabel>, <guilabel>Size:</guilabel>, <guilabel>Weight:</guilabel> and <guilabel>Color:</guilabel> for the current cell, including some additional options like underlined or striked out text. The lower part of the page gives a <guilabel>Preview</guilabel> of the selected text format.
de: Auf der Seite <guilabel>Schriftart</guilabel> können Sie Schriftfamilie, <guilabel>Stil:</guilabel>, <guilabel>Größe:</guilabel>, <guilabel>Stärke:</guilabel> und <guilabel>Farbe:</guilabel> der Schrift für die gewählten Zellen einstellen, dazu noch Optionen für unterstrichenen und durchgestrichenen Text. Im unteren Teil der Seite sehen Sie eine <guilabel>Vorschau</guilabel> des ausgewählten Textformats.

source: The default font is set for all cells in the <menuchoice><guimenu>Format</guimenu><guimenuitem>Style Manager</guimenuitem></menuchoice> menu with the currently used style.
de: Die Standardschrift setzen Sie im Menü <menuchoice><guimenu> Format</guimenu><guimenuitem>Stilverwaltung</guimenuitem></menuchoice> mit dem Stil Standard.

source: Style:
de: Stil:

source: Choose the style for your font for the currently selected cells. When you select several cells with different styles, the displayed style is set to <guilabel>Varying (No Change)</guilabel> and leaving it that way will keep all your current style settings for each cell. Changing to <guilabel>Roman</guilabel> for example will change all the selected cells style text to <guilabel>Roman</guilabel>.
de: Einstellung des Stils der Schrift für die ausgewählten Zellen. Wenn Sie mehrere Zellen mit unterschiedlichen Stilen ausgewählt haben, wird <guilabel>Unterschiedlich (Keine Änderung)</guilabel> angezeigt. Ohne Änderung behalten alle Zellen den eingestellten Stil. Ändern Sie den Stil zum Beispiel in <guilabel>Unecht Kursiv (Roman)</guilabel>, wird diese Einstellung auf alle ausgewählten Zellen angewendet.

source: Size:
de: Größe:

source: Choose the size for your font for the currently selected cells. When you select several cells with different sizes, the displayed size is set to <guilabel> </guilabel> (no number written) and leaving it that way will keep all your current size settings for each cell. Changing to <guilabel>14</guilabel> for example will change all the selected cells font size to <guilabel>14</guilabel>.
de: Einstellung der Schriftgröße für die ausgewählten Zellen. Wenn Sie mehrere Zellen mit unterschiedlichen Größen ausgewählt haben, wird <guilabel> </guilabel>, also keine Größe angezeigt. Ohne Änderung behalten alle Zellen die eingestellte Schriftgröße. Ändern Sie die Größe zum Beispiel in <guilabel>14</guilabel>, wird diese Einstellung auf alle ausgewählten Zellen angewendet.

source: Weight:
de: Stärke:

source: Choose the weight for your font for the currently selected cells. When you select several cells with different font weight, the displayed weight is set to <guilabel>Varying (No Change)</guilabel> and leaving it that way will keep all your current weight settings for each cell. Changing to <guilabel>Bold</guilabel> for example will change all the selected cells font weight to <guilabel>Bold</guilabel>.
de: Einstellung der Schriftstärke für die ausgewählten Zellen. Wenn Sie mehrere Zellen mit unterschiedlichen Schriftstärken ausgewählt haben, wird <guilabel>Unterschiedlich (Keine Änderung)</guilabel> angezeigt. Ohne Änderung behalten alle Zellen die eingestellte Schriftstärke. Ändern Sie die Schriftstärke zum Beispiel in <guilabel>Fett</guilabel>, wird diese Einstellung auf alle ausgewählten Zellen angewendet.

source: Color:
de: Farbe:

source: Choose the color for the currently selected cells' text. Clicking on the color bar will bring you the standard KDE <guilabel>Select Color</guilabel> dialog where you will be able to choose the new color.
de: Einstellung der Farbe für den Text in den ausgewählten Zellen. Klicken Sie auf das Farbfeld, um den KDE-Standarddialog <guilabel>Farbe auswählen</guilabel> zu öffnen, in dem Sie eine neue Farbe auswählen können.

source: Underline
de: Unterstrichen

source: Underlines the currently selected cells' text if checked. This is not checked per default.
de: Mit dieser Einstellung wird der Text in den ausgewählten Zellen unterstrichen dargestellt. In der Standardeinstellung ist dies nicht aktiviert.

source: Strike out
de: Durchgestrichen

source: This will strike out the currently selected cells' text if this is checked. This is not checked per default.
de: Mit dieser Einstellung wird der Text in den ausgewählten Zellen durchgestrichen dargestellt. In der Standardeinstellung ist dies nicht aktiviert.

source: Text Position and Rotation
de: Textposition und -drehung

source: Position page.
de: Die Seite Position.

source: From the <guilabel>Position</guilabel> page you can control the position of text within a cell by making suitable selections in the <guilabel>Horizontal </guilabel> and <guilabel>Vertical</guilabel> areas or by setting the <guilabel>Indent</guilabel> value. You can also choose to have the text appear vertically rather than horizontally, or even at an angle.
de: Auf der Seite <guilabel>Position</guilabel> können Sie die Position des Textes innerhalb einer Zelle festlegen, indem Sie entsprechende Einstellungen in den Bereichen <guilabel>Waagerecht</guilabel> und <guilabel>Senkrecht</guilabel> vornehmen oder indem Sie den Wert für <guilabel>Einzug</guilabel>eingeben. Sie können auch einstellen, dass der Text senkrecht statt waagerecht oder sogar unter einem bestimmten Winkel angezeigt wird.

source: Horizontal
de: Waagerecht

source: Set the content position horizontally in the cell. <guilabel>Standard</guilabel> is default and is set from the data format you choose. <guilabel>Left</guilabel> means the content will be displayed on the left of the cell. <guilabel>Center</guilabel> means the content will be in the center horizontally in the cell. <guilabel>Right</guilabel> means the content of the cell will be displayed on the right of the cell.
de: Mit dieser Einstellung wird der Inhalt einer Zelle waagerecht angezeigt. Mit der Voreinstellung <guilabel>Standard</guilabel> wird der Inhalt entsprechend dem ausgewählten Datentyp angezeigt. Der Inhalt wird mit der Einstellung <guilabel>Links</guilabel> linksbündig, mit <guilabel>Zentriert</guilabel> waagerecht mittig in der Zelle und mit <guilabel>Rechts</guilabel> rechtsbündig dargestellt.

source: Vertical
de: Senkrecht
