Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/calligra/sheets_format.po
Languages: de

source: Set the content position vertically in the cell. <guilabel>Top</guilabel> means the content will be displayed on top of the cell. <guilabel>Middle</guilabel> means the content will be in the middle vertically in the cell. <guilabel>Bottom</guilabel> means the content of the cell will be displayed at the bottom of the cell.
de: Mit dieser Einstellung wird der Inhalt einer Zelle senkrecht angezeigt. Der Inhalt wird mit der Einstellung <guilabel>Oben</guilabel> oben, mit <guilabel>Zentriert</guilabel> senkrecht mittig in der Zelle und mit <guilabel>Unten</guilabel> unten dargestellt.

source: Text Option
de: Text-Einstellungen

source: This is only available when the rotation is 0°. <guilabel>Wrap text</guilabel> wraps the text so it fits in the previous cell size. If this is not checked, the text will stay on one line.
de: Diese Einstellungen sind nur für Zellen mit 0 Grad Drehung möglich. Mit <guilabel>Text umbrechen</guilabel> werden die Zeilen so umgebrochen, das der Text in die vorhandene Zellen passt. Ist diese Einstellung nicht ausgewählt, wird der Text ohne Zeilenumbruch angezeigt.

source: <guilabel>Vertical text</guilabel> puts your text vertically.
de: Mit der Einstellung <guilabel>Senkrechter Text</guilabel> wird der Text senkrecht ausgerichtet.

source: Rotation
de: Drehung

source: Your text will appear oriented in the angle you set here. Positive values will move it counter-clockwise and negative values will move it clockwise.
de: Ihr Text wird in dem hier eingestellten Winkel ausgerichtet. Positive Werte drehen den Text im Uhrzeigersinn, negative entgegen dem Uhrzeigersinn.

source: Merge Cells
de: Zellen verbinden

source: When checked, this has the same effect as <menuchoice><guimenu>Format</guimenu><guimenuitem>Merge Cells</guimenuitem></menuchoice>. You need to have at least two consecutive cells selected. Those consecutive cells are then merged into a bigger one.
de: Diese Einstellung können Sie auch im Menü <menuchoice><guimenu>Format</guimenu> <guimenuitem>Zellen verbinden</guimenuitem></menuchoice> aktivieren. Sie müssen dazu mindestens zwei benachbarte Zellen ausgewählt haben. Diese Zellen werden dann zu einer großen Zelle zusammengefasst.

source: When a merged cell is selected and when you uncheck this, then all cells come back to their original size as before the merging. It has the same effect as <menuchoice><guimenu>Format</guimenu><guimenuitem>Dissociate Cells</guimenuitem></menuchoice>.
de: Wenn sie verbundene Zellen ausgewählt haben und diese Einstellung abschalten, erhalten alle Zellen wieder die ursprüngliche Größe wie vor der Verbindung. Im Menü finden Sie diese Einstellung unter <menuchoice><guimenu>Format</guimenu> <guimenuitem>Zellen trennen</guimenuitem></menuchoice>.

source: Indent
de: Einzug

source: Set the amount of indent that will be used in the cell when you choose the <guilabel>Increase Indent</guilabel>/<guilabel>Decrease Indent</guilabel> actions from the toolbar. These actions are not enabled by default in the toolbar.
de: Legt den Wert den Einzugs des Inhalts der Zellen für die Funktion <guimenu>Einzug vergrößern</guimenu> oder <guimenu>Einzug verkleinern</guimenu> fest. Als Voreinstellung sind diese Aktionen nicht in der Werkzeugleiste.

source: Size of Cell
de: Zellengröße

source: You set here the size of the cell, either a custom width and height or choose the default width and height.
de: Stellen Sie hier die Größe der Zellen ein, entweder mit benutzerdefinierten Werten für Breite und Höhe oder mit den Standardwerten.

source: Cell Border
de: Zellenumrandung

source: Border page.
de: Die Seite Umrandung.

source: The <guilabel>Border</guilabel> page lets you set the appearance of the cell borders. If you have selected more than one cell you can apply different styles to the borders between the cells and that surrounding the selected area.
de: Auf der Seite <guilabel>Umrandung</guilabel> können Sie das Aussehen der Zellenränder einstellen. Wenn Sie mehr als eine Zelle ausgewählt haben, können Sie unterschiedliche Arten von Rändern zwischen den Zellen und um den ausgewählten Bereich herum angeben.

source: First select the pattern and color from the <guilabel>Pattern</guilabel> section of the <guilabel>Border</guilabel> page then apply that to different parts of the border by clicking on the appropriate button in the <guilabel>Border</guilabel> section, or on one of the <guilabel>Preselect </guilabel> buttons. The left hand button in the <guilabel>Preselect </guilabel> section will clear any previously applied border(s). Note that you can also add a diagonal strike-through line to the cell(s).
de: Wählen Sie zuerst das Muster und die Farbe im Abschnitt <guilabel>Muster</guilabel> der Seite <guilabel>Umrandung</guilabel> aus und wenden Sie diese Einstellung dann auf die unterschiedlichen Teile des Randes an, indem Sie auf den passenden Knopf im Abschnitt <guilabel>Umrandung</guilabel> oder auf einen passenden Knopf der <guilabel>Vorauswahl</guilabel> klicken. Der linke Knopf im Abschnitt <guilabel>Vorauswahl</guilabel> löscht die vorher ausgewählten Ränder. Beachten Sie, dass Sie auch diagonale Durchkreuzungslinien zu den Zellen hinzufügen können.

source: Cell Background
de: Zellenhintergrund

source: Background page.
de: Die Seite Hintergrund.

source: The cell background pattern and color can be selected from the <guilabel>Background</guilabel> page.
de: Das Muster und die Farbe des Zellenhintergrundes können Sie auf der Seite <guilabel>Hintergrund</guilabel> auswählen.

source: Simply choose a desired <guilabel>Pattern</guilabel>, then select the pattern <guilabel>Color</guilabel> and the <guilabel>Background color</guilabel>.
de: Wählen Sie das gewünschte <guilabel>Muster</guilabel>, dann die Farbe des <guilabel>Muster</guilabel>s sowie die <guilabel>Hintergrundfarbe</guilabel> aus.

source: At the bottom of this page you can see a <guilabel>Preview</guilabel> of the configured cell background.
de: Unten auf dieser Seite können Sie eine <guilabel>Vorschau</guilabel> des eingestellten Zellenhintergrunds sehen.

source: Cell Protection
de: Zellenschutz

source: Cell protection page.
de: Die Seite Zellenschutz.

source: You can change the way the content of a cell is protected in the <guilabel>Cell Protection</guilabel> page.
de: Den Schutz für Zellen stellen Sie auf der Seite <guilabel>Zellenschutz</guilabel> ein.

source: All cells are protected by default (that means cell content cannot be changed) and for the cell protection to be active you also need to protect the sheet using the <menuchoice><guimenu>Tools</guimenu><guimenuitem>Protect Sheet...</guimenuitem></menuchoice> menu and to provide a password. You can also hide the cell formula in order to protect the way you calculate the formula. This also needs to enable sheet protection to work. You can hide the cell content with <guilabel>Hide all</guilabel> and again this needs sheet protection. You can learn more about all these settings in the <link linkend="protection">Advanced &sheets; chapter, Protection section</link>.
de: Alle Zellen sind in der Standardeinstellung geschützt, d. h. der Inhalt kann nicht geändert werden. Damit dieser Schutz wirksam wird, müssen Sie zusätzlich noch den Schutz der Tabelle mit <menuchoice><guimenu>Extras</guimenu> <guimenuitem>Tabelle schützen ...</guimenuitem></menuchoice> und der Eingabe eines Passworts einschalten. Sie können zusätzlich auch die Formeln ausblenden, damit die Art der Berechnung nicht erkennbar ist, oder auch die Anzeige des gesamten Inhalts der Zelle mit <guilabel>Alles ausblenden</guilabel> abschalten. Auch dafür ist der Schutz der Tabelle erforderlich. Weitere Einzelheiten über diese Einstellungen finden Sie im Abschnitt <link linkend="protection">Schutz in &sheets;</link>.

source: Hide all
de: Alles ausblenden

source: This hides the cell content and works only when the sheet is protected which means that changing the <guilabel>Hide all</guilabel> attribute of a cell has no effect unless the sheet is protected. Whether the cell itself is protected or not does not matter.
de: Damit wird die Anzeige des Inhalts der Zellen ausgeblendet, aber nur, wenn die Tabelle geschützt ist. Die Einstellung <guilabel>Alles ausblenden</guilabel> funktioniert nur dann, wenn die Tabelle geschützt ist. Ob die Zelle geschützt ist oder nicht, spielt dabei keine Rolle.

source: When <guilabel>Hide all</guilabel> is selected, <guilabel>Protected</guilabel> and <guilabel>Hide formula</guilabel> are disabled as when the sheet is protected <guilabel>Hide all</guilabel> hides the cell content and the formula and thus masks and protects the cell content.
de: Wenn Sie <guilabel>Alles ausblenden</guilabel> ausgewählt haben, können Sie die Einstellungen <guilabel>Geschützt</guilabel> und <guilabel>Formel ausblenden</guilabel> nicht mehr verändern, genauso wie in einer geschützten Tabelle. Mit <guilabel>Alles ausblenden</guilabel> wird der Wert in der Zelle wie auch die Formeln nicht angezeigt und damit der Inhalt der Zelle geschützt.

source: Protected
de: Geschützt

source: If checked, the cell content will be protected. This is the default behaviour. You need to protect the whole sheet using the <menuchoice><guimenu>Tools</guimenu><guimenuitem>Protect Sheet...</guimenuitem></menuchoice> menu for this individual cell protection to work. When a cell is protected, its content cannot be changed.
de: Mit dieser Einstellung wird der Inhalt der Zelle geschützt. Das ist die Standardeinstellung. Sie müssen zusätzlich die gesamte Tabelle mit <menuchoice><guimenu>Extras</guimenu> <guimenuitem>Tabelle schützen ...</guimenuitem></menuchoice> schützen, damit der Schutz für einzelne Zellen eingeschaltet wird. Der Inhalt einer geschützten Zellen kann nicht geändert werden.

source: Hide formula
de: Formel ausblenden

source: When this is checked, the cell is still visible. However, its contents do not appear in the <guilabel>Formula</guilabel> bar. Hiding formula is only working for cells that contain formulae so the user cannot view the formula. And the sheet must be protected for this to work.
de: Wenn diese Einstellung aktiviert ist, wird die Zelle immer noch angezeigt, ihr Inhalt erscheint aber nicht in der <guilabel>Formelleiste</guilabel>. <quote>Formel ausblenden</quote> funktioniert nur für Zellen mit Formeln. Die gesamte Tabelle muss dafür geschützt werden.

source: Do not print text
de: Text nicht drucken

source: If you check <guilabel>Do not print text</guilabel> then the text in the cell will not be printed. This is unchecked per default which means that the cell text will always be printed by default.
de: Mit dieser Einstellung wird der Text in den ausgewählten Zellen nicht ausgedruckt. In der Standardeinstellung ist dies nicht aktiviert und der Text in Zellen wird immer gedruckt.

source: Conditional Cell Attributes
de: Bedingte Zellenattribute

source: You can make the appearance of a cell change according to the value it contains, useful perhaps if you are using &sheets; to keep track of your household expenses and want to highlight any item greater than, say, one thousand dollars.
de: Sie können das Darstellung der Werte in einer Zelle abhängig von dem darin enthaltenen Wert ändern lassen. Das ist z. B. nützlich, wenn Sie &sheets; verwenden, um die Übersicht über Ihre Haushaltungskosten zu behalten und alle Einzelposten größer als tausend Euro hervorheben wollen.

source: To do this select the cell(s) then choose <guimenuitem>Conditional Styles...</guimenuitem> from the <guimenu>Format</guimenu> menu. This will bring up the <guilabel>Conditional Styles</guilabel> dialog box where you can make the font type and color of a cell change when the value meets one or more conditions. Note that the second and third conditions only apply if the previous condition(s) are not met.
de: Dazu wählen Sie die zunächst die Zellen aus, dann <guimenuitem>Bedingte Stile ...</guimenuitem> im Menü <guimenu>Format</guimenu>. Damit öffnen Sie den Dialog <guilabel>Bedingte Stile</guilabel>. hier können Sie einstellen, dass sich der Schrifttyp und die Farbe einer Zelle ändern, wenn deren Werte eine oder mehrere Bedingungen erfüllen. Beachten Sie, dass die zweite und dritte Bedingung nur dann angewendet wird, wenn die vorhergehende Bedingung nicht zutrifft.

source: Use <menuchoice><guisubmenu>Clear</guisubmenu><guimenuitem>Conditional Styles</guimenuitem></menuchoice> from the <guimenu>Edit</guimenu> menu to clear any conditional attributes from selected cells.
de: Wählen Sie <menuchoice><guisubmenu>Leeren</guisubmenu> <guimenuitem>Bedingte Stile</guimenuitem></menuchoice> im Menü <guimenu>Bearbeiten</guimenu>, um die bedingten Zellenattribute von ausgewählten Zellen zu löschen.

source: Changing Cell Sizes
de: Ändern der Zellengröße

source: The <guilabel>Position</guilabel> page in the <guilabel>Cell Format</guilabel> dialog lets you alter the size of the selected cell(s). Note that changing the height of a single cell will change the height for all cells in that row, similarly changing the width will affect the entire column.
de: Auf der Seite <guilabel>Position</guilabel> im Dialog <guilabel>Zellenformat</guilabel> können Sie die Größe der ausgewählten Zellen ändern. Wenn Sie die Höhe einer einzelnen Zelle ändern, wird die Höhe für alle Zellen in der zugehörigen Zeile ebenfalls geändert. Auch wenn Sie die Breite einer Zelle ändern, gilt das für die ganze Spalte.

source: You can also select the row(s) or column(s) to be changed then select <guimenuitem>Resize Row...</guimenuitem> or <guimenuitem>Resize Column...</guimenuitem> from the <mousebutton>right</mousebutton> mouse button pop up menu or from the <menuchoice><guimenu>Format</guimenu><guisubmenu>Row</guisubmenu> </menuchoice> or <menuchoice><guimenu>Format</guimenu><guisubmenu> Column</guisubmenu></menuchoice> menu.
de: Sie können auch Zeilen oder Spalten auswählen und dann <guimenuitem>Zeilenhöhe ändern ...</guimenuitem> oder <guimenuitem>Spaltenbreite ändern ...</guimenuitem> aus dem Kontextmenü der <mousebutton>rechten</mousebutton> Maustaste oder im Untermenü <menuchoice><guimenu>Format</guimenu> <guisubmenu>Zeile</guisubmenu></menuchoice> oder <menuchoice> <guimenu>Format</guimenu> <guisubmenu>Spalte</guisubmenu></menuchoice> wählen.

source: If you move the mouse cursor so that its tip is over the line between two of the row numbers at the left of &sheets;'s window the cursor will change to show two parallel lines each with a short arrow headed line coming from it. When the cursor is in this state you can hold the <mousebutton>left </mousebutton> mouse button down and drag the border between the two rows, changing the height of the upper row. A similar technique can be used to change the width of a column.
de: Wenn Sie den Mauszeiger so über die Zeilenzahlen links von der Tabelle bewegen, dass die Spitze des Mauszeigers genau auf die Linie zwischen zwei Zeilen zeigt, ändert sich der Zeiger zu zwei waagerechten Linien mit zwei Pfeilen, die nach oben und nach unten zeigen. Wenn der Mauszeiger so aussieht, können Sie die &LMB; gedrückt halten und durch eine Auf- oder Abwärtsbewegung des Mauszeigers die Höhe der entsprechenden Zeile verändern. Entsprechend kann man die Spaltenbreiten verändern, indem man den Mauszeiger auf die senkrechte Linie zwischen zwei Spaltenbuchstaben bewegt und die Spaltengrenze hin- und herzieht.

source: To set the row height or column width to the minimum needed to display the contents, select the whole row or column, and click with the &RMB; on the row or column label. In the menu which appears, select <guimenuitem>Adjust Row</guimenuitem> or <guimenuitem>Adjust Column</guimenuitem>. The row or column will resize to the minimum necessary. You can also select a single cell or range of cells, and click <guimenuitem>Adjust Row &amp; Column</guimenuitem> from either the &RMB; popup menu or the <guimenu>Format</guimenu> menu.
de: Um die Zeilenhöhe oder die Spaltenbreite soweit zu verringern, dass noch der gesamte Inhalt angezeigt wird, wählen Sie eine ganze Zeile oder Spalte aus und klicken mit der <mousebutton>rechten</mousebutton> Maustaste auf die Zeilen- oder Spaltenbeschriftung. Wählen Sie im Kontextmenü <guimenuitem>Zeile anpassen</guimenuitem> oder <guimenuitem>Spalte anpassen</guimenuitem>. Die Zeile oder Spalte wird dadurch auf die erforderliche Mindestgröße gebracht. Sie können auch eine einzelne Zelle oder einen Zellenbereich auswählen und <guimenuitem>Zeile und Spalte anpassen</guimenuitem> im Kontextmenü der <mousebutton>rechten</mousebutton> Maustaste oder im Menü <guimenu>Format</guimenu> auswählen.

source: You can make a number of adjacent rows or columns the same size by selecting them then choosing <menuchoice><guimenu>Format</guimenu><guisubmenu> Row</guisubmenu><guimenuitem>Equalize Row</guimenuitem></menuchoice> or <menuchoice><guimenu>Format</guimenu><guisubmenu>Column</guisubmenu> <guimenuitem>Equalize Column</guimenuitem></menuchoice>.
de: Sie können einer Anzahl von nebeneinander liegenden Zeilen oder Spalten die gleiche Breite oder Höhe geben, indem Sie diese auswählen und danach <menuchoice><guimenu>Format</guimenu><guisubmenu>Zeile</guisubmenu><guimenuitem>Zeilen ausgleichen</guimenuitem></menuchoice> oder <menuchoice><guimenu>Format</guimenu><guisubmenu>Spalte</guisubmenu><guimenuitem>Spalten ausgleichen</guimenuitem></menuchoice> wählen.

source: Merging Cells
de: Zellen verbinden

source: It is often convenient to have one cell that spreads across two or more columns or down more than one row. This can be done by merging two or more cells into one. Select the cells to be merged than choose <menuchoice><guimenu> Format</guimenu><guimenuitem>Merge Cells</guimenuitem></menuchoice>.
de: Es ist häufig nützlich, eine Zelle zu haben, die über zwei oder mehr Spalten reicht oder mehr als eine Zeile hoch ist. Solche Zellen können erzeugt werden, indem man zwei oder mehr Zellen zu einer einzigen verbindet. Wählen Sie die zu verbindenden Zellen aus und wählen Sie dann <menuchoice><guimenu>Format</guimenu><guimenuitem>Zellen verbinden</guimenuitem></menuchoice>.

source: To reverse this process, select the merged cell then choose <guimenuitem> Dissociate Cells</guimenuitem> from the <guimenu>Format</guimenu> menu.
de: Um diesen Verbindung aufzuheben, wählen Sie zunächst die verbundenen Zellen aus und wählen dann <guimenuitem>Zellen trennen</guimenuitem> im Menü <guimenu>Format</guimenu> aus.

source: Hiding Rows and Columns
de: Zeilen und Spalten ausblenden

source: A finished spreadsheet can often be made to look more attractive by hiding the cells containing intermediate calculations so that only the important data input and result areas are shown.
de: Eine fertige Tabelle sieht häufig besser aus, wenn Sie Zellen mit Zwischenberechnungen ausblenden, und wenn nur die Zellen mit wichtigen Daten und Ergebnissen anzeigt werden.

source: In &sheets; you can hide selected rows or columns by using the <guimenuitem>Hide Rows</guimenuitem> and <guimenuitem>Hide Columns</guimenuitem> options from the <menuchoice><guimenu>Format</guimenu> <guisubmenu>Row</guisubmenu></menuchoice>, <menuchoice><guimenu>Format </guimenu><guisubmenu>Column</guisubmenu></menuchoice> or <mousebutton>right</mousebutton> mouse button menus. Hidden rows and columns are not displayed on the screen or included in a print out.
de: In &sheets; können Sie ausgewählte Zeilen oder Spalten ausblenden, indem sie <guimenuitem>Zeilen ausblenden</guimenuitem> oder <guimenuitem>Spalten ausblenden</guimenuitem> im Menü <menuchoice><guimenu>Format</guimenu><guisubmenu>Zeile</guisubmenu></menuchoice> oder im <menuchoice><guimenu>Format</guimenu><guisubmenu>Spalte</guisubmenu></menuchoice> oder im Kontextmenü der <mousebutton>rechten</mousebutton> Maustaste wählen. Ausgeblendete Zeilen und Spalten werden nicht auf dem Bildschirm angezeigt und auch nicht ausgedruckt.

source: Hiding cells in this way also makes them slightly less prone to accidental change.
de: Das Ausblenden von Zellen bietet auch einen gewissen Schutz vor unbeabsichtigten Änderungen.

source: To un-hide a row or column select <menuchoice><guisubmenu>Row </guisubmenu><guimenuitem>Show Rows...</guimenuitem></menuchoice> or <menuchoice><guisubmenu>Column</guisubmenu><guimenuitem>Show Columns...</guimenuitem> </menuchoice> from the <guimenu>Format</guimenu> menu. In the dialog box which appears, you can select any number of rows to show.
de: Um eine Zeile oder Spalte wieder anzuzeigen, wählen Sie <menuchoice><guisubmenu>Zeile</guisubmenu> <guimenuitem>Zeilen anzeigen ...</guimenuitem></menuchoice> oder <menuchoice><guisubmenu>Spalte</guisubmenu> <guimenuitem>Spalten anzeigen ...</guimenuitem></menuchoice> im Menü <guimenu>Format</guimenu>. Im Dialogfenster können Sie jede beliebige Zeilenzahl wählen, die angezeigt werden soll.

source: Sheet properties
de: Tabellen-Eigenschaften

source: You can access the current sheet properties either by right clicking on the sheet tab and choosing <guilabel>Sheet Properties</guilabel> or by using the <menuchoice><guimenu>Format</guimenu> <guisubmenu>Sheet</guisubmenu><guimenuitem>Sheet Properties</guimenuitem></menuchoice> menu. Please note that you can only access the <guilabel>Sheet Properties</guilabel> when the document or the sheet is not protected.
de: Die Eigenschaften der gewählten Tabelle können Sie entweder mit der Auswahl von <guilabel>Tabelleneigenschaften</guilabel> aus dem Kontextmenü der <mousebutton>rechten</mousebutton> Maustaste oder im Menü <menuchoice><guimenu>Format</guimenu> <guisubmenu>Tabelle</guisubmenu> <guimenuitem>Tabelleneigenschaften</guimenuitem></menuchoice> bearbeiten. Den Dialog <guilabel>Tabelleneigenschaften</guilabel> können Sie aber nur öffnen, wenn die Tabelle und das Dokument nicht geschützt sind.

source: You can set different properties that will be valid in the current sheet. Clicking on <guibutton>OK</guibutton> will validate your changes and <guibutton>Defaults</guibutton> will bring back the default settings.
de: Hier können Sie alle Eigenschaften der aktuellen Tabelle einstellen. Mit <guibutton>OK</guibutton> werden die Änderungen übernommen, mit <guibutton>Voreinstellungen</guibutton> werden die Standardeinstellungen wieder hergestellt.

source: Sheet Properties dialog.
de: Der Dialog Tabelleneigenschaften.

source: Layout direction:
de: Layout-Ausrichtung:

source: Let you choose the sheet orientation. Default is that the first column of the sheet is on the left. If you choose <guilabel>Right to Left</guilabel>, then the first column will be on the right and the others added from right to left.
de: Einstellung der Richtung in der Tabelle. Als Standard liegt die erste Spalte der Tabelle links. Wenn Sie <guilabel>Rechts nach Links</guilabel> einstellen, befindet sich die erste Spalte der Tabelle rechts und alle anderen werden links eingefügt.

source: Hide zero
de: Nullen ausblenden

source: If this box is checked any cell containing the value zero will appear blank.
de: Ist diese Einstellung aktiviert, wird jede Zelle mit einer Null als leere Zelle angezeigt.

source: Automatic recalculation
de: Automatische Neuberechnung

source: This setting controls whether formulae are recalculated automatically when the value of any cell they refer to changes.
de: Ist diese Einstellung aktiviert, werden Formeln automatisch neu berechnet, wenn sich der Wert einer bezogenen Zelle ändert.

source: Show column as numbers
de: Spalten als Nummern anzeigen

source: If this box is checked the column headings will show as numbers rather than as letters. Letters are default.
de: Ist diese Einstellung aktiviert, werden die Spaltenüberschriften als Nummern und nicht als Buchstaben angezeigt. Buchstaben sind die Standardeinstellung.

source: Use LC mode
de: LC-Modus verwenden
