Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/calligra/sheets_configdialog.po
Languages: de

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Hans-Frieder</firstname><surname>Hirsch</surname><affiliation><address><email>f.hirsch@t-online.de</email></address></affiliation><contrib>Deutsche Übersetzung</contrib></othercredit> <othercredit role="translator"><firstname>Johannes</firstname><surname>Schwall</surname><affiliation><address><email>johannes.schwall@gmail.com</email></address></affiliation><contrib>Deutsche Übersetzung</contrib></othercredit>

source: The &sheets; Configuration Dialog Box
de: Der Einrichtungsdialog von &sheets;

source: Selecting <menuchoice><guimenu>Settings</guimenu><guimenuitem> Configure &sheets;...</guimenuitem></menuchoice> opens a dialog box with several pages, selected with the icons at the left of the dialog box, which allow you to change many aspects of &sheets;'s operation.
de: Wenn Sie <menuchoice><guimenu>Einstellungen</guimenu> <guimenuitem>&sheets; einrichten ...</guimenuitem></menuchoice> wählen, wird ein Dialog mit mehreren Seiten geöffnet. Klicken Sie auf ein Symbol links im Dialog, um eine Seite auszuwählen. Auf diesen Seiten können Sie viele Einstellungen von &sheets; ändern.

source: Interface
de: Oberfläche

source: Interface Configuration.
de: Einrichtung der Oberfläche

source: Cursor movement after pressing Enter:
de: Cursor-Bewegung nach Drücken der Eingabetaste:

source: Select whether pressing the &Enter; key will move the cursor <guilabel>Down</guilabel>, <guilabel>Up</guilabel>, <guilabel>Right</guilabel>, <guilabel>Left</guilabel>, <guilabel>Down, First Column</guilabel> or <guilabel>None</guilabel> as determined by the setting in this drop down selection box.
de: Wenn Sie eine Zelle ausgewählt haben und danach die Taste &Enter; drücken, wird der Cursor <guilabel>Nach unten</guilabel>, <guilabel>Nach oben</guilabel>, nach <guilabel>Rechts</guilabel>, nach <guilabel>Links</guilabel> oder <guilabel>Nach unten, erste Spalte</guilabel> oder nicht verschoben, je nachdem, was Sie hier ausgewählt haben.

source: Function shown in the status bar:
de: In der Statusleiste gezeigte Funktion:

source: This drop down selection box can be used to choose the calculation performed by the <link linkend="statusbarsum">Statusbar Summary </link> function.
de: Hier können Sie wählen, welche Berechnung standardmäßig vom <link linkend="statusbarsum">Ergebnisfeld in der Statuszeile</link> angezeigt wird.

source: Unit:
de: Einheit:

source: Choose the default unit that will be used in your sheets.
de: Wählen Sie die Standardeinheit, die in Ihren Tabellen verwendet wird.

source: Indentation step:
de: Einzugsschritt:

source: Set the amount of indent that will be used in the cell when you choose the <guilabel>Increase Indent</guilabel>/<guilabel>Decrease Indent</guilabel> actions from the toolbar. These actions are not enabled by default in the toolbar.
de: Legt den Wert den Einzugs des Inhalts der Zellen für die Funktion <guimenu>Einzug vergrößern</guimenu> oder <guimenu>Einzug verkleinern</guimenu> fest. Als Voreinstellung sind diese Aktionen nicht in der Werkzeugleiste.

source: Capture all navigation keys while editing
de: Alle Navigationstasten bei der Zellenbearbeitung verwenden

source: Captures all navigation keys, &ie; the arrow keys, page up/down, tabulator and backward tabulator key, while editing a cell with the embedded editor. The embedded editor is the one appearing directly in the cell. If captured, these keys are used for navigating in the editor. Otherwise, they are used for cell navigation.
de: Alle Navigationstasten, &ie; die Cursor-Tasten. die Tasten Bild ab/auf, die Tabulatortaste und die Rückschritttaste werden beim Editieren direkt in einer Zelle für die Bearbeitung benutzt. Ist diese Einstellung aktiviert, werden diese Tasten für die Navigation im Editor verwendet. Ist diese Einstellung abgeschaltet, werden die Tasten für die Zellennavigation verwendet.

source: The <guilabel>Colors</guilabel> section lets you choose the color of the sheet grid. If you do not want the grid to appear at all, uncheck the <guilabel>Show grid</guilabel> box in the <menuchoice><guimenu>Format</guimenu> <guisubmenu>Sheet</guisubmenu><guimenuitem>Sheet Properties</guimenuitem></menuchoice> dialog.
de: In diesem Bereich des Einrichtungsdialogs können Sie die Farbe des Gitterlinien in der Tabelle wählen. Wenn das Gitter nicht angezeigt werden soll, deaktivieren Sie <guilabel>Gitter anzeigen</guilabel> im Dialog <menuchoice><guimenu>Format</guimenu> <guisubmenu>Tabelle</guisubmenu> <guimenuitem>Tabelleneigenschaften</guimenuitem></menuchoice>.

source: This section also lets you select the color of the lines used to indicate the printed page borders when the <guimenuitem>Page Borders</guimenuitem> box in the <guimenu>View</guimenu> menu is checked.
de: Hier können Sie auch die Farbe der Linien wählen, die in der Tabelle die Seitenränder der gedruckten Seiten anzeigen, wenn <guimenuitem>Seitenumrandungen</guimenuitem> im Menü <guimenu>Ansicht</guimenu>ausgewählt ist.

source: Select <guilabel>Custom</guilabel> from the current color to display the standard &kde; <guilabel>Select Color</guilabel> dialog.
de: Wählen Sie <guilabel>Benutzerdefiniert</guilabel> aus dem Farbfeld, um den Standarddialog von &kde; zur <guilabel>Farbe auswählen</guilabel> zu öffnen.

source: Grid
de: Gitter

source: Click here to change the grid color &ie; the color of the borders of each cell.
de: Klicken Sie hier, um die Gitterfarbe, &ie; die Farbe der Ränder aller Zellen, auszuwählen.

source: Page border
de: Seitenumrandung

source: When the <menuchoice><guimenu>View</guimenu><guimenuitem>Show Page Borders</guimenuitem></menuchoice> menu item is checked, the page borders are displayed. Click here to choose another color for the borders than the default red.
de: Wenn im Menü <menuchoice><guimenu>Ansicht</guimenu><guimenuitem>Seitenränder anzeigen</guimenuitem></menuchoice> ausgewählt ist, werden die Seitenränder angezeigt. Klicken Sie auf das Farbfeld, um für die Ränder eine andere Farbe als das voreingestellte Rot auszuwählen.

source: Open/Save
de: Öffnen/Speichern

source: Open/Save Configuration.
de: Einrichtungsdialog - Öffnen/Speichern

source: Number of entries in Recent Files list:
de: Anzahl der Einträge in der Liste der zuletzt geöffneten Dateien:

source: Controls the maximum number of filenames that are shown when you select <menuchoice><guimenu>File</guimenu><guisubmenu> Open Recent</guisubmenu></menuchoice>.
de: Bestimmt die maximale Anzahl der Dateinamen, die im Menü <menuchoice><guimenu>Datei</guimenu> <guisubmenu>Zuletzt geöffnete Dateien</guisubmenu></menuchoice> angezeigt werden.

source: Autosave interval:
de: Intervall für automatisches Speichern:

source: Here you can select the time between autosaves, or disable this feature altogether by choosing <guilabel>No autosave</guilabel> (by selecting the minimum value).
de: Hier können Sie den Zeitraum zwischen automatischen Sicherungen festlegen oder die automatische Sicherung ganz ausschalten. Dazu wählen Sie <guilabel>Keine automatische Sicherung</guilabel> angezeigt wird.

source: Create backup file:
de: Sicherungsdatei erstellen:

source: Check this box if you want some backup files created. This is checked per default.
de: Aktivieren Sie diese Einstellung, wenn Sicherungskopien erstellt werden sollen. Standardmäßig ist diese Einstellung eingeschaltet.

source: Plugins
de: Module

source: Plugins Configuration.
de: Einrichtung der Module.

source: Check a plugin in the list to enable it. Display the <guilabel>About</guilabel> dialog by clicking the info button at the right side of the list item.
de: Kreuzen Sie ein Modul in der Liste an, um es zu aktivieren. Der Dialog <guilabel>Über</guilabel> wird angezeigt, wenn Sie auf den Info-Knopf rechts neben dem Element in der Liste klicken.

source: Spelling
de: Rechtschreibung

source: Spell Checker Configuration.
de: Einrichtung der Rechtschreibprüfung.

source: This page lets you configure the behavior of &sheets;'s spell checker.
de: Auf dieser Seite können Sie das Verhalten der Rechtschreibprüfung in &sheets; einstellen.

source: For more information please refer to the <ulink url="help:kcontrol/spellchecking">Spell Checker</ulink> documentation.
de: Weitere Information dazu finden Sie in der Dokumentation zur <ulink url="help:kcontrol/spellchecking">Rechtschreibprüfung</ulink>.

source: Author
de: Autor

source: Author Configuration.
de: Einstellungen für Autoren.

source: Choose an author profile for your document.
de: Wählen Sie aus dem Auswahlfeld eine Autorprofil für Ihr Dokument.

source: You can add a new profile or delete the current profile using the buttons to the right of the profiles drop-down list.
de: Um neue Profile hinzuzufügen oder vorhandene zu löschen, benutzen Sie die Knöpfe rechts neben dem Auswahlfeld mit den Autorprofilen.
