Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/calligra/sheets_advanced.po
Languages: de

source: &sheets; can be used to construct <ulink url="http://en.wikipedia.org/wiki/Pivot_table">pivot tables</ulink> using the data of the current table.
de: Mit &sheets; können <ulink url="http://de .wikipedia.org/wiki/Pivot-Tabelle">Pivot-Tabellen</ulink> aus den Daten der aktuellen Tabelle konstruiert werden.

source: This feature can be invoked by selecting <guimenuitem>Pivot...</guimenuitem> from the <guimenu>Data</guimenu> menu. Below is an example of pivot table generation.
de: Diese Funktion wird mit <guimenuitem>Pivot ...</guimenuitem> aus dem Menü <guimenu>Daten</guimenu> aufgerufen. Es folgt ein Beispiel für die Erstellung einer Pivot-Tabelle.

source: Supposing we have the following data.
de: Folgende Daten werden in diesem Beispiel verwendet.

source: Initial table
de: Ursprüngliche Tabelle

source: We want to create a pivot table of our choice and requirement. So we choose <menuchoice> <guimenu>Data</guimenu> <guimenuitem>Pivot...</guimenuitem> </menuchoice>.
de: Um eine Pivot-Tabelle mit den gewünschten Anforderungen zu erstellen, wählen Sie <menuchoice> <guimenu>Daten</guimenu> <guimenuitem>Pivot ...</guimenuitem></menuchoice>.

source: The dialog box that will appear allows user to select the source of data. The data can be taken from the current worksheet or from an external source like a database or <abbrev>ODS</abbrev> file.
de: Im damit aufgerufenen Dialog kann die Quelle der Daten für die Pivot-Tabelle ausgewählt werden. Zur Auswahl stehen das aktuelle Arbeitsblatt oder externe Quellen wie eine Datenbank oder eine <abbrev>ODS</abbrev>-Datei.

source: Choosing the data source
de: Auswahl der Datenquelle

source: Here is the dialog box which allows the user to customize the pivot table. The column labels in the source data are converted to labels which serve as the working fields. The labels can be dragged and dropped into one of three areas (<guilabel>Rows</guilabel>, <guilabel>Columns</guilabel> or <guilabel>Values</guilabel>) to generate the pivot table. You can reset your choices using <guibutton>Reset DnD</guibutton> button.
de: In diesem Dialog kann der Benutzer die Pivot-Tabelle anpassen. Die Überschriften der der Spalten in den Quelldaten werden als Beschriftungen verwendet, die als Arbeitsfelder dienen. Die Beschriftungen können in eine der drei Bereiche (<guilabel>Reihen</guilabel>, <guilabel>Spalten</guilabel> oder <guilabel>Werte</guilabel>) gezogen und abgelegt werden, um die Pivot-Tabelle zu erstellen. Ihre Auswahl können Sie mit <guibutton>Ziehen/Ablegen zurücksetzen</guibutton> wieder löschen.

source: Pivot table customization dialog
de: Einrichtungsdialog der Pivot-Tabelle

source: In our example, <replaceable>Name</replaceable> is dragged to <guilabel>Rows</guilabel>, <replaceable>Category</replaceable> to <guilabel>Columns</guilabel>, <replaceable>Score</replaceable> to <guilabel>Values</guilabel>. User defined functions like sum, average, max, min, count, &etc; can be selected from the <guilabel>Select Option</guilabel> list.
de: In diesem Beispiel wird <replaceable>Name</replaceable> in <guilabel>Zeilen</guilabel>, <replaceable>Kategorie</replaceable> in <guilabel>Spalten</guilabel> und <replaceable>Bewertung</replaceable> in das Feld <guilabel>Werte</guilabel> gezogen.

source: The <guibutton>Add Filter</guibutton> button can be used to open filter dialog box to filter the desired data. Using this box you can define multiple filters based on the column label and the relationship between them (<guimenuitem>And</guimenuitem> or <guimenuitem>Or</guimenuitem>). This would allow extreme freedom to customize the output.
de: Mit dem Knopf <guibutton>Filter hinzufügen</guibutton> können Sie einen Dialog öffnen, um die gewünschten Daten zu Filtern. In diesem Dialog können Sie mehrere Filter auf der Basis der Spaltenüberschriften und deren Beziehungen zueinander (<guimenuitem>Und</guimenuitem> or <guimenuitem>Oder</guimenuitem>) definieren. Damit können Sie die Ausgabe in großem Umfang anpassen.

source: Pivot table filtering dialog
de: Filterdialog der Pivot-Tabelle

source: <guilabel>Total Rows</guilabel> and <guilabel>Total Columns</guilabel>: checking these allow automatic totalling of corresponding rows and columns in the pivot table.
de: <guilabel>Summe der Zeilen</guilabel> und <guilabel>Summe der Spalten</guilabel>: Aktivieren Sie diese Ankreuzfelder, um automatisch Summen der zugehörigen Zeilen und Spalten in der Pivot-Tabelle anzuzeigen.

source: Using more than one Worksheet
de: Arbeiten mit mehreren Tabellen

source: When you start a new, empty, document with &sheets; it will create a number of blank worksheets. The number of sheets it creates is determined by the selected template.
de: Wenn Sie ein neues leeres Dokument mit &sheets; anlegen, enthält es bereits eine Anzahl von leeren Tabellen. Diese Anzahl der Tabellen wird durch die ausgewählte Vorlage festgelegt.

source: <menuchoice><guimenu>Insert</guimenu><guimenuitem>Sheet</guimenuitem> </menuchoice> will add another sheet to the document.
de: <menuchoice><guimenu>Einfügen</guimenu><guimenuitem>Tabelle</guimenuitem> </menuchoice> fügt eine weitere Tabelle zum Dokument hinzu.

source: You can also switch between worksheets by using the <keycombo action="simul">&Ctrl;<keysym>PgDown</keysym></keycombo> to move to the next sheet, <keycombo action="simul">&Ctrl;<keysym>PgUp</keysym></keycombo> to move to the previous one.
de: Sie können auch zwischen den Tabellen umschalten, indem Sie die Tasten <keycombo action="simul">&Ctrl;<keysym>Bild ab</keysym></keycombo> verwenden, um die folgende Tabelle anzuzeigen, und <keycombo action="simul"> &Ctrl; <keysym>Bild auf</keysym></keycombo>, um die vorhergehende Tabelle anzuzeigen.

source: Worksheets are given the default names of <emphasis>Sheet1</emphasis>, <emphasis>Sheet2</emphasis>... You can give a sheet a different name by <mousebutton>right</mousebutton> clicking on the tab and selecting <guimenuitem>Rename Sheet...</guimenuitem>
de: Tabellen haben standardmäßig die Namen <emphasis>Tabelle1</emphasis>, <emphasis>Tabelle2</emphasis>, ... Sie können einem Blatt dadurch einen anderen Namen geben, dass Sie auf den entsprechenden Karteireiter mit der <mousebutton>rechten</mousebutton> Maustaste klicken, <guimenuitem>Tabelle umbenennen ...</guimenuitem> wählen und einen neuen Namen für die Tabelle eingeben.

source: To remove a sheet from the document use the <guimenuitem>Remove Sheet </guimenuitem> option in the context menu that pops up when you <mousebutton>right</mousebutton> click on the tab for the sheet you want to remove.
de: Um eine Tabelle aus dem Dokument zu löschen, verwenden Sie <guimenuitem>Tabelle entfernen</guimenuitem> im Kontextmenü, das Sie mit einem Klick der <mousebutton>rechten</mousebutton> Maustaste auf den Karteireiter der Tabelle, die Sie entfernen wollen, öffnen.

source: Other entries in the <menuchoice><guimenu>Format</guimenu><guisubmenu> Sheet</guisubmenu></menuchoice> submenu allow you to show or hide a sheet in much the same way as rows and columns can be hidden.
de: Andere Eintragungen im <menuchoice><guimenu>Format</guimenu> <guisubmenu>Tabelle</guisubmenu></menuchoice>-Untermenü erlauben Ihnen, ein Blatt auf beinahe gleiche Art und Weise anzuzeigen oder auszublenden, wie Zeilen und Spalten angezeigt und ausgeblendet werden können.

source: If you want a formula in one sheet to refer to a cell in another sheet, the cell reference must start with the sheet name followed by an exclamation mark (<keysym>!</keysym>). For example if you enter <userinput>=Sheet2!A2 </userinput> into a cell in Sheet 1, that cell will take the value from A2 of Sheet2. Note that sheet names are case sensitive.
de: Wenn Sie in einer Formel in einer Tabelle einen Verweis auf eine Zelle in einer anderen Tabelle eingeben wollen, muss der Zellenverweis mit dem Tabellennamen beginnen, gefolgt von einem Ausrufezeichen (<keysym>!</keysym>).Wenn Sie zum Beispiel <userinput>=Tabelle2!A2</userinput> in eine Zelle in Blatt 1 eingeben, erhält diese Zelle den Wert von A2 aus Tabelle2. Beachten Sie, das bei Tabellennamen zwischen Groß- und Kleinschreibung unterschieden wird.

source: Consolidating Data
de: Daten zusammenfassen

source: You may have constructed a document containing several worksheets containing similar data but for, say, different months of the year, and wish to have summary sheet containing the consolidated (&eg;, sum or average) values of the corresponding data items in the other sheets.
de: Angenommen Sie haben ein Dokument aus mehreren Tabellen mit ähnlichen Daten, aber zum Beispiel für verschiedene Monate eines Jahres und wollen in einer zusätzlichen Tabelle die zusammengehörenden Werte aus den anderen Tabellen zusammenfassen (z. B. Summe oder Durchschnitt ermitteln).

source: This task can be made slightly easier by using the <guimenuitem> Consolidate...</guimenuitem> item from the <guimenu>Data</guimenu> menu.
de: Diese Aufgabe durch die Funktion <guimenuitem>Zusammenfassen ...</guimenuitem> aus dem Menü <guimenu>Daten</guimenu> erleichtert.

source: Selecting this option brings up the <guilabel>Consolidate</guilabel> dialog box.
de: Dadurch wird der Dialog <guilabel>Zusammenfassen</guilabel> geöffnet.

source: For each of the source sheets, enter a reference to the desired data area in the <guilabel>Reference:</guilabel> box. Press <guibutton>Add</guibutton> to transfer it to the <guilabel>Entered references:</guilabel> box. The reference should include the name of the sheet containing the source data, such as <userinput>January!A1:A10</userinput>, and can be entered automatically by selecting the area in the appropriate sheet.
de: Für jede der Quelltabellen tragen Sie einen Verweis auf den gewünschten Datenbereich im Feld <guilabel>Verweis:</guilabel> ein. Dann klicken Sie auf <guibutton>Hinzufügen</guibutton>, dadurch wird der Verweis in die Liste <guilabel>Eingegebene Verweise</guilabel> aufgenommen. Der Verweis sollte den Namen der Tabelle mit den Quelldaten enthalten, wie z. B. <userinput>Januar!A1:A10</userinput>, und kann automatisch eingegeben werden, indem Sie den gewünschten Bereich in der entsprechenden Tabelle auswählen.

source: After entering the references for all of the source data sheets select the cell in the target sheet where you want the top left corner of the consolidated results to appear. Then choose the appropriate function from the <guilabel>Function:</guilabel> combo box and press the <guibutton>OK</guibutton> button.
de: Wenn Sie die Verweise auf alle Quelldaten-Tabellen eingegeben haben, wählen Sie in der Zieltabelle die Zelle aus, an der die linke obere Ecke der zusammengefassten Daten erscheinen soll. Dann wählen Sie aus dem Auswahlfeld <guilabel>Funktion:</guilabel> die gewünschte Funktion aus und drücken dann den Knopf <guibutton>OK</guibutton>.

source: If you click the <guibutton>Details >></guibutton> in the dialog and check the <guilabel>Copy data</guilabel> box the values resulting from the consolidation will be placed into the target cells rather than the formulae to calculate them.
de: Wenn Sie auf den Knopf <guilabel>Details >></guilabel> im Dialog klicken und <guilabel>Daten kopieren</guilabel> auswählen, werden die Ergebnisse der Berechnung in die Zielzellen eingesetzt, anstatt der Formeln zur Berechnung der Werte.

source: Inserting a Chart
de: Diagramme einfügen

source: You can insert a chart into a sheet to give a graphical view of your data.
de: Sie können Diagramme in eine Tabelle einfügen, um Ihre Daten grafisch darzustellen.

source: First enable <guilabel>Add Shape</guilabel> docker using the <menuchoice> <guimenu>Settings</guimenu><guimenuitem>Dockers</guimenuitem> </menuchoice> menu item.
de: Zuerst öffnen Sie <guilabel>Objekt hinzufügen</guilabel> im Menü <menuchoice><guimenu>Einstellungen</guimenu><guimenuitem>Andockbare Dialoge</guimenuitem></menuchoice>.

source: Then select the area of cells containing the data and choose <guilabel>Chart</guilabel> in the <guilabel>Add Shape</guilabel>. Drag the cursor across the sheet while holding the <mousebutton>left</mousebutton> mouse button down to define the area where you want the chart to appear, there is no need to be too accurate at this stage as the chart size can easily be changed at any time. When you release the mouse button a <guilabel>Chart Options</guilabel> dialog box will appear.
de: Wählen Sie zuerst den Bereich der Zellen aus, die die darzustellenden Daten enthalten und wählen dann <guilabel>Diagramm</guilabel> Im andockbaren Dialog <guilabel>Objekt hinzufügen</guilabel>. Ziehen Sie mit gedrückter <mousebutton>linker</mousebutton> Maustaste Maustaste über die Tabelle, um den Bereich für die Anzeige des Diagramms festzulegen. Sie müssen dabei nicht so genau sein, da die Größe und Lage des Diagramms jederzeit leicht geändert werden kann. Wenn Sie die Maustaste loslassen, erscheint der Dialog <guilabel>Diagramm-Einstellungen</guilabel>.

source: The data area is already prefilled with the selected cell range. Select the first row and column as labels, check <guilabel>Data set in rows</guilabel> and click the <guibutton>OK</guibutton> button. The Dialog will vanish and you will see the chart embedded into the worksheet.
de: Im Datenbereich ist bereits die ausgewählte Zellenbereich eingetragen. Sie können nun die erste Zeile oder Spalte als Beschriftung angeben und die Datensätze zeilenweise oder spaltenweise benutzen. Wenn Sie den Knopf <guibutton>OK</guibutton> betätigen, verschwindet der Dialog und Sie sehen das Diagramm einbettet in der Tabelle.

source: Now select <guibutton>Chart Editing Tool</guibutton> from the <guilabel>Tools</guilabel> docker and edit the chart properties like chart type, labels and axis in the <guilabel>Tools Options</guilabel>.
de: Wählen Sie nun <guibutton>Diagrammbearbeitung</guibutton> aus <guilabel>Werkzeuge</guilabel> und bearbeiten die Eigenschaften des Diagramms wie den Typ, Beschriftungen und Achsen in den <guilabel>Werkzeugoptionen</guilabel>.

source: Screenshot of embedded chart
de: Bildschirmfoto des eingebetteten Diagramms

source: To move, resize or even delete the embedded chart switch to the <guibutton>Basic shape manipulation</guibutton> tool and click anywhere within the chart area. It should now appear with a green border and with a small yellow square at each corner and in the middle of each edge.
de: Um das eingebettete Diagramm zu verschieben, zu vergrößern oder zu verkleinern oder um es zu löschen, wechseln Sie zum <guibutton>Werkzeug für Objekte</guibutton> und klicken dann irgendwo in das Diagramm. Es wird jetzt mit einem grünen Rand und mit je einem kleinen gelben Quadrat an jeder Ecke und in der Mitte jeder Seite angezeigt.

source: If you move the cursor over any of the squares it should change to a double headed arrow. You can resize the chart by dragging one of these squares with the <mousebutton>left</mousebutton> mouse button pressed. To delete the chart <mousebutton>right</mousebutton> click on one of the squares and select <guimenuitem>Delete</guimenuitem>.
de: Wenn Sie den Mauszeiger über eins der Quadrate bewegen, wird als Pfeil mit zwei Spitzen angezeigt. Sie können die Größe des Diagramms nun ändern, indem Sie eins dieser Quadrate mit der gedrückten <mousebutton>linken </mousebutton>Maustaste ziehen. Um das Diagramm zu löschen, klicken Sie mit der <mousebutton>rechten</mousebutton> Maustaste auf eins der Quadrate und wählen Sie <guimenuitem>Löschen</guimenuitem>.

source: To move the chart move the cursor into the chart. The cursor should then change to a cross, press the <mousebutton>left</mousebutton> mouse button and you will be able to drag the chart to where you want it to be.
de: Um das Diagramm zu verschieben, bewegen Sie den Cursor hinein. Der Cursor wird zu einem Kreuz, halten Sie jetzt die <mousebutton> linke </mousebutton> Maustaste gedrückt und Sie können das Diagramm dorthin bewegen, wo Sie es haben wollen.

source: To restore the chart to its normal appearance simply click anywhere outside of the chart area.
de: Um das Aussehen des Diagramms wieder zu normalisieren, klicken Sie einfach irgendwo außerhalb des Diagramms in die Tabelle.

source: To change the format of the chart itself <mousebutton>left</mousebutton> click twice within the chart area. The chart <guilabel>Tools Options</guilabel> should appear in the docker. You can then use these tools to change the chart.
de: Um das Format des Diagramms selbst zu ändern, doppelklicken Sie mit der <mousebutton>linken</mousebutton> Maustaste innerhalb des Diagrammbereichs. Die <guilabel>Werkzeugoptionen</guilabel> für Diagramme werden dann angezeigt und sie können dann damit die Eigenschaften des Diagramms ändern.

source: Inserting External Data
de: Externe Daten einfügen

source: You can insert data from a text file or from the clipboard into a worksheet by first selecting the cell where you want the top left item of the inserted data to appear, then choosing <guimenuitem>From Text File...</guimenuitem> or <guimenuitem>From Clipboard...</guimenuitem> from the <menuchoice><guimenu>Insert</guimenu><guisubmenu>External Data</guisubmenu> </menuchoice> sub menu.
de: Sie können Daten aus einer Textdatei oder aus der Zwischenablage in eine Tabelle einfügen, indem Sie zuerst die Zelle auswählen, in der Sie das obere linke Element der einzufügenden Daten einfügen wollen und dann <guimenuitem>Aus Textdatei ...</guimenuitem> oder <guimenuitem>Aus Zwischenablage ...</guimenuitem> aus dem Untermenü <menuchoice><guimenu>Einfügen</guimenu><guisubmenu>Externe Daten</guisubmenu></menuchoice> wählen.

source: In both cases &sheets; will assume that the data is in <acronym>CSV</acronym> form and will open a dialog box allowing you to control how the data is extracted from the file or clipboard and placed into the worksheet cells.
de: In beiden Fällen wird &sheets; annehmen, dass die Daten im Format <acronym>CSV</acronym> vorliegen und ein Dialogfeld öffnen, in dem Sie einstellen können, wie die Daten aus der Datei oder der Zwischenablage ausgelesen und in den Tabellenzellen angeordnet werden.

source: If support for it has been included in your system, &sheets; can also insert data from a <acronym>SQL</acronym> database into a worksheet. This is done by using the <menuchoice><guimenu>Insert</guimenu><guisubmenu> External Data</guisubmenu><guimenuitem>From Database...</guimenuitem> </menuchoice> option.
de: Wenn die Unterstützung dafür in Ihrem System vorhanden ist, kann &sheets; auch Daten aus einer <acronym>SQL</acronym>-Datenbank in eine Tabelle einfügen. Das machen Sie, indem Sie <menuchoice><guimenu>Einfügen</guimenu> <guisubmenu>Externe Daten</guisubmenu><guimenuitem>Aus Datenbank</guimenuitem> </menuchoice> auswählen.

source: Link Cells
de: Zellen verknüpfen

source: A spreadsheet cell can be linked to an action so that <mousebutton> left </mousebutton> clicking on the cell will, for example, open your browser. To make a cell act in this way select it and choose <menuchoice><guimenu>Insert</guimenu><guimenuitem>Link...</guimenuitem> </menuchoice>. This will bring up the <guilabel>Insert Link</guilabel> dialog box, which lets you choose between four types of link:
de: Eine Tabellenzelle kann mit einer Aktion verknüpft werden, damit das <mousebutton>linke</mousebutton> Klicken auf der Zelle z. B. Ihren Webbrowser öffnet. Damit eine Zelle auf diese Weise funktioniert, wählen Sie <menuchoice><guimenu>Einfügen</guimenu><guimenuitem>Verknüpfung ...</guimenuitem></menuchoice>. Das öffnet das <guilabel> Verweis einfügen</guilabel>-Dialogfeld, in dem Sie zwischen vier Arten von Verknüpfungen wählen können:

source: An <guilabel>Internet</guilabel> link cell will try to open your default browser at the &URL; entered in the <guilabel>Internet address:</guilabel> text box of the <guilabel>Insert Link</guilabel> dialog when it is clicked. This could be, for example, <userinput>http://www.calligra.org</userinput>.
de: Eine mit <guilabel>Internet</guilabel> verknüpfte Zelle wird versuchen Ihren Standard-Webbrowser mit der &URL; zu öffnen, die Sie in dem <guilabel>Internetadresse</guilabel>-Textfeld des <guilabel>Verweis einfügen</guilabel>-Dialoges eingegeben haben. Das könnte zum Beispiel <userinput>http://www.calligra.org</userinput> sein.

source: Clicking on a cell containing a <guilabel>Mail</guilabel> link will open your email composer using the address entered in the <guilabel>Email:</guilabel> text box as the To: address. For example <userinput>anon@example.com</userinput>.
de: Wenn Sie auf eine Zelle klicken, die eine <guilabel>Mail</guilabel>-Verknüpfung enthält wird Ihr E-Mail-Programm geöffnet, das die Adresse verwendet, die Sie im <guilabel>E-Mail</guilabel>-Textfeld als <quote>An:</quote> Adresse eingegeben haben. Zum Beispiel <userinput>anon@example.com</userinput>.

source: A <guilabel>File</guilabel> link cell holds the path to a file or folder, as entered into the <guilabel>File location:</guilabel> text box, and will try to open that file or folder with a suitable application when clicked on.
de: Eine mit <guilabel>Datei</guilabel> verknüpfte Zelle enthält den Pfad zu einer Datei oder einem Ordner, wie er in dem Textfeld<guilabel>Speicherort für Datei</guilabel> eingegeben wurde und versucht die Datei oder den Ordner mit einer geeigneten Anwendung zu öffnen, wenn auf sie geklickt wird.

source: The <guilabel>Cell</guilabel> type of link cell holds a &sheets; cell reference, entered in the <guilabel>Cell or Named Area</guilabel> text box. <mousebutton>Left</mousebutton> clicking on this type of link cell causes &sheets;'s focus to move to the target cell.
de: Eine verknüpfte Zelle enthält einen Verweis auf eine &sheets;-Zelle, die in das Feld <guilabel>Zelle oder benannter Bereich</guilabel> eingetragen wird. Wenn Sie mit der<mousebutton>linken</mousebutton> Maustaste auf eine solche Zelle klicken, wechselt &sheets; zur Zielzelle.

source: All four types of link cell need some suitable text to be entered into the <guilabel>Text to display</guilabel> field of the <guilabel>Insert Link</guilabel> dialog. This is the text that appears in the cell.
de: Bei allen vier Arten von Verknüpfungszellen muss ein Text im Feld <guilabel>Textanzeige</guilabel> des Dialogs <guilabel>Verknüpfung einfügen</guilabel> eingegeben werden. Das ist der Text, der in der Tabelle in der Verknüpfungszelle erscheint

source: Validity Checking
de: Gültigkeitsprüfung

source: &sheets; can automatically check the validity of entered data against a number of criteria, and pop up a message box if the data is invalid.
de: &sheets; kann automatisch die Gültigkeit der eingegebenen Daten mit einer Anzahl von Kriterien überprüfen und eine Warnmeldung ausgeben, wenn die Daten unzulässig sind.

source: To enable this feature, select the cell(s) to be monitored and choose <menuchoice><guimenu>Data</guimenu><guimenuitem>Validity...</guimenuitem> </menuchoice>. This will bring up &sheets;'s <guilabel>Validity</guilabel> dialog box which has three tabbed pages.
de: Um diese Funktion einzuschalten, wählen Sie die Zellen aus, die überwacht werden sollen und wählen Sie <menuchoice><guimenu>Daten</guimenu><guimenuitem>Gültigkeit ...</guimenuitem></menuchoice>. Das öffnet den Dialog <guilabel>Gültigkeit</guilabel> von &sheets;, der drei Karteikarten enthält.
