Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/calligra/sheets_config.po
Languages: de

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Hans-Frieder</firstname><surname>Hirsch</surname><affiliation><address><email>f.hirsch@t-online.de</email></address></affiliation><contrib>Deutsche Übersetzung</contrib></othercredit> <othercredit role="translator"><firstname>Johannes</firstname><surname>Schwall</surname><affiliation><address><email>johannes.schwall@gmail.com</email></address></affiliation><contrib>Deutsche Übersetzung</contrib></othercredit>

source: Configuring &sheets; Shortcuts and Toolbars
de: Kurzbefehle und Werkzeugleisten für &sheets; einrichten

source: Shortcuts
de: Kurzbefehle

source: To change the shortcut key arrangements used by &sheets; select <menuchoice><guimenu>Settings</guimenu><guimenuitem>Configure Shortcuts... </guimenuitem></menuchoice>. This will launch a dialog box as shown below.
de: Um die Kurzbefehle für &sheets; zu ändern, wählen Sie <menuchoice><guimenu>Einstellungen</guimenu> <guimenuitem>Kurzbefehle festlegen ...</guimenuitem></menuchoice>. Damit öffnen Sie den folgenden Dialog:

source: Shortcut config screenshot 1
de: Kurzbefehle festlegen

source: Search through the list box to find the action you want to add or change the shortcut keys for and select it by <mousebutton>left</mousebutton> clicking on the name. By entering the name of the action in the search bar at the top you can quickly find the desired action. You will then be able to change the shortcut by selecting the <guilabel>None</guilabel>, <guilabel>Default</guilabel> or <guilabel>Custom</guilabel> radio button.
de: Suchen Sie in der Liste nach Aktionen, für die Sie Kurzbefehle festlegen oder ändern möchten. Wählen Sie die gewünschte Aktion aus, indem Sie mit der <mousebutton>linken</mousebutton> Maustaste auf den Namen klicken. Durch die Eingabe des Namens der Aktion in der Suchleiste oben im Dialog können Sie die gewünschte Aktion leichter finden. Dann ändern Sie den Kurzbefehl, indem Sie auf einen der Auswahlknöpfe <guilabel>Keine</guilabel>, <guilabel>Standard</guilabel> oder <guilabel>Benutzerdefiniert</guilabel> klicken.

source: You can now simply press the key combination you want to act as the shortcut, for example <keycombo action="simul"> &Ctrl;&Shift;<keycap>S</keycap></keycombo>.
de: Drücken Sie jetzt die gewünschte Tastenkombination für den Kurzbefehl, zum Beispiel <keycombo action="simul">&Ctrl;&Shift;<keycap>S</keycap></keycombo>.

source: Toolbars
de: Werkzeugleisten

source: &sheets; has six toolbars: <guilabel>File</guilabel>, <guilabel>Edit</guilabel>, <guilabel>Navigation</guilabel>, <guilabel>Format</guilabel>, <guilabel>Font</guilabel> and <guilabel>Color/Border</guilabel>. each of which may or may not be shown depending on the choices made in the <guimenu>Settings</guimenu> menu.
de: &sheets; hat sechs Werkzeugleisten: <guilabel>Datei</guilabel>, <guilabel>Bearbeiten</guilabel>, <guilabel>Navigation</guilabel>, <guilabel>Format</guilabel>, <guilabel>Schriftart</guilabel> und <guilabel>Farbe/Umrandung</guilabel>. Jede dieser Werkzeugleisten kann angezeigt oder ausgeblendet werden, je nachdem was Sie im Menü <guimenu>Einstellungen</guimenu> festgelegt haben.

source: If the toolbars are unlocked, you can choose whether a toolbar appears at the <guimenuitem>Top</guimenuitem>, <guimenuitem>Left</guimenuitem>, <guimenuitem>Right</guimenuitem> or <guimenuitem>Bottom</guimenuitem> of &sheets;'s window by <mousebutton>right</mousebutton> clicking on the toolbar, which brings up the <guilabel>Toolbar Menu</guilabel>, and making a selection from the <guisubmenu>Orientation</guisubmenu> sub menu. This <guilabel>Toolbar Menu</guilabel> also has sub menus for choosing whether the toolbar displays icons, text or both, and the size of the icons.
de: Wenn die Werkzeugleisten nicht gesperrt sind, können Sie wählen, ob eine Werkzeugleiste <guimenuitem>Oben</guimenuitem>, <guimenuitem>Links</guimenuitem>, <guimenuitem>Rechts</guimenuitem> oder <guimenuitem>Unten</guimenuitem> im &sheets;-Fenster angezeigt wird, indem Sie mit der <mousebutton>rechten</mousebutton> Maustaste auf die Werkzeugleiste klicken. Damit öffnen Sie die <guilabel>Werkzeugleisten-Einstellungen</guilabel> und können einen Eintrag aus dem Menü <guisubmenu>Ausrichtung</guisubmenu> wählen. In den <guilabel>Werkzeugleisten-Einstellungen</guilabel> können Sie auch einstellen, ob in der Werkzeugleiste nur Symbole, nur Text oder beides angezeigt werden sollen, sowie die Größe der Symbole festlegen.

source: Another way of moving a toolbar is by positioning the mouse pointer over the two vertical bars at the left end of each toolbar and holding the <mousebutton>left</mousebutton> mouse button down while you drag the toolbar to the wanted position. When you drag the toolbar in this way you can release the mouse button when it is some distance from any of &sheets;'s window sides, and then you will get a floating toolbar, which is not locked to any particular part of &sheets;'s window and can in fact be moved outside of the window. To put a floating toolbar back into one of the traditional positions <mousebutton>right</mousebutton> click on its titlebar to bring up the <guilabel>Toolbar Menu</guilabel> then choose one of the options in the <guisubmenu>Orientation</guisubmenu> sub menu.
de: Sie können eine Werkzeugleiste auch bewegen, indem Sie den Mauszeiger auf der vertikalen Leiste am linken Ende einer Werkzeugleiste platzieren und mit gedrückter <mousebutton>linker</mousebutton> Maustaste die Werkzeugleiste in die gewünschte Position ziehen. Wenn Sie eine Werkzeugleiste auf diese Weise in eine Position außerhalb der Begrenzungen des &sheets;-Fensters ziehen, erhalten Sie eine unabhängige Werkzeugleiste, die an kein Element des &sheets;-Fensters mehr gebunden ist. Um eine unabhängige Leiste wieder in eine übliche Position zu bringen, klicken Sie mit der <mousebutton>rechten</mousebutton> Maustaste auf ihre Titelleiste um das <guilabel> Werkzeugleisten-Einstellungen</guilabel> aufzurufen. Dann wählen Sie eine der Optionen im Untermenü <guisubmenu>Ausrichtung</guisubmenu>.

source: Selecting <guimenuitem>Configure Toolbars...</guimenuitem> from the <guimenu>Settings</guimenu> menu will bring up a dialog box which lets you add buttons to or remove them from &sheets;'s toolbars.
de: Wenn Sie <guimenuitem>Werkzeugleisten einrichten ...</guimenuitem> aus dem Menü <guimenu>Einstellungen</guimenu> wählen, öffnet sich ein Dialog, in dem Sie Knöpfe zu den Werkzeugleisten &sheets;hinzufügen oder von diesen entfernen können.

source: To use this <guilabel>Configure Toolbars</guilabel> dialog box first select a toolbar from the <guilabel>Toolbar:</guilabel> combo box. The right hand <guilabel>Current actions:</guilabel> window will then show the buttons currently present on the toolbar. You can remove a button by selecting it in this window then pressing the left arrow button, or move it around by pressing the up and down arrow buttons. To add a new button to the toolbar select it in the <guilabel>Available actions:</guilabel> list then press the right arrow button.
de: Im Dialog <guilabel>Werkzeugleisten einrichten</guilabel> wählen Sie zuerst eine Werkzeugleiste im Auswahlfeld <guilabel>Werkzeugleiste:</guilabel>. In der Liste <guilabel>Angezeigte Aktionen:</guilabel> rechts im Dialog, sehen Sie die Knöpfe, die derzeit in der Werkzeugleiste zu sehen sind. Sie können einen Knopf entfernen, indem Sie ihn im Fenster auswählen und dann auf den Pfeil-nach-links-Knopf klicken. Sie können ihn auch im Fenster bewegen, indem Sie auf die Pfeil-nach-oben- oder Pfeil-nach-unten-Knöpfe klicken. Einen neuen Knopf fügen Sie hinzu, indem Sie ihn in der Liste <guilabel>Verfügbare Aktionen:</guilabel> auswählen und dann auf den Pfeil-nach-rechts-Knopf klicken.
