Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/calligra/stage_guides.po
Languages: de

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Burkhard</firstname><surname>Lück</surname><affiliation><address><email>lueck@hube-lueck.de</email></address></affiliation><contrib>Übersetzung</contrib></othercredit>

source: Detailed Guides
de: Ausführliche Anleitungen

source: This chapter describes how to perform some common tasks in &stage;.
de: Dieses Kapitel soll zeigen, wie die häufigsten Aufgaben in &stage; durchgeführt werden.

source: Create a &HTML; Slideshow
de: Erstellung einer &HTML;-Präsentation

source: Turn an existing presentation into standard &HTML; pages with accompanying navigation aids.
de: Erstellt &HTML;-Seiten mit zugehörigen Navigationselementen aus einer vorhandenen Präsentation.

source: First, either make a new presentation, or open an existing one. Then, click on <menuchoice><guimenu>File</guimenu><guimenuitem>Export as HTML...</guimenuitem></menuchoice>
de: Zuerst erstellen Sie eine neue oder öffnen eine vorhandene Präsentation. Dann klicken Sie auf <guimenu>Datei</guimenu> <guimenuitem>Als HTML exportieren ...</guimenuitem>

source: You will then get a dialog box asking for a few details:
de: In einem Dialog geben Sie dann einige Einstellungen ein:

source: <screeninfo>Fill in the details for your &HTML; slideshow</screeninfo>
de: <screeninfo>Eingabe der Informationen für die &HTML;-Präsentation</screeninfo>

source: <phrase>Fill in the details for your &HTML; slideshow</phrase>
de: <phrase>Eingabe der Informationen für die &HTML;-Präsentation</phrase>

source: Fill in <guilabel>Title</guilabel> and <guilabel>Author</guilabel> fields. Select the slides which should be exported. If you want to change a name used on the &HTML; page for each slide double click on the name and edit it inline.
de: Geben Sie einen <guilabel>Titel</guilabel> und den <guilabel>Autor</guilabel> ein. Wählen Sie dann die Folien, die exportiert werden sollen. Möchten Sie Namen von Folien ändern, der auf der &HTML;-Seite angezeigt wird, doppelklicken Sie auf den Namen und bearbeiten ihn.

source: In the <guilabel>Output preview</guilabel> area the downsized slides are displayed and you can check the correct slide order and browse the presentation with the <guiicon>&lt;</guiicon> and <guiicon>&gt;</guiicon> buttons.
de: In der <guilabel>Ausgabevorschau</guilabel> werden die Folien verkleinert angezeigt. Sie können hier die richtige Reihenfolge der Folien überprüfen und mit den Knöpfen <guiicon>&lt;</guiicon> and <guiicon>&gt;</guiicon> durch die Präsentation blättern.

source: Now you can select a stylesheet with the configuration of the &HTML; options.
de: Wählen Sie dann eine Stilvorlage mit den Einstellungen für die &HTML;-Seiten aus.

source: To actually produce your &HTML; presentation, press the <guibutton>Export</guibutton> button and select a folder.
de: Nun können Sie den Ihre &HTML;-Präsentation erstellen, drücken Sie dazu auf den Knopf <guibutton>Exportieren</guibutton> und wählen einen Ordner zum speichern aus.

source: What we now have are the newly-produced <filename>html/</filename> and <filename>pics/</filename> folders, created where we earlier set the path:
de: Damit werden am angegebenen Pfad neue <filename>html/</filename>- und <filename>pics/</filename>-Ordner angelegt:

source: <screeninfo>The newly created &HTML; slideshow folders</screeninfo>
de: <screeninfo>Die neu angelegten Ordner der &HTML;-Präsentation</screeninfo>

source: <phrase>The newly created &HTML; slideshow folders</phrase>
de: <phrase>Die neu angelegten Ordner der &HTML;-Präsentation</phrase>

source: There is also an <filename>index.html</filename> file to launch your web slideshow.
de: Die neu erstellte Datei <filename>index.html</filename> dient als Einstiegspunkt zum Start der Präsentation.

source: You can see how it works by using your file manager or web browser to open the <filename>index.html</filename> file. Click where prompted, and the first slide of your presentation is displayed. It will now behave as a &stage; slideshow.
de: Für einen Test öffnen Sie mit dem Dateiverwaltungsprogramm oder Browser die Datei <filename>index.html</filename>. Klicken Sie auf den Start, so wird die erste Seite der Präsentation angezeigt. Der weitere Ablauf entspricht einer &stage;-Präsentation.

source: Each click on the arrow icons take you to the next or previous slide. To get back to the start of the slideshow click on the slide icon.
de: Mit den blauen Pfeilen können Sie in den Folien blättern, ein Klick auf das Foliensymbol bringt Sie zum Inhaltsverzeichnis der Präsentation.

source: To share your presentation with the world, transfer the newly-produced files to a network-accessible location (&ie; webspace), remembering to keep the folder structure intact.
de: Um Ihre Präsentation zu veröffentlichen, laden Sie die neu erstellten Seiten ins Internet, ohne dabei die Ordnerstruktur zu verändern.

source: Creating &stage; Templates
de: Vorlagen für &stage; erstellen

source: It is very easy to create a new template for &stage;.
de: Die &stage;-Bibliothek kann auf einfache Weise um eigene Vorlagen erweitert werden.

source: If you have made a presentation in a style that you would like to use again, you can save it as a template.
de: Wenn Sie eine von Ihnen erstellte Vorlage wiederverwenden wollen, können Sie sie als Vorlage speichern.

source: This tutorial will show how we can make a new template and save it.
de: Dieses Anleitung erläutert die Erstellung und Abspeicherung einer eigenen Vorlage.

source: Open &stage; and create a new document.
de: Als erstes starten Sie &stage; und erstellen ein neues Dokument.

source: To add a little sparkle to the blank slide, we can change the slide background - do this by selecting the <guilabel>Document background</guilabel> tool in the Tools docker.
de: Um die Folie ein bisschen ansprechender zu gestalten, ändern Sie den Folienhintergrund. Wählen Sie <guilabel>Dokumenthintergrund</guilabel> im andockbaren Dialog Werkzeuge.

source: We want the background to look attractive, so you may choose to use an image as a background by clicking the <guibutton>Set image</guibutton> button: feel free to experiment, but keep it beautiful!
de: Der Hintergrund soll attraktiv aussehen, daher wählen Sie mit <guilabel>Bild festlegen</guilabel> eine Grafik als Hintergrund auswählen. Probieren Sie einfach verschiedene Einstellungen aus, bis das Ergebnis zufriedenstellend ist.

source: <screeninfo>Choosing a slide background</screeninfo>
de: <screeninfo>Auswahl eines Folienhintergrundes</screeninfo>

source: <phrase>Choosing a slide background</phrase>
de: <phrase>Auswahl eines Folienhintergrundes</phrase>

source: The page should now have the background you desire. Create a text box, and type a heading for your slide:
de: Damit ist gewünschten Hintergrund für die Seite eingestellt. Erstellen Sie ein Textfeld und geben Sie eine Überschrift für die Folie ein:

source: <screeninfo>Adding a Heading to the new template</screeninfo>
de: <screeninfo>Eine Überschrift zur neuen Vorlage hinzufügen</screeninfo>

source: <phrase>Adding a Heading to the new template</phrase>
de: <phrase>Eine Überschrift zur neuen Vorlage hinzufügen</phrase>

source: When you are happy with your template, go to <menuchoice><guimenu>File</guimenu> <guimenuitem>Save As</guimenuitem></menuchoice> and select <guilabel>Opendocument Presentation Template</guilabel> filetype in the file dialog.
de: Wenn Sie mit Ihrer Vorlagen zufrieden sind, klicken Sie auf <menuchoice><guimenu>Datei</guimenu> <guimenuitem>Speichern unter</guimenuitem></menuchoice> und wählen den Dateityp <guilabel>ODP-Vorlage</guilabel>.
