Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/calligra/stage_menus.po
Languages: de

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Hans-Frieder</firstname><surname>Hirsch</surname><affiliation><address><email>f.hirsch@t-online.de</email></address></affiliation><contrib>Deutsche Übersetzung</contrib></othercredit>

source: The Menu and Toolbar Items
de: Die Menüleiste und die Werkzeugleisten

source: &stage; presents different types of interfaces for you to interact with the program. Perhaps the most familiar type of interface is the menu which appears on the top of the &stage; window.
de: &stage; hat eine Benutzeroberfläche mit verschiedenen Möglichkeiten, um das Programm zu bedienen. Am bekanntesten wohl die Menüleiste oben im Fenster von &stage;.

source: Clicking on the menu items gives you a list of commands from which you can choose the one you want. Many of the commands can also be accessed directly by holding down &Ctrl; or &Alt; and pressing another key on your keyboard. In the next section, each of the menu commands is described in brief.
de: Durch Klicken auf einen Eintrag in der Menüleiste wird eine Liste von möglichen Aktionen angezeigt, von denen Sie eine auswählen können. Viele dieser Aktionen kann Sie auch über die Tastatur auslösen, indem sie den zugehörigen Tastatur-Kurzbefehl, der aus &Ctrl; oder &Alt; und einer weiteren Taste besteht, eingeben. Alle Befehle des Menüs werden im Folgenden beschrieben.

source: The Toolbars
de: Die Werkzeugleisten

source: Manipulating the Toolbars
de: Veränderung der Werkzeugleisten

source: In addition to the menus, &stage; also has a toolbar. The toolbar consists of a collection of icons. A toolbar icon often presents a convenient shortcut to a command that is found in one of the menus.
de: Neben der Menüleiste gibt es in &stage; eine Werkzeugleisten, die aus einigen Symbolen besteht. Diese Symbole sind Abkürzungen zu Menübefehlen.

source: You can move the unlocked toolbar around by dragging the handle at the left. The unlocked toolbar can be <quote>docked</quote> or attached to any side of the &stage; window. If you like, you can also have the toolbar <quote>float</quote> in its own window, separated from the main &stage; window.
de: Sie können die nicht gesperrte Werkzeugleiste verschieben, indem Sie sie am Griff links ziehen. Werkzeugleisten können an jeder Seite des &stage;-Fensters <quote>angedockt</quote> oder angehängt werden. Werkzeugleisten können auch in einem eigenen Fenster unabhängig vom &stage;-Fenster <quote>schwebend</quote> angeordnet werden.

source: If you don't like dragging toolbars around, <mousebutton>right</mousebutton> click on the handle and a menu pops up.
de: Falls Sie die Werkzeugleiste nicht ziehen möchten, klicken Sie stattdessen mit der &RMBn; auf die Werkzeugleiste, um das Kontextmenü zu öffnen.

source: Choosing the item <guisubmenu>Text Position</guisubmenu> leads to an additional menu which lets you control the appearance of the items in toolbar. This additional cascading menu is shown in the screenshot below:
de: Wählen Sie im Menü den Eintrag <guisubmenu>Textposition</guisubmenu>, erscheint ein zusätzliches Menü mit verschiedenen Einträgen, um das Erscheinungsbild der Werkzeugleiste einzustellen. Dieses zusätzliche Menü wird im nächsten Bildschirmfoto dargestellt:

source: You can choose to display the toolbar items as text instead of icons, or even to combine both icons and text. If you want both text and icons, the cascading menu allows you to select whether the text appears beside the icons or below them.
de: Sie können die Einträge der Werkzeugleisten auch als Text an Stelle der Symbole oder als Kombination aus Symbol und Text anzeigen lassen. Bei der letzten Möglichkeit können Sie außerdem wählen, ob der Text neben oder unter dem Symbol angezeigt wird.

source: In icons only view, if you don't know what a particular icon means, you can hold the mouse over the icon, and after a second or so, a little hint pops up in a highlighted text box.
de: Werden in der Werkzeugleiste nur Symbole angezeigt. setzen Sie den Mauszeiger auf das Symbol und warten einen Moment. Dann erscheint ein Hinweis in hervorgehobener Schrift.

source: The <guilabel>Orientation</guilabel> item in the popup menu has to do with the placement of the toolbar. You can choose any of the four sides of the &stage; window.
de: Der Eintrag <guilabel>Ausrichtung</guilabel> im Kontextmenü legt die Anordnung der Werkzeugleisten fest. Alle vier Seiten des &stage;-Fensters können hier ausgewählt werden.

source: The &stage; menus are discussed in the following sections.
de: Im folgenden Abschnitt werden die Menüs von &stage; erläutert.

source: File Menu
de: Das Menü Datei

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>New</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo> </shortcut> <guimenu>Datei</guimenu> <guimenuitem>Neu</guimenuitem>

source: <action>Begins a new presentation.</action> The startup dialog will open, allowing you to choose a template for your presentation.
de: <action>Beginnt eine neue Präsentation.</action> Im Startdialog können Sie eine Vorlage für Ihre Präsentation auswählen.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>O</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Open...</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>O</keycap></keycombo> </shortcut> <guimenu>Datei</guimenu> <guimenuitem>Öffnen ...</guimenuitem>

source: <action>Opens an existing presentation.</action> A standard &kde; file open dialog will appear, allowing you to choose a file to open.
de: <action>Öffnet eine vorhandene Präsentation.</action> Im Standard-&kde;-Dateidialog können Sie die zu öffnende Datei auswählen.

source: <guimenu>File</guimenu> <guisubmenu>Open Recent</guisubmenu>
de: <guimenu>Datei</guimenu> <guisubmenu>Zuletzt geöffnete Dateien</guisubmenu>

source: Displays a list of recently opened files for you to choose from.
de: Zeigt eine Auswahlliste der zuletzt geöffneten Dateien an.

source: <shortcut><keycombo action="simul"> &Ctrl;<keycap>S</keycap> </keycombo></shortcut> <guimenu>File</guimenu> <guimenuitem>Save</guimenuitem>
de: <shortcut><keycombo action="simul"> &Ctrl;<keycap>S</keycap> </keycombo></shortcut> <guimenu>Datei</guimenu> <guimenuitem>Speichern</guimenuitem>

source: <action>Saves the currently open presentation.</action> If you have not previously saved it, you will be asked to name the file. If you have previously saved the presentation, it will be resaved with the same name.
de: <action>Speichert die aktuelle Präsentation.</action> Falls die Datei bisher noch nicht gespeichert wurde, müssen Sie einen Dateinamen eingeben. Ansonsten wird der aktuelle Dateiname verwendet.

source: <guimenu>File</guimenu> <guimenuitem>Save As...</guimenuitem>
de: <guimenu>Datei</guimenu> <guimenuitem>Speichern unter ...</guimenuitem>

source: Saves the currently open presentation with a new name.
de: Speichert die aktuelle Präsentation unter einem neuen Namen.

source: <guimenu>File</guimenu> <guimenuitem>Reload</guimenuitem>
de: <guimenu>Datei</guimenu> <guimenuitem>Erneut laden</guimenuitem>

source: Reload the currently active file.
de: Lädt die geöffnete Datei erneut.

source: <guimenu>File</guimenu> <guimenuitem>Import...</guimenuitem>
de: <guimenu>Datei</guimenu> <guimenuitem>Importieren ...</guimenuitem>

source: Import a presentation that was previously created in one of several common formats.
de: Importiert eine vorher in einem von mehreren gebräuchlichen Formaten erstellte Präsentation.

source: <guimenu>File</guimenu> <guimenuitem>Export...</guimenuitem>
de: <guimenu>Datei</guimenu> <guimenuitem>Exportieren ...</guimenuitem>

source: Export the currently open presentation to one of several common formats for use in another application, or for exchange with someone who does not have access to &stage;.
de: Exportiert die aktuelle geöffnete Präsentation in eines von mehreren gebräuchlichen Formaten. Das ermöglicht die Nutzung der Präsentation mit einem anderen Programm oder zum Austausch mit jemandem, der nicht über &stage; verfügt.

source: <guimenu>File</guimenu> <guimenuitem>Mail...</guimenuitem>
de: <guimenu>Datei</guimenu> <guimenuitem>Versenden ...</guimenuitem>

source: <action>Open</action> a new email message in your selected email client with the current &stage; document attached.
de: <action>Öffnet</action> eine neue E-Mail in Ihrem E-Mail-Programm mit dem aktuellen &stage;-Dokument als Anhang.

source: <guimenu>File</guimenu> <guimenuitem>Export as HTML...</guimenuitem>
de: <guimenu>Datei</guimenu> <guimenuitem>Als HTML exportieren ...</guimenuitem>

source: <action>Starts the HTML wizard</action>, which is described in the section <xref linkend="html-wizard"/>.
de: <action>Startet den HTML-Assistenten</action>, der im Abschnitt <xref linkend="html-wizard"/> erläutert wird.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>P</keycap></keycombo></shortcut> <guimenu>File</guimenu> <guimenuitem>Print...</guimenuitem>
de: <shortcut><keycombo action="simul"> &Ctrl;<keycap>P</keycap> </keycombo></shortcut> <guimenu>Datei</guimenu> <guimenuitem>Drucken ...</guimenuitem>

source: <action>Prints the presentation</action>. More precisely, it opens the print settings dialog, where you can adjust the settings before printing your presentation.
de: <action>Druckt die Präsentation.</action> Genauer wird der Dialog mit den Einstellungen zum Drucken geöffnet, damit man die Einstellungen vor dem Ausdruck anpassen kann.

source: <guimenu>File</guimenu> <guimenuitem>Print Preview...</guimenuitem>
de: <guimenu>Datei</guimenu> <guimenuitem>Druckvorschau ...</guimenuitem>

source: <action>Displays the presentation</action> with a viewer, exactly as it would look if printed.
de: <action>Zeigt die Präsentation</action> mit einem Programm zur Darstellung von &PostScript;, so wie sie auf einem Ausdruck aussehen würde.

source: <guimenu>File</guimenu> <guimenuitem>Document Information</guimenuitem>
de: <guimenu>Datei</guimenu> <guimenuitem>Dokument-Informationen</guimenuitem>

source: <action>Allows you to enter information about the document.</action> This includes information about the author, and an abstract on the documents contents.
de: <action>Erlaubt die Eingabe von Informationen über das Dokument.</action> Hier können Informationen über den Autor und eine Zusammenfassung des Inhalts abgelegt werden.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>W</keycap></keycombo></shortcut> <guimenu>File</guimenu> <guimenuitem>Close</guimenuitem>
de: <shortcut><keycombo action="simul"> &Ctrl;<keycap>W</keycap> </keycombo></shortcut> <guimenu>Datei</guimenu> <guimenuitem>Schließen</guimenuitem>

source: <action>Close the current presentation.</action> You will be given an opportunity to save any changes first.
de: <action>Schließt die aktuelle Präsentation.</action> Vorher haben Sie die Möglichkeit, Änderungen zu speichern.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo></shortcut> <guimenu>File</guimenu> <guimenuitem>Quit</guimenuitem>
de: <shortcut><keycombo action="simul"> &Ctrl;<keycap>Q</keycap> </keycombo></shortcut> <guimenu>Datei</guimenu> <guimenuitem>Beenden</guimenuitem>

source: <action>Close</action> &stage;. You will be given an opportunity to save all changes in all open presentations first.
de: <action>Beendet &stage;.</action> Vorher können Sie alle geänderten Präsentationen speichern.

source: Edit Menu
de: Das Menü Bearbeiten

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Z</keycap></keycombo></shortcut> <guimenu>Edit</guimenu> <guimenuitem>Undo: <replaceable>Last task</replaceable></guimenuitem>
de: <shortcut><keycombo action="simul"> &Ctrl;<keycap>Z</keycap> </keycombo></shortcut> <guimenu>Bearbeiten</guimenu> <guimenuitem>Rückgängig: <replaceable>Letzte Aktion</replaceable></guimenuitem>

source: Undo the last action you performed.
de: Macht die letzte Benutzeraktion rückgängig.

source: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>Z</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Redo: <replaceable>Last undone task</replaceable></guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>Z</keycap></keycombo> </shortcut> <guimenu>Bearbeiten</guimenu> <guimenuitem>Wiederherstellen: <replaceable>Letzte rückgängig gemachte Aktion</replaceable></guimenuitem>

source: <action>Redo the last action you undid.</action> If you have not undone any actions, or the last undo action is not reversible, this menu item is disabled.
de: <action>Stellt die letzte rückgängig gemachte Aktion wieder her.</action> Falls keine Aktion zum Wiederherstellen vorhanden ist oder die letzte Aktion nicht rückgängig gemacht werden kann, ist dieser Menüeintrag deaktiviert.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>X</keycap></keycombo></shortcut> <guimenu>Edit</guimenu> <guimenuitem>Cut</guimenuitem>
de: <shortcut><keycombo action="simul"> &Ctrl;<keycap>X</keycap> </keycombo></shortcut> <guimenu>Bearbeiten</guimenu> <guimenuitem>Ausschneiden</guimenuitem>

source: Copy the selected item to the clipboard, and remove it from the document.
de: Kopiert den ausgewählten Abschnitt in die Zwischenablage und entfernt ihn aus dem Dokument.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>C</keycap></keycombo></shortcut> <guimenu>Edit</guimenu> <guimenuitem>Copy</guimenuitem>
de: <shortcut><keycombo action="simul"> &Ctrl;<keycap>C</keycap> </keycombo></shortcut> <guimenu>Bearbeiten</guimenu> <guimenuitem>Kopieren</guimenuitem>

source: Copy the selected item to the clipboard, while leaving it intact in your presentation.
de: Kopiert den ausgewählten Abschnitt in die Zwischenablage.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>V</keycap></keycombo></shortcut> <guimenu>Edit</guimenu> <guimenuitem>Paste</guimenuitem>
de: <shortcut><keycombo action="simul"> &Ctrl;<keycap>V</keycap> </keycombo></shortcut> <guimenu>Bearbeiten</guimenu> <guimenuitem>Einfügen</guimenuitem>

source: Insert the contents of the clipboard into your presentation.
de: Fügt den Inhalt der Zwischenablage in die Präsentation ein.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Del</keycap></keycombo></shortcut> <guimenu>Edit</guimenu> <guimenuitem>Delete</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>Entf</keycap> </keycombo></shortcut> <guimenu>Bearbeiten</guimenu> <guimenuitem>Löschen</guimenuitem>

source: Remove the currently selected item from your presentation.
de: Entfernt den ausgewählten Abschnitt aus der Präsentation.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>A</keycap></keycombo></shortcut> <guimenu>Edit</guimenu> <guimenuitem>Select All</guimenuitem>
de: <shortcut><keycombo action="simul"> &Ctrl;<keycap>A</keycap> </keycombo></shortcut> <guimenu>Bearbeiten</guimenu> <guimenuitem>Alle auswählen</guimenuitem>

source: Select all the objects and text on the current slide.
de: Wählt alle Objekte und Texte auf der aktuellen Folie aus.

source: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>A</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Deselect</guimenuitem>
de: <shortcut><keycombo action="simul"> &Ctrl;&Shift;<keycap>A</keycap></keycombo></shortcut><guimenu>Bearbeiten</guimenu> <guimenuitem>Auswahl aufheben</guimenuitem>

source: Deselect any currently selected objects.
de: Hebt die Auswahl der aktuell ausgewählten Objekte auf.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>F</keycap></keycombo></shortcut> <guimenu>Edit</guimenu> <guimenuitem>Find...</guimenuitem>
de: <shortcut><keycombo action="simul"> &Ctrl;<keycap>F</keycap> </keycombo></shortcut> <guimenu>Bearbeiten</guimenu> <guimenuitem>Suchen ...</guimenuitem>

source: Search for text within the presentation.
de: Sucht einen Text in der Präsentation.

source: <shortcut> <keycap>F3</keycap> </shortcut> <guimenu>Edit</guimenu><guimenuitem>Find Next</guimenuitem>
de: <shortcut><keycap>F3</keycap></shortcut> <guimenu>Bearbeiten</guimenu><guimenuitem>Weitersuchen</guimenuitem>

source: Find the next occurrence of a piece of text within a presentation.
de: Sucht das nächste Vorkommen eines Textes in der Präsentation.

source: <shortcut> <keycombo action="simul">&Shift;<keycap>F3</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu><guimenuitem>Find Previous</guimenuitem>
de: <shortcut><keycombo action="simul"> &Shift;<keycap>F3</keycap></keycombo></shortcut> <guimenu>Bearbeiten</guimenu> <guimenuitem>Frühere suchen</guimenuitem>

source: Find the previous occurrence of a piece of text within a presentation.
de: Sucht das vorherige Vorkommen eines Textes in der Präsentation.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>R</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu><guimenuitem>Replace...</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>R</keycap> </keycombo></shortcut><guimenu>Bearbeiten</guimenu> <guimenuitem>Ersetzen ...</guimenuitem>

source: Replace one or more occurrences of a piece of text in your presentation with a different piece of text.
de: Ersetzt in der Präsentation eines oder mehrere Vorkommen eines Textabschnittes mit einem anderen Textabschnitt.

source: View Menu
de: Das Menü Ansicht

source: <guimenu>View</guimenu> <guimenuitem>New View</guimenuitem>
de: <guimenu>Ansicht</guimenu> <guimenuitem>Neue Ansicht</guimenuitem>

source: <action>Opens another window with the same presentation loaded</action> so you can work on more than one slide at a time.
de: <action>Öffnet ein weiteres Fenster mit der gleichen Präsentation.</action> Damit können gleichzeitig an mehreren Folie arbeiten.

source: <menuchoice> <shortcut><keycombo action="simul">&Ctrl;<keycap>F5</keycap></keycombo></shortcut> <guimenu>View</guimenu> <guimenuitem>Normal</guimenuitem> </menuchoice> <menuchoice> <shortcut><keycombo action="simul">&Ctrl;<keycap>F6</keycap></keycombo></shortcut> <guimenu>View</guimenu> <guimenuitem>Notes</guimenuitem> </menuchoice> <menuchoice> <shortcut><keycombo action="simul">&Ctrl;<keycap>F7</keycap></keycombo></shortcut> <guimenu>View</guimenu> <guimenuitem>Slides Sorter</guimenuitem> </menuchoice>
de: <menuchoice> <shortcut><keycombo action="simul">&Ctrl;<keycap>F5</keycap></keycombo></shortcut> <guimenu>Ansicht</guimenu> <guimenuitem>Normal</guimenuitem> </menuchoice> <menuchoice> <shortcut><keycombo action="simul">&Ctrl;<keycap>F6</keycap></keycombo></shortcut> <guimenu>View</guimenu> <guimenuitem>Anmerkungen</guimenuitem> </menuchoice> <menuchoice> <shortcut><keycombo action="simul">&Ctrl;<keycap>F7</keycap></keycombo></shortcut> <guimenu>View</guimenu> <guimenuitem>Foliensortierung</guimenuitem> </menuchoice>

source: Switch with these actions between the view modes Normal, where you edit slides, Notes, which shows a slide preview with a textbox for your annotations for the actual slide and the Slides Sorter view, where you can rename, cut, copy and paste slides and arrange them for your presentation.
de: Mit diesen Aktionen wechseln Sie zwischen den Ansichtsmodi: Normal, in dem Sie die Folien bearbeiten, Anmerkungen zeigt eine Vorschau der Folien mit einem Textfeld für Ihre Notizen und die Ansicht Foliensortierung, in der Sie Folien umbenennen, ausschneiden, kopieren und einfügen sowie die Folien für die Präsentation umsortieren können.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>F8</keycap></keycombo></shortcut> <guimenu>View</guimenu> <guimenuitem>Show Master Slides</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>F8</keycap></keycombo></shortcut> <guimenu>Ansicht</guimenu> <guimenuitem>Folienmaster anzeigen</guimenuitem>

source: <action>Toggle the display of the slide master</action> where you can put objects that you want to appear on each slide in your presentation.
de: <action>Schaltet die Anzeige des Folienvorlage ein bzw. aus.</action> Auf der Folienvorlage fügen Sie alle Objekte ein, die auf jeder Folie Ihrer Präsentation erscheinen soll.

source: <guimenu>View</guimenu> <guimenuitem>Show Grid</guimenuitem>
de: <guimenu>Ansicht</guimenu> <guimenuitem>Gitter anzeigen</guimenuitem>

source: If enabled, &stage; will display a grid of dots representing the intersections of imaginary horizontal and vertical lines. You can use these dots to precisely position objects on the slide.
de: Wenn diese Option aktiviert ist, zeigt &stage; ein Punktgitter an. Diese Punkte repräsentieren die Schnittpunkte eines Gitters aus wagerechten und senkrechten Linien. Sie dienen zur exakten Positionierung von Objekten auf der Folie.

source: <guimenu>View</guimenu><guimenuitem> Snap to Grid</guimenuitem>
de: <guimenu>Ansicht</guimenu> <guimenuitem>An Gitter ausrichten</guimenuitem>

source: If this is enabled, when dropping or moving objects on the slide the top left corner of the object will <quote>snap</quote> or move, to the nearest grid point.
de: Wenn diese Option markiert ist, werden verschobene oder neu erstellte Objekte mit ihrer linken oberen Ecke auf dem nächstliegenden Gitterpunkt <quote>einrasten</quote>.

source: This does reduce your freedom to freely position objects on the slide, however it also helps to line up objects precisely. It is easily disabled or enabled with this menu entry, allowing you the best of both worlds.
de: Trotzdem können Sie Objekten auf der Folie beliebig anordnen. Diese Option hilft aber bei der genauen Ausrichtung von Objekten. Bei Bedarf kann diese Funktion schnell ein- oder ausgeschaltet werden.

source: <guimenu>View</guimenu> <guimenuitem>Show Guides</guimenuitem>
de: <guimenu>Ansicht</guimenu> <guimenuitem>Hilfslinien anzeigen</guimenuitem>

source: When working in &stage; you can drag a <quote>guide line</quote> from either the horizontal or vertical ruler onto your document. This guide-line will not print or display in the finished presentation, it is simply to help you align objects on screen. If this item is enabled, these guide lines will be visible. If this is disabled, they will not be visible.
de: Wenn Sie mit &stage; arbeiten, können Sie sowohl vertikale als auch horizontale <quote>Hilfslinien</quote> vom Lineal in das Dokument ziehen. Diese Hilfslinien werden weder gedruckt noch bei der Bildschirmpräsentation angezeigt, sie dienen lediglich der korrekten Ausrichtung von Objekten auf dem Bildschirm. Wenn dieses Element aktiviert ist, sind die Hilfslinien sichtbar, ansonsten nicht.

source: Guide lines work across slides, allowing you to align objects the same way across multiple slides.
de: Hilfslinien werden auf allen Folien angezeigt, so können Objekte auf mehreren Folien an der gleichen Stelle angeordnet werden.

source: Disabling (hiding) guide lines does not delete them. If you have created guide lines, and then disabled this item, enabling it again will retain the guide lines you created.
de: Durch das Ausblenden werden Hilfslinien nicht gelöscht. Sobald Sie diese Einstellung wieder einschalten, werden die vorher erzeugten Hilfslinien wieder angezeigt.

source: <guimenu>View</guimenu> <guisubmenu>Zoom</guisubmenu>
de: <guimenu>Ansicht</guimenu> <guisubmenu>Zoom</guisubmenu>
