Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/calligra/stage_menus.po
Languages: de

source: This submenu allows you to zoom in or out of the slide. Several predefined zoom levels are available, including <guimenuitem>Fit Page</guimenuitem> to scale the entire slide so as to be visible in the size window you have open, and <guimenuitem>Fit Page Width</guimenuitem> to scale the slide so it fills the entire width of the window, although you may now have to scroll vertically. There are also several other scaling choices, from <guimenuitem>33%</guimenuitem> up to <guimenuitem>500%</guimenuitem>.
de: In diesem Untermenü können Sie die Anzeige der Folie vergrößern oder verkleinern. Es gibt einige vordefinierte Vergrößerungsstufen, darunter auch <guimenuitem>Ganze Seite</guimenuitem>, mit der die gesamte Folie im Programmfenster dargestellt wird, und <guimenuitem>An Breite anpassen</guimenuitem> für eine Vergrößerung, in der die Folie in voller Breite im Fenster angezeigt wird. Dabei müssen Sie vertikal mit den Bildlaufleisten blättern. Es gibt außerdem einige fest vorgegebene Vergrößerungsstufen von <guimenuitem>33 %</guimenuitem> bis <guimenuitem>500 %</guimenuitem>.

source: Insert Menu
de: Das Menü Einfügen

source: <guimenu>Insert</guimenu> <guisubmenu>Variable</guisubmenu>
de: <guimenu>Einfügen</guimenu> <guisubmenu>Variable</guisubmenu>

source: Here you can insert a variable that is filled in with a value that may be updated as you update the document.
de: Hier können Sie eine Variable einfügen, die mit einem Wert belegt ist, der sich mit der Bearbeitung des Dokuments ändert.

source: <guimenu>Insert</guimenu><guimenuitem>Import Slideshow...</guimenuitem>
de: <guimenu>Einfügen</guimenu> <guimenuitem>Vorführung importieren ...</guimenuitem>

source: <action>Insert an already existing presentation.</action> A standard &kde; file open dialog will appear, allowing you to choose a <guilabel>OpenDocument Presentation</guilabel> (.odp), which will be inserted after the last slide in your current presentation.
de: <action>Fügt eine vorhandene Präsentation ein.</action> Im Standard-&kde;-Dateidialog können Sie eine <guilabel>ODP-Präsentation</guilabel> (.odp) öffnen, diese Daten werden nach der letzten vorhandenen Folie in Ihr Dokument eingefügt.

source: <guimenu>Insert</guimenu> <guimenuitem>Insert Pictures as Slides...</guimenuitem>
de: <guimenu>Einfügen</guimenu> <guimenuitem>Bilder als Folie einfügen ...</guimenuitem>

source: Use this menu item to insert one or more pictures, each is inserted on a new slide. This is useful for the people who want to use &stage; to make a slide show.
de: Mit diesem Menüeintrag fügen Sie ein oder mehrere Bilder ein, jedes Bild auf einer neuen Folie. Damit können Sie schnell eine Diaschau erstellen.

source: <guimenu>Insert</guimenu> <guimenuitem>Scan Image...</guimenuitem>
de: <guimenu>Einfügen</guimenu> <guimenuitem>Scan erstellen ...</guimenuitem>

source: <action>Scan an image with a scanner.</action> This requires you have a scanner installed. It opens a scan dialog to allow the use of the scanner.
de: <action>Liest ein Bild von einem Scanner ein.</action> Dazu muss ein Scanner installiert sein. Damit wird der Scannerdialog geöffnet, in dem Sie die Einstellungen für den Scanner auswählen können.

source: Format Menu
de: Das Menü Format

source: <guimenu>Format</guimenu> <guimenuitem>Font...</guimenuitem>
de: <guimenu>Format</guimenu> <guimenuitem>Schriftart ...</guimenuitem>

source: The <guilabel>Select Font</guilabel> dialog contains options for selected segments of text.
de: Im Dialog <guilabel>Schriftart auswählen</guilabel> finden Sie Einstellungen für den ausgewählten Text:

source: With this dialog, you can <action>change the font, style and size of selected text</action>. The <interface>preview box</interface> at the bottom allows you to <action>approximate changes before you make them</action>.
de: In diesem Dialog können Sie <action>die Schriftart, den Schriftstil und die Schriftgröße für den ausgewählten Text ändern</action>. In der <interface>Vorschau</interface> unten im Dialog können Sie Ihre Einstellungen kontrollieren.

source: <shortcut> <keycombo action="simul"> &Ctrl;&Alt;<keycap>P</keycap> </keycombo> </shortcut> <guimenu>Format</guimenu> <guimenuitem>Paragraph...</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;&Alt;<keycap>P</keycap></keycombo></shortcut> <guimenu>Format</guimenu><guimenuitem>Absatz ...</guimenuitem>

source: The <guilabel>Paragraph Format</guilabel> dialog contains settings for larger blocks of text, such as paragraphs. Using this dialog, you can set indenting, line spacing, bullet/numbered list and border settings.
de: Im Dialog <guilabel>Absatzformat</guilabel> können Sie Einrückung und Abstand, das allgemeine Layout, Zeilenabstand, Listen und Nummern sowie Dekorationen einstellen.

source: <shortcut> <keycombo action="simul">&Ctrl;&Alt;<keycap>S</keycap></keycombo> </shortcut> <guimenu>Format</guimenu> <guimenuitem>Style Manager</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;&Alt;<keycap>S</keycap></keycombo></shortcut> <guimenu>Format</guimenu><guimenuitem>Stilverwaltung</guimenuitem>

source: The <guilabel>Style Manager</guilabel> allows you to create an entire set of attributes that will be applied to selected text all at once.
de: Mit Hilfe der <guilabel>Stilverwaltung</guilabel> können Sie einen Satz von Formateinstellungen festlegen, die alle gemeinsam auf einen ausgewählten Text angewandt werden.

source: <guimenu>Format</guimenu> <guimenuitem>Page Layout...</guimenuitem>
de: <guimenu>Format</guimenu> <guimenuitem>Seitenlayout ...</guimenuitem>

source: Allows you to set the page details. You can specify the margins, the orientation, either portrait (higher than wide) or Landscape (wider than high) formats. There are many templates, such as screen, A4, US legal.
de: Hier können Sie einige Einstellungen zur Seitengröße vorgenehmen. Sie können die Ränder, die Orientierung (Hochformat oder Querformat), und die Seitengröße bestimmen. Dazu gibt es viele Vorlagen wie z.B. DIN A4 oder US Legal.

source: Slide Menu
de: Das Menü Folie

source: <guimenu>Slide</guimenu> <guimenuitem>Insert Slide</guimenuitem>
de: <guimenu>Folie</guimenu> <guimenuitem>Folie einfügen</guimenuitem>

source: Insert a new slide after the current one.
de: Fügt eine neue Folie hinter der aktuellen Folie in das Dokument ein.

source: <guimenu>Slide</guimenu> <guimenuitem>Copy Slide</guimenuitem>
de: <guimenu>Folie</guimenu> <guimenuitem>Folie kopieren</guimenuitem>

source: Copy the current slide to the clipboard.
de: Kopiert die aktuelle Folie in die Zwischenablage.

source: <guimenu>Slide</guimenu> <guimenuitem>Delete Slide</guimenuitem>
de: <guimenu>Folie</guimenu> <guimenuitem>Folie löschen</guimenuitem>

source: <action>Delete the current page from the presentation.</action> You will be asked to confirm this action.
de: <action>Löscht die aktuelle Seite aus der Präsentation.</action> Vorher erscheint eine Sicherheitsabfrage.

source: <shortcut><keycap>PageUp</keycap></shortcut> <guimenu>Slide</guimenu> <guimenuitem>Previous Slide</guimenuitem>
de: <shortcut><keycap>Bild auf</keycap></shortcut> <guimenu>Folie</guimenu> <guimenuitem>Vorherige Folie</guimenuitem>

source: Go back to the previous slide in the slide show.
de: Gehe zurück zur vorherigen Folie der Vorführung.

source: <shortcut><keycap>PageDown</keycap></shortcut> <guimenu>Slide</guimenu> <guimenuitem>Next Slide</guimenuitem>
de: <shortcut><keycap>Bild ab</keycap></shortcut> <guimenu>Folie</guimenu> <guimenuitem>Nächste Folie</guimenuitem>

source: Go to the next slide in the slide show.
de: Gehe zur nächsten Folie der Vorführung.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>Home</keycap></keycombo></shortcut> <guimenu>Slide</guimenu> <guimenuitem>First Slide</guimenuitem>
de: <shortcut><keycombo action="simul"> &Ctrl;<keycap>Pos 1</keycap> </keycombo></shortcut> <guimenu>Folie</guimenu> <guimenuitem>Erste Folie</guimenuitem>

source: Go directly to the first slide in the slide show.
de: Gehe direkt zur ersten Folie der Vorführung.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>End</keycap></keycombo></shortcut> <guimenu>Slide</guimenu> <guimenuitem>Last Slide</guimenuitem>
de: <shortcut><keycombo action="simul"> &Ctrl;<keycap>Ende</keycap> </keycombo></shortcut> <guimenu>Folie</guimenu> <guimenuitem>Letzte Folie</guimenuitem>

source: Go immediately to the final slide in the slide show.
de: Geht direkt zur letzten Folie der Vorführung.

source: Slide Show Menu
de: Das Menü Vorführung

source: <shortcut><keycombo action="simul">&Shift;<keycap>F5</keycap></keycombo></shortcut> <guimenu>Slide Show</guimenu> <guisubmenu>Start Presentation</guisubmenu> <guimenuitem>From Current Slide</guimenuitem>
de: <shortcut><keycombo action="simul">&Shift;<keycap>F5</keycap></keycombo></shortcut><guimenu> Vorführung</guimenu><guisubmenu>Präsentation starten</guisubmenu><guimenuitem>Von aktueller Folie</guimenuitem>

source: Begin the slideshow from the current slide.
de: Beginnt die Vorführung bei der aktuellen Folie.

source: <shortcut><keycap>F5</keycap></shortcut> <guimenu>Slide Show</guimenu> <guisubmenu>Start Presentation</guisubmenu> <guimenuitem>From First Slide</guimenuitem>
de: <shortcut><keycap>F5</keycap></shortcut><guimenu> Vorführung</guimenu><guisubmenu>Präsentation starten</guisubmenu><guimenuitem>Von erster Folie</guimenuitem>

source: Begin the slideshow from the first slide.
de: Beginnt die Vorführung mit der ersten Folie.

source: <guimenu>Slide Show</guimenu> <guimenuitem>Configure Slide Show...</guimenuitem>
de: <guimenu>Vorführung</guimenu> <guimenuitem>Vorführung einrichten ...</guimenuitem>

source: You can set up the properties for the entire slide show here, including whether to show the duration on screen, which of the slides in a presentation to include, and several other global settings.
de: Hier können die Eigenschaften der Vorführung festgelegt werden. Unter anderem wird die Anzeigedauer der Folien festgelegt und es können Folien von der Vorführung ausgeschlossen werden.

source: Settings Menu
de: Das Menü Einstellungen

source: The <guimenu>Settings</guimenu> menu allows you to customize &stage;.
de: Das Menü <guimenu>Einstellungen</guimenu> erlaubt die Einrichtung von &stage;.

source: <guimenu>Settings</guimenu> <guisubmenu>Show Toolbar</guisubmenu>
de: <guimenu>Einstellungen</guimenu> <guisubmenu>Werkzeugleiste anzeigen</guisubmenu>

source: In this menu you can both enable and disable the display of toolbar.
de: In diesem Menü kann die Anzeige der Werkzeugleiste ein- oder ausgeschaltet werden.

source: <guimenu>Settings</guimenu> <guimenuitem>Configure Shortcuts...</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>Kurzbefehle festlegen ... </guimenuitem>

source: <guimenuitem>Configure Shortcuts</guimenuitem> allows you to assign a keyboard shortcut to actions that &stage; menus or icons contain.
de: Über <guimenuitem>Kurzbefehle festlegen ...</guimenuitem> können Sie Tastaturkurzbefehle für Aktionen aus den Menüs und Werkzeugleisten von &stage; bestimmen.

source: Customize Shortcuts
de: Kurzbefehle anpassen

source: Customizing the shortcuts
de: Die Kurzbefehle anpassen

source: If you try to assign a shortcut that is already used, it will give you a warning message. Highlight what you want to do (in the picture, I have chosen to make a keyboard shortcut to <guilabel>About KDE</guilabel>).
de: Falls Sie einen bereits verwendeten Kurzbefehl neu zuordnen wollen, erhalten Sie einen Warnhinweis. Wählen Sie den gewünschten Eintrag aus (im Bild der Kurzbefehl für <guilabel>Über KDE</guilabel>).

source: Click the radio button to the <guilabel>Custom</guilabel> key setting and type the key you want to use. I assigned <keycap>Control</keycap> key and <keycap>Y</keycap> to bring up the <quote>About KDE</quote> dialog box.
de: Klicken Sie auf den Knopf <guilabel>Benutzerdefiniert</guilabel> und drücken Sie dann die Taste für den Kurzbefehl. Im Beispiel wird &Ctrl; und <keycap>Y</keycap> für den Dialog <quote>Über KDE</quote>-Dialog verwendet.

source: The button shows what has been assigned. Click <guibutton>OK</guibutton> to make the changes, click <guibutton>Default</guibutton> to restore whatever was assigned as default, click <guibutton>Cancel</guibutton> to do nothing and leave the dialog.
de: Im Tastensymbol wird die aktuelle Zuordnung angezeigt. Durch <guibutton>OK</guibutton> wird der Dialog geschlossen und die aktuellen Änderungen werden übernommen, <guibutton>Standard</guibutton> stellt die Standardeinstellungen wieder her und <guibutton>Abbrechen</guibutton> beendet den Dialog und verwirft die Änderungen.

source: <guimenu>Settings</guimenu> <guimenuitem>Configure Toolbars...</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>Werkzeugleisten einrichten ... </guimenuitem>

source: Configure Toolbars allows you to add or delete icons on each of the toolbars.
de: Dieser Menüeintrag erlaubt die Anpassung der in den Werkzeugleisten angezeigten Symbole.

source: <screeninfo>Configuring &stage; toolbars</screeninfo>
de: <screeninfo>Werkzeugleisten für &stage; einrichten</screeninfo>

source: <phrase>Configuring &stage; toolbars</phrase>
de: <phrase>Werkzeugleisten für &stage; einrichten</phrase>

source: At the top is a drop down box to enable you to choose which toolbar you want to modify. In the picture the <guilabel>File</guilabel> toolbar is selected. If I want to add the <guiicon>Dockers</guiicon> icon to that toolbar, I click the entry in the left window. The arrow pointing right becomes available, if I click the arrow the <guiicon>Dockers</guiicon> entry is added to the selected toolbar. The left arrow is available when you click in the right side window. It allows you to remove an icon from a toolbar. The up and down arrows become active when an item on the right side is selected. You can also move the highlight in the right side window up and down with the keyboard arrow keys. By clicking on the arrows with the mouse you can change the order of the entries in the menu.
de: Oben befindet sich eine Auswahlliste für die zu bearbeitenden Werkzeugleisten. Im Bild wurde die Werkzeugleiste <guilabel>Datei</guilabel> ausgewählt. Wenn Sie das Symbol <guiicon>Rechtschreibung</guiicon> zu dieser Werkzeugleiste hinzugefügen wollen, klicken Sie auf diesen Eintrag in der linken Liste. Dadurch wird das Symbol <guiicon>Pfeil rechts</guiicon> aktiviert. Durch Klicken auf diesen Pfeil wird <guiicon>Andockbare Dialoge</guiicon> in die ausgewählte Werkzeugleiste aufgenommen. Der Pfeil nach links ist aktiviert, wenn Sie die rechte Liste klicken. Damit entfernen Sie Einträge aus der Werkzeugleiste. Sie können dann außerdem den ausgewählten Eintrag in der rechten Liste mit den Pfeiltasten auf der Tastatur oder durch Klicken mit der Maus auf den Pfeil aufwärts und abwärts verschieben und dadurch die Position des Symbols in der Werkzeugleiste verändern.

source: <guimenu>Settings</guimenu> <guimenuitem>Themes</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>Designs</guimenuitem>

source: <action>Choose the color theme for &stage; window.</action> You can choose one of the predefined color schemes or select <guimenuitem>Configuration...</guimenuitem> to open <ulink url="help:/kcontrol/colors">&systemsettings; color selection module</ulink>.
de: <action>Auswahl des Farbdesigns für das &stage;-Fenster.</action> Sie können eines der vordefinierten Farbschemata auswählen oder mit <guimenuitem>Einrichtung ...</guimenuitem> das <ulink url="help:/kcontrol/colors">Modul Farben der &systemsettings;</ulink> öffnen.

source: <guimenu>Settings</guimenu> <guimenuitem>Configure Stage...</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>Stage einrichten ... </guimenuitem>

source: See the <link linkend="configure-dialog">Configure &stage;</link> section for a complete explanation of all &stage; settings.
de: Im Kapitel <link linkend="configure-dialog">Einrichten</link> finden Sie eine vollständige Erklärung aller Einstellungen von &stage;.

source: Help Menu
de: Das Menü Hilfe
