Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/calligra/stage_great-presentations.po
Languages: de

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Burkhard</firstname><surname>Lück</surname><affiliation><address><email>lueck@hube-lueck.de</email></address></affiliation><contrib>Übersetzung</contrib></othercredit>

source: General Hints and Tips for Great Presentations
de: Allgemeine Hinweise und Tipps für großartige Präsentationen

source: Okay, you've decided to use &stage; for your presentation. Before you start making transparencies or animated slide shows, go and find a piece of paper and sit down at a desk away from the computer. It doesn't matter whether you are doing a teaching session or trying to convince the boss that your plan, policy or idea should be adopted, you need to figure out what you are trying to say. Write down all the subjects you need to cover, try to get them in the order you think will make sense. Don't put any details in yet, just decide on headings and the structure of your talk.
de: Bevor man eine Präsentation mit &stage; erstellen kann, gibt es eine Reihe von Vorbereitungen, die man am besten ohne Computer trifft. Man sollte sich ein Blatt Papier nehmen und den Inhalt der Präsentation planen. Dabei ist es egal, ob man für eine Unterrichtsstunde irgend welcher Art plant oder seinen Chef von seinen Plänen und Ideen überzeugen will. Man muss entscheiden, was man eigentlich mit der Präsentation sagen will. Das beinhaltet die Themen, die Struktur, die Überschriften. Den Inhalt muss man an dieser Stelle noch nicht festlegen.

source: Under each heading make a note of what facts you need to cover. You are trying to build a convincing argument. Consider grouping your facts into things must be included, things that should be included and things that it would be nice to cover if you had plenty of time.
de: Zu jeder Überschrift notiert man die Fakten, die genannt werden sollen. Man muss versuchen, überzeugende Argumente zu finden. Die Fakten sollten in wichtige, weniger wichtige und zusätzliche, die man bei zu viel Zeit einbringen möchte, eingeteilt werden.

source: Once you have written down all the things you need to say, consider the time available to do it in. Ten minutes seems ages when you start, but it is very difficult to actually get much across in so short a time. Get your sheet of paper and a clock with a second hand. Practise your presentation over and over again. This has many benefits. Firstly, you get the timing right. If someone says you have ten minutes, never go over the allowed time. Secondly, when you actually do it in front of a live audience, it will not be the first time you have done that presentation. Third, you get the words right in your own head. You will find ways of saying things about the subject. If you've heard yourself do this presentation several times, you will know what you are going to say next and how you are going to say it.
de: Nachdem man damit fertig ist, ist als Nächstes die verfügbare Zeit zu beachten. Zehn Minuten erscheinen zu Beginn unendlich lang zu sein, sind allerdings für eine informative Rede nur eine sehr kurze Zeitspanne. Daher ist es nötig, die Präsentation oft unter Beachtung der zur Verfügung stehenden Zeit zu üben. Das hat viele Vorteile: Erstens entwickelt man ein Gefühl für die richtige Geschwindigkeit. Man sollte sich zur Regel machen, eine vorgegebene Zeit nicht zu überschreiten. Zweitens hat man die Präsentation schon einige Male durchgeführt, wenn man sie schließlich vor Publikum vorträgt. Drittens hat man sich die richtigen Worte bereits im Kopf zurechtgelegt. Man gewinnt eine gewisse Freiheit, über die Inhalte der jeweiligen Folie zu sprechen, ohne sie wortwörtlich vor zu lesen.

source: &stage; does not produce Speaker's Notes at the time of writing, but I am happy to just use ordinary slides. Produce some slides for yourself, printed on plain paper, and some for use with the Overhead Projector. Make the text on your slides nice and big, you need to be able to read it at a distance. I use 14 or 16 point text, experiment to find a size that you can read easily. I never write out a script.
de: Mit &stage; kann man momentan noch keine Notizen für den Sprecher erstellen, aber normale Folien reichen aus. Man sollte einige Folie für sich selbst auf Papier ausdrucken und einige für den Overheadprojektor. Die Textgröße sollte so gewählt sein, dass man den Text auch aus größerer Entfernung lesen kann. Eine Größe von 14 bis 16 Punkt ist ein guter Richtwert. Ein Skript ist nicht zu empfehlen.

source: If you are using an Overhead projector, learn how to use it beforehand. Make sure that the bulb works, that the spare bulb is still okay. Clean the lens and display plates. If you are not used to working with projectors, practice. Ensure that the projection screen itself is clean. It's probably best, when timing yourself, to allow for five seconds (count <quote>one thousand and one, one thousand and two....</quote>) to change each slide. That way you know you don't have to rush. If you need to point at something on a slide, you can use a pointer and point at the display screen, find a laser pointer or put a pencil on the transparency itself. Be warned, these tend to roll out of place when you nudge the table.
de: Man sollte sich mit einem Overheadprojektor vor der Präsentation vertraut machen. Es ist sinnvoll, die Lampe und Ersatzlampe auf einwandfreie Funktion zu überprüfen und eventuell die Linsen und die Oberflächen zu reinigen. Üben Sie, wenn Sie selten mit Projektoren arbeiten. Auch die Projektionsfläche muss sauber sein. Beim Üben sollte man etwa fünf Sekunden (zählen Sie <quote>Eintausendundeins, Eintausendundzwei ....</quote>) Zeit zum Wechsel einer Folie einplanen. Man kann entweder einen Laserpointer an der Projektionsfläche oder einen Bleistift o. Ä. auf dem Overheadprojektor selbst verwenden, um auf etwas zu zeigen. Bleistifte neigen zum Wegrollen, falls man gegen den Projektor stößt.

source: Consider where you are going to stand. You cannot stand in front of your display, so off to one side is probably your best option if you want your audience to be able to see. I often project a picture onto a wipeboard and draw over the top of it. If you are using a PC with a digital projector you can draw over the top of your slides with &stage;'s pen tool. Remember, drawing freehand with a mouse is a skill that needs practice. If you are using an Overhead projector, you can use transparent overlay slides and a pen over the top of your computer generated ones.
de: Man muss die eigene Standposition einplanen. Vor der Projektionsfläche ist kein guter Platz, etwas seitlich ist eine geeignete Position, damit das Publikum Sie sehen kann. Wenn man die Folie auf eine weiße Tafel projiziert, kann man auf der Projektion zeichnen. Wenn Sie einen PC mit einem digitalen Projektor arbeiten, können Sie auch auf den Folien mit dem Präsentationsstift von &stage; zeichnen. Freihändiges Zeichnen mit einer Maus erfordert allerdings einige Übung. Bei einem Overheadprojektor kann man auch transparente Folien auf die Präsentationsfolie legen und einen Folienstift verwenden.

source: When you are doing the presentation do not accidently look into the light, it's easy to do. If you are not going to use the machine for a few minutes, turn it off. Practise to get where you are going to stand sorted out. Check the room you intend to use for electrical sockets and learn how the blinds work and where the light switches are. Good preparation not only makes you less likely to make mistakes (inanimate things can be a nightmare in front of an audience) but also gives you confidence. Always have a <quote>Plan B</quote> ready if something refuses to work. Have a paper copy of your slides with you. You can photocopy and distribute these to your audience if the equipment fails.
de: Man sollte wegen Blendeffekten unbedingt vermeiden, direkt in das Licht zu sehen. Falls man den OHP einige Minuten nicht benötigt, sollte man ihn ausschalten. Man sollte sich auch mit dem Präsentationsraum vertraut machen. Die Positionen von Steckdosen sollte man kennen und die Bedienung von Lichtschaltern und Vorhängen sollte ausprobiert werden. Das vermeidet Fehler und gibt Sicherheit. Man sollte sich auch ein paar Gedanken über Pannen machen und Alternativen einplanen. Papierausdrucke der Folien, die im Notfall fotokopiert und an die Zuhörer verteilt werden können, sind sehr sinnvoll.

source: I have not said much about the content yet. At present all you have is a piece of paper with everything you want to say on it. Before you make anything, ask youself if their understanding of what you are saying is going to improved by showing them a picture. Bad presentations consist of a series of slides full of text. The presenter then reads the slide to the audience (who have already read it as they can read faster than someone can say it aloud). Try to avoid writing anything on the slide, except a title and a number. Draw a picture of what you need to say, then explain the picture to them. That way they do not get ahead of you (they can read faster than you can speak, remember?) and you look like you know it. You do not know it, you are using the picture as a series of prompts. A slide should support what you are saying, not duplicate it. A slide should be the focus of the audience's attention, not a distraction.
de: Bisher wurde noch nichts über den Inhalt der Präsentation gesagt. Bisher hat man nur ein Blatt Papier mit den Inhalten vor sich. Bei der Erstellung der Präsentation sollte man sich bei jeder Folie fragen, ob das Verständnis durch die Folie verbessert wird. Man kann fürchterliche Präsentationen durchführen, wenn man nur Folien gefüllt mit Texten produziert und diese dann den Zuhörern vorliest (das ist unmöglich, da jeder Zuhörer still schneller liest als der Vortragende laut).Man sollte zunächst nichts anderes als einen Titel und eine Nummer auf jede Folie schreiben. Dann versucht man, eine Zeichnung des Inhalts anzufertigen. Diese Zeichnung kann man den Zuhörern dann erklären. Auf diese Weise sind die Zuhörer nicht schneller und der Vortragende macht einen kompetenten Eindruck. Die Zeichnungen dienen gewissermaßen als Stichwortgeber. Eine Folie sollte eine Ergänzung zum Vortrag sein und kein Duplikat des Vortrags. Damit wird die Konzentration des Publikums gefesselt und nicht zerstreut.

source: An example. I teach Railway staff how to respond to accidents. I wanted to use a slide to discuss how you can move dangerous loads from a derailed or damaged rail vehicle to a road vehicle after an accident. The slide I made had a simple drawing of tank wagon, the kind used for carrying gases or oils. On the side I wrote <quote>Lethal Chemical Company</quote> so that I do not have to explain it. I wanted to make several important points. First, you must get any overhead electric wires turned off before you do anything if they are within a certain distance. I drew one of the supporting structures and drew an arrow with the safety distance on it. Then I wanted to say that you must not transfer the wagon's contents in darkness or thunderstorms. I drew a moon and a lightning bolt above the vehicle. You must get specialist advice, so I drew a sheet of paper and wrote the word <quote>Plan</quote> near the vehicle. You also have to ensure that the vehicle does not move when the weight inside is removed. I drew little red wedges by the wheels. Everything I need to talk about is on this drawing. All I have to do is look at the drawing and it tells me what I need to cover. When I have covered all the things in the drawing, I have finished on that subject.
de: Ein Beispiel zur Illustration: Eine Unterrichtsstunde für Bahnangestellte zum Verhalten bei Unfällen. Inhalt der Folie soll sein, wie man Gefahrgüter sicher von einem entgleisten Wagen auf einen Lastwagen umlädt. Das Folienbild zeigt einen Tankwagen für Gase oder Flüssigkeiten. Auf der Seite steht <quote>Tödliche Chemiefabrik</quote> geschrieben. Folgende wichtige Dinge sollen dazu gesagt werden: Erstens, der Strom in benachbarten Oberleitungen muss abgeschaltet werden, bevor man irgend etwas anderes unternimmt. Daher wird ein Pfeil zu einem Strommasten gezeichnet und der erforderliche Sicherheitsabstand an diesen Pfeil geschrieben. Zweitens dürfen die Wagoninhalte nicht bei Dunkelheit oder Gewitter umgeladen werden. Daher wird ein Mond und ein Blitz oberhalb des Wagons eingezeichnet. Drittens sollte man sich Rat von Fachleuten holen. Daher wird ein Papier neben den Lastwagen gezeichnet und <quote>Plan</quote> darauf geschrieben. Viertens muss sicher gestellt werden, dass der Wagon sich beim umladen nicht bewegt. Daher werden kleine rote Keile bei den Rädern eingezeichnet. Damit befinden sich alle wichtigen Inhalte gewissermaßen auf der Folie.

source: In general, only use a slide or picture if it shows something that adds to what you are saying. Finally, relax and try not to rush through it all. Talk to them, not at them and remember that a presentation is about whatever message you are trying to get across. &stage; is a useful tool. It can help you to get that message over, but it cannot do the job for you.
de: Im Allgemeinen sollte man ein Bild nur dann verwenden, wenn es zu dem Vorgetragenen etwas hinzufügt. Schließlich ist noch wichtig, nicht zu schnell vorzutragen. Man muss mit dem Publikum reden und darf nicht auf das Publikum einreden und sollte immer daran denken, dass man mit der Präsentation etwas vermitteln will. &stage; ist ein Werkzeug. Es kann nützlich sein, aber dessen Verwendung macht die Präsentation nicht automatisch gut.
