Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/calligra/stage_tutorial.po
Languages: de

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Hans-Frieder</firstname><surname>Hirsch</surname><affiliation><address><email>f.hirsch@t-online.de</email></address></affiliation><contrib>Deutsche Übersetzung</contrib></othercredit>

source: A Step-By-Step Tutorial
de: Eine ausführliche Anleitung

source: In this chapter, &stage; is introduced using a simple tutorial. We shall walk through the most basic steps that are involved in creating a presentation, and adding some basic effects.
de: In dieser Anleitung wird &stage; vorgestellt. Es wird im Verlauf dieser Anleitung eine einfache Präsentation mit einigen einfachen Zusatzeffekten erstellt.

source: Start a new document
de: Ein neues Dokument erstellen

source: When you start &stage;, the usual &calligra; startup dialog appears.
de: Beim Start von &stage; erscheint der &calligra;- Startdialog.

source: The <guilabel>&calligra;</guilabel> startup dialog
de: Der <guilabel>&calligra;</guilabel>-Startdialog

source: The &calligra; startup dialog
de: Der &calligra;-Startdialog

source: Select <guilabel>Screen</guilabel> on the left then select the template labeled <guilabel>Empty</guilabel> (highlighted in blue in the screenshot above) by clicking on it. You can check <guilabel>Always use this template</guilabel> to make it the default template.
de: Wählen Sie auf der linken Seite <guilabel>Folien</guilabel> und klicken Sie dann auf die Vorlage <guilabel>Leer</guilabel> (Im Bildschirmfoto oben hervorgehoben). Soll diese Vorlage immer beim Programmstart verwendet werden, aktivieren Sie die Einstellung <guilabel>Immer diese Vorlage verwenden</guilabel>.

source: Now click <guibutton>Use This Template</guibutton>. This brings up the slide editor window, where you can view and edit the slides (and objects contained in them) in your document.
de: Durch Klicken auf <guibutton>Diese Vorlage verwenden</guibutton> öffnen Sie den Folieneditor. Darin können Sie Folien anzeigen und bearbeiten, einschließlich der darin enthaltenen Objekte.

source: At the moment, we just have one empty slide, so select the upper left slide with the single text box from the <guilabel>Slide Layouts</guilabel> docker.
de: Die Präsentation enthält zurzeit nur eine leere Folie, daher wählen Sie im andockbaren Dialog <guilabel>Folienlayouts</guilabel> die obere linke Folie mit dem einzelnen Textfeld.

source: Double-click the text box. The cursor changes to a vertical bar to show that you can now type some text.
de: Durch Doppelklicken in das Textfeld ändern Sie den Cursor in einen senkrechten Balken, der Ihnen anzeigt, dass Sie Text eingeben können.

source: <screeninfo>The text insertion cursor</screeninfo>
de: <screeninfo>Der Texteinfügen-Cursor</screeninfo>

source: <phrase>The text insertion cursor</phrase>
de: <phrase>Der Texteinfügen-Cursor</phrase>

source: Go ahead, type some text!
de: Tippen Sie etwas Text ein.

source: <screeninfo>Adding text</screeninfo>
de: <screeninfo>Text hinzufügen</screeninfo>

source: <phrase>Adding text</phrase>
de: <phrase>Text hinzufügen</phrase>

source: Click away from the text to de-select the text box when you are done typing.
de: Um die Eingabe zu beenden, klicken Sie außerhalb des Textrahmens.

source: Add a new page
de: Eine neue Seite hinzufügen

source: Let's now add a new slide to our document. To do so, click the <guimenu>Slide</guimenu> menu, and then click on <guimenuitem>Insert Slide</guimenuitem>.
de: Fügen Sie nun eine neue Folie in Ihr Dokument ein. Dazu klicken Sie im Menü <guimenu>Folie</guimenu> auf <guimenuitem>Folie einfügen ...</guimenuitem>.

source: Now we can decide what the new slide should look like. This time, select one column layout (highlighted in blue.)
de: Nun können Sie nun eine Vorlage für die neue Folie auswählen. Wählen Sie nun das blau hervorgehobene Layout mit einer Spalte.

source: <screeninfo>Choosing a layout for the new page</screeninfo>
de: <screeninfo>Auswahl eines Layouts für die neue Seite</screeninfo>

source: <phrase>Choosing a layout for the new page</phrase>
de: <phrase>Auswahl eines Layouts für die neue Seite</phrase>

source: The new slide layout now appears in the editing window. To change between pages of your presentation, you can select slides in the pane to the left (highlighted in blue for this screenshot).
de: Das neue Folienlayout erscheint im Folieneditor. Um zwischen den zwei Folien zu wechseln, wählen Sie die gewünschte Folie in der Folienliste auf der linken Seite (im Bildschirmfoto hervorgehoben).

source: The newly inserted slide has two text boxes. There is one for a title, and another to contain a bulleted list of items.
de: Die neu eingefügte Seite enthält zwei Textfelder, das erste für den Titel und das zweite für eine Liste von Einträgen.

source: <screeninfo>The new slide</screeninfo>
de: <screeninfo>Die neue Folie</screeninfo>

source: <phrase>The new slide</phrase>
de: <phrase>Die neue Folie</phrase>

source: Double-click and type a title. Then double-click on the second text box with the bullet. Type some text and end the paragraph by pressing the <keycap>Enter</keycap> or <keycap>Return</keycap> key. As you type new paragraphs, bullets automatically appear in front of them.
de: Doppelklicken Sie in das erste Textfeld und geben Sie einen Titel für die Seite ein. Doppelklicken Sie dann in das zweite Textfeld mit dem Aufzählungszeichen. Geben Sie Ihren Text ein und beenden Sie den Absatz mit der <keycap>Eingabe</keycap>taste. Am Anfang des nächsten neuen Absatzes erscheint automatisch wieder das Aufzählungszeichen.

source: <screeninfo>Adding text to the second slide</screeninfo>
de: <screeninfo>Text auf der zweiten Folie eingeben</screeninfo>

source: <phrase>Adding text to the second slide</phrase>
de: <phrase>Text auf der zweiten Folie eingeben</phrase>

source: You can de-select the text box by clicking away from it.
de: Beenden Sie die Eingabe durch Klicken außerhalb des Textfeldes.

source: Insert a picture
de: Ein Bild einfügen

source: Let's go back to the first slide now. Use the list of slides on the left of your screen.
de: Gehen Sie zurück zur ersten Folie, indem Sie in der Folienliste links im Fenster darauf klicken.

source: In this section, we'll liven our presentation up a bit by adding a nice logo to the title page. To do so, the first step is to enable the <guilabel>Add Shape</guilabel> docker using <menuchoice><guimenu>Settings</guimenu> <guimenuitem>Dockers</guimenuitem></menuchoice> from the menu.
de: Die Titelseite soll jetzt mit einem ansprechenden Logo etwas <quote>aufgepeppt</quote> werden. Dazu aktivieren Sie den andockbaren Dialog <guimenu>Objekt hinzufügen</guimenu> mit <menuchoice><guimenu>Einstellungen</guimenu> <guimenuitem>Andockbare Dialog</guimenuitem></menuchoice> aus dem Menü.

source: Now select Image in the <guilabel>Add Shape</guilabel> docker and click with the &LMB; where you want to place the loge in it's original size or draw a rectangle with the left mouse (click the &LMB; and keep the button pressed) to specify the position and size for the logo.
de: Wählen sie jetzt das Bild aus dem andockbaren Dialog <guilabel>Objekt hinzufügen</guilabel> und klicken Sie mit der &LMBn; auf die Folie, um die Grafik mit der linken oberen Ecke dort in Originalgröße einzufügen, oder ziehen Sie mit der &LMBn; ein Rechteck für die Position und Größe der Grafik.

source: A file selection dialog appears. To learn about this or other standard &kde; dialog boxes in detail, please consult the &kde; documentation. You can browse by clicking on <guiicon>folder</guiicon> icons or by using the <guiicon>browser</guiicon> style buttons on the toolbar. Clicking the <guiicon>up arrow</guiicon> takes you up one folder level.
de: Ein Dateiauswahldialog erscheint. Dieser Dialog und andere &kde;-Standarddialoge werden ausführlich in der &kde;-Dokumentation erläutert. Sie können das Dateisystem durch Klicken auf die <guiicon>Ordner</guiicon>-Symbole oder mit Hilfe der <guiicon>Browser</guiicon>-Knöpfe durchsuchen. Mit der Taste <guiicon>Pfeil auf</guiicon> erreichen Sie die nächsthöhere Ordnerebene.

source: Select a file and click <guibutton>OK</guibutton>.
de: Wählen Sie eine Datei und drücken Sie den Knopf <guibutton>OK</guibutton>.

source: Now the image is inserted in the slide and there are selection handles (little squares) visible around the border of the graphic.
de: Nun wird die Grafik in die Folie eingefügt. An den Rändern der Grafik werden kleine Quadrate als Ziehpunkte angezeigt.

source: <screeninfo>The newly added image</screeninfo>
de: <screeninfo>Das neu hinzugefügte Bild</screeninfo>

source: <phrase>The newly added image</phrase>
de: <phrase>Das neu hinzugefügte Bild</phrase>

source: Place the mouse cursor anywhere in the middle of the logo, and drag it to the middle of the title page. Then use the selection handles to resize it correctly.
de: Platzieren Sie den Mauszeiger auf die Grafik und ziehen Sie sie in die Mitte der Titelseite. Mit Hilfe der Anfasser ziehen Sie die Grafik dann auf die gewünschte Größe.

source: That's it. Now you have a picture on the title page!
de: Damit haben Sie das Bild auf der Titelseite eingefügt.

source: Insert a &calligra; object
de: Ein &calligra;-Objekt einfügen

source: Let's insert another &calligra; object under the picture, for example a chart.
de: Fügen Sie ein anderes &calligra;-Objekt unter der Grafik ein, zum Beispiel ein Diagramm.

source: Every &calligra; supported object can be embedded in a &stage; slide. Let's choose a chart from the <guilabel>Add Shape</guilabel> docker.
de: Jedes &calligra;-Objekt kann in eine &stage;-Folie eingefügt werden. Wählen Sie nun ein Diagramm aus dem andockbaren Dialog <guilabel>Objekte hinzufügen</guilabel>.

source: Select <guilabel>Chart</guilabel> and then outline with your mouse the area you want to put your chart in on the &stage; slide.
de: Wählen Sie <guilabel>Diagramm</guilabel> und ziehen Sie mit dem Mauszeiger ein Rechteck auf der &stage;-Folie, in dem das Diagramm eingefügt werden soll.

source: <screeninfo>Select the area where to put the chart</screeninfo>
de: <screeninfo>Einen Platz für das Diagramm auswählen</screeninfo>

source: <phrase>Select the area where to put the chart</phrase>
de: <phrase>Einen Platz für das Diagramm auswählen</phrase>

source: Once you release the mouse button, a template chart is added on the slide. Whenever you work in the chart, its <guilabel>Tool Options</guilabel> appear in the docker.
de: Lassen Sie die Maustaste los, dann wird eine Diagrammvorlage in die Folie eingefügt. Immer wenn Sie das Diagramm bearbeiten, werden die <guilabel>Werkzeugoptionen</guilabel> für das Diagramm im andockbaren Dialog angezeigt.

source: <screeninfo>&kchart; Tool Options</screeninfo>
de: <screeninfo>Werkzeugoptionen des Diagramms</screeninfo>

source: <phrase>&kchart; Tool Options</phrase>
de: <phrase>Werkzeugoptionen des Diagramms</phrase>

source: To move, resize or even delete the embedded chart switch to the <guibutton>Basic shape manipulation</guibutton> tool and click anywhere within the chart area. It should now appear with a green border and with a small yellow square at each corner and in the middle of each edge.
de: Um das eingebettete Diagramm zu verschieben, zu vergrößern oder zu verkleinern oder um es zu löschen, wechseln Sie zum <guibutton>Werkzeug für Objekte</guibutton> und klicken dann irgendwo in das Diagramm. Es wird jetzt mit einem grünen Rand und mit je einem kleinen gelben Quadrat an jeder Ecke und in der Mitte jeder Seite angezeigt.

source: If you move the cursor over any of the squares it should change to a double headed arrow. You can resize the chart by dragging one of these squares with the <mousebutton>left</mousebutton> mouse button pressed. To delete the chart <mousebutton>right</mousebutton> click on one of the squares and select <guimenuitem>Delete</guimenuitem>.
de: Wenn Sie den Mauszeiger über eins der Quadrate bewegen, wird als Pfeil mit zwei Spitzen angezeigt. Sie können die Größe des Diagramms nun ändern, indem Sie eins dieser Quadrate mit der gedrückten <mousebutton>linken </mousebutton>Maustaste ziehen. Um das Diagramm zu löschen, klicken Sie mit der <mousebutton>rechten</mousebutton> Maustaste auf eins der Quadrate und wählen Sie <guimenuitem>Löschen</guimenuitem>.

source: To move the chart move the cursor into the chart. The cursor should then change to a cross, press the <mousebutton>left</mousebutton> mouse button and you will be able to drag the chart to where you want it to be.
de: Um das Diagramm zu verschieben, bewegen Sie den Cursor hinein. Der Cursor wird zu einem Kreuz, halten Sie jetzt die <mousebutton> linke </mousebutton> Maustaste gedrückt und Sie können das Diagramm dorthin bewegen, wo Sie es haben wollen.

source: To restore the chart to its normal appearance simply click anywhere outside of the chart area.
de: Um das Aussehen des Diagramms wieder zu normalisieren, klicken Sie einfach irgendwo außerhalb des Diagramms in die Tabelle.

source: To change the format of the chart itself <mousebutton>left</mousebutton> click twice within the chart area. The chart <guilabel>Tools Options</guilabel> should appear in the docker. You can then use these tools to edit the chart properties like chart type, labels, axis and data.
de: Um das Format des Diagramms selbst zu ändern, doppelklicken Sie mit der <mousebutton>linken</mousebutton> Maustaste innerhalb des Diagrammbereichs. Die <guilabel>Werkzeugoptionen</guilabel> für Diagramme werden dann angezeigt und sie können dann damit die Eigenschaften des Diagramms wie den Typ, Beschriftungen, Achsen und Daten ändern.

source: Click anywhere with the &LMB; outside the chart to go back to &stage; slide.
de: Klicken Sie mit der &LMB; außerhalb des Diagramms, um die Folie in &stage; weiter zu bearbeiten.

source: A single click on the chart will allow you to drag it to change its location and also to drag the borders to make it bigger as with any other &stage; object. Double click on the chart to get into &kchart; mode and modify any of the chart property.
de: Klicken Sie einmal auf das Diagramm und Sie können es verschieben oder an den Kanten oder Ecken ziehen, um es in der Größe zu verändern. Doppelklicken Sie auf das Diagramm, dann können Sie das Diagramm in den Werkzeugoptionen bearbeiten und alle Eigenschaften verändern.

source: Change the color of the title text
de: Die Textfarbe des Titels verändern

source: Let's finish by changing the color of the title text from black to blue. To do so, select the title text by double-clicking the text box and select the text.
de: Der Titeltext der Titelseite soll zum Abschluß noch in blauer anstatt schwarzer Farbe dargestellt werden. Dazu wählt Sie den Textrahmen durch doppelklicken und dann den Text im Rahmen.

source: Open the color selector by clicking on the <inlinemediaobject><imageobject> <imagedata fileref="22x22-actions-format-text-color.png" format="PNG"/></imageobject> </inlinemediaobject> icon in the Text editing Tools Options (this icon has a Text Color... tooltip).
de: Öffnen Sie die Farbauswahl, indem Sie auf das Symbol <inlinemediaobject><imageobject> <imagedata fileref="22x22-actions-format-text-color.png" format="PNG"/></imageobject> </inlinemediaobject> in den Werkzeugoptionen der Textbearbeitung klicken, für dieses Symbol wird Textfarbe als Kurzinfo angezeigt.

source: <screeninfo>The color selector</screeninfo>
de: <screeninfo>Farbauswahldialog</screeninfo>

source: <phrase>The color selector</phrase>
de: <phrase>Farbauswahldialog</phrase>

source: Change the color to blue.
de: Wählen Sie hier eine blaue Farbe.

source: Changing the color of the selected text to blue changes its appearance. The exact color that highlighted text turns depends on your system color scheme.
de: Damit ändert der ausgewählte Text seine Farbe. Die genaue Farbe des ausgewählten Textes hängt von ihrem System und dem eingestellten Farbschema ab.

source: Text color selection is also available on the <guilabel>Decorations</guilabel> tab of the <guilabel>Select Font</guilabel> dialog. Open this dialog with <guimenuitem>Font</guimenuitem> in the <guimenu>Format</guimenu> menu or context menu.
de: Die Farbe für Texte können Sie auch auf der Karteikarte <guilabel>Dekorationen</guilabel> des Dialogs <guilabel>Schriftart auswählen</guilabel> mit <guimenuitem>Schriftart</guimenuitem> aus dem Menü <guimenu>Format</guimenu> oder dem Kontextmenü einstellen.

source: Now click away from the text to de-select it.
de: Beenden Sie die Bearbeitung durch Klicken außerhalb des Textfeldes.

source: <screeninfo>The finished title</screeninfo>
de: <screeninfo>Der fertige Titel</screeninfo>

source: <phrase>The finished title</phrase>
de: <phrase>Der fertige Titel</phrase>

source: Now that there are two slides, why not try a slide show! To start the slide show, press the <guiicon>Start Presentation</guiicon> button in the toolbar. The first slide should appear on your screen.
de: Starten Sie jetzt mit den beiden Folien eine Vorführung. Klicken Sie auf das Symbol <guiicon>Präsentation starten</guiicon> in der Werkzeugleiste. Die erste Folie wird auf dem Bildschirm angezeigt.

source: To advance from the first slide to the next, just click anywhere on the screen, or use the <keycap>Page Down</keycap> key.
de: Durch Klicken auf den Bildschirm oder mit der Taste <keycap>Bild ab</keycap> wechseln Sie zur zweiten Folie.

source: To exit the slide show, press the &Esc; key.
de: Um die Präsentation zu beenden, drücken Sie die Taste &Esc;.
