Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/calligra/stage_options.po
Languages: de

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Hans-Frieder</firstname><surname>Hirsch</surname><affiliation><address><email>f.hirsch@t-online.de</email></address></affiliation><contrib>Deutsche Übersetzung</contrib></othercredit>

source: Configuring &stage;
de: Einrichtung von &stage;

source: The Configure - Stage Dialog
de: Der Einrichtungsdialog

source: <title>Misc</title>
de: <title>Verschiedenes</title>

source: <screeninfo>Misc</screeninfo>
de: <screeninfo>Verschiedenes</screeninfo>

source: <phrase>Misc</phrase>
de: <phrase>Verschiedenes</phrase>

source: Units
de: Einheiten

source: Choose the default unit that will be used in your slides.
de: Wählen Sie die Standardeinheit, die in Ihren Folien verwendet wird.

source: Handle radius
de: Radius der Ziehpunkte

source: If you select a shape with the default tool (arrow) you see the yellow and red rectangles. These are called handles (used for resizing, rotation, ...). The handle radius changes the size of the handles. If you make them bigger it is easier to hit them.
de: Wenn Sie ein Objekt mit dem Standardwerkzeug (Pfeil) auswählen, wird der Umriss mit gelben und roten Quadraten angezeigt. Der Radius dieser Ziehpunkte (zur Größenänderung, Drehung &etc;) legt die Größe diese Elemente fest, je größer desto einfacher sind sie zu treffen.

source: Grab sensitivity
de: Empfindlichkeit der Ziehpunkte

source: This option defines how exactly you need to hit a handle to select it.
de: Mit dieser Einstellung geben Sie an, wie der Abstand zum Ziehpunkt für die Aktivierung ist.

source: Paste offset
de: Versatz beim Einfügen

source: This is only active if <guilabel>Paste at Cursor</guilabel> is disabled. If you copy a shape with the shortcut <keycombo action="simul">&Ctrl;<keycap>C</keycap></keycombo> and paste it with <keycombo action="simul">&Ctrl;<keycap>V</keycap></keycombo>, and do that at a place where already a shape is this offset is used to paste the new shape to the bottom/right.
de: Dieser Versatz kann nur geändert werden, wenn <guilabel>Am Cursor einfügen</guilabel> abgeschaltet ist. Wenn Sie mit ein Objekt mit den Kurzbefehlen <keycombo action="simul">&Ctrl;<keycap>C</keycap></keycombo> kopieren und mit <keycombo action="simul">&Ctrl;<keycap>V</keycap></keycombo> an einer Stelle einfügen, an der sich bereits ein Objekt befindet, wird das eingefügte Objekt um diesen Wert nach rechts unten versetzt eingefügt.

source: Paste at Cursor
de: Am Cursor einfügen

source: Disables the paste offset and insert a pasted shape at the mouse cursor position.
de: Deaktiviert den Versatz beim Einfügen und fügt ein Objekt immer an der Position des Mauszeigers ein.

source: <title>Grid</title>
de: <title>Gitter</title>

source: <screeninfo>Grid</screeninfo>
de: <screeninfo>Gitter</screeninfo>

source: <phrase>Grid</phrase>
de: <phrase>Gitter</phrase>

source: <guilabel>Grid</guilabel>
de: <guilabel>Gitter</guilabel>

source: Show grid
de: Gitter anzeigen

source: If enabled, &stage; will display a grid of dots representing the intersections of imaginary horizontal and vertical lines. You can use these dots to precisely position objects on the slide.
de: Wenn diese Option aktiviert ist, zeigt &stage; ein Punktgitter an. Diese Punkte repräsentieren die Schnittpunkte eines Gitters aus wagerechten und senkrechten Linien. Sie dienen zur exakten Positionierung von Objekten auf der Folie.

source: Snap to grid
de: An Gitter ausrichten

source: If this is enabled, when dropping or moving objects on the slide the top left corner of the object will <quote>snap</quote> or move, to the nearest grid point.
de: Wenn diese Option markiert ist, werden verschobene oder neu erstellte Objekte mit ihrer linken oberen Ecke auf dem nächstliegenden Gitterpunkt <quote>einrasten</quote>.

source: This does reduce your freedom to freely position objects on the slide, however it also helps to line up objects precisely. It is easily disabled or enabled with this option, allowing you the best of both worlds.
de: Trotzdem können Sie Objekten auf der Folie beliebig anordnen. Diese Option hilft aber bei der genauen Ausrichtung von Objekten. Bei Bedarf kann diese Funktion schnell ein- oder ausgeschaltet werden.

source: Grid color:
de: Gitterfarbe:

source: You can change here the grid color which is black as default.
de: Stellen Sie hier die Gitterfarbe ein, als Standard ist Schwarz vorgegeben.

source: Spacing
de: Abstände

source: You can choose to keep the same ratio for the two settings below by having the <inlinemediaobject><imageobject> <imagedata fileref="link.png" format="PNG"/></imageobject></inlinemediaobject> icon or to separate the two settings by using the <inlinemediaobject><imageobject> <imagedata fileref="break.png" format="PNG"/></imageobject></inlinemediaobject> icon.
de: Mit dem Symbol <inlinemediaobject><imageobject> <imagedata fileref="link.png" format="PNG"/></imageobject></inlinemediaobject> bleibt das Verhältnis der unten genannten Abweichungen erhalten, mit dem Symbol <inlinemediaobject><imageobject> <imagedata fileref="break.png" format="PNG"/></imageobject></inlinemediaobject> können Sie die beiden unten genannten Werte unabhängig voneinander einstellen.

source: Horizontal:
de: Waagerecht:

source: Set the space in centimeters between two points on an horizontal line on the grid. Default is 0.5 centimeter.
de: Einstellung des waagerechten Abstandes zwischen Linien des Gitters. Standard ist 0,5 cm.

source: Vertical:
de: Senkrecht:

source: Set the space in centimeters between two points on a vertical line on the grid. Default is 0.5 centimeter.
de: Einstellung des senkrechten Abstandes zwischen Linien des Gitters. Standard ist 0,5 cm.

source: <title>Document</title>
de: <title>Dokument</title>

source: <screeninfo>Document</screeninfo>
de: <screeninfo>Dokument</screeninfo>

source: <phrase>Document</phrase>
de: <phrase>Dokument</phrase>

source: Document Settings
de: Dokument-Einstellungen

source: Autosave interval:
de: Intervall für automatisches Speichern:

source: You can use this to adjust how often &stage; saves a temporary file. If you set this value to <guilabel>No autosave</guilabel>, &stage; will not autosave. You can adjust the autosave from 1 minute to 60 minutes.
de: Stellen Sie hier die Zeit für die automatische Sicherung ein. Mit <guilabel>Keine automatische Sicherung</guilabel> schalten Sie die Sicherung aus. Sie können hier einen Zeitraum von 1 bis 60 Minuten eingeben.

source: Create backup file:
de: Sicherungsdatei erstellen:

source: If checked, this will create a <filename>.&lt;name&gt;.odp.autosave.odp</filename> in the folder where your file is. This backup file can then be used in case of a problem. The backup file is updated everytime you save your document or everytime there is an autosave.
de: Ist diese Einstellung aktiviert, wird eine Sicherungsdatei <filename>.&lt;name&gt;.odp.autosave.odp</filename> im Ordner der geöffneten Datei angelegt. Diese Sicherungsdatei können Sie bei Problemen mit dem Original verwenden. Die Sicherungsdatei wird jedesmal neu geschrieben, wenn Sie Ihr Dokument speichern oder wenn eine automatische Sicherung ausgeführt wird.

source: <title>Author</title>
de: <title>Autor</title>

source: <screeninfo>Author</screeninfo>
de: <screeninfo>Autor</screeninfo>

source: Choose an author profile for your document.
de: Wählen Sie aus dem Auswahlfeld eine Autorprofil für Ihr Dokument.

source: You can add a new profile or delete the current profile using the buttons to the right of the profiles drop-down list.
de: Um neue Profile hinzuzufügen oder vorhandene zu löschen, benutzen Sie die Knöpfe rechts neben dem Auswahlfeld mit den Autorprofilen.
