Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdeadmin/kcron.po
Languages: de

source: Task Scheduler
de: Auftragsplaner

source: Developer
de: Entwicklung

source: Reviewer
de: Korrektur

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Robert</firstname><surname>Schröter</surname><affiliation><address><email>robert-schroeter@gmx.de</email></address></affiliation><contrib>Übersetzung der Dokumentation</contrib></othercredit>

source: Introduction
de: Einleitung

source: This is a module for scheduling programs to run in the background. It is a graphical user interface to <command>cron</command>, the &UNIX; system scheduler.
de: Dies ist ein Modul um für andere Programme einen Zeitplan zur Ausführung im Hintergrund festzulegen. Es ist eine grafische Benutzeroberfläche für das &UNIX;-Systemprogramm <command>cron</command>.

source: Don't forget to tell your system to start the <filename>crond</filename> cron daemon first, or the settings in this module will not work.
de: Ihr System muss zuerst den cron-Dämon <filename>crond</filename> starten, sonst funktionieren die Einstellungen in diesem Modul nicht.

source: Start Up
de: Start des Moduls

source: When you start this module you will see a summarized view of existing scheduled tasks and associated environment variables. If you are running as the root user, you will see these items for all users on the computer as well as the system scheduled tasks.
de: Beim Start dieses Moduls wird eine Liste bereits geplanter Aufträge und dazugehöriger Umgebungsvariablen angezeigt. Wenn Sie dieses Modul mit Systemverwalterrechten benutzen, werden sowohl die geplanten Aufträge aller Benutzer des Systems wie auch die systeminternen Aufträge angezeigt.

source: <screeninfo>start up</screeninfo>
de: <screeninfo>Start des Moduls</screeninfo>

source: <phrase>start up</phrase>
de: <phrase>Start des Moduls</phrase>

source: Scheduled Tasks
de: Geplante Aufträge

source: Scheduled tasks appear under a <guilabel>Tasks</guilabel> list. For each scheduled task, the following items are displayed:
de: Die geplanten Aufträge erscheinen in einer Liste <guilabel>Aufträge</guilabel>. Für jeden Auftrag wird angezeigt:

source: Scheduling
de: Planung

source: In this column either "@reboot" for task schedules at boot or the crontab entry is displayed.
de: In dieser Spalte wird entweder „@reboot“ für Aufträge angezeigt, die beim Hochfahren des Rechners ausgeführt werden, oder die Einträge aus der Datei crontab.

source: Command
de: Befehl

source: Program file and parameters.
de: Programmname und Parameter.

source: Enabled or Disabled.
de: Aktiviert oder Deaktiviert.

source: Description
de: Beschreibung

source: A description for the task, such as its purpose.
de: Eine Beschreibung des Auftrags, wie zum Beispiel den Einsatzzweck.

source: Scheduling Details
de: Details zur Planung

source: Natural language description of scheduled task.
de: Ausführliche Beschreibung des geplanten Auftrags.

source: Environment Variables
de: Umgebungsvariablen

source: Environment variables appear in the <guilabel>Environment Variables</guilabel> list. For each environment variable, the following are displayed:
de: Umgebungsvariablen erscheinen in der Liste <guilabel>Umgebungsvariablen</guilabel>. Für jede Variable wird folgendes angezeigt:

source: Variable name.
de: Name der Variablen.

source: Value
de: Wert

source: Variable value.
de: Wert der Variablen.

source: Comment
de: Kommentar

source: Natural language description of variable.
de: Beschreibung der Variablen.

source: Environment variables appearing here will override any existing environment variable for all scheduled tasks.
de: Die hier erscheinenden Umgebungsvariablen setzen die sonst bestehenden Umgebungsvariablen für alle aufgeführten Aufträge außer Kraft.

source: Adding Scheduled Tasks
de: Neue Aufträge hinzufügen

source: To create a new scheduled task, click the <guibutton>New Task...</guibutton> button. Alternatively, you can select this action from the <mousebutton>right</mousebutton> mouse button context menu.
de: Um eine neuen Auftrag hinzuzufügen, klicken Sie auf den Knopf <guibutton>Neuer Auftrag ...</guibutton> Diese Aktion kann auch aus dem Kontextmenü gewählt werden, das durch Klicken mit der <mousebutton>rechten</mousebutton> Maustaste aufgerufen wird.

source: The Edit Task Dialog
de: Der Dialog Neuer Auftrag

source: <guilabel>Edit Task</guilabel> dialog.
de: Der Dialog<guilabel>Neuer Auftrag</guilabel>.

source: <guilabel>Edit Task</guilabel> dialog
de: Der Dialog<guilabel>Neuer Auftrag</guilabel>

source: Enter the name of the program. You can specify either a relative path or absolute path. If you want to look up the program, click <guiicon>Browse</guiicon> icon.
de: Geben Sie hier den Namen des zu startenden Programms ein. Sie können entweder einen relativen oder einen absoluten Pfadnamen angeben. Wenn Sie das Programm zuerst suchen möchten, drücken Sie das Symbol <guiicon>Dateiauswahl</guiicon>.

source: Enter a description of the task to schedule.
de: Hier können Sie eine Beschreibung des Auftrags eingeben.

source: Enable this task
de: Diesen Auftrag aktivieren

source: To enable or disable the task, select or de-select this button.
de: Um eine Auftrag zu aktivieren oder zu deaktivieren, klicken Sie auf dieses Ankreuzfeld.

source: Run at system bootup
de: Ausführen während des Systemstarts

source: Check this button to run the task at system bootup.
de: Aktivieren Sie diese Einstellung, um Aufträge beim Hochfahren des Rechners ausführen zu lassen.

source: Run every day
de: Jeden Tag ausführen

source: If you want to schedule the task to run daily, select this button.
de: Wenn der Auftrag jeden Tag ausgeführt werden soll, aktivieren Sie diese Einstellung.

source: Months
de: Monate

source: Select the months during which the task is to be scheduled.
de: Wählen Sie die Monate aus, in denen der Auftrag ausgeführt werden soll.

source: Days of Month
de: Tage

source: Select the days of the month on which the task is to be scheduled.
de: Wählen Sie die Tage im Monat aus, an denen der Auftrag ausgeführt werden soll.

source: Days of Week
de: Wochentage

source: Select the days of the week on which the task is to be scheduled.
de: Wählen Sie die Wochentage aus, an denen der Auftrag ausgeführt werden soll.

source: Hours
de: Stunden

source: Select the hours on which the task is to be scheduled.
de: Wählen Sie die Stunde(n), zu der der Auftrag ausgeführt werden soll.

source: Minutes
de: Minuten

source: Select the minute at which the task is to be scheduled. <command>cron</command> does not support scheduling tasks at smaller than one minute intervals.
de: Wählen Sie die Minute(n), zu der der Auftrag ausgeführt werden soll. Das Programm <command>cron</command> kann Aufträge nur im Mindestzeitabstand von einer Minute ausführen.

source: Completes the creation of this task.
de: Schließt Bearbeitung des Auftrag ab.

source: Cancel
de: Abbrechen

source: Cancels the creation of this task.
de: Bricht die Bearbeitung des Auftrags ab.

source: If you select both days of the month, and days of the week, the task will run when either condition is met. For instance, if you select the 1st and 15th, and select Sunday, the program will be run every 1st and 15th of the selected months (regardless of day of week) as well as every Sunday of the selected months (regardless of day of the month).
de: Wenn Sie sowohl Monatstag(e) als auch Wochentag(e) angeben, wird der Auftrag sowohl bei einem passenden Datum als auch an einem passenden Wochentag ausgeführt. Wenn Sie z. B. den 1. und 15. und Sonntag auswählen, wird das Programm am 1. und 15. der gewählten Monate unabhängig vom Wochentag ausgeführt, und außerdem an jedem Sonntag der Monate, egal, auf welches Datum sie fallen.

source: The scheduled task is not actually set up until the <filename>crontab</filename> has been saved.
de: Der Auftrag ist erst dann fertig aufgenommen, wenn die <filename>crontab</filename> gespeichert wurde.

source: Managing Scheduled Tasks
de: Aufträge verwalten

source: As with creating new tasks, changes to tasks will not actually be made until the <filename>crontab</filename> is saved.
de: Wie bei der Erstellung neuer Aufträge werden Änderungen erst dann aktiv, wenn die <filename>crontab</filename> gespeichert wurde.

source: Use the buttons at the right of the task list to modify, delete, print or run a selected task now. You reach all these actions from the context menu as well. Additionally the context menu provides actions to cut, copy and paste tasks.
de: Mit den Knöpfen rechts von der Auftragsliste können Aufträge bearbeitet, gelöscht, gedruckt oder sofort ausgeführt werden. Diese Aktionen finden Sie ebenfalls im Kontextmenü. Zusätzlich enthält dieses Menü noch Aktionen, um Aufträge auszuschneiden, zu kopieren und einzufügen.

source: Adding Environment Variables
de: Umgebungsvariablen hinzufügen

source: To create a new environment variable, click the <guibutton>New Variable...</guibutton> button.
de: Um eine neue Umgebungsvariable zu erstellen, klicken Sie auf den Knopf <guibutton>Neue Variable ...</guibutton>.

source: Alternatively, you can use the <mousebutton>right</mousebutton> mouse button menu to choose this action.
de: Alternativ dazu können Sie auch mit der <mousebutton>rechten</mousebutton> Maustaste auf den Auftrag klicken und diese Aktion auswählen.

source: The Edit Variable dialog
de: Der Dialog Neue Variable

source: <screeninfo><guilabel>Edit Variable</guilabel> dialog.</screeninfo>
de: <screeninfo>Der Dialog <guilabel>Neue Variable</guilabel></screeninfo>

source: <phrase><guilabel>Edit Variable</guilabel> dialog.</phrase>
de: <phrase>Der Dialog <guilabel>Neue Variable</guilabel></phrase>

source: Enter the environment variable name. You can use the drop down list box to select from the most common environment variables used by scheduled tasks. Those include:
de: Geben Sie den Namen der Variablen ein. Sie können auch eine aus der Liste der am häufigsten benutzten Umgebungsvariablen wählen; klicken Sie hierzu auf den Pfeil neben dem Feld für den Variablennamen. Dies sind:

source: To be used instead of the default user's home folder.
de: Ordner, der anstelle des normalen Persönlichen Orders des Benutzers verwendet werden soll.

source: To send email output to an email address other than the user's default email address.
de: Um E-Mails aus dem aufzurufenden Programm an eine andere als die normale Adresse zu schicken

source: To be used to search folders for program files.
de: Pfadliste, in der nach ausführbaren Programmen gesucht wird.

source: To be used instead of the user's default value.
de: Shell, die anstelle der normalen Shell benutzt wird

source: The location of dynamic libraries. This allows cron jobs to execute applications which have libraries they need to run installed outside the system library path.
de: Der Speicherort dynamischer Bibliotheken. Damit können geplante Aufträge ausgeführt werden, die Programme verwenden, deren Bibliotheken nicht im Systempfad installiert sind.

source: Enter the environment variable value.
de: Geben Sie hier den Wert der Variablen ein.

source: Enter a description for the environment variable, such as its purpose.
de: Geben Sie eine Beschreibung der Variablen ein, also wofür sie verwendet wird.

source: Enable this variable
de: Diese Variable aktivieren

source: To enable or disable the variable, select or de-select this button.
de: Um die Variable zu deaktivieren oder wieder zu aktivieren, klicken Sie auf diesen Knopf.

source: Completes the setting of this variable.
de: Beendet das Bearbeiten der Variablen.

source: Cancels the setting of this variable.
de: Bricht die Bearbeitung der Variablen ab.

source: The environment variable is not actually set up until the <filename>crontab</filename> has been saved.
de: Die Umgebungsvariable ist erst dann fertig aufgenommen, wenn die <filename>crontab</filename> gespeichert wurde.

source: Managing Environment Variables
de: Umgebungsvariablen verwalten

source: As with creating new variables, changes to variables will not actually be made until the <filename>crontab</filename> is saved.
de: Wie bei der Erstellung neuer Variablen werden Änderungen erst dann vorgenommen, wenn die <filename>crontab</filename> gespeichert wurde.

source: Use the buttons at the right of the variable list to modify or delete a selected variable. You reach all these actions from the context menu as well. Additionally the context menu provides actions to cut, copy and paste variables.
de: Mit den Knöpfen rechts von der Variablenliste können Variablen bearbeitet oder gelöscht werden Diese Aktionen finden Sie ebenfalls im Kontextmenü. Zusätzlich enthält dieses Menü noch Aktionen, um Variablen auszuschneiden, zu kopieren und einzufügen.
