Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdeadmin/ksystemlog.po
Languages: de

source: The &ksystemlog; Handbook
de: Das Handbuch zu &ksystemlog;

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Michael</firstname><surname>Mielewczik</surname><affiliation><address><email>Michael.MIelewczik@linux-technical.info</email></address></affiliation><contrib>Übersetzung</contrib></othercredit>

source: &ksystemlog; is a system log viewer tool for &kde;. This program is developed for beginner users who don't know how to find information about their system or where the log files are located. It is also designed for advanced users who want to quickly see problems occuring on their server.
de: &ksystemlog; ist ein &kde;-Betrachter für Systemprotokolle. Das Programm ist für unerfahrene Benutzer geeignet die nicht wissen, wo Sie Informationen über Ihr System erhalten können oder wo das System die verschiedenen Protokolldateien hinterlegt. Darüber hinaus ermöglicht &ksystemlog; erfahrenen Benutzern den schnellen Zugriff zum Beispiel auf Informationen über Probleme, die auf ihrem Server auftreten.

source: logs
de: Protokolldateien

source: security
de: Sicherheit

source: Using &ksystemlog;
de: &ksystemlog; verwenden

source: Introduction
de: Einführung

source: What is &ksystemlog; ?
de: Was ist &ksystemlog;?

source: &ksystemlog; is a system log viewer tool.
de: &ksystemlog; ist ein Betrachter für Systemprotokolle.

source: &ksystemlog; helps users understand what their machine does in the background. &ksystemlog; aims to simplify the reading of system log files. This program is developed for beginner users who don't know how to find information about their system or where the log files are located in their computer.
de: &ksystemlog; hilft Benutzern zu verstehen, was Ihr Rechner im Hintergrund macht. Die Aufgabe von &ksystemlog; ist eine vereinfachte Darstellung der Protokolldateien des eigenen Systems. Das Programm ist für unerfahrene Benutzer geeignet, die nicht wissen, wo Sie Informationen über Ihr System erhalten können oder wo das System die verschiedenen Protokolldateien hinterlegt.

source: But it is also designed for advanced users who want to quickly see problems occuring on their server. &ksystemlog; tries to provide some advanced features to allow sorting and reading logs from specifical programs.
de: Darüber hinaus ermöglicht &ksystemlog; erfahrenen Benutzern den schnellen Zugriff zum Beispiel auf Informationen über Probleme, die auf ihrem Server auftreten. &ksystemlog; versucht daher einige erweiterte Funktionen bereitzustellen, mit deren Hilfe die Protokolldateien bestimmter Programme gefiltert und ausgewertet werden können.

source: <screeninfo>&ksystemlog; main screen</screeninfo>
de: <screeninfo>Hauptfenster von &ksystemlog;</screeninfo>

source: <phrase>&ksystemlog; main screen</phrase>
de: <phrase>Hauptfenster von &ksystemlog;</phrase>

source: Features
de: Funktionen

source: In its current version, &ksystemlog; 0.4 has quite a number of helpful features, such as:
de: In der aktuellen Version 0.4 besitzt &ksystemlog; eine Reihe von nützlichen Funktionen. Dazu gehören unter anderem:

source: Support for many different log files type, with the support of Syslog server formating, Samba
de: Unterstützung für viele verschiedene Arten von Protokolldateien, für das Format des Syslog-Servers und für Samba

source: Tabbed view to display several logs at the same time
de: Anzeige verschiedener Protokolldateien in einzelnen Unterfenstern.

source: Reading one log mode from multiple sources
de: Lesen einer Protokolldatei aus mehreren Quellen

source: Auto-display of newly logged lines in bold
de: Neue Zeilen im Protokoll werden automatisch fettgedruckt angezeigt

source: Group by different criteria (log level, log file, process, hour, ...)
de: Gruppierung nach verschiedenen Kriterien (Protokollstufe, Protokolldatei, Prozess, Zeit, ...)

source: Detailed information for each log lines
de: Ausführliche Informationen zu jeder Protokoll-Zeile

source: Adding a log entry manually
de: Manuelles Hinzufügen von Protokoll-Einträgen

source: It supports the following log files from your system :
de: &ksystemlog; kann folgende Protokolldateien auf Ihrem System überwachen:

source: Syslog logs (system messages)
de: Syslog-Protokolle (Systemmeldungen)

source: X.org logs
de: X.org-Protokolle

source: Kernel logs
de: Kernel-Protokolle

source: Authentication logs
de: Authentifizierungs-Protokolle

source: ACPID logs
de: ACPID-Protokolle

source: Cups logs
de: CUPS-Protokolle

source: Postfix logs
de: Postfix-Protokolle

source: Apache logs
de: Apache-Protokolle

source: Samba logs
de: Samba-Protokolle

source: Daemons logs
de: Dienste-Protokolle

source: Cron logs
de: Cron-Protokolle

source: XSessions logs
de: XSession-Protokolle

source: Many other features are included and will be discussed in the appropriate chapters of this manual.
de: Viele andere Funktionen sind darüber hinaus ebenfalls enthalten und werden in den weiteren Kapiteln dieses Handbuchs erläutert.

source: Reading logs with &ksystemlog;
de: Protokolldateien mit &ksystemlog; lesen

source: As you will see in the following screenshots, &ksystemlog; provides features to easily sort and filter log lines. We are now going to describe them in the next parts of this documentation.
de: Wie Sie in den folgenden Bildschirmfoto sehen, stellt &ksystemlog; Funktionen zur Verfügung, mit deren Hilfe sich die einzelnen Protokoll-Zeilen einer Protokolldatei leicht filtern und sortieren lassen. Die einzelnen Möglichkeiten zum Sortieren und Filtern werden im nächsten Kapitel dieses Handbuchs gezeigt.

source: Getting started
de: Erste Schritte

source: When you start &ksystemlog;, by default it tries to open the most useful log, the <guilabel>System Log</guilabel>. If it does not display it and pops up a message box, you probably forgot to launch &ksystemlog; as an administrator user (commonly named root). The log files are usually available in the /var/log folder, which is often protected against normal users. In the settings dialog you can select another log to open at startup.
de: Nach dem Start versucht &ksystemlog; in der Voreinstellung zunächst die wichtigste Protokolldatei des Systems - das <guilabel>Systemprotokoll</guilabel> - zu öffnen. Wird Ihnen diese nicht angezeigt, und es öffnet sich stattdessen ein kleines Nachrichtenfenster, so haben Sie &ksystemlog; sehr wahrscheinlich nicht mit Systemverwalterrechten gestartet. Die Protokolldateien finden sich unter Linux normalerweise im Ordner /var/log, für den normale Benutzer üblicherweise keine Berechtigung zum Lesen besitzen. Im Einrichtungsdialog können Sie eine andere Protokolldatei einstellen, die beim Programmstart geöffnet werden soll.

source: <screeninfo>&ksystemlog; first launch</screeninfo>
de: <screeninfo>Erster Start von &ksystemlog;</screeninfo>

source: <phrase>&ksystemlog; first launch</phrase>
de: <phrase>Erster Start von &ksystemlog;</phrase>

source: Reading log files easily
de: Einfaches Lesen von Protokolldateien

source: Sorting log lines
de: Sortierung von Protokollzeilen

source: Every log lines are displayed in a list view, which can be sorted by clicking on the wanted column. Another click will sort it in the other order. If you want to sort the list as it was on the first loading, you can use the <menuchoice><guimenu>Edit</guimenu><guimenuitem>Reload</guimenuitem></menuchoice> menu item, or simply click on the first column of the list, generally named <guilabel>Date</guilabel>, to sort the list in the ascending order. Even if your log mode does not use time to describe each log lines, for example the <guilabel>X.org Log</guilabel>, the list will be correctly sorted, because &ksystemlog; keeps an internal order of the list.
de: Jede Zeile einer Protokolldatei wird in einer Listenansicht dargestellt. Die Einträge können durch Klicken auf den Titel der Spalte sortiert werden Durch einen erneuten Klick auf den Titel der Spalte kann zwischen absteigender und aufsteigender Sortierung gewechselt werden. Möchten Sie zur ursprünglichen Sortierung zurückkehren, welche beim Öffnen der Protokoll-Datei genutzt wurde, wählen Sie im Menü <menuchoice><guimenu>Bearbeiten</guimenu><guimenuitem>Erneut laden</guimenuitem></menuchoice>. Alternativ dazu können Sie auch auf den Titel der ersten Spalte in der Liste klicken, der normalerweise mit <guilabel>Datum</guilabel> beschriftet ist. Die Sortierung erfolgt dann in aufsteigender Reihenfolge. Auch wenn Ihr Protokollierungs-Modus keine Zeitangaben für jede Protokoll-Zeile verwendet, wie beispielsweise beim <guilabel>X.org-Protokoll</guilabel>, erfolgt die Sortierung in korrekter Form, da &ksystemlog; die interne Reihenfolge beibehält.

source: Filtering log lines
de: Filtern von Protokollzeilen

source: <screeninfo>Filtering on a specific process</screeninfo>
de: <screeninfo>Filtern eines ausgewählten Prozesses</screeninfo>

source: <phrase>Filtering on a specific process</phrase>
de: <phrase>Filtern eines ausgewählten Prozesses</phrase>

source: You can also use the filter bar to filter according to the selected criteria and the typed string. Simply type something in the filter, and the list will automatically be modified to only display lines which match your filter string. By default, the combo box next to the filter selects <guilabel>All</guilabel>, which means that a line will be displayed only if one of its columns contains the filter string.
de: Sie können auch die Filterleiste verwenden, um nach einem ausgewähltem Kriterium oder nach eingegebenen Zeichenketten zu filtern. Geben Sie dazu eine Zeichenkette in die Filterleiste ein. Die Liste der Protokollzeilen wird nun automatisch verändert, sodass nur noch Protokollzeilen angezeigt werden, die zum ausgewählten Filter passen. In der Standardeinstellung enthält das Auswahlfeld neben dem Filter den Eintrag <guilabel>Alle</guilabel>. Dann wird eine Protokoll-Zeile nur angezeigt wird, wenn in einer der Spalten die Zeichenkette des Filter-Suchbegriffs enthalten ist.

source: You can select another field to filter only this column of the list. For example, in the <guilabel>System Log</guilabel>, by selecting the <guilabel>Process</guilabel> column, and writing a process name in the filter bar, &ksystemlog; will display every log lines sent by this process.
de: Sie können an dieser Stelle natürlich auch einen anderen Eintrag auswählen. Die Zeichenkette des Filter-Suchbegriffs wird dann nur mit den Einträgen in der entsprechend ausgewählten Spalte abgeglichen. Wählen Sie zum Beispiel in der Protokolldatei <guilabel>Systemprotokoll</guilabel> die Spalte <guilabel>Prozess</guilabel> aus, und tragen Sie darüber hinaus in der Filterleiste den Namen eines Prozesses ein, so zeigt Ihnen &ksystemlog; alle Protokoll-Zeilen an, welche von diesem Prozess gesendet bzw. erstellt wurden.

source: Other features
de: Andere Funktionen

source: Colorizing log lines
de: Farbige Darstellung von Protokollzeilen

source: This option is activated by default and helps you see which lines have a higher level than the others. For example, <guilabel>Error</guilabel> level will be highlighted in a different color than the <guilabel>Notice</guilabel> one. This feature can be disabled in the configuration dialog.
de: Diese Option ist in der Standardeinstellung aktiviert und hilft Ihnen, die wichtigen Protokoll-Zeilen zu erkennen. Protokoll-Zeilen der Stufe <guilabel>Fehler</guilabel> werden mit einer auffälligeren Farbe als Protokoll-Zeilen der Stufe <guilabel>Hinweis</guilabel> angezeigt. Die farbige Darstellung von Protokoll-Zeilen kann Einrichtungsdialog abgeschaltet werden.

source: Hiding the process identifier
de: Prozessidentifizierung ausblenden

source: If you are only interested in a specific process (for example in the <guilabel>System Log</guilabel> or the <guilabel>Cron Log</guilabel>), you can hide its PID in the <guilabel>Process</guilabel> column. This can be useful if you are trying to analyze the output of a specific command, like a Samba server. In this case, please use the <link linkend="filtering">Filter Bar</link>.
de: Möchten Sie nur bestimmte Prozess anzeigen (beispielsweise im <guilabel>Systemprotokoll</guilabel> oder im <guilabel>Cron-Protokoll</guilabel>), so können Sie die Prozess-Identifikation (PID) in der Spalte <guilabel>Prozess</guilabel> ausblenden. Das kann zum Beispiel dann nützlich sein, wenn Sie die Ausgabe eines bestimmten Befehls wie zum Beispiel zum Start des Samba-Servers untersuchen möchten. In diesem Fall benutzen Sie <link linkend="filtering">Filterleiste</link>.

source: Monitoring Management
de: Überwachung verwalten

source: &ksystemlog; provides an easy way to control the reading and the monitoring of log files. Indeed, sometimes you only need to analyze some existing log lines. In this case, you cannot tolerate the appearance of a new line. You can deactivate the monitoring of log files by clicking on the <guibutton>Stop</guibutton> button. This stops the opened log files from being updated while still letting them get filled by other processes. Of course, you can reactivate the monitoring by clicking on <guibutton>Resume</guibutton>, which will display the log lines added since the last pause.
de: &ksystemlog; stellt Ihnen eine einfache Möglichkeit zum Lesen und Überwachen Ihrer Protokolldateien zur Verfügung. Natürlich ist es in einigen Fällen lediglich nötig, bereits vorhandene Zeilen vorhandener Protokolldateien zu analysieren. In diesem Fall nützt es Ihnen nichts, wenn neu hinzukommende Zeilen in den Protokolldateien ebenfalls angezeigt werden. &ksystemlog; gibt Ihnen daher die Möglichkeit, die Überwachung von Protokolldateien zu deaktivieren. Klicken Sie dazu auf den Knopf <guibutton>Anhalten</guibutton> in der Werkzeugleiste. Durch diese Einstellung werden alle geöffneten Protokolldateien geschlossen, die Protokolldateien selbst jedoch werden weiter von anderen Prozessen gefüllt, ohne dass Sie diese Änderungen jedoch auslesen. Natürlich können Sie die Überwachung auch wieder aktivieren. Klicken Sie dazu auf den Knopf <guibutton>Erneut laden</guibutton>, so werden Ihnen auch neue Protokoll-Zeilen angezeigt.

source: Furthermore, to focus on the newly appeared log lines, you can toggle the <guimenuitem>Scroll to New Lines</guimenuitem> option.
de: Darüber hinaus können Sie die Option <guimenuitem>Zu neuen Zeilen springen</guimenuitem> im Kontextmenü des Hauptfensters aktivieren, um sich alle neuen hinzukommenden Protokoll-Zeilen anzeigen zu lassen.

source: Management of several opened tabs
de: Verwaltung mehrerer geöffneter Unterfenster

source: &ksystemlog; allows you to open several log modes by opening multiple tabs. For this, simply use the <guimenu>Window</guimenu> menu to manage and open new tabs. Once you have selected the right tab, simply choose the desired log mode using the dedicated menu.
de: &ksystemlog; ermöglicht die Anzeige mehrerer Protokolldateien in getrennten Unterfenstern. Um diese Funktion zu nutzen, verwenden Sie die Einträge im Menü <guimenu>Fenster</guimenu> um zusätzliche Unterfenster zu öffnen und zu verwalten. Sobald Sie ein Unterfenster ausgewählt haben, wählen Sie im Menü ein Protokoll zur Anzeige aus.

source: Credits and License
de: Danksagungen und Lizenz

source: &ksystemlog;, Copyright 2008 by Nicolas Ternisien
de: &ksystemlog;, Copyright 2008 Nicolas Ternisien

source: Contributors:
de: Mitwirkende:

source: Patrick Dreker : Ideas, Code Improvements.
de: Patrick Dreker : Ideen und Programmcode-Verbesserungen.

source: Bojan : SSH Log mode, Printing.
de: Bojan : SSH-Protokollmodus, Drucken.

source: Special thanks to all translators of &ksystemlog;.
de: Besonderer Dank an alle Übersetzer von &ksystemlog;.

source: CREDIT_FOR_TRANSLATORS
de: <para>Übersetzung Michael Mielewczik<email>Michael.MIelewczik@linux-technical.info</email></para>

source: How to obtain and install &ksystemlog;
de: Bezugsquellen und Installation von &ksystemlog;

source: &ksystemlog; has its own home page <ulink url="http://ksystemlog.forum-software.org">http://ksystemlog.forum-software.org</ulink>. Please refer to the instructions on the home page since they will contain up-to-date information about how to obtain &ksystemlog;.
de: &ksystemlog; hat eine eigene Webseite auf <ulink url="http://ksystemlog.forum-software.org">http://ksystemlog.forum-software.org</ulink>. Dort finden Sie weitere aktuelle Informationen über die Bezugsquellen von &ksystemlog;.

source: &ksystemlog; can also be found in the following folder of the &kde; Git Repository : <ulink url="https://projects.kde.org/projects/kde/kdeadmin/ksystemlog">&ksystemlog; in the &kde; repository</ulink>
de: &ksystemlog; finden Sie außerdem in folgendem Ordner des &kde;-Git-Archivs: <ulink url="https://projects.kde.org/projects/kde/kdeadmin/ksystemlog">&ksystemlog; im &kde;-Archiv</ulink>
