Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdeadmin/kuser.po
Languages: de

source: The &kuser; Handbook
de: Das Handbuch zu &kuser;

source: Reviewer
de: Korrektur

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Frank</firstname><surname>Schütte</surname><affiliation><address><email>f.schuette@t-online.de</email></address></affiliation><contrib>Deutsche Übersetzung</contrib></othercredit>

source: This documentation describes &kuser; version 3.9. This program allows you to manage users and groups on your system.
de: Diese Dokumentation bezieht sich auf &kuser; 3.9. Mit diesem Programm können Sie die Benutzer und Gruppen Ihres Systems verwalten.

source: kuser
de: Benutzerverwaltung

source: user
de: Benutzer

source: management
de: Verwaltung

source: admin
de: Verwalter

source: tools
de: Dienstprogramm

source: group
de: Gruppe

source: password
de: Passwort

source: Getting Started
de: Erste Schritte

source: &kuser; allows you to manage users and groups on your system.
de: Mit &kuser; können Sie die Benutzer und Gruppen Ihres Systems verwalten.

source: This is a short introduction to &kuser;. For more detailed information, see <link linkend="using">Usage</link>.
de: Dies ist eine kurze Einführung zu &kuser;. Umfangreichere Informationen finden Sie unter <link linkend="using">Benutzung</link>.

source: Actually, you do not need to do anything to begin using &kuser; except <link linkend="customizing">configuration</link>.
de: Um mit &kuser; zu beginnen, ist es ausreichend, das Kapitel <link linkend="customizing">Anpassung von &kuser;</link> zu lesen.

source: If you do not launch &kuser; in administrator mode, you will get a warning, that the file <filename>/etc/shadow</filename> is not readable.
de: Wird &kuser; nicht mit Systemverwalterrechten gestartet, erscheint eine Warnung, dass die Datei <filename>/etc/shadow</filename> nicht zum Lesen geöffnet werden kann.

source: Usage
de: Benutzung

source: Main Window
de: Hauptfenster

source: &kuser; is a very simple application. In the main window you can see two tabs: the list of users and the list of groups. To edit a user or a group, just click on it. The user or group properties dialog will appear.
de: &kuser; ist eine einfache Anwendung. Das Hauptfenster besteht aus zwei Karteikarten, der Benutzer- und der Benutzergruppenliste. Zum Bearbeiten wählen Sie den gewünschten Benutzer oder die gewünschte Gruppe mit einem Doppelklick auf den Eintrag aus. Es erscheint der Dialog Benutzer- bzw. Gruppeneigenschaften.

source: <screeninfo>&kuser; Main Window</screeninfo>
de: <screeninfo>&kuser;-Hauptfenster</screeninfo>

source: <phrase>&kuser; Main Window</phrase>
de: <phrase>&kuser;-Hauptfenster</phrase>

source: User and Group Properties
de: Eigenschaften von Benutzern und Gruppen

source: User Properties Dialog
de: Der Dialog Benutzereigenschaften

source: The user properties dialog has two tabs.
de: Der Dialog <guilabel>Benutzereigenschaften</guilabel> besteht aus zwei Karteikarten.

source: User Info Tab
de: Benutzerinformation

source: In the <guilabel>User Info</guilabel> tab you can modify:
de: Auf der Karteikarte <guilabel>Benutzerinformation</guilabel> können Sie folgende Einstellungen bearbeiten:

source: <guilabel>User login</guilabel> with the user name and a <guibutton>Set Password</guibutton> button for this account,
de: <guilabel>Benutzeranmeldung</guilabel> mit dem Benutzernamen und einen Knopf <guibutton>Passwort setzen</guibutton> für diesen Zugang.

source: User Id
de: Benutzer-ID

source: Full Name
de: Vollständiger Name

source: <guilabel>Login Shell</guilabel> (the list of login shells is taken from the <filename>/etc/shells</filename> file)
de: <guilabel>Anmelde-Shell</guilabel> (die Liste der möglichen Einträge stammt aus der Datei <filename>/etc/shells</filename>)

source: Home Folder
de: Persönlicher Ordner

source: Two office locations
de: Zwei Büroorte

source: Address
de: Adresse

source: Account disabled
de: Zugang deaktiviert

source: Password Management Tab
de: Karteikarte Passwortverwaltung

source: The <guilabel>Password Management</guilabel> tab will appear in administrator mode if you have shadow passwords, or any other similar things such as <filename>/etc/master.passwd</filename> in <acronym>BSD</acronym> flavor Unices.
de: Die Karteikarte <guilabel>Passwortverwaltung</guilabel> erscheint nur, wenn das Programm als Systemverwalter aufgerufen wurde und <foreignphrase lang="en">Shadow</foreignphrase>-Passwörter oder beispielsweise <filename>/etc/master.passwd</filename> wie in <acronym>BSD</acronym>-Unixsystemen verwendet werden.

source: Minimum number of days between password changes
de: Minimale Anzahl Tage zwischen Passwort-Änderungen

source: Number of days after which a password expires if it hasn't been changed
de: Anzahl der Tage, nach denen ein Passwort ungültig wird, falls es nicht geändert wird

source: Number of days before expiration the user will be warned
de: Anzahl der Tage der Warnung vor dem Ungültig werden

source: Whether and when an account will be disabled if the password expires
de: Wann und unter welchen Umständen ein Zugang bei ungültigem Passwort deaktiviert wird

source: A set date when the account expires
de: Ein festes Datum, an dem der Zugang ungültig wird

source: <guilabel>Class</guilabel> (on <acronym>BSD</acronym> systems)
de: <guilabel>Klasse</guilabel> (bei <acronym>BSD</acronym>-Systemen)

source: The date of the last password change is displayed near the top of the dialog.
de: Das Datum der letzten Passwortänderung wird oben im Dialog angezeigt.

source: Groups Tab
de: Die Karteikarte Gruppen

source: The <guilabel>Groups</guilabel> tab contains all the information about the selected user's participation in groups. The primary group to which the user belongs is set with the <guilabel>Set as Primary</guilabel> button. The user can be assigned to additional groups by checking them in the large box.
de: Die Karteikarte <guilabel>Gruppen</guilabel> informiert über die Gruppenzugehörigkeiten des ausgewählten Benutzers. Die Standardgruppe, zu der der Benutzer gehört, kann mit dem Knopf <guilabel>Als primär setzen</guilabel> geändert werden. Weiterhin kann der Benutzer in anderen Gruppen Mitglied werden, indem Sie diese im großen Feld markieren.

source: Group Properties
de: Eigenschaften der Gruppe

source: The <guilabel>Group Properties</guilabel> dialog contains a list of all users in the selected group on the left and a list of all other users.
de: Der Dialog <guilabel>Eigenschaften der Gruppe</guilabel> enthält eine Liste aller Benutzer in der ausgewählten Gruppe in der linken Liste und rechts eine Liste aller anderen Benutzer.

source: Select a user in one of both lists and use the <guibutton>Add</guibutton> and <guibutton>Remove</guibutton> buttons to manage members of the group.
de: Wählen Sie einen Benutzer in einer der beiden Listen und benutzen Sie die Knöpfe <guibutton>Hinzufügen</guibutton> und <guibutton>Entfernen</guibutton>, um die Mitglieder einer Gruppe zu verwalten.

source: Managing Users or Groups
de: Benutzer oder Gruppen verwalten

source: To add a user or group to the system, either choose <guimenuitem>Add</guimenuitem> from the <guimenu>User</guimenu> or <guimenu>Group</guimenu> menu, or click the relevant <guiicon>Add</guiicon> button on the toolbar.
de: Um einen Benutzer oder eine Gruppe hinzuzufügen, wählen Sie <guimenuitem>Hinzufügen</guimenuitem> aus dem Menü <guimenu>Benutzer</guimenu> oder <guimenu>Gruppe</guimenu> oder klicken Sie auf den passenden <guiicon>Hinzufügen</guiicon>-Knopf der Werkzeugleiste.

source: A selected user or group can also be edited or deleted in the same way.
de: Das Bearbeiten oder Löschen des ausgewählten Benutzer bzw. der ausgewählten Gruppe funktioniert genauso.

source: Customizing &kuser;
de: Anpassung von &kuser;

source: Edit user creation defaults
de: Standardeinstellungen für neue Benutzer

source: To edit the user creation defaults you can use the <guilabel>Connection</guilabel> tab on the <guilabel>General</guilabel> page of &kuser;'s configuration dialog, which is accessible via the menu <menuchoice><guimenu>Settings</guimenu> <guimenuitem>Configure &kuser;</guimenuitem></menuchoice>.
de: Zum Verändern der Standardeinstellungen für neue Benutzer öffnen Sie die Karteikarte <guilabel>Anbindung</guilabel> auf der Seite <guilabel>Allgemein</guilabel> im Einstellungsdialog von &kuser;, indem Sie im Menü <menuchoice><guimenu>Einstellungen</guimenu> <guimenuitem>&kuser; einrichten</guimenuitem></menuchoice> auswählen.

source: There you may change the defaults that are used when creating a new user: Shell and Home Folder (or home folders volume). You can choose whether to make a home folder on <quote>create</quote> or not, and to copy a skeleton (standard configuration files) to the home folder or not. You can also enable <guilabel>User private group</guilabel> mechanism, which creates a new personal group with the creation of a new user, and removes the personal group when the user is removed.
de: In diesem Dialog können Sie die Standardeinstellungen ändern, mit denen ein neuer Benutzer erstellt wird: Shell, der Persönliche Ordner (oder das Dateisystem für die Persönlichen Ordner). Außerdem können Sie auswählen, ob ein Persönlicher Ordner bei der Erstellung des Benutzers angelegt wird und ob Vorlagen (Standardkonfigurationsdateien) in den Persönlichen Ordner kopiert werden. Die Einstellung <guilabel>Private Gruppe für Benutzer</guilabel> erstellt eine eigene Benutzergruppe für jeden neu angelegten Benutzer, die bei der Entfernung des Benutzers wieder gelöscht wird.

source: Credits and License
de: Danksagungen und Lizenz

source: Program copyright 1997-2000 Denis Pershin <email>dyp@inetlab.com</email>
de: Programm-Copyright 1997-2000 Denis Pershin <email>dyp@inetlab.com</email>

source: Documentation copyright 1997-2000 Denis Pershin <email>dyp@inetlab.com</email>
de: Dokumentation-Copyright 1997-2000 Denis Pershin <email>dyp@inetlab.com</email>

source: Documentation copyright 2000 &Matt.Johnston; &Matt.Johnston.mail;
de: Dokumentation Copyright 2000 &Matt.Johnston;&Matt.Johnston.mail;

source: CREDIT_FOR_TRANSLATORS
de: <para>Deutsche Übersetzung Frank Schütte <email>F.Schuette@t-online.de</email></para>
