Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kde-runtime/fundamentals_ui.po
Languages: de

source: The <keysym>Meta</keysym> key described below is a generic name for the custom key found on many different keyboards. On keyboards designed for &Microsoft; &Windows;, this key is usually called the <keysym>Windows</keysym> key, and will have a picture of the &Windows; logo. On keyboards designed for &Mac; computers, this key is known as the <keysym>Command</keysym> key and will have a picture of the <trademark class="registered">Apple</trademark> logo and/or the <keycap>⌘</keycap> symbol. On keyboards designed for &UNIX; systems, this key is really known as the <keysym>Meta</keysym> key and is typically labeled with a diamond: <keycap>◆</keycap>.
de: Die im folgenden <keysym>Meta</keysym>-Taste ist ein allgemeiner Name für die Betriebssystem spezifische Taste, die auf vielen Tastaturen vorhanden ist. Auf Tastaturen für &Microsoft; &Windows;, heißt diese Taste üblicherweise <keysym>Windows</keysym>-Taste und ist dem &Windows;-Logo beschriftet. Auf Tastaturen für &Mac;-Rechner hat diese Taste die Bezeichnung <keysym>Befehls</keysym>taste un zeigt das <trademark class="registered">Apple</trademark>-Logo und bzw. oder das Symbol <keycap>⌘</keycap>. Auf Tastaturen für &UNIX;-Systeme wird diese Taste tatsächlich <keysym>Meta</keysym> genannt und hat als Symbol eine Raute:<keycap>◆</keycap>.

source: Working with Windows
de: Arbeiten mit Fenstern

source: These shortcuts allow you to perform all kinds of operations with windows, whether it be opening, closing, moving, or switching between them.
de: Mit diesen Kurzbefehlen können Sie alle möglichen Aktionen mit Fenster ausführen, wie zum Beispiel Öffnen, Schließen, Verschieben oder zwischen ihnen wechseln.

source: Starting and Stopping Applications
de: Anwendungen starten und beenden

source: These shortcuts make it easy to start and stop programs.
de: Mit diesen Kurzbefehlen können Sie schnell Anwendungen starten und beenden.

source: Shortcut
de: Kurzbefehl

source: Quit
de: Beenden

source: System Activity
de: Systemüberwachung

source: Force Quit
de: Beenden erzwingen

source: Run Command Interface
de: Oberfläche zur Ausführung von Befehlen

source: Close
de: Schließen

source: Moving Around
de: Navigation

source: These shortcuts allow you to navigate between windows, activities, and desktops efficiently.
de: Mit diesen Kurzbefehlen können Sie effizient zwischen Fenstern, Aktivitäten und der Arbeitsfläche navigieren.

source: Present Windows
de: Fenster zeigen

source: Present Windows on current desktop
de: Fenster der aktuellen Arbeitsfläche anzeigen

source: Present Windows of current application only
de: Nur Fenster der aktuellen Anwendung anzeigen

source: Desktop Cube
de: Arbeitsflächen-Würfel

source: Show Dashboard
de: Dashboard anzeigen

source: Activate Window Demanding Attention
de: Fenster aktivieren, das Aufmerksamkeit erfordert

source: Walk through windows
de: Zwischen Fenstern wechseln

source: Walk through windows of the current application
de: Zwischen Fenstern der aktuellen Anwendung wechseln

source: Open the Window Operations menu
de: Öffnet das Fensteraktionen-Menü

source: &Meta;&Alt;<keysym>Up</keysym>
de: &Meta;&Alt;<keysym>Pfeil aufwärts</keysym>

source: Switch to Window Above
de: Zum Fenster darüber wechseln

source: &Meta;&Alt;<keysym>Down</keysym>
de: &Meta;&Alt;<keysym>Pfeil abwärts</keysym>

source: Switch to Window Below
de: Zum Fenster darunter wechseln

source: &Meta;&Alt;<keysym>Left</keysym>
de: &Meta;&Alt;<keysym>Pfeil links</keysym>

source: Switch to Window to the Left
de: Zum Fenster links wechseln

source: &Meta;&Alt;<keysym>Right</keysym>
de: &Meta;&Alt;<keysym>Pfeil rechts</keysym>

source: Switch to Window to the Right
de: Zum Fenster rechts wechseln

source: Panning and Zooming
de: Verschieben und Vergrößern

source: Need to get a closer look? The &plasma-workspaces; allow you to zoom in and out and move your entire desktop around, so you can zoom in even when the application you are using doesn't support it.
de: Möchten Sie genauer hinschauen? Der &plasma-workspaces; ermöglicht es Ihnen, die ANsicht zu vergrößern oder zu verkleinern und Ihre gesamten Arbeitsfläche zu verschieben. Sie können die Ansicht sogar vergrößern, wenn die Anwendung, die Sie benutzen, dies nicht unterstützt.

source: Zoom In
de: Vergrößern

source: Zoom Out
de: Verkleinern

source: Zoom Normal
de: Normale Größe

source: &Meta;<keysym>Up</keysym>
de: &Meta;<keysym>Pfeil aufwärts</keysym>

source: Pan Up
de: Nach oben schieben

source: &Meta;<keysym>Down</keysym>
de: &Meta;<keysym>Pfeil abwärts</keysym>

source: Pan Down
de: Nach unten schieben

source: &Meta;<keysym>Left</keysym>
de: &Meta;<keysym>Pfeil links</keysym>

source: Pan left
de: Nach links schieben

source: &Meta;<keysym>Right</keysym>
de: &Meta;<keysym>Pfeil rechts</keysym>

source: Pan Right
de: Nach rechts schieben

source: Working with Activities and Virtual Desktops
de: Arbeiten mit Aktivitäten und virtuelle Arbeitsflächen

source: These shortcuts allow you to switch between and manage <ulink url="help:/plasma-desktop/zooming-user-interface.html">Activities</ulink> and <ulink url="help:/kcontrol/desktop/">virtual desktops</ulink>.
de: Mit diesen Kurzbefehlen können Sie effizient zwischen <ulink url="help:/plasma-desktop/zooming-user-interface.html">Aktivitäten</ulink> und <ulink url="help:/kcontrol/desktop/">virtuellen Arbeitsflächen</ulink> wechseln und sie verwalten.

source: View all your Activities
de: Anzeige aller Aktivitäten

source: Next Activity
de: Nächste Aktivität

source: Previous Activity
de: Vorherige Aktivität

source: Remove this Activity
de: Diese Aktivität entfernen

source: Activities Settings
de: Aktivitäten einrichten

source: Switch to Desktop 1
de: Auf Arbeitsfläche 1 umschalten

source: Switch to Desktop 2
de: Auf Arbeitsfläche 2 umschalten

source: Switch to Desktop 3
de: Auf Arbeitsfläche 3 umschalten

source: Switch to Desktop 4
de: Auf Arbeitsfläche 4 umschalten

source: Working with the Desktop
de: Arbeiten mit der Arbeitsfläche

source: These shortcuts allow you to work with the &plasma-desktop; and panels.
de: Diese Kurzbefehle können Sie beim Umgang mit dem &plasma-desktop; und den Kontrollleisten benutzen.

source: Add Widgets
de: Miniprogramme hinzufügen

source: Remove Widgets
de: Miniprogramme entfernen

source: Lock/Unlock Widgets
de: Miniprogramme sperren/entsperren

source: Next Widget
de: Nächstes Miniprogramm

source: Previous Widget
de: Vorheriges Miniprogramm

source: Widget Settings
de: Miniprogramm-Einstellungen

source: Run the Associated Application
de: Die zugewiesene Anwendung starten

source: Enable/Disable Desktop Effects
de: Arbeitsflächeneffekte aktivieren bzw. aussetzen

source: Getting Help
de: Hilfe anfordern

source: Need some help? The manual for the current application is only a keypress away, and some programs even have additional help that explains the element in focus.
de: Sie brauchen Hilfe? Das Handbuch für die aktuelle Anwendung ist nur einen Tastendruck entfernt. Außerdem haben einige Anwendungen noch zusätzliche Hilfen zu dem geraden aktiven Element.

source: Help
de: Hilfe

source: What's This?
de: "Was ist das?"-Hilfe

source: Working with Documents
de: Arbeiten mit Dokumenten

source: Whether it's a text document, spreadsheet, or web site, these shortcuts make performing many kinds of tasks with them easy.
de: Ob Textdokument, Tabellenkalkulation oder Webseite, diese Kurzbefehle erleichtern das Ausführen vieler Aufgaben.

source: Refresh
de: Aktualisieren

source: Select All
de: Alles auswählen

source: Undo
de: Rückgängig

source: Redo
de: Wiederherstellen

source: <entry>Cut</entry>
de: <entry>Ausschneiden</entry>

source: Copy
de: Kopieren

source: Paste
de: Einfügen

source: <entry>New</entry>
de: <entry>Neu</entry>

source: Print
de: Drucken

source: Save
de: Speichern

source: Find
de: Suchen

source: Close Document/Tab
de: Dokument/Unterfenster schließen

source: Working with Files
de: Arbeiten mit Dateien

source: Whether your in an Open/Save dialog or the &dolphin; file manager, these shortcuts save you time when performing operations on files. Note that some of the concepts used with files are the same as with documents, so several of the shortcuts are identical to their counterparts listed above.
de: Ob im Dateidialog oder im Dateiverwaltungsprogramm Dolphin, mit diesen Kurzbefehlen können Sie Aktionen mit Dateien schnell ausführen. Beachten Sie, dass einige dieser mit Dateien verwendeten Kurzbefehle auch mit Dokumenten benutzt werden können, daher sind mehrere Kurzbefehle identisch mit den oben aufgeführten Entsprechungen für Dokumente.

source: Replace Location
de: Adresse ändern

source: Invert Selection
de: Auswahl umkehren

source: &Alt;<keycap>Left</keycap>
de: &Alt;<keycap>Pfeil links</keycap>

source: Back
de: Zurück

source: &Alt;<keycap>Right</keycap>
de: &Alt;<keycap>Pfeil rechts</keycap>

source: Forward
de: Vorwärts

source: &Alt;<keycap>Up</keycap>
de: &Alt;<keycap>Pfeil aufwärts</keycap>

source: Up (to folder that contains this one)
de: Nach oben zum übergeordneten Ordner

source: &Alt;<keycap>Home</keycap>
de: &Alt;<keycap>Pos1</keycap>

source: Home Folder
de: Persönlicher Ordner

source: Delete
de: Löschen

source: Move to Trash
de: In den Papierkorb werfen

source: &Shift;<keycap>Delete</keycap>
de: &Shift;<keycap>Entf</keycap>

source: Delete Permanently
de: Unwiderruflich löschen

source: Changing Volume and Brightness
de: Ändern von Lautstärke und Helligkeit

source: In addition to the standard keys, many computer keyboards and laptops nowadays have special keys or buttons to change the speaker volume, as well as the brightness of your monitor if applicable. If present, you can use these keys in the &plasma-workspaces; to perform those tasks.
de: Zusätzlich zu den Standardtasten haben viele Rechnertastaturen und Laptops heute besondere Tasten oder Knöpfe, um zum Beispiel die Lautstärke wie auch die Helligkeit des Bildschirms zu ändern. Hat Ihr Rechner solche speziellen Tasten, können Sie sie im &plasma-workspaces; für diese Aufgaben verwenden.

source: If you do not have such keys, see <xref linkend="kbd-modifying"/> for information on how to assign keys for these tasks.
de: Hat Ihre Tastatur solche Tasten nicht, lesen Sie bitte <xref linkend="kbd-modifying"/>, wie Tasten für diese Aufgaben zugewiesen werden können.

source: Leaving Your Computer
de: Arbeit am Rechner beenden

source: All done? Use these shortcuts and put your computer away!
de: Fertig mit der Arbeit? Verwenden Sie diese Kurzbefehle und stellen Sie Ihren Rechner weg.

source: &Ctrl;&Alt;<keycap>Insert</keycap>
de: &Ctrl;&Alt;<keycap>Einfg</keycap>

source: Switch User
de: Benutzer wechseln

source: Lock Session
de: Sitzung sperren

source: &Ctrl;&Alt;<keycap>Delete</keycap>
de: &Ctrl;&Alt;<keycap>Entf</keycap>

source: Logout
de: Abmelden

source: &Ctrl;&Alt;&Shift;<keycap>Delete</keycap>
de: &Ctrl;&Alt;&Shift;<keycap>Entf</keycap>

source: Logout without confirmation
de: Ohne Rückfrage abmelden

source: &Ctrl;&Alt;&Shift;<keycap>Page Down</keycap>
de: &Ctrl;&Alt;&Shift;<keycap>Bild ab</keycap>

source: Shut Down without confirmation
de: Ohne Rückfrage herunterfahren

source: &Ctrl;&Alt;&Shift;<keycap>Page Up</keycap>
de: &Ctrl;&Alt;&Shift;<keycap>Bild auf</keycap>

source: Reboot without confirmation
de: Ohne Rückfrage neu starten

source: Modifying Shortcuts
de: Kurzbefehle ändern

source: The shortcuts described in <link linkend="kbd-windows">Working With Windows</link>, <link linkend="kbd-leaving">Leaving Your Computer</link>, and <link linkend="kbd-vol-bright">Changing Volume and Brightness</link> are called <emphasis>global shortcuts</emphasis>, since they work regardless of which window you have open on your screen. These can be modified in the <ulink url="help:/kcontrol/keys/">Global Shortcuts panel of &systemsettings;</ulink>, where they are separated by &kde; component.
de: Die in den Abschnitten <link linkend="kbd-windows">Arbeiten mit Fenstern</link>, <link linkend="kbd-leaving">Arbeit am Rechner beenden</link> und <link linkend="kbd-vol-bright">Ändern von Lautstärke und Helligkeit</link> beschriebenen Kurzbefehle werden auch als <emphasis>Globale Kurzbefehle</emphasis> bezeichnet, da Sie unabhängig vom auf der Arbeitsfläche geöffneten Fenster funktionieren. Diese Befehle im Modul <ulink url="help:/kcontrol/keys/">Globale Kurzbefehle in den &systemsettings;</ulink> geändert werden, getrennt nach den &kde;-Komponenten.

source: The shortcuts described in <link linkend="kbd-activities">Working with Activities and Virtual Desktops</link> and <link linkend="kbd-desktop">Working with the Desktop</link> can be modified by clicking on the <ulink url="help:/plasma-desktop/using-kapp.html">Desktop Toolbox</ulink> and selecting <guimenuitem>Shortcut Settings</guimenuitem>.
de: Die Kurzbefehle in den Abschnitten <link linkend="kbd-activities">Arbeiten mit Aktivitäten und virtuelle Arbeitsflächen</link> und <link linkend="kbd-desktop">Arbeiten mit der Arbeitsfläche</link> können geändert werden, indem Sie auf die <ulink url="help:/plasma-desktop/using-kapp.html">Werkzeugleiste der Arbeitsfläche</ulink> und <guimenuitem>Tastenkürzel einrichten</guimenuitem> wählen.

source: The shortcuts described in <link linkend="kbd-docs">Working with Documents</link> and <link linkend="kbd-help">Getting Help</link> are set by individual programs. Most &kde; programs allow you to use the <link linkend="shortcuts">common shortcut editing dialog</link> to modify these. The shortcuts described in <link linkend="kbd-files">Working With Files</link> can be edited in the same manner when used inside a file manager like &dolphin; or &konqueror;, but cannot be modified in the case of Open/Save dialogs, &etc;
de: Die Kurzbefehle in den Abschnitten <link linkend="kbd-docs">Arbeiten mit Dokumenten</link> and <link linkend="kbd-help">Hilfe anfordern</link> werden durch die einzelnen Programme bestimmt. In fast allen &kde;-Programmen können die Kurzbefehle im bekannten Dialog <link linkend="shortcuts">Kurzbefehle festlegen</link> geändert werden. Die Kurzbefehle im Abschnitt <link linkend="kbd-files">Arbeiten mit Dateien</link> können auf die gleiche Art in den Dateiverwaltungsprogrammen wie &dolphin; oder &konqueror; geändert werden, aber nicht im Dateidialog.
