Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kde-runtime/fundamentals_tasks.po
Languages: de

source: Common Tasks
de: Alltägliche Aufgaben

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Burkhard</firstname><surname>Lück</surname><affiliation><address><email>lueck@hube-lueck.de</email></address></affiliation><contrib>Übersetzung</contrib></othercredit>

source: Navigating Documents
de: Navigation in Dokumenten

source: Scrolling
de: Blättern im Dokument

source: You're probably familiar with the scrollbar that appears on the right side (and sometimes the bottom) of documents, allowing you to move within documents. However, there are several other ways you can navigate documents, some of which are faster and easier.
de: Sie kennen sicher die Bildlaufleisten, die rechts und manchmal auch unten im Anzeigefenster von Dokumenten erscheinen. Mit Hilfe dieser Leisten können Sie im Dokument blättern. Es gibt jedoch auch noch weitere Möglichkeiten zur Navigation in Dokumenten, einige davon sind schneller und leichter zu benutzen.

source: Several mice have a wheel in the middle. You can move it up and down to scroll within a document. If you press the &Shift; key while using the mouse wheel, the document will scroll faster.
de: Viele Mäuse für Rechner haben ein Rad in der Mitte. Drehen Sie diese Mausrad, um in einem Dokument vor oder zurück zu blättern. Wenn Sie dabei die Taste &Shift; gedrückt halten, wird schneller geblättert.

source: If you're using a portable computer like a laptop, you might also be able to scroll using the touchpad. Some computers allow you to scroll vertically by moving your finger up and down the rightmost side of the touchpad, and allow you to scroll horizontally by moving your finger across the bottommost side of the touchpad. Others let you scroll using two fingers: move both fingers up and down anywhere on the touchpad to scroll vertically, and move them left and right to scroll horizontally. Since this functionality emulates the mouse wheel functionality described above, you can also press the &Shift; key while you do this to scroll faster.
de: Wenn Sie einen tragbaren Rechner wie zum Beispiel einen Laptop benutzen, können Sie auch mit dem Touchpad blättern. Bewegen Sie auf einigen Rechnern Ihren Finger auf der rechten Seite des Touchpads hoch und runter, um senkrecht zu blättern, und bewegen Sie Ihren Finger entlang der unteren Seite des Touchpads, um waagerecht zu blättern. Auf anderen Systemen können Sie mit zwei Fingern blättern: Bewegen Sie zwei Finger irgendwo auf dem Touchpad hoch oder runter, um senkrecht zu blättern, und bewegen Sie die Finger nach links oder rechts, um waagerecht zu blättern. Da damit die Funktion des Mausrads emuliert wird, können Sie hier auch die &Shift;taste drücken, um das Blättern zu beschleunigen.

source: If you use the &plasma-workspaces;, you can control mouse wheel behavior in the <ulink url="help:/kcontrol/mouse/">Mouse module in &systemsettings;</ulink>, and you can control touchpad scrolling behavior in the Touchpad module in &systemsettings;. Otherwise, look in the configuration area of your operating system or desktop environment.
de: Wenn Sie den &plasma-workspaces; verwenden, können Sie das Verhalten des Mausrads im Modul <ulink url="help:/kcontrol/mouse/">Maus</ulink> in den Systemeinstellungen einrichten. Für Touchpads öffnen Sie das gleichnamige Modul in den &systemsettings;. Ansonsten suchen Sie nach diesen Einstellungen im Einrichtungsmodul des Betriebssystems oder der Arbeitsflächenumgebung.

source: Additionally, the scrollbar has several options in its context menu. You can access these by right-clicking anywhere on the scrollbar. The following options are available:
de: Zusätzlich gibt es im Kontextmenü einer Bildlaufleiste mehrere Aktionen. Dieses Kontextmenü öffnen Sie durch Klicken mit der &RMBn; irgendwo auf die Bildlaufleiste. Folgende Aktionen sind im Menü vorhanden:

source: Scroll here
de: Hierher rollen

source: Scroll directly to the location represented by where you right-clicked on the scrollbar. This is the equivalent of simply clicking on that location on the scrollbar.
de: Geht direkt zur Stelle im Dokument, die der Stelle entspricht, auf die Sie mit der &RMBn; auf der Bildlaufleiste geklickt haben. Das gleiche erreichen Sie, wenn Sie mit der &LMBn; auf diese Stelle in der Bildlaufleiste klicken.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>Home</keycap></keycombo></shortcut> <guimenuitem>Top</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>Pos 1</keycap></keycombo></shortcut> <guimenuitem>Oben</guimenuitem>

source: Go to the beginning of the document.
de: Geht zum Anfang des Dokuments.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>End</keycap></keycombo></shortcut> <guimenuitem>Bottom</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>Ende</keycap></keycombo></shortcut> <guimenuitem>Unten</guimenuitem>

source: Go to the end of the document.
de: Geht zum Ende des Dokuments.

source: <shortcut><keycap>PgUp</keycap></shortcut> <guimenuitem>Page up</guimenuitem>
de: <shortcut><keycap>Bild auf</keycap></shortcut> <guimenuitem>Seite nach oben</guimenuitem>

source: Navigate to the previous page in a document that represents a printed document, or one screen up in other types of documents.
de: Zeigt die vorherige Seite eines Dokuments an, das aus einzelnen druckbaren Seiten besteht, oder zeigt für andere Arten von Dokumenten den Bereich vor dem auf dem Bildschirm sichtbaren Ausschnitt des Dokuments an.

source: <shortcut><keycap>PgDown</keycap></shortcut> <guimenuitem>Page down</guimenuitem>
de: <shortcut><keycap>Bild ab</keycap></shortcut> <guimenuitem>Seite nach unten</guimenuitem>

source: Navigate to the next page in a document that represents a printed document, or one screen down in other types of documents.
de: Zeigt die nächste Seite eines Dokuments an, das aus einzelnen druckbaren Seiten besteht, oder zeigt für andere Arten von Dokumenten den Bereich nach dem auf dem Bildschirm sichtbaren Ausschnitt des Dokuments an.

source: Scroll up
de: Nach oben rollen

source: Scroll up one unit (usually a line) in the document. This is the equivalent of clicking the up arrow at the top of the scrollbar.
de: Geht um eine Einheit, normalerweise eine Zeile, nach oben. Den gleichen Effekt erreichen Sie, wenn Sie auf den Pfeil oben in der Bildlaufleiste klicken.

source: Scroll down
de: Nach unten rollen

source: Scroll down one unit (usually a line) in the document. This is the equivalent of clicking the down arrow at the bottom of the scrollbar.
de: Geht um eine Einheit, normalerweise eine Zeile, nach unten. Den gleichen Effekt erreichen Sie, wenn Sie auf den Pfeil unten in der Bildlaufleiste klicken.

source: Zooming
de: Vergrößerung der Ansicht ändern

source: Many applications permit you to zoom. This makes the text or image you are viewing larger or smaller. You can generally find the zoom function in the <link linkend="menus-view">View menu</link>, and sometimes in the status bar of the application.
de: In vielen Programmen können Sie die Ansicht vergrößern oder verkleinern. Damit wird der angezeigte Text oder das angezeigte Bild größer oder kleiner. Im Allgemeinen finden Sie die Vergrößerungsfunktion im <link linkend="menus-view">Menü Ansicht</link>, manchmal aber auch in der Statusleiste des Programms.

source: You can also zoom using the keyboard by pressing <keycombo action="simul">&Ctrl;<keycap>+</keycap></keycombo> to zoom in, or <keycombo action="simul">&Ctrl;<keycap>-</keycap></keycombo> to zoom out. If you can scroll with the mouse wheel or touchpad as described in <xref linkend="nav-scroll"/>, you can also zoom by pressing &Ctrl; and scrolling that way.
de: Auch mit der Tastatur können Sie die Ansichtsgrösse ändern. Mit dem Kurzbefehl <keycombo action="simul">&Ctrl;<keycap>+</keycap></keycombo> wird die Ansicht vergrößert und mit <keycombo action="simul">&Ctrl;<keycap>-</keycap></keycombo> verkleinert. Wenn Sie das Mausrad oder Touchpad wie in <xref linkend="nav-scroll"/> beschrieben benutzen, können Sie die Vergrößerung auch damit ändern, wenn die Taste &Ctrl; dabei gedrückt wird.

source: Opening and Saving Files
de: Öffnen und Speichern von Dateien

source: Introduction
de: Einleitung

source: Many &kde; applications work with files. Most applications have a <guimenu>File</guimenu> menu with options that allow you to open and save files. For more information on that, see <xref linkend="menus-file"/>. However, there are lots of different operations that require selecting a file. Regardless of the method, all &kde; applications generally use the same file selection window.
de: Mit vielen Anwendungen von &kde; werden Dateien bearbeitet, daher haben viele Anwendungen ein Menü <guimenu>Datei</guimenu> mit Aktionen zum Öffnen und Speichern von Dateien. Weitere Informationen dazu finden Sie im Abschnitt <xref linkend="menus-file"/>. Es gibt jedoch noch viele verschiedene Operationen, für die eine Datei ausgewählt werden muss. Normalerweise benutzen alle Anwendungen von &kde; den gleichen Dateiauswahldialog.

source: The File Open Window
de: Der Dialog <quote>Datei öffnen</quote>

source: The File Open window.
de: Der Dialog <quote>Datei öffnen</quote>.

source: Opening a file in <ulink url="http://kde.org/applications/internet/konqueror/">&konqueror;</ulink>.
de: Öffnen einer Datei in <ulink url="http://kde.org/applications/internet/konqueror/">&konqueror;</ulink>.

source: The File Selection Window
de: Der Dialog <quote>Dateiauswahl</quote>

source: The Toolbar
de: Die Werkzeugleiste

source: This contains standard navigation tool buttons:
de: Diese Werkzeugleiste enthält die Standardnavigationsknöpfe:

source: Back
de: Zurück

source: Causes the folder view to change to the previously displayed folder in its history. This button is disabled, if there is no previous item.
de: Drücken dieses Knopfes schaltet die Anzeige zu dem vorher angezeigtem Verzeichnis in der Verlaufsliste um. Wenn es keine Eintragung in der Liste gibt, ist dieser Knopf deaktiviert.

source: Forward
de: Vorwärts

source: Causes the folder view to change to the next folder in its history. This button is disabled, if there is no next folder.
de: Drücken dieses Knopfes schaltet die Anzeige zu dem nächsten Verzeichnis in der Verlaufsliste um. Wenn es keine nächste Eintragung in der Liste gibt, ist dieser Knopf deaktiviert.

source: Parent Folder
de: Übergeordneter Ordner

source: This will cause the folder view to change to the immediate parent of the currently displayed folder, if possible.
de: Drücken dieses Knopfes, schaltet die Anzeige zu dem Verzeichnis über dem aktuell angezeigten Verzeichnis um, wenn möglich.

source: <guibutton>Reload</guibutton> (<keycap>F5</keycap>)
de: <guibutton>Neu laden</guibutton> (<keycap>F5</keycap>)

source: Reloads the folder view, displaying any changes that have been made since it was first loaded or last reloaded.
de: Lädt die Ordneransicht erneut und zeigt alle Änderungen an, die seit dem ersten oder letzten erneuten Laden aufgetreten sind.

source: Show Preview
de: Vorschau anzeigen

source: Displays a preview of each file inside the folder view.
de: Zeigt eine Vorschau jeder Datei in der Ordneransicht.

source: Zoom Slider
de: Vergrößerungsregler

source: This allows you to change the size of the icon or preview shown in the folder view.
de: Mit diesem Schieberegler können Sie die Größe der Symbole oder Vorschaubilder in der Ordneransicht einstellen.

source: <guibutton>Options</guibutton>
de: <guibutton>Optionen</guibutton>

source: <guimenu>Options</guimenu><guisubmenu>Sorting</guisubmenu>
de: <guimenu>Optionen</guimenu><guisubmenu>Sortierung</guisubmenu>

source: <guimenu>Options</guimenu><guisubmenu>Sorting</guisubmenu> <guimenuitem>By Name</guimenuitem>
de: <guimenu>Optionen</guimenu><guisubmenu>Sortierung</guisubmenu><guimenuitem>Nach Namen</guimenuitem>

source: Sort files listed in the folder view alphabetically by name.
de: Sortiert die in der Ordneransicht aufgelisteten Dateien alphabetisch nach ihrem Namen.

source: <guimenu>Options</guimenu><guisubmenu>Sorting</guisubmenu> <guimenuitem>By Size</guimenuitem>
de: <guimenu>Optionen</guimenu><guisubmenu>Sortierung</guisubmenu><guimenuitem>Nach Größe</guimenuitem>

source: Sort files listed in the folder view in order of their file size.
de: Sortiert die in der Ordneransicht aufgelisteten Dateien nach der Dateigröße.

source: <guimenu>Options</guimenu><guisubmenu>Sorting</guisubmenu> <guimenuitem>By Date</guimenuitem>
de: <guimenu>Optionen</guimenu><guisubmenu>Sortierung</guisubmenu><guimenuitem>Nach Datum</guimenuitem>

source: Sort files listed in the folder view by the date they were last modified.
de: Sortiert die in der Ordneransicht aufgelisteten Dateien nach dem Datum der letzten Änderung.

source: <guimenu>Options</guimenu><guisubmenu>Sorting</guisubmenu> <guimenuitem>By Type</guimenuitem>
de: <guimenu>Optionen</guimenu><guisubmenu>Sortierung</guisubmenu><guimenuitem>Nach Typ</guimenuitem>

source: Sort files listed in the folder view alphabetically by their file type.
de: Sortiert die in der Ordneransicht aufgelisteten Dateien alphabetisch nach ihrem Typ.

source: <guimenu>Options</guimenu><guisubmenu>Sorting</guisubmenu> <guimenuitem>Descending</guimenuitem>
de: <guimenu>Optionen</guimenu><guisubmenu>Sortierung</guisubmenu><guimenuitem>Absteigend</guimenuitem>

source: When unchecked (the default), files in the folder view will be sorted in ascending order. (For instance, files sorted alphabetically will be sorted from A to Z, while files sorted numerically will be sorted from smallest to largest.) When checked, files in the folder will be sorted in descending order (in reverse).
de: Ist diese Einstellung wie in der Voreinstellung nicht angekreuzt, werden die Dateien in der Ordneransicht in aufsteigender Reihenfolge angezeigt. Dateien mit Buchstaben im Namen werden von A bis Z und Dateien mit Zahlen im Namen von der kleinsten bis zur größten Zahl sortiert. Ist diese Einstellung aktiviert, werden die Dateien in absteigender umgekehrter Reihenfolge angezeigt.

source: <guimenu>Options</guimenu><guisubmenu>Sorting</guisubmenu> <guimenuitem>Folders First</guimenuitem>
de: <guimenu>Optionen</guimenu><guisubmenu>Sortierung</guisubmenu><guimenuitem>Ordner zuerst</guimenuitem>

source: When enabled (the default), folders will appear before regular files.
de: Ist diese Einstellung wie in der Voreinstellung aktiviert, werden Ordner vor normalen Dateien angezeigt.

source: <guimenu>Options</guimenu><guisubmenu>View</guisubmenu>
de: <guimenu>Optionen</guimenu><guisubmenu>Ansicht</guisubmenu>

source: <guimenu>Options</guimenu><guisubmenu>View</guisubmenu> <guimenuitem>Short View</guimenuitem>
de: <guimenu>Optionen</guimenu><guisubmenu>Ansicht</guisubmenu> <guimenuitem>Kurzdarstellung</guimenuitem>

source: Displays only the filenames.
de: Zeigt nur die Namen der Dateien.

source: <guimenu>Options</guimenu><guisubmenu>View</guisubmenu> <guimenuitem>Detailed View</guimenuitem>
de: <guimenu>Optionen</guimenu><guisubmenu>Ansicht</guisubmenu> <guimenuitem>Ausführliche Ansicht</guimenuitem>

source: Displays <guilabel>Name</guilabel>, <guilabel>Date</guilabel> and <guilabel>Size</guilabel> of the files.
de: Zeigt <guilabel>Name</guilabel>, <guilabel>Datum</guilabel> und <guilabel>Größe</guilabel> der Dateien an.

source: <guimenu>Options</guimenu><guisubmenu>View</guisubmenu> <guimenuitem>Tree View</guimenuitem>
de: <guimenu>Optionen</guimenu><guisubmenu>Ansicht</guisubmenu> <guimenuitem>Baumansicht</guimenuitem>

source: Like Short View, but folders can be expanded to view their contents.
de: Wie die Kurzansicht, aber die Ordner können ein- und ausgeklappt werden, um die Unterordner oder Dateien darin anzuzeigen.

source: <guimenu>Options</guimenu><guisubmenu>View</guisubmenu> <guimenuitem>Detailed Tree View</guimenuitem>
de: <guimenu>Optionen</guimenu><guisubmenu>Ansicht</guisubmenu> <guimenuitem>Ausführliche Baumansicht</guimenuitem>

source: This also allows folders to be expanded, but displays the additional columns available in Detailed View.
de: In dieser Ansicht können die Ordner ebenfalls ein- und ausgeklappt werden, zusätzlich werden die Spalten wie in der Ausführlichen Ansicht angezeigt.

source: <shortcut> <keycombo action="simul">&Alt;<keycap>.</keycap></keycombo> </shortcut> <guimenu>Options</guimenu><guimenuitem>Show Hidden Files</guimenuitem>
de: <shortcut> <keycombo action="simul">&Alt;<keycap>.</keycap></keycombo> </shortcut> <guimenu>Optionen</guimenu><guimenuitem>Versteckte Dateien anzeigen</guimenuitem>

source: Displays files or folders normally hidden by your operating system. The alternate shortcut for this action is <keycap>F8</keycap>.
de: Zeigt die normalerweise durch das Betriebssystem versteckten Dateien und Ordner an. <keycap>F8</keycap> ist ein alternativer Kurzbefehl für diese Aktion.

source: <shortcut><keycap>F9</keycap></shortcut> <guimenu>Options</guimenu><guimenuitem>Show Places Navigation Panel</guimenuitem>
de: <shortcut> <keycombo action="simul">&Alt;<keycap>.</keycap></keycombo> </shortcut> <guimenu>Optionen</guimenu><guimenuitem>Navigationsbereich anzeigen</guimenuitem>

source: Displays the places panel which provides quick access to bookmarked locations and disks or other media.
de: Zeigt die Seitenleiste <guilabel>Orte</guilabel> an, die schnellen Zugriff auf Lesezeichen und Speichermedien ermöglicht.

source: <guimenu>Options</guimenu><guimenuitem>Show Bookmarks</guimenuitem>
de: <guimenu>Optionen</guimenu><guimenuitem>Lesezeichen anzeigen</guimenuitem>

source: Displays an additional icon on the toolbar that provides access to <quote>bookmarks</quote>, a list of saved locations.
de: Zeigt ein zusätzliches Symbol in der Werkzeugleiste an, das den Zugriff auf <quote>Lesezeichen</quote>, eine Liste gespeicherter Orte, ermöglicht.

source: <guimenu>Options</guimenu><guimenuitem>Show Aside Preview</guimenuitem>
de: <guimenu>Optionen</guimenu><guimenuitem>Seitlichen Vorschaubereich anzeigen</guimenuitem>

source: Displays a preview of the currently highlighted file to the right of the folder view.
de: Zeigt eine Vorschau der gerade hervorgehobenen Datei rechts neben der Ordneransicht.

source: Bookmarks
de: Lesezeichen

source: Opens a submenu to edit or add bookmarks and to add a new bookmark folder.
de: Öffnet ein Untermenü zum Ändern oder Hinzufügen von Lesezeichen. Hier können Sie auch ein neues Lesezeichenverzeichnis hinzufügen.

source: Location Bar
de: Adressleiste

source: The location bar, which can be found on top of the folder view, displays the path to the current folder. The location bar has two modes:
de: Die Adressleiste über der Ordneransicht zeigt den Pfad zum aktuellen Ordner an. Sie hat zwei verschiedene Modi:

source: Bread Crumb Mode
de: Verknüpfungsansicht

source: In the <quote>bread crumb</quote> mode, which is the default, each folder name in the path to the current folder is a button which can be clicked to quickly open that folder. Moreover, clicking the <quote>&gt;</quote> sign to the right of a folder opens a menu which permits to quickly open a subfolder of that folder.
de: In der <quote>Verknüpfungsansicht</quote> (Standard) ist jeder Ordnername im Pfad zum aktuellen Ordner ein Knopf, auf den Sie klicken können, um den jeweiligen Ordner schnell zu öffnen. Außerdem können Sie durch einen Klick auf das <quote>&gt;</quote>-Zeichen rechts von jedem Ordnernamen ein Menü öffnen, das es ermöglicht, schnell einen Unterordner des jeweiligen Ordners zu öffnen.

source: Screenshot of the location bar in bread crumb mode
de: Bildschirmfoto der Adressleiste in der Verknüpfungsansicht

source: <phrase>Location bar in bread crumb mode.</phrase>
de: <phrase>Bildschirmfoto der Adressleiste in der Verknüpfungsansicht</phrase>

source: <para>Location bar in bread crumb mode.</para>
de: <para>Adressleiste in der Verknüpfungsansicht.</para>

source: Editable Mode
de: Editierbare Adressleiste

source: When in bread crumb mode, clicking in the gray area to the right of the path with the &LMB; switches the location bar to the <quote>editable</quote> mode, in which the path can be edited using the keyboard. To switch back to bread crumb mode, click the check mark at the right of the location bar with the &LMB;.
de: Wenn Sie die Verknüpfungsansicht verwenden, können Sie durch einen Klick mit der &LMBn; in den grauen Bereich rechts des Pfades in die <quote>Editieransicht</quote> wechseln, in dem der Pfad durch Tastatureingaben geändert werden kann. Um zurück in die Verknüpfungsansicht zu wechseln, klicken Sie mit der &LMBn; auf das Häkchen rechts von der Adressleiste.

source: Screenshot of the location bar in editable mode
de: Bildschirmfoto der Adressleiste in der Editieransicht

source: <phrase>Location bar in editable mode.</phrase>
de: <phrase>Bildschirmfoto der Adressleiste in der Editieransicht</phrase>

source: <para>Location bar in editable mode.</para>
de: <para>Adressleiste in der Editieransicht</para>

source: The context menu of the location bar offers action to switch between the modes and to copy and paste the path using the clipboard. Check the last option in this context menu to display either the full path starting with the root folder of the file system or to display the path starting with the current places entry.
de: Das Kontextmenü der Adressleiste enthält Aktionen, um zwischen den beiden Modi zu wechseln und den Pfad über die Zwischenablage zu kopieren und einzufügen. Aktivieren Sie die letzte Einstellung in diesem Kontextmenü, um entweder den vollständigen Pfad mit dem Basisordner des Dateisystems als Start oder den Pfad mit dem aktuellen Orte-Eintrag als Start anzuzeigen.

source: <screeninfo>Location bar context menu</screeninfo>
de: <screeninfo>Kontextmenü der Adressleiste</screeninfo>

source: <phrase>Location bar context menu</phrase>
de: <phrase>Kontextmenü der Adressleiste</phrase>

source: The <guilabel>Places</guilabel> List
de: Die Liste der <guilabel>Orte</guilabel>

source: This provides the standard &kde; list of Places, shared with &dolphin; and other file management tools.
de: Dies ist die Standardliste von Orten in &kde;, die auch von &dolphin;, &konqueror; und weiteren Werkzeugen zur Dateiverwaltung verwendet wird.

source: The Folder View
de: Die Ordneransicht

source: The largest part of the file selection window is the area that lists all items in the current directory. To select a file, you can double-click on it, or choose one and hit <guibutton>Open</guibutton> or <guibutton>Save</guibutton>.
de: Der größte Teil des Dateiauswahldialogs ist der Bereich, in dem alle Elemente im aktuellen Ordner angezeigt werden. Um eine Datei auszuwählen, doppelklicken Sie darauf oder heben sie hervor und drücken den Knopf <guibutton>Öffnen</guibutton> oder <guibutton>Speichern</guibutton>.

source: You can also select multiple files at once. To select specific files, or to unselect specific files that are already selected, press and hold &Ctrl;, click on each file, then release &Ctrl;. To select a contiguous group of files, click the first file, press and hold &Shift;, click on the last file in the group, and release &Shift;.
de: Sie können auch mehrere Dateien auf einmal auswählen. Um bestimmte Dateien auszuwählen, drücken Sie die Taste &Ctrl; und halten Sie gedrückt. Klicken Sie dann auf einzelne Dateien und lassen die Taste &Ctrl; wieder los. Um eine zusammenhängende Gruppe von Dateien auszuwählen, klicken Sie auf die erste Datei und dann mit gedrückter &Shift;-taste auf die letzte Datei in der Gruppe. Lassen Sie dann die &Shift;-taste wieder los.
