Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kde-runtime/fundamentals_ui.po
Languages: de

source: A Tree View allows you to select from a hierarchical list of options. A section, or category, of the Tree View may be unexpanded, in which case no options will appear beneath it and the arrow to the left of the title will be pointing right, toward the title. It may also be expanded, in which case several options will be listed below it, and the arrow to the left of the title will be pointing down, toward the options. To expand a portion of the tree view, click the arrow to the left of the title of the section you wish to expand, double-click on the title, or select the title using your keyboard's arrow keys and press the &Enter; or <keycap>+</keycap> key. To minimize a portion of the tree view, you may also click the arrow, double-click on the title, or press the &Enter; or <keycap>-</keycap> key.
de: In einer Baumansicht können Sie aus einer hierarchischen Liste von Optionen auswählen. Ein Abschnitt oder Kategorie der Baumansicht kann eingeklappt werden. Dann sind alle untergeordneten Elemente ausgeblendet und der Pfeil links neben dem Abschnittstitel zeigt nach rechts zum Titel. Ein Abschnitt kann auch ausgeklappt werden, dann werden die untergeordneten Elemente darunter angezeigt und der Pfeil zeigt nach unten in Richtung der Unterelemente. Um Abschnitte der Baumansicht auszuklappen, klicken Sie auf den Pfeil links vom Element, doppelklicken Sie auf ein Element oder wählen das Element mit den Cursor-Tasten und drücken die Taste &Enter; oder <keycap>+</keycap>. Zum Einklappen können Sie ebenfalls auf den Pfeil oder doppelt auf das Element klicken oder die Taste &Enter; oder <keycap>-</keycap> drücken.

source: Common Menus
de: Standardmenüs

source: Many &kde; applications contain these menus. However, most applications will have more menu entries than those listed here, and others may be missing some of the entries listed here.
de: Diese Menüs finden Sie in vielen Anwendungen von &kde;. Die meisten Anwendungen haben jedoch mehr als die hier genannten Menüeinträge und in einigen Anwendungen werden auch hier aufgeführte Einträge fehlen.

source: A Menu Bar
de: Eine Menüleiste

source: A menubar
de: Eine Menüleiste

source: The menubar in <ulink url="http://kde.org/applications/graphics/gwenview/">&gwenview;</ulink>.
de: Die Menüleiste in <ulink url="http://kde.org/applications/graphics/gwenview/">&gwenview;</ulink>.

source: Some applications, like &dolphin;, do not show a menubar by default. You can show it by pressing <keycombo>&Ctrl;<keycap>M</keycap></keycombo>. You can also use this to hide the menubar in applications that support doing so.
de: Einige Programme wie zum Beispiel &dolphin; blenden die Menüleiste in der Voreinstellungen aus. Um die Leiste wieder anzuzeigen, benutzen Sie den Kurzbefehl <keycombo>&Ctrl;<keycap>M</keycap></keycombo>. Dieser Kurzbefehl kann auch zum Ausblenden der Menüleiste verwendet werden, wenn das Programm diese Funktion unterstützt.

source: The File Menu
de: Das Menü <quote>Datei</quote>

source: The <guimenu>File</guimenu> menu allows you to perform operations on the currently open file and access common tasks in applications.
de: Mit den Einträgen im Menü <guimenu>Datei</guimenu> können Sie Aktionen mit der gerade geöffnete Datei ausführen, hier finden Sie auch Standardaktionen in Programmen .

source: Common menu items include:
de: Häufige Menüeinträge sind:

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo></shortcut> <guimenu>File</guimenu><guimenuitem>New</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo> </shortcut> <guimenu>Datei</guimenu> <guimenuitem>Neu</guimenuitem>

source: Creates a new file.
de: Erstellt eine neue Datei.

source: <guimenu>File</guimenu><guimenuitem>New Window</guimenuitem>
de: <guimenu>Datei</guimenu> <guimenuitem>Neues Fenster</guimenuitem>

source: Opens a new window.
de: Öffnet ein neues Fenster.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>O</keycap></keycombo></shortcut> <guimenu>File</guimenu><guimenuitem>Open...</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>O</keycap></keycombo> </shortcut> <guimenu>Datei</guimenu> <guimenuitem>Öffnen ...</guimenuitem>

source: Opens an already existing file.
de: Öffnet eine bereits vorhandene Datei.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>S</keycap></keycombo></shortcut> <guimenu>File</guimenu><guimenuitem>Save</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>S</keycap></keycombo> </shortcut> <guimenu>Datei</guimenu> <guimenuitem>Speichern</guimenuitem>

source: Saves the file. If the file already exists it will be overwritten.
de: Speichert die Datei. Wenn sie bereits existiert, wird sie überschrieben.

source: <guimenu>File</guimenu><guimenuitem>Save As...</guimenuitem>
de: <guimenu>Datei</guimenu><guimenuitem>Speichern unter ...</guimenuitem>

source: Saves the file with a new filename.
de: Speichert eine Datei unter einem anderen Namen.

source: <guimenu>File</guimenu><guimenuitem>Save All</guimenuitem>
de: <guimenu>Datei</guimenu> <guimenuitem>Alles speichern</guimenuitem>

source: Saves all open files.
de: Speichert alle geöffneten Dateien.

source: <shortcut><keycap>F5</keycap></shortcut> <guimenu>File</guimenu><guimenuitem>Reload</guimenuitem>
de: <shortcut><keycap>F5</keycap></shortcut> <guimenu>Datei</guimenu> <guimenuitem>Erneut laden</guimenuitem>

source: Reloads the current file.
de: Lädt die aktuelle Datei erneut.

source: <guimenu>File</guimenu><guimenuitem>Reload All</guimenuitem>
de: <guimenu>Datei</guimenu> <guimenuitem>Alle neu laden</guimenuitem>

source: Reloads all open files.
de: Lädt alle geöffneten Datei erneut.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>P</keycap></keycombo></shortcut> <guimenu>File</guimenu><guimenuitem>Print...</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>P</keycap></keycombo> </shortcut> <guimenu>Datei</guimenu> <guimenuitem>Drucken ...</guimenuitem>

source: Prints the file.
de: Druckt eine Datei.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>W</keycap></keycombo></shortcut> <guimenu>File</guimenu><guimenuitem>Close</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>W</keycap></keycombo> </shortcut> <guimenu>Datei</guimenu> <guimenuitem>Schließen</guimenuitem>

source: Closes the current file.
de: Schließt die aktuell geöffnete Datei.

source: <guimenu>File</guimenu><guimenuitem>Close All</guimenuitem>
de: <guimenu>Datei</guimenu> <guimenuitem>Alle schließen</guimenuitem>

source: Closes all open files.
de: Schließt alle geöffneten Dateien.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo></shortcut> <guimenu>File</guimenu><guimenuitem>Quit</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo> </shortcut> <guimenu>Datei</guimenu> <guimenuitem>Beenden</guimenuitem>

source: Exits the program.
de: Beendet das Programm.

source: The Edit Menu
de: Das Menü <quote>Bearbeiten</quote>

source: The <guimenu>Edit</guimenu> menu allows you to modify the currently open file.
de: Mit den Einträgen im Menü <guimenu>Bearbeiten</guimenu> können Sie die gerade geöffnete Datei verändern.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>Z</keycap></keycombo></shortcut> <guimenu>Edit</guimenu><guimenuitem>Undo</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Z</keycap></keycombo> </shortcut> <guimenu>Bearbeiten</guimenu> <guimenuitem>Rückgängig</guimenuitem>

source: Undo the last action you performed in the file.
de: Nimmt die zuletzt ausgeführte Aktion in der Datei zurück.

source: <shortcut><keycombo action="simul">&Ctrl;&Shift;<keycap>Z</keycap></keycombo></shortcut> <guimenu>Edit</guimenu><guimenuitem>Redo</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;&Shift;<keycap>Z</keycap></keycombo></shortcut> <guimenu>Bearbeiten</guimenu><guimenuitem>Wiederherstellen</guimenuitem>

source: Redo the last action you performed in the file.
de: Stellt die letzte rückgängig gemachte Aktion in der Datei wieder her.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>X</keycap></keycombo></shortcut> <guimenu>Edit</guimenu><guimenuitem>Cut</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>X</keycap></keycombo> </shortcut> <guimenu>Bearbeiten</guimenu> <guimenuitem>Ausschneiden</guimenuitem>

source: Removes the currently selected portion of the file, if any, and places a copy of it in the clipboard buffer.
de: Entfernt den gerade ausgewählten Text aus einer Datei und kopiert ihn in die Zwischenablage.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>C</keycap></keycombo></shortcut> <guimenu>Edit</guimenu><guimenuitem>Copy</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>C</keycap></keycombo> </shortcut> <guimenu>Bearbeiten</guimenu> <guimenuitem>Kopieren</guimenuitem>

source: Places a copy of the currently selected portion of the file, if any, in the clipboard buffer.
de: Kopiert den gerade ausgewählten Text aus einer Datei in die Zwischenablage.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>V</keycap></keycombo></shortcut> <guimenu>Edit</guimenu><guimenuitem>Paste</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>V</keycap></keycombo> </shortcut> <guimenu>Bearbeiten</guimenu> <guimenuitem>Einfügen</guimenuitem>

source: Copies the first item in the clipboard buffer to the current location in the file, if any.
de: Kopiert ersten in der Zwischenablage gespeicherten Text an der aktuellen Position in die Datei.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>A</keycap></keycombo></shortcut> <guimenu>Edit</guimenu><guimenuitem>Select All</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>A</keycap></keycombo></shortcut> <guimenu>Bearbeiten</guimenu> <guimenuitem>Alles auswählen</guimenuitem>

source: Selects the entire contents of the currently open file.
de: Wählt den gesamten Inhalt der gerade geöffneten Datei aus.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>F</keycap></keycombo></shortcut> <guimenu>Edit</guimenu><guimenuitem>Find...</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>F</keycap></keycombo></shortcut> <guimenu>Bearbeiten</guimenu> <guimenuitem>Suchen ...</guimenuitem>

source: Allows you to search for text in the currently open file.
de: Startet die Suche nach Text in der gerade geöffneten Datei.

source: <shortcut><keycombo action="simul">&Ctrl;<keycap>R</keycap></keycombo></shortcut> <guimenu>Edit</guimenu><guimenuitem>Replace...</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>R</keycap></keycombo></shortcut> <guimenu>Bearbeiten</guimenu> <guimenuitem>Ersetzen ...</guimenuitem>

source: Allows you to search for text in the currently open file and replace it with something else.
de: Ermöglicht das Suchen nach Text in der gerade geöffneten Datei und das Ersetzen durch einem anderen Text.

source: <shortcut><keycap>F3</keycap></shortcut> <guimenu>Edit</guimenu><guimenuitem>Find Next</guimenuitem>
de: <shortcut><keycap>F3</keycap></shortcut> <guimenu>Bearbeiten</guimenu> <guimenuitem>Weitersuchen</guimenuitem>

source: Go to the next match of the last Find operation.
de: Geht zur nächsten Fundstelle des letzten Suchbegriffs.

source: <shortcut><keycombo action="simul">&Shift;<keycap>F3</keycap></keycombo></shortcut> <guimenu>Edit</guimenu><guimenuitem>Find Previous</guimenuitem>
de: <shortcut><keycombo action="simul">&Shift;<keycap>F3</keycap></keycombo></shortcut> <guimenu>Bearbeiten</guimenu> <guimenuitem>Frühere suchen</guimenuitem>

source: Go to the previous match of the last Find operation.
de: Geht zur vorherigen Fundstelle des letzten Suchbegriffs.

source: The View Menu
de: Das Menü <quote>Ansicht</quote>

source: The <guimenu>View</guimenu> menu allows you to change the layout of the currently open file and/or the running application.
de: In diesem Menü kann die Ansicht der gerade geöffneten Datei bzw. des laufenden Programms geändert werden.

source: This menu has different options depending on the application you are using.
de: In diesem Menü finden Sie abhängig vom verwendeten Programm unterschiedliche Menüeinträge.

source: The Tools Menu
de: Das Menü <quote>Extras</quote>

source: The <guimenu>Tools</guimenu> menu allows you to perform certain actions on the currently open file.
de: Mit den Einträgen im Menü <guimenu>Extras</guimenu> können Sie bestimmte zusätzliche Aktionen für die gerade geöffnete Datei finden.

source: <shortcut><keycombo action="simul">&Ctrl;&Shift;<keycap>O</keycap></keycombo></shortcut> <guimenu>Tools</guimenu><guimenuitem>Automatic Spell Checking</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>O</keycap></keycombo> </shortcut> <guimenu>Extras</guimenu> <guimenuitem>Automatische Rechtschreibprüfung</guimenuitem>

source: Check for spelling errors as you type. For more information, see <xref linkend="spellcheck-auto"/>.
de: Überprüft auf Rechtschreibfehler bei der Eingabe. Weitere Informationen finden Sie im Abschnitt <xref linkend="spellcheck-auto"/>.

source: <guimenu>Tools</guimenu><guimenuitem>Spelling...</guimenuitem>
de: <guimenu>Extras</guimenu> <guimenuitem>Rechtschreibung ...</guimenuitem>

source: This initiates the spellchecking program - a program designed to help the user catch and correct any spelling errors. For more information, see <xref linkend="spellcheck-check"/>.
de: Diese Aktion startet die Rechtschreibprüfung - ein Programm, das bei der Suche und Korrektur von Rechtschreibfehlern hilft. Weitere Informationen finden Sie im Abschnitt <xref linkend="spellcheck-check"/>.

source: <guimenu>Tools</guimenu><guimenuitem>Spelling (from cursor)...</guimenuitem>
de: <guimenu>Extras</guimenu> <guimenuitem>Rechtschreibprüfung (ab Cursor) ...</guimenuitem>

source: This initiates the spellchecking program, but only checks the portion of the document from the current location of the cursor to the end. For more information, see <xref linkend="spellcheck-check"/>.
de: Dies startet das Rechtschreibprüfungsprogramm ab der aktuellen Cursor-Position bis zum Ende des Dokuments. Weitere Informationen finden Sie im Abschnitt <xref linkend="spellcheck-check"/>.

source: <guimenu>Tools</guimenu><guimenuitem>Spellcheck Selection...</guimenuitem>
de: <guimenu>Extras</guimenu> <guimenuitem>Rechtschreibprüfung für Auswahl ...</guimenuitem>

source: This initiates the spellchecking program, but only checks the currently selected text in the document. For more information, see <xref linkend="spellcheck-check"/>.
de: Dies startet das Rechtschreibprüfungsprogramm für den aktuell ausgewählten Text im Dokument. Weitere Informationen finden Sie im Abschnitt <xref linkend="spellcheck-check"/>.

source: <guimenu>Tools</guimenu><guimenuitem>Change Dictionary...</guimenuitem>
de: <guimenu>Extras</guimenu><guimenuitem>Wörterbuch auswählen ...</guimenuitem>

source: This allows you to change the dictionary used to check spellings. For more information, see <xref linkend="spellcheck-config"/>.
de: Mit diesem Eintrag können Sie das Wörterbuch für die Rechtschreibprüfung ändern. Weitere Informationen finden Sie im Abschnitt <xref linkend="spellcheck-config"/>.

source: The Settings Menu
de: Das Menü <quote>Einstellungen</quote>

source: The <guimenu>Settings</guimenu> allows you to customize the application.
de: Im Menü <guimenu>Einstellungen</guimenu> können Sie das Programm anpassen.

source: This menu typically contains the following items:
de: Dieses Menü enthält typischerweise die folgenden Einträge:

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>M</keycap></keycombo> </shortcut> <guimenu>Settings</guimenu> <guimenuitem>Show Menubar</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>M</keycap></keycombo> </shortcut> <guimenu>Settings</guimenu> <guimenuitem>Menüleiste anzeigen</guimenuitem>

source: Hides and shows the menubar.
de: Zeigt die Menüleiste an bzw. blendet sie aus.

source: <guimenu>Settings</guimenu> <guimenuitem>Show Statusbar</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>Statusleiste anzeigen</guimenuitem>

source: Toggles the display of the statusbar on and off. Some &kde; applications use statusbar at the bottom of their screen to display useful information.
de: Schaltet die Anzeige der Statusleiste ein und aus. Einige &kde;-Programme benutzen die Statusleiste unten im Fenster des Programms zur Anzeige von nützlichen Informationen.

source: <guimenu>Settings</guimenu><guisubmenu>Toolbars Shown</guisubmenu>
de: <guimenu>Einstellungen</guimenu><guisubmenu>Angezeigte Werkzeugleisten</guisubmenu>

source: Allows you to show and hide the various toolbars supported by the application.
de: Mit dieser Aktion können Sie die verschiedenen Werkzeugleisten des Programms ein- oder ausblenden.

source: <guimenu>Settings</guimenu><guimenuitem>Configure Shortcuts...</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>Kurzbefehle festlegen ...</guimenuitem>

source: Allows you to enable, disable, and modify keyboard shortcuts. For more information, see <xref linkend="shortcuts"/>.
de: Öffnet einen Dialog zum Aktivieren, Deaktivieren und Ändern von Kurzbefehlen. Weitere Informationen finden Sie im Abschnitt <xref linkend="shortcuts"/>.

source: <guimenu>Settings</guimenu><guimenuitem>Configure Toolbars...</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>Werkzeugleisten einrichten ...</guimenuitem>

source: Allows you to customize the contents, layout, text, and icons of toolbars. For more information, see <xref linkend="toolbars"/>.
de: Mit diesem Menüeintrag kann Inhalt, Anordnung, Text und Symbole der Werkzeugleisten geändert werden. Weitere Informationen dazu finden Sie im Abschnitt <xref linkend="toolbars"/>.

source: <guimenu>Settings</guimenu><guimenuitem>Configure Notifications...</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>Benachrichtigungen festlegen ...</guimenuitem>

source: This item displays a standard &kde; notifications configuration dialog, where you can change the notifications (sounds, visible messages, &etc;) used by the application.
de: Öffnet den &kde;-Standarddialog zum Einrichten der Benachrichtigungen (Klänge, Meldungen &etc;) für die Anwendung.

source: For more information how to configure notifications please read the documentation for the &systemsettings; module <ulink url="help:/kcontrol/kcmnotify/index.html">Manage Notifications</ulink>.
de: Weitere Informationen zur Einrichtung von Benachrichtigungen finden Sie in der Dokumentation zum &systemsettings;-Modul <ulink url="help:/kcontrol/kcmnotify/index.html">Benachrichtigungen verwalten</ulink>.

source: <guimenu>Settings</guimenu><guimenuitem>Configure <replaceable>Application</replaceable>...</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem><replaceable>Programm</replaceable> einrichten ...</guimenuitem>

source: Opens the configuration panel for the currently running application.
de: Öffnet den Einrichtungsdialog des gerade ausgeführten Programms.

source: The Help Menu
de: Das Menü <quote>Hilfe</quote>

source: The <guimenu>Help</guimenu> menu gives you access to the application's documentation and other useful resources.
de: Im Menü <guimenu>Hilfe</guimenu> finden Sie das Handbuch zum Programm und andere nützliche Ressourcen.

source: <shortcut> <keycombo action="simul"><keycap>F1</keycap></keycombo> </shortcut> <guimenu>Help</guimenu> <guimenuitem><replaceable>Application</replaceable> Handbook</guimenuitem>
de: <shortcut> <keycombo action="simul"><keycap>F1</keycap></keycombo> </shortcut> <guimenu>Help</guimenu> <guimenuitem>Handbuch zu <replaceable>Programm</replaceable> </guimenuitem>

source: <action>Invokes the KDE Help system</action> starting at the running application's handbook.
de: <action>Startet das Hilfe-System von &kde;</action> mit dem Handbuch zum laufenden Programm.

source: <shortcut> <keycombo action="simul">&Shift;<keycap>F1</keycap></keycombo> </shortcut> <guimenu>Help</guimenu> <guimenuitem>What's This?</guimenuitem>
de: <shortcut> <keycombo action="simul">&Shift;<keycap>F1</keycap></keycombo></shortcut><guimenu>Hilfe</guimenu> <guimenuitem>Was ist das?</guimenuitem>

source: <action>Changes the mouse cursor to a combination arrow and question mark.</action> Clicking on items within the application; will open a help window (if one exists for the particular item) explaining the item's function.
de: <action>Ändert den Mauscursor zu einer Kombination von Zeiger und Fragezeichen</action>. Das Klicken auf ein Element innerhalb des Programms öffnet ein Hilfefenster, das die Funktion des Elementes beschreibt (sofern es Hilfe für das bestimmte Element gibt).

source: <guimenu>Help</guimenu> <guimenuitem>Report Bug...</guimenuitem>
de: <guimenu>Hilfe</guimenu> <guimenuitem>Probleme oder Wünsche berichten ...</guimenuitem>

source: <action>Opens the Bug report dialog</action> where you can report a bug or request a <quote>wishlist</quote> feature.
de: <action>Öffnet den Dialog für Problemberichte</action>, in dem Sie Fehler oder Wünsche berichten können.

source: <guimenu>Help</guimenu> <guimenuitem>Switch Application Language...</guimenuitem>
de: <guimenu>Hilfe</guimenu> <guimenuitem>Sprache der Anwendung umschalten ...</guimenuitem>

source: <action>Opens a dialog</action> where you can edit the <guilabel>Primary language</guilabel> and <guilabel>Fallback language</guilabel> for this application.
de: <action>Öffnet einen Dialog</action> zur Einstellung der <guilabel>Hauptsprache</guilabel> und <guilabel>Ausweichsprache</guilabel> für diese Anwendung.

source: <guimenu>Help</guimenu> <guimenuitem>About <replaceable>Application</replaceable></guimenuitem>
de: <guimenu>Hilfe</guimenu> <guimenuitem>Über <replaceable>Programm</replaceable></guimenuitem>

source: This will display version and author information for the running application.
de: Zeigt Versions- und Autoreninformationen des laufenden Programms an.

source: <guimenu>Help</guimenu> <guimenuitem>About KDE</guimenuitem>
de: <guimenu>Hilfe</guimenu> <guimenuitem>Über KDE</guimenuitem>

source: This displays the &kde; Development Platform version and other basic information.
de: Zeigt Versionsinformationen und Grundsätzliches zu &kde;-Entwicklungsplattform an.

source: Thanks and Acknowledgments
de: Danksagungen

source: Special thanks to an anonymous Google Code-In 2011 participant for writing much of this documentation.
de: Besonderer Dank geht an den anonymen „Google Code-In 2011“-Teilnehmer, der den Hauptteil diese Abschnitts geschrieben hat.

source: Common Keyboard Shortcuts
de: Allgemeine Kurzbefehle

source: The &plasma-workspaces; provide keyboard shortcuts that allow you to perform many tasks without touching your mouse. If you use your keyboard frequently, using these can save you lots of time.
de: Im &plasma-workspaces; gibt es Kurzbefehle für die Tastatur, mit denen Sie viele Aufgaben ohne Maus ausführen können. Verwenden Sie häufig die Tastatur, können diese Kurzbefehle Ihnen viel Zeit ersparen.

source: This list contains the most common shortcuts supported by the workspace itself and many applications available within. Every application also provides its own shortcuts, so be sure to check their manuals for a comprehensive listing.
de: Diese Liste enthält die meisten gebräuchlichen Kurzbefehle, die im Arbeitsbereich selbst wie auch in vielen Anwendungen benutzt werden können. In allen Anwendungen gibt es außerdem noch spezielle einige Kurzbefehle, lesen Sie dazu die Handbücher für eine vollständige Aufstellung.
