Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kde-runtime/fundamentals_ui.po
Languages: de

source: Finding Your Way Around
de: Einführung

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Burkhard</firstname><surname>Lück</surname><affiliation><address><email>lueck@hube-lueck.de</email></address></affiliation><contrib>Übersetzung</contrib></othercredit>

source: A Visual Dictionary
de: Visuelles Wörterbuch

source: The &plasma-workspaces; feature many different graphical user interface elements, commonly known as <quote>widgets</quote>. This guide will introduce you to their names and functions.
de: Die &plasma-workspaces; enthalten viele grafische Bedienungselemente, die auch <quote>Bedienungselemente</quote> genannt werden. Hie erhalten Sie eine Einführung zu Namen und Funktionen dieser Elemente.

source: The Big Picture
de: Übersicht

source: Windows
de: Fenster

source: A Window
de: Ein Fenster

source: This is the window of the &kwrite;, a text editor. Click on part of the window to learn more about it.
de: Dies ist das Programmfenster von &kwrite;, einem Texteditor. Klicken Sie auf dienummerierten Bereiche des Fenster, um mehr darüber zu erfahren.

source: The <emphasis role="bold">Window Menu</emphasis>
de: Das <emphasis role="bold">Fenstermenü</emphasis>

source: A <link linkend="visualdict-button">Button</link> to place this window on all desktops
de: Ein <link linkend="visualdict-button">Knopf</link>, um diese Fenster auf allen Arbeitsflächen anzuzeigen

source: The <emphasis role="bold"><link linkend="visualdict-titlebar">Titlebar</link></emphasis>
de: Die <emphasis role="bold"><link linkend="visualdict-titlebar">Titelleiste</link></emphasis>

source: Buttons to <emphasis>minimize</emphasis>, <emphasis>maximize</emphasis>, or <emphasis>close</emphasis> the window
de: Knöpfe um ein Fenster zu <emphasis>minimieren</emphasis>, <emphasis>maximieren</emphasis> oder zu <emphasis>schließen</emphasis>

source: The <emphasis role="bold"><link linkend="visualdict-menubar">Menubar</link></emphasis>
de: Die <emphasis role="bold"><link linkend="visualdict-menubar">Menüleiste</link></emphasis>

source: The <emphasis role="bold"><link linkend="visualdict-toolbar">Toolbar</link></emphasis>
de: Die <emphasis role="bold"><link linkend="visualdict-toolbar">Werkzeugleiste</link></emphasis>

source: A very large <emphasis role="bold"><link linkend="visualdict-text-area">Text Area</link></emphasis> that acts as this program's <emphasis role="bold"><link linkend="visualdict-central-widget">Central Widget</link></emphasis>
de: Ein sehr großer <emphasis role="bold"><link linkend="visualdict-text-area">Textbereich</link></emphasis>, der das <emphasis role="bold"><link linkend="visualdict-central-widget">zentrale Element</link></emphasis> des Programms ist.

source: A vertical <emphasis role="bold"><link linkend="visualdict-scrollbar">Scrollbar</link></emphasis> (there is also a horizontal scrollbar below the text box)
de: Eine senkrechte <emphasis role="bold"><link linkend="visualdict-scrollbar">Bildlaufleiste</link></emphasis>, es gibt auch eine waagerechte Bildlaufleiste unter dem Textfeld

source: The <emphasis role="bold"><link linkend="visualdict-statusbar">Statusbar</link></emphasis>
de: Die <emphasis role="bold"><link linkend="visualdict-statusbar">Statusleiste</link></emphasis>

source: Another Window
de: Ein weiteres Fenster

source: This is the another window, that of the &dolphin; file manager. Click on part of the window to learn more about it.
de: Dies ist ein weiteres Fenster, diesmal vom Dateiverwaltungsprogramm &dolphin;. Klicken Sie auf die nummerierten Bereiche des Fenster, um mehr darüber zu erfahren.

source: A <emphasis role="bold"><link linkend="visualdict-panel">panel</link></emphasis> that contains a list of Places on the computer system
de: Eine <emphasis role="bold"><link linkend="visualdict-panel">Seitenleiste</link></emphasis>, in der eine Liste der Orte auf dem Rechnersystem angezeigt wird.

source: A <emphasis role="bold"><link linkend="visualdict-breadcrumb">Breadcrumb</link></emphasis> of the path of the displayed folder
de: Eine <emphasis role="bold"><link linkend="visualdict-breadcrumb">Verknüpfungsansicht</link></emphasis> mit den Pfad des angezeigten Ordners

source: A folder <emphasis role="bold"><link linkend="visualdict-icon">Icon</link></emphasis>
de: Ein Ordner-<emphasis role="bold"><link linkend="visualdict-icon">Symbol</link></emphasis>

source: A file <emphasis role="bold"><link linkend="visualdict-icon">Icon</link></emphasis>
de: Ein Datei-<emphasis role="bold"><link linkend="visualdict-icon">Symbol</link></emphasis>

source: A highlighted <emphasis role="bold"><link linkend="visualdict-icon">Icon</link></emphasis>
de: Ein hervorgehobenes <emphasis role="bold"><link linkend="visualdict-icon">Symbol</link></emphasis>

source: A <emphasis role="bold"><link linkend="visualdict-context-menu">Context Menu</link></emphasis> listing actions that can be performed on a file
de: Ein <emphasis role="bold"><link linkend="visualdict-context-menu">Kontextmenü</link></emphasis> mit Aktionen, die für eine Datei ausgeführt werden können.

source: A <emphasis role="bold"><link linkend="visualdict-slider">Slider</link></emphasis> that changes the size of the <link linkend="visualdict-icon">Icons</link> displayed
de: Ein <emphasis role="bold"><link linkend="visualdict-slider">Schieberegler</link></emphasis>, mit dem die Größe von angezeigten <link linkend="visualdict-icon">Symbolen</link> geändert wird.

source: More <emphasis role="bold"><link linkend="visualdict-panel">Panels</link></emphasis>
de: Weitere <emphasis role="bold"><link linkend="visualdict-panel">Seitenleisten</link></emphasis>

source: &GUI; Elements
de: &GUI;-Elemente

source: Some &GUI; Elements
de: Einige &GUI;-Elemente

source: This screenshot, from the &systemsettings; Country/Region &amp; Language panel, shows some &GUI; elements. Click on part of the window to learn more about it.
de: Dieses Bildschirmfoto der Seite <guilabel>Land/Region &amp; Sprache</guilabel> aus den &systemsettings; zeigt weitere &GUI;-Elemente. Klicken Sie auf die nummerierten Bereiche des Fenster, um mehr darüber zu erfahren.

source: An <emphasis role="bold"><link linkend="visualdict-icon-list">Icon List</link></emphasis> (the first item is selected)
de: Eine <emphasis role="bold"><link linkend="visualdict-icon-list">Symbolliste</link></emphasis>, der erste Eintrag ist ausgewählt

source: Some <emphasis role="bold"><link linkend="visualdict-tab">Tabs</link></emphasis>
de: Einige <emphasis role="bold"><link linkend="visualdict-tab">Karteireiter</link></emphasis>

source: An open <emphasis role="bold"><link linkend="visualdict-drop-down-box">Drop Down Box</link></emphasis>
de: Ein geöffnetes <emphasis role="bold"><link linkend="visualdict-drop-down-box">Auswahlfeld</link></emphasis>

source: A <emphasis role="bold"><link linkend="visualdict-button">Button</link></emphasis> that resets the <link linkend="visualdict-drop-down-box">Drop Down Box</link> to its default value
de: Ein <emphasis role="bold"><link linkend="visualdict-button">Knopf</link></emphasis>, der das <link linkend="visualdict-drop-down-box">Auswahlfeld</link> wieder auf den Vorgabewert zurücksetzt.

source: An item in the <link linkend="visualdict-drop-down-box">Drop Down Box</link> that has been selected
de: Ein Eintrag im <link linkend="visualdict-drop-down-box">Auswahlfeld</link>, der ausgewählt ist

source: Some more <emphasis role="bold"><link linkend="visualdict-button">Buttons</link></emphasis>
de: Weitere <emphasis role="bold"><link linkend="visualdict-button">Knöpfe</link></emphasis>

source: Some More &GUI; Elements
de: Weitere &GUI;-Elemente

source: This screenshot, from the &systemsettings; Custom Shortcuts panel, shows some more &GUI; elements.
de: Dieses Bildschirmfoto aus den &systemsettings; mit der Seite <guilabel>Eigene Kurzbefehle</guilabel> aus den &systemsettings; zeigt noch mehr &GUI;-Elemente.

source: A <emphasis role="bold"><link linkend="visualdict-tree-view">Tree View</link></emphasis>
de: Eine <emphasis role="bold"><link linkend="visualdict-tree-view">Baumansicht</link></emphasis>

source: A <emphasis role="bold"><link linkend="visualdict-check-box">Check Box</link></emphasis> that has been selected
de: Ein <emphasis role="bold"><link linkend="visualdict-check-box">Ankreuzfeld</link></emphasis>, das ausgewählt wurde

source: A pair of <emphasis role="bold"><link linkend="visualdict-spin-box">Spin Boxes</link></emphasis>
de: Eine Gruppe von <emphasis role="bold"><link linkend="visualdict-spin-box">Drehfeldern</link></emphasis>

source: A <emphasis role="bold"><link linkend="visualdict-menu-button">Menu Button</link></emphasis>
de: Ein <emphasis role="bold"><link linkend="visualdict-menu-button">Menüknopf</link></emphasis>

source: Even More &GUI; Elements
de: Noch mehr &GUI;-Elemente

source: This screenshot, from the &systemsettings; Default Applications panel, shows even more &GUI; elements. Click on part of the window to learn more about it.
de: Dieses Bildschirmfoto der Seite <guilabel>Standard-Komponenten</guilabel> aus den &systemsettings; zeigt weitere &GUI;-Elemente. Klicken Sie auf die nummerierten Bereiche des Fenster, um mehr darüber zu erfahren.

source: A <emphasis role="bold"><link linkend="visualdict-list-box">List Box</link></emphasis>
de: Ein <emphasis role="bold"><link linkend="visualdict-list-box">Listenfeld</link></emphasis>

source: A pair of <emphasis role="bold"><link linkend="visualdict-radio-button">Radio Buttons</link></emphasis>
de: Eine Gruppe von <emphasis role="bold"><link linkend="visualdict-radio-button">Auswahlknöpfen</link></emphasis>

source: A <emphasis role="bold"><link linkend="visualdict-text-box">Text Box</link></emphasis>
de: Ein <emphasis role="bold"><link linkend="visualdict-text-box">Textfeld</link></emphasis>

source: Some Combo Boxes
de: Einige Kombinationsfelder

source: Finally, this screenshot, from another <link linkend="visualdict-tab">tab</link> of the &systemsettings; Country/Region &amp; Language panel, shows five <emphasis role="bold"><link linkend="visualdict-combo-box">Combo Boxes</link></emphasis>
de: Zum Schluß dieses Bildschirmfoto von einer anderen <link linkend="visualdict-tab">Karteikarte</link> der Seite <guilabel>Land/Region &amp; Sprache</guilabel> aus den &systemsettings;. Es zeigt fünf <emphasis role="bold"><link linkend="visualdict-combo-box">Kombinationsfelder</link></emphasis>.

source: The Widgets
de: Die Oberflächenelemente

source: Description
de: Beschreibung

source: Screenshot
de: Bildschirmfoto

source: Central Widget
de: Zentrales Bedienelement

source: The main area of the running application. This might be the document you are editing in a word processor or the board of a game like Chess.
de: Der Hauptbereich einer laufenden Anwendung. Dies kann ein Dokument sein, das Sie in einem Textprogramm bearbeiten, oder auch ein Spielfeld in einem Schachspiel.

source: Button
de: Knopf

source: These can be clicked with the &LMB; to perform an action.
de: Klicken Sie darauf, um eine Aktion auszuführen.

source: Breadcrumb
de: Verknüpfungsansicht

source: Shows the path in a hierarchical system, such as a filesystem. Click on any part of the path to go up in the tree to that location. Click on the arrow to the right of part of the path to go to another child element of that path.
de: Zeigt den Pfad in einem hierarchischen System wie zum Beispiel in einem Dateisystem, Klicke Sie auf einen Teil des Pfads, um im Baum zu diesem Ort zu wechseln. Klicken Sie auf den Pfeil rechts neben dem Teil eines Pfads, um zu einem anderen Unterelement diese Pfads zu gehen.

source: Check Box
de: Ankreuzfeld

source: These can be clicked to select and unselect items. They are typically used in a list of several selections. Selected items typically display a check mark, whereas unselected items will have an empty box.
de: Hier können Elemente aus- und abgewählt werden. Ankreuzfelder werden typischerweise benutzt, um mehrere Einstellungen in einer Liste zu wählen. Ausgewählte Elemente werden mit einem Häkchen gekennzeichnet, bei nicht ausgewählten Elementen is das Feld leer.

source: Color Selector
de: Farbwähler

source: This allows a color to be selected for various purposes, such as changing the color of text. For more information, see <xref linkend="colors"/>
de: Mit diesem kann eine Farbe gesetzt werden, um zum Beispiel die Schriftfarbe eines Textes zu ändern. Weitere Informationen finden Sie im Abschnitt <xref linkend="colors"/>,

source: Combo Box
de: Kombinationsfeld

source: A combination of a <link linkend="visualdict-drop-down-box">Drop Down Box</link> and a <link linkend="visualdict-text-box">Text Box</link>. You can select an option from the list, or type in the text box. Some combo boxes may automatically complete entries for you, or open the list with a list of choices that match what you have typed.
de: Eine Kombination von <link linkend="visualdict-drop-down-box">Auswahlfeld</link> und <link linkend="visualdict-text-box">Textfeld</link>. Sie können ein Element aus der Liste wählen oder in das Textfeld eingeben. Einige Kombinationsfelder haben eine automatische Vervollständigung oder zeigen eine List mit Einträgen, die zu dem bereits eingegebenem Text passen.

source: Context Menu
de: Kontextmenü

source: Many user interface elements in the &kde-sc; contain a context menu, which can be opened by clicking on something with the &RMB;. This menu contains options and actions that usually affect the user interface element that was right-clicked.
de: Viele Benutzerelemente in der &kde-sc; haben ein Kontextmenü, das durch Klicken mit der &RMBn; geöffnet wird. Dieses Menü enthält Einträge und Aktionen speziell für das angeklickte Element.

source: Dialog Box
de: Dialog

source: A small window that appears above a larger application window. It may contain a message, warning, or configuration panel, among others.
de: Ein kleines Fenster, das über dem größeren Fenster einer Anwendung angezeigt wird. Es kann unter anderen eine Nachricht oder Warnung oder Einstellungen enthalten.

source: Drop Down Box
de: Auswahlfeld

source: This provides a list of items, from which you may select one.
de: Zeigt eine Liste mit Einträgen, aus dem Sie einen auswählen können.

source: Icon
de: Symbol

source: A graphical representation of something, such as a file or action. They typically, but not always, also contain a text description, either beneath or to the right of the icon.
de: Eine grafische Darstellung zum Beispiel einer Datei oder Aktion. Häufig ist auch zusätzlich ein Text mit einer Beschreibung vorhanden, entweder unter oder neben dem Symbol.

source: Icon List
de: Symbolliste

source: This provides a list of items represented by an <link linkend="visualdict-icon">Icon</link> and a description. It is typically used in the left panel of configuration panels to allow selection from various types of configuration categories.
de: Diese Listen bestehen aus einer Anzahl von <link linkend="visualdict-icon">Symbolen</link> mit der zugehörigen Beschreibung. Sie werden typischerweise im linken Bereich eines Einrichtungsdialogs verwendet, um eine Auswahl aus verschiedenen Kategorien von Einstellungen zu treffen.

source: List Box
de: Listenfeld

source: This is a list of items that typically allows multiple items to be selected. To select a group of contiguous items, press the &Shift; key and click the first and last items. To select multiple items that are not contiguous, press the &Ctrl; key and select the desired items.
de: Dies ist eine Liste von Elementen, in der typischerweise auch mehrere Einträge ausgewählt werden können. Um eine Gruppe aufeinander folgende Elemente zu wählen, drücken Sie die &Shift;taste und klicken auf das erste und letzte Element der gewünschten Auswahl. Um mehrere nicht aufeinander folgende Elemente zu wählen, drückte Sie die Taste &Ctrl; und klicken auf die gewünschten Einträge.

source: Menu
de: Menü

source: A list of selections, that usually perform an action, set an option, or opens a window. These can be opened from <link linkend="visualdict-menubar">menubars</link> or <link linkend="visualdict-menu-button">menu buttons</link>.
de: Eine Liste mit Einträgen, die normalerweise eine Aktion ausführen oder eine Einstellung festlegen. Sie können in <link linkend="visualdict-menubar">Menüs</link> oder in <link linkend="visualdict-menu-button">Menüknöpfen</link> aufgerufen werden.

source: Menubar
de: Menüleiste

source: These are located at the top of nearly every window and provide access to all the functions of the running application. For more information, see <xref linkend="menus"/>.
de: Menüleisten werden oben in fast allen Fenstern angezeigt, sie enthalten alle Aktionen und Funktionen eines laufenden Programms. Weitere Informationen dazu finden Sie im Abschnitt <xref linkend="menus"/>.

source: Menu Button
de: Menüknopf

source: A special type of <link linkend="visualdict-button">button</link> that opens a <link linkend="visualdict-menu">menu</link>.
de: Eine besondere Art von <link linkend="visualdict-button">Knopf</link>, mit dem ein <link linkend="visualdict-menu">Menü</link> geöffnet wird.

source: Panel <emphasis>or</emphasis> Sidebar <emphasis>or</emphasis> Tool View
de: Kontrollleiste <emphasis>oder</emphasis> Seitenleiste <emphasis>oder</emphasis>Werkzeug-Ansicht

source: These are located on the sides or bottom of the <link linkend="visualdict-central-widget">central widget</link> and allow you to perform many different tasks in an application. A text editor might provide a list of open documents in one, while a word processor might allow you to select a clip art image.
de: Diese Leisten sind an den Seiten oder unter dem <link linkend="visualdict-central-widget">zentralen Bereich</link> angeordnet. Mit den darin enthaltenen Einträgen können viele verschiedene Aufgaben in einer Anwendung ausgeführt werden. In einem Texteditor kann hier eine Liste der geöffneten Dokumente angezeigt werden, in einer Textverarbeitung können Sie zum Beispiel eine Grafik auswählen.

source: Progress Bar
de: Fortschrittsanzeige

source: A small bar that indicates that a long-running operation is being performed. The bar may indicate how much of the operation has completed, or it may simply bounce back and forth to indicate that the operation is in progress.
de: Eine schmale Leiste, die den Fortschritt einer länger dauernden Operation anzeigt. Es wird entweder der Prozentwert für den Anteil der bereits fertiggestellten Operation oder ein hin und her laufender Balken während der Ausführung der Operation angezeigt.

source: Radio Button
de: Auswahlknopf

source: These are used in a list of options, and only permit one of the options in the list to be selected.
de: Diese werden in einer Liste mit Optionen benutzt, dabei kann immer nur eine der angebotenen Optionen gewählt werden.

source: Scrollbar
de: Bildlaufleiste

source: Allows you to navigate a document.
de: Damit können Sie in einem Dokument navigieren.

source: Slider
de: Schieberegler

source: Allows a numeric value to be selected by moving a small bar either horizontally or vertically across a line.
de: Ermöglicht die Auswahl eines Zahlenwerts durch Verschieben einer schmalen Leiste entweder waagerecht oder senkrecht auf einer Linie.

source: Spin Box
de: Drehfeld

source: This permits a numerical value to be selected, either by using the up and down arrows to the right of the box to raise or lower the value, respectively, or by typing the value into the <link linkend="visualdict-text-box">text box</link>.
de: Dies erlaubt die Eingabe eines Zahlenwerts. Der Wert kann mit den beiden Pfeile rechts neben dem Feld vergrößert oder verkleinert werden. Außerdem kann der Wert direkt im Textfeld eingetragen werden.,

source: Status Bar
de: Statusleiste

source: These are located at the bottom of many applications and display information about what the application is currently doing. For instance, a web browser might indicate the progress of loading a web page, while a word processor might display the current word count.
de: Diese Leiste ist unten in vielen Anwendungen angeordnet. Sie zeigt Informationen über die Aktionen der gerade laufenden Anwendung. In einem Webbrowser kann hier zum Beispiel der Fortschritt beim Laden einer Webseite oder in einer Textverarbeitung die aktuelle Anzahl der Wörter angezeigt werden.

source: <entry>Tab</entry>
de: <entry>Karteireiter</entry>

source: These appear at the top of an area of a window, and permit that area of the window to be changed to a variety of different selections.
de: Diese erscheinen oben an einem Bereich eines Fensters, damit kann eine der sich überlagernden Karteikarten oder Unterfenster ausgewählt werden.

source: Text Area
de: Textbereich

source: Allows a large amount of text to be typed in, typically multiple lines or paragraphs. Unlike a <link linkend="visualdict-text-box">Text Box</link>, pressing &Enter; will usually result in a line break.
de: Hier kann ein längerer Text eingegeben werden, zum Beispiel mehrere Zeilen oder Absätze. Im Gegensatz zum <link linkend="visualdict-text-box">Textfeld</link> wird mit der Taste &Enter; ein Zeilenumbruch eingefügt.

source: Text Box
de: Textfeld

source: A single-line text entry that allows a small amount of text to be typed in. Typically, pressing &Enter; will perform the same action as clicking the <guibutton>OK</guibutton> button.
de: Ein einzeiliges Eingabefeld, um einen relativ kurzen Text einzugeben. Normalerweise führt das Drücken der Taste &Enter; die gleiche Aktion wie das Klicken auf den Knopf <guibutton>OK</guibutton> aus.

source: Titlebar
de: Titelleiste

source: This is located at the top of every window. It contains the name of the application and usually information about what the application is doing, like the title of the web page being viewed in a web browser or the filename of a document open in a word processor.
de: Diese Leiste befindet sich oben in jedem Fenster. Sie enthält den Namen der Anwendung und normalerweise weitere Informationen, wie zum Beispiel in einem Webbrowser der Titel der angezeigten Seite oder den Dateinamen des Geöffneten Dokuments in einer Textverarbeitung.

source: Toolbar
de: Werkzeugleiste

source: These are located near the top of many applications, typically directly underneath the <link linkend="visualdict-menubar">menu bar</link>. They provide access to many common functions of the running application, like <emphasis>Save</emphasis> or <emphasis>Print</emphasis>.
de: Diese Leisten befinden sich oben in einem Fenster, normalerweise direkt unter der <link linkend="visualdict-menubar">Menüleiste</link>. Sie enthalten Knöpfe für häufig gebrauchte Funktionen der laufenden Anwendung wie zum Beispiel <emphasis>Speichern</emphasis> oder <emphasis>Drucken</emphasis>.

source: Tree View
de: Baumansicht
