Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kde-runtime/fundamentals_install.po
Languages: de

source: Installing the &kde-sc;
de: &kde-sc; installieren

source: You can install the &kde-sc; on a variety of different platforms, ranging from smartphones and tablets to computers running &Microsoft; &Windows;, &MacOS;, &UNIX;, &BSD; or &Linux;. Binary packages are available for many different platforms and distributions, or advanced users may build the source code.
de: Sie können &kde-sc; auf vielen verschiedenen Plattformen von Smartphones über Tabletts bis zu Rechnern mit den Betriebssystemen &Microsoft; &Windows;, &MacOS;, &UNIX;, &BSD; oder &Linux;. Binärpakete werden für viele verschiedene Plattformen und Distributionen bereitgestellt, erfahrene Benutzer können die Software auch aus dem Quelltext kompilieren und installieren.

source: Installing Packages
de: Pakete installieren

source: Hundreds of developers worldwide have done a lot of work to make it easy to install &kde; on a variety of different devices and platforms.
de: Hunderte von Entwicklern haben weltweit viel Arbeit investiert, um die Installation von &kde; auf vielen verschiedenen Geräten und Plattformen zu erleichtern.

source: Nearly every &Linux; distribution provides binary packages for individual &kde-sc; applications and the &plasma-workspaces; as a whole.
de: Fast jede &Linux;-Distribution enthält binäre Pakete für einzelne &kde-sc;-Programme und auch dem gesamten &plasma-workspaces;.

source: To install an individual application, look for its name in your distribution's package collection. To install one of the &plasma-workspaces;, like &plasma-desktop;, look for a metapackage or package group, typically <literal>kde-desktop</literal>.
de: Um einzelne Programme zu installieren, suchen Sie nach deren Namen im Paketverwaltungsprogramm Ihrer Distribution. Um einen &plasma-workspaces; wie die &plasma-desktop; zu installieren, suchen Sie nach einem Metapaket oder einer Paketgruppe wie zum Beispiel <literal>kde-desktop</literal>.

source: Some core applications may be installed together with other core applications in a combined package named after the &kde; package they are provided in. For instance, &dolphin; might be found in the <literal>kde-baseapps</literal> package.
de: Einige Basisprogramme werden möglicherweise nur zusammen mit anderen wichtigen Programmen in einem gemeinsamen Paket installiert, das nach dem &kde;-Paket benannt ist, in dessen Quelltextarchiv diese Programme entwickelt werden. &dolphin; zum Beispiel finden Sie im Paket <literal>kde-baseapps</literal>.

source: If you have trouble locating &kde; packages for your distribution, please contact their support resources. Many distributions also have a team dedicated to packaging &kde; that can provide assistance specific to &kde;
de: Haben Sie Probleme, &kde;-Pakete für Ihre Distribution zu finden, nehmen Sie Kontakt zu deren Unterstützungsgruppen auf. In vielen Distributionen gibt es außerdem eine Gruppe, die Pakete für die Distribution erstellt. In dieser Gruppe finden Sie Hilfe bei Problemen mit &kde;.

source: The &kde; on Windows Initiative provides binary packages of &kde-sc; applications for &Microsoft; &Windows;. They also provide a special installer application that permits you to install individual applications or groups and all necessary dependencies easily.
de: Die Initiative „&kde; für &Windows;“ stellt kompilierte Pakete von Programmen der &kde-sc; für &Microsoft; &Windows; bereit. Es gibt auch einen spezielles Installationsprogramm, das die Installation einzelner Programme oder Gruppen sowie aller dafür erforderlichen Bibliotheken vereinfacht.

source: For more information on the initiative and to download the installer, visit <ulink url="http://windows.kde.org/">the KDE on Windows Initiative</ulink>.
de: Weitere Informationen über KDE unter Windows und das Herunterladen des Installationsprogramms finden Sie auf der Webseite <ulink url="http://windows.kde.org/">KDE unter Windows</ulink>.

source: Individual &kde-sc; applications can be installed through several different <quote>ports</quote> systems available for &MacOS;. Several different &kde; applications also provide their own binary builds for &MacOS;.
de: Einzelne Programme der &kde-sc; können mit mehreren verschiedenen <quote>Ports</quote>-Systemen für &MacOS; installiert werden. Einige &kde;-Programme stellen auch eigene Binärpakete für &MacOS; bereit.

source: For more information, visit <ulink url="http://mac.kde.org/">&kde; on &MacOS;X</ulink>.
de: Weitere Informationen finden Sie auf der Internetseite <ulink url="http://mac.kde.org/">&kde; für &MacOS;X</ulink>.

source: Most &BSD; distributions allows you to install &kde-sc; applications and the &plasma-workspaces; as a whole through their <quote>ports</quote> system.
de: Die meisten &BSD;-Distributionen ermöglichen die Installation von Programmen der &kde-sc; und dem gesamten &plasma-workspaces; durch das <quote>Ports</quote>-System.

source: For more information on installing ports, see your &BSD; distribution's documentation.
de: Weitere Informationen zur Installation von Ports finden Sie in der Dokumentation der &BSD;-Distribution.

source: Mobile Devices
de: Mobile Geräte

source: &plasma-active; is an exciting initiative to bring a new &kde; experience to mobile devices like smartphones or tablets. Binary releases are provided for several different devices.
de: &plasma-active; ist eine sehr interessante Initiative, die &kde; für mobile Geräte wie Smartphones oder Tablett-Rechner bereit stellt. Es gibt kompilierte Pakete für mehrere Geräte.

source: For more information, visit <ulink url="http://plasma-active.org/">&plasma-active;</ulink>.
de: Weitere Informationen finden Sie auf der Internetseite <ulink url="http://plasma-active.org/">&plasma-active;</ulink>.

source: Live Media
de: Live-Medien

source: Several &Linux; and &BSD; distributions offer live media. This permits you to try out the &plasma-workspaces; without installing anything to your system. All you have to do insert a CD or connect a USB drive and boot from it. If you like what you see, most offer an option to install it to your hard drive.
de: Für mehrere &Linux;- und &BSD;-Distributionen gibt es Live-Medien. Damit können Sie den &plasma-workspaces; ohne Installation auf Ihrem System ausprobieren. Sie müssen nur eine CD einlegen oder einen USB-Stick einstecken und damit den Rechner hochfahren. Gefällt Ihnen das System, gibt es bei den meisten Live-Medien eine Möglichkeit, das System auf Ihre Festplatte zu installieren.

source: There is <ulink url="http://www.kde.org/download/distributions.php">a list of distributions that offer the &kde-sc; on live media</ulink> on the &kde; website.
de: Auf der &kde;-Webseite finden Sie eine <ulink url="http://www.kde.org/download/distributions.php">Liste von Distributionen mit &kde-sc; auf Live-Medien</ulink>.

source: Building from Source Code
de: Kompilieren und Installieren aus dem Quelltext

source: For detailed information on how to compile and install &kde; applications see <ulink url="http://techbase.kde.org/Getting_Started#Building_and_Running_KDE_Software_From_Source"> Building and Running &kde; Software From Source on &kde; TechBase</ulink>.
de: Ausführliche Informationen zum Kompilieren und Installieren von &kde;-Programmen finden Sie auf <ulink url="http://techbase.kde.org/Getting_Started#Building_and_Running_KDE_Software_From_Source">&kde;-Software aus dem Quelltext kompilieren und installieren</ulink> auf der &kde;-TechBase.

source: Since &kde; software uses <command>cmake</command> you should have no trouble compiling it. Should you run into problems please report them to the &kde; mailing lists.
de: Da &kde; Software <command>cmake</command> verwendet, sollte es dabei keine Schwierigkeiten geben. Sollten dennoch Probleme auftreten, wenden Sie sich bitte an die &kde;-Mailinglisten.
