Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kde-runtime/fundamentals_config.po
Languages: de

source: Customizing &kde; software
de: &kde;-Software anpassen

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Burkhard</firstname><surname>Lück</surname><affiliation><address><email>lueck@hube-lueck.de</email></address></affiliation><contrib>Übersetzung</contrib></othercredit>

source: Customizing Toolbars
de: Anpassung der Werkzeugleisten

source: The &gwenview; Toolbar
de: Die &gwenview;-Werkzeugleiste

source: The &gwenview; toolbar.
de: Die &gwenview;-Werkzeugleiste.

source: The toolbar in <ulink url="http://kde.org/applications/graphics/gwenview/">&gwenview;</ulink>.
de: Die Werkzeugleiste in <ulink url="http://kde.org/applications/graphics/gwenview/">&gwenview;</ulink>.

source: Modifying Toolbar Items
de: Einträge der Werkzeugleisten ändern

source: To customize an application's toolbars, go to <menuchoice><guimenu>Settings</guimenu><guimenuitem>Configure Toolbars...</guimenuitem></menuchoice> or right-click on a toolbar and select <guimenuitem>Configure Toolbars...</guimenuitem>.
de: Um die Werkzeugleisten für ein Programm anzupassen, wählen Sie <menuchoice><guimenu>Einstellungen</guimenu><guimenuitem>Werkzeugleisten einrichten ...</guimenuitem></menuchoice> oder klicken Sie mit der &RMBn; auf eine Werkzeugleiste und wählen im Kontextmenü <guimenuitem>Werkzeugleisten einrichten ...</guimenuitem>

source: On the left side of the toolbar configuration panel, the available items that you can put in your toolbar are shown. On the right, the ones that already appear on the toolbar are shown. At the top, you can select the toolbar you wish to modify or view.
de: Auf der linken Seite des Einrichtungsfensters für Werkzeugleisten werden alle verfügbaren Aktion aufgeführt, die in eine Werkzeugleiste aufgenommen werden können. Rechts werden die bereits in der Werkzeugleiste vorhandenen Aktionen angezeigt. Oben kann eine Werkzeugleiste ausgewählt werden, um deren Einträge anzuzeigen oder zu bearbeiten.

source: Above each side of the panel there is a <guilabel>Filter</guilabel> text box you can use to easily find items in the list.
de: Über beiden Listen mit den Aktionen gibt es ein Textfeld <guilabel>Filter</guilabel>, mit dem Aktionen in den Listen leicht zu finden sind.

source: The Customize Toolbars Window
de: Der Dialog zur Einrichtung von Werkzeugleisten

source: The Customize Toolbars window.
de: Der Dialog zur Einrichtung von Werkzeugleisten.

source: The Customize Toolbars window in &gwenview; with the <guibutton>Previous</guibutton> button selected.
de: Der Dialog zur Einrichtung von Werkzeugleisten in &gwenview; mit der ausgewählten Aktion <guibutton>Vorheriges</guibutton>.

source: Adding an Item
de: Einen Eintrag hinzufügen

source: You can add an item to your toolbar by selecting it from the left side and clicking on the right arrow button.
de: Sie können eine Aktion zur Werkzeugleiste hinzufügen, indem Sie sie in der linken Liste auswählen und dann auf Knopf <guibutton>Pfeil rechts</guibutton> drücken.

source: Removing an Item
de: Einen Eintrag entfernen

source: You can remove an item by selecting it and clicking the left arrow button.
de: Sie können eine Aktion aus der Werkzeugleiste entfernen, indem Sie sie in der rechten Liste auswählen und dann auf Knopf <guibutton>Pfeil links</guibutton> drücken.

source: Changing the Position of Items
de: Die Position eines Eintrags ändern

source: You can change the position of the items by moving them lower or higher in the list. To move items lower, press the down arrow button, while to move items higher press the up arrow button. You can also change items' position by dragging and dropping them.
de: Sie können die Position von Aktionen in einer Werkzeugleiste ändern, indem Sie die Aktion in der rechten Liste nach unten oder nach oben verschieben. Mit dem Knopf <guibutton>Pfeil abwärts</guibutton> verschieben Sie eine Aktion nach unten und mit dem Knopf <guibutton>Pfeil aufwärts</guibutton> nach oben. Außerdem können Sie die Position einer Aktion durch Ziehen und Ablegen verändern.

source: On horizontal toolbars, the item that's on top will be the one on the left. On vertical toolbars, items are arranged as they appear in the toolbar.
de: In waagerechten Werkzeugleisten wird die oberste Aktion ganz links und in senkrechten Werkzeugleisten wie im Einrichtungsdialog angezeigt.

source: Adding a Separator
de: Eine Trennlinie hinzufügen

source: You can add separator lines between items by adding a <guilabel>--- separator ---</guilabel> item to the toolbar.
de: Sie können Trennlinien in Werkzeugleisten zwischen den Aktionen einfügen, indem Sie einen <guilabel>--- Trenner ---</guilabel> zur Werkzeugleiste hinzufügen.

source: Restoring Defaults
de: Voreinstellungen wiederherstellen

source: You can restore your toolbar to the way it was when you installed the application by pressing the <guibutton>Defaults</guibutton> button at the bottom of the window and then confirming your decision.
de: Sie können eine Werkzeugleiste wieder auf den Zustand bei der Installation des Programms zurücksetzen. Drücken Sie dazu auf den Knopf <guibutton>Voreinstellungen</guibutton> und bestätigen Sie diese Aktion.

source: Changing Text and Icons
de: Text und Symbole ändern

source: You can change the icon and text of individual toolbar items by selecting an item and clicking either the <guibutton>Change Icon...</guibutton> or <guibutton>Change Text...</guibutton> button.
de: Das Symbol und den Text einzelner Elemente in einer Werkzeugleiste ändern, indem Sie das Element auswählen und entweder auf den Knopf <guibutton>Symbol ändern ...</guibutton> oder <guibutton>Text ändern ...</guibutton> klicken.

source: Customizing Toolbar Appearance
de: Anpassung des Erscheinungsbilds von Werkzeugleisten

source: You can change the appearance of toolbars by right-clicking on a toolbar to access it's context menu.
de: Um das Erscheinungsbild von Werkzeugleisten zu ändern, öffnen Sie durch Klicken mit der &RMBn; auf die Werkzeugleiste das Kontextmenü.

source: You can change the appearance of text on toolbars in the <guisubmenu>Text Position</guisubmenu> submenu of a toolbar's context menu.
de: Im Untermenü <guisubmenu>Textposition</guisubmenu> des Kontextmenüs einer Werkzeugleiste kann das Erscheinungsbild von Text in der Werkzeugleiste geändert werden.

source: You can choose from:
de: Folgende Einstellungen können ausgewählt werden:

source: <guimenuitem>Icons</guimenuitem> - only the icon for each toolbar item will appear.
de: <guimenuitem>Symbole</guimenuitem> - Es werden nur die Symbole für jeden Eintrag in der Werkzeugleiste angezeigt.

source: <guimenuitem>Text</guimenuitem> - only the text label for each toolbar item will appear.
de: <guimenuitem>Text</guimenuitem> - Es werden nur die Beschriftungen für jeden Eintrag in der Werkzeugleiste angezeigt.

source: <guimenuitem>Text Alongside Icons</guimenuitem> - the text label will appear to the right of each toolbar item's icon
de: <guimenuitem>Text neben Symbolen</guimenuitem> - Der Text wird rechts neben dem Symbol jedes Eintrags in der Werkzeugleiste angezeigt.

source: <guimenuitem>Text Under Icons</guimenuitem> - the text label will appear underneath each toolbar item's icon
de: <guimenuitem>Text unter Symbolen</guimenuitem> - Der Text wird unter dem Symbol jedes Eintrags in der Werkzeugleiste angezeigt.

source: You can also show or hide text for individual toolbar items by right-clicking on an item and checking or unchecking the item under <guilabel>Show Text</guilabel>.
de: Für einzelne Einträge kann der Text ausgeblendet oder angezeigt werden, indem Sie mit der &RMBn; auf einen Eintrag klicken und den Text unter <guilabel>Text anzeigen</guilabel> markieren oder diese Markierung entfernen.

source: Icon Size
de: Symbolgröße

source: You can change the size of toolbar items' icons by selecting <guisubmenu>Icon Size</guisubmenu> from the toolbar's context menu.
de: Die Größe der Symbole in der Werkzeugleiste können Sie ändern, indem Sie <guisubmenu>Symbolgröße</guisubmenu> aus dem Kontextmenü der Werkzeugleiste wählen.

source: You can choose from the following options: (each lists the icon size in pixels)
de: Folgende Einstellungen können ausgewählt werden, dabei wird die Symbolgröße in Pixeln angegeben:

source: Small (16x16)
de: Klein (16×16)

source: <guimenuitem>Medium (22x22)</guimenuitem> [the default value]
de: <guimenuitem>Mittel (22x22)</guimenuitem> - die Standardeinstellung

source: Large (32x32)
de: Groß (32×32)

source: Huge (48x48)
de: Sehr groß (48x48)

source: Moving Toolbars
de: Werkzeugleisten verschieben

source: In order to move toolbars, you must <quote>unlock</quote> them. To do so, uncheck <guimenuitem>Lock Toolbar Positions</guimenuitem> from a toolbar's context menu. To restore the lock, simply recheck this menu item.
de: Nur <emphasis>nicht</emphasis> <quote>gesperrte</quote> Werkzeugleisten können verschoben werden. Dazu entfernen Sie die Markierung für <guimenuitem>Werkzeugleisten sperren</guimenuitem> im Kontextmenü. Um die Werkzeugleiste zu sperren, markieren Sie diesen Menüeintrag wieder.

source: You can change a toolbar's position from the <guisubmenu>Orientation</guisubmenu> submenu of its context menu.
de: Die Anordnung der Werkzeugleiste im Programmfenster kann mit dem Eintrag <guisubmenu>Ausrichtung</guisubmenu> im Kontextmenü festgelegt werden.

source: <guimenuitem>Top</guimenuitem> [the default in many applications]
de: <guimenuitem>Oben</guimenuitem> - die Voreinstellung in vielen Programmen

source: Left
de: Links

source: Right
de: Rechts

source: Bottom
de: Unten

source: You can also move a toolbar by clicking and holding onto the dotted line at the left of horizontal toolbars or the top of vertical toolbars and dragging it to your desired location.
de: Eine Werkzeugleiste kann auch verschoben werden, indem Sie mit der &LMBn; auf die gestrichelte Linie links bei waagerechten und oben bei senkrechten Werkzeugleisten klicken, die Taste gedrückt halten und die Leiste an den gewünschten Platz verschieben.

source: Show/Hide Toolbars
de: Werkzeugleisten anzeigen oder ausblenden

source: If your application has only one toolbar, you can hide a toolbar by deselecting <guimenuitem>Show Toolbar</guimenuitem> from either the toolbar's context menu or the <guimenu>Settings</guimenu> menu. To restore the toolbar, select <guimenuitem>Show Toolbar</guimenuitem> from the <guimenu>Settings</guimenu> menu. Note that toolbars must be <quote>unlocked</quote> to hide them from their context menu; see <xref linkend="toolbars-appearance-move"/> for more information.
de: Gibt es in der Anwendung nur eine Werkzeugleiste, dann kann sie ausgeblendet werden, indem die Markierung für <guimenuitem>Werkzeugleiste anzeigen</guimenuitem> entweder aus dem Kontextmenü der Werkzeugleiste oder dem Menü <guimenu>Einstellungen</guimenu> entfernen. Um die Werkzeugleiste wieder einzublenden, markieren Sie <guimenuitem>Werkzeugleiste anzeigen</guimenuitem> wieder. Beachten Sie, dass die Werkzeugleiste nicht <quote>gesperrt</quote> sein darf, damit dieser Eintrag im Kontextmenü vorhanden ist. Weitere Informationen finden Sie unter <xref linkend="toolbars-appearance-move"/>

source: If your application has more than one toolbar, a submenu called <guisubmenu>Toolbars Shown</guisubmenu> will appear in the context menu and <guimenu>Settings</guimenu> menu instead of the above menu entry. From that menu you may select individual toolbars to hide and show.
de: Hat ein Programm mehr als eine Werkzeugleiste, ist ein Untermenü <guisubmenu>Angezeigte Werkzeugleisten</guisubmenu> im Kontextmenü und im Menü <guimenu>Einstellungen</guimenu> statt des oben genannten Menüeintrags. In diesem Untermenü können einzelne Werkzeugleisten ein- oder ausgeblendet werden.

source: Thanks and Acknowledgments
de: Danksagungen

source: Thanks to an anonymous Google Code-In 2011 participant for writing much of this section.
de: Dank geht an den anonymen „Google Code-In 2011“-Teilnehmer, der den Hauptteil diese Abschnitts geschrieben hat.

source: Using and Customizing Shortcuts
de: Kurzbefehle benutzen und anpassen

source: Introduction
de: Einführung

source: Many &kde; applications allow you to configure keyboard shortcuts. To open the standard keyboard shortcuts configuration panel, go to <menuchoice><guimenu>Settings</guimenu><guimenuitem>Configure Shortcuts...</guimenuitem></menuchoice>.
de: In vielen &kde;-Anwendungen können Kurzbefehle eingerichtet werden. Um den Standarddialog für Kurzbefehle zu öffnen, wählen Sie <menuchoice><guimenu>Einstellungen</guimenu><guimenuitem>Kurzbefehle festlegen ...</guimenuitem></menuchoice>.

source: In the Configure Shortcuts window, you will see a list of all the shortcuts available in the current application. You can use the search box at the top to search for the shortcut you want.
de: Im Einrichtungsdialog wird eine Liste aller verfügbaren Kurzbefehle der geöffneten Anwendung angezeigt. Mit dem Filterfeld oben können Sie nach Kurzbefehlen suchen.

source: The Customize Shortcuts Window
de: Der Dialog zur Anpassung von Kurzbefehlen

source: The Customize Shortcuts window.
de: Der Dialog zur Anpassung von Kurzbefehlen.

source: Searching for shortcuts with <userinput>file</userinput> in <ulink url="http://kde.org/applications/system/dolphin/">&dolphin;</ulink>.
de: Suche nach Kurzbefehlen mit <userinput>Datei</userinput> in <ulink url="http://kde.org/applications/system/dolphin/">&dolphin;</ulink>.

source: Changing a Shortcut
de: Änderung eines Kurzbefehls

source: To change a shortcut, first click on the name of a shortcut you want to change. You will see a radio group where you can choose whether to set the shortcut to its default value, or select a new shortcut for the selected action. To set a new shortcut, choose <guilabel>Custom</guilabel> and click on the button next to it. Then just type the shortcut you would like to use, and your changes will be saved.
de: Um einen Kurzbefehl zu ändern oder festzulegen, klicken Sie zuerst auf dessen Namen. Dann werden zwei Auswahlknöpfe angezeigt. Mit dem ersten kann ein Kurzbefehl auf die Voreinstellung zurückgesetzt werden, mit dem zweiten Knopf ein neuer Kurzbefehl für die ausgewählte Aktion festgelegt werden. Dazu klicken Sie auf <guilabel>Benutzerdefiniert</guilabel> und dann auf den Knopf rechts daneben. Geben Sie dann die gewünschte Tastenkombination auf der Tastatur ein und diese Änderung wird gespeichert.

source: Setting a Shortcut
de: Kurzbefehle eingeben

source: The Customize Shortcuts window demonstrating how to set a shortcut.
de: Der Dialog zur Anpassung von Kurzbefehlen zeigt, wie ein Kurzbefehl eingegeben wird.

source: Resetting Shortcuts
de: Kurzbefehle zurücksetzen

source: There is a button at the bottom of the window, called <guibutton>Reset to Defaults</guibutton>. Clicking on this button will reset all your custom shortcuts to their default values.
de: Unten im Dialog gibt es einen Knopf <guibutton>Auf Voreinstellungen zurücksetzen</guibutton>. Damit werden alle benutzerdefinierten Kurzbefehle wider auf die Standardwerte zurückgesetzt.

source: You can also reset an individual shortcut to its default value by selecting it, and choosing the <guilabel>Default</guilabel> radio button.
de: Auch einzelne Kurzbefehle können auf die Voreinstellung zurückgesetzt werden, indem Sie sei Auswählen und auf den Auswahlknopf <guilabel>Standard</guilabel> klicken.

source: Removing a Shortcut
de: Kurzbefehle entfernen

source: To remove a shortcut, select it from the list, then click the remove icon (a black arrow with a cross) to the right of the button that allows you to select a shortcut.
de: Um einen Kurzbefehl zu entfernen, wählen Sie ihn in der Liste und klicken dann auf das Symbol des schwarzen Pfeils mit dem weißen Kreuz darauf rechts neben dem Knopf, mit dem Sie einen Kurzbefehl auswählen können.

source: <title>Working with Schemes</title>
de: <title>Schemata verwenden</title>

source: Schemes are keyboard shortcuts configuration profiles, so you can create several profiles with different shortcuts and switch between these profiles easily.
de: Schemata sind Einrichtungsprofile für Kurzbefehle. Sie können mehrere Profile mit verschiedenen Kurzbefehlen erstellen und dann zwischen den Profilen wechseln.

source: This feature is under development. It is not possible to import schemes using a &GUI; at this time.
de: Diese Funktion ist noch in der Entwicklung. Zur Zeit können Schemata noch nicht mit einer grafischen Bedienungsoberfläche importiert werden.

source: <screeninfo>Working with Schemes</screeninfo>
de: <screeninfo>Schemata verwenden</screeninfo>

source: The Customize Shortcuts window displaying the scheme editing tools.
de: Der Dialog zur Anpassung von Kurzbefehlen zeigt die Bearbeitungswerkzeuge für Schemata.

source: Editing a scheme called <userinput>work</userinput>.
de: Bearbeitung eines Schemas mit dem Namen <userinput>Arbeit</userinput>.

source: To see a menu allowing you to edit schemes, click on the <guibutton>Details</guibutton> button at the bottom of the form. The following options will appear:
de: Um ein Menü zur Bearbeitung von Schemata zu öffnen, klicken Sie auf den Knopf <guibutton>Details</guibutton> unten im Dialog. Dann werden folgende Einstellungen zur Auswahl angeboten:

source: Current Scheme
de: Aktuelles Schema

source: Allows you to switch between your schemes.
de: Mit den Einträgen im Auswahlfeld können Sie zu einem anderen Schema wechseln.

source: New...
de: Neu ...

source: Creates a new scheme. This opens a window that lets you select a name for your new scheme.
de: Erstellt ein neues Schema. Damit öffnen Sie einen Dialog, in dem Sie einen Namen für Ihr neues Schema eingeben können.

source: Delete
de: Löschen

source: Deletes the current scheme.
de: Löscht das aktuelle Schema.

source: More Actions
de: Weitere Aktionen

source: Opens the following menu:
de: Dies öffnet das folgende Menü:

source: Save as Scheme Defaults
de: Als Schema-Voreinstellung festlegen

source: Sets the current scheme as the default for all new schemes.
de: Stellt das aktuelle Schema als Standard für alle neuen Schemata ein.

source: Export Scheme...
de: Schema exportieren ...

source: Exports the current scheme to a file named <filename><replaceable>applicationname</replaceable><replaceable>schemename</replaceable>shortcuts.rc</filename>.
de: Exportiert das aktuelle Schema in eine Datei mit dem Namen <filename><replaceable>applicationname</replaceable><replaceable>schemename</replaceable>shortcuts.rc</filename>.

source: Move this file to the folder <filename class="directory">$KDEDIR/apps/applicationname/</filename> and the exported scheme will be available in the drop down box labelled <guilabel>Current Scheme</guilabel>
de: Verschieben Sie diese Datei in den Ordner <filename class="directory">$KDEDIR/apps/applicationname/</filename>, dann kann das exportierte Schema im Auswahlfeld <guilabel>Aktuelles Schema</guilabel> eingestellt werden.

source: Printing Shortcuts
de: Kurzbefehle drucken

source: You can print out a list of shortcuts for easy reference by clicking the <guibutton>Print</guibutton> button at the bottom of the window.
de: Sie können eine Liste der Kurzbefehle als Referenz ausdrucken, indem Sie auf den Knopf <guibutton>Drucken</guibutton> unten im Dialog klicken.

source: Special thanks to Google Code-In 2011 participant Alexey Subach for writing much of this section.
de: Besonderer Dank geht an den „Google Code-In 2011“-Teilnehmer Alexey Subach, der den Hauptteil diese Abschnitts geschrieben hat.
