Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kde-runtime/fundamentals_tasks.po
Languages: de

source: The Folder View supports a limited set of file operations, which can be accessed by right-clicking on a file to access its context menu, or using keyboard shortcuts. The following items are available in the context menu:
de: Die Ordneransicht erlaubt eine begrenzte Anzahl von Dateioperationen. Diese finden Sie im Kontextmenü, das durch Klicken mit der &RMBn; auf ein Element geöffnet wird, oder Sie verwenden die Kurzbefehle. Folgende Einträge enthält das Kontextmenü:

source: Create New...
de: Neu erstellen ...

source: Create a new file or folder.
de: Erstellt eine neue Datei oder einen neuen Ordner.

source: <guimenuitem>Move to Trash...</guimenuitem> (<keycombo action="simul"><keycap>Del</keycap></keycombo>)
de: <guimenuitem>In den Papierkorb werfen ...</guimenuitem> (<keycombo action="simul"><keycap>Entf</keycap></keycombo>)

source: Move the currently selected item to the trash.
de: Verschiebt die momentan ausgewählten Elemente in den Papierkorb.

source: Sorting
de: Sortierung

source: This submenu can also be accessed from the toolbar, and is described in <xref linkend="files-ui-toolbar-options-sorting"/>.
de: Dieses Untermenü lässt sich auch in der Werkzeugleiste öffnen, es wird im Abschnitt <xref linkend="files-ui-toolbar-options-sorting"/> beschrieben.

source: View
de: Ansicht

source: This submenu can also be accessed from the toolbar, and is described in <xref linkend="files-ui-toolbar-options-view"/>.
de: Dieses Untermenü lässt sich auch in der Werkzeugleiste öffnen, es wird im Abschnitt <xref linkend="files-ui-toolbar-options-view"/> beschrieben.

source: Open File Manager
de: Dateimanager öffnen

source: Opens the current folder in your default file manager application.
de: Öffnet den aktuellen Ordner im Standard-Dateiverwaltungsprogramm.

source: <guimenuitem>Properties</guimenuitem> (<keycombo action="simul">&Alt;&Enter;</keycombo>)
de: <guimenuitem>Eigenschaften</guimenuitem> (<keycombo action="simul">&Alt;&Enter;</keycombo>)

source: Open the Properties window that allows you to view and modify various types of metadata related to the currently selected file.
de: Öffnet den Dialog Eigenschaften, in dem Sie die verschiedenen Arten von Metadaten der aktuell ausgewählten Datei ansehen und ändern können.

source: The Preview Pane
de: Der Vorschaubereich

source: If enabled, this displays a preview of the currently highlighted file.
de: Wenn diese Einstellung aktiv ist, wird eine Vorschau der gerade hervorgehobenen Datei angezeigt.

source: The <guilabel>Name</guilabel> Entry
de: Der Eintrag <guilabel>Name</guilabel>

source: When a file is selected, a name will appear in this text box. You may also manually enter a file name or path in this text box.
de: Wenn eine Datei oder ein Ordner ausgewählt ist, wird der Name in diesem Eingabefeld angezeigt. Sie können hier auch manuell einen Dateinamen oder einen Pfad eingeben.

source: The <guilabel>Filter</guilabel> Entry
de: Der Eintrag <guilabel>Filter</guilabel>

source: When opening a file, the <guilabel>Filter</guilabel> entry allows you to enter a filter for the files displayed in the folder view. The filter uses standard globs; patterns must be separated by white space. For instance, you can enter <userinput>*.cpp *.h *.moc</userinput> to display several different common &Qt; programming files.
de: Wenn Sie eine Datei öffnen möchten, können Sie mit einem Eintrag im Feld <guilabel>Filter</guilabel> die in der Ordneransicht gezeigten Dateien einschränken. Im Filterfeld können die üblichen Muster verwendet werden. Als Trennung zwischen Mustern wird das Leerzeichen verwendet. Sie können zum Beispiel <userinput>*.cpp *.h *.moc</userinput> eintragen, um nur die oft bei der Programmierung mit &Qt; benutzten Quelltextdateien anzuzeigen.

source: To display all files, enter a single asterisk (<userinput>*</userinput>).
de: Um alle Dateien anzuzeigen, geben Sie einen einzelnen Stern (<userinput>*</userinput>) ein.

source: The filter entry saves the last 10 filters entered between sessions. To use one, press the arrow button on the right of the entry and select the desired filter string. You can disable the filter by pressing the <guibutton>Clear text</guibutton> button to the left of the autocompletion arrow button.
de: Der Filtereintrag speichert die letzten zehn benutzten Filter. Um darauf zuzugreifen, klicken Sie auf den kleinen Pfeil rechts im Filtereintrag. Um das Filtern auszuschalten, klicken Sie auf das Symbol <guibutton>Text löschen</guibutton> links neben dem Pfeil für die automatische Vervollständigung.

source: When saving a file, the <guilabel>Filter</guilabel> entry will instead display a drop down box that allows you to select from all the file types the application supports. Select one to save a file in that format.
de: Beim Speichern zeigt der <guilabel>Filter</guilabel> stattdessen ein Auswahlfeld, mit dem Sie aus allen Dateitypen wählen können, die das Programm unterstützt. Wählen Sie einem Eintrag aus, um die Datei in diesem Format zu speichern.

source: Automatically select filename extension
de: Dateierweiterung automatisch auswählen

source: When saving a file, this check box will appear. When selected (the default), the application will automatically append the default file extension for the selected file type to the end of the file name, if it does not already appear in the <guilabel>Name</guilabel> entry. The file extension that will be used is listed in parenthesis at the end of the check box label.
de: Beim Speichern einer Datei wird dieses Ankreuzfeld angezeigt. Ist diese Einstellung wie in der Voreinstellung aktiviert, wird automatisch die Standarderweiterung für den ausgewählten Dateityp an den Dateinamen angehängt, wenn die Erweiterung noch nicht im Eintrag <guilabel>Name</guilabel> vorhanden ist. Die verwendete Dateierweiterung wird in Klammern am Ende der Beschriftung des Ankreuzfeldes angezeigt.

source: The File Save Window
de: Der Dialog <quote>Datei speichern</quote>

source: The File Save window.
de: Der Dialog <quote>Datei speichern</quote>.

source: Saving a file in <ulink url="http://kde.org/applications/internet/konqueror/">&konqueror;</ulink>.
de: Speichern einer Datei in <ulink url="http://kde.org/applications/internet/konqueror/">&konqueror;</ulink>.

source: The <guibutton>Open</guibutton> or <guibutton>Save</guibutton> Button
de: Der Knopf <guibutton>Öffnen</guibutton> oder <guibutton>Speichern</guibutton>.

source: Depending on the action being performed, an <guibutton>Open</guibutton> or <guibutton>Save</guibutton> button will be displayed. Clicking on this button will close the file selection window and perform the requested action.
de: Abhängig von der ausgeführten Aktion wird ein Knopf <guibutton>Öffnen</guibutton> oder <guibutton>Speichern</guibutton> angezeigt. Klicken Sie auf diesen Knopf, um den Dialog zu schließen und die gewünschte Aktion auszuführen.

source: The <guibutton>Cancel</guibutton> Button
de: Der Knopf <guibutton>Abbrechen</guibutton>

source: Clicking <guibutton>Cancel</guibutton> will close the file dialog without performing any action.
de: Klicken Sie auf <guibutton>Abbrechen</guibutton>, wird der Dialog geschlossen, ohne eine Aktion auszuführen.

source: Thanks and Acknowledgments
de: Danksagungen

source: Special thanks to Google Code-In 2011 participant Alexey Subach for writing parts of this section.
de: Besonderer Dank geht an den „Google Code-In 2011“-Teilnehmer Alexey Subach, der Teile dieses Abschnitts geschrieben hat.

source: Check Spelling
de: Rechtschreibprüfung

source: &sonnet; is the spelling checker used by &kde; applications such as &kate;, &kmail;, and &kword;. It is a &GUI; frontend to various free spell checkers.
de: &sonnet; ist das Rechtschreibprogramm, das von den &kde;-Programmen wie &kate;, &kmail; und &kword; verwendet wird. Es handelt sich um eine Benutzeroberfläche zu verschiedenen freien Rechtschreibprogrammen.

source: To use &sonnet; you need to install a spell checker like <application>&GNU; Aspell</application>, <application>Enchant</application>, <application>Hspell</application>, <application>ISpell</application> or <application>Hunspell</application> and additionally the corresponding dictionaries for the languages that you wish to use.
de: Um &sonnet; zu benutzen, müssen Sie ein Programm zur Rechtschreibprüfung wie <application>&GNU; Aspell</application>, <application>Enchant</application>, <application>Hspell</application>, <application>ISpell</application> oder <application>Hunspell</application> und zusätzlich die passenden Wörterbücher für die gewünschten Sprachen installieren.

source: The Check Spelling Window
de: Der Dialog <quote>Rechtschreibprüfung</quote>

source: The Check spelling window.
de: Der Dialog <quote>Rechtschreibprüfung</quote>.

source: Correcting a misspelling.
de: Korrektur eines falsch geschriebenen Worts.

source: To check spelling, go to <menuchoice><guimenu>Tools</guimenu> <guimenuitem>Spelling...</guimenuitem></menuchoice>.
de: Um die Rechtschreibung zu überprüfen, wählen Sie <menuchoice><guimenu>Extras</guimenu> <guimenuitem>Rechtschreibung ...</guimenuitem></menuchoice>

source: If a word is possibly misspelled in your document, it is displayed in the top line in the dialog. &sonnet; tries to appropriate word(s) for replacement. The best guess is displayed to the right of <guilabel>Replace with</guilabel>. To accept this replacement, click on <guibutton>Replace</guibutton>.
de: Ist ein Wort in Ihrem Dokument möglicherweise falsch geschrieben, wird es in der obersten Zeile des Dialog angezeigt. &sonnet; schlägt passende Wörter als Ersatz des falsch geschriebenen Wortes vor. Das am besten passende Wort wird rechts neben <guilabel>Ersetzen mit</guilabel> angezeigt. Um diesen Vorschlag zu übernehmen, klicken Sie auf den Knopf <guibutton>Ersetzen</guibutton>.

source: &sonnet; also allows you to select a word from the list of suggestions and replace the misspelled word with that selected word. With the help of the <guibutton>Suggest</guibutton> button, you can add more suggestions from the dictionary to the suggestions list.
de: Mit &sonnet; können Sie auch ein Wort aus der Liste mit Vorschlägen auswählen und das falsch geschriebene Wort damit ersetzen. Verwenden Sie den Knopf <guibutton>Vorschläge</guibutton>, um weitere Wörter aus dem Wörterbuch zur Liste hinzuzufügen.

source: Click on <guibutton>Ignore</guibutton> to keep your original spelling.
de: Klicken Sie auf <guibutton>Ignorieren</guibutton>, um die vorhandene Schreibweise beizubehalten.

source: Click on <guibutton>Finished</guibutton> to stop spellchecking and <emphasis>keep</emphasis> the changes made.
de: Klicken Sie auf <guibutton>Abgeschlossen</guibutton>, um die Rechtschreibprüfung zu beenden und die bisher vorgenommenen Änderungen zu <emphasis>behalten</emphasis>.

source: Click on <guibutton>Cancel</guibutton> to stop spellchecking and <emphasis>cancel</emphasis> the changes already made.
de: Um die Rechtschreibprüfung zu beenden und alle bisherigen Änderungen zu verwerfen, klicken Sie auf <guibutton>Abbrechen</guibutton>.

source: Click on <guibutton>Replace All</guibutton> to automatically replace the misspelled word(s) with the chosen replacement word, if they appear again in your document later.
de: Klicken Sie auf <guibutton>Alle ersetzen</guibutton>, wird automatisch jedes Vorkommen des fehlerhaften Wortes durch die gewählte Ersetzung im gesamten weiteren Dokument ersetzt.

source: Click on <guibutton>Ignore All</guibutton> to ignore the spelling at that point and all the future occurrences of the word misspelled.
de: Klicken Sie auf <guibutton>Alle ignorieren</guibutton>, um die Rechtschreibung an dieser Stelle und an allen weiteren Vorkommen des fehlerhaften Worts zu ignorieren.

source: Click on <guibutton>Add to Dictionary</guibutton> to add the misspelled word to your personal dictionary.
de: Klicken Sie auf <guibutton>Zum Wörterbuch hinzufügen</guibutton>, um das Wort ins persönliche Wörterbuch einzufügen.

source: The <guilabel>Personal Dictionary</guilabel> is a distinct dictionary from the system dictionary and the additions made by you will not be seen by others.
de: Das <guilabel>Persönliche Wörterbuch</guilabel> ist ein Wörterbuch mit Ihren eigenen Einträgen, die sich von den Einträgen in dem Systemwörterbuch unterscheiden. Diese in Ihrem Wörterbuch eingefügten Einträge können von anderen nicht gelesen werden.

source: The drop down box <guilabel>Language</guilabel> at the bottom of this dialog allows you to switch to another dictionary temporarily.
de: Im Auswahlfeld <guilabel>Sprache</guilabel> unten im Dialog können Sie vorübergehend ein anderes Wörterbuch für die Rechtschreibprüfung einstellen.

source: Automatic Spell Checking
de: Automatische Rechtschreibprüfung

source: In many applications, you can automatically check spelling as you type. To enable this feature, select <menuchoice><guimenu>Tools</guimenu> <guimenuitem>Automatic Spell Checking</guimenuitem></menuchoice>.
de: In vielen Programmen kann bei der Eingabe eine automatische Rechtschreibprüfung vorgenommen werden. Um diese Funktion zu aktivieren, wählen Sie <menuchoice><guimenu>Extras</guimenu> <guimenuitem>Automatische Rechtschreibprüfung</guimenuitem></menuchoice>.

source: Potentially misspelled words will be underlined in red. To select a suggestion, right click on the word, select the <guisubmenu>Spelling</guisubmenu> submenu, and select the suggestion. You may also instruct &sonnet; to ignore this spelling for this document by selecting <guimenuitem>Ignore Word</guimenuitem>, or you may select <guimenuitem>Add to Dictionary</guimenuitem> to save it in your personal dictionary.
de: Möglicherweise falsch geschriebene Wörter werden rot unterstrichen angezeigt. Um einen Vorschlag zur Korrektur auszuwählen, klicken Sie mit der &RMBn; auf das Wort oder benutzen das Untermenü <guisubmenu>Rechtschreibung</guisubmenu> und wählen einen Vorschlag aus. Sie können das markierte Wort in diesem Dokument von der Prüfung ausschließen, indem Sie auf <guimenuitem>Ignorieren</guimenuitem> drücken. Außerdem können Sie diese Schreibweise des Worts mit <guimenuitem>Zum Wörterbuch hinzufügen</guimenuitem> in Ihrem persönlichen Wörterbuch speichern.

source: Configuring &sonnet;
de: &sonnet; einrichten

source: To change your dictionary, go to <menuchoice><guimenu>Tools</guimenu> <guimenuitem>Change Dictionary...</guimenuitem></menuchoice>. A small window will appear at the bottom of the current document that will allow you to change your dictionary.
de: Um ein anderes Wörterbuch zu verwenden, wählen Sie <menuchoice><guimenu>Extras</guimenu> <guimenuitem>Wörterbuch auswählen ...</guimenuitem></menuchoice>. Im aktuellen Dokument wird unten eine Leiste mit einem Auswahlfeld von installierten Wörterbüchern angezeigt.

source: For more information on configuring &sonnet;, see the <ulink url="help:kcontrol/spellchecking">Spell Checker &systemsettings; module documentation</ulink>
de: Weitere Informationen zur Einrichtung von &sonnet; finden Sie in der Dokumentation zum <ulink url="help:kcontrol/spellchecking">&systemsettings;-Modul Rechtschreibprüfung</ulink>.

source: Special thanks to Google Code-In 2011 Participant Salma Sultana for writing much of this section.
de: Besonderer Dank geht an den „Google Code-In 2011“-Teilnehmer Salma Sultana,der den Hauptteil diese Abschnitts geschrieben hat.

source: Find and Replace
de: Suchen und Ersetzen

source: The Find function of many &kde-sc; applications lets you find specific text in a document, while the Replace function allows you to replace text that is found with different text you provide.
de: Mit der Suchfunktion in vielen &kde-sc;-Anwendungen können Sie bestimmte Texte in einem Dokument finden. Beim Ersetzen wird ein gefundener Text mit Ihren Vorgaben ausgetauscht.

source: You can find both these functions in the <guimenu>Edit</guimenu> menu of many &kde; applications. For more information on this menu, see <xref linkend="menus-edit"/>.
de: Diese beiden Funktionen finden Sie im Menü <guimenu>Bearbeiten</guimenu> vieler &kde;-Programme. Weitere Informationen über dieses Menü finden Sie im Abschnitt <xref linkend="menus-edit"/>.

source: The Find Function
de: Die Funktion <quote>Suchen</quote>

source: The Find function searches for text in a document and selects it.
de: Diese Funktion sucht nach Text in einem Dokument und wählt ihn aus.

source: The Find Window
de: Der Dialog <quote>Suchen</quote>

source: The Find window.
de: Der Dialog <quote>Suchen</quote>.

source: Searching for <userinput>software</userinput> in <ulink url="http://kde.org/applications/internet/kmail/">&kmail;'s composer window</ulink>.
de: Suche nach <userinput>Software</userinput> in <ulink url="http://kde.org/applications/internet/kmail/">&kmail;s Nachrichten-Editor</ulink>.

source: To use Find in many applications, go to <menuchoice><guimenu>Edit</guimenu> <guimenuitem>Find...</guimenuitem></menuchoice> or press <keycombo action="simul">&Ctrl;<keycap>F</keycap></keycombo>. Then, in the <guilabel>Text to find:</guilabel> text box, enter the text that you want to find.
de: Die Suchfunktion finden Sie in vielen Programmen im Menü <menuchoice><guimenu>Bearbeiten</guimenu> <guimenuitem>Suchen ...</guimenuitem></menuchoice> oder Sie verwenden den Kurzbefehl <keycombo action="simul">&Ctrl;<keycap>F</keycap></keycombo>. Geben Sie dann im Feld <guilabel>Zu suchender Text</guilabel> einen Suchbegriff ein.

source: If <guilabel>Regular expression</guilabel> is checked you will be able to search using regular expressions. Click on <guibutton>Edit</guibutton> to select from and enter commonly used regular expression characters, like <guilabel>White Space</guilabel> or <guilabel>Start of Line</guilabel>. If &kate; is installed, you can find <ulink url="help:/kate/regular-expressions.html">more information on writing regular expressions in its documentation</ulink>.
de: Wenn die Einstellung <guilabel>Regulärer Ausdruck</guilabel> angekreuzt ist, können Sie diese verwenden. Klicken Sie auf den Knopf <guibutton>Bearbeiten</guibutton>, um häufig verwendete reguläre Zeichenausdrücke wie zum Beispiel <guilabel>Leerraum</guilabel> oder <guilabel>Zeilenanfang</guilabel> auszuwählen. Ist &kate; installiert, finden Sie weitere Informationen zu <ulink url="help:/kate/regular-expressions.html">Regulären Ausdrücken</ulink> in dessen Handbuch.

source: You can limit the found results by configuring these options:
de: Sie können die Ergebnisse der Suche durch folgende Optionen einschränken:

source: Case sensitive
de: Groß-/Kleinschreibung beachten

source: Capital and lowercase characters are considered different. For example, if you search for <quote>This</quote>, results that contain <quote>this</quote> will not be returned.
de: Mit dieser Einstellung werden groß oder klein geschriebene Zeichen als verschieden angesehen. Wenn Sie zum Beispiel nach <quote>Dies</quote> suchen, wird <quote>dies</quote> nicht gefunden.

source: Whole words only
de: Nur ganze Wörter

source: By default, when the application searches for text, it will return results even in the middle of other text. For instance, if you search for <quote>is</quote> it will stop on every word that contains that, like <quote>th<emphasis>is</emphasis></quote> or <quote>h<emphasis>is</emphasis>tory</quote>. If you check this option, the application will only return results when the search text is a word by itself, that is, surrounded by whitespace.
de: In der Voreinstellung werden bei der Suche nach Text auch Fundstellen mitten in Wörtern als Treffer angezeigt. Wenn Sie zum Beispiel nach <quote>is</quote> suchen, wird jedes Wort gefunden, das diese Buchstaben enthält wie zum Beispiel <quote><emphasis>is</emphasis>t</quote>. Ist diese Einstellung angekreuzt, werden nur Fundstellen für ganze Wörter angezeigt, bei denen der Suchtext von Leerzeichen umgeben ist.

source: From cursor
de: Ab Cursor-Position

source: The search will start from the location of the cursor and stop at the end of the text.
de: Die Suche wird von der aktuellen Cursor-Position bis zum Ende des Dokuments durchgeführt.

source: Find backwards
de: Rückwärts suchen

source: By default, the application searches for the text starting at the beginning of the document, and move through it to the end. If you check this option, it will instead start at the end and work its way to the beginning.
de: In der Voreinstellung wird die Suche vom Anfang bis zum Ende des Dokuments durchgeführt. Ist diese Einstellung angekreuzt, erfolgt die Suche umgekehrt vom Ende des Dokuments zum Anfang.

source: Selected text
de: Ausgewählter Text

source: Select this option to search only in the text that is currently selected, not the entire document. It is disabled when no text is selected.
de: Mit dieser Einstellung wird nur im aktuell ausgewählten Text gesucht, nicht im ganzen Dokument. Ist kein Text ausgewählt, ist diese Einstellung deaktiviert.

source: The Find function only selects the first match that it finds. You can continue searching by selecting <menuchoice><guimenu>Edit</guimenu><guimenuitem>Find Next</guimenuitem></menuchoice> or by pressing <keycap>F3</keycap>.
de: Die Suchfunktion wählt nur den ersten Treffer im Dokument. Um die Suche fortzusetzen, wählen Sie im Menü <menuchoice><guimenu>Bearbeiten</guimenu><guimenuitem>Weitersuchen</guimenuitem></menuchoice> oder benutzen den Kurzbefehl <keycap>F3</keycap>.

source: Example of a Search
de: Beispiel einer Suche

source: Example of a search.
de: Beispiel einer Suche.

source: &kmail; displays a match for <userinput>software</userinput>.
de: &kmail; zeigt ein Suchergebnis für <userinput>KDE</userinput>.

source: Applications which use the &kde; text editor component show a search bar instead of the Find window. See <ulink url="help:/kwrite/edit.html#find">&kwrite; documentation</ulink> for additional information on the search bar.
de: In Anwendungen, die die &kde;-Texteditorkomponente verwenden, wird anstatt des Dialogs eine Suchleiste im Hauptfenster angezeigt. In der <ulink url="help:/kwrite/edit.html#find">Dokumentation zu &kwrite;</ulink> finden Sie weitere Informationen zu dieser Leiste,

source: <screeninfo>The search bar in &kate;.</screeninfo>
de: <screeninfo>Die Suchleiste in &kate;.</screeninfo>

source: <phrase>The search bar in &kate;.</phrase>
de: <phrase>Die Suchleiste in &kate;.</phrase>

source: Searching for <userinput>software</userinput> in &kate;'s search bar.
de: Suche nach <userinput>software</userinput> mit &kate;s Suchleiste.

source: The Replace Function
de: Die Funktion <quote>Ersetzen</quote>

source: The Replace function searches for text in a document and replaces it with other text. You can find it in many application at <menuchoice><guimenu>Edit</guimenu><guisubmenu>Replace...</guisubmenu></menuchoice> or by pressing <keycombo action="simul">&Ctrl;<keycap>R</keycap></keycombo>.
de: Diese Funktion sucht nach einem vorgegebenen Text in einem Dokument und ersetzt ihn mit einem anderen Text. In vielen Programmen finden Sie diese Funktion im Menü <menuchoice><guimenu>Bearbeiten</guimenu><guisubmenu>Ersetzen ...</guisubmenu></menuchoice> oder indem Sie den Kurzbefehl <keycombo action="simul">&Ctrl;<keycap>R</keycap></keycombo> verwenden.

source: The Replace Window
de: Der Dialog <quote>Ersetzen</quote>

source: The Replace window.
de: Der Dialog <quote>Ersetzen</quote>.

source: Replacing <userinput>food</userinput> with <userinput>drink</userinput> in &kmail;
de: Ersetzen von <userinput>Essen</userinput> mit <userinput>Trinken</userinput> in &kmail;

source: The window of the Replace function is separated into 3 sections:
de: Der Dialog der Funktion <quote>Ersetzen</quote> besteht aus drei Abschnitten:

source: Find
de: Suchen
