Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kde-runtime/fundamentals_tasks.po
Languages: de

source: Here you may enter the text you wish to search for. See <xref linkend="find-find"/> for more information on the options provided here.
de: Hier können Sie den Text eingeben, nach dem Sie suchen möchten. In <xref linkend="find-find"/> finden Sie weitere Informationen der hier verfügbaren Einstellungen.

source: Replace
de: Ersetzen

source: Here you may enter the text you wish to replace the found text with.
de: Hier geben Sie den Text ein, mit dem Sie den Suchtext ersetzen möchten.

source: You can reuse the found text in the replacement text by selecting the <guilabel>Use placeholders</guilabel> checkbox. Placeholders, sometimes known as backreferences, are a special character sequence that will be replaced with all or part of the found text. For instance, <quote>\0</quote> represents the entire found string.
de: Der Suchtext kann im Ersetzungsfeld wieder verwendet werden, indem Sie <guilabel>Platzhalter verwenden</guilabel> ankreuzen. Platzhalter - auch als Rückbezüge bekannt - sind eine besondere Folgen von Zeichen, die mit dem vollständigen gefundenen Text oder mit Teilen daraus ersetzt werden. Die Zeichenfolge <quote>\0</quote> zum Beispiel repräsentiert den vollständigen gefundenen Text.

source: You may insert placeholders into the text box by clicking the <guibutton>Insert Placeholder</guibutton> button, then selecting an option from the menu like <guimenuitem>Complete Match</guimenuitem>. For example, if you are searching for <quote>message</quote>, and you want to replace it with <guilabel>messages</guilabel> insert the <guimenuitem>Complete Match</guimenuitem> placeholder and add an <quote>s</quote>. The replace field will then contain <quote>\0s</quote>.
de: Sie können Platzhalter in das Textfeld einfügen, indem Sie auf den Knopf <guibutton>Platzhalter einfügen</guibutton> klicken und dann eine Option aus dem Menü wie zum Beispiel <guimenuitem>Vollständige Übereinstimmung</guimenuitem> wählen. Wenn Sie zum Beispiel nach <quote>Nachricht</quote> suchen und das Wort durch <quote>Nachrichten</quote> ersetzen möchten, fügen Sie den Platzhalter <guimenuitem>Vollständige Übereinstimmung</guimenuitem> ein und fügen <quote>en</quote> hinzu. Das Ersetzungsfeld enthält nun den Text <quote>\0en</quote>.

source: If &kate; is installed, you can learn more about placeholders in the <ulink url="help:/kate/regular-expressions.html">Regular Expressions appendix of its documentation</ulink>.
de: Haben Sie &kate; installiert, dann finden Sie weitere Informationen über Platzhalter im Anhang <ulink url="help:/kate/regular-expressions.html">Reguläre Ausdrücke</ulink> des Handbuchs.

source: <guilabel>Options</guilabel>
de: <guilabel>Optionen</guilabel>

source: This contains all the same options that the <link linkend="find-find">Find</link> function does, with one addition:
de: Hier finden Sie die gleichen Einstellungen wie für die Funktion <link linkend="find-find">Suchen</link> und zusätzlich noch:

source: If the <guilabel>Prompt on replace</guilabel> option is checked a window will appear on every found word, allowing you to confirm whether you would like to replace the found text.
de: Wenn <guilabel>Vor Ersetzen nachfragen</guilabel> angekreuzt ist, wird bei jedem Treffer ein Dialog angezeigt, in dem Sie angeben können, ob Sie den gefundenen Text tatsächlich ersetzen möchten.

source: Applications which use the &kde; text editor component show a search and replace bar instead of the Replace window. See <ulink url="help:/kwrite/edit.html#replace">&kwrite; documentation</ulink> for additional information on the search and replace bar.
de: In Anwendungen, die die &kde;-Texteditorkomponente verwenden, wird anstatt des Dialogs eine Such-und Ersetzenleiste im Hauptfenster angezeigt. In der <ulink url="help:/kwrite/edit.html#replace">Dokumentation zu &kwrite;</ulink> finden Sie weitere Informationen zu dieser Leiste,

source: <screeninfo>The search and replace bar.</screeninfo>
de: <screeninfo>Die Leiste für Suchen und Ersetzen.</screeninfo>

source: <phrase>The search and replace bar.</phrase>
de: <phrase>Die Leiste für Suchen und Ersetzen.</phrase>

source: Replacing <userinput>kmail</userinput> with <userinput>kate</userinput> in &kate;'s search and replace bar
de: Ersetzen von <userinput>KMail</userinput> mit <userinput>Kate</userinput> in &kate;s Leiste zum Suchen und Ersetzen.

source: Thanks to an anonymous Google Code-In 2011 participant for writing much of this section.
de: Dank geht an den anonymen „Google Code-In 2011“-Teilnehmer, der den Hauptteil diese Abschnitts geschrieben hat.

source: Choosing Fonts
de: Auswahl von Schriftarten

source: The font selector appears in many different &kde; applications. It lets you select the font face, font style, and font size of the text that appears in your application.
de: Die Schriftauswahl wird in vielen &kde;-Anwendungen benutzt. Damit können Sie eine Schriftart, einen Schriftstil und eine Schriftgröße für den Text in Ihrem Dokument einstellen.

source: The Font Selector
de: Die Schriftauswahl

source: The font selector.
de: Die Schriftauswahl.

source: Selecting a font in <ulink url="help:/systemsettings">&systemsettings;</ulink>.
de: Auswahl einer Schrift in den <ulink url="help:/systemsettings">&systemsettings;</ulink>.

source: Font
de: Schriftart

source: This is the leftmost selection box, and lets you choose the font face from a list of fonts on your system.
de: In der linken Auswahlliste können Sie eine Schriftart aus den auf Ihrem System installierten Schriften auswählen.

source: Font style
de: Schriftstil

source: This is the center selection box, and lets you choose the font style from the following choices:
de: Die mittlere Auswahlliste ermöglicht folgende Einstellungen des Schriftstils:

source: <guilabel>Italic</guilabel> - this displays text in a cursive, or slanted fashion, and is commonly used for citations or to emphasize text.
de: <guilabel>Kursiv</guilabel> - der Text wird geneigt angezeigt. Diese Einstellung wird häufig für Zitate oder hervorzuhebenden Text verwendet.

source: <guilabel>Regular</guilabel> - the default. Text is displayed without any special appearance.
de: <guilabel>Normal</guilabel> - die Standardeinstellung. Text wird ohne besondere Attribute angezeigt.

source: <guilabel>Bold Italic</guilabel> - a combination of both <guilabel>Bold</guilabel> and <guilabel>Italic</guilabel>
de: <guilabel>Fett Kursiv</guilabel> - eine Kombination von <guilabel>Fett</guilabel> und <guilabel>Kursiv</guilabel>

source: <guilabel>Bold</guilabel> - this displays text in a darker, thicker fashion, and is commonly used for titles of documents or to emphasize text.
de: <guilabel>Fett</guilabel> - damit wird ein Text dunkler und dicker angezeigt. Dies wird oft für den Titel von Dokumenten oder hervorgehobenen Text benutzt.

source: Size
de: Größe

source: This is the rightmost selection box, and lets you select the size of your text. Font size is measured in <emphasis>points</emphasis>, a standard unit of measure in typography. For more information on this, see <ulink url="http://en.wikipedia.org/wiki/Point_(typography)">the <quote>Point (typography)</quote> article on Wikipedia</ulink>.
de: In diesem rechtem Auswahlfeld können Sie die Größe der Schrift einstellen. Die Schriftgröße wird in <emphasis>Punkt</emphasis> angegeben. Dies ist eine Standardeinheit für Schriftgrößen in der Typografie. Weitere Informationen dazu finden Sie im Artikel <ulink url="http://de.wikipedia.org/wiki/Punkt_(Einheit)">Punkt (Einheit)</ulink> in der Wikipedia.

source: Preview
de: Vorschau

source: The bottom of the font selector displays a preview of text using the font settings that are currently selected. You may change this text if you wish.
de: Unten im Schriftauswahldialog wird die Vorschau eines Texts mit den aktuell ausgewählten Schrifteinstellungen angezeigt. Der für die Vorschau verwendete Text kann angepasst werden.

source: Choosing Colors
de: Auswahl von Farben

source: The color chooser appears in many &kde; applications, whenever you need to select a color. It lets you pick from a <quote>palette</quote> consisting of many predefined colors or mix your own when you want a specific color.
de: Der Farbauswahldialog wird in vielen &kde;-Anwendungen benutzt, wenn eine Farbe auszuwählen ist. Sie können Farben aus einer Palette bestehend aus vielen vordefinierten Farben auswählen oder eigene Paletten mit bestimmten Farben zusammenstellen.

source: The Color Selector
de: Der Farbauswahldialog

source: The color selector.
de: Der Farbauswahldialog.

source: Selecting a color in <ulink url="help:/systemsettings">&systemsettings;</ulink>.
de: Auswahl einer Farbe in den <ulink url="help:/systemsettings">&systemsettings;</ulink>.

source: Using Palettes
de: Arbeiten mit Paletten

source: A palette is a set of predefined colors. You can find it on the right side of the color chooser window.
de: Eine Palette ist eine Gruppe von vordefinierten Farben. Die Paletten finden Sie auf der rechten Seite des Farbauswahldialogs.

source: To select a color from a palette, simply click on it. The color will be displayed below the palette, along with its &HTML; hexadecimal code and name, if any.
de: Um eine Farbe aus einer Palette zu wählen, klicken Sie darauf. Die Farbe wird dann unterhalb der Palette angezeigt, zusammen mit dem hexadezimalen &HTML;-Wert und dem Namen, wenn die Farbe einen Namen hat.

source: To switch between them, use the drop down box above the color palette. Most palettes will display a grid consisting of the colors, except for the <guilabel>Named Colors</guilabel>, which lets you select from a list of names. Other special palettes include <guilabel>* Recent Colors *</guilabel>, which will display colors that you have recently selected, and <guilabel>* Custom Colors *</guilabel>, which will display custom colors that you have saved. For more information on setting custom colors, see <xref linkend="colors-custom"/>
de: Benutzen Sie das Auswahlfeld über der Farbpalette, um eine andere Palette auszuwählen. Bei den meisten Paletten wird ein Raster mit den enthaltenen Farben angezeigt, außer bei den <guilabel>Benannten Farben</guilabel>. Hier können Sie die Farben aus einer Liste auswählen. Außerdem gibt es noch die speziellen Palette <guilabel>* Vorherige Farben *</guilabel> mit den kürzlich verwendeten Farben und die Palette <guilabel>* Benutzerdefinierte Farben *</guilabel> mit allen von Ihnen gespeicherten Farben. Weitere Informationen über benutzerdefinierte Farben finden Sie im Abschnitt <xref linkend="colors-custom"/>.

source: Mixing Colors
de: Farben mischen

source: The color chooser also lets you mix your own colors. There are several ways to do this:
de: Im Farbauswahldialog können Sie auch eigene Farben zusammen stellen. Dazu gibt es mehrere Möglichkeiten.

source: Using the Grid
de: Verwendung des Gitters

source: The left side of the color chooser contains a large box, and a thinner box immediately to its right. You can use the left box to select the Hue and Saturation of the desired color based on the visual guide provided in the box. The right bar adjusts the Value. Adjust these to select the desired color, which is displayed in the lower-right corner of the window.
de: Die linke Seite der Farbauswahl enthält eine großes quadratisches Farbfeld und rechts daneben einen dünnen Farbstreifen. Im linken Feld wählen Sie den Farbton und die Sättigung der gewünschten Farbe aus dem Farbverlauf. Mit dem rechten Farbstreifen stellen Sie den Hellwert ein. Das Ergebnis Ihrer Auswahl wird rechts unten im Dialog angezeigt.

source: For more information on Hue, Saturation, and Value, see <xref linkend="colors-mixing-hsv"/>
de: Weitere Informationen über Farbton, Sättigung und Hellwert finden Sie im Abschnitt <xref linkend="colors-mixing-hsv"/>.

source: Using the Eyedropper
de: Verwendung der Pipette

source: The eyedropper tool allows you to select a color from your screen. To use it, select the <guibutton>eyedropper</guibutton> button to the right of the <guibutton>Add to Custom Colors</guibutton> button, and then click anywhere on your screen to select that color.
de: Mit der Pipette können Sie eine Farbe von Ihrem Bildschirm wählen. Klicken Sie dazu auf das <guiicon>Pipette</guiicon> rechts neben dem Knopf <guibutton>Zu benutzerdefinierten Farben hinzufügen</guibutton> und wählen dann irgendwo auf dem Bildschirm die gewünschte Farbe.

source: Hue/Saturation/Value
de: Farbton, Sättigung, Hellwert

source: The lower-left corner of the screen allows you to manually enter the coordinates of the desired color in the Hue/Saturation/Value (<acronym>HSV</acronym>) color space. For more information on this, see <ulink url="https://en.wikipedia.org/wiki/HSL_and_HSV">the <quote>HSL and HSV</quote> article on Wikipedia</ulink>.
de: In der unteren linken Ecke des Dialogs können Sie die Koordinaten der gewünschten Farbe direkt im Farbraum Farbton/Sättigung/Hellwert (<acronym>HSV</acronym>) eingeben. Weitere Informationen zum <acronym>HSL- und HSV</acronym>-Farbraum finden Sie im Wikipediaartikel <ulink url="http://de.wikipedia.org/wiki/HSV-Farbraum">HSV-Farbraum</ulink>.

source: These values are also updated when selecting a color by other methods, so they always accurately represent the currently selected color.
de: Diese Werte werden auch aktualisiert, wenn Sie Farben mit einer anderen Methode auswählen. Es wird hier jederzeit die aktuell ausgewählte Farbe angezeigt.

source: Red/Green/Blue
de: Rot, Grün, Blau

source: The lower-left corner of the screen also allows you to manually enter the coordinates of the desired color in the Red/Green/Blue (<acronym>RGB</acronym>) color model. For more information on this, see <ulink url="https://en.wikipedia.org/wiki/RGB_color_model">the <quote>RGB color model</quote> article on Wikipedia</ulink>.
de: In der unteren linken Ecke des Dialogs können Sie die Koordinaten der gewünschten Farbe direkt im Farbraum Rot/Grün/Blau (<acronym>RGB</acronym>) eingeben. Weitere Informationen zum <acronym>RGB</acronym>-Farbraum finden Sie im Wikipediaartikel zum <ulink url="http://de.wikipedia.org/wiki/RGB-Farbraum">RGB-Farbraum</ulink>.

source: &HTML; Hexadecimal Code
de: &HTML;-Hexadezimalwert

source: You may enter the &HTML; hexadecimal code representing the color in the lower-right corner of the screen. For more information on this, see <ulink url="http://en.wikipedia.org/wiki/Web_colors">the <quote>Web colors</quote> article on Wikipedia</ulink>.
de: Sie können auch den hexadezimalen &HTML;-Wert der Farbe direkt im Eingabefeld rechts unten eintragen. Weitere Informationen zu &HTML;-Farbwerten finden Sie im Wikipedia-Artikel <ulink url="http://de.wikipedia.org/wiki/Webfarbe">Webfarbe</ulink>.

source: This value is also updated when selecting a color by other methods, so it always accurately represents the currently selected color.
de: Dieser Wert wird auch aktualisiert, wenn Sie Farben mit einer anderen Methode auswählen. Es wird hier jederzeit die aktuell ausgewählte Farbe angezeigt.

source: Saving Custom Colors
de: Benutzerdefinierte Farben speichern

source: After selecting a color, you may save it to the Custom Colors palette so you can find it later. To do so, click the <guibutton>Add to Custom Colors</guibutton> button. You can then find it by selecting the <guilabel>* Custom Colors *</guilabel> palette from the drop down box in the upper-right corner of the screen. For more information on using palettes, see <xref linkend="colors-palette"/>.
de: Nach Auswahl einer Farbe können Sie sie in der Palette der benutzerdefinierten Farben speichern, um sie später wieder zu verwenden. Klicken Sie dazu auf den Knopf <guibutton>Zu benutzerdefinierten Farben hinzufügen</guibutton>. Diese Farbpalette wird angezeigt, wenn Sie <guilabel>* Benutzerdefinierte Farben *</guilabel> im Auswahlfeld rechts oben im Dialog auswählen. Weitere Informationen über die Verwendung von Paletten finden Sie im Abschnitt <xref linkend="colors-palette"/>.
