Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kde-runtime/kcontrol_kcm_ssl.po
Languages: de

source: SSL Versions and Certificates
de: SSL-Versionen und -Zertifikate

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Burkhard</firstname><surname>Lück</surname><affiliation><address><email>lueck@hube-lueck.de</email></address></affiliation><contrib>Übersetzung</contrib></othercredit>

source: Systemsettings
de: Systemeinstellungen

source: certificates
de: Zertifikate

source: Introduction
de: Einführung

source: &kde; provides a list of all the X.509 certificates used by the system. They can be accessed in the <guilabel>SSL Preferences</guilabel> module in &systemsettings;.
de: &kde; stellt eine Liste aller vom System benutzten X.509-Zertifikate bereit. Der Zugriff auf diese Zertifikate ist im Modul <guilabel>SSL-Einstellungen</guilabel> der &systemsettings; möglich.

source: This module provides a categorized listing of all SSL versions and certificates. You can see the details of each of the certificates and add, delete, disable, or enable them.
de: In diesem Modul wird eine Liste aller SSL-Versionen und -Zertifikate mit mehreren Kategorien angezeigt. Sie können die Details der Zertifikate betrachten und Zertifikate hinzufügen, entfernen, deaktivieren oder aktivieren.

source: The certificates are categorized into <guilabel>System certificates</guilabel> and <guilabel>User-added certificates</guilabel>. The <guilabel>System certificates</guilabel> are further categorized by the organization that issued them.
de: Die Zertifikate werden in den beiden Kategorien <guilabel>Systemzertifikate</guilabel> und <guilabel>Benutzerzertifikate</guilabel> angezeigt. Die Systemzertifikate werden nach der Aussteller-Organisation gruppiert.

source: The SSL Versions and Certificates Module
de: Das Modul „SSL-Versionen und -Zertifikate“

source: The SSL Versions and Certificates module.
de: Das Modul „SSL-Versionen und -Zertifikate“.

source: <title>Viewing the Details of a Certificate</title>
de: <title>Anzeige der Details eines Zertifikats</title>

source: Select a certificate under a listed organization, and click on the <guibutton>Display</guibutton> underneath the list to view the details of the certificate.
de: Wählen Sie ein Zertifikat von einer hier aufgeführten Organisation und klicken Sie auf den Knopf <guibutton>Anzeigen</guibutton> under der Liste, um ein Fenster mit allen Details des Zertifikats zu öffnen.

source: <screeninfo>Viewing the Details of a Certificate</screeninfo>
de: <screeninfo>Anzeige der Details eines Zertifikats</screeninfo>

source: The certificate details window.
de: Das Fenster Zertifikatsdetails

source: Enabling or Disabling a Certificate
de: Aktivieren oder Deaktivieren eines Zertifikats

source: First, select a certificate listed under an organization. Then, click the <guibutton>Enable</guibutton> button to enable the certificate, or click the <guibutton>Disable</guibutton> button to disable an enabled certificate.
de: Wählen Sie zuerst ein Zertifikat einer in der Liste aufgeführten Organisation. Mit Klicken auf die beiden zugehörigen Knöpfe können Sie das Zertifikat dann aktivieren oder deaktivieren.

source: Alternatively, you can enable or disable a certificate by selecting or clearing the check box before the certificate.
de: Außerdem kann ein Zertifikat auch mit dem Ankreuzfeld davor aktiviert oder deaktiviert werden.

source: You can enable or disable multiple certificates by selecting them while holding the &Ctrl; key and then clicking on the <guibutton>Enable</guibutton> or <guibutton>Disable</guibutton> button below the list.
de: Sie können auch mehrere Zertifikate auf einmal aktivieren oder deaktivieren, indem Sie bei der Auswahl die &Ctrl;-Taste gedrückt halten und dann auf <guibutton>Aktivieren</guibutton> oder <guibutton>Deaktivieren</guibutton> unter der Liste klicken.

source: Adding a Certificate
de: Ein Zertifikat hinzufügen

source: First, click on the <guibutton>Add</guibutton> button below the certificate list. It will open the file selector dialog allowing you to locate where the certificate files are stored. After locating the certificate file, select it and click on the <guibutton>Open</guibutton> button to add it.
de: Klicken Sie zuerst auf den Knopf <guibutton>Hinzufügen</guibutton> unter der Zertifikatsliste. Damit öffnen Sie den Dateidialog, um lokal gespeicherte Zertifikate zu finden. Wenn Sie ein Zertifikat ausgewählt haben, klicken Sie auf <guibutton>Öffnen</guibutton>, um es hinzuzufügen.

source: The certificates must be in one of the following formats: <acronym>DER</acronym>, <acronym>PEM</acronym>, or &Netscape;-encoded X.509 certificate.
de: Die Zertifikate müssen in einem der folgenden Formate vorliegen: <acronym>DER</acronym>, <acronym>PEM</acronym>, oder als &Netscape;-kodiertes X.509-Zertifikat.

source: Removing a Certificate
de: Ein Zertifikat entfernen

source: Select the listed certificate that you want to remove, and click the <guibutton>Remove</guibutton> button to remove the certificate.
de: Wählen Sie ein Zertifikat aus der Liste und klicken Sie auf <guibutton>Entfernen</guibutton>, um es aus der Liste zu löschen.

source: System certificates cannot be removed.
de: Systemzertifikate können nicht entfernt werden.

source: Thanks and Acknowledgments
de: Danksagungen

source: Special thanks to Google Code-In 2011 participant Subhashish Pradhan for writing this article.
de: Besonderer Dank geht an den „Google Code-In 2011“-Teilnehmer Subhashish Pradhan,der diesen Artikel geschrieben hat.
