Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kde-runtime/kcontrol_netpref.po
Languages: de

source: Connection Preferences
de: Verbindungseinstellungen

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Frank</firstname><surname>Schütte</surname><affiliation><address><email>F.Schuette@t-online.de</email></address></affiliation><contrib>Übersetzung</contrib></othercredit>

source: kcontrol
de: Kontrollzentrum

source: network
de: Netzwerk

source: timeouts
de: Zeitlimits

source: Here you can set timeout values. You might want to tweak them if your connection is very slow, but the default settings are appropriate for most users.
de: Hier können Sie Werte für verschiedene Zeitlimits angeben. Bei langsamen Verbindungen können die Werte entsprechend angepasst werden. Die Standardwerte sollte allerdings für die allermeisten Fälle angemessen sein.

source: Here <guilabel>Timeout Values</guilabel> are the length of time an application should wait for an answer from a network operation.
de: Die <guilabel>Zeitlimit-Werte</guilabel> geben die Zeitspannen an, die eine Anwendung bei einem Netzwerkzugriff auf eine Antwort warten soll.

source: You can configure the following timeouts:
de: Sie können die folgenden Zeitlimits festlegen:

source: Socket read:
de: Socket-Daten:

source: Some applications use <firstterm>sockets</firstterm> to communicate. You can think of a socket as a water tap; while it is open, water (or in our case, data) comes out, without any interaction. If something stops this flow of data, the application will wait for more to come. This could be a very long time, but you can configure a maximum time for an application to wait with this option.
de: Einige Anwendungen verwenden <firstterm>Sockets</firstterm>, um miteinander zu kommunizieren. Sie können sich einen Socket wie einen Wasserhahn vorstellen. Solange er offen ist, fließt Wasser (oder Daten, wie in unserem Fall) ohne jede Wechselwirkung. Wird dieser Datenfluss gestoppt, wartet die Anwendung auf weitere Daten. Dies kann sehr lange dauern, aber Sie können die maximale Wartezeit angeben, die eine Anwendung auf neue Daten wartet.

source: This setting will only apply to &kde; applications, of course.
de: Diese Einstellung wirkt sich natürlich nur auf &kde;-Anwendungen aus.

source: Proxy connect:
de: Proxy-Verbindung:

source: Sets how long to wait for a connection to a proxy server, if one is configured.
de: Legt fest, wie lange auf die Verbindung zum Proxy gewartet wird, falls ein Proxy eingerichtet ist.

source: Server connect:
de: Server-Verbindung:

source: Sets how long to wait for a connection to a remote server.
de: Legt die Wartezeit für den Verbindungsaufbau zu einem entfernten Server fest.

source: Server response:
de: Server-Antwort:

source: Sets how long to wait for a reply from a remote server.
de: Legt die Wartezeit für die Antwort eines entfernten Servers fest.

source: You can configure <guilabel>FTP Options</guilabel> here. At present there is just two options:
de: Hier können Sie <guilabel>FTP-Optionen</guilabel> einrichten. Derzeit gibt es zwei Einstellmöglichkeit, nämlich <guilabel>Passiven Modus (PASV) aktivieren</guilabel> und <guilabel>Teilweise übertragene Dateien markieren</guilabel>.

source: Enable passive mode (PASV)
de: Passiven Modus (PASV) aktivieren

source: Passive &FTP; is often required when you are behind a firewall. Many firewalls only permit connections that were initiated from <quote>the inside</quote>. Passive &FTP; is controlled by the client, which makes it usable through firewalls.
de: Passives &FTP; ist meist hinter einer Firewall notwendig. Viele Firewalls erlauben nur Verbindungen, die von <quote>innen nach außen</quote> gehen. Passives &FTP; wird vom Client kontrolliert, was die Verwendung hinter einer Firewall ermöglicht.

source: Mark partially uploaded files
de: Teilweise übertragene Dateien markieren

source: When a mark is placed in this box, partially uploaded files will have a <literal role="extension">.part</literal> extension added to the end of the file. This extension is removed once the file download is complete.
de: Wenn diese Einstellung aktiviert ist, werden Dateien, die noch nicht vollständig übertragen sind, mit der Dateiendung <literal role="extension">.part</literal> versehen. Sobald die Übertragung abgeschlossen ist, wird diese zusätzliche Endung automatisch entfernt.
