Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kde-runtime/kcontrol_cookies.po
Languages: de

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Jürgen</firstname><surname>Nagel</surname><affiliation><address><email>JuergenNagel@web.de</email></address></affiliation><contrib>Übersetzer</contrib></othercredit>

source: Systemsettings
de: Systemeinstellungen

source: Cookies are a mechanism used by web sites to store and retrieve information using your browser. For example, a web site may allow you to customize the content and layout of the pages you see, so that your choices are persistent across different visits to that web site.
de: Mit Hilfe von Cookies speichern und lesen Internetseiten Informationen auf Ihrem Computer. Zum Beispiel erlaubt eine Internetseite, den Inhalt und die Darstellung anzupassen. Mit Cookies werden die Einstellungen zwischen Besuchen dieser Seite gespeichert.

source: The web site is able to remember your preferences by storing a cookie on your computer. Then, on future visits, the web site retrieves the information stored in the cookie to format the content of the site according to your previously specified preferences.
de: Die Internetseite merkt sich die Einstellungen, indem sie einen Cookie auf Ihrem Computer speichern. Bei einem zukünftigen Besuch wird diese Information wieder ausgelesen und verwendet, um die vorher festgelegten Einstellungen wieder herzustellen.

source: Thus, cookies play a very useful role in web browsing. Unfortunately, web sites often store and retrieve information in cookies without your explicit knowledge or consent. Some of this information may be quite useful to the web site owners, for example, by allowing them to collect summary statistics on the number of visits different areas of the web sites get, or to customize banner advertising.
de: Cookies spielen daher eine bedeutende Rolle beim Browsen im Internet. Leider speichern Internetseiten auch Informationen ohne Ihr explizites Wissen und Ihre Zustimmung. Einige dieser Informationen können für die Betreiber der Internetseite sehr nützlich sein. Es ist beispielsweise möglich, die Anzahl der Zugriffe auf einzelne Bereiche statistisch auszuwerten oder Werbung auf Ihr Zugriffsprofil abzustimmen.

source: The cookies page allows you to set policies for the use of cookies when you are browsing the web with the &konqueror; web browser.
de: Das Seite Cookies erlaubt Regelungen für die Verwendung von Cookies beim Browsen mit dem Internetbrowser &konqueror;.

source: Note that the policies that you set using this control module will <emphasis>not</emphasis> apply to other web browsers such as &Netscape;.
de: Beachten Sie, dass die hier eingestellten Regelungen <emphasis>keine</emphasis> Auswirkungen auf andere Browser wie &eg; &Netscape; haben.

source: Policy
de: Regelungen

source: Using the <guilabel>Policy</guilabel> tab, you can configure the &kde; applications that will handle cookies. You can do this by specifying a general cookie policy as well as special cookie policies for certain domains or hosts.
de: Auf der Karteikarte <guilabel>Regelungen</guilabel> können Sie einstellen, wie &kde;-Anwendungen mit Cookies umgehen. Sie können sowohl eine Standardregelung als auch spezifische Regelungen für bestimmte Domains oder Rechner festlegen.

source: The top of the policy tab has a check box labeled <guilabel>Enable cookies</guilabel>. If you leave this unchecked, cookies will be completely disabled. However, this may make browsing rather inconvenient, especially as some web sites require the use of browsers with cookies enabled.
de: Oben auf der Karteikarte befindet sich das Ankreuzfeld <guilabel>Cookies zulassen</guilabel>. Wenn man dieses Feld nicht markiert, werden Cookies vollständig abgeschaltet. Das kann aber das Browsen im Internet sehr unkomfortabel machen, da es einige Internetseiten gibt, die die Benutzung eines Browsers mit eingeschalteten Cookies erfordern.

source: You will probably want to enable cookies and then set specific policies on how you want them to be handled.
de: Daher werden Sie in der Regel Cookies einschalten und dann spezifische Regelungen für den Umgang mit ihnen treffen.

source: The first group of options create settings that apply to all cookies.
de: Die erste Gruppe von Einstellungen betrifft Optionen, die auf alle Cookies anzuwenden sind.

source: Only accept cookies from originating server
de: Nur Cookies vom erstellenden Server annehmen

source: Some pages try to set cookies from servers other than the one you are seeing the &HTML; page from. For example, they show you advertisements, and the advertisements are from another computer, often one that belongs to a large advertising group. These advertisements may try to set a cookie which would allow them to track the pages you view across multiple web sites.
de: Einige Seiten versuchen Cookies von Servern zu setzen, die nicht mit dem übereinstimmen, von dem die &HTML;-Seite kommt. Sie zeigen Ihnen zum Beispiel Werbung, und diese Werbung stammt von anderen Servern, die häufig zu einer großen Werbefirma gehören. Diese Werbung versucht möglicherweise, ein Cookie zu setzen, mit dem verfolgt werden kann, welche Seiten Sie auf verschiedenen Websites besucht haben.

source: Enabling this option will mean only cookies that come from the same web server as you are explicitly connecting to will be accepted.
de: Wenn Sie diese Einstellung aktivieren, werden nur Cookies akzeptiert, die von dem Server stammen, mit dem Sie gerade verbunden sind.

source: Automatically accept session cookies
de: Sitzung-Cookies automatisch annehmen

source: An increasingly common use for cookies is not to track your movements across many visits to a web site, but to just follow what you do during one single visit. Session cookies are saved as long as you are looking at the site, and deleted when you leave it.
de: Immer öfter werden Cookies dazu verwendet, nicht Ihre Bewegungen über viele verschiedene Besuche auf einer Website zu registrieren, sondern was Sie während eines einzigen Besuchs auf dieser Seite tun. Sitzungs-Cookies werden solange gespeichert, wie Sie sich auf der Seite befinden und gelöscht, sobald Sie die Seite verlassen.

source: Web sites can use this information for various things, most commonly it is a convenience so that you do not have to keep logging in to view pages. For example, on a webmail site, without some kind of session <acronym>ID</acronym>, you would have to give your password again for each email you want to read. There are other ways to achieve this, but cookies are simple and very common.
de: Internetseiten können diese Informationen für verschiedene Dinge verwenden. Gewöhnlich dient es der Bequemlichkeit, sodass Sie sich zum Beispiel nicht immer neu anmelden müssen, wenn Sie eine andere Seite eines Webmail-Service anschauen möchten. Ohne eine solche Sitzungs-<acronym>ID</acronym> müssten Sie Ihr Passwort jedesmal neu eingeben, wenn Sie eine andere E-Mail lesen möchten. Es gibt andere Wege, dies zu erreichen, aber Cookies sind eine einfache und weit verbreitete Möglichkeit.

source: Enabling this option means that session cookies are always accepted, even if you don't accept any other kind, and even if you choose to reject cookies from a particular site, session cookies from that site will be accepted.
de: Schalten Sie diese Option ein, dann werden Sitzungs-Cookies immer akzeptiert, selbst dann, wenn Sie keine anderen Cookies zulassen. Sogar wenn Sie Cookies von einer bestimmten Domain nicht annehmen, dann werden die Sitzungs-Cookies von dieser Seite trotzdem akzeptiert.

source: The section for <guilabel>Default Policy</guilabel> sets some further options that are mutually exclusive &mdash; you can choose only one of these options as the default, but you are free to set a different option for any specific web server.
de: Der Abschnitt <guilabel>Standardregelung</guilabel> setzt einige weitere Einstellungen, die sich gegeneinander ausschließen &mdash; Sie können nur eine dieser Einstellungen als Standard festlegen. Allerdings ist es möglich, andere Einstellungen für bestimmte Internetserver festzulegen.

source: Site specific policies always take precedence over the default policy.
de: Seitenspezifische Regelungen überschreiben immer die Standardregelung.

source: Accept all cookies
de: Alle Cookies annehmen

source: If this option is selected, all cookies will be accepted without asking for confirmation.
de: Wenn diese Option ausgewählt ist, werden alle Cookies ohne Nachfrage angenommen.

source: Accept until end of session
de: Bis zum Sitzungsende annehmen

source: Cookies will be accepted, but they will expire at the end of the session.
de: Cookies werden solange akzeptiert, bis die Sitzung beendet ist.

source: Ask for confirmation
de: Um Bestätigung bitten

source: If this option is selected, you will be asked for confirmation every time a cookie is stored or retrieved. You can selectively accept or reject each cookie. The confirmation dialog will also allow you to set a domain specific policy, if you do not want to confirm each cookie for that domain.
de: Wenn diese Option ausgewählt ist, wird für jeden einzelnen Cookie um Bestätigung gebeten. Sie können jeden einzelnen Cookie entweder annehmen oder ablehnen. Der Bestätigungsdialog enthält außerdem die Möglichkeit, eine Domain-spezifische Regelung zu treffen, falls Sie für eine Domain nicht jeden Cookie einzeln bestätigen wollen.

source: Reject all cookies
de: Alle Cookies zurückweisen

source: If this option is selected, all cookies will be rejected without asking for confirmation.
de: Wenn diese Option ausgewählt ist, werden alle Cookies ohne Nachfrage abgelehnt.

source: In addition to the default policy for handling of cookies, which you can set by selecting one of the three options described above, you can also set policies for specific host domains using the controls in the <guilabel>Site Policy</guilabel> group.
de: Zusätzlich zu dieser Standardregelung kann man Domain-spezifische Regelungen im Bereich <guilabel>Seitenregelung</guilabel> festlegen. Diese Regelungen gelten für einzelne Rechner oder einzelne Domains.

source: The Ask, Accept, Accept until end of session, or Reject policy can be applied to a specific domain by clicking on the <guibutton>New...</guibutton> button, which brings up a dialog. In this dialog, you can type the name of the domain (with a leading dot), then select the policy you want to apply to this domain. Note that entries may also get added while you are browsing, if the default policy is to ask for confirmation, and you choose a general policy for a specific host (for example, by selecting <guilabel>Reject</guilabel> when asked to confirm a cookie).
de: Sie können eine der Regelungen Nachfragen, Annehmen, Annehmen bis zum Sitzungsende oder Ablehnen auf eine bestimmte Domain anwenden, indem Sie auf den Knopf <guibutton>Neu ...</guibutton> klicken. Im angezeigten Dialogfenster tragen Sie den Namen der Domain (mit einem führenden Punkt) ein und wählen die gewünschte Regelung für diese Domain aus. Beachten Sie, dass auch während des Browsens Einträge hinzufügen werden können. Wenn die Standardregelung eine Bestätigung verlangt, kann man im Bestätigungsdialog eine generelle Regelung für einen bestimmten Rechner festlegen (zum Beispiel, indem man dort <guilabel>Ablehnen</guilabel> auswählt).

source: You can also select a specific host domain from the list and click the <guibutton>Change</guibutton> button to choose a different policy for that domain than the one shown in the list.
de: Um für eine aufgelistete Domain die Regelung zu ändern, wählen Sie diese in der Liste aus und klicken auf <guibutton>Ändern</guibutton>.

source: To delete a domain specific policy, choose a domain from the list, and then click the <guibutton>Delete</guibutton> button. The default policy will apply to domains which have been deleted from the list.
de: Um eine Domain-spezifische Regelung zu löschen, wählt man den gewünschten Listeneintrag aus und klickt auf <guibutton>Löschen</guibutton>. Für eine gelöschte Domain gilt wieder die Standardregelung.

source: Management
de: Verwaltung

source: In the <guilabel>Management</guilabel> tab you can browse and selectively delete cookies that have been set in the past.
de: Auf der Karteikarte <guilabel>Verwaltung</guilabel> können Sie die Liste der gespeicherten Cookies durchsehen und einzelne Cookies löschen.

source: In the upper part of this dialog, you can see a list of domains displayed as a tree. Click on the little <guiicon>&gt;</guiicon> next to a domain to see all cookies that have been set for this particular target domain. If you select one of these cookies, you will notice that its contents will show up in the frame <guilabel>Details</guilabel> below.
de: Im oberen Abschnitt dieses Dialoges wird eine Liste von Domains als Baumstruktur dargestellt. Klicken Sie neben einem Domain-Namen auf <guiicon>&gt;</guiicon>, werden alle Cookies dieser Domain unter dem Domain-Namen aufgelistet. Wählen Sie eines dieser Cookies aus, wird sein Inhalt unten im Bereich <guilabel>Details</guilabel> angezeigt.

source: By clicking the <guibutton>Delete</guibutton> button you can now delete the selected cookie. Click <guibutton>Delete All</guibutton> to delete all cookies stored.
de: Durch Klicken auf den Knopf <guibutton>Löschen</guibutton>, wird der ausgewählte Cookie gelöscht. Mit <guibutton>Alle löschen</guibutton> werden alle gespeicherten Cookies gelöscht.

source: If a domain is selected, you can use <guibutton>Configure Policy</guibutton> to set a site policy.
de: Wenn Domäne ausgewählt ist, können Sie mit <guibutton>Regelung einrichten</guibutton> eine spezielle Regel für diese Domäne eingeben.

source: Choose <guibutton>Reload List</guibutton> to reload the list from your hard disk. You might want to do this if you have had the module open and are testing web sites, or have made many changes in the module itself.
de: Klickt man auf <guibutton>Liste neu einlesen</guibutton>, wird die Liste der Cookies von der Festplatte neu eingelesen. Das ist nützlich, wenn man das Modul geöffnet hat und Internetseiten testet oder im Modul selbst viele Änderungen vorgenommen hat.
