Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kde-runtime/kcontrol_useragent.po
Languages: de

source: Browser Identification
de: Browserkennung

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Frank</firstname><surname>Schütte</surname><affiliation><address><email>F.Schuette@t-online.de</email></address></affiliation><contrib>Übersetzung</contrib></othercredit>

source: Systemsettings
de: Systemeinstellungen

source: user agent
de: Browserkennung

source: identification
de: Kennung

source: Introduction
de: Einleitung

source: When &konqueror; connects to a web site to retrieve information, some basic identifying information is sent to the web site in the form of a <quote>User Agent</quote> header.
de: Wenn &konqueror; die Verbindung zu einer Web-Seite herstellt, werden einige grundlegende Informationen zur Identifikation in Form einer <quote>Browserkennung</quote> übertragen.

source: Because of minor differences in the way that different web browsers function, web sites that rely too much on a single browser may sometimes not display as intended when viewed using another browser. Some web sites are smart enough to examine the contents of the user agent header and incorporate this information in the &HTML; code so that the content is displayed correctly regardless of the browser used.
de: Da es geringe Unterschiede in der Arbeitsweise verschiedener Webbrowser gibt, werden Web-Seiten, die sehr von der Arbeitsweise eines bestimmten Browsers abhängen, auf anderen Browsern häufig nicht korrekt dargestellt. Intelligente Websites werten die Informationen der Browserkennung aus, um den &HTML;-Code ihrer Seiten an unterschiedliche Browser anzupassen.

source: However, you may find that some web sites refuse to function correctly unless you are using a browser recognized as <quote>proper</quote> by that site. In these cases, you may find it necessary to fool the web site by having &konqueror; report itself to be another browser by means of the user agent header.
de: Einige Webserver gehen so weit, anderen als den <quote>geeigneten</quote> Browsern die Verbindung zu verweigern. In diesen Fällen könnte es für Sie notwendig werden, diesen Webserver zu täuschen, indem Sie &konqueror; dazu veranlassen, sich durch eine falsche Browserkennung als <quote>geeigneter</quote> Browser auszugeben.

source: <title>Use</title>
de: <title>Benutzung</title>

source: In this module you can configure the type of browser that &konqueror; will report itself to be. You can control this information by web site. Usually, the list box that is labeled <guilabel>Site Specific Identification</guilabel> will be empty, so that &konqueror; will always use its default useragent string.
de: In diesem Modul können Sie festlegen, als welcher Browser-Typ sich &konqueror; identifiziert. Diese Informationen können für jeden Webserver einzeln festgelegt werden. Standardmäßig ist das Listenfeld <guilabel>Site/Domain-spezifische Kennung</guilabel> leer, sodass &konqueror; immer die eingestellte Standard-Kennung verwendet.

source: You can disable the sending of a user agent entirely, by unchecking the <guilabel>Send identification</guilabel> check box. This may cause strange behavior on some sites, and may even deny you access to some websites, so disable this with caution.
de: Sie können das Versenden der Browserkennung auch komplett abschalten, indem Sie das Ankreuzfeld <guilabel>Kennung senden</guilabel> deaktivieren. Dies kann auf einigen Webseiten ein eigenartiges Verhalten hervorrufen. Einige dieser Seiten könnten Ihnen sogar den Zugriff verweigern. Sie sollten diese Deaktivierung also mit Vorsicht handhaben.

source: To configure a new agent binding, press the <guibutton>New...</guibutton> button. Type the name of the server or a domain in the text box at the top of the dialog that pops up, which is labeled <guilabel>When browsing the following site</guilabel>.
de: Um eine neue Kennung einzutragen, klicken Sie auf <guibutton>Neu ...</guibutton>. Dann geben Sie den Namen eines Servers oder einer Domain in das Eingabefeld <guilabel>Bei Verbindung mit</guilabel> oben im angezeigten Dialog ein.

source: Note that you can <emphasis>not</emphasis> use the wildcard character <token>*</token> in this text box. However, the string <userinput>kde.org</userinput> will match all hosts in the domain <systemitem>kde.org</systemitem>
de: Beachten Sie, dass das Zeichen <token>*</token> in diesem Eingabefeld <emphasis>nicht</emphasis> verwendet werden darf. Allerdings steht die Eingabe <userinput>kde.org</userinput> für alle Rechner der Domain <systemitem>kde.org</systemitem>

source: After typing the name of the server, type in the identifying string in the next combo box, which is labeled <guilabel>Use the following identification:</guilabel>, or choose a string from the list. If you don't choose a string from the list, you will need to know what a valid string from the browser looks like. For example, you could type <userinput>Mozilla/4.0 (compatible; MSIE 4.0)</userinput>.
de: Als nächstes geben Sie in das Textfeld <guilabel>Folgende Kennung angeben</guilabel> die Kennung ein, mit der sich &konqueror; bei dem Server anmelden soll. Dieser Text muss bestimmten Konventionen entsprechen. Sie können zum Beispiel <userinput>Mozilla/4.0 (compatible; MSIE 4.0)</userinput> in dieses Textfeld eintragen.

source: You can click on an existing entry in the list, and then modify the contents of the text boxes, followed by clicking <guibutton>Change...</guibutton>.
de: Sie können auch auf einen vorhandenen Eintrag des Listenfeldes klicken und diesen über <guilabel>Ändern ...</guilabel> bearbeiten, um die Einträge Ihren Erfordernissen anzupassen.

source: The <guibutton>Delete</guibutton> button can be used to delete the selected entry in the list of configured agent bindings. The <guibutton>Delete All</guibutton> will remove all the configured user agent strings. Click the <guibutton>Apply</guibutton> to take your changes in effect.
de: Um einen Eintrag aus dem Listenfeld zu entfernen, wählen Sie den Eintrag im Listenfeld aus und klicken Sie auf <guibutton>Löschen</guibutton>. Der Knopf <guibutton>Alle löschen</guibutton> entfernt alle Browserkennungen. Klicken Sie auf <guibutton>Anwenden</guibutton>, um Ihre Änderungen zu speichern.

source: You can use the check boxes at the top of the screen to build a user agent that is uniquely yours, by choosing your own combination of operating system name and version, platform, processor type, and language.
de: Sie können die Ankreuzfelder oben verwenden, um eine Browserkennung zu erstellen, die genau auf Ihr System angepasst ist. Wählen Sie dazu die von Ihnen gewünschte Kombination aus Betriebssystemname und -version, Plattform, Prozessortyp und Spracheinstellung.

source: In all cases, the user agent that is being sent by default is displayed in bold text at the top of the page.
de: In allen Fällen wird die Browserkennung, die standardmäßig gesendet wird, in fetter Schrift oben auf der Seite angezeigt.
