Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kde-runtime/kcontrol_ebrowsing.po
Languages: de

source: Web Shortcuts
de: Web-Kürzel

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Stefan</firstname><surname>Winter</surname><affiliation><address><email>kickdown@online.de</email></address></affiliation><contrib>Deutsche Übersetzung</contrib></othercredit>

source: Systemsettings
de: Systemeinstellungen

source: enhanced browsing
de: Erweitertes Web-Browsen

source: web shortcuts
de: Web-Kürzel

source: browsing
de: Browsen

source: Introduction
de: Einführung

source: &konqueror; offers some features to enhance your browsing experience. One such feature is <emphasis>Web Shortcuts</emphasis>.
de: &konqueror; bietet Ihnen mehrere Möglichkeiten, das Browsen zu vereinfachen. Eine dieser Funktionen ist <emphasis>Web-Kürzel</emphasis>.

source: You may already have noticed that &kde; is very Internet friendly. For example, you can click on the <guimenuitem>Run</guimenuitem> menu item or type the keyboard shortcut assigned to that command (<keycombo action="simul">&Alt;<keycap>F2</keycap></keycombo>, unless you have changed it) and type in a &URI;.
de: &kde; ist sehr Internet-freundlich. Zum Beispiel kann man im Startmenü auf den Eintrag <guimenuitem>Ausführen</guimenuitem> klicken oder das Tastenkürzel für diesen Befehl ( <keycombo action="simul">&Alt;<keycap>F2</keycap></keycombo>, sofern Sie diese Tastenkombination nicht geändert haben) betätigen und eine &URI; eingeben.

source: Uniform Resource Identifier. A standardized way of referring to a resource such as a file on your computer, a World Wide Web address, an email address, <abbrev>etc...</abbrev>.
de: Uniform Resource Identifier. Eine standardisierte Möglichkeit, eine Ressource (also Datei auf Ihrem Rechner, eine WWW-Adresse, eine E-Mail-Adresse &etc;) zu benennen.

source: Web shortcuts, on the other hand, let you come up with new pseudo &URL; schemes, or shortcuts, that basically let you <emphasis>parameterize</emphasis> commonly used &URI;s. For example, if you like the Google search engine, you can configure &kde; so that a pseudo &URL; scheme like <emphasis>gg</emphasis> will trigger a search on Google. This way, typing <userinput>gg:<replaceable>my query</replaceable></userinput> will search for <replaceable>my query</replaceable> on Google.
de: Web-Kürzel sind benutzerdefinierte Pseudo-&URL;s, die &eg; als Abkürzung für das Abfragen bestimmter Suchmaschinen dienen können und den Umgang mit den verschiedenen Suchparametern dieser viel benutzten Suchmaschinen vereinfachen. Wenn man zum Beispiel die Google-Suchmaschine benutzen will, kann man &kde; so einrichten, dass die Eingabe einer Pseudo-&URL; wie <emphasis>gg</emphasis> eine Suche bei Google auslöst. So wird durch die Eingabe <userinput>gg:<replaceable>meine Suche</replaceable></userinput> eine Suche nach <replaceable>meine Suche</replaceable> bei Google durchgeführt.

source: One can see why we call these pseudo &URL; schemes. They are used like a &URL; scheme, but the input is not properly &URL; encoded, so one will type <userinput>google:kde apps</userinput> and not <userinput>google:kde+apps</userinput>.
de: Es ist leicht ersichtlich, warum diese Eingaben Pseudo-&URL; genannt werden. Sie werden zwar wie eine &URL; benutzt, aber die Eingabe ist nicht im korrekten &URL;-Format gehalten, man gibt zum Beispiel <userinput>google:kde apps</userinput> und nicht <userinput>google:kde+apps</userinput> ein.

source: You can use web shortcuts wherever you would normally use &URI;s. Shortcuts for several search engines should already be configured on your system, but you can add new keywords, and change or delete existing ones in this module.
de: Sie können die Web-Kürzel generell anstelle von &URI;s verwenden. Die Kurzbefehle für viele Suchmaschinen sind bereits voreingestellt, aber Sie können in diesem Modul nach Belieben neue Kurzbefehle definieren und bestehende ändern oder löschen.

source: The descriptive names of defined web shortcuts are shown in a list box. As with other lists in &kde;, you can click on a column heading to toggle the sort order between ascending and descending, and you can resize the columns.
de: In einer Liste werden die Namen der definierten Suchmaschinen und ihre Abkürzungen angezeigt. Sie können die Liste auch alphabetisch sortieren, indem Sie (wie bei anderen &kde;-Listen auch) auf ihre Überschrift klicken. Dadurch werden die Einträge in der Liste in auf- bzw. absteigender Reihenfolge sortiert.

source: At the bottom of the list the option <guilabel>Enable Web shortcuts</guilabel> has to be checked to enable this feature. Use the buttons on the right to create, modify or delete shortcuts.
de: Die Einstellung <guilabel>Web-Kürzel aktivieren</guilabel> muss ausgewählt werden, um diese Funktion zu benutzen. Mit den Knöpfen rechts neben der Listen können Web-Kürzel erstellt, geändert und gelöscht werden.

source: If <guilabel>Use preferred shortcuts only</guilabel> is checked, only web shortcuts marked as preferred in the third column of the list are used in places where only a few select shortcuts can be shown at one time.
de: Wenn <guilabel>Nur bevorzugte Web-Kürzel verwenden</guilabel> markiert ist, werden nur Web-Kürzel benutzt, die in der dritten Spalte der Liste als „bevorzugt“ aktiviert sind, wenn nur einige ausgewählte Web-Kürzel gleichzeitig angezeigt werden können.

source: Below the list you find two additional options:
de: Unter der Liste werden zwei weitere Einstellungen angezeigt:

source: Default Web shortcuts
de: Standard-Web-Kürzel

source: Select the search engine to use for input boxes that provide automatic lookup services when you type in normal words and phrases instead of a &URL;. To disable this feature select <guilabel>None</guilabel> from the list.
de: Hier können Sie die Suchmaschine auswählen, die für Eingabefelder von Programmen mit Nachschlagefunktion verwendet werden soll, also neben der Eingabe von Adressen (&URL;s) auch die Eingabe von Suchstichwörtern erlauben, wie z B. Konqueror. Zur Deaktivierung dieser Funktion wählen Sie <guilabel>Keine</guilabel> aus der Liste.

source: Keyword delimiter
de: Stichwort-Trennzeichen

source: Choose the delimiter that separates the keyword from the phrase or word to be searched.
de: Wählen Sie das Zeichen, das ein Web-Kürzel von dem Stichwort oder Ausdruck trennt, nach dem gesucht werden soll.

source: If you double-click on a specific entry in the list of defined search providers or click the <guibutton>Change</guibutton> button, the details for that entry are shown in a popup dialog. In addition to the descriptive name for the item, you can also see the &URI; which is used, as well as the associated shortcuts which you can type anywhere in &kde; where &URI;s are expected. A given search provider can have multiple shortcuts, each separated by a comma.
de: Wählt man einen Eintrag in der Liste durch Doppelklick oder durch Klicken auf den Knopf <guibutton>Ändern</guibutton> aus, werden die Details zu dieser Suchmaschine in einem Dialog angezeigt. Zusätzlich zum Namen der Suchmaschine werden auch die zum Suchen verwendete &URI;, und die der Suchmaschine zugeordneten Abkürzungen angezeigt. Diese Abkürzungen kann man überall in &kde;, eingeben, wo eine &URI; erwartet wird. Einer Suchmaschine können auch mehrere Abkürzungen zugeordnet werden. Diese sind dann durch Komma zu trennen.

source: The text boxes are used not only for displaying information about an item in the list of web shortcuts, but also for modifying or adding new items.
de: Die Textfelder dienen nicht nur zur Anzeige von Informationen über die Liste an Web-Kürzeln, sondern dienen auch deren Änderung und dem Hinzufügen von neuen Einträgen.

source: You can change the contents of either the <guilabel>Shortcut URL</guilabel> or the <guilabel>Shortcuts</guilabel> text box. Click <guibutton>OK</guibutton> to save your changes or <guibutton>Cancel</guibutton> to exit the dialog with no changes.
de: Die Inhalte der Eingabefelder <guilabel>Adresse des Web-Kürzels</guilabel> und<guilabel>Web-Kürzel</guilabel> können geändert werden. Durch Klicken auf <guibutton>OK</guibutton> werden die Änderungen übernommen, durch <guibutton>Abbrechen</guibutton> wird der Dialog geschlossen und die Änderungen verworfen.

source: If you examine the contents of the <guilabel>Shortcuts URL</guilabel> text box, you will find that most, if not all of the entries have a <option>\{@}</option> in them. This sequence of four characters acts as a parameter, which is to say that they are replaced by whatever you happen to type after the colon character that is between a shortcut and its parameter. To add this query placeholder to a shortcuts url, click on the button at the right of the text box. Let's consider some examples to clarify how to use web shortcuts.
de: Bei genauerer Betrachtung des Feldes <guilabel>Adresse des Web-Kürzels</guilabel> fällt auf, dass die meisten (wenn nicht sogar alle) Einträge den Parameter <option>\{@}</option> enthalten. Diese Folge von vier Zeichen ist ein Platzhalter, und wird durch dasjenige ersetzt, was bei einer Suchanfrage hinter dem Doppelpunkt steht. Um diesen Platzhalter in eine Web-Kürzel-Adresse einzufügen, drücken Sie den Knopf rechts neben dem Eingabefeld. Damit die Benutzung von Web-Kürzeln etwas klarer wird, sollte man sich die folgenden Beispiele ansehen.

source: Suppose that the &URI; is <userinput>http://www.google.com/search?q=\{@}</userinput>, and <userinput>gg</userinput> is a shortcut to this &URI;. Then, typing <userinput>gg:<replaceable>alpha</replaceable></userinput> is equivalent to <userinput>http://www.google.com/search?q=<replaceable>alpha</replaceable></userinput>. You could type anything after the <userinput>:</userinput> character; whatever you have typed simply replaces the <option>\{@}</option> characters, after being converted to the appropriate character set for the search provider and then properly &URL;-encoded. Only the <option>\{@}</option> part of the search &URI; is touched, the rest of it is supposed to be properly &URL;-encoded already and is left as is.
de: Angenommen, dass bei Such-&URI; steht: <userinput>http://www.google.com/search?q=\{@}</userinput> und dass <userinput>gg</userinput> ein Kurzbefehl für diese &URI; ist. Eine Eingabe von <userinput>gg:<replaceable>alpha</replaceable></userinput> entspricht dann <userinput>http://www.google.com/search?q=<replaceable>alpha</replaceable></userinput>. Sie können beliebige Zeichen hinter dem <userinput>:</userinput> eingeben. Was auch immer dort eingegeben wird, ersetzt die Sequenz <option>\{@}</option> (nachdem das Zeichenformat in den für den Such-Provider passenden Zeichensatz umgewandelt wurde). Nur der <option>\{@}</option>-Teil der Such-&URI; wird konvertiert. Vom Rest wird von vornherein angenommen, dass er sich bereits in einem korrekten &URL;-codierten Format befindet.

source: You can also have shortcuts without parameters. Suppose the &URI; was <emphasis>file:/home/me/mydocs/calligra/words</emphasis> and the shortcut was <emphasis>mywords</emphasis>. Then, typing <userinput>mywords:</userinput> is the same as typing the complete &URI;. Note that there is nothing after the colon when typing the shortcut, but the colon is still required in order for the shortcut to be recognized as such.
de: Sie können auch Kurzbefehle ohne Parameter erstellen. Angenommen, die &URI; ist <emphasis>file:/home/ich/meinedocs/calligra/words</emphasis> und der dazugehörige Kurzbefehl ist <emphasis>meinwords</emphasis>. Dann führt die Eingabe von <userinput>meinwords:</userinput> zum selben Ergebnis wie die komplette &URI;. Es ist zu beachten, dass man zwar nichts hinter dem Doppelpunkt eingeben muss, dieser aber trotzdem notwendig ist, damit die Eingabe als Kurzbefehl akzeptiert wird.

source: By now, you will have understood that even though these shortcuts are called web shortcuts, they really are shortcuts to parameterized &URI;s, which can point not only to web sites like search engines but also to anything else that can be pointed to by a &URI;. Web shortcuts are a very powerful feature of navigation in &kde;.
de: Spätestens jetzt sollte klar sein, dass die Kurzbefehle nicht nur für Suchmaschinen, sondern für alle Arten von parametrisierten &URI;s verwendet werden können. Diese können nicht nur auf Internetseiten sondern auf alles verweisen, worauf man mit einer &URI; verweisen kann. Das macht diese Kurzbefehle zu einem sehr nützlichen Werkzeug in &kde;.
