Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kde-runtime/kcontrol_solid-device-automounter.po
Languages: de

source: Removable Devices
de: Wechselmedien

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Burkhard</firstname><surname>Lück</surname><affiliation><address><email>lueck@hube-lueck.de</email></address></affiliation><contrib>Übersetzung</contrib></othercredit>

source: Systemsettings
de: Systemeinstellungen

source: automount
de: Automatisches Einbinden

source: device
de: Gerät

source: This dialog allows you to configure automatic handling of removable storage media.
de: In diesem Dialog können Sie den automatischen Umgang mit Wechselmedien einrichten.

source: If you enable the automatic mounting features in this module, you will not need to use the device notifier applet or the navigation panel in the file manager to get access to a recently plugged in device.
de: Aktivieren Sie das automatische Einbinden von Wechselmedien in diesem Modul, müssen Sie das Miniprogramm „Geräteüberwachung“ oder die Seitenleiste im Dateimanager nicht verwenden, um Zugriff auf ein gerade eingestecktes Gerät zu erhalten.

source: At the top of the dialog you find the global settings, which can be overridden for each single device in the <guilabel>Device Overrides</guilabel> list. For a single-user desktop it is recommended to have all the check boxes above the overrides list enabled.
de: Oben im Dialog werden die globalen Einstellungen angezeigt, die für jedes einzelne Gerät in der Liste <guilabel>Vorrangige Geräte-Behandlung</guilabel> überschrieben werden können. Auf einem System mit nur einem Benutzer ist es sinnvoll, alle globalen Einstellungen zu aktivieren.

source: Enable automatic mounting of removable media
de: Automatisches Einbinden von Wechselmedien aktivieren

source: When this is unchecked, no device automounting of any kind will happen, regardless of anything selected in the <guilabel>Device Overrides</guilabel> section.
de: Wenn diese Einstellung nicht aktiviert ist, werden keinerlei Geräte automatisch eingebunden. Dabei ist es unerheblich, ob im Abschnitt <guilabel>Vorrangige Geräte-Behandlung</guilabel> besondere Einstellungen vorgenommen wurden.

source: Only automatically mount removable media that has been manually mounted before
de: Nur Geräte automatisch einbinden, die schon zuvor eingebunden wurden

source: When this is checked, &kde; will only automatically mount devices it remembers. A device is <quote>remembered</quote> if it has ever been mounted before; &eg; plugging in a USB media player to charge is not sufficient to <quote>remember</quote> it. If the files are not accessed, &kde; will not automatically mount the player next time it is seen. Once they have been accessed, however, &kde; will remember to automatically make the contents accessible to your system.
de: Wenn diese Einstellung aktiviert ist, wird &kde; nur Geräte automatisch einbinden, die auch schon zuvor einmal eingebunden waren. Dies könnte &eg; ein USB-Mediaplayer sein, der zum Laden angeschlossen wurde. Wenn dabei auf keine Dateien zugegriffen wurde, wird &kde; den Player beim nächsten Anschließen nicht automatisch einbinden. Wenn allerdings einmal auf Dateien zugegriffen wurde, wird sich &kde; daran erinnern und den Inhalt des Players auch beim nächsten Mal verfügbar machen.

source: Mount all removable media at login
de: Alle Wechselmedien beim Anmelden einbinden

source: If any removable storage devices are connected to your system when you login to your desktop, &kde; will automatically make the contents available to your system for other programs to read.
de: Wenn bei Ihrer Anmeldung an bereits Wechselmedien angeschlossen sind, wird &kde; den Inhalt der Geräte automatisch für Sie verfügbar machen.

source: Automatically mount removable media when attached
de: Wechselmedien beim Anschluss automatisch einbinden

source: When this is checked, &kde; will automatically make the contents of any storage device available to the system when it is plugged in or attached.
de: Wenn diese Einstellung aktiviert ist, wird &kde; den Inhalt von Wechselmedien automatisch verfügbar machen, sobald sie angeschlossen werden.

source: Device Overrides
de: Vorrangige Geräte-Behandlung

source: This list contains the storage devices known to &kde;. If <guilabel>Automount on Login </guilabel>is checked, the device will be automatically mounted even though <guilabel>Mount all removable media at login</guilabel> is unchecked. The same applies for <guilabel>Automount on Attach</guilabel>.
de: Diese Liste zeigt alle Geräte, die &kde; bekannt sind. Wenn die Einstellung <guilabel>Automatisches Einbinden beim Anmelden</guilabel> aktiviert ist, wird das Gerät automatisch eingebunden, selbst wenn die Einstellung <guilabel>Alle Wechselmedien beim Anmelden einbinden</guilabel> nicht aktiviert ist. Das Gleiche gilt für die Einstellung <guilabel>Automatisches Einbinden beim Anschluss des Gerätes</guilabel>

source: If <guilabel>Enable automatic mounting of removable media</guilabel> is unchecked, the overrides do not apply and no devices will be automatically mounted.
de: Wenn die Einstellung <guilabel>Automatisches Einbinden von Wechselmedien aktivieren</guilabel> ausgeschaltet ist, ist die vorrangige Geräte-Behandlung inaktiv und es werden keine Geräte automatisch eingebunden

source: Forget Device
de: Gerät vergessen

source: Clicking this button causes &kde; to <quote>forget</quote> that the selected devices ever existed. This is only useful if <guilabel>Only automatically mount removable media that has been manually mounted before</guilabel> is checked. Once a device is forgotten and &kde; is set to only automatically mount familiar devices, the device will not be automatically mounted.
de: Durch Drücken dieses Knopfes vergisst &kde; die ausgewählten Geräte. Dies kann nützlich sein, wenn Sie die Funktion <guilabel>Nur Geräte automatisch einbinden, die schon zuvor eingebunden wurden</guilabel> verwenden. Wenn Sie &kde; ein Gerät vergessen lassen, wird es zukünftig nicht mehr automatisch durch diese Funktion eingebunden.
