Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kde-runtime/kcontrol_proxy.po
Languages: de

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Stefan</firstname><surname>Winter</surname><affiliation><address><email>kickdown@online.de</email></address></affiliation><contrib>Übersetzer</contrib></othercredit>

source: Systemsettings
de: Systemeinstellungen

source: Proxies
de: Proxy-Server

source: Introduction
de: Einführung

source: Proxies are programs running on a computer that acts a server on the network you are connected to (whether by modem or other means). These programs receive &HTTP; and &FTP; requests, retrieve the relevant files from the internet, and pass them on to the client computer that made the requests.
de: Proxies sind Programme, die auf einem Rechner laufen, der in Ihrem Netz als Internetserver fungiert. Diese Programme empfangen die &HTTP;- und &FTP;-Anfragen aus dem eigenen Netz, holen die angeforderten Seiten aus dem Internet und geben sie an den Rechner weiter, von dem die Anfrage kam.

source: When you have configured a proxy, &HTTP; and/or &FTP; requests are re-routed through the computer that is acting as a proxy server. However, you can also select specific hosts which should be contacted directly, rather than through the proxy server. If you are on a local network, for example, access to local hosts probably doesn't need to go through a proxy server.
de: Wenn Sie einen Proxy eingerichtet haben, werden &HTTP;- und/oder &FTP;-Anfragen durch den Rechner weitergeleitet, der als Proxy-Server fungiert. Allerdings ist es meist zweckmäßig, bestimmte Rechner anzugeben, mit denen eine direkte Verbindung (also ohne Proxy-Server) hergestellt werden soll. Wenn Sie sich zum Beispiel innerhalb eines lokalen Netzes befinden, brauchen Anfragen an lokale Rechner normalerweise nicht über einen Proxy-Server zu laufen.

source: You should only need to configure a proxy server if your network administrator requires it (if you are a dial-up user, that would be your internet service provider or <acronym>ISP</acronym>). Otherwise, especially if you are feeling a bit confused about this proxy business, but everything seems to be fine with your internet connection, you don't need to change anything.
de: Sie müssen nur dann einen Proxy-Server einzurichten, wenn Ihr Netzwerkadministrator es verlangt (wenn Sie sich über Modem einwählen, wäre das zum Beispiel Ihr Internet Service Provider [<acronym>ISP</acronym>]). Wenn Sie nicht wissen, worum es bei Proxy-Konfiguration geht und wenn Ihre Internet-Verbindung in Ordnung ist, dann brauchen Sie nichts an der Konfiguration ändern.

source: Please note that using proxy servers is optional, but has the benefit or advantage of giving you faster access to data on the internet.
de: Die Verwendung von Proxy-Servern ist optional, hat aber den Vorteil, dass der Zugriff auf Daten aus dem Internet beschleunigt wird.

source: If you are uncertain whether or not you need to use a proxy server to connect to the internet, please consult with your internet service provider's setup guide or your system administrator.
de: Falls man sich nicht sicher ist, ob man einen Proxy-Server verwenden muss, sollte man die vom Internet-Provider bereitgestellten Informationen durchsehen oder den Systemverwalter fragen.

source: <title>Use</title>
de: <title>Benutzung</title>

source: No Proxy
de: Kein Proxy

source: Select this option if you do <emphasis>not</emphasis> want to use a proxy server and connect to the Internet directly.
de: Wählen Sie diese Einstellung aus, wenn Sie den Proxy-Server <emphasis>nicht</emphasis> verwenden möchten und direkt mit dem Internet verbunden sind.

source: If you have decided to use a proxy, you have several methods to configure the settings for it.
de: Falls Sie einen Proxy-Server verwenden möchten, können Sie die Einstellungen hierfür auf mehrere Arten ändern.

source: Detect proxy configuration automatically
de: Proxy-Einrichtung automatisch erkennen

source: Select this option if you want the proxy setup configuration script file to be automatically detected and downloaded.
de: Dieses Optionsfeld sollte man auswählen, wenn eine Proxy-Konfigurationsdatei automatisch gesucht und heruntergeladen werden soll.

source: This option only differs from the next choice in that it <emphasis>does not</emphasis> require you to supply the location of the configuration script file. Instead, it will be automatically downloaded using <quote>Web Proxy Auto-Discovery</quote> (<acronym>WPAD</acronym>) protocol.
de: Der Unterschied zur nächsten Auswahlmöglichkeit besteht nur darin, dass diese Auswahl <emphasis>keine</emphasis> Angabe eines Konfigurationsskriptes erfordert. Stattdessen wird es automatisch unter Verwendung des <quote>Web Proxy Auto-Discovery</quote> (<acronym>WAPD</acronym>) heruntergeladen.

source: If you have a problem using this setup, please consult the <acronym>FAQ</acronym> section at <ulink url="http://www.konqueror.org">http://www.konqueror.org</ulink> for more information.
de: Falls es mit dieser Einstellung Probleme gibt, kann man unter <acronym>FAQ</acronym> auf <ulink url="http://www.konqueror.org">http://www.konqueror.org</ulink> weitere Informationen finden.

source: Use proxy auto configuration URL
de: Adresse zur automatischen Proxy-Einrichtung verwenden

source: Select this option if your proxy support is provided through a script file located at a specific address. You can then enter the address in the location text box, or use the <guiicon>folder</guiicon> icon to browse to it.
de: Dieses Optionsfeld sollte man zur Einrichtung des Proxy-Servers wählen, wenn man eine Skriptdatei von einer bestimmten Adresse verwenden möchte. Man kann die Adresse in das Eingabefeld Pfad eingeben oder über das Symbol <guiicon>Ordner</guiicon> aus dem Dateisystem auswählen.

source: Use system proxy configuration
de: Proxy-Einrichtung des Systems verwenden

source: Some systems are setup with $<envar>HTTP_PROXY</envar> to allow graphical as well as non-graphical applications to share the same proxy configuration information.
de: Einige Systeme werden mit Hilfe von $<envar>HTTP_PROXY</envar> eingerichtet, damit grafische und nichtgrafische Anwendungen dieselbe Proxy-Konfiguration verwenden.

source: If you know this applies to you, select this option and click on the <guibutton>Auto Detect</guibutton> button to provide the environment variable names used to set the address of the proxy server(s).
de: Falls das auf das eigene System zutrifft, sollte man diese Auswahlmöglichkeit wählen und den Knopf <guibutton>Automatisch erkennen</guibutton> verwenden, um die Umgebungsvariablen anzugeben, die zur Einrichtung des Proxy-Servers verwendet werden.

source: In the <guilabel>Exceptions</guilabel> field enter the environment variable, &eg; $<envar>NO_PROXY</envar>, used to store the addresses of sites for which the proxy server should not be used.
de: Tragen Sie im Feld <guilabel>Ausnahmen</guilabel> den Namen der Umgebungsvariablen ein, &eg; $<envar>NO_PROXY</envar> für Adressen, für die kein Proxy-Server verwendet werden soll.

source: Use <guilabel>Show the value of the environment variables</guilabel> to show the value of an environment variable instead of its name. However it is not possible to edit the values of environment variables in this module.
de: Verwenden Sie <guilabel>Werte der voreingestellten Umgebungsvariablen anzeigen</guilabel>, um statt der Namen der Umgebungsvariablen deren Werte anzuzeigen. Es ist jedoch nicht mögliche, diese Werte hier zu ändern.

source: Use manually specified proxy configuration
de: Manuelle Proxy-Einrichtung verwenden

source: The complete addressing information for the proxy includes both the Internet address and a port number. You should enter these into the relevant text boxes. Check <guilabel>Use this proxy server for all protocols</guilabel> to copy the addresses and port of the HTTP proxy server into all other proxy fields, in order to help save some typing.
de: Die bei der Proxy-Konfiguration benötigten Informationen sind die Internetadresse und die Port-Nummer. Sie sollten beide in die entsprechenden Textfelder eingeben. Kreuzen Sie <guilabel>Diesen Proxy-Server für alle Protokolle verwenden</guilabel> an, um die Adresse und den Port des HTTP-Proxy-Servers in die Felder für alle anderen Proxy-Server zu kopieren und damit einige Tipparbeit einzusparen.

source: Exceptions
de: Ausnahmen

source: Enter a comma separated list of hostnames or ip addresses that should be excluded from using the above proxy settings. If you want to exclude all hosts for a given domain, then simply enter the domain name preceded by a dot. For example, to exclude all hostnames for kde.org, enter <userinput>.kde.org</userinput>. Wildcard characters such as <userinput>*</userinput> or <userinput>?</userinput> are not supported and will have no effect. Additionally, you can also enter IP addresses, e.g. 127.0.0.1 and IP addresses with a subnet, e.g. 192.168.0.1/24.
de: Geben Sie eine durch Komma getrennte Liste von Rechnernamen und IP-Adressen ein, die die oben genannten Proxy-Einstellungen nicht verwenden sollen. Möchten Sie alle Rechner einer bestimmten Domäne ausschließen, geben Sie den Namen der Domäne mir vorangestelltem Punkt ein. Um zum Beispiel alle Rechnernamen von kde.org auszuschließen, tragen Sie <userinput>.kde.org</userinput> ein. Platzhalterzeichen wie <userinput>*</userinput> oder <userinput>?</userinput> werden nicht unterstützt und bleiben unwirksam. Zusätzlich können auch IP-Adressen wie &eg; 127.0.0.1 und IP-Adressen mit einer Subnetzmaske wie 192.168.0.1/24 benutzt werden.

source: You can also choose <guilabel>Use proxy settings only for addresses in the Exceptions list</guilabel>.
de: Außerdem kann man <guilabel>Proxy-Einstellungen nur für Adressen in der Ausnahmen-Liste verwenden</guilabel> auswählen.

source: Check this box to reverse the use of the exception list, &ie; the proxy servers will only be used when the requested &URL; matches one of the addresses listed here.
de: Markiert man dieses Ankreuzfeld, so wird die Verwendung der Ausnahmeliste umgekehrt, d.h. der Proxy-Server wird nur verwendet, wenn die angeforderte &URL; in der Adressliste aufgeführt ist.

source: This feature is useful if all you need is a proxy to access a few specific sites, for example, an internal intranet. If you have more complex requirements you might want to use a configuration script.
de: Diese Option ist sehr nützlich, falls man den Proxy nur für den Zugriff auf wenige Seiten, &eg; für ein internes Intranet, benötigt. Benötigen Sie eine noch komplexere Konfiguration, sollte Sie ein Konfigurationsskript verwenden.
