Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kde-runtime/kcontrol_kcmnotify.po
Languages: de

source: System Notification Settings
de: Benachrichtigungen verwalten

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Frank</firstname><surname>Schütte</surname><affiliation><address><email>F.Schuette@t-online.de</email></address></affiliation><contrib>Deutsche Übersetzung</contrib></othercredit>

source: Systemsettings
de: Systemeinstellungen

source: system notification
de: Systemnachrichten

source: notification
de: Nachrichten

source: &kde;, like all applications, needs to inform the user when a problem occurs, a task is completed, or something has happened. &kde; uses a set of <quote>System Notifications</quote> to keep the user informed on what is happening.
de: Wie andere Anwendungen muss auch KDE den Benutzer informieren, wenn ein Problem aufgetreten ist, wenn eine Aufgabe beendet wurde oder wenn ein anderes Ereignis eingetreten ist. KDE verwendet eine Reihe von <quote>Systemnachrichten</quote>, um den Benutzer zu informieren.

source: Using this module, you can determine what &kde; does to communicate each event.
de: In diesem Modul können Sie einstellen, wie KDE Ereignisse bekanntmachen soll.

source: This settings module consists of the two tabs <guilabel>Applications</guilabel> and <guilabel>Player Settings</guilabel>.
de: Dieses Einstellungsmodul besteht aus den zwei Karteikarten <guilabel>Anwendungen</guilabel> und <guilabel>Wiedergabe-Einstellungen</guilabel>.

source: Applications
de: Anwendungen

source: To configure a notification, simply select the application from the drop down box at the top of the dialog labeled <guilabel>Event source:</guilabel>. This will lead to a list of all configurable notifications for the application. The list of notifications includes 6 columns to the left of the notification name. These columns (from left to right) are:
de: Um eine Systemnachricht einzurichten, wählen Sie die Anwendung aus dem Auswahlfeld <guilabel>Quelle für das Ereignis:</guilabel>. Dies führt zur Anzeige aller für diese Anwendung verfügbaren Systemnachrichten. Die Liste hat links vom Namen der Nachricht sechs Spalten. Diese Spalten (von links nach rechts) sind:

source: <guiicon>Play a sound</guiicon>
de: <guiicon>Klang abspielen</guiicon>

source: This does exactly what you think it does. If an icon is present in this column, &kde; will play a specific sound over the speakers. This is commonly used by games in &kde; for starting a new game, or other action within the game.
de: Wird in dieser Spalte ein Symbol angezeigt, spielt &kde; einen bestimmten Klang ab. Diese Einstellung wird häufig von Spielen genutzt, um den Beginn eines neuen Spiels oder andere Ereignisse zu signalisieren.

source: <guiicon>Show a message in a pop up</guiicon>
de: <guiicon>Meldungsfenster anzeigen</guiicon>

source: If an icon is present in this column, &kde; will open a message box and inform the user of the notification. This is probably the most commonly selected option for alerting users to an error.
de: Wird in dieser Spalte ein Symbol angezeigt, öffnet &kde; ein Fenster, um den Anwender über die Nachricht zu informieren. Dies ist die wahrscheinlich häufigste Einstellung, um Anwender über Fehler zu informieren.

source: <guiicon>Log to a file</guiicon>
de: <guiicon>In Protokolldatei schreiben</guiicon>

source: If an icon is present in this column, &kde; will write certain information to a file on disk for later retrieval. This is useful for tracking problems or important system changes.
de: Wird in dieser Spalte ein Symbol angezeigt, schreibt &kde; bestimmte Informationen in eine Datei auf der Festplatte. Diese kann später ausgewertet werden, um Problemen nachzugehen oder wichtige Systemänderungen nachzuvollziehen.

source: <guiicon>Mark taskbar entry</guiicon>
de: <guiicon>Eintrag in Fensterleiste hervorheben</guiicon>

source: If an icon is present in this column, &kde; will cause the taskbar to flash until the user has clicked the taskbar entry. This is most useful when you want the user to look at the program (such as a new email message was received, or the users name was said on an IRC channel).
de: Wird in dieser Spalte ein Symbol angezeigt, veranlasst &kde; die Programmleiste dazu, die Anwendung zu markieren bis der Anwender den Eintrag angeklickt hat. Dies ist vor allem nützlich, wenn der Anwender auf das Programm aufmerksam werden soll (&eg; wenn eine neue E-Mail eingetroffen ist oder der Name des Benutzers in einem IRC-Kanal erwähnt wurde).

source: Speech
de: Sprachausgabe

source: If a mark is in this checkbox, &kde; will cause the taskbar of the program sending the notification to flash until the user has clicked the taskbar entry.
de: Ist dieses Ankreuzfeld markiert, blinkt der Eintrag der betreffenden Anwendung Programmleiste bis der Anwender auf den Eintrag geklickt hat.

source: <guiicon>Run command</guiicon>
de: <guiicon>Programm ausführen</guiicon>

source: If an icon is present in this column, a separate program will be executed when this notification is performed. This can be used to execute a program to help restore data, shutdown a potentially compromised system or email another user to alert them to a problem.
de: Wird in dieser Spalte ein Symbol angezeigt, wird beim Eintreffen der Nachricht ein externes Programm ausgeführt. Damit können Sie &eg; ein Programm zur Wiederherstellung von Daten aufrufen, ein möglicherweise kompromittiertes System herunterfahren oder einen anderen Benutzer mit einer E-Mail auf das Programm aufmerksam machen.

source: Change a notification
de: Das Ändern einer Nachricht

source: To make a change to a notification, click on the name of the notification once with the &LMB;. The notification will be highlighted and the checkboxes for all notification types are enabled.
de: Um eine Nachricht zu bearbeiten, klicken Sie mit der &LMBn; auf den Namen der Nachricht. Die Nachricht wird nun hervorgehoben und Ankreuzfelder für alle Arten von Benachrichtigungen sind auswählbar.

source: You can have more than one event triggered by a single notification. As an example, it is easy to have a sound played and a message box appear in response to a system notification. One notification does not prevent other notifications from operating.
de: Eine Nachricht kann mehr als ein Ereignis auslösen. So kann beispielsweise als Reaktion auf eine Systemnachricht ein Klang abgespielt und ein Benachrichtigungsfenster angezeigt werden. Eine Benachrichtigung schließt andere Formen der Benachrichtigung nicht aus.

source: The following list details each of the notification types and how to use them.
de: Die folgende Liste beschreibt alle Nachrichtentypen und wie sie verwendet werden.

source: <guilabel>Play a sound</guilabel>
de: <guilabel>Klang abspielen</guilabel>

source: If a mark is in this checkbox, &kde; will play a sound everytime this notification is initiated. To specify the sound, use the text box to the right of the checkbox to enter the folder location of the sound file you want &kde; to play. You can use the folder button (located to the far right of the dialog box) to browse your directory tree. To hear a test of your sound, simply click on the play button (small button directly to the right of <guilabel>Play a sound</guilabel>.)
de: Ist dieses Ankreuzfeld markiert, spielt &kde; immer dann, wenn diese Nachricht eingeht, einen Klang ab. Um die Klangdatei auswählen, können Sie das Eingabefeld rechts vom Ankreuzfeld benutzen. Um eine Datei in einem Ordner zu suchen, können Sie außerdem den Knopf ganz rechts verwenden. Um die Klangdatei zu testen, klicken Sie auf den Knopf rechts neben <guilabel>Klang abspielen</guilabel>.

source: <guilabel>Show a message in a pop up</guilabel>
de: <guilabel>Meldungsfenster anzeigen</guilabel>

source: If a mark is in this checkbox, &kde; will open a message box and inform the user of the notification. The text of the box can not be changed from this dialog.
de: Ist diese Einstellung angekreuzt, öffnet &kde; ein Fenster, um den Anwender über die Nachricht zu informieren. Der Text der Benachrichtigung kann hier nicht eingestellt werden.

source: <guilabel>Log to a file</guilabel>
de: <guilabel>In Protokolldatei schreiben</guilabel>

source: If a mark is in this checkbox, &kde; will write certain information to a file on disk for later retrieval. To specify the log file to use, enter the pathname in the text box to the right of the checkbox. You can use the folder button (located to the far right of the dialog box) to browse your directory tree.
de: Ist dieses Ankreuzfeld markiert, schreibt &kde; bestimmte Informationen zur späteren Auswertung in eine Datei. Um die Protokolldatei auszuwählen, geben Sie den Pfad in das Eingabefeld rechts vom Ankreuzfeld ein. Um eine Datei in einem Ordner zu suchen, können Sie außerdem den Knopf ganz rechts verwenden.

source: <guilabel>Mark taskbar entry</guilabel>
de: <guilabel>Eintrag in Fensterleiste hervorheben</guilabel>

source: <guilabel>Run command</guilabel>
de: <guilabel>Programm ausführen</guilabel>

source: If a mark is in this checkbox, a separate program will be executed when this notification is performed. To specify the program to execute, enter the pathname in the text box to the right of the checkbox. You can use the folder button (located to the far right of the dialog box) to browse your directory tree.
de: Ist dieses Ankreuzfeld markiert, wird bei Eintreffen dieser Nachricht ein externes Programm ausgeführt. Um das externe Programm anzugeben, gebe Sie den Programmpfad in das Eingabefeld rechts ein. Sie können den Knopf (ganz rechts im Dialog) dazu verwenden, einen Ordner auszuwählen.

source: If a mark is in this checkbox, &kde; will use Jovie to speak the event message, event name or custom text.
de: Ist dieses Ankreuzfeld markiert, benutzt &kde; das Programm Jovie, um die Nachricht oder den Namen des Ereignisses oder benutzerdefinierten Text vorzulesen.

source: If you select <guilabel>Speak Custom Text</guilabel>, enter the text in the box. You may use the following substitution strings in the text:
de: Wählen Sie <guilabel>Benutzerdefinierten Text ausgeben</guilabel> und schreiben Sie diesen Text in das Eingabefeld. Dabei können folgende Platzhalter im Text verwendet werden:

source: <userinput>%e</userinput> Name of the event
de: <userinput>%e</userinput> Name des Ereignisses

source: <userinput>%a</userinput> Application that sent the event
de: <userinput>%a</userinput> Anwendung, die das Ereignis verschickt hat

source: <userinput>%m</userinput> Message sent by the application
de: <userinput>%m</userinput> Nachricht, die die Anwendung verschickt hat

source: You can use the icon columns (located to the left of the notifications) to quickly select or deselect the options. Clicking in the column with the &LMB; will toggle the notification on and off.
de: Sie können die Symbolspalten (links von der Nachricht) dazu benutzen, die jeweilige Einstellung an- oder auszuschalten. Klicken Sie dazu mit der &LMBn; in die betreffende Spalte.

source: Player Settings
de: Wiedergabe-Einstellungen

source: Use the &kde; sound system
de: &kde;-Soundsystem verwenden

source: If a mark is in this radio button, &kde; will play all sound notifications through the &kde; sound system. You can adjust the volume of system notifications using the slider.
de: Ist dieser Auswahlknopf markiert, spielt &kde; alle Klangbenachrichtungen mit dem Soundsystem von &kde; ab. Sie können die Lautstärke mit dem Schieberegler einstellen.

source: The slider only affects &kde; system notifications. Changes to this slider will not affect other sounds on your computer.
de: Der Schieberegler hat nur Einfluss auf Systemnachrichten von &kde;. Andere Klänge auf dem Rechner werden nicht beeinflusst.

source: Use an external player
de: Externen Abspieler verwenden

source: If a mark is in this radio button, &kde; will not use the &kde; sound system to play the sound. This is a good choice if the sound format you want to use is not supported by the &kde; notification system. After checking the radio box, enter the full path and name of the program you want to use into the text field. You can use the folder button (located along the right side) to browse the directory tree.
de: Ist dieser Auswahlknopf markiert, verwendet &kde; nicht das Soundsystem von &kde; zum Abspielen von Klängen. Dies ist dann von Vorteil, wenn Sie ein Datenformat verwenden möchten, das vom Nachrichtensystem von &kde; nicht unterstützt wird. Wenn Sie den Auswahlknopf markiert haben, können Sie den Pfad des gewünschten Programms zum Abspielen der Klänge in das Eingabefeld eingeben. Um eine Datei in einem Ordner zu suchen, können Sie außerdem den Knopf ganz rechts verwenden.

source: No audio output
de: Keine Audioausgabe

source: Disables all sound notifications.
de: Deaktiviert alle Sound-Benachrichtigungen.
