Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kde-runtime/kcontrol_spellchecking.po
Languages: de

source: Spell Checker
de: Rechtschreibprüfung

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Frank</firstname><surname>Schütte</surname> <affiliation><address><email>F.Schuette@t-online.de</email></address></affiliation> <contrib>Deutsche Übersetzung</contrib></othercredit>

source: Spelling
de: Rechtschreibung

source: dictionary
de: Wörterbuch

source: The configuration options available here are used as default by all &kde; applications that use &sonnet;, which is a frontend to various free spell checkers.
de: Die Einstellungen in diesem Modul werden als Voreinstellung von allen &kde;-Anwendungen benutzt, die &sonnet; verwenden. &sonnet; ist eine Benutzeroberfläche für verschiedene freie Rechtschreibprüfungen.

source: To use &sonnet; you need to install spell checkers like &eg; <ulink url="http://aspell.net/">GNU Aspell</ulink>, <ulink url="http://www.abisource.com/projects/enchant/">Enchant</ulink>, <ulink url="http://hspell.ivrix.org.il/">Hspell</ulink>, <ulink url="http://fmg-www.cs.ucla.edu/geoff/ispell.html">ISpell</ulink> or <ulink url="http://hunspell.sourceforge.net/">Hunspell</ulink> and additionally the corresponding dictionaries for your language.
de: Um &sonnet; benutzen zu können, müssen Sie Rechtschreibprogramme wie &eg; <ulink url="http://aspell.net/">GNU Aspell</ulink>, <ulink url="http://www.abisource.com/projects/enchant/">Enchant</ulink>, <ulink url="http://hspell.ivrix.org.il/">Hspell</ulink>, <ulink url="http://fmg-www.cs.ucla.edu/geoff/ispell.html">ISpell</ulink> or <ulink url="http://hunspell.sourceforge.net/">Hunspell</ulink> und zusätzlich auch die zugehörigen Wörterbücher für Ihre Sprache installieren.

source: The configuration options selected here can be overridden by each application.
de: Einstellungen in diesen Modul können in jeder Anwendung überschrieben werden.

source: In the drop down box <guilabel>Default language</guilabel> choose from the available dictionaries, which one to use for &sonnet;.
de: Wählen Sie aus dem Auswahlfeld <guilabel>Standardsprache</guilabel> aus den verfügbaren Wörterbüchern eines aus, das &sonnet; verwenden soll.

source: Spell Options
de: Einstellungen zur Rechtschreibprüfung

source: Automatic spell checking enabled by default
de: Automatische Rechtschreibprüfung in der Voreinstellung aktiviert

source: If a mark is placed in this checkbox, the spelling of words will be check in your document as you type them. Misspelled will have a red line drawn under them.
de: Wenn Sie dieses Ankreuzfeld markiert haben werden die Wörter in Ihrem Dokument auf richtige Schreibweise überprüfen, während Sie schreiben. Falsch geschriebene Wörter werden rot unterstrichen dargestellt.

source: Skip all uppercase words
de: Durchgehend groß geschriebene Wörter überspringen

source: If a mark is placed in this checkbox, the spelling of any word which consists of all capital letters will not be checked.
de: Wenn dieses Ankreuzfeld markiert ist, werden keine vollständig in Großbuchstaben geschrieben Wörter überprüft.

source: This is useful for document using a large number of acronyms. If this box is left unchecked, most of those acronyms will be incorrectly marked. By placing a mark in this checkbox, the acronyms will not be marked as misspelled.
de: Das ist dann nützlich, wenn Sie ein Dokument mit vielen Abkürzungen schreiben. Wenn dieses Ankreuzfeld nicht markiert ist, werden die meisten Abkürzungen fälschlicherweise als fehlerhaft markiert. Wenn Sie diese Einstellung aktivieren, werden diese Abkürzungen nicht als fehlerhaft geschrieben markiert.

source: Skip run-together words
de: Zusammengezogene Wörter überspringen

source: If this box is not checked, then words that appear in the dictionary separately, but have been run together, are considered to be spelling errors. Examples of such words are shutout, cannot, and blackout.
de: Ist diese Option markiert, werden Wörter, die im Wörterbuch getrennt auftauchen und im Text zusammengeschrieben erscheinen, als Rechtschreibfehler betrachtet. Zum Beispiel wird <quote>Armbanduhr</quote> auch dann als Rechtschreibfehler betrachtet, wenn es nicht im Wörterbuch auftaucht, die Wörter <quote>Armband</quote> und <quote>Uhr</quote>aber einzeln im Wörterbuch vorhanden sind.

source: Checking this box will help prevent applications from flagging website and email addresses for spelling errors. These addresses often contain words run together.
de: Mit dieser Einstellung werden Wörter wie Webseiten- und E-Mail-Adressen nicht als Fehler markieren. Diese Adressen enthalten oft zusammengeschriebene Wörter.

source: Ignoring words
de: Folgende Wörter ignorieren

source: The bottom half of the dialog box allows you to designate specific words (they may be specialized terminology, proper names, &etc;) which should be ignored by the spelling program.
de: In der unteren Hälfte des Dialogs können Sie besondere Wörter festlegen (z. B. Fachbegriffe, Eigennamen &etc;) die von der Rechtschreibprüfung ignoriert werden.

source: Adding a word to the ignore list
de: Ein Wort zur Ignorieren-Liste hinzufügen

source: To add a word, type the word in the text box and click the <guibutton>Add</guibutton> button.
de: Um hier ein Wort hinzuzufügen, geben Sie das Wort im Textfeld ein und klicken auf den Knopf <guibutton>Hinzufügen</guibutton>.

source: Deleting a word from the ignore list
de: Ein Wort aus der Ignorieren-Liste entfernen

source: To remove a word, select the word in the listbox containing all the currently ignored words by clicking on it with the &LMB;. Now click the <guibutton>Remove</guibutton> button.
de: Ein Wort in der aktuellen Ignorieren-Liste wird entfernt, indem Sie es mit einem Klick mit der &LMBn; markieren und anschließend auf den Knopf <guibutton>Entfernen</guibutton> klicken.

source: Changing the order a word appears in the list
de: Reihenfolge der Wörter in der Liste ändern

source: To move a word in the list, select the word in the listbox containing all the currently ignored words by clicking on it with the &LMB;. Now click the <guibutton>Move Up</guibutton> button or the <guibutton>Move Down</guibutton> button to move the word within the list.
de: Wenn Sie ein Wort in der Liste verschieben wollen, wählen Sie das Wort in der aktuellen Ignorieren-Liste aus, indem Sie mit der &LMBn; darauf klicken. Dann klicken Sie auf den Knopf <guibutton>Nach oben</guibutton> oder den Knopf <guibutton>Nach unten</guibutton>.

source: When you are happy with the changes, simply click <guibutton>Apply</guibutton>.
de: Nachdem Sie alle Einstellungen angepasst haben, klicken sie auf <guibutton>Anwenden</guibutton>, um die Änderungen zu übernehmen.

source: Clicking on the <guibutton>Defaults</guibutton> button restores all values to their default values.
de: Mit dem Knopf <guibutton>Voreinstellungen</guibutton> setzen Sie alle Einstellungen auf ihre Standardwerte zurück.
