Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kde-runtime/kcontrol_filetypes.po
Languages: de

source: When you use a filemanager like &dolphin; or &konqueror;, you can <mousebutton>right</mousebutton> mouse click, and a menu will with an entry labeled <guimenu>Open with...</guimenu> will appear. This box lists the applications that will appear, in the order they will appear, under this menu.
de: In einer Dateiverwaltung wie &konqueror; oder &dolphin; kann durch Klicken der <mousebutton>rechten Maustaste</mousebutton> ein Kontextmenü geöffnet werden. Dieses enthält das Untermenü <guisubmenu>Öffnen mit ...</guisubmenu>. Das Listenfeld zeigt die Anwendungen in der Reihenfolge an, wie sie unter dem Menü dann erscheinen.

source: You can use the <guibutton>Move Up</guibutton> and <guibutton>Move Down</guibutton> buttons to change the order.
de: Die Reihenfolge kann mit den Knöpfen <guibutton>Nach oben</guibutton> und <guibutton>Nach unten</guibutton> verändert werden.

source: Making changes permanent
de: Änderungen speichern

source: When you are done making any changes to mime types, you can click <guibutton>Apply</guibutton> to make your changes permanent, but keep you in this module.
de: Um die gemachten Änderungen zu übernehmen und im Modul zu bleiben, klickt man auf <guibutton>Anwenden</guibutton>.
