Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kde-runtime/kcontrol_khtml-plugins.po
Languages: de

source: Browser Plugins
de: Erweiterungsmodule für den Webbrowser

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Jürgen</firstname><surname>Nagel</surname><affiliation><address><email>JuergenNagel@web.de</email></address></affiliation><contrib>Deutsche Übersetzung</contrib></othercredit> <othercredit role="translator"><firstname>Frank</firstname><surname>Brücker</surname><affiliation><address><email>f.bruecker@gmx.de</email></address></affiliation><contrib>Überarbeitung der deutschen Übersetzung</contrib></othercredit>

source: Systemsettings
de: Systemeinstellungen

source: Browsing
de: Browsen

source: <keyword>Plugins</keyword>
de: <keyword>Module</keyword>

source: Global Settings
de: Globale Einstellungen

source: The first setting here is <guilabel>Enable Plugins globally</guilabel>. If you disable this check box, then &konqueror; will not use any plugins. If you enable it, then any installed and configured plugins that it can find will be used by &konqueror;
de: Die erste Option auf dieser Karteikarte ist <guilabel>Erweiterungsmodule global aktivieren</guilabel>. Ist dieses Ankreuzfeld deaktiviert, wird &konqueror; keine Plugins verwenden. Aktivieren Sie diese Option, werden alle installierten und eingerichteten Plugins von &konqueror; verwendet.

source: You can also restrict &konqueror; to <guilabel>Only allow HTTP and HTTPS URLs for plugins</guilabel> by checking the box.
de: Durch Markieren dieses Ankreuzfeldes können Sie &konqueror; außerdem dazu bringen, dass er <guilabel>Für Erweiterungsmodule nur http- und https-Adressen zulässt</guilabel>.

source: The next option determines, if plugins are loaded on demand only.
de: Die nächste Einstellung legt fest, ob Erweiterungsmodule nur bei Bedarf geladen werden.

source: Use the slider labeled <guilabel>CPU priority for plugins</guilabel> to adjust this setting.
de: Mit dem Schieberegler <guilabel>CPU-Priorität für Erweiterungsmodule</guilabel> kann die verwendete Priorität eingestellt werden.

source: Click the <guibutton>Domain-Specific Settings</guibutton> button to open a dialog where you can set specific plugin policies for any particular host or domain. These policies will be used instead of the default policy for enabling or disabling plugins on pages sent by these domains or hosts.
de: Klicken Sie auf den Knopf <guibutton>Domain-spezifische Einstellungen</guibutton> um einen Dialog zu öffnen, in dem Sie spezielle Erweiterungsmodul-Regelungen für bestimmte Server oder Domains festlegen können. Diese Regelung wird bei diesen Domains oder Servern anstelle der allgemeinen Vorgaben zum Aktivieren oder Deaktivieren von Erweiterungen verwendet.

source: Add a new policy here or select a policy and use the controls on the right to modify it.
de: Fügen Sie hier eine neue Regelung hinzu oder wählen Sie eine Regelung aus und benutzen Sie die Steuerungselemente rechts, um diese zu bearbeiten.

source: <title>Plugins</title>
de: <title>Module</title>

source: Introduction
de: Einleitung

source: As &Netscape;'s <application>Navigator</application> has been a web browsing standard for many years, so-called &Netscape; plugins have appeared that allow rich web content. Using those plugins, web sites can contain <acronym>PDF</acronym> files, flash animations, video, &etc; With &konqueror;, you can still use these plugins to take advantage of rich web content.
de: Da &Netscape;'s <application>Navigator</application> jahrelang der Standardinternetbrowser war, entwickelten sich so genannte &Netscape; Plugins, die die Darstellung erweiterter Inhalte einer Internetseite übernehmen. Mit derartigen Plugins können Internetseiten zum Beispiel <acronym>PDF</acronym>-Dateien, Flash-Animationen oder Videos enthalten. &konqueror; kann diese Plugins ebenfalls verwenden, um diese erweiterten Inhalte anzuzeigen.

source: &Netscape; plugins should not be confused with &konqueror; plugins. The latter ones specifically extend &konqueror;'s functionality; they are normally not used to display rich web content.
de: &Netscape; Plugins dürfen nicht mit &konqueror; Plugins verwechselt werden. Die letzteren dienen der funktionellen Erweiterung von &konqueror;. Sie dienen normalerweise nicht zur Darstellung von erweiterten Internetseiten.

source: Scan for Plugins
de: Nach Erweiterungen suchen

source: &konqueror; has to know where your &Netscape; plugins are installed. This can be in several places, &ie; you might have system-wide plugins in <filename class="directory">/opt/netscape/plugins</filename> and your personal plugins in <filename class="directory">$<envar>HOME</envar>/.netscape/plugins</filename>. However, &konqueror; will not automatically use the installed plugins: it first has to scan a list of folders. You can initiate the scan by clicking <guibutton>Scan for Plugins</guibutton>.
de: &konqueror; muss natürlich wissen, wo Ihre &Netscape;-Module installiert sind. Dafür gibt es verschiedene Möglichkeiten. Systemweite Module befinden sich vermutlich in <filename class="directory">/opt/netscape/plugins</filename> und Ihre persönlichen Module befinden sich in <filename class="directory">$<envar>HOME</envar>/.netscape/plugins</filename>. &konqueror; verwendet diese Module allerdings nicht automatisch. Zunächst muss &konqueror; explizit nach neuen Modulen suchen. Klicken Sie dazu auf <guilabel>Nach Erweiterungen suchen</guilabel>.

source: To find plugins, &konqueror; will look in the folders specified in the <guilabel>Folders</guilabel> frame. When you use this control module for the first time, this list will already be filled with reasonable paths that should work on most operating systems. If you need to provide a new path, click the <guibutton>New</guibutton> button; then you can either enter the new path in the text edit box to the left, or choose a folder using the file dialog by clicking the <guibutton>Open file</guibutton> icon. As scanning the folders can take a little time, you might want to remove folders from the list where you know that no plugins are installed: do this by selecting a folder and clicking <guibutton>Remove</guibutton>. Using the <guibutton>Up</guibutton> and <guibutton>Down</guibutton> buttons you can change the order in which folders will be scanned by moving the selected folder up or down.
de: Um neue Module zu finden, sucht &konqueror; in den Ordnern, die unter <guilabel>Ordner</guilabel> aufgelistet sind. Diese Liste ist bereits mit sinnvollen Pfaden gefüllt. Falls Sie weitere Pfade hinzufügen müssen, klicken Sie auf <guibutton>Neu</guibutton> und geben den gewünschten Pfad entweder in das Textfeld ein oder Sie wählen einen Ordner durch Klicken auf das Symbol <guibutton>Dateiauswahl</guibutton>. Da das Durchsuchen von Ordnern Zeit kostet, können Sie Ordner, in denen sich mit Sicherheit keine Module befinden, aus der Liste entfernen. Wählen Sie den gewünschten Eintrag aus und klicken Sie auf <guibutton>Entfernen</guibutton>. Mit den Knöpfen <guibutton>Aufwärts</guibutton> und <guibutton>Nach unten</guibutton> können Sie die Reihenfolge verändern, in der die Ordner durchsucht werden.

source: As usual, click <guibutton>Apply</guibutton> to save your changes permanently.
de: Klicken Sie wie üblich <guibutton>Anwenden</guibutton>, um Ihre Änderungen zu speichern.

source: In this section, you can see a list of the &Netscape; plugins found by &konqueror;, displayed as a tree. Double click on a plugin to fold it out and you will see that the different mime types this plugin can handle will be displayed as branches. Fold out a mime type to see its info.
de: Auf diesem Abschnitt können Sie eine Liste der &Netscape;-Module sehen, die von &konqueror; gefunden wurden. Die Darstellung hat eine Baumstruktur. Ein Doppelklick auf ein Modul zeigt die Mime-Typen, die dieses Modul verarbeiten kann, als Äste. Doppelklickt man auf einen Mime-Typ, so werden dessen Informationen angezeigt.

source: This list is only for informational purposes.
de: Diese Liste dient nur zur Information.
