Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kde-runtime/kcontrol_icons.po
Languages: de

source: Icons
de: Symbole

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Jürgen</firstname><surname>Nagel</surname><affiliation><address><email>JuergenNagel@web.de</email></address></affiliation><contrib>Deutsche Übersetzung</contrib></othercredit>

source: KControl
de: Kontrollzentrum

source: icon
de: Symbol

source: Introduction
de: Einleitung

source: &kde; comes with a full set of icons in several sizes. These icons are being used all over &kde;: the desktop, the panel, the &konqueror; file manager, in every toolbar of every &kde; application, etc. The icons control module offers you very flexible ways of customizing the way &kde; handles icons.
de: &kde; enthält vollständige Symbolsätze in verschiedenen Größen. Diese Symbole werden überall in von &kde; verwendet: auf der Arbeitsfläche, in der Kontrollleiste, im &konqueror;-Dateimanager, in den Werkzeugleisten aller &kde;-Anwendung &etc; Im Einrichtungsmodul Symbole können die Eigenschaften dieser Symbole und ihre Nutzung in &kde; flexibel angepasst werden.

source: Here's a screenshot of the icon theme manager
de: Bildschirmfoto der Symbol-Design-Verwaltung

source: Customizing &kde; icons
de: &kde;-Symbole einrichten

source: In this module you can:
de: In diesem Modul können Sie:

source: install and choose icon themes
de: Symbol-Designs auswählen und installieren

source: choose different icon sizes
de: unterschiedliche Symbolgrößen wählen

source: assign effects to icons (for example make them semi-transparent or colorize them)
de: Symbolen Effekte zuordnen (zum Beispiel kann man sie einfärben oder halbtransparent machen)

source: configure these settings for each of the different places icons will be used in: for example the desktop, toolbars &etc;
de: diese Einstellungen für die unterschiedlichen Aufgaben, bei denen Symbole verwendet werden, getrennt einstellen: zum Beispiel für die Arbeitsfläche, Werkzeugleisten &etc;

source: Please note that some of these settings may depend on your selected icon theme. &kde; comes with three icon themes by default, Oxygen, Monochrome and Crystal SVG. There are additional color themes in the kdeartwork package.
de: Beachten Sie, dass einige Einstellungen abhängig vom gewählten Symbol-Design sind. &kde; hat drei Standard-Symbol-Designs: Oxygen, Monochrome und Crystal SVG. Im Paket kdeartwork finden Sie weitere Designs.

source: There are two pages in this module: <guilabel>Theme</guilabel> and <guilabel>Advanced</guilabel>. <guilabel>Theme</guilabel> manages the icon themes while <guilabel>Advanced</guilabel> lets you configure how icons will be used in &kde;.
de: Es gibt zwei Seiten in diesem Modul: <guilabel>Design</guilabel> und <guilabel>Erweitert</guilabel>. Auf der Seite <guilabel>Design</guilabel> wählen Sie ein Symbol-Design aus und auf der Seite <guilabel>Erweitert</guilabel> stellen Sie ein, wie diese Symbole in &kde; benutzt werden.

source: Theme
de: Design

source: At the top is a preview of the current theme icons. Most default installations will have only one icon theme available, the &kde; default Oxygen theme. There are other themes contained separately in the kdeartwork package, and you can also download more from the Internet from <ulink url="http://www.kde-look.org">http://www.kde-look.org</ulink>.
de: Oben wird eine Vorschau von Symbolen des aktuell benutzten Designs angezeigt. Die meisten Standardinstallationen enthalten nur das Standard-Design von &kde; Oxygen. Weitere Designs sind im Paket kdeartwork vorhanden oder können aus dem Internet von <ulink url="http://www.kde-look.org">http://www.kde-look.org</ulink> heruntergeladen werden.

source: Get New Themes...
de: Neue Designs herunterladen ...

source: You need to be connected to the Internet to use it. Clicking on this button will display a dialog where you can choose a new icon theme. Clicking on <guibutton>Install</guibutton> in the dialog will install the chosen icon theme and after you <guibutton>Close</guibutton> the installer your new theme is immediately available.
de: Sie müssen mit dem Internet verbunden sein, um diese Funktion benutzen zu können. Klicken Sie auf diesen Knopf, um einen Dialog zur Auswahl eines neuen Symboldesigns zu öffnen. Um ein Symboldesign zu installieren, klicken Sie auf den Knopf <guibutton>Installieren</guibutton>. Nachdem Sie den Installationsdialog mit <guibutton>Schließen</guibutton> beendet haben, können Sie das neue Symboldesign sofort benutzen.

source: <screeninfo>Get New Icon Themes</screeninfo>
de: <screeninfo>Neue Symbol-Designs herunterladen</screeninfo>

source: <phrase>Get New Icon Themes</phrase>
de: <phrase>Neue Symbol-Designs herunterladen</phrase>

source: Install Theme File...
de: Design-Datei installieren ...

source: If you dowloaded new themes from the internet, you can use this to browse to the location of those newly downloaded themes. Clicking on this button will bring you a small dialog to point to the icon theme tarball you have on your disk.
de: Wenn Sie bereits neue Designs aus dem Internet heruntergeladen haben, können Sie mit diesem Knopf bereits heruntergeladene Designs öffnen. Dazu wird ein Dialog angezeigt, in dem Sie die Adresse des Designarchivs auf Ihrem System eingeben müssen.

source: <screeninfo>Installing A New Icon Theme</screeninfo>
de: <screeninfo>Installation eines neuen Symbol-Designs</screeninfo>

source: <phrase>Installing A New Icon Theme</phrase>
de: <phrase>Installation eines neuen Symbol-Designs</phrase>

source: Clicking <guibutton>OK</guibutton> in this dialog will install the theme you pointed to and make it available in the theme list.
de: Klicken Sie in diesem Dialog auf <guibutton>OK</guibutton>, damit wird das ausgewählte Design installiert und kann in der Liste der Designs ausgewählt werden.

source: Remove Theme
de: Design entfernen

source: Clicking this button will remove all files for this theme from your system. A confirmation message is displayed and will ask you if you are really sure you want to remove all the files for this theme.
de: Wenn Sie diesen Knopf drücken, werden alle Dateien für das ausgewählte Design von Ihrem System gelöscht. Vor der Ausführung dieser Aktion müssen Sie das Löschen des Design in einem Dialog bestätigen.

source: <screeninfo>Removing A Theme</screeninfo>
de: <screeninfo>Design entfernen</screeninfo>

source: <phrase>Removing A Theme</phrase>
de: <phrase>Design entfernen</phrase>

source: Clicking <guibutton>Delete</guibutton> will remove the theme files and clicking <guibutton>Cancel</guibutton> will not delete anything and will cancel the remove action.
de: Klicken Sie auf <guibutton>Löschen</guibutton>, um alle Dateien für diesse Design zu entfernen oder klicken Sie auf <guibutton>Abbrechen</guibutton>, um diesen Dialog ohne das Löschen von Designs zu schließen.

source: Advanced
de: Erweitert

source: Looking at this second page of the icons control module, you will see two areas:
de: Auf dieser zweiten Seite des Einrichtungsmoduls Symbole gibt es zwei Bereiche:

source: An area labelled <guilabel>Use of Icon</guilabel>. Here you can choose which particular usage of icons you want to configure, for example <guilabel>Toolbar</guilabel> or <guilabel>Panel</guilabel>.
de: Im Bereich <guilabel>Verwendung des Symbols</guilabel> kann man auswählen, für welche Verwendung die Symbole eingerichtet werden sollen, zum Beispiel für die <guilabel>Werkzeugleiste</guilabel> oder die <guilabel>Kontrollleiste</guilabel>.

source: <screeninfo>Choosing the icons to configure</screeninfo>
de: <screeninfo>Auswahl der einzurichtenden Symbole</screeninfo>

source: <phrase>Choosing the icons to configure</phrase>
de: <phrase>Auswahl der einzurichtenden Symbole</phrase>

source: A preview area where you can see how icons of the selected kind will look using the current settings. Note that the state of this preview also depends on the icon state selected in the effects below (do not worry about that now, we will explain that below).
de: Im unteren Bereich können Sie sehen, wie die Symbole der ausgewählten Art mit den aktuellen Einstellungen aussehen. Beachten Sie, dass das Aussehen der Symbole zusätzlich von der Einstellung unter <guilabel>Effekt festlegen ...</guilabel> abhängt (eine Erklärung dazu folgt weiter unten).

source: When you want to configure icons, first select the usage of icons you want to configure. Change the settings until you like the preview. You can then choose a different icon usage and configure that. At the end, if you are satisfied with your settings, click <guibutton>OK</guibutton> or <guibutton>Apply</guibutton> to take the changes in effect.
de: Um Symbole einzurichten, wählt man zuerst den Verwendungsbereich der betreffenden Symbole. Dann ändert man die Einstellungen, bis die Vorschau das gewünschte Aussehen hat. Schließlich werden die Einstellungen durch Klicken auf <guibutton>OK</guibutton> gespeichert und übernommen.

source: There are two further options to consider, <guilabel>Size</guilabel> and <guilabel>Effects</guilabel>.
de: Zwei weitere Optionen sind darüberhinaus zu beachten, nämlich <guilabel>Größe</guilabel> und <guilabel>Effekt festlegen</guilabel>.

source: Icon Size
de: Symbolgröße

source: <screeninfo>Setting icons sizes</screeninfo>
de: <screeninfo>Einstellung der Symbolgröße</screeninfo>

source: <phrase>Setting icons sizes</phrase>
de: <phrase>Einstellung der Symbolgröße</phrase>

source: You can choose from a list of icon sizes. The largest icon sizes are especially useful for visually impaired people.
de: Sie können die Symbolgröße aus einer Liste auswählen. Die größeren Symbole eignen sich besonders für sehbehinderte Personen.

source: Which sizes will be offered by the icon size listbox depends on the icon theme you have selected in the icon themes control module. For example, the low color icon theme only offers the sizes 16 and 32 for desktop icons and 16, 22 and 32 for toolbar icons. The HiColor theme offers icon sizes 16, 32 and 48 as well as sizes from 64 to 128. However, as &kde; can not have all these icon sizes in store, icons using size 64 to 128 will be automatically generated which may result in a loss of quality.
de: Die im Listenfeld angebotenen Größen sind abhängig vom verwendeten Design. Das Design <quote>Wenige-Farben</quote> enthält Symbole in den Größen 16 und 32 Pixel für die Arbeitsfläche und 16, 22 und 32 Pixel für die Werkzeugleisten-Symbole. Das Design KDE-64000-Farben enthält die Symbolgrößen 16, 32 und 48 Pixel sowie von 64 bis 128 Pixel. Da diese Symbole sehr viel Speicherplatz benötigen würden, werden die Symbolgrößen 64 bis 128 Pixel automatisch erstellt. Daher kann deren Qualität etwas schlechter sein.

source: You can also choose animated icons. Many of the icons have animations associated with them. Enable the checkbox labelled <guilabel>Animate Icons</guilabel>, to enable this effect, but note that it may appear slow or jerky if your graphics card is old or you are low on memory.
de: Sie können auch bewegte Symbole verwenden. Vielen der Symbole sind Effekte für Bewegungen zugeordnet. Aktivieren Sie das Ankreuzfeld <guilabel>Symbol-Animationen</guilabel>, um diese Effekte einzuschalten. Beachten Sie aber, dass die Bewegungen langsam oder ruckelnd erscheinen können, wenn Ihre Grafikkarte alt ist oder Sie wenig Speicher haben.

source: Effects
de: Effekt festlegen

source: <screeninfo>Setting icons effects</screeninfo>
de: <screeninfo>Einstellung der Symboleffekte</screeninfo>

source: <phrase>Setting icons effects</phrase>
de: <phrase>Einstellung der Symboleffekte</phrase>

source: Finally you can configure certain <quote>filters</quote> to be applied on icons which are in one of three states:
de: Schließlich kann man bestimmte <quote>Filter</quote> auf Symbole angewendet, die sich in einem der drei Zustände befinden:

source: Default
de: Voreinstellung

source: This is how the icon will look normally.
de: So erscheint ein Symbol normalerweise.

source: <guilabel>Active</guilabel>:
de: <guilabel>Aktiv</guilabel>:

source: This is how the icon will look when the mouse cursor is over the icon.
de: So erscheint das Symbol, sobald sich der Mauszeiger darüber befindet.

source: <guilabel>Disabled</guilabel>:
de: <guilabel>Deaktiviert</guilabel>:

source: This is how the icon will look if its corresponding action is disabled, &ie; clicking on it will not lead to any result.
de: So erscheint das Symbol, wenn die zugehörige Aktion ausgeschaltet ist, &ie; ein Klicken auf das Symbol keine Auswirkungen hat.

source: Select one of these states, and press the <guibutton>Set Effect...</guibutton> button to configure a corresponding icon effect. Please note that this configuration will only affect icons of the currently selected <guilabel>Use of Icon</guilabel> category (see above): configuring an effect for active icons, while <guilabel>Toolbar</guilabel> icon usage is selected, will <emphasis>not</emphasis> affect active icons used in other places.
de: Um einen Effekt für einen bestimmten Symbolzustand festzulegen, klickt man auf den zugehörigen Knopf <guibutton>Effekt festlegen</guibutton>. Beachten Sie, dass davon nur der unter <guilabel>Verwendung des Symbols</guilabel> ausgewählte Verwendungsbereich betroffen ist (siehe oben): stellt man einen Effekt für ein aktives Symbol ein, während als Verwendung <guilabel>Werkzeugleiste</guilabel> ausgewählt ist, werden aktive Symbole in anderen Bereichen davon <emphasis>nicht</emphasis> beeinflusst.

source: Below the list of icon states there are two options: you can configure an effect and you can select the <guilabel>Semi-transparent</guilabel> option, which will make the background <quote>shine through</quote> the icon. To the right of the effects list box there is a slider button to pass additional parameters to a filter for colours and <guilabel>Amount</guilabel>.
de: Im Effektdialog befinden sich zwei Möglichkeiten. Man kann einerseits einen Effekt für ein Symbol festlegen und außerdem das Symbol <guilabel>Halbtransparent</guilabel> erscheinen lassen. Die zweite Option lässt den Hintergrund durch das Symbol <quote>durchscheinen</quote>. Einige der Effekte benötigen zusätzliche Parameter, die rechts im Dialog zu finden sind.

source: The following effects can be applied to icons:
de: Folgende Effekte können auf Symbole angewendet werden:

source: <guilabel>No Effect</guilabel>:
de: <guilabel>Kein Effekt</guilabel>:

source: Icons will be used without applying any effect.
de: Symbole werden ohne jeglichen Effekt gezeichnet.

source: <guilabel>To Gray</guilabel>:
de: <guilabel>Nach Grau</guilabel>:

source: This filter will apply a grayish look to the icon. Use the <guilabel>Amount</guilabel> slider to configure the intensity of this filter. Note that it is customary for most user interfaces to use this effect for disabled icons only.
de: Dieser Filter verändert die Symbolfarbe in Richtung Grau. Unter <guilabel>Effekt-Einstellungen</guilabel> kann man die Intensität dieses Filters mit dem Schieberegler einstellen. Anmerkung: Üblicherweise wird dieser Effekt nur für deaktivierte Symbole verwendet.

source: <guilabel>Colorize</guilabel>:
de: <guilabel>Einfärben</guilabel>:

source: Icons will be colorized using a custom color. For example, you may configure active icons (&ie; the icon the mouse cursor is over) to shine golden. Use the color buttons and the <guilabel>Amount</guilabel> slider to configure the used color and the intensity of the colorization.
de: Durch diesen Filter werden Symbole in einer bestimmten Farbe eingefärbt. Zum Beispiel kann man aktive Symbole (also Symbole unter dem Mauszeiger) golden schimmern lassen. Unter <guilabel>Effekt-Einstellungen</guilabel> kann die Farbe und die Intensität der Färbung eingestellt werden.

source: A different gamma value will be applied to all icons. If you're no photographer and don't know what Gamma is: it's quite similar to what people call contrast. Just play around with the gamma settings by moving the <guilabel>Amount</guilabel> slider to get a feeling for this effect.
de: Ein veränderter Gamma-Wert wird auf die Symbole angewendet. Wenn man weder Fotograph ist noch sonst etwas über Gamma weiß, kann man es sich in etwa wie einen Kontrastfilter vorstellen. Die Intensität wird unter <guilabel>Effekt-Einstellungen</guilabel> mit dem Schieberegler gesetzt.

source: <guilabel>Desaturate</guilabel>:
de: <guilabel>Sättigung vermindern</guilabel>:

source: Icons will be drawn desaturated. This is quite similar to the <quote>Color</quote> setting on your television. Use the slider to configure the amount of desaturation.
de: Symbole werden mit weniger gesättigten Farben gezeichnet. Dieser Effekt ist mit der Einstellung <quote>Farbe</quote> an einem Fernseher vergleichbar. Die Intensität wird unter <guilabel>Effekt-Einstellungen</guilabel> mit dem Schieberegler gesetzt.

source: To Monochrome:
de: Zu Monochrom:

source: Icons will be drawn using only the two colours selected.
de: Symbole werden nur in den zwei ausgewählten Farben dargestellt.
