Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kde-runtime/kcontrol_language.po
Languages: de

source: Country/Region &amp; Language
de: Land/Region &amp; Sprache

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Matthias</firstname><surname>Kiefer</surname><contrib>Deutsche Übersetzung</contrib></othercredit>

source: Systemsettings
de: Systemeinstellungen

source: This module of the &kde; &systemsettings; allows you to select customization options that depend on the region of the world that you happen to live in. There are seven different tabs in this module, each of which is described in detail in the following sections.
de: Dieses Modul der &kde;-&systemsettings; erlaubt es Ihnen, Einstellungen vorzunehmen, die auf Gegebenheiten der Region beruhen, in der Sie leben. Das Modul besteht aus sieben Karteikarten, die in den folgenden Kapiteln detailliert beschrieben werden.

source: In most cases, you can simply select the country and the language, and the other options will be set in an appropriate manner.
de: Normalerweise reicht es aus, wenn Sie das Land, in dem Sie leben, und die Sprache auswählen. Die anderen Einstellungen werden entsprechend gesetzt.

source: Below the tabs of this module you can see a preview of what the settings look like. In addition to positive and negative numbers, you can see how positive and negative currency values, long and short dates, and times are displayed. When you change any of the settings, the preview shows the effects of the changes before you apply them.
de: Unter den Karteikarten dieses Moduls können Sie in einer Vorschau sehen, wie sich die von Ihnen gewählten Einstellungen auswirken werden. Abgesehen von positiven und negativen Zahlen können Sie sehen, wie positive und negative Geldbeträge, sowie ausführliche und kurze Datums- und Zeitangaben dargestellt werden. Änderungen an den Einstellungen können Sie in der Vorschau überprüfen, bevor Sie sie tatsächlich anwenden.

source: Each setting option in the various tabs has an individual <inlinemediaobject> <imageobject><imagedata fileref="oxygen-22x22-document-revert.png" format="PNG"/> </imageobject></inlinemediaobject> default button which is activated whenever that setting is different to your country default value. Clicking on the button will restore only that setting to your Country default.
de: Für jede Option auf den verschiedenen Karteikarten gibt es einen eigenen Knopf<inlinemediaobject> <imageobject><imagedata fileref="oxygen-22x22-document-revert.png" format="PNG"/> </imageobject></inlinemediaobject>zum Zurücksetzen der jeweiligen Einstellung auf den Standard des ausgewählten Landes. Die Knöpfe werden aktiviert, wenn die entsprechende Option vom Standard des ausgewählten Landes abweicht. Dann kann mit diesen Knöpfen die Standardeinstellung des ausgewählten Landes übernommen werden.

source: Country
de: Land

source: In this tab you can select the country or region that you want to use.
de: Auf dieser Karteikarte können Sie das Land oder die Region auswählen, die verwendet werden soll.

source: The <guilabel>Country</guilabel> drop down box contains the list of available countries and will initially show your currently selected country. If the selection shows <quote>System Country</quote> then you have not set a country and are defaulting to the Country set by the system, which will also be shown. Changing the country will automatically change the settings to the defaults for that country, except were you have set your own settings which will be left unchanged. You can easily see where your personal settings differ from the country settings by looking at the Default button next to the individual setting. If the button is enabled then your personal setting is different and you can click on the button to restore the country setting for that option only.
de: Das Auswahlfeld <guilabel>Land</guilabel> enthält eine Liste der verfügbaren Länder und zeigt das momentan ausgewählte Land an. Falls <quote>Systemeinstellung</quote> angezeigt wird, haben Sie kein Land eingestellt, weshalb das vom System eingestellte Land verwendet und angezeigt wird. Ändern Sie diese Einstellung, so werden automatisch die Einstellungen auf die Standardwerte für das ausgewählte Land gesetzt. Einstellungen, die Sie selbst geändert haben, werden nicht automatisch verändert. Sie können Einstellungen finden, die vom Standard des Landes abweichen, indem Sie die Knöpfe zum Zurücksetzen der Einstellungen überprüfen. Ist ein Knopf aktiviert, haben Sie die entsprechende Option abweichend vom Standard eingestellt und können sie per Knopfdruck auf den Standardwert zurücksetzen.

source: Languages
de: Sprachen

source: In this tab you can set your preferred languages for the &kde; Workspace and Applications to be displayed in.
de: Auf dieser Karteikarte können Sie die Sprachen auswählen, die in der &kde;-Arbeitsumgebung sowie Anwendungen bevorzugt verwendet werden sollen.

source: The &kde; Workspace and Applications are written in American English and are translated into many different languages by teams of volunteers. These translations need to be installed first before you can choose to use them. The list of <guilabel>Available Languages</guilabel> shows what KDE translations are installed and available on your system. If the language you want to use is not shown in this list then you will need to install it using the usual method for your system. Your system may have enabled the <guilabel>Install more languages</guilabel> button to make this easy for you.
de: Die &kde;-Arbeitsumgebung und -Anwendungen werden in Amerikanischem Englisch entwickelt und von Freiwilligen in verschiedenste Sprachen übersetzt. Diese Übersetzungen müssen zuerst installiert werden, bevor Sie sie auswählen können. Die Liste der <guilabel>Verfügbaren Sprachen</guilabel> zeigt an, welche &kde;-Übersetzungen auf Ihrem System installiert und verfügbar sind. Falls die gewünschte Sprache nicht auf der Liste steht, müssen Sie sie installieren. Verwenden Sie dazu die auf Ihrem System übliche Methode. Sie können dazu auch den Knopf <guilabel>Weitere Sprachen installieren</guilabel> benutzen, sofern dieser auf Ihrem System aktiviert ist.

source: The <guilabel>Preferred Languages</guilabel> list shows the languages that will be used when displaying the &kde; Workspace and Applications. Because not all of the KDE Workspace and Applications may be translated into every language &kde; will try to find suitable translations for you by working down the <guilabel>Preferred Languages</guilabel> list until it finds a translation. If none of your preferred languages have a required translation then the original American English will be used.
de: Die Liste der <guilabel>Bevorzugten Sprachen</guilabel> zeigt die Sprachen an, die in der &kde;-Arbeitsumgebung sowie den Anwendungen verwendet werden. Die &kde;-Arbeitsumgebung sowie die Anwendungen sind nicht unbedingt vollständig in jede Sprache übersetzt. Sollte eine Übersetzung in Ihre Sprache fehlen, sucht &kde; anhand der Liste <guilabel>Bevorzugter Sprachen</guilabel> nach einer passenden Übersetzung. Falls für keine der dort aufgeführten Sprachen eine Übersetzung vorhanden ist, wird der ursprüngliche Text in amerikanischem Englisch verwendet.

source: You can add a language to the <guilabel>Preferred Languages</guilabel> list by selecting it in the <guilabel>Available Languages</guilabel> and then clicking on the Add arrow button. You can remove a language from the <guilabel>Preferred Languages</guilabel> list by selecting it and then clicking on the Remove arrow button. You can change the order of preference in the <guilabel>Preferred Languages</guilabel> list by selecting a language and clicking on the Up or Down arrow button.
de: Sie können eine Sprache zu den <guilabel>Bevorzugten Sprachen</guilabel> hinzufügen, indem Sie sie in der Liste <guilabel>Verfügbarer Sprachen</guilabel> auswählen und den Pfeil zum Hinzufügen drücken. Zum Entfernen einer Sprache aus der Liste <guilabel>Bevorzugter Sprachen</guilabel> wählen Sie sie aus und klicken Sie auf den Pfeil zum Entfernen. Sie können die Reihenfolge der <guilabel>Bevorzugten Sprachen</guilabel> ändern, indem Sie eine Sprache in der Liste auswählen und die Pfeile nach oben bzw. nach unten anklicken.

source: Only languages listed in <guilabel>Preferred Languages</guilabel> and <guilabel>Available Languages</guilabel> will be offered as options for <guilabel>Primary language</guilabel> and <guilabel>Fallback language</guilabel> in the <guilabel>Switch Application Language</guilabel> dialog of the <guimenu>Help</guimenu> menu.
de: Nur Sprachen, die in der Liste <guilabel>Bevorzugte Sprachen</guilabel> oder <guilabel>Verfügbare Sprachen</guilabel> enthalten sind, können im Dialog <guilabel>Sprache der Anwendung umschalten</guilabel> des Menüs <guimenu>Hilfe</guimenu> als <guilabel>Hauptsprache</guilabel> oder als <guilabel>Ausweichsprache</guilabel> ausgewählt werden.

source: Language and Country/Region are independent settings. Changing a language does <emphasis>not</emphasis> automatically change the settings for numbers, currency &etc; to the corresponding country or region. It will only change the language used in displaying dates, such as month names.
de: Die Einstellungen für Sprache und Land/Region sind unabhängig. Mit der Auswahl einer neuen Sprache werden die Einstellungen für Zahlenformate, Währung &etc; <emphasis>nicht</emphasis> automatisch an das Land oder die Region, in der die Sprache verwendet wird, angepasst. Es wird nur die Sprache geändert, die in Datumsanzeigen verwendet wird, wie z. B. Monatsnamen.

source: Numbers
de: Zahlen

source: On this tab, you can select options for how numbers are displayed. The defaults are selected automatically based on the country which is currently selected.
de: Auf dieser Karteikarte können Sie festlegen, wie Zahlen dargestellt werden. Die Standardeinstellungen werden automatisch abhängig vom ausgewählten Land festgelegt.

source: In the first drop down box you can define the <guilabel>Digit grouping</guilabel> used to display numbers.
de: Im ersten Auswahlfeld können Sie die <guilabel>Zifferngruppierung</guilabel> festlegen, die zur Darstellung von Zahlen verwendet wird.

source: In the <guilabel>Group separator</guilabel> text box you can type the character that you want to use to separate groups of digits in numbers, usually a <userinput>.</userinput> or a <userinput>,</userinput>. You should ensure that this value is different to the <guilabel>Decimal separator</guilabel> setting. The drop-down box provides a list of common values to choose from.
de: Im Textfeld <guilabel>Tausender-Unterteilung</guilabel> können Sie das Zeichen eingeben, das verwendet werden soll, um bei großen Zahlen mehrere Stellen zu gruppieren. Meist wird dazu ein <userinput>.</userinput> oder <userinput>,</userinput> verwendet. Sie sollten darauf achten, dass dieses Zeichen nicht dem <guilabel>Dezimalzeichen</guilabel> entspricht. Im Auswahlfeld finden Sie einige übliche Zeichen für diese Einstellung.

source: In the <guilabel>Decimal separator</guilabel> text box you can type the character that you want to use to separate the decimal portion of numbers, usually a <userinput>.</userinput> or a <userinput>,</userinput>. You should ensure that this value is different to the <guilabel>Group separator</guilabel> setting. The drop-down box provides a list of common values to choose from.
de: Im Textfeld <guilabel>Dezimalzeichen</guilabel> können Sie das Zeichen festlegen, mit dem der Nachkomma-Teil einer Dezimalzahl von der Zahl getrennt wird. Meist werden hier <userinput>.</userinput> und <userinput>,</userinput> verwendet. Sie sollten sicherstellen, dass dieses Zeichen nicht der <guilabel>Tausender-Unterteilung</guilabel> entspricht. Im Auswahlfeld finden Sie einige übliche Zeichen für diese Einstellung.

source: In the <guilabel>Decimal places</guilabel> spin box you can set the number of decimal places displayed for numeric values, &ie; the number of digits <emphasis>after</emphasis> the decimal separator.
de: Im Drehfeld <guilabel>Dezimalstellen</guilabel> wird die Anzahl der Dezimalstellen festgelegt, &ie; wie viele Ziffern <emphasis>nach</emphasis> dem Dezimaltrennzeichen stehen.

source: In the <guilabel>Positive sign</guilabel> text box you can type the character that you want to use to indicate positive numbers. You should ensure that this value is different to the <guilabel>Negative sign</guilabel> setting. The drop-down box provides a list of common values to choose from. This value may also be used for monetary values depending on the <guilabel>Positive format</guilabel> selected in the <guilabel>Money</guilabel> tab.
de: Im Textfeld <guilabel>Positives Vorzeichen</guilabel> können Sie das Zeichen festlegen, das zur Markierung von positiven Zahlen verwendet wird. Sie sollten sicherstellen, dass dieses Zeichen nicht dem <guilabel>Negativen Vorzeichen</guilabel> entspricht. Im Auswahlfeld finden Sie einige übliche Zeichen für diese Einstellung. Das hier festgelegte Zeichen kann entsprechend der Einstellung <guilabel>Positivformat</guilabel> auf der Karteikarte <guilabel>Währung</guilabel> auch für Geldbeträge verwendet werden.

source: In the <guilabel>Negative sign</guilabel> text box you can type the character that you want to use to indicate negative numbers. You should ensure that this value is different to the <guilabel>Positive sign</guilabel> setting. The drop-down box provides a list of common values to choose from. This value may also be used for monetary values depending on the <guilabel>Negative format</guilabel> selected in the <guilabel>Money</guilabel> tab.
de: Im Textfeld <guilabel>Negatives Vorzeichen</guilabel> können Sie das Zeichen festlegen, das zur Markierung von negativen Zahlen verwendet wird. Sie sollten sicherstellen, dass dieses Zeichen nicht dem <guilabel>Positiven Vorzeichen</guilabel> entspricht. Im Auswahlfeld finden Sie einige übliche Zeichen für diese Einstellung. Das hier festgelegte Zeichen kann entsprechend der Einstellung <guilabel>Negativformat</guilabel> auf der Karteikarte <guilabel>Währung</guilabel> auch für Geldbeträge verwendet werden.

source: The <guilabel>Digit set</guilabel> drop down box lists digit sets which may be used instead of Arabic digits when displaying numbers. If you select a digit set other than Arabic, it will be applied only to numbers which appear in a language context that uses that digit set while Arabic digits are still going to be used elsewhere, &eg; Arabic-Indic digits will be applied to Arabic but not to American English.
de: Im Auswahlfeld <guilabel>Ziffernzeichen</guilabel> können für die Anzeige von Zahlen statt der üblichen arabischen Zeichen andere Ziffernzeichen eingestellt werden. Hier ausgewählte andere Ziffernzeichen als Arabisch werden dann für die Anzeige von Zahlen in zugehörigen Sprachen verwendet, während ansonsten Arabische Zahlen angezeigt werden. Beispielsweise werden Arabisch-Indische Zeichen in Programmen verwendet, die in arabischen Sprachen ausgeführt werden, jedoch nicht im Englischen.

source: Note that digit grouping, group separator, decimal separator, decimal places, positive format, negative format and the digit set used to display monetary values has to be set separately on the <guilabel>Money</guilabel> tab.
de: Beachten Sie, dass die Ziffergruppierung, das Dezimalzeichen, das Zeichen für die Gruppierung von Tausendern, die Anzahl der Dezimalstellen, das Positiv- bzw. Negativformat sowie die Ziffernzeichen für Währungsangaben separat auf der Karteikarte <guilabel>Währung</guilabel> eingestellt werden.

source: Money
de: Währung

source: On this tab, you can select options for how monetary values are displayed. The defaults are selected automatically based on the country which is currently selected.
de: Auf dieser Karteikarte können Sie festlegen, wie Zahlen dargestellt werden. Die Standardeinstellungen werden automatisch abhängig vom ausgewählten Land festgelegt.

source: In the <guilabel>Currency</guilabel> drop-down box you can choose the currency you want to use when displaying monetary values. This will default to the main currency in use in your selected country. You can choose a different currency from the drop-down box, which displays the names of all available currencies their ISO 4217 standard Currency Code. The currencies used in your selected country are listed at the top, followed by all the other currencies. Changing the currency will also update the <guilabel>Currency symbol</guilabel> to use the default symbol for that currency, but no other format settings will be changed.
de: Im Auswahlfeld <guilabel>Währung</guilabel> können Sie die Währung festlegen, die zur Anzeige von Geldbeträgen verwendet wird. Standardmäßig wird die im ausgewählten Land übliche Währung verwendet. Sie können eine andere Währung aus dem Auswahlfeld auswählen, das die Namen aller verfügbaren Währungen und Ihre Abkürzungen nach dem Standard ISO 4217 anzeigt. Die Währungen, die im ausgewählten Land verwendet werden, sind in der Liste oben aufgeführt, gefolgt von den übrigen Währungen. Wenn Sie die Währung ändern, wird automatisch das <guilabel>Währungssymbol</guilabel> angepasst. Andere Formatierungseinstellungen werden nicht geändert.

source: In the <guilabel>Currency symbol</guilabel> drop-down box you can choose the currency symbol you want to use when displaying monetary values. This will default to the usual symbol of the currency you have selected in the <guilabel>Currency</guilabel> drop-down box. This will only allow you to select a valid currency symbol for the currency code to prevent inconsistent choices, such as choosing US Dollars but showing the Pound Sterling symbol £ instead. This setting will automatically be changed when you change the <guilabel>Currency</guilabel> setting.
de: Im Auswahlfeld <guilabel>Währungssymbol</guilabel> können Sie das Währungssymbol festlegen, das zur Anzeige von Geldbeträgen verwendet wird. Standardmäßig wird das für die im Auswahlfeld <guilabel>Währung</guilabel> festgelegte Währung übliche Symbol verwendet. Sie können nur Währungssymbole auswählen, die für die ausgewählte Währung gültig sind, um Widersprüche, wie z. B. die Auswahl von US-Dollar und dem Symbol für Britische Pfund (£), zu verhindern. Diese Einstellung wird automatisch angepasst, wenn Sie eine andere <guilabel>Währung</guilabel> auswählen.

source: In the next drop down box you can define the <guilabel>Digit grouping</guilabel> used to display monetary values.
de: Im nächsten Auswahlfeld können Sie die <guilabel>Zifferngruppierung</guilabel> festlegen, die zur Darstellung von Geldbeträgen verwendet wird.

source: In the <guilabel>Group separator</guilabel> text box you can type the character that you want to use to separate groups of digits in monetary values, usually a <userinput>.</userinput> or a <userinput>,</userinput>. You should ensure that this value is different to the <guilabel>Decimal separator</guilabel> setting. The drop-down box provides a list of common values to choose from.
de: Im Textfeld <guilabel>Tausender-Unterteilung</guilabel> können Sie das Zeichen festlegen, das zur Gruppierung von Ziffern in Währungsangaben verwendet wird, üblicherweise <userinput>.</userinput> oder <userinput>,</userinput>. Sie sollten sicherstellen, dass dieses Zeichen nicht dem <guilabel>Dezimalzeichen</guilabel> entspricht. Im Auswahlfeld finden Sie einige übliche Zeichen für diese Einstellung.

source: In the <guilabel>Decimal separator</guilabel> text box you can type the character that you want to use to separate the decimal portion of monetary values, usually a <userinput>.</userinput> or a <userinput>,</userinput>. You should ensure that this value is different to the <guilabel>Group separator</guilabel> setting. The drop-down box provides a list of common values to choose from.
de: Im Textfeld <guilabel>Dezimalzeichen</guilabel> können Sie das Zeichen festlegen, mit dem der Nachkomma-Teil von Währungsangaben von der Zahl getrennt wird. Meist werden hier <userinput>.</userinput> und <userinput>,</userinput> verwendet. Sie sollten sicherstellen, dass dieses Zeichen nicht der <guilabel>Tausender-Unterteilung</guilabel> entspricht. Im Auswahlfeld finden Sie einige übliche Zeichen für diese Einstellung.

source: In the <guilabel>Decimal places</guilabel> spin box you can set the number of decimal places displayed for monetary values, &ie; the number of digits <emphasis>after</emphasis> the decimal separator.
de: Im Drehfeld <guilabel>Dezimalstellen</guilabel> wird die Anzahl der Dezimalstellen für Währungsangaben festgelegt, &ie; wie viele Ziffern <emphasis>nach</emphasis> dem Dezimaltrennzeichen stehen.

source: In the <guilabel>Positive format</guilabel> drop-down box you can select how you want positive monetary values to be displayed. The drop-down box displays a list of four sample formats that you can choose from, combining the options for where the <guilabel>Currency symbol</guilabel> and the numeric value <guilabel>Positive sign</guilabel> are displayed. You can also choose to replace the numeric value <guilabel>Positive sign</guilabel> with brackets.
de: Im Auswahlfeld <guilabel>Positivformat</guilabel> können Sie festlegen, wie positive Geldbeträge angezeigt werden. Im Auswahlfeld finden Sie eine Liste mit vier Beispielformaten, die die Positionen des <guilabel>Währungssymbols</guilabel> und des <guilabel>Positiven Vorzeichens</guilabel> angeben. Positive Geldbeträge können auch eingeklammert werden, anstatt das <guilabel>Positive Vorzeichen</guilabel> anzuzeigen.

source: In the <guilabel>Negative format</guilabel> drop-down box you can select how you want negative monetary values to be displayed. The drop-down box displays a list of ten sample formats that you can choose from, combining the options for where the <guilabel>Currency symbol</guilabel> and the numeric value <guilabel>Negative sign</guilabel> are displayed. You can also choose to replace the numeric value <guilabel>Negative sign</guilabel> with brackets.
de: Im Auswahlfeld <guilabel>Negativformat</guilabel> können Sie festlegen, wie negative Geldbeträge angezeigt werden. Im Auswahlfeld finden Sie eine Liste mit zehn Beispielformaten, die die Positionen des <guilabel>Währungssymbols</guilabel> und des <guilabel>Negativen Vorzeichens</guilabel> angeben. Negative Geldbeträge können auch eingeklammert werden, anstatt das <guilabel>Negative Vorzeichen</guilabel> anzuzeigen.

source: The <guilabel>Digit set</guilabel> drop down box lists digit sets which may be used instead of Arabic digits when displaying money. If you select a digit set other than Arabic, it will be applied only to numbers which appear in a language context that uses that digit set while Arabic digits are still going to be used elsewhere, &eg; Arabic-Indic digits will be applied to Arabic but not to American English.
de: Im Auswahlfeld <guilabel>Ziffernzeichen</guilabel> können für die Anzeige von Währungsangaben statt der üblichen arabischen Zeichen andere Ziffernzeichen eingestellt werden. Hier ausgewählte andere Ziffernzeichen als Arabisch werden nur für die Anzeige von Zahlen in zugehörigen Sprachen verwendet, ansonsten werden die üblichen arabischen Ziffernzeichen benutzt. Beispielsweise werden Arabisch-Indische Zeichen angezeigt, wenn Programme in Arabisch ausgeführt werden, jedoch nicht im Englischen.
