Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kde-runtime/kcontrol_performance.po
Languages: de

source: Performance
de: Leistung

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Stephan</firstname><surname>Johach</surname><affiliation><address><email>hunsum@gmx.de</email></address></affiliation><contrib>Deutsche Übersetzung</contrib></othercredit>

source: Systemsettings
de: Systemeinstellungen

source: performance
de: Leistung

source: preload
de: Im Hintergrund laden

source: Performance Settings
de: Einstellungen zur Leistung

source: &kde;, is used on a wide variety of computers by a wide variety of users. Under the category of performance, this dialog allows each user to adjust options which may make the computer that &konqueror; is installed on feel more responsive.
de: &kde; wird auf einer Vielzahl unterschiedlicher Rechner von unterschiedlichen Anwendern benutzt. Unter dem Begriff Leistung können in diesem Dialog Einstellungen vorgenommen werden, die auf dem Rechner, auf dem &konqueror; installiert wurde, zu einem besseren Antwortverhalten führen.

source: &konqueror; instances
de: &konqueror;-Ausgaben

source: The first section of this dialog is labeled <guilabel>Minimize Memory Usage</guilabel> and has three options which determine maximum number of instances of &konqueror; that can be open on one machine at any one time.
de: Der erste Bereich im Dialog trägt die Bezeichnung <guilabel>Speicherbedarf minimieren</guilabel> und stellt drei Auswahlknöpfe zur Verfügung mit denen die Anzahl der Ausgaben von &konqueror;, die gleichzeitig geöffnet werden können, festgelegt wird.

source: Do not confuse &konqueror; instances, with &konqueror; windows or tabs. The number of &konqueror; instances is determined by &kde; not by the user. You can think of instances as the hidden data of your &konqueror; windows and tabs. One &konqueror; instance can contain the data for multiple windows or tabs. Your choice on the following radio buttons does not limit the number of windows you can open at one time, but rather, how many instances of &konqueror; you can have open.
de: Verwechseln Sie die Ausgaben von &konqueror; nicht mit den Fenstern oder Unterfenstern. Die Anzahl der Ausgaben von &konqueror; wird von &kde; festgelegt nicht vom Anwender. Sie können sich eine Ausgabe als versteckte Daten zu den Fenstern und Unterfenstern vorstellen. Eine Ausgabe von &konqueror; kann die Daten mehrere Fenster oder Unterfenster enthalten. Die Auswahl hier schränkt nicht die Anzahl der gleichzeitig offenen Fenster ein, sondern die Anzahl der Ausgaben, die zur selben Zeit geladen werden können.

source: The reason the choices you make in this dialog box are important is evident when something goes wrong and &konqueror; is forced to close an instance. <emphasis>All &konqueror; windows associated with a &konqueror; instance must be closed immediatly (without time to save data or bookmark locations).</emphasis> Therefore, the more instances you can have open at one time, the less likely a problem in one instance will affect all of your work. Each instance requires more memory which can be a problem on systems with less system memory.
de: Der Grund, warum die hier getroffen Auswahl von Bedeutung ist, wird deutlich, wenn etwas schiefgeht und eine Ausgabe von &konqueror; geschlossen werden muss. In diesem Fall werden <emphasis>alle &konqueror;-Fenster, die von dieser Ausgabe verwaltet werden, sofort (und ohne Rückfrage) geschlossen</emphasis>. Darum hat die Anzahl der geladenen Ausgaben Einfluss darauf, wieviele der gerade offenen Fenster von einem Problem betroffen sind. Jede Ausgabe belegt Arbeitsspeicher, was auf einigen Systemen, die über wenig Arbeitsspeicher verfügen, ein Problem darstellen kann.

source: Your options are:
de: Sie haben die folgende Auswahl:

source: Never
de: Niemals

source: There are no restraints. Any number of &konqueror; instances can be open at any one time. The advantage of this option is if any &konqueror; instance crashes the remaining will be unaffected. The disadvantage is that each &konqueror; instance uses more memory.
de: Es gibt keine Beschränkungen. Es kann eine beliebige Anzahl von Ausgaben in den Arbeitsspeicher geladen werden. Der Vorteil dieser Einstellung besteht darin, dass beim Absturz einer Ausgabe von &konqueror; die anderen Ausgaben davon nicht betroffen sind. Der Nachteil besteht daran, dass jede Ausgabe von &konqueror; auch weiteren Arbeitsspeicher belegt.

source: For file browsing only (recommended)
de: Nur bei der Arbeit mit Dateien (empfohlen)

source: If this option is selected, you can have as many as you want &konqueror; instances open that are browsing the web, but only one instance of &konqueror; for file management.
de: Ist diese Einstellung markiert, kann eine beliebige Anzahl Ausgaben von &konqueror; für das Web-Browsing geladen werden, aber nur eine Ausgabe für die Arbeit mit Dateien.

source: Always (use with care)
de: Immer (bitte mit Vorsicht benutzen)

source: If this option is selected, you can only have one instance of &konqueror; running at any one time. This saves system memory, but if your &konqueror; window crashes, all your browsing windows close immediatly without warning. This should only be used for seriously memory limited systems.
de: Ist diese Einstellung markiert, kann zur selben Zeit immer nur eine Ausgaben von &konqueror; geladen werden. Hierdurch wird weniger Arbeitsspeicher belegt, aber wenn eine &konqueror;-Fenster abstürzt, werden alle anderen Fenster ohne Warnung geschlossen. Diese Einstellung sollte nur auf System benutzt werden, die über einen eingeschränkten Arbeitsspeicher verfügen.

source: Preloading
de: Im Hintergrund laden

source: The subsection labeled <guilabel>Preloading</guilabel> also makes a tradeoff between memory and performance.
de: Der mit <guilabel>Im Hintergrund laden</guilabel> bezeichnet Abschnitt ermöglicht einen Kompromiss zwischen Speicherverbrauch und Geschwindigkeit.

source: <emphasis>Preloading</emphasis> refers to loading an instance of &konqueror; into memory before a user asks to start &konqueror;. The positive effect of this is that when a user asks &kde; to load &konqueror; the window appears instantly because most of the application has been preloaded. The negative effect is that this instance of &konqueror; uses memory that could be used by other programs. By default, when a user closes &konqueror;, &kde; does not close the instance. This means that the next time a user wants &konqueror; loaded, it is nearly instantaneous again.
de: <emphasis>Im Hintergrund laden</emphasis> bezieht sich auf das Laden einer Ausgabe von &konqueror; in den Arbeitsspeicher bevor der Anwender &konqueror; tatsächlich aufruft. Die positive Auswirkung dabei ist, dass im Falle des Aufrufs durch den Anwender, das Fenster von &kde; nahezu sofort erscheint, da die Programm sich bereits weitgehend im Arbeitsspeicher befindet. Die negative Auswirkung besteht darin, dass diese Ausgabe von &konqueror; Speicher belegt, der ansonsten von anderen Programm zur Verfügung stehen würde. In der Voreinstellung wird &konqueror; von &kde; nicht aus dem Arbeitsspeicher entfernt, wenn der Benutzer die Anwendung schließt. Das bedeutet, beim nächsten Aufruf von &konqueror; erscheint die Anwendung nahezu ohne Verzögerung wieder auf dem Bildschirm.

source: The spinbox labeled <guilabel>Maximum number of instances kept preloaded:</guilabel> can be used to adjust the maximum number of preloaded instances. This option does not affect instances when they are loaded. It also does not limit the number of instances that can be used by active windows. It only affects the number of preloaded instances.
de: Mit dem Drehfeld <guilabel>Maximale Anzahl Ausgaben, die im Hintergrund geladen werden sollen</guilabel> kann die maximale Anzahl der im Voraus geladenen Ausgaben festgelegt werden. Diese Einstellung beeinflusst nicht den Zeitpunkt des Ladens und auch nicht die Anzahl Ausgaben, die von aktiven Fenstern benutzt werden können. Es beeinflusst nur die Anzahl der im Voraus geladenen Ausgaben.

source: The check box labeled <guilabel>Preload an instance after &kde; startup</guilabel> does just what it says. It tells &kde; to preload one instance of &konqueror; at the startup of &kde;.
de: Ist die Einstellung <guilabel>Beim &kde;-Start eine Ausgabe im Hintergrund laden</guilabel> aktiviert, wird beim Starten von &kde; eine Ausgabe von &konqueror; in den Speicher geladen.

source: This does extend the startup time for &kde;.
de: Hierdurch verzögert sich die Startzeit von &kde;.

source: The final check box labeled <guilabel>Always try to have at least one preloaded instance</guilabel> signals to &kde; that you always want &kde; to have one preloaded, but not used, instance of &konqueror; available. This option will actually decrease performance on some machines (especially those with limited physical memory).
de: Das letzte Ankreuzfeld, das mit <guilabel>Stets versuchen mindestens eine Ausgabe im Hintergrund geladen zu halten</guilabel> beschriftet ist, zeigt &kde;, dass Sie immer eine ungenutzte Ausgabe von &kde; im Hintergrund haben möchten. Diese Einstellung bewirkt auf manchen Systemen (insbesondere solchen mit eingeschränktem Arbeitsspeicher) eher eine Leistungsminderung.
