Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kde-runtime/kcontrol_language.po
Languages: de

source: Note that digit grouping, group separator, decimal separator, decimal places, positive sign, negative sign and the digit set used to display numeric values has to be set separately on the <guilabel>Numbers</guilabel> tab.
de: Beachten Sie, dass die Ziffergruppierung, das Dezimalzeichen, das Zeichen für die Gruppierung von Tausendern, die Anzahl der Dezimalstellen, das positive bzw. negative Vorzeichen sowie die Ziffernzeichen für Zahlen separat auf der Karteikarte <guilabel>Zahlen</guilabel> eingestellt werden.

source: Calendar
de: Kalendersystem

source: On this tab, you can select options for how calendar information is displayed. The defaults are selected automatically based on the country which is currently selected.
de: Auf dieser Karteikarte können Sie festlegen wie Kalenderinformationen dargestellt werden. Die Standardeinstellungen werden automatisch abhängig vom ausgewählten Land festgelegt.

source: In the <guilabel>Calendar system</guilabel> drop-down box you can choose the calendar system to be used when displaying or inputting dates. This will default to the main calendar system in use in your selected country, usually the Gregorian calendar. Changing the calendar system will also update the various weekday name drop-down combos with the names of days of the week in the new calendar system, will enable or disable the <guilabel>Use Common Era</guilabel> tick box and may change the value of the <guilabel>Short year window</guilabel> setting.
de: Im Auswahlfeld <guilabel>Kalendersystem</guilabel> können Sie das Kalendersystem festlegen, das bei der Anzeige oder Eingabe von Daten verwendet wird. Standardmäßig wird das in Ihrem ausgewählten Land übliche Kalendersystem, meist der Gregorianische Kalender, verwendet. Das Ändern des Kalendersystems ändert auch die Bezeichnungen der Wochentage, aktiviert bzw. deaktiviert das Ankreuzfeld <guilabel>Allgemeine Zeitrechnung verwenden</guilabel> und evtl. die Einstellung <guilabel>Bereich für das Jahr in Kurzform</guilabel>.

source: Note that the Gregorian calendar used is a hybrid of the Julian calendar up to Thursday 4 October 1582 and the Gregorian calendar from Friday 15 October 1582, leaving a <quote>gap</quote> of ten <quote>missing</quote> days. We are aware this conversion date is not factually correct for all countries, however this is how Qt have chosen to implement the Gregorian calendar and we wish to remain consistent with them.
de: Beachten Sie, dass der verwendete Gregorianische Kalender eine Mischung aus dem Julianischen Kalender bis Donnerstag, den 4. Oktober 1582 und dem Gregorianischen Kalender ab Freitag, dem 15. Oktober 1582 ist, weshalb zehn Tage <quote>fehlen</quote>. Es ist uns bekannt, dass dieses System nicht für alle Länder korrekt ist, die Qt-Entwickler haben sich jedoch für diese Implementierung des Gregorianischen Kalenders entschieden und wir möchten die Konsistenz damit beibehalten.

source: If you have selected the Gregorian calendar system then the <guilabel>Use Common Era</guilabel> tick box will be enabled. This allows you to choose to use the Common Era (CE/BCE) instead of the Christian Era (AD/BC) when displaying and inputting dates. See the <guilabel>Date &amp; Time</guilabel> tab for how to set this up.
de: Falls Sie das Gregorianische Kalendersystem ausgewählt haben, ist das Ankreuzfeld <guilabel>Allgemeine Zeitrechnung verwenden</guilabel> aktiviert. Sie können damit festlegen, ob die Allgemeine Zeitrechnung (CE/BCE) anstelle der Christlichen Zeitrechnung (AD/BC) zur Anzeige und Eingabe von Daten verwendet werden soll. Weitere Informationen dazu finden Sie im Unterfenster <guilabel>Datum &amp; Zeit</guilabel>.

source: The <guilabel>Short year window</guilabel> option is only used when you choose to use a short two digit year format (YY) in the <guilabel>Long date format</guilabel> or <guilabel>Short date format</guilabel> settings in the <guilabel>Date &amp; Time</guilabel> tab. When inputting a short year value, &eg; 10, the system must guess what century that year falls in. By setting the <guilabel>Short year window</guilabel> you tell the system how you want the short year to be interpreted, &eg; whether 50 is interpreted as 1950 or 2050. This window can be set differently for each calendar system as they all use different epochs (start dates). For example, the Hebrew calendar is into its 58th century (2010 Gregorian is roughly 5771 Hebrew), so may use a window of 5750 to 5850.
de: Die Option <guilabel>Bereich für das Jahr in Kurzform</guilabel> wird nur verwendet, wenn Sie auf der Karteikarte <guilabel>Datum &amp; Zeit</guilabel> im <guilabel>Langformat für Datum</guilabel> oder <guilabel>Kurzformat für Datum</guilabel> ein kurzes Format mit zwei Ziffern (JJ) für Jahreszahlen angegeben haben. Bei der Eingabe von Jahreszahlen mit zwei Ziffern (z. B. 10) muss die Anwendung wissen, in welchem Jahrhundert das eingegebene Jahr liegt. Mit der Einstellung des <guilabel>Bereiches für das Jahr in Kurzform</guilabel> legen Sie fest, wie Jahreszahlen im Kurzformat von Anwendungen interpretiert werden, &eg; ob 50 als 1950 oder als 2050 verarbeitet wird. Dieser Bereich kann für jedes Kalendersystem separat eingestellt werden, da die verschiedenen Kalender mit unterschiedlichen Jahren beginnen. Beispielsweise ist der Hebräische Kalender inzwischen im 58. Jahrhundert (Das Gregorianische Jahr 2010 ist im Hebräischen Kalender ungefähr das Jahr 5771), ein Bereich von 5750 bis 5850 ist für diesen also sinnvoll.

source: The <guilabel>Week number system</guilabel> option determines how the week number will be calculated. There are four options available:
de: Die Einstellung <guilabel>System zur Wochen-Nummerierung</guilabel> bestimmt, wie die Wochennummern berechnet werden. Es gibt vier Möglichkeiten:

source: ISO Week
de: ISO-Woche

source: Use the ISO standard Week Number. This will always use Monday as the first day of the ISO week. This is the most commonly used system.
de: ISO-Standard-Wochennummern verwenden. Montag ist immer der erste Tag der ISO-Woche. Dies ist das am häufigsten verwendete System.

source: Full First Week
de: Erste ganze Woche

source: The first week of the year starts on the first occurrence of the <emphasis>First day of the week</emphasis>, and lasts for seven days. Any days before Week 1 are considered part of the last week of the previous year. This system is most commonly used in the USA.
de: Die erste Woche des Jahres beginnt am ersten auftretenden <emphasis>ersten Tag der Woche</emphasis>, und dauert sieben Tage. Alle Tage vor der ersten Woche werden der letzten Woche des vorherigen Jahres zugeordnet. Dieses System wird hauptsächlich in den USA verwendet.

source: Partial First Week
de: Erste Teilwoche

source: The first week starts on the first day of the year. The second week of the year starts on the first occurrence of the <emphasis>First day of the week</emphasis>, and lasts for seven days. The first week may not contain seven days.
de: Die erste Woche beginnt am ersten Tag des Jahres. Die zweite Woche des Jahres beginnt am ersten auftretenden <emphasis>ersten Tag der Woche</emphasis>, und dauert sieben Tage. Die erste Woche kann weniger als sieben Tage enthalten.

source: Simple Week
de: Einfache Woche

source: The first week starts on the first day of the year and lasts seven days, with all new weeks starting on the same weekday as the first day of the year.
de: Die erste Woche beginnt am ersten Tag des Jahres und dauert sieben Tage, wobei jede neue Woche am gleichen Wochentag beginnt, wie der Jahresbeginn.

source: In the <guilabel>First day of week</guilabel> drop-down box you can choose which weekday is considered the first day of the week. This value is often used when displaying calendar tables to determine which day is listed first.
de: Im Auswahlfeld <guilabel>Erster Tag der Woche</guilabel> können Sie festlegen, welcher Wochentag als erster Tag einer Woche angesehen wird. Dieser Tag wird bei der Anzeige von Kalendern zur Bestimmung des Wochenendes verwendet.

source: In the <guilabel>First working day of week</guilabel> drop-down box you can choose which weekday is considered the first working day of the week. This value is often used when displaying calendar tables to determine when the weekend is.
de: Im Auswahlfeld <guilabel>Erster Arbeitstag der Woche</guilabel> können Sie festlegen, welcher Wochentag als erster Arbeitstag einer Woche angesehen wird. Dieser Tag wird bei der Anzeige von Kalendern zur Bestimmung des Wochenendes verwendet.

source: In the <guilabel>Last working day of week</guilabel> drop-down box you can choose which weekday is considered the last working day of the week. This value is often used when displaying calendar tables to determine when the weekend is.
de: Im Auswahlfeld <guilabel>Letzter Arbeitstag der Woche</guilabel> können Sie festlegen, welcher Wochentag als letzter Arbeitstag einer Woche angesehen wird. Dieser Tag wird bei der Anzeige von Kalendern zur Bestimmung des Wochenendes verwendet.

source: In the <guilabel>Week day for special religious observance</guilabel> drop-down box you can choose which weekday is regularly used for special religious observances. This value is often used when displaying calendar tables to <quote>red letter</quote> a certain day. If you do not have any particular weekday for religious observance then you can choose the <parameter>None / None in particular</parameter> option.
de: Im Auswahlfeld <guilabel>Religiöser Feiertag in der Woche</guilabel> können Sie festlegen, welcher Wochentag als religiöser Feiertag angesehen wird. Dieser Tag wird in Kalendern oft <quote>farbig hervorgehoben</quote>. Falls Sie keinen bestimmten Wochentag als religiösen Feiertag haben, wählen Sie die Einstellung <parameter>Keiner/Kein bestimmter</parameter>.

source: Date &amp; Time
de: Datum &amp; Zeit

source: On this tab, you can select options for how date and time values are input or displayed. The defaults are selected automatically based on the country which is currently selected.
de: Auf dieser Karteikarte können Sie festlegen wie Datums- und Zeitangaben eingegeben und dargestellt werden. Die Standardeinstellungen werden automatisch abhängig vom ausgewählten Land festgelegt.

source: In the <guilabel>Time format</guilabel> text box you can enter the format that you want to use to input and display times. The format entered is a combination of special codes representing time components and literal text used to separate the time components. The special time component codes are listed below. You can set the format to any combination of time components you like, but you should always include at least an hour and minutes portion to allow you to input times that are not ambiguous. The drop-down box provides a list of common time formats in your currently selected language to choose from.
de: Im Textfeld <guilabel>Zeitformat</guilabel> können Sie das Format festlegen, in dem lange Zeitangaben angezeigt und eingegeben werden. Das Format besteht aus Platzhaltern für verschiedene Zeitkomponenten und normalem Text zu deren Trennung. Unten sind die verfügbaren Platzhalter aufgelistet. Sie können zwar beliebige Kombinationen der Platzhalter eingeben, sollten jedoch zumindest Platzhalter für Stunde und Minute verwenden, um Mehrdeutigkeiten zu verhindern. Im Auswahlfeld finden Sie eine Liste mit üblichen Zeitformaten in der ausgewählten Sprache.

source: <parameter>HH</parameter> - The hour as a decimal number using a 24-hour clock (00-23).
de: <parameter>SS</parameter> - Die Stunde als Zahlenwert im 24-Stunden-Format (00-23), wobei immer zwei Ziffern benutzt werden.

source: <parameter>hH</parameter> - The hour as a decimal number using a 24-hour clock (0-23).
de: <parameter>sS</parameter> - Die Stunde als Zahlenwert im 24-Stunden-Format (0-23).

source: <parameter>PH</parameter> - The hour as a decimal number using a 12-hour clock (01-12).
de: <parameter>PS</parameter> - Die Stunde als Zahlenwert im 12-Stunden-Format (01-12), wobei immer zwei Ziffern benutzt werden.

source: <parameter>pH</parameter> - The hour as a decimal number using a 12-hour clock (1-12).
de: <parameter>pS</parameter> - Die Stunde als Zahlenwert im 12-Stunden-Format (1-12).

source: <parameter>MM</parameter> - The minutes as a decimal number (00-59).
de: <parameter>MM</parameter> - Die Minuten mit zwei Ziffern (00-59).

source: <parameter>SS</parameter> - The seconds as a decimal number (00-59).
de: <parameter>SEKSEK</parameter> - Die Sekunden mit zwei Ziffern (00-59).

source: <parameter>AMPM</parameter> - Either 'AM' or 'PM' according to the given time value. Noon is treated as 'PM' and midnight as 'AM'. You should always include this code if you are using the 12-hour clock codes <parameter>PH</parameter> or <parameter>pH</parameter> to prevent ambiguity when entering times.
de: <parameter>AMPM</parameter> - Entweder „AM“ oder „PM“, abhängig von der gegebenen Zeit. Mittag wird als „PM“, Mitternacht als „AM“ behandelt. Sie sollten diesen Parameter immer angeben, wenn Sie Parameter im 12-Stunden-Format verwenden, nämlich <parameter>PS</parameter> oder <parameter>pS</parameter>. Dadurch werden Zweideutigkeiten bei Zeitangaben vermieden.

source: In the <guilabel>AM symbol</guilabel> text box you can enter the symbol that you want to use to input or display for AM when using a 12-hour clock. The drop-down box provides a list of common symbols for your currently selected language to choose from.
de: Im Textfeld <guilabel>AM-Zeichen</guilabel> können Sie das Zeichen festlegen, das verwendet wird, um Zeitangaben im 12-Stunden-Format als „vormittags“ zu kennzeichnen. Im Auswahlfeld finden Sie eine Liste von Zeichen, die in der ausgewählten Sprache dafür üblich sind.

source: In the <guilabel>PM symbol</guilabel> text box you can enter the symbol that you want to use to input or display for PM when using a 12-hour clock. The drop-down box provides a list of common symbols for your currently selected language to choose from.
de: Im Textfeld <guilabel>PM-Zeichen</guilabel> können Sie das Zeichen festlegen, das verwendet wird, um Zeitangaben im 12-Stunden-Format als „nachmittags“ zu kennzeichnen. Im Auswahlfeld finden Sie eine Liste von Zeichen, die in der ausgewählten Sprache dafür üblich sind.

source: In the <guilabel>Long date format</guilabel> text box you can enter the format that you want to use to input and display long dates. The format entered is a combination of special codes representing date components and literal text used to separate the date components. The special date component codes are listed below. You can set the format to any combination of date components you like, but you should always include at least enough components to uniquely identify a day in the year, &eg; a month and day, to allow you to input dates that are not ambiguous. If you don't include a year component then the current year will be used. The drop-down box provides a list of common date formats in your currently selected language to choose from.
de: Im Textfeld <guilabel>Langformat für Datum</guilabel> können Sie das Format festlegen, in dem lange Datumsangaben angezeigt und eingegeben werden. Das Format besteht aus Platzhaltern für verschiedene Datumskomponenten und normalem Text zu deren Trennung. Unten sind die verfügbaren Platzhalter aufgelistet. Sie können zwar beliebige Kombinationen der Platzhalter eingeben, sollten jedoch sicherstellen, dass jeder Tag in einem Jahr eindeutig identifizierbar ist. Beispielsweise sollten Sie Platzhalter für Monat und Tag verwenden, um Mehrdeutigkeiten zu verhindern. Falls Sie keinen Platzhalter für das Jahr eingeben, wird bei der Eingabe von Daten das aktuelle Jahr angenommen. Im Auswahlfeld finden Sie eine Liste mit üblichen Datumsformaten in der ausgewählten Sprache.

source: <parameter>YYYY</parameter> - The year with century as a decimal number (0000-9999).
de: <parameter>JJJJ</parameter> - Die Jahreszahl inklusive Jahrhundert (0000-9999).

source: <parameter>YY</parameter> - The year without century as a decimal number (00-99).
de: <parameter>JJ</parameter> - Die Jahreszahl ohne Jahrhundert (00-99).

source: <parameter>MM</parameter> - The month as a decimal number (01-12).
de: <parameter>MM</parameter> - Der Monat als zweistelliger Zahlenwert(01-12).

source: <parameter>mM</parameter> - The month as a decimal number (1-12).
de: <parameter>mM</parameter> - Der Monat als Zahlenwert(1-12).

source: <parameter>MONTH</parameter> - The full month name.
de: <parameter>MONAT</parameter> - Der vollständige Name des Monats.

source: <parameter>SHORTMONTH</parameter> - The first three characters of the month name.
de: <parameter>KURZMONAT</parameter> - Der abgekürzte Name des Monats (erste drei Zeichen).

source: <parameter>DD</parameter> - The day of month as a decimal number (01-31).
de: <parameter>TT</parameter> - Der Tag als zweistelliger Zahlenwert (01-31).

source: <parameter>dD</parameter> - The day of month as a decimal number (1-31).
de: <parameter>tT</parameter> - Der Tag als ein- oder zweistelliger Zahlenwert (1-31).

source: <parameter>WEEKDAY</parameter> - The full weekday name.
de: <parameter>WOCHENTAG</parameter> - Der vollständige Name des Wochentags.

source: <parameter>SHORTWEEKDAY</parameter> - The first three characters of the weekday name.
de: <parameter>WOCHENTAGKURZ</parameter> - Der abgekürzte Name des Wochentags (erste drei Zeichen).

source: <parameter>ERAYEAR</parameter> - The Era Year in local format (&eg; 2000 AD).
de: <parameter>ÄRAJAHR</parameter> - Das Jahr der Ära (&eg; 2000 AD).

source: <parameter>SHORTERANAME</parameter> - The short Era Name (&eg; AD).
de: <parameter>ÄRAKURZ</parameter> - Der abgekürzte Name der Ära (&eg; AD).

source: <parameter>YEARINERA</parameter> - The Year in Era as a decimal number (&eg; 2000).
de: <parameter>JAHRINÄRA</parameter> - Das Jahr der Ära als Zahl (&eg; 2000).

source: <parameter>DAYOFYEAR</parameter> - The Day of Year as a decimal number.
de: <parameter>TAGDESJAHRES</parameter> - Der Tag des Jahres als Zahl.

source: <parameter>ISOWEEK</parameter> - The ISO Week as a decimal number.
de: <parameter>ISOWOCHE</parameter> - Die ISO-Woche als Zahl.

source: <parameter>DAYOFISOWEEK</parameter> - The Day of the ISO Week as a decimal number.
de: <parameter>TAGDERISOWOCHE</parameter> - Der Tag der ISO-Woche als Zahl.

source: In the <guilabel>Short date format</guilabel> text box you can enter the format that you want to use to input and display short dates. This is in the same format as the <guilabel>Long date format</guilabel>, please read that section for more details. The drop-down box provides a list of common date formats in your currently selected language to choose from.
de: Im Textfeld <guilabel>Kurzformat für Datum</guilabel> können Sie das Format für kurze Datumsangaben festlegen. Mehr Informationen über die verfügbaren Parameter finden Sie im Abschnitt <guilabel>Langformat für Datum</guilabel>. Im Auswahlfeld finden Sie eine Liste von in der ausgewählten Sprache üblichen Datumsformaten.

source: The <guilabel>Digit set</guilabel> drop down box lists digit sets which may be used instead of Arabic digits when displaying dates and times. If you select a digit set other than Arabic, it will be applied only to numbers which appear in a language context that uses that digit set while Arabic digits are still going to be used elsewhere, &eg; Arabic-Indic digits will be applied to Arabic but not to American English.
de: Im Auswahlfeld <guilabel>Ziffernzeichen</guilabel> können für die Anzeige von Datums- und Zeitangaben statt der üblichen arabischen Zeichen andere Ziffernzeichen eingestellt werden. Hier ausgewählte andere Ziffernzeichen als Arabisch werden dann für die Anzeige von Zahlen in zugehörigen Sprachen verwendet, zum Beispiel Arabisch-Indische Zeichen in Programmen, die in arabischen Sprachen ausgeführt werden, aber nicht im Englischen. Ansonsten werden die üblichen arabischen Ziffernzeichen benutzt.

source: Other
de: Sonstige

source: On this tab, you can select how other options are displayed. The defaults are selected automatically based on the country which is currently selected.
de: Auf dieser Karteikarte können Sie festlegen, wie sonstige Maße dargestellt werden. Die Standardeinstellungen werden automatisch abhängig vom ausgewählten Land festgelegt.

source: In the <guilabel>Page size</guilabel> drop-down box you can choose the page size to use as the default for new documents, &eg; in KWord. Note that this setting does not affect your default paper size in the print dialog, to set that you need to use the Printers module of the &kde; &systemsettings;.
de: Im Auswahlfeld <guilabel>Seitengröße</guilabel> können Sie die Seitengröße festlegen, die als Standard für neue Dokumente, &eg; in KWord, verwendet wird. Beachten Sie, dass dies nicht die standardmäßig ausgewählte Papiergröße im Druck-Dialog ändert. Verwenden Sie dazu das Drucker-Modul der &kde;-&systemsettings;.

source: In the <guilabel>Measurement system</guilabel> drop-down box you can choose the measurement system to use, either metric or imperial.
de: Im Auswahlfeld <guilabel>Maßsystem</guilabel> können Sie das zu verwendende Maßsystem, entweder Metrisch oder Imperial, festlegen.

source: In the <guilabel>Byte size units</guilabel> drop-down box you can choose the unit system to use when displaying numbers counted in bytes. Traditionally <quote>kilobytes</quote> meant units of 1024 instead of the metric 1000 for most but not all byte sizes. To reduce confusion you can choose which system you prefer. The available unit systems are listed below.
de: Im Auswahlfeld <guilabel>Einheiten für Byte-Werte</guilabel> können Sie festlegen, wie Größen in Bytes behandelt werden. Traditionell bedeutet <quote>Kilobyte</quote> 1024 Bytes statt der metrischen Einheit von 1000. Um Missverständnissen vorzubeugen können Sie hier die gewünschten Einheiten auswählen. Unten sind die verfügbaren Systeme aufgeführt.

source: The <parameter>IEC Units</parameter> standard is always in multiples of 1024.
de: Die <parameter>IEC-Einheiten</parameter> verwenden Vielfache von 1024.

source: The <parameter>Metric Units</parameter> standard is always in multiples of 1000.
de: Die <parameter>Metrischen Einheiten</parameter> verwenden Vielfache von 1000.

source: The <parameter>JEDEC Units</parameter> standard uses the traditional units used in &kde; 3.5 and some other operating systems.
de: Die <parameter>JEDEC-Einheiten</parameter> verwenden die traditionellen Einheiten, wie in &kde; 3.5 und einigen anderen Betriebssystemen.
