Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kde-runtime/kcontrol_filetypes.po
Languages: de

source: File Associations
de: Dateizuordnungen

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Stefan</firstname><surname>Winter</surname><affiliation><address><email>kickdown@online.de</email></address></affiliation><contrib>Deutsche Übersetzung</contrib></othercredit>

source: Systemsettings
de: Systemeinstellungen

source: files association
de: Dateizuordnung

source: association
de: Zuordnung

source: Introduction
de: Einleitung

source: One of the most convenient aspects of &kde;, is its ability to automatically match a data file with its application. As an example, when you click on your favorite &calligrawords; document in the filemanager, &kde; automatically starts &calligrawords;, and automatically loads that file into &calligrawords; so you can begin working on it.
de: Eine der bequemsten Eigenschaften von &kde; ist die Fähigkeit eine Zuordnung von einer Datendatei zur zugehörigen Anwendung herzustellen. Wenn Sie zum Beispiel in der Dateiverwaltung auf ein &calligrawords;-Dokument klicken, startet &kde; automatisch &calligrawords; und lädt dieses Dokument in &calligrawords;.

source: In the example above, the &calligrawords; Data file is <emphasis>associated</emphasis> with &calligrawords; (the application). These file associations are crucial to the functioning of &kde;.
de: Im obigen Beispiel ist die &calligrawords;-Datei dem Programm &calligrawords; <emphasis>zugeordnet</emphasis>. Diese Dateizuordnungen sind grundlegend für die Funktion von &kde;.

source: When &kde; is installed, it automatically creates hundreds of file associations to many of the most common data types. These initial associations are based on the most commonly included software, and the most common user preferences.
de: Bei der Installation erstellt &kde; automatisch hunderte von Dateizuordnungen für die gebräuchlichsten Dateitypen. Diese Zuordnungen verbinden diese Dateitypen mit den üblicherweise zu &kde; gehörenden Programmen und den allgemeinen Benutzereinstellungen.

source: Unfortunately, &kde; can not:
de: Aber &kde; kann nicht:

source: predict every possible combination of software and data files
de: jede mögliche Kombination von Programmen und Dateitypen vorhersehen

source: prepare for file formats not yet invented
de: auf noch nicht erfundene Dateiformate vorbereitet sein

source: or predict everyone's favorite application for certain file formats
de: jedermanns bevorzugtes Programm für einen bestimmten Dateityp erraten

source: You can change your current file associations or add new file associations using this module.
de: In diesem Modul können die augenblicklichen Zuordnungen verändert und neue Zuordnungen hinzugefügt werden.

source: Each file association is recorded as a mime type. &MIME; stands for <quote>Multipurpose Internet Mail Extensions</quote>. It allows a computer to determine the type of file, without opening and analyzing the format of each and every file.
de: Jede Zuordnung wird als &MIME;-Typ (&MIME; steht für <quote>Multipurpose Internet Mail Extensions</quote>) gespeichert. Mit diesen Typen kann der Computer den Dateityp feststellen, ohne jede einzelne Datei zu öffnen und das Datenformat explizit zu analysieren.

source: How to use this module
de: Benutzung dieses Moduls

source: You can start this module by opening &systemsettings; and selecting <guilabel>File Associations</guilabel> in the <guilabel>Common Appearance and Behavior</guilabel> category. Alternatively, you can start it by typing <command>kcmshell4 filetypes</command> from the terminal or &krunner;.
de: Um dieses Modul zu öffnen, starten Sie die &systemsettings; und wählen <guilabel>Dateizuordnungen</guilabel> im Abschnitt <guilabel>Allgemeines Erscheinungsbild und Verhalten</guilabel>. Alternativ kann diese Module auch durch Eingabe von <command>kcmshell4 filetypes</command> in einem Terminal oder in &krunner; geöffnet werden.

source: The file associations are organized into several categories, and at a minimum you will have:
de: Die Dateizuordnungen sind in mehrere Kategorien gegliedert. Sie werden mindestens die folgenden haben:

source: Application
de: Application (Anwendung)

source: Image
de: Image (Bild)

source: Message
de: Message (Nachricht)

source: Multipart
de: Multipart (Mehrteilig)

source: All of the file associations are sorted into one of these categories.
de: Jede Dateizuordnung wird einer dieser Kategorien zugeordnet.

source: There is no functional difference between any of the categories. These categories are designed to help organize your file associations, but they do not alter the associations in any way.
de: Diese Kategorien haben keine funktionale Bedeutung. Sie helfen bei der Organisation der Dateizuordnungen, unterscheiden sich aber nicht in der Funktion.

source: The categories are listed in the box labeled <guilabel>Known Types</guilabel>.
de: Die Kategorien werden in dem Listenfeld <guilabel>Bekannte Typen</guilabel> angezeigt.

source: You can explore each of these categories, and see the file associations contained within each one, by simply double-clicking on the category name. You will be presented with a list of the associated mime-types under that category.
de: Klickt man auf einen Kategorienamen, so werden darunter alle &MIME;-Typen angezeigt, die dieser Kategorie zugewiesen worden sind.

source: You can also search for a particular &MIME; type by using the search box. The search box is labeled <guilabel>Find file type or filename pattern</guilabel> and is located above the category list.
de: Sie können nach einem bestimmten &MIME;-Typ suchen, indem Sie in das Textfeld <guilabel>Dateityp oder -muster suchen</guilabel> oberhalb der Liste benutzen.

source: Simply type the first letter of the &MIME; type you are interested in. The categories are automatically expanded, and only the mime-types that include that letter are displayed.
de: Sobald die ersten Buchstaben in das Textfeld eingegeben sind, werden die &MIME;-Typen angezeigt, die diesen Buchstaben enthalten.

source: You can then enter a second character and the mime-types will be further limited to mime types containing those two characters.
de: Tippt man den zweiten Buchstaben ein, werden nur die &MIME;-Typen angezeigt, die beide Buchstaben enthalten.

source: Adding a new mime type
de: Einen neuen MIME-Typ hinzufügen

source: If you want to add a new &MIME; type to your file associations, you can click on the <guibutton>Add...</guibutton> button. A small dialog box will appear. You select the category from the drop down box labeled <guilabel>Group</guilabel>, and type the &MIME; name in the blank labeled <guilabel>Type name</guilabel>. Click <guibutton>OK</guibutton> to add the new mime type, or click <guibutton>Cancel</guibutton> to not add any new mime-types.
de: Um einen neuen &MIME;-Typ für eine Dateizuordnung zu erstellen, klicken Sie auf den Knopf <guibutton>Hinzufügen ...</guibutton>. Ein Dialog erscheint, in dem die gewünschte Kategorie im Listenfeld <guilabel>Gruppe</guilabel> und den Typ im Textfeld <guilabel>Name</guilabel> festgelegt werden kann. Mit <guibutton>OK</guibutton> wird der neue &MIME;-Typ hinzugefügt, durch Klicken auf <guibutton>Abbrechen</guibutton> werden die Eingaben verworfen und der neue Typ nicht erstellt.

source: Removing a mime type
de: Einen MIME-Typ entfernen

source: If you want to remove a &MIME; type, simply select the &MIME; type you want to delete by clicking once with the mouse on the &MIME; type name. Then click the button labeled <guibutton>Remove</guibutton>. The &MIME; type will be deleted immediately.
de: Wählen Sie den gewünschten &MIME;-Typ durch einen Klick auf den Typnamen. Dann klicken Sie auf den Knopf <guibutton>Entfernen</guibutton>. Damit wird der &MIME;-Typ sofort gelöscht.

source: Editing a mime types properties
de: Die Eigenschaften eines MIME-Typen ändern

source: Before you can edit a &MIME; types property, you must first specify which &MIME; type. Simply browse through the categories until you find the &MIME; type you want to edit, then click once on it with the mouse.
de: Bevor man Veränderungen vornehmen kann, muss man zunächst den gewünschten &MIME;-Typ in der Liste der Bekannten Typen durch einen Mausklick auswählen.

source: As soon as you have selected the &MIME; type, the current values of the &MIME; type will appear in the module window.
de: Daraufhin werden die aktuellen Einstellungen dieses &MIME;-Typs im Modulfenster angezeigt.

source: You will notice the current values are split into two tabs: <guilabel>General</guilabel> and <guilabel>Embedding</guilabel>
de: Die aktuellen Werte werden auf den beiden Karteikarten <guilabel>Allgemein</guilabel> und <guilabel>Einbetten</guilabel> angezeigt.

source: General
de: Allgemein

source: There are 4 properties for each &MIME; type in this tab:
de: Jeder &MIME;-Typ hat vier Eigenschaften auf dieser Karteikarte:

source: <guilabel>Mime Type Icon</guilabel> is the icon that will be visible when using &dolphin; or &konqueror; as a file manager.
de: <guilabel>&MIME;-Typ-Symbol</guilabel> ist das für diesen Typ in der Dateiverwaltung &dolphin; oder &konqueror; angezeigte Symbol.

source: <guilabel>Filename Patterns</guilabel> is a search pattern which &kde; will use to determine the &MIME; type.
de: <guilabel>Dateimuster</guilabel> ist ein Suchmuster, mit dessen Hilfe &kde; Dateien dieses &MIME;-Typs findet.

source: <guilabel>Description</guilabel> is a short description of the file type. This is for your benefit only.
de: <guilabel>Beschreibung</guilabel> beschreibt den Dateityp kurz. Dieses Feld hat keine weitere Funktion.

source: <guilabel>Application Preference Order</guilabel> determines which applications will be associated with the specified &MIME; type.
de: <guilabel>Rangfolge der zugeordneten Anwendungsprogramme</guilabel> legt fest, welche Programme diesem &MIME;-Typ zugeordnet werden.

source: Embedding Tab
de: Karteikarte Einbetten

source: The Embedding tab allows you to determine if a file will be viewed within a filemanager window, or by starting the application.
de: Auf dieser Karteikarte wird festgelegt, ob dieser Dateityp innerhalb der Dateiverwaltung oder durch Starten der Anwendung angezeigt wird.

source: Changing the Icon
de: Ändern des Symbols

source: To change the icon, simply click on the Icon button. A dialog box will appear, which will show you all available icons. Simply click once with the mouse on the icon of your choice, and click <guibutton>OK</guibutton>.
de: Um das Symbol zu verändern, klicken Sie auf das Symbol. Es erscheint ein Dialog, der alle verfügbaren Symbole anzeigt. Wählen Sie ein neues Symbol durch Klicken aus und bestätigen Sie mit <guibutton>OK</guibutton>.

source: Editing the mime-type patterns
de: Ändern der &MIME;-Typ-Dateimuster

source: The box labeled <guilabel>Filename Patterns</guilabel>, determines what files will be included within this mime-type.
de: Das Feld <guilabel>Dateimuster</guilabel> bestimmt, welche Dateien zu diesem &MIME;-Typ gehören.

source: Usually, files are selected based on their suffix. (Examples: Files that end with <literal role="extension">.wav</literal> are sound files, using the WAV format and files that end in <literal role="extension">.c</literal> are program files written in C).
de: Normalerweise wird die Dateiendung für die Bestimmung des &MIME;-Typs verwendet. (Beispiele: Dateien, die auf <literal role="extension">.wav</literal> enden, sind Sounddateien im WAV-Format und Dateien, die auf <literal role="extension">.c</literal> enden, sind Quelltexte zu Programmen in der Programmiersprache C).

source: You should enter your filename mask in this combo box.
de: Man tippt das gewünschte Dateimuster in dieses Listenfeld ein.

source: The asterisk (<literal>*</literal>) is a wildcard character that will be used with nearly every mime type mask. A complete discussion of wildcards is beyond the scope of this manual, but it is important to understand that the asterisk (in this context), <quote>matches</quote> any number of characters. As an example: <userinput>*.pdf</userinput> will match <filename>Datafile.pdf</filename>, <filename>Graphics.pdf</filename> and <filename>User.pdf</filename>, but not <filename>PDF</filename>, <filename>Datafile.PDF</filename>, or <filename>.pdf</filename>.
de: Das Sternchen (<literal>*</literal>) ist ein Spezialzeichen, das wohl in jedem &MIME;-Typ auftaucht. Eine vollständige Diskussion von Spezialzeichen geht über diesen Hilfetext hinaus. Wichtig ist, dass das Sternchen (in diesem Zusammenhang) für eine beliebige Anzahl <quote>beliebiger</quote> Zeichen steht. Zum Beispiel: Das Dateimuster <userinput>*.pdf</userinput> enthält <filename>Datendatei.pdf</filename>, <filename>Grafik.pdf</filename> und <filename>Benutzer.pdf</filename>, aber nicht <filename>PDF</filename>, <filename>Datendatei.PDF</filename> oder <filename>.pdf</filename>

source: It is very beneficial to have multiple masks. One for lower case, one for upper case, &etc; This will help ensure that &kde; can determine the file type more accurately.
de: Es ist günstig, mehrere Dateimuster zu haben; mindestens eines für Klein- und eines für Großbuchstaben. Das stellt sicher, dass &kde; den &MIME;-Typ einer Datei bestimmen kann.

source: Editing a mime types description.
de: Ändern der &MIME;-Typ-Beschreibung.

source: You can type a short description of the &MIME; type in the text box labeled <guilabel>Description</guilabel>. This label is to help you, it does not affect the function of the &MIME; type.
de: Man kann eine kurze Beschreibung des &MIME;-Typs in dem Feld <guilabel>Beschreibung</guilabel> eintragen. Diese Beschreibung hat keine Funktion. Sie dient lediglich dem Benutzer zur Identifikation des &MIME;-Typs.

source: Editing the application associations
de: Ändern der zugeordneten Anwendungen

source: There are five buttons (<guibutton>Move Up</guibutton>, <guibutton>Move Down</guibutton>, <guibutton>Add</guibutton>, <guibutton>Edit</guibutton> and <guibutton>Remove</guibutton>) and a list box (which lists the applications) which are used to configure the applications.
de: Für die Konfiguration der zugeordneten Anwendungen gibt es fünf Knöpfe (<guibutton>Nach oben</guibutton>, <guibutton>Nach unten</guibutton>, <guibutton>Hinzufügen</guibutton>, <guibutton>Bearbeiten</guibutton> und <guibutton>Entfernen</guibutton>) sowie ein Listenfeld, das die zugeordneten Programme anzeigt.

source: The list box lists all of the applications associated with a specific &MIME; type. The list is in a specific order. The top application is the first application tried. The next application down the list is the second, &etc;
de: Das Listenfeld enthält alle dem &MIME;-Typ zugeordneten Anwendungen. Die Reihenfolge ist dabei wichtig. Es wird zuerst die oberste Anwendung probiert, danach die Zweite &etc;

source: What do you mean there is more than one application per &MIME; type? Why is this necessary?
de: Warum gibt es mehr als eine Anwendung pro &MIME;-Typ? Wozu ist das notwendig?

source: We started out by saying that &kde; comes preconfigured with hundreds of file associations. The reality is, each system that &kde; is installed on has a different selection of applications. By allowing multiple associations per &MIME; type, &kde; can continue to operate when a certain application is not installed on the system.
de: Anfangs wurde bereits gesagt, das &kde; mit hunderten von vorkonfigurierten Dateizuordnungen ausgeliefert wird. Jedes System, auf dem &kde; installiert ist, unterscheidet sich darin, welche Anwendungen installiert sind. Da mehrere Anwendungen pro &MIME;-Typ zur Auswahl stehen, kann &kde; funktionieren, auch wenn eine bestimmte Anwendung nicht installiert ist.

source: As an example:
de: Zum Beispiel:

source: For the &MIME; type <literal>pdf</literal>, there are two applications associated with this file type. The first program is called &okular;. If your system does not have &okular; installed, then &kde; automatically starts the second application &krita;. As you can see, this will help keep &kde; running strong as you add and subtract applications.
de: Für den &MIME;-Typ <literal>pdf</literal> gibt es zwei zugeordnete Anwendungen. Die erste ist &okular;. Falls &okular; auf Ihrem System nicht installiert ist, startet &kde; automatisch die zweite Anwendung &krita;. Damit bleibt &kde; in Funktion, obwohl sich die installierten Programme verändern.

source: We have established that the order is important. You can change the order of the applications by clicking once with the mouse on the application you want to move, and then clicking either <guibutton>Move Up</guibutton> or <guibutton>Move Down</guibutton>. This will shift the currently selected application up or down the list of applications.
de: Wir erwähnten bereits, dass die Reihenfolge der Anwendungen wichtig ist. Die Reihenfolge kann geändert werden, indem man auf die Anwendung klickt, deren Position verändert werden soll, und dann je nach Wunsch auf die Knöpfe <guibutton>Nach oben</guibutton> und <guibutton>Nach unten</guibutton>. Jeder Klick verschiebt die ausgewählte Anwendung um eine Position in der Liste.

source: You can add new applications to the list by clicking the button labeled <guibutton>Add</guibutton>. A dialog box will appear. Using the dialog box, you can select the application you want to use for this mime type. Click <guibutton>OK</guibutton> when you are done, and the application will be added to the current list.
de: Um neue Anwendungen hinzuzufügen, klickt man auf <guibutton>Hinzufügen</guibutton>. Es erscheint ein Dialog, mit dessen Hilfe man die gewünschte Anwendung auswählen kann. Klickt man zur Bestätigung auf <guibutton>OK</guibutton>, so wird diese Anwendung zur Liste der Anwendungen für diesen &MIME;-Typ hinzugefügt.

source: To change the options of an application for a particular &MIME; type select it in the list and then press the <guibutton>Edit...</guibutton> button. This opens a new dialog with <guilabel>General</guilabel>, <guilabel>Permissions</guilabel>, <guilabel>Applications</guilabel> and <guilabel>Preview</guilabel> tabs. On the <guilabel>Applications</guilabel> tab you can edit <guilabel>Name</guilabel>, <guilabel>Description</guilabel> and <guilabel>Comment</guilabel>. In the <guilabel>Command</guilabel> field you can have several place holders following the command, which will be replaced with the actual values when the actual program is run:
de: Um die Einstellungen eines Programms für einen bestimmten &MIME;-Typ zu ändern, wählen sie es in der Liste aus und drücken dann den Knopf <guibutton>Bearbeiten ...</guibutton>. Damit wird ein neuer Dialog mit den Karteikarten <guilabel>Allgemein</guilabel>, <guilabel>Berechtigungen</guilabel>, <guilabel>Programm</guilabel> und <guilabel>Vorschau</guilabel>. Auf der Karteikarte <guilabel>Programm</guilabel> kann <guilabel>Name</guilabel>, <guilabel>Beschreibung</guilabel> und ein <guilabel>Kommentar</guilabel> eingegeben werden. Im Eingabefeld <guilabel>Befehl</guilabel> können diverse Platzhalter benutzt werden, die durch folgende Werte ersetzt werden, sobald das Programm tatsächlich läuft:

source: %f - a single file name
de: %f - ein Dateiname

source: %F - a list of files; use for applications that can open several local files at once
de: %F - eine Liste von Dateien. Benutzen Sie dies bei Anwendungen, die mehrere lokale Dateien gleichzeitig öffnen können

source: %u - a single URL
de: %u - eine Adresse (&URL;)

source: %U - a list of URLs
de: %U - eine Liste von Adressen (URLs)

source: %d - the folder of the file to open
de: %d - der Ordner der zu öffnenden Datei

source: %D - a list of folders
de: %D - eine Liste von Ordnern

source: %i - the icon
de: %i - das Symbol

source: %m - the mini-icon
de: %m - das Mini-Symbol

source: %c - the caption
de: %c - der Fenstertitel

source: You can remove an application (thereby ensuring that the application will never run with this &MIME; type by clicking once on the name of the application, and clicking the <guibutton>Remove</guibutton> button.
de: Um zu verhindern, dass eine bestimmte Anwendung mit diesem &MIME;-Typ ausgeführt wird, klickt man auf die gewünschte Anwendung um sie auszuwählen. Ein Klick auf <guibutton>Entfernen</guibutton> löscht die Anwendung aus der Liste.

source: It is a good idea to use the <guibutton>Move Up</guibutton> and <guibutton>Move Down</guibutton> buttons to adjust the unwanted application to a lower position in the list, rather than deleting the application from the list entirely. Once you have deleted an application, if your preferred application should become compromised, there will not be an application to view the data document.
de: Normalerweise ist es sinnvoller, eine ungewünschte Anwendung mit Hilfe der Knöpfe <guibutton>Nach oben</guibutton> und <guibutton>Nach unten</guibutton> an das Ende der Liste der Anwendungen zu stellen anstatt sie ganz zu löschen. Wenn die gewünschte Anwendung für diesen Typ einmal unerreichbar werden sollte, hat man so immer noch wenigstens eine Anwendung, um diesen &MIME;-Typ zu betrachten.

source: Embedding
de: Einbetten

source: These settings are valid only for &konqueror; used as file manager, &dolphin; is not able to use embedded views and opens a file always in the associated application.
de: Diese Einstellungen werden nur von &konqueror; als Dateiverwaltung benutzt, &dolphin; kann keine eingebetteten Ansichten anzeigen und öffnet eine Datei immer mit der zugehörigen Anwendung.

source: By clicking on the <guilabel>Embedding</guilabel> tab, you are presented with four radio buttons in the <guilabel>Left click action</guilabel> group. These determine how the filemanager views the selected &MIME; type:
de: Auf der Karteikarte <guilabel>Einbetten</guilabel> wird eine Gruppe von vier Auswahlknöpfen mit dem Titel <guibutton>Linksklick-Aktion</guibutton> angezeigt. Diese bestimmen, wie die Dateiverwaltung den &MIME;-Typ anzeigt:

source: Show file in embedded viewer
de: Datei in eingebettetem Betrachter anzeigen

source: If this is selected, the file will be shown <emphasis>within</emphasis> the filemanager window.
de: Wenn diese Option gewählt ist, wird die Datei <emphasis>innerhalb</emphasis> des Dateiverwaltungs-Fensters angezeigt.

source: Show file in separate viewer
de: Datei in extra Betrachter anzeigen

source: This will cause a separate window to be created when showing this mime-type.
de: Bei dieser Option wird zum Anzeigen dieses &MIME;-Typs ein eigenes Fenster erstellt.

source: Use settings for 'application' group
de: Einstellung aus „Gruppe“ übernehmen

source: This will cause the mime-type to use the settings for the mime-type group. (if you are editing an audio mime type, then the settings for the audio group are used).
de: Diese Option sorgt dafür, dass die Einstellungen der jeweiligen Gruppe verwendet werden. (Wenn man einen Audio-&MIME;-Typ bearbeitet, werden die Einstellungen der Audio-Gruppe verwendet).

source: Ask whether to save to disk instead
de: Nachfragen, ob stattdessen auf Festplatte gespeichert werden soll

source: This setting applies only to &konqueror; in browser mode and determines if the file is shown in an embedded viewer or if you are asked to save the file to disk instead.
de: Diese Einstellung wird nur von &konqueror; im Browser-Modus benutzt und bestimmt, ob eine Datei in einer eingebetteten Ansichten anzeigt wird oder nachgefragt wird, stattdessen auf Festplatte zu speichern.

source: Below this is a listbox labeled <guilabel>Services Preference Order</guilabel>.
de: Darunter befindet sich das Listenfeld <guilabel>Rangfolge der zugeordneten Dienstprogramme</guilabel>.
