Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kde-runtime/kcontrol_filemanager.po
Languages: de

source: File Management
de: Dateiverwaltung

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Stefan</firstname><surname>Winter</surname><affiliation><address><email>kickdown@online.de</email></address></affiliation><contrib>Deutsche Übersetzung</contrib></othercredit>

source: Systemsettings
de: Systemeinstellungen

source: In these modules, you can configure various aspects of &konqueror;'s file manager functionality.
de: Hier werden einige Einstellungen für &konqueror; als Dateimanager vorgenommen.

source: &konqueror;'s web browser functionality has its <ulink url="help:/kcontrol/khtml-behavior/index.html">own configuration modules</ulink>.
de: Diejenigen Funktionen von &konqueror;, die das Internet-Browsen betreffen, werden in einem <ulink url="help:/kcontrol/khtml-behavior/index.html">eigenen Modul</ulink> eingerichtet.

source: Misc Options
de: Verschiedene Einstellungen

source: Open folders in separate windows
de: Ordner in extra Fenstern öffnen

source: If this option is checked, a new &konqueror; window will be created when you open a folder, rather than simply showing that folder's contents in the current window.
de: Diese Option veranlasst &konqueror; beim Öffnen eines Ordners ein neues Fenster zu erstellen, anstatt den Inhalt einfach im aktuellen Fenster anzuzeigen.

source: Show 'Delete' menu entries which bypass the trashcan
de: „Löschen“ in Menüs anzeigen (Achtung: Löschen übergeht die Papierkorb-Funktion)

source: Check this if you want <quote>Delete</quote> menu commands to be displayed on the desktop and in the file manager's context menus. You can always delete files by holding the &Shift; key while calling <guimenuitem>Move to Trash</guimenuitem>.
de: Aktivieren Sie diese Einstellung, wenn die Aktion <quote>Löschen</quote> in Menü-Einträgen für die Arbeitsfläche und den Dateimanager angezeigt werden soll. Sie können Dateien jederzeit löschen, indem Sie die &Shift;-Taste gedrückt halten und <guimenuitem>In den Papierkorb werfen</guimenuitem> auswählen.

source: The settings for &konqueror;'s file manager mode on the <guilabel>View Modes</guilabel>, <guilabel>Navigation</guilabel>, <guilabel>Services</guilabel>, <guilabel>General</guilabel> and <guilabel>Trash</guilabel> pages are used by &dolphin; as well.
de: Die Einstellung auf den Seiten <guilabel>Ansichts-Modi</guilabel>, <guilabel>Navigation</guilabel>, <guilabel>KDE-Dienste</guilabel>, <guilabel>Allgemein</guilabel> und <guilabel>Papierkorb</guilabel> werden sowohl von &konqueror; im Dateimanagermodus als auch von &dolphin; gemeinsam verwendet.
