Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kde-runtime/kcontrol_kded.po
Languages: de

source: Service Manager
de: Diensteverwaltung

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Burkhard</firstname><surname>Lück</surname><affiliation><address><email>lueck@hube-lueck.de</email></address></affiliation><contrib>Übersetzung</contrib></othercredit>

source: Systemsettings
de: Systemeinstellungen

source: Service
de: Dienst

source: The <guilabel>Service Manager</guilabel> module allows you to have an overview of all plugins of the &kde; Daemon, also referred to as &kde; Services. Generally, there are two types of service:
de: Das Modul <guilabel>Diensteverwaltung</guilabel> gibt Ihnen eine Übersicht über alle Module des &kde;-Daemon, auch &kde;-Systemdienst genannt. Es gibt zwei Arten von Diensten:

source: Load-on-Demand Services
de: Dienste, die nur auf Anforderung gestartet werden

source: This is a list of available &kde; services which will be started on demand. They are only listed for convenience, as you cannot manipulate these services.
de: Dies ist eine Liste sämtlicher verfügbarer &kde;-Dienste, die nur auf ausdrückliche Anforderung gestartet werden. Sie werden nur zu Ihrer Information gelistet. Es lassen sich keine Änderungen vornehmen.

source: Startup Services
de: KDE-Dienste beim Start

source: This shows all &kde; services that can be loaded on &kde; startup. Services checked in the <guilabel>Use</guilabel> column will be invoked on next startup.
de: Hier sind alle &kde;-Dienste aufgeführt, die sich beim Start von &kde; laden lassen. Dienste, die in der Spalte <guilabel>Benutzung</guilabel> markiert sind, werden beim nächsten Start aufgerufen.

source: Be careful with deactivation of unknown services: some services are vital for &kde;; do not deactivate services if you do not know what you are doing.
de: Seien Sie bitte vorsichtig bei der Deaktivierung Ihnen unbekannter Dienste, einige sind sehr wichtig für das &kde;-System.

source: To change the <guilabel>Status</guilabel> of a service, select it in the list. Then you can use the <guibutton>Start</guibutton> and <guibutton>Stop</guibutton> to change the status of a service from <guilabel>Not running</guilabel> to <guilabel>Running</guilabel> and vice versa.
de: Um den <guilabel>Status</guilabel> eines Dienstes zu ändern, wählen sie ihn in der Liste aus. Mit <guibutton>Start</guibutton> und <guibutton>Stopp</guibutton> kann dann der Status dieses Dienstes von <guilabel>Nicht gestartet</guilabel> in <guilabel>Läuft</guilabel> und umgekehrt geändert werden.
