Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kde-runtime/kcontrol_kcmcss.po
Languages: de

source: <title>Appearance</title>
de: <title>Erscheinungsbild</title>

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Frank</firstname><surname>Schütte</surname> <affiliation><address><email>F.Schuette@t-online.de</email></address></affiliation><contrib>Übersetzung</contrib></othercredit>

source: <keyword>Appearance</keyword>
de: <keyword>Erscheinungsbild</keyword>

source: Font
de: Schriftart

source: <keyword>Stylesheets</keyword>
de: <keyword>Stilvorlagen</keyword>

source: Accessibility
de: Zugangshilfen

source: This module consists of three tabs with configure options how to display web pages.
de: Diese Modul besteht aus drei Karteikarten mit Einstellungen für die Anzeige von Webseiten.

source: General
de: Allgemein

source: The check box labeled <guilabel>Automatically load images</guilabel> allows you to control whether images on web pages are loaded by default. Unless you have a very slow connection, you will probably want to leave this option selected, as there are many web pages that are difficult to use without images. If you don't select the option to automatically load images, you can still view the text on the page, and then load the images if you need them.
de: Mit dem Ankreuzfeld <guilabel>Bilder automatisch laden</guilabel> legen Sie fest, ob Bilder auf Webseiten automatisch geladen werden. Wenn Sie nicht gerade eine sehr langsame Verbindung haben, empfiehlt es sich, diese Option auszuwählen, da es viele Webseiten gibt, die Sie ohne Bilder nur schwer nutzen können. Wenn Sie diese Option nicht auswählen, werden die Bilder nicht automatisch geladen. Aber Sie können dennoch den Text auf der Seite ansehen, und die Bilder erst bei Bedarf laden.

source: If <guilabel>Draw frame around not completely loaded images</guilabel> is checked, &konqueror; will draw a frame as a placeholder around images embedded in a web page that are not yet fully loaded. You will probably want to check this box to enhance your browsing experience, especially if have a slow network connection.
de: Ist die Einstellung <guilabel>Rahmen um nicht vollständig geladene Bilder</guilabel> aktiviert, zeichnet &konqueror; einen Rahmen als Platzhalter für noch nicht vollständig geladene Bilder, die in eine Webseite eingebunden sind. Diese Einstellung kann besonders dann von Vorteil sein, wenn Sie über eine langsame Anbindung an das Internet verfügen.

source: Many web pages use animated gif images, and these can be very annoying, and in some cases, quite a drain on your system resources. The <guilabel>Animations</guilabel> option lets you choose when animations are enabled. The default is enabled, but you can set this to disabled, or to run the animation only once, even if the file itself contains instructions that the animation should run more times, or continuously.
de: Viele Web-Seiten verwenden animierte GIF-Bilder. Diese können einerseits sehr anstrengend sein und außerdem die Arbeitsgeschwindigkeit des Rechners erheblich beeinträchtigen. Das Listenfeld <guilabel>Animationen</guilabel> erlaubt die Einstellung, ob Animationen angezeigt werden sollen. Es kann entweder die Animation deaktiviert werden oder sie kann einmal oder kontinuierlich angezeigt werden. Ist <guilabel>Nur einmal anzeigen</guilabel> ausgewählt, so wird die Animation nur einmal durchgeführt, auch wenn sich in der GIF-Datei andere Anweisungen befinden.

source: The next setting is <guilabel>Underline links:</guilabel>. You can choose to underline links <guilabel>Enabled</guilabel>. If this option is selected, any text on web pages that acts as a link will be shown in an underlined font. While many web pages do use color to distinguish text that acts as a link, underlining makes it very easy to spot links.
de: Die nächste Einstellung ist <guilabel>Verknüpfungen unterstreichen:</guilabel> Hier können Sie die Option <guilabel>Aktiviert</guilabel> wählen. Bei dieser Option wird jeder Text auf einer Webseite, der als Verknüpfung dient, in unterstrichener Schrift dargestellt. Während viele Webseiten Farben verwenden, um Texte hervorzuheben, die als Verknüpfung dienen, macht es das Unterstreichen sehr einfach, Verknüpfungen sichtbar zu machen.

source: If you don't like underlined links, you can choose <guilabel>Disabled</guilabel>, so that no links are underlined. Or you can choose a middle ground, <guilabel>Only on Hover</guilabel>, so that links are underlined when the mouse cursor is resting over them, and not underlined the rest of the time.
de: Mögen sie keine unterstrichenen Verknüpfungen, so wählen Sie die Option <guilabel>Deaktiviert</guilabel>, wodurch Verknüpfungen nicht mehr unterstrichen werden. Einen Mittelweg bietet die Option <guilabel>Nur bei Berührung</guilabel>, bei der Verknüpfungen nur dann unterstrichen werden, wenn der Mauszeiger über ihnen schwebt, ansonsten werden sie nicht unterstrichen dargestellt.

source: The site's CSS definitions can override this value.
de: Die CSS-Einstellungen auf der Webseite können diese Einstellungen überschreiben.

source: <guilabel>Smooth scrolling</guilabel> determines whether &konqueror; should use smooth steps to scroll &HTML; pages, or whole steps:
de: <guilabel>Weicher Bildlauf</guilabel> legt fest ob &konqueror; einen weichen Bildlauf zum Rollen durch Webseiten verwenden soll.

source: <guilabel>Always</guilabel>: Always use smooth steps when scrolling.
de: <guilabel>Immer</guilabel>: Immer einen weichen Bildlauf verwenden.

source: <guilabel>Never</guilabel>: Never use smooth scrolling, scroll with whole steps instead.
de: <guilabel>Nie</guilabel>: Keinen weichen Bildlauf verwenden, beim Rollen werden immer ganze Zeilen gesprungen.

source: <guilabel>When Efficient</guilabel>: Only use smooth scrolling on pages where it can be achieved with moderate usage of system resources.
de: <guilabel>Falls sinnvoll</guilabel>: Ein weicher Bildlauf wird nur verwendet, wenn dies mit der angezeigten Webseite ohne zu großen Einsatz von Systemressourcen möglich ist.

source: Fonts
de: Schriftarten

source: Under this tab, you can select various options related to the use of fonts. Although the shapes and sizes of fonts are often part of the design of a web page, you can select some default settings for &konqueror; to use.
de: Auf dieser Karteikarte können Sie verschiedene Optionen bezüglich der Schrift einstellen. Obwohl die Form und die Größe von Schriften oft Teil des Designs einer Webseite sind, können Sie hier einige Standardeinstellungen vornehmen, die &konqueror; verwenden wird.

source: The first thing you can set here is the font size. There are two settings which work together to allow you a comfortable browsing experience.
de: Die erste Option, die Sie hier einstellen können, ist die Schriftgröße. Es gibt zwei Einstellungen, die zusammenwirken, und Ihnen ein komfortables Durchsuchen (<quote>Browsen</quote>)ermöglichen.

source: Firstly, you can set a <guilabel>Minimum font size</guilabel>. This means, even if the font size is set specifically in the page you are viewing, &konqueror; will ignore that instruction and never show smaller fonts than you set here.
de: Zuerst können Sie eine <guilabel>Minimale Schriftgröße</guilabel> einstellen. Das bedeutet, auch wenn die Schriftgröße explizit auf einer Webseite festgelegt ist, wird &konqueror; diese Anweisung ignorieren, und niemals eine kleinere Schriftgröße verwenden, als Sie hier angegeben haben.

source: Next you can set a <guilabel>Medium font size</guilabel>. This is not only the default size of text, used when the page does not specify sizes, but it is also used as the base size that relative font sizes are calculated against. That is, the &HTML; instruction <quote>smaller</quote>, it means smaller than the size you set for this option.
de: Als nächstes können Sie die <guilabel>Mittlere Schriftgröße</guilabel> festlegen. Das ist nicht nur die Standardgröße für Text, die verwendet wird, wenn die Webseite keine Größe vorgibt, sondern dient auch als Basisgröße zur Berechnung von relativen Schriftgrößen. Das heißt zum Beispiel, die &HTML; Anweisung <quote>smaller</quote> bedeutet, kleiner als die hier festgelegte Schriftgröße.

source: For either option, you can select the exact font size in points by using the up/down spin control (or just typing) next to the option label.
de: Für beide Optionen legen Sie die genauen Schriftgrößen in Punkten über die Hoch-/Runter-Kontrollelemente fest, oder geben Sie direkt in die Eingabefelder ein.

source: These options are independent of each other. Pages that do not set a font size, or ask for the default, will display with the size you set from <guilabel>Medium font size</guilabel>, while any pages that ask for a size smaller than your <guilabel>Minimum font size</guilabel> setting will instead show that size. The one does not affect the other.
de: Diese Einstellungen sind unabhängig von einander. Seiten, die nicht eine bestimmte Schriftgröße setzen oder die Standardgröße anfordern, werden in der Größe angezeigt, die man unter <guilabel>Mittlere Schriftgröße</guilabel> einstellt. Seiten, die eine Schriftgröße unterhalb von <guilabel>Minimale Schriftgröße</guilabel> anfordern, werden stattdessen in dieser Schriftgröße angezeigt. Die eine Einstellung hat keine Auswirkungen auf die Andere.

source: The remaining options are for the fonts to be associated with different types of markup used in &HTML; pages. Note that many web pages may override these settings. For any type of font (Standard, Fixed, Serif, &etc;) you can select a different font if you like.
de: Die folgenden Optionen beziehen sich auf Schriften in Verbindung mit verschiedenen Arten von Beschreibungsbefehlen, die in &HTML;-Seiten verwendet werden. Beachten Sie, dass viele Webseiten diese Einstellungen übergehen. Für jede Schriftart (Standard, Feste Breite, Serifen &etc;) können Sie eine andere Schrift aus den Aufklappfeldern auswählen.

source: Below this, you can set a <guilabel>Font size adjustment for this encoding</guilabel>. Sometimes the fonts you want to use for a particular encoding or language are much larger or smaller than average, so you can use this setting to bring them into line.
de: Darunter können Sie die <guilabel>Schriftgrößenanpassung für diese Kodierung</guilabel> festlegen. Es passiert manchmal, dass die Schrift, die Sie für eine besondere Kodierung oder Sprache verwenden möchten, sehr viel größer oder kleiner als der Durchschnitt ist, sodass durch diese Option die Schriftgröße angepasst wird.

source: You can set a default encoding that &konqueror; should assume pages are when rendering them. The default setting is <guilabel>Use Language Encoding</guilabel>, but you can change it to any encoding available in the list.
de: Sie können eine Standard-Kodierung einstellen, die &konqueror; bei der Darstellung von Seiten verwenden soll. Die Standardeinstellung lautet <guilabel>Sprachspezifische Kodierung verwenden</guilabel>, aber Sie können jede in der Liste verfügbare Kodierung einstellen.

source: <title>Stylesheets</title>
de: <title>Stilvorlagen</title>

source: Introduction
de: Einleitung

source: <acronym>CSS</acronym> style sheets affect the way web pages appear. <acronym>CSS</acronym> stands for <emphasis>C</emphasis>ascading <emphasis>S</emphasis>tyle <emphasis>S</emphasis>heets.
de: <acronym>CSS</acronym> Stilvorlagen (Stylesheets) beeinflussen die Darstellung von Internetseiten. <acronym>CSS</acronym> steht für <emphasis>C</emphasis>ascading <emphasis>S</emphasis>tyle <emphasis>S</emphasis>heets.

source: &kde; can use its own stylesheet, based on simple defaults and the color scheme you are using for your desktop. &kde; can also use a stylesheet that you have written yourself. Finally, you can specify a stylesheet in this module. The options presented in this module are tuned for accessibility purposes, especially for people with reduced vision.
de: &kde; kann seine eigene Stilvorlage verwenden, die auf einfachen Standardeinstellungen und dem Farbschema der Arbeitsfläche basiert. Es ist aber auch möglich, eigene Stilvorlagen für &kde; zu schreiben. Schließlich können Sie in diesem Modul eine Stilvorlage angeben. Die Optionen in diesem Modul sind für Zugangshilfen optimiert, besonders für Personen mit einer Sehbehinderung.

source: Your choices here affect every &kde; application that renders HTML with &kde;'s own renderer, which is called khtml. These include &kmail;, &khelpcenter; and of course &konqueror;. Choices here do not affect other browsers such as &Netscape;.
de: Die Einstellungen wirken sich auf alle &kde; Anwendungen aus, die &kde;s eigenen Renderer khtml für die Darstellung von HTML verwenden. Dazu gehören &kmail;, &khelpcenter; und natürlich &konqueror;. Andere Browser wie &Netscape; werden durch die Einstellungen nicht beeinflusst.

source: This section contains the following options:
de: Dieser Abschnitt enthält die folgenden Einstellmöglichkeiten:

source: Use default stylesheet
de: Standard-Stilvorlage verwenden

source: &kde; will use the default stylesheet. Some of the colors will default to those defined in your chosen color scheme. Most settings are easily overridden by the page you are viewing.
de: &kde; verwendet die Standard-Stilvorlage. Einige Farben werden an das Farbschema der Arbeitsfläche angepasst. Die meisten Einstellungen werden von der dargestellten Internetseite übernommen.

source: Use user-defined stylesheet
de: Benutzerdefinierte Stilvorlage verwenden

source: &kde; will use a stylesheet that you have written yourself. You can use the browse button to locate the stylesheet on your system. <acronym>CSS</acronym> files traditionally have a <literal role="extension">.css</literal> extension, but this is not required.
de: &kde; verwendet eine vom Benutzer selbst geschriebene Stilvorlage. Man kann den Knopf <guilabel>Dateiauswahl</guilabel> verwenden, um die Stilvorlage zu suchen. <acronym>CSS</acronym>-Dateien haben üblicherweise die Dateierweiterung <literal role="extension">.css</literal>, aber das ist nicht erforderlich.

source: Use accessibility stylesheet
de: Stilvorlage für Zugangshilfen verwenden

source: Use the settings defined in the <guilabel>Customize</guilabel> dialog. Enabling this option will enable the <guibutton>Customize</guibutton> button lo launch a dialog to define stylesheet settings.
de: Ist dies ausgewählt, werden die Einstellungen aus dem Dialog <guilabel>Benutzerdefinierte Stilvorlagen</guilabel> verwendet. Dann kann mit dem Knopf <guibutton>Einrichten ...</guibutton> auch der Dialog zur Einstellung der Stilvorlagen geöffnet werden.

source: Customize
de: Benutzerdefinierte Stilvorlagen

source: In this dialog you can set up a user stylesheet. The options available are only a subset of the instructions you can add in a stylesheet, and they are geared towards people with reduced vision, to allow users to create a stylesheet that makes web pages and the &kde; help files more readable.
de: In diesem Dialog kann eine eigene Stilvorlage eingerichtet werden. Die Optionen betreffen nur einen Teilbereich der mit einer Stilvorlage einstellbaren Parameter, und sie sind für Sehbehinderte optimiert, um damit Internetseiten und die &kde;-Hilfedateien lesbarer zu machen.

source: The options in this dialog are disabled unless you chose <guilabel>Use accessibility stylesheet</guilabel>.
de: Die Optionen aus diesem Dialog sind nur dann aktiviert, wenn <guilabel>Stilvorlage für Zugangshilfen verwenden</guilabel> auswählt ist.

source: Font Family
de: Schriftfamilie

source: Base family
de: Grundschriftfamilie

source: Choose a font family to use for body text.
de: Wählen Sie eine Schriftfamilie für den Seiteninhalt.

source: Use same family for all text
de: Dieselbe Schriftfamilie für sämtlichen Text verwenden

source: If you enable this, then the same font family will be used for all text, regardless of the settings on the page you are viewing. This is useful for pages which have used a decorative or hard to read font for headlines.
de: Wenn Sie diese Option markieren, wird für alle Texte dieselbe Schriftfamilie verwendet, egal wie die Einstellungen der betrachteten Internetseite sind. Das ist nützlich für Seiten, die eine dekorative oder schwer lesbare Schrift für Überschriften verwenden.

source: Font Size
de: Schriftgröße

source: Base font size
de: Größe der Grundschrift

source: This is the default size for text on the page. Many web sites set their font sizes relative to this default, using <quote>larger</quote> or <quote>+1</quote> to make the text bigger, and <quote>smaller</quote> or <quote>-1</quote> to make the text smaller.
de: Dies ist die Standardschriftgröße auf der Internetseite. Viele Seiten verändern die Schriftgröße relativ zur Standardgröße, indem sie <quote>größer</quote> oder <quote>+1</quote> für größeren Text und <quote>kleiner</quote> oder <quote>-1</quote> für kleineren Text verwenden.

source: Many people design their web pages on platforms where the ordinary default text size is too large for the average user to read, so it is very common to come across web pages that have forced the font smaller in this way.
de: Viele Leute entwerfen Internetseiten auf Computern, deren Standardschriftgröße für die meisten Benutzer zu groß zum Lesen ist. Es ist daher übliche Praxis mit solchen Befehlen bei Internetseiten die Schrift kleiner zu machen.

source: This setting will allow you to set the default font to a comfortable size, so that the relative sizes are also enlarged enough to be comfortable.
de: Diese Einstellung erlaubt die Einstellung einer bequemen Standardschriftgröße, sodass die relativen Größen ebenfalls angepasst und daher auch bequem zu lesen sind.

source: Do not forget you can also have &konqueror; enforce a minimum size, so that text is <emphasis>never</emphasis> too small to read.
de: Zusätzlich können Sie für &konqueror; eine minimale Schriftgröße einstellen, die <emphasis>niemals</emphasis> unterschritten wird.

source: Use same size for all elements
de: Dieselbe Schriftgröße für alle Elemente verwenden

source: If you enable this option, then all text will be rendered at your specified font size, regardless of the instructions the page contains. Relative font sizes as discussed earlier, and even specific instructions that text should be rendered at a certain size will be overridden here.
de: Wenn Sie diese Option markieren, wird der gesamte Text der Internetseite in derselben Schriftgröße angezeigt. Damit werden sowohl relative Schriftgrößen als auch spezifische Anweisungen, einen bestimmten Text in einer festen Schriftgröße anzuzeigen, wirkungslos.

source: Images
de: Bilder

source: Suppress images
de: Bilder ausblenden

source: If you do not want to view images, you can turn this off here.
de: Wenn keine Bilder angezeigt werden sollen, können Sie diese Option abwählen.

source: Suppress background images
de: Hintergrundbilder ausblenden

source: One major problem for reduced vision users is that background images do not give sufficient contrast to allow them to read the text. You can disable background images here, independently of your choice above to view all images.
de: Ein großes Problem für Sehbehinderte ist, dass Hintergrundbilder von Internetseiten die Lesbarkeit des davor platzierten Textes erschweren. Unabhängig von der Anzeige von Bildern können Sie hier Hintergrundbilder gezielt abschalten.

source: Colors
de: Farben

source: Black on white
de: Schwarz auf Weiß

source: Many people with reduced vision find black text on a white screen gives the most contrast, and is easiest to read. If this applies to you, you can set this here.
de: Viele Sehbehinderte empfinden schwarzen Text auf einem weißen Bildschirm am angenehmsten zum Lesen. Wenn das auf Sie zutrifft, können Sie es hier einstellen.

source: White on black
de: Weiß auf Schwarz

source: Many other people with reduced vision find the opposite to be true, that white text on a black screen is easier to read.
de: Viele andere Sehbehinderte finden im Gegensatz dazu, dass weißer Text auf schwarzem Hintergrund lesbarer ist.

source: Custom
de: Benutzerdefiniert

source: Still other people find that pure black and white, in either order, is difficult to read. You can set custom colors here for both the <guilabel>Background</guilabel> and the <guilabel>Foreground</guilabel>.
de: Wieder andere Leute empfinden Text mit nur schwarz oder weiß schwer lesbar. Mit dieser Option kann man eigene Farben für <guilabel>Vordergrundfarbe</guilabel> und <guilabel>Hintergrundfarbe</guilabel> festlegen.

source: Use same color for all text
de: Dieselbe Farbe für sämtlichen Text verwenden

source: Many web sites use a different, often contrasting color for headings or other flourishes. If this interferes with your ability to read the content, you can enable this check box to have &kde; use the colors you have set above for all text.
de: Viele Internetseiten verwenden unterschiedliche und kontrastreiche Farben für Überschriften und anderes schmückendes Beiwerk. Wenn man das als störend empfindet, kann man durch Markieren dieses Ankreuzfeldes &kde; dazu veranlassen, die festgelegte Textfarbe für alle angezeigten Texte zu verwenden.

source: Preview
de: Vorschau

source: The <guilabel>Preview</guilabel> section allows you to see the effect of your changes. Several types of headings are displayed with your stylesheet, and a sentence in the default body text.
de: Der Bereich <guilabel>Vorschau</guilabel> ermöglicht es, die Auswirkungen der Einstellungen zu begutachten. Die Vorschau zeigt verschiedene Typen von Überschriften und einen Satz in der normalen Schriftgröße.

source: This should allow you to fine-tune your stylesheet until you have something that you can comfortably read.
de: Damit kann man die Einstellungen überprüfen und solange verändern, bis man eine Einstellung gefunden hat, die bequem lesbaren Text anzeigt.

source: Happy surfing!
de: Frohes Surfen!
