Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kde-runtime/kcontrol_history.po
Languages: de

source: History Sidebar
de: Verlaufsbereich

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Burkhard</firstname><surname>Lück</surname><affiliation><address><email>lueck@hube-lueck.de</email></address></affiliation><contrib>Übersetzung</contrib></othercredit>

source: Systemsettings
de: Systemeinstellungen

source: history
de: Verlauf

source: This dialog allows you to configure the history sidebar.
de: In diesem Modul kann die Verlaufsanzeige im Navigationsbereich eingerichtet werden.

source: Limits
de: Beschränkungen

source: The options in this section can be used to set the maximum size of your history and set a time after which items are automatically removed.
de: Hier können Sie die maximale Größe Ihres Verlaufsspeichers einstellen und die Zeit bestimmen, nach der Einträge automatisch entfernt werden.

source: Custom Font
de: Benutzerdefinierte Schriften

source: Here you can also set different fonts for new and old &URL;s by selecting the <guibutton>Choose Font</guibutton> button.
de: Sie können mit dem Knopf <guibutton>Schriftart auswählen ...</guibutton> auch unterschiedliche Schriften für neue und alte &URL;s festlegen.

source: The <guilabel>Detailed tooltips</guilabel> check box controls how much information is displayed when you hover the mouse pointer over an item in the history page.
de: Mit dem Ankreuzfeld <guilabel>Detaillierte Kurzinfos</guilabel> können Sie festlegen, wieviel Informationen Sie angezeigt bekommen, wenn Sie sich mit der Maus über einen Eintrag auf der Verlaufsseite bewegen.

source: If checked the number of times visited and the dates of the first and last visits are shown, in addition to the URL.
de: Ist diese Einstellung aktiv, wird außer der Adresse (URL) auch die Häufigkeit der Aufrufe und das Datum des ersten und letzten Aufrufs angezeigt.

source: Selecting <guibutton>Clear History</guibutton> will clear out the entire history.
de: Die Auswahl von <guibutton>Verlaufsspeicher leeren</guibutton> löscht alle Einträge.
