Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kde-runtime/kcontrol_cache.po
Languages: de

source: <title>Cache</title>
de: <title>Zwischenspeicher</title>

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Marco</firstname><surname>Wegner</surname><affiliation><address><email>mail@marcowegner.de</email></address></affiliation><contrib>Deutsche Übersetzung</contrib></othercredit>

source: Systemsettings
de: Systemeinstellungen

source: <keyword>Cache</keyword>
de: <keyword>Zwischenspeicher</keyword>

source: This module allows you to control the size of the local cache folder used by &konqueror;. Note that each user account on your computer has a separate cache folder, and this folder is not shared with other web browsers such as &Netscape;.
de: Über dieses Modul können Sie die Größe des von &konqueror; verwendeten lokalen Zwischenspeichers kontrollieren. Hinweis: Jeder Benutzer des Rechners hat seinen eigenen Zwischenspeicherordner, und dieser Ordner kann nicht mit anderen Internet-Browsern wie &Netscape; gemeinsam genutzt werden.

source: Storing local copies of web pages that you have visited allows &konqueror; to quickly load their contents on subsequent visits. It will only be necessary to reload the contents from the original site if they have changed since your last visit, or if you click the reload button in &konqueror;.
de: Die lokale Zwischenspeicherung von Internetseiten erlaubt &konqueror; bei weiteren Besuchen dieser Seite die Inhalte schnell zu laden. Dabei werden nur die Inhalte aus dem Internet geladen, die sich seit dem letzten Besuch verändert haben. Ein Klick auf den Knopf <guiicon>Dokument neu laden</guiicon> lädt das gesamte Dokument neu aus dem Internet.

source: If you really do not want any of the web pages you visit to be stored on your computer, you can disable &konqueror;'s disk cache by clearing the checkbox labeled <guilabel>Use cache</guilabel>.
de: Falls Sie nicht möchten, dass die Internetseiten, die Sie besucht haben, auf Ihrem Rechner gespeichert werden, dann können Sie den Zwischenspeicher von &konqueror; abschalten, indem Sie das Ankreuzfeld <guilabel>Zwischenspeicher verwenden</guilabel> deaktivieren.

source: You can set here how aggressively &konqueror; keeps the cache up to date. <guilabel>Keep cache in sync</guilabel> means that &konqueror; will hit the cache for all objects, downloading them if they are not there, and then display the item from the cache. <guilabel>Use cache whenever possible</guilabel> means that &konqueror; will try the cache, and if an object is not there, it will directly download it for display. <guilabel>Offline browsing mode</guilabel> means that &konqueror; will try the cache, and if an object is not there, it will not attempt to download it from the Internet.
de: Hier kann festgelegt werden, wie sorgfältig &konqueror; den Zwischenspeicher aktualisiert. <guilabel>Zwischenspeicher aktuell halten</guilabel> bedeutet, dass &konqueror; versucht alle Objekte aus dem Zwischenspeicher zu laden. Falls sie noch nicht vorhanden sind, werden Sie heruntergeladen, worauf dann die die lokale Kopie angezeigt wird. <guilabel>Zwischenspeicher verwenden, wenn möglich</guilabel> bedeutet, dass &konqueror; versuchen wird, das Objekt aus dem Zwischenspeicher zu laden. Wenn es dort nicht vorhanden ist, wird es aus dem Internet geladen und direkt angezeigt. Im <guilabel>Offline-Browsing-Modus</guilabel> zeigt &konqueror; nur Objekt an, die sich im Zwischenspeicher befinden. Es wird nicht versucht, fehlende Objekte aus dem Internet zu laden.

source: You can control the size of the cache by typing a number into the text box labeled <guilabel>Disk cache size</guilabel>. This is the average amount of space in kilobytes that the cache folder is allowed to use. When the cache grows too large, &konqueror; will delete older files to reduce the size of the cache folder.
de: Die durchschnittliche Größe des Zwischenspeichers kann über den Wert im Eingabefeld <guilabel>Zwischenspeicher auf Festplatte</guilabel> kontrolliert werden. Es handelt sich um eine durchschnittliche Größe in KByte. Wenn die Größe des Zwischenspeichers die angegebene Zahl überschreitet, beginnt &konqueror; damit, die ältesten Dateien aus dem Zwischenspeicher zu löschen.

source: This is however, only an average, and during a browsing session the cache could become substantially larger.
de: Während einer längeren Suche im Internet kann dieser Durchschnittswert erheblich überschritten werden.

source: You can use the <guibutton>Clear Cache</guibutton> button to empty the cache at any time.
de: Mit dem Knopf <guibutton>Zwischenspeicher leeren</guibutton> kann jederzeit der Zwischenspeicherinhalt gelöscht werden.
