Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kde-runtime/kdebugdialog.po
Languages: de

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Stephan</firstname><surname>Kulow</surname><affiliation><address><email>coolo@kde.org</email></address></affiliation><contrib>Deutsche Übersetzung</contrib></othercredit> <othercredit role="translator"><firstname>Marco</firstname><surname>Wegner</surname><affiliation><address><email>mail@marcowegner.de</email></address></affiliation><contrib>Deutsche Übersetzung</contrib></othercredit>

source: Debug
de: Debuggen

source: &kdebugdialog; is a dialog box for managing diagnostic messages at runtime. It features a simple and a full mode.
de: &kdebugdialog; ist ein Programm, um Diagnose-Nachrichten zur Laufzeit einzustellen. Das Programm kann im einfachen und im erweiterten Modus ausgeführt werden.

source: In order to be able to make changes <guilabel>Disable all debug output</guilabel> has to be unchecked.
de: Um Einstellungen ändern zu können, muss <guilabel>Sämtliche Debug-Ausgaben deaktivieren</guilabel> abgewählt werden.

source: Simple mode
de: Einfacher Modus

source: If you simply start <command>kdebugdialog</command>, you will see a list of <quote>areas</quote>, that can be disabled or enabled. A <function>kDebug(area)</function> call in the code will show something in the debug output only if the area is enabled.
de: Wenn Sie <command>kdebugdialog</command> aufrufen, erscheint eine Liste von <quote>Bereichen</quote>, die entweder ein- oder ausgeschaltet werden können. Ein Aufruf von <function>kDebug(Bereich)</function> im Quelltext führt zu einer Debug-Ausgabe des Programms, wenn der betreffende Bereich eingeschaltet wurde.

source: Note that kWarning, kError and kFatal always appear, they are <emphasis>NOT</emphasis> controlled by this setting.
de: Beachten Sie, dass Aufrufe von kWarning, kError und kFatal immer zu einer Ausgabe führen, sie können <emphasis>nicht</emphasis> über diese Einstellungen kontrolliert werden.

source: Enter a matching string into the <guilabel>Search</guilabel> box at the top of the list, this allows you to filter the areas which are displayed in the list view. Use the buttons below the list to select or deselect all items in the view (the other areas are not effected) or change the debug output for a single item using the check box in front of it.
de: Geben Sie einen passenden Text in das Feld <guilabel>Suchen</guilabel> über der Listenansicht ein, damit können Bereiche zur Anzeige in der Liste gefiltert werden. Mit den beiden Knöpfen unterhalb der Liste können alle angezeigten Einträge aus- oder abgewählt werden, die Einstellung nicht angezeigter Einträge wird dadurch nicht beeinflusst. Um die Debug-Ausgabe einzelner Einträge zu ändern, benutzen Sie das Ankreuzfeld vor dem Eintrag.

source: Full mode
de: Erweiterter Modus

source: If you start <command>kdebugdialog</command> <option>--fullmode</option>, then for every severity level you can define separately what should be done with the diagnostic messages of that level, and the same for each debug area.
de: Rufen Sie <command>kdebugdialog</command> mit der Option <option>--fullmode</option> auf, können Sie für jeden Schweregrad festlegen, was mit den Debug-Ausgabe dieser Stufe passieren soll. Dies können Sie natürlich für jeden Bereich einstellen.

source: In full mode, first you should select the debug area you are interested in from the list at the left of the dialog using the search box at the top of the list.
de: Im erweiterten Modus wählen Sie zunächst in der Liste links im Dialog mithilfe des Suchfelds über der Liste den Bereich aus, der für Sie interessant ist.

source: You may independently set the output for various types of messages:
de: Sie können die Ausgabe für verschiedene Meldungstypen festlegen:

source: Warning
de: Warnung

source: Error
de: Fehler

source: Fatal Error
de: Fataler Fehler

source: For each of these types, you can set the following:
de: Für jeden Typ können Sie die folgenden Einstellungen vornehmen:

source: Output to:
de: Ausgabe nach:

source: In this Combobox, you can choose where the messages should be output. The choices are: <quote>File</quote>, <quote>Message Box</quote>, <quote>Shell</quote> (meaning stderr) and <quote>Syslog</quote>. Please do not direct fatal messages to syslog unless you are the system administrator yourself. The default is <quote>Shell</quote>.
de: In diesem Kombinationsfeld können Sie auswählen, wohin die Meldungen geschrieben werden sollen. Die Möglichkeiten sind: <quote>Datei</quote>, <quote>Nachrichten-Fenster</quote>, <quote>Shell</quote> (bedeutet hier stderr) und <quote>Systemprotokoll</quote>. Bitte leiten Sie Meldungen über fatale Fehler nicht in das Systemprotokoll um, wenn Sie nicht der Systemadministrator sind. Die Voreinstellung ist <quote>Shell</quote>.

source: Filename:
de: Dateiname:

source: This is only enabled when you have chosen <quote>File</quote> as the output and provides the name of that file (which is interpreted as relative to the current folder). The default is <filename>kdebug.dbg</filename>.
de: Dateiname: Dieser ist nur von Bedeutung, wenn als Ausgabe <quote>Datei</quote> gewählt wurde. Die Eingabe hier wird relativ zum aktuellen Ordner interpretiert. Die Vorgabe ist <filename>kdebug.dbg</filename>.

source: Apart from this, you can also tick the check box <guilabel>Abort on fatal errors</guilabel>. In this case, if a diagnostic message with the severity level <computeroutput>KDEBUG_FATAL</computeroutput> is output, the application aborts with a SIGABRT after outputting the message.
de: Abgesehen davon können Sie auch das Feld <guilabel>Bei fatalen Fehlern abbrechen</guilabel> ankreuzen. In diesem Fall bricht die Anwendung mit dem Signal SIGABRT ab, nachdem eine Meldung mit dem Schweregrad <computeroutput>KDEBUG_FATAL</computeroutput> ausgegeben wurde.

source: When you close the dialog by pressing <guibutton>OK</guibutton>, your entries apply immediately and are saved in <filename>$<envar>KDEHOME</envar>/share/config/kdebugrc</filename>. When you press <guibutton>Cancel</guibutton>, your entries are discarded and the old ones are restored.
de: Beenden Sie das Dialogfenster durch Anklicken von <guibutton>OK</guibutton>, werden Ihre Änderungen sofort wirksam und in der Datei <filename>$<envar>KDEHOME</envar>/share/config/kdebugrc</filename> gespeichert. Klicken Sie auf <guibutton>Abbrechen</guibutton>, werden Ihre Änderungen vollständig verworfen und die ursprünglichen Einstellungen wiederhergestellt.

source: Credits to Kalle Dalheimer for the original version of &kdebugdialog;
de: Dank geht an Kalle Dalheimer für die Orginalversion von &kdebugdialog;

source: CREDIT_FOR_TRANSLATORS
de: <para>Übersetzung Stephan Kulow<email>coolo@kde.org</email></para><para>Marco Wegner<email>mail@marcowegner.de</email> </para>
