Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kde-runtime/kdesu.po
Languages: de

source: The &kdesu; handbook
de: Das Handbuch zu &kdesu;

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Philipp</firstname><surname>Siegert</surname><affiliation><address><email>siegert@pp-services.de</email></address></affiliation><contrib>Übersetzung</contrib></othercredit>

source: &kdesu; is a graphical front end for the &UNIX; <command>su</command> command.
de: &kdesu; ist eine grafische Oberfläche für den &UNIX;-Befehl <command>su</command>.

source: password
de: Passwort

source: root
de: Systemverwalter

source: Introduction
de: Einleitung

source: Welcome to &kdesu;! &kdesu; is a graphical front end for the &UNIX; <command>su</command> command for the K Desktop Environment. It allows you to run a program as different user by supplying the password for that user. &kdesu; is an unprivileged program; it uses the system's <command>su</command>.
de: Willkommen bei &kdesu;! &kdesu; ist eine grafische Oberfläche für den &UNIX;-Befehl <command>su</command> in KDE. Es ermöglicht Ihnen, ein Programm mit einer anderen Benutzerkennung auszuführen, indem Sie das Passwort dieses Benutzers angeben. &kdesu; hat keine speziellen Systemrechte; es benutzt den Befehl <command>su</command>.

source: &kdesu; has one additional feature: it can remember passwords for you. If you are using this feature, you only need to enter the password once for each command. See <xref linkend="sec-password-keeping"/> for more information on this and a security analysis.
de: &kdesu; hat eine zusätzliche Funktion: Es kann Passwörter speichern. Wenn Sie diese Funktion benutzen, müssen Sie das Passwort für jeden Befehl nur einmal eingeben. Weitere Informationen und eine Sicherheitsanalyse finden Sie unter <xref linkend="sec-password-keeping"/>.

source: This program is meant to be started from the command line or from <filename>.desktop</filename> files. Although it asks for the <systemitem class="username">root</systemitem> password using a &GUI; dialog, I consider it to be more of a command line &lt;-&gt; &GUI; glue instead of a pure &GUI; program.
de: Dieses Programm sollte von der Befehlszeile oder durch <filename>.desktop</filename>-Dateien gestartet werden. Obwohl es über einen Dialog nach dem Passwort des Systemverwalters (<systemitem class="username">root</systemitem>) fragt, ist es trotzdem eher ein Befehlszeilen- als ein reines &GUI;-Programm.

source: Since <command>kdesu</command> is no longer installed in <userinput> $(kde4-config --prefix)</userinput>/bin but in <userinput>kde4-config --path libexec</userinput> and therefore not in your <envar>Path</envar>, you have to use <userinput>$(kde4-config --path libexec)<command>kdesu</command></userinput> to launch <command>kdesu</command>.
de: <command>kdesu</command> wird nicht mehr in <userinput> $(kde4-config --prefix)</userinput>/bin, sondern in <userinput>kde4-config --path libexec</userinput> installiert. Daher ist es nicht mehr in Ihrem <envar>Pfad</envar>. Verwenden Sie deshalb <userinput>$(kde4-config --path libexec)<command>kdesu</command></userinput>, um <command>kdesu</command> aufzurufen.

source: Using &kdesu;
de: &kdesu; benutzen

source: Usage of &kdesu; is easy. The syntax is like this:
de: Die Benutzung von &kdesu; ist einfach. Der Syntax ist folgendermaßen:

source: <command>kdesu</command> <arg choice="opt">&kde; Generic Options</arg> <arg choice="opt">&Qt; Generic Options</arg>
de: <command>kdesu</command> <arg choice="opt">Allgemeine Einstellungen für &kde;</arg> <arg choice="opt">Allgemeine Einstellungen zu &Qt;</arg>

source: The command line options are explained below.
de: Die Befehlszeilen-Parameter sind weiter unten erklärt.

source: This specifies the command to run as root. It has to be passed in one argument. So if, for example, you want to start a new file manager, you would enter at the prompt: <userinput>$(kde4-config --path libexec)<command>kdesu <option>-c <replaceable> &dolphin;</replaceable></option></command></userinput>
de: Dies gibt den Befehl an, der als Benutzer root ausgeführt werden soll. Er muss als Parameter übergeben werden. Wenn Sie beispielsweise einen neuen Dateimanager starten wollen, geben Sie auf der Befehlzeile Folgendes ein: <userinput>$(kde4-config --path libexec)<command>kdesu <option>-c <replaceable> &dolphin;</replaceable></option></command></userinput>

source: Show debug information.
de: Debug-Informationen anzeigen. (<emphasis>Anmerkung des Übersetzers: Diese Option funktioniert nicht mit der in &kde; 3.0 enthaltenen Version von &kdesu;.</emphasis>)

source: -f <replaceable>file</replaceable>
de: -f <replaceable>Datei</replaceable>

source: This option allow efficient use of &kdesu; in <filename>.desktop</filename> files. It tells &kdesu; to examine the file specified by <parameter>file</parameter>. If this file is writable by the current user, &kdesu; will execute the command as the current user. If it is not writable, the command is executed as user <parameter>user</parameter> (defaults to root).
de: Dieser Parameter erlaubt den effizienten Einsatz von &kdesu; bei <filename>.desktop</filename> Dateien. Er weist &kdesu; an, die Datei, die mit <parameter>Datei</parameter> angegeben wurde, zu untersuchen. Besitzt der aktuelle Benutzer Schreibrechte auf die Datei, wird die Datei unter seinem Namen ausgeführt. Besitzt er keine Schreibrechte, wird die Datei unter dem Benutzernamen <parameter>Benutzer</parameter> (Voreinstellung: Systemverwalter) ausgeführt.

source: <parameter>file</parameter> is evaluated like this: if <parameter>file</parameter> starts with a <literal>/</literal>, it is taken as an absolute filename. Otherwise, it is taken as the name of a global &kde; configuration file.
de: <parameter>Datei</parameter> wird folgendermaßen ausgewertet: Wenn <parameter>Datei</parameter> mit <literal>/</literal> beginnt, wird es als absoluter Dateiname behandelt. Anderenfalls wird es als Name einer globalen &kde;-Konfigurationsdatei behandelt.

source: <option>-i</option> <replaceable>icon name</replaceable>
de: <option>-i</option> <replaceable>Symbolname</replaceable>

source: Specify icon to use in the password dialog. You may specify just the name, without any extension.
de: Legt fest, welches Symbol im Passwortdialog verwendet wird. Sie können einfach nur den Namen ohne Erweiterung eingeben.

source: For instance to run &konqueror; in filemanager mode and show the &konqueror; icon in the password dialog:
de: Um zum Beispiel &konqueror; im Dateimanager-Modus mit dem &konqueror;-Symbol im Passwortdialog zu starten, geben Sie dies ein:

source: Do not keep the password. This disables the <guilabel>keep password</guilabel> checkbox in the password dialog.
de: Das Passwort nicht speichern. Dieser Parameter schaltet das Ankreuzfeld <guilabel>Passwort beibehalten</guilabel> im Passwort-Dialog aus.

source: <option>-p</option> <replaceable>priority</replaceable>
de: <option>-p</option> <replaceable>Priorität</replaceable>

source: Set priority value. The priority is an arbitrary number between 0 and 100, where 100 means highest priority, and 0 means lowest. The default is 50.
de: Stellt die Priorität ein. Dies ist eine Nummer zwischen 0 und 100, wobei 100 für die höchste und 0 für die niedrigste Priorität steht. Die Voreinstellung ist 50.

source: Use realtime scheduling.
de: Aktiviert die Echtzeit-Ausführung.

source: Stop the kdesu daemon. See <xref linkend="sec-password-keeping"/>.
de: Den kdesu-Dämon anhalten. Weitere Details finden Sie unter <xref linkend="sec-password-keeping"/>.

source: Enable terminal output. This disables password keeping. This is largely for debugging purposes; if you want to run a console mode app, use the standard <command>su</command> instead.
de: Terminal-Ausgabe einschalten. Dieser Parameter schaltet das Speichern von Passwörtern aus. Dies ist hauptsächlich für Debugging-Zwecke interessant. Wenn Sie eine Anwendung benutzen wollen, die im Konsolen-Modus läuft, sollten Sie stattdessen den Standardbefehl <command>su</command> verwenden.

source: <option>-u</option> <replaceable> user</replaceable>
de: <option>-u</option> <replaceable> Benutzer</replaceable>

source: While the most common use for &kdesu; is to run a command as the superuser, you can supply any user name and the appropriate password.
de: Die häufigste Verwendung von &kdesu; ist, ein Programm als Systemverwalter auszuführen. Sie können aber auch einen anderen Benutzernamen und Passwort übergeben.

source: Internals
de: Interne Funktionsweise

source: X authentication
de: X-Authentifizierung

source: The program you execute will run under the root user id and will generally have no authority to access your X display. &kdesu; gets around this by adding an authentication cookie for your display to a temporary <filename>.Xauthority</filename> file. After the command exits, this file is removed.
de: Das Programm, das Sie aufrufen, wird unter der Benutzer-Kennung (User ID) des Systemverwalters ausgeführt und hat grundsätzlich keinen Zugriff auf Ihre X-Anzeige. &kdesu; umgeht dies, indem es Ihrer Anzeige ein Cookie zur Authentifizierung hinzufügt. Dazu wird eine zeitlich befristete <filename>.Xauthority</filename>-Datei angelegt. Nach Beendigung des Befehls wird die Datei wieder gelöscht.

source: If you don't use X cookies, you are on your own. &kdesu; will detect this and will not add a cookie but you will have to make sure that root is allowed to access to your display.
de: Wenn Sie keine X-Cookies benutzen, sind Sie auf sich alleine gestellt. &kdesu; wird dies erkennen und kein Cookie hinzufügen. Sie müssen sich vergewissern, dass der Systemverwalter berechtigt ist, auf die Anzeige zuzugreifen.

source: Interface to <command>su</command>
de: Schnittstelle zu <command>su</command>

source: &kdesu; uses the sytem's <command>su</command> for acquiring priviliges. In this section, I explain the details of how &kdesu; does this.
de: &kdesu; benutzt den Systembefehl <command>su</command>, um Rechte zu erhalten. In diesem Abschnitt wird erklärt, wie &kdesu; dabei vorgeht.

source: Because some <command>su</command> implementations (&ie; the one from &RedHat;) don't want to read the password from <literal>stdin</literal>, &kdesu; creates a pty/tty pair and executes <command>su</command> with its standard filedescriptors connected to the tty.
de: Da manche Implementierungen von <command>su</command> (&eg; die von &RedHat;) keine Passwörter von <literal>stdin</literal> lesen, erstellt &kdesu; ein pty/tty-Paar und führt <command>su</command> so aus, dass die Standard-Dateideskriptoren mit dem tty verbunden sind.

source: To execute the command the user selected, rather than an interactive shell, &kdesu; uses the <option>-c</option> argument with <command>su</command>. This argument is understood by every shell that I know of so it should work portably. <command>su</command> passes this <option>-c</option> argument to the target user's shell, and the shell executes the program. Example command: <command>su <option>root -c <replaceable>the_program</replaceable></option></command>.
de: Um anstelle einer interaktiven Shell einen vom Benutzer angegebenen Befehl auszuführen, benutzt &kdesu; den Befehl <command>su</command> mit dem Parameter <option>-c</option>. Dieser Parameter wird von jeder bekannten Shell verstanden, sodass er portabel einsetzbar sein sollte. <command>su</command> übergibt den Parameter <option>-c</option> an die Shell des Benutzers, unter dessen ID der Befehl ausgeführt werden soll. Diese Shell führt dann das Programm aus. Beispiel: <command>su <option>root -c <replaceable>das_programm</replaceable></option></command>.

source: Instead of executing the user command directly with <command>su</command>, &kdesu; executes a little stub program called <application>kdesu_stub</application>. This stub (running as the target user), requests some information from &kdesu; over the pty/tty channel (the stub's stdin and stdout) and then executes the user's program. The information passed over is: the X display, an X authentication cookie (if available), the <envar>PATH</envar> and the command to run. The reason why a stub program is used is that the X cookie is private information and therefore cannot be passed on the command line.
de: Statt den Befehl des Benutzers direkt mit <command>su</command> auszuführen, führt &kdesu; das Hilfsprogramm <application>kdesu_stub</application> aus. Dieses Hilfsprogramm, das unter der ID des Zielbenutzers läuft, fordert über den pty/tty-Kanal (stdin und stdout des Hilfsprogramms) einige Informationen von &kdesu; an. Danach wird das Programm des Benutzers ausgeführt. Folgende Informationen werden übergeben: die X-Anzeige, ein X-Authentifizierungs-Cookie (wenn verfügbar), die Variable <envar>PATH</envar> und der auszuführende Befehl. Der Grund für die Benutzung eines Hilfsprogramms ist der X-Cookie. Dieser beinhaltet sensible Informationen und kann deshalb nicht auf der Befehlszeile übergeben werden.

source: Password Checking
de: Passwort-Überprüfung

source: &kdesu; will check the password you entered and gives an error message if it is not correct. The checking is done by executing a test program: <filename>/bin/true</filename>. If this succeeds, the password is assumed to be correct.
de: &kdesu; überprüft die Passwörter, die Sie eingeben und gibt bei Falscheingabe eine Fehlermeldung zurück. Die Überprüfung erfolgt durch ein Testprogramm (<filename>/bin/true</filename>). Wenn die Ausführung dieses Programms erfolgreich ist, wird angenommen, dass das Passwort richtig ist.

source: Password Keeping
de: Passwörter speichern

source: For your comfort, &kdesu; implements a <quote>keep password</quote> feature. If you are interested in security, you should read this paragraph.
de: Um es Ihnen so einfach wie möglich zu machen, enthält &kdesu; eine Funktion <quote>Passwort beibehalten</quote>. Falls Sie sich für die Sicherheit dieser Funktion interessieren, sollten Sie diesen Absatz lesen.

source: Allowing &kdesu; to remember passwords opens up a (small) security hole in your system. Obviously, &kdesu; does not allow anybody but your user id to use the passwords, but, if done without caution, this would lowers <systemitem class="username">root</systemitem>'s security level to that of a normal user (you). A hacker who breaks into your account, would get <systemitem class="username">root</systemitem> access. &kdesu; tries to prevent this. The security scheme it uses is, in my opinion at least, reasonably safe and is explained here.
de: Indem Sie &kdesu; erlauben, die Passwörter zu speichern, entsteht eine (kleine) Sicherheitslücke in Ihrem System. &kdesu; erlaubt offensichtlich nur Ihrer User-ID die Verwendung der Passwörter. Wenn Sie allerdings nicht aufpassen, kann hierdurch die Sicherheitsstufe des Systemverwalters (<systemitem class="username">root</systemitem>) auf die eines normalen Benutzers (Ihre Benutzer-ID) herabgesetzt werden. Ein Hacker, der versucht, in Ihren Zugang einzubrechen, würde dann Zugang zu den Funktionen von <systemitem class="username">root</systemitem> erhalten. &kdesu; versucht dies zu verhindern. Das Sicherheitskonzept, das benutzt wird, ist angemessen sicher, zumindest nach bestem Wissen des Autors. Das Konzept wird hier weiter erklärt.

source: &kdesu; uses a daemon, called <application>kdesud</application>. The daemon listens to a &UNIX; socket in <filename>/tmp</filename> for commands. The mode of the socket is 0600 so that only your user id can connect to it. If password keeping is enabled, &kdesu; executes commands through this daemon. It writes the command and <systemitem class="username">root</systemitem>'s password to the socket and the daemon executes the command using <command>su</command>, as describe before. After this, the command and the password are not thrown away. Instead, they are kept for a specified amount of time. This is the timeout value from in the control module. If another request for the same command is coming within this time period, the client does not have to supply the password. To keep hackers who broke into your account from stealing passwords from the daemon (for example, by attaching a debugger), the daemon is installed set-group-id nogroup. This should prevent all normal users (including you) from getting passwords from the <application>kdesud</application> process. Also, the daemon sets the <envar>DISPLAY</envar> environment variable to the value it had when it was started. The only thing a hacker can do is execute an application on your display.
de: &kdesu; benutzt den Dämon <application>kdesud</application>. Der Dämon nimmt auf einem &UNIX;-Socket in <filename>/tmp</filename> Befehle entgegen. Die Zugriffsrechte des Sockets sind auf 0600 eingestellt, sodass nur Ihre Benutzer-ID Verbindungen zu dem Socket aufbauen kann. Wurde <quote>Passwort beibehalten</quote> aktiviert, führt &kdesu; Befehle durch diesen Dämon aus. &kdesu; schreibt dann den Befehl und das Passwort des Systemverwalters auf den Socket. Der Dämon führt daraufhin, wie oben beschrieben, mit Hilfe von <command>su</command> den Befehl aus. Danach werden Befehl und Passwort nicht gelöscht, sondern für eine bestimmte Zeit zwischengespeichert. Diese Zeit wird dem Kontrollmodul entnommen. Erfolgt innerhalb dieser Zeitspanne eine andere Anfrage für den Befehl, muss der Benutzer das Passwort nicht erneut eingeben. Um zu verhindern, dass Hacker, die in Ihren Zugang eingedrungen sind, Passwörter stehlen, wird der Dämon mit den Parametern <quote>set-group-id nogroup</quote> eingerichtet. Dies sollte alle normalen Benutzer (Sie eingeschlossen) daran hindern, Passwörter von dem Prozess <application>kdesud</application> zu bekommen. Der Dämon setzt außerdem die Umgebungsvariable <envar>DISPLAY</envar> auf den Wert, den der Dämon hatte, als er gestartet wurde. Das Einzige, was ein Hacker demnach tun könnte, wäre Anwendungen auf Ihrer Anzeige auszuführen.

source: One weak spot in this scheme is that the programs you execute are probably not written with security in mind (like setuid <systemitem class="username">root</systemitem> programs). This means that they might have buffer overruns or other problems and a hacker could exploit those.
de: Ein Schwachpunkt in diesem Sicherheitskonzept ist die Tatsache, dass die auszuführenden Programme wahrscheinlich nicht nach Sicherheitsgesichtpunkten geschrieben wurden (&eg; setuid <systemitem class="username">root</systemitem> Programme). Dies bedeutet, dass in diesen Programme Puffer-Überläufe oder andere Probleme auftreten könnten, die ein Hacker ausnutzen könnte.

source: The use of the password keeping feature is a tradeoff between security and comfort. I encourage you to think it over and decide for yourself if you want to use it or not.
de: Die Benutzung der Funktion zum Speichern der Passwörter ist ein Kompromiss zwischen Sicherheitsansprüchen und Komfort. Überdenken Sie dies bitte und entscheiden Sie selbst ob Sie diese Funktion benutzen wollen oder nicht.

source: Author
de: Autor

source: &kdesu; is written by &Geert.Jansen;. It is somewhat based on Pietro Iglio's &kdesu;, version 0.3. Pietro and I agreed that I will maintain this program in the future.
de: &kdesu; wurde von &Geert.Jansen; geschrieben. Es basiert irgendwie auf Pietro Iglios &kdesu;, Version 0.3. Pietro und Geert Jansen sind übereingekommen, dass Geert Jansen das Programm in Zukunft pflegen wird.

source: The author can be reached through email at &Geert.Jansen.mail;. Please report any bugs you find to me so that I can fix them. If you have a suggestion, feel free to contact me.
de: Der Autor ist unter folgender Adresse zu erreichen: &Geert.Jansen.mail;. Bitte schicken Sie ihm alle Fehler die Sie finden, sodass er Sie entfernen kann. Wenn Sie Vorschläge zu diesem Programm haben, können Sie Geert Jansen gerne anschreiben.

source: CREDIT_FOR_TRANSLATORS
de: <para>Übersetzung Philipp Siegert<email>siegert@pp-services.de</email></para>
