Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kde-runtime/kdesu_man-kdesu.1.po
Languages: de

source: KDE User's Manual
de: KDE-Benutzerhandbuch

source: Runs a program with elevated privileges
de: Führt ein Programm mit erweiterten Rechten aus.

source: <command>kdesu</command> <arg choice="opt">KDE Generic Options</arg> <arg choice="opt">Qt Generic Options</arg>
de: <command>kdesu</command> <arg choice="opt">Allgemeine KDE-Optionen</arg> <arg choice="opt">Allgemeine Qt-Optionen</arg>

source: Description
de: Beschreibung

source: &kdesu; is a graphical front end for the &UNIX; <command>su</command> command for the K Desktop Environment. It allows you to run a program as different user by supplying the password for that user. &kdesu; is an unprivileged program; it uses the system's <command>su</command>.
de: &kdesu; ist die grafische Oberfläche von KDE für den &UNIX;-Befehl <command>su</command>. Sie können damit durch Eingabe des Passworts ein Programm unter einem anderen Benutzer laufen lassen. &kdesu; ist ein unprivilegiertes Programm, es verwendet das im System vorhandene <command>su</command>.

source: &kdesu; has one additional feature: it can optionally remember passwords for you. If you are using this feature, you only need to enter the password once for each command.
de: &kdesu; bietet eine zusätzliche Funktionalität: Es kann sich Passwörter merken. Wenn Sie diese Funktion benutzen, müssen Sie für jeden Befehl das Passwort nur einmal eingeben.

source: This program is meant to be started from the command line or from <filename>.desktop</filename> files.
de: Dieses Programm ist für den Start aus der Befehlszeile oder über <filename>.desktop</filename>-Dateien gedacht.

source: Since <command>kdesu</command> is no longer installed in <userinput> $(kde4-config --prefix)</userinput>/bin but in <userinput>kde4-config --path libexec</userinput> and therefore not in your <envar>Path</envar>, you have to use <userinput>$(kde4-config --path libexec)<command>kdesu</command></userinput> to launch <command>kdesu</command>.
de: <command>kdesu</command> wird nicht mehr in <userinput> $(kde4-config --prefix)</userinput>/bin, sondern in <userinput>kde4-config --path libexec</userinput> installiert. Daher ist es nicht mehr in Ihrem <envar>Pfad</envar>. Verwenden Sie deshalb <userinput>$(kde4-config --path libexec)<command>kdesu</command></userinput>, um <command>kdesu</command> aufzurufen.

source: Options
de: Parameter

source: This specifies the command to run as root. It has to be passed in one argument. So if, for example, you want to start a new file manager, you would enter at the prompt: <userinput>$(kde4-config --path libexec)<command>kdesu <option>-c <replaceable> &dolphin;</replaceable></option></command></userinput>
de: Dies gibt den Befehl an, der als Benutzer root ausgeführt werden soll. Er muss als Parameter übergeben werden. Wenn Sie beispielsweise einen neuen Dateimanager starten wollen, geben Sie auf der Befehlzeile Folgendes ein: <userinput>$(kde4-config --path libexec)<command>kdesu <option>-c <replaceable> &dolphin;</replaceable></option></command></userinput>

source: Show debug information.
de: Debug-Informationen anzeigen.

source: -f <replaceable>file</replaceable>
de: -f <replaceable>datei</replaceable>

source: This option allow efficient use of &kdesu; in <filename>.desktop</filename> files. It tells &kdesu; to examine the file specified by <parameter>file</parameter>. If this file is writable by the current user, &kdesu; will execute the command as the current user. If it is not writable, the command is executed as user <parameter>user</parameter> (defaults to root).
de: Dieser Parameter erlaubt die Verwendung von in &kdesu; in <filename>.desktop</filename>-Dateien. Hierüber wird &kdesu; mitgeteilt die durch <parameter>file</parameter> angegebene Datei zu untersuchen. Ist die Datei vom aktuellen Benutzer schreibbar, führt &kdesu; den Befehl als aktueller Benutzer aus. Ist die Datei nicht schreibbar, wird der Befehl als Benutzer <parameter>user</parameter> (Vorgabe ist hier root) ausgeführt.

source: <parameter>file</parameter> is evaluated like this: if <parameter>file</parameter> starts with a <literal>/</literal>, it is taken as an absolute filename. Otherwise, it is taken as the name of a global &kde; configuration file.
de: <parameter>file</parameter> wird wie folgt ausgewertet: wenn <parameter>file</parameter> mit einem <literal>/</literal> beginnt, wird er als absoluter Dateiname behandelt. Anderenfalls wird er als Name einer globalen Einrichtungsdatei von &kde; behandelt.

source: <option>-i</option> <replaceable>icon name</replaceable>
de: <option>-i</option> <replaceable>symbolname</replaceable>

source: Specify icon to use in the password dialog. You may specify just the name, without any extension.
de: Angabe des Symbols für den Passwort-Dialog. Sie können hier auch nur den Namen ohne Erweiterung angeben.

source: Do not keep the password. This disables the <guilabel>keep password</guilabel> checkbox in the password dialog.
de: Passwort nicht merken. Hierüber wird das Ankreuzfeld <guilabel>Passwort beibehalten</guilabel> deaktiviert.

source: <option>-p</option> <replaceable>priority</replaceable>
de: <option>-p</option> <replaceable>priorität</replaceable>

source: Set priority value. The priority is an arbitrary number between 0 and 100, where 100 means highest priority, and 0 means lowest. The default is 50.
de: Legt die Priorität fest. Diese kann eine beliebige Zahl zwischen 0 und 100 sein, wobei 100 die höchste Priorität ist und 0 die niedrigste. Die Voreinstellung ist 50.

source: Use realtime scheduling.
de: Echtzeit-Priorität verwenden.

source: Stop the kdesu daemon. This is the daemon that caches successful passwords in the background. This feature may also be disabled with <option>-n</option> when &kdesu; is initially run.
de: Hält den kdesu-Dienst an. Das ist der Dienst, der im Hintergrund die Passwörter vorhält. Diese Funktion kann auch beim ersten Start von &kdesu; über <option>-n</option> abgeschaltet werden.

source: Enable terminal output. This disables password keeping. This is largely for debugging purposes; if you want to run a console mode app, use the standard <command>su</command> instead.
de: Terminal-Ausgabe aktivieren. Hierdurch wird das Beibehalten der Passwörter ausgeschaltet. Dies dient hauptsächlich dem Debuggen. Wenn Sie eine Anwendung für die Konsole ausführen wollen, benutzen Sie stattdessen den Befehl <command>su</command>.

source: <option>-u</option> <replaceable> user</replaceable>
de: <option>-u</option> <replaceable> benutzer</replaceable>

source: While the most common use for &kdesu; is to run a command as the superuser, you can supply any user name and the appropriate password.
de: Obwohl &kdesu; meistens dazu verwendet wird einen Befehl als Systemverwalter auszuführen, können Sie jeden Benutzer mit dem entsprechenden Passwort angeben.

source: Do not display an ignore button.
de: Keinen Ignorieren-Knopf anzeigen.

source: Makes the dialog transient for an X app specified by winid.
de: Macht den Dialog temporär für das durch winid angegebene Fenster.

source: See Also
de: Siehe auch

source: More detailed user documentation is available from <ulink url="help:/kdesu">help:/kdesu</ulink> (either enter this <acronym>URL</acronym> into &konqueror;, or run <userinput><command>khelpcenter</command> <parameter>help:/kdesu</parameter></userinput>).
de: Eine ausführlichere Dokumentation finden Sie über <ulink url="help:/kdesu">help:/kdesu</ulink> (Geben Sie diese <acronym>URL</acronym> in die Adressleiste von &konqueror; ein oder rufen Sie <userinput><command>khelpcenter</command> <parameter>help:/kdesu</parameter></userinput> auf.)

source: Examples
de: Beispiele

source: Run <command>kfmclient</command> as user <systemitem class="username">jim</systemitem>, and show the &konqueror; icon in the password dialog:
de: Starte <command>kfmclient</command> als Benutzer <systemitem class="username">jim</systemitem>, und zeige das Symbole von &konqueror; im Passwortdialog:

source: Authors
de: Autoren

source: &kdesu; was written by <personname><firstname>Geert</firstname><surname>Jansen</surname></personname> <email>jansen@kde.org</email> and <personname><firstname>Pietro</firstname><surname>Iglio</surname></personname> <email>iglio@fub.it</email>.
de: &kdesu; wurde geschrieben von <personname><firstname>Geert</firstname><surname>Jansen</surname></personname> <email>jansen@kde.org</email> und <personname><firstname>Pietro</firstname><surname>Iglio</surname></personname> <email>iglio@fub.it</email>.
