Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kde-runtime/kioslave_man.po
Languages: de

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Marco</firstname><surname>Wegner</surname><affiliation><address><email>mail@marcowegner.de</email></address></affiliation><contrib>Übersetzer</contrib></othercredit>

source: Using the man ioslave you are able to read the man pages installed on your system. It is easy to use:
de: Das man-Modul erlaubt Ihnen, die Programm-Handbücher (<quote>man pages</quote>) zu lesen, die in Ihrem System installiert sind. Es ist einfach zu benutzen:

source: See the sections of the manual, click to find the rest.
de: Gibt einen Überblick über die Abschnitte in den Handbüchern. Es sind Verweise auf die Verzeichnisse.

source: See the man page of <command>fopen</command>.
de: Zeigt die Handbuchseite für <command>fopen</command> an.

source: See the man page of <command>fopen</command> in section 3.
de: Zeigt die Handbuchseite für <command>fopen</command> in Abschnitt 3 an.

source: See the index of section 3.
de: Dies zeigt den Index von Abschnitt 3 an.

source: See the introduction of section 3.
de: Dies zeigt die Einführung von Abschnitt 3 an.

source: If there are more than one man page of the name that you have entered, you will get a list where you can choose the man page that you want to see.
de: Wenn mehr als eine Handbuchseite mit dem gleichen Namen existiert, erhalten Sie eine Liste aus der Sie die gewünschte Handbuchseite auswählen können.

source: There is also a shortcut: <userinput><command>#fopen</command></userinput>, which has the same effect as above.
de: Es geht auch kürzer: <userinput><command>#fopen</command></userinput> zeigt ebenfalls das Handbuch für <command>fopen</command> an.

source: If you do not find all your man pages, adjust the configuration file <filename>/etc/manpath.config</filename> (or a file of a similar name depending on your distribution) or adjust the environment variables <envar>MANPATH</envar> and <envar>MANSECT</envar>.
de: Wenn nicht alle Handbücher gefunden werden, passen Sie die Konfigurationsdatei <filename>/etc/manpath.config</filename> an oder bearbeiten Sie die Umgebungsvariablen <envar>MANPATH</envar> und <envar>MANSECT</envar>.

source: As with any other &kde; ioslave, it is possible to enter a &URL;, like <userinput><command>man:/socket</command></userinput> in <emphasis>any</emphasis> &kde; application. Try it in &kwrite; and you will see the man page in &HTML; format.
de: Wie bei allen anderen Ein-/Ausgabemodulen von &kde; können Sie auch hier in <emphasis>jeder</emphasis> &kde;-Anwendung eine &URL; wie <userinput><command>man:/socket</command></userinput> eingeben. Versuchen Sie es &eg; in &kwrite; und Sie werden die Handbuchseite im <acronym>HTML</acronym>-Format sehen können.

source: Contact mailing list: <email>kde-devel@kde.org</email>
de: Kontakt: <email>kde-devel@kde.org</email>
