Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kde-runtime/kioslave_nepomuksearch.po
Languages: de

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Burkhard</firstname><surname>Lück</surname><affiliation><address><email>lueck@hube-lueck.de</email></address></affiliation><contrib>Übersetzung</contrib></othercredit>

source: Overview
de: Übersicht

source: The <acronym>nepomuksearch</acronym> protocol allows to search the Nepomuk meta data store for files or any other type of resource (although files is the most important use case since we are talking about virtual file systems here).
de: Das Protokoll <acronym>nepomuksearch</acronym> ermöglicht die Suche nach Dateien und anderen Ressourcen im Nepomuk-Metadatenspeicher. Die Suche nach Dateien ist der wichtigste Anwendungsfall, da es sich hier um ein virtuelles Dateisystem handelt.

source: For it to work the Nepomuk system needs to be activated. Activating the Strigi file indexer provides better results and way more search possibilities.
de: Das Nepomuk-System muss für diese Suche aktiviert sein. Ist außerdem die Strigi-Datei-Indizierung eingeschaltet, ergibt eine Suche bessere Ergebnisse und es bestehen erheblich mehr Suchmöglichkeiten.

source: Typically <acronym>nepomuksearch</acronym> is used transparently to the user through an application like <application>Dolphin</application> which provide GUI elements to construct the necessary query and the corresponding URL. However, it is also possible to write a query URL manually. There are two different possibilities which might be of interest to the user (be aware that queries created as presented below are not restricted to files):
de: Normalerweise wird <acronym>nepomuksearch</acronym> in Programmen wie <application>Dolphin</application> verwendet, unbemerkt durch den Benutzer. Diese Programme stellen eine grafische Bedienungsoberfläche bereit, um Abfragen und zugehörige Addressen (Url) einzugeben. Es ist aber auch möglich eine Abfrage manuell zu schreiben. Es gibt zwei unterschiedliche Möglichkeiten, auf die hingewiesen wird. Beachten Sie dass die hier im Folgenden gezeigten Abfragen nicht auf Dateien begrenzt sind.

source: will look for anything containing the word "Nepomuk". "Nepomuk" can be replaced with anything the simple <xref linkend="query_syntax"/> allows.
de: sucht nach allen Daten, die das Wort „Nepomuk“ enthalten. „Nepomuk“ kann dabei durch alle Begriffe ersetzt werden, die in der einfachen <xref linkend="query_syntax"/> erlaubt sind.

source: will execute the <acronym>SPARQL</acronym> query which in this case looks for all resources that are tagged with a tag that has the label "Nepomuk". Be aware that the query needs to be percent-encoded, &ie; a URI like <userinput>&lt;http://www.semanticdesktop.org/ontologies/2007/08/15/nao#Tag&gt;</userinput> would have to be written as <userinput>%3chttp:%2f%2fwww.semanticdesktop.org%2fontologies%2f2007%2f08%2f15%2fnao#Tag%3e</userinput>.
de: führt die <acronym>SPARQL</acronym>-Abfrage durch, die in diesem Fall nach allen Ressourcen mit dem Stichwort „Nepomuk“ sucht. Beachten Sie, dass die Abfrage mit „%“-Zeichen maskiert werden muss, &ie; eine URI wie <userinput>&lt;http://www.semanticdesktop.org/ontologies/2007/08/15/nao#Tag&gt;</userinput> muss als <userinput>%3chttp:%2f%2fwww.semanticdesktop.org%2fontologies%2f2007%2f08%2f15%2fnao#Tag%3e</userinput> geschrieben werden.

source: Nepomuk Query Syntax
de: Syntax der Nepomuk-Abfrage

source: The syntax is fairly simple. Multiple query terms can be combined with the keywords <command>AND</command> or <command>OR</command>, terms can be excluded by prefixing them with a minus, and specific properties can be searched by combining the property name with a comparator and the value.
de: Die Syntax ist recht einfach. Mehrere Abfrageausdrücke können mit den Schlüsselwörtern <command>AND</command> oder <command>OR</command> verbunden werden. Durch ein vorangestelltes Minuszeichen werden Ausdrücke von der Suche ausgeschlossen. Bestimmte Eigenschaften können durch die Kombination des Eigenschaftsnamens und einem Vergleich mit einem Wert gesucht werden.

source: This syntax can also be used in standard search fields such as the <application>Dolphin</application> one.
de: Diese Syntax kann auch in Standardsuchfeldern wie z. B. in <application>Dolphin</application> verwendet werden.

source: Examples
de: Beispiele

source: <userinput>Nepomuk KDE</userinput> or <userinput>Nepomuk AND KDE</userinput>
de: <userinput>Nepomuk KDE</userinput> oder <userinput>Nepomuk AND KDE</userinput>

source: search for everything containing the words "Nepomuk" and "KDE" in any of their properties (this includes the content of files).
de: sucht nach Allem, das die Wörter „Nepomuk“ und „KDE“ in irgendeiner ihrer Eigenschaften enthält, das schließt auch den Inhalt von Dateien ein.

source: search for everything containing either the word "Nepomuk" or the word "KDE" in any of their properties.
de: sucht nach Allem, das entweder das Wort „Nepomuk“ oder das Wort „KDE“ in irgendeiner ihrer Eigenschaften enthält.

source: search for everything containing the exact phrase "Nepomuk KDE" in any of their properties.
de: sucht nach Allem, das genau den Begriff „Nepomuk KDE“ in irgendeiner ihrer Eigenschaften enthält.

source: search for everything that is tagged with a tag named "Nepomuk".
de: sucht nach Allem mit dem Stichwort „Nepomuk“

source: search for everything that has a tag labeled "nepomuk" but not a tag labeled "scribo".
de: sucht nach Allem mit dem Stichwort „Nepomuk“, aber ohne das Stichwort „scribo“.
