Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kde-runtime/kioslave_smb.po
Languages: de

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Marco</firstname><surname>Wegner</surname><affiliation><address><email>mail@marcowegner.de</email></address></affiliation><contrib>Übersetzer</contrib></othercredit>

source: The smb ioslave enables you to browse the shares of a &Windows; (or Samba) network.
de: Das smb-Modul ermöglicht es Ihnen, auf Freigaben in &Windows;- (oder Samba-) Netzwerken zuzugreifen.

source: To see the workgroups, enter <userinput><command>smb:/</command></userinput>.
de: Um die Arbeitsgruppen anzuzeigen, geben Sie <userinput><command>smb:/</command></userinput> ein.

source: <userinput><command>smb://</command><replaceable>a_workgroup</replaceable></userinput> will list the hosts in this workgroup.
de: <userinput><command>smb://</command><replaceable>arbeitsgruppe</replaceable></userinput> listet alle Rechner in der Arbeitsgruppe auf.

source: To see the shares of a host, enter <userinput><command>smb://</command><replaceable>the_host</replaceable></userinput> or <userinput><command>smb:/</command><replaceable>a_workgroup</replaceable>/<replaceable>the_host</replaceable></userinput>.
de: Um die Freigaben eines Rechners sehen zu können, geben Sie entweder <userinput><command>smb://</command><replaceable>rechnername</replaceable></userinput> oder <userinput><command>smb://</command><replaceable>arbeitsgruppe</replaceable>/<replaceable>rechnername</replaceable></userinput> ein.

source: To access a share directly enter <userinput><command>smb://</command><replaceable>the_host/the_share</replaceable></userinput> or <userinput><command>smb:/</command><replaceable>a_workgroup</replaceable>/<replaceable>the_host</replaceable>/<replaceable>the_share</replaceable></userinput>
de: Um direkt auf die Freigaben eines Rechners zuzugreifen, geben Sie <userinput><command>smb://</command><replaceable>rechnername/freigabe</replaceable></userinput> oder <userinput><command>smb://</command><replaceable>arbeitsgruppe</replaceable>/<replaceable>rechnername</replaceable>/<replaceable>freigabe</replaceable></userinput> ein.

source: The smb ioslave requires that you have libsmbclient to use this ioslave.
de: Das Ein-/Ausgabemodul für smb benötigt die Bibliothek libsmbclient.

source: You can set your default user name and password in the &systemsettings; category <guilabel>Network and Connectivity</guilabel> in <menuchoice><guisubmenu>Sharing</guisubmenu><guimenuitem> Windows Shares</guimenuitem></menuchoice>. This is especially useful if you are a member of a &Windows; <acronym>NT</acronym> domain. There you can also set your workgroup name, but in most cases this is not required. The kioslave will ask for your username and password if a default is not set.
de: Sie können Ihren Benutzernamen und das Passwort in den &systemsettings; im Abschnitt <guilabel>Netzwerk und Verbindungen</guilabel> aus der Seite <menuchoice><guisubmenu>Freigabe</guisubmenu><guimenuitem>Samba</guimenuitem></menuchoice> festlegen. Dies ist besonders nützlich, falls Sie Mitglied einer &Windows; <acronym>NT</acronym>-Domäne sind. Dort können Sie auch den Namen der Arbeitsgruppe festlegen, dies ist jedoch in den meisten Fällen nicht notwendig. Das Ein-/Ausgabemodul fragt Sie nach Benutzernamen und Passwort, falls keine Voreinstellungen festgelegt sind.

source: This ioslave is tested and developed using mainly Samba 2.0.7, but other versions of Samba should work too.
de: Das Modul wurde hauptsächlich getestet und entwickelt mit Samba 2.0.7, aber andere Versionen von Samba sollten ebenfalls funktionieren.

source: Author: Alexander Neundorf <email>neundorf@kde.org</email>
de: Autor: Alexander Neundorf <email>neundorf@kde.org</email>
