Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kde-runtime/kioslave_fish.po
Languages: de

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Marco</firstname><surname>Wegner</surname><affiliation><address><email>mail@marcowegner.de</email></address></affiliation><contrib>Übersetzer</contrib></othercredit>

source: Allows you to access another computer's files using the <emphasis>S</emphasis>ecure <emphasis>SH</emphasis>ell (<acronym>SSH</acronym>) protocol. The remote computer needs to be running the <acronym>SSH</acronym> daemon, but the remainder of the protocol uses standard commandline tools as discussed below.
de: Ermöglicht den Zugriff auf die Dateien eines entfernten Rechners über das <emphasis>S</emphasis>ecure <emphasis>SH</emphasis>ell-Protokoll (<acronym>SSH</acronym>). Der entfernte Rechner muss dafür nur einen <acronym>SSH</acronym>-Dienst ausführen, der Rest dieses Protokolls verwendet nur Standard-Befehle.

source: You can use the fish kioslave like this: <userinput>fish://<replaceable>hostname</replaceable></userinput> or <userinput>fish://<replaceable>username</replaceable>@<replaceable>hostname</replaceable></userinput>.
de: Verwenden Sie das Ein-/Ausgabemodul fish wie folgt: <userinput>fish://<replaceable>rechnername</replaceable></userinput> oder <userinput>fish://<replaceable>benutzername</replaceable>@<replaceable>rechnername</replaceable></userinput>.

source: You need to use double forward slashes.
de: Sie müssen zwei rechtsgerichtete Schrägstriche verwenden.

source: You can omit the <replaceable>username</replaceable> (and the trailing @ symbol) if you have the same username on both computers.
de: Sie können <replaceable>benutzername</replaceable> (und das folgende @) weglassen, wenn Sie auf beiden Rechnern denselben Benutzer verwenden.

source: You can add a password in the format: <userinput>fish://<replaceable>username</replaceable>:<replaceable>password</replaceable>@<replaceable>hostname</replaceable></userinput> but it is not necessary as you will be prompted for one if it is not supplied.
de: Sie können ein Passwort in dieser Form angeben: <userinput>fish://<replaceable>benutzername</replaceable>:<replaceable>passwort</replaceable>@<replaceable>rechnername</replaceable></userinput>, aber normalerweise ist das nicht notwendig, weil Sie automatisch nach dem Passwort gefragt werden, wenn Sie keines angeben.

source: If you are running the <acronym>SSH</acronym> daemon on a non-standard port, you can specify that port using the normal &URL; syntax as shown below: <userinput>fish://<replaceable>hostname</replaceable>:<replaceable>portnumber</replaceable></userinput>.
de: Wenn der SSH-Dienst auf dem entfernten Rechner nicht auf dem Standard-Port läuft, können Sie ihn mit der üblichen Adress-Syntax angeben: <userinput>fish://<replaceable>rechnername</replaceable>:<replaceable>portnummer</replaceable></userinput>.

source: Fish should work with any roughly <acronym>POSIX</acronym> compatible &UNIX; based remote computer. It uses the shell commands <command>cat</command>, <command>chgrp</command>, <command>chmod</command>, <command>chown</command>, <command>cp</command>, <command>dd</command>, <command>env</command>, <command>expr</command>, <command>grep</command>, <command>ls</command>, <command>mkdir</command>, <command>mv</command>, <command>rm</command>, <command>rmdir</command>, <command>sed</command>, and <command>wc</command>. Fish starts <command>/bin/sh</command> as its shell and expects it to be a Bourne shell (or compatible, like <command>bash</command>). If the <command>sed</command> and <command>file</command> commands are available, as well as a <filename>/etc/apache/magic</filename> file with &MIME; type signatures, these will be used to guess &MIME; types.
de: Fish sollte mit annähernd jedem <acronym>POSIX</acronym>-kompatiblen und &UNIX;-basierten Netzwerkrechner arbeiten können. Es verwendet die Shell-Befehle <command>cat</command>, <command>chgrp</command>, <command>chmod</command>, <command>chown</command>, <command>cp</command>, <command>dd</command>, <command>env</command>, <command>expr</command>, <command>grep</command>, <command>ls</command>, <command>mkdir</command>, <command>mv</command>, <command>rm</command>, <command>rmdir</command>, <command>sed</command>, und <command>wc</command>. Fish startet <command>/bin/sh</command> als Shell und erwartet, dass dies eine Bourne-Shell (oder kompatibel dazu wie <command>bash</command>) ist. Falls <command>sed</command> und <command>file</command> sowie die Datei <filename>/etc/apache/magic</filename> verfügbar sind, werden diese verwendet, um den &MIME;-Typ zu erkennen.

source: If <application>Perl</application> is available on the remote machine, it will be used instead. Then only <command>env</command> and <command>/bin/sh</command> are needed. Using <application>Perl</application> has the additional benefit of being faster.
de: Ist auf dem Netzwerk-Rechner <application>Perl</application> verfügbar, wird stattdessen dieses verwendet. Dann werden nur die Befehle <command>env</command> und <command>/bin/sh</command> benötigt. Die Verwendung von <application>Perl</application> hat zudem dem Vorteil, dass es schneller ist.

source: Fish may even work on &Windows; machines, if tools like <application>Cygwin</application> are installed. All the above utilities must be in the system <envar>PATH</envar>, and the initial shell must be able to process the command <command>echo FISH:;/bin/sh</command> correctly.
de: Fish kann sogar auf &Windows;-Rechnern laufen, wenn Werkzeuge wie <application>Cygwin</application> installiert sind. Alle oben angegebenen Hilfsprogramme müssen auf dem System über die Umgebungsvariable <envar>PATH</envar> erreichbar sein. Die ausführende Shell muss außerdem den Befehl <command>echo FISH:;/bin/sh</command> korrekt ausführen können.
