Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kde-runtime/knetattach.po
Languages: de

source: The &knetattach; Handbook
de: Das Handbuch zu &knetattach;

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Thomas</firstname><surname>Bögel</surname><affiliation><address><email>boegel.thomas@gmx.de</email></address></affiliation><contrib>Übersetzung</contrib></othercredit>

source: &knetattach; is a wizard which makes it easier to integrate your network resources with your &kde; Desktop.
de: &knetattach; ist ein Assistent, die Ihnen die Integration Ihrer Netzwerk-Ordner in den &kde;-Desktop erleichtert.

source: Network Folders
de: Netzwerkordner

source: Network Folder Wizard
de: Assistent für Netzwerkordner

source: KDE Network Folder Wizard
de: KDE-Assistent für Netzwerkordner

source: Introduction
de: Einführung

source: The &knetattach; wizard, affectionately and hereafter known as the Network Folder Wizard, allows easy addition and integration of various network folders with your &kde; desktop. Please report any problems or feature requests for it to the &kde; bugs website.
de: &knetattach;, auch bekannt als Assistent für Netzwerkordner, ermöglicht Ihnen eine einfache Integration verschiedener Netzwerkordner in Ihre Arbeitsfläche unter &kde;. Bitte berichten Sie alle Probleme oder Wünsche für zukünftige Versionen an die &kde;-Webseite für Fehlerberichte (http://bugs.kde.org).

source: Using &knetattach;
de: &knetattach; verwenden

source: As you will see in the screenshot below, the Network Folder Wizard currently allows you to add four types of network folders: WebDav, &FTP;, &Microsoft; &Windows; (Samba) network drives and SSH. Additionally you can select a recent connection for the list box.
de: Wie Sie im unteren Bild erkennen können, lassen Sich mit dem Assistenten für Netzwerkordner vier verschiedene Typen von Netzwerkordnern hinzufügen: WebDav, &FTP; &Microsoft; &Windows;-Netzlaufwerke (Samba) und SSH. Außerdem können die letzten Verbindungen in einem Aufklappfeld ausgewählt werden.

source: Here's a screenshot of &knetattach;
de: Hier sehen Sie ein Bildschirmfoto von &knetattach;

source: Screenshot
de: Bildschirmfoto

source: Network Folder Wizard main window
de: Hauptfenster des Assistenten für Netzwerkordner

source: Adding network folders
de: Hinzufügen von Netzwerkordnern

source: Network folders show up in a special location of &konqueror; and &dolphin; called a <emphasis>virtual folder</emphasis>. This virtual folder is accessed by typing <userinput>remote:/</userinput> in the location bar or by selecting <guilabel>Network</guilabel> from the <guilabel>Places</guilabel> panel. You will then be able to see any folders which have been previously added and you also will be able to use the wizard to add new ones.
de: Netzwerkordner werden im &konqueror; und &dolphin; als <emphasis>virtuelle Ordner</emphasis> angezeigt. Sie können auf diesen virtuellen Ordner zugreifen, indem Sie in die Adressleiste <userinput>remote:/</userinput> eingeben oder indem Sie <guilabel>Netzwerk</guilabel> aus der Seitenleiste <guilabel>Orte</guilabel> wählen. Dann werden alle vorher bereits erstellten Ordner angezeigt und Sie können mit diesem Assistenten neue Ordner anlegen.

source: The virtual folder with the Network Folder wizard
de: Der virtuelle Ordner mit dem Assistenten für Netzwerkordner

source: Speaking of wizards, the Network Folder Wizard aims at being very easy to use. After opening the wizard you must choose the type of network folder you would like to access. When you move on to the next screen you will just need to fill in the requested information. The final step is entering your username and login password for the network share you've chosen to access.
de: Der Assistent für Netzwerkordner ist sehr einfach zu bedienen. Nachdem Sie den Assistenten gestartet haben, müssen Sie zunächst den Netzwerkordner-Typ auswählen, auf den Sie zugreifen möchten. Auf der nächsten Seite geben Sie die benötigten Informationen ein. Zum Schluss müssen Sie noch den Benutzernamen und das Passwort für die Netzwerkfreigabe eingeben, auf die Sie zugreifen möchten.

source: Below is a list of the information needed by the wizard to create the network folders. If an option is not available for a particular folder it does not have to be entered. The Samba folders &eg; do not require a <guilabel>Port</guilabel> entry.
de: Es folgt eine Liste mit den Informationen, die der Assistent benötigt, um einen Netzwerkordner zu erstellen. Es müssen nicht für alle Netzwerkordner-Typen alle Informationen eingegeben werden, so ist &eg; die Eingabe des <guilabel>Port</guilabel>s bei Samba-Netzwerkordnern nicht notwendig.

source: This is where you give a name to the network connection. It is limited only by your imagination (or alphabet).
de: Geben Sie hier einen beliebigen Namen für den Netzwerkordner ein.

source: User:
de: Benutzer:

source: This is the username that will be used to establish the connection.
de: Dieser Benutzername wird zur Herstellung der Verbindung verwendet.

source: This is the address of the server you are attempting to add. It can be an IP address or domain name.
de: Hier muss die Adresse des Servers eingegeben werden, der hinzugefügt werden soll. Dabei kann es sich um eine IP-Adresse oder den Namen einer Domäne handeln.

source: Here you enter the port number you wish to connect to. The defaults are usually sufficient.
de: Geben Sie hier die Nummer des Ports an, mit dem Sie sich verbinden möchten. Meistens sind die Standardwerte ausreichend.

source: Not available for &Microsoft; &Windows; (Samba) folders.
de: Nicht vorhanden für (Samba) Ordner auf &Microsoft; &Windows; Systemen.

source: Folder:
de: Ordner:

source: The path to the folder you wish to connect to should go here.
de: Der Pfad zum Ordner, mit dem Sie eine Verbindung herstellen möchten.

source: Encoding:
de: Kodierung:

source: Use the items in this list box to select an encoding for &FTP; and ssh connections.
de: Wählen Sie aus dem Listenfeld eine Kodierung für &FTP;- und SSH-Verbindungen.

source: Create an icon for this remote folder
de: Symbol für diesen Netzwerkordner anlegen

source: If this box is checked an icon will be created allowing access through the remote:/ virtual folder. If it is not checked, a connection will be possible but it will not be accessible from remote:/.
de: Wenn Sie dieses Feld auswählen, wird ein Symbol erstellt, das Ihnen einen Zugriff über den virtuellen remote:/-Ordner ermöglicht. Wenn Sie es dagegen nicht auswählen, können Sie sich dennoch verbinden, jedoch ist der Ordner nicht über den Ort remote:/ erreichbar.

source: The <guilabel>Recent connection:</guilabel> option allows you to re-connect to the last network mount point you connected to using the wizard whether an icon is created or not.
de: Mit der Option <guilabel>Letzte Verbindung</guilabel> können Sie sich mit dem letzten Ordner, mit dem Sie sich über den Assistenten angemeldet haben, verbinden lassen.

source: Use encryption
de: Verschlüsselung verwenden

source: If checked the ability to make a secure connection will be enabled.
de: Um eine sichere Verbindung zu aktivieren, schalten Sie diese Option bitte ein.

source: Available only for WebDav folders.
de: Nur für WebDav-Ordner.

source: &knetattach; Walkthrough
de: Rundgang durch &knetattach;

source: This will be a quick walkthrough of the Network Folder Wizard. Don't blink or you might miss it.
de: Hier nun ein kleiner Rundgang durch den Assistenten für Netzwerkordner.

source: Below you see the main window of the Network Folder Wizard. It is here that we choose what type of folder we want to add or connect to. For the purposes of this walkthrough we will be using &FTP;. It contains most of the options you will encounter while using the wizard.
de: Unten sehen Sie das Hauptfenster des Assistenten für Netzwerk-Ordner. Hier können Sie auswählen, welche Art von Netzwerkordner Sie hinzufügen, bzw. mit welcher Art von Netzwerkordner Sie sich verbinden möchten. In diesem Rundgang werden wir &FTP; verwenden, da dieses Protokoll die meisten Einstellungsmöglichkeiten des Assistenten unterstützt.

source: Here's a screenshot of the &knetattach; main window
de: Hier sehen Sie ein Bildschirmfoto vom &knetattach;-Hauptfenster.

source: OK, so we (as in me) have chosen to add an &FTP; folder. Below you see an example of the type of information you will need to add for your particular &FTP; server. After filling it in we press <guibutton>Save &amp; Connect</guibutton> and wait for the magic. Oh yes, if your server requires validation of some kind you will be prompted at this point before being allowed to connect.
de: Unten sehen Sie, welche Informationen Sie, hier beispielsweise bei einem &FTP;-Ordner, über Ihren &FTP;-Server benötigen. Nachdem Sie diese eingegeben haben, drücken Sie auf den Knopf <guibutton>Speichern &amp; Verbinden</guibutton> und warten Sie einen Moment. Falls Sie sich beim eingegebenen Server identifizieren müssen, werden Sie nun dazu aufgefordert.

source: Screenshot showing addition of &FTP; Folder using &knetattach;
de: Bildschirmfoto vom Hinzufügen eines &FTP;-Ordners bei &knetattach;

source: So now we are all connected now and able to navigate our newly added share. Joy!
de: Nun sind Sie mit dem Ordner verbunden und können Ihren neu hinzugefügten Ordner durchsuchen.

source: Screenshot of the connected &FTP; folder
de: Bildschirmfoto des &FTP;-Ordners, zu dem eine Verbindung hergestellt wurde.

source: To get back to our network folders all that is necessary is typing <action>remote:/</action> in the location bar of &konqueror; or &dolphin; or select <guilabel>Network</guilabel> from the <guilabel>Places</guilabel> panel.
de: Um zu den Netzwerkordnern zu gelangen, geben Sie in die Adressleiste von &konqueror; oder &dolphin; <userinput>remote:/</userinput> ein oder wählen Sie <guilabel>Netzwerk</guilabel> aus der Seitenleiste <guilabel>Orte</guilabel>.

source: Screenshot of the remote:/ virtual folder with the added connection
de: Bildschirmfoto des virtuellen remote:/-Ordners mit der hinzugefügten Verbindung.

source: You can even add new folders from the same location by using the <guilabel>Add a Network Folder</guilabel> link. Well that brings us to the end of our walkthrough (told you it would be quick). I wish you the best of luck in your own network folder adventures ;-)
de: Sie können von hieraus auch neue Ordner hinzufügen, indem Sie auf <guilabel>Neuen Netzwerkordner hinzufügen</guilabel> klicken. Hier endet der Rundgang.

source: Credits and License
de: Danksagungen und Lizenz

source: Program copyright 2004 &George.Staikos; &George.Staikos.mail;
de: Copyright des Programms: 2004 &George.Staikos; &George.Staikos.mail;

source: Documentation Copyright &copy; 2005 &Orville.Bennett; &Orville.Bennett.mail;
de: Copyright der Dokumentation &copy; 2005 &Orville.Bennett; &Orville.Bennett.mail;

source: CREDIT_FOR_TRANSLATORS
de: <para>Übersetzung Thomas Bögel<email>boegel.thomas@gnx.de</email></para>
