Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kde-runtime/onlinehelp.po
Languages: de

source: Online Help
de: Online-Hilfe

source: On this page, you can find different ways to find online help and additional information provided by the KDE community.
de: Auf dieser Seite werden mehrere Verknüpfungen zu Online-Hilfen und zu weiteren Informationen, die von der KDE-Gemeinschaft im Internet bereitgestellt werden, aufgeführt.

source: <ulink url="http://userbase.kde.org/An_introduction_to_KDE">An Introduction to KDE</ulink>&nbsp;
de: <ulink url="http://userbase.kde.org/An_introduction_to_KDE">Eine Einführung in KDE</ulink>&nbsp;

source: Learn more about the <ulink url="http://userbase.kde.org/What_is_KDE"> KDE community and its software</ulink> and find information to help you get started. Also, discover what <ulink url="http://userbase.kde.org/Welcome_to_KDE_UserBase"> UserBase</ulink> is and how it can help you.
de: Hier erfahren Sie mehr über die <ulink url="http://userbase.kde.org/What_is_KDE">KDE-Gemeinschaft und ihre Software</ulink> und finden Sie Informationen, die Ihnen den Einstieg erleichtern. Entdecken Sie auch, was die <ulink url="http://userbase.kde.org/Welcome_to_KDE_UserBase">UserBase</ulink> ist und wie diese Ihnen helfen kann.

source: <ulink url="http://userbase.kde.org/Getting_Help">Getting Help</ulink>&nbsp;
de: <ulink url="http://userbase.kde.org/Getting_Help">Hilfe bekommen</ulink>&nbsp;

source: Need some help? Here are some suggested places where you can get help with problems, as well some hints on how to improve the quality of answers you receive.
de: Wenn Sie Hilfe suchen, finden Sie hier Verknüpfungen, wo Sie Hilfe zu Problemen erhalten und einige Hinweise, wie Sie Ihre Fragen stellen sollten, um bessere Antworten zu erhalten.

source: <ulink url="http://userbase.kde.org/Applications">Applications</ulink>&nbsp;
de: <ulink url="http://userbase.kde.org/Applications">Programme</ulink>&nbsp;

source: Discover the wide variety of applications from the KDE Community, and find out what program suits your needs and preferences.
de: Entdecken Sie die Vielzahl von Anwendungen aus der KDE-Gemeinschaft, und finden Sie das passende Programm für Ihre Anforderungen und Vorlieben.

source: <ulink url="http://userbase.kde.org/Tutorials">Tutorials</ulink>&nbsp;
de: <ulink url="http://userbase.kde.org/Tutorials">Anleitungen</ulink>&nbsp;

source: How-To's, Tips &amp; Tricks that can help make your KDE software experience more enjoyable and productive.
de: Anleitungen und Tipps &amp; Tricks, die Ihren Umgang mit KDE-Software verbessern und die Produktivität erhöhen.

source: <ulink url="http://forum.kde.org/">KDE Community Forums</ulink>&nbsp;
de: <ulink url="http://forum.kde.org/">Forum der KDE-Gemeinschaft</ulink>&nbsp;

source: The KDE Forums offer users, developers and people interested in KDE a place to help each other, discuss KDE-related topics and exchange ideas. You can find <ulink url="http://forum.kde.org/viewforum.php?f=14/">Tutorials &amp; Tips</ulink> in the forum.
de: Im KDE-Forum finden Benutzer, Entwickler und an KDE interessierte Personen einen Platz, um sich gegenseitig zu helfen, Themen zu KDE zu diskutieren und Ideen auszutauschen. Im Forum finden Sie auch <ulink url="http://forum.kde.org/viewforum.php?f=14/">Anleitungen &amp; Tipps</ulink>.

source: Information for developers and help to set up a KDE development environment.
de: Informationen für Entwickler und Anleitungen, um eine Entwicklungsumgebung für KDE aufzusetzen.

source: KDE Documentation
de: KDE-Dokumentation

source: <ulink url="http://docs.kde.org/">KDE Documentation site</ulink>&nbsp;
de: <ulink url="http://docs.kde.org/">KDE-Dokumentationsseite</ulink>&nbsp;

source: This page holds the complete KDE User Documentation in over 25 languages for the released and the development version of KDE SC.
de: Diese Seite enthält die vollständige KDE-Dokumentation für Benutzer in mehr als 25 Sprachen für die veröffentlichte und gerade entwickelte Version der KDE-Softwaresammlung.
