Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kde-runtime/plasmapkg_man-plasmapkg.1.po
Languages: de

source: KDE User's Manual
de: KDE-Benutzerhandbuch

source: Install, list, remove Plasma packages
de: Installieren, Auflisten und Entfernen von Plasma-Paketen

source: <command>plasmapkg</command> <group choice="opt"><option>-h, --hash</option> <replaceable> path</replaceable></group> <group choice="opt"><option>-g, --global</option></group> <group choice="opt"><option>-t, --type</option> <replaceable> type</replaceable></group> <group choice="opt"><option>-i, --install</option> <replaceable> path</replaceable></group> <group choice="opt"><option>-u, --upgrade</option> <replaceable> path</replaceable></group> <group choice="opt"><option>-l, --list</option></group> <group choice="opt"><option>--list-types</option></group> <group choice="opt"><option>-r, --remove</option> <replaceable> name</replaceable></group> <group choice="opt"><option>-p, --packageroot</option> <replaceable> path</replaceable></group> <arg choice="opt">KDE Generic Options</arg> <arg choice="opt">Qt Generic Options</arg>
de: <command>plasmapkg</command> <group choice="opt"><option>-h, --hash</option> <replaceable> path</replaceable></group> <group choice="opt"><option>-g, --global</option></group> <group choice="opt"><option>-t, --type</option> <replaceable> type</replaceable></group> <group choice="opt"><option>-i, --install</option> <replaceable> path</replaceable></group> <group choice="opt"><option>-u, --upgrade</option> <replaceable> path</replaceable></group> <group choice="opt"><option>-l, --list</option></group> <group choice="opt"><option>--list-types</option></group> <group choice="opt"><option>-r, --remove</option> <replaceable> name</replaceable></group> <group choice="opt"><option>-p, --packageroot</option> <replaceable> path</replaceable></group> <arg choice="opt">Allgemeine KDE-Optionen</arg> <arg choice="opt">Allgemeine Qt-Optionen</arg>

source: Description
de: Beschreibung

source: <command>plasmapkg</command> is a command line tool to install, list, remove Plasma packages.
de: <command>plasmapkg</command> ist ein Befehlszeilenprogramm zum Installieren, Auflisten und Entfernen von Plasma-Paketen.

source: Options
de: Optionen

source: Generate a SHA1 hash for the package at <quote>path</quote>.
de: SHA1-Hash für das Paket in <quote>path</quote> generieren.

source: For install or remove, operates on packages installed for all users.
de: Zum Installieren oder Entfernen, beeinflusst Plasma-Pakete für alle Benutzer.

source: The type of package, &eg; theme, wallpaper, plasmoid, dataengine, runner, layout-template, &etc; [plasmoid].
de: Der Pakettyp, &eg; Design, Hintergrundbild, Plasmoid, Datenquelle, Starter, Layout-Vorlage &etc;[Plasmoid].

source: Install the package at <quote>path</quote>.
de: Paket in <quote>path</quote> installieren.

source: Upgrade the package at <quote>path</quote>.
de: Paket von <quote>path</quote> aktualisieren.

source: List installed packages.
de: Installierte Pakete anzeigen.

source: Remove the package named <quote>name</quote>.
de: Paket namens <quote>name</quote> entfernen.

source: Absolute path to the package root. If not supplied, then the standard data directories for this &kde; session will be searched instead.
de: Absoluter Pfad zum Paket. Falls nicht angegeben, werden die Standard-Datenpfade dieser &kde;-Sitzung durchsucht.

source: See Also
de: Siehe auch

source: More detailed user documentation is available from <ulink url="help:/plasma-desktop">help:/plasma-desktop</ulink> (either enter this <acronym>URL</acronym> into &konqueror;, or run <userinput><command>khelpcenter</command> <parameter>help:/plasma-desktop</parameter></userinput>).
de: Weitere ausführliche Dokumentation finden Sie unter <ulink url="help:/plasma-desktop">help:/plasma-desktop</ulink> (geben Sie diese <acronym>URL</acronym> entweder im &konqueror; ein oder starten Sie <userinput><command>khelpcenter</command> <parameter>help:/plasma-desktop</parameter></userinput>).

source: Authors
de: Autor

source: <command>plasmapkg</command> was written by <personname><firstname>Aaron</firstname><surname>Seigo</surname></personname> <email>aseigo@kde.org</email>.
de: <command>plasmapkg</command> wurde von <personname><firstname>Aaron</firstname><surname>Seigo</surname></personname> <email>aseigo@kde.org</email> geschrieben.
