Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/extragear-office/kile.po
Languages: de

source: If you press <keycombo>&Ctrl;<keycap>Return</keycap></keycombo>, &kile; inserts an intelligent newline. If your current position is inside a list environment, like <userinput>enumerate</userinput> or <userinput>itemize</userinput>, &kile; will not only insert a newline, but also add a <userinput>\item</userinput> command.
de: Beim Drücken von <keycombo>&Ctrl;<keycap>Eingabetaste</keycap></keycombo> fügt &kile; einen intelligenten Zeilenumbruch ein. Falls sich die aktuelle Position innerhalb einer <emphasis>Listen</emphasis>-Umgebung (z. B. <userinput>enumerate</userinput> oder <userinput>itemize</userinput>) befindet, fügt &kile; nicht nur einen Zeilenumbruch sondern zugleich den Befehl <userinput>\item</userinput> ein.

source: If you are inside a tabular environment, &kile; will finish the current line with <userinput>\\</userinput>, followed by the newline.
de: Innerhalb einer <emphasis>Tabellen</emphasis>-Umgebung schließt &kile; die aktuelle Zeile mit <userinput>\\</userinput> mit einem anschließenden Zeilenumbruch ab.

source: If you are inside a &latex; comment, &kile; will start the next line with a <userinput>%</userinput>.
de: Innerhalb eines <emphasis>&latex;</emphasis>-Kommentars beginnt &kile; die neue Zeile mit <userinput>%</userinput>.

source: Even better, &kile; is smart enough to support predefined &latex; and user defined environment, which can be added in section <menuchoice><guimenu>Settings</guimenu><guisubmenu>Configure Kile...</guisubmenu><guimenuitem>LaTeX</guimenuitem></menuchoice>.
de: Sogar noch besser - &kile; ist intelligent genug, um voreingestellte &latex;- oder benutzerdefinierte Umgebungen zu unterstützen. Diese können unter <menuchoice><guimenu>Einstellungen</guimenu><guimenuitem>&kile; einrichten ...</guimenuitem><guilabel>LaTeX</guilabel></menuchoice> hinzugefügt werden.

source: Smart Tabulator
de: Intelligenter Tabulator

source: Some users like to arrange columns in tabular environments and put all ampersand characters <keycap>&amp;</keycap> beneath each other. &kile; tries to support this. If you press <keycombo>&Alt;&Shift;<keycap>&amp;</keycap></keycombo>, &kile; will look for the next tab in the row above. Although this tab may not the corresponding tab, &kile; will add some spaces to adjust the column position with the current tab.
de: Einige Anwender möchten die Spalten in <emphasis>Tabellen</emphasis>-Umgebungen und dabei alle Et-Zeichen (<keycap>&amp;</keycap>) untereinander anordnen. &kile; versucht dies zu ermöglichen. Beim Drücken von <keycombo>&Alt;&Shift;<keycap>&amp;</keycap></keycombo> sucht &kile; nach dem nächsten Tabulator in der darüberliegenden Zeile. Obwohl dieser Tabulator möglicherweise nicht der dazugehörige ist, fügt &kile; einigen Zwischenraum für die <emphasis>Spalten</emphasis>position des aktuellen Tabulators hinzu.

source: Code Completion
de: Quelltext-Vervollständigung

source: Although &kate; already offers a good completion mode, &kile; extended code completion to support some special methods especially for &latex;. Five different modes are integrated. Three of them work on demand, the other two are autocompletion modes. All modes can be configured to work very differently at <menuchoice><guimenu>Settings</guimenu><guimenuitem>Configure Kile...</guimenuitem></menuchoice>.
de: Obwohl &kate; bereits eine gute Quelltext-Vervollständigung bietet, wurde diese in &kile; um spezielle Befehle (meist für &latex;) noch erweitert. Es sind fünf verschiedene Modi eingebaut. Davon arbeiten drei nach Bedarf und die anderen beiden sind für die automatische Vervollständigung. Alle diese Modi können für unterschiedliche Arbeitsweisen unter <menuchoice><guimenu>Einstellungen</guimenu><guimenuitem>Kile einrichten ...</guimenuitem><guilabel>Vervollständigen</guilabel></menuchoice> eingestellt werden.

source: Automatic Environment Completion
de: Automatische Umgebungs-Vervollständigung

source: When you begin a new environment, typing <userinput>\begin{environment}</userinput>, &kile; will automatically add an <userinput>\end{environment}</userinput> command, with a line in between for your text.
de: Beim Beginn eine neuen Umgebung mittels dem Befehl <userinput>\begin{Umgebung}</userinput> wird &kile; automatisch den Befehl <userinput>\end{Umgebung}</userinput> nach einer leeren Zeile (für den Text) hinzufügen.

source: Autocompletion can be turned off in the &latex; section of <menuchoice><guimenu>Settings</guimenu><guisubmenu>Configure Kile...</guisubmenu> <guimenuitem>LaTeX</guimenuitem><guilabel>Environments</guilabel></menuchoice>.
de: Die automatische Vervollständigung kann in den Einstellungen (<menuchoice><guimenu>Einstellungen</guimenu><guisubmenu>&kile; einrichten ...</guisubmenu><guimenuitem>LaTeX</guimenuitem><guilabel>Umgebungen</guilabel></menuchoice>) abgeschaltet werden.

source: <screeninfo>Completing an Equation Environment</screeninfo>
de: <screeninfo>Vervollständigung einer „equation“-Umgebung</screeninfo>

source: <phrase>Completing an Equation Environment</phrase>
de: <phrase>Vervollständigung einer „equation“-Umgebung</phrase>

source: <para>Completing an Equation Environment</para>
de: <para>Vervollständigung einer „equation“-Umgebung</para>

source: &latex; Commands
de: &latex;-Befehle

source: When you type some letters, you can activate this completion mode for &latex; commands and normal words with <menuchoice><guimenu>Edit</guimenu><guisubmenu>Complete</guisubmenu><guimenuitem>(La)TeX Command</guimenuitem></menuchoice> or the keyboard shortcut <keycombo>&Ctrl;&Shift;<keycap>Space</keycap></keycombo>. &kile; first reads the letters from the current cursor position to the left and stops at the first non-letter character or a backslash. If this pattern begins with a backslash, &kile; will enter completion mode for &tex; or &latex; commands. Otherwise it enters normal dictionary mode, where you will not find any &latex; commands. Depending on the chosen mode, a completion box will be opened. You will see all commands or words whose beginning matches the current pattern. You can navigate with the cursor keys through this list and select one entry with &Enter; or a double click with the mouse.
de: Bei der Eingabe einiger Buchstaben kann die Vervollständigung für &latex;-Befehle und <emphasis>normale</emphasis> Wörter mittels <menuchoice><guimenu>Bearbeiten</guimenu><guisubmenu>Vervollständigen</guisubmenu><guimenuitem>(La)TeX-Befehl</guimenuitem></menuchoice> oder dem Tastenkürzel <keycombo>&Ctrl;&Shift;<keycap>Leertaste</keycap></keycombo> aktiviert werden. &kile; <emphasis>liest</emphasis> zuerst die Buchstaben von der aktuellen Position des Cursors nach links und stoppt beim ersten Zeichen, das kein Buchstabe ist (z. B. Leerschritt oder Rückwärtsschrägstrich). Sollte das Eingelesene mit einem Rückwärtsschrägstrich (= <keycap>/</keycap>) beginnen, wird &kile; die Vervollständigung der &tex;- oder &latex;-Befehle aktivieren. Anderenfalls wird die Vervollständigung über das <emphasis>normale</emphasis> Wörterbuch (ohne &latex;-Befehle) aktiviert. Abhängig vom gewählten Modus wird eine Auswahlliste <emphasis>geöffnet</emphasis>, in der alle Befehle oder Wörter enthalten sind, die mit dem bereits Eingegebenem bzw. dem Eingelesenem beginnen. Mit den Pfeiltasten kann durch diese Liste <emphasis>geblättert</emphasis> und ein Eintrag mittels der <keycap>Eingabetaste</keycap> oder einem Doppelklick mit der Maus ausgewählt werden

source: <screeninfo>Completing a LaTeX Command</screeninfo>
de: <screeninfo>Vervollständigung eines &latex;-Befehls</screeninfo>

source: <phrase>Completing a LaTeX Command</phrase>
de: <phrase>Vervollständigung eines &latex;-Befehls</phrase>

source: When you push the &Backspace; key, the last letter of your pattern will be deleted, and the completion list may grow. On the other hand, if you type another letter will expand the pattern and the visible word list may shrink.
de: Beim Drücken der <keycap>Rücktaste</keycap> wird der letzte Buchstabe der Eingabe entfernt und möglicherweise vergrößert sich dadurch die <emphasis>Vervollständigungs</emphasis>liste. Andererseits kann sich die Liste durch Eingabe eines weiteren Buchstaben auch verkleinern.

source: If you decide not to select any of the suggestions, you can leave this dialog with &Esc;.
de: Soll keiner der Vorschläge Verwendung finden, kann der Dialog mittels <keycap>Esc</keycap> verlassen werden.

source: You will see that all commands are written with a short description of their parameters. These descriptions are of course stripped when you select a command. Optionally you can let &kile; insert bullets at these places, so that you can easily jump to these positions with <menuchoice><guimenu>Edit</guimenu><guisubmenu>Bullets</guisubmenu><guimenuitem>Next Bullet</guimenuitem></menuchoice> and insert the parameter you want.
de: Alle Befehle werden mit einer kurzen Beschreibung ihrer Parameter geschrieben. Die Beschreibungen werden natürlich bei Auswahl eines Befehls entfernt. Alternativ können von &kile; auch <emphasis>Sprungmarken</emphasis> eingefügt werden, sodass ein einfach Sprung zu diesen Positionen mittels <menuchoice><guimenu>Bearbeiten</guimenu><guisubmenu>Sprungmarken</guisubmenu><guimenuitem>Nächste Sprungmarke</guimenuitem></menuchoice> möglich ist und die gewünschten Parameter dann eingefügt werden können.

source: Go to <menuchoice><guimenu>Settings</guimenu><guisubmenu>Configure Kile...</guisubmenu> <guimenuitem>Kile</guimenuitem><guilabel>Complete</guilabel></menuchoice> to configure one or more of these lists. You can choose different word lists for &tex; and &latex; commands and dictionary mode for normal words.
de: Unter <menuchoice><guimenu>Einstellungen</guimenu><guisubmenu>&kile; einrichten ...</guisubmenu><guimenuitem>&kile;</guimenuitem><guilabel>Vervollständigen</guilabel></menuchoice> können Einstellungen zu diesen Listen vorgenommen werden. Es können verschiedene Wörterlisten für &tex;- und &latex;-Befehle sowie Wörterbücher des allgemeinen Sprachgebrauchs ausgewählt werden.

source: If you choose the option <guimenuitem>Show Latex commands</guimenuitem>, the entries of all chosen cwl files for &latex; command completion are shown in a separate view of &kile;'s sidebar. So you will have a good survey, which commands are available and what parameters and options must or can be given for a completion. You can also simply select one entry with a mouse click and it will be inserted into the document, where all named parameters and options are stripped.
de: Wenn Sie die Option <guimenuitem>LaTeX-Befehle anzeigen</guimenuitem>, werden die Einträge aller ausgewählten cwl-Dateien für die &latex;-Befehlsvervollständigung in einer getrennten Ansicht der Seitenleiste von &kile;. Dadurch haben Sie einen guten Überblick, welche Befehle verfügbar sind und welche Parameter und Optionen für eine Vervollständigung eingegeben werden müssen oder eingegeben werden können. Es ist möglich Einträge mit einem Mausklick auszuwählen und das Dokument einzufügen, dabei alle benannten Parameter und Optionen entfernt.

source: <screeninfo>LaTeX commands in the sidebar</screeninfo>
de: <screeninfo>&latex;-Befehle in der Seitenleiste</screeninfo>

source: <phrase>LaTeX commands in the sidebar</phrase>
de: <phrase>&latex;-Befehle in der Seitenleiste</phrase>

source: As each chosen wordlist will be shown in a separate view for its own, there could be too much views, so that &kile;'s main window may be greater than small screens. As this looks very ugly, &kile; works with a maximum number of allowed views, which is set to 10. If this value is too big for your screen, you should reduce this number.
de: Jede Wortliste wird in einer eigenen Ansicht dargestellt. Bei vielen benutzten Wortlisten könnte das Hauptfenster von &kile; größer als der Bildschirm werden. Um das zu vermeiden, ist die Anzahl von Wortlisten in &kile; auf maximal 10 begrenzt. Ist dieser Wert immer noch zu groß für Ihren Bildschirm, dann sollten Sie diesen Wert verringern.

source: The <emphasis>command mode</emphasis> is not useful to complete environments. You always have to type some letters of <userinput>\begin</userinput>, and invoking the completion mode will result in a huge list of environments tags. On the other hand, environments are so often used that &kile; offers a special mode to complete environments. Forget the opening tag and write, for example, <userinput>eq</userinput>.
de: Der <emphasis>Befehls</emphasis>modus ist für die Vervollständigung von Umgebungen nicht nützlich. Es müssen immer ein paar Buchstaben mit <userinput>\begin</userinput> eingegeben werden und der Aufruf des <emphasis>Vervollständigungs</emphasis>modus wird eine große Liste mit <emphasis>Umgebungs</emphasis>befehlen zur Folge haben. Andererseits werden die Umgebungen so oft verwendet, dass &kile; einen speziellen Modus für die Vervollständigung der Umgebungen zur Verfügung stellt.

source: When you call the completion mode with <menuchoice><guimenu>Edit</guimenu><guisubmenu>Complete</guisubmenu><guimenuitem>Environment</guimenuitem></menuchoice> or keyboard shortcut <keycombo>&Alt;&Shift;<keycap>Space</keycap></keycombo>, the opening tag is automatically added and you will see <userinput>\begin{eq}</userinput>. After this change, the completion list is much less cluttered.
de: Beim Aufruf des Vervollständigungsmodus über das Menü <menuchoice><guimenu>Bearbeiten</guimenu><guisubmenu>Vervollständigen</guisubmenu><guimenuitem>Umgebung</guimenuitem></menuchoice> oder das Tastenkürzel <keycombo>&Alt;&Shift;<keycap>Leertaste</keycap></keycombo> wird der Befehl zum Öffnen der Umgebung automatisch eingefügt und es erscheint <userinput>\begin{</userinput>. Danach kann die <emphasis>Umgebungs</emphasis>vervollständigung auf einfachste Art und Weise fortgesetzt und durch Drücken der <keycap>Eingabe</keycap>taste beendet werden.

source: Now select an environment, and you will see that it is also automatically closed. Even more, if &kile; recognizes it as a list environment, it will also insert a first <userinput>\item</userinput> tag.
de: Nachdem dies vollzogen ist, wird die Umgebung automatisch wieder geschlossen. Sobald &kile; erkennt, dass es sich um eine <emphasis>Listen</emphasis>umgebung handelt, wird sogar noch ein erster <userinput>\item</userinput>-Befehl mit eingefügt.

source: Go to <menuchoice><guimenu>Settings</guimenu><guisubmenu>Configure Kile...</guisubmenu> <guimenuitem>Kile</guimenuitem><guilabel>Complete</guilabel></menuchoice> to configure one or more of these lists. This mode uses the same word lists as the completion mode for &tex; and &latex; commands.
de: Unter <menuchoice><guimenu>Einstellungen</guimenu><guisubmenu>&kile; einrichten ...</guisubmenu><guimenuitem>&kile;</guimenuitem><guilabel>Vervollständigen</guilabel></menuchoice> können Einstellungen zu diesen Listen vorgenommen werden. Dieser Modus verwendet die Wörterliste des Vervollständigungsmodus für &tex;- und &latex;-Befehle.

source: Abbreviations
de: Abkürzungen

source: &kile; supports user defined lists of abbreviations, which are replaced on demand by longer text strings. Look at <menuchoice><guimenu>Settings</guimenu><guisubmenu>Configure Kile...</guisubmenu> <guimenuitem>Kile</guimenuitem><guilabel>Complete</guilabel></menuchoice> to configure one or more of theses lists. For the example given here, the abbreviation list in <filename>example.cwl</filename> must be chosen. In this file you will find for example the entry <userinput>L=\LaTeX</userinput> for example.
de: &kile; unterstützt benutzerdefinierte Listen von Abkürzungen, die sofort durch längere <emphasis>Zeichenketten</emphasis> ersetzt werden. Die Listen können unter <menuchoice><guimenu>Einstellungen</guimenu><guisubmenu>Kile einrichten ...</guisubmenu><guimenuitem>Kile</guimenuitem><guilabel>Vervollständigen</guilabel></menuchoice> eingerichtet werden. Als Beispiel einer Abkürzungsliste dient die Datei <filename>example.cwl</filename>, in der beispielsweise der Eintrag <userinput>L=\LaTeX</userinput> enthalten ist.

source: For example, type only the letter <userinput>L</userinput>. Now invoke the abbreviation mode of word completion with <menuchoice><guimenu>Edit</guimenu><guisubmenu>Complete</guisubmenu><guimenuitem>Abbreviation</guimenuitem></menuchoice> or keyboard shortcut <keycombo>&Ctrl;&Alt;<keycap>Space</keycap></keycombo>, and the letter <userinput>L</userinput> is replaced by the string <userinput>\LaTeX</userinput>.
de: Wird beispielsweise der Buchstabe <userinput>L</userinput> eingegeben und der <emphasis>Wort</emphasis>vervollständigungsmodus über das Menü <menuchoice><guimenu>Bearbeiten</guimenu><guisubmenu>Vervollständigen</guisubmenu><guimenuitem>Abkürzung</guimenuitem></menuchoice> oder das Tastenkürzel <keycombo>&Ctrl;&Alt;<keycap>Leertaste</keycap></keycombo> eingeleitet, wird der Buchstabe <userinput>L</userinput> durch die Zeichenkette <userinput>\LaTeX</userinput> ersetzt.

source: Abbreviation completion also supports newline <userinput>%n</userinput> and <userinput>%C</userinput> to place the cursor, if these characters are present in the expansion text. So if you have the entry
de: Die Vervollständigung von Abkürzungen funktioniert auch mit Zeilenumbruch <userinput>%n</userinput> und dem Platzhalter <userinput>%C</userinput> für die Cursor-Position, wenn diese Zeichen im Erweiterungstext benutzt werden. Haben Sie zum Beispiel diesen Eintrag

source: in the completion file, and invoke the abbreviation completion, the expansion looks like below, where <userinput>x</userinput> shows the final cursor position.
de: in der Vervollständigungsdatei und rufen die Vervollständigung für die Abkürzung auf, erhalten Sie das unten angezeigte Ergebnis. Dabei kennzeichnet <userinput>x</userinput> die endgültige Cursor-Position,

source: If you choose <guimenuitem>Show abbreviations</guimenuitem>, all possible abbreviations are shown in a view of the sidebar. So you will have a good survey of all possible abbreviations.
de: Wenn Sie die Einstellung <guimenuitem>Abkürzungen</guimenuitem> aktivieren, werden alle Abkürzungen in einer Ansicht in der Seitenleiste gezeigt. Damit haben Sie einen guten Überblick über alle definierten Abkürzungen.

source: Autocompletion Modes
de: Automatische Vervollständigungsmodi

source: You can also enable an autocompletion mode for &latex; commands. When a given threshold of letters (default: 3) is entered, a popup window opens with a list of all matching &latex; commands. You can select one of these commands, or ignore this window and type further letters. The entries of the completion box will always change and match your currently typed word.
de: Sie können einen automatischen Vervollständigungsmodus für &latex;-Befehle aktivieren. Wenn eine bestimmte Mindestanzahl an Buchstaben (als Voreinstellung drei) eingegeben wurde, erscheint ein Auswahlfenster mit einer Liste aller passenden &latex;-Befehle. Sie können einen dieser Vorschläge auswählen oder das Auswahlfenster einfach ignorieren und weitere Buchstaben eingeben. Die Einträge in der Vervollständigungsliste ändern sich bei der Eingabe, um immer einen passenden Vorschlag für das bisher eingegebene Wort zu liefern.

source: Go to <menuchoice><guimenu>Settings</guimenu><guisubmenu>Configure Kile...</guisubmenu> <guimenuitem>Kile</guimenuitem><guilabel>Complete</guilabel></menuchoice> to enable or disable this mode or to change the threshold.
de: Auf der Seite <menuchoice><guimenu>Einstellungen</guimenu><guisubmenu>Kile einrichten ...</guisubmenu> <guimenuitem>Kile</guimenuitem><guilabel>Vervollständigen</guilabel></menuchoice> können Sie diesen Modus ein- und ausschalten und den Schwellwert einstellen.

source: Document Words
de: Geschriebene Wörter

source: Large dictionaries are not useful in autocompletion mode. But, we have seen that a lot of words in a document are typed more than once. So &kile; offers a completion for all words from the document that the user has already typed before. You can manually invoke this completion, if you press <keycombo>&Ctrl;<keycap>Space</keycap></keycombo>. Note that this mode is different from completion mode of &latex; commands.
de: Große Wörterbücher sind für die automatische Vervollständigung nicht hilfreich. Jedoch wurde festgestellt, dass viele Wörter in einem Dokument mehr als einmal geschrieben werden. Damit bietet &kile; die Vervollständigung für alle bereits geschriebenen Wörter. Sie können diese Vervollständigung manuell hervorrufen, indem Sie <keycombo>&Ctrl;<keycap>Leertaste</keycap></keycombo> drücken. Beachten Sie das diese Vervollständigung eine andere ist als der Vervollständigungsmodus von &latex;-Befehlen.

source: If you want to turn this mode on or off, go to <menuchoice><guimenu>Settings</guimenu><guisubmenu>Configure Kile...</guisubmenu> <guimenuitem>Editor</guimenuitem><guimenuitem>Editing</guimenuitem><guilabel>Auto Completion</guilabel></menuchoice>. In this configuration dialog you can configure, if completion mode for document words should be enabled. There is also an additional autocompletion mode, where a completion box pops up, when a certain threshold is reached.
de: Dieser Modus kann im Menü <menuchoice><guimenu>Einstellungen</guimenu><guisubmenu>Kile einrichten ...</guisubmenu><guimenuitem>Editor</guimenuitem><guimenuitem>Bearbeitung</guimenuitem><guilabel>Autovervollständigung</guilabel></menuchoice> ein- oder ausgeschaltet werden. Hier kann auch der <guilabel>Minimale Wortlänge für Vervollständigung</guilabel> festgelegt werden.

source: Writing Own Completion Files
de: Eigene <emphasis>Vervollständigungs</emphasis>dateien schreiben

source: The latest specification of the completion file format can found in the <ulink url="http://projects.kde.org/projects/extragear/office/kile/repository/revisions/master/raw/README.cwl"> CWL file format specification</ulink>.
de: Die neueste Beschreibung des Formats der <emphasis>Vervollständigungs</emphasis>-Dateien finden Sie unter <ulink url="http://projects.kde.org/projects/extragear/office/kile/repository/revisions/master/raw/README.cwl">CWL-Dateiformat</ulink>.

source: Completion files can be installed in a user's home folder under the <filename>~/.kde/share/apps/kile/complete/&lt;mode&gt;/</filename> subdirectory, where <parameter>&lt;mode&gt;</parameter> either stands for <constant>abbreviation</constant>, <constant>dictionary</constant> or <constant>tex</constant>.
de: Die <emphasis>Vervollständigungs</emphasis>-Dateien können im Unterordner <filename>~/.kde/share/apps/kile/complete/&lt;mode&gt;/</filename> des <emphasis>Persönlichen Ordners</emphasis> installiert werden. <parameter>mode</parameter> steht dabei für <constant>abbreviation</constant> (Abkürzung), <constant>dictionary</constant> (Wörterbuch) oder <constant>tex</constant>.

source: Wizards and Dialogs
de: Assistenten und Dialoge

source: This wizard has already been described in the section <xref linkend="intro_docwizard" role="select: title pageabbrv"/>.
de: Dieser Assistent wurde bereits im Abschnitt <xref linkend="intro_docwizard" role="select: title pageabbrv"/> beschrieben.

source: Include Graphics
de: Grafiken einfügen
