Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/extragear-office/kile.po
Languages: de

source: Even better: if your system allows <userinput>shell-escape</userinput>, conversion can be done on the fly. All you have to do is to include the <application>epstopdf</application> package, which is part of all &tex; distributions, with command <userinput>\usepackage{epstopdf}</userinput>. Assuming that your code is <programlisting> \includegraphics[width=5cm]{test.eps} </programlisting> When you call &pdflatex; with option <option>--shell-escape</option>, graphics <filename>test.eps</filename> is automatically converted into <filename>test.pdf</filename>.
de: Erlaubt Ihr System <userinput>shell-escape</userinput>, dann kann diese Umwandlung auch direkt ohne Zwischenschritte erfolgen. Das müssen Sie das Paket <application>epstopdf</application> einschließen, das Bestandteil aller &tex;-Distributionen ist. Benutzen Sie dazu den Befehl <userinput>\usepackage{epstopdf}</userinput>. Als Quelltext verwenden Sie zum Beispiel <programlisting> \includegraphics[width=5cm]{test.eps} </programlisting> Wenn Sie nun &pdflatex; mit der Option <option>--shell-escape</option> aufrufen, wird die Grafik <filename>test.eps</filename> automatisch in die Datei <filename>test.pdf</filename> umgewandelt.

source: This conversion will take place each time you run &pdflatex;. If your graphics command is given implicitly: <programlisting> \includegraphics[width=5cm]{test} </programlisting> <application>epstopdf</application> checks whether <filename>test.pdf</filename> is already available, so that conversion step can be skipped.
de: Diese Umwandlung wird bei jeder Ausführung von &pdflatex; durchgeführt. Haben Sie Ihren Grafik-Befehl implizit angegeben mit: <programlisting> \includegraphics[width=5cm]{test} </programlisting> dann prüft das Programm <application>epstopdf</application> ob die Datei <filename>test.pdf</filename> bereits vorhanden ist. In diesem Fall wird dieser Ausführungsschritt übersprungen.

source: You can convert the other way around, and use &latex; and PS-PDF conversion. This is not always a good idea, since EPS encapsulation of JPG or PNG can yield larger files, that in turn yield unnecessarily large documents. This is however <emphasis>highly</emphasis> dependent on the graphic utility that you use, since EPS can encapsulate other graphics, but not all applications support this perfectly. Some might actually try to build your JPG image with vectors and various scripting, which will result in gigantic files. Conversion of all graphics formats to EPS can be done by <ulink url="http://www.imagemagick.org/">&imagemagick;</ulink>. Another simple program that does this process correctly is <ulink url="http://www.tex.uniyar.ac.ru/win32/tools/jpg2ps/"><application>jpg2ps</application></ulink>.
de: Sie können die Umwandlung auch in der anderen Richtung durchführen und mit &latex; und der Grafikumwandlung PS-PDF arbeiten. Das funktioniert nicht immer gut, da die EPS-Einbindung von JPG- oder PNG-Formaten zu großen Dateien und damit zu unnötig großen Dokumenten führt. Das hängt jedoch <emphasis>stark</emphasis> von den verwendeten Grafikprogrammen ab, da EPS andere Grafiken einbinden kann, dies aber nicht von allen Programme gleich gut unterstützt wird. Einige dieser Programme erstellen eine JPG-Datei mit Vektoren und verschiedenen Skripten, was zu riesig großen Dateien führt. Alle Grafikformate können mit <ulink url="http://www.imagemagick.org/">&imagemagick;</ulink> in das EPS-Format umgewandelt werden. <ulink url="http://www.tex.uniyar.ac.ru/win32/tools/jpg2ps/"><application>jpg2ps</application></ulink> ist ein weiteres Programm, das diese Umwandlung korrekt ausführt.

source: You can also use an automatic conversion. All graphic files are converted on the fly to EPS, and inserted into the PS document. This is a comfortable way, but you have to set up your system properly. This is discussed in the section <link linkend="build_epsgraphics">EPS Graphics</link>.
de: Sie können auch eine automatisch Umwandlung benutzen. Dann werden alle Grafikdateien beim Kompilieren in EPS umgewandelt und dann in das PS-Dokument eingefügt. Das ist eine bequeme Vorgehensweise, aber Sie müssen Ihr System dafür richtig einstellen. Dies wird im Abschnitt <link linkend="build_epsgraphics">EPS-Grafiken</link> erläutert.

source: Use the right File for the right Graphic
de: Benutzen Sie die richtige Datei für ein Grafikformat

source: EPS is sort of a graphic vector scripting language, describing all the lines and dots the graph is made of; it looks good even when magnified beyond its default size, and suits best diagrams and vectorial graphic natively produced in EPS, which look very clear and sharp while maintaining a very small byte size.
de: EPS ist eine grafische Vektorskriptsprache, die alle Linien und Punkte der Grafik beschreibt. Auch bei einer Vergrößerung über die Standardgröße hinaus ist die Qualität der Anzeige immer noch hoch. Es ist am Besten für Diagramme und Vektorgrafiken geeignet, die direkt für das EPS-Format erzeugt werden. Trotz einer geringen Größe der Grafik ist die Anzeige sehr klar und scharf.

source: PNG (or the deprecated &GIF;) is a <emphasis>non-lossy</emphasis> file format, with good compression and quality. It is very good for diagrams, scans of drawings, or anything whose sharpness you do want to retain. It is sometimes overkill when used for photos.
de: PNG (oder das veraltete &GIF;) ist ein <emphasis>verlustfreies</emphasis> Dateiformat mit guter Komprimierung und Qualität. Es ist gut für Diagramme. eingescannte Zeichnungen, oder alle Grafiken, der Schärfe erhalten bleiben soll, geeignet. Für Fotos ist es manchmal weniger geeignet.

source: JPG is a <emphasis>lossy</emphasis> format, that compresses files better than PNG at the price of some loss in the picture detail. This is usually irrelevant for photos, but may cause bad quality for diagrams, drawings, and may make some thin lines disappear outright; in those cases use EPS or PNG.
de: JPG ist ein <emphasis>verlustbehaftetes</emphasis> Format, die Komprimierungsrate ist besser als beim PNG-Format, dafür gehen aber auch einige Bilddetails verloren. Bei Fotos ist das unerheblich, kann aber zu einer niedrigen Qualität für Diagramme, Zeichnungen führen und manchmal verschwinden dünne Linien. Benutzen Sie dann das EPS- oder PNG-Format.

source: But always remember: garbage in, garbage out! No conversion will make a bad picture good.
de: Denken Sie daran: Das Ergebnis ist nur so gut wie die Eingabedaten. Keine Umwandlung kann aus einem Bild in schlechter Qualität ein Bild mit hoher Qualität machen.

source: EPS Graphics
de: EPS-Grafiken

source: EPS graphics files are the traditional way to insert graphics files into &latex; documents. As mailing lists are full with questions concerning EPS graphics, we will discuss some important aspects and demonstrate how &kile; supports them.
de: EPS-Grafikdateien sind das traditionelle Format, um Grafikdateien in &latex; einzufügen. Auf den Mailinglisten finden sich viele Fragen zu EPS-Grafiken, daher werden hier einige wichtige Aspekte dazu angesprochen und erläutert, wie das Einfügen von EPS-Grafiken in &kile; funktioniert.

source: &latex; and EPS Graphics
de: &latex; und EPS-Grafiken

source: If you decided to use the traditional &latex; to produce PS or PDF output, you will probably run into some problems with graphics. You have to use EPS graphics (Encapsulated &PostScript;), no JPEG or PNG files. This should be no problem, as there are a lot of <link linkend="build_graphics_conversion">converters</link> like <command>convert</command> from the excellent <ulink url="http://www.imagemagick.org/">&imagemagick;</ulink> package. But, it needs some time of course.
de: Benutzen Sie &latex; um PS- oder PDF-Ausgaben zu erzeugen, haben Sie wahrscheinlich einige Probleme mit Grafiken. Sie müssen EPS-Grafiken (Encapsulated &PostScript;) verwenden, aber keine JPEG- oder PNG-Dateien. Letztere können Sie mit <link linkend="build_graphics_conversion">Umwandlungsprogrammen</link> wie <command>convert</command> aus dem Paket <ulink url="http://www.imagemagick.org/">&imagemagick;</ulink>bearbeiten.

source: The EPS files are used by both &latex; and the &DVI;-PS converter:
de: Die EPS-Dateien werden sowohl von &latex; als auch von der &DVI;-PS-Umwandlung benutzt.

source: &latex; scans the EPS file for the bounding box line, which tells &latex; how much space to reserve for the graphics.
de: &latex; sucht in der EPS-Datei nach den Begrenzungslinien des Bildes, um mit dieser Information den nötigen Platz für die Grafik bereitzustellen.

source: The &DVI;-PS converter then reads the EPS file and inserts the graphics in the PS file.
de: Das Umwandlungs-Programm &DVI;-PS liest die EPS-Dateien und fügt die Grafiken in die PS-Datei ein.

source: This has some implications:
de: Dies hat einige Konsequenzen:

source: &latex; never reads the EPS file if the bounding-box parameters are specified in the graphics-insertion command.
de: &latex; liest die EPS-Datei nicht ein, wenn die Parameter der Begrenzungslinien im Befehl zum Einfügen der Grafik angegeben wird.

source: Since &latex; cannot read non-ASCII files, it cannot read the bounding-box information from compressed or non-EPS graphics files.
de: &latex; kann nur Dateien im ASCII-Format lesen, daher wird die Information über die Begrenzungslinien aus komprimierten EPS-Dateien oder Dateien in anderen Formaten nicht erfasst.

source: The EPS graphics are not included in the &DVI; file. Since the EPS files must be present when the &DVI; file is converted to PS, the EPS files must accompany &DVI; files whenever they are moved.
de: Die EPS-Grafiken werden nicht in die &DVI;-Dateien eingebunden. Da die EPS-Dateien aber für die Umwandlung von &DVI;-Dateien in PS-Dateien benötigt werden, müssen sie immer zusammen mit den &DVI;-Dateien verschoben werden.

source: Now you can call &latex;, and a &DVI;-PS converter like <application>dvips</application> to create your &PostScript; document. If your goal is a PDF document, you should run <command>dvips</command> with option <option>-Ppdf</option> and then call <command>ps2pdf</command>. You will find a lot of documents describing this solution.
de: Nun starten Sie &latex; und ein &DVI;-PS-Umwandlungsprogramm wie <application>dvips</application> erzeugt Ihr &PostScript;-Dokument. Möchten Sie ein PDF-Dokument als Ausgabedatei, benutzen Sie <command>dvips</command> mit der Option <option>-Ppdf</option> und starten dann <command>ps2pdf</command>. Für diese Lösung gibt es viele Informationen.

source: The &PostScript; Way of &kile;
de: Verarbeitung von &PostScript; in &kile;

source: &kile; helps you to get the bounding-box information. If you have installed <ulink url="http://www.imagemagick.org/">&imagemagick;</ulink> package, &kile; will extract this information from the EPS file and insert it as an option. This is done automatically when you select the graphics file. There are two advantages to proceed like this:
de: &kile; hilft Ihnen, die Informationen über die Begrenzungslinien zu ermitteln. Wenn Sie das Paket <ulink url="http://www.imagemagick.org/">&imagemagick;</ulink> installiert haben, kann &kile; diese Information aus der EPS-Datei ermitteln und als Option einfügen. Dies erfolgt automatisch, wenn Sie die Grafikdatei auswählen. Diese Vorgehensweise hat zwei Vorteile:

source: The information is already scanned in the dialog, and need not to be done by &latex; later on.
de: Die Information ist bereits im Dialog eingelesen und muss nicht später von &latex; ermittelt werden.

source: Even more important is that the width and height of the picture can be calculated, when the its resolution is known. This information will be shown near the top of the dialog, and may serve as a clue when you want to scale the graphics.
de: Noch wichtiger ist es, dass die Breite und Höhe des Bildes berechnet werden kann, wenn die Auflösung bekannt ist. Diese Information wird oben im Dialog angezeigt und gibt Ihnen Hinweise bei der Skalierung von Grafiken.

source: &kile; can also support zipped or gzipped EPS files, which are much smaller than uncompressed EPS files. But, this feature can only be used with a special system setup and a change of your local graphics configuration, like it is described in the <link linkend="build_graphics_bitmap">Bitmap Graphics</link> section.
de: &kile; kann auch gepackte EPS-Dateien in den Archivformaten „zip“ und „gzip“ lesen. Diese gepackten Dateien sind erheblich kleiner als nicht komprimierte EPS-Dateien. Diese Funktion kann aber nur mit bestimmten Systemeinstellungen und einer Änderung Ihrer lokalen Grafikeinstellung benutzt werden. Dies wird im Abschnitt <link linkend="build_graphics_bitmap">Bitmap-Grafik</link> erläutert.

source: The &PostScript; Way and Bitmap Graphics
de: &PostScript; und Bitmap-Grafiken

source: If your system allows <userinput>shell-escape</userinput>, &kile; also supports an easy way to include bitmap graphics, if you set up your &tex; system properly. There is no need to convert JPEG or PNG graphics, this can be done automatically when the &DVI; file is converted to PS.
de: Wenn Ihr System die Option <userinput>shell-escape</userinput> unterstützt, können in &kile; mit der richtigen Einstellung des &tex;-Systems Bitmap-Grafiken einfach eingefügt werden. JPEG- oder PNG-Grafikdateien müssen nicht umgewandelt werden, dies erfolgt automatisch, wenn die &DVI;-Datei in das PS-Format umgewandelt wird.

source: &latex; needs some information about the file suffixes. The package <userinput>graphicx</userinput> looks for a file <filename>graphics.cfg</filename>, which must be somewhere in your search path for &latex; documents. Search for entries like:
de: &latex;benötigt Informationen über die Datei-Erweiterungen. Das Paket <userinput>graphicx</userinput> sucht nach einer Datei <filename>graphics.cfg</filename>, die in Ihrem Pfad für &latex;-Dokumente enthalten sein muss. Suchen Sie nach Einträgen wie zum Beispiel:

source: and replace these lines with:
de: und ersetzen Sie diese Zeilen durch:

source: You will find this file, for example in Debian, at <filename>/etc/texmf/latex/graphics.cfg</filename>. The best way to proceed is to copy this file to your local texpath and then change this file. See the yours &tex; distribution manual to learn how to get a list of your &tex; folders.
de: Sie finden diese Datei zum Beispiel in Debian-Systemen unter <filename>/etc/texmf/latex/graphics.cfg</filename>. Am besten kopieren Sie diese Datei in Ihren lokalen Tex-Pfad und ändern dann diese Datei. Lesen Sie im &tex;-Handbuch Ihrer Distribution nach, wie Sie eine Liste der &tex;-Ordner ermitteln können.

source: With this configuration file you are able to insert bitmap graphics and zipped or gzipped EPS files in &latex;. The command for conversion is given by <command>dvips</command>. When you look at the conversion command you will see that no extra file is created. The result of the conversion process is directly piped into the PS file. The only thing &latex; must know is the size of the graphics, and therefore we need the bounding box, which is provided by &kile;.
de: Mit dieser Einrichtungsdatei können Sie Bitmap-Grafiken und komprimierte EPS-Dateien im „zip“- oder „gzip“-Format in &latex; einfügen. Der Befehl für die Umwandlung wird mit <command>dvips</command> angegeben. Dabei werden keine zusätzlichen Dateien erzeugt. Das Ergebnis des Umwandlungsprozesses wird direkt in eine PS-Datei eingefügt. &latex; muss nur die Größe der Grafik kennen. Diese Information ist in den Begrenzungslinien enthalten, die von &kile; aus gelesen wird.

source: Some say that this way is insecure; you have to decide on how to work. In any case, you need no bounding box, as &kile; will extract this information from all types of graphics.
de: Dieses Verfahren wird von einigen Leuten als unsicher eingeschätzt. Auf jeden Fall benötigen Sie die Information über die Begrenzungslinien nicht, &kile; ermittelt diese Information aus allen Grafikformaten.

source: &pdflatex; and EPS Graphics
de: &pdflatex; und EPS-Grafiken

source: As already stated, &pdflatex; is not able to handle EPS graphic files, but converters like <link linkend="build_graphics_epstopdf">epstopdf</link> will help. The best way is to include package <filename>epstopdf</filename>, which must follow the <userinput>graphicx</userinput> package.
de: Wie bereits festgestellt, kann &pdflatex; keine EPS-Grafikdateien verarbeiten, dazu sind Umwandlungsprogramme wie <link linkend="build_graphics_epstopdf">epstopdf</link> nötig. Fügen Sie dazu das Paket <filename>epstopdf</filename> nach dem Paket <userinput>graphicx</userinput> ein.

source: Now you can already include EPS graphics, if you run <command>pdflatex</command> with option <option>--shell-escape</option>, but we can make it even better and also handle zipped or gzipped EPS files. Again we have to change the graphics configuration file <filename>graphics.cfg</filename> like above. This time we search for:
de: Nun können Sie bereits EPS-Grafikdateien einfügen, wenn Sie <command>pdflatex</command> mit der Option <option>--shell-escape</option> aufrufen, aber es ist mit weiteren Anpassungen des Grafiksystems sogar möglich, EPS-Dateien im „zip“- oder „gzip“-Format zu verarbeiten. Dazu muss noch einmal die Datei <filename>graphics.cfg</filename> angepasst werden. Suchen Sie dieses Mal nach:

source: % pdfTeX is running in pdf mode \ExecuteOptions{pdftex}%
de: % pdfTeX läuft im PDF-Modus \ExecuteOptions{pdftex}%

source: and simply add some lines.
de: und fügen einige Zeilen hinzu:

source: % pdfTeX is running in pdf mode \ExecuteOptions{pdftex}% \AtEndOfPackage{% \g@addto@macro\Gin@extensions{.eps.gz,.eps.zip}% \@namedef{Gin@rule@.eps.gz}#1{{pdf}{.pdf}{`gunzip -c #1 | epstopdf -f >\Gin@base.pdf}}% \@namedef{Gin@rule@.eps.zip}#1{{pdf}{.pdf}{`unzip -p #1 | epstopdf -f >\Gin@base.pdf}}% }%
de: % pdfTeX läuft im PDF-Modus \ExecuteOptions{pdftex}% \AtEndOfPackage{% \g@addto@macro\Gin@extensions{.eps.gz,.eps.zip}% \@namedef{Gin@rule@.eps.gz}#1{{pdf}{.pdf}{`gunzip -c #1 | epstopdf -f >\Gin@base.pdf}}% \@namedef{Gin@rule@.eps.zip}#1{{pdf}{.pdf}{`unzip -p #1 | epstopdf -f >\Gin@base.pdf}}% }%

source: With these lines, &pdflatex; is able to handle EPS files, and hopefully there should be no more issues concerning graphics.
de: Mit diesen Zeilen sollte &pdflatex; EPS-Dateien verarbeiten könne, dann gibt es wahrscheinlich keine weiteren Probleme mit Grafiken.

source: Master Document
de: Das Master-Dokument

source: Defining your document as a master allows you to work with separated files, which gives you a parent document (or Master document), and child documents that make up a complete work. After having defined your Master document, with the corresponding command in the <guimenu>Settings</guimenu> menu, all the commands of the <guimenu>Tools</guimenu> menu will apply only to this document, even when you are working on the child documents. You can even close the Master document.
de: Definieren Sie ein Dokument als Master, dann können Sie mit einzelnen Dateien arbeiten. Dann besteht das gesamte Projekt aus dem Master-Dokument und untergeordneten Teildokumenten. Haben Sie mit dem Menüeintrag in <guimenu>Einstellungen</guimenu> das aktuelle Dokument als Master-Dokument festgelegt, betreffen alle Befehle aus dem Menü <guimenu>Erstellen</guimenu> nur dieses Dokument, auch wenn Sie in Teildokumenten arbeiten. Sie können sogar das Master-Dokument schließen und trotzdem weiter arbeiten.

source: Error Handling
de: Fehlerbehandlung

source: After you have compiled something, &kile; takes a look at the error messages that were generated. If there are any errors or warnings, they will be briefly reported in the <guilabel>Log and Messages</guilabel> window. One can take a closer look at the messages by selecting <menuchoice><guimenu>Build</guimenu><guimenuitem>View Log File</guimenuitem></menuchoice>, or by using the keyboard shortcut <keycombo>&Alt;<keycap>0</keycap></keycombo>. The generated log is then displayed in the <guilabel>Log and Messages</guilabel> view; errors and warnings are highlighted.
de: Wenn Sie ein Dokument kompiliert haben und dabei Fehler oder Warnungen aufgetreten sind, wird eine Zusammenfassung im Fenster <guilabel>Protokoll und Meldungen</guilabel> angezeigt. Um alle Ausgaben des Kompiliervorgangs zu anzusehen, wählen Sie <menuchoice><guimenu>Erstellen</guimenu><guimenuitem>Protokoll ansehen</guimenuitem></menuchoice> oder benutzen Sie den Kurzbefehl <keycombo>&Alt;<keycap>0</keycap></keycombo>. In der Ausgabe werden alle Fehler und Warnungen hervorgehoben.

source: <screeninfo>Viewing the log</screeninfo>
de: <screeninfo>Ansicht des Protokolls</screeninfo>

source: <phrase>Viewing the log</phrase>
de: <phrase>Ansicht des Protokolls</phrase>

source: <para>Viewing the log</para>
de: <para>Ansicht des Protokolls</para>

source: You can easily jump from one message in the log file to another by using the <menuchoice><guimenu>Build</guimenu><guimenuitem>Next / Previous LaTeX Error / Warning</guimenuitem></menuchoice> menu items, or by using the corresponding toolbar buttons.
de: In der Protokolldatei können Sie von einer Nachricht zur Nächsten springen, indem Sie die Menüeinträge <menuchoice><guimenu>Erstellen</guimenu><guimenuitem>Nächster / Vorheriger LaTeX-Fehler</guimenuitem><guimenuitem>Nächste / Vorherige LaTeX-Warnung</guimenuitem></menuchoice> oder die zugehörigen Aktionen aus der Werkzeugleiste verwenden.

source: To jump to the line in the &latex; source where the error or warning occurred, click on the error or warning in the <guilabel>Log and Messages</guilabel> view. &kile; will take you automatically to the offending line.
de: Um zur Zeile im &latex;-Quelltext zu gehen, der den Fehler oder die Warnung verursacht hat, klicken Sie auf den Fehler oder die Warnung im der Ansicht <guilabel>Protokoll und Nachrichten</guilabel>. Dann springt der Cursor zur zugehörigen Quelltextzeile.

source: The Watch File Mode
de: Der Dateiüberwachungsmodus

source: When you launch the <guibutton>Quickbuild</guibutton> command, a viewer of some sort will normally be called after the compilation. If you are not using an embedded viewer, a new window will be opened every time.
de: Bei Verwendung des Befehls <guibutton>Schnellbau</guibutton> wird normalerweise ein Betrachter nach dem Kompilieren aufgerufen. Sollte kein eingebundener Betrachter verwendet werden, so wird sich jedesmal ein neues Fenster öffnen.

source: If you are adjusting the look of your document, you might launch <guibutton>Quickbuild</guibutton> very often, and have many viewer windows open on your desktop; to avoid this confusion, you can activate the <guibutton>Watch file</guibutton> mode, that will prevent <guibutton>Quickbuild</guibutton> from launching a viewer.
de: Wenn Sie das Erscheinungsbild Ihres Dokuments anpassen, werden Sie sehr häufig die <guibutton>Schnellvorschau</guibutton> verwenden und damit viele Anzeigeprogrammfenster auf Ihrer Arbeitsfläche öffnen und leicht die Übersicht verlieren. Um das zu verhindern, können Sie den <guibutton>Dateiüberwachungsmodus</guibutton> aktivieren, dann wird in der <guibutton>Schnellvorschau</guibutton> kein Anzeigeprogrammfenster geöffnet.

source: This mode is of course useless with the embedded viewers, as you have to close them anyway to get back to editing the document and recompiling.
de: Dieser Modus ist natürlich nicht sinnvoll für eingebettete Betrachter, da Sie sie auf jeden Fall schließen müssen, um zurück zur Bearbeitung des Dokuments zu kommen und wieder zu kompilieren.

source: Navigating the &latex; Source
de: Navigieren im &latex;-Quelltext

source: <title>Using the Structure View</title>
de: <title>Verwendung der Strukturansicht</title>
