Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/extragear-office/kile.po
Languages: de

source: Forward Search
de: Vorwärtssuche

source: When using inverse search, the selection of items in the &DVI; or PDF file is associated with the editor, so when you click on the &DVI; or PDF file, the main window jumps to the corresponding section of &latex; code in the editor. Forward search is the exact opposite of this. Forward search will allow you to click on a specific section of text in the &latex; code, and jump to the associated position in the viewer window.
de: Bei Verwendung der Rückwärtssuche sind die Elemente der <filename>&DVI;</filename>- oder PDF-Datei mit dem Editor verknüpft und sobald auf ein Element in der <filename>&DVI;</filename>- oder PDF-Datei geklickt wurde, wird zum dazugehörigen Abschnitt im &latex;-Quelltext gesprungen. Die <emphasis>Vorwärtssuche</emphasis> ist das genaue Gegenteil davon. Sobald auf einen Abschnitt im &latex;-Quelltext geklickt wurde, wird zur entsprechenden Stelle im Betrachter gesprungen.

source: The Toolbar
de: Die Werkzeugleiste

source: <guibutton>New</guibutton>: begin a new document.
de: <guibutton>Neu</guibutton>: Hiermit kann ein neues Dokument erstellt werden.

source: <guibutton>Open</guibutton>: open a new document.
de: <guibutton>Öffnen</guibutton>: Zur Öffnung eines gespeicherten Dokuments.

source: <guibutton>Close</guibutton>: close your document.
de: <guibutton>Schließen</guibutton>: Das aktuelle Dokument wird geschlossen.

source: <guibutton>Define document as master</guibutton>: this is used when working with multiple files. Having a master document will let you work more easily with other <literal role="extension">.tex</literal> files included in your document. If you are using projects, you can also set in <menuchoice><guimenu>Project-></guimenu><guisubmenu>Project Options</guisubmenu></menuchoice> a project-wide master document.
de: <guibutton>Master-Dokument</guibutton>: Diese Funktion wird bei der Arbeit mit mehreren Dateien verwendet. Mit einem Master-Dokument wird die Arbeit mit anderen eingebunden <filename>.tex</filename>-Dateien vereinfacht. Bei der Verwendung eines Projekts kann ein projektweites Master-Dokument über <menuchoice><guimenu>Projekt</guimenu><guisubmenu>Projekteinstellungen</guisubmenu></menuchoice> eingestellt werden.

source: <guibutton>Quickbuild</guibutton>: compiles your &latex; source code and displays the results automatically unless there are errors contained in the document.
de: <guibutton>Schnellbau</guibutton>: Der &latex;-Quelltext wird kompiliert und das Ergebnis automatisch angezeigt, sofern keine Fehler im Quelltext vorliegen.

source: <guibutton>Watch file mode</guibutton>: this mode will "watch" the &DVI; file for changes, and will not launch a new session of &okular; after <guibutton>Quickbuild</guibutton>.
de: <guibutton>Dateiüberwachungsmodus</guibutton>: In diesem Modus wird die <filename>&DVI;</filename>-Datei auf Änderungen „überwacht“ und es erfolgt kein Aufruf von &okular; nach dem <guibutton>Schnellbau</guibutton>.

source: <guibutton>View logfile</guibutton>: views the <literal role="extension">.log</literal> file, so you can spot errors.
de: <guibutton>Protokoll ansehen</guibutton>: Die Protokolldatei wird zur Fehlersuche angezeigt.

source: <guibutton>Previous error</guibutton>: jumps backward through the <literal role="extension">.log</literal> file and highlights errors in the source.
de: <guibutton>Vorheriger Fehler</guibutton>: Springt zum vorhergehenden Fehler innerhalb der Protokolldatei (<filename>.log</filename>-Datei) und hebt die Fehler im Quelltext hervor.

source: <guibutton>Next error</guibutton>: jumps forward through <literal role="extension">.log</literal> file and highlights errors in the source.
de: <guibutton>Nächster Fehler</guibutton>: Springt zum nächsten Fehler innerhalb der Protokolldatei (<filename>.log</filename>-Datei) und hebt die Fehler im Quelltext hervor.

source: <guibutton>Stop</guibutton>: halts current tool.
de: <guibutton>Anhalten</guibutton>: Das aktuelle Werkzeug wird angehalten.

source: <guibutton>LaTeX</guibutton>: runs &latex; on the active document.
de: <guibutton>LaTeX</guibutton>: &latex; wird auf das aktuelle Dokument angewendet.

source: <guibutton>ViewDVI</guibutton>: launches &DVI; viewer.
de: <guibutton>DVI-Betrachter</guibutton>: Startet den <filename>&DVI;</filename>-Betrachter.

source: <guibutton>DVItoPS</guibutton>: converts a &DVI; to a &PostScript; (PS).
de: <guibutton>DVI zu PS</guibutton>: Wandelt eine <filename>&DVI;</filename>-Datei in eine &PostScript;-Datei (<filename>PS</filename>) um.

source: <guibutton>ViewPS</guibutton>: launches &PostScript; (PS) viewer.
de: <guibutton>PS-Betrachter</guibutton>: Startet den &PostScript;-Betrachter.

source: <guibutton>PDFLaTeX</guibutton>: runs &pdflatex; on the active document.
de: <guibutton>PDFLaTeX</guibutton>: &pdflatex; wird auf das aktuelle Dokument angewendet.

source: <guibutton>ViewPDF</guibutton>: launches the PDF viewer.
de: <guibutton>PDF-Betrachter</guibutton>: Startet den PDF-Betrachter.

source: <guibutton>DVItoPDF</guibutton>: converts a &DVI; to a PDF.
de: <guibutton>DVI zu PDF</guibutton>: Wandelt eine <filename>&DVI;</filename>-Datei in eine <filename>PDF</filename>-Datei um.

source: <guibutton>PStoPDF</guibutton>: converts a PS to a PDF.
de: <guibutton>PS zu PDF</guibutton>: Wandelt eine <filename>PS</filename>-Datei in eine <filename>PDF</filename>-Datei um.

source: <guibutton>ViewHTML</guibutton>: views &HTML; created.
de: <guibutton>HTML-Betrachter</guibutton>: Zeigt erstellte <filename>&HTML;</filename>-Dateien an.

source: <guibutton>ForwardDVI</guibutton>: jump to page of the &DVI; file that corresponds to the current line in the editor.
de: <guibutton>DVI-Vorwärtssuche</guibutton>: Springt zu der Seite der &DVI;-Datei, die zur aktuellen Zeile im Editor gehört.

source: <guibutton>ForwardPDF</guibutton>: jump to page of the PDF file that corresponds to the current line in the editor.
de: <guibutton>PDF-Vorwärtssuche</guibutton>: Springt zu der Seite der PDF-Datei, die zur aktuellen Zeile im Editor gehört.

source: If you look at the <guilabel>Edit</guilabel> toolbar, you will notice three large drop-down menus. The drop-down menus were designed for you to be able to quickly add certain common features into your document. The first drop down box is used for quickly dividing your document by parts, chapter, sections and so on; the available commands to add segments to your &latex; source code are:
de: Bei Betrachtung der <guilabel>Bearbeiten</guilabel>-Werkzeugleiste sollten die drei großen Auswahlfelder auffallen. Die Auswahlfelder wurden für das schnelle Einfügen gemeinsamer Elemente in das Dokument entwickelt. Das erste Auswahlfeld ist für die schnelle Gliederung des Dokuments in Teile, Kapitel, Abschnitte, ... Die verfügbaren &latex;-Befehle für die Unterteilung sind:

source: <guilabel>part</guilabel>: highest level of sectioning for a document.
de: <guilabel>Teil</guilabel>: Höchste Ebene der Gliederung eines Dokuments.

source: <guilabel>chapter</guilabel>: starts a new chapter.
de: <guilabel>Kapitel</guilabel>: Beginnt ein neues Kapitel.

source: <guilabel>section</guilabel>: create a new section.
de: <guilabel>Abschnitt</guilabel>: Beginnt einen neuen Abschnitt.

source: <guilabel>subsection</guilabel>: create a new subsection.
de: <guilabel>Unterabschnitt</guilabel>: Beginnt einen neuen Unterabschnitt.

source: <guilabel>subsubsection</guilabel>: a secondary section between subsection and paragraph.
de: <guilabel>Unter-Unterabschnitt</guilabel>: Eine zweite Unterteilung zwischen Unterabsatz und Paragraf.

source: <guilabel>paragraph</guilabel>: create a new paragraph.
de: <guilabel>Paragraf</guilabel>: Beginnt einen neuen Paragraf.

source: <guilabel>subparagraph</guilabel>: create a new subparagraph.
de: <guilabel>Unterabsatz</guilabel>: Beginnt einen neuen Unterabsatz.

source: The drop down box named <guilabel>Other</guilabel> is used to insert items to your document such as indexes, footnotes, and references; the available commands are:
de: Das Auswahlfeld <guilabel>Weitere</guilabel> ist zum Einfügen von Artikeln wie z. B. Stichworte, Fußnoten oder Verweise. Die verfügbaren Möglichkeiten sind:

source: <guilabel>label</guilabel>: a command that produces a label for a chapter, a figure or another element.
de: <guilabel>Bezeichnung</guilabel>: Mit diesem Befehl wird eine Bezeichnung für einen Abschnitt, ein Bild oder anders Element erstellt.

source: <guilabel>index</guilabel>: creates an entry for the index.
de: <guilabel>Stichwort</guilabel>: Erstellt einen Eintrag im Stichwortverzeichnis.

source: <guilabel>footnote</guilabel>: creates a footnote in your document.
de: <guilabel>Fußnote</guilabel>: Erstellt eine Fußnote im Dokument.

source: <guilabel>ref</guilabel>: used to refer to a predefined label, which you can choose from a drop-down list.
de: <guilabel>Bezug</guilabel>: Wird für den Verweis auf eine festgelegte Bezeichnung verwendet (Auswahl über ein Auswahlfeld möglich).

source: <guilabel>pageref</guilabel>: just like <guilabel>ref</guilabel>, but refers to a page instead of a structure element.
de: <guilabel>Seitenbezug</guilabel>: Im Unterschied zu <guilabel>Bezug</guilabel> erfolgt der Verweis auf eine Seite und nicht auf ein Strukturelement.

source: <guilabel>cite</guilabel>: create a reference with data from a bibliography.
de: <guilabel>Zitat</guilabel>: Erstellt einen Verweis mit Daten anderer Schriftstücke.

source: <screeninfo>The <guilabel>Other</guilabel> drop-down menu</screeninfo>
de: <screeninfo>Das Auswahlfeld <guilabel>Weitere</guilabel></screeninfo>

source: <phrase>The <guilabel>Other</guilabel> drop-down menu</phrase>
de: <phrase>Das Auswahlfeld <guilabel>Weitere</guilabel></phrase>

source: <para>The <guilabel>Other</guilabel> drop-down menu</para>
de: <para>Das Auswahlfeld <guilabel>Weitere</guilabel></para>

source: <screeninfo>Selecting the label for a reference</screeninfo>
de: <screeninfo>Auswahl des Labels für einen Bezug</screeninfo>

source: <phrase>Selecting the label for a reference</phrase>
de: <phrase>Auswahl des Labels für einen Bezug</phrase>

source: <para>Selecting the label for a reference</para>
de: <para>Auswahl des Labels für einen Bezug</para>

source: When using <guilabel>cite</guilabel>, you are presented with a drop-down list of bibitems, but if you are using &bibtex; this will only work if the file belongs to a Project. For editing &bibtex; files the usage of specialised editors is recommended. The author has made good experience with &kbibtex; and &kbib;. Of course you can also write the &bibtex; files by hand inside &kile;.
de: Beim Verwenden von <guilabel>Zitat</guilabel> wird eine Auswahlliste mit literarischen Einträgen angezeigt. Bei &bibtex; funktioniert dies nur, wenn die Datei zu einem Projekt gehört. Für das Bearbeiten von &bibtex;-Dateien sind entsprechende Editoren notwendig. Der Autor hat gute Erfahrungen mit &kbibtex; und &kbib;. Die &bibtex;-Dateien können natürlich auch in &kile; von Hand geschrieben werden.

source: The last drop-down box labeled <guilabel>tiny</guilabel> is used to set the size of the text. You can set the size of the main text, of footnotes, and so on. The available commands are:
de: Das letzte Auswahlfeld mit dem Namen <guilabel>Größe</guilabel> wird für die Festlegung der Schriftgröße verwendet. Es können die Schriftgrößen für den Haupttext, die Fußnoten usw. festgelegt werden. Es stehen folgende Schriftgrößen zur Verfügung:

source: <guilabel>tiny</guilabel>: smallest.
de: <guilabel>Winzig klein</guilabel>: Die kleinste Schriftgröße.

source: <guilabel>scriptsize</guilabel>: very small.
de: <guilabel>Sehr klein (wie Indizes)</guilabel>: Eine sehr kleine Schriftgröße.

source: <guilabel>footnotesize</guilabel>: smaller.
de: <guilabel>Kleiner (wie Fußnoten)</guilabel>: Eine kleinere Schriftgröße (in Fußnotengröße).

source: <guilabel>small</guilabel>: small.
de: <guilabel>Klein</guilabel>: Eine kleine Schriftgröße.

source: <guilabel>normalsize</guilabel>: normal.
de: <guilabel>Normal</guilabel>: Die normale Schriftgröße.

source: <guilabel>large</guilabel>: large.
de: <guilabel>Groß</guilabel>: Eine große Schriftgröße.

source: <guilabel>Large</guilabel>: larger.
de: <guilabel>Größer</guilabel>: Eine größere Schriftgröße.

source: <guilabel>LARGE</guilabel>: even larger.
de: <guilabel>Sehr groß</guilabel>: Eine sehr große Schriftgröße.

source: <guilabel>huge</guilabel>: still larger.
de: <guilabel>Riesig</guilabel>: Eine noch größere Schriftgröße.

source: <guilabel>Huge</guilabel>: largest.
de: <guilabel>Gigantisch</guilabel>: Die größte Schriftgröße.

source: Quickstart
de: Schnelleinstieg

source: Writing a &latex; Document with &kile; for Beginners
de: Anfängerkurs zur Erstellung eines &latex;-Dokuments in &kile;

source: Users of &kile; have two choices when starting a new document: they can use the <guimenu>Wizard</guimenu> to begin a new document, select the type of document they would like to create and options such as font size, paper size, and so on; otherwise, they can write the code by hand.
de: Beim Aufruf von &kile; stehen zwei Auswahlmöglichkeiten zur Verfügung: 1. Der <guimenu>Assistent</guimenu> für die Erstellung eines neuen Dokuments durch Auswahl der Dokumentenart und Festlegend der Einstellungen. 2. Das Dokument kann von Grund auf mit der Hand geschrieben werden.

source: \documentclass[12pt]{article} \begin{document} Here is a bunch of text coded in \LaTeX. \end{document}
de: \documentclass[12pt]{article} \begin{document} Ein Beispieltext (in LaTeX). \end{document}

source: Every document in &latex; begins with the command <userinput> \documentclass[optional argument]{class}</userinput>, where class specifies the document type.
de: Jedes &latex;-Dokument beginnt mit dem Befehl <userinput>\documentclass[Einstellung]{Klasse}</userinput>, wobei <userinput>{Klasse}</userinput> die Dokumentenart festlegt.

source: Typing in the code example above from the text box gives you the following output:
de: Durch Eingabe des obigen Quelltext-Beispiels wird die folgende Ausgabe erreicht:

source: <screeninfo>Compiled text in &DVI; output</screeninfo>
de: <screeninfo>Kompilierter Text in der <filename>&DVI;</filename>-Ausgabe</screeninfo>

source: <phrase>Compiled text in &DVI; output</phrase>
de: <phrase>Kompilierter Text in der <filename>&DVI;</filename>-Ausgabe</phrase>

source: <para>Compiled text in &DVI; output</para>
de: <para>Kompilierter Text in der <filename>&DVI;</filename>-Ausgabe</para>

source: The brackets that come after the command <userinput>\documentclass</userinput> contain the options for the command. The option <userinput>[12pt]</userinput> sets the size of the font for your article; if you do not set the font size in the beginning, you can set it later in the text.
de: Die Klammern nach dem Befehl <userinput>\documentclass</userinput> enthalten die Einstellungen für den Befehl. Die Einstellung <userinput>[12pt]</userinput> legt die Schriftgröße fest. Wird die Schriftgröße nicht zu Beginn festgelegt, kann dies auch später im Text geschehen.

source: Once you have typed in the code example from the box above, you will need to compile your &latex; source code. The easiest way for you to compile &latex; is to use the <guimenu>Build</guimenu> menu, or using the <guilabel>Quickbuild</guilabel> button.
de: Sobald das obige Quelltext-Beispiel eingegeben wurde muss der &latex;-Quelltext kompiliert werden. Der einfachste Weg hierzu ist die Verwendung des Menüs <guimenu>Bauen</guimenu> oder des Knopfs <guilabel>Schnellbau</guilabel>.

source: <keycombo>&Alt;<keycap>2</keycap></keycombo> is the keyboard shortcut to compile your source code.
de: <keycombo>&Alt;<keycap>2</keycap></keycombo> ist das Tastaturkürzel für das Kompilieren des Quelltextes.

source: You have to save your source code before you can compile; &kile; will do this automatically for you.
de: Der Quelltext muss vor dem Kompilieren gespeichert werden. &kile; führt die Speicherung automatisch aus.

source: If your document did not compile, check the log for errors. When using the <guilabel>Quickbuild</guilabel> key, the &okular; viewer should be launched automatically; if it does not, look at the log.
de: Schlägt das Kompilieren des Dokuments fehl, sollte in der Protokolldatei nach den Fehlern gesucht werden. Bei Verwendung von <guilabel>Schnellbau</guilabel> sollte &okular; automatisch gestartet werden. Ist dies nicht der Fall, sollte ebenfalls die Protokolldatei beachtet werden.

source: Environments
de: Umgebungen

source: An environment is a segment of text that is managed differently than the rest of the document. For example, you create a report with font size 12, but you need to change your font size for a few sentences. The commands <userinput>\begin{environment}</userinput>, <userinput>\huge</userinput> and <userinput>\end{environment}</userinput> will let you temporarily alter the text inside the environment commands to be size huge.
de: Eine Umgebung (engl. environment) ist ein Text, der anders als das restliche Dokument behandelt wird. Wird beispielsweise ein Bericht mit der Schriftgröße 12 erstellt und nur ein paar Sätze sollen eine andere Schriftgröße haben. Der Befehl <userinput>\begin{environment}</userinput>, <userinput>\huge</userinput> und <userinput>\end{environment}</userinput> ermöglicht sodann die Änderung der Schriftgröße innerhalb der Umgebung zu „Riesig“ (engl. huge).

source: Changes are only effective from <userinput>\begin{environment}</userinput> to <userinput>\end{environment}</userinput>. There are no limits as how many changes you can make inside an environment.
de: Die Änderungen werden lediglich innerhalb der Umgebung (von <userinput>\begin{environment}</userinput> bis <userinput>\end{environment}</userinput>) berücksichtigt. Es gibt keine Beschränkung (Anzahl) für die Änderungen innerhalb einer Umgebung.

source: There are many features you can add to your document that will make it more readable and user-friendly. You can add features such as specific fonts, bold, italics, underline &etc; to your document, and these commands will end with either an <userinput>\end</userinput> command, or at the end of your environment.
de: Es gibt viele Möglichkeiten zur Erhöhung der Lesbarkeit und Benutzerfreundlichkeit des Dokuments. Es können beispielsweise bestimmte Schriftarten, Fettdruck, Kursivdruck, Unterstreichungen, usw. hinzugefügt werden. Diese Befehle enden entweder mit dem Befehl <userinput>\end</userinput> oder automatisch am Ende der Umgebung.

source: <userinput>\begin{emph}</userinput>: this command makes text italicized, and is valid until the code comes across a <userinput>\end{emph}</userinput>, or another environment. To italicize one word in a sentence, you can use the syntax: this is <userinput>\emph{my}</userinput> sentence.
de: <userinput>\begin{emph}</userinput>: Dieser Befehl ist für den <emphasis>Kursivdruck</emphasis> und ist solange gültig, bis er mit einem <userinput>\end{emph}</userinput> oder einer anderen Umgebung geschlossen wird. Ein einzelnes Wort in einem Satz kann mit <userinput>\emph{Wort}</userinput> kursiv dargestellt werden.

source: <userinput>\textbf{I am making this text inside the brackets bold}</userinput>: this command makes your text bold.
de: <userinput>\textbf{Fettgedruckter Text}</userinput>: Dieser Befehl ist für den Fettdruck.

source: <userinput>\quote</userinput>: to create a quote inside your document; begin your quote with <userinput>\begin{quote}</userinput> and end it with <userinput>\end{quote}</userinput>.
de: <userinput>\quote</userinput>: Erstellt ein Zitat im Dokument. Das Zitat beginnt mit <userinput>\begin{quote}</userinput> und endet mit <userinput>\end{quote}</userinput>.

source: <userinput>\center</userinput>: centers the text.
de: <userinput>\center</userinput>: Zentriert den Text.

source: <userinput>\verse</userinput>: creates offset text for poems.
de: <userinput>\verse</userinput>: Erstellt einen Absatz für Gedichte.

source: <userinput>\itemize</userinput>: makes an itemized list.
de: <userinput>\itemize</userinput>: Erstellt eine Strich-Aufzählung.

source: Using &kile;
de: &kile; verwenden

source: Now that we have given you some background about how to write code using the &latex; markup language, we will show you how to create a document using &kile; step-by-step.
de: Nachdem der Hintergrund zum Schreiben des Quelltextes mit der &latex;-Auszeichnungssprache dargestellt wurde, folgt nun eine Schritt-für-Schritt-Anleitung für die Erstellung eines Dokuments in &kile;.

source: Start &kile;.
de: &kile; aufrufen.

source: Select <menuchoice><guimenu>Wizard</guimenu><guimenuitem>Quick Start</guimenuitem></menuchoice>, then choose a format, and set your preferences in the wizard.
de: Im Menü <menuchoice><guimenu>Assistent</guimenu><guimenuitem>Schnellstart</guimenuitem></menuchoice> aufrufen, das Format auswählen und die Einstellungen festlegen.

source: Once the wizard has entered text, do some customization to make the document more readable, add a minimum of one quote, some bold text, italics, and a verse to see the difference between the commands.
de: Sobald im Assistenten ein bisschen Text eingegeben wurde, sollten ein paar Anpassungen für die bessere Lesbarkeit des Dokuments vollzogen werden. Hierzu sollten mindestens ein Zitat, ein paar Stellen im Fett- und Kursivdruck und ein Gedicht zur Anwendung kommen, um die Unterschiede dieser Befehle zu sehen.

source: Save your file, and give it the name <filename>intro.tex</filename>.
de: Die Datei unter dem Namen <filename>intro.tex</filename> speichern.

source: Build your document using <keycombo>&Alt;<keycap>2</keycap></keycombo>, or the button labeled <guilabel>LaTeX</guilabel>.
de: Das Dokument mittels Tastenkürzel <keycombo>&Alt;<keycap>2</keycap></keycombo> oder Knopf <guilabel>LaTeX</guilabel> bauen.

source: Select <guibutton>ViewDVI</guibutton>.
de: <guibutton>DVI-Betrachter</guibutton> auswählen.

source: Check out all your new text.
de: Jetzt kann der neue Text betrachtet werden.

source: When you are done viewing your document, click the <guibutton>Editor View</guibutton> button or press <keycombo>&Ctrl;<keycap>E</keycap></keycombo> to return to the editor if you are using the embedded viewer, or close the viewer window if you are using a separate viewer.
de: Sobald das Dokument angesehen wurde, kann mittels <guibutton>Editor-Ansicht</guibutton> oder <keycombo>&Ctrl;<keycap>E</keycap></keycombo> wieder zum Editor zurückgekehrt werden (beim internen Betrachter). Bei einem externen Betrachter muss dessen Fenster geschlossen werden.

source: That's it! You have just created your first &latex; document!
de: Das ist es - Das erste &latex;-Dokument ist erstellt.

source: Once you have created your &DVI;, you will be able to print your document, or change it into a &PostScript; or PDF file if you want. Experiment and have fun!
de: Sobald die <filename>&DVI;</filename>-Datei erstellt wurde, kann das Dokument ausgedruckt oder in eine &PostScript;/<filename>PDF</filename>-Datei umgewandelt werden. Einfach ausprobieren und Spaß haben.

source: &DVI; Files
de: <filename>&DVI;</filename>-Dateien
