Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/extragear-office/kile.po
Languages: de

source: The &kile; Handbook
de: Das Handbuch zu &kile;

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Johannes</firstname><surname>Obermayr</surname><affiliation><address><email>johannesobermayr@gmx.de</email></address></affiliation><contrib>Übersetzung</contrib></othercredit>

source: May 22, 2011
de: 22.Mai 2011

source: &kile; is a &tex; and &latex; source editor and shell.
de: &kile; ist ein Quelltext-Editor und Baukasten für &tex; und &latex;.

source: kdenonbeta
de: kdeextragear

source: Preface
de: Einleitung

source: Requirements
de: Voraussetzungen

source: To run &kile;, you need to have the following components installed on your system:
de: Um &kile; zu benutzen, müssen folgende Komponenten auf dem System installiert sein:

source: <ulink url="http://www.kde.org/">K Desktop environment (&kde;)</ulink>: &kde; is a popular open-source desktop environment.
de: <ulink url="http://www.kde.org/">K Desktop Environment (&kde;)</ulink>: &kde; ist eine bekannte quelloffene Arbeitsflächenumgebung.

source: <ulink url="http://www.qtsoftware.com/products/">&Qt;</ulink>: &Qt; is a C++ &GUI; and network library needed to compile &kile;.
de: <ulink url="http://www.trolltech.com/products/qt/">&Qt;</ulink>: &Qt; ist eine Bibliothek für C++ zur Erstellung von grafischen Benutzeroberflächen und Netzwerkunterstützung und wird zum Kompilieren von &kile; benötigt.

source: <ulink url="http://www.ctan.org/">&latex;</ulink>: high-quality document typesetting program. Most likely you want the &texlive; (or on older systems the &tetex;) package, if you are on a Unix-like system.
de: <ulink url="http://www.ctan.org/">&latex;</ulink>: Eine professionelle Schriftsetzungs-Anwendung. Unter Unix-artigen Systemen wird wahrscheinlich auf das Paket &texlive; bzw. &tetex; (für ältere Systeme) zurückgegriffen.

source: Most of these items might be included in your &Linux; distribution; please refer to your distribution documentation, or refer to your installation &CD; or DVD, for adding these packages to your computer.
de: Die meisten dieser Komponenten können in der verwendeten &Linux;-Distribution enthalten sein. Für die Installation sollte die Dokumentation der Distribution bzw. Installations-&CD;/DVD herangezogen werden.

source: &kile; might also be available as a pre-compiled package for your &Linux; distribution already. Please check with the package manager of your distribution.
de: &kile; ist möglicherweise bereits als kompiliertes Paket in Ihrer &Linux;-Distribution enthalten. Suchen Sie nach &kile; mit dem Paketverwaltungsprogramm Ihrer Distribution.

source: Intended Audience
de: Zielgruppe

source: This manual is intended for any individual, regardless of her or his experience with &latex;, &kde;, &kile; or &Linux;.
de: Dieses Handbuch ist für jedermann - unabhängig von den Erfahrungen mit &latex;, &kde;, &kile; oder &Linux;.

source: Advanced users are not likely to read this manual, but all suggestions on documentation will be considered. If you would like to contribute to this project or the documentation, please consult the <ulink url="http://kile.sourceforge.net/">&kile; web page</ulink>.
de: Fortgeschrittene Anwender müssen diese Handbuch wohl kaum lesen. Es werden jedoch alle Vorschläge zur Dokumentation berücksichtigt. Ist die Unterstützung zu diesem Projekt oder dessen Dokumentation gewünscht, sollte der Kontakt über die <ulink url="http://kile.sourceforge.net/">&kile;-Webseite</ulink> hergestellt werden.

source: Do you need answers about &kile;? Are you stuck with the compilation process? Do you want to see a new feature implemented? The preferred way to ask technical questions or to start a discussion is to use our mailing list: <email>kile-devel@lists.sourceforge.net</email>.
de: Haben Sie Fragen zu &kile;? Treten beim Kompilieren von &kile; Fehler auf? Möchten Sie neue Funktionen hinzugefügt haben? Alle diese technischen Fragen sollten auf der Mailingliste <email>kile-devel@lists.sourceforge.net</email> angesprochen werden.

source: Introduction
de: Einleitung

source: Basic facts
de: Grundsätzliches

source: About &kile;
de: Über &kile;

source: &kile; is an integrated &latex; environment for the &kde; desktop. &kile; gives you the ability to use all the functionalities of &latex; in a graphical interface, giving you easy, immediate, and customized access to all programs for &latex; code-completion, compiling, postprocessing, debugging, conversion and viewing tools; you also get very handy wizards, a &latex; reference and a powerful project management.
de: &kile; ist eine integrierte &latex;-Umgebung für die &kde;-Arbeitsfläche. &kile; bietet die Möglichkeit zur Nutzung aller &latex;-Funktionen in einer grafischen Oberfläche und innerhalb dieser einen einfachen, unmittelbaren und maßgeschneiderten Zugang zu allen &latex;-Programmen. Des Weiteren bietet &kile; die Möglichkeit zum Vervollständigen, Kompilieren, Nachbearbeiten und Fehlersuchen innerhalb des Quelltextes sowie Umwandlungs- und Ansichtswerkzeuge für diesen. Abschließend genannt werden müssen der leicht zu bedienende Assistent, die &latex;-Referenz und die vielseitige Projektverwaltung.

source: &kile; and the &kate; Editor Component
de: &kile; und die &kate;-Editorkomponente

source: &kile; is based on the &kate; editor component, i.e. a lot of its editing capabilities stem from the &kate; editor component itself. &kile; extends these capabilities with features to edit &latex; documents. To learn more about the &kate; editor component and its capabilities, see the <ulink url="http://kate-editor.org">&kate; webpage</ulink>.
de: &kile; verwendet die &kate;-Editorkomponente, deshalb sind die meisten Editiermöglichkeiten von &kate; geerbt und &kile; erweitert diese Möglichkeiten, um &latex; Dokumente zu bearbeiten. Um mehr über die &kate;-Editorkomponente und seine Fähigkeiten zu erfahren, sollten Sie die <ulink url="http://kate-editor.org">&kate;-Webseite</ulink> lesen.

source: What is &latex;?
de: Was ist &latex;?

source: &latex; is a text-processing system derived from &tex;, a program developed originally in 1977 by Donald Knuth to help layout text in a professional way and obtain a layout quality that is on par with the work of a professional typesetter. &latex; was created by Leslie Lamport to give authors an automatic typesetter, especially to ease the expensive and painstaking process of typesetting of mathematical formulas and expressions, which are enclosed within dollar signs in &latex; <emphasis>for a reason</emphasis>. Today, word-processing programs let any user act as typesetter, but what is often needed is a document that simply looks good without having to spend hours to bring it into shape. &latex; takes that burden on its shoulders, and lets you concentrate on the document instead of on the layout. And yes, it <emphasis>will</emphasis> look good!
de: &latex; ist ein Textverarbeitungssystem, das von &tex; abstammt. &tex; wurde ursprünglich im Jahr 1977 von Donald Knuth entwickelt, um ihn bei der professionellen Gestaltung seiner Arbeit zu unterstützen und dabei Ergebnisse wie im professionellen manuellen Schriftsatz zu erreichen. &latex; wurde von Leslie Lamport entwickelt, um Autoren einen automatisierten Schriftsatz zu bieten (insbesondere für das teure und mühsame Setzen von mathematischen Formeln und Ausdrücken, die daher von Dollar-Zeichen (<keycap>$</keycap>) in &latex; eingeschlossen sind). Heutzutage können Anwender mit Textverarbeitungsprogrammen Dokumente im Schriftsatz erstellen. Jedoch wird oftmals ein Dokument mit einem <emphasis>guten Aussehen</emphasis> gewünscht, ohne dass hierfür mehrere Stunden benötigt werden. &latex; übernimmt diese Aufgabe und lässt dem Autor die Zeit, um sich über den Inhalt und nicht das Aussehen des Dokuments Gedanken zu machen. <emphasis>Ja - es wird gut aussehen ...</emphasis>

source: How do you pronounce it? Why that strange typesetting?
de: Aussprache der <emphasis>seltsamen Schriftsetzung</emphasis>

source: There is a funny tradition of &tex;-related packages to have the strangest pronunciation and typesetting possible. &tex; was supposed to be brought in from the Greek <emphasis>τεχ</emphasis>, in Latin letters <emphasis>tech</emphasis>. There are a lot of explanations why, but most likely it is because &tex; was originally conceived for technical reports, and indeed its foremost ability was the correct and easy typesetting of mathematical formulae, then an extremely expensive, time-consuming and frustrating business.
de: Es ist eine lustige Tradition von &tex;-basierten Paketen, dass diese die seltsamste Aussprache und Schriftsetzung ermöglichen. Es wird angenommen, dass &tex; vom griechischen <emphasis>τεχ</emphasis> (lat. <emphasis>tech</emphasis> abstammt. Es existiert eine Vielzahl an Erklärungen, aber am wahrscheinlichsten ist, dass &tex; ursprünglich für die Erstellung technischer Berichte entwickelt wurde und hierbei die Möglichkeit der korrekten und einfachen Schriftsetzung von mathematischen Formeln bietet (und keine teure, zeitaufwendige und frustrierende Beschäftigung).

source: The pronunciation is supposed to be as follows: <emphasis>T</emphasis> as you would expect, <emphasis>E</emphasis> as in <emphasis>get</emphasis>, and <emphasis>X</emphasis> as in the German i<emphasis>ch</emphasis>. If you do not know what <emphasis>ch</emphasis> sounds like, it is more or less like the sound a hissing cat produces; the IPA symbol is /ç/. Many people report a different pronunciation of <emphasis>ach</emphasis> (IPA symbol /x/), but according to some Greeks, the first version is indeed correct. You should be aware that a lot of people mispronounce &tex; as /teks/ or /tek/.
de: Für &tex; scheint die folgende Aussprache korrekt zu sein: <emphasis>TECH</emphasis>, wie im Griechischen. Viele sprechen &tex; falsch als <emphasis>TEK</emphasis> oder <emphasis>TEKS</emphasis> aus.

source: Last, in &latex; the first L<superscript>A</superscript> is pronounced as <emphasis>lay</emphasis>: the idea being, while raw &tex; is difficult, even a <emphasis>lay</emphasis>man can use &latex; macros. A less inspiring, but more realistic explanation is that it stems from the surname of Leslie Lamport, the creator of &latex;. Now you know!
de: Für &latex; ist die richtige Aussprache: <emphasis>LAY-TECH</emphasis>. Während das ursprüngliche &tex; schwierig zu bedienen ist, kann auch ein Laie (engl. lay) &latex;-Makros verwenden. Eine weniger anspruchsvolle aber realistischere Erklärung ist, dass es vom Nachnamen von Leslie Lamport abstammt.

source: &latex; 101
de: &latex;-Ein-Mal-Eins

source: The &latex; typesetting system is similar to other markup languages such as &XML;, which is used in many types of documents (including the one you are reading), or &HTML;, which is used for web pages. The general idea behind markup languages is to have special keywords, called <emphasis> tags</emphasis>, that tell a program (a word processor, a web browser, or the &latex; compiler) how to the text enclosed within the tags is to be interpreted. &kile; offers a number of such tags in the <guimenu>LaTeX</guimenu> menu in the menu bar.
de: -Das &latex;-Schriftsetzungssystem ist ähnlich zu anderen Auszeichnungssprachen wie &XML; (mit dem viele Dokumentarten [und auch diese Dokumentation] erstellt werden) oder &HTML; (für Webseiten). Die generelle Idee dabei ist, spezielle Schlagwörter (sog. <emphasis>tags</emphasis>) zu verwenden, um dem Programm (Textverarbeitung, Webbrowser oder dem &latex;-Kompilierer) mitzuteilen, wie der Text dargestellt werden soll. &kile; bietet eine ganze Reihe solcher <emphasis>tags</emphasis> im Menü <guimenu>LaTeX</guimenu>.

source: While we will try to give you a good idea of what &latex; is, this document is, of course, not The Definitive Book on &latex;. If you want to learn &latex; in depth, you may want to borrow a specialized book from your local library.
de: Hier wird nur eine gute Übersicht zu &latex; gegeben, diese Dokumentation ist kein umfassendes Buch über &latex;. Um &latex; richtig zu lernen, sollten Sie sich ein Buch besorgen, das sich ausführlich mit diesem Thema befasst.

source: As any other markup language, &latex; documents contain a <emphasis>preamble</emphasis>, which defines global properties, such as paper size, page numbering, dimensions of the text on the page, and a document <emphasis>body</emphasis>, which contains the text of the document. The preamble is composed at least of the <userinput>\documentclass</userinput> command. It precedes the document body, which starts with the command <userinput>\begin{document}</userinput> is concluded with the command <userinput>\end{document}</userinput>.
de: Genauso wie in jeder anderen Auszeichnungssprache besteht ein &latex;-Dokument aus einer <emphasis>Einleitung</emphasis>, in der die allgemeingültigen Eigenschaften wie Papierformat, Seitennummerierung und Textgröße festgelegt werden sowie einen <emphasis>Körper</emphasis>, der den Text des Dokuments enthält. Die <emphasis>Einleitung</emphasis> enthält mindestens den Befehl <userinput>\documentclass</userinput>, der <emphasis>Körper</emphasis> beginnt mit dem Befehl <userinput>\begin{document}</userinput> und muss mit dem Befehl <userinput>\end{document}</userinput> wieder geschlossen werden.

source: &kile;'s Main Features
de: Grundzüge von &kile;

source: QuickStart Wizard
de: Schnelleinstiegs-Assistent

source: The QuickStart wizard built into &kile; is a useful feature to quickly start creating documents in &kile;. Choosing the wizard from the menubar gives you several choices for the creation of your document. You can also specify some options related to the document right away.
de: Der Schnelleinstiegs-Assistent von &kile; ist eine nützliche Funktion für die schnelle Erstellung eines Dokuments in &kile;. Die Auswahl des Assistenten (Menü) bietet einige Möglichkeiten für die Erstellung des Dokuments. Es können auch einige auf das Dokument bezogene Einstellungen vorgenommen werden.

source: Class options:
de: Dokumentklassen:

source: <guilabel>Document Class</guilabel>: choose the type of document you want to create: article, book, letter, report, scrartcl, scrreprt, scrbook, prosper, beamer or other custom-defined.
de: <guilabel>Dokumentklassen</guilabel>: Hiermit wird die Art des zu erstellenden Dokuments gewählt: Artikel (article), Buch [book], Brief [letter], Bericht [report], Artikel (DIN) [scrartcl], Bericht (DIN) [scrreprt], Buch (DIN) [scrbook], Projektor [beamer], Folien [prosper] oder benutzerdefiniert.

source: <guilabel>Typeface Size</guilabel>: tell &kile; what point size (pt) you want to use.
de: <guilabel>Schriftgröße</guilabel>: Hiermit wird die Schriftgröße in (pt) angegeben.

source: <guilabel>Paper Size</guilabel>: choose the size or style of sheets.
de: <guilabel>Papierformat</guilabel>: Hiermit wird die Seitengröße festgelegt.

source: <guilabel>Encoding</guilabel>: In general it is a good idea to use your system's standard encoding. Modern systems now move more and more to UTF-8 as the standard encoding. If you can, use utf8 or utf8x (which is indeed the correct spelling for &latex; documents).
de: <guilabel>Kodierung</guilabel>: Hiermit wird die Zeichenkodierung eingestellt. Es sollte die Zeichenkodierung des Systems verwendet werden. Moderne Systeme verwenden zunehmend die <emphasis>UTF-8</emphasis>-Kodierung als Standard. Bestenfalls sollte <emphasis>UTF-8</emphasis> oder <emphasis>UTF-8X</emphasis> gewählt werden (zur korrekten Verarbeitung der &latex;-Dokumente).

source: <guilabel>Other options</guilabel>: this allows you to set further options such as printing, draft, and others.
de: <guilabel>Zusätzliches</guilabel>: Hiermit können weitere Einstellungen für die Ausgabe vorgenommen werden.

source: Packages
de: Pakete

source: This lists some of the most common additional packages used in &latex;. Select the check box to include it.
de: Diese Liste enthält die meist verwendeten Zusatzpakete für &latex;. Für die Einbindung müssen sie lediglich im Ankreuzfeld ausgewählt werden.

source: Document Properties
de: Dokumenteigenschaften

source: <guilabel>Author</guilabel>: put your name here.
de: <guilabel>Autor</guilabel>: Hier wird der Name des Autors eingetragen.

source: <guilabel>Title</guilabel>: add the document title here.
de: <guilabel>Titel</guilabel>: Hier wird der Titel (Name) des Dokuments eingetragen.

source: <guilabel>Date</guilabel>: specify the date.
de: <guilabel>Datum</guilabel>: Hier wird das Datum (Erstellungstag) des Dokuments eingetragen.

source: Predefined Templates
de: Vordefinierte Vorlagen

source: The predefined templates in &kile; are:
de: Die vordefinierten Vorlagen in &kile; sind:

source: Empty document: real freaks start from scratch!
de: Leeres Dokument: Ein leeres Dokument, um alles selbst in die Hand zu nehmen.

source: Article: sets the article format, for a document short enough not to be broken down to chapters.
de: Artikel: Ein kurzes Dokument (ohne Unterteilung in <emphasis>Abschnitte</emphasis>).

source: Report: sets the report format, for a middle-sized document, with, for example, page numbering on the page's outer edge.
de: Bericht: Ein mittelgroßes Dokument für Berichte (z. B. wird die Seitenzahl in der Ecke angegeben).

source: Book: sets the book format, a full-fledged flavor, so powerful that it is used to write many university textbooks.
de: Buch: Ein vollwertiges Dokument (z. B. für die Erstellung von Universitätsbüchern).

source: Letter: sets the letter format.
de: Brief: Ein Format für Briefe.

source: Beamer, HA-Prosper: create nice presentations in PDF with a superior look and all &latex; power.
de: Projektor, Folien: Präsentationen im <filename>.pdf</filename>-Format mit einem bestechenden Design und voller &latex;-Unterstützung.

source: Powerdot: Powerdot is the follower of the packages <userinput>seminar</userinput> and <userinput>HA-Prosper</userinput>. It does not have as many options as Beamer, but it is easy to use and it can create really nice presentations in PDF.
de: Powerdot: Powerdot ist der Nachfolger des Paketes <userinput>seminar</userinput> und <userinput>HA-Prosper</userinput>. Es hat nicht so viele Einstellungsmöglichkeiten wie Beamer, aber es ist einfach zu nutzen und erstellt wirklich schöne PDF-Präsentationen.

source: Scrartcl, Scrbook, Scrreprt, Scrlttr2: the KOMA-Script document classes, especially adapted to German typography. Use them whenever you write German texts.
de: Artikel (DIN), Buch (DIN), Bericht (DIN), Brief (DIN): Die Dokumentklassen von KOMA-Script (zur Einhaltung der deutschen DIN-Vorschriften). Sie sollten bei der Erstellung deutscher Texte immer Verwendung finden.

source: Xelatex: an modified <userinput>Article</userinput> template to use with <userinput>XeLaTeX</userinput>.
de: Xelatex: eine veränderte <userinput>Artikel</userinput>-Vorlage zum Benutzen von <userinput>XeLaTeX</userinput>.

source: Note that all of these templates can be adjusted to the user's requirements.
de: Beachten Sie, dass alle diese Vorlagen an Ihre eigenen Bedürfnisse angepasst werden können.

source: New users need not worry: this list is just a brief description of the available features, and a more detailed description can be found in <xref linkend="quickstart" role="select: title pageabbrv"/>.
de: Neue Anwender müssen sich nun keine Sorgen machen. Es handelt sich lediglich um eine kurze Beschreibung der verfügbaren Funktionen. Weitergehende Informationen hierzu finden Sie im Abschnitt <xref linkend="quickstart" role="select: title pageabbrv"/>.

source: Syntax Highlighting
de: Syntaxhervorhebung

source: &kile; is similar to other programs that deal with source code and editing, and will automatically highlight commands, options and items that are used (and abused). &kile; makes it possible to easily spot problematic areas: for example, if you see major areas of text turn green, it is likely that you forgot closing a math environment somewhere.
de: &kile; bietet - genauso wie andere Quelltext-Editoren - die Hervorhebung der verwendeten Befehle, Einstellungen und Elemente (sowie der unpassenden). Durch &kile; wird eine einfache Problemsuche ermöglicht: Sind zum Beispiel größere Bereiche eines Textes auf dem Bildschirm in grüner Farbe, liegt es mit großer Wahrscheinlichkeit daran, dass eine mathematische Umgebung nicht geschlossen wurde.

source: Auto-Completion of Environments
de: Automatische Vervollständigung der Umgebungen

source: The auto-completion of environments means that, when you begin a new environment by typing <userinput>\begin{environment}</userinput>, &kile; will automatically insert a matching <userinput>\end{environment}</userinput> command, with a line in between them for your text. You can of course deactivate it if you want in <menuchoice><guimenu>Settings</guimenu><guisubmenu>Configure Kile...</guisubmenu> <guimenuitem>LaTeX</guimenuitem><guilabel>Environments</guilabel></menuchoice>.
de: Mit der <emphasis>automatischen Vervollständigung der Umgebungen</emphasis> wird bei Eingabe eines neuen Befehls (z. B. <userinput>\begin{Befehl}</userinput>) von &kile; automatisch eine Leerzeile (zur Eingabe des Textes) und die dazugehörige Zeile zum Schließen des Befehls erzeugt (z. B. <userinput>\end{Befehl}</userinput>). Diese Funktion kann im Menü <menuchoice><guimenu>Einstellungen</guimenu><guisubmenu>&kile; einrichten ...</guisubmenu><guimenuitem>LaTeX</guimenuitem><guilabel>Befehle</guilabel></menuchoice> deaktiviert werden.

source: Jump to Structure Element
de: Sprung zum Strukturelement

source: All documents are normally structured in a hierarchy of some type. &latex; allows you to break up documents into the following hierarchy (part being highest in the hierarchy, and subparagraph being lowest):
de: Alle Dokumente sind normalerweise in einige Elemente unterteilt. &latex; ermöglicht die Unterteilung des Dokuments in folgende Elemente (<emphasis>part</emphasis> ist das höchste und <emphasis>subparagraph</emphasis> das unterste Element):

source: When viewing a document in the <guilabel>Structure</guilabel> view, you can jump between elements by clicking on the element you would like to view.
de: Bei der Ansicht des Dokuments in der <guilabel>Strukturansicht</guilabel> können die einzelnen Elemente durch einen Mausklick auf das jeweilige gewechselt und angesehen werden.

source: Inverse Search
de: Rückwärtssuche

source: When creating your own &latex; files, inverse search can be very helpful. Once you have created a &DVI; file (DeVice Independent File) or PDF file, you can click the left mouse button while pressing &Shift; in the viewer and &kile; will jump to the corresponding line in the &latex; source code.
de: Bei der Erstellung der eigenen &latex;-Dateien kann die <emphasis>Rückwärtssuche</emphasis> sehr hilfreich sein. Sobald eine <filename>&DVI;</filename>-Datei [geräteunabhängige Datei (engl. <keycap>D</keycap>e<keycap>V</keycap>ice <keycap>I</keycap>ndependent File)] oder eine PDF-Datei erstellt wurde, springt &kile; durch einen Klick mit der linken Maustaste und gleichzeitigem Drücken der &Shift;-Taste im Betrachter zur entsprechenden Zeile im &latex;-Quelltext.

source: A &DVI; is a type of file containing a description of a formatted document, along with other information including character font, and is besides PDF the usual output of &tex; or &latex;. A number of utilities exist to view, convert and print &DVI; files on various systems and devices.
de: Eine <filename>&DVI;</filename>-Datei enthält eine Beschreibung des formatierten Dokuments und auch andere Informationen wie die Schriftart und ist neben <filename>PDF</filename> die übliche Ausgabeart von &tex; oder &latex;. Es gibt viele Werkzeuge zur Ansicht, Umwandlung und zum Ausdrucken von <filename>&DVI;</filename>-Dateien für verschiedene Systeme und Geräte.
