Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/extragear-office/kile.po
Languages: de

source: <screeninfo>Bullets</screeninfo>
de: <screeninfo>Sprungmarken</screeninfo>

source: <phrase>Bullets</phrase>
de: <phrase>Sprungmarken</phrase>

source: <shortcut><keycombo action="simul">&Ctrl;&Alt;<keycap>Right</keycap></keycombo></shortcut> <guimenuitem>Next Bullet</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;&Alt;<keycap>Pfeil rechts</keycap></keycombo></shortcut> <guimenuitem>Nächste Sprungmarke</guimenuitem>

source: Jump to the next bullet in the text if there is one.
de: Springt zur nächsten Sprungmarke im Text (sofern vorhanden).

source: <shortcut><keycombo action="simul">&Ctrl;&Alt;<keycap>Left</keycap></keycombo></shortcut> <guimenuitem>Last Bullet</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;&Alt;<keycap>Pfeil links</keycap></keycombo></shortcut> <guimenuitem>Vorherige Sprungmarke</guimenuitem>

source: Jump to the previous bullet in the text if there is one.
de: Springt zur vorherigen Sprungmarke im Text (sofern vorhanden).

source: Select
de: Auswahl

source: Editing is of course one of the main aspects when you use a program like &kile;. Although &kate; already has great capabilities, &kile; adds some important features, which are especially needed to write &latex; source. &latex; always needs a lot of environments and groups, so &kile; supports very special commands to select them. Under <menuchoice><guimenu>Edit</guimenu><guisubmenu>Select</guisubmenu></menuchoice> you will find the following commands to select text.
de: Das Bearbeiten ist wahrscheinlich einer der Hauptaspekte beim Verwenden eines Programms wie &kile;. Obwohl &kate; bereits hervorragende Möglichkeiten bietet, wurden in &kile; wichtige Funktionen für das Schreiben eines &latex;-Quelltextes hinzugefügt. &latex; benötigt immer viele Umgebungen und Gruppen und deshalb unterstützt &kile; spezielle Befehle für deren Auswahl. Unter <menuchoice><guimenu>Bearbeiten</guimenu><guisubmenu>Auswählen</guisubmenu></menuchoice> sind die folgenden Befehle zur Textauswahl enthalten:

source: <screeninfo>Edit->Select items</screeninfo>
de: <screeninfo><menuchoice><guimenu>Bearbeiten</guimenu><guisubmenu>Auswählen</guisubmenu></menuchoice></screeninfo>

source: <phrase>Edit->Select items</phrase>
de: <phrase><menuchoice><guimenu>Bearbeiten</guimenu><guisubmenu>Auswählen</guisubmenu></menuchoice></phrase>

source: <shortcut><keycombo action="simul">&Ctrl;&Alt;<keycap>S</keycap></keycombo> <keycap>,E</keycap></shortcut> <guimenuitem>Environment (inside)</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;&Alt;<keycap>S</keycap><keycap>,E</keycap></keycombo></shortcut><guimenuitem>Umgebung (Inhalt)</guimenuitem>

source: Select an environment without the surrounding tags. If this command is called, when an environment is already selected, &kile; will expand the selection to the next surrounding environment.
de: Wählen Sie eine Umgebung ohne die umrahmenden Markierung. Wird dieser Befehl aufgerufen, wenn bereits eine Umgebung ausgewählt ist, erweitert &kile; den Abschnitt bis zur nächsten umliegenden Umgebung.

source: <shortcut><keycombo action="simul">&Ctrl;&Alt;<keycap>S</keycap></keycombo> <keycap>,F</keycap></shortcut> <guimenuitem>Environment (outside)</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;&Alt;<keycap>S</keycap><keycap>,F</keycap></keycombo></shortcut><guimenuitem>Umgebung (Außerhalb)</guimenuitem>

source: Select an environment including the surrounding tags. This selection can also be expanded with a second call of this command.
de: Wählen Sie eine Umgebung mit den sie umgebenden Markierungen. Dieser Abschnitt wird durch einen zweiten Aufruf dieses Befehls erweitert.

source: <shortcut><keycombo action="simul">&Ctrl;&Alt;<keycap>S</keycap></keycombo> <keycap>,T</keycap></shortcut> <guimenuitem>TeX Group (inside)</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;&Alt;<keycap>S</keycap><keycap>,T</keycap></keycombo></shortcut><guimenuitem>TeX-Gruppe (Inhalt)</guimenuitem>

source: Select a TeX group inside the surrounding braces.
de: Wählt den Inhalt einer &tex;-Gruppe aus (ohne umschließende Befehle).

source: <shortcut><keycombo action="simul">&Ctrl;&Alt;<keycap>S</keycap></keycombo> <keycap>,U</keycap></shortcut> <guimenuitem>TeX Group (outside)</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;&Alt;<keycap>S</keycap><keycap>,U</keycap></keycombo></shortcut><guimenuitem>TeX-Gruppe (Außerhalb)</guimenuitem>

source: Select a TeX group including the surrounding braces.
de: Wählt eine &tex;-Gruppe komplett aus (einschl. umschließender Befehle).

source: <shortcut><keycombo action="simul">&Ctrl;&Alt;<keycap>S</keycap></keycombo> <keycap>,M</keycap></shortcut> <guimenuitem>Math Group</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;&Alt;<keycap>S</keycap><keycap>,M</keycap></keycombo></shortcut><guimenuitem>Mathematische Gruppe</guimenuitem>

source: Select the current math group including the math commands.
de: Wählt eine mathematischen Gruppe komplett aus (einschl. umschließender Befehle).

source: <shortcut><keycombo action="simul">&Ctrl;&Alt;<keycap>S</keycap></keycombo> <keycap>,P</keycap></shortcut> <guimenuitem>Paragraph</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;&Alt;<keycap>S</keycap><keycap>,P</keycap></keycombo></shortcut><guimenuitem>Absatz</guimenuitem>

source: Select a whole paragraph, &ie; a group of text lines separated on both sides by empty lines. A paragraph does not mean just continuous lines of text, as it is in other text editors. This extended meaning also includes tables, &latex; commands and all other lines of source. The only important thing for &kile; is that kind of paragraph is separated by two empty lines.
de: Wählt einen kompletten Absatz aus (Gruppe von Zeilen, die auf beiden Seiten eine leere Zeile enthalten). Mit einem Absatz ist dabei nicht ein Text mit durchgängigen Zeilen gemeint (wie in anderen Texteditoren). Diese erweiterte Bedeutung schließt damit Tabellen, &latex;-Befehle und alle anderen Zeilen des Quelltextes ein. Die einzig bedeutende Sache in &kile; ist damit, dass die Absätze durch zwei leere Zeilen getrennt sind.

source: <shortcut><keycombo action="simul">&Ctrl;&Alt;<keycap>S</keycap></keycombo> <keycap>,L</keycap></shortcut> <guimenuitem>Line</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;&Alt;<keycap>S</keycap><keycap>,L</keycap></keycombo></shortcut><guimenuitem>Zeile</guimenuitem>

source: Select the text line of the current cursor position.
de: Wählt die Textzeile unter der aktuellen Cursor-Position aus.

source: <shortcut><keycombo action="simul">&Ctrl;&Alt;<keycap>S</keycap></keycombo> <keycap>,W</keycap></shortcut> <guimenuitem>TeX Word</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;&Alt;<keycap>S</keycap><keycap>,W</keycap></keycombo></shortcut><guimenuitem>TeX-Gruppe</guimenuitem>

source: Select the word under the current cursor position. This selection has also en extended meaning, because this command can also select &latex; commands, which begin with a backslash and may also have an optional star at the end.
de: Wählt das Wort unter der aktuellen Cursor-Position aus. Diese Auswahl hat auch eine erweiterte Bedeutung, da dieser Befehl auch &latex;-Befehle mit einem Rückwärtsschrägstrich (<userinput>\</userinput>) und einem zusätzlichen Stern (<userinput>*</userinput>) am Ende auswählt.

source: Select &latex; commands
de: Wählen Sie die &latex;-Befehle

source: &kile; has an extended feature to select &latex; commands. If you for example have typed
de: &kile; besitzt die fortgeschrittene Funktion &latex;-Befehle auszuwählen. Wenn Sie beispielsweise folgendes eingegeben haben

source: text \bfseries\itshape more text
de: Text \bfseries\itshape weiterer Text

source: and double click on one of the &latex; commands, both will be selected. But often you only want to select one of two or more commands. This can be done using the <keycombo>&Ctrl;</keycombo> key. You only have to press the <keycombo>&Ctrl;</keycombo> key and a double click will only select the desired command.
de: und ein Doppelklick auf einen der &latex;-Befehle, wählt beide aus. Aber oft wollen Sie nur einen der Befehle auswählen. Dies ist möglich durch Nutzung der <keycombo>&Ctrl;</keycombo>-Taste. Sie müssen die <keycombo>&Ctrl;</keycombo>-Taste gedrückt halten und eine Doppelklick wählt lediglich den gewünschten Befehl aus.

source: Delete
de: Entfernen

source: To delete some parts of a document you can of course select them, and then use the <keycombo><keycap>Delete</keycap></keycombo> key. &kate; also offers the command <keycombo>&Ctrl;<keycap>K</keycap></keycombo> which deletes the whole line. But &kile; offers a faster way with its own delete commands. Under <menuchoice><guimenu>Edit</guimenu><guisubmenu>Delete</guisubmenu></menuchoice> you will find following commands to delete text.
de: Zum Löschen eines Teils des Dokuments kann natürlich dieser zuerst ausgewählt und durch Drücken der Taste <keycap>Entf</keycap> entfernt werden. &kate; bietet das Tastenkürzel <keycombo>&Ctrl;<keycap>K</keycap></keycombo> mit dem die gesamte Zeile entfernt wird. &kile; bietet mit eigenen Befehlen hierfür eine schnellere Möglichkeit. Unter <menuchoice><guimenu>Bearbeiten</guimenu><guisubmenu>Entfernen</guisubmenu></menuchoice> sind die folgenden Befehle zum Löschen des Textes enthalten:

source: <screeninfo>Edit->Delete items</screeninfo>
de: <screeninfo><menuchoice><guimenu>Bearbeiten</guimenu><guisubmenu>Entfernen</guisubmenu></menuchoice></screeninfo>

source: <phrase>Edit->Delete items</phrase>
de: <phrase><menuchoice><guimenu>Bearbeiten</guimenu><guisubmenu>Entfernen</guisubmenu></menuchoice></phrase>

source: <shortcut><keycombo action="simul">&Ctrl;&Alt;<keycap>T</keycap></keycombo> <keycap>,E</keycap></shortcut> <guimenuitem>Environment (inside)</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;&Alt;<keycap>T</keycap><keycap>,E</keycap></keycombo></shortcut><guimenuitem>Umgebung (Inhalt)</guimenuitem>

source: Delete an environment without the surrounding tags.
de: Entfernt den Inhalt einer Umgebung (ohne umschließende Befehle).

source: <shortcut><keycombo action="simul">&Ctrl;&Alt;<keycap>T</keycap></keycombo> <keycap>,F</keycap></shortcut> <guimenuitem>Environment (outside)</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;&Alt;<keycap>T</keycap><keycap>,F</keycap></keycombo></shortcut><guimenuitem>Umgebung (Komplett)</guimenuitem>

source: Delete an environment including the surrounding tags.
de: Entfernt die komplette Umgebung (einschl. umschließender Befehle).

source: <shortcut><keycombo action="simul">&Ctrl;&Alt;<keycap>T</keycap></keycombo> <keycap>,T</keycap></shortcut> <guimenuitem>TeX Group (inside)</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;&Alt;<keycap>T</keycap><keycap>,T</keycap></keycombo></shortcut><guimenuitem>TeX-Gruppe (Inhalt)</guimenuitem>

source: Delete a TeX group inside the surrounding braces.
de: Entfernt den Inhalt einer &tex;-Gruppe (ohne umschließende Klammern).

source: <shortcut><keycombo action="simul">&Ctrl;&Alt;<keycap>T</keycap></keycombo> <keycap>,U</keycap></shortcut> <guimenuitem>TeX Group (outside)</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;&Alt;<keycap>T</keycap><keycap>,U</keycap></keycombo></shortcut><guimenuitem>TeX-Gruppe (Komplett)</guimenuitem>

source: Delete a TeX group including the surrounding braces.
de: Entfernt die komplette &tex;-Gruppe (einschl. umschließender Klammern).

source: <shortcut><keycombo action="simul">&Ctrl;&Alt;<keycap>T</keycap></keycombo> <keycap>,M</keycap></shortcut> <guimenuitem>Math Group</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;&Alt;<keycap>T</keycap><keycap>,M</keycap></keycombo></shortcut><guimenuitem>Mathematische Gruppe</guimenuitem>

source: Delete the current math group including the math commands.
de: Entfernt die aktuelle mathematische Gruppe (einschl. der math. Befehle).

source: <shortcut><keycombo action="simul">&Ctrl;&Alt;<keycap>T</keycap></keycombo> <keycap>,P</keycap></shortcut> <guimenuitem>Paragraph</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;&Alt;<keycap>T</keycap><keycap>,P</keycap></keycombo></shortcut><guimenuitem>Absatz</guimenuitem>

source: Delete a whole paragraph. Look at the <menuchoice><guisubmenu>Select</guisubmenu><guimenuitem>Paragraph</guimenuitem></menuchoice> command, how a paragraph is defined in &kile;.
de: Entfernt einen kompletten Absatz. Die Definition für einen Absatz in &kile; ist in der Beschreibung zu <menuchoice><guimenu>Bearbeiten</guimenu><guisubmenu>Auswählen</guisubmenu><guimenuitem>Absatz</guimenuitem></menuchoice> enthalten.

source: <shortcut><keycombo action="simul">&Ctrl;&Alt;<keycap>T</keycap></keycombo> <keycap>,I</keycap></shortcut> <guimenuitem>To End of Line</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;&Alt;<keycap>T</keycap><keycap>,I</keycap></keycombo></shortcut><guimenuitem>Bis Zeilenende</guimenuitem>

source: Delete the text from the current cursor position to the end of the line.
de: Entfernt den Text von der aktuellen Cursor-Position bis zum Zeilenende.

source: <shortcut><keycombo action="simul">&Ctrl;&Alt;<keycap>T</keycap></keycombo> <keycap>,W</keycap></shortcut> <guimenuitem>TeX Word</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;&Alt;<keycap>T</keycap><keycap>,W</keycap></keycombo></shortcut><guimenuitem>TeX-Wort</guimenuitem>

source: Delete the word or &latex; command under the current cursor position.
de: Entfernt das Wort oder den &latex;-Befehl unter der aktuellen Cursor-Position.

source: Environment
de: Umgebung

source: It was already mentioned that environments are a central point in &latex;. So &kile; offers five other commands to make the work with &latex; as easy as possible under submenus <menuchoice><guimenu>Edit</guimenu><guisubmenu>Environment</guisubmenu></menuchoice>.
de: Es wurde bereits verdeutlicht, dass Umgebungen eine zentrale Rolle in &latex; spielen. Deshalb bietet &kile; fünf weitere Befehle unter <menuchoice><guimenu>Bearbeiten</guimenu><guisubmenu>Umgebung</guisubmenu></menuchoice> für eine möglichst einfache Arbeit mit &latex;.

source: <screeninfo>Edit->Environment items</screeninfo>
de: <screeninfo><menuchoice><guimenu>Bearbeiten</guimenu><guisubmenu>Umgebung</guisubmenu></menuchoice></screeninfo>

source: <phrase>Edit->Environment items</phrase>
de: <phrase><menuchoice><guimenu>Bearbeiten</guimenu><guisubmenu>Umgebung</guisubmenu></menuchoice></phrase>

source: <shortcut><keycombo action="simul">&Ctrl;&Alt;<keycap>E</keycap></keycombo> <keycap>,B</keycap></shortcut> <guimenuitem>Go to Begin</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;&Alt;<keycap>E</keycap><keycap>,B</keycap></keycombo></shortcut><guimenuitem>Zum Anfang springen</guimenuitem>

source: This command will jump to the beginning of the current environment, wherever your current position is. The cursor will be placed directly in front of the opening environment tag.
de: Mit diesem Befehl wird zum Anfang der aktuellen Umgebung gesprungen (egal wo die aktuelle Position ist). Der Cursor wird direkt vor dem Befehl zum Öffnen der Umgebung platziert.

source: <shortcut><keycombo action="simul">&Ctrl;&Alt;<keycap>E</keycap></keycombo> <keycap>,E</keycap></shortcut> <guimenuitem>Go to End</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;&Alt;<keycap>E</keycap><keycap>,E</keycap></keycombo></shortcut><guimenuitem>Zum Ende springen</guimenuitem>

source: This command will jump to the end of the current environment, wherever your current position is. The cursor will be placed directly behind the closing environment tag.
de: Mit diesem Befehl wird zum Ende der aktuellen Umgebung gesprungen (egal wo die aktuelle Position ist). Der Cursor wird direkt hinter dem Befehl zum Schließen der Umgebung platziert.

source: <shortcut><keycombo action="simul">&Ctrl;&Alt;<keycap>E</keycap></keycombo> <keycap>,M</keycap></shortcut> <guimenuitem>Match</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;&Alt;<keycap>E</keycap><keycap>,M</keycap></keycombo></shortcut><guimenuitem>Übereinstimmung</guimenuitem>

source: When your cursor is placed in front of or above the <userinput>\begin{environment}</userinput> tag, it will be moved to the opposite end of the environment and vice versa.
de: Wenn sich der Cursor vor oder innerhalb des Befehls <userinput>\begin{Umgebung}</userinput> befindet, wird zum Ende der Umgebung gesprungen (oder umgekehrt).

source: <shortcut><keycombo action="simul">&Ctrl;&Alt;<keycap>E</keycap></keycombo> <keycap>,C</keycap></shortcut> <guimenuitem>Close</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;&Alt;<keycap>E</keycap><keycap>,C</keycap></keycombo></shortcut><guimenuitem>Schließen</guimenuitem>

source: Typing a lot of nested environment tags, you may lose control of all those environments. This command will close the last opened environment, so that the nested structure of environments will not be broken.
de: Bei der Eingabe von vielen verschachtelten Umgebungs-Befehlen kann schnell der Überblick darüber verloren gehen. Dieser Befehl schließt die zuletzt geöffnete Umgebung, sodass die verschachtelte Umgebungsstruktur nicht zerstört wird.

source: <shortcut><keycombo action="simul">&Ctrl;&Alt;<keycap>E</keycap></keycombo> <keycap>,A</keycap></shortcut> <guimenuitem>Close All</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;&Alt;<keycap>E</keycap><keycap>,A</keycap></keycombo></shortcut><guimenuitem>Alle schließen</guimenuitem>

source: This closes all open environments, not only the last opened environment.
de: Schließt alle offenen Umgebungen (nicht nur die zuletzt geöffnete).

source: &tex; Group
de: &tex;-Gruppe

source: &kile; also offers some special commands for &latex; groups, which are determined by braces <userinput>{...}</userinput>. In submenu <menuchoice><guimenu>Edit</guimenu><guisubmenu>TeX Group</guisubmenu></menuchoice> you will find some important commands, which correspond to those from <menuchoice><guimenu>Edit</guimenu><guisubmenu>Environment</guisubmenu></menuchoice>.
de: &kile; bietet auch spezielle Befehle für die &latex;-Gruppen, die durch Klammern <userinput>{ ... }</userinput> bestimmt werden. Unter <menuchoice><guimenu>Bearbeiten</guimenu><guisubmenu>TeX-Gruppe</guisubmenu></menuchoice> sind ein paar wichtige Befehle, die denen aus <menuchoice><guimenu>Bearbeiten</guimenu><guisubmenu>Umgebung</guisubmenu></menuchoice> entsprechen.

source: <screeninfo>Edit->TeX Group</screeninfo>
de: <screeninfo><menuchoice><guimenu>Bearbeiten</guimenu><guisubmenu>TeX-Gruppe</guisubmenu></menuchoice></screeninfo>

source: <phrase>Edit->TeX Group</phrase>
de: <phrase><menuchoice><guimenu>Bearbeiten</guimenu><guisubmenu>Auswählen</guisubmenu></menuchoice></phrase>

source: <shortcut><keycombo action="simul">&Ctrl;&Alt;<keycap>G</keycap></keycombo> <keycap>,B</keycap></shortcut> <guimenuitem>Go to Begin</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;&Alt;<keycap>G</keycap><keycap>,B</keycap></keycombo></shortcut><guimenuitem>Zum Anfang springen</guimenuitem>

source: This command will jump to the beginning of the current group, wherever your current position is. The cursor will be placed directly in front of the opening brace.
de: Mit diesem Befehl wird zum Anfang der aktuellen Gruppe gesprungen (egal wo die aktuelle Position ist). Der Cursor wird direkt vor der geschweiften öffnenden Klammer platziert.

source: <shortcut><keycombo action="simul">&Ctrl;&Alt;<keycap>G</keycap></keycombo> <keycap>,E</keycap></shortcut> <guimenuitem>Go to End</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;&Alt;<keycap>G</keycap><keycap>,E</keycap></keycombo></shortcut><guimenuitem>Zum Ende springen</guimenuitem>

source: This command will jump to the end of the current group, wherever your current position is. The cursor will be placed directly behind the closing brace.
de: Mit diesem Befehl wird zum Ende der aktuellen Gruppe gesprungen (egal wo die aktuelle Position ist). Der Cursor wird direkt hinter der geschweiften schließenden Klammer platziert.

source: <shortcut><keycombo action="simul">&Ctrl;&Alt;<keycap>G</keycap></keycombo> <keycap>,M</keycap></shortcut> <guimenuitem>Match</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;&Alt;<keycap>G</keycap><keycap>,M</keycap></keycombo></shortcut><guimenuitem>Übereinstimmung</guimenuitem>

source: When your cursor is placed in front of or behind an opening brace of a &tex; group, he will be moved to the opposite end of the group and vice versa.
de: Wenn sich der Cursor vor oder hinter der geschweiften Klammer einer &tex;-Gruppe # befindet, wird zum anderen Ende der Gruppe gesprungen (oder umgekehrt).

source: <shortcut><keycombo action="simul">&Ctrl;&Alt;<keycap>G</keycap></keycombo> <keycap>,C</keycap></shortcut> <guimenuitem>Close</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;&Alt;<keycap>G</keycap><keycap>,C</keycap></keycombo></shortcut><guimenuitem>Schließen</guimenuitem>

source: Typing a lot of nested group braces may be hard work. This command will close the last opened group, so that the nested structure of &tex; groups will not be broken.
de: Bei der Eingabe von vielen verschachtelten geschweiften Gruppen-Klammern kann schnell der Überblick darüber verloren gehen. Dieser Befehl schließt die zuletzt geöffnete Gruppe, sodass die verschachtelte Struktur der &tex;-Gruppen nicht zerstört wird.

source: <title>Double Quotes</title>
de: <title>Doppelte Anführungszeichen</title>

source: In &latex;, two single quotes are used as double quotes. To help you insert these efficiently, &kile; allows you to press <keycap>"</keycap> to insert two opening single quotes. Furthermore, if you want to close a quotation, you also have to press <keycap>"</keycap>. &kile; will be smart enough to recognize this case and inserts two closing quotes for &latex;.
de: In &latex; werden zwei einfache Anführungszeichen als <emphasis>Gänsefüsschen</emphasis> verwendet. Für die zweckbringende Umsetzung wird in &kile; das Zeichen <keycap>"</keycap> für zwei einfache Anführungszeichen verwendet. Auch für das Beenden der <emphasis>Anführung</emphasis> wird das Zeichen <keycap>"</keycap> verwendet. &kile; kennt diesen Fall und fügt zwei schließende Anführungszeichen für &latex; ein.

source: To get a literal double quote on the other side, press <keycap>"</keycap> twice.
de: Für das Einfügen eines <emphasis>Gänsefüsschens</emphasis> sind zwei <keycap>"</keycap> (also <keycap>""</keycap>) notwendig.

source: You can enable or disable this auto insertion of opening and closing double quotes in section <menuchoice><guimenu>Settings</guimenu><guisubmenu>Configure Kile...</guisubmenu><guimenuitem>LaTeX</guimenuitem></menuchoice>.
de: Dieses automatische Einfügen der doppelten Anführungszeichen kann unter <menuchoice><guimenu>Einstellungen</guimenu><guisubmenu>Kile einrichten ...</guisubmenu><guimenuitem>LaTeX</guimenuitem></menuchoice> ein- und ausgeschaltet werden.

source: <screeninfo>Double Quotes</screeninfo>
de: <screeninfo>Doppelte Anführungszeichen</screeninfo>

source: <phrase>Double Quotes</phrase>
de: <phrase>Doppelte Anführungszeichen</phrase>

source: If you also include language-specific options like <userinput>ngerman</userinput> or <userinput>french</userinput>, you will also be able to use German or French double quotes. Many more languages are available.
de: Es können auch länderspezifische Einstellungen (z. B. <userinput>ngerman</userinput> oder <userinput>french</userinput>) und damit <emphasis>deutsche</emphasis> oder <emphasis>französische</emphasis> Anführungszeichen verwendet werden. Es sind auch viele weitere Sprachen verfügbar.

source: Smart Newline
de: Intelligenter Zeilenumbruch
