Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/extragear-office/kile.po
Languages: de

source: The <guilabel>Include Graphics</guilabel> dialog makes insertion of graphics as easy as possible. You can reach it via the menubar with <menuchoice><guimenu>LaTeX</guimenu><guimenuitem>Image Insertion</guimenuitem></menuchoice>. Please take a look at <xref linkend="build_graphics" role="select: title pageabbrv"/> and <xref linkend="build_epsgraphics" role="select: title pageabbrv"/> to get an overview of some basic facts concerning graphic formats.
de: Der Dialog <guilabel>Grafik einbinden</guilabel> gestaltet das Einfügen von Grafiken so einfach wie möglich. Diesen Dialog öffnen Sie mit <menuchoice><guimenu>LaTeX</guimenu><guimenuitem>Bild einbinden</guimenuitem></menuchoice> in der Menüleiste. Einen Überblick der Grundlagen zu den Grafikformaten finden Sie in den Abschnitten <xref linkend="build_graphics"/> und <xref linkend="build_epsgraphics"/>.

source: <screeninfo>Including a graphics element</screeninfo>
de: <screeninfo>Grafisches Element einfügen</screeninfo>

source: <phrase>Including a graphics element</phrase>
de: <phrase>Grafisches Element einfügen</phrase>

source: Choose a graphics file. This can be a JPEG, PNG, PDF, EPS or even a zipped or gzipped EPS file. If you have installed <ulink url="http://www.imagemagick.org/">&imagemagick;</ulink> and also configured &kile; to use it (<menuchoice><guimenu>Settings</guimenu><guisubmenu>Configure Kile...</guisubmenu> <guimenuitem>LaTeX</guimenuitem><guilabel>Graphics</guilabel></menuchoice>), the width and the height of the graphic is automatically shown. If &imagemagick; can determine a resolution, the size of the graphics is also shown in centimeters.
de: Wählen Sie eine Grafikdatei im JPEG-, PNG-, PDF-, EPS-Format oder als mit „zip“ oder „gzip“ gepackte EPS-Datei aus. Haben Sie <ulink url="http://www.imagemagick.org/">&imagemagick;</ulink> installiert und in &kile; auf der Seite <menuchoice><guimenu>Einstellungen</guimenu><guisubmenu>Kile einrichten ...</guisubmenu> <guimenuitem>LaTeX</guimenuitem><guilabel>Grafiken</guilabel></menuchoice> die Benutzung aktiviert, dann wird die Breite und Höhe der Grafik automatisch angezeigt. Wenn &imagemagick; die Auflösung ermitteln kann, wird die Größe auch in Zentimetern angezeigt.

source: Decide whether your image shall be centered on the page.
de: Entscheiden Sie, ob Ihr Bild auf der Seite zentriert werden soll.

source: Choose whether you want the <userinput>\graphicspath</userinput> notation for your graphics file.
de: Legen Sie fest, ob <userinput>\graphicspath</userinput> für Ihre Grafikdatei verwendet werden soll.

source: By default graphics files have to be in the same folder as your master document. However, it is possible to put them in other folders to make things tidier. Without a <userinput>\graphicspath</userinput> command, &kile; would include the path for the graphics file. But if you use <userinput>\graphicspath</userinput> in your preamble like this:
de: Als Voreinstellung müssen Grafikdateien im selben Ordner wie das Master-Dokument gespeichert werden. Es ist jedoch auch möglich, andere Ordner zu verwenden, um eine bessere Übersicht zu behalten. Ohne den Befehl <userinput>\graphicspath</userinput> fügt &kile; den vollständigen Pfad zur Grafikdatei ein. Wenn Sie jedoch <userinput>\graphicspath</userinput> in der Einleitung wie folgt verwenden:

source: \graphicspath{{/path/to/my/graphics}{other/path/to/more/graphics}}
de: \graphicspath{{/Pfad/zu/Grafiken}{/anderer/Pfad/zu/weiteren/Grafiken}}

source: and check this option, &kile; will only use the base name of the graphics file.
de: und diese Einstellung aktivieren, benutzt &kile; nur den Dateinamen ohne Pfad,

source: Another example: if you set <userinput>\graphicspath</userinput> command like:
de: Ein weiteres Beispiel: Angenommen Sie benutzen den Befehl <userinput>\graphicspath</userinput> wie folgt:

source: &latex; will search in the current folder, then in <filename>camera</filename> and finally in <filename>images</filename> to find your graphics file.
de: &latex; sucht dann im aktuellen Ordner, dann in <filename>camera</filename> und schließlich in <filename>images</filename>, um Ihre Grafikdatei zu finden.

source: If you choose either a width or a height, the whole graphics will be proportionally scaled. If you set two values for width and height at the same time, width and height may be scaled with different factors, and this could not be what you want. See also the information near the top of dialog to know the original size of the graphics.
de: Wenn Sie entweder nur die Höhe oder nur die Breite eingeben, wird das Seitenverhältnis beibehalten und die Grafik an die gewünschte Größe angepasst. Geben Sie sowohl Werte für Höhe und Breite ein, werden Sie mit unterschiedlichen Faktoren vergrößert. Das ist möglicherweise nicht beabsichtigt. Im Dialog werden oben Informationen über die ursprüngliche Größe der Grafik angezeigt.

source: Insert an angle by which to rotate the graphics counterclockwise.
de: Geben Sie einen Winkel ein, um den die Grafik im Uhrzeigersinn gedreht werden soll.

source: The bounding-box information is set automatically when you choose a graphics file. This information is only needed when you work with traditional &latex; and bitmapped graphics. See the discussion of <link linkend="build_epsgraphics">EPS graphics</link>.
de: Die Information über die Begrenzungslinien wird automatisch bestimmt, wenn Sie eine Grafikdatei auswählen. Diese Information ist nur für &latex;- und Bitmap-Grafiken erforderlich. Mehr Informationen dazu finden Sie im Abschnitt <link linkend="build_epsgraphics">EPS-Grafik</link>.

source: If &latex; needs a bounding box and you do not want to generate a bb file, &kile; supports this option. On the other side, &pdflatex; will give a warning, when you want to include a png or jpg graphics with this option. This checkbox enables or disables the bounding box option.
de: Wenn &latex; ein Begrenzungsfeld benötigt und Sie die dafür erforderliche Datei nicht erzeugen möchten, unterstützt Sie &kile; dabei. Andererseits gibt &pdflatex; eine Warnung aus, wenn Sie eine PNG- oder JPG-Grafik mit dieser Einstellung einfügen möchten. Dieses Ankreuzfeld aktiviert oder deaktiviert diese Einstellung.

source: Scale the image by the desired scale factor. &eg;, 0.5 to reduce by half, or 2 to double. When you use this option, you do not have to set a width or height for the image.
de: Ändern Sie die Größe des Bildes um den gewünschten Faktor. Mit &eg; 0,5 hat es die halbe, mit 2,0 die doppelte Größe. Wenn Sie diese Einstellung benutzen, müssen Sie keine Breite oder Höhe für das Bild angeben.

source: In the <guilabel>Trim Image</guilabel>-tab you can crop your image in all four directions.
de: Auf der Karteikarte <guilabel>Bild beschneiden</guilabel> können Sie Ihr Bild auf allen vier Seiten zuschneiden.

source: Finally, you have to specify whether you want to embed this image into a figure environment. When you want the text to wrap around the figure, use the wrapfigure environment instead.
de: Schließlich müssen Sie noch angeben, ob das Bild in eine „Figure“-Umgebung eingebettet werden soll, oder in eine „Wrapfigure“-Umgebung, wenn der Text um die Grafik herum fließen soll.

source: When you choose the wrapfigure environment, you need to include the wrapfig package in your preamble.
de: Wenn Sie die Wrapfigure-Umgebung verwenden möchten, müssen Sie das Paket „wrapfig“ in der Einleitung einfügen.

source: In either case you can insert a caption and a label for your image. Generally, it is a good idea to add a different prefix to each kind of label. It is common to use the prefix <userinput>fig:</userinput> for images.
de: In beiden Fällen können Sie einen Titel und Beschriftung für das Bild eingeben. Im Allgemeinen ist es anzuraten, ein eigenes Präfix für jede Art von Beschriftung zu verwenden. Normalerweise wird <userinput>Abb.</userinput> für Bilder verwendet

source: If you pick the figure environment, you can choose where &latex; should position the figure preferably.
de: Haben Sie die „Figure“-Umgebung gewählt, können Sie angeben, wie &latex; die Grafik anordnen soll.

source: In the wrapfigure environment you can
de: In der „Wrapfigure“-Umgebung gibt es folgende Einstellungen:

source: Pick a placement rule for the figure and decide whether the figure should float or not. In a two-sided document you can define whether the figure should be on the inside of the page or on the outside.
de: Wählen Sie eine Regel zur Positionierung Ihrer Grafik und legen Sie fest, ob die Abbildung von Text umflossen werden soll. Für ein zweiseitiges Dokument können Sie angeben, ob die Abbildung innen oder außen auf der Seite angeordnet werden soll.

source: Define how many lines the wrapping text should be broken. If you leave this empty, &latex; will determine this itself as good as possible.
de: Geben Sie ein, wie viele Zeilen Sie umbrechen möchten. Wählen Sie hier nichts aus, versucht &latex; dies so gut wie möglich selbst zu bestimmen.

source: Define an overhang to the chosen side. This is especially useful when you have columns in your document and you want a figure span over more than just one column or you want it being wrapped by two columns.
de: Bestimmen Sie einen Überhang zur ausgewählten Seite. Dies ist besonders dann sinnvoll, wenn Ihr Dokument mehrere Spalten hat und Sie die Abbildung über mehr als eine Spalte verteilt haben möchten oder wenn die Abbildung auf zwei Spalten aufgeteilt werden soll.

source: Choose a width for the figure. This should be a bit bigger than your actual image width, so there will be some empty space between the figure and the text.
de: Wählen Sie die Breite der Abbildung. Dieser Wert sollte etwas größer als die tatsächliche Breite des Bildes sein, damit der umfließende Text etwas Abstand hat.

source: Arrays and tabulars
de: Tabellen und Tabulatoren

source: One of the most boring jobs one can do in &latex; is to write a matrix or a tabular environment. One has to keep track of all the elements, ensure that the environment is well formed, and that all things are where they are supposed to be. Good indentation helps, but there is a simpler way: using &kile;'s <menuchoice><guimenu>Wizard</guimenu><guimenuitem>Array</guimenuitem></menuchoice> or <menuchoice><guimenu>Wizard</guimenu><guimenuitem>Tabular</guimenuitem></menuchoice> menu entries. You will then have a matrix-formed input form that you can easily fill in with your entries. This dialog also offers some options to typeset the tabular material.
de: Eines der mühseligsten Arbeiten in &latex; ist das Schreiben einer Matrix- oder Tabellenumgebung. Alle Elemente müssen richtig eingefügt werden und die Syntax muss korrekt sein. Eine Einrückung hilft bei dieser Aufgabe, es geht aber noch einfacher: Benutzen Sie in &kile; die Menüeinträge <menuchoice><guimenu>Assistent</guimenu><guimenuitem>Feld</guimenuitem></menuchoice> oder <menuchoice><guimenu>Assistent</guimenu><guimenuitem>Tabelle</guimenuitem></menuchoice>. Dann erhalten Sie ein Eingabeformular wie eine Matrix, die einfach auszufüllen ist. Im Dialog gibt es außerdem einige Einstellungen für den Schriftsatz der Tabelle.

source: <screeninfo>Inserting a tabular environment</screeninfo>
de: <screeninfo>Einfügen einer Tabellenumgebung</screeninfo>

source: <phrase>Inserting a tabular environment</phrase>
de: <phrase>Einfügen einer Tabellenumgebung</phrase>

source: Using the toolbar on top of the dialog you can set the <userinput>align</userinput> of a cell, define a certain <userinput>font style</userinput>, <userinput>join</userinput> and <userinput>split</userinput> cells, choose a <userinput>border</userinput>, and specify background and font <userinput>colors</userinput>. On the very right there is a <guilabel>Paste</guilabel> button. With this button you can insert a table from the clipboard into the dialog, which allows you to copy and paste tables from a spreadsheet program, for example.
de: In der Werkzeugleiste oben im Dialog können Sie <userinput>Ausrichtung</userinput> einer Zelle und einen <userinput>Schriftstil</userinput> festĺegen, Zellen <userinput>verbinden</userinput> und <userinput>teilen</userinput> und einen <userinput>Rand</userinput> und <userinput>Farben</userinput> für Schrift und Hintergrund wählen. Ganz recht finden Sie den Knopf <guilabel>Inhalt der Zwischenablage einfügen</guilabel>. Damit können Sie eine Tabelle aus der Zwischenablage in den Dialog einfügen. Damit können Sie zum Beispiel Tabellen aus einer Tabellenkalkulation einfügen.

source: At the bottom you can choose how many rows and columns you want, and you can tweak some more things about your array:
de: Unten im Dialog können Sie die Zahl der Zeilen und Spalten festlegen und weiter Einstellungen vornehmen.

source: With the <guilabel>Name</guilabel> option you can select which environment should be used for your array or tabular material.
de: Mit der Einstellung <guilabel>Name</guilabel> wählen Sie aus, welche Umgebung für Ihre Daten benutzt werden soll.

source: You can select the vertical cell alignment with the <guilabel>Parameter</guilabel> option. This is only enabled for environments which support that feature.
de: Sie können die vertikale Ausrichtung der Zellen kann mit der Einstellung <guilabel>Parameter</guilabel> eingestellt werden. Dies ist nur in Umgebungen verfügbar, die diese Funktion unterstützen.

source: If it exists for the selected environment, you can select <guilabel>use starred version</guilabel>. When you select this option, you also have to specify a <guilabel>table width</guilabel>.
de: Sie können <guilabel>*-Version verwenden</guilabel> auswählen, wenn sie für die gewählte Umgebung existiert. Aktivieren Sie diese Einstellung, dann müssen Sie auch eine <guilabel>Tabellenbreite</guilabel> angeben.

source: Tables sometimes look nicer when you select the <guilabel>use booktabs package</guilabel> option.
de: Tabellen sehen manchmal besser aus, wenn Sie die Einstellung <guilabel>Booktabs-Paket verwenden</guilabel> aktivieren.

source: Of course, you can also <guilabel>Center</guilabel> your whole array.
de: Natürlich können Sie das gesamte Feld auch <guilabel>Zentrieren</guilabel>.

source: <guilabel>Inserting bullets</guilabel> helps you when you want to fill in your content in the editor. With this option checked, &kile; will insert bullet placeholders for each element of your array.
de: <guilabel>Sprungmarken einfügen</guilabel> erleichtert die Eingabe des Inhalts im Editor. Mit dieser Einstellung fügt &kile; Platzhalter für Sprungmarken für jedes Element in der Tabelle ein.

source: The <menuchoice><guimenu>Wizard</guimenu><guimenuitem>Tabbing</guimenuitem></menuchoice> option will display a simpler dialog to quickly set up a tabbing environment. It allows you to easily specify the number of rows or columns and the required spacing.
de: Mit <menuchoice><guimenu>Assistent</guimenu><guimenuitem>Tabulatoren</guimenuitem></menuchoice>

source: Inserting floating elements
de: Einfügen von Gleitobjekten

source: &kile; helps you with inserting your floating elements. With the <menuchoice><guimenu>Wizard</guimenu><guimenuitem>Floats</guimenuitem></menuchoice> wizard it is very simple to create a new figure or table-environment.
de: &kile; unterstützt Sie beim Einfügen von Gleitobjekten. Mit <menuchoice><guimenu>Assistent</guimenu> <guimenuitem>Gleitobjekte</guimenuitem></menuchoice> öffnen Sie einen Dialog, um eine neue Abbildungs- oder Tabellen-Umgebung einzufügen.

source: <screeninfo>Inserting a floating element</screeninfo>
de: <screeninfo>Einfügen eines Gleitobjekts</screeninfo>

source: <phrase>Inserting a floating element</phrase>
de: <phrase>Einfügen eines Gleitobjekts</phrase>

source: To insert a new floating environment just follow these steps:
de: Um ein neues Gleitobjekt einzufügen, führen Sie folgende Schritte durch:

source: Choose whether you want to insert a figure or a table.
de: Wählen Sie, ob eine Abbildung oder eine Tabelle eingefügt werden soll.

source: Select the desired positioning rules.
de: Stellen Sie die Regeln für die gewünschte Position ein.

source: Enter a caption for your floating element.
de: Geben Sie einen Namen für das Gleitobjekt ein.

source: Type in a label for your new floating element. &kile; will automatically suggest an appropriate prefix , &eg; "fig:" for figures and "tab:" for tables.
de: Geben Sie eine Bezeichnung für das neue Gleitobjekt ein. &kile; schlägt automatisch ein passendes Präfix vor, &eg; „Abb.“ die Bilder und „Tab.“ für Tabellen.

source: Inserting Math environments
de: Einfügen von Mathematik-Umgebungen

source: Remembering how all the different math elements work can be really annoying. Of course &kile; can do the magic for you here: <menuchoice><guimenu>Wizard</guimenu><guimenuitem>Math</guimenuitem></menuchoice>
de: Das Einfügen der vielen verschiedenen Mathematik-Elemente kann ziemlich mühsam sein. &kile; unterstützt Sie dabei mit <menuchoice><guimenu>Assistent</guimenu><guimenuitem>Mathematik</guimenuitem></menuchoice> aus dem Menü.

source: <screeninfo>Inserting a math element</screeninfo>
de: <screeninfo>Einfügen eines Mathematik-Elements</screeninfo>

source: <phrase>Inserting a math element</phrase>
de: <phrase>Einfügen eines Mathematik-Elements</phrase>

source: Options:
de: Einstellungen:

source: <guilabel>Name:</guilabel> Choose the type of math element you want to create.
de: <guilabel>Name</guilabel>: Wählen Sie einen Typ für das Mathematikelement, das Sie einfügen möchten.

source: <guilabel>Without numbering:</guilabel> This can switch numbering off for numbered elements like equations or aligns.
de: <guilabel>Ohne Nummerierung:</guilabel> Damit schalten Sie die Nummerierung für normalerweise fortlaufend nummerierte Elemente wie Gleichungen ab.

source: <guilabel>Space command to separate groups:</guilabel> In an environment which supports several groups like alignat, you can define a space separator when you have more than one group. You can enter any space command here, which exists in mathmode, &eg; \quad.
de: <guilabel>Abstandsbefehl um Gruppen zu trennen:</guilabel> In einer Umgebung wie zum Beispiel „alignat“, in der mehrere Gruppen vorkommen dürfen, können Sie bei mehr als einer Gruppe einen Abstandsbefehl bestimmen. Jeder gültige Abstandsbefehl des Mathematikmodus ist hier erlaubt wie &eg; \quad.

source: <guilabel>Standard tabulator:</guilabel> Select the tabulator which should be used. &kile; should automatically pick the right one for you here.
de: <guilabel>Standard-Tabulator:</guilabel> Wählen Sie einen der vordefinierten Tabulatoren. Normalerweise ist hier bereits eine passende Voreinstellung ausgewählt.

source: <guilabel>Displaymath mode:</guilabel> For environments like matrices or arrays you can choose with which math environment your mathematical text should be displayed with.
de: <guilabel>Abgesetzter Modus:</guilabel> Für Umgebungen wie Matrizen oder Feldern können Sie auswählen, in welcher Mathematikumgebung der Text angezeigt werden soll

source: <guilabel>Use bullets:</guilabel> With this option checked, &kile; will insert bullet placeholders for each element of your mathematical text.
de: <guilabel>Sprungmarken einfügen:</guilabel> Mit dieser Einstellung fügt &kile; Platzhalter für Sprungmarken für jedes Element im mathematischen Text ein.

source: &PostScript; Utilities
de: &PostScript;-Werkzeuge

source: PS files are not so popular as PDF files, but are an excellent base for manipulations and rearrangements of pages. If you need PDF output, you can rearrange pages with some &PostScript; utilities and then convert it to PDF with <command>ps2pdf</command>.
de: <filename>PS</filename>-Dateien sind nicht so bekannt wie <filename>PDF</filename>-Dateien, bieten aber eine hervorragende Grundlage für Änderungen und Neuanordnungen von Seiten. Wird die <filename>PDF</filename>-Ausgabe benötigt, so können die Seiten mit ein paar &PostScript;-Werkzeugen neu angeordnet und dann mit <command>ps2pdf</command> in eine <filename>PDF</filename>-Datei umgewandelt werden.

source: The <emphasis>&PostScript; Wizard</emphasis> under <menuchoice><guimenu>Wizard</guimenu><guimenuitem>Postscript Tools</guimenuitem></menuchoice> will suggest the most popular rearrangement. The conversion is done by the programs <command>pstops</command> and <command>psselect</command>, which can be found in most distributions in the package <userinput>psutils</userinput>. If one of these programs is not available, the corresponding item will not be visible.
de: Der <emphasis>&PostScript;-Assistent</emphasis>, den Sie mit <menuchoice><guimenu>Assistent</guimenu><guimenuitem>Postscript-Werkzeuge</guimenuitem></menuchoice> starten, bietet eine Auswahl der am häufigsten benötigten Umstellungen. Die Änderungen werden mit den Programmen <command>pstops</command> und <command>psselect</command> durchgeführt. Diese Programmen finden Sie in den meisten Distributionen im Paket <userinput>psutils</userinput>. Ist eines der Programme nicht installiert, werden die zugehörigen Einträge nicht zur Auswahl angeboten.

source: <screeninfo>Dialog PSTools</screeninfo>
de: <screeninfo>Dialog „Umordnen einer Postscript-Datei“</screeninfo>

source: <phrase>Dialog PSTools</phrase>
de: <phrase>Dialog „Umordnen einer Postscript-Datei“</phrase>

source: First choose your input file. If &kile; finds a PS file corresponding to your current master document, it is already filled in as input file, but you are also free to choose another file. Then choose an output file, and select one of the tasks. Finally, you have to decide whether you want to do the conversion only, or also invoke &okular; to view the result.
de: Wählen Sie zuerst eine Eingabedatei. Findet &kile; ein passende Datei zu dem Master-Dokument, ist sie bereits als Eingabedatei vorgegeben. Sie können natürlich immer noch jede beliebige andere Datei auswählen. Wählen Sie dann die Ausgabedatei und eine der möglichen Umwandlungen. Nun müssen Sie nur noch angeben, ob nur die Umwandlung ausgeführt oder auch &okular; zur Anzeige des Ergebnisses aufgerufen werden soll.

source: 1 A5 page + empty page --> A4
de: 1 DIN A5-Seite + leere Seite --> DIN A4

source: Combine one A5 page together with one empty page on one A4 page. Whenever two A5 pages are combined together, they are rotated 90 degrees and will be arranged on an A4 page in landscape mode.
de: Fügt eine A5-Seite zusammen mit einer leeren Seite auf einer A4-Seite ein. Wenn zwei A5-Seiten zusammengefügt werden, werden Sie um 90° gedreht und auf der A4-Seite im Querformat angeordnet.

source: <screeninfo>A5 + empty page</screeninfo>
de: <screeninfo>DIN A5-Seite + leere Seite</screeninfo>

source: <phrase>A5 + empty page</phrase>
de: <phrase>DIN A5-Seite + leere Seite</phrase>

source: 1 A5 page + duplicate --> A4
de: 1 DIN A5-Seite + Duplikat --> DIN A4

source: Put one A5 page and a duplicate together on one A4 page.
de: Fügt eine A5-Seite und ein Duplikat auf einer A4-Seite zusammen.

source: duplicate A5 pages
de: 1 DIN A5-Seite + Duplikat --> DIN A4

source: Duplicate an A5 page
de: 1 DIN A5-Seite + Duplikat --> DIN A4

source: 2 A5 pages --> A4
de: 2 DIN A5-Seiten --> DIN A4

source: Put two consecutive A5 pages together on one A4 page.
de: Fügt zwei aufeinander folgende A5-Seiten auf einer A4-Seite zusammen.

source: <screeninfo>Combine two A5 pages</screeninfo>
de: <screeninfo>Zwei DIN A5-Seiten zusammenfügen</screeninfo>

source: <phrase>Combine two A5 pages</phrase>
de: <phrase>Zwei DIN A5-Seiten zusammenfügen</phrase>

source: 2 A5L pages --> A4
de: 2 DIN A5L-Seiten --> DIN A4

source: Put two consecutive A5 pages in landscape mode together on one A4 page.
de: Fügt zwei aufeinander folgende A5-Seiten im Querformat auf einer A4-Seite zusammen.

source: <term>4 A5 pages --> A4</term>
de: <term>4 DIN A5-Seiten --> DIN A4</term>
