Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/extragear-office/kile.po
Languages: de

source: Combine four consecutive A5 pages together on one A4 page. The A5 pages have to be scaled with factor 0.7 to fit on the page.
de: Fügt vier aufeinander folgende A5-Seiten auf einer A4-Seite zusammen. Die A5-Seiten müssen auf 71 % verkleinert werden, damit sie auf die Seite passen.

source: <screeninfo>4 A5 pages --> A4</screeninfo>
de: <screeninfo>4 DIN A5-Seiten --> DIN A4</screeninfo>

source: <phrase>4 A5 pages --> A4</phrase>
de: <phrase>4 DIN A5-Seiten --> DIN A4</phrase>

source: <term>1 A4 page + empty page --> A4</term>
de: <term>1 DIN A4-Seite + leere Seite --> DIN A4</term>

source: Combine one A4 page together with one empty page on one A4 page. Whenever two A4 pages are combined together on one resulting A4 page, they have to be scaled with factor 0.7 and will be arranged in landscape mode.
de: Fügt eine A4-Seite zusammen mit einer leeren Seite auf einer A4-Seite ein. Wenn zwei A4-Seiten auf einer A4-Seite zusammengefügt werden, müssen Sie auf 71 % verkleinert und im Querformat angeordnet werden.

source: <screeninfo>1 A4 page + empty page --> A4</screeninfo>
de: <screeninfo>1 DIN A4-Seite + leere Seite --> DIN A4</screeninfo>

source: <phrase>1 A4 page + empty page --> A4</phrase>
de: <phrase>1 DIN A4-Seite + leere Seite --> DIN A4</phrase>

source: <term>1 A4 page + duplicate --> A4</term>
de: <term>1 DIN A4-Seite + Duplikat --> DIN A4</term>

source: Put one A4 page and a duplicate together on one A4 page.
de: Fügt eine A4-Seite und ein Duplikat auf einer A4-Seite zusammen.

source: <screeninfo>1 A4 page + duplicate --> A4</screeninfo>
de: <screeninfo>1 DIN A4-Seite + Duplikat --> DIN A4</screeninfo>

source: <phrase>1 A4 page + duplicate --> A4</phrase>
de: <phrase>1 DIN A4-Seite + Duplikat --> DIN A4</phrase>

source: 2 A4 pages --> A4
de: 2 DIN A4-Seiten --> DIN A4

source: Put two consecutive A4 pages together on one A4 page.
de: Fügt zwei aufeinander folgende A4-Seiten auf einer A4-Seite zusammen.

source: <screeninfo>Combine two A4 pages</screeninfo>
de: <screeninfo>Zwei DIN A4-Seiten zusammenfügen</screeninfo>

source: <phrase>Combine two A4 pages</phrase>
de: <phrase>Zwei DIN A4-Seiten zusammenfügen</phrase>

source: 2 A4L pages --> A4
de: 2 DIN A4L-Seiten --> DIN A4

source: Put two consecutive A4 pages in landscape mode together on one A4 page.
de: Fügt zwei aufeinander folgende A4-Seiten im Querformat auf einer A4-Seite zusammen.

source: select even pages
de: Gerade Seiten auswählen

source: Select all even pages of a document.
de: Alle geraden Seiten eines Dokuments.

source: select odd pages
de: Ungerade Seiten auswählen

source: Select all odd pages of a document.
de: Alle ungeraden Seiten eines Dokuments.

source: select even pages (reverse order)
de: Gerade Seiten auswählen (in umgekehrter Reihenfolge)

source: Select all even pages of a document and reverse the order.
de: Alle geraden Seiten eines Dokuments in umgekehrter Reihenfolge.

source: select odd pages (reverse order)
de: Ungerade Seiten auswählen (in umgekehrter Reihenfolge)

source: Select all odd pages of a document and reverse the order.
de: Alle ungeraden Seiten eines Dokuments in umgekehrter Reihenfolge.

source: reverse all pages
de: Reihenfolge der Seiten umkehren

source: Reverse all pages of a document.
de: Kehrt die Reihenfolge aller Seiten eines Dokuments um.

source: copy all pages (sorted)
de: Alle Seiten kopieren (sortiert)

source: Copy all pages of a document. You have to choose the number of sorted copies.
de: Kopiert alle Seiten eines Dokuments. Sie müssen die Anzahl der sortierten Kopien auswählen.

source: <screeninfo>Copy all pages (sorted)</screeninfo>
de: <screeninfo>Alle Seiten kopieren (sortiert)</screeninfo>

source: <phrase>Copy all pages (sorted)</phrase>
de: <phrase>Alle Seiten kopieren (sortiert)</phrase>

source: copy all pages (unsorted)
de: Alle Seiten kopieren (unsortiert)

source: Copy all pages of a document. You have to choose the number of non-sorted copies.
de: Kopiert alle Seiten eines Dokuments. Sie müssen die Anzahl der nicht sortierten Kopien auswählen.

source: <screeninfo>Copy all pages (unsorted)</screeninfo>
de: <screeninfo>Alle Seiten kopieren (unsortiert)</screeninfo>

source: <phrase>Copy all pages (unsorted)</phrase>
de: <phrase>Alle Seiten kopieren (unsortiert)</phrase>

source: pstops: choose parameter
de: pstops: Wählen Sie Parameter

source: There are many options for &PostScript; utilities <command>pstops</command> and <command>psselect</command>. If you need a very special one, you can invoke <command>pstops</command> with an option of your choice. Please read the manual for all possible options.
de: Es gibt viele mögliche Einstellungen für <command>pstops</command> und <command>psselect</command>. Benötigen Sie spezielle Einstellungen, können Sie das Programm <command>pstops</command> auch direkt mit dieser Option aufrufen. Lesen Sie dazu das Handbuch für alle möglichen Einstellungen.

source: psselect: choose parameter
de: psselect: Wählen Sie Parameter

source: You can invoke <command>psselect</command> with an option of your choice. Please read the manual for all possible options.
de: Sie können <command>psselect</command> mit einer ausgewählten Option aufrufen. Bitte lesen Sie das Handbuch zu <command>psselect</command> für alle möglichen Optionen.

source: Document Statistics
de: Dokumentstatistik

source: The statistics dialog in <menuchoice><guimenu>File</guimenu><guimenuitem>Statistics</guimenuitem></menuchoice> gives you an statistical overview for a selection, a document or an whole project. It includes the number of words, &latex; commands/environments and also includes the number of characters for each type.
de: Der Statistikdialog in <menuchoice><guimenu>Datei</guimenu><guimenuitem>Statistik</guimenuitem></menuchoice> gibt eine Überblick über die aktuelle Auswahl, das Dokument oder das Projekt. In dieser Statistik wird die Anzahl der Wörter und Zahlen, die &latex;-Befehle und -Umgebungen und auch die Zahl der Zeichen für jeden Typ angegeben.

source: The statistics obtained can be copied as text or as a nicely formatted &latex; table to the clipboard.
de: Die Statistik kann als Text oder als formatierte &latex;-Tabelle kopiert werden.

source: When you select a text and open the statistics dialog, you get the statistics for the currently selected text. If you open the dialog without any text selected, the statistics for all opened files are shown. If you want to get statistics for the whole project, you can use <menuchoice><guimenu>Project</guimenu><guisubmenu>Open All Project Files</guisubmenu></menuchoice> for an easy and quick way to open all source files of your project.
de: Haben Sie einen Text ausgewählt und öffnen den Statistikdialog, werden die Informationen nur für den ausgewählten Text angegeben. Öffnen Sie den Dialog ohne eine Textauswahl, wird die Statistik für alle geöffneten Dateien angezeigt. Möchten Sie die Daten für Ihr gesamtes Projekt sehen, wählen Sie zuerst <menuchoice><guimenu>Projekt</guimenu><guisubmenu>Alle Projektdateien öffnen</guisubmenu></menuchoice> und öffnen dann den Statistikdialog.

source: A note of caution has to be sounded about the accuracy of the numbers. We have included some logic to get a good estimate, &eg; K\"uhler gives one word and one command, with six resp. two characters. But there are other combinations in which parts of commands are counted as words and vice versa. Please note that the algorithm was developed and tested for languages similar to English or German. So don't take the numbers for granted. If you write a report whose length has to be of a certain numbers of words or characters, please make some tests first in order to check whether &kile;'s accuracy satisfies your needs.
de: Ein Hinweis zur Genauigkeit der angegebenen Zahlen: Es wird einiger Aufwand betrieben, um ein richtiges Ergebnis zu liefern, &eg; K\"uhler zählt als ein Wort und Befehl mir sechs bzw. zwei Zeichen. Es gibt aber andere Kombinationen, in denen Teile von Befehlen als Wörter und umgekehrt gezählt werden. Der Algorithmus wurde für Sprachen wie Englisch und Deutsch entwickelt und getestet. Verlassen Sie sich daher nicht ausschließlich auf die Angaben im Programm. Schreiben Sie einen Bericht, der nur aus einer bestimmten Anzahl von Wörtern bestehen darf, überprüfen Sie vorher, ob die Genauigkeit der Berechnung für Sie ausreicht.

source: Special Tags in &latex;
de: Besondere Tags in &latex;

source: Using the &latex; Tag Library
de: Die &latex;-Tag-Bibliothek verwenden

source: &latex; has thousands of tags for symbols and special characters. The easiest way to insert these tags is to use the sidebar menu, left of the editor window.
de: &latex; enthält Tausende von Tags für Symbole und Sonderzeichen. Am einfachsten können diese Tags über die Seitenleiste links neben dem Editorfenster eingefügt werden.

source: <screeninfo>The Sidebar Menu</screeninfo>
de: <screeninfo>Das Seitenleistenmenü</screeninfo>

source: <phrase>The Sidebar Menu</phrase>
de: <phrase>Das Seitenleistenmenü</phrase>

source: <para>The Sidebar Menu</para>
de: <para>Das Seitenleistenmenü</para>

source: The following types are available:
de: Die folgenden Typen sind vorhanden:

source: Most Frequently Used
de: Am meisten Verwendete

source: Relation
de: Beziehungen

source: Operators
de: Operatoren

source: Arrows
de: Pfeile

source: Miscellaneous Math
de: Mathematik

source: Miscellaneous Text
de: Text

source: Delimiters
de: Trennzeichen

source: Greek
de: Griechisch

source: Special Characters
de: Sonderzeichen

source: Cyrillic Characters
de: Kyrillische Zeichen

source: User Defined
de: Benutzerdefiniert

source: The tooltips of the icons show the &latex; commands and additionally needed packages.
de: Die Kurzinfos der Symbole zeigen die &latex;-Befehle und zusätzlich erforderliche Pakete.

source: Pressing <keycombo>&Shift;</keycombo> and clicking a symbol will result in <userinput>$\symbolcmd$</userinput> being inserted. Similar pressing <keycombo>&Ctrl;</keycombo> inserts it in curly brackets.
de: Drücken Sie die &Shift;-Taste und klicken auf ein Symbol, dann wird <userinput>$\symbolcmd$</userinput> eingefügt. Mit der &Ctrl;-Taste wird das Symbol eingefügt und in geschweifte Klammern eingeschlossen.

source: If you insert a command which requires a package which is not included in your &latex; document, you will see a warning message in the logview window.
de: Wenn Sie einen Befehl einfügen, für den ein noch nicht in die &latex;-Umgebung eingeschlossenes Paket erforderlich ist, wird im Protokollfenster eine Warnung ausgegeben.

source: The first list of symbols holds the <guilabel>Most Frequently Used</guilabel> symbols. Inserted symbols will be added to this list, for quick and easy reference. The ordering of the symbols will not be changed upon addition of new symbols, instead a reference counter is incremented. If the number of items would exceed 30 items, the item with the lowest count will get removed.
de: Die erste Karteikarte enthält die <guilabel>Am meisten Verwendeten</guilabel> Symbole. Alle ins Dokument eingefügten Symbole werden auch hier für einen schnellen und einfachen Zugriff eingefügt. Die Reihenfolge der Anzeige wird durch die neu eingefügten Symbole nicht verändert. Statt dessen wird ein Referenzzähler verringert. Enthält die Liste mehr als 30 Einträge, wird das Element mit der niedrigsten Referenzzahl entfernt.

source: The <guilabel>User Defined</guilabel> symbol list can hold your own symbols. To create your own symbols you need the program gesymb and the file definitions.tex from the kile source package. Additionaly you need a &latex; compiler (what a surprise) and <ulink url="http://www.dvipng.sourceforge.net">&dvipng;</ulink> (version 1.7 or later). The procedure is so that you create a &latex; file with <userinput>\input{definitions}</userinput>, which makes the commands listed below available, and let <userinput>gesymb mysymbols.tex user</userinput> (which calls &latex; and &dvipng;) create the icons. After copying them to <userinput>$HOME/.kde/share/apps/kile/mathsymbols/user/</userinput> and restarting kile you can use your own symbols.
de: Die Symbolliste <guilabel>Benutzerdefiniert</guilabel> enthält Ihre eigenen Symbole. Um diese zu erstellen, benötige Sie das Programm „gesymb“ und die Datei „definitions.tex“ aus dem &kile;-Quelltextpaket. Zusätzlich brauchen Sie einen &latex;-Compiler und <ulink url="http://www.dvipng.sourceforge.net">&dvipng;</ulink> (Version 1.7 oder neuer). Dann erstellen Sie eine &latex;-Datei mit <userinput>\input{definitions}</userinput>, um die unten aufgeführten Befehle verfügbar zu machen. Dann erstellt <userinput>gesymb mysymbols.tex user</userinput>, das &latex; und &dvipng; aufruft, die Symbole. Kopieren Sie sie in den Ordner <userinput>$HOME/.kde/share/apps/kile/mathsymbols/user/</userinput> und starten Sie &kile; neu.

source: The following commands are defined in definitions.tex:
de: Folgende Befehle sind in „definitions.tex“ enthalten:

source: <userinput>\command[\optarg]{\symbol}</userinput>: Include the symbol <userinput>\symbol</userinput> in the symbol list, the optional argument <userinput>\optarg</userinput> specifies the command which kile should insert. If it is not given the command in the mandatory argument is used.
de: <userinput>\command[\optarg]{\symbol}</userinput>: Fügt das Symbol <userinput>\symbol</userinput> in die Liste ein, das optionale Argument <userinput>\optarg</userinput> gibt den Befehl an, der durch &kile; eingefügt werden soll. Ist kein Argument angegeben, wird der Standardwert benutzt.

source: <userinput>\mathcommand[\optarg]{\symbol}</userinput>: Same as above, except that the command in the mandatory argument is inserted in math mode.
de: <userinput>\mathcommand[\optarg]{\symbol}</userinput>: Wie vorher, nur dass das erforderliche Argument für den Befehl im Mathematikmodus eingefügt wird.

source: <userinput>\pkgs[arg]{pkg}</userinput>: Declare that the command given in this line needs the &latex; package <userinput>pkg</userinput> with the optional argument <userinput>arg</userinput>. This command has to be in front of the <userinput>\command</userinput> command and overrides any package specification by the neededpkgs enviroment.
de: <userinput>\pkgs[arg]{pkg}</userinput>: Legt fest, das der in dieser Zeile angegebene Befehl das &latex;-Paket <userinput>pkg</userinput> mit dem optionalen Argument <userinput>arg</userinput> benötigt. Dies muss vor dem Befehl <userinput>\command</userinput> stehen und überschreibt jede Paketangabe, die von der „neededpkgs“-Umgebung festgelegt wurde.

source: <userinput>\begin{neededpkgs}[pkgs-args]{pkgs} ... \end{neededpkgs}</userinput>: Has the same effect as above, but for all enclosed commands.
de: <userinput>\begin{neededpkgs}[pkgs-args]{pkgs} ... \end{neededpkgs}</userinput>: Hat den gleichen Effekt wie oben, aber für alle eingeschlossenen Befehle.

source: An example for completeness is given here:
de: Zur Vollständigkeit ist hier folgendes Beispiel angegeben:

source: Using Bibitems
de: Bibitems verwenden

source: <userinput>\bibitem</userinput> is a command used to enter a reference in a <userinput>thebibliography</userinput> environment in your document. The syntax for using <userinput>\bibitem</userinput> is <userinput>\bibitem[label]{key}</userinput>.
de: <userinput>\bibitem</userinput> ist ein Befehl, der für das Einfügen eines Verweises in einer <userinput>thebibliography</userinput>-Umgebung in Ihrem Dokument benutzt wird. Die richtige Syntax für <userinput>\bibitem</userinput> ist <userinput>\bibitem[label]{key}</userinput>.

source: The optional <userinput>[label]</userinput> is for you to add your own labeling system for the bibliography entry. If no label is set, the entries will be set in numerical order: [1], [2], [3], &etc;
de: Das optionale Argument <userinput>[label]</userinput> können Sie verwenden, um ein eigenes Beschriftungssystem für das Literaturverzeichnis zu benutzen. Ist dieses Argument nicht angegeben, werden die Einträge in aufsteigender Reihenfolge [1], [2], [3] &etc; durchnummeriert.

source: The argument <userinput>{key}</userinput> is used to reference and link the commands <userinput>\bibitem</userinput> and <userinput>\cite</userinput> to each other and the information they contain. The command <userinput>\cite</userinput> contains the label associated with the intended <userinput>\bibitem</userinput>, which is located inside a <userinput>thebibliography</userinput> environment, and contains the reference data. Both corresponding <userinput>\bibitem</userinput> and <userinput>\cite</userinput> must have the same <userinput>{key}</userinput>; the easiest way to organize keys is by the author's last name. The secondary braces in the <userinput>thebibliography</userinput> environment denote the longest bibliography label you expect to have. So, inserting <userinput>{<replaceable>foo</replaceable>}</userinput> means you can have any label shorter or as large as the expression <userinput><replaceable>foo</replaceable></userinput>. Failure to set this parameter correctly may result in a not so attractive indentation of your bibliography.
de: Das Argument <userinput>{key}</userinput> wird als Referenz und Verknüpfung der Befehle <userinput>\bibitem</userinput> und <userinput>\cite</userinput> und der darin enthaltenen Informationen benutzt. Der Befehl <userinput>\cite</userinput> enthält die Beschriftung, die dem Element <userinput>\bibitem</userinput> zugeordnet ist. Dieses Element ist von einer <userinput>thebibliography</userinput>-Umgebung eingeschlossen und enthält die Referenzdaten. Beide zusammengehörigen Befehle <userinput>\bibitem</userinput> und <userinput>\cite</userinput> müssen den gleichen Schlüssel <userinput>{key}</userinput> haben. Am einfachsten ist es, die Schlüssel aus dem Nachnamen des Autors zu generieren. Die zweiten geschweiften Klammern in der <userinput>thebibliography</userinput>-Umgebung geben den längsten erwarteten Beschriftungstext des Literaturverzeichnisses an. Mit <userinput>{<replaceable>foo</replaceable>}</userinput> können Sie jeder kürzere oder gleich lange Beschriftung als der Ausdruck <userinput><replaceable>foo</replaceable></userinput> verwenden. Fehler bei diesem Parameter können zu unschönen Einzügen im Literaturverzeichnis führen.

source: The bibliography is a section apart from your main document, and an example of code for the bibliography would look like the following:
de: Das Literaturverzeichnis ist ein eigener vom Hauptdokument getrennter Abschnitt. Ein Beispiel für den Quelltext für ein Vorlesungsverzeichnis:

source: Then, your main source code would contain the location of the information relating to the <userinput>\bibitem</userinput> using <userinput>\cite</userinput>. That source code would look similar to this:
de: Ihr Hauptquelltext sollte dann den Ort der Information bezüglich des Elements <userinput>\bibitem</userinput> mit dem Befehl <userinput>\cite</userinput> angeben. Der Quelltext sollte etwa so aussehen:

source: My thesis, about the philosophy of The Simpsons\copyright comes from my favorite book \cite{Simpson}.
de: Meine Doktorarbeit über die Philosophie der „Simpsons“\Copyright meines Lieblingsbuches \cite{Simpson}.

source: As it is often difficult to remember the exact citation key once you have many references, &kile; provides an easy way to insert a citation. Using <menuchoice><guimenu>LaTeX </guimenu><guimenuitem>References</guimenuitem><guimenuitem>Cite</guimenuitem></menuchoice> a list with all the citation keys pops up. Select the correct reference and a citation will be inserted into your document. To update the list of keys, either save the file, or <menuchoice><guimenu>Edit</guimenu><guimenuitem>Refresh Structure</guimenuitem></menuchoice>, or press <keycap>F12</keycap>. With code completion enabled, &kile; will show you a list of all the <userinput>bibitem</userinput>-labels as soon as you open up a <userinput>\cite</userinput> command.
de: Bei vielen Referenzen ist es schwierig, sich die richtigen Zitatschlüssel zu merken. Dabei kann Sie &kile; unterstützen. <menuchoice><guimenu>LaTeX</guimenu><guimenuitem>Referenzen</guimenuitem><guimenuitem>cite</guimenuitem></menuchoice> öffnet einen Dialog mit einer Liste der Zitatschlüssel. Wählen Sie daraus die richtige Referenz und eine Literaturstelle wird in Ihr Dokument eingefügt. Um die Liste der Schlüssel zu aktualisieren, speichern Sie entweder die Datei oder benutzen <menuchoice><guimenu>Bearbeiten</guimenu><guimenuitem>Dokumentstruktur aktualisieren</guimenuitem></menuchoice> bzw. den Kurzbefehl <keycap>F12</keycap>. Haben Sie die Quelltextvervollständigung aktiviert, zeigt &kile; eine Liste aller <userinput>bibitem</userinput>-Einträge an, wenn Sie den Befehl <userinput>\cite</userinput> einfügen.

source: The final result in your document's bibliography would then look like this:
de: Das endgültige Ergebnis im Literaturverzeichnis des Dokuments sieht dann folgendermaßen aus:

source: &kile; can also work together with &bibtex; editors, such as &kbibtex; to make it easier to enter citations. When a &bibtex; file is added to the project, &kile; will help you complete citation commands, just as described above
de: &kile; kann auch mit &bibtex;-Editoren wie &kbibtex; zusammenarbeiten, um das Einfügen von Zitaten zu vereinfachen. Wenn eine &bibtex;-Datei zum Projekt hinzugefügt wird, kann &kile; Sie bei der Vervollständigung der Zitatbefehle unterstützen, wie vorher beschrieben.

source: User-Defined Tags
de: Benutzerdefinierte Tags

source: &kile; gives you the ability to make your own tags. A tag is similar to a shortcut that launches some command or writes frequently-used text. For example, Joe Sixpack uses often the sentences <userinput>I prefer \LaTeX\ to \TeX\</userinput> and <userinput>What would I do without &Linux;?</userinput>. To create user-defined tags to write these sentences, he would access <menuchoice><guimenu>LaTeX</guimenu><guisubmenu>User Tags</guisubmenu><guimenuitem>Edit User Tags...</guimenuitem></menuchoice>; this will present him a dialog where he can create his own user-defined tags.
de: In &kile; können Sie benutzerdefinierte Tags erstellen. Ein Tag funktioniert wie ein Kurzbefehl, der Befehle ausführt oder häufig benutzen Text einfügt. Das können zum Beispiel Sätze wie <userinput>Ich arbeite lieber mit \LaTeX\ als mit \TeX\</userinput> und <userinput>Was würde ich ohne &Linux; machen?</userinput> sein. Um benutzerdefinierte Tags für diese Sätze zu erstellen, öffnen Sie mit <menuchoice><guimenu>LaTeX</guimenu><guisubmenu>Benutzerdefinierte Tags</guisubmenu><guimenuitem>Tags bearbeiten ...</guimenuitem></menuchoice> einen Dialog zur Definition und Bearbeitung.

source: <screeninfo>The Edit User Tags Dialog</screeninfo>
de: <screeninfo>Der Dialog „Tags bearbeiten“</screeninfo>

source: <phrase>The Edit User Tags Dialog</phrase>
de: <phrase>Der Dialog „Tags bearbeiten“</phrase>

source: <para>The Edit User Tags Dialog</para>
de: <para>Der Dialog „Tags bearbeiten“</para>

source: Invoking a User-Defined Tag
de: Aufruf eines benutzerdefinierten Tags

source: <phrase>Invoking a User Defined Tag</phrase>
de: <phrase>Aufruf eines benutzerdefinierten Tags</phrase>

source: <para>Invoking a User Defined Tag</para>
de: <para>Aufruf eines benutzerdefinierten Tags</para>
