Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/extragear-office/kile.po
Languages: de

source: The <guilabel>Structure</guilabel> view shows the hierarchy of the document being created in &kile;, and allows you to quickly navigate it, showing its segmentation. To navigate around your document, all you need to do is to left click on any label, chapter, section, subsection, etc., and you will be taken to the beginning of the corresponding area.
de: Die Ansicht <guilabel>Dokumentstruktur</guilabel> zeigt die Elemente und Abschnitte des in &kile; erstellten Dokuments in einer Baumansicht und ermöglicht eine schnelle Navigation. Um zu einer Beschriftung, einem Kapitel, einem Abschnitt oder Unterabschnitt zu gehen, klicken Sie mit der &LMB; auf diese Elemente in der Baumansicht und der Cursor springt zum Beginn des gewählten Elements.

source: If you included a separate &latex; file in your source using the <userinput>\input</userinput> or <userinput>\include</userinput> tags, these files will be referred to in the <guilabel>Structure</guilabel> view; double-clicking on their names in it will make &kile; bring up the included file in the editor window.
de: Wenn Sie eine getrennte &latex;-Datei mit <userinput>\input</userinput> oder <userinput>\include</userinput> in Ihren Quelltext einschließen, werden die Namen dieser Dateien in der Ansicht <guilabel>Dokumentstruktur</guilabel> angezeigt. Doppelklicken Sie auf die Namen, u die zugehörigen Dateien im Editorfenster zu öffnen.

source: The hierarchy tree has also a separate branch for labels used in the text.
de: Im Hierarchiebaum finden Sie auch einen eigenen Zweig mit den im Text benutzen Beschriftungen.

source: Using the Context Menu
de: Verwendung des Kontextmenüs

source: Most of the entries in the structure view have a lot of entries in the context menu, which you can open with a right mouse click. So look at the structure view in the following picture.
de: Die meisten Elemente in der Strukturansicht haben viele Menüeinträge im Kontextmenü, das durch Klicken mit der &RMBn; geöffnet wird. Dazu ein Bildschirmfoto der Strukturansicht:

source: <screeninfo>Using the Structure View</screeninfo>
de: <screeninfo>Verwendung der Strukturansicht</screeninfo>

source: <phrase>Using the Structure View</phrase>
de: <phrase>Verwendung der Strukturansicht</phrase>

source: You will find some labels, some sectioning entries, two figure environments and three pictures. If you right click on one of the sectioning entries, a menu with some useful commands will popup. All commands like <guibutton>Select</guibutton>, <guibutton>Delete</guibutton> or <guibutton>Comment</guibutton> will work with all lines, which belong to this section.
de: Sie sehen in der Dokumentenstruktur einige Beschriftungen und Abschnittselemente, zwei Abbildungsumgebungen und drei Bilder. Klicken Sie mit der &RMB; auf die Abschnittselemente, erscheint ein Kontextmenü mit nützlichen Menüeinträgen. Alle Befehle im Kontextmenü wie <guibutton>Auswählen</guibutton>, <guibutton>Entfernen</guibutton> oder <guibutton>Kommentar</guibutton> betreffen alle Zeilen in dem Abschnitt.

source: <screeninfo>Context menu for sectioning entries</screeninfo>
de: <screeninfo>Kontextmenü für Gliederungseinträge</screeninfo>

source: <phrase>Context menu for sectioning entries</phrase>
de: <phrase>Kontextmenü für Gliederungseinträge</phrase>

source: Clicking on a figure or table entry will offer some actions with respect to references and a right click on a graphics entry will offer some programs to open the graphics.
de: Klicken Sie auf eine Abbildung oder Tabelle, um ein Kontextmenü für Referenzen zu öffnen. Klicken Sie mit der &RMBn; auf ein Grafikelement, enthält das Kontextmenü Einträge für Programme, die diese Grafiken anzeigen können.

source: <screeninfo>Context menu for figure/tables and graphics entries</screeninfo>
de: <screeninfo>Kontextmenü für Abbildungen/Tabellen und grafische Elemente</screeninfo>

source: <phrase>Context menu for figure/tables and graphics entries</phrase>
de: <phrase>Kontextmenü für Abbildungen/Tabellen und grafische Elemente</phrase>

source: Updating the Structure View
de: Strukturansicht aktualisieren

source: To update your structure view you can either go to <menuchoice><guimenu>Edit</guimenu><guimenuitem>Refresh Structure</guimenuitem></menuchoice>, hit <keycombo><keycap>F12</keycap></keycombo>, or you can save your document, which will make &kile; update its <guilabel>Structure</guilabel> view.
de: Um die Strukturansicht zu aktualisieren, wählen Sie entweder <menuchoice><guimenu>Bearbeiten</guimenu><guimenuitem> aktualisieren</guimenuitem></menuchoice>, benutzen den Kurzbefehl <keycap>F12</keycap> oder speichern Ihr Dokument, dann aktualisiert &kile; die Ansicht der <guilabel>Dokumentstruktur</guilabel>.

source: Bookmarks
de: Lesezeichen

source: Bookmarks are your reference to a segment of text or a line inside the &kile; environment. To use a bookmark, select a specific line of your document you would like to return to, then press <keycombo>&Ctrl; <keycap>B</keycap></keycombo>, and &kile; will add a bookmark to this line. Alternatively, you can also set a bookmark by highlighting a line and choosing the menu labeled <menuchoice><guimenu>Bookmarks</guimenu><guimenuitem>Set Bookmark</guimenuitem></menuchoice>.
de: Lesezeichen enthalten verweise auf Textabschnitte oder Textzeilen im &kile;-Dokument. Um ein Lesezeichen zu setzen, wählen Sie eine bestimmte Zeile in Ihren Dokument und drücken dann <keycombo>&Ctrl; <keycap>B</keycap></keycombo>. Dann fügt &kile; ein Lesezeichen für diese Zeile ein. Außerdem können Sie eine Zeile in Ihrem Dokument hervorheben und im Menü <menuchoice><guimenu>Lesezeichen</guimenu><guimenuitem>Lesezeichen setzen</guimenuitem></menuchoice> verwenden.

source: To remove all your bookmarks, select <menuchoice><guimenu>Bookmarks</guimenu> <guimenuitem>Clear All Bookmarks</guimenuitem></menuchoice>.
de: Die Lesezeichen können mittels <menuchoice><guimenu>Lesezeichen</guimenu> <guimenuitem>Alle Lesezeichen löschen</guimenuitem></menuchoice> entfernt werden.

source: Projects
de: Projekte

source: Working with Projects
de: Mit Projekten arbeiten

source: In &kile; you can create and work with <emphasis>projects</emphasis>. A project is a group of &latex;, graphic, &bibtex;, or other files that contain all the information that is used to build your complete document. A typical project would be a document consisting of several chapters, written in different <literal role="extension">.tex</literal> files; all of them could be included in a project, to make the whole document easier to manage. The specifications of the project are stored in a special file, with extension <literal role="extension">.kilepr</literal>.
de: In &kile; können Sie <emphasis>Projekte</emphasis> erstellen und damit arbeiten. Ein Projekt is eine Gruppe von &latex;-, Grafik-, &bibtex;- und anderen Dateien, die alle Informationen enthalten, um Ihr gesamtes Dokument zu erzeugen. Ein typisches Projekt besteht aus einem Dokument mit mehreren Kapiteln in verschiedenen <literal role="extension">.tex</literal>-Dateien. Alle einzelnen Dateien sind in einem Projekt zusammengefaßt, das erleichtert die Bearbeitung. Die Beschreibung des Projekts wird in einer besonderen Datei mit der Erweiterung <literal role="extension">.kilepr</literal> gespeichert.

source: A Project adds the following functionalities:
de: Ein Projekt hat folgende zusätzliche Funktionen:

source: You need not set a master document, &kile; does this automatically.
de: Es muss kein Master-Dokument bestimmt werden, das erfolgt in &kile; automatisch.

source: Project files can easily be archived together by going to <menuchoice><guimenu>Project</guimenu><guimenuitem>Archive</guimenuitem></menuchoice>
de: Projektdateien können mit <menuchoice><guimenu>Erstellen</guimenu><guimenuitem>Archivieren</guimenuitem></menuchoice> als Archiv zusammen gefasst werden.

source: The <guilabel>Files and Projects</guilabel> view shows which files are included in the project.
de: Die Ansicht <guilabel>Dateien- und Projekte</guilabel> zeigt an, welche Dateien zum Projekt gehören.

source: After opening a project, any file that was previously opened will be restored with the original encoding and highlightning.
de: Nach dem Öffnen eines Projekts wird jede bereits früher geöffnete Datei mit der ursprünglichen Kodierung und Hervorhebung wieder geöffnet.

source: Code completion works across all project files.
de: Quelltext-Vervollständigung funktioniert über alle Projektdateien.

source: Reference completion works across all project files.
de: Referenz-Vervollständigung funktioniert über alle Projektdateien.

source: Citation completion works across all project files.
de: Zitat-Vervollständigung funktioniert über alle Projektdateien.

source: Search in all project files.
de: Die Suche funktioniert über alle Projektdateien.

source: Specify custom quickbuild and &makeidx; command.
de: Benutzerdefinierte Befehle für Schnellbau und &makeidx; können festgelegt werden.

source: You can find all project related commands in the <guilabel>Project</guilabel>-menu. From there you can open, close and manage your projects.
de: Alle projektspezifischen Befehle finden Sie im Menü <guilabel>Projekte</guilabel>. Damit können Sie Ihre Projekte öffnen, schließen und verwalten.

source: Creating a Project
de: Ein Projekt erstellen

source: To create a project, select <menuchoice><guimenu>Project</guimenu> <guimenuitem>New Project...</guimenuitem></menuchoice>. You will be asked to give the following information to create your project:
de: Ein neues Projekt wird über das Menü <menuchoice><guimenu>Projekt</guimenu><guimenuitem>Neues Projekt ...</guimenuitem></menuchoice>. Hierbei werden folgende Informationen für das Projekt abgefragt:

source: Title of your project.
de: Titel des Projekts

source: Name of the project file with <literal role="extension">.kilepr</literal> extension.
de: Name der Projektdatei (<filename role="extension">*.kilepr</filename>)

source: Filename.
de: Dateiname

source: Type of file creating: Empty Document, Article, Book, Letter, Report, ....
de: Art des Dokuments: Leeres Dokument, Artikel, Buch, Brief, Bericht, ...

source: When you fill out the <guilabel>filename</guilabel> box, you have to include a relative path from where the <literal role="extension">.kilepr</literal> project file is stored to the file.
de: Beim Ausfüllen des <guilabel>Dateinamen</guilabel>-Fensters muss der relative Pfad von der <filename role="extension">.kilepr</filename>-Projektdatei angegeben werden.

source: <title>The Files and Projects View</title>
de: <title>Datei- und Projektansicht</title>

source: The <guilabel>Files and Projects</guilabel> view is a button of the sidebar menu. From this view, you can see the structure of your project, its files, and the name of the <literal role="extension">.kilepr</literal> file that stores the project information. Adding, removing, or changing options in your project is done via the <guilabel>Files and Projects</guilabel> view.
de: Die Ansicht <guilabel>Dateien und Projekte</guilabel> können Sie über den Knopf in der Seitenleiste ein- und ausschalten. In dieser Ansicht wird die Struktur des Projekts, die darin enthaltenen Dateien und der Name der <literal role="extension">.kilepr</literal>-Datei, die die Informationen des Projekts speichert, dargestellt. Das Hinzufügen, Entfernen und Ändern von Einstellungen für das Projekt erfolgt in der Ansicht <guilabel>Dateien und Projekte</guilabel>.

source: <screeninfo>The Files and Projects View</screeninfo>
de: <screeninfo>Datei- und Projektansicht</screeninfo>

source: <phrase>The Files and Projects View</phrase>
de: <phrase>Datei- und Projektansicht</phrase>

source: <para>The Files and Projects View</para>
de: <para>Datei- und Projektansicht</para>

source: Adding and Removing Files
de: Dateien hinzufügen und entfernen

source: To add a file to your project, open any &tex; file, right click on its name in the <guilabel>Files and Projects</guilabel> view, and select <guilabel>Add to Project</guilabel>. If you have opened multiple projects, a dialog box will pop up in which you can specify to which project the file should be added.
de: Um eine Datei in Ihr Projekt einzufügen, öffnen Sie eine beliebige &tex;-Datei, klicken mit der &RMBn; auf den Namen in der Ansicht <guilabel>Dateien und Projekte</guilabel> und wählen aus dem Kontextmenü <guilabel>Zum Projekt hinzufügen</guilabel>. Haben Sie mehrere Projekte geöffnet, erscheint ein Dialog, in dem Sie angeben können, zu welchem Projekt die Datei hinzugefügt werden soll.

source: You can also right-click on the project's name in the <guilabel>Files and Projects</guilabel> view, and select <guilabel>Add Files...</guilabel> to bring up a file selection dialog.
de: Sie können auch mit der &RMBn; auf den Projektnamen in der Ansicht <guilabel>Dateien und Projekte</guilabel> klicken und aus dem Kontextmenü <guilabel>Dateien hinzufügen ...</guilabel> wählen. Damit öffnen Sie einen Dateiauswahldialog.

source: <screeninfo>Adding a file to a project</screeninfo>
de: <screeninfo>Datei zu einem Projekt hinzufügen</screeninfo>

source: <phrase>Adding a file to a project</phrase>
de: <phrase>Datei zu einem Projekt hinzufügen</phrase>

source: <para>Adding a file to a project</para>
de: <para>Datei zu einem Projekt hinzufügen</para>

source: To remove a file from a project, right-click on it and select <guilabel>Remove File</guilabel>. This does <emphasis>not</emphasis> delete your file (and also does not close it), but only removes it from the list of files contained in the <literal role="extension">.kilepr</literal> extension.
de: Um eine Datei aus einem Projekt zu entfernen, klicken Sie mit der &RMBn; auf den Dateinamen und wählen <guilabel>Aus Projekt entfernen </guilabel>. Damit wird die Datei <emphasis>nicht</emphasis> gelöscht, sondern nur aus der Liste der Projektdateien in der <literal role="extension">.kilepr</literal>-Datei entfernt.

source: Archiving your Project
de: Archivieren eines Projekts

source: &kile; allows you to easily backup your project by storing all its files into a single archive (often known as <emphasis>tarball</emphasis>). To archive your project, right-click on its name in the <guilabel>Files and Projects</guilabel> view, or select <menuchoice><guimenu>Project</guimenu><guimenuitem>Archive</guimenuitem></menuchoice>.
de: Mit &kile; können Sie Ihr gesamtes Projekt einfach archivieren, indem Sie alle Dateien in ein einziges Archiv (auch <emphasis>tarball</emphasis> genannt) packen. Dazu klicken Sie mit der &RMBn; auf den Projektnamen in der Ansicht <guilabel>Dateien und Projekte</guilabel> oder wählen aus dem Menü <menuchoice><guimenu>Projekt</guimenu><guimenuitem>Archivieren</guimenuitem></menuchoice>.

source: By default, all files in a project are added to the archive. If you do not want to include a certain file in the archive, right-click on it in the <guilabel>Files and Projects</guilabel> view, and uncheck the <guilabel>Include in Archive</guilabel> option.
de: In der Voreinstellung werden alle Dateien im Projekt zum Archiv hinzugefügt. Möchten Sie eine bestimmte Datei davon ausschließen, klicken Sie in der Ansicht <guilabel>Dateien und Projekte</guilabel> mit der &RMBn; auf den Dateinamen und deaktivieren die Einstellung <guilabel>In Archiv einbinden</guilabel>.

source: The archive operation is currently realized by executing the <command>tar</command> from the project folder (where the <literal role="extension">.kilepr</literal> file is located).
de: Das Archiv wird im Projektordner, der die <literal role="extension">.kilepr</literal>-Datei enthält, mit dem Befehl <command>tar</command> ausgeführt.

source: Project Options
de: Projekteinstellungen

source: &kile; has a few options related to your project that can be set. To change them, right-click on the title of your project and select <guilabel>Project Options</guilabel>, and you will have the option of changing:
de: &kile; hat einige Einstellungen für Ihr Projekt, die bestimmt werden müssen. Um diese Einstellungen zu ändern, klicken Sie mit der &RMBn; auf den Projektnamen und wählen im Kontextmenü <guilabel>Projekt-Einstellungen</guilabel>. Dann können Sie folgendes ändern:

source: The title of your project.
de: Der Titel des Projekts.

source: Default file extensions.
de: Standard-Dateierweiterungen

source: The Master document.
de: Das Master-Dokument

source: The Quickbuild command.
de: Der Schnellbau-Befehl

source: The &makeidx; options.
de: Die Optionen für &makeidx;.

source: Closing a Project
de: Schließen eines Projekts

source: To close a project, select the <guilabel>Files and Projects</guilabel> view from the vertical toolbar, right click on your project title, and then select <guimenuitem> Close</guimenuitem>. This will close your project, all the files associated with your project, and will also add the name of the project you just closed to <guisubmenu>Open Recent Project...</guisubmenu> in the <guimenu>Project</guimenu> menu.
de: Um ein Projekt zu schließen, wählen Sie die Ansicht <guilabel>Dateien und Projekte</guilabel> in der Seitenleiste. Klicken mit der &RMBn; auf den Projektnamen und wählen aus dem Kontextmenü <guilabel>Schließen</guilabel>. Damit wird Ihr Projekt einschließlich aller zugehörigen Dateien geschlossen. Der Projektname wird dann auch zu den Einträgen in <guisubmenu>Zuletzt geöffnete Projekte ...</guisubmenu> im Menü <guimenu>Projekte</guimenu> hinzugefügt.

source: Document Encoding
de: Dokument-Kodierung

source: The &kile; editor allows you to read, convert and save text in the character encoding your document needs. With this it is possible, for example, to use accented characters such as they are commonly used in Italian or French directly in &latex; documents. Selecting the encoding for your document can be done in two ways:
de: Im &kile;-Editor ist es möglich, Texte in der für Ihr Dokument geeigneten Zeichenkodierung zu lesen und zu speichern. Damit können Sie zum Beispiel Sonderzeichen mit Akzenten aus den Französisch oder Italienisch direkt in &latex;-Dokumenten verwenden. Die Zeichenkodierung eines Dokuments kann auf zwei Arten eingestellt werden.

source: One way to set the document encoding is by using the submenu <menuchoice><guimenu>Settings</guimenu><guisubmenu>Configure Kile...</guisubmenu><guimenuitem>Editor</guimenuitem></menuchoice>, where you can set the default character encoding for all files.
de: Die Standardkodierung für alle Dokumente können Sie in <menuchoice><guimenu>Einstellungen</guimenu><guisubmenu>Kile einrichten ...</guisubmenu><guimenuitem>Editor</guimenuitem></menuchoice> einstellen.

source: <screeninfo>Set the default character encoding</screeninfo>
de: <screeninfo>Einstellung der Standard-Kodierung</screeninfo>

source: <phrase>Set the default character encoding</phrase>
de: <phrase>Einstellung der Standard-Kodierung</phrase>

source: A second way to set the encoding for a document is to choose the desired encoding within the wizard to create a new document.
de: Um die Kodierung für ein Dokument einzustellen, können Sie außerdem die gewünschte Kodierung im Assistenten für neue Dokumente einstellen.

source: &latex; itself only understands ASCII, which represents a very limited set of characters. Hence, it is not possible to use accented characters directly. To use them nevertheless, a special syntax was invented: such as for example <userinput>\"e</userinput> for <computeroutput>ë</computeroutput>. The <application>inputenc</application> package is available to help you with this. It is included in the preamble using <userinput>\usepackage[latin1]{inputenc}</userinput>, where the optional argument specifies the encoding you would like to use (nowadays in most cases <userinput>utf8</userinput>). This tells &latex; to translate all of the <userinput>ë</userinput>'s you wrote to <userinput>\"e</userinput>'s before compiling. Please refer to the <application>inputenc</application> documentation directly for more information. Last but not least: remember to make sure that your file is <emphasis>actually</emphasis> saved in the same encoding you specified for the <application>inputenc</application> package!
de: &latex; selbst kann nur den begrenzten ASCII-Zeichensatz verarbeiten. Daher können Sonderzeichen nicht direkt benutzt werden. Um Sonderzeichen trotzdem eingeben zu können, wird eine besondere Schreibweise wie zum Beispiel <userinput>\"e</userinput> for <computeroutput>ë</computeroutput> verwendet. Das Paket <application>inputenc</application> unterstützt Sie bei diesen Sonderzeichen. Es wird in der Einleitung mit <userinput>\usepackage[latin1]{inputenc}</userinput> eingebunden, dabei gibt das optionale Argument die zu verwendende Kodierung, in den meisten Fällen <userinput>utf8</userinput>, an. Damit übersetzt &latex; for der Kompilierung alle eingegebenen <userinput>ë</userinput>s in <userinput>\"e</userinput>s. Weitere Informationen finden Sie in der Dokumentation um Paket <application>inputenc</application>. Denken Sie aber in jedem Fall daran, Ihre Datei <emphasis>tatsächlich</emphasis> in der Kodierung zu speichern, die für das Paket <application>inputenc</application> angegeben wurde.

source: This multitude of different character coding tables has created numerous problems: for example, you cannot write a course of Turkish in French without losing one language's special characters. There is general agreement that, sooner or later, everybody will switch to <ulink url="http://www.unicode.org">Unicode</ulink>. There are many implementations of Unicode, and <abbrev>UTF-8</abbrev> is the most successful in &Linux;; &Windows;&reg; relies instead on the more cumbersome and less flexible <abbrev>UCS-2</abbrev>. Most distributions have already begun setting their default encoding to <abbrev>UTF-8</abbrev>, and therefore you may be very interested in using of the <userinput>utf8</userinput> argument to the <userinput>inputenc</userinput> package.
de: Aus dieser Vielzahl von verschiedenen Tabellen zu Zeichenkodierung entstehen ebenso viele Probleme: Sie können zum Beispiel ein Lehrbuch für Türkisch in französisch schreiben, aber Sie müssen auf die Sonderzeichen in einer der beiden Sprachen verzichten. Um diese Probleme zu vermeiden, sollte <ulink url="http://www.unicode.org">Unicode</ulink> benutzt werden. In &Linux;-Systemen wird im allgemeinen <abbrev>UTF-8</abbrev>verwendet. &Windows;&reg; dagegen benutzt das unhandliche und weniger flexible <abbrev>UCS-2</abbrev>. In den meisten Distributionen wird bereits <abbrev>UTF-8</abbrev> als Kodierung verwendet. Deshalb sollten Sie das Argument <userinput>utf8</userinput> für das Paket <userinput>inputenc</userinput> in der Einleitung benutzen.

source: The &ucs; Package
de: Das Paket &ucs;

source: If you don't have the &ucs; package installed, you can proceed as follows:
de: Ist das Paket &ucs; nicht auf Ihrem Rechner installiert, gehen Sie wie folgt vor:

source: Get the &ucs; package from <ulink url="http://www.ctan.org/tex-archive/macros/latex/contrib/unicode/">CTAN</ulink>.
de: Laden Sie das Paket &ucs; von <ulink url="http://www.ctan.org/tex-archive/macros/latex/contrib/unicode/">CTAN</ulink>.

source: To install it, unpack the downloaded file and place it in a folder listed in your $<envar>TEXINPUTS</envar> environment variable. This can also be set inside kile.
de: Um es zu installieren, entpacken Sie die heruntergeladenen Dateien in Ordner, der in Ihrer $<envar>TEXINPUTS</envar>-Umgebungsvariable enthalten ist. Diese Einstellung können Sie auch in &kile; vornehmen.
