Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/extragear-office/kile.po
Languages: de

source: &DVI; stands for <emphasis>DeVice Independent</emphasis> file. These files are produced by &tex; or &latex; to be read by a driver of some sort on your computer. There are many different types of output that a <literal role="extension">.dvi</literal> can be sent to, such as a printer, &PostScript; or PDF file converter, or your computer screen.
de: <filename>&DVI;</filename> ist ein geräteunabhängiges Dateiformat (engl. <keycap>D</keycap>e<keycap>V</keycap>ice <keycap>I</keycap>ndependent). Diese Dateien werden von &tex; oder &latex; für die Lesbarkeit von einigen Treibern des Computers erstellt. Es gibt viele verschiedene Arten der <filename>.dvi</filename>-Ausgabe wie Drucker, &PostScript;/<filename>PDF</filename>-Umwandler oder Computerbildschirme.

source: Viewing a &DVI;
de: <filename>&DVI;</filename>-Datei ansehen

source: You have already seen how to view a &DVI; file on the screen by using the <guibutton>ViewDVI</guibutton> button in the toolbar.
de: Der Knopf <guibutton>DVI betrachten</guibutton> in der Werkzeugleiste sollte bereit aufgefallen sein.

source: Printing a &DVI;
de: <filename>&DVI;</filename>-Datei ausdrucken

source: To print a &DVI;, you can use the same process that you used to create your document earlier (see <xref linkend="quick_using" role="select: title pageabbrv"/>). At step 7, after clicking <guibutton>ViewDVI</guibutton>, select <menuchoice><guimenu>File</guimenu><guimenuitem>Print</guimenuitem></menuchoice> in the viewer, and if you have your printer properly configured, you will be able to print the &DVI;.
de: Für das Drucken einer &DVI;-Datei sind dieselben Schritte wie für die Erstellung des Dokuments nötig (siehe <xref linkend="quick_using" role="select: title pageabbrv"/>). Beim 7. Schritt - nach dem Klicken auf <guibutton>DVI betrachten</guibutton> - kann dann das Dokument mittels <menuchoice><guimenu>Datei</guimenu><guimenuitem>Drucken</guimenuitem></menuchoice> (im Betrachter) ausgedruckt werden (sofern der Drucker richtig eingestellt ist).

source: Converting &DVI; files
de: <filename>&DVI;</filename>-Dateien umwandeln

source: The toolbar gives the options of Converting a &DVI; to other formats. Once you have created a &DVI; from your &latex; source code, you will be able to export it to a format of your choice using the toolbar buttons.
de: Die Werkzeugleiste ermöglicht die Umwandlung der <filename>&DVI;</filename>-Datei in andere Formate. Sobald die <filename>&DVI;</filename>-Datei aus dem &latex;-Quelltext erstellt wurde, kann die Umwandlung in gewünschte andere Formate mittels der Knöpfe in der Werkzeugleiste beginnen.

source: Forward Search between &kile; and &okular;
de: Vorwärtssuche zwischen &kile; und &okular;

source: The forward search functions allow you to jump from your editor directly into the associated position of the &DVI; or PDF file.
de: Die Vorwärtssuche ermöglicht den direkten Sprung vom Editor zur dazugehörigen Position innerhalb der &DVI;- oder PDF-Datei.

source: &kile; offers a configuration with this option for all &latex; binaries. Go to <menuchoice><guimenu>Settings</guimenu><guisubmenu>Configure Kile...</guisubmenu> <guimenuitem>Tools</guimenuitem><guilabel>Build</guilabel></menuchoice> and always choose the <guilabel>Modern</guilabel> configuration.
de: &kile; bietet eine entsprechende Einstellung für alle &latex;-Binärdateien. Hierzu muss lediglich <guilabel>Modern</guilabel> unter <menuchoice><guimenu>Einstellungen</guimenu><guisubmenu>Kile einrichten ...</guisubmenu><guimenuitem>Werkzeuge</guimenuitem><guilabel>Bauen</guilabel></menuchoice> ausgewählt werden.

source: To execute a forward search, position the cursor on a line of source code, and click <guilabel>Forward Search</guilabel> to jump to the associated position in the &DVI; or PDF viewer window.
de: Um die Vorwärtssuche auszuführen, muss der Mauszeiger in einer Zeile des Quelltextes positioniert und anschließend auf <guilabel>Vorwärtssuche</guilabel> geklickt werden. Der Sprung zur entsprechenden Stelle im Betrachter erfolgt sodann.

source: Inverse Search between &kile; and &okular;
de: Rückwärtssuche zwischen &kile; und &okular;

source: Inverse search is a very useful feature when you are writing a &latex; document yourself. If everything is set up properly, you can click into &okular;'s window with the <mousebutton>left</mousebutton> mouse button while pressing &Shift;. After that &kile; loads the &latex; source file and jumps to the proper paragraph. To use inverse search, you have to compile your &latex; file with the <guilabel>Modern</guilabel> configuration.
de: Die Rückwärtssuche ist beim Schreiben eines &latex;-Dokuments sehr hilfreich. Wenn alles richtig eingestellt ist, kann sie in &okular; durch Klicken mit der &LMB; und der &Shift;-Taste ausgeführt werden. &kile; lädt die &latex;-Quelldatei und springt zur entsprechenden Stelle. Um die Rückwärtssuche verwenden zu können, muss die &latex;-Datei mit der Einstellung <guilabel>Modern</guilabel> kompiliert werden.

source: Inverse search cannot work unless:
de: Die folgenden Voraussetzungen sind für die Rückwärtssuche notwendig:

source: The source file has been compiled successfully.
de: Die Quelldatei wurde erfolgreich kompiliert.

source: &okular; knows which editor you would like to use.
de: Der Editor, den Sie verwenden möchten, muss in &okular; eingestellt werden.

source: With this feature of &okular;, a left mouse click while pressing &Shift; in the &DVI; or PDF document will result in &kile; opening the corresponding &latex; document and attempt to go to the corresponding line. Remember to tell &okular; to use &kile; as a text editor, in &okular;'s menu item <menuchoice><guimenu>Settings</guimenu><guimenuitem>Configure Okular...</guimenuitem></menuchoice> (on the page <guimenuitem>Editor</guimenuitem>).
de: Mit dieser Funktion in &okular; wird mit einem Klick der &LMBn; und dem Gedrückthalten der &Shift;-Taste im <filename>&DVI;</filename>- oder PDF-Dokument das entsprechende &latex;-Dokument von &kile; geöffnet und zur entsprechenden Zeile gesprungen. Hierzu muss &kile; in &okular; als Texteditor festgelegt werden (<menuchoice><guimenu>Einstellungen</guimenu><guimenuitem>Okular einrichten ...</guimenuitem><guilabel>Editor</guilabel></menuchoice>)

source: <screeninfo>Configuring &okular;</screeninfo>
de: <screeninfo>&okular; einrichten</screeninfo>

source: <phrase>Configuring &okular;</phrase>
de: <phrase>&okular; einrichten</phrase>

source: <para>Configuring &okular;</para>
de: <para>&okular; einrichten</para>

source: Resolving Errors
de: Fehlerbehebung

source: If you are trying to use quickbuild, and the &DVI; viewer does not open, chances are you have an error. If you have an error, it will be visible in the log file / message area, and the summary of the error will be given.
de: Sollte beim Verwenden von <guilabel>Schnellbau</guilabel> der &DVI;-Betrachter nicht öffnen, kann ein Fehler vorliegen. Sollte ein Fehler vorliegen, wird dies in der Protokolldatei bzw. im Nachrichtenfenster zusammenfassend angezeigt.

source: The log file will explain the source of the error in your code. In the editor, you can use the buttons in the toolbar labeled <guibutton>Previous LaTeX Error</guibutton> and <guibutton>Next LaTeX Error</guibutton> to jump to and from errors. The log file always states in which line the error occurred. To view the line where an error occurred, click on the error in the log window, and &kile; will take you to error's line.
de: Die Protokolldatei erklärt die Fehlerquelle im Quelltext. Im Editor können dann die Knöpfe <guibutton>Vorheriger LaTeX-Fehler</guibutton> und <guibutton>Nächster LaTeX-Fehler</guibutton> für Sprünge zwischen den Fehlern verwendet werden. Die Protokolldatei gibt immer die Zeile an, in der der Fehler erscheint. Um die fehlerhafte Zeile zu betrachten, muss auf den Fehler im Protokoll geklickt werden und &kile; springt zur fehlerhaften Zeile.

source: Starting a New Document
de: Ein neues Dokument erstellen

source: When you click the button in the toolbar to begin a new document a dialog appears, asking which type of template you would like to use to write your document. The default choices are:
de: Sobald auf den entsprechenden Knopf in der Werkzeugleiste geklickt wird, erscheint ein Fenster zur Auswahl der zu verwendenden Vorlage für das Dokument. Die voreingestellten Möglichkeiten sind:

source: Empty document
de: Leeres Dokument

source: Article
de: Artikel

source: Beamer
de: Projektor

source: Book
de: Buch

source: HA-Prosper
de: Folie

source: Letter
de: Brief

source: Report
de: Bericht

source: Scrartcl (from the KOMA-Script package)
de: Artikel (DIN) -> vom KOMA-Skript-Paket

source: Scrbook (from the KOMA-Script package)
de: Buch (DIN) -> vom KOMA-Skript-Paket

source: Scrlttr2 (from the KOMA-Script package)
de: Brief (DIN) -> vom KOMA-Skript-Paket

source: Scrreprt (from the KOMA-Script package)
de: Bericht (DIN) -> vom KOMA-Skript-Paket

source: If you selected an <guilabel>Empty document</guilabel>, you can either start writing a document from scratch, or you can use the wizard to quickly start a new document (see <xref linkend="intro_docwizard" role="select: title pageabbrv"/>).
de: Bei Auswahl von <guilabel>Leeres Dokument</guilabel> kann ein Dokument entweder von Grund auf neu geschrieben oder der Assistent zur schnellen Erstellung eines neuen Dokuments verwendet werden. Weitere Informationen hierzu sind im Abschnitt <xref linkend="intro_docwizard" role="select: title pageabbrv"/> enthalten.

source: Templates
de: Vorlagen

source: Frequent users of &latex; typically use the same preamble for almost every document they use. Templates can be created, saved and loaded within &kile; to make it easier to start a new document.
de: Häufige Anwender von &latex; verwenden meist die gleiche Einleitung für nahezu alle Dokumente. Vorlagen können in &kile; erstellt, gespeichert und geladen werden, um die Erstellung eines neuen Dokuments zu erleichtern.

source: Create a New Template
de: Eine neue Vorlage erstellen

source: To create a new template, you must first either open a &tex; / &latex; file, or create a file of your own. &kile; can generate a template from an existing document by opening the desired document and selecting <menuchoice><guimenu>File</guimenu><guimenuitem>Create Template from Document</guimenuitem></menuchoice>.
de: Um eine neue Vorlage zu erstellen, muss entweder eine bestehende &tex;-/&latex;-Datei geöffnet oder eine neue Datei erstellt werden. &kile; kann eine neue Vorlage mittels Öffnen eines bestehenden Dokuments und Auswahl von <menuchoice><guimenu>Datei</guimenu><guimenuitem>Vorlage aus Dokument erstellen ...</guimenuitem></menuchoice> erstellen.

source: Configuring Automatic Substitutions
de: Automatisches Ersetzen einstellen

source: When creating a new document by selecting a template from <menuchoice><guimenu>File</guimenu><guimenuitem>New</guimenuitem></menuchoice>, certain character combinations will be replaced by data such as your name, or the character encoding your are using. These variables can be configured in <menuchoice><guimenu>Settings</guimenu><guisubmenu>Configure Kile...</guisubmenu> <guimenuitem>Settings</guimenuitem><guilabel>General</guilabel></menuchoice>.
de: Beim Erstellen eines neuen Dokuments aus ein Vorlage mittels <menuchoice><guimenu>Datei</guimenu><guimenuitem>Neu</guimenuitem></menuchoice> werden einige Zeichenketten durch andere Daten ersetzt (z. B. Name oder Zeichenkodierung). Diese Variablen können in <menuchoice><guimenu>Einstellungen</guimenu><guisubmenu>Kile einrichten ...</guisubmenu><guimenuitem>Einstellungen</guimenuitem><guilabel>Allgemein</guilabel></menuchoice> eingestellt werden.

source: When designing your own template, it is useful to known which character combinations are replaced by which template variables:
de: Beim Erstellen der eigenen Vorlage ist es daher notwendig zu wissen, welche Zeichenketten von welchen Variablen ersetzt werden:

source: <userinput>$$AUTHOR$$</userinput>: This string will be replaced by the author variable.
de: <userinput>$$AUTHOR$$</userinput>: Diese Zeichenkette wird durch die Eingabe in <guilabel>Autor</guilabel> ersetzt.

source: <userinput>$$DOCUMENTCLASSOPTIONS$$</userinput>: This string will be replaced by the documentclass options variable. Typically this is used as follows: <userinput>\documentclass[$$DOCUMENTCLASSOPTIONS$$]{article}</userinput>.
de: <userinput>$$DOCUMENTCLASSOPTIONS$$</userinput>: Diese Zeichenkette wird durch die Eingabe in <guilabel>Dokumentklasse</guilabel> ersetzt. Typischerweise wird sie folgendermaßen verwendet: <userinput>\documentclass[$$DOCUMENTCLASSOPTIONS$$]{article}</userinput>.

source: <userinput>$$INPUTENCODING$$</userinput>: If the inputencoding variable is set to, say, <userinput>latin1</userinput> this string is replaced by <userinput>\input[latin1]{inputenc}</userinput>.
de: <userinput>$$INPUTENCODING$$</userinput>: Sollte in <guilabel>Kodierung</guilabel> beispielsweise <userinput>latin1</userinput> ausgewählt werden, wird diese Zeichenkette durch <userinput>\input[latin1]{inputenc}</userinput> ersetzt.

source: Create a Template from the Wizard
de: Eine Vorlage mit dem Assistenten erstellen

source: The easiest way to create a new template is to start the wizard, and then add commands in the editor. Once you have your document set up the way you like:
de: Der einfachste Weg zum Erstellen einer Vorlage ist die Verwendung des Assistenten und das damit verbunde Einfügen der Befehle im Editor. Sobald das Dokument auf diese Weise erstellt wurde müssen folgende Schritte vollzogen werden:

source: Save your file;
de: Die Datei speichern

source: Go to <guimenu>File</guimenu>;
de: Das Menü <guimenu>Datei</guimenu> öffnen

source: Choose <guimenuitem>Create Template from Document</guimenuitem>;
de: <guimenuitem>Vorlage aus Dokument erstellen ...</guimenuitem> auswählen

source: Make any corrections necessary to the template;
de: Die erforderlichen Änderungen an der Vorlage vornehmen

source: Enter a name for your new template;
de: Einen Namen für die neue Vorlage eingeben

source: Click <guibutton>OK</guibutton> to add your template to the menu.
de: Auf <guibutton>OK</guibutton> drücken, um die Vorlage zum Menü hinzuzufügen.

source: Next time you start up a new document, you will be able to choose your customized template instead of the default ones.
de: Beim Erstellen eines neuen Dokuments kann dann die eigene Vorlage anstatt der standardmäßigen ausgewählt werden.

source: Creating a Template from any File
de: Eine Vorlage aus jeglicher Datei erstellen

source: A template can be created from any &latex; file. If you are looking for an easy way to configure a template, go find one you like on the Internet and follow the same steps as listed in <xref linkend="templ_wiz" role="select: title pageabbrv"/>.
de: Eine Vorlage kann aus jeglichen &latex;-Dateien erstellt werden. Wird eine einfache Weise zur Erstellung einer Vorlage gewünscht, sollte nach einer im Internet gesucht und die unter <xref linkend="templ_wiz" role="select: title pageabbrv" /> beschriebenen Schritte durchgeführt werden.

source: For instance, you may want to create a full-fledged A0 poster. These posters are usually seen at scientific conferences, and &latex; will help you making an attractive, catchy poster. You can get a template for A0 posters at <ulink url="http://www.stats.ox.ac.uk/~marchini/a0poster.html">Jonathan Marchini's home page</ulink>, but many more are available. Remember that you will need the <filename>a0poster</filename> package, which is normally not in standard tex distributions included. Download it from <ulink url="http://www.ctan.org/tex-archive/macros/latex/contrib/a0poster/">here</ulink> and place it in the same folder as your &latex; file.
de: Möglicherweise soll ein vollwertiges Poster im DIN-A0-Format erstellt werden. Diese Poster sieht man meist in wissenschaftlichen Veranstaltungen und &latex; wird beim Erstellen eines attraktiven und einprägenden Posters hilfreich sein. Eine Vorlage für Poster im DIN-A0-Format gibt es auf der <ulink url="http://www.stats.ox.ac.uk/~marchini/a0poster.html">Webseite</ulink> von Jonathan Marchini (aber auch weitere sind vorhanden). Hierfür ist das Paket <filename>a0poster</filename> notwendig, welches üblicherweise nicht standardmäßig mit &tex; ausgeliefert wird. Es kann <ulink url="http://www.ctan.org/tex-archive/macros/latex/contrib/a0poster/">hier</ulink> heruntergeladen werden und muss sich dann im selben Ordner wie die &latex;-Datei befinden.

source: Removing a Template
de: Eine Vorlage entfernen

source: To remove a template from &kile;, do as follows:
de: Zum Entfernen einer Vorlage aus &kile; müssen die folgenden Schritte ausgeführt werden:

source: Go to <menuchoice><guimenu>File</guimenu><guimenuitem>Remove Template...</guimenuitem></menuchoice>;
de: Das Menü <menuchoice><guimenu>Datei</guimenu><guimenuitem>Vorlage entfernen ...</guimenuitem></menuchoice> öffnen

source: A dialog box will appear with all templates listed: select a template;
de: Ein Fenster mit allen Vorlagen erscheint und eine davon ist auszuwählen

source: Click <guilabel>OK</guilabel>, and your template will be removed.
de: Nach dem Drücken auf <guilabel>OK</guilabel> wird die Vorlage entfernt.

source: Templates marked with an asterisk (*) cannot be removed without the proper permission.
de: Die mit einem Stern (<keycap>*</keycap>) markierten Vorlagen können ohne die notwendigen Berechtigungen nicht entfernt werden.

source: Editing &latex; Documents
de: &latex;-Dokumente bearbeiten

source: The internal editor that &kile; uses is &kate;. &kate; is a text editor created for programmers, which incorporates the ability to read and highlight many different types of text files, among which are &latex; and &bibtex;; you can access many options for &kate; directly from &kile;'s <guimenu>Tools</guimenu> menu.
de: &kile; verwendet &kate; als internen Editor. &kate; ist ein Texteditor für Programmierer mit der Möglichkeit des Lesens und Hervorhebens von vielen verschiedenen Arten von Textdateien (darunter auch &latex; und &bibtex;). Viele Einstellungen für &kate; können im Menü <guimenu>Werkzeuge</guimenu> direkt aus &kile; heraus vorgenommen werden.

source: To learn more about &kate; and its capabilities, see the <ulink url="help:kate">&kate; Handbook</ulink>. &kile; users can start reading from the chapter <quote>Working with the &kate; Editor</quote>.
de: Um mehr über &kate; und seine Möglichkeiten zu erfahren sollte das <ulink url="help:kate">Handbuch zu &kate;</ulink> herangezogen werden. Anwender von &kile; können dort direkt mit dem Lesen des Kapitels <ulink url="help:kate/kate-part.html">Arbeiten mit dem Editor von &kate;</ulink> beginnen.

source: The &latex; Reference
de: Die &latex;-Referenz

source: &kile; features a very practical &latex; tag reference, which you can access by choosing <menuchoice><guimenu>Help</guimenu><guimenuitem>LaTeX Reference</guimenuitem></menuchoice>. It contains a thorough description of almost all the commands that you may use in &latex; and their syntax.
de: &kile; bietet eine sehr praktische &latex;-Befehlsreferenz, welche über das Menü <menuchoice><guimenu>Hilfe</guimenu><guimenuitem>LaTeX-Referenz</guimenuitem></menuchoice> aufgerufen werden kann. Sie enthält eine ausführliche Beschreibung nahezu aller Befehle, die in &latex; Verwendung finden können sowie deren Syntax.

source: Cursor Movements
de: Cursor-Bewegungen

source: To select text, you have the following options:
de: Für die Auswahl eines Textes gibt es folgende Möglichkeiten:

source: Hold left mouse button, and drag mouse to highlight text.
de: Die linke Maustaste gedrückt halten und die Maus bewegen, um den Text hervorzuheben.

source: Click once on a word to move the cursor to a new area.
de: Ein einfacher Klick auf ein Wort, um den Cursor dorthin zu bewegen.

source: Click twice on a word to select the whole word.
de: Ein Doppelklick, um ein komplettes Wort auszuwählen.

source: Click twice on a word and pressing <keycombo>&Ctrl;</keycombo> to select the whole tex word. This means clicking in this way on <userinput>\par</userinput> from <userinput>\par\bigskip</userinput> only select \par.
de: Ein Doppelklick mit gedrückter <keycap>Strg</keycap>-Taste, um das &tex;-Wort auszuwählen. Das bedeutet, dass auf diese Weise beim Klicken auf <userinput>\par</userinput> von <userinput>\par\bigskip</userinput> lediglich <userinput>\par</userinput> ausgewählt wird.

source: Click three times to select the whole sentence.
de: Ein dreifacher Mausklick, um den kompletten Satz auszuwählen.

source: Holding the left mouse button, and dragging the text you want to select, automatically copies the selected text to the clipboard.
de: Beim Ziehen des Textes mit gedrückter linker Maustaste wird der ausgewählte Text automatisch in die Zwischenablage kopiert.

source: Holding &Shift; and using the arrow keys allows you to select portions of the source code in the editor window.
de: Bei Verwendung der <keycap>Pfeil</keycap>tasten mit gedrückter &Shift;taste können Teile des Quelltextes im Editorfenster ausgewählt werden.

source: Brackets
de: Klammern

source: Bracket completion is a visual tool that the editor view uses to indicate you which bracket matches which. If you open any <literal role="extension">.tex</literal> file, and select any bracket, whether it be a parenthesis (), square brackets [] or braces {}, the editor will highlight the bracket and its match in yellow (this default color can be changed). So, for example, if you position the cursor on the braces in <userinput>\section{Introduction}</userinput>, you would see <userinput>\section{Introduction}</userinput> in the default yellow highlight, showing you the location of the beginning and ending brackets.
de: Die <emphasis>Klammervervollständigung</emphasis> ist ein visuelles Werkzeug mit dem der Editor verdeutlicht, welche Klammern zusammengehören. Beim Öffnen einer beliebigen <filename>.tex</filename>-Datei und anschließende Auswahl einer Klammer - egal ob runde <keycap>()</keycap>, eckige <keycap>[]</keycap> oder geschweifte <keycap>{}</keycap> - wird der Editor die gewählte und die dazugehörige Klammer in gelb hervorheben (Standardfarbe, die verändert werden kann).

source: Highlighting
de: Hervorhebungen

source: &kile; has the ability to look for and highlight different types of code. For example, &latex; commands are distinguished from normal text, and math formulas are highlighted also in a different color.
de: &kile; hat die Möglichkeit die verschiedensten Arten von Quelltexten zu durchsuchen und diese hervorzuheben. Beispielsweise unterscheiden sich die &latex;-Befehle vom normalen Text und auch die mathematischen Formeln sind durch eine andere Farbe hervorgehoben.

source: <title>Bullets</title>
de: <title>Sprungmarken</title>

source: Many wizards can insert optional bullets, a special kind of bookmarks within the text. The menu entries <menuchoice><guimenu>Edit</guimenu><guisubmenu>Bullets</guisubmenu></menuchoice> or the corresponding keyboards shortcuts will allow you to jump to the next or last bullet. This will also highlight this bullet so that it will be deleted automatically, when you enter your first letter.
de: Viele Assistenten können zusätzliche <emphasis>Sprungmarken</emphasis> einfügen. Dabei handelt es sich um eine eigene Art von Lesezeichen innerhalb des Textes. Die Menüeinträge <menuchoice><guimenu>Bearbeiten</guimenu><guisubmenu>Sprungmarken</guisubmenu></menuchoice> oder die entsprechenden Tastenkürzel ermöglichen den Sprung zur nächsten oder letzten <emphasis>Sprungmarke</emphasis>. Dabei wird auch diese <emphasis>Sprungmarke</emphasis> hervorgehoben, sodass sie bei der ersten Eingabe eines Zeichens automatisch gelöscht wird.
