Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/extragear-office/kile.po
Languages: de

source: If you are using <userinput>XeLaTeX</userinput>, you can simply load the <userinput>xltxtra</userinput> package. It will additionally load all the required packages.
de: Wenn Sie <userinput>XeLaTeX</userinput> benutzen, müssen Sie nur das Paket <userinput>xltxtra</userinput> laden. Alle abhängigen und erforderlichen Pakete werden dann automatisch mit geladen.

source: &cjk; Support
de: &cjk;-Unterstützung

source: Adding support for ideographic languages is quite tricky. However, once you are done with it, it will work quite well. Other than installing packages, there is some extra configuration work to do.
de: Unterstützung die Sprachen mit Symbolschriften einzubauen, kann ziemlich schwierig sein. Außer der Installation von Programm-Paketen muss noch einiges eingestellt werden.

source: Your &Linux; distribution might already have a &cjk; (Chinese, Japanese, Korean) package ready for you, so you might be saved the hassle of manually installing everything. Do check before going forward!
de: Ihre &Linux;-Distribution hat möglicherweise bereits Pakete für &cjk; (Chinesisch, Japanisch, Koreanisch). Damit ersparen Sie sich die Zeit alles von Hand zu installieren. Überprüfen Sie das mit Ihrer Paketverwaltung, ehe Sie weiterlesen.

source: There is the possibility of using the &ucs; package in order to write short snippets of &cjk; text, but that option is seriously limited as it does not handle, among other things, newlines. Instead, we will install the complete &cjk;-&latex; package and make it work for both &latex; and &pdflatex;. A lot of this material has been inspired by <ulink url="http://www.ece.uci.edu/~chou/">Pai H. Chou</ulink>'s <ulink url="http://www.ece.uci.edu/~chou/unicode-tex.html">page about how to setup &pdflatex;</ulink>.
de: Mit dem Paket &ucs; ist es möglich, kurze Texte als &cjk;-Text zu schreiben. Diese Verfahren ist aber stark eingeschränkt, da unter anderem Zeilenumbrüche nicht verarbeitet werden. Stattdessen wird hier erklärt, wie das komplette Paket &cjk;-&latex; installiert und sowohl für die Nutzung mit &latex; und &pdflatex; eingerichtet wird. Ein großer Teil dieser Informationen stammt von <ulink url="http://www.ece.uci.edu/~chou/">Pai H. Chou</ulink>'s <ulink url="http://www.ece.uci.edu/~chou/unicode-tex.html">Seite über die Einrichtung von &pdflatex;</ulink>.

source: Download the <ulink url="http://www.ctan.org/tex-archive/help/Catalogue/entries/cjk.html">&cjk;</ulink> package. Copy its unpacked files to an appropriate subfolder of $<envar>TEXMF</envar>, just like you did with the &ucs; package before (see <xref linkend="ucs" role="select: title pageabbrv"/>). The files will be unpacked in a <filename>CJK/X_Y.Z</filename> folder; it is not important that you take them out, though it will probably be tidier and easier for you to maintain.
de: Laden Sie das Paket <ulink url="http://www.ctan.org/tex-archive/help/Catalogue/entries/cjk.html">&cjk;</ulink> herunter. Entpacken Sie die Dateien in einen passen Unterordner von $<envar>TEXMF</envar> wie bereits mit dem Paket &ucs; weiter oben (siehe <xref linkend="ucs" role="select: title pageabbrv"/>). Die Dateien werden in einen Ordner namens <filename>CJK/X_Y.Z</filename> entpackt.

source: Now you have to download a font that supports all the &cjk; characters you need. You can choose any <literal role="extension">*.ttf</literal> file that covers them, but in this walkthrough we will use <ulink url="ftp://ftp.wu-wien.ac.at/pub/www/Netscape/communicator/extras/fonts/windows/Cyberbit.ZIP">Cyberbit</ulink>. Unzip the file and rename <filename>Cyberbit.ttf</filename> to <filename>cyberbit.ttf</filename>, since uppercase might confuse your system.
de: Jetzt müssen Sie eine Schriftart herunterladen, die alle benötigten Zeichen enthält. Sie können jede beliebige <literal role="extension">*.ttf</literal>-Datei verwenden, die diese Bedingung erfüllt, aber hier wird <ulink url="ftp://ftp.wu-wien.ac.at/pub/www/Netscape/communicator/extras/fonts/windows/Cyberbit.ZIP">Cyberbit</ulink> benutzt. Entpacken Sie die Dateien und benennen Sie <filename>Cyberbit.ttf</filename> zu <filename>cyberbit.ttf</filename> um, damit es keine Probleme mit Groß-/Kleinschreibung gibt.

source: Place <filename>cyberbit.ttf</filename> in a folder together with <ulink url="http://delloye.free.fr/Unicode.sfd"><filename>Unicode.sfd</filename></ulink>, and generate the <literal role="extension">*.tfm</literal> and <literal role="extension">*.enc</literal> files with the command <userinput><command>$ ttf2tfm cyberbit.ttf -w cyberbit@Unicode@</command></userinput>. For some reasons, sometimes this does not produce the hundreds of files it should. Should that be your case, you can download both <ulink url="http://www.ece.uci.edu/~chou/unicode/cyberbit-tfm.tgz"><literal role="extension">*.tfm</literal></ulink> and <ulink url="http://www.ece.uci.edu/~chou/unicode/cyberbit-enc.tgz"><literal role="extension">*.enc</literal></ulink> files.
de: Verschieben Sie <filename>cyberbit.ttf</filename> zusammen mit <ulink url="http://delloye.free.fr/Unicode.sfd"><filename>Unicode.sfd</filename></ulink> in einen Ordner und erzeugen Sie die <literal role="extension">*.tfm</literal>- und <literal role="extension">*.enc</literal>-Dateien mit dem Befehl <userinput><command>$ ttf2tfm cyberbit.ttf -w cyberbit@Unicode@</command></userinput>. Falls dabei Probleme auftreten und nicht all Dateien (mehrere Hundert) erstellt werden, laden Sie sowohl die <ulink url="http://www.ece.uci.edu/~chou/unicode/cyberbit-tfm.tgz"><literal role="extension">*.tfm</literal></ulink>- und <ulink url="http://www.ece.uci.edu/~chou/unicode/cyberbit-enc.tgz"><literal role="extension">*.enc</literal></ulink>-Dateien herunter.

source: Place the <literal role="extension">*.tfm</literal> files in an appropriate folder, say <filename>$<envar>TEXMF</envar>/fonts/tfm/bitstream/cyberbit/</filename>; the <literal role="extension">*.enc</literal> files may be installed in <filename>$<envar>TEXMF</envar>/pdftex/enc/cyberbit/</filename>.
de: Verschieben Sie die <literal role="extension">*.tfm</literal>-Dateien in einen passenden Ordner wie <filename>$<envar>TEXMF</envar>/fonts/tfm/bitstream/cyberbit/</filename>. Die <literal role="extension">*.enc</literal>-Dateien sollten in <filename>$<envar>TEXMF</envar>/pdftex/enc/cyberbit/</filename> installiert werden.

source: Now we need a map file to connect the <literal role="extension">*.enc</literal> files to the font. Download <ulink url="http://delloye.free.fr/cyberbit.map"><filename>cyberbit.map</filename></ulink> and install it in <filename>$<envar>TEXMF</envar>/pdftex/config/</filename>.
de: Nun ist eine Zuordnungsdatei nötig, die die <literal role="extension">*.enc</literal>-Dateien mit der Schriftart verbindet. Laden Sie <ulink url="http://delloye.free.fr/cyberbit.map"><filename>cyberbit.map</filename></ulink> herunter und installieren Sie diese Datei im Ordner <filename>$<envar>TEXMF</envar>/pdftex/config/</filename>.

source: Download another file, <ulink url="http://delloye.free.fr/c70cyberbit.fd"><filename>c70cyberbit.fd</filename></ulink>, and place it in an appropriate folder. You may choose, for example, <filename>$<envar>TEXMF</envar>/tex/misc/</filename>.
de: Laden Sie dann noch die Datei <ulink url="http://delloye.free.fr/c70cyberbit.fd"><filename>c70cyberbit.fd</filename></ulink> herunter und installieren Sie sie in einem passenden Ordner wie zum Beispiel <filename>$<envar>TEXMF</envar>/tex/misc/</filename>.

source: The last file we have to generate is a &PostScript; Type 1 font, necessary to read &DVI; files generated with &latex;. Run the command <userinput><command>$ ttf2pfb cyberbit.ttf -o cyberbit.pfb</command></userinput>, and copy the resulting <filename>cyberbit.pfb</filename> in a folder like <filename>$<envar>TEXMF</envar>/fonts/type1/cyberbit/</filename>.
de: Zum Schluß muss eine „&PostScript; Type 1“-Schriftart erzeugt werde, um mit &latex; erstellte &DVI;-Dateien lesen zu können. Führen Sie den Befehl <userinput><command>$ ttf2pfb cyberbit.ttf -o cyberbit.pfb</command></userinput> aus und kopieren Sie die entstandene Datei <filename>cyberbit.pfb</filename> in einen Ordner wie zum Beispiel <filename>$<envar>TEXMF</envar>/fonts/type1/cyberbit/</filename>.

source: Let's now place <filename>cyberbit.ttf</filename> among the fonts where &latex; can find it. You could place it in a folder named <filename>$<envar>TEXMF</envar>/fonts/truetype/</filename>.
de: Nun verschieben Sie die Datei <filename>cyberbit.ttf</filename> zu den anderen Schriftarten, damit sie von &latex; gefunden wird. Das ist zum Beispiele ein Ordner namens <filename>$<envar>TEXMF</envar>/fonts/truetype/</filename>.

source: Check the configuration file you find at <filename>$<envar>TEXMF</envar>/web2c/texmf.cnf</filename>, and make sure that the line mentioning <envar>TTFONTS</envar> is uncommented and points to the folder where you saved <filename>cyberbit.ttf</filename>.
de: Überprüfen Sie, dass in der Einrichtungsdatei <filename>$<envar>TEXMF</envar>/web2c/texmf.cnf</filename> die Zeile mit <envar>TTFONTS</envar> nicht auskommentiert ist und auf den Ordner zeigt, in dem Sie <filename>cyberbit.ttf</filename> gespeichert haben.

source: To make it possible for &pdflatex; to use your &cjk; fonts, it is necessary that you add a line in configuration file <filename>$<envar>TEXMF</envar>/pdftex/config/pdftex.cfg</filename>. Add <userinput>map +cyberbit.map</userinput> in the file to complete the configuration for &pdflatex;.
de: Damit &pdflatex; die &cjk;-Schriftarten benutzen kann, müssen sie in der Datei <filename>$<envar>TEXMF</envar>/pdftex/config/pdftex.cfg</filename> die Zeile <userinput>map +cyberbit.map</userinput> einfügen. Damit ist die Einrichtung für &pdflatex; abgeschlossen.

source: To configure &latex; so that you can produce &DVI; files with &cjk; characters, you have to add a line in file <filename>ttfonts.map</filename>. The file might be in a folder named <filename>$<envar>TEXMF</envar>/ttf2pk/</filename>, but you will probably have to look for it. Append the line <userinput>cyberbit@Unicode@ cyberbit.ttf</userinput> to it.
de: Um &latex; so einzustellen, dass es &DVI;-Dateien mit &cjk;-Zeichen erzeugen kann, müssen Sie die Zeile <userinput>cyberbit@Unicode@ cyberbit.ttf</userinput> in die Datei <filename>ttfonts.map</filename> einfügen. Diese Datei sollte sich im Ordner <filename>$<envar>TEXMF</envar>/ttf2pk/</filename> befinden. aber möglicherweise müssen Sie sie erst suchen.

source: Now, you only have to run <userinput><command>texhash</command></userinput> and the system should be ready.
de: Jetzt müssen Sie noch das Programm <userinput><command>texhash</command></userinput> ausführen, dann ist die Installation abgeschlossen.

source: To test whether your configuration is correct, you can try to compile <ulink url="http://www.math.nus.edu.sg/aslaksen/cs/sample-utf8.tex">this test file</ulink>.
de: Die ordnungsgemäße Einrichtung kann durch Kompilieren dieser <ulink url="http://www.math.nus.edu.sg/aslaksen/cs/sample-utf8.tex">Testdatei</ulink> festgestellt werden.

source: &cjk; Troubleshooting
de: Problembeseitigung für &cjk;

source: There are many things that can go wrong when setting &cjk; support manually. If something seems not to work, the following checklist might help you.
de: Es gibt viele mögliche Fehlerquellen bei der manuellen Einrichtung von &cjk;. Bei Problemen prüfen Sie die im Folgenden genannten Punkte:

source: Obviously, since you run &latex; as a user and not as root, you must <emphasis>allow</emphasis> ordinary users to access the new files. Make sure all folders and files are accessible using the <command>chmod</command> command.
de: Da Sie &latex; als normaler Benutzer und nicht als Systemverwalter ausführen, müssen Sie allen Benutzern erlauben, die neuen Dateien zu lesen. Benutzen Sie dazu den Befehl <command>chmod</command> für alle neu installierten Ordner und Dateien.

source: If &latex; writes a &DVI; without problems, but you cannot view it, it is almost certainly because of some problems in the automatic generation of <literal role="extension">*.pk</literal> fonts. They are supposed to be generated on the fly when viewing a &DVI; file, but this might fail for a number of reasons: double-check <filename>ttfonts.map</filename> for your custom line first. However, it might happen that your <command>ttf2pk</command> command, which is usually invoked by the &DVI; viewer, has been compiled <emphasis>without</emphasis> support for the <application>kpathsea</application> libraries. If this is the case, <userinput><command>ttf2pk</command> <option>--version</option></userinput> will make no mention of <application>kpathsea</application>. As support for these libraries is necessary, you might have to find a new package, or recompile <application>FreeType 1</application> by yourself.
de: Wenn &latex; eine &DVI;-Datei ohne Probleme schreibt, sie aber nicht richtig angezeigt wird, liegt die Ursache wahrscheinlich in der automatischen Generierung von <literal role="extension">*.pk</literal>-Schriften. Die Schriften sollten für die Anzeige einer &DVI;-Datei jedesmal neu generiert werden, aber dabei können eine Reihe von Fehlern auftreten. Überprüfen Sie die benutzerdefinierte Zeile in <filename>ttfonts.map</filename> als erstes. Möglicherweise ist Ihr Programm <command>ttf2pk</command>, das vom &DVI;-Betrachter aufgerufen wird, <emphasis>ohne</emphasis> Unterstützung für die <application>kpathsea</application>-Bibliotheken kompiliert worden. Dann finden Sie in der Ausgabe von <userinput><command>ttf2pk</command> <option>--version</option></userinput> keinen Hinweis auf <application>kpathsea</application>. Da diese Bibliotheken aber gebraucht werden, müssen Sie ein anderes Paket für <command>ttf2pk</command> suchen oder <application>FreeType 1</application> selbst neu kompilieren.

source: How do I input &cjk; in Unicode?
de: Wie kann Ich &cjk; in Unicode eingeben?

source: There are a number of different input engines, and the choice can depend also on personal preference. The author uses <ulink url="http://www.scim-im.org/projects/skim"><application>Skim</application></ulink>, a port to &kde; of the <ulink url="http://www.scim-im.org"><application>Scim</application></ulink> engine. Refer to your distribution's documentation to learn how to install these programs. Configuration of such programs can be tricky too, in the case of <application>Skim</application> you will have to define an environment variable <userinput><envar>XMODIFIERS</envar>="@im=SCIM"</userinput> <emphasis>before</emphasis> starting <application>X</application>.
de: Es gibt verschiedene Eingabetreiber, die Auswahl wird auch durch persönliche Vorlieben beeinflusst. De Autor verwendet <ulink url="http://www.scim-im.org/projects/skim"><application>Skim</application></ulink>, eine Portierung des Treibers für <ulink url="http://www.scim-im.org"><application>Scim</application></ulink> &kde;. Lesen Sie in der Dokumentation zu Ihrer Distribution nach, wie Sie diese Programme installieren können. Die Einrichtung der Programme kann manchmal schwierig sein, für <application>Skim</application> müssen Sie eine Umgebungsvariable <userinput><envar>XMODIFIERS</envar>="@im=SCIM"</userinput> definieren, <emphasis>bevor</emphasis> <application>X</application> gestartet wird.

source: Scripting
de: Skripte

source: Scripting in &kile;
de: Skripte in &kile;

source: &kile;'s scripting feature allows for the execution of ECMAScript code. Scripts can be managed through the scripting panel in the sidebar.
de: Die Skript-Funktion von &kile; erlaubt das Ausführen von <emphasis>ECMAScript</emphasis>-Quelltext. Die Skripte können über <guilabel>Skripte</guilabel> in der Seitenleiste verwaltet werden.

source: API Reference
de: API-Referenz

source: In this section we describe &kile;'s scripting programming interface.
de: In diesem Abschnitt wird die Programmierschnittstelle für Skripte in &kile; beschrieben.

source: Please note that the scripting API has not been finalized yet. The API described below might change in future versions of &kile;.
de: Die API-Skripte sind noch nicht endgültig entwickelt und können sich in weiteren Versionen von &kile; noch ändern.

source: First of all, &kile;'s script execution environment provides a global object called "kile", which owns the following methods:
de: Als erstes muss gesagt werden, dass die Ausführungsumgebung der Skripte in &kile; ein systemweites Objekt (= <emphasis>kile</emphasis>) mit den folgenden Methoden besitzt:

source: Returns a <classname>KileTextDocument</classname> object which reflects the currently active text document. Returns <constant>null</constant> if no text document is active.
de: Gibt das Objekt <classname>KileTextDocument</classname> zurück, das dem aktuell geöffneten Textdokument entspricht. Ist kein aktives Textdokument vorhanden, wird <constant>null</constant> zurückgegeben.

source: Opens a dialog with the given caption and label. Returns the value that user has entered.
de: Öffnet einen Dialog mit dem angegebenen Titel und Textfeld. Gibt den vom Benutzer eingegebenen Wert zurück.

source: Objects of the type <classname>KileTextDocument</classname> represent text documents in &kile;. They have the following properties:
de: Objekte vom Typ <classname>KileTextDocument</classname> repräsentieren für Textdokumente in &kile;. Sie haben folgende Eigenschaften:

source: Deletes the character that is located immediately before the current cursor position and moves the cursor one position backward in the text.
de: Löscht das Zeichen unmittelbar vor der aktuellen Cursor-Position und verschiebt den Cursor um ein Zeichen im Text zurück.

source: Moves the cursor one position backward in the text.
de: Bewegt den Cursor zum vorherigen Zeichen im Text.

source: Moves the cursor one position forward in the text.
de: Bewegt den Cursor zum nächsten Zeichen im Text.

source: Inserts the text contained in the variable <parameter>text</parameter> into the document at the current cursor location.
de: Fügt den Text in der Variablen <parameter>text</parameter> an der aktuellen Cursor-Position in das Dokument ein.

source: Inserts a bullet into the document at the current cursor position.
de: Fügt an der aktuellen Cursor-Position eine Sprungmarke in das Dokument ein.

source: Selects the first bullet located in the document immediately after the current cursor location.
de: Wählt die erste Sprungmarke im Dokument direkt nach der aktuellen Cursor-Position.

source: Selects the first bullet located in the document immediately before the current cursor location.
de: Wählt die erste Sprungmarke im Dokument direkt vor der aktuellen Cursor-Position.

source: Moves the cursor one line up in the document.
de: Bewegt den Cursor zur vorherigen Zeile im Dokument.

source: Moves the cursor one line down in the document.
de: Bewegt den Cursor zur nächsten Zeile im Dokument.

source: Returns the line which the cursor is currently located at.
de: Gibt die Zeile zurück, in der sich der Cursor gerade befindet.

source: Returns the column which the cursor is currently located at.
de: Gibt die Spalte zurück, in der sich der Cursor gerade befindet.

source: Moves the cursor to the line denoted by <parameter>line</parameter>.
de: Setzt den Cursor in die durch den Parameter <parameter>line</parameter> angegebene Zeile.

source: Moves the cursor to the column denoted by <parameter>line</parameter>.
de: Setzt den Cursor in die durch den Parameter <parameter>column</parameter> angegebene Spalte.

source: Help
de: Hilfe

source: Help Documents
de: Hilfe-Dokumente

source: &latex; is a rather sophisticated system, where basic features can be expanded by a great variety of additional packages. &kile; provides numerous different ways to aid the user.
de: &latex; ist ein recht ausgeklügeltes System, in dem die grundlegenden Funktionen durch eine Vielzahl von zusätzlichen Paketen erweitert werden können. &kile; bietet eine Menge unterschiedlichster Hilfen zur Unterstützung der Anwender.

source: LaTeX Reference
de: LaTeX-Referenz

source: An alphabetical index of the most common &latex; commands.
de: Eine alphabetische Auflistung der gebräuchlichsten &latex;-Befehle.

source: TeX Documentation
de: TeX-Dokumentation

source: &tetex;/&texlive; ships with a huge number of help documents. This includes documentation for all the included packages and an additional &latex; reference.
de: &tetex; und &texlive; werden mit vielen Hilfe-Dokumenten ausgeliefert. Darin enthalten ist eine Dokumentation für alle enthaltenen Pakete und eine zusätzliche &latex;-Referenz.

source: A full reference for &tex; and friends. This is not only a description of all programs, but some important packages are also mentioned. It also includes a full reference manual of &latex; commands&mdash;ideal for looking up a particular piece of formatting while writing a document. As this document is really extensive, it is referenced in &kile; by three bookmarks.
de: Eine vollständige Referenz für &tex; und seine „Freunde“. Hierbei handelt es sich nicht nur um eine Beschreibung aller Programme, aber ein paar wichtige Pakete werden beschrieben. Es ist vielmehr eine vollständige Bedienungsanleitung für die &latex;-Befehle enthalten und ist somit ideal für die Suche nach einer bestimmten Formatierung. Da es sich hierbei um ein sehr großes Dokument handelt, gibt es in &kile; drei Lesezeichen als Verweis auf die einzelnen Teile.

source: LaTeX Command
de: LaTeX-Befehl

source: Another alphabetical index of the most common &latex; commands.
de: Eine weitere alphabetische Auflistung der gebräuchlichsten &latex;-Befehle.

source: LaTeX Subject
de: LaTeX-Thema

source: A description of important &latex; subjects.
de: Eine Beschreibung der wichtigen Themen zu &latex;.

source: LaTeX Env
de: LaTeX-Umgebung

source: An alphabetical index of the most common &latex; environments.
de: Eine alphabetische Auflistung der gebräuchlichsten &latex;-Umgebungen.

source: Context Sensitive Help
de: Kontexthilfe

source: &kile; also support a context sensitive help, which is called with <keycombo action="simul">&Ctrl;&Alt;<keycap>H</keycap></keycombo>,<keycap>K</keycap>. In <menuchoice><guimenu>Settings</guimenu><guisubmenu>Configure Kile...</guisubmenu> <guimenuitem>Kile</guimenuitem><guilabel>Help</guilabel></menuchoice> you can choose whether you want to use &kile;'s &latex; reference or the help system of &tetex;/&texlive;, which is the default setting.
de: In &kile; gibt es eine Kontexthilfe, die mit dem Kurzbefehl <keycombo action="simul">&Ctrl;&Alt;<keycap>H</keycap></keycombo>,<keycap>K</keycap> aufgerufen werden kann. In <menuchoice><guimenu>Einstellungen</guimenu><guisubmenu>Kile einrichten...</guisubmenu> <guimenuitem>Kile</guimenuitem><guilabel>Hilfe</guilabel></menuchoice> können Sie auswählen, ob in &kile; die &latex;-Referenz oder das &tetex;/&texlive;-Hilfesystem (die Voreinstellung) benutzt wird.

source: Searching for Keywords
de: Suche nach Schlagwörtern

source: It is not always easy to find the right document as &tetex;/&texlive; ships with a huge number of help documents. In order to facilitate this process, &tetex;/&texlive; provides a tiny program called <application>texdoctk</application>. It provides a database of all the help documents, for which &kile; offers a user-friendly interface.
de: Aufgrund der Menge an Hilfe-Dokumenten mit denen &tetex;/&texlive; ausgeliefert wird, ist das Finden des richtigen Dokuments nicht immer einfach. Um diese Suche zu erleichtern, enthält &tetex;/&texlive; die kleine Anwendung <command>texdoctk</command>, die eine Datenbank aller Hilfe-Dokumente zur Verfügung stellt. Auf diese Datenbank kann in &kile; mit einer grafische Oberfläche zugegriffen werden.
