Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/extragear-office/kile.po
Languages: de

source: All the documents are grouped into categories. Additionally, one can search for package names or keywords. &kile; will then show only the help documents matching the search string.
de: Alle Dokumente sind in Kategorien eingeteilt. Außerdem kann nach Paketnamen oder Schlagwörtern gesucht werden. &kile; zeigt dann nur die Hilfe-Dokumente an, in denen der Suchtext vorkommt.

source: A mouse double-click or the <keycap>Space</keycap> key will start a viewer for the selected document. This can be an arbitrary document, not only a &DVI;, PS, PDF or &HTML; document. &kile; takes the &kde; settings into account in order to start an appropriate viewer.
de: Ein Doppelklick mit der Maus oder das Betätigen der <keycap>Leertaste</keycap> öffnet den Betrachter für das ausgewählte Dokument. Es kann sich hierbei um ein beliebiges Dokument handeln, nicht nur um &DVI;-, PS-, PDF- oder &HTML;-Dokumente. &kile; benutzt die &kde;-Einstellungen, um ein passendes Anzeigeprogramm zu starten.

source: User Defined Help
de: Benutzerdefinierte Hilfe

source: Besides this static &tetex;/&texlive; documentation, &kile; also supports a more flexible variable way for help documents. In the <guimenu>Help</guimenu> menu &kile; has a special <guimenu>User help</guimenu> submenu, where the user can add documents of his or her own choice. These can be the most important documents of the &tetex;/&texlive; documentation, or even self-written documents. It is also possible to enter URLs
de: Neben der nicht veränderbaren &tetex;/&texlive;-Dokumentation gibt es in &tetex; ein flexibles erweiterbares System für Hilfedokumente, Im Menü <guimenu>Hilfe</guimenu> in &kile; ist ein besonderes Untermenü <guimenu>Benutzerdefinierte Hilfe</guimenu>. Hier können eigene Dokumente ins Menü eingebunden werden. Das können wichtige Teile der &tetex;/&texlive;-Dokumentation oder auch eigene Dokumente sein. Auch &URL;s (Adressen im Internet) können hier benutzt werden.

source: Go to <menuchoice><guimenu>Settings</guimenu><guisubmenu>Configure Kile...</guisubmenu> <guimenuitem>Kile</guimenuitem><guilabel>Help</guilabel></menuchoice> and choose <guibutton>Configure</guibutton> button to configure this <guimenu>User help</guimenu> menu. You can add, remove or move menu entries around, and insert separators to optimize the structure of the menu.
de: Öffnen Sie die Seite <menuchoice><guimenu>Einstellungen</guimenu><guisubmenu>&kile; einrichten ...</guisubmenu><guimenuitem>&kile;</guimenuitem><guilabel>Hilfe</guilabel></menuchoice>. Klicken Sie auf den Knopf <guibutton>Einrichten</guibutton>, um Einträge der <guimenu>Benutzerhilfe</guimenu> zu bearbeiten. Sie können Menüeinträge hinzufügen, entfernen, deren Position im Menü verschieben und Trennlinien einfügen, um die Struktur des Menüs Ihren Wünschen anzupassen.

source: <screeninfo>Dialog: configure user defined help entries</screeninfo>
de: <screeninfo>Dialog: Benutzerhilfe einrichten</screeninfo>

source: <phrase>Dialog: configure user defined help entries</phrase>
de: <phrase>Dialog: Benutzerhilfe einrichten</phrase>

source: Pressing the <guibutton>Add</guibutton> button will open another dialog, where you can edit the name of the menu entry, and choose the corresponding file or &URL;. The second button right of text field launches &konqueror;, which can be used to determine the correct &URL;.
de: Mit <guibutton>Hinzufügen ...</guibutton> öffnen Sie einen weiteren Dialog, in dem Sie einen Namen für den Menüeintrag eingeben und die zugehörige lokale Hilfedatei oder &URL; auswählen können. Klicken auf das zweite Symbol rechts neben dem Eingabefeld startet &konqueror;, damit kann die richtige &URL; ermittelt werden.

source: <screeninfo>Dialog: add a new helpentry</screeninfo>
de: <screeninfo>Dialog: Neuen Hilfeeintrag hinzufügen</screeninfo>

source: <phrase>Dialog: add a new helpentry</phrase>
de: <phrase>Dialog: Neuen Hilfeeintrag hinzufügen</phrase>

source: After finishing the configuration, all the entries will appear in the <guimenu>Help</guimenu> menu of &kile; as a special menu entry <guimenu>User help</guimenu>.
de: Nachdem die Einrichtung fertiggestellt ist, werden alle Einträge im Menü <guimenu>Hilfe</guimenu> von &kile; unter <guimenu>Benutzerdefinierte Hilfe</guimenu> angezeigt.

source: <screeninfo>Userhelp menu</screeninfo>
de: <screeninfo>Menü „Benutzerdefinierte Hilfe“</screeninfo>

source: <phrase>Userhelp menu</phrase>
de: <phrase>Menü „Benutzerdefinierte Hilfe“</phrase>

source: Credits and License
de: Danksagungen und Lizenz

source: &kile; is an open-source user-friendly &latex; / &tex; source code editor. It runs on systems that have the &kde; Desktop Environment installed. &kde; is available for several architectures including &Linux; and other Unix-like systems.
de: &kile; ist ein quelloffener und benutzerfreundlicher &latex;-/&tex;-Quelltexteditor, der auf allen Systemen mit installierter &kde;-Arbeitsflächenumgebung ausgeführt werden kann. &kde; ist für unterschiedliche Architekturen einschließlich &Linux;- und Unix-ähnlichen Systemen verfügbar.

source: Many thanks are owed to the people who strive to continue the &kile; project and to those who sacrifice numerous hours of their time to develop tools we can all use under the &GNU; license. Up-to-date information about contributors can be found in the <guimenuitem>About &kile;</guimenuitem> dialog from the <guimenu>Help</guimenu> menu.
de: Viel Dank gebührt denen, die sich an der Weiterentwicklung des &kile;-Projekts beteiligen und dafür viele Stunden für die Entwicklung von Werkzeugen opfern, die wir alle unter Beachtung der &GNU;-Lizenz verwenden können. Aktuelle Informationen zu den Beitragenden gibt es im Menü <menuchoice><guimenu>Hilfe</guimenu><guimenuitem>Über &kile;</guimenuitem></menuchoice>.

source: Many thanks to all those involved!
de: Viel Dank gebührt auch allen weiteren Beitragenden.

source: CREDIT_FOR_TRANSLATORS
de: <para>Übersetzung: Johannes Obermayr <email>johannesobermayr@gmx.de</email></para>
