Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/extragear-office/kile.po
Languages: de

source: He would probably give each tag a name that can clearly identify it. The name you give your tag is entered in the section marked <guilabel>Menu item</guilabel>, and the text of frequently-used command should be entered into the section labeled <guilabel>Value</guilabel>. Once the commands are entered, he can use them quickly using the shortcut <keycombo>&Ctrl;&Shift;<keycap>1</keycap></keycombo> for the first tag to enter <userinput>I prefer \LaTeX\ to \TeX\</userinput> and <keycombo>&Ctrl;&Shift; <keycap>2</keycap></keycombo> to enter <userinput>What would I do without &Linux;?</userinput>.
de: Der Name des Tags wird im Feld <guilabel>Menüeintrag</guilabel> eingeben und der auszuführende Befehl im Feld <guilabel>Wert</guilabel>. Haben Sie hier Befehle eingegeben, dann können Sie mit dem Kurzbefehl <keycombo>&Ctrl;&Shift;<keycap>1</keycap></keycombo> für das erste Tag den Satz <userinput>Ich arbeite lieber mit \LaTeX\ als mit \TeX\</userinput> und mit dem Kurzbefehl <keycombo>&Ctrl;&Shift;<keycap>2</keycap></keycombo> für das zweite Tag den Satz <userinput>Was würde ich ohne &Linux; machen?</userinput> einfügen.

source: Placeholders in User-Defined Tags
de: Platzhalter in benutzerdefinierten Tags

source: There are some placeholders you can use in user-defined tags: they are <userinput>%B</userinput>, <userinput>%C</userinput>, <userinput>%M</userinput> and <userinput>%S</userinput>.
de: Es gibt einige Platzhalter, die Sie in benutzerdefinierten Tags verwenden können: <userinput>%B</userinput>, <userinput>%C</userinput>, <userinput>%M</userinput> und <userinput>%S</userinput>.

source: <userinput>%B</userinput>: will be replaced by a bullet.
de: <userinput>%B</userinput>: wird durch eine Sprungmarke ersetzt.

source: <userinput>%C</userinput>: this is where the cursor will be placed after the insertion of a user-defined tag.
de: <userinput>%C</userinput>: An diese Stelle wird der Cursor nach dem Einfügen des benutzerdefinierten Tags gesetzt.

source: <userinput>%M</userinput>: this stands for marked text; the selected text is inserted in its place when inserting user-defined tags.
de: <userinput>%M</userinput>: Bedeutet markierten Text. Der ausgewählte Text wird anstelle von <userinput>%M</userinput> eingesetzt, wenn benutzerdefinierte Tags eingefügt werden.

source: <userinput>%S</userinput>: will be replaced by the source file's name without file extension.
de: <userinput>%S</userinput>: Wird durch den Namen der Quelldatei ohne die Dateierweiterung ersetzt.

source: Let's consider the example you can see in the screenshots. First, we select a number in our text, let's say <userinput>2</userinput>. Now we press <keycombo>&Ctrl;&Shift;<keycap>1</keycap></keycombo> or choose <menuchoice><guimenu>LaTeX</guimenu><guisubmenu>User Tags</guisubmenu><guimenuitem> Frac</guimenuitem></menuchoice>, and we obtain <userinput>\frac{2}{}</userinput> with the cursor begin located within the second pair of brackets.
de: In den folgenden Bildschirmfotos werden diese Funktionen an Beispielen erläutert. Zuerst wird eine Zahl wie zum Beispiel <userinput>2</userinput> im Text ausgewählt. Dann drücken Sie <keycombo>&Ctrl;&Shift;<keycap>1</keycap></keycombo> oder wählen <menuchoice><guimenu>LaTeX</guimenu><guisubmenu>Benutzerdefinierte Tags</guisubmenu><guimenuitem>Frac</guimenuitem></menuchoice>. Als Ergebnis wird <userinput>\frac{2}{}</userinput> und der Cursor steht zwischen den letzten geschweiften Klammern.

source: The Build Tools
de: Bauwerkzeuge

source: Compiling, converting and viewing
de: Kompilieren, Umwandeln und Ansehen

source: To view the result of your work, you first need to compile the source. All the build tools are grouped closely together in the <menuchoice><guimenu>Build</guimenu><guisubmenu>Compile</guisubmenu></menuchoice>, <menuchoice><guimenu>Build</guimenu><guisubmenu>Convert</guisubmenu></menuchoice>, and <menuchoice><guimenu>Build</guimenu><guisubmenu>View</guisubmenu></menuchoice> menus.
de: Um das Ergebnis der Arbeit begutachten zu können, muss zunächst der Quelltext kompiliert werden. Alle Bauwerkzeuge sind gruppenweise in den Menüs <menuchoice><guimenu>Erstellen</guimenu><guisubmenu>Kompilieren</guisubmenu></menuchoice>, <menuchoice><guimenu>Erstellen</guimenu><guisubmenu>Konvertieren</guisubmenu></menuchoice> und <menuchoice><guimenu>Erstellen</guimenu><guisubmenu>Ansicht</guisubmenu></menuchoice> zusammengefasst.

source: To compile your source code for screen viewers like &okular; or further conversion, you can use the shortcut <keycombo>&Alt;<keycap>2</keycap></keycombo>. Then you can view the &DVI; file using your default viewer with <keycombo>&Alt;<keycap>3</keycap></keycombo>, convert the &DVI; to a PS file with <keycombo>&Alt;<keycap>4</keycap></keycombo>, and view the PS file with <keycombo>&Alt;<keycap>5</keycap></keycombo>.
de: Für das Kompilieren des Quelltextes für Betrachter wie &okular; oder die weitere Umwandlung kann das Tastenkürzel <keycombo>&Alt;<keycap>2</keycap></keycombo> verwendet werden. Danach kann die <filename>&DVI;</filename>-Datei im standardmäßigen Betrachter mittels <keycombo>&Alt;<keycap>3</keycap></keycombo> angesehen, mittels <keycombo>&Alt;<keycap>4</keycap></keycombo> die <filename>&DVI;</filename>-Datei in eine <filename>PS</filename>-Datei umgewandelt und mittels <keycombo>&Alt;<keycap>5</keycap></keycombo> die <filename>PS</filename>-Datei angesehen werden.

source: If you are using <ulink url="http://www.ecst.csuchico.edu/~jacobsd/bib/formats/bibtex.html">&bibtex;</ulink> for your bibliography entries, you usually have to follow a special compiling scheme. This means calling &latex; and then &bibtex; and then &latex; twice again. Fortunately &kile; is clever enough to detect automatically if it is necessary to call additional tools like &bibtex;, &makeidx; and &asymptote;. This logic is turned on by default and can be changed in <menuchoice><guimenu>Settings</guimenu><guisubmenu>Configure Kile...</guisubmenu><guisubmenu>Tools</guisubmenu><guilabel>Build</guilabel></menuchoice> in the <guilabel>General</guilabel> tab in the &latex; and &pdflatex; tools.
de: Wenn Sie das Paket <ulink url="http://www.ecst.csuchico.edu/~jacobsd/bib/formats/bibtex.html">&bibtex;</ulink> für die Einträge des Literaturverzeichnisses benutzen, müssen Sie normalerweise nach einem bestimmten Schema kompilieren. Das heisst Sie rufen zuerst &latex;, dann &bibtex; und dann zum zweiten mal &latex; auf. &kile; erkennt automatisch, dass zusätzliche Pakete wie &bibtex;, &makeidx; und &asymptote; aufgerufen werden müssen. Diese Verhalten können Sie im Menü im Einrichtungsdialog auf der Seite <menuchoice><guimenu>Werkzeuge</guimenu><guimenuitem>Erstellen</guimenuitem></menuchoice> für die Werkzeuge &latex; und &pdflatex; auf der Karteikarte <guilabel>Allgemein</guilabel> mit der Einstellung <guilabel>Zusätzliche Werkzeuge automatisch starten</guilabel> ändern.

source: MetaPost and &asymptote;
de: MetaPost und &asymptote;

source: If you want to compile your document with <application>MetaPost</application> or <application>&asymptote;</application>, picture drawing programs, you can do it with <menuchoice><guimenu>Build</guimenu><guisubmenu>Compile</guisubmenu><guimenuitem>Metapost</guimenuitem></menuchoice>, or <menuchoice><guimenu>Build</guimenu><guisubmenu>Compile</guisubmenu><guimenuitem>&asymptote;</guimenuitem></menuchoice>.
de: Möchten Sie Ihr Dokument mit den Zeichenprogrammen <application>MetaPost</application> oder <application>&asymptote;</application> kompilieren, wählen Sie <menuchoice><guimenu>Erstellen</guimenu><guisubmenu>Kompilieren</guisubmenu><guimenuitem>Metapost</guimenuitem></menuchoice> oder <menuchoice><guimenu>Erstellen</guimenu><guisubmenu>Kompilieren</guisubmenu><guimenuitem>&asymptote;</guimenuitem></menuchoice>.

source: There is also another way to compile your document, if you want a PDF: you can run &pdflatex;, that will compile the source directly into a PDF file, with <keycombo>&Alt;<keycap>6</keycap></keycombo>: you can then view the compiled file pressing <keycombo>&Alt;<keycap>7</keycap></keycombo>.
de: Es gibt noch einen weitere Möglichkeit, Ihr Dokument in eine PDF-Datei zu kompilieren: Benutzen Sie &pdflatex;, das aus der Quelle direkt eine PDF-Datei erzeugt. Benutzen Sie dazu den Kurzbefehl <keycombo>&Alt;<keycap>6</keycap></keycombo> und lassen sich dann das kompilierte Ergebnis mit <keycombo>&Alt;<keycap>7</keycap></keycombo> anzeigen.

source: Alternatively, you can convert a PS into a PDF with <keycombo>&Alt;<keycap>8</keycap></keycombo>, or directly a &DVI; into a PDF with <keycombo>&Alt;<keycap>9</keycap></keycombo>.
de: Außerdem können Sie eine PS-Datei in eine PDF-Datei mit <keycombo>&Alt;<keycap>8</keycap></keycombo> oder direkt in eine &DVI;-Datei in eine PDF-Datei mit <keycombo>&Alt;<keycap>9</keycap></keycombo> umwandeln.

source: Using &pdflatex; instead of &latex; may be just a matter of simplicity or habit, but sometimes the behavior of the two program can differ.
de: &pdflatex; statt &latex; zu verwenden, ist manchmal einfacher oder gewohnt, aber das kompilierte Ergebnis kann auch voneinander abweichen.

source: &latex; to Web
de: &latex; in Webseiten umwandeln

source: Finally, you may want to publish your work on the web and not just on paper. You may then use the <application>latex2html</application> program, that can be called from &kile;'s menu <menuchoice><guimenu>Build</guimenu><guisubmenu>Convert</guisubmenu><guimenuitem>LaTeX to Web</guimenuitem></menuchoice>. The result will be placed in a subfolder of the work folder, and you will be able to see the result of the conversion choosing the menu item <menuchoice><guimenu>Build</guimenu><guisubmenu>View</guisubmenu><guimenuitem>View &HTML;</guimenuitem></menuchoice>.
de: Möchten Sie Ihre Arbeit im Internet veröffentlichen und nicht nur auf Papier, dann verwenden Sie das Programm <application>latex2html</application>. Sie können es mit <menuchoice><guimenu>Erstellen</guimenu> <guisubmenu>Kompilieren</guisubmenu><guimenuitem>LaTeX to Web</guimenuitem></menuchoice> aus dem Menü aufrufen. Das Ergebnis wird in einen Unterordner des aktuellen Arbeitsordner geschrieben. Sie können es mit <menuchoice><guimenu>Erstellen</guimenu><guisubmenu>Ansicht</guisubmenu> <guimenuitem>ViewHTML</guimenuitem></menuchoice> aus dem Menü ansehen.

source: Passing Command-Line Parameters
de: Übergabe von Befehlszeilenparametern

source: If you want to pass some specific command-line parameters to the compile, convert or view tools, you can configure their call in <menuchoice><guimenu>Settings</guimenu> <guisubmenu>Configure Kile...</guisubmenu><guisubmenu>Tools</guisubmenu><guilabel>Build</guilabel></menuchoice>.
de: Möchten Sie einige besondere Befehlszeilen-Parameter für das Kompilieren, Umwandeln oder die Werkzeugansichten benutzen, können Sie diese Befehlsaufrufe auf der Seite <menuchoice><guimenu>Einstellungen</guimenu> <guisubmenu>Kile einrichten ...</guisubmenu><guisubmenu>Werkzeuge</guisubmenu><guilabel>Erstellen</guilabel></menuchoice> anpassen.

source: <title>Quick Preview</title>
de: <title>Schnellvorschau</title>

source: You will always need some time to view the result, when working with &latex;. &latex; has to compile the source and the viewer has to be called. This can be annoying if you only changed some letters in an equation difficult to typeset. &kile; offers a <emphasis>Quick Preview</emphasis> mode, where you can compile only a part of a document and save a lot of time. It supports four different modes, which can be combined with seven configurations.
de: Bei der Arbeit mit &latex; dauert es immer einige Zeit, bis Sie das Ergebnis betrachten können. &latex; muss den Quelltext kompilieren und zur Anzeige muss ein weiteres Programm aufgerufen werden. Das ist ziemlich lästig, wenn Sie zum Beispiel nur einige Zeichen in einer schwierig zu setzenden Gleichung geändert haben. &kile; bietet einen Modus <emphasis>Schnellvorschau</emphasis>, in dem nur ein Teil des Dokuments kompiliert wird, um Zeit zu sparen. Es gibt vier verschiedene Modi, die mit acht Einstellungen kombiniert werden können.

source: <screeninfo>Quick Preview</screeninfo>
de: <screeninfo>Schnellvorschau</screeninfo>

source: <phrase>Quick Preview</phrase>
de: <phrase>Schnellvorschau</phrase>

source: All settings must be done in <menuchoice><guimenu>Settings</guimenu><guisubmenu>Configure Kile...</guisubmenu> <guimenuitem>Tools</guimenuitem><guilabel>Preview</guilabel></menuchoice>.
de: Alle Einstellungen erfolgen in <menuchoice><guimenu>Einstellungen</guimenu><guisubmenu>Kile einrichten...</guisubmenu> <guimenuitem>Werkzeuge</guimenuitem><guilabel>Vorschau</guilabel></menuchoice>.

source: <screeninfo>Quick Preview Configuration</screeninfo>
de: <screeninfo>Einrichtung der Schnellvorschau</screeninfo>

source: <phrase>Quick Preview Configuration</phrase>
de: <phrase>Einrichtung der Schnellvorschau</phrase>

source: Selection Mode
de: Auswahlmodus

source: The user has to select a part of the document. Menu entry <menuchoice><guimenu>Build</guimenu><guisubmenu>QuickPreview</guisubmenu><guimenuitem>Selection</guimenuitem></menuchoice> or the keyboard shortcut <keycombo action="simul">&Ctrl;&Alt;<keycap>P</keycap></keycombo>,<keycap>S</keycap> will start the selected programs. &kile; takes the preamble of the original text, so that all packages and user defined commands are included. The user can choose one of eight predefined configurations:
de: Der Benutzer muss einen Teil des Dokuments auswählen. Mit dem Menüeintrag <menuchoice><guimenu>Erstellen</guimenu><guisubmenu>Schnellvorschau</guisubmenu><guimenuitem>Markierter Bereich</guimenuitem></menuchoice> oder dem Kurzbefehl <keycombo action="simul">&Ctrl;&Alt;<keycap>P</keycap></keycombo>,<keycap>S</keycap> werden die ausgewählten Programme gestartet. &kile; liest die Einleitung des Haupttextes ein, damit alle Pakete und benutzerdefinierten Befehle eingefügt werden. Sie können zwischen acht vordefinierten Einstellungen wählen.

source: LaTeX+&DVI; (embedded viewer)
de: LaTeX+&DVI; (eingebetteter Betrachter)

source: LaTeX+PS (embedded viewer)
de: LaTeX+PS (eingebetteter Betrachter)

source: PDFLaTeX+PDF (embedded viewer)
de: PDFLaTeX+PDF (eingebetteter Betrachter)

source: XeLaTeX+PS (embedded viewer)
de: XeLaTeX+PS (eingebetteter Betrachter)

source: This should be sufficient for all situations for which a quick preview is needed.
de: Dies sollte für alle Situationen ausreichen, in denen eine schnelle Vorschau erforderlich ist.

source: Environment Mode
de: Umgebungsmodus

source: Very often you want to preview the current environment, and especially mathematic environments, which sometimes may be difficult to write. &kile; offers a very fast way to do this. No selection is needed, only choose <menuchoice><guimenu>Build</guimenu><guisubmenu>QuickPreview</guisubmenu><guimenuitem>Environment</guimenuitem></menuchoice> or the keyboard shortcut <keycombo action="simul">&Ctrl;&Alt;<keycap>P</keycap></keycombo>,<keycap>E</keycap> and the current environment will be compiled and shown.
de: Häufig möchten Sie eine Vorschau der aktuellen Umgebung sehen, besonders bei mathematischen Umgebungen, die manchmal schwierig zu schreiben sind. &kile; ermöglicht diese Art von schneller Vorschau. Dazu müssen Sie keinen Teil des Dokuments auswählen. Benutzen Sie <menuchoice><guimenu>Erstellen</guimenu><guisubmenu>Schnellvorschau</guisubmenu><guimenuitem>Umgebung</guimenuitem></menuchoice> oder den Kurzbefehl <keycombo action="simul">&Ctrl;&Alt;<keycap>P</keycap></keycombo>,<keycap>E</keycap>. Dann wird die aktuelle Umgebung kompiliert und angezeigt.

source: Subdocument Mode
de: Teildokument-Modus

source: If you have a large project with a lot of documents, compiling the whole project is not a great idea, if you have made changes only in one single document. &kile; is able to compile and show a preview of the current subdocument. It takes the preamble from the master document and only compiles the current part when you choose <menuchoice><guimenu>Build</guimenu><guisubmenu>QuickPreview</guisubmenu><guimenuitem>Subdocument</guimenuitem></menuchoice> or the keyboard shortcut <keycombo action="simul">&Ctrl;&Alt;<keycap>P</keycap></keycombo>,<keycap>D</keycap>.
de: Besteht ein großes Projekts aus vielen einzelnen Dokumenten, dauert das kompilieren des gesamten Projekts sehr lange, auch wenn Sie den Quelltext nur in einem Dokument geändert haben. &kile; kann nur ein Teildokument kompilieren und anzeigen. Wählen Sie dazu <menuchoice><guimenu>Erstellen</guimenu><guisubmenu>Schnellvorschau</guisubmenu><guimenuitem>Teildokument</guimenuitem></menuchoice> oder den Kurzbefehl <keycombo action="simul">&Ctrl;&Alt;<keycap>P</keycap></keycombo>,<keycap>D</keycap>.

source: Mathgroup Mode
de: Mathematik-Modus

source: The mathgroup preview mode allows you to preview the mathgroup you are currently editing. &kile; takes the preamble from the master document and only compiles the mathgroup the cursor is currently in when you choose <menuchoice><guimenu>Build</guimenu><guisubmenu>QuickPreview</guisubmenu><guimenuitem>Mathgroup</guimenuitem></menuchoice> or the keyboard shortcut <keycombo action="simul">&Ctrl;&Alt;<keycap>P</keycap></keycombo>,<keycap>M</keycap>.
de: Mit der Vorschau für den Mathematikmodus können Sie die gerade bearbeitete Mathematikumgebung ansehen. &kile; liest die Einleitung des Hauptdokuments ein und kompiliert dann nur die Mathematikumgebung, in der sich der Cursor gerade befindet. Wählen Sie dazu <menuchoice><guimenu>Erstellen</guimenu><guisubmenu>Schnellvorschau</guisubmenu><guimenuitem>Mathematik-Umgebung</guimenuitem></menuchoice> oder den Kurzbefehl shortcut <keycombo action="simul">&Ctrl;&Alt;<keycap>P</keycap></keycombo>,<keycap>M</keycap>.

source: Quick Preview in Bottom Bar
de: Schnellvorschau in der Fußleiste

source: Instead of showing the preview in a new document &kile; can also be configured to use the bottom bar for preview compilations. You can activate this feature in the quick preview configuration panel.
de: Anstatt der Anzeige der Vorschau in einem zusätzlichen Fenster kann &kile; auch so eingestellt werden, das die Fußleiste zur Darstellung des kompilierten Ergebnisses verwendet wird. Diese Einstellung finden Sie auf der Seite <menuchoice><guimenu>Werkzeuge</guimenu> <guimenuitem>Vorschau</guimenuitem></menuchoice> im Einrichtungsdialog.

source: Graphic File Formats
de: Grafik-Dateiformate

source: &latex; and &pdflatex;
de: &latex; und &pdflatex;

source: &pdflatex;, when used with <userinput>graphics</userinput> or <userinput>graphicx</userinput> packages, can compile correctly PNG and JPG files into &DVI; or PDF, but is not able to handle EPS files. Conversely, the process of compiling with &latex; to &DVI; and converting to PS and eventually PDF does support EPS, but does not support PNG and JPG.
de: Wenn &pdflatex; die Paketen <userinput>graphics</userinput> oder <userinput>graphicx</userinput> benutzt, können damit PNG- oder JPG-Dateien korrekt in die Formate &DVI; oder PDF kompiliert werden, aber keine EPS-Dateien. Umgekehrt funktioniert das Kompilieren mit &latex; zu &DVI; und die Umwandlung zu PS und PDF mit EPS-Dateien, aber nicht mit PNG- und JPG-Dateien.

source: A lot of users want to create PDF documents, but also want to use of the excellent <application>Pstricks</application> package to create &PostScript; graphics, or they want to use the &PostScript; output of mathematical and scientific software like <application>Mathematica</application>, <application>Maple</application> or <application>MuPAD</application>. These &latex; users have to compile first in &PostScript;, even if they want to create PDF documents, because these programs produce &PostScript; code which cannot be managed by &pdflatex;. However, it is not so hard as it may sound, because &kile; will help.
de: Viele Benutzer möchten PDF-Dokumente erzeugen, aber auch mit dem hervorragenden Paket <application>Pstricks</application> &PostScript;-Grafiken erstellen. Oder Sie möchten die &PostScript;-Ausgabe von mathematischer und wissenschaftlicher Software wie <application>Mathematica</application>, <application>Maple</application> oder <application>MuPAD</application> weiter bearbeiten. Diese &latex;-Benutzer müssen zuerst in &PostScript; kompilieren, auch wenn Sie eigentlich PDF-Dokumente erzeugen möchten, da diese Programme &PostScript;-Quelltext produzieren, der von &pdflatex; nicht verarbeitet werden kann. Auch in diesem Fall kann &kile; Sie unterstützen und Ihre Arbeit erleichtern.

source: Graphics Conversion
de: Umwandeln von Grafiken

source: To overcome this frustrating loop, in case you want to include both &PostScript; code and PNG or JPG files, you have a number of workarounds:
de: Möchten Sie sowohl &PostScript;-Quelltext als auch PNG- oder JPG-Dateien in einem Dokument benutzen, gibt es mehrere Arbeitsweisen:

source: If you need a file in PS format, but have JPG or PNG graphics, you can also simply use &pdflatex; with &DVI; output first, and then run <application>dvips</application> to create the PS file. You see that &pdflatex; is a very good choice, if your source contains no &PostScript; code at all.
de: Möchten Sie JPG- oder PNG-Grafikdateien in eine Datei im PS-Format umwandeln, können Sie zuerst auch nur &pdflatex; mit der Ausgabe in &DVI; benutzen und dann mit <application>dvips</application> eine PS-Datei erstellen. &pdflatex; ist ein geeignetes Werkzeug für diese Aufgabe, solange Ihr Quelle keinen &PostScript;-Quelltext enthält.

source: You can convert EPS files to PNG or other formats with utilities as the <ulink url="http://www.gimp.org/"><application>Gimp</application></ulink> or <ulink url="http://www.imagemagick.org/">&imagemagick;</ulink> and use &pdflatex;.
de: Sie können EPS-Dateien in das PNG oder andere Formate umwandeln, indem Sie Programme wie <ulink url="http://www.gimp.org/"><application>Gimp</application></ulink> oder <ulink url="http://www.imagemagick.org/">&imagemagick;</ulink> und &pdflatex; verwenden.

source: A preferred way is to convert EPS graphics to PDF graphics with <command>epstopdf</command>, which comes with every &tex; distribution distribution and then use &pdflatex;. It produces high quality graphics, and you can even control the result with some of the following options:
de: Die Umwandlung von EPS-Grafiken in PDF-Grafiken sollte mit dem Programm <command>epstopdf</command>. Dieses Programm ist in jeder &tex;-Distribution enthalten. Die weitere Bearbeitung erfolgt dann mit &pdflatex;. Damit werden qualitativ hochwertige Grafiken erzeugt, das Ergebnis kann mit den folgenden Einstellungen beeinflußt werden:
