Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/extragear-office/kmymoney_details-schedules.po
Languages: de

source: Schedules
de: Geplante Buchungen

source: Introduction
de: Einführung

source: Schedules maintain information about transactions that occur one or more times over a specified period of time.
de: Geplante Buchungen enthalten Informationen über Buchungen, die ein- oder mehrmalig in einer bestimmten Zeitperiode vorkommen.

source: Sometimes called a recurring transaction, a schedule provides a means to record information about a transaction that happen on a regular basis. A common schedule is your salary. Once a month, or maybe weekly, the company you work for pays you for services rendered. This payment can happen in many different ways, but each month or week you will receive a payment that needs to be recorded.
de: Geplante Buchungen sind regelmäßig wiederkehrende Buchung und werden deshalb auch manchmal sich "wiederholende Buchungen" genannt. Eine bekannte geplante Buchung ist zum Beispiel Ihr Gehalt. Einmal pro Monat oder vielleicht auch wöchentlich zahlt Ihnen Ihre Firma Geld für die von Ihnen geleistete Arbeit. Diese Zahlung kann auf verschiedenen Wegen erfolgen, aber Sie erhalten monatlich oder wöchentlich eine Zahlung, die aufgezeichnet werden muss.

source: Because you know these payments are regularly made to you, you can create a Schedule to record information about the payment and even create the transaction for you when pay day arrives.
de: Sie wissen, dass diese Zahlungen regelmäßig erfolgen, sodass Sie eine geplante Buchung anlegen können, sodass die Buchung automatisch für Sie erzeugt wird, sobald das Gehalt gezahlt wird.

source: Other types of schedules can also be recorded to reflect money coming in and out of your accounts. Common expenses, such as utility bills or money transfers, can be recorded with schedules, along with loan repayments. Scheduling a payment can also provide a useful reminder that you need to make a payment.
de: Auch andere Arten von geplanten Buchungen können hinterlegt werden, um den Ein- und Ausgang von Geld auf Ihren Konten zu hinterlegen. Allgemeine Ausgaben, wie Dienstleisterrechnungen oder Überweisungen, können genauso als geplante Buchung hinterlegt werden, wie z.B. Lohnzahlungen. Eine geplante Buchung bietet Ihnen außerdem eine gute Möglichkeit, um Sie an fällige Zahlungen zu erinnern.

source: A schedule consists of two main parts: the scheduling data and the transaction data. The scheduling data records the occurrence of the schedule, i.e., when the transaction is to be entered into the ledger and how. The transaction data records the normal details about the transaction, and will be entered in to the ledger as-is.
de: Eine geplante Buchung besteht aus zwei Hauptteilen: den Daten zum Zeitpunkt, sowie dem Inhalt der Buchung. Die Daten des Zeitpunkts geben an, wann und wie die Buchung in das Kontenblatt eingetragen wird. Die Buchungsdaten enthalten die üblichen Details zur Buchung und werden so wie sie sind in das Kontenbuch übernommen.

source: Types of schedules
de: Arten von geplanten Buchungen

source: There are four different types of schedules in the current version of &kappname;:
de: In der aktuellen Version von &kappname; gibt es vier verschiedene Arten von geplanten Buchungen:

source: <para>Bills</para>
de: <para>Rechnungen</para>

source: <para>Deposits</para>
de: <para>Einzahlungen</para>

source: <para>Loans</para>
de: <para>Kredite</para>

source: <para>Transfers</para>
de: <para>Buchungen</para>

source: <title>Bills</title>
de: <title>Rechnungen</title>

source: A Bill Schedule is used for money going out of your account, such as a Gym membership or a utility bill.
de: Eine geplante Buchung vom Typ "Rechnung" wird immer dann verwendet, wenn Geld von Ihrem Konto abfließt, z.B. für die Mitgliedschaft im Fitness-Studio oder eine Rechnung für eine Dienstleistung.

source: <title>Deposits</title>
de: <title>Einzahlungen</title>

source: A Deposit Schedule is for money coming into your account, such as a pay check.
de: Eine geplante Buchung vom Typ "Einzahlung" wird verwendet, wenn Geld auf Ihr Konto kommt, z.B. Ihr Gehalt.

source: <title>Loans</title>
de: <title>Kredite</title>

source: A Loan Schedule is a special type of schedule and is created when dealing with <link linkend="details.loans">Loan</link> accounts.
de: Eine geplante Kreditzahlung ist eine spezielle geplante Buchung und wird erstellt, wenn Sie ein <link linkend="details.loans">Kreditkonto</link> erstellen.

source: <title>Transfers</title>
de: <title>Buchungen</title>

source: A Transfer Schedule is used for money coming out of one account and going into another, such as making a credit card payment from your checking account.
de: Eine geplante Buchung des Typs "Buchung" wird verwendet, wenn Geld von einem Konto zum anderen fließt, z.B. wenn eine Kreditkartenabrechnung von Ihrem Girokonto abgebucht wird.

source: The schedule view
de: Die Ansicht der geplanten Buchungen

source: Open the schedule view by clicking on the <guiicon>Schedule <inlinemediaobject><imageobject><imagedata fileref="schedule_view.png"/></imageobject></inlinemediaobject></guiicon> icon in the view selector.
de: Öffnen Sie die Ansicht der geplanten Buchungen, indem Sie auf das <guiicon>geplante Buchungen<inlinemediaobject><imageobject><imagedata fileref="schedule_view.png"/></imageobject></inlinemediaobject></guiicon> Symbol in der linken Navigationsleiste klicken.

source: Schedule View
de: Die Ansicht der geplanten Buchungen

source: The schedule view consists of a view area with two tabs along with a <guibutton>New Schedule</guibutton> button above it. The first tab <guibutton>List View</guibutton> shows all schedules, grouped by type. The second tab <guibutton>Calendar View</guibutton> is described in its own section below.
de: Die Ansicht „Geplante Buchungen“ besteht aus zwei Karteikarten, die über entsprechende Karteireiter erreicht werden können, sowie dem Knopf <guibutton>Neue Buchung planen</guibutton> darüber. Die erste Karteikarte <guibutton>Listenansicht</guibutton> zeigt alle geplanten Buchungen, gruppiert nach dem Typ der Buchung. Die zweite Karteikarte <guibutton>Kalenderansicht</guibutton> wird in einem separaten Abschnitt weiter unten erläutert.

source: To create a new schedule click on the button. For Bill, Deposit, and Transfer schedules, &kappname; will display the new schedule dialog. Loan schedules are handled differently, and are described in the section on Loans.
de: Um eine neue geplante Buchung anzulegen, klicken Sie auf den entsprechenden Knopf. Für Rechnungen, Einzahlungen und Umbuchungen zeigt Ihnen &kappname; das Dialogfenster für neue geplante Buchungen. Kreditbuchungen werden anders behandelt und im Abschnitt über Kreditkonten näher erläutert.

source: The new schedule dialog
de: Das Dialogfenster „Geplante Buchung bearbeiten“

source: New Schedule
de: Neue geplante Buchung

source: A new dialog window is now shown, prompting for the schedule and transaction data. The requested data includes the following:
de: Es öffnet sich ein Dialogfenster, in das Sie die Daten zum Zeitpunkt und dem Inhalt der geplanten Buchung eingeben können. Hierzu gehören:

source: Schedule Name
de: Name der geplanten Buchung

source: Next due date
de: Nächste Fälligkeit am

source: Frequency
de: Häufigkeit

source: Payment method
de: Zahlungsmethode

source: Amount
de: Betrag

source: Other transaction details
de: Weitere Buchungsdetails

source: Schedule options
de: Optionen der geplanten Buchung

source: Filling in the fields
de: Ausfüllen der Felder

source: Enter the name and the date of the next occurrence of this schedule into their respective fields. The name is how the schedule will be shown in the list view. Specify how often the schedule should occur, using the Frequency field and drop down list. For example "every 6 weeks" or "every 3 months". If the amount varies transaction to transaction make sure to check the <guilabel>Estimate</guilabel> check box and you will be prompted for the correct amount when it is entered into the ledger. Fill in all the transaction fields as you would normally with the ledger view.
de: Geben Sie den Namen und das nächste Fälligkeitsdatum dieser geplanten Buchung in die entsprechenden Eingabefelder ein. Der Name der geplanten Buchung wird in der Liste der geplanten Buchungen angezeigt. Geben Sie an, wie oft die geplante Buchung fällig ist, indem Sie die entsprechende Häufigkeit in das Eingabefeld eintragen und aus der Auswahlliste auswählen. Zum Beispiel "alle 6 Wochen" oder "alle 3 Monate". Wenn der Betrag von Buchung zu Buchung variiert, markieren Sie die Option <guilabel>Dies ist eine Schätzung, da der Betrag für jede Zahlung schwankt</guilabel>. Sie werden dann nach dem genauen Betrag gefragt, wenn &kappname; die Buchung in das Kontenbuch eintragen möchte. Füllen Sie alle Buchungsfelder so aus, als würden Sie die Buchung im Kontenbuch eintragen.

source: Modifying the schedule behavior
de: Das Verhalten der geplanten Buchung verändern

source: At the bottom of the dialog are some optional fields that can modify how the schedule behaves. If the schedule occurs on a weekend you can choose whether to enter the transaction on the weekend day, the previous Friday, or the next Monday. Typically this option is used to replicate some real world operation such as a bank transaction.
de: Im unteren Bereich des Fensters gibt es einige Optionen, die das Verhalten der geplanten Buchung verändern. Wenn das Fälligkeitsdatum auf ein Wochenende fällt, können Sie auswählen, ob das Datum unverändert bestehen bleibt, ob die Buchung am vorhergehenden Freitag oder am darauf folgenden Montag gebucht wird. Normalerweise wird diese Option verwendet, um die reale Welt in Form von Bankbuchungen abzubilden.

source: Letting &kappname; enter the transaction into the register
de: Buchungen von &kappname; automatisch eintragen lassen

source: To let &kappname; automatically enter the transaction for you when needed, make sure that the check box labeled <guilabel>Enter this schedule into the ledger automatically when it is due</guilabel> is checked. Otherwise, when the transaction is due to be entered, &kappname; will open a dialog box asking you to confirm that you want it to be entered. This behavior is configurable, and more information can be found in the Settings section.
de: &kappname; kann die Buchungen automatisch bei Fälligkeit in das Kontenbuch eintragen. Aktivieren Sie dafür die Kontrollbox <guilabel>Buchung bei Fälligkeit automatisch in das Kontenbuch eintragen</guilabel>. Ansonsten wird &kappname; ein Dialogfenster öffnen, sobald das Fälligkeitsdatum der geplanten Buchung erreicht ist und Sie auffordern, die Buchung in das Kontenbuch eintragen zu lassen. Dieses Verhalten ist konfigurierbar, weitere Informationen dazu finden Sie im Abschnitt über die Programmeinstellungen.

source: Letting &kappname; know when the schedule will finish
de: &kappname; wissen lassen, wann eine geplante Buchung endet

source: If you know how many transactions are left or when they are due to finish, this information can be entered so the transactions are not entered indefinitely. Check the appropriate check box and enter the appropriate information. Only the date or the number of transactions remaining is needed because the other can be calculated.
de: Wenn Sie wissen, wie viele Buchungen noch übrig sind oder wann die regelmäßige Buchung endet, so können Sie diese Information hinterlegen, sodass die geplante Buchung nicht unendlich ist. Klicken Sie die entsprechende Option an und geben Sie das Ende der geplanten Buchung ein. Nur das Enddatum oder die verbleibende Anzahl der Buchungen müssen eingegeben werden, der jeweils andere Wert kann daraus errechnet werden.

source: When you have entered all the necessary information click on <guibutton>OK</guibutton> to continue.
de: Wenn Sie alle notwendigen Daten eingegeben haben, klicken Sie auf den Knopf <guibutton>OK</guibutton> um fortzufahren.

source: Editing schedules
de: Geplante Buchungen bearbeiten

source: To edit a schedule simply select the entry in the list and right click to bring up the context menu and select <guimenuitem>Edit</guimenuitem>. This will bring up a dialog similar to the New Schedule dialog, where you can alter the necessary data.
de: Um eine geplante Buchung zu editieren, wählen Sie diese in der Liste und klicken mit der rechten Maustaste darauf. Aus dem erscheinenden Kontextmenü wählen Sie <guimenuitem>Bearbeiten</guimenuitem> aus. Es erscheint der bereits vom Anlegen der geplanten Buchung bekannte Dialog, mit dessen Hilfe Sie die Daten der geplanten Buchungen verändern können.

source: Deleting schedules
de: Geplante Buchungen löschen

source: To delete a schedule simply select the entry in the list and right click to bring up the context menu and select <guimenuitem>Delete</guimenuitem>.
de: Um eine geplante Buchung zu löschen, wählen Sie den gewünschten Eintrag in der Liste und wählen mit der rechten Maustaste aus dem Kontextmenü den Punkt <guimenuitem>Löschen</guimenuitem>.

source: The calendar view
de: Die Kalenderansicht

source: The calendar tab presents the schedules in a calendar format so it is easier to see when they occur. To switch to the calendar view click on the <guibutton>Calendar View</guibutton> tab.
de: Die Kalenderansicht zeigt Ihnen alle geplanten Buchungen in einem Kalender, sodass Sie sehr übersichtlich sehen können, wann diese fällig sind. Um in die Kalenderansicht zu gelangen klicken Sie einfach auf den Karteireiter <guibutton>Kalenderansicht</guibutton>.

source: Calendar View
de: Kalenderansicht

source: The calendar type can be changed using the <guibutton>Select Style</guibutton> button. Currently only two types exist: Week and Month. The monthly view is the default, and is usually the most useful. Navigate through the dates using the controls as you would with the date input control.
de: Der Kalendertyp kann mit Hilfe des Knopfs <guibutton>Darstellung auswählen</guibutton> verändert werden. Derzeit gibt es nur zwei Typen: Woche und Monat. Die Monatsansicht ist die Voreinstellung und die wohl hilfreichste Darstellungsform. Navigieren Sie durch den Kalender, indem Sie die Steuerelemente rechts oben verwenden.

source: On any day with scheduled transactions, the number of transactions scheduled for that day is displayed on the calendar.
de: An Tagen mit geplanten Buchungen wird die Anzahl der Buchungen für den betreffenden Tag im Kalender angezeigt.

source: To view the schedule(s) that fall on that day, move the mouse cursor over the highlight and a popup window will be displayed allowing you to view the schedule summary.
de: Um die geplanten Buchungen, die auf den gewählten Tag fallen, anzusehen, bewegen Sie den Mauszeiger über den Eintrag. Es erscheint ein Fenster, in dem die Zusammenfassung der geplanten Buchung angezeigt wird.

source: If more than one schedule falls on that day you can cycle through them using the arrow buttons in the upper corners of the popup window.
de: Wenn mehrere geplante Buchung auf einen Tag fallen, können Sie die einzelnen geplanten Buchungen durch die Schaltflächen in den oberen Ecken des Fensters durchblättern.

source: If you find that the display is cluttered with schedules and you only want to view one type of schedule, then this is possible from the <guibutton>Select Schedules</guibutton> dropdown. After clicking on this button the different schedule types are listed and are checked by default
de: Wenn Ansicht mit geplanten Buchungen übersät ist und Sie nur einen bestimmten Typ an geplanten Buchungen sehen möchten, können Sie diese durch den Knopf <guibutton>Planungen wählen</guibutton> filtern. Nachdem Sie diesen Knopf anklicken, sehen Sie die verschiedenen Buchungstypen und diese sind standardmäßig alle ausgewählt.

source: To remove a type from the calendar view simply uncheck it in the list.
de: Um einen Buchungstyp aus dem Kalender auszublenden, entfernen Sie das gewünschte Kreuzchen aus der Liste.

source: Entering scheduled transactions
de: Geplante Buchungen eintragen

source: Entering a scheduled transaction means actually entering a transaction into the appropriate ledger, using the details specified in the schedule. Scheduled transactions can be entered in one of four different ways:
de: Eine geplante Buchung eintragen bedeutet, im entsprechenden Kontenbuch eine neue Buchung auf Basis der in der geplanten Buchung hinterlegten Informationen anzulegen. Geplante Buchungen können auf eine von vier verschiedenen Weisen eingetragen werden:

source: Manually by right clicking on the list entry
de: Manuell durch Klick mit der rechten Maustaste auf den Listeneintrag

source: Manually via the popup window in the calendar view
de: Manuell über das Aufklapp-Fenster in der Kalenderansicht

source: &kappname; can enter them with or without your interaction upon startup
de: &kappname; kann sie aber auch mit oder ohne Ihr Zutun beim Starten eintragen

source: &kappname; can enter them with your interaction during online banking or import of an electronic bank statement
de: &kappname; kann sie mit Ihrer Interaktion während des Online-Bankings oder Imports von elektronischen Kontoauszügen anlegen

source: Manually entering scheduled transactions
de: Manuelles Eintragen von geplanten Buchungen

source: You can enter a scheduled transaction manually by right clicking on the list entry and selecting <guimenuitem>Enter</guimenuitem> from the popup menu or by clicking on the <guibutton>Enter</guibutton> button on the popup window in the calendar view.
de: Sie können eine geplante Buchung manuell eintragen lassen, indem Sie mit der rechten Maustaste die gewünschte geplante Buchung anklicken und aus dem Kontextmenü <guimenuitem>Nächste Zahlung eintragen</guimenuitem> auswählen., oder indem Sie den Knopf <guibutton>Eintragen</guibutton> im erscheinenden Kontextmenü in der Kalenderansicht betätigen.

source: Confirming the transaction to enter
de: Die einzutragende Buchung bestätigen

source: After selecting either method the Enter Scheduled Transaction dialog window is shown prompting you with the required information that was entered when you created the schedule.
de: Nachdem Sie das Eintragen der geplanten Buchungen auf eine der beschriebenen Arten angestoßen haben, erscheint das Dialogfenster zum Eintragen einer geplanten Buchung mit den dort hinterlegten Informationen.

source: This information can be changed, and the changes can be applied to just this one instance of the schedule or to all subsequent transactions. After checking that all the data is correct clicking on <guibutton>OK</guibutton> will add the transaction to the ledger and update the next due date of the schedule to the next occurrence. If you have changed any of the transaction data a further confirmation of what you changed will be displayed, giving you a final chance to accept or reject the changes.
de: Diese Informationen können nun nach Bedarf verändert und entweder für diese eine oder auch für alle zukünftigen Buchungen übernommen werden. Nachdem Sie geprüft haben, dass alles in Ordnung ist, klicken Sie den Knopf <guibutton>OK</guibutton>, um die Buchung ins Kontenbuch zu übernehmen und das nächste Fälligkeitsdatum der geplanten Buchung auf den nächsten Termin zu setzen. Wenn Sie irgendein Feld der Buchung geändert haben, werden Sie nochmals gefragt, ob die angezeigten Änderungen übernommen oder verworfen werden sollen.

source: Select what you want to do with the information presented and click <guibutton>OK</guibutton> or <guibutton>Cancel</guibutton>.
de: Wählen Sie die gewünschte Aktion aus und klicken Sie den Knopf <guibutton>OK</guibutton> oder <guibutton>Abbrechen</guibutton>.

source: Letting &kappname; enter the scheduled transaction(s) for you
de: Lassen Sie &kappname; Ihre geplante(n) Buchung(en) für Sie eintragen

source: Alternatively, &kappname; can check which schedules are due upon startup and enter them for you if the appropriate option was checked when setting up the schedule.
de: Als Alternative zum manuellen Eintragen kann &kappname; beim Programmstart überprüfen, welche geplanten Buchungen fällig sind und diese automatisch in das Kontenbuch eintragen, wenn Sie die entsprechende Option beim Anlegen der geplanten Buchung aktiviert haben.

source: If the option was not checked then &kappname; will open the previously mentioned dialog and you can follow the steps mentioned there. &kappname; will also open the dialog if the amount is an estimate so you can enter the real amount.
de: Wenn das automatische Eintragen nicht aktiviert wurde, öffnet &kappname; das oben beschriebene Dialogfenster und Sie können die Buchung über den beschriebenen Weg ins Kontenbuch eintragen lassen. Das gleiche Fenster öffnet sich, wenn Sie beim Anlegen der geplanten Buchung angegeben haben, dass der Betrag eine Schätzung ist. Sie können nun den tatsächlichen Geldbetrag der Buchung eintragen.

source: You can also opt to have &kappname; not check which transactions are scheduled on startup by deselecting the option in the Settings dialog and any overdue transaction or transactions due 'today' will be shown in the Home view for you to enter manually.
de: Sie können &kappname; auch so konfigurieren, dass beim Programmstart nicht geprüft wird, ob fällige geplante Buchungen vorhanden sind. Verwenden Sie hierfür im Einstellungsdialog von &kappname; die Option "Geplante Buchungen beim Start überprüfen".
