Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/extragear-office/kmymoney_details-payees.po
Languages: de

source: Payees
de: Zahlungsempfänger

source: The Payees screen provides detailed information about all the payees and payers involved in transactions. The Payees screen is split into two main areas: a payees and payers list and a detail area.
de: Die Zahlungsempfängerübersicht zeigt detaillierte Informationen über alle Zahlenden und Zahlungsempfänger aus Ihren Buchungen. Die Übersicht ist in zwei Hauptbereiche aufgeteilt: eine Empfängerliste und ein Detailbereich.

source: The Payees screen allows for viewing the transactions for the selected payee, updating personal information associated with a particular payee or payer, and specifying transaction matching criteria.
de: Die Zahlungsempfängerübersicht erlaubt das Ansehen aller Buchungen eines Empfängers, das Aktualisieren der hinterlegten Informationen zum Empfänger und das Angeben von Kriterien für die automatische Zuordnung von Buchungen.

source: Payees List
de: Liste der Zahlungsempfänger

source: A list of payees and payers is on the left side of this screen. The payee list is sorted alphabetically.
de: Eine Liste der Zahlungsempfänger befindet sich auf der linken Seite des Fensters. Sie ist alphabetisch sortiert.

source: Adding a Payee or Payer
de: Zahlungsempfänger hinzufügen

source: To add a payee or payer, right-click on any payee name and choose <guimenuitem>New payee</guimenuitem>. This creates a new payee called <quote>New Payee</quote>. Right-click on this payee and select <guimenuitem>Rename payee</guimenuitem> to enter the name of the new payee or payer.
de: Um einen Zahlungsempfänger hinzuzufügen, klicken Sie mit der rechten Maustaste auf einen beliebigen Empfängernamen und wählen Sie <guimenuitem>Neuer Zahlungsempfänger</guimenuitem>. Hiermit wird ein neuer Empfänger mit dem Namen <quote>Neuer Zahlungsempfänger</quote> angelegt. Klicken Sie mit der rechten Maustaste auf den neu angelegten Empfänger und wählen Sie <guimenuitem>Zahlungsempfänger umbenennen</guimenuitem>, um den Namen des neuen Zahlungsempfängers einzugeben.

source: Renaming a Payee or Payer
de: Zahlungsempfänger umbenennen

source: To rename a payee or payer, simply right-click on the name, select <guimenuitem>Rename payee</guimenuitem> and the name becomes editable. Changing the name will affect the name in all the transactions in which it appears.
de: Um einen Zahlungsempfänger umzubenennen, klicken Sie mit der rechten Maustaste auf den Namen und wählen Sie aus dem Kontextmenü den Punkt <guimenuitem>Zahlungsempfänger umbenennen</guimenuitem>. Der Name des Empfänger lässt sich nun bearbeiten. Das Ändern des Namens wirkt sich auf sämtliche Buchungen aus, in denen er vorkommt.

source: Deleting a Payee or Payer
de: Zahlungsempfänger löschen

source: To remove a payee or payer, right-click the name and select <guimenuitem>Delete payee</guimenuitem>. If the payee has any transactions, you will be presented with a dialog that allows you to reassign them to a different payee, and also a check box to enable a deleted name to be added to the new payee's matching list.
de: Um einen Zahlungsempfänger zu löschen, klicken Sie mit der rechten Maustaste auf den Namen des gewünschten Empfängers und wählen anschließend <guimenuitem>Zahlungsempfänger löschen</guimenuitem> aus dem erscheinenden Kontextmenü. Sollten noch Buchungen existieren, die dem zu löschenden Empfänger zugeordnet sind, so werden Sie gefragt, ob Sie diese einem anderen Empfänger zuordnen möchten. Weiterhin können Sie über das Optionsfeld angeben, ob die Kriterienliste für die automatische Zuordnung von Buchungen des zu löschenden Empfängers zum ausgewählten neuen Zahlungsempfänger hinzugefügt werden soll.

source: Additional Payee Details
de: Zusätzliche Details zum Zahlungsempfänger

source: Personal Information
de: Persönliche Angaben

source: To view and edit the personal information associated with a particular payee, select the payee from the list and select the Address tab. To modify this information, edit the detail area directly and press the Update button when finished.
de: Um die persönlichen Informationen eines Zahlungsempfängers anzusehen und zu editieren, wählen Sie ihn aus der Liste aus und klicken Sie auf den Karteireiter "Adresse". Sie können die Informationen direkt in den Feldern bearbeiten und die Änderungen anschließend durch Drücken des Knopf mit dem grünen Haken (unten rechts) übernehmen.

source: The personal information tab
de: Die Karteikarte Persönliche Angaben

source: Personal information
de: Persönliche Angaben

source: Transaction Matching Settings
de: Einstellungen zur automatischen Buchungs-Zuordnung

source: Overview
de: Übersicht

source: &kappname; has the ability to automatically assign the proper payee to imported transactions. This can be handy when importing transactions from your bank, when the payee name has extra unnecessary characters, or worse, if the payee names change.
de: &kappname; hat die Fähigkeit, eine automatische Zuordnung der passenden Zahlungsempfänger zu importierten Buchungen vorzunehmen. Das kann sehr hilfreich sein, wenn Sie Buchungen von Ihrer Bank (z.B. per HBCI) importieren und der angegebene Zahlungsempfänger weitere unnötige Zeichen enthält, oder noch schlimmer der Name des Zahlungsempfängers ändert sich.

source: For example, let's say your monthly mortgage payment comes in from your bank like this <quote>SUNTRUST BANK MAPLE VALLEY, GA 111506</quote> one month and then <quote>SUNTRUST BANK MAPLE VALLEY, GA 121606</quote> the next month. You would really like both of those transactions to be assigned simply to your payee <quote>SunTrust</quote>. The transaction matching feature is for you!
de: Nehmen wir an, Ihr monatliches Gehalt kommt bei Ihnen von Ihrer Bank folgendermaßen an: <quote>SUNTRUST BANK MAPLE VALLEY, GA 111506</quote> im einen Monat und im anderen mit <quote>SUNTRUST BANK MAPLE VALLEY, GA 121606</quote>. Sie möchten aber dass beide Buchungen mit Ihrem Zahlungsempfänger <quote>SunTrust</quote> verbunden wird. Die Funktion der automatischen Buchungs-Zuordnung ist genau das Richtige für Sie!

source: The payee matching tab
de: Die Karteikarte "Zuordnung"

source: Payee matching details
de: Zuordnungsdetails für Zahlungsempfänger

source: Setting up
de: Einrichtung

source: From the Matching tab, you can set the Transaction Matching Settings. You have 3 major options:
de: Auf der Karteikarte "Zuordnung" können Sie die Einstellungen für automatische Zuordnung vornehmen. Sie haben drei Hauptoptionen zur Verfügung:

source: No Matching. Disables the feature for this payee. This is the default setting for all payees.
de: Keine Zuordnung. Deaktiviert diese Funktion für diesen Zahlungsempfänger. Dies ist die Standardeinstellung für alle Zahlungsempfänger.

source: Match on Payee Name. Enables the feature, and uses the payee name itself as the Match Key
de: Nach Zahlungsempfänger zuordnen. Aktiviert die Funktion unter Verwendung des Zahlungsempfänger Feldes als Zuordnungskriterium.

source: Match on Key. Enables the feature, and allows you to enter one or more Match Keys of your choosing. In general, entering a plain string will work perfectly. However, the match keys are actually regular expressions, so it is possible to match on more complicated patterns.
de: Nach einem unten aufgelisteten Namen zuordnen. Aktiviert die Funktion und erlaubt es Ihnen, ein oder mehrere beliebige Zuordnungskriterien einzugeben. Normalerweise funktioniert dies durch einfache Eingabe eines Textes perfekt. Trotzdem haben Sie Möglichkeit, statt eines Textes einen regulären Ausdruck einzugeben, sodass komplexe Muster als Kriterium hinterlegt werden können.

source: You can also choose whether you want to ignore the case of the Match Key. If you choose this option, the Match Key <quote>SunTrust</quote> would match <quote>SUNTRUST BANK</quote> or <quote>SunTrust Bank</quote>.
de: Sie können ebenfalls angeben, ob die Groß-/Kleinschreibung des Zuordnungskriteriums berücksichtigt werden soll oder nicht. Wenn Sie "Groß/Klein ignorieren" aktivieren, so würde das Kriterium <quote>SunTrust</quote> sowohl auf <quote>SUNTRUST BANK</quote> als auch auf <quote>SunTrust Bank</quote> passen.

source: Importing Transactions
de: Buchungen importieren

source: When you import transactions using the QIF import, or using a plugin such as OFX or AqBanking, the Match Keys you have set will be considered. If the Match Key for one of your payees is found anywhere in the payee of the imported transaction, the corresponding payee from your list will be assigned to that transaction. Thus, a Match Key of <quote>SunTrust</quote> will match <quote>SUNTRUST BANK MAPLE VALLEY,GA</quote> or even <quote>MORGENSUNTRUST&amp;LOAN</quote>. So choose your Match Keys carefully.
de: Sobald Sie Buchungen per QIF oder einem Modul wie OFX oder AqBanking (HBCI) importieren, werden die eingegeben Zuordnungskriterien verwendet. Sobald ein Kriterium Ihrer Zahlungsempfänger auf eine importierte Buchung zutrifft, wird der entsprechende Zahlungsempfänger aus Ihrer Liste der Buchung zugeordnet. So würde das Kriterium <quote>SunTrust</quote> zutreffen auf <quote>SUNTRUST BANK MAPLE VALLEY,GA</quote> aber auch <quote>MORGENSUNTRUST&amp;LOAN</quote>. Wählen Sie die Zuordnungskriterien also sorgfältig aus.

source: If a transaction payee matches more than one Match Key, the behavior is undefined. &kappname; will arbitrarily pick one of the matching payees.
de: Wenn eine Buchung auf die Zuordnungskriterien mehrerer Zahlungsempfänger zutrifft, ist das Ergebnis nicht vorhersehbar: &kappname; wird sich einen der zutreffenden Empfänger herauspicken und diesen zuordnen.

source: Viewing Transaction History
de: Buchungen ansehen

source: To view all transactions associated with a particular payee, select the payee from the list and the Transaction tab in the detail area. Double-clicking a particular transaction will bring you directly to that transaction in the Ledgers screen.
de: Um alle Buchungen eines Zahlungsempfängers anzusehen, wählen Sie den gewünschten Empfänger aus der Liste und gehen Sie auf die Karteikarte "Buchungen". Ein Doppelklick auf eine der Buchungen bringt Sie direkt zu dieser Buchung im Kontenbuch.

source: The transaction tab
de: Die Karteikarte "Buchungen"

source: Transaction history
de: Buchungsverlauf
