Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/extragear-office/kmymoney_firsttime.po
Languages: de

source: Using &kappname; for the first time
de: &kappname; zum ersten Mal starten

source: Running &kappname; for the first time
de: &kappname; zum ersten Mal starten

source: Once &kappname; has fully loaded two windows will be opened. The top window, 'Tip of the Day' offers one of a series of important or useful pieces of information about the application.
de: Wenn &kappname; vollständig gestartet ist, werden zwei Fenster angezeigt. Das oberste Fenster „Tipp des Tages “ zeigt eine Reihe von wichtigen und nützlichen Informationen über das Programm.

source: <screeninfo>Tip of the Day</screeninfo>
de: <screeninfo>Tipp des Tages</screeninfo>

source: <phrase>Tip of the Day</phrase>
de: <phrase>Tipp des Tages</phrase>

source: You are recommended to quickly read through these tips by pressing on the <guibutton>Previous</guibutton> and <guibutton>Next</guibutton> buttons at the bottom of the window.
de: Es wird empfohlen, diese Hinweise durchzulesen, indem Sie die Knöpfe <guibutton>Zurück</guibutton> und <guibutton>Nächster</guibutton> unten im Dialogfenster benutzen.

source: Once you have read the tips the window can be closed; it will re-open each time &kappname; is started. To stop this default behavior, uncheck the appropriate option on the Tip of the Day window.
de: Haben Sie diese Tipps durchgelesen, können Sie das Fenster schließen. Es wird bei jedem Start von &kappname; wieder geöffnet. Um dieses Standardverhalten abzustellen, deaktivieren Sie das Ankreuzfeld <guilabel>Tipps beim Start anzeigen</guilabel> im Dialogfenster,

source: Tips can be read at anytime by selecting <guimenuitem>Show tip of the day</guimenuitem> from the <guimenu>Help</guimenu> menu within &kappname;.
de: Die Tipps können Sie jederzeit lesen, indem Sie in &kappname; <guimenuitem>Tipp des Tages anzeigen</guimenuitem> aus dem Menü <guimenu>Hilfe</guimenu> wählen.

source: All tips have been extracted from the Frequently Asked Questions list (FAQ) that provides more detailed help and can be found on the project <ulink url="http://www.kmymoney.org/faq.php">website</ulink> and in <link linkend="faq">this manual</link>.
de: Alle Tipps wurden aus der Liste „Häufig gestellter Fragen“ (FAQ) erstellt, in der Sie ausführliche Hilfen finden. Diese FAQ finden Sie auf der <ulink url="http://www.kmymoney.org/faq.php">Webseite</ulink> und in <link linkend="faq">diesem Handbuch</link>.

source: Please click on <guibutton>Close</guibutton> to close the Tip of the Day dialog.
de: Bitte klicken Sie auf <guibutton>Schließen</guibutton>, um den Dialog „Tipp des Tages“ zu beenden.

source: The main window
de: Das Hauptfenster

source: <screeninfo>The Main Window</screeninfo>
de: <screeninfo>Das Hauptfenster</screeninfo>

source: <phrase>The Main Window</phrase>
de: <phrase>Das Hauptfenster</phrase>

source: The &kappname; main window consists of four major parts
de: Das Hauptfenster von &kappname; besteht aus vier Bereichen:

source: A. The menu bar
de: A. Die Menüleiste

source: B. The toolbar
de: B. Die Werkzeugleiste

source: C. The View selector
de: C. Die Ansichtsauswahl

source: D. The view
de: D. Die Ansicht

source: The menu and toolbars provide access to the features of &kappname; and allow you to <link linkend="firsttime.3">Create</link> files or configure how &kappname; operates.
de: Über das Menü und die Werkzeugleisten können Sie die Funktionen von &kappname; erreichen und zum Beispiel Dateien <link linkend="firsttime.3">erstellen</link> oder die Arbeitsweise von &kappname; einrichten.

source: The view selector consists of at least eleven icons in the left side of the main window, depending upon the software provided by your system. More icons could be added by various plugins. By clicking on an icon, the view window on the right hand side is loaded with the appropriate view of your financial data. Each view provides a unique representation of your financial situation and allows you to view or edit the information shown.
de: In der Ansichtsauswahl an der linken Seite des Hauptfensters finden Sie mindestens elf Symbole, abhängig von den auf Ihrem System installierten Programmen. Weitere Symbole können durch zusätzliche Module hinzukommen. Klicken Sie auf ein Symbol, dann erscheint diese Ansicht Ihrer Finanzdaten im rechten Teil des Hauptfensters. Jede Ansicht zeigt Ihre finanzielle Situation in einer anderen Form an und ermöglicht das Bearbeiten den Daten.

source: The view selector contains the following icons
de: Die Ansichtsauswahl enthält folgende Symbole:

source: <guiicon> <inlinemediaobject> <imageobject> <imagedata fileref="home_view.png" format="PNG"/> </imageobject> <textobject> <phrase>Home View</phrase> </textobject> </inlinemediaobject> </guiicon> Home: A configurable overview of your current financial situation (or an introduction page when no data file is open).
de: <guiicon> <inlinemediaobject> <imageobject> <imagedata fileref="home_view.png" format="PNG"/> </imageobject> <textobject> <phrase>Übersicht</phrase> </textobject> </inlinemediaobject> </guiicon> Übersicht: Eine einstellbare Übersicht Ihrer aktuellen finanziellen Situation oder die Einführungsseite, wenn keine Datendatei geöffnet ist.

source: <guiicon> <inlinemediaobject> <imageobject> <imagedata fileref="institutions_view.png" format="PNG"/> </imageobject> <textobject> <phrase>Institutions View</phrase> </textobject> </inlinemediaobject> </guiicon> Institutions: All of your institutions and accounts displayed in a hierarchy.
de: <guiicon> <inlinemediaobject> <imageobject> <imagedata fileref="institutions_view.png" format="PNG"/> </imageobject> <textobject> <phrase>Geldinstitute</phrase> </textobject> </inlinemediaobject> </guiicon> Geldinstitute: Alle Geldinstitute und Konten werden in einer Baumansicht angezeigt.

source: <guiicon> <inlinemediaobject> <imageobject> <imagedata fileref="accounts_view.png" format="PNG"/> </imageobject> <textobject> <phrase>Accounts View</phrase> </textobject> </inlinemediaobject> </guiicon> Accounts: All of your accounts displayed in a hierarchy.
de: <guiicon> <inlinemediaobject> <imageobject> <imagedata fileref="accounts_view.png" format="PNG"/> </imageobject> <textobject> <phrase>Konten</phrase> </textobject> </inlinemediaobject> </guiicon> Konten: Alle Konten werden in einer Baumansicht angezeigt.

source: <guiicon> <inlinemediaobject> <imageobject> <imagedata fileref="schedule_view.png" format="PNG"/> </imageobject> <textobject> <phrase>Schedules View</phrase> </textobject> </inlinemediaobject> </guiicon> Schedules: Your recurring bills and deposits.
de: <guiicon> <inlinemediaobject> <imageobject> <imagedata fileref="schedule_view.png" format="PNG"/> </imageobject> <textobject> <phrase>Geplante Buchungen</phrase> </textobject> </inlinemediaobject> </guiicon> Geplante Buchungen: Ihre wiederkehrenden Rechnungen und Zahlungen.

source: <guiicon> <inlinemediaobject> <imageobject> <imagedata fileref="categories_view.png" format="PNG"/> </imageobject> <textobject> <phrase>Categories View</phrase> </textobject> </inlinemediaobject> </guiicon> Categories: Special accounts that provide a means for you to group associated transactions.
de: <guiicon> <inlinemediaobject> <imageobject> <imagedata fileref="categories_view.png" format="PNG"/> </imageobject> <textobject> <phrase>Kategorien</phrase> </textobject> </inlinemediaobject> </guiicon> Kategorien: Eine besondere Kontenart, die es Ihnen ermöglicht, zusammengehörende Buchungen in Gruppen zusammenzufassen.

source: <guiicon> <inlinemediaobject> <imageobject> <imagedata fileref="payees_view.png" format="PNG"/> </imageobject> <textobject> <phrase>Payees View</phrase> </textobject> </inlinemediaobject> </guiicon> Payees: All Payees used by &kappname;.
de: <guiicon> <inlinemediaobject> <imageobject> <imagedata fileref="payees_view.png" format="PNG"/> </imageobject> <textobject> <phrase>Empfänger</phrase> </textobject> </inlinemediaobject> </guiicon> Empfänger: Alle Zahlungsempfänger, die in &kappname; verwendet werden.

source: <guiicon> <inlinemediaobject> <imageobject> <imagedata fileref="ledgers_view.png" format="PNG"/> </imageobject> <textobject> <phrase>Ledgers View</phrase> </textobject> </inlinemediaobject> </guiicon> Ledgers: Your account transactions.
de: <guiicon> <inlinemediaobject> <imageobject> <imagedata fileref="ledgers_view.png" format="PNG"/> </imageobject> <textobject> <phrase>Kontenbuch</phrase> </textobject> </inlinemediaobject> </guiicon> Kontenbuch: Übersicht der Buchungen aller Konten.

source: <guiicon> <inlinemediaobject> <imageobject> <imagedata fileref="investments_view.png" format="PNG"/> </imageobject> <textobject> <phrase>Investments View</phrase> </textobject> </inlinemediaobject> </guiicon> Investments: Your portfolio summary.
de: <guiicon> <inlinemediaobject> <imageobject> <imagedata fileref="investments_view.png" format="PNG"/> </imageobject> <textobject> <phrase>Investitionen</phrase> </textobject> </inlinemediaobject> </guiicon> Investitionen: Eine Zusammenfassung Ihrer Anlagen.

source: <guiicon> <inlinemediaobject> <imageobject> <imagedata fileref="reports_view.png" format="PNG"/> </imageobject> <textobject> <phrase>Reports View</phrase> </textobject> </inlinemediaobject> </guiicon> Reports: A collection of useful reports, providing alternate views of your financial data.
de: <guiicon> <inlinemediaobject> <imageobject> <imagedata fileref="reports_view.png" format="PNG"/> </imageobject> <textobject> <phrase>Berichte</phrase> </textobject> </inlinemediaobject> </guiicon> Berichte: Eine Sammlung von nützlichen Berichten, die alternative Übersichten Ihrer Finanzdaten bieten.

source: <guiicon> <inlinemediaobject> <imageobject> <imagedata fileref="budgets_view.png" format="PNG"/> </imageobject> <textobject> <phrase>Budgets View</phrase> </textobject> </inlinemediaobject> </guiicon> Budgets: Your budgets
de: <guiicon> <inlinemediaobject> <imageobject> <imagedata fileref="budgets_view.png" format="PNG"/> </imageobject> <textobject> <phrase>Budgets</phrase> </textobject> </inlinemediaobject> </guiicon> Budgets: Eine Übersicht über Ihre Budgets.

source: <guiicon> <inlinemediaobject> <imageobject> <imagedata fileref="forecast_view.png" format="PNG"/> </imageobject> <textobject> <phrase>Forecast View</phrase> </textobject> </inlinemediaobject> </guiicon> Forecast: This view provides a forecast of your accounts and categories
de: <guiicon> <inlinemediaobject> <imageobject> <imagedata fileref="forecast_view.png" format="PNG"/> </imageobject> <textobject> <phrase>Vorhersage</phrase> </textobject> </inlinemediaobject> </guiicon> Vorhersage: Diese Ansicht zeigt eine Vorhersage Ihrer Konten und Kategorien.

source: <guiicon> <inlinemediaobject> <imageobject> <imagedata fileref="outbox_view.png" format="PNG"/> </imageobject> <textobject> <phrase>Outbox View</phrase> </textobject> </inlinemediaobject> </guiicon> Outbox: Used by the online banking module to provide feedback on running processes. This is a view provided by the KBanking plugin and may not be present on your system.
de: <guiicon> <inlinemediaobject> <imageobject> <imagedata fileref="outbox_view.png" format="PNG"/> </imageobject> <textobject> <phrase>Ausgang</phrase> </textobject> </inlinemediaobject> </guiicon> Ausgang: In dieser Ansicht werden die laufenden Prozesse des Online-Bankingmoduls angezeigt. Diese Ansicht liefert das KBanking-Modul. Ist es auf Ihrem System nicht installiert, fehlt diese Ansicht.

source: Creating a new file
de: Erstellen einer neuen Datei

source: &kappname; keeps all the data about your finances in a file. As was stated in <link linkend="makingmostof.basicaccounting.personalaccounts">Defining the accounts (personal records)</link>, you can keep more than one set of accounts, but the data for each will be kept in a separate file, and &kappname; can only have one file open at a time. See the chapter on <link linkend="details.formats">File Formats</link> for more details about &kappname;'s data files.
de: &kappname; speichert alle Finanzdaten in einer Datei. Wie bereits im Kapitel <link linkend="makingmostof.basicaccounting.personalaccounts">Definition der Konten (private Nutzung)</link> erläutert, können Sie mehr als eine Gruppe von Konten verwenden, aber die Daten jeder einzelnen Gruppe werden in getrennten Dateien gespeichert und in &kappname; kann nur eine Datei geöffnet sein. Weitere Informationen über die &kappname;-Dateien finden Sie im Kapitel <link linkend="details.formats">Dateiformate</link>.

source: To create a new file you can either select <menuchoice><guimenu>File</guimenu><guimenuitem>New</guimenuitem></menuchoice> from the menu or choose the <inlinemediaobject><imageobject><imagedata fileref="new.png"/></imageobject><textobject><phrase>New</phrase></textobject></inlinemediaobject> icon from the toolbar.
de: Um eine neue Datei zu erstellen, wählen Sie entweder <menuchoice><guimenu>Datei</guimenu><guimenuitem>Neu</guimenuitem></menuchoice> aus dem Menü oder das Symbol <inlinemediaobject><imageobject><imagedata fileref="new.png"/></imageobject><textobject><phrase>Neu</phrase></textobject></inlinemediaobject> aus der Werkzeugleiste.

source: &kappname; will then open the <quote>New File Setup Wizard</quote> which will guide you through the process of creating the file.
de: &kappname; öffnet dann den <quote>Assistenten zur Erstellung einer neuen Datei</quote>, der Sie bei dieser Aufgabe unterstützt.

source: <screeninfo>Personal Data Page</screeninfo>
de: <screeninfo>Die Seite „Persönliche Daten“</screeninfo>

source: <phrase>Personal Data Page</phrase>
de: <phrase>Die Seite „Persönliche Daten“</phrase>

source: Since all fields are optional, you can use &kappname; without entering any information now. Any information entered here is used only to personalize your file. In the future, it may be used in some reports and for online banking. If &kappname; requires any personal information in future releases and finds none, you will be prompted to enter the relevant data then.
de: Alle Einträge auf dieser Seite sind nicht zwingend erforderlich, Sie können &kappname; auch ohne diese persönlichen Daten benutzen. Alle hier eingegebenen Informationen werden zur individuellen Anpassung Ihrer Daten benutzt. In weiteren Versionen können diese Daten für Berichte und das Online-Banking gebraucht werden. Sind in zukünftigen Versionen von &kappname; persönliche Daten für einige Funktionen erforderlich, aber noch nicht eingegeben, dann werden diese Daten abgefragt.

source: Please enter your name and address or nothing and press <guibutton>Next</guibutton>.
de: Bitte geben Sie Ihren Namen und die Adresse ein, oder lassen alle Felder leer und drücken den Knopf <guibutton>Weiter</guibutton>.

source: In case you have an address for yourself stored in the &kaddressbook;, the button <guibutton>Load from Addressbook</guibutton> is enabled and pressing it imports all information into &kappname;.
de: Haben Sie Ihre Adresse in &kaddressbook; eingegeben, dann ist der Knopf <guibutton>Aus dem Adressbuch laden</guibutton> aktiviert, klicken Sie darauf, um alle Daten in &kappname; einzufügen.

source: &kappname; supports multiple currencies. To set your base currency (the currency you use day to day and which will be used for your reports), select the appropriate entry from the list provided and press <guibutton>Next</guibutton>. A default will be selected from &kappname; based upon your locale settings.
de: In &kappname; können Sie mehrere Währungen verwenden. Um die Basiswährung einzustellen, die Sie am häufigsten verwenden und die für Berichte benutzt wird, wählen Sie den passenden Eintrag aus der Liste und drücken dann auf <guibutton>Weiter</guibutton>. Als Voreinstellung ist die in den &systemsettings; gewählte Währung vorgegeben.

source: Base currency selection Page
de: Auswahl der Basiswährung

source: Base currency selection page
de: Auswahl der Basiswährung

source: The following page allows you to create an initial account. For the typical &kappname; user this is a checking account.
de: Auf der nächsten Seite können Sie ein erstes Konto erstellen. Für den normalen Benutzer von &kappname; ist das ein Girokonto.

source: Checking account creation Page
de: Erstellung des Girokontos

source: Checking account creation page
de: Erstellung des Girokontos

source: Enter the name of the account and a possible reference number assigned by the institution managing the account. Enter the opening date of the account and the opening balance of the account. For example, you want to use &kappname; to manage all your finances as of 2008-01-01, then enter the balance of the account at the beginning of this date. The number can possibly be obtained from a paper statement. Also enter the name and routing number of the institution, though this information is optional and only required for online banking purposes.
de: Geben Sie den Namen des Kontos und möglicherweise eine Kontonummer an, die von der Bank, die diese Konto verwaltet, zugewiesen wurde. Tragen Sie das Eröffnungsdatum und das Eröffnungssaldo des Kontos ein. Möchten Sie zum Beispiel mit &kappname; alle Finanzen ab dem 01.01.2011 verwalten, tragen Sie den Eröffnungssaldo am Beginn dieses Tages ein. Den Wert finden Sie möglicherweise auf einem Kontoauszug. Geben Sie noch den Namen und die Bankleitzahl der Bank an. Die Bankleitzahl ist nicht erforderlich und nur für das Online-Banking nötig.

source: In case you don't want to setup an initial account, please uncheck the check box
de: Möchten Sie zu Anfang kein Girokonto einrichten, deaktivieren Sie das Ankreuzfeld <guilabel>Ich habe ein Girokonto, das ich mit KMyMoney verwalten möchte</guilabel>.

source: Once finished, press <guibutton>Next</guibutton> to proceed.
de: Haben Sie alle Daten eingegeben, klicken Sie auf <guibutton>Weiter</guibutton>.

source: Account template selection Page
de: Die Seite Auswahl einer Kontovorlage

source: Account template selection page
de: Die Seite Auswahl einer Kontovorlage

source: Choose the appropriate country and account template(s). Multiple templates, even from multiple countries can be selected using a combination of &Ctrl; and &Shift; together with the left mouse button. The account hierarchy to be setup will be shown in a preview part of the wizard. In case you cannot find a template that suits your needs, don't select a template.
de: Wählen Sie ein passendes Land und eine oder mehrere Kontenvorlagen. Mehrere Vorlagen aus verschiedenen Ländern können Sie mit der &Ctrl;- und &Shift;taste zusammen mit der Maus auswählen. Die eingestellte Kontenhierarchie wird als Vorschau angezeigt. Finden Sie keine passende Vorlage, gehen Sie weiter zur nächsten Seite.

source: Once finished with the template selection press <guibutton>Next</guibutton> to proceed.
de: Haben Sie eine Kontenvorlage ausgewählt, drücken Sie auf <guibutton>Weiter</guibutton>.

source: The next page of the wizard allows you to setup user preferences. Press <guibutton>Next</guibutton> if you are done and want to proceed.
de: Auf der nächsten Seite des Assistenten können Sie Ihre benutzerdefinierten Präferenzen setzen. Drücken Sie auf <guibutton>Weiter</guibutton>, um zur nächsten Seite zu kommen.

source: Preference Page
de: Die Seite Präferenzen

source: Preference page
de: Die Seite Präferenzen

source: The last page of the wizard allows you to select the filename that will be used to store your financial data. An initial filename will be constructed out of your HOME folder and user name. In case the file exists, a warning will be displayed which reminds you to select a name of a non-existing file.
de: Auf der letzten Seite des Assistenten können Sie den Dateinamen für die Speicherung Ihrer Finanzdaten auswählen. Als Voreinstellung wird Ihr persönlicher Ordner und Benutzername vorgeschlagen. Ist diese Datei bereits vorhanden, werden Sie darauf hingewiesen und Sie müssen einen anderen Namen oder Ordner wählen.

source: Filename selection Page
de: Auswahl des Dateinamens

source: Filename selection page
de: Auswahl des Dateinamens

source: Now you have entered all relevant information to create the file. Press <guibutton>Finish</guibutton> and &kappname; will create the file for you and open it.
de: Jetzt sind alle notwendigen Daten zur Erstellung der Datei eingegeben. Klicken Sie auf <guibutton>Fertigstellen</guibutton> und &kappname; erzeugt die Datei und öffnet sie.

source: Creating accounts
de: Konten erstellen

source: You can create an account in one of two ways, both of which are described here:
de: Es gibt zwei Möglichkeiten, um ein Konto zu erstellen, beide werden im Folgenden beschrieben:

source: Using the menu
de: Verwendung des Menüs

source: To create an account using the menu select <menuchoice><guimenu>Accounts</guimenu><guimenuitem>New account</guimenuitem></menuchoice>.
de: Wählen Sie dazu im Menü <menuchoice><guimenu>Konten</guimenu><guimenuitem>Neues Konto</guimenuitem></menuchoice>.

source: Using the Accounts view
de: Die Kontenansicht benutzen

source: To create an account using the accounts view click on the Accounts icon <guiicon><inlinemediaobject><imageobject><imagedata fileref="accounts_view.png"/></imageobject></inlinemediaobject></guiicon> in the view selector and then right click on the Asset tree icon in the right hand view and select <guimenuitem>New account</guimenuitem> from the popup menu. The Asset tree holds all of your accounts that are an asset. Assets, and all the other account types, are discussed in more detail later in this manual.
de: Sie können zum Anlegen eines neuen Kontos auch auf das Symbol <guiicon><inlinemediaobject><imageobject><imagedata fileref="accounts_view.png"/></imageobject></inlinemediaobject></guiicon> „Konten“ auf der linken Seite des &kappname;-Fensters klicken und dann mit der rechten Maustaste auf das Anlagen-Symbol klicken. Im Kontextmenü wählen Sie <guimenuitem>Neues Konto</guimenuitem>. Der Zweig „Anlagen“ beinhaltet alle Ihre Konten, die Ihr Vermögen darstellen. Anlagen und alle anderen Kontentypen werden im Verlauf des Handbuches detaillierter erklärt.

source: Note that &kappname; uses the context menus a lot throughout the whole application. If you find yourself stuck trying to figure out how to do something, try right-clicking where you would expect to see a feature.
de: In &kappname; wird das Kontextmenü überall sehr oft verwendet. Kommen Sie an einer Stelle nicht weiter, klicken Sie mit der &RMBn; auf einen Bereich, in dem Sie Funktionen erwarten.

source: Creating a new account by either method opens the <emphasis>New Account Wizard</emphasis>. This wizard will take you step by step through the process of creating an account, gathering the required information at each step. To navigate through the pages click on the <guibutton>Back</guibutton> and <guibutton>Next</guibutton> buttons.
de: Jede dieser Methoden startet den <emphasis>Assistenten für ein neues Konto</emphasis>. In diesem Dialog werden Sie durch alle notwendigen Schritte für ein neues Konto geführt, dabei werden alle erforderlichen Informationen abgefragt. Um zwischen den Seiten zu wechseln, klicken Sie auf <guibutton>Zurück</guibutton> oder <guibutton>Weiter</guibutton>.

source: Create an account using either of the two previously mentioned methods to continue. A full description of creating accounts can be found in the <link linkend="details.accounts">Accounts</link> section.
de: Erstellen Sie ein Konto mit einer der vorher genannten Methoden, um weiterzumachen. Eine vollständige Beschreibung zur Erstellung von Konten finden Sie im Abschnitt <link linkend="details.accounts">Konten</link>.
