Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/extragear-office/kmymoney_installation.po
Languages: de

source: This appendix primarily addresses the installation of &kappname; under the &Linux; operating system. The <link linkend="installation.nonlinux">final section</link> addresses other operating systems.
de: In diesem Anhang wird vor allem die Installation von &kappname; unter dem &Linux;-Betriebssystem erläutert. Im <link linkend="installation.nonlinux">letzten Abschnitt</link> finden Sie Hinweise für andere Betriebssysteme.

source: How to obtain &kappname;
de: Bezugsquellen von &kappname;

source: The rest of this section will describe installing &kappname; using the standard software installation process for your Linux distribution. The following section will discuss compiling from source.
de: In diesem Abschnitt wird im folgenden die Installation von &kappname; mit den Paketverwaltungsprogrammen Ihrer Linux-Distribution erläutert. Im nächsten Abschnitt finden Sie Informationen zum Kompilieren des Quelltextes.

source: Official Distribution Packages
de: Offizielle Distributions-Pakete

source: The best way to install &kappname; is to use the package manager of your distribution, such as apt-get, yum, portage, or pacman. This will take care of all the dependencies and required libraries. Although it takes some time after the release a new version of &kappname; for all the distributions to add it to their official repositories, please check there first.
de: Am einfachsten installieren Sie &kappname; mit dem Paketverwaltungsprogramm Ihrer Distribution wie zum Beispiel „apt-get“, „ yum“, „portage“, oder „pacman“. Diese Programme berücksichtigen alle Abhängigkeiten und erforderlichen Bibliotheken. Nutzen Sie zuerst diese Installation, auch wenn es manchmal nach der Veröffentlichung einer neuen Version von &kappname; einige Zeit dauert, bis die Distributionen diese Version den offiziellen Archiven hinzugefügt haben.

source: Unsupported Repositories
de: Nicht unterstützte Paketquellen

source: Many Linux distributions have users who provide unsupported repositories that offer more up-to-date packages than the distributions' official repositories. A list of these may be found at the <ulink url="http://www.kmymoney.org">&kappname; home page</ulink>.
de: Für viele Linux-Distributionen stellen Benutzer inoffizielle Archive bereit, die aktuellere Pakete als die offiziellen Archive der Distributionen enthalten. Eine Liste dieser inoffiziellen Archive finden Sie auf der <ulink url="http://www.kmymoney.org">&kappname;-Webseite</ulink>.

source: Compiling &kappname; from Source
de: &kappname; aus dem Quelltext installieren

source: More up-to-date information on the latest available version and any known installation issues will be available on the <ulink url="http://www.kmymoney.org">&kappname; home page</ulink>. That page will also have links to tarballs of recent versions as well as instructions for obtaining the source from &kde; Git, in case you want to compile the latest, development version.
de: Aktuellere Informationen über die neuesten verfügbaren Versionen und alle bekannten Probleme bei der Installation finden Sie auf der <ulink url="http://www.kmymoney.org">&kappname;-Webseite</ulink>. Diese Seite enthält auch Verknüpfungen zu komprimierten Quelltextarchiven der neuesten Versionen und Anleitungen zum Abrufen der Quelltexte aus dem Git-Archiv, falls Sie die aktuelle Entwicklerversion kompilieren möchten.

source: As the previous paragraph implied, there are two distinct reasons to compile &kappname; from source. If you cannot find a version specifically packaged for your distribution, please download the tarball of the most recent stable release. This is version 4.6.0 as of the time this is being written. This is the compile option recommended for normal users.
de: Aus dem vorherigen Absatz können Sie entnahmen, dass es zwei verschiedene Gründe dafür gibt, &kappname; aus dem Quelltext zu kompilieren. Wenn Ihre Distribution kein Paket für &kappname; enthält, laden Sie bitte das komprimierte Quelltextarchiv der neuesten stabilen Version herunter. Zu Zeit ist das die Version 4.6.0. Dies wird für alle Benutzer empfohlen, die &kappname; in einer stabilen Version für den normalen Gebrauch benötigen.

source: On the other hand, if you want to see the current state of development, to check out a recent bug fix or new feature, you can download a tarball which is a snapshot of the development repository. You can also check the source directly out of the repository. The version 4.x source is in &kde; Git. (The version 1.0.x source was in SourceForge cvs, but it is no longer being developed or supported at all.) Instructions for access are on the project home page.
de: Möchten Sie aber den aktuellen Stand der Entwicklung ausprobieren oder testen, ob ein Fehler behoben wurde oder eine neue Funktion richtig arbeitet, dann können Sie ein komprimiertes Quelltextarchiv mit einem bestimmten Stand der Entwicklung herunterladen. Sie können den Quelltext auch direkt aus dem Git-Archiv herunterladen. Den Quelltext ab Version 4.x finden im &kde;-Git-Archiv. Der Quelltext der Version 1.0.x befand im CSV-Archiv auf SourceForge, wird aber nicht weiter entwickelt und nicht unterstützt. Anleitungen für den Zugriff auf die Archive finden Sie auf der Webseite des Projekts.

source: The code in the Git repository and in development snapshots is under active development: it may have bugs, it may crash, and it may mess up or lose data. If you use it, be absolutely sure to make adequate backups. Unless you have a good reason to use this, stick to a stable released version.
de: Der Quelltext im Git-Archiv und in den Quelltextarchiven von Entwicklungsversionen wird ständig verändert: Er kann Fehler enthalten, das Programm kann abstürzen und möglicherweise werden Daten nicht richtig verarbeitet oder nicht richtig gespeichert. Wenn Sie diese Versionen benutzen möchten, sollten Sie auf jeden Fall Ihre Daten häufig sichern. Arbeiten Sie mit stabilen Versionen, solange Sie nicht besondere Gründe für die Verwendung von Entwicklungsversionen haben.

source: Required libraries
de: Erforderliche Bibliotheken

source: &kappname; depends on certain libraries in order to compile and run properly. First is KDE version 4.3.5 or later, specifically kdelibs and kdepimlibs. Depending on your distribution, you may need to explicitly load the <quote>-devel</quote> versions in order to compile &kappname;, rather than just running a pre-compiled version. As of version 4.6.0, &kappname; also depends on libalkimia, version 4.3.1 or higher. Additional requirements may be detected during the <quote>cmake</quote> step below.
de: &kappname; braucht einige Bibliotheken, um kompiliert und ausgeführt werden zu können. Als erstes KDE in Version 4.3.5 oder neuer, daraus insbesondere die Module kdelibs und kdepimlibs. Von Ihrer Distribution müssen Sie wahrscheinlich ausdrücklich sie Entwicklungspakete (<quote>-devel</quote> oder <quote>-dev</quote>) dieser Bibliotheken installieren, um &kappname; kompilieren zu können. Ab Version 4.6.0 benötigt &kappname; außerdem die Bibliothek libalkimia mindestens in Version 4.3.1. Weiter nötige Bibliotheken werden möglicherweise erst beim Ausführen des Befehls <quote>cmake</quote> festgestellt.

source: Additional functionality can be obtained if extra libraries are available at compile time. The two most common are
de: Zusätzliche Funktionen sind verfügbar, wenn weitere Bibliotheken beim Kompilieren vorhanden sind. Die beiden wichtigsten sind:

source: libofx, version 0.9.4 or higher, to be able to import financial data in the OFX format, and
de: libofx, Version mindestens 0.9.4 für den Import von Daten im OFX-Format und

source: AqBanking, version 5.0.0 or higher, to be able to use certain on-line banking features. Note that version 5.0.14 or higher is strongly recommended, due to bugs in earlier versions.
de: AqBanking in Version 5.0.0 oder neuer,damit können bestimmte Funktionen des Online-Banking genutzt werden. Sie sollten unbedingt mindestens Version 5.0.14 benutzen, da alle älteren Funktionen Fehler hatten.

source: Build instructions
de: Anleitung zum Kompilieren

source: &kappname; uses the cmake build system. Further information can be found in the README.cmake file in the root folder of the source. The basic steps are the following:
de: &kappname; benutzt das CMake-System. Weitere Informationen finden Sie in der Datei README.cmake im obersten Ordner des Quelltextes. Folgende Schritte sind auszuführen:

source: Note that the last step is required. &kappname; expects to find certain components in standard locations, and if you run it from within the build directory without the install step, you will have missing icons or other surprises.
de: Der letzte Befehl muss unbedingt ausgeführt werden. &kappname; sucht nach bestimmten Komponenten in Standardordnern. Starten Sie &kappname; vom Erstellungsordner („build“) ohne diesen Installationsschritt, werden Sie mit fehlenden Symbolen und anderen Überraschungen konfrontiert.

source: If you have compiled the source from git, and want to update to the latest revision, most of the time you can do the following:
de: Haben Sie das Programm aus dem Quelltext im Git-Archiv kompiliert und möchten zur neuesten Revision aktualisieren, sollten Sie folgenden Befehl eingeben:

source: $ cd &lt;path to root of source&gt;
de: $ cd &lt;pfad zum Basisordner des Quelltextes&gt;

source: However, changes made by the developers sometimes cause compile problems if you do not start with a clean code base. In these cases, you need to do the following:
de: Manchmal lässt sich das Programm auf Grund von Änderungen der Entwickler nicht mehr ohne Probleme kompilieren, wenn Sie nicht mit einem bereinigten Quelltext starten. In diesen Fällen sollten Sie folgenden Befehl ausführen:

source: Installing &kappname; without Linux
de: &kappname; ohne Linux installieren

source: &kappname; has been successfully compiled for &MacOS; X, and is available at the <ulink url="http://www.macports.com">MacPorts web site</ulink>.
de: &kappname; wurde erfolgreich für &MacOS; X kompiliert und kann von der <ulink url="http://www.macports.com">MacPorts-Webseite</ulink> heruntergeladen werden.

source: If you know of &kappname; being successfully compiled and made available for any other operating system, please let us know, so we can spread the word.
de: Ist Ihnen bekannt, dass &kappname; auf weiteren Betriebssystemen erfolgreich kompiliert wurde und verfügbar ist, teilen Sie uns das bitte mit, damit diese Information verbreitet werden kann.
