Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/extragear-office/kmymoney_man-kmymoney.1.po
Languages: de

source: <firstname>Michael</firstname><othername>T.</othername><surname>Edwardes</surname> <contrib>Original concept, much initial source code. Project administration</contrib> <email>mte@users.sourceforge.net</email>
de: <firstname>Michael</firstname><othername>T.</othername><surname>Edwardes</surname> <contrib>Ursprüngliche Idee, viel ursprünglicher Quellcode, Projektverwalter</contrib><email>mte@users.sourceforge.net</email>

source: <firstname>Thomas</firstname><surname>Baumgart</surname> <contrib>Release manager and de-facto Maintainer. Core engine. Project administration</contrib> <email>ipwizard@users.sourceforge.net</email>
de: <firstname>Thomas</firstname><surname>Baumgart</surname> <contrib>Release-Manager und aktueller Betreuer. Kernmodul. Projektverwalter</contrib><email>ipwizard@users.sourceforge.net</email>

source: <firstname>Tony</firstname><surname>Bloomfield</surname> <contrib>GnuCash Importer. Database support.</contrib> <email>tonybloom@users.sourceforge.net</email>
de: <firstname>Tony</firstname><surname>Bloomfield</surname><contrib>GnuCash-Import. Datenbank-Unterstützung</contrib><email>tonybloom@users.sourceforge.net</email>

source: <firstname>Robert</firstname><surname>Wadley</surname> <contrib>Artist. Icons, splash screen, home view. Screenshots.</contrib> <email>robntina@users.sourceforge.net</email>
de: <firstname>Robert</firstname><surname>Wadley</surname> <contrib>Künstler. Symbole, Startbildschirm, Bildschirmfotos</contrib><email>robntina@users.sourceforge.net</email>

source: <firstname>Alvaro</firstname><surname>Soliverez</surname> <contrib>Forecast. Reports.</contrib> <email>asoliverez@users.sourceforge.net</email>
de: <firstname>Alvaro</firstname><surname>Soliverez</surname><contrib>Vorhersagen und Berichte</contrib><email>asoliverez@users.sourceforge.net</email>

source: <firstname>Fernando</firstname><surname>Vilas</surname> <contrib>Database support.</contrib> <email>fvilas@users.sourceforge.net</email>
de: <firstname>Fernando</firstname><surname>Vilas</surname> <contrib>Datenbankunterstützung</contrib><email>fvilas@users.sourceforge.net</email>

source: <firstname>Cristian</firstname><surname>Oneț</surname> <contrib>Patches and plugins.</contrib> <email>onet.cristian@gmail.com</email>
de: <firstname>Cristian</firstname><surname>Oneț</surname> <contrib>Fehlerberichtigungen und Module</contrib><email>onet.cristian@gmail.com</email>

source: <firstname>Jack</firstname><othername>H.</othername><surname>Ostroff</surname> <contrib>Documentation.</contrib> <email>ostroffjh@users.sourceforge.net</email>
de: <firstname>Jack</firstname><othername>H.</othername><surname>Ostroff</surname> <contrib>Dokumentation</contrib><email>ostroffjh@users.sourceforge.net</email>

source: <firstname>Felix</firstname><surname>Rodriguez</surname> <contrib>Project administration, previous versions.</contrib> <email>frodriguez@users.sourceforge.net</email>
de: <firstname>Felix</firstname><surname>Rodriguez</surname> <contrib>Projektverwalter, Mitarbeit bei den ersten Versionen</contrib><email>frodriguez@users.sourceforge.net</email>

source: <firstname>Kevin</firstname><surname>Tambascio</surname> <contrib>Initial investment support.</contrib> <email>ktambascio@users.sourceforge.net</email>
de: <firstname>Kevin</firstname><surname>Tambascio</surname> <contrib>Ursprüngliche Unterstützung für Investitionen</contrib> <email>ktambascio@users.sourceforge.net</email>

source: Executable programs
de: Ausführbare Programme

source: the personal finances manager for &kde;
de: Der persönliche Finanzmanager für &kde;

source: <command>kmymoney</command> <group><option>Generic Options</option></group> <group><option>Qt Options</option></group> <group><option>KDE Options</option></group> <group><option>Options</option></group> <group><option>File</option></group>
de: <command>kmymoney</command> <group><option>Allgemeine Optionen</option></group> <group><option>Qt-Optionen</option></group> <group><option>KDE-Optionen</option></group> <group><option>Optionen</option></group> <group><option>Datei</option></group>

source: Description
de: Beschreibung

source: &kmymoney; is the Personal Finance Manager for the &kde; environment. It provides the functions required to balance your checkbooks, manage your personal loans and categories your incomes and expenses using a checkbook style graphical user interface.
de: &kmymoney; ist die persönliche Finanzverwaltung für KDE. Das Programm bietet alle nötigen Funktionen, um Ihre Scheckhefte abzugleichen, Ihre persönlichen Kredite und Ihre Ein und Ausgaben zu verwalten. Dazu stellt das Programm eine grafische Oberfläche im Stil eines Scheckhefts zu Verfügung.

source: Options
de: Optionen

source: File
de: Datei

source: file to open
de: Zu öffnende Datei

source: Start without opening a file
de: Startet das Programm ohne eine Datei zu öffnen.

source: Enable performance timers
de: Performance-Timer erlauben

source: Do not globally catch uncaught exceptions
de: Unbehandelte Ausnahmen nicht global abfangen

source: Turn on program traces. This option is only available when &kmymoney; is compiled in debug mode.
de: Programm-Ablaufverfolgung einschalten. Diese Option ist nur verfügbar, wenn &kmymoney; im Debug-Modus kompiliert wurde.

source: Dump the names of all defined KAction objects to stdout and quit. This option is only available when &kmymoney; is compiled in debug mode.
de: Die Namen aller definierten KAction-Objekte auf der Standardausgabe (stdout) ausgeben und beenden. Diese Option ist nur verfügbar, wenn &kmymoney; im Debug-Modus kompiliert wurde.

source: Show help about options
de: Hilfe zu verfügbaren Optionen anzeigen

source: Show Qt specific options
de: Spezielle Optionen für Qt anzeigen

source: Show KDE specific options
de: Spezielle Optionen für KDE anzeigen

source: Show all options
de: Alle Optionen anzeigen

source: Show author information
de: Autoren-Information anzeigen

source: Show version information
de: Versionsinformation anzeigen

source: Show license information
de: Lizenz-Informationen anzeigen

source: Environment
de: Umgebungsvariablen

source: Language locale setting to use. This option makes it possible to set another language environment for a program than what is the default. The correct language pack for this language has to be installed for this option to work. The default language when there is none set is en_US. When deciding upon a language, the following resources are looked up, in order: <envar>KDE_LANG</envar>, configuration file, <envar>LC_CTYPE</envar>, <envar>LC_MESSAGES</envar>, <envar>LC_ALL</envar>, <envar>LANG</envar>.
de: Die zu verwendenden Spracheinstellungen. Damit ist es möglich, für das Programm eine andere Spracheinstellung als in Ihrer normalen Arbeitsumgebung zu benutzen. Damit diese Einstellung korrekt funktioniert, muss das zugehörige Sprachpaket installiert sein. Als Standard wird amerikanisches Englisch (en_US) benutzt, falls es keine Spracheinstellung gibt. Für die Auswahl der Sprache werden folgende Ressourcen in dieser Reihenfolge abgesucht: <envar>KDE_LANG</envar>, Einrichtungsdatei, <envar>LC_CTYPE</envar>, <envar>LC_MESSAGES</envar>, <envar>LC_ALL</envar>, <envar>LANG</envar>.

source: Assume that all filenames are in UTF-8 format regardless of the current language setting. Otherwise the filename format is defined by the language.
de: Mit dieser Einstellung werden alle Dateinamen im Format UTF-8 unabhängig von der aktuell eingestellten Sprache angenommen. Ansonsten wird das Format der Dateinamen durch die eingestellte Sprache festgelegt.

source: If this variable has the value true multihead multiple display mode is enabled. The KDE display will be shared over more than one screen.
de: Hat diese Variable den Wert „true“, dann wird ein Modus zur Verwendung von mehreren Bildschirmen benutzt. Die Anzeige wird dann auf die Bildschirme verteilt.

source: Specifies the X display to run KDE on.
de: Gibt das X-Display an, auf dem KDE läuft.

source: The session manager to use. This option is set automatically by KDE and is a network path to the session manager socket.
de: Die verwendete Sitzungsverwaltung (Session Manager). Diese Einstellung wird automatisch durch das KDE-System gesetzt und ist der Netzwerkpfad zum Socket der Sitzungsverwaltung.

source: Path to the home directory for the current user.
de: Pfad zum persönlichen Ordner des aktuellen Benutzers.

source: The KDE per-user setting directory.
de: Der KDE-Ordner für die Einstellungen des Benutzers.

source: See Also
de: Siehe auch

source: The full documentation for &kmymoney; is maintained as a docbook manual. If the &khelpcenter; program is properly installed at your site, the command <userinput><command>khelpcenter</command> <parameter>help:/kmymoney</parameter></userinput> should give you access to the complete manual. Alternatively the manual can be browsed in &konqueror; giving it the <acronym>URL</acronym> <ulink url="help:/kmymoney">help:/kmymoney</ulink>
de: Die vollständige Dokumentation für &kmymoney; wird als Handbuch im Docbook-Format betreut. Wenn das Programm installiert ist, zeigt der Befehl <userinput><command>khelpcenter</command> <parameter>help:/kmymoney</parameter></userinput> das vollständige Handbuch an. Alternativ können Sie in der Adressleiste von &konqueror; <acronym>URL</acronym> <ulink url="help:/kmymoney">help:/kmymoney</ulink> eingeben.
