Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/extragear-office/kmymoney_details-categories.po
Languages: de

source: Categories
de: Kategorien

source: The Categories screen provides a summary of all the existing categories under which transactions are filed. The categories are split into income and expense, and a balance is displayed for each category.
de: Die Kategorienansicht gibt eine Übersicht über alle existierenden Kategorien, die den Buchungen zugeordnet wurden. Die Kategorien sind aufgeteilt in Einnahmen und Ausgaben. Hinter jeder Kategorie wird der zugehörige Kontostand angezeigt.

source: Creating a category
de: Eine Kategorie erstellen

source: To create a new category, either select <menuchoice><guimenu>Category</guimenu> <guimenuitem>New category</guimenuitem></menuchoice> in the menu, or in the Categories view, select a parent in the tree, right click and select the <guimenuitem>New Category</guimenuitem> option. Either way will open the Create new categories wizard. Enter the new category name, and select the currency if the default shown is not correct. In the Hierarchy tab, ensure the required parent account is selected. Finally, in the Tax tab, there is a check box to enable VAT support, and a check box to include this category in certain tax related reports.
de: Um eine neue Kategorie zu erstellen, wählen Sie entweder <menuchoice><guimenu>Kategorie</guimenu> <guimenuitem>Neue Kategorie</guimenuitem></menuchoice> im Menü, oder wählen Sie in den Kategorienansicht eine übergeordnete Kategorie und klicken Sie auf diese mit der rechten Maustaste. Wählen Sie dann die Option <guimenuitem>Neue Kategorie</guimenuitem>. Es öffnet sich ein Assistent zum Erstellen einer neuen Kategorie. Geben Sie den Namen der neuen Kategorie ein und wählen Sie eine andere Währung aus, wenn die Voreinstellung nicht zutrifft. Stellen Sie sicher, dass im Unterfenster "Hierarchie" die richtige übergeordnete Kategorie ausgewählt ist. Im Unterfenster "Steuer" können Sie schließlich noch die Mehrwertsteuer-Unterstützung aktivieren, sowie auswählen, ob diese Kategorie in Steuerberichten erscheinen soll.

source: Enter the category name any notes and click on <guibutton>OK</guibutton> to save the new category. To create a complete hierarchy of accounts, separate the names by colons (:) as in <emphasis>Bills:Car:Gasoline</emphasis>.
de: Geben Sie den Kategorienamen und bei Bedarf Ihre Notizen ein. Anschließend klicken Sie auf <guibutton>OK</guibutton> um die neue Kategorie zu speichern. Um eine ganze Konten-Hierarchie zu erstellen, trennen Sie die Unterkategorien durch Doppelpunkte (:), wie zum Beispiel in <emphasis>Rechnungen:Auto:Benzin</emphasis>.

source: Editing a Category
de: Eine Kategorie bearbeiten

source: To edit a category, right-click on a category name, and choose <guimenuitem>Edit category</guimenuitem>. A window comes up with three tabs: General, Hierarchy and Tax.
de: Um eine Kategorie zu bearbeiten klicken Sie mit der rechten Maustaste auf den Kategorienamen und wählen <guimenuitem>Kategorie bearbeiten</guimenuitem> aus dem erscheinenden Menü. Es erscheint ein Fenster mit drei Karteikarten: Allgemein, Hierarchie und Steuer.

source: The General tab allows you to edit the name of the category and any notes you entered when you created the category.
de: Das Karteikarte "Allgemein" erlaubt es Ihnen, den Namen der Kategorie und Ihre Notizen zu bearbeiten, die Sie beim Anlegen eingegeben haben.

source: The Tax tab allows you to assign or change VAT category, or alter the automatic VAT assignment. It also allows you to toggle whether or not the category is included in certain tax related reports.
de: Die Karteikarte „Steuer“ erlaubt das Zuweisen oder Ändern der Mehrwertsteuerkategorie oder das Verändern der automatischen Mehrwertsteuerzuordnung. Weiterhin können Sie auswählen, ob die Kategorie in Steuerberichten erscheint oder nicht.

source: VAT Support
de: Mehrwertsteuer-Unterstützung

source: You can turn an expense/income category into a VAT category, which means that it receives all the splits that actually make up the VAT payment towards the government. You can also enter a specific percentage rate.
de: Sie können eine Einnahmen-/Ausgaben-Kategorie in eine Mehrwertsteuerkategorie verwandeln, was dazu führt, dass alle Splitt-Buchungen auf diese Kategorie gebucht werden, um die Mehrwertsteuer-Zahlungen an das Finanzamt zu sammeln. Sie können weiterhin einen Mehrwertsteuersatz hinterlegen.

source: Categories can be assigned a VAT category, which allows &kappname; to split a transaction for a category into two parts, one for the category and one for the VAT. Depending on the setting of the gross/net amount switch, the amount you enter for the transaction is the gross or net amount.
de: Kategorien können einer Mehrwertsteuerkategorie zugeordnet werden, sodass &kappname; eine Buchung in zwei Buchungen splittet: eine für die Kategorie und eine für die Mehrwertsteuer. Abhängig von der Brutto/Netto-Einstellung im Unterfenster "Steuer" ist der eingegebene Betrag der Buchung ein Brutto- oder Nettobetrag.

source: Example: In Germany, there are three VAT percentages (0%, 7%, and 19%). So I have a main category "VAT paid" and three subcategories, one for each percentage rate. I create these on both the income and the expense sides so that I have eight categories in total. For the goods I buy, I select one of the above mentioned categories as the "VAT category assignment".
de: Beispiel: In Deutschland gibt es drei Mehrwertsteuersätze (0 %, 7 % und 19 %). Dann wird eine Hauptkategorie „Gezahlte MwSt.“ und drei Unterkategorien, jeweils eine für jeden Mehrwertsteuersatz, angelegt, sowohl für die Einnahmen- als auch die Ausgabenseite, sodass insgesamt acht Kategorien entstehen. Für die gekauften Waren wird eine der oben genannten Kategorien als „automatische MwSt. Zuweisung“ ausgewählt.

source: When I buy goods, I enter them into a transaction. Let's assume I have selected the gross amount entry method, once I enter the category and amount, &kappname; will recognize that there's a VAT assignment and calculate the VAT part, create a second split with the VAT account and VAT amount and reduce the category amount.
de: Werden Waren gekauft, wird dies in eine Buchung eingegeben. Angenommen, die Eingabe von Bruttobeträgen ist ausgewählt. Sobald die Kategorie gewählt und der Betrag eingegeben wurde, wird &kappname; feststellen, dass die Kategorie eine automatische MwSt.-Zuweisung besitzt. &kappname; wird nun den Mehrwertsteuerbetrag berechnen, eine Split-Buchung für das angegebene MwSt.-Konto erzeugen und den errechneten Mehrwertsteuerbetrag zuweisen. Anschließend wird der um die MwSt. reduzierte Restbetrag der eigentlichen Kategorie als Split-Buchung zugeordnet.

source: The same applies to income categories but the other way around. Hope that makes sense.
de: Das gleiche geschieht ebenfalls für Einnahmen-Kategorien in umgekehrter Weise.

source: Deleting a category
de: Eine Kategorie löschen

source: To delete a category, select it in the tree, right click to bring up the popup menu, and select <guimenuitem>Delete</guimenuitem>. If there are any transactions assigned to this category, a popup will allow you to move these to another parent category. If you try to delete a parent category, a dialog allows the choice of either having the sub-categories moved up one level or alternatively having them all deleted at the same time.
de: Um eine Kategorie zu löschen, klicken Sie diese mit der rechten Maustaste an und wählen <guimenuitem>Kategorie löschen</guimenuitem> aus dem erscheinenden Menü. Wenn die Kategorie noch zugeordnete Buchungen enthält, erscheint ein Fenster, mit dessen Hilfe Sie den Buchungen eine neue übergeordnete Kategorie zuordnen können. Wenn Sie eine übergeordnete Kategorie löschen, erscheint ein Dialogfenster, in dem Sie auswählen können, ob Sie entweder alle Kategorien unterhalb der zu löschenden Kategorie eine Ebene nach oben verschieben, oder sie komplett löschen möchten.
