Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/extragear-office/kmymoney_reference.po
Languages: de

source: Reference
de: Referenz

source: Menus
de: Menüs

source: Below is a complete list of the menu selections in &kappname;, with a very brief description of what each one does. Note that many of these menu choices will be unavailable, or grayed out, depending on the current display or state of the application. For example, you are not able to edit an account unless you have an account selected or displayed in the current view.
de: Im Folgenden finden Sie eine vollständige Aufstellung aller Menüeinträge von &kappname; mit einer kurzen Beschreibung ihrer Funktion. Abhängig von der aktuellen Anzeige oder dem Status des Programms können viele Menüeinträge nicht verfügbar oder in Grau als Inaktiv angezeigt werden. Sie können zum Beispiel kein Konto bearbeiten, bevor ein Konto ausgewählt wurde oder in der aktuellen Ansicht angezeigt wird.

source: File Menu
de: Menü Datei

source: <shortcut> <keycombo>&Ctrl;<keycap>N</keycap></keycombo> </shortcut> <guimenu>File</guimenu><guimenuitem>New</guimenuitem>
de: <shortcut> <keycombo>&Ctrl;<keycap>N</keycap></keycombo> </shortcut> <guimenu>Datei</guimenu> <guimenuitem>Neu</guimenuitem>

source: Creates a new empty &kappname; data file. Only one &kappname; file can be open at once, so this will close your current file first, if one is open.
de: Erstellt eine neue leere &kappname;-Datei. Es kann immer nur eine &kappname;-Datei geöffnet sein. Daher wird eine bereits geöffnete Datei geschlossen.

source: <shortcut> <keycombo>&Ctrl;<keycap>O</keycap></keycombo> </shortcut> <guimenu>File</guimenu><guimenuitem>Open</guimenuitem>
de: <shortcut> <keycombo>&Ctrl;<keycap>O</keycap></keycombo> </shortcut> <guimenu>Datei</guimenu> <guimenuitem>Öffnen ...</guimenuitem>

source: Opens an existing &kappname; data file.
de: Öffnet eine vorhandene &kappname;-Datei.

source: <guimenu>File</guimenu> <guimenuitem>Open Recent</guimenuitem> <guimenuitem>...</guimenuitem>
de: <guimenu>Datei</guimenu> <guisubmenu>Zuletzt geöffnete Dateien</guisubmenu> <guimenuitem>...</guimenuitem>

source: Allows quick access to recently opened files.
de: Ermöglicht den schnellen Zugriff auf kürzlich geöffnete Dateien.

source: <guimenu>File</guimenu><guimenuitem>Open Database...</guimenuitem>
de: <guimenu>Datei</guimenu> <guimenuitem>Datenbank öffnen ...</guimenuitem>

source: Opens an existing database.
de: Öffnet eine vorhandene Datenbank.

source: <shortcut> <keycombo>&Ctrl;<keycap>S</keycap></keycombo> </shortcut> <guimenu>File</guimenu><guimenuitem>Save</guimenuitem>
de: <shortcut><keycombo>&Ctrl;<keycap>S</keycap></keycombo></shortcut> <guimenu>Datei</guimenu> <guimenuitem>Speichern</guimenuitem>

source: Saves the currently open file.
de: Speichert die gerade geöffnete Datei.

source: <guimenu>File</guimenu><guimenuitem>Save As...</guimenuitem>
de: <guimenu>Datei</guimenu> <guimenuitem>Speichern unter ...</guimenuitem>

source: Saves the currently open file with a different filename.
de: Speichert die gerade geöffnete Datei unter einem anderen Dateinamen.

source: <guimenu>File</guimenu><guimenuitem>Save As Database...</guimenuitem>
de: <guimenu>Datei</guimenu> <guimenuitem>Speichern in Datenbank ...</guimenuitem>

source: Saves the currently open file in a <link linkend="details.database">Database</link>.
de: Speichert die gerade geöffnete Datei in einer <link linkend="details.database">Datenbank</link>.

source: <guimenu>File</guimenu> <guimenuitem>Import</guimenuitem> <guimenuitem>...</guimenuitem>
de: <guimenu>Datei</guimenu> <guimenuitem>Importieren</guimenuitem><guimenuitem>...</guimenuitem>

source: Imports financial data from other file types, such as QIF and Gnucash, or a template file of accounts and categories that can be used in setting up new accounts.
de: Importiert Finanzdaten aus anderen Dateiformaten wie QIF und Gnucash oder eine Dateivorlage mit Konten und Kategorien, die für die Einrichtung eines neuen Kontos verwendet werden kann.

source: <guimenu>File</guimenu> <guimenuitem>Export</guimenuitem> <guimenuitem>...</guimenuitem>
de: <guimenu>Datei</guimenu> <guimenuitem>Exportieren</guimenuitem><guimenuitem>...</guimenuitem>

source: Exports the current file as a different file type, such as QIF, or exports a list of your accounts and categories as an template.
de: Exportiert die aktuelle Datei in ein anderes Format wie zum Beispiel QIF oder exportiert eine Liste Ihrer Konten und Kategorien als Vorlage.

source: <shortcut> <keycombo>&Ctrl;<keycap>P</keycap></keycombo> </shortcut> <guimenu>File</guimenu><guimenuitem>Print</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>P</keycap></keycombo></shortcut> <guimenu>Datei</guimenu><guimenuitem>Drucken ...</guimenuitem>

source: Prints the current file.
de: Druckt die aktuelle Datei.

source: <guimenu>File</guimenu><guimenuitem>Backup</guimenuitem>
de: <guimenu>Datei</guimenu><guimenuitem>Sicherung</guimenuitem>

source: Saves a backup the current file.
de: Speichert eine Sicherung der gerade geöffneten Datei.

source: <guimenu>File</guimenu><guimenuitem>Personal Data</guimenuitem>
de: <guimenu>Datei</guimenu> <guimenuitem>Persönliche Daten</guimenuitem>

source: Allows to edit personal data.
de: Ermöglicht die Bearbeitung der persönlichen Daten.

source: <guimenu>File</guimenu><guimenuitem>File information</guimenuitem>
de: <guimenu>Datei</guimenu> <guimenuitem>Datei-Information</guimenuitem>

source: Displays information about the currently open &kappname; file.
de: Zeigt Informationen über die gerade geöffnete &kappname;-Datei.

source: <shortcut> <keycombo>&Ctrl;<keycap>W</keycap></keycombo> </shortcut> <guimenu>File</guimenu><guimenuitem>Close</guimenuitem>
de: <shortcut><keycombo>&Ctrl;<keycap> W</keycap></keycombo></shortcut> <guimenu>Datei</guimenu><guimenuitem>Schließen</guimenuitem>

source: Closes the current file.
de: Schließt die aktuell geöffnete Datei.

source: <shortcut> <keycombo>&Ctrl;<keycap>Q</keycap></keycombo> </shortcut> <guimenu>File</guimenu><guimenuitem>Quit</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo> </shortcut><guimenu>Datei</guimenu><guimenuitem>Beenden</guimenuitem>

source: Quit &kappname;
de: <action>Beendet</action> &kappname;

source: Edit Menu
de: Menü Bearbeiten

source: <shortcut> <keycombo>&Ctrl;<keycap>F</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu><guimenuitem>Find transaction...</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>F</keycap></keycombo></shortcut> <guimenu>Bearbeiten</guimenu><guimenuitem>Buchung suchen ...</guimenuitem>

source: Search transactions.
de: Sucht nach Buchungen.

source: View Menu
de: Menü Ansicht

source: <shortcut> <keycombo>&Ctrl;<keycap>T</keycap></keycombo> </shortcut> <guimenu>View</guimenu> <guimenuitem>Show Transaction Detail</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>T</keycap></keycombo></shortcut> <guimenu>Ansicht</guimenu><guimenuitem>Buchungsdetails anzeigen</guimenuitem>

source: Shows transaction details in the <link linkend="details.ledgers">Ledger</link> view. With this option turned on, all lines of the transaction will be shown in the ledger. When it is turned off, only one line will be shown.
de: Zeigt die Buchungsdetails in der <link linkend="details.ledgers">Kontenbuch</link>-Ansicht. Mit dieser Einstellung werden alle Zeilen einer Buchung im Kontenbuch dargestellt. Ist diese Einstellung deaktiviert, erscheint nur eine Zeile je Buchung.

source: If you only want to see details for the currently selected transaction, but only one line for the others, you can turn on the <link linkend="details.settings.register.lens">Ledger Lens</link>.
de: Möchten Sie nur die Einzelheiten der gerade ausgewählten Buchung sehen, aber nur eine Zeile für alle anderen Buchungen, dann benutzen Sie die Einstellung <link linkend="details.settings.register.lens">Buchungsdetails der ausgewählten Buchung anzeigen</link>.

source: <shortcut> <keycombo>&Ctrl;<keycap>R</keycap></keycombo> </shortcut> <guimenu>View</guimenu> <guimenuitem>Hide reconciled transactions</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>R</keycap></keycombo></shortcut> <guimenu>Ansicht</guimenu><guimenuitem>Abgeglichene Buchungen ausblenden</guimenuitem>

source: Hides reconciled transactions on the register.
de: Blendet alle abgeglichenen Buchungen in der Ansicht aus.

source: <shortcut> <keycombo>&Ctrl;<keycap>U</keycap></keycombo> </shortcut> <guimenu>View</guimenu> <guimenuitem>Hide unused categories</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>U</keycap></keycombo></shortcut> <guimenu>Ansicht</guimenu><guimenuitem>Ungenutzte Kategorien ausblenden</guimenuitem>

source: Hides unused categories in the views.
de: Blendet ungenutzte Kategorien in den Ansichten aus.

source: <shortcut> <keycombo> &Ctrl;&Shift;<keycap>A</keycap> </keycombo> </shortcut> <guimenu>View</guimenu><guimenuitem>Show all accounts</guimenuitem>
de: <shortcut><keycombo action="simul"> &Ctrl;&Shift;<keycap>A</keycap> </keycombo></shortcut> <guimenu>Ansicht</guimenu> <guimenuitem>Alle Konten anzeigen</guimenuitem>

source: Shows all accounts in the views.
de: Zeigt alle Konten in den Ansichten.

source: Institution Menu
de: Menü Geldinstitut

source: <guimenu>Institution</guimenu> <guimenuitem>New institution...</guimenuitem>
de: <guimenu>Geldinstitut</guimenu> <guimenuitem>Neues Geldinstitut ...</guimenuitem>

source: Add a new institution.
de: Fügt ein neues Geldinstitut hinzu.

source: <guimenu>Institution</guimenu> <guimenuitem>Edit institution...</guimenuitem>
de: <guimenu>Geldinstitut</guimenu> <guimenuitem>Geldinstitut bearbeiten ...</guimenuitem>

source: Edit an institution.
de: Öffnet den Dialog zur Bearbeitung eines Geldinstituts.

source: <guimenu>Institution</guimenu> <guimenuitem>Delete institution...</guimenuitem>
de: <guimenu>Geldinstitut</guimenu> <guimenuitem>Geldinstitut löschen ...</guimenuitem>

source: Delete an institution.
de: Löscht ein Geldinstitut.

source: Account Menu
de: Menü Konto

source: <guimenu>Account</guimenu> <guimenuitem>New account...</guimenuitem>
de: <guimenu>Konto</guimenu> <guimenuitem>Neues Konto ...</guimenuitem>

source: Adds a new account.
de: Fügt ein neues Konto hinzu.

source: <guimenu>Account</guimenu><guimenuitem>Edit account...</guimenuitem>
de: <guimenu>Konto</guimenu> <guimenuitem>Konto bearbeiten ...</guimenuitem>

source: Edits an account.
de: Bearbeitet ein Konto.

source: <guimenu>Account</guimenu><guimenuitem>Delete account...</guimenuitem>
de: <guimenu>Konto</guimenu> <guimenuitem>Konto löschen ...</guimenuitem>

source: Deletes an account.
de: Löscht ein vorhandenes Konto.

source: <guimenu>Account</guimenu><guimenuitem>Open ledger</guimenuitem>
de: <guimenu>Konto</guimenu> <guimenuitem>Kontenbuch öffnen</guimenuitem>

source: Displays the ledger view of an account.
de: Zeigt die Kontenbuchansicht eines Kontos an.

source: <shortcut> <keycombo> &Ctrl;&Shift;<keycap>R</keycap> </keycombo> </shortcut> <guimenu>Account</guimenu><guimenuitem>Reconcile...</guimenuitem>
de: <shortcut><keycombo action="simul"> &Ctrl;&Shift;<keycap>R</keycap> </keycombo></shortcut> <guimenu>Konto</guimenu> <guimenuitem>Abgleichen</guimenuitem>

source: Reconciles an account through the reconciliation wizard.
de: Gleicht ein Konto mit Hilfe des Assistenten ab.

source: <guimenu>Account</guimenu><guimenuitem>Postpone reconciliation</guimenuitem>
de: <guimenu>Konto</guimenu> <guimenuitem>Abgleich zurückstellen</guimenuitem>

source: Postpones reconciliation of an account.
de: Stellt das Abgleichen eines Kontos zurück.

source: <guimenu>Account</guimenu><guimenuitem>Finish</guimenuitem>
de: <guimenu>Konto</guimenu> <guimenuitem>Fertigstellen</guimenuitem>

source: Finishes reconciliation of an account.
de: Beendet das Abgleichen eines Kontos.

source: <guimenu>Account</guimenu><guimenuitem>Transaction report</guimenuitem>
de: <guimenu>Konto</guimenu> <guimenuitem>Buchungs-Bericht</guimenuitem>

source: Opens a transaction report of an account.
de: Öffnet den Buchungsbericht des Kontos.

source: <guimenu>Account</guimenu><guimenuitem>Close account</guimenuitem>
de: <guimenu>Konto</guimenu> <guimenuitem>Konto schließen</guimenuitem>

source: Closes an account.
de: Schließt ein Konto.

source: <guimenu>Account</guimenu><guimenuitem>Reopen account</guimenuitem>
de: <guimenu>Konto</guimenu> <guimenuitem>Konto neu eröffnen</guimenuitem>

source: Reopens an account, if closed.
de: Öffnet ein vorher geschlossenes Konto wieder.

source: <guimenu>Account</guimenu><guimenuitem>Unmap account</guimenuitem>
de: <guimenu>Konto</guimenu> <guimenuitem>Kontenzuordnung löschen</guimenuitem>

source: Unmaps an online account.
de: Löscht die Zuordnung zu einem Onlinekonto.

source: <guimenu>Account</guimenu><guimenuitem>Map to online account</guimenuitem>
de: <guimenu>Konto</guimenu> <guimenuitem>Einem Onlinekonto zuordnen</guimenuitem>

source: Maps an account to an online account.
de: Weist ein Onlinekonto einem Konto zu.

source: <guimenu>Account</guimenu><guimenuitem>Update account...</guimenuitem>
de: <guimenu>Konto</guimenu> <guimenuitem>Konto aktualisieren</guimenuitem>

source: Imports transactions from online banking for an account
de: Importiert Buchungen von Online-Banking für ein Konto.

source: <guimenu>Account</guimenu> <guimenuitem>Update all accounts...</guimenuitem>
de: <guimenu>Konten</guimenu> <guimenuitem>Alle Konten aktualisieren ...</guimenuitem>

source: Import transactions from online banking for all accounts.
de: Importiert Buchungen von Online-Banking für alle Konten.

source: Category Menu
de: Menü Kategorie

source: <guimenu>Category</guimenu><guimenuitem>New category...</guimenuitem>
de: <guimenu>Kategorie</guimenu> <guimenuitem>Neue Kategorie ...</guimenuitem>

source: Adds a new category.
de: Fügt eine neue Kategorie hinzu.

source: <guimenu>Category</guimenu><guimenuitem>Edit category...</guimenuitem>
de: <guimenu>Kategorie</guimenu> <guimenuitem>Kategorie bearbeiten ...</guimenuitem>

source: Edits a category.
de: Bearbeitet eine Kategorie.

source: <guimenu>Category</guimenu><guimenuitem>Delete category...</guimenuitem>
de: <guimenu>Kategorie</guimenu> <guimenuitem>Kategorie löschen ...</guimenuitem>

source: Deletes a category.
de: Löscht eine Kategorie.

source: <guimenu>Category</guimenu><guimenuitem>Open ledger</guimenuitem>
de: <guimenu>Kategorie</guimenu> <guimenuitem>Kontenbuch öffnen</guimenuitem>

source: Displays the ledger view of a category.
de: Zeigt die Kontenbuchansicht einer Kategorie.

source: Transaction Menu
de: Menü Buchung

source: <shortcut> <keycombo>&Ctrl;<keycap>Ins</keycap></keycombo> </shortcut> <guimenu>Transaction</guimenu><guimenuitem>New</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl; <keycap>Einfg</keycap></keycombo></shortcut> <guimenu>Buchung</guimenu> <guimenuitem>New</guimenuitem>

source: Adds a new transaction.
de: Legt eine neue Buchung an.

source: <guimenu>Transaction</guimenu><guimenuitem>Edit</guimenuitem>
de: <guimenu>Buchung</guimenu> <guimenuitem>Bearbeiten</guimenuitem>

source: Edits a transaction.
de: Bearbeitet eine Buchung.

source: <guimenu>Transaction</guimenu><guimenuitem>Edit splits</guimenuitem>
de: <guimenu>Buchung</guimenu> <guimenuitem>Split-Buchungen bearbeiten</guimenuitem>

source: Edits the splits of a transaction.
de: Bearbeitet die Aufteilung einer Buchung.

source: <guimenu>Transaction</guimenu><guimenuitem>Delete</guimenuitem>
de: <guimenu>Buchung</guimenu> <guimenuitem>Löschen</guimenuitem>

source: Deletes a transaction.
de: Löscht eine Buchung.

source: <guimenu>Transaction</guimenu><guimenuitem>Duplicate</guimenuitem>
de: <guimenu>Buchung</guimenu> <guimenuitem>Duplizieren</guimenuitem>

source: Duplicates a transaction.
de: Dupliziert eine Buchung.

source: <guimenu>Transaction</guimenu> <guimenuitem>Mark transaction as ...</guimenuitem> <guimenuitem>Not Reconciled</guimenuitem>
de: <guimenu>Buchung</guimenu> <guimenuitem>Buchung markieren als ...</guimenuitem> <guimenuitem>Nicht abgeglichen</guimenuitem>

source: Changes a transaction to Not Reconciled status.
de: Ändert den Status einer Buchung zu „Nicht abgeglichen“,

source: <shortcut> <keycombo> &Ctrl;&Shift;<keycap>Space</keycap> </keycombo> </shortcut> <guimenu>Transaction</guimenu> <guimenuitem>Mark transaction as ...</guimenuitem> <guimenuitem>Cleared</guimenuitem>
de: <shortcut> <keycombo> &Ctrl;&Shift;<keycap>Leertaste</keycap> </keycombo> </shortcut> <guimenu>Buchung</guimenu> <guimenuitem>Buchung markieren als ...</guimenuitem> <guimenuitem>Verrechnet</guimenuitem>

source: Changes a transaction to Cleared status.
de: Ändert den Status einer Buchung zu „Verrechnet“.

source: <shortcut> <keycombo> &Alt;&Ctrl;<keycap>Space</keycap> </keycombo> </shortcut> <guimenu>Transaction</guimenu> <guimenuitem>Mark transaction as ...</guimenuitem> <guimenuitem>Reconciled</guimenuitem>
de: <shortcut> <keycombo> &Ctrl;&Alt;<keycap>Leertaste</keycap> </keycombo> </shortcut> <guimenu>Buchung</guimenu> <guimenuitem>Buchung markieren als ...</guimenuitem> <guimenuitem>Abgeglichen</guimenuitem>

source: Changes a transaction to Reconciled status.
de: Ändert den Status einer Buchung zu „Abgeglichen“,

source: <guimenu>Transaction</guimenu><guimenuitem>Go to account</guimenuitem>
de: <guimenu>Buchung</guimenu><guimenuitem>Gehe zu Konto</guimenuitem>

source: Displays the other account of a transaction.
de: Zeigt das andere Konto einer Buchung.

source: <guimenu>Transaction</guimenu><guimenuitem>Go to payee</guimenuitem>
de: <guimenu>Buchung</guimenu> <guimenuitem>Gehe zu Zahlungsempfänger</guimenuitem>

source: Displays the Payee view and focuses on the payee of the selected transaction.
de: Zeigt die Ansicht der Zahlungsempfänger und beschränkt dies auf den Zahlungsempfänger der ausgewählten Buchung.

source: <guimenu>Transaction</guimenu> <guimenuitem>Create scheduled transaction...</guimenuitem>
de: <guimenu>Buchung</guimenu> <guimenuitem>Geplante Buchung erstellen ...</guimenuitem>

source: Creates a new scheduled transaction.
de: Erstellt eine neue geplante Buchung.

source: <guimenu>Transaction</guimenu><guimenuitem>Match</guimenuitem>
de: <guimenu>Buchung</guimenu><guimenuitem>Zuordnen</guimenuitem>

source: Matches imported transactions.
de: Zuordnung von importierten Buchungen.

source: <guimenu>Transaction</guimenu><guimenuitem>Unmatch</guimenuitem>
de: <guimenu>Buchung</guimenu><guimenuitem>Zuordnung rückgängig machen</guimenuitem>

source: <action>Unmatches a transactions that &kappname; has proposed as a match of imported transactions.</action> Note that this menu choice is only present if a matched transaction exists.
de: <action>Macht die Zuordnung einer Buchung wieder rückgängig, die von &kappname; zur Zuordnung von importierten Buchungen vorgeschlagen wurde</action>. Dieser Menüeintrag ist nur vorhanden, wenn eine zugeordnete Buchung vorhanden ist.

source: <guimenu>Transaction</guimenu><guimenuitem>Accept</guimenuitem>
de: <guimenu>Buchung</guimenu> <guimenuitem>Annehmen</guimenuitem>

source: Accepts a proposed merge of imported transactions.
de: Annahme einer vorgeschlagenen Zusammenführung von importierten Buchungen.

source: <shortcut> <keycombo>&Ctrl;<keycap>A</keycap></keycombo> </shortcut> <guimenu>Transaction</guimenu><guimenuitem>Select all</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl; <keycap>A</keycap></keycombo></shortcut> <guimenu>Buchung</guimenu> <guimenuitem>Alle auswählen</guimenuitem>

source: Selects all transactions on the register.
de: Wählt alle Buchung in der Ansicht.

source: <guimenu>Transaction</guimenu><guimenuitem>Print check</guimenuitem>
de: <guimenu>Buchung</guimenu><guimenuitem>Scheck ausdrucken</guimenuitem>

source: Tools Menu
de: Menü Extras

source: <guimenu>Tools</guimenu><guimenuitem>QIF Profile Editor...</guimenuitem>
de: <guimenu>Extras</guimenu> <guimenuitem>QIF-Einstellungen</guimenuitem>

source: Modifies the QIF profile used to import or export QIF files.
de: Ändert das QIF-Profil, das zum Import oder Export von QIF-Dateien verwendet wird.

source: <guimenu>Tools</guimenu><guimenuitem>Currencies...</guimenuitem>
de: <guimenu>Extras</guimenu> <guimenuitem>Währungen ...</guimenuitem>

source: Lists the currencies known to &kappname;.
de: Zeigt alle in &kappname; definierten Währungen.

source: <guimenu>Tools</guimenu><guimenuitem>Prices...</guimenuitem>
de: <guimenu>Extras</guimenu> <guimenuitem>Preise ...</guimenuitem>

source: Lists stock and currency prices.
de: Zeigt Aktien- und Währungspreise an.

source: <guimenu>Tools</guimenu> <guimenuitem>Update Stock and Currency Prices...</guimenuitem>
de: <guimenu>Extras</guimenu> <guimenuitem>Aktien- und Währungspreise aktualisieren ...</guimenuitem>

source: Updates stock and currency prices from online sources using the <link linkend="details.investments.onlinequotes">Online Price Quotes</link> feature.
de: Aktualisiert Aktien- und Währungspreise aus Online-Quellen mit der Funktion <link linkend="details.investments.onlinequotes">Online-Kursnotizen</link>.

source: <guimenu>Tools</guimenu><guimenuitem>Consistency Check</guimenuitem>
de: <guimenu>Extras</guimenu> <guimenuitem>Konsistenzüberprüfung</guimenuitem>

source: Runs a check on your file and tries to fix any problem it finds, if possible.
de: Startet eine Überprüfung Ihrer Datei und versucht alle gefundenen Probleme zu beheben.

source: Make a backup of your file before running this option.
de: Erstellen Sie eine Sicherung Ihrer Daten, bevor Sie diese Funktion benutzen.

source: <guimenu>Tools</guimenu><guimenuitem>Performance-Test</guimenuitem>
de: <guimenu>Extras</guimenu><guimenuitem>Leistungstest</guimenuitem>

source: Runs a performance test on your file and displays the results.
de: Startet einen Leistungstest für Ihre Datei und zeigt das Ergebnis an.

source: Settings Menu
de: Menü Einstellungen

source: <guimenu>Settings</guimenu><guimenuitem>Hide/Show Toolbar</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>Werkzeugleiste ein-/ausblenden</guimenuitem>

source: Toggles the toolbar on or off.
de: Zeigt die Werkzeugleiste an oder blendet sie aus.

source: <guimenu>Settings</guimenu><guimenuitem>Hide/Show Statusbar</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>Statusleiste anzeigen/ausblenden</guimenuitem>

source: Toggles the bottom status bar on or off.
de: Schaltet die Anzeige der Statuszeile am unteren Rand ein und aus.

source: <guimenu>Settings</guimenu><guimenuitem>Enable all messages</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>Meldungen wieder anzeigen ...</guimenuitem>

source: Re-enables any messages you may have turned off by checking <guimenuitem>Don't tell me about this again</guimenuitem> in a dialog box.
de: Zeigt wieder alle Meldungen an, wenn Sie vorher in irgendeinem Dialog <guimenuitem>Diese Meldung nicht mehr anzeigen</guimenuitem> ausgewählt haben.

source: <guimenu>Settings</guimenu> <guimenuitem>&kde; Language Settings...</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>&kde;-Sprach-Einstellungen ...</guimenuitem>

source: Allows to change many locale based settings.
de: Öffnet das Modul <guilabel>Land/Region &amp; Sprache</guilabel> aus den &systemsettings;. in dem Sie viele Einstellungen zu Sprache, Zahlen-, Datums-, Zeit- und Währungsformaten bearbeiten können.

source: <guimenu>Settings</guimenu> <guimenuitem>Configure Shortcuts...</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>Kurzbefehle festlegen ...</guimenuitem>

source: Configures custom shortcuts.
de: Öffnet den Dialog zur Änderung der Kurzbefehle.

source: <guimenu>Settings</guimenu> <guimenuitem>Configure Toolbars...</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>Werkzeugleisten einrichten ...</guimenuitem>
