Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/extragear-office/kmymoney_details-reports.po
Languages: de

source: Reports
de: Berichte

source: Available Reports
de: Verfügbare Berichte

source: <screeninfo>Reports View</screeninfo>
de: <screeninfo>Berichts-Ansicht</screeninfo>

source: <phrase>Reports View</phrase>
de: <phrase>Berichts-Ansicht</phrase>

source: The Reports View lists all available reports, grouped under the following headings.
de: Die Berichts-Ansicht zeigt alle verfügbaren Berichte, gruppiert nach den folgenden Themenbereichen.

source: Income and Expenses
de: Einnahmen und Ausgaben

source: The reports in this section show your income and expenses either for the current month or for each month in the current year. Of course, the duration of the overall report and the duration captured by each column can be configured to your liking. Graphs and Pie Charts also may be produced.
de: Die Berichte in diesem Abschnitt zeigen Ihre Einnahmen und Ausgaben im aktuellen Monat oder für jeden Monat des laufenden Jahres. Natürlich kann der Zeitraum des gesamten Berichts, sowie der einzelnen Spalten nach Ihren Bedürfnissen angepasst werden. Weiterhin können Sie Diagramme aus Ihren Berichten erzeugen.

source: Net Worth
de: Eigenkapital

source: Here there are reports that describe your net worth, either at the current moment, every month for the current year, or every year of your history. In addition, there is a 7-day Cash Flow Forecast and a Net Worth Graph. There are also reports to get the balances for all of your accounts at any given point in time.
de: Hier befinden sich die Berichte, die Ihr Eigenkapitel entweder zum aktuellen Zeitpunkt, für jeden Monat des aktuellen Jahres oder für jedes zurückliegende Jahr darstellen. Zusätzlich gibt es eine 7-Tages-Geldfluss-Vorhersage und ein Eigenkapital-Diagramm. Weiterhin gibt es Berichte zu Ihren Kontoständen für alle Ihre Konten zu vorgebbaren Zeitpunkten.

source: Transactions
de: Buchungen

source: This section includes reports that list individual transactions. This is the best way to print your account register for a specific period of time. The transactions printed can be grouped together according to your liking by choosing the appropriate report, such as:
de: In diesem Bereich finden Sie Berichte, die Ihnen eine Auflistung von Buchungen anzeigen. Dies ist die beste Möglichkeit, Ihr Kontenblatt für einen gewählten Zeitbereich auszudrucken. Die ausgedruckten Buchungen können nach Bedarf gruppiert werden, in dem Sie den entsprechenden Bericht auswählen, wie z. B.:

source: By Account
de: Nach Konto

source: By Category
de: Nach Kategorie

source: By Month or Week
de: Nach Monaten oder Wochen

source: By Payee
de: Nach Zahlungsempfänger

source: Cash Flow
de: Geldfluß

source: The Cash Flow report is similar to a Transaction report, but it displays all cash-flow related transactions.
de: Der Geldfluß-Bericht ist identisch mit den Buchungsberichten, nur werden alle Geldfluß-relevanten Buchungen angezeigt.

source: Investments
de: Investitionen

source: These reports help you keep track of your investments. They only include investment accounts. There are a variety of presentation filters and styles, as shown in this partial list.
de: Diese Berichte helfen Ihnen dabei, einen Überblick über Ihre Investitionen zu bekommen. Sie berücksichtigen nur Investitions-Konten. Es gibt eine Vielzahl an Darstellungs-Filtern und Erscheinungsbildern, wie z.B.:

source: Investment Transactions: Similar to a Transactions report, and includes the share price and quantities.
de: Investitions-Buchungen: Identisch wie ein Buchungsreport. Er enthält die Aktienpreise und Anzahl.

source: Investment Holdings by Account: Shows the current shares, price, and value for each account.
de: Investitionen nach Konten: Zeigt die aktuellen Aktien, Preise und Werte für jedes Konto.

source: Investment Holdings by Type: Same as the previous report, but organizes the accounts by type (Stock, Mutual Fund, etc)
de: Investitionen nach Typen: wie der vorherige Bericht, nur werden die Konten nach Typ gruppiert (Aktiendepot, Fonds, etc.)

source: Investment Performance by Account: Shows the annualized performance over any period of time. This performs a cash flow analysis of all money coming into and going out of the account. As a result, this is a very accurate picture of how well your investments are doing.
de: Investitionsentwicklung nach Konten: Zeigt die jährliche Performance für einen beliebig wählbaren Zeitbereich. Dies ermöglicht eine Geldflußanalyse des gesamten eingehenden und ausgehenden Geldes des Kontos. Hieraus ergibt sich ein sehr akkurates Bild, wie profitabel Ihre Investitionen sind.

source: Investment Performance by Type: Same as the previous report, but organizes the accounts by type (Stock, Mutual Fund, etc)
de: Investitionsentwicklung nach Typen: wie der vorherige Bericht, nur werden die Konten nach Typ gruppiert (Aktiendepot, Fonds, etc.)

source: There are also graphs for Investment Prices and Investment Worth.
de: Es gibt außerdem Diagramme für Preis und Wert von Investitionen.

source: Taxes
de: Steuern

source: The tax reports are just like the transactions reports, with the addition that only Tax related categories are included. This allows you to flag certain categories as being tax-related, and then get one big report at the end of the year to see them all in one place. They may be listed either by Category or by Payee, and for the last fiscal year.
de: Die Steuer-Berichte sind wie die Buchungsberichte, wobei hier aber nur steuerrelevante Kategorien berücksichtigt werden. Dies erlaubt Ihnen, bestimmte Kategorien als steuerrelevant zu kennzeichnen, um dann am Jahresende einen großen Bericht mit allen steuerrelevanten Buchungen zu erhalten. Sie können entweder nach Kategorie oder Zahlungsempfänger gruppiert und für das vergangene Geschäftsjahr angezeigt werden.

source: Budgeting
de: Budgetierung

source: The budgeting reports are similar to net worth reports, but the reports can display the budget for a given year, or even compare it to the actual income and expenses for the same period.
de: Die Budgetberichte sind ähnlich wie die Eigenkapitalberichte, allerdings können hier die Budgets für ein vorgegebenes Jahr, oder auch ein Vergleich zwischen Einnahmen und Ausgaben im gleichen Zeitbereich angezeigt werden.

source: Forecast
de: Vorhersage

source: The forecast reports are just like the net worth reports, but they use the information to display forecast information. You can display the information at various levels and for the time frame of your choosing.
de: Die Vorhersageberichte sind ähnlich wie die Eigenkapitalberichte, es werden allerdings Vorhersagen angezeigt. Sie können diese Berichte in verschiedenen Ebenen und Zeitabschnitten erzeugen.

source: These reports display non-transaction information about schedules, accounts, and loans.
de: Diese Berichte zeigen nicht buchungsbezogene Informationen über geplante Buchungen, Konten und Kredite.

source: Charts
de: Diagramme

source: If <link linkend="details.reports.charts">Charts</link> are enabled, this section lists all the reports which are marked to display a graphical chart as the default. They are also listed in one of the other sections, but they are also aggregated here for your easy reference.
de: Wenn <link linkend="details.reports.charts">Diagramme</link> aktiviert sind, zeigt Ihnen dieser Abschnitt eine Liste aller Berichte, die standardmäßig eine Grafik erzeugen. Sie weiterhin zusätzlich in einer der anderen Rubriken dargestellt und sind hier zusätzlich an zentraler Stelle zu finden, den Zugriff zu erleichtern.

source: Favorite Reports
de: Bevorzugte Berichte

source: This section lists all the reports you have marked as a favorite in the report configuration dialog. They are still listed in one of the other sections, but they are also aggregated here for your easy reference. Favorite reports are also included on the financial summary page for even easier reference.
de: In dieser Rubrik werden alle Berichte aufgelistet, die Sie im Einrichtungsdialog eines Berichtes als bevorzugt gekennzeichnet habe. Sie werden weiterhin in einer der anderen Rubriken gelistet, sind aber hier zusätzlich an zentraler Stelle zusammengefasst, um sie schneller zu finden. Bevorzugte Berichte werden auch in der Finanzübersichtsseite angezeigt, um sie schnell erreichen zu können.

source: Configuring Reports
de: Berichte einrichten

source: To access the report configuration dialog, bring up the report you wish to configure, and press the <guibutton>Configure</guibutton> button at the top of the report.
de: Um den Einrichtungsdialog zu erreichen, öffnen Sie den gewünschten Bericht und drücken Sie den Knopf <guibutton>Einrichten</guibutton> im oberen Bereich des Berichts.

source: Working With Reports
de: Arbeiten mit Berichten

source: There are a number of actions you can take on each report. You can access these by right-clicking the report name in the list of reports. Alternately, once you have run a report, there are buttons across the top of the view to invoke each of these:
de: Sie können einige Aktionen auf jeden Bericht anwenden. Durch einen rechten Mausklick auf den Namen des Berichts in der Berichtsliste können Sie die gewünschte Aktion auswählen. Alternativ dazu finden Sie entsprechende Aktionsknöpfe auch im oberen Bereich des Anzeigefensters, wenn Sie einen Bericht geöffnet haben:

source: Chart: Only present if the report is capable of displaying a chart. Clicking this option toggles between the report and the chart.
de: Diagramm: ist nur zu sehen, wenn der Bericht als Diagramm angezeigt werden kann. Durch Klicken auf diesen Knopf wechseln Sie zwischen der Diagramm- und der Berichtsansicht.

source: Configure: Change the properties of this report. You can customize the report to your liking and save it for future use.
de: Einrichten: Ändern der Einstellungen für diesen Bericht. Sie können den Bericht nach Ihren Wünschen anpassen und für den späteren Gebrauch auch abspeichern.

source: New: Create a new customized report based on the selected report.
de: Neu: erzeugt einen neuen benutzerdefinierten Bericht auf Basis des ausgewählten Berichts.

source: Copy: The report output can be copied to the clipboard to paste them in another application, like a spreadsheet, for further analysis.
de: Kopieren: kopiert die Ausgabe des Berichts in die Zwischenablage, um sie in einer anderen Anwendung wie einer Tabellenkalkulation für weitere Analysen einzufügen.

source: Export: Reports can be saved in &HTML; or CSV format.
de: Exportieren: Berichte können im &HTML; oder CSV-Format abgespeichert werden.

source: Delete: Customized reports can be deleted. The default reports that ship with &kappname; cannot be deleted.
de: Löschen: Benutzerdefinierte Berichte können gelöscht werden. Die standardmäßigen Berichte, die mit &kappname; mitgeliefert werden, können nicht gelöscht werden.

source: Close: Close the current report.
de: Schließen: Schließt den aktuellen Bericht.

source: Working with custom reports
de: Arbeiten mit benutzerdefinierten Berichten

source: You can configure the default reports or create your own from them by selecting 'New' and then configuring the new report. When you select 'Configure' you will be presented with the Report Tab. Initially, it is named the same as the old report with <quote>(Customized)</quote> added to the end. You can change the name to whatever you want. You can even name your custom reports the same as a default report, or the same as another custom report. Also, you can always use the Comment field to further distinguish reports.
de: Sie können die Standardberichte anpassen, oder Ihren eigenen aus diesen erzeugen, indem Sie den Knopf <guibutton>Neu</guibutton> betätigen und den neu erzeugten Bericht dann anpassen. Durch den Knopf <guibutton>Einrichten</guibutton> gelangen Sie in den Einrichtungsdialog. Standardmäßig wird der neue Bericht benannt wie der alte, auf dem er beruht. Dem Namen wird das Kennzeichen <quote>(Angepasst)</quote> am Ende des Berichtsnamens hinzugefügt. Sie können den Namen beliebig ändern. Sie können ihm den gleichen Namen wie ein Standardbericht geben, oder den gleichen Namen wie ein anderer benutzerdefinierter Bericht. Weiterhin können Sie im Kommentar-Feld weitere Informationen hinterlegen, um die Berichte voneinander unterscheiden zu können.

source: The Report Configuration dialog has a number of tabs across the top. Each tab displays options for configuring different aspects of the report.
de: Der Einstellungsdialog für Berichte besitzt mehrere Karteikarten. Jede Karteikarte zeigt Optionen, um verschiedene Einstellungen des Berichts vorzunehmen.

source: Report Tab
de: Karteikarte "Bericht"

source: Report Configuration -Report
de: Einstellungen für Berichte - Bericht

source: On this tab, you set the basic properties of this report.
de: Auf dieser Karteikarte nehmen Sie die grundlegenden Einstellungen des Berichts vor.

source: Report Name: Choose a name for this report.
de: Berichtsname: Geben Sie dem Bericht einen Namen.

source: Comment: Enter a comment to help you remember the details of this report.
de: Kommentar: Hier können Sie weitere Informationen zum Bericht hinterlegen.

source: Convert values to base currency: Select this option to convert all values in the report to your base currency. Leave it unchecked if you'd like to see values in their original currency. If currencies are not converted, then subtotals will not be shown.
de: Werte in die Basiswährung umrechnen: Mit dieser Option werden alle Werte des Berichts in Ihre Basiswährung umgerechnet. Deaktivieren Sie diese Option, wenn Sie die Werte in ihrer Originalwährung sehen möchten. Werden die Währungen nicht umgerechnet, wird keine Gesamtsumme angezeigt.

source: Mark as favorite report: Check this to cause this report to show up on the home page and in the group of <guilabel>Favorite Reports</guilabel>.
de: Als bevorzugten Bericht markieren: Wenn diese Option angekreuzt wird, so taucht der Bericht sowohl auf der Übersichtsseite von &kappname;, als auch in der Gruppe <guilabel>Bevorzugte Berichte</guilabel> auf.

source: Rows/Columns Tab
de: Karteikarte "Zeilen/Spalten"

source: On this tab, you configure how you would like the rows and columns to be selected and organized. This tab presents different configuration options depending on the style of report you have selected.
de: Hier können Sie einstellen, wie die Zeilen und Spalten im Bericht ausgewählt und organisiert werden. Abhängig von der Berichtsart können hier verschiedene Einstellungen vorgenommen werden.

source: Report Configuration -Rows and Columns
de: Einstellungen für Berichte - Zeilen und Spalten

source: For income/expense and net worth reports:
de: Bei Einnahmen/Ausgaben- und Geldflussberichten:

source: Columns: Choose how large of a time period each column should encompass
de: Spalten: Wählen Sie aus, wie groß die Zeitperiode ist, die jede Spalte umfassen soll

source: Rows: Choose what kind of accounts to display as the rows of this report
de: Zeilen: Wählen Sie die Kontenarten aus, die in den Zeilen des Berichts erscheinen sollen

source: Detail: Choose the level of detail required for this report.
de: Details: Wählen Sie den Detaillierungsgrad des Berichts aus.

source: The following levels of detail are available:
de: Folgende Detaillierungsgrade sind verfügbar:

source: All: Show every category or account.
de: Alle: Zeigt jede Kategorie, bzw. jedes Konto.

source: Top-Level: Show only the highest-level categories or accounts, and roll up the sums of the subordinates categories or accounts into those values.
de: Oberstes Level: Zeigt nur die obersten Kategorie- oder Kontenebene an und summiert die darunterliegenden Kategorien bzw. Konten auf.

source: Groups: Show only the totals of the income, expenses, assets, or liabilities.
de: Gruppen: Zeigt nur die Gesamtsummen der Einnahmen, Ausgaben, Anlagen oder Verbindlichkeiten.

source: Total: Show only the grand totals line.
de: Summen: Zeigt nur die Zeile mit den Gesamtsummen.

source: For transaction reports:
de: Bei Buchungsberichten:

source: Organize by: Choose how to group the transactions in this report
de: Organisiert nach: Wählen Sie aus, wie die Buchungen in diesem Bericht gruppiert werden sollen

source: Show Columns: Choose which columns should be shown in the report. The date and transaction amount are always shown.
de: Spalten anzeigen: Kreuzen Sie die Spalten an, die im Bericht erscheinen sollen. Das Datum und der Wert der Buchung werden immer angezeigt.

source: Include only Tax Categories: Only show categories which have been marked as tax-related.
de: Nur Steuerkategorien einschließen: Zeigt nur die Kategorien, die als steuerrelevant markiert wurden.

source: Include only Investment Accounts: Only show transactions from investment accounts.
de: Nur Investmentkonten einschließen: Zeigt nur Buchungen von Anlagekonten an.

source: Include only Loan Accounts: Only show transactions from loan accounts.
de: Nur Kreditkonten einschließen: Zeigt nur Buchungen aus Kreditkonten an.

source: Chart Tab
de: Karteikarte „Diagramm“

source: This tab allows you to configure what the report should look like when it is displayed as a chart. See the <link linkend="details.reports.charts">Graphs &amp; Charts</link> section for more explanation of the charting functions.
de: Hier können Sie einstellen, wie der Bericht aussehen soll, wenn er als Diagramm angezeigt wird. Eine nähere Erläuterung der Diagrammfunktionen finden Sie im Kapitel <link linkend="details.reports.charts">Grafiken &amp; Diagramme</link>.

source: Chart Type: The visual format of chart desired.
de: Diagrammtyp: Wählen Sie hier, welche Art von Diagramm der Bericht zeigen soll (Linien-, Balken-, Tortendiagramm, etc.).

source: Show grid lines: Whether to print horizontal and vertical grid lines on the chart.
de: Gitterlinien anzeigen: Auswahl, ob die horizontalen und vertikalen Gitterlinien im Diagramm angezeigt werden.

source: Draw values on chart: Whether to print the data values on the chart itself for chosen data points.
de: Werte im Diagramm anzeigen: Ist die Option angekreuzt, werden die Werte für die gewählten Datenpunkte im Diagramm selbst angezeigt.

source: Show chart by default: Whether this report should first be displayed as a chart when it's opened.
de: Standardmäßig als Diagramm zeigen: Beim Öffnen des Berichts wird sofort ein Diagramm angezeigt.

source: Line width: The width of data lines on the chart.
de: Linienbreite: Die Breite der gezeichneten Linien im Diagramm.

source: Other Tabs
de: Andere Karteikarten

source: The other tabs in this dialog are the same as in the Search Transactions interface. Please refer to the <link linkend="details.search">documentation</link> on that interface for details on the other tabs.
de: Die anderen Unterfenster in diesem Dialog sind die gleichen wie im Suchformular für Buchungen. Bitte schauen Sie in das <link linkend="details.search">Kapitel</link> für weitere Informationen.

source: Graphs &amp; Charts
de: Grafiken &amp; Diagramme

source: Viewing as a Chart
de: Anzeige als Diagramm

source: Each report can be viewed in either textual form or graphical (chart) form. The same report configuration parameters are used in either case. You can easily jump back and forth between the textual and graphical forms by pressing the <guibutton>Chart</guibutton> or <guibutton>Report</guibutton> buttons along the top of the report view.
de: Jeder Bericht kann entweder in Textform oder in grafischer Form als Diagramm betrachtet werden. Für beide Darstellungsvarianten werden die gleichen Berichtkonfigurationen verwendet. Sie können ganz einfach zwischen beiden Darstellungsformen wechseln, indem Sie den Knopf <guibutton>Diagramm</guibutton> oder <guibutton>Bericht</guibutton> am oberen Rand des Fensters drücken.

source: Care should be taken to limit the amount of data you choose to display on a chart. If you are not careful, using the same configuration for both textual and graphical forms means it's possible to configure a chart to be visually cluttered, unappealing, and uninformative. &kappname; will not force you to keep your charts readable and useful!
de: Sie sollten auf die Menge der in Ihrem Diagramm anzuzeigenden Daten achten. Wenn Sie nicht entsprechend umsichtig sind und die gleiche Konfiguration für die Text- und Diagrammdarstellung verwenden, kann es passieren, dass das angezeigte Diagramm unaufgeräumt, unansehnlich und wenig informativ wird. &kappname; kann Sie nicht zwingen, dass die Diagramme les- und brauchbar bleiben.

source: Available Chart Types
de: Verfügbare Diagrammtypen

source: Line Graph
de: Liniendiagramm

source: A line graph is one of the most simple forms of a chart. There is one line for each series. (Usually a series is a single account or category; see below for more details on that.) The time periods stretch out along the bottom axis, and the currency values are along the left.
de: Ein Liniendiagramm ist eines der einfachsten Arten eines Diagramms. Es gibt für jede Datenreihe eine Linie. Normalerweise ist eine Datenreihe ein einzelnes Konto oder eine Kategorie; weiter unten finden Sie weitere Informationen darüber. Die Zeitperiode erstreckt sich über die horizontale Achse (X-Achse), die Werte über die vertikale Achse (Y-Achse) auf der linken Seite.

source: The detail level for each line is controlled in the <link linkend="details.reports.config.rowscolumns">Rows/Columns</link> Tab of chart configuration. If you choose the <quote>Top-Level</quote> detail level, there will be one line for each of the top-most accounts or categories which show the sum total of all underlying accounts or categories. If you choose <quote>Groups</quote> it will instead show one line each for Income, Expenses, Assets, or Liabilities, depending on the other settings.
de: Der Detaillierungsgrad für jede Zeile wird im Unterfenster <link linkend="details.reports.config.rowscolumns">Zeilen/Spalten</link> der Berichtskonfiguration festgelegt. Wenn Sie dort <quote>Oberstes Level</quote> auswählen, wird für jedes Konto auf der obersten Ebene eine Linie dargestellt und zeigt die Gesamtsumme aller darunterliegenden Kategorien oder Konten. Wenn Sie stattdessen <quote>Gruppen</quote> auswählen, wird das Diagramm jeweils eine Linie für Einnahmen, Ausgaben, Anlagen und Verbindlichkeiten (abhängig von den anderen Einstellungen) anzeigen.

source: Bar Graph
de: Balkendiagramm

source: The bar graph works exactly the same as the line graph, except there is one bar for each series in each time slice.
de: Das Balkendiagramm arbeitet exakt so wie das Liniendiagramm, außer dass es einen Balken für jede Datenreihe pro Zeitabschnitt gibt.

source: Pie Chart
de: Tortendiagramm

source: The pie chart is the most simple chart available. It shows only one time slice, as opposed to showing the values across time. This chart shows only the totals column of whatever report is selected. If your report is configured to NOT convert values to the base currency, there will be no totals column, and therefore this report is not useful.
de: Das Tortendiagramm ist das einfachste verfügbare Diagramm. Es zeigt nur einen einzigen Zeitabschnitt, anstatt die Werte über einen Zeitbereich anzuzeigen. Dieser Bericht zeigt nur die Gesamtsummen eines beliebigen ausgewählten Berichts. Wenn Ihr Bericht so konfiguriert wurde, dass die Währungen nicht in die Basiswährung umgerechnet werden, dann werden keine Gesamtsummen berechnet und somit ist dieser Bericht wenig hilfreich.

source: Ring Chart
de: Ringdiagramm

source: The ring chart is very similar to a pie chart, except there is one <quote>ring</quote> for each time slice in the report.
de: Ein Ringdiagramm ist dem Tortendiagramm sehr ähnlich, außer dass jeder <quote>Ring</quote> einen Zeitbereich im Bericht repräsentiert.
