Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/extragear-office/kmymoney_firsttime.po
Languages: de

source: Now that one or more accounts exist in &kappname;, your account summary is shown in the Home view. You can create transactions manually in the <link linkend="details.ledgers">Ledgers</link> view, or set up automatic transactions through the <link linkend="details.schedules">Schedules</link> view.
de: Wenn mindestens ein Konto erstellt worden ist, wird die Zusammenfassung der Daten aller Konten in der Übersicht angezeigt. Sie können einzelne Buchungen im <link linkend="details.ledgers">Kontenbuch</link> oder Daueraufträge in der Ansicht <guilabel>Geplante Buchungen</guilabel> eingeben.

source: Schedules
de: Geplante Buchungen

source: Sometimes called a recurring transaction, a <link linkend="details.schedules">Schedule</link> is a transaction that occurs one or more times over a certain period of time. A typical example is your pay check that you receive every month or week. Rather than have to enter the transaction details each time you get paid, you can instruct &kappname; to create a schedule that will enter a transaction for you when you get paid.
de: <link linkend="details.schedules">Geplante Buchungen</link>, auch wiederholte Buchungen genannt, sind Buchungen die mehrmals in einen bestimmten Zeitraum ausgeführt werden. Ein typisches Beispiel is Ihre wöchentliche oder monatliche Lohnzahlung. Anstatt alle Details dieser Buchung jedesmal wieder neu einzugeben, können Sie in &kappname; eine geplante Buchung ausführen, die zu den angegebenen Terminen ausgeführt wird.

source: To maintain <link linkend="details.schedules">schedules</link> click on the Schedules icon <guiicon><inlinemediaobject><imageobject><imagedata fileref="schedule_view.png"/></imageobject></inlinemediaobject></guiicon> in the view selector.
de: Um <link linkend="details.schedules">Buchungen</link> zu verwalten, klicken Sie auf das Symbol <guiicon><inlinemediaobject><imageobject><imagedata fileref="schedule_view.png"/></imageobject></inlinemediaobject></guiicon> Geplante Buchungen in der Ansichtsauswahl.

source: Categories
de: Kategorien

source: To maintain <link linkend="details.categories">categories</link> click on the <guiicon><inlinemediaobject><imageobject><imagedata fileref="categories_view.png"/></imageobject></inlinemediaobject></guiicon> Categories icon in the view selector.
de: Um <link linkend="details.categories">Kategorien</link> zu verwalten, klicken Sie auf das Symbol <guiicon><inlinemediaobject><imageobject><imagedata fileref="categories_view.png"/></imageobject></inlinemediaobject></guiicon> Kategorien in der Ansichtsauswahl.

source: A full description of this topic can be found in the <link linkend="details.categories">Categories</link> section.
de: Eine umfangreiche Erläuterung zu diesem Thema finden Sie im Abschnitt <link linkend="details.categories">Kategorien</link>.

source: Tags
de: Stichwörter

source: A full description of this topic can be found in the <link linkend="details.tags">Tags</link> section.
de: Eine umfangreiche Erläuterung zu diesem Thema finden Sie im Abschnitt <link linkend="details.tags">Stichwörter</link>.

source: Payees
de: Zahlungsempfänger

source: To maintain your list of payees click on the Payees icon <guiicon><inlinemediaobject><imageobject><imagedata fileref="payees_view.png"/></imageobject></inlinemediaobject></guiicon> in the view selector.
de: Um Ihre Liste der Zahlungsempfänger zu verwalten, klicken Sie auf das Symbol <guiicon><inlinemediaobject><imageobject><imagedata fileref="payees_view.png"/></imageobject></inlinemediaobject></guiicon> Empfänger in der Ansichtsauswahl.

source: A full description of this topic can be found in the <link linkend="details.payees">Payees</link> section.
de: Eine umfangreiche Erläuterung zu diesem Thema finden Sie im Abschnitt <link linkend="details.payees">Zahlungsempfänger</link>.

source: Quicken Interchange Format (QIF) Import
de: Import des „Quicken Interchange Formats“ (QIF)

source: If you currently use a financial manager application, &kappname; can import an account's transactions as long as they are in the Quicken Interchange Format (QIF). Most financial programs can export this format and the different applications methods of exporting QIF is not discussed here for brevity.
de: Haben Sie vorher bereits ein Finanzverwaltungsprogramm benutzt, dann können Sie die Buchungen eines Kontos in &kappname; importieren, wenn diese Daten im „Quicken Interchange“-Format (QIF) vorliegen. Die meisten Finanzprogramme haben eine Exportfunktion für das QIF-Format, informieren Sie sich in der Dokumentation zum Programm, wie Sie den Export durchführen können.

source: A full description of this topic can be found in the <link linkend="details.impexp.qifimp">QIF Import</link> section.
de: Eine umfangreiche Erläuterung zu diesem Thema finden Sie im Abschnitt <link linkend="details.impexp.qifimp">QIF-Import</link>.

source: Searching for transactions
de: Suche nach Buchungen

source: &kappname; provides a useful and powerful transaction search facility in the form of the search dialog.
de: &kappname; bietet eine nützliche und leistungsfähige Funktion zur Suchen mit dem Dialog „Suchen“.

source: The search dialog can be opened from the toolbar using the Find icon <guiicon><inlinemediaobject><imageobject><imagedata fileref="transaction_find.png"/></imageobject></inlinemediaobject></guiicon> or by selecting <guimenuitem>Find Transaction</guimenuitem> from the <guimenu>Edit</guimenu> menu.
de: Den Suchdialog können Sie mit dem Symbol <guiicon><inlinemediaobject><imageobject><imagedata fileref="transaction_find.png"/></imageobject></inlinemediaobject></guiicon> aus der Werkzeugleiste oder <guimenuitem>Buchung suchen</guimenuitem> aus dem Menü <guimenu>Bearbeiten</guimenu> öffnen.

source: A full description of this topic can be found in the <link linkend="details.search">Search</link> section.
de: Eine umfangreiche Erläuterung zu diesem Thema finden Sie im Abschnitt <link linkend="details.search">Suchen</link>.

source: Reconciliation
de: Kontenabgleich

source: At some point you will want to reconcile the transactions you have entered with the transactions listed in a statement, be it a bank statement, credit card statement, loan statement, or any other statement. Reconciliation involves matching what you have entered with what the statement lists. If any discrepancies are found then either you or the person who created the statement have made a mistake.
de: Irgendwann möchten Sie Ihre eingegebenen Buchungen mit den Buchungen auf Kontoauszügen wie zum Beispiel Bankauszügen, Kreditartenkonten, Gehaltskonten usw. abgleichen. Dieser Vorgang erfordert die Abstimmung der eingegebenen Buchungen mit den Buchungen auf den Auszügen. Treten dabei Abweichungen auf, haben entweder Sie oder die Person, die die Kontoauszüge erstellt hat, einen Fehler gemacht.

source: To reconcile an account, first select the account, either from <guiicon>Accounts</guiicon> view or from <guiicon>Ledgers</guiicon> view. Then, either click on the <guiicon>Reconcile</guiicon> icon on the Toolbar, or select <guimenuitem>Reconcile</guimenuitem> from the <guimenu>Account</guimenu> menu.
de: Um ein Konto abzugleichen, wählen Sie zuerst das Konto entweder aus der Ansicht <guiicon>Konten</guiicon> oder <guiicon>Kontenbuch</guiicon>. Klicken Sie dann entweder auf das Symbol <guiicon>Abgleichen</guiicon> in der Werkzeugleiste oder wählen Sie <guimenuitem>Abgleichen</guimenuitem> aus dem Menü <guimenu>Konto</guimenu>.

source: A full description of this topic can be found in the <link linkend="details.reconcile">Reconciliation</link> section.
de: Eine umfangreiche Erläuterung zu diesem Thema finden Sie im Abschnitt <link linkend="details.reconcile">Kontenabgleich</link>.

source: Backing up
de: Sicherung

source: Now that you have created some accounts and entered transactions it's a good idea to perform a backup. Because the file used by &kappname; is a standard Unix file you can just copy the file to another location to back it up or use the dialog provided by &kappname;. Using the dialog is the preferred method because if &kappname; ever starts using other file formats, such as SQL, then it would be much harder to copy the file manually.
de: Da Sie jetzt einige Konten erstellt und Buchungen eingegeben haben, wird empfohlen, eine Sicherung der Daten durchzuführen. Da &kappname; eine normale Datei verwendet, kann als Sicherung eine Kopie an einem anderen Speicherort erstellt werden. Außerdem können Sie auch den Dialog „Sicherung“ benutzen. Es wird empfohlen, die Sicherung mit dem Dialog auszuführen, da es viel schwieriger ist, die Daten von Hand zu kopieren, wenn &kappname; andere Speicherformate wie zum Beispiel eine SQL-Datenbank benutzt.

source: To backup your file through &kappname; Select <guimenuitem>Backup</guimenuitem> from the <guimenu>File</guimenu> menu and enter the folder where you wish the file to be copied to. If the folder needs mounting first and you have the sufficient privileges then check the tick box labeled <guilabel>Mount this directory before backing up</guilabel> and click on <guibutton>OK</guibutton>.
de: Um Ihre Datei mit &kappname; zu sichern, wählen Sie <guimenuitem>Sicherung</guimenuitem> aus dem Menü <guimenu>Datei</guimenu> und geben Sie den Ordner an, in den die Datei kopiert werden soll. Muss der Ordner zuerst eingebunden werden, aktivieren Sie <guilabel>Dieses Gerät einhängen, bevor die Sicherung durchgeführt wird</guilabel>, sofern Sie die Berechtigung für diese Aktion haben. Drücken Sie dann den Knopf <guibutton>OK</guibutton>.

source: The file will be copied to the folder specified with the current date appended to the filename so it is easy to see the date the file was backed up.
de: Die Datei wird mir dem aktuellen Datum als Ergänzung des Dateinamens in dem angegebenen Ordner gespeichert, so dass Sie am Dateinamen sofort das Datum der Sicherung erkennen können.

source: Launching &kappname;
de: &kappname; starten

source: Most commonly, you will launch &kappname; from an icon or a start menu of your window manager. In this case, the default behavior is that &kappname; will open the last file you had open. However, in some circumstances, you will want or need to launch &kappname; from the command line.
de: Normalerweise starten Sie &kappname; durch Anklicken eines Symbols auf Ihrer Arbeitsfläche oder aus einen Startmenü Ihres Fenstermanagers. In diesem Fall öffnet &kappname; die beim letzten Start geladene Datei. Unter bestimmten Bedingungen aber möchten oder müssen Sie &kappname; vielleicht von der Befehlszeile aufrufen.

source: For a complete description of all the available line options, see the man page for &kappname;. However, there are two special cases which we describe here.
de: Eine umfassende Beschreibung aller vorhandenen Befehlszeilenoptionen finden Sie in den Handbuchseiten zu &kappname;. Zwei besondere Optionen werden hier kurz beschrieben.

source: The -n option tells &kappname; not to open the last file it had open. This can be useful if the program crashes on startup.
de: Mit der Option -n startet &kappname; nicht mit der zuletzt geöffneten Datei. Diese Einstellung kann dann nützlich sein, wenn das Programm beim Start abstürzt.

source: kmymoney &lt;path to file&gt;
de: kmymoney &lt;pfad/zu/datei&gt;

source: Giving &kappname; a filename on the command line tells it to open that file instead of the last file it had open. You can use the name of any valid &kappname; file, as described in the chapter on <link linkend="details.formats">file formats</link>. In addition, this can be used to import a <link linkend="details.impexp.gnucash">GnuCash</link> file.
de: Geben Sie beim Start von &kappname; auf der Befehlszeile einen Dateinamen an, wird diese Datei anstelle der zuletzt geöffneten Datei geladen. Sie können hier den Namen jeder gültigen &kappname;-Datei angeben, die im Kapitel <link linkend="details.formats">Dateiformate</link> beschrieben sind. Zusätzlich können Sie diese Option benutzen um eine <link linkend="details.impexp.gnucash">GnuCash</link>-Datei zu importieren.

source: Contacting the Developers / Reporting Bugs
de: Kontakt mit den Entwicklern aufnehmen und Fehler berichten

source: Contacting the developers
de: Kontakt mit den Entwicklern aufnehmen

source: We're happy to hear about your experiences using &kappname;.
de: Bitte schicken Sie Ihre Erfahrungsberichte mit &kappname;.

source: Reporting bugs
de: Berichten von Fehlern

source: To report a bug please use the interface provided by &kappname; by selecting <menuchoice><guimenu>Help</guimenu><guimenuitem>Report Bug</guimenuitem></menuchoice> and filling in the required information. However, in case you have any difficulties with that method, you can report a bug (or file a wish-list or enhancement request) directly at the <ulink url="http://bugs.kde.org">&kde; bug reporting web page</ulink>. Reports should be filed against the product <quote>kmymoney4</quote>. <quote>kmymoney2</quote> was specifically for bugs in the 1.0.x versions of the application, and as those versions are no longer supported, it is closed for further bug reporting.
de: Für einen Fehlerbericht benutzen Sie bitte den Menüeintrag <menuchoice><guimenu>Hilfe</guimenu><guimenuitem>Probleme oder Wünsche berichten</guimenuitem></menuchoice> und geben Sie alle nötigen Informationen ein. Bei Problemen mit diese Methode können Sie einen Fehler, einen Wunsch oder einen Verbesserungsvorschlag auch direkt auf der <ulink url="http://bugs.kde.org">&kde;-Internetseite für Fehlerberichte</ulink> eingeben. Benutzen Sie das Produkt <quote>kmymoney4</quote>. <quote>kmymoney2</quote> wurde nur für Fehler der Version 1.x des Programms benutzt. Da diese Version nicht mehr unterstützt wird, können keine Fehlerberichte mehr angenommen werden.

source: In any case, before reporting a bug, please read through the guidelines below. Following them will make it more likely that the developers will be able to quickly identify the problem without having to ask you for more information.
de: Ehe Sie einen Fehler berichten, lesen Sie bitte die folgenden Anleitungen. Folgen Sie diesen Anleitungen, können Entwickler wahrscheinlich schneller das Problem erkennen, ohne Sie mit weiteren Fragen belästigen zu müssen.

source: Writing High Quality Bug Reports
de: Nützliche Fehlerberichte schreiben

source: We encourage users to take extra time to write high-quality bug reports when submitting them. This reduces wasted effort on all sides, as the reporter and the developer who will fix it trade emails until this information is really in place.
de: Wir empfehlen unseren Benutzern, sich zusätzliche Zeit zu nehmen, um hochwertige Fehlerberichte zu schreiben, ehe sie eingeschickt werden. Dadurch reduziert sich der Aufwand sowohl für den Reporter als auch für den Entwickler, da keine weiteren E-Mails ausgetauscht werden müssen, bis alle notwendigen Informationen zu Behebung des Fehlers wirklich vorhanden sind.

source: Eli Goldberg wrote the canonical Bug-Writing Guideline, available at <ulink url="http://issues.apache.org/bugwritinghelp.html">http://issues.apache.org/bugwritinghelp.html</ulink>. Generally, you'll be well-served by following these guidelines:
de: Eli Goldberg schrieb eine anerkannte Anleitung für das Schreiben von Fehlerberichten, die sie auf <ulink url="http://issues.apache.org/bugwritinghelp.html">http://issues.apache.org/bugwritinghelp.html</ulink> finden. Folgen Sie dieser Anleitung, um nützliche Fehlerberichte zu schreiben.

source: Include your system information
de: Systeminformationen einfügen

source: Include a backtrace for crashes
de: Rückverfolgung für Abstürze einfügen

source: The backtrace is often the single most useful piece of information in solving crashes.
de: Die Rückverfolgung ist meistens die einzige hilfreiche Information, um die Fehler für solche Abstürze zu beseitigen.

source: Try to reproduce it
de: Versuchen Sie, den Fehler zu reproduzieren

source: Let us know if you were able to do so. It's useful to know whether the bug only happened once and you couldn't get it to happen again or happens every time or happens sometimes but not others.
de: Geben Sie an, ob Sie den Fehler reproduzieren können. Es ist hilfreich zu wissen, ob der Fehler nur einmal auftrat und dann nie wieder, oder jedesmal oder nur manchmal.

source: Include specific steps
de: Geben Sie alle nötigen Schritte an, um den Fehler reproduzieren zu können.

source: This is a bad bug report: <quote>I entered a transaction, and &kappname; crashed.</quote> A much better bug report is: <quote>Using the transaction form, I entered a new transaction in my Credit Card account. I selected the Transfer tab, entered in an amount, then changed to the Deposit tab, and back to the Transfer tab. When I returned to the Transfer tab, &kappname; crashed. This bug is fully reproducible for me.</quote>
de: Die ist ein nutzloser Fehlerbericht: <quote>Ich habe eine Buchung eingeben und &kappname; ist abgestürzt.</quote> Viel besser ist dieser Fehlerbericht: <quote>Im Buchungsformular habe ich einen Buchung für mein Kreditkartenkonto eingegeben. Auf der Karteikarte Umbuchung habe ich einen Betrag eingegeben, dann wechselte ich zur Karteikarte Gutschrift und wieder zurück zur Karteikarte Umbuchung. Als ich zurück zu Umbuchung wechselte, ist &kappname; abgestürzt. Diesen Fehler kann ich jederzeit reproduzieren.</quote>

source: Tell us what you expected to happen
de: Was haben Sie erwartet?

source: In some cases, this is obvious, but in more subtle bugs, sometimes you'll see a bug report where it is not obvious what the reporter expected to happen. Always tell us what you think should have happened.
de: In manchen Fällen ist das offensichtlich, aber bei subtilen Fehlerberichten ist nicht immer ersichtlich, was vom Programm erwartet wurde. Daher geben Sie diese Information immer an.

source: Consider running with debugging enabled
de: Ausführung mit Symbolen zur Fehlersuche

source: By compiling a version configured with --enable-debug=full you can ensure that the best possible backtraces are generated. If you encounter a crash, run &kappname; again from within gdb, and reproduce the crash. When it crashes, type <quote>bt</quote> to generate a backtrace.
de: Kompilieren Sie ein Programm mit --enable-debug=full können Sie sicherstellen, das nützliche Absturzinformationen erstellt werden. Stürzt &kappname; ab, starten Sie es im Programm gdb und wiederholen Sie den Absturz. Dann geben Sie <quote>bt</quote> ein. um die Absturzinformationen zu sammeln.

source: Running this way is a bit more difficult, so we don't expect all users to do this. However, if you're interested in helping &kappname; become as stable as possible, this is the best way to do it short of finding the bug in the code and sending in a patch.
de: Diese Art der Ausführung des Programms ist etwas schwieriger, daher wird das nicht von allen Benutzer erwartet. Möchten Sie jedoch mithelfen, dass &kappname; so stabil wie möglich läuft, ist dies der beste Weg, um Fehler im Quelltext zu finden und Korrekturen des Quelltexts zu schicken.
