Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/extragear-office/kmymoney_details-ledgers.po
Languages: de

source: In the split editor screen, double-click an empty line to enter a new sub-transaction or press <keycombo action="simul">&Ctrl;<keycap>Ins</keycap></keycombo>. Specify the category, add an (optional) memo, and enter the amount. To save this part of the split, press the green check mark under the category. To cancel, press the red cross.
de: Im Split-Buchungs-Editor klicken Sie doppelt auf eine leere Zeile, um eine neue Split-Buchung einzutragen, oder drücken Sie <keycombo action="simul">&Ctrl;<keycap>Einfg</keycap></keycombo>. Wählen Sie die passende Kategorie, hinterlegen Sie auf Wunsch eine kurze Bemerkung und geben Sie zum Schluss noch den Betrag der Split-Buchung ein. Um die Splitzeile zu speichern, drücken Sie den grünen Haken unter der Kategorie. Um die Eingabe abzubrechen drücken Sie auf das rote Kreuz.

source: After entering a split, the bottom of the split editor shows how much of the total transaction is still unassigned. After entering all the splits, press the <guibutton>OK</guibutton> button to save the entire transaction. If there is still an unassigned amount, you will be prompted to either return to editing the splits, change the total transaction amount, or leave part of the transaction unassigned.
de: Nach Eingabe einer Splitzeile wird im unteren Bereich des Split-Buchungs-Editor angezeigt, welche Restsumme der Buchung noch nicht einer Kategorie zugewiesen wurde. Nach Eingabe aller gewünschten Splitzeilen drücken Sie den Knopf <guibutton>OK</guibutton>, um die gesamte Buchung zu speichern. Wenn immer noch eine nicht zugewiesene Restsumme verblieben ist, werden Sie gefragt, ob Sie zum Split-Buchungs-Editor zurückkehren, die Gesamtsumme der Buchung anpassen oder einen Rest der Buchung keiner Kategorie zuweisen möchten.

source: Note that the category field in the transaction input form or the transaction list now displays <emphasis>Split transaction</emphasis>.
de: Das Kategoriefeld im Buchungsformular oder der Buchungsliste zeigt nun den Text <emphasis>Split-Buchung</emphasis> an.

source: Split transactions
de: Split-Buchungen

source: Split transaction
de: Split-Buchung

source: Editing transactions
de: Buchungen bearbeiten

source: To edit a transaction, select it in the list view and either click on <guibutton>Edit</guibutton> in the transaction input form or right click on the entry and select <guimenuitem>Edit</guimenuitem> from the popup menu. If you are editing transactions directly in the list you can edit the transaction simply by double clicking on an entry or by pressing &Enter; when a transaction is highlighted.
de: Um eine Buchung zu bearbeiten, wählen Sie die entsprechende Buchung in der Buchungsliste und drücken den Knopf <guibutton>Bearbeiten</guibutton> im Buchungsformular, oder klicken Sie mit der rechten Maustaste auf die Buchung wählen Sie <guimenuitem>Bearbeiten</guimenuitem> aus dem Kontextmenü. Wenn Sie den Modus entsprechenden Modus aktiviert haben und die Buchungen direkt in der Buchungsliste bearbeiten, können Sie auch einfach mit der Maus doppelt auf die gewünschte Buchung klicken, oder &Enter; drücken, wenn die betreffende Buchung ausgewählt ist.

source: Deleting transactions
de: Buchungen löschen

source: To delete a transaction, select it in the list view, right click on the entry, and select <guimenuitem>Delete</guimenuitem> from the popup menu when it appears, or click <guibutton>Delete</guibutton> on the transaction form.
de: Um eine Buchung zu löschen, wählen Sie sie in der Buchungsliste aus und klicken Sie sie mit der rechten Maustaste an. Im erscheinenden Kontextmenü wählen Sie <guimenuitem>Löschen</guimenuitem>, oder Sie klicken auf <guibutton>Löschen</guibutton> im Buchungsformular.

source: Matching Transactions
de: Buchungen zuordnen

source: Generally, when importing transactions, either via QIF, OFX, or HBCI, &kappname; will automatically attempt to match them against existing transactions. To allow for differences in the dates, there is a default setting of 4 days, which may be changed in the settings - Register/Import. Any transactions so matched will be highlighted in green. On completion of the import, you should review these and either accept or unmatch them.
de: Wenn Sie Buchungen importieren (z.B. QIF, OFX oder HBCI), versucht &kappname; die importierten Buchungen automatisch den bereits im Kontenbuch vorhandenen Buchungen zuzuordnen. Standardmäßig darf sich das Datum der Buchungen bei der automatischen Zuordnung um 4 Tage unterscheiden. Diese Voreinstellung kann in den Einstellungen zum Kontenbuch auf der Karteikarte <guilabel>Importieren</guilabel> geändert werden. Jede Buchung, die automatisch zugeordnet werden konnte, wird grün markiert. Nach Abschluss des Imports sollten Sie die automatisch zugeordneten Buchungen überprüfen und entweder akzeptieren oder sie wieder trennen.

source: If you should find that an imported transaction was not automatically matched with an existing transaction when it should have matched, then it is possible to match them manually. Note that there is a difference between manually matching two transactions and simply deleting one of them, even though they may appear to have the same effect. Specifically with OFX or HBCI, it is important not to delete the imported transaction, because you will find that the next time you import your transactions, the deleted transaction shows up again. This is because modern import formats like OFX and HBCI use a <quote>Transaction ID</quote> to identify transactions. When you delete the imported transaction, the transaction ID goes with it, so the importer has no way to know this transaction was already imported.
de: Sollten Sie importierte Buchungen finden, die nicht automatisch zu bereits bestehenden Buchungen im Kontenbuch zugeordnet wurden, besteht die Möglichkeit diese manuell zuzuordnen. Beachten Sie, dass es einen Unterschied macht, ob Sie zwei Buchungen zuordnen, oder eine der beiden einfach löschen, auch wenn es auf den ersten Blick zum gleichen Ergebnis führt, nämlich dass nur eine Buchung übrig bleibt. Gerade bei OFX und HBCI ist es besonders wichtig, dass Sie die importierte Buchung nicht einfach löschen, denn beim nächsten Import würden die gelöschten Buchungen erneut auftauchen. Der Grund ist, dass moderne Formate wie OFX und HBCI sogenannte <quote>Transaktions-IDs</quote> verwenden, um Buchungen eindeutig zu identifizieren. Wenn Sie nun eine so importierte Buchung löschen, wird natürlich auch die Transaktions-ID gelöscht, sodass der Importer beim nächsten Import nicht mehr weiss, dass die Buchung bereits importiert wurde. Also wird sie erneut importiert und taucht wieder im Kontenbuch auf.

source: The solution is to tell &kappname; that the transactions are the same, using the manual matching interface. This allows you to match an imported transaction with a hand-entered (non-imported) transaction. To do so, select one of the transactions to be matched by clicking on it, then select the other by left clicking on it while pressing the &Ctrl; key, and then select <guimenuitem>Match</guimenuitem> from the context menu. This changes the background color to a pale green. This will match and combine the two transactions together. The values of both transactions must be the same for the match to work, except that the dates may differ by the window specified in the settings, as described above. If you are happy with the result, right click the matched transaction, then select <guibutton>Accept</guibutton>.
de: Die Lösung besteht darin, &kappname; durch eine manuelle Zuordnung mitzuteilen, dass die beiden Buchungen identisch sind. Dies ermöglicht Ihnen, eine importierte Buchung mit einer manuell eingegebenen (nicht importierten) Buchung zu verknüpfen/zuzuordnen. Um zwei Buchungen manuell zuzuordnen, markieren Sie die erste Buchung, indem Sie sie mit der Maus anklicken. Anschließend markieren Sie auch die zweite Buchung genauso, nur drücken Sie dabei gleichzeitig die &Ctrl;-Taste und wählen <guimenuitem>Zuordnen</guimenuitem> aus dem Kontextmenü. Die Hintergrundfarbe der Buchung ändert sich zu einem blassen Grün. Hierdurch werden die beiden Buchungen einander zugeordnet und zusammengeführt. Die Beträge der beiden Buchungen müssen identisch sein, damit die Zuordnung funktioniert. Nur das Datum der beiden Buchungen darf sich um das oben erwähnte eingestellte Zeitfenster unterscheiden. Wenn Sie mit dem Ergebnis zufrieden sind, klicken Sie die zugeordnete Buchung mit der rechten Maustaste an und wählen Sie den Knopf <guibutton>Annehmen</guibutton>.

source: During import of online statements - either directly or by importing a downloaded file - &kappname; performs matching as best as it can based on the name of the payee and the amount of the transaction. In case of an invalid match, a matched transaction can be unmatched.
de: Während des Imports von Onlinebuchungen, entweder direkt oder durch das Einlesen einer heruntergeladenen Datei, versucht &kappname; nach seinen Möglichkeiten eine automatische Zuordnung, basierend auf dem Namen des Zahlungsempfängers und dem Betrag der Buchung. Im Falle einer falschen automatischen Zuordnung kann die zugeordnete Buchung wieder getrennt werden.

source: The matching interface will not allow you to match two transactions which have both been imported. Likewise, it won't allow matching between two transactions which have both been entered by hand.
de: Es ist nicht möglich, zwei Buchungen einander zuzuordnen, die beide importiert wurden. Genauso ist es nicht möglich, zwei Buchungen einander zuzuordnen, die beide manuell eingegeben wurden.

source: Understanding the Cleared State
de: Der Status "Verrechnet"

source: A transaction can have one of three states: non-reconciled, cleared (C), and reconciled (R). When you enter a transaction, it has state non-reconciled. Once the bank posts the transaction, the user can clear it and thus transform it to state (C). When you receive a statement from the bank, all cleared transactions should be on the statement.
de: Eine Buchung kann einen von folgenden drei möglichen Zustände haben: nicht abgeglichen (N), verrechnet (V) und abgeglichen (A). Wenn Sie eine neue Buchung eingeben, hat diese den Status "nicht abgeglichen". Sobald die Buchung der Bank ankommt, können Sie sie mit Ihrem Kontenbuch verrechnen und die Buchung in den Status "V" setzen. Sobald Sie einen Kontoauszug von Ihrer Bank erhalten, sollten alle verrechneten Buchungen darauf zu finden sein.

source: Understanding the cleared state
de: Der Status "Verrechnet"

source: cleared state
de: Verrechnet-Status

source: When you <link linkend="details.reconcile">reconcile your account</link>, you actually mark the statements as cleared and check that the difference between the beginning balance and the cleared transactions equals the ending balance of the statement. When this is the case, you can 'finish reconciling' which actually changes the state of all cleared transactions (C) to reconciled (R).
de: Wenn Sie Ihr Konto <link linkend="details.reconcile">abgleichen</link>, markieren Sie alle Buchungen als "verrechnet" und überprüfen, ob die Differenz zwischen dem Anfangskontostand und dem Endkontostand der Summe der verrechneten Buchungen entspricht und mit dem Endkontostand des Kontoauszugs übereinstimmt. Wenn das der Fall ist, können Sie den "Abgleich beenden", wobei automatisch der Status aller verrechneten Buchungen von "Verrechnet" (V) in "Abgeglichen" (A) geändert wird.

source: If you try to edit a transaction with at least one split marked as reconciled (R), you will be warned.
de: Wenn Sie eine Buchung bearbeiten möchten, die mindestens eine Split-Buchung enthält die bereits als abgeglichen (A) gekennzeichnet wurde, werden Sie gewarnt.

source: A fourth state is defined (frozen (F)) but there's currently no way to set it. It is reserved for future use. Nevertheless, if a transaction has at least one split in state frozen it cannot be edited anymore.
de: Es existiert noch ein vierter Status ("eingefroren"), der aber nicht gesetzt werden kann. Dieser ist für einen späteren Gebrauch vorgesehen. Wenn eine Buchung mindestens eine Splitzeile im Status "eingefroren" besitzt, kann die Buchung nicht mehr bearbeitet werden.

source: Changing Transaction Settings
de: Buchungseinstellungen verändern

source: There are several settings options that change the appearance and behavior of the ledger view in terms of transactions. These settings are found by selecting <guimenu>Settings</guimenu> <guimenuitem>Configure &kappname;</guimenuitem> from the menu bar, and selecting the <guiicon><inlinemediaobject><imageobject><imagedata fileref="ledgers_view.png"/> </imageobject></inlinemediaobject>Register</guiicon> icon from the list on the left.
de: Es gibt mehrere Optionen, die das Aussehen und das Verhalten der Buchungen in der Kontenbuchansicht beeinflussen. Diese Einstellungen finden Sie durch Auswahl von <menuchoice><guimenu>Einstellungen</guimenu> <guimenuitem>&kappname; einrichten ...</guimenuitem> </menuchoice>aus dem Menü und durch Auswahl des <guiicon><inlinemediaobject><imageobject><imagedata fileref="ledgers_view.png"/> </imageobject></inlinemediaobject>Kontenbuch</guiicon> Symbols aus der Liste auf der linken Seite des Einstellungs-Dialogfensters.

source: Most of the settings are self explanatory. For clarity, several of the settings are explained below.
de: Die meisten Einstellungen sind selbsterklärend. Zur Veranschaulichung werden einige der möglichen Einstellungen aber trotzdem nachfolgend beschrieben.

source: Show transaction form (under the Display tab) - toggle to hide the transaction input area at the bottom of this screen. Transactions can still be entered directly into an empty line at the end of the transaction list, through an automatic compact entry area.
de: Buchungsformular anzeigen (auf der Karteikarte "Anzeige") - schaltet die Anzeige des Buchungsformulars für die Eingabe einer Buchung im unteren Bereich des Bildschirms an oder aus. Buchungen können trotzdem direkt in eine leere Zeile am Ende der Buchungsliste durch eine kompakte automatischen Eingabebereich direkt in der Liste eingegeben werden.

source: These images show what direct transaction entry looks like compared to the transaction form.
de: Die Bilder zeigen, wie die direkte Eingabemöglichkeit in der Buchungsliste im Vergleich zum Buchungsformular im unteren Bereich aussieht.

source: <para>The transaction input form</para>
de: <para>Das Buchungseingabeformular</para>

source: The transaction form
de: Das Buchungsformular

source: Transaction form
de: Buchungsformular

source: <para>Transactions entered directly</para>
de: <para>Buchungen werden direkt eingegeben</para>

source: <screeninfo>Transactions entered directly</screeninfo>
de: <screeninfo>Buchungen direkt eingegeben</screeninfo>

source: Direct input
de: Direkte Eingabe

source: Keep changes when selecting a different transaction/split - by selecting the next line in the transaction list or split editor, the changes are kept, instead of the default behavior where you have to push the green check mark to save changes.
de: Änderungen beibehalten, wenn eine andere Buchung ausgewählt wird - durch das Auswählen der nächsten Zeile in der Buchungsliste oder dem Split-Buchungs-Editor werden die vorher durchgeführten Änderungen beibehalten, anstatt der Standardeinstellung, dass Änderungen erst durch Klick auf den grünen Haken gespeichert werden.

source: Other Functionality
de: Andere Funktionen

source: Additional options are available from the <guimenu>Transaction Options</guimenu> menu, accessed by right-clicking any transaction in the list.
de: Weitere Optionen sind im Kontextmenü <guimenu>Buchungsoptionen</guimenu> verfügbar, das sich durch einen Klick mit der rechten Maustaste auf eine beliebige Buchung in der Liste öffnet.

source: The transaction options sub-menu
de: Das Kontextmenü Buchungsoptionen

source: Transaction options
de: Buchungsoptionen

source: Options include jumping to the Payee's page, creating a schedule, and changing the reconciled or cleared indication.
de: Mithilfe dieser Optionen können Sie zur Zahlungsempfänger-Seite springen, eine geplante Buchung anlegen und den Status "Verrechnet" oder "Abgeglichen" verändern.

source: To edit the account information from the ledger view, select <guimenu>Account</guimenu> from the menu bar. From this menu, you can change the account details, or bring up the Reconcile menu, which allows you to match transactions against an official bank statement or credit card notice.
de: Um die Kontoinformationen aus dem Kontenbuch heraus zu bearbeiten, wählen Sie aus dem Menü den Punkt <guimenu>Konto</guimenu>. Aus diesem Menü können Sie die Kontendetails bearbeiten, sowie das Menü zum Abgleich des Kontos erreichen, welches Ihnen erlaubt, die Buchungen den Buchungen des Bankkontoauszugs oder der Kreditkartenabrechnung zuzuordnen.
