Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/extragear-office/kmymoney_details-widgets.po
Languages: de

source: Widgets
de: Bedienelemente

source: &kappname; has some specific widgets not found in other applications. The usage of these widgets is explained in this chapter.
de: &kappname; hat einige spezielle Bedienelemente, die man in anderen Applikation so nicht findet. Die Verwendung dieser Bedienelemente wird in diesem Kapitel erläutert.

source: Date entry widget
de: Datumseingabe-Bedienelement

source: Whenever &kappname; needs information about a specific date, &eg;, the posting date of a transaction or the opening date of an account, it offers the user the <emphasis>date entry widget</emphasis>. This widget consists of three fields and a button. The fields present the <emphasis>day</emphasis>, the <emphasis>month</emphasis>, and the <emphasis>year</emphasis>, separated by the date separator characters specified by your locale settings. The button - if pressed - opens the <emphasis>datepicker</emphasis> widget.
de: Wann immer &kappname; eine Information über ein spezifisches Datum benötigt, &eg; das Datum einer Buchung oder das Eröffnungsdatum eines Kontos, wird dem Benutzer ein <emphasis>Datumseingabe-Bedienelement</emphasis> angeboten. Es besteht aus drei Feldern und einem Knopf. Die Felder stellen den <emphasis>Tag</emphasis>, den <emphasis>Monat</emphasis> und das <emphasis>Jahr</emphasis> getrennt durch Datumstrennzeichen dar. Wird der Knopf gedrückt, öffnet sich ein <emphasis>Datumsauswahl</emphasis> Bedienelement.

source: Tip of the Day
de: Tipp des Tages

source: Date widget
de: Datums-Bedienelement

source: Within the date entry widget, the left/right cursor keys can be used to switch between the <emphasis>day</emphasis>, the <emphasis>month</emphasis>, and the <emphasis>year</emphasis> fields. Using the up/down cursor keys, the value of the selected field can be incremented/decremented. The <keycap>+</keycap> and <keycap>-</keycap> keys can be used to increment/decrement a single day. Month and year boundaries are considered and incremented/decremented if necessary. Pressing <keycap>T</keycap> will set the date to today's date.
de: Innerhalb des Datum-Bedienelements können Sie mit Hilfe der Cursor-Tasten Links und Rechts zwischen dem <emphasis>Tag</emphasis>, <emphasis>Monat</emphasis> und <emphasis>Jahr</emphasis> Feld wechseln. Mit den Cursor-Tasten Hoch und Runter wird der Wert des aktuellen Feldes erhöht oder erniedrigt. Die Tasten <keycap>+</keycap> und <keycap>-</keycap> können genutzt werden, um einen einzelnen Tag zu ändern. Die Monat- und Jahresgrenzen werden erkannt und entsprechend erhöht oder erniedrigt, wenn es notwendig ist. Mit der Taste <keycap>T</keycap> wird das heutige Datum eingestellt.

source: The date can also be changed using the mouse. Clicking on the <emphasis>day</emphasis>, <emphasis>month</emphasis>, or <emphasis>year</emphasis> field selects the field. The value can then be incremented/decremented using the arrow buttons on the right of the widget. They act exactly the same as the up/down key.
de: Das Datum kann auch mit der Maus verändert werden. Durch Anklicken des <emphasis>Tag</emphasis>, <emphasis>Monat</emphasis> oder <emphasis>Jahr</emphasis> Feldes wird das entsprechende Feld ausgewählt. Der Wert des Feldes kann anschließend mit den entsprechenden Knöpfen auf der rechten Seite des Bedienelements erhöht und erniedrigt werden. Sie bewirken genau das gleiche wie die Hoch/Runter Tasten.

source: The datepicker opens when the button to the right of the arrow buttons is pressed. It shows four arrow buttons at the top, two on each side of the currently selected month name and year. The leftmost buttons are used to decrement the year and the month; the buttons to the right of the year are used to increment the month and the year. The button to the very right closes the datepicker.
de: Der Datumsauswähler öffnet sich, wenn der Knopf rechts des Pfeilknopfes gedrückt wird. Er enthält vier Pfeilknöpfe im oberen Bereich, sowie zwei auf jeder Seite des gerade gewählten Monatsnamens und der Jahreszahl. Die Knöpfe ganz links dienen zum verringern des Monats und der Jahreszahl, die Knöpfe rechts der Jahreszahl dienen zum Erhöhen des Monats und des Jahres. Der Knopf ganz rechts schließt den Datumsauswähler.

source: Beneath the buttons, the widget presents a calendar page for the selected month. Clicking a day on the calendar selects that date, closes the datepicker, and transfers the selected date into the <emphasis>day</emphasis>, <emphasis>month</emphasis>, and <emphasis>year</emphasis> fields.
de: Neben den Knöpfen zeigt das Bedienelement ein Kalenderblatt für den ausgewählten Monat. Beim Anklicken eines Tages wird dieses Datum übernommen, der Datumsauswähler wird geschlossen und das ausgewählte Datum wird in die <emphasis>Tag</emphasis>, <emphasis>Monat</emphasis> und <emphasis>Jahr</emphasis> Felder übernommen.

source: At the bottom of the datepicker widget, there are a button, a text edit field, and a combo box. Pressing the button selects today's date in the datepicker. The text field can be used to enter a specific date. Pressing the <keycap>RETURN</keycap> key shows that date in the datepicker widget. The combo box allows the user to select a specific week, and continue to pick a date from there.
de: Im unteren Bereich des Datumsauswählers befindet sich ein Knopf, ein Texteingabefeld und eine Auswahlliste. Durch Drücken des Knopfes wird der heutige Tag in den Datumsauswähler übernommen. Das Textfeld kann genutzt werden, um ein bestimmtes Datum einzugeben. Durch Drücken der <keycap>Eingabetaste</keycap> wird das Datum im Datumsauswähler-Bedienelement angezeigt. Die Auswahlliste ermöglicht die Auswahl einer bestimmten Woche, um anschließend einen Tag dieser Woche zu wählen.

source: Value entry
de: Werteingaben

source: The value entry widget consists of a text field (that accepts digits, thousands separators, and decimal symbols) as well as a button to the right. Use the digits to enter the value. Separate the fractional part by entering the decimal separator for your locale. If you click on the button to the right or press a key representing a numeric operation (&eg;, +,-,/,* or %) a little calculator will pop up and allow you to calculate the final value.
de: Das Werteingabe Bedienelement besteht aus einem Texteingabefeld (welches Zahlen, Tausendertrennzeichen und Dezimaltrennzeichen akzeptiert) und einem Knopf auf der rechten Seite. Verwenden Sie die Zahlen, um den gewünschten Wert einzugeben. Geben Sie die Nachkommastellen durch Eingabe des Dezimaltrennzeichens Ihrer Ländereinstellungen ein. Wenn den Knopf rechts oder eine Taste die eine arithmetische Operation darstellt (&eg; <keycap>+</keycap>, <keycap>-</keycap>, <keycap>/</keycap>, <keycap>*</keycap> oder <keycap>%</keycap>), so erscheint ein kleiner Taschenrechner und ermöglicht Ihnen die Berechnung des Ergebnisses.

source: Negative values can be entered by preceding the value with a minus sign. In case your locale is set to display negative numbers with parentheses around the value, the value can also be enclosed in parenthesis in the value entry widget.
de: Negative Werte können durch Eingabe eines vorangestellten Minuszeichens eingegeben werden. Ist in Ihren Ländereinstellungen festgelegt, dass negative Zahlen durch einen in Klammern eingeschlossenen Wert dargestellt wird, so kann dieser Wert genauso in Klammern eingeschlossen eingegeben werden.

source: Value widget
de: Werteingabe-Bedienelement

source: Use the calculator widget just like a normal calculator and once done leave it by clicking on the '=' button or press the '=' key on your keyboard.
de: Verwenden Sie das Taschenrechner Bedienelement wie einen normalen Taschenrechner und verlassen Sie ihn durch Drücken des Knopfes <keycap>=</keycap>, oder durch Drücken der Taste <keycap>=</keycap> auf Ihrer Tastatur.

source: Payee/Payer entry
de: Zahler/Zahlungsempfänger-Eingabe

source: When you are requested to enter a payee/payer for a transaction, you can start entering the name by pressing keys on your keyboard. As long as matching entries exist in the list of payees/payers maintained by &kappname; they will be presented in a box beneath or above the text entry area. Using the mouse or the up/down keys one can select a name from that list. Using the keyboard additionally requires you to select the entry by pressing the RETURN key.
de: Wenn Sie aufgefordert werden, einen Zahlenden/Zahlungsempfänger für eine Buchung einzugeben, so können Sie beginnen, den Namen mit der Tastatur einzutippen. Solange übereinstimmende Einträge in der von &kappname; verwalteten Empfängerliste existieren, so werden diese in einer Box neben oder über dem Eingabefeld angezeigt. Mit der Maus oder den Hoch/Runter Tasten kann ein Eintrag aus der Liste ausgewählt werden. Wenn Sie die Tastatur verwenden, müssen Sie den gewählten Eintrag noch durch Drücken der Eingabetaste bestätigen.

source: Payee widget
de: Empfänger Bedienelement

source: If a name is entered that is not yet known to &kappname; you will be asked if you want to create a new payee/payer record. If you do not wish to do so, then the field will be blanked. Otherwise, the record will be created and added to the list.
de: Wenn der eingegebene Name &kappname; noch nicht bekannt ist, werden Sie gefragt, ob Sie einen neuen Empfänger-Datensatz anlegen möchten. Wenn Sie sich dagegen entscheiden, so wird das Feld geleert. Ansonsten wird der Datensatz erzeugt und zur Liste hinzugefügt.

source: Once the edit field contains characters, the list only shows those payees that match the character sequence entered. Double-click on the arrow of the combo box to show all payees in the list.
de: Sobald das Eingabefeld die ersten Zeichen enthält, zeigt die Liste nur noch diejenigen Empfänger, die auf die eingegebene Zeichenfolge zutrifft. Klicken Sie doppelt auf den Pfeil der Auswahlliste, um eine Gesamtliste der Empfänger zu sehen.

source: Category/account entry
de: Kategorie/Konto Eingabe

source: When you are requested to enter the name of a category or account, you can start entering the name by pressing keys on your keyboard. As long as matching entries exist in the list of categories/accounts known to &kappname; they will be presented in a box beneath or above the text entry area. Using the mouse or the up/down keys one can select a name from that list. Using the keyboard additionally requires you to select the entry by pressing the RETURN key.
de: Wenn Sie aufgefordert werden, eine Kategorie oder ein Konto einzugeben, so können Sie beginnen, den Namen mit der Tastatur einzutippen. Solange übereinstimmende Einträge in der von &kappname; verwalteten Kategorien-/Kontenliste existieren, so werden diese in einer Box neben oder über dem Eingabefeld angezeigt. Mit der Maus oder den Hoch/Runter Tasten kann ein Eintrag aus der Liste ausgewählt werden. Wenn Sie die Tastatur verwenden, müssen Sie den gewählten Eintrag noch durch Drücken der Eingabetaste bestätigen.

source: Category widget
de: Kategorien-Bedienelement

source: If a name is entered that is not yet known to &kappname; you will be asked if you want to create a new category record. If you do not wish to do so, then the field will be blanked. Otherwise, the record will be created and added to the list.
de: Wenn der eingegebene Name &kappname; noch nicht bekannt ist, werden Sie gefragt, ob Sie einen neuen Kategorien-Datensatz anlegen möchten. Wenn Sie sich dagegen entscheiden, so wird das Feld geleert. Ansonsten wird der Datensatz erzeugt und zur Liste hinzugefügt.

source: Once the edit field is filled with characters, the list only shows those categories/accounts that match the character sequence entered. Double-click on the arrow of the combo box to show the complete list.
de: Sobald das Eingabefeld die ersten Zeichen enthält, zeigt die Liste nur noch diejenigen Kategorien/Konten, die auf die eingegebene Zeichenfolge zutreffen. Klicken Sie doppelt auf den Pfeil der Auswahlliste, um eine Gesamtliste der Kategorien/Konten zu sehen.
