Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/extragear-office/kmymoney_introduction.po
Languages: de

source: Introduction
de: Einführung

source: What is &kappname;?
de: Was ist &kappname;?

source: Put simply, &kappname; is a personal finance manager for &kde;. It enables users of open source operating systems and applications to keep careful track of their personal finances by providing a broad array of financial features and tools.
de: &kappname; ist ein persönliches Finanzverwaltungsprogramm für &kde;. Es ermöglicht es Benutzern von quelloffenen Betriebssystemen und Programmen, Ihre persönlichen Finanzen zu verwalten, indem es eine große Anzahl an Finanzfunktionen und Hilfsmitteln dafür bereitstellt.

source: The principal goals of the project are:
de: Die wichtigsten Ziele des Projekts sind:

source: Feature Parity
de: Gleichwertige Funktionalität

source: &kappname; intends to provide all important features found in the commercially available personal finance managers. Although every release of &kappname; gets closer and closer to that goal, there is still work to be done.
de: &kappname; will alle wichtigen Finanzfunktionen bereitstellen, die in kommerziellen Finanzverwaltungsprogrammen für den privaten Bereich enthalten sind. &kappname; nähert sich mit jeder neuen Version diesem Ziel, es fehlen aber immer noch einige Funktionen.

source: Ease of Use.
de: Benutzerfreundlich.

source: &kappname; strives to be the easiest open source personal finance manager to use, especially for the non-technical user.
de: &kappname; soll das am einfachsten zu bedienende Finanzverwaltungsprogramm werden, vor allem für unerfahrene Benutzer.

source: Correctness.
de: Fehlerfreiheit

source: Based on tried and tested double entry accounting principles &kappname; ensures that your finances are kept in correct order.
de: Auf der Grundlage von getesteten und überprüften Prinzipien der doppelten Buchführung stellt &kappname; sicher, dass Ihre Finanzdaten korrekt verarbeitet und verwaltet werden.

source: What &kappname; is not
de: Was &kappname; nicht ist

source: As a personal finance manager, &kappname; is not intended to scale to the needs of an average business. A small business might find sufficient functionality to use &kappname;, but features such as accounts-receivable and accounts-payable are not directly supported. However, it would be possible to create client, supplier, document, or other features through plugins.
de: Als Finanzverwaltungsprogramm für den persönlichen Bereich ist &kappname; nicht für die Erfordernisse eines normalen Unternehmens geeignet. Für kleine Unternehmen bietet es möglicherweise ausreichende Funktionen, aber zum Beispiel Debitoren- und Kreditorenkonten werden nicht direkt unterstützt. Es ist jedoch möglich, diese Funktionen für Kunden, Lieferanten und Belege usw. durch Module bereitzustellen.

source: &kappname; is not simply a clone of the commercially available personal finance programs. Although many of the features present in &kappname; can be found in other similar applications, &kappname; strives to present an individual and unique view of your finances.
de: &kappname; ist nicht einfach nur eine Kopie von kommerziell verfügbaren Finanzprogrammen für den persönlichen Bereich. Obwohl viele Funktionen von &kappname; auch in ähnlichen Programmen zu finden sind, soll &kappname; Ihnen eine individuelle und einzigartige Sicht auf Ihre Finanzen ermöglichen.
