Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/extragear-office/kmymoney_details-formats.po
Languages: de

source: File Formats
de: Dateiformate

source: Unless you choose to use a <link linkend="details.database">relational database</link>, &kappname; will store all your financial information in a file ending in .kmy. Also, unless you use a <link linkend="firsttime.launch">command line option</link> that tells it not to do so, when you launch &kappname;, it will open the last file it had open. However, it is important to know that there is more than one type of file &kappname; can use to hold your financial data.
de: Wenn Sie keine <link linkend="details.database">relationale Datenbank</link> verwenden, speichert &kappname; alle Daten in einer Datei mit der Erweiterung „.kmy“. &kappname; öffnet beim Starten normalerweise automatisch die zuletzt geöffnete Datei, wenn Sie nicht die <link linkend="firsttime.launch">Befehlszeilenoption</link> für den Start ohne Öffner einer Datei benutzen. Sie sollten wissen, das es mehrere Dateitypen gibt, in der &kappname; Ihre Finanzdaten speichern kann.

source: This chapter describes the formats in which &kappname; stores its data in permanent form on the user's storage device. In general, &kappname; stores its information in form of an &XML; document. Depending on the actual format, this &XML; document will be written
de: Dieses Kapitel beschreibt die Formate, in denen &kappname; die Daten ständig auf dem Datenträger des Benutzers abspeichert. Im Allgemeinen speichert &kappname; die Informationen in einem &XML;-Dokument. Dieses wird abhängig vom aktuellen Format geschrieben

source: as a <link linkend="details.formats.plain">plain text file</link> encoded in UTF-8,
de: als eine <link linkend="details.formats.plain">Textdatei</link> kodiert im Zeichensatz UTF-8,

source: as a <link linkend="details.formats.compressed">compressed file</link> using GZIP compression,
de: als eine mit GZIP <link linkend="details.formats.compressed">komprimierte Datei</link>,

source: as an <link linkend="details.formats.encrypted">encrypted file</link> using GPG encryption, or
de: als eine mit GPG <link linkend="details.formats.encrypted">verschlüsselte Datei</link>, oder

source: as an <link linkend="details.formats.anonymous">anonymous plain text file</link> encoded in UTF-8 but with all your personal data scrambled.
de: als eine <link linkend="details.formats.anonymous">anonymisierte Textdatei</link> kodiert im Zeichensatz UTF-8, in der alle persönlichen Daten unkenntlich gemacht wurden.

source: Plain text file
de: Textdatei

source: This is the most space consuming format supported, as no compression is performed. It is not intended for normal use, and is provided to support debugging purposes and the capability to modify the file manually. If you end a filename in <literal role="extension">.xml</literal>, the file will be stored in this format.
de: Das ist das Format mit dem größten Speicherbedarf, da keine Komprimierung erfolgt. Es ist nicht für den normalen Gebrauch gedacht, sondern für Fehleranalysen (Debugging) und gibt Ihnen die Möglichkeit, die Datei manuell zu verändern. Wenn Sie als Dateierweiterung <literal role="extension">.xml</literal> wählen, wird die Datei im Textformat gespeichert.

source: Manual modification of the file is not recommended to the normal user, and should only be performed if the internal working of &kappname; is fully understood or if instructions from the developers tell you what to do. Don't blame the &kappname; developers if you screw up your data: You have been warned!
de: Eine manuelle Änderung der Datei wird normalen Benutzern nicht empfohlen und sollte nur durchgeführt werden, wenn die interne Arbeitsweise von &kappname; vollständig verstanden wurde, oder nachdem Ihnen ein Entwickler eine Anweisung gibt, was genau geändert werden soll. Geben Sie nicht den Entwicklern von &kappname; die Schuld, wenn Sie Ihre Daten unbrauchbar machen.

source: GZIP-compressed file
de: GZIP-komprimierte Datei

source: This is the normal format used by &kappname; when you store a file with the extension <literal role="extension">.kmy</literal>.
de: Dies ist das normale Speicherformat von &kappname;, wenn Sie eine Datei mit der Erweiterung <literal role="extension">.kmy</literal> abspeichern.

source: If <link linkend="details.formats.encrypted">encryption</link> has been selected, the file will be stored encrypted.
de: Wenn <link linkend="details.formats.encrypted">verschlüsselt</link> ausgewählt wurde, wird die Datei verschlüsselt abgespeichert.

source: If you want to look at the contents of a GZIP compressed file, rename it to a filename ending in <literal role="extension">.gz</literal> (&eg;, rename <filename>myfinances.kmy</filename> to <filename>myfinances.kmy.gz</filename>), then use <command>gunzip</command> to uncompress the file and look at it. You don't have to compress it before loading it into &kappname; the next time, because &kappname; can read the uncompressed data as well. Nevertheless, if you save it thereafter, it will be saved compressed again. Use the <link linkend="details.formats.plain">.xml</link> extension to write it in uncompressed format.
de: Wenn Sie sich eine mit GZIP komprimierte Datei ansehen möchten, benennen Sie sie einfach um, sodass sie mit <literal role="extension">.gz</literal> endet (&eg; Umbenennen von <filename>meinefinanzen.kmy</filename> in <filename>meinefinanzen.kmy.gz</filename>). Anschließend entpacken Sie die Datei mit <command>gunzip</command> und Sie können sie sich anschauen. Sie müssen die Daten nicht wieder komprimieren, bevor Sie sie in &kappname; beim nächsten mal öffnen, da &kappname; auch die unkomprimierten Dateien lesen kann. Nichtsdestotrotz wird &kappname; sie beim nächsten Speichern wieder komprimiert speichern. Verwenden Sie die Dateiendung <link linkend="details.formats.plain">.xml</link>, um sie im unkomprimierten Format zu speichern.

source: GPG-encrypted file
de: GPG-verschlüsselte Datei

source: Using the GPG-encrypted file format is a very secure method of storing your personal finance data on your storage device. When &kappname; has been instructed through the settings dialog to store your data encrypted, it will cipher the data using GPG and the key you provided before actually storing it. When opening an encrypted file, you have to provide the passphrase necessary to open your keyring. The encrypted file itself will be stored in GPG's <emphasis>ASCII armored</emphasis> format.
de: Die Verwendung der GPG-Verschlüsselung ist eine sehr sichere Art, Ihre persönlichen Finanzdaten auf Ihrer Festplatte zu speichern. Wenn in den Einstellungen die Verschlüsselung aktiviert ist, werden Ihre Daten mit GPG und Ihrem Schlüssel verschlüsselt. Wenn Sie eine verschlüsselte Datei öffnen möchten, müssen Sie eine Passwort zum Zugriff auf Ihren Schlüsselbund eingeben. Die verschlüsselte Datei wird im Format <emphasis>ASCII armored</emphasis> von GPG gespeichert.

source: When using GPG encryption, GPG also compresses the file, so no extra compression is necessary.
de: GPG komprimiert die gespeicherten Daten automatisch, sodass keine separate Komprimierung erforderlich ist.

source: GPG-Keys
de: GPG-Schlüssel

source: If you have not done so already for mail encryption, you need to generate a key-pair in order to use the GPG encryption feature of &kappname;. Also, <application>GPG</application> must be installed on your system.
de: Wenn Sie nicht bereits für Ihre E-Mail-Verschlüsselung ein GPG-Schlüsselpaar erzeugt haben, so müssen Sie eines erzeugen, um die GPG-Verschlüsselung von &kappname; nutzen zu können. <application>GPG</application> muss dafür auf Ihrem System installiert sein.

source: The details about how to generate a key-pair and how to take care of it are beyond the scope of this document. A Mini Howto on this subject can be found at <ulink url="http://www.gnupg.org/documentation/howtos.en.html">http://www.gnupg.org/documentation/howtos.en.html</ulink>.
de: Alle Details, wie ein Schlüsselpaar erzeugt wird und wie damit umgegangen wird, können nicht in diesem Dokument erklärt werden. Ein kleine Anleitung darüber finden Sie hier: <ulink url="http://www.gnupg.org/documentation/howtos.en.html">http://www.gnupg.org/documentation/howtos.en.html</ulink>.

source: Setting the keys in &kappname;
de: Die Schlüssel in &kappname; einstellen

source: On the encryption page of the settings dialog, there is a drop down list where you can select the key that should be used for encryption and decryption. Additionally you can find a field where you can enter the key-id of a key not in the listbox. You can use either the key-id, the email address associated with this key, or any other valid GPG key identification as the value for this field. When you enter the key-id, &kappname; will check its validity and display a green LED icon in the dialog if a key is found.
de: Auf der Seite "Verschlüsselung" im Einrichtungsdialog ist eine Auswahlliste zu finden, aus der der zu verwendende Schlüssel ausgewählt werden kann. Zusätzlich befindet sich dort ein Feld zur Eingabe einer Schlüssel-ID eines nicht im Listenfeld vorhandenen Schlüssels. Man kann entweder die Schlüssel-ID, die mit einem Schlüssel verbundene E-Mail-Adresse oder eine andere gültige GPG-Schlüssel-Identifikation eingeben. Wenn Sie eine Schlüssel-ID eingegeben haben, prüft &kappname; die Gültigkeit und zeigt ein grünes LED Symbol an, wenn der Schlüssel gefunden werden konnte.

source: Make sure you have both the public and the private key for this id. If you do not own the private key for the id entered, you will not be able to open the file again.
de: Stellen Sie sicher, dass Sie sowohl den öffentlichen als auch den privaten Schlüssel für die gewählte ID besitzen. Wenn Sie den privaten Schlüssel der ID nicht besitzen, ist es nicht mehr möglich, die Datei wieder zu öffnen.

source: The &kappname; recover key
de: Der &kappname;-Wiederherstellungsschlüssel

source: Also on this page of the settings dialog you have the choice of selecting supplemental encryption with the &kappname; recover key. This option is available to you if that key is stored in your <application>GPG</application> keyring. Selecting this option will allow you to recover your data even in the case you lose your own private key. This is possible because the data is not only encrypted for your own key, but also for the &kappname; recover key. This key is only available to selected &kappname; developers (at the time of writing only to the author). As of the release of &kappname; version 4.7, the recover key is set to expire on 3 January 2015.
de: Auf der gleichen Einstellungsseite haben Sie die Möglichkeit, eine zusätzliche Verschlüsselung mit dem &kappname;-Wiederherstellungsschlüssel anzuwenden. Diese Option ist verfügbar, wenn der Schlüssel in Ihrem <application>GPG</application>-Schlüsselbund abgelegt ist. Das Anwählen dieser Option erlaubt es Ihnen, Ihre Daten wiederherzustellen, falls Sie einmal Ihren privaten Schlüssel verlieren sollten. Dies ist möglich, da die Daten nicht nur für Ihren Schlüssel, sondern zusätzlich für den &kappname;-Wiederherstellungsschlüssel verschlüsselt werden. Dieser Schlüssel ist nur ausgewählten &kappname; Entwicklern zugänglich. In &kappname; Version 4.7 läuft dieser Schlüssel am 03. Januar 2015 ab.

source: Under normal circumstances, you will open/save/close your file as usual. In the abnormal case of loss of your key, you have the chance to contact one of the developers who has access to the &kappname; recover key and request help to recover your data. You may contact the developers via email to the &kappname; developer mailing list at &devlist;.
de: Unter normalen Umständen werden Sie Ihre Datei wie gewohnt öffnen, speichern und schließen. Im Fall des Verlustes Ihres Schlüssels haben Sie die Möglichkeit, Kontakt zu einem der Entwickler aufzunehmen, der Zugriff auf den &kappname;-Wiederherstellungsschlüssel hat und ihn um Hilfe zur Wiederherstellung Ihrer Daten zu bitten. Sie können die Entwickler per E-Mail über die &kappname; Entwickler-Mailingliste erreichen (&devlist;).

source: Anonymous file
de: Anonymisierte Datei

source: This format is not intended to be used for normal data storage. It is supported so that in case of a problem, you can supply the &kappname; development team with your file without disclosing any of the confidential details in your financial data. For example, it changes institution, account, payee, and category names to strings such as "I000001" and "A000001," it makes similar changes to all data such as account numbers, and it also randomly changes the amounts of transactions.
de: Dieses Format ist nicht für den normalen Fall der Datenspeicherung gedacht. Es soll nur dann verwendet werden, um dem Entwicklerteam von &kappname; bei Fehler und Problemen Ihre Datei übergaben zu können, ohne alle Ihre vertraulichen Finanzdaten offenlegen zu müssen. In diesem Format werden zum Beispiel die Daten über Banken, Konten, Zahlungsempfänger und Kategorien in Texte wie „I000001“ und „A000001“ geändert. In ähnlicher Weise werden Daten wie Kontonummern verändert, auch die Beträge von Überweisungen werden zufällig verändert.

source: If instructed by the developers, use the <guimenuitem>Save as...</guimenuitem> menu item to store your data in anonymous format by selecting <literal role="filter">Anonymous files</literal> as the filter. This also changes the file extension to <literal role="extension">.anon.xml</literal>.
de: Werden Sie von den Entwickler aufgefordert, eine anonymisierte Datei zu schicken, speichern Sie Ihre Finanzdaten mit <guimenuitem>Speichern unter ...</guimenuitem> und stellen dabei als Filter <literal role="filter">Anonyme Dateien</literal> ein. Die so gespeicherte Datei hat die Erweiterung <literal role="extension">.anon.xml</literal>.

source: To verify that your problem still exists, reload this anonymized file and try to duplicate your problem. If the problem is still present, send the file to the developer mailing list at &devlist; for further investigation. If the problem does not show ... well, I don't want to think about this scenario right now.
de: Um zu überprüfen, ob Ihr Problem auch mit der anonymisierten Datei immer noch auftritt, laden Sie sie und versuchen Sie das Problem zu reproduzieren. Tritt der Fehler auch mit der anonymisierten Datei auf, schicken Sie diese an die Mailingliste der Entwickler &devlist; zur weiteren Untersuchung.
