Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/extragear-office/kmymoney_details-currencies.po
Languages: de

source: Currencies
de: Währungen

source: &kappname; supports the use of multiple currencies in different accounts. For example, you can set up a bank account in Euros, another in British Pounds, and still have your credit card account in US Dollars.
de: &kappname; unterstützt verschiedene Währungen in beliebigen Konten. Sie können &eg; ein Bankkonto in Euro, ein anderes in britischen Pfund und Ihr Kreditkartenkonto in US$ führen.

source: Base currency
de: Basis-Währung

source: Once you create a &kappname; file, you will be asked for the base currency. The base currency is the one that all income and expense categories use and that reports will be based on. Usually, the base currency is the currency you use in your country. If not otherwise selected, new accounts will use this currency as the default.
de: Sobald Sie eine neue &kappname;-Datei anlegen, müssen Sie die Basis-Währung dieser Datei angeben. Die Basis-Währung wird von allen Einnahmen- und Ausgabenkategorien, sowie in den Berichten verwendet. Üblicherweise ist die Basis-Währung diejenige, die in Ihrem Land verwendet wird. Wenn keine andere ausgewählt wird, wird immer die Basis-Währung verwendet, wenn ein neues Konto in &kappname; angelegt wird.

source: The select currency dialog
de: Der Dialog Währungen

source: select currency
de: Währung auswählen

source: Adding a new currency
de: Eine neue Währung hinzufügen

source: Account setup
de: Kontoeinrichtung

source: If you create a new account you have the option to specify the currency in which it will be managed. The ledger for the account will then show all values in the selected currency. The new account wizard defaults this setting to the <link linkend="details.currencies.basecurrency">base currency</link>.
de: Wenn Sie ein neues Konto anlegen, können Sie die Währung auswählen, in der das Konto geführt werden soll. Das Kontenbuch dieses Kontos wird dann alle Beträge in der gewählten Währung anzeigen. Der Assistent für das Anlegen eines Kontos setzt standardmäßig die <link linkend="details.currencies.basecurrency">Basis-Währung</link> als Vorgabewert.

source: Entering transactions using different currencies
de: Buchungen mit anderen Währungen eingeben

source: Whenever a transaction is entered that refers to more than one currency, the exchange rate editor pops up and allows you to enter an exchange rate. Initially, the current price available from the price database will be used as exchange rate. See <link linkend="details.currencies.prices">Entering exchange rates for currencies</link> for more information on how to provide exchange rates manually and obtain online price information.
de: Sobald eine Buchung eingegeben wird, die mehrere Währungen enthält, öffnet sich der Währungskurs-Editor und erlaubt Ihnen das Eingeben eines Wechselkurses. Als Vorgabe wird der Wechselkurs aus der Preisdatenbank verwendet. Schauen Sie unter <link linkend="details.currencies.prices">Wechselkurse eingeben</link> für weitere Informationen, wie Sie Wechselkurse manuell eingeben oder Online-Informationen einbinden können.

source: Optionally, the exchange rate is saved in the price database once entered by the user.
de: Optional wird der Wechselkurs in der Preisdatenbank gespeichert, sobald er vom Benutzer eingegeben wurde.

source: Exchange rates for currencies
de: Wechselkurse für Währungen

source: Entering prices manually
de: Preise manuell eingeben

source: The price database editor allows you to enter exchange rates between currencies or prices for investments. You can pull it up using the <menuchoice><guimenu>Tools</guimenu><guimenuitem>Prices...</guimenuitem></menuchoice> menu option.
de: Der Preiseditor erlaubt es Ihnen, Wechselkursraten zwischen verschiedenen Währungen oder Preise für Anlagen einzugeben. Sie können ihn über das Menü <menuchoice><guimenu>Extras</guimenu><guimenuitem>Preise ...</guimenuitem></menuchoice> öffnen.

source: Currency Price Editor
de: Währungskurs-Editor

source: In &kappname; a <quote>Price</quote> is the price of one currency in terms of a second currency. For example, as I write this, the price of 1 USD in terms of 1 EUR is 0.83; that is, 1 USD costs 0.83 EUR. The first currency is the one being bought or sold, and the second one is the currency used to buy or sell it.
de: In &kappname; ist ein <quote>Preis</quote> der Preis einer Währung im Verhältnis zu einer zweiten Währung. Nehmen wir ein Beispiel: das Verhältnis zwischen 1 US$ und 1 EUR ist 0,83: das bedeutet, dass 1 US$ 0,83 EUR kostet. Die erstgenannte Währung ist diejenige, die ge- oder verkauft wird und die zweite Währung ist diejenige die verwendet wird, um zu kaufen oder zu verkaufen.

source: When you press the <guibutton>New</guibutton> button, you get the New Price Entry dialog. Enter the first currency (USD in the example above) in the Security field. Enter the second currency (EUR in the example above) in the Currency field. Enter the effective date of the price in the Date field.
de: Wenn Sie den Knopf <guibutton>Neu</guibutton> drücken, öffnet sich ein Dialogfenster zum Eingeben eines neuen Preises. Geben Sie die erste Währung ein (US$ in dem Beispiel oben) in das Feld "Wertpapier". Die zweite Währung (EUR in unserem Beispiel) in das Eingabefeld "Währung". In das Datums-Feld geben Sie den Tag des Wechselkurses ein.

source: New Price Entry
de: Neuer Kurs

source: Online currency updates
de: Online-Aktualisierung von Wechselkursen

source: &kappname; will fetch currency conversions from the web. Once you have entered a single price for a pair of currencies, the online quote feature will always list that pair amongst its options.
de: &kappname; holt hier Wechselkurse aus dem Internet. Sobald Sie einen einzelne Preis für ein Währungspaar eingetragen haben, listet es die Online-Kursnotiz-Funktion gegen die möglichen Optionen.

source: See the section on <link linkend="details.investments.onlinequotes">Online Price Quotes</link> in the Investments chapter for more details.
de: Im Abschnitt <link linkend="details.investments.onlinequotes">Online-Kursnotizen</link> des Kapitels Wertpapiere finden Sie weitere Details.
