Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/extragear-office/kmymoney_details-institutions.po
Languages: de

source: Institutions
de: Geldinstitute

source: The Institutions screen provides a summary of all the accounts grouped under their respective institutions. Asset accounts are symbolized with a black arrow, and liability accounts are symbolized with a red arrow.
de: Die Ansicht "Geldinstitute" zeigt alle Konten gruppiert nach den eingetragenen Geldinstituten. Anlagenkonten sind mit einem schwarzen, Verbindlichkeitenkonten mit einem roten Pfeil gekennzeichnet.

source: The Institutions screen displays several columns, including the type of account and the value of each account. It also shows the total value of all accounts in each institution.
de: Diese Ansicht enthält mehrere Spalten, wie den Kontentyp und den Kontostand jedes Kontos. Die Ansicht zeigt darüber hinaus auch die Gesamtsumme aller Konten eines Geldinstituts.

source: <screeninfo>institution view</screeninfo>
de: <screeninfo>Ansicht „Geldinstitute“</screeninfo>

source: <phrase>institution view</phrase>
de: <phrase>Ansicht „Geldinstitute“</phrase>

source: Institution Options
de: Einstellungen für Geldinstitut

source: Right-clicking an institution name brings up an Institution Options sub-menu, providing you with several choices. Selecting <guimenuitem>New Institution...</guimenuitem> opens the New Institution Dialog, where you can enter all the necessary information to create a new institution. Selecting <guimenuitem>Edit Institution...</guimenuitem> brings up an editable window with institution details such as name and address. Selecting <guimenuitem>Delete Institution</guimenuitem> removes the entire institution and all its associated accounts. Keep in mind that you will only be able to delete an institution if you can delete all of its accounts, and you will only be able to delete each associated account if it has no transactions and no schedules refers to it. Selecting <guimenuitem>New account...</guimenuitem> steps you through the new account process, which is described in more detail in the next section.
de: Ein rechter Mausklick auf den Namen eines Geldinstituts zeigt ein Untermenü mit mehreren Optionen. Der Menüpunkt <guimenuitem>Neues Geldinstitut ...</guimenuitem> öffnet das Dialogfenster zum Anlegen eines neuen Geldinstituts, in dem Sie alle notwendigen Informationen der neuen Bank eingeben können. Mit <guimenuitem>Geldinstitut bearbeiten ...</guimenuitem> können Sie die Details, wie Name und Adresse, des angewählten Instituts ändern. Über <guimenuitem>Geldinstitut löschen</guimenuitem> kann des Geldinstitut samt allen zugeordneten Konten aus &kappname; komplett gelöscht werden. Beachten Sie, dass Sie ein Kreditinstitut nur löschen können, wenn auch alle zugeordneten Konten gelöscht werden können. Dies ist nur möglich, wenn die Konten keine Buchungen beinhalten und ihnen keine geplanten Buchungen zugeordnet sind. Über <guimenuitem>Neues Konto ...</guimenuitem> gelangen Sie in den Assistenten zum Anlegen neuer Konten, der im nächsten Abschnitt näher beschrieben wird.

source: <screeninfo>Institution options sub-menu</screeninfo>
de: <screeninfo>Kontextmenü „Geldinstitut“</screeninfo>

source: <phrase>Institution options sub-menu</phrase>
de: <phrase>Kontextmenü „Geldinstitut“</phrase>

source: <title>New Institution</title>
de: <title>Neues Geldinstitut</title>

source: <phrase>New Institution</phrase>
de: <phrase>Neues Geldinstitut</phrase>

source: NOTE: You must have a file open before you can create a new institution. If you do not have an existing file, you will need to create a <link linkend="firsttime.3">new file</link>.
de: Hinweis: Sie müssen eine Datei geöffnet haben, bevor Sie ein neues Geldinstitut anlegen können. Wenn Sie keine vorhandene Datei zur Verfügung haben, müssen eine <link linkend="firsttime.3">neue Datei</link> erzeugen.

source: Only the name is required in the New Institution Dialog, all other fields are optional. As with the personal information dialog, this data is not currently used by &kappname;, but will be required by future releases for certain features. In particular, the Routing Number and the <acronym><ulink url="http://en.wikipedia.org/wiki/ISO_9362">BIC (Bank Identifier Code)</ulink></acronym> will be required for online banking.
de: Die Eingabe eines Namens für das neue Geldinstitut ist obligatorisch, die übrigen Felder sind optional. Genauso wie die Daten aus dem Eingabedialog für die persönlichen Informationen, werden auch die Daten des neuen Geldinstituts derzeit von &kappname; nicht verwendet. Dies wird sich in zukünftigen Versionen aber ändern, so wird zukünftig auf die Bankleitzahl (BLZ) und die <acronym><ulink url="http://en.wikipedia.org/wiki/ISO_9362">BIC (Bank Identifier Code)</ulink></acronym> für das Online-Banking zurückgegriffen.

source: Account Options
de: Konto-Einstellungen

source: Right-clicking an account name brings up an Account Options sub-menu. Selecting <guimenuitem>New account...</guimenuitem> steps you through the new account process. Selecting <guimenuitem>Open Ledger</guimenuitem> brings you directly to the Ledgers view or Investments view, depending on the account type. Simply double-clicking an account name also opens the account. Selecting <guimenuitem>Edit account</guimenuitem> brings up a window allowing you to change an account's name, start date, associated banking institution, and parent account. Deleting an account is only possible if there are no transactions associated with that account. Selecting <guimenuitem>Reconcile...</guimenuitem> opens up the Reconcile Wizard, which steps you through the process of comparing your bank account statements to your electronic entries. More details, as well as information about the other options is presented in the appropriate sections of this manual.
de: Ein rechter Mausklick auf einen Kontennamen öffnet ein Kontextmenü. Durch die Auswahl von <guimenuitem>Neues Konto ...</guimenuitem> öffnet sich der Assistent für neue Konten. Mit <guimenuitem>Kontenbuch öffnen</guimenuitem> gelangen Sie direkt zum Kontenbuch oder zur Investitionenliste, abhängig vom Kontentyp. Das gleiche geschieht bei einem Doppelklick auf den Kontennamen. Durch den Menüpunkt <guimenuitem>Konto bearbeiten ...</guimenuitem> öffnet sich ein Dialogfenster, in dem Sie den Kontennamen, das Eröffnungsdatum, das zugeordnete Geldinstitut und das Elternkonto ändern können. Ein Konto kann nur gelöscht werden, wenn es keine Buchungen mehr enthält. Das Auswählen von <guimenuitem>Abgleichen ...</guimenuitem> öffnet den Abgleich-Assistenten, worüber Sie Schritt für Schritt die Buchungen Ihres Bankkontoauszugs mit denen in Ihrem Kontenbuch vergleichen können. Weitere Informationen hierzu, sowie Informationen über die anderen Optionen finden Sie in dem entsprechenden Kapitel dieses Handbuchs.

source: <screeninfo>account options sub-menu</screeninfo>
de: <screeninfo>Kontextmenü „Konto“</screeninfo>

source: <phrase>account options sub-menu</phrase>
de: <phrase>Kontextmenü „Konto“</phrase>
