Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/extragear-office/kmymoney_details-forecast.po
Languages: de

source: Forecast
de: Vorhersage

source: What is a Forecast?
de: Was ist eine Vorhersage?

source: In &kappname;, a Forecast is a prediction of the balances of Accounts during a specified future period of time.
de: In &kappname; ist eine Vorhersage eine Vorausberechnung der Kontostände von Konten während des angegebenen Zeitraums in der Zukunft.

source: Forecasts can be predicted using one of two methods.
de: Vorhersagen können durch eine von zwei Methoden berechnet werden.

source: Scheduled and Future Transactions
de: Geplante und zukünftige Buchungen

source: &kappname; uses a combination of future transactions already entered into the ledgers and the entries in the Schedule.
de: &kappname; verwendet eine Kombination aus zukünftigen Buchungen, die bereits im Kontenbuch eingetragen sind, sowie den Einträgen unter geplanten Buchungen.

source: History-based
de: Vergangenheitsbasiert

source: &kappname; uses values from past transactions in the ledgers to predict future transactions.
de: &kappname; verwendet Werte aus vergangenen Buchungen im Kontenbuch um zukünftige Buchungen zu berechnen.

source: The forecast method and forecast period can be set in the &kappname; Settings, in the Forecast pane.
de: Die Vorhersagemethode und der Vorhersagezeitraum lässt sich in den Einstellung von &kappname; auf der Seite „Vorhersage“ wählen.

source: &kappname; Forecast provides a summary, showing the predicted balances at account cycle dates and the expected difference between the starting and ending balances. The length of the account cycle can be set by the user. The summary also displays messages about significant predicted changes to the accounts during the forecast period.
de: Die Vorhersage erstellt eine Zusammenfassung bestehend aus den vorhergesagten Kontoständen zu den Abrechnungszeitpunkten der Konten, sowie der erwarteten Differenz der Kontostände zwischen Beginn und Ende des Vorhersagezeitraums. Die Länge der Abrechnungszeitpunkte können vom Benutzer angegeben werden. Die Zusammenfassung zeigt auch entsprechende Warnungen, wenn signifikante Änderungen der Kontostände innerhalb des Vorhersagezeitraums errechnet werden.

source: As well as the summary, &kappname; Forecast also allows you to view day-by-day balances and view the minimum and maximum balances for each forecast account cycle.
de: Neben der Zusammenfassung erlaubt es die Vorhersage auch tagesaktuelle Kontostände, sowie Minimal- und Maximalkontostände für jeden Abrechnungszeitraum zu ermitteln und anzuzeigen.

source: By default the Forecast is created for 90-days, with 30-day account cycles using Scheduled and Future Transactions.
de: Standardmäßig wird die Vorhersage für 90 Tage erstellt mit Abrechnungszeitraum für das Konto von 30 Tagen unter Verwendung der Methode mittels geplanter und zukünftiger Buchungen.

source: Viewing Forecasts
de: Vorhersagen anzeigen

source: You can view a Forecast by clicking the appropriate icon in the navigation pane at the left hand side of your &kappname; window.
de: Sie können eine Vorhersage anzeigen, indem Sie das entsprechende Symbol in der Navigationsleiste auf der linken Seite des &kappname;-Fensters anklicken.

source: The Forecast window is split into five tabs
de: Das Vorhersagebereich ist in fünf Karteikarten unterteilt.

source: Summary Tab
de: Karteikarte „Zusammenfassung“

source: The Summary tab is split vertically into two halves.
de: Das Unterfenster "Zusammenfassung" ist vertikal in zwei Hälften geteilt.

source: Account Summary
de: Kontozusammenfassung

source: The Account Summary contains a grid displaying a row of information for each Asset and Liability.
de: Die Kontozusammenfassung zeigt in jeder Zeile Informationen für jede Anlage und Verbindlichkeit.

source: The following columns are displayed:
de: Die folgenden Spalten sind zu sehen:

source: Account
de: Konto

source: The name of the Asset or Liability account
de: Der Name des Anlage- oder Verbindlichkeitenkontos

source: Current Balance (Current)
de: Aktuell

source: The current balance of the account is displayed.
de: Der aktuelle Kontostand des angezeigten Kontos.

source: Account Cycle Balance
de: Abrechnungszeitraum, z.B. "30 Tage"

source: The Forecast period is split into account cycles. The default account cycle length is 30 days, but can be set by the user.
de: Der Vorhersagezeitraum ist aufgeteilt in Kontozyklen (Abrechnungszyklen). Der standardmäßige Abrechnungszeitraum beträgt 30 Tage, kann aber vom Benutzer geändert werden.

source: The first account cycle date is the first Forecast date. By default this is the current date plus one account cycle, but can change depending on the "Day of Month to start Forecast" setting.
de: Der erste Tag des Abrechnungszyklus ist der erste Vorhersagetag. Standardmäßig ist dies der heutige Tag plus einem Abrechnungszyklus, was aber abhängig von der Einstellung "Start-Tag (des Monats) der Vorhersage" variieren kann.

source: Remaining account cycle dates are determined by adding the account cycle length to the previous account cycle date. This is continued until the calculated account cycle date would be beyond the Forecast period.
de: Verbleibende Abrechnungszyklus-Daten werden ermittelt, indem zum vorherigen Abrechnungszyklus-Datum ein weiterer Abrechnungszyklus hinzugezählt wird. Dies wiederholt sich, bis das errechnete Abrechnungszyklus-Datum hinter dem Vorhersagezeitraum liegt.

source: For each account cycle date the predicted balance is displayed.
de: Für jeden Abrechnungszyklus wird der errechnete Kontostand angezeigt.

source: Total Variation
de: Gesamtvariation

source: The rightmost column displays the predicted difference in value between the balances at the start and end of the forecast. If the predicted end value of the account (in terms of net worth) is less than the start value the whole row is highlighted in red.
de: Die Spalte ganz rechts zeigt die berechnete Differenz der Werte zwischen den Kontoständen am Anfang und am Ende der Vorhersage. Wenn der vorhergesagte Endsaldo des Kontos (im Sinne des Eigenkapitals) geringer ist als der Startsaldo, wird die gesamte Zeile rot hervorgehoben.

source: Key Summary Information
de: Schlüsselinformationen der Zusammenfassung

source: The bottom half of the Summary tab displays noteworthy information about accounts. This includes:
de: Die rechte Hälfte der Karteikarte "Zusammenfassung" zeigt einige nennenswerte Informationen über die Konten. Dazu gehören:

source: Assets below zero
de: Anlagen im Soll

source: A message is displayed for any asset for which the value starts or will drop below zero during the forecast period.
de: Eine Nachricht wird für alle Anlagen angezeigt, deren Salden während der Vorhersageperiode unter 0 sinken oder unter 0 starten.

source: Liabilities above zero
de: Verbindlichkeiten im Haben

source: A message is displayed for any liability for which the value starts or will rise above zero during the forecast period. Note that the value of a liability is the negative of its ledger balance, since a positive balance indicates money owed.
de: Für alle Verbindlichkeiten, deren Salden während der Vorhersageperiode über 0 steigen, oder über 0 starten, wird ebenfalls eine Meldung ausgegeben. Beachten Sie, dass der Wert einer Verbindlichkeit der negierte Wert der Kontenbuch-Saldos ist, während eine positiver Betrag bedeutet, dass Geld geschuldet wird.

source: Details Tab
de: Die Karteikarte "Details"

source: The Details tab contains a grid displaying a row of information for each Asset and Liability.
de: Die Karteikarte "Details" enthält eine Tabelle mit Informationen zu jeder Anlage und jeder Verbindlichkeit pro Zeile.

source: Dates
de: Daten

source: For each date in the Forecast period a column displays the predicted balance of the account on that date. The date columns are in ascending order from left to right.
de: Für jedes Datum der Vorhersageperiode wird eine Spalte erzeugt, die den vorausberechneten Kontostand an diesem Tag zeigt. Die Datum-Spalten sind aufsteigend von links nach rechts sortiert.

source: Advanced Tab
de: Karteikarte "Erweitert"

source: The Advanced tab contains a grid displaying a row of information for each Asset and Liability. The information is split into columns as follows:
de: Unter "Erweitert" werden pro Zeile Informationen für alle Verbindlichkeiten und Anlagen angezeigt. Die Informationen befinden sich in folgenden Spalten:

source: Minimum Account Cycle Balance
de: Minimal-Saldo

source: For each account cycle number &lt;n&gt; in the Forecast period the following columns are displayed:
de: Für jeden Abrechnungszyklus &lt;n&gt; des Vorhersagezeitraums werden die folgenden Spalten angezeigt:

source: Minimum Balance (Min Bal &lt;n&gt;)
de: Minimal-Saldo &lt;n&gt;

source: The minimum predicted balance during the account cycle
de: Der minimale vorhergesagte Kontostand im Abrechnungszyklus

source: Minimum Balance Date (Min Date &lt;n&gt;)
de: Minimal-Datum &lt;n&gt;

source: The date on which the balance reaches its predicted minimum.
de: Das Datum, an dem der Kontostand das errechnete Minimum erreicht.

source: Maximum Account Cycle Balance
de: Maximaler Kontostand innerhalb des Abrechnungszyklus.

source: Maximum Balance (Max Bal &lt;n&gt;)
de: Maximal-Saldo &lt;n&gt;

source: The maximum predicted balance during the account cycle
de: Der maximale berechnete Kontostand während des Abrechnungszyklus

source: Maximum Balance Date (Max Date &lt;n&gt;)
de: Maximal-Datum &lt;n&gt;

source: The date on which the balance reaches its predicted maximum.
de: Das Datum, an dem der Saldo das vorausgesagte Maximum erreicht.

source: Average
de: Mittelwert

source: The average balance of the account during the forecast period
de: Der mittlere Kontostand während der Vorhersagezeitraums.

source: Budget Forecast Tab
de: Die Karteikarte Budget-Vorhersage

source: The Budget tab displays a forecast calculation for the Income and Expense categories. The columns are similar to the Summary and Detailed tabs.
de: Auf dieser Karteikarte wird eine Berechnung der Vorhersage für Einnahmen und Ausgaben als Tabelle angezeigt. Es werden ähnliche Spalten wie auf den Karteikarten Zusammenfassung und Details verwendet.

source: Chart Tab
de: Die Karteikarte Diagramm

source: It displays a chart showing the forecast. The level of detail varies depending on the detail level selected on the option above.
de: Hier wird ein Diagramm mit der grafischen Darstellung der Vorhersage angezeigt. Den Umfang und die Detaillierung des Diagramms legen Sie mit den Einstellungen oben im Fenster fest.
