Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/extragear-office/kmymoney_details-investments.po
Languages: de

source: There are two ways of updating the prices for your investments. You can either enter the new price manually or have &kappname; fetch it from the web.
de: Es gibt zwei Möglichkeiten, um Preise für Ihre Investitionen zu aktualisieren. Sie können entweder die neuen Preise von Hand eingeben oder sie &kappname; aus dem Internet holen lassen.

source: Manual Price Updates
de: Manuelle Preisaktualisierung

source: You can enter prices for your investments using the same <link linkend="details.currencies.prices">Price Editor</link> as used for currencies.
de: Sie können Preise für Ihre Investitionen mit dem gleichen <link linkend="details.currencies.prices">Preis-Editor</link> wie für Währungen eingeben.

source: Online Price Quotes
de: Online-Kursnotizen

source: &kappname; has the ability to download the latest prices for your investments and currencies via the web.
de: &kappname; kann die aktuellen Preise Ihrer Investitionen und Währungen aus dem Internet herunterladen.

source: How Online Quotes Work
de: Wie Online-Kursnotizen funktionieren

source: At your request, &kappname; will fetch a page from the web that contains the latest price for each item. By default, prices are fetched from <ulink url="http://finance.yahoo.com">finance.yahoo.com</ulink>, and are subject to the terms and conditions of that site.
de: Auf Anforderung lädt &kappname; eine Seite aus dem Internet mit den neuesten Preisen für alle Einträge. Als Voreinstellung werden die Preise von <ulink url="http://finance.yahoo.com">finance.yahoo.com</ulink> heruntergeladen und unterliegen den allgemeinen Geschäftsbedingungen dieser Seite.

source: The online quote lookup uses the investment's trading symbol to find the price. Therefore, it's important to set the symbol correctly. Yahoo supports stocks from most major world markets, so it's usually just a matter of finding the correct symbol. For example, TietoEnator trades on the Stockholm Stock Exchange market, and its Yahoo symbol is TIEN.ST.
de: Die Online-Kursnotizen suchen über das Handelssymbol der Investition nach dem aktuellen Preis. Deshalb muss das richtige Symbol benutzt werden. Auf Yahoo finden Sie Aktien für die meisten Weltmärkte, daher müssen Sie nur das richtige Symbol finden. TietoEnator zum Beispiel wird an der Stockholmer Börse gehandelt und das auf Yahoo benutzte Symbol dafür ist TIEN.ST.

source: To find the trading symbol for a security supported by Yahoo, use the <quote>Symbol Lookup</quote> feature at <ulink url="http://finance.yahoo.com">finance.yahoo.com</ulink>.
de: Um das Börsensymbol eines bei Yahoo geführten Wertpapiers zu finden, benutzen Sie die Funktion <quote>Symbol Lookup</quote> auf der Internetseite <ulink url="http://finance.yahoo.com">finance.yahoo.com</ulink>.

source: Assigning a Quote Source
de: Zuweisung einer Kursnotiz-Quelle

source: In order to get online price quotes, you first have to enable it for each investment or currency you want updated, by setting a <quote>Online Quote Source</quote>. This is the name of the service from which the quote should be fetched. &kappname; ships with several sources to choose from. Yahoo is the recommended default source, and should work for most investments and all currencies.
de: Um Online-Preise verwenden zu können, müssen Sie zuerst für jede Investition oder Währung eine <quote>Online-Quelle</quote> angeben. Das ist der Name des Dienstes, der die Preise zu Verfügung stellt, &kappname; enthält mehrere Quellen zur Auswahl. Es wird empfohlen, Yahoo als Standardquelle zu verwenden. Diese Quelle sollte für die meisten Investitionen und alle Währungen funktionieren.

source: To assign a quote source to an investment, navigate to the investment summary view for the account in which the security is held. Edit the security by right-clicking it and selecting <guimenuitem>Edit Investment ...</guimenuitem>. In the Investment Detail Wizard, click <guibutton>Next</guibutton> twice, for the Online Update section. In the Online source dropdown box, select the online source.
de: Um einer Investition eine Online-Quelle zuzuweisen, gehen Sie zur Investitions-Ansicht des Kontos für das Wertpapier. Öffnen Sie das Kontextmenü mit der &RMBn; und wählen Sie <guimenuitem>Investition bearbeiten ...</guimenuitem>. Im „Investitionendetail-Assistent“ drücken Sie zweimal auf <guibutton>Weiter</guibutton>, um zur Seite mit den Online-Quellen zu kommen. Wählen Sie hier im Auswahlfeld <guilabel>Online-Quelle</guilabel> eine neue Einstellung.

source: Versions of &kappname; starting with 0.9 contain support for the Finance::Quote package for obtaining online quotes. This is intended primarily as a convenience for those users converting from the GnuCash finance package, which uses it as its native method. If you do select this option, you should see a different list of sources, those supported by Finance::Quote. If the list is empty, it suggests that the package is not properly installed. See their web site at <ulink url="http://finance-quote.sourceforge.net"> http://finance-quote.sourceforge.net</ulink> for more information.
de: Ab Version 0.9 kann &kappname; Onlinekurse mit dem Paket Finance::Quote herunterladen. Dies ist in erster Linie für Benutzer gedacht, die Daten aus dem Finanzprogramm GnuCash importieren. GnuCash verwendet das Paket Finance::Quote als Standardmethode für Onlinekurse. Wenn Sie diese Einstellung auswählen, wird eine andere Liste mit Onlinequellen für das Paket Finance::Quote angezeigt. Ist diese Liste leer, dann ist das Paket wahrscheinlich nicht richtig installiert. Weitere Informationen zu diesem Paket finden Sie auf der Webseite <ulink url="http://finance-quote.sourceforge.net"> http://finance-quote.sourceforge.net</ulink>.

source: Adjusting a quote
de: Anpassung der Kursnotiz-Quellen

source: Some online sources do not report the price in a base quantity (&eg;, EUR) but in a fraction (&eg;, Cent). Using this information as price will produce wrong values for your investments.
de: Einige Online-Quellen geben den Preis nicht in einer Basiseinheit wie &eg; EUR, sondern in Untereinheiten wie &eg; Cent an. Mit dieser Information als Preis ergeben sich falsche Werte für Ihre Investitionen.

source: If this is the case for your online source, you can use the <guilabel>Factor</guilabel> field to enter an adjusting factor. For the above mentioned example the factor would be 0.01.
de: Trifft das auf Ihre Online-Quelle zu, dann können Sie das Feld <guilabel>Faktor</guilabel> zur Anpassung verwenden. Im oben genannten Beispiel muss ein Faktor von 0,01 eingegeben werden.

source: The <guilabel>Factor</guilabel> field is only available if a <guibutton>Quote Source</guibutton> has been selected.
de: Das Feld <guilabel>Faktor</guilabel> kann nur dann ausgewählt werden, wenn eine <guibutton>Kursnotiz-Quelle</guibutton> ausgewählt wurde.

source: Fetching Quotes
de: Kursnotizen abrufen

source: Typically, you will update the prices for all your investments and currencies at once. Choose the <menuchoice><guimenu>Tools</guimenu><guimenuitem>Update Stock and Currency Prices...</guimenuitem></menuchoice> menu option to bring up the online price quotes dialog. Press <guibutton>Update All</guibutton> to fetch quotes for all investments and currencies in your &kappname; file.
de: Normalerweise werden Sie die Preise für alle Ihre Investitionen und Währungen auf einmal aktualisieren. Wählen Sie <menuchoice><guimenu>Extras</guimenu><guimenuitem>Aktien- und Währungspreise aktualisieren ...</guimenuitem></menuchoice> aus dem Menü und öffnen Sie damit einen Dialog. Drücken Sie auf <guibutton>Alles aktualisieren</guibutton>, um die Kurse aller Investitionen und Währungen in Ihre &kappname;-Datei zu laden.

source: Update Stock and Currency Prices
de: Aktualisierung von Aktien- und Währungskursen

source: Online Stock and Currency Price Update
de: Aktualisierung von Aktien- und Währungskursen

source: Adding or Editing Quote Sources
de: Hinzufügen oder Bearbeiten von Kursnotiz-Quellen

source: Adding or editing quote sources is not recommended for anyone but the most technical user. You should feel comfortable reading HTML and writing complex regular expressions. If this doesn't sound like you, we recommend writing to the developer's list if none of the quote sources work for you. Ideally, please point us to a web page where these quotes can be obtained.
de: Das Hinzufügen oder Bearbeiten von Online-Quellen wird nur technisch erfahrenen Benutzern empfohlen. Sie sollten HTML-Quelltext verstehen und komplexe reguläre Ausdrücke entwickeln können. Haben Sie diese Kenntnisse nicht, schreiben Sie an die Mailingliste der Entwickler, wenn keine der Online-Quellen bei Ihnen richtig funktioniert. Geben Sie möglichst auch eine Webseite an, von der die Kurse heruntergeladen werden können.

source: If you do feel up to the challenge, here's how it works. The quote sources are contained in the settings dialog. Choose <menuchoice><guimenu>Settings</guimenu><guimenuitem>Configure &kappname;</guimenuitem></menuchoice>. From there, choose the <guilabel>Online Quotes</guilabel> section. You can choose an existing source to edit, or create a new one. When you are done with your changes, be sure to press the <guibutton>Update</guibutton> button before exiting the dialog. Your changes are not saved by default.
de: Die Online-Quellen finden Sie im Einrichtungsdialog. Wählen Sie <menuchoice><guimenu>Einstellungen</guimenu><guimenuitem>&kappname; einrichten ...</guimenuitem></menuchoice> und gehen Sie zur Seite <guilabel>Online-Kursnotizen</guilabel>. Sie können eine vorhandene Quelle zur Bearbeitung auswählen oder eine neue Quelle erstellen. Haben Sie alle Änderungen durchgeführt, müssen Sie auf <guibutton>Aktualisieren</guibutton> drücken, ehe Sie den Dialog beenden. Änderungen werden nicht automatisch gespeichert.

source: The first thing to worry about in an online quote source is the URL. This is the page that is fetched from the web. You will see a %1 in all sources, and a %2 in currency sources. For investments, %1 is replaced by the trading symbol. For currencies, %1 is replaced by the From currency, and %2 is replaced by the To currency. This URL is then fetched, all HTML tags are removed, and that stripped file is then sent to the page parser.
de: Als erstes müssen Sie sich mit der Adresse oder URL der Online-Kursnotizen befassen. Das ist die Adresse der Seite, die aus dem Internet geladen wird. Alle Quellen haben den Platzhalter „%1“ in der URL, Quellen für Währungskurse zusätzlich den Platzhalter „%2“. Bei Investitionen wird „%1“ durch das Handelssymbol ersetzt. Bei Währungskursen wird „%1“ durch den Kaufpreis und „%2“ durch den Verkaufspreis ersetzt. Die Webseite mit der angegebenen URL wird heruntergeladen, alle HTML-Tags werden entfernt und die verbleibende Datei wird an die Funktion übergeben, die die Preise aus der Seite ermittelt.

source: Note that the URL can also be a file: URL, which the quote fetcher takes to mean an executable script. It will pass any command-line arguments to it that you have specified, and feed the stdout to the page parser. For example, you might have a script called getquote.sh that contains custom quote logic, taking the symbol as a single parameter. Your URL would be <quote>file:/path/to/getquote.sh %1</quote>.
de: Beachten Sie, dass als URL auch eine ausführbare Datei angegeben werden kann. Dieser ausführbaren Datei werden alle eingetragenen Argumente übergeben und die Standardausgabe des Skripts wird an die Funktion zur Ermittlung der Preise übergeben. Sie können zum Beispiel ein eigenes Skript mit dem Namen „getquote.sh“ schreiben, das das Handelssymbol als Parameter übernimmt und den Preis ermittelt. Als URL muss dafür <quote>file:/path/to/getquote.sh %1</quote> eingegeben werden.

source: The page parser looks for a symbol, a date, and a price. Regular expressions tell it how to extract those items from the page. Please review the documentation for the <ulink url="http://qt-project.org/doc/qt-4.8/qregexp.html#1">QRegExp class</ulink> for the exact makeup of the regular expressions. There should be exactly one capture expression, surrounded by parentheses, in each regexp. The date format further tells the date parser the order of year, month, and day. This date format should always be in the form "%x %x %x". where x is y, m, or d. The date parser is very smart. <quote>%m %d %y</quote> will parse <quote>December 31st, 2005</quote> as easily as <quote>12/31/05</quote>. Two digit years are interpreted as being in the range of 1950-2049.
de: Die Funktion sucht nach einem Symbol, einem Datum und einem Preis. Reguläre Ausdrücke geben an, wie diese Werte aus den Daten der Seite ermittelt werden. Informationen über die hier verwendeten regulären Ausdrücke finden Sie auf der Seite <ulink url="http://qt-project.org/doc/qt-4.8/qregexp.html#1">QRegExp-Klasse</ulink>. In jedem regulären Ausdruck sollte genau ein zutreffender Ausdruck, der von Klammern eingeschlossen ist, enthalten sein. Das Datumsformat gibt außerdem die Reihenfolge von Jahr, Monat und Datum an. Dieses Format sollte immer in der Form „%x %x %x“ angeben werden, dabei ist x entweder y, m oder d. Die Funktion arbeitet ziemlich gut und kann mit <quote>%m %d %y</quote> sowohl <quote>December 31st, 2005</quote> als auch <quote>12/31/05</quote> richtig verarbeiten. Zweistellige Jahresangaben werden immer als Zeitraum von 1950-2049 angenommen.

source: Unimplemented Features
de: Fehlende Funktionen

source: Certain common features that are normally found with investments are not yet implemented in &kappname;. These include: Derivatives (options, futures, etc), capital gains, and tax reporting for investments.
de: Bestimmte häufig benutzte Funktionen für Investitionen sind noch nicht in &kappname; implementiert, insbesondere die Bearbeitung von Derivaten (Optionen, Termingeschäfte &etc;) und Steuerberichte über Investitionen.
