Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/extragear-office/kmymoney_details-impexp.po
Languages: de

source: Importing and Exporting
de: Importieren und Exportieren

source: GnuCash Importer
de: GnuCash-Import

source: GnuCash Files
de: GnuCash-Dateien

source: The &kappname; GnuCash importer handles direct reading of standard (&XML;) files as produced by GnuCash versions 1.8 and 2.0. The following are not supported:
de: Das GnuCash-Importmodul von &kappname; kann Standard-&XML;-Dateien von GnuCash Version 1.8 und 2.0 direkt einlesen. Die folgenden Formate können nicht importiert werden:

source: import of database (Postgres) data
de: Import aus Datenbanken (Postgres)

source: import of 'multi-book' files
de: Import von „multi-book“-Dateien

source: import into an existing &kappname; file
de: Import in eine vorhandene &kappname;-Datei

source: import of small-business specific features (Employees, Invoices, etc.)
de: Import von Funktionen für kleine und mittlere Unternehmen (Beschäftigte, Kunden, Rechnungen &etc;)

source: export to GnuCash files.
de: Export in GnuCash-Dateien

source: The import will probably only work correctly if presented with a valid file. It is recommended that the GnuCash <guimenuitem>Check &amp; Repair All</guimenuitem> function (in the <guimenu>Actions</guimenu> menu) be run before attempting to import.
de: Der Import funktioniert wahrscheinlich nur richtig, wenn eine gültige und fehlerfreie Datei angegeben wird. Es wird empfohlen, in GnuCash die Funktion <menuchoice><guisubmenu>Überprüfen</guisubmenu><guimenuitem>Alle überprüfen</guimenuitem></menuchoice> im Menü <guimenu>Aktionen</guimenu> vor dem Export aufzurufen.

source: Files can be opened by specifying the filename on the command line (<command>kmymoney &lt;path to file&gt;</command>), or by means of the &kappname; <menuchoice> <shortcut><keycombo>&Ctrl;<keycap>O</keycap></keycombo></shortcut> <guimenu>File</guimenu><guimenuitem>Open</guimenuitem> </menuchoice> or <menuchoice> <guimenu>File</guimenu><guimenuitem>Import</guimenuitem> </menuchoice> menu items.
de: Dateien können durch die Angabe des Dateinamens auf der Befehlszeile (<command>kmymoney &lt;pfad/zu/datei&gt;</command>), über das Menü mit <menuchoice> <shortcut><keycombo>&Ctrl;<keycap>O</keycap></keycombo></shortcut> <guimenu>Datei</guimenu><guimenuitem>Öffnen</guimenuitem> </menuchoice> oder mit <menuchoice> <guimenu>Datei</guimenu><guimenuitem>Importieren</guimenuitem> </menuchoice> geöffnet werden.

source: The similarity between the two products means that much day-to-day data can be imported in a straightforward fashion. However, there are some areas where differences arise, and various options are provided to deal with these. The following sections will describe some of these differences; understanding them should lead to a smoother importation.
de: Wegen der Ähnlichkeit zwischen beiden Programmen können viele alltägliche Daten ohne Probleme importiert werden. Es gibt jedoch einige Bereiche, die in beiden Programmen unterschiedlich verarbeitet werden. Dafür gibt es mehrere Einstellungen. Im Folgenden werden einige der Unterschiede erläutert, damit werden diese Unterschiede verständlich und können beim Import berücksichtigt werden.

source: Similarities, Differences, and Terminology
de: Ähnlichkeiten, Unterschiede und Fachausdrücke

source: Small Business Usage
de: Funktionen für kleine und mittlere Unternehmen

source: It should be noted that &kappname; is a <emphasis>personal</emphasis> finance manager, and as such, does not directly support any of the business features of GnuCash, such as tax tables, payroll, and tracking of lots. Any Accounts Payable or Receivable accounts found in a file will be imported as Liability or Asset accounts respectively.
de: &kappname; ist ein Finanzverwaltungsprogramm für den <emphasis>persönlichen</emphasis> Gebrauch, daher werden die geschäftlichen Funktionen in GnuCash wie Steuertabellen, Gehaltsabrechnungen und die Überwachung von Lieferungen nicht direkt unterstützt. Alle Verbindlichkeiten oder Forderungen in einer Datei werden als Verbindlichkeits- oder Anlagenkonto importiert.

source: Accounts
de: Konten

source: Account types
de: Kontenarten

source: For both products, the highest level of structure in the file is the account. &kappname; supports 5 main types of account: Asset, Liability, Income, Expense and Equity, each of which may have various subtypes, &eg;, Checking, Credit Card, &etc; &kappname; includes a 'standard' account for each of these five types, and all other accounts are held subordinate to one of these. &kappname; enforces more consistency (or less flexibility, depending on your point of view) between account types than does GnuCash, and the importer will correct any inconsistencies it detects. This may result in a slightly different account structure, though this can, within reason, be amended after the import is complete.
de: In beiden Produkten ist ein Konto die oberste Strukturebene in der Datei. &kappname; unterstützt fünf Hauptarten von Konten: Anlagen, Verbindlichkeiten, Einnahmen, Ausgaben und Eigenkapital. Jeder dieser Kontotypen kann mehrere Untertypen haben, &eg; Scheckkonto, Kreditkartenkonto &etc; &kappname; enthält ein Standardkonto mit allen fünf Kontentypen und alle anderen Konten werden diesen Konten untergeordnet. Dadurch erzwingt &kappname; mehr Konsistenz oder weniger Flexibilität, je nach Betrachtungsweise, zwischen den Kontentypen als GnuCash. Das Importmodul korrigiert alle erkannten Inkonsistenzen. Das kann zu einer geringfügig abweichenden Kontenstruktur führen, lässt sich aber innerhalb gewisser Grenzen nach dem Import korrigieren.

source: Categories
de: Kategorien

source: &kappname; uses the term Category to denote an account of an Income or Expense type. Unlike GnuCash, these are not considered as 'ledger' accounts, and entry of transactions folder into categories is not supported; allocations are made during transaction entry into other account types.
de: &kappname; benutzt den Begriff Kategorie für Konten vom Typ Einnahme oder Ausgabe. Anders als in GnuCash werden diese Konten nicht als reale Konten betrachtet, die Eingabe von Buchungen für Kategorien ist nicht möglich. Zuweisungen während der Buchungseingabe erfolgen für andere Kontentypen.

source: Structure and Placeholders
de: Strukturen und Platzhalter

source: GnuCash supports the use of Placeholder accounts. In effect, these are just read-only accounts into which no transactions can be entered, but which function in an analogous fashion to folders in a folder structure, as a holder for other accounts. Though &kappname; does not support this feature as such, it does provide a parent/child account relationship, so the importer simulates placeholders by creating empty accounts.
de: GnuCash verwendet Platzhalterkonten. Tatsächlich handelt es sich dabei um nur lesbare Konten, es können keine Buchungen eingegeben werden. Diese Konten funktionieren wie Ordner in einem Verzeichnis als Platzhalter für andere Konten. Obwohl &kappname; diese Funktion nicht direkt unterstützt, erstellt das Importmodul eine Kontenstruktur mit über- und untergeordneten Konten und simuliert diese Platzhalter, indem es leere Konten erstellt.

source: Account Type map
de: Zuordnung der Kontoart

source: GnuCash type
de: GnuCash-Typ

source: &kappname; type
de: &kappname;-Typ

source: Checking
de: Checking (Girokonto)

source: Savings
de: Savings (Sparkonto)

source: Asset
de: Asset (Anlagen)

source: Cash
de: Cash (Bargeld)

source: Stock
de: Stock (Wertpapier)

source: Equity
de: Equity (Eigenkapital)

source: Liability
de: Liability (Verbindlichkeiten)

source: CreditCard
de: CreditCard (Kreditkarte)

source: Income
de: Income (Einnahmen)

source: Expense
de: Expense (Ausgaben)

source: Transactions and Splits
de: Buchungen und Split-Buchungen

source: Balanced transactions
de: Ausgeglichene Buchungen

source: As with GnuCash, data is entered in the form of transactions, each generally consisting of 2 or more split entries. In fact, valid GnuCash transactions will always contain at least 2 splits, and to conform to GnuCash's double-entry bookkeeping standard, these must be in monetary balance (i.e., they must balance out to zero). &kappname; encourages, but does not enforce, this standard, but any imported transaction which is not balanced will be marked in the ledger view as having a problem.
de: Wie in GnuCash werden Daten als Buchungen eingegeben. Im Allgemeinen besteht jede Buchung aus zwei Einträgen. Gültige Buchungen in GnuCash bestehen immer aus mindestens zwei Einträgen, da eine doppelte Buchführung verwendet wird und beide Einträge wertmäßig ausgeglichen sein müssen. &kappname; unterstützt diesen Standard, er ist aber nicht zwingend erforderlich. Jede nicht ausgeglichene importierte Buchung wird im Kontenbuch als möglicherweise fehlerhaft markiert.

source: Payees
de: Zahlungsempfänger

source: &kappname; prefers that all transactions have a Payee (a generic term that encompasses both payees and payers), and unlike GnuCash, a list of these payees is maintained. Payee names are generated by the importer from the GnuCash transaction's Description field.
de: In &kappname; sollten alle Buchungen einen Zahler/Zahlungsempfänger haben und im Gegensatz zu GnuCash wird eine Liste der Zahler/Zahlungsempfänger geführt. Die Namen der Zahler/Zahlungsempfänger werden vom Importmodul aus der Beschreibung der GnuCash-Buchung generiert.

source: Transfers
de: Buchungen

source: &kappname; uses the term Transfer to describe a transaction which does not involve a Category, but only transfers money between Asset and/or Liability accounts.
de: In &kappname; wird der Begriff Umbuchung für eine Buchung benutzt, in der keine Kategorien betroffen sind. Dabei werden nur Geldbeträge zwischen Anlagen- und/oder Verbindlichkeitskonten verschoben.

source: Reconcile
de: Abgleichen

source: &kappname; provides an account reconciliation function similar to that of GnuCash, and the corresponding transaction status will be imported.
de: &kappname; enthält eine Abgleichfunktion wie GnuCash, der zugehörige Buchungsstatus wird importiert.

source: Commodities
de: Wertpapiere und Währungen

source: GnuCash uses the term Commodity to cover both currencies and non-currency assets. These are treated separately in &kappname;.
de: GnuCash benutzt den Begriff Waren sowohl für Währungen wie auch für Anlagen ohne Währung. In &kappname; werden beide gesondert behandelt.

source: Currencies
de: Währungen

source: &kappname; has built-in support for all foreign <link linkend="details.currencies">currency</link> types. &kappname; also requires that the user specify a base currency, this being the default currency for new accounts. The importer will attempt to determine the most likely base currency, though this choice may be rejected in favor of an alternative.
de: &kappname; kann alle ausländischen <link linkend="details.currencies">Währungen</link> verarbeiten. Es ist erforderlich, eine Basiswährung als Standard für neue Konten einzustellen. Das Importmodul versucht die wahrscheinlichste Basiswährung dafür zu ermitteln. Die vorgeschlagene Währung kann aber geändert werden.

source: (NOTE: &kappname; does not currently support accounts denominated in 'defunct' currencies (except those replaced by the Euro). At present, it will be necessary to remove any such accounts from your GnuCash file before importing. We hope to improve on this situation in a future release.)
de: Hinweis: In &kappname; kann zurzeit kein Konto in nicht mehr existierenden Währungen mit Ausnahme der durch den Euro ersetzten Währungen geführt werden. Daher müssen alle Konten mit solchen Währungen aus der GnuCash-Datei vor dem Export gelöscht werden.

source: Securities and Investments
de: Wertpapiere und Investitionen

source: Non-currency assets (normally stocks and bonds) are called Securities by &kappname;, and represent the main difference between the two products, in that &kappname; requires any account denominated in a security to be subordinate to an Investment Account. This is described in more detail in the chapter on <link linkend="details.investments">Investments</link>. Though users may have implemented such a relationship, GnuCash imposes no defined structure on it, so the importer is unable to detect it and perform an automatic conversion. Three options are therefore made available:
de: Anlagen ohne Währung, normalerweise Aktien und Anleihen, werden in &kappname; als Wertpapiere bezeichnet. Der wichtigste Unterschied zwischen den beiden Produkten besteht darin, dass in &kappname; jedes Wertpapierkonto einem Investitionskonto zugeordnet werden muss. Weitere Details dazu finden Sie im Kapitel <link linkend="details.investments">Investitionen</link>. Obwohl auch in GnuCash solche Beziehungen durch den Benutzer definiert werden können, enthält GnuCash keine definierten Strukturen dafür. Daher kann das Importmodul diese Beziehung nicht erkennen und führt eine automatische Umwandlung durch. Deshalb gibt es für diesen Fall folgende Optionen:

source: Create a separate Investment account for each security, with the same name as the security
de: Erstellen Sie ein eigenes Investmentkonto für jedes Wertpapier und geben Sie ihm den gleichen Namen wie das Wertpapier.

source: Create a single Investment account which will act as 'parent' for all security accounts
de: Erstellen Sie ein eigenes Investmentkonto, das als übergeordnetes Konto für alle Wertpapierkonten dient.

source: Create several Investment accounts, and assign securities to them as directed by the user.
de: Erstellen Sie mehrere Investmentkonten und weisen Sie ihnen nach Ihren Vorstellungen Wertpapiere zu

source: It depends entirely on user requirements which of these options is relevant in each situation, and in some cases, manual restructuring of accounts after importation may be necessary.
de: Es hängt ganz von Ihren Anforderungen ab, welche dieser Optionen Sie wählen sollten. In einigen Fällen ist das manuelle Umstrukturieren der Konten nach dem Import nötig.

source: Prices and currency rates
de: Preise und Währungskurse

source: Security prices and currency exchange rates as displayed in the GnuCash Price Editor will be imported. In addition, price and rate entries will be generated from all transactions involving securities and multiple currencies.
de: Wertpapierpreise und Währungskurse aus dem Preiseditor in GnuCash werden importiert. Zusätzlich werden Einträge für Preise und Umtauschkurse aus allen Buchungen von Wertpapieren und in mehreren Währungen generiert.

source: Online Quotes
de: Online-Kursnotizen

source: For obtaining online price and currency rate quotations, GnuCash uses a package called Finance::Quote. Recent versions of &kappname; contain support for this package for obtaining stock quotes, and this will be used by default when importing data. You may however select to convert to the native method used by &kappname; which is covered in more detail in <link linkend="details.investments.onlinequotes">online quotes</link>.
de: GnuCash verwendet das Paket „Finance::Quote“, um Aktien- und Währungskurse aus dem Internet herunterzuladen. Aktuelle Versionen von &kappname; unterstützen ebenfalls dieses Paket, daher wird diese Methode als Standard beim Import benutzt. Sie können jedoch die &kappname;-Funktion benutzen, die im Abschnitt <link linkend="details.investments.onlinequotes">Online-Kursnotizen</link> erläutert wird.

source: If you choose to do so, the following dialog will allow selection of a 'native' &kappname; price source, or a user-defined source, for each account for which online quotes are required. However, the stock (ticker) symbol will be imported unchanged. Since this symbol will almost certainly be different in the two packages, it will need to be manually edited after completion of the import process. Future currency rate updates will not use Finance::Quote, and will always use the native retrieval method.
de: Im folgenden Dialog können Sie eine der in &kappname; bekannten Online-Quellen auswählen oder eigene Quellen definieren. Das Börsensymbol wird jedoch unverändert importiert. Das dies Symbol im mehreren Paketen sehr wahrscheinlich nicht übereinstimmt, muss es später nach Abschluß des Imports von Hand bearbeitet werden. Spätere Aktualisierungen von Währungskursen verwenden das Paket Finance::Quote dann nicht mehr, sondern die in &kappname; eingebaute Funktion.

source: Scheduled Transactions
de: Geplante Buchungen

source: &kappname; does not retain the separation made in GnuCash between template transactions and their frequency of occurrence. Transaction data will be duplicated if the same template is used in different schedules, but this is not likely to be of great significance.
de: &kappname; unterstützt die in GnuCash benutzte Unterscheidung zwischen Buchungsvorlagen und Häufigkeit der Buchung nicht. Buchungen werden doppelt importiert, wenn die gleiche Vorlage für verschiedene Wiederholungszeiträume verwendet wird, das ist aber wahrscheinlich unwichtig.

source: Schedule types
de: Arten von geplanten Buchungen

source: &kappname; classifies all schedules as one of three types, Bills, Deposits, or Transfers. Since GnuCash does not make such a distinction, the importer attempts to determine the classification from the accounts and direction of money movements. It may be that in some cases incorrect assumptions are made, and these will need manual correction.
de: &kappname; kennt drei Arten von geplanten Buchungen. Gutschrift, Belastung und Umbuchung. In GnuCash gibt es diese Unterscheidung nicht. Das Importmodul versucht die Art der Buchungen aus den Konten und Richtungen des Geldflusses zu ermitteln. Das gelingt nicht in allen Fällen und muss dann manuell korrigiert werden.

source: Suspect Schedules
de: Möglicherweise fehlerhafte geplante Buchungen

source: Some features of GnuCash scheduled transactions are not available in &kappname;, so the importer tries in each case to reach a reasonable compromise in converting the data. These transactions will be flagged as suspect, and the user will be given the option of editing them directly during the import process. Examples of situations which may cause this are:
de: Einige Funktionen von geplanten Buchungen in GnuCash sind in &kappname; nicht verfügbar. Dann versucht das Importmodul in diesen Fällen, die Daten sinnvoll zu konvertieren. Diese Buchungen werden als möglicherweise fehlerhaft gekennzeichnet. Sie können vom Benutzer beim Import direkt bearbeitet werden. Beispiele für möglicherweise falsche Buchungen sind:

source: some frequency intervals supported in GnuCash are not currently available in &kappname;
de: Einige in GnuCash unterstützte Wiederholungszeiträume können zurzeit in &kappname; nicht eingestellt werden.

source: &kappname; does not support the use of formulae and variables in amount fields
de: &kappname; erlaubt keine Formeln und Variablen in Wertefeldern

source: complex cases which have not yet been identified for import.
de: Schwierige Fälle, die zurzeit beim Import noch nicht erkannt werden.

source: Despite best efforts, it is possible that, due to the many options involved, a scheduled transaction may cause a fatal error within &kappname;. If this sort of problem seems to be occurring, the importer offers the option to drop all suspect schedules.
de: Wegen der vielen möglichen Einstellungen kann es vorkommen, dass eine geplante Buchung einen schwerwiegenden Fehler in &kappname; auslöst. In diesen Fällen können im Importmodul alle möglicherweise fehlerhaften Buchungen ausgelassen werden.

source: Reports
de: Berichte

source: &kappname; provides a comprehensive selection of configurable reports, described in more detail in <link linkend="details.reports">Reports.</link> These will not necessarily, however, match precisely those reports available in GnuCash.
de: &kappname; bietet eine umfassende Auswahl an einstellbaren Berichten. Ausführliche Informationen dazu finden Sie im Abschnitt <link linkend="details.reports">Berichte</link>. Die Berichte in &kappname; entsprechen nicht unbedingt genau den Berichten in GnuCash.

source: Selecting Importer Options
de: Auswahl der Import-Einstellungen

source: Investment Handling
de: Verarbeitung von Investitionen

source: See <link linkend="gncsecurities">"Securities and Investments"</link> above.
de: Siehe <link linkend="gncsecurities">Wertpapiere und Investitionen</link> weiter oben.

source: Turn this off if you wish to use the native method for future online price quotes.
de: Schalten Sie diese Einstellung aus, wenn Sie die Standardmethode für zukünftige Online-Kursnotizen verwenden möchten.

source: See <link linkend="details.impexp.gncquotes">"Online Quotes"</link> above.
de: Siehe <link linkend="details.impexp.gncquotes">Online-Kursnotizen</link> weiter oben.

source: See <link linkend="gncschedules">"Scheduled Transactions"</link> above.
de: Siehe <link linkend="gncschedules">Geplante Buchungen</link> weiter oben.

source: Decoding Options
de: Kodierungs-Einstellungen

source: If your native language is written in letters or symbols which are different from those used in the 'Latin' languages (i.e., generally Western European), these are represented in a special fashion ('encoded') in your GnuCash file. If these letters are not displayed correctly on your screen, then they must be decoded. Currently, it is often not possible to detect accurately which form of decoding must be used, so you may need to set this option and select an entry from the list. In general, the first item in the list will be that which is considered appropriate for your locale (i.e., the country and language which was selected as native when your operating system was installed), so this should be tried first. Since the import process does not overwrite your GnuCash file, you are free to experiment with any of these selections.
de: Werden in Ihrer Sprache Buchstaben oder Symbole in anderen Kodierungen als „Latin“ (Westeuropäisch) geschrieben, dann sind Sie in der GnuCash-Datei kodiert. Werden diese Buchstaben auf dem Bildschirm nicht korrekt angezeigt, dann müssen Sie dekodiert werden. Oft ist es nicht möglich, die richtige Kodierung zu erkennen. Dann muss diese Einstellung gewählt und ein Eintrag aus der Liste gewählt werden. Als erstes Element in der Liste wird die in den Regionaleinstellungen benutzte Kodierung angeführt und sollte zuerst ausprobiert werden. Da beim Import keine Daten in der GnuCash-Datei überschrieben werden, können Sie problemlos alle Einstellungen ausprobieren.

source: Transaction Notes option
de: Einstellungen der Buchungsnotizen

source: Under some usage conditions, non-split GnuCash transactions may contain residual, often incorrect, memo data which is not normally visible to the user. When imported into &kappname; however, due to display differences, this data can become visible. Often, these transactions will have a Notes field describing the real purpose of the transaction. If this option is selected, these notes, if present, will be used to override the extraneous memo data.
de: Manchmal enthalten nicht geteilte GnuCash-Buchungen noch restliche Memodaten, die normalerweise nicht angezeigt werden. Beim Import in &kappname; kann es wegen der unterschiedlichen Anzeige vorkommen, dass diese Daten angezeigt werden. Häufig haben diese Buchungen ein Notizfeld mit Hinweisen zum Grund der Buchung. Mit der Einstellung Buchungsnotizen werden diese belanglosen Memodaten durch den Inhalt des Notizfeldes überschrieben.

source: Debug Options
de: Einstellungen zur Fehlersuche
