Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/extragear-office/kmymoney_details-impexp.po
Languages: de

source: The easiest way to import an OFX file is to set up Web Connect. Visit your bank's web site, and click on a link to download an OFX file. Your browser should ask you what program you would like to use to open the file. Point your browser to &kappname;. It will then import the downloaded OFX file into the &kappname; file you most recently had open. You can also change the file associations of your desktop environment, and have &kappname; open the OFX file automatically for you.
de: Am einfachsten ist der Import einer QFX-Datei über eine Internetverbindung. Gehen Sie zur Webseite Ihrer Bank und klicken Sie auf eine Verknüpfung zum Herunterladen einer QFX-Datei. In Ihrem Browser sollte die Abfrage erscheinen, mit welchem Programm Sie heruntergeladene Datei öffnen möchten. Geben Sie dafür das Programm &kappname; an. Die heruntergeladene QFX-Datei wird in die letzte mit &kappname; geöffnete Datei importiert. Sie können auch die Dateizuordnung Ihrer Arbeitsumgebung ändern und hier &kappname; angeben. Dann werden OFX-Dateien automatisch ohne Nachfrage in &kappname; geöffnet.

source: If you need to import the OFX file into some other &kappname; file, load up that file in &kappname; first, and then visit your bank's web site.
de: Möchten Sie die QFX-Datei in eine &kappname;-Datei importieren, laden Sie zuerst diese Datei in &kappname; und gehen Sie dann zur Webseite Ihrer Bank.

source: Direct Connect
de: Direktverbindung

source: OFX Direct Connect is now supported in &kappname;. This gives you the ability to contact your bank directly to obtain statements. In the future, there will be more help written, and this will be moved to its own section.
de: Die OFX-Direktverbindung ist jetzt in &kappname; verfügbar. Damit haben Sie die Möglichkeit, Verbindung mit Ihrer Bank aufzunehmen und Kontoauszüge abzurufen. In den nächsten Versionen des Handbuchs finden Sie zu diesem Thema mehr Informationen in einem eigenen Kapitel.

source: To enable this feature, you must compile &kappname; with the --enable-ofxbanking switch (now the default).
de: Um diese Funktion nutzen zu können, muss &kappname; mit der Option --enable-ofxbanking kompiliert werden, das ist die Standardeinstellung.

source: Please be warned: Many banks require a separate signup, will give you a separate password or PIN, and may even charge you a separate fee for this service. No bank directly supports &kappname;. You will have to tell them you want to bank directly from MS Money or Quicken.
de: Hinweis: Manche Banken verlangen eine getrennte Anmeldung, ein eigenes Passwort oder PIN und berechnen Ihnen möglicherweise eine zusätzliche Gebühr für diesen Dienst. Keine Bank unterstützt &kappname;, Sie müssen angeben, dass Sie die Programme MS Money oder Quicken verwenden.

source: The first step is to configure each account for which you wish to download statements. Go to the Accounts view, right click on the account you wish to configure, and choose <guimenuitem>Map to online account...</guimenuitem>. In case more than one online banking plugin is installed on your system you will be asked which one to use. For the internal OFX method select <guimenuitem>KMyMoney OFX</guimenuitem>. A list of banks will be downloaded from the Internet and a wizard will guide you through choosing a bank, entering your username and password, and selecting an account. Should you find that your bank is not listed, then it may still be possible to use the manual option. Your bank may be able to provide the required parameters, or you may have to do some research to find them.
de: Zuerst muss jedes Konto, für das Sie Auszüge herunterladen möchten, dafür eingerichtet werden. Hegen Sie zur Ansicht <guilabel>Konten</guilabel>, klicken Sie mit der &RMBn; auf ein Konto und wählen im Kontextmenü <guimenuitem>Einem Onlinekonto zuordnen</guimenuitem>. Haben Sie mehrere Module für Online-Banking installiert, müssen Sie das gewünschte Modul angeben, zum Beispiel <guimenuitem>KMyMoney OFX</guimenuitem> für die interne OFX-Methode. Dann wird eine Liste von Banken aus dem Internet heruntergeladen. Ein Assistent unterstützt Sie bei der Auswahl der Bank und des Kontos sowie bei der Eingabe von Benutzername und Passwort. Ist Ihre Bank in der heruntergeladenen Liste nicht enthalten, fragen Sie Ihre Bank nach den erforderlichen Daten und nutzen die manuelle Eingabe.

source: Once you have an account set up with online banking, go to the ledger for that account. Then from the <guimenu>Account</guimenu> menu, choose <guimenuitem>Update account...</guimenuitem>. This will connect to your bank, and download a statement for the last 60 days.
de: Haben Sie ein Konto mit Online-Banking eingerichtet, wechseln Sie zur Kontenbuchansicht für diese Konto. Wählen Sie dann aus dem Menü <menuchoice><guimenu>Konto</guimenu><guimenuitem>Konto aktualisieren ...</guimenuitem></menuchoice>. Dann wird die Verbiegung zur Bank hergestellt und die Kontoauszüge der letzten 60 Tage werden heruntergeladen.

source: In version of &kappname; prior to 4.6, the payee name was always taken from the PAYEEID field. As of version 4.6, the payee name can be based on either the PAYEEID, NAME, or MEMO field in the OFX transaction. You can configure this feature and some other OFX direct connect settings by selecting the appropriate tab in the <link linkend="details.accounts.edit">Edit account</link> dialog.
de: In Versionen von &kappname; vor 4.6 wurde der Name des Zahlungsempfänger immer aus dem Feld PAYEEID genommen. Ab Version 4.6 kann der Name des Zahlungsempfängers aus dem Feld PAYEEID, NAME, oder MEMO der OFX-Buchung verwendet werden. Die Auswahl des zu verwendenden Feldes und weitere Einstellungen zur OFX-Direktverbindung können Sie im Dialog <link linkend="details.accounts.edit">Konto bearbeiten</link> auf der Karteikarte <guilabel>Online-Einstellungen</guilabel> ändern.

source: Exporting an OFX file
de: Export einer OFX-Datei

source: It is not possible to export your data as an OFX file currently. If you are interested to contribute in this area, please contact the libofx development team for details.
de: Zur Zeit ist es nicht möglich, Ihre Finanzdaten im QFX-Format zu exportieren. Wenn Sie mithelfen möchten, diese Funktion mit zu entwickeln, nehmen Sie Kontakt mit den Libofx-Entwicklern auf.

source: Writing Importer Plugins
de: Entwicklung von Importmodulen

source: &kappname; contains explicit support for importer plugins. If you have a custom format, and you would like to write an importer plugin, we would value your contribution. To do so, you'll need to compile the program from source. Then use the OFX Importer Plugin as an example.
de: &kappname; enthält eine Schnittstelle, um Importmodule einzubinden. Benutzen Sie eine benutzerdefiniertes Format und Sie möchten ein Importmodul dafür schreiben, dann nehmen es die Entwickler gern in &kappname; auf. Zur Entwicklung des Moduls müssen Sie das Programm aus dem Quelltext kompilieren. Nehmen Sie das OFX-Importmodul als Vorlage für die Entwicklung.
