Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/extragear-office/kmymoney_details-investments.po
Languages: de

source: Investments
de: Investitionen

source: Investments in &kappname;
de: Investitionen in &kappname;

source: Investments are instruments for investing money that are traded on a market. Stocks, bonds, and mutual funds are the most common investments; so they are the ones supported most directly. Futures, commodities, options, and more complex derivatives are also sometimes used, but &kappname; has no special functionality for them. As long as they behave like a stock or a bond, they can be tracked easily.
de: Investitionen sind Geldanlagen, die an einer Börse gehandelt werden. Aktien, Anleihen und Anlagefonds sind die gebräuchlichsten Investitionen und sie werden in &kappname; direkt unterstützt. Termingeschäfte, Warengeschäfte, Optionen und andere komplexe Derivate werden auch manchmal benutzt, es gibt für sie aber keine besonderen Funktionen in &kappname;. Solange sie sich wie Aktien oder Anleihen verhalten, können sie problemlos mit &kappname; verwaltet werden.

source: Base Currency
de: Basis-Währung

source: Each investment has a Base Currency. This is the currency in which it is traded. When a price quote is entered for an investment, the currency of the value given is always its base currency. A stock on the NYSE (New York Stock Exchange) would be in US dollars, and one on an Australian market would be in Australian dollars.
de: Jede Investition hat eine Basiswährung, in der sie gehandelt wird. Ein notierter Kurs einer Investition wird immer in der Basiswährung eingegeben. Für eine Aktie an der NYSE (New York Stock Exchange - New Yorker Börse) ist die Basiswährung der US-Dollar, für eine in Australien an der Börse gehandelte Aktie ist der Australische Dollar die Basiswährung.

source: Investment Accounts
de: Investitionskonten

source: Investment Accounts hold a collection of investments. An Investment account contains transactions, such as buys and sells, of those investments. All transactions in an Investment account must relate to a specific investment. There is no separate <quote>cash balance</quote> in an investment account. For that, you need a Brokerage Account.
de: Investitionskonten enthalten eine Zusammenstellung von Investitionen, Ein Investitionskonto enthält Buchungen wie Kauf oder Verkauf dieser Investitionen. Alle Buchungen in einem Investitionskonto beziehen sich auf eine bestimmte Investition. Es gibt keinen getrennten <quote>Kassenbestand</quote> in einem Investitionskonto, dazu wird ein Wertpapierkonto verwendet.

source: Brokerage Accounts
de: Wertpapierhandelskonto

source: An investment account often has an associated Brokerage Account. This is also sometimes referred to as a <quote>Cash Account</quote>. Investment accounts cannot contain cash transactions, like a transfer from your bank. When a stock is sold, the proceeds are typically placed in the Brokerage Account.
de: Ein Investitionskonto hat meistens ein zugehöriges Wertpapierkonto. Dies wird manchmal auch als <quote>Kassenbestand</quote> bezeichnet. Investitionskonten können keine Geld-Buchungen wie zum Beispiel eine Überweisung ihrer Bank enthalten. Wird eine Aktie verkauft, dann wird der Erlös in dem Wertpapierkonto verbucht.

source: When you create an Investment Account, you have the option of creating an associated Brokerage Account with it.
de: Wenn Sie ein Investitionskonto erstellen, können Sie dazu ein Wertpapierhandelskonto eröffnen.

source: Creating an Investment Account
de: Anlegen eines Investitionskontos

source: The first step on the path to working with investments is to create an account to hold your investments. Choose <menuchoice><guimenu>Account</guimenu> <guimenuitem>New account...</guimenuitem></menuchoice> to begin the process of adding a new account. Create an account as usual, making sure to choose <quote>Investment</quote> as the type of account.
de: Als ersten Schritt zur Verwaltung von Investitionen müssen Sie eine Konto dafür erstellen. Wählen Sie <menuchoice><guimenu>Konto</guimenu><guimenuitem>Neues Konto ...</guimenuitem></menuchoice> aus dem Menü, um den Dialog „Neues Konto erstellen“ zu öffnen. Denken Sie daran, <quote>Investition</quote> als Typ des Konto einzustellen.

source: To work with the new investment account, navigate to the <guibutton>Investments</guibutton> view, and choose the account you have just created from the <guilabel>Select Account</guilabel> dropdown box.
de: Um mit dem neuen Investitionskonto zu arbeiten, gehen Sie zur Ansicht <guibutton>Investitionen</guibutton> und wählen Sie das gerade erstellte Konto im Auswahlfeld <guilabel>Konto wählen</guilabel>.

source: Adding Investments to Your Account
de: Investitionen zu Ihrem Konto hinzufügen

source: To add individual Investments to your Investment Account, navigate to the <guibutton>Investments</guibutton> view, select the <guibutton>Equities</guibutton> tab, and choose the account where the investment is held from the <guilabel>Select Account</guilabel> drop-down box.
de: Um einzelne Investitionen zu Ihren Investitionskonto hinzuzufügen, gehen Sie zur Ansicht <guibutton>Investitionen</guibutton>, wählen die Karteikarte <guibutton>Eigenkapital</guibutton> und dann ein Konto für die Investition im Auswahlfeld.

source: <screeninfo>Investment View, Equities Tab</screeninfo>
de: <screeninfo>Karteikarte Eigenkapital in der Investitions-Ansicht</screeninfo>

source: <phrase>Investment View, Equities Tab</phrase>
de: <phrase>Karteikarte Eigenkapital in der Investitions-Ansicht</phrase>

source: Right-click the mouse in the empty space in the view. This brings up the <guimenu>Investment Options</guimenu> context menu. Choose <guimenuitem>New investment...</guimenuitem> from this menu. This launches the <guilabel>New Investment Wizard</guilabel> which you use to create your new Investment.
de: Klicken Sie mit der &RMB; in einen leeren Bereich der Ansicht. Damit wird das Kontextmenü <guimenu>Investitions-Einstellungen</guimenu> angezeigt. Wählen Sie aus diesem Menü den Eintrag <guimenuitem>Neue Investition ...</guimenuitem>. Damit starten Sie den <guilabel>Assistenten für neue Investitionen</guilabel>, der Sie bei dieser Aufgabe unterstützt.

source: New Investment Wizard
de: Assistent für neue Investitionen

source: The first thing you'll be asked to enter is the type of investment, whether it's a stock, bond, etc.
de: Zuerst müssen Sie die Art der Investition (Wertpapier, Anleihe &etc;) auswählen.

source: Next, the investment details page is presented. The following information is entered on this page:
de: Als nächstes wird die Seite für die Investitionsdetails angezeigt. Folgende Informationen sollten auf dieser Seite eingegeben werden:

source: Trading Symbol. The ticker symbol used to identify the investment on whatever market it trades. &kappname; requires a trading symbol for all investments; however some investments do not have symbols. In this case, you will need to make up a symbol for it.
de: Börsensymbol: Das in allen Börsen verwendete Aktien-Symbol für diese Investition. &kappname; benötigt ein Börsensymbol für alle Investitionen, aber für manche Investitionen gibt es kein Symbol. In diesen Fällen müssen Sie Symbol erstellen.

source: Full name. The friendly, readable name of the investment you're creating, &eg;, <quote>Advanced Micro Devices, Inc.</quote> This name is also referred to as the security.
de: Name: Der ausgeschriebenen Name der Investition, die Sie erstellen, &eg;, <quote>Advanced Micro Devices, Inc.</quote>. Dieser Name wird auch für das Wertpapier verwendet.

source: Fraction. The degree of precision to which your holdings are measured. For example, in the US most mutual funds measure holdings to three decimal places, so you would enter 1000 in this field. Stocks are often measured to only whole units, so you could enter 1 for a stock like this.
de: Stückelung: Die Genauigkeit, mit der Ihr Aktienbesitz gemessen wird. Zum Beispiel in den USA geben die meisten Anlagefonds den Aktienbesitz mit drei Dezimalstellen an. Dann muss in diesem Feld der Wert „1000“ eingetragen werden. Aktien werden oft nur in ganzen Einheiten gerechnet. Für eine solche Aktie muss der Wert „1“ eingegeben werden.

source: Trading market. Where the stock trades. This is an optional field which is provided for your convenience. This information is not used anywhere else in &kappname;.
de: Handelsplatz: Die Börse, an der die Investition gehandelt wird. Angaben in diesem Feld sind freigestellt. Diese Information wird ansonsten nicht in &kappname; verwendet.

source: Identification. An optional field to enter additional identification information you might like to keep track of. Again, this information is not used anywhere else.
de: Identifikation: Ein Feld für zusätzliche Informationen zur Identifizierung. Diese Feld kann leer gelassen werden. Auch diese Information wird im Programm nicht weiter benutzt.

source: Trading currency. The underlying currency in which this investment trades on its market.
de: Handelswährung: Die Währung, in der diese Investition an Ihrem Markt gehandelt wird.

source: Price entry. Choose whether the price will be entered as an individual price, or as the total for all shares.
de: Kurseintrag: Geben Sie an, ob der Preis als Preis pro Aktie oder als Preis aller Aktien eingetragen wird.

source: If you are using Online Quotes, ensure that the symbol exactly matches the symbol used by your quote source. Yahoo covers most of the world's markets, and requires a suffix on the end of symbols outside the US. For example, Rubicon Limited on the New Zealand market should be entered as <quote>RBC.NZ</quote>.
de: Benutzen Sie Online-Kursnotizen, dann überprüfen Sie, dass das hier eingetragene Symbol genau mit dem Symbol der Online-Quelle übereinstimmt. Yahoo liefert Informationen über die meisten weltweiten Börsen, für außerhalb der USA gehandelte Werte muss jedoch ein Zusatz an das Symbol angehängt werden. Rubicon Limited, das auf dem Neuseeländischen Markt gehandelt wird, muss daher als <quote>RBC.NZ</quote> eingegeben werden.

source: Finally, you're presented with the Online Update screen. This is where you tell &kappname; how you would like to update the prices of your investment. The following items are set here:
de: Zum Schluß kommen die Einstellungen für die Aktualisierung der Online-Kurse. Hier stellen Sie ein, wie die Preise Ihrer Investition aktualisiert werden sollen. Folgenden Einstellungen sind vorhanden:

source: Use Finance::Quote. This is an option for GnuCash users who are used to this style of quotes. Most users can leave this unchecked.
de: Finance::Quote verwenden: Dies ist eine Einstellung für GnuCash-Benutzer, die mit dieser Art von Kursnotizen vertraut sind. Die meisten Benutzer können diese Einstellung deaktiviert lassen.

source: Online Source. The online source you'd like to use for this particular investment. The most common choice is <quote>Yahoo</quote>. Try that first, and if the investment cannot be found using this source, then experiment with the others.
de: Online-Quelle: Die Online-Quelle, die Sie für diese Investition benutzen möchten. Meistens wird hier <quote>Yahoo</quote> gewählt. Probieren Sie zuerst, ob die Investition hier gefunden wird. Ansonsten probieren Sie andere Quellen aus.

source: Factor. A multiplier that should be applied to quotes retrieved for this investment. This is most commonly needed for UK stocks where the price quoted is in pence (1/100), and the stock is denominated in pounds. In this case, enter 0,01 for the Factor.
de: Faktor: Ein Faktor, mit dem die Kursnotizen für diese Investition multipliziert werden sollen. Dies ist normalerweise für Aktion aus Grossbritannien erforderlich, wo der Preis in Pence (1/100) angegeben und die Aktie in Pfund notiert wird. In diesen Fall geben Sie 0,01 als Faktor ein.

source: Editing an Investment
de: Bearbeitung von Investitionen

source: The <guilabel>Equities</guilabel> tab of the Investments view window lists your current holdings in this account, along with their symbol, value, quantity, and price. Right-click the mouse on any of the investments to bring up the <guimenu>Investment Options</guimenu> context menu, where you have the option to add, edit, or delete individual investments from this account. Also, you can update the price of your investments here either manually or via their online source. In addition, it is possible to close an empty account, or to reopen a closed account.
de: Auf der Karteikarte <guilabel>Eigenkapital</guilabel> in der Ansicht „Investitionen“ wird der Inhalt eines Kontos zusammen mit dem Handelssymbol, dem Wert, der Menge und dem Preis angezeigt. Klicken Sie mit der &RMBn; auf eine Investition, um das Kontextmenü <guimenu>Investitions-Einstellungen</guimenu> zu öffnen. Mit den Aktionen in diesem Menü können Sie einzelne Investitionen zu diesem Konto hinzufügen, zu bearbeiten oder zu löschen. Außerdem können Sie den Preis manuell oder Online aktualisieren. Ein leeres Konto kann geschlossen und geschlossene Konten können wieder geöffnet werden.

source: Investment Transactions
de: Investitions-Buchungen

source: <screeninfo>Investment Transaction Form</screeninfo>
de: <screeninfo>Investitions-Buchungsformular</screeninfo>

source: <phrase>Investment Transaction Form</phrase>
de: <phrase>Investitions-Buchungsformular</phrase>

source: Investment transactions are entered and edited in the <link linkend="details.ledgers">ledger</link> view, as with other kinds of accounts. However, the fields are different, and vary depending on the investment transaction type or activity. Investment transactions have some additional elements:
de: Investitions-Buchungen werden im <link linkend="details.ledgers">Kontenbuch</link> wie andere Konten eingeben oder bearbeitet. Die zu bearbeitenden Felder sind jedoch anders und hängen von der Art der Buchung oder Aktivität ab. Für Investitions-Buchungen gibt es einige zusätzliche Elemente.

source: <para>Activity</para>
de: <para>Aktivität</para>

source: <para>Security</para>
de: <para>Wertpapier</para>

source: <para>Account</para>
de: <para>Konto</para>

source: Shares, Price, &amp; Total Amount
de: Aktien, Preise &amp; Gesamtbetrag

source: <para>Fees</para>
de: <para>Gebühren</para>

source: Interest category
de: Zinskategorie

source: <title>Activity</title>
de: <title>Aktivität</title>

source: The Activity for an investment transaction describes what action is happening to the stock. The following activities are supported:
de: Die Aktivität einer Investitionsbuchung beschreibt die Aktion für ein Wertpapier. Folgende Aktivitäten sind möglich:

source: Buy/Sell
de: Kaufen/Verkaufen

source: Use to record purchases or sales of individual investments. This action requires an account to transfer the funds from/to.
de: Wird für den Verkauf oder Kauf von einzelnen Investitionen verwendet. Diese Aktion benötigt ein Konto, in das die Gelder ein- oder ausgebucht werden.

source: Dividend/Yield
de: Dividende/Gewinn

source: Also known as a <quote>Cash Dividend</quote>, this action is used for when you receive an interest or dividend disbursement from your investment. This action requires an account to transfer the funds from/to.
de: Diese Aktion wird auch <quote>ausgeschüttete Dividende</quote> genannt und wird benutzt, wenn Sie Zinsen oder Dividendenausschüttungen für Ihre Investition erhalten. Für diese Aktion ist ein Konto für die Buchung der Beträge nötig.

source: Reinvest Dividend
de: Wiederanlage der Dividende

source: Reinvest Dividend. This is a dividend where the proceeds are re-invested back into the investment.
de: Dies ist eine Dividende, bei der Erträge wieder in der Investition angelegt werden.

source: Add/Remove Shares
de: Aktien hinzufügen/entfernen

source: A simple increase or decrease in your balance. This should be used very rarely, because it's uncommon for shares to just show up in your account (or disappear) unless it's a purchase or a sale.
de: Eine Änderung der Anzahl Ihrer Investition. Dies sollten selten benutzt werden, da es sehr ungewöhnlich ist, dass sich die Zahl der Aktien ändert, es sei denn durch Kauf oder Verkauf.

source: Split Shares
de: Aktien-Stückelung

source: Used when the stock is split. Enter the ratio of the split in the <quote>Split Ratio</quote> field. For example, in a 3:2 split, enter 1.5
de: Wird bei der Teilung einer Aktie benutzt. Geben Sie das Verhältnis im Feld <quote>Aufteilungsverhältnis</quote> ein, zum Beispiel bei einer Teilung im Verhältnis 3:, geben Sie den Faktor 1,5 ein.

source: <title>Security</title>
de: <title>Wertpapier</title>

source: Each investment transaction must be associated with an individual security, which is here just another name for an investment. Choose the investment name when adding or editing a transaction. The symbol will be displayed when viewing it.
de: Jede Investitions-Buchung muss einem bestimmten Wertpapier, hier nur ein anderer Name für eine Investition, zugeordnet werden. Wählen Sie den Namen für eine Investition, wenn Sie eine Buchung hinzufügen oder bearbeiten. Das Symbol wird mit der Investition angezeigt.

source: <title>Account</title>
de: <title>Konto</title>

source: For any transactions which generate or require money, you must enter the account where the money is transferred to/from. If your investment account has an associated brokerage account, it's usually best to transfer the funds there. This applies to funds for purchase or sale of the investment, as well as for fees paid or interest or dividends earned.
de: Für alle Buchungen, bei denen Geldbeträge verschoben werden, muss ein Konto eingegeben werden, aus dem der Betrag entnommen oder dem er hinzugefügt wird. Gibt es für Ihr Investionskonto ein zugeordnetes Wertpapierkonto, dann sollten Sie die Beträge dort verbuchen. Dies betrifft gezahlte Gebühren, Zinsen oder erhaltene Dividenden.

source: Shares, Price &amp; Total Amount
de: Aktien, Preise &amp; Gesamtbetrag

source: For buy, sell, and cash dividend transactions, the number of shares, the price per share, and the total amount of the transaction must be established. You can enter any two of these, and &kappname; will calculate the third. It's usually best to enter just the total amount and the number of shares, because these are the known facts of the transaction. The price per share can be calculated from these.
de: Für die Buchung von Käufen, Verkäufen und ausgeschüttete Dividende muss die Anzahl der Aktien, der Preis je Aktie und der Gesamtbetrag der Buchung ermittelt werden. Geben Sie zwei dieser Werte ein, &kappname; berechnet dann den dritten Wert. Am Besten geben Sie den Gesamtbetrag und die Anzahl der Aktien ein, da diese beiden Werte für die Buchung bekannt sind. Der Preis je Aktie kann aus diesen Angaben berechnet werden.

source: <title>Fees</title>
de: <title>Gebühren</title>

source: With many investment transactions you can include the fees (or commission) you paid the broker. If you enter a category for the fee, then a field will be shown to the right where you can enter the amount of the fee. If you need to enter more than one fee for the transaction, you can use the <link linkend="details.ledgers.split">Split Transactions</link> feature. In this case, when you complete entering all the splits, the total amount of the fees will be shown to the right.
de: Bei Investitions-Buchungen können Sie die Gebühren oder Kommission, die Sie dem Händler gezahlt haben, mit eingeben. Haben Sie eine Kategorie für die Gebühren ausgewählt, wird rechts ein Feld angezeigt, in dem der Betrag eingegeben wird. Müssen Sie mehrere Gebühren für diese Buchung eingeben, benutzen Sie die Funktion <link linkend="details.ledgers.split">Split-Buchungen</link>. Haben Sie in diesem Fall alle einzelnen Buchungen eingegeben, wird die Gesamtsumme aller Gebühren rechts im Feld angezeigt.

source: Interest
de: Zinsen

source: This is how you enter an interest or dividend payment from an investment. As with fees, if you enter a category, then a field will be shown to the right where you can enter the amount. You can also use the split transaction feature, if required.
de: In diesem Feld geben Sie die Zinsen oder Dividendenzahlungen einer Investition ein. Wie bei den Gebühren wählen Sie eine Kategorie, dann wird recht ein Feld zur Eingabe des Betrages angezeigt. Falls erforderlich, können Sie hier ebenfalls Split-Buchungen eingeben.

source: Working With Foreign Investments
de: Arbeiten mit ausländischen Investitionen

source: &kappname; supports multiple currencies and investments, and you may want to combine the two. However, doing so requires extra care. As noted above, when you added an investment, you had to specify its trading currency. This might not be the same as your base currency, and it also might not be the same as the account in which you hold the stock or the account where you transfer your funds to/from for buys/sells.
de: &kappname; kann verschiedene Währungen und verschiedene Investitionen verarbeiten, Um diese Funktionen gemeinsam zu benutzen, sind zusätzliche Überlegungen nötig. Wie bereits vorher erläutert, muss beim Hinzufügen einer Investition eine Handelswährung angegeben werden. Diese Handelswährung kann sich von Ihrer Basiswährung oder von der Währung des Kontos für die Aktien oder der Währung des Wertpapierkontos für Käufe/Verkäufe unterscheiden.

source: Consider a hypothetical case. Your base currency is USD. You have an investment account in EUR, and a brokerage account also in EUR. In that account, you hold shares of TietoEnator, which is traded in SEK.
de: Angenommen Ihre Basiswährung ist USD (US-Dollar). Sie haben ein Investitionskonto und ein Wertpapierkonto in der Währung EUR. Diese Konto enthält Aktien von TietoEnator, die in SEK (schwedischen Kronen) gehandelt werden.

source: When you enter a buy transaction on this investment, use SEK as the currency. So if you buy 100 shares at a price of SEK 248.00, for a total of SEK 24,800.00, enter these values in the transaction.
de: Wenn Sie eine Kauf-Aktion für diese Investition eingeben, verwenden Sie als Währung SEK. Wenn Sie also 100 Aktien zu einem Preis von 248,00 SEK/Aktie mit dem Gesamtbetrag von 24.800,00 SEK kaufen, geben Sie diese Werte für die Buchung ein.

source: <screeninfo>Currency Warning</screeninfo>
de: <screeninfo>Währungs-Hinweis</screeninfo>

source: <phrase>Currency Warning</phrase>
de: <phrase>Währungs-Hinweis</phrase>

source: When you choose the brokerage account to fund the transfer, you'll be warned that it's in a different currency.
de: Wenn Sie das Wertpapierkonto für diesen Vorgang auswählen, erhalten Sie eine Warnung, wenn das Konto in einer anderen Währung geführt wird.

source: <screeninfo>Exchange Rate Editor</screeninfo>
de: <screeninfo>Umtauschkurs-Editor</screeninfo>

source: <phrase>Exchange Rate Editor</phrase>
de: <phrase>Umtauschkurs-Editor</phrase>

source: When you finish the transaction, you will be prompted for a price update to the investment account's currency, in this case, SEK -> EUR. Review the documentation on <link linkend="details.currencies.prices">Entering Prices Manually</link> for more information on the price dialog.
de: Wenn Sie die Buchung abgeschlossen haben, können Sie den Währungskurs des Investitionskontos aktualisieren. In diesem Beispiel ist das der Wechselkurs SEK zu EUR. Ausführliche Informationen über den Umtauschkurs-Editor finden Sie im Abschnitt <link linkend="details.currencies.prices">Manuelle Preisaktualisierung</link>.

source: If you then switch over to the brokerage account, you will see the transaction as EUR 2,254.54, assuming an exchange rate is 11.0000 SEK / EUR.
de: Wechseln Sie zum Wertpapierkonto, dann sehen Sie bei einem angenommenen Wechselkurs von 11,000 SEK / EUR einen Buchungsbetrag von 2.254,54 EUR.

source: Updating Prices
de: Aktualisierung von Preisen
