Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/extragear-office/kmymoney_details-ledgers.po
Languages: de

source: Ledgers
de: Kontenbuch

source: The Ledger View
de: Die Kontenbuchansicht

source: The Ledger view is where most of the functionality of &kappname; lies. This view is for examining and entering transaction data in the various accounts. The view is split into three main areas: the filter area, the transaction list, and the input area.
de: In der Kontenbuchansicht liegt das Herz der Funktionalität von &kappname;. Diese Ansicht dient dazu, in den verschiedenen Konten Buchungen zu überprüfen und neue Buchungen anzulegen. Die Ansicht ist in drei Bereiche aufgeteilt: der Filterbereich, die Buchungsliste und der Eingabebereich.

source: This view allows for several key actions: searching and viewing transactions, entering new transactions, and editing or deleting existing transactions. Other functionality includes modifying account details and reconciling the account.
de: Diese Ansicht erlaubt Ihnen zahlreiche Schlüsselfunktionen: Suchen und Ansehen von Buchungen, Eingabe neuer Buchungen und das Bearbeiten oder Löschen von existierenden Buchungen. Weiterhin können Sie Details der Konten bearbeiten und Ihre Konten mit den Kontoauszügen Ihrer Bank abgleichen.

source: Ledger View
de: Kontenbuchansicht

source: The view has three elements:
de: Die Ansicht besteht aus drei Elementen:

source: <para>The filter area</para>
de: <para>Der Filterbereich</para>

source: <para>The transaction list</para>
de: <para>Die Buchungsliste</para>

source: The transaction input form, which may or may not appear, depending upon your configuration.
de: Das Eingabeformular für Buchungen, welches abhängig von den &kappname; Einstellungen sichtbar ist.

source: <title>The filter area</title>
de: <title>Der Filterbereich</title>

source: Filter area
de: Filterbereich

source: You can select an account via the account dropdown list at the top of the view area. Note that depending upon the type of the account the <link linkend="details.ledger.transactionform">transaction input form</link> at the bottom of the view changes.
de: Sie können ein Konto über die Auswahlliste im oberen Bereich des Fensters auswählen. Achten Sie einmal darauf, wie sich das <link linkend="details.ledger.transactionform">Buchungs-Eingabeformular</link> im unteren Bereich des Kontenbuches abhängig vom Kontentyp ändert.

source: To the right of the account dropdown list, are two additional fields. The search box acts as a filter on the transactions that are shown in the list view. Only transactions that include the text typed in the search box are displayed. The text specified can be in any of the fields of the transaction. The status field is a dropdown list. Only transactions of the type selected in that dropdown are displayed.
de: Rechts von der Kontenauswahlliste gibt zwei weitere Felder. Das Such-Feld fungiert als Filter für die in der Liste anzuzeigenden Buchungen: es werden nur die Buchungen angezeigt, die den in das Suchfeld eingegebenen Text enthalten. Es ist dabei unerheblich, in welchem der Eingabefelder einer Buchung der Text vorhanden ist. Ganz rechts befindet sich eine Status-Auswahlliste. Es wurden nur die Buchungen angezeigt, die dem ausgewählten Eintrag entsprechen.

source: <title>The transaction list</title>
de: <title>Die Buchungsliste</title>

source: Transaction list
de: Buchungsliste

source: After you have entered a transaction, it is displayed in the transaction list. You can also change transaction properties or even create new transactions directly in the list. In the transactions list, the default arrangement of transactions is sorted by date with the most recent transaction on the bottom. Clicking the Right Mouse Button on the header of the transaction list brings up a dialog that allows you to change the sort order of the transactions. For instructions on how to change the default sort order, see the <link linkend="details.settings.register.sorting">Sorting tab</link> section of the <link linkend="details.settings">&kappname; Settings</link> Chapter.
de: Nachdem Sie eine Buchung eingegeben haben, erscheint sie in der Buchungsliste. Sie können die Eigenschaften einer Buchung oder das Anlegen einer neuen Buchung auch direkt in der Liste durchführen. Die Buchungsliste ist standardmäßig nach Datum aufsteigend sortiert, d.h. die neueste Buchung befindet sich am Ende der Liste. Durch einen Klick mit der rechten Maustaste auf die Kopfzeile der Buchungsliste können Sie die Sortierkriterien ändern. Wie Sie das Standardsortierkriterium ändern können, finden Sie im Abschnitt <link linkend="details.settings.register.sorting">Unterfenster "Sortierung"</link> im Kapitel <link linkend="details.settings">&kappname; Einstellungen</link>.

source: Note that the balance column is based on the currently displayed sort order, and will not be calculated if the display is filtered by the search box or transaction type dropdown, as described above.
de: Beachten Sie, dass das die Spalte „Saldo“ auf der aktuell angezeigten Sortierreihenfolge basiert und nicht berechnet wird, wenn die Anzeige mit dem Suchfeld oder dem Auswahlfeld „Buchung“ wie vorher beschrieben gefiltert wird.

source: At the bottom of the transaction list, &kappname; displays three values:
de: Unter der Buchungsliste werden drei Werte angezeigt:

source: Last reconciled
de: Zuletzt abgeglichen

source: This is the most recent date on which you reconciled this account. Reconciliation is an important process for many accounts, and is described <link linkend="details.reconcile">here</link>.
de: Diese ist das Datum des letzten Abgleichs des Kontos. Das Abgleichen ist ein wichtiger Prozess für viele Konten, weitere Informationen dazu finden Sie <link linkend="details.reconcile">hier</link>.

source: Cleared
de: Verrechnet

source: This is the total of all cleared and reconciled transactions in this account. See <link linkend="details.ledgers.cleared">this section</link> for more information about the cleared and reconciled states of transactions.
de: Dies ist die Gesamtsumme aller verrechneten und abgeglichenen Buchungen für dieses Konto. in diesem <link linkend="details.ledgers.cleared">Abschnitt</link> finden Sie weitere Informationen über den Status Verrechnet und Abgeglichen von Buchungen.

source: Balance
de: Saldo

source: This is where &kappname; displays the total balance of the account, which is the sum of all transactions in the account. However, if you select more than one transaction in the transaction list, this changes to display the sum of the selected transactions. This returns to the balance when only one transaction is selected.
de: Hier zeigt &kappname; den Gesamtsaldo des Kontos an, der sich aus der Summe aller Buchungen für dieses Konto ergibt. Wenn Sie jedoch mehrere Konten in der Kontenliste ausgewählt haben, wird hier die Summe der Buchungen aller ausgewählten Konten gezeigt. Ist nur ein Konto gewählt, wird auch nur der Gesamtsaldo diese Kontos gezeigt.

source: <title>The transaction input form</title>
de: <title>Das Buchungseingabeformular</title>

source: The exact layout of the bottom area of the ledger view depends on your configuration and the type of account being displayed. However, it generally includes fields for all the details of a single transaction, as well as buttons for various actions that can apply to a transaction. It is described in more detail in the following sections.
de: Das genaue Aussehen des Bereiches unterhalb der Buchungsliste hängt von den Einstellungen und dem Kontentyp ab, der angezeigt wird. Grundsätzlich enthält der Bereich Eingabefelder für alle Details einer einzelnen Buchung, sowie Knöpfe für verschiedenen Aktionen, die man auf eine Buchung anwenden kann. Dies wird in den folgenden Abschnitten näher beschrieben.

source: Entering Transactions
de: Buchungen eingeben

source: There are two methods of entering transactions into the ledger: using the transaction input form and entering the data directly into the transaction list. The transaction input form is displayed by default and this is the method we will discuss first.
de: Es gibt zwei Möglichkeiten, Buchungen in das Kontenbuch einzutragen: entweder über das Buchungsformular unterhalb der Buchungsliste, oder durch das Eingeben direkt in die Buchungsliste. Standardmäßig wird das Buchungsformular unterhalb der Buchungsliste angezeigt und deshalb soll zunächst diese Methode erläutert werden.

source: The fields in the input area match the information fields in the transactions list. Additional fields include the Memo field, for a more detailed description of the transaction, and a Category selection. The Split button allows you to split the transaction into multiple categories.
de: Die Felder im Buchungsformular entsprechenden den in der Buchungsliste angezeigten Feldern. Zusätzliche Felder, wie ein Bemerkungsfeld zum Hinterlegen detaillierterer Informationen zur Buchung und eine Kategorieauswahl. Über den Split-Knopf können Sie eine Buchung mehreren Kategorien zuordnen ("splitten").

source: Using the transaction input form
de: Das Buchungsformular verwenden

source: Transaction Form
de: Buchungsformular

source: The transaction input form at the bottom of the ledger view is the interface for creating transactions.
de: Das Buchungsformular im unteren Bereich des Kontenbuches ist die Bedienungsoberfläche zum Anlegen von Buchungen.

source: Depending upon the type or method of transaction you wish to enter there are several tabs available on the transaction form. Click on the tab that best describes your transaction (deposit, transfer, or withdrawal) and the form will load several fields ready for your input.
de: Abhängig davon, welchen Typ oder welche Art einer Buchung Sie anlegen möchten, sind verschiedene Unterfenster im Buchungsformular verfügbar. Klicken Sie auf das Unterfenster, das Ihre Buchung am ehesten beschreibt (Gutschrift, Umbuchung, Belastung) und es erscheinen die entsprechenden Eingabefelder, die Sie nun füllen können.

source: Please note that the actual transaction method is not used directly by &kappname; but is purely for grouping/reporting purposes.
de: Beachten Sie, dass die gewählte Art der Buchung von &kappname; nicht direkt verwendet wird. Die Information ist notwendig, um Buchungen in Berichten zu gruppieren.

source: If you are unsure which method to choose simply use Deposit for any money going into the account, Withdrawal for money coming out of the account, and Transfer for money moving from one account to another. The transaction methods and the differences between them are discussed in more detail elsewhere.
de: Wenn Sie sich nicht sicher sind, welche Buchungsart Sie auswählen sollen, verwenden Sie "Gutschrift" für auf dem Konto eingehende Zahlungen, "Belastung" für vom Konto abgehende Zahlungen und "Umbuchung" für Zahlungen zwischen verschiedenen Konten. Die verschiedenen Buchungsarten und ihre Unterschiede werden an anderer Stelle intensiver erläutert.

source: Select the transaction method by clicking on one of the tabs.
de: Wählen Sie eine Buchungsart durch Klicken auf eine der Karteikarten.

source: The fields of a transaction
de: Die Daten einer Buchung

source: Enter the information using the following notes on the available fields. Note that many fields have 'Auto Completion' turned on. That is, if you start typing, &kappname; will offer alternatives matching the characters you have entered so far. To select an entry click on it using the mouse or keyboard, or if your entry is not listed keep typing to add the new value. The next time you type the value in, &kappname; will find it for you after the first few characters have been input.
de: Geben Sie Ihre Daten anhand der folgenden Informationen in die Eingabefelder ein. Viele Eingabefelder haben eine automatische Vervollständigs-Funktion eingeschaltet. Das bedeutet, dass Ihnen &kappname; nach Eingabe der ersten Buchstaben automatisch alle übereinstimmenden Einträgen anzeigt. Um einen Eintrag auszuwählen, klicken Sie ihn mit der Maus an oder wählen Sie ihn mit der Tastatur aus. Sollte sich der gewünschte Text nicht in der Liste mit übereinstimmenden Einträgen befinden, fahren Sie einfach mit der Eingabe fort, um die Einträge in der Liste mit übereinstimmenden Einträgen einzugrenzen. Wenn Sie nun später den gleichen Text eingeben möchten, wird &kappname; ihn automatisch für Sie finden und ihn in der Liste mit übereinstimmenden Einträgen anbieten, nachdem Sie die ersten Zeichen des Textes eingegeben haben.

source: The Payee
de: Der Empfänger

source: The Payee is who the money came from/to. If the payee is a new entry &kappname; will ask if you wish to add this to the list of Payees. Any other information related to a payee or payer, such as address details can be updated in the Payees view later.
de: Der Empfänger/Zahlungsempfänger ist derjenige, von dem das Geld kam, bzw. an den das Geld gezahlt wurde. Wenn der Zahlungsempfänger &kappname; noch nicht bekannt ist, werden Sie gefragt, ob Sie ihn als neuen Datensatz in die Liste der Zahlungsempfänger aufnehmen möchten. Alle weiteren Informationen zum Zahlungsempfänger oder Zahlenden, wie seine Adresse, können später in der Empfänger Ansicht hinzugefügt werden.

source: The Category
de: Die Kategorie

source: The Category associates a transaction with an income or expense category for accounting and reporting purposes, and enables you to group certain transactions. Type the name of the category into the required field. If you have entered the category and it does not exist then &kappname; will ask if you want to create a new one.
de: Die Kategorie ordnet eine Buchung für Berichts- und Buchhaltungszwecke einer Einnahmen- oder Ausgabenkategorie zu. Dies ermöglicht es Ihnen, bestimmte Buchungen zu gruppieren. Geben Sie den Namen der Kategorie in das entsprechende Feld ein. Wenn Sie eine noch nicht existierende Kategorie eingeben, wird &kappname; fragen, ob Sie die Kategorie neu anlegen möchten.

source: If you wish to associate parts of the transaction with different categories, &kappname; can let you do that. An example transaction might be a cash machine withdrawal of 50 of which you use 10 on food, 20 on beer and 20 as spare cash. The transaction will therefore be assigned three categories: Food, Beer, and Cash. To do this, you need to use <link linkend="details.ledgers.split">Split Transactions</link>, which is described in more detail below.
de: Wenn Sie einer Buchung mehrere verschiedene Kategorien zuordnen möchten, erlaubt Ihnen &kappname; dies auch. Ein Beispiel hierfür wäre eine Rechnung für ein Abendessen in einem Restaurant über 50 EUR, wobei Sie 10 EUR für das Essen, 20 EUR für Getränke und 20 EUR Trinkgeld gezahlt haben. Die Transaktion könnte demnach drei Kategorien zugewiesen werden: Essen, Getränke und Trinkgeld. Um dies zu tun, müssen Sie eine <link linkend="details.ledgers.split">Split-Buchung</link> erzeugen. Wie das funktioniert, wird weiter unten beschrieben.

source: See the special <link linkend="reference.widgets">&kappname; fields</link> section for more information on how to use this field.
de: Schauen Sie in den Abschnitt spezielle <link linkend="reference.widgets">&kappname;-Felder</link> für weitere Informationen zum Gebrauch dieses Feldes.

source: The Memo
de: Die Notiz

source: A multi-line memo can be entered if you wish to help you remember what the transaction was for.
de: Eine mehrzeilige Notiz kann in das Notizfeld eingetragen werden, um zu vermerken, wofür genau die Buchung gut war.

source: The Check Number
de: Die Schecknummer

source: The check number can be entered if needed. Note that the check number can always be visible if desired. This is configured in the Settings dialog.
de: Eine Schecknummer kann bei Bedarf eingegeben werden. Die Schecknummer kann ständig sichtbar geschaltet werden. Dies kann im Einstellungsdialog von &kappname; konfiguriert werden.

source: The Date
de: Das Datum

source: The transaction's posting date must be entered to specify when the transaction took place. See the special <link linkend="reference.widgets">&kappname; fields</link> section for more information on how the date input field can be used to make entering dates quicker and easier.
de: Das Buchungsdatum muss eingegeben werden, wann die Buchung stattfand. Schauen Sie in den Abschnitt spezielle <link linkend="reference.widgets">&kappname;-Felder</link>, um mehr darüber zu erfahren, wie Sie in Datumsfelder schneller und einfacher ein Datum eintragen können.

source: The Amount
de: Der Betrag

source: Finally, enter the transaction amount into the required field. Note that a simple calculator can be displayed, either by clicking the icon to the right of the amount field, or by entering the % character into the field, or by entering a formula, as in <emphasis>12 + 3</emphasis>. When entering the plus sign, the calculator will be opened.
de: Zum Schluss geben Sie noch den Betrag der Buchung in das entsprechende Eingabefeld ein. Ein einfacher Taschenrechner steht Ihnen zur Verfügung, wenn Sie den kleinen Knopf rechts neben dem Eingabefeld drücken. Alternativ können Sie auch das Prozentzeichen % oder eine Formel, wie <emphasis>12 + 3</emphasis>. Sobald das Pluszeichen eingegeben wird, öffnet sich automatisch der Taschenrechner.

source: When you are satisfied that all the fields have been filled in correctly, click on <guibutton>Enter</guibutton>. If you accidentally press or click on <guibutton>Enter</guibutton> before you have finished entering all the data, click on <guibutton>Edit</guibutton> to resume entering the data.
de: Wenn Sie sich versichert haben, dass alle Felder korrekt ausgefüllt sind, klicken Sie den Knopf <guibutton>Eintragen</guibutton>. Wenn Sie aus Versehen auf <guibutton>Eintragen</guibutton> gedrückt haben, bevor Sie alle Daten eingegeben haben, drücken Sie einfach auf <guibutton>Bearbeiten</guibutton>, um die Eingabe Ihrer Daten fortzusetzen.

source: Directly inputting transactions into the list
de: Direkte Eingabe einer Buchung in die Liste

source: Direct Transaction Entry
de: Direkte Buchungseingabe

source: The second method of entering transactions into the ledger involves editing the transaction list itself directly.
de: Die zweite Methode eine Buchung im Kontenbuch anzulegen erfolgt in der Liste der Buchungen.

source: To do this you must first let &kappname; know that you don't want to use the transaction form by opening the settings dialog and unchecking the <guilabel>Show transaction form</guilabel> option.
de: Damit Sie diese Funktion nutzen können, müssen Sie &kappname; zunächst mitteilen, dass Sie das Buchungsformular nicht mehr nutzen möchten. Öffnen Sie den Einrichtungsdialog und deaktivieren Sie die Option <guilabel>Buchungsformular anzeigen</guilabel>.

source: This is performed by selecting <menuchoice><guimenu>Settings</guimenu> <guimenuitem>Configure &kappname;</guimenuitem></menuchoice> from the menu bar and selecting the <guiicon><inlinemediaobject><imageobject><imagedata fileref="ledgers_view.png"/></imageobject></inlinemediaobject> Register</guiicon> icon from the list on the left. The option to uncheck is labeled <guilabel>Show transaction form</guilabel>. When finished click on <guibutton>OK</guibutton> to be ready to directly enter transactions.
de: Dies geschieht durch den Menüpunkt <menuchoice><guimenu>Einstellungen</guimenu> <guimenuitem>&kappname; einrichten ...</guimenuitem></menuchoice>. Wählen Sie im erscheinenden Einstellungs-Dialog das Symbol <guiicon><inlinemediaobject><imageobject><imagedata fileref="ledgers_view.png"/></imageobject></inlinemediaobject> Kontenbuch</guiicon> aus der Liste auf der linken Seite. Die Option, die Sie deaktivieren müssen lautet <guilabel>Buchungsformular anzeigen</guilabel>. Anschließend klicken Sie auf den Knopf <guibutton>OK</guibutton>, um dann Ihre Buchungen direkt in die Buchungsliste im Kontenbuch eintragen zu können.

source: Starting the edit
de: Bearbeitung starten

source: To enter a new transaction into the register you can now either click on an empty entry, press <keycombo action="simul">&Ctrl;<keycap>Ins</keycap></keycombo>, or click <guibutton>New</guibutton> at the foot of the window. The <keycap>Up</keycap> and <keycap>Down</keycap> arrow keys let you navigate through the list. After pressing &Enter; or double clicking on an entry, the transaction list displays the fields required to enter the transaction and waits for input.
de: Um eine neue Buchung in das Kontenbuch einzutragen, klicken Sie entweder einen leeren Eintrag an, drücken die Taste <keycombo action="simul">&Ctrl;<keycap>Einfg</keycap></keycombo>, oder Sie betätigen den Knopf <guibutton>Neu</guibutton> am unteren Rand des Fensters. Die Tasten <keycap>Pfeil hoch</keycap> und <keycap>Pfeil runter</keycap> erlaubt Ihnen das Navigieren durch die Liste. Nach Drücken der &Enter;taste oder einem Doppelklick auf die gewünschte Buchung werden die Eingabefelder angezeigt und Sie können Ihre Eingaben vornehmen.

source: To move through the fields press the &Tab; key and when done press &Enter; to save the changes or &Esc; to cancel.
de: Um zum nächsten Feld zu wechseln, drücken Sie die Tabulatortaste. Wenn Sie alles eingegeben haben, drücken Sie &Enter;, um Ihre Änderungen zu speichern oder &Esc;, um die Bearbeitung abzubrechen.

source: In case the option <guilabel>Use Enter to move between fields</guilabel> is selected, the &Enter; moves to the next field just as the <keycap>TAB</keycap> key except for the last entry field where it stores the data.
de: Falls die Option <guilabel>Eingabetaste wechselt zwischen den Feldern</guilabel> aktiviert ist, können Sie mit Hilfe von &Enter; zum nächsten Eingabefeld wechseln, anstatt die &Tab;-Taste zu verwenden. Wenn Sie beim letzten Eingabefeld &Enter; drücken wird die Buchung gespeichert.

source: Which method you use to enter transactions is up to you and is a matter of personal preference.
de: Welche der beiden Eingabemethoden Sie verwenden, liegt ganz bei Ihnen und ist nur eine Frage Ihrer persönlichen Vorliebe.

source: Split Transactions
de: Split-Buchungen

source: The Split transaction feature allows you to divide up a transaction into multiple categories, representing, for example, the different items bought with a single purchase at a store.
de: Die Funktionalität der Split-Buchungen erlaubt es Ihnen, einer Buchung mehrere Kategorien zuzuordnen, beispielsweise um verschiedene während eines einzelnen Einkaufs erworbenen Dinge einer separaten Kategorie zuzuordnen.

source: To enter a split transaction, using either the transaction input form or the transaction list, start a new transaction as normal, including entering the total amount. Then, instead of selecting a category, click the <guibutton>Split</guibutton> button. If you have already selected a category, that becomes the first entry in the split editor screen.
de: Um eine Split-Buchung anzulegen, erstellen Sie wie gewohnt eine neue Buchung und geben Sie auch den Gesamtbetrag ein. Nun drücken Sie, anstatt eine einzelne Kategorie auszuwählen, den Knopf <guibutton>Splitten</guibutton>. Wenn Sie bereits eine einzelne Kategorie eingetragen haben, wird diese der erste Eintrag im Split-Buchungs-Editor.
