Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/extragear-office/kmymoney_details-impexp.po
Languages: de

source: These need only be used in the event of import problems. If you have such problems, you should also report them to the &kappname; developer list &devlist;. Note that the traces produced by these options may contain data of a confidential nature, and the Anonymize option should be used if they are to be made publicly available.
de: Diese Einstellungen sind nur bei Problemen mit dem Import erforderlich. In diesen Fällen sollten Sie diese Probleme auch an die Liste &devlist; der &kappname;-Entwickler schicken. Denken Sie daran, dass die Fehlerprotokolle vertrauliche Daten enthalten können. Daher sollten Sie die Funktion zur Anonymisierung der Daten benutzen, ehe Sie sie an eine öffentliche Mailingliste schicken.

source: Import Report
de: Importbericht

source: At the end of processing, the importer produces a report showing the number of different entities processed, and any errors or anomalies encountered. This report will be displayed on screen, and may be saved to a file for later review. A full report may contain the following sections:
de: Am Ende des Importprozesses wird ein Bericht mit der Anzahl der bearbeiteten Einträge, Fehlern oder ungewöhnlichen Vorkommnissen erstellt. Dieser Bericht wird auf dem Bildschirm angezeigt und kann zur späteren Überprüfung in einer Datei gespeichert werden. Ein vollständiger Bericht beinhaltet folgende Abschnitte:

source: Record counts
de: Anzahl der Datensätze

source: Inconsistencies in account types and actions taken
de: Widersprüche bei Kontenarten und durchgeführten Aktionen

source: Details of suspect schedules
de: Einzelheiten für ungewöhnliche geplante Buchungen

source: QIF format considered harmful
de: Warum das QIF-Format nicht benutzt werden sollte

source: Generally speaking, the QIF format should be avoided wherever possible. It is a poor choice for transporting financial data. Among other things, QIF suffers from these problems:
de: Im allgemeinen sollte das QIF-Format, wenn möglich, nicht benutzt werden. Es ist eine schlechte Wahl für die Übertragung von Finanzdaten. Unter anderem gibt es folgende Probleme mit dem Format:

source: Lack of standardized format: Different versions of the same program will impart different meanings to the same element.
de: Fehlende Standardisierung des Formats: Verschiedene Versionen des gleichen Programms können gleichen Elementen verschiedenen Bedeutungen zuweisen.

source: Lack of transaction identifier: Because there is no ID number associated with each transaction, matching duplicate transactions is haphazard at best.
de: Kennung für Buchungen fehlt: Da es keine Kennung für einzelne Buchungen gibt, können doppelte Buchungen nur durch Raten festgestellt werden.

source: Lack of expressiveness: The grammar is really simple, and cannot portray the depth of financial information found in today's financial environment.
de: Mangelnde Ausdrucksfähigkeit: Die Grammatik des Formats ist ziemlich einfach und kann die komplexen Informationen nicht darstellen, die heute für eine Finanzverwaltung gebraucht werden.

source: This is generally why Intuit stopped supporting QIF input at all with Quicken 2005. If you have the option of getting data some other way, like OFX, always choose that option.
de: Aus diesen Gründen hat Intuit die Unterstützung des QIF-Formats in Quicken 2005 vollständig eingestellt. Können Sie Daten in anderen Formaten wie zum Beispiel QFX erhalten, sollten Sie das QIF-Format nicht benutzen.

source: How to import a QIF file
de: Import einer QIF-Datei

source: To import a QIF file, first ensure you have a valid &kappname; file open. Then select <menuchoice><guimenuitem>Import</guimenuitem> <guimenuitem>QIF...</guimenuitem> </menuchoice> from the <guimenu>File</guimenu> menu.
de: Um eine QIF-Datei zu importieren, müssen Sie zuerst eine gültige &kappname;-Datei geöffnet haben. Wählen Sie dann <menuchoice><guimenuitem>Importieren</guimenuitem> <guimenuitem>QIF ...</guimenuitem> </menuchoice> aus dem Menü <guimenu>Datei</guimenu>.

source: The resulting dialog prompts for the QIF filename allowing you to locate the file by clicking on the <guibutton>Browse</guibutton> button.
de: Im nächsten Dialog müssen Sie den Namen der QIF-Datei eingeben. Klicken Sie auf <guibutton>Durchsuchen</guibutton>, um die Datei zu finden.

source: Also, &kappname; differentiates between the import of a bank statement file and historic data exported from another application. The default is to import a bank statement file. In case you are importing data from your previous personal finance manager application select the appropriate option.
de: &kappname; unterscheidet zwischen dem Import einer Datei mit dem Kontoauszug einer Bank und einer Datei mit Daten, die von einem anderem Programm exportiert wurden. Möchten Sie die Daten aus Ihren früheren Finanzverwaltungsprogramm importieren, dann wählen Sie die passende Einstellung.

source: In general the default QIF profile should work with your QIF data. In some cases it might become necessary to use a modified QIF profile. See the <link linkend="details.impexp.qifimp.profile">next section</link> for more details on that subject.
de: Normalerweise funktioniert das QIF-Standardprofil mit den meisten QIF-Daten zufriedenstellend. In manchen Fällen ist es nötig, ein angepasstes QIF-Profil zu verwenden. Weitere Informationen dazu finden Sie im <link linkend="details.impexp.qifimp.profile">nächsten Abschnitt</link>.

source: Click on <guibutton>Import</guibutton> to import the QIF file.
de: Klicken Sie auf <guibutton>Importieren</guibutton>, um die Daten aus der QIF-Datei einzufügen.

source: &kappname; will start scanning the file to determine the formats used to represent dates and numbers. In case it cannot determine a date format unambiguously, &kappname; will ask the user to select one from the list of possible date formats.
de: &kappname; startet das Einlesen der Datei und versucht, das verwendete Format für Datum und Zahlen zu bestimmen. Kann ein Datum nicht eindeutig bestimmt werden, müssen Sie das richtige Format aus einer Liste von möglicherweise passenden Formaten auswählen.

source: Next, &kappname; imports the data and creates all necessary objects, such as payee information, accounts and category records, and stock price information. Wherever possible, existing transactions will be matched against the imported information. A progress bar is shown and updated during the import process.
de: Als nächstes importiert &kappname; die Daten und erzeugt alle nötigen Objekte, wie zum Beispiel Zahler/Zahlungsempfänger, Konten, Kategorien und Aktienkurse. Soweit möglich werden die importierten Informationen an vorhandene Buchungen angepasst. Während des Imports wird der Fortschritt des Vorgangs angezeigt und laufend aktualisiert.

source: In case &kappname; could not detect the name of the account to be imported, the user will be asked to select the account into which the data should be imported. If the account does not already exist in your file, a new account can be created by clicking on <guibutton>Create</guibutton>.
de: Wenn &kappname; den Namen des zu importierenden Kontos nicht ermitteln kann, muss der Benutzer angeben, in welches Konto die Daten importiert werden sollen. Ist das Konto noch nicht in Ihrer Datei vorhanden, kann mit dem Knopf <guibutton>Erstellen</guibutton> das neue Konto angelegt werden.

source: At the end of the import, &kappname; shows a statement import statistics window.
de: Am Ende des Imports zeigt &kappname; eine Zusammenfassung der Ergebnisse an.

source: <screeninfo>Statement statistics</screeninfo>
de: <screeninfo>Statistik der Zusammenfassung</screeninfo>

source: <phrase>Statement statistics</phrase>
de: <phrase>Statistik der Zusammenfassung</phrase>

source: After importing, all of the imported transactions will be shown with a yellow background in the ledger view. In case &kappname; was able to match an imported transaction with an already existing transaction, the background is shown in light green.
de: Nach dem Import werden alle importierten Buchungen in einer gelben Hintergrundfarbe in der Kontenbuchansicht angezeigt. Konnten die importierten Buchungen bereits vorhandenen Buchungen zugeordnet werden, wird ein helles Grün als Hintergrundfarbe verwendet.

source: The next step is to verify the imported data and accept it. This is a general process and also applies to imports from other sources. It is outlined in a separate section of this document.
de: Als nächstes müssen die importierten Daten überprüft und übernommen werden. Dieser Schritt muss immer ausgeführt werden, auch beim Import aus anderen Quellen. Informationen dazu finden Sie in einem extra Abschnitt dieses Handbuchs.

source: The colors used to mark imported and matched transactions are customizable and may be different in your environment.
de: Die Farben für importierte und zugeordnete Buchungen können angepasst werden und weichen bei Ihnen möglicherweise ab.

source: Setting up a QIF profile
de: Einrichtung eines QIF-Profils

source: Because there is no universally standard format for a QIF file, different vendors have taken liberties with the format, and introduced their own nuances. The QIF Profile allows &kappname; to know about the peculiarities of your file. To edit an existing QIF Profile, or to create a new one, press the <guibutton>New</guibutton> button on the QIF Import dialog, near the profile selector.
de: Da es kein allgemeines Standardformat für eine QIF-Datei gibt, haben mehrere Softwareanbieter das Format verändert und eigenen Versionen benutzt. Mit einem QIF-Profil können Sie &kappname; angeben, wie die Ihre veränderte Datei verarbeitet werden soll. Um ein vorhandenes QIF-Profil zu bearbeiten oder ein neues Profil zu erstellen, wählen Sie den Knopf <guibutton>Neu</guibutton> im QIF-Importdialog neben der Profilauswahl.

source: QIF Profile Editor
de: QIF-Profileditor

source: Previous versions of &kappname; used to have a tab for date and amount specifications. &kappname; now determines those settings by scanning the file. If it cannot figure out all settings, it will interrogate the user during import.
de: In früheren Versionen von &kappname; wurden Karteikarten für Datum und Betrag benutzt. Jetzt bestimmt &kappname; diese Einstellungen beim Einlesen der Datei. Werden nicht alle Einstellungen erkannt, dann werden die fehlenden Informationen beim Import abgefragt.

source: Transaction matching
de: Buchungs-Zuordnung

source: As noted previously, one of the major drawbacks of the QIF format is the lack of a unique identifier for each transaction. Thus, if you import a QIF file and some of the transactions are already in your ledger, you may get duplicates. &kappname; attempts to get around this by looking for transactions that look similar to those you already have. If it finds something that looks like the same transaction, it will match the apparent duplicate.
de: Wie bereits vorher erklärt, ist die fehlende einzigartige Kennung jeder Buchung eines der Hauptprobleme des QIF-Formats. Daher können beim Import von QIF-Dateien doppelte Buchungen auftreten, wenn Sie bereits einige Buchungen in Ihrem Kontenbuch vorhanden sind. &kappname; versucht, beim Import Buchungen ähnlich bereits vorhanden zu erkennen. Werden anscheinend gleiche Buchungen festgestellt, dann werden sie als möglicherweise doppelte Buchungen markiert.

source: This can be a problem if you have transactions that look too similar but are actually different. In this case, you can unmatch those transactions later in the ledger view.
de: Das ist ein Problem bei ähnlichen aussehenden Buchungen, die aber tatsächlich verschieden sind. In diesen Fällen können Sie diese Buchungen später im Kontenbuch wieder trennen.

source: Writing an import filter
de: Entwicklung eines Importfilters

source: Sometimes you may have data in a custom format, like comma-separated-values (CSV) or something else unique to your situation. As of version 4.6, &kappname; includes a CSV Importer Plugin, but you can still import other types of files into &kappname; using a QIF Import Filter. A filter is a custom program you write which takes your special file as input, and produces a QIF file as output. This can be a shell script, a perl script, a compiled program written in C/C++, or anything else you can dream of, as long as the system can run it.
de: Möglicherweise liegen Ihre Daten in einem benutzerdefinierten Format vor, wie zum Beispiel als durch Komma getrennte Werte (CSV) oder anderen Formaten. Ab Version 4.6 enthält &kappname; ein CSV-Importmodul. Sie können aber auch andere Datenformate mit dem QIF-Importfilter in &kappname; importieren. Ein Filter ist ein selbst geschriebenes Programm, das die Importdatei als Eingabe liest und eine QIF-Datei als Ausgabe schreibt. Der Filter kann ein Bash-Skript, ein Perl-Skript oder ein kompiliertes in C/C++ geschriebenes Programm sein.

source: To use it, edit your favorite QIF Profile, and select the Filter tab. Enter the location of your filter program where prompted. Then, whenever you do a QIF import using this profile, the file you select for importing will be run through your filter first.
de: Um einen eigenen Importfilter einzusetzen, bearbeiten Sie Ihr bevorzugtes QIF-Profil und gehen zur Karteikarte „Filter“. Geben Sie dort den Speicherort des Filterprogramms ein. Wenn Sie dann eine QIF-Datei mit diesem Profil importieren, werden die Daten zuerst vom angegebenem Filterprogramm bearbeitet.

source: A common problem is to convert a list of comma-separated-values into a QIF file. This is a textbook case for the awk tool. Create a script called csv2qif.awk, with the following two lines as contents:
de: Ein häufiges Problem ist die Umwandlung einer Liste von durch Kommata getrennten Werten in das QIF-Format. Dies ist ein typischer Anwendungsfall für das Programm „awk“. Erstellen Sie ein Skript mit den Namen csv2qif.awk und fügen Sie folgende Zeilen ein:

source: Then, change the QIF keys (D,T,N,P,M) to match the order of your csv data. Set the input filter to <userinput>awk -f csv2qif.awk</userinput>.
de: Ändern Sie dann die QIF-Schlüssel (D,T,N,P,M) passend zur Reihenfolge der CSV-Daten. Stellen Sie als Eingabefilter <userinput>awk -f csv2qif.awk</userinput> ein.

source: Another problem sometimes arises in the encoding of QIF files. &kappname; expects files to be UTF8 encoded. If your file is encoded in something else, it can be useful to convert it to UTF8. For example to convert it from iso-8859-1, you would set the input filter to <userinput>recode iso-8859-1..utf-8</userinput>.
de: Ein anderes Problem tritt manchmal mit der Zeichenkodierung von QIF-Dateien auf. &kappname; nimmt an, dass Dateien im Format UTF8 kodiert sind. Haben Sie eine QIF-Datei in einem abweichenden Format, sollten Sie die Kodierung in UTF8 ändern. Um zum Beispiel eine Datei im Format iso-8859-1 zu importieren, setzen Sie den Eingabefilter auf <userinput>recode iso-8859-1..utf-8</userinput>.

source: Special &kappname; QIF extensions
de: Besondere &kappname;-Erweiterungen für das QIF-Format

source: As already mentioned, one of the major drawbacks of the QIF format is the lack of a unique identifier for each transaction. If you are writing your own QIF file creator (or filter, as described above), you can overcome this problem. &kappname; supports the '#' field. The importer will interpret this as a unique transaction ID, and disregard the record if the transaction is already in the system.
de: Wie bereits vorher erwähnt, ist die fehlende einzigartige Kennung jeder Buchung eines der Hauptprobleme des QIF-Formats. Schreiben Sie Ihr eigenes Programm oder Filter für das QIF-Format, können Sie diese Problem umgehen, indem Sie das Feld „#“ von &kappname; benutzen. Das Importmodul interpretiert dies als eindeutige Buchungskennung und übergeht den Datensatz, wenn die Buchung bereits im System vorhanden ist.

source: QIF Exporter
de: QIF-Export

source: To export one of your accounts to a QIF file, choose the <menuchoice><guimenuitem>Export</guimenuitem> <guimenuitem>QIF</guimenuitem></menuchoice> from the <guimenu>File</guimenu> menu. You will be prompted for which single account to export, what file to export it to, and what QIF Profile to use.
de: Um ein Konto in eine QIF-Datei zu exportieren, wählen Sie <menuchoice><guimenuitem>Exportieren</guimenuitem> <guimenuitem>QIF ...</guimenuitem></menuchoice> aus dem Menü <guimenu>Datei</guimenu>. Im Dialog müssen Sie dann das Konto für den Export, eine Ausgabedatei und das zu verwendende QIF-Profil angeben.

source: At the moment, QIF Exporter does not handle export of investments.
de: Zur Zeit können noch keine Investitionen mit dem QIF-Modul exportiert werden.

source: OFX Importer Plugin
de: OFX-Importmodul

source: Getting the plugin
de: Installation des Moduls

source: &kappname; will import OFX files painlessly. However, this functionality is not built into the core program. You must obtain and install the OFX Importer Plugin. Once that is installed, the command to import OFX files will automatically show up under the <menuchoice><guimenu>File</guimenu> <guimenuitem>Import</guimenuitem></menuchoice> menu.
de: &kappname; importiert QFX-Dateien ohne Probleme. diese Funktion ist aber nicht im eigentlichen Programm enthalten. Sie müssen das QFX-Importmodul besorgen und installieren. Dann ist diese Aktion automatisch im Menü <menuchoice><guimenu>Datei</guimenu> <guimenuitem>Importieren</guimenuitem></menuchoice> verfügbar.

source: Note that many prepackaged versions of &kappname; were built with the OFX importer already included or available as a separate package. If the OFX importer does not seem to be installed in your version, the first place to check is in the same place you got your base &kappname; package.
de: Es gibt fertige Pakete für &kappname;. die bereits das OFX-Modul enthalten oder als getrenntes Paket bereitstellen. Ist das OFX-Importmodul anscheinend nicht auf Ihren System installiert, sollten Sie zuerst überprüfen, ob es in der Paketquelle Ihres &kappname;-Programms erhältlich ist.

source: If you have installed from RPM, the OFX Importer Plugin is contained within the kmymoney-ofx RPM. It should be available from whatever source you got the base &kappname; RPM. If you have built from sources, all you need to do is have preferably the libOFX 0.9 development headers and libraries installed on your system. The &kappname; build process will detect these and compile the plugin. At the time of release of &kappname; 4.6, the latest libofx version was 0.9.4, which is also the minimum required version.
de: Haben Sie das Programm aus RPM-Paketen installiert, dann ist das OFX-Importmodul im RPM-Paket kmymoney-ofx enthalten. Dieses Paket finden Sie im Archiv, aus dem Sie das Programm &kappname; installiert haben. Installieren Sie &kappname; aus den Quelltexten, dann muss die Entwicklerversion der Bibliothek libOFX Version 0.9 auf Ihrem System installiert sein. Beim Kompilieren von &kappname; werden dann diese Bibliotheken gefunden und das Modul erstellt. Mit der Version 4.6 von &kappname; ist mindestens die Version 0.9.4 der Bibliothek libofx erforderlich.

source: Should you run into trouble trying to compile &kappname;, and you are certain you have the correct version of libOFX installed, please contact the developers list &devlist; for assistance. Include a copy of your config.log file, compressed first via gzip.
de: Haben Sie Probleme beim Kompilieren von &kappname;, aber die richtige Version der Bibliothek libOFX ist installiert, bitten Sie auf der Entwicklerliste &devlist; um Hilfe. Fügen Sie der E-Mail eine Kopie Ihrer Protokolldatei der Kompilierung als komprimierte GZip-Datei hinzu.

source: What is OFX
de: Was ist OFX?

source: Importing an OFX file
de: Import einer OFX-Datei

source: The most basic way to import an OFX file is to choose the importer from the menu bar. From the <guimenu>File</guimenu> menu, choose <guimenuitem>Import</guimenuitem>, and then <guimenuitem>OFX...</guimenuitem>. If OFX does not show up under Import, you do not have the OFX Importer Plugin installed correctly. Please see the previous section.
de: Um eine OFX-Datei zu importieren,wählen Sie das Importmodul aus der Menüleiste <menuchoice><guimenu>Datei</guimenu> <guisubmenu>Importieren</guisubmenu><guimenuitem>OFX ...</guimenuitem></menuchoice>. Wird der Menüeintrag <guimenuitem>OFX ...</guimenuitem> nicht angezeigt, ist kein OFX-Importmodul installiert. Im vorherigen Abschnitt finden Sie Hinweise zur Installation des OFX-Importmoduls.

source: The first thing the importer will do is ask you into which account to import the transactions. If there are transactions from multiple accounts in your file, you will be asked this question multiple times.
de: Zuerst müssen Sie im Importmodul das Konto für den Import der Buchungen angeben. Enthält die Datei Buchungen aus mehreren Konten, muss diese Angabe auch mehrfach erfolgen.

source: After importing, some of your transactions may be shown with an exclamation mark on a yellow triangle in the ledger. This is because they need to be assigned a category. The importer was not able to automatically assign a category based on your past transaction history. You can edit each transaction in the ledger to assign a category, and the mark will be removed.
de: Nach dem Import werden möglicherweise einige Buchungen mit einen Ausrufungszeichen in einem gelben Dreieck im Kontenbuch angezeigt. Die Ursache dafür liegt darin, dass diese Buchungen einer Kategorie zugeordnet werden müssen. Das Importmodul konnte keine passende Kategorie auf der Basis der vorherigen Buchungen ermitteln. Sie können jede Buchung im Kontenbuch bearbeiten und ihr eine Kategorie zuweisen, dann wird diese Markierung entfernt.

source: Please note that this section describes the <quote>native</quote> OFX importer. OFX files may also be imported using the AqBanking Importer Plugin if you have installed that. Note that the two importers do behave slightly differently, and they are written and supported by two different developers.
de: Bitte beachten Sie, dass in diesem Abschnitt das in &kappname; <quote>eingebaute</quote> OFX-Importmodul beschrieben wird. OFX-Dateien können auch mit dem AqBanking-Importmodul importiert werden, wenn es auf Ihren System installiert ist. Beide Module verhalten sich unterschiedlich, sie wurden von verschiedenen Entwicklern geschrieben.

source: Importing Investments
de: Import von Investitionen

source: Please note that if you are importing a file with investment transactions, those investments must first exist in your &kappname; file. The trading symbol is used to match, so please ensure that the symbol in &kappname; is exactly the same as the one in the file you're importing.
de: Denken Sie daran, dass beim Import von Investitionsbuchungen Konten für diese Investitionen bereits in Ihrer &kappname;-Datei vorhanden sein müssen. Das Handelssymbol wird für die Zuordnung der Buchungen verwendet. Überprüfen Sie daher, ob das in &kappname; verwendete Symbol mit dem Symbol in der Importdatei übereinstimmt.

source: Web Connect
de: Verbindung zum Internet
