Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/extragear-office/kmymoney_details-budgets.po
Languages: de

source: What is a budget?
de: Was ist ein Budget?

source: A budget is a categorized list of expected income and expenses for a period.
de: Ein Budget ist eine kategorisierte Liste der erwarteten Einnahmen und Ausgaben für eine bestimmte Zeitperiode.

source: The Budget facility of &kappname; allows you to create annual budgets. More than one Budget can be created for any year. You set monthly Budget values against any Income or Expense categories that you have defined. The values can be set in three ways, depending on the Period:
de: Die Budget-Funktionalität von &kappname; erlaubt es Ihnen, jährliche Budgets zu verwalten, wobei mehrere Budgets pro Jahr erzeugt werden können. Sie definieren dabei monatliche Budgetwerte für beliebige Einnahmen- oder Ausgabenkategorien, die existieren. Diese Budgetwerte können auf drei verschiedene Arten gesetzt werden, abhängig von der Periode:

source: Monthly
de: Monatlich

source: (Default) specify a single value applied to every month in the Budget
de: Eingabe eines einzelnen Wertes, der jedem Monat des Budgets zugeordnet wird. Dies ist die Voreinstellung.

source: Yearly
de: Jährlich

source: specify a single value to divide evenly across each month in the Budget
de: Geben Sie einen Wert ein, der auf die einzelnen Monate eines Jahres im Budget aufgeteilt wird.

source: Individual
de: Individuell

source: specify separate values for each month.
de: Geben Sie für jeden Monat einen beliebigen Wert ein.

source: This is used for income and expenses spread irregularly through the year.
de: Dies wird verwendet, um Einnahmen und Ausgaben unregelmäßig über das Jahr zu verteilen.

source: &kappname; provides a number of reports which compare actual income and expenses against the entered Budgets. These are described in more detail in <link linkend="budget.details.reports">another section</link>.
de: &kappname; bietet zahlreiche Berichte an, um aktuelle Einnahmen und Ausgaben mit den Budgetwerten zu vergleichen. Diese Berichte ausführlich in <link linkend="budget.details.reports">diesem Abschnitt</link> beschrieben.

source: Your budgets
de: Ihre Budgets

source: You can access your budgets by clicking the appropriate icon in the navigation pane at the left hand side of your &kappname; window.
de: Sie können auf Ihre Budgets durch Anklicken des entsprechenden Symbols im linken Navigationsbereich des &kappname;-Fensters zugreifen.

source: There are two major sections to the budget window. These are described in more detail below. On the left, the main section displays the list of budgets you have created. Above that are buttons for creating, renaming, and deleting budgets. On the right, there are three sections. At the top is the Accounts List. At the bottom is a display of the amounts assigned to the budget for the category selected in the Accounts List above. Between those two areas are some additional controls for managing the budget.
de: Es gibt zwei Hauptbereiche im Budgetfenster. Diese werden im folgenden genauer beschrieben. Links wird eine Liste aller von Ihnen erstellen Budget angezeigt. Darüber finden Sie Knöpfe, mit denen Sie Budgets erzeugen, umbenennen und löschen können. Auf der rechten Seite gibt es drei Bereiche. Oben sehen Sie die Kontenliste. Unten werden die Beträge angezeigt, die zum Budget der in der Kontenliste ausgewählten Kategorie gehört. Dazwischen gibt es zwei Bereiche mit weiteren Bedienungselementen zur Verwaltung der Budgets.

source: Viewing, creating, renaming, and deleting budgets
de: Budgets erstellen, umbenennen, ändern und löschen

source: This section of the Budgets window displays the list of Budgets contained in the current &kappname; file. If no Budget has yet been created the list will be empty. The list of Budgets has two columns:
de: Dieser Bereich des Fensters „Budget“ zeigt eine Liste aller Budgets, die in der aktuellen &kappname;-Datei vorhanden sind. Wurde bisher noch kein Budget erzeugt, ist diese Liste leer. Die Budgetliste hat zwei Spalten:

source: Name of the Budget
de: Name des Budgets

source: Year
de: Jahr

source: Fiscal year of the Budget. Note that the starting month and day of the fiscal year can be specified in the <link linkend="details.settings.general.global">Configure &kappname; dialog.</link>
de: Geschäftsjahr für das Budget. Sie können den Beginn des Geschäftsjahres (Monat und Tag) im <link linkend="details.settings.general.global">Einrichtungsdialog von &kappname;</link> festlegen.

source: Values from the selected Budget are displayed to the right. To select a different Budget you can click on the Budget in the list. Alternatively, when the list has focus, you can select a different Budget using the up and down keys. If you have made changes to a Budget and then select a different budget &kappname; will ask you whether you want to save or discard the changes.
de: Die Werte des in der Liste gewählten Budgets werden rechts angezeigt. Um ein anderes Budget auszuwählen, klicken Sie den entsprechenden Eintrag der Liste mit der Maus an. Wenn die Liste den Fokus besitzt, können Sie alternativ auch mit den Cursor-Steuertasten "Hoch" und "Runter" einen anderen Listeneintrag auswählen. Haben Sie ein Budget geändert und wählen dann ein anderes Budget, öffnet &kappname; einen Dialog mit der Abfrage, ob die Änderungen gespeichert oder verworfen werden sollen.

source: There are three buttons above the list of Budgets.
de: Oberhalb der Budgetliste gibt es drei Knöpfe.

source: <term>New</term>
de: <term>Neu</term>

source: Create a new, empty budget. The default name of a new budget is "Budget &lt;year&gt;" where &lt;year&gt; is the current fiscal year.
de: Erstellt ein neues leeres Budget. Der Standardname des neuen Budgets ist „Budget &lt;Jahr&gt;“, dabei ist Jahr das aktuelle Geschäftsjahr.

source: Rename
de: Umbenennen

source: Edit the name of the selected Budget.
de: Den Namen des ausgewählten Budgets ändern

source: You can also edit the name of a Budget by double-clicking on the name of a Budget in the list.
de: Sie können den Namen eines Budgets ändern, in dem Sie auf den Namen eines Budgets in der Liste doppelklicken.

source: Delete
de: Löschen

source: Delete the selected Budget
de: Löscht das in der Liste ausgewählte Budget

source: Additional options are available on a menu accessed by right-clicking on a Budget.
de: Über einen rechten Mausklick auf ein Budget erreichen Sie ein Menü mit weiteren Optionen.

source: New Budget
de: Neues Budget

source: Create a new, empty Budget.
de: Erzeugt ein neues, leeres Budget.

source: Rename Budget
de: Budget umbenennen

source: Rename the selected Budget.
de: Benennt das ausgewählte Budget um.

source: Change budget year
de: Jahr des Budgets ändern

source: Displays a window with a list of years to select a different fiscal year for the budget.
de: Es öffnet sich ein Fenster mit einer Jahresliste, aus der Sie ein Geschäftsjahr für das Budget auswählen können.

source: Delete budget
de: Budget löschen

source: Delete the selected Budget.
de: Löscht das ausgewählte Budget.

source: Copy budget
de: Budget kopieren

source: Creates a copy of the selected Budget. The new Budget has the name "Copy of &lt;budget&gt;", where &lt;budget&gt; is the name of the copied Budget.
de: Erzeugt eine Kopie des ausgewählten Budgets mit dem neuen Namen "Kopie von &lt;Budget&gt;", wobei &lt;Budget&gt; der Name des kopierten Budgets ist.

source: Budget based on forecast
de: Budget basierend auf Vorhersage

source: Fills in budget amounts based on data from &kappname;'s Forecast values. See the section on <link linkend="details.forecast.define">Forecasts</link> for more information.
de: Erstellt ein Budget mit Werten aus der Vorhersagefunktion von &kappname; Weitere Informationen finden Sie im Abschnitt <link linkend="details.forecast.define">Vorhersage</link> .

source: Account List
de: Kontenliste

source: The Accounts List displays the list of Income and Expense Categories. (Remember, within &kappname;, categories are treated as a special type of account.) As in other places in &kappname;, the list is organized in a tree structure. The list can be expanded or collapsed to show or hide Subcategories within a Category. The Accounts List has a number of columns:
de: Die Kontenliste zeigt alle Einnahmen- und Ausgabenkategorien an. Kategorien werden in &kappname; als besondere Arten von Konten behandelt. Wie auch an anderer Stelle in &kappname; wird die Liste in Form einer Baumstruktur angezeigt. Die Zweige des Baumes können ein- oder ausgeklappt werden, sodass die entsprechenden Unterkategorien ein- oder ausgeblendet werden. Die Kontenliste hat zahlreiche Spalten:

source: Account
de: Konto

source: Account (Category) name
de: Kontenname (Kategorie)

source: Type
de: Typ

source: Category Type (Income or Expense)
de: Kategorietyp (Einnahme oder Ausgabe)

source: Total Balance
de: Gesamtsaldo

source: Current balance of Account. This will be blank for Categories, unless the Category is defined in a foreign currency. In this case, Total Balance will show the value for the Category in its defined currency.
de: Der aktuelle Saldo des Kontos. Bei Kategorien ist diese Angabe nicht vorhanden, es sei denn, die Kategorie ist in einer ausländischen Währung definiert. Dann wird als Gesamtsaldo der Wert der Kategorie in der definierten Währung angezeigt.

source: Total Value
de: Gesamtwert

source: Total yearly value in the Budget. If a Category has Subcategories and the Category's list of Subcategories is collapsed the value displayed is the sum of the values for the Category and all of its Subcategories. If a Category is defined in a foreign currency, the Total Value will show the value in the base currency.
de: Jährlicher Gesamtwert des Budgets. Wenn eine Kategorie weitere Unterkategorien enthält und diese eingeklappt sind, so wird die Summe der Kategorie und aller Unterkategorien angezeigt. Ist eine Kategorie in ausländischer Währung definiert, wird der Gesamtwert in der Basiswährung angezeigt.

source: Below the Accounts List are several controls. The Update and Revert buttons are described further below. The collapse and expand buttons collapse or expand the entire Accounts List.
de: Unter der Kontenliste finden Sie mehrere Knöpfe. Die Knöpfe zum Aktualisieren und Zurücksetzen werden im Folgenden näher erläutert. Mit den beiden rechten Knöpfen können Sie die gesamte Kontenliste ein- und ausklappen.

source: The Accounts List can be filtered in two ways. Checking the "Hide unused categories" checkbox hides any Categories for which no value has been assigned to the Category or any of its Subcategories. To the right of this, is an unlabelled text box. Only categories which include whatever is typed in this box are listed, but their parent categories are also listed.
de: Die Kontenliste kann auf zwei Arten gefiltert werden. Mit dem Ankreuzfeld "Ungenutzte Budget-Kategorien ausblenden" werden alle Kategorien ausgefiltert, denen der Kategorie oder allen Unterkategorien kein Wert zugewiesen ist. Rechts daneben finden Sie ein unbeschriftetes Eingabefeld. Geben Sie hier Text ein, dann werden nur Kategorien einschließlich der übergeordneten Kategorien angezeigt, deren Name diesen Text enthält.

source: Note that changing either the "Hide unused budget categories" or the filter value is likely to change the list of Categories display. You may need to re-expand the list to see all the Categories that should be displayed with the current settings.
de: Beachten Sie, dass sowohl das Ausblenden ungenutzter Kategorien als auch der im Filter eingegebene Text die Liste der angezeigten Kategorien verändert. Eine eingeklappte Liste müssen Sie wieder ausklappen, um die mit den aktuellen Einstellungen gefilterten Kategorien zu sehen.

source: Assignments
de: Anlagen

source: The Assignments area shows the values for the Category selected in the Accounts List.
de: Der Bereich „Anlagen“ zeigt die zugewiesenen Budgetwerte der ausgewählten Kategorien in der Kontenliste.

source: Displays the name of the selected Category. If the Category is a Subcategory, its full name is displayed in the Category:Subcategory format.
de: Zeigt den Namen der ausgewählten Kategorie. Handelt es sich um eine Unterkategorie, dann wird der vollständige Name der ausgewählten Kategorie in der Form "Kategorie:Unterkategorie" angezeigt.

source: Total
de: Summe

source: Displays the total yearly value assigned to the Category
de: Zeigt die der Kategorie zugeordnete jährliche Summe an.

source: Include subaccounts
de: Unterkonten einschließen

source: If this is checked, then Reports show actual income or expenses in Subcategories belonging to the Category against the Category instead of the Subcategory.
de: Ist das Feld angekreuzt, so werden auch die Einnahmen und Ausgaben der Unterkategorien mit dem Budget der übergeordneten Kategorie verrechnet.

source: If a Subcategory has a value defined in the Budget, then the income and expenses are shown against the Subcategory.
de: Wenn in einer Unterkategorie ein Budgetwert definiert wird, so werden die Einnahmen und Ausgaben zusätzlich gegen das Budget der Unterkategorie verrechnet.

source: If the Category selected in the Accounts List has its Subcategories collapsed, although its Total Value will show the sum of the Total Values for all its Subcategories, the amounts in the Assignments area may still show 0, unless this box has been checked or an amount has explicitly been assigned to the Category.
de: Wenn die Unterkategorien einer in der Kontenliste ausgewählten Kategorie eingeklappt sind und obwohl der Gesamtwert der Kategorien die Summe der Gesamtwerte der Unterkategorien anzeigt, kann als Summe in Bereich Anlagen trotzdem ein Wert von 0 angezeigt werden, wenn dieses Ankreuzfeld nicht aktiviert wurde oder der Kategorie direkt ein Wert zugewiesen wurde.

source: In general, for you will either check this box and assign values to the Category and not to any of its Subcategories, or not check the box, and assign values to the Subcategories but not the Category. If any Subcategories have assigned amounts when this box is checked, then those amounts are rolled up to the Category.
de: Im Allgemeinen sollten Sie entweder dieses Ankreuzfeld aktivieren und den Kategorien und nicht den Unterkategorien Werte zuweisen, oder Sie sollten dieses Ankreuzfeld deaktivieren und den Unterkategorien und nicht den Kategorien Werte zuweisen. Ist irgendeiner Unterkategorie ein Wert zugewiesen und dieses Ankreuzfeld ist aktiviert, werden alle Werte der Unterkategorien aufsummiert und in der Kategorie angezeigt.

source: Clear
de: Eingabefeld leeren

source: The Clear button resets the budgeted category value or values to zero.
de: Der Knopf „Eingabefeld leeren“ setzt die Eingabefelder für die budgetierten Kategoriewerte zurück auf 0.

source: Period
de: Periode

source: The Period radio buttons allow you to select the period for which the value applies
de: Mit dem Auswahlknöpfen im Abschnitt „Periode“ geben Sie an, für welche Periode der rechts eingegebene Wert gilt.

source: A single value is entered, specifying the amount per month. This is the default setting.
de: Ein einzelner Wert, der den monatlichen Budgetwert angibt, wird eingegeben. Dies ist die Standardeinstellung.

source: A single value is entered, specifying the amount per year.
de: Ein einzelner Wert für einen Jahresbudgetwert wird eingegeben.

source: Values are specified for each Calendar month. This is used where expense or income is spread irregularly through the year.
de: Für jeden Kalendermonat kann ein individueller Budgetwert eingetragen werden. Dies wird verwendet, wenn die Einnahmen oder Ausgaben unregelmäßig auf das Jahr verteilt sind.

source: If a value is or values are already specified and the Period is changed &kappname; will ask whether to use the current total yearly value to assign the new values.
de: Wenn ein oder mehrere Werte bereits eingetragen sind und eine andere Periode ausgewählt wird, wird abgefragt, ob der errechnete Jahresbudgetwert für die neuen Werte verwenden soll.

source: Update and Revert
de: Aktualisieren und Rückgängig machen

source: For performance reasons, changes made to a Budget are not saved immediately. Instead, they must first be stored using the Update button and then permanently saved using the &kappname; Save.
de: Aus Geschwindigkeits-Gründen werden Änderungen an den Budgets nicht sofort abgespeichert. Stattdessen werden sie erst dann übernommen, wenn der Knopf „Aktualisieren“ gedrückt und anschließend die &kappname;-Datei gespeichert wird.

source: When a Budget's values are first modified, the Update and Revert buttons are enabled. Multiple changes can be made to the Budget. Pressing Update will store the changes and disable the Update and Revert buttons.
de: Sobald die Werte eines Budgets zum ersten mal verändert werden, werden die Knöpfe „Aktualisieren“ und „Rückgängig“ aktiviert. Änderungen an den Budgets können vorgenommen werden und ein Druck auf den Knopf „Aktualisieren“ wird die Änderungen übernehmen und anschließend die Knöpfe „Aktualisieren“ und „Rückgängig“ deaktivieren

source: The &kappname; Save only saves changes that have been stored using the Update button. Thus, if you have modified a Budget but not yet stored the changes &kappname; Save will not affect the modified Budget and the Update and Revert buttons remain enabled.
de: Die Funktion „Speichern“ von &kappname; speichert nur Änderungen, die über den Knopf „Aktualisieren“ im Budget-Fenster übernommen wurden. Das bedeutet, dass Ihre Änderungen an Budgets nicht gespeichert werden, wenn Sie den Knopf „Aktualisieren“ nicht drücken. In diesem Fall bleiben trotz des Abspeicherns der &kappname; Datei die Knöpfe „Aktualisieren“ und „Rückgängig“ im Budget-Fenster aktiv.

source: Revert undoes any changes made to a Budget since the last Update and disables the Update and Revert buttons.
de: Der Knopf „Rückgängig“ macht alle Änderungen an einem Budget rückgängig, die seit dem letzten Aktualisieren erfolgten. Nach Drücken des Knopfes „Rückgängig“sind die beiden Knöpfe „Aktualisieren“ und „Rückgängig“ deaktiviert.

source: Changes stored using Update but not yet saved using &kappname; Save can only be reverted by reloading the &kappname; file.
de: Änderungen der Budgets, die zwar mit „Aktualisieren“ übernommen, aber noch nicht über die Funktion „Speichern “von &kappname; gesichert sind, können nur durch Neuladen der &kappname;-Datei wieder rückgängig gemacht werden.

source: Budget Reports
de: Budgetberichte

source: &kappname; provides a number of reports to compare actual income and expenses against a Budget. These are listed in Reports under "Budgeting". There are two types of Budget Reports:
de: &kappname; bietet zahlreiche Berichte an, um aktuelle Einnahmen und Ausgaben mit den Budgetwerten zu vergleichen. Diese Berichte sind unter "Budgetierung" zu finden. Es gibt zwei Arten von Berichten für Budgets:

source: Budget only
de: Nur Budgets

source: These reports display values from a Budget.
de: Diese Berichte zeigen die Werte eines Budgets an.

source: Monthly Budget
de: Monatliches Budget

source: Displays the monthly values from a Budget.
de: Zeigt die Monatswerte eines Budgets an.

source: Yearly Budget
de: Jährliches Budget

source: Displays the monthly values from a Budget, with yearly total.
de: Zeigt die Jahreswerte eines Budgets mit der Summe für das Jahr an.

source: Budget vs. Actual
de: Vergleiche zwischen Budget und Ist

source: These reports compare values from a Budget to actual income and expenses. In each budget report you can find the columns Budget, Actual, and Difference. Each report differs in the period that is shown.
de: In diesen Berichten werden die Werte eines Budgets mit den tatsächlichen Einnahmen und Ausgaben verglichen. In jedem Budgetbericht finden Sie die Spalten Budget, Ist und die Differenz. Jeder Bericht umfasst unterschiedliche Zeiträume.

source: Budget vs. Actual This Year
de: Budget und Ist für das aktuelle Jahr

source: From the beginning of the year until today
de: Vom Jahresbeginn bis heute

source: Budget vs. Actual This Year (YTM)
de: Budget und Ist für das aktuelle Jahr (YTM)

source: From the beginning of the year until the last day of the previous month
de: Vom Jahresbeginn bis zum letzten Tag des vorherigen Monats

source: Monthly Budgeted vs. Actual
de: Monatlich Budgetiert und Ist

source: From the beginning of the year until the last day of the current month
de: Vom Jahresbeginn bis zum letzten Tag des jetzigen Monats

source: Yearly Budgeted vs. Actual
de: Jährlich budgetiert über Ist

source: From January 1st until December 31st
de: Vom 01. Januar bis zum 31. Dezember

source: Yearly Budgeted vs. Actual (Graph)
de: Jährlich Budgetiert und Ist (Grafik)

source: Same as the previous report but it shows the graph by default
de: Wie der vorherige Bericht, aber mit einer grafischen Darstellung der Werte als Standard

source: These reports provide a base from which custom reports can be created by changing the date range and Budget, among other options.
de: Auf der Grundlage dieser Berichte können benutzerdefinierte Berichte erzeugt werden, indem der neben vielen weiteren Einstellungen der Datenbereich und das Budget verändert werden.
