Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/extragear-office/kmymoney_faq.po
Languages: de

source: Questions and Answers
de: Fragen und Antworten

source: This chapter addresses a number of issues that frequently cause confusion, especially in new users of &kappname;. If you find that &kappname; is doing something you don't understand (or sometimes not doing something you want it to do,) please check this list before asking for help on one of the mailing lists. If your problem is not mentioned here, refer to the section on <link linkend="firsttime.contact">getting help</link>.
de: In diesem Kapitel werden Fragen behandelt, die besonders bei neuen Benutzern von &kappname; häufig auftreten. Bei Problemen mit &kappname; oder wenn Sie die Arbeitsweise des Programms nicht verstehen, sollten Sie zuerst dieses Kapitel lesen, befor Sie auf der Mailingliste fragen. Finden Sie hier keine Antwort auf Ihre Fragen, gehen Sie zum Abschnitt <link linkend="firsttime.contact">Kontakt mit den Entwicklern aufnehmen und Fehler berichten</link>.

source: Installation and Startup Questions
de: Fragen zur Installation und zum Start

source: &kappname; crashes when I try to launch it.
de: &kappname; stürzt beim Starten ab.

source: There are many reasons &kappname; might crash or give an error instead of starting up normally. You first need to determine if the problem is with the software or with your data. So, the first thing to try is to <link linkend="firsttime.launch">launch &kappname;</link> without opening your data file. If the application starts up, but crashes when you try to load your data file, try loading an older copy of your file. (You did make a backup, didn't you?)
de: Es gibt viele Gründe, warum &kappname; abstützen kann oder sich mit einer Fehlermeldung beendet, anstatt normal zu starten. Zuerst müssen Sie feststellen, ob der Fehler beim Programm oder an Ihren Daten liegt. Daher sollten Sie als erstes <link linkend="firsttime.launch">&kappname; starten</link>, ohne Ihre Datendatei zu laden. Wenn das Programm ohne Probleme startet, aber beim Laden der Datei abstürzt. versuchen Sie eine ältere Version der Datei zu laden, wenn Sie eine Sicherungskopie Ihrer Daten angelegt haben.

source: If &kappname; crashes on startup without trying to load a data file, there may be a problem with your installation. See the section on <link linkend="installation">installing &kappname;</link> or the section on <link linkend="firsttime.contact">getting help</link>.
de: Wenn &kappname; beim Starten abstürzt, ohne eine Datendatei zu laden, liegt möglicherweise eine Problem mit Ihrer Installation vor. Weitere Informationen finden Sie im Abschnitt <link linkend="installation">Installation von &kappname;</link> oder <link linkend="firsttime.contact">Hilfe erhalten</link>.

source: When I start KMyMoney I get a "Malformed URL" error. What's wrong?
de: Wenn ich &kmymoney; starte, wird die Fehlermeldung „Ungültige URL“ angezeigt. Was bedeutet diese Fehlermeldung?

source: Usually the reason for this is that you didn't run 'make install' as root. This step actually copies all of the icons, and other files needed by KMyMoney to run properly. If you did run this, make sure you passed the correct prefix to cmake at the beginning of your compile. See the section on <link linkend="installation.fromsource">compiling from source</link> for more information.
de: Der Grund für diese Fehlermeldung ist normalerweise, dass Sie „make install“ nicht als Systemverwalter ausgeführt haben. Dieser Befehl kopiert tatsächlich die Symbole und anderen Dateien, die von &kmymoney; benötigt werden, um richtig zu starten. Haben Sie diesen Befehl ausgeführt, überprüfen Sie, ob Sie das richtige Präfix für CMake am Beginn des Kompilierens benutzt haben. Weitere Informationen dazu finden Sie im Abschnitt <link linkend="installation.fromsource">Installation aus dem Quelltext</link>.

source: When I compile from source, all the icons show up as missing. What did I do wrong?
de: Wenn ich das Programm aus dem Quelltext kompiliere, fehlen alle Symbole. Wo liegt der Fehler?

source: Usually the reason for this is that you didn't run 'make install' as root. See the previous question/answer for more information.
de: Normalerweise ist der Grund für diesen Fehler, dass Sie „make install“ nicht mit den Rechten des Systemverwalters ausgeführt haben. In der vorherigen Frage finden Sie weitere Informationen.

source: What options are useful to pass to cmake?
de: Welche Optionen sollten für CMake angegeben werden?

source: The most important option is -DCMAKE_INSTALL_PREFIX. This specifies where you want to install KMyMoney; it should be the same location where &kde; is installed. In many distributions, cmake will find this location on its own, but if it can't, you can use the command line tool <command>kde4-config --prefix</command> to read out what the prefix should be. For &RedHat;-based distributions, including Mandriva and Fedora, &kde; is installed in <filename role="directory">/usr</filename>.
de: Die wichtigste Option ist -DCMAKE_INSTALL_PREFIX. Sie gibt an, wo KMyMoney installiert werden soll. Normalerweise ist das der &kde;-Installationsordner. In den meisten Distributionen findet CMake diese Ordner alleine, falls das aber nicht funktioniert, können Sie mit dem Befehl <command>kde4-config --prefix</command> den &kde;-Installationsordner ermitteln. Bei Distributionen auf der Basis von &RedHat; wie zum Beispiel Mandriva und Fedora wird &kde; in den Ordner <filename role="directory">/usr</filename> installiert.

source: Another useful option is -DCMAKE_BUILD_TYPE. Normally this is not set, but if it is set to Debug, it will allow you to build KMyMoney with debug symbols, which help in trying to figure out crashes. This option is essential if you are a developer and want to contribute.
de: Einer weitere sinnvolle Einstellung ist -DCMAKE_BUILD_TYPE. Dieser Wert ist normalerweise nicht gesetzt, aber mit dem Wert Debug wird das Programm mit Symbolen zur Fehlersuche erstellt. Damit ist es möglich, beim Absturz des Programms die Ursache dafür festzustellen. Sind Sie Entwickler und möchten das Programm verbessern, dann ist diese Einstellung unerlässlich.3

source: The Git version is broken! What do I do now?
de: Die Git-Version kompiliert nicht! Was kann Ich jetzt tun?

source: Usually the reason for this is that one of the developers made a change to the code that requires a clean reconfigure. See the end of the section on <link linkend="installation.fromsource">compiling from source</link> for instructions. If you follow these steps carefully, and still have a problem compiling, please post a message to the &kappname; Developers List at &devlist;, and include the failed output of either the cmake or make command.
de: Normalerweise ist der Grund für diesen Fehler, dass ein Entwickler den Quelltext so verändert hat, dass ein vollständig neues Konfigurieren erforderlich ist. Am Ende des Abschnitts <link linkend="installation.fromsource">Installation aus dem Quelltext</link> finden Sie Anleitungen zum Neukonfigurieren. Wenn Sie diese Anweisungen ausgeführt haben, aber das Programm immer noch nicht kompilieren können, schicken Sie eine E-Mail an die &kappname;-Entwickler auf der &devlist; und fügen Sie die Ausgabe der Befehle „cmake“ und „make“ als Anhang an.

source: Will &kappname; work on my X/&ubuntu; desktop? Will &kappname; work without a full KDE desktop?
de: Läuft &kappname; auf meinem X/&ubuntu;-System? Muss ich für &kappname; das gesamte KDE-System installieren?

source: Yes, &kappname; will work without a full &kde; desktop, but you will have to install the basic &kde; libraries first. The easiest way to do this is to use <link linkend="installation.distribution">your distribution's package management system</link>, which will handle these requirements automatically. If you are going to install from source, you will probably need development versions of those libraries; refer to these <link linkend="installation.fromsource">instructions</link> for details.
de: &kappname; benötigt keine vollständige &kde;-Arbeitsumgebung, aber Sie müssen die Basis-Bibliotheken für &kde; installieren. Am einfachsten ist es, wenn Sie das <link linkend="installation.distribution">Paketverwaltungssystem Ihrer Distribution</link> verwenden, das dieses Abhängigkeiten automatisch berücksichtigt. Wenn Sie das Programm aus dem Quelltext installieren, brauchen Sie die Entwicklungsversionen dieser Bibliotheken. Informationen dazu finden Sie im Abschnitt <link linkend="installation.fromsource">Installation aus dem Quelltext</link>.

source: Configuration Questions
de: Fragen zur Einrichtung

source: Account and Transaction Questions
de: Fragen zu Konten und Buchungen

source: Why can't I edit a transaction?
de: Warum kann ich eine Buchung nicht bearbeiten?

source: You cannot make any changes to a transaction with a date before the opening date of the account it is in. The most common reason for this is importing all the data for an account. If the import file does not contain an opening date for the account, &kappname; will use the current date. The way to fix this is to edit the account, and <link linkend="details.accounts.edit">change the opening date</link> to be earlier than any transaction in that account.
de: Sie können eine Buchung mit einem Datum vor dem Eröffnungsdatum des Kontos, zu dem es gehört, nicht ändern. Der häufigste Grund dafür ist, dass alle Daten eines Kontos importiert wurden. Enthält die importierte Datei kein Eröffnungsdatum für das Konto, wird es von &kappname; auf das aktuelle Datum gesetzt. Um dies zu beheben, bearbeiten Sie das Konto und ändern das <link linkend="details.accounts.edit">Eröffnungsdatum</link> auf ein Datum vor dem ersten Datum einer Buchung in diesem Konto.

source: Why is a transaction shown in red and how can I get rid of the color?
de: Warum wird eine Buchung in roter Farbe angezeigt und wie kann Ich das ändern?

source: A transaction is shown in red if any part of the amount has not been assigned to a category. This is most commonly caused by importing a QIF or OFX file or by downloading statement data online. All you have to do is to modify the transaction such that the whole amount of the transaction is assigned to categories.
de: Eine Buchung wird in roter Farbe angezeigt, wenn irgendein Teil des Betrages noch nicht einer Kategorie zugewiesen wurde. Die wird häufig beim Importieren von QIF- oder QFX-Dateien oder beim Herunterladen von Online-Kontoauszügen. Um das zu ändern, müssen Sie die Buchung so bearbeiten, dass der gesamte Buchungsbetrag an Kategorie zugewiesen wurde.

source: Why can't I add an opening balance to an account?
de: Warum kann ich einem Konto kein Eröffnungssaldo hinzufügen?

source: If you provide an opening balance when you create an account, it is shown as the first transaction for the account. If you do not, then the transaction is not there, and because it is a special type of transaction, you cannot simply add it as you could a deposit or withdrawal. However, you can add it later by <link linkend="details.accounts.edit">editing the account</link>.
de: Geben Sie bei der Erstellung eines Kontos ein Anfangssaldo an, dann wird es als erste Buchung dieses Kontos eingetragen. Fehlt diese Anfangssaldo, dann gibt es diese Buchung auch nicht. Da es sich hier um einen besondere Buchung handelt, kann Sie auch nicht wie ein Guthaben oder Abbuchung eingefügt werden. Sie können diese Buchung jedoch später beim <link linkend="details.accounts.edit">Bearbeiten des Kontos</link> hinzufügen.

source: When I created an account, I used the wrong type, and now it won't let me change it. I can edit the account, but the dropdown for account type is either disabled, or does not list all the possible types.
de: Als ich ein neues Konto erstellte, habe ich den falschen Kontentyp angegeben. Jetzt kann ich ihn nicht mehr ändern. Ich kann das Konto bearbeiten, aber das Aufklappfeld für die Kontotypen ist entweder deaktiviert oder es werden nicht alle möglichen Typen angezeigt.

source: You can easily change an account type between checking, savings, and cash. However, because of the way &kappname; stores the account information, it does not allow other changes of account type. The way around this is to create a new account of the correct type, move all the transactions from the old to the new account, and then delete the old account.
de: Sie können den Kontentyp beliebig zwischen Girokonto, Sparkonto und Bargeld ändern. Wegen der Art der Speicherung der Konteninformationen in &kappname; sind andere Änderungen des Kontentyps nicht möglich. Um diese Problem zu lösen, erstellen Sie ein neues Konto mit dem richtigen Typ, verschieben alle Buchungen vom alten zum neuen Konto und löschen dann das alte Konto.

source: I have a loan with 0% interest, but I get an error in the new loan wizard that does not let me use this value.
de: Ich habe einen Kredit mit 0 % Zinsen, aber im Assistenten für Kredite wird eine Fehlermeldung angezeigt und ich kann diesen Wert nicht eingeben.

source: The internal calculations of the new loan wizard do not allow a 0% interest rate. The best way to handle this situation is to <link linkend="details.accounts.create.account">create a simple liability account</link> with a starting balance for the amount of the loan, and then <link linkend="details.schedules.new">create a schedule</link> for the required payments.
de: In der internen Berechnung des Assistenten für Kredite kann kein Zinssatz von 0 % verwendet werden. Am einfachsten ist es, ein <link linkend="details.accounts.create.account">Verbindlichkeitskonto</link> mit einer Eröffnungsbilanz des Kreditbetrags zu erstellen und dann <link linkend="details.schedules.new">geplante Buchungen</link> für die nötigen Zahlungen zu erstellen.

source: Why don't I see all my transactions in the ledger?
de: Warum werden nicht alle meine Buchungen im Kontenbuch angezeigt?

source: There are several settings that control which transactions are displayed in the ledger view of an account. First, check the <link linkend="details.ledgers.view.filter">ledger filter area</link>. If there is anything typed in the search box, only transactions containing that text will be shown. If the status dropdown has been changed from <quote>Any status,</quote> then only transaction of the selected type will be shown. In addition, there are two important settings in the <link linkend="details.settings.general.filter">filter options</link> section on the &kappname; Settings dialog. If the <guilabel>Do not show transactions prior to</guilabel> field is set, only transactions on or after that date will be shown in the ledger. If the <guilabel>Do not show reconciled transactions</guilabel> box is checked, then no reconciled transactions will be shown.
de: Es gibt mehrere Einstellungen, die die Anzeige von Buchungen im Kontenbuch festlegen. Zuerst überprüfen Sie, ob der <link linkend="details.ledgers.view.filter">Filter</link> des Kontenbuchs benutzt wird. Haben Sie Text im Suchfeld eingegeben, dann werden nur Buchungen angezeigt, die diesen Text enthalten. Wenn im Auswahlfeld Status andere Kriterien als <quote>Alle Zustände</quote> eingestellt ist, werden nur die Buchungen für den ausgewählten Typ angezeigt. Zusätzlich gibt es zwei wichtige Einstellungen auf der Karteikarte <link linkend="details.settings.general.filter">Filter</link> der Seite „Allgemein“ des Einrichtungsdialogs für &kappname;. Ist die Einstellung <guilabel>Ausblenden der Buchungen vor</guilabel> aktiviert, werden nur Buchungen an oder nach diesem Datum im Kontenbuch angezeigt. Ist <guilabel>Abgeglichene Buchungen ausblenden</guilabel>aktiviert,werden keine abgeglichenen Buchungen angezeigt.

source: I mistyped the name of a payee and want to change it in all transaction. Is there a global search/replace?
de: Ich habe den Namen eines Zahlungsempfängers falsch geschrieben und möchte ihn in allen Buchungen ändern. Gibt es eine Funktion, um solche Werte in allen Daten zu suchen und zu ersetzen?

source: There is no global search and replace function in KMyMoney. Nevertheless, it is easy to change a payees name: select the Payees view and find the entry with the name you want to change. Click with the &RMB; on the payee, and select <menuchoice><guimenuitem>Rename payee</guimenuitem></menuchoice>. Enter the new name. Since the transactions only use a reference to the payees record, all transactions now show the new name.
de: Es gibt keine Funktion zum Suchen und Ersetzen in &kappname;. Trotzdem ist es einfach, den Namen eines Zahlungsempfängers zu ändern. Gehen Sie zur Ansicht Zahlungsempfänger und suchen Sie den Namen, den Sie ändern möchten. Klicken Sie mit der &RMB; auf diesen Eintrag und wählen Sie <guimenuitem>Zahlungsempfänger umbenennen</guimenuitem> im Kontextmenü. Geben Sie dann den neuen Namen ein. Da die Buchungen nur eine Referenz zum Eintrag des Zahlungsempfänger verwenden, zeigen alle Buchungen jetzt den geänderten Namen.

source: Why can't I delete an account?
de: Warum kann ich ein Konto nicht löschen?

source: Import and Export Questions
de: Fragen zu Import und Export

source: Where do I find some more information about OFX parameters?
de: Wo finde ich weitere Informationen über OFX-Parameter?

source: Here are some external sources which might give your more information: <ulink url="http://ofxblog.wordpress.com/">ofxblog</ulink> and <ulink url="http://www.ofxhome.com/">ofxhome</ulink>.
de: Zusätzliche Informationen zu OFX finden Sie unter <ulink url="http://ofxblog.wordpress.com/">ofxblog</ulink> und <ulink url="http://www.ofxhome.com/">ofxhome</ulink>.

source: Miscellaneous questions
de: Verschiedene Fragen

source: Why is there no translation for 'my' language?
de: Warum gibt es keine Übersetzung in meiner Sprache?

source: &kappname; uses the &kde; settings for language, so first, make sure that your region and language settings are correct. If they are, the most likely reason is that no one has offered to translate it yet. Translating &kde;/&Qt;-based applications is very simple, and does not require any programming skills. If you would like to translate &kappname; into your language, please post a message to the proper <ulink url="http://l10n.kde.org/teams-list.php">team mailing list</ulink>. Should you fail to find your language in the list or could not contact the team members please mail directly to the <ulink url="mailto:kde-i18n-doc@kde.org">KDE translation mailing list</ulink> (<ulink url="https://mail.kde.org/mailman/listinfo/kde-i18n-doc">subscription</ulink> required) and we will give you the details on how you can easily provide a translation for &kappname;.
de: &kappname; benutzt die &kde;-Einstellungen für Sprachen, deshalb überprüfen Sie als erstes die Einstellungen in <menuchoice><guimenu>Regionales</guimenu><guimenuitem>Land/Region &amp; Sprache</guimenuitem></menuchoice>in den &systemsettings;. Ist diese Einstellung richtig, hat wahrscheinlich noch niemand mit der Übersetzung begonnen. Das Übersetzen von &kde;- oder &Qt;-Programmen ist nicht schwer und erfordert keine Programmierkenntnisse. Möchten &kappname; in Ihre Sprache übersetzen, schicken Sie eine E-Mail an die <ulink url="http://l10n.kde.org/teams-list.php">Mailingliste</ulink> Ihre Sprache. Gibt es kein Team für Ihre Sprache oder können Sie keinen Kontakt herstellen, schicken Sie eine E-Mail direkt an die Liste der <ulink url="mailto:kde-i18n-doc@kde.org">KDE-Übersetzungteams</ulink> (<ulink url="https://mail.kde.org/mailman/listinfo/kde-i18n-doc">Abonnieren</ulink> erforderlich). Dann erhalten Sie alle nötigen Informationen, um Übersetzungen für &kappname; zu erstellen.

source: Why did the version number jump from 1.0.5 to 4.5, and what happened to KMyMoney2?
de: Warum wurde die Versionsnummer von 1.0.5 auf 4.5 erhöht und der Name KMyMoney2 geändert?

source: The use of KMyMoney2 was a historical legacy from when the project went from &kde; 1 to &kde; 2. To avoid changing the name every time there was a new &kde; version, we decided to stick with &kappname;.
de: Der Name KMyMoney2 war eine Altlast aus der Zeit als das Programm von &kde; 1 auf &kde; 2 portiert wurde. Um nicht mit jeder neuen Version von &kde; den Namen ändern zu müssen, entschieden die Entwickler, nur noch den Namen &kappname; zu benutzen.

source: The first version of &kappname; that was considered sufficiently stable was labeled 1.0, even though it ran under &kde; 3. As the project is now becoming more closely aligned with &kde; we decided to use the same major release number.
de: Die erste Version von &kappname;, die als stabile Version veröffentlicht wurde, hatte die Bezeichnung 1.0, obwohl sie unter &kde; 3 lief. Da das Projekt jetzt mehr in &kde; eingebunden ist, entschieden die Entwickler, die gleiche Hauptversionsnummer wie &kde; zu benutzen.

source: How can I report a bug? How can I request a new feature?
de: Wie kann Ich Fehler oder Wünsche berichten?

source: The developers encourage your feedback. See the section on <link linkend="firsttime.contact">Contacting the Developers / Reporting Bugs</link>.
de: Die Entwickler freuen sich über jede Rückmeldung. Siehe auch den Abschnitt <link linkend="firsttime.contact">Kontakt mit Entwicklern / Fehler berichten</link>.
