Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/extragear-office/kmymoney_makemostof.po
Languages: de

source: Making the most of &kappname;
de: &kappname; so gut wie möglich nutzen

source: While you could go ahead, clicking some buttons and filling in some data, after a time, you could decide you have done it wrong and start again, even if you did read the documentation on each part of &kappname;.
de: Wenn Sie einfach loslegen und hier einige Knöpfe drücken und dort einige Daten eingeben, werden Sie nach kurzer Zeit feststellen, dass Sie falsch angefangen haben. Sie beginnen nochmal neu, obwohl Sie die Dokumention zu allen Teilen von &kappname; gelesen hatten.

source: You will get a more effective system if you spend a little time planning how you are going to use &kappname;, so follow the steps given here.
de: Sie werden effektiver mit dem Programm arbeiten, wenn Sie zuerst überlegen, wie und wofür Sie &kappname; verwenden möchten. Daher halten Sie sich an die folgenden Hinweise.

source: Basic Accounting
de: Grundlagen der Buchführung

source: Imagine your money as balls, or beans, and to stop them rolling around you keep them in a box, or pot. Accounting, or Bookkeeping, is the process of counting and keeping track of the beans in the pot, or several pots.
de: Stellen Sie sich Ihr Geld als Bälle vor und um zu verhindern, dass sie wegrollen, packen Sie sie in eine Kiste. Kontenführung und Buchhaltung ist der Prozess des Zählens und Verwaltens der Bälle in einer oder mehrerer Kisten.

source: You have some money in the pot marked <quote>Cash</quote>. You buy some goods, so you take some beans out of the cash pot and place them into another pot marked <quote>Supplier.</quote> The supplier gives you some goods in exchange for the cash, so you take the beans out of the pot marked <quote>Supplier</quote> and put them in the pot marked <quote>Goods</quote>.
de: Sie haben Geld bzw. einige Bälle in der Kiste <quote>Bargeld</quote>. Sie kaufen Waren, dazu nehmen Sie einige Bälle aus der Bargeldkiste und legen Sie in eine andere Kiste, die mit <quote>Lieferant</quote> beschriftet ist. Der Lieferant gibt Ihnen Waren im Austausch gegen Bargeld, daher nehmen Sie die Bälle aus der Kiste <quote>Lieferant</quote> und legen Sie in die Kiste <quote>Waren</quote>.

source: The goods have a value (the price you paid) so you still have the same amount of beans, some representing cash and some representing goods.
de: Die Waren haben einen Wert, den gezahlten Preis, daher haben Sie immer noch die gleiche Anzahl Bälle. Einige der Bälle stellen das Bargeld und andere die Waren dar.

source: In this case you have two movements of beans, or transactions. Each transaction needs two entries, one to take beans out and one to put beans in. This is called <quote>double entry bookkeeping</quote> or <quote>double entry accounting.</quote> The recording of the transactions is done in a <quote>Ledger;</quote> each pot is known as an <quote>Account</quote> or <quote>Ledger code</quote>.
de: In diesem Fall gibt es zwei Verschiebungen von Bällen, auch Buchungen genannt. Jede Buchung besteht aus zwei Schritten, einen um die Bälle heraus zu nehmen und eine andere um die Bälle herein zulegen. Dies wird auch <quote>doppelte Buchführung</quote> genannt. Die Aufzeichnung der Buchungen erfolgt in einem Kontenbuch und jede Kiste entspricht einem <quote>Konto</quote>.

source: Now you take some goods and give them to a customer, who gives you some cash in exchange. The goods were worth some beans and, hopefully, the customer has given us more beans than that, so making a profit. To over simplify, the beans from the Goods pot come back as Cash, but we can split that as the <quote>Cost of Goods sold</quote> and <quote>Profit.</quote> This transaction has three entries; one side of the <quote>double entry</quote> has been split.
de: Nun nehmen Sie einige Waren und geben sie einem Kunden, der Ihnen im Gegenzug Bargeld gibt. Der Wert der Waren entsprach einer bestimmten Anzahl an Bällen. Hat Ihnen der Kunde mehr Bälle zurückgegeben, dann haben Sie einen Gewinn erzielt. Vereinfacht gesagt kommen die Bälle aus der Kiste <quote>Waren</quote> als Bargeld zurück, das in die <quote>Kosten der verkauften Waren</quote> und den <quote>Gewinn</quote> aufgeteilt werden kann. Diese Buchung besteht aus drei Vorgängen, eine Seite der <quote>doppelten Einträge</quote> wurde aufgeteilt.

source: This will be covered in more detail later on in this handbook.
de: Weitere Informationen dazu finden Sie später in diesem Handbuch.

source: Defining the accounts (personal records)
de: Definition der Konten (private Nutzung)

source: Most accounts, or pots, above represent a measure of our <quote>Worth.</quote> The cash and goods represent our <quote>Assets;</quote> so does what we are owed if our customers have not yet given us the money. The money we owe, say if we had not paid our suppliers, are our <quote>Liabilities.</quote> These accounts are transferable to Cash and have a value.
de: Die meisten oben genannten Konten oder Bälle bilden einen Maßstab für deren <quote>Wert</quote>. Das Bargeld und die Waren repräsentieren die <quote>Anlagen</quote>, also das was man besitzt, wenn die Kunden noch nicht bezahlt haben. Das Geld, das anderen geschuldet ist, weil zum Beispiel die Lieferanten noch nicht bezahlt sind, sind die <quote>Verbindlichkeiten</quote>. Diese Konten können in Bargeld umgesetzt werden und haben einen Wert.

source: Any pots that cannot be valued are <quote>Income</quote> or <quote>Expense.</quote> Our phone bill (or the phone company to which we pay the bill) cannot be valued; we know how much we have paid, but not how much anyone else has paid. We know how much our employer has paid us, but we do not know how much they have paid anybody else, or how much money they have left to pay us next month. Although we cannot determine an actual value for these pots, it is useful to monitor how much we have put into or taken out of each of them.
de: Alle „Kisten“ können als <quote>Einnahmen</quote> oder <quote>Ausgaben</quote> bewertet werden. Die Telefonrechnung oder die Telefongesellschaft, der Sie die Rechnung bezahlen, kann nicht bewertet werden. Sie wissen, wie viel Sie bezahlt haben, aber nicht was andere zahlten. Sie wissen, was Ihr Arbeitgeber Ihnen zahlt, aber nicht, was er allen anderen zahlt oder wieviel Geld im nächsten Monat für die Löhne zur Verfügung steht. Obwohl der aktuelle Wert für diese „Kisten“ nicht zu bestimmen ist, ist eine Kontrolle darüber sinnvoll, was Sie eingegeben oder herausgenommen haben.

source: In some cases a supplier is a <quote>Liability,</quote> in others it is an <quote>Expense.</quote> This is something we need to consider and decide for each case. Similarly, you may set up a loan as a Liability, particularly if you transfer the money into your bank account, but it could be an Expense if it was to buy some furniture.
de: In einigen Fällen ist ein Lieferant eine <quote>Verbindlichkeit</quote>, in anderen ist es eine <quote>Ausgabe</quote>. Dies muss für jeden einzelnen Fall beurteilt und entschieden werden. Ebenso können Sie einen Kredit als Verbindlichkeit einrichten, insbesondere wenn Sie das Geld auf Ihr Bankkonto überweisen. Es kann aber auch eine Ausgabe sein, wenn Sie einige Möbel kaufen.

source: Consider how you want to track and analyze your income and expenses. This will help you decide how to set them up in &kappname;.
de: Überlegen Sie sich, wie Sie Ihre Einnahmen und Ausgaben überwachen und analysieren möchten. Dies erleichtert Ihnen die Einstellung für &kappname;.

source: Finally, consider if you want everything in one set of accounts, or two or more. This may depend on the legal framework or just how you want to analyze things. Each set of accounts would be handled separately.
de: Schließlich müssen Sie entscheiden, ob Sie nur eine oder mehrere Gruppen von Konten benutzen möchten. Diese Entscheidung kann von gesetzlichen Rahmenbedingen oder davon bestimmt werden, wie Sie Ihre Finanzen analysieren möchten. Jede Gruppe von Konten wird getrennt verwaltet.

source: Defining the accounts (business records)
de: Definition der Konten (geschäftliche Nutzung)

source: There are similarities to setting up accounts for personal use, but there are additional considerations, including legal guidelines and requirements. &kappname; does not explicitly address any of these issues, as it has been designed as a <quote>personal</quote> finance manager. In addition, these additional issues are not addressed in this handbook, but you must be aware of them if you are going to attempt to use &kappname; for a business.
de: Es gibt Ähnlichkeiten zur Einrichtung von Konten für den persönlichen Gebrauch, aber es gibt Zusätzliches zu bedenken, wie zum Beispiel gesetzliche Vorschriften und Anforderungen. &kappname; hat keine besonderen Funktionen für diese Belange, da es als Finanzverwaltung für den <quote>persönlichen</quote> Gebrauch entwickelt wurde. Auf diese Belange wird auch in der Dokumentation nicht weiter eingegangen, aber Sie müssen sich darüber im Klaren sein, wenn Sie &kappname; für den geschäftlichen Bereich verwenden möchten.

source: Mapping your finances to &kappname;
de: Einrichtung von &kappname; für Ihre Finanzen

source: So, collect up your papers and see the following sections for each item in &kappname;.
de: Stellen Sie also Ihre Unterlagen zusammen und lesen Sie die nächsten Abschnitte über die einzelnen Elemente in &kappname;.

source: Accounts
de: Konten

source: These hold a value. Transactions are created against one or more accounts.
de: Diese enthalten Werte. Buchungen werden gegen ein oder mehrere Konten durchgeführt.

source: Accounts - Asset
de: Konten - Vermögen

source: These are the accounts which hold your money and possessions that you wish to monitor. The following types are available:
de: Auf diesen Konten befindet sich Ihr Geld und Ihr Besitz, die sie überwachen möchten. Es gibt folgende Kontenarten:

source: Checking
de: Girokonto

source: Standard bank checking account.
de: Standard-Girokonto bei einer Bank

source: Savings
de: Sparkonto

source: Standard bank savings account.
de: Standard-Sparkonto bei einer Bank

source: Cash
de: Bargeld

source: Money in your hand or wallet.
de: Das Geld in Ihrer Hand oder Brieftasche.

source: Loan
de: Kredit

source: Loans you make to someone else.
de: Kredite, die Sie anderen gegeben haben.

source: Investment
de: Investitionen

source: Money you invest.
de: Ihr investiertes Geld.

source: Asset
de: Anlagen

source: Property, collections, etc.
de: Besitz, Sammlungen usw.

source: Accounts - Liability
de: Konten - Verbindlichkeiten

source: These are the accounts which represent your debts and money owed that you wish to monitor. The following types are available:
de: Diese Konten zeigen Ihre Schulden und geliehenes Geld, das sie überwachen möchten. Es gibt folgende Kontenarten:

source: Credit card
de: Kreditkarte

source: Standard credit card account.
de: Standard-Kreditkartenkonto bei einer Bank

source: Loans made to you, mortgages, etc.
de: Ihre Kredite, Hypotheken &etc;

source: Liability
de: Verbindlichkeiten

source: Anything else you owe that is not a loan.
de: Alle sonstigen Verbindlichkeiten, die kein Kredit sind.

source: Institutions
de: Geldinstitute

source: These are completely optional and can be used to group accounts, and show a total value for all accounts in each group.
de: Geldinstitute können wahlweise benutzt werden, um Ihre Konten in Gruppen zusammenzufassen. Für jede Gruppe wird der Gesamtwert aller Konten angezeigt.

source: Categories
de: Kategorien

source: These represent non-managed income and expense accounts that do not have a value. The total value of transactions is shown against each category. A category or transfer account is required for each transaction.
de: Kategorien stellen nicht verwaltete Konten für Einnahmen und Ausgaben ohne Wert dar. In jeder Kategorie wird die Gesamtsumme aller Buchungen angezeigt. Jede Buchung benötigt eine Kategorie oder ein Buchungskonto.

source: Sub-Categories
de: Unterkategorien

source: Categories can be split into sub-categories, but this relationship is only for display purposes, as the sub-category totals are not included in the higher level category total.
de: Kategorien können in Unterkategorien aufgeteilt werden, aber diese Beziehung wird nur zur Ansicht benutzt, da die Summen von Unterkategorien nicht in der Summe der übergeordneten Kategorie enthalten sind.

source: Tags
de: Stichwörter

source: Payees
de: Zahlungsempfänger

source: These are optional for transactions. They are required for Scheduled transactions. A transaction history, with category, is shown against each payee.
de: Für normale Buchungen ist die Angabe eines Zahlungsempfängers freigestellt, für geplante Buchungen ist diese Angabe jedoch erforderlich. Der Verlauf aller Buchungen einschließlich der Kategorien wird für jeden Zahlungsempfänger angezeigt.

source: Scheduled transactions
de: Geplante Buchungen

source: Where transactions occur on a regular basis, these can be set up against a Schedule. Transactions are created from a schedule; any that are overdue can be seen on the home page.
de: Haben Sie regelmäßig wiederkehrende Buchungen, können Sie dafür geplante Buchungen erstellen. Diese Buchungen werden anhand eines Zahlungsplans ausgeführt. Alle überfälligen Buchungen werden auf der Übersichtsseite angezeigt.

source: Useful Tips
de: Nützliche Tipps

source: Unless you keep your money under your mattress or under the floorboards, you probably make use of one or more institutions where you have accounts, which may be in credit or debit. In order to familiarize yourself with the way &kappname; works, choose an account you want to track with &kappname; and select <menuchoice><guimenu>File</guimenu> <guimenuitem>New</guimenuitem></menuchoice> in order to set up an account file.
de: Wenn Sie Ihr Geld nicht unter Ihrer Matratze oder im Sparstrumpf aufbewahren, haben Sie wahrscheinlich einige oder mehrere Banken, bei denen Sie Konten im Guthaben oder im Soll haben. Um mit der Arbeitsweise von &kappname; vertraut zu werden, wählen Sie ein Konto, das Sie mit &kappname; verwalten möchten und wählen <menuchoice><guimenu>Datei</guimenu> <guimenuitem>Neu</guimenuitem></menuchoice>, um eine neue Kontendatei zu erstellen.

source: If you have used another personal finance manager, you may be able to import the data from it into &kappname;.
de: Haben Sie bereits ein anderes Finanzverwaltungsprogramm benutzt, können Sie möglicherweise die Daten in &kappname; importieren.

source: If you have some regular receipts into or outgoings from this account, go to Payee and enter the names of both the payers and the payees involved; then go to Schedule and fill in a New Schedule for each recurring transaction. If you haven't entered the payee or payer, &kappname; will offer you the opportunity to do this in the middle of entering the schedule.
de: Haben Sie einige regelmäßig auszuführende Eingangs- oder Ausgangsbuchungen von diesem Konto, gehen Sie zur Ansicht „Zahlungsempfänger“ und geben Sie die Namen der betroffenen Zahler und Zahlungsempfänger ein. Dann wechseln Sie zur Ansicht „Geplante Buchungen“ und geben Sie für jede wiederkehrende Buchung einen Zahlungsplan ein. Haben Sie bisher noch keinen Zahler und Zahlungsempfänger eingegeben, können Sie diese Angaben während der Eingabe des Zahlungsplans vornehmen.

source: To add other new transactions go to Ledgers; you can add new payees and categories in the middle of a transaction or by going to Payees or Categories before entering the transaction.
de: Um weitere neue Buchungen einzugeben, verwenden Sie das Kontenbuch. Neue Zahlungsempfänger und Kategorien können Sie bei der Eingabe der Buchungsdaten oder vor der Buchung auf den Ansichten „Zahlungsempfänger“ und „Kategorien“ hinzufügen.

source: You will probably find that the default Categories do not exactly match your needs; you can easily delete ones you know you are never going to need and add others that you need. But when you are entering a transaction, you only have to type a few letters of a category and &kappname; will offer you a drop down list of the matching categories from which to choose.
de: Möglicherweise passen die Standardkategorien nicht zu Ihren Bedürfnissen. Sie können die Kategorien löschen, die sie wahrscheinlich nie brauchen werden, und beliebige neue Kategorien hinzufügen. Wenn Sie eine Buchung eingeben, müssen Sie nur einige Buchstaben einer Kategorie eingeben. Dann werden alle passenden Kategorien in einem Auswahlfeld angezeigt.

source: You can add different accounts managed by different institutions; the preferred one will show when you open &kappname; but you can quickly switch to any of the others.
de: Sie können mehrere Konten von verschiedenen Banken hinzufügen. Das bevorzugte Konto wird beim Start von &kappname; angezeigt. Sie können aber schnell zu anderen Konten wechseln.

source: When you make a payment, &kappname; will work out what the next check number should be; delete this if you are not making a check payment or edit it if the first check you enter is not check number 1. Alternatively, it is possible to switch off auto-increment of check numbers.
de: Wenn Sie Zahlungen ausführen, ermittelt &kappname; die nächstfolgende Schecknummer, schalten Sie dies ab, wenn es keine Scheckzahlung ist oder bearbeiten Sie diese Nummer, falls der erste Scheck, den Sie eingeben, nicht die Nummer 1 hat. Außerdem können Sie das automatische Erhöhen der Schecknummern im Einrichtungsdialog abschalten.

source: Every so often you may get statements of your account from the institutions you use; you can reconcile your &kappname; accounts against these statements so that you have an accurate statement of the current state of your finances.
de: Jedesmal wenn Sie Kontoauszüge von den Banken erhalten, können Sie die Konten in &kappname; mit diesen Auszügen abgleichen. Dann haben Sie einen korrekten Auszug des aktuellen Status Ihrer Finanzen.

source: If you go to Reports, you will find several default reports; to customize these, open one similar to the sort you prefer and then select 'New' (not 'Copy'); you can then customize this to your needs and mark it as a preferred report if you wish.
de: Auf der Ansicht „Berichte“ finden Sie mehrere Standardvorlagen. Um einen benutzerdefinierten Bericht zu erstellen, öffnen Sie den am besten passenden Bericht aus und wählen dann <guilabel>Neu</guilabel>, nicht <guilabel>Kopieren</guilabel>. Passen Sie die Einstellungen diese Berichts an Ihre Bedürfnisse an und markieren Sie ihn gegebenenfalls als bevorzugten Bericht.

source: Though &kappname; is not intended for use in a business context, if you are running a business on your own and so do not need payroll functions, you will probably find that &kappname; is sufficiently customizable to meet your needs particularly as it comes with budgeting and forecasting features and you can export your customized reports via CSV into other applications.
de: Obwohl &kappname; nicht für die geschäftliche Nutzung entwickelt wurde, kann es unter Umständen für Selbstständige, die keine Gehaltsabrechnung benötigen, benutzt werden. &kappname; kann für diese Nutzung angepasst werden, insbesondere da es Funktionen für Budgets und Vorhersagen enthält und der Export von benutzerdefinierten Berichten im CSV-Format an andere Programme möglich ist.
