Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/extragear-office/kmymoney_reference.po
Languages: de

source: Customizes &kappname; toolbars.
de: Öffnet den Dialog zur Einrichtung der Werkzeugleisten in &kappname;.

source: <guimenu>Settings</guimenu> <guimenuitem>Configure &kappname;...</guimenuitem>
de: <guimenu>Einstellungen</guimenu><guimenuitem>&kappname; einrichten ...</guimenuitem>

source: Configures <link linkend="details.settings">&kappname; settings</link>.
de: Öffnet den Dialog <link linkend="details.settings">&kappname;-Einrichtung</link>.

source: Help Menu
de: Das Menü Hilfe
