Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/extragear-office/tellico_configuration.po
Languages: de

source: Configuration
de: Einrichtung

source: The <interface>Configuration Dialog</interface> contains all the options for changing some of the default behaviour of &appname;.
de: Der <interface>Einrichtungsdialog</interface> enthält alle Einstellungen, um das Standardverhalten von &appname; zu ändern.

source: Clicking the <guibutton>Apply</guibutton> button <action>causes the changes to take effect immediately</action> without closing the dialog, while <guibutton>OK</guibutton> <action>applies the changes and closes the dialog</action>. <guibutton>Cancel</guibutton> closes the dialog, but any changes already made and applied will remain. The <guibutton>Defaults</guibutton> button <action>reverts the options</action> on the current page of the dialog to their default values, while <guibutton>Help</guibutton> <action>opens the &khelpcenter;</action> to the relative section of the &appname; manual.
de: Klicken Sie auf den Knopf <guibutton>Anwenden</guibutton>, dann werden die <action>Änderungen sofort übernommen</action> ohne den Dialog zu schließen. Mit dem Knopf <guibutton>OK</guibutton> <action>wenden Sie alle Änderungen an</action> und schließen den Dialog. <guibutton>Abbrechen</guibutton> schließt den Dialog, alle mit <guibutton>Anwenden</guibutton> übernommenen Änderungen bleiben erhalten, die Übrigen werden verworfen. <guibutton>Voreinstellungen</guibutton> <action>setzt</action> die Einstellungen auf der angezeigten Seite des Dialogs wieder auf die Standardwerte zurück. Mit dem Knopf <guibutton>Hilfe</guibutton> wird <action>das &khelpcenter; mit dem zugehörigen Abschnitt des Handbuchs zu &appname; geöffnet</action>.

source: Some minor settings can only be changed by editing the configuration file itself. See <link linkend="hidden-options">Hidden Options</link>.
de: Einige weniger wichtige Einstellungen können nur durch direktes Bearbeiten der Einrichtungsdatei geändert werden. Weitere Informationen dazu unter <link linkend="hidden-options">Versteckte Einstellungen</link>.

source: General Options
de: Allgemeine Einstellungen

source: <screeninfo>The General Options Dialog</screeninfo>
de: <screeninfo>Die Seite „Allgemeine Optionen“</screeninfo>

source: <phrase>The General Options Dialog</phrase>
de: <phrase>Die Seite „Allgemeine Optionen“</phrase>

source: The <guilabel>General Options</guilabel> control the general behavior. Images may be included in the data files, or saved separately in the &appname; application folder. Also, when &appname; is started, it can automatically reopen the last data file that was open. The <guilabel>Tip of the Day</guilabel> dialog contains helpful hints on using &appname; and appears at program startup. You may want to read through some of the hints and then disable the dialog.
de: Hier können <guilabel>Allgemeine Optionen</guilabel> für das Verhalten des Programms eingestellt werden. Bilder können in der Datendatei oder getrennt im Anwendungsverzeichnis von &appname; gespeichert werden. Bei Start kann &appname; automatisch wieder die zuletzt geöffnete Datei laden. im Dialog <guilabel>Tipp des Tages</guilabel> werden hilfreiche Informationen zum Arbeiten mit &appname; angezeigt, er kann beim Start angezeigt werden. Sie sollten diese Tipps einmal lesen und dann den Dialog deaktivieren.

source: The <guilabel>Formatting Options</guilabel> control the level of automatic formatting that &appname; does. For examples, see the <link linkend="field-formatting">Field Formatting section</link>. Capitalization and formatting are distinct options, since a field may be capitalized without having the order of the words changed, and vice-versa. The auto-capitalization can be changed to ignore certain words. The automatic formatting includes grammatical articles in titles, along with prefixes and suffixes for personal names. The values are case-insensitive, and should be separated by a semi-colon.
de: In den <guilabel>Formatierungseinstellungen</guilabel> geben Sie die automatisch von &appname; verwendeten Formatierungen. Beispiele dazu finden Sie im Abschnitt <link linkend="field-formatting">Feldformatierung</link>. Großschreibung und Formatierung lassen sich getrennt einstellen, da zum Beispiel ein Feldinhalt großgeschrieben werden soll, ohne die Reihenfolge der Wörter zu ändern und umgekehrt. Die automatische Formatierung behandelt Grammatik-Artikel in Titeln und Vor- und Nachsilben für Personennamen. Bei diesen Einträgen Wird die Groß- und Kleinschreibung beachtet, die Werte sollten durch ein Semikolon getrennt werden.

source: The formatting rules follow general English usage, which may not work for other languages. Articles are appended to the end of the title, with a comma. Personal names are formatted to have the last name first, followed by a comma, then the first name. Personal suffixes, such as Jr., are kept with the last name. Prefixes, such as <emphasis>von</emphasis>, are kept with the last name, but are ignored when the values are being sorted.
de: Die Formatierungsregeln sind für den normalen englischen Sprachgebrauch ausgelegt, das ist aber nicht unbedingt für andere Sprachen geeignet. Artikel werden an das Ende eines Titels gestellt, bei Personennamen wird zuerst der Nachname aufgeführt und dann der Vorname durch Komma getrennt. Nachsilben von Personennamen wie „jr.“ werden beim Nachnamen aufgeführt, bei der Sortierung aber außer Acht gelassen.

source: <emphasis>John Q. von Public, III</emphasis> would become <emphasis>von Public, III, John Q.</emphasis> and <emphasis>Public</emphasis> would be used as the sort key.
de: <emphasis>John Q. von Public, III</emphasis> wird zu <emphasis>von Public, III, John Q.</emphasis> geändert und <emphasis>Public</emphasis> wird als Sortierschlüssel verwendet.

source: Only single word prefixes are supported. If a name includes <emphasis>van der</emphasis>, for example, both <emphasis>van</emphasis> and <emphasis>der</emphasis> should be included in the surname prefix list. Articles ending with an apostrophe are supported for sorting order, as well.
de: Nur einzelne Vorsilben des Nachnamens werden berücksichtigt. Wenn ein Name zum Beispiel <emphasis>van der</emphasis> enthält, sollten beide Vorsilben <emphasis>van</emphasis> und <emphasis>der</emphasis> in der Liste mit Vorsilben des Nachnamens eingefügt werden. Artikel, die mit einem Apostroph enden, werden bei der Reihenfolge der Sortierung ebenfalls berücksichtigt.

source: The actual values in the collection are <emphasis>not</emphasis> changed, only the visible text used for the interface. So the formatting options can be changed back and forth without affecting any of the data in the collection.
de: Die tatsächlichen Werte in der Sammlung werden <emphasis>nicht</emphasis> geändert, nur der in der Benutzeroberfläche angezeigte Text. Daher können Sie die Formatierungseinstellungen beliebig ohne Datenverlust in der Sammlung ändern.

source: Printing Options
de: Druckoptionen

source: &appname; uses an &xslt; template for creating &HTML; and then passes that to the &kde; printing service. Only the fields visible in the <link linkend="detailed-view"><interface>Column View</interface></link> are printed. Furthermore, if the collection is being filtered, only the visible entries will be printed. Initially, a warning message is shown if filtering is active.
de: &appname; benutzt eine &xslt;-Vorlage zur Erzeugung der &HTML;-Seiten und übergibt sie dann dem &kde;-Drucksystem. Nur die in der <link linkend="detailed-view"><interface>Spaltenansicht</interface></link> gezeigten Felder werden gedruckt. Haben Sie für die Sammlung einen Filter aufgerufen, werden nur die gefilterten Einträge gedruckt. In diesem Fall wird ein Dialog mit dem Hinweis auf die Filterung angezeigt.

source: <screeninfo>The Print Options Dialog</screeninfo>
de: <screeninfo>Die Seite Druckoptionen</screeninfo>

source: <phrase>The Print Options Dialog</phrase>
de: <phrase>Die Seite Druckoptionen</phrase>

source: The <guilabel>Printing Options</guilabel> allow you to change some formatting when printing a collection. If <guilabel>Format titles and names</guilabel> is checked, then the fields are <link linkend="field-formatting">auto-formatted</link> when they are printed. Otherwise, they are printed exactly as they were entered.
de: Auf der Seite <guilabel>Druckoptionen</guilabel> können Sie einige Formatierungen für den Druck einer Sammlung einstellen. Wenn <guilabel>Titel und Namen formatieren</guilabel> aktiviert ist, werden die Felder beim Druck <link linkend="field-formatting">automatisch formatiert</link>. Ansonsten werden Sie genauso wie gedruckt wie sie eingegeben wurden.

source: The default printing stylesheet prints the collection with the field values in columns. <guilabel>Print field headers</guilabel> controls whether the field title is printed at the top of the column.
de: Die Standardvorlage druckt die Sammlung mit den Feldwerten in Spalten. Aktivieren Sie <guilabel>Feld-Kopfzeilen drucken</guilabel>, damit der Titel des Feldes über der Spalte auf dem Ausdruck erscheint.

source: In the printout, the entries will be sorted as they are in the <link linkend="detailed-view"><interface>Column View</interface></link>. Additionally, they may be grouped as they are in the <link linkend="group-view"><interface>Group View</interface></link>.
de: In der Druckausgabe werden die Einträge wie in der <link linkend="detailed-view"><interface>Spaltenansicht</interface></link> sortiert. Zusätzlich können die Einträge wie in der <link linkend="group-view"><interface>Gruppen</interface></link> angeordnet werden.

source: Finally, when image fields are included in the printout, the images may be resized, while maintaining their aspect ratio. The maximum image width and height define the largest possible size of the image, though it will never be increased.
de: Wenn Bilder in der Druckausgabe enthalten Sind, kann ihre Größe unter Beibehaltung des Seitenverhältnisses angepasst werden. Die größte Bildbreite und -höhe bestimmt die maximale Größe des Bildes, darüber hinaus wird es nie vergrößert.

source: Template Options
de: Vorlagen-Optionen

source: The <link linkend="entry-view"><interface>Entry View</interface></link> uses templates to show the field values. You can specify a different template for each collection type. Some templates, such as the <emphasis>Album</emphasis> or <emphasis>Video</emphasis> templates are for a specific collection type, and a short error message will appear in the <interface>Entry View</interface> if they are used for other types. The <guilabel>Preview</guilabel> button pops up a window to show you a preview of what the template looks like. Custom fonts and colors may be passed to the template, and all of the default templates will honor those settings. However, custom template may choose to ignore them.
de: Die <link linkend="entry-view"><interface>Eintragsansicht</interface></link> verwendet Vorlagen zur Anzeige der Feldwerte. Für jede Art von Sammlung können verschiedene Vorlagen angegeben werden. Einige Vorlagen wie <emphasis>Album</emphasis> oder <emphasis>Video</emphasis> sind nur für bestimmte Sammlungen geeignet. Wenn Sie sie für andere Sammlungen benutzen, wird eine Fehlermeldung in der <interface>Eintragsansicht</interface> angezeigt. Durch Klicken auf <guilabel>Vorschau</guilabel> öffnen Sie ein Fenster mit dem Erscheinungsbild der ausgewählten Vorlage. Benutzerdefinierte Schriften und Farben können für eine Vorlage angegeben werden, alle Standardvorlagen berücksichtigen diese Einstellungen. Verwenden Sie benutzerdefinierte Vorlagen, können diese Einstellungen aber auch ignoriert werden.

source: Additional templates may be installed directly, or downloaded from <ulink url="http://kde-files.org/index.php?amp;xcontentmode=676">kde-files.org</ulink> by clicking the <guilabel>Download</guilabel> button. Any templates installed by the user may also be deleted. Entry templates are saved in <filename class="directory">$<envar>KDEHOME</envar>/share/apps/tellico/entry-templates/</filename>.
de: Zusätzliche Vorlagen können Sie direkt installieren oder von <ulink url="http://kde-files.org/index.php?amp;xcontentmode=676">kde-files.org</ulink> erhalten, indem Sie auf <guilabel>Herunterladen</guilabel> klicken. Vom Benutzer installierte Vorlagen können gelöscht werden. Vorlagen für Einträge werden im Ordner <filename class="directory">$<envar>KDEHOME</envar>/share/apps/tellico/entry-templates/</filename> gespeichert.

source: If you create a new template, please consider submitting it at <ulink url="http://kde-files.org/index.php?amp;xcontentmode=676">kde-files.org</ulink>!
de: Wenn Sie eine neue Vorlage erstellt haben, laden Sie sie bitte auf <ulink url="http://kde-files.org/index.php?amp;xcontentmode=676">kde-files.org</ulink> hoch.

source: <screeninfo>The Template Options Dialog</screeninfo>
de: <screeninfo>Die Seite Vorlagen-Optionen</screeninfo>

source: <phrase>The Template Options Dialog</phrase>
de: <phrase>Die Seite Vorlagen-Optionen</phrase>

source: Data Sources Options
de: Einstellungen für Datenquellen

source: &appname; can use various sources for importing data, which can be configured in the Data Sources Dialog. There are many available types and sources:
de: &appname; kann verschiedene Quellen für den Import von Daten nutzen, Einstellungen dazu finden Sie auf der Seite „Datenquellen“ im Einstellungsdialog. Es gibt viele mögliche Typen und Quellen:

source: <link linkend="amazon-web-services">Amazon.com Web Services</link>,
de: <link linkend="amazon-web-services">Amazon.com-Web-Dienste</link>,

source: the <link linkend="imdb">Internet Movie Database</link>,
de: <link linkend="imdb">Internet-Filmdatenbank</link>,

source: <link linkend="z3950">z39.50 servers</link>,
de: <link linkend="z3950">z39.50-Server</link>,

source: <link linkend="sru">SRU servers</link>,
de: <link linkend="sru">SRU-Server</link>,

source: <link linkend="entrez">Entrez (PubMed) databases</link>,
de: <link linkend="entrez">Entrez-(PubMed)-Datenbanken</link>,

source: <link linkend="yahoo">Yahoo! Audio Search</link>,
de: <link linkend="yahoo">Yahoo! Audio-Suche</link>,

source: <link linkend="ibs">Internet Bookshop Italia</link>,
de: <link linkend="ibs">Internet-Buchhandlung Italia</link>,

source: <link linkend="gcstarplugin"><application>GCstar</application> Plugins</link>,
de: <link linkend="gcstarplugin"><application>GCstar</application>Module</link>,

source: <link linkend="externalexec">other external scripts or applications</link>,
de: <link linkend="externalexec">andere externe Skripte oder Programme</link>,

source: <link linkend="multiple-sources">combinations of any of the above sources</link>.
de: <link linkend="multiple-sources">Kombinationen jeder der oben genannten Quellen</link>

source: <screeninfo>The Data Sources Options Dialog</screeninfo>
de: <screeninfo>Die Seite „Einstellungen für Datenquellen“</screeninfo>

source: <phrase>The Data Sources Options Dialog</phrase>
de: <phrase>Die Seite „Einstellungen für Datenquellen“</phrase>

source: New sources may be added by clicking the <guibutton>New...</guibutton> button, while existing ones may be modified or deleted, using the <guibutton>Modify...</guibutton> or <guibutton>Delete</guibutton> buttons. The order of the sources, which shows up in the entry updating menus, can also be changed.
de: Quellen können hinzugefügt werden, indem Sie auf den Knopf <guibutton>Neu ...</guibutton> drücken, während vorhandene Quellen mit den Knöpfen <guibutton>Ändern ...</guibutton> oder <guibutton>Löschen</guibutton> geändert oder gelöscht werden können. Die Reihenfolge der Quellen, die im Untermenü <guisubmenu>Eintrag aktualisieren</guisubmenu> angezeigt werden, kann hier ebenfalls geändert werden.

source: Additional templates may be downloaded from the author's online repository by clicking the <guilabel>Download</guilabel> button. Those scripts are gpg-signed by the author to guard against dangerous scripts from unknown sources, which could cause damage to your system.
de: Weitere Vorlagen können Sie vom Online-Archiv des Autors erhalten, indem Sie den Knopf <guilabel>Herunterladen</guilabel> drücken. Diese Skripte sind vom Autor mit GpG signiert, um Sie gegen gefährliche Skripte aus unbekannten Quellen zu schützen, die Ihr System beschädigen könnten.

source: Never install and run a script from an untrusted source. They are executed with the same permissions as the user, and as a result, could modify or delete files or otherwise mess up your system.
de: Installieren Sie niemals ein Skript aus einer nicht vertrauenswürdigen Quell und führen es aus. Diese Skripte werden mit den Berechtigungen des Benutzers ausgeführt und könnten daher Dateien ändern und löschen oder auf andere Art Ihr System beschädigen.

source: Many of the data sources offer more information than the default fields in &appname;. Those other fields are shown on the right of the configuration box. If any of those fields are checked, they will be added to the collection when an entry is added from that source.
de: Viele Datenquellen bieten mehr Informationen als die Standardfelder in &appname;. Diese zusätzlichen Felder werden im Dialog rechts angezeigt. Aktivieren Sie einige dieser Felder, dann werden sie zur Sammlung hinzugefügt, wenn ein Eintrag aus dieser Quelle abgerufen wird.

source: Book and Bibliographic Data Sources
de: Buch- und Literaturnachweis-Datenquellen

source: z39.50 Servers
de: z39.50-Server

source: The <ulink url="http://www.cni.org/pub/NISO/docs/Z39.50-brochure/50.brochure.toc.html">z39.50 protocol</ulink> is used to access libraries and bibliographic information providers around the world. Lists of public z39.50 servers are <ulink url="http://www.indexdata.dk/targettest/">available from indexdata.dk</ulink>, among others. &appname; comes with several preset configurations for major libraries, or you can specify the connection information manually.
de: Das <ulink url="http://www.cni.org/pub/NISO/docs/Z39.50-brochure/50.brochure.toc.html">z39.50-Protokoll</ulink> wird benutzt, um auf Daten von Bibliotheken und Anbietern von Literaturnachweisen in aller Welt zuzugreifen. Eine Liste der öffentlichen z39.50-Server finden Sie auf <ulink url="http://www.indexdata.dk/targettest/">indexdata.dk</ulink>. &appname; enthält mehrere vorbereitete Einstellungen für große Bibliotheken, Sie können außerdem die Daten einer Verbindung selbst eintragen.

source: &appname; is able to read data in the <acronym>MODS</acronym>, <acronym>USMARC</acronym>/<acronym>MARC21</acronym>, or <acronym>UNIMARC</acronym> format, using the <ulink url="http://www.indexdata.dk/yaz/">yaz library</ulink>. In addition, there is limited support for the <acronym>GRS-1</acronym> format.
de: &appname; kann Daten im <acronym>MODS</acronym>-, <acronym>USMARC</acronym>-/<acronym>MARC21</acronym>- oder <acronym>UNIMARC</acronym>-Format lesen. Dazu wird die <ulink url="http://www.indexdata.dk/yaz/">yaz-Bibliothek</ulink> benutzt. Zusätzlich gibt es eingeschränkte Unterstützung für das <acronym>GRS-1</acronym>-Format.

source: To use one of the preset libraries, check the box and then select the library. The other configuration entries will be disabled. If you need to set the information manually, uncheck the preset box.
de: Um einen der vordefinierten Bibliotheken zu benutzen, aktivieren Sie das Ankreuzfeld <guilabel>Voreingestellten Server verwenden</guilabel> und wählen dann eine Bibliothek im Auswahlfeld. Die anderen Einstellungen sind dann deaktiviert. Möchten sie die Daten manuell einstellen, wählen Sie das Ankreuzfeld ab.

source: The default port for z39.50 access is 210, but some servers may use a different one. &appname; assumes the server uses the MARC-8 character encoding, unless configured otherwise. If an incorrect character encoding is used, an error message may appear on the program output, or possibly no entries are retrieved.
de: Als Standardport für z39.50-Server wird 210 benutzt, einige Server haben einen anderen Port. &appname; unterstellt eine Zeichenkodierung im Format MARC-8, sofern nicht anders angegeben. Wird der falsche Zeichensatz verwendet, kann entweder eine Fehlermeldung in der Ausgabe des Programms erscheinen oder es werden keine Informationen erhalten.

source: Some servers require a username and password for access. &appname; can use and save that password, but be aware that is written to the &appname; configuration file in plain text and is not secure. For most public servers, the username and password fields may be left empty.
de: Für den Zugriff auf einige Server müssen Sie einen Benutzernamen und ein Passwort angeben. Diese Daten können in der Einrichtungsdatei für &appname; gespeichert werden. Die Speicherung erfolgt als Klartext und ist nicht sicher. Für die meisten öffentlichen Server benötigen Sie keinen Benutzernamen oder Passwort.

source: SRU Servers
de: SRU-Server

source: SRU stands for <ulink url="http://www.loc.gov/standards/sru/">Search/Retrieve via &URL;</ulink> and is a standard search protocol for Internet searches. Some libraries use it for providing access to their data catalogs. Among them, the <ulink url="http://www.loc.gov/z3950/lcserver.html#oppr">US Library of Congress</ulink> is probably the best known.
de: SRU bedeutet <ulink url="http://www.loc.gov/standards/sru/">Search/Retrieve via &URL; (Suchen/Abfragen über &URL;)</ulink>. Es ist ein Standardprotokoll zur Internetsuche. Einige Bibliotheken stellen darüber einen Zugriff auf ihre Datenkataloge zur Verfügung. Die bekannteste darunter ist wahrscheinlich die <ulink url="http://www.loc.gov/z3950/lcserver.html#oppr">US Library of Congress (Bibliothek des amerikanischen Kongresses)</ulink>.

source: Entrez Databases
de: Entrez-Datenbanken

source: <ulink url="http://www.ncbi.nlm.nih.gov/Entrez/">Entrez</ulink> is the integrated, text-based search and retrieval system used at the National Center for Biotechnology Information (NCBI). The most well-known Entrez database is <ulink url="http://www.ncbi.nlm.nih.gov/entrez/query.fcgi?db=PubMed">PubMed</ulink>, the database for life science articles from many biological journals. At the moment, the only Entrez database supported by &appname; is PubMed.
de: <ulink url="http://www.ncbi.nlm.nih.gov/Entrez/">Entrez</ulink> ist das textbasierte Such- und Abfragesystem des National Center for Biotechnology Information (NCBI). Die bekannteste Entrez-Datenbank ist <ulink url="http://www.ncbi.nlm.nih.gov/entrez/query.fcgi?db=PubMed">PubMed</ulink>, eine Datenbank mit wissenschaftlichen Artikeln über Biowissenschaft von vielen verschiedenen Biologie-Zeitschriften. Zur Zeit wird als einzige Entrez-Datenbank nur PubMed von &appname; unterstützt.

source: Bibliographic Databases
de: Literaturnachweis-Datenbanken

source: <ulink url="http://arxiv.org">arXiv.org</ulink>, <ulink url="http://bibsonomy.org">Bibsonomy</ulink>, <ulink url="http://citebase.org">Citebase</ulink>, and <ulink url="http://crossref.org">CrossRef</ulink> are online databases for academic articles and bibliographic information. For access to the CrossRef source, you must <ulink url="http://www.crossref.org/requestaccount/">request an account</ulink> and add your account information to the data source configuration.
de: <ulink url="http://arxiv.org">arXiv.org</ulink>, <ulink url="http://bibsonomy.org">Bibsonomy</ulink>, <ulink url="http://citebase.org">Citebase</ulink> und <ulink url="http://crossref.org">CrossRef</ulink> sind Online-Datenbanken für wissenschaftliche Artikel und Literaturverzeichnisse. Für die Nutzung der „CrossRef“-Datenquelle ist eine <ulink url="http://www.crossref.org/requestaccount/">Anmeldung</ulink> erforderlich. Tragen Sie die Daten der Anmeldung in den Einstellungen für diese Datenquelle ein.

source: Internet Bookstore Italia
de: Internet-Buchhandlung Italia
