Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/extragear-office/tellico_advanced.po
Languages: de

source: Advanced Usage
de: Weiterführende Funktionen

source: Command Line Options
de: Befehlszeilenoptionen

source: When running &appname; from the command line, there are several options for opening data files. They may be seen by running <userinput>tellico --help</userinput>.
de: Wenn &appname; von der Befehlszeile gestartet wird, gibt es mehrere Optionen zur Öffnung von Sammlungsdateien. Diese Optionen werden beim Aufruf von <userinput>tellico --help</userinput> angezeigt.

source: Usage: tellico [Qt-options] [KDE-options] [options] [filename] Tellico - a collection manager for KDE Options: --nofile Do not reopen the last open file --bibtex Import &lt;filename&gt; as a bibtex file --mods Import &lt;filename&gt; as a MODS file --ris Import &lt;filename&gt; as a RIS file Arguments: filename File to open
de: Aufruf: tellico [Qt-options] [KDE-options] [options] [filename] Tellico - eine Sammlungsverwaltung für KDE Optionen: --nofile Die letzte offene Datei nicht erneut öffnen --bibtex &lt;Dateiname&gt; als Bibtex-Datei importieren --mods &lt;filename&gt; als MODS-Datei importieren --ris &lt;filename&gt; als RIS-Datei importieren Argumente: filename Zu öffnende Datei

source: &DBus; Interface
de: &DBus;-Schnittstelle

source: &appname; has a minimal &DBus; interface, which can be useful for scripting or interacting with a running application from the command-line. As with all &DBus; calls, you need to specify the service you want to interface with, and the particular interface. The name of the &DBus; service is <constant>org.kde.tellico</constant>.
de: &appname; hat eine minimale &DBus;-Schnittstelle, die für Skripte oder die Steuerung eines laufenden Programms von der Befehlszeile aus benutzt werden kann. Wie bei allen &DBus;-Aufrufen, müssen Sie den Dienst angeben, mit dem Sie kommunizieren möchten und die spezielle Schnittelle. Der Name des &DBus;-Dienstes für dies Programm lautet <constant>org.kde.tellico</constant>.

source: &DBus; Commands
de: &DBus;-Befehle

source: Two &DBus; primary objects are available in the tellico interface: <constant>Tellico</constant> and <constant>Collections</constant>.
de: Zwei &DBus;-Objekte sind über die &appname;-Schnittstelle verfügbar: <constant>Tellico</constant> und <constant>Collections</constant>.

source: The <constant>Tellico</constant> Object
de: Das Objekt <constant>Tellico</constant>

source: The full list of &DBus; commands in the <constant>tellico</constant> object is shown below:
de: Die vollständige Liste der &DBus;-Befehle für das Objekt <constant>tellico</constant> wird im folgenden gezeigt:

source: For the four import commands, the first argument is the file to import, and the second is the import action. Three actions are available: <emphasis>replace</emphasis>, <emphasis>append</emphasis>, and <emphasis>merge</emphasis>. Four file formats are supported for importing: Tellico &XML; files, Bibtex files, MODS files, and RIS files.
de: Bei den vier Import-Befehlen ist das erste Argument die zu importierende Datei und das zweite Argument die Importaktion. Drei Aktionen sind vorhanden: <emphasis>replace</emphasis>, <emphasis>append</emphasis> und <emphasis>merge</emphasis>. Vier Dateiformate werden zum Importieren unterstützt: Tellico-&XML;-Dateien, Bibtex-Dateien, MODS-Dateien und RIS-Dateien.

source: The current open collection in &appname; may be exported to a file, in either Tellico &XML; format, Tellico ZIP format, Bibtex, &HTML;, comma-separated values (CSV), or the PilotDB format.
de: Die aktuell geöffnete Sammlung in &appname; kann in eine Datei exportiert werden, entweder im Tellico-&XML;-Format, im Tellico-ZIP-Format, im Bibtex-Format, im &HTML;-Format, als durch Komma getrennte Werte (CSV), oder im PilotDB-Format.

source: A list of the entry IDs currently selected or being filtered is able to facilitate showing or updating entries in the view.
de: Mit einer Liste der ID's der ausgewählten oder gefilterten Einträge können Einträge angezeigt oder die Anzeige aktualisiert werden.

source: A new data file may be opened by using the <command>openFile()</command> command. The full path must be specified.
de: Eine neue Sammlungsdatei kann mit dem Befehl <command>openFile()</command> geöffnet werden. Der vollständige Pfad zur Datei muss angegeben werden.

source: A new filter may be set using the <command>setFilter()</command> command, which is the equivalent of typing in the filter box in the main window.
de: Ein neuer Filter kann mit dem Befehl <command>setFilter()</command> gesetzt werden. Dies entspricht der Eingabe im Filterfeld im Hauptfenster.

source: Given an entry ID, <command>showEntry()</command> will select that entry and show the entry details in the main window.
de: Mit einer angegebenen ID wird mit dem Befehl <command>showEntry()</command> dieser Eintrag ausgewählt und dessen Details im Hauptfenster gezeigt.

source: The <constant>Collections</constant> Object
de: Das Objekt <constant>Collections</constant>

source: The full list of &DBus; commands in the <constant>Collections</constant> object is shown below:
de: Die vollständige Liste der &DBus;-Befehle für das Objekt <constant>Collections</constant> wird im folgenden gezeigt:

source: A new empty entry may be created in the current collection using the <command>addEntry()</command> command. The return value is the entry ID, which can then be used to set the field values in the entry. An entry can be deleted from the collection by calling <command>removeEntry()</command>.
de: Ein neuer leerer Eintrag in der aktuell geöffneten Sammlung kann mit dem Befehl <command>addEntry()</command> erzeugt werden. Der Rückgabewert dieses Befehls ist die ID des Eintrags. Diese ID kann benutzt werden, um die Werte der Felder des Eintrags einzugeben. Um einen Eintrag aus der Sammlung zu löschen, benutzen Sie den Befehl <command>removeEntry()</command>.

source: Calling <command>allValues()</command> using just a field name will return all the values for that field for the currently selected entries. If no entries are selected, the return list is empty. If an entry ID is included in the command, the field values for that specific entry are returned.
de: Der Aufruf von <command>allValues()</command> nur mit einem Feldnamen gibt alle Werte des Feldes für die aktuell ausgewählten Einträge zurück. Sind keine Einträge ausgewählt, ist die zurückgegeben Liste leer. Ist die Kennung (ID) eines Eintrags angegeben, werden die Feldwerte für diesen Eintrag zurückgegeben.

source: If the current collection is a bibliography, calling <command>selectedBibtexKeys()</command> will return the Bibtex citation key for all selected entries. The bibtexKey for a specific entry may be found by using the <command>entryBibtexKey()</command> command.
de: Ist die geöffnete Sammlung ein Literaturverzeichnis, dann gibt der Aufruf von <command>selectedBibtexKeys()</command> den Bibtex-Zitatschlüssel aller ausgewählten Einträge zurück. Der bibtexKey für einen bestimmten Eintrag kann mit dem Befehl <command>entryBibtexKey()</command> gefunden werden.

source: Entries can be edited directly with the &DBus; interface. Given an entry ID, <command>setEntryValue()</command> will set the field value directly. To add a value, without affecting the existing values, use <command>addEntryValue()</command>. The new value gets appended to the end of the existing list.
de: Einträge können direkt über die &DBus;-Schnittstelle bearbeitet werden. Mit der Kennung (ID) eines Eintrags setzte der Befehl <command>setEntryValue()</command> den Wert des Feldes. Um einen Wert hinzuzufügen, ohne vorhanden Daten zu ändern, verwenden Sie den Befehl <command>addEntryValue()</command>. Der neue Wert wird an das Ende der vorhandenen Liste angehängt

source: &DBus; Examples
de: &DBus;-Beispiele

source: Here are some examples for scripting &appname; using the &DBus; interface.
de: Hier finden Sie einige Beispiele von Skripten für &appname; mit der &DBus;-Schnittstelle.

source: <emphasis>Open a Bibtex file</emphasis> <prompt>%</prompt> <userinput>qdbus org.kde.tellico /Tellico org.kde.tellico.importBibtex "/home/robby/reference.bib" "replace"</userinput> <computeroutput>true</computeroutput>
de: <emphasis>Öffnen einer Bibtex-Datei</emphasis> <prompt>%</prompt> <userinput>qdbus org.kde.tellico /Tellico org.kde.tellico.importBibtex "/home/robby/reference.bib" "replace"</userinput> <computeroutput>true</computeroutput>

source: <emphasis>Export a Bibtex file</emphasis> <prompt>%</prompt> <userinput>qdbus org.kde.tellico /Tellico org.kde.tellico.exportBibtex ~/documents/reference.bib</userinput> <computeroutput>true</computeroutput>
de: <emphasis>Export einer Bibtex-Datei</emphasis> <prompt>%</prompt> <userinput>qdbus org.kde.tellico /Tellico org.kde.tellico.exportBibtex ~/documents/reference.bib</userinput> <computeroutput>true</computeroutput>

source: <emphasis>Echo the citation key of the current selection</emphasis> <prompt>%</prompt> <userinput>qdbus org.kde.tellico /Collections org.kde.tellico.selectedBibtexKeys</userinput> <computeroutput>stephenson2004</computeroutput>
de: <emphasis>Anzeige des Zitatschlüssels der aktuellen Auswahl</emphasis> <prompt>%</prompt> <userinput>qdbus org.kde.tellico /Collections org.kde.tellico.selectedBibtexKeys</userinput> <computeroutput>stephenson2004</computeroutput>

source: <emphasis>Add a new entry and set the title</emphasis> <prompt>%</prompt> <userinput>myid=`qdbus org.kde.tellico /Collections org.kde.tellico.addEntry`</userinput> <prompt>%</prompt> <userinput>qdbus org.kde.tellico /Collections org.kde.tellico.setEntryValue $myid title "My New Book"</userinput> <computeroutput>true</computeroutput>
de: <emphasis>Neuen Eintrag hinzufügen und den Titel eingeben</emphasis> <prompt>%</prompt> <userinput>myid=`qdbus org.kde.tellico /Collections org.kde.tellico.addEntry`</userinput> <prompt>%</prompt> <userinput>qdbus org.kde.tellico /Collections org.kde.tellico.setEntryValue $myid title "My New Book"</userinput> <computeroutput>true</computeroutput>
