Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/extragear-office/tellico_configuration.po
Languages: de

source: <ulink url="http://ibs.it">IBS, or Internet Bookstore Italia</ulink>, is an online Italian bookstore.
de: <ulink url="http://ibs.it">IBS oder Internet-Buchhandlung Italia</ulink>, ist eine italienische Online-Buchhandlung.

source: <ulink url="http://isbndb.com">ISBNdb.com</ulink> is an online book database, with data collection libraries around the world.
de: <ulink url="http://isbndb.com">ISBNdb.com</ulink> ist eine Internet-Buchdatenbank mit Daten von Büchereien aus aller Welt.

source: <ulink url="http://openlibrary.org">OpenLibrary.org</ulink> is an online book database that aims to have one page for every book.
de: <ulink url="http://openlibrary.org">OpenLibrary.org</ulink> ist eine Internet-Buchdatenbank mit dem Ziel, mindestens eine Seite für jedes Buch zur Verfügung zu stellen.

source: Comic Book Data Sources
de: Comicbuch-Datenquellen

source: <ulink url="http://www.animenfo.com">AnimeNfo</ulink> is a popular site for information on anime, or Japanese animation.
de: <ulink url="http://www.animenfo.com">AnimeNfo</ulink> ist eine bekannte Internetseite für „Anime“ oder in Japan produzierte Animationsfilme.

source: Movie Data Sources
de: Film-Datenquellen

source: Internet Movie Database
de: Internet-Filmdatenbank

source: The <ulink url="http://www.imdb.com">Internet Movie Database</ulink> provides information about movies and videos. When a search is conducted for a <emphasis>Person</emphasis>, if more than one possible result is returned, a dialog box is opened to allow you to select the correct person. The configuration options include selecting which IMDb nationality to use and whether images are fetched or not. Since IMDb can return a large number of cast members, you can limit that to a certain number.
de: Die <ulink url="http://www.imdb.com">Internet-Filmdatenbank</ulink> enthält Informationen zu Filmen und Videos. Wird nach einer <emphasis>Person</emphasis> gesucht, aber der Suchbegriff auf mehrere Personen zutrifft, dann können Sie in einem Dialog die richtige Person auswählen. Es kann hier die Sprache der IMDb-Datenbank eingegeben und ausgewählt werden, ob Bilder heruntergeladen werden sollen. Da eine Abfrage bei der Internet-Filmdatenbank eine große Anzahl an Rollen liefern kann, lässt sich dieser Wert begrenzen.

source: <ulink url="http://themoviedb.org">TheMovieDB.org</ulink> is a free and open online movie database. Registration for a free account is required.
de: <ulink url="http://themoviedb.org">TheMovieDB.org</ulink> ist eine freie und offene Online-Datenbank für Filme. Die Anmeldung ist für einen freien Zugriff auf die Daten erforderlich.

source: Music Data Sources
de: Musik-Datenquellen

source: <ulink url="http://discogs.com">Discogs.com</ulink> is a user-built music database containing information on artists, labels, and their recordings. Registration for a free account is required.
de: <ulink url="http://discogs.com">Discogs.com</ulink> ist eine von Freiwilligen erstellte Musikdatenbank mit Informationen über Künstler, Labels und Aufnahmen. Die Anmeldung ist für einen freien Zugriff auf die Daten erforderlich.

source: <ulink url="http://musicbrainz.org">MusicBrainz.org</ulink> is a community music metadatabase that attempts to create a comprehensive music information site.
de: <ulink url="http://musicbrainz.org">MusicBrainz.org</ulink> ist eine von Benutzern gemeinsam erstellte Datenbank für Musik-Metadaten die umfassende Informationen über Musik zur Verfügung stellt.

source: Yahoo! Audio Search
de: Yahoo! Audio-Suche

source: The <ulink url="http://audio.search.yahoo.com">Yahoo! Audio Search</ulink> may be used to search for music album information. This data source is often unavailable or broken.
de: <ulink url="http://audio.search.yahoo.com">Yahoo! Audio-Suche</ulink> kann für die Suche nach Informationen über Musikalben benutzt werden. Leider ist diese Datenquelle oft nicht erreichbar oder liefert falsche Informationen.

source: Wine Data Sources
de: Wein-Datenquellen

source: <ulink url="http://wine.com">Wine.com</ulink> is an online wine seller, and offers access to a database information on wine varietals. Registration for a free account is required.
de: <ulink url="http://wine.com">Wine.com</ulink> ist ein Internet-Weinhandel und bietet Zugang zu einer Datenbank mit Informationen über Rebsorten. Für einen freien Zugang ist die Registrierung erforderlich.

source: Video Game Data Sources
de: Videospiel-Datenquellen

source: <ulink url="http://giantbomb.com">GiantBomb.com</ulink> is a large community-driven video game database. Registration for a free account is required.
de: <ulink url="http://giantbomb.com">GiantBomb.com</ulink> ist eine große von Freiwilligen gemeinsam erstellte Datenbank über Videospiele. Die Anmeldung ist für einen freien Zugriff auf die Daten erforderlich.

source: Data Sources for Multiple Collection Types
de: Datenquellen für mehrere Datenquellen

source: Using the Amazon Web Services, &appname; can search any of nine different international sites operated by <ulink url="http://amazon.com">Amazon.com</ulink> for information: United States, United Kingdom, Germany, Japan, France, Canada, China, Spain, and Italy.
de: Mit den Amazon-Web-Diensten kann &appname; in jeder der neun internationalen Internetseiten nach Informationen suchen, die von <ulink url="http://amazon.com">Amazon.com</ulink> betrieben werden: USA. Vereinigtes Königreich von Großbritannien und Nordirland, Deutschland, Japan, Frankreich, Kanada, China, Spanien und Italien.

source: Configuring each Amazon.com source involves three settings: the server location, image size, and associate's ID. Some information from <ulink url="http://amazon.com">Amazon.com</ulink> may include an image, such as a book or video cover. That image may be downloaded in three different sizes, depending on the item. The associate's ID must be used to access the Amazon.com Web Services, and is included in the links back to the item, as dictated by the license agreement for the use of the Amazon.com Web Services.
de: Für jede „Amazon.com“-Datenquelle sind drei Einstellungen nötig: Der Serverort, die Bildgröße und die Mitglieds-ID. Einige Informationen von <ulink url="http://amazon.com">Amazon.com</ulink> können Bilder enthalten, wie zum Beispiel von einem Buch oder einem Video. Das Bild kann je nach ausgewähltem Element in drei verschiedenen Größen heruntergeladen werden. Die Mitglieds-ID ist für den Zugriff auf Amazon-Web-Dienste erforderlich. Die wird in den Verknüpfung zurück zum Element eingeschlossen und wird durch die Nutzungsbedingungen der Amazon-Web-Dienste gefordert.

source: GCstar Plugins
de: GCstar-Module

source: If <application><ulink url="http://www.gcstar.org">GCstar</ulink></application> is installed, &appname; is able to take advantage of the wide range of search plugins available for GCstar. Depending on the collection type, various online resources are available for usage as a data source in &appname;
de: Ist das Programm <application><ulink url="http://www.gcstar.org">GCstar</ulink></application> installiert, kann &appname; die von GCstar bereitgestellten Suchmodule verwenden. Je nach Art der Sammlung können verschiedene Onlineressourcen als Datenquellen in &appname; benutzt werden.

source: <ulink url="http://freebase.com">Freebase.com</ulink> is an online database, collecting information on any topic. Tellico is able to search Freebase for information on books, comic book, music, movies, video games, and board games.
de: <ulink url="http://freebase.com">Freebase.com</ulink> ist eine Online-Datenbank für alle möglichen Themen. &appname; kann Freebase.com nach Informationen über Bücher, Comics, Filme, Videospiele und Brettspiele durchsuchen.

source: External Scripts or Applications
de: Externe Skripte oder Programme

source: As an easier way for &appname; to integrate with third-party plugins, external scripts or applications may be used as an interface for searching other information sources. &appname; will execute a command, and pass the search terms as command-line options.
de: Als weitere einfache Möglichkeit zur Integration von Module Dritter in &appname; können externe Skripte oder Programme als Schnittstelle zur Suche in weiteren Informationsquellen benutzt werden. &appname; führt einen Befehl aus und übergibt die Suchbegriffe als Befehlszeilenoptionen.

source: Some scripts are distributed with &appname; itself. <ulink url="http://www.allocine.fr">Allocine.fr</ulink> is an French website for movies. The <ulink url="http://www.mcu.es">Spanish Ministry of Culture</ulink> is an online Spanish book database. <ulink url="http://darkhorse.com">Dark Horse Comics</ulink> is a comic book publisher. All three of those data sources require <ulink url="http://python.org">Python</ulink>. <ulink url="http://boardgamegeek.com">BoardGameGeek</ulink> is a website with extensive data for board games, and the script requires <ulink url="http://www.ruby-lang.org">ruby</ulink>.
de: Einige Skripte werden bereits mit &appname; ausgeliefert: <ulink url="http://www.allocine.fr">Allocine.fr</ulink> ist eine französische Internetseite für Filme. Das <ulink url="http://www.mcu.es">spanische Kulturministerium</ulink> bietet eine spanische Online-Buchdatenbank. <ulink url="http://darkhorse.com">Dark Horse Comics</ulink> ist ein Comicbuch-Verleger. Für alle drei Datenquellen muss <ulink url="http://python.org">Python</ulink> installiert sein. <ulink url="http://boardgamegeek.com">BoardGameGeek</ulink> ist eine Webseite mit umfassenden Informationen über Brettspiele. Für die Nutzung dieses Skripts muss <ulink url="http://www.ruby-lang.org">Ruby</ulink> installiert sein.

source: The collection type returned by the script must be set, along with the data format. Not only can &appname; import data from scripts that use the <link linkend="file-format">default &appname; &XML; format</link>, but it can also import other formats as well, such as bibtex.
de: Die vom Skript zurückgegebene Art der Sammlung und das Datenformat muss eingestellt werden. &appname; kann nicht nur Daten im <link linkend="file-format">Standard-&XML;-Format von &appname;</link>, sondern auch andere Formate wie Bibtex importieren.

source: The full path to the application should be entered in the source options. Be aware that the application is executed on the system with the same permissions as the current user, so do not use scripts from untrusted sources. Check the boxes next to the search keys supported by the application, and enter the required command line options in the edit box. The search value will be inserted where <userinput>%1</userinput> appears.
de: Der vollständige Pfad zum Skript oder zum Programm muss in den Einstellungen angegeben werden. Beachten Sie, dass das Skript oder Programm mit den Rechten des aktuellen Benutzers ausgeführt wird, benutzen Sie daher keine Skripte aus nicht vertrauenswürdigen Quellen. Aktivieren Sie die Ankreuzfelder neben den Suchschlüsseln, die vom Skript unterstützt werden, und tragen Sie die erforderlichen Befehlszeilenoptionen in das Eingabefeld ein. Die Platzhalter <userinput>%1</userinput> werden durch das Suchergebnis ersetzt.

source: For updating entries already in the collection, the final check box and edit box are used to determine the command-line options. The entry fields used to find an update must be entered, in the same format as used for <link linkend="derived">derived value</link> fields.
de: Zur Aktualisierung bereits in der Sammlung vorhandener Einträge aktivieren Sie das letzte Ankreuzfeld und geben die Befehlszeilenoptionen in das Eingabefeld ein. Die Felder der Einträge, die für die Suche nach Aktualisierungen benutzt werden, müssen das gleiche Format wie die <link linkend="derived">abgeleiteten Werte</link> haben.

source: Multiple Combined Data Sources
de: Mehrere kombinierte Datenquellen

source: Combinations of up to eight existing data sources can be used as a single source, where the search results from all the sources are merged. The collection type to be used must be set before adding sources.
de: Kombinationen von bis zu acht vorhandenen Datenquellen können als eine einzelne Datenquelle genutzt werden. Die Suchergebnisse aller Quellen werden zusammengefasst. Ehe Quellen hinzugefügt werden können, muss der Typ der Sammlung festgelegt werden.

source: Only existing data sources can be used in combination. The search request is sent to each source, and the results are combined. Since the merged results depend on the order of the search results, the combined set may be different depending on network and source speed.
de: Nur bereits vorhandene Datenquellen können als Kombination benutzt werden. Die Suchanfragen werden an jede Quelle geschickt und die Ergebnisse zusammengefasst. Da das Ergebnis von der Reihenfolge der eingegangenen Suchergebnisse abhängt, kann die Zusammenfassung abhängig vom Netzwerk und der Antwortzeit der Quellen unterschiedlich ausfallen.
