Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/extragear-office/tellico_importing-exporting.po
Languages: de

source: Importing and Exporting Data
de: Importieren und Exportieren von Daten

source: &appname; is able to import and export a wide variety of data files, as well as search various Internet sites for information.
de: &appname; kann eine große Zahl von Datenformaten importieren und exportieren und auch verschiedene Internetseiten nach Informationen durchsuchen.

source: Importing from the Internet
de: Import aus dem Internet

source: &appname; is able to search various Internet sites using the <interface>Internet Search Dialog</interface>. Entries may be directly imported and added to your current collection. The various providers are configured via the <link linkend="data-sources-options">Data Sources Options</link>.
de: &appname; kann auf verschiedenen Internetseiten mit dem Dialog <interface>Internet-Suche</interface> nach Informationen suchen. Einträge können direkt importiert und in Ihre aktuelle Sammlung übernommen werden. Die verschiedenen Anbieter können im Einrichtungsdialog auf der Seite <link linkend="data-sources-options">Einstellungen für Datenquellen</link> bearbeitet werden.

source: Searches may use different criteria: <guilabel>Title</guilabel>, <guilabel>Person</guilabel>, <guilabel>ISBN</guilabel>, <guilabel>UPC/EAN</guilabel>, <guilabel>LCCN</guilabel>, or <guilabel>Keyword</guilabel>. Not all criteria are available for certain data sources. <acronym>ISBN</acronym> and <acronym>LCCN</acronym> values are for books only, while <acronym>UPC</acronym> or <acronym>EAN</acronym> values can apply to any type of item.
de: Die Suche kann verschiedene Kriterien verwenden: <guilabel>Titel</guilabel>, <guilabel>Person</guilabel>, <guilabel>ISBN</guilabel>, <guilabel>UPC/EAN</guilabel>, <guilabel>LCCN</guilabel> oder <guilabel>Schlüsselwort</guilabel>. Für einige Datenquellen sind nicht alle Kriterien vorhanden. Die Werte für <acronym>ISBN</acronym> and <acronym>LCCN></acronym> gibt es nur für Bücher, während Werte für <acronym>UPC</acronym> oder <acronym>EAN</acronym> in allen Sammlungsarten vorkommen.

source: Once a search is initiated, the <guibutton>Search</guibutton> button becomes <guibutton>Stop</guibutton> which will end a search. As results are found, they are added to the list directly under the search box, where selecting an item will show the result without adding it to the collection. Clicking the <guibutton>Add Entry</guibutton> button will add all the selected items to your collection. If the data source has more results than were initially requested, the <guibutton>Get More Results</guibutton> button becomes active. Clicking <guibutton>Clear</guibutton> will remove all the current results and reset the search.
de: Wurde die Suche begonnen, wechselt die Beschriftung des Knopfes <guibutton>Suchen</guibutton> zu <guibutton>Stopp</guibutton>. Drücken Sie darauf, um eine Suche abzubrechen. Werden Suchergebnisse gefunden, dann werden sie in die Liste direkt unter dem Suchfeld eingefügt. Klicken Sie auf einen Eintrag, dann wird das Ergebnis angezeigt, ohne den Eintrag in die Sammlung einzufügen. Mit dem Knopf <guibutton>Eintrag hinzufügen</guibutton> können alle ausgewählten Einträge in Ihre Sammlung eingefügt werden. Enthält die Datenquelle mehr Ergebnisse als ursprünglich angefordert, wird der Knopf <guibutton>Weitere Ergebnisse holen</guibutton> aktiviert. Klicken Sie auf <guibutton>Löschen</guibutton> entfernt alle aktuellen Ergebnisse und setzt die Suche zurück.

source: <screeninfo>The &appname; <interface>Internet Search Dialog</interface></screeninfo>
de: <screeninfo>Der <interface>Internet-Suchdialog</interface> von &appname;</screeninfo>

source: <phrase>The &appname; <interface>Internet Search Dialog</interface></phrase>
de: <phrase>Der <interface>Internet-Suchdialog</interface> von &appname;</phrase>

source: Only entries that match the current collection type will be found. The <guilabel>Description</guilabel> column provides additional information about the entry, in order to differentiate between videos in different formats, or books in different bindings, for example. Once an entry is successfully added to the collection, a checkmark is added to the first column in the list.
de: Es werden nur Einträge gefunden, die zur gerade geöffneten Sammlungsart passen. In der Spalte <guilabel>Beschreibung</guilabel> werden zusätzliche Informationen zum Eintrag angezeigt. An diesen Informationen können Sie zum Beispiel Videos in verschiedenen Formaten und Bücher in verschiedenen Einbänden erkennen. Ist ein Eintrag zur Sammlung hinzugefügt worden, dann wird das durch ein Häkchen in der ersten Spalte der Liste angezeigt.

source: Multiple entries can be added at once by using the standard &kde; method for multiple selection, which usually involves holding the &Shift; or &Ctrl; key when clicking on an item.
de: Mehrere Einträge können auf einmal hinzugefügt werden, indem Sie die Standardmethode in &kde; für eine Mehrfachauswahl benutzen. Dazu halten Sie die &Shift;- oder &Ctrl;-Taste gedrückt, wenn Sie auf einen Eintrag klicken.

source: To facilitate the use of barcode scanners, searches can include multiple ISBN/UPC values. Selecting the <guilabel>Multiple ISBN/UPC search</guilabel> check box will disable the search box and enable the <guibutton>Edit ISBN/UPC values...</guibutton> button, which will open a multi-line text entry box. Each ISBN should be entered on a line by itself. After closing the box, each ISBN will be validated for correct formatting. The ISBN validation is able to convert 13-digit EAN values, as well as full <acronym>UPC</acronym> codes, to the proper formatting. The ISBN list may also be read from a text file.
de: Um die Benutzung von Barcodescannern zu ermöglichen, kann eine Suche mehrere ISBN- bzw.UPC-Werte einschließen. Mit <guilabel>Mehrfache ISBN/UPC-Suche</guilabel> deaktiviert das Sucheingabefeld und aktiviert den Knopf <guibutton>ISBN/UPC-Werte bearbeiten ...</guibutton>. Mit diesem Knopf öffnen Sie einen Dialog mit einem mehrzeiligen Texteingabefeld. Jede muss auf einer eigenen Zeile eingegeben werden. Nach dem Schließen des Dialogs wird das Format jeder ISBN-Nummer überprüft. Die Überprüfung kann sowohl EAN-Werte mit 13 Stellen wie auch vollständigen <acronym>UPC</acronym>-Code in eine gültige ISBN-Nummer umwandeln. Die Liste mit ISBN-Werten kann auch aus einer Textdatei eingelesen werden.

source: Importing Data
de: Daten importieren

source: &appname; offers three different actions when importing data. <guilabel>Replace current collection</guilabel> will close the current collection, and create a new one with the data from the imported file. <guilabel>Append to current collection</guilabel> tells &appname; to add all the entries in the imported collection to the current one, and to add any fields which don't currently exist. The <guilabel>Merge collection</guilabel> action is the same as appending, except that each imported entry is compared to the current ones, and any identical entries are skipped. Future plans include an improved heuristic for identifying matching entries, but currently, except for music collections, they must be identical for every field. Music collections compare the artist and album only, and the tracks are merged for matching entries. The <link linkend="importing-audio-files">audio file importer</link> is able to correctly build track lists by merging entries.
de: Für den Import von Daten bietet &appname; drei verschiedene Möglichkeiten. Mit der Einstellung <guilabel>Aktuelle Sammlung ersetzen</guilabel> wird die gerade geöffnete Sammlung geschlossen und mit den importierten Daten eine neue Sammlung erstellt. Mit <guilabel>Zur aktuellen Sammlung hinzufügen</guilabel> werden alle importierten Daten einschließlich aller noch nicht vorhandene Felder in die geöffnete Sammlung eingefügt . <guilabel>Mit aktueller Sammlung verschmelzen</guilabel> funktioniert wie das Hinzufügen, nur dass dabei jedes importierte Feld mit den bereits vorhandenen Felder verglichen wird und alle identische Einträge übersprungen werden. Für zukünftige Programmversionen ist eine verbessertes Verfahren zur Erkennung von identischen Einträgen geplant. Mit Ausnahme von Musik-Sammlungen müssen zurzeit alle Felder identisch sein. Bei Musik-Sammlungen wird nur der Künstler und das Album verglichen, bei gleichen Einträgen werden die Stücke zusammenfügt. Mit dem <link linkend="importing-audio-files">Audio-Importmodul</link> können korrekte Stücklisten durch Zusammenfügen von Einträgen erstellt werden.

source: Importing &appname; Data
de: &appname;-Daten importieren

source: Other &appname; data files may be imported. Replacing the current collection by importing a &appname; file is the same thing as just opening the file itself. The value of importing &appname; data is primarily for appending or merging two collections together.
de: Auch andere &appname;-Datendateien können importiert werden. Ersetzen Sie die gerade geöffnete Sammlung durch eine importierte &appname;-Datei, dann entspricht das dem normalen Öffnen der Datei. Die Importfunktion von &appname; sollte in erster Linie dazu benutzt werden, Daten anzufügen oder zwei Sammlungen zusammenzulegen.

source: Importing CSV Data
de: CSV-Daten importieren

source: Comma-separated values (<acronym>CSV</acronym>) are a common way of importing and exporting tabular data. Each field value is separated by a comma, with one entry per line. The field titles may be included in the first line. The CSV importer is not limited to using a comma as the separator. Any character or string may be used.
de: Durch Kommata getrennte Werte (<acronym>CSV</acronym>) sind ein häufig genutztes Verfahren, um Daten in Tabellenform zu im- oder exportieren. Jeder Feldwert wird durch ein Komma getrennt und jede Zeile enthält einen Eintrag. Die Kopfzeilen der Felder können in der ersten Zeile enthalten sein. Das CSV-Importmodul kann beliebige Trennzeichen verarbeiten, nicht nur Kommata.

source: <screeninfo>The CSV Import Dialog</screeninfo>
de: <screeninfo>CSV-Import-Dialog</screeninfo>

source: <phrase>The CSV Import Dialog</phrase>
de: <phrase>CSV-Import-Dialog</phrase>

source: First, select the type of collection that you are importing. If you are appending or merging to your open collection, the type is limited to your current collection type. If the first line of the CSV file contains the field titles, click the check box and the importer will automatically compare the titles against the fields in the current collection. If a field title matches, the header for that column changes to show that the column has been assigned to that field. If the file uses a delimiter other than a comma, be sure to change that option accordingly.
de: Wählen Sie als erstes die Art der Sammlung, die Sie importieren möchten. Wenn Sie Daten zur geöffneten Sammlung hinzufügen oder damit verschmelzen, dann ist die Art der Sammlung durch die bereits geöffnete Datei vorgegeben. Enthält die erste Zeile der CSV-Datei Feld-Titel, dann aktivieren Sie dieses Ankreuzfeld. Dann werden beim Import die Titel in der CSV-Datei mit den Feld-Titeln der geöffneten Sammlung verglichen. Stimmen einige Titel überein, dann werden die Spaltennummern durch diese Titel ersetzt. Damit wird angezeigt, dass die Spalte dem Feld zugeordnet wurde. Wird in der CSV-Datei ein anderes Trennzeichen als das Komma verwendet, passen Sie diese Einstellung an.

source: In order for &appname; to properly import the file, it must know which field corresponds to each column. <emphasis>If the column only has a number in the header, the data in that column will not be imported.</emphasis> You should assign fields to each column by selecting a column, either by clicking in it or changing the column number itself, then selecting the field to assign from the drop down box and clicking the <guibutton>Assign Field</guibutton> button. If you need to add a new field to the collection, the last item in the drop down box opens the <link linkend="fields-dialog"><interface>Collection Fields Dialog</interface></link>.
de: Damit &appname; die Daten richtig importieren kann, müssen alle Spalten den vorhandenen Feldern der Sammlung zugeordnet werden. <emphasis>Wird als Spaltentitel nur eine Zahl angezeigt, dann werden die Daten dieser Spalte nicht importiert</emphasis>. Deshalb sollten Sie jede Spalte einem Feld der Sammlung zuordnen, indem Sie entweder in die Spalte klicken oder direkt die Nummer der Spalte ändern, das passende Feld aus dem Auswahlfeld wählen und den Knopf <guibutton>Feld zuweisen</guibutton> drücken. Möchten Sie für eine Spalte ein neues Feld zur geöffneten Sammlung hinzufügen, wählen Sie den letzten Eintrag im Auswahlfeld. Diese Eintrag öffnet den Dialog <link linkend="fields-dialog"><interface>Sammlungsfelder</interface></link>.

source: Only the first five lines of the imported CSV file are shown in the dialog.
de: Nur die ersten fünf Zeilen der importierten CSV-Datei werden im Dialog angezeigt.

source: Importing Audio &CD; Data
de: Audio-&CD;-Daten importieren

source: &appname; is able to use the <ulink url="http://freedb.org">freedb.org</ulink> service to lookup information about a &CD;, including the track list. Depending on your distribution, settings for access to the service may be set in the &kde; &systemsettings;. The &CD; artist, title, genre, year, and track listing are all added.
de: &appname; kann die <ulink url="http://freedb.org">freedb.org</ulink>-Datenbank nach Informationen zu einer &CD; abfragen, einschließlich der Stückliste. Der Zugriff auf diesen Dienst muss bei einigen Distributionen in den &kde;-&systemsettings; eingerichtet werden. Die Informationen über Künstler, Titel, Gattung, Jahr und Stückliste der &CD; werden alle in die Sammlung eingefügt.

source: In addition, if the disc contains &CD;-Text, that information is read and added to the imported entry.
de: Zusätzlich wird ein &CD;-Text, der auf der CD enthalten ist, eingelesen und zu den importierten Daten hinzugefügt.

source: Importing Audio File Metadata
de: Audio-Datei-Metadaten importieren

source: &appname; is able to scan a folder and read the tags for common audio file formats, such as <literal role="extension">mp3</literal> and <literal role="extension">ogg</literal>. The songs are entered in a music collection, where each entry is an album. If the song files contain the track number, the song name is inserted in the correct spot in the track list. The artist and genre information is also added to the entry. If the song tags contain comments, they are appended to the comments field in the entry, preceded by the file name.
de: &appname; kann einen Ordner durchsuchen und die Stichwörter für normale Audio-Formate wie <literal role="extension">mp3</literal> und <literal role="extension">ogg</literal> lesen. Die Musikstücke werden als Musik-Sammlung eingefügt, dabei entspricht jeder Eintrag einem Album. Enthalten die Musikdateien die Stücknummern, dann wird der Titel an der richtigen Stelle in die Stückliste eingefügt. Die Informationen über Künstler und Gattung werden ebenso übernommen. Sind in den Stichwörtern der Musikstücke Kommentare enthalten, werden sie mit vorangestelltem Dateinamen in das Kommentarfeld eingefügt.

source: In addition, if a folder contains a <filename>.directory</filename> file and the folder name matches an album title, the <literal>Icon</literal> entry in the desktop file is used as the cover image for the album.
de: Wenn ein Ordner eine <filename>.directory</filename>-Datei enthält und der Ordnername mit dem Titel des Albums übereinstimmt, wird zusätzlich der Eintrag <literal>Icon</literal> in der Datei als Coverbild für das Album benutzt.

source: The audio file metadata importer can recursively scan a folder to find all audio files in any subfolder, though symbolic links are not followed. &appname; uses the <ulink url="http://developer.kde.org/~wheeler/taglib.html">TagLib library</ulink> for reading the audio file metadata, and so can import data from any file type that TagLib understands.
de: Das Modul zum Importieren von Metadaten aus Audio-Dateien durchsucht rekursiv einen Ordner und alle Unterordner nach Audio-Dateien, aber folgt keinen symbolischen Verknüpfungen. &appname; verwendet die <ulink url="http://developer.kde.org/~wheeler/taglib.html">TagLib-Bibliothek</ulink>, um die Metadaten der Audio-Dateien auszulesen und kann Daten von allen Dateitypen importieren, die TagLib-Bibliothek verarbeitet.

source: Importing Alexandria Libraries
de: Alexandria-Bibliotheken importieren

source: <application><ulink url="http://alexandria.rubyforge.org">Alexandria</ulink></application> is an alternate book collection manager for the <ulink url="http://www.gnome.org">GNOME</ulink> desktop environment. The importer offers a choice of importing any of the libraries found in <filename class="directory">$<envar>HOME</envar>/.alexandria/</filename>.
de: <application><ulink url="http://alexandria.rubyforge.org">Alexandria</ulink></application> ist eine andere Sammlungsverwaltung für Bücher für die <ulink url="http://www.gnome.org">GNOME</ulink>-Arbeitsumgebung. Beim Importieren können Sie auswählen, welcher der in <filename class="directory">$<envar>HOME</envar>/.alexandria/</filename> gefundenen Dateien eingefügt werden sollen..

source: Importing Ant Movie Catalog Data
de: „Ant Movie Catalog“-Daten importieren

source: <application><ulink url="http://www.antp.be/software/moviecatalog/">Ant Movie Catalog</ulink></application> is an alternate movie collection manager.
de: <application><ulink url="http://www.antp.be/software/moviecatalog/">Ant Movie Catalog</ulink></application> ist ein weiteres Programm zur Verwaltung von Filmdaten.

source: Importing Bibtex Data
de: Bibtex-Daten importieren

source: <ulink url="http://en.wikipedia.org/wiki/Bibtex">Bibtex</ulink> is a bibliography format used with the LaTeX document preparation system. Various type of bibliographic references may be included in the file. &appname; imports bibtex files as a Bibliographic collection.
de: <ulink url="http://en.wikipedia.org/wiki/Bibtex">Bibtex</ulink> ist ein Format für Literaturverzeichnisse, das mit dem LaTeX-Dokumentsystem benutzt wird. Viele Arten von Literaturnachweisen können in der Datei enthalten sein. &appname; importiert Bibtex-Dateien als Literaturverzeichnisse.

source: If the bibtex importer encounters fields in the file which are not in the default bibliography collection, they are added as <link linkend="line">Simple Text</link> fields, with two exceptions. If the field value contains more than 100 characters, it becomes a <link linkend="para">Paragraph</link> field. If the field value appears to contain a &URL; or a file reference, then a <link linkend="url">&URL;</link> field is created. &appname; uses an internal copy of the <ulink url="http://www.gerg.ca/software/btOOL/">btparse library</ulink> for parsing the bibtex files.
de: Treten beim Bibtex-Import Felder in der Importdatei auf, die in den Standardfeldern eines Literaturverzeichnisses nicht enthalten sind, werden diese Felder mit zwei Ausnahmen als <link linkend="line">Einfacher Text</link> eingefügt. Ist der Wert eines Feldes länger als 100 Zeichen, so wird es als <link linkend="para">Absatz</link> eingelesen. Enthält der Feldwert anscheinend eine &URL; oder die Verknüpfung zu einer Datei, dann wird ein <link linkend="url">&URL;</link>-Feld erstellt. &appname; benutzt eine interne Kopie der Bibliothek <ulink url="http://www.gerg.ca/software/btOOL/">btparse</ulink> zum Lesen von Bibtex-Dateien.

source: Importing Bibtexml Data
de: Bibtexml-Daten importieren

source: <ulink url="http://bibtexml.sf.net">Bibtexml</ulink> is an &XML; representation of bibtex data, and the data from the imported bibtexml file is treated in the same way as bibtex data would be.
de: <ulink url="http://bibtexml.sf.net">Bibtexml</ulink> sind Bibtex-Daten im &XML;-Format. Die Daten einer importierten Bibtexml-Datei werden wie Bibtex-Daten verarbeitet.

source: Importing Delicious Library Data
de: Delicious-Bibliotheksdaten importieren

source: <application><ulink url="http://www.delicious-monster.com/">Delicious Library</ulink></application> is an alternate collection manager for the &Mac; OS X desktop. &appname; imports a subset of the data used by Delicious Library.
de: <application><ulink url="http://www.delicious-monster.com/">Delicious Library</ulink></application> ist eine weitere Sammlungsverwaltung für &Mac; OS X. &appname; import eine Teilmenge der Daten, die in der Delicious-Bibliothek gespeichert sind.

source: Importing GCstar Data
de: GCstar-Daten importieren

source: <application><ulink url="http://www.gcstar.org">GCstar</ulink></application> is an alternate collection manager. Importing books, movies, music, coins, games, board games and wine collections is currently supported.
de: <application><ulink url="http://www.gcstar.org">GCstar</ulink></application> ist eine weitere Sammlungsverwaltung. Der Import von Buch-, Film-, Musik-, Münz-, Spiel-, Brettspiel- und Weinsammlungen ist möglich.

source: &appname; can also import <application>GCfilms</application> data files. <application><ulink url="http://home.gna.org/gcfilms/">GCfilms</ulink></application> is the predecessor of <application>GCstar</application> and was an alternate movie collection manager. Normally, <application>GCfilms</application> data files are found in <filename class="directory">$<envar>HOME</envar>/.local/share/gcfilms/</filename>.
de: &appname; kann auch <application>GCfilms</application>-Datendateien importieren. <application><ulink url="http://home.gna.org/gcfilms/">GCfilms</ulink></application> ist der Vorgänger von <application>GCstar</application> und war eine weitere Sammlungsverwaltung für Filme. Normalerweise werden <application>GCfilms</application>-Datendateien in <filename class="directory">$<envar>HOME</envar>/.local/share/gcfilms/</filename> gespeichert.

source: Importing Griffith Data
de: Griffith-Daten importieren

source: <application><ulink url="http://griffith.berlios.de/">Griffith</ulink></application> is an alternate video collection manager. &appname; is able to import most data from a Griffith database.
de: <application><ulink url="http://griffith.berlios.de/">Griffith</ulink></application> ist eine Verwaltung für Videodaten. &appname; kann die meisten Daten einer Griffith-Datenbank importieren.

source: Importing MODS Data
de: MODS-Daten importieren

source: <acronym><ulink url="http://www.loc.gov/standards/mods/">MODS</ulink></acronym> is a format for representing various types of media collections. Currently, only books are imported by &appname;, as a Bibliographic collection.
de: <acronym><ulink url="http://www.loc.gov/standards/mods/">MODS</ulink></acronym> ist ein Format für verschiedenen Arten von Mediensammlungen. Zur Zeit werden nur Bücher als Literaturverzeichnisse durch &appname; importiert.

source: Importing PDF Data
de: PDF-Daten importieren

source: If &appname; was compiled with <emphasis>exempi</emphasis> or <emphasis>poppler</emphasis> support, metadata from PDF files can be imported. Metadata may include title, author, and date information, as well as bibliographic identifiers which are then used to update other information.
de: Wenn &appname; mit den Bibliotheken <emphasis>exempi</emphasis> oder <emphasis>poppler</emphasis> kompiliert wurde, können Metadaten aus PDF-Dateien importiert werden. Metadaten enthalten den Titel, Autor und Datumsinformationen wie auch Bezeichner für Literaturverzeichnisse, die für die Aktualisierung anderer Daten verwendet werden können.

source: Importing Referencer Data
de: Referencer-Daten importieren
