Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/extragear-office/tellico_hacking.po
Languages: de

source: Hacking &appname;
de: &appname; weiter entwickeln und programmieren

source: In the spirit of Free Software, you are welcome to hack on &appname; as much as you like. You should be able to write scripts to import, export, or modify data very easily. This chapter gives you more information about doing that.
de: &appname; ist freie Software, daher ist erwünscht, dass Sie das Programm weiterentwickeln und verbessern. Es ist relativ einfach, Skripte für den Import oder Export zu schreiben oder um Daten zu verändern. In diesem Kapitel finden Sie dazu viele Informationen.

source: File Format
de: Dateiformat

source: The default &appname; data file is a zip archive, normally with a <literal role="extension">.tc</literal> file extension. Inside the archive is a top-level <filename>tellico.xml</filename> file. Images may be included inside the <filename>images/</filename> folder in the archive, or they may be included in the &XML; data directly in a base64 encoding. Images may also be saved inside the application data folder, in which case, they are not in the data file at all. &appname; can also load the &XML; file, by itself, uncompressed.
de: &appname; benutzt als Datendatei ein Zip-Archiv, normalerweise mit der Dateierweiterung <literal role="extension">.tc</literal>. In diesem Archiv befindet sich im obersten Ordner die Datei <filename>tellico.xml</filename>. Bilder können im Ordner <filename>images/</filename> im Archiv sein oder direkt als Base64-kodiert in den &XML;-Daten enthalten sein. Bilder können außerdem noch im Datenordner des Programms gespeichert werden, dann fehlen sie in der Datendatei. &appname; kann die &XML;-Datei unkomprimiert laden.

source: &XML; Data
de: &XML;-Daten

source: Collection
de: Sammlung

source: The file begins with the required &XML; declaration and encoding, followed by the doctype. When a new field type is added or additional properties are set on the default fields, the doctype DTD version is incremented. &appname; is always able to open and read any previous DTD version, but will save files in the current version. The DTD location does point to an actual DTD file.
de: Die Datei beginnt mit der erforderlichen &XML;-Deklaration und Kodierung, gefolgt vom DOCTYPE. Wenn ein Feldtypen oder zusätzliche Eigenschaften für die Standardfelder hinzugefügt werden, wird die Versionsnummer der DOCTYPE-DTD erhöht. &appname; kann alle vorherigen DTD-Versionen öffnen und lesen, speichert aber immer in der neuesten Version. Der Speicherort der DTD verweist immer auf die aktuelle DTD.

source: The top-level element is a <markup>&lt;tellico&gt;</markup> element, containing the default namespace declaration and the syntax version of the file, which should always match the DTD.
de: Das oberste Element ist ein <markup>&lt;tellico&gt;</markup>-Element, das den Standard-Namensbereich und die Syntaxversion enthält, die immer zur DTD passen sollte.

source: The <markup>&lt;tellico&gt;</markup> element contains one <markup>&lt;collection&gt;</markup> element. Multiple collections are ignored, for now. The <markup>title</markup> attribute contains the collection title, while the <markup>type</markup> specifies what kinds of entries are contained in the collection. The allowable types are in <link linkend="collection-type-values">listed in a later section</link>. An optional <markup>entryTitle</markup> attribute may be used to specify the title of the entries for a custom collection, and should be plural.
de: Das <markup>&lt;tellico&gt;</markup>-Element enthält ein <markup>&lt;collection&gt;</markup>-Element. Weitere <markup>&lt;collection&gt;</markup>-Elemente werden zurzeit ignoriert. Das Attribut <markup>title</markup> enthält den Titel der Sammlung. Das Attribut <markup>type</markup> bestimmt, welche Art von Einträgen in der Sammlung vorhanden sind. Die erlaubten Typen werden in einem <link linkend="collection-type-values">späteren Abschnitt</link> aufgezählt. Das optionale Attribut <markup>entryTitle</markup> kann benutzt werden, um den Titel der Einträge für eine benutzerdefinierte Sammlung anzugeben, der Titel sollte im Plural eingeben werden.

source: Fields
de: Felder

source: All of the fields are defined inside a <markup>&lt;fields&gt;</markup> element, of which there can be only one. All of the information for a field, except for any properties, are included as attributes of the <markup>&lt;field&gt;</markup> element. The allowable values for the <markup>flags</markup>, <markup>format</markup>, and <markup>type</markup> attributes are given in a <link linkend="field-type-values">following section</link>.
de: Alle Felder werden innerhalb eines Elements <markup>&lt;fields&gt;</markup> definiert, das nur einmal vorkommen darf. Alle Informationen über ein Feld mit Ausnahme der Eigenschaften werden als Attribute des Elements <markup>&lt;fields&gt;</markup> eingefügt. Die erlaubten Werte für die Attribute <markup>flags</markup>, <markup>format</markup> und <markup>type</markup> werden im nächsten Abschnitt angegeben.

source: Field properties are used for setting default field values, rating value ranges, derived value templates, etc. The examples above include a default value, a maximum rating value, and a template for a derived ID field.
de: Mit Eigenschaften von Feldern können Voreinstellung der Feldwerte, Wertebereiche für die Bewertung, abgeleitete Wertvorlagen usw. festgelegt werden. Das Beispiel oben enthält einen Standardwert, einen Maximum für eine Bewertung und eine Vorlage für ein angeleitetes ID-Feld.

source: Entries
de: Einträge

source: For every field in the collection, an <markup>&lt;entry&gt;</markup> may contain an element whose name is identical to the field name. If multiple values are allowed for the field, then the letter <emphasis>s</emphasis> is added to the field name to create an element, and each value is added as a child of the element, as in the case of the author, genre, and keyword fields above.
de: Für jedes Feld einer Sammlung kann das Element <markup>&lt;entry&gt;</markup> ein Element mit der gleichen Bezeichnung wie der Name des Feldes enthalten. Wenn mehrere Werte für das Feld erlaubt sind, dann wird der Buchstabe <emphasis>s</emphasis> an den Feldnamen angefügt,um ein Element zu erstellen. Jeder neue Wert wird als untergeordnetes Element eingefügt, wie bei den Feldern Autor, Gattung und Schlüsselwort im vorher genannten Beispiel.

source: As a result, if additional fields are added to the collection, the data file will no longer conform to the DTD. However, &appname; uses a non-validating &XML; parser, so additional fields do not cause problems.
de: Daraus folgt, dass die Datendatei nach dem Einfügen zusätzlicher Felder zur Sammlung nicht mehr der DTD entspricht. &appname; benutzt jedoch ein &XML;-Parser, der die Gültigkeit nicht überprüft, daher gibt es keine Probleme mit zusätzlichen Feldern,

source: Images
de: Bilder

source: Inside the <markup>&lt;images&gt;</markup> element, each image referenced by an entry is listed, along with attributes describing the image's size, format, and id. If the image is contained inside the Zip file, the element is empty. Otherwise, the image data may be contained in the &XML; stream as base64-encoded text.
de: Innerhalb des Elements <markup>&lt;images&gt;</markup> wird jedes Bild mit Attributen für die Bildgröße durch einen Eintrag zur Verknüpfung aufgelistet. Ist das Bild in der Zip-Datei enthalten, ist dieses Element leer. Ansonsten können die Bilddaten im &XML;-Datenstrom als Text in Base64-Kodierung eingefügt werden.

source: Collection Type Values
de: Werte für Sammlungsarten

source: The type of collection is given in the type attribute of the collection element. The value is equal to the <type>Type</type> enum value in <filename>src/collection.h</filename>.
de: Die Art der Sammlung wird im Typ-Attribute festgelegt. Der Wert entspricht dem Aufzählungswert <type>Type</type> in <filename>src/collection.h</filename>.

source: Collection Type
de: Sammlungsarten

source: Value
de: Wert

source: Custom Collection
de: Benutzerdefinierte Sammlung

source: Book Collection
de: Bücher-Sammlung

source: Video Collection
de: Video-Sammlung

source: Music Collection
de: Musik-Sammlung

source: Bibliography
de: Literaturverzeichnis

source: Comic Book Collection
de: Comic-Bücher-Sammlung

source: Wine Collection
de: Wein-Sammlung

source: Coin Collection
de: Münzen-Sammlung

source: Stamp Collection
de: Briefmarken-Sammlung

source: Trading Card Collection
de: Sammelkarten-Sammlung

source: Video Game Collection
de: Videospiel-Sammlung

source: File Catalog
de: Dateikatalog

source: Board Game Collection
de: Brettspiel-Sammlung

source: Field Type Values
de: Werte der Feldtypen

source: &appname; will include all the default fields for a collection if the first field element has the name <emphasis>_default</emphasis>. For <emphasis>Paragraph</emphasis>, <emphasis>Table</emphasis>, or <emphasis>Image</emphasis> fields, the field category should be identical to the field title.
de: &appname; fügt alle Standardfelder einer Sammlung ein, wenn des erste Feldelement den Namen <emphasis>default</emphasis> hat. Bei den Feldtypen <emphasis>Absatz</emphasis>, <emphasis>Tabelle</emphasis> oder <emphasis>Bild</emphasis> sollte die Kategorie die gleiche Bezeichnung wie der Feldname haben.

source: The type of field is given in the type attribute of the field element. The value is equal to the <type>FieldType</type> enum value in <filename>src/field.h</filename>.
de: Die Art des Feldes wird im Typ-Attribute des Feld-Elements festgelegt Der Wert entspricht dem Aufzählungswert <type>FieldType</type> in <filename>src/field.h</filename>.

source: Field Type
de: Feldtyp

source: Simple Text
de: Einfacher Text

source: Paragraph
de: Absatz

source: Choice
de: Auswahl

source: Checkbox
de: Ankreuzfeld

source: Number
de: Zahl

source: Single-Column Table
de: Einspaltige Tabelle

source: Image
de: Bild

source: Date
de: Datum

source: Rating
de: Bewertung

source: The field may have different flags set, given as a bitwise OR'd value in the flags attribute on the field element. The flag for preventing the user from deleting a field is intended for such things as the citation key for bibliographic entries.
de: Für ein Feld können verschiedene Bitschalter gesetzt werden, die bitweise als Wert der Operation OR im Schalterattribut des Feldelements gespeichert werden. Der Schalter, der das Löschen eines Feldes durch den Benutzer verhindert, ist unter anderem für den Zitatschlüssel von Einträgen in Literaturverzeichnissen vorgesehen.

source: Field Flag Values
de: Bitschalter für Feldwerte

source: Field Flags
de: Feld-Bitschalter

source: Allow Multiple Values
de: Mehrere Einträge erlauben

source: Allow Grouping
de: Gruppierung erlauben

source: Allow Completion
de: Vervollständigung erlauben

source: Disallow Deleting
de: Löschen nicht zulassen

source: Disallow Editing
de: Bearbeitung nicht zulassen

source: Derived Value
de: Abgeleiteter Wert

source: The format of the field is given in the format attribute on the field element. <emphasis>Date Formatting</emphasis> is not currently used. Grouping by <emphasis>People</emphasis> uses all the fields which use <emphasis>Name Formatting</emphasis>. Setting the <emphasis>Derived Value</emphasis> flag implies the value for the field is generated from the template property from other field values.
de: Das Format des Felds wird im gleichnamigen Attribut des Feldelements angegeben. <emphasis>Datumsformatierung</emphasis> wird zurzeit nicht benutzt. Die Gruppierung nach <emphasis>Personen</emphasis> verwendet alle Felder mit <emphasis>Namensformatierung</emphasis>. Die Angabe des Schalters <emphasis>Abgeleiteter Wert</emphasis> setzt voraus, dass der Wert für das Feld korrekt mit dem Formattext aus anderen Feldwerten generiert wird.

source: Field Format Values
de: Feldformat-Werte

source: Field Format
de: Feldformat

source: Capitalization Only
de: Nur Großschreibung

source: Title Formatting
de: Titelformatierung

source: Name Formatting
de: Namensformatierung

source: Date Formatting
de: Datumsformatierung

source: No Formatting
de: Keine Formatierung

source: Hidden Configuration Options
de: Versteckte Einstellungsmöglichkeiten

source: &appname; has some additional configuration options that are not visible in the <interface>Configuration Dialog</interface>. They are not important enough to warrant cluttering the dialog with more settings, but as they represent options which may appeal to various users, the application does read them from the configuration file.
de: &appname; hat einige weitere Einstellungsmöglichkeiten, die im <interface>Einrichtungsdialog</interface> nicht aufgeführt werden. Sie sind nicht wichtig genug, um den Dialog mit noch mehr Optionen zu überladen. Für einige Benutzer könnten diese Einstellungen bedeutsam sein, daher werden diese Einstellungen aus der Einrichtungsdatei gelesen.

source: The settings for &appname; are saved in a file in the user's home folder, namely <filename>$<envar>KDEHOME</envar>/share/config/tellicorc</filename>. Within that file, settings are put in groups, which appear with bracketed names, such as [General Options]. To add a setting to the <emphasis>General Options</emphasis> group, find the line in the settings file with that group name. If it does not appear, then create it yourself by adding a line saying [General Options]. Then, the setting can be added underneath the group name.
de: Die Einstellungen für &appname; werden in einer Datei namens <filename>$<envar>KDEHOME</envar>/share/config/tellicorc</filename> im persönlichen Ordner des Benutzers gespeichert. In dieser Datei sind Einstellungen in Gruppen angeordnet, die wie zum Beispiel [General Options] in eckigen Klammern eingeschlossen sind. Um eine Einstellung zur Gruppe <emphasis>General Options</emphasis> hinzuzufügen, suchen Sie die Zeile mit diesem Gruppennamen in der Einrichtungsdatei. Existiert die Gruppe noch nicht, dann erstellen Sie sie, indem Sie die Zeile [General Options] einfügen. Dann können die Einstellungen unterhalb des Gruppennamens angegeben werden.

source: These settings should be placed in the <emphasis>General Options</emphasis> group.
de: Diese Einstellungen sollten in die Gruppe <emphasis>General Options</emphasis> eingefügt werden.

source: Max Icon Size
de: Maximale Symbolgröße

source: The maximum size of the icons in the <interface>Icon View</interface> may be changed with this setting. The default value is 96. The size must be in the range of 32 to 512.
de: Die maximale Größe der Symbole in der <interface>Symbolansicht</interface> kann mit dieser Einstellung geändert werden. Der Standardwert beträgt 96. Erlaubt sind Werte von 32 bis 512.

source: Example
de: Beispiel

source: Icon Cache Size
de: Größe des Symbol-Zwischenspeichers

source: The maximum numbers of icons cached in memory may be changed with this setting. The default value is 1000.
de: Die maximale Anzahl der Symbole, die im Arbeitsspeicher vorgehalten werden, kann mit dieser Einstellung geändert werden. Der Standardwert beträgt 1000.

source: Image Cache Size
de: Größe des Bildzwischenspeichers

source: The maximum amount of memory in bytes used for caching all the images may be changed with this setting. The default value is 67108864.
de: Der maximale Arbeitsspeicher in Byte für das Zwischenspeichern aller Bilder, kann mit dieser Einstellung geändert werden. Der Standardwert beträgt 67108864.

source: These settings should be placed in the <emphasis>Options - bibtex</emphasis> group.
de: Diese Einstellungen sollten in die Gruppe <emphasis>Options - bibtex</emphasis> eingefügt werden.

source: This setting is for the location of the lyxpipe for sending bibliographic citations. It should not include the <literal role="extension">.in</literal> suffix.
de: Diese Einstellung gibt den Speicherort der „lyxpipe“ für das Senden von bibliografischen Zitaten an. Die Dateierweiterung <literal role="extension">.in</literal> darf nicht enthalten sein.

source: These settings should be placed in the <emphasis>Export Options - PilotDB</emphasis> group.
de: Diese Einstellungen sollten in die Gruppe <emphasis>Export Options - PilotDB</emphasis> eingefügt werden.

source: Charset
de: Zeichensatz

source: The encoding of the exported data within the PilotDB file may be changed with this setting. The default value is the character set for the user's locale.
de: Die Kodierung der exportierten Daten in der PilotDB-Datei kann mit dieser Einstellung geändert werden. Als Standard wird die vom Benutzer gesetzte Kodierung verwendet.

source: Bibtex Character Translation
de: Bibtex-Zeichenumwandlung

source: When bibtex files are imported or exported, certain characters are translated between their TeX equivalents and the Unicode characters. Those character mappings are contained in the <filename>bibtex-translation.xml</filename> file, located in the installation data directory. The mappings can be modified, as desired. The key element contains the Unicode character, and the string elements within contain the TeX equivalents, which may be a one-to-many mapping. The first one is the one used when exporting to bibtex.
de: Wenn Bibtex-Dateien importiert oder exportiert werden, müssen einige Zeichen von der Schreibweise in TeX in Unicode umgewandelt werden. Diese Zuordnung der Zeichen ist in der Datei <filename>bibtex-translation.xml</filename> definiert, die sich im Installations-Datenordner befindet. Die Zuordnung kann geändert werden, falls das nötig ist. Das Element „key“ enthält das Unicodezeichen und die Zeichenketten mit der zugehörigen TeX-Schreibweise. Eine Zuordnung von einem Unicodezeichen zu mehreren TeX-Zeichenketten ist erlaubt. Die erste Zuordnung wird beim Export in Bibtex benutzt.

source: Here are some tips for writing XSLT to parse &appname; &XML; data: (TBD).
de: Hier werden in einer der nächsten Versionen dieses Dokuments Tipps für das Schreiben von XSLT zum Bearbeiten von &appname;-&XML;-Daten eingefügt.
