Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/extragear-office/tellico_menus.po
Languages: de

source: Command Reference
de: Befehlsreferenz

source: The Main &appname; Window
de: Das Hauptfenster von &appname;

source: Each menu item is discussed below. When there is a keyboard shortcut that performs a menu item function, the default shortcut is listed with the menu item.
de: Die einzelnen Menüeinträge sind unten beschrieben. Falls eine Tastenkombination existiert, die die entsprechende Funktion ausführt, wird die Standardkombination neben dem Menüeintrag aufgeführt.

source: The <guimenu>File</guimenu> Menu
de: Das Menü <guimenu>Datei</guimenu>

source: <guimenu>File</guimenu> <guimenuitem>New</guimenuitem>
de: <guimenu>Datei</guimenu> <guimenuitem>Neu</guimenuitem>

source: This command <action>creates a new collection</action>. &appname; supports <link linkend="collection-types">12 default collection types</link> along with an empty user-defined custom collection.
de: Dieser Befehl <action>erzeugt eine neue Sammlung</action>. In &appname; gibt es <link linkend="collection-types">12 Standardsammlungen</link>, dazu noch eine leere benutzerdefinierte Sammlung.

source: <shortcut> <keycombo>&Ctrl;<keycap>O</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Open...</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>O</keycap></keycombo></shortcut><guimenu>Datei</guimenu><guimenuitem>Öffnen ...</guimenuitem>

source: This command <action>opens a &appname; file</action>.
de: Dieser Befehl <action>öffnet eine &appname;-Datei</action>.

source: <guimenu>File</guimenu> <guimenuitem>Open Recent</guimenuitem>
de: <guimenu>Datei</guimenu> <guimenuitem>Zuletzt geöffnete Dateien</guimenuitem>

source: This command <action>opens a file</action> from a submenu that contains a list of recently opened files.
de: <action>Öffnet eine Datei</action> aus einem Untermenü mit einer Liste zuletzt geöffneter Dateien.

source: <shortcut> <keycombo>&Ctrl;<keycap>S</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Save...</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl; <keycap>S</keycap></keycombo></shortcut> <guimenu>Datei</guimenu> <guimenuitem>Speichern ...</guimenuitem>

source: This command <action>saves the collection</action>. If the file is <emphasis>Untitled</emphasis> then <guimenuitem>Save...</guimenuitem> is equivalent to <guimenuitem>Save As</guimenuitem>. It is only enabled when the collection has been modified.
de: Dieser Befehl <action>speichert eine Sammlung</action>. Ist die Datei bisher noch nicht gespeichert worden und hat daher keinen Namen, entspricht dieser Befehl <guimenuitem>Speichern unter ...</guimenuitem>. Dieser Menüeintrag ist nur aktiviert, wenn die Sammlung geändert wurde.

source: <guimenu>File</guimenu> <guimenuitem>Save As...</guimenuitem>
de: <guimenu>Datei</guimenu> <guimenuitem>Speichern unter ...</guimenuitem>

source: This command <action>saves the collection to a new file</action>.
de: Dieser Befehl <action>speichert die Sammlung</action> unter einem anderen Namen.

source: <shortcut> <keycombo>&Ctrl;<keycap>P</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Print...</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>P</keycap></keycombo></shortcut> <guimenu>Datei</guimenu><guimenuitem>Drucken ...</guimenuitem>

source: This command <action>prints the collection</action>. Printing options may be set in the <interface>Configuration Dialog</interface>.
de: Dieser Befehl <action>druckt eine Sammlung</action>. Die Einstellungen zum Druck können im <interface>Einrichtungsdialog</interface> angepasst werden.

source: <guimenu>File</guimenu> <guimenuitem>Import</guimenuitem>
de: <guimenu>Datei</guimenu> <guimenuitem>Importieren ...</guimenuitem>

source: This command <action>imports data from another file</action>. &appname; can import data from a number of <link linkend="importing">other formats</link>.
de: Dieser Befehl <action>importiert Daten aus einer anderen Datei</action>. &appname; kann Daten aus vielen <link linkend="importing">anderen Formaten</link> importieren.

source: <guimenu>File</guimenu> <guimenuitem>Export</guimenuitem>
de: <guimenu>Datei</guimenu> <guimenuitem>Exportieren ...</guimenuitem>

source: This command <action>exports the collection to another format</action>. &appname; can export data to a number of <link linkend="exporting">other formats</link>.
de: Dieser Befehl <action>exportiert Daten in ein anderes Format</action>. &appname; kann Daten in viele <link linkend="exporting">andere Formate</link> exportieren.

source: <shortcut> <keycombo>&Ctrl;<keycap>Q</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Quit</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo> </shortcut><guimenu>Datei</guimenu><guimenuitem>Beenden</guimenuitem>

source: This command <action>closes the &appname; window</action>. If the collection has unsaved changes, you will be prompted to save them before continuing.
de: <action>Beendet &appname;</action> und schließt das Hauptfenster. Gibt es nicht gespeicherte Änderungen in der Sammlung, können Sie die Änderungen vor dem Beenden speichern oder verwerfen.

source: The <guimenu>Edit</guimenu> Menu
de: Das Menü <guimenu>Bearbeiten</guimenu>

source: <shortcut> <keycombo>&Ctrl;<keycap>Z</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Undo</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>Z</keycap></keycombo></shortcut> <guimenu>Bearbeiten</guimenu> <guimenuitem>Rückgängig</guimenuitem>

source: This command <action>undoes the previous action</action>. Not all actions are supported by Undo.
de: Dieser Befehl <action>macht die vorherige Aktion wieder rückgängig</action>. Diese Funktion ist nicht für alle Aktionen verfügbar.

source: <shortcut> <keycombo>&Ctrl;&Shift;<keycap>Z</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Redo</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>Z</keycap></keycombo></shortcut> <guimenu>Bearbeiten</guimenu> <guimenuitem>Wiederherstellen</guimenuitem>

source: This command <action>reverts a previous Undo</action>.
de: Dieser Befehl <action>stellt eine vorher rückgängig gemachte Aktion wieder her</action>.

source: <shortcut> <keycombo>&Ctrl;<keycap>X</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Cut</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>X</keycap></keycombo></shortcut> <guimenu>Bearbeiten</guimenu> <guimenuitem>Ausschneiden</guimenuitem>

source: This command <action>removes the selected text</action>, if any, and <action>places a copy of the removed text in the clipboard</action>.
de: Dieser Befehl <action>entfernt einen ausgewählten Text</action> und <action>kopiert diesen Text in die Zwischenablage</action>.

source: <shortcut> <keycombo>&Ctrl;<keycap>C</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Copy</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>C</keycap></keycombo> </shortcut> <guimenu>Bearbeiten</guimenu><guimenuitem>Kopieren</guimenuitem>

source: This command <action>copies the selected text</action>, if any, to the clipboard.
de: <action>Kopiert</action> den markierten Text in die Zwischenablage.

source: <shortcut> <keycombo>&Ctrl;<keycap>V</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Paste</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>V</keycap></keycombo> </shortcut> <guimenu>Bearbeiten</guimenu><guimenuitem>Einfügen</guimenuitem>

source: This command <action>pastes the text in the clipboard</action>, if any, into the editor at the cursor position.
de: Dieser Befehl <action>fügt einen Text aus der Zwischenablage</action> an der aktuellen Cursor-Position im Editor ein.

source: <shortcut> <keycombo>&Ctrl;<keycap>A</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Select All</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>A</keycap></keycombo> </shortcut> <guimenu>Bearbeiten</guimenu><guimenuitem>Alles auswählen</guimenuitem>

source: This command <action>selects all the entries</action> in the collection, in the <interface>Column View</interface>.
de: Dieser Befehl <action>wählt alle Einträge</action> einer Sammlung in der <interface>Spaltenansicht</interface> aus.

source: <shortcut> <keycombo>&Ctrl;&Shift;<keycap>A</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Deselect</guimenuitem>
de: <shortcut><keycombo action="simul"> &Ctrl;&Shift;<keycap>A</keycap></keycombo></shortcut><guimenu>Bearbeiten</guimenu> <guimenuitem>Auswahl aufheben</guimenuitem>

source: This command <action>deselects all the entries</action> in the collection.
de: Dieser Befehl <action>hebt die Auswahl der Einträge</action> in der Sammlung wieder auf.

source: <shortcut> <keycombo>&Ctrl;<keycap>I</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Internet Search...</guimenuitem>
de: <shortcut> <keycombo>&Ctrl;<keycap>I</keycap></keycombo> </shortcut> <guimenu>Bearbeiten</guimenu> <guimenuitem>Internet-Suche ...</guimenuitem>

source: This command <action>opens the <interface>Internet Search Dialog</interface></action> to search for and import entries from various Internet sites, including <ulink url="http://amazon.com">Amazon.com</ulink>.
de: Dieser Befehl <action>öffnet den Dialog <interface>Internet-Suche</interface></action>, in dem Sie auf mehreren Internetseiten einschließlich <ulink url="http://amazon.com">Amazon.com</ulink> nach Einträgen suchen und diese importieren können.

source: <shortcut> <keycombo>&Ctrl;<keycap>J</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Advanced Filter...</guimenuitem>
de: <shortcut> <keycombo>&Ctrl;<keycap>J</keycap></keycombo> </shortcut> <guimenu>Bearbeiten</guimenu> <guimenuitem>Erweiterter Filter ...</guimenuitem>

source: This command <action>opens the <interface>Advanced Filter Dialog</interface></action>.
de: Dieser Befehl <action>öffnet den Dialog <interface>Erweiterter Filter</interface></action>.

source: The <guimenu>Collection</guimenu> Menu
de: Das Menü <guimenu>Sammlung</guimenu>

source: <shortcut> <keycombo>&Ctrl;<keycap>N</keycap></keycombo> </shortcut> <guimenu>Collection</guimenu> <guimenuitem>New Entry</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo> </shortcut> <guimenu>Sammlung</guimenu> <guimenuitem>Neuer Eintrag ...</guimenuitem>

source: This command <action>opens the <interface>Entry Editor</interface> to edit a new entry</action>.
de: Dieser Befehl <action>öffnet den <interface>Eintrags-Editor</interface>, um einen neuen Eintrag zu erstellen</action>.

source: <shortcut> <keycombo>&Ctrl;<keycap>E</keycap></keycombo> </shortcut> <guimenu>Collection</guimenu> <guimenuitem>Edit Entry</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>E</keycap></keycombo> </shortcut> <guimenu>Sammlung</guimenu> <guimenuitem>Eintrag bearbeiten ...</guimenuitem>

source: This command <action>opens the <interface>Entry Editor</interface> to edit the selected entries</action>.
de: Dieser Befehl <action>öffnet den <interface>Eintrags-Editor</interface>, um einen ausgewählten Eintrag zu bearbeiten</action>.

source: <shortcut> <keycombo>&Ctrl;<keycap>Y</keycap></keycombo> </shortcut> <guimenu>Collection</guimenu> <guimenuitem>Duplicate Entry</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Y</keycap></keycombo> </shortcut> <guimenu>Sammlung</guimenu> <guimenuitem>Eintrag duplizieren ...</guimenuitem>

source: This command <action>copies, or duplicates, the selected entries</action> as new entries in the collection.
de: Dieser Befehl <action>kopiert oder dupliziert den gewählten Eintrag</action> als neuen Eintrag der Sammlung.

source: <shortcut> <keycombo>&Ctrl;<keycap>D</keycap></keycombo> </shortcut> <guimenu>Collection</guimenu> <guimenuitem>Delete Entry</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>D</keycap></keycombo> </shortcut> <guimenu>Sammlung</guimenu><guimenuitem>Eintrag löschen</guimenuitem>

source: This command <action>deletes the selected entries</action>.
de: Dieser Befehl <action>löscht den ausgewählten Eintrag</action>.

source: <guimenu>Collection</guimenu> <guimenuitem>Merge Entries</guimenuitem>
de: <guimenu>Sammlung</guimenu> <guimenuitem>Einträge zusammenfügen ...</guimenuitem>

source: This command <action>merges the selected entries</action>.
de: Dieser Befehl <action>fügt die ausgewählten Eintrag zusammen</action>.

source: <guimenu>Collection</guimenu> <guimenuitem>Update Entry</guimenuitem>
de: <guimenu>Sammlung</guimenu> <guimenuitem>Einträge aktualisieren</guimenuitem>

source: This menu contains a list of all available data sources, and can be used to automatically query the source and <action>update the selected entries</action>.
de: Dies Menü enthält eine Liste aller verfügbaren Datenquellen. Damit können automatisch Quellen abgefragt und die <action>ausgewählten Einträge aktualisiert werden</action>.

source: <guimenu>Collection</guimenu> <guimenuitem>Check-out</guimenuitem>
de: <guimenu>Sammlung</guimenu> <guimenuitem>Ausleihen ...</guimenuitem>

source: This command <action>opens a dialog box for loaning the selected entries.</action>.
de: Dieser Befehl <action>öffnet einen Dialog für die Ausleihe der ausgewählten Einträge</action>.

source: <guimenu>Collection</guimenu> <guimenuitem>Check-in</guimenuitem>
de: <guimenu>Sammlung</guimenu> <guimenuitem>Zurückgeben ...</guimenuitem>

source: This command <action>checks-in any of the selected entries which are currently on-loan</action>.
de: Dieser Befehl <action>verarbeitet die Rückgabe von ausgewählten Einträgen, die zurzeit ausgeliehen sind</action>.

source: <shortcut> <keycombo>&Ctrl;<keycap>R</keycap></keycombo> </shortcut> <guimenu>Collection</guimenu> <guimenuitem>Rename Collection</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>R</keycap></keycombo> </shortcut> <guimenu>Sammlung</guimenu><guimenuitem>Sammlung umbenennen ...</guimenuitem>

source: This command <action>opens a dialog box for renaming the collection</action>.
de: Dieser Befehl <action>öffnet einen Dialog zum Umbenennen der Sammlung</action>.

source: <shortcut> <keycombo>&Ctrl;<keycap>U</keycap></keycombo> </shortcut> <guimenu>Collection</guimenu> <guimenuitem>Collection Fields...</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>U</keycap></keycombo></shortcut><guimenu>Sammlung</guimenu><guimenuitem>Datenfelder der Sammlung ...</guimenuitem>

source: This command <action>opens the <interface>Collection Fields Dialog</interface></action>.
de: Dieser Befehl <action>öffnet den Dialog <interface>Sammlungsfelder</interface></action>.

source: <guimenu>Collection</guimenu> <guimenuitem>Generate Reports...</guimenuitem>
de: <guimenu>Sammlung</guimenu> <guimenuitem>Berichte erzeugen ...</guimenuitem>

source: This command <action>opens the <interface>Report Dialog</interface></action> for generating reports about the collection.
de: Dieser Befehl <action>öffnet den Dialog <interface>Sammlungsbericht</interface></action>, mit dem Sie Berichte über Ihre Sammlung erstellen können.

source: <guimenu>Collection</guimenu> <guisubmenu>Bibliography</guisubmenu> <guimenuitem>Convert to Bibliography</guimenuitem>
de: <guimenu>Sammlung</guimenu> <guisubmenu>Literaturverzeichnis</guisubmenu> <guimenuitem>In Literaturverzeichnis umwandeln ...</guimenuitem>

source: This command <action>converts a book collection to a bibliography</action> by adding certain fields necessary for Bibtex export, and it is only enabled when a book collection is open.
de: Dieser Befehl <action>wandelt eine Buch-Sammlung in ein Literaturverzeichnis um</action>, indem die notwendigen Felder für den Bibtex-Export hinzugefügt werden. Die Aktion ist nur bei einer geöffneten Buch-Sammlung aktiviert.

source: <guimenu>Collection</guimenu> <guisubmenu>Bibliography</guisubmenu> <guimenuitem>String Macros...</guimenuitem>
de: <guimenu>Sammlung</guimenu> <guisubmenu>Literaturverzeichnis</guisubmenu> <guimenuitem>Zeichenketten-Makros ...</guimenuitem>

source: This command <action>opens a dialog box for editing the Bibtex string macros</action> in the collection. It is only enabled when editing a bibliography.
de: Dieser Befehl <action>öffnet einen Dialog zur Bearbeitung der Bibtex-Zeichenketten-Makros</action> in einer Sammlung. Dieser Menüeintrag ist nur bei der Bearbeitung von Literaturverzeichnissen aktiviert.

source: <guimenu>Collection</guimenu> <guisubmenu>Bibliography</guisubmenu> <guimenuitem>Check for Duplicate Keys</guimenuitem>
de: <guimenu>Sammlung</guimenu> <guisubmenu>Literaturverzeichnis</guisubmenu> <guimenuitem>Nach doppelten Schlüsseln suchen ...</guimenuitem>

source: This command <action>checks for duplicate Bibtex keys</action> and can filter the collection to show the entries with duplicated keys.
de: Dieser Befehl <action>sucht nach doppelten Bibtex-Schlüsseln</action>, filtert alle doppelten Schlüssel in der Sammlung und zeigt sie an.

source: <guimenu>Collection</guimenu> <guisubmenu>Bibliography</guisubmenu> <guimenuitem>Copy Bibtex to Clipboard</guimenuitem>
de: <guimenu>Sammlung</guimenu> <guisubmenu>Literaturverzeichnis</guisubmenu> <guimenuitem>Bibtex in die Zwischenablage kopieren</guimenuitem>

source: This command <action>copies a Bibtex citation</action> to the clipboard so that it can pasted in a LaTeX document.
de: Dieser Befehl <action>kopiert ein Bibtex-Zitat</action> in die Zwischenablage, so dass sie in ein LaTeX-Dokument eingefügt werden kann.

source: <guimenu>Collection</guimenu> <guisubmenu>Bibliography</guisubmenu> <guimenuitem>Cite Entry in Lyx</guimenuitem>
de: <guimenu>Sammlung</guimenu> <guisubmenu>Literaturverzeichnis</guisubmenu> <guimenuitem>Zitat-Eintrag in Lyx</guimenuitem>

source: This command <action>sends a citation for the selected entries</action> to the so-called <emphasis><link linkend="hidden-bibtex-options">lyxpipe</link></emphasis> for use in <application>LyX</application>, <application>Kile</application>, or other LaTeX applications. It is only enabled when editing a bibliography.
de: Dieser Befehl <action>sendet ein Zitat für die ausgewählten Einträge</action> an die sogenannte <emphasis><link linkend="hidden-bibtex-options">lyxpipe</link></emphasis>, um es in <application>LyX</application>, <application>Kile</application>, oder anderen LaTeX-Programmen weiter zu verarbeiten. Dieser Menüeintrag ist nur bei der Bearbeitung von Literaturverzeichnissen aktiviert.

source: The <guimenu>Settings</guimenu> Menu
de: Das Menü <guimenu>Einstellungen</guimenu>

source: <guimenu>Settings</guimenu> <guimenuitem>Toolbars Shown</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guisubmenu>Angezeigte Werkzeugleisten</guisubmenu>

source: This command <action>toggles the display of the toolbars</action>.
de: Dieser Befehl <action>schaltet die Anzeige der Werkzeugleisten an bzw. aus</action>.

source: <guimenu>Settings</guimenu> <guimenuitem>Show Statusbar</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>Statusleiste anzeigen</guimenuitem>

source: This command <action>toggles the display of the statusbar</action>.
de: Dieser Befehl <action>blendet die Statusleiste ein bzw. aus</action>.

source: <guimenu>Settings</guimenu> <guimenuitem>Show Group View</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>Gruppenansicht anzeigen</guimenuitem>

source: This command <action>toggles the display of the <interface>Group View</interface></action>.
de: Dieser Befehl <action>schaltet die Anzeige der <interface>Gruppenansicht</interface> an bzw. aus</action>.

source: <guimenu>Settings</guimenu> <guimenuitem>Show Entry Editor</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>Eintrags-Editor anzeigen</guimenuitem>

source: This command <action>toggles the display of the <interface>Entry Editor</interface></action>.
de: Dieser Befehl <action>schaltet die Anzeige des <interface>Eintrags-Editors</interface> an bzw. aus</action>.

source: <guimenu>Settings</guimenu> <guimenuitem>Show Entry View</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>Eintragsansicht anzeigen</guimenuitem>

source: This command <action>toggles the display of the <interface>Entry View</interface></action>.
de: Dieser Befehl <action>schaltet die Anzeige der <interface>Eintragsansicht</interface> an bzw. aus</action>.

source: <guimenu>Settings</guimenu> <guimenuitem>Group Selection</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>Gruppen-Auswahl</guimenuitem>

source: This command <action>changes the field used to group the entries</action> in the collection.
de: Dieser Befehl <action>ändert das zur Gruppierung der Einträge</action> benutzte Feld in der Sammlung.

source: <guimenu>Settings</guimenu> <guimenuitem>Configure Shortcuts...</guimenuitem>
de: <guimenu>Einstellungen</guimenu><guimenuitem>Kurzbefehle festlegen ...</guimenuitem>

source: This command <action>opens the &kde; <interface>Keyboard Shortcut Configuration Dialog</interface></action>.
de: Dieser Befehl <action>öffnet den &kde;-<interface>Einrichtungsdialog</interface> zum Festlegen der Tastatur-Kurzbefehle</action>.

source: <guimenu>Settings</guimenu> <guimenuitem>Configure Toolbars...</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>Werkzeugleisten einrichten ...</guimenuitem>

source: This command <action>opens the &kde; <interface>Toolbar Configuration Dialog</interface></action>.
de: Dieser Befehl <action>öffnet den &kde;-<interface>Einrichtungsdialog</interface> zur Änderung der Einträge in der Werkzeugleiste</action>.

source: <guimenu>Settings</guimenu> <guimenuitem>Configure &appname;...</guimenuitem>
de: <guimenu>Einstellungen</guimenu> <guimenuitem>&appname; einrichten ...</guimenuitem>

source: This command <action>opens the &appname; <interface>Configuration Dialog</interface></action>.
de: Dieser Befehl <action>öffnet den <interface>Einrichtungsdialog</interface> für &appname;</action>.

source: The <guimenu>Help</guimenu> Menu
de: Das Menü <guimenu>Hilfe</guimenu>

source: These are the &kde; standard items for the <guimenu>Help</guimenu> menu:
de: Die &kde;-Standardeinträge des Menüs <guimenu>Hilfe</guimenu> lauten:

source: Apart from the standard &kde; <guimenu>Help</guimenu> menu items described above &appname; has this additional menu entry:
de: Zusätzlich zu den oben beschriebenen Standardeinträgen des &kde;-Menüs <guimenu>Hilfe</guimenu> gibt es folgende Menüeinträge:

source: <guimenu>Help</guimenu> <guimenuitem>Tip of the Day</guimenuitem>
de: <guimenu>Hilfe</guimenu> <guimenuitem>Tipp des Tages</guimenuitem>

source: This command <action>opens the Tip of the Day dialog</action>. You can page through all the tips by using the buttons on the dialog.
de: Dieser Befehl <action>öffnet den Dialog <interface>Tipp des Tages</interface></action>. Mit den Köpfen im Dialog können Sie alle Tipps durchblättern.
