Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/extragear-office/tellico_importing-exporting.po
Languages: de

source: <application><ulink url="http://icculus.org/referencer/">Referencer</ulink></application> is a document organizer and bibliography manager for the GNOME desktop. &appname; will import most of the data found in a Referencer database.
de: <application><ulink url="http://icculus.org/referencer/">Referencer</ulink></application> ist ein Programm zur Organisation von Dokumenten und Verwaltung von Literaturverzeichnisses für die GNOME-Abeitsplatzumgebung. &appname; kann den größten Teil der Daten aus einer Referencer-Datenbank importieren.

source: Importing RIS Data
de: RIS-Daten importieren

source: The <ulink url="http://www.adeptscience.co.uk/kb/article/A626"><acronym>RIS</acronym> format</ulink> is a bibliographic file format used by <application>Reference Manager</application> and others. &appname; imports RIS files as a Bibliographic collection.
de: Das <ulink url="http://www.adeptscience.co.uk/kb/article/A626"><acronym>RIS</acronym>-Format</ulink> ist ein Format für Literaturverzeichnisse, das von <application>Reference Manager</application> und weiteren Programmen verwendet wird. &appname; importiert RIS-Dateien als Literaturverzeichnisse.

source: Importing Goodreads Collection
de: Goodreads-Sammlung importieren

source: <ulink url="http://www.goodreads.com">Goodreads</ulink> is an online social network for readers to track book collections. &appname; can import the list of books in a user's collection, given either the user name or user ID, as long as the collection is set to be publicly accessible.
de: <ulink url="http://www.goodreads.com">Goodreads</ulink> ist eine soziales Netzwerk von Lesern im Internet mit Informationen über Bücher-Sammlungen. &appname; kann die Liste der Bücher aus der Sammlung eines Benutzers importieren, wenn entweder der Benutzername oder die Benutzerkennung angegeben wurde und die Sammlung allgemein zugänglich ist.

source: Importing File Listings
de: Dateikataloge importieren

source: The best way to create a <link linkend="file-catalog">File Catalog</link> is to import the contents of a folder. The folder may be searched recursively, to add all files found within. This importer is most useful for backup listings and media cataloging, such as &CD; or <acronym>DVD</acronym> listings. In addition, image previews of the file contents may be generated, although it can take some time to read a large number of files. The file previews are same as those shown in the &kde; file manager.
de: Am Besten wird ein <link linkend="file-catalog">Dateikatalog</link> durch Importieren des Inhalts eines Ordners erstellt. Das Verzeichnis kann rekursiv durchsucht werden, um alle darin gefundenen Dateien aufzunehmen. Dieses Importmodul ist gut geeignet, um Dateilisten von Sicherungen oder Medienkataloge mit den Inhalt von &CD;s or <acronym>DVD</acronym>s zu erstellen. Zusätzlich können Vorschaubilder des Dateiinhalts generiert werden, das kann bei einer großen Anzahl von Dateien einige Zeit dauern. Es werden die gleichen Vorschaubilder vom Dateiinhalt wie beim &kde;-Dateiverwaltungsprogramm benutzt.

source: Importing &XML; Data via XSLT
de: &XML;-Daten mit XSLT importieren

source: Any &XML; file may be imported into &appname; provided an &XSL; stylesheet is available to convert the file to &appname; format. &appname; automatically loads the stylesheet and performs the &xslt; processing needed to load the file.
de: Jede beliebige &XML;-Datei kann in &appname; importiert werden, wenn eine &XSL;-Stilvorlage zur Umwandlung der Daten in das &appname;-Format vorhanden ist. &appname; lädt automatisch die Stilvorlage und führt die erforderliche &xslt;-Bearbeitung durch, um die Datei zu laden.

source: Drag and Drop
de: Ziehen und Ablegen (Drag and Drop)

source: Dragging data files to the main &appname; window and dropping them will import the files, just as if the <link linkend="importing">import command</link> was made from the menus. Drag and drop works for the following file formats: Tellico, Bibtex, RIS, and PDF. Importing multiple files at once is also supported.
de: Das Ziehen und Ablegen von Datendateien in das Hauptfenster von &appname; importiert diese Dateien genauso wie mit dem <link linkend="importing">Import-Befehl</link> aus dem Menü. Ziehen und Ablegen funktioniert mit den Dateiformaten Tellico, Bibtex, RIS, und PDF. Auch der Import mehrerer Dateien auf einmal ist möglich.

source: So, for example, if you want to catalog several <link linkend="importing-pdf">PDF files</link>, select them in the file manager and drag them to the &appname; window. &appname; will import as much metadata from the files as it can, and then fetch additional information from various configured Internet sources.
de: Möchten Sie zum Beispiel mehrere <link linkend="importing-pdf">PDF-Dateien</link> in eine Sammlung einfügen, wählen Sie diese Dateien im Dateiverwaltungsprogramm aus und ziehen Sie sie in das Hauptfenster von &appname;. &appname; wird dann möglichst viele Metadaten aus den Dateien importieren und dann zusätzliche Informationen von den eingerichteten Internet-Datenquellen abfragen.

source: Exporting Data
de: Daten exportieren

source: When exporting the data in the collection, the entry values may be exported as entered, or with the <link linkend="field-formatting">automatic formatting</link> provided by &appname;. Additionally, the export may be limited to the currently selected entries of the collection as well, where the <link linkend="status-bar">statusbar</link> shows the number of selected entries.
de: Beim Export von Daten aus einer Sammlung können die Feldwerte in der eingegeben Form als einfacher Text oder mit <link linkend="field-formatting">automatischer Formatierung</link> durch &appname; exportiert werden. Außerdem kann der Export auf die aktuell ausgewählten Einträge der Sammlung beschränkt werden. Die Anzahl der ausgewählten Einträge wird in der <link linkend="status-bar">Statusleiste</link> angezeigt.

source: Exported text files, such as Bibtex or CSV, may use the Unicode (UTF-8) character encoding, or the current locale of the operating system.
de: Exportierte Textdateien wie Bibtex oder CSV sollten das Unicodeformat (UTF-8) oder die aktuelle Kodierungseinstellung des Betriebssystems verwenden.

source: <screeninfo>General Export Options</screeninfo>
de: <screeninfo>Allgemeine Exporteinstellungen</screeninfo>

source: <phrase>General Export Options</phrase>
de: <phrase>Allgemeine Exporteinstellungen</phrase>

source: Exporting &XML;
de: Export als &XML;

source: The file format for &appname; data is a zipped &XML; file. Exporting to &XML; merely creates the &XML; file without zipping it. Images may be included in the &XML; file as base64-encoded data in an image element, but doing so can create very large text files.
de: Das Dateiformat der &appname;-Daten ist eine &XML;-Datei als Zip-Archiv. Beim Export als &XML;-Datei wird daher nur die &XML;-Datei ohne Zip-Komprimierung exportiert. Bilder können in der &XML;-Datei als base64-kodierte Daten in einem Element „image“ eingefügt werden, das erzeugt aber sehr große Textdateien.

source: Exporting Zip
de: Export als Zip-Archiv

source: The standard file format for &appname; is a zipped file, contained the &XML; collection file, and optionally, all the images referenced in the collection. If the images are being stored in the application folder instead, exporting to a Zip file will create a self-contained data file, which includes all the images in the collection.
de: Das Standardformat der &appname;-Dateien ist ein Zip-Archiv. Es enthält die Sammlungsdaten im &XML;-Format und gegebenenfalls die in der Sammlung verwendeten Bilder. Sind die Bilder dagegen im Programmordner gespeichert, wird beim Export als Zip-Archiv eine eigenständige Datendatei erzeugt, die alle Bilder in der Sammlung enthält.

source: Exporting &HTML;
de: Export als &HTML;

source: The &HTML; export uses the <filename>tellico2html.xsl</filename> stylesheet. Images are exported to a folder with the same name as the exported &HTML; file with <emphasis><filename>_files</filename></emphasis> appended.
de: Beim &HTML;-Export wird die Stilvorlage <filename>tellico2html.xsl</filename> benutzt. Bilder werden in einen Ordner mit dem gleichen Namen wie die exportierte &HTML;-Datei gespeichert, dabei wird den Bilddateien die Dateierweiterung <emphasis><filename>_files</filename></emphasis> angehängt.

source: The default format is similar to the printed output, and allows various options for modifying the &HTML;. Field headers may be printed at the top of each column, but unfortunately, &kde; does not yet allow the table headers to be repeated on each page. The entries may be grouped as in the <interface>Group View</interface>, as well.
de: Das Standardformat ähnelt der Druckausgabe und erlaubt viele Einstellungen, um die &HTML;-Ausgabe zu verändern. Feldbeschriftungen können über jeder Spalte ausgegeben werden. Leider ist es mit &kde; noch nicht möglich, die Vorspannzeilen einer Tabelle auf jeder Seite wieder zu drucken. Die Einträge können auch wie in der <interface>Gruppenansicht</interface> zusammengefasst werden.

source: Additionally, individual files may be created for each entry in the collection, with links created in the top-level &HTML; file. The entry files will be created in the same folder as the images. The entry &HTML; files will use the current stylesheet template, as shown in the <interface>Entry View</interface>.
de: Zusätzlich können für jeden Eintrag in der Sammlung einzelne Dateien mit Verknüpfungen in der &HTML;-Datei der obersten Ebene erzeugt werden. Die Dateien für die Einträge werden in denselben Ordner wie die Bilder gespeichert. Die &HTML;-Dateien der Einträge benutzen die aktuelle Stilvorlage wie in der <interface>Eintragsansicht</interface>.

source: <screeninfo>&HTML; Export Options</screeninfo>
de: <screeninfo>&HTML;-Exporteinstellungen</screeninfo>

source: <phrase>&HTML; Export Options</phrase>
de: <phrase>&HTML;-Exporteinstellungen</phrase>

source: Exporting CSV
de: Export als CSV

source: Comma-separated values (CSV) are a common way of importing and exporting tabular data. Each field value is separated by a comma, with one entry per line. The field titles may be included as headers in the first line. Any character or string other than a comma may also be used to delimit the fields.
de: Durch Kommata getrennte Werte (<acronym>CSV</acronym>) sind ein häufig genutztes Verfahren, um Daten in Tabellenform zu im- oder exportieren. Jeder Feldwert wird durch ein Komma getrennt und jede Zeile enthält einen Eintrag. Die Kopfzeilen der Felder können in der ersten Zeile enthalten sein. Es können Zeichen oder Zeichenketten zusätzlich zum Komma als Trennung der Feldwerte benutzt werden.

source: <screeninfo>CSV Export Options</screeninfo>
de: <screeninfo>CSV-Exporteinstellungen</screeninfo>

source: <phrase>CSV Export Options</phrase>
de: <phrase>CSV-Exporteinstellungen</phrase>

source: Exporting Pilot-DB
de: Export als Pilot-DB

source: <ulink url="http://pilot-db.sourceforge.net">Pilot-DB</ulink> is a database format for &PalmOS;. Various desktop applications can read and write Pilot-DB files. Exported <literal role="extension">.pdb</literal> files can be transferred to a PDA, and used directly. At the moment, &appname; is not able to import Pilot-DB files.
de: <ulink url="http://pilot-db.sourceforge.net">Pilot-DB</ulink> ist ein Datenbankformat für &PalmOS;. Verschiedene Rechner-Programme können Pilot-DB-Dateien lesen und schreiben. Exportierte <literal role="extension">.pdb</literal>-Dateien lassen sich auf einen PDA übertragen. Zurzeit kann &appname; keine Pilot-DB-Dateien importieren.

source: <screeninfo>Pilot-DB Export Options</screeninfo>
de: <screeninfo>Pilot-DB-Exporteinstellungen</screeninfo>

source: <phrase>Pilot-DB Export Options</phrase>
de: <phrase>Pilot-DB-Exporteinstellungen</phrase>

source: Exporting Alexandria
de: Export als Alexandria-Daten

source: <application><ulink url="http://alexandria.rubyforge.net">Alexandria</ulink></application> is a book collection manager for the <ulink url="http://www.gnome.org">GNOME</ulink> desktop environment. &appname; is able to export a limited subset of book collection fields to the default Alexandria data location.
de: <application><ulink url="http://alexandria.rubyforge.org">Alexandria</ulink></application> ist eine Sammlungsverwaltung für Bücher für die <ulink url="http://www.gnome.org">GNOME</ulink>-Arbeitsumgebung. &appname; kann eine begrenzte Teilmenge der Felder in der Bücher-Sammlung in den Standarddatenordner von Alexandria exportieren.

source: Exporting ONIX
de: Export als ONIX

source: <ulink url="http://www.editeur.org/onix.html">ONIX</ulink> is an &XML; format for representing and communicating book industry product information, primarily for book vendors. &appname; can export book collections using a small subset of ONIX.
de: <ulink url="http://www.editeur.org/onix.html">ONIX</ulink> ist ein &XML;-Format zur Darstellung und Verbreitung von Produktinformationen aus der Buchherstellung und wird hauptsächlich von Buchverlegern benutzt. &appname; kann eine Bücher-Sammlung mit Hilfe einer begrenzten Untermenge der ONIX-Informationen exportieren.

source: Exporting Bibtex
de: Export als Bibtex

source: When exporting to <ulink url="http://en.wikipedia.org/wiki/Bibtex">Bibtex</ulink>, the field values may be escaped with braces or quotation marks. If any string macros are used in the collection, they may optionally be exported as macros or expanded. For &URL; fields, &appname; may enclose the field values with the <literal>\url{...}</literal> tag. Finally, entries with no citation key may be skipped rather than have &appname; auto-generate the key.
de: Beim Export als <ulink url="http://en.wikipedia.org/wiki/Bibtex">Bibtex</ulink> können die Feldwerte durch Klammern oder Anführungszeichen maskiert werden. Werden in der Sammlung Zeichenketten-Makros benutzt, können sie entweder als Makros oder in expandierter Form exportiert werden. Die Werte der &URL;-Felder können in <literal>\url{...}</literal> eingeschlossen werden. Schließlich können Einträge ohne Zitatschlüssel übersprungen werden, so dass &appname; keine automatisch generierten Schlüssel verwenden muss.

source: <screeninfo>Bibtex Export Options</screeninfo>
de: <screeninfo>Bibtex-Exporteinstellungen</screeninfo>

source: <phrase>Bibtex Export Options</phrase>
de: <phrase>Bibtex-Exporteinstellungen</phrase>

source: Exporting Bibtexml
de: Export als Bibtexml

source: <ulink url="http://bibtexml.sourceforge.net">Bibtexml</ulink> is a format for expressing bibtex data via &XML;.
de: <ulink url="http://bibtexml.sourceforge.net">Bibtexml</ulink> ist ein Format von Bibtex-Daten als &XML;-Datei.

source: Exporting GCstar
de: GCstar exportieren

source: <application><ulink url="http://www.gcstar.org">GCstar</ulink></application> is another movie collection manager. &appname; is able to export most collection types to a GCstar data file.
de: <application><ulink url="http://www.gcstar.org">GCstar</ulink></application> ist eine weitere Sammlungsverwaltung für Filme. &appname; kann die meisten Sammlungsarten in eine GCstar-Datei exportieren.

source: Exporting &XML; via &xslt;
de: Export als &XML; mit &xslt;

source: Finally, &appname; is able to process its internal &XML; representation of the collection data through an external &XSL; stylesheet before exporting. This type of export may be useful for generating text reports or other file types.
de: Schließlich kann &appname; for dem Export auch noch die interne &XML;-Darstellung der Sammlungsdaten mit Hilfe einer externen &XSL;-Stilvorlage verarbeiten. Diese Art des Exports kann hilfreich für die Generierung von Textberichten und anderen Dateiarten sein.

source: Working With Citations
de: Arbeiten mit Zitaten

source: When working with a <link linkend="bibliography">bibliography</link>, citations for the currently selected entries may be generated and used in various other applications. A citation in bibtex format can be copied to the clipboard, and then pasted in a latex file. Bibtex citations can also be pushed to an external application such as <application>LyX</application> or <application>Kile</application> using the so-called <emphasis><link linkend="hidden-bibtex-options">lyxpipe</link></emphasis>.
de: Mit einem <link linkend="bibliography">Literaturverzeichnis</link> können Zitate der aktuell ausgewählten Einträge generiert und in verschieden anderen Programmen weiter verwendet werden. Ein Zitat im Bibtex-Format kann in die Zwischenablage kopiert und dann in eine LaTeX-Datei eingefügt werden. Bibtex-Zitate lassen sich mit der sogenannten <emphasis><link linkend="hidden-bibtex-options">lyxpipe</link></emphasis> an externe Programme wie <application>LyX</application> oder <application>Kile</application> übergeben.
