Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/baloo/baloo_file.po
Languages: de

# NAME OF TRANSLATORS
source: Your names
de: Ihre Namen

# EMAIL OF TRANSLATORS
source: Your emails
de: Ihre Emailadressen

# @info:status
source: File indexer is suspended.
de: Dateiindexer ist ausgesetzt.

# @info:status
source: Indexing files for desktop search.
de: Idiziere Dateien für Desktopsuche.

# @info:status
source: Scanning for recent changes in files for desktop search
de: Suche nach kürzlichen Änderungen in Dateien für die Desktopsuche

# @info:status
source: File indexer is idle.
de: Dateiindex ist nicht beschäftigt.

source: An application to handle file metadata
de: Eine Anwedung um Dateimetadaten zu benutzen

# @title
source: New removable device detected
de: Neunes entfernbares Geräte gefunden

# @info
source: Do you want files on removable device <resource>%1</resource> to be indexed for fast desktop searches?
de: Wollen sie die Datein auf dem entfernbaren Geräte <resource>%1</resource> für die Desktopsuche indizieren?

# @action
source: Index files
de: Idizeire Dateien

# @action
source: Ignore device
de: Gerät ignorieren

# @action
source: Configure
de: Einstellungen
