Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/kdegraphics/desktop_kdegraphics_okular.po
Languages: de

# Name
source: Reader
de: Lesegerät

# GenericName
source: Document viewer
de: Dokumentenbetrachter

# Comment
source: Viewer for various types of documents
de: Betrachter für verschiedene Arten von Dokumenten

# Name
source: Document viewer
de: Dokumentenbetrachter

# Comment
source: File format backend for Okular
de: Dateiformat-Modul für Okular

# Description
source: A kioslave for displaying WinHelp files
de: Ein-/Ausgabemodul zur Anzeige von Windows-Hilfe-Dateien

# Comment
source: Windows HTMLHelp backend for Okular
de: Anzeigemodul für Windows-Hilfe-Dateien in Okular

# GenericName
source: Document Viewer
de: Dokumentenbetrachter

# Comment
source: Comic book backend for Okular
de: Anzeigemodul für Comic-Book in Okular

# Comment
source: DjVu backend for Okular
de: Anzeigemodul für DjVu in Okular

# Comment
source: DVI backend for Okular
de: Anzeigemodul für DVI in Okular

# Name
source: EPub document
de: EPUB-Dokument

# Comment
source: EPub backend for Okular
de: Anzeigemodul für EPUB in Okular

# Name
source: Fax documents
de: Fax-Dokumente

# Comment
source: G3/G4 Fax backend for Okular
de: Anzeigemodul für G3/G4 Faxe in Okular

# Name
source: FictionBook document
de: FictionBook-Dokument

# Comment
source: FictionBook backend for Okular
de: Anzeigemodul für FictionBook in Okular

# Name
source: KDE Image libraries
de: KDE-Bilder-Bibliotheken

# Comment
source: Image backend for Okular
de: Anzeigemodul für Bilder in Okular

# Name
source: Mobipocket document
de: Mobipocket-Dokument

# Comment
source: Mobipocket backend for Okular
de: Ein Anzeigemodul für Mobipocket-Dateien in Okular

# Comment
source: OpenDocument backend for Okular
de: Anzeigemodul für OpenDocument in Okular

# Name
source: Plucker document
de: Plucker-Dokument

# Comment
source: Plucker backend for Okular
de: Anzeigemodul für Plucker in Okular

# Comment
source: PDF backend for Okular using poppler
de: Anzeigemodul für PDF (mittels Poppler) in Okular

# Comment
source: Ghostscript PS/PDF backend for Okular
de: Anzeigemodul für Ghostscript PS/PDF in Okular

# Name
source: Okular TIFF Library
de: TIFF-Bibliothek für Okular

# Comment
source: TIFF backend for Okular
de: Anzeigemodul für TIFF in Okular

# X-KDE-Keywords
source: txt
de: Text

# Name
source: txt
de: Text

# Comment
source: Txt backend for Okular
de: Anzeigemodul für Text in Okular

# Name
source: Okular XPS Plugin
de: XPS-Modul für Okular

# Comment
source: XPS backend for Okular
de: Anzeigemodul für XPS in Okular
