Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/kdegraphics/kipiplugin_kxmlhelloworld.po
Languages: de

source: &Image
de: B&ild

source: &Tools
de: E&xtras

source: I&mport
de: I&mportieren

source: &Export
de: &Exportieren

source: Main Toolbar
de: Haupt-Werkzeugleiste

source: KXML Hello World Image...
de: KXML-„Hallo-Welt“-Bild ...

source: KXML Hello World Tools...
de: KXML-„Hallo-Welt“-Modul ...

source: KXML Hello World Export...
de: KXML-„Hallo-Welt“-Export ...

source: KXML Hello World Import...
de: KXML-„Hallo-Welt“-Import ...

source: This is the list of selected items
de: Dies ist die Liste der gewählten Elemente

source: This is the list of selected albums
de: Dies ist die Liste der ausgewählten Alben
