Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/kdegraphics/ksnapshot.po
Languages: de

# NAME OF TRANSLATORS
source: Your names
de: Stefan Winter,Thomas Reitelbach

# EMAIL OF TRANSLATORS
source: Your emails
de: kickdown@online.de,tr@erdfunkstelle.de

source: Select a region using the mouse. To take the snapshot, press the Enter key or double click. Press Esc to quit.
de: Wählen Sie mit der Maus einen Bereich aus. Um das Bildschirmfoto aufzunehmen, drücken Sie die Eingabetaste oder tätigen einen Doppelklick, zum Abbrechen drücken Sie Escape.

source: snapshot
de: Bildschirmfoto

source: KDE Background Screenshot Utility
de: KDE-Dienstprogramm für Hintergrund-Bildschirmfotos

source: (c) 2007, Montel Laurent
de: © 2007, Montel Laurent

# %1 is collection name, %2 is image count in collection
source: %1 (%2 image)
de: %1 (%2 Bild)

source: untitled
de: unbenannt

source: Copy
de: Kopieren

source: Send To...
de: Senden an ...

source: second
de: Sekunde

source: Quick Save Snapshot &As...
de: Schnellspeichern &unter ...

source: Save the snapshot to the file specified by the user without showing the file dialog.
de: Speichert das Bildschirmfoto ohne Aufruf des Dialogs in die angegebene Datei.

source: Save Snapshot &As...
de: Bildschirmfoto speichern &unter ...

source: Save the snapshot to the file specified by the user.
de: Das Bildschirmfoto wird unter dem angegebenen Namen gespeichert.

source: Save As
de: Speichern unter

source: Other Application...
de: Andere Anwendung ...

source: The screen has been successfully grabbed.
de: Der Bildschirm ist erfolgreich fotografiert worden.

source: Preview of the snapshot image (%1 x %2)
de: Vorschau des Bildschirmfotos (%1 × %2)

source: Captures the window under the mouse on startup (instead of the desktop)
de: Fotografiert beim Start nur das Fenster unter dem Mauszeiger (anstelle der ganzen Arbeitsfläche)

source: Captures the desktop
de: Fotografiert die Arbeitsfläche

source: Captures a region
de: Fotografiert einen Bereich

source: Captures a free region (not rectangular)
de: Fotografiert einen beliebigen Bereich (nicht rechteckig)

source: Captures a part of windows
de: Fotografiert einen Bereich in einem Fenster

source: File Exists
de: Die Datei existiert bereits

source: <qt>Do you really want to overwrite <b>%1</b>?</qt>
de: <qt>Möchten Sie <b>%1</b> wirklich überschreiben?</qt>

source: Overwrite
de: Überschreiben

source: Unable to Save Image
de: Das Bild kann nicht gespeichert werden

source: KSnapshot was unable to save the image to %1.
de: KSnapshot kann das Bild nicht unter dem Namen %1 speichern.

source: Title
de: Titel

source: Window Class
de: Fensterklasse

source: This is a preview of the current snapshot. The image can be dragged to another application or document to copy the full screenshot there. Try it with the file manager. You can also copy the image to the clipboard by pressing Ctrl+C.
de: Dies ist eine Vorschau des aktuellen Bildschirmfotos. Das Bild kann mit der Maus in eine andere Anwendung oder ein anderes Dokument gezogen werden. Dabei wird das Bildschirmfoto in voller Größe kopiert. Versuchen Sie es doch mal, zum Beispiel mit dem Dateiverwaltungsprogramm! Sie können das Bild auch mit Strg+C in die Zwischenablage kopieren.

source: Click this button to take a new snapshot.
de: Klicken Sie auf diesen Knopf, um ein neues Bildschirmfoto zu erstellen.

source: Take a &New Snapshot
de: &Neues Bildschirmfoto

source: Cap&ture mode:
de: &Bildschirmfoto-Modus:

source: <qt>Using this menu, you can select from the six following snapshot modes: <p> <b>Full Screen</b> - captures the entire desktop.<br/> <b>Window Under Cursor</b> - captures only the window (or menu) that is under the mouse cursor when the snapshot is taken.<br/> <b>Rectangular Region</b> - captures only the rectangular region of the desktop that you specify. When taking a new snapshot in this mode you will be able to select any area of the screen by clicking and dragging the mouse.<br/> <b>Freehand Region</b> - captures arbitrary shapes that you specify. When taking a new snapshot in this mode you will be able to select any shape by dragging the mouse.<br/> <b>Section of Window</b> - captures only a section of the window. When taking a new snapshot in this mode you will be able to select any child window by moving the mouse over it.<br/> <b>Current Screen</b> - if you have multiple screens, this captures the screen containing the mouse cursor when the snapshot is taken. </p></qt>
de: <qt>Mit diesem Menü können Sie zwischen den sechs folgenden Modi für Bildschirmfotos auswählen: <p> <b>Vollbild</b> – fotografiert die gesamte Arbeitsfläche.<br/> <b>Fenster unter dem Mauszeiger</b> – fotografiert nur das Fenster (oder Menü), das sich unter dem Mauszeiger befindet.<br/> <b>Rechteckiger Bereich</b> – fotografiert nur den ausgewählten Bereich der Arbeitsfläche. Wenn Sie in diesem Modus ein neues Bildschirmfoto erstellen, können Sie durch Anklicken und Ziehen mit der Maus einen rechteckigen Bereich auf der Arbeitsfläche auswählen.<br/> <b>Freihandbereich</b> - fotografiert beliebige Formen, die Sie angeben. Wenn Sie in diesem Modus ein neues Bildschirmfoto erstellen, können Sie beliebige Formen zeichnen, indem Sie die Maus ziehen.<br/> <b>Bereich in einem Fenster</b> – fotografiert einen bestimmten Bereich innerhalb eines Fenster. Wenn Sie diesen Modus für einen Schnappschuss verwenden, können Sie jeden beliebigen Teilbereich eines Fensters auswählen, indem Sie die Maus darüber bewegen.<br/> <b>Aktueller Bildschirm</b> – fotografiert bei mehreren Bildschirmen den Bildschirm, auf dem sich der Mauszeiger befindet, </p></qt>

source: Full Screen
de: Vollbild

source: Window Under Cursor
de: Fenster unter dem Mauszeiger

source: Rectangular Region
de: Rechteckiger Bereich

source: Freehand Region
de: Beliebiger Bereich

source: Section of Window
de: Bereich in einem Fenster

source: Current Screen
de: Aktueller Bildschirm

source: Snapshot &delay:
de: &Verzögerung für Bildschirmfoto:

source: Snapshot delay in seconds
de: Verzögerung für das Bildschirmfoto in Sekunden

source: <qt><p> This is the number of seconds to wait after clicking the <i>New Snapshot</i> button before taking the snapshot. </p><p> This is very useful for getting windows, menus and other items on the screen set up just the way you want. </p><p> If <i>no delay</i> is set, the program will wait for a mouse click before taking a snapshot. </p> </qt>
de: <qt><p> Hier können Sie einstellen, wieviele Sekunden nach dem Betätigen des Knopfes <i>Neues Bildschirmfoto</i> vergehen sollen, bis das Bild aufgenommen wird. </p><p> Diese Funktion ist nützlich, wenn Sie zum Beispiel Menüs oder einen Dialog öffnen möchten, bevor das Foto gemacht wird. </p><p> Ist <i>keine Verzögerung</i> angegeben, wird das Foto direkt beim nächsten Mausklick aufgenommen. </p> </qt>

source: No delay
de: Keine Verzögerung

source: Include &window decorations:
de: &Fensterdekoration einbeziehen:

source: When enabled, snapshot of a window will also include the window decorations
de: Wenn diese Einstellung aktiviert ist, wird bei einem Bildschirmfoto des Fensters auch die Fensterdekoration einbezogen.

source: Include mouse &pointer:
de: &Mauszeiger einbeziehen:

source: KDE Screenshot Utility
de: KDE-Dienstprogramm für Bildschirmfotos

source: (c) 1997-2008, Richard J. Moore, (c) 2000, Matthias Ettrich, (c) 2002-2003 Aaron J. Seigo
de: © 1997–2008, Richard J. Moore, © 2000, Matthias Ettrich, © 2002–2003 Aaron J. Seigo

source: Region Grabbing Reworked GUI
de: Bereichauswahl Überarbeitete Benutzeroberfläche

source: "Open With" function
de: „Öffnen mit“-Funktion

source: Free region grabbing, KIPI plugins support, port to Windows
de: Auswahl eines beliebigen Bereichs, Unterstützung für KIPI-Module, Portierung auf Windows

source: Snapshot will be taken in 1 second
de: Bildschirmfoto wird in einer Sekunden erstellt
