Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/kdegraphics/libkdcraw.po
Languages: de

# @option:check
source: 16 bits color depth
de: 16-Bit Farbtiefe

# @info:whatsthis
source: <para>If enabled, all RAW files will be decoded in 16-bit color depth using a linear gamma curve. To prevent dark picture rendering in the editor, it is recommended to use Color Management in this mode.</para><para>If disabled, all RAW files will be decoded in 8-bit color depth with a BT.709 gamma curve and a 99th-percentile white point. This mode is faster than 16-bit decoding.</para>
de: <para>Wenn die Option aktiviert wird, werden alle Rohdateien mit 16-Bit Farbtiefe unter Benutzung einer linearen Gammakurve dekodiert. Um das Berechnen eines Schwarzbildes zu verhindern empfehlen wir, die Farbverwaltung in diesem Modus zu benutzen.</para><para>Wenn die Option deaktiviert ist, werden alle Rohdateien mit 8-Bit Farbtiefe unter Benutzung einer BT.709-Gammakurve und einem 99 %-Weißpunkt dekodiert. Dieser Modus ist schneller als eine 16-Bit-Dekodierung.</para>

# @option:check
source: Interpolate RGB as four colors
de: RGB als vier Farben interpolieren

# @info:whatsthis
source: <title>Interpolate RGB as four colors</title><para>The default is to assume that all green pixels are the same. If even-row green pixels are more sensitive to ultraviolet light than odd-row this difference causes a mesh pattern in the output; using this option solves this problem with minimal loss of detail.</para><para>To resume, this option blurs the image a little, but it eliminates false 2x2 mesh patterns with VNG quality method or mazes with AHD quality method.</para>
de: <title>Interpoliert RGB als vier Farben.</title><para>Die Voreinstellung ist es, anzunehmen, dass alle grünen Pixel identisch sind. Da eine ebenmäßige Reihe von grünen Pixeln empfindlicher auf ultraviolettes Licht reagiert als eine nicht ebenmäßige, wird normalerweise durch diesen Unterschied ein Netzmuster erzeugt. Diese Option löst dieses Problem mit einem minimalen Verlust von Details.</para><para>Zur Fortsetzung verschmiert diese Option das Bild ein bisschen. Aber es verhindert fehlerhafte 2×2-Gitter mit der VNG-Qualitätsmethode oder der AHD-Qualitätsmethode.</para>

# @info:tooltip
source: Visit LibRaw project website
de: Webseite des LibRaw-Projektes besuchen

# @option:check
source: Do not stretch or rotate pixels
de: Pixel nicht dehnen oder drehen

# @info:whatsthis
source: <title>Do not stretch or rotate pixels</title><para>For Fuji Super CCD cameras, show the image tilted 45 degrees. For cameras with non-square pixels, do not stretch the image to its correct aspect ratio. In any case, this option guarantees that each output pixel corresponds to one RAW pixel.</para>
de: <title>Pixel nicht dehnen oder drehen</title><para>Zeigt das Bild um 45 Grad gekippt für Fuji-Super-CCD-Kameras. Für Kameras mit nicht quadratischen Pixeln wird das Bild nicht auf das richtige Seitenverhältnis gedehnt. Diese Option sorgt also in allen Fällen dafür, dass jeder Ausgabepixel genau einem Rohpixel entspricht.</para>

# @label:listbox
source: Quality:
de: Qualität:

# @info:whatsthis
source: <title>Quality (interpolation)</title><para>Select here the demosaicing method to use when decoding RAW images. A demosaicing algorithm is a digital image process used to interpolate a complete image from the partial raw data received from the color-filtered image sensor, internal to many digital cameras, in form of a matrix of colored pixels. Also known as CFA interpolation or color reconstruction, another common spelling is demosaicing. The following methods are available for demosaicing RAW images:</para><para><list><item><emphasis strong='true'>Bilinear</emphasis>: use high-speed but low-quality bilinear interpolation (default - for slow computers). In this method, the red value of a non-red pixel is computed as the average of the adjacent red pixels, and similarly for blue and green.</item><item><emphasis strong='true'>VNG</emphasis>: use Variable Number of Gradients interpolation. This method computes gradients near the pixel of interest and uses the lower gradients (representing smoother and more similar parts of the image) to make an estimate.</item><item><emphasis strong='true'>PPG</emphasis>: use Patterned-Pixel-Grouping interpolation. Pixel Grouping uses assumptions about natural scenery in making estimates. It has fewer color artifacts on natural images than the Variable Number of Gradients method.</item><item><emphasis strong='true'>AHD</emphasis>: use Adaptive Homogeneity-Directed interpolation. This method selects the direction of interpolation so as to maximize a homogeneity metric, thus typically minimizing color artifacts.</item><item><emphasis strong='true'>DCB</emphasis>: DCB interpolation from linuxphoto.org project.</item><item><emphasis strong='true'>AHD v2</emphasis>: modified AHD interpolation using Variance of Color Differences method.</item><item><emphasis strong='true'>AFD</emphasis>: Adaptive Filtered Demosaicing interpolation through 5 pass median filter from PerfectRaw project.</item><item><emphasis strong='true'>VCD</emphasis>: Variance of Color Differences interpolation.</item><item><emphasis strong='true'>VCD & AHD</emphasis>: Mixed demosaicing between VCD and AHD.</item><item><emphasis strong='true'>LMMSE</emphasis>: color demosaicing via directional linear minimum mean-square error estimation interpolation from PerfectRaw.</item><item><emphasis strong='true'>AMaZE</emphasis>: Aliasing Minimization interpolation and Zipper Elimination to apply color aberration removal from RawTherapee project.</item></list></para><para>Note: some methods can be unavailable if RAW decoder have been built without extension packs.</para>
de: <title>Qualität (Interpolation)</title><para>Wählen Sie hier die Interpolationsmethode zum Demosaicing der Rohbilder. Ein Demosaicing-Algorithmus ist der digitale Prozess der benutzt wird, um ein komplettes Bild aus den Rohdaten des farbgefilterten Bildsensors zu interpolieren. Dieser Sensor ist in vielen Digitalkameras in Form einer Matrix von farbigen Pixeln enthalten. Demosaicing ist auch bekannt als CFA-Interpolation, Farbfiltermatrix oder Farbrekonstruktion. Es gibt vier Methoden zur Farbrekonstruktion von Rohbildern:</para><para><list><item><emphasis strong='true'>Bilinear</emphasis>: benutzt eine sehr schnelle bilineare Interpolation, die eine schlechte Qualität erzeugt. Diese Methode ist der Standard für langsame Rechner. In der Methode wird der Rotwert eines nicht-roten Pixel als Durchschnitt der benachbarten roten Pixel berechnet. Analog wird für den Blau- und Grünwert verfahren.</item><item><emphasis strong='true'>VNG</emphasis>: benutzt zur Interpolation eine variable Nummer von Gradienten. Diese Methode berechnet Gradienten neben dem interessanten Pixel und benutzt die niedrigen Gradienten, die glattere und ähnlichere Teile des Bildes repräsentieren, um eine Schätzung für den Pixel zu machen. </item><item><emphasis strong='true'>PPG</emphasis>: benutzt Patterned Pixel Grouping zur Interpolation. Pixelgruppierungen gehen von Annahmen über natürliche Szenen bei ihren Schätzungen aus. Es erzeugt daher weniger Farbartefakte bei natürlichen Bildern als die VNG-Methode.</item><item><emphasis strong='true'>AHD</emphasis>: benutzt eine adaptive homogenitätsgerichtete Interpolation. Diese Methode wählt die Richtung der Interpolation, sodass eine Homogenitätsmetrik maximiert wird. Das minimiert typischerweise Farbartefakte. </item><item><emphasis strong='true'>DCB</emphasis>: DCB-Interpolation vom linuxphoto.org-Projekt.</item><item><emphasis strong='true'>AHD v2</emphasis>: modifizierte AHD-Interpolation durch Verwendung der Farbvarianz-Differenzen-Methode.</item><item><emphasis strong='true'>AFD</emphasis>: Adaptive-Filtered-Demosaicing-Interpolation durch 5-Pass-Median-Filter des PerfectRaw-Projekts.</item><item><emphasis strong='true'>VCD</emphasis>: Farbvarian-Differenzen-Interpolation („Variance of Color Differences“).</item><item><emphasis strong='true'>VCD & AHD</emphasis>: Gemischtes Demosaicing von VCD und AHD.</item><item><emphasis strong='true'>LMMSE</emphasis>: Farb-Demosaicing durch Interpolation der direktionale, lineare Minimum-Schätzung der mittlere Quadrate Fehler von PerfectRaw.</item><item><emphasis strong='true'>AMaZE</emphasis>: „Aliasing Minimization interpolation and Zipper Elimination“ zur Anwendung der Farb-Aberrations-Entfernung von RawTherapee project.</item></list></para><para>Hinweis: Einige Methoden sind nicht verfügbar, wenn der RAW-Dekoder ohne Erweiterungspakete erstellt worden ist.</para>

# @info:whatsthis
source: <title>Pass</title><para>Set here the passes used by the median filter applied after interpolation to Red-Green and Blue-Green channels.</para><para>This setting is only available for specific Quality options: <emphasis strong='true'>Bilinear</emphasis>, <emphasis strong='true'>VNG</emphasis>, <emphasis strong='true'>PPG</emphasis>, <emphasis strong='true'>AHD</emphasis>, <emphasis strong='true'>DCB</emphasis>, and <emphasis strong='true'>VCD & AHD</emphasis>.</para>
de: <title>Pass</title><para>Setzen Sie hier den Pass zur Nutzung vom Median-Filter nach der Interpolation der Rot-Grün- und Blau-Grün-Kanäle.</para><para>Diese Einstellung ist nur bei einigen gewählten Qualitäten verfügbar:<emphasis strong='true'>Bilinear</emphasis>, <emphasis strong='true'>VNG</emphasis>, <emphasis strong='true'>PPG</emphasis>, <emphasis strong='true'>AHD</emphasis>, <emphasis strong='true'>DCB</emphasis>, and <emphasis strong='true'>VCD & AHD</emphasis>.</para>

# @option:check
source: Refine interpolation
de: Interpolation verbessern:

# @info:whatsthis
source: <title>Refine interpolation</title><para>This setting is available only for few Quality options:</para><para><list><item><emphasis strong='true'>DCB</emphasis>: turn on the enhance interpolated colors filter.</item><item><emphasis strong='true'>VCD & AHD</emphasis>: turn on the enhanced effective color interpolation (EECI) refine to improve sharpness.</item></list></para>
de: <title>Interpolation verbessern</title><para>Diese Einstellung ist nur für einige Qualitätseinstellungen verfügbar:</para><para><list><item><emphasis strong='true'>DCB</emphasis>: aktiviert den erweiterten Farb-Interpolations-Filter.</item><item><emphasis strong='true'>VCD & AHD</emphasis>: aktiviert die erweiterte effektive Farb-Interpolation (EECI), um die Schärfe zu verbessern.</item></list></para>

# @label
source: Demosaicing
de: Mosaikmuster entfernen

# @label:listbox
source: Method:
de: Methode:

# @item:inlistbox
source: Default D65
de: Standard-D65

# @item:inlistbox
source: Camera
de: Kamera

# @item:inlistbox set while balance automatically
source: Automatic
de: Automatisch

# @item:inlistbox set white balance manually
source: Manual
de: Manuell

# @info:whatsthis
source: <title>White Balance</title><para>Configure the raw white balance:</para><para><list><item><emphasis strong='true'>Default D65</emphasis>: Use a standard daylight D65 white balance.</item><item><emphasis strong='true'>Camera</emphasis>: Use the white balance specified by the camera. If not available, reverts to default neutral white balance.</item><item><emphasis strong='true'>Automatic</emphasis>: Calculates an automatic white balance averaging the entire image.</item><item><emphasis strong='true'>Manual</emphasis>: Set a custom temperature and green level values.</item></list></para>
de: <title>Weißabgleich</title><para>Konfiguration des Roh-Weißabgleichs:</para><para><list><item><emphasis strong='true'>Standard-D65</emphasis>: Benutzt einen Standardtageslichtweißabgleich D65.</item><item><emphasis strong='true'>Kamera</emphasis>: Benutzt den Weißabgleich der von der Kamera vorgegeben wurde. Wenn dieser nicht verfügbar ist, wird der Standard, der neutrale Weißabgleich benutzt.</item><item><emphasis strong='true'>Automatisch</emphasis>: Berechnet einen automatischen Weißabgleich, der das gesamte Bild mittelt.</item><item><emphasis strong='true'>Manuell</emphasis>: Setzt benutzerdefinierte Temperatur und Grünwerte.</item></list></para>

# @info:whatsthis
source: <title>Temperature</title><para>Set here the color temperature in Kelvin.</para>
de: <title>Temperatur</title><para>Stellen Sie hier die Farbtemperatur in Kelvin ein.</para>

# @label:slider Green component
source: Green:
de: Grün:

# @info:whatsthis
source: <para>Set here the green component to set magenta color cast removal level.</para>
de: <para>Legen Sie hier die Grünkomponente fest, um den Grad der Magentaentfernung zu bestimmen.</para>

# @label:listbox
source: Highlights:
de: Spitzlichter:

# @item:inlistbox
source: Solid white
de: Durchgehendes Weiß

# @item:inlistbox
source: Unclip
de: Farben lösen

# @item:inlistbox
source: Blend
de: Einblenden

# @item:inlistbox
source: Rebuild
de: Rekonstruieren

# @info:whatsthis
source: <title>Highlights</title><para>Select here the highlight clipping method:</para><para><list><item><emphasis strong='true'>Solid white</emphasis>: clip all highlights to solid white</item><item><emphasis strong='true'>Unclip</emphasis>: leave highlights unclipped in various shades of pink</item><item><emphasis strong='true'>Blend</emphasis>:Blend clipped and unclipped values together for a gradual fade to white</item><item><emphasis strong='true'>Rebuild</emphasis>: reconstruct highlights using a level value</item></list></para>
de: <title>Spitzlichter</title><para>Wählen Sie hier die Spitzlichterabschneidemethode:</para><para><list><item><emphasis strong='true'>Durchgehendes Weiß</emphasis>: setzt alle Spitzlichter auf ein durchgehendes Weiß.</item><item><emphasis strong='true'>Lösen</emphasis>: lässt alle Spitzlichter gelöst in verschiedenen Schattierungen von Rosa.</item><item><emphasis strong='true'>Einblenden</emphasis>: Mischt gelöste und befestigte Werte zusammen für eine abgestufte Abblendung nach weiß.</item><item><emphasis strong='true'>Rekonstruieren</emphasis>: rekonstruiert alle Spitzlichter durch die Benutzung eines Niveauwertes.</item></list></para>

# @label:slider Highlight reconstruct level
source: Level:
de: Ebene:

# @info:whatsthis
source: <title>Level</title><para>Specify the reconstruct highlight level. Low values favor whites and high values favor colors.</para>
de: <title>Niveau</title><para>Gibt das Spitzlichterniveau des Ausgabebildes für die Rekonstruktion an. Niedrige Werte bevorzugen Weiß und hohe Werte Farben.</para>

# @option:check
source: Exposure Correction (E.V)
de: Belichtungskorrektur (LW)

# @info:whatsthis
source: <para>Turn on the exposure correction before interpolation.</para>
de: <para>Führt die Belichtungskorrektur vor der Interpolation durch.</para>

# @label:slider
source: Linear Shift:
de: Lineare Verschiebung:

# @info:whatsthis
source: <title>Shift</title><para>Linear Shift of exposure correction before interpolation in E.V</para>
de: <title>Verschiebung</title><para>Lineare Verschiebung der Belichtungskorrektur vor der Interpolation in E.V.</para>

# @label:slider
source: Highlight:
de: Spitzlichter:

# @info:whatsthis
source: <title>Highlight</title><para>Amount of highlight preservation for exposure correction before interpolation in E.V. Only take effect if Shift Correction is > 1.0 E.V</para>
de: <title>Spitzlichter</title><para>Menge der Spitzlichter-Erhaltung bei der Belichtungskorrektur vor der Interpolation in E.V. Nur wirksam bei einer Korrektur > 1.0 E.V</para>

# @option:check
source: Correct false colors in highlights
de: Fehlfarben in Spitzlichtern korrigieren

# @info:whatsthis
source: <para>If enabled, images with overblown channels are processed much more accurately, without 'pink clouds' (and blue highlights under tungsten lamps).</para>
de: <para>Wenn diese Einstellung aktiviert ist, werden übersteuerte Farbkanäle mit höherer Präzision bearbeitet, ohne lila „Wolken“ oder ähnliche Effekte zu bilden.</para>

# @option:check
source: Auto Brightness
de: Automatische Helligkeit

# @info:whatsthis
source: <para>If disable, use a fixed white level and ignore the image histogram to adjust brightness.</para>
de: <para>Ist diese Einstellung ausgeschaltet, wird ein fester Wert für die Anpassung der Helligkeit benutzt und das Histogramm des Bildes ignoriert.</para>

# @label:slider
source: Brightness:
de: Helligkeit:

# @info:whatsthis
source: <title>Brightness</title><para>Specify the brightness level of output image. The default value is 1.0 (works in 8-bit mode only).</para>
de: <title>Helligkeit</title><para>Gibt das Helligkeitsniveau des Ausgabebildes an. Der Standardwert ist 1,0. Diese Funktion arbeitet nur im 8-Bit-Modus.</para>

# @option:check Black point
source: Black:
de: Schwarz:

# @info:whatsthis
source: <title>Black point</title><para>Use a specific black point value to decode RAW pictures. If you set this option to off, the Black Point value will be automatically computed.</para>
de: <title>Schwarzpunkt</title><para>Benutzt einen spezifischen Schwarzpunktwert, um die Rohbilder zu dekodieren. Wenn Sie diese Option ausschalten, wird der Schwarzpunktwert automatisch berechnet.</para>

# @info:whatsthis
source: <title>Black point value</title><para>Specify specific black point value of the output image.</para>
de: <title>Schwarzpunktwert</title><para>Geben Sie den spezifischen Schwarzpunktwert des Ausgabebildes ein.</para>

# @option:check White point
source: White:
de: Weiß:

# @info:whatsthis
source: <title>White point</title><para>Use a specific white point value to decode RAW pictures. If you set this option to off, the White Point value will be automatically computed.</para>
de: <title>Weißpunkt</title><para>Einen spezifischen Weißpunktwert verwenden, um die Rohbilder zu dekodieren. Wenn Sie diese Option ausschalten, wird der Weißpunktwert automatisch berechnet.</para>

# @info:whatsthis
source: <title>White point value</title><para>Specify specific white point value of the output image.</para>
de: <title>Weißpunktwert</title><para>Geben Sie den spezifischen Weißpunktwert des Ausgabebildes ein.</para>

# @label
source: White Balance
de: Weißabgleich

# @label:listbox
source: Noise reduction:
de: Rauschreduktion:

# @item:inlistbox Noise Reduction
source: None
de: Keine

# @item:inlistbox Noise Reduction
source: CFA Line Denoise
de: Farbstreifen-Rauschunterdrückung

# @item:inlistbox Noise Reduction
source: Impulse Denoise
de: Impuls-Rauschunterdrückung

# @info:whatsthis
source: <title>Noise Reduction</title><para>Select here the noise reduction method to apply during RAW decoding.</para><para><list><item><emphasis strong='true'>None</emphasis>: no noise reduction.</item><item><emphasis strong='true'>Wavelets</emphasis>: wavelets correction to erase noise while preserving real detail. It's applied after interpolation.</item><item><emphasis strong='true'>FBDD</emphasis>: Fake Before Demosaicing Denoising noise reduction. It's applied before interpolation.</item><item><emphasis strong='true'>CFA Line Denoise</emphasis>: Banding noise suppression. It's applied after interpolation.</item><item><emphasis strong='true'>Impulse Denoise</emphasis>: Impulse noise suppression. It's applied after interpolation.</item></list></para>
de: <title>Rauschreduktion</title><para>Wählen Sie hier die Methode der Rauschreduktion für die Rohbildkonvertierung aus.</para><para><list><item><emphasis strong='true'>Keine</emphasis>: keine Rauschreduktion.</item><item><emphasis strong='true'>Wavelets</emphasis>: Wavelets-Korrektur zur Rauschunterdrückung bei gleichzeitigem Erhalten der wahren Details. Wird nach der Interpolation ausgeführt.</item><item><emphasis strong='true'>FBDD</emphasis>: „Fake Before Demosaicing Denoising“-Rauschreduktion. Wird vor der Interpolation ausgeführt.</item><item><emphasis strong='true'>Farbstreifen-Rauschunterdrückung</emphasis>: Unterdrückung für Zeilenrauschen des Farbfilters. Wird nach der Interpolation ausgeführt.</item><item><emphasis strong='true'>Impuls-Rauschunterdrückung</emphasis>: Wird nach der Interpolation ausgeführt.</item></list></para>

# @option:check
source: Enable Chromatic Aberration correction
de: Farbabweichungskorrektur aktivieren

# @info:whatsthis
source: <title>Enable Chromatic Aberration correction</title><para>Enlarge the raw red-green and blue-yellow axis by the given factors (automatic by default).</para>
de: <title>Farbabweichungskorrektur aktivieren</title><para>Vergrößert die Rot-/Grün- und Blau-/Gelbebenen der Rohdaten um einen gegebenen Faktor, üblicherweise zwischen 0,999 und 1,001, um Farbabweichungen zu korrigieren.</para>

# @option:check
source: Automatic color axis adjustments
de: Automatische Anpassung der Farbachsen

# @info:whatsthis
source: <title>Automatic Chromatic Aberration correction</title><para>If this option is turned on, it will try to shift image channels slightly and evaluate Chromatic Aberration change. Note that if you shot blue-red pattern, the method may fail. In this case, disable this option and tune manually color factors.</para>
de: <title>Automatische Farbabweichungskorrektur</title><para>Wenn diese Option aktiviert ist werden die Bildkanäle leicht verschoben um Farbabweichungen zu erkennen. Bitte beachten Sie das diese Methode bei Mustern aus Blau und Rot versagt. In diesem Fall deaktivieren Sie diese Option und regeln Sie die Farbfaktoren von Hand nach.</para>

# @label:slider
source: Red-Green:
de: Rot-Grün:

# @info:whatsthis
source: <title>Red-Green multiplier</title><para>Set here the amount of correction on red-green axis</para>
de: <title>Rot-/Grünmultiplikator</title><para>Geben Sie hier den Vergrößerungsfaktor der Rot-/Grünebene ein.</para>

# @label:slider
source: Blue-Yellow:
de: Blau-Gelb:

# @info:whatsthis
source: <title>Blue-Yellow multiplier</title><para>Set here the amount of correction on blue-yellow axis</para>
de: <title>Blau-/Gelbmultiplikator</title><para>Geben Sie hier den Vergrößerungsfaktor der Blau-/Gelbebene ein.</para>

# @label
source: Corrections
de: Korrekturen

# @label:listbox
source: Camera Profile:
de: Kamera-Profil:

# @item:inlistbox Camera Profile
source: None
de: Keine

# @item:inlistbox Camera Profile
source: Embedded
de: Eingebettet

# @item:inlistbox Camera Profile
source: Custom
de: Benutzerdefiniert

# @info:whatsthis
source: <title>Camera Profile</title><para>Select here the input color space used to decode RAW data.</para><para><list><item><emphasis strong='true'>None</emphasis>: no input color profile is used during RAW decoding.</item><item><emphasis strong='true'>Embedded</emphasis>: use embedded color profile from RAW file, if it exists.</item><item><emphasis strong='true'>Custom</emphasis>: use a custom input color space profile.</item></list></para>
de: <title>Kamera-Profil</title><para>Wählen Sie hier das Eingabe-Farbprofil zum Dekodieren der Roh-Daten.</para><para><list><item><emphasis strong='true'>Keines</emphasis>: Bei der Dekodierung der Roh-Daten wird kein Farbprofil verwendet.</item><item><emphasis strong='true'>Eingebettet</emphasis>: Es wird das in der Roh-Datei eingebettete Profil verwendet (sofern vorhanden).</item><item><emphasis strong='true'>Benutzerdefiniert</emphasis>: Es wird ein benutzerdefiniertes Farbprofil verwendet.</item></list></para>

source: ICC Files (*.icc; *.icm)
de: ICC-Dateien (*.icc; *.icm)

# @label:listbox
source: Workspace:
de: Arbeitsbereich:

# @item:inlistbox Workspace
source: Raw (no profile)
de: Roh (kein Profil)

# @item:inlistbox Workspace
source: Custom
de: Benutzerdefiniert
