Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/kdegraphics/libkdcraw.po
Languages: de

# @info:whatsthis
source: <title>Workspace</title><para>Select here the output color space used to decode RAW data.</para><para><list><item><emphasis strong='true'>Raw (linear)</emphasis>: in this mode, no output color space is used during RAW decoding.</item><item><emphasis strong='true'>sRGB</emphasis>: this is an RGB color space, created cooperatively by Hewlett-Packard and Microsoft. It is the best choice for images destined for the Web and portrait photography.</item><item><emphasis strong='true'>Adobe RGB</emphasis>: this color space is an extended RGB color space, developed by Adobe. It is used for photography applications such as advertising and fine art.</item><item><emphasis strong='true'>Wide Gamut</emphasis>: this color space is an expanded version of the Adobe RGB color space.</item><item><emphasis strong='true'>Pro-Photo</emphasis>: this color space is an RGB color space, developed by Kodak, that offers an especially large gamut designed for use with photographic outputs in mind.</item><item><emphasis strong='true'>Custom</emphasis>: use a custom output color space profile.</item></list></para>
de: <title>Arbeitsbereich</title><para>Wählen Sie hier den Ausgabefarbraum für die dekodierten Rohdaten.</para><para><list><item><emphasis strong='true'>Roh (linear)</emphasis>: in diesem Modus wird kein Ausgabefarbraum während der Rohdekodierung benutzt.</item><item><emphasis strong='true'>sRGB</emphasis>: dieser Farbraum ist ein RGB-Farbraum, der in Kooperation zwischen Hewlett-Packard und Microsoft erstellt wurde. Er ist die beste Wahl für Bilder, die für das Web oder als Portrait gedacht sind.</item><item><emphasis strong='true'>Adobe RGB</emphasis>: dieser Farbraum ist ein RGB Farbraum, der von Adobe entwickelt wurde. Er ist gedacht für Fotoanwendungen wie Werbung und Kunst.</item><item><emphasis strong='true'>Wide Gamut</emphasis>: dieser Farbraum ist eine erweiterte Version des Adobe-RGB-Farbraums.</item><item><emphasis strong='true'>Pro-Foto</emphasis>: dieser Farbraum ist ein RGB-Farbraum, der von Kodak entwickelt wurde. Er ermöglicht eine sehr große Farbskala (Gamut) und wurde für die fotografische Ausgabeentworfen.</item><item><emphasis strong='true'>Benutzerdefiniert</emphasis>: ein benutzerdefinierter Ausgabefarbraum.</item></list></para>

# @label
source: Color Management
de: Farbverwaltung

# @label
source: Threshold:
de: Schwellwert:

# @info:whatsthis
source: <title>Threshold</title><para>Set here the noise reduction threshold value to use.</para>
de: <title>Schwellwert</title><para>Geben Sie hier den Schwellwert ein, der für die Rauschreduktion benutzt wird.</para>

# @label
source: Luminance:
de: Leuchtdichte:

# @info:whatsthis
source: <title>Luminance</title><para>Amount of Luminance impulse noise reduction.</para>
de: <title>Lichtdichte</title><para>Menge der Lichtdichte bei der „Impulse“-Rauschreduktion.</para>

# @label
source: Chrominance:
de: Farbwertdichte:

# @info:whatsthis
source: <title>Chrominance</title><para>Amount of Chrominance impulse noise reduction.</para>
de: <title>Farbwertdichte</title><para>Wert der Farbwertdichte bei der „Impulse“-Rauschreduktion.</para>

# @info:tooltip
source: Reset to default value
de: Auf Voreinstellungen zurücksetzen
