Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/kdegraphics/libkface.po
Languages: de

source: The driver "SQLITE" for SQLite3 databases is not available. digiKam depends on the drivers provided by the SQL module of Qt.
de: Der Treiber „SQLITE“ für SQLite3-Datenbanken ist nicht verfügbar. digiKam benötigt die Treiber, die durch das SQL-Modul von Qt zur Verfügung gestellt werden.

source: Error opening database backend. %1
de: Fehler beim Öffnen des Datenbank-Backends. %1

source: Could not open the dbconfig.xml file. This file is installed with libkface and is absolutely required to run recognition. Please check your installation.
de: Die Datei „dbconfig.xml“ kann nicht geöffnet werden. Diese Datei wird mit der Bibliothek „libkface“ installiert und ist zwingend für die Gesichtserkennung erforderlich. Bitte überprüfen Sie Ihre Installation.

source: Could not open dbconfig.xml file <filename>%1</filename>
de: Die Datei dbconfig.xml <filename>%1</filename> kann nicht geöffnet werden

source: The XML in the dbconfig.xml file <filename>%1</filename> is invalid and cannot be read.
de: Die Datei „dbconfig.xml“ <filename>%1</filename> enthält kein gültiges XML und kann daher nicht eingelesen werden.

source: The XML in the dbconfig.xml file <filename>%1</filename> is missing the required element <icode>%2</icode>
de: In der Datei „dbconfig.xml“ <filename>%1</filename> fehlt das erforderliche Element <icode>%2</icode>

source: An old version of the dbconfig.xml file <filename>%1</filename> is found. Please ensure that the right version of libkface is installed.
de: Eine alte Version der Datei „dbconfig.xml“ <filename>%1</filename> wurde gefunden. Bitte überprüfen Sie, ob die richtige Version dieser Datei installiert ist.

source: The database is not valid: the "DBVersion" setting does not exist. The current database schema version cannot be verified. Try to start with an empty database.
de: Die Datenbank ist ungültig: Die Einstellung „DBVersion“ ist nicht vorhanden. Die aktuelle Version des Datenbankschemas kann daher nicht überprüft werden. Versuchen Sie bitte mit einer leeren Datenbank neu zu starten.

source: The database has been used with a more recent version of libkface and has been updated to a database schema which cannot be used with this version. (This means this libkface version is too old, or the database format is to recent.) Please use the more recent version of libkface that you used before.
de: Die Datenbank wurde bereits mit einer aktuelleren Version von libkface benutzt und ist daher schon auf ein Datenbankschema aktualisiert, das in dieser Version nicht verwendet werden kann. Das bedeutet, dass diese libkface-Version entweder zu alt oder das Datenbankformat zu aktuell ist. Benutzen Sie bitte eine Version von libkface, die aktueller ist als die zurzeit eingesetzte.

source: Failed to create tables in database. %1
de: Beim Erstellen der Tabellen in der Datenbank ist ein Fehler aufgetreten. %1
