Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/kdeutils/desktop_kdeutils_print-manager.po
Languages: de

# Name
source: Manage Print Jobs
de: Druckaufträge verwalten

# Comment
source: List print jobs and manage them
de: Druckaufträge anzeigen und verwalten

# Name
source: Printers
de: Drucker

# Comment
source: Configure your printers
de: Drucker einrichten

# Name
source: Print Manager
de: Druckerverwaltung

# Comment
source: Inform when a new printer is detected, and print problems
de: Benachrichtigung über neu erkannte Drucker und Probleme beim Drucken

# Name
source: printmanager
de: Druckerverwaltung

# Comment
source: Notifies when a new printer is detected
de: Benachrichtigung wenn ein neuer Drucker erkannt wurde

# Name
source: A New Printer was detected
de: Ein neuer Drucker wurde erkannt

# Name
source: The New Printer was added
de: Der neue Drucker wurde hinzugefügt
