Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/kdeutils/kremotecontroldaemon.po
Languages: de

# NAME OF TRANSLATORS
source: Your names
de: Frederik Schwarzer

# EMAIL OF TRANSLATORS
source: Your emails
de: schwarzer@kde.org

source: K Remote Control Daemon
de: Fernsteuerungsdienst für KDE

source: Remote Control Daemon for KDE4
de: Fernsteuerungsdienst für KDE 4

source: (c) 2010 Frank Scheffold
de: © 2010, Frank Scheffold

source: Maintainer
de: Betreuer

source: Developer
de: Entwickler

source: Original KDELirc Developer
de: Ursprünglicher Entwickler von KDELirc

source: Configuration reloaded.
de: Die Einstellungen wurden neu geladen.

source: The remote control %1 is now available.
de: Die Fernbedienung %1 ist jetzt verfügbar.

source: An unconfigured remote control %1 is now available.
de: Eine nicht eingerichtete Fernbedienung %1 ist jetzt verfügbar.

# Configure the remote
source: Configure remote
de: Fernbedienung einrichten

source: The remote %1 was removed from system.
de: Die Fernbedienung %1 wurde vom System entfernt.

source: Mode switched to %1
de: In Modus %1 gewechselt
