Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/kdeutils/superkaramba.po
Languages: de

# NAME OF TRANSLATORS
source: Your names
de: Gregor Zumstein

# EMAIL OF TRANSLATORS
source: Your emails
de: gz@orchester-bremgarten.ch

source: Update
de: Aktualisieren

source: &Locked Position
de: &Gesperrte Position

source: Configure &Theme
de: &Design einrichten

source: To Des&ktop
de: Auf &Arbeitsfläche

source: &All Desktops
de: &Alle Arbeitsflächen

source: Desktop
de: Arbeitsfläche

source: &Reload Theme
de: Design &neu laden

source: &Close This Theme
de: Design &schließen

source: Please enable the desktop effects to get full transparency support in SuperKaramba.
de: Aktivieren Sie die Arbeitsflächeneffekte, um mit SuperKaramba die gesamten Möglichkeiten von Transparenz zu nutzen.

source: 1 Running Theme:
de: Ein laufendes Design:

source: <qt>Hiding the system tray icon will keep SuperKaramba running in background. To show it again use the theme menu.</qt>
de: <qt>SuperKaramba läuft im Hintergrund, wenn in der Kontrollleiste kein Symbol angezeigt wird. Um das Symbol wieder anzuzeigen, müssen Sie das SuperKaramba-Menü verwenden.</qt>

source: Hiding System Tray Icon
de: Symbol im Systemabschnitt der Kontrollleiste ausblenden

source: Show System Tray Icon
de: Symbol im Systemabschnitt der Kontrollleiste anzeigen

source: &Manage Themes...
de: Designs &verwalten ...

source: &Quit SuperKaramba
de: &SuperKaramba beenden

source: Hide System Tray Icon
de: Symbol im Systemabschnitt der Kontrollleiste ausblenden

source: SuperKaramba cannot continue to run this theme.One or more of the required components of the Kross scripting architecture is not installed. Please consult this theme's documentation and install the necessary Kross components.
de: SuperKaramba kann dieses Design nicht weiterlaufen lassen. Eine oder mehrere Komponenten der Kross-Skripting-Architektur sind nicht installiert. Bitte schauen Sie in der Dokumentation des Designs nach, welche Kross-Komponenten nachinstalliert werden müssen.

source: Please install additional Kross components
de: Bitte zusätzliche Kross-Komponenten installieren

source: A KDE Eye-candy Application
de: Verschönerungen für KDE

source: (c) 2003-2007 The SuperKaramba developers
de: © 2003–2007 Die SuperKaramba-Entwickler

source: Work on Kross, tutorials and examples
de: Arbeit an Kross, Anleitungen und Beispielen

source: Use the original python bindings as scripting backend. Off by default.
de: Die ursprüngliche Python-Anbindung als Skripting-Backend benutzen. Standardmässig deaktiviert.

source: A required argument 'file'
de: Ein benötigter Parameter „Datei“

source: Show system tray icon.
de: Symbol im Systemabschnitt der Kontrollleiste anzeigen.

source: Themes that user added to theme list.
de: Vom Benutzer zur Liste hinzugefügte Designs.

source: C&ustom
de: &Benutzerdefiniert

source: modified
de: geändert

source: You are about to install and run %1 SuperKaramba theme. Since themes can contain executable code you should only install themes from sources that you trust. Continue?
de: Sie möchten %1 SuperKaramba-Design installieren. Da Designs auch ausführbaren Code enthalten können, sollten Sie nur Designs von Quellen installieren, denen Sie absolut vertrauen. Möchten Sie Fortfahren?

source: Executable Code Warning
de: Warnung vor ausführbarem Code

source: Install
de: Installieren

source: %1 already exists. Do you want to overwrite it?
de: %1 ist bereits vorhanden. Soll sie überschrieben werden?

source: File Exists
de: Datei vorhanden

source: Overwrite
de: Überschreiben

source: SuperKaramba Themes
de: SuperKaramba Designs

source: &Search:
de: &Suchen:

source: S&how:
de: &Anzeigen:

source: All
de: Alle

source: Running
de: Läuft

source: &Add to Desktop
de: Zu Arbeitsfläche &hinzufügen

source: &Close
de: Schl&ießen

source: Get New Stuff
de: „Neue Erweiterungen“ herunterladen

source: Download new themes.
de: Neue Designs herunterladen.

source: New Stuff...
de: Neue Designs ...

source: Open Local Theme
de: Lokales Design öffnen

source: Add local theme to the list.
de: Lokales Design zur Liste hinzufügen.

# Open theme button
source: Open...
de: Öffnen ...

source: Uninstall
de: Deinstallieren

source: *.theme *.skz|Themes
de: *.theme *.skz|Designs

source: Open Themes
de: Designs öffnen

source: <p align="center">%1 running</p>
de: <p align="center">%1 läuft</p>

source: <p align="center">1 running</p>
de: <p align="center">1 läuft</p>

source: Header
de: Kopfzeile

source: Description
de: Beschreibung
