Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/applications/katemailfilesplugin.po
Languages: de

# NAME OF TRANSLATORS
source: Your names
de: Frederik Schwarzer

# EMAIL OF TRANSLATORS
source: Your emails
de: schwarzer@kde.org

source: Mail Files
de: Dateien versenden

source: Support mailing files
de: Unterstützung für Dateiversand

source: Send one or more of the open documents as email attachments.
de: Eine oder mehr der geöffneten Dateien als E-Mail-Anhang versenden.

source: <p>The current document has not been saved, and cannot be attached to an email message.</p><p>Do you want to save it and proceed?</p>
de: <p>Das aktuelle Dokument wurde nicht gespeichert und kann nicht an eine E-Mail angehängt werden.</p><p>Möchten Sie speichern und fortfahren?</p>

source: Cannot Send Unsaved File
de: Ungespeichete Datei kann nicht gesendet werden

source: The file could not be saved. Please check if you have write permission.
de: Die Datei kann nicht gespeichert werden. Bitte prüfen Sie, ob Sie Schreibberechtigung besitzen.

source: <p>The current file:<br /><strong>%1</strong><br />has been modified. Modifications will not be available in the attachment.</p><p>Do you want to save it before sending it?</p>
de: <p>Die aktuelle Datei:<br /><strong>%1</strong><br />wurde verändert. Die Änderungen sind im Anhang nicht verfügbar.</p><p>Möchten Sie die Datei vor dem Senden speichern?</p>

source: Save Before Sending?
de: Vor dem Senden speichern?

source: Do Not Save
de: Nicht speichern

source: Email Files
de: Dateien versenden

source: &Show All Documents >>
de: Alle &Dokumente anzeigen >>

source: &Mail...
de: E-&Mail ...

source: <p>Press <strong>Mail...</strong> to email the current document.</p><p>To select more documents to send, press <strong>Show All Documents&nbsp;&gt;&gt;</strong>.</p>
de: <p>Drücken Sie <strong>E-Mail ...</strong> um das aktuelle Dokument per E-Mail zu versenden.</p><p>Um mehr als ein Dokument für den Versand auszuwählen, drücken Sie <strong>Alle Dokumente anzeigen&nbsp;&gt;&gt;</strong>.</p>

source: URL
de: Adresse

source: &Hide Document List <<
de: Liste der &Dokumente ausblenden <<

source: Press <strong>Mail...</strong> to send selected documents
de: Drücken Sie <strong>E-Mail ...</strong>, um die ausgewählten Dokumente zu versenden

source: &File
de: &Datei
