Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/applications/katefiletemplates.po
Languages: de

# NAME OF TRANSLATORS
source: Your names
de: Frederik Schwarzer

# EMAIL OF TRANSLATORS
source: Your emails
de: schwarzer@kde.org

# @item:inmenu
source: Source Code
de: Quelltext

# @info:whatsthis
source: A very simple GPL C++ header file
de: Eine sehr einfache C++-Header-Datei (GPL)

# @item:inmenu
source: Kate Plugin Docbook Chapter
de: Docbook-Kapitel für Kate-Modul

# @item:inmenu
source: Documentation
de: Dokumentation

# @info:whatsthis
source: This creates a suitable beginning of a docbook chapter for a Kate plugin.
de: Erstellt den passenden Anfang eines Docbook-Kapitels für ein Kate-Modul.

# @info:whatsthis
source: A very simple LGPL C++ header file
de: Eine sehr einfache C++-Header-Datei (LGPL)

# @item:inmenu
source: Kate Highlight Definition
de: Hervorhebungsdefinition

# @info:whatsthis
source: This template will create the basics of a kate highlight definition file.
de: Diese Vorlage erstellt ein Grundgerüst einer Datei für Kate-Hervorhebungsdefinitionen.

# @item:inmenu
source: C++ Source File (GPL)
de: C++-Quelltext-Datei (GPL)

# @info:whatsthis
source: A very simple GPL C++ source file
de: Eine sehr einfache C++-Quelltext-Datei (GPL)

# @item:inmenu
source: HTML 4.01 Strict Document
de: HTML-4.01-Dokument (strict)

# @info:whatsthis
source: This will create a very basic HTML file with the HTML 4.01 strict DTD.
de: Erstellt eine sehr einfache HTML-Datei nach der „strict“-DTD für HTML 4.01.

# @item:inmenu
source: C++ Source File (LGPL)
de: C++-Quelltext-Datei (LGPL)

# @info:whatsthis
source: A very simple LGPL C++ source file
de: Eine sehr einfache C++-Quelltext-Datei (LGPL)

# @info:whatsthis
source: CMake finder skeleton wrapper based on pkg-config
de: CMake-Find-Grundgerüst basierend auf pkg-config

source: File Templates
de: Dateivorlagen

source: Create files from templates
de: Dateien aus Vorlage erstellen

source: &Manage Templates...
de: &Vorlagen verwalten ...

source: New From &Template
de: Neu von &Vorlage

source: Any File...
de: Beliebige Datei ...

# @item:inmenu
source: Other
de: Weitere

source: Author:
de: Autor:

source: Open as Template
de: Als Vorlage öffnen

source: <qt>Error opening the file<br /><strong>%1</strong><br />for reading. The document will not be created.</qt>
de: <qt>Fehler beim lesenden Zugriff auf die Datei<br /><strong>%1</strong>.<br />Das Dokument wird nicht erstellt.</qt>

source: Template Plugin
de: Vorlagen-Modul

source: Untitled %1
de: Unbenannt %1

source: Manage File Templates
de: Dateivorlagen verwalten

source: &Template:
de: &Vorlage:

source: <p>This string is used as the template's name and is displayed, for example, in the Template menu. It should describe the meaning of the template, for example 'HTML Document'.</p>
de: <p>Dieser Text wird als Vorlagenname verwendet und wird unter anderem im Vorlagenmenü verwendet. Er sollte die Bedeutung der Vorlage beschreiben. Beispiel: „HTML-Dokument“.</p>

source: Press to select or change the icon for this template
de: Drücken zum Auswählen des Symbols für diese Vorlage

source: &Group:
de: &Gruppe:

source: <p>The group is used for choosing a submenu for the plugin. If it is empty, 'Other' is used.</p><p>You can type any string to add a new group to your menu.</p>
de: <p>Die Gruppe wird zur Bestimmung des Untermenüs für das Modul verwendet. Falls der Eintrag leer ist, wird „Andere“ verwendet.</p><p>Wird ein neuer Text eingegeben, wird eine neue Gruppe zum Menü hinzugefügt.</p>

source: Document &name:
de: Dokumenten&name:

source: <p>This string will be used to set a name for the new document, to display in the title bar and file list.</p><p>If the string contains '%N', that will be replaced with a number increasing with each similarly named file.</p><p> For example, if the Document Name is 'New shellscript (%N).sh', the first document will be named 'New shellscript (1).sh', the second 'New shellscipt (2).sh', and so on.</p>
de: <p>Dieser Text wird verwendet, um den Namen eines neuen Dokuments zu setzen. Dieser Name wird in der Titelleiste und der Dateiliste angezeigt.</p> <p>Falls der Text „%N“ enthält, wird dieser Platzhalter durch eine mit jedem gleichartigen Dokument aufsteigende Nummer ersetzt.</p> <p>Beispiel: Wenn der Dokumentenname „Neues Shell-Skript (%N)“ lautet, wird das erste Dokument „Neues Shell-Skript (1)“ genannt, das zweite „Neues Shell-Skript (2)“ usw.</p>

source: &Highlight:
de: &Hervorhebung:

source: None
de: Keine

source: <p>Select the highlight to use for the template. If 'None' is chosen, the property will not be set.</p>
de: <p>Wählt die Hervorhebung für die Vorlage aus. Falls „Keine“ gewählt wird, wird diese Eigenschaft nicht gesetzt.</p>

source: &Description:
de: &Beschreibung:

source: <p>This string is used, for example, as context help for this template (such as the 'whatsthis' help for the menu item.)</p>
de: <p>Dieser Text wird z. B. als Kontexthilfe für diese Vorlage in der „Was ist das?“-Hilfe verwendet.</p>

source: &Author:
de: &Autor:

source: <p>You can set this if you want to share your template with other users.</p><p>the recommended form is like an Email address: 'Anders Lund &lt;anders@alweb.dk&gt;'</p>
de: <p>Diese Eigenschaft kann gesetzt werden, falls die Vorlage an andere Benutzer weitergegeben wird.</p> <p>Die empfohlene Form ähnelt einer E-Mail-Adresse: „Erika Mustermann &lt;erika@mustermann.de&gt;“</p>

source: Template Origin
de: Vorlagenherkunft

source: If you want to base this template on an existing file or template, select the appropriate option below.
de: Falls diese Vorlage auf einer bestehenden Datei oder Vorlage aufbauen soll, kann die entsprechende Option gewählt werden.

source: Start with an &empty document
de: Mit l&eerem Dokument beginnen

source: Use an existing file:
de: Bestehende Datei verwenden:

source: Use an existing template:
de: Bestehende Vorlage verwenden:

source: Edit Template Properties
de: Vorlageneigenschaften bearbeiten

source: Specify the main properties of your plugin. You can leave fields empty for which you have no meaningful value.
de: Geben Sie die Schwerpunkt-Eigenschaften Ihres Moduls an. Sie können einige Felder leer lassen, wenn sie für Ihr Modul keine Bedeutung haben.

source: Choose Location
de: Adresse auswählen

source: <p>Choose a location for the template. If you store it in the template directory, it will automatically be added to the template menu.</p>
de: <p>Bitte wählen Sie den Speicherort für die Vorlage aus. Wenn Sie sie im Vorlagenordner speichern, wird die Vorlage automatisch zum Vorlagenmenü hinzugefügt.</p>

source: Template directory
de: Vorlagenordner

source: Template &file name:
de: &Dateiname der Vorlage:

source: Custom location:
de: Benutzerdefinierte Adresse:

source: Autoreplace Macros
de: Makros zum automatischen Ersetzen

source: You can replace certain strings in the text with template macros. If any of the data below is incorrect or missing, edit the data in the personal kaddressbook entry.
de: Bestimmte Teile im Text können mit Vorlagenmakros ersetzt werden. Falls die unten aufgeführten Daten unvollständig sind oder fehlen, können diese im KDE-Adressbuch bearbeitet werden.

source: Replace full name '%1' with the '%{fullname}' macro
de: Vollständigen Namen „%1“ mit dem Makro „%{fullname}“ ersetzen

source: Replace email address '%1' with the '%email' macro
de: E-Mail-Adresse „%1“ mit dem Makro „%email“ ersetzen

source: Create Template
de: Vorlage erstellen

source: The template will now be created and saved to the chosen location. To position the cursor put the string ${|} where you want it in files created from the template.
de: Die Vorlage wird jetzt erstellt und unter der gewählten Adresse gespeichert. Um den Cursor dort zu positionieren, wo er in den aus der Vorlage erstellten Dateien erscheinen soll, verwenden Sie an der entsprechende Stelle die Zeichenfolge „${|}“.

source: Open the template for editing in Kate
de: Vorlage zum Bearbeiten in Kate öffnen

source: <p>The file <br /><strong>'%1'</strong><br /> already exists; if you do not want to overwrite it, change the template file name to something else.</p>
de: <p>Die Datei <br />„<strong>%1</strong>“<br />existiert bereits. Falls die Datei nicht überschrieben werden soll, ändern Sie den Dateinamen der Vorlage.</p>

source: File Exists
de: Datei existiert

source: Overwrite
de: Überschreiben

source: <qt>Error opening the file<br /><strong>%1</strong><br />for reading. The document will not be created</qt>
de: <qt>Die Datei<br />„<strong>%1</strong>“<br />kann nicht zum Lesen geöffnet werden. Das Dokument wird nicht erstellt.</qt>

source: Unable to save the template to '%1'. The template will be opened, so you can save it from the editor.
de: Die Vorlage kann nicht unter „%1“ gespeichert werden. Die Vorlage wird geöffnet, damit sie im Editor gespeichert werden kann.

source: Save Failed
de: Speichern fehlgeschlagen

source: Template
de: Vorlage

# @action:button Template
source: New...
de: Neu ...

# @action:button Template
source: Edit...
de: Bearbeiten ...

# @action:button Template
source: Remove
de: Entfernen

source: &File
de: &Datei

source: &Settings
de: &Einstellungen

source: Main Toolbar
de: Haupt-Werkzeugleiste
