Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/applications/kdepasswd.po
Languages: de

# NAME OF TRANSLATORS
source: Your names
de: Gregor Zumstein, Thomas Reitelbach

# EMAIL OF TRANSLATORS
source: Your emails
de: zumstein@ssd.ethz.ch,tr@erdfunkstelle.de

source: KDE passwd
de: KDE-Passwortänderung

source: Changes a UNIX password.
de: Ändert ein Unix-Passwort.

source: Copyright (c) 2000 Geert Jansen
de: Copyright © 2000 Geert Jansen

source: Maintainer
de: Betreuer

source: Change password of this user
de: Passwort für diesen Benutzer ändern

source: You need to be root to change the password of other users.
de: Nur der Systemverwalter kann die Passwörter von anderen Benutzern ändern.

# @title:window
source: Change Password
de: Passwort ändern

source: Please enter your current password:
de: Bitte geben Sie Ihr aktuelles Passwort ein:

source: Conversation with 'passwd' failed.
de: Die Kommunikation mit „passwd“ ist fehlgeschlagen.

source: Could not find the program 'passwd'.
de: Das Programm „passwd“ ist nicht auffindbar.

source: Incorrect password. Please try again.
de: Falsches Passwort. Bitte versuchen Sie es erneut.

source: Internal error: illegal return value from PasswdProcess::checkCurrent.
de: Interner Fehler: Ungültige Antwort von PasswdProcess::checkCurrent.

source: Please enter your new password:
de: Bitte geben Sie Ihr neues Passwort ein:

source: Please enter the new password for user <b>%1</b>:
de: Bitte geben Sie das neue Passwort für den Benutzer <b>%1</b> ein:

source: Your password is longer than 8 characters. On some systems, this can cause problems. You can truncate the password to 8 characters, or leave it as it is.
de: Ihr Passwort ist länger als 8 Zeichen. Auf einigen Systemen kann dies zu Problemen führen. Sie können Ihr Passwort auf 8 Zeichen kürzen oder es so benutzen, wie Sie es eingegeben haben.

source: The password is longer than 8 characters. On some systems, this can cause problems. You can truncate the password to 8 characters, or leave it as it is.
de: Das Passwort ist länger als 8 Zeichen. Auf einigen Systemen kann dies zu Problemen führen. Sie können Ihr Passwort auf 8 Zeichen kürzen oder es so benutzen, wie Sie es eingegeben haben.

source: Password Too Long
de: Das Passwort ist zu lang

source: Truncate
de: Kürzen

source: Use as Is
de: Genau so benutzen

source: Your password has been changed.
de: Das Passwort wurde geändert.

source: Your password has not been changed.
de: Das Passwort wurde nicht geändert.
