Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/applications/nsplugin.po
Languages: de

# NAME OF TRANSLATORS
source: Your names
de: Thomas Diehl

# EMAIL OF TRANSLATORS
source: Your emails
de: thd@kde.org

source: Start Plugin
de: Modul starten

source: &File
de: &Datei

source: Netscape Plugin
de: Netscape-Modul

source: &Save As...
de: Speichern &unter ...

source: Loading Netscape plugin for %1
de: Netscape-Modul für %1 wird geladen

source: Unable to load Netscape plugin for %1
de: Laden des Netscape-Moduls nicht möglich für %1

# Name of the netscape-plugin which generated this mimetype
source: Netscape plugin %1
de: Netscape-Modul %1

source: Unnamed plugin
de: Unbenanntes Modul

source: Netscape plugin viewer
de: Betrachter für Netscape-Module

source: nspluginscan
de: Suche nach Netscape-Modulen

source: (c) 2000,2001 by Stefan Schimanski
de: © 2000,2001 Stefan Schimanski

source: Show progress output for GUI
de: Fortschrittsanzeige für Oberfläche anzeigen

source: Submitting data to %1
de: Datenübertragung zu %1

source: Requesting %1
de: %1 wird angefordert

source: nspluginviewer
de: Betrachter für Netscape-Module
