Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/applications/pate.po
Languages: de

source: General
de: Allgemein

source: Continuation prompt
de: Fortsetzungs-Eingabeaufforderung

source: Main prompt
de: Haupt-Eingabeaufforderung

source: Continuation Prompt:
de: Fortsetzungs-Eingabeaufforderung:

source: Main Prompt:
de: Haupt-Eingabeaufforderung:

source: Main display font
de: Hauptanzeigeschrift

source: Highlighting
de: Hervorhebung

source: Prompt:
de: Eingabeaufforderung:

source: String:
de: Zeichenkette:

source: Integer:
de: Ganzzahl:

source: Float:
de: Fließkommawert:

source: Help:
de: Hilfe:

source: Exception:
de: Ausnahme:

source: Type help(object) for help on object. Type an expression to evaluate the expression.
de: Geben Sie help(object) für Hilfe zu diesem „object“ ein. Geben Sie einen Ausdruck ein, um ihn auszuwerten.

# @title:tab
source: Python Console
de: Python-Konsole

# @item:inmenu
source: Python Console
de: Python-Konsole

# @title:group
source: Python Console Settings
de: Einstellungen für Python-Konsole

source: Failed to import “%1” from “%2” reason: %3
de: Fehler beim Import von „%1“ von „%2“; Ursache: %3

source: From “%1” autoload: %2
de: Von “%1” automatisch geladen: %2

source: Cannot load this project: %1. Python Version incompatible
de: Diese %1 Projekt kann nicht geladen werden. Die Python-Version ist nicht kompatibel

source: Load project: %1
de: Projekt laden: %1

source: Available variables are everything from pylab, “%1”, and this console as “console”
de: Verfügbare Variablen umfassen alles aus pylab, “%1”, und diese Konsole als “console”

# @item:inmenu
source: IPython Console
de: IPython-Konsole

# @title:group
source: IPython Console Settings
de: Einstellungen für IPython-Konsole

# @title:tab
source: IPython Console
de: IPython-Konsole

source: Scrollback lines count (needs close and open kate editor)
de: Zeilen im Verlaufsspeicher (erfordert Neustart von Kate)

source: GUI completion type (needs close and open kate editor)
de: Art der Vervollständigung (erfordert Neustart von Kate)

source: Drop List
de: Aufklappliste

source: You must save the file first
de: Sie müssen zuerst die Datei speichern

source: Parse code Ok
de: Einlesen des Quelltextes fehlerfrei

source: Parse code Errors:
de: Fehler beim Einlesen des Quelltextes:

source: Pep8 Ok
de: Überprüfung mit „Pep8“ fehlerfrei

source: Pep8 Errors:
de: PEP-8-Fehler:

source: Problem decoding source
de: Probleme beim Dekodieren des Quelltexts

source: Pyflakes Ok
de: Überprüfung mit „Pyflakes“ fehlerfrei

source: Pyflakes Errors:
de: Pyflakes-Fehler:

source: Checkers
de: Überprüfungen

source: __init__ method
de: „__init__“-Methode

source: call super
de: „super“-Aufruf

source: call recursive
de: Rekursiver Aufruf

source: Check all
de: Alles überprüfen

source: Syntax Errors
de: Syntax-Fehler

source: Python Utils
de: Python-Werkzeuge

source: PEP-8 config
de: PEP-8-Konfiguration

source: Check PEP8 when save
de: Beim Speichern auf PEP-8-Konformität prüfen

source: Ignore PEP8 errors
de: PEP-8-Fehler ignorieren

source: Check PyFlakes when save
de: Beim Speichern mit PyFlakes prüfen

source: Check Syntax Errors when save
de: Beim Speichern auf Syntax-Fehler prüfen

source: IPython pdb snippet
de: IPython-pdb-Textbaustein

# @info:tooltip
source: Unable to open the selected document: <filename>%1</filename>
de: Öffnen des ausgewählten Dokuments ist nicht möglich: <filename>%1</filename>

# @info:tooltip
source: Selected text doesn't looks like a valid URI
de: Der ausgewählte Text ist kein gültige URI

# @ation:inmenu
source: Open <filename>%1</filename>
de: <filename>%1</filename> öffnen

# @ation:inmenu
source: Open selected document
de: Ausgewähltes Dokument öffnen

# @info:tooltip
source: The selected text is not valid XML: %1
de: Der ausgewählte Text hat kein gültiges XML-Format: %1

source: Indent:
de: Einrückung:

source: New line:
de: Neue Zeile:

source: &Help
de: &Hilfe
