Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/applications/pate.po
Languages: de

# NAME OF TRANSLATORS
source: Your names
de: Frederik Schwarzer

# EMAIL OF TRANSLATORS
source: Your emails
de: schwarzer@kde.org

# @info:tooltip
source: Cannot load built-in <icode>pate</icode> module
de: Eingebautes <icode>pate</icode>-Modul kann nicht geladen werden

# @info:tooltip
source: Cannot update Python paths
de: Python-Pfade können nicht aktualisiert werden

# @info:tooltip
source: No <icode>pate</icode> built-in module
de: Keine eingebauten <icode>pate</icode>-Module

# @title:column
source: Comment
de: Kommentar

# @info:tooltip
source: Unable to find the module specified <application>%1</application>
de: Das angegebene Modul <application>%1</application> wurde nicht gefunden

# @info:tooltip
source: <p>Specified version has invalid format for dependency <application>%1</application>: <icode>%2</icode>. Skipped</p>
de: <p>Die angegebene Version hat ein ungültiges Format für die Abhängigkeit <application>%1</application>: <icode>%2</icode>. Übersprungen</p>

# @info:tooltip
source: <title>Dependency check</title>
de: <title>Abhängigkeitsprüfung</title>

# @info:tooltip
source: <p>Failed to check version of dependency <application>%1</application>: Module do not have PEP396 <code>__version__</code> attribute. It is not disabled, but behaviour is unpredictable...</p>
de: <p>Die Überprüfung der Version der Abhängigkeit <application>%1</application> ist fehlgeschlagen: Das Modul hat kein PEP396 <code>__version__</code>-Attribut. Es ist nicht deaktiviert, aber das Verhalten ist unvorhersehbar...</p>

# @info:tooltip
source: <p><application>%1</application>: Unexpected module's version format
de: <p><application>%1</application>: Unerwartetes Format der Modulversion

# @info:tooltip
source: <p><application>%1</application>: No suitable version found. Required version %2 %3, but found %4</p>
de: <p><application>%1</application>: Keine passende Version gefunden. Erforderlich ist Version %2 %3, aber gefunden wurde %4</p>

# @info:tooltip
source: <p>Failure on module load <application>%1</application>:</p><pre>%2</pre>
de: <p>Fehler beim Laden des Moduls <application>%1</application>:</p><pre>%2</pre>

# @info:tooltip
source: Internal engine failure
de: Interner Fehler im Modul

# @info:tooltip
source: Module not loaded:<nl/>%1
de: Modul nicht geladen:<nl/>%1

# @title:window
source: Error in action <icode>%1</icode>
de: Fehler bei der Aktion <icode>%1</icode>

# @info:tooltip
source: Invalid <filename>%1</filename> file: No action with name <icode>%2</icode> defined
de: Ungültige Datei <filename>%1</filename>: Es ist keine Aktion mit dem Namen <icode>%2</icode> definiert.

source: Error: The Python engine could not be initialized
de: Fehler: Das Python-Modul kann nicht initialisiert werden.

source: Pâté host for Python plugins
de: Pâté-Verwaltung von Python-Modulen

source: Python interpreter settings
de: Einstellungen für Python-Interpreter

# @title:window
source: Pate engine could not be initialised
de: Das Pate-Modul kann nicht initialisiert werden

# @title:window
source: Warning
de: Achtung

# @info:tooltip %1 is a number of failed plugins
source: %1 plugin module couldn't be loaded. Check the Python plugins config page for details.
de: %1 Module können nicht geladen werden. Überprüfen Sie die Details auf der Einstellungsseite der Python-Module.

# @title:row
source: Python Plugins
de: Python-Module

# @title:tab
source: Pâté host for Python plugins
de: Pâté-Verwaltung von Python-Modulen

source: About Pate
de: Über Pate

# @info:tooltip
source: Cannot load <icode>kate</icode> module
de: <icode>kate</icode>-Modul kann nicht geladen werden

source: Out-of-tree original
de: Ursprüngliche Version ohne Baumansicht

source: Rewritten and brought in-tree, V1.0
de: Neu geschrieben als Baumansicht V1.0

source: Streamlined and updated, V2.0
de: Verbessert und aktualisiert V2.0

source: Block Operations
de: Block-Operationen

# @title:window
source: Error
de: Fehler

# @info:tooltip
source: Unable to open the document: <filename>%1</filename>
de: Öffnen des Dokuments ist nicht möglich: <filename>%1</filename>

# @title:window
source: <filename>CMakeLists.txt</filename> location
de: Speicherort von <filename>CMakeLists.txt</filename>

# @info:tooltip
source: No such file <filename>%1</filename>
de: Datei <filename>%1</filename> nicht gefunden

# @label:listbox
source: CMake Auto Completion
de: Autovervollständigung für CMake

# @label:listbox
source: CMake Variables Completion
de: Autovervollständigung für CMake-Variablen

# @label:listbox
source: CMake Commands Completion
de: Autovervollständigung für CMake-Befehle

# @title:window
source: Attention
de: Achtung

# @info:tooltip
source: Sorry, no completion for <command>%1()</command>
de: Es gibt leider keine Vervollständigung für <command>%1()</command>

# @label:listbox
source: CMake <command>%1()</command> Completion
de: CMake-Vervollständigung für <command>%1()</command>

# @info/plain
source: Project build directory
de: Build-Ordner des Projekts

# @title:tab
source: CMake Cache Viewer
de: Betrachter für den CMake-Zwischenspeicher

# @title:tab
source: CMake Help
de: CMake-Hilfe

# @title:tab
source: Tool View Settings
de: Werkzeug-Ansichtseinstellungen

# @info:tooltip
source: Unable to get CMake cache content:<nl/><message>%1</message>
de: CMake-Zwischenspeicherinhalt kann nicht geholt werden:<nl/><message>%1</message>

# @item::inlistbox/plain
source: Commands
de: Befehle

# @item:inlistbox
source: Modules from %1 (%2)
de: Module von %1 (%2)

# @item:inlistbox
source: Standard modules (%1)
de: Standardmodule (%1)

# @item::inlistbox/plain
source: Modules (%1)
de: Module (%1)

# @item::inlistbox/plain
source: Policies
de: Regelungen

# @item::inlistbox/plain
source: Properties
de: Eigenschaften

# @item::inlistbox/plain
source: Variables
de: Variablen

# @info:tooltip
source: CMake executable test run failed:<nl/><message>%1</message>
de: Die Testausführung der ausführbaren CMake-Datei ist fehlgeschlagen:<nl/><message>%1</message>

# @title:window
source: Select a Directory with CMake Modules
de: Wählen Sie einen Ordner mit CMake-Modulen

# @item:inmenu
source: CMake Helper Plugin
de: CMake-Helfermodul

# @title:group
source: CMake Helper Settings
de: CMake-Helfer-Einstellungen

# @item:intext
source: CMake executable is not configured
de: Die CMake-Programmdatei ist nicht eingerichtet

# @item:intext
source: Running <command>%1</command> finished with errors:<nl/><message>%2</message>
de: Ausführung von <command>%1</command> mit Fehlern beendet:<nl/><message>%2</message>

# @item:intext
source: Specified CMake executable <command>%1</command> looks invalid
de: Die angegebene CMake-Programmdatei <command>%1</command> scheint ungültig zu sein

# @item:intext
source: Specified CMake executable <command>%1</command> not found
de: Die angegebene CMake-Programmdatei <command>%1</command> kann nicht gefunden werden

# @item:intext/plain
source: Specified path %1 does not look like a CMake build directory
de: Der angegebene Pfad %1 scheint kein CMake-Build-Ordner zu sein

source: &File
de: &Datei

source: CMake Settings
de: CMake-Einstellungen

source: System Settings
de: Systemeinstellungen

source: CMake executable:
de: CMake-Programmdatei:

source: Path to CMake executable
de: Pfad zur CMake-Programmdatei

source: <p>How many parent directories to check for <filename>CMakeLists.txt</filename> if the latter is absent in a current document's path</p>
de: <p>Wie viele übergeordnete Ordner nach <filename>CMakeLists.txt</filename> abgesucht werden sollen, wenn <filename>CMakeLists.txt</filename> im Pfad des aktuellen Dokuments nicht vorhanden ist.</p>

source: CMakeLists lookup parents:
de: Suche nach CMakeList-Dateien in übergeordneten Ordnern:

source: Auxiliary CMake Module Directories
de: Zusätzliche Ordner mit CMake-Modulen

source: Auxiliary paths with CMake modules. CMake will try to parse the initial comment for every module found, so you can see a help screen for custom modules in the tool view.
de: Zusätzliche Pfade mit CMake-Modulen. CMake versucht die ursprünglichen Kommentare für jedes gefundene Modul einzulesen und zeigt einen Hilfe-Bildschirm für benutzerdefinierte Module in der Werkzeugansicht.

source: Open a file dialog to select a path to be added.
de: Öffnet einen Dateidialog, um einen Pfad auszuwählen, der hinzugefügt wird.

source: Add
de: Hinzufügen

source: Removes the currently selected path from a list of auxiliary modules.
de: Entfernt den derzeit ausgewählten Pfad aus der Liste der zusätzlichen Module.

source: Remove
de: Entfernen

source: Session Settings
de: Sitzungseinstellungen

source: Project build dir:
de: Projekt-Erstellungsordner:

source: Path to a project build directory associated with a current session
de: Pfad zu einem Projekt-Erstellungsordner, der zu der aktuellen Sitzung gehört

source: CMake Cache View
de: Ansicht des CMake-Zwischenspeichers

source: Filter CMake cache items by name
de: Filtert Einträge im CMake-Zwischenspeicher nach Namen

source: Quick search
de: Schnellsuche

source: <p>Select <i>top build dir</i> controlled by CMake</p>
de: <p>Wählen Sie den <i>obersten Erstellungsordner</i>, der von CMake überwacht wird</p>

source: Type
de: Typ

source: Value
de: Wert

source: CMake Help
de: CMake-Hilfe

source: Double-click to insert the current item to a document
de: Doppelklicken, um den aktuellen Eintrag in ein Dokument einzufügen

source: Tool View Settings
de: Werkzeug-Ansichtseinstellungen

source: <p>Same as <i>advanced mode</i> in <span style=" font-family:'Courier New,courier';">ccmake</span></p>
de: <p>Wie der <i>erweiterte Modus</i> in <span style=" font-family:'Courier New,courier';">ccmake</span></p>

source: Show cache items marked as advanced
de: Zwischenspeicher-Elemente anzeigen, die als erweitert markiert sind

source: Try to turn plain ASCII text into HTML using simple structured text rules. It works quite well for builtins, but sometimes may distort results for others (custom modules).
de: Versucht, einfachen ASCII-Text mithilfe einfacher regeln für strukturierten Text in HTML umzuwandeln. Dies funktioniert gut für eingebaute Module, kann aber manchmal die Ergebnisse für andere benutzerdefinierte Module verfälschen.

source: Try to beautify the help output
de: Hilfe-Ausgabe verbessern

# @action:button
source: &Other...
de: &Weitere ...

source: Rescan current document for #colors
de: Erneut nach #Farben im Dokument suchen.

source: Update
de: Aktualisierung

# @title:window
source: Alert
de: Warnung

# @info:tooltip
source: The cursor is not positioned in any <icode>#if0</icode>/<icode>#if1</icode> block
de: Der Cursor befindet sich nicht in einem <icode>#if0</icode>/<icode>#if1</icode>-Block

# @info:tooltip
source: Unable to detect a commented paragraph at cursor...
de: Es kann kein kommentierter Absatz an der Cursor-Position gefunden werden ...

# @item:inmenu
source: Commentar Plugin
de: Kommentar-Modul

# @title:group
source: Commentar Plugin Settings
de: Einstellungen des Kommentar-Moduls

source: Same-line comment position
de: Position eines Kommentars in der selben Zeile.

source: &Comments
de: &Kommentare

source: Create Django Form
de: Django-Formular erstellen

source: Create Django Model
de: Django-Modell erstellen

source: Template Django URLs
de: Adressen (URLs) für Django-Vorlagen

source: Template Import Views
de: Vorlagenansichten importieren

source: Template Block
de: Vorlagenblock

source: Close Template Tag
de: Vorlage „Tag schließen“

source: Django Utils
de: Django-Werkzeuge

source: Django tags to close when call the "Close Template tag" action
de: Django-Tags zum Schließen beim Aufruf der Aktion Vorlage „Tag schließen“

source: URL template file
de: URL-Vorlagendatei

source: View import snippet
de: Import-Textbausteine anzeigen

source: Pattern Model Form
de: Muster-Modellformular

source: Pattern Model
de: Muster-Modell

# @label:listbox
source: Expands Available
de: Verfügbare Erweiterungen

# @info:tooltip
source: Template file not found <filename>%1</filename>
de: Die Vorlagendatei <filename>%1</filename> wurde nicht gefunden

# @info:tooltip
source: Template file error [<filename>%1</filename>]: <status>%2</status>
de: Fehler in der Vorlagendatei [<filename>%1</filename>]: <status>%2</status>

# @info
source: end of file reached
de: Das Dateiende wurde erreicht

# @info
source: end of line reached while searching for <icode>%1</icode>
de: Das Zeilenende wurde bei der Suche nach <icode>%1</icode> erreicht

# @title:window
source: Parse error
de: Fehler beim Einlesen

# @info:tooltip
source: Expansion "<icode>%1</icode>" not found
de: Die Erweiterung „<icode>%1</icode>“ wurde nicht gefunden

# @info
source: Traceback (most recent call last):<nl/>
de: Rückverfolgung (letzter Aufruf am Ende):<nl/>

# @info
source: File <filename>"(/[^ ]+)"</filename>, line
de: Datei <filename>"(/[^ ]+)"</filename>, zeile

# @info
source: Misbalanced brackets: at <numid>%1</numid>,<numid>%2</numid> and <numid>%3</numid>,<numid>%4</numid>
de: Nicht ausgeglichene eckige Klammern in <numid>%1</numid>,<numid>%2</numid> and <numid>%3</numid>,<numid>%4</numid>

# @info:tooltip
source: Failed to parse C++ expression:<nl/><message>%1</message>
de: C++-Ausdruck kann nicht ausgewertet werden:<nl/><message>%1</message>

# @info:tooltip
source: Did not find anything to format
de: Es gibt nichts zu Formatieren

source: File
de: Datei

source: Match
de: Übereinstimmung

source: Filter '%1' is not a valid regular expression
de: Der Filter „%1“ ist kein gültiger regulärer Ausdruck

source: Invalid filter
de: Ungültiger Filter

source: Scanned %1 of %2 files in %3 seconds
de: %1 von %2 Dateien in %3 Sekunden durchsucht

source: Scan more files?
de: Weitere Dateien durchsuchen?

source: All Files
de: Alle Dateien

source: More Files
de: Weitere Dateien

source: gid Search
de: GID-Suche

source: ID database error
de: ID-Datenbankfehler

source: '%1' does not contain '%2'
de: „%1“ enthält kein „%2“

source: Cannot use %i
de: %i kann nicht verwendet werden

# @title:group
source: <command section='1'>gid</command> token Lookup and Navigation
de: Nachschlagen und Navigation von Token für <command section='1'>gid</command>

source: ID file:
de: ID-Datei:

source: Name of ID file, as generated by mkid(1).
de: Name der ID-Datei, wie von mkid(1) generiert.

source: ID *|All Files
de: ID *|Alle Dateien

source: Complete tokens after:
de: Token vervollständigen ab:

source: Minimum length of token before completions will be shown.
de: Mindestlänge des Token, bevor die automatische Vervollständigung angezeigt wird.

source: Transform Filenames
de: Dateinamen umformen

source: Replace file prefix ending with key:
de: Dateierweiterung mit diesem Schlüsselwort ersetzen:

source: Discard the first part of the file name ending with this key.
de: Verwirft den ersten Teil des Dateinamens, der mit diesem Schlüsselwort endet.

source: With this file prefix:
de: Mit diesem Datei-Präfix:

source: <!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0//EN" "http://www.w3.org/TR/REC-html40/strict.dtd"> <html><head><meta name="qrichtext" content="1" /><style type="text/css"> p, li { white-space: pre-wrap; } </style></head><body style=" font-family:'Ubuntu'; font-size:9pt; font-weight:400; font-style:normal;"> <p style=" margin-top:12px; margin-bottom:12px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;">Replacement prefix. To use the prefix of the ID file ending with the key, use %{idPrefix}. This can be used to work with remotely mounted Clearcase views, for example, set:</p> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;">ID file: /view/myview/<span style=" font-weight:600;">topdir</span>/ID </p> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;">Replace prefix ending: /<span style=" font-weight:600;">topdir</span> </p> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;">With prefix: %{idPrefix}/<span style=" font-weight:600;">topdir</span> </p> <p style=" margin-top:12px; margin-bottom:12px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;">Or, to use a pre-generated ID file with a different workspace, set:</p> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;">ID file: /snapshots/<span style=" font-weight:600;">topdir</span>/ID </p> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;">Replace prefix ending: /<span style=" font-weight:600;">topdir</span> </p> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;">With prefix: /myworkspace/<span style=" font-weight:600;">topdir</span> </p></body></html>
de: <!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0//EN" "http://www.w3.org/TR/REC-html40/strict.dtd"> <html><head><meta name="qrichtext" content="1" /><style type="text/css"> p, li { white-space: pre-wrap; } </style></head><body style=" font-family:'Ubuntu'; font-size:9pt; font-weight:400; font-style:normal;"> <p style=" margin-top:12px; margin-bottom:12px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;">Ersetzungspräfix. Für den Präfix der ID-Datei, die mit diesem Schlüssel endet, verwenden Sie %{idPrefix}. Dies kann für die Arbeit mit entfernten eingebundenen „Clearcase“-Ansichten benutzt werden. Setzen Sie zum Beispiel:</p> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"> ID-Datei: /view/myview/<span style=" font-weight:600;">topdir</span>/ID </p> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;">Präfix-Ende ersetzen: /<span style=" font-weight:600;">topdir</span> </p> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;">Mit Präfix: %{idPrefix}/<span style=" font-weight:600;">topdir</span> </p> <p style=" margin-top:12px; margin-bottom:12px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;">Für eine vorher generierte ID-Datei mit einem anderen Arbeitsbereich geben Sie an:</p> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;">ID-Datei: /snapshots/<span style=" font-weight:600;">topdir</span>/ID </p> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;">Präfix-Ende ersetzen: /<span style=" font-weight:600;">topdir</span> </p> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;">Mit Präfix: /myworkspace/<span style=" font-weight:600;">topdir</span> </p></body></html>

source: Highlight Matches
de: Übereinstimmungen hervorheben

source: Highlight definitions using etags(1):
de: Hervorhebungsdefinition mit etags(1):

source: Use etags(1) to find definitions, and highlight them.
de: Verwenden Sie etags(1), um Definitionen zu finden und sie hervorzuheben.

source: Enabled
de: Aktiviert

source: Highlight files with suffixes:
de: Dateien mit diesen Suffixen hervorheben:

source: Use .h;.hxx to highlight files which may contain declarations.
de: Mit „.h;.hxx“ werden Dateien hervorgehoben, die Deklarationen enthalten könnten.

source: A regular expression which must also be matched. Use %{token} to include the token. This can be used to get the effect of full text searching for strings which contain the token and match the filter.
de: Ein regulärer Ausdruck, der ebenfalls übereinstimmen muss. Verwenden Sie %{token}, um auf das Token zu verweisen. Damit kann eine Volltextsuche nach Zeichenfolgen durchgeführt werden, die das Token enthalten und mit dem Filter übereinstimmen.

source: Find a symbol, filename or other token using auto-completion. Hit return to lookup occurrences within files.
de: Suchen Sie Symbole, Dateinamen und Token mittels Autovervollständigung. Drücken Sie die Rückgabetaste, um Vorkommen innerhalb von Dateien zu finden.

source: Settings...
de: Einstellungen ...

source: Filtered matches for the token. Activate a match to jump to it.
de: Gefilterte Übereinstimmungen des Token. Wählen Sie einen Treffer, um an die entsprechende Stelle zu springen.

source: Stack of previous locations. Activate an item to jump to it.
de: Wählen Sie einen Treffer, um an die entsprechende Stelle zu springen.

# @item:inmenu
source: JavaScript Utilities
de: JavaScript-Werkzeuge

# @title:group
source: JavaScript Utilities Options
de: Einstellungen für JavaScript-Werkzeuge

# @title:menu
source: JavaScript autocomplete
de: JavaScript-Autovervollständigung

# @title:menu
source: jQuery autocomplete
de: jQuery-Autovervollständigung

# @info:status
source: <p> Additionally to free software licenses like GPL and MIT, this functionality requires you to accept the following conditions: </p><p>%1</p><p> Do you want to accept and download the functionality? </p>
de: <p> Zusätzlich zu freien Softwarelizenzen wie GPL und MIT, müssen Sie für diese Funktion die folgenden Bedingungen akzeptieren: </p><p>%1</p><p> Möchten Sie diese Bedingungen akzeptieren und die Funktion herunterladen? </p>

# @title:window
source: Accept license?
de: Lizenzbestimmungen akzeptieren?

# @info:status
source: No acceptable linter named %1!
de: Kein annehmbarer Linter mit dem Namen %1.

# @info:status
source: Download failed
de: Das Herunterladen ist fehlgeschlagen

# @info:status
source: <application>%1</application> Errors:
de: <application>%1</application> Fehler:

source: JSON config
de: JSON-Konfiguration

source: JSON Indent
de: JSON-Einrückung

source: JSON encoding
de: JSON-Kodierung

source: Menu config
de: Menü-Konfiguration

source: Lint when saving
de: Beim Speichern mit Lint prüfen

source: JavaScript autocompletion
de: JavaScript-Autovervollständigung

source: jQuery autocompletion
de: jQuery-Autovervollständigung

source: jQuery ready Snippet
de: jQuery-Textbaustein bereit

# @info:status
source: This selected text is not valid JSON: <message>%1</message>
de: Der ausgewählte Text hat kein gültiges JSON-Format: <message>%1</message>

# @info:tooltip placeholder is a mime-type
source: This action has no sense for <command>%1</command> documents
de: Diese Aktion macht keinen Sinn für <command>%1</command>-Dokumente

# @title:window
source: Sorry...
de: Fehler ...

# @info:tooltip placeholder is a mime-type
source: <command>%1</command> is unsupported document type.
de: <command>%1</command> ist ein nicht unterstützte Dokumenttyp.

# @info:tooltip
source: This operation is for block selection mode
de: Dies ist eine Operation für den Blockauswahlmodus

# @info:tooltip
source: This operation is for normal selection mode
de: Dies ist eine Operation für den normalen Auswahlmodus

# @info:tooltip
source: This operation cannot be performed while text is selected
de: Diese Operation kann nicht ausgeführt werden, wenn Text ausgewählt ist

# @info:tooltip
source: Text must be selected to perform this operation
de: Um diese Operation auszuführen, muss Text ausgewählt werden

source: And other errors
de: Und weitere Fehler

# @title:window
source: Success
de: Erfolgreich

source: ~*~ Line: %1
de: ~*~ Zeile: %1

source: Python autocomplete
de: Python-Autovervollständigung

source: There was a syntax error in this file:
de: Es ist ein Syntax-Fehler in dieser Datei vorhanden:

# %1 is error message
source: %1 * file: %2
de: %1 * Datei: %2

# %1 is error message
source: %1 * line: %2
de: %1 * Zeile: %2

# @label:listbox
source: Python Jedi autocomplete
de: Python-Jedi-Autovervollständigung
