Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/applications/plasma_applet_katesession.po
Languages: de

source: Start Kate (no arguments)
de: Kate starten (ohne Argumente)

source: New Kate Session
de: Neue Kate-Sitzung

source: New Anonymous Session
de: Neue anonyme Sitzung

source: Session Name
de: Sitzungsname

source: Please enter a name for the new session
de: Bitte geben Sie einen Namen für die neue Sitzung ein

source: An unnamed session will not be saved automatically. Do you want to create such a session?
de: Eine unbenannte Sitzung wird nicht automatisch gespeichert. Möchten Sie eine Sitzung dieses Typs erstellen?

source: Create anonymous session?
de: Anonyme Sitzung erstellen?

source: You already have a session named %1. Do you want to open that session?
de: Es ist bereits eine Sitzung mit dem Namen %1 vorhanden. Möchten Sie diese öffnen?

source: Session exists
de: Sitzung vorhanden

source: Sessions
de: Sitzungen

source: Sessions to show
de: Anzuzeigende Sitzungen
