Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/applications/rellinks.po
Languages: de

# NAME OF TRANSLATORS
source: Your names
de: Thomas Fischer

# EMAIL OF TRANSLATORS
source: Your emails
de: thomas.fischer@t-fischer.net

source: Rellinks
de: Relative Links

source: &Top
de: &Oberstes Element

source: <p>This link references a home page or the top of some hierarchy.</p>
de: <p>Diese Verknüpfung zeigt auf eine Startseite oder die Spitze einer Hierarchie.</p>

source: &Up
de: &Hoch

source: <p>This link references the immediate parent of the current document.</p>
de: <p>Diese Verknüpfung zeigt auf die direkte Elternseite des aktuellen Dokuments.</p>

source: &First
de: &Erstes Dokument in Reihe

source: <p>This link type tells search engines which document is considered by the author to be the starting point of the collection.</p>
de: <p>Diese Verknüpfung zeigt auf das erste Dokument in einer geordneten Reihe von Dokumenten.</p>

source: &Previous
de: &Vorheriges Dokument

source: <p>This link references the previous document in an ordered series of documents.</p>
de: <p>Diese Verknüpfung zeigt auf das vorherige Dokument in einer geordneten Reihe von Dokumenten.</p>

source: &Next
de: &Nächstes Dokument

source: <p>This link references the next document in an ordered series of documents.</p>
de: <p>Diese Verknüpfung zeigt auf das nächste Dokument in einer geordneten Reihe von Dokumenten.</p>

source: &Last
de: &Letztes Dokument

source: <p>This link references the end of a sequence of documents.</p>
de: <p>Diese Verknüpfung zeigt auf das letzte Dokument in einer geordneten Reihe von Dokumenten.</p>

source: &Search
de: &Suchen

source: <p>This link references the search.</p>
de: <p>Diese Verknüpfung zeigt auf eine Suchmöglichkeit.</p>

source: Document
de: Dokument

source: <p>This menu contains the links referring the document information.</p>
de: <p>Dieses Menü enthält die Verknüpfungen auf die Dokumentinformationen.</p>

source: Table of &Contents
de: Inhalts&verzeichnis

source: <p>This link references the table of contents.</p>
de: <p>Diese Verknüpfung zeigt auf das Inhaltsverzeichnis.</p>

source: Chapters
de: Kapitel

source: <p>This menu references the chapters of the document.</p>
de: <p>Dieses Menü zeigt die Kapitel des Dokuments.</p>

source: Sections
de: Abschnitte

source: <p>This menu references the sections of the document.</p>
de: <p>Dieses Menü zeigt die Abschnitte des Dokuments.</p>

source: Subsections
de: Unterabschnitte

source: <p>This menu references the subsections of the document.</p>
de: <p>Dieses Menü zeigt die Unterabschnitte des Dokuments.</p>

source: Appendix
de: Anhang

source: <p>This link references the appendix.</p>
de: <p>Dieses Menü zeigt auf den Anhang.</p>

source: &Glossary
de: &Glossar

source: <p>This link references the glossary.</p>
de: <p>Dieses Menü zeigt auf das Glossar.</p>

source: <p>This link references the index.</p>
de: <p>Diese Verknüpfung zeigt auf den Index.</p>

source: More
de: Weitere

source: <p>This menu contains other important links.</p>
de: <p>Dieses Menü enthält weitere wichtige Verknüpfungen.</p>

source: &Help
de: &Hilfe

source: <p>This link references the help.</p>
de: <p>Diese Verknüpfung zeigt auf die Hilfe.</p>

source: &Authors
de: &Autoren

source: <p>This link references the author.</p>
de: <p>Diese Verknüpfung zeigt auf den Autoren.</p>

source: <p>This link references the copyright.</p>
de: <p>Diese Verknüpfung zeigt auf das Copyright.</p>

source: Bookmarks
de: Lesezeichen

source: <p>This menu references the bookmarks.</p>
de: <p>Dieses Menü zeigt auf die Lesezeichen.</p>

source: Other Versions
de: Andere Versionen

source: <p>This link references the alternate versions of this document.</p>
de: <p>Diese Verknüpfung zeigt auf alternative Versionen des Dokuments.</p>

source: Miscellaneous
de: Verschiedenes

source: <p>Miscellaneous links.</p>
de: <p>Verschiedene Verknüpfungen.</p>

source: [Autodetected] %1
de: [Automatisch erkannt] %1

source: &Tools
de: E&xtras

source: Document Relations
de: Dokumentenbeziehungen
