Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/extragear-graphics/SymbolEditor_commands.po
Languages: de

source: Command Reference
de: Befehlsreferenz

source: &kapp; Menus
de: &kapp;-Menüs

source: The File Menu
de: Das Menü Datei

source: <shortcut><keycombo><keycap>Ctrl</keycap><keycap>n</keycap></keycombo></shortcut><guimenuitem>New</guimenuitem>
de: <shortcut><keycombo>&Ctrl;<keycap>N</keycap></keycombo></shortcut><guimenuitem>Neu</guimenuitem>

source: Creates a new library
de: Erstellt eine neue Bibliothek

source: <shortcut><keycombo><keycap>Ctrl</keycap><keycap>o</keycap></keycombo></shortcut><guimenuitem>Open</guimenuitem>
de: <shortcut><keycombo action="simul">&Ctrl;<keycap>O</keycap></keycombo></shortcut><guimenuitem>Öffnen </guimenuitem>

source: Opens an existing library
de: Öffnet eine vorhandene Bibliothek

source: <shortcut><keycombo><keycap>Ctrl</keycap><keycap>r</keycap></keycombo></shortcut><guimenuitem>Open Recent</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>R</keycap> </keycombo> </shortcut> <guimenuitem>Zuletzt geöffnete Dateien</guimenuitem>

source: Open a recently used library
de: Öffnet eine zuletzt verwendete Bibliothek

source: <shortcut><keycombo><keycap>Ctrl</keycap><keycap>s</keycap></keycombo></shortcut><guimenuitem>Save</guimenuitem>
de: <shortcut><keycombo action="simul">&Strg;<keycap>S</keycap></keycombo></shortcut><guimenuitem>Speichern</guimenuitem>

source: Saves the library
de: Speichert die Bibliothek

source: Save As
de: Speichern unter

source: Saves the library under a new name
de: Speichert die Bibliothek unter einem neuen Namen

source: Save Symbol
de: Symbol speichern

source: Save Symbol as New
de: Als neues Symbol speichern

source: Import Library
de: Bibliothek importieren

source: Import a library appending the contained symbols into the current library
de: Importiert eine Bibliothek und fügt die darin enthaltenen Symbole in die aktuelle Bibliothek ein

source: <shortcut><keycombo><keycap>Ctrl</keycap><keycap>w</keycap></keycombo></shortcut><guimenuitem>Close</guimenuitem>
de: <shortcut><keycombo action="simul">&Strg;<keycap>W</keycap></keycombo></shortcut><guimenuitem>Schließen</guimenuitem>

source: Close the library
de: Schließt die Bibliothek

source: <shortcut><keycombo><keycap>Ctrl</keycap><keycap>q</keycap></keycombo></shortcut><guimenuitem>Quit</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Q</keycap></keycombo> </shortcut> <guimenuitem>Beenden</guimenuitem>

source: Quits &kapp;
de: Beendet &kapp;

source: The Edit Menu
de: Das Menü Bearbeiten

source: <shortcut><keycombo><keycap>Ctrl</keycap><keycap>z</keycap></keycombo></shortcut><guimenuitem>Undo</guimenuitem>
de: <shortcut><keycombo action="simul">&Strg;<keycap>Z</keycap></keycombo></shortcut><guimenuitem>Rückgängig</guimenuitem>

source: Undo the last change
de: Macht die letzte Änderung rückgängig

source: <shortcut><keycombo><keycap>Ctrl</keycap><keycap>Shift</keycap><keycap>z</keycap></keycombo></shortcut><guimenuitem>Redo</guimenuitem>
de: <shortcut><keycombo action="simul">&Strg;&Shift;<keycap>Z</keycap></keycombo></shortcut><guimenuitem>Wiederherstellen</guimenuitem>

source: Redo the last change undone
de: Stellt die zuletzt rückgängig gemachte Änderung wieder her

source: Here is a screen shot of the rendering toolbar
de: Hier sehen Sie ein Bildschirmfoto der Rendering-Werkzeugleiste

source: Flat Cap
de: Flaches Ende

source: Square Cap
de: Eckiges Ende

source: Round Cap
de: Rundes Ende

source: Miter Join
de: Gehrungsverbindung

source: Round Join
de: Runde Verbindung

source: Increase Line Width
de: Liniendicke erhöhen

source: Decrease Line Width
de: Liniendicke verringern

source: Here is a screen shot of the tools toolbar
de: Hier sehen Sie ein Bildschirmfoto der Werkzeugleiste

source: Rectangle
de: Rechteck

source: Insert Character
de: Zeichen einfügen

source: Rotate Left
de: Nach links drehen

source: Rotate the whole symbol counter clockwise 90 degrees
de: Dreht das ganze Symbol um 90° gegen den Uhrzeigersinn

source: Rotate Right
de: Nach rechts drehen

source: Rotate the whole symbol clockwise 90 degrees
de: Dreht das ganze Symbol um 90° im Uhrzeigersinn

source: Flip Horizontal
de: Waagerecht spiegeln

source: Flip the symbol across the vertical axis
de: Spiegelt das Symbol an der senkrechten Achse

source: Flip Vertical
de: Senkrecht spiegeln

source: Flip the symbol across the horizontal axis
de: Spiegelt das Symbol an der waagerechten Achse

source: Enable Snap
de: Fang einschalten

source: The Settings Menu
de: Das Menü Einstellungen

source: Toolbars Shown
de: Angezeigte Werkzeugleisten

source: Select the toolbars to be shown
de: Auswahl der angezeigten Werkzeugleisten

source: Show Statusbar
de: Statusleiste anzeigen

source: Toggle visibility of the status bar
de: Blendet die Statusleiste ein oder aus

source: Configure Shortcuts
de: Kurzbefehle festlegen

source: Configure the applications shortcuts
de: Einrichtung der Kurzbefehle für die Anwendung

source: Configure Toolbars
de: Werkzeugleisten einrichten

source: Configure the applications tool bars
de: Einrichtung der Werkzeugleisten für die Anwendung

source: Configure SymbolEditor
de: SymbolEditor einrichten

source: Configure the applications settings
de: Einrichtung der Einstellungen für die Anwendung

source: The Help Menu
de: Das Menü Hilfe

source: &kapp; Handbook
de: Handbuch zu &kapp;

source: Display this help.
de: Zeigt dieses Handbuch an.

source: What's This.
de: Was ist das?

source: Report Bug.
de: Probleme oder Wünsche berichten

source: Switch Application Language
de: Sprache der Anwendung umschalten

source: Change the application language
de: Schaltet die Sprache der Anwendung um

source: About &kapp;
de: Über &kapp;

source: Display some information about &kapp;.
de: Anzeige von Informationen über &kapp;.

source: About KDE
de: Über KDE

source: Display some information about KDE.
de: Anzeige von Informationen über KDE.
