Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdewebdev/kfilereplace.po
Languages: de

source: The &kfilereplace; Handbook
de: Das Handbuch zu &kfilereplace;

source: <firstname>Emiliano</firstname> <othername></othername> <surname>Gulmini</surname>
de: <firstname>Emiliano</firstname> <surname>Gulmini</surname>

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Georg</firstname><surname>Schuster</surname><affiliation><address><email>gschuster@utanet.at</email></address></affiliation><contrib>Deutsche Übersetzung</contrib></othercredit>

source: &kfilereplace; is an utility to search and replace strings.
de: &kfilereplace; ist ein Werkzeug zum Suchen und Ersetzen in Dateien.

source: Introduction
de: Einführung

source: &kfilereplace; is an application used to search and replace a list of strings in a file tree. The strings may be literal or &Qt;-like regular expressions. There are also other options to tune your search.
de: &kfilereplace; ist eine Anwendung zum Suchen und Ersetzen einer Liste von Begriffen in allen Dateien einer Ordnerstruktur. Diese Zeichenketten können normaler Text oder reguläre Ausdrücke wie in &Qt; sein. Es gibt aber noch weitere Möglichkeiten, die Suche zu verbessern.

source: Using &kfilereplace;
de: Die Verwendung von &kfilereplace;

source: <screeninfo>&kfilereplace; in its standalone incarnation</screeninfo>
de: <screeninfo>&kfilereplace; als selbständige Anwendung</screeninfo>

source: <phrase>&kfilereplace; in its standalone incarnation</phrase>
de: <phrase>&kfilereplace; als selbständige Anwendung</phrase>

source: The Toolbar
de: Die Werkzeugleiste

source: The &kfilereplace; toolbar should looks like this:
de: Die Werkzeugleiste von &kfilereplace; sollte so aussehen:

source: <screeninfo>&kfilereplace;'s toolbar</screeninfo>
de: <screeninfo>Die Werkzeugleiste von &kfilereplace;</screeninfo>

source: <phrase>&kfilereplace;'s toolbar</phrase>
de: <phrase>Die Werkzeugleiste von &kfilereplace;</phrase>

source: The toolbar shows you the buttons of the main functionalities.
de: In der Werkzeugleiste sind Symbole für die wichtigen Funktionen enthalten.

source: Toolbar Icons
de: Werkzeugleisten-Symbole

source: Customize Search/Replace Session
de: Suchen/Ersetzen-Sitzung einrichten

source: This button shows a <link linkend="kfilereplace-the-project-dialog">session dialog</link> in which you can set several basic options; if &kfilereplace; run as standalone application you should click this button as first step.
de: Dieses Symbol führt zu einem <link linkend="kfilereplace-the-project-dialog">Sitzungsdialog</link> in dem einige grundlegende Optionen gesetzt werden können; wenn&kfilereplace; als eigenständige Anwendung gestartet wurde, sollte hier begonnen werden.

source: Search
de: Suchen

source: This button starts a search loop.
de: Mit diesem Symbol wird ein Suchlauf gestartet.

source: Simulate
de: Simulieren

source: This button starts a simulated search&amp;replace loop. Nothing really happens when you click this button.
de: Dieses Symbol startet einen nur simulierten Suchen&amp;Ersetzen-Lauf. Das Suchen und Ersetzen wird nicht ausgeführt.

source: Replace
de: Ersetzen

source: This button starts a search&amp;replace loop. When a string has been found, &kfilereplace; replaces it with another string.
de: Dieses Symbol startet einen Suchen&amp;Ersetzen-Lauf. Sobald ein Suchbegriff gefunden wird, ersetzt &kfilereplace; diesen mit dem Ersatzbegriff.

source: Stop
de: Halt

source: This button stops an operation.
de: Dieses Symbol stoppt die Ausführung.

source: Add String
de: Suchbegriff hinzufügen

source: This button opens the <link linkend="kfilereplace-the-add-dialog">Add Strings</link> dialog in which you can edit your string list.
de: Dieses Symbol öffnet den Dialog <link linkend="kfilereplace-the-add-dialog">Suchbegriffe hinzufügen</link>, in dem die Liste der Begriffe bearbeitet werden kann.

source: Delete String
de: Suchbegriff entfernen

source: This button deletes the selected (or the current if there is no selection) string from the list.
de: Das Symbol entfernt den ausgewählten (oder den aktuellen, wenn es keine Auswahl gibt) Begriff aus der Liste.

source: Edit Selected String
de: Ausgewählten Suchbegriff bearbeiten

source: This button edits a selected string.
de: Mit diesem Symbol werden ausgewählte Begriffe bearbeitet.

source: Empty Strings List
de: Liste der Suchbegriffe leeren

source: This button deletes all the strings in the list.
de: Mit diesem Symbol werden alle Begriffe aus der Liste gelöscht.

source: Invert Current String
de: Aktuellen Suchbegriff tauschen

source: This button swaps the search string with the replace string, so you can revert a search/replace operation.
de: Mit diesem Symbol werden Suchbegriff und Ersatzbegriff vertauscht. Damit kann eine Suchen/Ersetzen-Operation rückgängig gemacht werden.

source: Load Strings List From File
de: Liste der Suchbegriffe aus Datei laden

source: This button loads a <link linkend="kfilereplace-the-kfr-file">string list</link> saved in a xml file with a <literal role="extension">kfr</literal> extension.
de: Mit diesem Symbol wird eine <link linkend="kfilereplace-the-kfr-file"> Begriffsliste </link> geladen, die in einer XML-Datei mit <literal role="extension">kfr</literal>-Erweiterung gespeichert ist.

source: Include Sub-Folders
de: Unterordner einbeziehen

source: This button allows you to search/replace recursively in the subfolders of your base directory.
de: Mit diesem Symbol können Unterordner im Suchverzeichnis rekursiv in das Suchen/Ersetzen einbezogen werden.

source: Create Backup Files
de: Sicherungskopien anlegen

source: This button enables generation of <link linkend="kfilereplace-backup-file">backup</link> files.
de: Mit diesem Symbol wird die Erstellung von <link linkend="kfilereplace-backup-file">Sicherungs</link>-Dateien aktiviert.

source: Case Sensitive
de: Groß-/Kleinschreibung beachten

source: This button enables case-sensitive searching.
de: Dieses Symbol aktiviert die Beachtung von Groß/Kleinschreibung beim Suchen.

source: Enable Commands in Replace String
de: Befehle in Ersatz-Zeichenketten zulassen

source: This button enables commands capability. Commands are special strings. See <xref linkend="kfilereplace-commands"/>.
de: Dieses Symbol aktiviert die Fähigkeit, Befehle im Suchtext auszuführen. Dies sind spezielle Suchbegriffe, siehe in <xref linkend="kfilereplace-commands"/>.

source: Enable Regular Expressions
de: Reguläre Ausdrücke benutzen

source: This button enables <link linkend="kfilereplace-QT-regexp">&Qt;-like regular expressions</link>.
de: Das Symbol aktiviert <link linkend="kfilereplace-QT-regexp">reguläre Ausdrücke wie in &Qt;</link>.

source: The Results List
de: Die Ergebnisliste

source: <screeninfo>&kfilereplace;'s Results view</screeninfo>
de: <screeninfo>Ergebnisansicht von &kfilereplace;</screeninfo>

source: <phrase>&kfilereplace;'s Results view</phrase>
de: <phrase>Ergebnisansicht von &kfilereplace;</phrase>

source: The Results view shows the name of the files that contain the strings you have to retrieve (and replace), their path, their size, the number of strings found and the user id of the files. This view also provides the exact position of each match. You can also open a file by clicking with the &RMB; on an list entry that contains line and column position.
de: Diese Ansicht zeigt die Namen der Dateien, die die Suchbegriffe enthalten, ihren Pfad, ihre Größe, die Anzahl der gefundenen Suchbegriffe und die Benutzer-ID der Dateien. In dieser Ansicht wird auch die exakte Position jeder Übereinstimmung angegeben. Eine aufgelistete Datei kann mit der rechten Maustaste geöffnet werden.

source: The String List
de: Die Suchbegriffsliste

source: This is the Strings view:
de: Das ist die Ansicht der Suchbegriffe:

source: <screeninfo>&kfilereplace;'s Strings view</screeninfo>
de: <screeninfo>Die Ansicht der Suchbegriffe von &kfilereplace;</screeninfo>

source: <phrase>&kfilereplace;'s Strings view</phrase>
de: <phrase>Die Ansicht der Suchbegriffe von &kfilereplace;</phrase>

source: The Strings view visualizes the list of strings you want search/replace. Please note that in search mode the Results view and the Strings view have a different layout.
de: Die Ansicht der Suchbegriffe zeigt die Liste der Begriffe, die gesucht/ersetzt werden sollen. Bitte beachten Sie, dass im Suchmodus die Ansicht der Suchbegriffe und die Ansicht der Ergebnisse eine unterschiedliche Gestaltung haben.

source: The Search &amp; Replace in Files Dialog
de: Der Dialog „Suchen &amp; Ersetzen in Dateien“

source: The <guilabel>Search &amp; Replace in Files</guilabel> dialog is used to setup the basic parameters needed by &kfilereplace; to work. It consists of two tabs, <guilabel>General</guilabel> and <guilabel>Advanced</guilabel>.
de: Im Dialog <guilabel>Suchen &amp; Ersetzen in Dateien</guilabel> können die Grund-Parameter für &kfilereplace; eingestellt werden. Er besteht aus den zwei Karteikarten <guilabel>Allgemein</guilabel> und <guilabel>Erweitert</guilabel>.

source: The General Tab
de: Die Karteikarte Allgemein

source: <screeninfo>&kfilereplace; General tab</screeninfo>
de: <screeninfo>&kfilereplace; - Karteikarte Allgemein</screeninfo>

source: <phrase>&kfilereplace; General tab</phrase>
de: <phrase>&kfilereplace; - Karteikarte Allgemein</phrase>

source: When you want to begin a new session the first step is to click on the <link linkend="kfilereplace-the-toolbar"><guiicon>Customize Search/Replace Session</guiicon> button</link>. Then you must enter the base path and a sequence of shell-like wildcards to use as filter.
de: Zum Starten einer neuen Sitzung, klicken Sie auf das Symbol <link linkend="kfilereplace-the-toolbar"><guiicon>Suchen/Ersetzen-Sitzung einrichten</guiicon></link>. Dann muss der Ausgangspfad und eine Folge von Platzhaltern, wie in der Befehls-Shell, als Filter eingegeben werden.

source: Then you could set some useful options, like searching in all the subfolders, doing a case-sensitive search, enabling commands and/or regular expressions<footnote id="performancewarning"><para>Please note that regular expressions and commands could slow down the speed performances.</para></footnote>, doing a backup copy of each file before replacing.
de: Dann können einige nützliche Optionen, wie Suche in Unterordnern, Beachtung der Groß/Kleinschreibung, Einschalten von Befehlen und/oder regulären Ausdrücken festgelegt werden <footnote id="performancewarning"><para>Bitte beachten Sie, dass reguläre Ausdrücke und Befehle die Geschwindigkeit sehr vermindern können. </para></footnote>, oder die Erstellung einer Sicherung für jede Datei vor dem Ersetzen.

source: If you want to start searching, you can put a string in the search box and press <guibutton>Search Now</guibutton>, otherwise leave the search box empty and press <guibutton>Search Later</guibutton>.
de: Wenn die Suche starten soll, können Sie einen Suchbegriff im Feld eingeben und <guibutton>Jetzt Suchen</guibutton> drücken, oder das Suchfeld leer lassen und <guibutton>Später Suchen</guibutton> drücken.

source: The Advanced Tab
de: Die Karteikarte Erweitert

source: <screeninfo>&kfilereplace; Advanced tab</screeninfo>
de: <screeninfo>Karteikarte Erweitert von &kfilereplace;</screeninfo>

source: <phrase>&kfilereplace; Advanced tab</phrase>
de: <phrase>Karteikarte Erweitert von &kfilereplace;</phrase>

source: The <guilabel>Advanced</guilabel> tab allows you to set up some useful options to restrict the search to a subset of your target file tree. If you want to run &kfilereplace; only over files that have a size in the range of 10KB - 100KB, then you could use the size options. There is also a date option that restricts the search in a temporal range, and a last option that allows you to only search for files owned (or not owned) by a particular user (this may be more useful to the system administrators).
de: Die Karteikarte <guilabel>Erweitert</guilabel> erlaubt die Einstellung von nützlichen Optionen zur Eingrenzung der Suche auf einen Teil der Dateien in der durchsuchten Ordnerstruktur. Wenn &kfilereplace; nur Dateien mit einer Größe im Bereich von 10KB - 100KB gesucht werden sollen, kann die Größenoption genutzt werden. Es gibt eine Datumsoption für die Einschränkung auf einen Zeitraum und eine Möglichkeit, nach dem Eigentümer (auch für Systemadministratoren nützlich) einzugrenzen.

source: The Options Dialog
de: Der Dialog <quote>Einstellungen</quote>

source: This dialog contains options that are in the toolbar and extra options that may come in handy in some situations. You can invoke it selecting <menuchoice><guimenu>Settings</guimenu><guimenuitem>Configure KFileReplace...</guimenuitem></menuchoice> in the main menu.
de: Dieser Dialog enthält Optionen, die auch mit der Werkzeugleiste erreichbar sind und zusätzliche Optionen für besondere Umstände. Er kann aus dem Menü mit <menuchoice><guimenu>Einstellungen</guimenu><guimenuitem>KFileReplace einrichten ...</guimenuitem></menuchoice> aufgerufen werden.

source: General options
de: Allgemeine Einstellungen

source: These options have been presented in the <link linkend="kfilereplace-the-toolbar">Toolbar</link> section.
de: Diese Optionen wurden in der <link linkend="kfilereplace-the-toolbar">Werkzeugleiste</link> angezeigt.

source: <screeninfo>The General tab of the Options window</screeninfo>
de: <screeninfo>Die Karteikarte Allgemein des Einstellungsdialogs</screeninfo>

source: <phrase>The General tab of the Options window</phrase>
de: <phrase>Die Karteikarte Allgemein des Einstellungsdialogs</phrase>

source: Advanced options
de: Erweiterte Einstellungen

source: <screeninfo>The Advanced tab of the Options window</screeninfo>
de: <screeninfo>Die Karteikarte Erweitert des Einstellungsdialogs</screeninfo>

source: <phrase>The Advanced tab of the Options window</phrase>
de: <phrase>Die Karteikarte Erweitert des Einstellungsdialogs</phrase>

source: Do not show files if no strings are found or replaced
de: Datei nicht zeigen, wenn darin kein Suchbegriff gefunden oder ersetzt wurden

source: When searching, stop on first string found
de: Beim Suchen an der ersten Fundstelle anhalten (schneller, aber ohne Einzelheiten)

source: Follow symbolic links
de: Symbolischen Verknüpfungen folgen

source: Ignore hidden files and directories
de: Versteckte Dateien und Ordner ignorieren

source: shows only the files that match some of your strings. This will speed up the search.
de: Zeigt nur Dateien mit Suchtreffern. Dies erhöht die Geschwindigkeit der Suche.

source: &kfilereplace; will stop when it finds a matching string, and will continue to search for other strings or, if you search for only one string, it will continue with the next file.
de: &kfilereplace; hält an, wenn ein Suchbegriff gefunden wird und sucht nach anderen Suchbegriffen oder, wenn nur ein Begriff gesucht wird, setzt es mit der nächsten Datei fort.

source: if a file is a link to another one, then search in the real file.
de: Wenn eine Datei nur eine Verknüpfung zu einer anderen Datei ist, dann wird die echte Datei durchsucht.

source: if hidden files or folders are encountered, ignore them.
de: Wenn es versteckte Dateien oder Ordner gibt, werden diese ignoriert.

source: The Insert Searching/Replacing Strings Dialog
de: Der Dialog „Suchen/Ersetzen-Begriffe einfügen“

source: <screeninfo>&kfilereplace;'s Insert Searching/Replacing Strings dialog</screeninfo>
de: <screeninfo>Der Dialog „Suchen/Ersetzen-Begriffe einfügen“ von &kfilereplace;</screeninfo>

source: <phrase>&kfilereplace;'s Insert Searching/Replacing Strings dialog</phrase>
de: <phrase>Der Dialog „Suchen/Ersetzen-Begriffe einfügen“ von &kfilereplace;</phrase>

source: This dialog is used to insert and edit a list of strings. You just have to insert either a search-only or a search-and-replace list, and then with the two mini-editors you will introduce your text. The arrow buttons allow you to add pairs of strings or delete them. When you finish, click <guibutton>OK</guibutton>.
de: Dieser Dialog wird zum Einfügen und Bearbeiten einer Liste von Begriffen benutzt. Es genügt, entweder eine nur-Suchen oder eine Suchen und Ersetzen Liste auszufüllen bzw. in den beiden Bearbeitungsfeldern zu erfassen. Mit den Pfeilen können Begriffe paarweise zur Suchliste hinzugefügt oder daraus gelöscht werden. Mit <guibutton>OK</guibutton> beendet man den Dialog.

source: &kfilereplace; features
de: Fähigkeiten von &kfilereplace;

source: This chapter provides information about some useful capabilities of &kfilereplace;.
de: Diese Kapitel beschreibt einige sehr nützliche Fähigkeiten von &kfilereplace;.

source: How to save your string list
de: Liste mit Suchbegriffen speichern

source: When you want to reuse a list of strings you can save it in a <literal role="extension">xml</literal> file. To do this select from the menubar <menuchoice><guimenu>Search/Replace</guimenu><guisubmenu>Strings</guisubmenu><guimenuitem>Save Strings List to File</guimenuitem></menuchoice>. When you save a list, a simple <literal role="extension">xml</literal> file with extension <literal role="extension">kfr</literal> is created. To load a <literal role="extension">kfr</literal> file select from menubar <menuchoice><guimenu>Search/Replace</guimenu><guisubmenu>Strings</guisubmenu><guimenuitem>Load Strings List from File</guimenuitem></menuchoice>. The actual file looks like this:
de: Wenn die Liste von Suchbegriffen wiederverwendet werden soll, kann sie in einer <literal role="extension">xml</literal> Datei gesichert werden. Dazu ist im Menü <menuchoice><guimenu>Suchen/Ersetzen</guimenu><guisubmenu>Suchbegriffe</guisubmenu><guimenuitem>Liste der Suchbegriffe in Datei speichern ...</guimenuitem></menuchoice> zu wählen. Beim Sichern wird eine einfache <literal role="extension">xml</literal>-Datei mit der Erweiterung <literal role="extension">kfr</literal> erstellt. Um eine <literal role="extension">kfr</literal>-Datei zu laden, müssen Sie aus dem Menü <menuchoice><guimenu>Suchen/Ersetzen</guimenu><guisubmenu>Suchbegriffe</guisubmenu><guimenuitem>Liste der Suchbegriffe aus Datei laden</guimenuitem></menuchoice> wählen . Die aktuelle Datei sieht so aus:

source: If you are using a previous format, you can update by hand your file by simply modifying it according to the above scheme. Alternatively, you can load the file written in the old format and save it again with &kfilereplace; in the way explained before.
de: Wenn ein früheres Format vorliegt, kann es händisch durch Anpassen an das Schema oben erneuert werden. Alternativ kann die Datei im alten Format von &kfilereplace; gelesen und in der vorher beschriebenen Weise erneuert gespeichert werden.

source: How to Create a Simple Report
de: Einen einfachen Bericht erstellen

source: You can create a report by choosing <menuchoice><guimenu>Search/Replace</guimenu><guisubmenu>Results</guisubmenu><guimenuitem>Create Report File</guimenuitem></menuchoice> from the main menu. A report is a folder containing an <literal role="extension">xml</literal> and a <literal role="extension">css</literal> file. Reports may be useful to maintain a simple log of your operations.
de: Ein Bericht kann durch die Menüwahl <menuchoice><guimenu>Suchen/Ersetzen</guimenu><guisubmenu>Ergebnisse</guisubmenu><guimenuitem>Bericht erstellen ...</guimenuitem></menuchoice> erzeugt werden. Ein Bericht ist ein Ordner, der eine <literal role="extension">xml</literal>- und eine <literal role="extension">css</literal>-Datei enthält. Mit Berichten ist das Mitführen einer einfachen Aufzeichnung ihrer Operationen leicht.

source: <screeninfo>&kfilereplace;'s Report feature</screeninfo>
de: <screeninfo>Die Berichterstellung in &kfilereplace;</screeninfo>

source: <phrase>&kfilereplace;'s Report feature</phrase>
de: <phrase>Die Berichterstellung in &kfilereplace;</phrase>

source: How to use Regular Expressions
de: Reguläre Ausrücke verwenden

source: If you want search for every string that starts with <quote>x</quote>, <quote>ht</quote> or <quote>u</quote> and ends with <quote>ml</quote>, you can write a regular expression like this: <userinput>(x|ht|u)ml</userinput>. Insert this expression in the search editor, click <guibutton>OK</guibutton>, and enable regular expressions by toggling the <link linkend="kfilereplace-the-toolbar"><guibutton>Regular Expression</guibutton> button</link>. Please note that using regular expressions lets you to make very complicated searches, but the cost could be a performance degradation. Regular expression can be very tricky, and it is often the case that <quote>if you want to solve a problem with a regular expression, you have two problems</quote>.
de: Wenn &eg; jede Zeichenfolge, die mit <quote>x</quote>, <quote>ht</quote> oder <quote>u</quote> beginnt und mit <quote>ml</quote>endet, gesucht werden soll, könnte ein regulärer Ausdruck wie dieser helfen: <userinput>(x|ht|u)ml</userinput>. Durch Eingeben im Sucheditor und Anklicken von <guibutton>OK</guibutton>, sowie dem Aktivieren regulärer Ausdrücke mit dem Symbol <link linkend="kfilereplace-the-toolbar"><guibutton>Reguläre Ausdrücke verwenden</guibutton></link> startet die Suche. Die Verwendung von regulären Ausdrücken erlaubt komplexe Suchvorgänge, kann aber die Geschwindigkeit drastisch vermindern. Reguläre Ausrücke können sehr trickreich sein, sodass <quote>die Lösung eines Problems mit regulären Ausdrücken oft zu zwei Problemen führt</quote>.

source: How to Protect Original Files
de: Originaldateien bewahren

source: If you do not want to lose your original files, you can make a copy of them before replacing the strings. After inserting your strings, and before starting the replacement process, you have just to toggle the <link linkend="kfilereplace-the-toolbar"><guiicon>Backup</guiicon> button</link>. If you want to customize the extension of the backup files open the <link linkend="kfilereplace-the-options-dialog"><guilabel>Options</guilabel> dialog</link>.
de: Wenn Originaldateien bewahrt werden sollen, kann davon vor dem Ersetzen eine Kopie erstellt werden. Nach dem Eingeben der Begriffe und vor Beginn des Ersetzen-Vorgangs muss nur das <link linkend="kfilereplace-the-toolbar">Symbol <guiicon>Sicherungskopien anlegen</guiicon> </link> aktiviert werden. Die Erweiterung der Sicherungsdateien kann im <link linkend="kfilereplace-the-options-dialog"><guilabel>Einstellungs</guilabel>-Dialog</link> angepasst werden.

source: How to Open a File
de: Eine Datei öffnen

source: If you want to open a file that matches some of your strings, you have to select a line in the result view and click on it with the &RMB;. A context menu will appear from which you can open the file.
de: Eine Datei, die Suchbegriffe enthält, kann durch Rechtsklick auf die Zeile mit der Übereinstimmung in der Ergebnisansicht geöffnet werden. Es wird ein Kontextmenü angezeigt, aus dem die Datei geöffnet werden kann.

source: Commands
de: Befehle
