Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdewebdev/kfilereplace.po
Languages: de

source: Suppose you want replace the phrase <quote>Alice's adventures in Wonderland</quote> with the <ulink url="http://www.textlibrary.com/download/alice-wo.txt">entire file that contains Carroll's novel</ulink>. Probably you don't want to do this by hand, what you need is a command that will do it for you. Click the <link linkend="kfilereplace-the-toolbar"><guiicon>Add</guiicon></link> button, select <guilabel>Search and Replace Mode</guilabel> and insert the following strings: <userinput>Alice's adventure in Wonderland</userinput> in the search mini-editor and the string <userinput>[$loadfile:<replaceable>/the-path-to-my-folder/my-folder/my-file</replaceable>$]</userinput> in the replacement mini-editor. Click <guibutton>OK</guibutton>. When you come back to the &kfilereplace; main window, toggle the <link linkend="kfilereplace-the-toolbar">Command action</link> button that enables the commands, and start the replacement process. There are also other commands, see <xref linkend="available-commands"/> for a list of all of them.
de: Angenommen, es soll der Ausdruck <quote>Lisis Abenteuer im Wunderland </quote> mit der <ulink url="http://www.textlibrary.com/download/alice-wo.txt">ganzen Datei, die Carrolls Erzählung enthält</ulink>, ersetzt werden. Möglicherweise soll dies nicht händisch geschehen, sondern mit einem Befehl. Klicken Sie das Symbol <link linkend="kfilereplace-the-toolbar"><guiicon>Hinzufügen</guiicon></link> an, wählen Sie <guilabel>Suchen und Ersetzen-Modus</guilabel> und geben Sie diesen Suchbegriff ein: <userinput>Lisis Abenteuer im Wunderland </userinput> im Suchbegriff-Editor und diesen Ersatzbegriff <userinput>[$loadfile:<replaceable>/Pfad_zu_meinem_Ordner/mein_Ordner/meine_Datei</replaceable>$]</userinput> im Ersatzbegriff-Editor. Bestätigen Sie mit <guibutton>OK</guibutton>. Im Hauptfenster von &kfilereplace; muss das Symbol <link linkend="kfilereplace-the-toolbar">Befehle ausführen</link> aktiviert sein. Starten Sie dann den Ersetzen-Vorgang. Es gibt noch viele andere Befehle, siehe die Liste in <xref linkend="available-commands"/>.

source: Credits and License
de: Danksagungen und Lizenz

source: &kfilereplace;. Program copyright 1999 by François Dupoux <email>dupoux&#64;dupoux&#46;com</email>, 2003 Andras Mantia <email>amantia&#64;kde&#46;org</email>, 2004 Emiliano Gulmini <email>emi_barbarossa&#64;yahoo&#46;it</email>
de: &kfilereplace;. Programm copyright 1999 by François Dupoux <email>dupoux&#64;dupoux&#46;com</email>, 2003 Andras Mantia <email>amantia&#64;kde&#46;org</email>, 2004 Emiliano Gulmini <email>emi_barbarossa&#64;yahoo&#46;it</email>

source: The &kfilereplace; authors and maintainers:
de: Die Autoren und Betreuer von &kfilereplace;:

source: Original author
de: Ursprünglicher Autor

source: Shell author, KPart creator, co-maintainer
de: Autor des Konsolenprogrammes, KPart-Ersteller, Co-Betreuer

source: Current maintainer, code cleaner &amp; rewriter
de: Aktueller Betreuer, Quelltextverbesserung

source: Documentation copyright 2004 Emiliano Gulmini <email>emi_barbarossa&#64;yahoo&#46;it</email>
de: Dokumentations-Copyright 2004 Emiliano Gulmini <email>emi_barbarossa&#64;yahoo&#46;it</email>

source: CREDIT_FOR_TRANSLATORS
de: <para>Deutsche Übersetzung von Georg Schuster<email>gschuster@utanet.at</email></para>

source: Installation and Compilation
de: Kompilierung und Installation

source: Requirements
de: Erfordernisse

source: In order to use the command <link linkend="available-commands">[$mathexp:<replaceable>some_math_expression</replaceable>$]</link> you should install the &bc; mathematical utility (version 1.06 or newer) written by Philip A. Nelson (<email>philnelson@acm.org</email>).
de: Zur Verwendung von Befehlen der Art <link linkend="available-commands">[$mathexp:<replaceable>irgendein_mathematischer_Ausdruck</replaceable>$]</link> sollte das mathematische Werkzeug &bc; (Version 1.06 oder neuer), entwickelt von Philip A. Nelson (<email>philnelson@acm.org</email>), installiert sein.

source: &kfilereplace; commands
de: &kfilereplace;-Befehle

source: [$loadfile:<replaceable>/my-path/my-directory/my-file</replaceable>$]
de: [$loadfile:<replaceable>/mein_Pfad/mein_Ordner/meine_Datei</replaceable>$]

source: [$random:<replaceable>AN_INTEGER_NUMBER</replaceable>$]
de: [$random:<replaceable>EINE_GANZZAHL</replaceable>$]

source: [$mathexp:<replaceable>bc-expression</replaceable>$]
de: [$mathexp:<replaceable>bc-Ausdruck</replaceable>$]

source: this command return the current date and time in &Qt; ISO format.
de: Dieser Befehl liefert das aktuelle Datum und die Uhrzeit im &Qt;-ISO-Format.

source: like above but in local format.
de: Wie oben, aber im lokalen Format.

source: return the UID of the current user.
de: Liefert die UID des aktuellen Benutzers.

source: return the GID of the current user.
de: Liefert die GID des aktuellen Benutzers.

source: return the login name of the current user.
de: Liefert den Anmeldenamen des aktuellen Benutzers.

source: return the full name of the current user.
de: Liefert den vollen Namen des aktuellen Benutzers.

source: return the home folder of the current user.
de: Liefert den Persönlichen Ordner des aktuellen Benutzers.

source: return the shell of the current user.
de: Liefert die Shell des aktuellen Benutzers.

source: return the content of the <emphasis>my-file</emphasis> file.
de: Liefert den Inhalt der <emphasis>meine_Datei</emphasis> Datei.

source: return the empty string.
de: Liefert eine leere Zeichenkette.

source: return a random number string using <emphasis>AN_INTEGER_NUMBER</emphasis> as the initial seed.
de: Liefert eine Zeichenkette mit einer Zufallszahl unter Verwendung <emphasis>EINER_GANZZAHL</emphasis> als Anfangs-Streuung.

source: like above, but without initial seed.
de: Wie oben, aber ohne Anfangs-Streuung.

source: return the result of a &bc; v1.06 mathematical expression.
de: Liefert das Ergebnis des mathematischen Ausdrucks aus &bc; V1.06.
