Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdewebdev/kimagemapeditor.po
Languages: de

source: The &kimagemapeditor; Handbook
de: Das Handbuch zu &kimagemapeditor;

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Georg</firstname><surname>Schuster</surname><affiliation><address><email>gschuster@utanet.at</email></address></affiliation><contrib>Übersetzung</contrib></othercredit>

source: &kimagemapeditor; is an &HTML; imagemap editor for &kde;.
de: &kimagemapeditor; ist ein Editor für &HTML;-Imagemaps für &kde;.

source: Using &kimagemapeditor;
de: Arbeiten mit &kimagemapeditor;

source: &kimagemapeditor; is a &HTML; imagemap editor for &kde;. It allows you to create and modify &HTML; <ulink url="http://en.wikipedia.org/wiki/Imagemap">Imagemaps.</ulink>
de: &kimagemapeditor; ist ein Editor für &HTML;-Imagemaps für &kde;. Mit dieser Anwendung können Sie &HTML;-<ulink url="http://en.wikipedia.org/wiki/Imagemap">Bildermaps</ulink> erstellen und bearbeiten.

source: Here's a screenshot of &kimagemapeditor;
de: Ein Bildschirmfoto von &kimagemapeditor;

source: Screenshot
de: Bildschirmfoto

source: &kimagemapeditor; main window.
de: Hauptfenster von &kimagemapeditor;

source: A common use case is a world map where each country is an imagemap. By clicking on a country in the map you can open a link to the selected country.
de: Ein häufiger Anwendungsfall ist zum Beispiel eine Weltkarte, auf der die Länder als Imagemap definiert sind. Durch Klicken auf ein Land in der Karte wird eine Verknüpfung zum ausgewählten Land geöffnet.

source: Creating an imagemap requires the following steps:
de: Ein Imagemap wird mit folgenden Schritten erstellt:

source: Load an image file (<filename class="extension">png</filename>, <filename class="extension">jpg</filename>, <filename class="extension">gif</filename>) or a &HTML; file from your disk or drag it into the image area. Select an image in the <guilabel>Images</guilabel> docker.
de: Laden Sie eine Bilddatei (<filename class="extension">png</filename>, <filename class="extension">jpg</filename>, <filename class="extension">gif</filename>) oder eine &HTML;-Datei von der Festplatte oder ziehen Sie eine Datei in den Bildbereich. Wählen Sie dann ein Bild im Abschnitt <guilabel>Bilder</guilabel>.

source: Add a imagemap using <menuchoice><guimenu>Map</guimenu><guimenuitem>New Map</guimenuitem></menuchoice> from the menu and enter a map name.
de: Fügen Sie ein Imagemap mit <menuchoice><guimenu>Karte</guimenu><guimenuitem>Neue Karte</guimenuitem></menuchoice> aus dem Menü hinzu und geben Sie einen Namen für die Karte ein.

source: Now the <guimenu>Tools</guimenu> menu is enabled and you can select the appropriate geometric shape like <guimenuitem>Circle</guimenuitem>, <guimenuitem>Rectangle</guimenuitem>, <guimenuitem>Polygon</guimenuitem> or <guimenuitem>Freehand Polygon</guimenuitem> and define a clickable area in the image.
de: Nun ist das Menü <guimenu>Extras</guimenu> aktiviert und Sie können eine passende geometrische Form wie zum Beispiel <guimenuitem>Kreis</guimenuitem>, <guimenuitem>Rechteck</guimenuitem>, <guimenuitem>Vieleck</guimenuitem> oder <guimenuitem>Freihand-Vieleck</guimenuitem> auswählen und einen anklickbaren Bereich im Bild festlegen.

source: The <guilabel>Area Tag Editor</guilabel> dialog is displayed. On the <guilabel>General</guilabel> tab enter the attributes <guilabel>HREF</guilabel> (a link's target &URL;), <guilabel>Alt.Text</guilabel>, <guilabel>Target</guilabel> and <guilabel>Title</guilabel>.
de: Der Dialog <guilabel>Bereichs-Tag-Editor</guilabel> wird jetzt angezeigt. Auf der Karteikarte <guilabel>Allgemein</guilabel> geben Sie die Attribute <guilabel>HREF</guilabel> (die Zieladdresse einer Verknüpfung), <guilabel>Ersatz.Text</guilabel>, <guilabel>Ziel</guilabel> und <guilabel>Titel</guilabel> ein.

source: The <guilabel>Coordinates</guilabel> tab shows the geometric data of the shape. Editing the value allows you to adjust size and position on the image as your changes are immediately visible in the image. Size and position can be altered using the mouse as well.
de: Die Karteikarte <guilabel>Koordinaten</guilabel> zeigt die geometrischen Daten des Objekts. Durch Ändern der geometrischen Werte passen Sie die Größe und Position im Bild an, alle Änderungen werden sofort im Bild sichtbar. Größe und Position können Sie auch mit der Maus verändern.

source: To open the <guilabel>Area Tag Editor</guilabel> dialog for an already defined imagemap use <guimenuitem>Properties</guimenuitem> from the <guimenu>Edit</guimenu> menu or the context menu of the region.
de: Um den Dialog <guilabel>Bereichs-Tag-Editor</guilabel> für ein bereits definiertes Imagemap zu öffnen, wählen Sie <guimenuitem>Eigenschaften</guimenuitem> aus dem Menü <guimenu>Bearbeiten</guimenu> oder aus dem Kontextmenü des ausgewählten Bereichs der Karte.

source: Use <menuchoice><guimenu>Map</guimenu><guimenuitem>Show HTML</guimenuitem></menuchoice> to view the generated &HTML; code of the map.
de: Benutzen Sie <menuchoice><guimenu>Karte</guimenu><guimenuitem>HTML anzeigen</guimenuitem></menuchoice>, um den generierten &HTML;-Quelltext der Karte anzuzeigen.

source: Next open <menuchoice><guimenu>Image</guimenu><guimenuitem>Edit Usemap...</guimenuitem></menuchoice> and enter the map name as usemap value. Save your work with <menuchoice><guimenu>File</guimenu> <guimenuitem>Save</guimenuitem></menuchoice>. Open the &HTML; file in &konqueror; to verify that the imagemap is working as expected.
de: Dann wählen Sie <menuchoice><guimenu>Bild</guimenu><guimenuitem>Usemap bearbeiten ...</guimenuitem></menuchoice> und geben den Namen der Karte als Wert des Usemap-Attributs ein. Speichern Sie Ihre Arbeit mit <menuchoice><guimenu>Datei</guimenu> <guimenuitem>Speichern</guimenuitem></menuchoice>. Öffnen Sie die &HTML;-Datei in &konqueror; und überprüfen Sie, ob die Verknüpfungen wie geplant funktionieren.

source: Configuration options of &kimagemapeditor; can be accessed by opening the configuration dialog with selecting <menuchoice> <guimenu>Settings</guimenu> <guimenuitem>Configure &kimagemapeditor;...</guimenuitem> </menuchoice> from the menu.
de: Alle Einstellungen für &kimagemapeditor; können Sie im Einrichtungsdialog bearbeiten. Öffnen Sie diesen Dialog mit <menuchoice> <guimenu>Einstellungen</guimenu> <guimenuitem>&kimagemapeditor; einrichten ...</guimenuitem> </menuchoice> aus dem Menü.

source: <screeninfo>Configuration dialog of &kimagemapeditor;</screeninfo>
de: <screeninfo>Einrichtungsdialog von &kimagemapeditor;</screeninfo>

source: <phrase>Configuration dialog of &kimagemapeditor;</phrase>
de: <phrase>Einrichtungsdialog von &kimagemapeditor;</phrase>

source: Configuration dialog of &kimagemapeditor;.
de: Einrichtungsdialog von &kimagemapeditor;

source: Credits and License
de: Danksagungen und Lizenz

source: Program copyright 2003-2007 Jan Sch&auml;fer <email>j_schaef&#64;informatik&#46;uni-kl&#46;de</email>
de: Programm Copyright 2003-2007 Jan Sch&auml;fer <email>j_schaef&#64;informatik&#46;uni-kl&#46;de</email>

source: Documentation copyright 2007 Jan Sch&auml;fer <email>j_schaef&#64;informatik&#46;uni-kl&#46;de</email>
de: Copyright der Dokumentation 2007 Jan Sch&auml;fer <email>j_schaef&#64;informatik&#46;uni-kl&#46;de</email>

source: CREDIT_FOR_TRANSLATORS
de: <para>Übersetzung Georg Schuster<email>gschuster@utanet.at</email></para>
