Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdewebdev/klinkstatus.po
Languages: de

source: The &klinkstatus; Handbook
de: Das Handbuch zu &klinkstatus;

source: <firstname></firstname> <othername></othername> <surname>Paulo Moura Guedes</surname>
de: <firstname>Paulo</firstname> <surname> Moura Guedes</surname>

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Georg</firstname><surname>Schuster</surname><affiliation><address><email>gschuster@utanet.at</email></address></affiliation><contrib>Deutsche Übersetzung</contrib></othercredit>

source: &klinkstatus; is a link checker for &kde;.
de: &klinkstatus; ist ein Verknüpfungs-Prüfprogramm für &kde;.

source: link checker
de: Verknüpfungs-Prüfprogramm

source: validation
de: Überprüfung

source: Introduction
de: Einführung

source: &klinkstatus; is a link checker for &kde;. It allows you to search internal and external links in your entire web site, just a single page and choose the depth to search. You can also check local files, ftp, fish, &etc;, as &klinkstatus; uses KIO. For performance, links can be checked simultaneously.
de: &klinkstatus; ist ein Verknüpfungs-Prüfprogramm für &kde;. Es ermöglicht die Suche interner und externer Verknüpfungen auf der gesamten Webseite oder einer einzelnen Seite und das Festlegen der Suchtiefe. Sie können auch lokale Dateien oder über ftp, fish &etc; prüfen, da &klinkstatus; &kde;-Ein-Ausgabemodule unterstützt. Zur Beschleunigung können die Verknüpfung gleichzeitig geprüft werden.

source: Application capabilities can be extended with <ulink url="http://techbase.kde.org/Development/Tutorials/Kross/Introduction">Kross scripting</ulink>.
de: Die Funktionen diese Programms können durch <ulink url="http://techbase.kde.org/Development/Tutorials/Kross/Introduction">Kross-Skripte</ulink> erweitert werden.

source: Using &klinkstatus;
de: Arbeiten mit &klinkstatus;

source: To check links on a web site or local file enter its address into the <guilabel>URL:</guilabel> field and hit &Enter;. You can also use folder icon to the right to navigate to the address needed using &GUI;.
de: Um Verknüpfungen in einer Webseite oder lokalen Datei zu prüfen, geben Sie die Adresse in das Feld <guilabel>URL:</guilabel> ein und drücken die Taste &Enter;. Sie können auch das Ordnersymbol rechts neben dem Eingabefeld benutzen, um eine Adresse im Dateiauswahldialog zu suchen.

source: Here's a screenshot of &klinkstatus;
de: Hier ist ein Bildschirmfoto von &klinkstatus;

source: Screenshot
de: Bildschirmfoto

source: &klinkstatus; is checking links on KDevelop web site. Broken and malformed links are marked with red.
de: &klinkstatus; überprüft hier gerade die Verknüpfungen auf der KDevelop-Webseite. Kaputte und ungültige Verknüpfungen sind rot markiert.

source: If access to the inspected data is restricted, please check the <guilabel>Login</guilabel> option. After hitting &Enter; in &URL; field or push <guibutton>Start Search</guibutton> button on the toolbar the following dialog will be shown to enter the credentials.
de: Ist der Zugang zu den zu untersuchenden Daten eingeschränkt, aktivieren Sie die Einstellung <guilabel>Anmeldung</guilabel>. Wenn Sie eine &URL; eingeben haben und die Taste &Enter; oder den Knopf <guibutton>Suche starten</guibutton> in der Werkzeugleiste drücken, wird der folgende Dialog zur Eingabe der Anmeldedaten angezeigt.

source: <screeninfo>Credentials dialog of &klinkstatus;</screeninfo>
de: <screeninfo>Dialog „Eingabe der Anmeldung“</screeninfo>

source: <phrase>Credentials dialog of &klinkstatus;</phrase>
de: <phrase>Dialog „Eingabe der Anmeldung“</phrase>

source: &klinkstatus; is asking you to enter the credentials.
de: &klinkstatus; fragt die Daten für die Anmeldung ab.

source: Enter the credentials and push <guibutton>OK</guibutton> button.
de: Geben Sie die Daten für die Anmeldung ein und drücken Sie <guibutton>OK</guibutton>.

source: You can narrow down the range of the links to be checked by unchecking <guilabel>Check external links</guilabel> item (if external links need not to be checked) or entering regular expression into <guilabel>Do not check Regular Expression</guilabel> field.
de: Um den Umfang der Prüfung von Verknüpfungen einzuschränken, können Sie <guilabel>Externe Verknüpfungen prüfen</guilabel> abschalten, wenn diese Funktion nicht benötigt wird, oder reguläre Ausdrücke in das Feld <guilabel>Reguläre Ausdrücke nicht prüfen</guilabel> eintragen.

source: Search results can be filtered using <guilabel>Search</guilabel> field or <guilabel>Status</guilabel> drop-down menu (<guimenuitem>All Links</guimenuitem>, <guimenuitem>Good Links</guimenuitem>, <guimenuitem>Broken Links</guimenuitem>, <guimenuitem>Malformed Links</guimenuitem>, or <guimenuitem>Undetermined Links</guimenuitem>).
de: Die Ergebnisse der Suche können Sie filtern, indem Sie das Feld <guilabel>Suche</guilabel> verwenden oder im Auswahlfeld <guilabel>Status</guilabel> <guimenuitem>Alle Verknüpfungen</guimenuitem>, <guimenuitem>Gültige Verknüpfungen</guimenuitem>, <guimenuitem>Kaputte Verknüpfungen</guimenuitem>, <guimenuitem>Ungültige Verknüpfungen</guimenuitem>, oder <guimenuitem>Unbestimmte Verknüpfungen</guimenuitem> wählen.

source: From the context menu of each item in search results you can <guimenuitem>Recheck</guimenuitem> item, <guisubmenu>Edit Referrer</guisubmenu> in the default editor, <guimenuitem>Open URL</guimenuitem>, <guimenuitem>Open Referrer URL</guimenuitem>, <guimenuitem>Copy URL</guimenuitem>, <guimenuitem>Copy Referrer URL</guimenuitem>, or <guimenuitem>Copy Cell Text</guimenuitem>.
de: Im Kontextmenü jedes Eintrags in den Suchergebnissen können Sie einen Eintrag <guimenuitem>Erneut prüfen</guimenuitem>, im eingestellten Standardeditor <guisubmenu>Referrer bearbeiten</guisubmenu>, die <guimenuitem>URL öffnen</guimenuitem>, die <guimenuitem>Referrer-URL öffnen</guimenuitem>, die <guimenuitem>URL kopieren</guimenuitem>, die <guimenuitem>Referrer-URL kopieren</guimenuitem> oder den <guimenuitem>Zelleninhalt kopieren</guimenuitem>.

source: The check results can be saved as &XML; site map using <menuchoice><guimenu>File</guimenu><guimenuitem>Create Site Map...</guimenuitem></menuchoice> menu item, or exported as &HTML; using <menuchoice><guimenu>File</guimenu><guisubmenu>Export to HTML</guisubmenu></menuchoice>. You can choose to export <guimenuitem>All</guimenuitem> or just <guimenuitem>Broken</guimenuitem> links. An option <guimenuitem>Download New Stylesheets</guimenuitem> to use stylesheets from Get Hot New Stuff repository for export is also implemented.
de: Die Ergebnisse der Suche kann als &XML;-Sitemap mit <menuchoice><guimenu>Datei</guimenu><guimenuitem>Sitemap erstellen ...</guimenuitem></menuchoice> aus dem Menü oder im &HTML;-Format mit <menuchoice><guimenu>Datei</guimenu><guisubmenu>Als HTML exportieren</guisubmenu></menuchoice> gespeichert werden. Dabei können Sie auswählen, ob <guimenuitem>Alle</guimenuitem> oder nur <guimenuitem>Kaputte</guimenuitem> Verknüpfungen exportiert werden sollen. Mit <guimenuitem>Neue Stilvorlagen herunterladen</guimenuitem> erhalten Sie neue Exportvorlagen aus dem Archiv „Neue Erweiterungen“.

source: Configuring &klinkstatus;
de: Einrichtung von &klinkstatus;

source: Configuration options of &klinkstatus; can be accessed by opening the configuration dialog with selecting <menuchoice> <guimenu>Settings</guimenu> <guimenuitem>Configure &klinkstatus;...</guimenuitem> </menuchoice> from the menu.
de: Alle Einstellungen für &klinkstatus; können Sie im Einrichtungsdialog bearbeiten. Öffnen Sie diesen Dialog mit <menuchoice> <guimenu>Einstellungen</guimenu> <guimenuitem>&klinkstatus; einrichten ...</guimenuitem> </menuchoice> aus dem Menü.

source: Configure &klinkstatus; Dialog
de: Einrichtungsdialog von &klinkstatus;

source: Check
de: Prüfen

source: In the <guilabel>Check</guilabel> page, you can change the default check parameters. This page is divided into three panes (<guilabel>Network</guilabel>, <guilabel>Input</guilabel>, and <guilabel>Quanta</guilabel>) with additional checkbox <guilabel>Remember settings when exit</guilabel>. If the latter is checked, &klinkstatus; remember configured settings when you exit &klinkstatus; and restore them during the next application run.
de: Auf der Seite <guilabel>Prüfen</guilabel> können die Standardparameter für die Überprüfung eingestellt werden. Die Seite enthält die drei Bereiche <guilabel>Netzwerk</guilabel>, <guilabel>Eingabe</guilabel> und <guilabel>Quanta</guilabel>, dazu noch das Ankreuzfeld <guilabel>Einstellungen beim Beenden merken</guilabel>. Mit dieser Einstellung werden die eingegebenen Parameter beim Beenden gespeichert und beim nächsten Start von &klinkstatus; wieder geladen.

source: The <guilabel>Network</guilabel> pane can be used to choose the <guilabel>Number of simultaneous connections</guilabel> and <guilabel>Timeout in seconds</guilabel>.
de: Im Bereich <guilabel>Netzwerk</guilabel> kann die <guilabel>Anzahl gleichzeitiger Verbindungen</guilabel> und die <guilabel>Wartezeit in Sekunden</guilabel> eingegeben werden.

source: You can change the <guilabel>Number of items in &URL; history</guilabel> (default is 50) and the <guilabel>Depth</guilabel> of check (can be overriden with &klinkstatus; main window, 0 for <guilabel>Unlimited</guilabel>). You can also decide if &klinkstatus; should <guilabel>Check parent folders</guilabel> and <guilabel>Check external links</guilabel> (can be overriden with &klinkstatus; main window).
de: Als Standard ist die <guilabel>Anzahl der Einträge im URL-Verlauf</guilabel> auf 50 und die <guilabel>Tiefe</guilabel> der Suche auf <guilabel>unbegrenzt</guilabel> eingestellt. Der Wert der <guilabel>Tiefe</guilabel> der Suche kann im Hauptfenster von &klinkstatus; überschrieben werden, ebenso wie die nächsten beiden Einstellungen <guilabel>Übergeordnete Ordner prüfen</guilabel> und <guilabel>Externe Verknüpfungen prüfen</guilabel>.

source: The <guilabel>Quanta</guilabel> pane is used to control &quantaplus; integration of &klinkstatus;. Check <guilabel>Use preview prefix</guilabel> if you want to use &quantaplus;'s project preview prefix in the &URL; to check.
de: Im Abschnitt <guilabel>Quanta</guilabel> steuern Sie die Einbindung von &klinkstatus; in &quantaplus;. Aktivieren Sie <guilabel>Vorschau-Präfix verwenden</guilabel>, wenn Sie den Vorschau-Präfix für Projekte in &quantaplus; in der zu überprüfenden &URL; benutzen möchten.

source: Results
de: Ergebnisse

source: Using the <guilabel>Results</guilabel> page you can choose format of the check results list. <guilabel>Tree</guilabel> is the default tree view and <guilabel>Flat</guilabel> is the flat list (can be faster on low-end machines). You can also let &klinkstatus; <guilabel>Follow Last Link Checked</guilabel> and define <guilabel>Preferred Style Sheet</guilabel> for the check list. The new stylesheets can be downloaded from the Get Hot New Stuff repository using <menuchoice><guimenu>File</guimenu> <guisubmenu>Export to HTML</guisubmenu> <guimenuitem>Download New Stylesheets</guimenuitem></menuchoice> menu item.
de: Auf dieser Seite wird das Ansichtsformat der Liste mit den Prüfergebnissen eingestellt. Es stehen eine <guilabel>Baumansicht</guilabel> und die Ansicht <guilabel>Flach (schneller)</guilabel> zur Auswahl. Die letzte Einstellung ist vor allem bei leistungsschwachen Rechnern sinnvoll. Außerdem wird festgelegt, ob &klinkstatus; <guilabel>Der zuletzt geprüften Verknüpfung folgen</guilabel> soll. Wählen Sie eine <guilabel>Bevorzugte Stilvorlage</guilabel> für den Export von Prüfergebnissen. Weitere Vorlagen aus dem Archiv „Neue Erweiterungen“ erhalten Sie mit <menuchoice><guimenu>Datei</guimenu> <guisubmenu>Als HTML exportieren</guisubmenu> <guimenuitem>Neue Stilvorlagen herunterladen</guimenuitem></menuchoice> im Menü.

source: Identification
de: Browserkennung

source: Using the <guilabel>Identification</guilabel> page you can configure the way &klinkstatus; reports itself to the server that stores the page checked. You can choose to <guilabel>Send Identification</guilabel>. Use <guibutton>Default</guibutton> button to set the default identification of &konqueror;. <guilabel>Identity</guilabel> pane can be used to choose your identity for authentication on the server.
de: Auf dieser Seite stellen Sie die <guilabel>Browserkennung</guilabel> ein, die &klinkstatus; an den Server übergibt, der die zu prüfenden Seiten gespeichert hat. <guilabel>Kennung senden</guilabel> kann auch abgeschaltet werden. Drücken Sie auf <guibutton>Standard</guibutton>, dann wird die Browserkennung von &konqueror; übernommen. Im Abschnitt <guilabel>Identität</guilabel> tragen Sie den Namen und die E-Mail-Adresse für die Anmeldung beim Server ein.

source: Mail Transport
de: E-Mail-Transport

source: Using the <guilabel>Mail Transport</guilabel> page, you can configure email account which receives &klinkstatus; scheduled check results.
de: Auf der Seite <guilabel>E-Mail-Transport</guilabel> geben Sie einen E-Mail-Zugang an, an den die Ergebnisse der von &klinkstatus; durchgeführten Prüfung geschickt werden.

source: Credits and License
de: Danksagungen und Lizenz

source: Program copyright 2004 Paulo Moura Guedes <email>pmg&#64;netcabo&#46;pt</email>
de: Copyright des Programms 2004 Paulo Moura Guedes <email>pmg&#64;netcabo&#46;pt</email>

source: Documentation copyright 2004 Paulo Moura Guedes <email>pmg&#64;netcabo&#46;pt</email>
de: Copyright der Dokumentation 2004 Paulo Moura Guedes <email>pmg&#64;netcabo&#46;pt</email>

source: CREDIT_FOR_TRANSLATORS
de: <para>Georg Schuster und Stephan Johach für die deutsche Übersetzung </para>

source: Installation and Compilation
de: Kompilierung und Installation
