Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdewebdev/kommander_tutorials.po
Languages: de

source: Tutorials
de: Anleitungen

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Georg</firstname><surname>Schuster</surname><affiliation><address><email>gschuster@utanet.at</email></address></affiliation><contrib>Deutsche Übersetzung</contrib></othercredit>

source: Using Editor
de: Die Benutzung des Editors

source: This might go in the editor section.
de: Dies könnte im Bereich Editor stehen.

source: Shows using global and setGlobal &DCOP; calls to provide global variables for script
de: Zeigt, wie globale und setGlobal &DCOP;-Aufrufe für globale Variablen in Skripten funktionieren

source: Shows how to use both local and external &DCOP; calls to communicate with external application.
de: Zeigt, wie sowohl lokale als auch externe &DCOP;-Aufrufe zur Kommunikation mit externen Anwendungen genutzt werden können.

source: Shows how to use connections/slot to handle events. Both population and standard slots are used.
de: Zeigt, wie man Verbindungen/Slots zur Behandlung von Ereignissen nutzt. Sowohl Population- als auch Standard-Slots werden verwendet.

source: Shows how to use @readSetting and @writeSetting functions to write/restore widget content. Also, show how to use populate() slot to initialize widget content.
de: Zeigt die Verwendung der @readSetting und @writeSetting Funktion zum Schreiben/Wiederherstellen des Inhaltes von Bedienelementen. Zusätzlich, wie populate() Slot zur Voreinstellung von Bedienelement-Inhalten genutzt werden kann.

source: Shows how you can append text to TextEdit and how you can use it to display formatted text.
de: Zeigt, wie Text an ein TextEdit angehängt werden kann und wie Text formatiert angezeigt wird.

source: Command Line
de: Befehlszeile

source: Shows how you can pass parameters to &kommander; dialog via command line. Also, shows how to change list content and button text.
de: Zeigt die Übergabe von Parametern an &kommander;-Dialoge über die Befehlszeile und wie Listeninhalte und Schaltflächentexte geändert werden.

source: Shows how you use 'initialization' to 'destroy' scripts of main dialog to initialize and store some settings.
de: Zeigt die Verwendung einer Initialisierung, um Skripte vom Hauptdialog zurückzusetzen und einige Einstellungen zu speichern.
