Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdewebdev/kommander_editor.po
Languages: de

source: The Editor
de: Der Editor

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Georg</firstname><surname>Schuster</surname><affiliation><address><email>gschuster@utanet.at</email></address></affiliation><contrib>Deutsche Übersetzung</contrib></othercredit>

source: The editor is based on &designer;, a tool for designing and implementing user interfaces created by <ulink url="http://www.trolltech.com">Trolltech</ulink>. We have modified &designer; in the following ways:
de: Der Editor basiert auf &designer;, eine Design- und Implementierungswerkzeug für Benutzeroberflächen von <ulink url="http://www.trolltech.com">Trolltech</ulink>. Wir haben &designer; in folgender Weise angepasst:

source: Its interface is much simpler
de: Die Oberfläche ist viel einfacher

source: Built in our own widgets
de: Eigene Bedienelemente hinzugefügt

source: Added the ability to setup &kommander; Text
de: Die Fähigkeit, &kommander;-Text zu verwalten, eingebaut

source: Various other superficial changes
de: Weitere Änderungen an der Oberfläche

source: For those of you already familiar with using &designer;, using the &kmdr-editor; will be trivial.
de: Wer sich im &designer; auskennt, für den ist die Benutzung von &kmdr-editor; geradezu trivial.

source: Main Window
de: Hauptfenster

source: Toolbars contain a number of buttons to provide quick access to number of functions.
de: Werkzeugleisten enthalten Symbole für den Schnellzugriff auf eine Vielzahl von Funktionen.

source: The File Overview displays all of the files. Use the search field to rapidly switch between files.
de: Die Dateiübersicht zeigt alle Dateien an. Mit dem Suchfeld kann schnell zwischen Dateien gewechselt werden.

source: The Object Explorer provides an overview of the relationships between the widgets in a form. It is useful for selecting widgets in a form with a complex layout.
de: Der Objekt-Explorer liefert eine Übersicht der Beziehungen zwischen den Bedienelementen eines Dialoges. Dies ist nützlich beim Auswählen von Bedienelementen in einem Dialog mit komplexen Zusammenhängen.

source: The Property Editor is where the behavior and apperance of a widget is changed.
de: Im Eigenschaften-Editor kann das Aussehen und Verhalten eines Bedienelementes verändert werden.

source: The Dialog Editor is where dialogs are created and edited.
de: Der Dialog-Editor dient zur Erstellung und Bearbeitung von Dialogen.

source: The File Menu
de: Das Menü <guimenu>Datei</guimenu>

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>New</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>N</keycap></keycombo> </shortcut> <guimenu>Datei</guimenu> <guimenuitem>Neu</guimenuitem>

source: Creates a new dialog
de: Erstellt einen neuen Dialog

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>O</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Open</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>O</keycap></keycombo> </shortcut> <guimenu>Datei</guimenu> <guimenuitem>Öffnen</guimenuitem>

source: Search the file system to open an existing dialog
de: Einen bestehenden Dialog im Dateisystem suchen

source: <guimenu>File</guimenu> <guimenuitem>Close</guimenuitem>
de: <guimenu>Datei</guimenu> <guimenuitem>Schließen</guimenuitem>

source: Closes the active dialog
de: Schließt den aktuellen Dialog

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>S</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Save</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>S</keycap></keycombo> </shortcut> <guimenu>Datei</guimenu> <guimenuitem>Speichern</guimenuitem>

source: Saves the active dialog
de: Speichert den aktuellen Dialog

source: <guimenu>File</guimenu> <guimenuitem>Save As</guimenuitem>
de: <guimenu>Datei</guimenu> <guimenuitem>Speichern unter ...</guimenuitem>

source: Saves the active dialog with another name
de: Speichert den aktuellen Dialog mit einem anderen Namen

source: <guimenu>File</guimenu> <guimenuitem>Save All</guimenuitem>
de: <guimenu>Datei</guimenu> <guimenuitem>Alles Speichern</guimenuitem>

source: Saves all open dialogs
de: Speichert alle geöffneten Dialoge

source: <guimenu>File</guimenu> <guimenuitem>Recently Opened Files</guimenuitem>
de: <guimenu>Datei</guimenu> <guimenuitem>Kürzlich geöffnete Dateien</guimenuitem>

source: Quick list of the last several files you've opened. This list will change each time you open a file that is not on it with the oldest being bumped off first.
de: Liste der zuletzt geöffneten Dateien. Diese Liste ändert sich mit jeder geöffneten Datei, die noch nicht darin enthalten war, wobei die ältest geöffnete Datei herausfällt.

source: <guimenu>File</guimenu> <guimenuitem>Exit</guimenuitem>
de: <guimenu>Datei</guimenu> <guimenuitem>Beenden</guimenuitem>

source: <action>Quits</action> &kommander;
de: <action>Beendet</action> &kommander;

source: The Edit Menu
de: Das Menü <quote>Bearbeiten</quote>

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Z</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Undo</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Z</keycap></keycombo> </shortcut> <guimenu>Bearbeiten</guimenu> <guimenuitem>Rückgängig</guimenuitem>

source: Undo the last action performed.
de: Nimmt die zuletzt ausgeführte Aktion zurück.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Y</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Redo</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Y</keycap></keycombo> </shortcut> <guimenu>Bearbeiten</guimenu> <guimenuitem>Wiederherstellen</guimenuitem>

source: Redo the last action undone.
de: Stellt die zuletzt rückgängig gemachte Aktion wieder her.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>X</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Cut</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>X</keycap></keycombo> </shortcut> <guimenu>Bearbeiten</guimenu> <guimenuitem>Ausschneiden</guimenuitem>

source: Cut the current item and place it content on the clipboard.
de: Schneidet die aktuelle Auswahl aus und überträgt den Inhalt in die Zwischenablage.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>C</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Copy</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>C</keycap></keycombo> </shortcut> <guimenu>Bearbeiten</guimenu> <guimenuitem>Kopieren</guimenuitem>

source: Copy the current item to the clipbard.
de: Kopiert die Auswahl in die Zwischenablage.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>V</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Paste</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>V</keycap></keycombo> </shortcut> <guimenu>Bearbeiten</guimenu> <guimenuitem>Einfügen</guimenuitem>

source: Paste the contents of the clipboard at the current cursor position.
de: Fügt den Inhalt der Zwischenablage an der aktuellen Cursor-Position ein.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Z</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Delete</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>Z</keycap></keycombo> </shortcut> <guimenu>Bearbeiten</guimenu> <guimenuitem>Löschen</guimenuitem>

source: Delete the current item.
de: Löscht das aktuelle Element.

source: <shortcut> <keycap>Del</keycap> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Select All</guimenuitem>
de: <shortcut> <keycap>Entf</keycap> </shortcut> <guimenu>Bearbeiten</guimenu> <guimenuitem>Alles auswählen</guimenuitem>

source: Select all of the items in the current dialog.
de: Wähle alle Elemente des aktuellen Dialoges aus.

source: <shortcut> <keycombo action="simul">&Alt;<keycap>R</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Check Accelerators</guimenuitem>
de: <shortcut> <keycombo action="simul">&Alt;<keycap>R</keycap></keycombo> </shortcut> <guimenu>Bearbeiten</guimenu> <guimenuitem>Tastenkürzel prüfen</guimenuitem>

source: Verifies that all the accelerators are used only once.
de: Überprüft die Einzigartigkeit aller Tastenkürzel.

source: <shortcut> <keycombo action="simul">&Alt;<keycap>S</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Script Objects</guimenuitem>
de: <shortcut> <keycombo action="simul">&Alt;<keycap>S</keycap></keycombo> </shortcut> <guimenu>Bearbeiten</guimenu> <guimenuitem>Skriptobjekte</guimenuitem>

source: <guimenu>Edit</guimenu> <guimenuitem>Slots</guimenuitem>
de: <guimenu>Bearbeiten</guimenu> <guimenuitem>Slots</guimenuitem>

source: Displays window to edit and create slots and functions.
de: Zeigt ein Bearbeitungsfenster für die Erstellung und Bearbeitung von Funktionen und Slots an.

source: <guimenu>Edit</guimenu> <guimenuitem>Connectors</guimenuitem>
de: <guimenu>Bearbeiten</guimenu> <guimenuitem>Verbindungen</guimenuitem>

source: Displays the view and edit connections dialog.
de: Zeigt den Anzeige- und Bearbeitungsdialog für Verbindungen an.

source: <guimenu>Edit</guimenu> <guimenuitem>Form Setting</guimenuitem>
de: <guimenu>Bearbeiten</guimenu> <guimenuitem>Formular-Einstellungen</guimenuitem>

source: Displays the form setting dialog.
de: Öffnet den Dialog für die Formular-Einstellungen.

source: <guimenu>Edit</guimenu> <guimenuitem>Preferences</guimenuitem>
de: <guimenu>Bearbeiten</guimenu> <guimenuitem>Einstellungen</guimenuitem>

source: Displays the preferences dialog.
de: Zeigt den Dialog Programm-Einstellungen an.

source: The Tools Menu
de: Das Menü Extras

source: <shortcut> <keycap>F2</keycap> </shortcut> <guimenu>Tools</guimenu> <guimenuitem>Pointer</guimenuitem>
de: <shortcut> <keycap>F2</keycap> </shortcut> <guimenu>Extras</guimenu> <guimenuitem>Mauszeiger</guimenuitem>

source: <shortcut> <keycap>F3</keycap> </shortcut> <guimenu>Tools</guimenu> <guimenuitem>Connect Signal/Slots</guimenuitem>
de: <shortcut> <keycap>F3</keycap> </shortcut> <guimenu>Extras</guimenu> <guimenuitem>Signal/Slots verbinden</guimenuitem>

source: <shortcut> <keycap>F3</keycap> </shortcut> <guimenu>Tools</guimenu> <guimenuitem>Tab Order</guimenuitem>
de: <shortcut> <keycap>F4</keycap> </shortcut> <guimenu>Extras</guimenu> <guimenuitem>Reihenfolge der Unterfenster</guimenuitem>

source: <guimenu>Tools</guimenu> <guisubmenu>Kommander</guisubmenu>
de: <guimenu>Extras</guimenu> <guisubmenu>Kommander</guisubmenu>

source: <guimenu>Tools</guimenu> <guisubmenu>Kommander</guisubmenu> <guimenuitem>TextLabel</guimenuitem>
de: <guimenu>Extras</guimenu> <guisubmenu>Kommander</guisubmenu> <guimenuitem>Label</guimenuitem>

source: <guimenu>Tools</guimenu> <guisubmenu>Kommander</guisubmenu> <guimenuitem>PixelmapLabel</guimenuitem>
de: <guimenu>Extras</guimenu> <guisubmenu>Kommander</guisubmenu> <guimenuitem>PixelmapLabel</guimenuitem>

source: <guimenu>Tools</guimenu> <guisubmenu>Kommander</guisubmenu> <guimenuitem>ListView</guimenuitem>
de: <guimenu>Extras</guimenu> <guisubmenu>Kommander</guisubmenu> <guimenuitem>ListView</guimenuitem>

source: <guimenu>Tools</guimenu> <guisubmenu>Kommander</guisubmenu> <guimenuitem>ListBox</guimenuitem>
de: <guimenu>Extras</guimenu> <guisubmenu>Kommander</guisubmenu> <guimenuitem>ListBox</guimenuitem>

source: <guimenu>Tools</guimenu> <guisubmenu>Kommander</guisubmenu> <guimenuitem>SubDialog</guimenuitem>
de: <guimenu>Extras</guimenu> <guisubmenu>Kommander</guisubmenu> <guimenuitem>SubDialog</guimenuitem>

source: <guimenu>Tools</guimenu> <guisubmenu>Kommander</guisubmenu> <guimenuitem>TabWidget</guimenuitem>
de: <guimenu>Extras</guimenu> <guisubmenu>Kommander</guisubmenu> <guimenuitem>TabWidget</guimenuitem>

source: <guimenu>Tools</guimenu> <guisubmenu>Kommander</guisubmenu> <guimenuitem>LineEdit</guimenuitem>
de: <guimenu>Extras</guimenu> <guisubmenu>Kommander</guisubmenu> <guimenuitem>LineEdit</guimenuitem>

source: <guimenu>Tools</guimenu> <guisubmenu>Kommander</guisubmenu> <guimenuitem>ExecButton</guimenuitem>
de: <guimenu>Extras</guimenu> <guisubmenu>Kommander</guisubmenu> <guimenuitem>ExecButton</guimenuitem>

source: <guimenu>Tools</guimenu> <guisubmenu>Kommander</guisubmenu> <guimenuitem>CloseButton</guimenuitem>
de: <guimenu>Extras</guimenu> <guisubmenu>Kommander</guisubmenu> <guimenuitem>CloseButton</guimenuitem>

source: <guimenu>Tools</guimenu> <guisubmenu>Kommander</guisubmenu> <guimenuitem>FileSelector</guimenuitem>
de: <guimenu>Extras</guimenu> <guisubmenu>Kommander</guisubmenu> <guimenuitem>FileSelector</guimenuitem>

source: <guimenu>Tools</guimenu> <guisubmenu>Kommander</guisubmenu> <guimenuitem>TextEdit</guimenuitem>
de: <guimenu>Extras</guimenu> <guisubmenu>Kommander</guisubmenu> <guimenuitem>TextEdit</guimenuitem>

source: <guimenu>Tools</guimenu> <guisubmenu>Kommander</guisubmenu> <guimenuitem>RadioButton</guimenuitem>
de: <guimenu>Extras</guimenu> <guisubmenu>Kommander</guisubmenu> <guimenuitem>RadioButton</guimenuitem>

source: <guimenu>Tools</guimenu> <guisubmenu>Kommander</guisubmenu> <guimenuitem>ButtonGroup</guimenuitem>
de: <guimenu>Extras</guimenu> <guisubmenu>Kommander</guisubmenu> <guimenuitem>ButtonGroup</guimenuitem>

source: <guimenu>Tools</guimenu> <guisubmenu>Kommander</guisubmenu> <guimenuitem>GroupBox</guimenuitem>
de: <guimenu>Extras</guimenu> <guisubmenu>Kommander</guisubmenu> <guimenuitem>GroupBox</guimenuitem>

source: <guimenu>Tools</guimenu> <guisubmenu>Kommander</guisubmenu> <guimenuitem>CheckBox</guimenuitem>
de: <guimenu>Extras</guimenu> <guisubmenu>Kommander</guisubmenu> <guimenuitem>CheckBox</guimenuitem>

source: <guimenu>Tools</guimenu> <guisubmenu>Kommander</guisubmenu> <guimenuitem>ComboBox</guimenuitem>
de: <guimenu>Extras</guimenu> <guisubmenu>Kommander</guisubmenu> <guimenuitem>ComboBox</guimenuitem>

source: <guimenu>Tools</guimenu> <guisubmenu>Kommander</guisubmenu> <guimenuitem>SpinBoxInt</guimenuitem>
de: <guimenu>Extras</guimenu> <guisubmenu>Kommander</guisubmenu> <guimenuitem>SpinBoxInt</guimenuitem>

source: <guimenu>Tools</guimenu> <guisubmenu>Kommander</guisubmenu> <guimenuitem>RichTextEditor</guimenuitem>
de: <guimenu>Extras</guimenu> <guisubmenu>Kommander</guisubmenu> <guimenuitem>RichTextEditor</guimenuitem>

source: <guimenu>Tools</guimenu> <guisubmenu>Kommander</guisubmenu> <guimenuitem>TreeWidget</guimenuitem>
de: <guimenu>Extras</guimenu> <guisubmenu>Kommander</guisubmenu> <guimenuitem>TreeWidget</guimenuitem>

source: <guimenu>Tools</guimenu> <guisubmenu>Kommander</guisubmenu> <guimenuitem>Unknown</guimenuitem>
de: <guimenu>Extras</guimenu> <guisubmenu>Kommander</guisubmenu> <guimenuitem>Unbekannt</guimenuitem>

source: <guimenu>Tools</guimenu> <guisubmenu>Kommander</guisubmenu> <guimenuitem>Wizard</guimenuitem>
de: <guimenu>Extras</guimenu> <guisubmenu>Kommander</guisubmenu> <guimenuitem>Wizard</guimenuitem>

source: <guimenu>Tools</guimenu> <guisubmenu>Custom</guisubmenu>
de: <guimenu>Extras</guimenu> <guisubmenu>Anpassung</guisubmenu>

source: <guimenu>Tools</guimenu> <guisubmenu>Custom</guisubmenu> <guimenuitem>Edit Custom Widgets</guimenuitem>
de: <guimenu>Extras</guimenu> <guisubmenu>Anpassung</guisubmenu> <guimenuitem>Bearbeite angepasste Bedienelemente</guimenuitem>

source: The Layout Menu
de: Das Menü Anordnung

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>J</keycap></keycombo> </shortcut> <guimenu>Layout</guimenu> <guimenuitem>Adjust Size</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>J</keycap></keycombo> </shortcut> <guimenu>Anordnung</guimenu> <guimenuitem>Größe anpassen</guimenuitem>

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>H</keycap></keycombo> </shortcut> <guimenu>Layout</guimenu> <guimenuitem>Lay Out Horizontally</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>H</keycap></keycombo> </shortcut> <guimenu>Anordnung</guimenu> <guimenuitem>Horizontal anordnen</guimenuitem>

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>L</keycap></keycombo> </shortcut> <guimenu>Layout</guimenu> <guimenuitem>Lay Out Vertically</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>L</keycap></keycombo> </shortcut> <guimenu>Anordnung</guimenu> <guimenuitem>Vertikal anordnen</guimenuitem>

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>G</keycap></keycombo> </shortcut> <guimenu>Layout</guimenu> <guimenuitem>Lay Out in a Grid</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>G</keycap></keycombo> </shortcut> <guimenu>Anordnung</guimenu> <guimenuitem>In einem Raster anordnen</guimenuitem>

source: <guimenu>Layout</guimenu> <guimenuitem>Lay Out Horzontially (in Splitter)</guimenuitem>
de: <guimenu>Anordnung</guimenu> <guimenuitem>Horizontal setzen (in Splitter)</guimenuitem>

source: <guimenu>Layout</guimenu> <guimenuitem>Lay Out Vertically (in Splitter)</guimenuitem>
de: <guimenu>Anordnung</guimenu> <guimenuitem>Vertikal setzen (in Splitter)</guimenuitem>

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>B</keycap></keycombo> </shortcut> <guimenu>Layout</guimenu> <guimenuitem>Break Layout</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>B</keycap></keycombo> </shortcut> <guimenu>Anwendung</guimenu> <guimenuitem>Anordnung auflösen</guimenuitem>

source: <guimenu>Layout</guimenu> <guimenuitem>Add Spacer</guimenuitem>
de: <guimenu>Anwendung</guimenu> <guimenuitem>Hinzufügen Spacer</guimenuitem>

source: The Run Menu
de: Das Menü Ausführen

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>R</keycap></keycombo> </shortcut> <guimenu>Run</guimenu> <guimenuitem>Run Dialog</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>R</keycap></keycombo> </shortcut> <guimenu>Ausführen</guimenu> <guimenuitem>Dialog ausführen</guimenuitem>

source: Runs the current dialog.
de: Führt den aktuellen Dialog aus.

source: The Window Menu
de: Das Menü Fenster

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>F4</keycap></keycombo> </shortcut> <guimenu>Window</guimenu> <guimenuitem>Close</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>F4</keycap></keycombo> </shortcut> <guimenu>Fenster</guimenu> <guimenuitem>Schließen</guimenuitem>

source: Closes current dialog.
de: Schließt den aktuellen Dialog.

source: <guimenu>Window</guimenu> <guimenuitem>Close All</guimenuitem>
de: <guimenu>Fenster</guimenu> <guimenuitem>Alle schließen</guimenuitem>

source: Closes all dialogs.
de: Schließt alle Dialoge.

source: <shortcut> <keycombo action="simul">&Ctrl;<keycap>F6</keycap></keycombo> </shortcut> <guimenu>Window</guimenu> <guimenuitem>Next</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;<keycap>F6</keycap></keycombo> </shortcut> <guimenu>Fenster</guimenu> <guimenuitem>Nächste</guimenuitem>

source: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>F6</keycap></keycombo> </shortcut> <guimenu>Window</guimenu> <guimenuitem>Previous</guimenuitem>
de: <shortcut> <keycombo action="simul">&Ctrl;&Shift;<keycap>F6</keycap></keycombo> </shortcut> <guimenu>Fenster</guimenu> <guimenuitem>Vorige</guimenuitem>

source: <guimenu>Window</guimenu> <guimenuitem>Tile</guimenuitem>
de: <guimenu>Fenster</guimenu> <guimenuitem>Gekachelt</guimenuitem>

source: <guimenu>Window</guimenu> <guimenuitem>Cascade</guimenuitem>
de: <guimenu>Fenster</guimenu> <guimenuitem>Gestaffelt</guimenuitem>

source: <guimenu>Window</guimenu> <guisubmenu>Views</guisubmenu>
de: <guimenu>Fenster</guimenu> <guisubmenu>Ansichten</guisubmenu>

source: <guimenu>Window</guimenu> <guisubmenu>Views</guisubmenu> <guimenuitem>File Overview</guimenuitem>
de: <guimenu>Fenster</guimenu> <guisubmenu>Ansichten</guisubmenu> <guimenuitem>Dateiübersicht</guimenuitem>

source: <guimenu>Window</guimenu> <guisubmenu>Views</guisubmenu> <guimenuitem>Object Explorer</guimenuitem>
de: <guimenu>Fenster</guimenu> <guisubmenu>Ansichten</guisubmenu> <guimenuitem>Objekt-Explorer</guimenuitem>

source: <guimenu>Window</guimenu> <guisubmenu>Views</guisubmenu> <guimenuitem>Property Editor/Signal Handlers</guimenuitem>
de: <guimenu>Fenster</guimenu> <guisubmenu>Ansichten</guisubmenu> <guimenuitem>Eigenschaften-Editor/Signalbehandlung</guimenuitem>

source: <guimenu>Window</guimenu> <guisubmenu>Views</guisubmenu> <guimenuitem>Line Up</guimenuitem>
de: <guimenu>Fenster</guimenu> <guisubmenu>Ansichten</guisubmenu> <guimenuitem>Line Up</guimenuitem>

source: <guimenu>Window</guimenu> <guisubmenu>Toolbars</guisubmenu>
de: <guimenu>Fenster</guimenu> <guisubmenu>Werkzeugleisten</guisubmenu>

source: <guimenu>Window</guimenu> <guisubmenu>Toolbars</guisubmenu> <guimenuitem>File</guimenuitem>
de: <guimenu>Fenster</guimenu> <guisubmenu>Werkzeugleisten</guisubmenu> <guimenuitem>Datei</guimenuitem>

source: <guimenu>Window</guimenu> <guisubmenu>Toolbars</guisubmenu> <guimenuitem>Edit</guimenuitem>
de: <guimenu>Fenster</guimenu> <guisubmenu>Werkzeugleisten</guisubmenu> <guimenuitem>Bearbeiten</guimenuitem>

source: <guimenu>Window</guimenu> <guisubmenu>Layout</guisubmenu> <guimenuitem>File</guimenuitem>
de: <guimenu>Fenster</guimenu> <guisubmenu>Layout</guisubmenu> <guimenuitem>Datei</guimenuitem>

source: <guimenu>Window</guimenu> <guisubmenu>Toolbars</guisubmenu> <guimenuitem>Tools</guimenuitem>
de: <guimenu>Fenster</guimenu> <guisubmenu>Werkzeugleisten</guisubmenu> <guimenuitem>Werkzeuge</guimenuitem>

source: <guimenu>Window</guimenu> <guisubmenu>Toolbars</guisubmenu> <guimenuitem>Kommander</guimenuitem>
de: <guimenu>Fenster</guimenu> <guisubmenu>Werkzeugleisten</guisubmenu> <guimenuitem>Kommander</guimenuitem>

source: <guimenu>Window</guimenu> <guisubmenu>Toolbars</guisubmenu> <guimenuitem>Custom</guimenuitem>
de: <guimenu>Fenster</guimenu> <guisubmenu>Werkzeugleisten</guisubmenu> <guimenuitem>Anpassung</guimenuitem>

source: <guimenu>Window</guimenu> <guisubmenu>Toolbars</guisubmenu> <guimenuitem>Help</guimenuitem>
de: <guimenu>Fenster</guimenu> <guisubmenu>Werkzeugleisten</guisubmenu> <guimenuitem>Hilfe</guimenuitem>

source: <guimenu>Window</guimenu> <guisubmenu>Toolbars</guisubmenu> <guimenuitem>Line Up</guimenuitem>
de: <guimenu>Fenster</guimenu> <guisubmenu>Werkzeugleisten</guisubmenu> <guimenuitem>Line Up</guimenuitem>

source: The <guimenu>Help</guimenu> Menu
de: Das Menü <guimenu>Hilfe</guimenu>
