Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdewebdev/kommander_dcop.po
Languages: de

source: &DCOP; Functions
de: &DCOP; Funktionen

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Georg</firstname><surname>Schuster</surname><affiliation><address><email>gschuster@utanet.at</email></address></affiliation><contrib>Deutsche Übersetzung</contrib></othercredit>

source: &DCOP; can be called in several ways in &kommander;. First is the console method
de: Das &DCOP; kann in &kommander; auf verschiedene Weise aufgerufen werden. Die Erste ist die Konsolenmethode

source: dcop kmdr-executor-@pid KommanderIf changeWidgetText myWidget <quote>new text</quote>
de: dcop kmdr-executor-@pid KommanderIf changeWidgetText myWidget <quote>neuer Text</quote>

source: This assumes you are inside a &kommander; file and have access to the special @pid which contains the process ID. In fact it is simpler to replace <quote>kmdr-executor-@pid</quote> with @dcopid. However, you can use this syntax (obviously without the specials) from the command line or any external script to alter the &kommander; window.
de: Dies setzt voraus, dass Sie sich innerhalb einer &kommander;-Datei befinden und Zugriff auf die Anweisung @pid haben, die die Prozess-ID enhält. Da ist es einfacher, <quote>kmdr-executor-@pid</quote> mit @dcopid zu ersetzen. Diese Syntax (möglicherweise ohne Anweisungen) kann von der Befehlszeile oder jedem externen Skript genutzt werden, um das &kommander;-Fenster zu ändern.

source: Because &kommander; does not have a full parser in it's Alpha stage, if you want to use the much faster internal &DCOP; from another application window (console &DCOP; is very slow) it is more complicated because you must give lots of information, including a prototype of the call. The above call would become:
de: Weil &kommander; in seiner Alfa-Entwicklungsstufe noch keinen vollständigen Parser hat, ist die Verwendung des viel schnelleren internen &DCOP; aus einem anderen Anwendungsfenster (Konsolen-&DCOP; ist langsam) viel schwieriger, weil viele Informationen mitgegeben werden müssen, einschließlich eines Prototyps des Aufrufes. Der Aufruf oben würde so aussehen:

source: @dcop(@dcopid, KommanderIf, <quote>enableWidget(QString, bool)</quote>, Widget, true)
de: @dcop(@dcopid, KommanderIf, <quote>enableWidget(QString, bool)</quote>, Bedienelement, true)

source: At the time of this writing you should be aware that nesting &DCOP; calls inside script language structures (like <application>bash</application>) means that you must use console method calls. <emphasis>If you use internal &DCOP; all &kommander; specials will be executed first and then the script will be executed.</emphasis>
de: Zur Zeit der Erstellung sollte aufgepasst werden, dass die Schachtelung von &DCOP;-Aufrufen innerhalb von Skriptsprachkonstrukten (wie <application>bash</application>) die Verwendung von Konsolenaufrufen verlangt.<emphasis>Bei der Verwendung von internem &DCOP; werden alle &kommander;-Anweisungen zuerst ausgeführt und dann erst das Skript.</emphasis>

source: There is a new simplified way to use &DCOP; inside &kommander; using an object syntax. Let's say you want to change the text in a widget name @LineEdit1. It would look like this.
de: Es gibt einen neuen vereinfachten Weg, &DCOP; innerhalb von &kommander; zu nutzen, mittels Objektsyntax. Angenommen, der Text in einem Bedienelement namens @Zeileneingabefeld1 soll geändert werden. Dies würde so aussehen.

source: @LineEdit1.changeWidgetText(New text)
de: @Zeileneingabefeld1.changeWidgetText(Neuer Text)

source: As you can see the new syntax is very easy, as well as consistent visually with function groups. All the &DCOP; reference here will use the new object syntax listed above. <emphasis>Please note that if you are referencing a widget using &DCOP; from another window or another application the first parameter will always be the widget name. All functions are listed here starting with the second parameter.</emphasis>
de: Wie Sie sehen, ist die neue Syntax einfach und passt schlüssig zu den Funktionsgruppen. Die gesamte &DCOP;-Referenz benutzt die neue Objektsyntax, wie oben. <emphasis>Bitte beachten Sie, dass beim Referenzieren eines Bedienelementes mit &DCOP; aus einem anderen Fenster oder einer anderen Anwendung der erste Parameter immer der Name des Bedienelementes sein muss. Alle hier aufgelisteten Funktionen beginnen mit dem zweiten Parameter.</emphasis>

source: &DCOP; for Global Variables
de: &DCOP; für globale Variablen

source: global(QString variableName)
de: global(QString VariablenName)

source: Returns the value of the specified global variable. When a script is run from within a &kommander; window any (non-global) variables set in that script will cease to exist after the script completes and therfore will not be available to other script processes or in a new instance of the calling process. The global <quote>scope</quote> means the variable will exist for any process of the window until that window is closed. You may change these variables at any time with a new call to <function>@setGlobal</function>.
de: Liefert den Wert der angegebenen globalen Variable zurück. Wenn ein Skript aus dem &kommander;-Fenster gestartet wird, verschwinden alle (nicht-globalen) Variablen, die im Skript belegt wurden, nach Ablauf des Skripts und sind so nicht für andere Skripte oder neue Instanzen des aufrufenden Prozesses verfügbar. Der <quote>Gültigkeitsbereich</quote> global bedeutet, dass die Variable für jeden Prozess dieses Fensters existiert, bis es geschlossen wird. Diese Variablen können jederzeit mit einem weiteren <function>@setGlobal</function>-Aufruf geändert werden.

source: setGlobal(QString variableName, QString value)
de: setGlobal(QString VariablenName, QString value)

source: Creates a variable that is global to the window process and assigns the value to it. This value can be retrieved with global(QString variableName) or set again.
de: Erstellt eine Variable, die global im Hinblick auf den Fensterprozeß ist und weist ihr den Wert zu. Dieser Wert kann mit global(QString VariablenName) gelesen oder geändert werden.

source: &DCOP; for all Widgets
de: &DCOP; für alle Bedienelemente

source: This should be renamed setWidgetText and this name will probably be deprecated. This removes the text displayed in the widget and replaces it with the text supplied.
de: Dies sollte in setWidgetText umbenannt werden und der Name ist daher veraltet. Es entfernt den angezeigten Text im Bedienelement und ersetzt ihn mit dem Parametertext.

source: enableWidget(bool enable)
de: enableWidget(bool schalter)

source: Enables or disables a widget.
de: Schaltet ein Bedienelement ein oder aus.

source: Returns the text associated with the specified widget. This is not the same as the displayed text. It would be <quote>@widgetText</quote> or the text and/or scripting used to arrive at the displayed value.
de: Liefert den mit dem angegebenen Bedienelement verbundenen Text zurück. Das ist nicht das gleiche, wie der angezeigte Text. Diesen würde man mit <quote>@widgetText </quote> oder Skriptbefehlen erreichen, um den angezeigten Wert zu erhalten.

source: This sets the &kommander; Text default string. This is typically set to <quote>@widgetText</quote> to display what is entered into the widget. It is unlikely you will have much need for this, but if you do it is there. Applies to all widgets that can contain data.
de: Dies setzt den Standardtext von &kommander;. Das ist typischerweise gleich wie <quote>@widgetText</quote> um anzuzeigen, was im Bedienelement enthalten ist. Normalerweise hat man keinen Bedarf dafür, aber auf jeden Fall vorhanden. Trifft für alle Bedienelemente zu, die Text enthalten können.

source: &DCOP; for ListBox and ComboBox Widgets
de: &DCOP; für Listenfeld- und Kombinationsfeld-Bedienelemente

source: addListItem(QString item, int index)
de: addListItem(QString Element, int Index)

source: Adds an item to a ListBox widget at the specified index. List index starts at zero. To add to the end of the list use -1.
de: Fügt ein Element zu einem ListBox-Bedienelement am angegebenen Index hinzu. Der Index beginnt mit Null. Zum Hinzufügen am Ende der Liste dient -1.

source: addListItems(QStringList items, int index)
de: addListItems(QStringList Elemente, int Index)

source: This adds a list of strings all at once. The list should be delimited by <acronym>EOL</acronym> (\n - newlines). This is handy as you can use bash to derive the list rather easily. For instance, using @exec(ls -l ~/projects | grep kmdr) for items will give you a directory listing of &kommander; files in your projects folder. List index starts at zero. Use -1 to add to the end of the list.
de: Dies fügt eine Liste von Zeichenketten auf einmal hinzu. Die Liste sollte mit <acronym>EOL</acronym> (\n - Zeilenschaltungen) getrennt sein. Das ist praktisch, weil man über bash leicht zu so einer Liste kommt. So liefert z. B. @exec(ls -l ~/projects | grep kmdr) ein Inhaltsverzeichnis von &kommander;-Dateien im Projektordner als passende Liste. Der Listenindex beginnt bei Null. Mit -1 kann am Ende der bestehenden Liste angehängt werden.

source: addUniqueItem(QString item)
de: addUniqueItem(QString Element)

source: addUniqueItem will add an item to the end of the list only if it is unique.
de: addUniqueItem fügt ein Element am Ende der Liste nur dann hinzu, wenn es einmalig ist.

source: Removes all items.
de: Entfernt alle Elemente.

source: Removes the item at the specified index.
de: Entfernt das Element mit angegebenem Index.

source: Returns the text of the item at the specified index.
de: Liefert den Text des Elementes mit angegebenem Index zurück.

source: Set the current (or selected) item to the index specified. Applies to ListBox and ComboBox widgets.
de: Setze das aktuelle (oder ausgewählte) Element auf den angegebenen Index. Verwendbar in Listbox und ComboBox-Bedienelementen.

source: &DCOP; for CheckBox and RadioButton Widgets
de: &DCOP; für Ankreuzfeld- und Auswahlknopf-Bedienelemente

source: setChecked(QString widgetName, bool checked)
de: setChecked(QString BedienelementName, bool aktiviert)

source: Checks/unchecks CheckBox or RadioButton widgets.
de: Aktiviert/deaktiviert Ankreuzfeld- oder Auswahlknopf-Bedienelemente.

source: &DCOP; for TabWidget Widgets
de: &DCOP; für Karteireiter-Bedienelemente

source: setCurrentTab(QString widgetName, int index)
de: setCurrentTab(QString BedienelementName, int Index)

source: Selected the tab by index for TabWidgets. Index starts at 0.
de: Wählt das Unterfenster mittels Index für Karteireiter-Bedienelemente. Der Index beginnt bei Null.
