Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdewebdev/kommander_widgets.po
Languages: de

source: Widgets
de: Bedienelemente

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Georg</firstname><surname>Schuster</surname><affiliation><address><email>gschuster@utanet.at</email></address></affiliation><contrib>Deutsche Übersetzung</contrib></othercredit>

source: The building blocks of a &kommander; dialog are the widgets. They are like any other widget in the &Qt; and &kde; libraries except they have some extra functionality that allows them to have a <quote>text association</quote>. Text is associated with a state of the widget or its populate slot. The number of states depends on the widget. If a widget only has one state, that state is called default.
de: Die Grundbausteine von &kommander;-Dialogen sind die Bedienelemente. Sie entsprechen den Bedienelementen in der &Qt; oder den &kde;-Bibliotheken, außer das sie als Zusatzfunktionalität eine <quote>Verbindung mit Text</quote> haben. Ein Text ist mit dem jeweiligen Status (Zustand) des Bedienelementes oder seines Population Slots verbunden. Die Anzahl der möglichen Zustände hängt vom Bedienelement ab. Wenn es nur einen gibt, wird er Standard genannt.

source: Widget text blah blah
de: Bedienelement Text

source: The dialog has two special states for &kommander; text. They are Initiate and Destroy. These are run when the dialog is initialized and when it is destroyed. These protect against what is know as <quote>race</quote> problems on open and mean that you do not require any special procedures on close to manage housekeeping.
de: Der Dialog hat zwei spezielle Zustände für &kommander;-Text. Sie heißen Initiate und Destroy. Sie werden ausgeführt, wenn der Dialog geschaffen oder weggeworfen wird. Dies schützt gegen <quote>race</quote>-Probleme beim Öffnen und bedeutet, dass keine besonderen Vorkehrungen beim Beenden getroffen werden müssen.

source: ButtonGroup
de: Schaltergruppe

source: A container to organize buttons into a group. An optional title can be set using the title property. The frame can be adjusted with the lineWidth property. The button group can be set to exclusive by setting the exclusive property to true. This means when one toggle button is clicked all other toggle buttons will be set to off with the exception of radio buttons that are always mutual exclusive even if the group is non-exclusive. Radio buttons can be set to non-exclusive using the radioButtonExclusive property. (I am not so sure that this property actually works.)
de: Ein Behälter zum Organisieren von Schaltern in einer Gruppe. Zusätzlich kann mit der title-Eigenschaft ein Titel dafür vergeben werden. Der Rahmen kann mit der lineWidth-Eigenschaft angepasst werden. Die Schaltergruppe kann mit der exclusive-Eigenschaft auf exklusiv einen gesetzt werden. Das bedeutet, wenn einer der Schalter aktiviert ist, sind alle anderen automatisch ausgeblendet, mit der Ausnahme von Auswahl-Knöpfen, die immer exklusiv sind, auch wenn die Gruppe nicht auf exclusive gesetzt ist. Auswahlknöpfe können mit der Eigenschaft radioButtonExclusive auf nicht exklusiv gesetzt werden. (Es ist nicht sicher, dass diese Eigenschaft derzeit funktioniert.)

source: ButtonGroup has one state, default.
de: Die Schaltergruppe hat einen Status, Standard.

source: The widget text for a ButtonGroup is the text associations for each of the buttons in the order they appear in the ButtonGroup.
de: Der Bedienelement-Text für eine Schaltergruppe ist die Text-Verbindung für jeden Schalter in der Reihenfolge, wie sie in der Schaltergruppe erscheinen.

source: CheckBox
de: Ankreuzfeld

source: A button that can be checked on and off. It can also be semi-checked if the tristate property is set to true. The label associated with the CheckBox is set in the text property. Setting the checked property will have the CheckBox initially checked.
de: Ein Schalter, der angehakt werden kann. Es ist auch ein halb-angehakt möglich, wenn die tristate-Eigenschaft aktiviert (wahr) ist. Die mit dem Ankreuzfeld verbundenen Beschriftung wird in der text-Eigenschaft festgelegt. Mit Aktivierung der checked-Eigenschaft wird das Ankreuzfeld von Beginn an angehakt.

source: A CheckBox has 3 states, checked, semichecked, and unchecked.
de: Ein Ankreuzfeld hat 3 Zustände, checked, semichecked und unchecked.

source: The widget text for a CheckBox is the value from the text property.
de: Der Bedienelement-Text für ein Ankreuzfeld ist der Wert der text-Eigenschaft.

source: CloseButton
de: Schließenschalter

source: A button that when clicked, executes its text association and then closes the dialog. The label on the button is set with the text property. Output from the text association (how to say that) will be echoed to stdout if the writeStdout property is set to true. The button can be the default action for the dialog if the default property is set to true.
de: Ein Schalter, der beim Anklicken seine Text-Verbindung ausführt und dann den Dialog schließt. Die Beschriftung auf dem Schalter wird mit der text-Eigenschaft festgelegt. Die Ausgabe der Text-Verbindung wird auf der Standardausgabe ausgegeben, wenn die writeStdout-Eigenschaft aktiviert ist. Der Schalter kann die Standard-Aktion des Dialoges sein, wenn die default-Eigenschaft auf wahr gesetzt wird.

source: CloseButton has one state, default.
de: Der Schließenschalter hat einen Zustand, Standard.

source: There isn't any widget text associated with a CloseButton.
de: Mit dem Schließenschalter ist kein Bedienelement-Text verbunden.

source: ComboBox
de: Auswahlfeld

source: ComboBox is a selection widget that combines a button and a pop-up menu. It shows the user's current choice from a list of options in minimal space. Items are added to the list using the edit window. If the editable property is set to true the user can enter arbitrary strings.
de: Auswahlfeld ist ein Bedienelement zum Auswählen, das einen Schalter mit einem Kontextmenü verbindet. Es zeigt dem Anwender die aktuelle Auswahl aus einer Liste von Möglichkeiten auf kleinem Raum an. Die Elemente werden über das Bearbeitungsfenster an die Liste gehängt. Wenn die editable-Eigenschaft aktiviert ist, kann der Anwender eigene Eingaben unabhängig von der Liste tätigen.

source: ComboBox has one state, default.
de: Das Auswahlfeld hat nur den Standard-Status.

source: The widget text for a ComboBox is the text of the selected item.
de: Der Bedienelement-Text für ein Auswahlfeld ist der Text des ausgewählten Elementes.

source: ExecButton
de: Ausführschalter

source: A button that when clicked executes its text association. The label on the button is set with the text property. Output from the text association (how to say that) will be echoed to stdout if the writeStdout property is set to true. The button can be the default action for the dialog if the default property is set to true.
de: Ein Schalter, der beim Anklicken seine Text-Verbindung ausführt. Die Beschriftung am Schalter wird mit der text-Eigenschaft eingestellt. Die Ausgabe der Text-Verbindung wird auf die Standardausgabe geschrieben, wenn die writeStdout-Eigenschaft aktiviert ist. Der Schalter kann die Standard-Aktion für den ganzen Dialog sein, wenn die default-Eigenschaft auf wahr gesetzt ist.

source: ExecButton has one state, default.
de: Der Ausführschalter hat einen Status, Standard.

source: There isn't widget text associated with ExecButton.
de: Mit dem Ausführschalter ist kein Bedienelement-Text verbunden.

source: FileChooser
de: Dateiauswahl

source: The FileChooser widget combines a LineEdit with a button when clicked will present the user with dialog for the selection of files/folders. The file/folder selected is stored in the LineEdit. The type of the FileChooser is set with the selectionType property. Available types are Open, Save, and Directory. Multiple files/folders can be selected if the selectionOpenMutliple property is set to true. A caption for the FileChooser can be set with the selectionCaption property. This is display as the window title of the dialog. If a caption isn't specified, the type of selection will be display in the title. The files displayed in the dialog can be limited using the selectionFilter property.
de: Die Dateiauswahl verbindet ein Eingabefeld mit einem Schalter, der zu einem Dateiauswahldialog für die grafische Auswahl von Dateien/Ordnern führt. Die Auswahl (Datei/Ordner) wird ins Eingabefeld übertragen. Der Typ einer Dateiauswahl wird mit der selectionType-Eigenschaft festgelegt. Mögliche Typen sind Offnen, Speichern und Ordner. Wenn die selectionOpenMultiple-Eigenschaft aktiviert ist, können viele Dateien/Ordner auf einmal ausgewählt werden. Die Fensterüberschrift für die Dateiauswahl kann mit der selectionCaption-Eigenschaft bestimmt werden und wird in der Titelleiste des Dialoges angezeigt. Wenn keine Fensterüberschrift angegeben wird, bestimmt der Typ der Dateiauswahl den Titel. Die auswählbaren Dateien können mit der selectionFilter-Eigenschaft gefiltert werden.

source: FileChooser has one state, default.
de: Die Dateiauswahl hat nur einen Status, Standard.

source: The widget text for a FileChooser is the text contained in the LineEdit (the file chosen by the user).
de: Der Bedienelement-Text für eine Dateiauswahl ist der Text im Eingabefeld (die vom Benutzer ausgewählte Datei).

source: GroupBox
de: Gruppenbereich

source: A container widget that holds other widgets. The frame is adjusted with the lineWidth property. A title can be added by setting the title property.
de: Ein Behälter-Bedienelement, das andere Bedienelemente enthält. Der Rahmen kann mit der lineWidth-Eigenschaft verändert werden. Mit der title-Eigenschaft kann ein Titel vergeben werden.

source: GroupBox has one state, default.
de: Der Gruppenbereich hat nur den Standard-Status.

source: The widget text for GroupBox is the text associations of each of the widgets it contains combined. They will be in the order they appear inside of the GroupBox.
de: Der Bedienelement-Text des Gruppenbereiches ist die Text-Verbindung aller enthaltenen Bedienelemente. Sie erscheinen in dieser Reihenfolge innerhalb des Gruppenbereiches.

source: LineEdit
de: Eingabefeld

source: A LineEdit widget is a one line text editor. It allows the user to enter and modify a single line of text. Initial text for the editor can be set in the text property. The widget can be set to read-only with the readOnly property. There are 3 modes for the widget, Normal, NoEcho, and Password. The mode is set with the echoMode property.
de: Ein Eingabefeld-Bedienelement ist ein Texteditor für eine Zeile. Es ermöglicht dem Benutzer die Eingabe oder Bearbeitung von einer Zeile Text. Der anfangs schon enthaltene Text kann mit der text-Eigenschaft bestimmt werden. Das Bedienelement kann mit der readOnly-Eigenschaft auf nur lesbar gesetzt werden. Es gibt drei Modi für das Bedienelement, Normal, NoEcho und Password. Der Modus wird mit der echoMode-Eigenschaft festgelegt.

source: LineEdit has one state, default.
de: Das Eingabefeld hat nur den Standard-Status.

source: The widget text for LineEdit is the text contained in the editor.
de: Der Bedienelement-Text für das Eingabefeld ist der darin enthaltene Text.

source: ListBox
de: Listenauswahl

source: A ListBox widget provides a list of selectable items. Normally one or no items are selected. This behavior can be changed with the selectionMode property. Items are added to the ListBox using the edit window.
de: Eine Listenauswahl ermöglicht die Auswahl aus einer Liste von Elementen. Normalerweise ist ein oder kein Element ausgewählt. Dieses Verhalten kann mit der selectionMode-Eigenschaft gestaltet werden. Die Elemente werden im Bearbeitungsfenster der Listenauswahl hinzugefügt.

source: A ListBox has only 1 state, default.
de: Eine Listenauswahl hat nur den Standard-Status.

source: The widget text for a ListBox is the items contained in the ListBox. @selectedWidgetText will return only the items that are currently selected.
de: Der Bedienelement-Text einer Listenauswahl besteht aus den Elementen in der Listenauswahl. @selectedWidgetText gibt nur das aktuell ausgewählte Element zurück.

source: ListView
de: Listenansicht

source: This widget is now &kommander; enabled. It is functionally the same as the tree widget so please reference that.
de: Dieses Bedienelement ist nun in &kommander; verfügbar. Seine Funktionalität entspricht dem Baum-Bedienelement, bitte dort nachsehen.

source: PixmapLabel
de: Bildbeschriftung

source: A simple widget that contains an image or text label. The pixmap to display is set in the pixmap property. The text is set in the text property. Only one of these properties can be set at the same time (I think, I can't get the editor to set both at the same time). If scaledContents is set to true the image will be scaled to fit the size of the widget. The format of the text can be set with the textFormat property.
de: Ein einfaches Bedienelement, das ein Bild oder eine Beschriftung enthält. Das anzuzeigende Bild wird mit der pixmap-Eigenschaft festgelegt. Der Text wird mit der text-Eigenschaft bestimmt. Es kann zu einer Zeit nur eine dieser Eigenschaften festgelegt sein (normalerweise verhindert der Editor, dass beide gleichzeitig gesetzt sind). Wenn scaledContents aktiviert ist, wird das Bild auf die Größe des Bedienelementes skaliert. Das Format des Textes kann mit der textFormat-Eigenschaft geändert werden.

source: This widget isn't &kommander; enabled and doesn't have any states or widget text.
de: Dieses Bedienelement ist in &kommander; nicht aktiviert und hat keinen Status oder Bedienelement-Text.

source: RadioButton
de: Auswahlknopf

source: A button that can be checked or unchecked, usually used in the ButtonGroup to make an exclusive choice. A label associated with the button can be set in the text property. A button can be initialized to checked by setting the checked property to true. If all RadioButtons in a ButtonGroup have the checked property set to true, then the last button will be the one that is checked.
de: Ein Schalter, der aktiviert oder nicht aktiviert sein kann. Normalerweise innerhalb einer Schaltergruppe für genaue eine Auswahl in der Gruppe. Eine Beschriftung für den Schalter kann mit der text-Eigenschaft bestimmt werden. Ein Schalter kann von vornherein mittels der checked-Eigenschaft aktiviert werden. Das Aktivieren der checked-Eigenschaft innerhalb einer Gruppe deaktiviert automatisch diese Eigenschaft für den Schalter, der sie vorher hatte.

source: RadioButton has 2 states checked and unchecked.
de: Der Auswahlknopf hat entweder den Status aktiviert oder deaktiviert.

source: There is no widget text associated with a RadioButton.
de: Es ist mit dem Auswahlknopf kein Bedienelement-Text verbunden.

source: This widget provides a text editor that allows for simple text formatting.
de: Dieses Bedienelement ist ein Texteditor für einfache Textformatierungen.

source: RichTextEditor has one state, default.
de: RichTextEditor hat nur einen Status, Standard.

source: The widget text for RichTextEditor is the text contained in the editor in rich text format. Selected text can be returned with @selectedWidgetText.
de: Der Bedienelement-Text des RichTextEditors ist der Text, der im Editor im RTF-Format enthalten ist. Ausgewählter Text kann mit @selectedWidgetText zurückgegeben werden.

source: SpinBoxInt
de: Ganzzahl-Drehfeld

source: A widget that allows the user to change a integer value by either press up and down arrows or entering a value into the box. Minimum and maximum values for the widget can be set with the minValue and maxValue properties. The specialValueText property is used to set a text value that will be displayed instead of the minimum value.
de: Ein Bedienelement, das die Auswahl einer Ganzzahl entweder mit den Pfeilen oder durch Eingabe des Wertes in einem Feld erlaubt. Minimum- und Maximum-Werte können mit der minValue bzw. der maxValue-Eigenschaft festgelegt werden. Die specialValueText-Eigenschaft bestimmt einen Text, der anstatt des Minimums angezeigt wird.

source: This widget has only one state, default.
de: Das Bedienelement hat nur einen Status, Standard.

source: The widget text for a SpinBoxInt is the currently displayed integer.
de: Der Bedienelement-Text für Ganzzahl-Drehfeld ist die aktuell angezeigte Ganzzahl.

source: A button that runs another &kommander; dialog when pressed. The dialog to run is set in the kmdrFile property. If the default property is set to true, the dialog will be run if enter is pressed while the dialog has focus. I think that you can also use it as a container. I need to play with this some more.
de: Ein Schalter, der beim Drücken einen anderen &kommander;-Dialog startet. Der zu startende Dialog wird mit der kmdrFile-Eigenschaft festgelegt. Wenn die default-Eigenschaft aktiviert ist, wird der neue Dialog beim Drücken von Eingabe gestartet, soferne der Fokus am alten Dialog lag. Dies könnte auch als Behälter dienen.

source: SubDialog has one state, default.
de: SubDialog hat nur einen Status, Standard.

source: The widget text for SubDialog is the text association of the dialog it executes.
de: Der Bedienelement-Text für SubDialog ist die Textverknüpfung des Dialoges, die er ausführt.

source: This was meant to contain the dialog, which is deprectaed with the new project concept. Should we leave it with <function>@dialog()</function> in its &kommander; text or get rid of it? As it is it is not right.
de: Dies war dazu gedacht, den Dialog zu enthalten, was aber mit dem neuen Projektkonzept veraltet ist. Sollten wir es mit dem <function>@dialog()</function> in seinem &kommander;-Text lassen oder loswerden? Wie auch immer, es würde nicht richtig sein.

source: A widget that provides multiple tabs each may contain other widgets.
de: Ein Bedienelement, das viele Unterfenster zur Verfügung stellt, die andere Bedienelemente enthalten können.

source: A simple multi-line text editor.
de: Ein einfacher Mehrzeileneditor.

source: A simple widget that contains a piece of text. This widget lets you set a pixmap too. OK, the editor says that they are both QLabels. Why do we have 2 widgets that look to be the same thing, but different names? - Scheduled to be fixed in A7.
de: Ein einfaches Bedienelement, das einen Text enthält. Es kann auch ein Bild enthalten. Nun, beide sind QLabels. Warum zwei gleich ausssehende Bedienelement mit verschiedenem Namen? - Soll mit Version A7 richtiggestellt werden.

source: As of Alpha 6 this widget is partially enabled and can be set using external DCOP calls.
de: In Version Alpha 6 ist dieses Bedienelement teilweise verfügbar und kann mit externen DCOP-Aufrufen eingestellt werden.

source: TreeWidget
de: Baum-Bedienelement

source: A widget that provides a list in the form of a tree structure. This widget is now fully enabled to add or remove items as of Alpha 6. You can add child items and multi-column data. The current limitation is that you cannot modify columns. To add a child node use <quote>/</quote> as a separator. To add column data use the escaped tab <quote>\t</quote> character between columns.
de: Ein Bedienelement, das eine Liste in Form einer Baumstruktur darstellt. Dieses Bedienelement ist nun voll verfügbar und seit Version Alpha 6 können Element hinzugefügt und entfernt werden. Es können auch Kindelemente und mehrspaltige Daten hinzugefügt werden. Die aktuelle Begrenzung ist, dass Spalten noch nicht verändert werden können. Zum Hinzufügen eines Kind-Knotens muss <quote>/</quote> als Trennzeichen verwendet werden. Spalten innerhalb von Daten werden mit einem entwerteten Tabulator <quote>\t</quote> getrennt.
