Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: docmessages/kdewebdev/kommander_specials.po
Languages: de

source: Specials and Built-in Global Variables
de: Anweisungen und eingebaute globale Variable

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Georg</firstname><surname>Schuster</surname><affiliation><address><email>gschuster@utanet.at</email></address></affiliation><contrib>Deutsche Übersetzung</contrib></othercredit>

source: Specials are functions that are processed by &kommander;. You should be aware that until &kommander; has a full parser all &kommander; specials will be executed first and then the script will be executed. In most cases this is not a problem, but in a few it is.
de: Anweisungen sind Funktionen, die von &kommander; ausgeführt werden. Bis &kommander; über einem vollständigen Parser verfügt, werden alle Anweisungen vor dem Skript ausgeführt. Meistens ist das kein Problem.

source: @dcop(<parameter>appId</parameter>, <parameter>object</parameter>, <parameter>function</parameter>, <parameter>arguments</parameter>)
de: @dcop(<parameter>AnwendungsId</parameter>, <parameter>Objekt</parameter>, <parameter>Funktion</parameter>, <parameter>Argumente</parameter>)

source: Make a &DCOP; call. @dcop(<quote>kmail</quote>, <quote>KMailIface</quote>, <quote>checkMail()</quote>, <quote></quote>)
de: Führe einen &DCOP; Aufruf durch. @dcop(<quote>kmail</quote>, <quote>KMailIface</quote>, <quote>checkMail()</quote>, <quote></quote>)

source: The &DCOP; id of the process. (kmdr-executor-@pid)
de: Die &DCOP;-ID des Prozesses. (kmdr-executor-@pid)

source: @dialog(<parameter>dialog</parameter>[,<parameter>parameters</parameter>])
de: @dialog(<parameter>Dialog</parameter>[,<parameter>Parameter</parameter>])

source: Launches the specified Kommander dialog. Dialog is sought in dialog directory and in current directory - in that order. This prepends the call to the executor and sets the default directory to the one the Kommander application is in. Parameters can be passed in the usual Unix way or you can pass named parameters like <quote>variable=value</quote>. You can then find passed parameters in the global pool. @global(variable) would return <quote>value</quote>.
de: Zeigt den bestimmten Kommander-Dialog an. Der Dialog wird im Dialogordner und im aktuellen Ordner gesucht, in dieser Reihenfolge. Das bestimmt den Aufruf von kommander-executor vor und setzt den Standardordner auf den Ordner, in dem sich die Kommander-Anwendung befindet. Parameter können im in Unix üblichen Weg oder namentlich wie z. B. <quote>Variable=Wert</quote> übergeben werden. Übergebene Parameter können im Globalbereich gefunden werden. @global(Variable) würde den <quote>Wert</quote> zurückgeben.

source: @env(<parameter>environmentVariable</parameter>)
de: @env(<parameter>Umgebungsvariable</parameter>)

source: Expands to the specified environment variable. @env(PWD) expands to $PWD. Remember that <quote>$</quote> is part of the shell and shouldn't be used.
de: Füllt die angegebene Umgebungsvariable aus. @env(PWD) setzt $PWD ein. Bitte beachten Sie, dass <quote>$</quote> ein Teil der Shell ist und nicht verwendet werden sollte.

source: @exec(<parameter>command</parameter>)
de: @exec(<parameter>Befehl</parameter>)

source: returns the output of executing the specified command. @exec(ls -l).
de: liefert die Ausgabe des damit ausgeführten Befehls zurück. @exec(ls -l).

source: same as <function>@exec</function>, but supports shebang and multiline scripts. This serves for various scripting languages either by declaring them or using a shebang.
de: gleich wie <function>@exec</function>, unterstützt aber mehrzeilige um Ummantelungs-Skripte. Das dient für einige Skriptsprachen entweder über eine Deklaration oder mittels einer Ummantelung.

source: The first one uses the name of the <acronym>PHP</acronym> executable. &kommander; searches PATH for <application>php</application> and if it is not found looks to see if it is registered with &kommander; in a location outside of your path. If not it tells the user it cannot be found. The second examples uses the classic <quote>shebang</quote> which can have some benefits and also problems. If you have a beta copy of <acronym>PHP5</acronym>, for instance, in <filename>/usr/local/bin</filename> which would not be found because it would find on in <filename>/usr/bin</filename> this is useful. If, however, you distribute the dialog to someone who has <acronym>PHP</acronym> in <filename>/usr/local/bin</filename> only it will not be found with the shebang used. So using shebangs is cautioned and using the executable is recommended if you are sharing files.
de: Das Erste benutzt den Namen des <acronym>PHP</acronym>-Programms. &kommander; durchsucht den Pfad PATH nach <application>php</application> und sieht, wenn es nicht gefunden wird, nach. ob es mit &kommander; außerhalb des Pfades registriert ist. Ist dies nicht der Fall, meldet es dem Benutzer, dass es nicht gefunden werden konnte. Das zweite Beispiel benutzt die klassische <quote>Ummantelung</quote>, die Vorteile aber auch Probleme bringen kann. Wenn zum Beispiel eine Beta-Version von <acronym>PHP5</acronym> in <filename>/usr/local/bin</filename> vorhanden ist, die nicht gefunden wird, weil es in <filename>/usr/bin</filename> eine gibt , wäre dies nützlich. Wird der Dialog aber von jemandem verwendet, der <acronym>PHP</acronym> nur in <filename>/usr/local/bin </filename>hat, würde es mit der Ummantelung nicht gefunden. Deshalb ist die Verwendung von Ummantelungen problematisch und die Verwendung des Programmes wird empfohlen, wenn die Dateien weitergegeben werden.

source: expands to the value of the specified global variable.
de: wird mit dem Inhalt der angegebenen globalen Variable ersetzt.

source: Returns null. Now that Kommander checks for empty widgetText on execution this will prevent erroneous errors in the case of an unset state on a widget.
de: Liefert Null zurück. Da &kommander; nun bei der Ausführung auf leere widgetText prüft, verhindert dies im Falle eines undefinierten Status des Bedienelementes Fehler.

source: The &PID; of the parent process.
de: Die &PID; des Vaterprozesses.

source: The &PID; of the process.
de: Die &PID; des Prozesses.

source: @readSetting(<parameter>key</parameter>, <parameter>defaultValue</parameter>)
de: @readSetting(<parameter>Schlüssel</parameter>, <parameter>Standardwert</parameter>)

source: reads a value from <filename>kommanderrc</filename>
de: liest einen Wert aus der <filename>kommanderrc</filename>

source: the selected content in a widget that can show more than one value, like list widgets
de: der ausgewählte Inhalt in einem Bedienelement, das mehrere Werte anzeigen kann, wie etwa Listen

source: @setGlobal(<parameter>variable</parameter>, <parameter>value</parameter>)
de: @setGlobal(<parameter>Variable</parameter>, <parameter>Wert</parameter>)

source: Sets the global variable to the specified value.
de: Setzt die globale Variable auf den angegebenen Wert.

source: the content of a widget
de: der Inhalt eines Bedienelementes

source: @writeSetting(<parameter>key</parameter>, <parameter>value</parameter>)
de: @writeSetting(<parameter>Schlüssel</parameter>, <parameter>Wert</parameter>)

source: write value to <filename>kommanderrc</filename>
de: schreibe den Wert in die <filename>kommanderrc</filename>

source: Array Function Group
de: Feldfunktionengruppe (Arrays)

source: @Array.values(<parameter>array</parameter>)
de: @Array.values(<parameter>Feld</parameter>)

source: Returns an EOL-separated list of all values in the array. Can be used to walk through an array.
de: Gibt eine mit Zeilenschaltungen getrennte Liste aller Werte eines Feldes zurück. Kann zum Durchgehen eines Feldes verwendet werden.

source: @Array.keys(<parameter>array</parameter>)
de: @Array.keys(<parameter>Feld</parameter>)

source: Returns an EOL-separated list of all keys in the array.
de: Gibt eine mit Zeilenschaltungen getrennte Liste aller Schlüssel im Feld zurück.

source: @Array.setValue(<parameter>array</parameter>, <parameter>key</parameter>, <parameter>value</parameter>)
de: @Array.setValue(<parameter>Feld</parameter>, <parameter>Schlüssel</parameter>, <parameter>Wert</parameter>)

source: Sets a key and value for an element of an array. If no array exists it is created.
de: Setzt einen Schlüssel und Wert für ein Element eines Feldes. Wenn das Feld nicht existiert, wird es erstellt.

source: @Array.clear(<parameter>array</parameter>)
de: @Array.clear(<parameter>Feld</parameter>)

source: Remove all elements from the array.
de: Entfernt alle Elemente aus einem Feld.

source: @Array.count(<parameter>array</parameter>)
de: @Array.count(<parameter>Feld</parameter>)

source: Return number of elements in the array.
de: Liefert die Anzahl der Elemente in einem Feld.

source: @Array.value(<parameter>array</parameter>,<parameter>key</parameter>)
de: @Array.value(<parameter>Feld</parameter>,<parameter>Schlüssel</parameter>)

source: Return the value associated with the given key.
de: Gibt den mit dem angegebenen Schlüssel verbundenen Wert zurück.

source: @Array.remove(<parameter>array</parameter>,<parameter>key</parameter>)
de: @Array.remove(<parameter>Feld</parameter>,<parameter>Schlüssel</parameter>)

source: Remove element with the given key from the array.
de: Entfernt das Element mit dem angegeben Schlüssel aus dem Feld.

source: @Array.fromString(<parameter>array</parameter>,<parameter>string</parameter>)
de: @Array.fromString(<parameter>Feld</parameter>,<parameter>Zeichenkette</parameter>)

source: Add all elements in the string to the array. String should have <emphasis>key\tvalue\n</emphasis> format."
de: Fügt alle Elemente der Zeichenkette dem Feld hinzu. Die Zeichenkette sollte ein <emphasis>Schlüssel\tWert\n</emphasis> Format haben."

source: @Array.toString(<parameter>array</parameter>,<parameter>string</parameter>)
de: @Array.toString(<parameter>Feld</parameter>,<parameter>Zeichenkette</parameter>)

source: "Return all elements in the array in <emphasis>key\tvalue\n</emphasis> format."
de: <quote>Liefert alle Elemente im Feld im <emphasis>Schlüssel\tWert\n</emphasis> Format.</quote>

source: File Function Group
de: Dateifunktionengruppe

source: @File.read(<parameter>file</parameter>)
de: @File.read(<parameter>Datei</parameter>)

source: Return content of the given file.
de: Liefert den Inhalt der angegebenen Datei zurück.

source: @File.write(<parameter>file</parameter><parameter>string</parameter>)
de: @File.write(<parameter>Datei</parameter><parameter>Zeichenkette</parameter>)

source: Write given string to a file.
de: Schreibt die angegebene Zeichenkette in eine Datei.

source: @File.append(<parameter>file</parameter><parameter>string</parameter>)
de: @File.append(<parameter>Datei</parameter><parameter>Zeichenkette</parameter>)

source: Append given string to the end of a file.
de: Hängt die angegebene Zeichenkette an das Ende der Datei an.

source: String Function Group
de: Zeichenketten-Funktionengruppe

source: @String.length(<parameter>string</parameter>)
de: @String.length(<parameter>Zeichenkette</parameter>)

source: Return number of chars in the string.
de: Gibt die Anzahl der Zeichen einer Zeichenkette zurück.

source: @String.contains(<parameter>string</parameter>,<parameter>substring</parameter>)
de: @String.contains(<parameter>Zeichenkette</parameter>,<parameter>Unterzeichenkette</parameter>)

source: Check if the string contains given substring.
de: Prüft, ob die Zeichenkette die angegebene Teilzeichenkette enthält.

source: @String.find(<parameter>string</parameter>)
de: @String.find(<parameter>Zeichenkette</parameter>)

source: Return position of a substring in the string, or -1 if it isn't found.
de: Liefert die Position einer Teilzeichenkette in einer Zeichenkette, oder -1, wenn sie darin nicht gefunden wurde.

source: This will have an optional integer start position for find next uses in Alpha 6.
de: Dies wird in Alpha6 eine optionale ganzzahlige Startposition zum Finden weiterer Treffer haben.

source: @String.left(<parameter>string</parameter>, <parameter>int</parameter>)
de: @String.left(<parameter>Zeichenkette</parameter>, <parameter>Ganzzahl</parameter>)

source: Return first n chars of the string.
de: Liefert die ersten n Zeichen der Zeichenkette zurück.

source: @String.right(<parameter>string</parameter>, <parameter>int</parameter>)
de: @String.right(<parameter>Zeichenkette</parameter>, <parameter>Ganzzahl</parameter>)

source: Return last n chars of the string.
de: Liefert die letzten n Zeichen der Zeichenkette zurück.

source: @String.mid(<parameter>string</parameter>, <parameter>int start</parameter>, <parameter>int end</parameter>)
de: @String.mid(<parameter>Zeichenkette</parameter>, <parameter>Ganzzahl Start</parameter>, <parameter>Ganzzahl Ende</parameter>)

source: Return substring of the string, starting from given position.
de: Liefert eine Teilzeichenkette aus der Zeichenkette, beginnend mit der angegebene Position.

source: @String.remove(<parameter>string</parameter>, <parameter>substring</parameter>)
de: @String.remove(<parameter>Zeichenkette</parameter>, <parameter>Teilzeichenkette</parameter>)

source: Remove all occurences of a given substring.
de: Entfernt alle Vorkommen einer angegebenen Teilzeichenkette.

source: @String.replace(<parameter>string</parameter>, <parameter>substring find</parameter>, <parameter>substring replace</parameter>)
de: @String.replace(<parameter>Zeichenkette</parameter>, <parameter>Teilzeichenkette zu finden</parameter>, <parameter>Teilzeichenkette zu ersetzen</parameter>)

source: Replace all occurences of a given substring with a given replacement.
de: Ersetzt alle Vorkommen einer angegebenen Teilzeichenkette mit dem angegebenen Ersatz.

source: @String.upper(<parameter>string</parameter>)
de: @String.upper(<parameter>Zeichenkette</parameter>)

source: Convert the string to uppercase.
de: Wandelt die Zeichenkette in Großbuchstaben um.

source: @String.lower(<parameter>string</parameter>)
de: @String.lower(<parameter>Zeichenkette</parameter>)

source: Convert the string to lowercase.
de: Wandelt die Zeichenkette in Kleinbuchstaben um.

source: @String.compare(<parameter>string</parameter>, <parameter>string</parameter>)
de: @String.compare(<parameter>Zeichenkette</parameter>, <parameter>Zeichenkette</parameter>)

source: Compare two strings. Return 0 if they are equal, -1 if the first one is lower, 1 if the first one is higher
de: Vergleicht zwei Zeichenketten. Gibt 0 zurück, wenn sie gleich sind, -1, wenn die Erste kleiner ist und 1, wenn die Erste größer ist

source: @String.isEmpty(<parameter>string</parameter>)
de: @String.isEmpty(<parameter>Zeichenkette</parameter>)

source: Check if string is empty.
de: Prüft, ob die Zeichenkette leer ist.

source: @String.isNumber(<parameter>string</parameter>)
de: @String.isNumber(<parameter>Zeichenkette</parameter>)

source: Check if string is a valid number.
de: Prüft, ob die Zeichenkette eine gültige Zahl ist.

source: Built-in Globals
de: Eingebaute globale Konstanten

source: Built-in globals are accessed just like regular global variables with <function>@global</function>.
de: Eingebaute globale Konstanten werden gleich wie reguläre globale Variable mit <function>@global</function> angesprochen.

source: The directory the current dialog is in.
de: Der Ordner, in dem sich der aktuelle Dialog befindet.

source: The name of the dialog
de: Der Name des Dialoges
