Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/kdepim-runtime/akonadi_kdeaccounts_resource.po
Languages: de

source: KDE Accounts
de: KDE-Zugänge

source: Contact with uid '%1' not found.
de: Kontakt mit der Kennung „%1“ wurde nicht gefunden.

source: Select KDE Accounts File
de: KDE-Zugangsdatei wählen

source: KDE Accounts file is read-only
de: KDE-Zugangsdatei kann nur gelesen werden

source: Unable to open KDE accounts file '%1'.
de: Problem beim Öffnen der KDE-Zugangsdatei „%1“.

source: KDE Project
de: KDE-Projekt

source: KDE Developer
de: KDE-Entwickler

source: Path to KDE accounts file.
de: Pfad zur KDE-Zugangsdatei.

source: Display name.
de: Anzeigename.

source: Do not change the actual backend data.
de: Die eigentlichen Daten des Backends nicht ändern.

source: Monitor file for changes.
de: Datei auf Änderungen überwachen.
