Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/kdepim-runtime/akonadi_kresourceassistant.po
Languages: de

# @info
source: <title>Introduction</title><para>This assistant will guide you through the necessary steps to use a traditional KDE resource plugin to populate a folder of your Akonadi personal information setup with data otherwise not yet accessible through native Akonadi resources.</para><para>The setup process consists of three steps:</para><para><list><item>Step 1: Selecting a plugin suitable for the kind of data source you want to add;</item><item>Step 2: Providing the selected plugin with information on where to find and how to access the data;</item><item>Step 3: Naming the resulting data source so you can easily identify it in any application presenting you a choice of which data to process.</item></list></para>
de: <title>Einführung</title><para>Dieser Assistent leitet Sie durch die nötigen Schritte, um eine alte KDE-Ressource zum neuen Akonadi-System umzuwandeln. Dadurch werden Daten verfügbar, die sonst über Akonadi nicht verfügbar wären.</para><para>Der Vorgang besteht aus drei Schritten:</para><para><list><item>Schritt 1: Wählen einer Erweiterung, die für die gewünschte Datenquelle geeignet ist;</item><item>Schritt 2: Angeben der nötigen Informationen, wo und wie die Daten verfügbar sind;</item><item>Schritt 3: Vergeben eines Namens für die neue Akonadi-Datenquelle, damit Sie diese in Anwendungen leicht wiederfinden und identifizieren können.</item></list></para>

# @info
source: No description available
de: Keine Beschreibung verfügbar

# @title:group
source: %1 Plugin Settings
de: Einstellungen zur Erweiterung „%1“

# @info
source: No plugin specific configuration available
de: Für die Erweiterung sind keine Einstellungen verfügbar.

# @info
source: The settings on this page allow you to customize how the data from the plugin will fit into your personal information setup.
de: Mit den Einstellungen auf dieser Seite können Sie festlegen, wie die Daten in Akonadi zugeordnet werden sollen.

# @title:group general resource settings
source: %1 Folder Settings
de: Einstellungen zum Ordner „%1“

# @option:check if resource is read-only
source: Read-only
de: Nur lesen

# @title user visible resource type
source: Address Book
de: Adressbuch

# @title user visible resource type
source: Calendar
de: Kalender

# @title:window
source: KDE Compatibility Assistant
de: Kompatibilitäts-Assistent von KDE

# @title assistant dialog step
source: Step 1: Select a KDE resource plugin
de: Schritt 1: Wählen Sie eine alte KDE-Ressource

# @title assistant dialog step
source: Step 2: Configure the selected KDE resource plugin
de: Schritt 2: Einrichtung der Ressourcen-Erweiterung

# @title assistant dialog step
source: Step 3: Choose target folder properties
de: Schritt 3: Festlegen von Einstellungen für den Zielordner
