Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/kdepim-runtime/akonadi_facebook_resource.po
Languages: de

source: Unable to login to Facebook, authentication failure.
de: Anmeldung bei Facebook nicht möglich, Authentifizierung fehlgeschlagen.

source: Preparing sync of friends list.
de: Abgleich der Freundesliste wird vorbereitet.

source: Preparing sync of events list.
de: Abgleich der Liste der Termine wird vorbereitet.

source: Preparing sync of notes list.
de: Abgleich der Liste der Notizen wird vorbereitet.

source: Preparing sync of posts.
de: Abgleich der Nachrichten wird vorbereitet.

source: Preparing sync of notifications.
de: Abgleich der Benachrichtigungen wird vorbereitet.

# @title: addressbook name
source: Friends on Facebook
de: Freunde auf Facebook

# @title: events collection title
source: Events on Facebook
de: Ereignisse auf Facebook

# @title: notes collection
source: Notes on Facebook
de: Notizen auf Facebook

# @title: posts collection
source: Posts on Facebook
de: Nachrichten auf Facebook

# @title: notifications collection
source: Notifications on Facebook
de: Benachrichtigungen auf Facebook

source: Unable to delete note from server: %1
de: Die Notiz kann nicht vom Server gelöscht werden: %1

source: Unable to get events from server: %1
de: Die Termine können nicht vom Server bezogen werden: %1

source: Unable to get list of events from server: %1
de: Die Liste der Termine kann nicht vom Server bezogen werden: %1

source: All events fetched from server.
de: Alle Termine vom Server bezogen.

source: Unable to get list of existing friends from the Akonadi server: %1
de: Die Liste bestehender Freunde kann nicht vom Akonadi-Server bezogen werden: %1

source: Retrieving friends list.
de: Die Liste der Freunde wird bezogen.

source: Unable to get list of friends from server: %1
de: Die Liste der Freunde kann nicht vom Server bezogen werden: %1

source: Retrieving friends' details.
de: Die Details der Freunde werden bezogen.

source: Unable to retrieve friends' information from server: %1
de: Die Informationen über die Freunde können nicht vom Server bezogen werden: %1

source: Retrieving friends' photos.
de: Die Fotos der Freunde werden bezogen.

source: Updated one friend from the server.
de: Einen Freund vom Server aktualisiert.

source: Finished, no friends needed to be updated.
de: Abgeschlossen. Es müssen keine Freunde aktualisiert werden.

source: Unable to retrieve friends' photo from server: %1
de: Die Fotos der Freunde können nicht vom Server bezogen werden: %1

source: Unable to get information about friend from server: %1
de: Abholen von Informationen des Freunds nicht möglich: %1

source: Unable to get notes from server: %1
de: Die Notizen können nicht vom Server bezogen werden: %1

source: All notes fetched from server.
de: Alle Notizen vom Server bezogen.

source: Unable to get information about note from server: %1
de: Abholen von Informationen der Notiz nicht möglich: %1

source: Unable to get upload note to server: %1
de: Hochladen der Notiz auf den Server nicht möglich: %1"

source: Unable to get notifications from server: %1
de: Die Benachrichtigungen können nicht vom Server bezogen werden: %1

source: All notifications fetched from server.
de: Alle Benachrichtigungen vom Server bezogen.

source: Facebook Notifications
de: Facebook-Benachrichtigungen

# @info:tooltip
source: Open browser
de: Webbrowser bBrowser

source: ...and one more
de: .. und eine weitere

source: Mark all notifications as read
de: Alle Benachrichtigungen als gelesen markieren

source: Hide
de: Ausblenden

source: ...and 1 more
de: ... und 1 weitere

source: New Facebook Notification
de: Neue Facebook-Benachrichtigung

source: You have one new Facebook notification
de: Sie haben eine neue Facebook-Benachrichtigung

source: Unable to get posts from server: %1
de: Die Nachrichten können nicht vom Server bezogen werden: %1

source: All posts fetched from server.
de: Alle Nachrichten vom Server bezogen.

source: Unable to get information about post from server: %1
de: Abholen von Informationen über Nachrichten vom Server nicht möglich: %1

source: on Facebook
de: auf Facebook

source: Unable to post the status to server: %1
de: Der Status kann nicht zum Server geschickt werden: %1

# Text denoting how many comments given post have
source: 1 comment
de: 1 Kommentar

# Text denoting how many 'facebook likes' given post have
source: 1 like
de: 1 Mag ich

source: The account id in KAccounts framework.
de: Die Kennung des Zugangs im KAccounts-Framework.

source: The account services configured in KAccounts framework.
de: Die eingerichteten Zugangsdienste im KAccounts-Framework.

source: About
de: Über

source: Facebook Settings
de: Facebook-Einstellungen

source: Authenticated.
de: Authentifiziert.

source: Authenticated as <b>%1</b>.
de: Authentifiziert als <b>%1</b>.

source: Akonadi Facebook Resource
de: Akonadi Facebook-Ressource

source: Makes your friends, events, notes, posts and messages on Facebook available in KDE via Akonadi.
de: Macht Ihre Freunde, Termine, Notizen, Posts und Nachrichten auf Facebook durch Akonadi in KDE verfügbar.

source: Copyright (C) 2010,2011,2012,2013 Akonadi Facebook Resource Developers
de: Copyright (C) 2010,2011,2012,2013 Entwickler der Akonadi-Ressource für Facebook

source: Developer
de: Entwickler

source: Past Maintainer
de: Vorheriger Betreuer

source: Past Developer
de: Früherer Entwickler

source: MacOS Support
de: MacOS-Unterstützung

# NAME OF TRANSLATORS
source: Your names
de: Torbjörn Klatt

# EMAIL OF TRANSLATORS
source: Your emails
de: torbjoern.k@googlemail.com

source: Your Internet Service Provider gave you a <em>user name</em> which is used to authenticate you with their servers. It usually is the first part of your email address (the part before <em>@</em>).
de: Sie haben von Ihrem Internetanbieter einen <em>Benutzernamen</em> zur Anmeldung an dessen Server bekommen. Oft stimmt dieser mit dem ersten Teil der E-Mail-Adresse überein (der Teil vor dem <em>@</em>).

source: Account &name:
de: Zugangs&name:

source: Name displayed in the list of accounts
de: Name, der in der Zugangsliste angezeigt wird.

source: Account name: This defines the name displayed in the account list.
de: Zugangsname: Dies legt den Namen fest, der in der Zugangsliste angezeigt wird.

source: Not yet authenticated with Facebook.
de: Noch nicht für Facebook authentifiziert.

source: Authenticate...
de: Authentifizieren ...

source: In order to access your Facebook data in KDE, you need to authenticate this application with Facebook. To do so, click the above button and follow the instructions on the screen.
de: Um auf Ihre Facebook-Daten in KDE zugreifen zu können, müssen Sie diese Anwendung bei Facebook authentifizieren. Klicken Sie dazu auf den Knopf oben und folgen Sie den Anweisungen auf dem Bildschirm.

source: TextLabel
de: Textfeld

source: Reset
de: Zurücksetzen

source: Display Facebook notifications:
de: Facebook-Benachrichtigungen anzeigen:

source: Enabled
de: Aktiviert
