Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/kdepim-runtime/akonadi_kabc_resource.po
Languages: de

# @info:status
source: Changing address book plugin configuration
de: Einrichtung des Adressbuch-Moduls wird geändert.

# @info:status
source: Acquiring address book plugin configuration
de: Einrichtung des Adressbuch-Moduls wird eingelesen.

# @info:status
source: No KDE address book plugin configured yet
de: Derzeit ist kein KDE-Adressbuch-Modul eingerichtet.

# @info:status
source: Initialization based on newly created configuration failed.
de: Die Initialisierung auf Basis der neu erstellten Einrichtung ist fehlgeschlagen.

# @info:status
source: Loading of address book failed.
de: Das Laden des Adressbuches ist fehlgeschlagen.

# @info:status
source: Loading address book
de: Adressbuch wird geladen.

# @info:status
source: Request for data of a specific distribution list failed because there is no such list
de: Die Anfrage nach Daten aus einer Verteilerliste ist fehlgeschlagen, weil die Verteilerliste nicht vorhanden ist.

# @info:status
source: Request for data of a specific address book entry failed because there is no such entry
de: Die Anfrage nach Daten eines Empfängers in einer Verteilerliste ist fehlgeschlagen, weil der Empfänger nicht vorhanden ist.

# @info:status
source: Request for saving the address book failed. Probably locked by another application
de: Das Adressbuch kann nicht gespeichert werden. Möglicherweise wird es derzeit von einer anderen Anwendung gesperrt.

# @info:status
source: Initialization based on stored configuration failed.
de: Die Initialisierung auf Basis der gespeicherten Einrichtung ist fehlgeschlagen.
