Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/kdepim-runtime/akonaditray.po
Languages: de

# NAME OF TRANSLATORS
source: Your names
de: Thomas Reitelbach

# EMAIL OF TRANSLATORS
source: Your emails
de: tr@erdfunkstelle.de

source: The backup cannot be made. Either the mysqldump application is not installed, or the bzip2 application is not found. Please install those and make sure they can be found in the current path. Restart this Assistant when this is fixed.
de: Die Sicherung kann nicht durchgeführt werden. Entweder fehlt die Programmdatei „mysqldump“ oder „bzip2“ kann nicht gefunden werden. Bitte installieren Sie diese Programme und stellen Sie sicher, dass sie gefunden werden können. Starten Sie diesen Assistenten anschließend neu.

source: Please select the file where to store the backup, give it the extension .tar.bz2
de: Bitte wählen Sie die Datei, in der die Sicherung gespeichert werden soll, und geben Sie ihr die Erweiterung .tar.bz2.

source: &Click Here to Select the Backup Location...
de: Klicken Sie &hier, um den Sicherungs-Speicherort auszuwählen ...

source: Press 'Next' to start the Backup
de: Drücken Sie „Weiter“ um die Sicherung zu starten.

source: Welcome to the Backup Assistant
de: Willkommen beim Sicherungs-Assistenten

source: Making the backup
de: Die Sicherung wird durchgeführt.

source: Save As
de: Speichern unter

source: Please be patient, the backup is being created...
de: Bitte warten Sie, die Sicherung wird durchgeführt ...

source: The backup has been made. Please verify manually if the backup is complete. Also note that KWallet stored passwords are not in the backup, you might want to verify you have a backup of those elsewhere.
de: Die Sicherung wurde durchgeführt. Bitte prüfen Sie, ob sie vollständig ist. Beachten Sie, dass keine Passwörter aus dem Passwortspeicher gesichert werden; diese sollten Sie separat sichern.

source: The backup process ended unexpectedly. Please report a bug, so we can find out what the cause is.
de: Der Sicherungsvorgang wurde unerwartet beendet. Bitte berichten Sie diesen Fehler an die Programmentwickler, damit sie die Ursache finden und beheben können.

source: &Stop Akonadi
de: Akonadi &stoppen

source: S&tart Akonadi
de: Akonadi &starten

source: Make &Backup...
de: Datensi&cherung durchführen ...

source: &Restore Backup...
de: Aus Datensicherung &zurückholen ...

source: &Configure...
de: &Einrichten ...

source: Akonadi available
de: Akonadi bereit

source: The Akonadi server has been started and can be used now.
de: Der Akonadi-Server wurde gestartet und ist nun bereit.

source: Akonadi not available
de: Akonadi nicht bereit

source: The Akonadi server has been stopped, Akonadi related applications can no longer be used.
de: Der Akonadi-Server wurde beendet, Akonadi-Anwendungen können nicht länger verwendet werden.

source: Akonadi is running
de: Akonadi läuft

source: Akonadi is not running
de: Akonadi läuft nicht

source: Akonadi message
de: Akonadi-Meldung

source: Akonadi error
de: Akonadi-Fehler

source: AkonadiTray
de: Akonadi-Modul

source: System tray application to control basic Akonadi functions
de: Kontrollleisten-Modul für grundlegende Akonadi-Funktionen

source: (c) 2008 Omat Holding B.V.
de: © 2008 Omat Holding B.V.

source: Maintainer and Author
de: Betreuer und Autor

source: The backup cannot be restored. Either the mysql application is not installed, or the bzip2 application is not found. Please install those and make sure they can be found in the current path. Restart this Assistant when this is fixed.
de: Die Sicherung kann nicht zurückgespielt werden. Entweder fehlt die Programmdatei „mysql“ oder „bzip2“ kann nicht gefunden werden. Bitte installieren Sie diese Programme und stellen Sie sicher, dass sie gefunden werden können. Starten Sie diesen Assistenten anschließend neu.

source: Please select the file to restore. Note that restoring a backup will overwrite all existing data. You might want to make a backup first and please consider closing all Akonadi applications (but do not stop the akonadi server).
de: Wählen Sie die Datei, die zurückgesichert werden soll. Beachten Sie, dass dadurch alle vorhandenen Daten überschrieben werden. Sie sollten in Erwägung ziehen, vorab eine Sicherung durchzuführen und alle Akonadi-Anwendungen zu schließen (beenden Sie jedoch nicht den Akonadi-Server).

source: &Click Here to Select the File to Restore...
de: Klicken Sie &hier, um die Datei für die Rücksicherung auszuwählen ...

source: Press 'Next' to start the Restore
de: Drücken Sie „Weiter“, um die Rücksicherung zu starten.

source: Welcome to the Restore Assistant
de: Willkommen beim Rücksicherungs-Assistenten

source: Restoring
de: Rücksicherung läuft

source: Please be patient, the backup is being restored...
de: Bitte warten Sie, die Datensicherung wird zurückgespielt ...

source: The backup has been restored. Note that KWallet stored passwords are not restored, so applications might ask for those.
de: Die Sicherung wurde zurückgespielt. Beachten Sie, dass keine Passwörter aus dem Passwortspeicher zurückgesichert wurden.

source: The restore process ended unexpectedly. Please report a bug, so we can find out what the cause is.
de: Die Rücksicherung wurde unerwartet beendet. Bitte berichten Sie diesen Fehler an die Entwickler, damit sie die Ursache finden und beheben können.
