Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/kdepim-runtime/akonadi_kolabproxy_resource.po
Languages: de

source: Please select the format which should be used to write new Kolab objects according to your Kolab Groupware Server's version. You may close this window after selecting your version.
de: Bitte wählen Sie das Format, das für das Schreiben von neuen Kolab-Objekten passend zur Server-Version Ihrer Kolab-Groupware verwendet werden soll. Nach Auswahl Ihrer Version können Sie das Fenster schließen.

source: Change Format Version
de: Formatversion ändern

source: This allows you to upgrade your Kolab account to a different format version. This is normally not required and you should contact your administrator before doing so.
de: Dies erlaubt Ihnen, Ihren Kolab-Zugang zu einer anderen Formatversion zu aktualisieren. Dies ist normalerweise nicht nötig, Sie sollten daher vorher Ihren Systemverwalter kontaktieren.

source: Not Started
de: Nicht gestartet

source: Attention: Changing the format version will rewrite all Kolab objects. Make sure you have a backup of your data, and the account is fully synchronized and connected to the server.
de: Achtung: Das Ändern der Formatversion wird alle Kolab-Objekte neu schreiben. Überprüfen Sie, ob Sie eine Sicherungskopie Ihrer Daten haben und dass der Zugang vollständig mit dem Server abgeglichen und verbunden ist.

source: Could not trigger Free/Busy information update: %1.
de: Frei/Belegt-Informationen können nicht aktualisiert werden: %1.

source: Contacts
de: Kontakte

source: Calendar
de: Kalender

source: Tasks
de: Aufgaben

source: Notes
de: Notizen

source: An error occured while writing the item to the backend.
de: Es ist ein Fehler beim Schreiben des Eintrags zum Backend aufgetreten.

source: My Data
de: Meine Daten

source: Do not change the actual backend data.
de: Die eigentlichen Daten des Backends nicht ändern.

source: Trigger a free/busy update on the server, when a calendar collection changes.
de: Frei/Belegt-Informationen auf dem Server aktualisieren, wenn sich eine Kalender-„Collection“ ändert.

source: Account Type: Kolab Account
de: Kontentyp: Kolab Konto

source: The kolab resource needs an Imap resource.
de: Die Kolab-Ressource benötigt eine IMAP-Ressource.

source: Add Imap Resource
de: IMAP-Ressource hinzufügen

source: Select IMAP-Account:
de: IMAP-Zugang auswählen:

source: IMAP-Account used for Kolab-Groupware.
de: In Kolab-Groupware verwendeter IMAP-Zugang.

source: Account Settings
de: Zugangseinstellungen

source: Create/Recover KolabFolders in IMAP-Account:
de: Kolab-Ordner im IMAP-Zugang erstellen/wiederherstellen:

source: Ensure that Kolab-Groupware-Folders are existing in IMAP-Account.
de: Überprüfen Sie, dass Kolab-Groupware-Ordner im IMAP-Zugang vorhanden sind.

source: Create Kolab Folders
de: Kolab-Ordner erstellen

source: Current Format Version:
de: Aktuelle Formatversion:

source: Change the Kolab-Format Version:
de: Die Kolab-Formatversion ändern:

source: Convert Account to different format version.
de: Zugang in andere Formatversion konvertieren.

source: Note that the Kolab-Resource will use all available IMAP accounts that contain Kolab folders to provide Groupware-Data. The selection below applies to the settings only.
de: Beachten Sie, dass die Kolab-Ressource alle verfügbaren IMAP-Zugänge verwenden wird, die Kolab-Ordner mit Groupware-Daten enthalten. Die Auswahl unten betrifft nur diese Einstellungen.

source: Could not find valid parent collection.
de: Es wurde keine gültige übergeordnete „Collection“ gefunden.

source: Started
de: Gestartet

source: Error
de: Fehler

source: Could not complete the upgrade process:
de: Der Aktualisierungsprozess kann nicht vollständig abgeschlossen werden:

source: Error during Upgrade Process
de: Fehler beim Aktualisierungs-Prozess

source: Complete
de: Beendet

source: Could not start the account wizard. Please check your installation.
de: Der Konto-Assistent kann nicht gestartet werden. Bitte überprüfen Sie Ihre Installation.

source: Unable to start account wizard
de: Der Konto-Assistent kann nicht gestartet werden
