Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/kdepim-runtime/desktop_kdepim-runtime.po
Languages: de

# Name
source: Account Wizard
de: Zugangsassistent

# Comment
source: Launch the account wizard to configure PIM accounts.
de: Den Zugangsassistenten zum Einrichten von PIM-Zugängen starten.

# Name
source: Akonadi Nepomuk Feeder
de: Nepomuk-Modul für Akonadi

# Name
source: Invitations Dispatcher Agent
de: Agent zur Einladungs-Auslieferung

# Comment
source: Dispatches invitations from your calendar
de: Verschickt Einladungen aus Ihren Kalender

# Comment
source: KDE e-mail client
de: E-Mail-Programm für KDE

# Name
source: KDE Mail
de: KDE E-Mail

# Name
source: E-mail successfully sent
de: E-Mail erfolgreich gesendet

# Name
source: E-mail sending failed
de: Fehler beim Versenden der E-Mail

# Name
source: Mail Dispatcher Agent
de: Agent zur Nachrichten-Auslieferung

# Comment
source: Dispatches email messages
de: Verteilt E-Mail-Nachrichten

# Name
source: Migration Agent
de: Migrations-Assistent

# Comment
source: New email notify
de: E-Mail-Benachrichtigung

# Name
source: New email notify
de: E-Mail-Benachrichtigung

# Name
source: New email arrived
de: Neue Nachrichten sind eingetroffen

# Name
source: Jovie Text-to-Speech Service not found
de: Der Sprachausgabedienstes Jovie wurde nicht gefunden

# Name
source: New Email Notifier
de: E-Mail-Benachrichtigung

# Comment
source: Notifications about newly received emails
de: Benachrichtigungen über neu empfangene E-Mails

# Name
source: Personal Contacts
de: Persönliche Kontakte

# Name
source: Personal Calendar
de: Persönlicher Kalender

# Name
source: Notes
de: Notizen

# Name
source: Akonadi Configuration
de: Akonadi-Einrichtung

# Comment
source: Configuration of the Akonadi Personal Information Management framework
de: Einrichtung des persönlichen Informationsmanagement von Akonadi

# Name
source: Akonadi Resources Configuration
de: Einrichtung der Akonadi-Ressourcen

# Name
source: Akonadi Server Configuration
de: Einrichtung des Akonadi-Servers

# Name
source: Akonadi Address Books
de: Akonadi-Adressbücher

# Comment
source: Provides access to contacts stored in Akonadi address book folders
de: Ermöglicht den Zugriff auf Kontakte, die in Akonadi-Adressbuchordnern gespeichert sind.

# Name
source: Akonadi
de: Akonadi-Ressource

# Comment
source: Provides access to calendars stored in Akonadi calendar folders
de: Ermöglicht den Zugriff auf Kalender, die in Akonadi-Ordnern gespeichert sind.

# Name
source: kaddressbookmigrator
de: Adressbuch-Migration

# Comment
source: Tool to migrate the old kresource based address book to Akonadi.
de: Werkzeug zum Migrieren alter auf Ressourcen basierender Adressbücher nach Akonadi

# Name
source: Addressee Serializer
de: Empfänger-Serialisierung

# Comment
source: An Akonadi serializer plugin for addressee objects
de: Akonadi-Modul zur Serialisierung von Adressobjekten

# Name
source: Bookmark serializer
de: Lesezeichen-Serialisierung

# Comment
source: An Akonadi serializer plugin for bookmark objects
de: Akonadi-Modul zur Serialisierung von Lesezeichen

# Name
source: Contact Group Serializer
de: Kontaktgruppen-Serialisierung

# Comment
source: An Akonadi serializer plugin for contact group objects
de: Akonadi-Modul zur Serialisierung von Kontaktgruppen

# Name
source: KAlarm Event Serializer
de: Kalarm Ereignis-Serialisierung

# Comment
source: An Akonadi serializer plugin for KAlarm events
de: Akonadi-Modul zur Serialisierung von KAlarm-Ereignissen

# Name
source: Incidence Serializer
de: Ereignis-Serialisierung

# Comment
source: An Akonadi serializer plugin for events, tasks and journal entries
de: Akonadi-Modul zur Serialisierung von Ereignissen

# Name
source: Mail Serializer
de: E-Mail-Serialisierung

# Comment
source: An Akonadi serializer plugin for mail objects
de: Akonadi-Modul zur Serialisierung von E-Mail-Objekten

# Name
source: Microblog Serializer
de: Microblog-Serialisierung

# Comment
source: An Akonadi serializer plugin for Microblog
de: Akonadi-Modul zur Serialisierung von Microblog-Objekten

# Comment
source: Loads a notes hierarchy from a local maildir folder
de: Laden einer Notizenhierarchie aus einem lokalen Maildir-Ordner

# Name
source: Birthdays & Anniversaries
de: Geburtstage und Jahrestage

# Comment
source: Provides access to birthday and anniversary dates of contacts in your address book as calendar events
de: Ermöglicht den Zugriff auf Geburtstage und Jahrestage von Kontakten aus dem KDE-Adressbuch in Form von Kalendereinträgen.

# Comment
source: The address book with personal contacts
de: Das Adressbuch mit persönlichen Kontakten

# Name
source: DAV Groupware resource provider
de: DAV-Groupware-Ressource-Anbieter

# Name
source: DAV groupware resource
de: DAV-Groupware-Ressource

# Comment
source: "Resource to manage DAV calendars and address books (CalDAV, GroupDAV)"
de: "Ressource zur Verwaltung von DAV-Kalendern und -Adressbüchern (CalDAV, GroupDAV)"

# Comment
source: Akonadi's Facebook integration
de: Facebook-Integration für Akonadi

# Name
source: Facebook Resource
de: Facebook-Ressource

# Comment
source: Notification coming from Facebook
de: Benachrichtigungen von Facebook

# Name
source: New Facebook notification
de: Neue Facebook-Benachrichtigung

# Comment
source: You have new Facebook notification
de: Sie haben eine Facebook-Benachrichtigungen

# Comment
source: Makes your Facebook data available in KDE
de: Stellt Ihre Facebook-Daten in KDE zur Verfügung

# Name
source: Facebook Notification Serializer
de: Facebook-Benachrichtigungs-Serialisierung

# Comment
source: An Akonadi serializer plugin for Facebook notifications
de: Akonadi-Modul zur Serialisierung von Facebook-Benachrichtigungen

# Comment
source: Connects to your Gmail account
de: Verbindet mit Ihrem Gmail-Konto

# Name
source: Google Calendars and Tasks
de: Google-Kalender und -Tasks

# Comment
source: Access your Google Calendars and Tasks from KDE
de: Greifen Sie in KDE auf Ihre Google-Kalender und -Tasks zu

# Name
source: Google Contacts
de: Google-Kontakte

# Comment
source: Access your Google Contacts from KDE
de: Greifen Sie in KDE auf Google-Kontakte zu

# Name
source: ICal Calendar File
de: ICal-Kalenderdatei

# Comment
source: Loads data from an iCal file
de: Daten werden aus einer lokalen iCal-Datei geladen

# Comment
source: Loads data from a notes file
de: Lädt Daten aus einer Notizen-Datei

# Name
source: ICal Calendar Folder
de: ICal-Kalenderordner

# Comment
source: "Provides access to calendar items, each stored in a single file, in a given directory"
de: "Ermöglicht Zugriff auf Kalender, die jeweils in einzelnen Dateien in einem vorgegebenen Ordner gespeichert sind"

# Comment
source: Connects to an IMAP e-mail server
de: Verbindet zu einem IMAP E-Mail-Server.

# Name
source: Generic IMAP Email Server
de: Allgemeiner IMAP-E-Mail-Server

# Comment
source: Imap account
de: IMAP-Zugang

# Name
source: KDE Address Book (traditional)
de: KDE-Adressbuch (herkömmlich)

# Comment
source: Loads data from a traditional KDE address book resource
de: Lädt Daten aus einer herkömmlichen KDE-Adressbuch-Ressource

# Name
source: KAlarm Calendar File
de: KAlarm-Kalenderdatei

# Comment
source: Loads data from a KAlarm calendar file
de: Lädt Daten aus einer KAlarm-Kalenderdatei

# Name
source: KAlarm Directory
de: KAlarm-Ordner

# Comment
source: Loads data from a local KAlarm folder
de: Laden von Daten aus einem lokalen KAlarm-Ordner

# Name
source: KDE Calendar (traditional)
de: KDE-Kalender (herkömmlich)

# Comment
source: Loads data from a traditional KDE calendar resource
de: Lädt Daten aus einer herkömmlichen KDE-Kalender-Ressource

# Name
source: KDE Accounts
de: KDE-Zugänge

# Comment
source: Loads contacts from the KDE accounts file
de: Lädt Kontakte aus der KDE-Zugangsdatei

# Comment
source: Provides access to Kolab groupware folders and e-mail on a Kolab IMAP Server.
de: Ermöglicht den Zugriff auf Kolab-Groupware-Ordner auf einem Kolab-IMAP-Server.

# Comment
source: Kolab Proxy Resource Notifications
de: Benachrichtigungen der Proxy-Ressource für Kolab

# Name
source: Kolab Resource
de: Kolab-Ressource

# Name
source: An error occurred
de: Es ist ein Fehler aufgetreten

# Name
source: Kolab Groupware Server (legacy)
de: Kolab-Groupware-Server (veraltet)

# Comment
source: Provides access to Kolab groupware folders on an IMAP server (IMAP accounts need to be set up separately). This resource is obsolete, use the Kolab Groupware Server resource instead.
de: Ermöglicht den Zugriff auf Kolab-Groupware-Ordner auf einem Kolab-IMAP-Server. Diese Ressource ist veraltet, verwenden Sie statt dessen Ressource Kolab-Groupware-Server.

# Name
source: Local Bookmarks
de: Lokale Lesezeichen

# Comment
source: Loads data from a local bookmarks file
de: Daten werden aus einer lokalen Lesezeichen-Datei geladen

# Comment
source: Loads data from a local maildir folder
de: Daten werden aus einem lokalen Maildir-Ordner geladen

# Comment
source: Maildir account
de: Maildir-Zugang

# Name
source: Dummy MailTransport Resource
de: Dummy MailTransport-Ressource

# Comment
source: Dummy Resource implementing mail transport interface
de: Dummy-Ressource, die die Mail-Transport-Schnittstelle implementiert

# Comment
source: Loads data from a local mbox file
de: Daten werden aus einer lokalen MBox-Datei geladen

# Comment
source: Mailbox account
de: Mailbox-Zugang

# Name
source: KMail Mail Folder
de: KMail-Mailordner

# Comment
source: Loads data from a local KMail mail folder
de: Daten werden aus einem lokalen KMail-Mailordner geladen

# Name
source: Usenet Newsgroups (NNTP)
de: Usenet Newsgruppen (NNTP)

# Comment
source: Makes it possible to read articles from a news server
de: Lesen von Artikeln von einem News-Server

# Comment
source: "Provides access to the appointments, tasks, and contacts of an Open-Xchange groupware server."
de: "Ermöglicht den Zugriff auf Termine, Aufgaben und Kontakte, die auf einem Open-Xchange-Server gespeichert sind."

# Comment
source: Connects to a POP3 e-mail server
de: Verbindet zu einem POP3-E-Mail-Server.

# Comment
source: Pop3 account
de: POP3-Postfach

# Name
source: vCard File
de: vCard-Datei

# Comment
source: Loads data from a vCard file
de: Daten werden aus einer vCard-Datei geladen

# Name
source: VCard File
de: vCard-Datei

# Comment
source: Loads contact from VCard File
de: Lädt Kontakte aus einer vCard-Datei

# Name
source: vCard Directory
de: vCard-Ordner

# Comment
source: Loads data from a directory with vCards
de: Daten werden aus einem Ordner mit vCard-Dateien geladen

# Name
source: VCard Directory
de: vCard-Ordner

# Comment
source: Loads contact from VCard Directory
de: Lädt Kontakte aus einem vCard-Ordner

# Name
source: Akonaditray
de: Akonadi-Miniprogramm

# GenericName
source: Akonadi Tray Utility
de: Akonadi für die Kontrollleiste
