Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/kdepim-runtime/kcal_akonadi.po
Languages: de

# @info:tooltip resource type
source: Type: Akonadi Calendar Resource
de: Typ: Kalender-Ressource für Akonadi

# @info:status
source: Processing change set failed
de: Verarbeitung der Änderungen fehlgeschlagen

# @label where to store a calendar entry of type Event
source: Please select a storage folder for this Event
de: Legen Sie einen Speicherordner für dieses Ereignis fest

# @label where to store a calendar entry of type Todo
source: Please select a storage folder for this Todo
de: Legen Sie einen Speicherordner für diese Aufgabe fest

# @label where to store a calendar entry of type Journal
source: Please select a storage folder for this Journal
de: Legen Sie einen Speicherordner für dieses Journal fest

# @label where to store a calendar entry of unspecified type
source: Please select a storage folder for this calendar entry
de: Legen Sie einen Speicherordner für diesen Kalendereintrag fest

# @label
source: Please select a storage folder
de: Legen Sie einen Speicherordner

# @title:window
source: Manage Calendar Sources
de: Kalenderquellen verwalten

# @info
source: <para>By default you will be asked where to put a new Event, Todo or Journal when you create them.</para><para>For convenience it is also possible to configure a default folder for each of the three data items.</para><para><note>If the folder list below is empty, you might have to add a calendar source through <interface>%1</interface></note></para>
de: <para>Normalerweise werden Sie gefragt, in welchem Ordner Sie neue Ereignisse, Aufgaben oder Journale speichern möchten.</para><para>Es ist aber auch möglich, für diese drei Datentypen ein Standard-Ziel festzulegen.</para><para><note>Falls die Ordnerliste unten leer ist, müssen Sie zunächst eine Kalender-Ressource über <interface>%1</interface> anlegen.</note></para>

# @item:inlistbox, calendar entries
source: Events
de: Ereignisse

# @item:inlistbox, calendar entries
source: Todos
de: Aufgaben

# @item:inlistbox, calendar entries
source: Journals
de: Journale
