Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/kdepim-runtime/kmail-migrator.po
Languages: de

# NAME OF TRANSLATORS
source: Your names
de: Thomas Reitelbach

# EMAIL OF TRANSLATORS
source: Your emails
de: tr@erdfunkstelle.de

source: Creating instance of type %1
de: Instanz vom Typ „%1“ wird erzeugt

source: Missing Identifier
de: Fehlender Bezeichner

source: Failed to start migration because migrator is not ready
de: Der Start der Migration ist fehlgeschlagen, weil das Migrationswerkzeug nicht bereit ist

source: Starting migration...
de: Migration wird gestartet ...

source: Migration complete
de: Migration beendet

source: Migration aborted
de: Migration abgebrochen

source: Migration failed
de: Die Migration ist fehlgeschlagen

source: Migration paused
de: Die Migration wurde angehalten

source: This migration has already been started once but was aborted
de: Die Migration wurde bereits einmal gestartet, aber dann abgebrochen

# @info:status
source: Not started
de: Nicht gestartet

# @info:status
source: Running...
de: Läuft ...

# @info:status
source: Complete
de: Beendet

# @info:status
source: Aborted
de: Abgebrochen

# @info:status
source: Paused
de: Angehalten

# @info:status
source: Needs Update
de: Aktualisierung erforderlich

# @info:status
source: Failed
de: Fehlgeschlagen

source: Could not create adapter for previous KMail version's disconnected IMAP cache
de: Der Adapter zum „disconnected IMAP“-Zwischenspeicher der vorherigen KMail-Version kann nicht erzeugt werden

source: Could not configure adapter for previous KMail version's disconnected IMAP cache
de: Der Adapter zum „disconnected IMAP“-Zwischenspeicher der vorherigen KMail-Version kann nicht eingestellt werden

# @title account name
source: Previous KMail's disconnected IMAP cache
de: „Disconnected IMAP“-Zwischenspeicher des vorherigen KMails

source: Access to previous KMail version's cache enabled
de: Zugriff auf den Zwischenspeicher der vorherigen KMail-Version zugelassen

# @info:status folder name and number of messages to import before finished
source: %1: one message left to import
de: %1: eine weitere Nachricht zu importieren

# @info:status
source: No cache for account %1 available
de: Kein Cache für Konto %1 verfügbar.

# @info:status
source: Starting cache migration for folder %1 of account %2
de: Zwischenspeicher-Migration für den Ordner %1 des Kontos %2 wird gestartet

# @info:status foldername
source: %1: listing messages...
de: %1: Nachrichten auflisten ...

# @title account name
source: Local Copies of %1
de: Lokale Kopien von %1

source: Cannot provide access to local copies of disconnected IMAP account %1
de: Kann keinen Zugriff auf lokale Kopien von disconnected IMAP Konto %1 bieten

source: Failed to obtain D-Bus interface for remote configuration.
de: D-Bus-Schnittstelle für die entfernte Konfiguration kann nicht erhalten werden.

source: Beginning KMail migration...
de: KMail-Migration wird gestartet ...

source: No backend for '%1' available.
de: Kein Dienstprogramm für „%1“ verfügbar.

source: '%1' has been already migrated.
de: „%1“ wurde bereits migriert.

source: Enabling access to the disconnected IMAP cache of the previous KMail version
de: Zugriff auf disconnected IMAP-Zwischenspeicher der vorherigen KMail-Version zulassen

source: Local folders have already been migrated.
de: Lokale Ordner sind bereits migriert worden.

# @info:status
source: Migrating local folders in '%1'...
de: Lokale Ordner in „%1“ werden migriert ...

source: Migration successfully completed.
de: Die Migration ist erfolgreich abgeschlossen.

source: Migration of '%1' to Akonadi resource failed: %2
de: Die Migration von „%1“ zu Akonadi Resource ist fehlgeschlagen: %2

source: Migration of '%1' succeeded.
de: Die Migration von „%1“ ist erfolgreich abgeschlossen.

source: Trying to migrate '%1' to resource...
de: Es wird versucht, „%1“ zu einer Ressource zu migrieren ...

source: Failed to create resource: %1
de: Fehler beim Erzeugen der Ressource: %1

source: Created disconnected imap resource
de: Erstelle disconnected IMAP-Ressource

source: Created imap resource
de: IMAP-Ressource erzeugt

source: Created pop3 resource
de: POP3-Ressource erzeugt

source: Created mbox resource
de: Mbox-Ressource erzeugt

source: Created maildir resource
de: Maildir-Ressource erzeugt

source: Failed to create resource for local folders: %1
de: Fehler beim Erzeugen der Ressource für lokale Ordner: %1

source: Created local maildir resource.
de: Lokale Maildir-Ressource erzeugt

source: KMail Folders
de: KMail-Ordner

# @info:status resource that will provide folder such as outbox, sent
source: Using '%1' for default outbox, sent mail, trash, etc.
de: Für Postausgang, Gesendete Nachrichten, Papierkorb usw. wird „%1“ verwendet.

# @info:status resource that will provide folder such as outbox, sent
source: Keeping '%1' for default outbox, sent mail, trash, etc.
de: Für Postausgang, Gesendete Nachrichten, Papierkorb usw. wird „%1“ behalten.

source: Local folders migrated successfully.
de: Lokale Ordner sind erfolgreich migriert worden.

# mail folder name for role inbox
source: inbox
de: Posteingang

# mail folder name for role outbox
source: outbox
de: Postausgang

# mail folder name for role sent-mail
source: sent-mail
de: Versendete Nachrichten

# mail folder name for role trash
source: trash
de: Papierkorb

# mail folder name for role drafts
source: drafts
de: Entwürfe

# mail folder name for role templates
source: templates
de: Vorlagen

source: KMail Migration Tool
de: KMail-Migrationswerkzeug

source: Migration of KMail accounts to Akonadi
de: Migration von KMail-Zugängen nach Akonadi

source: (c) 2009-2010 the Akonadi developers
de: © 2009 die Akonadi-Entwickler

source: Author
de: Autor

source: Show reporting dialog
de: Berichtsfenster anzeigen

source: Show report only if changes were made
de: Bericht nur anzeigen, wenn Änderungen durchgeführt wurden

source: '%1' is not a valid maildir folder.
de: „%1“ ist kein gültiger Maildir-Ordner

source: Unable to move mbox file '%1' to backup location.
de: Die MBox-Datei „%1“ kann nicht zum Ort der Sicherungskopie verschoben werden.

source: Unable to create maildir folder at '%1'.
de: Der Maildir-Ordner kann in „%1“ nicht erzeugt werden.

source: Unable to open mbox file at '%1'.
de: Die MBox-Datei in „%1“ kann nicht geöffnet werden.

source: Unable to add new message to maildir '%1'.
de: Neue Nachricht kann nicht zu Maildir „%1“ hinzugefügt werden.
