Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/kdepim-runtime/kres-migrator.po
Languages: de

# NAME OF TRANSLATORS
source: Your names
de: Thomas Reitelbach

# EMAIL OF TRANSLATORS
source: Your emails
de: tr@erdfunkstelle.de

source: Creating instance of type %1
de: Instanz vom Typ „%1“ wird erzeugt.

source: Missing Identifier
de: Fehlender Bezeichner

source: Failed to start migration because migrator is not ready
de: Der Start der Migration ist fehlgeschlagen, weil das Migrationswerkzeug nicht bereit ist

source: Starting migration...
de: Migration wird gestartet ...

source: Migration complete
de: Migration beendet

source: Migration aborted
de: Migration abgebrochen

source: Migration failed
de: Die Migration ist fehlgeschlagen

source: Migration paused
de: Die Migration wurde angehalten

source: This migration has already been started once but was aborted
de: Die Migration wurde bereits einmal gestartet, aber dann abgebrochen

# @info:status
source: Not started
de: Nicht gestartet

# @info:status
source: Running...
de: Läuft ...

# @info:status
source: Complete
de: Beendet

# @info:status
source: Aborted
de: Abgebrochen

# @info:status
source: Paused
de: Angehalten

# @info:status
source: Needs Update
de: Aktualisierung erforderlich

# @info:status
source: Failed
de: Fehlgeschlagen

source: Unsupported file format found. The file format '%1' is no longer supported, please convert to another one.
de: Nicht unterstütztes Dateiformat erkannt. Das Dateiformat „%1“ wird nicht länger unterstützt, bitte konvertieren Sie in ein anderes Format.

source: File format '%1' is not yet supported natively.
de: Das Dateiformat „%1“ wird derzeit noch nicht nativ unterstützt.

source: Failed to create resource: %1
de: Fehler beim Erzeugen der Ressource: %1

source: Migrated Addressbook
de: Migriertes Adressbuch

source: Failed to obtain D-Bus interface for remote configuration.
de: D-Bus-Schnittstelle für die entfernte Konfiguration kann nicht erhalten werden.

source: Migrated Calendar
de: Migrierter Kalender

source: Failed to create birthdays resource: %1
de: Fehler beim Erzeugen der Geburtstage-Ressource: %1

source: Migrated Birthdays
de: Migrierte Geburtstage

source: Failed to create DAV resource: %1
de: Fehler beim Erzeugen der DAV-Ressource: %1

source: Migrated GroupDAV
de: Migrierte GroupDAV

source: Failed to find the configuration file for the GroupDAV KResource
de: Einrichtungsdatei für GroupDAV-KResource kann nicht gefunden werden

source: Apparently invalid configuration file for the GroupDAV KResource
de: Es scheint, die Einrichtungsdatei für GroupDAV-KResource ist fehlerhaft

source: Empty username or URL in GroupDAV KResource configuration
de: Fehlender Benutzername oder URL in der GroupDAV-KResource-Konfiguration

source: Failed to open file for reading: %1
de: Fehler beim Öffnen einer Datei zum Lesen: %1

source: Instance "%1" synchronized
de: Instanz „%1“ abgeglichen

source: Root fetch finished
de: Wurzel erfolgreich geholt

# A job to fetch akonadi resources failed. %1 is the error string.
source: Fetching resources failed: %1
de: Ressourcen holen fehlgeschlagen: %1

source: Received root collections
de: Wurzel 'Collections' empfangen

source: Could not find root collection for resource "%1"
de: Wurzel-'Collection' für die Ressource „%1“ kann nicht gefunden werden

source: Starting migration of %1 journal
de: Migration von %1 Journal wird gestartet

source: Client-side bridge already set up.
de: Die clientseitige Brücke ist bereits eingerichtet.

source: Trying to migrate '%1'...
de: Migration von „%1“ wird durchgeführt ...

source: No native backend for '%1' available.
de: Es sind keine nativen Treiber für „%1“ verfügbar.

source: '%1' has already been migrated.
de: „%1“ wurde bereits migriert.

source: No Akonadi agent identifier specified for previously bridged resource '%1'
de: Es ist kein Akonadi-Agent-Bezeichner für die vorherige Brückenressource „%1“ festgelegt.

source: Bridged resource %1 does not exist anymore, trying a direct migration
de: Brückenressource „%1“ existiert nicht mehr. Es wird eine direkte Migration versucht.

source: Bridged resource '%1' has no standard resource.
de: Die Brückenressource „%1“ besitzt keine Standardressource.

source: Trying to migrate '%1' from compatibility bridge to native backend...
de: Es wird versucht, „%1“ von der Kompatibilitäts-Brücke zum nativen Treiber zu migrieren ...

source: No native backend available, keeping compatibility bridge for '%1'.
de: Es ist kein nativer Treiber verfügbar, die Kompatibilitäts-Brücke für „%1“ wird beibehalten.

source: Migration of '%1' to compatibility bridge succeeded.
de: Die Migration von „%1“ zur Kompatibilitäts-Brücke ist erfolgreich abgeschlossen.

source: Setting up client-side bridge...
de: Clientseitige Brücke wird eingerichtet ...

source: Akonadi Compatibility Resource
de: Akonadi-Kompatibilitäts-Ressource

source: Client-side bridge set up successfully.
de: Die clientseitige Brücke wurde erfolgreich eingerichtet.

source: Could not create client-side bridge, check if Akonadi KResource bridge is installed.
de: Die clientseitige Brücke kann nicht erzeugt werden. Bitte stellen Sie sicher, dass die Akonadi-Ressource installiert ist.

source: Trying to migrate '%1' to compatibility bridge...
de: Es wird versucht, „%1“ zur Kompatibilitäts-Brücke zu migrieren ...

source: Unable to create compatibility bridge: %1
de: Fehler beim Erzeugen der Kompatibilitäts-Brücke: %1

source: Migration of '%1' to compatibility bridge failed: %2
de: Die Migration von „%1“ zur Kompatibilitäts-Brücke ist fehlgeschlagen: %2

source: Migration of '%1' to native backend failed: %2
de: Die Migration von „%1“ zum nativen Treiber ist fehlgeschlagen: %2

source: Migration of '%1' succeeded.
de: Die Migration von „%1“ ist erfolgreich abgeschlossen.

source: Attempting to create kolab resource
de: Es wird versucht, eine Kolab-Ressource anzulegen.

source: Failed to create kolab proxy resource.
de: Fehler beim Erzeugen der Kolab-Proxy-Ressource.

source: KResource Migration Tool
de: Ressourcen-Migrationswerkzeug

source: Migration of KResource settings and application to Akonadi
de: Migration von Ressourcen-Einstellungen und Anwendungen zu Akonadi

source: (c) 2008 the Akonadi developers
de: Copyright © 2008 die Akonadi-Entwickler

source: Author
de: Autor

source: Only migrate to Akonadi KResource bridges
de: Nur zu Akonadi-Ressourcen-Brücken migrieren

source: Omit setting up of the client side compatibility bridges
de: Einrichtung der clientseitigen Kompatibilitäts-Brücken überspringen

source: Only migrate contact resources
de: Nur Kontakt-Ressourcen migrieren

source: Only migrate calendar resources
de: Nur Kalender-Ressourcen migrieren

source: Only migrate knotes resources
de: Nur KNotes-Ressourcen migrieren

source: Only migrate the specified types (supported: contact, calendar, notes)
de: Nur die angegebenen Typen migrieren (unterstützt werden: Kontakte, Kalender, Notizen)

source: Show reporting dialog
de: Berichtsfenster anzeigen

source: Show report only if changes were made
de: Bericht nur anzeigen, wenn Änderungen durchgeführt wurden
