Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/kdeplasma-addons/desktop_workspace_kdeplasma-addons.po
Languages: de

# Name
source: Bouncy Ball
de: Springender Ball

# Comment
source: A bouncy ball for plasma
de: Ein Springball für Plasma

# Name
source: Binary Clock
de: Binäre Uhr

# Comment
source: Time displayed in binary format
de: Zeitanzeige im Binärformat

# Name
source: Black Board
de: Tafel

# Comment
source: Draw a quick note or a colorful image
de: Zeigt eine kurze Notiz oder ein farbiges Bild

# Name
source: Bookmarks
de: Lesezeichen

# Comment
source: Quick Access to the Bookmarks
de: Schnellzugriff auf die Lesezeichen

# Comment
source: A pretty bubble that monitors your system
de: Eine schicke Blase, die Ihr System überwacht.

# Name
source: Calculator
de: Rechner

# Comment
source: Calculate simple sums
de: Für kleine Rechenaufgaben

# Name
source: Character Selector
de: Tabelle zur Zeichenauswahl

# Comment
source: View, select, and copy characters from a font collection
de: Zeichen aus einer Sammlung ansehen, auswählen oder kopieren

# Name
source: Comic Strip
de: Comic

# Comment
source: View comic strips from the Internet
de: Comics aus dem Internet anzeigen

# Name
source: Community
de: Gemeinschaft

# Comment
source: Communicate using the Social Desktop
de: Über den Social Desktop kommunizieren

# Keywords
source: Utilities;
de: Dienstprogramme;

# Name
source: Dictionary
de: Wörterbuch

# Comment
source: Look up the meaning of words and their translation into different languages
de: Die Bedeutung von Wörtern und ihre Übersetzung in verschiedene Sprachen nachschlagen

# Name
source: Eyes
de: Augen

# Comment
source: XEyes clone
de: XEyes-Klon

# Name
source: Fifteen Puzzle
de: Fünfzehn Steine

# Comment
source: Put the pieces in order
de: Bringen Sie die Teile in die richtige Reihenfolge

# Name
source: File Watcher
de: Dateiüberwachung

# Comment
source: Watch for changes in specified files
de: Dateien auf Änderungen überwachen

# Name
source: Picture Frame
de: Bilderrahmen

# Comment
source: Display your favorite pictures
de: Zeigt Ihre Lieblingsbilder an

# Name
source: Fuzzy Clock
de: Umgangssprachliche Uhr

# Comment
source: Time displayed in a less precise format
de: Zeigt die Zeit weniger genau an

# Name
source: Icon-Only Task Manager
de: Symbol-Fensterleiste

# Comment
source: Switch between running applications
de: Zwischen laufenden Programmen wechseln

# Name
source: Incoming Message
de: Posteingang

# Comment
source: Notification of new messages
de: Benachrichtigung über neue Nachrichten

# Name
source: KDE Observatory
de: KDE-Observatorium

# Comment
source: Visualize the KDE ecosystem
de: Anzeige des KDE-Ökosystems

# Name
source: Input Method Panel
de: Eingabemethoden

# Comment
source: A generic input method panel for Oriental languages
de: Ein allgemeines Eingabemethoden-Miniprogramm für orientalische Sprachen

# Name
source: KnowledgeBase
de: Wissensdatenbank

# Comment
source: Opendesktop Knowledgebase
de: OpenDesktop-Wissensdatenbank

# Name
source: Color Picker
de: Farbauswahl

# Comment
source: Pick a color from the desktop
de: Farbwerte von einer Stelle auf der Arbeitsfläche auswählen

# Name
source: Konqueror Profiles
de: Konqueror-Profile

# Comment
source: List and launch Konqueror profiles
de: Konqueror-Profile anzeigen und starten

# Name
source: Konsole Profiles
de: Konsole-Profile

# Comment
source: List and launch Konsole profiles
de: Konsole-Profile anzeigen und starten

# Name
source: Lancelot Launcher
de: Lancelot-Programmstarter

# Comment
source: Launcher to start applications
de: Programme starten

# Comment
source: Lancelot Menu
de: Lancelot-Menü

# Name
source: Usage logging is activated
de: Benutzungsprotokoll ist aktiviert

# Comment
source: Shown only on first launch. Notifies that the usage logging is turned 'on'.
de: Wird nur beim ersten Start angezeigt. Benachrichtigung, dass die Benutzungsprotokollierung aktiviert ist.

# Name
source: Error opening the log
de: Fehler beim Öffnen des Protokolls

# Comment
source: Failed to open the log file.
de: Die Protokolldatei kann nicht geöffnet werden.

# Name
source: Shelf
de: Regal

# Name
source: Leave A Note
de: Nachricht hinterlassen

# Comment
source: Leave notes for users while they are away
de: Abwesenden Benutzern eine Nachricht hinterlassen

# Comment
source: Conway's Game of Life applet
de: Conways Spiel des Lebens

# Comment
source: Display moon phases for your location
de: Mondphasen für Ihren Standort anzeigen

# Name
source: Magnifique
de: Vergrößerung

# Comment
source: A magnification glass for the Plasma desktop
de: Ein Vergrößerungsglas für die Plasma-Arbeitsfläche

# Name
source: Media Player
de: Medienwiedergabe

# Comment
source: Widget that can play video and sound
de: Abspielen von Video- und Audio-Dateien

# Comment
source: Update and view your microblog status.
de: Status Ihres Microblogs aktualisieren und anzeigen.

# Comment
source: Show news from various sources
de: Neuigkeiten aus verschiedenen Quellen anzeigen

# Name
source: Notes
de: Notizen

# Comment
source: Desktop sticky notes
de: Klebezettel für die Arbeitsfläche

# Name
source: Now Playing
de: Musiktitel-Anzeige

# Comment
source: Displays currently playing audio
de: Den derzeit laufenden Musiktitel anzeigen

# Comment
source: Paste text/images to a remote server
de: Text und Bilder auf einen entfernten Server hochladen

# Comment
source: Pastebin Widget
de: Pastebin-Miniprogramm

# Name
source: Copied pastebin link
de: Kopierte Pastebin-Verknüpfung

# Comment
source: The pastebin URL has been copied to the clipboard
de: Die Pastebin-Adresse wurde in die Zwischenablage kopiert

# Name
source: Paste
de: Einfügen

# Comment
source: Paste text snippets
de: Textbaustein einfügen

# Name
source: Keyboard
de: Tastatur

# Comment
source: A virtual, on-screen keyboard
de: Eine virtuelle Tastatur auf dem Bildschirm

# Name
source: Previewer
de: Vorschau

# Comment
source: Quickly preview a variety of files
de: Vorschau für eine Vielzahl Dateien anzeigen

# Name
source: Preview This File
de: Vorschau für diese Datei anzeigen

# Comment
source: A powerful mathematical equation solver
de: Ein leistungsfähiges Miniprogramm zum Lösen von mathematischen Gleichungen

# Comment
source: Remember The Milk Todo list applet
de: Aufgaben-Listen-Miniprogramm für „Remember The Milk“

# Name
source: Show Widget Dashboard
de: Miniprogramm-Dashboard anzeigen

# Comment
source: Show the Plasma widget dashboard above other windows
de: Das Miniprogramm-Dashboard über anderen Fenstern anzeigen

# Name
source: Show Desktop
de: Arbeitsfläche anzeigen

# Comment
source: Show the Plasma desktop
de: Die Plasma-Arbeitsfläche anzeigen

# Name
source: Social News
de: Nachrichten (soziale Netzwerke)

# Comment
source: Stay informed with the Social Desktop
de: Bleiben Sie auf dem Laufenden mit dem Social Desktop

# Comment
source: OpenDesktop Activities Widget
de: openDesktop-Aktivitäten-Miniprogramm

# Name
source: New Activity
de: Neue Aktivität

# Comment
source: Something interesting has happened in your friends network
de: Etwas interessantes Neues ist im Freundeskreis passiert

# Name
source: Spell Check
de: Rechtschreibprüfung

# Comment
source: Fast spell checking
de: Schnelle Rechtschreibprüfung

# Name
source: System Load Viewer
de: Systemlast-Anzeige

# Comment
source: Tiny CPU/RAM/Swap monitor
de: Kleine CPU/RAM/Swap-Anzeige

# Name
source: Timer
de: Eieruhr

# Comment
source: Countdown over a specified time period
de: Einen bestimmten Zeitabschnitt zurückzählen

# Name
source: Unit Converter
de: Einheiten-Umrechner

# Comment
source: Plasmoid for converting units
de: Miniprogramm zum Umrechnen von Einheiten

# Name
source: Weather Forecast (QML)
de: Wettervorhersage (QML)

# Name
source: Weather Forecast
de: Wetterbericht

# Comment
source: Displays Weather information
de: Zeigt Wetterinformationen an

# Name
source: LCD Weather Station (QML)
de: LCD-Wetterstation (QML)

# Name
source: LCD Weather Station
de: LCD-Wetterstation

# Comment
source: Weather reports with an LCD display style
de: Wetterberichte im Stil von LCD-Anzeigen

# Name
source: Web Slice
de: Web-Scheibchen

# Comment
source: Show a part of a webpage
de: Einen Teil einer Webseite anzeigen

# Name
source: Grouping Desktop
de: Arbeitsflächengruppierung

# Name
source: Grid Desktop
de: Gitter-Arbeitsfläche

# Name
source: Grouping Panel
de: Gruppen-Kontrollleiste

# Comment
source: Plugin for Plasma Comic Engine
de: Modul für den Plasma-Comic-Datentreiber

# Name
source: Comic Strips
de: Comics

# Comment
source: Online comic strips
de: Online-Comics

# Comment
source: Comic Package Structure
de: Comic-Paketstruktur

# Name
source: KDE Commits Engine
de: KDE-Comic-Datentreiber

# Comment
source: A Data Engine for acquiring consolidated data about KDE SVN Commits
de: Ein Datenmodul zum Holen von zusammengefassten Daten über KDE-SVN-Commits.

# Name
source: KDE Observatory Data Engine
de: Datenmodul für das KDE-Observatorium

# Comment
source: A Data Engine for acquiring consolidated data about KDE projects
de: Ein Datenmodul zum Holen von zusammengefassten Daten über KDE-Projekte.

# Name
source: DataEngine for Kimpanel
de: Datenmodul für Kimpanel

# Comment
source: DataEngine for Kimpanel
de: Datenmodul für Kimpanel

# Comment
source: identi.ca and twitter micro-blogging services
de: Micro-Blogging-Dienste identi.ca und Twitter

# Name
source: Open Collaboration Services
de: Open-Collaboration-Dienste

# Name
source: Astronomy Picture of the Day
de: Bild des Tages der Astronomie

# Comment
source: Apod Provider
de: Apod-Anbieter

# Name
source: Earth Science Picture of the Day
de: Bild des Tages der Geowissenschaften

# Comment
source: Epod Provider
de: Epod-Anbieter

# Name
source: Flickr Picture of the Day
de: Bild des Tages von Flickr

# Comment
source: Flickr Provider
de: Flickr-Anbieter

# Name
source: Operational Significant Event Imagery Picture of the Day
de: Bild des Tages der Operational Significant Event Imagery

# Comment
source: Osei Provider
de: Osei-Anbieter

# Name
source: Picture of the Day
de: Bild des Tages

# Comment
source: Data Engine for getting various online Pictures of The Day.
de: Daten-Treiber zum Holen verschiedener Bilder des Tages.

# Comment
source: Plugin for Plasma PoTD Engine
de: Modul für den Plasma-Datentreiber „Bilder des Tages“

# Name
source: Wikimedia Picture of the Day
de: Bild des Tages von Wikimedia

# Comment
source: Wcpotd Provider
de: Wcpotd-Anbieter

# Name
source: Remember The Milk Engine
de: „Remember The Milk“-Datentreiber

# Comment
source: An engine to work with Remember the Milk.
de: Ein Datentreiber, der mit „Remember The Milk“ arbeitet.

# Name
source: Control audio player
de: Medienwiedergabe steuern

# Name
source: Control Audio Player
de: Medienwiedergabe steuern

# Comment
source: Allows to control MPRIS audio players (it is able to search through Amarok's collection, too)
de: Ermöglicht die Steuerung von MPRIS-Medienspielern (und kann zudem die Sammlung von Amarok durchsuchen)

# Name
source: Web Browser History
de: Webbrowser-Verlauf

# Comment
source: Searches in Konqueror's history
de: Suche im Verlauf von Konqueror

# Name
source: Special Characters
de: Sonderzeichen

# Comment
source: Creates special characters from their hexadecimal codes
de: Erstellt Sonderzeichen aus ihren Hexadezimalwerten

# Name
source: special Characters
de: Sonderzeichen

# Name
source: Contacts
de: Kontakte

# Comment
source: Finds entries in your address book
de: Einträge in Ihrem Adressbuch suchen

# Comment
source: Convert values to different units
de: Werte in verschiedene Einheiten umrechnen

# Name
source: Date and Time
de: Datum und Zeit

# Comment
source: The current date and time, locally or in any timezone
de: Aktuelles Datum und Zeit; lokal oder in einer anderen Zeitzone

# Comment
source: Define words
de: Wörter definieren

# Name
source: Calendar Events
de: Kalenderereignisse

# Comment
source: Calendar Events runner
de: Kalenderereignisse

# Name
source: Kate Sessions
de: Kate-Sitzungen

# Comment
source: Matches Kate Sessions
de: Findet Kate-Sitzungen

# Name
source: Konqueror Sessions
de: Konqueror-Sitzungen

# Comment
source: Matches Konqueror Sessions
de: Findet Konqueror-Sitzungen

# Name
source: Konsole Sessions
de: Konsole-Sitzungen

# Comment
source: Matches Konsole Sessions
de: Findet Konsole-Sitzungen

# Name
source: Kopete Contacts
de: Kopete-Kontakte

# Comment
source: Search contacts from Kopete
de: Sucht nach Kontakten in Kopete

# Comment
source: Search on KDE's TechBase
de: Auf KDE-TechBase suchen

# Name
source: KDE Documentation
de: KDE-Dokumentation

# Comment
source: Search on KDE's Userbase
de: Auf KDE-UserBase suchen

# Comment
source: Search on Wikipedia
de: Auf Wikipedia suchen

# Comment
source: Search on Wikitravel
de: Auf Wikitravel suchen

# Name
source: Spell Checker Runner
de: Rechtschreibprüfung

# Name
source: Spell Checker
de: Rechtschreibprüfung

# Comment
source: Check the spelling of a word
de: Rechtschreibung eines Wortes überprüfen

# Name
source: Translator
de: Übersetzer

# Comment
source: Translates into any language using Google Translate. For list of supported languages visit https://developers.google.com/translate/v2/using_rest?hl=de#language-params
de: Übersetzt mit „Google Übersetzer“ in beliebige Sprachen. Eine Liste der unterstützten Sprachen finden Sie unter https://developers.google.com/translate/v2/using_rest?hl=de#language-params

# Comment
source: Matches YouTube queries
de: Entspricht YouTube-Abfragen

# Comment
source: Explore a classic fractal design
de: Klassisches Fraktalbild erkunden

# Name
source: Globe
de: Globus

# Comment
source: An interactive map of the world
de: Eine interaktive Weltkarte

# Comment
source: Digital Bees
de: Digitale Bienen

# Comment
source: Celtic Knot
de: Keltischer Knoten

# Comment
source: Eastern Blues
de: Melancholischer Orient

# Comment
source: Fish Net
de: Fischernetz

# Comment
source: Flowers
de: Blumen

# Comment
source: Clearly French
de: Eindeutig französisch

# Comment
source: Ivory Coast
de: Elfenbeinküste

# Comment
source: Lineage
de: Verzweigung

# Comment
source: Night Rock by Tigert
de: Nachtgestein von Tigert

# Comment
source: Pavement
de: Pflaster

# Comment
source: Damascus Flower
de: Blume aus Damaskus

# Comment
source: Starry Sky
de: Sternenhimmel

# Comment
source: Stonewall 2 by Tigert
de: Steinwand 2 von Tigert

# Comment
source: Triangles
de: Dreiecke

# Name
source: Pattern
de: Muster

# Comment
source: Tilable patterns
de: Muster als Kacheln angeordnet

# Comment
source: A new picture from the Internet each day
de: Täglich ein Bild aus dem Internet anzeigen

# Name
source: Animations
de: Animationen

# Comment
source: Interactive, animated wallpapers
de: Interaktive, animierte Hintergrundbilder

# Name
source: Ascii Animals
de: Ascii-Tiere

# Comment
source: Unsure if cute or just nerdy
de: Nett oder nur seltsam

# Comment
source: A simulated life form eats your wallpaper
de: Eine simulierte Lebensform frißt Ihr Hintergrundbild

# Name
source: Weather
de: Wetter

# Comment
source: Images that reflect the weather outside
de: Bilder, die das aktuelle Wetter abbilden
