Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/kdeplasma-addons/lancelot.po
Languages: de

# NAME OF TRANSLATORS
source: Your names
de: Thomas Reitelbach

# EMAIL OF TRANSLATORS
source: Your emails
de: tr@erdfunkstelle.de

source: Next-generation application launcher.
de: Moderner Programmstarter.

source: (C) 2007, 2008, 2009, 2010 Ivan Čukić
de: © 2007, 2008, 2009, 2010, Ivan Čukić

source: Maintainer and lead developer
de: Betreuer und Hauptentwickler

source: Kickoff data models
de: Kickoff-Datenmodelle

source: &Documents
de: &Dokumente

source: &Contacts
de: &Kontakte

source: Co&mputer
de: &Rechner

source: &Applications
de: &Anwendungen

source: Documents
de: Dokumente

source: Contacts
de: Kontakte

source: Computer
de: Rechner

source: Applications
de: Anwendungen

# needed program is not running
source: %1 is not running
de: %1 läuft nicht

# start a program
source: start %1
de: %1 starten

source: Online contacts
de: Online-Kontakte

source: e-Mail contacts
de: E-Mail-Kontakte

source: Available Features
de: Verfügbare Funktionen

source: Search
de: Suchen

# Enter the text to search for
source: Search...
de: Es wird gesucht ...

source: Favorites
de: Favoriten

source: Places
de: Orte

# @title Removable devices
source: Removable
de: Wechselmedien

# @title Fixed devices
source: Fixed
de: Eingebaute

# @title New documents
source: New
de: Neu

# @title List of open documents
source: Open
de: Geöffnet

# @title Recent documents
source: Recent
de: Zuletzt geöffnet

source: Unread messages
de: Ungelesene Nachrichten

source: Make buttons wider
de: Knöpfe verbreitern

source: Make buttons narrower
de: Knöpfe verschmälern

source: Open Lancelot menu
de: Lancelot-Menü öffnen

source: Menu Editor
de: Menü-Editor

source: Configure Shortcuts...
de: Kurzbefehle einrichten ...

source: Configure Lancelot menu...
de: Lancelot-Menü einrichten ...

source: About Lancelot
de: Über Lancelot

source: Configure Lancelot menu
de: Lancelot-Menü einrichten

source: &General
de: &Allgemein

source: Activation Method
de: Aktivierungsmethode

source: Choose this option if you like to click. Every interface item will be activated only by clicking it.
de: Wählen Sie diese Einstellung, wenn Oberflächenelemente nur durch Klicken aktiviert werden sollen.

source: &Click on everything
de: &Klicken zum Aktivieren

source: Choose this option if you want the menu to behave like the standard application launchers. In order to launch applications, you should click on them. Section buttons are activated by hovering.
de: Wählen Sie diese Einstellung, wenn Sie möchten, dass sich das Menü wie der Standard-Programmstarter verhält. Zum Starten von Anwendungen müssen Sie klicken; Abschnitte wählen Sie durch Mausberührung.

source: Cla&ssic menu
de: Kla&ssisches Menü

source: Choose this option if you want to avoid clicking. Section buttons are activated by hovering. Applications are launched by hovering the button extenders.
de: Wählen Sie diese Einstellung, wenn Sie gar nicht klicken möchten. Abschnitte wählen Sie durch Mausberührung; Anwendungen, indem Sie die Knopferweiterung mit dem Mauszeiger berühren.

source: &No-click activation
de: Aktivierung oh&ne Klick

source: Do not close the menu until it loses focus.
de: Das Menü nicht schließen, solange es den Fokus hat

source: &Keep menu open
de: Menü &geöffnet halten

source: System Actions
de: Systemfunktionen

source: Choose which actions you want to be assigned to the system buttons:
de: Wählen Sie, welche Aktionen Sie den System-Knöpfen zuweisen möchten:

source: Application Browser
de: Anwendungsbrowser

source: Reset the browser to show Favorites on menu open
de: Browser zurücksetzen, damit beim Öffnen des Menüs die Favoriten angezeigt werden

source: Columns behavior:
de: Spaltenverhalten:

source: No column number limit
de: Keine Begrenzung

source: Limit to two columns
de: Zwei Spalten

source: Open popups for subcategories
de: Unterkategorien in Aufklappfenstern öffnen

source: EXPERIMENTAL FEATURE
de: Experimentelle Funktion

source: Edit...
de: Bearbeiten ...

source: System applications:
de: Systemanwendungen:

source: New documents applications:
de: Anwendung für neue Dokumente

source: Show the application name first, and then the description (requires restart)
de: Namen der Anwendung zuerst anzeigen und dann die Beschreibung (benötigt Neustart)

source: &Usage Statistics
de: &Benutzerstatistik

source: <!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0//EN" "http://www.w3.org/TR/REC-html40/strict.dtd"> <html><head><meta name="qrichtext" content="1" /><style type="text/css"> p, li { white-space: pre-wrap; } </style></head><body style=" font-family:'Oxygen'; font-size:11pt; font-weight:400; font-style:normal;"> <p style=" margin-top:12px; margin-bottom:12px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-family:'Bitstream Vera Sans'; font-size:10pt;">The usage statistics are intended to track applications you start, in order to provide a better user experience.</span></p> <p style=" margin-top:12px; margin-bottom:12px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-family:'Bitstream Vera Sans'; font-size:10pt;">The collected data is considered private and is not shared with the outside world.</span></p> <p style=" margin-top:12px; margin-bottom:12px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-family:'Bitstream Vera Sans'; font-size:10pt;">Note: The collected data is not used by Lancelot at the moment, but will be in the future. Leaving this option "on" will ensure that, once the features that depend on usage statistics are implemented, you will not need to train them.</span></p> <p style="-qt-paragraph-type:empty; margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px; font-family:'Bitstream Vera Sans'; font-size:10pt;"><br /></p></body></html>
de: <!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0//EN" "http://www.w3.org/TR/REC-html40/strict.dtd"> <html><head><meta name="qrichtext" content="1" /><style type="text/css"> p, li { white-space: pre-wrap; } </style></head><body style=" font-family:'Oxygen'; font-size:11pt; font-weight:400; font-style:normal;"> <p style=" margin-top:12px; margin-bottom:12px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-family:'Bitstream Vera Sans'; font-size:10pt;">Das Benutzungsprotokoll erfasst, welche Programme Sie starten, um die Bedienung zu verbessern.</span></p> <p style=" margin-top:12px; margin-bottom:12px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-family:'Bitstream Vera Sans'; font-size:10pt;">Die gesammelten Daten sind privat und werden nicht an Dritte weitergegeben.</span></p> <p style=" margin-top:12px; margin-bottom:12px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-family:'Bitstream Vera Sans'; font-size:10pt;">Hinweis: Die gesammelten Daten werden von Lancelot derzeit nicht verwendet, was sich aber in Zukunft ändern wird. Wenn Sie diese Option dennoch aktiviert lassen, brauchen Sie das System nicht erst trainieren, wenn die Funktion fertig eingebaut ist.</span></p> <p style="-qt-paragraph-type:empty; margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px; font-family:'Bitstream Vera Sans'; font-size:10pt;"><br /></p></body></html>

source: Enable usage statistics
de: Benutzerstatistiken aktivieren

source: Clear Gathered Data
de: Gesammelte Daten löschen

source: Lock Session
de: Sitzung sperren

source: Log Out
de: Abmelden

source: Switch User
de: Benutzer wechseln

source: Applet
de: Miniprogramm

source: Lancelot Launcher Applet
de: Lancelot-Programmstarter-Miniprogramm

source: Menu
de: Menü

source: Lancelot Menu
de: Lancelot-Menü

source: Start here
de: Hier beginnen

# Choose a custom icon
source: Custom
de: Benutzerdefiniert

source: Applet Icons
de: Symbole

source: Show cate&gories inside the applet
de: Kate&gorien anzeigen

source: Show only &menu launcher icon
de: Nur das &Menü-Symbol anzeigen

source: Choose Icon
de: Symbol wählen

source: Choose categories to show
de: Kategorieren zur Anzeige auswählen

source: Menu Activation
de: Menüaktivierung

source: Show menu on icon &hover (after a predefined interval of time)
de: Menü bei &Mauskontakt anzeigen (nach einer eingestellten Zeit)

source: Show menu on &click
de: Menü nach &Klicken anzeigen

source: Shelf
de: Regal

source: Contents
de: Inhalt

source: Advanced
de: Erweitert

source: Remove
de: Entfernen

source: Add...
de: Hinzufügen ...

# Contents of the applet
source: Activation:
de: Aktivierung:

source: Click to activate items
de: Klicken, um Elemente zu aktivieren

source: Use no-click interface
de: Oberfläche ohne Klicken verwenden

source: Extender Position
de: Position der Erweiterung

# Position the extender left
source: Left
de: Links

# Position the extender right
source: Right
de: Rechts

source: Applet Icon:
de: Symbol:

source: Show contents on &click
de: Inhalt nach &Klicken anzeigen

source: Show contents on icon &hover (after a predefined interval of time)
de: Inhalte bei &Mauskontakt anzeigen (nach einer eingestellten Zeit)

source: Show the search box
de: Suchfeld anzeigen

source: Remove this
de: Entfernen

source: Removable devices
de: Wechseldatenträger

source: Fixed devices
de: Eingebaute Datenträger

source: New Documents
de: Neue Dokumente

source: Open Documents
de: Geöffnete Dokumente

source: Recent Documents
de: Zuletzt geöffnete Dokumente

source: Favorite Applications
de: Meist genutzte Anwendungen
