Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/kdeplasma-addons/libplasma_groupingcontainment.po
Languages: de

source: Group Configuration
de: Gruppeneinstellungen

source: Add Groups
de: Gruppen hinzufügen

source: Remove this %1
de: Diese %1 entfernen

source: Configure this %1
de: Diese %1 einrichten

source: Floating Group
de: Schwebende Gruppe

source: Flow Group
de: Fließgruppe

source: Grid Group
de: Gittergruppe

source: Add a new column
de: Eine neue Spalte hinzufügen

source: Remove a column
de: Eine Spalte entfernen

source: Add a new row
de: Eine neue Zeile hinzufügen

source: Remove a row
de: Eine Zeile entfernen

source: Stacking Group
de: Gestaffelte Gruppe

# a general page in the config dialog
source: General
de: Allgemein

source: New Tab
de: Neues Unterfenster

source: Tabbing Group
de: Unterfenster-Gruppe

source: Pages
de: Seiten

source: Rename page
de: Seite umbenennen

source: Move up
de: Nach oben

source: Move down
de: Nach unten
