Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/kdeplasma-addons/plasma_applet_pastebin.po
Languages: de

# The status of the applet has not been set - i.e. it is unset.
source: Unset
de: Kein Status

source: Drop text or an image onto me to upload it to Pastebin.
de: Legen Sie hier Text oder ein Bild ab, um es auf Pastebin hochzuladen.

source: Error during upload. Try again.
de: Fehler beim Hochladen. Versuchen Sie es erneut.

source: Successfully uploaded to %1.
de: Erfolgreich hochgeladen auf %1.

source: Sending....
de: Senden ...

source: General
de: Allgemein

# Notification when the pastebin applet has copied the URL to the clipboard
source: The URL for your paste has been copied to the clipboard
de: Die Adresse Ihres eingefügten Inhalts wurde in die Zwischenablage kopiert.

source: Open browser
de: Browser öffnen

source: Pastebin Config Dialog
de: Pastebin-Einrichtungsdialog

source: History size:
de: Größe des Verlaufs:

source: &Get New Providers
de: &Neue Anbieter herunterladen
