Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/kdeplasma-addons/plasma_applet_fuzzy_clock.po
Languages: de

source: General
de: Allgemein

# hour in the messages below
source: one
de: eins|/|$[Eigenschaft stunde+1 zwei] $[Eigenschaft vollestunde ein]

# hour in the messages below
source: two
de: zwei|/|$[Eigenschaft stunde+1 drei]

# hour in the messages below
source: three
de: drei|/|$[Eigenschaft stunde+1 vier]

# hour in the messages below
source: four
de: vier|/|$[Eigenschaft stunde+1 fünf]

# hour in the messages below
source: five
de: fünf|/|$[Eigenschaft stunde+1 sechs]

# hour in the messages below
source: six
de: sechs|/|$[Eigenschaft stunde+1 sieben]

# hour in the messages below
source: seven
de: sieben|/|$[Eigenschaft stunde+1 acht]

# hour in the messages below
source: eight
de: acht|/|$[Eigenschaft stunde+1 neun]

# hour in the messages below
source: nine
de: neun|/|$[Eigenschaft stunde+1 zehn]

# hour in the messages below
source: ten
de: zehn|/|$[Eigenschaft stunde+1 elf]

# hour in the messages below
source: eleven
de: elf|/|$[Eigenschaft stunde+1 zwölf]

# hour in the messages below
source: twelve
de: zwölf|/|$[Eigenschaft stunde+1 eins]

# %1 the hour translated above
source: %1 o'clock
de: %1 Uhr|/|$[vollestunde %1] Uhr

# %1 the hour translated above
source: five past %1
de: fünf nach %1

# %1 the hour translated above
source: ten past %1
de: zehn nach %1

# %1 the hour translated above
source: quarter past %1
de: viertel nach %1

# %1 the hour translated above
source: twenty past %1
de: zwanzig nach %1

# %1 the hour translated above
source: twenty five past %1
de: 25 Minuten nach %1|/|fünf vor halb $[stunde+1 %1]

# %1 the hour translated above
source: half past %1
de: 30 Minuten nach %1|/|halb $[stunde+1 %1]

# %1 the hour translated above
source: twenty five to %1
de: fünf nach halb %1

# %1 the hour translated above
source: twenty to %1
de: zwanzig vor %1

# %1 the hour translated above
source: quarter to %1
de: viertel vor %1

# %1 the hour translated above
source: ten to %1
de: zehn vor %1

# %1 the hour translated above
source: five to %1
de: fünf vor %1

source: Night
de: Nacht

source: Early morning
de: Früher Morgen

source: Morning
de: Morgen

source: Almost noon
de: Beinahe Mittag

source: Noon
de: Mittag

source: Afternoon
de: Nachmittag

source: Evening
de: Abend

source: Late evening
de: Später Abend

source: Start of week
de: Wochenanfang

source: Middle of week
de: Mitte der Woche

source: End of week
de: Ende der Woche

source: Weekend!
de: Wochenende!

source: Appearance
de: Erscheinungsbild

source: Font style:
de: Schriftart:

source: Check if you want the font in bold
de: Markieren Sie diese Einstellung, wenn Sie Fettdruck wünschen

source: When this is checked, the clock font will be bold.
de: Ist diese Einstellung markiert, wird die Schrift in Fettdruck dargestellt.

source: &Bold
de: &Fett

source: Check if you want the font in italic
de: Markieren Sie diese Einstellung, wenn Sie kursive Schrift wünschen

source: When this is checked, the clock font will be in italic.
de: Ist diese Einstellung markiert, wird die Schrift in kursiv dargestellt.

source: &Italic
de: &Kursiv

source: Font color:
de: Schriftfarbe:

source: Use current desktop theme color
de: Farbe des aktuellen Arbeitsplatzdesigns verwenden

source: This is default. The clock will get its font color from the current desktop theme.
de: Dies ist die Voreinstellung. Die Schriftfarbe der Uhr wird dem aktuellen Arbeitsplatzdesign entnommen.

source: Use theme color
de: Farbe des Designs verwenden

source: Choose your own font color
de: Wählen Sie Ihre eigene Schriftfarbe

source: When checked you can choose a custom color for the clock font by clicking on the color widget on the right.
de: Ist diese Einstellung markiert, können Sie eine eigene Farbe für die Schrift wählen, indem Sie auf den Farbwähler klicken.

source: Use custom color:
de: Eigene Farbe verwenden:

source: Color chooser
de: Farbwähler

source: Click on this button and the KDE standard color dialog will show. You can then choose the new color you want for your clock.
de: Kicken Sie hier, um den KDE-Standarddialog zur Farbauswahl zu öffnen. Sie können darin eine neue Farbe für Ihre Uhr wählen.

source: Adjust text to panel-height:
de: Text an Kontrollleisten-Höhe anpassen:

source: 0: disable; 2: use full panel-height
de: 0: deaktivieren; 2: volle Kontrollleisten-Höhe verwenden

source: Information
de: Informationen

source: Show date:
de: Datum anzeigen:

source: Display the date of the day
de: Das Datum des aktuellen Tages anzeigen

source: Display day of the week
de: Wochentag anzeigen

source: Add the day of the week to the date display.
de: Den Wochentag zum angezeigten Datum hinzufügen.

source: Show day of the &week
de: &Wochentag anzeigen

source: Display the current year
de: Das aktuelle Jahr anzeigen

source: Add the year to the date string.
de: Das Jahr zum angezeigten Datum hinzufügen.

source: Show &year
de: &Jahr anzeigen

source: Show time zone:
de: Zeitzone anzeigen:

source: Display the time zone name
de: Namen der Zeitzone anzeigen

source: Display the time zone name under the time.
de: Den Namen der Zeitzone unterhalb der Zeit anzeigen.

source: Degree of fuzzyness:
de: Grad der Unschärfe:

source: 1: least fuzzy
de: 1: am wenigsten unscharf
