Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/kdeplasma-addons/plasma_runner_events.po
Languages: de

# In number of minutes phrase (may contain regexp symbols)
source: in %1 minutes (after)?
de: in %1 Minuten (nach)?

# In number of hours phrase (may contain regexp symbols)
source: in %1 hours (after)?
de: in %1 Stunden (nach)?

# In number of days phrase (may contain regexp symbols)
source: in %1 days (after)?
de: in %1 Tagen (nach)?

# In number of weeks phrase (may contain regexp symbols)
source: in %1 weeks (after)?
de: in %1 Wochen (nach)?

# In number of months phrase (may contain regexp symbols)
source: in %1 months (after)?
de: in %1 Monaten (nach)?

# In number of years phrase (may contain regexp symbols)
source: in %1 years (after)?
de: in %1 Jahren (nach)?

# Current time keyword
source: now
de: jetzt

# Current day keyword
source: today
de: heute

# Next day keyword
source: tomorrow
de: morgen

# Previous day keyword
source: yesterday
de: gestern

# Keyword for start datetime
source: from
de: von

# Keyword for finish datetime
source: to
de: bis

# Event creation keyword
source: event
de: Ereignis

# Todo creation keyword
source: todo
de: Aufgabe

# Todo completion keyword
source: complete
de: Vervollständigen

# Event comment keyword
source: comment
de: Kommentar

# Event list keyword
source: events
de: Ereignisse

# Todo list keyword
source: todos
de: Aufgaben

source: Creates event in calendar by its description in :q:, which consists of parts divided by semicolons. The first two parts (both obligatory) are the event summary and its start date. The third, optional, is list of event categories, divided by commas.
de: Erstellt ein Ereignis mittels Beschreibung in :q:, welches aus mit Strichpunkten (Semikolon) getrennten Teilen besteht. Die beiden (obligatorischen) ersten Teile stellen die Zusammenfassung und das Anfangsdatum des Ereignisses dar. Der optionale dritte Teil ist die Liste der Kategorien, welche mit Komma getrennt werden.

source: event description
de: Ereignis-Beschreibung

source: Creates todo in calendar by its description in :q:, which consists of parts divided by semicolons. The first two parts (both obligatory) are a summary of the todo, and its due date. The third, optional, is list of todo categories, divided by commas.
de: Erstellt eine Aufgabe mittels Beschreibung in :q:, welche aus mit Strichpunkten (Semikolon) getrennten Teilen besteht. Die beiden (obligatorischen) ersten Teile stellen die Zusammenfassung und das Gültigkeitsdatum der Aufgabe dar. Der optionale dritte Teil ist die Liste der Kategorien, welche mit Komma getrennt werden.

source: todo description
de: Aufgabenbeschreibung

source: Selects todo from calendar by its summary in :q: and marks it as completed.
de: Wählt eine Aufgabe aus dem Kalender mittels Zusammenfassung in :q: und markiert sie als erledigt.

# The command syntax description for complete
source: complete todo description
de: Aufgabenbeschreibung vervollständigen

source: Selects event from calendar by its summary in :q: and append <comment> to its body.
de: Wählt ein Ereignis aus dem Kalender mittels Zusammenfassung in :q: und fügt <comment> hinzu.

# The command syntax description for comment
source: comment todo description
de: Aufgabenbeschreibung kommentieren

source: Shows events from calendar by its date in :q:.
de: Zeigt ein Ereignis aus dem Kalender anhand des Datums in :q: an.

# The command syntax description for event
source: event date/time
de: Ereignisdatum/-zeit

source: Shows todos from calendar by its date in :q:.
de: Zeigt Aufgaben aus dem Kalender anhand des Datums in :q: an.

# The command syntax description for todo
source: todo date/time
de: Aufgabendatum/-zeit

# %1 is the summary of event, %2 is the start time of event
source: Create event "%1" at %2
de: Ereignis „%1“ um %2 erstellen

source: Create event "%1" from %2 to %3
de: Ereignis „%1“ von %2 bis %3 erstellen

# %1 is the summary of todo, %2 is the due time of todo
source: Create todo "%1" due to %2
de: Aufgabe „%1“ fällig um %2 erstellen

source: Create todo "%1" due to %3 starting at %2
de: Aufgabe „%1“ von %2 fällig um %3 erstellen

source: Categories: %1
de: Kategorien: %1

# The todo is complete
source: Complete todo "%1"
de: Aufgabe „%1“ erledigt

source: Date: %1
de: Datum: %1

source: Comment incidence "%1"
de: Ereignis „%1“ kommentieren

source: Akonadi collections
de: Akonadi-Sammlungen

source: Insert events into:
de: Ereignisse einfügen in:

source: Insert tasks into:
de: Aufgaben einfügen in:
