Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/kdeplasma-addons/plasma_runner_audioplayercontrol.po
Languages: de

source: Start playing
de: Wiedergabe starten

source: Audio player control
de: Medienwiedergabe-Steuerung

source: Play next song
de: Nächstes Stück abspielen

source: Play previous song
de: Vorheriges Stück abspielen

source: Pause playing
de: Wiedergabe pausieren

source: Stop playing
de: Wiedergabe anhalten

source: Increase volume by %1
de: Lautstärke um %1 erhöhen

source: Reduce volume by %1
de: Lautstärke um %1 verringern

source: Set volume to %1%
de: Lautstärke auf %1 % stellen

source: Mute
de: Stumm

source: Quit %1
de: %1 beenden

source: Play
de: Wiedergabe

source: Queue
de: Einreihen

source: Append to playlist
de: An Wiedergabeliste anhängen

source: play
de: Wiedergabe

source: append
de: Anhängen

source: queue
de: Einreihen

source: next
de: Vorwärts

source: mute
de: Stumm

source: increase
de: Erhöhen

source: decrease
de: Verringern

source: prev
de: Zurück

source: stop
de: Anhalten

source: volume
de: Lautstärke

source: quit
de: Beenden

source: Plays the selected song. If :q: is not empty it lists songs matching :q: to play them
de: Gibt das ausgewählte Stück wieder. Falls :q: nicht leer ist, listet es auf :q: passende Stücke auf, um sie wiederzugeben.

source: Displays songs matching :q: for appending the selected to the playlist
de: Zeigt auf :q: passende Stücke an, um sie an die Wiedergabeliste anzuhängen

source: Displays songs matching :q: for queueing them
de: Zeigt auf :q: passende Stücke an, um sie einzureihen

source: Plays a song from playlist
de: Gibt ein Stück aus der Wiedergabeliste wieder.

source: Pauses the playing
de: Hält die Wiedergabe an

source: Plays the next song in the playlist if one is available
de: Gibt das nächste Stück aus der Wiedergabeliste wieder (soweit verfügbar).

source: Mutes/unmutes the player
de: Schaltet die Stummschaltung ein/aus

source: Increases the volume by :q:. If :q: is empty it increases by the configured value
de: Erhöht die Lautstärke um :q:. Wenn :q: nicht angegeben ist, wird der eingestellte Wert verwendet.

source: Decreases the volume by :q:. If :q: is empty it decreases by the configured value
de: Verringert die Lautstärke um :q:. Wenn :q: nicht angegeben ist, wird der eingestellte Wert verwendet.

source: Plays the previous song if one is available
de: Gibt das vorherige Stück wieder (sofern verfügbar).

source: Stops the playing
de: Hält die Wiedergabe an.

source: Sets the volume to :q:
de: Stellt die Lautstärke auf :q: ein.

source: Quits the player
de: Beendet den Medienspieler.

source: %1 not found
de: %1 kann nicht gefunden werden.

source: %1 was not found so the runner is unable to work.
de: %1 kann nicht gefunden werden. Die Medienwiedergabe-Steuerung funktioniert deshalb nicht.

# next song
source: next
de: Vorwärts

# increase the sound volume
source: increase
de: Lauter

# decrease the sound volume
source: decrease
de: Leiser

# previous song
source: prev
de: Zurück

# set the sound volume
source: volume
de: Lautstärke

# quit media player
source: quit
de: Beenden

source: Append
de: Anhängen

source: Next
de: Vorwärts

source: Increase
de: Erhöhen

source: Decrease
de: Verringern

source: Prev
de: Zurück

source: Stop
de: Anhalten

source: Volume
de: Lautstärke

source: Quit
de: Beenden

source: Audio Player Control Runner Settings
de: Einstellungen der Medienwiedergabe-Steuerung

source: The player the runner controls:
de: Der zu steuernde Medienspieler:

source: The collection search is only available for Amarok. You may add another player. That player has to support the MPRIS specification.
de: Das Durchsuchen der Sammlung ist nur für Amarok verfügbar. Sie können einen weiteren Medienspieler hinzufügen. Dieser muss die MPRIS-Spezifikation erfüllen.

source: Search &collection
de: Sammlung &durchsuchen

source: Use Command&s
de: &Befehle verwenden

source: Pla&y:
de: &Wiedergabe:

source: Can be used as "Play" for playing and "Play <song>" for playing a song that matches to <song> (in title, artist and album)
de: Kann als „Wiedergabe“ für die Wiedergabe und „Wiedergabe <Stück>“ für die Wiedergabe eines Stücks verwendet werden, in dem <Stück> im Titel, Interpret oder Album vorkommt.

source: Ap&pend a song:
de: Ein Stück &anhängen:

source: Use: append <term> (where <term> matches to artist, title or album)
de: Verwendung: append <Term> (wobei <Term> mit Interpret, Titel oder Album übereinstimmt)

source: Q&ueue a song:
de: Ein Stück &einreihen:

source: Use: queue <term> (where <term> matches to artist, title or album)
de: Verwendung: queue <Term> (wobei <Term> mit Interpret, Titel oder Album übereinstimmt)

source: P&ause:
de: &Pausieren:

source: S&top:
de: A&nhalten:

source: Previ&ous song:
de: &Vorheriges Stück:

source: &Next song:
de: &Nächstes Stück:

source: Set &volume:
de: &Lautstärke einstellen:

source: The numbers are automatically added at the end: Amarok:Volume=10
de: Die Nummern werden automatisch am Ende hinzugefügt: Amarok:Volume=10

source: &Increase volume by
de: Lautstärke er&höhen um

source: &Decrease volume by
de: Lautstärke &verringern um

source: &Mute:
de: &Stumm:

source: Quit player:
de: Medienspieler beenden:
