Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/kdeplasma-addons/plasma_applet_luna.po
Languages: de

source: The luna SVG file was not found
de: Die Luna-SVG-Datei kann nicht gefunden werden.

source: General
de: Allgemein

source: Full Moon
de: Vollmond

source: New Moon
de: Neumond

source: Waxing Crescent (New Moon was yesterday)
de: Zunehmende Mondsichel (gestern war Neumond)

source: First Quarter
de: Zunehmender Halbmond

source: Waxing Gibbous (Tomorrow is Full Moon)
de: Zunehmender Halbmond (morgen ist Vollmond)

source: Waning Gibbous (Yesterday was Full Moon)
de: Abnehmender Mond (gestern war Vollmond)

source: Last Quarter
de: Abnehmender Halbmond

source: Waning Crescent (Tomorrow is New Moon)
de: Abnehmende Mondsichel (morgen ist Neumond)

source: Show moon as seen in:
de: Mond anzeigen, wie er aussieht von:

source: Northern hemisphere
de: Nördlicher Hemisphäre

source: Southern hemisphere
de: Südlicher Hemisphäre
