Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/kdeplasma-addons/plasma_applet_incomingmsg.po
Languages: de

source: No new mail.
de: Keine neuen Nachrichten.

source: No new XChat messages.
de: Keine neuen Nachrichten in XChat.

source: No new Kopete messages.
de: Keine neuen Nachrichten in Kopete.

source: No new Pidgin messages.
de: Keine neuen Nachrichten in Pidgin.

source: You have a new qutIM message.
de: Sie haben eine neue Nachricht in qutIM.

source: No new qutIM messages.
de: Keine neuen Nachrichten in qutIM.

source: No running messaging apps found. Supported apps are %1, %2, %3, %4, %5.
de: Derzeit ist kein Nachrichten-Programm gestartet. Unterstützt werden %1, %2, %3, %4 und %5.

source: General
de: Allgemein

source: Your Evolution mail count has changed.
de: Die Anzahl Ihrer Mails in Evolution hat sich verändert.

source: Your KMail mail count has changed.
de: Die Anzahl Ihrer Mails in KMail hat sich verändert.

source: You have new XChat messages.
de: Sie haben neue Nachrichten in XChat.

source: You have new Kopete messages.
de: Sie haben neue Nachrichten in Kopete.

source: You have new Pidgin messages.
de: Sie haben neue Nachrichten in Pidgin.

source: Show these applications if they are running:
de: Diese Anwendungen anzeigen, sofern sie laufen:
