Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/kdeplasma-addons/plasma_applet_binaryclock.po
Languages: de

source: Appearance
de: Erscheinungsbild

source: Active LEDs:
de: Aktive LEDs:

source: Use custom color for active LEDs:
de: Eigene Farbe f端r aktive LEDs:

source: Inactive LEDs:
de: Inaktive LEDs:

source: Show the inactive LEDs
de: Inaktive LEDs anzeigen

source: Check this if you want to see the inactive LEDs.
de: Ist diese Einstellung aktiviert, werden inaktive LED-Bereiche angezeigt.

source: Show
de: Anzeigen

source: Use theme color
de: Farben des Designs verwenden

source: Use custom color for inactive LEDs:
de: Eigene Farbe f端r inaktive LEDs:

source: Grid:
de: Gitter:

source: Show the grid
de: Gitter anzeigen

source: Check this if you want to see a grid around leds.
de: Zeigt das Gitter an bzw. blendet es aus.

source: Use custom grid color:
de: Eigene Gitterfarbe:

source: Information
de: Informationen

source: Seconds:
de: Sekunden:

source: Show the seconds LEDs
de: Sekunden-LEDs anzeigen

source: Check this if you want to display seconds LEDs in order to see the seconds.
de: Ist diese Einstellung aktiviert, werden die Sekunden-LEDs angezeigt.
