Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/kdeplasma-addons/plasma_applet_icontasks.po
Languages: de

source: Style:
de: Stil:

source: Rotate vertical frames:
de: Rahmen drehen, wenn senkrecht:

source: <p>Controls whether the frames drawn around taskbar entries should be rotated 90-degrees counter-clockwise when the taskbar is in a vertical panel.</p>
de: <p>Legt fest, ob der Rahmen um die Fensterleisten-Symbole um 90° gedreht werden sollen, wenn sich die Fensterleiste in einer vertikalen Kontrollleiste befindet.</p>

source: Tooltips:
de: Kurzinfos:

source: Window preview size:
de: Fenster-Vorschaugröße:

source: <p>Controls the width of window previews with tooltips.</p>
de: <p>Steuert die Breite von Fenstervorschauen mit Kurzinfos.</p>

source: Always use launcher icons:
de: Immer Starter-Symbole verwenden:

source: <p>Enabling this item forces the icon for a running application to be the same as that used for the launcher. This resolves some oddities where the launcher icon is different from the application icon - as happens with LibreOffice.</p>
de: <p>Durch Aktivieren dieser Option wird als Symbol eines laufenden Programms die Verwendung des Starter-Symbols erzwungen. Dies löst bestimmte Merkwürdigkeiten, bei denen sich das Starter-Symbol vom Programmsymbol unterscheidet, wie beispielsweise bei LibreOffice.</p>

source: Scale icons to:
de: Symbole skalieren auf:

source: <p>Controls the scaling of the taskbar icon. When set to "Automatic", the taskbar will attempt to determine the optimal size.</p>
de: <p>Legt die Skalierung der Fensterleisten-Symbole fest. Ist sie auf „Automatisch“ gesetzt, wird die optimale Größe automatisch ermittelt.</p>

source: Spacing:
de: Abstand:

source: <p>Set the amount of extra spacing between items.</p>
de: <p>Zusätzlicher Abstand zwischen Elementen.</p>

source: Maximum rows:
de: Maximale Anzahl Zeilen:

source: <p>Controls the maximum number of rows (for a horizontal taskbar), or columns (for a vertical taskbar), that will be used.</p>
de: <p>Legt die maximale Anzahl an Zeilen (für horizontale Kontrollleisten) bzw. Spalten (für vertikale Kontrollleisten) fest.</p>

source: Sorting:
de: Sortierung:

source: Separator:
de: Trennzeichen:

source: <p>When enabled, and there is only 1 row/column, then a separator will be drawn between the launchers/tasks-with-launchers and non-launcher tasks.</p>
de: <p>Wenn diese Option aktiviert ist und lediglich eine Zeile/Spalte vorhanden ist, wird ein Trennstrich zwischen den Startern bzw. Programmen, die einen Starter haben, und Programmen ohne Starter angezeigt.</p>

source: Highlight windows:
de: Fenster hervorheben:

source: General
de: Allgemein

source: Show job progress on task icon:
de: Fortschritt von Vorgängen auf Symbolen anzeigen:

source: <p>When enabled, a progressbar will be drawn over the applications icons to represent its overall job progress.</p>
de: <p>Ist diese Option aktiviert, wird ein Fortschrittsbalken auf Programmsymbolen angezeigt, der den Gesamtfortschritt wiedergibt.</p>

source: Show control buttons on media player tooltips:
de: Wiedergabesteuerung auf Kurzinfos von Medienspielern anzeigen:

source: <p>When enabled - previous, play/pause, and next buttons will be shown in the tooltips for media players.</p>
de: <p>Ist diese Option aktiviert, werden Schaltflächen für vorheriges und nächstes Lied sowie Wiedergabe bzw. Pause in den Kurzinfos von Medienspielern angezeigt.</p>

source: Enable support for Unity features:
de: Unterstützung für Unity-Erweiterungen aktivieren:

source: <p>Toggles support for the Unity D-Bus API.</p>
de: <p>Aktiviert die Unterstützung für die Unity-D-Bus-Programmierschnittstelle.</p>

source: Show recent documents:
de: Zuletzt geöffnete Dokumente anzeigen:

source: <p>Toggles support for listing an application's recent documents in its popup menu.</p>
de: <p>Aktiviert die Anzeige der zuletzt verwendeten Dokumente eines Programms in dessen Kontextmenü.</p>

source: Group click action:
de: Aktion für Programmgruppierung:

source: <p>Configures what should occur when a task group is clicked.</p>
de: <p>Legt fest, was beim Klicken einer Programmgruppierung geschehen soll.</p>

source: Middle-click action:
de: Aktion für mittlere Maustaste:

source: Filters
de: Filter

source: Only show tasks from the current screen:
de: Nur Vorgänge des aktuellen Bildschirms anzeigen:

source: Only show tasks from the current desktop:
de: Nur Fenster der aktuellen Arbeitsfläche anzeigen:

source: Only show tasks from the current activity:
de: Nur Aufgaben der aktuellen Aktivität anzeigen:

source: Dock Manager
de: Dock-Verwaltung

source: Open
de: Öffnen

source: Sorry, failed to download %1
de: Das Herunterladen von %1 ist fehlgeschlagen

source: <p>Contents of metadata file are invalid.<ul>
de: <p>Der Inhalt der Metadatendatei ist ungültig.<ul>

source: <li><i>Name</i> field is missing.</li>
de: <li>Das Feld <i>Name</i> fehlt.</li>

source: <li><i>Description</i> field is missing.</li>
de: <li>Das Feld <i>Beschreibung</i> fehlt.</li>

source: <p>Metadata file does not contain <i>DockmanagerHelper</i> group.</p>
de: <p>Die Metadatendatei enthält keine Gruppe <i>DockmanagerHelper</i>.</p>

source: Invalid DockManager plugin.
de: Ungültiges Dock-Verwaltung-Modul.

source: <p>A Plugin named <b>%1</b> already exists.</p><p>Overwrite?</p>
de: <p>Ein Modul mit dem Namen <b>%1</b> existiert bereits.</p><p>Möchten Sie es überschreiben?</p>

source: Overwrite?
de: Überschreiben?

source: <p>Sorry, failed to remove previous plugin metadata file.</p><p><i>%1</i></p>
de: <p>Das Entfernen der Metadatendatei des vorherigen Moduls ist fehlgeschlagen.</p><p><i>%1</i></p>

source: <p>Sorry, failed to create scripts folder.</p><p><i>%1</i></p>
de: <p>Die Erstellung des Skriptordners ist fehlgeschlagen.</p><p><i>%1</i></p>

source: <p>Sorry, failed to create metadata folder.</p><p><i>%1</i></p>
de: <p>Die Erstellung des Metadatenordners ist fehlgeschlagen.</p><p><i>%1</i></p>

source: Sorry, failed to install script file.
de: Die Installation der Skriptdatei ist fehlgeschlagen.

source: Sorry, failed to install metadata file.
de: Die Installation der Metadatendatei ist fehlgeschlagen.

source: <li>Script file is missing.</li>
de: <li>Die Skriptdatei fehlt.</li>

source: <li>Metadata file is missing.</li>
de: <li>Die Metadatendatei fehlt.</li>

source: <p>Are you sure you wish to delete <b>%1</b></p><p><i>(%2)</i></p>
de: <p>Sind Sie sicher, dass Sie <b>%1</b> löschen möchten?</p><p><i>(%2)</i></p>

source: Remove Script
de: Skript entfernen

source: <p>Failed to delete the script file.</p><p><i>%1</i></p>
de: <p>Fehler beim Entfernen der Skriptdatei .</p><p><i>%1</i></p>

source: <tr><td align="right">Script File:</td><td>%1</td></tr>
de: <tr><td align="right">Skriptdatei:</td><td>%1</td></tr>

source: <tr><td align="right">Location:</td><td>%1</td></tr>
de: <tr><td align="right">Ort:</td><td>%1</td></tr>

source: <tr><td align="right">Application:</td><td>%1</td></tr>
de: <tr><td align="right">Programm:</td><td>%1</td></tr>

source: Enable DockManager Plugins
de: Dock-Verwaltung-Module aktivieren

source: Add
de: Hinzufügen

source: Remove
de: Entfernen

source: Recent Documents
de: Zuletzt geöffnete Dokumente

source: Appearance
de: Erscheinungsbild

source: Behaviour
de: Verhalten

source: Do Not Show
de: Nicht anzeigen

source: Show Immediately
de: Sofort anzeigen

source: Show After Delay
de: Verzögert anzeigen

source: Minimize/Restore
de: Minimieren/Wiederherstellen

source: Present Windows Effect
de: Effekt „Fenster zeigen“

source: Show Popup Menu
de: Aufklappmenü anzeigen

source: Use Workspace Theme
de: Arbeitsflächen-Design verwenden

source: Use Indicators
de: Indikatoren verwenden

source: Use Indicators & Colored Background
de: Indikatoren und farbigen Hintergrund verwenden

source: Never Show
de: Niemals anzeigen

source: Show When Required
de: Anzeigen wenn benötigt

source: Always Show
de: Immer anzeigen

source: Start New Instance
de: Neue Instanz starten

source: Close Application
de: Programm beenden

source: Move To Current Desktop
de: Auf aktuelle Arbeitsfläche verschieben

source: Nothing
de: Nichts

source: Automatic
de: Automatisch

source: Manually
de: Manuell

source: Alphabetically
de: Alphabetisch

source: By Desktop
de: Nach Arbeitsfläche

source: Unlock Launchers
de: Starter entsperren

source: Lock Launchers
de: Starter sperren

source: Refresh
de: Aktualisieren

source: (On All Desktops)
de: (Auf allen Arbeitsflächen)

# Which virtual desktop a window is currently on
source: (On %1)
de: (auf %1)

source: Plus %1 more...
de: Und %1 weitere ...
