Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/kdeplasma-addons/plasma_applet_fifteenPuzzle.po
Languages: de

source: Shuffle
de: Mischen

source: General
de: Allgemein

# The time since the puzzle started, in minutes and seconds
source: Time: %1:%2
de: Zeit: %1:%2

source: Shuffle Pieces
de: Steine Mischen

source: Configure Fifteen Puzzle
de: Fünfzehn Steine einrichten

source: Size:
de: Größe:

source: pieces wide
de: Teile groß

source: Use plain pieces:
de: Einfache Teile verwenden:

source: Use custom image:
de: Eigenes Bild verwenden:

source: Show numerals:
de: Zahlen anzeigen:
