Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/kdeplasma-addons/plasma_applet_weather.po
Languages: de

# Shown when you have not set a weather provider
source: Please Configure
de: Bitte einrichten

# High & Low temperature
source: H: %1 L: %2
de: H: %1 N: %2

# Low temperature
source: Low: %1
de: Niedrig: %1

# High temperature
source: High: %1
de: Hoch: %1

# Forecast period timeframe
source: 1 Day
de: 1 Tag

# windchill, unit
source: Windchill: %1
de: Gefühlte Temperatur: %1

# humidex, unit
source: Humidex: %1
de: Luftfeuchtigkeit: %1

# ground temperature, unit
source: Dewpoint: %1
de: Taupunkt: %1

# pressure, unit
source: Pressure: %1 %2
de: Luftdruck: %1 %2

# pressure tendency, rising/falling/steady
source: Pressure Tendency: %1
de: Luftdrucktendenz: %1

# distance, unit
source: Visibility: %1 %2
de: Sicht: %1 %2

# visibility from distance
source: Visibility: %1
de: Sicht: %1

# content of water in air
source: Humidity: %1%2
de: Feuchtigkeit: %1%2

# Not available
source: N/A
de: N/V

# Wind condition
source: Calm
de: Windstill

# winds exceeding wind speed briefly
source: Wind Gust: %1 %2
de: Windböen: %1 %2
