Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/kdeplasma-addons/plasma_applet_microblog.po
Languages: de

source: Login
de: Anmeldung

source: Password:
de: Passwort:

source: Appearance
de: Erscheinungsbild

source: Timeline size:
de: Größe der Zeitleiste:

source: Timeline refresh:
de: Aktualisierung der Zeitleiste:

source: Show friends:
de: Freunde anzeigen:

source: Service
de: Dienst

source: Username:
de: Benutzername:

source: Service URL:
de: Adresse des Dienstes:

source: Timeline
de: Zeitleiste

source: Replies
de: Antworten

source: Messages
de: Nachrichten

source: Failed to load twitter DataEngine
de: Twitter-Datentreiber kann nicht geladen werden.

source: Unable to load the widget
de: Miniprogramm kann nicht geladen werden

source: Your password is required.
de: Ihr Passwort ist erforderlich.

source: Your account information is incomplete.
de: Ihre Zugangsinformationen sind unvollständig.

source: Failed to access kwallet. Store password in config file instead?
de: KWallet ist nicht verfügbar. Soll das Passwort in der Einrichtungsdatei gespeichert werden?

source: Refreshing timeline...
de: Zeitleiste wird aktualisiert ...

source: 1 new tweet
de: %1 neuer Tweet

source: message
de: Nachricht

source: General
de: Allgemein

source: %1 character left
de: Ein Zeichen verbleibt

# Repeat of the post also called retweet
source: Repeat completed
de: Wiederholung abgeschlossen

source: Repeat failed
de: Wiederholung fehlgeschlagen

# %1 is a time string like '1 hour ago' - %2 is the name of a microblogging client
source: %1 from %2
de: %1 über %2

source: Less than a minute ago
de: Vor weniger als einer Minute

source: 1 minute ago
de: Vor einer Minute

source: Over an hour ago
de: Vor über einer Stunde

source: 1 hour ago
de: Vor einer Stunde
