Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/kdeplasma-addons/plasma_applet_knowledgebase.po
Languages: de

source: <i>Category: %1</i>
de: <i>Kategorie: %1</i>

source: <body><b>Question:</b> %1</body>
de: <body><b>Frage:</b> %1</body>

source: <body><b>Answer:</b> %1</body>
de: <body><b>Antwort:</b> %1</body>

source: <body><b>Not answered yet</b> </body>
de: <body><b>Noch keine Antwort</b></body>

source: Search Knowledge Base
de: Wissensdatenbank durchsuchen

source: one item, page %2/%3
de: Ein Element, Seite %2/%3

# General settings for the applet
source: General
de: Allgemein

source: <b>openDesktop Account</b>
de: <b>openDesktop-Benutzerkonto</b>

source: Register
de: Registrieren

source: <b>Display</b>
de: <b>Anzeigen</b>

source: Refresh interval:
de: Aktualisierungsintervall:
