Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/kdeplasma-addons/plasma_runner_kopete.po
Languages: de

# NAME OF TRANSLATORS
source: Your names
de: Frederik Schwarzer

# EMAIL OF TRANSLATORS
source: Your emails
de: schwarzer@kde.org

source: Searches your Kopete buddylist for contacts matching :q:.
de: Sucht in Ihrer Kopete-Kontaktliste nach Kontakten, die auf :q: passen.

source: Connect all Kopete accounts
de: Alle Kopete-Zugänge verbinden

source: Disconnect all Kopete accounts
de: Alle Kopete-Zugänge trennen

source: Set Kopete accounts to a status with an optional message
de: Kopete-Zugänge auf einen Status mit optionaler Nachricht stellen.

source: Set Kopete status message
de: Kopete-Statusnachricht einstellen

source: Set all accounts as online
de: Mit allen Zugängen „online“ gehen

source: Set all accounts as offline
de: Mit allen Zugängen „offline“ gehen

# The ': ' is used as a separator
source: Message: %1
de: Nachricht: %1

source: Set Status Message
de: Statusnachricht einstellen

source: Send message to %1
de: Nachricht an %1 senden

source: %1 Message: %2
de: %1 Nachricht: %2
