Repository: kolab-groupware/kde-l10n-de-4.13.0
Catalog: messages/kdeplasma-addons/plasma_applet_kdeobservatory.po
Languages: de

# Commit history for a given project %1
source: Commit History - %1
de: Commit-Verlauf – %1

source: Top Active Projects
de: Die aktivsten Projekte

source: Top Developers
de: Die aktivsten Entwickler

source: Commit History
de: Commit-Verlauf

source: Krazy Report
de: Krazy-Bericht

source: No active network connection
de: Keine aktive Netzwerkverbindung

source: Go to previous view
de: Zur vorherigen Ansicht wechseln

source: Go to next view
de: Zur nächsten Ansicht wechseln

source: Last update: %1 %2
de: Letzte Aktualisierung: %1 %2

# Global configuration options
source: General
de: Allgemein

source: Projects
de: Projekte

source: Views
de: Ansichten

source: Are you sure you want to remove project '%1'?
de: Sind Sie sicher, dass Sie das Projekt „%1“ entfernen möchten?

source: Remove project
de: Projekt entfernen

# Krazy report for a given project %1
source: Krazy Report - %1
de: Krazy-Bericht – %1

source: %2 %1 error
de: %2 %1 Fehler

source: Top Developers - %1
de: Die aktivsten Entwickler – %1

source: Activity Range
de: Aktivitäten-Zeitraum

source: &Full history
de: &Vollständiger Verlauf

source: &Past
de: Ve&rgangene

# noun, the 24-hour period
source: days
de: Tage

# The beginning of a range
source: Fro&m
de: V&on

# The end of a range
source: to
de: bis

source: &Enable automatic view change
de: &Automatisches Wechseln der Ansicht aktivieren

source: Change view every:
de: Ansicht wechseln alle:

source: hh 'Hours' mm 'Mins' ss 'Secs'
de: hh 'Stunden' mm 'Minuten' ss 'Sekunden'

source: Project name:
de: Projektname:

source: Commit subject:
de: Commit-Betreff:

source: <!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0//EN" "http://www.w3.org/TR/REC-html40/strict.dtd"> <html><head><meta name="qrichtext" content="1" /><style type="text/css"> p, li { white-space: pre-wrap; } </style></head><body style=" font-family:'Bitstream Vera Sans'; font-size:9pt; font-weight:400; font-style:normal;"> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-style:italic;">Prefix used for this project in kde-commits mailing list.</span></p> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-weight:600;">Ex:</span> KDE/kdebase/runtime/plasma/</p></body></html>
de: <!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0//EN" "http://www.w3.org/TR/REC-html40/strict.dtd"> <html><head><meta name="qrichtext" content="1" /><style type="text/css"> p, li { white-space: pre-wrap; } </style></head><body style=" font-family:'Bitstream Vera Sans'; font-size:9pt; font-weight:400; font-style:normal;"> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-style:italic;">Für dieses Projekt verwendete Präfix auf der Mailingliste „kde-commits“.</span></p> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-weight:600;">Zum Beispiel:</span> KDE/kdebase/runtime/plasma/</p></body></html>

source: Icon:
de: Symbol:

source: Krazy report:
de: Krazy-Bericht:

source: <!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0//EN" "http://www.w3.org/TR/REC-html40/strict.dtd"> <html><head><meta name="qrichtext" content="1" /><style type="text/css"> p, li { white-space: pre-wrap; } </style></head><body style=" font-family:'Bitstream Vera Sans'; font-size:9pt; font-weight:400; font-style:normal;"> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-style:italic;">Krazy report web address for this project.</span></p> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-weight:600;">Format:</span> http://www.englishbreakfastnetwork.org/krazy/<span style=" font-style:italic;">&lt;krazy-report&gt;</span> <span style=" font-weight:600;">or </span>http://www.englishbreakfastnetwork.org/krazy/index.php?<span style=" font-style:italic;">&lt;krazy-component-module&gt;</span></p> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-weight:600;">Ex:</span> http://www.englishbreakfastnetwork.org/krazy/<span style=" font-weight:600; font-style:italic;">reports/kde-4.x/kdebase-runtime/plasma</span>/<span style=" font-weight:600; font-style:italic;">index.html</span></p> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-weight:600;">or</span></p> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;">http://www.englishbreakfastnetwork.org/krazy/index.php?<span style=" font-weight:600; font-style:italic;">component=kde-4.x&amp;module=kdevelop</span></p> <p style="-qt-paragraph-type:empty; margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"></p></body></html>
de: <!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0//EN" "http://www.w3.org/TR/REC-html40/strict.dtd"> <html><head><meta name="qrichtext" content="1" /><style type="text/css"> p, li { white-space: pre-wrap; } </style></head><body style=" font-family:'Bitstream Vera Sans'; font-size:9pt; font-weight:400; font-style:normal;"> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-style:italic;">Web-Adresse des Krazy-Berichts für dieses Projekt.</span></p> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-weight:600;">Format:</span> http://www.englishbreakfastnetwork.org/krazy/<span style=" font-style:italic;">&lt;Krazy-Bericht&gt;</span> <span style=" font-weight:600;">oder </span>http://www.englishbreakfastnetwork.org/krazy/index.php?<span style=" font-style:italic;">&lt;Krazy-Komponente-Modul&gt;</span></p> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-weight:600;">Beispiel:</span> http://www.englishbreakfastnetwork.org/krazy/<span style=" font-weight:600; font-style:italic;">reports/kde-4.x/kdebase-runtime/plasma</span>/<span style=" font-weight:600; font-style:italic;">index.html</span></p> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-weight:600;">oder</span></p> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;">http://www.englishbreakfastnetwork.org/krazy/index.php?<span style=" font-weight:600; font-style:italic;">component=kde-4.x&amp;module=kdevelop</span></p> <p style="-qt-paragraph-type:empty; margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"></p></body></html>

source: Krazy file identifier:
de: Krazy-Datei-Identifizierer:

source: <!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0//EN" "http://www.w3.org/TR/REC-html40/strict.dtd"> <html><head><meta name="qrichtext" content="1" /><style type="text/css"> p, li { white-space: pre-wrap; } </style></head><body style=" font-family:'Bitstream Vera Sans'; font-size:9pt; font-weight:400; font-style:normal;"> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-style:italic;">Sub-string that must appear in files belonging to this project. Leave it blank if all files in Krazy report belong to this project or a component-module address was given.</span></p> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;">Ex: for a plasmoid in playground, <span style=" text-decoration: underline;">Krazy report</span> would be "playground/base/plasma" and <span style=" text-decoration: underline;">Krazy file identifier</span> would be "&lt;plasmoid-directory&gt;".</p></body></html>
de: <!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0//EN" "http://www.w3.org/TR/REC-html40/strict.dtd"> <html><head><meta name="qrichtext" content="1" /><style type="text/css"> p, li { white-space: pre-wrap; } </style></head><body style=" font-family:'Bitstream Vera Sans'; font-size:9pt; font-weight:400; font-style:normal;"> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-style:italic;">Teil-Zeichenkette, die in allen zum Projekt gehörenden Dateien enthalten sein muss. Lassen Sie den Eintrag leer, falls alle Dateien des Krazy-Berichts zu dem Projekt gehören oder wenn Sie eine Modul-Adresse angegeben haben.</span></p> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;">Beispiel: für ein Plasmoid in Playground ist der <span style=" text-decoration: underline;">Krazy-Bericht</span> „playground/base/plasma“ und der <span style=" text-decoration: underline;">Krazy-Datei-Identifizierer</span> wäre „&lt;plasmoid-directory&gt;“.</p></body></html>

source: Project
de: Projekt

source: Commit Subject
de: Commit-Betreff

source: Krazy File Identifier
de: Krazy-Datei-Identifizierer

source: &Add
de: &Hinzufügen

source: &Remove
de: &Entfernen

source: &Edit
de: &Bearbeiten

source: Active views:
de: Aktive Ansichten:

source: View Configuration
de: Ansichts-Einstellungen

source: View:
de: Ansicht:

source: Projects in view:
de: Projekte in der Ansicht:

source: &Check All
de: &Alle markieren

source: &Uncheck All
de: &Keine markieren
